{"word":"Andromeda","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アンドロメダ (ギリシア神話の王女)","english_definition":"(Greek mythology) A princess of Aethiopia, daughter of Cepheus and Cassiopeia, who was chained to a rock as a sacrifice to a sea monster but was rescued by Perseus.","examples":[{"sentence":"Andromeda was saved by Perseus.","translation":"アンドロメダはペルセウスによって救われた。"}],"collocations":["Andromeda myth","Perseus and Andromeda"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"アンドロメダ座 (北天の星座)","english_definition":"A constellation in the northern sky, named after the mythological princess.","examples":[{"sentence":"The Andromeda Galaxy is located in the Andromeda constellation.","translation":"アンドロメダ銀河はアンドロメダ座に位置する。"}],"collocations":["Andromeda constellation","locate Andromeda","observe Andromeda"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"アンドロメダ銀河 (銀河系の隣にある渦巻銀河)","english_definition":"A spiral galaxy, also known as Messier 31, located in the Andromeda constellation and being the closest major galaxy to the Milky Way.","examples":[{"sentence":"The Andromeda Galaxy is visible to the naked eye under dark skies.","translation":"アンドロメダ銀河は暗い空の下では肉眼で見える。"},{"sentence":"Scientists are studying the Andromeda Galaxy to learn more about galaxy formation.","translation":"科学者たちは銀河の形成についてより深く知るためにアンドロメダ銀河を研究している。"}],"collocations":["Andromeda Galaxy collision","observe Andromeda Galaxy","study Andromeda Galaxy","M31"],"synonyms":["M31","Messier 31"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek Ἀνδρομέδα (Androméda), from ἀνδρός (andrós, “of a man”) + μέδομαι (médomai, “to be mindful of, to think of”).","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈdrɒmɪdə/","syllables":"An-drom-e-da"},"inflection":{"notes":"Noun, plural: Andromedas"},"usage_notes":{"explanation":"'Andromeda' has three main meanings: a character in Greek mythology, a constellation named after her, and the galaxy located within that constellation. When referring to the galaxy, it's often called the 'Andromeda Galaxy' for clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw Andromeda last night with my telescope.","correct":"✓ I saw the Andromeda Galaxy last night with my telescope.","note":"To avoid ambiguity, specify 'Andromeda Galaxy' when referring to the galaxy, especially in contexts where the constellation or mythological figure might also be relevant."}],"priority":"★★☆"},"related_words":{"derivatives":["andromedan (adjective, noun)"],"phrases":["Andromeda Strain (Michael Crichton novel and film)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, except in scientific or mythological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Andromeda' is most commonly encountered in contexts related to astronomy (Andromeda Galaxy and Andromeda constellation) or Greek mythology (the princess Andromeda). Understanding the context is crucial to interpreting the intended meaning. It's less frequently used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The myth of **Andromeda** tells of a beautiful princess chained to a rock.","translation":"アンドロメダの神話は、岩に鎖でつながれた美しい王女について語っている。","type":"noun","meaning_category":"Greek mythology"},{"sentence":"The **Andromeda** constellation is visible in the northern hemisphere.","translation":"アンドロメダ座は北半球で見ることができる。","type":"noun","meaning_category":"Constellation"},{"sentence":"The **Andromeda Galaxy** is the closest large galaxy to our own.","translation":"アンドロメダ銀河は、我々の銀河に最も近い大きな銀河である。","type":"noun","meaning_category":"Galaxy"}]}