{"word":"anaphorical","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"照応的な、前方照応的な","english_definition":"Referring back to something already mentioned or known.","examples":[{"sentence":"'He' in the sentence 'John is here, and he is happy' is an anaphorical reference to John.","translation":"「ジョンがここにいる、そして彼は幸せだ」という文の「彼」は、ジョンへの照応的な参照である。"},{"sentence":"Anaphorical references are common in both spoken and written language.","translation":"照応的な参照は、話し言葉と書き言葉の両方で一般的である。"},{"sentence":"The pronoun 'it' can be an anaphorical reference to a previously mentioned noun phrase.","translation":"代名詞「それ」は、以前に言及された名詞句への照応的な参照となり得る。"}],"collocations":["anaphorical reference","anaphorical pronoun","anaphorical expression"],"synonyms":["referential","cross-referential","backward-referring"],"antonyms":["cataphoric"]}],"etymology":{"value":"From the Greek word 'anaphora' meaning 'a carrying back' or 'reference'. 'Ana-' means 'back' or 'again' and 'pherein' means 'to carry'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænəˈfɒrɪkəl/","syllables":"a-na-phor-i-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Anaphorical' describes a linguistic element (usually a pronoun or other referring expression) that refers back to a previously mentioned entity or concept in the discourse. This antecedent provides the meaning or reference for the anaphoric expression. Understanding anaphoric relationships is crucial for text comprehension.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is anaphoric.","correct":"✓ The word is an anaphoric expression.","note":"While 'anaphoric' is an adjective, it's better to use it to describe an expression or reference rather than a single word in isolation."}],"priority":"★★☆"},"related_words":{"derivatives":["anaphora (noun): the use of a word referring back to one previously used to avoid repetition.","anaphor (noun): an anaphoric expression."],"related_terms":["antecedent (noun): the noun or phrase that an anaphor refers to.","cataphora (noun): the use of a word or phrase that refers forward to another word or phrase later in the discourse."],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaphorical' is a term used in linguistics to describe how a word or phrase refers back to something that was mentioned earlier in a text or conversation. It helps avoid repetition and makes the text flow more smoothly. For example, in the sentence 'John arrived, and he sat down,' the word 'he' is anaphorical because it refers back to 'John.' Understanding anaphoric references is important for fully understanding complex texts."},"example_sentences":[{"sentence":"The student submitted his essay, but he forgot to include a bibliography; he will need to resubmit. The second 'he' is anaphorical.","translation":"学生はエッセイを提出したが、参考文献を含めるのを忘れた。彼は再提出する必要がある。二番目の「彼」は照応的である。","type":"adjective","meaning_category":"referring back"}]}