{"word":"paronomastically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"語呂合わせで、同音異義語を使って、言葉遊びで","english_definition":"In a manner involving paronomasia; using a play on words or puns.","examples":[{"sentence":"The comedian used words paronomastically to create humorous effects.","translation":"そのコメディアンはユーモラスな効果を生み出すために、語呂合わせを使って言葉を操った。"},{"sentence":"The poem relies on paronomastically linked phrases to develop its theme.","translation":"その詩は、テーマを展開するために、語呂合わせで関連付けられたフレーズに頼っている。"}],"collocations":["use words paronomastically","link phrases paronomastically"],"synonyms":["punningly","with wordplay","with a play on words","using puns"],"antonyms":["literally","directly","straightforwardly"]}],"etymology":{"value":"Derived from 'paronomastic', which comes from 'paronomasia'. 'Paronomasia' originates from Greek 'para-' (beside, near) + 'onoma' (name). Thus, it literally means 'beside the name', referring to words that sound alike but have different meanings.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌnɒməˈstɪkəli/","syllables":"pa-ro-no-mas-ti-cal-ly"},"inflection":{"notes":"This is an adverb and does not have different forms."},"usage_notes":{"explanation":"'Paronomastically' describes the manner in which someone uses words that sound alike but have different meanings to create a humorous or rhetorical effect. It is often used in literary analysis to describe the use of puns or wordplay in a text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke paronomastically, but no one understood his point.","correct":"✓ He spoke using puns, but no one understood his point.","note":"While 'paronomastically' is a correct term, it is not commonly used in everyday conversation. Using simpler terms like 'using puns' is often clearer."}],"priority":"★☆☆"},"related_words":{"derivatives":["paronomasia (noun: a play on words; a pun)","paronomastic (adjective: relating to paronomasia; using puns)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paronomastically' is a highly specialized term used to describe the use of puns or wordplay. It is rarely used in everyday conversation and is more commonly found in academic or literary contexts. Understanding the term requires a strong vocabulary and familiarity with rhetorical devices."},"example_sentences":[{"sentence":"The author cleverly employed words **paronomastically** to add layers of meaning to the text.","translation":"著者はテキストに多層的な意味を加えるために、言葉を巧みに語呂合わせで使った。","type":"adverb","meaning_category":"語呂合わせで"},{"sentence":"He explained the concept of puns by using examples **paronomastically**.","translation":"彼は語呂合わせの例を使って、ダジャレの概念を説明した。","type":"adverb","meaning_category":"言葉遊びで"}]}