{"word":"exsiccator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"デシケーター：乾燥器、乾燥瓶","english_definition":"A sealed container containing a desiccant, used for drying or keeping materials dry.","examples":[{"sentence":"The chemist placed the sample in the exsiccator to remove any moisture.","translation":"化学者は水分を取り除くために、サンプルをデシケーターに入れた。"},{"sentence":"An exsiccator is essential for storing hygroscopic substances.","translation":"デシケーターは吸湿性物質を保管するために不可欠である。"}],"collocations":["vacuum exsiccator","laboratory exsiccator"],"synonyms":["desiccator","drying cabinet","drying chamber"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'exsiccare', meaning 'to dry out'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeksɪˈkeɪtər/","syllables":"ex-sic-ca-tor"},"inflection":{"noun_plural":"exsiccators"},"usage_notes":{"explanation":"An exsiccator is a laboratory apparatus used to create and maintain a dry environment. It typically contains a desiccant such as silica gel or calcium chloride to absorb moisture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I put the liquid in the exsiccator.","correct":"✓ I put the solid sample in the exsiccator.","note":"Exsiccators are typically used for drying solid samples, not liquids."}],"priority":"★☆☆"},"related_words":{"derivatives":["exsiccate (verb: to dry out)","desiccant (noun: a drying agent)","desiccation (noun: the process of drying out)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exsiccator' is a technical term primarily used in chemistry and related fields. It refers to a specialized container used to maintain a dry environment for samples. Understanding its function requires familiarity with laboratory procedures and terminology."},"example_sentences":[{"sentence":"The newly synthesized compound was stored in an exsiccator to prevent degradation.","translation":"新しく合成された化合物は、劣化を防ぐためにデシケーターに保管された。","type":"general","meaning_category":"drying"},{"sentence":"A vacuum exsiccator was used to accelerate the drying process.","translation":"乾燥プロセスを加速するために、真空デシケーターが使用された。","type":"specific","meaning_category":"drying"}]}