{"word":"bugshas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of traditional Korean military uniform worn during the Joseon Dynasty, typically by soldiers or guards.","english_definition":"A type of traditional Korean military uniform worn during the Joseon Dynasty, typically by soldiers or guards.","examples":[{"sentence":"The soldiers wore bugshas as they guarded the palace gates.","translation":"兵士たちは宮殿の門を守る際にブグシャを着用していた。"}],"collocations":["wear a bugsha","Joseon Dynasty bugsha","military bugsha"],"synonyms":["gunbok (군복 - general term for military uniform)","jeonbok (전복 - similar type of military vest)"],"antonyms":[]}],"etymology":{"value":"Likely derived from Korean words relating to its construction or purpose. Further research needed for a definitive etymology.","priority":"low"},"pronunciation":{"ipa":"/puɡ.ʃa/","syllables":"bug-sha"},"inflection":{"noun_plural":"bugshas (English pluralization, Korean doesn't typically pluralize nouns this way)"},"usage_notes":{"explanation":"Bugshas were functional military garments, designed for mobility and protection. They are distinct from more formal court attire. They are often seen in historical dramas and depictions of the Joseon Dynasty.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The noble wore a bugsha.","correct":"The soldier wore a bugsha.","note":"Bugshas were primarily worn by military personnel, not nobles."}],"priority":"low"},"related_words":{"derivatives":[],"related_terms":["hanbok (한복 - general term for Korean traditional clothing)","gat (갓 - traditional Korean hat)","hwarangdo (화랑도 - ancient Korean warrior group)"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in historical contexts or discussions of Korean traditional clothing.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'bugsha' is relatively uncommon and specific to Korean historical contexts, particularly regarding military uniforms of the Joseon Dynasty. Understanding requires familiarity with Korean history and culture. The word is primarily encountered in academic texts, historical dramas, or museum descriptions."},"example_sentences":[{"sentence":"The museum displayed a well-preserved bugsha from the late Joseon period.","translation":"博物館には朝鮮時代後期の保存状態の良いブグシャが展示されていた。","type":"noun","meaning_category":"military uniform"},{"sentence":"In the historical drama, the royal guards were clad in colorful bugshas.","translation":"その時代劇では、王宮の警備兵たちが色鮮やかなブグシャを身に着けていた。","type":"noun","meaning_category":"military uniform"}]}