{"word":"palsgravine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プファルツ伯の妻、またはプファルツ伯領の女性相続人","english_definition":"The wife of a Count Palatine, or a female hereditary ruler of a County Palatine.","examples":[{"sentence":"The palsgravine was known for her intelligence and political acumen.","translation":"そのプファルツ伯爵夫人は、知性と政治的な洞察力で知られていた。"},{"sentence":"As a palsgravine, she ruled her lands with wisdom and fairness.","translation":"プファルツ伯領の女性相続人として、彼女は知恵と公平さをもって領地を統治した。"}],"collocations":["palsgravine of the Rhine","the young palsgravine","noble palsgravine"],"synonyms":["countess palatine"],"antonyms":[]}],"etymology":{"value":"Derived from 'palsgrave', referring to a Count Palatine, combined with the feminine suffix '-ine'. The term reflects the historical context of the Holy Roman Empire and its associated nobility.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːlzˌɡreɪvɪn/","syllables":"pals-gra-vine"},"inflection":{"noun_plural":"palsgravines"},"usage_notes":{"explanation":"The term 'palsgravine' is relatively rare and specific to historical contexts involving the Holy Roman Empire or regions where the title of Count Palatine was recognized. It is used to denote either the wife of a Count Palatine or a female ruler who inherited the title and associated lands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a palsgrave, ruling the land.","correct":"✓ She was a palsgravine, ruling the land.","note":"'Palsgrave' is the male title; 'palsgravine' is the female title or the wife of a palsgrave."}],"priority":"★☆☆"},"related_words":{"derivatives":["palsgrave","palatinate"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'palsgravine' is a highly specialized term used in historical contexts, specifically relating to the Holy Roman Empire and the title of Count Palatine. It refers to either the wife of a Count Palatine or a female ruler who inherited the title. Due to its rarity and specific historical usage, it is unlikely to be encountered outside of academic or specialized historical texts."},"example_sentences":[{"sentence":"The young palsgravine inherited vast lands and responsibilities.","translation":"その若いプファルツ伯爵夫人は、広大な土地と責任を受け継いだ。","type":"noun","meaning_category":"female ruler"},{"sentence":"As the palsgravine, she oversaw the administration of her territories.","translation":"プファルツ伯爵夫人として、彼女は領地の行政を監督した。","type":"noun","meaning_category":"wife of a count palatine"}]}