{"word":"uncollapsible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"折り畳み不可能、折り畳めない","english_definition":"Not able to be collapsed or folded; designed to remain in a fixed, expanded state.","examples":[{"sentence":"The new design features an uncollapsible frame for added safety.","translation":"その新しいデザインは、安全性を高めるために折り畳み不可能なフレームを特徴としています。"},{"sentence":"This type of container is uncollapsible, making it ideal for transporting liquids.","translation":"このタイプの容器は折り畳めないため、液体の輸送に最適です。"}],"collocations":["uncollapsible container","uncollapsible frame","uncollapsible structure"],"synonyms":["non-collapsible","rigid","fixed","inflatable (if referring to something that maintains shape when inflated)"],"antonyms":["collapsible","foldable"],"notes":"Often used to describe items like containers, frames, or structures that are designed to maintain their shape and cannot be easily folded or collapsed for storage."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the adjective 'collapsible'. 'Collapsible' comes from the verb 'collapse', meaning to fall down or inward suddenly; to fold into a more compact shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkəˈlæpsəbəl/","syllables":"un-col-laps-a-ble"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparative and superlative forms."},"usage_notes":{"explanation":"The term 'uncollapsible' is used to describe something that is designed to maintain its shape and cannot be easily folded or collapsed for storage or transport. It emphasizes the rigidity or fixed nature of the object.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The box is uncollapsing.","correct":"✓ The box is uncollapsible.","note":"'Uncollapsing' would imply something is actively resisting collapsing, whereas 'uncollapsible' describes a permanent property of not being able to collapse."}],"priority":"★★☆"},"related_words":{"derivatives":["collapsible (adjective: able to be collapsed)","collapse (verb: to fall down or inward; noun: an instance of collapsing)"],"antonyms":["foldable","collapsible"],"synonyms":["rigid","non-collapsible"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'uncollapsible' is a relatively uncommon adjective that describes something that cannot be folded or made smaller. It is formed by adding the prefix 'un-' to 'collapsible', which means able to be collapsed. Understanding the root word 'collapse' is helpful in understanding 'uncollapsible'. This word is more likely to appear in technical or descriptive contexts where the fixed nature of an object is important."},"example_sentences":[{"sentence":"The lifeguard used an uncollapsible rescue board to save the swimmer.","translation":"ライフガードは、折り畳み不可能な救助ボードを使って泳者を救助しました。","type":"adjective","meaning_category":"折り畳み不可能"},{"sentence":"For safety reasons, the stroller has an uncollapsible frame.","translation":"安全上の理由から、そのベビーカーは折り畳み不可能なフレームを備えています。","type":"adjective","meaning_category":"折り畳み不可能"}]}