{"word":"phrenopathic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"精神病質の、精神病的な","english_definition":"Relating to or characterized by phrenopathy (mental disease or disorder).","examples":[{"sentence":"The phrenopathic tendencies of the character were evident in their erratic behavior.","translation":"その登場人物の精神病質の傾向は、彼らの不安定な行動に明らかだった。"},{"sentence":"A phrenopathic condition can significantly impact an individual's ability to function normally.","translation":"精神病的な状態は、個人の正常な機能能力に著しい影響を与える可能性がある。"}],"collocations":["phrenopathic behavior","phrenopathic tendencies","phrenopathic condition"],"synonyms":["psychopathic","mentally ill","deranged","psychotic"],"antonyms":["sane","healthy-minded","normal","balanced"]}],"etymology":{"value":"From 'phreno-' (relating to the mind) + '-pathic' (relating to disease or suffering), derived from Greek 'phren' (mind) and 'pathos' (suffering).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfrɛnoʊˈpæθɪk/","syllables":"phre-no-path-ic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms (more phrenopathic, most phrenopathic) are possible but not common."},"usage_notes":{"explanation":"'Phrenopathic' is a relatively rare term, primarily used in medical or psychological contexts to describe conditions or behaviors associated with mental illness. It is more formal and technical than everyday terms like 'crazy' or 'insane.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phrenopathic patient was cured by a simple remedy.","correct":"✓ The patient with the phrenopathic condition was treated with medication and therapy.","note":"'Phrenopathic' describes a condition or tendencies, not a person. It's better to say 'a patient with a phrenopathic condition' rather than 'a phrenopathic patient'."}],"priority":"★☆☆"},"related_words":{"derivatives":["phrenopathy (noun: mental disease or disorder)","phrenopath (noun: a person suffering from mental illness - rare)"],"phrases":["phrenopathic personality","phrenopathic disorder"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phrenopathic' is a highly specialized and uncommon term, primarily used in formal medical or psychological contexts. Understanding requires familiarity with medical terminology and a sophisticated vocabulary. It is not suitable for general use."},"example_sentences":[{"sentence":"The doctor noted the patient's phrenopathic symptoms during the evaluation.","translation":"医師は評価中に患者の精神病的な症状に注目した。","type":"general","meaning_category":"mental illness"},{"sentence":"His phrenopathic behavior caused concern among his family members.","translation":"彼の精神病的な行動は家族の間で懸念を引き起こした。","type":"behavioral","meaning_category":"behavioral tendencies"}]}