{"word":"Gynostegia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) ガガイモ科の植物における、雄しべと雌しべが合着してできた構造。","english_definition":"(Botany) The structure formed by the fusion of the stamens and pistil in plants of the family Apocynaceae (formerly Asclepiadaceae).","examples":[{"sentence":"The gynostegia is a characteristic feature of milkweed flowers.","translation":"ずい柱はトウワタの花の特徴的な構造です。"}],"collocations":["milkweed gynostegia","Asclepiad gynostegia"],"synonyms":["corona","column"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gyno' (woman, referring to the pistil) and 'stegia' (covering, roof), referring to the covering of the pistil by the fused stamens.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒaɪnəˈstiːdʒiə/","syllables":"gy-no-ste-gi-a"},"inflection":{"noun_plural":"gynostegia"},"usage_notes":{"explanation":"The term 'gynostegia' is primarily used in botanical contexts when discussing the floral morphology of plants in the Apocynaceae family (formerly Asclepiadaceae). It refers to the unique structure formed by the fusion of the male and female reproductive parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gynostegium is found in all flowering plants.","correct":"✓ The gynostegium is found in Apocynaceae plants.","note":"The gynostegium is a specialized structure specific to certain plant families, particularly Apocynaceae."}],"priority":"★★☆"},"related_words":{"derivatives":["gynostemium","pollinium","translator"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'gynostegia' is a technical botanical term referring to the fused structure of stamens and pistil in Apocynaceae plants. Understanding this term requires a background in plant morphology and reproductive biology. It is rarely used outside of specialized botanical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The complex structure of the milkweed gynostegia facilitates pollination by insects.","translation":"トウワタのずい柱の複雑な構造は、昆虫による受粉を促進します。","type":"noun","meaning_category":"植物学"}]}