{"word":"codebooks","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"暗号書、暗号表","english_definition":"A book containing lists of codewords and their corresponding plain text meanings, used for encryption and decryption.","examples":[{"sentence":"During World War II, both sides used codebooks to transmit secret messages.","translation":"第二次世界大戦中、両陣営は暗号書を使って秘密のメッセージを送信した。"},{"sentence":"The enemy captured a codebook, giving them a significant advantage.","translation":"敵は暗号書を捕獲し、大きな優位性を得た。"},{"sentence":"Modern encryption methods have largely replaced the use of codebooks.","translation":"現代の暗号化手法は、暗号書の使用にほとんど取って代わっている。"}],"collocations":["capture a codebook","use a codebook","decipher a codebook","military codebook","diplomatic codebook"],"synonyms":["cipher book","code book","key book"],"antonyms":[]}],"etymology":{"value":"The term 'codebook' is a compound word formed from 'code' (a system of signals or symbols used to represent something else, especially for secrecy) and 'book' (a written or printed work consisting of pages glued or sewn together along one side and bound in covers).","priority":"★★★"},"pronunciation":{"ipa":"ˈkoʊdˌbʊks","syllables":"code-books"},"inflection":{"noun_plural":"codebooks"},"usage_notes":{"explanation":"Codebooks were a primary method of encryption before the advent of modern computing. They consist of a list of plain text words or phrases matched with corresponding codewords. Both sender and receiver need the same codebook to encrypt and decrypt messages. The security of the system relies on the secrecy of the codebook itself. If a codebook is compromised, all messages encrypted with it can be deciphered.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the codebook to code the message.","correct":"✓ He used the codebook to encode the message.","note":"'Code' as a verb means to write computer code. The correct verb for using a codebook to encrypt a message is 'encode'."},{"incorrect":"✗ The codebook was full of codes.","correct":"✓ The codebook was full of codewords.","note":"While technically correct, it's more precise to say the codebook contains 'codewords' (the encrypted representations) rather than just 'codes'."}],"priority":"★★☆"},"related_words":{"derivatives":["code","codeword","encode","decode","encryption","decryption","cipher"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency in general text; higher frequency in historical or military contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Codebooks' refers to physical books that list codewords and their meanings, used for encryption. This is a topic related to cryptography and historical methods of secure communication. Understanding requires some knowledge of how codes and ciphers work. The term is more common in historical contexts, such as discussions of military or diplomatic communications during wartime. It is less frequently used in modern contexts due to the prevalence of digital encryption methods."},"example_sentences":[{"sentence":"The spies relied on their codebooks to communicate securely.","translation":"スパイたちは安全に通信するために暗号書に頼った。","type":"general"},{"sentence":"The historian studied captured codebooks to understand enemy strategies.","translation":"歴史家は敵の戦略を理解するために捕獲された暗号書を研究した。","type":"historical"},{"sentence":"The security of the codebook was paramount; its loss would compromise all communications.","translation":"暗号書のセキュリティが最重要だった。その喪失はすべての通信を危険にさらすだろう。","type":"security"}]}