{"word":"directly-initiated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"直接開始された、直接的に開始された","english_definition":"Started or initiated in a direct manner, without intermediaries or intervening steps.","examples":[{"sentence":"The project was directly-initiated by the CEO.","translation":"そのプロジェクトはCEOによって直接開始された。"},{"sentence":"The research was a directly-initiated response to the crisis.","translation":"その研究は危機への直接的な対応として開始された。"},{"sentence":"The program is directly-initiated by the community members.","translation":"そのプログラムはコミュニティのメンバーによって直接開始される。"}],"collocations":["directly-initiated project","directly-initiated research","directly-initiated program","directly-initiated action","directly-initiated response"],"synonyms":["self-initiated","personally-initiated","immediately-initiated","promptly-initiated","unmediated"],"antonyms":["indirectly-initiated","mediated","intermediately-initiated"]}],"etymology":{"value":"The term is formed by combining \"directly\" (in a direct manner) with \"initiated\" (started or begun).","priority":"N/A"},"pronunciation":{"ipa":"/daɪˈrɛktli ɪˈnɪʃieɪtɪd/","syllables":"di-rect-ly i-ni-ti-at-ed"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (e.g., comparative, superlative)."},"usage_notes":{"explanation":"\"Directly-initiated\" describes something that is started or launched without any intervening steps or intermediaries. It emphasizes the immediate and personal nature of the initiation. It is often used in contexts where the source or cause of the initiation is significant.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The directly initiated project.","correct":"✓ The directly-initiated project.","note":"Hyphenate 'directly' and 'initiated' when used as a compound adjective before a noun."}],"priority":"N/A"},"related_words":{"derivatives":["directly (adverb)","initiate (verb)","initiation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively uncommon.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"directly-initiated\" is a relatively formal and specific term. It describes something that is started or begun in a direct and immediate way, without any intermediaries or intervening steps. It is often used in contexts where the source or cause of the initiation is important to emphasize. Because of its specific meaning and relatively low frequency, it is more likely to be encountered in formal or technical writing."},"example_sentences":[{"sentence":"The investigation was directly-initiated by the police chief after the incident.","translation":"その捜査は事件後、警察署長によって直接開始された。","type":"adjective","meaning_category":"直接開始された"},{"sentence":"The community garden was a directly-initiated effort by local residents.","translation":"そのコミュニティガーデンは地元の住民による直接的な取り組みとして始められた。","type":"adjective","meaning_category":"直接開始された"},{"sentence":"The new policy was a directly-initiated response to the growing concerns about environmental pollution.","translation":"その新しい政策は、環境汚染に対する懸念の高まりへの直接的な対応として開始された。","type":"adjective","meaning_category":"直接開始された"}]}