{"word":"PBC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Primary Biliary Cholangitis (原発性胆汁性胆管炎)","english_definition":"An autoimmune disease of the liver characterized by the slow progressive destruction of the small bile ducts of the liver, leading to cirrhosis.","examples":[{"sentence":"The patient was diagnosed with PBC after liver function tests and a biopsy.","translation":"患者は肝機能検査と生検の結果、PBCと診断された。"},{"sentence":"Ursodeoxycholic acid (UDCA) is a common treatment for PBC.","translation":"ウルソデオキシコール酸（UDCA）はPBCの一般的な治療法です。"}],"collocations":["diagnosed with PBC","treatment for PBC","PBC patient","early-stage PBC","advanced PBC"],"synonyms":["Primary Biliary Cirrhosis (古い名称)"],"antonyms":[]}],"etymology":{"value":"Abbreviation of Primary Biliary Cholangitis. The name was changed from Primary Biliary Cirrhosis to Primary Biliary Cholangitis to reflect the fact that cirrhosis is not always present, especially in early stages of the disease.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpiːˌbiːˈsiː/","syllables":"P-B-C"},"inflection":{"notes":"It is a noun, so pluralization is not common. When referring to multiple instances, it might be used as 'PBC cases' or 'patients with PBC'"},"usage_notes":{"explanation":"PBC is a specific medical term referring to a chronic liver disease. It is important to use the full name 'Primary Biliary Cholangitis' or the abbreviation 'PBC' in medical contexts. The older term 'Primary Biliary Cirrhosis' is now discouraged.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has PBC cirrhosis.","correct":"✓ He has PBC. / ✓ He has cirrhosis due to PBC.","note":"PBC itself can lead to cirrhosis, so saying 'PBC cirrhosis' is redundant. It's better to say 'He has PBC' or specify that the cirrhosis is a result of PBC."}],"priority":"★★☆"},"related_words":{"derivatives":["cholangitis","cirrhosis","autoimmune disease","ursodeoxycholic acid (UDCA)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Medical terminology)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"PBC, or Primary Biliary Cholangitis, is a medical term for a chronic liver disease. It's an autoimmune condition where the small bile ducts in the liver are slowly destroyed. This can eventually lead to cirrhosis. If you encounter this term, it's likely in a medical context, such as a doctor's office or a medical article. The treatment often involves medication like ursodeoxycholic acid (UDCA). It's important to note that the name was changed from Primary Biliary Cirrhosis to better reflect the disease process, as cirrhosis isn't always present, especially in the early stages."},"example_sentences":[{"sentence":"The doctor suspected PBC based on the patient's elevated liver enzymes.","translation":"医師は患者の肝酵素の上昇からPBCを疑った。","type":"medical","meaning_category":"diagnosis"},{"sentence":"A liver biopsy confirmed the diagnosis of PBC.","translation":"肝生検によりPBCの診断が確定した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"The patient is being monitored regularly for progression of PBC.","translation":"患者はPBCの進行を定期的に監視されている。","type":"medical","meaning_category":"monitoring"}]}