{"word":"Westernophobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"西洋恐怖症、西洋嫌悪症：西洋文化、西洋人、または西洋諸国に対する恐怖、嫌悪、または不信感。","english_definition":"Fear, dislike, or distrust of Western culture, Westerners, or Western countries.","examples":[{"sentence":"Some critics argue that certain anti-globalization movements are rooted in Westernophobia.","translation":"一部の批評家は、特定の反グローバリゼーション運動は西洋恐怖症に根ざしていると主張している。"},{"sentence":"The government denied accusations of promoting Westernophobia through its policies.","translation":"政府は、その政策を通じて西洋恐怖症を助長しているという告発を否定した。"},{"sentence":"Westernophobia can manifest in various forms, including cultural criticism and political opposition.","translation":"西洋恐怖症は、文化批判や政治的反対など、さまざまな形で現れる可能性がある。"}],"collocations":["anti-Western sentiment (反西洋感情)","cultural Westernophobia (文化的な西洋恐怖症)","political Westernophobia (政治的な西洋恐怖症)","media portrayal of Westernophobia (メディアによる西洋恐怖症の描写)"],"synonyms":["anti-Westernism","Occidentophobia"],"antonyms":["Westernophilia","Occidentophilia"],"related_terms":["xenophobia","cultural bias","ethnocentrism"]}],"etymology":{"value":"'Western'（西洋の）と 'phobia'（恐怖症）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌwɛstərnoʊˈfoʊbiə/","syllables":"Wes-tern-o-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Westernophobiaは、西洋文化や西洋人に対する否定的な感情を表す言葉です。この感情は、文化的な違い、歴史的な出来事、政治的な対立など、さまざまな要因から生じる可能性があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He has a Westernophobia because he likes Asian culture.","correct":"He dislikes Western culture because he likes Asian culture.","note":"西洋恐怖症は単に西洋文化が好きではないというだけでなく、それに対する恐怖や嫌悪感を含むため、文脈によってはより強い表現が必要となる。"}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Westernophobia' is a complex term referring to the fear, dislike, or distrust of Western culture, people, or countries. It's often used in discussions about cultural and political relations between the West and other parts of the world. Understanding this term requires awareness of historical and social contexts that contribute to such negative sentiments."},"example_sentences":[{"sentence":"The article discussed the rise of Westernophobia in certain regions due to historical grievances.","translation":"その記事は、歴史的な不満のために特定の地域で西洋恐怖症が高まっていることについて論じた。","type":"general","meaning_category":"General use"},{"sentence":"Some scholars argue that Westernophobia is a reaction to Western cultural imperialism.","translation":"一部の学者は、西洋恐怖症は西洋の文化帝国主義への反発であると主張している。","type":"academic","meaning_category":"Academic discussion"},{"sentence":"The film explores themes of Westernophobia through the eyes of a protagonist from a non-Western country.","translation":"その映画は、西洋以外の国の主人公の目を通して西洋恐怖症のテーマを探求している。","type":"cultural","meaning_category":"Cultural context"}]}