{"word":"pseudobankrupt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who fraudulently declares bankruptcy in order to avoid paying debts.","english_definition":"A person who fraudulently declares bankruptcy in order to avoid paying debts.","examples":[{"sentence":"The pseudobankrupt was eventually caught and charged with fraud.","translation":"その偽装倒産者は最終的に捕まり、詐欺罪で起訴された。"}],"collocations":["declare pseudobankruptcy","accuse of being a pseudobankrupt"],"synonyms":["fraudulent bankrupt","sham bankrupt"],"antonyms":[]}],"etymology":{"value":"The word is a combination of \"pseudo-\", meaning false or fake, and \"bankrupt\", referring to someone who is legally declared unable to pay their debts.","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdəʊˈbæŋkrʌpt","syllables":"pseu-do-bank-rupt"},"inflection":{"noun_plural":"pseudobankrupts"},"usage_notes":{"explanation":"This term is often used in legal and financial contexts to describe someone who is intentionally deceiving creditors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was a pseudobankrupt, so he didn't have to pay taxes.","correct":"He was a pseudobankrupt, so he was charged with fraud for illegally avoiding his debts.","note":"Pseudobankruptcy is illegal and results in charges, not tax avoidance."}],"priority":"★★★"},"related_words":{"derivatives":["pseudobankruptcy"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pseudobankrupt' is a specialized term, primarily used in legal and financial discussions. It describes someone who falsely claims bankruptcy to evade debt obligations. Its use is infrequent in general conversation, making it suitable for advanced learners or those in related professional fields."},"example_sentences":[{"sentence":"The investigation revealed that the company owner was a pseudobankrupt who had transferred assets to offshore accounts.","translation":"調査により、その会社オーナーが資産をオフショア口座に移転した偽装倒産者であることが明らかになった。","type":"noun","meaning_category":"fraudulent bankruptcy"},{"sentence":"The court ruled that the debtor was a pseudobankrupt and ordered the seizure of all remaining assets.","translation":"裁判所は、債務者が偽装倒産者であると判断し、残りのすべての資産の差し押さえを命じた。","type":"noun","meaning_category":"fraudulent bankruptcy"}]}