{"word":"neurodivergent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"神経多様性である、神経発達の特性が多数派とは異なる","english_definition":"Differing in neurological or developmental function from what is considered typical or neurotypical.","examples":[{"sentence":"He identifies as neurodivergent.","translation":"彼は自身を神経多様性であると認識しています。"},{"sentence":"The company is trying to create a more inclusive environment for neurodivergent employees.","translation":"その会社は、神経多様性を持つ従業員のためにより包括的な環境を作ろうとしています。"},{"sentence":"Neurodivergent individuals may have unique strengths and challenges.","translation":"神経多様性を持つ人々は、独自の強みと課題を持っている可能性があります。"}],"collocations":["neurodivergent individual","neurodivergent employee","neurodivergent student","neurodivergent condition","neurodivergent community","neurodivergent traits"],"synonyms":["neurodiverse"],"antonyms":["neurotypical"]},{"part_of_speech":"noun","definition":"神経多様性を持つ人","english_definition":"A person whose neurological or developmental function differs from what is considered typical or neurotypical.","examples":[{"sentence":"Neurodivergents often face stigma and misunderstanding.","translation":"神経多様性を持つ人々は、しばしば偏見や誤解に直面します。"},{"sentence":"The conference aims to support neurodivergents and their families.","translation":"その会議は、神経多様性を持つ人々およびその家族を支援することを目的としています。"}],"collocations":["support neurodivergents","understand neurodivergents","advocate for neurodivergents"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Neuro-' refers to the nervous system, and 'divergent' means differing or deviating from a standard. The term was coined in the late 1990s by sociologist Judy Singer, who sought a more positive and inclusive way to describe conditions like autism.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjʊəroʊdaɪˈvɜːrdʒənt/","syllables":"neu-ro-di-ver-gent"},"inflection":{"notes":"The noun form is often used as a collective plural (neurodivergents)."},"usage_notes":{"explanation":"'Neurodivergent' is a term used to describe individuals whose brain functions and processes differ from the majority ('neurotypical' individuals). It encompasses a range of conditions, including autism, ADHD, dyslexia, dyspraxia, Tourette's syndrome, and others. The term emphasizes that these differences are natural variations in the human genome, rather than deficits or disorders. The neurodiversity movement advocates for acceptance, inclusion, and celebration of these differences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is neurodivergence.","correct":"✓ He is neurodivergent.","note":"'Neurodivergence' is a noun referring to the state of being neurodivergent, while 'neurodivergent' is the adjective describing the person. Use the adjective to describe the person directly."},{"incorrect":"✗ Neurodivergent people are always disabled.","correct":"✓ Neurodivergent people may face challenges, but they also have unique strengths.","note":"Neurodivergence is not inherently a disability. While some neurodivergent individuals may experience disabilities, the term itself simply refers to differences in brain function."}],"priority":"★★☆"},"related_words":{"derivatives":["neurodivergence (noun)","neurodiversity (noun)","neurotypical (adjective)","neurotypically (adverb)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Increasing in frequency, particularly in discussions about inclusivity and disability rights.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neurodivergent' is a term used to describe people whose brains work differently from what is considered typical. This includes conditions like autism, ADHD, and dyslexia. Instead of seeing these differences as problems, the term 'neurodivergent' emphasizes that they are natural variations in how people's brains can function. It's important to use this term respectfully and understand that neurodivergent individuals have unique strengths and challenges."},"example_sentences":[{"sentence":"Many **neurodivergent** students benefit from accommodations in the classroom.","translation":"多くの神経多様性の学生は、教室での配慮から恩恵を受けています。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The company values the unique perspectives that **neurodivergent** employees bring to the team.","translation":"その会社は、神経多様性の従業員がチームにもたらす独自の視点を評価しています。","type":"adjective","meaning_category":"descriptive"},{"sentence":"It's important to create a society where **neurodivergents** are accepted and supported.","translation":"神経多様性を持つ人々が受け入れられ、支援される社会を創造することが重要です。","type":"noun","meaning_category":"group identity"}]}