{"word":"kepatutan","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"kesesuaian; kelayakan; keadaan yang pantas (sesuai, layak)","english_definition":"appropriateness; suitability; fitness; the state of being proper (suitable, fit)","examples":[{"sentence":"Dia mempertimbangkan kepatutan pakaian itu untuk acara resmi.","translation":"He considered the appropriateness of the clothing for the formal event."},{"sentence":"Kepatutan tindakan tersebut dipertanyakan oleh banyak orang.","translation":"The suitability of the action was questioned by many people."},{"sentence":"Kita harus menjaga kepatutan dalam berbicara kepada orang yang lebih tua.","translation":"We must maintain propriety when speaking to older people."}],"collocations":["menjaga kepatutan","mempertimbangkan kepatutan","kepatutan tindakan","kepatutan pakaian","kepatutan ucapan"],"synonyms":["kesesuaian","kelayakan","keselarasan","keharmonisan","keserasian","kepantasan","kesopanan"],"antonyms":["ketidakpatutan","ketidaklayakan","ketidaksesuaian","kecacatan","kejanggalan"]}],"etymology":{"value":"Dibentuk dari kata dasar 'patut' (sesuai, layak) dengan awalan 'ke-' dan akhiran '-an'.","priority":"N/A"},"pronunciation":{"ipa":"/kə.pa.tu.tan/","syllables":"ke-pa-tut-an"},"inflection":{"notes":"Kata benda (noun)."},"usage_notes":{"explanation":"'Kepatutan' merujuk pada kualitas atau keadaan yang sesuai dengan norma, aturan, atau harapan yang berlaku. Ini mencakup aspek kesopanan, kelayakan, dan kesesuaian dalam berbagai konteks, seperti perilaku, pakaian, atau tindakan.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Dia tidak memiliki kepatutan untuk menjadi pemimpin.","correct":"Dia tidak memiliki kelayakan untuk menjadi pemimpin.","note":"Dalam konteks ini, 'kelayakan' lebih tepat daripada 'kepatutan' untuk menunjukkan kemampuan atau kualifikasi."}],"priority":"N/A"},"related_words":{"derivatives":["patut","mematutkan","sepatutnya"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"frequency_google_ngram":"Moderate frequency (not a very common word, but used in formal contexts)","priority":"N/A"},"readability_explanation":{"level":"Intermediate","text":"'Kepatutan' adalah kata yang lebih formal dan abstrak yang berarti 'kesesuaian' atau 'kelayakan'. Kata ini sering digunakan dalam konteks yang berkaitan dengan norma sosial, etika, atau aturan yang berlaku. Memahami kata ini membantu dalam memahami teks yang lebih formal atau akademis."},"example_sentences":[{"sentence":"Penting untuk mempertimbangkan kepatutan setiap keputusan yang kita ambil.","translation":"It is important to consider the appropriateness of every decision we make.","type":"noun","meaning_category":"kesesuaian"},{"sentence":"Kepatutan berpakaian di tempat ibadah harus diperhatikan.","translation":"The appropriateness of dress in places of worship should be observed.","type":"noun","meaning_category":"kelayakan"},{"sentence":"Dia selalu menjaga kepatutan dalam berbicara, bahkan dalam situasi yang sulit.","translation":"He always maintains propriety in his speech, even in difficult situations.","type":"noun","meaning_category":"keadaan yang pantas"}]}