{"word":"Coopting","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(他動詞)取り込む、抱き込む、取り上げて利用する、乗っ取る","english_definition":"To adopt (an idea or policy) for one's own use. To assimilate, appropriate, or take over. To win over to one's own side by bribery or other means.","examples":[{"sentence":"The activist group accused the company of co-opting their slogans for marketing purposes.","translation":"活動家グループは、その会社がマーケティング目的で自分たちのスローガンを盗用していると非難した。"},{"sentence":"The government tried to co-opt the leaders of the protest movement by offering them positions in the administration.","translation":"政府は、抗議運動の指導者たちに政権内の地位を提供することで、彼らを抱き込もうとした。"},{"sentence":"The software company was accused of co-opting open-source code without proper attribution.","translation":"そのソフトウェア会社は、適切な表示なしにオープンソースコードを盗用したとして非難された。"}],"collocations":["co-opt a strategy","co-opt an idea","co-opt a movement","co-opt a slogan","co-opt someone's work"],"synonyms":["appropriate","adopt","assimilate","take over","usurp","win over","recruit"],"antonyms":["reject","refuse","decline","resist"]}],"etymology":{"value":"The word 'co-opt' comes from the Latin 'co-optare,' meaning 'to choose together' or 'to elect as a colleague.' It originally referred to the process of selecting new members to a group by the existing members. Over time, its meaning broadened to include the appropriation or assimilation of ideas or policies.","priority":"★★★"},"pronunciation":{"ipa":"/koʊˈɒptɪŋ/","syllables":"co-opt-ing"},"inflection":{"verb_forms":{"present_simple":["co-opt","co-opts"],"past_simple":"co-opted","past_participle":"co-opted","present_participle":"coopting"}},"usage_notes":{"explanation":"'Co-opting' implies taking something, whether it's an idea, a strategy, or even a person, and using it for one's own purposes, often without proper credit or with the intent of neutralizing opposition. It can have negative connotations, suggesting unethical or manipulative behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is cooperating the activist's ideas.","correct":"✓ The company is co-opting the activist's ideas.","note":"'Co-opting' means appropriating or taking over, while 'cooperating' means working together. They have different meanings and should not be confused."}],"priority":"★☆☆"},"related_words":{"derivatives":["co-opt (verb)","co-option (noun)","co-optive (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'co-opting' refers to the act of adopting or appropriating something, such as an idea, strategy, or technology, for one's own use, often without permission or proper acknowledgment. It often carries a negative connotation, suggesting that the act is manipulative or unethical. It is more common in academic, political, and business contexts."},"example_sentences":[{"sentence":"By co-opting the language of social justice, the corporation hoped to improve its public image.","translation":"その企業は、社会正義の言葉を盗用することで、世間のイメージを向上させようと目論んだ。","type":"verb","meaning_category":"取り込む"},{"sentence":"The politician was criticized for co-opting the grassroots movement's agenda.","translation":"その政治家は、草の根運動のアジェンダを盗用したとして批判された。","type":"verb","meaning_category":"乗っ取る"},{"sentence":"Many artists feel that their work is being co-opted by commercial interests.","translation":"多くのアーティストは、自分たちの作品が商業的な利益のために利用されていると感じている。","type":"verb","meaning_category":"利用する"}]}