{"word":"manar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインドネシア、マレーシアで使用される) 伝統的な計量単位、特に米やその他の穀物の量を測る際に用いられる。","english_definition":"(Primarily used in Indonesia and Malaysia) A traditional unit of measurement, especially for measuring quantities of rice or other grains.","examples":[{"sentence":"Harga beras itu lima ribu rupiah per manar.","translation":"その米の価格は1マナルあたり5千ルピアです。","note":"(Indonesian example)"},{"sentence":"Satu manar beras cukup untuk memberi makan keluarga selama seminggu.","translation":"1マナルの米は家族を1週間養うのに十分です。","note":"(Indonesian example)"}],"collocations":["jual manar (マナルで売る)","beli manar (マナルで買う)","satu manar beras (1マナルの米)"],"synonyms":["cupak","gantang"],"antonyms":[]}],"etymology":{"value":"語源は不明。インドネシアやマレーシアの地域言語に由来すると考えられる。","priority":"☆☆☆"},"pronunciation":{"notes":"発音は地域によって異なる可能性があります。"},"inflection":{"notes":"複数形は通常、単数形と同じ形を使用します。"},"usage_notes":{"explanation":"「manar」は現代ではあまり一般的ではなく、特に都市部ではキログラムなどのメートル法単位に置き換えられています。しかし、農村部や伝統的な市場では、依然として使用されている場合があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Please measure the rice in kilograms, not manars.","correct":"✓ Please measure the rice in kilograms.","note":"現代的な文脈では、キログラムを使用するのが一般的です。"},{"incorrect":"✗ Manar is a standard international unit of measurement.","correct":"✓ Manar is a traditional unit of measurement used in some parts of Southeast Asia.","note":"Manarは国際的な標準単位ではありません。"}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"notes":"低頻度。主にインドネシアやマレーシアの特定の地域で使用されます。"},"readability_explanation":{"level":"C2","text":"「manar」は、インドネシアやマレーシアの一部地域で使用される伝統的な計量単位であり、現代の標準的な計量システムでは一般的ではありません。そのため、この単語に出会うのは、伝統的な文化や歴史に関する文脈に限られる可能性が高いです。この単語を理解するには、東南アジアの地域文化や歴史に関する知識が必要となる場合があります。"},"example_sentences":[{"sentence":"Petani itu menjual hasil panennya dalam satuan manar di pasar tradisional.","translation":"その農家は伝統的な市場で収穫物をマナル単位で売っています。","type":"noun","meaning_category":"計量単位"},{"sentence":"Harga satu manar jagung lebih murah daripada harga satu kilogram.","translation":"1マナルのトウモロコシの価格は1キログラムの価格よりも安いです。","type":"noun","meaning_category":"計量単位"}]}