{"word":"adulterations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 不純物の混入、品質の低下、不正な混ぜ物","english_definition":"(plural) The act of adulterating; the state of being adulterated; something that adulterates or corrupts.","examples":[{"sentence":"The adulterations of food products are a serious concern for public health.","translation":"食品の品質低下は、公衆衛生にとって深刻な懸念事項です。"},{"sentence":"The report detailed the various adulterations found in the imported goods.","translation":"報告書は、輸入品に見られた様々な品質低下について詳述しました。"},{"sentence":"These adulterations significantly reduced the effectiveness of the medicine.","translation":"これらの不純物の混入は、薬の有効性を著しく低下させました。"}],"collocations":["food adulterations (食品の品質低下)","drug adulterations (薬物の品質低下)","chemical adulterations (化学物質の品質低下)"],"synonyms":["contaminations","impurities","debasements","corruptions","pollutions"],"antonyms":["purifications","refinements","improvements"]}],"etymology":{"value":"Late Middle English: from Latin adulteration-, from the verb adulterare, from adulter 'adulterer'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌdʌltəˈreɪʃənz/","syllables":"a-dul-te-ra-tions"},"inflection":{"noun_plural":"adulterations"},"usage_notes":{"explanation":"\"Adulterations\" refers specifically to the process or result of making something impure or of lower quality by adding extraneous, often inferior, substances. It often implies a deliberate act to deceive or defraud, especially in the context of food, drugs, or other commercial products. The singular form, \"adulteration,\" refers to the act or instance of adulterating.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The adulterations is a problem.","correct":"✓ Adulteration is a problem.","note":"\"Adulteration\" (singular) should be used as the subject when referring to the general act or process. \"Adulterations\" (plural) refers to specific instances or types of adulteration."},{"incorrect":"✗ The adulterations improved the product.","correct":"✓ The adulterations degraded the product.","note":"Adulterations always imply a negative impact on quality or purity."}],"priority":"★★☆"},"related_words":{"derivatives":["adulterate (verb: 品質を低下させる、混ぜ物をする)","adulterated (adjective: 品質が低下した、混ぜ物をされた)","adulterator (noun: 品質を低下させる人、混ぜ物をする人)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Adulterations\" is a formal term referring to instances where something has been made impure or of lower quality by adding foreign substances. It's often used in legal, scientific, or technical contexts when discussing the quality and purity of products, especially food and drugs. Understanding this word requires a good grasp of vocabulary related to quality control, manufacturing, and regulation."},"example_sentences":[{"sentence":"The food inspector found several instances of **adulterations** in the spices.","translation":"食品検査官は、スパイスにいくつかの品質低下の事例を発見しました。","type":"noun","meaning_category":"不純物の混入"},{"sentence":"The **adulterations** in the fuel caused the engine to malfunction.","translation":"燃料の品質低下は、エンジンの誤動作を引き起こしました。","type":"noun","meaning_category":"品質の低下"},{"sentence":"The company was fined for the **adulterations** of their milk products.","translation":"その会社は、牛乳製品の品質低下により罰金を科せられました。","type":"noun","meaning_category":"不正な混ぜ物"}]}