{"word":"noncanonical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"正統的でない、規範的でない、標準的でない","english_definition":"Not conforming to or in accordance with canon law, established doctrine, or accepted standards.","examples":[{"sentence":"The author presented a noncanonical interpretation of the text.","translation":"著者はそのテキストの非正統的な解釈を提示した。"},{"sentence":"The artist's noncanonical approach to painting challenged traditional norms.","translation":"その芸術家の絵画に対する非規範的なアプローチは、伝統的な規範に挑戦した。"},{"sentence":"This noncanonical version of the story is considered apocryphal.","translation":"この物語の非正統的な版は、偽典とみなされている。"}],"collocations":["noncanonical interpretation","noncanonical approach","noncanonical text","noncanonical status","noncanonical form"],"synonyms":["unorthodox","heterodox","unconventional","irregular","nonstandard"],"antonyms":["canonical","orthodox","conventional","standard","regular"]}],"etymology":{"value":"'Non-' (not) + 'canonical' (relating to a canon or standard).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkəˈnɒnɪkəl/","syllables":"non-ca-non-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., 'more noncanonical', 'most noncanonical')."},"usage_notes":{"explanation":"'Noncanonical' is used to describe something that deviates from an accepted or established set of rules, principles, or standards. It often implies a deviation from what is considered orthodox or traditional. The term can be applied in various fields, including religion, literature, art, and mathematics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The canonical version is more interesting than the noncanonical.","correct":"✓ The noncanonical version is more interesting than the canonical.","note":"Ensure the context supports the use of 'noncanonical'. It should be used when describing something that intentionally or unintentionally deviates from established norms, not simply as a synonym for 'less interesting'."}],"priority":"★★☆"},"related_words":{"derivatives":["noncanonically (adverb)"],"phrases":["noncanonical literature","noncanonical art","noncanonical mathematics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'noncanonical' is a formal term used to describe something that does not conform to established rules, standards, or doctrines. It is often used in academic or specialized contexts, such as literature, art, or religion, to refer to works or interpretations that are outside the accepted canon. Understanding the term requires familiarity with the concept of a 'canon' as a set of authoritative or widely accepted works or principles.","priority":"★★☆"},"example_sentences":[{"sentence":"The scholar explored noncanonical sources to gain a broader understanding of the historical period.","translation":"その学者は、歴史的時代をより広く理解するために、非正統的な資料を調査した。","type":"general","meaning_category":"general"},{"sentence":"The film presented a noncanonical view of the superhero's origin story.","translation":"その映画は、スーパーヒーローのオリジンストーリーの非規範的な見解を提示した。","type":"general","meaning_category":"general"},{"sentence":"Her noncanonical approach to data analysis yielded unexpected results.","translation":"彼女のデータ分析に対する非規範的なアプローチは、予期せぬ結果をもたらした。","type":"general","meaning_category":"general"}]}