{"word":"exactor","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"取り立て屋、徴収人、厳格な人","english_definition":"A person who exacts; especially, one who demands more than is due, or is severe in his exactions; a collector; as, an exactor of tribute.","examples":[{"sentence":"The exactor was known for his ruthless methods.","translation":"その取り立て屋は冷酷な手口で知られていた。"},{"sentence":"The king appointed an exactor to collect taxes from the provinces.","translation":"王は州から税を徴収するために徴収人を任命した。"},{"sentence":"He was seen as an exactor, always demanding perfection from his employees.","translation":"彼は従業員に常に完璧を求める厳格な人だと見られていた。"}],"collocations":["tax exactor (税金徴収人)","tribute exactor (貢物徴収人)","ruthless exactor (冷酷な取り立て屋)"],"synonyms":["collector","demander","extortionist","taskmaster","oppressor"],"antonyms":["benefactor","giver","philanthropist"]}],"etymology":{"value":"From Latin exactor, from exigere (to drive out, demand, collect), from ex- (out) + agere (to drive, do).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzæktər/","syllables":"ex-ac-tor"},"inflection":{"noun_plural":"exactors"},"usage_notes":{"explanation":"'Exactor' is a somewhat archaic term, referring to someone who rigorously demands payment or compliance, often to an unreasonable degree. It can also refer to a tax collector or someone in a similar role. The word carries a negative connotation, suggesting that the person is overly strict or even oppressive in their demands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good exactor of justice.","correct":"✓ He is a good executor of justice.","note":"'Exactor' (取り立て屋) is often confused with 'executor' (執行者), especially in the context of justice or law. Ensure the correct term is used based on the intended meaning."}],"priority":"★★★"},"related_words":{"derivatives":["exact (verb, adjective, noun)","exaction (noun)"],"related_terms":["extort","exigence"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'exactor' is not commonly used in modern English. It refers to someone who demands something, like payment or obedience, very strictly and often unfairly. Think of it as a stern tax collector or a boss who always wants things done perfectly and is never satisfied. Because it's rare, you'll mostly find it in older books or formal writing."},"example_sentences":[{"sentence":"The novel portrayed the landlord as a cruel exactor, squeezing every last penny from his tenants.","translation":"その小説は、地主を冷酷な取り立て屋として描き、テナントから最後の一銭まで搾り取っていた。","type":"noun","meaning_category":"取り立て屋"},{"sentence":"History remembers him as a stern exactor of the law, showing no mercy to offenders.","translation":"歴史は彼を、犯罪者に対して一切の容赦を示さない、厳格な法の執行者として記憶している。","type":"noun","meaning_category":"厳格な人"},{"sentence":"The government appointed a new exactor to ensure all taxes were collected efficiently.","translation":"政府はすべての税金が効率的に徴収されるように、新しい徴収人を任命した。","type":"noun","meaning_category":"徴収人"}]}