{"word":"Dimercurion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical chemical compound containing two mercury atoms.","english_definition":"A hypothetical chemical compound containing two mercury atoms. The existence of such a compound is debated, and it has not been definitively isolated or characterized.","examples":[{"sentence":"The existence of dimercurion (Hg₂) has been proposed in certain chemical reactions, but it remains unconfirmed.","translation":"二水銀（Hg₂）の存在は特定の化学反応で提唱されているが、未だ確認されていない。"}],"collocations":["dimercurion cation","formation of dimercurion","stability of dimercurion"],"synonyms":["mercury dimer","Hg₂ compound"],"antonyms":[]}],"etymology":{"value":"Derived from 'di-' (meaning two), 'mercur(y)' (referring to the element mercury), and '-ion' (indicating an ionic species).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪmərˈkjʊəriən/","syllables":"di-mer-cu-ri-on"},"inflection":{"noun_plural":"dimercurions"},"usage_notes":{"explanation":"Dimercurion is primarily a theoretical concept in chemistry. While mercury(I) compounds exist, they typically involve mercury atoms bonded to other elements or ligands rather than directly to each other. The dimercurion cation (Hg₂²⁺) is more commonly discussed than a neutral dimercurion compound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dimercurion is a stable compound used in many industrial processes.","correct":"✓ Dimercurion is a hypothetical compound whose existence is debated.","note":"Dimercurion is not a stable or widely used compound. Its existence is still under investigation."}],"priority":"★★☆"},"related_words":{"derivatives":["mercury","mercurous","mercuric","mercuride"],"phrases":["mercury(I)","mercury(II)","mercurous chloride","mercuric oxide"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized scientific term)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Dimercurion' is a highly specialized term in chemistry, referring to a hypothetical compound of two mercury atoms. It is primarily encountered in advanced chemistry discussions and research papers. Understanding requires a strong background in inorganic chemistry and chemical bonding principles. The term is not part of general vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"Spectroscopic evidence suggests the transient formation of a dimercurion species during the reaction.","translation":"分光学的証拠は、反応中に二水銀種の過渡的な形成を示唆している。","type":"scientific","meaning_category":"chemistry"},{"sentence":"Theoretical calculations predict that dimercurion would be highly unstable under normal conditions.","translation":"理論計算は、二水銀が通常の条件下では非常に不安定であることを予測している。","type":"scientific","meaning_category":"chemistry"}]}