{"word":"Stauropegia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スタヴロペギア: 正教会において、総主教の許可を得て修道院や教会を設立することを意味する。この許可を得た教会や修道院は、総主教の直接的な管轄下に入る。","english_definition":"Stauropegia: In the Eastern Orthodox Church, it refers to the act of establishing a monastery or church with the permission of the Patriarch. Churches or monasteries that receive this permission fall under the direct jurisdiction of the Patriarch.","examples":[{"sentence":"The monastery received stauropegia from the Patriarch, placing it under his direct authority.","translation":"その修道院は総主教からスタヴロペギアを受け、彼の直接的な権威下に置かれた。"}],"collocations":["receive stauropegia","establish a stauropegial monastery"],"synonyms":["patriarchal jurisdiction","exarchate"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の σταυρός (stauros, 「十字架」) + πήγνυμι (pēgnymi, 「固定する、設置する」) に由来。文字通りには「十字架を立てる」という意味で、教会の設立を象徴する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstɔːroʊˈpiːdʒiə/","syllables":"Stau-ro-pe-gi-a"},"inflection":{"noun_plural":"stauropegias"},"usage_notes":{"explanation":"スタヴロペギアは、正教会の教会法における重要な概念であり、総主教の権威と教会の組織構造を理解する上で不可欠です。スタヴロペギアの許可を得た教会や修道院は、地方の主教の管轄から独立し、総主教に直接従属します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bishop granted stauropegia to the church.","correct":"✓ The Patriarch granted stauropegia to the church.","note":"スタヴロペギアを許可できるのは総主教のみです。"},{"incorrect":"✗ Stauropegia means the same as autonomy in the Orthodox Church.","correct":"✓ Stauropegia grants direct jurisdiction to the Patriarch, while autonomy means self-governance.","note":"スタヴロペギアは総主教の管轄下に入ることを意味し、自治（autonomy）とは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["stauropegial (形容詞: スタヴロペギアの)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Stauropegia**」は、東方正教会の専門用語であり、総主教の許可を得て修道院や教会を設立することを指します。この許可を得た施設は総主教の直接的な管轄下に置かれるため、地方の主教の権限から独立します。この単語は、正教会の教会法や歴史に関する専門的な文脈でのみ使用されます。一般的な英語の読者には馴染みが薄い単語です。"},"example_sentences":[{"sentence":"The newly established monastery sought stauropegia to ensure its independence from the local diocese.","translation":"新しく設立された修道院は、地方の教区からの独立を確実にするためにスタヴロペギアを求めた。","type":"noun","meaning_category":"正教会における教会設立の許可"},{"sentence":"The Patriarch's grant of stauropegia solidified his authority over the ancient hermitage.","translation":"総主教によるスタヴロペギアの許可は、その古代の隠遁所に対する彼の権威を確固たるものにした。","type":"noun","meaning_category":"正教会における教会設立の許可"}]}