{"word":"Proportioning","priority":"★☆☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"(動詞 proportion の現在分詞または動名詞) 比例させること、割り当てること、調合すること","english_definition":"The act of adjusting or adapting in suitable proportion or degree; the act of dividing and distributing proportionally.","examples":[{"sentence":"The proportioning of ingredients is crucial for a successful recipe.","translation":"材料の調合は、レシピを成功させるために非常に重要です。"},{"sentence":"Careful proportioning of resources is necessary for effective project management.","translation":"効果的なプロジェクト管理には、資源の慎重な配分が必要です。"},{"sentence":"The architect emphasized the proportioning of space in the building design.","translation":"建築家は、建物設計における空間の比例配分を強調しました。"}],"collocations":["proportioning ingredients (材料の調合)","proportioning resources (資源の配分)","proportioning space (空間の比例配分)","proportioning weight (重量の比例配分)","proportioning effort (努力の配分)"],"synonyms":["allocating","distributing","rationing","adjusting","balancing","measuring","dividing"],"antonyms":["unbalancing","unequal distribution","disproportioning"]}],"etymology":{"value":"Derived from the verb 'proportion', which comes from the Latin 'proportio', meaning 'relative size, comparison, analogy'.","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈpɔːrʃənɪŋ/","syllables":"pro-por-tion-ing"},"inflection":{"verb_forms":{"present_participle":"proportioning"}},"usage_notes":{"explanation":"'Proportioning' refers to the act of dividing something into proportional parts, or adjusting elements to achieve a balanced or harmonious relationship. It is commonly used in cooking, engineering, art, and resource management to ensure that components are correctly balanced or allocated. The term often implies careful consideration and precision.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proportioning was wrong, so the cake didn't taste good.","correct":"✓ The proportions were wrong, so the cake didn't taste good.","note":"'Proportioning' is the act of adjusting proportions. 'Proportions' refers to the relative quantities themselves. In this case, the quantities were wrong, not the act of adjusting them."},{"incorrect":"✗ He is proportioning the money equally between them.","correct":"✓ He is proportioning the money equally among them.","note":"When distributing something among more than two people or things, use 'among' instead of 'between'."}],"priority":"★★☆"},"related_words":{"derivatives":["proportion (noun, verb)","proportional (adjective)","proportionally (adverb)","disproportion (noun, verb)","disproportionate (adjective)","disproportionately (adverb)"],"phrasal_verbs":["N/A"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proportioning' is a term used to describe the act of dividing or adjusting something so that its parts are in the correct or most pleasing relationship to each other. It is often used in technical or specialized contexts, such as cooking, engineering, or art, where precise measurements and balanced relationships are important. The word suggests a deliberate and careful process of adjustment to achieve a desired outcome. Understanding this term requires a relatively advanced vocabulary and a grasp of abstract concepts related to balance and measurement."},"example_sentences":[{"sentence":"The **proportioning** of fuel and air is critical for efficient combustion in the engine.","translation":"エンジン内の効率的な燃焼には、燃料と空気の調合が重要です。","type":"verb (gerund)","meaning_category":"調合"},{"sentence":"Effective **proportioning** of marketing budget across different channels is essential for maximizing ROI.","translation":"さまざまなチャネルにマーケティング予算を効果的に配分することは、ROIを最大化するために不可欠です。","type":"verb (gerund)","meaning_category":"配分"},{"sentence":"She is carefully **proportioning** the paint colors to achieve the desired shade.","translation":"彼女は望む色合いを実現するために、絵の具の色を慎重に調合しています。","type":"verb (present participle)","meaning_category":"調合"}]}