{"word":"autoinoculation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己接種、自家移植","english_definition":"The process of infecting oneself with a pathogen from one's own body.","examples":[{"sentence":"Autoinoculation can occur when scratching an area infected with molluscum contagiosum and then touching another part of the body.","translation":"伝染性軟属腫に感染した部位を掻いた後、体の別の部分に触れると、自己接種が起こることがあります。"},{"sentence":"Careful hygiene is important to prevent autoinoculation of warts.","translation":"イボの自己接種を防ぐためには、丁寧な衛生管理が重要です。"}],"collocations":["prevent autoinoculation","risk of autoinoculation","autoinoculation of warts","autoinoculation of molluscum contagiosum"],"synonyms":["self-inoculation","self-infection"],"antonyms":[]}],"etymology":{"value":"'Auto-' (self) + 'inoculation' (the introduction of a pathogen or antigen into a living organism to stimulate the production of antibodies).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɔːtoʊɪˌnɑːkjəˈleɪʃən","syllables":"au-to-in-oc-u-la-tion"},"inflection":{"noun_plural":"autoinoculations"},"usage_notes":{"explanation":"Autoinoculation refers specifically to the spread of an infection from one part of an individual's body to another part of the same individual's body. It is a common concern with skin conditions caused by viruses, such as warts and molluscum contagiosum.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor recommended vaccination to prevent autoinoculation.","correct":"✓ The doctor recommended hygiene measures to prevent autoinoculation.","note":"Vaccination is used to prevent infection from external sources, not autoinoculation. Autoinoculation is prevented through hygiene and avoiding contact with infected areas."}],"priority":"★★☆"},"related_words":{"derivatives":["inoculation","autoimmune","autograft"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autoinoculation' is a technical term primarily used in medical contexts. It describes the process where a person spreads an infection from one part of their body to another. This is typically discussed in relation to viral skin infections. Understanding this term requires a good grasp of medical terminology and biological processes."},"example_sentences":[{"sentence":"Avoid scratching to prevent **autoinoculation** of the infection.","translation":"感染の自己接種を防ぐために、掻くのを避けてください。","type":"general","meaning_category":"prevention"},{"sentence":"**Autoinoculation** is a common way for molluscum contagiosum to spread on the body.","translation":"自己接種は、伝染性軟属腫が体内で広がる一般的な方法です。","type":"general","meaning_category":"spread"}]}