{"word":"foreclosure","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(住宅ローンの)差し押さえ、担保権の実行","english_definition":"The action of taking possession of a mortgaged property when the mortgagor fails to keep up their mortgage payments.","examples":[{"sentence":"The bank initiated foreclosure proceedings on the property.","translation":"銀行はその物件に対する差し押さえ手続きを開始した。"},{"sentence":"Many families lost their homes to foreclosure during the recession.","translation":"不況の間、多くの家族が差し押さえによって家を失った。"},{"sentence":"They are trying to avoid foreclosure by negotiating with the lender.","translation":"彼らは貸し手と交渉して差し押さえを回避しようとしている。"}],"collocations":["face foreclosure (差し押さえに直面する)","prevent foreclosure (差し押さえを防ぐ)","foreclosure proceedings (差し押さえ手続き)","foreclosure sale (差し押さえ物件の競売)","foreclosure rate (差し押さえ率)","loan foreclosure (ローンの差し押さえ)"],"synonyms":["repossession","seizure","attachment"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Anglo-Norman French forclos, past participle of forclore ‘exclude’, from Old French forsclore, from for- (outside) + clore ‘to close’ (from Latin claudere).","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːrˈkloʊʒər/","syllables":"fore-clo-sure"},"inflection":{"noun_plural":"foreclosures"},"usage_notes":{"explanation":"\"Foreclosure\" refers to the legal process by which a lender (usually a bank or mortgage company) takes possession of a property because the borrower (homeowner) has failed to make mortgage payments as agreed. It's a serious situation that can result in the homeowner losing their home. The term is most commonly used in the context of real estate and mortgages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is in foreclosure of his house.","correct":"✓ His house is in foreclosure. / ✓ He is facing foreclosure.","note":"The correct phrase is \"in foreclosure\" or \"facing foreclosure.\" You don't say \"in foreclosure of.\""},{"incorrect":"✗ The bank did a foreclosure to him.","correct":"✓ The bank foreclosed on him. / ✓ The bank initiated foreclosure proceedings against him.","note":"The correct verb form is \"foreclose on someone\" or \"initiate foreclosure proceedings against someone.\""}],"priority":"★★☆"},"related_words":{"derivatives":["foreclose (verb): to take possession of a mortgaged property because the mortgagor failed to keep up their mortgage payments.","foreclosed (adjective): (of a property) having been taken possession of by a lender due to the borrower's failure to make mortgage payments."],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, especially in discussions of economics and real estate.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Foreclosure\" is a term primarily used in the context of real estate and finance. It describes the legal process where a lender repossesses a property because the borrower has not made their mortgage payments. Understanding this term is important for comprehending news and discussions related to housing markets, economic downturns, and personal finance. It's a more advanced vocabulary word, typically encountered in professional or academic contexts.","example_sentences":[{"sentence":"The rising interest rates led to an increase in home foreclosures.","translation":"金利の上昇は住宅ローンの差し押さえの増加につながった。","type":"noun","meaning_category":"差し押さえ"},{"sentence":"The family worked hard to avoid foreclosure on their farm.","translation":"家族は農場の差し押さえを避けるために懸命に努力した。","type":"noun","meaning_category":"差し押さえ"},{"sentence":"The city offered counseling services to residents facing foreclosure.","translation":"市は差し押さえに直面している住民にカウンセリングサービスを提供した。","type":"noun","meaning_category":"差し押さえ"}]}}