{"word":"stage-manager","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"舞台監督","english_definition":"The person responsible for the technical details of a theatrical production, coordinating the work of the stage crew, calling cues, and ensuring smooth performances.","examples":[{"sentence":"The stage-manager called the actors to their places.","translation":"舞台監督は俳優たちに持ち場に着くように指示した。"},{"sentence":"A good stage-manager is essential for a successful play.","translation":"優れた舞台監督は、成功する劇には不可欠だ。"},{"sentence":"She worked as a stage-manager for many years before becoming a director.","translation":"彼女は演出家になる前に長年舞台監督として働いていた。"}],"collocations":["call cues","coordinate stage crew","manage rehearsals","oversee performances","technical rehearsal"],"synonyms":["production manager","technical director"],"antonyms":[],"notes":"In smaller productions, the stage-manager may also handle props and costumes."}],"etymology":{"value":"Combination of 'stage' (the platform on which a performance takes place) and 'manager' (one who directs or controls).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪdʒ ˌmænɪdʒər/","syllables":"stage-man-a-ger"},"inflection":{"noun_plural":"stage-managers"},"usage_notes":{"explanation":"The stage-manager is a crucial role in theater, film, and television productions. They are responsible for the smooth running of the show during performances, ensuring that all technical aspects are executed correctly and on time. They also play a key role during rehearsals, coordinating the different departments and ensuring that the director's vision is realized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stage manager is a actor.","correct":"✓ The stage manager is not an actor.","note":"Stage managers are part of the crew, not actors."},{"incorrect":"✗ The stage manager is only important during the show.","correct":"✓ The stage manager is important during rehearsals and the show.","note":"The stage manager's role is vital during both rehearsals and performances."}],"priority":"★★☆"},"related_words":{"derivatives":["stage","manager","management"],"phrasal_verbs":[],"related_occupations":["director","lighting designer","sound engineer","set designer","costume designer","props master"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'stage-manager' refers to the person in charge of the technical aspects of a theater production. They make sure everything runs smoothly during the show, from lighting and sound to set changes and actor cues. It's a key role that requires strong organizational and communication skills."},"example_sentences":[{"sentence":"The stage-manager gave the signal for the curtain to rise.","translation":"舞台監督は幕が上がる合図を出した。","type":"example","meaning_category":"General"},{"sentence":"During the technical rehearsal, the stage-manager meticulously noted all the lighting and sound cues.","translation":"テクニカルリハーサル中、舞台監督は照明と音響のキューを細心の注意を払って記録した。","type":"example","meaning_category":"Responsibilities"},{"sentence":"The stage-manager's prompt book contained all the necessary information for running the show.","translation":"舞台監督のプロンプトブックには、公演を運営するために必要なすべての情報が含まれていた。","type":"example","meaning_category":"Tools and Equipment"}]}