{"word":"book-lore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"書籍に関する知識、書物に関する伝承、書物学","english_definition":"knowledge about books, especially of an antiquarian or traditional nature; the study of books as physical objects and cultural artifacts.","examples":[{"sentence":"His extensive book-lore made him a valuable asset to the library.","translation":"彼の豊富な書籍に関する知識は、彼を図書館にとって貴重な存在とした。"},{"sentence":"The professor's lectures were filled with fascinating details of book-lore.","translation":"教授の講義は、書物に関する興味深い詳細で満たされていた。"},{"sentence":"She immersed herself in book-lore, studying the history of printing and binding.","translation":"彼女は書物学に没頭し、印刷と製本の歴史を研究した。"}],"collocations":["extensive book-lore (豊富な書籍に関する知識)","traditional book-lore (伝統的な書籍に関する伝承)","study of book-lore (書物学の研究)","book-lore expert (書物学の専門家)"],"synonyms":["bibliology","bibliography","bookishness","erudition","scholarship"],"antonyms":["illiteracy","ignorance"],"notes":"Often used in academic or literary contexts."}],"etymology":{"value":"Derived from the combination of 'book' (referring to a written or printed work) and 'lore' (referring to knowledge or tradition).","priority":"★★★"},"pronunciation":{"ipa":"ˈbʊkˌlɔːr/","syllables":"book-lore"},"inflection":{"noun_plural":"book-lores (rarely used)"},"usage_notes":{"explanation":"'Book-lore' refers to a specialized knowledge concerning books, often encompassing their physical attributes, historical context, and cultural significance. It is broader than simply reading books; it involves understanding their production, preservation, and role in society. The term is frequently used in academic fields such as library science, history, and literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a lot of book-lore from reading novels.","correct":"✓ He has a lot of knowledge of literature from reading novels.","note":"'Book-lore' specifically refers to knowledge about books as physical objects and their history, not just knowledge gained from reading them. Use 'knowledge of literature' or a similar phrase instead."}],"priority":"★★☆"},"related_words":{"derivatives":["bookish (形容詞: 本好きの、学究的な)","lore (名詞: 知識、伝承)"],"phrases":["bookworm (名詞: 本に夢中な人)","bibliophile (名詞: 愛書家)","bibliomaniac (名詞: 書籍狂)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Book-lore' is a relatively uncommon term that refers to specialized knowledge about books, including their history, physical characteristics, and cultural significance. It is often used in academic or literary contexts. Understanding this term requires a good vocabulary and familiarity with academic language."},"example_sentences":[{"sentence":"The old librarian possessed a wealth of book-lore, able to identify rare editions at a glance.","translation":"その年老いた司書は豊富な書物に関する知識を持っており、珍しい版を一目で識別することができた。","type":"general","meaning_category":"書籍に関する知識"},{"sentence":"Her research focused on the book-lore of medieval manuscripts.","translation":"彼女の研究は中世写本の書物学に焦点を当てていた。","type":"academic","meaning_category":"書籍に関する知識"},{"sentence":"He shared fascinating book-lore about the art of calligraphy and illumination.","translation":"彼は書道と装飾の技術に関する魅力的な書物学を共有した。","type":"general","meaning_category":"書籍に関する伝承"}]}