{"word":"base-mindedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"下劣な心で、卑劣な考えで","english_definition":"In a base or ignoble manner; with a mean or sordid disposition.","examples":[{"sentence":"He acted base-mindedly, betraying his friends for personal gain.","translation":"彼は私利私欲のために友人を裏切り、卑劣な行為をした。"},{"sentence":"The politician base-mindedly spread rumors to damage his opponent's reputation.","translation":"その政治家は、相手の評判を傷つけるために卑劣な噂を広めた。"}],"collocations":["act base-mindedly (卑劣な行為をする)","behave base-mindedly (卑劣な振る舞いをする)","treat someone base-mindedly (誰かを卑劣に扱う)"],"synonyms":["meanly","ignobly","despicably","vilely","sordidly","shamefully","wickedly"],"antonyms":["nobly","honorably","generously","kindly","magnanimously"]}],"etymology":{"value":"The word is formed by combining \"base-minded\" (having a base or ignoble mind) with the adverbial suffix \"-ly\". \"Base\" comes from Old French and ultimately Latin, meaning low or inferior. \"Minded\" refers to having a particular disposition or inclination of the mind.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbeɪsˈmaɪndɪdlɪ/","syllables":"base-mind-ed-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Base-mindedly\" describes actions or behaviors that are motivated by low or ignoble intentions. It implies a lack of moral principles and a willingness to act in a shameful or despicable manner for personal gain or other selfish reasons. It is a relatively uncommon word, often replaced by more common synonyms like \"meanly\" or \"despicably\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a base-mindedly person.","correct":"✓ He is a base-minded person.","note":"\"Base-minded\" is an adjective describing the person, while \"base-mindedly\" is an adverb describing how someone acts."},{"incorrect":"✗ She base-mindedly to her friends.","correct":"✓ She acted base-mindedly towards her friends.","note":"\"Base-mindedly\" is an adverb and needs a verb to modify. Use a verb like \"acted\" or \"behaved\" to show how the action was performed."}],"priority":"★☆☆"},"related_words":{"derivatives":["base-minded (adjective: having a base or ignoble mind)","base (adjective: low, inferior; noun: foundation)","mind (noun: intellect, thoughts; verb: to care about)"],"related_terms":["mean","ignoble","despicable","vile","sordid","shameful","wicked"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rare and highly specific vocabulary)","frequency_google_ngram":"Very low frequency - This is a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"base-mindedly\" is a sophisticated and uncommon adverb. It describes actions done with a low, mean, or ignoble intention. Because it is not frequently used, it is more likely to be encountered in formal writing or literature. Understanding the word requires a grasp of the meanings of \"base\" (low, morally bad) and \"minded\" (having a particular disposition)."},"example_sentences":[{"sentence":"The company director base-mindedly manipulated the accounts to enrich himself.","translation":"その会社の取締役は、私腹を肥やすために卑劣な手段で会計を操作した。","type":"adverb","meaning_category":"卑劣な心で"},{"sentence":"He base-mindedly spread rumors to undermine his colleague's position.","translation":"彼は同僚の地位を弱体化させるために、卑劣な噂を広めた。","type":"adverb","meaning_category":"卑劣な考えで"},{"sentence":"She was treated base-mindedly by her so-called friends, who only wanted to use her connections.","translation":"彼女は、彼女のコネを利用したいだけのいわゆる友人たちから、卑劣な扱いを受けた。","type":"adverb","meaning_category":"卑劣な心で"}]}