{"word":"TGT","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(military) Target. A person, object, or location designated as having strategic or tactical value, which is to be taken out or neutralized.","english_definition":"A person, object, or location designated as having strategic or tactical value, which is to be taken out or neutralized.","examples":[{"sentence":"The enemy's command center was identified as a high-value TGT.","translation":"敵の司令部は、価値の高いターゲットとして特定されました。"},{"sentence":"Our mission is to secure the TGT and extract any intelligence.","translation":"我々の任務は、ターゲットを確保し、あらゆる情報を抽出することです。"}],"collocations":["High-value TGT","Primary TGT","Secondary TGT"],"synonyms":["Target","Objective"],"antonyms":[]},{"part_of_speech":"noun","definition":"(business) Target. A goal or objective that a business or individual aims to achieve within a specific timeframe.","english_definition":"A goal or objective that a business or individual aims to achieve within a specific timeframe.","examples":[{"sentence":"The sales team exceeded their quarterly TGT.","translation":"営業チームは四半期の目標を超えました。"},{"sentence":"Our TGT for next year is to increase market share by 10%.","translation":"来年の目標は、市場シェアを10％増やすことです。"}],"collocations":["Sales TGT","Revenue TGT","Performance TGT"],"synonyms":["Goal","Objective","Benchmark"],"antonyms":[]},{"part_of_speech":"noun","definition":"(finance) Target. In finance, often refers to a target price or a company being considered for acquisition.","english_definition":"In finance, often refers to a target price or a company being considered for acquisition.","examples":[{"sentence":"Analysts set a TGT price of $50 for the stock.","translation":"アナリストは、その株式の目標株価を50ドルに設定しました。"},{"sentence":"The company is a potential TGT for a takeover.","translation":"その会社は買収の潜在的なターゲットです。"}],"collocations":["Price TGT","Takeover TGT","Acquisition TGT"],"synonyms":["Aim","Goal"],"antonyms":[]}],"etymology":{"value":"Acronym for Target.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɑːrɡɪt/","syllables":"tar-get"},"inflection":{},"usage_notes":{"explanation":"TGT is an acronym, primarily used in military, business, and finance contexts. In military usage, it refers to a strategic or tactical target. In business, it denotes a specific goal or objective. In finance, it can refer to a target price or a company being considered for acquisition.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"TGT is an acronym that stands for \"target.\" Its meaning varies depending on the context. In military contexts, it refers to a person, object, or location that is the focus of an attack or operation. In business, it represents a goal or objective to be achieved. In finance, it can refer to a target price for a stock or a company being considered for acquisition. Because it's an acronym, its meaning is highly dependent on the surrounding text."},"example_sentences":[{"sentence":"The soldiers were given the coordinates of the TGT.","translation":"兵士たちはターゲットの座標を与えられた。","type":"noun","meaning_category":"military"},{"sentence":"The company set an ambitious TGT for annual sales.","translation":"会社は年間売上高について野心的な目標を設定した。","type":"noun","meaning_category":"business"},{"sentence":"Analysts believe the stock will reach its TGT price by year-end.","translation":"アナリストは、その株式が年末までに目標株価に達すると考えている。","type":"noun","meaning_category":"finance"}]}