{"word":"centile","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パーセンタイル、百分位数","english_definition":"one of the values dividing a distribution of observations into 100 groups of equal frequency. Thus, the 90th centile is the value below which 90% of the observations fall.","examples":[{"sentence":"The child's weight is in the 90th centile, meaning they are heavier than 90% of children their age.","translation":"その子供の体重は90パーセンタイルにあり、これは彼らが同年齢の子供の90%よりも重いことを意味します。"},{"sentence":"We use centiles to track student progress and identify those who may need extra support.","translation":"私たちはパーセンタイルを使って生徒の進捗状況を追跡し、追加のサポートが必要な生徒を特定します。"}],"collocations":["90th centile (90パーセンタイル)","growth centile (成長パーセンタイル)","weight centile (体重パーセンタイル)","height centile (身長パーセンタイル)"],"synonyms":["percentile"],"antonyms":[]}],"etymology":{"value":"Derived from 'cent' (meaning hundred) and '-ile' (indicating a division or position).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛntaɪl/","syllables":"cen-tile"},"inflection":{"noun_plural":"centiles"},"usage_notes":{"explanation":"'Centile' is often used in medical and statistical contexts to compare individual measurements against a population. It is particularly common in tracking child development, where weight and height centiles are used to assess growth relative to other children of the same age and sex.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The centile was very high.","correct":"✓ The centile score was very high. / ✓ The child was in a very high centile.","note":"It's important to specify what the centile refers to (e.g., a score, a measurement, or a person's position)."},{"incorrect":"✗ Centiles are the same as percentages.","correct":"✓ Centiles are a way of expressing relative position within a distribution, similar to percentages, but they represent positions, not proportions.","note":"Centiles and percentages are related but not identical. A centile indicates a rank, while a percentage usually indicates a proportion or ratio."}],"priority":"★★☆"},"related_words":{"derivatives":["percentile (パーセンタイル)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'centile' is a statistical term used to indicate where a particular value falls within a distribution of 100 equal groups. It's commonly used in fields like medicine and education to compare individual data points to a larger population. For example, if a child's height is in the 75th centile, it means they are taller than 75% of other children in the same age group. Understanding centiles requires a basic grasp of statistical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The baby's head circumference is on the 50th centile.","translation":"その赤ちゃんの頭囲は50パーセンタイルです。","type":"noun","meaning_category":"統計"},{"sentence":"The student's test score placed them in the top centile of their class.","translation":"その生徒のテストの点数は、クラスの上位パーセンタイルに位置づけられました。","type":"noun","meaning_category":"統計"}]}