{"word":"Busbies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) バスビー帽","english_definition":"Plural form of busby: A tall, fur headdress worn by soldiers in certain regiments, especially in the British army.","examples":[{"sentence":"The guards wore their busbies during the ceremony.","translation":"儀式の際、衛兵たちはバスビー帽を着用していた。"}],"collocations":["wear a busby","British army busby"],"synonyms":["fur hat","headdress"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Richard Busby, a 17th-century headmaster of Westminster School, who is said to have worn a similar hat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌzbiz/","syllables":"buz-bies"},"inflection":{"noun_plural":"Busbies"},"usage_notes":{"explanation":"'Busbies' is the plural form of 'busby,' referring to multiple instances of this specific type of fur headdress. It is most commonly associated with ceremonial attire, particularly within the British military.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a busbies.","correct":"✓ He wore a busby.","note":"'Busbies' is plural, so it cannot be used with the indefinite article 'a'."},{"incorrect":"✗ The busbies was impressive.","correct":"✓ The busbies were impressive.","note":"With a plural subject, the verb must also be plural."}],"priority":"★★☆"},"related_words":{"derivatives":["busby"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Busbies' refers to the plural form of the word 'busby', which is a specific type of tall fur hat worn in certain military regiments. It is not a commonly used word outside of contexts involving military history or ceremonial events. Understanding the term requires familiarity with military traditions and attire.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Royal Horse Guards are famous for their distinctive uniforms and black busbies.","translation":"近衛騎兵連隊は、特徴的な制服と黒いバスビー帽で有名だ。","type":"noun","meaning_category":"clothing"},{"sentence":"During the Trooping the Colour ceremony, many soldiers can be seen wearing busbies.","translation":"トゥルーピング・ザ・カラーの式典中、多くの兵士がバスビー帽を着用しているのが見られる。","type":"noun","meaning_category":"clothing"}]}