{"word":"self-impedance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己インピーダンス","english_definition":"The impedance at a point in a circuit or antenna due to its own current.","examples":[{"sentence":"The self-impedance of the antenna was calculated to be 50 ohms.","translation":"アンテナの自己インピーダンスは50オームと計算されました。"},{"sentence":"Understanding self-impedance is crucial for designing efficient antennas.","translation":"効率的なアンテナを設計するには、自己インピーダンスを理解することが重要です。"}],"collocations":["calculate self-impedance","measure self-impedance","antenna self-impedance"],"synonyms":["input impedance"],"antonyms":[]}],"etymology":{"value":"'Self-' refers to the impedance being due to the element's own current. 'Impedance' combines resistance and reactance to measure opposition to alternating current.","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfɪmˈpiːdəns/","syllables":"self-im-pee-dance"},"inflection":{"noun_plural":"self-impedances"},"usage_notes":{"explanation":"Self-impedance is a fundamental concept in antenna theory and electrical circuit analysis. It represents the opposition to current flow at a specific point in the circuit or antenna due to its own current. It's a complex quantity, consisting of resistance and reactance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The self-impedance are important.","correct":"✓ The self-impedance is important.","note":"Self-impedance is treated as a singular noun in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["impedance","mutual impedance","resistance","reactance"],"related_terms":["antenna theory","circuit analysis","transmission line"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-impedance' is a technical term used in electrical engineering, particularly in the context of antenna design and circuit analysis. It refers to the impedance at a specific point in a circuit or antenna caused by its own current. Understanding this concept requires a background in electrical engineering principles, including impedance, resistance, and reactance. It's typically encountered in advanced undergraduate or graduate-level coursework in electrical engineering."},"example_sentences":[{"sentence":"The self-impedance of the loop antenna was measured using a network analyzer.","translation":"ループアンテナの自己インピーダンスは、ネットワークアナライザを用いて測定されました。","type":"technical","meaning_category":"electrical engineering"},{"sentence":"Matching the self-impedance to the source impedance is essential for maximum power transfer.","translation":"最大の電力伝送のためには、自己インピーダンスをソースインピーダンスに整合させることが不可欠です。","type":"technical","meaning_category":"electrical engineering"}]}