{"word":"rivalship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"競争関係、対抗関係、ライバル意識","english_definition":"a state of competition or animosity between rivals.","examples":[{"sentence":"The intense rivalship between the two companies led to aggressive marketing tactics.","translation":"その二社間の激しい競争関係は、攻撃的なマーケティング戦術につながった。"},{"sentence":"There's a healthy rivalship among the athletes, pushing them to perform better.","translation":"選手間には健全な競争関係があり、それが彼らのパフォーマンス向上を促している。"},{"sentence":"The historical rivalship between the two cities has shaped their identities.","translation":"その二つの都市間の歴史的な対抗関係が、それぞれのアイデンティティを形作ってきた。"}],"collocations":["intense rivalship (激しい競争関係)","healthy rivalship (健全な競争関係)","bitter rivalship (激しい対立関係)","sporting rivalship (スポーツにおける競争関係)","sibling rivalship (兄弟間の競争心)"],"synonyms":["competition","contention","antagonism","opposition","feud","conflict"],"antonyms":["cooperation","collaboration","partnership","alliance","friendship"]},{"part_of_speech":"noun","definition":"ライバル関係にあること、ライバルであること","english_definition":"the condition or state of being rivals.","examples":[{"sentence":"Their rivalship was evident in every match they played against each other.","translation":"彼らのライバル関係は、互いに対戦するすべての試合で明らかだった。"},{"sentence":"The film explores the complex rivalship between the two artists.","translation":"その映画は、二人の芸術家の複雑なライバル関係を探求している。"}],"collocations":["professional rivalship (職業上のライバル関係)","personal rivalship (個人的なライバル関係)"],"synonyms":["competitiveness","antagonism","opposition"],"antonyms":["friendliness","cooperation"]}],"etymology":{"value":"\"Rival\" + \"-ship\". The suffix \"-ship\" is used to denote a state, condition, or quality. Therefore, \"rivalship\" refers to the state or condition of being rivals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪvəlʃɪp/","syllables":"ri-val-ship"},"inflection":{"noun_plural":"rivalships"},"usage_notes":{"explanation":"\"Rivalship\" refers to the state or condition of being rivals, which involves competition, antagonism, or opposition. It can be used to describe the relationship between individuals, groups, or organizations. The term often implies a sustained and significant level of competition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rivalship between them was very friend.","correct":"✓ The rivalship between them was very strong.","note":"\"Rivalship\" describes a competitive or antagonistic relationship, so it is usually described as strong, intense, or bitter rather than friendly."},{"incorrect":"✗ They had a good rivalship and they helped each other a lot.","correct":"✓ They had a good rivalry and they helped each other a lot.","note":"While \"rivalship\" is a valid word, \"rivalry\" is more commonly used to describe a competitive relationship. If they are helping each other, it suggests a friendly rivalry rather than a bitter rivalship."}],"priority":"★★☆"},"related_words":{"derivatives":["rival (noun, adjective, verb)","rivalry (noun)"],"phrases":["sibling rivalship (兄弟間の競争心)","sporting rivalship (スポーツにおける競争関係)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Rivalship\" is a less common word than \"rivalry,\" but it essentially means the same thing: a state of competition or antagonism between rivals. It's often used in more formal or literary contexts. Understanding the word requires a solid grasp of the meaning of \"rival\" and the function of the suffix \"-ship\" to denote a state or condition.","priority":"★★☆"},"example_sentences":[{"sentence":"The long-standing rivalship between the two universities fueled intense competition in academics and sports.","translation":"その二つの大学間の長年の対抗関係は、学業とスポーツにおける激しい競争を煽った。","type":"noun","meaning_category":"競争関係"},{"sentence":"The film depicted the complex rivalship between the two chess grandmasters.","translation":"その映画は、二人のチェスのグランドマスター間の複雑なライバル関係を描いた。","type":"noun","meaning_category":"ライバル関係にあること"},{"sentence":"Their professional rivalship never affected their personal friendship.","translation":"彼らの職業上の競争関係は、決して個人的な友情に影響を与えなかった。","type":"noun","meaning_category":"競争関係"},{"sentence":"The intense rivalship between the two political factions made compromise impossible.","translation":"二つの政治派閥間の激しい対立関係は、妥協を不可能にした。","type":"noun","meaning_category":"対抗関係"}]}