{"word":"unmartyred","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"殉教していない、殉教者として扱われていない","english_definition":"Not having been made a martyr; not regarded or treated as a martyr.","examples":[{"sentence":"The soldier died in battle, but he was unmartyred because his death was not specifically for his religious beliefs.","translation":"その兵士は戦闘で死亡したが、彼の死は特定の宗教的信念のためではなかったので、殉教者とはされなかった。"},{"sentence":"Despite her activism, she remained unmartyred, continuing her work without suffering martyrdom.","translation":"彼女の活動にもかかわらず、彼女は殉教者として扱われず、殉教の苦しみを受けることなく活動を続けた。"}],"collocations":["unmartyred soul","unmartyred life","remain unmartyred"],"synonyms":["non-martyred","unpersecuted","unhallowed"],"antonyms":["martyred","hallowed","persecuted"]}],"etymology":{"value":"\"un-\" (not) + \"martyred\" (made a martyr).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈmɑːrtərd/","syllables":"un-mar-tyred"},"inflection":{},"usage_notes":{"explanation":"The word \"unmartyred\" is primarily used to describe someone who has died or suffered but is not considered a martyr, typically because their death or suffering was not directly related to their religious or other strong beliefs. It can also refer to someone who has not experienced martyrdom at all.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unmartyred for his country.","correct":"✓ He died for his country, but was not martyred.","note":"\"Unmartyred\" means not considered a martyr. Dying for one's country doesn't automatically make someone a martyr unless it's specifically tied to religious or ideological beliefs. Use \"died for his country\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["martyr","martyrdom","martyrize"],"related_terms":["persecution","suffering","belief","sacrifice"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unmartyred\" is a relatively uncommon word that means someone has not been made a martyr. A martyr is someone who suffers or dies for their beliefs. Therefore, \"unmartyred\" describes someone who either didn't die for their beliefs or whose death isn't considered a martyrdom. It is often used in religious or historical contexts when discussing martyrdom.","priority":"★★☆"},"example_sentences":[{"sentence":"The early Christians who escaped persecution remained unmartyred, continuing their faith in secret.","translation":"迫害を逃れた初期のキリスト教徒たちは殉教者とはされず、ひそかに信仰を続けた。","type":"adjective","meaning_category":"Not having been made a martyr"},{"sentence":"Many soldiers die in war, but only some are considered martyred for a specific cause.","translation":"多くの兵士が戦争で亡くなるが、特定の目的のために殉教者とみなされるのは一部だけだ。","type":"adjective","meaning_category":"Not regarded as a martyr"}]}