{"word":"Carnalities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"肉欲、肉体的な快楽、官能性","english_definition":"Pleasures of the body or senses; indulgence in sensual appetites.","examples":[{"sentence":"He indulged in the carnalities of life, seeking pleasure in every form.","translation":"彼はあらゆる形で快楽を求め、人生の肉欲にふけった。"},{"sentence":"The novel explores the conflict between spiritual aspirations and carnalities.","translation":"その小説は、精神的な願望と肉欲との間の葛藤を探求している。"}],"collocations":["carnal desires","sexual carnalities","earthly carnalities"],"synonyms":["sensuality","lust","fleshly desires","physical pleasures","animal instincts"],"antonyms":["spirituality","asceticism","abstinence","chastity"]}],"etymology":{"value":"Derived from the word 'carnal,' which comes from the Latin 'carnalis,' meaning 'fleshly' or 'pertaining to the flesh.' The suffix '-ities' turns it into a plural noun referring to multiple instances or types of carnal pleasures.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɑːrˈnælətiz/","syllables":"car-nal-i-ties"},"inflection":{"noun_plural":"carnalities"},"usage_notes":{"explanation":"'Carnalities' refers to the indulgence in or the nature of bodily pleasures, often with a connotation of being base or sinful. It is generally used in contexts discussing morality, spirituality, or the conflict between physical desires and higher ideals. The term is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The carnalities of the event made it very spiritual.","correct":"✓ The carnalities of the event made it very sensual.","note":"'Carnalities' refers to physical or sensual pleasures, which is the opposite of 'spiritual.'"},{"incorrect":"✗ He avoided carnalities by eating healthy food.","correct":"✓ He avoided carnalities by practicing abstinence.","note":"Avoiding 'carnalities' involves abstaining from sensual pleasures, not just eating healthy food."}],"priority":"★★☆"},"related_words":{"derivatives":["carnal (adjective: relating to physical desires)","carnally (adverb: in a carnal manner)","carnation (noun: a type of flower, unrelated in meaning but shares the root 'carn-', meaning flesh-colored)"],"phrasal_verbs":[],"related_concepts":["sensual","lustful","hedonistic","corporeal","earthly"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'carnalities' is a sophisticated term referring to bodily or sensual pleasures, often with negative connotations related to morality or spirituality. It is not commonly used in everyday language and is more likely to appear in literature, philosophical discussions, or religious texts. Understanding the term requires a strong grasp of abstract concepts and nuanced vocabulary."},"example_sentences":[{"sentence":"The sermon warned against the dangers of succumbing to worldly carnalities.","translation":"その説教は、世俗的な肉欲に屈することの危険性について警告した。","type":"noun","meaning_category":"肉欲"},{"sentence":"The artist's depiction of the scene was filled with vibrant colors and overt carnalities.","translation":"その芸術家の場面描写は、鮮やかな色彩と露骨な肉欲に満ちていた。","type":"noun","meaning_category":"肉体的な快楽"},{"sentence":"He sought to transcend the carnalities of existence through meditation and prayer.","translation":"彼は瞑想と祈りを通して、存在の肉欲を超越しようとした。","type":"noun","meaning_category":"官能性"}]}