{"word":"Iridoncus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of beetles in the family Curculionidae (weevils).","english_definition":"A genus of beetles belonging to the weevil family, Curculionidae.","examples":[{"sentence":"The Iridoncus beetle is known for its distinctive metallic coloration.","translation":"Iridoncus属の甲虫は、特徴的な金属光沢のある色彩で知られています。"}],"collocations":["Iridoncus species","Iridoncus beetle"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Iridoncus' is derived from 'iris' (referring to the rainbow-like metallic colors) and 'oncus' (meaning swelling or hump), referring to the shape of the beetle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪrɪˈdɒŋkəs/","syllables":"I-ri-don-cus"},"inflection":{"noun_plural":"Iridonci (Latin plural)"},"usage_notes":{"explanation":"'Iridoncus' is a scientific term used in entomology to classify a specific group of weevils. It is primarily used in scientific contexts, such as research papers and taxonomic classifications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an iridoncus on my plant, it was very big.","correct":"✓ I saw an Iridoncus beetle on my plant.","note":"It's more common to refer to it as an 'Iridoncus beetle' to clarify that it's an insect."}],"priority":"★★☆"},"related_words":{"derivatives":["Curculionidae (family)","weevil"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Iridoncus' is a highly specialized term used in the field of entomology. Understanding and using this term requires advanced knowledge of biological classification and taxonomy. It is unlikely to be encountered outside of scientific literature or discussions among experts in the field."},"example_sentences":[{"sentence":"Researchers are studying the feeding habits of Iridoncus species in tropical forests.","translation":"研究者たちは、熱帯林におけるIridoncus属の種の食性を研究しています。","type":"scientific","meaning_category":"entomology"},{"sentence":"The genus Iridoncus includes several species of brightly colored weevils.","translation":"Iridoncus属には、鮮やかな色彩のいくつかのゾウムシの種が含まれています。","type":"scientific","meaning_category":"entomology"}]}