{"word":"ebullioscopic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"沸点上昇を利用した測定に関する、沸点上昇法による","english_definition":"Relating to ebullioscopy; pertaining to the determination of molecular weights by means of the elevation of the boiling point.","examples":[{"sentence":"The ebullioscopic method is used to determine the molecular weight of a solute.","translation":"沸点上昇法は、溶質の分子量を決定するために使用される。"}],"collocations":["ebullioscopic constant","ebullioscopic method"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From ebullioscopy + -ic. Ebullioscopy is derived from the Greek words 'ebullio' (to boil) and 'skopeō' (to examine).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌbʊlɪoʊˈskɒpɪk/","syllables":"e-bul-li-o-scop-ic"},"inflection":{},"usage_notes":{"explanation":"'Ebullioscopic' is a technical term mainly used in chemistry and physical sciences. It refers to the measurement techniques that rely on the elevation of boiling point to determine the molecular weight of a substance.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":["ebullioscopy"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'ebullioscopic' is highly specialized and primarily encountered in advanced scientific contexts, specifically within chemistry and related fields. It describes something related to ebullioscopy, which is a method of determining molecular weights by observing the elevation of a boiling point. Due to its technical nature, it's not typically used in general conversation or writing."},"example_sentences":[{"sentence":"The ebullioscopic measurements provided accurate data for the polymer's molecular weight.","translation":"その沸点上昇法による測定は、ポリマーの分子量に関する正確なデータを提供した。","type":"adjective","meaning_category":"沸点上昇を利用した測定に関する"},{"sentence":"An ebullioscopic study was conducted to analyze the properties of the new compound.","translation":"その新しい化合物の特性を分析するために、沸点上昇法による研究が実施された。","type":"adjective","meaning_category":"沸点上昇を利用した測定に関する"}]}