{"word":"Heaven's Gate","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"ヘブンズ・ゲート (1997年に集団自殺したアメリカの新宗教団体)","english_definition":"A UFO religious cult based near San Diego, California, founded in the early 1970s and known for their mass suicide in 1997.","examples":[{"sentence":"Heaven's Gate was led by Marshall Applewhite.","translation":"ヘブンズ・ゲートはマーシャル・アップルホワイトによって率いられていた。"},{"sentence":"The members of Heaven's Gate believed they would ascend to a spaceship following their deaths.","translation":"ヘブンズ・ゲートのメンバーは、死後、宇宙船に昇天すると信じていた。"}],"collocations":["Heaven's Gate cult","Heaven's Gate mass suicide","Heaven's Gate website"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Heaven's Gate' reflects the group's belief that they were seeking entry into the Kingdom of Heaven, which they believed was a physical place reached by leaving their earthly bodies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛvnz ˌɡeɪt/","syllables":"Heav-en's Gate"},"inflection":{},"usage_notes":{"explanation":"'Heaven's Gate' refers specifically to the religious group and the events surrounding them. It is important to use the term accurately and respectfully, especially when discussing the sensitive topic of their mass suicide.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Applewhite (Marshall Applewhite, the leader of Heaven's Gate)","NXIVM (another controversial cult)"],"priority":"★☆☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Heaven's Gate' is a proper noun referring to a specific historical event and religious group. Understanding requires knowledge of 20th-century American religious movements and cult phenomena. The term is not commonly used in everyday conversation but may appear in historical or sociological discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The Heaven's Gate cult gained notoriety for its members' coordinated suicide.","translation":"ヘブンズ・ゲートのカルトは、メンバーによる計画的な集団自殺によって悪名を馳せた。","type":"proper noun","meaning_category":"religious group"},{"sentence":"The Heaven's Gate website, though outdated, remains accessible as a historical artifact.","translation":"ヘブンズ・ゲートのウェブサイトは、時代遅れではあるものの、歴史的な遺物としてアクセス可能な状態を保っている。","type":"proper noun","meaning_category":"religious group"}]}