{"word":"phenylketonuria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フェニルケトン尿症","english_definition":"An inherited metabolic disorder in which the body cannot process the amino acid phenylalanine, leading to a buildup of phenylalanine in the blood and brain, which can cause intellectual disability and other health problems if untreated.","examples":[{"sentence":"Phenylketonuria is usually detected shortly after birth through newborn screening.","translation":"フェニルケトン尿症は通常、新生児スクリーニングによって出生直後に検出されます。"},{"sentence":"Individuals with phenylketonuria must follow a special diet low in phenylalanine.","translation":"フェニルケトン尿症の人は、フェニルアラニンの少ない特別な食事療法に従わなければなりません。"},{"sentence":"Early diagnosis and treatment of phenylketonuria are crucial to prevent long-term complications.","translation":"フェニルケトン尿症の早期診断と治療は、長期的な合併症を防ぐために非常に重要です。"}],"collocations":["newborn screening for phenylketonuria (フェニルケトン尿症の新生児スクリーニング)","phenylalanine-restricted diet (フェニルアラニン制限食)","manage phenylketonuria (フェニルケトン尿症を管理する)","phenylketonuria treatment (フェニルケトン尿症治療)"],"synonyms":["PKU"],"antonyms":[]},{"part_of_speech":"noun","definition":"(略語) PKU","english_definition":"(abbreviation) PKU","examples":[{"sentence":"PKU is a genetic disorder.","translation":"PKUは遺伝性疾患です。"},{"sentence":"PKU can be managed with a special diet.","translation":"PKUは特別な食事療法で管理できます。"}],"collocations":[],"synonyms":["phenylketonuria"],"antonyms":[]}],"etymology":{"value":"The term 'phenylketonuria' is derived from 'phenyl-' (referring to the phenyl group in phenylalanine), 'ketone' (referring to the presence of ketone bodies in the urine), and '-uria' (referring to the presence of a substance in the urine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfiːnaɪlˌkiːtoʊˈnjʊəriə/","syllables":"phe-nyl-ke-to-nu-ri-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Phenylketonuria (PKU) is a genetic disorder that requires careful management, typically through a special diet that restricts the intake of phenylalanine. Early detection through newborn screening is essential to prevent intellectual disability and other health problems. The condition is often referred to by its abbreviation, PKU.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Phenylketonuria is caused by a virus.","correct":"✓ Phenylketonuria is a genetic disorder.","note":"Phenylketonuria is a genetic disorder, not caused by a virus."},{"incorrect":"✗ People with phenylketonuria can eat as much protein as they want.","correct":"✓ People with phenylketonuria need to follow a special diet low in phenylalanine.","note":"Individuals with phenylketonuria must restrict their intake of phenylalanine, which is found in protein-rich foods."}],"priority":"★★☆"},"related_words":{"derivatives":["phenylalanine (フェニルアラニン)","tetrahydrobiopterin (テトラヒドロビオプテリン)","PKU (略語)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Phenylketonuria is a complex medical term referring to a genetic disorder. It requires understanding of genetics, metabolism, and medical terminology. The term is primarily used in medical and scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Without treatment, phenylketonuria can lead to severe intellectual disability.","translation":"治療しないと、フェニルケトン尿症は重度の知的障害を引き起こす可能性があります。","type":"general","meaning_category":"medical condition"},{"sentence":"The baby was diagnosed with phenylketonuria after a routine blood test.","translation":"その赤ちゃんは、定期的な血液検査の後、フェニルケトン尿症と診断されました。","type":"diagnosis","meaning_category":"medical condition"},{"sentence":"A low-phenylalanine diet is essential for managing phenylketonuria.","translation":"フェニルケトン尿症の管理には、低フェニルアラニン食が不可欠です。","type":"treatment","meaning_category":"medical condition"}]}