{"word":"Pyoperitonitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"化膿性腹膜炎","english_definition":"Inflammation of the peritoneum (the membrane lining the abdominal cavity) caused by pus-forming bacteria.","examples":[{"sentence":"Pyoperitonitis is a life-threatening condition requiring immediate medical intervention.","translation":"化膿性腹膜炎は、直ちに医療介入を必要とする生命を脅かす状態です。"},{"sentence":"The diagnosis of pyoperitonitis was confirmed through abdominal fluid analysis.","translation":"化膿性腹膜炎の診断は、腹腔液分析によって確認されました。"}],"collocations":["septic pyoperitonitis","feline pyoperitonitis","canine pyoperitonitis"],"synonyms":["septic peritonitis","purulent peritonitis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pyo-' (relating to pus), 'peritoneum' (the membrane lining the abdominal cavity), and '-itis' (denoting inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪoʊˌpɛrɪtəˈnaɪtɪs/","syllables":"py-o-per-i-to-ni-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Pyoperitonitis is a severe form of peritonitis characterized by the presence of pus in the peritoneal cavity. It is often caused by bacterial contamination resulting from a ruptured organ (e.g., appendix, gallbladder) or a penetrating injury. The condition requires prompt diagnosis and treatment, typically involving antibiotics and surgical intervention to remove the source of infection and drain the pus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pyoperitonitis is a type of cancer.","correct":"✓ Pyoperitonitis is a type of peritonitis, an inflammation of the peritoneum.","note":"Pyoperitonitis is an inflammatory condition, not a cancerous one."},{"incorrect":"✗ Pyoperitonitis can be treated with rest and fluids.","correct":"✓ Pyoperitonitis requires immediate medical intervention, including antibiotics and potentially surgery.","note":"Pyoperitonitis is a severe condition that requires aggressive medical treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["peritonitis","sepsis","abscess"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyoperitonitis' is a medical term referring to a severe inflammation of the peritoneum (the lining of the abdominal cavity) caused by pus-forming bacteria. Understanding this term requires knowledge of medical terminology related to inflammation and the abdominal cavity. It is typically encountered in medical or veterinary contexts. The word is formed from 'pyo-' (pus), 'peritoneum' (peritoneal lining), and '-itis' (inflammation)."},"example_sentences":[{"sentence":"The cat presented with signs of septic pyoperitonitis following a uterine rupture.","translation":"その猫は子宮破裂後、敗血症性化膿性腹膜炎の兆候を示した。","type":"medical","meaning_category":"化膿性腹膜炎"},{"sentence":"Surgical intervention is often necessary to address the source of contamination in cases of pyoperitonitis.","translation":"化膿性腹膜炎の場合、汚染源に対処するために外科的介入が必要となることが多い。","type":"medical","meaning_category":"化膿性腹膜炎"}]}