{"word":"illegitimation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正当性の喪失、非合法化、権威の失墜","english_definition":"The act or process of making something illegitimate; the state of being illegitimate; the loss of legitimacy or authority.","examples":[{"sentence":"The illegitimation of the regime led to widespread protests.","translation":"その政権の正当性の喪失は、広範囲にわたる抗議活動につながった。"},{"sentence":"The scandal caused the illegitimation of the politician's reputation.","translation":"そのスキャンダルは、政治家の評判の権威失墜を引き起こした。"},{"sentence":"The illegitimation of traditional knowledge systems can have negative consequences for indigenous communities.","translation":"伝統的な知識体系の非合法化は、先住民族コミュニティに悪影響を及ぼす可能性がある。"}],"collocations":["illegitimation of power (権力の正当性の喪失)","illegitimation of authority (権威の失墜)","process of illegitimation (正当性喪失の過程)"],"synonyms":["delegitimization","discrediting","undermining","invalidation","nullification"],"antonyms":["legitimation","validation","authorization","ratification","establishment"]}],"etymology":{"value":"\"Illegitimation\" is formed from the prefix \"il-\" (meaning \"not\"), the word \"legitimation\" (the act of making something legitimate), and the suffix \"-tion\" (denoting a state or process). Thus, it literally means the opposite of legitimation.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɪdʒɪtɪˈmeɪʃən/","syllables":"il-le-git-i-ma-tion"},"inflection":{"noun_plural":"illegitimations"},"usage_notes":{"explanation":"\"Illegitimation\" refers to the process by which something that was previously considered legitimate loses its legitimacy. This can apply to governments, institutions, ideas, or practices. The term is often used in political science, sociology, and history to describe the decline of authority or acceptance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The legitimation of the law was questioned.","correct":"✓ The illegitimation of the law was questioned.","note":"Ensure you use the correct prefix to convey the intended meaning. \"Legitimation\" means making something legitimate, while \"illegitimation\" means the opposite."}],"priority":"★★☆"},"related_words":{"derivatives":["illegitimate (adjective: 非合法の、正当でない)","legitimation (noun: 正当化、合法化)","legitimize (verb: 正当化する、合法化する)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"illegitimation\" is a formal and relatively uncommon term used to describe the process by which something loses its legitimacy or authority. It is often used in academic or political contexts to discuss the erosion of trust or acceptance in institutions, governments, or ideas. Understanding this word requires a strong vocabulary and familiarity with abstract concepts. It is the opposite of \"legitimation,\" which means to make something legitimate or valid."},"example_sentences":[{"sentence":"The government faced increasing illegitimation as its policies failed to address the needs of the people.","translation":"政府は、その政策が人々のニーズに対応できなかったため、正当性の喪失に直面した。","type":"noun","meaning_category":"正当性の喪失"},{"sentence":"The spread of misinformation contributed to the illegitimation of scientific findings.","translation":"誤った情報の拡散は、科学的知見の権威失墜に寄与した。","type":"noun","meaning_category":"権威の失墜"},{"sentence":"The illegitimation of the old regime paved the way for a new political order.","translation":"旧体制の正当性の喪失は、新しい政治秩序への道を開いた。","type":"noun","meaning_category":"正当性の喪失"}]}