{"word":"electrotellurograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An instrument for measuring earth currents.","english_definition":"An instrument used to measure and record telluric currents (electrical currents in the Earth).","examples":[{"sentence":"The electrotellurograph recorded significant variations in earth currents before the earthquake.","translation":"地震の前に、電地電流計は地電流の著しい変動を記録した。"}],"collocations":["telluric current","earth current","geophysical survey","magnetic field","electrical conductivity"],"synonyms":["telluric current meter","geoelectric recorder"],"antonyms":[]}],"etymology":{"value":"Derived from 'electro-' (referring to electricity), 'telluric' (referring to the Earth), and '-graph' (an instrument for recording). Reflects the instrument's function of measuring and recording electrical currents in the Earth.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊtəˈlʊərəˌɡræf/","syllables":"e-lec-tro-te-lu-ro-graph"},"inflection":{"noun_plural":"electrotellurographs"},"usage_notes":{"explanation":"An electrotellurograph is a specialized scientific instrument used in geophysics to study the electrical properties of the Earth's subsurface. It measures telluric currents, which are naturally occurring electrical currents that flow through the Earth. These measurements can provide valuable information about the Earth's structure, composition, and dynamic processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The electrotellurograph is used to measure seismic waves.","correct":"✓ The electrotellurograph is used to measure earth currents.","note":"Electrotellurographs measure electrical currents, not seismic waves (which are measured by seismographs)."},{"incorrect":"✗ The electrotellurograph is a common household device.","correct":"✓ The electrotellurograph is a specialized scientific instrument.","note":"Electrotellurographs are specialized instruments used by geophysicists and are not found in typical households."}],"priority":"★★☆"},"related_words":{"derivatives":["electrotelluric (adjective: relating to both electricity and the Earth)","telluric (adjective: relating to the Earth)","tellurometer (noun: a microwave instrument for measuring distances)"],"related_fields":["geophysics","geoelectricity","geomagnetism","seismology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'electrotellurograph' refers to a sophisticated instrument employed in the field of geophysics. It's designed to measure and record telluric currents, which are naturally occurring electrical currents within the Earth. Understanding this term requires familiarity with concepts in geophysics and electrical phenomena. The instrument's data aids in studying the Earth's subsurface properties and geological activities. Due to its specialized nature, the term is not commonly encountered outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers deployed an electrotellurograph to monitor changes in telluric currents near the fault line.","translation":"研究者たちは、断層線付近の地電流の変化を監視するために、電地電流計を設置した。","type":"example","meaning_category":"measurement"},{"sentence":"The data from the electrotellurograph helped to create a detailed map of the Earth's electrical conductivity.","translation":"電地電流計からのデータは、地球の電気伝導率の詳細な地図を作成するのに役立った。","type":"example","meaning_category":"data analysis"}]}