{"word":"seroimmunity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血清免疫：血液中の抗体によって媒介される免疫。感染またはワクチン接種によって獲得される。","english_definition":"Immunity mediated by antibodies in the blood serum, acquired through infection or vaccination.","examples":[{"sentence":"Seroimmunity is crucial for protection against many infectious diseases.","translation":"血清免疫は多くの感染症に対する防御に不可欠である。"},{"sentence":"Vaccination aims to induce seroimmunity in the population.","translation":"ワクチン接種は、集団における血清免疫の誘導を目的としている。"},{"sentence":"The level of seroimmunity can be measured by antibody titers.","translation":"血清免疫のレベルは、抗体価によって測定できる。"}],"collocations":["acquire seroimmunity (血清免疫を獲得する)","induce seroimmunity (血清免疫を誘導する)","measure seroimmunity (血清免疫を測定する)","level of seroimmunity (血清免疫のレベル)","population seroimmunity (集団血清免疫)"],"synonyms":["humoral immunity","antibody-mediated immunity"],"antonyms":["cellular immunity"]}],"etymology":{"value":"\"sero-\" (血清) + \"immunity\" (免疫)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪəroʊɪˈmjuːnɪti/","syllables":"se-ro-im-mu-ni-ty"},"inflection":{"noun_plural":"seroimmunities"},"usage_notes":{"explanation":"Seroimmunity refers specifically to the presence and level of antibodies in the blood serum that provide protection against a particular pathogen. It is often used in the context of vaccine development and monitoring population immunity levels.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Seroimmunity is the same as cellular immunity.","correct":"✓ Seroimmunity is different from cellular immunity.","note":"Seroimmunity is antibody-mediated, while cellular immunity involves T cells and other immune cells. They are distinct but complementary aspects of the immune system."}],"priority":"★★☆"},"related_words":{"derivatives":["seroconversion","serology","seropositive","seronegative"],"related_terms":["antibody","antigen","vaccine","immunity","humoral response"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Seroimmunity\" is a technical term used in immunology and medicine. It refers to the type of immunity that is conferred by antibodies present in the blood serum. This is often assessed after vaccination or infection to determine the level of protection against a specific disease. Understanding this term requires some background knowledge of immunology.","priority":"★★☆"},"example_sentences":[{"sentence":"The study assessed the duration of seroimmunity following vaccination against measles.","translation":"その研究では、麻疹ワクチン接種後の血清免疫の持続期間を評価した。","type":"general","meaning_category":"definition"},{"sentence":"High levels of seroimmunity in a population can lead to herd immunity.","translation":"集団における高い血清免疫レベルは、集団免疫につながる可能性がある。","type":"general","meaning_category":"definition"},{"sentence":"The test measures the presence and quantity of antibodies to determine seroimmunity.","translation":"その検査は、血清免疫を判定するために抗体の有無と量を測定する。","type":"general","meaning_category":"definition"}]}