{"word":"sadists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サディスト（性的倒錯者、または他者を虐待して快感を得る人）の複数形","english_definition":"plural of sadist: people who get pleasure, sometimes sexual, by inflicting pain or humiliation on others.","examples":[{"sentence":"Those sadists enjoyed watching others suffer.","translation":"それらのサディストたちは、他人が苦しむのを見て楽しんだ。"},{"sentence":"The world is full of sadists who enjoy inflicting pain.","translation":"世界は、痛みを加えることを楽しむサディストで溢れている。"}],"collocations":["group of sadists","cruel sadists","psychopathic sadists"],"synonyms":["tormentors","bullies","tyrants","torturers"],"antonyms":["empathizers","humanitarians","altruists"]}],"etymology":{"value":"The word 'sadist' comes from the name of the Marquis de Sade, an 18th-century French writer known for his depictions of sexual cruelty.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪdɪsts/","syllables":"say-dists"},"inflection":{"noun_plural":"sadists"},"usage_notes":{"explanation":"'Sadists' is the plural form of 'sadist,' referring to multiple individuals who derive pleasure from inflicting pain or suffering on others. It can be used in both a clinical and a more general, colloquial sense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sadists.","correct":"✓ He is a sadist.","note":"'Sadist' is a singular noun, so it should be used with the singular article 'a'."},{"incorrect":"✗ The sadist's is cruel.","correct":"✓ The sadists are cruel.","note":"When referring to multiple sadists, use the plural form 'sadists' and the plural verb 'are'."}],"priority":"★★☆"},"related_words":{"derivatives":["sadist (noun: a person who derives pleasure from inflicting pain or suffering on others)","sadistic (adjective: deriving pleasure from inflicting pain or suffering on others)","sadism (noun: the tendency to derive pleasure, especially sexual gratification, from inflicting pain, suffering, or humiliation on others)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sadists' refers to people who enjoy causing pain or suffering to others. It's a plural noun, meaning it refers to more than one person. The term is derived from the Marquis de Sade, a writer known for depicting cruelty. This word is often used in discussions about psychology, crime, or morality, and it's important to use it carefully because it can be offensive to label someone a 'sadist' without proper understanding or context."},"example_sentences":[{"sentence":"The prison guards were accused of being sadists.","translation":"その刑務官たちはサディストだと告発された。","type":"noun","meaning_category":"サディスト"},{"sentence":"Some people believe that online trolls are just sadists seeking attention.","translation":"ネット荒らしはただ注目を浴びたがるサディストだと考える人もいる。","type":"noun","meaning_category":"サディスト"},{"sentence":"The novel depicted a group of sadists who tortured their victims.","translation":"その小説は、被害者を拷問するサディスト集団を描写していた。","type":"noun","meaning_category":"サディスト"}]}