{"word":"Witchhood","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"魔女であること、魔女の身分、魔女の世界、魔女の集団","english_definition":"The state or condition of being a witch; the world or community of witches.","examples":[{"sentence":"She embraced witchhood and dedicated her life to the craft.","translation":"彼女は魔女の世界を受け入れ、その技に人生を捧げた。"},{"sentence":"The coven shared a strong sense of witchhood, supporting each other in their practices.","translation":"その魔女団は魔女の世界という強い意識を共有し、互いの実践を支え合った。"},{"sentence":"Exploring the history of witchhood reveals a complex tapestry of folklore and persecution.","translation":"魔女の世界の歴史を探求すると、民俗学と迫害が複雑に絡み合った様子が明らかになる。"}],"collocations":["embrace witchhood (魔女の世界を受け入れる)","practice witchhood (魔女の身分を実践する)","the path of witchhood (魔女の道のり)","a sense of witchhood (魔女の世界という感覚)"],"synonyms":["witchcraft","sorcery","magic","the craft"],"antonyms":["normality","mundanity"],"notes":"Often associated with Wicca and modern paganism, but can also refer to historical or fictional concepts of witchcraft."}],"etymology":{"value":"Formed from 'witch' (Old English wicca, female wicce) + '-hood' (suffix denoting state, condition, or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɪtʃhʊd/","syllables":"witch-hood"},"inflection":{"noun_plural":"witchhoods (rarely used)"},"usage_notes":{"explanation":"'Witchhood' refers to the state of being a witch, encompassing the practices, beliefs, and community associated with witchcraft. It can be used in both historical and contemporary contexts, often relating to Wicca and modern paganism. However, it can also refer to the broader concept of witchcraft in folklore and fiction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a witchhood.","correct":"✓ She is a witch.","note":"'Witchhood' is a state or condition, not a person. Use 'witch' to refer to the person."},{"incorrect":"✗ The witchhood did a spell.","correct":"✓ The witches did a spell. / ✓ The coven did a spell.","note":"'Witchhood' is not a collective noun for witches. Use 'witches' or 'coven' (for a group of witches)."}],"priority":"★★☆"},"related_words":{"derivatives":["witch (noun)","witchy (adjective)","witchcraft (noun)"],"phrases":["coven (a group of witches)","Wicca (a modern pagan religion)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but usage is increasing with the growing popularity of Wicca and modern paganism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Witchhood' is a relatively uncommon word referring to the state or condition of being a witch. It encompasses the practices, beliefs, and community associated with witchcraft, often in the context of Wicca and modern paganism. Understanding the word requires familiarity with the cultural and historical connotations of witchcraft."},"example_sentences":[{"sentence":"Her journey into witchhood began with a fascination for ancient herbs and rituals.","translation":"彼女の魔女の世界への旅は、古代のハーブと儀式への魅了から始まった。","type":"general"},{"sentence":"Many modern witches find empowerment and community through their witchhood.","translation":"現代の魔女の多くは、魔女であることによってエンパワーメントとコミュニティを見出している。","type":"general"},{"sentence":"The book explores the historical persecution of women accused of witchhood.","translation":"その本は、魔女であると告発された女性たちの歴史的な迫害について探求している。","type":"historical"}]}