{"word":"mudsill","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)土台、敷居、最下部の横木","english_definition":"(architecture) the lowest sill of a structure, often laid directly on the ground or foundation.","examples":[{"sentence":"The mudsill provides a base for the entire building.","translation":"土台は建物全体の基礎となる。"},{"sentence":"Check the mudsill for signs of rot or insect damage.","translation":"腐敗や昆虫による損傷の兆候がないか、土台を確認してください。"}],"collocations":["mudsill construction","mudsill beam","replace a mudsill"],"synonyms":["sill","groundsill","baseplate"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的、軽蔑的)社会の最下層の人々、労働者階級","english_definition":"(historical, derogatory) the lowest social class, especially manual laborers, regarded as the foundation on which a society or economy is built.","examples":[{"sentence":"The politician referred to the working class as the 'mudsill' of society.","translation":"その政治家は労働者階級を社会の「土台」と呼んだ。"},{"sentence":"The term 'mudsill' was used to justify the exploitation of laborers.","translation":"「土台」という言葉は、労働者の搾取を正当化するために使われた。"}],"collocations":["mudsill theory","mudsill class","mudsill argument"],"synonyms":["working class","lower class","proletariat"],"antonyms":["upper class","elite"]}],"etymology":{"value":"'Mud' + 'sill'. The architectural sense is straightforward, referring to a sill laid on or near the ground. The derogatory social sense originated in the mid-19th century, particularly in the Southern United States, where it was used to describe the laboring classes, especially slaves, as the foundation upon which the more 'civilized' society was built. This usage is now considered offensive.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌdˌsɪl/","syllables":"mud-sill"},"inflection":{"noun_plural":"mudsills"},"usage_notes":{"explanation":"The word 'mudsill' has two distinct meanings. The primary meaning refers to a structural component in building construction. The second meaning is a historical and derogatory term for the lowest social class, particularly manual laborers. This usage is now considered offensive and should be avoided. When encountering this word, it is crucial to understand the context to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He built the house without a mudsill. It collapsed quickly.","correct":"✓ He built the house without a mudsill. It collapsed quickly.","note":"(Correct usage, showing the importance of a mudsill in construction.)"},{"incorrect":"✗ She is a proud mudsill of our community.","correct":"✓ She is a valuable member of our community.","note":"(Avoid using 'mudsill' to describe a person due to its derogatory historical meaning. Use alternative phrases like 'valuable member' or 'hardworking individual'.)"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sill","foundation","base","groundwork"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mudsill' has two distinct meanings, one architectural and one historical/social. The architectural meaning refers to the lowest horizontal timber of a structure. The historical meaning is a derogatory term for the lowest social class. Due to the potential for offense, the historical meaning should be used with extreme caution or avoided altogether. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The carpenter carefully leveled the **mudsill** before erecting the walls.","translation":"大工は壁を立てる前に、慎重に土台を水平にした。","type":"noun","meaning_category":"(建築)土台"},{"sentence":"(Historical) The **mudsill** theory was used to justify slavery in the antebellum South.","translation":"（歴史的）土台理論は、南北戦争前の南部における奴隷制を正当化するために使われた。","type":"noun","meaning_category":"(歴史的、軽蔑的)社会の最下層の人々"}]}