{"word":"preeliminate","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"予備的に除去する、事前に排除する","english_definition":"To eliminate or remove something or someone in a preliminary or initial stage, before a more thorough or final elimination process.","examples":[{"sentence":"The committee decided to preeliminate some of the weaker candidates before the final interviews.","translation":"委員会は最終面接の前に、より弱い候補者の一部を予備的に排除することを決定した。"},{"sentence":"We need to preeliminate any potential errors in the data before running the analysis.","translation":"分析を実行する前に、データ内の潜在的なエラーを事前に排除する必要がある。"}],"collocations":["preeliminate candidates","preeliminate errors","preeliminate possibilities"],"synonyms":["prescreen","preselect","weed out","filter out","narrow down"],"antonyms":["include","retain","consider"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（競争などで）一次選考で落とす、予選で排除する","english_definition":"To remove from a competition or selection process during a preliminary round.","examples":[{"sentence":"Several teams were preeliminated in the first round of the tournament.","translation":"いくつかのチームがトーナメントの最初のラウンドで一次選考で落とされた。"},{"sentence":"The software helps to preeliminate unqualified applicants from the pool.","translation":"そのソフトウェアは、資格のない応募者を応募者プールから予選で排除するのに役立つ。"}],"collocations":["preeliminate teams","preeliminate applicants"],"synonyms":["exclude","disqualify","remove","reject"],"antonyms":["qualify","advance","promote"]}],"etymology":{"value":"\"pre-\" (before) + \"eliminate\" (to remove). Indicates an action of removing something before a final stage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪˈlɪmɪneɪt/","syllables":"pre-e-lim-i-nate"},"inflection":{"verb_forms":{"present_simple":["preeliminate","preeliminates"],"past_simple":"preeliminated","past_participle":"preeliminated","present_participle":"preeliminating"}},"usage_notes":{"explanation":"\"Preeliminate\" implies a preliminary or initial removal, often to reduce a larger set to a more manageable size before further scrutiny. It suggests a multi-stage process where the first stage involves a less rigorous or detailed assessment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We pre-eliminate the problem after it happens.","correct":"✓ We preeliminate the problem before it happens.","note":"\"Pre-\" implies doing something *before* something else. Therefore, preeliminating a problem should occur before the problem arises, not after."},{"incorrect":"✗ The system preeliminate by itself.","correct":"✓ The system preeliminates automatically.","note":"\"Preeliminate\" is a verb that requires a subject. If the system does it automatically, use \"automatically\" or a similar adverb."}],"priority":"★☆☆"},"related_words":{"derivatives":["preelimination (noun)"],"synonyms":["prescreen","preselect","filter"],"antonyms":["include","add","consider"],"related_terms":["eliminate","screen","select"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preeliminate' is a more advanced term used to describe the act of removing or excluding something in a preliminary stage. It's often used in contexts where there's a multi-step process, such as in recruitment or data analysis, where some items are removed early on to make the subsequent steps more manageable. It's less common in everyday language, making it suitable for more formal or technical discussions."},"example_sentences":[{"sentence":"The software is designed to preeliminate duplicate entries from the database.","translation":"そのソフトウェアは、データベースから重複エントリを事前に排除するように設計されている。","type":"general","meaning_category":"予備的に除去する"},{"sentence":"The first round of voting will preeliminate the candidates with the fewest votes.","translation":"最初の投票ラウンドでは、最も票の少ない候補者が予選で排除される。","type":"general","meaning_category":"（競争などで）一次選考で落とす"}]}