{"word":"Zeaxanthin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ゼアキサンチン：一部の植物、藻類、および微生物によって生成されるキサントフィルカロテノイド。","english_definition":"A xanthophyll carotenoid produced by some plants, algae, and microorganisms.","examples":[{"sentence":"Zeaxanthin is an important pigment found in paprika, corn, saffron, and many other plants.","translation":"ゼアキサンチンは、パプリカ、トウモロコシ、サフラン、その他多くの植物に含まれる重要な色素です。"},{"sentence":"Zeaxanthin, along with lutein, is found in high concentrations in the macula of the human eye.","translation":"ゼアキサンチンは、ルテインとともに、ヒトの眼の黄斑に高濃度で存在します。"}],"collocations":["zeaxanthin supplement","zeaxanthin and lutein","dietary zeaxanthin"],"synonyms":["lutein (related carotenoid)"],"antonyms":[]}],"etymology":{"value":"Derived from 'zea' (Latin for corn, specifically Zea mays) + 'xanthos' (Greek for yellow) + '-in' (a common suffix for chemical substances).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌziːəˈzænθɪn/","syllables":"zee-uh-zan-thin"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Zeaxanthin is primarily known for its role as an antioxidant, especially in the eye, where it protects against blue light and oxidative damage. It is often taken as a dietary supplement to support eye health.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Zeaxanthin is a vitamin.","correct":"✓ Zeaxanthin is a carotenoid.","note":"Zeaxanthin is a type of carotenoid, not a vitamin, although it can have vitamin-like effects in the body."}],"priority":"★★☆"},"related_words":{"derivatives":["zeaxanthol (related compound)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zeaxanthin' is a technical term primarily encountered in contexts related to nutrition, biochemistry, and ophthalmology. Understanding its role requires familiarity with concepts such as carotenoids, antioxidants, and the anatomy of the eye. It is not a word commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"Consuming foods rich in zeaxanthin may help protect against age-related macular degeneration.","translation":"ゼアキサンチンを豊富に含む食品を摂取することは、加齢黄斑変性症の予防に役立つ可能性があります。","type":"general","meaning_category":"health"},{"sentence":"The analysis showed a high concentration of zeaxanthin in the marigold extract.","translation":"分析の結果、マリーゴールド抽出物に高濃度のゼアキサンチンが含まれていることが示されました。","type":"scientific","meaning_category":"scientific analysis"}]}