{"word":"Afibrinogenemia","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"先天的無フィブリノゲン血症 (せんてんてきむフィブリノゲンけっしょう): 血液中のフィブリノゲンが欠乏または存在しない遺伝性疾患","english_definition":"A rare inherited bleeding disorder characterized by the complete absence or very low levels of fibrinogen in the blood.","examples":[{"sentence":"Afibrinogenemia is usually diagnosed in infancy due to prolonged bleeding after circumcision or umbilical cord separation.","translation":"無フィブリノゲン血症は通常、割礼後または臍帯分離後の出血が長引くため、乳児期に診断されます。"},{"sentence":"Treatment for afibrinogenemia typically involves infusions of cryoprecipitate or fibrinogen concentrate to replace the missing clotting factor.","translation":"無フィブリノゲン血症の治療は通常、欠乏している凝固因子を補充するために、クリオプレシピテートまたはフィブリノゲン濃縮製剤の注入を伴います。"}],"collocations":["congenital afibrinogenemia","acquired afibrinogenemia","treatment of afibrinogenemia","diagnosis of afibrinogenemia","management of afibrinogenemia"],"synonyms":["fibrinogen deficiency"],"antonyms":[]},{"part_of_speech":"noun","definition":"(より広義には) 血液凝固におけるフィブリノゲンの完全な欠如の状態","english_definition":"(More broadly) The condition of complete absence of fibrinogen in blood coagulation.","examples":[{"sentence":"Afibrinogenemia can lead to severe bleeding episodes, both spontaneous and after trauma or surgery.","translation":"無フィブリノゲン血症は、自然発生的にも、外傷や手術後にも、重度の出血を引き起こす可能性があります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"A-\" (否定接頭辞: 無い) + \"fibrinogen\" (フィブリノゲン) + \"-emia\" (接尾辞: 血液の状態)","priority":"High"},"pronunciation":{"ipa":"/eɪˌfaɪbrɪnəˈdʒiːnɪmiːə/","syllables":"a-fi-bri-no-ge-ne-mi-a"},"inflection":{"notes":"名詞であり、複数形は通常使用されません。"},"usage_notes":{"explanation":"Afibrinogenemiaは非常にまれな疾患であり、医学文献や専門的な文脈でのみ使用されます。","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"Afibrinogenemia is treated with antibiotics.","correct":"Afibrinogenemia is treated with fibrinogen concentrate or cryoprecipitate.","note":"無フィブリノゲン血症は感染症ではないため、抗生物質では治療しません。"},{"incorrect":"Afibrinogenemia is a common bleeding disorder.","correct":"Afibrinogenemia is a rare bleeding disorder.","note":"無フィブリノゲン血症は非常にまれです。"}],"priority":"Medium"},"related_words":{"derivatives":["hypofibrinogenemia (低フィブリノゲン血症)","dysfibrinogenemia (異常フィブリノゲン血症)","fibrinogen (フィブリノゲン)"],"related_medical_terms":["hemophilia (血友病)","thrombophilia (血栓性素因)","coagulopathy (凝固障害)"],"priority":"High"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度","priority":"Low"},"readability_explanation":{"level":"C2","text":"\"Afibrinogenemia\" is a highly specialized medical term referring to a rare genetic condition. Understanding this term requires a strong background in biology and medicine, particularly in the areas of hematology and genetics. The word is composed of several Greek and Latin roots, making it challenging for non-experts to comprehend without prior knowledge. The condition itself is complex, involving the complete absence of fibrinogen, a crucial protein for blood clotting. Therefore, the term is primarily used within medical and scientific contexts.","priority":"High"},"example_sentences":[{"sentence":"Congenital afibrinogenemia is a rare autosomal recessive disorder.","translation":"先天性無フィブリノゲン血症はまれな常染色体劣性遺伝疾患です。","type":"General"},{"sentence":"Patients with afibrinogenemia often require prophylactic fibrinogen replacement therapy.","translation":"無フィブリノゲン血症の患者は、予防的なフィブリノゲン補充療法を必要とすることがよくあります。","type":"Medical"},{"sentence":"The diagnosis of afibrinogenemia is confirmed by measuring fibrinogen levels in the blood.","translation":"無フィブリノゲン血症の診断は、血液中のフィブリノゲンレベルを測定することで確認されます。","type":"Diagnostic"}]}