{"word":"homonymy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同音異義語（であること）、同音異義関係","english_definition":"The relationship between words that have the same spelling or pronunciation but different meanings and origins.","examples":[{"sentence":"The homonymy of 'bank' (financial institution) and 'bank' (river edge) can cause confusion.","translation":"「bank」（金融機関）と「bank」（川岸）の同音異義性は混乱を招くことがある。"},{"sentence":"Homonymy is a common feature of many languages.","translation":"同音異義性は多くの言語に共通する特徴である。"}],"collocations":["lexical homonymy","structural homonymy","cases of homonymy"],"synonyms":["homonym","polysemy (related, but different)"],"antonyms":["antonymy","synonymy"]},{"part_of_speech":"noun","definition":"（生物学）同名（異種）","english_definition":"(in biology) the state of two or more taxa having the same name.","examples":[{"sentence":"Homonymy in scientific nomenclature can lead to taxonomic instability.","translation":"学術命名法における同名（異種）は、分類学的な不安定性につながる可能性がある。"}],"collocations":["taxonomic homonymy","zoological homonymy","botanical homonymy"],"synonyms":["taxonomic homonym","nomenclatural homonym"],"antonyms":["synonymy (in taxonomy)"]}],"etymology":{"value":"From Ancient Greek ὁμώνυμος (homṓnymos), meaning 'having the same name', from ὁμός (homós, 'same') + ὄνομα (ónoma, 'name').","priority":"★★☆"},"pronunciation":{"ipa":"/hɒˈmɒnɪmi/","syllables":"ho-mon-y-my"},"inflection":{"noun_plural":"homonymies"},"usage_notes":{"explanation":"Homonymy refers to the relationship between words that share the same form (spelling or pronunciation) but have different meanings and etymological origins. It is distinct from polysemy, where a single word has multiple related meanings. In biology, homonymy refers to the same name being used for different taxa, which is problematic for classification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The polysemy of 'bright' and 'homonymy' of 'bat' are interesting linguistic phenomena.","correct":"✓ The polysemy of 'bright' and the homonymy of 'bat' are interesting linguistic phenomena.","note":"'Polysemy' refers to one word having multiple related meanings, while 'homonymy' refers to words with the same form but unrelated meanings."},{"incorrect":"✗ Homonymy is when words sound similar but have the same meaning.","correct":"✓ Homonymy is when words sound similar but have different meanings.","note":"Homonyms have different meanings, not the same meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["homonymic (adjective)","homonymous (adjective)"],"phrases":["homonym (noun): a word that is a homonym of another word.","homophone (noun): a word that sounds the same as another word but has a different meaning and spelling.","homograph (noun): a word that is spelled the same as another word but has a different meaning and pronunciation."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homonymy' is a term used in linguistics to describe words that share the same form (either spelling or pronunciation) but have different, unrelated meanings. For example, the word 'bank' can refer to a financial institution or the edge of a river. These are homonyms. Understanding homonymy is important for avoiding ambiguity in language. In biology, 'homonymy' refers to the same name being used for different species or other taxa, which is generally avoided in scientific nomenclature."},"example_sentences":[{"sentence":"The English language is full of examples of homonymy.","translation":"英語には同音異義語の例がたくさんある。","type":"general","meaning_category":"linguistics"},{"sentence":"The existence of homonymy can sometimes lead to humorous misunderstandings.","translation":"同音異義語の存在は、時にユーモラスな誤解につながることがある。","type":"general","meaning_category":"linguistics"},{"sentence":"To avoid confusion, taxonomists try to eliminate homonymy in scientific names.","translation":"混乱を避けるため、分類学者は学名における同名（異種）を排除しようとする。","type":"specific","meaning_category":"biology"}]}