{"word":"creviced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"裂け目のある、割れ目のある、ひびの入った","english_definition":"Having crevices; full of cracks or fissures.","examples":[{"sentence":"The creviced rock face made climbing difficult.","translation":"割れ目の多い岩壁は、登山を困難にした。"},{"sentence":"Creviced skin can be a sign of dehydration.","translation":"ひび割れた皮膚は、脱水症状の兆候である可能性がある。"},{"sentence":"The old, creviced walls of the building added to its character.","translation":"建物の古く、ひび割れた壁が、その個性を際立たせていた。"}],"collocations":["creviced rock","creviced skin","creviced surface"],"synonyms":["cracked","fissured","split","fractured","cleft"],"antonyms":["smooth","unbroken","even"]},{"part_of_speech":"verb","definition":"creviceの過去分詞、または形容詞的に使われる","english_definition":"Past participle of 'crevice', used as an adjective.","examples":[{"sentence":"The creviced terrain was difficult to navigate.","translation":"割れ目の多い地形は、ナビゲートするのが困難だった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'crevice' (a narrow opening or fissure), with the addition of the '-ed' suffix, indicating a state of possessing or being characterized by crevices.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɛvɪst/","syllables":"crev-iced"},"inflection":{"notes":"Adjective. Also functions as the past participle of the verb 'crevice' (to make crevices in)."},"usage_notes":{"explanation":"'Creviced' is primarily used as an adjective to describe surfaces or objects that have many crevices (narrow cracks or fissures). It is often used in geological or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The creviced building was new.","correct":"The creviced building was old.","note":"'Creviced' implies age or wear, so it's typically used to describe older structures or natural formations."}],"priority":"★☆☆"},"related_words":{"derivatives":["crevice (noun): A narrow opening or fissure, especially in a rock or wall.","crevicing (noun): The act of making crevices.","crevice (verb): To make crevices in something."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'creviced' is a relatively uncommon adjective used to describe something that is full of narrow cracks or fissures. It is most often found in descriptive writing, particularly when discussing geological formations or aged surfaces. Understanding this word requires a good vocabulary and familiarity with descriptive language."},"example_sentences":[{"sentence":"The wind howled through the creviced cliffs.","translation":"風が割れ目の多い崖の間をうなりながら吹き抜けた。","type":"adjective","meaning_category":"Having crevices"},{"sentence":"The creviced bark of the ancient tree provided shelter for insects.","translation":"その古代の木のひび割れた樹皮は、昆虫たちの避難場所となっていた。","type":"adjective","meaning_category":"Having crevices"},{"sentence":"The climber carefully navigated the creviced glacier.","translation":"登山者は、割れ目の多い氷河を慎重に進んだ。","type":"adjective","meaning_category":"Having crevices"}]}