{"word":"homoplast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)相同器官、相似器官","english_definition":"(biology) A structure or organ in different species that is similar in appearance and function but has evolved separately, not from a common ancestor.","examples":[{"sentence":"The wings of a bird and the wings of an insect are homoplasts.","translation":"鳥の翼と昆虫の翼は相同器官です。"},{"sentence":"The thorns of a rose and the spines of a cactus are homoplasts.","translation":"バラの棘とサボテンの針は相似器官です。"}],"collocations":["analogous structure","convergent evolution","homoplasy"],"synonyms":["analogous organ","convergent structure"],"antonyms":["homologue","homologous organ"]}],"etymology":{"value":"Derived from the Greek words 'homos' (same) and 'plastos' (molded, formed).","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɒməˌplæst","syllables":"hom-o-plast"},"inflection":{"noun_plural":"homoplasts"},"usage_notes":{"explanation":"The term 'homoplast' is used in biology to describe structures that have similar functions and appearances in different species but did not evolve from a common ancestor. This phenomenon is called convergent evolution. It's important to distinguish homoplasts from homologues, which are structures that share a common ancestry, even if their functions have diverged.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Homoplasts are evidence of common ancestry.","correct":"✓ Homoplasts are evidence of convergent evolution.","note":"Homoplasts arise from convergent evolution, not common ancestry."},{"incorrect":"✗ The human arm and a bat's wing are homoplasts.","correct":"✓ The human arm and a bat's wing are homologues.","note":"The human arm and a bat's wing are homologues because they share a common skeletal structure, even though their functions differ."}],"priority":"★☆☆"},"related_words":{"derivatives":["homoplasy (noun: the development of similar features separately in different evolutionary lineages)","homoplastic (adjective: relating to or exhibiting homoplasy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'homoplast' refers to a biological structure that has evolved independently in different species to perform a similar function. This concept is related to convergent evolution, where different species face similar environmental pressures and develop similar adaptations. It is important to distinguish this from homologous structures, which share a common ancestry. Understanding 'homoplast' requires a solid foundation in evolutionary biology."},"example_sentences":[{"sentence":"The camera eyes of octopuses and humans are examples of **homoplasts**.","translation":"タコのカメラ眼と人間のカメラ眼は、相同器官の例です。","type":"noun","meaning_category":"biology"},{"sentence":"The similarity between the streamlined bodies of dolphins and sharks is due to **homoplasy**, resulting in **homoplasts**.","translation":"イルカとサメの流線型の体の類似性は、相同性によっており、相同器官をもたらしています。","type":"noun","meaning_category":"biology"}]}