{"word":"immunised","priority":"★★★","meanings":[{"part_of_speech":"verb (past participle/past tense)","definition":"予防接種を受けた、免疫を与えられた","english_definition":"protected against a disease, usually by having been vaccinated.","examples":[{"sentence":"All the children were immunised against polio.","translation":"子供たちは皆、ポリオの予防接種を受けた。"},{"sentence":"Have you been immunised against measles?","translation":"あなたは麻疹の予防接種を受けましたか？"},{"sentence":"The population needs to be immunised to prevent an epidemic.","translation":"伝染病を防ぐためには、住民に免疫を与える必要があります。"}],"collocations":["immunised against (disease)","be fully immunised","immunised population","immunised child"],"synonyms":["vaccinated","protected","inoculated","resistant","immune"],"antonyms":["susceptible","vulnerable","unprotected"]}],"etymology":{"value":"The word 'immunise' comes from 'immune', which originates from the Latin word 'immunis', meaning 'exempt from public service, untaxed'. The idea is that someone who is immune is 'exempt' from catching a particular disease.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɪmjʊnaɪzd","syllables":"im-mu-nised"},"inflection":{"verb_forms":{"present_simple":["immunise","immunises"],"past_simple":"immunised","past_participle":"immunised","present_participle":"immunising"}},"usage_notes":{"explanation":"'Immunised' typically refers to the process of making someone immune to a disease, usually through vaccination. It is often used in the context of public health and preventative medicine. The verb can be used both transitively (e.g., 'The doctor immunised the child') and passively (e.g., 'The child was immunised'). In British English, the spelling is 'immunised', while in American English, it's often spelled 'immunized'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am immunised for the flu every year.","correct":"✓ I am immunised against the flu every year.","note":"The correct preposition to use with 'immunised' is 'against'. You are immunised against a specific disease."},{"incorrect":"✗ The immunised is important for children.","correct":"✓ Immunisation is important for children.","note":"'Immunised' is a verb or adjective. The noun form is 'immunisation'."},{"incorrect":"✗ She is immune by the vaccine.","correct":"✓ She is immunised by the vaccine.","note":"'Immune' is an adjective describing the state of being protected. 'Immunised' is the verb describing the action of becoming protected."}],"priority":"★★☆"},"related_words":{"derivatives":["immunisation (noun: the process of becoming immune)","immune (adjective: protected against a disease)","immunity (noun: the state of being immune)","immunize (verb: alternative spelling, especially in American English)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in medical and public health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'immunised' means to be protected from a disease, usually through a vaccine. It's a common term in healthcare and public health discussions. You might hear it when talking about vaccinations for children or efforts to prevent the spread of diseases. Understanding this word is helpful for following news and information related to health."},"example_sentences":[{"sentence":"The doctor immunised the baby against several diseases.","translation":"医者はその赤ちゃんにいくつかの病気の予防接種をした。","type":"verb","meaning_category":"予防接種をする"},{"sentence":"Once immunised, the body can fight off the virus.","translation":"免疫を獲得すると、体はそのウイルスと戦うことができる。","type":"adjective","meaning_category":"免疫を獲得した"},{"sentence":"The government launched a campaign to get more people immunised.","translation":"政府はより多くの人々に予防接種を受けさせるためのキャンペーンを開始した。","type":"verb","meaning_category":"予防接種をする"},{"sentence":"She was immunised as a child, so she's not worried about getting the disease.","translation":"彼女は子供の頃に予防接種を受けたので、その病気になることを心配していない。","type":"verb","meaning_category":"予防接種を受けた"}]}