{"word":"ecchymotic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"皮下出血の、溢血性の","english_definition":"relating to or marked by ecchymosis.","examples":[{"sentence":"The patient presented with ecchymotic lesions on the lower extremities.","translation":"患者は下肢に皮下出血性の病変を呈した。"},{"sentence":"Ecchymotic changes were observed around the site of the injury.","translation":"損傷部位の周囲に皮下出血性の変化が観察された。"}],"collocations":["ecchymotic lesion","ecchymotic area","ecchymotic skin","ecchymotic discoloration"],"synonyms":["bruised","contused","hemorrhagic","suffused"],"antonyms":["unblemished","clear","healthy"]}],"etymology":{"value":"From the Greek word 'ekchymosis' (ἐκχύμωσις), meaning 'a pouring out of juice,' from 'ek-' (ἐκ-) meaning 'out' and 'chymos' (χυμός) meaning 'juice.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛkɪˈmɒtɪk/","syllables":"ec-chy-mot-ic"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are more ecchymotic and most ecchymotic, but are rarely used."},"usage_notes":{"explanation":"'Ecchymotic' is a medical term used to describe a condition or area of skin that shows signs of ecchymosis, which is discoloration caused by bleeding underneath the skin, typically due to bruising. It is most often used in medical contexts or when describing physical injuries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skin was ecchymosis.","correct":"✓ The skin was ecchymotic.","note":"'Ecchymosis' is the noun (the bruise itself), while 'ecchymotic' is the adjective (describing something related to bruising)."},{"incorrect":"✗ He had ecchymotic all over his body.","correct":"✓ He had ecchymoses all over his body.","note":"If referring to multiple bruises, the plural form of the noun 'ecchymosis' is 'ecchymoses'."}],"priority":"★☆☆"},"related_words":{"derivatives":["ecchymosis (noun: 皮下出血、溢血)"],"related_medical_terms":["hematoma","petechiae","purpura"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ecchymotic' is a technical term predominantly used in medical settings to describe skin discoloration resulting from subcutaneous bleeding, commonly known as bruising. Its usage is largely confined to professional medical communication and documentation. Therefore, it is not typically encountered in general conversation or writing. Understanding its meaning is essential for those in healthcare fields but less relevant for the general public."},"example_sentences":[{"sentence":"The elderly patient was prone to developing ecchymotic areas after minor trauma.","translation":"その高齢患者は、軽微な外傷後でも皮下出血性の領域ができやすかった。","type":"adjective","meaning_category":"皮下出血性の"},{"sentence":"The ecchymotic discoloration indicated a possible underlying bleeding disorder.","translation":"その皮下出血性の変色は、潜在的な出血性疾患の可能性を示唆していた。","type":"adjective","meaning_category":"皮下出血性の"},{"sentence":"Careful examination revealed several ecchymotic patches on the patient's back.","translation":"注意深い検査により、患者の背中にいくつかの皮下出血性の斑点が認められた。","type":"adjective","meaning_category":"皮下出血性の"}]}