{"word":"Condylarthra","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コンドラルス目（絶滅した哺乳類の目）","english_definition":"An extinct order of mammals that are considered to be ancestral to many of the ungulates.","examples":[{"sentence":"The Condylarthra are an important group in understanding the evolution of modern ungulates.","translation":"コンドラルス目は、現代の有蹄類の進化を理解する上で重要なグループです。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'kondylos' (knuckle, joint) and 'arthron' (joint), referring to the structure of their ankle bones.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒndɪˈlɑːrθrə/","syllables":"Con-dy-lar-thra"},"inflection":{"noun_plural":"Condylarthrans"},"usage_notes":{"explanation":"'Condylarthra' is a taxonomic term used in paleontology and evolutionary biology. It refers to an order of extinct mammals that lived during the Paleocene and Eocene epochs. They are significant because they are thought to be ancestral to modern ungulates (hoofed mammals) like horses, cows, and pigs.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["ungulate","Paleocene","Eocene","mammal","evolution"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Condylarthra' is a scientific term used in the context of paleontology and evolutionary biology. Understanding its meaning requires familiarity with these fields. It is not a commonly used word outside of scientific discussions."},"example_sentences":[{"sentence":"Fossil evidence suggests that the earliest members of the Condylarthra were small, generalized herbivores.","translation":"化石の証拠は、コンドラルス目の初期のメンバーが小型で、一般化された草食動物であったことを示唆しています。","type":"scientific","meaning_category":"description"},{"sentence":"The evolutionary relationships within the Condylarthra are still debated among paleontologists.","translation":"コンドラルス目内の進化的関係は、古生物学者の間でまだ議論されています。","type":"scientific","meaning_category":"evolution"}]}