{"word":"pierage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"桟橋使用料、埠頭使用料","english_definition":"A charge for the use of a pier or wharf.","examples":[{"sentence":"The pierage for unloading the cargo was quite expensive.","translation":"貨物を降ろすための桟橋使用料はかなり高かった。"},{"sentence":"The shipping company included the pierage in their overall cost estimate.","translation":"海運会社は、全体的なコスト見積もりに埠頭使用料を含めていた。"}],"collocations":["pierage charges","pierage fees"],"synonyms":["dockage","wharfage","berthage"],"antonyms":[]}],"etymology":{"value":"From 'pier' (a structure projecting into the sea or a lake, used as a landing stage or promenade) + '-age' (suffix denoting a charge or fee).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪərɪdʒ/","syllables":"pier-age"},"inflection":{"noun_plural":"pierages"},"usage_notes":{"explanation":"'Pierage' refers specifically to the fee charged for using a pier. It is often used in the context of shipping, ports, and maritime activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pierage was included in the ticket price for the ferry.","correct":"✓ The fare included the pierage.","note":"The ticket price is the fare, and the pierage is included in the fare."}],"priority":"★☆☆"},"related_words":{"derivatives":["pier","wharf","dock","berth"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pierage' is a specialized term used in the context of maritime activities and port operations. It refers to the fee charged for the use of a pier or wharf. This term is not commonly used in everyday conversation and is more likely to be encountered in professional or technical contexts related to shipping and logistics."},"example_sentences":[{"sentence":"The shipping company had to pay a significant pierage to unload its cargo.","translation":"海運会社は貨物を降ろすためにかなりの埠頭使用料を支払わなければならなかった。","type":"noun","meaning_category":"桟橋使用料"},{"sentence":"Pierage is often calculated based on the size and weight of the vessel.","translation":"桟橋使用料は、多くの場合、船舶のサイズと重量に基づいて計算される。","type":"noun","meaning_category":"桟橋使用料"}]}