{"word":"Gallinacei","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キジ目（きじめ）","english_definition":"An order of ground-dwelling birds that are able to fly, including chickens, turkeys, pheasants, partridges, quail, grouse, and related birds.","examples":[{"sentence":"The Gallinacei are important to humans as a source of food and sport.","translation":"キジ目は、食料や狩猟の対象として人間にとって重要である。"}],"collocations":["Gallinaceous birds","Order Gallinacei"],"synonyms":["fowl","poultry"],"antonyms":[]}],"etymology":{"value":"The term \"Gallinacei\" comes from Latin, derived from \"gallus,\" meaning \"rooster\" or \"cock.\" The suffix \"-acei\" is used in taxonomic classifications to denote an order.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡælɪˈneɪsiːaɪ/","syllables":"Gal-li-na-ce-i"},"inflection":{"notes":"This is a scientific term used as a noun, specifically a taxonomic rank (order). Its plural form is the same as the singular form."},"usage_notes":{"explanation":"'Gallinacei' is a scientific term used in biology to classify a specific order of birds. It's not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A Gallinacei is a chicken.","correct":"✓ A chicken is a member of the Gallinacei.","note":"'Gallinacei' refers to the entire order, not just a single bird."}],"priority":"★★☆"},"related_words":{"derivatives":["Gallus (genus of chickens)","Phasianidae (family of pheasants)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gallinacei' is a scientific term used in the classification of birds, specifically the order that includes chickens, turkeys, and pheasants. It is not a word commonly used outside of scientific or zoological contexts."},"example_sentences":[{"sentence":"The diversity within the Gallinacei order is remarkable, with species adapted to various habitats.","translation":"キジ目内の多様性は著しく、様々な生息地に適応した種が存在する。","type":"noun","meaning_category":"Taxonomic Order"}]}