{"word":"dichotomisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二分法、二分化","english_definition":"The act of dividing or classifying something into two mutually exclusive categories or groups.","examples":[{"sentence":"The dichotomisation of society into rich and poor is a growing concern.","translation":"社会を富裕層と貧困層に二分化することは、ますます懸念されています。"},{"sentence":"The study used dichotomisation to simplify the complex data.","translation":"その研究では、複雑なデータを単純化するために二分法が用いられました。"}],"collocations":["dichotomisation of data","dichotomisation of opinions","dichotomisation of variables"],"synonyms":["bifurcation","division","separation","classification","categorization"],"antonyms":["continuum","gradation","spectrum"]}],"etymology":{"value":"Derived from 'dichotomy', which comes from the Greek 'dichotomia' meaning 'a cutting in two'. The suffix '-isation' (or '-ization' in American English) turns the noun into a verb-related noun indicating the process or act of dichotomizing.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌkɒtəmaɪˈzeɪʃən/","syllables":"di-cho-to-mi-sa-tion"},"inflection":{"noun_plural":"dichotomisations"},"usage_notes":{"explanation":"'Dichotomisation' refers to the process of dividing something into two distinct and mutually exclusive categories. It's often used in academic and technical contexts, such as statistics, sociology, and philosophy, to simplify complex information or to create clear distinctions. The term implies a clear separation without intermediate states.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dichotomisation was very continuum.","correct":"✓ The dichotomisation created two distinct categories.","note":"'Dichotomisation' implies a clear division, not a continuum. The result is discrete categories, not a continuous range."},{"incorrect":"✗ Dichotomisation is when you have many categories.","correct":"✓ Dichotomisation is when you have two categories.","note":"'Dichotomisation' specifically means dividing into two categories, not many."}],"priority":"★★☆"},"related_words":{"derivatives":["dichotomize (verb)","dichotomous (adjective)","dichotomy (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dichotomisation' is a formal term that means to divide something into two distinct and separate groups. It's often used in academic writing or technical discussions when you need to clearly distinguish between two options or categories. For example, you might talk about the 'dichotomisation of opinions' to mean that people's views are divided into two opposing sides. It's a more precise way of saying 'division' or 'separation' when you specifically mean a split into two."},"example_sentences":[{"sentence":"The dichotomisation of the data allowed for a clearer analysis.","translation":"データの二分化により、より明確な分析が可能になりました。","type":"general"},{"sentence":"The study explored the effects of dichotomisation on public opinion.","translation":"その研究では、世論に対する二分化の影響が調査されました。","type":"academic"},{"sentence":"The dichotomisation of the problem simplified the decision-making process.","translation":"問題の二分化により、意思決定プロセスが簡素化されました。","type":"technical"}]}