{"word":"avant-gardism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"前衛主義、アヴァンギャルド","english_definition":"A style or movement in art, music, or literature characterized by unconventionality, experimentation, and a rejection of traditional norms and values.","examples":[{"sentence":"Avant-gardism challenges the status quo and seeks to push the boundaries of artistic expression.","translation":"前衛主義は現状に挑戦し、芸術表現の限界を押し広げようとします。"},{"sentence":"The museum featured a retrospective of works showcasing the evolution of avant-gardism in the 20th century.","translation":"その美術館では、20世紀における前衛主義の進化を示す作品の回顧展が開催されました。"},{"sentence":"Some critics argue that avant-gardism has become too self-referential and detached from broader cultural concerns.","translation":"一部の批評家は、前衛主義が自己言及的になりすぎ、より広範な文化的関心事から乖離していると主張しています。"}],"collocations":["artistic avant-gardism","literary avant-gardism","musical avant-gardism","historical avant-gardism","radical avant-gardism","early avant-gardism","late avant-gardism"],"synonyms":["experimentalism","modernism","radicalism","innovation","unconventionality","nonconformity"],"antonyms":["traditionalism","conservatism","classicism","conventionality","orthodoxy"]}],"etymology":{"value":"Derived from the French term 'avant-garde,' meaning 'vanguard' or 'advance guard.' It originated in military contexts to describe the troops that go ahead of the main army. In the 19th century, it was adopted by artists and intellectuals to describe those who were at the forefront of artistic and social change. The suffix '-ism' denotes a doctrine, principle, or movement.","priority":"★★★"},"pronunciation":{"ipa":"/ˌævɒ̃ ˈɡɑːrdɪzəm/","syllables":"a-vant-gard-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Avant-gardism' refers to the principles, practices, and aesthetics associated with avant-garde movements. It often involves a deliberate departure from established norms and a willingness to experiment with new forms, techniques, and ideas. Avant-gardism is not limited to a specific art form or period but can be found across various disciplines and historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a avant-gardism artist.","correct":"✓ He is an avant-garde artist.","note":"'Avant-garde' is the adjective used to describe the artist or the artwork. 'Avant-gardism' is the noun referring to the movement or philosophy. Also, remember to use 'an' before 'avant-garde' because it starts with a vowel sound."},{"incorrect":"✗ Avant-gardism is always easy to understand.","correct":"✓ Avant-gardism is often challenging to understand.","note":"Avant-garde art and ideas are often complex and challenging, as they deliberately break from established conventions. It's a common misconception that avant-gardism is simple or straightforward."}],"priority":"★★☆"},"related_words":{"derivatives":["avant-garde (adjective, noun)","avant-gardist (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Avant-gardism' is a term used to describe the principles and practices of avant-garde movements in art, literature, and music. It signifies a radical departure from traditional norms and a commitment to experimentation and innovation. Understanding this term requires familiarity with art history and critical theory, as it often involves complex ideas and challenging aesthetics.","priority":"★★☆"},"example_sentences":[{"sentence":"The early 20th century saw a surge of avant-gardism in European art.","translation":"20世紀初頭には、ヨーロッパの芸術において前衛主義が急増しました。","type":"general","meaning_category":"General"},{"sentence":"Dadaism is a prominent example of avant-gardism that emerged in response to World War I.","translation":"ダダイスムは、第一次世界大戦への反応として生まれた前衛主義の顕著な例です。","type":"example","meaning_category":"Example"},{"sentence":"Avant-gardism often provokes controversy and challenges conventional tastes.","translation":"前衛主義はしばしば論争を引き起こし、従来の趣味に挑戦します。","type":"characteristic","meaning_category":"Characteristic"},{"sentence":"The artist's work embodies the spirit of avant-gardism through its innovative use of materials and techniques.","translation":"そのアーティストの作品は、革新的な素材と技術の使用を通じて、前衛主義の精神を体現しています。","type":"application","meaning_category":"Application"}]}