{"word":"subinfection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不顕性感染、潜在性感染","english_definition":"An infection that is not clinically apparent; a latent or subclinical infection.","examples":[{"sentence":"The patient was found to have a subinfection of the virus, showing no symptoms but still testing positive.","translation":"患者はウイルスの不顕性感染であることが判明し、症状は示さなかったが、検査では陽性を示した。"},{"sentence":"Subinfections can be difficult to detect and may contribute to the spread of disease.","translation":"不顕性感染は検出が難しく、病気の蔓延に寄与する可能性がある。"}],"collocations":["latent subinfection","chronic subinfection","detect subinfection","spread subinfection"],"synonyms":["latent infection","subclinical infection","asymptomatic infection","inapparent infection"],"antonyms":["clinical infection","overt infection","symptomatic infection"]}],"etymology":{"value":"The word \"subinfection\" is formed by combining the prefix \"sub-\" (meaning below, under, or less than) with the word \"infection\". It indicates an infection that is below the threshold of clinical detection or manifestation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbɪnˈfɛkʃən/","syllables":"sub-in-fec-tion"},"inflection":{"noun_plural":"subinfections"},"usage_notes":{"explanation":"\"Subinfection\" refers to an infection that is present in the body but does not produce noticeable symptoms or clinical signs. Individuals with subinfections may still be carriers of the infectious agent and capable of transmitting it to others. Detection often requires specific diagnostic tests, as routine clinical examination would not reveal the presence of the infection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subinfection was cured with antibiotics, and the symptoms disappeared.","correct":"✓ Since it was a subinfection, there were no symptoms to begin with. The antibiotics were used to clear the virus.","note":"Subinfections are asymptomatic, so there are no symptoms to disappear. Antibiotics might be used to clear the infection even without symptoms."},{"incorrect":"✗ Subinfections are always harmless.","correct":"✓ Subinfections can be harmless in some cases, but they can also lead to complications or transmission to others.","note":"While subinfections may not cause immediate harm to the individual, they can still pose risks, such as the potential for the infection to become active later or for transmission to susceptible individuals."}],"priority":"★★☆"},"related_words":{"derivatives":["subinfectious (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"subinfection\" is a specialized medical term that refers to an infection that is present in the body but does not cause noticeable symptoms. It is used in medical and scientific contexts to describe infections that are subclinical or asymptomatic. Understanding this term requires a background in biology or medicine.","priority":"★★☆"},"example_sentences":[{"sentence":"The study aimed to determine the prevalence of subinfections within the population.","translation":"その研究は、集団内における不顕性感染の有病率を特定することを目的としていた。","type":"noun","meaning_category":"不顕性感染"},{"sentence":"Even though the patient showed no signs of illness, tests revealed a subinfection.","translation":"患者は病気の兆候を示さなかったが、検査により不顕性感染が明らかになった。","type":"noun","meaning_category":"不顕性感染"},{"sentence":"Public health measures are essential to control the spread of diseases caused by subinfections.","translation":"公衆衛生対策は、不顕性感染によって引き起こされる病気の蔓延を制御するために不可欠である。","type":"noun","meaning_category":"不顕性感染"}]}