{"word":"Trichloromethane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トリクロロメタン（別名：クロロホルム）","english_definition":"A colorless, volatile, toxic liquid with an ether-like odor, used as a solvent and formerly as an anesthetic.","examples":[{"sentence":"Trichloromethane was once widely used as an anesthetic.","translation":"トリクロロメタンはかつて麻酔薬として広く使用されていました。"},{"sentence":"The chemical formula for trichloromethane is CHCl3.","translation":"トリクロロメタンの化学式はCHCl3です。"}],"collocations":["trichloromethane solvent","trichloromethane extraction","trichloromethane poisoning"],"synonyms":["chloroform","methyl trichloride"],"antonyms":[]}],"etymology":{"value":"'Tri-' (three) + 'chloro-' (chlorine) + 'methane' (the base molecule). Describes the chemical structure of the molecule.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtraɪˌklɔːrəˈmɛθeɪn/","syllables":"tri-clo-ro-me-thane"},"inflection":{"noun_plural":"trichloromethanes"},"usage_notes":{"explanation":"Trichloromethane, commonly known as chloroform, is a chemical compound with the formula CHCl3. It is a dense, colorless liquid with a sweet, ethereal odor. It was historically used as an anesthetic, but due to its toxicity, it has been largely replaced by safer alternatives. It is still used as a solvent in various industrial and laboratory applications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I smelled trichloromethane and felt sleepy.","correct":"✓ I smelled trichloromethane and felt drowsy.","note":"'Sleepy' is a general feeling of wanting to sleep, while 'drowsy' is more specifically associated with the effects of substances like trichloromethane."}],"priority":"★★☆"},"related_words":{"derivatives":["chloroform","dichloromethane","methane"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'trichloromethane' refers to a specific chemical compound. Understanding its properties and uses requires a background in chemistry. The word itself is derived from its chemical structure, indicating three chlorine atoms attached to a methane molecule. While not commonly used in everyday conversation, it is important in scientific and industrial contexts."},"example_sentences":[{"sentence":"Exposure to high concentrations of trichloromethane can be harmful.","translation":"高濃度のトリクロロメタンへの暴露は有害となる可能性があります。","type":"scientific","meaning_category":"toxicity"},{"sentence":"Trichloromethane is a useful solvent in organic chemistry.","translation":"トリクロロメタンは有機化学において有用な溶媒です。","type":"scientific","meaning_category":"uses"}]}