{"word":"andarun","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Historical) The women's quarters in a traditional Ottoman or Persian household.","english_definition":"(Historical) The private living space reserved for women and children in a traditional Ottoman or Persian household, inaccessible to male visitors.","examples":[{"sentence":"The sultan's wives and concubines resided in the andarun.","translation":"スルタンの妻や側室はアンダルンに住んでいた。"},{"sentence":"The architecture of the house carefully separated the andarun from the birun.","translation":"その家の建築は、アンダルンとビルンを注意深く分離していた。"}],"collocations":["enter the andarun","life in the andarun","the women of the andarun"],"synonyms":["harem","zenana"],"antonyms":[]}],"etymology":{"value":"From Persian andarun (اندرون), from andar (اندر) meaning \"inside\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændəˈruːn/","syllables":"an-da-run"},"inflection":{"notes":"Plural: andaruns"},"usage_notes":{"explanation":"The term 'andarun' refers specifically to the women's quarters in Ottoman and Persian contexts. It is often used in historical or cultural discussions. It is important to note that the term can sometimes carry connotations related to the historical restrictions placed on women's lives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The whole family lived in the andarun.","correct":"✓ Only the women and children lived in the andarun.","note":"The andarun was specifically for women and children, not the entire family."}],"priority":"★★☆"},"related_words":{"derivatives":["birun (the outer or public part of the house, for men and guests)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical or cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Andarun' is a specialized term referring to a historical and cultural concept. It requires understanding of Ottoman and Persian social structures to fully grasp its meaning. The word is not commonly used in modern English outside of specific academic or historical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"Access to the andarun was strictly controlled.","translation":"アンダルンへのアクセスは厳しく管理されていた。","type":"noun","meaning_category":"historical women's quarters"},{"sentence":"The novel depicted the lives of women confined within the andarun.","translation":"その小説は、アンダルンに閉じ込められた女性たちの生活を描いていた。","type":"noun","meaning_category":"historical women's quarters"}]}