{"word":"Polystomium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of parasitic flatworms in the family Polystomatidae.","english_definition":"A genus of parasitic flatworms in the family Polystomatidae, typically found in the urinary bladder of amphibians and turtles.","examples":[{"sentence":"The life cycle of Polystomium is complex, involving both sexual and asexual reproduction.","translation":"Polystomiumの生活環は複雑で、有性生殖と無性生殖の両方を含む。"},{"sentence":"Polystomium integerrimum is a common species found in the urinary bladder of frogs.","translation":"Polystomium integerrimumは、カエルの膀胱によく見られる一般的な種である。"}],"collocations":["Polystomium integerrimum","Polystomium life cycle","Polystomium parasite"],"synonyms":["None"],"antonyms":["None"]}],"etymology":{"value":"From poly- (many) + stoma (mouth), referring to the multiple suckers around the mouth of these worms.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈstoʊmiəm/","syllables":"Pol-y-sto-mi-um"},"inflection":{"noun_plural":"Polystomiums"},"usage_notes":{"explanation":"Polystomium is a genus name used in scientific classification. It refers specifically to a group of flatworms that are parasitic, primarily in amphibians and reptiles. When discussing these organisms, it's important to use the correct scientific nomenclature to avoid confusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Polystomium are a type of bacteria.","correct":"✓ Polystomium are a type of flatworm.","note":"Polystomium are flatworms, not bacteria."},{"incorrect":"✗ Polystomium lives in the human intestine.","correct":"✓ Polystomium lives in the urinary bladder of amphibians and reptiles.","note":"Polystomium typically infects amphibians and reptiles, not humans."}],"priority":"★★☆"},"related_words":{"derivatives":["Polystomatidae (family)"],"phrasal_verbs":["None"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polystomium' is a technical term used in the field of parasitology and zoology. It refers to a specific genus of flatworms that are parasitic in nature. Understanding this term requires familiarity with scientific classification and the biology of parasitic organisms. It is not a word commonly encountered outside of specialized scientific literature.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers studied the morphology of Polystomium under a microscope.","translation":"研究者たちは顕微鏡下でPolystomiumの形態を研究した。","type":"noun","meaning_category":"Parasitic flatworm"},{"sentence":"The prevalence of Polystomium infections in local frog populations was assessed.","translation":"地元のカエル個体群におけるPolystomium感染の有病率が評価された。","type":"noun","meaning_category":"Parasitic flatworm"}]}