{"word":"mammillated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"乳頭状突起のある、乳房状の","english_definition":"Having rounded protuberances resembling nipples or breasts.","examples":[{"sentence":"The surface of the rock was mammillated, with small, rounded bumps.","translation":"その岩の表面は乳頭状突起があり、小さく丸い隆起があった。"},{"sentence":"Some cacti have a mammillated appearance due to the arrangement of their tubercles.","translation":"一部のサボテンは、その疣状突起の配置により、乳頭状の外観を呈する。"}],"collocations":["mammillated surface","mammillated texture","mammillated rock","mammillated cactus"],"synonyms":["tuberculate","papillate","nodular","bossed"],"antonyms":["smooth","flat","even"]}],"etymology":{"value":"Derived from the Latin word 'mammilla,' meaning 'little breast' or 'nipple,' with the suffix '-ated' indicating possession of or resemblance to.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmæmɪleɪtɪd","syllables":"mam-il-lay-ted"},"inflection":{},"usage_notes":{"explanation":"'Mammillated' is a descriptive term primarily used in geology, botany, and sometimes medicine to describe a surface or structure covered with rounded, nipple-like projections. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mammillated tree.","correct":"✓ The tree with a mammillated bark.","note":"'Mammillated' describes a surface texture, not the entire object. It's more accurate to say 'the rock with a mammillated surface' or 'the cactus with a mammillated appearance' rather than 'the mammillated rock' or 'the mammillated cactus,' unless the entire object is made of mammillated units."}],"priority":"★★☆"},"related_words":{"derivatives":["mammilla (noun: a small, breast-shaped protuberance)","mammillary (adjective: relating to or resembling a mammilla)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mammillated' is a technical term used to describe a surface that has rounded, nipple-like projections. It is most often encountered in scientific contexts, particularly in geology and botany, to describe the texture of rocks or the appearance of certain plants. Due to its specialized nature, it is not part of common vocabulary and is typically used by those with expertise in the relevant fields."},"example_sentences":[{"sentence":"The geologist described the rock formation as having a distinctly mammillated appearance.","translation":"地質学者は、その岩石の構造が明らかに乳頭状突起のある外観をしていると説明した。","type":"adjective","meaning_category":"乳頭状突起のある"},{"sentence":"The mammillated surface of the mineral sample provided clues about its formation process.","translation":"その鉱物サンプルの乳頭状突起のある表面は、その形成過程の手がかりとなった。","type":"adjective","meaning_category":"乳頭状突起のある"},{"sentence":"This species of cactus is characterized by its mammillated stems.","translation":"この種のサボテンは、乳頭状突起のある茎が特徴である。","type":"adjective","meaning_category":"乳頭状突起のある"}]}