{"word":"Ezana","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"エザナ (4世紀のアクスム王国の王)","english_definition":"Ezana was a king of the Kingdom of Aksum (modern-day Eritrea and Ethiopia) who ruled in the 4th century AD.","examples":[{"sentence":"King Ezana converted the Aksumite kingdom to Christianity.","translation":"エザナ王はアクスム王国をキリスト教に改宗させた。"},{"sentence":"The Ezana Stone provides important historical information about the Aksumite kingdom.","translation":"エザナ石碑はアクスム王国に関する重要な歴史的情報を提供している。"}],"collocations":["King Ezana of Aksum","Ezana Stone","Ezana's conversion to Christianity"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Ezana' is believed to be derived from a Ge'ez word, possibly related to strength or victory.","priority":"★☆☆"},"pronunciation":{"ipa":"/iːˈzɑːnə/","syllables":"E-za-na"},"inflection":{},"usage_notes":{"explanation":"Ezana is primarily known as a historical figure. References to Ezana often appear in the context of ancient Ethiopian history, religious studies (particularly concerning the spread of Christianity in Africa), and archaeology.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Aksum (related kingdom)","Aksumite (adjective relating to Aksum)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ezana' is a proper noun referring to a specific historical figure. Therefore, understanding its usage requires familiarity with ancient Ethiopian history and related topics. The term is not commonly encountered outside of these contexts."},"example_sentences":[{"sentence":"Ezana's reign marked a significant period of expansion for the Aksumite kingdom.","translation":"エザナの治世はアクスム王国にとって重要な拡大期となった。","type":"historical context","meaning_category":"historical figure"},{"sentence":"The inscriptions on the Ezana Stone are written in Ge'ez, Greek, and Sabaean.","translation":"エザナ石碑の碑文は、ゲエズ語、ギリシャ語、サバ語で書かれている。","type":"archaeological context","meaning_category":"historical artifact"}]}