{"word":"cranioclast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"破頭鉗、頭蓋骨破砕器：難産の際に、胎児の頭蓋骨を砕いて取り出すために用いられる器具","english_definition":"A surgical instrument for crushing the fetal skull to facilitate delivery in cases of obstructed labor.","examples":[{"sentence":"The cranioclast was used to reduce the size of the fetal head.","translation":"破頭鉗は、胎児の頭部サイズを縮小するために使用された。"},{"sentence":"Use of the cranioclast is rare in modern obstetrics.","translation":"現代の産科医療において、破頭鉗の使用はまれである。"}],"collocations":["fetal craniotomy","obstructed labor","surgical instrument"],"synonyms":["skull crusher","cephalotribe"],"antonyms":[]}],"etymology":{"value":"From 'cranio-' (referring to the skull) + '-clast' (from Greek 'klastos' meaning broken).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkreɪ.ni.oʊˌklæst/","syllables":"cra-ni-o-clast"},"inflection":{"noun_plural":"cranioclasts"},"usage_notes":{"explanation":"A cranioclast is a specialized surgical instrument used in obstetrics to crush the skull of a dead fetus to allow for easier delivery, typically in cases of obstructed labor. Its use is now rare due to advances in modern obstetrics, such as cesarean sections.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["cranioclasis (noun: 頭蓋骨破砕術)","craniotomy (noun: 開頭術)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cranioclast' refers to a highly specialized surgical instrument used in rare and complex obstetrical procedures. Understanding this term requires advanced knowledge of medical terminology and obstetrical practices. Due to its infrequent use and specialized context, it is not commonly encountered outside of medical settings."},"example_sentences":[{"sentence":"The old medical textbook described the use of the cranioclast in cases of cephalopelvic disproportion.","translation":"その古い医学書には、児頭骨盤不均衡の場合における破頭鉗の使用が記載されていた。","type":"noun","meaning_category":"surgical instrument"},{"sentence":"The development of the cranioclast was an attempt to reduce maternal mortality in obstructed labor.","translation":"破頭鉗の開発は、難産の際の母体死亡率を減少させる試みであった。","type":"noun","meaning_category":"historical context"}]}