{"word":"pre-kindergarteners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"就学前児童（特に幼稚園入園前の子供たち）","english_definition":"Children who are of the age to attend pre-kindergarten, typically 3-4 years old.","examples":[{"sentence":"The pre-kindergarteners were excited to start their first day of school.","translation":"就学前児童たちは、学校の初日を始めることに興奮していました。"},{"sentence":"Our program focuses on developing social skills in pre-kindergarteners.","translation":"私たちのプログラムは、就学前児童の社会性を発達させることに焦点を当てています。"},{"sentence":"Many parents enroll their children in pre-kindergarten programs to prepare them for kindergarten.","translation":"多くの親が、子供たちを幼稚園に入園させる準備として、就学前プログラムに入学させています。"}],"collocations":["pre-kindergarten program","pre-kindergarten teacher","pre-kindergarten classroom","early childhood education"],"synonyms":["preschoolers","toddlers","young children"],"antonyms":["kindergarteners","elementary school students","older children"]}],"etymology":{"value":"The term is formed by combining \"pre-\" (meaning before) with \"kindergarteners\" (children attending kindergarten). It describes children who are in the age range before kindergarten, typically participating in early childhood education programs.","priority":"N/A"},"pronunciation":{"ipa":"/ˌpriːˈkɪndərˌɡɑːrtənərz/","syllables":"pre-kin-der-gar-ten-ers"},"inflection":{"noun_plural":"pre-kindergarteners"},"usage_notes":{"explanation":"The term \"pre-kindergarteners\" refers specifically to children who are of the age to attend pre-kindergarten programs, which are designed to prepare them for kindergarten. These programs often focus on early literacy, numeracy, and social skills. The term is primarily used in educational contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ pre-kindergartens","correct":"✓ pre-kindergarteners","note":"The term refers to the children, not the schools themselves. Use 'pre-kindergarteners' to refer to the children attending pre-kindergarten."}],"priority":"N/A"},"related_words":{"derivatives":["pre-kindergarten (noun/adjective)","kindergarten (noun)","preschool (noun)","early childhood education (noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but common in educational contexts.","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"The term \"pre-kindergarteners\" refers to children who are of the age to attend pre-kindergarten, which is a program designed to prepare them for kindergarten. It is commonly used in educational settings and by parents discussing their young children's education. Understanding the term requires familiarity with the concept of pre-kindergarten as a distinct educational stage.","priority":"N/A"},"example_sentences":[{"sentence":"The curriculum for pre-kindergarteners includes activities that promote cognitive development.","translation":"就学前児童向けのカリキュラムには、認知発達を促進する活動が含まれています。","type":"noun","meaning_category":"就学前児童"},{"sentence":"Many pre-kindergarteners enjoy playing with blocks and engaging in imaginative play.","translation":"多くの就学前児童は、ブロックで遊んだり、想像力豊かな遊びに夢中になったりすることを楽しんでいます。","type":"noun","meaning_category":"就学前児童"},{"sentence":"The teacher read a story to the pre-kindergarteners during circle time.","translation":"先生はサークルタイム中に就学前児童に物語を読みました。","type":"noun","meaning_category":"就学前児童"}]}