{"word":"abstinence-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"禁欲主義に基づいた、断酒・禁欲を基本とする","english_definition":"Based on or advocating complete abstinence from something, especially alcohol or drugs.","examples":[{"sentence":"The treatment program is abstinence-based, requiring participants to remain drug-free.","translation":"その治療プログラムは禁欲主義に基づいており、参加者は薬物を使用しない状態を維持する必要があります。"},{"sentence":"Abstinence-based education teaches young people about the dangers of alcohol and drugs and encourages them to avoid them completely.","translation":"禁欲主義に基づく教育は、若者にアルコールや薬物の危険性について教え、それらを完全に避けるように促します。"}],"collocations":["abstinence-based program (禁欲主義に基づくプログラム)","abstinence-based treatment (禁欲主義に基づく治療)","abstinence-based approach (禁欲主義に基づくアプローチ)","abstinence-based education (禁欲主義に基づく教育)"],"synonyms":["abstinence-only","abstinence-focused"],"antonyms":["harm-reduction-based","medication-assisted"],"notes":["Often used in the context of addiction treatment and education.","Contrasted with harm reduction approaches that aim to minimize the negative consequences of substance use without necessarily requiring complete abstinence."]}],"etymology":{"value":"Combines \"abstinence\" (the practice of restraining oneself from indulging in something) with \"based\" (having a foundation or support).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæbstənənsˌbeɪst/","syllables":"abs-ti-nence-based"},"inflection":{"notes":"Adjective; no inflectional forms."},"usage_notes":{"explanation":"\"Abstinence-based\" describes approaches, programs, or philosophies that prioritize complete avoidance of a substance or behavior. It is commonly used in discussions related to addiction treatment, sexual education, and other areas where self-restraint is emphasized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The abstinence-based is important.","correct":"✓ Abstinence-based treatment is important.","note":"\"Abstinence-based\" is an adjective and needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["abstinence (名詞: 禁欲、節制)"],"related_terms":["abstinence-only education","harm reduction","recovery","sobriety"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Abstinence-based\" is a term used to describe something that relies on completely avoiding a specific substance or activity. It's often used when talking about programs that help people overcome addiction. These programs focus on teaching people how to live without drugs or alcohol. It's a more complex term, so you might not hear it as often as simpler words."},"example_sentences":[{"sentence":"The school's health curriculum includes an abstinence-based approach to sex education.","translation":"その学校の保健カリキュラムには、性教育に対する禁欲主義に基づくアプローチが含まれています。","type":"general","meaning_category":"Education"},{"sentence":"Many faith-based organizations offer abstinence-based support groups for individuals struggling with addiction.","translation":"多くの宗教団体は、依存症に苦しむ個人に対して、禁欲主義に基づく支援グループを提供しています。","type":"general","meaning_category":"Addiction Support"}]}