{"word":"Unabashedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"恥ずかしがらずに、臆面もなく、堂々と","english_definition":"without embarrassment or shame; boldly and openly.","examples":[{"sentence":"She unabashedly admitted her mistake.","translation":"彼女は臆面もなく自分の過ちを認めた。"},{"sentence":"He unabashedly flirted with her in front of everyone.","translation":"彼は皆の前で堂々と彼女を口説いた。"},{"sentence":"The company unabashedly promotes its products with misleading advertisements.","translation":"その会社は恥ずかしげもなく誤解を招く広告で製品を宣伝している。"}],"collocations":["unabashedly admit","unabashedly promote","unabashedly express","unabashedly support","unabashedly pursue"],"synonyms":["shamelessly","brazenly","boldly","openly","flagrantly","unashamedly"],"antonyms":["ashamedly","sheepishly","timidly","hesitantly","reluctantly"]}],"etymology":{"value":"\"Unabashedly\" is formed by adding the suffix \"-ly\" to the adjective \"unabashed.\" \"Unabashed\" comes from \"abashed,\" which means embarrassed or ashamed. The prefix \"un-\" negates this, so \"unabashed\" means not embarrassed or ashamed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈbæʃɪdli/","syllables":"un-a-bash-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Unabashedly\" is used to describe actions or statements made without any sense of shame, embarrassment, or hesitation. It often implies a certain boldness or audacity. The word can be used in both positive and negative contexts, depending on whether the lack of shame is seen as admirable or inappropriate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was unabashedly to speak her mind.","correct":"✓ She spoke her mind unabashedly.","note":"\"Unabashedly\" is an adverb and should modify a verb, not be used with \"to be.\" The correct structure is to place the adverb after the verb or at the beginning of the sentence."},{"incorrect":"✗ He acted unabashed.","correct":"✓ He acted unabashedly.","note":"\"Unabashed\" is an adjective, while \"unabashedly\" is an adverb. Since it modifies the verb \"acted,\" the adverb form is required."}],"priority":"★★☆"},"related_words":{"derivatives":["unabashed (adjective)","abashed (adjective)","abash (verb)"],"related_terms":["shameless","brazen","bold","audacious"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unabashedly\" means doing something in a bold and open way, without feeling any shame or embarrassment. It's used to describe actions or statements that are very direct and confident, even if they might be considered inappropriate by others. It's a more advanced word, so you'll typically find it in more complex texts or discussions."},"example_sentences":[{"sentence":"He unabashedly asked for a raise, citing his excellent performance.","translation":"彼は自分の優れた業績を理由に、臆面もなく昇給を求めた。","type":"adverb","meaning_category":"堂々と"},{"sentence":"The artist unabashedly displayed her controversial artwork.","translation":"その芸術家は物議を醸す自身の作品を堂々と展示した。","type":"adverb","meaning_category":"恥ずかしがらずに"},{"sentence":"She unabashedly expressed her opinion, regardless of the consequences.","translation":"彼女は結果を気にせず、臆面もなく自分の意見を述べた。","type":"adverb","meaning_category":"臆面もなく"}]}