{"word":"quayman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A man who works on a quay; a dockworker.","english_definition":"A worker who loads and unloads ships at a quay.","examples":[{"sentence":"The quayman signaled the crane operator to lower the cargo.","translation":"沖仲仕はクレーンオペレーターに合図して貨物を降ろさせた。"},{"sentence":"Quaymen were busy unloading the ship's cargo.","translation":"沖仲仕たちは船の貨物の荷降ろしで忙しかった。"}],"collocations":["quayman's duties","experienced quayman","skilled quayman"],"synonyms":["dockworker","stevedore","longshoreman","docker"],"antonyms":[]}],"etymology":{"value":"Combination of 'quay' (a wharf or landing stage) and 'man' (a male worker).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːmən/","syllables":"quay-man"},"inflection":{"noun_plural":"quaymen"},"usage_notes":{"explanation":"The term 'quayman' is somewhat archaic and less commonly used in modern English. More common terms include 'dockworker', 'longshoreman', or 'stevedore'. It specifically refers to someone working on a quay, which is a type of wharf or dock.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quayman was responsible for the ship itself.","correct":"✓ The quayman was responsible for the cargo on the ship.","note":"Quaymen handle cargo, not the ship itself. Ship responsibilities fall to the crew and captain."}],"priority":"★☆☆"},"related_words":{"derivatives":["quay (noun: a wharf or landing stage)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'quayman' is a relatively uncommon word referring to a worker who loads and unloads ships at a quay. It's a compound word formed from 'quay' (a type of wharf) and 'man' (referring to a male worker). In modern usage, more common terms like 'dockworker' or 'longshoreman' are generally preferred. Understanding this word requires familiarity with maritime terminology and historical labor practices."},"example_sentences":[{"sentence":"The **quayman** carefully secured the ropes to prevent the cargo from shifting.","translation":"沖仲仕は貨物が移動しないようにロープを慎重に固定した。","type":"noun","meaning_category":"dockworker"},{"sentence":"Experienced **quaymen** knew the most efficient ways to unload the various types of goods.","translation":"経験豊富な沖仲仕は、さまざまな種類の貨物を最も効率的に荷降ろしする方法を知っていた。","type":"noun","meaning_category":"dockworker"}]}