{"word":"Peasanthood","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"農民であること、農民の身分、農民階級","english_definition":"The state or condition of being a peasant; the peasant class or status.","examples":[{"sentence":"Life in peasanthood was often difficult and fraught with hardship.","translation":"農民の生活はしばしば困難で苦難に満ちていた。"},{"sentence":"The peasanthood formed the backbone of the agricultural economy.","translation":"農民階級は農業経済のバックボーンを形成していた。"},{"sentence":"Many social and political movements arose from the peasanthood's struggle for land and rights.","translation":"多くの社会および政治運動が、農民階級の土地と権利のための闘争から生じた。"}],"collocations":["rural peasanthood","historical peasanthood","the plight of the peasanthood","European peasanthood"],"synonyms":["peasantry","rural class","agricultural workers","serfdom (historical context)"],"antonyms":["aristocracy","nobility","gentry"]}],"etymology":{"value":"The word \"peasanthood\" is formed by combining \"peasant\" with the suffix \"-hood,\" which denotes a state, condition, or quality of being.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛzənthʊd/","syllables":"peas-ant-hood"},"inflection":{"noun_plural":"peasanthoods (rarely used)"},"usage_notes":{"explanation":"\"Peasanthood\" refers to the condition, status, or class of peasants. It is often used in historical or sociological contexts to describe the lives, struggles, and social roles of peasants. It is less commonly used in modern contexts, as the term \"peasant\" itself can be considered outdated or even offensive in some situations. The term \"peasantry\" is a more common synonym.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He grew up in peasanthood.","correct":"✓ He grew up in the peasantry. / ✓ He grew up in a peasant family.","note":"\"Peasanthood\" refers to the state or condition, not a specific place or family. Use \"peasantry\" or \"peasant family\" instead."},{"incorrect":"✗ The peasanthoods were diverse.","correct":"✓ The peasantry was diverse. / ✓ The peasant classes were diverse.","note":"\"Peasanthood\" is generally used as a collective noun referring to the state or condition. The plural form \"peasanthoods\" is rare. If referring to different groups, use \"peasant classes\" or \"peasant communities\"."}],"priority":"★★☆"},"related_words":{"derivatives":["peasant","peasantry","peasantlike"],"phrasal_verbs":[],"related_concepts":["feudalism","agrarian society","serfdom","land tenure","rural poverty","social hierarchy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"peasanthood\" is a relatively uncommon term that refers to the state or condition of being a peasant, or to the peasant class as a whole. It is most often encountered in historical, sociological, or anthropological contexts when discussing agrarian societies and the social hierarchy within them. Understanding the word requires a grasp of the term \"peasant\" itself, which describes a person who works the land, typically in a traditional or pre-industrial society, and who often has limited economic or social power. The term can sometimes carry negative connotations, so it's important to use it carefully and with sensitivity.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study examined the social and economic conditions of the European peasanthood during the Middle Ages.","translation":"その研究は、中世ヨーロッパの農民階級の社会的および経済的状況を調査した。","type":"general","meaning_category":"農民の身分・階級"},{"sentence":"The transition from peasanthood to industrial labor was a major shift in the 19th century.","translation":"農民の身分から工業労働への移行は、19世紀の大きな変化だった。","type":"historical","meaning_category":"農民であること"},{"sentence":"The novel vividly portrays the hardships and resilience of the rural peasanthood.","translation":"その小説は、農村部の農民階級の苦難と回復力を鮮やかに描いている。","type":"literary","meaning_category":"農民階級"}]}