{"word":"unoverpaid","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not overpaid; receiving a fair or appropriate level of compensation.","english_definition":"Not receiving excessive compensation; paid a fair or reasonable amount for the work performed.","examples":[{"sentence":"The company prides itself on ensuring its employees are fairly compensated and not unoverpaid.","translation":"その会社は、従業員が公正に報酬を受け取り、過剰に支払われないようにすることを誇りに思っています。"},{"sentence":"While some executives are grossly overpaid, the average worker is often unoverpaid for their contributions.","translation":"一部の幹部は過剰な報酬を得ている一方で、平均的な労働者はその貢献に対してしばしば適切な報酬を得ていません。"}],"collocations":["fairly unoverpaid","appropriately unoverpaid","relatively unoverpaid"],"synonyms":["fairly paid","appropriately compensated","reasonably paid","justly compensated"],"antonyms":["overpaid","excessively compensated","unjustly enriched"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'overpaid'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌʌnˌoʊvərˈpeɪd/","syllables":"un-o-ver-paid"},"inflection":{"adjective_forms":{"comparative":"more unoverpaid","superlative":"most unoverpaid"}},"usage_notes":{"explanation":"'Unoverpaid' is a relatively rare and somewhat awkward word. It is primarily used to emphasize that someone is not receiving excessive compensation, implying that their pay is fair or appropriate. It's often used in contrast to situations where individuals are considered overpaid. Due to its uncommon usage, alternative phrasing such as 'fairly paid' or 'appropriately compensated' might be preferred for clarity.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The unoverpaid worker was happy with his salary.","correct":"✓ The fairly paid worker was happy with his salary.","note":"Using 'fairly paid' is more natural and common than 'unoverpaid' in most contexts."}],"priority":"Low"},"related_words":{"derivatives":["overpaid","underpaid","paid","compensation","salary"],"antonyms":["overpaid"],"synonyms":["fairly compensated","adequately paid"]},"level_frequency":{"CEFR":"C2 (Rare usage)","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'unoverpaid' means that someone is not paid too much; they receive a fair amount of money for the work they do. It is a less common word, and it's often clearer to say 'fairly paid' or 'appropriately compensated' instead. The word is formed by adding 'un-' to 'overpaid,' indicating the opposite of being overpaid. It's typically used in discussions about fair wages and compensation. Because it's not a frequently used word, it might sound a bit unusual in everyday conversation."},"example_sentences":[{"sentence":"The study found that teachers are often unoverpaid relative to the amount of work they do.","translation":"その研究は、教師が仕事量と比較して適切な報酬を得ていないことが多いことを発見しました。","type":"adjective","meaning_category":"fair compensation"},{"sentence":"It's important to ensure that employees are not unoverpaid, but rather receive fair and competitive salaries.","translation":"従業員が過剰に支払われないようにするだけでなく、公正で競争力のある給与を受け取れるようにすることが重要です。","type":"adjective","meaning_category":"appropriate payment"}]}