{"word":"Sapphists","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A term referring to lesbians or women who are attracted to other women. It is derived from the Greek poet Sappho, who wrote about love and attraction between women.","english_definition":"Plural form of 'Sapphist,' referring to lesbians or women who are attracted to other women.","examples":[{"sentence":"The gathering was attended by many sapphists from around the world.","translation":"その集まりには、世界中から多くのサッフィストたちが参加しました。"},{"sentence":"Some historical texts refer to women in same-sex relationships as sapphists.","translation":"いくつかの歴史的な文献では、同性愛の関係にある女性をサッフィストとして言及しています。"}],"collocations":["historical sapphists","modern sapphists","community of sapphists"],"synonyms":["lesbians","homosexual women","women-loving women"],"antonyms":["heterosexuals"]}],"etymology":{"value":"Derived from the name of the Greek poet Sappho, who lived on the island of Lesbos and wrote about love between women.","priority":"Medium"},"pronunciation":{"ipa":"/ˈsæfɪsts/","syllables":"Saf-fists"},"inflection":{"noun_plural":"Sapphists"},"usage_notes":{"explanation":"The term 'sapphist' can sometimes be seen as clinical or outdated, but it is still used in some contexts, particularly in historical or literary discussions. It is essential to be respectful and aware of the connotations when using this term.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Sapphists only refers to women in ancient Greece.","correct":"Sapphists refers to lesbians or women attracted to other women, inspired by the poet Sappho.","note":"The term is not limited to ancient Greece but is used more broadly to describe women attracted to other women."}],"priority":"Low"},"related_words":{"derivatives":["Sapphic (adjective)","Sapphism (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Rare","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'Sapphists' is a more formal and literary term for lesbians, derived from the poet Sappho. It is not commonly used in everyday conversation but may appear in academic or historical contexts. Understanding the term requires familiarity with classical literature and the history of lesbian identity."},"example_sentences":[{"sentence":"The conference explored the works of early sapphists and their impact on modern literature.","translation":"その会議では、初期のサッフィストたちの作品と、それが現代文学に与えた影響について探求しました。","type":"noun","meaning_category":"Lesbians"},{"sentence":"She identified as a sapphist and was proud of her heritage.","translation":"彼女は自身をサッフィストであると認識し、自身の遺産を誇りに思っていました。","type":"noun","meaning_category":"Lesbians"}]}