{"word":"data-sharing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"データ共有","english_definition":"The practice of making data available to others, often for research or collaborative purposes.","examples":[{"sentence":"Data-sharing is essential for advancing scientific research.","translation":"データ共有は科学研究の進歩に不可欠です。"},{"sentence":"The company implemented a new data-sharing policy to improve collaboration.","translation":"その会社は、コラボレーションを改善するために新しいデータ共有ポリシーを導入しました。"},{"sentence":"Concerns about privacy are often raised in discussions about data-sharing.","translation":"プライバシーに関する懸念は、データ共有に関する議論でよく提起されます。"}],"collocations":["data-sharing agreement","data-sharing platform","promote data-sharing","facilitate data-sharing","enable data-sharing","data-sharing policy","open data-sharing"],"synonyms":["information sharing","collaborative data access"],"antonyms":["data hoarding","data silos"]}],"etymology":{"value":"A compound word formed from 'data' and 'sharing', reflecting the action of sharing data.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪtəˌʃɛərɪŋ/","syllables":"da-ta-shar-ing"},"inflection":{"noun_plural":"data-sharings (rarely used, usually refers to specific instances or systems of data sharing)"},"usage_notes":{"explanation":"'Data-sharing' refers to the practice of making data available to other individuals, organizations, or systems. It is often used in the context of scientific research, business collaboration, and government transparency. Effective data-sharing requires careful consideration of privacy, security, and ethical issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ data sharing's","correct":"✓ data sharing","note":"'Data sharing' is often used as an attributive noun, so it doesn't usually take a possessive form unless referring to a specific instance of data sharing."}],"priority":"★★☆"},"related_words":{"derivatives":["data","share","sharing","open data","big data","data governance"],"phrasal_verbs":[],"related_concepts":["data privacy","data security","data governance","data management","open science","collaborative research"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in specialized contexts (e.g., scientific literature, business reports).","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Data-sharing' is a term used to describe the process of making data accessible to others. This is common in research, business, and government. It's important to consider privacy and security when sharing data. The term is generally understood in professional and academic settings."},"example_sentences":[{"sentence":"The researchers emphasized the importance of data-sharing to accelerate the discovery process.","translation":"研究者たちは、発見プロセスを加速させるためにデータ共有の重要性を強調しました。","type":"noun","meaning_category":"データ共有 (研究)"},{"sentence":"Our company has a strict policy on data-sharing with third-party vendors.","translation":"当社には、第三者ベンダーとのデータ共有に関する厳格なポリシーがあります。","type":"noun","meaning_category":"データ共有 (ビジネス)"},{"sentence":"The government promotes data-sharing to improve transparency and accountability.","translation":"政府は、透明性と説明責任を向上させるためにデータ共有を推進しています。","type":"noun","meaning_category":"データ共有 (政府)"}]}