{"word":"feudally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"封建的に、封建制度に基づいて","english_definition":"In a manner relating to or characteristic of feudalism; according to feudal principles or practices.","examples":[{"sentence":"The land was organized feudally, with lords controlling vast territories.","translation":"その土地は封建的に組織され、領主が広大な領土を支配していた。"},{"sentence":"The society was structured feudally, with a clear hierarchy of power and obligation.","translation":"その社会は封建的に構造化され、権力と義務の明確な階層が存在した。"}],"collocations":["organized feudally","structured feudally","governed feudally"],"synonyms":["aristocratically","hierarchically","traditionally"],"antonyms":["equally","democratically","modernly"]}],"etymology":{"value":"The word \"feudally\" is derived from \"feudal,\" which comes from the medieval Latin term \"feudalis,\" pertaining to a \"feudum\" (fief). The suffix \"-ly\" transforms it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfjuːdəli/","syllables":"feu-dal-ly"},"inflection":{"notes":"As an adverb, \"feudally\" does not have different inflections."},"usage_notes":{"explanation":"\"Feudally\" describes actions, systems, or organizations that are structured in a way characteristic of feudalism. It implies a hierarchical system with obligations and duties tied to land ownership and loyalty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company was feudally managed, with everyone having equal say.","correct":"✓ The company was hierarchically managed, with clear levels of authority.","note":"Feudalism implies hierarchy, so using \"feudally\" in a context of equality is incorrect."},{"incorrect":"✗ The system was feudally, leading to innovation and progress.","correct":"✓ The system was traditionally, but it failed to adapt to modern changes.","note":"Feudal systems are generally associated with tradition and resistance to change, not innovation."}],"priority":"★★☆"},"related_words":{"derivatives":["feudal (adjective)","feudalism (noun)","feudatory (noun/adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"feudally\" is an advanced term used to describe something done in a manner related to feudalism, a medieval socio-political system. It's not commonly used in everyday language but appears in historical or academic contexts. Understanding the concept of feudalism is necessary to grasp the meaning of \"feudally.\""},"example_sentences":[{"sentence":"The kingdom was governed feudally, with each lord owing allegiance to the king.","translation":"王国は封建的に統治され、各領主は王に忠誠を誓っていた。","type":"general","meaning_category":"governance"},{"sentence":"The economic system operated feudally, with peasants tied to the land.","translation":"経済システムは封建的に機能し、農民は土地に縛られていた。","type":"general","meaning_category":"economy"}]}