{"word":"unclottable","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not able to be clotted; remaining liquid and not forming a clot.","english_definition":"Not capable of clotting; remaining in a liquid state without forming a clot.","examples":[{"sentence":"The patient's blood was treated with an anticoagulant to keep it unclottable.","translation":"患者の血液は、凝固しないように抗凝固剤で処理された。"},{"sentence":"An unclottable solution is essential for certain medical procedures.","translation":"凝固しない溶液は、特定の医療処置に不可欠である。"}],"collocations":["unclottable blood","unclottable solution","remain unclottable","keep unclottable"],"synonyms":["non-clotting","noncoagulating","fluid","liquid"],"antonyms":["clottable","coagulable","clotting","coagulating"]},{"part_of_speech":"adjective","definition":"(Figurative) Resistant to being solidified or fixed in place.","english_definition":"(Figurative) Resistant to being solidified or fixed in place; not easily brought to a conclusion or resolution.","examples":[{"sentence":"The evidence remained unclottable, making it difficult to reach a verdict.","translation":"証拠は固まらず、判決に達するのが困難だった。"},{"sentence":"His ideas were so fluid and adaptable that they remained unclottable.","translation":"彼のアイデアは非常に流動的で適応性があり、固定化されなかった。"}],"collocations":["unclottable evidence","unclottable ideas","unclottable situation","unclottable state"],"synonyms":["unsettled","unresolved","fluid","mutable"],"antonyms":["settled","resolved","fixed","stable"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'clottable,' which is derived from 'clot' (a mass of coagulated blood or other substance) and the suffix '-able' (capable of).","priority":"Medium"},"pronunciation":{"ipa":"/ʌnˈklɒtəbəl/","syllables":"un-clot-ta-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more unclottable' and 'most unclottable', respectively."},"usage_notes":{"explanation":"'Unclottable' primarily describes substances, particularly blood or solutions, that resist coagulation or clotting. Figuratively, it can describe situations or ideas that resist being solidified or resolved. The term is often used in medical or scientific contexts, but its figurative use extends to discussions of evidence, ideas, or situations that are difficult to finalize or settle.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The blood was unclotted.","correct":"The blood was unclottable.","note":"'Unclotted' means that a clot was present and then broken up. 'Unclottable' means it cannot clot in the first place."},{"incorrect":"The situation is unclotting.","correct":"The situation is unclottable.","note":"'Unclotting' implies something was previously clotted and is now becoming unclotted. 'Unclottable' describes a state of being inherently resistant to clotting or solidifying."}],"priority":"Medium"},"related_words":{"derivatives":["clot","clottable","clotted","clotting","unclot"],"phrasal_verbs":[],"related_medical_terms":["anticoagulant","coagulation","thrombosis","hemostasis"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Unclottable' is a technical term primarily used in medical and scientific contexts to describe substances that do not clot. It can also be used figuratively to describe something that resists being solidified or resolved. Understanding this word requires a good grasp of medical terminology and abstract concepts.","priority":"Medium"},"example_sentences":[{"sentence":"The researcher developed a new compound to render blood samples unclottable for laboratory analysis.","translation":"研究者は、血液サンプルを実験室分析のために凝固させない新しい化合物を開発した。","type":"adjective","meaning_category":"Medical/Scientific"},{"sentence":"The journalist described the political situation as unclottable, with no clear resolution in sight.","translation":"ジャーナリストは、政治状況を解決の見込みがない、固定化できないものとして説明した。","type":"adjective","meaning_category":"Figurative"}]}