{"word":"quadrator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(幾何学)求積家、円積問題の研究者","english_definition":"One who squares, or converts into a square; specifically, one who attempts to square the circle.","examples":[{"sentence":"The ancient geometers were often called quadrators because they sought to find the area of figures.","translation":"古代の幾何学者は、図形の面積を求めることを試みたため、しばしば求積家と呼ばれた。"},{"sentence":"Many quadrators throughout history have tried to solve the problem of squaring the circle.","translation":"歴史を通じて、多くの求積家が円積問題の解決を試みてきた。"}],"collocations":["circle quadrator","geometric quadrator"],"synonyms":["squarer","geometer"],"antonyms":[]}],"etymology":{"value":"From Latin quadratus, past participle of quadrare 'to square', from quadrus 'a square'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkwɒdreɪtər/","syllables":"quad-ra-tor"},"inflection":{"noun_plural":"quadrators"},"usage_notes":{"explanation":"The term 'quadrator' is primarily historical, referring to mathematicians who worked on finding the area of geometric figures, especially in the context of 'squaring the circle,' an ancient geometric problem. It is not commonly used in modern mathematics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good calculator, so he is a quadrator.","correct":"✓ He is skilled in geometry, making him a quadrator in the historical sense.","note":"'Quadrator' specifically refers to someone who attempts to 'square' figures, not just any calculator."}],"priority":"★☆☆"},"related_words":{"derivatives":["quadrature (求積法)","square (正方形、二乗する)","quadrant (四分円)"],"related_terms":["geometry (幾何学)","squaring the circle (円積問題)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Quadrator' is a specialized term primarily used in the context of the history of mathematics, specifically referring to individuals who attempted to find the area of geometric figures, particularly in relation to the problem of 'squaring the circle.' It is not a commonly used term in contemporary mathematics or general language. Understanding requires familiarity with mathematical history and terminology."},"example_sentences":[{"sentence":"The famous quadrator dedicated his life to solving the unsolvable problem.","translation":"その有名な求積家は、解けない問題の解決に生涯を捧げた。","type":"noun","meaning_category":"求積家"},{"sentence":"Historically, the quadrator played a key role in the development of geometric methods.","translation":"歴史的に、求積家は幾何学的方法の発展において重要な役割を果たした。","type":"noun","meaning_category":"求積家"}]}