{"word":"kinship-based","meanings":[{"part_of_speech":"adjective","definition":"血縁関係に基づいた、親族関係に基づいた","english_definition":"organized or structured around kinship ties; based on family relationships.","examples":[{"sentence":"The society is kinship-based, with family ties playing a central role in social organization.","translation":"その社会は血縁関係に基づいており、家族の絆が社会組織において中心的な役割を果たしています。"},{"sentence":"Kinship-based systems of governance are common in many indigenous communities.","translation":"血縁関係に基づいた統治システムは、多くの先住民族コミュニティで一般的です。"},{"sentence":"Their kinship-based network provided them with support and resources.","translation":"彼らの血縁関係に基づいたネットワークは、彼らに支援と資源を提供しました。"}],"collocations":["kinship-based society (血縁社会)","kinship-based system (血縁システム)","kinship-based network (血縁ネットワーク)","kinship-based organization (血縁組織)","kinship-based group (血縁集団)"],"synonyms":["familial","related","consanguineal","lineal"],"antonyms":["non-kin","unrelated","impersonal"],"related_words":["kinship","kin","family","lineage","descent","clan","tribe"],"level_frequency":null,"usage_notes":{"explanation":"'Kinship-based' describes something that is structured or organized around relationships of kinship, that is, relationships based on blood, marriage, or adoption. It is often used to describe social structures, political systems, or economic networks where family ties are very important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The company is kinship-based, hiring only relatives.","correct":"The company is family-owned, hiring mostly relatives.","note":"While a kinship-based organization might favor relatives, 'kinship-based' more broadly refers to the organizational structure being founded on kinship principles, not just hiring practices."}],"priority":"★★☆"},"etymology":{"value":"Derived from 'kinship' (the state of being related by blood) and 'based' (having something as its foundation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɪnʃɪpˌbeɪst/","syllables":"kin-ship-based"},"inflection":{"notes":"This is an adjective and does not inflect."}}]}