{"word":"Nomogeny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)定向進化説：生物の進化が、自然選択だけでなく、内部の法則やプログラムによって方向付けられているという理論。","english_definition":"(biology) The theory that evolution is directed by internal laws or programs, rather than solely by natural selection.","examples":[{"sentence":"Nomogeny suggests that certain evolutionary pathways are predetermined.","translation":"定向進化説は、特定の進化経路があらかじめ決定されていることを示唆している。"},{"sentence":"Some scientists have proposed nomogenetic mechanisms to explain convergent evolution.","translation":"収斂進化を説明するために、定向進化的なメカニズムを提唱する科学者もいる。"}],"collocations":["nomogenetic evolution","internal laws of evolution","directed evolution"],"synonyms":["directed evolution","orthogenesis"],"antonyms":["random mutation","natural selection"]}],"etymology":{"value":"ギリシャ語の 'nomos' (法則) + 'genesis' (起源、生成) から。つまり、「法則による生成」を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/nɒˈmɒdʒəni/","syllables":"no-mo-ge-ny"},"inflection":{"noun_plural":"Nomogenies"},"usage_notes":{"explanation":"Nomogeny is a historical theory in biology, and it is not widely accepted today. The modern synthesis of evolutionary biology emphasizes the role of random mutation and natural selection. However, some researchers continue to investigate the possibility of internal constraints or biases on evolutionary pathways.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Nomogeny is the same as natural selection.","correct":"✓ Nomogeny is an alternative to natural selection.","note":"Nomogeny proposes that evolution is driven by internal laws, whereas natural selection emphasizes the role of environmental pressures."}],"priority":"★★☆"},"related_words":{"derivatives":["nomogenetic (形容詞: 定向進化的な)"],"related_concepts":["orthogenesis","evolutionary constraints","internal selection","developmental bias"]},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Nomogeny is a complex concept related to evolutionary biology. It suggests that evolution isn't just random but follows certain rules or internal programs. This idea is not widely accepted today, as most scientists believe in natural selection and random mutations. However, it's important to understand nomogeny to grasp the history of evolutionary thought. The term is rarely used outside of specialized scientific discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The concept of nomogeny was proposed to explain patterns in the fossil record.","translation":"定向進化説の概念は、化石記録のパターンを説明するために提唱された。","type":"general","meaning_category":"定向進化説"},{"sentence":"Critics of nomogeny argue that it lacks a clear mechanism.","translation":"定向進化説の批判者たちは、それが明確なメカニズムを欠いていると主張する。","type":"criticism","meaning_category":"定向進化説に対する批判"}]}