{"word":"pewy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(slang, humorous) Slightly unwell; feeling a bit off.","english_definition":"(slang, humorous) Feeling slightly ill or unwell; not quite up to par. Often used in a lighthearted or self-deprecating way.","examples":[{"sentence":"I'm feeling a bit pewy today, so I'm going to take it easy.","translation":"今日は少し体調が悪いので、ゆっくり休むことにします。"},{"sentence":"She looked a little pewy after the long flight.","translation":"彼女は長時間のフライトの後、少し体調が悪そうに見えた。"},{"sentence":"I woke up feeling a bit pewy, but I think I'll be okay.","translation":"少し体調が悪い状態で目が覚めたけど、大丈夫だと思います。"}],"collocations":["feel pewy","a bit pewy","slightly pewy","look pewy"],"synonyms":["under the weather","off-color","queasy","unwell","poorly","rough","sickly"],"antonyms":["well","healthy","fit","fine","robust"]}],"etymology":{"value":"Likely a humorous or playful alteration of 'pooey' or 'phew-y,' possibly influenced by the sound or feeling associated with mild discomfort or nausea. The exact origin is uncertain, but it appears to have emerged in informal speech.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpjuːi/","syllables":"pew-y"},"inflection":{"notes":"The word 'pewy' is primarily used as an adjective and does not typically have different inflections. It is not a verb or noun in common usage."},"usage_notes":{"explanation":"'Pewy' is a slang term, often used humorously, to describe a state of feeling slightly unwell or off-color. It is not a formal word and is generally used in casual conversation. It suggests a mild level of discomfort or illness, not severe sickness. The term is often used self-deprecatingly or to downplay the severity of one's condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a pewy.","correct":"✓ I am feeling pewy.","note":"'Pewy' is an adjective, not a noun. Therefore, it should be used to describe a state of being, not as a thing one possesses."},{"incorrect":"✗ He's pewy sick.","correct":"✓ He's feeling pewy.","note":"'Pewy' already implies sickness, so adding 'sick' is redundant. It's better to say 'He's feeling pewy' or 'He's a bit pewy'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_slang":["pooey","phew","yucky","icky"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Very low frequency - Primarily used in informal speech and writing.","priority":"★☆☆"},"readability_explanation":{"level":"Informal/Slang","text":"'Pewy' is a slang word that means feeling a little bit sick or unwell. It's not a serious word and is usually used in a funny or light way. If you say you're 'pewy,' it means you don't feel great, but you're probably not very ill. It's the kind of word you might use with friends or family but not in a formal situation."},"example_sentences":[{"sentence":"I'm feeling a bit pewy after eating that dodgy sushi.","translation":"あの怪しい寿司を食べた後、少し体調が悪い。","type":"adjective","meaning_category":"Slightly unwell"},{"sentence":"She looked a little pewy, so I suggested she take a nap.","translation":"彼女は少し体調が悪そうだったので、昼寝を勧めた。","type":"adjective","meaning_category":"Slightly unwell"},{"sentence":"I woke up feeling pewy, but a cup of tea sorted me out.","translation":"体調が悪い状態で目が覚めたけど、一杯のお茶で良くなった。","type":"adjective","meaning_category":"Slightly unwell"}]}