{"word":"noncompetitively","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"競争的でない方法で、競争を伴わない形で","english_definition":"in a way that does not involve competition; without striving to win or outperform others.","examples":[{"sentence":"The group participated in the activity noncompetitively, focusing on enjoyment and collaboration.","translation":"そのグループは、楽しみと協調に焦点を当てて、競争的でない形で活動に参加した。"},{"sentence":"They played the game noncompetitively, emphasizing skill development over winning.","translation":"彼らは勝つことよりもスキルアップを重視して、競争的でない形でゲームをした。"},{"sentence":"The students were encouraged to engage with the material noncompetitively, focusing on their own learning progress.","translation":"生徒たちは、自身の学習の進捗に焦点を当てて、競争的でない形で教材に取り組むように促された。"}],"collocations":["participate noncompetitively","engage noncompetitively","play noncompetitively","approach noncompetitively"],"synonyms":["collaboratively","cooperatively","amicably","harmoniously","supportively"],"antonyms":["competitively","aggressively","antagonistically","fiercely"]}],"etymology":{"value":"'Non-' (否定接頭辞) + 'competitively' (競争的に)","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒnkəmˈpetɪtɪvli/","syllables":"non-com-pet-i-tive-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Noncompetitively' describes actions or situations where the primary goal is not to win or outperform others. It emphasizes collaboration, personal growth, or simply enjoying the activity. It is often used in educational, recreational, or workplace contexts to promote a positive and inclusive environment.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"They noncompetitively played the game to win.","correct":"They played the game noncompetitively, focusing on skill development.","note":"'Noncompetitively' contradicts the goal of winning. Focus on alternative goals like skill development or enjoyment."},{"incorrect":"The environment was very noncompetitively, which made it stressful.","correct":"The environment was very collaborative, which made it enjoyable.","note":"A noncompetitive environment is generally considered less stressful. If the environment was stressful, it may not have been truly noncompetitive."}],"priority":"N/A"},"related_words":{"derivatives":["noncompetitive (adjective)","competition (noun)","competitive (adjective)","competitively (adverb)"],"phrases":["noncompetitive environment","noncompetitive activity","noncompetitive sport"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Noncompetitively' means doing something without trying to win or beat others. It's about working together or focusing on your own progress rather than comparing yourself to others. This word is often used in discussions about creating a supportive and inclusive environment where everyone feels valued, regardless of their skill level."},"example_sentences":[{"sentence":"The students worked together noncompetitively to solve the puzzle.","translation":"生徒たちは協力して、競争的でない形でパズルを解いた。","type":"adverb","meaning_category":"協調"},{"sentence":"The team members approached the project noncompetitively, sharing ideas and supporting each other.","translation":"チームメンバーは、アイデアを共有し、互いにサポートし合いながら、競争的でない形でプロジェクトに取り組んだ。","type":"adverb","meaning_category":"協力"},{"sentence":"The children played the game noncompetitively, taking turns and helping each other.","translation":"子供たちは順番に交代し、互いに助け合いながら、競争的でない形でゲームをした。","type":"adverb","meaning_category":"遊び"}]}