{"word":"ray-lit","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Illuminated by rays of light; having rays of light shining upon it.","english_definition":"Illuminated by rays of light.","examples":[{"sentence":"The ray-lit meadow shimmered in the early morning sun.","translation":"朝日を浴びて、光に照らされた牧草地はきらめいていた。"},{"sentence":"The mountain peak was ray-lit, a beacon in the dim landscape.","translation":"山の頂は光に照らされ、薄暗い風景の中の灯台のようだった。"}],"collocations":["ray-lit meadow","ray-lit peak","ray-lit forest","ray-lit surface"],"synonyms":["sunlit","illuminated","radiant","glowing"],"antonyms":["shadowed","darkened","dimmed"]},{"part_of_speech":"adjective","definition":"Describing a scene or object that is characterized by the presence and effect of rays of light.","english_definition":"Characterized by the presence and effect of rays of light.","examples":[{"sentence":"The artist captured the ray-lit quality of the water in his painting.","translation":"その画家は、絵の中で水面の光に照らされた様子を捉えた。"},{"sentence":"The photographer sought to create a ray-lit atmosphere in the portrait.","translation":"写真家は、そのポートレートに光に照らされた雰囲気を作り出そうとした。"}],"collocations":["ray-lit scene","ray-lit atmosphere","ray-lit quality","ray-lit effect"],"synonyms":["luminous","radiant","bright","shining"],"antonyms":["obscure","dull","muted"]}],"etymology":{"value":"A compound word formed by combining \"ray\" (a beam of light) and \"lit\" (past participle of \"light,\" meaning illuminated).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈreɪˌlɪt/","syllables":"ray-lit"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"The adjective \"ray-lit\" is primarily descriptive, emphasizing the presence and effect of rays of light on a subject. It often evokes a sense of brightness, clarity, or even a spiritual quality, depending on the context. It is relatively uncommon in everyday speech but can be found in descriptive writing, especially in literature and art criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ray lit room was beautiful.","correct":"✓ The ray-lit room was beautiful.","note":"Hyphenate 'ray-lit' when used as a compound adjective before a noun. Without the hyphen, it could be misinterpreted."},{"incorrect":"✗ The sun ray-litted the landscape.","correct":"✓ The sun illuminated the landscape.","note":"'Ray-lit' is an adjective, not a verb. Use a verb like 'illuminate' or 'light up' to describe the action of rays of light."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["sunlit","moonlit","candlelit"],"related_nouns":["ray","light"]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ray-lit' is relatively uncommon and is used to describe something that is illuminated by rays of light. It is most often found in descriptive writing, where the author wants to emphasize the effect of light on a particular scene or object. Because of its specific and somewhat poetic usage, it is more likely to be encountered by advanced English learners. Understanding the components 'ray' and 'lit' helps in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ray-lit dust motes danced in the cathedral's high windows.","translation":"大聖堂の高い窓の中で、光に照らされた塵が舞っていた。","type":"adjective","meaning_category":"Illuminated by rays of light"},{"sentence":"The artist sought to capture the ray-lit quality of the forest floor.","translation":"そのアーティストは、森の地面の光に照らされた様子を捉えようとした。","type":"adjective","meaning_category":"Characterized by rays of light"}]}