{"word":"Malva","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゼニアオイ属の植物","english_definition":"A genus of about 25-30 species of herbaceous annual, biennial, and perennial plants in the mallow family (Malvaceae), one of which (M. sylvestris) is commonly known as mallow.","examples":[{"sentence":"The garden was filled with various flowers, including the beautiful Malva.","translation":"庭は美しいゼニアオイを含め、様々な花でいっぱいでした。"}],"collocations":["Malva sylvestris (ウスベニアオイ)","Malva parviflora (アメリカフユアオイ)"],"synonyms":["mallow"],"antonyms":[]},{"part_of_speech":"noun","definition":"ウスベニアオイ（Malva sylvestris）","english_definition":"Specifically, Malva sylvestris, a species of mallow with medicinal properties.","examples":[{"sentence":"Malva tea is known for its soothing properties.","translation":"ウスベニアオイ茶は、その鎮静効果で知られています。"}],"collocations":["Malva tea (ウスベニアオイ茶)"],"synonyms":["common mallow","high mallow"],"antonyms":[]}],"etymology":{"value":"Latin malva, from Ancient Greek μαλάχη (malákhē, “mallow”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmælvə/","syllables":"Mal-va"},"inflection":{"noun_plural":"Malvas"},"usage_notes":{"explanation":"'Malva' refers to a genus of plants, and sometimes specifically to the species Malva sylvestris. It's important to note that while 'mallow' can refer to the entire family Malvaceae, 'Malva' is a specific genus within that family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a marshmallow made from Malva.","correct":"✓ I ate a marshmallow.","note":"Marshmallows are not typically made from Malva plants, though the name is derived from the marsh mallow plant (Althaea officinalis), a relative of Malva. Today, they are mainly made from sugar, gelatin, and flavorings."}],"priority":"★★☆"},"related_words":{"derivatives":["Malvaceae (アオイ科)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Malva' is a botanical term referring to a genus of plants in the mallow family. It is not a commonly used word outside of botanical or gardening contexts. Understanding its relationship to the broader family Malvaceae and specific species like Malva sylvestris is key to its proper usage."},"example_sentences":[{"sentence":"The leaves of the Malva plant are edible and have been used in traditional medicine.","translation":"ゼニアオイ属の植物の葉は食用であり、伝統医学で使用されてきました。","type":"noun","meaning_category":"植物"},{"sentence":"She brewed a cup of Malva tea to soothe her sore throat.","translation":"彼女は喉の痛みを和らげるために、ウスベニアオイ茶を淹れました。","type":"noun","meaning_category":"植物"}]}