{"word":"Sinningness","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being sinful; the degree to which something is sinful.","english_definition":"The state or quality of being sinful.","examples":[{"sentence":"The sinningness of his actions was apparent to all.","translation":"彼の行動の罪深さは誰の目にも明らかだった。"},{"sentence":"The priest spoke of the sinningness of greed and envy.","translation":"司祭は貪欲と嫉妬の罪深さについて語った。"}],"collocations":["degree of sinningness","apparent sinningness","inherent sinningness"],"synonyms":["sinfulness","wickedness","immorality","evil","depravity"],"antonyms":["righteousness","goodness","virtue","morality","purity"]}],"etymology":{"value":"Derived from the word 'sinning' (the act of committing a sin) and the suffix '-ness' (denoting a state or quality).","priority":"Medium"},"pronunciation":{"ipa":"ˈsɪnɪŋnəs","syllables":"Sin-ning-ness"},"inflection":{"noun_plural":"Sinningnesses (rarely used)"},"usage_notes":{"explanation":"'Sinningness' is a relatively rare and formal word. It is used to describe the extent or degree to which something is considered sinful. It is often used in theological or philosophical contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The sinningness of the cake was delicious.","correct":"The sinfulness of the cake was that it tempted me to break my diet.","note":"'Sinningness' refers to the quality of being sinful, not the deliciousness of something. It is more appropriate to describe the sinfulness in terms of its moral implications."}],"priority":"Low"},"related_words":{"derivatives":["sin","sinful","sinfully","sinning"],"phrases":["original sin","mortal sin","venial sin"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Sinningness' is a formal and relatively uncommon word that describes the state or quality of being sinful. It is typically used in theological or philosophical discussions to emphasize the degree or extent of sinfulness. Due to its formality and infrequent use, it is more likely to be encountered in advanced texts or discussions."},"example_sentences":[{"sentence":"The preacher emphasized the sinningness of neglecting the poor.","translation":"牧師は貧しい人々を無視することの罪深さを強調した。","type":"General","meaning_category":"State of being sinful"},{"sentence":"The philosopher debated the sinningness of certain actions in hypothetical scenarios.","translation":"その哲学者は、仮説的なシナリオにおける特定の行動の罪深さについて議論した。","type":"Formal","meaning_category":"Degree of sinfulness"}]}