{"word":"Comodato","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(法律) 使用貸借","english_definition":"(Law) A gratuitous loan of a thing to be used by the borrower without payment. The borrower is bound to return the identical thing loaned.","examples":[{"sentence":"El contrato de comodato fue firmado por ambas partes.","translation":"The commodatum contract was signed by both parties.","note":"(Spanish example)"},{"sentence":"Il comodato è un contratto essenzialmente gratuito.","translation":"Commodatum is an essentially gratuitous contract.","note":"(Italian example)"}],"collocations":["contrato de comodato (Spanish: commodatum contract)","contratto di comodato (Italian: commodatum contract)"],"synonyms":["préstamo de uso (Spanish)","prestito d'uso (Italian)"],"antonyms":["mutuo (loan for consumption)"]},{"part_of_speech":"noun","definition":"(一般的な意味) 無償貸与、無償提供","english_definition":"(General sense) A loan or provision of something free of charge for use.","examples":[{"sentence":"El club recibió el estadio en comodato por 20 años.","translation":"The club received the stadium on commodatum for 20 years.","note":"(Spanish example)"},{"sentence":"L'immobile è stato concesso in comodato d'uso gratuito.","translation":"The property was granted on commodatum for free use.","note":"(Italian example)"}],"collocations":["en comodato (Spanish: on commodatum)","in comodato (Italian: on commodatum)"],"synonyms":["préstamo gratuito (Spanish)","prestito gratuito (Italian)"],"antonyms":["alquiler (rent)"]}],"etymology":{"value":"From Latin commodatum, neuter past participle of commodare (“to lend”), from commodus (“suitable, fit, convenient”).","priority":"★★☆"},"pronunciation":{"ipa":"/komoˈdato/","syllables":"co-mo-da-to"},"inflection":{"noun_plural":"comodatos"},"usage_notes":{"explanation":"'Comodato' is a legal term primarily used in Romance languages (Spanish, Italian, Portuguese, etc.) to describe a specific type of loan agreement where an item is lent for use free of charge, with the understanding that the exact same item will be returned. It is distinct from a 'mutuo' where consumable goods are lent and equivalent goods are returned. While the term itself isn't commonly used in English, the concept exists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I rented the house on comodato.","correct":"✓ I borrowed the house on comodato. / ✓ I was granted the use of the house on comodato.","note":"'Comodato' implies a free loan, not a rental agreement."}],"priority":"★★☆"},"related_words":{"derivatives":["comodatario (Spanish, Italian: borrower in a commodatum)","comodante (Spanish, Italian: lender in a commodatum)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency in English; more common in legal and business contexts in Romance languages.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Comodato' is a legal term, primarily encountered in legal or business contexts, especially in countries where Romance languages are spoken. It refers to a specific type of loan where an item is lent free of charge for a specific use, with the obligation to return the exact same item. Understanding this term requires familiarity with legal concepts and terminology.","note":"This explanation is geared towards someone with advanced English proficiency due to the legal context."},"example_sentences":[{"sentence":"El museo recibió la colección de arte en comodato por un período de diez años.","translation":"The museum received the art collection on commodatum for a period of ten years.","type":"noun","meaning_category":"無償貸与"},{"sentence":"Según el contrato de comodato, el prestatario es responsable de cualquier daño a la propiedad.","translation":"According to the commodatum contract, the borrower is responsible for any damage to the property.","type":"noun","meaning_category":"使用貸借"}]}