{"word":"incomprehensively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"理解できないほどに、不可解に","english_definition":"in a way that is impossible to understand.","examples":[{"sentence":"The lecture was delivered incomprehensively, leaving the students confused.","translation":"その講義は理解できないほどに伝えられ、学生たちを混乱させた。"},{"sentence":"He spoke incomprehensively, mumbling and using jargon.","translation":"彼は不可解な話し方で、つぶやき、専門用語を使った。"}],"collocations":["speak incomprehensively","write incomprehensively","explain incomprehensively"],"synonyms":["unintelligibly","obscurely","opaquely","enigmatically"],"antonyms":["comprehensively","intelligibly","clearly","understandably"]}],"etymology":{"value":"\"in-\" (否定) + \"comprehensively\" (包括的に、理解できるように)","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌkɑːmprɪˈhensɪvli/","syllables":"in-com-pre-hen-sive-ly"},"inflection":{"notes":"adverb, no inflection"},"usage_notes":{"explanation":"\"Incomprehensively\" is the adverbial form of \"incomprehensive,\" meaning lacking understanding or not comprehensive. It describes something done or expressed in a way that makes it impossible or very difficult to understand. It is often used to describe speech, writing, or explanations that are confusing or unclear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He explained the theory comprehensive.","correct":"✓ He explained the theory comprehensively.","note":"Use the adverb \"comprehensively\" to describe how something is explained. \"Comprehensive\" is an adjective."},{"incorrect":"✗ The instructions were incomprehensible, so I did it incomprehensively.","correct":"✓ The instructions were incomprehensible, so I did it incorrectly/wrongly.","note":"If the instructions are incomprehensible, you would likely do it incorrectly or wrongly, not necessarily incomprehensively. \"Incomprehensively\" describes the manner of doing something, not the result."}],"priority":"★☆☆"},"related_words":{"derivatives":["incomprehensible (adjective)","comprehensively (adverb)","comprehension (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"incomprehensively\" means in a way that is impossible to understand. It's used to describe actions or communication that are not clear or understandable. For example, if someone speaks \"incomprehensively,\" it means their words are difficult or impossible to follow. This word is not very common and is usually found in more formal or academic contexts."},"example_sentences":[{"sentence":"The professor lectured so quickly and with such complex jargon that he spoke almost incomprehensively.","translation":"教授は非常に速く、また非常に複雑な専門用語を使って講義をしたので、ほとんど理解できないほどだった。","type":"adverb","meaning_category":"unintelligibly"},{"sentence":"The document was written incomprehensively, making it difficult to extract any useful information.","translation":"その文書は不可解に書かれており、有用な情報を抽出するのが困難だった。","type":"adverb","meaning_category":"obscurely"},{"sentence":"He answered the question incomprehensively, avoiding a direct response.","translation":"彼は質問に不可解に答え、直接的な回答を避けた。","type":"adverb","meaning_category":"evasively"}]}