{"word":"trustors","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 委託者、信託設定者","english_definition":"(Law) Plural form of trustor: A person who creates a trust by transferring assets to a trustee. Also known as a settlor or grantor.","examples":[{"sentence":"The trustors established the trust for the benefit of their grandchildren.","translation":"委託者たちは、孫たちの利益のために信託を設定した。"},{"sentence":"As trustors, they retained certain rights over the trust assets.","translation":"委託者として、彼らは信託財産に対して特定の権利を留保した。"}],"collocations":["establish a trust (信託を設定する)","transfer assets (資産を移転する)","retain rights (権利を留保する)","act as trustor (委託者として行動する)"],"synonyms":["settlors","grantors","creators of the trust"],"antonyms":["trustees","beneficiaries"]}],"etymology":{"value":"'Trustor' is derived from 'trust', referring to the legal arrangement, and the suffix '-or', indicating the person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrʌstərz/","syllables":"trus-tors"},"inflection":{"noun_plural":"trustors"},"usage_notes":{"explanation":"The term 'trustor' is primarily used in legal contexts related to trusts. It specifically identifies the individual or entity that creates the trust. While 'settlor' and 'grantor' are often used interchangeably with 'trustor', regional or jurisdictional preferences may exist. It's important to use the term consistently within legal documents.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trustee is the trustor of the estate.","correct":"✓ The trustor is the owner who set up the estate.","note":"The trustor creates the trust, while the trustee manages it. These are distinct roles."},{"incorrect":"✗ Trustors must be beneficiaries of the trust.","correct":"✓ Trustors can be beneficiaries of the trust, but they don't have to be.","note":"The trustor can be a beneficiary, but the roles are not mutually required."}],"priority":"★★☆"},"related_words":{"derivatives":["trust (noun, verb)","trustee (noun)","beneficiary (noun)","trust deed (noun)","trust law (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'trustors' is a legal term referring to the individuals who establish a trust by transferring assets to a trustee. This term is primarily encountered in legal documents and contexts related to estate planning and asset management. Understanding this term requires familiarity with basic legal concepts related to trusts.","priority":"★★☆"},"example_sentences":[{"sentence":"The trustors signed the trust agreement in the presence of a notary.","translation":"委託者たちは、公証人の面前で信託契約書に署名した。","type":"noun","meaning_category":"legal"},{"sentence":"The trustors' intent was to provide financial security for their children's education.","translation":"委託者たちの意図は、子供たちの教育のための経済的安定を提供することだった。","type":"noun","meaning_category":"legal"},{"sentence":"The legal counsel advised the trustors on the implications of the trust agreement.","translation":"法律顧問は、委託者たちに信託契約の影響について助言した。","type":"noun","meaning_category":"legal"}]}