{"word":"stertors","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（医学）喘鳴、いびきのような呼吸音","english_definition":"A heavy snoring sound during inhalation, indicative of partial obstruction of the upper airway.","examples":[{"sentence":"The patient exhibited stertors, indicating a possible airway obstruction.","translation":"患者は喘鳴を示し、気道閉塞の可能性を示唆していた。"},{"sentence":"The doctor listened for stertors to assess the patient's respiratory condition.","translation":"医師は患者の呼吸状態を評価するために喘鳴を聴診した。"}],"collocations":["exhibit stertors","listen for stertors","upper airway stertors"],"synonyms":["snoring","noisy breathing","rattling breath"],"antonyms":[]}],"etymology":{"value":"Late Latin stertor, from Latin stertere (to snore).","priority":"★★★"},"pronunciation":{"ipa":"/ˈstɜːrtɔːrz/","syllables":"ster-tors"},"inflection":{"noun_plural":"stertors"},"usage_notes":{"explanation":"'Stertors' is a medical term used to describe a specific type of noisy breathing that sounds like snoring. It is typically caused by a partial obstruction in the upper airway, such as the trachea or larynx. It is important to distinguish stertors from other types of abnormal breathing sounds, such as stridor or wheezing, as they can indicate different underlying medical conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had stertor.","correct":"✓ The patient had stertors.","note":"'Stertor' is rarely used in singular form. It's almost always referred to in plural, 'stertors', because it describes a series of sounds."}],"priority":"★★☆"},"related_words":{"derivatives":["stertorous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stertors' is a specialized medical term referring to a specific type of noisy breathing resembling snoring, often indicative of upper airway obstruction. Understanding this term is crucial in medical contexts for accurate diagnosis and treatment. It is not commonly used outside of healthcare settings."},"example_sentences":[{"sentence":"The unconscious patient displayed loud stertors.","translation":"意識不明の患者は大きな喘鳴を示した。","type":"medical","meaning_category":"noisy breathing"},{"sentence":"Assessment of the airway revealed the presence of stertors.","translation":"気道の評価により、喘鳴の存在が明らかになった。","type":"medical","meaning_category":"noisy breathing"}]}