{"word":"procarbazine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プロカルバジン：ホジキン病などの治療に用いられる抗がん剤","english_definition":"An antineoplastic drug used to treat Hodgkin's disease and other cancers.","examples":[{"sentence":"Procarbazine is often used in combination with other chemotherapy drugs.","translation":"プロカルバジンはしばしば他の化学療法薬と組み合わせて使用されます。"},{"sentence":"The side effects of procarbazine can include nausea and fatigue.","translation":"プロカルバジンの副作用には、吐き気や倦怠感などがあります。"}],"collocations":["procarbazine hydrochloride","procarbazine treatment","procarbazine side effects"],"synonyms":["Matulane (brand name)"],"antonyms":[]}],"etymology":{"value":"Derived from chemical synthesis, reflecting its structure and function as a synthetic antineoplastic agent.","priority":"☆☆☆"},"pronunciation":{"ipa":"/proʊˈkɑːrbəziːn/","syllables":"pro-car-ba-zine"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Procarbazine is a chemotherapy medication primarily used to treat Hodgkin's lymphoma. It is also used for other types of cancer. It functions by damaging the DNA and RNA within cancer cells, preventing their growth and multiplication. Due to its mechanism of action, procarbazine can have significant side effects, and its use requires careful monitoring by healthcare professionals.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take procarbazine for my headache.","correct":"✓ I am taking procarbazine as part of my chemotherapy treatment for Hodgkin's lymphoma.","note":"Procarbazine is a strong chemotherapy drug and is not used for common ailments like headaches."}],"priority":"☆☆☆"},"related_words":{"derivatives":["alkylating agent","antineoplastic agent","chemotherapy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Procarbazine is a specialized term related to cancer treatment and is typically encountered in medical or pharmaceutical contexts. Understanding its usage requires knowledge of oncology and chemotherapy. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The oncologist prescribed procarbazine as part of the patient's treatment regimen.","translation":"腫瘍医は、患者の治療計画の一部としてプロカルバジンを処方しました。","type":"general","meaning_category":"medical"},{"sentence":"Studies have shown the efficacy of procarbazine in treating certain types of lymphoma.","translation":"研究により、プロカルバジンが特定の種類のがんの治療に有効であることが示されています。","type":"research","meaning_category":"medical research"}]}