{"word":"Comblessness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of being without a comb or crest; lacking a comb.","english_definition":"The state of lacking a comb or crest, especially on a bird.","examples":[{"sentence":"The comblessness of the bird made it difficult to identify its species.","translation":"その鳥が鶏冠を持たないことは、その種を特定することを困難にした。"}],"collocations":["lack of comb","absence of crest"],"synonyms":["crestless","uncrested"],"antonyms":["crested","combed"]}],"etymology":{"value":"Formed from 'combless' (without a comb) + '-ness' (state of being).","priority":"★★★"},"pronunciation":{"ipa":"ˈkoʊm.ləs.nəs","syllables":"comb-less-ness"},"inflection":{"noun_plural":"comblessnesses"},"usage_notes":{"explanation":"This word is primarily used in ornithology or zoology to describe birds or other animals that do not have a comb (a fleshy crest on the head, typically of a rooster) or a similar crest. It is relatively rare in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The comblessness of the hair made it look messy.","correct":"✓ The uncombed hair made it look messy.","note":"'Comblessness' specifically refers to the absence of a comb-like structure, not merely uncombed hair."}],"priority":"★★☆"},"related_words":{"derivatives":["combless (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Comblessness' is a technical term, primarily used in specialized fields like ornithology. It describes the condition of an animal, typically a bird, lacking a comb or crest. Due to its specific and infrequent usage, it is not commonly encountered in general language. Understanding the word requires familiarity with biological terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The genetic mutation resulted in the comblessness observed in the chicken breed.","translation":"その遺伝子変異は、その鶏の品種に見られる鶏冠の欠如をもたらした。","type":"noun","meaning_category":"lack of comb"},{"sentence":"The scientist noted the comblessness of the newly discovered species of bird.","translation":"科学者は、新しく発見された鳥の種の鶏冠の欠如を記録した。","type":"noun","meaning_category":"absence of crest"}]}