{"word":"smooth-rinded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(果物などが)滑らかな皮の、皮が滑らかな","english_definition":"having a smooth rind (outer skin or peel), especially of a fruit.","examples":[{"sentence":"The smooth-rinded oranges were easier to peel.","translation":"皮が滑らかなオレンジは剥きやすかった。"},{"sentence":"She preferred smooth-rinded lemons for making lemonade.","translation":"彼女はレモネードを作るのに皮が滑らかなレモンを好んだ。"}],"collocations":["smooth-rinded orange","smooth-rinded lemon","smooth-rinded fruit"],"synonyms":["smooth-skinned","thin-skinned"],"antonyms":["rough-rinded","thick-rinded","textured"],"notes":"Typically used to describe citrus fruits or melons."}],"etymology":{"value":"Combination of 'smooth' (having an even surface) and 'rinded' (having a rind, an outer skin).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsmuːðˌraɪndɪd/","syllables":"smooth-rind-ed"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"This term is most often used in the context of describing fruits, particularly citrus fruits like oranges, lemons, limes, or grapefruits, and sometimes melons. It emphasizes the texture of the outer skin, indicating that it is not rough, bumpy, or textured.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The smooth-rinded tree was easy to climb.","correct":"✓ The smooth-barked tree was easy to climb.","note":"'Smooth-rinded' is typically used for fruits, not trees. For trees, use 'smooth-barked'."}],"priority":"★★☆"},"related_words":{"derivatives":["rind (noun): the outer skin or peel of a fruit or vegetable","smooth (adjective): having an even surface; not rough"],"related_terms":["rough-rinded","thick-rinded","thin-rinded"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'smooth-rinded' is a descriptive adjective used to specify that a fruit has a smooth outer skin (rind). It is a relatively uncommon term, likely encountered in contexts where the texture of fruit is being specifically described, such as in culinary descriptions or botanical texts. Understanding the component words 'smooth' and 'rind' is helpful in deciphering the meaning."},"example_sentences":[{"sentence":"The chef selected only the most fragrant, smooth-rinded limes for the key lime pie.","translation":"シェフはキーライムパイのために、最も香りが良く、皮が滑らかなライムだけを選んだ。","type":"adjective","meaning_category":"滑らかな皮の"},{"sentence":"Compared to the thick-rinded variety, the smooth-rinded grapefruit was much easier to peel by hand.","translation":"皮の厚い品種に比べて、皮が滑らかなグレープフルーツは手で剥くのがずっと簡単だった。","type":"adjective","meaning_category":"滑らかな皮の"}]}