{"word":"industry-supportive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"産業支援的な、業界を支援する","english_definition":"Providing support or assistance to an industry or industries.","examples":[{"sentence":"The government implemented industry-supportive policies to boost economic growth.","translation":"政府は経済成長を促進するために産業支援的な政策を実施した。"},{"sentence":"The new regulations are not industry-supportive and could harm local businesses.","translation":"新しい規制は産業支援的ではなく、地元の企業に損害を与える可能性がある。"},{"sentence":"He is known for his industry-supportive stance on environmental issues.","translation":"彼は環境問題に対する産業支援的な姿勢で知られている。"}],"collocations":["industry-supportive policies (産業支援的な政策)","industry-supportive measures (産業支援的な措置)","industry-supportive regulations (産業支援的な規制)","industry-supportive environment (産業支援的な環境)","industry-supportive approach (産業支援的なアプローチ)","industry-supportive attitude (産業支援的な態度)","industry-supportive legislation (産業支援的な法律)"],"synonyms":["pro-industry","business-friendly","pro-business","supporting industries","promoting industry"],"antonyms":["anti-industry","industry-restrictive","harmful to industry"]},{"part_of_speech":"adjective","definition":"業界を擁護する、業界の利益を優先する","english_definition":"Advocating for or prioritizing the interests of an industry or industries.","examples":[{"sentence":"Critics argue that the organization is too industry-supportive and ignores public health concerns.","translation":"批評家たちは、その組織は産業支援的すぎ、公衆衛生への懸念を無視していると主張している。"},{"sentence":"The report was criticized for being overly industry-supportive and lacking objectivity.","translation":"その報告書は、過度に産業支援的であり、客観性に欠けると批判された。"}],"collocations":["overly industry-supportive (過度に産業支援的な)","excessively industry-supportive (過度に産業支援的な)","strongly industry-supportive (強く産業支援的な)"],"synonyms":["industry-biased","industry-oriented","industry-focused","industry-aligned"],"antonyms":["impartial","objective","unbiased","neutral"]}],"etymology":{"value":"The word is formed by combining \"industry\" (referring to a sector of economic activity), \"supportive\" (meaning providing help or encouragement), and connecting them with a hyphen.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdʌstri səˈpɔːrtɪv/","syllables":"in-dus-try-sup-por-tive"},"inflection":{"notes":"This is an adjective, so it does not inflect for tense or number."},"usage_notes":{"explanation":"The term \"industry-supportive\" is commonly used in discussions about government policies, regulations, and economic development strategies. It can have both positive and negative connotations, depending on the context and the speaker's perspective. Some view industry-supportive measures as essential for economic growth and job creation, while others criticize them for potentially prioritizing corporate interests over public welfare or environmental protection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy is support industry.","correct":"✓ The policy is industry-supportive.","note":"The correct form is the compound adjective \"industry-supportive,\" not a verb phrase."},{"incorrect":"✗ The government is very support of industry.","correct":"✓ The government is very supportive of industry. / ✓ The government is industry-supportive.","note":"The correct adjective form is \"supportive.\" Using \"industry-supportive\" is more concise."}],"priority":"★★☆"},"related_words":{"derivatives":["supportive (adjective)","industry (noun)","support (noun/verb)"],"related_terms":["pro-business","business-friendly","economic development","industrial policy","deregulation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'industry-supportive' is a compound adjective used to describe policies, actions, or attitudes that aim to help or benefit specific industries. It's often used in economic and political contexts. The meaning is fairly straightforward, but understanding its implications requires knowledge of the specific industry and the potential trade-offs involved (e.g., economic benefits vs. environmental costs)."},"example_sentences":[{"sentence":"The senator proposed industry-supportive legislation to encourage manufacturing in the state.","translation":"その上院議員は、州内の製造業を奨励するために産業支援的な法律を提案した。","type":"general","meaning_category":"General"},{"sentence":"The government's industry-supportive policies have led to significant job growth in the technology sector.","translation":"政府の産業支援的な政策は、技術部門における大幅な雇用創出につながった。","type":"policy","meaning_category":"Policy"},{"sentence":"Critics argue that the proposed regulations are not industry-supportive and will stifle innovation.","translation":"批評家たちは、提案された規制は産業支援的ではなく、イノベーションを阻害すると主張している。","type":"criticism","meaning_category":"Criticism"}]}