{"word":"fovea","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中心窩（ちゅうしんか）","english_definition":"A small depression in the retina of the eye where visual acuity is highest. The center of the field of vision is focused in this region, where retinal cones are particularly concentrated.","examples":[{"sentence":"The fovea is responsible for sharp central vision.","translation":"中心窩は、鮮明な中心視力を担っています。"},{"sentence":"Looking directly at an object focuses its image on the fovea.","translation":"物体を直接見ると、その像が中心窩に焦点を合わせます。"},{"sentence":"Damage to the fovea can result in a loss of central vision.","translation":"中心窩の損傷は、中心視力の喪失につながる可能性があります。"}],"collocations":["fovea centralis","foveal vision","foveal fixation","foveal area"],"synonyms":["central pit","retinal pit"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'fovea', meaning 'small pit' or 'depression'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfoʊviə/","syllables":"fo-ve-a"},"inflection":{"noun_plural":"foveae"},"usage_notes":{"explanation":"The fovea is a specialized region of the retina responsible for high-acuity vision. It is densely packed with cone photoreceptors, which are responsible for color vision and fine detail perception. When we look directly at an object, our eyes position themselves so that the image of the object falls onto the fovea. This allows us to see the object with maximum clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fovea is located in the lens of the eye.","correct":"✓ The fovea is located in the retina of the eye.","note":"The fovea is a part of the retina, not the lens."},{"incorrect":"✗ The fovea is responsible for peripheral vision.","correct":"✓ The fovea is responsible for central vision.","note":"The fovea is specialized for central, high-acuity vision, not peripheral vision."}],"priority":"★★☆"},"related_words":{"derivatives":["foveal (adjective: relating to the fovea)"],"phrases":["foveal vision","foveal fixation"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'fovea' refers to a specialized anatomical feature of the eye, specifically a small pit-like depression located within the retina. Its primary function is to facilitate high-acuity vision due to its high concentration of cone cells. Understanding the fovea is crucial in the context of visual neuroscience and ophthalmology, as it plays a significant role in central vision and visual perception. The word is not commonly used outside of scientific or medical contexts."},"example_sentences":[{"sentence":"The doctor examined the patient's fovea for any signs of macular degeneration.","translation":"医師は、黄斑変性の兆候がないか患者の中心窩を調べました。","type":"medical context","meaning_category":"Anatomy"},{"sentence":"Foveal vision allows us to read and recognize faces with great detail.","translation":"中心窩視力によって、私たちは細かい部分まで読み、顔を認識することができます。","type":"physiology","meaning_category":"Function"},{"sentence":"The image was focused directly onto the fovea for optimal clarity.","translation":"最適な鮮明さのために、画像は中心窩に直接焦点を合わせました。","type":"optics","meaning_category":"Vision"}]}