{"word":"Hobber","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who is perceived as lazy, unproductive, or lacking ambition, often associated with living a simple or nomadic lifestyle.","english_definition":"(slang, derogatory) A person who is perceived as lazy, unproductive, or lacking ambition, often associated with living a simple or nomadic lifestyle.","examples":[{"sentence":"Don't be a hobber; get a job and contribute to society.","translation":"怠け者になるな。仕事を見つけて社会に貢献しろ。"},{"sentence":"He's just a hobber, drifting from place to place without any real purpose.","translation":"彼はただの怠け者で、本当の目的もなくあちこちをさまよっている。"}],"collocations":[],"synonyms":["loafer","idler","bum","drifter","vagabond","slacker","couch potato"],"antonyms":["hard worker","go-getter","achiever","productive member of society"]}],"etymology":{"value":"Likely a blend of 'hobo' and possibly '-er' suffix, suggesting someone who embodies the qualities of a hobo. The term 'hobo' itself has unclear origins, possibly from 'hoe-boy' (migrant farmworker) or a greeting 'Ho, boy!'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒbər/","syllables":"Hob-ber"},"inflection":{"noun_plural":"Hobbers"},"usage_notes":{"explanation":"'Hobber' is a derogatory slang term, primarily used to criticize someone for perceived laziness or lack of ambition. It carries negative connotations and should be used with caution, as it can be offensive. The term implies a judgment about someone's lifestyle and contribution to society.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hobber, so he is very successful.","correct":"✓ He is a hobber, so he struggles to make ends meet.","note":"The term 'hobber' implies a lack of success, so it's contradictory to associate it with success."},{"incorrect":"✗ She is a hobber, working hard every day.","correct":"✓ She is a hard worker, not a hobber.","note":"'Hobber' is the opposite of a hard worker, so the two cannot be used together."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hobo","bum","slacker","drifter","vagabond"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency (slang term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hobber' is a slang term used to describe someone who is seen as lazy, unproductive, and lacking ambition. It is a derogatory term and carries negative connotations. The word suggests a lifestyle of drifting without purpose and avoiding work. Because it is slang and has a judgmental tone, it is not appropriate for formal contexts. Understanding the term requires awareness of social judgments about work ethic and lifestyle choices."},"example_sentences":[{"sentence":"The older generation often criticizes young people, calling them 'hobbers' for not pursuing traditional careers.","translation":"上の世代は、若者が伝統的なキャリアを追求しないことを批判し、「怠け者」と呼ぶことが多い。","type":"noun","meaning_category":"derogatory term"},{"sentence":"He was labeled a 'hobber' after quitting his corporate job to travel the world.","translation":"彼は企業での仕事を辞めて世界を旅した後、「怠け者」というレッテルを貼られた。","type":"noun","meaning_category":"derogatory term"}]}