{"word":"revaluation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(通貨の)切り上げ、再評価","english_definition":"an increase in the value of a currency in relation to other currencies; the act of assessing the value of something again or differently.","examples":[{"sentence":"The government announced a revaluation of the national currency.","translation":"政府は自国通貨の切り上げを発表した。"},{"sentence":"The revaluation of the property led to higher taxes.","translation":"その不動産の再評価により、税金が上がった。"},{"sentence":"Economists debated the potential effects of a revaluation.","translation":"経済学者たちは、切り上げの潜在的な影響について議論した。"}],"collocations":["currency revaluation (通貨切り上げ)","asset revaluation (資産再評価)","property revaluation (不動産再評価)"],"synonyms":["upward adjustment","devaluation (antonym, but related concept)","reassessment","reappraisal"],"antonyms":["devaluation (通貨切り下げ)"],"related_terms":["exchange rate","foreign exchange","monetary policy","inflation","deflation"]}],"etymology":{"value":"'Re-' (again) + 'valuation' (the act of estimating the value of something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːvæljuˈeɪʃən/","syllables":"re-val-u-a-tion"},"inflection":{"noun_plural":"revaluations"},"usage_notes":{"explanation":"'Revaluation' typically refers to two main contexts: currency and assets. In the context of currency, it means a deliberate upward adjustment of a currency's value against a baseline, such as another currency or gold. This is often done by governments or central banks. In the context of assets (like property or investments), it means reassessing the value, which can result in an increase or decrease in the recorded value.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The revaluation caused the exports to increase.","correct":"✓ The revaluation caused the exports to decrease.","note":"A revaluation (currency appreciation) makes exports more expensive for foreign buyers, thus decreasing exports. Devaluation would cause exports to increase."},{"incorrect":"✗ The company did a revaluation of their employees.","correct":"✓ The company did a performance review of their employees.","note":"'Revaluation' is generally used for assets or currency, not for evaluating people. For employees, use 'performance review' or 'evaluation'."}],"priority":"★★☆"},"related_words":{"derivatives":["revalue (verb)","valuation (noun)"],"related_concepts":["devaluation","appreciation","depreciation","inflation","deflation","exchange rate"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low to medium frequency. Primarily used in economics and finance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Revaluation' is a term mainly used in economics and finance. It refers to the act of increasing the official value of a country's currency in relation to other currencies. It can also refer to the reassessment of the value of assets, such as property. This term is more commonly found in discussions about international trade, monetary policy, and investment strategies. Understanding this word requires some familiarity with economic concepts."},"example_sentences":[{"sentence":"The sudden revaluation of the yen surprised many investors.","translation":"円の突然の切り上げは多くの投資家を驚かせた。","type":"currency","meaning_category":"currency revaluation"},{"sentence":"The company decided on a revaluation of its real estate holdings.","translation":"会社は保有する不動産の再評価を決定した。","type":"assets","meaning_category":"asset revaluation"},{"sentence":"A revaluation can make imports cheaper and exports more expensive.","translation":"切り上げは輸入を安くし、輸出を高くする可能性がある。","type":"economic effect","meaning_category":"economic impact"}]}