{"word":"Landbook","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A comprehensive guide or directory providing information about land, properties, or real estate in a specific area.","english_definition":"A comprehensive guide or directory providing information about land, properties, or real estate in a specific area.","examples":[{"sentence":"The Landbook provided detailed information on zoning regulations and property values.","translation":"そのランドブックは、ゾーニング規制と不動産評価に関する詳細な情報を提供していた。"},{"sentence":"Investors often consult the Landbook to identify potential development opportunities.","translation":"投資家は、潜在的な開発機会を特定するために、しばしばランドブックを参照する。"}],"collocations":["consult the Landbook","detailed Landbook","property Landbook","regional Landbook"],"synonyms":["property guide","real estate directory","land registry","property atlas"],"antonyms":[]}],"etymology":{"value":"Likely a compound word combining 'land' (referring to real estate or territory) and 'book' (implying a collection of information).","priority":"★★☆"},"pronunciation":{"ipa":"ˈlændbʊk","syllables":"Land-book"},"inflection":{"noun_plural":"Landbooks"},"usage_notes":{"explanation":"'Landbook' is typically used in professional contexts related to real estate, urban planning, or investment. It suggests a detailed and organized collection of data. The term may be proprietary, referring to a specific publication or database.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read a landbook about the history of the country.","correct":"✓ I read a book about the history of the country.","note":"'Landbook' refers specifically to real estate information, not general history. Use 'book' for general topics."},{"incorrect":"✗ He landbooked the property.","correct":"✓ He researched the property using the Landbook.","note":"'Landbook' is a noun, not a verb. Use it to refer to the resource itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - likely a specialized or proprietary term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Landbook' is a specialized term used in the context of real estate and property information. It refers to a detailed guide or directory. Understanding its meaning requires familiarity with the real estate industry. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The city planner referenced the Landbook during the zoning meeting.","translation":"都市計画家はゾーニング会議中にランドブックを参照した。","type":"noun","meaning_category":"real estate guide"},{"sentence":"The Landbook is updated annually with the latest property assessments.","translation":"ランドブックは最新の不動産評価で毎年更新される。","type":"noun","meaning_category":"real estate guide"}]}