{"word":"twice-forgotten","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"二度忘れられた、二度も忘れ去られた","english_definition":"Having been forgotten on two separate occasions.","examples":[{"sentence":"The twice-forgotten melody resurfaced in his dreams.","translation":"二度も忘れ去られた旋律が、彼の夢の中に再び現れた。"},{"sentence":"The twice-forgotten promise haunted her conscience.","translation":"二度も忘れられた約束が、彼女の良心をさいなみ続けた。"}],"collocations":["twice-forgotten memory (二度忘れられた記憶)","twice-forgotten name (二度忘れられた名前)","twice-forgotten secret (二度忘れられた秘密)"],"synonyms":["repeatedly forgotten","doubly forgotten","recurrently forgotten"],"antonyms":["unforgettable","remembered","cherished"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with the past participle of \"forget\" (forgotten). The hyphen connects the two words to function as a single adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪs fərˈɡɒtn/","syllables":"twice-for-got-ten"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. It can be used to modify nouns in different contexts, but its form remains the same."},"usage_notes":{"explanation":"\"Twice-forgotten\" is a descriptive adjective used to emphasize that something has been forgotten not just once, but on two separate occasions. This repetition of forgetting can suggest a deeper level of neglect, insignificance, or the passage of time. It's often used in literature or poetic contexts to evoke a sense of melancholy or lost history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice forgotten book.","correct":"✓ The twice-forgotten book.","note":"Remember to use the hyphen to connect \"twice\" and \"forgotten\" when they function as a single adjective modifying a noun."},{"incorrect":"✗ He twice forgot the appointment, making it twice forgotten.","correct":"✓ He forgot the appointment twice, making it a twice-forgotten event.","note":"While the first sentence is grammatically correct, the second is more concise and uses the adjective \"twice-forgotten\" effectively."}],"priority":"★★☆"},"related_words":{"derivatives":["forgotten (past participle of forget)","forget (verb)","twice (adverb)"],"phrases":["easily forgotten","long-forgotten","never forgotten"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (This is a relatively rare or specialized term.)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Twice-forgotten\" is a compound adjective that means something has been forgotten two times. It's not a common word, so it's more likely to be found in literature or creative writing where the author wants to emphasize the extent to which something has been neglected or lost in memory. It suggests a deeper level of being forgotten than simply being forgotten once."},"example_sentences":[{"sentence":"The twice-forgotten language was only spoken by a handful of elders.","translation":"その二度忘れられた言語は、ほんの一握りの高齢者によってのみ話されていた。","type":"adjective","meaning_category":"二度忘れられた"},{"sentence":"The old photograph depicted a twice-forgotten moment in their family history.","translation":"その古い写真は、彼らの家族の歴史の中で二度忘れられた瞬間を描いていた。","type":"adjective","meaning_category":"二度忘れられた"}]}