{"word":"Ankaramite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"Ankaramite is a dark-colored, porphyritic volcanic rock, a variety of basalt, characterized by abundant phenocrysts of clinopyroxene (usually augite) and olivine. Plagioclase feldspar is typically absent or occurs only as a groundmass phase.","english_definition":"A dark-colored, porphyritic volcanic rock, a variety of basalt, characterized by abundant phenocrysts of clinopyroxene (usually augite) and olivine.","examples":[{"sentence":"The Ankaramite lava flows are common in the region.","translation":"アンカラマイトの溶岩流はその地域でよく見られる。"}],"collocations":["Ankaramite lava","Ankaramite basalt","Ankaramite flows"],"synonyms":["Olivine basalt","Augite basalt"],"antonyms":[]}],"etymology":{"value":"Named after Ankaramy, a region in Madagascar where it was first described.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæŋkəˈræmaɪt/","syllables":"An-ka-ra-mite"},"inflection":{"noun_plural":"Ankaramites"},"usage_notes":{"explanation":"Ankaramite is primarily a geological term. It's used in the context of describing volcanic rocks and their composition. It's not a commonly used word outside of geology and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Basalt","Volcanic rock","Igneous rock","Olivine","Augite","Clinopyroxene"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Ankaramite is a technical term used in geology to describe a specific type of volcanic rock. Understanding this term requires knowledge of petrology and mineralogy. It's not a word commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The mineral composition of the Ankaramite sample was analyzed using X-ray diffraction.","translation":"アンカラマイト試料の鉱物組成は、X線回折を用いて分析された。","type":"noun","meaning_category":"Volcanic rock"},{"sentence":"The Ankaramite flows created unique geological formations in the area.","translation":"アンカラマイトの溶岩流は、その地域に独特の地質学的構造を形成した。","type":"noun","meaning_category":"Volcanic rock"}]}