{"word":"valve-grinding","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バルブ研磨（エンジン整備における）","english_definition":"The process of resurfacing valves and valve seats in an internal combustion engine to ensure a tight seal.","examples":[{"sentence":"Valve-grinding is an essential part of engine rebuilding.","translation":"バルブ研磨はエンジン再構築の不可欠な部分です。"},{"sentence":"The mechanic recommended valve-grinding to improve engine compression.","translation":"整備士はエンジンの圧縮を改善するためにバルブ研磨を推奨しました。"}],"collocations":["engine valve-grinding","valve-grinding compound","perform valve-grinding"],"synonyms":["valve lapping","valve refacing"],"antonyms":[]}],"etymology":{"value":"The term is a compound word. 'Valve' refers to the engine valve, and 'grinding' refers to the process of using an abrasive to smooth and resurface the valve and valve seat.","priority":"★★★"},"pronunciation":{"ipa":"ˈvælvˌɡraɪndɪŋ","syllables":"valve-grind-ing"},"inflection":{"noun_plural":"valve-grindings (rarely used)"},"usage_notes":{"explanation":"'Valve-grinding' is a specific term used in automotive engineering and engine maintenance. It refers to the procedure of precisely grinding the surfaces of engine valves and their corresponding seats to create a perfect seal, which is crucial for optimal engine performance. This process is typically performed during engine overhauls or when compression issues arise.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to do a valve grind.","correct":"✓ I need to do valve-grinding.","note":"'Valve-grinding' is the correct term for the process. 'Valve grind' is less common and less precise."},{"incorrect":"✗ Valve-grinding is used to clean the engine block.","correct":"✓ Valve-grinding is used to resurface the valves and valve seats.","note":"Valve-grinding specifically addresses the valves and valve seats, not the entire engine block."}],"priority":"★★☆"},"related_words":{"derivatives":["valve","grinding","lapping compound","valve seat","engine rebuild"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency (Technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Valve-grinding' is a technical term used in the context of engine maintenance and repair. It refers to the process of resurfacing the valves and valve seats in an internal combustion engine to ensure a tight seal. This is typically done to improve engine compression and overall performance. Understanding this term requires some familiarity with automotive mechanics.","priority":"★★★"},"example_sentences":[{"sentence":"Proper valve-grinding ensures optimal engine compression and performance.","translation":"適切なバルブ研磨は、最適なエンジンの圧縮と性能を保証します。","type":"noun","meaning_category":"Engine maintenance"},{"sentence":"The mechanic used valve-grinding compound to resurface the valve seats.","translation":"整備士はバルブシートを再研磨するためにバルブ研磨剤を使用しました。","type":"noun","meaning_category":"Engine maintenance"},{"sentence":"Valve-grinding is a labor-intensive process that requires precision and skill.","translation":"バルブ研磨は、精密さとスキルを必要とする労働集約的なプロセスです。","type":"noun","meaning_category":"Engine maintenance"}]}