{"word":"veridicality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"真実性、真正性、真理に合致していること","english_definition":"The quality of being veridical; correspondence to truth or reality.","examples":[{"sentence":"The veridicality of his statement was questioned by the investigators.","translation":"彼の供述の真実性は捜査官によって疑問視された。"},{"sentence":"Establishing the veridicality of the historical account is crucial for understanding the past.","translation":"その歴史的記述の真実性を確立することは、過去を理解するために重要である。"},{"sentence":"The experiment aimed to test the veridicality of the eyewitness testimony.","translation":"その実験は目撃証言の真実性を検証することを目的としていた。"}],"collocations":["establish veridicality (真実性を確立する)","test veridicality (真実性を検証する)","assess veridicality (真実性を評価する)","question veridicality (真実性を疑う)"],"synonyms":["truthfulness","authenticity","genuineness","accuracy","correctness","validity"],"antonyms":["falsity","inaccuracy","invalidity","untruthfulness"]}],"etymology":{"value":"Derived from 'veridical', which comes from Latin 'veridicus' (truth-telling), from 'verus' (true) + 'dicere' (to say).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛrɪˈdɪkæləti/","syllables":"ve-ri-di-cal-i-ty"},"inflection":{"noun_plural":"veridicalities (rarely used)"},"usage_notes":{"explanation":"'Veridicality' is a relatively formal and technical term, primarily used in philosophy, epistemology, psychology, and related fields. It refers to the degree to which something (a statement, perception, belief, memory, etc.) corresponds to reality or truth. It is often used in discussions about the reliability of sources of information and the nature of knowledge.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The veridicality of the painting made it valuable.","correct":"✓ The authenticity of the painting made it valuable.","note":"While 'veridicality' refers to truth correspondence, 'authenticity' is more commonly used when discussing the genuineness of an object like a painting."},{"incorrect":"✗ He showed great veridicality in his daily life.","correct":"✓ He showed great integrity in his daily life.","note":"'Veridicality' is not typically used to describe a person's overall character. 'Integrity' or 'honesty' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["veridical (adjective: truthful, corresponding to reality)","veridically (adverb: in a veridical manner)"],"related_terms":["epistemology (認識論)","ontology (存在論)","truth theory (真理説)","correspondence theory of truth (真理整合説)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (highly specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Veridicality' is a formal term that means how well something matches the truth or reality. It's often used when talking about whether statements, beliefs, or perceptions are accurate. You might see it in discussions about philosophy, psychology, or when people are analyzing information to see if it's reliable. It's not an everyday word, but it's useful when you need to be precise about truth and accuracy."},"example_sentences":[{"sentence":"The study examined the veridicality of children's memories after traumatic events.","translation":"その研究は、トラウマとなる出来事の後の子供たちの記憶の真実性を調べた。","type":"general","meaning_category":"真実性"},{"sentence":"Philosophers debate the criteria for establishing the veridicality of perceptual experiences.","translation":"哲学者たちは、知覚経験の真実性を確立するための基準について議論する。","type":"academic","meaning_category":"真実性"},{"sentence":"The court needed to determine the veridicality of the witness's account before making a judgment.","translation":"裁判所は判決を下す前に、証人の証言の真実性を判断する必要があった。","type":"legal","meaning_category":"真実性"}]}