{"word":"overpartially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"部分的に偏りすぎる、部分的に不公平すぎる","english_definition":"In a manner that is excessively partial or unfair; exhibiting too much bias towards one side or aspect.","examples":[{"sentence":"The judge was accused of ruling overpartially in favor of the plaintiff.","translation":"その裁判官は、原告に有利になるように過度に偏った判決を下したとして告発された。"},{"sentence":"The report presented the data overpartially, emphasizing only the positive results.","translation":"その報告書は、肯定的な結果のみを強調して、データを部分的に偏って提示した。"}],"collocations":["rule overpartially","present data overpartially","judge overpartially"],"synonyms":["excessively partially","unfairly","biasedly","prejudicially"],"antonyms":["impartially","fairly","objectively"]}],"etymology":{"value":"The word is formed by adding the prefix 'over-' (meaning excessively or too much) to 'partially' (meaning in a partial or biased manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈpɑːrʃəli/","syllables":"o-ver-par-tial-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Overpartially' describes an action or situation where someone is not just partially biased, but excessively so. It suggests a level of unfairness that goes beyond what might be considered normal partiality. It is a relatively rare word, but useful when describing situations where bias is extreme.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The review was overpartial, but still informative.","correct":"✓ The review was overpartially biased, but still informative.","note":"'Overpartial' is not a standard word. Use 'overpartially biased' or 'excessively partial' instead."}],"priority":"★★★"},"related_words":{"derivatives":["overpartiality (noun): excessive partiality or bias","partial (adjective): biased, favoring one side","partially (adverb): in a partial or biased manner"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Overpartially' is a complex word indicating an extreme degree of bias or unfairness. It is not commonly used and would be appropriate for advanced English speakers who need to express nuanced criticism of biased actions or judgments. Understanding the root word 'partial' and the prefix 'over-' is essential for comprehending its meaning."},"example_sentences":[{"sentence":"The media coverage was criticized for portraying the issue overpartially, focusing solely on one perspective.","translation":"そのメディア報道は、一つの視点のみに焦点を当てて、問題を部分的に偏って描写しているとして批判された。","type":"adverb","meaning_category":"biasedly"},{"sentence":"He approached the task overpartially, favoring his friends' suggestions over others.","translation":"彼はそのタスクに部分的に偏って取り組み、他の人よりも友人の提案を優先した。","type":"adverb","meaning_category":"unfairly"}]}