{"word":"manway","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(工業用タンクなどの)マンウェイ、点検口","english_definition":"A hole or opening, usually circular, in a tank or other vessel that is large enough to allow a person to enter for inspection, cleaning, or repair.","examples":[{"sentence":"The technician entered the tank through the manway to inspect the interior.","translation":"技術者は内部を点検するためにマンウェイを通ってタンクに入った。"},{"sentence":"Make sure the manway is properly sealed after inspection.","translation":"点検後、マンウェイが適切に密閉されていることを確認してください。"}],"collocations":["access manway","tank manway","seal the manway","inspect through the manway"],"synonyms":["access hole","inspection port","entry point"],"antonyms":["N/A - no direct antonyms, but could consider 'sealed opening' or 'closed access point'"]},{"part_of_speech":"noun","definition":"(潜水艦の)ハッチ","english_definition":"A hatch or opening on a submarine.","examples":[{"sentence":"The crew secured the manway before submerging the submarine.","translation":"乗組員は潜水艦を潜水させる前にマンウェイを固定した。"}],"collocations":["secure the manway","close the manway"],"synonyms":["hatch","access hatch"],"antonyms":[]}],"etymology":{"value":"Combination of 'man' (referring to a person) and 'way' (referring to a passage or opening).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmænweɪ","syllables":"man-way"},"inflection":{"noun_plural":"manways"},"usage_notes":{"explanation":"A 'manway' is a specialized term primarily used in industrial settings (like chemical plants, oil refineries, water treatment facilities) and in the context of submarines. It refers to an opening that is specifically designed to allow a person to enter a confined space for maintenance, inspection, or repair. It's not a common word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the manway to drain the tank.","correct":"✓ He used the drain valve to drain the tank. / ✓ He entered the tank through the manway.","note":"A manway is for entry, not typically for draining. Draining would use a drain valve or other designated outlet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["bulkhead","hatch","valve","tank","vessel","confined space"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (highly specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Manway' is a technical term used in industrial and engineering contexts. Understanding its meaning requires familiarity with industrial equipment and processes. It's not a word typically encountered in general English conversation or writing. The term is most often used by engineers, technicians, and maintenance personnel working with tanks, vessels, or submarines."},"example_sentences":[{"sentence":"The maintenance crew opened the **manway** to perform the annual inspection of the storage tank.","translation":"メンテナンスクルーは、貯蔵タンクの年次点検を行うためにマンウェイを開けた。","type":"noun","meaning_category":"工業用タンクの点検口"},{"sentence":"Before entering the confined space, ensure that the atmosphere inside is safe by testing through the **manway**.","translation":"密閉空間に入る前に、マンウェイを通して内部の雰囲気が安全であることを確認してください。","type":"noun","meaning_category":"工業用タンクの点検口"},{"sentence":"The submarine's **manway** was sealed tight to prevent water from entering during the dive.","translation":"潜水艦のマンウェイは、潜水中の水の侵入を防ぐためにしっかりと密閉されていた。","type":"noun","meaning_category":"潜水艦のハッチ"}]}