{"word":"Hellenisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ギリシャ化、ギリシャ文化の普及、ギリシャ風にすること","english_definition":"The process of spreading Greek culture, language, and identity, or of becoming Greek in character.","examples":[{"sentence":"The Hellenisation of the Eastern Mediterranean occurred during the Hellenistic period.","translation":"東地中海のギリシャ化は、ヘレニズム時代に起こった。"},{"sentence":"Some scholars argue that Roman culture underwent a degree of Hellenisation.","translation":"ローマ文化は、ある程度のギリシャ化を経験したと主張する学者もいる。"},{"sentence":"The Hellenisation of local elites helped to consolidate Greek power.","translation":"地元のエリートのギリシャ化は、ギリシャの権力を強化するのに役立った。"}],"collocations":["cultural Hellenisation (文化的なギリシャ化)","political Hellenisation (政治的なギリシャ化)","Hellenisation of the East (東方のギリシャ化)","process of Hellenisation (ギリシャ化の過程)"],"synonyms":["Grecization","Greek influence","cultural assimilation to Greek culture"],"antonyms":["Dehellenization"],"related_terms":["Hellenistic period (ヘレニズム時代)","Hellenic (ギリシャの)","Hellenophile (ギリシャ文化愛好家)","Hellenophone (ギリシャ語話者)"]}],"etymology":{"value":"Derived from 'Hellenize', which comes from the Greek word 'Hellēnizein' (Ἑλληνίζειν) meaning 'to speak Greek, to side with the Greeks'. 'Hellēn' (Ἕλλην) was the Greek word for a Greek person.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛlɪnaɪˈzeɪʃən/","syllables":"Hel-le-ni-sa-tion"},"inflection":{"noun_plural":"Hellenisations"},"usage_notes":{"explanation":"'Hellenisation' refers to the historical spread of Greek culture, language, and population into foreign lands, particularly during the Hellenistic period following Alexander the Great's conquests. It can also refer to the adoption or imitation of Greek customs and practices. The term is often used in historical and cultural contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Hellenisation was only about language.","correct":"✓ The Hellenisation involved language, culture, and politics.","note":"Hellenisation is a multifaceted process involving not only language but also culture, politics, and social structures."},{"incorrect":"✗ Hellenisation is a modern phenomenon.","correct":"✓ Hellenisation primarily refers to historical processes, especially during the Hellenistic period.","note":"Hellenisation is mainly used in historical contexts, particularly concerning the spread of Greek culture in ancient times."}],"priority":"★★☆"},"related_words":{"derivatives":["Hellenize (verb: ギリシャ化する)","Hellenized (adjective: ギリシャ化した)","Hellenic (adjective: ギリシャの)","Hellenism (noun: ギリシャ主義、ギリシャ文化)"],"related_concepts":["Cultural assimilation (文化同化)","Cultural diffusion (文化伝播)","Imperialism (帝国主義)","Acculturation (文化変容)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hellenisation' is a term used in historical and cultural studies to describe the spread of Greek culture, language, and identity, particularly during the Hellenistic period. It involves understanding complex historical processes and cultural interactions. The term is not commonly used in everyday conversation and is more likely to be encountered in academic or specialized contexts."},"example_sentences":[{"sentence":"The Hellenisation of Egypt had a profound impact on its art and architecture.","translation":"エジプトのギリシャ化は、その芸術と建築に深い影響を与えた。","type":"noun","meaning_category":"ギリシャ文化の普及"},{"sentence":"The local population underwent Hellenisation through education and trade.","translation":"地元の住民は、教育と貿易を通じてギリシャ化された。","type":"noun","meaning_category":"ギリシャ風にすること"},{"sentence":"The process of Hellenisation led to the creation of a new, syncretic culture.","translation":"ギリシャ化の過程は、新しい、融合的な文化の創造につながった。","type":"noun","meaning_category":"ギリシャ化の過程"}],"japanese_reading":"ヘレニゼーション","japanese_definition":"ギリシャ文化、言語、アイデンティティの普及、またはギリシャ風になること。"}