{"word":"Englishism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"英語特有の表現、英語らしい言い回し、英語主義","english_definition":"A word, phrase, idiom, or other linguistic feature characteristic of or derived from the English language. Also, the practice of favoring or adopting English language or culture.","examples":[{"sentence":"The sentence structure is an obvious Englishism.","translation":"その文構造は明らかな英語特有の言い回しだ。"},{"sentence":"His writing is full of Englishisms, which can be confusing for non-native speakers.","translation":"彼の文章は英語特有の表現で溢れており、非ネイティブスピーカーには混乱を招くことがある。"},{"sentence":"The restaurant's menu featured several dishes with Englishisms in their descriptions.","translation":"そのレストランのメニューには、説明に英語特有の言い回しを使った料理がいくつかあった。"}],"collocations":["obvious Englishism","common Englishism","linguistic Englishism","cultural Englishism"],"synonyms":["Anglicism","English idiom","English expression"],"antonyms":[]}],"etymology":{"value":"\"English\" + \"-ism\". Used to denote a characteristic feature or practice associated with the English language or culture.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪŋɡlɪʃɪzəm/","syllables":"Eng-lish-ism"},"inflection":{"noun_plural":"Englishisms"},"usage_notes":{"explanation":"\"Englishism\" refers to a linguistic feature (word, phrase, idiom, grammatical structure) that is characteristic of the English language. It can also refer to the adoption or favoring of English language or culture. It is often used when discussing language transfer, where features of English are used in another language, sometimes inappropriately.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word 'computer' is a Japaneseism.","correct":"✓ The word 'computer' is an Englishism.","note":"'Computer' originated in English, so it's an Englishism, not a Japaneseism."},{"incorrect":"✗ He used many Americanisms in his British English.","correct":"✓ He used many Englishisms in his British English.","note":"While Americanisms are a subset of Englishisms, the term 'Englishism' is more general."}],"priority":"★★☆"},"related_words":{"derivatives":["Anglicism","Americanism","Briticism"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Englishism\" is a term used to describe a feature that is characteristic of the English language. This can include words, phrases, idioms, or grammatical structures. The term is often used in the context of language learning or translation, where someone might use an English-specific expression that doesn't translate well into another language. It can also refer to the adoption of English cultural elements. The word is relatively uncommon and is most often used in linguistic or academic discussions."},"example_sentences":[{"sentence":"The use of the word 'literally' in an exaggerated way is a common Englishism.","translation":"誇張された方法で「literally」という言葉を使うのは、一般的な英語特有の表現だ。","type":"noun","meaning_category":"English expression"},{"sentence":"The translator struggled to avoid Englishisms in the French version of the novel.","translation":"翻訳者は、小説のフランス語版で英語特有の表現を避けるのに苦労した。","type":"noun","meaning_category":"Linguistic feature"},{"sentence":"The adoption of English business practices is seen by some as an Englishism.","translation":"英語のビジネス慣行の採用は、一部の人々によって英語主義と見なされている。","type":"noun","meaning_category":"Cultural influence"}]}