{"word":"litigiosamente","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"in a litigious manner; in a way that involves or encourages lawsuits or legal disputes.","english_definition":"in a manner characterized by a tendency to engage in lawsuits or legal disputes; contentiously.","examples":[{"sentence":"El caso se resolvió litigiosamente después de meses de negociaciones fallidas.","translation":"The case was resolved litigiously after months of failed negotiations.","note":"This example shows the contentious nature of the resolution."},{"sentence":"La empresa es conocida por actuar litigiosamente contra cualquier competidor que infrinja sus patentes.","translation":"The company is known for acting litigiously against any competitor that infringes its patents.","note":"This example highlights the company's tendency to use lawsuits."}],"collocations":["resolver litigiosamente (to resolve litigiously)","actuar litigiosamente (to act litigiously)","abordar litigiosamente (to approach litigiously)"],"synonyms":["contenciosamente","judicialmente","legalmente","polemicamente","disputadamente"],"antonyms":["amigablemente","pacíficamente","conciliadoramente","amistósamente"],"notes":"This word describes a manner of action, emphasizing a tendency towards legal disputes."}],"etymology":{"value":"Derived from the Spanish adjective 'litigioso' (litigious) and the suffix '-mente' (equivalent to '-ly' in English). 'Litigioso' comes from the Latin 'litigiosus', pertaining to a lawsuit.","priority":"N/A"},"pronunciation":{"ipa":"/li.ti.xjoˈsa.men.te/","syllables":"li-ti-gio-sa-men-te"},"inflection":{"notes":"As an adverb, 'litigiosamente' does not inflect for gender or number."},"usage_notes":{"explanation":"'Litigiosamente' describes actions or behaviors that are characterized by a willingness or tendency to engage in legal disputes. It implies a contentious or adversarial approach. It is often used in legal or business contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El acuerdo fue litigioso.","correct":"El acuerdo se resolvió litigiosamente.","note":"'Litigioso' (adjective) describes something prone to litigation; 'litigiosamente' (adverb) describes how something is done."}],"priority":"N/A"},"related_words":{"derivatives":["litigioso (adjective: litigious)","litigio (noun: lawsuit, litigation)","litigar (verb: to litigate, to sue)"],"priority":"N/A"},"level_frequency":{"frequency_corpus":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'litigiosamente' is a relatively advanced term used to describe actions done in a manner that involves or encourages legal disputes. It is most commonly found in legal, business, or academic contexts. Understanding this word requires a good grasp of legal concepts and vocabulary."},"example_sentences":[{"sentence":"Las partes resolvieron el conflicto litigiosamente, llevando el caso a los tribunales.","translation":"The parties resolved the conflict litigiously, taking the case to court.","type":"adverb","meaning_category":"in a litigious manner"},{"sentence":"Abordaron las negociaciones litigiosamente, lo que dificultó llegar a un acuerdo.","translation":"They approached the negotiations litigiously, which made it difficult to reach an agreement.","type":"adverb","meaning_category":"in a litigious manner"}]}