{"word":"Aftonian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アフトン期（北米の氷河時代間氷期）の、アフトン期に関する","english_definition":"Relating to or denoting the Aftonian interglacial stage of the Pleistocene epoch in North America.","examples":[{"sentence":"Aftonian gravels are found in this region.","translation":"この地域ではアフトン期の砂利が見つかる。"},{"sentence":"The Aftonian stage is characterized by a warmer climate.","translation":"アフトン期は温暖な気候によって特徴づけられる。"}],"collocations":["Aftonian gravels","Aftonian climate","Aftonian deposits"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"アフトン期","english_definition":"The Aftonian interglacial stage of the Pleistocene epoch in North America.","examples":[{"sentence":"The Aftonian was a period of significant warming.","translation":"アフトン期は著しい温暖化の時代だった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Afton, Iowa, where deposits from this period were first studied.","priority":"★★★"},"pronunciation":{"ipa":"/æfˈtoʊniən/","syllables":"Af-to-ni-an"},"inflection":{},"usage_notes":{"explanation":"The term 'Aftonian' is primarily used in the context of North American geology and paleoclimatology. It refers to a specific interglacial period within the Pleistocene epoch.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["interglacial","Pleistocene","Nebraskan","Kansan","glacial"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Aftonian' is a highly specialized term used in geology and paleoclimatology, specifically relating to a period in North American prehistory. Understanding requires background knowledge in these fields."},"example_sentences":[{"sentence":"The paleosols indicate a warmer, wetter climate during the Aftonian.","translation":"古土壌は、アフトン期における、より温暖で湿潤な気候を示している。","type":"adjective","meaning_category":"アフトン期の"},{"sentence":"Evidence from the Aftonian suggests significant shifts in vegetation patterns.","translation":"アフトン期の証拠は、植生パターンにおける著しい変化を示唆している。","type":"noun","meaning_category":"アフトン期"}]}