{"word":"oblast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に東ヨーロッパの)州、行政区画","english_definition":"a type of administrative division in some countries of Eastern Europe, especially in Russia, Ukraine, Belarus, and Bulgaria. It is similar to a province or region.","examples":[{"sentence":"The Kyiv Oblast surrounds the city of Kyiv.","translation":"キエフ州はキエフ市を囲んでいる。"},{"sentence":"He was born in the Rostov Oblast.","translation":"彼はロストフ州で生まれた。"}],"collocations":["Kyiv Oblast","Moscow Oblast","Rostov Oblast"],"synonyms":["province","region","guberniya (historical)"],"antonyms":[]}],"etymology":{"value":"Borrowed from Russian область (óblastʹ), from Old East Slavic область (oblastĭ), from пра-славянский *obvoldь (ob-voldь) 'district, region', from *ob- + *voldь (power, rule).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɒblæst/","syllables":"ob-last"},"inflection":{"noun_plural":"oblasts"},"usage_notes":{"explanation":"An \"oblast\" is an administrative division, similar to a province or region, used in several Eastern European countries, most notably Russia, Ukraine, Belarus, and Bulgaria. It is a formal term used in geography, political science, and news reporting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in oblast.","correct":"✓ I live in an oblast. / ✓ I live in the oblast.","note":"'Oblast' is a countable noun, so it requires an article ('a' or 'the') unless used with a possessive pronoun or other determiner."},{"incorrect":"✗ The oblast are large.","correct":"✓ The oblast is large. / ✓ The oblasts are large.","note":"When referring to a single oblast, use the singular verb form ('is'). When referring to multiple oblasts, use the plural verb form ('are')."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["krai (another type of administrative division in Russia)","raion (district within an oblast)","guberniya (historical term for province in Imperial Russia)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"oblast\" is a specialized term primarily used in the context of Eastern European geography and political administration. It refers to a type of administrative division similar to a province or region. Due to its specific context and limited usage outside of discussions related to these countries, it is considered a more advanced vocabulary term. Understanding its meaning is essential when reading or discussing the administrative structure of countries like Russia, Ukraine, and Belarus."},"example_sentences":[{"sentence":"The Donetsk Oblast is a region in eastern Ukraine.","translation":"ドネツク州はウクライナ東部の地域です。","type":"example","meaning_category":"administrative division"},{"sentence":"Many people have migrated from the Luhansk Oblast due to the conflict.","translation":"紛争のため、多くの人々がルハンスク州から移住しました。","type":"example","meaning_category":"administrative division"},{"sentence":"The Sverdlovsk Oblast is located in the Ural region of Russia.","translation":"スヴェルドロフスク州はロシアのウラル地方に位置しています。","type":"example","meaning_category":"administrative division"}]}