{"word":"metapneustic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(昆虫の呼吸系が)後気門式の","english_definition":"Having a respiratory system in which only the posterior spiracles are functional.","examples":[{"sentence":"The metapneustic larva of some Diptera have only the posterior spiracles open.","translation":"一部の双翅目の後気門式の幼虫は、後部の気門のみが開いている。"}],"collocations":[],"synonyms":["opisthopneustic"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'meta' (μετά) meaning 'after' or 'beyond', and 'pneo' (πνέω) meaning 'to breathe'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈnjuːstɪk/","syllables":"met-a-pneu-stic"},"inflection":{},"usage_notes":{"explanation":"This term is primarily used in entomology to describe a specific type of respiratory system in insects where only the posterior spiracles (breathing holes) are functional. It is often used to describe the larval stage of certain aquatic insects.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["metapneusticism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized term in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'metapneustic' is a highly specialized term used in the field of entomology, specifically to describe the respiratory system of certain insects. It indicates that only the posterior spiracles (breathing holes located at the rear of the insect's body) are functional for respiration. This term is not commonly encountered outside of scientific or technical contexts related to insect physiology. Understanding this term requires a background in biology or entomology."},"example_sentences":[{"sentence":"The mosquito larva exhibits a **metapneustic** respiratory system, relying solely on its posterior spiracles for gas exchange.","translation":"その蚊の幼虫は後気門式の呼吸系を示し、ガス交換のために後部の気門のみに頼っている。","type":"adjective","meaning_category":"Describing insect respiratory system"}]}