{"word":"Panzootia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(獣医学)動物の間で広範囲に発生する伝染病、動物の大流行","english_definition":"(veterinary medicine) An epidemic disease affecting many animals of one or more species over a wide area.","examples":[{"sentence":"The avian flu reached panzootic levels, devastating poultry farms across the continent.","translation":"鳥インフルエンザはパンズーティックなレベルに達し、大陸全体の養鶏場を荒廃させた。"},{"sentence":"Scientists are working to prevent the spread of the disease from reaching panzootia.","translation":"科学者たちは、その病気の蔓延がパンズーティアに達するのを防ぐために取り組んでいる。"}],"collocations":["avian influenza panzootia (鳥インフルエンザの動物大流行)","prevent panzootia (動物大流行を防ぐ)","control panzootia (動物大流行を制御する)"],"synonyms":["animal epidemic","epizootic","animal pandemic"],"antonyms":["sporadic disease","localized outbreak"]}],"etymology":{"value":"Derived from the Greek words 'pan' (all), 'zoon' (animal), and '-otia' (suffix indicating a condition or disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpænzuˈoʊtiə/","syllables":"pan-zoo-ti-a"},"inflection":{"noun_plural":"panzootias"},"usage_notes":{"explanation":"'Panzootia' is a term used in veterinary medicine to describe a widespread epidemic affecting animal populations, similar to a pandemic in humans. It indicates a disease outbreak that spans across a large geographic area and affects numerous animals. It is important to note the difference between 'panzootia' (widespread animal epidemic), 'epizootic' (animal epidemic), and 'enzootic' (disease constantly present in an animal population).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The human pandemic was panzootic.","correct":"✓ The disease was panzootic among animals.","note":"'Panzootic' specifically refers to diseases affecting animals, not humans. Human pandemics are referred to as 'pandemics'."},{"incorrect":"✗ A few sick cows indicate a panzootia.","correct":"✓ A widespread outbreak among cows could indicate a panzootia.","note":"'Panzootia' implies a widespread outbreak, not just a few isolated cases."}],"priority":"★★☆"},"related_words":{"derivatives":["panzootic (adjective)"],"related_terms":["epizootic","enzootic","pandemic","epidemic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Panzootia' is a technical term used in veterinary medicine to describe a widespread epidemic affecting animal populations across a large geographic area. It is analogous to a pandemic in humans. The term is relatively rare in general usage and is primarily found in scientific and veterinary contexts."},"example_sentences":[{"sentence":"The spread of foot-and-mouth disease reached panzootic proportions, causing significant economic losses.","translation":"口蹄疫の蔓延はパンズーティックな規模に達し、重大な経済的損失をもたらした。","type":"noun","meaning_category":"animal epidemic"},{"sentence":"The panzootic outbreak required international cooperation to contain the spread of the virus.","translation":"その動物大流行の発生は、ウイルスの蔓延を封じ込めるために国際的な協力が必要だった。","type":"noun","meaning_category":"animal epidemic"}]}