{"word":"OMPF","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) Initialism of 'Old Mother Particular Fussy'. A humorous term for someone, especially a woman, who is overly meticulous, fussy, or demanding.","english_definition":"(slang, humorous) Initialism of 'Old Mother Particular Fussy'. A humorous term for someone, especially a woman, who is overly meticulous, fussy, or demanding.","examples":[{"sentence":"She's such an OMPF when it comes to organizing her closet.","translation":"彼女はクローゼットを整理することになると、とても細かい人だ。"},{"sentence":"Don't be such an OMPF; just relax and enjoy the party.","translation":"そんなに細かいことを言うなよ。リラックスしてパーティーを楽しもう。"}],"collocations":["being an OMPF","such an OMPF"],"synonyms":["fussy","meticulous","demanding","particular"],"antonyms":["easygoing","relaxed","laid-back"]}],"etymology":{"value":"The term is a humorous expansion of the initialism, with each letter representing a word that describes the person's character. 'Old' suggests someone older or more experienced, 'Mother' implies a maternal or caring nature (often ironically), 'Particular' indicates a focus on details, and 'Fussy' highlights their demanding or critical attitude.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊˌɛmˌpiːˈɛf/","syllables":"O-M-P-F"},"inflection":{"notes":"It is used as a noun, so it can be pluralized (OMPFs), though it's not very common."},"usage_notes":{"explanation":"'OMPF' is a slang term, often used humorously or affectionately, to describe someone who is very particular, fussy, or demanding, especially about details. It is more often applied to women, although it can be used for men as well. The term is not typically used in formal settings and can be considered mildly offensive if used inappropriately.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an OMPF about his car.","correct":"✓ He is an OMPF when it comes to his car.","note":"The term is usually used with 'when it comes to' or 'about' to specify the area of fussiness."},{"incorrect":"✗ She's a OMPF person.","correct":"✓ She's an OMPF.","note":"'OMPF' is used as a noun, not an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["nitpicker","perfectionist","control freak"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively uncommon slang term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'OMPF' is a slang acronym that stands for 'Old Mother Particular Fussy'. It's a humorous way to describe someone, usually a woman, who is very meticulous and demanding. This term is not commonly used and may not be understood by everyone. It's best to use it in informal settings and be mindful of the potential to offend, as it can be seen as a slightly derogatory label."},"example_sentences":[{"sentence":"My aunt is such an OMPF; she insists on ironing her bedsheets.","translation":"私のおばは本当に細かい人で、ベッドシーツにアイロンをかけることを主張する。","type":"noun","meaning_category":"fussy person"},{"sentence":"He's being a real OMPF about the seating arrangement at the wedding.","translation":"彼は結婚式の席順について本当に細かいことを言っている。","type":"noun","meaning_category":"demanding person"}]}