{"word":"pilpul","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教)タルムードの難解な分析、特に些細な点にこだわるもの","english_definition":"(in Judaism) a method of Talmudic study characterized by intricate logical argumentation, often focusing on minor points.","examples":[{"sentence":"His pilpul on the text was impressive, though some found it overly detailed.","translation":"彼のテキストに関するピルプルは印象的だったが、細かすぎると感じる人もいた。"},{"sentence":"The yeshiva was known for its rigorous pilpul.","translation":"そのイェシバは厳格なピルプルで知られていた。"}],"collocations":["Talmudic pilpul","engage in pilpul","rigorous pilpul","scholarly pilpul"],"synonyms":["Talmudic analysis","dialectical argument","legalistic reasoning"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の「פלפול (pilpul)」に由来し、「コショウ」または「スパイス」を意味する。比喩的に、議論を「スパイシーにする」または「刺激する」という意味合いを持つ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪlpʊl/","syllables":"pil-pul"},"inflection":{"notes":"複数形は通常「pilpulim」だが、英語では「pilpul」も使われる。"},"usage_notes":{"explanation":"「**pilpul**」は、タルムード研究における特定の分析方法を指す専門用語です。単に難解な議論をするだけでなく、テキストの矛盾を解決したり、新しい解釈を生み出したりすることを目的とします。しかし、過度に些末な点にこだわり、本質から離れた議論に陥る場合もあり、批判的に用いられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used pilpul to solve the math problem.","correct":"✓ He used logic to solve the math problem.","note":"「pilpul」はユダヤ教のタルムード研究に特有の方法論であり、一般的な問題解決には使いません。"},{"incorrect":"✗ The lecture was full of pilpul and easy to understand.","correct":"✓ The lecture was full of pilpul and difficult to understand.","note":"「pilpul」は複雑で難解な議論を伴うため、理解しやすいとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":["pilpulist (名詞: ピルプルを行う人、ピルプルを好む人)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**pilpul**」は、ユダヤ教のタルムード研究における、複雑で詳細な議論方法を指す専門用語です。テキストの細部にこだわり、論理的な推論を重ねて解釈を深めることを特徴とします。しかし、過度に細部にこだわりすぎると、本質から離れた無意味な議論になるという批判的な意味合いも含まれることがあります。この単語は、ユダヤ教の学術的な文脈以外ではほとんど使われません。"},"example_sentences":[{"sentence":"The rabbi's pilpul on the passage was both insightful and challenging.","translation":"そのラビの聖句に関するピルプルは、洞察力に富み、かつ挑戦的だった。","type":"noun","meaning_category":"タルムードの分析"},{"sentence":"Some critics argue that modern Talmudic study has become too focused on pilpul.","translation":"現代のタルムード研究はピルプルに偏りすぎていると批判する人もいる。","type":"noun","meaning_category":"タルムードの分析"}]}