{"word":"virtual-work-disabling","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Describing technology or policies that effectively prevent or severely hinder remote work arrangements.","english_definition":"Relating to technology or policies that make it difficult or impossible for employees to work remotely.","examples":[{"sentence":"The company's outdated VPN and strict data security protocols are virtual-work-disabling, forcing employees back into the office.","translation":"その会社の時代遅れのVPNと厳格なデータセキュリティプロトコルは事実上リモートワークを不可能にしており、従業員をオフィスに戻さざるを得なくさせている。"},{"sentence":"Despite claims of flexibility, the new software suite is virtual-work-disabling due to its incompatibility with personal devices.","translation":"柔軟性を謳っているにもかかわらず、新しいソフトウェアスイートは個人用デバイスとの互換性がないため、事実上リモートワークを不可能にしている。"}],"collocations":["virtual-work-disabling technology","virtual-work-disabling policy","virtual-work-disabling software","virtual-work-disabling infrastructure"],"synonyms":["remote-work-inhibiting","telework-hindering","work-from-home-preventing"],"antonyms":["remote-work-enabling","telework-facilitating","work-from-home-friendly"]}],"etymology":{"value":"A compound adjective formed by combining 'virtual' (in the sense of 'effectively'), 'work' (referring to employment or tasks), and 'disabling' (causing inability or hindrance).","priority":"N/A"},"pronunciation":{"ipa":"/ˈvɜːrtʃuəl wɜːrk dɪsˈeɪbəlɪŋ/","syllables":"vir-tu-al work dis-a-bling"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"This term is used to describe situations where, despite the possibility of remote work in theory, practical limitations imposed by technology, policies, or infrastructure make it extremely difficult or impossible to implement effectively. It's often used critically to point out the hypocrisy of companies that claim to support remote work but implement measures that undermine it.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The virtual work disabling.","correct":"✓ The virtual-work-disabling policy.","note":"It is an adjective, so it needs to modify a noun."}],"priority":"N/A"},"related_words":{"derivatives":["virtual","work","disabling"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, a relatively new and specialized term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"This is a complex term used to describe situations where technology or company rules make it very hard or impossible to work remotely. It suggests that even though remote work might seem possible, certain barriers prevent it from happening in practice. It's often used to criticize companies that say they support remote work but have policies that make it difficult."},"example_sentences":[{"sentence":"The company's insistence on using outdated software is a virtual-work-disabling factor for many employees.","translation":"その会社が時代遅れのソフトウェアの使用を主張することは、多くの従業員にとって事実上リモートワークを不可能にする要因となっている。","type":"adjective","meaning_category":"Remote work hindrance"}]}