{"word":"non-bankruptable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"破産できない、破産宣告を受けられない","english_definition":"Not able to be bankrupted; protected from bankruptcy.","examples":[{"sentence":"Certain assets are considered non-bankruptable under the law.","translation":"法律の下では、特定の資産は破産宣告を受けられないとみなされます。"},{"sentence":"The trust was structured to make the assets non-bankruptable.","translation":"その信託は、資産が破産宣告を受けられないように構成されていました。"}],"collocations":["non-bankruptable assets","non-bankruptable trust"],"synonyms":["bankruptcy-proof","protected from bankruptcy"],"antonyms":["bankruptable","vulnerable to bankruptcy"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'bankruptable'. 'Bankruptable' itself is derived from 'bankrupt' (unable to pay debts) and the suffix '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.ˈbæŋk.rʌpt.ə.bəl/","syllables":"non-bank-rupt-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'non-bankruptable'."},"usage_notes":{"explanation":"'Non-bankruptable' is a relatively uncommon term, primarily used in legal and financial contexts. It describes something that is legally shielded from being affected by bankruptcy proceedings. This often refers to specific types of assets or legal structures designed to protect assets from creditors in the event of bankruptcy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is non bankruptable.","correct":"✓ The company's assets are non-bankruptable.","note":"It's more accurate to say that specific *assets* or *entities* are non-bankruptable, rather than the entire company. A company itself can file for bankruptcy, but certain assets might be protected."}],"priority":"★☆☆"},"related_words":{"derivatives":["non-bankruptcy (noun): A situation or state that is not related to bankruptcy.","bankrupt (adjective, noun, verb): Unable to pay debts; a person or entity declared unable to pay debts; to declare bankruptcy.","bankruptcy (noun): The state of being bankrupt; a legal proceeding involving a person or business that is unable to repay their debts."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-bankruptable' is a specialized term used in legal and financial contexts. It means something is protected from bankruptcy proceedings. This term is not commonly used in everyday language. It is more likely to be encountered in legal documents, financial planning discussions, or business contexts related to asset protection. Understanding this term requires familiarity with basic bankruptcy concepts."},"example_sentences":[{"sentence":"The lawyer advised setting up a trust to ensure the family's wealth remained non-bankruptable.","translation":"弁護士は、家族の財産が破産宣告を受けられないように、信託を設定することを勧めました。","type":"adjective","meaning_category":"protected from bankruptcy"},{"sentence":"Life insurance policies often have provisions that make them non-bankruptable in many jurisdictions.","translation":"生命保険契約には、多くの場合、多くの法域で破産宣告を受けられないようにする条項があります。","type":"adjective","meaning_category":"protected from bankruptcy"}]}