{"word":"split-timber","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"割材、割木材","english_definition":"Timber that has been split rather than sawn.","examples":[{"sentence":"The house was constructed using split-timber framing.","translation":"その家は割材の骨組みを使って建てられた。"},{"sentence":"Split-timber is often used for rustic fencing.","translation":"割材はしばしば素朴なフェンスに使われる。"}],"collocations":["split-timber fencing","split-timber framing","split-timber construction"],"synonyms":["riven timber","cleaved timber"],"antonyms":["sawn timber"]},{"part_of_speech":"adjective","definition":"割材の、割木材の","english_definition":"Made of or relating to timber that has been split.","examples":[{"sentence":"The split-timber gate added to the charm of the property.","translation":"割材の門がその不動産の魅力を増していた。"},{"sentence":"They used split-timber posts for the fence.","translation":"彼らはフェンスに割材の柱を使った。"}],"collocations":["split-timber gate","split-timber post","split-timber roof"],"synonyms":["riven-timber","cleaved-timber"],"antonyms":["sawn-timber"]}],"etymology":{"value":"The term 'split-timber' is a compound word. 'Split' refers to the action of dividing wood along the grain, and 'timber' refers to wood prepared for use in building and carpentry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsplɪtˌtɪmbər/","syllables":"split-tim-ber"},"inflection":{"notes":"The word 'split-timber' can function as both a noun and an adjective. As a noun, it is generally uncountable. There is no plural form."},"usage_notes":{"explanation":"'Split-timber' refers to wood that has been divided along the grain using tools like wedges or froes, rather than being sawn. This method preserves the natural strength of the wood and creates a rustic appearance. It is commonly used in traditional building techniques and for rustic or decorative purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The split timber was sawed.","correct":"✓ The split timber was split.","note":"Split-timber is specifically wood that has been split, not sawn. If it was sawn, it is simply sawn timber."}],"priority":"★★☆"},"related_words":{"derivatives":["splitting (noun: the act of splitting wood)","timber (noun: wood prepared for use in building)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Split-timber' is a specialized term referring to wood that has been divided along the grain rather than sawn. It is often used in the context of traditional building methods, rustic construction, or decorative elements. Understanding this term requires familiarity with woodworking techniques and terminology. The word is relatively uncommon in general conversation but may appear in texts related to architecture, carpentry, or historical construction methods."},"example_sentences":[{"sentence":"The old barn was constructed with split-timber walls.","translation":"その古い納屋は割材の壁で建てられていた。","type":"noun","meaning_category":"割材"},{"sentence":"The split-timber fence gave the garden a rustic charm.","translation":"割材のフェンスが庭に素朴な魅力を与えていた。","type":"adjective","meaning_category":"割材の"},{"sentence":"Using split-timber requires specialized tools and techniques.","translation":"割材を使うには、特殊な道具と技術が必要だ。","type":"noun","meaning_category":"割材"}]}