{"word":"Post-Pauline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"パウロ以後の、パウロ書簡以後の","english_definition":"Relating to the period after the time of Paul the Apostle or after the writing of the Pauline epistles.","examples":[{"sentence":"Post-Pauline theology developed in response to changing circumstances within the early church.","translation":"パウロ以後の神学は、初期教会内の変化する状況に対応して発展しました。"},{"sentence":"Some scholars argue that certain New Testament texts are post-Pauline, reflecting later interpretations of Paul's teachings.","translation":"一部の学者は、新約聖書の特定のテキストがパウロ以後のものであり、パウロの教えの後の解釈を反映していると主張しています。"}],"collocations":["Post-Pauline theology","Post-Pauline epistles","Post-Pauline literature","Post-Pauline Christianity"],"synonyms":["After Paul","Subsequent to Paul"],"antonyms":["Pre-Pauline","Pauline"]}],"etymology":{"value":"Derived from 'post-' (after) and 'Pauline' (relating to Paul the Apostle).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpoʊst ˈpɔːˌlaɪn/","syllables":"Post-Pau-line"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'Post-Pauline' is primarily used in theological and biblical studies to differentiate between texts, ideas, or developments that occurred during Paul's lifetime or directly from his hand, and those that emerged later within the Christian tradition. It often implies a development or modification of Pauline thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The post Pauline era was a time of great change.","correct":"✓ The post-Pauline era was a time of great change.","note":"The term is usually hyphenated."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pauline","Pre-Pauline"],"phrases":["Pauline epistles","Pauline theology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in academic and theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Post-Pauline' is specialized vocabulary used in the context of biblical and theological studies. Understanding requires familiarity with the historical context of the Apostle Paul and the development of early Christian thought. The term is used to categorize ideas, texts, or periods that came after Paul's direct influence."},"example_sentences":[{"sentence":"The authorship of the Pastoral Epistles is often debated, with some scholars attributing them to a post-Pauline author.","translation":"牧会書簡の著者についてはしばしば議論され、一部の学者はそれらをパウロ以後の著者に帰しています。","type":"adjective","meaning_category":"パウロ以後の"},{"sentence":"Post-Pauline interpretations of justification by faith sometimes differ from Paul's original formulation.","translation":"信仰による義認のパウロ以後の解釈は、パウロの元の定式化とは異なる場合があります。","type":"adjective","meaning_category":"パウロ以後の"}]}