{"word":"Euro-American","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヨーロッパ系アメリカ人の、ヨーロッパとアメリカの文化が混ざった","english_definition":"Relating to or characteristic of European Americans or the cultural influences of both Europe and America.","examples":[{"sentence":"The Euro-American community has a rich history in this city.","translation":"この都市には、ヨーロッパ系アメリカ人のコミュニティの豊かな歴史がある。"},{"sentence":"Euro-American literature often explores themes of immigration and identity.","translation":"ヨーロッパ系アメリカ文学は、移民とアイデンティティというテーマをしばしば探求する。"},{"sentence":"The museum features Euro-American art from the 19th century.","translation":"その美術館は、19世紀のヨーロッパ系アメリカ人の芸術を展示している。"}],"collocations":["Euro-American culture","Euro-American history","Euro-American literature","Euro-American art","Euro-American community"],"synonyms":["European American","White American"],"antonyms":["African-American","Asian-American","Native American"]},{"part_of_speech":"noun","definition":"ヨーロッパ系アメリカ人","english_definition":"A person of European descent who is a citizen or resident of the United States.","examples":[{"sentence":"Many Euro-Americans trace their ancestry back to various countries in Europe.","translation":"多くのヨーロッパ系アメリカ人は、自分たちの祖先をヨーロッパの様々な国々に遡って辿ることができる。"},{"sentence":"The Euro-American population is diverse, with people from many different ethnic backgrounds.","translation":"ヨーロッパ系アメリカ人の人口は多様で、様々な民族的背景を持つ人々がいる。"},{"sentence":"Euro-Americans have made significant contributions to American society.","translation":"ヨーロッパ系アメリカ人は、アメリカ社会に多大な貢献をしてきた。"}],"collocations":["a Euro-American","Euro-Americans from different backgrounds"],"synonyms":["European American","White American"],"antonyms":["African-American","Asian-American","Native American"]}],"etymology":{"value":"A compound word formed from \"Euro-\" (referring to Europe) and \"American\" (referring to the United States). It describes people of European descent who are citizens or residents of the United States.","priority":"★★★"},"pronunciation":{"ipa":"ˌjʊərəʊ əˈmerɪkən/","syllables":"Eu-ro-A-mer-i-can"},"inflection":{"noun_plural":"Euro-Americans"},"usage_notes":{"explanation":"\"Euro-American\" is used to describe people of European descent who are citizens or residents of the United States. It can also refer to cultural aspects that combine European and American traditions. While sometimes used interchangeably with \"White American,\" \"Euro-American\" emphasizes the European heritage and cultural background.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a European, not a Euro-American, because he lives in France.","correct":"✓ He is European, not Euro-American, because he lives in France.","note":"Euro-American specifically refers to people of European descent who are citizens or residents of the United States. Someone living in Europe is simply European."},{"incorrect":"✗ All white people in America are Euro-Americans.","correct":"✓ Most white people in America are Euro-Americans.","note":"While most white people in America are of European descent, not all identify as or are referred to as Euro-American. The term is more specific to those who identify with both European and American cultures."}],"priority":"★★☆"},"related_words":{"derivatives":["Euro-Americanism"],"phrases":["European American","White American"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in academic and sociological contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"Euro-American\" is used to describe people of European descent who are citizens or residents of the United States. It is often used in academic or sociological contexts to discuss cultural influences, identity, and historical contributions. The term is more specific than \"White American\" as it emphasizes the European heritage. It's important to use this term with sensitivity and awareness of its cultural implications."},"example_sentences":[{"sentence":"The conference focused on the experiences of Euro-American immigrants in the early 20th century.","translation":"その会議は、20世紀初頭のヨーロッパ系アメリカ人移民の経験に焦点を当てた。","type":"noun","meaning_category":"ヨーロッパ系アメリカ人"},{"sentence":"Euro-American traditions have significantly shaped American culture.","translation":"ヨーロッパ系アメリカ人の伝統は、アメリカ文化を大きく形作ってきた。","type":"adjective","meaning_category":"ヨーロッパ系アメリカ人の"},{"sentence":"She identifies as a Euro-American with strong ties to her Italian heritage.","translation":"彼女はイタリアの遺産との強い繋がりを持つヨーロッパ系アメリカ人として自己認識している。","type":"noun","meaning_category":"ヨーロッパ系アメリカ人"},{"sentence":"The study examined the impact of Euro-American settlement on Native American populations.","translation":"その研究は、ヨーロッパ系アメリカ人の入植がネイティブアメリカンの人口に与えた影響を調査した。","type":"adjective","meaning_category":"ヨーロッパ系アメリカ人の"}]}