{"word":"Echelette","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"回折格子の一種で、溝の断面が鋸歯状になっているもの。特定の波長範囲の光を効率的に回折するために設計されている。","english_definition":"A type of diffraction grating with sawtooth-shaped grooves, designed to efficiently diffract light of a specific wavelength range.","examples":[{"sentence":"An echelette grating is used in the spectrometer to separate light into its constituent wavelengths.","translation":"エシェレット格子は、分光器で使用され、光を構成波長に分離します。"}],"collocations":["echelette grating","echelette spectrometer"],"synonyms":["blazed grating"],"antonyms":[]}],"etymology":{"value":"フランス語の \"échelette\" (小さなはしご) に由来する。格子の溝が階段状に見えることにちなむ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛʃəˈlɛt/","syllables":"Esh-e-lette"},"inflection":{"notes":"複数形は echelettes"},"usage_notes":{"explanation":"エシェレット格子は、特定の波長範囲の光を効率的に回折するように最適化された回折格子の一種です。溝の形状が鋸歯状になっているのが特徴で、この形状によって特定の回折次数に光を集中させることができます。分光器などの光学機器で広く使用されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Using a normal grating instead of an echelette increases the intensity of the desired wavelength.","correct":"Using an echelette grating instead of a normal grating increases the intensity of the desired wavelength.","note":"Echelette grating is specifically designed to increase the intensity of the desired wavelength, unlike a normal grating."}],"priority":"★☆☆"},"related_words":{"derivatives":["diffraction grating","spectrometer","spectroscopy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Echelette」は、光学分野で使われる専門用語です。特に、回折格子の一種を指し、その溝の断面が鋸歯状になっていることが特徴です。特定の波長範囲の光を効率的に回折するために設計されており、分光器などの精密な光学機器で使用されます。この単語を理解するには、回折格子の基本的な原理や、光の波長と回折の関係についての知識が必要です。専門的な文脈以外ではほとんど使われません。"},"example_sentences":[{"sentence":"The echelette grating in the infrared spectrometer allows for high-resolution spectral analysis.","translation":"赤外分光器のエシェレット格子により、高分解能のスペクトル分析が可能になります。","type":"noun","meaning_category":"回折格子"}]}