{"word":"lingism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"差別用語、侮蔑語、言語差別","english_definition":"Discrimination or prejudice based on language. This can include discrimination against speakers of a particular language or dialect, or discrimination based on a person's accent or language skills.","examples":[{"sentence":"The company was accused of lingism after it refused to hire anyone who didn't speak perfect English.","translation":"その会社は、完璧な英語を話せない人を誰一人として雇用することを拒否した後、言語差別で告発された。"},{"sentence":"Lingism can be a barrier to social mobility for people who speak a non-standard dialect.","translation":"言語差別は、標準語ではない方言を話す人々にとって、社会的流動性の障壁となる可能性がある。"},{"sentence":"She experienced lingism when her colleagues mocked her accent.","translation":"彼女は同僚が彼女のアクセントをからかったとき、言語差別を経験した。"}],"collocations":["combat lingism","fight lingism","address lingism","overcome lingism","experience lingism","perpetuate lingism","subtle lingism","overt lingism","institutional lingism"],"synonyms":["linguistic discrimination","language prejudice","language-based discrimination"],"antonyms":["linguistic equality","language inclusion","language equity"]}],"etymology":{"value":"A blend of 'linguistic' and 'ism'. The term emerged in the late 20th century as awareness of various forms of discrimination grew.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlɪŋɡɪzəm","syllables":"lin-gis-m"},"inflection":{"noun_plural":"lingisms"},"usage_notes":{"explanation":"'Lingism' is a relatively recent term that describes discrimination based on language. It can manifest in various forms, from overt prejudice against speakers of certain languages or dialects to more subtle forms of bias, such as judging someone's intelligence or competence based on their accent or language skills. It's often used in discussions about social justice and equality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed lingism by speaking only English.","correct":"✓ He showed lingism by refusing to accommodate speakers of other languages.","note":"Speaking only English isn't necessarily lingism. Lingism involves discrimination or prejudice. Refusing to accommodate other languages is a better example."},{"incorrect":"✗ Lingism is the study of languages.","correct":"✓ Lingism is discrimination based on language.","note":"Lingism is not the study of languages; that's linguistics."}],"priority":"★★☆"},"related_words":{"derivatives":["lingist (noun: someone who practices lingism)"],"related_terms":["discrimination","prejudice","linguistics","language","dialect","accent","bias","equity","inclusion","social justice"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lingism' is a term used to describe discrimination or prejudice based on language. It's often used in academic or social justice contexts to discuss how certain languages, dialects, or accents can be unfairly valued or devalued, leading to unequal treatment of individuals or groups. The term is not as widely known as other forms of discrimination like racism or sexism, but it's important for understanding how language can be a source of social inequality."},"example_sentences":[{"sentence":"The professor argued that standardized testing often perpetuates lingism by favoring students who speak the dominant dialect.","translation":"教授は、標準化されたテストは、支配的な方言を話す学生を優遇することにより、しばしば言語差別を永続させると主張した。","type":"noun","meaning_category":"discrimination"},{"sentence":"Many immigrants face lingism in the workplace, where their accents are seen as a sign of incompetence.","translation":"多くの移民は職場で言語差別を経験しており、彼らのアクセントは無能さの兆候と見なされている。","type":"noun","meaning_category":"prejudice"},{"sentence":"The organization is working to raise awareness about lingism and promote linguistic diversity.","translation":"その組織は、言語差別に対する意識を高め、言語の多様性を促進するために活動している。","type":"noun","meaning_category":"awareness"}]}