{"word":"strain-hardened","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"加工硬化した、ひずみ硬化した","english_definition":"(of a metal) having been made harder and stronger by plastic deformation, such as cold working.","examples":[{"sentence":"The strain-hardened steel exhibited increased tensile strength.","translation":"その加工硬化された鋼は、引張強さの増加を示した。"},{"sentence":"Strain-hardened materials are often used in manufacturing processes.","translation":"加工硬化された材料は、製造プロセスでよく使用される。"}],"collocations":["strain-hardened steel","strain-hardened aluminum","highly strain-hardened"],"synonyms":["work-hardened","cold-worked"],"antonyms":["annealed","softened"]}],"etymology":{"value":"The term 'strain-hardened' is derived from the process of 'strain hardening,' which refers to the increase in hardness and strength of a metal due to plastic deformation.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstreɪnˌhɑːrdənd/","syllables":"strain-har-dened"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Strain-hardened' describes a material that has undergone a process to increase its hardness and strength through plastic deformation, typically at temperatures below its recrystallization temperature (cold working). This process introduces dislocations in the crystal structure of the metal, which impede further deformation, thus making the material harder and stronger.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was strain-hardened by heating it.","correct":"✓ The metal was strain-hardened by cold working it.","note":"Strain hardening occurs through plastic deformation, typically cold working, not by heating the metal."}],"priority":"★★☆"},"related_words":{"derivatives":["strain hardening (noun)","strain (noun)","harden (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Strain-hardened' is a technical term used in materials science and engineering to describe a metal that has become harder and stronger due to plastic deformation, typically through cold working. It is not a commonly used word in everyday conversation, but it is important in specific technical contexts."},"example_sentences":[{"sentence":"The manufacturer used strain-hardened aluminum to improve the durability of the aircraft components.","translation":"製造業者は、航空機部品の耐久性を向上させるために、加工硬化されたアルミニウムを使用した。","type":"adjective","meaning_category":"Material Science"},{"sentence":"The strain-hardened layer on the surface increased wear resistance.","translation":"表面の加工硬化層は、耐摩耗性を向上させた。","type":"adjective","meaning_category":"Material Science"}]}