{"word":"intellectualization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"知性化、理知化：感情的な苦痛やストレスを、感情を伴わずに知的な分析や抽象化によって処理する防衛機制","english_definition":"A defense mechanism by which emotional distress is dealt with through intellectual analysis and abstract thinking, without experiencing the associated emotions.","examples":[{"sentence":"His intellectualization of the problem prevented him from truly connecting with the emotional impact it had on others.","translation":"彼の問題に対する知性化は、それが他者に与える感情的な影響と真に繋がることを妨げた。"},{"sentence":"She used intellectualization to cope with her grief, focusing on the philosophical aspects of death rather than the pain of loss.","translation":"彼女は悲しみに対応するために知性化を用い、喪失の痛みよりも死の哲学的側面に焦点を当てた。"},{"sentence":"The therapist pointed out his tendency towards intellectualization as a way of avoiding uncomfortable feelings.","translation":"セラピストは、彼が不快な感情を避ける方法として知性化に頼る傾向があることを指摘した。"}],"collocations":["use intellectualization","engage in intellectualization","defense mechanism of intellectualization","intellectualization as a coping strategy","intellectualization of emotions","intellectualization of grief","intellectualization of anxiety"],"synonyms":["rationalization","abstraction","conceptualization","analysis","intellectual analysis","cognitive reframing"],"antonyms":["emotional expression","emotional processing","feeling","experiencing emotions","emotional connection"]},{"part_of_speech":"noun","definition":"知性化：過度に知的であること、または知的な活動に過度に依存すること","english_definition":"The act or process of intellectualizing; excessive use of intellect or intellectual pursuits.","examples":[{"sentence":"The intellectualization of the curriculum led to a neglect of practical skills.","translation":"カリキュラムの知性化は、実践的なスキルの軽視につながった。"},{"sentence":"His intellectualization made him seem detached and aloof.","translation":"彼の知性化は、彼をよそよそしく、打ち解けない人物に見させた。"}],"collocations":["intellectualization of education","intellectualization of society","intellectualization of culture"],"synonyms":["cerebralization","over-intellectualization","abstraction","rationalism"],"antonyms":["practicality","realism","emotionality"]}],"etymology":{"value":"The term 'intellectualization' is derived from 'intellectualize,' which combines 'intellectual' (from Latin 'intellectualis,' pertaining to the intellect) with the suffix '-ize' (indicating a process or action). The psychological sense of the term was developed within psychoanalytic theory.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌtɛləktʃuəlaɪˈzeɪʃən/","syllables":"in-tel-lec-tu-al-i-za-tion"},"inflection":{"noun_plural":"intellectualizations"},"usage_notes":{"explanation":"In psychology, 'intellectualization' refers to a defense mechanism where a person avoids uncomfortable emotions by focusing on intellectual aspects. It can also refer to an overemphasis on intellectual pursuits, sometimes at the expense of practical concerns or emotional understanding. It's important to distinguish between healthy intellectual curiosity and using intellectualization as a way to avoid dealing with feelings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a lot of intellectualization.","correct":"✓ He used a lot of intellectualization.","note":"Intellectualization is a process or mechanism, so it's better to say someone 'uses' it rather than 'has' it. Alternatively, 'He displayed a lot of intellectualization' is also correct."},{"incorrect":"✗ Don't intellectualize your feelings, just feel them.","correct":"✓ Don't intellectualize your feelings; just feel them.","note":"The semicolon is used to connect two related independent clauses when a coordinating conjunction (and, but, or, nor, for, so, yet) is omitted."}],"priority":"★★☆"},"related_words":{"derivatives":["intellectualize (verb)","intellectual (adjective, noun)","intellect (noun)","rationalize (verb)","rationalization (noun)"],"related_terms":["defense mechanism","repression","sublimation","displacement","denial"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and psychological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intellectualization' is a term primarily used in psychology to describe a defense mechanism where individuals avoid dealing with uncomfortable emotions by focusing on intellectual aspects. It can also refer to an overemphasis on intellectual pursuits. Understanding this term requires some familiarity with psychological concepts. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor's lecture was a masterpiece of intellectualization, but it failed to connect with the students on an emotional level.","translation":"教授の講義は知性化の傑作であったが、学生の感情的なレベルと繋がることはできなかった。","type":"noun","meaning_category":"Defense mechanism"},{"sentence":"She used intellectualization as a way to distance herself from the trauma she had experienced.","translation":"彼女は、自身が経験したトラウマから距離を置く方法として知性化を用いた。","type":"noun","meaning_category":"Defense mechanism"},{"sentence":"The intellectualization of art can sometimes obscure its emotional impact.","translation":"芸術の知性化は、時にその感情的な影響を曖昧にする可能性がある。","type":"noun","meaning_category":"Overemphasis on intellect"},{"sentence":"His reliance on intellectualization made it difficult for him to form close relationships.","translation":"彼の知性化への依存は、彼が親密な関係を築くことを困難にした。","type":"noun","meaning_category":"Defense mechanism"}]}