{"word":"Papistly","priority":"低","meanings":[{"part_of_speech":"adverb","definition":"カトリック教徒らしく、ローマ教皇支持者らしく","english_definition":"In a manner characteristic of a papist; in a way that supports or adheres to the doctrines and practices of the Roman Catholic Church, especially with strong allegiance to the Pope.","examples":[{"sentence":"The historical text describes how some leaders acted papistly, enforcing Catholic doctrines strictly.","translation":"その歴史的なテキストは、一部の指導者がカトリックの教義を厳格に施行し、カトリック教徒らしく行動した様子を描写しています。"},{"sentence":"He defended his views papistly, showing unwavering loyalty to the Pope.","translation":"彼はローマ教皇への揺るぎない忠誠を示し、カトリック教徒らしく自身の見解を擁護しました。"}],"collocations":["act papistly","defend papistly","believe papistly"],"synonyms":["catholicly","romishly"],"antonyms":["anti-catholicly","protestantly"]}],"etymology":{"value":"The word \"papistly\" is derived from \"papist\" (a term, often derogatory, for a Roman Catholic) with the addition of the suffix \"-ly,\" which transforms it into an adverb.","priority":"中"},"pronunciation":{"ipa":"/ˈpeɪpɪstli/","syllables":"pay-pist-ly"},"inflection":{"notes":"Adverb, no inflections"},"usage_notes":{"explanation":"\"Papistly\" is an adverb that describes actions or beliefs that are characteristic of a papist, i.e., a Roman Catholic, particularly one who strongly supports the Pope. The term \"papist\" itself has historical connotations and can be considered offensive, so \"papistly\" is rarely used and may be seen as pejorative.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived papistly, but he wasn't Catholic.","correct":"✓ He lived devoutly, following Catholic traditions.","note":"Papistly implies being Catholic, so it's contradictory to say someone lives papistly but isn't Catholic. Use 'devoutly' or specify following Catholic traditions instead."}],"priority":"中"},"related_words":{"derivatives":["papist","papism"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The word 'papistly' is a rare and highly specific term, generally found in historical or academic contexts when discussing religious adherence or historical attitudes toward Catholicism. Its use can be seen as potentially offensive due to the negative connotations associated with the term 'papist.'"},"example_sentences":[{"sentence":"The historian described the king's policies as being implemented papistly, favoring Catholic interests above all else.","translation":"歴史家は、王の政策が何よりもカトリックの利益を優先し、カトリック教徒らしく実行されたと述べました。","type":"general","meaning_category":"manner"}]}