{"word":"interscene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画、演劇)場面転換","english_definition":"A scene that occurs between other scenes, especially in a film or play.","examples":[{"sentence":"The interscene showed a montage of cityscapes to indicate the passage of time.","translation":"場面転換では、時間の経過を示すために都市景観のモンタージュが映し出された。"},{"sentence":"The director used an interscene to provide context for the next major plot point.","translation":"監督は、次の主要なプロットポイントの背景情報を提供するために場面転換を使用した。"}],"collocations":["interscene transition","interscene music","interscene montage"],"synonyms":["transition scene","bridging scene"],"antonyms":["main scene","primary scene"]}],"etymology":{"value":"Derived from the prefix 'inter-' (between) and the noun 'scene'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈsiːn/","syllables":"in-ter-scene"},"inflection":{"noun_plural":"interscenes"},"usage_notes":{"explanation":"'Interscene' is primarily used in the context of film and theater to describe a scene that serves as a transition or bridge between more significant scenes. It often provides context, shows the passage of time, or sets the mood for the upcoming events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was full of interscenes and not enough plot.","correct":"✓ The movie had too many interscenes and not enough plot.","note":"'Interscene' refers to a specific type of scene, not just any scene. The mistake is in using it to describe the overall quality of scenes."}],"priority":"★☆☆"},"related_words":{"derivatives":["interscenic (adjective)"],"phrases":["montage","scene transition","bridging shot"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interscene' is a technical term primarily used in film and theater studies. It refers to a scene that connects or transitions between more important scenes, often providing context or showing the passage of time. Due to its specialized usage, it is not commonly encountered in general language. Understanding its meaning requires familiarity with film and theater terminology."},"example_sentences":[{"sentence":"The film used a series of interscenes to depict the protagonist's journey across the country.","translation":"その映画では、主人公が国中を旅する様子を描くために、一連の場面転換が使用された。","type":"noun","meaning_category":"場面転換"},{"sentence":"The interscene featured a slow pan across a deserted landscape, creating a sense of isolation.","translation":"場面転換では、人気のない風景をゆっくりとパンすることで、孤独感が演出された。","type":"noun","meaning_category":"場面転換"}]}