{"word":"unconsigned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"委託されていない、委託販売されていない","english_definition":"Not sent or given over to someone or something; not consigned.","examples":[{"sentence":"The unconsigned goods remained in the warehouse.","translation":"委託されていない商品は倉庫に残された。"},{"sentence":"They had a large quantity of unconsigned inventory.","translation":"彼らは大量の委託販売されていない在庫を抱えていた。"}],"collocations":["unconsigned goods","unconsigned inventory"],"synonyms":["unsent","undelivered","unshipped"],"antonyms":["consigned","delivered","shipped"]}],"etymology":{"value":"\"Un-\" (not) + \"consigned\" (past participle of \"consign\").","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkənˈsaɪnd/","syllables":"un-con-signed"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Unconsigned' typically refers to goods or items that have not been sent to an agent or third party for sale or storage. It indicates that the items are still under the direct control or ownership of the original sender or owner.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unconsigned package was delivered to the wrong address.","correct":"✓ The misaddressed package was delivered to the wrong address.","note":"'Unconsigned' refers to the status of not being sent for consignment, not to issues with delivery. Use 'misaddressed' or 'wrongly addressed' for delivery errors."}],"priority":"★★☆"},"related_words":{"derivatives":["consign (verb)","consignment (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unconsigned' is a relatively uncommon term, primarily used in business or logistics contexts. It describes goods or items that have not been sent to a consignee (a person or company to whom goods are shipped). Understanding this word requires familiarity with the concept of consignment, which involves entrusting goods to another party for sale or storage."},"example_sentences":[{"sentence":"The company decided to keep the remaining products unconsigned for direct sales.","translation":"会社は残りの製品を委託せずに直接販売することにした。","type":"adjective","meaning_category":"Not consigned"},{"sentence":"All unconsigned materials must be properly labeled and stored.","translation":"すべての委託されていない材料は適切にラベル付けされ、保管されなければならない。","type":"adjective","meaning_category":"Not consigned"}]}