{"word":"crotches","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)股、股間","english_definition":"(plural) the area of the human body between the legs where they join the torso; the part of a pair of trousers or underwear that covers the crotch.","examples":[{"sentence":"The seams on these jeans are reinforced at the crotches.","translation":"このジーンズの縫い目は股の部分が補強されている。"},{"sentence":"He felt a sudden pain in his crotch.","translation":"彼は股間に突然の痛みを感じた。"}],"collocations":["crotch area","crotch of trousers","grab one's crotch"],"synonyms":["groin","lap","scrotum"],"antonyms":[]}],"etymology":{"value":"Derived from Middle English 'croch', meaning 'hook' or 'fork'. Related to the Old Norse 'krokr' (hook). The anatomical sense developed later, referring to the forked area of the body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɒtʃɪz/","syllables":"crotch-es"},"inflection":{"singular":"crotch"},"usage_notes":{"explanation":"'Crotches' is the plural form of 'crotch'. It refers to the area where the legs meet the torso, or the corresponding part of clothing. The term can be considered somewhat vulgar or impolite in certain contexts, especially when used in reference to the human body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pain in his crotchs.","correct":"✓ He has pain in his crotch.","note":"When referring to the general area, use the singular 'crotch'. 'Crotches' is used when referring to multiple instances or parts (e.g., seams on multiple pairs of pants)."},{"incorrect":"✗ She sewed the crotch of the pants.","correct":"✓ She sewed the crotch of the pants.","note":"The phrase is correct, but be mindful of the context due to the potentially sensitive nature of the word."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["groin","scrotum","pelvis"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical/anatomical contexts)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crotches' is the plural form of 'crotch,' which refers to the area where the legs join the torso. This term is more commonly encountered in technical or anatomical contexts, or when discussing clothing construction. Due to its association with a sensitive part of the body, it's important to use this word with awareness of the social context. It's not typically used in casual conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The construction worker's pants ripped at the crotches after a long day of bending and lifting.","translation":"建設作業員のズボンは、一日中かがんだり持ち上げたりした後、股の部分が破れた。","type":"noun","meaning_category":"clothing"},{"sentence":"He experienced discomfort in his crotch area after the bicycle ride.","translation":"彼は自転車に乗った後、股間に不快感を感じた。","type":"noun","meaning_category":"anatomy"}]}