{"word":"Pretentiousnesses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being pretentious; instances of pretentious behavior or expression.","english_definition":"Plural form of pretentiousness: the act of claiming or pretending to possess qualities or abilities that one does not have, especially to impress others.","examples":[{"sentence":"The pretentiousnesses of the art critic were evident in his overly complicated language.","translation":"その美術評論家の気取りは、彼の過度に複雑な言葉遣いには明らかだった。"},{"sentence":"The play was filled with pretentiousnesses that made it difficult to enjoy.","translation":"その劇は気取りに満ち溢れており、楽しむのが難しかった。"}],"collocations":["intellectual pretentiousnesses","artistic pretentiousnesses","cultural pretentiousnesses"],"synonyms":["affectations","airs","showiness","ostentation","pompousness"],"antonyms":["modesty","humility","simplicity","genuineness"]}],"etymology":{"value":"Derived from 'pretentious' + '-ness' (suffix forming nouns denoting a state or quality) + '-es' (plural suffix). 'Pretentious' comes from the verb 'pretend', ultimately from Latin 'praetendere' (to stretch before, put forward, allege).","priority":"★☆☆"},"pronunciation":{"ipa":"/prɪˈtɛnʃəsnəsɪz/","syllables":"pri-ten-shus-ness-es"},"inflection":{"noun_plural":"pretentiousnesses"},"usage_notes":{"explanation":"'Pretentiousnesses' is the plural form of 'pretentiousness,' which refers to the quality of being pretentious. It is used to describe multiple instances or examples of pretentious behavior, claims, or expressions. The term is often used critically to denote behavior perceived as exaggerated, artificial, or intended to impress others rather than reflecting genuine qualities or abilities.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pretentiousnesses was obvious.","correct":"✓ The pretentiousness was obvious.","note":"'Pretentiousness' is an uncountable noun when referring to the general quality. Use the plural form 'pretentiousnesses' when referring to specific instances or acts of pretentiousness."},{"incorrect":"✗ He showed a lot of pretentiousnesses.","correct":"✓ He showed a lot of pretentiousness.","note":"When referring to a general abundance of pretentious behavior, 'pretentiousness' (uncountable) is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["pretentious (adjective)","pretentiously (adverb)"],"phrases":["affected airs","putting on airs"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pretentiousnesses' is a relatively rare and complex word, primarily used in formal or academic contexts. It refers to multiple instances or examples of pretentious behavior or expression, where someone attempts to appear more important, intelligent, or cultured than they actually are. Understanding this word requires a strong grasp of vocabulary and an ability to recognize nuanced social behaviors. It is more commonly encountered in written texts, particularly in literary criticism or sociological analyses, rather than in everyday conversation."},"example_sentences":[{"sentence":"The novel criticized the pretentiousnesses of the upper class.","translation":"その小説は上流階級の気取りを批判した。","type":"noun","meaning_category":"Instances of pretentious behavior"},{"sentence":"The art exhibition showcased a variety of artistic pretentiousnesses.","translation":"その美術展はさまざまな芸術的な気取りを展示していた。","type":"noun","meaning_category":"Instances of pretentious expression"}]}