{"word":"episome","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エピソーム","english_definition":"A genetic element inside some bacterial cells, especially a plasmid, that can replicate independently of the host cell's chromosome or be integrated into it.","examples":[{"sentence":"The F plasmid is an example of an episome in E. coli.","translation":"Fプラスミドは大腸菌におけるエピソームの例である。"},{"sentence":"Episomes can transfer genetic material between bacteria.","translation":"エピソームは細菌間で遺伝物質を伝達することができる。"}],"collocations":["F plasmid","bacterial chromosome","genetic material","host cell"],"synonyms":["plasmid","genetic element"],"antonyms":["chromosome"]}],"etymology":{"value":"From Greek *epi-* (upon, above) + *soma* (body).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɛpɪˌsoʊm","syllables":"ep-i-some"},"inflection":{"noun_plural":"episomes"},"usage_notes":{"explanation":"An episome is a type of genetic element that can exist either independently or integrated into the host chromosome. Plasmids are often referred to as episomes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Episome is only found in eukaryotic cells.","correct":"✓ Episomes are typically found in prokaryotic cells, such as bacteria.","note":"Episomes are more commonly associated with prokaryotic cells, although similar elements can exist in eukaryotes."}],"priority":"★★☆"},"related_words":{"derivatives":["episomal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Episome' is a technical term used in genetics and microbiology to describe a genetic element that can replicate independently or integrate into the host cell's chromosome. Understanding this term requires a background in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The episome was successfully integrated into the bacterial chromosome.","translation":"エピソームは細菌の染色体への組み込みに成功した。","type":"scientific","meaning_category":"genetics"},{"sentence":"Researchers are studying the role of episomes in antibiotic resistance.","translation":"研究者たちは抗生物質耐性におけるエピソームの役割を研究している。","type":"scientific","meaning_category":"genetics"}]}