{"word":"Akh","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代エジプト)アク、輝けるもの、変容した魂","english_definition":"(Ancient Egypt) The transfigured soul of a person who has died and become effective in the afterlife; the 'effective one', 'shining one', or 'transfigured spirit'.","examples":[{"sentence":"The goal of the ancient Egyptians was to become an Akh after death.","translation":"古代エジプト人の目標は、死後にアクになることだった。"},{"sentence":"The Akh was believed to have magical powers and could interact with the living world.","translation":"アクは魔法の力を持つと信じられており、生者の世界と交流することができた。"}],"collocations":["become an Akh","the Akh spirit","the transfigured Akh"],"synonyms":["transfigured soul","effective spirit"],"antonyms":[]}],"etymology":{"value":"From the Egyptian word 'ꜥḫ' (ꜣḫ), meaning 'effective one', 'shining one', or 'transfigured spirit'. It referred to a soul that had undergone successful transformation in the afterlife.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːk/","syllables":"Akh"},"inflection":{"noun_plural":"Akhs or Akhu (less common)"},"usage_notes":{"explanation":"In ancient Egyptian religion, the Akh was one of the components of the soul, representing the transformed and effective spirit of a deceased person who had successfully navigated the trials of the afterlife. It was distinct from the Ka (life force) and the Ba (personality/soul). The Akh could interact with the gods and the living, and was associated with light and power.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Akh was the body of the deceased.","correct":"✓ The Akh was the transfigured spirit of the deceased.","note":"The Akh was a spiritual entity, not the physical body. It was the result of a successful transformation in the afterlife."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["Ka (life force)","Ba (personality/soul)","Mummification","Afterlife","Osiris"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in the context of Egyptology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Akh' is a specialized term from ancient Egyptian religion, referring to the transfigured and effective spirit of a deceased person. Understanding this term requires knowledge of ancient Egyptian beliefs about the soul and the afterlife. It is not commonly used outside of Egyptological contexts."},"example_sentences":[{"sentence":"The ancient Egyptians performed elaborate rituals to ensure the deceased would become a powerful Akh.","translation":"古代エジプト人は、故人が強力なアクになることを確実にするために、手の込んだ儀式を行った。","type":"noun","meaning_category":"transfigured soul"},{"sentence":"Only those who lived a virtuous life could hope to achieve Akh status in the afterlife.","translation":"徳の高い生活を送った者だけが、死後の世界でアクの地位を得ることを望むことができた。","type":"noun","meaning_category":"transfigured soul"}]}