{"word":"kelekatan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"Attachment, bond, or adherence.","english_definition":"The emotional bond between individuals, especially between a child and their caregiver; the state of being attached or adhered to something.","examples":[{"sentence":"Kelekatan anak pada ibunya sangat kuat.","translation":"The child's attachment to their mother is very strong.","english_translation":"The child's attachment to their mother is very strong."},{"sentence":"Perekat itu menjamin kelekatan yang kuat antara dua permukaan.","translation":"The adhesive ensures a strong bond between the two surfaces.","english_translation":"The adhesive ensures a strong bond between the two surfaces."},{"sentence":"Teori kelekatan menjelaskan bagaimana hubungan awal memengaruhi perkembangan emosional.","translation":"Attachment theory explains how early relationships influence emotional development.","english_translation":"Attachment theory explains how early relationships influence emotional development."}],"collocations":["kelekatan emosional (emotional attachment)","teori kelekatan (attachment theory)","kelekatan yang kuat (strong attachment)","kelekatan pada ibu (attachment to mother)","membentuk kelekatan (to form an attachment)"],"synonyms":["ikatan","hubungan","pertautan","keterikatan","adhesi"],"antonyms":["keterpisahan","pemisahan","pelepasan"],"related_terms":["melekat (to attach)","perekat (adhesive)"]}],"etymology":{"value":"Derived from the Indonesian word 'lekat' which means 'to stick' or 'to adhere'. The prefix 'ke-' and suffix '-an' are added to form a noun indicating a state or process.","priority":"★★☆"},"pronunciation":{"ipa":"/kə.lə.ka.tan/","syllables":"ke-le-ka-tan"},"inflection":{"noun_forms":{"singular":"kelekatan","plural":"kelekatan-kelekatan (rare, formal)"}},"usage_notes":{"explanation":"'Kelekatan' is commonly used in psychology, especially in the context of child development and interpersonal relationships. It refers to the emotional bond that develops between individuals, particularly between infants and their caregivers. It can also refer to physical adhesion or bonding in a more general sense.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dia memiliki kelekatan dengan mobilnya. (Incorrect, literal translation of 'He has an attachment to his car' but sounds unnatural)","correct":"Dia sangat menyukai mobilnya. (He really likes his car.) / Dia memiliki ikatan emosional dengan mobilnya. (He has an emotional bond with his car.)","note":"While 'kelekatan' can be used for objects, it's more common to use it for relationships or when emphasizing an emotional bond. For simple liking, 'suka' or 'sayang' are more natural."},{"incorrect":"Kelekatan itu sangat longgar. (The attachment is very loose.)","correct":"Keterikatan itu sangat longgar. (The bond is very loose.) / Adhesi itu sangat lemah. (The adhesion is very weak.)","note":"'Keterikatan' is a better synonym in this context. If referring to physical adhesion, use 'adhesi' or specify what is loose (e.g., 'perekatnya tidak kuat' - the adhesive isn't strong)."}],"priority":"★★☆"},"related_words":{"derivatives":["terlekat (attached)","pelekatan (the process of attaching)"],"compound_words":["kelekatan sosial (social attachment)","kelekatan aman (secure attachment)","kelekatan tidak aman (insecure attachment)"]},"level_frequency":{"frequency_corpus":"Moderately frequent, especially in psychological and developmental contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Kelekatan' is a relatively abstract noun. It's most commonly encountered in discussions of psychology, child development, and interpersonal relationships. Understanding the context is crucial to grasping its precise meaning, as it can refer to emotional bonds or physical adhesion. It's less common in everyday conversation than simpler words like 'hubungan' (relationship) or 'ikatan' (bond)."},"example_sentences":[{"sentence":"Kualitas kelekatan antara anak dan pengasuhnya memengaruhi perkembangan sosial anak.","translation":"The quality of the attachment between a child and their caregiver influences the child's social development.","type":"noun","meaning_category":"emotional bond"},{"sentence":"Kelekatan yang kuat pada nilai-nilai budaya membantu mempertahankan identitas masyarakat.","translation":"A strong adherence to cultural values helps maintain the community's identity.","type":"noun","meaning_category":"adherence"},{"sentence":"Para ilmuwan mempelajari mekanisme kelekatan sel pada permukaan biomaterial.","translation":"Scientists are studying the mechanisms of cell adhesion to biomaterial surfaces.","type":"noun","meaning_category":"physical adhesion"}]}