{"word":"gynandromorphous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"雌雄モザイクの、雌雄型的","english_definition":"Having both male and female characteristics in different parts of the body; exhibiting gynandromorphism.","examples":[{"sentence":"The gynandromorphous butterfly had one wing with male coloration and the other with female coloration.","translation":"その雌雄モザイクの蝶は、片方の翅が雄の色、もう片方の翅が雌の色をしていた。"},{"sentence":"Gynandromorphous chickens are rare but provide insights into sex determination.","translation":"雌雄モザイクの鶏はまれだが、性決定に関する洞察を提供する。"}],"collocations":["gynandromorphous butterfly","gynandromorphous chicken","exhibit gynandromorphism","partial gynandromorph"],"synonyms":["bilateral gynandromorph","sex mosaic","sexual mosaic"],"antonyms":["hermaphrodite","bisexual"]},{"part_of_speech":"noun","definition":"雌雄モザイク個体","english_definition":"An individual organism exhibiting both male and female characteristics in different parts of its body.","examples":[{"sentence":"This gynandromorph is a fascinating example of genetic mosaicism.","translation":"この雌雄モザイク個体は、遺伝的モザイク現象の魅力的な例である。"},{"sentence":"Researchers are studying gynandromorphs to understand the genetic mechanisms of sex determination.","translation":"研究者たちは性決定の遺伝的メカニズムを理解するために雌雄モザイク個体を研究している。"}],"collocations":["study gynandromorphs","rare gynandromorph","genetic mosaicism","sexual differentiation"],"synonyms":["gynander","sex mosaic","sexual mosaic"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'gynē' (γυνή) meaning 'female', 'andr-' (ἀνδρ-) from 'anēr' (ἀνήρ) meaning 'male', and 'morphē' (μορφή) meaning 'form' or 'shape'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒaɪˌnændrəˈmɔːrfəs/","syllables":"gy-nan-dro-mor-phous"},"inflection":{"adjective_forms":{"comparative":null,"superlative":null},"noun_plural":"gynandromorphs"},"usage_notes":{"explanation":"'Gynandromorphous' describes an organism that has both male and female characteristics, typically with a distinct division in the body. This is different from hermaphroditism, where an individual has both male and female reproductive organs. Gynandromorphism is often caused by genetic abnormalities during early development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gynandromorphous animal was a hermaphrodite.","correct":"✓ The gynandromorphous animal had both male and female characteristics in different parts of its body.","note":"Gynandromorphs have distinct male and female parts, unlike hermaphrodites which have both male and female reproductive organs within the same individual. The terms are not interchangeable."}],"priority":"★★☆"},"related_words":{"derivatives":["gynandromorphism (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gynandromorphous' is a specialized term used in biology, particularly in genetics and developmental biology. It describes an organism that exhibits both male and female characteristics in different parts of its body, often with a clear demarcation. This term is more likely to be encountered in scientific literature or advanced biology courses rather than in general conversation."},"example_sentences":[{"sentence":"The gynandromorphous bird had feathers of different colors on each side of its body.","translation":"その雌雄モザイクの鳥は、体の左右で羽の色が異なっていた。","type":"adjective","meaning_category":"雌雄モザイクの"},{"sentence":"The study focused on the genetic basis of gynandromorphs in insects.","translation":"その研究は、昆虫における雌雄モザイク個体の遺伝的基盤に焦点を当てた。","type":"noun","meaning_category":"雌雄モザイク個体"}]}