{"word":"baronet","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"準男爵","english_definition":"A member of a British hereditary order of honour, ranking below a baron but above a knight. Baronets are addressed as 'Sir' followed by their first name and surname.","examples":[{"sentence":"Sir John Smith is a baronet.","translation":"ジョン・スミス卿は準男爵である。"},{"sentence":"The title of baronet is hereditary.","translation":"準男爵の称号は世襲である。"}],"collocations":["create a baronet","inherit a baronetcy","Sir [Name] (addressing a baronet)"],"synonyms":["none (unique title)"],"antonyms":["commoner","knight","baron","earl","duke","king"]}],"etymology":{"value":"From the Old French word 'baronet,' a diminutive of 'baron.' Created by King James I of England in 1611 as a means of raising funds; individuals could purchase the hereditary title.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbærənət/","syllables":"bar-o-net"},"inflection":{"noun_plural":"baronets"},"usage_notes":{"explanation":"A baronetcy is a hereditary title, meaning it can be passed down through a family line. Unlike peers (barons, earls, dukes, etc.), baronets are not members of the House of Lords. The correct way to address a baronet is 'Sir [First Name] [Surname]' (e.g., 'Sir John Smith'). The wife of a baronet is addressed as 'Lady [Surname]' (e.g., 'Lady Smith').","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Baronet Smith.","correct":"✓ He is Sir John Smith, a baronet.","note":"Baronet is a title, not a surname. Baronets are addressed as 'Sir [First Name] [Surname]'."},{"incorrect":"✗ The Baronet's wife is called Baronetess Smith.","correct":"✓ The baronet's wife is called Lady Smith.","note":"The wife of a baronet is called 'Lady [Surname]'."}],"priority":"★★☆"},"related_words":{"derivatives":["baronetcy (noun: the rank or dignity of a baronet)","baronetess (noun: the wife of a baronet, or a woman holding the title in her own right - rare)"],"idioms_phrases":["none"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not typically taught in language courses)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'baronet' refers to a specific hereditary title within the British honours system. It's a relatively uncommon word, primarily encountered in historical contexts, literature, or discussions of the British aristocracy. Understanding requires knowledge of the British peerage system. It is below a Baron but above a Knight. The title is hereditary and the holder is addressed as 'Sir [First Name] [Surname]'."},"example_sentences":[{"sentence":"The new baronet inherited the family estate.","translation":"新しい準男爵は家族の領地を相続した。","type":"noun","meaning_category":"title"},{"sentence":"Sir Thomas was a well-respected baronet in the community.","translation":"トーマス卿は地域社会で尊敬されている準男爵だった。","type":"noun","meaning_category":"title"}]}