{"word":"secularismo","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"世俗主義、政教分離","english_definition":"the principle of separation of the state from religious institutions.","examples":[{"sentence":"El secularismo es un principio fundamental en muchos países democráticos.","translation":"世俗主義は多くの民主主義国における基本的な原則です。"},{"sentence":"El debate sobre el secularismo y la religión sigue siendo relevante en la sociedad actual.","translation":"世俗主義と宗教に関する議論は、現代社会においても依然として重要です。"}],"collocations":["promover el secularismo (世俗主義を推進する)","defender el secularismo (世俗主義を擁護する)","secularismo radical (過激な世俗主義)","secularismo moderado (穏健な世俗主義)"],"synonyms":["laicismo","irreligiosidad"],"antonyms":["religiosidad","confesionalismo"]},{"part_of_speech":"noun","definition":"世俗性、非宗教性","english_definition":"the state of being separate from religion or religious belief; a non-religious attitude.","examples":[{"sentence":"El secularismo de la sociedad moderna es cada vez más evidente.","translation":"現代社会の世俗性はますます明らかになっています。"},{"sentence":"El secularismo en la educación busca ofrecer una formación neutral en términos religiosos.","translation":"教育における世俗主義は、宗教的に中立な教育を提供しようとするものです。"}],"collocations":["aumento del secularismo (世俗主義の増加)","tendencia al secularismo (世俗主義への傾向)"],"synonyms":["mundanidad","materialismo"],"antonyms":["espiritualidad","religiosidad"]}],"etymology":{"value":"Del latín 'saecularis' (perteneciente al mundo o al tiempo presente), derivado de 'saeculum' (generación, siglo, mundo).","priority":"★★★"},"pronunciation":{"ipa":"/sekulaˈɾismo/","syllables":"se-cu-la-ris-mo"},"inflection":{"noun_gender":"masculine","noun_plural":"secularismos"},"usage_notes":{"explanation":"'Secularismo' se refiere a la separación entre el estado y las instituciones religiosas, así como a la disminución de la influencia de la religión en la sociedad. Es un concepto clave en la política y la sociología, especialmente en el contexto de las sociedades modernas y democráticas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El secularismo es cuando no crees en nada.","correct":"El secularismo es la separación del estado y la religión.","note":"El secularismo no implica necesariamente la falta de creencias, sino la separación de la religión y el estado."}],"priority":"★★☆"},"related_words":{"derivatives":["secular (adjective: secular, worldly)","secularización (noun: secularization)"],"phrases":["Estado laico (secular state)"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Appears frequently in political and sociological texts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Secularismo' es un término que se usa en política y sociología para describir la separación entre la religión y el estado. También se refiere a la disminución de la influencia de la religión en la sociedad. Es importante entender este concepto para comprender los debates sobre la relación entre religión y política en muchos países.","priority":"★★★"},"example_sentences":[{"sentence":"El secularismo garantiza la libertad religiosa para todos los ciudadanos.","translation":"世俗主義はすべての市民に信教の自由を保証する。","type":"general","meaning_category":"政教分離"},{"sentence":"Muchos países europeos han experimentado un aumento del secularismo en las últimas décadas.","translation":"多くのヨーロッパ諸国は、ここ数十年で世俗主義の増加を経験している。","type":"general","meaning_category":"世俗性"}]}