{"word":"dependency-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"依存志向の、依存関係を重視する","english_definition":"Characterized by a focus on or tendency towards reliance on others or external factors; prioritizing relationships and interdependence.","examples":[{"sentence":"The company culture is dependency-oriented, with a strong emphasis on teamwork and collaboration.","translation":"その会社の文化は依存志向であり、チームワークと協調を強く重視している。"},{"sentence":"A dependency-oriented approach to problem-solving involves seeking input and support from others.","translation":"問題解決への依存志向のアプローチは、他人からの意見や支援を求めることを伴う。"},{"sentence":"Some argue that modern society fosters a dependency-oriented mindset, discouraging individual initiative.","translation":"現代社会は依存志向の考え方を助長し、個人の自主性を阻害していると主張する人もいる。"}],"collocations":["dependency-oriented culture (依存志向の文化)","dependency-oriented approach (依存志向のアプローチ)","dependency-oriented mindset (依存志向の考え方)","dependency-oriented system (依存志向のシステム)"],"synonyms":["interdependent","collaborative","relationship-focused","communal","reliant"],"antonyms":["independent","autonomous","self-reliant","individualistic"]}],"etymology":{"value":"The term is formed by combining 'dependency' (the state of relying on someone or something) with 'oriented' (directed or focused towards).","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"de-pen-den-cy-o-ri-en-ted"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Dependency-oriented' describes something that prioritizes or is structured around the idea of reliance and interdependence. It can apply to individuals, groups, systems, or cultures. It often implies a focus on relationships and collaboration, but can sometimes carry a negative connotation of lacking self-sufficiency.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was dependency-oriented, it failed because no one took responsibility.","correct":"✓ The project was dependency-oriented; it failed because no one took responsibility.","note":"The semicolon connects two related independent clauses. Alternatively, split into two sentences. The problem isn't with 'dependency-oriented' itself, but the sentence structure."}],"priority":"☆☆☆"},"related_words":{"derivatives":["dependency (noun)","orientation (noun)"],"related_terms":["interdependence","codependency","reliance","collaboration"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Dependency-oriented' is a relatively complex term used in social sciences, business, and psychology to describe systems, cultures, or approaches that emphasize reliance on others. Understanding requires familiarity with the concepts of dependency and orientation. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The success of the project relied on a dependency-oriented network of suppliers.","translation":"プロジェクトの成功は、サプライヤーの依存志向のネットワークに依存していた。","type":"general","meaning_category":"reliance on others"},{"sentence":"The therapy group promoted a dependency-oriented environment where members could support each other.","translation":"そのセラピーグループは、メンバーがお互いをサポートできる依存志向の環境を促進した。","type":"psychology","meaning_category":"support and interdependence"}]}