{"word":"store-installed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(ソフトウェアなどが)店舗でインストールされた、購入時にインストール済みの","english_definition":"(of software, etc.) installed in a store before purchase; pre-installed at the point of sale.","examples":[{"sentence":"The laptop came with store-installed anti-virus software.","translation":"そのラップトップには、店舗でインストールされたアンチウイルスソフトウェアが付属していた。"},{"sentence":"Many computers now offer store-installed options for operating systems and productivity suites.","translation":"現在、多くのコンピューターが、オペレーティングシステムやオフィススイートの店舗インストールオプションを提供している。"}],"collocations":["store-installed software","store-installed applications","store-installed operating system"],"synonyms":["pre-installed","factory-installed","preloaded"],"antonyms":["user-installed","self-installed"]}],"etymology":{"value":"Combination of 'store' (referring to a retail establishment) and 'installed' (meaning to set up and make ready for use).","priority":"N/A"},"pronunciation":{"ipa":"/ˈstɔːr ɪnˈstɔːld/","syllables":"store-in-stalled"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Store-installed' refers to software or other digital content that is installed on a device by the retailer before the customer purchases it. This is often done to add value to the product, provide convenience for the customer, or to offer a trial version of a program. It is distinct from software installed by the user after purchase.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The store installed the computer.","correct":"✓ The store installed software on the computer.","note":"The store installs *something* (e.g., software, applications), not the entire computer itself. The computer *has* store-installed software."}],"priority":"N/A"},"related_words":{"derivatives":["store","installed","installation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Store-installed' is a technical term used to describe software or applications that are already present on a device when you buy it from a store. It's often used in the context of computers, laptops, and smartphones. This is different from software you download and install yourself after you've bought the device."},"example_sentences":[{"sentence":"The new tablet features several useful store-installed apps.","translation":"その新しいタブレットには、いくつかの便利な店舗インストールアプリが搭載されている。","type":"adjective","meaning_category":"pre-installed software"},{"sentence":"Check if the device has any unwanted store-installed programs before you start using it.","translation":"デバイスを使い始める前に、不要な店舗インストールプログラムがないか確認してください。","type":"adjective","meaning_category":"pre-installed programs"}]}