{"word":"cichlids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シクリッド (スズキ目カワスズメ科に属する魚の総称)","english_definition":"A diverse family (Cichlidae) of freshwater fishes, many of which are popular in aquariums.","examples":[{"sentence":"Cichlids are known for their vibrant colors and complex social behaviors.","translation":"シクリッドは鮮やかな色彩と複雑な社会行動で知られています。"},{"sentence":"Many cichlids exhibit parental care, protecting their eggs and fry.","translation":"多くのシクリッドは親による保護行動を示し、卵や稚魚を保護します。"},{"sentence":"African cichlids are popular among aquarium enthusiasts.","translation":"アフリカ産のシクリッドはアクアリウム愛好家の間で人気があります。"}],"collocations":["African cichlids (アフリカ産シクリッド)","South American cichlids (南米産シクリッド)","cichlid aquarium (シクリッド水槽)","cichlid behavior (シクリッドの行動)","cichlid species (シクリッドの種)"],"synonyms":["none (general term for a family of fish)"],"antonyms":["none (general term for a family of fish)"]}],"etymology":{"value":"Derived from the Ancient Greek word 'kichle', which was used to refer to a type of fish. The modern scientific name 'Cichlidae' and the common name 'cichlid' are based on this Greek root.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪklɪdz/","syllables":"cik-lids"},"inflection":{"noun_plural":"cichlids (already plural, referring to multiple fish or the family in general)"},"usage_notes":{"explanation":"'Cichlids' refers to a large and diverse family of fish found primarily in freshwater habitats in Africa, South America, and Asia. They are popular in aquariums due to their bright colors and interesting behaviors. The term is typically used in the plural form, as it refers to the family as a whole or to multiple individual fish. When referring to a single fish, one might say 'a cichlid fish' or simply 'a cichlid'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have one cichlid in my aquarium.","correct":"✓ I have a cichlid in my aquarium.","note":"While 'cichlids' is the plural form, when referring to a single fish, use 'a cichlid' or 'one cichlid fish'."},{"incorrect":"✗ Cichlid is a very interesting fish.","correct":"✓ Cichlids are very interesting fish.","note":"When referring to the family of fish in general, use the plural form 'cichlids'."}],"priority":"★★☆"},"related_words":{"derivatives":["Cichlidae (scientific family name)"],"phrasal_verbs":["none (not typically used with phrasal verbs)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (technical vocabulary related to biology and aquariums)","frequency_google_ngram":"Relatively low frequency, but common in specialized contexts (aquariums, fishkeeping, biology).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'cichlids' is a technical term referring to a specific family of fish. It's commonly used among people interested in aquariums and fishkeeping, as well as in scientific contexts related to biology and zoology. Understanding the term requires some familiarity with these fields. While not a common word in everyday conversation, it's important within its specific domain."},"example_sentences":[{"sentence":"Lake Malawi is famous for its diverse population of colorful **cichlids**.","translation":"マラウィ湖は、多様な色彩豊かなシクリッドが生息することで有名です。","type":"noun","meaning_category":"シクリッド"},{"sentence":"Many **cichlids** are territorial and can be aggressive towards other fish.","translation":"多くのシクリッドは縄張り意識が強く、他の魚に対して攻撃的になることがあります。","type":"noun","meaning_category":"シクリッド"},{"sentence":"The aquarium featured a wide variety of South American **cichlids**.","translation":"その水族館には、さまざまな南米産のシクリッドが展示されていました。","type":"noun","meaning_category":"シクリッド"}]}