{"word":"post-dormant","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"休眠後、休眠明けの","english_definition":"Occurring or existing after a period of dormancy.","examples":[{"sentence":"The post-dormant buds began to swell with the arrival of spring.","translation":"春の到来とともに、休眠明けの芽が膨らみ始めた。"},{"sentence":"Post-dormant activity in the hive signaled the return of the bees.","translation":"巣箱内の休眠明けの活動は、ミツバチの帰還を示していた。"}],"collocations":["post-dormant growth","post-dormant activity","post-dormant period"],"synonyms":["awakened","revived","post-hibernation"],"antonyms":["dormant","pre-dormant"]}],"etymology":{"value":"Formed by combining the prefix 'post-' (meaning 'after') with the adjective 'dormant' (meaning 'in a state of inactivity or rest').","priority":"Medium"},"pronunciation":{"ipa":"/ˌpoʊstˈdɔːrmənt/","syllables":"post-dor-mant"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative forms (more post-dormant, most post-dormant)."},"usage_notes":{"explanation":"'Post-dormant' is typically used in biological or agricultural contexts to describe the state or activity of organisms (plants, animals, insects) after they have emerged from a period of dormancy, such as hibernation or winter rest. It indicates a transition from a state of inactivity to one of renewed activity or growth.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The post-dormant state was before winter.","correct":"The post-dormant state was after winter.","note":"'Post-' means 'after', so ensure you use it to describe something occurring after dormancy."}],"priority":"Low"},"related_words":{"derivatives":["dormancy","dormant","post"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Post-dormant' is a technical term primarily used in scientific or agricultural contexts. It describes the state of an organism (like a plant or animal) after it has come out of a period of inactivity or dormancy. Understanding this term requires familiarity with the concept of dormancy and the meaning of the prefix 'post-'. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The post-dormant metabolic rate of the lizard increased as the temperature rose.","translation":"気温の上昇とともに、トカゲの休眠明けの代謝率は増加した。","type":"adjective","meaning_category":"Biology"},{"sentence":"Farmers monitored the post-dormant bud development to predict the fruit yield.","translation":"農家は果実の収量を予測するために、休眠明けの芽の発達を監視した。","type":"adjective","meaning_category":"Agriculture"}]}