{"word":"Shackbolt","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Fantasy fiction) A surname, likely of English origin, possibly derived from place names or occupations.","english_definition":"A surname, likely of English origin, possibly derived from place names or occupations, often found in fantasy fiction.","examples":[{"sentence":"The character, Elara Shackbolt, was known for her bravery.","translation":"その登場人物、エララ・シャックボルトは、彼女の勇敢さで知られていた。"}],"collocations":["Family Shackbolt","House of Shackbolt"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The etymology is uncertain, but it could be a combination of 'shack' (a roughly built hut or cabin) and 'bolt' (a bar used to fasten a door or gate). Alternatively, it might be a place name.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈʃækˌboʊlt/","syllables":"Shack-bolt"},"inflection":{"noun_plural":"Shackbolts"},"usage_notes":{"explanation":"'Shackbolt' is not a common surname in the real world. Its use is more prevalent in fictional works, particularly in fantasy settings, where unique and evocative names are often created. It may suggest a character associated with humble dwellings or fortified places.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily found in fiction.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shackbolt' is a rare surname, primarily encountered in fictional contexts. Understanding its potential etymology and usage requires familiarity with both common English words and fantasy naming conventions."},"example_sentences":[{"sentence":"Lord Shackbolt surveyed his domain from the castle walls.","translation":"シャックボルト卿は城壁から自分の領地を見渡した。","type":"noun","meaning_category":"Surname"},{"sentence":"The Shackbolt family had a long history in the village.","translation":"シャックボルト家は村に長い歴史を持っていた。","type":"noun","meaning_category":"Surname"}]}