{"word":"anti-Greece","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"反ギリシャの、ギリシャに反対する","english_definition":"Opposed to Greece, Greek people, or Greek culture.","examples":[{"sentence":"The politician was accused of making anti-Greece statements.","translation":"その政治家は反ギリシャ的な発言をしたと非難された。"},{"sentence":"The protest was organized by an anti-Greece group.","translation":"その抗議活動は反ギリシャ団体によって組織された。"}],"collocations":["anti-Greece sentiment","anti-Greece rhetoric","anti-Greece propaganda"],"synonyms":["anti-Greek"],"antonyms":["pro-Greece","pro-Greek"]},{"part_of_speech":"noun","definition":"反ギリシャ主義者、ギリシャに反対する人","english_definition":"A person who opposes Greece, Greek people, or Greek culture.","examples":[{"sentence":"He was labeled as an anti-Greece by the media.","translation":"彼はメディアによって反ギリシャ主義者とレッテルを貼られた。"}],"collocations":[],"synonyms":["anti-Greek"],"antonyms":["pro-Greece","pro-Greek"]}],"etymology":{"value":"The prefix 'anti-' means 'against' or 'opposed to'. Combined with 'Greece', it forms a term indicating opposition to Greece.","priority":"Medium"},"pronunciation":{"ipa":"/ˌæntiˈɡriːs/","syllables":"an-ti-Greece"},"inflection":{"notes":"As a compound word, inflection is limited. The adjective form does not inflect. The noun form can be pluralized (anti-Greeces), but this is rare."},"usage_notes":{"explanation":"'Anti-Greece' is used to describe sentiments, actions, or individuals that are against Greece, its people, or its culture. It is often used in political or social contexts to describe opposition or hostility. The term can be sensitive, as it implies a negative bias or prejudice.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is very anti-Greece. He hates all countries.","correct":"He is very anti-Greece. He is critical of Greek policies.","note":"Being anti-Greece does not necessarily mean hating all countries; it specifically relates to opposition towards Greece."}],"priority":"Low"},"related_words":{"derivatives":["anti-Greek (adjective, noun)"],"related_terms":["Hellenophobia (fear or dislike of Greece or Greek culture)","xenophobia (fear or dislike of foreigners)"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Anti-Greece' is a relatively complex term used to describe opposition or hostility towards Greece, its people, or its culture. It is often found in political or social discussions and requires an understanding of the prefix 'anti-' and the context of Greek-related issues. The term can carry strong negative connotations, implying prejudice or bias."},"example_sentences":[{"sentence":"The newspaper published an article with an anti-Greece bias.","translation":"その新聞は反ギリシャ的な偏見のある記事を掲載した。","type":"adjective","meaning_category":"反ギリシャの"},{"sentence":"Several protesters carried signs with anti-Greece slogans.","translation":"数人の抗議者が反ギリシャのスローガンが書かれたプラカードを掲げていた。","type":"adjective","meaning_category":"反ギリシャの"},{"sentence":"The politician's anti-Greece stance caused controversy.","translation":"その政治家の反ギリシャ的な姿勢は論争を引き起こした。","type":"adjective","meaning_category":"反ギリシャの"}]}