{"word":"floutingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"あざけるように、無視して、軽蔑的に","english_definition":"In a manner that shows open contempt and disregard; scornfully; contemptuously.","examples":[{"sentence":"He floutingly disregarded the safety regulations, putting everyone at risk.","translation":"彼は安全規則をあざけるように無視し、皆を危険にさらした。"},{"sentence":"She floutingly dismissed their concerns, acting as if she were above the rules.","translation":"彼女は彼らの懸念を軽蔑的に退け、まるで自分が規則の上にいるかのように振る舞った。"}],"collocations":["disregard floutingly","dismiss floutingly","ignore floutingly","reject floutingly"],"synonyms":["scornfully","contemptuously","disdainfully","mockingly","derisively","defiantly","disrespectfully"],"antonyms":["respectfully","obediently","deferentially"]}],"etymology":{"value":"The word \"floutingly\" is derived from the verb \"flout,\" which means to openly disregard or defy (a rule, law, or convention). The suffix \"-ingly\" turns it into an adverb, indicating the manner in which the action of flouting is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflaʊtɪŋli/","syllables":"flout-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Floutingly\" describes an action done with a clear intention to defy or disregard something, often with a sense of arrogance or contempt. It emphasizes the manner in which the rule or convention is being ignored, highlighting the disrespect or defiance involved. It is not a commonly used word, and its use often adds a strong negative connotation to the action being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was floutingly of the rules.","correct":"✓ He was flouting the rules.","note":"\"Floutingly\" is an adverb, not a preposition. The correct verb form to use is \"flouting,\" which is the present participle of \"flout.\""},{"incorrect":"✗ She acted floutingly.","correct":"✓ She acted floutingly, disregarding all advice.","note":"While grammatically correct, \"She acted floutingly\" is vague. It's better to clarify what was being flouted. Adding a phrase specifying what was disregarded makes the sentence clearer."}],"priority":"★★☆"},"related_words":{"derivatives":["flout (verb): to openly disregard or defy","flouter (noun): someone who flouts rules or conventions","flouting (adjective): openly disregarding or defying"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Floutingly\" is an advanced adverb that describes an action performed with open contempt and disregard for rules or conventions. It implies a deliberate and often arrogant defiance. Due to its infrequent use and sophisticated meaning, it is typically encountered in advanced texts and is more suited for those with a strong command of the English language."},"example_sentences":[{"sentence":"The rebel leader floutingly challenged the authority of the government.","translation":"反政府勢力のリーダーは、政府の権威をあざけるように挑発した。","type":"adverb","meaning_category":"あざけるように"},{"sentence":"The company floutingly ignored environmental regulations, leading to severe pollution.","translation":"その会社は環境規制を軽蔑的に無視し、深刻な汚染を引き起こした。","type":"adverb","meaning_category":"軽蔑的に"},{"sentence":"He floutingly waved the parking ticket in front of the officer before driving away.","translation":"彼は駐車違反切符を警官の前であざけるように振り回してから車で走り去った。","type":"adverb","meaning_category":"あざけるように"}]}