{"word":"stemmy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)茎が多い、茎質の","english_definition":"Having many stems; resembling a stem; consisting of stems.","examples":[{"sentence":"The broccoli was too stemmy and not enough florets.","translation":"そのブロッコリーは茎の部分が多すぎて、花蕾が少なかった。"},{"sentence":"The wine had a stemmy flavor, indicating the inclusion of stems during fermentation.","translation":"そのワインは茎のような風味がし、発酵中に茎が含まれていたことを示唆していた。"}],"collocations":["stemmy broccoli","stemmy flavor","stemmy texture"],"synonyms":["stalky","fibrous","woody"],"antonyms":["leafy","succulent","tender"]},{"part_of_speech":"adjective","definition":"(ワインのテイスティングで)茎のような風味を持つ","english_definition":"(Wine tasting) Having a flavor reminiscent of stems, often due to the inclusion of stems during fermentation.","examples":[{"sentence":"The wine was criticized for being too stemmy.","translation":"そのワインは茎のような風味が強すぎると批判された。"},{"sentence":"A slight stemmy note can add complexity, but too much is undesirable.","translation":"わずかな茎のような風味は複雑さを加える可能性があるが、多すぎると好ましくない。"}],"collocations":["stemmy wine","stemmy note","stemmy character"],"synonyms":["green","vegetal","herbaceous"],"antonyms":["fruity","floral","ripe"]}],"etymology":{"value":"Derived from the noun \"stem\" by adding the suffix \"-y\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈstɛmi/","syllables":"stem-my"},"inflection":{"adjective_forms":{"comparative":"stemmier","superlative":"stemmiest"}},"usage_notes":{"explanation":"The adjective \"stemmy\" is primarily used in two contexts: describing the physical characteristics of plants and describing the flavor of wine. When describing plants, it refers to having an abundance of stems or a texture resembling stems. When describing wine, it refers to a flavor profile that is reminiscent of plant stems, which can occur if the stems are included during the fermentation process. This flavor is not always desirable and can indicate a flaw in the winemaking process if it is too pronounced.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The soup was stemmy.","correct":"✓ The soup had a stemmy flavor.","note":"While you could technically describe soup as 'stemmy' if it contains a lot of stems, it's more common and precise to say it has a 'stemmy flavor' or 'stemmy taste'."},{"incorrect":"✗ He was stemmy.","correct":"✓ N/A","note":"'Stemmy' is generally not used to describe people."}],"priority":"★★☆"},"related_words":{"derivatives":["stem (noun)","stemless (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"stemmy\" is a relatively uncommon adjective. It is most often used in the context of describing either the physical characteristics of plants (having many stems) or the flavor profile of wine (having a taste reminiscent of stems). Understanding this word requires some familiarity with both botany and wine tasting terminology. Because of its specialized usage, it is not typically encountered in everyday conversation or writing."},"example_sentences":[{"sentence":"The asparagus was too **stemmy** to be enjoyable.","translation":"そのアスパラガスは茎っぽすぎて楽しめなかった。","type":"adjective","meaning_category":"(植物が)茎が多い"},{"sentence":"The sommelier noted a slightly **stemmy** character in the red wine.","translation":"ソムリエはその赤ワインにわずかに茎のような特徴があると指摘した。","type":"adjective","meaning_category":"(ワインのテイスティングで)茎のような風味を持つ"}]}