{"word":"Landfang","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Fantasy Fiction) A large, fictional canine creature with sharp teeth and claws, often depicted as a loyal companion or guardian.","english_definition":"A large, fictional canine creature with sharp teeth and claws, often depicted as a loyal companion or guardian.","examples":[{"sentence":"The brave knight was accompanied by his Landfang, a fearsome beast with a heart of gold.","translation":"勇敢な騎士は、黄金の心を持つ恐ろしい獣、ランドファングを伴っていた。"},{"sentence":"Legends tell of Landfangs protecting ancient forests from intruders.","translation":"伝説によれば、ランドファングは古代の森を侵入者から守っていた。"}],"collocations":["loyal Landfang","fierce Landfang","guardian Landfang","Landfang companion"],"synonyms":["dire wolf","shadow hound","fang beast"],"antonyms":[]}],"etymology":{"value":"Likely a portmanteau of 'land' and 'fang', suggesting a creature of the earth with prominent fangs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlændfæŋ/","syllables":"Land-fang"},"inflection":{"noun_plural":"Landfangs"},"usage_notes":{"explanation":"'Landfang' is a fictional term, primarily used in fantasy literature and games. It describes a large, canine-like creature, often associated with loyalty, protection, and ferocity. Its usage is limited to imaginative contexts and is not found in standard dictionaries.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in specific fantasy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Landfang' is a niche term, primarily encountered in fantasy settings. Understanding its meaning relies on familiarity with fantasy tropes and the ability to infer meaning from the combination of 'land' and 'fang'. It is not part of standard English vocabulary. "},"example_sentences":[{"sentence":"The Landfang's howl echoed through the mountains.","translation":"ランドファングの遠吠えが山々に響き渡った。","type":"noun","meaning_category":"Fictional creature"},{"sentence":"She trained the Landfang from a pup to be her protector.","translation":"彼女はランドファングを幼い頃から訓練し、自分の守護者にした。","type":"noun","meaning_category":"Fictional creature"}]}