{"word":"eutrophication","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"富栄養化","english_definition":"The process by which a body of water becomes enriched in dissolved nutrients (such as phosphates and nitrates) that stimulate the growth of aquatic plant life usually resulting in the depletion of dissolved oxygen.","examples":[{"sentence":"Eutrophication can lead to fish kills due to oxygen depletion.","translation":"富栄養化は、酸素欠乏により魚が死滅する原因となることがあります。"},{"sentence":"Agricultural runoff is a major contributor to eutrophication in many lakes and rivers.","translation":"農業排水は、多くの湖や河川における富栄養化の主な原因となっています。"},{"sentence":"The excessive growth of algae is a common symptom of eutrophication.","translation":"藻類の異常な増殖は、富栄養化の一般的な症状です。"}],"collocations":["cause eutrophication (富栄養化を引き起こす)","prevent eutrophication (富栄養化を防ぐ)","control eutrophication (富栄養化を制御する)","reverse eutrophication (富栄養化を逆転させる)","effects of eutrophication (富栄養化の影響)","sources of eutrophication (富栄養化の原因)"],"synonyms":["nutrient enrichment","algal bloom","water pollution"],"antonyms":["oligotrophication (貧栄養化)"]},{"part_of_speech":"noun","definition":"(より広く)栄養分の過剰な蓄積","english_definition":"(More broadly) Excessive richness of nutrients in a lake or other body of water, frequently due to runoff from the land, which causes a dense growth of plant life and death of animal life from lack of oxygen.","examples":[{"sentence":"The eutrophication of the coastal waters is a serious environmental problem.","translation":"沿岸海域の富栄養化は深刻な環境問題です。"},{"sentence":"Eutrophication disrupts the natural balance of aquatic ecosystems.","translation":"富栄養化は、水生生態系の自然なバランスを崩壊させます。"}],"collocations":["coastal eutrophication (沿岸の富栄養化)","artificial eutrophication (人為的な富栄養化)","cultural eutrophication (人為的な富栄養化 - より一般的)"],"synonyms":["nutrient loading","nutrient pollution"],"antonyms":["nutrient depletion"]}],"etymology":{"value":"From the Greek words 'eu' (well, good) + 'trophē' (nourishment, food) + '-fication' (making, causing). Literally, 'making well-nourished' or 'well-fed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːtrɒfɪˈkeɪʃən/","syllables":"eu-tro-phi-ca-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Eutrophication is primarily used in the context of environmental science and ecology, specifically referring to the excessive enrichment of water bodies with nutrients. This process leads to a series of negative consequences, including algal blooms, oxygen depletion, and the death of aquatic animals. The term is often used in discussions about water pollution, agricultural runoff, and the management of aquatic ecosystems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The eutrophication is good for the fish.","correct":"✓ Eutrophication is harmful to the fish.","note":"Eutrophication is generally harmful, not beneficial, to aquatic life due to the subsequent oxygen depletion. While it initially increases plant growth, the overall effect is negative."},{"incorrect":"✗ Eutrophication only affects lakes.","correct":"✓ Eutrophication can affect lakes, rivers, and coastal waters.","note":"Eutrophication can occur in various types of water bodies, not just lakes."}],"priority":"★★☆"},"related_words":{"derivatives":["eutrophic (adjective: 富栄養の)","eutrophicate (verb: 富栄養化する)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and environmental contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eutrophication' is a scientific term referring to the enrichment of a body of water with minerals and nutrients, leading to excessive plant growth (algal blooms) and oxygen depletion. This process is often caused by human activities, such as agricultural runoff and sewage discharge. While increased nutrients might initially seem beneficial, the resulting algal blooms block sunlight, and the decomposition of dead algae consumes oxygen, harming aquatic life. Understanding eutrophication is crucial for addressing water pollution and managing aquatic ecosystems."},"example_sentences":[{"sentence":"The government is implementing measures to reduce eutrophication in the Great Lakes.","translation":"政府は五大湖の富栄養化を軽減するための対策を実施しています。","type":"noun","meaning_category":"富栄養化"},{"sentence":"The eutrophic lake was characterized by dense algal blooms and low oxygen levels.","translation":"その富栄養化した湖は、高密度な藻類の大量発生と低い酸素レベルを特徴としていました。","type":"adjective (eutrophic)","meaning_category":"富栄養の"},{"sentence":"The researchers studied the factors contributing to the eutrophication of the bay.","translation":"研究者たちは、湾の富栄養化に寄与する要因を研究しました。","type":"noun","meaning_category":"富栄養化"},{"sentence":"The river is becoming increasingly eutrophic due to agricultural runoff.","translation":"その川は、農業排水のためにますます富栄養化が進んでいます。","type":"adjective (eutrophic)","meaning_category":"富栄養の"}]}