{"word":"single-precision","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"単精度（たんせいど）の","english_definition":"(computing) relating to a floating-point number format that occupies one word (usually 32 bits).","examples":[{"sentence":"Single-precision floating-point numbers are used to represent real numbers in computers.","translation":"単精度浮動小数点数は、コンピュータで実数を表現するために使用されます。"},{"sentence":"Single-precision arithmetic is faster but less accurate than double-precision.","translation":"単精度演算は倍精度演算よりも高速ですが、精度は低くなります。"}],"collocations":["single-precision floating-point","single-precision arithmetic","single-precision format"],"synonyms":["float (informal)"],"antonyms":["double-precision"]},{"part_of_speech":"noun","definition":"単精度（たんせいど）","english_definition":"(computing) a single-precision floating-point number format.","examples":[{"sentence":"The variable was declared as single-precision.","translation":"その変数は単精度として宣言されました。"},{"sentence":"Single-precision is sufficient for many graphics applications.","translation":"単精度は多くのグラフィックスアプリケーションには十分です。"}],"collocations":["use single-precision","declare as single-precision","convert to single-precision"],"synonyms":["float (informal)"],"antonyms":["double-precision"]}],"etymology":{"value":"The term 'single-precision' is derived from the fact that it uses a single word (typically 32 bits) to represent a floating-point number, as opposed to 'double-precision' which uses two words (typically 64 bits).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪŋɡəl prɪˈsɪʒən/","syllables":"sin-gle-pre-ci-sion"},"inflection":{"notes":"It's an adjective and a noun. No plural form for the adjective. The noun can be used as a mass noun or countable noun."},"usage_notes":{"explanation":"'Single-precision' is primarily used in the context of computer science and numerical computing to describe a floating-point number format. It is often contrasted with 'double-precision', which offers greater accuracy but requires more memory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ single precision","correct":"✓ single-precision","note":"It's typically hyphenated when used as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["precision","double-precision","floating-point"],"phrasal_verbs":[],"related_concepts":["IEEE 754","floating-point arithmetic","numerical analysis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Single-precision' is a technical term used in computer science and engineering, specifically in the context of floating-point numbers. It refers to a format for representing real numbers in a computer using a fixed number of bits (typically 32). Understanding this term requires familiarity with computer architecture and numerical representation. It's often contrasted with 'double-precision', which uses twice as many bits for higher accuracy."},"example_sentences":[{"sentence":"The graphics card supports both single-precision and double-precision calculations.","translation":"そのグラフィックスカードは、単精度と倍精度の両方の計算をサポートしています。","type":"adjective","meaning_category":"computing"},{"sentence":"Using single-precision can significantly reduce memory usage in large simulations.","translation":"単精度を使用すると、大規模なシミュレーションでのメモリ使用量を大幅に削減できます。","type":"noun","meaning_category":"computing"}]}