{"word":"terebinth","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物) テレピン油の木、イチジクの仲間","english_definition":"A tree or shrub of the genus Pistacia, especially Pistacia terebinthus, that yields turpentine.","examples":[{"sentence":"The terebinth tree is native to the Mediterranean region.","translation":"テレピン油の木は地中海地域原産です。"},{"sentence":"Ancient peoples used the resin of the terebinth for medicinal purposes.","translation":"古代の人々はテレピン油の木の樹脂を薬用目的で使用していました。"}],"collocations":["terebinth tree","Pistacia terebinthus","terebinth resin"],"synonyms":["turpentine tree","Pistachio tree (related)"],"antonyms":[]},{"part_of_speech":"noun","definition":"テレピン油","english_definition":"A fragrant oleoresin (turpentine) obtained from the terebinth tree.","examples":[{"sentence":"The scent of terebinth filled the air.","translation":"テレピン油の香りが空気に満ちていた。"}],"collocations":["terebinth oil","terebinth resin"],"synonyms":["turpentine"],"antonyms":[]}],"etymology":{"value":"From Latin terebinthus, from Ancient Greek τερέβινθος (terébinthos).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛrəˌbɪnθ/","syllables":"te-re-binth"},"inflection":{"noun_plural":"terebinths"},"usage_notes":{"explanation":"The word \"terebinth\" refers to a specific type of tree, Pistacia terebinthus, or the resin/turpentine obtained from it. It's not a commonly used word in everyday English. It is more likely to be encountered in botanical or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a terebinth flower.","correct":"✓ I saw a terebinth tree.","note":"Terebinths are trees, not flowers. While they do flower, the term primarily refers to the tree itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["turpentine","Pistacia"],"related_terms":["Pistacia atlantica","Pistacia vera (Pistachio)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Terebinth' is a relatively obscure botanical term referring to a specific tree species (Pistacia terebinthus) and its resin. It is unlikely to be encountered outside specialized contexts such as botany, historical texts describing ancient medicinal practices, or literature referencing the Mediterranean region where the tree is native. Due to its limited usage, it is not part of standard English vocabulary. Understanding requires familiarity with botanical terminology and potentially knowledge of ancient cultures and practices."},"example_sentences":[{"sentence":"The old man sat under the shade of the terebinth, contemplating the years gone by.","translation":"老人は過ぎ去った年月を思いながら、テレピン油の木陰に座っていた。","type":"noun","meaning_category":"tree"},{"sentence":"Archaeologists discovered traces of terebinth resin in ancient pottery.","translation":"考古学者は古代の陶器からテレピン油の樹脂の痕跡を発見した。","type":"noun","meaning_category":"resin"}]}