{"word":"Messianize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"メシア（救世主）として扱う、メシア（救世主）のように祭り上げる","english_definition":"To treat or regard someone or something as a messiah (savior or liberator).","examples":[{"sentence":"The media tended to Messianize the new CEO, expecting him to solve all the company's problems.","translation":"メディアは新しいCEOをメシアのように祭り上げ、彼が会社のすべての問題を解決することを期待する傾向があった。"},{"sentence":"Some political movements Messianize their leaders, attributing almost divine qualities to them.","translation":"一部の政治運動は指導者をメシアのように扱い、ほとんど神聖な資質を彼らに帰する。"}],"collocations":["Messianize a leader (指導者をメシア化する)","Messianize a policy (政策をメシア化する)","Messianize a figure (人物をメシア化する)"],"synonyms":["idolize","deify","lionize","glorify","venerate"],"antonyms":["criticize","vilify","demonize"]},{"part_of_speech":"verb","transitivity":"vt","definition":"メシア主義的に解釈する、メシア的意味合いを付与する","english_definition":"To interpret something in a messianic way; to imbue with messianic significance.","examples":[{"sentence":"The author Messianized the protagonist's journey, portraying it as a path to redemption for all mankind.","translation":"著者（作者）は主人公の旅をメシア主義的に解釈し、それを全人類の救済への道として描いた。"},{"sentence":"Some scholars Messianize certain historical events, seeing them as precursors to a future utopian age.","translation":"一部の学者は特定の歴史的出来事をメシア主義的に解釈し、それらを将来の理想郷時代の先駆けと見なす。"}],"collocations":["Messianize a historical event (歴史的出来事をメシア化する)","Messianize a text (テキストをメシア化する)","Messianize a concept (概念をメシア化する)"],"synonyms":["spiritualize","idealize","sanctify","mystify"],"antonyms":["secularize","desacralize"]}],"etymology":{"value":"From 'Messiah' (Hebrew for 'anointed one') + '-ize' (a suffix indicating to make or treat as).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛsiəˌnaɪz/","syllables":"Mes-si-a-nize"},"inflection":{"verb_forms":{"present_simple":["Messianize","Messianizes"],"past_simple":"Messianized","past_participle":"Messianized","present_participle":"Messianizing"}},"usage_notes":{"explanation":"'Messianize' is a relatively uncommon word that describes the act of treating someone or something as a messiah, either literally or figuratively. It often implies an exaggerated or unrealistic expectation of salvation or liberation from a particular person, idea, or movement. It can also refer to the act of interpreting something in a messianic or overly idealistic way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are trying to messianize the situation.","correct":"✓ They are trying to improve the situation.","note":"'Messianize' is a specific term, not a general synonym for 'improve' or 'fix'. Use it only when referring to treating something as a messiah-like solution."},{"incorrect":"✗ The messianized leader was eventually criticized.","correct":"✓ The idolized leader was eventually criticized.","note":"If the leader was merely highly praised, 'idolized' or 'lionized' might be more appropriate than 'messianized', which implies a deeper, almost religious, level of reverence."}],"priority":"★★☆"},"related_words":{"derivatives":["Messiah (noun)","Messianic (adjective)","Messianism (noun)"],"phrases":["Messianic complex (メシアコンプレックス)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Messianize' is a sophisticated term used to describe the act of treating someone or something as a messiah, often with exaggerated expectations. It's not a commonly used word, so it's important to understand its specific meaning and context before using it. It is most often used in political, religious, or social commentary."},"example_sentences":[{"sentence":"Critics argued that the campaign Messianized the candidate, promising unrealistic solutions to complex problems.","translation":"批評家たちは、そのキャンペーンは候補者をメシアのように祭り上げ、複雑な問題に対して非現実的な解決策を約束していると主張した。","type":"verb (vt)","meaning_category":"メシアとして扱う"},{"sentence":"The film Messianizes the protagonist's struggle, portraying it as a heroic battle against evil.","translation":"その映画は主人公の苦闘をメシア主義的に解釈し、それを悪に対する英雄的な戦いとして描いている。","type":"verb (vt)","meaning_category":"メシア的意味合いを付与する"}]}