{"word":"verbalizzazione","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(イタリア語) 言語化、言葉による表現、口頭での説明","english_definition":"(Italian) Verbalization; the act of expressing something in words, either spoken or written. It can also refer to the process of giving a verbal account or explanation.","examples":[{"sentence":"La verbalizzazione dei sentimenti è importante per la salute mentale.","translation":"Expressing feelings in words is important for mental health.","note":"(Example showing the importance of expressing feelings verbally)"},{"sentence":"Il poliziotto ha proceduto alla verbalizzazione dell'incidente.","translation":"The police officer proceeded with the verbal recording of the accident.","note":"(Example in a legal context, referring to a written record of a verbal account)"},{"sentence":"La verbalizzazione del processo decisionale aiuta a chiarire le idee.","translation":"Verbalizing the decision-making process helps to clarify ideas.","note":"(Example in a business or personal development context)"}],"collocations":["verbalizzazione dei sentimenti (verbalization of feelings)","verbalizzazione di un processo (verbalization of a process)","procedere alla verbalizzazione (to proceed with the verbalization)"],"synonyms":["espressione verbale (verbal expression)","descrizione a parole (description in words)","narrazione orale (oral narration)","esposizione verbale (verbal exposition)"],"antonyms":["silenzio (silence)","omissione (omission)"],"related_terms":["verbo (verb)","verbale (verbal; written record)","verbalizzare (to verbalize)"]}],"etymology":{"value":"Derived from the Italian verb 'verbalizzare,' which means 'to verbalize.' The suffix '-zione' is added to form a noun indicating the action or process of verbalizing.","priority":"N/A"},"pronunciation":{"ipa":"/verbaliddzatˈtsjone/","syllables":"ver-ba-liz-za-zio-ne"},"inflection":{"notes":"Feminine singular noun. Plural form is 'verbalizzazioni'."},"usage_notes":{"explanation":"'Verbalizzazione' refers to the act of putting thoughts, feelings, or events into words. It can be used in a variety of contexts, including psychology, law, and general communication. The term often implies a conscious effort to articulate something that might otherwise remain unexpressed or unclear. In legal contexts, it can specifically refer to the creation of a written record of a spoken statement.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Using 'verbalizzazione' when a simpler word like 'expression' or 'description' would suffice in English.","correct":"Choosing the most appropriate word for the context.","note":"'Verbalizzazione' is a more formal and specific term than general words like 'expression.'"}],"priority":"N/A"},"related_words":{"derivatives":["verbalizzare (to verbalize)","verbale (verbal; written record)"],"related_concepts":["comunicazione (communication)","linguaggio (language)","psicologia (psychology)","diritto (law)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency in Italian texts, particularly in academic and professional contexts.","priority":"N/A"},"readability_explanation":{"level":"C1-C2","text":"'Verbalizzazione' is a relatively formal term used to describe the process of expressing something in words. It's commonly found in academic, legal, and psychological contexts. Understanding this word requires a good command of Italian vocabulary and an awareness of its specific connotations related to articulation and formal recording of information."},"example_sentences":[{"sentence":"La verbalizzazione delle emozioni è un passo importante nella terapia.","translation":"The verbalization of emotions is an important step in therapy.","type":"general","meaning_category":"expressing emotions"},{"sentence":"È necessaria la verbalizzazione di tutti i punti dell'accordo.","translation":"The verbal recording of all points of the agreement is necessary.","type":"legal","meaning_category":"legal recording"},{"sentence":"La verbalizzazione del problema ha aiutato a trovare una soluzione.","translation":"Verbalizing the problem helped to find a solution.","type":"general","meaning_category":"problem-solving"}]}