{"word":"midparental","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"両親の中間の、両親の平均の","english_definition":"Relating to the average of the parental values; pertaining to the mean of the parental measurements.","examples":[{"sentence":"The child's height was close to the midparental height, suggesting a strong genetic influence.","translation":"その子供の身長は、両親の中間身長に近く、遺伝的影響が強いことを示唆していた。"},{"sentence":"Midparental height is often used to predict a child's potential adult height.","translation":"両親の中間身長は、子供の潜在的な成人身長を予測するためによく用いられる。"}],"collocations":["midparental height (両親の中間身長)","midparental value (両親の中間値)"],"synonyms":["average parental","mean parental"],"antonyms":[]}],"etymology":{"value":"'Mid-' (middle) + 'parental' (relating to parents).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪd.pəˈrɛn.təl/","syllables":"mid-pa-ren-tal"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Midparental' is a term primarily used in genetics and pediatrics to describe a value that represents the average of a child's parents' values for a specific trait, such as height. It's often used as a reference point when assessing a child's development and predicting their potential adult characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child's height was mid-parental.","correct":"✓ The child's height was close to the midparental height.","note":"It's more common to specify what is being measured (e.g., midparental height) rather than simply saying something is 'midparental'."}],"priority":"★★☆"},"related_words":{"derivatives":["parental (adjective: relating to parents)","midchild (noun: a child of middle height)"],"related_terms":["heritability (遺伝率)","regression to the mean (平均への回帰)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Midparental' is a technical term used in genetics and medicine. It refers to the average value of a particular trait (like height) between a child's parents. This value is often used as a benchmark to compare against the child's actual value and assess potential genetic influences. Understanding this term requires some familiarity with scientific concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The pediatrician calculated the child's midparental height to assess their growth trajectory.","translation":"小児科医は、子供の成長軌道を評価するために、その子供の両親の中間身長を計算した。","type":"example","meaning_category":"General"},{"sentence":"The study found a strong correlation between midparental BMI and the child's BMI.","translation":"その研究では、両親の中間BMIと子供のBMIとの間に強い相関関係があることが判明した。","type":"example","meaning_category":"Genetics"}]}