{"word":"Ommatitidia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"個眼 (こがん): 昆虫や甲殻類などの複眼を構成する個々の視覚ユニット。","english_definition":"The individual visual units that make up the compound eye of insects, crustaceans, and other arthropods.","examples":[{"sentence":"Each ommatidium in a dragonfly's eye provides a small portion of the overall image.","translation":"トンボの目の個々の個眼は、全体像の小さな部分を提供します。"},{"sentence":"The number of ommatitidia in an insect's eye can vary depending on the species.","translation":"昆虫の眼の個眼の数は、種によって異なります。"}],"collocations":["number of ommatitidia (個眼の数)","compound eye (複眼)","visual unit (視覚ユニット)"],"synonyms":["eye facet","visual receptor"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'omma' (eye) and 'idion' (a diminutive suffix), combined with the plural ending '-a'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒmətɪˈtɪdiə/","syllables":"om-ma-ti-ti-di-a"},"inflection":{"noun_plural":"ommatitidia (already plural)"},"usage_notes":{"explanation":"'Ommatitidia' is a technical term used in biology and zoology to describe the individual units of a compound eye. It is usually discussed in the context of insect vision or the anatomy of arthropods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ommatitidium are arranged in a hexagonal pattern.","correct":"✓ The ommatitidia are arranged in a hexagonal pattern.","note":"'Ommatitidia' is already the plural form; 'ommatitidium' is the singular."}],"priority":"★★☆"},"related_words":{"derivatives":["ommatidium (singular form)","compound eye"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A specialized term used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ommatitidia' is a scientific term referring to the individual units that make up a compound eye, found in insects and crustaceans. Understanding this word requires knowledge of biology and zoology, specifically related to the anatomy and vision of arthropods. It is not a commonly used word outside of scientific or academic contexts."},"example_sentences":[{"sentence":"The high resolution of a dragonfly's vision is due to the large number of ommatitidia in its compound eyes.","translation":"トンボの視覚の高解像度は、その複眼内の多数の個眼によるものです。","type":"noun","meaning_category":"structure"},{"sentence":"Each ommatidium contains photoreceptor cells that detect light.","translation":"各個眼には、光を検出する光受容体細胞が含まれています。","type":"noun","meaning_category":"function"}]}