{"word":"feverbush","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(アメリカ)ダンコウバイ (Lindera benzoin)","english_definition":"A shrub (Lindera benzoin) native to eastern North America, having aromatic bark and leaves, and yellowish flowers that appear before the leaves in spring.","examples":[{"sentence":"The feverbush is common in the understory of eastern deciduous forests.","translation":"ダンコウバイは東部の落葉樹林の下生えによく見られる。"}],"collocations":["feverbush tea","feverbush leaves","feverbush extract"],"synonyms":["spicebush","wild allspice","Benjamin bush"],"antonyms":[]}],"etymology":{"value":"Derived from the historical use of the plant's bark and leaves in traditional medicine to treat fevers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfiːvərˌbʊʃ/","syllables":"fee-ver-bush"},"inflection":{"noun_plural":"feverbushes"},"usage_notes":{"explanation":"Feverbush is primarily used to refer to Lindera benzoin, a specific species of shrub. It's known for its aromatic qualities and historical medicinal use. The name reflects its traditional application in reducing fevers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw many feverbush in the desert.","correct":"✓ I saw many feverbush in the forest.","note":"Feverbush is native to moist woodlands and forests, not deserts."}],"priority":"★★☆"},"related_words":{"derivatives":["Lindera benzoin (scientific name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'feverbush' refers to a specific plant species (Lindera benzoin) and is not commonly used outside of botanical or historical contexts. Understanding requires familiarity with plant nomenclature and traditional medicinal practices."},"example_sentences":[{"sentence":"Native Americans used feverbush to make a tea for treating colds.","translation":"ネイティブアメリカンはダンコウバイを使って風邪を治療するための茶を作った。","type":"noun","meaning_category":"plant"},{"sentence":"The small yellow flowers of the feverbush are one of the first signs of spring in the forest.","translation":"ダンコウバイの小さな黄色い花は、森の中で春の兆候の一つだ。","type":"noun","meaning_category":"plant"}]}