{"word":"Struldbruggism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) ストラルドブラッグの苦境、不死の呪い、終わりのない生に伴う苦悩","english_definition":"(rare) The plight of the Struldbruggs; the curse of immortality; the misery associated with endless life.","examples":[{"sentence":"The novel explores the themes of mortality and the horrors of Struldbruggism.","translation":"その小説は、死すべき運命とストラルドブラッグイズムの恐怖というテーマを探求している。"},{"sentence":"He argued that immortality, far from being a blessing, would ultimately lead to Struldbruggism.","translation":"彼は、不死は祝福どころか、最終的にはストラルドブラッグイズムにつながると主張した。"}],"collocations":["the horrors of Struldbruggism","the curse of Struldbruggism","avoid Struldbruggism"],"synonyms":["immortality's curse","endless suffering","the burden of immortality"],"antonyms":["mortality","ephemerality"]}],"etymology":{"value":"ジョナサン・スウィフトの小説『ガリヴァー旅行記』に登場する、不死の種族「ストラルドブラッグ」に由来する。ストラルドブラッグは不死だが、永遠に若さを保つわけではなく、老いと衰えに苦しみ続ける。そのため、不死は祝福ではなく、むしろ呪いであるという概念を表す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈstrʌldbrʌˌɡɪzəm/","syllables":"Struld-brug-gism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**Struldbruggism**」は非常に特殊な単語で、一般的には使われません。文学、哲学、倫理学などの分野で、不死の問題や、不死が必ずしも望ましいものではないという考え方を議論する際に用いられることがあります。ガリヴァー旅行記を読んだことがない人には意味が通じにくい単語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from Struldbruggism and became younger every year.","correct":"✓ He suffered from Struldbruggism and endured the miseries of eternal old age.","note":"ストラルドブラッグは不死ですが、若返るわけではありません。老いと衰えに苦しみ続けます。"},{"incorrect":"✗ Struldbruggism is a blessing that everyone desires.","correct":"✓ Struldbruggism is a curse that nobody would truly want.","note":"ストラルドブラッグイズムは、不死の苦悩を表す言葉であり、祝福とは対照的な概念です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Struldbrugg (名詞: ストラルドブラッグ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency) - 一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Struldbruggism**」は、ジョナサン・スウィフトの『ガリヴァー旅行記』に登場する「ストラルドブラッグ」という不死の種族に由来する、非常に特殊な単語です。この単語は、不死が必ずしも祝福ではなく、むしろ終わりのない老いと苦しみをもたらす呪いであるという概念を表します。文学、哲学、倫理学などの高度な議論において、不死の倫理的な問題や、人間の死すべき運命の価値を考察する際に用いられることがあります。一般的な会話で使われることはほとんどありません。"},"example_sentences":[{"sentence":"The philosophical debate centered on whether the potential benefits of immortality outweighed the risks of **Struldbruggism**.","translation":"その哲学的議論は、不死の潜在的な利点が、ストラルドブラッグイズムのリスクを上回るかどうかを中心に展開された。","type":"noun","meaning_category":"不死の苦悩"},{"sentence":"The author used the concept of **Struldbruggism** to critique the human desire for eternal life.","translation":"著者は、ストラルドブラッグイズムの概念を用いて、人間の永遠の命への欲求を批判した。","type":"noun","meaning_category":"不死の苦悩"},{"sentence":"The film explored the psychological toll of **Struldbruggism**, portraying the protagonist's growing despair.","translation":"その映画は、ストラルドブラッグイズムの心理的な負担を探求し、主人公の増大する絶望を描いた。","type":"noun","meaning_category":"不死の苦悩"}]}