{"word":"cephalodia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)地衣類において、藻類細胞を含む特殊な構造。地衣体の表面または内部に形成され、窒素固定を行うシアノバクテリアなどの光合成生物を収容する。","english_definition":"(botany) Specialized structures in lichens containing algal cells. They are formed on the surface or within the thallus of the lichen and house photosynthetic organisms such as cyanobacteria that perform nitrogen fixation.","examples":[{"sentence":"The lichen species *Lobaria pulmonaria* has prominent cephalodia on its surface.","translation":"地衣類の種である *Lobaria pulmonaria* は、その表面に顕著なセファロディアを持つ。"},{"sentence":"Cephalodia contribute significantly to the nitrogen budget of some lichen ecosystems.","translation":"セファロディアは、一部の地衣類生態系の窒素収支に大きく貢献する。"}],"collocations":["lichen cephalodia","internal cephalodia","surface cephalodia","nitrogen fixation in cephalodia"],"synonyms":["gall","lichen gall"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'kephalē' (頭) + '-ōdēs' (～のような)に由来。藻類細胞の塊が地衣類の「頭」のように見えることから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛfəˈloʊdiə/","syllables":"ce-pha-lo-di-a"},"inflection":{"noun_plural":"cephalodia"},"usage_notes":{"explanation":"Cephalodia are distinct from the main photosynthetic partner (photobiont) of the lichen. They often contain different species of algae or cyanobacteria, particularly nitrogen-fixing cyanobacteria. The presence and characteristics of cephalodia are important taxonomic features for identifying certain lichen species. They can be external (on the surface) or internal (embedded within the lichen thallus).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ cephalodium (単数形として使用)","correct":"✓ cephalodium (単数形), cephalodia (複数形)","note":"'cephalodium' は単数形であり、複数形は 'cephalodia' である。"},{"incorrect":"✗ cephalodia are the main photosynthetic partner of the lichen","correct":"✓ cephalodia are specialized structures containing a different photosynthetic partner than the main one in the lichen.","note":"Cephalodia は地衣類の主要な光合成パートナーではなく、通常は窒素固定を行うシアノバクテリアを含む特殊な構造である。"}],"priority":"★★☆"},"related_words":{"derivatives":["cephalodium (単数形)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cephalodia' is a technical term used in lichenology to describe specialized structures found in certain lichens. These structures contain algal cells, often cyanobacteria, that are different from the main photosynthetic partner (photobiont) of the lichen. They play a crucial role in nitrogen fixation, contributing to the lichen's nutrient acquisition. The presence and characteristics of cephalodia are important for lichen identification and ecological studies. Understanding this term requires a background in botany or lichenology."},"example_sentences":[{"sentence":"The presence of **cephalodia** in *Lobaria pulmonaria* indicates its ability to fix atmospheric nitrogen.","translation":"*Lobaria pulmonaria* における **セファロディア** の存在は、大気中の窒素を固定する能力を示している。","type":"noun","meaning_category":"植物学"},{"sentence":"Researchers analyzed the cyanobacterial composition within the **cephalodia** of various lichen species.","translation":"研究者たちは、さまざまな地衣類種の **セファロディア** 内のシアノバクテリアの組成を分析した。","type":"noun","meaning_category":"植物学"}]}