{"word":"Subcrust","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The layer of the Earth below the crust.","english_definition":"The layer of the Earth immediately below the crust.","examples":[{"sentence":"The subcrust is composed of the upper mantle.","translation":"サブクラストは上部マントルで構成されています。"}],"collocations":[],"synonyms":["upper mantle"],"antonyms":["crust"]},{"part_of_speech":"noun","definition":"A layer beneath a crust, such as in geology or baking.","english_definition":"A layer or structure lying immediately beneath a crust, as in geological formations or baked goods.","examples":[{"sentence":"The geologist examined the subcrust layers for mineral deposits.","translation":"地質学者は鉱物堆積物のためにサブクラスト層を調べました。"},{"sentence":"The baker added a layer of jam to the subcrust before adding the final crust.","translation":"パン職人は最後のクラストを加える前に、サブクラストにジャムの層を加えました。"}],"collocations":[],"synonyms":["underlayer","substratum"],"antonyms":["crust"]}],"etymology":{"value":"Formed by combining the prefix 'sub-' (meaning 'under' or 'below') with the noun 'crust'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌbˌkrʌst/","syllables":"sub-crust"},"inflection":{"noun_plural":"subcrusts"},"usage_notes":{"explanation":"'Subcrust' is used to describe a layer directly beneath a crust, whether in the context of geology (referring to the upper mantle beneath the Earth's crust) or in other contexts where a layered structure exists. It is relatively uncommon in everyday language and is more frequently used in technical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The subcrust is the same as the core.","correct":"The subcrust is below the crust and above the mantle.","note":"The subcrust is not the same as the core; it is the layer immediately beneath the crust, typically referring to the upper part of the mantle."}],"priority":"★★☆"},"related_words":{"derivatives":["subcrustal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subcrust' is a technical term primarily used in geology to describe the layer directly beneath the Earth's crust, which is the upper part of the mantle. It can also be used in other contexts to refer to a layer or structure immediately beneath a crust or outer layer. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding the prefix 'sub-' (meaning 'below') helps in grasping the word's meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The seismic waves revealed details about the composition of the subcrust.","translation":"地震波はサブクラストの組成に関する詳細を明らかにしました。","type":"scientific","meaning_category":"geology"},{"sentence":"The pastry chef carefully prepared the shortbread subcrust before adding the fruit filling.","translation":"パティシエはフルーツの詰め物を加える前に、ショートブレッドのサブクラストを注意深く準備しました。","type":"culinary","meaning_category":"baking"}]}