{"word":"ovo-viviparous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"卵胎生の","english_definition":"producing young by means of eggs which are hatched within the body of the parent.","examples":[{"sentence":"Sharks are sometimes ovo-viviparous.","translation":"サメは時に卵胎生である。"},{"sentence":"The seahorse is an ovo-viviparous fish.","translation":"タツノオトシゴは卵胎生の魚である。"}],"collocations":["ovo-viviparous animal","ovo-viviparous fish","ovo-viviparous reptile"],"synonyms":["ovoviviparous"],"antonyms":["oviparous","viviparous"]}],"etymology":{"value":"Derived from the Latin words \"ovum\" (egg), \"vivi-\" (living), and \"parous\" (bearing).","priority":"★★★"},"pronunciation":{"ipa":"ˌoʊvoʊvɪˈvɪpərəs","syllables":"o-vo-vi-vip-a-rous"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"Ovo-viviparity is a reproductive strategy where embryos develop inside eggs that remain within the mother's body until they are ready to hatch. The developing young are nourished by the egg yolk, not directly by the mother, distinguishing it from viviparity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is ovo-viviparous, so it lays eggs.","correct":"✓ The animal is ovo-viviparous, so it gives birth to live young after the eggs hatch inside.","note":"Ovo-viviparous animals do not lay eggs; the eggs hatch inside the mother's body."}],"priority":"★★☆"},"related_words":{"derivatives":["ovoviviparity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ovo-viviparous' describes a specific reproductive method in animals. In ovo-viviparous animals, the eggs develop inside the mother's body, and the young hatch from the eggs inside the mother. They are then born live. The developing embryos are nourished by the egg yolk, not directly by the mother. This is different from viviparous animals, where the young are nourished directly by the mother, and oviparous animals, which lay eggs that hatch outside the mother's body."},"example_sentences":[{"sentence":"Some species of snakes are ovo-viviparous, meaning the eggs hatch inside the mother.","translation":"ヘビの一部の種は卵胎生であり、これは卵が母親の体内で孵化することを意味する。","type":"general","meaning_category":"general"},{"sentence":"Ovo-viviparous animals provide a degree of protection to the developing embryos.","translation":"卵胎生の動物は、発達中の胚にある程度の保護を提供する。","type":"general","meaning_category":"general"}]}