{"word":"square-drill","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(工具) 角穴ドリル、角軸ドリル","english_definition":"A type of drill bit designed to create square or rectangular holes. It typically uses a combination of drilling and chiseling action to achieve the desired shape.","examples":[{"sentence":"He used a square-drill to make a perfectly square hole in the wood.","translation":"彼は角穴ドリルを使って木材に完璧な正方形の穴を開けた。"},{"sentence":"Square-drills are often used in woodworking and metalworking for specific applications.","translation":"角穴ドリルは、特定の用途のために木工や金属加工でよく使用される。"}],"collocations":["use a square-drill","square-drill bit","set of square-drills"],"synonyms":["mortise chisel","corner chisel"],"antonyms":[]}],"etymology":{"value":"The term 'square-drill' is a compound word combining 'square,' referring to the shape of the hole it creates, and 'drill,' indicating its function as a drilling tool.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈskwɛərˌdrɪl/","syllables":"square-drill"},"inflection":{"noun_plural":"square-drills"},"usage_notes":{"explanation":"A 'square-drill' is a specialized tool, not as commonly used as standard drill bits. It's primarily employed when a precisely square or rectangular hole is required, often in woodworking for mortise and tenon joints or in metalworking for specific fitting purposes.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a square drill bit to make a round hole.","correct":"✓ I used a round drill bit to make a round hole. / ✓ I used a square-drill to make a square hole.","note":"Square-drills are for square holes, round drill bits are for round holes."}],"priority":"☆☆☆"},"related_words":{"derivatives":["square (noun, adjective, verb)","drill (noun, verb)"],"related_tools":["drill press","mortiser","chisel"],"priority":"☆☆☆"},"level_frequency":{"level":"Technical/Specialized","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'square-drill' refers to a specialized tool used to create square or rectangular holes. It is not a common household tool and is primarily used in woodworking and metalworking. Understanding its function requires some familiarity with these trades."},"example_sentences":[{"sentence":"The craftsman carefully positioned the square-drill before starting the mortise.","translation":"職人はほぞ穴を始める前に、慎重に角穴ドリルの位置を定めた。","type":"noun","meaning_category":"tool"},{"sentence":"For this project, a square-drill is essential to ensure the joints fit perfectly.","translation":"このプロジェクトでは、接合部が完全に適合するように角穴ドリルが不可欠だ。","type":"noun","meaning_category":"tool"}]}