{"word":"overforcing","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(力や努力を)過剰に加える、無理強いする、酷使する","english_definition":"To apply excessive force or effort; to push or strain something or someone beyond reasonable limits.","examples":[{"sentence":"The coach warned the player against overforcing his injured knee.","translation":"コーチは選手に、怪我をした膝を酷使しないように警告した。"},{"sentence":"By overforcing the engine, you risk causing serious damage.","translation":"エンジンを酷使すると、重大な損傷を引き起こす危険性がある。"},{"sentence":"She was overforcing her voice, which led to vocal strain.","translation":"彼女は声を無理に出していたため、声帯を痛めた。"}],"collocations":["overforcing a muscle (筋肉を酷使する)","overforcing an engine (エンジンを酷使する)","overforcing one's voice (声を無理に出す)","overforcing the issue (問題を無理強いする)"],"synonyms":["straining","exerting","overstraining","pushing too hard","forcing"],"antonyms":["underutilizing","underusing","easing up","relaxing","releasing"]},{"part_of_speech":"noun","definition":"過剰な力や努力の行使、無理強い、酷使","english_definition":"The act of applying excessive force or effort; pushing or straining something or someone beyond reasonable limits.","examples":[{"sentence":"Overforcing during exercise can lead to injuries.","translation":"運動中に無理をすると怪我につながることがある。"},{"sentence":"The mechanic attributed the engine failure to overforcing.","translation":"整備士は、エンジン故障の原因を酷使によるものとした。"},{"sentence":"Avoid overforcing when tightening screws to prevent stripping the threads.","translation":"ネジを締めるときは、ねじ山を潰さないように無理な力を加えないようにしてください。"}],"collocations":["avoid overforcing (無理な力を加えないようにする)","due to overforcing (酷使が原因で)","result of overforcing (酷使の結果)"],"synonyms":["excessive strain","overexertion","overuse","undue pressure","undue stress"],"antonyms":["underutilization","underuse","relaxation","release"]}],"etymology":{"value":"Derived from the verb 'force' with the prefix 'over-,' indicating excess or going beyond a limit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈfɔːrsɪŋ/","syllables":"o-ver-forc-ing"},"inflection":{"verb_forms":{"present_simple":["overforce","overforces"],"past_simple":"overforced","past_participle":"overforced","present_participle":"overforcing"},"noun_plural":"overforcings (rare)"},"usage_notes":{"explanation":"'Overforcing' generally implies applying more force or effort than necessary or advisable, often leading to negative consequences such as injury, damage, or failure. It can apply to physical actions (like straining a muscle) or to more abstract situations (like pushing an argument too strongly).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is overforcing to lift the weight.","correct":"✓ He is overforcing himself to lift the weight. / ✓ He is overforcing when lifting the weight.","note":"When describing someone exerting themselves, it's often necessary to include 'himself/herself' or a gerund phrase to clarify the action. Alternatively, you can say 'He is forcing himself too much'."},{"incorrect":"✗ The overforcing of the machine caused it to break.","correct":"✓ Overforcing the machine caused it to break.","note":"While 'overforcing' can be used as a noun, it's often more natural to use it as a gerund ('overforcing the machine') to describe the action directly."}],"priority":"★★☆"},"related_words":{"derivatives":["force","forceful","forcing","overforce"],"phrasal_verbs":["N/A"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overforcing' describes using too much effort or strength, often leading to harm or damage. It's used in situations where someone is pushing too hard, either physically or metaphorically. For example, a weightlifter might overforce a lift, leading to injury, or a salesperson might overforce a sale, alienating a customer. It is not a common word, but it is useful in specific contexts where excessive force is a concern."},"example_sentences":[{"sentence":"The athlete injured his shoulder by overforcing his throws.","translation":"その運動選手は、投球を無理に続けたために肩を痛めた。","type":"verb","meaning_category":"酷使する"},{"sentence":"Overforcing the argument will only make people resistant to your ideas.","translation":"その議論を無理強いしても、人々にあなたの考えに抵抗されるだけだ。","type":"verb","meaning_category":"無理強いする"},{"sentence":"The engineer warned against overforcing the bolts during assembly.","translation":"エンジニアは、組み立て中にボルトを締めすぎないように警告した。","type":"verb","meaning_category":"酷使する"},{"sentence":"The damage was a direct result of overforcing the machinery.","translation":"その損傷は、機械を酷使した直接的な結果だった。","type":"noun","meaning_category":"酷使"},{"sentence":"Avoid overforcing when using power tools to prevent accidents.","translation":"電動工具を使用する際は、事故を防ぐために無理な力を加えないようにしてください。","type":"verb","meaning_category":"酷使する"}]}