{"word":"Siculo-Arabian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"シチリア・アラビア語の、またはシチリア・アラビア文化の","english_definition":"Relating to the Siculo-Arabic language or culture.","examples":[{"sentence":"Siculo-Arabian architecture is evident in some parts of Sicily.","translation":"シチリア・アラビア建築はシチリアの一部の地域で見られる。"}],"collocations":[],"synonyms":["Sicilian-Arabic"],"antonyms":[]},{"part_of_speech":"noun","definition":"シチリア・アラビア語","english_definition":"The extinct Arabic dialect that was spoken in Sicily and Malta between the ninth and thirteenth centuries.","examples":[{"sentence":"Siculo-Arabian is the ancestor of the Maltese language.","translation":"シチリア・アラビア語はマルタ語の祖先である。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed from 'Siculo-' (relating to Sicily) and 'Arabian' (relating to Arabia or Arabic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪkjʊloʊ əˈreɪbiən/","syllables":"Si-cu-lo-A-ra-bi-an"},"inflection":{},"usage_notes":{"explanation":"'Siculo-Arabian' refers to the historical language and culture that developed in Sicily during the period of Arab rule. It is particularly significant because this language is considered the ancestor of modern Maltese.","priority":"★★☆"},"common_mistakes":{},"related_words":["Maltese language","Arabic","Sicily","Siculo-Norman"],"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Siculo-Arabian' is specialized and typically encountered in historical or linguistic contexts. It refers to a specific period and cultural interaction in Sicily. Understanding requires knowledge of historical linguistics and the history of Sicily and the Arab world."},"example_sentences":[{"sentence":"The influence of Siculo-Arabian can still be seen in the vocabulary of modern Sicilian.","translation":"シチリア・アラビア語の影響は、現代シチリア語の語彙に今でも見られる。","type":"adjective","meaning_category":"シチリア・アラビア語の"},{"sentence":"The study of Siculo-Arabian provides insights into the linguistic landscape of medieval Sicily.","translation":"シチリア・アラビア語の研究は、中世シチリアの言語状況への洞察を提供する。","type":"noun","meaning_category":"シチリア・アラビア語"}]}