{"word":"Ostensibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"明示性、見せかけ、表向き","english_definition":"The quality of being ostensible; the state of being presented or appearing in a certain way, often superficially or for appearance's sake.","examples":[{"sentence":"The ostensibility of his wealth was merely a facade to hide his financial troubles.","translation":"彼の富の明示性は、単に彼の財政難を隠すための見せかけだった。"},{"sentence":"The ostensibility of their concern for the environment was undermined by their continued pollution.","translation":"彼らの環境への配慮の表向きは、継続的な汚染によって損なわれた。"}],"collocations":["ostensibility of purpose","ostensibility of concern","ostensibility of wealth","ostensibility of power"],"synonyms":["appearance","semblance","pretense","show","outward show","facade"],"antonyms":["reality","genuineness","sincerity","authenticity"]}],"etymology":{"value":"Derived from 'ostensible,' which comes from Late Latin 'ostensibilis,' from Latin 'ostendere' meaning 'to show, display.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒstɛnsɪˈbɪlɪti/","syllables":"os-ten-si-bil-i-ty"},"inflection":{"noun_plural":"ostensibilities"},"usage_notes":{"explanation":"'Ostensibility' refers to the quality of something being presented in a particular way, often to create a certain impression. It suggests that what is being shown or claimed may not be entirely genuine or truthful, but rather a superficial display. It is often used to describe situations where appearances are deceiving or where there is a discrepancy between what is presented and what is actually the case.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ostensibility of the building was very modern.","correct":"✓ The appearance of the building was very modern.","note":"'Ostensibility' refers to the quality of being ostensible. Use 'appearance' to describe the look of something."},{"incorrect":"✗ He showed great ostensibility.","correct":"✓ He showed great pretense.","note":"'Ostensibility' is a quality, not an action. Use 'pretense' to describe showing something superficially."}],"priority":"★★☆"},"related_words":{"derivatives":["ostensible (adjective)","ostensibly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ostensibility' is a sophisticated term indicating the quality of being presented in a certain way, often superficially or for appearance's sake. It is typically used in formal or academic contexts to describe situations where there is a discrepancy between what is shown and what is real. The word suggests a degree of insincerity or deception, as the outward display may not accurately reflect the underlying truth or reality. Understanding this term requires a nuanced grasp of language and the ability to discern subtle differences in meaning."},"example_sentences":[{"sentence":"The ostensibility of the company's commitment to diversity was questioned after the lack of minority representation in leadership positions became apparent.","translation":"幹部職における少数派の代表の欠如が明らかになった後、その企業の多様性へのコミットメントの明示性は疑問視された。","type":"noun","meaning_category":"appearance"},{"sentence":"The ostensibility of the politician's concern for the poor was seen as a cynical attempt to gain votes.","translation":"貧困層に対する政治家の関心の表向きは、票を獲得するための皮肉な試みと見なされた。","type":"noun","meaning_category":"pretense"}]}