{"word":"swinger","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(文字通り)揺れる人、揺らす人、ブランコに乗る人","english_definition":"a person who swings something; a person who swings on a swing.","examples":[{"sentence":"The children were playing on the swings, and one little swinger was laughing gleefully.","translation":"子供たちはブランコで遊んでいて、一人の小さなブランコ乗りが楽しそうに笑っていた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)スウィンガー、夫婦交換をする人","english_definition":"(slang) a person who engages in recreational sexual activity with others, especially as part of a couple who exchange partners.","examples":[{"sentence":"They met other swingers at a party.","translation":"彼らはパーティーで他のスウィンガーに出会った。"},{"sentence":"The couple decided to explore the swinger lifestyle.","translation":"その夫婦はスウィンガーのライフスタイルを探求することにした。"}],"collocations":["swinger party","swinger lifestyle"],"synonyms":["partner swapper","key club member"],"antonyms":["monogamist"]},{"part_of_speech":"noun","definition":"(政治)浮動票を持つ人、日和見主義者","english_definition":"a person whose opinions or votes are not predictable and who may vote for either party in an election.","examples":[{"sentence":"The candidate needs to appeal to the swingers in order to win the election.","translation":"候補者は選挙に勝つために浮動票を持つ人々にアピールする必要がある。"}],"collocations":["swinger vote","swing voter"],"synonyms":["undecided voter","floating voter","independent voter"],"antonyms":["loyalist","partisan"]},{"part_of_speech":"noun","definition":"(ジャズ)スウィングする人、スウィング音楽を演奏する人","english_definition":"a person who plays swing music.","examples":[{"sentence":"He was a great swinger, playing the trumpet with passion.","translation":"彼は素晴らしいスウィンガーで、情熱的にトランペットを演奏していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Swinger' derives from the verb 'swing,' referring to the act of moving back and forth. The slang meaning related to partner swapping likely evolved from the idea of 'swinging' between different partners.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswɪŋər/","syllables":"swing-er"},"inflection":{"noun_plural":"swingers"},"usage_notes":{"explanation":"The word 'swinger' has multiple meanings, ranging from the literal sense of someone who swings to the slang term for someone who engages in partner swapping. The political meaning refers to undecided voters. Context is crucial to understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a swinger on the playground.","correct":"✓ He is swinging on the playground.","note":"Using 'swinger' to describe someone on a playground swing can be confusing due to the slang meaning. It's better to say 'He is swinging.'"},{"incorrect":"✗ She is a political swinger for the Republican party.","correct":"✓ She is a swing voter and might vote for the Republican party.","note":"A 'swinger' in politics is an undecided voter, not necessarily someone who always votes for one party."}],"priority":"★★☆"},"related_words":{"derivatives":["swing (verb, noun)","swinging (adjective)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (slang meaning)","frequency_google_ngram":"Relatively low frequency, except for the slang meaning which has increased in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Swinger' is a word with multiple meanings, and its interpretation depends heavily on context. The literal meaning refers to someone who swings, like on a playground swing. However, it's more commonly associated with its slang meaning, referring to someone who participates in partner swapping. It can also describe a swing voter, someone whose political allegiance is not fixed. Be mindful of the context to avoid misinterpretation, especially given the sensitive nature of the slang usage."},"example_sentences":[{"sentence":"The little girl was a happy **swinger** at the park.","translation":"その少女は公園で楽しそうにブランコに乗っていた。","type":"noun","meaning_category":"揺れる人"},{"sentence":"They attended a **swinger** party last weekend.","translation":"彼らは先週末にスウィンガーパーティーに参加した。","type":"noun","meaning_category":"夫婦交換をする人 (俗語)"},{"sentence":"The candidate is trying to win over **swingers** in the upcoming election.","translation":"候補者は次の選挙で浮動票獲得を目指している。","type":"noun","meaning_category":"浮動票を持つ人"},{"sentence":"As a **swinger**, he brought a unique energy to the jazz band.","translation":"スウィング音楽の演奏者として、彼はジャズバンドに独特のエネルギーをもたらした。","type":"noun","meaning_category":"スウィング音楽を演奏する人"}]}