{"word":"decompilation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"逆コンパイル、デコンパイル","english_definition":"The process of translating executable code (such as a compiled program) back into a human-readable source code format.","examples":[{"sentence":"Decompilation can be used to understand how a program works.","translation":"逆コンパイルは、プログラムがどのように動作するかを理解するために使用できます。"},{"sentence":"The decompilation of proprietary software is often legally restricted.","translation":"プロプライエタリソフトウェアの逆コンパイルは、多くの場合、法的に制限されています。"},{"sentence":"He used a decompiler to perform decompilation on the Java bytecode.","translation":"彼はJavaバイトコードに対して逆コンパイルを実行するためにデコンパイラを使用しました。"}],"collocations":["perform decompilation","software decompilation","reverse engineering","bytecode decompilation"],"synonyms":["reverse engineering","disassembly"],"antonyms":["compilation"],"related_terms":["decompiler","source code","bytecode","executable code","compiler"]}],"etymology":{"value":"Formed from 'de-' (reversal) + 'compilation'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːkɒmpaɪˈleɪʃən/","syllables":"de-com-pi-la-tion"},"inflection":{"noun_plural":"de compilations"},"usage_notes":{"explanation":"Decompilation is the process of converting compiled code (e.g., bytecode, machine code) back into a form that is more understandable to humans, typically resembling the original source code. This is the reverse of compilation, where source code is transformed into executable code. The result of decompilation is often not identical to the original source code due to information loss during compilation and optimization. Decompilation is a key technique in reverse engineering, software analysis, and security auditing. However, it can also be used for malicious purposes, such as circumventing copyright protection or finding vulnerabilities in software.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He decompiled the program's source code.","correct":"✓ He decompiled the program.","note":"Decompilation produces something resembling source code, but it is not the original source code. It is more accurate to say that he decompiled the program itself."},{"incorrect":"✗ Decompilation is the same as compilation.","correct":"✓ Decompilation is the reverse of compilation.","note":"Decompilation is the opposite of compilation."}],"priority":"★★☆"},"related_words":{"derivatives":["decompile (verb)","decompiler (noun)"],"related_concepts":["reverse engineering","disassembly","source code","compiler","bytecode","executable","obfuscation"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Decompilation' refers to the process of converting compiled code (like a program's executable file) back into a more human-readable form, resembling the original source code. It's the opposite of 'compilation,' which turns source code into machine-executable code. Decompilation is used for understanding how software works, reverse engineering, and security analysis. However, it's important to note that decompiling proprietary software may have legal restrictions. The tool used for decompilation is called a 'decompiler'."},"example_sentences":[{"sentence":"The security researcher used decompilation to analyze the malware.","translation":"セキュリティ研究者は、マルウェアを分析するために逆コンパイルを使用しました。","type":"general","meaning_category":"reverse engineering"},{"sentence":"Decompilation of the game's assets revealed hidden features.","translation":"ゲームのアセットを逆コンパイルしたところ、隠された機能が明らかになりました。","type":"technical","meaning_category":"software analysis"},{"sentence":"The legality of decompilation depends on the specific licensing agreement.","translation":"逆コンパイルの合法性は、特定のライセンス契約に依存します。","type":"legal","meaning_category":"legal aspects"}]}