{"word":"commoners","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"平民、庶民","english_definition":"Ordinary people who are not members of the aristocracy or royalty.","examples":[{"sentence":"The king mingled with the commoners during the festival.","translation":"王は祭りの間、平民たちと交流した。"},{"sentence":"The commoners were heavily taxed by the nobles.","translation":"平民たちは貴族によって重税を課せられた。"},{"sentence":"The revolution was led by commoners who demanded equality.","translation":"革命は平等を求める平民たちによって主導された。"}],"collocations":["the common people","ordinary citizens","working class","lower class","general public"],"synonyms":["plebeians","proletariat","the masses","rank and file"],"antonyms":["aristocracy","nobility","royalty","elite"]}],"etymology":{"value":"From the word 'common', referring to something shared by all or many. The suffix '-er' denotes a person belonging to or associated with that thing. Therefore, 'commoner' refers to someone who is part of the common populace, not of the privileged classes.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒmənərz/","syllables":"com-mon-ers"},"inflection":{"noun_plural":"commoners"},"usage_notes":{"explanation":"'Commoners' refers to people who do not belong to the aristocracy, nobility, or royalty. It is often used in historical contexts to describe the social hierarchy of societies where such distinctions existed. The term emphasizes the lack of privilege and power compared to the ruling classes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The commoners lived in a common house.","correct":"The commoners lived in simple houses.","note":"While 'common' can mean shared, in this context, it's better to use 'simple' to describe the houses of commoners, as 'common' might imply a shared dwelling rather than a typical one."},{"incorrect":"He was a commoner, so he had no rights.","correct":"He was a commoner, so he had fewer rights than the nobles.","note":"Commoners did have rights, though often fewer than the privileged classes. It's more accurate to say they had fewer rights rather than none."}],"priority":"★★☆"},"related_words":{"derivatives":["common","commonplace","commons"],"phrases":["the common good","common law","common sense"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understood in context.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'commoners' refers to ordinary people who are not part of the ruling class, such as royalty or nobility. It's often used when discussing historical societies with clear social hierarchies. Understanding this word helps in comprehending social structures and power dynamics in different periods of history."},"example_sentences":[{"sentence":"The French Revolution was largely driven by the grievances of the commoners.","translation":"フランス革命は主に平民たちの不満によって推進された。","type":"general"},{"sentence":"In medieval England, commoners worked the land and paid taxes to the lord of the manor.","translation":"中世イングランドでは、平民たちは土地を耕し、荘園領主に税金を納めた。","type":"historical"},{"sentence":"The gap between the wealthy elite and the commoners continues to widen in many countries.","translation":"富裕層のエリートと平民との格差は、多くの国で広がり続けている。","type":"contemporary"}]}