{"word":"tertiary-level","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"高等教育の、大学レベルの","english_definition":"relating to education at university or college level.","examples":[{"sentence":"Tertiary-level education is becoming increasingly important for career prospects.","translation":"高等教育は、キャリアの見通しにとってますます重要になっている。"},{"sentence":"The government is investing heavily in tertiary-level institutions.","translation":"政府は高等教育機関に多額の投資を行っている。"}],"collocations":["tertiary-level education","tertiary-level institution","tertiary-level student"],"synonyms":["higher education","post-secondary"],"antonyms":["primary-level","secondary-level"]}],"etymology":{"value":"'Tertiary' comes from the Latin 'tertiarius', meaning 'of the third rank'. In this context, it refers to the third level of education after primary and secondary education.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrʃəri ˈlɛvl/","syllables":"ter-tia-ry-lev-el"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Tertiary-level' is used to describe anything related to education beyond secondary school, typically referring to universities, colleges, and vocational schools. It is often used in formal contexts, such as academic papers, policy documents, and official reports.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tertiary level school.","correct":"✓ The tertiary-level school.","note":"'Tertiary-level' is a compound adjective and should be hyphenated when used before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["tertiary (adjective, noun)","level (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in academic or formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tertiary-level' is specific to educational contexts and is used to describe education beyond high school, typically at universities and colleges. It's more formal than simply saying 'college' or 'university' and is often used in official documents or academic discussions. Understanding this term is important for comprehending discussions about education policy and funding.","priority":"★★☆"},"example_sentences":[{"sentence":"Many students pursue tertiary-level qualifications to enhance their job opportunities.","translation":"多くの学生が、就職の機会を増やすために高等教育の資格を取得する。","type":"general","meaning_category":"general"},{"sentence":"The research was conducted at a tertiary-level medical facility.","translation":"その研究は、高等教育レベルの医療施設で行われた。","type":"specific","meaning_category":"specific"},{"sentence":"Access to tertiary-level education is not equal for all socioeconomic groups.","translation":"高等教育へのアクセスは、すべての社会経済的グループで平等ではない。","type":"societal","meaning_category":"societal"}]}