{"word":"Fictionised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"小説化された、脚色された、虚構化された","english_definition":"Having been made into a fictional story; adapted or presented in a fictional form.","examples":[{"sentence":"The events in his biography were heavily fictionised for the movie.","translation":"彼の伝記の出来事は、映画のために大幅に脚色された。"},{"sentence":"Her life story has been fictionised in a recent novel.","translation":"彼女の人生の物語は、最近の小説で虚構化されている。"}],"collocations":["heavily fictionised","largely fictionised","slightly fictionised","fictionised account","fictionised version","fictionised biography","fictionised history"],"synonyms":["fictionalized","adapted","dramatized","embellished","romanticized","imagined","invented"],"antonyms":["factual","accurate","authentic","nonfiction","truthful","documented","historical"]}],"etymology":{"value":"The word 'fictionised' is derived from 'fiction' (a literary work based on imagination rather than fact) and the suffix '-ise' (or '-ize' in American English), which means 'to make, convert, or subject to'. Therefore, 'fictionised' means to make something into fiction or to treat it in a fictional way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪkʃənaɪzd/","syllables":"fic-tion-ised"},"inflection":{"verb_forms":{"present_simple":["fictionise","fictionises"],"past_simple":"fictionised","past_participle":"fictionised","present_participle":"fictionising"}},"usage_notes":{"explanation":"'Fictionised' is typically used to describe accounts or stories that are based on real events or people but have been altered or embellished to make them more entertaining or to fit a particular narrative. It implies that some elements have been invented or changed from the original facts. It is often used in the context of biographies, historical events, or personal experiences that have been adapted into novels, movies, or other forms of fictional media.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The document was fictionised with accurate data.","correct":"✓ The document was fictionised despite accurate data.","note":"'Fictionised' implies a departure from facts, so it's contradictory to say something is fictionised 'with accurate data'. Use 'despite' or 'even though' to show the contrast."},{"incorrect":"✗ He fictionised his feelings.","correct":"✓ He fictionalized his experiences.","note":"'Fictionise' is usually applied to events, stories, or accounts, not directly to feelings. While feelings might be part of a fictionised narrative, the verb acts on the narrative itself."}],"priority":"★★☆"},"related_words":{"derivatives":["fiction (noun): A literary work based on imagination.","fictionise (verb): To make into fiction.","fictional (adjective): Relating to or characteristic of fiction.","fictionalize (verb): American English spelling of 'fictionise'.","fictionally (adverb): In a fictional manner.","nonfiction (noun): Writing that is based on facts, real events, and information."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fictionised' is a relatively advanced term that describes the process of turning real events or people into a fictional story. It implies that the original facts have been altered or embellished for dramatic effect or to fit a particular narrative. This word is often used in discussions about literature, film, and historical accounts. Understanding this word requires a good grasp of the distinction between fact and fiction and the ways in which stories can be adapted or transformed.","priority":"★★☆"},"example_sentences":[{"sentence":"The historical figure's early life was heavily fictionised in the popular movie.","translation":"その歴史上の人物の幼少期は、人気映画で大幅に脚色された。","type":"verb (past participle)","meaning_category":"脚色された"},{"sentence":"The author admitted that some parts of his autobiography were fictionised for dramatic effect.","translation":"著者は、自伝の一部が劇的な効果のために虚構化されたことを認めた。","type":"verb (past participle)","meaning_category":"虚構化された"},{"sentence":"The documentary accused the filmmaker of presenting a fictionised version of the events.","translation":"そのドキュメンタリーは、映画製作者が事件の脚色された版を提示していると非難した。","type":"adjective","meaning_category":"脚色された"}]}