{"word":"sheep dip","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"羊を浸す消毒液、羊の薬浴槽","english_definition":"A liquid preparation for immersing sheep to kill parasites; also, a tank or trough containing this preparation.","examples":[{"sentence":"The farmer prepared the sheep dip before bringing the flock in.","translation":"農夫は羊の群れを連れてくる前に、羊の薬浴槽を準備した。"},{"sentence":"The sheep dip helps to prevent diseases spread by ticks and lice.","translation":"羊の薬浴は、ダニやシラミによって広がる病気を防ぐのに役立つ。"}],"collocations":["prepare the sheep dip","use sheep dip","sheep dip solution","sheep dip tank"],"synonyms":["sheep wash","dip","disinfectant bath"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"羊を薬浴させる","english_definition":"To immerse sheep in a liquid preparation to kill parasites.","examples":[{"sentence":"All the sheep were sheep-dipped to prevent scabies.","translation":"疥癬を予防するために、すべての羊が薬浴させられた。"},{"sentence":"Sheep-dipping is an important part of sheep farming.","translation":"羊を薬浴させることは、羊の飼育において重要な部分である。"}],"collocations":["sheep-dip the flock","sheep-dip regularly"],"synonyms":["dip","wash"],"antonyms":[]},{"part_of_speech":"noun","definition":"（比喩的に）徹底的な調査、審査、または浄化","english_definition":"(Figuratively) A thorough investigation, vetting, or cleansing.","examples":[{"sentence":"The candidate underwent a thorough sheep dip before being approved.","translation":"候補者は承認される前に徹底的な審査を受けた。"},{"sentence":"The project needs a sheep dip to ensure all the data is accurate.","translation":"すべてのデータが正確であることを保証するために、プロジェクトは徹底的な調査を必要としている。"}],"collocations":["undergo a sheep dip","a thorough sheep dip"],"synonyms":["thorough investigation","vetting","cleansing"],"antonyms":[]}],"etymology":{"value":"The term comes from the literal practice of dipping sheep in a disinfectant solution to kill parasites.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃiːp dɪp/","syllables":"sheep-dip"},"inflection":{"noun_plural":"sheep dips","verb_forms":{"present_simple":["sheep dip","sheep dips"],"past_simple":"sheep-dipped","past_participle":"sheep-dipped","present_participle":"sheep-dipping"}},"usage_notes":{"explanation":"The term 'sheep dip' is primarily used in agricultural contexts referring to the process of immersing sheep in a disinfectant solution to control parasites. Figuratively, it can refer to a thorough or rigorous vetting process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used sheepdip to clean the floor.","correct":"✓ He used disinfectant to clean the floor.","note":"'Sheep dip' refers specifically to the solution used for sheep. For general cleaning, use 'disinfectant'."},{"incorrect":"✗ The company sheep-dipped their employees in the river.","correct":"✓ The company sheep-dipped their employees (by metaphorically subjecting them to a thorough review).","note":"The literal act of 'sheep-dipping' applies only to sheep. For people, it's a metaphor for a thorough review or vetting process."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sheep shearing","flock","parasite","scabies"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sheep dip' has both a literal and a figurative meaning. Literally, it refers to the practice of immersing sheep in a disinfectant solution to kill parasites. Figuratively, it describes a thorough investigation or vetting process, often used in business or political contexts to ensure that something or someone is free from problems or risks. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The farmer regularly uses a sheep dip to keep his flock healthy.","translation":"農夫は羊の群れを健康に保つために、定期的に羊を薬浴させる。","type":"noun","meaning_category":"sheep dip (noun)"},{"sentence":"Before selling the sheep, they must be sheep-dipped.","translation":"羊を売る前に、薬浴させなければならない。","type":"verb","meaning_category":"sheep dip (verb)"},{"sentence":"The new recruits underwent a rigorous sheep dip before being assigned to sensitive projects.","translation":"新入社員は、機密プロジェクトに配属される前に、厳格な審査を受けた。","type":"noun","meaning_category":"figurative sheep dip (noun)"}]}