{"word":"feudaries","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"封土保有者（封建制度における）","english_definition":"(historical) A feudal tenant; one who holds lands of another by feudal service; a vassal.","examples":[{"sentence":"The feudaries were required to provide military service to their lord.","translation":"封土保有者は、領主に対して軍役を提供する必要があった。"},{"sentence":"The king relied on his feudaries to maintain order in the realm.","translation":"王は、領土内の秩序を維持するために封土保有者に頼っていた。"}],"collocations":["feudal system","feudal lord","feudal service"],"synonyms":["vassal","tenant","liegeman"],"antonyms":["lord","sovereign"]}],"etymology":{"value":"Derived from 'feud', referring to land held in feudal tenure, plus the suffix '-ary' indicating a person associated with that tenure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfjuːdəriz/","syllables":"feu-da-ries"},"inflection":{"noun_plural":"feudaries"},"usage_notes":{"explanation":"'Feudaries' is a historical term referring to individuals who held land under the feudal system. They owed service and allegiance to a superior lord in return for the land they held. The term is rarely used in modern English outside of historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The feudaries were independent rulers.","correct":"✓ The feudaries were subordinate to a lord.","note":"Feudaries were not independent; they were bound by obligations to a lord."}],"priority":"★☆☆"},"related_words":{"derivatives":["feud","feudal","feudalism"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'feudaries' is a highly specialized historical term related to the feudal system. Understanding requires knowledge of feudalism and its social structure. It is unlikely to be encountered outside academic or historical contexts."},"example_sentences":[{"sentence":"The power of the feudal lord depended on the loyalty of his feudaries.","translation":"封建領主の権力は、封土保有者の忠誠心にかかっていた。","type":"noun","meaning_category":"封土保有者"},{"sentence":"The survey listed all the feudaries and their obligations to the crown.","translation":"調査では、すべての封土保有者と王室に対する義務が記載されていた。","type":"noun","meaning_category":"封土保有者"}]}