{"word":"d-tubocurarine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"D-ツボクラリン：南米原産の植物毒であるクラーレの主要成分の一つ。非脱分極性筋弛緩薬として用いられ、神経筋接合部におけるアセチルコリンの作用を遮断することで骨格筋を弛緩させる。麻酔補助薬として手術時の筋弛緩や、人工呼吸管理時の呼吸補助などに使用される。","english_definition":"A muscle relaxant and non-depolarizing neuromuscular blocker; a principal alkaloid of curare. It blocks the action of acetylcholine at the neuromuscular junction, causing skeletal muscle relaxation. It has been used as an adjunct to anesthesia to provide skeletal muscle relaxation during surgery or to facilitate mechanical ventilation.","examples":[{"sentence":"D-tubocurarine is a competitive antagonist of acetylcholine at the nicotinic acetylcholine receptor.","translation":"D-ツボクラリンは、ニコチン性アセチルコリン受容体におけるアセチルコリンの競合的拮抗薬である。"},{"sentence":"The use of d-tubocurarine has largely been replaced by newer, safer muscle relaxants.","translation":"D-ツボクラリンの使用は、より新しく、より安全な筋弛緩薬に大きく置き換えられている。"}],"collocations":["muscle relaxant","neuromuscular blocker","acetylcholine receptor","skeletal muscle relaxation","anesthesia","mechanical ventilation"],"synonyms":["tubocurarine","curare"],"antonyms":[],"related_conditions":["malignant hyperthermia","bronchospasm","hypotension","histamine release"]}],"etymology":{"value":"D-tubocurarineは、クラーレの主要成分であることから、南米の先住民が狩猟に使用していた矢毒に由来する。'tubo-'は、クラーレが保管されていた竹筒（tube）に由来する。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdiːˌtjuːboʊkjuˈrɑːriːn/","syllables":"d-tu-bo-cu-ra-rine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"D-tubocurarineは、歴史的に重要な筋弛緩薬であるが、副作用のリスクが高いため、現代の臨床現場では使用頻度が大幅に減少している。ヒスタミン放出を引き起こし、気管支痙攣や低血圧を引き起こす可能性がある。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["tubocurarinium chloride"],"phrasal_verbs":[]},"level_frequency":{"priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"D-tubocurarine is a complex term related to pharmacology and medicine. Understanding requires knowledge of neuromuscular transmission, muscle relaxants, and the history of anesthesia. It is primarily used in scientific or medical contexts."},"example_sentences":[{"sentence":"The anesthesiologist administered d-tubocurarine to facilitate intubation.","translation":"麻酔科医は挿管を容易にするためにD-ツボクラリンを投与した。","type":"noun","meaning_category":"muscle relaxant"},{"sentence":"D-tubocurarine's mechanism of action involves blocking acetylcholine receptors at the neuromuscular junction.","translation":"D-ツボクラリンの作用機序は、神経筋接合部におけるアセチルコリン受容体の遮断を伴う。","type":"noun","meaning_category":"mechanism of action"}]}