{"word":"overpenalization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"過剰な処罰、過度なペナルティ","english_definition":"The act of penalizing excessively or imposing a penalty that is disproportionate to the offense.","examples":[{"sentence":"The company faced criticism for the overpenalization of minor infractions.","translation":"その会社は、軽微な違反に対する過剰な処罰で批判にさらされた。"},{"sentence":"The judge was accused of overpenalization in the sentencing of the defendant.","translation":"裁判官は、被告への量刑において過剰な処罰を行ったとして非難された。"},{"sentence":"There is concern that the new regulations could lead to overpenalization of businesses.","translation":"新しい規制が企業への過剰な処罰につながる可能性があるという懸念がある。"}],"collocations":["avoid overpenalization","risk of overpenalization","prevent overpenalization","instances of overpenalization"],"synonyms":["excessive punishment","disproportionate penalty","undue sanction","overly harsh penalty"],"antonyms":["underpenalization","lenient punishment","appropriate penalty"]}],"etymology":{"value":"Derived from \"over-\" (excessive) + \"penalization\" (the act of imposing a penalty).","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˌpiːnəlaɪˈzeɪʃən/","syllables":"o-ver-pe-nal-i-za-tion"},"inflection":{"noun_plural":"overpenalizations"},"usage_notes":{"explanation":"\"Overpenalization\" refers to the act of imposing a penalty that is too severe or disproportionate to the offense committed. It suggests an imbalance between the wrongdoing and the punishment, often implying unfairness or injustice. This term is commonly used in legal, regulatory, and organizational contexts to describe situations where the penalties are considered excessive or unreasonable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The overpenalization was happened to him.","correct":"✓ He experienced overpenalization. / ✓ He was subjected to overpenalization.","note":"\"Overpenalization\" is a noun, so it cannot be used as a verb. Use verbs like \"experience,\" \"undergo,\" or \"be subjected to\" to describe someone being overpenalized."},{"incorrect":"✗ The overpenalization is not good.","correct":"✓ Overpenalization is not good.","note":"The sentence is grammatically correct, but it's better to provide context or specify what is not good about it. For example, \"Overpenalization can lead to resentment and decreased morale.\" "}],"priority":"★★☆"},"related_words":{"derivatives":["overpenalize (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overpenalization\" is a formal term indicating that a punishment is too harsh for the offense committed. It's used in discussions about fairness in legal, regulatory, or organizational contexts. The word implies that the penalty exceeds what is reasonable or just, creating an imbalance between the action and its consequence. Understanding this term is useful for analyzing situations where penalties seem disproportionate or unfair."},"example_sentences":[{"sentence":"The company was criticized for its policy of overpenalization, which led to low employee morale.","translation":"その会社は、過剰な処罰という方針が従業員の士気を低下させているとして批判された。","type":"noun","meaning_category":"過剰な処罰"},{"sentence":"The government is trying to avoid overpenalization of small businesses through more lenient regulations.","translation":"政府は、より寛大な規制を通じて中小企業への過剰な処罰を回避しようとしている。","type":"noun","meaning_category":"過剰な処罰"},{"sentence":"The report highlighted several cases of overpenalization in the education system.","translation":"報告書は、教育システムにおける過剰な処罰の事例をいくつか取り上げた。","type":"noun","meaning_category":"過剰な処罰"}]}