{"word":"manualize","priority":"★★★","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(プロセス、手順などを)マニュアル化する、手順書を作成する","english_definition":"to create a manual or set of instructions for (a process, procedure, etc.); to reduce to a set of instructions.","examples":[{"sentence":"The company decided to manualize all of its customer service procedures.","translation":"会社は顧客サービスの手順をすべてマニュアル化することを決定した。"},{"sentence":"We need to manualize the onboarding process to ensure consistency.","translation":"一貫性を確保するために、新入社員の研修プロセスをマニュアル化する必要がある。"},{"sentence":"The software developer manualized the steps for troubleshooting common errors.","translation":"ソフトウェア開発者は、よくあるエラーのトラブルシューティングの手順をマニュアル化した。"}],"collocations":["manualize a process (プロセスをマニュアル化する)","manualize a procedure (手順をマニュアル化する)","manualize the steps (手順をマニュアル化する)","manualize the workflow (ワークフローをマニュアル化する)"],"synonyms":["document","standardize","codify","systematize","formalize"],"antonyms":["improvise","ad-hoc","wing it (informal)"]},{"part_of_speech":"verb","transitivity":"vi","definition":"マニュアル化される、手順書にまとめられる","english_definition":"to be made into a manual or set of instructions.","examples":[{"sentence":"The entire system can be manualized for easier understanding.","translation":"システム全体をマニュアル化することで、理解しやすくなる。"},{"sentence":"This process is difficult to manualize because it requires so much creativity.","translation":"このプロセスは創造性を非常に必要とするため、マニュアル化が難しい。"}],"collocations":["be manualized (マニュアル化される)","can be manualized (マニュアル化できる)","difficult to manualize (マニュアル化が難しい)"],"synonyms":["be documented","be standardized","be codified"],"antonyms":["remain ad-hoc","remain unwritten"]}],"etymology":{"value":"Derived from 'manual' (a handbook or guide) + '-ize' (a suffix indicating the act of making or doing something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmænjuəˌlaɪz/","syllables":"man-u-al-ize"},"inflection":{"verb_forms":{"present_simple":["manualize","manualizes"],"past_simple":"manualized","past_participle":"manualized","present_participle":"manualizing"}},"usage_notes":{"explanation":"'Manualize' is a verb that means to create a manual or set of instructions for something. It is often used in business and technical contexts to describe the process of documenting procedures and workflows. The goal of manualizing is to ensure consistency, efficiency, and ease of training. It can be used both transitively (to manualize something) and intransitively (something can be manualized).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We need to manual the process.","correct":"✓ We need to manualize the process.","note":"'Manual' is a noun or adjective, not a verb. Use 'manualize' as the verb."},{"incorrect":"✗ The process is very manualized.","correct":"✓ The process is highly manualized. / ✓ The process is well-manualized.","note":"Use an adverb like 'highly' or 'well' to modify 'manualized' when used as an adjective-like participle."}],"priority":"★★☆"},"related_words":{"derivatives":["manualization (noun: the act of manualizing)"],"phrasal_verbs":[],"related_terms":["manual (noun: a handbook or guide)","documentation (noun: written materials that explain something)","procedure (noun: a series of actions conducted in a certain order or manner)","workflow (noun: the sequence of industrial, administrative, or other processes through which a piece of work passes from initiation to completion)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in business and technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Manualize' is a relatively uncommon verb that is primarily used in professional or technical settings. It refers to the act of creating a manual or detailed set of instructions for a particular process or system. The purpose of manualizing something is typically to standardize it, make it easier to train people on, and ensure consistency in its execution. This word is most often encountered in contexts related to business operations, software development, or engineering."},"example_sentences":[{"sentence":"The engineering team was tasked with manualizing the assembly process for the new product.","translation":"エンジニアリングチームは、新製品の組み立てプロセスをマニュアル化するよう指示された。","type":"verb","meaning_category":"マニュアル化する"},{"sentence":"By manualizing the data entry process, we reduced errors and improved efficiency.","translation":"データ入力プロセスをマニュアル化することで、エラーを減らし、効率を向上させた。","type":"verb","meaning_category":"マニュアル化する"},{"sentence":"The software is designed to be easily manualized, allowing users to create custom workflows.","translation":"そのソフトウェアは簡単にマニュアル化できるように設計されており、ユーザーはカスタムワークフローを作成できる。","type":"verb","meaning_category":"マニュアル化される"}]}