{"word":"whipman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スコットランド)馬車屋、御者、馬丁","english_definition":"(Scotland) A carter; a driver of a horse-drawn vehicle; a groom.","examples":[{"sentence":"The whipman cracked his whip to urge the horses onward.","translation":"御者は馬を促すために鞭を鳴らした。"},{"sentence":"In olden days, the whipman was a common sight on the roads.","translation":"昔は、馬車屋が道でよく見かけられた。"}],"collocations":["a skilled whipman","the old whipman","the whipman's cart"],"synonyms":["carter","driver","groom","coachman"],"antonyms":[]}],"etymology":{"value":"From 'whip' (a lash used to control animals) + 'man' (a person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪpmən/","syllables":"whip-man"},"inflection":{"noun_plural":"whipmen"},"usage_notes":{"explanation":"'Whipman' is a somewhat archaic term, particularly associated with Scotland. It refers to someone who drives a horse-drawn vehicle or tends to horses. The term emphasizes the use of a whip to control the animals.","priority":"★★☆"},"related_words":{"derivatives":["whip (noun, verb)","man (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'whipman' is a relatively obscure term, primarily of historical interest. It refers to someone who drives a horse-drawn vehicle, particularly using a whip to control the animals. Due to its limited modern usage, it is not typically encountered in general English conversation or writing. Understanding the term requires knowledge of historical occupations and transportation methods."},"example_sentences":[{"sentence":"The annual Whipman Play is a traditional festival in some Scottish towns.","translation":"毎年開催されるウィップマン・プレイは、スコットランドの一部の町における伝統的な祭りである。","type":"noun","meaning_category":"馬車屋、御者"},{"sentence":"He worked as a whipman, delivering goods throughout the countryside.","translation":"彼は馬車屋として働き、田舎の至る所に商品を配達した。","type":"noun","meaning_category":"馬車屋、御者"}]}