{"word":"electroendosmose","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"電気浸透","english_definition":"The movement of liquid through a membrane or porous material under the influence of an electric field.","examples":[{"sentence":"Electroendosmose is used in various applications such as soil stabilization and drug delivery.","translation":"電気浸透は、土壌安定化や薬物送達などのさまざまな用途で使用されます。"}],"collocations":["electroendosmotic flow","electroendosmotic pump"],"synonyms":["electroosmosis"],"antonyms":[]}],"etymology":{"value":"Derived from 'electro-' (referring to electricity), 'endo-' (meaning within or inner), and 'osmose' (referring to osmosis, the movement of a solvent through a semipermeable membrane).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˌɛndoʊzˈmoʊs/","syllables":"e-lec-tro-en-dos-mose"},"inflection":{"noun_plural":"electroendosmoses"},"usage_notes":{"explanation":"Electroendosmose, also known as electroosmosis, is a phenomenon where a liquid moves through a membrane or porous material due to an applied electric field. This occurs because the surface of the material has an electrical charge, which attracts ions of the opposite charge in the liquid. When an electric field is applied, these ions move, dragging the liquid with them.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["electroendosmotic","electroosmotic"],"related_terms":["electrophoresis","osmosis","zeta potential"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Electroendosmose is a specialized scientific term primarily used in fields like chemistry, physics, and engineering. Understanding it requires knowledge of electrostatics, fluid dynamics, and membrane science. The term is not commonly encountered outside of technical contexts."},"example_sentences":[{"sentence":"The efficiency of electroendosmose in soil dewatering depends on the soil's zeta potential.","translation":"土壌の電気浸透による脱水効率は、土壌のゼータ電位に依存します。","type":"scientific","meaning_category":"physics"},{"sentence":"Electroendosmose can be used to transport fluids in microfluidic devices.","translation":"電気浸透は、マイクロ流体デバイスで流体を輸送するために使用できます。","type":"engineering","meaning_category":"engineering"}]}