{"word":"darkener","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"濃くするもの、暗くするもの、暗色剤","english_definition":"A substance or agent that makes something darker in color or shade.","examples":[{"sentence":"Add a drop of darkener to the paint to achieve the desired shade.","translation":"望む色合いにするために、塗料に暗色剤を一滴加えてください。"},{"sentence":"This hair dye contains a natural darkener.","translation":"このヘアカラーには天然の暗色剤が含まれています。"}],"collocations":["hair darkener (ヘアカラー)","paint darkener (塗料用暗色剤)","fabric darkener (布地用暗色剤)"],"synonyms":["darkening agent","shading agent"],"antonyms":["lightener","brightener"]},{"part_of_speech":"noun","definition":"(写真)減力剤","english_definition":"(Photography) A chemical used to reduce the density of a photographic image.","examples":[{"sentence":"The photographer used a darkener to correct overexposed areas of the print.","translation":"写真家は、プリントの露出過多の部分を修正するために減力剤を使用しました。"}],"collocations":["photographic darkener"],"synonyms":["reducer","reducing agent"],"antonyms":["intensifier"]}],"etymology":{"value":"Derived from the verb 'darken' (to make or become dark) with the suffix '-er' indicating an agent or substance that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɑːrkənər/","syllables":"dar-ken-er"},"inflection":{"noun_plural":"darkeners"},"usage_notes":{"explanation":"'Darkener' refers to a substance or agent used to make something darker. It is commonly used in contexts such as painting, hair dyeing, and photography. In photography, it has a specific meaning referring to a chemical used to reduce the density of an image, also known as a reducer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a brightener instead of darkener and now my hair is too light.","correct":"✓ I used a lightener instead of a darkener and now my hair is too light.","note":"'Brightener' and 'lightener' are often used interchangeably as antonyms of 'darkener' in the context of color or shade."}],"priority":"★★☆"},"related_words":{"derivatives":["darken (verb)","dark (adjective, noun)","darkness (noun)","darkening (noun, adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'darkener' is a relatively uncommon word that refers to a substance used to make something darker. It is most often used in technical contexts related to coloring materials (like paint or hair dye) or in photography. Understanding the word requires a vocabulary level that includes understanding of root words and suffixes used to form nouns.","priority":"★★☆"},"example_sentences":[{"sentence":"She added a few drops of brown food coloring as a darkener to the frosting.","translation":"彼女は、フロスティングを濃くするために、茶色の食用色素を数滴加えました。","type":"noun","meaning_category":"濃くするもの"},{"sentence":"The old photograph needed a darkener to bring out the faded details.","translation":"その古い写真は、色あせた細部を引き出すために減力剤が必要でした。","type":"noun","meaning_category":"(写真)減力剤"}]}