{"word":"corms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"球茎（植物の地下茎の一種）","english_definition":"A short, vertical, swollen underground plant stem that serves as a storage organ used by some plants to survive winter or other adverse conditions such as summer drought and heat.","examples":[{"sentence":"Gladioli grow from corms.","translation":"グラジオラスは球茎から育つ。"},{"sentence":"Crocuses and gladioli are grown from corms, not bulbs.","translation":"クロッカスやグラジオラスは、球根ではなく球茎から栽培されます。"}],"collocations":["plant corms","grow from corms","gladiolus corms","crocus corms"],"synonyms":["bulb","tuber","rhizome"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word \"kormos\" meaning \"trunk\" or \"stump,\" referring to the shape of the underground stem.","priority":"★★★"},"pronunciation":{"ipa":"/kɔːrmz/","syllables":"corms"},"inflection":{"noun_plural":"corms"},"usage_notes":{"explanation":"Corms are often confused with bulbs, but they are different. A corm is a solid stem, whereas a bulb is made up of layers of modified leaves. Corms are used by plants to store nutrients and energy, allowing them to survive dormant periods and regrow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted bulbs, but they were actually corms.","correct":"✓ I planted corms, but I thought they were bulbs.","note":"Distinguish between corms and bulbs. Bulbs have layers, corms are solid."}],"priority":"★★☆"},"related_words":{"derivatives":["cormel (small corm)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"corms\" refers to a specific type of underground plant stem that functions as a storage organ. It is most commonly used in botanical contexts, gardening, and horticulture. Understanding the distinction between corms and similar structures like bulbs and tubers is key to using the word correctly. The term is more technical and less frequently encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The gardener carefully planted the gladiolus **corms** in the prepared bed.","translation":"庭師は丁寧にグラジオラスの球茎を準備した花壇に植えた。","type":"noun","meaning_category":"球茎"},{"sentence":"Unlike bulbs, **corms** are solid and fleshy.","translation":"球根とは異なり、球茎は中身が詰まっていて多肉質である。","type":"noun","meaning_category":"球茎"},{"sentence":"Many spring flowers, such as crocuses, grow from **corms**.","translation":"クロッカスのような多くの春の花は球茎から育つ。","type":"noun","meaning_category":"球茎"}]}