{"word":"paraconid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歯科学)下顎臼歯の三角歯の最前部の尖頭","english_definition":"(dentistry) The cusp at the anterior end of the trigonid of a lower molar tooth.","examples":[{"sentence":"The presence or absence of a paraconid is a key characteristic in identifying certain primate fossils.","translation":"傍円錐歯の有無は、特定の霊長類の化石を識別する上で重要な特徴です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'para' (beside, near) + 'conus' (cone) + '-id' (a suffix used in dental terminology to denote a cusp on a lower tooth).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌpærəˈkɒnɪd/","syllables":"pa-ra-co-nid"},"inflection":{"noun_plural":"paraconids"},"usage_notes":{"explanation":"The term 'paraconid' is primarily used in the fields of dentistry, paleontology, and zoology, specifically when describing the morphology of teeth, particularly lower molars. It is a technical term and not commonly used outside of these specialized contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["protoconid","metaconid","hypoconid","entoconid"],"related_terms":["trigonid","talonid"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Paraconid' is a highly specialized term used in the context of dental morphology, specifically relating to the cusps of lower molar teeth. Understanding this term requires a background in dentistry, paleontology, or a related field. It is not part of general vocabulary."},"example_sentences":[{"sentence":"In early hominid fossils, the size and shape of the paraconid can provide clues about their diet.","translation":"初期の人類化石では、傍円錐歯の大きさや形状が彼らの食性に関する手がかりを提供することがあります。","type":"technical","meaning_category":"dental morphology"},{"sentence":"The paraconid is often reduced or absent in modern human molars compared to earlier hominin species.","translation":"現代人の大臼歯では、傍円錐歯は初期の人類種と比較して縮小または欠如していることがよくあります。","type":"technical","meaning_category":"dental morphology"}]}