{"word":"Hyponasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)植物器官、特に葉の下面の成長が上面よりも速く、その結果、下向きの湾曲またはカールが生じること。","english_definition":"(Botany) The more rapid growth on the lower side of an organ or part (especially a leaf) than on the upper side, resulting in a downward curvature or curl.","examples":[{"sentence":"Hyponasty is a common response to ethylene exposure in plants.","translation":"下偏成長は、植物におけるエチレン曝露に対する一般的な反応です。"},{"sentence":"The hyponasty observed in the leaves was due to increased cell division on the abaxial side.","translation":"葉に見られた下偏成長は、向軸面での細胞分裂の増加によるものでした。"}],"collocations":["ethylene-induced hyponasty","leaf hyponasty","abaxial hyponasty"],"synonyms":["epinasty (opposite of hyponasty)"],"antonyms":["epinasty"]},{"part_of_speech":"noun","definition":"(植物学)下偏成長を示す植物器官の状態。","english_definition":"(Botany) The state of a plant organ exhibiting hyponasty.","examples":[{"sentence":"The hyponasty was more pronounced in the shade-grown plants.","translation":"日陰で育った植物では、下偏成長がより顕著でした。"}],"collocations":["observe hyponasty","degree of hyponasty"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hypo' (under, below) and 'nastos' (pressed down).","priority":"★★★"},"pronunciation":{"ipa":"/haɪˈpɒnəsti/","syllables":"hy-pon-as-ty"},"inflection":{"noun_plural":"hyponasties"},"usage_notes":{"explanation":"Hyponasty is a botanical term describing a specific type of differential growth in plant organs, particularly leaves, where the lower surface grows faster than the upper surface, causing the organ to curve downwards. It is often a response to environmental factors such as ethylene exposure, flooding, or shading. The opposite of hyponasty is epinasty, where the upper surface grows faster, causing an upward curvature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The leaves showed epinasty due to flooding.","correct":"✓ The leaves showed hyponasty due to flooding.","note":"Flooding typically induces hyponasty, not epinasty. Epinasty is the upward curvature, while hyponasty is the downward curvature."}],"priority":"★★☆"},"related_words":{"derivatives":["hyponastic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hyponasty is a specialized botanical term referring to the downward curvature of a plant organ, typically a leaf, due to faster growth on its lower surface compared to its upper surface. It's often a response to environmental conditions like flooding or ethylene exposure. Understanding this term requires some background in plant biology.","priority":"★★☆"},"example_sentences":[{"sentence":"Ethylene exposure induced significant hyponasty in the tomato plants.","translation":"エチレン曝露は、トマト植物に著しい下偏成長を誘発した。","type":"scientific","meaning_category":"botany"},{"sentence":"The degree of hyponasty varied depending on the light intensity.","translation":"下偏成長の程度は、光の強度によって異なった。","type":"scientific","meaning_category":"botany"}]}