{"word":"assertedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"断言的に、主張されたところによれば、～だと主張されて","english_definition":"according to what has been stated but not yet proven; allegedly.","examples":[{"sentence":"Assertedly, the company was aware of the defects before the product launch.","translation":"主張されたところによれば、その会社は製品発売前に欠陥に気づいていた。"},{"sentence":"The suspect assertedly confessed to the crime.","translation":"容疑者は犯罪を自白したと主張されている。"},{"sentence":"Assertedly, he is the rightful heir to the throne.","translation":"主張されたところによれば、彼は王位の正当な後継者である。"}],"collocations":["assertedly claimed","assertedly stated","assertedly reported"],"synonyms":["allegedly","reportedly","supposedly","ostensibly","purportedly","professedly"],"antonyms":["undeniably","certainly","definitely","unquestionably","factually"]}],"etymology":{"value":"「asserted」に「-ly」が付いた形。","priority":"★★☆"},"pronunciation":{"ipa":"/əˈsɜːrtɪdli/","syllables":"as-ser-ted-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Assertedly\" is used to present information as something that has been claimed or stated, but without confirming its truth. It indicates that the speaker is relaying information without necessarily endorsing it. It is often used in legal, journalistic, and academic contexts to maintain neutrality when presenting potentially unverified claims.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The assertedly fact is that he was there.","correct":"✓ The asserted fact is that he was there.","note":"\"Assertedly\" is an adverb and modifies verbs, adjectives, or other adverbs, not nouns. To modify the noun \"fact,\" use the adjective \"asserted.\""},{"incorrect":"✗ He assertedly denied the accusations, which is true.","correct":"✓ He allegedly denied the accusations, which may or may not be true.","note":"Using \"assertedly\" implies the information is a claim that may not be true. If the denial is confirmed, use a word like \"stated\" or \"confirmed.\""}],"priority":"★★☆"},"related_words":{"derivatives":["assert (verb): 断言する、主張する","assertion (noun): 断言、主張","assertive (adjective): 断定的な、積極的な","assertiveness (noun): 断定性、積極性"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Assertedly\" is an adverb used to indicate that a statement is based on an assertion or claim, but the truth of the statement has not been verified. It's commonly found in formal writing and speech, particularly in contexts where neutrality is important. The word suggests a degree of skepticism or detachment from the claim being presented. It is more complex than simpler alternatives like \"reportedly\" or \"allegedly.\""},"example_sentences":[{"sentence":"The documents were assertedly stolen from the safe.","translation":"その書類は金庫から盗まれたと主張されている。","type":"general","meaning_category":"general"},{"sentence":"Assertedly, the new policy will improve efficiency.","translation":"主張されたところによれば、新しい方針は効率を改善するだろう。","type":"policy","meaning_category":"policy"},{"sentence":"The witness assertedly saw the suspect at the scene.","translation":"目撃者は現場で容疑者を見たと主張している。","type":"legal","meaning_category":"legal"}]}