{"word":"pragmatism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"実用主義、プラグマティズム","english_definition":"a practical approach to problems and affairs; specifically : an attitude that emphasizes practical results rather than theories and principles","examples":[{"sentence":"His pragmatism led him to find a solution that worked, even if it wasn't ideal.","translation":"彼の実用主義により、理想的でなくてもうまくいく解決策を見つけることができた。"},{"sentence":"The company's pragmatism allowed it to adapt quickly to changing market conditions.","translation":"その会社の実用主義により、変化する市場の状況に迅速に適応することができた。"},{"sentence":"She valued pragmatism over idealism when making decisions.","translation":"彼女は意思決定をする際に理想主義よりも実用主義を重視した。"}],"collocations":["political pragmatism (政治的実用主義)","economic pragmatism (経済的実用主義)","philosophical pragmatism (哲学的実用主義)","show pragmatism (実用主義を示す)","lack pragmatism (実用主義に欠ける)","a dose of pragmatism (いくらかの実用主義)"],"synonyms":["practicality","realism","common sense","expediency","efficiency","down-to-earth approach"],"antonyms":["idealism","theoreticism","dogmatism","utopianism"]},{"part_of_speech":"noun","definition":"プラグマティズム（哲学の一学派）","english_definition":"a philosophical movement stressing practical consequences and values as standards by which to judge beliefs and actions","examples":[{"sentence":"Pragmatism emphasizes the importance of testing theories in the real world.","translation":"プラグマティズムは、現実世界で理論をテストすることの重要性を強調する。"},{"sentence":"William James was a key figure in the development of pragmatism.","translation":"ウィリアム・ジェームズは、プラグマティズムの発展における重要な人物だった。"},{"sentence":"Pragmatism rejects the idea of absolute truth.","translation":"プラグマティズムは絶対的な真実という考えを否定する。"}],"collocations":["classical pragmatism (古典的プラグマティズム)","American pragmatism (アメリカのプラグマティズム)","Dewey's pragmatism (デューイのプラグマティズム)","Jamesian pragmatism (ジェームズのプラグマティズム)","Peircean pragmatism (パースのプラグマティズム)","the principles of pragmatism (プラグマティズムの原則)"],"synonyms":["instrumentalism","experimentalism","functionalism"],"antonyms":["rationalism","essentialism","metaphysics"]}],"etymology":{"value":"From Greek 'pragma' (deed, act) + -ism. Coined in the context of philosophy to describe a focus on practical consequences and values.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpræɡmətɪzəm","syllables":"prag-ma-tism"},"inflection":{"noun_plural":"pragmatisms (rarely used)"},"usage_notes":{"explanation":"'Pragmatism' refers to a practical approach to solving problems, focusing on what works rather than adhering to abstract theories. It can also refer to the philosophical movement that emphasizes the practical consequences of beliefs. In general usage, it often implies a willingness to compromise or be flexible to achieve a desired outcome.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very pragmatic, so he has no morals.","correct":"✓ He is very pragmatic, so he focuses on what works best in a given situation.","note":"Pragmatism doesn't necessarily mean lacking morals, but rather prioritizing effective solutions. It's a focus on practicality, not inherently unethical behavior."},{"incorrect":"✗ Pragmatism is the same as cynicism.","correct":"✓ Pragmatism is a practical approach, while cynicism is a distrust of others' motives.","note":"Pragmatism is about practicality, while cynicism is about distrust. They are distinct concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["pragmatic (adjective)","pragmatically (adverb)","pragmatist (noun)"],"idioms_phrases":["a pragmatic approach","take a pragmatic view"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pragmatism' is a somewhat advanced term referring to a focus on practical solutions and results rather than abstract theories. It's often used in discussions of politics, business, and philosophy. Understanding the term requires recognizing that it values effectiveness and adaptability over strict adherence to principles. It's important to distinguish it from cynicism or a lack of ethics, as pragmatism simply prioritizes what works in a given situation."},"example_sentences":[{"sentence":"The government adopted a policy of pragmatism in dealing with the economic crisis.","translation":"政府は経済危機に対処するにあたり、実用主義的な政策を採用した。","type":"general","meaning_category":"practical approach"},{"sentence":"Her pragmatism helped the team overcome many obstacles.","translation":"彼女の実用主義は、チームが多くの障害を克服するのに役立った。","type":"general","meaning_category":"practical approach"},{"sentence":"Pragmatism, as a philosophical theory, was developed in the late 19th century.","translation":"哲学理論としてのプラグマティズムは、19世紀後半に発展した。","type":"philosophical","meaning_category":"philosophical movement"},{"sentence":"The company's pragmatism allowed them to quickly pivot to a new business model.","translation":"その会社の実用主義により、新しいビジネスモデルに迅速に転換することができた。","type":"business","meaning_category":"practical approach"},{"sentence":"He is known for his pragmatism and ability to find practical solutions to complex problems.","translation":"彼は実用主義者であり、複雑な問題に対する現実的な解決策を見つける能力があることで知られている。","type":"general","meaning_category":"practical approach"}]}