{"word":"mouse-centric","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Designed or optimized primarily for use with a computer mouse.","english_definition":"Designed or optimized primarily for use with a computer mouse.","examples":[{"sentence":"The new software interface is very mouse-centric, making it difficult to navigate with a keyboard.","translation":"新しいソフトウェアのインターフェースはマウス操作を中心に設計されており、キーボードでの操作が難しい。"},{"sentence":"Some designers argue that a mouse-centric approach limits accessibility for users with disabilities.","translation":"一部のデザイナーは、マウス操作中心のアプローチは、障害を持つユーザーのアクセシビリティを制限すると主張している。"}],"collocations":["mouse-centric design","mouse-centric interface","mouse-centric application"],"synonyms":["mouse-driven","GUI-centric"],"antonyms":["keyboard-centric","touch-centric"],"notes":"Often used in the context of user interface design and accessibility."}],"etymology":{"value":"Formed by combining 'mouse' (referring to the computer mouse) and '-centric' (meaning focused on or centered around).","priority":"Medium"},"pronunciation":{"ipa":"/ˈmaʊsˌsɛntrɪk/","syllables":"mouse-cen-tric"},"inflection":{"notes":"Adjective; no specific inflection."},"usage_notes":{"explanation":"The term 'mouse-centric' is used to describe designs or interfaces that heavily rely on mouse interaction, potentially neglecting other input methods like keyboard or touch. It often carries a slightly negative connotation, suggesting a lack of consideration for alternative input methods and accessibility.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The website is mouse-centric, so it's easy to use on a phone.","correct":"The website is mouse-centric, so it's difficult to use on a phone.","note":"Mouse-centric designs are typically *not* easy to use on touch-based devices like phones."}],"priority":"Low"},"related_words":{"derivatives":[],"related_terms":["keyboard-centric","touch-centric","user interface","GUI","accessibility"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Mouse-centric' describes something designed mainly for use with a computer mouse. It's often used when talking about software or websites that are easier to use with a mouse than with a keyboard or touchscreen. The term can sometimes imply that the design isn't very good for people who can't use a mouse easily."},"example_sentences":[{"sentence":"The application's design is quite mouse-centric, which makes it cumbersome to use on a tablet.","translation":"そのアプリケーションのデザインはかなりマウス操作中心なので、タブレットでの使用は面倒です。","type":"adjective","meaning_category":"Design focused on mouse use."}]}