{"word":"topping-off","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建設業界) 上棟式、竣工式","english_definition":"(in construction) a ceremony held when the last beam (or its equivalent) is placed atop a structure during its construction.","examples":[{"sentence":"The topping-off ceremony marked a significant milestone in the building's construction.","translation":"上棟式は、建物の建設における重要な節目となった。"},{"sentence":"They held a topping-off party for the new skyscraper.","translation":"彼らは新しい超高層ビルの上棟式パーティーを開催した。"}],"collocations":["topping-off ceremony","topping-off party"],"synonyms":["completion celebration","roofing ceremony"],"antonyms":[]},{"part_of_speech":"verb","definition":"(建設業界) 上棟式を行う","english_definition":"(in construction) to hold a ceremony when the last beam is placed atop a structure.","examples":[{"sentence":"They are planning to topping-off the new hospital next month.","translation":"彼らは来月、新しい病院の上棟式を計画している。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term comes from the tradition of placing a tree or a green bough on the last beam to be placed on top of a building. This practice is believed to have originated in Scandinavia and spread throughout Europe and North America.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒpɪŋˌɔf/","syllables":"top-ping-off"},"inflection":{"noun_plural":"topping-offs"},"usage_notes":{"explanation":"The \"topping-off\" ceremony is a tradition in the construction industry that celebrates the completion of the structure's frame. It often involves placing a tree or a flag on the final beam.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["top off (to fill something to the top)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Topping-off\" refers to a specific construction industry tradition. It's not commonly used outside of that context. Understanding requires familiarity with construction practices."},"example_sentences":[{"sentence":"The construction workers celebrated the topping-off with a barbecue.","translation":"建設作業員たちはバーベキューで上棟式を祝った。","type":"noun","meaning_category":"上棟式"},{"sentence":"The company will topping-off the new office building next week.","translation":"会社は来週、新しいオフィスビルの上棟式を行う予定だ。","type":"verb","meaning_category":"上棟式を行う"}]}