{"word":"non-partition-tolerant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(データベースシステムなどが)パーティション耐性を持たない","english_definition":"(of a database system, etc.) not partition-tolerant; unable to continue operating properly when network partitions (breaks in connectivity) occur.","examples":[{"sentence":"A non-partition-tolerant database may become unavailable or inconsistent if network connectivity is disrupted.","translation":"パーティション耐性を持たないデータベースは、ネットワーク接続が中断された場合、利用不可能になったり、一貫性が失われたりする可能性があります。"}],"collocations":["non-partition-tolerant database","non-partition-tolerant system"],"synonyms":["partition-intolerant"],"antonyms":["partition-tolerant"],"related_terms":["CAP theorem","ACID","BASE","distributed system","network partition"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'partition-tolerant'. Partition-tolerant, in turn, refers to a system's ability to tolerate network partitions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn pɑːrˈtɪʃən ˈtɒlərənt/","syllables":"non-par-ti-tion-tol-er-ant"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms (more non-partition-tolerant, most non-partition-tolerant) are possible but uncommon."},"usage_notes":{"explanation":"'Non-partition-tolerant' describes a system that cannot maintain consistency and availability guarantees when a network partition occurs. In the context of distributed systems and databases, this term is often discussed in relation to the CAP theorem, which states that a distributed system can only guarantee two out of three properties: Consistency, Availability, and Partition Tolerance. A system that chooses Consistency and Availability over Partition Tolerance is considered non-partition-tolerant. Such systems are generally unsuitable for distributed environments where network failures are common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The database is non-partition tolerant, so it's perfect for distributed systems.","correct":"✓ The database is non-partition-tolerant, so it's unsuitable for distributed systems.","note":"Non-partition-tolerant systems are *not* suitable for distributed systems, as they cannot handle network partitions well."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["CAP theorem","ACID","BASE","distributed consistency","network failure"],"priority":"★★★"},"level_frequency":{"level":"Advanced (Technical)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Non-partition-tolerant' is a technical term used primarily in the context of distributed computing and database systems. It describes a system that is unable to function correctly when a network partition occurs, meaning that different parts of the system can no longer communicate with each other. This term is usually discussed in relation to the CAP theorem, which states that a distributed system can only guarantee two of the following three properties: Consistency, Availability, and Partition Tolerance. A non-partition-tolerant system prioritizes Consistency and Availability over Partition Tolerance, making it unsuitable for environments where network failures are common. Understanding this term requires familiarity with distributed systems concepts and the CAP theorem."},"example_sentences":[{"sentence":"The legacy system was non-partition-tolerant, making it difficult to migrate to a cloud environment.","translation":"そのレガシーシステムはパーティション耐性がなかったため、クラウド環境への移行が困難でした。","type":"adjective","meaning_category":"Technical Specification"},{"sentence":"Due to its non-partition-tolerant design, the application experienced significant downtime during the network outage.","translation":"そのアプリケーションはパーティション耐性のない設計のため、ネットワーク停止中に重大なダウンタイムが発生しました。","type":"adjective","meaning_category":"System Behavior"}]}