{"word":"Neo-Darwinism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ネオダーウィニズム、現代総合説","english_definition":"A modern evolutionary synthesis combining Charles Darwin's theory of natural selection and Gregor Mendel's ideas on genetics and heredity; the generally accepted theory of how evolution works.","examples":[{"sentence":"Neo-Darwinism explains evolution through the accumulation of small genetic mutations favored by natural selection.","translation":"ネオダーウィニズムは、自然選択によって有利になった小さな遺伝的変異の蓄積を通して進化を説明する。"},{"sentence":"The modern synthesis, or Neo-Darwinism, integrates genetics with Darwin's original theory.","translation":"現代総合説、またはネオダーウィニズムは、遺伝学をダーウィンの元の理論と統合する。"}],"collocations":["modern synthesis","evolutionary biology","natural selection","genetic mutation","heredity"],"synonyms":["modern synthesis","evolutionary synthesis"],"antonyms":["Lamarckism","creationism"]}],"etymology":{"value":"The term 'Neo-Darwinism' was coined by Romanes in 1895 to describe the evolutionary theory of August Weismann, who rejected the inheritance of acquired characteristics. It combines Darwin's theory of natural selection with Mendelian genetics.","priority":"★★★"},"pronunciation":{"ipa":"/ˌniːoʊˈdɑːrwɪnɪzəm/","syllables":"Ne-o-Dar-win-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neo-Darwinism, also known as the modern synthesis, is the prevailing evolutionary paradigm. It emphasizes that evolution occurs through natural selection acting on genetic variation. This variation arises primarily through random mutation. Unlike earlier theories, Neo-Darwinism rejects the idea that acquired characteristics can be inherited.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-Darwinism supports the inheritance of acquired traits.","correct":"✓ Neo-Darwinism rejects the inheritance of acquired traits.","note":"Neo-Darwinism explicitly rejects the idea that characteristics acquired during an organism's lifetime can be passed on to its offspring."}],"priority":"★★☆"},"related_words":{"derivatives":["Neo-Darwinian (adjective, noun)"],"related_terms":["Darwinism","natural selection","mutation","genetics","heredity","Mendel's laws"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neo-Darwinism' is a term used in advanced biology to describe the modern understanding of evolution. It combines Darwin's idea of natural selection with genetics, explaining how traits change over time due to mutations and heredity. It's a key concept for understanding how life evolves.","priority":"★★☆"},"example_sentences":[{"sentence":"Neo-Darwinism provides a comprehensive explanation for the diversity of life on Earth.","translation":"ネオダーウィニズムは、地球上の生命の多様性に対する包括的な説明を提供する。","type":"general","meaning_category":"Explanation of evolution"},{"sentence":"Critics of Neo-Darwinism sometimes argue that it doesn't fully account for the complexity of biological systems.","translation":"ネオダーウィニズムの批判者たちは、それが生物学的システムの複雑さを完全には説明していないと主張することがある。","type":"criticism","meaning_category":"Criticism of the theory"},{"sentence":"The core tenets of Neo-Darwinism are widely accepted within the scientific community.","translation":"ネオダーウィニズムの中核となる教義は、科学界で広く受け入れられている。","type":"acceptance","meaning_category":"Acceptance of the theory"}]}