{"word":"museologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"博物館学芸員、博物館研究者","english_definition":"A person who studies or works in museology; a museum professional.","examples":[{"sentence":"The museologist curated a fascinating exhibit on ancient civilizations.","translation":"その博物館学芸員は古代文明に関する魅力的な展示を企画した。"},{"sentence":"Museologists are responsible for the preservation and interpretation of cultural heritage.","translation":"博物館学芸員は文化遺産の保存と解釈に責任を負う。"},{"sentence":"She is a leading museologist in the field of contemporary art.","translation":"彼女は現代美術の分野における主要な博物館研究者である。"}],"collocations":["work as a museologist (博物館学芸員として働く)","leading museologist (主要な博物館研究者)","experienced museologist (経験豊富な博物館学芸員)","museologist and historian (博物館学芸員兼歴史家)"],"synonyms":["curator","museum professional","museum specialist"],"antonyms":[]}],"etymology":{"value":"\"Museology\" + \"-ist\". Museology comes from the Greek \"Mouseion\" (a place dedicated to the Muses) + \"-logy\" (study of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmjuːziˈɒlədʒɪst/","syllables":"mu-se-ol-o-gist"},"inflection":{"noun_plural":"museologists"},"usage_notes":{"explanation":"A museologist is someone who studies the theory and practice of museum management and curation. They may work in museums, galleries, or other cultural institutions. The term encompasses a wide range of roles, from curators and conservators to educators and administrators.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a museumist.","correct":"✓ She is a museologist.","note":"\"Museumist\" is not a standard term. Use \"museologist\" or \"museum professional\" instead."},{"incorrect":"✗ He is studying museumology. He is a museumologist soon.","correct":"✓ He is studying museology. He will be a museologist soon.","note":"The correct term for the field of study is \"museology\", and the person is a \"museologist\"."}],"priority":"★★☆"},"related_words":{"derivatives":["museology","museum","curator","archivist","conservationist"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"museologist\" is a specialized term used to describe someone who studies or works in the field of museology. This field involves the study and practice of museum management, including curation, conservation, and education. The term is not commonly used in everyday conversation and is more likely to be encountered in academic or professional contexts related to museums and cultural heritage. Understanding this word requires familiarity with the field of museum studies."},"example_sentences":[{"sentence":"The university offers a degree in museology to train future museologists.","translation":"その大学は将来の博物館学芸員を育成するために博物館学の学位を提供している。","type":"noun","meaning_category":"博物館学芸員"},{"sentence":"A skilled museologist can bring history to life through engaging exhibits.","translation":"熟練した博物館学芸員は、魅力的な展示を通して歴史を生き生きとさせることができる。","type":"noun","meaning_category":"博物館研究者"},{"sentence":"The conference brought together museologists from around the world to discuss new trends in museum management.","translation":"その会議には、博物館経営の新しいトレンドについて議論するために、世界中の博物館学芸員が集まった。","type":"noun","meaning_category":"博物館学芸員"}]}