{"word":"Holstein","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ホルスタイン（種）の牛","english_definition":"A breed of dairy cattle originating from the Dutch provinces of North Holland and Friesland, and Schleswig-Holstein in Northern Germany.","examples":[{"sentence":"Holstein cows are known for their high milk production.","translation":"ホルスタイン種の牛は、高い乳生産量で知られています。"}],"collocations":["Holstein cow","Holstein bull","Holstein calf","Holstein dairy farm"],"synonyms":["Friesian cattle (often used interchangeably, especially in Europe)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ホルスタイン（種）の","english_definition":"Relating to or characteristic of Holstein cattle.","examples":[{"sentence":"The farm specializes in Holstein dairy products.","translation":"その農場はホルスタイン種の乳製品を専門としています。"}],"collocations":["Holstein milk","Holstein beef","Holstein breed"],"synonyms":["Friesian"],"antonyms":[]},{"part_of_speech":"noun","definition":"シュレースヴィヒ＝ホルシュタイン州（ドイツの州）","english_definition":"A state in Northern Germany, bordering Denmark.","examples":[{"sentence":"Kiel is the capital of Schleswig-Holstein.","translation":"キールはシュレースヴィヒ＝ホルシュタイン州の州都です。"}],"collocations":["Schleswig-Holstein","Holstein Switzerland (a region within the state)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the region of Holstein in Northern Germany, where the breed originated.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhoʊlstaɪn","syllables":"Hol-stein"},"inflection":{"notes":"The noun is countable. The adjective is not inflected."},"usage_notes":{"explanation":"The term 'Holstein' can refer to the cattle breed or the region in Germany. When referring to the cattle, 'Holstein' and 'Friesian' are often used interchangeably, particularly in Europe, although there are subtle differences in the breed's characteristics depending on the region. When referring to the German state, the full name 'Schleswig-Holstein' is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Holstein in the field.","correct":"✓ I saw a Holstein cow in the field.","note":"While understood, it's more common to specify 'Holstein cow' unless the context is very clear."}],"priority":"★★☆"},"related_words":{"derivatives":["Holstein-Friesian (a more precise term for the breed, especially in North America)","Schleswig (part of the state name)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (in specialized contexts, such as agriculture or geography)","frequency_google_ngram":"Relatively low frequency, mostly in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Holstein' is a term that can refer to a specific breed of dairy cattle known for high milk production, or to the region of Schleswig-Holstein in northern Germany. Understanding which meaning is intended depends heavily on the context. When discussing agriculture or dairy farming, it likely refers to the cattle. In geographical or political discussions, it may refer to the German state. Be aware that 'Holstein' and 'Friesian' are often used synonymously for the cattle breed, especially in Europe."},"example_sentences":[{"sentence":"The farmer raises **Holstein** cattle for milk production.","translation":"その農家は乳生産のためにホルスタイン種の牛を飼育しています。","type":"noun","meaning_category":"cattle breed"},{"sentence":"**Holstein** milk is known for its high protein content.","translation":"ホルスタイン種の牛乳は、高いタンパク質含有量で知られています。","type":"adjective","meaning_category":"cattle breed"},{"sentence":"Schleswig-**Holstein** is a state in northern Germany.","translation":"シュレースヴィヒ＝ホルシュタイン州はドイツ北部の州です。","type":"noun","meaning_category":"German state"}]}