{"word":"still-refuted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"まだ反論されている、依然として論破されている","english_definition":"(of an idea, argument, etc.) that continues to be refuted or disproven.","examples":[{"sentence":"The still-refuted theory continues to be taught in some circles, despite overwhelming evidence against it.","translation":"その依然として論破されている理論は、それに反する圧倒的な証拠があるにもかかわらず、一部の界隈で教えられ続けている。"},{"sentence":"Despite numerous attempts to revive it, the still-refuted hypothesis remains unsupported by empirical data.","translation":"それを復活させようとする数多くの試みにもかかわらず、そのまだ反論されている仮説は、経験的データによって支持されていない。"}],"collocations":["still-refuted theory","still-refuted hypothesis","still-refuted claim","still-refuted argument"],"synonyms":["disproven","invalidated","discredited","debunked","unsupported"],"antonyms":["supported","validated","proven","accepted","established"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'still' (meaning 'continuing to be') with the past participle 'refuted' (meaning 'proven to be wrong').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstɪl rɪˈfjuːtɪd/","syllables":"still-re-fu-ted"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Still-refuted' is used to describe an idea, argument, or theory that has been disproven but continues to be discussed or considered, often despite a lack of supporting evidence. It implies that the refutation is ongoing or that the idea has not been fully abandoned despite being shown to be incorrect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The still-refuted evidence was presented in court.","correct":"✓ The refuted evidence was presented in court.","note":"'Evidence' itself cannot be 'still-refuted.' Evidence can be used to refute a claim, but the evidence itself is either valid or invalid. Use 'refuted' alone in this case."},{"incorrect":"✗ He is a still-refuted scientist.","correct":"✓ His theories are still-refuted.","note":"A person cannot be 'still-refuted,' but their ideas or theories can be. The adjective describes the state of the idea, not the person."}],"priority":"★★☆"},"related_words":{"derivatives":["refute (verb)","refutation (noun)","still (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is not a commonly used term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Still-refuted' is a complex adjective used to describe an idea or theory that has been disproven but continues to be discussed or considered. It is not a common term and would typically be used in academic or technical contexts. The reader should understand the meanings of 'still' and 'refuted' individually to grasp the combined meaning of the term."},"example_sentences":[{"sentence":"The still-refuted claim that vaccines cause autism persists despite overwhelming scientific consensus.","translation":"ワクチンが自閉症を引き起こすという、いまだに反論されている主張は、圧倒的な科学的コンセンサスにもかかわらず存続している。","type":"adjective","meaning_category":"Disproven claim"},{"sentence":"The economist presented a still-refuted argument for protectionism, ignoring decades of evidence supporting free trade.","translation":"その経済学者は、自由貿易を支持する数十年の証拠を無視して、保護主義のための、いまだに反論されている議論を提示した。","type":"adjective","meaning_category":"Disproven argument"},{"sentence":"The still-refuted theory of spontaneous generation continues to fascinate historians of science.","translation":"自然発生説という、いまだに反論されている理論は、科学史家を魅了し続けている。","type":"adjective","meaning_category":"Disproven theory"}]}