{"word":"semireflexive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(文法)準再帰的な","english_definition":"(grammar) Relating to a verb that is used with a reflexive pronoun but where the action does not fully reflect back on the subject.","examples":[{"sentence":"'Se laver' is a semireflexive verb in French.","translation":"「Se laver」はフランス語の準再帰動詞です。"},{"sentence":"Semireflexive verbs often express a change in state.","translation":"準再帰動詞はしばしば状態の変化を表します。"}],"collocations":["semireflexive verb","semireflexive construction"],"synonyms":["middle voice","reflexive"],"antonyms":["non-reflexive","transitive"]}],"etymology":{"value":"'Semi-' (半分) + 'reflexive' (再帰的な).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiːrɪˈflɛksɪv/","syllables":"se-mi-re-flex-ive"},"inflection":{"notes":"Adjectives do not inflect in English, other than with comparative/superlative forms which are rare for this word."},"usage_notes":{"explanation":"A semireflexive verb is one that uses a reflexive pronoun, but the action doesn't fully reflect back onto the subject in the same way as a true reflexive verb. Often, the pronoun indicates involvement or a change in state, rather than the subject performing an action on itself. These are more common in some languages (like Romance languages) than in English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He semireflexived himself.","correct":"✓ He used a semireflexive verb.","note":"'Semireflexive' is an adjective, not a verb. You can't 'semireflexive' something. You can use a semireflexive verb or construction."}],"priority":"★★☆"},"related_words":{"derivatives":["semireflexivity (noun)"],"phrasal_verbs":[],"related_terms":["reflexive pronoun","verb","grammar","syntax"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semireflexive' is a grammatical term used to describe verbs that are used with reflexive pronouns, but where the action doesn't fully reflect back on the subject. This is a more advanced grammatical concept, often encountered in the study of languages like French or Spanish. Understanding this term requires a solid foundation in grammar and syntax."},"example_sentences":[{"sentence":"The verb 'to worry' can be used in a semireflexive way: 'He worries himself too much'.","translation":"動詞「to worry」は準再帰的な方法で使用できます。「He worries himself too much（彼は心配しすぎる）」","type":"example","meaning_category":"Grammar"},{"sentence":"Semireflexive constructions are more common in Romance languages than in English.","translation":"準再帰的な構造は、英語よりもロマンス語でより一般的です。","type":"example","meaning_category":"Grammar"}]}