{"word":"constructibility","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"構成可能性、作図可能性","english_definition":"The property of being constructible, especially in mathematics; the ability to be constructed or drawn using only a compass and straightedge.","examples":[{"sentence":"The constructibility of a regular pentagon was proven by Euclid.","translation":"正五角形の作図可能性はユークリッドによって証明されました。"},{"sentence":"The constructibility of certain numbers is related to the solutions of polynomial equations.","translation":"特定の数の構成可能性は、多項式方程式の解と関連しています。"}],"collocations":["constructibility of a polygon (多角形の作図可能性)","constructibility of a number (数の構成可能性)","geometric constructibility (幾何学的構成可能性)"],"synonyms":["buildability","feasibility","achievability"],"antonyms":["non-constructibility","impossibility"],"related_terms":["constructible (作図可能な)","compass and straightedge (コンパスと定規)","Euclidean geometry (ユークリッド幾何学)"]}],"etymology":{"value":"Derived from 'constructible' (able to be constructed), which comes from 'construct' (to build or form) + '-ible' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˌstrʌktəˈbɪləti/","syllables":"con-struct-i-bil-i-ty"},"inflection":{"noun_plural":"constructibilities"},"usage_notes":{"explanation":"'Constructibility' typically refers to the mathematical concept of whether a geometric figure or number can be constructed using only a compass and straightedge. It is a fundamental concept in Euclidean geometry.","priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Constructibility' is a technical term primarily used in mathematics, specifically in geometry. It refers to whether a geometric figure or number can be created using only a compass and straightedge. Understanding this term requires familiarity with mathematical concepts and vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The proof of the non-constructibility of angle trisection using only a compass and straightedge is a classic result in mathematics.","translation":"コンパスと定規だけを用いた角の三等分線の非構成可能性の証明は、数学における古典的な結果です。","type":"general","meaning_category":"mathematics"},{"sentence":"The field extension theory provides tools to determine the constructibility of algebraic numbers.","translation":"体の拡大理論は、代数的数の構成可能性を決定するためのツールを提供します。","type":"technical","meaning_category":"mathematics"}]}