{"word":"intermixedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"入り混じって、混ざり合って","english_definition":"In an intermixed manner; in a way that things are mixed together.","examples":[{"sentence":"The colors were intermixedly arranged in the painting.","translation":"その絵では、色が入り混じって配置されていた。"},{"sentence":"The two cultures developed intermixedly over time.","translation":"その二つの文化は、時を経て混ざり合いながら発展した。"}],"collocations":["arranged intermixedly","developed intermixedly"],"synonyms":["mingledly","blendedly","combinedly","mixedly"],"antonyms":["separately","distinctly","unmixedly"]}],"etymology":{"value":"\"Intermixed\" + \"-ly\". \"Intermixed\" is the past participle of \"intermix\", which comes from \"inter-\" (between, among) + \"mix\".","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈmɪkstli","syllables":"in-ter-mix-ed-ly"},"inflection":{"notes":"Adverb, no further inflection"},"usage_notes":{"explanation":"\"Intermixedly\" describes actions or arrangements where elements are blended or combined. It is not a commonly used word; \"intermixed\" or \"mixed together\" are more frequent alternatives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ingredients were intermixedly, making a delicious cake.","correct":"✓ The ingredients were intermixed, making a delicious cake.","note":"Using \"intermixed\" as an adjective to describe the state of the ingredients is more common than using \"intermixedly\" to describe how they were mixed. Alternatively, \"The ingredients were mixed together...\" is even more common."}],"priority":"★★☆"},"related_words":{"derivatives":["intermix (verb)","intermixture (noun)","intermixed (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"intermixedly\" is a relatively uncommon adverb that describes something done in a mixed or blended manner. It's more common to use the adjective \"intermixed\" or the phrase \"mixed together\" to convey the same meaning. Due to its rarity, it's best suited for advanced English speakers or specific contexts where a formal tone is required."},"example_sentences":[{"sentence":"The seeds were sown intermixedly to create a diverse garden.","translation":"多様な庭を作るために、種は入り混じって蒔かれた。","type":"adverb","meaning_category":"入り混じって"},{"sentence":"The languages of the region have developed intermixedly over centuries.","translation":"その地域の言語は何世紀にもわたって混ざり合いながら発展してきた。","type":"adverb","meaning_category":"混ざり合って"}]}