{"word":"dextroduction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(遺伝学)細菌接合において、遺伝物質(DNA)が供与菌から受容菌へ、プラスミドを介して一方的に伝達される現象。この際、伝達されるDNAは、プラスミドに組み込まれた細菌の染色体DNAの一部である。","english_definition":"(genetics) A unidirectional transfer of genetic material (DNA) from a donor bacterium to a recipient bacterium via a plasmid during bacterial conjugation, where the transferred DNA is a segment of the bacterial chromosome DNA incorporated into the plasmid.","examples":[{"sentence":"Dextroduction is a mechanism of horizontal gene transfer in bacteria.","translation":"デクストロダクションは、細菌における水平遺伝子伝達のメカニズムの一つである。"},{"sentence":"The study focused on the role of dextroduction in the spread of antibiotic resistance genes.","translation":"その研究は、抗生物質耐性遺伝子の拡散におけるデクストロダクションの役割に焦点を当てた。"}],"collocations":["plasmid-mediated dextroduction (プラスミドを介したデクストロダクション)","horizontal gene transfer (水平遺伝子伝達)","bacterial conjugation (細菌接合)","antibiotic resistance genes (抗生物質耐性遺伝子)"],"synonyms":["conjugation","transduction","transformation"],"antonyms":[]}],"etymology":{"value":"「dexter-」(ラテン語で「右」を意味する、ここでは一方的な伝達を指す) + 「introduction」(導入)","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdɛkstrəˈdʌkʃən/","syllables":"dex-tro-duc-tion"},"inflection":{"noun_plural":"dextroductions"},"usage_notes":{"explanation":"Dextroduction is a specialized term in genetics, specifically relating to bacterial conjugation and horizontal gene transfer. It describes a specific type of genetic transfer where chromosomal DNA is transferred via a plasmid. It's important to note that this is a unidirectional process.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dextroduction is the same as transduction.","correct":"✓ Dextroduction is a specific type of conjugation, while transduction involves a bacteriophage.","note":"Dextroduction is a form of conjugation, not transduction. Transduction involves a bacteriophage (bacterial virus) as the vector for DNA transfer."}],"priority":"★☆☆"},"related_words":{"derivatives":["dextroconjugation"],"related_terms":["plasmid","conjugation","transduction","transformation","horizontal gene transfer","bacterial genetics","chromosome","gene","DNA"]},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学論文でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dextroduction' is a highly specialized term used in the field of bacterial genetics. It refers to a specific mechanism of horizontal gene transfer where a plasmid carries a portion of the bacterial chromosome from a donor cell to a recipient cell during conjugation. Understanding this term requires a solid foundation in genetics, molecular biology, and bacterial physiology. It is not commonly used outside of scientific research and advanced studies in these fields."},"example_sentences":[{"sentence":"The researchers investigated the frequency of dextroduction in a population of E. coli.","translation":"研究者たちは、大腸菌の集団におけるデクストロダクションの頻度を調査した。","type":"scientific","meaning_category":"遺伝学"},{"sentence":"Dextroduction can contribute to the rapid spread of antibiotic resistance among bacteria.","translation":"デクストロダクションは、細菌間での抗生物質耐性の急速な拡散に寄与する可能性がある。","type":"scientific","meaning_category":"遺伝学"}]}