{"word":"Orthodoxness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"正統性、正教性、伝統墨守","english_definition":"The quality or state of being orthodox; adherence to correct or accepted creeds, doctrines, or practices.","examples":[{"sentence":"The orthodoxness of his views was never questioned.","translation":"彼の見解の正統性が疑われることはなかった。"},{"sentence":"The church emphasized the importance of orthodoxness in its teachings.","translation":"教会はその教えにおいて正統性の重要性を強調した。"}],"collocations":["religious orthodoxness (宗教的正統性)","political orthodoxness (政治的正統性)","strict orthodoxness (厳格な正統性)","maintain orthodoxness (正統性を維持する)","challenge orthodoxness (正統性に異議を唱える)"],"synonyms":["conformity","orthodoxy","traditionalism","conventionality","doctrinal purity","strict adherence"],"antonyms":["heterodoxy","unorthodoxy","nonconformity","deviation","heresy"]}],"etymology":{"value":"Derived from 'orthodox,' which comes from the Greek 'orthos' (straight, correct) + 'doxa' (opinion, belief). The suffix '-ness' turns the adjective into a noun, indicating the state or quality of being orthodox.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːrθədɒksnəs/","syllables":"or-tho-dox-ness"},"inflection":{"noun_plural":"Orthodoxnesses (rarely used)"},"usage_notes":{"explanation":"'Orthodoxness' refers to the degree to which something aligns with established or traditional beliefs, especially in religion or ideology. It is often used in contexts where adherence to a specific set of doctrines or practices is considered important. The term can sometimes carry a negative connotation when it implies rigidity or resistance to change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orthodoxness of the experiment was questioned because it used new methods.","correct":"✓ The orthodoxy of the experiment was questioned because it used new methods.","note":"While 'orthodoxness' is a valid word, 'orthodoxy' is more commonly used to refer to the state of being orthodox. 'Orthodoxy' is generally preferred in formal writing."}],"priority":"★☆☆"},"related_words":{"derivatives":["orthodox (adjective)","orthodoxy (noun)","orthodoxly (adverb)"],"antonyms":["heterodoxness","unorthodoxness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orthodoxness' is a relatively uncommon noun that describes the extent to which something adheres to established or traditional beliefs and practices. It's often used in discussions about religion, politics, or ideology, where maintaining conformity to a specific set of doctrines is emphasized. While grammatically correct, the term 'orthodoxy' is generally more frequently used and preferred in formal writing to convey the same meaning. Understanding this word requires a grasp of abstract concepts and formal vocabulary.","translation":"「Orthodoxness」は、確立されたまたは伝統的な信念や慣習にどれだけ従っているかを表す、比較的まれな名詞です。特定の教義への適合性を重視する宗教、政治、またはイデオロギーに関する議論でよく使用されます。文法的には正しいですが、同じ意味を伝えるためには、一般的に「orthodoxy」という用語の方がより頻繁に使用され、正式な文章で推奨されます。この単語を理解するには、抽象的な概念と正式な語彙を理解する必要があります。"},"example_sentences":[{"sentence":"The scholar examined the orthodoxness of the ancient texts.","translation":"学者は古代文書の正統性を検証した。","type":"noun","meaning_category":"正統性"},{"sentence":"The group valued orthodoxness over innovation.","translation":"そのグループは革新よりも正統性を重視した。","type":"noun","meaning_category":"伝統墨守"}]}