{"word":"counterdoctrine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A doctrine that opposes or contradicts another doctrine.","english_definition":"A doctrine that is formulated in opposition to or as a refutation of an existing doctrine.","examples":[{"sentence":"The politician presented a counterdoctrine to the prevailing economic theory.","translation":"その政治家は、一般的な経済理論に対する対抗ドクトリンを提示した。"},{"sentence":"Some religious scholars developed a counterdoctrine to challenge traditional interpretations of scripture.","translation":"一部の宗教学者は、聖書の伝統的な解釈に異議を唱えるための対抗ドクトリンを開発した。"}],"collocations":["develop a counterdoctrine","present a counterdoctrine","challenge a doctrine with a counterdoctrine"],"synonyms":["antidote","alternative doctrine","opposing theory","rebuttal"],"antonyms":["doctrine","orthodoxy","accepted belief","prevailing theory"]}],"etymology":{"value":"Formed from \"counter-\" (meaning against or opposite) and \"doctrine\" (a belief or set of beliefs held and taught by a church, political party, or other group).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkaʊntərˈdɒktrɪn/","syllables":"coun-ter-doc-trine"},"inflection":{"noun_plural":"counterdoctrines"},"usage_notes":{"explanation":"The term \"counterdoctrine\" is used to describe a set of beliefs or principles that directly oppose or challenge an established or widely accepted doctrine. It is often used in contexts such as politics, religion, and philosophy, where differing viewpoints and ideologies clash.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The counterdoctrine was the same as the original doctrine.","correct":"✓ The counterdoctrine was the opposite of the original doctrine.","note":"A counterdoctrine, by definition, opposes the original doctrine, so it cannot be the same."},{"incorrect":"✗ Counterdoctrine is only used in science.","correct":"✓ Counterdoctrine can be used in various fields such as politics, religion, and philosophy.","note":"Counterdoctrines are not limited to science and can appear in any field where doctrines exist."}],"priority":"★★☆"},"related_words":{"derivatives":["counterdoctrinal (adjective)"],"phrases":["formulate a counterdoctrine","implement a counterdoctrine"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"counterdoctrine\" refers to a set of beliefs or principles that are created to oppose or challenge an existing, widely accepted doctrine. It's used in situations where there are conflicting ideas, such as in politics, religion, or philosophy. Understanding this word requires a good grasp of abstract concepts and the ability to recognize opposing viewpoints."},"example_sentences":[{"sentence":"The new political party introduced a counterdoctrine that advocated for decentralized government.","translation":"その新しい政党は、地方分権化された政府を提唱する対抗ドクトリンを導入した。","type":"noun","meaning_category":"opposing doctrine"},{"sentence":"The scientist's counterdoctrine challenged the long-held assumptions of the field.","translation":"その科学者の対抗ドクトリンは、その分野で長年信じられてきた前提に異議を唱えた。","type":"noun","meaning_category":"opposing doctrine"}]}