{"word":"involucel","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小苞葉（しょうほうよう）：小花序の基部を囲む1つまたは複数の小さな苞葉の輪。","english_definition":"A whorl of small bracts surrounding a partial inflorescence.","examples":[{"sentence":"The involucel is a key characteristic for identifying certain plant species.","translation":"小苞葉は特定の植物種を識別するための重要な特徴です。"}],"collocations":["possessing an involucel","involucel morphology"],"synonyms":["bractlet","secondary involucre"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'involucrum,' meaning 'wrapper' or 'covering,' with the diminutive suffix '-el.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈvɒljuːˌsɛl/","syllables":"in-vol-u-cel"},"inflection":{"noun_plural":"involucels"},"usage_notes":{"explanation":"The term 'involucel' is primarily used in botany to describe a specific type of structure found in certain plants, particularly those with compound inflorescences. It refers to a set of small bracts that surround individual flower clusters within a larger inflorescence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The involucre is the same as the involucel.","correct":"✓ The involucre surrounds the entire inflorescence, while the involucel surrounds a smaller cluster of flowers within the inflorescence.","note":"An involucre is a larger structure that surrounds an entire inflorescence, whereas an involucel surrounds a smaller part of the inflorescence."}],"priority":"★☆☆"},"related_words":{"derivatives":["involucre"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Involucel' is a technical botanical term used to describe a specific structure in plants. It is unlikely to be encountered outside of specialized botanical contexts. Understanding the term requires a familiarity with botanical terminology related to plant structures and inflorescences."},"example_sentences":[{"sentence":"The presence of an involucel distinguishes this species from closely related taxa.","translation":"小苞葉の存在が、この種を近縁の分類群と区別します。","type":"noun","meaning_category":"botany"},{"sentence":"Careful observation of the involucel is needed for accurate plant identification.","translation":"正確な植物の識別には、小苞葉の注意深い観察が必要です。","type":"noun","meaning_category":"botany"}]}