{"word":"emblematology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"図像学の一分野で、紋章、標章、寓意図像の研究","english_definition":"The study of emblems, which are symbolic images or figures that convey a moral or allegorical message, often accompanied by a motto and explanatory text.","examples":[{"sentence":"Emblematology helps us understand the symbolic language of Renaissance art.","translation":"図像学は、ルネサンス美術の象徴的な言語を理解するのに役立ちます。"},{"sentence":"The professor specialized in emblematology and its influence on 17th-century literature.","translation":"その教授は、図像学とそれが17世紀の文学に与えた影響を専門としていました。"}],"collocations":["study of emblems","Renaissance emblematology","17th-century emblematology","iconography and emblematology"],"synonyms":["symbolism","iconography","allegory","typology"],"antonyms":[]}],"etymology":{"value":"Derived from 'emblem' (from Greek 'emblema', meaning an inserted ornament) + '-ology' (the study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌembləməˈtɒlədʒi/","syllables":"em-ble-ma-tol-o-gy"},"inflection":{"noun_plural":"emblematologies"},"usage_notes":{"explanation":"Emblematology is a specialized field within art history and cultural studies that focuses on the interpretation of emblems. Emblems are distinct from symbols in that they typically combine a visual image (pictura), a motto (inscriptio), and an explanatory text (subscriptio) to convey a specific moral, allegorical, or didactic message. The study of emblematology is crucial for understanding the cultural and intellectual context of early modern Europe, where emblem books were widely popular.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying emblems, so he is an emblematologistist.","correct":"✓ He is studying emblems, so he is an emblematologist.","note":"The correct term for a person who studies emblematology is 'emblematologist,' not 'emblematologistist.'"},{"incorrect":"✗ Emblematology is the same as iconography.","correct":"✓ Emblematology is related to iconography, but it specifically focuses on emblems, which are a combination of image, motto, and text.","note":"While related, emblematology is more specific than iconography. Iconography is the broader study of visual images and their symbolic meanings, while emblematology focuses on the specific genre of emblems."}],"priority":"★★☆"},"related_words":{"derivatives":["emblem (noun): a symbolic picture or design used to represent something.","emblematic (adjective): serving as a symbol of a particular quality or concept; symbolic.","emblematist (noun): a person who creates or studies emblems.","emblematize (verb): to represent by an emblem.","iconography (noun): the study of visual images and their symbolic meanings.","allegory (noun): a story, poem, or picture that can be interpreted to reveal a hidden meaning, typically a moral or political one."],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Emblematology' is a highly specialized term used in art history and cultural studies. It refers to the study of emblems, which are symbolic images or figures often accompanied by a motto and explanatory text. Understanding this term requires familiarity with art historical concepts and the ability to interpret complex symbolic representations. This term is not commonly used outside of academic contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scholar's expertise in emblematology allowed him to decipher the hidden meanings in the painting.","translation":"その学者の図像学の専門知識により、彼は絵画に隠された意味を解読することができました。","type":"general","meaning_category":"study of emblems"},{"sentence":"Emblematology provides valuable insights into the moral and ethical values of the 16th century.","translation":"図像学は、16世紀の道徳的および倫理的価値観に関する貴重な洞察を提供します。","type":"academic","meaning_category":"study of emblems"},{"sentence":"His research combined emblematology with the study of early printing practices.","translation":"彼の研究は、図像学と初期の印刷慣行の研究を組み合わせたものでした。","type":"academic","meaning_category":"study of emblems"}]}