{"word":"Parsi","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パールシー：インドに定住したゾロアスター教徒の子孫","english_definition":"A descendant of Zoroastrians who fled Persia (modern Iran) and settled in India to avoid religious persecution by Muslims.","examples":[{"sentence":"The Parsi community in India has a rich cultural heritage.","translation":"インドのパールシーコミュニティは豊かな文化遺産を持っています。"},{"sentence":"Many Parsis are successful entrepreneurs and philanthropists.","translation":"多くのパールシーは、成功した起業家や慈善家です。"}],"collocations":["Parsi community","Parsi culture","Parsi cuisine","Parsi Zoroastrian","Parsi heritage"],"synonyms":["Zoroastrian Indian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"パールシーの、パールシーに関する","english_definition":"Of or relating to the Parsis or their culture.","examples":[{"sentence":"Parsi cuisine is known for its unique blend of Persian and Indian flavors.","translation":"パールシー料理は、ペルシャとインドの独特な風味が融合していることで知られています。"},{"sentence":"The Parsi fire temples are important religious sites.","translation":"パールシーの拝火神殿は重要な宗教的場所です。"}],"collocations":["Parsi traditions","Parsi wedding","Parsi temple","Parsi beliefs"],"synonyms":["Zoroastrian"],"antonyms":[]}],"etymology":{"value":"From Persian 'Parsi', meaning 'Persian'. Refers to the Zoroastrians who migrated from Persia to India.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɑːrsi/","syllables":"Par-si"},"inflection":{"noun_plural":"Parsis"},"usage_notes":{"explanation":"The term 'Parsi' specifically refers to the Zoroastrian community that migrated from Persia (modern-day Iran) to India centuries ago to escape religious persecution. They are distinct from other Zoroastrians who may reside elsewhere. The Parsi community has made significant contributions to Indian society in various fields, including business, education, and the arts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Persian Parsi.","correct":"✓ He is a Parsi.","note":"'Parsi' already implies Persian origin, so 'Persian Parsi' is redundant."},{"incorrect":"✗ Parsis are Hindu.","correct":"✓ Parsis are Zoroastrian.","note":"Parsis are followers of Zoroastrianism, not Hinduism."}],"priority":"★★☆"},"related_words":{"derivatives":["Parsiana (relating to Parsis)"],"phrases":["Atash Behram (highest grade of Parsi fire temple)","Dokhma (Parsi Tower of Silence)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specific to cultural and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Parsi' refers to a specific ethno-religious group, descendants of Zoroastrians who migrated from Persia to India. Understanding this term requires knowledge of Indian history and religious diversity. It is not a commonly used word outside of contexts discussing these specific communities or related topics. Therefore, familiarity with this term indicates a higher level of reading comprehension and cultural awareness."},"example_sentences":[{"sentence":"The **Parsi** community is known for its charitable contributions.","translation":"パールシーコミュニティは慈善活動への貢献で知られています。","type":"noun","meaning_category":"パールシー（人々）"},{"sentence":"She is studying **Parsi** culture for her thesis.","translation":"彼女は論文のためにパールシー文化を研究しています。","type":"adjective","meaning_category":"パールシーの"}]}