{"word":"spoofing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(IT)スプーフィング：送信元を偽装する行為、詐称行為","english_definition":"(IT) The act of disguising a communication from an unknown source as being from a known, trusted source. This can be done by falsifying information such as the sender's email address, phone number, or IP address.","examples":[{"sentence":"Email spoofing is a common technique used in phishing attacks.","translation":"メールスプーフィングは、フィッシング攻撃でよく使われる手法です。"},{"sentence":"Call spoofing can make it difficult to identify the real caller.","translation":"コールスプーフィングは、実際の電話の発信者を特定することを困難にする可能性があります。"},{"sentence":"IP address spoofing can be used to launch denial-of-service attacks.","translation":"IPアドレススプーフィングは、サービス拒否攻撃を開始するために使用されることがあります。"}],"collocations":["email spoofing","caller ID spoofing","IP address spoofing","DNS spoofing","ARP spoofing"],"synonyms":["masquerading","falsification","impersonation","forgery"],"antonyms":["authentication","verification","validation"]},{"part_of_speech":"noun","definition":"(一般)パロディ、茶番、風刺","english_definition":"A parody or send-up, often humorous, that imitates something in a mocking or satirical way.","examples":[{"sentence":"The movie is a spoofing of classic spy films.","translation":"その映画は、古典的なスパイ映画のパロディです。"},{"sentence":"The comedy show featured a spoofing of the latest political debates.","translation":"そのコメディー番組では、最新の政治討論のパロディが取り上げられました。"},{"sentence":"Their performance was a spoofing of a famous opera.","translation":"彼らのパフォーマンスは、有名なオペラのパロディでした。"}],"collocations":["movie spoofing","political spoofing","musical spoofing"],"synonyms":["parody","satire","send-up","take-off","burlesque"],"antonyms":["serious adaptation","tribute"]}],"etymology":{"value":"The term 'spoofing' comes from the verb 'to spoof,' which originally meant to deceive or trick someone in a lighthearted way. The IT sense evolved from this general meaning of deception.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspuːfɪŋ/","syllables":"spoof-ing"},"inflection":{"noun_plural":"spoofings"},"usage_notes":{"explanation":"In IT, 'spoofing' refers to the act of disguising a communication to appear as if it's from a trusted source. This is often used in malicious attacks. In general usage, 'spoofing' refers to a humorous parody or imitation. Context is key to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I was spoofing on the phone.","correct":"✓ I was spoofed on the phone. / ✓ I was a victim of call spoofing.","note":"When someone receives a spoofed call, they are 'spoofed,' or they are a 'victim of spoofing.' 'Spoofing on the phone' would imply that the person is the one doing the spoofing, not receiving it."},{"incorrect":"✗ The spoofing was very seriously.","correct":"✓ The spoofing was very serious.","note":"'Serious' is an adjective describing the spoofing. 'Seriously' is an adverb."}],"priority":"★★☆"},"related_words":{"derivatives":["spoof (verb, noun)","spoofer (noun)"],"phrasal_verbs":[],"related_terms":["phishing","malware","cybersecurity","parody","satire"]},"level_frequency":{"CEFR":"B2 (IT context), C1 (general usage)","frequency_google_ngram":"Relatively low frequency, more common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spoofing' has two main meanings. In the context of IT and cybersecurity, it refers to the act of disguising a communication (like an email or phone call) to appear as if it's from a trusted source. This is often done for malicious purposes, like phishing. In a more general sense, 'spoofing' refers to a humorous parody or imitation of something. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★★"},"example_sentences":[{"sentence":"The attacker used email **spoofing** to trick employees into revealing their passwords.","translation":"攻撃者は、メールスプーフィングを使って、従業員を騙してパスワードを明らかにさせました。","type":"noun","meaning_category":"IT (詐称)"},{"sentence":"The comedy troupe's latest show is a **spoofing** of popular reality TV programs.","translation":"そのコメディ劇団の最新のショーは、人気のあるリアリティ番組のパロディです。","type":"noun","meaning_category":"パロディ"}]}