{"word":"Ultraism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウルトライズム：20世紀初頭のスペインで起こった文学運動。モダニズムの一形態で、特に詩において、比喩、イメージ、および自由詩を重視した。","english_definition":"A literary movement that originated in Spain in the early 20th century. A form of modernism, it emphasized metaphor, imagery, and free verse, particularly in poetry.","examples":[{"sentence":"Ultraism sought to break with traditional poetic forms.","translation":"ウルトライズムは伝統的な詩の形式との決別を試みた。"},{"sentence":"Key figures in Ultraism included writers like Jorge Luis Borges.","translation":"ウルトライズムの主要な人物には、ホルヘ・ルイス・ボルヘスのような作家が含まれていた。"}],"collocations":["literary movement","avant-garde","modernism","poetic style","free verse"],"synonyms":["avant-gardism","modernism"],"antonyms":["traditionalism","classicism"]}],"etymology":{"value":"The term 'Ultraism' comes from the Spanish word 'ultra,' meaning 'beyond.' The suffix '-ism' denotes a doctrine, principle, or theory. Thus, Ultraism signifies a movement that sought to go 'beyond' existing literary conventions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌltrəˌɪzəm/","syllables":"ul-tra-i-sm"},"inflection":{"noun_plural":"Ultraisms"},"usage_notes":{"explanation":"Ultraism was a short-lived but influential literary movement, primarily in Spain and Latin America. It represented a rejection of narrative and descriptive elements in poetry, favoring instead a focus on sensory experience and subjective interpretation. The movement sought to create a new, more modern form of artistic expression. It's important to note that Ultraism is distinct from other uses of the prefix 'ultra-' which often denote extremism in politics or other contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ultraism is a political ideology.","correct":"✓ Ultraism is a literary movement.","note":"Ultraism is primarily a literary movement, not a political ideology. Although the term 'ultra' can sometimes imply extremism in other contexts, in this case, it refers to a specific artistic movement."}],"priority":"★☆☆"},"related_words":{"derivatives":["ultraist (noun: ウルトライズムの信奉者、形容詞: ウルトライズムの)"],"related_movements":["Creacionismo (Creationism)","Futurism","Cubism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - specialized term related to literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ultraism' is a specialized term referring to a specific literary movement in the early 20th century. It is not a commonly used word outside of the context of literary studies or art history. Understanding the concept requires familiarity with modernism and avant-garde movements. The word itself is derived from 'ultra,' meaning 'beyond,' indicating the movement's aim to go beyond existing literary conventions."},"example_sentences":[{"sentence":"The principles of Ultraism can be seen in the early works of some Latin American poets.","translation":"ウルトライズムの原則は、一部のラテンアメリカの詩人の初期の作品に見ることができる。","type":"general"},{"sentence":"Ultraism rejected the sentimentality and traditional forms of previous poetic styles.","translation":"ウルトライズムは、以前の詩のスタイルの感傷主義と伝統的な形式を拒否した。","type":"characteristics"},{"sentence":"Although short-lived, Ultraism influenced the development of later literary movements.","translation":"短命であったが、ウルトライズムは後の文学運動の発展に影響を与えた。","type":"impact"}]}