{"word":"ideoplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"観念形成; 観念可塑性","english_definition":"The process or faculty of forming mental images or ideas; the power of the mind to create or modify ideas.","examples":[{"sentence":"Ideoplasty is a key concept in understanding how individuals develop their worldview.","translation":"観念形成は、個人がどのように世界観を形成するかを理解する上で重要な概念です。"},{"sentence":"The artist's ideoplasty allowed him to create incredibly imaginative works.","translation":"その芸術家の観念形成力によって、彼は信じられないほど想像力豊かな作品を創作することができました。"}],"collocations":["mental ideoplasty","creative ideoplasty"],"synonyms":["imagination","conceptualization","mental imagery","idea formation"],"antonyms":["concrete thinking","literal interpretation"]}],"etymology":{"value":"Derived from the Greek words 'idea' (form, shape, notion) and 'plassein' (to mold, shape).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪdiˈɒplæsti/","syllables":"i-de-o-plas-ty"},"inflection":{"noun_plural":"ideoplasties"},"usage_notes":{"explanation":"Ideoplasty refers to the mental process of creating or shaping ideas and mental images. It is often used in discussions of creativity, imagination, and cognitive development. The term is relatively uncommon in everyday language but may appear in academic or philosophical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ideoplasty of the building was amazing.","correct":"✓ The design or concept of the building was amazing.","note":"Ideoplasty refers to a mental process, not a physical object. Use 'design' or 'concept' instead when referring to a building."}],"priority":"★☆☆"},"related_words":{"derivatives":["ideoplastic (adjective)"],"related_concepts":["mental representation","cognitive psychology","imagination","creativity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ideoplasty' is a specialized term referring to the mental capacity to form and manipulate ideas and images. It is primarily used in academic or theoretical contexts related to psychology, philosophy, or art. Understanding this word requires a strong vocabulary and familiarity with abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"His remarkable ideoplasty enabled him to envision complex solutions to intricate problems.","translation":"彼の優れた観念形成力によって、彼は複雑な問題に対する複雑な解決策を思い描くことができました。","type":"general","meaning_category":"観念形成"},{"sentence":"The study of ideoplasty helps us understand how artists and innovators generate novel ideas.","translation":"観念形成の研究は、芸術家や革新者がどのように斬新なアイデアを生み出すかを理解するのに役立ちます。","type":"academic","meaning_category":"観念形成"}]}