{"word":"Amanitins","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A class of cyclic peptides produced by several species of *Amanita* mushrooms, including α-amanitin, β-amanitin, and γ-amanitin; potent inhibitors of RNA polymerase II, leading to liver and kidney failure if ingested.","english_definition":"A class of cyclic peptides produced by several species of *Amanita* mushrooms, including α-amanitin, β-amanitin, and γ-amanitin; potent inhibitors of RNA polymerase II, leading to liver and kidney failure if ingested.","examples":[{"sentence":"Amanitins are responsible for the majority of deaths related to mushroom poisoning.","translation":"アマトキシン類は、キノコ中毒による死亡の大部分の原因となっている。"},{"sentence":"The presence of amanitins in mushrooms can be detected using chemical tests.","translation":"キノコ中のアマトキシン類の存在は、化学的検査によって検出できる。"}],"collocations":["α-amanitin","mushroom poisoning","RNA polymerase II inhibition","liver failure","kidney failure"],"synonyms":["amatoxins"],"antonyms":[]}],"etymology":{"value":"Derived from *Amanita*, the genus of mushrooms that produce these toxins.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæməˈnaɪtɪnz/","syllables":"a-ma-ni-tins"},"inflection":{"noun_plural":"Amanitins"},"usage_notes":{"explanation":"'Amanitins' refers specifically to a group of toxins found in certain *Amanita* mushrooms, particularly the death cap (*Amanita phalloides*) and destroying angel (*Amanita virosa*). These toxins are dangerous because they inhibit RNA polymerase II, a crucial enzyme for synthesizing mRNA, leading to cell death, especially in the liver and kidneys. There is no known antidote, and treatment focuses on supportive care and, in severe cases, liver transplantation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Amanitin is a type of mushroom.","correct":"✓ Amanitin is a type of toxin found in certain mushrooms.","note":"Amanitin is not a mushroom itself, but a toxin produced by certain mushrooms."},{"incorrect":"✗ Cooking destroys amanitins.","correct":"✓ Cooking does not destroy amanitins.","note":"Amanitins are heat-stable and are not destroyed by cooking."}],"priority":"★★☆"},"related_words":{"derivatives":["amanitin (singular form)","Amanita (genus of mushrooms)","amatoxin (broader term for related toxins)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amanitins' is a technical term referring to a group of highly toxic cyclic peptides found in certain *Amanita* mushrooms. The word is primarily encountered in scientific literature, toxicology reports, or discussions related to mushroom poisoning. Due to the severe health consequences associated with these toxins, understanding the term is crucial in contexts related to public health and safety.","priority":"★★☆"},"example_sentences":[{"sentence":"Ingestion of mushrooms containing amanitins can lead to acute liver failure.","translation":"アマトキシン類を含むキノコの摂取は、急性肝不全を引き起こす可能性がある。","type":"general","meaning_category":"toxicity"},{"sentence":"Researchers are studying the mechanism of action of amanitins to develop potential treatments for mushroom poisoning.","translation":"研究者たちは、キノコ中毒の潜在的な治療法を開発するために、アマトキシン類の作用機序を研究している。","type":"research","meaning_category":"research"},{"sentence":"The concentration of amanitins varies depending on the species and the maturity of the mushroom.","translation":"アマトキシン類の濃度は、キノコの種類や成熟度によって異なる。","type":"scientific","meaning_category":"scientific"}]}