{"word":"Röntgenologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"レントゲン専門医、放射線科医","english_definition":"A physician specializing in radiology, particularly the interpretation of X-rays and other radiographic images.","examples":[{"sentence":"The Röntgenologist reviewed the patient's chest X-ray to diagnose the pneumonia.","translation":"レントゲン専門医は肺炎を診断するために患者の胸部X線写真を調べた。"},{"sentence":"The Röntgenologist consulted with the surgeon regarding the best imaging techniques for the upcoming procedure.","translation":"レントゲン専門医は、今後の手術に最適な画像診断技術について外科医と協議した。"}],"collocations":["consult with a Röntgenologist","refer to a Röntgenologist","review X-rays with a Röntgenologist"],"synonyms":["radiologist","diagnostic radiologist","imaging specialist"],"antonyms":[]}],"etymology":{"value":"The term \"Röntgenologist\" is derived from Wilhelm Conrad Röntgen, the German physicist who discovered X-rays in 1895. The suffix \"-ologist\" denotes a specialist in a particular field of study.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛntɡəˈnɒlədʒɪst/","syllables":"rent-ge-nol-o-gist"},"inflection":{"noun_plural":"Röntgenologists"},"usage_notes":{"explanation":"The term \"Röntgenologist\" is somewhat dated but still recognized. The more common and contemporary term is \"radiologist.\" Both terms refer to a medical doctor who specializes in the use of imaging technologies, such as X-rays, CT scans, MRI, and ultrasound, to diagnose and treat diseases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a rontgenologist.","correct":"✓ He is a Röntgenologist.","note":"The word must be capitalized as it is derived from a proper noun (Wilhelm Röntgen)."},{"incorrect":"✗ She went to the rontgenologist for a checkup.","correct":"✓ She went to the radiologist for a checkup.","note":"'Radiologist' is the more commonly used term."}],"priority":"★★☆"},"related_words":{"derivatives":["Röntgenology (noun: the study and application of X-rays)","radiology (noun: the branch of medicine dealing with X-rays and other forms of radiant energy used in diagnosis and treatment of disease)","radiologist (noun: a medical specialist in radiology)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term 'radiologist' is much more common.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Röntgenologist\" refers to a medical doctor who specializes in radiology, particularly in the use and interpretation of X-rays. However, it is a somewhat outdated term, and the more commonly used term is \"radiologist.\" The word is derived from Wilhelm Conrad Röntgen, the discoverer of X-rays. It is primarily used in medical contexts and is not a common term in everyday conversation."},"example_sentences":[{"sentence":"The Röntgenologist examined the X-ray images for any signs of fracture.","translation":"レントゲン専門医は、骨折の兆候がないかX線画像を調べた。","type":"noun","meaning_category":"medical"},{"sentence":"The hospital's radiology department employs several Röntgenologists.","translation":"その病院の放射線科には数名のレントゲン専門医が勤務している。","type":"noun","meaning_category":"medical"}]}