{"word":"Kewpie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キューピー人形","english_definition":"A brand of doll, often made of bisque or plastic, characterized by its chubby, cherubic appearance.","examples":[{"sentence":"She collected Kewpie dolls.","translation":"彼女はキューピー人形を集めていた。"},{"sentence":"The vintage Kewpie doll was very valuable.","translation":"そのビンテージのキューピー人形はとても価値があった。"}],"collocations":["Kewpie doll collection","vintage Kewpie","Kewpie figurine"],"synonyms":["doll","figurine"],"antonyms":[]},{"part_of_speech":"noun","definition":"キューピーマヨネーズ","english_definition":"A brand of Japanese mayonnaise known for its rich flavor and creamy texture, often associated with the Kewpie doll logo.","examples":[{"sentence":"I prefer Kewpie mayonnaise over other brands.","translation":"私は他のブランドよりもキューピーマヨネーズが好きだ。"},{"sentence":"Kewpie mayonnaise is a popular condiment in Japan.","translation":"キューピーマヨネーズは日本で人気のある調味料だ。"}],"collocations":["Kewpie mayonnaise","Kewpie mayo","Kewpie brand"],"synonyms":["Japanese mayonnaise"],"antonyms":[]}],"etymology":{"value":"The name 'Kewpie' comes from 'Cupid', the Roman god of love, reflecting the doll's cherubic appearance. The doll was created by American artist Rose O'Neill in the early 20th century. The mayonnaise brand adopted the name and image due to the association with babies and healthy eating.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkjuːpiː/","syllables":"Kew-pie"},"inflection":{"notes":"Plural form is 'Kewpies'"},"usage_notes":{"explanation":"'Kewpie' primarily refers to either the doll or the mayonnaise brand. Context is crucial to determine which meaning is intended. When discussing toys or collectibles, it likely refers to the doll. When discussing food or condiments, it likely refers to the mayonnaise.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new kewpie for my salad.","correct":"✓ I bought a new bottle of Kewpie mayonnaise for my salad.","note":"When referring to the mayonnaise, it's important to specify 'Kewpie mayonnaise' or 'Kewpie mayo' to avoid confusion with the doll."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_brands":["Hellmann's","Best Foods"],"related_items":["mayonnaise","doll","figurine"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Kewpie' is a term that can refer to two distinct things: a type of doll and a brand of mayonnaise. The doll is characterized by its chubby, cherubic appearance, while the mayonnaise is a Japanese brand known for its rich flavor. Understanding the context is key to interpreting the intended meaning. If the topic is toys or collectibles, it likely refers to the doll; if the topic is food or condiments, it likely refers to the mayonnaise."},"example_sentences":[{"sentence":"The little girl treasured her **Kewpie** doll.","translation":"その幼い女の子は自分のキューピー人形を大切にしていた。","type":"noun","meaning_category":"キューピー人形"},{"sentence":"I always use **Kewpie** mayonnaise in my potato salad.","translation":"私はいつもポテトサラダにキューピーマヨネーズを使う。","type":"noun","meaning_category":"キューピーマヨネーズ"}]}