{"word":"Thermokinematics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱運動学：熱力学と運動学を組み合わせた学問分野。温度変化が物体の運動に及ぼす影響や、運動が温度分布に与える影響などを研究する。","english_definition":"The study of the combined effects of thermodynamics and kinematics, dealing with the influence of temperature changes on the motion of objects and the effects of motion on temperature distribution.","examples":[{"sentence":"Thermokinematics is crucial in designing efficient heat engines.","translation":"熱運動学は効率的な熱機関を設計する上で重要である。"},{"sentence":"The principles of thermokinematics are applied in the analysis of thermal stresses in moving parts.","translation":"熱運動学の原理は、可動部品の熱応力解析に応用される。"}],"collocations":["heat engine design (熱機関設計)","thermal stress analysis (熱応力解析)","temperature distribution (温度分布)","motion analysis (運動解析)"],"synonyms":["thermo-mechanics","thermo-dynamics","heat transfer analysis"],"antonyms":[]}],"etymology":{"value":"'thermo-' (熱) + 'kinematics' (運動学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌθɜːrmoʊkɪnəˈmætɪks/","syllables":"ther-mo-ki-ne-ma-tics"},"inflection":{"noun_plural":"(通常は単数形で使用される)"},"usage_notes":{"explanation":"Thermokinematics is a specialized field often encountered in engineering and physics contexts. It is essential for understanding systems where both thermal and mechanical effects are significant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thermokinematics are important.","correct":"✓ Thermokinematics is important.","note":"熱運動学は学問分野を指すため、通常は単数扱いとなります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["thermokinetic (形容詞)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Thermokinematics is an advanced term used in specialized fields such as engineering and physics. It combines the principles of thermodynamics (the study of heat and energy) and kinematics (the study of motion) to analyze systems where both heat and motion are significant. Understanding this term requires a strong background in both physics and mathematics.","priority":"★★☆"},"example_sentences":[{"sentence":"The study of thermokinematics helps in optimizing the performance of internal combustion engines.","translation":"熱運動学の研究は、内燃機関の性能最適化に役立つ。","type":"general","meaning_category":"学問分野"},{"sentence":"Thermokinematics analysis is used to predict the behavior of materials under extreme temperature and motion conditions.","translation":"熱運動学解析は、極端な温度および運動条件下での材料の挙動を予測するために使用される。","type":"application","meaning_category":"応用"}]}