{"word":"polyamide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポリアミド、ポリアミド樹脂","english_definition":"A polymer containing repeating units linked by amide bonds.","examples":[{"sentence":"Nylon is a type of polyamide.","translation":"ナイロンはポリアミドの一種です。"},{"sentence":"Polyamides are used in textiles, automotive parts, and packaging.","translation":"ポリアミドは、繊維、自動車部品、包装に使用されています。"}],"collocations":["nylon polyamide","aromatic polyamide","aliphatic polyamide"],"synonyms":["nylon"],"antonyms":[]}],"etymology":{"value":"The term \"polyamide\" is derived from the combination of \"poly-\" (meaning many) and \"amide\" (referring to the amide bond, -CONH-).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈæmaɪd/","syllables":"pol-y-am-ide"},"inflection":{"noun_plural":"polyamides"},"usage_notes":{"explanation":"Polyamides are a class of polymers characterized by the presence of repeating amide bonds (-CONH-) in their main chain. They are known for their high strength, elasticity, and resistance to abrasion and chemicals. Nylon is the most well-known type of polyamide.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ polyamide is a metal.","correct":"✓ polyamide is a polymer.","note":"Polyamide is a type of plastic (polymer), not a metal."}],"priority":"★★☆"},"related_words":{"derivatives":["polyamide fiber","polyamide resin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Polyamide\" refers to a type of plastic material made up of long chains of molecules connected by amide links. These materials are known for being strong, flexible, and resistant to heat and chemicals. A common example of a polyamide is nylon, which is used in clothing, ropes, and many other products. Because of its technical nature, the word \"polyamide\" is more often used in scientific or industrial contexts rather than in everyday conversation."},"example_sentences":[{"sentence":"This jacket is made from a durable **polyamide** fabric.","translation":"このジャケットは丈夫なポリアミド生地で作られています。","type":"noun","meaning_category":"material"},{"sentence":"The properties of **polyamide** make it suitable for use in high-performance applications.","translation":"ポリアミドの特性により、高性能用途に適しています。","type":"noun","meaning_category":"properties"}]}