{"word":"butylated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ブチル化された","english_definition":"Having undergone butylation, a chemical process involving the addition of a butyl group to a molecule.","examples":[{"sentence":"Butylated hydroxytoluene (BHT) is a common antioxidant.","translation":"ブチルヒドロキシトルエン（BHT）は一般的な酸化防止剤です。"},{"sentence":"The butylated rubber showed improved resistance to degradation.","translation":"そのブチル化ゴムは、劣化に対する耐性が向上しました。"}],"collocations":["butylated hydroxytoluene (BHT)","butylated hydroxyanisole (BHA)","butylated vegetable oil"],"synonyms":["butyl-modified"],"antonyms":["unbutylated"]},{"part_of_speech":"verb","definition":"ブチル化する (過去分詞)","english_definition":"Past participle of butylate: to subject to butylation.","examples":[{"sentence":"The compound was butylated to improve its stability.","translation":"その化合物は、安定性を向上させるためにブチル化されました。"}],"collocations":["to be butylated"],"synonyms":["alkylated"],"antonyms":["dealkylated"]}],"etymology":{"value":"From the verb 'butylate,' which is derived from 'butyl' (a chemical group) + '-ate' (a suffix indicating a chemical process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbjuːtɪleɪtɪd/","syllables":"bu-tyl-a-ted"},"inflection":{"verb_forms":{"present_simple":["butylate","butylates"],"past_simple":"butylated","past_participle":"butylated","present_participle":"butylating"}},"usage_notes":{"explanation":"'Butylated' is primarily used in chemistry and related fields to describe substances that have undergone a chemical process called butylation. This process involves adding a butyl group (a chemical substituent with the formula -C4H9) to a molecule. Butylation is often performed to alter the properties of a substance, such as its stability, solubility, or reactivity. Common examples include butylated hydroxytoluene (BHT) and butylated hydroxyanisole (BHA), which are used as antioxidants in food and cosmetics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was butylated with vitamins.","correct":"✓ The food was fortified with vitamins.","note":"'Butylated' refers specifically to the addition of a butyl group. If vitamins are added, the correct term is 'fortified'."},{"incorrect":"✗ The rubber is butylated, so it's very elastic.","correct":"✓ The rubber is vulcanized, so it's very elastic.","note":"Elasticity in rubber is typically achieved through vulcanization, not butylation. Butylation is more likely to improve resistance to degradation."}],"priority":"★★☆"},"related_words":{"derivatives":["butylate (verb)","butylation (noun)","butyl (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'butylated' is a technical term primarily used in chemistry and related scientific fields. It describes a chemical process where a butyl group (-C4H9) is added to a molecule to modify its properties. Understanding this term requires a basic knowledge of organic chemistry. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The oil was butylated to prevent it from going rancid.","translation":"その油は、酸化を防ぐためにブチル化されました。","type":"verb","meaning_category":"化学処理"},{"sentence":"Butylated hydroxyanisole is used as a preservative in many processed foods.","translation":"ブチルヒドロキシアニソールは、多くの加工食品の保存料として使用されています。","type":"adjective","meaning_category":"化学処理された"}]}