{"word":"Disubstitution","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The replacement of two atoms or groups in a molecule by two other atoms or groups.","english_definition":"A chemical reaction in which two atoms or groups in a molecule are replaced by two other atoms or groups.","examples":[{"sentence":"Disubstitution of benzene leads to the formation of ortho-, meta-, and para- isomers.","translation":"ベンゼンの二置換反応は、オルト、メタ、パラ異性体の形成につながります。"}],"collocations":["disubstitution reaction","disubstituted benzene"],"synonyms":["double substitution"],"antonyms":["monosubstitution","substitution"]},{"part_of_speech":"noun","definition":"A molecule in which two atoms or groups have been replaced by two other atoms or groups.","english_definition":"A molecule that has undergone disubstitution.","examples":[{"sentence":"The disubstitution product was isolated and characterized by NMR spectroscopy.","translation":"二置換生成物は単離され、NMR分光法によって特性評価されました。"}],"collocations":["disubstitution product","disubstituted compound"],"synonyms":["disubstituted molecule"],"antonyms":["monosubstituted","unsubstituted"]}],"etymology":{"value":"From the prefix 'di-' (meaning two) + 'substitution' (the act of replacing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪsʌbstɪˈtjuːʃən/","syllables":"di-sub-sti-tu-tion"},"inflection":{"noun_plural":"Disubstitutions"},"usage_notes":{"explanation":"'Disubstitution' is primarily used in the context of organic chemistry to describe a reaction or a molecule that has undergone two substitution events. It's important to specify the positions of the substituents (e.g., ortho, meta, para) when discussing disubstituted aromatic compounds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction resulted in a disubstitution on only one carbon.","correct":"✓ The reaction resulted in disubstitution at two different positions.","note":"Disubstitution involves replacing two different atoms/groups, so it doesn't occur at a single position. It is important to clarify that the disubstitution happened at two different positions."}],"priority":"★☆☆"},"related_words":{"derivatives":["disubstituted","disubstituting"],"related_terms":["substitution","monosubstitution","trisubstitution","polysubstitution"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disubstitution' refers to a chemical process where two different atoms or groups within a molecule are replaced by two other atoms or groups. This term is mainly used in organic chemistry. Understanding this term requires a basic understanding of chemical reactions and molecular structures. The concept is more complex and is typically encountered in advanced chemistry courses or research settings."},"example_sentences":[{"sentence":"The disubstitution of chlorine atoms on the aromatic ring significantly altered the molecule's reactivity.","translation":"芳香環上の塩素原子の二置換は、分子の反応性を大幅に変化させました。","type":"noun","meaning_category":"chemical reaction"},{"sentence":"Analysis of the reaction mixture revealed the presence of several disubstituted products.","translation":"反応混合物の分析により、いくつかの二置換生成物の存在が明らかになりました。","type":"noun","meaning_category":"chemical product"}]}