{"word":"Lymphorrhea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リンパ漏（リンパ液が血管やリンパ管から漏れ出す状態）","english_definition":"The leakage of lymph from a damaged lymphatic vessel or lymphatic organ.","examples":[{"sentence":"Postoperative lymphorrhea is a common complication after lymph node dissection.","translation":"術後のリンパ漏は、リンパ節郭清後の一般的な合併症です。"},{"sentence":"The patient presented with persistent lymphorrhea from the surgical site.","translation":"患者は手術部位からの持続的なリンパ漏を呈した。"}],"collocations":["postoperative lymphorrhea (術後リンパ漏)","persistent lymphorrhea (持続的なリンパ漏)","lymphorrhea management (リンパ漏の管理)"],"synonyms":["lymph leakage","lymphatic fistula"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'lympha' (clear fluid) and 'rhoia' (flow).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪmfəˈriːə/","syllables":"lym-pho-rrhe-a"},"inflection":{"noun_plural":"lymphorrheas"},"usage_notes":{"explanation":"Lymphorrhea refers to the abnormal leakage of lymph fluid. It is often a complication of surgery, particularly after procedures involving the lymphatic system, such as lymph node dissection. It can also occur due to trauma, infection, or lymphatic disorders. Management of lymphorrhea typically involves compression therapy, wound care, and sometimes surgical intervention to repair the damaged lymphatic vessels.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lymphorrhea is a type of cancer.","correct":"✓ Lymphorrhea is a complication, not a type of cancer.","note":"Lymphorrhea is a condition where lymph fluid leaks, not a cancerous disease itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["lymph (リンパ)","lymphatic (リンパの)","edema (浮腫)","lymphedema (リンパ浮腫)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lymphorrhea' is a specialized medical term referring to the leakage of lymph fluid, typically after surgery or due to lymphatic system damage. It is not commonly used outside of medical contexts. Understanding requires knowledge of basic anatomy and physiology related to the lymphatic system.","priority":"★★☆"},"example_sentences":[{"sentence":"Conservative treatment is often the first approach to managing lymphorrhea.","translation":"保存的治療は、リンパ漏を管理するための最初の手段であることが多い。","type":"general","meaning_category":"リンパ漏の治療"},{"sentence":"The volume of lymphorrhea was measured daily to monitor the patient's progress.","translation":"患者の経過を観察するために、リンパ漏の量を毎日測定した。","type":"general","meaning_category":"リンパ漏のモニタリング"}]}