{"word":"adeems","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(法律) (遺贈を)無効にする、取り消す","english_definition":"(law) to revoke or satisfy (a legacy) by some act of the testator during his or her lifetime other than by execution of a will or codicil.","examples":[{"sentence":"The testator adeemed the specific bequest by selling the property before death.","translation":"遺言者は、死亡前に財産を売却したことにより、特定の遺贈を無効にした。"}],"collocations":["adeem a legacy","adeem a bequest"],"synonyms":["revoke","nullify","invalidate","extinguish"],"antonyms":["validate","confirm","ratify"]}],"etymology":{"value":"From Latin *adimere* (to take away). *Ad-* (to, toward) + *emere* (to take, buy).","priority":"★★★"},"pronunciation":{"ipa":"/əˈdiːmz/","syllables":"a-deems"},"inflection":{"verb_forms":{"present_simple":["adeems"],"past_simple":"adeemed","past_participle":"adeemed","present_participle":"adeeming"}},"usage_notes":{"explanation":"'Adeem' is a legal term, specifically related to wills and inheritance. It refers to the act of canceling a specific bequest because the asset is no longer in the testator's possession at the time of death. This often happens when the testator sells or gives away the property mentioned in the will before they die.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He adeemed his responsibilities.","correct":"✓ He relinquished his responsibilities.","note":"'Adeem' is only used in the context of wills and inheritance, not general responsibilities."}],"priority":"★★☆"},"related_words":{"derivatives":["ademption (noun): The act of adeeming; the extinction or withdrawal of a legacy in consequence of some act of the testator equivalent to its revocation, or clearly indicative of an intention to revoke.","ademption by extinction","ademption by satisfaction"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adeem' is a highly specialized legal term. It is used in the context of wills and estates to describe the situation where a specific gift in a will is no longer available at the time of the testator's death, thus rendering the gift void. Understanding this term requires a strong grasp of legal concepts related to inheritance.","priority":"★☆☆"},"example_sentences":[{"sentence":"The sale of the antique car adeemed the bequest to his grandson.","translation":"そのアンティークカーの売却は、彼の孫への遺贈を無効にした。","type":"verb","meaning_category":"無効にする"}]}