{"word":"hechsher","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教の)カシュルート認証マーク、ヘフシャー","english_definition":"A symbol or mark indicating that a product or establishment meets the requirements of kashrut (Jewish dietary laws).","examples":[{"sentence":"The package has a hechsher, so it is kosher.","translation":"そのパッケージにはヘフシャーが付いているので、コーシャ(適正)です。"},{"sentence":"Look for a reliable hechsher when buying kosher food.","translation":"コーシャ食品を購入する際は、信頼できるヘフシャーを探してください。"}],"collocations":["reliable hechsher","kosher hechsher","prominent hechsher"],"synonyms":["kosher symbol","kosher certification mark"],"antonyms":[]},{"part_of_speech":"noun","definition":"(ユダヤ教の)カシュルート認証機関","english_definition":"An organization or agency that provides kosher certification.","examples":[{"sentence":"The restaurant is certified kosher by a well-known hechsher.","translation":"そのレストランは、有名なヘフシャーによってコーシャ認証されています。"},{"sentence":"Different hechshers have different standards of kashrut.","translation":"ヘフシャーによって、カシュルートの基準が異なります。"}],"collocations":["reputable hechsher","major hechsher","local hechsher"],"synonyms":["kosher certifying agency","kosher certification organization"],"antonyms":[]}],"etymology":{"value":"From Hebrew הֶכְשֵׁר (hekhshér), meaning 'fitness, suitability, qualification'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛkʃər/","syllables":"hech-sher"},"inflection":{"noun_plural":"hechshers"},"usage_notes":{"explanation":"A \"hechsher\" is a symbol placed on food packaging or displayed in restaurants to indicate that the food or establishment adheres to Jewish dietary laws (kashrut). Different hechshers are issued by different certifying agencies, and they may have varying standards. Consumers who keep kosher often rely on these symbols to ensure that the food they are consuming meets their religious requirements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The food is hechsher.","correct":"✓ The food has a hechsher. / ✓ The food is kosher.","note":"\"Hechsher\" is a noun, not an adjective. To say that food meets kosher requirements, use the adjective \"kosher.\""}],"priority":"★★☆"},"related_words":{"derivatives":["hechshered (adjective: certified kosher)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hechsher\" is a specialized term related to Jewish dietary laws (kashrut). It refers to a symbol or certification mark that indicates a product or establishment meets the requirements of kashrut. Understanding this term requires familiarity with Jewish religious practices and terminology. It is not commonly used outside of contexts related to kosher food and Jewish culture."},"example_sentences":[{"sentence":"The label clearly displays the hechsher of a respected rabbinical organization.","translation":"そのラベルには、尊敬されているラビ団体のヘフシャーが明確に表示されています。","type":"noun","meaning_category":"カシュルート認証マーク"},{"sentence":"Many observant Jews rely on the hechsher to determine if a product is kosher.","translation":"多くのユダヤ教徒は、製品がコーシャであるかどうかを判断するためにヘフシャーを頼りにしています。","type":"noun","meaning_category":"カシュルート認証マーク"},{"sentence":"The bakery received its hechsher after a thorough inspection.","translation":"そのパン屋は、徹底的な検査の後、ヘフシャーを受けました。","type":"noun","meaning_category":"カシュルート認証機関"}]}