{"word":"dedentation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"字下げ解除、インデント解除","english_definition":"The removal of indentation; the opposite of indentation.","examples":[{"sentence":"The dedentation of the code block made it difficult to read.","translation":"コードブロックの字下げ解除により、読みにくくなった。"},{"sentence":"Proper dedentation is crucial for the correct execution of Python code.","translation":"適切なインデント解除は、Pythonコードの正しい実行に不可欠である。"}],"collocations":["code dedentation","automatic dedentation"],"synonyms":["outdent"],"antonyms":["indentation","indent"],"notes":"Especially relevant in programming contexts, where indentation is syntactically significant."}],"etymology":{"value":"Formed from 'de-' (meaning 'removal' or 'reversal') and 'indentation'.","priority":"★☆☆"},"pronunciation":{"ipa":"/diːˌdɛnˈteɪʃən/","syllables":"de-den-ta-tion"},"inflection":{"noun_plural":"dedentations"},"usage_notes":{"explanation":"'Dedentation' refers specifically to the act of removing indentation. In programming, this is often done to indicate the end of a block of code or to change the level of nesting.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dedentation was too much, so the code didn't work.","correct":"✓ There was too much dedentation, so the code didn't work.","note":"Using 'dedentation' as an uncountable noun is more common when referring to the amount of dedentation."}],"priority":"★☆☆"},"related_words":{"derivatives":["dedent (verb)"],"related_terms":["indentation","indent","outdent"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dedentation' is a technical term primarily used in programming and text formatting contexts. It refers to the process of reducing or removing indentation from a line or block of text. Understanding this term is essential for programmers, especially those working with languages like Python where indentation is crucial for defining code structure."},"example_sentences":[{"sentence":"The editor automatically handles dedentation when I press backspace.","translation":"エディタは、バックスペースを押すと自動的にインデント解除を処理します。","type":"general","meaning_category":"字下げ解除"},{"sentence":"Incorrect dedentation can lead to syntax errors in Python.","translation":"不適切なインデント解除は、Pythonで構文エラーを引き起こす可能性があります。","type":"programming","meaning_category":"字下げ解除"}]}