{"word":"laniiform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"（特に鳥の）カマキリのような形をした","english_definition":"Shaped like a shrike (laniid bird); having a hooked or curved shape resembling the bill of a shrike.","examples":[{"sentence":"The laniiform beak is well-suited for tearing flesh.","translation":"カマキリ型のくちばしは、肉を引き裂くのに適している。"},{"sentence":"Some birds have laniiform beaks for catching insects.","translation":"昆虫を捕食するためにカマキリ型のくちばしを持つ鳥もいる。"}],"collocations":["laniiform beak","laniiform bill"],"synonyms":["hooked","curved","uncinate"],"antonyms":["straight","linear"]}],"etymology":{"value":"From Latin *lanius* (butcher, shrike) + *-form* (having the form of).","priority":"★★★"},"pronunciation":{"ipa":"/ləˈnaɪɪfɔːrm/","syllables":"la-ni-i-form"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"The term \"laniiform\" is primarily used in ornithology (the study of birds) to describe the shape of a bird's beak. It refers to a beak that is hooked or curved, similar to that of a shrike (family Laniidae). This beak shape is often associated with birds that are predatory or insectivorous, as it aids in capturing and tearing apart prey.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The leaf was laniiform.","correct":"✓ The leaf was falciform.","note":"\"Laniiform\" specifically refers to a beak shape. For leaves, use \"falciform\" (sickle-shaped)."},{"incorrect":"✗ The bird had a laniiform foot.","correct":"✓ The bird had a raptorial foot.","note":"For feet adapted for grasping prey, use \"raptorial\". \"Laniiform\" is for beaks."}],"priority":"★★☆"},"related_words":{"derivatives":["Laniidae (family of shrikes)","laniid (relating to shrikes)"],"phrases":["hooked beak","shrike-like"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in ornithology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"laniiform\" is a technical term used in the field of ornithology to describe a specific beak shape that resembles that of a shrike. It is not a commonly used word and is primarily encountered in scientific or specialized contexts related to birds. Understanding this term requires familiarity with avian anatomy and terminology."},"example_sentences":[{"sentence":"The bird of prey had a distinctly laniiform beak, perfect for tearing flesh.","translation":"その猛禽類は、肉を引き裂くのに最適な、明らかにカマキリ型のくちばしを持っていた。","type":"adjective","meaning_category":"shape"},{"sentence":"Ornithologists noted the laniiform structure of the bird's bill during their study.","translation":"鳥類学者は研究中に、その鳥のくちばしのカマキリ型の構造に注目した。","type":"adjective","meaning_category":"shape"}]}