{"word":"aquatint","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アクアチント（版画技法の一種）","english_definition":"a printmaking technique, a variant of etching, for producing tonal effects by using acid to etch areas of tone directly into a metal plate. It is also a print made using this technique.","examples":[{"sentence":"He created a series of aquatints depicting scenes of the countryside.","translation":"彼は田園風景を描いた一連のアクアチント版画を制作した。"},{"sentence":"The aquatint process allows for subtle gradations of tone.","translation":"アクアチントの技法は、微妙な濃淡のグラデーションを可能にする。"}],"collocations":["aquatint etching","sugar-lift aquatint","resin aquatint","create an aquatint","print an aquatint"],"synonyms":["etching","intaglio","print","engraving"],"antonyms":[]}],"etymology":{"value":"The word \"aquatint\" is derived from the Italian \"acqua tinta,\" meaning \"tinted water.\" This refers to the wash-like appearance of the tonal areas in the print, resembling watercolor washes.","priority":"★★★"},"pronunciation":{"ipa":"ˈækwətɪnt","syllables":"a-qua-tint"},"inflection":{"noun_plural":"aquatints"},"usage_notes":{"explanation":"Aquatint is a printmaking technique used to create tonal effects, rather than lines, on a metal plate. Unlike etching, which relies on lines, aquatint creates areas of tone. The process involves applying a porous ground (often resin or asphaltum) to the plate, exposing it to acid, and then printing the image. The resulting print resembles a watercolor or wash drawing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an aquatint painting.","correct":"✓ He made an aquatint print.","note":"Aquatint is a printmaking technique, not a painting technique. The result is a print, not a painting."},{"incorrect":"✗ Aquatint is a type of watercolor.","correct":"✓ Aquatint is a type of printmaking.","note":"Aquatint is a printmaking process that can resemble watercolor, but it is not watercolor itself."}],"priority":"★★☆"},"related_words":{"derivatives":["aquatinter (noun: an artist who creates aquatints)"],"phrasal_verbs":[],"related_techniques":["etching","engraving","mezzotint","lithography"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized art term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aquatint' refers to a specific printmaking technique similar to etching. It's used to create tonal effects (shades and gradations) rather than lines. The process involves using acid to etch areas of tone into a metal plate, resulting in prints that resemble watercolor washes. It's a specialized term primarily used in the context of fine art and printmaking. Understanding the process requires some knowledge of art techniques."},"example_sentences":[{"sentence":"Goya's 'Los Caprichos' series includes many famous aquatints.","translation":"ゴヤの『ロス・カプリチョス』シリーズには、多くの有名なアクアチントが含まれている。","type":"noun","meaning_category":"版画技法"},{"sentence":"She experimented with aquatint to achieve subtle tonal variations in her prints.","translation":"彼女は版画の微妙な濃淡の変化を出すためにアクアチントを試した。","type":"noun","meaning_category":"版画技法"},{"sentence":"The artist used a sugar-lift aquatint to create a textured effect.","translation":"そのアーティストは、質感のある効果を出すためにシュガーリフト・アクアチントを使用した。","type":"noun","meaning_category":"版画技法"}]}