{"word":"quasi-prosecuted","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(法律)準起訴された、みなし起訴された","english_definition":"Subjected to a process resembling prosecution, but not formally charged with a crime.","examples":[{"sentence":"The individual was quasi-prosecuted through administrative hearings, avoiding a criminal trial.","translation":"その個人は刑事裁判を回避し、行政聴聞を通じて準起訴された。"},{"sentence":"Although not formally indicted, the company felt quasi-prosecuted due to the intense public scrutiny.","translation":"正式に起訴されなかったものの、その会社は世間の厳しい目にさらされ、準起訴されたように感じた。"}],"collocations":["quasi-prosecuted administratively","quasi-prosecuted publicly","feel quasi-prosecuted"],"synonyms":["subjected to administrative action","publicly shamed","subjected to public scrutiny"],"antonyms":["acquitted","exonerated","formally charged"]},{"part_of_speech":"adjective","definition":"(法律)準起訴された、みなし起訴された","english_definition":"Having undergone a process resembling prosecution, but without formal criminal charges.","examples":[{"sentence":"The quasi-prosecuted individual suffered reputational damage despite not being convicted.","translation":"準起訴された個人は、有罪判決を受けていないにもかかわらず、評判を傷つけられた。"},{"sentence":"The quasi-prosecuted company faced significant financial losses due to the negative publicity.","translation":"準起訴された会社は、ネガティブな報道により、多大な経済的損失を被った。"}],"collocations":["quasi-prosecuted individual","quasi-prosecuted company","quasi-prosecuted defendant"],"synonyms":["subjected to administrative action","publicly shamed","subjected to public scrutiny"],"antonyms":["acquitted","exonerated","formally charged"]}],"etymology":{"value":"The term combines \"quasi-\" (meaning resembling or having some, but not all, of the qualities of) with \"prosecuted\" (formally charged with a crime and subjected to legal proceedings). It suggests a situation where someone faces consequences similar to those of a formal prosecution, but without the official legal process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwaːzaɪˈprɒsɪkjuːtɪd/","syllables":"qua-si-pros-e-cu-ted"},"inflection":{"verb_forms":{"present_simple":["quasi-prosecute","quasi-prosecutes"],"past_simple":"quasi-prosecuted","past_participle":"quasi-prosecuted","present_participle":"quasi-prosecuting"},"adjective_forms":{"comparative":"more quasi-prosecuted","superlative":"most quasi-prosecuted"}},"usage_notes":{"explanation":"\"Quasi-prosecuted\" describes a situation where an individual or entity faces consequences similar to those of a formal prosecution, but without being formally charged with a crime in a court of law. This often involves administrative actions, public shaming, or intense scrutiny that significantly impacts the person or organization. The term implies a sense of injustice or unfairness, as the individual or entity is being penalized without the full protections and due process of a legal trial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company was prosecuted quasi.","correct":"✓ The company was quasi-prosecuted.","note":"The correct form is \"quasi-prosecuted,\" with \"quasi-\" acting as a prefix to \"prosecuted.\""},{"incorrect":"✗ He was quasi-prosecuted for murder.","correct":"✓ He was quasi-prosecuted for alleged misconduct.","note":"\"Quasi-prosecuted\" typically applies to situations where formal criminal charges are avoided, often involving less severe allegations such as misconduct or administrative violations."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi-prosecution"],"phrases":["administrative action","public shaming","trial by media"],"related_concepts":["due process","legal proceedings","administrative law","defamation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Quasi-prosecuted\" is a term used to describe situations where someone experiences consequences similar to being formally prosecuted in court, but without actually being charged with a crime. This can involve administrative penalties, public criticism, or other actions that harm their reputation or livelihood. The term suggests that while there's no formal legal process, the person still faces significant negative repercussions. It's often used to highlight concerns about fairness and due process.","example_sentences":[]},"example_sentences":[{"sentence":"The whistleblower felt quasi-prosecuted after his employer initiated a smear campaign against him.","translation":"内部告発者は、雇用主が彼に対する中傷キャンペーンを開始した後、準起訴されたように感じた。","type":"verb","meaning_category":"Subjected to a process resembling prosecution"},{"sentence":"The quasi-prosecuted doctor faced professional sanctions despite the lack of criminal charges.","translation":"準起訴された医師は、刑事告訴がないにもかかわらず、専門的な制裁を受けた。","type":"adjective","meaning_category":"Having undergone a process resembling prosecution"}]}