{"word":"un-Greek","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"ギリシャ的でない、ギリシャ文化に反する、ギリシャ人らしくない","english_definition":"Not Greek in character, culture, or origin; contrary to Greek customs or traditions.","examples":[{"sentence":"His behavior was considered un-Greek by many in the village.","translation":"彼の行動は村の多くの人々によってギリシャ人らしくないとみなされた。"},{"sentence":"The architecture of the building was decidedly un-Greek.","translation":"その建物の建築様式は明らかにギリシャ的ではなかった。"},{"sentence":"The concept of individual liberty is not un-Greek; it has roots in ancient Athenian democracy.","translation":"個人の自由という概念はギリシャ的でないわけではない。古代アテネの民主主義にそのルーツがある。"}],"collocations":["un-Greek customs","un-Greek behavior","un-Greek architecture","un-Greek values"],"synonyms":["non-Greek","foreign","alien","unconventional"],"antonyms":["Greek","Hellenic","traditional"],"notes":"Often used to describe something that deviates from stereotypical or traditional Greek culture."}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning \"not\") to the word \"Greek\".","priority":"High"},"pronunciation":{"ipa":"/ʌnˈɡriːk/","syllables":"un-Greek"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very un-Greek)."},"usage_notes":{"explanation":"The term \"un-Greek\" is used to describe something that is not characteristic of Greek culture, traditions, or people. It can be used in a neutral or negative way, depending on the context. It's important to be mindful of potential cultural sensitivities when using this term.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The food was un-Greek because it had tomatoes.","correct":"The food was un-Greek because it used ingredients not traditionally found in Greek cuisine.","note":"Tomatoes are now common in Greek cuisine, so simply having tomatoes doesn't make it un-Greek. It's more about the overall style and ingredients used."}],"priority":"Low"},"related_words":{"derivatives":["ungreek (verb - rare, to make something un-Greek)"],"related_terms":["Greek","Hellenic","Hellenism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Un-Greek' is a relatively uncommon word used to describe something that doesn't align with Greek culture, traditions, or characteristics. It is formed by adding the prefix 'un-' to 'Greek,' indicating negation. The term may appear in discussions about cultural identity, architecture, or behavior that deviates from typical Greek norms. Its usage requires an understanding of Greek culture to discern what would be considered 'un-Greek.'"},"example_sentences":[{"sentence":"The modern city's layout seemed un-Greek compared to the ancient ruins.","translation":"現代都市のレイアウトは、古代遺跡と比べてギリシャ的ではないように見えた。","type":"adjective","meaning_category":"Not Greek in character"},{"sentence":"His business practices were considered un-Greek due to their aggressive nature.","translation":"彼のビジネス慣行は、その攻撃的な性質のためにギリシャ的でないとみなされた。","type":"adjective","meaning_category":"Contrary to Greek customs"},{"sentence":"The restaurant, despite being in Greece, served decidedly un-Greek cuisine.","translation":"そのレストランは、ギリシャにあるにもかかわらず、明らかにギリシャ的でない料理を提供していた。","type":"adjective","meaning_category":"Not Greek in culture"}]}