{"word":"world-deep","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非常に深い、世界の深さまで届くような、根源的な","english_definition":"Extremely deep; profound; reaching to the depths of the world or existence; fundamental.","examples":[{"sentence":"The philosopher explored world-deep questions about the nature of reality.","translation":"その哲学者は、現実の本質に関する世界の深さまで届くような問いを探求した。"},{"sentence":"Her grief was world-deep, consuming her entirely.","translation":"彼女の悲しみは世界の深さまで届くほど深く、彼女を完全に飲み込んだ。"},{"sentence":"The artist sought to capture the world-deep beauty of the natural landscape.","translation":"その芸術家は、自然の風景の根源的な美しさを捉えようとした。"}],"collocations":["world-deep sorrow","world-deep love","world-deep understanding","world-deep mystery","world-deep connection"],"synonyms":["profound","deep-seated","fundamental","existential","abyssal","bottomless"],"antonyms":["superficial","shallow","trivial","frivolous"]},{"part_of_speech":"adverb","definition":"非常に深く、根源的に","english_definition":"In an extremely deep or profound manner; fundamentally.","examples":[{"sentence":"He was world-deep involved in the project, dedicating all his time and energy.","translation":"彼はそのプロジェクトに非常に深く関わっており、すべての時間とエネルギーを捧げた。"},{"sentence":"She felt world-deep grateful for his unwavering support.","translation":"彼女は彼の揺るぎない支援に根源的に感謝していた。"}],"collocations":["world-deep grateful","world-deep involved","world-deep committed"],"synonyms":["profoundly","deeply","fundamentally","existentially"],"antonyms":["superficially","shallowly","trivially"]}],"etymology":{"value":"Compound word formed by combining \"world\" (referring to the earth or existence) and \"deep\" (referring to great depth). The combination emphasizes the extreme depth or profundity of something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːldˌdiːp/","syllables":"world-deep"},"inflection":{"adjective_forms":{"comparative":"more world-deep","superlative":"most world-deep"},"adverb_forms":{"notes":"As an adverb, it does not have comparative or superlative forms."}},"usage_notes":{"explanation":"\"World-deep\" is a relatively rare and evocative term used to describe something of extreme depth, either literally or figuratively. It suggests a depth that is all-encompassing and fundamental, reaching to the very core of existence. It can be used to describe emotions, ideas, or experiences that are intensely profound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ocean is world-deep.","correct":"✓ The ocean is very deep.","note":"While \"world-deep\" could be used figuratively, in literal contexts, \"very deep\" or \"extremely deep\" is more common and natural. \"World-deep\" is better suited for describing abstract concepts or emotions."},{"incorrect":"✗ He has a world-deep knowledge about history.","correct":"✓ He has a profound knowledge about history.","note":"\"Profound\" is a more common and widely understood synonym for \"world-deep\" when describing knowledge or understanding."}],"priority":"★★☆"},"related_words":{"derivatives":["deep","world","deeply","worldly"],"phrases":["deep-rooted","deep-seated","profound","fundamental","existential"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"World-deep\" is an uncommon and figurative term, best suited for advanced learners. It is used to describe something extremely profound or deep, either in terms of emotions, ideas, or experiences. The word suggests a depth that is fundamental and all-encompassing. While not frequently used, understanding its meaning can enhance comprehension of complex texts and nuanced expressions. It is more often found in literary or philosophical contexts.","note":"This term isn't in common usage, so it is more for advanced learners who want to understand more figurative language."},"example_sentences":[{"sentence":"Her love for her children was world-deep and unconditional.","translation":"彼女の子供たちへの愛は、世界の深さまで届くほど深く、無条件だった。","type":"adjective","meaning_category":"Profound Love"},{"sentence":"The trauma left a world-deep scar on his psyche.","translation":"そのトラウマは、彼の精神に根源的な傷跡を残した。","type":"adjective","meaning_category":"Deep Trauma"},{"sentence":"The philosopher contemplated the world-deep mysteries of the universe.","translation":"その哲学者は、宇宙の根源的な謎について考察した。","type":"adjective","meaning_category":"Existential Mystery"},{"sentence":"The artist aimed to express the world-deep connection between humanity and nature.","translation":"その芸術家は、人類と自然との根源的なつながりを表現することを目指した。","type":"adjective","meaning_category":"Fundamental Connection"}]}