{"word":"presumptiveness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"出しゃばり、厚かましさ、独断的態度、臆面なさ","english_definition":"The quality of being presumptuous; behavior characterized by undue confidence or arrogance, taking liberties, or acting without permission or right.","examples":[{"sentence":"His presumptiveness in assuming he would get the promotion angered his colleagues.","translation":"彼が昇進するものと決めつけていた出しゃばりな態度は、同僚たちの怒りを買った。"},{"sentence":"Her presumptiveness led her to offer unsolicited advice.","translation":"彼女の厚かましさから、頼まれてもいないアドバイスをするに至った。"},{"sentence":"The company's presumptiveness in using the land without permission resulted in legal action.","translation":"許可なくその土地を使用した会社の独断的な態度は、訴訟につながった。"}],"collocations":["display presumptiveness (出しゃばりな態度を見せる)","act with presumptiveness (厚かましく振る舞う)","challenge someone's presumptiveness (人の出しゃばりな態度に異議を唱える)"],"synonyms":["arrogance","audacity","effrontery","impertinence","impudence","overconfidence","cheek","forwardness","sassiness"],"antonyms":["humility","modesty","diffidence","reserve","shyness"]}],"etymology":{"value":"Derived from 'presumptuous' (adjective) + '-ness' (suffix forming nouns denoting a state or quality). 'Presumptuous' comes from the Latin 'praesumptiosus,' meaning 'full of boldness or confidence,' from 'praesumere,' meaning 'to take beforehand, anticipate, presume.'","priority":"★★☆"},"pronunciation":{"ipa":"/prɪˈzʌmptɪvnəs/","syllables":"pre-sump-tive-ness"},"inflection":{"noun_plural":"presumptivenesses (rarely used, as it is an abstract noun)"},"usage_notes":{"explanation":"'Presumptiveness' refers to a negative character trait involving excessive confidence, taking liberties, or acting without proper authority or respect. It often implies a sense of entitlement or a disregard for the boundaries of others. It is typically used to describe behavior that is considered rude, inappropriate, or overstepping.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great presumptiveness.","correct":"✓ He showed great presumptiveness. / ✓ He was very presumptuous.","note":"'Presumptiveness' is an abstract noun, so it's generally used without an article ('a' or 'an'). Alternatively, you can use the adjective 'presumptuous' to describe the person directly."},{"incorrect":"✗ Her presumptiveness made her likeable.","correct":"✓ Her presumptiveness made her unlikeable.","note":"'Presumptiveness' generally has negative connotations, so it usually leads to negative outcomes or feelings. It's unlikely to make someone likeable."}],"priority":"★★☆"},"related_words":{"derivatives":["presumptuous (adjective)","presume (verb)","presumption (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Presumptiveness' is a relatively uncommon and sophisticated word that describes the quality of being presumptuous. It refers to behavior that is characterized by excessive confidence, arrogance, and a tendency to take liberties or act without permission. Understanding this word requires a good grasp of abstract concepts and nuanced language. It is more likely to be encountered in formal writing or academic discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The politician's presumptiveness in declaring victory before all the votes were counted was widely criticized.","translation":"すべての票が集計される前に勝利を宣言した政治家の出しゃばりな態度は、広く批判された。","type":"noun","meaning_category":"出しゃばり、独断的態度"},{"sentence":"Her presumptiveness often rubbed people the wrong way.","translation":"彼女の厚かましさは、しばしば人々の神経を逆なでした。","type":"noun","meaning_category":"厚かましさ"},{"sentence":"The company's presumptiveness in using copyrighted material without permission led to a lawsuit.","translation":"著作権で保護された素材を許可なく使用した会社の独断的な態度は、訴訟につながった。","type":"noun","meaning_category":"独断的態度"}]}