{"word":"glaucic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"帯青灰色の、白粉を帯びた","english_definition":"Of a pale greyish or bluish-green colour; covered with a powdery bloom.","examples":[{"sentence":"The glaucic leaves of the eucalyptus tree are distinctive.","translation":"ユーカリの帯青灰色の葉は特徴的である。"},{"sentence":"The fruit has a glaucic bloom.","translation":"その果実は白粉を帯びている。"}],"collocations":["glaucic leaves","glaucic bloom","glaucic surface"],"synonyms":["bluish-green","greyish-blue","pale blue-green","powdery"],"antonyms":["vivid green","bright blue","uncoated"]}],"etymology":{"value":"From the Ancient Greek word 'glaukos' (γλαυκός), meaning 'gleaming, silvery, greyish-blue', often used to describe the color of the sea or the eyes.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡlɔːsɪk/","syllables":"glau-cic"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more glaucic' and 'most glaucic' respectively."},"usage_notes":{"explanation":"'Glaucic' is a descriptive term primarily used in botany and occasionally in other scientific contexts to describe a specific color or surface appearance. It refers to a pale, greyish or bluish-green color, often with a powdery or waxy bloom on the surface, similar to that found on plums or grapes. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The glaucic sky was beautiful.","correct":"✓ The pale blue sky was beautiful.","note":"'Glaucic' is rarely used to describe the sky. Use more common terms like 'pale blue' or 'greyish-blue' instead."},{"incorrect":"✗ He had glaucic eyes.","correct":"✓ He had greyish-blue eyes.","note":"While 'glaukos' in ancient Greek could refer to eye color, 'glaucic' is not typically used to describe eye color in modern English. Use 'greyish-blue' or 'blue-grey' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["glaucescent (adjective: slightly glaucous, becoming glaucous)","glaucin (noun: a chemical compound found in glaucous plants)","glaucoma (noun: a medical condition affecting the optic nerve, sometimes associated with a greenish hue in the eye - related through the Greek root)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency. A technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glaucic' is a relatively rare and technical term, primarily used in botany and other scientific fields to describe a specific color. It refers to a pale greyish or bluish-green color, often with a powdery or waxy coating. Due to its specialized nature, it is unlikely to be encountered in everyday conversation or general reading materials. Understanding the term requires some familiarity with scientific vocabulary and descriptive language related to color and surface texture."},"example_sentences":[{"sentence":"The glaucic coating on the succulent's leaves helps to reduce water loss.","translation":"多肉植物の葉の帯青灰色のコーティングは、水分損失を減らすのに役立つ。","type":"adjective","meaning_category":"帯青灰色"},{"sentence":"Many species of Eucalyptus have a distinctive glaucic appearance, especially when young.","translation":"多くのユーカリの種は、特に若い時に特徴的な帯青灰色の外観を持つ。","type":"adjective","meaning_category":"帯青灰色"}]}