{"word":"aviarist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥類飼育家、鳥類飼育者","english_definition":"A person who keeps birds, especially in an aviary.","examples":[{"sentence":"The aviarist carefully monitored the health of his birds.","translation":"その鳥類飼育家は、飼っている鳥たちの健康状態を注意深く観察した。"},{"sentence":"She is a dedicated aviarist with a vast knowledge of avian species.","translation":"彼女は献身的な鳥類飼育家で、鳥類の種に関する幅広い知識を持っている。"}],"collocations":["dedicated aviarist","experienced aviarist","amateur aviarist"],"synonyms":["bird keeper","bird breeder","ornithoculturist"],"antonyms":[]}],"etymology":{"value":"The word \"aviarist\" comes from the Latin word \"avis\" meaning \"bird\", combined with the suffix \"-ary\" (denoting a place for something) and the suffix \"-ist\" (denoting a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪviərɪst/","syllables":"a-vi-ar-ist"},"inflection":{"noun_plural":"aviarists"},"usage_notes":{"explanation":"An \"aviarist\" is someone who keeps birds, usually in an aviary, which is a large enclosure for birds. The term implies a level of knowledge and dedication to the care and breeding of birds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an aviary.","correct":"✓ He is an aviarist.","note":"\"Aviary\" is a place where birds are kept; \"aviarist\" is the person who keeps them."}],"priority":"★☆☆"},"related_words":{"derivatives":["aviary (noun: a large enclosure for birds)","aviculture (noun: the practice of keeping and breeding birds)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"aviarist\" is a relatively uncommon term referring to someone who keeps birds, especially in an aviary. It is more specialized than a general term like \"bird keeper\" and implies a deeper level of involvement and knowledge about birds. You're most likely to encounter this word in ornithological or avicultural contexts."},"example_sentences":[{"sentence":"The local aviarist society held a meeting to discuss best practices in bird care.","translation":"地元の鳥類飼育家協会は、鳥の飼育における最良の方法について話し合うために会合を開いた。","type":"noun","meaning_category":"鳥類飼育家"},{"sentence":"As a passionate aviarist, she dedicated her life to the conservation of endangered bird species.","translation":"情熱的な鳥類飼育家として、彼女は絶滅危惧種の鳥類の保護に生涯を捧げた。","type":"noun","meaning_category":"鳥類飼育家"}]}