{"word":"unactually","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"(rare, nonstandard) Not actually; contrary to what is actual or real.","english_definition":"(rare, nonstandard) Not actually; contrary to what is actual or real.","examples":[{"sentence":"The situation was unactually dangerous, despite appearances.","translation":"見た目とは裏腹に、その状況は実際には危険ではなかった。"},{"sentence":"Unactually, he didn't mean to cause any harm.","translation":"実際には、彼は危害を加えるつもりはなかった。"}],"collocations":[],"synonyms":["falsely","incorrectly","inaccurately","ostensibly","seemingly","apparently"],"antonyms":["actually","really","truly","genuinely","veritably"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" to \"actually\".","priority":"★☆☆"},"pronunciation":{"ipa":"/ʌnˈæk.tʃu.ə.li/","syllables":"un-ac-tu-al-ly"},"inflection":{},"usage_notes":{"explanation":"\"Unactually\" is a rare and nonstandard adverb. It is formed by adding the prefix \"un-\" (meaning \"not\") to the adverb \"actually\". It suggests that something is not what it seems or is contrary to what is real. Because it's not widely used, it may sound awkward or incorrect to native English speakers. It's generally better to use more common alternatives like \"ostensibly,\" \"seemingly,\" or rephrase the sentence to use \"not actually\".","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was unactually good.","correct":"✓ The movie was not actually good. / ✓ The movie was ostensibly good.","note":"It's more common and natural to say \"not actually good\" or use a synonym like \"ostensibly\" or \"seemingly\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["actually"],"phrases":[]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very rare","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unactually\" is a rare and non-standard word. It means \"not actually\" or \"contrary to what is real.\" Because it is not commonly used, it may not be recognized by many people, and it is generally better to use more common alternatives. Its use is primarily limited to specific contexts where the speaker wants to emphasize the discrepancy between appearance and reality."},"example_sentences":[{"sentence":"Unactually, the treasure was hidden in plain sight.","translation":"実際には、宝物は人目につく場所に隠されていた。","type":"adverb","meaning_category":"Not actually"},{"sentence":"The event was unactually a success, despite the low attendance.","translation":"出席者は少なかったものの、そのイベントは実際には成功だった。","type":"adverb","meaning_category":"Contrary to appearance"}]}