{"word":"pharmakoi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシャ)生贄、贖罪のヤギ","english_definition":"(Ancient Greece) scapegoats; ritual human victims","examples":[{"sentence":"The pharmakoi were chosen from among the marginalized.","translation":"ファルマコイは社会の周縁部から選ばれた。"},{"sentence":"The ritual involving the pharmakoi was meant to cleanse the city.","translation":"ファルマコイを含む儀式は、都市を清めることを目的としていた。"}],"collocations":["ritual of the pharmakoi","choosing the pharmakoi"],"synonyms":["scapegoat","victim"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek φαρμακοί (pharmakoí), plural of φαρμακός (pharmakós, “scapegoat, human sacrifice, sorcerer, poisoner, drug, medicine”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrməˈkɔɪ/","syllables":"phar-ma-koi"},"inflection":{"noun_plural":"pharmakoi"},"usage_notes":{"explanation":"The term 'pharmakoi' refers to a ritual practice in ancient Greece where individuals were chosen as scapegoats to be sacrificed or expelled in order to purify the community or avert disaster. The term is related to both 'pharmakon' (medicine or poison) and the concept of scapegoating.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["pharmakon (medicine, poison, charm)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'pharmakoi' is a specialized historical and philosophical term, primarily encountered in academic contexts related to ancient Greek history, religion, and philosophy.  Understanding requires familiarity with concepts of ritual sacrifice, scapegoating, and the complex relationship between medicine and poison in ancient thought."},"example_sentences":[{"sentence":"The pharmakoi were often selected from the lowest rungs of society.","translation":"ファルマコイはしばしば社会の最下層から選ばれた。","type":"noun","meaning_category":"生贄"},{"sentence":"The practice of using pharmakoi highlights the ancient Greeks' understanding of purification.","translation":"ファルマコイを用いる慣習は、古代ギリシャ人の浄化の理解を強調している。","type":"noun","meaning_category":"生贄"}]}