{"word":"equity-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"公平性（エクイティ）に焦点を当てた、公平性を重視した","english_definition":"Prioritizing fairness and justice, particularly in the distribution of resources and opportunities, taking into account systemic disadvantages and historical injustices.","examples":[{"sentence":"The organization adopted an equity-focused approach to address disparities in healthcare access.","translation":"その組織は、医療アクセスにおける格差に対処するために、公平性重視のアプローチを採用した。"},{"sentence":"An equity-focused curriculum aims to provide all students with the support they need to succeed, regardless of their background.","translation":"公平性重視のカリキュラムは、すべての学生がその背景に関わらず成功するために必要なサポートを提供することを目指している。"},{"sentence":"The new policy is equity-focused, ensuring that marginalized communities receive the resources they deserve.","translation":"新しい政策は公平性重視であり、疎外されたコミュニティが当然受けるべき資源を確実に受け取れるようにする。"}],"collocations":["equity-focused approach","equity-focused curriculum","equity-focused policy","equity-focused investment","equity-focused grantmaking"],"synonyms":["fairness-oriented","justice-centered","equality-driven","inclusion-focused","social justice-oriented"],"antonyms":["equality-focused (sometimes used in contrast, emphasizing equal treatment rather than equitable outcomes)","inequitable","biased","unfair"]},{"part_of_speech":"adjective","definition":"（投資において）エクイティ投資に重点を置いた","english_definition":"(In finance) Primarily investing in equities (stocks) with the goal of achieving capital appreciation, often with a focus on companies that promote or benefit from equitable practices.","examples":[{"sentence":"The fund is equity-focused, with a significant portion of its assets allocated to publicly traded companies.","translation":"そのファンドはエクイティ投資に重点を置いており、資産の大部分が上場企業に割り当てられている。"},{"sentence":"An equity-focused investment strategy can be more volatile than fixed-income investments.","translation":"エクイティ投資に重点を置いた投資戦略は、債券投資よりも変動が大きくなる可能性がある。"}],"collocations":["equity-focused fund","equity-focused strategy","equity-focused portfolio"],"synonyms":["stock-focused","equity-heavy"],"antonyms":["fixed-income-focused","bond-focused"]}],"etymology":{"value":"Combines \"equity\" (fairness, justice; or ownership of stocks) with \"focused\" (having one's attention directed). The term highlights a deliberate intention to prioritize equity considerations.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛkwɪti ˈfoʊkəst/","syllables":"eq-ui-ty fo-cused"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Equity-focused\" signifies a deliberate and conscious effort to address systemic inequalities and ensure fair outcomes. It goes beyond simply treating everyone the same (equality) and instead acknowledges that different people may require different levels of support to achieve equal opportunities. In a financial context, it can refer to investment strategies that prioritize stocks or companies with equitable practices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is equality-focused, so they treat everyone the same, regardless of their needs.","correct":"✓ The company is equity-focused, so they provide different levels of support based on individual needs.","note":"Equity focuses on fair outcomes, which may require different treatment, while equality focuses on treating everyone the same. The example highlights the difference between equality and equity."}],"priority":"★★☆"},"related_words":{"derivatives":["equity (noun)","focus (noun, verb)"],"phrases":["social equity","racial equity","gender equity","health equity"],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to growing awareness of social justice issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Equity-focused\" is a term used to describe something that prioritizes fairness and justice, especially in how resources and opportunities are distributed. It's often used in discussions about social issues, education, and business. It means that the approach or strategy being described takes into account the different needs and circumstances of individuals or groups, rather than treating everyone the same. The goal is to create a more level playing field where everyone has a fair chance to succeed. In finance, it may refer to investments heavily weighted towards stocks or companies with equitable practices."},"example_sentences":[{"sentence":"The city's new budget is **equity-focused**, allocating more resources to underserved communities.","translation":"市の新しい予算は公平性重視であり、十分なサービスを受けられていない地域社会により多くの資源を割り当てている。","type":"adjective","meaning_category":"公平性重視の (資源配分)"},{"sentence":"The **equity-focused** investment fund seeks to support companies committed to diversity and inclusion.","translation":"そのエクイティ投資に重点を置いた投資ファンドは、多様性と包容性に取り組む企業を支援しようとしている。","type":"adjective","meaning_category":"エクイティ投資に重点を置いた"},{"sentence":"An **equity-focused** approach to education recognizes that some students need more support than others to succeed.","translation":"教育における公平性重視のアプローチは、一部の生徒が成功するためには他の生徒よりも多くのサポートを必要とすることを認識している。","type":"adjective","meaning_category":"公平性重視の (教育)"}]}