{"word":"personnel-funded","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"人件費によって資金提供される、または人件費から資金を得る","english_definition":"Funded by or deriving funds from personnel costs.","examples":[{"sentence":"The project was personnel-funded, relying on contributions from employee salaries.","translation":"そのプロジェクトは人件費によって資金提供されており、従業員の給与からの寄付に頼っていました。"},{"sentence":"The research institute is personnel-funded through a percentage of the staff's research grants.","translation":"その研究所は、スタッフの研究助成金の一定割合を人件費として資金を得ています。"}],"collocations":["personnel-funded project","personnel-funded research","personnel-funded initiative"],"synonyms":["staff-funded","employee-funded"],"antonyms":["government-funded","privately-funded","grant-funded"]}],"etymology":{"value":"Combination of 'personnel' (employees) and 'funded' (provided with money).","priority":"N/A"},"pronunciation":{"ipa":"/ˌpɜːrsəˈnel fʌndɪd/","syllables":"per-son-nel-fund-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Personnel-funded' describes projects, research, or initiatives that receive their funding from personnel costs, such as employee salaries or a portion of research grants allocated for staff. This term is often used when traditional funding sources are limited, and the organization relies on its human resources for financial support.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The personnel funded the project.","correct":"The project was personnel-funded.","note":"'Personnel' refers to the employees themselves, not the source of funding. Use 'personnel-funded' as an adjective to describe the project's funding source."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Personnel-funded' is a specialized term used to describe a project, research, or initiative that is financed through the allocation of funds from personnel costs, such as employee salaries or portions of research grants designated for staff. This term is typically encountered in contexts related to organizational finance, resource management, or academic research where alternative funding models are employed."},"example_sentences":[{"sentence":"The community garden project is personnel-funded, with contributions deducted from employee paychecks.","translation":"その地域菜園プロジェクトは人件費によって資金提供されており、従業員の給与から寄付金が差し引かれています。","type":"adjective","meaning_category":"Funded by personnel costs"},{"sentence":"The university's innovation lab is personnel-funded through a voluntary contribution program for faculty and staff.","translation":"その大学のイノベーションラボは、教職員向けの自主的な寄付プログラムを通じて人件費によって資金提供されています。","type":"adjective","meaning_category":"Funded by personnel costs"}]}