{"word":"bucklered","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(archaic) to equip with a buckler; to defend with a buckler.","english_definition":"(archaic) To equip with a buckler, or defend with one.","examples":[{"sentence":"The knight bucklered himself for battle.","translation":"騎士は戦闘のためにバックラーを装備した。"},{"sentence":"He bucklered his men against the enemy's arrows.","translation":"彼は敵の矢から部下をバックラーで守った。"}],"collocations":[],"synonyms":["shielded","defended","protected"],"antonyms":["attacked","exposed"]}],"etymology":{"value":"Derived from the noun 'buckler', a small shield, with the suffix '-ed' indicating the action of equipping or defending with a buckler.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbʌkəld/","syllables":"buck-lered"},"inflection":{"verb_forms":{"present_simple":["buckler"],"past_simple":"bucklered","past_participle":"bucklered","present_participle":"bucklering"}},"usage_notes":{"explanation":"'Bucklered' is an archaic term, primarily found in historical or literary contexts. It refers to the act of equipping someone with a buckler (a small shield) or defending them using one. The word is rarely used in modern English.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["buckler (noun): a small shield held in the hand.","bucklering (noun): the act of equipping with or defending with a buckler."],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"The word 'bucklered' is an archaic term and not commonly used in modern English. It is primarily found in historical or literary contexts related to medieval warfare. Understanding the term requires familiarity with historical weaponry and vocabulary."},"example_sentences":[{"sentence":"The soldiers, bucklered and armed, stood ready for the assault.","translation":"バックラーを装備し武装した兵士たちは、攻撃に備えて準備を整えた。","type":"verb","meaning_category":"equipped with a buckler"},{"sentence":"He bucklered his comrade from the falling debris.","translation":"彼は落下する瓦礫から同志をバックラーで守った。","type":"verb","meaning_category":"defended with a buckler"}]}