{"word":"Deckels","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) The rough edges of a handmade sheet of paper.","english_definition":"The rough, untrimmed edges of a handmade sheet of paper; also known as deckle edges.","examples":[{"sentence":"Handmade paper often has deckels, giving it a unique and artisanal appearance.","translation":"手漉きの紙にはしばしば耳（deckels）があり、独特で職人的な外観を与えます。"}],"collocations":["deckle edge","handmade paper","laid paper"],"synonyms":["deckle edges","feathered edges"],"antonyms":["trimmed edges","smooth edges"]}],"etymology":{"value":"Derived from 'deckle', a wooden frame used in papermaking to define the size of the sheet and retain the pulp.","priority":"N/A"},"pronunciation":{"ipa":"/ˈdɛkəlz/","syllables":"Deck-els"},"inflection":{"noun_plural":"Deckels"},"usage_notes":{"explanation":"'Deckels' refers specifically to the rough, feathered edges on handmade paper, a result of the papermaking process. It is almost exclusively used in the plural form.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The deckel was torn.","correct":"✓ The deckel edge was torn.","note":"Use 'deckel edge' when referring to a single edge. 'Deckels' is generally used in the plural to describe the overall effect."}],"priority":"N/A"},"related_words":{"derivatives":["deckle (noun: the frame used in papermaking)","deckle edge (noun: a rough edge on handmade paper)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Deckels' is a specialized term related to papermaking and bookbinding, referring to the rough edges of handmade paper. Understanding this term requires familiarity with artisanal paper production techniques."},"example_sentences":[{"sentence":"The bookbinder chose paper with prominent deckels to enhance the antique feel of the book.","translation":"製本職人は、本のアンティークな雰囲気を高めるために、目立つ耳（deckels）のある紙を選びました。","type":"noun","meaning_category":"paper edges"}]}