{"word":"inkpot","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"インク壺、インク入れ","english_definition":"a small container for ink, typically made of glass or ceramic, used for filling pens.","examples":[{"sentence":"He dipped his pen into the inkpot and began to write.","translation":"彼はペンをインク壺に浸して書き始めた。"},{"sentence":"The antique desk had a built-in inkpot.","translation":"そのアンティークの机にはインク壺が組み込まれていた。"}],"collocations":["dip a pen in an inkpot (ペンをインク壺に浸す)","ceramic inkpot (陶製のインク壺)","glass inkpot (ガラス製のインク壺)","antique inkpot (アンティークのインク壺)"],"synonyms":["inkwell","inkstand","ink holder"],"antonyms":[]}],"etymology":{"value":"'Ink' + 'pot'.  'Ink' comes from Old English 'inc', from Latin 'encaustum' (purple or red ink used in ancient times), from Greek 'enkaustos' (burnt in), referring to the method of applying the ink. 'Pot' comes from Old English 'pott', of uncertain origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪŋkpɒt/","syllables":"ink-pot"},"inflection":{"noun_plural":"inkpots"},"usage_notes":{"explanation":"An inkpot is a container specifically designed to hold ink for use with dip pens, quill pens, or fountain pens.  It is often made of glass, ceramic, or metal.  The term is less common now due to the prevalence of ballpoint pens and other modern writing instruments that do not require separate ink sources.  It's often associated with historical settings or calligraphy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He filled the pen from the ink bottle.","correct":"✓ He filled the pen from the inkpot.","note":"'Ink bottle' is a general term for a container of ink, while 'inkpot' is specifically designed for dipping pens."},{"incorrect":"✗ She cleaned the inkpot with water and soap.","correct":"✓ She cleaned the inkpot with water.","note":"Soap may leave residue that could affect the ink's performance."}],"priority":"★☆☆"},"related_words":{"derivatives":["ink (noun, verb)","pot (noun)"],"phrasal_verbs":[],"related_concepts":["quill pen","dip pen","fountain pen","calligraphy","writing desk","stationery"]},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency. More common in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'inkpot' refers to a container for ink, used primarily with dip pens or quill pens. It is a relatively uncommon word in modern usage, as these types of pens are not widely used anymore. Understanding this word requires some familiarity with historical writing tools and practices. It is more likely to be encountered in literature or historical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scribe carefully refilled his quill from the inkpot.","translation":"書記は注意深くインク壺から羽ペンにインクを補充した。","type":"example","meaning_category":"General Use"},{"sentence":"The museum displayed a collection of antique inkpots.","translation":"博物館にはアンティークのインク壺のコレクションが展示されていた。","type":"example","meaning_category":"Historical Context"},{"sentence":"She accidentally knocked over the inkpot, staining the manuscript.","translation":"彼女は誤ってインク壺を倒し、原稿を汚してしまった。","type":"example","meaning_category":"Accident"}]}