{"word":"kathenotheism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"交替神崇拝（こうたいしんすうはい）","english_definition":"The worship of one god at a time while recognizing the existence of other gods, particularly when different gods are worshipped successively as supreme.","examples":[{"sentence":"Some scholars describe ancient Vedic religion as exhibiting kathenotheism, where different deities like Indra or Varuna were each praised as supreme in different hymns.","translation":"古代ヴェーダ宗教には交替神崇拝が見られるとする学者もおり、インドラやヴァルナなどの異なる神々がそれぞれの賛歌において最高神として称えられた。"},{"sentence":"The concept of kathenotheism helps explain how polytheistic systems can temporarily elevate one deity above others without denying their existence.","translation":"交替神崇拝の概念は、多神教体系が他の神々の存在を否定することなく一時的に1つの神を最高位に置く仕組みを説明するのに役立つ。"}],"collocations":["Vedic kathenotheism（ヴェーダの交替神崇拝）","kathenotheistic worship（交替神崇拝的な礼拝）","sequential kathenotheism（連続的な交替神崇拝）"],"synonyms":["henotheism（単一神崇拝）","monolatry（単一神礼拝）"],"antonyms":["monotheism（一神教）","polytheism（多神教）","atheism（無神論）"]}],"etymology":{"value":"ドイツ語の「Kathenotheismus」に由来し、これはギリシャ語の「καθ' ἕνα (kath' hena)」（「一つずつ」の意）と「θεός (theos)」（神）の合成語。19世紀ドイツの東洋学者マックス・ミュラーがヴェーダ宗教を説明するために造語した。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkæθəˈnoʊθiɪzəm/","syllables":"kath·e·no·the·ism"},"inflection":{"noun_plural":"kathenotheisms"},"usage_notes":{"explanation":"「**kathenotheism**」は宗教学・神学の専門用語で、特定の多神教体系において、異なる神々が時と場合によって最高神として交替で崇拝される現象を指します。類似概念の「henotheism（単一神崇拝）」が単一の神への排他的崇拝を指すのに対し、kathenotheismは時間的・文脈的な交替性を強調します。古代インドのヴェーダ宗教やギリシャ・ローマ神話の研究などで用いられる学術的な用語であり、日常会話で使われることはほぼありません。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Kathenotheism means believing in only one god permanently.","correct":"✓ Kathenotheism involves worshipping one god at a time while acknowledging others, with the supreme deity potentially changing.","note":"交替神崇拝は永続的な単一神信仰ではなく、状況に応じて崇拝対象が交替する点が特徴です。"},{"incorrect":"✗ Christianity is an example of kathenotheism.","correct":"✓ Some aspects of ancient Hinduism demonstrate kathenotheism.","note":"キリスト教は一神教であり、交替神崇拝の例ではありません。ヴェーダ宗教など特定の多神教体系に適用される概念です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["kathenotheistic（形容詞: 交替神崇拝の）"],"related_terms":[{"word":"henotheism","relationship":"類似概念（単一神崇拝だが交替性の要素は薄い）"},{"word":"monolatry","relationship":"類似概念（単一神礼拝だが他の神の存在を否定しない）"},{"word":"polytheism","relationship":"上位概念（多神教）"},{"word":"pantheon","relationship":"関連概念（神々の体系）"}],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2（専門用語）","frequency_google_ngram":"極めて低頻度（Very low frequency）- 学術文献以外ではほとんど出現しない","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**kathenotheism**（交替神崇拝）」は、宗教学や比較神学の専門用語で、複数の神々を認めつつ、時と場合によって崇拝する最高神を交替させる宗教体系を指します。例えば古代インドのヴェーダ宗教では、戦争時には軍神インドラが、司法時には司法神ヴァルナが最高神として称えられるような現象が見られます。この概念は19世紀の学者マックス・ミュラーが提唱したもので、通常の会話で使われることはなく、学術的な文脈でのみ遭遇する高度な用語です。類似概念に「henotheism（単一神崇拝）」がありますが、こちらは特定の神への排他的崇拝を指し、時間的な交替性のニュアンスは含みません。"},"example_sentences":[{"sentence":"The **kathenotheism** in the Rigveda shows Agni, Indra, and other deities each being exalted as supreme in different hymns.","translation":"リグ・ヴェーダにおける交替神崇拝では、アグニやインドラなどの神々がそれぞれ異なる賛歌において最高神として称えられている。","type":"noun","meaning_category":"宗教学用語"},{"sentence":"Unlike monotheism, **kathenotheism** allows for fluidity in which deity is considered most powerful at any given time.","translation":"一神教とは異なり、交替神崇拝ではどの神が最も力強いとみなされるかについて流動性が認められる。","type":"noun","meaning_category":"神学概念"},{"sentence":"Müller's concept of **kathenotheism** was crucial for understanding the dynamic nature of early Indo-European religions.","translation":"ミュラーの提唱した交替神崇拝の概念は、初期インド・ヨーロッパ語族宗教の動的な性質を理解する上で決定的に重要だった。","type":"noun","meaning_category":"学術用語"}]}