{"word":"mesomorphous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"中胚葉型の、筋肉質の","english_definition":"having a body build marked by well-developed musculature and connective tissue.","examples":[{"sentence":"He has a mesomorphous physique, ideal for bodybuilding.","translation":"彼はボディービルに理想的な中胚葉型の体格をしています。"},{"sentence":"The athlete's mesomorphous build gave him a competitive advantage.","translation":"そのアスリートの筋肉質の体格は、彼に競争上の優位性をもたらしました。"}],"collocations":["mesomorphous physique","mesomorphous body type","mesomorphous build"],"synonyms":["muscular","athletic","brawny","well-built"],"antonyms":["ectomorphous","endomorphous"]}],"etymology":{"value":"Derived from the Greek words 'meso-' meaning 'middle' and 'morphē' meaning 'form'. It refers to the body type characterized by a balance between the endoderm (inner layer) and ectoderm (outer layer) during embryonic development.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛzəˈmɔːrfəs/","syllables":"me-so-mor-phous"},"inflection":{"notes":"No specific inflectional forms as it is an adjective."},"usage_notes":{"explanation":"'Mesomorphous' is used to describe a body type that is characterized by a well-proportioned, muscular build. This term is often used in the context of fitness, bodybuilding, and sports to describe individuals who naturally gain muscle easily and have a lean physique. It is one of three somatotypes (body types) identified by psychologist William Herbert Sheldon in the 1940s, the others being ectomorphous (lean and slender) and endomorphous (round and soft).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a mesomorph.","correct":"✓ He has a mesomorphous body type.","note":"'Mesomorph' is sometimes used informally as a noun, but it is more accurate to use 'mesomorphous' as an adjective to describe the body type."}],"priority":"★★☆"},"related_words":{"derivatives":["mesomorph (noun, informal)","somatotype"],"related_terms":["ectomorphous","endomorphous"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized contexts such as fitness and anthropology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'mesomorphous' is a technical term used in the fields of anthropology, fitness, and bodybuilding to describe a specific body type characterized by well-developed musculature. It is not commonly used in everyday language. Understanding the term requires familiarity with the concept of somatotypes and body composition. The word is derived from Greek roots, indicating its scientific origin and usage."},"example_sentences":[{"sentence":"The personal trainer identified him as having a classic mesomorphous body type.","translation":"そのパーソナルトレーナーは、彼が典型的な中胚葉型の体型であると判断しました。","type":"adjective","meaning_category":"体型"},{"sentence":"With his mesomorphous build, he excelled in sports that required strength and agility.","translation":"彼の筋肉質の体格のおかげで、彼は力と敏捷性を必要とするスポーツで優れた成績を収めました。","type":"adjective","meaning_category":"体格"}]}