{"word":"guydom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"男性の世界、男らしさ、男性社会","english_definition":"The world of men; maleness; the state of being a guy or man. Often implies a focus on male interests, activities, and perspectives.","examples":[{"sentence":"The film explores themes of guydom and male identity.","translation":"その映画は男性の世界と男性のアイデンティティというテーマを探求している。"},{"sentence":"He felt excluded from the guydom of the locker room.","translation":"彼はロッカールームの男性社会から疎外されていると感じた。"},{"sentence":"The magazine caters to the interests of guydom.","translation":"その雑誌は男性社会の興味に応える。"}],"collocations":["explore guydom","the world of guydom","male guydom","locker-room guydom"],"synonyms":["manhood","masculinity","male society","male culture"],"antonyms":["womandom","femininity","female society","female culture"]}],"etymology":{"value":"A blend of 'guy' (a man) and '-dom' (a suffix denoting a state, condition, or domain).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡaɪdəm","syllables":"guy-dom"},"inflection":{"noun_plural":"guydoms"},"usage_notes":{"explanation":"'Guydom' is a relatively informal term, often used to describe or comment on aspects of male culture, behavior, or social structures. It can sometimes carry a slightly critical or humorous tone, especially when referring to stereotypical male interests or activities. It is less common than terms like 'manhood' or 'masculinity' in formal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a member of guydom.","correct":"✓ He is a member of guydom.","note":"Since 'guydom' refers to the world of men, it is typically used to describe men, not women."},{"incorrect":"✗ Guydom is always positive.","correct":"✓ Guydom can be both positive and negative, depending on the context.","note":"The term 'guydom' is not inherently positive or negative; its connotation depends on the specific context in which it is used."}],"priority":"★★☆"},"related_words":{"derivatives":["guy (noun: a man, fellow)","-dom (suffix: state, condition, or domain)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning materials)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Guydom' is a less common, somewhat informal term that refers to the world of men, often implying a focus on male interests, activities, and perspectives. It can be used to explore themes related to male identity and culture. The term is not typically found in standard language learning materials and may require a higher level of understanding to grasp its nuances and connotations.","example_sentences":[]}}