{"word":"burnisher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"磨き器、艶出し器、仕上げ工具","english_definition":"A tool used for burnishing; a person who burnishes.","examples":[{"sentence":"The silversmith used a burnisher to polish the jewelry.","translation":"銀細工師は磨き器を使って宝石を磨いた。"},{"sentence":"Leather burnishers are used to smooth the edges of leather goods.","translation":"革の磨き器は革製品の端を滑らかにするために使われる。"}],"collocations":["leather burnisher","metal burnisher","agate burnisher"],"synonyms":["polishing tool","smoother","glosser"],"antonyms":[]}],"etymology":{"value":"The word 'burnisher' comes from the verb 'burnish,' which originated from the Old French word 'burniss-, stem of burnir,' meaning 'to polish, make glitter.' This in turn comes from 'brunir,' meaning 'to make brown,' from 'brun' meaning 'brown,' reflecting the shiny, brown-like appearance of polished metal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrnɪʃər/","syllables":"bur-ni-sher"},"inflection":{"noun_plural":"burnishers"},"usage_notes":{"explanation":"A 'burnisher' is a tool used to make a surface smooth and shiny through friction. It is commonly used on metal, leather, and other materials. The tool itself can be made of various materials such as steel, bone, or agate, depending on the application.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a burnisher cream to polish the silver.","correct":"✓ He used a burnisher to polish the silver. / ✓ He used polishing cream to polish the silver.","note":"A 'burnisher' is a tool, not a cream. To use a cream, you would say 'polishing cream' or 'silver polish'."}],"priority":"★☆☆"},"related_words":{"derivatives":["burnish (verb: to polish, to make shiny; noun: the shine or luster resulting from polishing)","burnished (adjective: polished, made shiny)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'burnisher' is a specialized term, primarily used in contexts involving metalworking, leather crafting, or jewelry making. It refers to a specific tool used to achieve a smooth, polished surface. Understanding this word requires some familiarity with these crafts or a willingness to learn technical vocabulary. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The bookbinder used a bone burnisher to smooth the gold leaf on the cover.","translation":"製本職人は、表紙の金箔を滑らかにするために骨製の磨き器を使った。","type":"noun","meaning_category":"tool"},{"sentence":"With a few strokes of the burnisher, the metal surface gleamed.","translation":"磨き器を数回使うと、金属の表面が輝いた。","type":"noun","meaning_category":"tool"}]}