{"word":"pretardy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(造語)遅れるのが好きな、常に遅刻する","english_definition":"(neologism) habitually late; enjoying being late.","examples":[{"sentence":"She's not just late; she's pretardy. She seems to enjoy making a grand entrance after everyone else has arrived.","translation":"彼女はただ遅刻するだけじゃない。遅刻魔なの。他の人がみんな着いてから、大仰に登場するのが好きなみたい。"},{"sentence":"I can't stand people who are pretardy. It's so disrespectful of everyone else's time.","translation":"遅刻魔は我慢できない。他の人の時間を尊重していないじゃない。"}],"collocations":["chronically pretardy","hopelessly pretardy"],"synonyms":["habitually late","chronically tardy","always late","never on time"],"antonyms":["punctual","early","on time"]},{"part_of_speech":"noun","definition":"(造語)遅れるのが好きな人、常に遅刻する人","english_definition":"(neologism) a person who is habitually late; a person who enjoys being late.","examples":[{"sentence":"Don't invite him if you want people to be on time; he's a pretardy.","translation":"時間通りに来てほしいなら、彼を招待しないで。彼は遅刻魔だから。"},{"sentence":"She's such a pretardy that I've stopped making dinner reservations for her.","translation":"彼女は本当に遅刻魔だから、彼女のためにディナーの予約をするのをやめたわ。"}],"collocations":["a chronic pretardy","a hopeless pretardy"],"synonyms":["latecomer","habitual latecomer","chronically tardy person"],"antonyms":["punctual person","early bird"]}],"etymology":{"value":"A blend of \"pretty\" and \"tardy\". The \"pretty\" part might imply that the person is almost intentionally late, perhaps for attention, or that they are so habitually late that it's become a defining characteristic.","priority":"★☆☆"},"pronunciation":{"ipa":"/priˈtɑːrdi/","syllables":"pre-tar-dy"},"inflection":{"noun_plural":"pretardies"},"usage_notes":{"explanation":"\"Pretardy\" is a neologism, meaning it's a relatively new word that hasn't yet gained widespread acceptance. It's a blend of \"pretty\" and \"tardy,\" suggesting someone who is not just late, but almost intentionally so, or who is so habitually late that it's a defining characteristic. It's often used in a humorous or slightly exasperated way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is pretardy for the meeting.","correct":"✓ She is late for the meeting.","note":"Since \"pretardy\" is a neologism, it's safer to use the more established \"late\" in formal contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Neologism)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pretardy\" is a newly coined word, so it's not in standard dictionaries. It combines \"pretty\" and \"tardy\" to describe someone who is habitually and almost intentionally late. Because it's not widely recognized, using it might require explanation or might not be understood by everyone. It's best suited for informal settings where creative language is appreciated."},"example_sentences":[{"sentence":"He's not just running behind; he's full-on **pretardy**, making a theatrical entrance half an hour after the show started.","translation":"彼は遅れているだけじゃない。完全に遅刻魔で、ショーが始まってから30分後に劇的な登場をするんだ。","type":"adjective","meaning_category":"habitually late"},{"sentence":"As a self-confessed **pretardy**, she always builds in extra time for getting ready, but somehow still manages to be late.","translation":"自称遅刻魔として、彼女はいつも準備に余分な時間を組み込んでいるが、それでもどうにかして遅刻してしまう。","type":"noun","meaning_category":"person who is habitually late"}]}