{"word":"adeeming","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(法律) (遺贈を)無効にする、取り消す","english_definition":"(Law) To render (a legacy) inoperative; to revoke or satisfy (a legacy) by some act of the testator during their lifetime other than by revocation in a will or codicil.","examples":[{"sentence":"The sale of the property by the testator adeemed the specific legacy of that property.","translation":"遺言者による当該不動産の売却は、その不動産の特定遺贈を無効にした。"}],"collocations":["adeem a legacy (遺贈を無効にする)"],"synonyms":["revoke","nullify","invalidate","extinguish"],"antonyms":["validate","confirm","ratify"]}],"etymology":{"value":"From the verb 'adeem', which comes from the Latin 'adimere', meaning 'to take away'.","priority":"★★★"},"pronunciation":{"ipa":"/əˈdiːmɪŋ/","syllables":"a-deem-ing"},"inflection":{"verb_forms":{"present_simple":["adeem","adeems"],"past_simple":"adeemed","past_participle":"adeemed","present_participle":"adeeming"}},"usage_notes":{"explanation":"'Adeeming' is the present participle and gerund form of the verb 'adeem'. In legal contexts, it specifically refers to the act of rendering a legacy inoperative because the specific property or item bequeathed in a will is no longer in the testator's possession at the time of their death. This can occur if the testator sells, gives away, or destroys the property before passing away.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is adeeming the situation.","correct":"✓ He is adeeming the legacy.","note":"'Adeeming' should be used specifically in the context of legacies and wills, not general situations."}],"priority":"★★☆"},"related_words":{"derivatives":["adeem (verb)","ademption (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adeeming' is a highly specialized legal term related to wills and estates. It describes the action of rendering a specific legacy in a will invalid because the asset no longer exists or is owned by the testator at the time of death. Due to its niche usage, it is not commonly encountered outside of legal contexts."},"example_sentences":[{"sentence":"The testator's act of selling the shares was adeeming the legacy.","translation":"遺言者が株式を売却した行為は、その遺贈を無効にしていた。","type":"verb","meaning_category":"無効にする"},{"sentence":"The court is considering whether the testator was adeeming the gift by selling the property.","translation":"裁判所は、遺言者が不動産を売却することによって、その贈与を無効にしていたかどうかを検討している。","type":"verb","meaning_category":"無効にする"}]}