{"word":"raking-down","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of criticizing or reprimanding severely.","english_definition":"A severe criticism or reprimand.","examples":[{"sentence":"The employee received a raking-down from the manager for poor performance.","translation":"その従業員は業績不振でマネージャーから厳しく叱責された。"},{"sentence":"After the disastrous presentation, a raking-down was inevitable.","translation":"ひどいプレゼンテーションの後、厳しく叱責されるのは避けられなかった。"}],"collocations":["receive a raking-down","give a raking-down","a severe raking-down"],"synonyms":["scolding","reprimand","dressing-down","telling-off","criticism"],"antonyms":["praise","commendation","approval"]}],"etymology":{"value":"Derived from the verb phrase 'rake down', suggesting a thorough and forceful action, as if using a rake to gather and expose something.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈreɪkɪŋˌdaʊn/","syllables":"rak-ing-down"},"inflection":{"noun_plural":"raking-downs"},"usage_notes":{"explanation":"'Raking-down' is a relatively uncommon term, often used in informal contexts to describe a harsh or intense scolding. It implies a thorough and often unpleasant criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He gave a raking-down to the garden.","correct":"He gave a raking-down to the employee.","note":"'Raking-down' refers to a verbal reprimand, not a physical action like gardening."}],"priority":"★☆☆"},"related_words":{"derivatives":["rake (verb)"],"phrasal_verbs":["rake over (to examine or discuss something again, often something unpleasant)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Raking-down' is a relatively uncommon noun that describes a severe reprimand or scolding. It is often used in informal contexts and suggests a thorough and forceful criticism. The term is derived from the verb phrase 'rake down', which implies a comprehensive and often unpleasant examination or exposure of faults."},"example_sentences":[{"sentence":"The CEO's speech was a complete raking-down of the company's recent performance.","translation":"CEOの演説は、会社の最近の業績に対する完全な叱責だった。","type":"noun","meaning_category":"criticism"},{"sentence":"She braced herself for the raking-down she knew was coming after the mistake.","translation":"彼女は、間違いの後に来るであろう叱責に身構えた。","type":"noun","meaning_category":"reprimand"}]}