{"word":"outdoers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 他の人より優れたことをする人、競争相手に勝つ人","english_definition":"(plural form) People who surpass others in performance or achievement; those who excel or outperform competitors.","examples":[{"sentence":"The outdoers in the sales department consistently exceeded their quotas.","translation":"営業部の優秀な社員たちは常にノルマを超過していた。"},{"sentence":"She admired the outdoers in her field and strived to emulate their success.","translation":"彼女は自分の分野で優れた人たちを尊敬し、彼らの成功を見習おうと努力した。"}],"collocations":["top outdoers","successful outdoers","competitive outdoers"],"synonyms":["achievers","high-fliers","overachievers","performers","winners"],"antonyms":["underachievers","failures","losers"]}],"etymology":{"value":"The word 'outdoers' is derived from the verb 'outdo,' which means to surpass or exceed in performance. The suffix '-er' is added to form a noun denoting people who perform the action of outdoing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈduːərz/","syllables":"out-do-ers"},"inflection":{"noun_plural":"outdoers"},"usage_notes":{"explanation":"'Outdoers' is a plural noun that refers to individuals who consistently outperform others in a particular field or activity. It emphasizes their ability to exceed expectations and achieve superior results. This term is often used in business, sports, and academic contexts to describe high-achieving individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an outdoer in her class.","correct":"✓ She is an outdoer. / ✓ She is a high achiever in her class.","note":"While grammatically correct, 'outdoer' is more commonly used in the plural form. Using 'high achiever' is a more natural way to describe a single person who excels."},{"incorrect":"✗ The outdoers are always selfishness.","correct":"✓ The outdoers are always ambitious.","note":"'Outdoers' simply describes people who excel; it doesn't inherently imply negative traits like selfishness. Focus on positive attributes like ambition, dedication, or talent."}],"priority":"★★☆"},"related_words":{"derivatives":["outdo (verb)","outdoing (gerund/participle)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'outdoers' is a relatively uncommon term used to describe individuals who consistently surpass others in performance or achievement. It is often used in professional or academic contexts to denote high-achieving individuals who excel in their respective fields. Understanding the meaning of 'outdo' (to surpass) is helpful in comprehending the meaning of 'outdoers.'"},"example_sentences":[{"sentence":"The company recognized its top outdoers at the annual awards ceremony.","translation":"会社は年次表彰式で最も優れた社員を表彰した。","type":"general","meaning_category":"achievers"},{"sentence":"In the competitive world of finance, only the outdoers rise to the top.","translation":"競争の激しい金融業界では、優秀な人だけがトップに上り詰める。","type":"general","meaning_category":"high-performers"},{"sentence":"The coach motivated his team by highlighting the success of previous outdoers.","translation":"コーチは過去の優秀な選手の成功を強調することで、チームを鼓舞した。","type":"general","meaning_category":"success"}]}