{"word":"legendless","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"伝説を持たない、伝説に基づかない、伝説的でない","english_definition":"lacking a legend; not based on or having a legend; not legendary.","examples":[{"sentence":"The map was legendless, making it difficult to navigate.","translation":"その地図は凡例がなかったので、ナビゲートするのが難しかった。"},{"sentence":"The story is legendless, based on historical facts rather than myth.","translation":"その物語は伝説に基づかず、神話というよりは歴史的事実に基づいている。"},{"sentence":"A legendless existence is one without extraordinary tales or fame.","translation":"伝説的でない存在とは、並外れた物語や名声のない存在のことである。"}],"collocations":["legendless map (凡例のない地図)","legendless story (伝説に基づかない物語)","legendless existence (伝説的でない存在)"],"synonyms":["unlegendary","unfabled","unmythical","factual","historical"],"antonyms":["legendary","fabled","mythical","famous","renowned"]},{"part_of_speech":"adjective","definition":"(地図などが)凡例のない","english_definition":"(of a map, etc.) without a legend (key).","examples":[{"sentence":"The legendless chart made it impossible to decipher the symbols.","translation":"凡例のない図表では、記号を解読することが不可能だった。"}],"collocations":["legendless chart (凡例のない図表)","legendless diagram (凡例のない図)"],"synonyms":["unkeyed","unlabeled"],"antonyms":["keyed","labeled"]}],"etymology":{"value":"\"legend\" + \"-less\". \"Legend\" comes from the Medieval Latin \"legenda\" meaning \"things to be read,\" from Latin \"legere\" meaning \"to read.\" The suffix \"-less\" means \"without.\" So, \"legendless\" literally means \"without a legend.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛdʒəndləs/","syllables":"leg-end-less"},"inflection":{"notes":"Adjective; comparative and superlative forms are formed using 'more' and 'most' (e.g., more legendless, most legendless)."},"usage_notes":{"explanation":"\"Legendless\" is primarily used to describe something that lacks a legend in the sense of a traditional story or myth, or in the sense of a key or explanation (like on a map). It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a legendless life, so he was unhappy.","correct":"✓ He lived a life without extraordinary achievements, so he was unhappy.","note":"While 'legendless' can imply a lack of fame, it's more accurate to say 'a life without extraordinary achievements' or similar, as 'legendless' primarily refers to the absence of a legend or mythical quality, not necessarily a lack of accomplishment."}],"priority":"★★☆"},"related_words":{"derivatives":["legend (noun)","legendary (adjective)"],"antonyms":["legendary (adjective)"],"related_concepts":["myth","folklore","key (on a map)","cartography"]},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"legendless\" is not commonly used, making it suitable for advanced learners. It describes the absence of a legend, either in the sense of a traditional story or a key/explanation (like on a map). Its meaning is straightforwardly derived from its component parts: \"legend\" and the suffix \"-less\" (meaning 'without')."},"example_sentences":[{"sentence":"The ancient artifact was surprisingly legendless, with no associated myths or stories.","translation":"その古代の工芸品は驚くほど伝説がなく、関連する神話や物語はなかった。","type":"general","meaning_category":"lacking a legend"},{"sentence":"The archaeological dig uncovered a legendless civilization, leaving historians puzzled about their beliefs.","translation":"その考古学的発掘調査で、伝説のない文明が発見され、歴史家たちは彼らの信仰について困惑している。","type":"general","meaning_category":"lacking a legend"},{"sentence":"The pirate's treasure map was legendless, making it impossible to decipher the location of the buried gold.","translation":"その海賊の宝の地図は凡例がなく、埋められた金の場所を解読することが不可能だった。","type":"technical (maps)","meaning_category":"lacking a key"}]}