{"word":"hyperelliptic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"超楕円的な","english_definition":"Relating to or being a hyperelliptic curve or integral.","examples":[{"sentence":"The hyperelliptic curve is defined by the equation y^2 = f(x), where f(x) is a polynomial of degree greater than 4.","translation":"超楕円曲線は、y^2 = f(x)という方程式で定義され、ここでf(x)は4次より大きい多項式である。"},{"sentence":"Hyperelliptic integrals are more complex than elliptic integrals.","translation":"超楕円積分は楕円積分よりも複雑である。"}],"collocations":["hyperelliptic curve","hyperelliptic integral","hyperelliptic cryptosystem"],"synonyms":["none"],"antonyms":["elliptic"],"notes":"Used primarily in mathematics, specifically in algebraic geometry and number theory."}],"etymology":{"value":"Derived from 'hyper-' (meaning 'above' or 'beyond') and 'elliptic', indicating a generalization of elliptic curves and integrals.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərɪˈlɪptɪk/","syllables":"hy-per-i-lip-tic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'hyperelliptic' is used in mathematics to describe curves and integrals that are generalizations of elliptic curves and integrals. Hyperelliptic curves are defined by equations of the form y^2 = f(x), where f(x) is a polynomial of degree greater than 4. These curves and their associated integrals are studied in algebraic geometry and have applications in cryptography.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A hyperelliptic is a shape.","correct":"✓ A hyperelliptic curve is a type of algebraic curve.","note":"'Hyperelliptic' describes a type of curve, not a general shape."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperelliptic curve","hyperelliptic integral"],"related_terms":["elliptic","algebraic geometry","number theory"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyperelliptic' is a technical term used in advanced mathematics, specifically in the field of algebraic geometry. It refers to a generalization of elliptic curves, defined by a specific type of equation. Understanding this term requires a background in abstract algebra and calculus. It's not commonly used outside of specialized mathematical discussions."},"example_sentences":[{"sentence":"The security of the cryptosystem relies on the difficulty of solving the discrete logarithm problem on the Jacobian of a **hyperelliptic** curve.","translation":"暗号システムのセキュリティは、超楕円曲線のヤコビ多様体上で離散対数問題を解くことの難しさに依存している。","type":"adjective","meaning_category":"超楕円的な"},{"sentence":"He specialized in the study of **hyperelliptic** integrals and their applications.","translation":"彼は超楕円積分とその応用に関する研究を専門にしていた。","type":"adjective","meaning_category":"超楕円的な"}]}