{"word":"Cimbri","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"キンブリ族（古代のゲルマン部族）","english_definition":"An ancient Germanic tribe, originally from Jutland, who migrated south and threatened the Roman Republic in the late 2nd century BC.","examples":[{"sentence":"The Cimbri and Teutones were defeated by Gaius Marius.","translation":"キンブリ族とテウトネス族はガイウス・マリウスによって打ち破られた。"},{"sentence":"The migration of the Cimbri caused widespread panic in Rome.","translation":"キンブリ族の移動はローマに広範囲なパニックを引き起こした。"}],"collocations":["Cimbri tribe","Cimbri migration","Cimbri War"],"synonyms":["Teutones","Ambrones"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"キンブリ人（キンブリ族の一員）","english_definition":"A member of the Cimbri tribe.","examples":[{"sentence":"A Cimbri warrior fought bravely against the Roman legions.","translation":"キンブリ族の戦士は勇敢にローマ軍団と戦った。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name \"Cimbri\" is uncertain. Possible etymologies include Proto-Germanic *kimbra- meaning 'people of the home field' or related to the word 'Kimmerians'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪmbri/","syllables":"Cim-bri"},"inflection":{"noun_plural":"Cimbri (can be used as both singular and plural)"},"usage_notes":{"explanation":"The Cimbri were a Germanic tribe who, along with the Teutones and Ambrones, migrated from Jutland (modern-day Denmark) into Southern Europe in the late 2nd century BC. Their movements caused significant alarm in the Roman Republic, leading to a series of conflicts known as the Cimbrian War. They were eventually defeated by the Roman general Gaius Marius.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Cimbri was a tribe.","correct":"✓ The Cimbri were a tribe.","note":"Although \"Cimbri\" can be used as a singular noun, it is often treated as plural when referring to the tribe as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["Cimbrian (adjective: relating to the Cimbri)"],"historical_figures":["Gaius Marius (Roman general who defeated the Cimbri)"],"related_tribes":["Teutones","Ambrones"],"historical_events":["Cimbrian War"]},"level_frequency":{"rarity":"Rare (historical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Cimbri\" is primarily encountered in historical contexts, specifically when discussing the late Roman Republic and the migrations of Germanic tribes. Understanding the term requires familiarity with ancient history and Roman military campaigns. The word itself is not commonly used in modern English outside of academic or historical discussions."},"example_sentences":[{"sentence":"The Cimbri posed a significant threat to the Roman Republic.","translation":"キンブリ族はローマ共和国にとって重大な脅威となった。","type":"noun","meaning_category":"Historical tribe"},{"sentence":"Cimbri warriors were known for their ferocity in battle.","translation":"キンブリ族の戦士は戦場での獰猛さで知られていた。","type":"noun","meaning_category":"Members of the tribe"},{"sentence":"The Cimbrian War tested the strength of the Roman legions.","translation":"キンブリ戦争はローマ軍団の力を試した。","type":"adjective (Cimbrian)","meaning_category":"Relating to the tribe"}]}