{"word":"coexecutor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同執行者","english_definition":"One of two or more persons named to execute a will.","examples":[{"sentence":"He appointed his son and his lawyer as coexecutors of his estate.","translation":"彼は息子と弁護士を彼の遺産の共同執行者に任命した。"},{"sentence":"The coexecutors must work together to manage the deceased's assets.","translation":"共同執行者は協力して故人の資産を管理しなければならない。"}],"collocations":["appoint a coexecutor","act as coexecutor","duties of a coexecutor"],"synonyms":["joint executor"],"antonyms":["sole executor"]}],"etymology":{"value":"The prefix \"co-\" means \"joint\" or \"together with,\" combined with \"executor,\" someone appointed to carry out the instructions of a will.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkoʊɪɡˈzekjʊtər/","syllables":"co-ex-e-cu-tor"},"inflection":{"noun_plural":"coexecutors"},"usage_notes":{"explanation":"A \"coexecutor\" shares the responsibilities and legal obligations of executing a will with one or more other individuals. All coexecutors must generally agree on decisions regarding the estate.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the co-executor of the will, she is the executor.","correct":"✓ He is a coexecutor of the will; she is also a coexecutor.","note":"If both individuals are executing the will, they are both coexecutors. The first sentence implies only one is a coexecutor, and the other is the sole executor."}],"priority":"☆☆☆"},"related_words":{"derivatives":["executrix (female executor)","executor (male executor or gender-neutral term)","execution (the act of carrying out a will)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This term is specific to legal contexts and involves understanding the roles and responsibilities associated with estate administration. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"As coexecutors, they were jointly responsible for settling the estate's debts.","translation":"共同執行者として、彼らは遺産の債務を共同で弁済する責任を負っていた。","type":"general","meaning_category":"legal responsibility"},{"sentence":"The court appointed two coexecutors to ensure impartiality in handling the inheritance.","translation":"裁判所は、相続の取り扱いの公平性を確保するために、2人の共同執行者を任命した。","type":"general","meaning_category":"legal appointment"}]}