{"word":"neurohypophysis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"神経下垂体","english_definition":"The posterior lobe of the pituitary gland, which stores and releases two hormones produced by the hypothalamus: vasopressin (antidiuretic hormone) and oxytocin.","examples":[{"sentence":"The neurohypophysis releases vasopressin, which regulates water balance.","translation":"神経下垂体はバソプレシンを放出し、これは水分バランスを調節する。"},{"sentence":"Oxytocin is stored in the neurohypophysis and released during childbirth.","translation":"オキシトシンは神経下垂体に貯蔵され、出産時に放出される。"}],"collocations":["posterior pituitary","pituitary gland","hypothalamus","hormone release","vasopressin","oxytocin"],"synonyms":["posterior pituitary gland","pars nervosa"],"antonyms":["adenohypophysis","anterior pituitary gland"]}],"etymology":{"value":"From the Greek words 'neuron' (nerve), 'hypo' (under), and 'physis' (growth). Refers to the posterior part of the pituitary gland, which is connected to the hypothalamus via nerve fibers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊəroʊhaɪˈpɒfɪsɪs/","syllables":"neu-ro-hy-poph-y-sis"},"inflection":{"noun_plural":"neurohypophyses (less common), neurohypophyses"},"usage_notes":{"explanation":"The neurohypophysis is distinct from the adenohypophysis (anterior pituitary). It does not synthesize hormones but stores and secretes hormones produced by the hypothalamus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The neurohypophysis produces oxytocin.","correct":"✓ The hypothalamus produces oxytocin, which is stored and released by the neurohypophysis.","note":"The neurohypophysis stores and releases hormones, but it does not produce them. The hypothalamus produces oxytocin and vasopressin."}],"priority":"★★☆"},"related_words":{"derivatives":["neurohypophysial (adjective)"],"related_terms":["hypothalamo-hypophyseal tract","vasopressin","oxytocin","pituitary stalk"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized medical terminology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'neurohypophysis' is a highly specialized term used in medicine and biology. It refers to the posterior lobe of the pituitary gland, which is responsible for storing and releasing hormones like vasopressin and oxytocin that are produced in the hypothalamus. Understanding this term requires a background in endocrinology or neuroanatomy."},"example_sentences":[{"sentence":"Damage to the neurohypophysis can lead to diabetes insipidus.","translation":"神経下垂体の損傷は尿崩症を引き起こす可能性がある。","type":"general"},{"sentence":"The hormones released by the neurohypophysis play a crucial role in lactation and social bonding.","translation":"神経下垂体から放出されるホルモンは、授乳や社会的絆において重要な役割を果たす。","type":"general"}]}