{"word":"extrastate","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Existing outside of or beyond the authority or control of a particular state or nation.","english_definition":"Existing or operating outside the boundaries or control of a particular state.","examples":[{"sentence":"The company's extrastate operations are not subject to local taxes.","translation":"その会社の国外事業は、現地の税金の対象ではありません。"},{"sentence":"Extrastate actors can pose a significant challenge to national security.","translation":"国家以外の主体は、国家安全保障に重大な課題をもたらす可能性があります。"}],"collocations":["extrastate activity","extrastate organization","extrastate actor","extrastate operations"],"synonyms":["transnational","international","supranational"],"antonyms":["intrastate","national","domestic"]}],"etymology":{"value":"The word is formed by combining 'extra-' (meaning 'outside' or 'beyond') with 'state'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌekstrəˈsteɪt/","syllables":"ex-tra-state"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Extrastate' is typically used in political science, international relations, and business contexts to describe entities, activities, or phenomena that operate beyond the jurisdiction or control of a single nation-state. It is often used to describe multinational corporations, international organizations, or non-governmental organizations (NGOs) that operate across borders.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The extrastate government.","correct":"✓ The supranational organization.","note":"'Extrastate' doesn't refer to a government but to things existing outside a state. Use 'supranational' for entities above the state level."}],"priority":"N/A"},"related_words":{"derivatives":["extrastatally"],"phrasal_verbs":[],"related_terms":["state","nation-state","transnational","supranational","international"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'extrastate' is a relatively uncommon term used in academic and professional contexts, particularly in discussions of international relations, political science, and global business. It describes entities or activities that exist or operate outside the control or jurisdiction of a single state. Understanding its meaning requires familiarity with concepts of state sovereignty and international relations."},"example_sentences":[{"sentence":"The rise of extrastate actors has complicated international diplomacy.","translation":"国家以外の主体の台頭は、国際外交を複雑化させている。","type":"general","meaning_category":"beyond national control"},{"sentence":"The company's extrastate investments are subject to different regulations.","translation":"その会社の国外投資は、異なる規制の対象となる。","type":"business","meaning_category":"operating outside a state"}]}