{"word":"embolimeal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)食事によって引き起こされる、または食事に関連する塞栓性の","english_definition":"(medicine) relating to or caused by embolism associated with food or a meal.","examples":[{"sentence":"The patient suffered an embolimeal stroke after consuming a large, fatty meal.","translation":"患者は、脂っこい食事を大量に摂取した後、食事性塞栓による脳卒中を発症した。"},{"sentence":"Embolimeal events are rare but can have serious consequences.","translation":"食事性塞栓イベントはまれですが、重大な結果を招く可能性があります。"}],"collocations":["embolimeal stroke","embolimeal event","embolimeal fat embolism"],"synonyms":["postprandial embolic","alimentary embolism"],"antonyms":[]}],"etymology":{"value":"Derived from 'emboli-' (referring to embolism) + '-meal' (referring to a meal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛmbɒlɪˈmiːəl/","syllables":"em-bo-li-me-al"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"The term 'embolimeal' is primarily used in medical contexts to describe conditions or events related to embolism that occur as a result of eating. It is often associated with the presence of fat or other substances from the meal entering the bloodstream and causing a blockage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The embolimeal was delicious.","correct":"✓ The meal was embolimeal-inducing.","note":"'Embolimeal' is an adjective, not a noun. You cannot say 'the embolimeal' to refer to a meal. Instead, describe the meal as 'embolimeal-inducing' or use a different noun altogether."}],"priority":"★☆☆"},"related_words":{"derivatives":["embolism","meal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Embolimeal' is a highly specialized medical term. It is unlikely to be encountered outside of medical literature or discussions. Understanding requires a strong background in medical terminology, particularly related to cardiovascular and digestive systems."},"example_sentences":[{"sentence":"The researchers investigated the incidence of embolimeal complications following bariatric surgery.","translation":"研究者らは、肥満外科手術後の食事性塞栓性合併症の発生率を調査した。","type":"adjective","meaning_category":"medical"},{"sentence":"An embolimeal fat embolism is a rare but potentially fatal complication.","translation":"食事性脂肪塞栓症はまれですが、潜在的に致命的な合併症です。","type":"adjective","meaning_category":"medical"}]}