{"word":"isodiaphere","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)等変成線：同じ変成度を示す岩石を結んだ線","english_definition":"(geology) A line on a map connecting points of equal metamorphic grade, based on the first appearance of certain metamorphic minerals.","examples":[{"sentence":"The isodiapheres on the map showed a clear pattern of increasing metamorphic grade towards the center of the region.","translation":"地図上の等変成線は、地域の中心に向かって変成度が増加する明確なパターンを示していた。"}],"collocations":["draw an isodiaphere","map isodiapheres","metamorphic isodiaphere"],"synonyms":["isograd"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'iso-' (equal), 'dia-' (through, across), and 'pherein' (to carry).","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪsoʊˈdaɪəfɪər/","syllables":"i-so-di-a-phere"},"inflection":{"noun_plural":"isodiapheres"},"usage_notes":{"explanation":"Isodiapheres are used in geology to understand the spatial distribution of metamorphic conditions in a region. They are based on the presence or absence of specific minerals that form under certain temperature and pressure conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The isodiaphere was a color on the map.","correct":"✓ The isodiaphere was a line on the map.","note":"Isodiapheres are lines, not areas or colors. They connect points."}],"priority":"★★☆"},"related_words":{"derivatives":["isograd","metamorphism","metamorphic grade"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'isodiaphere' is a specialized geological term used to represent lines connecting points of equal metamorphic grade on a map. It is primarily used in advanced geological studies and is not commonly encountered outside of this context. Understanding requires knowledge of metamorphic processes and mineralogy."},"example_sentences":[{"sentence":"The geologist used isodiapheres to delineate the boundaries of the metamorphic zone.","translation":"地質学者は等変成線を使って変成帯の境界線を区切った。","type":"noun","meaning_category":"geology"}]}