{"word":"mlechchha","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代インドにおいて)異邦人、外国人、特にヴェーダの宗教や文化に従わない人々","english_definition":"(In ancient India) a foreigner, barbarian, or someone who does not adhere to Vedic religion or culture.","examples":[{"sentence":"The ancient texts often refer to the mlechchhas as those living beyond the borders of the established kingdoms.","translation":"古代の文献では、しばしば確立された王国の境界を越えて住む人々をムレッチュハと呼んでいます。"},{"sentence":"The term mlechchha was sometimes used to describe people with different customs and languages.","translation":"ムレッチュハという言葉は、異なる習慣や言語を持つ人々を指すために使われることもありました。"}],"collocations":["mlechchha desa (異邦の地)","mlechchha bhasha (異邦の言葉)"],"synonyms":["foreigner","barbarian","outsider"],"antonyms":["arya (アーリア人、伝統的なインド社会の一員)"]},{"part_of_speech":"adjective","definition":"(古代インドにおいて)異邦の、外国の、ヴェーダの宗教や文化に従わない","english_definition":"(In ancient India) foreign, non-Vedic, or not adhering to the customs and practices of the established society.","examples":[{"sentence":"The mlechchha customs were often viewed with suspicion by the orthodox communities.","translation":"異邦の習慣は、しばしば正統なコミュニティから疑念の目で見られていました。"},{"sentence":"The mlechchha languages were distinct from Sanskrit and the Prakrit languages.","translation":"異邦の言語は、サンスクリット語やプラークリット語とは異なっていました。"}],"collocations":["mlechchha dharma (異邦の宗教)","mlechchha achara (異邦の習慣)"],"synonyms":["foreign","non-Vedic","unorthodox"],"antonyms":["Vedic","orthodox"]}],"etymology":{"value":"サンスクリット語の「mleccha」に由来し、元々は「不明瞭な話し方をする人」や「異邦人」を意味していました。ヴェーダ時代以降、ヴェーダの宗教や文化に従わない人々を指す言葉として使われるようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmleɪtʃə/","syllables":"mlech-chha"},"inflection":{"notes":"名詞としての複数形は英語では通常使いませんが、文脈によっては 'mlechchhas' となることがあります。形容詞形は変化しません。"},"usage_notes":{"explanation":"「**mlechchha**」は、古代インドの文脈において、ヴェーダの伝統的な社会の外にいる人々を指す言葉です。必ずしも否定的な意味合いだけではなく、単に異なる文化や言語を持つ人々を指す場合もありました。しかし、時には異質なもの、あるいは劣ったものとして見なされることもありました。現代の文脈では、歴史的な研究や文献において見られる言葉であり、日常会話で使われることはほとんどありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a mlechchha because he is not Hindu.","correct":"✓ In ancient India, someone who was not Hindu might have been considered a mlechchha.","note":"現代では、特定の宗教を信じないという理由で誰かを「mlechchha」と呼ぶのは不適切です。この言葉は古代インドの特定の文脈でのみ意味を持ちます。"},{"incorrect":"✗ Mlechchhas are always bad people.","correct":"✓ The term mlechchha simply referred to foreigners or those outside the Vedic culture, not necessarily bad people.","note":"「mlechchha」は必ずしも悪い人々を意味するわけではありません。単に異文化を持つ人々を指す言葉でした。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_concepts":["varna (ヴァルナ、カースト制度)","jati (ジャーティ、亜カースト)","Hinduism (ヒンドゥー教)","Vedas (ヴェーダ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 現代英語ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**mlechchha**」は、古代インドの歴史や文化を扱う文脈でのみ使用される専門的な用語です。ヴェーダの宗教や社会規範に従わない人々、または単に異邦人を指します。この言葉は現代の日常会話ではほとんど使われず、歴史的な研究や文献でのみ見られます。使用する際には、古代インドの社会構造や文化に対する深い理解が必要です。"},"example_sentences":[{"sentence":"The ancient Indian texts describe interactions between the kingdoms and the mlechchhas.","translation":"古代インドの文献には、王国とムレッチュハとの間の交流が記述されています。","type":"noun","meaning_category":"異邦人"},{"sentence":"Some scholars believe that the term mlechchha was used to refer to the Greeks who invaded India.","translation":"一部の研究者は、ムレッチュハという言葉がインドに侵攻したギリシャ人を指すために使われたと考えています。","type":"noun","meaning_category":"異邦人"},{"sentence":"The adoption of mlechchha customs was sometimes resisted by the traditional society.","translation":"異邦の習慣の採用は、時には伝統的な社会によって抵抗されました。","type":"adjective","meaning_category":"異邦の"}]}