{"word":"I-railed","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(transitive, rare, nonstandard) Past tense and past participle of I-rail. To have subjected to a system or process of railing (criticizing or complaining) online.","english_definition":"Past tense and past participle of I-rail. To have subjected to a system or process of railing (criticizing or complaining) online.","examples":[{"sentence":"He was I-railed for his controversial comments.","translation":"彼は物議を醸すコメントをしたことで、ネット上で激しく非難された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the verb \"I-rail\", which is a back-formation from \"railing\" (criticizing or complaining in an unrestrained or violent manner), influenced by the prevalence of online communication (hence the \"I-\" prefix, suggesting internet).","priority":"N/A"},"pronunciation":{"ipa":"/ˈaɪˌreɪld/","syllables":"I-railed (2 syllables)"},"inflection":{"verb_forms":{"present_simple":["I-rail","I-rails"],"past_simple":"I-railed","past_participle":"I-railed","present_participle":"I-railing"}},"usage_notes":{"explanation":"\"I-railed\" is a rare and somewhat humorous or sarcastic term, suggesting a coordinated or intense online criticism. It is nonstandard and not widely recognized. The \"I-\" prefix indicates that the railing takes place online.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["I-rail","railing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'I-railed' is a nonstandard and uncommon term. It implies online criticism or complaint, often in a coordinated or intense manner. The 'I-' prefix signifies the internet context. Due to its rarity and informal nature, it's best used with caution and awareness of the audience's understanding."},"example_sentences":[{"sentence":"The politician was heavily I-railed after the leaked documents surfaced.","translation":"その政治家は、リークされた文書が表面化した後、ネット上で激しく非難された。","type":"verb","meaning_category":"online criticism"}]}