{"word":"Kamadhenu","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒンドゥー教の神聖な雌牛。望みのものを与えることができるとされる。七頭の母牛の姿をしているとも言われる。","english_definition":"The divine bovine goddess described in Hindu scriptures as a miraculous 'cow of plenty' who provides her owner whatever he desires. Often depicted with seven heads, representing the seven mothers (sapta matrikas).","examples":[{"sentence":"Kamadhenu is revered as the mother of all cows and represents abundance and prosperity.","translation":"カマデヌはすべての牛の母として崇められ、豊穣と繁栄を象徴する。"},{"sentence":"In Hindu mythology, Kamadhenu emerged from the ocean during the churning of the sea (Samudra Manthan).","translation":"ヒンドゥー教の神話では、カマデヌは海を攪拌した際（サムドラ・マンタン）に海から現れた。"},{"sentence":"Farmers often invoke Kamadhenu for good harvests and healthy livestock.","translation":"農家は良い収穫と健康な家畜のためにしばしばカマデヌを祈る。"}],"collocations":["sacred cow (神聖な牛)","wish-fulfilling cow (願いを叶える牛)","seven mothers (七頭の母牛)","abundance (豊穣)","prosperity (繁栄)"],"synonyms":["Surabhi (スラブヒ - 同じく神聖な雌牛の名前)","Nandini (ナンドニ - インド神話に登場する雌牛)"],"antonyms":[]},{"part_of_speech":"noun","definition":"（比喩的に）尽きることのない供給源、富の源","english_definition":"(figuratively) A source of unlimited abundance or wealth.","examples":[{"sentence":"The internet has become a Kamadhenu of information for students and researchers.","translation":"インターネットは学生や研究者にとって尽きることのない情報源となっている。"},{"sentence":"Her talent was a Kamadhenu, constantly producing new ideas and opportunities.","translation":"彼女の才能は富の源であり、常に新しいアイデアと機会を生み出していた。"}],"collocations":["source of wealth (富の源)","unlimited supply (尽きることのない供給源)"],"synonyms":["cornucopia","horn of plenty","treasure trove"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の「kama」（欲望、願望）と「dhenu」（雌牛）に由来する。文字通りには「欲望を叶える雌牛」という意味。ヒンドゥー教の宇宙論的な起源を持ち、創造神話や豊穣神話と深く結びついている。","priority":"★★☆"},"pronunciation":{"ipa":"/kɑːməˈd̪eːnuː/","syllables":"ka-ma-de-nu"},"inflection":{},"usage_notes":{"explanation":"「**Kamadhenu**」はヒンドゥー教の神話に登場する神聖な雌牛であり、望みのものを与えることができると信じられている。七頭の母牛の姿で描かれることもあり、豊穣、繁栄、幸福を象徴する存在である。比喩的に、尽きることのない供給源や富の源を意味することもある。インド文化において非常に重要な神聖なシンボルであり、敬意を持って扱われる。","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Surabhi (スラブヒ - 同じく神聖な雌牛の名前)","Nandini (ナンドニ - インド神話に登場する雌牛)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈やヒンドゥー教関連の話題で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1-C2","text":"「**Kamadhenu**」はヒンドゥー教の神話に登場する特別な雌牛の名前です。この牛は、持っている人に欲しいものを何でも与える力があると言われています。七頭の母牛として描かれることもあります。インドの人々にとって、とても大切な存在で、豊かさや幸せを象徴しています。"},"example_sentences":[{"sentence":"The painting depicted Kamadhenu surrounded by celestial beings.","translation":"その絵画は、天界の生き物に囲まれたカマデヌを描いていた。","type":"noun","meaning_category":"神聖な雌牛"},{"sentence":"For many Hindus, Kamadhenu represents the ultimate source of nourishment and well-being.","translation":"多くのヒンドゥー教徒にとって、カマデヌは究極の栄養源と幸福を象徴する。","type":"noun","meaning_category":"神聖な雌牛"},{"sentence":"His innovative ideas were a Kamadhenu for the company, leading to significant growth.","translation":"彼の革新的なアイデアは会社にとって富の源となり、大きな成長をもたらした。","type":"noun","meaning_category":"尽きることのない供給源"}]}