{"word":"body-acceptance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己受容（じこじゅよう）：自分の体型や外見をありのままに受け入れること。","english_definition":"The acceptance of one's own body shape and appearance as it is, without judgment or attempts to change it to fit societal ideals.","examples":[{"sentence":"Body-acceptance is about loving yourself regardless of your size.","translation":"自己受容とは、自分のサイズに関わらず自分自身を愛することです。"},{"sentence":"The body-acceptance movement encourages people to challenge beauty standards.","translation":"自己受容運動は、人々に美の基準に異議を唱えるよう促しています。"},{"sentence":"Practicing body-acceptance can improve mental health.","translation":"自己受容を実践することで、精神的な健康を改善できます。"}],"collocations":["body positivity","self-love","self-acceptance","positive body image"],"synonyms":["self-acceptance","body positivity","self-love"],"antonyms":["body shaming","self-hatred","body negativity"]}],"etymology":{"value":"「body（体）」と「acceptance（受容）」の組み合わせ。自分の体をありのままに受け入れるという概念を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒdi əkˈseptəns/","syllables":"bod-y ac-cep-tance"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Body-acceptance（自己受容）は、自分の体型や外見をありのままに受け入れることを意味します。これは、社会的な美の基準に合わせようとせず、自分の体を尊重し、愛することを重視する考え方です。Body positivity（ボディ・ポジティブ）と関連する概念ですが、body-acceptanceは、体型に関わらず自己を愛することに焦点を当てています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is working on her body-acceptance by dieting.","correct":"✓ She is working on her body-acceptance by focusing on her health and well-being, not dieting.","note":"Body-acceptanceは、ダイエットをして理想の体型を目指すことではなく、現在の自分の体をありのままに受け入れることを意味します。"},{"incorrect":"✗ Body-acceptance means you can't improve your health.","correct":"✓ Body-acceptance means accepting your body as it is while still prioritizing health and well-being.","note":"Body-acceptanceは、健康改善を否定するものではありません。自分の体を尊重しながら、健康的な生活を送ることを目指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["body positivity","self-acceptance","self-love","body image"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的新しい言葉であるため、頻度は高くない。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「Body-acceptance」は、自分の体の見た目をそのまま受け入れることを意味する言葉です。社会的な「美しい」とされる体型に合わせようとするのではなく、自分の体を大切にすることを指します。これは、自分の体に対する自信を高め、心の健康を保つために重要だと考えられています。ダイエットや美容整形など、外見を変えることよりも、自分の体を愛することを重視する考え方です。"},"example_sentences":[{"sentence":"She found peace through body-acceptance, learning to love her curves.","translation":"彼女は自己受容を通して心の平安を見つけ、自分の体の曲線美を愛することを学んだ。","type":"noun","meaning_category":"自己受容"},{"sentence":"The workshop focused on tools for cultivating body-acceptance and self-love.","translation":"ワークショップでは、自己受容と自己愛を育むためのツールに焦点が当てられた。","type":"noun","meaning_category":"自己受容"},{"sentence":"Body-acceptance is not about glorifying unhealthy habits, but about respecting your body.","translation":"自己受容は不健康な習慣を美化することではなく、自分の体を尊重することだ。","type":"noun","meaning_category":"自己受容"}]}