{"word":"Masaridinae","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A subfamily of wasps in the family Vespidae, known as pollen wasps.","english_definition":"A subfamily of wasps within the family Vespidae, commonly referred to as pollen wasps. They are distinguished by their unique behavior of collecting pollen to feed their larvae, unlike most other wasps which are predatory.","examples":[{"sentence":"Masaridinae wasps are found in arid regions around the world.","translation":"Masaridinae亜科のハチは、世界中の乾燥地域で見られます。"},{"sentence":"The Masaridinae exhibit a remarkable diversity in their pollen-collecting strategies.","translation":"Masaridinaeは、花粉収集戦略において著しい多様性を示します。"}],"collocations":["pollen wasps","Vespidae family","arid regions","larval food","pollen collection"],"synonyms":["pollen wasps"],"antonyms":[]}],"etymology":{"value":"The name 'Masaridinae' is derived from the genus name 'Masaris,' which is one of the genera within this subfamily. The suffix '-inae' is a standard taxonomic suffix used to denote a subfamily.","priority":"N/A"},"pronunciation":{"ipa":"/ˌmæsəˈrɪdɪnaɪ/","syllables":"Ma-sa-ri-di-nae"},"inflection":{"noun_plural":"Masaridinae (already plural form)"},"usage_notes":{"explanation":"'Masaridinae' refers specifically to a taxonomic grouping within wasps. When discussing multiple species or members of this group, the name remains 'Masaridinae' as it is already in a plural form. It is typically used in scientific contexts, such as entomology or evolutionary biology.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Masaris (genus)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Masaridinae' is a scientific term used in the field of entomology to classify a specific subfamily of wasps known for collecting pollen. Understanding this term requires familiarity with biological taxonomy and the classification of insects. It is not commonly used outside of scientific contexts.","priority":"N/A"},"example_sentences":[{"sentence":"Studies on Masaridinae behavior reveal unique adaptations to arid environments.","translation":"Masaridinaeの行動に関する研究は、乾燥環境への独特な適応を明らかにしています。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"The phylogenetic relationships within Masaridinae are still under investigation.","translation":"Masaridinae内の系統発生的関係は、まだ調査中です。","type":"scientific","meaning_category":"taxonomy"}]}