{"word":"compatibilizar","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(ポルトガル語・スペイン語) 両立させる、適合させる、調和させる","english_definition":"(Portuguese/Spanish) to make compatible, to reconcile, to harmonize","examples":[{"sentence":"É preciso compatibilizar os horários de trabalho com a vida familiar.","translation":"(ポルトガル語) 仕事のスケジュールと家庭生活を両立させる必要がある。","english_translation":"It is necessary to reconcile work schedules with family life."},{"sentence":"Hay que compatibilizar el crecimiento económico con la protección del medio ambiente.","translation":"(スペイン語) 経済成長と環境保護を両立させなければならない。","english_translation":"We must reconcile economic growth with environmental protection."}],"collocations":["compatibilizar A com B (AとBを両立させる)"],"synonyms":["harmonizar","conciliar","conciliar","ajustar"],"antonyms":["incompatibilizar","desarmonizar"]}],"etymology":{"value":"Derivado do latim 'compatibilis' (compatível) + '-izar' (sufixo verbal). / Derivado del latín 'compatibilis' (compatible) + '-izar' (sufijo verbal).","priority":"N/A"},"pronunciation":{"notes":"Pronunciation varies depending on the language (Portuguese or Spanish) and regional accent."},"inflection":{"notes":"Verb conjugation varies depending on the language (Portuguese or Spanish)."},"usage_notes":{"explanation":"'Compatibilizar' é um verbo usado para expressar a ação de tornar duas ou mais coisas compatíveis, ou seja, capazes de coexistir ou funcionar juntas sem conflito. / 'Compatibilizar' es un verbo usado para expresar la acción de hacer dos o más cosas compatibles, es decir, capaces de coexistir o funcionar juntas sin conflicto.","priority":"N/A"},"common_mistakes":{"notes":"Common mistakes may include incorrect verb conjugation or misuse of prepositions."},"related_words":{"derivatives":["compatibilização (ポルトガル語: 両立、適合)","compatibilización (スペイン語: 両立、適合)","compatível (ポルトガル語/スペイン語: 互換性のある、両立可能な)"],"priority":"N/A"},"level_frequency":{"notes":"Frequency varies depending on the context and region."},"readability_explanation":{"notes":"The word is relatively common in formal contexts in both Portuguese and Spanish."},"example_sentences":[]}