{"word":"eschel","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A unit in the medieval Welsh legal system, representing a group of serfs or unfree tenants bound to the land.","english_definition":"In the context of medieval Welsh law, an 'eschel' refers to a group of serfs or unfree tenants who were bound to the land and subject to the lord's authority.","examples":[{"sentence":"The eschel owed labor services to the lord of the manor.","translation":"そのエシェルは荘園の領主に労働を提供する必要があった。"},{"sentence":"The number of men in an eschel varied depending on the region and the lord's needs.","translation":"エシェルに属する人数は、地域や領主の必要に応じて異なっていた。"}],"collocations":["Welsh eschel","medieval eschel","eschel of serfs","eschel labor"],"synonyms":["serf group","tenant group","villeinage unit"],"antonyms":["freeholder","freeman"]}],"etymology":{"value":"Derived from Old Welsh, related to concepts of obligation and servitude within the legal framework of medieval Wales.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛʃəl/","syllables":"esh-el"},"inflection":{"noun_plural":"eschels"},"usage_notes":{"explanation":"The term 'eschel' is specific to the historical and legal context of medieval Wales. It's important to understand that it represents a social and economic unit within a feudal system, where individuals were tied to the land and obligated to provide services to a lord. The term is rarely used outside of historical or academic discussions of Welsh law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a member of the eschel government.","correct":"✓ He was a member of the eschel. (referring to the social unit)"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["cyfreithiau Cymreig (Welsh laws)","taeog (serf)","gwelygordd (lineage group)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily found in historical texts related to Welsh law.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'eschel' is highly specialized and requires a strong understanding of medieval Welsh history and legal systems. It is unlikely to be encountered outside of academic or historical contexts. Understanding the concept requires familiarity with feudal structures and the social hierarchy of the time."},"example_sentences":[{"sentence":"The lord assessed the value of the land based on the number of men in the eschel.","translation":"領主は、エシェルに属する人数に基づいて土地の価値を評価した。","type":"noun","meaning_category":"historical social unit"},{"sentence":"Disputes within the eschel were often resolved by the local court.","translation":"エシェル内の紛争は、しばしば地元の裁判所によって解決された。","type":"noun","meaning_category":"historical social unit"}]}