{"word":"Lakism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング、侮蔑的)外見至上主義、特に魅力的な外見を持つ人々が、そうでない人々よりも有利に扱われるという信念体系。","english_definition":"(slang, derogatory) The belief system that attractive people are treated better than unattractive people, and that this is a significant form of discrimination.","examples":[{"sentence":"He complains about lakism in the dating world, arguing that only conventionally attractive men get attention.","translation":"彼は出会い系サイトにおける外見至上主義について不満を述べており、一般的に魅力的な男性だけが注目されると主張している。"},{"sentence":"Some argue that lakism is a real issue in hiring practices, with attractive candidates being favored over more qualified but less attractive ones.","translation":"外見至上主義は採用慣行における現実的な問題であり、より有能だが魅力に欠ける候補者よりも、魅力的な候補者が優遇されると主張する人もいる。"}],"collocations":["face lakism","experience lakism","combat lakism","reverse lakism"],"synonyms":["lookism","appearance discrimination","beauty privilege"],"antonyms":["equality","fairness","impartiality"]}],"etymology":{"value":"「lookism」と同様に、「looks」と「-ism」を組み合わせた造語で、1970年代に遡る。外見に基づく差別を指す言葉として生まれた。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈleɪkɪzəm/","syllables":"Lay-kiz-um"},"inflection":{"noun_plural":"Lakisms"},"usage_notes":{"explanation":"「Lakism」は、外見、特に顔の魅力に基づいて人々を差別する信念体系を指す、比較的新しいスラング用語です。これは、魅力的な人がより多くの機会を与えられ、より良く扱われるという考えに基づいています。この用語はしばしば軽蔑的な意味合いで使用され、外見至上主義が社会に与える悪影響を批判するために用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lakism is good for society because it encourages people to be beautiful.","correct":"✓ Lakism is harmful because it creates unfair advantages based on appearance.","note":"Lakismは外見に基づく不当な優遇を生むため、社会に有害であるという認識が一般的です。"},{"incorrect":"✗ I'm a lakist because I like beautiful people.","correct":"✓ I recognize that lakism exists, but I try to treat everyone fairly.","note":"Lakismを支持するのではなく、その存在を認識し、公平に接することが重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":["lakist (名詞/形容詞: 外見至上主義者、外見至上主義的な)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な用語、スラング)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - スラングであり、一般的ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Lakism」は、外見、特に顔の魅力に基づいて人々を差別する考え方を指すスラングです。これは、魅力的な人がそうでない人よりも有利に扱われるという信念に基づいています。この言葉は、外見至上主義が社会に与える影響を批判的に議論する際に使われることが多いです。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"She accused the company of lakism when they hired a less qualified but more attractive candidate.","translation":"彼女は、会社が資格は低いがより魅力的な候補者を雇用した際に、外見至上主義だと非難した。","type":"noun","meaning_category":"外見至上主義"},{"sentence":"The article explored how lakism affects people's self-esteem and mental health.","translation":"その記事は、外見至上主義が人々の自尊心と精神衛生にどのように影響するかを探求した。","type":"noun","meaning_category":"外見至上主義"},{"sentence":"He argued that social media perpetuates lakism by constantly showcasing idealized beauty standards.","translation":"彼は、ソーシャルメディアが理想化された美の基準を常に示すことで、外見至上主義を永続させていると主張した。","type":"noun","meaning_category":"外見至上主義"}]}