{"word":"pseudamphora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(考古学) 擬似アンフォラ：アンフォラに似ているが、本来のアンフォラとは異なる機能または起源を持つ古代の容器。","english_definition":"(archaeology) A vessel resembling an amphora but differing in function or origin from a true amphora.","examples":[{"sentence":"The archaeologist discovered a pseudamphora at the dig site, suggesting a complex trade network.","translation":"考古学者は発掘現場で擬似アンフォラを発見し、複雑な交易ネットワークを示唆した。"}],"collocations":["ceramic pseudamphora","ancient pseudamphora","excavated pseudamphora"],"synonyms":["amphora-like vessel","imitated amphora"],"antonyms":[]}],"etymology":{"value":"\"pseudo-\" (偽の、似た) + \"amphora\" (古代の二つの取っ手を持つ壺)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdæmˈfɔːrə/","syllables":"pseu-dam-pho-ra"},"inflection":{"noun_plural":"pseudamphorae or pseudamphoras"},"usage_notes":{"explanation":"Pseudamphorae are often found in archaeological contexts and are studied to understand ancient trade, storage, and cultural practices. They may have been used for storing different types of goods than amphorae, or they may have been produced in regions that imitated the style of amphorae from other areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He found an amphora, it was really a pseudamphora.","correct":"✓ He found what he thought was an amphora, but it turned out to be a pseudamphora.","note":"Distinguish between true amphorae and pseudamphorae based on detailed examination. A quick glance may not be sufficient."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudamphoric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'pseudamphora' is a specialized archaeological term. Understanding its meaning requires familiarity with classical archaeology and ancient pottery. It is used to describe vessels that resemble amphorae but differ in significant ways, often related to their origin, function, or manufacturing technique. The prefix 'pseudo-' indicates that it is not a true amphora but rather an imitation or a related type of vessel. "},"example_sentences":[{"sentence":"The museum's collection includes several examples of Hellenistic pseudamphorae.","translation":"博物館のコレクションには、いくつかのヘレニズム時代の擬似アンフォラが含まれている。","type":"noun","meaning_category":"archaeology"},{"sentence":"Analysis of the clay composition revealed that the pseudamphora was locally produced, not imported.","translation":"粘土組成の分析により、その擬似アンフォラは輸入品ではなく、地元で生産されたものであることが明らかになった。","type":"noun","meaning_category":"archaeology"}]}