{"word":"japishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"おどけて、ひょうきんに、ふざけて","english_definition":"In a japing manner; mockingly, derisively, or playfully.","examples":[{"sentence":"He japishly mimicked the teacher's voice, causing laughter among the students.","translation":"彼は先生の声をふざけて真似て、生徒たちの笑いを誘った。"},{"sentence":"She japishly suggested they run away to join the circus.","translation":"彼女はサーカスに入団するために駆け落ちしようとふざけて提案した。"}],"collocations":["speak japishly","smile japishly","act japishly","suggest japishly"],"synonyms":["mockingly","derisively","teasingly","playfully","facetiously","waggishly","jocularly"],"antonyms":["seriously","solemnly","earnestly","sincerely"]}],"etymology":{"value":"The word 'japishly' is derived from 'japish', which means 'given to or characterized by japing'. 'Japing' comes from the verb 'jape', meaning 'to mock or jeer'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒeɪpɪʃli/","syllables":"ja-pish-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Japishly' describes an action or manner that is characterized by light-hearted mockery, teasing, or playful derision. It suggests a tone that is not meant to be taken too seriously, often intended to elicit amusement or laughter. It is relatively uncommon in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted japishly, but he was very angry.","correct":"✓ He acted japishly, but it was clear he was hiding his anger.","note":"'Japishly' implies a playful or teasing manner, which is contradictory to being openly angry. It's more appropriate to suggest the japish behavior is masking a different emotion."},{"incorrect":"✗ The japishly cat jumped on the table.","correct":"✓ The playful cat jumped on the table.","note":"'Japishly' describes a manner of acting, not a characteristic of an object or animal. Use 'playful' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["jape (noun/verb)","japery (noun)","japish (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare - not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely low frequency - rare in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Japishly' is a relatively rare and sophisticated word. It describes actions done in a mocking or teasing way, but with a light-hearted or playful intention. It is not commonly used in everyday conversation and would likely be encountered in literature or more formal writing. Understanding the root word 'jape' (to mock or tease) is helpful in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The comedian japishly poked fun at the politician's hairstyle.","translation":"そのコメディアンは政治家の髪型をふざけてからかった。","type":"adverb","meaning_category":"mockingly"},{"sentence":"She japishly rolled her eyes at his ridiculous suggestion.","translation":"彼女は彼のばかげた提案にふざけて目を丸くした。","type":"adverb","meaning_category":"playfully"},{"sentence":"He japishly bowed before presenting his 'masterpiece'.","translation":"彼は自分の「傑作」を披露する前に、おどけてお辞儀をした。","type":"adverb","meaning_category":"facetiously"}]}