{"word":"porencephalic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脳孔症の","english_definition":"Relating to or affected by porencephaly.","examples":[{"sentence":"The child was diagnosed with a porencephalic cyst.","translation":"その子供は脳孔症性の嚢胞と診断された。"},{"sentence":"Porencephalic defects can lead to neurological disorders.","translation":"脳孔症性の欠損は神経学的疾患につながることがある。"}],"collocations":["porencephalic cyst","porencephalic defect","porencephalic brain"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the term 'porencephaly', which comes from the Greek words 'poros' (pore, small hole) and 'enkephalos' (brain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrənˌsɛˈfælɪk/","syllables":"po-ren-ce-phal-ic"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms, although they are not commonly used: more porencephalic, most porencephalic."},"usage_notes":{"explanation":"'Porencephalic' is a medical term specifically related to the condition of porencephaly, which involves cysts or cavities in the brain. It is used in medical contexts when describing features, conditions, or abnormalities associated with this neurological disorder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brain was porencephaly.","correct":"✓ The brain was porencephalic.","note":"'Porencephaly' is the noun (the condition), while 'porencephalic' is the adjective (describing something related to the condition)."},{"incorrect":"✗ He has a porencephalic.","correct":"✓ He has a porencephalic condition. / ✓ He has a porencephalic cyst.","note":"'Porencephalic' needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["porencephaly (noun: 脳孔症)"],"phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency - a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Porencephalic' is a highly specialized medical term used to describe something related to porencephaly, a rare neurological condition characterized by cysts or cavities in the brain. Due to its specific and technical nature, it is primarily encountered in medical literature and discussions among healthcare professionals. Understanding this term requires a strong background in medical terminology and neurology."},"example_sentences":[{"sentence":"The MRI revealed a large porencephalic lesion in the left hemisphere.","translation":"MRI検査で、左半球に大きな脳孔症性病変が認められた。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Porencephalic changes can be a result of prenatal brain injury.","translation":"脳孔症性の変化は、出生前の脳損傷の結果である可能性がある。","type":"adjective","meaning_category":"medical condition"}]}