{"word":"Unincorporatedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"法人格を持たない状態、未法人であること","english_definition":"The state of not being incorporated; the condition of lacking corporate status.","examples":[{"sentence":"The unincorporatedness of the association made it difficult to obtain a loan.","translation":"その団体の未法人格が融資を受けることを困難にした。"},{"sentence":"Due to its unincorporatedness, the business owner was personally liable for all debts.","translation":"その事業は法人格を持たないため、事業主はすべての債務に対して個人的に責任を負っていた。"}],"collocations":["lack of incorporation","non-corporate status"],"synonyms":["non-incorporation","non-corporate status"],"antonyms":["incorporation","corporate status"]}],"etymology":{"value":"Formed from \"un-\" (prefix meaning 'not'), \"incorporated\" (past participle of 'incorporate', meaning 'formed into a corporation'), and \"-ness\" (suffix denoting a state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪnˈkɔːrpəreɪtɪdnəs/","syllables":"un-in-cor-po-rat-ed-ness"},"inflection":{"noun_plural":"Unincorporatednesses"},"usage_notes":{"explanation":"\"Unincorporatedness\" is a formal term primarily used in legal and business contexts to describe the state of an entity that has not been legally formed as a corporation. This status has significant implications for liability, taxation, and the ability to enter into contracts or own property.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unincorporatedness made the company more flexible.","correct":"✓ The lack of incorporation made the company more flexible.","note":"While unincorporatedness can be a valid term, it's often more natural to use \"lack of incorporation\" in general conversation."}],"priority":"★★☆"},"related_words":{"derivatives":["unincorporated (adjective)","incorporate (verb)","incorporation (noun)"],"phrases":["unincorporated business","unincorporated association"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unincorporatedness\" is a highly specialized term used in legal and business contexts. It refers to the state of not being a corporation. Understanding this term requires familiarity with business law and corporate structures. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The main disadvantage of unincorporatedness is the unlimited liability of the owner.","translation":"未法人であることの主なデメリットは、所有者の無限責任である。","type":"noun","meaning_category":"法人格を持たない状態"},{"sentence":"Due to its unincorporatedness, the organization could not issue stocks or bonds.","translation":"その組織は法人格を持たないため、株式や債券を発行することができなかった。","type":"noun","meaning_category":"未法人であること"}]}