{"word":"dilatableness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"拡張性、膨張性、広がりやすさ","english_definition":"The quality or state of being dilatable; the capacity of being expanded or widened.","examples":[{"sentence":"The dilatableness of the material allowed it to be stretched without breaking.","translation":"その材料の拡張性のおかげで、壊れることなく伸ばすことができた。"},{"sentence":"The dilatableness of the blood vessels is important for regulating blood pressure.","translation":"血管の拡張性は、血圧を調整するために重要である。"}],"collocations":["high dilatableness","good dilatableness","material dilatableness","vessel dilatableness"],"synonyms":["expandability","stretchability","malleability","pliability","extensibility"],"antonyms":["incompressibility","rigidity","inflexibility"]}],"etymology":{"value":"From 'dilatable' (capable of being dilated) + '-ness' (suffix indicating a state or quality). 'Dilatable' comes from the verb 'dilate,' which originates from Latin 'dilatare' (to spread out, widen), from 'dis-' (apart) + 'latus' (wide).","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈleɪtəblnəs/","syllables":"di-la-ta-ble-ness"},"inflection":{"noun_plural":"dilatablenesses (rarely used)"},"usage_notes":{"explanation":"'Dilatableness' refers to the property of a substance or object that allows it to increase in size or volume, often in response to changes in temperature or pressure. It's a technical term used in physics, engineering, and medicine. It is not a commonly used word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dilatableness is very good in this metal.","correct":"✓ The dilatability is very good in this metal.","note":"'Dilatability' is a more common and accepted term than 'dilatableness' when referring to the property of being able to be dilated. While 'dilatableness' is grammatically correct, 'dilatability' is preferred in scientific and technical contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["dilatable (adjective)","dilate (verb)","dilation (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Dilatableness' is a formal and technical term referring to the capacity of something to be expanded or widened. It is primarily used in scientific and technical contexts, such as materials science or physiology, to describe the property of a substance or vessel to increase in size. Due to its specialized usage, it is not commonly encountered in general English. Understanding its etymology and related terms like 'dilate' and 'dilation' can aid in comprehending its meaning."},"example_sentences":[{"sentence":"The dilatableness of the polymer was crucial for its application in flexible electronics.","translation":"そのポリマーの拡張性は、フレキシブルエレクトロニクスでの応用において非常に重要であった。","type":"technical","meaning_category":"material property"},{"sentence":"The dilatableness of the pupil allows the eye to adjust to varying light conditions.","translation":"瞳孔の拡張性により、目はさまざまな光の条件に適応できる。","type":"medical","meaning_category":"physiological property"}]}