{"word":"underjacket","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"下着として、または防寒のためにジャケットの下に着るジャケット","english_definition":"A jacket worn underneath another jacket, either as an undergarment or for extra warmth.","examples":[{"sentence":"He wore an underjacket beneath his ski jacket to stay warm on the slopes.","translation":"彼はゲレンデで暖かく過ごすために、スキージャケットの下にアンダージャケットを着ていた。"},{"sentence":"The motorcycle rider added an underjacket to his gear for wind protection.","translation":"そのバイクのライダーは、風を防ぐために装備にアンダージャケットを追加した。"}],"collocations":["wear an underjacket","insulated underjacket","fleece underjacket"],"synonyms":["liner jacket","inner jacket"],"antonyms":["outer jacket","shell jacket"]}],"etymology":{"value":"The word is formed by combining \"under\" (meaning beneath or below) with \"jacket\" (a short coat).","priority":"★★★"},"pronunciation":{"ipa":"/ˈʌndərˌdʒækɪt/","syllables":"un-der-jack-et"},"inflection":{"noun_plural":"underjackets"},"usage_notes":{"explanation":"An \"underjacket\" is specifically designed to be worn beneath another jacket. It is often made of materials like fleece or insulated fabrics to provide additional warmth or protection from the elements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore an underjacket as his only jacket.","correct":"✓ He wore an underjacket under his main jacket.","note":"An underjacket is designed to be worn under another jacket, not as a standalone garment."}],"priority":"★★☆"},"related_words":{"derivatives":["underlayer","baselayer","innerwear"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"underjacket\" is relatively straightforward. It refers to a jacket specifically designed to be worn underneath another jacket, usually for warmth or protection. Understanding the function and purpose of layering clothing is helpful in understanding the use of an underjacket."},"example_sentences":[{"sentence":"The climber added a lightweight underjacket to his layers before ascending the mountain.","translation":"登山者は山を登る前に、重ね着の中に軽量のアンダージャケットを追加した。","type":"noun","meaning_category":"clothing"},{"sentence":"She chose a fleece underjacket for its warmth and breathability.","translation":"彼女は暖かさと通気性のために、フリース製のアンダージャケットを選んだ。","type":"noun","meaning_category":"clothing"}]}