{"word":"under-borrowed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"借り入れが不十分な、借り入れが少ない","english_definition":"Not borrowed enough; having borrowed less than is optimal or advisable.","examples":[{"sentence":"The company was under-borrowed, missing opportunities for growth through strategic debt.","translation":"その会社は借り入れが不十分で、戦略的な負債による成長の機会を逃していた。"},{"sentence":"Some economists argued that the country was under-borrowed relative to its potential investment needs.","translation":"一部の経済学者は、その国は潜在的な投資ニーズに比べて借り入れが少なすぎると主張した。"}],"collocations":["under-borrowed country","under-borrowed economy","under-borrowed company","become under-borrowed","remain under-borrowed"],"synonyms":["underleveraged","underindebted"],"antonyms":["over-borrowed","overleveraged","overindebted"]}],"etymology":{"value":"Formed with the prefix 'under-' (meaning 'less than' or 'insufficiently') + 'borrowed' (past participle of 'borrow', meaning 'to take and use something belonging to someone else with the intention of returning it').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈbɒroʊd/","syllables":"un-der-bor-rowed"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., 'more under-borrowed', 'most under-borrowed')."},"usage_notes":{"explanation":"'Under-borrowed' is typically used in economic or financial contexts to describe a situation where an entity (such as a company or a country) has not taken on enough debt, potentially missing out on opportunities for investment and growth. It suggests a suboptimal level of debt relative to the entity's capacity or needs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The under-borrowed situation caused them to lose money.","correct":"✓ The under-borrowed situation caused them to miss opportunities.","note":"'Under-borrowed' itself doesn't directly cause a loss of money, but rather a failure to capitalize on potential gains. So, it's more accurate to say it leads to missed opportunities."},{"incorrect":"✗ He is under-borrowed.","correct":"✓ The company is under-borrowed.","note":"'Under-borrowed' typically describes an entity like a company or a country, not usually an individual."}],"priority":"★★☆"},"related_words":{"derivatives":["under-borrowing (noun)"],"phrasal_verbs":[],"related_terms":["debt","borrowing","leverage","investment","capital","financing","credit"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Under-borrowed' is a term used in finance and economics to describe a situation where a company or country has not borrowed enough money. This might mean they are missing chances to invest and grow their business or economy. It's the opposite of being 'over-borrowed,' where they have borrowed too much. This word is not commonly used in everyday conversation, but you might find it in articles or discussions about finance."},"example_sentences":[{"sentence":"The fund manager argued that the portfolio was significantly under-borrowed, limiting its potential returns.","translation":"そのファンドマネージャーは、ポートフォリオの借り入れが著しく不十分であり、潜在的な収益を制限していると主張した。","type":"adjective","meaning_category":"Finance"},{"sentence":"If a country is persistently under-borrowed, it may struggle to fund necessary infrastructure projects.","translation":"ある国が慢性的に借り入れ不足の場合、必要なインフラプロジェクトへの資金調達に苦労する可能性がある。","type":"adjective","meaning_category":"Economics"}]}