{"word":"pygmyisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"矮小主義、小人根性：取るに足らない些細な事柄にばかりこだわること、またはそのような態度。","english_definition":"The practice of focusing on trivial or insignificant matters; pettiness.","examples":[{"sentence":"His speech was filled with pygmyisms, focusing on minor details instead of the larger issues.","translation":"彼の演説は矮小主義に満ちており、より大きな問題ではなく、些細な詳細に焦点を当てていた。"},{"sentence":"The committee meeting devolved into a series of pygmyisms, with members arguing over punctuation and formatting.","translation":"委員会は矮小主義の連続に陥り、メンバーは句読点や書式設定について議論していた。"}],"collocations":["petty pygmyisms","focus on pygmyisms","avoid pygmyisms"],"synonyms":["pettiness","triviality","insignificance","minutiae","nitpicking"],"antonyms":["broadmindedness","magnanimity","generosity","big picture thinking"]},{"part_of_speech":"noun","definition":"ピグミー族特有の文化や習慣、またはそれらに関する研究。","english_definition":"The cultural traits, customs, or studies relating to pygmy peoples.","examples":[{"sentence":"The anthropologist specialized in pygmyisms, studying the unique traditions of various pygmy tribes.","translation":"その人類学者はピグミー族特有の文化の研究を専門とし、様々なピグミー族の独特な伝統を研究していた。"}],"collocations":["cultural pygmyisms","study of pygmyisms","pygmy tribe pygmyisms"],"synonyms":["pygmy culture","pygmy customs","pygmy traditions"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'pygmy,' referring to a member of any of various ethnic groups whose average height is unusually short, combined with '-ism,' indicating a practice, belief, or ideology. The sense of focusing on trivial matters likely stems from a perceived narrowness or limited scope associated with the term 'pygmy.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪɡmiˌɪzəmz/","syllables":"pig-my-iz-ums"},"inflection":{"noun_plural":"pygmyisms"},"usage_notes":{"explanation":"The word \"pygmyisms\" is relatively rare and can have two distinct meanings. The first, and more common, meaning refers to a focus on trivial or petty matters, often to the detriment of more important concerns. The second meaning, which is less common and potentially sensitive, refers to the cultural traits or customs of pygmy peoples. When using this word, it's important to be aware of the context and potential for misinterpretation or offense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pygmyisms of the project were overwhelming.","correct":"✓ The trivial details of the project were overwhelming.","note":"When referring to trivial details, it's often clearer and less potentially offensive to use terms like \"trivial details\" or \"petty concerns\" instead of \"pygmyisms.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["pygmy (noun)","pygmyish (adjective)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pygmyisms\" is a relatively uncommon and nuanced term. It can refer to either a focus on trivial matters (pettiness) or the cultural traits of pygmy peoples. Due to its rarity and potential for misinterpretation, it should be used with caution and awareness of the context. When referring to trivial matters, more common and less potentially offensive terms like \"pettiness\" or \"trivial details\" are often preferable."},"example_sentences":[{"sentence":"The debate was bogged down in petty pygmyisms, preventing any real progress.","translation":"議論は些細な矮小主義に足止めされ、実際の進展を妨げていた。","type":"noun","meaning_category":"pettiness"},{"sentence":"The museum exhibit explored the rich pygmyisms of several African tribes.","translation":"博物館の展示では、いくつかのアフリカの部族の豊かなピグミー族特有の文化が紹介されていた。","type":"noun","meaning_category":"pygmy culture"}]}