{"word":"irrationalizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(自己または他者を)非合理化する、不合理な理由付けをする、正当化を試みる","english_definition":"Attempting to justify or explain (behavior or attitudes) with logical reasons, even if these are not true or appropriate.","examples":[{"sentence":"He was irrationalizing his decision to quit his job by saying he needed more time for his family.","translation":"彼は家族のためにもっと時間が必要だと言って、仕事を辞めるという自分の決定を非合理的に正当化しようとしていた。"},{"sentence":"She spent hours irrationalizing her purchase of an expensive handbag.","translation":"彼女は高価なハンドバッグを買ったことを何時間もかけて不合理に正当化しようとした。"}],"collocations":["irrationalizing a decision","irrationalizing behavior","irrationalizing a purchase"],"synonyms":["rationalizing","justifying","excusing","defending"],"antonyms":["accepting","acknowledging","admitting"]},{"part_of_speech":"verb","transitivity":"vi","definition":"非合理化するプロセスを経る、不合理な正当化を行う","english_definition":"To undergo the process of making something irrational or attempting to justify something irrationally.","examples":[{"sentence":"He was irrationalizing, trying to convince himself that he didn't really want the promotion.","translation":"彼は非合理的な正当化を行っており、昇進を本当に望んでいなかったと自分自身に言い聞かせようとしていた。"}],"collocations":["start irrationalizing","begin irrationalizing"],"synonyms":["rationalizing","justifying","excusing","defending"],"antonyms":["accepting","acknowledging","admitting"]}],"etymology":{"value":"The word is derived from 'irrational' (not based on reason or logic) and the suffix '-ize' (to make or become). It implies the action of making something irrational or providing irrational reasons for something.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ɪˈræʃənəˌlaɪzɪŋ/","syllables":"ir-ra-tion-a-liz-ing"},"inflection":{"verb_forms":{"present_simple":["irrationalize","irrationalizes"],"past_simple":"irrationalized","past_participle":"irrationalized","present_participle":"irrationalizing"}},"usage_notes":{"explanation":"'Irrationalizing' is often used to describe the act of creating excuses or justifications that are not based on sound reasoning. It is similar to 'rationalizing,' but it emphasizes the lack of logic or reason in the justification. It is frequently used in psychology and self-help contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was irrationalizing the problem.","correct":"✓ He was irrationalizing his decision about the problem.","note":"'Irrationalizing' typically applies to decisions, behaviors, or attitudes, not the problem itself. You irrationalize *something*."},{"incorrect":"✗ She is irrationalizing because she is happy.","correct":"✓ She is irrationalizing because she feels guilty.","note":"Irrationalizing is often a response to negative feelings like guilt, anxiety, or cognitive dissonance, not happiness."}],"priority":"☆☆☆"},"related_words":{"derivatives":["irrationalize (verb)","irrationalization (noun)","irrational (adjective)","rationalizing (verb)","rationalization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Irrationalizing' is a complex term used to describe the process of creating illogical or unreasonable justifications for one's actions or beliefs. It is often used in psychological contexts to explain behavior that seems contradictory or self-defeating. The term implies a deeper level of cognitive distortion than simply making a mistake or having a different opinion."},"example_sentences":[{"sentence":"The politician was accused of irrationalizing his controversial policies.","translation":"その政治家は、物議を醸す政策を非合理的に正当化していると非難された。","type":"verb","meaning_category":"justifying"},{"sentence":"She realized she was irrationalizing her fear of flying.","translation":"彼女は自分が飛行機恐怖症を非合理的に正当化していることに気づいた。","type":"verb","meaning_category":"excusing"},{"sentence":"Stop irrationalizing and admit you made a mistake.","translation":"非合理的な正当化はやめて、間違いを認めなさい。","type":"verb","meaning_category":"defending"}]}