{"word":"xenolite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異質岩片、捕獲岩","english_definition":"A foreign rock fragment included in an igneous rock.","examples":[{"sentence":"The kimberlite pipe contained numerous xenolites from the Earth's mantle.","translation":"そのキンバーライトパイプには、地球のマントルからの多数の異質岩片が含まれていた。"},{"sentence":"Analysis of the xenolites provided insights into the composition of the lower crust.","translation":"異質岩片の分析は、下部地殻の組成に関する洞察を提供した。"}],"collocations":["mantle xenolite","crustal xenolite","xenolite inclusion"],"synonyms":["inclusion","foreign fragment","lithic clast"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'xenos' (ξένος) meaning 'foreign' and 'lithos' (λίθος) meaning 'stone'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈzɛnəˌlaɪt","syllables":"ze-no-lite"},"inflection":{"noun_plural":"xenolites"},"usage_notes":{"explanation":"Xenolite is a geological term referring to a rock fragment that is foreign to the igneous rock in which it is found. These fragments are often derived from the mantle or lower crust and can provide valuable information about the Earth's interior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was a xenolith.","correct":"✓ The rock contained xenolites.","note":"'Xenolith' refers to a single foreign rock fragment, while 'xenolites' refers to multiple fragments. The first sentence implies the entire rock is a foreign fragment, which is not the intended meaning."}],"priority":"☆☆☆"},"related_words":{"derivatives":["xenolithic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Xenolite' is a specialized geological term used to describe a fragment of rock that is foreign to the igneous rock in which it is found. Understanding this term requires a background in geology or earth science. The word is derived from Greek roots, 'xenos' meaning 'foreign' and 'lithos' meaning 'stone'. These fragments can provide valuable insights into the composition and processes of the Earth's interior.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The basalt sample contained several dark-colored xenolites.","translation":"その玄武岩のサンプルには、いくつかの暗色の異質岩片が含まれていた。","type":"noun","meaning_category":"geology"},{"sentence":"Researchers studied the xenolites to determine the age of the mantle rocks.","translation":"研究者たちは、マントルの岩石の年代を特定するために異質岩片を研究した。","type":"noun","meaning_category":"geology"}]}