{"word":"gastrocolostomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"胃結腸吻合術：胃と結腸を外科的に接続すること。","english_definition":"A surgical procedure that creates an anastomosis (connection) between the stomach and the colon.","examples":[{"sentence":"Gastrocolostomy is rarely performed today due to the availability of other surgical options.","translation":"他の外科的選択肢が利用できるようになったため、今日では胃結腸吻合術はめったに行われません。"},{"sentence":"The patient underwent gastrocolostomy to bypass a blockage in the small intestine.","translation":"患者は小腸の閉塞をバイパスするために胃結腸吻合術を受けました。"}],"collocations":["perform a gastrocolostomy","undergo gastrocolostomy","complications of gastrocolostomy"],"synonyms":["stomach-colon anastomosis"],"antonyms":[]}],"etymology":{"value":"「gastro-」（胃）+「colo-」（結腸）+「-stomy」（外科的な開口部を作る手術）に由来します。","priority":"★★☆"},"pronunciation":{"ipa":"ˌɡæstroʊkəˈlɒstəmi","syllables":"gas-tro-co-los-to-my"},"inflection":{"noun_plural":"gastrocolostomies"},"usage_notes":{"explanation":"Gastrocolostomy is a surgical procedure that is rarely performed in modern medicine due to the high risk of complications and the availability of more effective treatments for the conditions it was once used to treat. It was historically used to bypass obstructions in the small intestine or to treat certain types of gastric ulcers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a gastrostomy instead of gastrocolostomy.","correct":"✓ The doctor performed a gastrocolostomy.","note":"Gastrostomy involves creating an opening into the stomach, while gastrocolostomy creates a connection between the stomach and the colon. These are different procedures."}],"priority":"★★☆"},"related_words":{"derivatives":["gastrectomy","colectomy","anastomosis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'gastrocolostomy' is a highly specialized medical term. It is unlikely to be encountered outside of a medical context. Understanding requires knowledge of medical terminology related to the digestive system and surgical procedures."},"example_sentences":[{"sentence":"Due to severe complications, a gastrocolostomy was converted to a different type of bypass.","translation":"重度の合併症のため、胃結腸吻合術は別の種類のバイパスに変更されました。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"The textbook described the historical use of gastrocolostomy in treating peptic ulcer disease.","translation":"その教科書には、消化性潰瘍の治療における胃結腸吻合術の歴史的な使用法が記載されていました。","type":"medical","meaning_category":"historical use"}]}