{"word":"Guittonian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(文学、特に詩について)技巧を凝らした、衒学的な、気取った。","english_definition":"(of literature, especially poetry) elaborately ornate; affectedly learned; pretentious.","examples":[{"sentence":"The poem was written in a highly Guittonian style, full of obscure allusions and convoluted syntax.","translation":"その詩は非常にギットニアンスタイルで書かれており、難解な暗示と複雑な構文で満ちていた。"}],"collocations":["Guittonian style","Guittonian verse","Guittonian language"],"synonyms":["ornate","florid","bombastic","pedantic","affected","pretentious"],"antonyms":["plain","simple","unadorned","natural"]}],"etymology":{"value":"17世紀のイギリスの詩人、ジョージ・ギッティング（George Gittins）に由来すると考えられているが、正確な起源は不明。ギッティングの作品が技巧的で衒学的であったことから、彼の名がそのような文体を指す言葉として使われるようになったとされる。","priority":"★☆☆"},"pronunciation":{"ipa":"/ɡɪˈtoʊniən/","syllables":"Git-to-ni-an"},"inflection":{"notes":"形容詞なので、比較級・最上級があります。"},"usage_notes":{"explanation":"「**Guittonian**」は、文学、特に詩のスタイルを指す言葉で、技巧を凝らし、衒学的で、気取った表現を特徴とします。難解な言葉遣いや複雑な構文、古典的な引用や暗示を多用し、読者に知識をひけらかすような印象を与えることがあります。この言葉は、しばしば批判的な意味合いで使用され、自然で率直な表現とは対照的な、不自然で人工的な文体を指します。現代ではあまり一般的ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Guittonian architecture of the building was impressive.","correct":"✓ The ornate architecture of the building was impressive.","note":"「Guittonian」は主に文学スタイルを指す言葉であり、建築スタイルには通常使用しません。建築の装飾的なスタイルを指す場合は、「ornate」などの言葉を使用します。"},{"incorrect":"✗ He spoke in a Guittonian manner, making it difficult to understand him.","correct":"✓ He spoke in a pedantic manner, making it difficult to understand him.","note":"「Guittonian」は文体に対して使われる言葉であり、話し方そのものに対しては、「pedantic」（衒学的な）などの言葉がより適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_concepts":["Euphuism (婉曲的で技巧的な文体)","Baroque (バロック様式 - 過剰な装飾を特徴とする美術様式)","Rhetoric (修辞学 - 効果的な文章やスピーチの技術)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 文学研究や批評において稀に使用される程度。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Guittonian**」は、文学作品のスタイルを説明するために使用される専門用語です。これは、文章が非常に装飾的で、難解な言葉や複雑な文法構造を多用し、読者に知識を誇示するような印象を与えることを意味します。この言葉は、17世紀の詩人ジョージ・ギッティングに由来すると考えられていますが、正確な起源は不明です。現代の英語では一般的ではなく、主に文学研究や批評の分野で使用されます。"},"example_sentences":[{"sentence":"The critic dismissed the novel as overly Guittonian, criticizing its convoluted prose and obscure references.","translation":"批評家はその小説を過度にギットニアンであるとして退け、その複雑な散文と曖昧な参照を批判した。","type":"adjective","meaning_category":"技巧を凝らした、衒学的な"},{"sentence":"While the author's ambition was admirable, the Guittonian style of his writing made it inaccessible to most readers.","translation":"著者の野心は称賛に値するものの、彼の文章のギットニアンスタイルは、ほとんどの読者にとってアクセス不能にした。","type":"adjective","meaning_category":"気取った"}]}