{"word":"agnathic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"無顎類の、無顎類の特性を持つ","english_definition":"Relating to or having the characteristics of the Agnatha; jawless.","examples":[{"sentence":"Agnathic fish are among the earliest vertebrates.","translation":"無顎類の魚は、最も初期の脊椎動物の一つです。"},{"sentence":"The agnathic condition is characterized by the absence of jaws.","translation":"無顎の状態は、顎がないことによって特徴づけられます。"}],"collocations":["agnathic fish (無顎魚類)","agnathic vertebrates (無顎脊椎動物)","agnathic condition (無顎の状態)"],"synonyms":["jawless","cyclostomatous"],"antonyms":["gnathostomatous (顎口類の)"]}],"etymology":{"value":"Derived from the class name Agnatha, from Greek ἀ- (a-, \"without\") + γνάθος (gnáthos, \"jaw\").","priority":"★★★"},"pronunciation":{"ipa":"/æɡˈnæθɪk/","syllables":"ag-nath-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Agnathic' is a term used in zoology to describe animals, particularly fish, that lack jaws. It's a relatively specialized term, primarily used in scientific or educational contexts related to vertebrate biology and evolution. The term directly relates to the class Agnatha, which includes extant species like lampreys and hagfish, as well as numerous extinct forms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The agnathic animal used its teeth to eat.","correct":"✓ The agnathic animal used its tongue to eat.","note":"Agnathic animals lack jaws and therefore do not have teeth in the conventional sense. They may have oral structures for rasping or suction, but not true teeth."}],"priority":"★★☆"},"related_words":{"derivatives":["Agnatha (無顎類)","gnathostome (顎口動物)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agnathic' is a technical term used in biology, specifically in zoology and vertebrate paleontology. It refers to organisms that lack jaws. Understanding this term requires some background knowledge of biological classification and evolutionary biology. It's not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"Lampreys are an example of an extant agnathic vertebrate.","translation":"ヤツメウナギは現存する無顎類の脊椎動物の例です。","type":"scientific","meaning_category":"無顎類の"},{"sentence":"The study focused on the evolutionary transition from agnathic to gnathostome vertebrates.","translation":"その研究は、無顎類から顎口類への脊椎動物の進化の移行に焦点を当てました。","type":"scientific","meaning_category":"無顎類の"}]}