{"word":"inconsultable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"相談できない、助言を求められない、意見を聞けない","english_definition":"Not able to be consulted; not open to advice or counsel.","examples":[{"sentence":"The dictator was an inconsultable leader, making decisions without any input from his advisors.","translation":"その独裁者は相談に応じない指導者であり、顧問からの意見を一切聞かずに意思決定を行った。"},{"sentence":"His inconsultable nature made it difficult to work with him on collaborative projects.","translation":"彼の相談に応じない性質のため、共同プロジェクトで彼と協力するのは困難だった。"}],"collocations":["inconsultable leader","inconsultable nature","inconsultable ego"],"synonyms":["unapproachable","unresponsive","intransigent","obdurate","impervious","unyielding"],"antonyms":["approachable","consultable","responsive","amenable","open-minded"]}],"etymology":{"value":"Formed from the prefix 'in-' (not) and the word 'consultable' (able to be consulted).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnkənˈsʌltəbəl/","syllables":"in-con-sul-ta-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparatives and superlatives."},"usage_notes":{"explanation":"'Inconsultable' describes someone or something that is not open to consultation or advice. It often implies a closed-minded or authoritarian attitude. The word is relatively rare and somewhat formal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was inconsolable after the loss, making him inconconsultable.","correct":"✓ He was inconsolable after the loss, making him unwilling to listen to advice.","note":"'Inconsolable' (unable to be comforted) is often confused with 'inconsultable' (unwilling to be consulted)."},{"incorrect":"✗ The document was inconconsultable due to its complexity.","correct":"✓ The document was too complex to easily understand and use for consultation.","note":"'Inconsultable' refers to a person's willingness to be consulted, not the accessibility or comprehensibility of a document."}],"priority":"★☆☆"},"related_words":{"derivatives":["inconsultability (noun)"],"related_terms":["consult (verb)","consultation (noun)","consultant (noun)","consultative (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inconsultable' is a relatively rare and formal word that describes someone who is unwilling to take advice or be consulted. It suggests a closed-minded or authoritarian attitude. Because it's not a common word, it's more likely to be encountered in formal writing or speech. It is formed by adding the prefix 'in-' (meaning 'not') to 'consultable' (able to be consulted)."},"example_sentences":[{"sentence":"The CEO's inconsultable approach to management led to widespread dissatisfaction among employees.","translation":"CEOの相談を受け付けない経営手法は、従業員の間で広範な不満を引き起こした。","type":"general","meaning_category":"general"},{"sentence":"His inconsultable pride prevented him from seeking help when he needed it most.","translation":"彼の相談を受け付けないプライドは、最も助けが必要なときに助けを求めることを妨げた。","type":"general","meaning_category":"general"}]}