{"word":"charette","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築・デザインなどの)集中的な共同作業、設計競技の最終段階","english_definition":"an intensive multi-day design exercise, often used in architecture and design schools, in which students or professionals collaborate to solve a design problem under strict time constraints.","examples":[{"sentence":"The architecture students participated in a 24-hour charette to design a community center.","translation":"建築学科の学生たちは、コミュニティセンターを設計するために24時間のシャレットに参加した。"},{"sentence":"The design firm held a charette to generate innovative ideas for the new project.","translation":"そのデザイン会社は、新しいプロジェクトのための革新的なアイデアを生み出すためにシャレットを開催した。"}],"collocations":["participate in a charette","hold a charette","design charette","urban design charette"],"synonyms":["design sprint","design workshop","intensive design session"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的)フランスの建築学生が設計競技に提出する図面を運ぶための手押し車","english_definition":"(historical) a cart used to collect architectural students' drawings for submission to a competition in France.","examples":[{"sentence":"Historically, students would rush to complete their drawings and have them collected by the charette.","translation":"歴史的には、学生たちは急いで図面を完成させ、シャレットによって回収してもらった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"フランス語で「手押し車」を意味する「charette」に由来する。19世紀のパリのエコール・デ・ボザール（官立美術学校）で、学生たちが設計競技の提出期限に間に合わせるため、手押し車（charette）に図面を積み込んで提出したことに由来する。学生たちは手押し車が到着するまで図面を修正し続け、その様子から集中的な共同作業を意味するようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ʃəˈrɛt/","syllables":"sha-rette"},"inflection":{"notes":"複数形は charettes"},"usage_notes":{"explanation":"「**charette**」は、建築、都市計画、デザイン分野で使われる専門用語です。本来はフランス語で「手押し車」を意味しますが、現在では、短期間で集中的に共同作業を行う設計競技やワークショップを指します。参加者は限られた時間の中で、アイデアを出し合い、設計案をまとめ上げます。非常に集中力とチームワークが求められる作業形態です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We had a charette to relax and brainstorm ideas.","correct":"✓ We had a charette to intensively brainstorm ideas under a tight deadline.","note":"シャレットはリラックスしたブレインストーミングセッションではなく、時間的制約のある集中的な共同作業です。"},{"incorrect":"✗ The charette was a solo project.","correct":"✓ The charette was a collaborative project.","note":"シャレットは通常、チームで行う共同作業です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["design sprint","hackathon","workshop","brainstorming session"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**charette**」は、建築やデザインの分野で使われる専門的な言葉で、一般的にはあまり知られていません。これは、限られた時間の中で、集中的に共同で設計作業を行うことを指します。学生や専門家がチームを組み、短期間でアイデアを出し合い、設計案を完成させるために行われます。建築やデザイン関係のニュースや記事を読む際に目にする可能性があります。"},"example_sentences":[{"sentence":"The urban planning department organized a week-long charette to address the city's transportation issues.","translation":"都市計画部門は、市の交通問題を解決するために1週間のシャレットを企画した。","type":"noun","meaning_category":"集中的な共同作業"},{"sentence":"The students worked tirelessly through the night during the charette.","translation":"学生たちはシャレットの間、徹夜で休むことなく作業した。","type":"noun","meaning_category":"集中的な共同作業"}]}