{"word":"Franklinization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に政治において)政策や立場を、より大衆受けするように、またはより穏健に見えるように修正すること。","english_definition":"The act or process of modifying a policy or position, especially in politics, to make it more palatable to the general public or appear more moderate.","examples":[{"sentence":"The candidate's Franklinization of his economic plan involved softening some of the more radical proposals.","translation":"候補者の経済計画のフランクリン化には、より過激な提案のいくつかを和らげることが含まれていた。"},{"sentence":"Critics accused the party of Franklinization, arguing that they were abandoning their core principles for electoral gain.","translation":"批評家たちは、党が選挙での利益のために中核となる原則を放棄していると主張し、党のフランクリン化を非難した。"}],"collocations":["policy Franklinization","political Franklinization","Franklinization strategy"],"synonyms":["moderation","dilution","compromise","softening","watering down"],"antonyms":["radicalization","extremism","polarization"]}],"etymology":{"value":"この言葉は、アメリカの政治コンサルタントであるフランクリン・ルンドクィストに由来する。彼は、政治家がより幅広い有権者にアピールするために、自身のメッセージや政策をどのように調整すべきかについてアドバイスすることで知られていた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfræŋklɪnaɪˈzeɪʃən/","syllables":"Fran-klin-i-za-tion"},"inflection":{"noun_plural":"Franklinizations"},"usage_notes":{"explanation":"「Franklinization」は、主に政治的な文脈で使用され、政策や立場をより穏健で受け入れやすいものにするプロセスを指します。これは、政治家や政党がより多くの支持を得るために、自身のメッセージを調整する戦略の一部です。この用語は、フランクリン・ルンドクィストの政治コンサルタントとしての活動に由来し、彼の名前がこのプロセスを指すようになりました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Franklinization of the company's marketing strategy led to a decrease in sales.","correct":"✓ The moderation of the company's marketing strategy led to a decrease in sales.","note":"「Franklinization」は主に政治的な文脈で使用されるため、企業戦略などの文脈では「moderation（穏健化）」などのより一般的な用語が適切です。"},{"incorrect":"✗ The Franklinization was a success, and the candidate won the election.","correct":"✓ The Franklinization strategy was a success, and the candidate won the election.","note":"「Franklinization」はプロセスまたは行為を指すため、「Franklinization strategy（フランクリン化戦略）」のように、より具体的な名詞と組み合わせて使用​​すると、文がより明確になります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Franklinize (動詞: フランクリン化する)"],"related_concepts":["political consulting","spin","public relations","policy modification","political strategy","electoral strategy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な政治用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Franklinization」は、政治的な文脈で使われる専門用語であり、政策や立場をより大衆受けするように修正するプロセスを指します。この言葉は、政治コンサルタントのフランクリン・ルンドクィストに由来し、彼の名前がこの戦略を指すようになりました。この用語は、政治学やメディア研究などの分野で使われることがありますが、一般的な日常会話ではほとんど使用されません。この単語を理解するには、政治戦略や広報に関する知識が必要です。"},"example_sentences":[{"sentence":"The politician's **Franklinization** of his stance on immigration was seen as a betrayal by some of his supporters.","translation":"その政治家の移民問題に対する立場のフランクリン化は、支持者の一部から裏切りと見なされた。","type":"noun","meaning_category":"政策修正"},{"sentence":"The party's **Franklinization** strategy aimed to appeal to undecided voters in the upcoming election.","translation":"その党のフランクリン化戦略は、次の選挙で未決定の有権者にアピールすることを目的としていた。","type":"noun","meaning_category":"政治戦略"},{"sentence":"Critics argued that the **Franklinization** of the bill weakened its original intent.","translation":"批評家たちは、その法案のフランクリン化が当初の意図を弱めたと主張した。","type":"noun","meaning_category":"法案修正"}]}