{"word":"irritament","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) An irritating thing; something that causes annoyance or irritation.","english_definition":"(rare) Something that irritates; a source of annoyance or vexation.","examples":[{"sentence":"The constant noise was a real irritament.","translation":"絶え間ない騒音は本当にイライラの種だった。"},{"sentence":"That fly buzzing around is such an irritament.","translation":"周りを飛び回るあのハエは本当にイライラする。"}],"collocations":["major irritament","minor irritament"],"synonyms":["annoyance","irritation","nuisance","vexation","bother"],"antonyms":["comfort","pleasure","delight"]}],"etymology":{"value":"Derived from the Latin word \"irritamentum,\" meaning \"that which excites or provokes.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈrɪtəmənt/","syllables":"ir-ri-ta-ment"},"inflection":{"noun_plural":"irritaments"},"usage_notes":{"explanation":"The word \"irritament\" is relatively rare in modern English. More common synonyms like \"annoyance,\" \"irritation,\" or \"nuisance\" are generally preferred. However, it can be used to add a slightly more formal or archaic tone to writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The irritament made me irritate.","correct":"✓ The irritament irritated me.","note":"\"Irritament\" is a noun, while \"irritate\" is a verb. Use the correct form for the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["irritate (verb)","irritation (noun)","irritable (adjective)","irritating (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"irritament\" is a rare and somewhat formal term for something that causes annoyance or irritation. It is not commonly used in everyday conversation or writing. Readers are more likely to encounter more common synonyms such as \"annoyance,\" \"irritation,\" or \"nuisance.\" This word is suitable for advanced learners who wish to expand their vocabulary and understand less common words. "},"example_sentences":[{"sentence":"The bureaucratic red tape was a constant irritament to the project's progress.","translation":"官僚的なお役所仕事は、プロジェクトの進捗にとって常にイライラの種だった。","type":"noun","meaning_category":"annoyance"},{"sentence":"For him, the sound of chewing gum was a major irritament.","translation":"彼にとって、チューインガムを噛む音は大きなイライラの種だった。","type":"noun","meaning_category":"annoyance"},{"sentence":"The small typo in the document proved to be a minor irritament for the editor.","translation":"文書内の小さなタイプミスは、編集者にとって小さなイライラの種であることが判明した。","type":"noun","meaning_category":"annoyance"}]}