{"word":"workbaskets","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"裁縫箱、手芸箱","english_definition":"A basket or container used to hold sewing supplies, knitting needles, or other craft materials.","examples":[{"sentence":"She kept her yarn and knitting needles in a workbasket.","translation":"彼女は毛糸と編み針を裁縫箱に入れていました。"},{"sentence":"The workbasket was overflowing with fabric scraps.","translation":"裁縫箱は生地の切れ端でいっぱいでした。"}],"collocations":["sewing workbasket","knitting workbasket","craft workbasket"],"synonyms":["sewing basket","craft basket","needlework basket"],"antonyms":[]}],"etymology":{"value":"The word 'workbasket' is a compound noun formed by combining 'work' and 'basket'. 'Work' refers to the activity or craft being done, such as sewing or knitting, and 'basket' refers to the container used to hold the materials.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɜːrkˌbæs.kɪts","syllables":"work-bas-kets"},"inflection":{"noun_plural":"workbaskets"},"usage_notes":{"explanation":"A 'workbasket' is typically a small to medium-sized container, often made of wicker, fabric, or plastic, designed to organize and store craft supplies. It is commonly associated with activities like sewing, knitting, crochet, and other needlework.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I put my worksbasket on the table.","correct":"✓ I put my workbasket on the table.","note":"'Workbasket' is one word, not two. Avoid separating 'work' and 'basket' into two separate words in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["work","basket"],"related_terms":["sewing kit","knitting bag","craft organizer"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The word 'workbaskets' refers to containers used to store crafting supplies. It is a compound noun that is relatively straightforward in meaning but may not be commonly encountered outside of contexts related to sewing, knitting, or other crafts. Understanding the individual components ('work' and 'basket') can help in grasping the meaning. The plural form, 'workbaskets,' simply indicates multiple such containers."},"example_sentences":[{"sentence":"The antique shop had several vintage workbaskets on display.","translation":"そのアンティークショップには、いくつかのヴィンテージの裁縫箱が展示されていました。","type":"noun","meaning_category":"container"},{"sentence":"She received a beautiful new workbasket as a birthday gift.","translation":"彼女は誕生日プレゼントとして美しい新しい裁縫箱をもらいました。","type":"noun","meaning_category":"container"}]}