{"word":"UV-tolerance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"紫外線耐性","english_definition":"The ability to withstand exposure to ultraviolet (UV) radiation without suffering damage.","examples":[{"sentence":"This plant exhibits high UV-tolerance, allowing it to thrive in sunny environments.","translation":"この植物は高い紫外線耐性を示し、日当たりの良い環境で生育することができます。"},{"sentence":"Scientists are studying the mechanisms behind UV-tolerance in certain organisms.","translation":"科学者たちは、特定の生物における紫外線耐性のメカニズムを研究しています。"}],"collocations":["high UV-tolerance","enhanced UV-tolerance","UV-tolerance mechanism","UV-tolerance gene"],"synonyms":["UV resistance","photoprotection"],"antonyms":["UV sensitivity","susceptibility to UV radiation"]}],"etymology":{"value":"Combination of 'UV' (ultraviolet) and 'tolerance' (the ability to endure or withstand).","priority":"★★★"},"pronunciation":{"ipa":"ˌjuːˈviː ˈtɒlərəns","syllables":"U-V tol-er-ance"},"inflection":{"noun_plural":"UV-tolerances"},"usage_notes":{"explanation":"UV-tolerance refers to the capacity of an organism or material to endure ultraviolet radiation without significant harm. It is often used in the context of plants, microorganisms, and materials science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The UV-tolerance is very high of this material.","correct":"✓ The UV-tolerance of this material is very high.","note":"Correct word order for clarity."},{"incorrect":"✗ UV tolerance are important for plants in deserts.","correct":"✓ UV tolerance is important for plants in deserts.","note":"UV tolerance is a singular noun."}],"priority":"★★☆"},"related_words":{"derivatives":["UV-tolerant (adjective)"],"phrasal_verbs":[],"related_terms":["UV radiation","photodamage","DNA repair","sunscreen","photostability"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'UV-tolerance' is a specialized term related to the ability to withstand ultraviolet radiation. It is commonly used in scientific and technical contexts, particularly in fields like biology, materials science, and environmental science. Understanding this term requires familiarity with scientific vocabulary and concepts related to radiation and its effects on living organisms and materials."},"example_sentences":[{"sentence":"The high UV-tolerance of this sunscreen protects the skin from sunburn.","translation":"この日焼け止めの高い紫外線耐性は、皮膚を日焼けから守ります。","type":"noun","meaning_category":"紫外線耐性"},{"sentence":"Researchers are trying to develop crops with increased UV-tolerance to cope with climate change.","translation":"研究者たちは、気候変動に対処するために、紫外線耐性を高めた作物を開発しようとしています。","type":"noun","meaning_category":"紫外線耐性"}]}