{"word":"employee-supported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"従業員によって支援されている、従業員が支援する","english_definition":"Supported or endorsed by employees; relating to activities or initiatives that receive backing or participation from employees.","examples":[{"sentence":"The company has an employee-supported volunteer program that allows staff to dedicate work hours to local charities.","translation":"その会社には、従業員が支援するボランティアプログラムがあり、従業員は勤務時間中に地元の慈善団体に貢献することができます。"},{"sentence":"This is an employee-supported initiative to reduce the company's carbon footprint.","translation":"これは、会社の二酸化炭素排出量を削減するための、従業員が支援するイニシアチブです。"},{"sentence":"The employee-supported fund provides financial assistance to colleagues facing unexpected hardships.","translation":"従業員が支援する基金は、予期せぬ困難に直面している同僚に経済的支援を提供します。"}],"collocations":["employee-supported volunteer program","employee-supported initiative","employee-supported fund","employee-supported campaign","employee-supported project"],"synonyms":["staff-backed","worker-endorsed","personnel-supported","employee-driven","employee-sponsored"],"antonyms":["employer-supported","management-driven","company-sponsored"]}],"etymology":{"value":"A compound adjective formed by combining 'employee' (a person employed for wages or salary) and 'supported' (past participle of 'support', meaning to give assistance, approval, or encouragement to). The term describes something that receives backing or assistance from employees.","priority":"N/A"},"pronunciation":{"ipa":"/ɪmˌplɔɪˈiː səˈpɔːrtɪd/","syllables":"em-ploy-ee-sup-port-ed"},"inflection":{"notes":"This is an adjective and does not have inflections like verbs or nouns."},"usage_notes":{"explanation":"The term 'employee-supported' is used to describe programs, initiatives, or organizations that receive active support, participation, or funding from employees. This support can take various forms, such as volunteering time, donating money, or actively promoting the cause within the company and the wider community. It often implies a grassroots effort where employees are the primary drivers or contributors.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The supported-employee program...","correct":"✓ The employee-supported program...","note":"The correct order is 'employee-supported' because it describes a program supported *by* employees, not a program for supported employees (which would have a different meaning)."},{"incorrect":"✗ This initiative is supported by the employer, so it's employee-supported.","correct":"✓ This initiative is supported by the employees.","note":"'Employee-supported' specifically means supported by the employees themselves, not the employer."}],"priority":"N/A"},"related_words":{"derivatives":["employee (noun)","support (verb, noun)","supported (adjective)"],"phrasal_verbs":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, used mainly in business and organizational contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'employee-supported' describes something that is backed or helped by the workers of a company. It means the employees themselves are actively involved in providing support, whether through volunteering, donating, or promoting an initiative. It's often used to highlight that the effort comes from the employees, not just the management or the company itself. This term is more common in business and organizational settings."},"example_sentences":[{"sentence":"The employee-supported charity drive raised over $10,000 for the local food bank.","translation":"従業員が支援する慈善活動は、地元のフードバンクに1万ドル以上を集めました。","type":"adjective","meaning_category":"支援されている"},{"sentence":"Our company encourages employee-supported community projects.","translation":"当社は、従業員が支援する地域社会プロジェクトを奨励しています。","type":"adjective","meaning_category":"支援する"},{"sentence":"The success of the program is largely due to the employee-supported efforts.","translation":"このプログラムの成功は、主に従業員が支援する取り組みによるものです。","type":"adjective","meaning_category":"支援する"}]}