{"word":"Ciguatera","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シガテラ (熱帯・亜熱帯の魚介類に蓄積された毒素による食中毒)","english_definition":"A type of food poisoning caused by eating reef fish whose flesh is contaminated with toxins produced by dinoflagellates.","examples":[{"sentence":"Ciguatera is a common illness in tropical regions.","translation":"シガテラは熱帯地域でよく見られる病気です。"},{"sentence":"Cooking the fish does not destroy the ciguatera toxins.","translation":"魚を調理してもシガテラの毒素は破壊されません。"},{"sentence":"Symptoms of ciguatera can include nausea, vomiting, and neurological problems.","translation":"シガテラの症状には、吐き気、嘔吐、神経系の問題などがあります。"}],"collocations":["ciguatera poisoning","ciguatera toxin","contract ciguatera","ciguatera fish poisoning"],"synonyms":["fish poisoning"],"antonyms":[]},{"part_of_speech":"noun","definition":"シガテラ毒を持つ魚","english_definition":"Fish that contain ciguatoxins.","examples":[{"sentence":"Barracuda is a fish that is known to cause ciguatera.","translation":"オニカマスはシガテラを引き起こすことで知られている魚です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Spanish word 'cigua', referring to a type of sea snail (Livona pica) thought to be poisonous, and '-tera', indicating a condition or disease.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsiːɡwəˈtɛərə/","syllables":"ci-gua-te-ra"},"inflection":{"noun_plural":"ciguateras"},"usage_notes":{"explanation":"Ciguatera is a type of food poisoning caused by eating fish that have accumulated toxins produced by dinoflagellates, microscopic marine algae. These toxins are concentrated in the flesh of larger predatory reef fish such as barracuda, grouper, and snapper. The toxins are heat-stable, so cooking the fish does not eliminate the risk. Symptoms can include gastrointestinal, neurological, and cardiovascular problems, and may persist for weeks or months. Ciguatera is most common in tropical and subtropical regions, particularly in the Caribbean, Pacific, and Indian Oceans.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I got ciguatera from sushi.","correct":"✓ I got ciguatera from eating reef fish.","note":"Ciguatera is typically associated with reef fish, not raw fish in general. Sushi can cause other types of food poisoning, but not usually ciguatera."},{"incorrect":"✗ Ciguatera is caused by bacteria.","correct":"✓ Ciguatera is caused by toxins produced by dinoflagellates.","note":"Ciguatera is caused by toxins, not by bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["ciguatoxin"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ciguatera' is a specialized term referring to a specific type of food poisoning linked to consuming contaminated reef fish in tropical and subtropical regions. Understanding this term requires knowledge of marine ecosystems, food safety, and medical terminology. The word itself is not commonly used in everyday conversation but is relevant in contexts related to travel health, seafood consumption, and environmental health in affected areas."},"example_sentences":[{"sentence":"The health department issued a warning about ciguatera in locally caught fish.","translation":"保健所は地元で獲れた魚のシガテラに関する警告を発令した。","type":"noun","meaning_category":"シガテラ"},{"sentence":"Proper testing can help prevent ciguatera poisoning.","translation":"適切な検査はシガテラ中毒の予防に役立ちます。","type":"noun","meaning_category":"シガテラ"}]}