{"word":"unluckiness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不運、不幸せ、運の悪さ","english_definition":"The state or quality of being unlucky; ill fortune; bad luck.","examples":[{"sentence":"His unluckiness seemed to follow him everywhere.","translation":"彼の不運はどこまでも彼につきまとうようだった。"},{"sentence":"The team's unluckiness in the final match cost them the championship.","translation":"決勝戦でのチームの不運が、彼らから優勝を奪った。"},{"sentence":"She attributed her failure to sheer unluckiness.","translation":"彼女は自分の失敗を単なる不運のせいだと考えた。"}],"collocations":["sheer unluckiness (全くの不運)","a streak of unluckiness (不運続き)","attribute to unluckiness (不運のせいにする)"],"synonyms":["misfortune","adversity","bad luck","ill fortune","calamity","hardship"],"antonyms":["luckiness","fortune","good luck","success"]}],"etymology":{"value":"The word \"unluckiness\" is formed by adding the suffix \"-ness\" (denoting a state or quality) to the adjective \"unlucky.\" \"Unlucky\" itself is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"lucky.\" Thus, \"unluckiness\" literally means \"the state of not being lucky.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlʌkinəs/","syllables":"un-luck-i-ness"},"inflection":{"noun_plural":"unluckinesses (rarely used, usually uncountable)"},"usage_notes":{"explanation":"\"Unluckiness\" is a noun that describes the general condition or state of experiencing bad luck or misfortune. It refers to a tendency or pattern of negative events occurring in someone's life or in a particular situation. It is often used to explain failures, setbacks, or negative outcomes when other factors are not readily apparent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a unluckiness day.","correct":"✓ He had an unlucky day.","note":"\"Unluckiness\" is a noun, so it describes a state or quality. To describe a day, use the adjective \"unlucky.\""},{"incorrect":"✗ The unluckiness of the situation was obvious.","correct":"✓ The unfortunate nature of the situation was obvious. / ✓ The unluckiness of the situation contributed to the failure.","note":"While \"unluckiness\" is correct, using \"unfortunate nature\" or rephrasing to show how the unluckiness affected the outcome can improve clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["unlucky (adjective: having bad luck)","luckiness (noun: the state of having good luck)","lucky (adjective: having good luck)"],"phrases":["a run of bad luck","down on one's luck"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unluckiness\" is a noun that describes the general state of having bad luck or experiencing misfortune. It is used to explain situations or events where things go wrong, often without a clear or specific reason. It's a more abstract term than simply saying someone is \"unlucky,\" as it refers to the overall condition or pattern of bad luck. The word is not as commonly used as \"bad luck\" or \"misfortune,\" but it provides a specific term for the quality of being unlucky.","priority":"★★☆"},"example_sentences":[{"sentence":"The team's defeat was attributed to a series of unfortunate events and sheer **unluckiness**.","translation":"チームの敗北は、一連の不幸な出来事と全くの不運によるものとされた。","type":"noun","meaning_category":"不運"},{"sentence":"Despite his best efforts, his **unluckiness** persisted, causing him to miss several opportunities.","translation":"最善の努力にもかかわらず、彼の不運は続き、いくつかの機会を逃すことになった。","type":"noun","meaning_category":"不運"},{"sentence":"The **unluckiness** surrounding the project made it difficult to attract investors.","translation":"プロジェクトを取り巻く不運のせいで、投資家を集めるのが難しかった。","type":"noun","meaning_category":"不運"}]}