{"word":"wanrufe","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Internet slang) A misspelling of 'one rule for thee, and another for me', used to criticize hypocrisy or double standards.","english_definition":"A humorous or sarcastic misspelling of the phrase 'one rule for thee, and another for me', used to point out perceived hypocrisy or the application of double standards.","examples":[{"sentence":"They're always preaching about climate change, but then they fly around in private jets. Classic wanrufe.","translation":"彼らはいつも気候変動について説教しているのに、プライベートジェットで飛び回っている。典型的な偽善だ。"},{"sentence":"It's wanrufe when politicians tell everyone to tighten their belts while giving themselves raises.","translation":"政治家が国民に緊縮財政を強いる一方で、自分たちの給料を上げているのは偽善だ。"}],"collocations":["classic wanrufe","textbook wanrufe","the epitome of wanrufe"],"synonyms":["hypocrisy","double standard","do as I say, not as I do"],"antonyms":["fairness","equality","consistency","impartiality"]}],"etymology":{"value":"A deliberate misspelling of the phrase 'one rule for thee, and another for me', likely originating in online forums or social media as a way to satirize or mock the concept of hypocrisy.","priority":"★★★"},"pronunciation":{"ipa":"/ˌwʌnˈruːf/","syllables":"wan-roof"},"inflection":{"notes":"It's generally used as a noun. Plural form is 'wanrufes'."},"usage_notes":{"explanation":"'Wanrufe' is a slang term used primarily online to call out hypocrisy or double standards. It's intentionally misspelled to add a humorous or sarcastic tone. The phrase it's based on, 'one rule for thee, and another for me', implies that some individuals or groups believe they are exempt from rules or standards that apply to others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ That's such a wan roof situation.","correct":"✓ That's such a wanrufe situation.","note":"The correct spelling is 'wanrufe', not 'wan roof'."},{"incorrect":"✗ He wanrufed me by not following his own advice.","correct":"✓ He showed wanrufe by not following his own advice.","note":"'Wanrufe' is typically used as a noun, not a verb. You can say someone 'showed wanrufe' or 'displayed wanrufe'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_phrases":["one rule for thee, and another for me","double standard","hypocrisy"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency (primarily used in online contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Wanrufe' is an internet slang term that is a deliberate misspelling of the phrase 'one rule for thee, and another for me'. It's used to point out situations where someone is applying different standards to themselves than they are to others, often in a hypocritical way. Because it's slang, it's not appropriate for formal contexts and understanding it requires familiarity with online culture and internet humor."},"example_sentences":[{"sentence":"The politician was accused of wanrufe after being caught breaking the same rules he imposed on others.","translation":"その政治家は、他人に課したのと同じ規則を破ったことが発覚し、偽善的だと非難された。","type":"noun","meaning_category":"hypocrisy"},{"sentence":"The company's policy of allowing executives to work from home while requiring all other employees to be in the office is a clear case of wanrufe.","translation":"幹部は在宅勤務を許可する一方で、他のすべての従業員に出社を義務付けるという会社の方針は、明らかな偽善の例だ。","type":"noun","meaning_category":"double standard"},{"sentence":"The constant application of 'wanrufe' by the elite has eroded public trust.","translation":"エリートによる絶え間ない「偽善」の適用は、国民の信頼を損なってきた。","type":"noun","meaning_category":"hypocrisy"}]}