{"word":"banksman","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(イギリス英語) 採鉱作業員、坑口係、合図係","english_definition":"(British English) A person stationed at the top of a mine shaft to direct the raising and lowering of the cage or skip. More generally, a person who directs the movement of vehicles, cranes, or other equipment, especially where the operator has limited visibility.","examples":[{"sentence":"The banksman signaled the all-clear to lower the cage.","translation":"坑口係は、ケージを下ろすための安全確認の合図を送った。"},{"sentence":"The banksman guided the crane operator to safely position the load.","translation":"合図係は、クレーンオペレーターを誘導して、安全に荷物を配置させた。"}],"collocations":["banksman's whistle","banksman's signals","banksman duties"],"synonyms":["signalman","flagman","spotter","ground guide"],"antonyms":[]}],"etymology":{"value":"「banksman」は、「bank」と「man」の組み合わせで構成されています。「bank」は、この場合、鉱山の坑口や、工事現場などの土手や岸を指します。「man」は人を意味します。したがって、「banksman」は、文字通りには「土手の人」または「岸の人」という意味になり、鉱山の坑口や工事現場などで作業を監督し、合図を送る人を指すようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæŋksmən/","syllables":"banks-man"},"inflection":{"noun_plural":"banksmen"},"usage_notes":{"explanation":"「**banksman**」という単語は、主にイギリス英語で使用され、鉱山や建設現場などの特定の環境における役割を指します。この単語は、鉱山のシャフトの上で作業員や資材を運ぶケージの昇降を指示する人を指す場合や、クレーンや大型車両の運転手が視界の悪い場所で安全に作業できるように誘導する人を指す場合があります。重要なのは、banksmanは安全な作業を確保するために、明確な合図と指示を送る責任があるということです。アメリカ英語では、同様の役割を担う人に対して、signalman、spotter、またはground guideといった別の用語が使われることがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The banksman was responsible for repairing the machinery.","correct":"✓ The banksman was responsible for signaling and guiding the machinery.","note":"banksmanの主な役割は、機械の修理ではなく、合図を送ることと誘導することです。"},{"incorrect":"✗ The banksman used a radio to operate the crane.","correct":"✓ The banksman used a radio to communicate with the crane operator.","note":"banksmanはクレーンを操作するのではなく、オペレーターと通信して指示を出します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_occupations":["crane operator","miner","construction worker","safety officer"],"priority":"★★☆"},"level_frequency":{"CEFR":"不明 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の業界や地域でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**banksman**」は、特定の業界で使用される専門用語です。主にイギリス英語で使われ、鉱山や建設現場で、クレーンや大型車両のオペレーターに合図を送って安全な作業を誘導する人を指します。この役割の人は、視界が悪い場所で作業を安全に進めるために、明確な指示を出す責任があります。一般的にはあまり使われない単語なので、専門的な文脈で出会うことが多いでしょう。"},"example_sentences":[{"sentence":"The **banksman** carefully directed the crane as it lifted the heavy steel beam.","translation":"合図係は、重い鉄骨を持ち上げるクレーンを注意深く誘導した。","type":"noun","meaning_category":"合図係 (建設現場)"},{"sentence":"In the mine, the **banksman** ensured the safe passage of workers in the cage.","translation":"鉱山では、坑口係がケージ内の作業員の安全な通行を確保した。","type":"noun","meaning_category":"坑口係 (鉱山)"},{"sentence":"The **banksman**'s clear signals prevented a potential accident on the busy construction site.","translation":"合図係の明確な合図が、混雑した建設現場での潜在的な事故を防いだ。","type":"noun","meaning_category":"合図係 (建設現場)"}]}