{"word":"excoriation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"皮膚剥脱、表皮剥離、擦過傷","english_definition":"The act of abrading or wearing off the skin; a raw surface produced by such abrasion; a scratch or abrasion.","examples":[{"sentence":"The patient presented with excoriations on their arms and legs due to excessive scratching.","translation":"患者は、過度の掻きむしりによる腕と脚の皮膚剥脱を呈した。"},{"sentence":"The dermatologist noted several excoriations during the skin examination.","translation":"皮膚科医は皮膚検査中にいくつかの表皮剥離を認めた。"},{"sentence":"Chronic itching can lead to excoriations and secondary infections.","translation":"慢性の痒みは、皮膚剥脱や二次感染を引き起こす可能性がある。"}],"collocations":["skin excoriation","self-excoriation","excoriation disorder","traumatic excoriation","neurotic excoriation"],"synonyms":["abrasion","scratch","erosion","ulceration","denudation"],"antonyms":["intact skin","healing skin"]}],"etymology":{"value":"From Latin 'excoriare', meaning 'to flay, skin'. 'Ex-' meaning 'out, off' + 'corium' meaning 'skin, hide'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌskɔːriˈeɪʃən/","syllables":"ex·co·ri·a·tion"},"inflection":{"noun_plural":"excoriations"},"usage_notes":{"explanation":"'Excoriation' typically refers to a superficial skin injury caused by scratching, rubbing, or picking. It is often associated with dermatological conditions, psychiatric disorders (such as excoriation disorder or skin-picking disorder), or excessive itching. The term is primarily used in medical and dermatological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The wound was an excoriation, so it needed stitches.","correct":"The wound was a laceration, so it needed stitches.","note":"Excoriations are superficial and don't usually require stitches. Lacerations are deeper wounds that may require sutures."},{"incorrect":"She used exfoliation to create excoriations on her face.","correct":"She used exfoliation to remove dead skin cells from her face.","note":"Exfoliation is a cosmetic procedure to remove dead skin cells, while excoriations are injuries caused by abrasion or scratching."}],"priority":"★★☆"},"related_words":{"derivatives":["excoriate (verb): to strip off skin; to denounce strongly"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Excoriation' is a technical term primarily used in medical and dermatological contexts to describe a superficial skin injury caused by abrasion or scratching. It is not commonly used in everyday language. Understanding this term is important for healthcare professionals and those studying related fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor observed several linear excoriations on the patient's back.","translation":"医師は患者の背中にいくつかの線状の皮膚剥脱を認めた。","type":"medical","meaning_category":"skin injury"},{"sentence":"Self-excoriation is a common symptom of certain psychiatric disorders.","translation":"自傷的な皮膚剥脱は、特定の精神疾患の一般的な症状である。","type":"psychiatric","meaning_category":"psychiatric symptom"},{"sentence":"The constant itching led to excoriations and increased the risk of infection.","translation":"絶え間ない痒みが皮膚剥脱を引き起こし、感染のリスクを高めた。","type":"medical","meaning_category":"complication of itching"}]}