{"word":"photophosphorescent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"光燐光性の、光照射後に燐光を発する","english_definition":"Exhibiting photophosphorescence; capable of emitting light for a period of time after exposure to light.","examples":[{"sentence":"The photophosphorescent material glowed in the dark after being exposed to sunlight.","translation":"その光燐光性の物質は、日光にさらされた後、暗闇で光った。"},{"sentence":"Photophosphorescent paints are used in some emergency exit signs.","translation":"光燐光性の塗料は、一部の非常口標識に使用されている。"}],"collocations":["photophosphorescent material","photophosphorescent paint","photophosphorescent glow"],"synonyms":["phosphorescent","luminescent","glowing","light-emitting"],"antonyms":["non-phosphorescent","non-luminescent"]}],"etymology":{"value":"The word is formed by combining 'photo-' (relating to light), 'phosphorescent' (emitting light without heat), and the suffix '-ent' (indicating a quality or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊˌfɒsfəˈrɛsənt/","syllables":"pho-to-phos-pho-res-cent"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms (more photophosphorescent, most photophosphorescent) are possible, but less common."},"usage_notes":{"explanation":"'Photophosphorescent' specifically refers to materials that exhibit phosphorescence after being exposed to light. This is different from fluorescence, which stops emitting light almost immediately after the light source is removed. Photophosphorescence involves a longer-lasting emission of light.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material was fluorescent after being charged by light.","correct":"✓ The material was photophosphorescent after being charged by light.","note":"Use 'photophosphorescent' when the material continues to glow for a noticeable period after the light source is removed, not 'fluorescent'."}],"priority":"★☆☆"},"related_words":{"derivatives":["photophosphorescence (noun): the phenomenon of emitting light for a period of time after exposure to light.","phosphorescence (noun): the emission of light without heat.","fluorescence (noun): the emission of light immediately upon exposure to a light source."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'photophosphorescent' describes a material that glows in the dark after being exposed to light. It's a scientific term, so it's not used in everyday conversation. It's more likely to be found in scientific or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The dial of the watch was coated with a photophosphorescent substance, allowing it to be read in the dark.","translation":"時計の文字盤は光燐光性の物質でコーティングされており、暗闇でも読むことができた。","type":"general","meaning_category":"general"},{"sentence":"Scientists are exploring new photophosphorescent materials for use in energy-efficient lighting.","translation":"科学者たちは、エネルギー効率の高い照明に使用するための新しい光燐光性材料を研究している。","type":"scientific","meaning_category":"scientific"}]}