{"word":"archaized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"古風な、古めかしい、古語を用いた","english_definition":"Deliberately made to seem old-fashioned or characteristic of an earlier period.","examples":[{"sentence":"The author used an archaized style to evoke a sense of history.","translation":"著者は歴史的な感覚を呼び起こすために、古風な文体を使った。"},{"sentence":"The film's dialogue was intentionally archaized to match the setting.","translation":"映画の台詞は、設定に合わせて意図的に古めかしくされた。"},{"sentence":"The building's design includes archaized elements reminiscent of classical architecture.","translation":"その建物のデザインには、古典建築を彷彿とさせる古風な要素が含まれている。"}],"collocations":["archaized language (古風な言葉遣い)","archaized style (古風な文体)","archaized vocabulary (古風な語彙)","archaized spelling (古風な綴り)","archaized form (古風な形)"],"synonyms":["old-fashioned","antiquated","outdated","historicized","anachronistic","traditional"],"antonyms":["modern","contemporary","up-to-date","current","new"]},{"part_of_speech":"verb","definition":"（動詞の過去形、過去分詞）古風にする、古めかしくする","english_definition":"Past tense and past participle of the verb 'archaize': to make something appear old-fashioned or characteristic of an earlier period.","examples":[{"sentence":"The writer archaized the language in his novel to create a historical atmosphere.","translation":"作家は、歴史的な雰囲気を作り出すために、小説の言葉遣いを古風にした。"},{"sentence":"The playwright archaized the dialogue to reflect the time period of the play.","translation":"劇作家は、劇の時代を反映させるために、台詞を古めかしくした。"}],"collocations":["archaize language (言葉を古風にする)","archaize style (文体を古風にする)","archaize vocabulary (語彙を古風にする)"],"synonyms":["antiquate","old-fashioned","historicize","traditionalize"],"antonyms":["modernize","update","streamline","innovate"]}],"etymology":{"value":"Derived from 'archaize', which comes from the Greek 'archaios' meaning 'ancient' or 'primitive'. The suffix '-ed' indicates past tense or past participle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrkeɪˌaɪzd/","syllables":"ar-chai-zed"},"inflection":{"verb_forms":{"present_simple":["archaize","archaizes"],"past_simple":"archaized","past_participle":"archaized","present_participle":"archaizing"}},"usage_notes":{"explanation":"'Archaized' is used to describe something that has been deliberately made to resemble or imitate an older style or period. It is often used in the context of language, literature, art, and architecture. The intention is usually to create a specific atmosphere or to evoke a sense of history. It implies a conscious effort to adopt or recreate elements of the past.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The archaized building was very modern.","correct":"The archaized building incorporated elements of older architectural styles.","note":"'Archaized' implies the use of older styles, so it cannot be 'very modern'. It incorporates older elements into something, even if the base is new."},{"incorrect":"The author used archaic language unintentionally, so it was archaized.","correct":"The author used archaic language unintentionally, so it was archaic.","note":"'Archaized' implies a deliberate effort to make something old-fashioned. If it's unintentional, the correct term is 'archaic'."}],"priority":"★★☆"},"related_words":{"derivatives":["archaize (verb: 古風にする)","archaism (noun: 古語法、古風な表現、古物趣味)","archaic (adjective: 古風な、時代遅れの)","archaically (adverb: 古風に)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archaized' describes something that has been intentionally made to appear old-fashioned or characteristic of an earlier period. This term is often used in discussions of literature, art, architecture, and language when an artist or creator deliberately incorporates elements from the past. It implies a conscious effort to evoke a sense of history or tradition. This word is not commonly used in everyday conversation, so it is more likely to be encountered in academic or specialized contexts."},"example_sentences":[{"sentence":"The museum exhibited archaized pottery, carefully crafted to resemble ancient artifacts.","translation":"博物館では、古代の工芸品に似せて丁寧に作られた古風な陶器が展示されていた。","type":"adjective","meaning_category":"古風な"},{"sentence":"The author archaized his writing style to create a sense of authenticity in the historical novel.","translation":"著者は、歴史小説に信憑性を与えるために、文体を古風にした。","type":"verb (past tense)","meaning_category":"古風にする"},{"sentence":"The garden featured archaized statues, adding to its classical ambiance.","translation":"庭園には古風な彫像が置かれ、古典的な雰囲気を醸し出していた。","type":"adjective","meaning_category":"古風な"}]}