{"word":"Bunning","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Australian slang) A sausage wrapped in a slice of bread, typically purchased from a Bunnings Warehouse store.","english_definition":"(Australian slang) A sausage wrapped in a slice of bread, typically purchased from a Bunnings Warehouse store.","examples":[{"sentence":"Let's grab a bunning at Bunnings this weekend.","translation":"今週末はBunningsでバニングを買って食べよう。"},{"sentence":"A sausage sizzle at Bunnings isn't complete without a bunning.","translation":"Bunningsのソーセージシズルは、バニングなしでは完成しない。"}],"collocations":["grab a bunning","Bunnings bunning","sausage sizzle bunning"],"synonyms":["sausage sizzle","sausage in bread"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the Australian hardware chain, Bunnings Warehouse, where sausage sizzles are frequently held as fundraisers.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbʌnɪŋ/","syllables":"Bun-ning"},"inflection":{"noun_plural":"bunnings"},"usage_notes":{"explanation":"'Bunning' is a colloquial term specific to Australia, referring to a sausage served in a slice of bread, commonly sold at Bunnings Warehouse stores during fundraising events known as sausage sizzles. It is often used informally and is readily understood within Australian culture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to buy a bunning at the grocery store.","correct":"✓ I'm going to buy a sausage in bread at the grocery store.","note":"'Bunning' specifically refers to the sausage in bread purchased at Bunnings, not just any sausage in bread. Using 'sausage in bread' is more appropriate in other contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Bunnings Warehouse","sausage sizzle","democracy sausage"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Australian slang)","frequency_google_ngram":"Low frequency, specific to Australian English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bunning' is a very specific slang term used almost exclusively in Australia. It refers to a sausage served in a slice of bread, typically bought from a Bunnings Warehouse store during their fundraising sausage sizzles. Understanding this term requires familiarity with Australian culture and the Bunnings tradition. It's not a word commonly found in standard English or taught in general English language courses."},"example_sentences":[{"sentence":"After shopping at Bunnings, we treated ourselves to a classic bunning.","translation":"Bunningsで買い物した後、私たちは定番のバニングをご褒美に食べた。","type":"noun","meaning_category":"Food"},{"sentence":"The local scout group was selling bunnings to raise money for their trip.","translation":"地元のボーイスカウトグループは、旅行の資金を集めるためにバニングを販売していた。","type":"noun","meaning_category":"Fundraising"}]}