{"word":"semipictorially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半絵画的に、部分的に絵を用いて","english_definition":"In a manner that is partly pictorial; using pictures to some extent.","examples":[{"sentence":"The story was presented semipictorially, with some illustrations accompanying the text.","translation":"その物語は半絵画的に表現され、テキストにいくつかのイラストが添えられていた。"},{"sentence":"The instructions were semipictorially designed, using diagrams to clarify certain steps.","translation":"指示は半絵画的に設計され、特定のステップを明確にするために図が使用されていた。"}],"collocations":["present semipictorially","design semipictorially","explain semipictorially"],"synonyms":["partly pictorially","partially illustrated","with some illustrations"],"antonyms":["textually","verbally","non-pictorially","without illustrations"]}],"etymology":{"value":"The word is formed by combining 'semi-' (meaning 'half' or 'partly') with 'pictorially' (meaning 'in a pictorial manner').","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˌpɪkˈtɔːriəli/","syllables":"se-mi-pic-to-ri-al-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"'Semipictorially' is used to describe something that is presented or represented using a combination of pictures and other methods, such as text. It implies that the visual aspect is present but not dominant or exclusive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The presentation was semipictorial, it had many pictures.","correct":"✓ The presentation was semipictorial; it had many pictures. / ✓ The presentation was semipictorial and had many pictures.","note":"When using 'semipictorial' to describe something, ensure correct punctuation and sentence structure. A semicolon or conjunction is needed to connect related clauses."}],"priority":"★★☆"},"related_words":{"derivatives":["semi- (prefix)","pictorial (adjective)","pictorially (adverb)","picture (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semipictorially' is a relatively uncommon adverb used to describe something that is presented partly through pictures or illustrations. It is typically used in formal or technical contexts to specify that visual elements are combined with other forms of communication, such as text or speech. Understanding the prefix 'semi-' (meaning 'half' or 'partly') and the adjective 'pictorial' (related to pictures) helps in comprehending its meaning."},"example_sentences":[{"sentence":"The children's book explained the complex scientific concepts semipictorially, using diagrams and simple drawings.","translation":"その児童書は、複雑な科学的概念を半絵画的に説明し、図や簡単な絵を使用した。","type":"general"},{"sentence":"The software manual presented the installation process semipictorially, with screenshots accompanying each step.","translation":"ソフトウェアマニュアルは、インストールプロセスを半絵画的に示し、各ステップにスクリーンショットを添付した。","type":"technical"}]}