{"word":"mariticide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"妻殺し、妻殺害犯","english_definition":"the killing of a wife by her husband; a man who kills his wife.","examples":[{"sentence":"He was charged with mariticide after his wife's death.","translation":"彼は妻の死後、妻殺しの罪で起訴された。"},{"sentence":"The novel explores the psychological motivations behind mariticide.","translation":"その小説は妻殺しの背後にある心理的な動機を探求している。"}],"collocations":["commit mariticide (妻殺しを犯す)","accused of mariticide (妻殺しの罪で告発された)","the crime of mariticide (妻殺しの罪)"],"synonyms":["wife-murder","uxoricide (more general term for killing one's spouse)"],"antonyms":["uxoricide (husband killing wife or wife killing husband)","fratricide (killing of a brother)","matricide (killing of a mother)","parricide (killing of a parent or close relative)"],"notes":"Mariticide specifically refers to the killing of a wife by her husband. Uxoricide is a broader term that can refer to the killing of either spouse, but is often used synonymously with mariticide."}],"etymology":{"value":"From Latin 'maritus' (husband) + '-cide' (killer or act of killing).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈrɪtɪsaɪd/","syllables":"ma-ri-ti-cide"},"inflection":{"noun_plural":"mariticides"},"usage_notes":{"explanation":"'Mariticide' is a relatively rare and specific term. It is used in legal and criminological contexts, as well as in literature and discussions of domestic violence. It is important to use the term accurately to distinguish it from other forms of homicide.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He committed uxoricide, which is the killing of a mother.","correct":"He committed mariticide, which is the killing of a wife by her husband.","note":"Uxoricide is the killing of a spouse, while mariticide is specifically the killing of a wife by her husband."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["uxoricide (spouse killing)","homicide (general term for killing a person)","fratricide (killing of a brother)","matricide (killing of a mother)","parricide (killing of a parent)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mariticide' is a specialized term referring to the killing of a wife by her husband. It is not commonly used in everyday language, but may appear in legal, criminological, or literary contexts. Understanding the etymology (Latin roots) can help in remembering the meaning. It's important to distinguish it from the more general term 'uxoricide,' which can refer to the killing of either spouse."},"example_sentences":[{"sentence":"The detective investigated the case as a possible mariticide.","translation":"刑事はその事件を妻殺しの可能性として捜査した。","type":"general","meaning_category":"crime"},{"sentence":"Studies on mariticide often examine patterns of domestic abuse.","translation":"妻殺しに関する研究は、しばしば家庭内虐待のパターンを調べる。","type":"research","meaning_category":"study"}]}