{"word":"Pneumoperitonitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腹腔内気腹、腹腔内遊離ガス","english_definition":"The presence of air or gas in the peritoneal cavity.","examples":[{"sentence":"Pneumoperitonitis is often a sign of a perforated abdominal organ.","translation":"腹腔内気腹はしばしば腹部臓器穿孔の兆候である。"},{"sentence":"The diagnosis of pneumoperitonitis is typically made via abdominal X-ray or CT scan.","translation":"腹腔内気腹の診断は通常、腹部X線またはCTスキャンによって行われる。"}],"collocations":["cause of pneumoperitonitis (腹腔内気腹の原因)","diagnosis of pneumoperitonitis (腹腔内気腹の診断)","treatment of pneumoperitonitis (腹腔内気腹の治療)","pneumoperitonitis secondary to perforation (穿孔に続発する腹腔内気腹)"],"synonyms":["free air in abdomen","intra-abdominal free air"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pneumo' (air), 'peritoneum' (the membrane lining the abdominal cavity), and '-itis' (inflammation, though not always present in this condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːmoʊˌpɛrɪtəˈnaɪtɪs/","syllables":"pneu-mo-per-i-to-ni-tis"},"inflection":{"noun_plural":"Pneumoperitonitises / Pneumoperitonitis"},"usage_notes":{"explanation":"Pneumoperitonitis is a serious medical condition that requires prompt diagnosis and treatment. While the term contains '-itis', indicating inflammation, the condition itself refers to the presence of air, regardless of whether inflammation is present. The most common cause is a perforation of a hollow abdominal organ, such as the stomach, small intestine, or colon. However, it can also occur after abdominal surgery, trauma, or, rarely, spontaneously. Imaging studies are crucial for diagnosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pneumoperitonitis is always caused by infection.","correct":"✓ Pneumoperitonitis is most often caused by perforation, but not always infection.","note":"While infection can be a contributing factor, the primary cause is usually a perforation of a hollow organ, allowing air to enter the peritoneal cavity."}],"priority":"★★☆"},"related_words":{"derivatives":["peritoneum (腹膜)","peritonitis (腹膜炎)","pneumothorax (気胸)","pneumonia (肺炎)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pneumoperitonitis' is a medical term indicating the presence of air or gas within the peritoneal cavity, the space inside the abdomen that contains organs like the stomach and intestines. It's a serious condition often resulting from a hole (perforation) in one of these organs, allowing air to leak out. Doctors usually diagnose it using X-rays or CT scans. Although the name sounds like it involves inflammation (because of the '-itis' suffix), it primarily refers to the presence of air, not necessarily inflammation. This term is mainly used by healthcare professionals."},"example_sentences":[{"sentence":"The patient presented with severe abdominal pain and was found to have pneumoperitonitis on imaging.","translation":"患者は重度の腹痛を訴え、画像検査で腹腔内気腹が見つかった。","type":"medical case","meaning_category":"medical condition"},{"sentence":"Postoperative pneumoperitonitis can occur after laparoscopic surgery.","translation":"腹腔鏡手術後に術後腹腔内気腹が発生することがある。","type":"medical context","meaning_category":"postoperative complication"}]}