{"word":"Swahilize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To cause something to become more like Swahili in character or style; to adapt or translate something into Swahili.","english_definition":"To adapt or translate into Swahili; to make something more Swahili in character.","examples":[{"sentence":"They decided to Swahilize the English textbook to make it more accessible to local students.","translation":"彼らは、地元の学生にとってよりアクセスしやすくするために、英語の教科書をスワヒリ化することにしました。","notes":"This example shows the textbook being adapted into Swahili."},{"sentence":"The restaurant tried to Swahilize its menu by adding local dishes and Swahili names.","translation":"そのレストランは、地元の料理とスワヒリ語の名前を追加して、メニューをスワヒリ化しようとしました。","notes":"This example shows the menu being adapted to reflect Swahili culture."}],"collocations":["Swahilize a text","Swahilize a menu","Swahilize a name","Swahilize content"],"synonyms":["adapt to Swahili","translate into Swahili","Africanize","localize"],"antonyms":["Anglicize","Westernize"]}],"etymology":{"value":"Derived from 'Swahili' (the language and culture) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/swɑːˈhiːlaɪz/","syllables":"Swa-hi-lize"},"inflection":{"verb_forms":{"present_simple":["Swahilize","Swahilizes"],"past_simple":"Swahilized","past_participle":"Swahilized","present_participle":"Swahilizing"}},"usage_notes":{"explanation":"The term 'Swahilize' is used to describe the process of adapting something to fit Swahili language, culture, or customs. It can refer to translation, cultural adaptation, or the incorporation of Swahili elements into something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Swahili the document.","correct":"✓ I am going to Swahilize the document.","note":"The correct verb form is 'Swahilize', not 'Swahili'."}],"priority":"★★☆"},"related_words":{"derivatives":["Swahilization (noun: the process of Swahilizing)","Swahili (adjective/noun: relating to Swahili language or culture)"],"related_terms":["Africanize","localize","cultural adaptation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Swahilize' is a relatively uncommon verb that means to adapt something to Swahili language, culture, or customs. It involves making something more Swahili in character, often through translation or cultural modification. Understanding the context in which it is used is important, as it implies a specific cultural or linguistic transformation."},"example_sentences":[{"sentence":"The organization aimed to Swahilize its training programs to better serve the local community.","translation":"その組織は、地域社会により良いサービスを提供するために、トレーニングプログラムをスワヒリ化することを目指しました。","type":"verb","meaning_category":"Adaptation"},{"sentence":"The software company decided to Swahilize its interface for the East African market.","translation":"そのソフトウェア会社は、東アフリカ市場向けにインターフェースをスワヒリ化することにしました。","type":"verb","meaning_category":"Translation/Adaptation"}]}