{"word":"interpretatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"解釈的に、解釈によって；解釈に基づいて","english_definition":"In an interpretive manner; according to a particular interpretation.","examples":[{"sentence":"The poem can be read interpretatively in several different ways.","translation":"その詩は、解釈的にいくつかの異なる読み方ができる。"},{"sentence":"The data was analyzed interpretatively, taking into account various contextual factors.","translation":"データは、さまざまな状況的要因を考慮して、解釈的に分析された。"},{"sentence":"The law was applied interpretatively, leading to different outcomes in similar cases.","translation":"法律は解釈的に適用され、類似の事例で異なる結果につながった。"}],"collocations":["analyze interpretatively","read interpretatively","apply interpretatively","understand interpretatively"],"synonyms":["subjectively","personally","contextually","hermeneutically"],"antonyms":["literally","objectively","factually"]}],"etymology":{"value":"The word 'interpretatively' is derived from the adjective 'interpretative,' which comes from the verb 'interpret.' The suffix '-ly' is added to form the adverb.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɪnˈtɜːrprɪtətɪvli/","syllables":"in-ter-pre-ta-tive-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Interpretatively' is used to describe actions or analyses that are based on interpretation rather than objective facts. It implies that there is room for different understandings or perspectives. It is often used in fields like literature, law, and social sciences, where subjective understanding plays a significant role.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He interpretatively explained the situation.","correct":"✓ He explained the situation interpretatively.","note":"Adverbs usually modify verbs, adjectives, or other adverbs. In this case, 'interpretatively' modifies 'explained,' so it should be placed after the verb. However, there are many exceptions to this rule, and adverb placement can be flexible depending on desired emphasis."},{"incorrect":"✗ The interpretatively data was used.","correct":"✓ The data was used interpretatively.","note":"'Interpretatively' is an adverb and cannot modify a noun directly. Use the adjective 'interpretative' instead if you want to describe the data itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["interpret (verb)","interpretation (noun)","interpretative (adjective)","interpreter (noun)"],"phrases":["interpretative dance","interpretative art","interpretative approach","interpretative skills"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interpretatively' describes something done based on a particular understanding or viewpoint, rather than just stating facts. It's used when different people might understand something in different ways. You'll often find it in discussions about art, literature, or law, where people's opinions and interpretations matter."},"example_sentences":[{"sentence":"The evidence was presented interpretatively, highlighting aspects that supported the prosecution's case.","translation":"証拠は検察側の主張を支持する側面を強調して、解釈的に提示された。","type":"adverb","meaning_category":"解釈的に"},{"sentence":"We need to analyze the results interpretatively, considering the limitations of the study.","translation":"研究の限界を考慮して、結果を解釈的に分析する必要がある。","type":"adverb","meaning_category":"解釈的に"},{"sentence":"The role of the critic is to engage with the artwork interpretatively, offering insights and perspectives.","translation":"批評家の役割は、作品を解釈的に考察し、洞察と視点を提供することである。","type":"adverb","meaning_category":"解釈的に"}]}