{"word":"unassumedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"控えめに、気取らずに、謙虚に","english_definition":"in a modest and unassuming manner; without pretension or arrogance.","examples":[{"sentence":"She unassumedly accepted the award, thanking everyone who had supported her.","translation":"彼女は控えめに賞を受け取り、彼女を支えてくれたすべての人に感謝した。"},{"sentence":"He unassumedly shared his knowledge, never boasting about his expertise.","translation":"彼は気取らずに自分の知識を共有し、決して自分の専門知識を自慢することはなかった。"},{"sentence":"The restaurant, unassumedly located in a quiet alley, served the best food in town.","translation":"そのレストランは、ひっそりと静かな路地にありながら、町で最高の料理を提供していた。"}],"collocations":["behave unassumedly","live unassumedly","dress unassumedly","speak unassumedly","accept unassumedly"],"synonyms":["modestly","humbly","unpretentiously","without airs","without affectation","simply"],"antonyms":["arrogantly","pretentiously","ostentatiously","pompously"]}],"etymology":{"value":"Formed by adding the suffix '-ly' to the adjective 'unassumed'. 'Unassumed' is formed from the prefix 'un-' (not) + 'assumed' (past participle of 'assume'). 'Assume' comes from Latin 'assumere' (to take to oneself). Therefore, 'unassumedly' means 'not taken to oneself' in a showy or pretentious way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈsjuːmɪdli/","syllables":"un-a-ssu-med-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Unassumedly' describes an action or behavior that is modest, humble, and without any attempt to impress others. It suggests a lack of pretension or arrogance. The word is relatively formal and not as commonly used as its synonyms like 'modestly' or 'humbly'. It emphasizes the absence of any outward show of superiority or self-importance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unassumedly was the best player.","correct":"✓ He was unassumedly the best player.","note":"'Unassumedly' is an adverb and should modify the verb, not act as a subject complement. While grammatically correct, this sentence structure is less common. It's better to use 'He unassumedly accepted...' or 'He behaved unassumedly...'."},{"incorrect":"✗ She unassumedly wore a diamond necklace.","correct":"✓ She wore a simple dress unassumedly.","note":"Wearing an expensive item doesn't necessarily mean someone is not behaving unassumedly. The manner in which they wear it and behave is what matters. The corrected sentence focuses on the simple dress and the unassuming way she wore it."}],"priority":"★☆☆"},"related_words":{"derivatives":["unassuming (adjective): modest, humble, not pretentious","assume (verb): to suppose to be the case without proof","assumption (noun): a thing that is accepted as true or as certain to happen, without proof"],"related_adverbs":["modestly","humbly","unpretentiously"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and formal)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unassumedly' is a formal word that means doing something in a modest and humble way, without trying to show off or impress others. It's not a word you'll hear every day, but it's useful for describing someone who is genuine and doesn't try to act better than they are. Think of it as the opposite of acting arrogantly or pretentiously. Because it's a longer and less common word, it's generally used in more formal writing or speech."},"example_sentences":[{"sentence":"Despite her talent, she unassumedly joined the team, eager to learn from others.","translation":"才能があるにもかかわらず、彼女は控えめにチームに加わり、他の人から学ぶことを熱望していた。","type":"adverb","meaning_category":"控えめに"},{"sentence":"He unassumedly offered his expertise, never seeking recognition for his contributions.","translation":"彼は気取らずに自分の専門知識を提供し、自分の貢献に対する認識を求めることは決してなかった。","type":"adverb","meaning_category":"気取らずに"},{"sentence":"The small cafe, unassumedly tucked away on a side street, became a local favorite.","translation":"その小さなカフェは、ひっそりと脇道に隠れていながら、地元の人々に愛される店となった。","type":"adverb","meaning_category":"謙虚に"}]}