{"word":"growth-retarding","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"成長を遅らせる、発育阻害性の","english_definition":"Having the effect of slowing down or inhibiting growth.","examples":[{"sentence":"The chemical has growth-retarding effects on plants.","translation":"その化学物質は植物に対して成長を遅らせる効果がある。"},{"sentence":"A growth-retarding diet can have serious consequences for children.","translation":"成長を遅らせる食事は、子供たちにとって深刻な結果をもたらす可能性がある。"}],"collocations":["growth-retarding effect","growth-retarding substance","growth-retarding factor","growth-retarding agent"],"synonyms":["growth-inhibiting","growth-slowing","developmentally delaying"],"antonyms":["growth-promoting","growth-enhancing","growth-stimulating"]},{"part_of_speech":"noun","definition":"成長遅延物質、発育阻害剤","english_definition":"A substance or factor that slows down or inhibits growth.","examples":[{"sentence":"The farmer used a growth-retarding agent to keep the plants from growing too tall.","translation":"農家は植物が過剰に成長するのを防ぐために、成長遅延剤を使用した。"}],"collocations":["use of growth-retarding agents","application of growth-retarding substances"],"synonyms":["growth inhibitor","growth suppressant"],"antonyms":["growth promoter","growth enhancer"]}],"etymology":{"value":"The word is formed by combining \"growth\" (the process of increasing in size or development), \"retarding\" (slowing down or delaying), and the hyphen to connect the two words. It describes something that has the effect of slowing down or inhibiting growth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡroʊθ rɪˈtɑːrdɪŋ/","syllables":"growth-re-tard-ing"},"inflection":{"notes":"As an adjective, it doesn't have typical inflections. As a noun, the plural form would be 'growth-retarding agents' or 'growth-retarding substances'."},"usage_notes":{"explanation":"\"Growth-retarding\" is primarily used in scientific, agricultural, and medical contexts. It refers to factors, substances, or conditions that negatively affect the normal rate of growth or development. It can describe the impact of chemicals on plants, the effects of malnutrition on children, or the properties of certain medications. The term carries a negative connotation, implying that the slowed growth is undesirable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The growth-retarding was used to help the plants grow slower.","correct":"✓ The growth-retarding agent was used to help the plants grow slower.","note":"It's important to specify what is growth-retarding (e.g., agent, substance, factor). Using \"growth-retarding\" alone as a noun is less common and can sound awkward."},{"incorrect":"✗ The child had a growth-retarding.","correct":"✓ The child had a growth-retarding condition. / ✓ The child experienced growth retardation.","note":"When referring to a condition, it's more appropriate to use \"growth retardation\" (a noun) or \"growth-retarding condition\"."}],"priority":"★★☆"},"related_words":{"derivatives":["retardation (名詞: 遅延、妨害)","retardant (名詞/形容詞: 遅延剤、遅らせる)","retard (動詞: 遅らせる)"],"phrasal_verbs":[],"related_terms":["growth retardation","growth hormone","growth factor","developmental delay","malnutrition","inhibitor"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"growth-retarding\" is a specialized term typically used in scientific or medical contexts. It describes something that slows down or inhibits the normal process of growth. Understanding this term requires a good grasp of scientific vocabulary and the ability to understand compound adjectives. The term is not commonly used in everyday conversation, so it is more likely to be encountered in technical or academic texts."},"example_sentences":[{"sentence":"The study investigated the growth-retarding effects of the pesticide on aquatic organisms.","translation":"その研究では、農薬が水生生物に及ぼす成長遅延効果について調査した。","type":"adjective","meaning_category":"成長を遅らせる"},{"sentence":"The doctor suspected a growth-retarding factor was contributing to the child's stunted height.","translation":"医師は、成長を遅らせる要因が子供の身長の伸び悩みに寄与しているのではないかと疑った。","type":"adjective","meaning_category":"成長を遅らせる"},{"sentence":"Certain herbicides act as growth-retarding agents, preventing weeds from overgrowing crops.","translation":"特定の除草剤は成長遅延剤として作用し、雑草が作物に過剰に繁茂するのを防ぐ。","type":"noun","meaning_category":"成長遅延物質"}]}