{"word":"energy-hidden","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主にファンタジー作品などで)エネルギーが隠されている、または感知できない状態","english_definition":"(Primarily in fantasy works) Describes a state where energy is concealed or undetectable.","examples":[{"sentence":"The artifact was energy-hidden, making it impossible to find with normal detection methods.","translation":"そのアーティファクトはエネルギーが隠されていたため、通常の探知方法では見つけることが不可能だった。"},{"sentence":"The mage cast a spell to make himself energy-hidden from his enemies.","translation":"魔法使いは敵からエネルギーを隠すために魔法をかけた。"}],"collocations":["energy-hidden artifact","energy-hidden spell","become energy-hidden"],"synonyms":["undetectable","concealed","masked","cloaked"],"antonyms":["detectable","visible","revealed"]}],"etymology":{"value":"'Energy' + 'hidden'. A compound word describing something with concealed energy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛnərdʒi ˈhɪdən/","syllables":"en-er-gy hid-den"},"inflection":{"adjective_forms":{"comparative":"more energy-hidden","superlative":"most energy-hidden"}},"usage_notes":{"explanation":"This term is primarily used in fictional contexts, especially in fantasy or science fiction, where characters or objects can have their energy signatures masked or concealed. It is not a standard English term and would not be used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The energy-hidden person walked down the street.","correct":"✓ The person with hidden energy walked down the street.","note":"Use 'energy-hidden' to describe the state of having concealed energy, not as a general descriptor of a person."}],"priority":"★★☆"},"related_words":{"derivatives":["energy","hidden"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in niche fictional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'energy-hidden' is a specialized term used in fantasy and science fiction. It describes something whose energy signature is concealed, making it difficult or impossible to detect. Understanding this term requires familiarity with fictional concepts related to energy manipulation and concealment. It is not a common term in everyday language."},"example_sentences":[{"sentence":"The spaceship was designed to be energy-hidden, making it nearly invisible to enemy sensors.","translation":"その宇宙船はエネルギーを隠すように設計されており、敵のセンサーにはほとんど見えなかった。","type":"adjective","meaning_category":"concealed energy"},{"sentence":"Only a powerful spell could make the amulet energy-hidden.","translation":"強力な魔法だけが、そのお守りのエネルギーを隠すことができた。","type":"adjective","meaning_category":"undetectable"}]}