{"word":"Eddoes","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"タロイモの一種で、塊茎と葉柄を食用とする","english_definition":"A tropical plant (Colocasia esculenta antiquorum) of the taro family, grown for its edible corms and petioles.","examples":[{"sentence":"Eddoes are smaller and have a slightly different taste compared to taro.","translation":"エドはタロイモに比べて小さく、味が少し異なります。"},{"sentence":"In some cultures, eddoes are a staple food.","translation":"一部の文化では、エドは主食です。"}],"collocations":["cook eddoes","eat eddoes","grow eddoes"],"synonyms":["taro","dasheen"],"antonyms":[]}],"etymology":{"value":"The word 'eddoes' is believed to be of West African origin, possibly from the Igbo language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛdoʊz/","syllables":"Ed-does"},"inflection":{"noun_plural":"eddoes"},"usage_notes":{"explanation":"Eddoes are often confused with taro, but they are distinct varieties of the same species. Eddoes are generally smaller and have a more glutinous texture when cooked. They are used in similar ways to taro, such as in stews, soups, and as a side dish.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a taro, but it was an eddoe.","correct":"✓ I bought what I thought was a taro, but it turned out to be an eddoe.","note":"Eddoes and taro are often mislabeled, so be sure to check the appearance and taste."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Eddoes are a less common type of taro. The word is not widely used outside of culinary or botanical contexts. Understanding requires familiarity with tropical root vegetables."},"example_sentences":[{"sentence":"The recipe called for eddoes, but I only had taro.","translation":"レシピではエドが指定されていましたが、タロイモしかありませんでした。","type":"general","meaning_category":"identification"},{"sentence":"Eddoes are a good source of carbohydrates.","translation":"エドは炭水化物の良い供給源です。","type":"general","meaning_category":"nutrition"}]}