{"word":"tautophony","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同音反復（同じ音や類似の音が連続して現れること。特に、不快または不自然な音の繰り返しを指す。）","english_definition":"The repetition of the same sound or similar sounds, especially when considered unpleasant or awkward.","examples":[{"sentence":"The tautophony in the sentence 'She sells seashells by the seashore' is a classic example of tongue-twister difficulty.","translation":"「She sells seashells by the seashore（彼女は海岸で貝殻を売る）」という文における同音反復は、早口言葉の難しさの典型的な例です。"},{"sentence":"The poet avoided tautophony by carefully choosing words with different sounds.","translation":"詩人は異なる音を持つ言葉を注意深く選ぶことによって、同音反復を避けました。"}],"collocations":["avoid tautophony (同音反復を避ける)","create tautophony (同音反復を作り出す)","example of tautophony (同音反復の例)"],"synonyms":["repetition","alliteration","assonance","consonance"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'tauto-' (同じ) + 'phone' (音) から。","priority":"★★☆"},"pronunciation":{"ipa":"/tɔːˈtɒfəni/","syllables":"tau-toph-o-ny"},"inflection":{"noun_plural":"tautophonies"},"usage_notes":{"explanation":"Tautophony is often considered a stylistic flaw in writing or speech, especially when it is unintentional and creates an unpleasant or distracting effect. However, it can also be used deliberately for emphasis or humorous effect, such as in tongue-twisters. It is related to other sound devices like alliteration, assonance, and consonance, but specifically refers to the repetition of the *same* sound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem was praised for its tautophony.","correct":"✓ The poem was criticized for its tautophony. / ✓ The poem used alliteration effectively.","note":"Tautophony is generally considered undesirable, so it's more likely to be criticized than praised. If the poem used sound repetition effectively, it would more likely be described as alliteration, assonance, or consonance."}],"priority":"★☆☆"},"related_words":{"derivatives":["tautophonous (形容詞: 同音反復の)"],"related_concepts":["alliteration (頭韻)","assonance (母音韻)","consonance (子音韻)","euphony (美音)","cacophony (不協和音)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈以外ではまれ。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tautophony' refers to the repetition of the same or similar sounds in close proximity, often considered an undesirable stylistic element in writing or speech due to its potential for creating an awkward or unpleasant auditory effect. While related to other sound devices like alliteration, assonance, and consonance, tautophony specifically denotes the repetition of identical or nearly identical sounds. Its deliberate use is rare, typically found in tongue-twisters or for specific emphasis, but unintentional tautophony is generally avoided in formal writing and speech.","priority":"★☆☆"},"example_sentences":[{"sentence":"The excessive use of 's' sounds created an unpleasant tautophony in the sentence.","translation":"「s」音の過度の使用は、文中で不快な同音反復を生み出しました。","type":"general","meaning_category":"general"},{"sentence":"The writer revised the paragraph to eliminate the distracting tautophony.","translation":"作家は、気が散る同音反復を排除するために段落を修正しました。","type":"general","meaning_category":"general"}]}