{"word":"substrate-grown","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(植物などが)基質栽培された","english_definition":"Grown in a substrate (a substance or layer on which an organism lives or grows) rather than in soil.","examples":[{"sentence":"These are substrate-grown mushrooms, which are known for their consistent quality.","translation":"これらは基質栽培されたキノコで、品質が安定していることで知られています。"},{"sentence":"The hydroponic farm uses substrate-grown lettuce to maximize yield.","translation":"その水耕栽培農場では、収量を最大化するために基質栽培されたレタスを使用しています。"}],"collocations":["substrate-grown plants","substrate-grown vegetables","substrate-grown mushrooms","hydroponic substrate-grown"],"synonyms":["soilless-grown","hydroponically-grown"],"antonyms":["soil-grown","field-grown"]}],"etymology":{"value":"Combination of 'substrate' (a substance or layer on which an organism lives or grows) and 'grown' (past participle of 'grow').","priority":"N/A"},"pronunciation":{"ipa":"ˈsʌbstreɪtˌɡroʊn/","syllables":"sub-strate-grown"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Substrate-grown' is used to describe plants or other organisms that are cultivated using a soilless medium, such as rockwool, coco coir, or perlite. This method is common in hydroponics and other forms of controlled environment agriculture.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The substrate grown is very important.","correct":"✓ The substrate is very important for substrate-grown plants.","note":"'Substrate-grown' is an adjective and needs to modify a noun. Using 'substrate' as the subject is more appropriate in this context."}],"priority":"N/A"},"related_words":{"derivatives":["substrate","hydroponics","soilless culture"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'substrate-grown' is a technical term primarily used in the context of agriculture, horticulture, and botany. It refers to a specific method of growing plants without soil, using an alternative medium called a substrate. Understanding this term requires familiarity with agricultural practices and terminology. Therefore, it is more commonly encountered in specialized texts and discussions related to these fields."},"example_sentences":[{"sentence":"The substrate-grown tomatoes are less susceptible to soilborne diseases.","translation":"基質栽培されたトマトは、土壌由来の病気にかかりにくい。","type":"adjective","meaning_category":"Cultivation method"},{"sentence":"The farmer invested in substrate-grown technology to improve crop yields.","translation":"その農家は、作物の収量を改善するために基質栽培技術に投資した。","type":"adjective","meaning_category":"Cultivation method"}]}