{"word":"apagogic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"帰謬法の、背理法の","english_definition":"Relating to or characterized by argument by contradiction; demonstrating the truth of something by showing the falsity or absurdity of the contrary.","examples":[{"sentence":"The apagogic proof showed that the initial assumption was impossible.","translation":"その帰謬法による証明は、最初の仮定が不可能であることを示した。"},{"sentence":"Apagogic arguments are common in philosophical debates.","translation":"背理法による議論は、哲学的な議論でよく見られる。"}],"collocations":["apagogic proof","apagogic argument","apagogic method"],"synonyms":["reductio ad absurdum","indirect proof","argument by contradiction"],"antonyms":["direct proof","constructive proof"]}],"etymology":{"value":"From Late Latin 'apagogicus', from Greek 'apagogikos', from 'apagōgē' (ἀπαγωγή) meaning 'a leading away, deduction', from 'apagō' (ἀπάγω) meaning 'to lead away, carry off, deduce'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæpəˈɡɒdʒɪk/","syllables":"a-pa-go-gic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Apagogic' refers to a method of proof or argument that demonstrates the truth of a proposition by showing that its negation leads to a contradiction or absurdity. It is a less common term than 'reductio ad absurdum', but they are largely synonymous. This method is frequently used in mathematics, logic, and philosophy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The apagogic was used to directly prove the theorem.","correct":"✓ The apagogic method was used to indirectly prove the theorem.","note":"Apagogic proofs are indirect; they prove something by disproving its opposite."}],"priority":"★★☆"},"related_words":{"derivatives":["apagogically (adverb)"],"related_terms":["reductio ad absurdum","proof by contradiction"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apagogic' is a highly specialized term primarily encountered in advanced studies of logic, mathematics, and philosophy. It describes a method of proof that establishes a claim by demonstrating the absurdity of its negation, a concept often referred to as 'reductio ad absurdum'. Due to its specific and technical nature, this term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The mathematician employed an **apagogic** argument to demonstrate the uniqueness of the solution.","translation":"その数学者は、解の一意性を示すために帰謬法による議論を用いた。","type":"adjective","meaning_category":"帰謬法の"},{"sentence":"An **apagogic** proof is often more elegant than a direct one, though sometimes harder to follow.","translation":"背理法による証明は、直接的な証明よりもエレガントであることが多いが、理解するのが難しい場合もある。","type":"adjective","meaning_category":"背理法の"}]}