{"word":"purselike","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"財布のような、財布に似た","english_definition":"Resembling a purse in shape or appearance.","examples":[{"sentence":"The old woman's face had a purselike quality, with thin, drawn lips.","translation":"その老婆の顔は、薄く引き締まった唇が財布のような印象を与えていた。"},{"sentence":"The flower bud had a purselike form before it opened.","translation":"その花のつぼみは、開花する前は財布のような形をしていた。"}],"collocations":["purselike mouth","purselike appearance","purselike shape"],"synonyms":["pouched","baglike","sacklike"],"antonyms":[]}],"etymology":{"value":"\"purse\" + \"-like\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɜːrslaɪk/","syllables":"purse-like"},"inflection":{"notes":"Not applicable, adjective"},"usage_notes":{"explanation":"The adjective \"purselike\" is used to describe something that has the shape, appearance, or characteristics of a purse. It is often used to describe the mouth or face when the lips are tightly drawn together, resembling the closed opening of a purse. It can also be used more generally to describe any object that has a similar pouch-like or bag-like form.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The purselike dog barked loudly.","correct":"✓ The small dog barked loudly.","note":"Purselike is not commonly used to describe animals unless referring to a specific physical feature resembling a purse."}],"priority":"★★☆"},"related_words":{"derivatives":["purse (noun)","like (suffix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'purselike' is a descriptive adjective that means resembling a purse. It's not a commonly used word, and its understanding relies on recognizing the physical characteristics of a purse (a small bag or pouch used for carrying money). Therefore, it's more likely to be encountered and understood by advanced English language learners."},"example_sentences":[{"sentence":"Her lips tightened into a purselike line as she listened to the bad news.","translation":"彼女は悪い知らせを聞きながら、唇を財布のように引き締めた。","type":"descriptive","meaning_category":"resembling a purse"},{"sentence":"The strange fruit had a purselike shape and a rough texture.","translation":"その奇妙な果物は財布のような形をしており、表面はざらざらしていた。","type":"descriptive","meaning_category":"resembling a purse"}]}