{"word":"Cinchonaceae","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アカネ科","english_definition":"The family of flowering plants in the order Gentianales that includes trees and shrubs, characterized by opposite leaves and interpetiolar stipules. Many species are economically important as sources of quinine and other alkaloids.","examples":[{"sentence":"Cinchonaceae is a family of flowering plants that includes the cinchona tree.","translation":"アカネ科は、キナノキを含む顕花植物の科です。"}],"collocations":["Cinchona (キナ属)","quinine (キニーネ)","Rubiaceae (アカネ科)"],"synonyms":["Rubiaceae (アカネ科)"],"antonyms":[]}],"etymology":{"value":"Named after the Countess of Chinchón, wife of the Viceroy of Peru, who was cured of malaria by cinchona bark in the 17th century. The suffix '-aceae' is used to denote a plant family.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪnkoʊˈneɪʃiˌaɪ/","syllables":"cin-cho-na-ce-ae"},"inflection":{"noun_plural":"Cinchonaceae"},"usage_notes":{"explanation":"Cinchonaceae is a botanical term referring to a specific family of flowering plants. It is primarily used in scientific and botanical contexts. The family is notable for containing the genus Cinchona, from which quinine, an important antimalarial drug, is derived.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cinchonaceae is a type of animal.","correct":"✓ Cinchonaceae is a family of plants.","note":"Cinchonaceae refers to a family of plants, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["Cinchona (キナ属)","quinine (キニーネ)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Cinchonaceae' is a technical term used in botany and related scientific fields. Understanding of this term requires knowledge of plant taxonomy and classification. It is not commonly used in general conversation or writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The Cinchonaceae family is known for its production of quinine.","translation":"アカネ科はキニーネの生産で知られています。","type":"general","meaning_category":"definition"},{"sentence":"Several species within the Cinchonaceae family are used in traditional medicine.","translation":"アカネ科のいくつかの種は伝統医学で使用されています。","type":"specific","meaning_category":"usage"}]}