{"word":"counter-penalty","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(スポーツ)相手の反則に対する相殺的なペナルティ、またはそれによって得られる利益。","english_definition":"A penalty awarded to a team or player in response to a penalty committed by the opposing team or player, effectively canceling out or offsetting the initial penalty.","examples":[{"sentence":"The team received a counter-penalty after the opposing player committed a foul during the play.","translation":"そのチームは、相手選手がプレー中にファウルを犯した後、カウンターペナルティを受けた。"},{"sentence":"The referee called a counter-penalty, negating the advantage the other team thought they had gained.","translation":"審判はカウンターペナルティを宣告し、相手チームが得たと思ったアドバンテージを無効にした。"}],"collocations":["receive a counter-penalty","call a counter-penalty","award a counter-penalty","offset a penalty with a counter-penalty"],"synonyms":["offsetting penalty","reciprocal penalty","balancing penalty"],"antonyms":["initial penalty"]},{"part_of_speech":"noun","definition":"(法律、経済)相手の行動に対する報復的な措置、またはそれによって生じる不利益。","english_definition":"A retaliatory measure or disadvantage imposed in response to an action taken by another party, often in legal or economic contexts.","examples":[{"sentence":"The country imposed counter-penalties on imported goods in response to unfair trade practices.","translation":"その国は、不公正な貿易慣行に対応して、輸入品にカウンターペナルティを課した。"},{"sentence":"The lawyer argued that the proposed sanctions were essentially counter-penalties and therefore illegal.","translation":"弁護士は、提案された制裁は本質的にカウンターペナルティであり、したがって違法であると主張した。"}],"collocations":["impose counter-penalties","apply counter-penalties","levy counter-penalties","face counter-penalties"],"synonyms":["retaliatory measure","reciprocal sanction","compensatory penalty"],"antonyms":["original sanction","initial measure"]}],"etymology":{"value":"The term 'counter-penalty' is formed by combining 'counter-' (meaning in opposition or response) with 'penalty' (a punishment or disadvantage). It suggests a penalty that is enacted as a reaction to another penalty or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkaʊntərˌpɛnəlti/","syllables":"coun-ter-pen-al-ty"},"inflection":{"noun_plural":"counter-penalties"},"usage_notes":{"explanation":"A 'counter-penalty' is used in situations where one action provokes a reactive penalty. In sports, it often neutralizes an initial infraction. In legal or economic contexts, it represents a retaliatory measure. The term implies a direct cause-and-effect relationship between the initial action and the subsequent penalty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The team got a penalty, so they got a counter.","correct":"✓ The team got a penalty, so the other team got a counter-penalty.","note":"'Counter' alone is insufficient; specify 'counter-penalty' to clarify the retaliatory nature of the penalty."},{"incorrect":"✗ He received a counter-penalty for good behavior.","correct":"✓ He received a reward for good behavior.","note":"Counter-penalties are responses to negative actions, not positive ones."}],"priority":"★★☆"},"related_words":{"derivatives":["counteract","countermeasure","counterattack","penalty","retaliation","sanction"],"phrases":["offsetting foul","reciprocal action","tit-for-tat","eye for an eye"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Specialized term used in specific contexts like sports and law.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Counter-penalty' is a specialized term primarily used in the context of sports and legal or economic retaliations. It describes a penalty or disadvantage that is imposed as a direct response to an action or penalty committed by another party. Understanding the term requires familiarity with the concept of reciprocal actions and retaliatory measures. It's less common in everyday conversation and more prevalent in professional or technical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The hockey team was relieved when the referee called a counter-penalty, nullifying their opponent's power play.","translation":"ホッケーチームは、審判がカウンターペナルティを宣告し、相手のパワープレーを無効にしたとき、安堵した。","type":"noun","meaning_category":"Sports"},{"sentence":"In response to the tariffs, the country imposed counter-penalties on agricultural products.","translation":"関税への対応として、その国は農産物にカウンターペナルティを課した。","type":"noun","meaning_category":"Economics"},{"sentence":"The lawyer argued that the new regulations were essentially counter-penalties designed to punish the company.","translation":"弁護士は、新しい規制は本質的に会社を罰するために設計されたカウンターペナルティであると主張した。","type":"noun","meaning_category":"Law"}]}