{"word":"orexin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オレキシン (別名: ヒポクレチン)","english_definition":"A neuropeptide that regulates arousal, wakefulness, and appetite.","examples":[{"sentence":"Orexin plays a crucial role in maintaining wakefulness.","translation":"オレキシンは覚醒状態を維持する上で重要な役割を果たします。"},{"sentence":"Dysfunction of the orexin system is associated with narcolepsy.","translation":"オレキシン系の機能不全はナルコレプシーと関連しています。"}],"collocations":["orexin neurons","orexin system","orexin deficiency","orexin receptor"],"synonyms":["hypocretin"],"antonyms":[]}],"etymology":{"value":"Derived from 'orexis' (Greek for appetite) + '-in' (a common suffix for proteins). It was independently discovered by two research groups and named differently; one group named it 'orexin' and the other 'hypocretin'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɒˈrɛksɪn/","syllables":"o-rex-in"},"inflection":{"noun_plural":"orexins"},"usage_notes":{"explanation":"Orexin, also known as hypocretin, is a neuropeptide produced in the hypothalamus. It is involved in regulating sleep-wake cycles, appetite, and arousal. Deficiency of orexin is linked to narcolepsy, a sleep disorder characterized by excessive daytime sleepiness and cataplexy. Research into orexin signaling pathways is ongoing to develop treatments for sleep disorders and obesity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Orexin is a type of vitamin.","correct":"✓ Orexin is a neuropeptide.","note":"Orexin is a neuropeptide, not a vitamin."},{"incorrect":"✗ Orexin increases sleep.","correct":"✓ Orexin promotes wakefulness.","note":"Orexin promotes wakefulness, not sleep."}],"priority":"★★☆"},"related_words":{"derivatives":["orexinergic (adjective: relating to or producing orexin)"],"related_terms":["hypothalamus","neuropeptide","narcolepsy","hypocretin receptor"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Orexin, also known as hypocretin, is a complex term primarily used in scientific and medical contexts. It refers to a neuropeptide produced in the hypothalamus that plays a crucial role in regulating wakefulness, arousal, and appetite. A deficiency in orexin is associated with narcolepsy. Due to its specialized usage, understanding orexin requires a background in biology or medicine."},"example_sentences":[{"sentence":"The researchers studied the effects of orexin on feeding behavior in mice.","translation":"研究者たちはマウスの摂食行動に対するオレキシンの影響を研究した。","type":"general","meaning_category":"general"},{"sentence":"Orexin receptor antagonists are being developed as potential treatments for insomnia.","translation":"オレキシン受容体拮抗薬は、不眠症の潜在的な治療薬として開発されている。","type":"medical","meaning_category":"medical"}]}