{"word":"overqualifying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)能力以上の仕事に就かせる、過剰な資格を与える","english_definition":"To provide someone with more qualifications or skills than are necessary for a particular job or position.","examples":[{"sentence":"The company was overqualifying its employees for the simple tasks they were assigned.","translation":"その会社は、従業員に割り当てられた単純な仕事に対して、過剰な資格を与えていた。"},{"sentence":"They were overqualifying him by sending him to expensive training programs that weren't relevant to his role.","translation":"彼らは彼の役割に関係のない高価な研修プログラムに彼を送り込むことで、彼に過剰な資格を与えていた。"}],"collocations":["overqualifying employees","overqualifying a candidate"],"synonyms":["over-skilling","upskilling"],"antonyms":["underqualifying"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(人が)能力以上の仕事に応募する、過剰な資格を持つ","english_definition":"To have more qualifications or skills than are necessary for a particular job or position.","examples":[{"sentence":"She was overqualifying for the entry-level position, but she needed a job quickly.","translation":"彼女はエントリーレベルのポジションには過剰な資格を持っていたが、すぐに仕事が必要だった。"},{"sentence":"Many graduates are overqualifying for the available jobs in the current market.","translation":"現在の市場では、多くの卒業生が利用可能な仕事に対して過剰な資格を持っている。"}],"collocations":["overqualifying for a job","overqualifying for a position"],"synonyms":["over-skilled","over-educated"],"antonyms":["underqualifying"]},{"part_of_speech":"noun","definition":"過剰な資格付与、能力以上の仕事への応募","english_definition":"The act of providing or possessing more qualifications or skills than are necessary for a particular job or position.","examples":[{"sentence":"Overqualifying can sometimes be a disadvantage when applying for lower-level jobs.","translation":"過剰な資格付与は、下位レベルの仕事に応募する際には不利になることがある。"},{"sentence":"The problem of overqualifying is becoming more prevalent in the current job market.","translation":"過剰な資格付与の問題は、現在の雇用市場でより一般的になっている。"}],"collocations":["the problem of overqualifying","the disadvantage of overqualifying"],"synonyms":["over-skilling","excessive qualification"],"antonyms":["underqualification"]}],"etymology":{"value":"Derived from \"over-\" (excessively) + \"qualify\" (to be or become eligible or fitted).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌoʊvərˈkwɒlɪfaɪɪŋ/","syllables":"o-ver-qual-i-fy-ing"},"inflection":{"verb_forms":{"present_simple":["overqualify","overqualifies"],"past_simple":"overqualified","past_participle":"overqualified","present_participle":"overqualifying"},"noun_plural":"N/A"},"usage_notes":{"explanation":"\"Overqualifying\" refers to the situation where someone possesses more skills, education, or experience than is required for a particular job. This can be a disadvantage in job applications, as employers may believe the candidate will become bored, seek other opportunities quickly, or demand a higher salary.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is overqualified of the job.","correct":"✓ He is overqualified for the job.","note":"Use 'for' to indicate the position or job being overqualified for."},{"incorrect":"✗ Overqualifying is a good thing always.","correct":"✓ Overqualifying can sometimes be a disadvantage.","note":"Overqualifying is not always beneficial; it can be a disadvantage in certain situations."}],"priority":"☆☆☆"},"related_words":{"derivatives":["overqualified (adjective)","qualification (noun)","qualify (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"overqualifying\" is used in the context of job applications and employment. It describes the situation where a person has more skills, education, or experience than a job requires. This can be a disadvantage because employers may think the person will be unhappy or leave the job quickly. It's a term often used in discussions about the job market and career advice."},"example_sentences":[{"sentence":"She was **overqualifying** for the administrative assistant position, having a master's degree and extensive management experience.","translation":"彼女は修士号と豊富な管理経験を持っており、事務アシスタントのポジションには過剰な資格を持っていた。","type":"verb","meaning_category":"過剰な資格を持つ"},{"sentence":"**Overqualifying** employees can lead to higher training costs and lower job satisfaction if the work is not challenging enough.","translation":"従業員に過剰な資格を与えると、仕事が十分にやりがいがない場合、トレーニングコストが増加し、仕事の満足度が低下する可能性がある。","type":"verb","meaning_category":"過剰な資格を与える"},{"sentence":"The **overqualifying** of graduates is a growing concern for universities and employers alike.","translation":"卒業生の過剰な資格付与は、大学と雇用者の両方にとってますます懸念事項となっている。","type":"noun","meaning_category":"過剰な資格付与"}]}