{"word":"Registrary","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国の大学の)事務長、記録係","english_definition":"An administrative officer in a British university, responsible for keeping records.","examples":[{"sentence":"The Registrary of Cambridge University is a senior administrative position.","translation":"ケンブリッジ大学の事務長は、上級管理職です。"}],"collocations":[],"synonyms":["registrar","administrator","secretary"],"antonyms":[]}],"etymology":{"value":"From registrar + -y.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌrɛdʒɪˈstrɑːri/","syllables":"Re-gis-tra-ry"},"inflection":{"noun_plural":"Registraries"},"usage_notes":{"explanation":"The term 'Registrary' is primarily used in British universities, particularly Oxbridge (Oxford and Cambridge). It refers to a senior administrative officer responsible for various administrative and record-keeping duties. It is not a commonly used term outside of this specific context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the registrary for the hospital.","correct":"✓ He is the registrar for the hospital.","note":"'Registrary' is specifically for universities in the UK. For hospitals or other institutions, 'registrar' is the correct term."}],"priority":"★★☆"},"related_words":{"derivatives":["registrar","registration","registry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Registrary' is a specialized term primarily used within the context of British universities, especially Oxford and Cambridge. It refers to a high-ranking administrative officer responsible for record-keeping and other administrative tasks. Due to its limited usage in specific academic environments, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The Registrary is responsible for maintaining the university's official records.","translation":"事務長は、大学の公式記録を維持する責任があります。","type":"noun","meaning_category":"事務長"},{"sentence":"The Registrary's office handles student admissions and enrollment.","translation":"事務長のオフィスは、学生の入学と登録を扱います。","type":"noun","meaning_category":"事務長"}]}