{"word":"Quakerish","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"クエーカー教徒のような、クエーカー教徒風の","english_definition":"Resembling or characteristic of Quakers or their practices.","examples":[{"sentence":"The house had a Quakerish simplicity.","translation":"その家はクエーカー教徒のような質素さがあった。"},{"sentence":"He adopted a Quakerish manner of speaking.","translation":"彼はクエーカー教徒のような話し方をした。"}],"collocations":["Quakerish simplicity","Quakerish dress","Quakerish manner"],"synonyms":["plain","simple","austere","unadorned"],"antonyms":["ornate","extravagant","ostentatious"]},{"part_of_speech":"adjective","definition":"クエーカー教徒の原則に近い、クエーカー教徒の主義を反映した","english_definition":"In accordance with Quaker principles or beliefs.","examples":[{"sentence":"His views on pacifism were Quakerish.","translation":"彼の平和主義に関する見解はクエーカー教徒の主義に近かった。"},{"sentence":"The organization promoted Quakerish values of equality and social justice.","translation":"その組織は平等と社会正義というクエーカー教徒の価値観を推進した。"}],"collocations":["Quakerish beliefs","Quakerish values","Quakerish principles"],"synonyms":["pacifistic","egalitarian","humanitarian"],"antonyms":["militaristic","hierarchical","inequitable"]}],"etymology":{"value":"From 'Quaker' + '-ish'. 'Quaker' refers to a member of the Religious Society of Friends, a Christian movement founded in England in the 17th century. The suffix '-ish' indicates resemblance or approximation.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkweɪkərɪʃ/","syllables":"kwa-ker-ish"},"inflection":{"notes":"Since it is an adjective, it can form comparative and superlative degrees, although rarely used: more Quakerish, most Quakerish."},"usage_notes":{"explanation":"'Quakerish' is used to describe something that resembles or is characteristic of Quakers, either in appearance, behavior, or principles. It can refer to the plain and simple lifestyle often associated with Quakers, or to their beliefs in peace, equality, and social justice. It's often used to describe something that is not strictly Quaker, but has qualities reminiscent of Quakerism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Quakerish.","correct":"✓ He is Quakerish. / ✓ He has a Quakerish demeanor.","note":"'Quakerish' is an adjective, so it needs to modify a noun or be used with a linking verb. You can't say \"He is a Quakerish\" because it's not a noun."},{"incorrect":"✗ The Quakerish religion.","correct":"✓ The Quaker religion. / ✓ The Quakerish principles.","note":"Use 'Quaker' as an adjective to describe the religion itself. Use 'Quakerish' to describe something that resembles or is characteristic of Quaker principles."}],"priority":"★★☆"},"related_words":{"derivatives":["Quaker (noun, adjective)","Quakerism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Quakerish' is a relatively uncommon word used to describe something that resembles or is characteristic of Quakers. It's often used in literary or historical contexts to describe a style, manner, or set of beliefs that are similar to those of Quakers, but not necessarily strictly Quaker. Understanding the word requires familiarity with the history and principles of the Quaker movement."},"example_sentences":[{"sentence":"The room was decorated in a simple, almost Quakerish style.","translation":"その部屋は質素で、ほとんどクエーカー教徒のようなスタイルで装飾されていた。","type":"adjective","meaning_category":"resembling Quakers"},{"sentence":"His commitment to nonviolence was deeply Quakerish.","translation":"彼の非暴力へのコミットメントは深くクエーカー教徒の主義を反映していた。","type":"adjective","meaning_category":"Quaker principles"},{"sentence":"She admired his Quakerish honesty and integrity.","translation":"彼女は彼のクエーカー教徒のような正直さと誠実さを称賛した。","type":"adjective","meaning_category":"resembling Quakers"}]}