{"word":"gynomonoecious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)雌花と両性花を同一株につける","english_definition":"(of a plant species) having female and hermaphrodite flowers on the same plant.","examples":[{"sentence":"Gynomonoecious plants can be found in various families, including some Asteraceae and Rosaceae.","translation":"雌雄同株異花同株の植物は、キク科やバラ科など、さまざまな科に見られます。"}],"collocations":["gynomonoecious species","gynomonoecious plant"],"synonyms":[],"antonyms":["dioecious","monoecious"]}],"etymology":{"value":"Derived from the Greek words 'gyno-' (female), 'mono-' (single), and 'oecious' (house), referring to the presence of female and hermaphrodite flowers on the same 'house' or plant.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɡaɪnəmoʊˈniːʃəs/","syllables":"gy-no-mo-noe-cious"},"inflection":{},"usage_notes":{"explanation":"Gynomonoecy is a relatively rare sexual system in plants, where individual plants produce both female and hermaphrodite flowers. This contrasts with monoecy (separate male and female flowers on the same plant) and dioecy (separate male and female plants).","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["gynomonoecy (noun)"],"related_terms":["monoecious","dioecious","hermaphrodite","plant sexuality"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'gynomonoecious' is a technical term used in botany to describe a specific type of plant sexual system. It refers to plants that have both female and hermaphrodite (bisexual) flowers on the same individual. This is a relatively uncommon condition compared to other sexual systems like monoecy (separate male and female flowers on the same plant) or dioecy (separate male and female plants). Understanding this term requires a background in plant biology and sexual reproduction.","priority":"★★★"},"example_sentences":[{"sentence":"Cucumis melo, the melon, exhibits gynomonoecious cultivars.","translation":"メロン（Cucumis melo）は、雌雄同株異花同株の栽培品種を示します。","type":"example","meaning_category":"botany"},{"sentence":"The proportion of female flowers in a gynomonoecious population can influence the overall reproductive success.","translation":"雌雄同株異花同株の個体群における雌花の割合は、全体的な繁殖の成功に影響を与える可能性があります。","type":"example","meaning_category":"botany"}]}