{"word":"exradius","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(幾何学)傍接円の半径","english_definition":"The radius of an excircle of a triangle. An excircle is a circle lying outside the triangle, tangent to one of its sides and tangent to the extensions of the other two sides.","examples":[{"sentence":"The exradius opposite vertex A is denoted as ra.","translation":"頂点Aの対辺に対する傍接円の半径はraと表記される。"},{"sentence":"The exradius can be calculated using the formula involving the area of the triangle and the semiperimeter.","translation":"傍接円の半径は、三角形の面積と準周長を含む公式を用いて計算できる。"}],"collocations":["exradius of a triangle","calculate the exradius","exradius opposite to a vertex"],"synonyms":["excircle radius"],"antonyms":[]}],"etymology":{"value":"'ex-' (outside) + 'radius' (from Latin radius 'ray, spoke of a wheel')","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛksˌreɪdiəs/","syllables":"ex-ra-di-us"},"inflection":{"noun_plural":"exradii or exradiuses"},"usage_notes":{"explanation":"The exradius is a geometric property associated with triangles. Each triangle has three excircles, each tangent to one side and the extensions of the other two sides. The exradius is the radius of one of these excircles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exradius is inside the triangle.","correct":"✓ The exradius is associated with a circle outside the triangle.","note":"The excircle, and therefore the exradius, are always outside the triangle."}],"priority":"★★☆"},"related_words":{"derivatives":["excircle","incircle","inradius","triangle","tangent"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'exradius' is a specialized term in geometry, specifically related to triangles and circles. It refers to the radius of a circle that lies outside the triangle, tangent to one of its sides and the extensions of the other two sides. Understanding this term requires a solid foundation in geometry concepts. "},"example_sentences":[{"sentence":"The formula to calculate the exradius involves the area of the triangle and the semiperimeter.","translation":"傍接円の半径を計算する公式は、三角形の面積と準周長を含む。","type":"noun","meaning_category":"geometry"},{"sentence":"There are three exradii for every triangle, each corresponding to a different side.","translation":"すべての三角形には3つの傍接円の半径があり、それぞれ異なる辺に対応している。","type":"noun","meaning_category":"geometry"}]}