{"word":"cartulary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(中世の)写本集、古文書集、記録簿 (特に修道院や教会の財産、特権、権利に関するもの)","english_definition":"A collection of charters, other legal documents, and records, especially relating to the foundation, privileges, and property of a monastery, church, or corporation.","examples":[{"sentence":"The abbey's cartulary provided valuable information about its land holdings.","translation":"その修道院の古文書集は、その土地所有に関する貴重な情報を提供した。"},{"sentence":"Researchers consulted the cartulary to trace the history of the estate.","translation":"研究者たちは、その荘園の歴史をたどるために古文書集を調べた。"}],"collocations":["abbey cartulary (修道院の古文書集)","manorial cartulary (荘園の古文書集)","ecclesiastical cartulary (教会の古文書集)"],"synonyms":["chartulary","register","record book","archive"],"antonyms":[]}],"etymology":{"value":"Derived from the Medieval Latin 'cartularium', from Latin 'charta' (paper, document).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrtjʊˌlɛri/","syllables":"car-tu-lar-y"},"inflection":{"noun_plural":"cartularies"},"usage_notes":{"explanation":"A cartulary is a valuable historical source, providing insights into the social, economic, and legal practices of the medieval period. They are often richly decorated and carefully preserved. The term is primarily used in historical and archival contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a cartulary about his travels.","correct":"✓ He wrote a travelogue about his travels.","note":"A cartulary is a collection of documents, not a personal account. A travelogue would be a more appropriate term for a written account of travels."}],"priority":"★☆☆"},"related_words":{"derivatives":["charter (名詞: 憲章、特許状、許可証)","chart (名詞: 図表、海図)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cartulary' is a specialized term primarily used in historical and archival contexts. It refers to a collection of legal documents and records, often pertaining to the property and rights of institutions like monasteries or churches during the medieval period. Understanding this word requires familiarity with historical terminology and practices. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The cartulary contained copies of royal grants and papal bulls.","translation":"その古文書集には、王室からの寄進状や教皇の勅書が写されていた。","type":"noun","meaning_category":"文書集"},{"sentence":"Scholars are studying the cartulary to understand medieval land ownership.","translation":"学者たちは、中世の土地所有を理解するために古文書集を研究している。","type":"noun","meaning_category":"文書集"}]}