{"word":"campus-wide","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"キャンパス全体の、大学構内全体の","english_definition":"Extending to or involving the entire campus of a university or college.","examples":[{"sentence":"The university announced a campus-wide initiative to reduce energy consumption.","translation":"大学はエネルギー消費を削減するためのキャンパス全体の取り組みを発表した。"},{"sentence":"A campus-wide email was sent to all students and faculty.","translation":"全学生と教職員に大学構内全体のメールが送信された。"},{"sentence":"The new wireless network provides campus-wide coverage.","translation":"新しいワイヤレスネットワークはキャンパス全体をカバーする。"}],"collocations":["campus-wide announcement","campus-wide survey","campus-wide policy","campus-wide access","campus-wide event","campus-wide network"],"synonyms":["university-wide","college-wide","institution-wide"],"antonyms":["departmental","local","limited"],"notes":"Often used to describe policies, events, or services that affect everyone on a university or college campus."}],"etymology":{"value":"Combination of 'campus' (referring to the grounds of a university or college) and 'wide' (extending over a large area).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæmpəsˌwaɪd/","syllables":"cam-pus-wide"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Campus-wide' is used to describe something that affects or involves the entire area and population of a university or college campus. It is often used in the context of announcements, policies, events, or services that are relevant to all students, faculty, and staff.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The campus wide event was a success.","correct":"✓ The campus-wide event was a success.","note":"The correct form is 'campus-wide' with a hyphen. It functions as a compound adjective modifying 'event'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["campus","university","college","institution","nationwide","statewide","citywide"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but common in academic and university contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'campus-wide' is a compound adjective used to describe something that applies to or affects the entire campus of a university or college. It is commonly used in academic and administrative contexts to refer to policies, initiatives, events, or services that are intended for all members of the campus community. The word is straightforward in meaning but its usage is specific to higher education environments."},"example_sentences":[{"sentence":"The university implemented a campus-wide ban on smoking.","translation":"大学はキャンパス全体での喫煙禁止を実施した。","type":"example","meaning_category":"policy"},{"sentence":"The survey aims to gather feedback from the campus-wide community.","translation":"この調査は、キャンパス全体のコミュニティからのフィードバックを収集することを目的としている。","type":"example","meaning_category":"survey"},{"sentence":"The new security system offers campus-wide surveillance.","translation":"新しいセキュリティシステムはキャンパス全体の監視を提供する。","type":"example","meaning_category":"system"}]}