{"word":"torrefication","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"乾留、焙煎、炭化","english_definition":"A thermochemical treatment process applied to biomass to produce a solid fuel with improved fuel properties.","examples":[{"sentence":"Torrefication improves the grindability and energy density of biomass.","translation":"乾留はバイオマスの粉砕性とエネルギー密度を向上させます。"},{"sentence":"The torrefaction process typically occurs at temperatures between 200 and 300 °C.","translation":"乾留プロセスは通常、200〜300℃の温度で行われます。"}],"collocations":["biomass torrefication","torrefaction process","torrefaction plant"],"synonyms":["roasting","pyrolysis","carbonization"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'torrefacere', meaning 'to roast thoroughly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒrɪfɪˈkeɪʃən/","syllables":"tor-re-fi-ca-tion"},"inflection":{"noun_plural":"torrefications"},"usage_notes":{"explanation":"Torrefication is a thermal process used to convert biomass into a more uniform and energy-dense fuel. It involves heating biomass in the absence of oxygen at temperatures typically between 200 and 300 °C. This process removes moisture and volatile compounds, resulting in a solid product that is easier to grind, transport, and use as a fuel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Torrefaction is the same as combustion.","correct":"✓ Torrefaction is a pretreatment process before combustion.","note":"Torrefaction is not the same as combustion. It is a thermochemical pretreatment process that improves the fuel properties of biomass before combustion. Combustion is the burning of the fuel to release energy."},{"incorrect":"✗ Torrefaction requires oxygen.","correct":"✓ Torrefaction occurs in the absence of oxygen.","note":"Torrefaction is performed in the absence of oxygen to prevent combustion. This is a key difference between torrefaction and combustion."}],"priority":"★★☆"},"related_words":{"derivatives":["torrefy (verb)","torrefied (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Torrefication is a specialized term used in the context of biomass processing and renewable energy. It refers to a thermochemical process that enhances the fuel properties of biomass by heating it in the absence of oxygen. Understanding this term requires familiarity with concepts in chemical engineering and renewable energy technologies."},"example_sentences":[{"sentence":"The **torrefication** of wood pellets increases their calorific value.","translation":"木質ペレットの乾留は、その発熱量を増加させます。","type":"noun","meaning_category":"乾留"},{"sentence":"**Torrefication** is a promising technology for upgrading biomass resources.","translation":"乾留は、バイオマス資源を高度化するための有望な技術です。","type":"noun","meaning_category":"乾留"}]}