{"word":"Senicide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"老親殺し、高齢者殺害","english_definition":"The killing of an elderly person, typically by a family member.","examples":[{"sentence":"Senicide is a rare but documented phenomenon in some cultures.","translation":"老親殺しは稀だが、一部の文化で記録されている現象である。"},{"sentence":"The reasons behind senicide can be complex, often involving economic hardship.","translation":"老親殺しの背景にある理由は複雑であり、しばしば経済的困窮が関わっている。"}],"collocations":["commit senicide","practice senicide","instances of senicide"],"synonyms":["geronticide","eldercide"],"antonyms":[]}],"etymology":{"value":"From Latin *senex* (old man) + *-cide* (killing).","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɛnɪsaɪd","syllables":"Sen-i-cide"},"inflection":{"noun_plural":"senicides"},"usage_notes":{"explanation":"Senicide refers specifically to the killing of elderly people, often by family members. It is a term used in discussions of ethics, sociology, and history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Senicide is the same as euthanasia.","correct":"✓ Senicide is different from euthanasia, as it is often non-consensual.","note":"Senicide is typically non-consensual, whereas euthanasia involves the consent of the person being killed."}],"priority":"★☆☆"},"related_words":{"derivatives":["senicidal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Senicide' is a specialized term referring to the killing of elderly individuals, usually by family members. It is not commonly used and appears primarily in academic or specialized contexts when discussing ethical or historical issues related to elder care and familial violence. Understanding this term requires a strong grasp of Latin roots and a familiarity with complex social issues.","priority":"★☆☆"},"example_sentences":[{"sentence":"Historically, senicide has been linked to cultures facing extreme resource scarcity.","translation":"歴史的に、老親殺しは極度の資源不足に直面している文化と関連付けられてきた。","type":"general","meaning_category":"definition"},{"sentence":"The anthropologist studied instances of senicide in isolated communities.","translation":"その人類学者は、孤立したコミュニティにおける老親殺しの事例を研究した。","type":"general","meaning_category":"definition"}]}