{"word":"geoponics","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"土壌農法、陸上栽培","english_definition":"the art or science of cultivating plants in soil.","examples":[{"sentence":"Geoponics is the traditional method of farming, relying on soil for plant growth.","translation":"土壌農法は、植物の生育に土壌を利用する伝統的な農法です。"},{"sentence":"While hydroponics gains popularity, geoponics remains essential for many crops.","translation":"水耕栽培の人気が高まる一方で、土壌農法は多くの作物にとって不可欠なままです。"}],"collocations":["traditional geoponics","modern geoponics","geoponics farming","geoponics techniques"],"synonyms":["soil-based agriculture","land cultivation","earth farming"],"antonyms":["hydroponics","aeroponics"]}],"etymology":{"value":"Derived from the Greek words 'geo' (earth) and 'ponos' (labor), reflecting the labor involved in cultivating the earth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːoʊˈpɒnɪks/","syllables":"ge-o-pon-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Geoponics refers specifically to growing plants in soil, distinguishing it from soilless methods like hydroponics (growing in water) and aeroponics (growing in air). It encompasses traditional farming practices and modern soil-based agriculture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Geoponics is when you grow plants without soil.","correct":"✓ Geoponics is when you grow plants in soil.","note":"Geoponics always involves soil. Soilless cultivation is hydroponics or aeroponics."}],"priority":"★★☆"},"related_words":{"derivatives":["geoponic (adjective)"],"related_terms":["agriculture","horticulture","soil science","agronomy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Geoponics' is a specialized term referring to the science and art of growing plants in soil. It's often used in contrast to soilless growing methods like hydroponics and aeroponics. Understanding this term requires familiarity with agricultural concepts and terminology. It's not a commonly used word in everyday conversation, but it is relevant in discussions about farming, sustainable agriculture, and plant science."},"example_sentences":[{"sentence":"The success of geoponics depends on the quality of the soil.","translation":"土壌農法の成功は土壌の質にかかっています。","type":"noun","meaning_category":"土壌農法"},{"sentence":"Geoponics techniques have been refined over centuries.","translation":"土壌農法の技術は何世紀にもわたって改良されてきました。","type":"noun","meaning_category":"土壌農法"},{"sentence":"The farmer practiced geoponics to grow a variety of vegetables.","translation":"その農家は、さまざまな野菜を栽培するために土壌農法を実践しました。","type":"noun","meaning_category":"土壌農法"}]}