{"word":"yard-of-ale","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヤードグラスに入ったエールビール","english_definition":"a tall, slender glass shaped like a yard (approx. 3 feet) used for drinking ale, and the amount of ale it contains.","examples":[{"sentence":"He attempted to drink a yard-of-ale in one go.","translation":"彼はヤードグラスに入ったエールビールを一気に飲もうと試みた。"},{"sentence":"The pub had a yard-of-ale drinking competition.","translation":"そのパブではヤードグラスビール早飲み競争が行われた。"}],"collocations":["drink a yard-of-ale","yard-of-ale race","yard-of-ale competition"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"The term combines \"yard,\" referring to the unit of measurement (3 feet), with \"ale,\" a type of beer. The origin of the glass itself is debated, with some claiming it dates back to 17th-century England, where it was used for novelty or initiation rituals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjɑːrd əv ˈeɪl/","syllables":"yard-of-ale"},"inflection":{"noun_plural":"yards-of-ale"},"usage_notes":{"explanation":"A yard-of-ale is both the name of the glass and the drink served in it. It's often associated with drinking challenges and pub games. The glass is notoriously difficult to drink from quickly without spilling due to the air pressure dynamics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I drank a yard of beer.","correct":"✓ I drank a yard-of-ale.","note":"While \"beer\" is generally acceptable, \"ale\" is the traditional and more specific term. Using \"yard-of-beer\" might be understood but is less common."}],"priority":"★★☆"},"related_words":{"derivatives":["none"],"phrasal_verbs":["none"],"related_terms":["ale","beer","glassware","pub games"]},"level_frequency":{"CEFR":"Not applicable (cultural item)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"yard-of-ale\" refers to a specific type of drinking glass and the associated tradition of drinking ale from it. This is a cultural reference primarily found in the UK and among those familiar with British pub culture. Understanding requires knowledge of both the physical object (the tall glass) and the cultural practice (the drinking challenge)."},"example_sentences":[{"sentence":"The winner of the yard-of-ale contest received a free meal.","translation":"ヤードグラスビール早飲み大会の優勝者は無料の食事を獲得した。","type":"noun","meaning_category":"drinking competition"},{"sentence":"He carefully poured the ale into the yard-of-ale, trying not to spill any.","translation":"彼はこぼさないように注意しながら、エールビールをヤードグラスに注いだ。","type":"noun","meaning_category":"pouring beer"}]}