{"word":"canonically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"正典的に、標準的に、規範的に","english_definition":"In a way that is officially authorized or recognized; according to established rules or principles; in a standard or authoritative manner.","examples":[{"sentence":"The data is stored canonically to ensure consistency.","translation":"データは一貫性を保つために、標準的な方法で保存されます。"},{"sentence":"This version is canonically accepted as the correct interpretation.","translation":"このバージョンは、正しい解釈として正典的に受け入れられています。"},{"sentence":"The problem is canonically reduced to a simpler form.","translation":"その問題は、標準的な方法でより単純な形に帰着されます。"},{"sentence":"Canonically, the hero must overcome a great challenge.","translation":"規範的に言えば、主人公は大きな試練を乗り越えなければなりません。"}],"collocations":["canonically correct","canonically defined","canonically accepted","canonically stored","canonically equivalent","canonically represented","canonically true"],"synonyms":["authoritatively","officially","conventionally","classically","traditionally","formally","legitimately","standardly"],"antonyms":["unofficially","non-standardly","heterodoxly","unconventionally","irregularly"]}],"etymology":{"value":"From 'canonical,' meaning conforming to canon law or established principles, plus the adverbial suffix '-ly.' The term 'canonical' derives from the Greek 'kanon,' meaning a rule or standard.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈnɒnɪkli/","syllables":"ca-non-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Canonically' implies adherence to a recognized and authoritative standard or set of rules. It's often used in technical, academic, or religious contexts to indicate that something is done or understood according to established principles. The term suggests a level of official acceptance or widespread agreement on the correctness or appropriateness of a particular method, interpretation, or representation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted canonically, ignoring the specific needs of the situation.","correct":"✓ He acted rigidly, ignoring the specific needs of the situation.","note":"'Canonically' implies adherence to a standard, not necessarily rigidity. If the action was inappropriately rigid, use 'rigidly' or 'inflexibly' instead."},{"incorrect":"✗ The artist painted the scene canonically, using bright colors and bold strokes.","correct":"✓ The artist painted the scene traditionally, using bright colors and bold strokes.","note":"If the painting style is merely traditional, use 'traditionally.' 'Canonically' suggests adherence to a specific, authoritative standard, not just a general tradition."}],"priority":"★★☆"},"related_words":{"derivatives":["canonical (adjective)","canon (noun)","canonize (verb)"],"phrases":["canonical form","canonical representation","canonical equation","canonical example","canonical text","canonical source"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'canonically' is used to describe something that is done or understood according to established rules, principles, or standards. It suggests that there is a recognized and authoritative way of doing something. This word is more common in academic, technical, or religious contexts where adherence to established norms is important. It implies a level of official acceptance or widespread agreement on the correctness or appropriateness of a particular method or interpretation.","priority":"★★☆"},"example_sentences":[{"sentence":"The database schema is designed to store information canonically.","translation":"データベーススキーマは、情報を標準的な方法で保存するように設計されています。","type":"general","meaning_category":"standardly"},{"sentence":"This theorem is canonically equivalent to the original formulation.","translation":"この定理は、元の定式化と正典的に同等です。","type":"technical","meaning_category":"authoritatively"},{"sentence":"The text is canonically accepted as part of the literary canon.","translation":"そのテキストは、文学の正典の一部として規範的に受け入れられています。","type":"academic","meaning_category":"officially"},{"sentence":"The problem can be canonically transformed into a simpler form.","translation":"その問題は、標準的な方法でより単純な形に変換できます。","type":"technical","meaning_category":"standardly"}]}