{"word":"pseudoarchaically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"擬古的に、古風を装って","english_definition":"In a manner that imitates or pretends to be archaic; using language or styles that are deliberately old-fashioned.","examples":[{"sentence":"The novel was written pseudoarchaically, with long, convoluted sentences meant to evoke a bygone era.","translation":"その小説は擬古的に書かれており、過ぎ去った時代を彷彿とさせる長くて入り組んだ文章が使われていた。"},{"sentence":"He spoke pseudoarchaically, peppering his speech with 'thee' and 'thou' to sound more learned.","translation":"彼はより学識があるように見せるために、スピーチに「thee」や「thou」を散りばめ、擬古的に話した。"}],"collocations":["write pseudoarchaically","speak pseudoarchaically","use language pseudoarchaically"],"synonyms":["archaistically","in an old-fashioned manner","in a deliberately archaic style"],"antonyms":["modernly","in a contemporary style","using current language"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or imitation) with \"archaically\" (in an archaic or old-fashioned manner).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːdoʊ.ɑːrˈkeɪɪkli","syllables":"pseu-do-ar-kai-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Pseudoarchaically\" describes a deliberate attempt to imitate archaic language or styles, often for effect or to create a certain atmosphere. It implies that the archaism is not genuine but rather a conscious choice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The author used archaicly language.","correct":"✓ The author used language pseudoarchaically.","note":"\"Archaicly\" is not a standard word. The correct form to modify a verb is \"pseudoarchaically.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudoarchaic (adjective)","archaically (adverb)","archaism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudoarchaically\" is a complex adverb used to describe something done in a way that imitates or pretends to be old-fashioned or archaic. It suggests a deliberate effort to use language or styles from a past era, often for stylistic effect. This word is not commonly used and requires a good understanding of both \"pseudo-\" (false, imitation) and \"archaic\" (old-fashioned)."},"example_sentences":[{"sentence":"The poet wrote pseudoarchaically, employing obsolete words and syntax to create a sense of antiquity.","translation":"その詩人は擬古的に書き、時代錯誤の単語と構文を用いて、古代の感覚を作り出した。","type":"general","meaning_category":"imitation of archaic style"},{"sentence":"The play was staged pseudoarchaically, with costumes and sets designed to mimic the Elizabethan era, though not entirely accurately.","translation":"その劇は擬古的に演出され、衣装とセットはエリザベス朝時代を模倣するようにデザインされていたが、完全には正確ではなかった。","type":"general","meaning_category":"imitation of archaic style"}]}