{"word":"Underteller","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who tells stories about the underworld or the dead; a narrator of tales from beyond.","english_definition":"A person who tells stories about the underworld or the dead; a narrator of tales from beyond.","examples":[{"sentence":"The villagers gathered around the fire to listen to the underteller's chilling stories.","translation":"村人たちは、アンダーテラーの身の毛もよだつ話を聞くために、火の周りに集まった。"},{"sentence":"In some cultures, the underteller held a sacred role, bridging the gap between the living and the dead.","translation":"いくつかの文化では、アンダーテラーは神聖な役割を担い、生者と死者の間の隔たりを埋めていた。"}],"collocations":["listen to the underteller","stories of the underteller","the role of the underteller"],"synonyms":["storyteller","narrator","raconteur","bard"],"antonyms":[]}],"etymology":{"value":"A compound word formed from 'under' (referring to the underworld) and 'teller' (one who tells stories).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈtɛlər/","syllables":"un-der-tel-ler"},"inflection":{"noun_plural":"undertellers"},"usage_notes":{"explanation":"The term 'underteller' is quite rare and not widely recognized. It is a descriptive term that combines the concept of the underworld or the dead with the act of storytelling. Its usage is primarily limited to fantasy literature, folklore studies, or creative writing where such a specific role is needed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underteller was under the table.","correct":"✓ The underteller told tales of the underworld.","note":"Avoid confusing 'underteller' (storyteller of the underworld) with literal interpretations of 'under' and 'teller' as separate words."}],"priority":"★☆☆"},"related_words":{"derivatives":["undertale (related to stories of the underworld, but more commonly associated with the video game of the same name)","teller (general term for a storyteller)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'underteller' is a niche term primarily found in literary or fantasy contexts. Understanding requires familiarity with the concept of the underworld and the role of storytellers in various cultures. Due to its rarity, it is not part of standard English vocabulary."},"example_sentences":[{"sentence":"The underteller's voice echoed with the sorrow of lost souls.","translation":"アンダーテラーの声は、失われた魂の悲しみとともに響き渡った。","type":"noun","meaning_category":"storyteller of the underworld"},{"sentence":"Many feared the underteller, believing their stories could summon spirits.","translation":"多くの人々は、アンダーテラーの話が霊を呼び出すと信じて、彼らを恐れた。","type":"noun","meaning_category":"storyteller of the underworld"}]}