{"word":"patriarchies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"父権社会、家父長制","english_definition":"plural form of patriarchy: a system of society or government in which the father or eldest male is head of the family and descent is reckoned through the male line. More broadly, a society in which men hold the power and women are largely excluded from it.","examples":[{"sentence":"Many ancient societies were organized as patriarchies.","translation":"多くの古代社会は父権社会として組織されていました。"},{"sentence":"She studies the role of women in different patriarchies.","translation":"彼女は異なる父権社会における女性の役割を研究しています。"},{"sentence":"The book explores the historical roots of patriarchies.","translation":"その本は父権社会の歴史的ルーツを探求しています。"}],"collocations":["historical patriarchies (歴史的な父権社会)","modern patriarchies (現代の父権社会)","challenging patriarchies (父権社会に挑戦する)","dismantling patriarchies (父権社会を解体する)","the effects of patriarchies (父権社会の影響)"],"synonyms":["male dominance","male supremacy","sexism","androcracy"],"antonyms":["matriarchies","egalitarianism","feminism"]}],"etymology":{"value":"Derived from 'patriarchy,' which comes from the Greek 'patriarkhia,' meaning 'rule of the father.' 'Patri' means 'father' and 'arkhia' means 'rule' or 'governance.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpeɪtriˈɑːrkiːz/","syllables":"pay-tree-ar-keez"},"inflection":{"noun_plural":"patriarchies"},"usage_notes":{"explanation":"'Patriarchies' is the plural form of 'patriarchy,' referring to multiple instances or examples of societies or systems characterized by male dominance. It is often used in academic or sociological contexts when discussing different forms or manifestations of patriarchal structures across various cultures and time periods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patriarchy are oppressive.","correct":"✓ Patriarchies are oppressive.","note":"When referring to multiple patriarchal systems, use the plural form 'patriarchies' with a plural verb. 'The patriarchy' (singular) refers to the system in general, not specific instances."},{"incorrect":"✗ He is a product of patriarchies.","correct":"✓ He is a product of patriarchy.","note":"'Patriarchy' (singular) is used to describe the general system or concept, while 'patriarchies' (plural) refers to specific examples or instances of patriarchal societies."}],"priority":"★★☆"},"related_words":{"derivatives":["patriarchy","patriarchal","patriarch","patriarchalism"],"phrases":["gender inequality","male privilege","social hierarchy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and sociological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patriarchies' is a term primarily used in academic and sociological discussions to refer to multiple instances of societies or systems characterized by male dominance. It is important to understand that it is the plural form of 'patriarchy,' which describes the general system. The term is often used when comparing or contrasting different patriarchal structures across cultures and time periods. A good understanding of social and political concepts is necessary to use and interpret this word correctly."},"example_sentences":[{"sentence":"Comparative studies examine the differences between various historical patriarchies.","translation":"比較研究は、さまざまな歴史的な父権社会の違いを調べています。","type":"general"},{"sentence":"The rise of agriculture led to the development of many agrarian patriarchies.","translation":"農業の台頭は、多くの農業父権社会の発展につながりました。","type":"historical"},{"sentence":"Feminist scholars analyze the ways in which patriarchies perpetuate gender inequality.","translation":"フェミニストの研究者は、父権社会がどのようにジェンダー不平等を永続させるかを分析しています。","type":"sociological"},{"sentence":"Indigenous societies exhibit diverse forms of patriarchies, each with unique cultural characteristics.","translation":"先住民社会は、それぞれ独自の文化的特徴を持つ多様な形態の父権社会を示しています。","type":"cultural"},{"sentence":"The legacy of ancient patriarchies continues to influence social structures today.","translation":"古代の父権社会の遺産は、今日でも社会構造に影響を与え続けています。","type":"historical impact"}]}