{"word":"anti-lactogenic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(of a substance or treatment) tending to suppress or reduce milk production (lactation).","english_definition":"Tending to inhibit or reduce milk production.","examples":[{"sentence":"Certain herbs are known to have anti-lactogenic properties and are sometimes used to help wean a baby.","translation":"特定のハーブは抗乳作用があることが知られており、赤ちゃんを離乳させるのに役立つことがあります。"},{"sentence":"The medication has an anti-lactogenic effect, so it's not recommended for breastfeeding mothers.","translation":"この薬には抗乳作用があるため、授乳中の母親にはお勧めできません。"}],"collocations":["anti-lactogenic drug","anti-lactogenic herb","anti-lactogenic effect","anti-lactogenic properties"],"synonyms":["lactation-inhibiting","milk-suppressing"],"antonyms":["lactogenic","galactagogue (promoting milk production)"]}],"etymology":{"value":"Formed from the prefix 'anti-' (against) + 'lactogenic' (promoting milk production). 'Lactogenic' itself is derived from 'lacto-' (milk) + '-genic' (producing).","priority":"medium"},"pronunciation":{"ipa":"/ˌæntiˌlæktoʊˈdʒɛnɪk/","syllables":"an-ti-lac-to-gen-ic"},"inflection":{"notes":"Adjectives do not inflect in English (other than comparative/superlative forms, which are not common for this word)."},"usage_notes":{"explanation":"The term 'anti-lactogenic' is primarily used in medical and scientific contexts when discussing substances or treatments that can decrease or stop milk production. It is the opposite of 'lactogenic' or 'galactagogue,' which refers to substances that promote milk production.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed an anti-lactogenic for my baby.","correct":"✓ The doctor prescribed an anti-lactogenic medication for me.","note":"'Anti-lactogenic' is an adjective, so it needs to modify a noun (e.g., medication, drug, substance). It's not a noun itself. Also, anti-lactogenics are for the mother, not the baby."}],"priority":"low"},"related_words":{"derivatives":["anti-lactogen (noun, a substance that inhibits milk production)"],"phrasal_verbs":[],"related_terms":["lactogenic","galactagogue","lactation","breastfeeding","weaning"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Anti-lactogenic' is a technical term used in medicine and related fields. It describes something that reduces or stops the production of breast milk. Understanding this term requires knowledge of the prefix 'anti-' (meaning against) and the term 'lactogenic' (meaning promoting milk production). It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"Sage is sometimes used as an anti-lactogenic herb to help reduce milk supply during weaning.","translation":"セージは、離乳中に母乳の供給を減らすために、抗乳作用のあるハーブとして使用されることがあります。","type":"adjective","meaning_category":"suppressing milk production"},{"sentence":"The study investigated the anti-lactogenic effects of the drug on postpartum women.","translation":"その研究では、産後の女性に対する薬物の抗乳作用を調査しました。","type":"adjective","meaning_category":"reducing milk production"}]}