{"word":"pectinoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ペクチン様物質、ペクチノイド","english_definition":"Any of a group of complex polysaccharides related to pectin, found in plant cell walls.","examples":[{"sentence":"Pectinoids are important for plant cell structure and function.","translation":"ペクチノイドは植物細胞の構造と機能にとって重要です。"},{"sentence":"The analysis revealed the presence of various pectinoids in the sample.","translation":"分析により、サンプル中に様々なペクチノイドが存在することが明らかになった。"}],"collocations":["pectinoid substance","pectinoid composition","pectinoid analysis"],"synonyms":["pectic substance","pectin-like compound"],"antonyms":[]}],"etymology":{"value":"Derived from 'pectin' (a related polysaccharide) and the suffix '-oid' (resembling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛktɪˌnɔɪd/","syllables":"pec-ti-noid"},"inflection":{"noun_plural":"pectinoids"},"usage_notes":{"explanation":"'Pectinoid' refers to a broader category of substances related to pectin but may have slightly different chemical structures or properties. It is often used in scientific and technical contexts related to plant biology, food science, and biochemistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fruit is rich in pectinoid, so it's very sweet.","correct":"✓ The fruit is rich in sugars, so it's very sweet.","note":"Pectinoids contribute to the structure and gelling properties of fruits, not directly to sweetness. Sweetness comes from sugars. "},{"incorrect":"✗ Pectinoid is a type of protein.","correct":"✓ Pectinoid is a type of polysaccharide.","note":"Pectinoids are complex carbohydrates (polysaccharides), not proteins."}],"priority":"★★☆"},"related_words":{"derivatives":["pectin","pectic acid","protopectin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pectinoid' is a technical term primarily used in scientific fields such as plant biology, food science, and biochemistry. It refers to a group of complex polysaccharides related to pectin. Understanding this term requires familiarity with basic concepts in chemistry and plant cell structure. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The cell walls of many fruits are composed partly of pectinoids.","translation":"多くの果物の細胞壁は、部分的にペクチノイドで構成されています。","type":"scientific","meaning_category":"composition"},{"sentence":"Researchers are investigating the role of pectinoids in plant disease resistance.","translation":"研究者たちは、植物の病害抵抗性におけるペクチノイドの役割を調査しています。","type":"scientific","meaning_category":"function"},{"sentence":"The extraction and characterization of pectinoids from various plant sources is an active area of research.","translation":"様々な植物源からのペクチノイドの抽出と特性評価は、活発な研究分野です。","type":"scientific","meaning_category":"extraction"}]}