{"word":"hardware-triggered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ハードウェアによってトリガーされる、ハードウェアトリガー式の","english_definition":"Activated or initiated by a hardware signal or event.","examples":[{"sentence":"The data acquisition system uses a hardware-triggered start to ensure precise timing.","translation":"そのデータ収集システムは、正確なタイミングを保証するために、ハードウェアトリガー式のスタートを使用します。"},{"sentence":"A hardware-triggered interrupt allows the system to respond quickly to external events.","translation":"ハードウェアトリガー式の割り込みにより、システムは外部イベントに迅速に応答できます。"}],"collocations":["hardware-triggered interrupt","hardware-triggered acquisition","hardware-triggered event","hardware-triggered synchronization"],"synonyms":["externally triggered"],"antonyms":["software-triggered"]},{"part_of_speech":"adjective","definition":"(特にカメラに関して)ハードウェアトリガーに対応した","english_definition":"(Especially in the context of cameras) Designed to be triggered by an external hardware signal, allowing for precise synchronization with other devices or events.","examples":[{"sentence":"The hardware-triggered camera is ideal for high-speed imaging applications.","translation":"そのハードウェアトリガー対応カメラは、高速イメージングアプリケーションに最適です。"},{"sentence":"We need a hardware-triggered camera to synchronize with the laser pulse.","translation":"レーザーパルスと同期させるには、ハードウェアトリガー対応カメラが必要です。"}],"collocations":["hardware-triggered camera","hardware-triggered strobe","hardware-triggered flash"],"synonyms":["externally triggered camera"],"antonyms":["software-triggered camera"]}],"etymology":{"value":"The term combines \"hardware,\" referring to physical components of a computer system, and \"triggered,\" meaning to initiate or activate an action or event. Therefore, \"hardware-triggered\" indicates that the action or event is initiated by a hardware signal.","priority":"N/A"},"pronunciation":{"ipa":"/ˈhɑːrdwer ˈtrɪɡərd/","syllables":"hard-ware-trig-gered"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"\"Hardware-triggered\" is commonly used in technical contexts, particularly in engineering, computer science, and scientific instrumentation. It describes a process or device that is activated by a physical signal rather than software. This is often necessary for precise timing and synchronization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is triggered by hardware.","correct":"✓ The system is hardware-triggered.","note":"While \"The system is triggered by hardware\" is grammatically correct, \"The system is hardware-triggered\" is more concise and commonly used as an adjective."}],"priority":"N/A"},"related_words":{"derivatives":["trigger","hardware","software-triggered"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, specific to technical domains.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hardware-triggered\" is a technical term used in fields like engineering and computer science. It means that something is started or activated by a signal from a physical component (hardware) rather than by software. Understanding this term requires familiarity with basic concepts of computer architecture and signal processing."},"example_sentences":[{"sentence":"The oscilloscope uses a **hardware-triggered** mode to capture transient signals.","translation":"そのオシロスコープは、過渡信号をキャプチャするために、ハードウェアトリガーモードを使用します。","type":"adjective","meaning_category":"ハードウェアトリガー式の"},{"sentence":"A **hardware-triggered** strobe light can be synchronized with a high-speed camera for motion analysis.","translation":"ハードウェアトリガー式のストロボライトは、モーション分析のために高速カメラと同期させることができます。","type":"adjective","meaning_category":"ハードウェアトリガー対応の"}]}