{"word":"Hypopiesia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"低眼圧症","english_definition":"A condition in which the intraocular pressure (pressure inside the eye) is abnormally low.","examples":[{"sentence":"Hypopiesia can lead to various complications, including phthisis bulbi.","translation":"低眼圧症は、眼球癆を含む様々な合併症を引き起こす可能性があります。"},{"sentence":"The patient was diagnosed with hypopiesia after experiencing blurred vision.","translation":"患者は、視力低下を経験した後、低眼圧症と診断されました。"}],"collocations":["develop hypopiesia","treat hypopiesia","cause hypopiesia","secondary hypopiesia"],"synonyms":["ocular hypotension"],"antonyms":["ocular hypertension","glaucoma"],"notes":"Hypopiesia is often associated with other eye conditions or systemic diseases. It is important to distinguish it from normal tension glaucoma, where the optic nerve is damaged despite normal intraocular pressure."}],"etymology":{"value":"Derived from the Greek words 'hypo' (below, under), 'pies-' (pressure), and '-ia' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpoʊpaɪˈiːziə/","syllables":"hy-po-pi-e-sia"},"inflection":{"noun_plural":"hypopiesias"},"usage_notes":{"explanation":"'Hypopiesia' refers specifically to abnormally low intraocular pressure. Normal intraocular pressure typically ranges from 10 to 21 mmHg. Hypopiesia is generally defined as pressure below 6 mmHg.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor measured her blood pressure and found hypopiesia.","correct":"✓ The doctor measured her intraocular pressure and found hypopiesia.","note":"Hypopiesia refers to low pressure within the eye, not blood pressure."}],"priority":"★★☆"},"related_words":{"derivatives":["hypopiesic (adjective)"],"medical_terms":["phthisis bulbi","choroidal detachment","cyclodialysis cleft","intraocular pressure (IOP)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypopiesia' is a technical term used in ophthalmology to describe abnormally low pressure inside the eye. It is not a commonly used word outside of medical settings. Understanding this term requires familiarity with medical terminology related to eye conditions and intraocular pressure. "},"example_sentences":[{"sentence":"Sustained hypopiesia can result in irreversible damage to the eye.","translation":"持続的な低眼圧症は、眼に不可逆的な損傷を引き起こす可能性があります。","type":"medical condition","meaning_category":"effect"},{"sentence":"The treatment for hypopiesia depends on the underlying cause.","translation":"低眼圧症の治療は、根本的な原因によって異なります。","type":"medical condition","meaning_category":"treatment"}]}