{"word":"Christly","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クリストのような、キリスト教的な、キリストにふさわしい","english_definition":"Resembling Christ; like Christ; befitting Christ; Christian-like.","examples":[{"sentence":"The priest had a Christly compassion for the poor.","translation":"その司祭は貧しい人々に対してキリストのような慈悲心を持っていた。"},{"sentence":"Her Christly actions inspired many in the community.","translation":"彼女のキリスト教的な行動は地域社会の多くの人々に感銘を与えた。"}],"collocations":["Christly love","Christly virtue","Christly example","Christly character"],"synonyms":["Christian","Christlike","holy","righteous","virtuous","saintly"],"antonyms":["unchristian","ungodly","wicked","sinful","immoral"]}],"etymology":{"value":"From 'Christ' + '-ly'. The suffix '-ly' is used to form adjectives indicating resemblance or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪstli/","syllables":"Chris-tly"},"inflection":{"notes":"Adjective; comparative and superlative forms (more Christly, most Christly) are possible but not common."},"usage_notes":{"explanation":"'Christly' is a relatively uncommon adjective used to describe someone or something that resembles Christ in character, virtue, or behavior. It suggests a high degree of moral or spiritual quality associated with Christian ideals. It is often used in religious contexts or to describe individuals known for their exceptional kindness, compassion, and righteousness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a Christly life, but he didn't go to church.","correct":"✓ He lived a Christly life, attending church regularly.","note":"Living a Christly life generally implies adherence to Christian practices, including church attendance. The original sentence presents a contradiction."},{"incorrect":"✗ The Christly behavior of the bully surprised everyone.","correct":"✓ The reformed bully showed Christly compassion.","note":"'Christly' behavior is associated with positive virtues. A bully's behavior is unlikely to be described as Christly unless they have undergone a significant transformation."}],"priority":"★☆☆"},"related_words":{"derivatives":["Christlike (adjective: resembling Christ)","Christian (adjective: relating to or professing Christianity; noun: a follower of Christ)","Christianity (noun: the religion based on the life and teachings of Jesus Christ)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not common enough to be included in CEFR levels)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Christly' is a relatively rare and sophisticated word. It is most likely to be encountered in religious texts or discussions. Understanding this word requires familiarity with Christian concepts and values. Its usage implies a deep understanding of Christian theology and ethics."},"example_sentences":[{"sentence":"Her **Christly** compassion extended to all, regardless of their background.","translation":"彼女のキリストのような慈悲は、その人の背景に関わらず、すべての人に及んだ。","type":"adjective","meaning_category":"Compassion"},{"sentence":"The organization's mission is to promote **Christly** values in the community.","translation":"その組織の使命は、地域社会にキリスト教的な価値観を広めることである。","type":"adjective","meaning_category":"Values"},{"sentence":"He strived to live a **Christly** life, marked by love and service.","translation":"彼は愛と奉仕に満ちた、キリストにふさわしい生き方をしようと努めた。","type":"adjective","meaning_category":"Lifestyle"}]}