{"word":"heathenising","priority":"Low","meanings":[{"part_of_speech":"verb (present participle)","definition":"Converting or attempting to convert someone to heathenism; making or becoming heathen.","english_definition":"The act of causing someone or something to become heathen or pagan; converting to heathenism.","examples":[{"sentence":"The missionaries were accused of heathenising the local population by destroying their sacred sites.","translation":"宣教師たちは、地元の聖地を破壊することで、地元住民を異教徒化していると非難された。"},{"sentence":"Some scholars argue that certain cultural practices are a form of heathenising, as they revive pre-Christian traditions.","translation":"一部の学者は、特定の文化的慣習は、キリスト教以前の伝統を復活させるため、異教徒化の一形態であると主張している。"}],"collocations":["heathenising influence","heathenising practices","heathenising the youth"],"synonyms":["paganizing","unchristianizing","dechristianizing"],"antonyms":["Christianizing","converting","evangelizing"]}],"etymology":{"value":"Derived from 'heathenise' (verb) + '-ing' (present participle suffix). 'Heathenise' comes from 'heathen' (noun), referring to a person who does not belong to a widely held religion (especially Christianity, Judaism, or Islam) as regarded by those who do.","priority":"Medium"},"pronunciation":{"ipa":"ˈhiːðənaɪzɪŋ","syllables":"hea-then-is-ing"},"inflection":{"verb_forms":{"present_simple":["heathenise","heathenises"],"past_simple":"heathenised","past_participle":"heathenised","present_participle":"heathenising"}},"usage_notes":{"explanation":"'Heathenising' is the present participle form of the verb 'heathenise'. It describes the action of making someone or something heathen or pagan. It is often used in historical or cultural contexts, particularly when discussing the impact of religious conversions. The term can carry negative connotations, especially when used to describe the destruction or suppression of indigenous beliefs and practices.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The heathenising of the society was a good thing.","correct":"The dechristianizing of the society was a good thing.","note":"'Heathenising' often implies imposing a non-Christian belief system, while 'dechristianizing' simply means removing Christian influence. Choose the word that accurately reflects the context."}],"priority":"Low"},"related_words":{"derivatives":["heathenise (verb)","heathen (noun)","heathenism (noun)","heathenish (adjective)"],"phrasal_verbs":[],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'heathenising' is a relatively uncommon term, typically used in academic or historical contexts. It refers to the process of converting or causing something to become heathen or pagan, often implying a shift away from established religious beliefs, particularly Christianity. The term can carry negative connotations, especially when discussing the suppression of indigenous beliefs. Understanding the historical and cultural context is essential to interpreting its meaning accurately."},"example_sentences":[{"sentence":"The process of European colonization often involved heathenising indigenous populations by suppressing their traditional religions.","translation":"ヨーロッパの植民地化の過程では、先住民の伝統宗教を抑圧することで、先住民を異教徒化することがよく行われた。","type":"verb (present participle)","meaning_category":"Converting to heathenism"},{"sentence":"Critics accused the new educational system of heathenising children by removing religious instruction from the curriculum.","translation":"批評家たちは、新しい教育制度がカリキュラムから宗教教育を排除することで、子供たちを異教徒化していると非難した。","type":"verb (present participle)","meaning_category":"Making heathen"}]}