{"word":"avoidances","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"回避、避けること、忌避","english_definition":"The act of avoiding or keeping away from something.","examples":[{"sentence":"His constant avoidances of responsibility frustrated his colleagues.","translation":"彼の絶え間ない責任回避は同僚をイライラさせた。"},{"sentence":"The government's avoidances of the issue only made it worse.","translation":"政府のその問題の回避は、事態を悪化させただけだった。"},{"sentence":"Her avoidances of eye contact suggested she was hiding something.","translation":"彼女の視線を避ける態度は、何かを隠していることを示唆していた。"}],"collocations":["responsibility avoidances (責任回避)","tax avoidances (租税回避)","conflict avoidances (紛争回避)","eye contact avoidances (視線回避)","avoidances strategies (回避戦略)"],"synonyms":["evasion","shunning","dodging","circumvention","elusion"],"antonyms":["confrontation","encounter","facing","addressing","engagement"]}],"etymology":{"value":"The word 'avoidance' comes from the verb 'avoid', which originates from the Old French word 'esvoidier', meaning 'to empty out, clear out, get rid of'. This, in turn, comes from the Latin word 'viduus', meaning 'empty, widowed'. The suffix '-ance' is added to form a noun indicating the act or state of avoiding.","priority":"★★★"},"pronunciation":{"ipa":"/əˈvɔɪdənsɪz/","syllables":"a-void-an-ces"},"inflection":{"noun_plural":"avoidances"},"usage_notes":{"explanation":"'Avoidances' refers to multiple instances or types of avoiding something. It is often used in contexts where there are repeated or systematic attempts to evade or sidestep a particular issue, responsibility, or situation. The plural form suggests a pattern or collection of such instances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The avoidance was clear.","correct":"✓ The avoidance was clear. / ✓ The avoidances were clear.","note":"If referring to a single instance of avoiding, use 'avoidance'. If referring to multiple instances or a pattern, use 'avoidances'."},{"incorrect":"✗ He practices avoidances.","correct":"✓ He practices avoidance. / ✓ He employs avoidance strategies.","note":"'Avoidances' is less common in general use. 'Avoidance' or 'avoidance strategies' are more typical when discussing the general practice of avoiding."}],"priority":"★★☆"},"related_words":{"derivatives":["avoid (verb)","avoidable (adjective)","avoider (noun)"],"phrasal_verbs":["steer clear of","keep away from","shy away from","dodge","evade"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Avoidances' is a more formal and less common word than 'avoidance'. It is generally used to describe multiple instances or types of avoiding something, often in a systematic or patterned way. This word is more likely to be found in academic, professional, or technical contexts where precise language is important. Understanding the difference between 'avoidance' and 'avoidances' is crucial for accurate communication in these settings."},"example_sentences":[{"sentence":"The company's tax avoidances were under investigation.","translation":"その会社の租税回避は調査対象となっていた。","type":"noun","meaning_category":"tax"},{"sentence":"Her avoidances of social gatherings became more frequent after the incident.","translation":"その事件の後、彼女の社交的な集まりの回避はますます頻繁になった。","type":"noun","meaning_category":"social"},{"sentence":"The therapist helped him understand his avoidances of intimacy.","translation":"セラピストは彼が親密さを避けることを理解するのを助けた。","type":"noun","meaning_category":"intimacy"},{"sentence":"The report detailed the various avoidances used to circumvent the regulations.","translation":"その報告書は、規制を回避するために使用されたさまざまな回避策を詳述した。","type":"noun","meaning_category":"regulation"}]}