{"word":"macaw","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コンゴウインコ","english_definition":"A large, long-tailed, often brightly colored parrot of the genus Ara and related genera.","examples":[{"sentence":"The macaw's vibrant plumage was a sight to behold.","translation":"コンゴウインコの鮮やかな羽毛は見るべき光景だった。"},{"sentence":"Macaws are known for their intelligence and ability to mimic sounds.","translation":"コンゴウインコは知性と音を真似る能力で知られている。"}],"collocations":["scarlet macaw","blue-and-gold macaw","macaw parrot","macaw habitat","macaw conservation"],"synonyms":["parrot","psittacine"],"antonyms":[]}],"etymology":{"value":"From Portuguese 'macau', probably from a Tupi language of Brazil.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈkɔː/","syllables":"ma-caw"},"inflection":{"noun_plural":"macaws"},"usage_notes":{"explanation":"Macaws are popular as pets, but they require a lot of attention and space. They are native to Central and South America.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a macaw's in the zoo.","correct":"✓ I saw a macaw in the zoo.","note":"'Macaw' is already a noun, so adding an extra 's' is incorrect unless you are talking about multiple macaws or possessive form."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'macaw' refers to a specific type of parrot, known for its large size, long tail, and bright colors. It's not a common word in everyday conversation, but you might encounter it in books or documentaries about wildlife, especially those focusing on Central and South America. Understanding this word helps expand your vocabulary related to animals and nature."},"example_sentences":[{"sentence":"The zoo had a beautiful collection of macaws.","translation":"その動物園には美しいコンゴウインコのコレクションがあった。","type":"noun","meaning_category":"bird"},{"sentence":"The scarlet macaw is one of the most recognizable species.","translation":"ベニコンゴウインコは最も認識しやすい種の一つだ。","type":"noun","meaning_category":"bird"}]}