{"word":"Clubmobile","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A vehicle, especially during World War II, equipped to provide recreational and welfare services to troops, such as coffee, doughnuts, and entertainment.","english_definition":"A vehicle equipped to provide recreational and welfare services to troops.","examples":[{"sentence":"The Red Cross used clubmobiles to boost the morale of soldiers during the war.","translation":"赤十字は、戦時中に兵士の士気を高めるためにクラブモービルを使用した。"},{"sentence":"The clubmobile served coffee and doughnuts to the troops near the front lines.","translation":"クラブモービルは、最前線近くの部隊にコーヒーとドーナツを提供した。"}],"collocations":["Red Cross clubmobile","operate a clubmobile","staff a clubmobile"],"synonyms":["mobile canteen","recreation vehicle","welfare vehicle"],"antonyms":[]}],"etymology":{"value":"The term 'Clubmobile' is a compound word combining 'club' (referring to a social or recreational gathering place) and 'mobile' (referring to the vehicle's ability to move). It originated during World War II to describe vehicles providing club-like services to soldiers in the field.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklʌbˌmoʊbiːl/","syllables":"club-mo-bile"},"inflection":{"noun_plural":"clubmobiles"},"usage_notes":{"explanation":"The term 'Clubmobile' is primarily associated with World War II and the services provided by organizations like the Red Cross and the Salvation Army. These vehicles were crucial for boosting the morale of troops by providing familiar comforts and entertainment in war zones.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a clubmobile at the park selling ice cream.","correct":"✓ I saw an ice cream truck at the park.","note":"'Clubmobile' specifically refers to vehicles providing services to troops, not general mobile vendors."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily associated with historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Clubmobile\" refers to a specialized vehicle used during World War II to provide recreational and welfare services to troops. Understanding this term requires familiarity with historical contexts and military support systems. The word is not commonly used in modern English outside of historical discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The American Red Cross operated several Clubmobiles in Europe during World War II.","translation":"アメリカ赤十字は、第二次世界大戦中にヨーロッパでいくつかのクラブモービルを運営していた。","type":"noun","meaning_category":"vehicle"},{"sentence":"The women staffing the Clubmobile were known as 'Donut Dollies'.","translation":"クラブモービルに勤務する女性たちは「ドーナツ人形」として知られていた。","type":"noun","meaning_category":"vehicle"}]}