{"word":"al-Sahih","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イスラム教) 正統なハディース集の一つ。特に、ブハーリーの『真正集』またはムスリムの『真正集』を指す。","english_definition":"(Islam) One of the canonical collections of hadith. Specifically, referring to either Sahih al-Bukhari or Sahih Muslim.","examples":[{"sentence":"Sahih al-Bukhari is considered by Sunni Muslims to be the most authentic collection of hadith.","translation":"サヒーフ・アル＝ブハーリーは、スンニ派のイスラム教徒によって最も信頼できるハディース集とみなされている。"},{"sentence":"Both Sahih al-Bukhari and Sahih Muslim are part of the Kutub al-Sittah, the six major hadith collections.","translation":"サヒーフ・アル＝ブハーリーとサヒーフ・ムスリムはどちらも、主要なハディース集である六書の一部である。"}],"collocations":["Sahih al-Bukhari (ブハーリーの真正集)","Sahih Muslim (ムスリムの真正集)","Kutub al-Sittah (六書)","hadith collection (ハディース集)"],"synonyms":["Sahih (真正集)","canonical hadith (正典ハディース)"],"antonyms":[]}],"etymology":{"value":"アラビア語の「الصحيح (aṣ-ṣaḥīḥ)」に由来し、「正真正銘の」「信頼できる」「健全な」という意味を持つ。ハディース（預言者ムハンマドの言行録）の収集において、信頼性が高く、真正であると認められたものを指す。","priority":"★★★"},"pronunciation":{"ipa":"/æl sɑˈhiːh/","syllables":"al-sa-hih"},"inflection":{"notes":"固有名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**al-Sahih**」は、イスラム教のハディース（預言者ムハンマドの言行録）の中でも、特に信頼性が高いとされるものを集めた「真正集」を指します。特に有名なのは、ブハーリーの『真正集』とムスリムの『真正集』であり、これらはスンニ派イスラム教において非常に重要な地位を占めています。ハディースは、クルアーン（コーラン）と並んで、イスラム法や信仰の根拠となる重要な情報源です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Al-Sahih is a person.","correct":"✓ Al-Sahih is a collection of hadith.","note":"Al-Sahihは人名ではなく、ハディースのコレクションの名前です。"},{"incorrect":"✗ Al-Sahih is only important to Shia Muslims.","correct":"✓ Al-Sahih is primarily important to Sunni Muslims.","note":"Al-Sahihは主にスンニ派のイスラム教徒にとって重要です。シーア派は異なるハディース集を重視します。"}],"priority":"★★☆"},"related_words":{"derivatives":["sahih (真正の、信頼できる)","hadith (ハディース、預言者の言行録)","isnad (伝承経路)","matn (本文)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - イスラム研究や宗教学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**al-Sahih**」は、イスラム教のハディース（預言者ムハンマドの言行録）の中でも、特に信頼性が高いとされるものを指す専門用語です。特に、ブハーリーの『真正集』とムスリムの『真正集』が重要であり、スンニ派イスラム教において非常に重要な地位を占めています。これらの真正集は、イスラム法や信仰の根拠となる情報源として、クルアーン（コーラン）と並んで重要な役割を果たします。イスラム研究や宗教学の分野で頻繁に用いられます。"},"example_sentences":[{"sentence":"Scholars often compare different versions of hadith found in Sahih al-Bukhari to ensure accuracy.","translation":"学者は、正確さを保証するために、サヒーフ・アル＝ブハーリーに見られるハディースの異なるバージョンを比較することがよくある。","type":"noun","meaning_category":"ハディース集"},{"sentence":"The authenticity of a hadith is often determined by the strength of its isnad, as evaluated by scholars of Sahih Muslim.","translation":"ハディースの信憑性は、サヒーフ・ムスリムの学者によって評価されるイスナード（伝承経路）の強さによって決定されることが多い。","type":"noun","meaning_category":"ハディース集"}]}