{"word":"hyperleucocytotic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"白血球数が異常に増加した状態の","english_definition":"Characterized by an abnormally high number of leukocytes (white blood cells).","examples":[{"sentence":"The patient's blood sample was hyperleucocytotic, indicating a severe infection.","translation":"患者の血液サンプルは白血球数が異常に増加しており、重度の感染症を示していた。"}],"collocations":["hyperleucocytotic blood","hyperleucocytotic state","hyperleucocytotic condition"],"synonyms":["leukocytosis","high white blood cell count"],"antonyms":["leukopenic","hypoleukocytic"]}],"etymology":{"value":"Derived from the combination of 'hyper-' (excessive), 'leuco-' (referring to leukocytes or white blood cells), 'cyt-' (cell), and '-otic' (pertaining to a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌluːkoʊsaɪˈtɑːtɪk/","syllables":"hy-per-leu-co-cy-tot-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Hyperleucocytotic' is a medical term used to describe a condition where the number of white blood cells in the blood is significantly higher than the normal range. This condition can be indicative of various underlying issues, such as infections, inflammation, leukemia, or other hematological disorders. It is important to note that the term is primarily used in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The blood was hyperleucocytosis.","correct":"✓ The blood was hyperleucocytotic.","note":"'Hyperleucocytosis' is a noun referring to the condition itself, while 'hyperleucocytotic' is an adjective describing something characterized by that condition."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperleukocytosis (noun): The condition of having an abnormally high number of leukocytes in the blood."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Very low frequency - primarily used in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hyperleucocytotic' is a highly specialized medical adjective used to describe a condition characterized by an abnormally elevated white blood cell count. Its use is confined to medical professionals and academic contexts. Understanding requires knowledge of medical terminology and hematology."},"example_sentences":[{"sentence":"The bone marrow biopsy revealed a hyperleucocytotic picture, suggesting a myeloproliferative disorder.","translation":"骨髄生検では、白血球数が異常に増加した状態が認められ、骨髄増殖性疾患が示唆された。","type":"adjective","meaning_category":"medical condition"}]}