{"word":"unpictorialise","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"絵画的でないようにする、画像的表現を取り除く","english_definition":"To remove pictorial qualities or representations from something.","examples":[{"sentence":"The artist decided to unpictorialise the scene, focusing on abstract forms instead.","translation":"そのアーティストは、そのシーンから絵画的な要素を取り除き、代わりに抽象的な形に焦点を当てることにしました。"},{"sentence":"The writer tried to unpictorialise his descriptions, aiming for a more conceptual approach.","translation":"その作家は、説明から画像的な表現を取り除き、より概念的なアプローチを目指しました。"}],"collocations":["unpictorialise a scene","unpictorialise a description"],"synonyms":["abstract","de-emphasize","remove","strip"],"antonyms":["pictorialise","illustrate","depict"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（比喩的に）鮮明なイメージや描写を取り除く","english_definition":"To remove vivid imagery or descriptions from something, often to make it more objective or less emotionally evocative.","examples":[{"sentence":"The report attempted to unpictorialise the event, presenting only the bare facts.","translation":"その報告書は、出来事から鮮明なイメージを取り除き、事実のみを提示しようと試みました。"},{"sentence":"The journalist chose to unpictorialise the account, avoiding sensational details.","translation":"そのジャーナリストは、扇情的な詳細を避け、記事から鮮明な描写を取り除くことを選びました。"}],"collocations":["unpictorialise an event","unpictorialise an account"],"synonyms":["de-emphasize","tone down","sanitize","neutralize"],"antonyms":["embellish","exaggerate","sensationalize"]}],"etymology":{"value":"\"un-\" (否定接頭辞) + \"pictorialise\" (絵画的にする)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˌpɪkˈtɔːriəlaɪz/","syllables":"un-pic-to-ri-al-ise"},"inflection":{"verb_forms":{"present_simple":["unpictorialise","unpictorialises"],"past_simple":"unpictorialised","past_participle":"unpictorialised","present_participle":"unpictorialising"}},"usage_notes":{"explanation":"\"Unpictorialise\" is a relatively rare and formal verb. It suggests a deliberate effort to remove or reduce the visual or descriptive elements of something, often to make it more abstract, objective, or conceptual. It can apply to art, writing, or any form of representation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unpictorialized the painting with a new frame.","correct":"✓ He unpictorialised the painting by removing details and making it more abstract.","note":"Unpictorialise refers to altering the content or style to reduce pictorial qualities, not simply changing the presentation (like framing)."},{"incorrect":"✗ The report was unpictorialise.","correct":"✓ The report was unpictorialised.","note":"The correct past participle form is 'unpictorialised' (with a 'd' at the end)."}],"priority":"★★☆"},"related_words":{"derivatives":["pictorial (形容詞: 絵画的な)","pictorialise (動詞: 絵画的にする)","pictorialism (名詞: 絵画主義)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unpictorialise' is a complex and uncommon word. It means to remove the pictorial or descriptive qualities from something, making it less visually rich or detailed. This word is most likely to appear in academic or critical writing about art, literature, or other forms of representation where the goal is to analyze or abstract from the visual elements. Understanding this word requires a good grasp of abstract concepts and vocabulary related to art and representation."},"example_sentences":[{"sentence":"The modern art movement sought to unpictorialise traditional landscapes.","translation":"近代美術運動は、伝統的な風景画から絵画的な要素を取り除くことを目指しました。","type":"verb","meaning_category":"絵画的でないようにする"},{"sentence":"The author unpictorialised the scene in order to focus on the emotional impact.","translation":"著者は、感情的な影響に焦点を当てるために、そのシーンから鮮明なイメージを取り除きました。","type":"verb","meaning_category":"鮮明なイメージを取り除く"}]}