{"word":"noninflectionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"屈折変化せずに、語形変化なしに","english_definition":"Without inflection; in a manner that does not involve changes in the form of a word to indicate grammatical function or meaning.","examples":[{"sentence":"Some languages, like Mandarin Chinese, are largely noninflectional; words are used noninflectionally regardless of their grammatical role.","translation":"中国語（北京語）のような言語は、ほとんどが屈折しない言語であり、単語は文法的な役割に関係なく、屈折変化せずに使用されます。"},{"sentence":"English uses some words noninflectionally, such as 'cut' which remains the same in the present and past tenses in certain contexts.","translation":"英語では、「cut」のように、特定の文脈では現在形と過去形で形が変わらない単語を屈折変化せずに使用することがあります。"}],"collocations":["used noninflectionally","expressed noninflectionally","treated noninflectionally"],"synonyms":["uninflectedly","invariably","without modification"],"antonyms":["inflectionally","with inflectional changes"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'inflectionally'. 'Inflectionally' is derived from 'inflection', which refers to changes in the form of a word to express different grammatical functions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪnˈflɛkʃənəli/","syllables":"non-in-flec-tion-al-ly"},"inflection":{"notes":"As an adverb, 'noninflectionally' does not have different inflectional forms."},"usage_notes":{"explanation":"'Noninflectionally' is used in linguistics to describe how words are used without changing their form to indicate tense, number, gender, case, or other grammatical categories. Languages that rely heavily on word order and function words rather than inflection are described as noninflectional or isolating languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is use noninflectionally.","correct":"✓ The word is used noninflectionally.","note":"Ensure the correct passive voice construction ('is used') when describing how a word is treated."},{"incorrect":"✗  noninflectional manner","correct":"✓ noninflectionally","note":"Use the adverbial form 'noninflectionally' to describe *how* something is done."}],"priority":"★★☆"},"related_words":{"derivatives":["noninflectional (adjective)","inflection (noun)","inflectional (adjective)","inflectionally (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Noninflectionally' is a term primarily used in the field of linguistics. It describes the manner in which words are used without changing their form to indicate grammatical functions. This term is most relevant when discussing language typology and the differences between isolating (noninflectional) and inflectional languages. Understanding this term requires a solid foundation in grammatical concepts."},"example_sentences":[{"sentence":"In isolating languages, words are often used **noninflectionally**, relying on word order to convey meaning.","translation":"孤立語では、単語はしばしば屈折変化せずに使用され、語順によって意味を伝えます。","type":"general"},{"sentence":"The root morpheme is used **noninflectionally** in the sentence, maintaining the same form regardless of its grammatical role.","translation":"その文では、語根形態素は屈折変化せずに使用され、文法的な役割に関わらず同じ形を維持します。","type":"technical"}]}