{"word":"Nordcaper","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A large, dark-colored right whale found in the North Atlantic.","english_definition":"A large, dark-colored right whale found in the North Atlantic, also known as the North Atlantic right whale.","examples":[{"sentence":"The Nordcaper is one of the most endangered whale species in the world.","translation":"北大西洋セミクジラは、世界で最も絶滅の危機に瀕しているクジラ種の一つです。"}],"collocations":["North Atlantic right whale","endangered species","whale conservation"],"synonyms":["North Atlantic right whale","right whale"],"antonyms":[]}],"etymology":{"value":"From 'Nord' (North), referring to its habitat in the North Atlantic, and 'caper', likely derived from its active behavior at the surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɔːrdˌkeɪpər/","syllables":"Nord-ca-per"},"inflection":{"noun_plural":"Nordcapers"},"usage_notes":{"explanation":"The term 'Nordcaper' is sometimes used interchangeably with 'North Atlantic right whale,' though the latter is more common in scientific contexts. It refers specifically to the right whale population found in the North Atlantic Ocean, which is distinct from other right whale species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Nordcaper in the Pacific Ocean.","correct":"✓ I saw a Nordcaper in the Atlantic Ocean.","note":"Nordcapers are found in the North Atlantic, not the Pacific."}],"priority":"★★☆"},"related_words":{"derivatives":["right whale","whale","marine mammal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nordcaper' refers to the North Atlantic right whale, a critically endangered species. Understanding this term requires knowledge of marine biology and conservation efforts. It's not a commonly used word, so familiarity with scientific or conservation contexts is helpful."},"example_sentences":[{"sentence":"Conservation efforts are crucial to protect the Nordcaper from extinction.","translation":"北大西洋セミクジラを絶滅から守るためには、保護活動が不可欠です。","type":"noun","meaning_category":"whale species"},{"sentence":"The Nordcaper population has been declining for decades due to human activities.","translation":"北大西洋セミクジラの個体数は、人間の活動により数十年にわたって減少しています。","type":"noun","meaning_category":"whale species"}]}