{"word":"Shaivism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シヴァ派：ヒンドゥー教の主要な宗派の一つで、シヴァ神を至高の神として崇拝する。","english_definition":"One of the major traditions within Hinduism that reveres Shiva as the Supreme Being.","examples":[{"sentence":"Shaivism is characterized by its diverse sub-traditions, ranging from ascetic practices to devotional worship.","translation":"シヴァ派は、禁欲的な修行から献身的な崇拝まで、多様な下位の伝統によって特徴づけられる。"},{"sentence":"Many ancient temples in South India are dedicated to Shiva and are important centers of Shaivism.","translation":"南インドの多くの古代寺院はシヴァ神に捧げられており、シヴァ派の重要な中心地となっている。"}],"collocations":["practice Shaivism (シヴァ派を実践する)","followers of Shaivism (シヴァ派の信者)","Shaivism tradition (シヴァ派の伝統)","Shaivism philosophy (シヴァ派の哲学)"],"synonyms":["Shivaism"],"antonyms":[]}],"etymology":{"value":"The term 'Shaivism' is derived from 'Shiva,' the name of the deity, with the suffix '-ism' denoting a belief system or religious tradition.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃaɪvɪzəm/","syllables":"Shai-vi-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Shaivism encompasses a wide range of philosophical schools and devotional practices. It is one of the oldest and most influential traditions within Hinduism. Key concepts include the worship of Shiva in various forms (such as the lingam), the importance of yoga and meditation, and the pursuit of liberation (moksha) through devotion to Shiva.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Shaivism is a type of Buddhism.","correct":"✓ Shaivism is a tradition within Hinduism.","note":"Shaivism is a major tradition within Hinduism, not Buddhism."},{"incorrect":"✗ Shaivism only involves idol worship.","correct":"✓ Shaivism involves various practices, including yoga, meditation, and devotional worship.","note":"Shaivism includes a range of practices beyond idol worship, such as yoga and meditation."}],"priority":"★★☆"},"related_words":{"derivatives":["Shaiva (adjective/noun: relating to or a follower of Shaivism)","Shiva (noun: the principal deity in Shaivism)","lingam (noun: a symbolic representation of Shiva)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shaivism' refers to a complex and nuanced religious tradition within Hinduism. Understanding it requires familiarity with Hindu theology, philosophy, and cultural practices. The term is typically encountered in academic or religious contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Scholars study Shaivism to understand the diverse expressions of Hindu devotion.","translation":"学者たちは、ヒンドゥー教の献身の多様な表現を理解するためにシヴァ派を研究する。","type":"general","meaning_category":"シヴァ派の研究"},{"sentence":"The Pashupatinath Temple in Nepal is a significant pilgrimage site for followers of Shaivism.","translation":"ネパールのパシュパティナート寺院は、シヴァ派の信者にとって重要な巡礼地である。","type":"cultural","meaning_category":"シヴァ派の聖地"},{"sentence":"Shaivism emphasizes the importance of self-discipline and spiritual practice in attaining liberation.","translation":"シヴァ派は、解放を達成するための自己鍛錬と精神的な実践の重要性を強調する。","type":"philosophical","meaning_category":"シヴァ派の教義"}]}