{"word":"comebacker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツで)カムバックした人、復帰選手","english_definition":"a person who makes a comeback, especially in sports.","examples":[{"sentence":"He was hailed as a great comebacker after winning the championship.","translation":"彼は選手権で優勝した後、偉大なカムバック選手として称えられた。"},{"sentence":"The team signed the veteran player hoping he would be a valuable comebacker.","translation":"チームはベテラン選手が貴重な復帰選手になることを期待して契約した。"}],"collocations":["great comebacker","valuable comebacker","successful comebacker"],"synonyms":["returnee","reentrant"],"antonyms":["retiree"]},{"part_of_speech":"noun","definition":"(野球)ピッチャーが投げた球が打者のバットに当たってピッチャーに直接返ってくること","english_definition":"(baseball) a batted ball that is hit sharply back to the pitcher.","examples":[{"sentence":"The pitcher barely managed to avoid the comebacker.","translation":"ピッチャーはかろうじてカムバックボールを避けることができた。"},{"sentence":"A sharp comebacker hit the pitcher in the leg.","translation":"鋭いカムバックボールがピッチャーの脚に当たった。"}],"collocations":["sharp comebacker","hard comebacker"],"synonyms":["line drive back to the pitcher"],"antonyms":[]}],"etymology":{"value":"The word \"comebacker\" is derived from the verb phrase \"come back,\" meaning to return to a previous position or condition. The suffix \"-er\" is added to indicate a person or thing that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌmˌbækər/","syllables":"come-back-er"},"inflection":{"noun_plural":"comebackers"},"usage_notes":{"explanation":"The term \"comebacker\" has two main meanings. In a general sense, it refers to someone who returns to a previous activity or profession, especially after a period of absence or retirement. In baseball, it specifically refers to a batted ball that is hit directly back to the pitcher. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good comeback.","correct":"✓ He is a good comebacker.","note":"The correct noun form for someone who makes a comeback is \"comebacker,\" not \"comeback.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["comeback (noun: the act of returning to a previous position or condition)"],"phrasal_verbs":["come back (verb: to return)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"comebacker\" is generally used in two contexts: sports and baseball. In sports, it refers to an athlete who returns to competition after a period of absence, often due to injury or retirement. In baseball, it refers to a batted ball that is hit sharply back to the pitcher. Understanding the context is important to determine the intended meaning."},"example_sentences":[{"sentence":"After a serious injury, the athlete made an impressive **comebacker** to win the gold medal.","translation":"重傷を負った後、その選手は印象的なカムバックを果たし、金メダルを獲得した。","type":"noun","meaning_category":"復帰選手"},{"sentence":"The pitcher had to react quickly to avoid the **comebacker**.","translation":"ピッチャーはカムバックボールを避けるために素早く反応しなければならなかった。","type":"noun","meaning_category":"野球のカムバックボール"}]}