{"word":"undereater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(慢性的に)食べる量が少ない人、少食の人","english_definition":"A person who habitually eats too little.","examples":[{"sentence":"She was always an undereater, which worried her parents.","translation":"彼女はいつも食べる量が少なかったので、両親は心配していた。"},{"sentence":"The doctor identified him as an undereater and recommended a nutritional plan.","translation":"医者は彼を少食の人だと診断し、栄養計画を勧めた。"}],"collocations":["chronic undereater","diagnosed undereater"],"synonyms":["light eater","poor eater","fussy eater (偏食家の場合)"],"antonyms":["overeater","big eater","hearty eater"]},{"part_of_speech":"noun","definition":"(一時的に)食べる量が少ない人、食欲不振の人","english_definition":"A person who is eating less than usual, often due to illness or stress.","examples":[{"sentence":"He's been an undereater since he caught the flu.","translation":"彼はインフルエンザにかかってから、食べる量が減っている。"},{"sentence":"Stress can turn anyone into an undereater.","translation":"ストレスは誰でも食欲不振にさせる可能性がある。"}],"collocations":["temporary undereater","stress-induced undereater"],"synonyms":["poor appetite","loss of appetite"],"antonyms":["normal appetite","healthy appetite"]}],"etymology":{"value":"'Under-' (不足) + 'eater' (食べる人)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈiːtər/","syllables":"un-der-eat-er"},"inflection":{"noun_plural":"undereaters"},"usage_notes":{"explanation":"'Undereater' describes someone who consistently eats less than what is considered a healthy or normal amount. This can be due to various reasons, including personal preference, medical conditions, or psychological factors. It is often used in contrast to 'overeater', which refers to someone who consistently eats too much.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an undereater because she is on a diet.","correct":"✓ She is an undereater, possibly because she is on a diet.","note":"While dieting can lead to undereating, it's important to note that not all dieters are undereaters, and undereating can stem from other causes as well."},{"incorrect":"✗ He is undereating for a week.","correct":"✓ He has been undereating for a week.","note":"Use the present perfect continuous tense ('has been undereating') to describe an action that started in the past and continues to the present."}],"priority":"★★☆"},"related_words":{"derivatives":["undereat (verb: 食べる量が少ない)","undereating (noun: 食べる量が少ないこと)"],"phrasal_verbs":[],"related_terms":["overeater","eating disorder","anorexia","bulimia","appetite","nutrition","malnutrition"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'undereater' is a compound noun describing someone who consistently eats less than a healthy or normal amount. It's a relatively uncommon word but easily understood due to its straightforward construction: 'under-' meaning 'less than' and 'eater' meaning 'someone who eats'. It's often used in discussions about nutrition, health, or eating habits. The concept is simple, but the underlying reasons for undereating can be complex and may involve medical or psychological factors."},"example_sentences":[{"sentence":"As a child, she was a picky undereater, often refusing to finish her meals.","translation":"子供の頃、彼女は偏食で食べる量が少なく、よく食事を残していた。","type":"general","meaning_category":"少食の人"},{"sentence":"The doctor was concerned about the patient's weight loss and suspected he was an undereater.","translation":"医者は患者の体重減少を懸念し、彼が少食なのではないかと疑った。","type":"medical","meaning_category":"少食の人"},{"sentence":"Many elderly people become undereaters due to decreased appetite and difficulty chewing.","translation":"多くの高齢者は、食欲の低下や咀嚼の困難さから、食べる量が少なくなる。","type":"demographic","meaning_category":"少食の人"}]}