{"word":"blackrag","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史的) 黒い旗、特に降伏の拒否や容赦のない戦闘の意思を示すために掲げられるもの","english_definition":"(historical) A black flag, especially one displayed to indicate that no quarter will be given or that surrender will be refused.","examples":[{"sentence":"The pirates raised the blackrag, signaling their intent to fight to the death.","translation":"海賊たちは黒旗を掲げ、死ぬまで戦う意思を示した。"},{"sentence":"The besieged city knew their fate was sealed when the enemy flew the blackrag.","translation":"包囲された都市は、敵が黒旗を掲げたとき、自分たちの運命が決まったことを悟った。"}],"collocations":["raise the blackrag","fly the blackrag","show the blackrag"],"synonyms":["no quarter flag","death flag"],"antonyms":["white flag (surrender)"]}],"etymology":{"value":"'Black' + 'rag' (flag). The symbolism of black as representing death, mourning, or a refusal to show mercy is ancient.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblækˌræɡ/","syllables":"black-rag"},"inflection":{"noun_plural":"blackrags"},"usage_notes":{"explanation":"The term 'blackrag' is primarily historical, referring to a black flag used to signal that no prisoners would be taken or that surrender was not an option. It is a symbol of ruthless warfare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The blackrag was used to show peace.","correct":"✓ The blackrag was used to show no mercy.","note":"The blackrag signifies the opposite of peace; it means no mercy will be shown."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Blackrag' is a relatively rare term, primarily used in historical contexts to describe a black flag signaling a refusal to give quarter or accept surrender. Understanding its meaning requires familiarity with historical warfare practices and symbolism."},"example_sentences":[{"sentence":"The defenders hoisted the blackrag, vowing to fight to the last man.","translation":"防衛者たちは黒旗を掲げ、最後の1人まで戦うことを誓った。","type":"noun","meaning_category":"historical symbol"},{"sentence":"The appearance of the blackrag struck fear into the hearts of the approaching army.","translation":"黒旗の出現は、近づいてくる軍隊の心に恐怖を植え付けた。","type":"noun","meaning_category":"historical symbol"}]}