{"word":"Illiberalness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不寛容さ、偏狭さ、自由主義的でないこと","english_definition":"The quality or state of being illiberal; intolerance; narrow-mindedness; opposition to liberal principles.","examples":[{"sentence":"The illiberalness of the regime was evident in its suppression of dissent.","translation":"その政権の不寛容さは、異議の抑圧において明らかだった。"},{"sentence":"He criticized the illiberalness of the proposed legislation.","translation":"彼は提案された法律の不寛容さを批判した。"}],"collocations":["political illiberalness","social illiberalness","religious illiberalness"],"synonyms":["intolerance","bigotry","narrow-mindedness","prejudice","authoritarianism"],"antonyms":["tolerance","liberalism","open-mindedness","broad-mindedness"]}],"etymology":{"value":"Formed from 'illiberal' (not liberal) + '-ness' (suffix denoting a state or quality). 'Illiberal' itself comes from 'il-' (prefix meaning not) + 'liberal'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɪbərəlˌnɛs/","syllables":"il-lib-er-al-ness"},"inflection":{"noun_plural":"illiberalnesses (rarely used)"},"usage_notes":{"explanation":"'Illiberalness' refers to the degree to which something lacks liberal qualities, such as tolerance, open-mindedness, and respect for individual rights. It is often used in political and social contexts to describe ideologies, policies, or behaviors that are considered restrictive or oppressive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The illiberalness of the country is increasing tolerance.","correct":"✓ The illiberalness of the country is decreasing tolerance.","note":"Illiberalness is the opposite of tolerance, so it cannot increase tolerance."}],"priority":"★★☆"},"related_words":{"derivatives":["illiberal (adjective)","illiberally (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Illiberalness' is a relatively uncommon and abstract noun that describes the quality of being illiberal. It is typically used in formal or academic contexts to discuss political or social issues related to freedom, tolerance, and individual rights. Understanding this word requires a good grasp of the concept of liberalism and its antonyms."},"example_sentences":[{"sentence":"The report highlighted the growing illiberalness in the government's approach to media regulation.","translation":"その報告書は、政府のメディア規制へのアプローチにおける不寛容さの増大を強調した。","type":"general","meaning_category":"不寛容さ、偏狭さ"},{"sentence":"The university's commitment to free speech was challenged by the illiberalness of certain student groups.","translation":"大学の言論の自由へのコミットメントは、特定の学生団体の不寛容さによって挑戦された。","type":"general","meaning_category":"不寛容さ、偏狭さ"}]}