{"word":"squintingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"目を細めて、しかめ面をして","english_definition":"in a manner that involves partly closing the eyes, often to see more clearly or in response to bright light; with a squint.","examples":[{"sentence":"She looked at the document squintingly, trying to decipher the small print.","translation":"彼女は目を細めて書類を見て、小さな文字を解読しようとした。"},{"sentence":"He stared squintingly into the sun.","translation":"彼は目を細めて太陽をじっと見た。"},{"sentence":"The old man squintingly peered over his glasses.","translation":"老人は目を細めて眼鏡越しに覗き込んだ。"}],"collocations":["look squintingly","stare squintingly","peer squintingly"],"synonyms":["narrow-eyed","with a squint","with narrowed eyes"],"antonyms":["wide-eyed","openly","clearly"]}],"etymology":{"value":"Derived from the verb 'squint' (to look with eyes partly closed) and the suffix '-ingly' (in a specified manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɪntɪŋli/","syllables":"squint-ing-ly"},"inflection":{"notes":"This is an adverb and does not have different forms."},"usage_notes":{"explanation":"'Squintingly' describes the action of looking with the eyes partially closed. This can be due to bright light, poor vision, or suspicion. It emphasizes the manner in which someone is looking, highlighting the effort or difficulty in seeing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She squintingly smiled.","correct":"She smiled squintingly.","note":"The adverb 'squintingly' should generally modify verbs of seeing or looking, not smiling. While possible, it's less common and might imply a strained or uncomfortable smile."},{"incorrect":"He was squintingly because of the sun.","correct":"He was squinting because of the sun.","note":"'Squintingly' is an adverb, not a verb. The correct verb form is 'squinting'."}],"priority":"★☆☆"},"related_words":{"derivatives":["squint (noun, verb)","squint-eyed (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'squintingly' is not commonly used. It describes the action of looking with the eyes partially closed, often due to bright light or poor vision. It is formed by adding '-ingly' to the verb 'squint', making it an adverb. Due to its specific meaning and relatively low frequency, it is more likely to be encountered in advanced texts."},"example_sentences":[{"sentence":"The detective examined the crime scene squintingly, searching for any overlooked clues.","translation":"刑事は目を細めて犯罪現場を調べ、見落とされた手がかりを探した。","type":"adverb","meaning_category":"manner of looking"},{"sentence":"She squintingly tried to read the sign from a distance.","translation":"彼女は目を細めて遠くから標識を読もうとした。","type":"adverb","meaning_category":"difficulty seeing"},{"sentence":"He squintingly watched the ship disappear over the horizon.","translation":"彼は目を細めて船が水平線に消えていくのを見ていた。","type":"adverb","meaning_category":"observing with effort"}]}