{"word":"unsyringed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not having been syringed; not cleaned or treated with a syringe.","english_definition":"Not having been cleaned or treated with a syringe.","examples":[{"sentence":"The doctor noted that the patient's ear was unsyringed.","translation":"医者は患者の耳が洗浄されていないことを指摘した。"},{"sentence":"An unsyringed wound can be more prone to infection.","translation":"注射器で洗浄されていない傷は、感染しやすい可能性がある。"}],"collocations":["unsyringed ear","unsyringed wound"],"synonyms":["uncleaned","untreated"],"antonyms":["syringed","cleaned","treated"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'syringed'. 'Syringed' itself comes from the noun 'syringe', which originates from the Greek word 'syrinx' meaning 'pipe' or 'tube'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsɪrɪndʒd/","syllables":"un-syr-inged"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms (more unsyringed, most unsyringed) are possible but rare."},"usage_notes":{"explanation":"'Unsyringed' is a relatively uncommon word, primarily used in medical or hygiene contexts. It describes something that has not undergone cleaning or treatment using a syringe. Its usage is largely limited to technical or descriptive writing where the method of cleaning or treatment is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsyringed apple was delicious.","correct":"✓ The unwashed apple was delicious.","note":"'Unsyringed' specifically refers to cleaning with a syringe. For general lack of washing, use 'unwashed'."},{"incorrect":"✗ He felt unsyringed after the long day.","correct":"✗ He felt tired/unclean after the long day.","note":"'Unsyringed' describes a physical state of not being cleaned with a syringe, not a feeling."}],"priority":"★☆☆"},"related_words":{"derivatives":["syringe (noun/verb)","syringing (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Unsyringed' is a technical term, primarily used in medical or scientific contexts. It means 'not having been cleaned or treated with a syringe.' Due to its specialized usage, it is not commonly encountered in general English. Understanding the word requires familiarity with medical procedures and terminology."},"example_sentences":[{"sentence":"The nurse documented the condition of the unsyringed area before applying antiseptic.","translation":"看護師は消毒剤を塗布する前に、洗浄されていない領域の状態を記録した。","type":"adjective","meaning_category":"Medical"},{"sentence":"Due to limited resources, many wounds remained unsyringed in the field hospital.","translation":"限られた資源のため、野戦病院では多くの傷が洗浄されないままだった。","type":"adjective","meaning_category":"Medical"}]}