{"word":"oped","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国)意見広告、寄稿記事 (newspaper's opinion pageの略)","english_definition":"(mainly US) an opinion piece published in a newspaper or magazine, usually written by someone who is not employed by the publication. It is short for 'opposite the editorial page'.","examples":[{"sentence":"The newspaper published an oped by a local politician.","translation":"その新聞は地元の政治家による意見広告を掲載した。"},{"sentence":"She wrote an oped about the importance of environmental protection.","translation":"彼女は環境保護の重要性について寄稿記事を書いた。"},{"sentence":"His oped generated a lot of discussion online.","translation":"彼の意見広告はオンラインで多くの議論を呼んだ。"}],"collocations":["write an oped (意見広告を書く)","submit an oped (意見広告を投稿する)","publish an oped (意見広告を掲載する)","an oped piece (意見広告)","an oped column (意見広告欄)"],"synonyms":["opinion piece","commentary","article","column","viewpoint"],"antonyms":["news report","editorial"]},{"part_of_speech":"verb","definition":"(まれ)意見広告を掲載する","english_definition":"(rare) to publish an op-ed.","examples":[{"sentence":"The magazine opeds several articles on climate change each month.","translation":"その雑誌は毎月、気候変動に関するいくつかの記事を意見広告として掲載している。"}],"collocations":[],"synonyms":["publish","feature","include"],"antonyms":[]}],"etymology":{"value":"'Oped' is a shortened form of 'opposite the editorial page'. Newspapers traditionally have an editorial page, which contains articles written by the newspaper's editors expressing the publication's official opinions. To provide a space for diverse viewpoints, they created a page 'opposite the editorial page' where guest writers could contribute their own opinions. This section became known as the 'op-ed' page, and eventually the term 'oped' emerged as a shorthand.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊpɛd/","syllables":"o-ped"},"inflection":{"noun_plural":"opeds","verb_forms":{"present_simple":["oped","opeds"],"past_simple":"opedded","past_participle":"opedded","present_participle":"opedding"}},"usage_notes":{"explanation":"'Oped' is primarily used as a noun to refer to an opinion article in a newspaper or magazine. It is most common in American English. While it can be used as a verb, this usage is rare. The term implies that the article presents a personal viewpoint rather than objective reporting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I read an oped about the news.","correct":"✓ I read an oped about the issue.","note":"'Oped' refers to opinion pieces, not news reports. Use 'oped' when the article expresses a specific viewpoint or argument. Use 'news report' when the article presents factual information. "},{"incorrect":"✗ He opeded in the New York Times.","correct":"✓ He wrote an oped for the New York Times. / ✓ The New York Times published his oped.","note":"When used as a verb, 'oped' is less common. It's more natural to say 'wrote an oped' or 'published an oped'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["editorial","column","article","commentary","opinion piece"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oped' is a specialized term primarily used in journalism and political contexts. It refers to an opinion article published in a newspaper or magazine, usually written by someone who is not an employee of the publication. This term is more commonly used in the United States. Understanding this term requires familiarity with the structure and content of newspapers and magazines. It is not typically encountered in everyday conversation. "},"example_sentences":[{"sentence":"Her **oped** in the Washington Post sparked a national debate.","translation":"彼女のワシントン・ポストへの寄稿記事は全国的な議論を巻き起こした。","type":"noun","meaning_category":"意見広告"},{"sentence":"The newspaper encourages readers to submit **opeds** on local issues.","translation":"その新聞は読者に地元の問題に関する意見広告の投稿を奨励している。","type":"noun","meaning_category":"意見広告"},{"sentence":"He **opedded** a piece about the importance of voting in local elections.","translation":"彼は地方選挙で投票することの重要性についての意見広告を掲載した。","type":"verb","meaning_category":"意見広告を掲載する"}]}