{"word":"asportation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 窃盗罪における持ち去り、運搬","english_definition":"(law) The act of carrying away or removing things; specifically, in larceny, the carrying away of goods with the intent to steal them.","examples":[{"sentence":"Asportation is an essential element of larceny.","translation":"持ち去りは窃盗罪の不可欠な要素です。"},{"sentence":"The prosecution had to prove asportation to secure a conviction for theft.","translation":"検察は窃盗罪での有罪判決を確実にするために持ち去りを証明する必要がありました。"}],"collocations":["element of asportation","prove asportation","establish asportation"],"synonyms":["removal","carrying away","taking"],"antonyms":["abandonment","return","replacement"]}],"etymology":{"value":"From Latin 'asportare', past participle 'asportatus', meaning 'to carry away'. This is composed of 'ab-' (away from) and 'portare' (to carry).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæspɔːrˈteɪʃən/","syllables":"as-por-ta-tion"},"inflection":{"noun_plural":"asportations"},"usage_notes":{"explanation":"'Asportation' is a legal term, specifically used in the context of theft or larceny. It refers to the physical act of removing or carrying away property with the intent to steal it. It's one of the key elements that must be proven to establish the crime of larceny. The term is formal and primarily used in legal settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The asportation of the idea was unethical.","correct":"✓ The appropriation of the idea was unethical.","note":"'Asportation' refers to the physical removal of property, not the taking of ideas. 'Appropriation' is more suitable for taking ideas or intellectual property."}],"priority":"★☆☆"},"related_words":{"derivatives":["asport (verb, rare)"],"phrases":["actus reus (the guilty act, which includes asportation in larceny)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very specialized legal vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Asportation' is a highly specialized legal term referring to the act of physically removing or carrying away property with the intent to steal it. This term is primarily encountered in legal contexts, such as courtrooms or legal documents, when discussing the elements of theft or larceny. Due to its specific and technical nature, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The video clearly showed the asportation of the merchandise from the store.","translation":"ビデオは、商品が店から持ち去られる様子をはっきりと示していました。","type":"general","meaning_category":"carrying away"},{"sentence":"Without proof of asportation, the case against the suspect was weak.","translation":"持ち去りの証拠がなければ、容疑者に対する訴訟は弱いものでした。","type":"legal","meaning_category":"legal element of theft"}]}