{"word":"Cock-of-the-rock","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"イワドリ（岩鳥）属の鳥の総称。特に、ペルーイワドリ (Rupicola peruvianus) またはギアナイワドリ (Rupicola rupicola) を指す。","english_definition":"A common name for birds of the genus Rupicola, especially referring to the Andean cock-of-the-rock (Rupicola peruvianus) or the Guianan cock-of-the-rock (Rupicola rupicola).","examples":[{"sentence":"The Andean cock-of-the-rock is known for its vibrant orange plumage.","translation":"ペルーイワドリは鮮やかなオレンジ色の羽毛で知られている。"},{"sentence":"Male cock-of-the-rocks gather in leks to display and attract females.","translation":"オスのイワドリはレックに集まり、ディスプレイをしてメスを引き付ける。"}],"collocations":["Andean cock-of-the-rock","Guianan cock-of-the-rock","lekking behavior of cock-of-the-rocks","display plumage of cock-of-the-rocks"],"synonyms":["Rupicola peruvianus","Rupicola rupicola"],"antonyms":[]}],"etymology":{"value":"The name \"cock-of-the-rock\" refers to the male bird's habit of displaying on rocks and its rooster-like appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒk əv ðə ˈrɒk/","syllables":"cock-of-the-rock"},"inflection":{"noun_plural":"cock-of-the-rocks"},"usage_notes":{"explanation":"The term \"cock-of-the-rock\" is most often used to refer to either the Andean cock-of-the-rock or the Guianan cock-of-the-rock, both of which are known for their elaborate courtship displays and bright coloration, particularly in the males. These birds are found in specific regions of South America.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ cock of the rock's","correct":"✓ cock-of-the-rock's","note":"When using the possessive form, maintain the hyphens in the name."}],"priority":"★★☆"},"related_words":{"derivatives":["Rupicola (genus name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"cock-of-the-rock\" refers to a specific type of bird found in South America, known for its bright colors and unique mating behaviors. It's a relatively specialized term, so familiarity with ornithology or South American wildlife may be helpful for understanding. The term is most often used in the context of wildlife documentaries, scientific literature, or travel guides related to the regions where these birds are found."},"example_sentences":[{"sentence":"The **cock-of-the-rock** is a symbol of the Andean cloud forests.","translation":"イワドリはアンデスの雲霧林の象徴である。","type":"noun","meaning_category":"bird"},{"sentence":"We observed the vibrant courtship display of the male **cock-of-the-rock** in the rainforest.","translation":"熱帯雨林で、オスのイワドリの鮮やかな求愛行動を観察した。","type":"noun","meaning_category":"bird"}]}