{"word":"plebeianness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"平民であること、庶民性、下品さ、粗野さ","english_definition":"The state or quality of being plebeian; commonness, vulgarity, or lack of refinement.","examples":[{"sentence":"The plebeianness of his manners was evident to everyone at the formal dinner.","translation":"彼の態度の庶民性は、正式な夕食会では誰の目にも明らかだった。"},{"sentence":"She tried to hide the plebeianness of her upbringing with expensive clothes and jewelry.","translation":"彼女は高価な服や宝石で、自分の育ちの粗野さを隠そうとした。"},{"sentence":"The movie celebrated the plebeianness of everyday life, showing the struggles and triumphs of ordinary people.","translation":"その映画は、普通の人々の苦闘と勝利を描き、日常生活の庶民性を称賛した。"}],"collocations":["exhibit plebeianness","hide plebeianness","the plebeianness of manners","the plebeianness of upbringing"],"synonyms":["commonness","vulgarity","coarseness","lack of refinement","boorishness","uncouthness","crudeness","lowliness"],"antonyms":["aristocracy","refinement","nobility","elegance","sophistication","gentility"]}],"etymology":{"value":"Derived from 'plebeian' (belonging to the common people) + '-ness' (suffix denoting a state or quality). 'Plebeian' comes from Latin 'plebeius' (belonging to the plebs, the common people of ancient Rome).","priority":"★★☆"},"pronunciation":{"ipa":"/plɪˈbiːənˌnɛs/","syllables":"ple-be-ian-ness"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Plebeianness' refers to the quality or state of being plebeian, which can encompass both the positive aspects of being a common person and the negative aspects of lacking refinement or being vulgar. The term often carries a negative connotation, implying a lack of sophistication or good taste. However, it can also be used neutrally or even positively to describe the unpretentious and authentic qualities of ordinary people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed plebeianness in his actions.","correct":"✓ He showed plebeian manners in his actions.","note":"While 'plebeianness' is a valid noun, it's often more natural to use 'plebeian' as an adjective to describe specific qualities or behaviors (e.g., plebeian manners, plebeian tastes)."},{"incorrect":"✗ The plebeianness was celebrated by all the people.","correct":"✓ The plebeian spirit was celebrated by all the people.","note":"'Plebeianness' refers to the quality itself, not a group of people. To refer to the common people, use 'plebeians' or 'the common people'."}],"priority":"★★☆"},"related_words":{"derivatives":["plebeian (adjective, noun)","plebeianly (adverb)"],"phrases":["the plebeian class","plebeian tastes","plebeian manners"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plebeianness' is a relatively uncommon word that describes the state of being plebeian, meaning belonging to the common people or lacking refinement. It's often used in a critical way to suggest vulgarity or a lack of sophistication. Understanding this word requires a good grasp of abstract nouns and nuanced vocabulary. It's more likely to be encountered in literature or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"The critic decried the film's plebeianness, calling it a shallow attempt to appeal to the masses.","translation":"評論家はその映画の庶民性を非難し、大衆に訴えようとする浅薄な試みだと評した。","type":"general","meaning_category":"vulgarity"},{"sentence":"Despite his wealth, he never lost the plebeianness that endeared him to his working-class roots.","translation":"富を得ても、彼は労働者階級のルーツへの愛着を抱かせる庶民性を決して失わなかった。","type":"general","meaning_category":"commonness"},{"sentence":"The artist sought to capture the beauty and dignity of plebeianness in his paintings.","translation":"その芸術家は、絵画の中で庶民性の美しさと尊厳を捉えようとした。","type":"general","meaning_category":"commonness"}]}