{"word":"ballistocardiogram","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"心臓弾動図","english_definition":"A graphical representation of the repetitive motions of the body caused by the sudden ejection of blood into the great vessels with each heart beat.","examples":[{"sentence":"The ballistocardiogram showed irregularities in the patient's cardiac function.","translation":"その心臓弾動図は、患者の心機能の異常を示していた。"}],"collocations":["record a ballistocardiogram","analyze a ballistocardiogram"],"synonyms":["BCG (abbreviation)"],"antonyms":[]},{"part_of_speech":"noun","definition":"心臓弾動計","english_definition":"An instrument for measuring the forces of cardiac ejection.","examples":[{"sentence":"The ballistocardiogram machine was used to assess the patient's heart function.","translation":"心臓弾動計は、患者の心機能を評価するために使用された。"}],"collocations":["use a ballistocardiogram","calibrate a ballistocardiogram"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'ballisto-' (relating to throwing or projection), 'cardio-' (relating to the heart), and '-gram' (a record).","priority":"★★☆"},"pronunciation":{"ipa":"/bəˌlɪstəˈkɑːrdiəˌɡræm/","syllables":"bal-lis-to-car-di-o-gram"},"inflection":{"noun_plural":"ballistocardiograms"},"usage_notes":{"explanation":"A ballistocardiogram (BCG) is a non-invasive diagnostic test that measures the repetitive motions of the human body caused by the ejection of blood from the heart. While historically significant, it is less commonly used today due to the advent of more precise cardiac imaging techniques. It can refer to either the graphical record or the instrument used to create it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor ordered a ballistocardiogram for my brain.","correct":"✓ The doctor ordered a ballistocardiogram for my heart.","note":"A ballistocardiogram is specifically related to the heart, not the brain."}],"priority":"★☆☆"},"related_words":{"derivatives":["ballistocardiography (noun): the process of recording a ballistocardiogram"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ballistocardiogram' is a highly specialized medical term referring to a graphical record or instrument used to measure the body's movements caused by the heart's ejection of blood. Due to advancements in medical technology, this technique is now less commonly used in clinical practice. Understanding this term requires a background in medical terminology and physiology."},"example_sentences":[{"sentence":"The early ballistocardiogram devices were quite rudimentary compared to modern cardiac imaging technology.","translation":"初期の心臓弾動計装置は、現代の心臓画像技術と比較して非常に原始的だった。","type":"noun","meaning_category":"instrument"},{"sentence":"Analysis of the ballistocardiogram revealed subtle changes in the patient's heart function.","translation":"心臓弾動図の分析により、患者の心機能のわずかな変化が明らかになった。","type":"noun","meaning_category":"graphical representation"}]}