{"word":"Rotameter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"浮子式流量計、面積流量計","english_definition":"A flowmeter consisting of a tapered tube and a float, where the float rises in the tube as the flow increases, providing a direct reading of the flow rate.","examples":[{"sentence":"The laboratory used a rotameter to measure the gas flow rate.","translation":"その研究室では、気体の流量を測定するためにロータメーターを使用した。"},{"sentence":"Rotameters are commonly used in industrial applications for their simplicity and reliability.","translation":"ロータメーターは、その単純さと信頼性から、産業用途で一般的に使用されている。"}],"collocations":["measure flow rate with a rotameter (ロータメーターで流量を測定する)","calibrate a rotameter (ロータメーターを校正する)","install a rotameter (ロータメーターを設置する)","read a rotameter (ロータメーターを読む)"],"synonyms":["variable area meter","tapered tube flowmeter"],"antonyms":[]}],"etymology":{"value":"The term 'Rotameter' is a portmanteau of 'rota' (referring to the rotation of the float in some designs) and 'meter' (measuring instrument).","priority":"★★★"},"pronunciation":{"ipa":"/ˈroʊtəˌmiːtər/","syllables":"ro-ta-me-ter"},"inflection":{"noun_plural":"Rotameters"},"usage_notes":{"explanation":"A rotameter is a type of flowmeter used to measure the volumetric flow rate of liquids and gases. It consists of a tapered tube, typically made of glass or plastic, and a 'float' (also known as a 'bob' or 'rotor') made of metal, glass, or plastic. The fluid flow causes the float to rise in the tube. The height at which the float stabilizes is directly proportional to the flow rate. Rotameters are simple, relatively inexpensive, and widely used in various industries due to their ease of installation and operation. They provide a direct, visual reading of the flow rate without requiring external power. However, they are less accurate than some other types of flowmeters and are sensitive to changes in fluid density and viscosity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The rotameter measure the pressure of the fluid.","correct":"✓ The rotameter measures the flow rate of the fluid.","note":"Rotameters measure flow rate, not pressure."},{"incorrect":"✗ Rotameters are very accurate in every condition.","correct":"✓ Rotameters are relatively accurate under stable conditions.","note":"Rotameters are less accurate than some other flowmeters, especially when fluid properties change."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["flowmeter","flow rate","variable area","tapered tube","float","bob","rotor","calibration","viscosity","density"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1 (Technical vocabulary)","frequency_google_ngram":"Low frequency (specialized technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A 'Rotameter' is a specialized term used in engineering and industrial contexts. It refers to a specific type of flowmeter that measures the flow rate of fluids (liquids or gases). Understanding this term requires a certain level of technical knowledge, as it is not commonly used in everyday language. The device works based on the principle of variable area measurement, where a float rises in a tapered tube in proportion to the flow rate. The position of the float indicates the flow rate on a calibrated scale.","priority":"★★☆"},"example_sentences":[{"sentence":"The engineer checked the rotameter reading to ensure the proper flow of coolant.","translation":"エンジニアは、冷却材の適切な流れを確保するために、ロータメーターの読み取り値を確認した。","type":"example","meaning_category":"Usage in engineering"},{"sentence":"The chemical plant uses rotameters to monitor the flow of various chemicals in the process.","translation":"その化学プラントでは、プロセス内のさまざまな化学物質の流れを監視するためにロータメーターを使用している。","type":"example","meaning_category":"Industrial application"},{"sentence":"The laboratory experiment required precise control of gas flow, so a calibrated rotameter was used.","translation":"その実験室の実験では、気体の流れを正確に制御する必要があったため、校正されたロータメーターが使用された。","type":"example","meaning_category":"Laboratory setting"}]}