{"word":"floriography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"花言葉、花の象徴的意味","english_definition":"the language of flowers; the symbolic meanings of flowers.","examples":[{"sentence":"In the Victorian era, floriography was a popular way to send secret messages.","translation":"ビクトリア時代には、花言葉は秘密のメッセージを送る一般的な方法でした。"},{"sentence":"Different cultures have different interpretations of floriography.","translation":"文化によって、花言葉の解釈は異なります。"},{"sentence":"She used floriography to express her feelings in the bouquet.","translation":"彼女は花言葉を使って、花束に自分の気持ちを表現しました。"}],"collocations":["language of flowers","symbolic meaning of flowers","Victorian floriography","interpret floriography","send messages with floriography"],"synonyms":["language of flowers","flower symbolism","floral code","floral language"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'flos' (flower) and the Greek word 'graphia' (writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌflɔːrioʊˈɡræfi/","syllables":"flo-ri-o-gra-phy"},"inflection":{"noun_plural":"floriographies"},"usage_notes":{"explanation":"Floriography is a system of communication through the use or arrangement of flowers. It was particularly popular in the Victorian era, where societal restrictions often limited open expression. Flowers were assigned specific meanings, allowing individuals to convey sentiments that they could not express verbally or in writing. The meanings of flowers can vary across cultures and time periods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I sent her a floriography of roses.","correct":"✓ I sent her a bouquet using floriography.","note":"Floriography is the system or language itself, not the bouquet. You use floriography to create a bouquet."},{"incorrect":"✗ Floriography is a type of flower.","correct":"✓ Floriography is the language of flowers.","note":"Floriography is not a type of flower, but a system of communication using flowers."}],"priority":"★☆☆"},"related_words":{"derivatives":["floriographic (adjective)"],"phrasal_verbs":[],"related_concepts":["symbolism","Victorian era","flower arrangement","bouquet","floral design"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Floriography' refers to the practice of communicating through the arrangement and selection of flowers, where each flower carries a symbolic meaning. This practice was particularly popular in the Victorian era as a means of expressing emotions and sentiments that were otherwise difficult to convey openly. The term itself is relatively uncommon in everyday language, but understanding it provides insight into historical communication methods and cultural practices."},"example_sentences":[{"sentence":"She studied floriography to better understand the hidden meanings in Victorian literature.","translation":"彼女はビクトリア朝文学に隠された意味をよりよく理解するために、花言葉を研究しました。","type":"general","meaning_category":"花言葉の研究"},{"sentence":"The bride chose her wedding flowers carefully, considering their floriography.","translation":"花嫁は結婚式の花を、花言葉を考慮して慎重に選びました。","type":"cultural","meaning_category":"文化的な意味合い"},{"sentence":"Using floriography, he sent her a bouquet that confessed his love.","translation":"彼は花言葉を使って、彼女に愛を告白する花束を送りました。","type":"romantic","meaning_category":"ロマンチックな表現"}]}