{"word":"rediversion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(法律、計画などにおける)再転換、方向転換","english_definition":"The act of diverting again or in a different direction; a second or subsequent diversion.","examples":[{"sentence":"The project required a rediversion of resources to address the unexpected challenges.","translation":"そのプロジェクトでは、予期せぬ課題に対処するために、資源の再転換が必要だった。"},{"sentence":"The rediversion of the river's course was planned to mitigate the effects of the flood.","translation":"洪水の被害を軽減するために、川の流れの再転換が計画された。"}],"collocations":["resource rediversion (資源の再転換)","river rediversion (川の再転換)","traffic rediversion (交通の再転換)"],"synonyms":["rechanneling","rerouting","reallocation"],"antonyms":["stabilization","continuation"]}],"etymology":{"value":"The word \"rediversion\" is formed by adding the prefix \"re-\" (meaning again or anew) to the word \"diversion.\" Diversion itself comes from the Latin word \"divertere,\" meaning to turn aside.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːdaɪˈvɜːrʒən/","syllables":"re-di-ver-sion"},"inflection":{"noun_plural":"rediversions"},"usage_notes":{"explanation":"\"Rediversion\" is used to describe the act of changing the course or direction of something that has already been diverted once. It often implies a change in plans or strategies due to unforeseen circumstances or new priorities. The term is commonly used in legal, engineering, and project management contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rediversion was made sudden.","correct":"✓ The rediversion was made suddenly.","note":"Use the adverb \"suddenly\" to describe how the rediversion was done, not the adjective \"sudden.\""},{"incorrect":"✗ They rediversion the funds.","correct":"✓ They rediverted the funds.","note":"When used as a verb, the correct form is \"rediverted\" (past tense)."}],"priority":"★★☆"},"related_words":{"derivatives":["redivert (verb): to divert again","diversion (noun): the act of diverting or turning aside","divert (verb): to turn aside from a course or direction"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rediversion\" is a relatively uncommon term, generally used in technical or formal contexts. It refers to the act of changing the direction of something that has already been diverted once. Understanding the prefix \"re-\" and the root word \"diversion\" can help in comprehending its meaning. This word is more likely to be encountered in specialized fields such as engineering, law, or project management.","priority":"★★☆"},"example_sentences":[{"sentence":"The city council approved the rediversion of traffic to alleviate congestion in the downtown area.","translation":"市議会は、都心部の交通渋滞を緩和するために、交通の再転換を承認した。","type":"noun","meaning_category":"交通"},{"sentence":"Due to the budget cuts, there was a rediversion of funds from research to infrastructure projects.","translation":"予算削減のため、研究費からインフラプロジェクトへの資金の再転換があった。","type":"noun","meaning_category":"資金"},{"sentence":"The engineer proposed a rediversion of the stream to protect the newly constructed buildings.","translation":"エンジニアは、新しく建設された建物を保護するために、小川の再転換を提案した。","type":"noun","meaning_category":"川の流れ"}]}