{"word":"illustrators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イラストレーターたち（複数形）","english_definition":"plural of illustrator: a person who draws or creates pictures for books, magazines, or other media.","examples":[{"sentence":"The book features the work of several talented illustrators.","translation":"その本には、数人の才能あるイラストレーターの作品が掲載されています。"},{"sentence":"Many children's books rely heavily on the skill of their illustrators.","translation":"多くの児童書は、イラストレーターの腕に大きく依存しています。"}],"collocations":["children's book illustrators (児童書イラストレーター)","freelance illustrators (フリーランスのイラストレーター)","talented illustrators (才能のあるイラストレーター)"],"synonyms":["artists","designers","graphic artists","cartoonists"],"antonyms":[],"related_words":["illustrator","illustration","illustrate"]}],"etymology":{"value":"The word 'illustrators' is simply the plural form of 'illustrator'. 'Illustrator' comes from the verb 'illustrate', which originates from the Latin word 'illustrare', meaning 'to light up, illuminate, make clear'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪləstreɪtərz/","syllables":"il-lus-tra-tors"},"inflection":{"noun_plural":"illustrators"},"usage_notes":{"explanation":"'Illustrators' refers to multiple people who create illustrations. Illustrations are drawings or pictures that accompany text or stand alone as artwork. The term is commonly used in the context of books, magazines, advertising, and other media where visual elements are needed to enhance or complement the content.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The illustrator are very skilled.","correct":"✓ The illustrators are very skilled.","note":"Since 'illustrators' is plural, the verb should also be plural ('are' instead of 'is')."},{"incorrect":"✗ She is one of the illustrator.","correct":"✓ She is one of the illustrators.","note":"When using 'one of', the noun that follows should be plural."}],"priority":"★★☆"},"related_words":{"derivatives":["illustrate (verb: to explain or make clear using examples, charts, pictures, etc.)","illustration (noun: a picture or diagram that explains or decorates something)","illustrative (adjective: serving as an example or explanation)"],"related_occupations":["graphic designer","animator","cartoonist","comic book artist"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"relatively low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'illustrators' is the plural form of 'illustrator', which refers to people who create illustrations. Illustrations are drawings or pictures that are used to explain or decorate something, often in books or magazines. The word is not very common in everyday conversation, but it is frequently used in contexts related to art, publishing, and design. Understanding the word requires a familiarity with the concept of illustration and the role of artists who create them."},"example_sentences":[{"sentence":"The exhibition showcased the work of several renowned children's book illustrators.","translation":"その展覧会では、著名な児童書イラストレーターたちの作品が展示されました。","type":"general"},{"sentence":"Many magazines employ illustrators to create visuals for their articles.","translation":"多くの雑誌が、記事のビジュアルを作成するためにイラストレーターを雇用しています。","type":"general"},{"sentence":"The illustrators used a variety of techniques, including watercolor and digital art.","translation":"イラストレーターたちは、水彩やデジタルアートなど、さまざまな技法を用いました。","type":"general"}]}