{"word":"ligand-responsive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リガンド応答性の、リガンドに応答する","english_definition":"Capable of responding to a ligand; exhibiting a change in activity or conformation upon binding to a ligand.","examples":[{"sentence":"The promoter region contains ligand-responsive elements.","translation":"そのプロモーター領域はリガンド応答性エレメントを含んでいる。"},{"sentence":"This protein is ligand-responsive and changes its conformation upon ligand binding.","translation":"このタンパク質はリガンド応答性であり、リガンド結合時にその立体構造を変化させる。"}],"collocations":["ligand-responsive element","ligand-responsive promoter","ligand-responsive gene","ligand-responsive domain"],"synonyms":["ligand-sensitive","ligand-activated","ligand-dependent"],"antonyms":["ligand-independent","constitutively active"]},{"part_of_speech":"adjective","definition":"(より広義に)特定の分子または刺激に応答する","english_definition":"(More broadly) Responsive to a specific molecule or stimulus.","examples":[{"sentence":"The cell is ligand-responsive and changes its behavior accordingly.","translation":"その細胞はリガンド応答性であり、それに応じて行動を変化させる。"}],"collocations":[],"synonyms":["stimulus-responsive","molecule-responsive"],"antonyms":["stimulus-independent","molecule-independent"]}],"etymology":{"value":"Formed by combining 'ligand' (a molecule that binds to another molecule) and 'responsive' (reacting readily or favorably).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈlɪɡənd rɪˈspɒnsɪv/","syllables":"lig-and re-spon-sive"},"inflection":{"notes":"Does not inflect (no plural form, comparative, or superlative)."},"usage_notes":{"explanation":"'Ligand-responsive' is primarily used in biochemistry, molecular biology, and pharmacology to describe molecules, genes, or systems that alter their behavior or activity when a ligand binds to them. It indicates a specific interaction and subsequent response. The term emphasizes the ligand's role as a trigger for the observed change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell is responsive to the ligand.","correct":"✓ The cell is ligand-responsive.","note":"While 'responsive to the ligand' is grammatically correct, 'ligand-responsive' is a more concise and commonly used term, especially in scientific writing."}],"priority":"☆☆☆"},"related_words":{"derivatives":["ligand","responsive","responsiveness"],"phrases":["ligand binding","signal transduction","receptor activation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in specialized scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Ligand-responsive' is a technical term used in scientific contexts, particularly in biology and chemistry. It describes something that changes its behavior or function when it interacts with a ligand (a molecule that binds to a receptor). Understanding this term requires a background in these scientific fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The expression of this gene is ligand-responsive, increasing significantly upon exposure to the hormone.","translation":"この遺伝子の発現はリガンド応答性であり、ホルモンにさらされると大幅に増加する。","type":"general","meaning_category":"リガンドに応答する"},{"sentence":"We designed a ligand-responsive hydrogel for controlled drug release.","translation":"制御された薬物放出のために、リガンド応答性ハイドロゲルを設計した。","type":"general","meaning_category":"リガンドに応答する"}]}