{"word":"reoiling","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"再注油する、再び油を差す","english_definition":"The act of applying oil again, typically to machinery or equipment, to lubricate and reduce friction.","examples":[{"sentence":"The technician recommended reoiling the gears every six months.","translation":"技術者は、6ヶ月ごとにギアに再注油することを推奨しました。"},{"sentence":"Reoiling the chain regularly will extend its lifespan.","translation":"チェーンに定期的に再注油することで、寿命を延ばすことができます。"},{"sentence":"After cleaning the machine, be sure to reoil all the moving parts.","translation":"機械を清掃した後、必ずすべての可動部に再注油してください。"}],"collocations":["reoiling gears","reoiling a chain","regular reoiling","preventative reoiling"],"synonyms":["relubricating","re-greasing"],"antonyms":["degreasing","drying out"]}],"etymology":{"value":"The word 'reoiling' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'oiling' (the act of applying oil).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɔɪlɪŋ/","syllables":"re-oil-ing"},"inflection":{"verb_forms":{"present_simple":["reoil","reoils"],"past_simple":"reoiled","past_participle":"reoiled","present_participle":"reoiling"}},"usage_notes":{"explanation":"'Reoiling' is a straightforward term referring to the process of applying oil again. It's commonly used in contexts related to machinery, vehicles, and equipment maintenance. The purpose of reoiling is to maintain proper lubrication, reduce friction, and prevent wear and tear on moving parts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am reoiling with water.","correct":"✓ I am reoiling with oil.","note":"Reoiling always involves the application of oil or a similar lubricant, not water."},{"incorrect":"✗ Reoiling is not necessary. I cleaned it.","correct":"✓ Cleaning is not enough; reoiling is also necessary.","note":"Cleaning removes dirt, but reoiling provides lubrication, which are two different aspects of maintenance."}],"priority":"★★☆"},"related_words":{"derivatives":["oil","oiling","re-","lubricate","lubrication"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Reoiling' is a technical term, mostly used in contexts involving machinery, maintenance, and engineering. Understanding the term requires familiarity with basic mechanical concepts and maintenance procedures. While the word itself is not complex, its usage is typically confined to specific professional or hobbyist domains."},"example_sentences":[{"sentence":"The owner's manual specifies reoiling the motor every 50 hours of operation.","translation":"取扱説明書には、モーターの再注油を50時間運転ごとに行うように指定されています。","type":"verb","meaning_category":"再注油する"},{"sentence":"Proper reoiling is crucial for the longevity of the machine.","translation":"適切な再注油は、機械の寿命にとって非常に重要です。","type":"noun (gerund)","meaning_category":"再注油すること"}]}