{"word":"solid-injection","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"固体射出（成形）","english_definition":"A manufacturing process where a solid material, usually a plastic or metal, is heated to a molten state and injected into a mold cavity to create a solid part.","examples":[{"sentence":"Solid-injection is a common method for producing plastic parts.","translation":"固体射出は、プラスチック部品を製造するための一般的な方法です。"},{"sentence":"The company uses solid-injection to create complex shapes with high precision.","translation":"その会社は、固体射出を使用して、高精度で複雑な形状を作成します。"}],"collocations":["solid-injection molding","solid-injection machine","solid-injection process"],"synonyms":["injection molding","plastic injection","metal injection molding"],"antonyms":[]}],"etymology":{"value":"The term 'solid-injection' is derived from the process of injecting a solid material (typically in pellet or granular form) that is melted into a liquid state before being injected into a mold.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɒlɪd ɪnˈdʒɛkʃən/","syllables":"sol-id in-jec-tion"},"inflection":{"notes":"This word is a noun and does not have different inflections."},"usage_notes":{"explanation":"'Solid-injection' is often used interchangeably with 'injection molding,' although 'injection molding' is the more common and broader term. It specifically refers to the process where the starting material is a solid that is melted before injection.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He used solid injection to paint the car.","correct":"✓ He used spray painting to paint the car.","note":"Solid-injection is for molding parts, not for painting."}],"priority":"N/A"},"related_words":{"derivatives":["injection molding","molding","plastic injection","metal injection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Solid-injection' refers to a manufacturing process where solid materials are melted and injected into a mold to create parts. It's a technical term often used in engineering and manufacturing contexts. While similar to 'injection molding,' it emphasizes the solid starting material. Understanding this term requires familiarity with manufacturing processes."},"example_sentences":[{"sentence":"The use of solid-injection allows for the creation of intricate designs.","translation":"固体射出を使用すると、複雑な設計を作成できます。","type":"noun","meaning_category":"manufacturing"},{"sentence":"The solid-injection machine is capable of producing thousands of parts per hour.","translation":"その固体射出成形機は、1時間あたり数千個の部品を生産できます。","type":"noun","meaning_category":"equipment"}]}