{"word":"dietetic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"栄養学の、食事療法の、ダイエットの","english_definition":"relating to diet or nutrition; designed for or relating to a special diet, especially for medical reasons or weight control.","examples":[{"sentence":"Dietetic foods are often lower in calories.","translation":"ダイエット食品はカロリーが低いことが多いです。"},{"sentence":"The doctor recommended a dietetic plan for her diabetes.","translation":"医者は彼女の糖尿病のために食事療法を勧めました。"},{"sentence":"This is a dietetic product, suitable for people watching their weight.","translation":"これはダイエット食品で、体重を気にしている人に適しています。"}],"collocations":["dietetic food","dietetic plan","dietetic product","dietetic advice","dietetic needs"],"synonyms":["nutritional","dietary","healthful","wholesome"],"antonyms":["unhealthy","non-dietetic"]},{"part_of_speech":"noun","definition":"ダイエット食品、栄養補助食品","english_definition":"a food or drink specially designed for people on a particular diet.","examples":[{"sentence":"The dietetic section of the supermarket has expanded.","translation":"スーパーマーケットのダイエット食品コーナーは拡大しました。"},{"sentence":"She bought several dietetics to help her lose weight.","translation":"彼女は体重を減らすためにいくつかのダイエット食品を買いました。"}],"collocations":["dietetics section","dietetics industry"],"synonyms":["diet food","health food","nutritional supplement"],"antonyms":["regular food"]}],"etymology":{"value":"From the Greek 'diaitetikos', meaning 'relating to a regimen or way of life', from 'diaita' meaning 'way of life, diet, nourishment'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪ.əˈtet.ɪk/","syllables":"di-e-tet-ic"},"inflection":{"notes":"The adjective form does not change. The noun form can be pluralized as 'dietetics'."},"usage_notes":{"explanation":"'Dietetic' refers to anything related to diet, nutrition, or special dietary needs. As an adjective, it describes foods, plans, or advice designed for specific dietary requirements, often for medical reasons or weight management. As a noun (often in the plural 'dietetics'), it refers to the study of diet and nutrition or to dietetic foods themselves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a dietetic.","correct":"✓ She is a dietitian.","note":"'Dietetic' is an adjective or a noun referring to diet-related products. A person who is an expert in diet and nutrition is a 'dietitian'."},{"incorrect":"✗ I need to buy some dietetics food.","correct":"✓ I need to buy some dietetic food.","note":"'Dietetics' (plural noun) refers to the study or science of diet and nutrition, or a range of dietetic products. 'Dietetic' (adjective) is used to describe the food itself."}],"priority":"★★☆"},"related_words":{"derivatives":["dietitian","dietetics","diet"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Dietetic' is a word related to diet and nutrition. It's often used to describe foods or plans that are designed for specific dietary needs, such as weight loss or managing a medical condition like diabetes. It can also refer to the study of diet and nutrition. It's a more specialized term than just 'diet' and is often used in medical or health-related contexts."},"example_sentences":[{"sentence":"The hospital provides dietetic services for patients with specific nutritional needs.","translation":"その病院は、特定の栄養ニーズを持つ患者に食事療法サービスを提供しています。","type":"adjective","meaning_category":"食事療法の"},{"sentence":"She is studying dietetics to become a registered dietitian.","translation":"彼女は登録栄養士になるために栄養学を学んでいます。","type":"noun","meaning_category":"栄養学"},{"sentence":"The dietetic cookies were surprisingly tasty.","translation":"そのダイエットクッキーは驚くほど美味しかった。","type":"adjective","meaning_category":"ダイエットの"}]}