{"word":"dead-colored","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(絵画などで)下塗りの、色彩の乏しい、生気のない","english_definition":"(of a painting) having the colors of the underpainting; lacking vivid color; lifeless.","examples":[{"sentence":"The painting was dead-colored and lacked vibrancy.","translation":"その絵は色彩が乏しく、活気がなかった。"},{"sentence":"He used a dead-colored palette for the underpainting.","translation":"彼は下塗りに色彩の乏しいパレットを使った。"}],"collocations":["dead-colored painting","dead-colored palette"],"synonyms":["underpainted","colorless","lifeless","dull","muted"],"antonyms":["vibrant","colorful","lively"]}],"etymology":{"value":"'Dead' + 'colored'. The term likely originated in art terminology to describe the initial layers of a painting that lack the final, vibrant colors.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛdˌkʌlərd/","syllables":"dead-col-ored"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'dead-colored' is primarily used in the context of painting and art. It refers to the initial layers of paint applied to a canvas, which are typically muted or lacking in vibrant colors. It can also describe a painting that lacks vividness or appears lifeless in its color palette.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flowers were dead-colored in the garden.","correct":"✓ The flowers were faded in the garden.","note":"'Dead-colored' is specific to art and painting. For describing the color of flowers or other natural objects, use terms like 'faded' or 'dull' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["dead color (noun)"],"phrasal_verbs":[],"related_terms":["underpainting","grisaille","palette","color theory"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in art-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dead-colored' is a technical term primarily used in art, specifically painting. It describes a state where the colors are muted, dull, or like an underpainting before the final, vibrant colors are applied. It can also describe a finished piece that lacks vividness. This term is not commonly used in everyday conversation. Understanding requires knowledge of art terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist began with a dead-colored underpainting to establish the composition.","translation":"画家は構図を確立するために、色彩の乏しい下塗りから始めた。","type":"general","meaning_category":"painting technique"},{"sentence":"The mural had a dead-colored appearance due to the lack of sunlight.","translation":"その壁画は日光不足のため、生気のない色合いだった。","type":"general","meaning_category":"lack of vibrancy"}]}