{"word":"Neovitalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新生命論：生命現象を、物理的・化学的な法則だけでは説明できない、生命特有の力（生命力）の存在によって説明しようとする思想。20世紀初頭に登場し、実験的な証拠の欠如から、次第に衰退した。","english_definition":"A philosophical doctrine that attempts to explain life by assuming a special non-physical force or principle (a 'vital force') that is distinct from purely chemical and physical forces. It arose in the early 20th century but declined due to lack of experimental evidence.","examples":[{"sentence":"Neovitalism was a significant biological theory in the early 20th century.","translation":"新生命論は20世紀初頭に重要な生物学的理論でした。"},{"sentence":"Hans Driesch was a prominent proponent of Neovitalism.","translation":"ハンス・ドリーシュは新生命論の著名な提唱者でした。"}],"collocations":["vital force (生命力)","entelechy (エンテレケイア - 目的因)","biological theory (生物学的理論)","philosophical doctrine (哲学的教義)"],"synonyms":["vitalism"],"antonyms":["mechanism","reductionism","materialism"]}],"etymology":{"value":"\"Neo-\"（新しい）+ \"vitalism\"（生命論）から構成される。生命論（vitalism）は、生命現象を物理化学的な法則だけでは説明できないとする思想であり、新生命論は、20世紀初頭に、生命論を再評価・発展させようとする動きの中で生まれた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊˈvaɪtəlɪzəm/","syllables":"ne-o-vi-tal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Neovitalism\"は、科学史や哲学の文脈で用いられる専門用語であり、日常会話ではほとんど使用されない。関連する概念として、生命力（vital force）、エンテレケイア（entelechy）、目的因（teleology）などがある。現代生物学では、生命現象は物理化学的な法則に基づいて説明されると考えられており、新生命論は一般的に支持されていない。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Neovitalism is the mainstream view in modern biology.","correct":"✓ Neovitalism is not the mainstream view in modern biology.","note":"新生命論は、現代生物学の主流な考え方ではありません。"},{"incorrect":"✗ Neovitalism explains life solely through physical laws.","correct":"✓ Neovitalism explains life through a vital force, not solely through physical laws.","note":"新生命論は、物理法則だけでなく、生命力によって生命を説明しようとします。"}],"priority":"★★☆"},"related_words":{"derivatives":["neovitalist (新生命論者)"],"related_terms":["vitalism","mechanism","reductionism","entelechy","teleology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Neovitalism**（新生命論）」は、生命現象を物理や化学の法則だけでは説明できないと考え、特別な「生命力」の存在を仮定する哲学的な考え方です。20世紀初頭に一時的に支持されましたが、実験的な証拠がないため、現代の科学ではほとんど受け入れられていません。この言葉は、科学史や哲学の議論でのみ使われる専門用語です。関連する言葉として、「vitalism（生命論）」、「mechanism（機械論）」、「reductionism（還元主義）」などがあります。"},"example_sentences":[{"sentence":"The theory of Neovitalism proposed that a non-physical 'vital force' was responsible for the unique characteristics of living organisms.","translation":"新生命論の理論は、非物理的な「生命力」が生きた有機体の独特な特徴の原因であると提唱しました。","type":"definition","meaning_category":"定義"},{"sentence":"Although Neovitalism was influential in the early 1900s, it eventually lost favor due to the rise of molecular biology and genetics.","translation":"新生命論は1900年代初頭に影響力がありましたが、分子生物学と遺伝学の台頭により、最終的には支持を失いました。","type":"historical context","meaning_category":"歴史的背景"},{"sentence":"Critics of Neovitalism argued that it was not a scientific theory because it could not be tested or falsified.","translation":"新生命論の批判者たちは、それが検証または反証できないため、科学的理論ではないと主張しました。","type":"criticism","meaning_category":"批判"}]}