{"word":"apometabolism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"代謝産物が細胞外に排出される代謝過程","english_definition":"A metabolic process in which metabolites are released outside the cell.","examples":[{"sentence":"Apometabolism plays a crucial role in the detoxification of certain compounds.","translation":"アポメタボリズムは、特定の化合物の解毒において重要な役割を果たします。"}],"collocations":[],"synonyms":["excretion","secretion"],"antonyms":["endocytosis","uptake"]}],"etymology":{"value":"apo- (離れて) + metabolism (代謝)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæpoʊməˈtæbəlɪzəm/","syllables":"a-po-me-tab-o-lism"},"inflection":{"noun_plural":"apometabolisms"},"usage_notes":{"explanation":"Apometabolism is a specialized term primarily used in biochemistry and cell biology. It refers to the process where the products of metabolism are actively transported out of the cell. This is important for removing waste products, signaling molecules, or other compounds that are no longer needed within the cell.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Apometabolism is the same as catabolism.","correct":"Apometabolism is the process of exporting metabolites, while catabolism is the breakdown of molecules.","note":"Apometabolism involves the export of metabolites, whereas catabolism is the breakdown of molecules within the cell."}],"priority":"★★☆"},"related_words":{"derivatives":["apometabolic (adjective)"],"related_terms":["metabolism","catabolism","anabolism","excretion","secretion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apometabolism' is a highly specialized term used in advanced biology and biochemistry. It describes the process of a cell releasing metabolites (small molecules produced during metabolism) outside of its boundaries. This term is not commonly encountered outside of scientific research and advanced studies in related fields. Understanding requires a strong foundation in cellular processes and metabolic pathways."},"example_sentences":[{"sentence":"The study investigated the role of apometabolism in drug resistance.","translation":"その研究は、薬物耐性におけるアポメタボリズムの役割を調査しました。","type":"scientific","meaning_category":"metabolic process"},{"sentence":"Apometabolism is essential for maintaining cellular homeostasis.","translation":"アポメタボリズムは、細胞の恒常性を維持するために不可欠です。","type":"biological","meaning_category":"cellular function"}]}