{"word":"prisonful","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(非標準)刑務所がいっぱいになるほどの量、刑務所に収容できるほどの人数","english_definition":"(nonstandard) As many as a prison can hold.","examples":[{"sentence":"A prisonful of inmates rioted.","translation":"刑務所収容人数分の囚人が暴動を起こした。"},{"sentence":"The new law could result in a prisonful of offenders.","translation":"新しい法律は、刑務所がいっぱいになるほどの違反者を生み出す可能性がある。"}],"collocations":["a prisonful of inmates","a prisonful of offenders"],"synonyms":["jailful"],"antonyms":[]}],"etymology":{"value":"'prison' + '-ful'. Indicates a quantity that would fill a prison.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɪzənfʊl/","syllables":"pri-son-ful"},"inflection":{"noun_plural":"prisonfuls"},"usage_notes":{"explanation":"'Prisonful' is a nonstandard and relatively rare word. It's used to describe a large quantity or number equivalent to what a prison can contain. It is often used figuratively to emphasize the large number of people or things.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He ate a plateful prisonful of food.","correct":"✓ He ate a plateful of food.","note":"'Prisonful' refers to the capacity of a prison, not a plate. Use 'plateful' to describe the contents of a plate."}],"priority":"★☆☆"},"related_words":{"derivatives":["prison","-ful"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'prisonful' is a non-standard term, meaning it is not commonly used in formal or standard English. Its meaning is fairly straightforward, referring to the amount or number that a prison can hold. Due to its rarity, it is more likely to be encountered in creative writing or informal contexts. Understanding the base word 'prison' and the suffix '-ful' is key to deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The crackdown on petty crime led to a prisonful of minor offenders.","translation":"軽犯罪の取り締まり強化により、刑務所には多くの軽犯罪者が収容されることになった。","type":"noun","meaning_category":"quantity"},{"sentence":"The overcrowded facility was holding a prisonful of people beyond its intended capacity.","translation":"過密状態の施設は、本来の収容能力を超えて刑務所がいっぱいになるほどの人々を収容していた。","type":"noun","meaning_category":"capacity"}]}