{"word":"snack-enthusiastic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"スナック菓子に熱心な、スナック菓子好きの","english_definition":"Having a strong interest in or enthusiasm for snack foods.","examples":[{"sentence":"My friend is very snack-enthusiastic and always has a variety of treats on hand.","translation":"私の友人はとてもスナック菓子好きで、いつもいろいろなお菓子を手元に用意しています。"},{"sentence":"A snack-enthusiastic person might enjoy trying new and unique snack flavors.","translation":"スナック菓子好きの人は、新しくてユニークなスナックの味を試すのを楽しむかもしれません。"}],"collocations":["snack-enthusiastic friend","snack-enthusiastic foodie","snack-enthusiastic colleague"],"synonyms":["snack-loving","snack-obsessed","snack-fanatic","fond of snacks","keen on snacks"],"antonyms":["snack-averse","not interested in snacks","dislikes snacks"]},{"part_of_speech":"adjective","definition":"スナック菓子に熱意を燃やす、スナック菓子に情熱的な","english_definition":"Showing great passion or enthusiasm for snack foods.","examples":[{"sentence":"The snack-enthusiastic blogger reviewed dozens of different chips.","translation":"そのスナック菓子に情熱的なブロガーは、数十種類の異なるチップスをレビューしました。"},{"sentence":"She gave a snack-enthusiastic presentation on the history of potato chips.","translation":"彼女はポテトチップスの歴史について、スナック菓子への熱意に満ちたプレゼンテーションを行いました。"}],"collocations":["snack-enthusiastic blogger","snack-enthusiastic presentation","snack-enthusiastic review"],"synonyms":["passionate about snacks","enthusiastic about snacks","devoted to snacks","zealous about snacks"],"antonyms":["indifferent to snacks","apathetic about snacks"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"snack\" (a small amount of food eaten between meals) and \"enthusiastic\" (having or showing great excitement and interest).","priority":"low"},"pronunciation":{"ipa":"/ˈsnæk ɪnˌθuːziˈæstɪk/","syllables":"snack-en-thu-si-as-tic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more snack-enthusiastic, most snack-enthusiastic), although these are less common."},"usage_notes":{"explanation":"The term \"snack-enthusiastic\" is relatively informal and is used to describe someone who has a strong positive interest in snack foods. It implies a level of excitement or passion beyond simply liking snacks. It is often used humorously or affectionately.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He is a snack enthusiastic.","correct":"He is a snack-enthusiastic person.","note":"The adjective 'snack-enthusiastic' needs to modify a noun, such as 'person', 'eater', or similar."},{"incorrect":"She snack-enthusiastically eats chips.","correct":"She is snack-enthusiastic and eats chips.","note":"'Snack-enthusiastically' would be an adverb, but the intended meaning is better conveyed by using 'snack-enthusiastic' as an adjective to describe the person."}],"priority":"low"},"related_words":{"derivatives":["snack","enthusiastic","enthusiasm"],"phrases":["snack lover","foodie","enthusiast"],"related_concepts":["food culture","snacking habits","culinary interests"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a relatively uncommon and informal term.","priority":"low"},"readability_explanation":{"level":"C1","text":"\"Snack-enthusiastic\" is a compound adjective that describes someone who is very interested in or passionate about snacks. Because it's a relatively uncommon and informal term, it requires a good understanding of both \"snack\" and \"enthusiastic\" to fully grasp its meaning. It's not typically found in formal writing but might appear in blogs, social media, or casual conversations about food."},"example_sentences":[{"sentence":"The snack-enthusiastic child always looked forward to recess for the treats.","translation":"そのスナック菓子好きの子供は、いつもおやつを楽しみに休み時間を待っていました。","type":"adjective","meaning_category":"スナック菓子好き"},{"sentence":"She wrote a snack-enthusiastic blog post about her favorite international candies.","translation":"彼女は好きな海外のお菓子について、スナック菓子への熱意にあふれたブログ記事を書きました。","type":"adjective","meaning_category":"スナック菓子に情熱的な"}]}