{"word":"Tenebrionidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ゴミムシダマシ科","english_definition":"The darkling beetles, a very large family of beetles.","examples":[{"sentence":"The Tenebrionidae family includes many species found in arid environments.","translation":"ゴミムシダマシ科には、乾燥した環境で見られる多くの種が含まれています。"}],"collocations":["Tenebrionidae beetles (ゴミムシダマシ科の甲虫)","Darkling beetles (ゴミムシダマシ)"],"synonyms":["darkling beetles"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'tenebrio', meaning 'darkling' or 'one that shuns the light', referring to the often dark coloration and nocturnal habits of many species in this family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛnɪˈbraɪənɪdiː/","syllables":"Te-ne-bri-o-ni-dae"},"inflection":{"noun_plural":"Tenebrionidae (科名のため複数形は通常使われません)"},"usage_notes":{"explanation":"'Tenebrionidae' refers to the scientific family name for darkling beetles. It is typically used in scientific contexts, such as in entomology or ecology. When discussing specific species, the genus and species names are used (e.g., *Eleodes armata*).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A Tenebrionidae is crawling on the wall.","correct":"✓ A tenebrionid is crawling on the wall.","note":"'Tenebrionidae' is the family name. To refer to a single beetle, use 'tenebrionid' (lowercase 't')."},{"incorrect":"✗ Tenebrionidaes are common in deserts.","correct":"✓ Tenebrionidae are common in deserts.","note":"'Tenebrionidae' is already plural as it represents the whole family. No additional plural marker is needed."}],"priority":"★★☆"},"related_words":{"derivatives":["tenebrionid (noun: a beetle belonging to the family Tenebrionidae)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific context)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tenebrionidae' is a scientific term used in biology, specifically in entomology, to refer to the family of darkling beetles. Understanding this term requires familiarity with biological classification systems. The term is primarily encountered in academic papers, field guides, or specialized websites dealing with insects. The pronunciation and spelling can be challenging for those unfamiliar with scientific nomenclature."},"example_sentences":[{"sentence":"*Eleodes obscura* is a member of the Tenebrionidae family.","translation":"*Eleodes obscura*はゴミムシダマシ科の一員です。","type":"noun","meaning_category":"分類学"},{"sentence":"Many Tenebrionidae species are well-adapted to desert environments.","translation":"多くのゴミムシダマシ科の種は砂漠環境によく適応しています。","type":"noun","meaning_category":"生態学"}]}