{"word":"Capitalism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"資本主義","english_definition":"an economic and political system in which a country's trade and industry are controlled by private owners for profit, rather than by the state.","examples":[{"sentence":"Capitalism encourages innovation and efficiency.","translation":"資本主義は、革新と効率を促進する。"},{"sentence":"The rise of capitalism transformed the global economy.","translation":"資本主義の台頭は、世界経済を変革した。"},{"sentence":"Critics of capitalism point to its inherent inequalities.","translation":"資本主義の批判者たちは、その内在的な不平等さを指摘する。"}],"collocations":["free market capitalism","state capitalism","global capitalism","finance capitalism","late-stage capitalism"],"synonyms":["free market economy","market economy","private enterprise"],"antonyms":["socialism","communism","planned economy"]}],"etymology":{"value":"The term 'capitalism' originated from 'capital,' referring to assets used for production. It emerged in the mid-19th century to describe an economic system characterized by private ownership, free markets, and profit-seeking.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæpɪtəlɪzəm/","syllables":"Ca-pi-tal-ism"},"inflection":{"noun_plural":"Capitalisms (rarely used)"},"usage_notes":{"explanation":"'Capitalism' refers to an economic system where private individuals or corporations own and control the means of production, and where prices are determined by supply and demand in a free market. It is often contrasted with socialism and communism, where the state plays a more central role in economic planning and resource allocation. The term can be used descriptively or critically, depending on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a capitalism.","correct":"✓ He supports capitalism.","note":"'Capitalism' is a system, not a person. Use 'capitalist' for a person who supports or benefits from capitalism."},{"incorrect":"✗ Capitalism is when the government controls everything.","correct":"✓ Capitalism is when private individuals and companies control the means of production.","note":"This is the opposite of capitalism. Government control is more characteristic of socialist or communist systems."}],"priority":"★★☆"},"related_words":{"derivatives":["capitalist (noun, adjective)","capitalistic (adjective)","decapitalization (noun)"],"phrases":["laissez-faire capitalism","venture capitalism","crony capitalism"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"High Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Capitalism' is a complex term related to economics and politics. It describes a system where individuals and companies own property and businesses, and make decisions about what to produce and sell. Prices are set by supply and demand, and the goal is to make a profit. Understanding capitalism requires knowledge of related concepts like free markets, private property, and competition. It's often discussed in the context of its advantages and disadvantages, and in comparison to other economic systems."},"example_sentences":[{"sentence":"The country's rapid economic growth was fueled by capitalism.","translation":"その国の急速な経済成長は、資本主義によって促進された。","type":"general"},{"sentence":"Critics argue that capitalism leads to income inequality.","translation":"批判者たちは、資本主義が所得格差につながると主張する。","type":"criticism"},{"sentence":"Technological innovation is a key driver of capitalism.","translation":"技術革新は、資本主義の重要な推進力である。","type":"economics"},{"sentence":"Many developed nations operate under a capitalist system.","translation":"多くの先進国は、資本主義体制の下で運営されている。","type":"global"}]}