{"word":"propers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(教会暦で)固有の祈祷文、固有聖歌","english_definition":"Those parts of the Mass or Divine Office that vary according to the day or feast.","examples":[{"sentence":"The propers for the feast of St. Michael are particularly beautiful.","translation":"聖ミカエルの祝日の固有聖歌は特に美しい。"}],"collocations":[],"synonyms":["variable prayers","variable chants"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'proprium', meaning 'one's own' or 'particular'. Refers to the specific prayers and chants that are proper or particular to a certain day or feast in the liturgical year.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒpərz/","syllables":"prop-ers"},"inflection":{"noun_plural":"propers"},"usage_notes":{"explanation":"'Propers' refers specifically to the variable parts of a liturgical service, particularly in the Roman Catholic tradition. These are the sections that change depending on the specific day in the liturgical calendar, as opposed to the 'ordinary', which remains the same.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["proper (adjective)","proprietary"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Propers' is a specialized term used primarily in liturgical contexts, specifically within certain Christian traditions. It refers to the variable parts of a Mass or Divine Office, such as specific prayers or chants that are unique to a particular day or feast. Due to its highly specific usage, it is not a common word in general English. Understanding requires familiarity with liturgical practices and terminology."},"example_sentences":[{"sentence":"The choir rehearsed the propers diligently for the upcoming Easter service.","translation":"聖歌隊は、近づいてくるイースター礼拝のために、固有聖歌を熱心にリハーサルした。","type":"noun","meaning_category":"固有聖歌"},{"sentence":"The priest carefully selected the propers that best reflected the theme of the day.","translation":"司祭はその日のテーマを最もよく反映する固有の祈祷文を注意深く選んだ。","type":"noun","meaning_category":"固有の祈祷文"}]}