{"word":"naturalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自然主義（芸術、文学）","english_definition":"a style and theory of representation based on the accurate depiction of detail.","examples":[{"sentence":"Naturalism in literature often focuses on the harsh realities of life.","translation":"文学における自然主義は、しばしば人生の厳しい現実を焦点とする。"},{"sentence":"The artist's naturalism captured the minute details of the landscape.","translation":"その芸術家の自然主義は、風景の微細な細部を捉えた。"}],"collocations":["literary naturalism","artistic naturalism","philosophical naturalism"],"synonyms":["realism","verisimilitude","mimesis"],"antonyms":["idealism","romanticism"]},{"part_of_speech":"noun","definition":"自然主義（哲学）","english_definition":"the philosophical belief that only natural (as opposed to supernatural or spiritual) laws and forces operate in the world.","examples":[{"sentence":"Philosophical naturalism rejects the existence of a soul separate from the body.","translation":"哲学的な自然主義は、肉体から分離した魂の存在を否定する。"},{"sentence":"Naturalism asserts that everything arises from natural properties and causes.","translation":"自然主義は、すべてのものが自然の特性と原因から生じると主張する。"}],"collocations":["philosophical naturalism","metaphysical naturalism","methodological naturalism"],"synonyms":["materialism","physicalism"],"antonyms":["spiritualism","supernaturalism"]},{"part_of_speech":"noun","definition":"自然発生説","english_definition":"the theory that living matter arises naturally from non-living matter.","examples":[{"sentence":"Naturalism, in the context of the origin of life, is the idea that life arose from non-living matter through natural processes.","translation":"生命の起源の文脈における自然主義は、生命が自然なプロセスを通じて非生物から生じたという考えである。"}],"collocations":["spontaneous generation","abiogenesis"],"synonyms":["spontaneous generation","abiogenesis"],"antonyms":["biogenesis"]}],"etymology":{"value":"From 'natural' + '-ism'. The term emerged in the 19th century to describe artistic and literary movements that sought to depict reality accurately and objectively. Its philosophical usage developed alongside scientific advancements, emphasizing natural explanations over supernatural ones.","priority":"★★★"},"pronunciation":{"ipa":"ˈnætʃərəlɪzəm","syllables":"nat-u-ral-ism"},"inflection":{"notes":"Noun, plural: naturalisms"},"usage_notes":{"explanation":"'Naturalism' has distinct meanings in art/literature and philosophy. In art and literature, it refers to a style that aims for realistic depiction. In philosophy, it's a worldview that excludes supernatural explanations. Be mindful of the context to understand the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Naturalism is the same as nature.","correct":"Naturalism is a style of art or a philosophical view, not simply nature itself.","note":"Naturalism is not simply nature, but a way of representing or understanding it."},{"incorrect":"Naturalism always means something is good.","correct":"Naturalism does not imply moral goodness; it is a descriptive approach.","note":"Naturalism is descriptive, not prescriptive; it doesn't inherently value what is 'natural'."}],"priority":"★★☆"},"related_words":{"derivatives":["naturalist","naturalistic","naturalistically"],"phrases":["naturalistic fallacy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent but established in academic and intellectual discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Naturalism' is a term used in art, literature, and philosophy. In art and literature, it means representing things as they appear in reality, with great detail. In philosophy, it means believing that only natural laws and forces exist, without supernatural elements. The term is more common in academic discussions. It's important to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"Émile Zola was a key figure in literary naturalism.","translation":"エミール・ゾラは文学的自然主義の重要な人物だった。","type":"example","meaning_category":"literature"},{"sentence":"Philosophical naturalism is often associated with scientific materialism.","translation":"哲学的自然主義は、しばしば科学的唯物論と関連付けられる。","type":"example","meaning_category":"philosophy"},{"sentence":"The painting's naturalism made the scene feel incredibly real.","translation":"その絵画の自然主義は、その場面を信じられないほどリアルに感じさせた。","type":"example","meaning_category":"art"}]}