{"word":"constructionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"構成主義（学習理論）、構築主義（社会理論）","english_definition":"A theory of learning or a philosophical viewpoint which holds that individuals actively construct their own knowledge and understanding of the world through experience and reflection; a sociological theory that knowledge and many aspects of the world around us are not objective facts but are constructed through social processes and cultural contexts.","examples":[{"sentence":"Constructionism emphasizes the importance of hands-on activities in learning.","translation":"構成主義は、学習における実践的な活動の重要性を強調する。"},{"sentence":"Social constructionism argues that concepts like gender and race are socially constructed.","translation":"社会構成主義は、ジェンダーや人種のような概念は社会的に構築されたものであると主張する。"},{"sentence":"In a constructionist classroom, students are encouraged to build their own understanding.","translation":"構成主義的な教室では、生徒は自分自身の理解を構築することが奨励される。"}],"collocations":["social constructionism (社会構成主義)","constructionist learning (構成主義的学習)","constructionist approach (構成主義的アプローチ)","constructionist perspective (構成主義的視点)"],"synonyms":["constructivism","social constructivism"],"antonyms":["essentialism","objectivism","realism"]}],"etymology":{"value":"The term 'constructionism' is closely related to 'constructivism,' but it emphasizes the role of active creation and building in the learning process. It was popularized by Seymour Papert, who built upon the work of Jean Piaget (who developed constructivism). 'Constructionism' highlights that learning is most effective when individuals are actively constructing something tangible or shareable, such as a product, a model, or a presentation.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈstrʌkʃənɪzəm/","syllables":"con-struc-tion-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Constructionism is often used interchangeably with constructivism, but there's a subtle difference. Constructivism (developed by Piaget) focuses on how individuals build knowledge through their experiences. Constructionism (developed by Papert) takes it a step further, emphasizing that learning is particularly effective when people are actively creating something concrete or shareable. In social sciences, 'social constructionism' is a distinct theory that examines how social phenomena are developed in social contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Constructionism is the same as behaviorism.","correct":"✓ Constructionism is different from behaviorism; it emphasizes active learning.","note":"Constructionism is an active learning theory, while behaviorism focuses on passive responses to stimuli."},{"incorrect":"✗ Constructionism is only about building things with your hands.","correct":"✓ Constructionism involves creating something tangible or shareable, which can include digital products or presentations.","note":"While hands-on activities are important, the 'something' created can be a variety of outputs, not just physical objects."}],"priority":"★★☆"},"related_words":{"derivatives":["constructionist (noun/adjective)","constructivism (noun)","constructivist (noun/adjective)","deconstructionism (noun)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic and educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Constructionism' is a complex term primarily used in education, psychology, and sociology. It refers to the idea that people learn best by actively creating things or constructing knowledge through their experiences. In social sciences, it means that many things we think are real are actually created by society. It's a term you'll mostly encounter in academic discussions or specialized articles.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum's educational programs are based on constructionism, encouraging children to learn through building and creating.","translation":"その博物館の教育プログラムは構成主義に基づいており、子供たちが構築や創造を通して学ぶことを奨励している。","type":"noun","meaning_category":"Learning Theory"},{"sentence":"Social constructionism challenges the notion that there is one objective truth.","translation":"社会構成主義は、客観的な真実が一つだけであるという概念に異議を唱える。","type":"noun","meaning_category":"Social Theory"},{"sentence":"A constructionist approach to teaching involves students designing their own projects.","translation":"教育における構成主義的アプローチは、生徒が自分自身のプロジェクトを設計することを含む。","type":"adjective","meaning_category":"Educational Approach"},{"sentence":"Seymour Papert is a key figure in the development of constructionism.","translation":"シーモア・パパートは、構成主義の発展における重要な人物である。","type":"noun","meaning_category":"Key Figure"}]}