{"word":"miskals","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"plural of miskal (a unit of weight used in some Middle Eastern countries, approximately 4.68 grams)","english_definition":"plural form of miskal, a unit of weight used in some Middle Eastern countries, approximately 4.68 grams.","examples":[{"sentence":"The merchant weighed the gold in miskals.","translation":"商人は金をミスカルの単位で計量した。"},{"sentence":"The price of saffron is often quoted per miskal.","translation":"サフランの価格はしばしばミスカルあたりで提示される。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Arabic word 'mithqal' (مِثْقَال), meaning 'weight' or 'measure'.","priority":"★★☆"},"pronunciation":{"ipa":"/mɪˈskɑːlz/","syllables":"mis-kals"},"inflection":{"noun_plural":"miskals"},"usage_notes":{"explanation":"'Miskal' is a traditional unit of weight, primarily used in the Middle East for measuring precious metals, spices, and other valuable commodities. Its value can vary slightly depending on the region, but it's generally around 4.68 grams. The plural form, 'miskals,' is used when referring to multiple units of this weight.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["miskal"],"related_terms":["gram","kilogram","ounce","pound"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Miskals' refers to multiple units of 'miskal,' a historical and regional unit of weight, mainly used in the Middle East. Its usage is limited to contexts involving historical trade, precious metals, or specific regional measurements. Therefore, it's not a commonly encountered word.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The jewelry was valued at 100 gold miskals.","translation":"その宝石は金のミスカル100個分の価値があると評価された。","type":"noun","meaning_category":"unit of weight"},{"sentence":"Ancient texts mention the use of miskals in trade transactions.","translation":"古代の文献には、貿易取引におけるミスカルの使用が記載されている。","type":"noun","meaning_category":"unit of weight"}]}