{"word":"impartability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"伝達可能であること、分け与えることができること","english_definition":"The quality or state of being impartable; capable of being imparted or communicated.","examples":[{"sentence":"The impartability of knowledge is essential for education.","translation":"知識の伝達可能性は教育にとって不可欠である。"},{"sentence":"The impartability of his enthusiasm inspired others.","translation":"彼の熱意の伝達可能性は他人を鼓舞した。"}],"collocations":["impartability of knowledge","impartability of enthusiasm","impartability of skills"],"synonyms":["communicability","transmittability","teachability","shareability"],"antonyms":["unimpartability","incommunicability","untransmittability"]}],"etymology":{"value":"impart + -ability. 'Impart' comes from Latin 'impertire' (to share, bestow), from 'in-' (in, on) + 'partire' (to divide, share), from 'pars' (part, share). '-ability' is a suffix denoting capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"ɪmˌpɑːrtəˈbɪləti","syllables":"im-part-a-bil-i-ty"},"inflection":{"noun_plural":"impartabilities"},"usage_notes":{"explanation":"'Impartability' refers to the capacity of something, such as knowledge, skills, or enthusiasm, to be effectively communicated or transferred from one person or entity to another. It emphasizes the potential for sharing and dissemination. This word is relatively rare and often used in academic or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impartability of the secret was questionable.","correct":"✓ The secret's confidentiality was questionable.","note":"'Impartability' is generally used for positive qualities like knowledge or enthusiasm, not for secrets which are intended to be kept. In this context, 'confidentiality' or 'secrecy' would be more appropriate."},{"incorrect":"✗ The impartability of the object made it valuable.","correct":"✓ The object's rarity made it valuable.","note":"'Impartability' refers to the ability to share or communicate something, not the physical properties of an object. 'Rarity', 'uniqueness', or 'craftsmanship' would be more fitting depending on the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["impart (verb)","impartable (adjective)","impartably (adverb)"],"phrases":["impart knowledge","impart wisdom","impart skills","impart enthusiasm"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Impartability' is a complex and rare word that describes the quality of being able to share or communicate something effectively. It's not commonly used in everyday conversation, but you might encounter it in academic or technical writing where the focus is on the transfer of knowledge, skills, or other intangible qualities. Understanding the root word 'impart' (to give or share) helps to grasp the meaning of 'impartability' as the capability of being imparted."},"example_sentences":[{"sentence":"The impartability of practical skills is best achieved through hands-on training.","translation":"実践的なスキルの伝達可能性は、実地訓練を通じて最も良く達成される。","type":"general","meaning_category":"伝達可能性"},{"sentence":"The professor emphasized the impartability of critical thinking as a core educational goal.","translation":"教授は、批判的思考の伝達可能性を中核的な教育目標として強調した。","type":"academic","meaning_category":"伝達可能性"},{"sentence":"The design of the workshop focused on maximizing the impartability of the new techniques.","translation":"ワークショップの設計は、新しい技術の伝達可能性を最大化することに焦点を当てた。","type":"technical","meaning_category":"伝達可能性"}]}