{"word":"digametic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学) 配偶子異型の、異型配偶子を生産する","english_definition":"(biology) Producing two kinds of gametes with respect to sex chromosomes.","examples":[{"sentence":"Humans are digametic, with females producing only X-bearing eggs and males producing both X- and Y-bearing sperm.","translation":"ヒトは配偶子異型であり、女性はX染色体を持つ卵子のみを生産し、男性はX染色体とY染色体を持つ精子を生産する。"},{"sentence":"In digametic species, sex determination is often based on the presence or absence of a specific sex chromosome.","translation":"配偶子異型の種では、性決定は特定の性染色体の有無に基づいていることが多い。"}],"collocations":["digametic sex","digametic species","digametic individual"],"synonyms":["heterogametic"],"antonyms":["homogametic"]},{"part_of_speech":"adjective","definition":"(遺伝学) 性染色体の構成が異なる","english_definition":"(genetics) Having different sex chromosome constitutions.","examples":[{"sentence":"The digametic sex is typically the one with two different sex chromosomes, such as XY in mammals.","translation":"配偶子異型性別は通常、哺乳類のXYのように、2つの異なる性染色体を持つ性別である。"}],"collocations":["digametic sex","digametic chromosomes"],"synonyms":["heterogametic"],"antonyms":["homogametic"]}],"etymology":{"value":"Derived from the Greek roots 'di-' (two), 'gamete' (sex cell), and '-ic' (pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪɡəˈmɛtɪk/","syllables":"di-ga-met-ic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Digametic' is a term used in biology and genetics to describe organisms that produce two different types of gametes (sex cells) with respect to their sex chromosomes. This is in contrast to 'homogametic' organisms, which produce only one type of gamete. The term is often used to describe the sex that has two different sex chromosomes (e.g., XY in mammals or ZW in birds).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The species is digametic for all chromosomes.","correct":"✓ The species is digametic for sex chromosomes.","note":"'Digametic' specifically refers to sex chromosomes, not all chromosomes."}],"priority":"★★☆"},"related_words":{"derivatives":["digamety (noun)"],"phrasal_verbs":[],"related_terms":["gamete","sex chromosome","heterogametic","homogametic","sex determination"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'digametic' is a specialized term used in genetics and biology, specifically in the context of sex determination and gamete production. It refers to organisms that produce two different types of gametes with respect to their sex chromosomes. Understanding this term requires a background in genetics and a familiarity with concepts such as sex chromosomes, gametes, and sex determination mechanisms. It is not commonly used in everyday language and is primarily found in scientific literature and academic settings."},"example_sentences":[{"sentence":"In humans, males are the digametic sex, possessing one X and one Y chromosome.","translation":"ヒトでは、男性は配偶子異型性別であり、1つのX染色体と1つのY染色体を持つ。","type":"scientific","meaning_category":"biology"},{"sentence":"The digametic nature of the male determines the sex of the offspring in mammals.","translation":"哺乳類では、雄の配偶子異型性が子孫の性を決定する。","type":"scientific","meaning_category":"genetics"}]}