{"word":"poormaster","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"救貧委員、救貧官","english_definition":"An official responsible for administering poor relief in a particular area, especially in historical contexts.","examples":[{"sentence":"The poormaster decided which families would receive assistance.","translation":"救貧委員はどの家族が援助を受けるかを決定した。"},{"sentence":"In the 19th century, the poormaster held significant power in the parish.","translation":"19世紀には、救貧官は教区で大きな権力を持っていた。"}],"collocations":["appoint a poormaster","the local poormaster","the duties of a poormaster"],"synonyms":["overseer of the poor","welfare officer (modern)"],"antonyms":[]}],"etymology":{"value":"From 'poor' + 'master'. Reflects the historical role of managing the poor and administering relief.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊərˌmæstər/","syllables":"poor-mas-ter"},"inflection":{"noun_plural":"poormasters"},"usage_notes":{"explanation":"The term 'poormaster' is largely historical and refers to an official who administered poor relief, especially under the English Poor Laws. The role involved assessing need, providing assistance (often in the form of food, clothing, or shelter), and managing workhouses. The term is rarely used in modern contexts, where welfare services are typically administered by government agencies or charitable organizations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a poormaster of the company.","correct":"✗ He is a philanthropist.","note":"'Poormaster' refers to a specific historical role related to public welfare, not private charity or corporate social responsibility."}],"priority":"★☆☆"},"related_words":{"derivatives":["poorhouse","workhouse","poor relief"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'poormaster' is a historical term referring to an official responsible for administering poor relief, especially under the English Poor Laws. It is not commonly used in modern English. Understanding this term requires knowledge of historical social welfare systems."},"example_sentences":[{"sentence":"The records show that the poormaster provided food and clothing to the destitute.","translation":"記録によると、救貧委員は困窮者に食料と衣類を提供した。","type":"noun","meaning_category":"救貧委員"},{"sentence":"The decisions of the poormaster were often controversial.","translation":"救貧委員の決定はしばしば物議を醸した。","type":"noun","meaning_category":"救貧委員"}]}