{"word":"Cordoba","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コルドバ (スペインの都市)","english_definition":"A city in Andalusia, southern Spain, known for its Mezquita (mosque-cathedral).","examples":[{"sentence":"Cordoba was once the capital of Islamic Spain.","translation":"コルドバはかつてイスラム・スペインの首都だった。"},{"sentence":"The Mezquita in Cordoba is a stunning example of Moorish architecture.","translation":"コルドバのメスキータは、ムーア建築の素晴らしい例だ。"}],"collocations":["visit Cordoba","in Cordoba","Cordoba Mezquita"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"コルドバ (アルゼンチンの都市)","english_definition":"A city in Argentina, the capital of the province of Córdoba.","examples":[{"sentence":"Cordoba is a major industrial center in Argentina.","translation":"コルドバはアルゼンチンの主要な工業中心地だ。"},{"sentence":"The National University of Cordoba is one of the oldest in South America.","translation":"コルドバ国立大学は、南米で最も古い大学の一つだ。"}],"collocations":["in Cordoba","Cordoba Argentina","University of Cordoba"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"コルドバ (スペインの県)","english_definition":"A province of Andalusia, southern Spain.","examples":[{"sentence":"Cordoba province is known for its olive oil production.","translation":"コルドバ県はオリーブオイルの生産で知られている。"}],"collocations":["Cordoba province","in Cordoba province"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the Roman city of Corduba, which is of uncertain origin, possibly Iberian.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrdəbə/","syllables":"Cor-do-ba"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Cordoba refers to multiple locations, the most well-known being the city in Spain. When referring to a specific location, it's helpful to provide context (e.g., Cordoba, Spain; Cordoba, Argentina).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Cordoba next year, it is in Argentina.","correct":"✓ I am going to Cordoba, Argentina next year.","note":"Specify the country to avoid confusion."}],"priority":"★★☆"},"related_words":{"derivatives":["Cordoban (adjective: relating to Cordoba, Spain; noun: a type of leather from Cordoba, Spain)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in geographical or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Cordoba' is a proper noun referring to a few different geographical locations, most notably a city in Spain and a city in Argentina. The Spanish Cordoba is historically significant due to its Moorish heritage. When using 'Cordoba,' it's important to provide context to clarify which location is being referenced, especially in writing. The word is more likely to appear in texts about history, geography, or travel."},"example_sentences":[{"sentence":"We are planning a trip to Cordoba, Spain, to see the Mezquita.","translation":"私たちはメスキータを見るために、スペインのコルドバへの旅行を計画しています。","type":"noun","meaning_category":"Spanish city"},{"sentence":"Cordoba, Argentina, is known for its colonial architecture.","translation":"アルゼンチンのコルドバは、植民地時代の建築で知られています。","type":"noun","meaning_category":"Argentinian city"},{"sentence":"The province of Cordoba in Spain is famous for its olive groves.","translation":"スペインのコルドバ県は、オリーブ畑で有名です。","type":"noun","meaning_category":"Spanish province"}]}