{"word":"rock-wombed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"岩の胎内を持つ、岩に囲まれた、岩から生まれた、または岩のように堅固な子宮を持つことを比喩的に表す","english_definition":"poetically or figuratively describing something as being enclosed by rock, born of rock, or having a womb as strong and unyielding as rock.","examples":[{"sentence":"The ancient city, rock-wombed within the mountain's embrace, had stood for centuries.","translation":"古代都市は、山の懐に岩の胎内のように抱かれて、何世紀も立っていた。"},{"sentence":"He described the cave as rock-wombed, a place of dark beginnings and silent potential.","translation":"彼はその洞窟を岩の胎内を持つ場所だと表現し、暗い始まりと静かな可能性の場所だと語った。"},{"sentence":"The legend spoke of a rock-wombed goddess, whose strength and resilience mirrored the mountains themselves.","translation":"伝説は、岩の胎内を持つ女神について語り、その強さと回復力は山々そのものを反映していた。"}],"collocations":["rock-wombed cave","rock-wombed valley","rock-wombed fortress","rock-wombed goddess","rock-wombed city"],"synonyms":["rock-bound","stone-enclosed","mountain-sheltered","fortified","impregnable"],"antonyms":["exposed","vulnerable","unprotected","open"]},{"part_of_speech":"adjective","definition":"(比喩的に) 非常に保護された、安全な、または隠された場所にあることを示す","english_definition":"(figuratively) indicating a place that is highly protected, secure, or hidden, as if within a rocky womb.","examples":[{"sentence":"The secret documents were stored in a rock-wombed vault, inaccessible to all but a select few.","translation":"秘密文書は、選ばれたごくわずかの者しかアクセスできない、岩の胎内のような金庫に保管されていた。"},{"sentence":"Her heart felt rock-wombed, safe from the pain and betrayals of the outside world.","translation":"彼女の心は岩の胎内に守られているように感じられ、外の世界の痛みや裏切りから安全だった。"}],"collocations":["rock-wombed vault","rock-wombed sanctuary","rock-wombed hideaway","rock-wombed heart","rock-wombed secret"],"synonyms":["sheltered","secure","hidden","protected","fortified"],"antonyms":["exposed","vulnerable","unprotected","open"]}],"etymology":{"value":"A compound word formed by combining \"rock\" (referring to stone or a large mass of stone) and \"wombed\" (having a womb; enclosed or protected as if in a womb). The term suggests a connection to the earth, security, and a sense of origin or creation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒkˌwuːmd/","syllables":"rock-wombed"},"inflection":{"notes":"This word does not have different inflections, as it is an adjective."},"usage_notes":{"explanation":"\"Rock-wombed\" is a relatively rare and poetic term, often used in literature or descriptive writing to evoke a sense of ancient origins, security, or being deeply embedded within a natural or geological feature. The term combines the solidity and permanence of rock with the nurturing and protective qualities associated with a womb. It is not typically used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby was rock-wombed.","correct":"✓ The baby was safe in the womb.","note":"\"Rock-wombed\" is not used to describe a literal human womb. It is used figuratively to describe a place or thing that is protected or enclosed like a womb, or to evoke a sense of origin or connection to the earth."},{"incorrect":"✗ The house was rock-wombed from the storm.","correct":"✓ The house was sheltered from the storm.","note":"While \"rock-wombed\" can imply protection, it is more evocative and poetic than simply saying something is sheltered. It suggests a deeper connection to the surrounding rock or earth."}],"priority":"★☆☆"},"related_words":{"derivatives":["womb","rock","rocky"],"phrases":["rock-hewn","stone-carved","earth-bound","mountain-born","cave-dwelling"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not applicable - very rare and specialized term)","frequency_google_ngram":"Very low frequency - used mainly in literary or descriptive contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"rock-wombed\" is highly figurative and poetic, requiring a strong understanding of metaphor and imagery. It is not commonly used and would primarily be found in advanced literary texts or descriptive passages aiming to create a specific atmosphere of ancient origins, protection, or connection to the earth. Understanding the connotations of both \"rock\" (strength, permanence) and \"womb\" (nurturing, origin) is essential to grasp the full meaning of the term."},"example_sentences":[{"sentence":"The temple, rock-wombed in the heart of the mountain, was a place of ancient secrets.","translation":"寺院は山の中心部に岩の胎内のように抱かれ、古代の秘密の場所だった。","type":"adjective","meaning_category":"Enclosed by rock"},{"sentence":"She sought solace in the rock-wombed silence of the cave.","translation":"彼女は洞窟の岩の胎内のような静けさの中で慰めを求めた。","type":"adjective","meaning_category":"Protected and secure"},{"sentence":"The author described the fortress as rock-wombed, a symbol of the kingdom's enduring power.","translation":"著者は要塞を岩の胎内を持つものとして描写し、王国の永続的な力の象徴とした。","type":"adjective","meaning_category":"Strong and unyielding"}]}