{"word":"immunodiffusion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"免疫拡散法","english_definition":"A technique used to identify and quantify antibodies and antigens by their diffusion through a gel matrix.","examples":[{"sentence":"Immunodiffusion is a common method for detecting antibodies in serum.","translation":"免疫拡散法は、血清中の抗体を検出するための一般的な方法です。"},{"sentence":"The immunodiffusion assay showed a clear precipitin line between the antibody and antigen.","translation":"免疫拡散アッセイは、抗体と抗原の間に明確な沈降線を示しました。"}],"collocations":["radial immunodiffusion","double immunodiffusion","Ouchterlony immunodiffusion"],"synonyms":["Ouchterlony test","gel diffusion"],"antonyms":[]}],"etymology":{"value":"The term 'immunodiffusion' is derived from 'immuno-' referring to the immune system, and 'diffusion' referring to the process of particles spreading out.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪmjunoʊdɪˈfjuːʒən/","syllables":"im-mu-no-di-ffu-sion"},"inflection":{"noun_plural":"immunodiffusions"},"usage_notes":{"explanation":"Immunodiffusion is a qualitative or semi-quantitative analytical technique used in immunology. It relies on the diffusion of antigens and antibodies through a gel, such as agarose. When they meet in optimal proportions, they form a visible precipitate. Different variations of the technique exist, including radial immunodiffusion (RID) and Ouchterlony double immunodiffusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Immunodiffusion is used to amplify DNA.","correct":"✓ Immunodiffusion is used to detect antibodies and antigens.","note":"Immunodiffusion is used for detecting and quantifying antibodies and antigens, not for DNA amplification (which is done by PCR)."},{"incorrect":"✗ Immunodiffusion requires live cells.","correct":"✓ Immunodiffusion does not require live cells.","note":"Immunodiffusion is an in vitro technique and does not require live cells."}],"priority":"★★☆"},"related_words":{"derivatives":["immunodiffusive"],"phrasal_verbs":[],"related_terms":["antigen","antibody","precipitation","agarose","Ouchterlony","radial immunodiffusion","RID","serology","immunology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Immunodiffusion is a scientific term referring to a laboratory technique used in immunology. It involves the diffusion of antibodies and antigens through a gel to form visible precipitation lines, indicating their interaction. This method is used to identify and quantify these immune components. Understanding this term requires familiarity with basic immunology concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"Radial immunodiffusion is used to quantify the concentration of IgG in serum samples.","translation":"放射状免疫拡散法は、血清サンプル中のIgGの濃度を定量するために使用されます。","type":"example","meaning_category":"technique"},{"sentence":"The Ouchterlony immunodiffusion assay can determine the relatedness of different antigens.","translation":"アウターロニー免疫拡散アッセイは、異なる抗原の関連性を判断できます。","type":"example","meaning_category":"assay"},{"sentence":"Immunodiffusion is a relatively simple and inexpensive method for detecting antibodies.","translation":"免疫拡散法は、抗体を検出するための比較的簡単で安価な方法です。","type":"example","meaning_category":"method"}]}