{"word":"Armstrong","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アームストロング：英語圏の姓","english_definition":"A surname of English and Scottish origin.","examples":[{"sentence":"Armstrong is a common surname in Scotland.","translation":"アームストロングはスコットランドで一般的な姓です。"}],"collocations":["Neil Armstrong","Lance Armstrong"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ニール・アームストロング：アメリカの宇宙飛行士、人類初の月面着陸者 (1930-2012)","english_definition":"Neil Armstrong (1930-2012), an American astronaut and the first person to walk on the Moon.","examples":[{"sentence":"Neil Armstrong took his first steps on the moon in 1969.","translation":"ニール・アームストロングは1969年に月面で最初の歩みを記しました。"}],"collocations":["Neil Armstrong's first step","Armstrong's moonwalk"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ランス・アームストロング：アメリカの自転車競技選手、ドーピング違反でタイトル剥奪","english_definition":"Lance Armstrong, an American former professional road racing cyclist whose titles were stripped due to doping violations.","examples":[{"sentence":"Lance Armstrong was a controversial figure in cycling.","translation":"ランス・アームストロングは自転車競技において物議を醸す人物でした。"}],"collocations":["Lance Armstrong's doping scandal","Armstrong's cycling career"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Armstrong originated in the Anglo-Scottish border region. It is a descriptive name meaning 'strong arm'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrmˌstrɔŋ/","syllables":"Arm-strong"},"inflection":{},"usage_notes":{"explanation":"Armstrong is primarily known as a surname. When used without a first name, it often refers to Neil Armstrong, the astronaut. However, context is important, as it could also refer to Lance Armstrong, especially in discussions about cycling or sports controversies.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_names":[],"see_also":[]},"level_frequency":{},"readability_explanation":{"level":"B1","text":"The word \"Armstrong\" is most commonly recognized as a surname. It is strongly associated with Neil Armstrong, the first person to walk on the moon. However, it's important to be aware that it can also refer to other individuals, such as Lance Armstrong, a cyclist. The context usually makes it clear which person is being referred to."},"example_sentences":[{"sentence":"The **Armstrong** family has a long history in the area.","translation":"アームストロング家はその地域に長い歴史を持っています。","type":"noun","meaning_category":"surname"},{"sentence":"**Neil Armstrong**'s words, \"That's one small step for a man, one giant leap for mankind,\" are famous.","translation":"ニール・アームストロングの「これは一人の人間にとっては小さな一歩だが、人類にとっては偉大な飛躍である」という言葉は有名です。","type":"noun","meaning_category":"Neil Armstrong"},{"sentence":"The documentary explored **Lance Armstrong**'s rise and fall in the world of cycling.","translation":"そのドキュメンタリーは、ランス・アームストロングの自転車競技界における栄光と没落を探求しました。","type":"noun","meaning_category":"Lance Armstrong"}]}