{"word":"sporty-looking","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"スポーティーに見える、運動好きそうな外見の","english_definition":"having an appearance that suggests athleticism or an interest in sports.","examples":[{"sentence":"He was a sporty-looking guy with broad shoulders and a confident stride.","translation":"彼は肩幅が広く、自信に満ちた足取りで、スポーティーに見える男だった。"},{"sentence":"The car had a sporty-looking design with racing stripes.","translation":"その車はレーシングストライプが入ったスポーティーな外観のデザインだった。"},{"sentence":"She prefers sporty-looking clothes to more formal attire.","translation":"彼女はフォーマルな服装よりもスポーティーに見える服を好む。"}],"collocations":["sporty-looking car (スポーティーに見える車)","sporty-looking clothes (スポーティーに見える服)","sporty-looking design (スポーティーに見えるデザイン)","sporty-looking person (スポーティーに見える人)"],"synonyms":["athletic-looking","fit-looking","active-looking"],"antonyms":["unathletic-looking","sedentary-looking"],"notes":"Often used to describe people, cars, or clothing. Implies a sense of energy, fitness, and dynamism."}],"etymology":{"value":"Combination of 'sporty' (suggesting an interest in or association with sports) and 'looking' (having a particular appearance).","priority":"★★★"},"pronunciation":{"ipa":"/ˈspɔːrti ˈlʊkɪŋ/","syllables":"spor-ty-look-ing"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Sporty-looking' describes something or someone that gives the impression of being athletic, active, or related to sports. It doesn't necessarily mean that the person or object *is* sporty, only that it *appears* to be. It's often used to describe appearances, designs, or styles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very sporty-looking. He plays football every day.","correct":"✓ He is sporty-looking. He plays football every day.","note":"'Sporty-looking' is already a descriptive adjective, so adding 'very' is usually redundant. It's better to just say 'He is sporty-looking.' Or, if you want to emphasize his athleticism, you could say 'He is very athletic.'"},{"incorrect":"✗ The car is sporty-looking, so it must be fast.","correct":"✓ The car is sporty-looking, but it isn't necessarily fast.","note":"'Sporty-looking' only describes the appearance, not the actual performance. A sporty-looking car might not actually be fast."}],"priority":"★★☆"},"related_words":{"derivatives":["sporty (adjective)","looking (adjective)"],"related_terms":["athletic","fit","active","dynamic","stylish","modern"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Sporty-looking' is a compound adjective that's relatively easy to understand. It combines the familiar word 'sporty' with 'looking' to describe something that has an athletic or active appearance. While not a very common word, it's easily understood in context by intermediate to advanced English speakers."},"example_sentences":[{"sentence":"The new model has a more sporty-looking front end.","translation":"新型モデルは、よりスポーティーな外観のフロントエンドを備えている。","type":"description","meaning_category":"appearance"},{"sentence":"She chose a sporty-looking backpack for her hiking trip.","translation":"彼女はハイキング旅行のためにスポーティーに見えるバックパックを選んだ。","type":"choice","meaning_category":"preference"},{"sentence":"The advertisement featured a sporty-looking family enjoying outdoor activities.","translation":"広告には、アウトドア活動を楽しんでいるスポーティーに見える家族がフィーチャーされていた。","type":"advertisement","meaning_category":"image"}]}