{"word":"sigillistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"封印に関する、封印を用いた、封印の性質を持つ","english_definition":"relating to or characteristic of sigils (seals or magical symbols).","examples":[{"sentence":"The sigillistic art of the Middle Ages often combined religious and occult symbolism.","translation":"中世の封印術は、宗教的およびオカルト的な象徴を組み合わせることが多かった。"},{"sentence":"He studied the sigillistic properties of ancient amulets.","translation":"彼は古代のお守りの封印的な特性を研究した。"}],"collocations":["sigillistic magic","sigillistic art","sigillistic properties"],"synonyms":["symbolic","emblematic","seal-related"],"antonyms":[]}],"etymology":{"value":"From 'sigil' (a seal or magical symbol) + '-istic' (a suffix indicating characteristic or relating to). 'Sigil' comes from Latin 'sigillum' (a small image, seal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪdʒɪˈlɪstɪk/","syllables":"si-gil-lis-tic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Sigillistic' is a relatively rare term primarily used in the context of occultism, magic, and historical studies related to seals and symbols. It describes something that pertains to or utilizes sigils, which are symbolic representations often used in magical practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting had a sigillistic style, filled with realistic portraits.","correct":"✓ The painting had a symbolic style, filled with allegorical figures.","note":"'Sigillistic' relates specifically to sigils (seals or magical symbols), not general symbolism or realism."}],"priority":"★☆☆"},"related_words":{"derivatives":["sigil","sigillography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'sigillistic' is a specialized term primarily found in contexts related to occultism, magic, and the study of historical seals. Due to its limited usage and specific subject matter, it is considered a high-level vocabulary word. Understanding requires familiarity with the concept of sigils and their historical and cultural significance."},"example_sentences":[{"sentence":"The museum displayed a collection of rings bearing intricate sigillistic designs.","translation":"その博物館には、複雑な封印の意匠が施された指輪のコレクションが展示されていた。","type":"adjective","meaning_category":"封印に関する"},{"sentence":"Many grimoires contain instructions for creating sigillistic talismans.","translation":"多くのグリモワール（魔導書）には、封印を用いた護符の作成方法が記載されている。","type":"adjective","meaning_category":"封印を用いた"}]}