{"word":"auxetical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"拡大の、拡大的な、増大の","english_definition":"Relating to or causing increase or enlargement.","examples":[{"sentence":"The auxetical properties of the material allow it to expand significantly when heated.","translation":"その材料の拡大特性により、加熱すると大幅に膨張します。"},{"sentence":"The auxetical effect of the drug led to an increase in cell size.","translation":"その薬の増大効果により、細胞サイズが増加しました。"}],"collocations":["auxetical properties","auxetical effect","auxetical growth","auxetical process"],"synonyms":["augmentative","increasing","enlarging","expanding","amplifying"],"antonyms":["reductive","decreasing","diminishing","contracting"]}],"etymology":{"value":"From Ancient Greek αὐξητικός (auxētikós), from αὐξάνω (auxánō, \"I increase\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːkˈsɛtɪkəl/","syllables":"aux-et-i-cal"},"inflection":{"notes":"Adjective, so it has comparative and superlative forms (more auxetical, most auxetical), but these are rarely used."},"usage_notes":{"explanation":"'Auxetical' is a relatively rare and technical term, primarily used in scientific or academic contexts to describe something that causes or relates to an increase in size, quantity, or degree. It's often encountered in discussions of materials science, biology, or medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The auxetic material has auxetical properties.","correct":"✓ The auxetical properties are observed in the auxetic material.","note":"'Auxetic' refers to a specific type of material that expands when stretched, while 'auxetical' describes the properties related to enlargement or increase in general. The terms are related but not interchangeable."}],"priority":"★☆☆"},"related_words":{"derivatives":["auxesis (noun: increase in size; rhetorical exaggeration)","auxetic (adjective: having a negative Poisson's ratio, expanding when stretched)","auxin (noun: a plant hormone that promotes growth)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Auxetical' is a highly specialized term primarily encountered in scientific and technical literature. Understanding requires familiarity with concepts of growth, enlargement, and related scientific principles. Due to its rarity and specific usage, it is not typically part of general vocabulary. It is most often found in contexts involving materials science, biology, or medicine, where the properties of substances that cause or relate to increase are being discussed."},"example_sentences":[{"sentence":"The auxetical nature of the tumor contributed to its rapid growth.","translation":"その腫瘍の増大的な性質が、急速な成長の一因となった。","type":"adjective","meaning_category":"増大の"},{"sentence":"Scientists are studying the auxetical effects of certain chemicals on cell cultures.","translation":"科学者たちは、特定の化学物質が細胞培養に及ぼす拡大効果を研究している。","type":"adjective","meaning_category":"拡大の"},{"sentence":"The auxetical process involved in bone regeneration is complex and not fully understood.","translation":"骨の再生に関わる拡大プロセスは複雑であり、完全には解明されていない。","type":"adjective","meaning_category":"増大の"}]}