{"word":"epilepsy-sensitive","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(ウェブサイト、ビデオゲームなどが) てんかん発作を引き起こす可能性のある視覚効果を避けて設計された、またはそのような視覚効果を避けるためのオプションを提供する","english_definition":"(of a website, video game, etc.) designed to avoid visual effects that could trigger epileptic seizures, or providing options to avoid such effects.","examples":[{"sentence":"The game includes an epilepsy-sensitive mode that reduces flashing lights.","translation":"そのゲームには、点滅する光を減らすてんかん配慮モードが含まれています。"},{"sentence":"We are working to make our website more epilepsy-sensitive.","translation":"私たちは、ウェブサイトをよりてんかんに配慮したものにするために取り組んでいます。"}],"collocations":["epilepsy-sensitive mode","epilepsy-sensitive design","epilepsy-sensitive settings"],"synonyms":["seizure-safe","photosensitivity-aware"],"antonyms":["epilepsy-triggering","photosensitive"],"notes":"This term is often used in the context of accessibility and inclusive design."}],"etymology":{"value":"Combination of 'epilepsy' (a neurological disorder) and 'sensitive' (easily affected by something). The term describes a design or feature that is mindful of individuals with epilepsy and aims to minimize potential triggers.","priority":"Low"},"pronunciation":{"ipa":"/ˈɛpɪlɛpsi ˈsɛnsətɪv/","syllables":"ep-i-lep-sy sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'epilepsy-sensitive' is used to describe designs, particularly in digital media like websites and video games, that take into account the needs of people with epilepsy. This often involves avoiding rapidly flashing lights, strobing effects, or certain patterns that can trigger seizures. The goal is to create a more accessible and safer experience for individuals with photosensitive epilepsy.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The website is very sensitive for epilepsy.","correct":"✓ The website is epilepsy-sensitive.","note":"The correct term is 'epilepsy-sensitive,' not 'sensitive for epilepsy.'"},{"incorrect":"✗ This game is sensitive to epilepsy.","correct":"✓ This game is epilepsy-sensitive.","note":"While 'sensitive to epilepsy' might be understood, 'epilepsy-sensitive' is the more common and precise term."}],"priority":"Low"},"related_words":{"derivatives":["photosensitive (adjective: sensitive to light)","epilepsy (noun: a neurological disorder characterized by seizures)","seizure (noun: a sudden surge of electrical activity in the brain)"],"idioms_phrases":[],"priority":"Low"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Epilepsy-sensitive' describes something designed to avoid causing seizures in people with epilepsy, especially those with photosensitive epilepsy. It's often used for websites, video games, and other digital media that might contain flashing lights or patterns that could trigger a seizure. These designs may include settings to reduce or eliminate these triggers, making the content safer and more accessible.","priority":"Medium"},"example_sentences":[{"sentence":"The new update includes an epilepsy-sensitive mode to reduce flashing effects.","translation":"新しいアップデートには、点滅効果を軽減するためのてんかん配慮モードが含まれています。","type":"adjective","meaning_category":"Avoiding triggers"},{"sentence":"The developers made the game epilepsy-sensitive by removing rapidly flashing lights.","translation":"開発者は、急速に点滅する光を削除することで、ゲームをてんかん配慮型にしました。","type":"adjective","meaning_category":"Avoiding triggers"},{"sentence":"The website provides epilepsy-sensitive settings to customize the viewing experience.","translation":"ウェブサイトでは、視聴体験をカスタマイズするためのてんかん配慮設定が提供されています。","type":"adjective","meaning_category":"Providing options"}]}