{"word":"DNA-polluted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"DNAが汚染された、DNAが混入された","english_definition":"Contaminated with DNA; having DNA present as a pollutant or unwanted substance.","examples":[{"sentence":"The sample was DNA-polluted, making it unusable for accurate analysis.","translation":"そのサンプルはDNAで汚染されていたため、正確な分析には使用できませんでした。"},{"sentence":"We need to ensure the lab equipment is not DNA-polluted to avoid false positives.","translation":"偽陽性を避けるために、実験装置がDNAで汚染されていないことを確認する必要があります。"}],"collocations":["DNA-polluted sample","DNA-polluted environment","DNA-polluted equipment"],"synonyms":["DNA-contaminated","DNA-adulterated","DNA-compromised"],"antonyms":["DNA-pure","DNA-clean","DNA-uncontaminated"]}],"etymology":{"value":"The word is formed by combining \"DNA\" (deoxyribonucleic acid) with \"polluted,\" indicating the presence of unwanted DNA.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌɛnˈeɪ pəˈluːtɪd/","syllables":"D-NA-pol-lu-ted"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative/superlative (though these are rarely used: more DNA-polluted, most DNA-polluted)."},"usage_notes":{"explanation":"The term \"DNA-polluted\" is typically used in scientific or laboratory contexts to describe a situation where a sample, environment, or equipment has been contaminated with unwanted DNA. This contamination can compromise the accuracy of experiments or analyses. It is often used in fields such as molecular biology, forensics, and environmental science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was polluted by DNA.","correct":"✓ The water was DNA-polluted.","note":"When used as an adjective before a noun, the hyphenated form is preferred. When used after a verb, the non-hyphenated form (polluted by DNA) is correct."}],"priority":"★★☆"},"related_words":{"derivatives":["pollute","pollution","DNA","contamination"],"related_terms":["cross-contamination","PCR contamination","environmental DNA"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency. Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"DNA-polluted\" is a technical term used in scientific fields, particularly in biology and forensics. It describes a situation where a sample or environment has been contaminated with DNA from an unintended source. This contamination can interfere with accurate analysis or experimentation. Understanding this term requires a basic understanding of DNA and the concept of contamination in scientific contexts."},"example_sentences":[{"sentence":"The forensic evidence was deemed inadmissible because it was DNA-polluted.","translation":"その法医学的証拠はDNAで汚染されていたため、証拠として認められませんでした。","type":"adjective","meaning_category":"Contamination"},{"sentence":"Stringent protocols are in place to prevent samples from becoming DNA-polluted during the experiment.","translation":"実験中にサンプルがDNAで汚染されるのを防ぐために、厳格なプロトコルが設けられています。","type":"adjective","meaning_category":"Prevention"}]}