{"word":"gnosticism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"グノーシス主義","english_definition":"A prominent heretical movement of the 2nd century Christian church, partly of pre-Christian origin. Gnostic doctrine taught that the world was created and ruled by a lesser divinity, the demiurge, and that Christ was an emissary of the remote, supreme divine being.","examples":[{"sentence":"Gnosticism was a major challenge to early Christianity.","translation":"グノーシス主義は初期キリスト教にとって大きな脅威でした。"},{"sentence":"Some scholars see elements of gnosticism in modern new age movements.","translation":"現代のニューエイジ運動にグノーシス主義の要素を見出す学者もいます。"}],"collocations":["early gnosticism","ancient gnosticism","gnostic beliefs","gnostic texts","gnostic gospels"],"synonyms":["gnosis"],"antonyms":[]}],"etymology":{"value":"From Greek *gnōstikos* 'knowing, intellectual,' from *gnōsis* 'knowledge,' from *gignōskein* 'to know.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒstɪsɪzəm/","syllables":"gnos-ti-cism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Gnosticism refers to a complex and diverse set of religious ideas and systems that flourished in the first few centuries AD. It is characterized by the belief that the material world is created by an imperfect being (the Demiurge), and that humans can achieve salvation through *gnosis* (esoteric knowledge) of the true, higher God. Gnostic systems often incorporate elements of Christianity, Judaism, and Hellenistic philosophy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a gnosticism.","correct":"✓ He is a gnostic.","note":"'Gnosticism' is the name of the belief system, while 'gnostic' is the adjective or the noun referring to a follower of gnosticism."}],"priority":"★☆☆"},"related_words":{"derivatives":["gnostic (adjective, noun)","gnosis (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gnosticism' is a complex term referring to a set of ancient religious ideas that emphasized secret knowledge as the key to salvation. It's not a common word in everyday conversation and is usually encountered in academic or theological contexts."},"example_sentences":[{"sentence":"The Nag Hammadi library provided valuable insights into gnosticism.","translation":"ナグ・ハマディ写本は、グノーシス主義に関する貴重な洞察を提供しました。","type":"noun","meaning_category":"religious movement"},{"sentence":"Some scholars argue that early Christian theology was shaped in response to gnosticism.","translation":"初期キリスト教神学はグノーシス主義への対応として形成されたと主張する学者もいます。","type":"noun","meaning_category":"religious movement"}]}