{"word":"Trophotaxis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"走化性の一種で、生物が化学物質の濃度勾配を直接比較して移動方向を決定する行動。","english_definition":"A type of taxis (movement response) where an organism moves directly towards or away from a stimulus by simultaneously comparing stimulus intensity at two or more locations. This is commonly observed in response to chemical gradients.","examples":[{"sentence":"Trophotaxis allows insects to locate food sources by directly comparing the concentration of odor molecules.","translation":"走化性によって、昆虫は臭い分子の濃度を直接比較して食物源を見つけることができる。"},{"sentence":"The larvae exhibited trophotaxis, moving towards the higher concentration of the attractant.","translation":"幼虫は走化性を示し、誘引物質の高濃度の方へ移動した。"}],"collocations":["exhibit trophotaxis","demonstrate trophotaxis","use trophotaxis","positive trophotaxis (誘引物質に向かう場合)","negative trophotaxis (忌避物質から離れる場合)"],"synonyms":["chemotaxis","klinotaxis","taxis"],"antonyms":[],"notes":"Trophotaxis is distinguished from klinotaxis, where an organism compares stimulus intensity over time by moving its body from side to side."}],"etymology":{"value":"ギリシャ語の 'tropho-' (栄養、食物) + 'taxis' (配列、動き) に由来。栄養源に向かう動きを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrɒfoʊˈtæksɪs/","syllables":"tro-pho-tax-is"},"inflection":{"noun_plural":"trophotaxes"},"usage_notes":{"explanation":"Trophotaxisは、生物が化学物質などの刺激源の濃度勾配を直接比較して移動方向を決定する行動を指す専門用語です。この行動は、左右の感覚器官で同時に刺激の強さを比較することによって行われます。走化性（chemotaxis）の一種ですが、時間的な比較を行うklinotaxisとは区別されます。生物学、特に動物行動学や生態学の分野で用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria used klinotaxis to find the sugar, a form of trophotaxis.","correct":"✓ The bacteria used trophotaxis to find the sugar, directly comparing concentrations.","note":"Trophotaxisは直接的な比較を伴いますが、klinotaxisは時間的な比較を伴います。"},{"incorrect":"✗ Trophotaxis is when an organism moves randomly.","correct":"✓ Trophotaxis is when an organism moves directionally based on stimulus gradients.","note":"Trophotaxisはランダムな動きではなく、刺激勾配に基づいた方向性のある動きです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["trophotactic (形容詞)"],"phrasal_verbs":[],"related_terms":["chemotaxis","klinotaxis","kinesis","taxis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Trophotaxis」は、生物が化学物質などの刺激の濃度勾配を直接比較して、移動方向を決定する行動を指す専門用語です。これは、生物が左右の感覚器官で同時に刺激の強さを比較することによって行われます。この用語は、生物学、特に動物行動学や生態学の分野で用いられます。走化性（chemotaxis）の一種ですが、時間的な比較を行うklinotaxisとは区別されます。一般的には使われない専門的な単語です。"},"example_sentences":[{"sentence":"Many insects use trophotaxis to locate food sources by sensing odor gradients.","translation":"多くの昆虫は、臭いの勾配を感知することによって、走化性を使って食物源を見つける。","type":"general","meaning_category":"走化性"},{"sentence":"The study investigated the role of trophotaxis in the migration of soil nematodes.","translation":"その研究は、土壌線虫の移動における走化性の役割を調査した。","type":"research","meaning_category":"走化性"},{"sentence":"Positive trophotaxis was observed as the organism moved towards the higher concentration of the attractant.","translation":"誘引物質の高濃度に向かって生物が移動する際に、正の走化性が観察された。","type":"observation","meaning_category":"走化性"}]}