{"word":"nonvulgarity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下品でないこと、上品さ、洗練さ","english_definition":"the quality of being not vulgar; refinement; good taste; elegance.","examples":[{"sentence":"The play was praised for its nonvulgarity and wit.","translation":"その劇は、下品さのなさ（上品さ）と機知に富んでいることで称賛された。"},{"sentence":"She appreciated the nonvulgarity of the hotel's decor.","translation":"彼女はそのホテルの装飾の上品さを高く評価した。"},{"sentence":"The author's commitment to nonvulgarity made his work appealing to a wide audience.","translation":"著者の下品さに陥らない姿勢が、彼の作品を幅広い読者に魅力的なものにした。"}],"collocations":["display of nonvulgarity","commitment to nonvulgarity"],"synonyms":["refinement","elegance","tastefulness","decorum","propriety"],"antonyms":["vulgarity","coarseness","indecency","crudity"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"vulgarity\" (下品さ)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.vʌlˈɡær.ɪ.ti/","syllables":"non-vul-gar-i-ty"},"inflection":{"noun_plural":"nonvulgarities"},"usage_notes":{"explanation":"\"Nonvulgarity\" is a relatively uncommon word that emphasizes the absence of vulgarity, highlighting qualities like refinement, good taste, and elegance. It is often used in discussions of art, literature, or personal style to praise the avoidance of crude or offensive elements. While not frequently used in everyday conversation, it is a useful term for expressing appreciation for sophistication and good taste.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonvulgarity of the joke was appreciated by all.","correct":"✓ The wit and nonvulgarity of the joke were appreciated by all.","note":"\"Nonvulgarity\" is a quality, not a characteristic of a joke itself. It's better to say the joke was witty and not vulgar."},{"incorrect":"✗ He showed his nonvulgarity by dressing formally.","correct":"✓ He showed his refinement by dressing formally.","note":"\"Refinement\" or \"elegance\" are more common and natural ways to express someone's good taste in dress."}],"priority":"★★☆"},"related_words":{"derivatives":["nonvulgar (adjective: 下品でない)"],"antonyms":["vulgarity (noun: 下品さ)","vulgar (adjective: 下品な)"],"related":["refinement","elegance","tastefulness","decorum","propriety"]},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonvulgarity\" is a formal and relatively rare term used to describe the absence of vulgarity. It implies a level of refinement, good taste, and elegance. This word is more commonly found in academic or literary contexts where the focus is on analyzing the qualities of art, literature, or personal style. It's important to note that while it's a valid word, it's not frequently used in everyday conversation, and more common synonyms like \"refinement\" or \"elegance\" may be more appropriate in many situations."},"example_sentences":[{"sentence":"The film's success lay in its ability to entertain without resorting to vulgarity, showcasing a refreshing nonvulgarity.","translation":"その映画の成功は、下品さに頼らずに楽しませる能力にあり、さわやかな上品さを発揮していた。","type":"noun","meaning_category":"上品さ"},{"sentence":"Her writing style is characterized by a deliberate nonvulgarity, avoiding sensationalism and focusing on subtle nuances.","translation":"彼女の文体は、意図的な上品さが特徴で、扇情主義を避け、微妙なニュアンスに焦点を当てている。","type":"noun","meaning_category":"上品さ"},{"sentence":"The museum curator insisted on maintaining a standard of nonvulgarity in all the exhibits.","translation":"美術館の学芸員は、すべての展示品において下品さを排除する基準を維持することを主張した。","type":"noun","meaning_category":"上品さ"}]}