{"word":"battlestead","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語) 戦場、戦地","english_definition":"(archaic) A battlefield; the site of a battle.","examples":[{"sentence":"The ravens feasted on the slain warriors at the battlestead.","translation":"カラスたちは戦場で殺された戦士たちをむさぼり食った。"},{"sentence":"The battlestead was littered with broken weapons and armor.","translation":"戦場は壊れた武器や鎧で散乱していた。"}],"collocations":["blood-soaked battlestead (血に染まった戦場)","desolate battlestead (荒涼とした戦場)"],"synonyms":["battlefield","war zone","field of battle","battleground"],"antonyms":["peaceful place","haven","sanctuary"]}],"etymology":{"value":"Old English 'beadustede', from 'beadu' (battle) + 'stede' (place). Cognate with Old High German 'battlestat'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbætəlˌstɛd/","syllables":"bat-tle-stead"},"inflection":{"noun_plural":"battlesteads"},"usage_notes":{"explanation":"'Battlestead' is an archaic term, rarely used in modern English. It evokes a sense of historical or epic battles. More common synonyms are 'battlefield', 'battleground', or 'war zone'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They built a house on the battlestead.","correct":"✓ They built a house near the battlestead. / ✓ They built a house on what was once a battlestead.","note":"Because 'battlestead' refers to a battlefield, building a house directly on it implies disrespect or disregard for the history/tragedy that occurred there. It's more appropriate to say the house was built *near* it, or to acknowledge the historical context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["battle","stead (place)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Battlestead' is a rarely encountered word, primarily found in historical or fantasy literature. Understanding requires familiarity with archaic vocabulary and a context involving warfare or historical events. Due to its infrequent use, it is not part of standard English vocabulary.","note":"This word is not commonly used in modern English."},"example_sentences":[{"sentence":"The ancient poem described the horrors of the battlestead.","translation":"その古代の詩は戦場の恐怖を描写していた。","type":"noun","meaning_category":"戦場"},{"sentence":"Legends spoke of a cursed battlestead where no grass would ever grow.","translation":"伝説では、草一本生えない呪われた戦場について語られていた。","type":"noun","meaning_category":"戦場"},{"sentence":"Archaeologists carefully excavated the battlestead, hoping to uncover artifacts from the long-ago conflict.","translation":"考古学者たちは、昔の紛争の遺物を発掘しようと、戦場を注意深く発掘した。","type":"noun","meaning_category":"戦場"}]}