{"word":"Western-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"西洋志向の、西洋的な考え方や価値観に重きを置く","english_definition":"Having a preference for or being influenced by Western (European and North American) culture, values, and ideas.","examples":[{"sentence":"The school has a Western-oriented curriculum, focusing on European history and literature.","translation":"その学校は西洋志向のカリキュラムを採用しており、ヨーロッパの歴史と文学に重点を置いています。"},{"sentence":"The company's marketing strategy is Western-oriented, targeting consumers in Europe and North America.","translation":"その会社のマーケティング戦略は西洋志向で、ヨーロッパと北米の消費者をターゲットにしています。"},{"sentence":"He has a very Western-oriented view of the world, often criticizing Eastern traditions.","translation":"彼は非常に西洋志向の世界観を持っており、しばしば東洋の伝統を批判します。"}],"collocations":["Western-oriented culture (西洋志向の文化)","Western-oriented education (西洋志向の教育)","Western-oriented values (西洋志向の価値観)","Western-oriented approach (西洋志向のアプローチ)","Western-oriented society (西洋志向の社会)"],"synonyms":["Westernized","Eurocentric","Americanized","Western-influenced"],"antonyms":["Eastern-oriented","Asian-oriented","traditional","non-Western"]},{"part_of_speech":"adjective","definition":"(人・組織などが)西洋諸国との関係を重視する、西洋諸国との連携を強めようとする","english_definition":"Focusing on or prioritizing relationships and cooperation with Western countries.","examples":[{"sentence":"The government is pursuing a Western-oriented foreign policy, strengthening ties with the United States and Europe.","translation":"政府は西洋志向の外交政策を追求しており、米国やヨーロッパとの関係を強化しています。"},{"sentence":"The political party is Western-oriented, advocating for closer integration with the European Union.","translation":"その政党は西洋志向で、欧州連合とのより緊密な統合を提唱しています。"}],"collocations":["Western-oriented foreign policy (西洋志向の外交政策)","Western-oriented alliance (西洋志向の同盟)","Western-oriented partnership (西洋志向のパートナーシップ)"],"synonyms":["pro-Western","Atlanticist"],"antonyms":["anti-Western","isolationist"]}],"etymology":{"value":"「Western」は西洋の、西洋的なという意味。「oriented」は～志向の、～を重視するという意味。この二つが組み合わさって、西洋の文化や価値観を重視する、または西洋諸国との関係を重視するという意味になった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛstərn ˈɔːriˌɛntɪd/","syllables":"Wes-tern-o-ri-en-ted"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**Western-oriented**」は、文化、教育、政治、経済など、さまざまな分野で使用されます。西洋の文化、価値観、考え方を好む、またはそれに影響を受けていることを示す場合に使われます。また、外交政策や国際関係においては、西洋諸国との関係を重視する姿勢を表す場合にも使われます。この言葉は、中立的な意味合いで使用されることもありますが、文脈によっては、西洋中心主義的な視点や、他の文化を軽視するニュアンスを含む場合もあるため、注意が必要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Western-oriented person, so he doesn't like Asian food.","correct":"✓ He is a Western-oriented person, but he still enjoys some Asian food.","note":"西洋志向の人でも、必ずしも他の文化を嫌うわけではありません。西洋志向であることと、他の文化を尊重することは両立し得ます。"},{"incorrect":"✗ The country is becoming more Western-oriented, which is a bad thing.","correct":"✓ The country is becoming more Western-oriented, which has both positive and negative consequences.","note":"西洋化が進むことは、必ずしも悪いことではありません。良い面と悪い面の両方があることを考慮する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["orientation (名詞: 志向、方向性)","orient (動詞: ～を方向づける、～を適応させる)","Westernize (動詞: 西洋化する)","Westernization (名詞: 西洋化)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の分野や議論で使われる専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Western-oriented**」は、ある物事や人が西洋の文化、価値観、または西洋諸国との関係を重視していることを表す言葉です。例えば、教育制度が西洋の教育方法を取り入れている場合や、外交政策が西洋諸国との連携を優先している場合などに使われます。この言葉は、西洋化が進んでいる状況を説明する際によく用いられますが、西洋中心主義的な視点を含む可能性もあるため、注意が必要です。より高度な語彙力と、文化的な背景知識が求められます。"},"example_sentences":[{"sentence":"The university offers a Western-oriented business program.","translation":"その大学は西洋志向のビジネスプログラムを提供しています。","type":"adjective","meaning_category":"西洋志向の（教育）"},{"sentence":"The country's economic reforms are increasingly Western-oriented.","translation":"その国の経済改革はますます西洋志向になっています。","type":"adjective","meaning_category":"西洋志向の（経済）"},{"sentence":"Many young people in the city have Western-oriented lifestyles.","translation":"その都市の多くの若者は西洋志向のライフスタイルを送っています。","type":"adjective","meaning_category":"西洋志向の（ライフスタイル）"},{"sentence":"The museum's collection is Western-oriented, featuring European art from the 18th and 19th centuries.","translation":"その美術館のコレクションは西洋志向で、18世紀から19世紀のヨーロッパ美術を展示しています。","type":"adjective","meaning_category":"西洋志向の（文化）"}]}