{"word":"nabobishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"成金趣味に、富豪ぶって、贅沢に","english_definition":"In a manner characteristic of a nabob; ostentatiously wealthy or luxurious.","examples":[{"sentence":"The mansion was decorated nabobishly, with gold trim and expensive artwork.","translation":"その邸宅は、金の装飾や高価な美術品で、成金趣味に飾られていた。"},{"sentence":"He lived nabobishly, throwing lavish parties and spending money without a second thought.","translation":"彼は贅沢なパーティーを開き、何も考えずに金を使って、富豪ぶって暮らしていた。"}],"collocations":["live nabobishly","decorate nabobishly","spend nabobishly"],"synonyms":["ostentatiously","luxuriously","extravagantly","pompously","showily"],"antonyms":["modestly","simply","frugally","unassumingly"]}],"etymology":{"value":"Derived from 'nabobish', which is formed by adding the suffix '-ly' to 'nabob'. 'Nabob' originates from the Hindi word 'nawab', meaning a governor or wealthy person, especially one who returned to Europe with a fortune from India during the British colonial period.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪboʊbɪʃli/","syllables":"na-bob-ish-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Nabobishly' describes actions or qualities associated with nabobs, individuals who amassed great wealth, often through colonial exploitation, and displayed it ostentatiously. The term implies a sense of vulgarity or lack of refinement in their display of wealth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted nabobishly modest.","correct":"✓ He acted nabobishly, but it was all a facade.","note":"'Nabobishly' describes a way of acting, so it cannot be combined with words that describe opposite behavior like 'modest'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nabob (noun)","nabobish (adjective)"],"phrases":["nouveau riche","new money"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nabobishly' is relatively rare and sophisticated. It describes behavior or a style of living that is ostentatiously wealthy, often in a way that is considered vulgar or lacking in taste. Understanding the historical context of 'nabobs' (individuals who made fortunes in colonial India) is helpful for fully grasping the meaning of this word."},"example_sentences":[{"sentence":"The newly built casino was designed to attract tourists who wanted to gamble nabobishly.","translation":"新しく建てられたカジノは、観光客が成金趣味にギャンブルをしたいと思わせるように設計された。","type":"adverb","meaning_category":"贅沢に"},{"sentence":"She furnished her apartment nabobishly, filling it with expensive antiques and designer furniture.","translation":"彼女は自分のアパートを、高価なアンティークやデザイナー家具で満たし、成金趣味に飾り付けた。","type":"adverb","meaning_category":"富豪ぶって"}]}