{"word":"Romancer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ロマンチックな物語を作る人、または語る人","english_definition":"A person who creates or tells romantic stories.","examples":[{"sentence":"He was a great romancer, always embellishing his tales with fantastical details.","translation":"彼は素晴らしいロマンティストで、いつも空想的な詳細で自分の物語を飾り立てていた。"},{"sentence":"She dismissed him as a romancer, unwilling to believe his far-fetched stories.","translation":"彼女は彼の突飛な話を信じようとせず、彼をロマンチックな物語を作る人だと切り捨てた。"}],"collocations":["a skilled romancer","a prolific romancer","an imaginative romancer"],"synonyms":["storyteller","narrator","fabulist","raconteur"],"antonyms":["realist","pragmatist"]},{"part_of_speech":"noun","definition":"口説き上手な人、恋愛を仕掛ける人","english_definition":"A person who attempts to seduce or win someone's affection; a flirt.","examples":[{"sentence":"He was known as a romancer, always trying to charm the ladies.","translation":"彼は口説き上手として知られており、いつも女性を魅了しようとしていた。"},{"sentence":"She found his romancer's advances amusing but ultimately insincere.","translation":"彼女は彼の口説き文句を面白いと思ったが、結局は誠実ではないと感じた。"}],"collocations":["a charming romancer","a persistent romancer","a smooth romancer"],"synonyms":["seducer","charmer","flirt","wooer","lover"],"antonyms":["prude","tease"]},{"part_of_speech":"noun","definition":"理想化された、または非現実的な見方をする人","english_definition":"A person who views things in an idealized or unrealistic way.","examples":[{"sentence":"As a romancer, he saw the world through rose-colored glasses.","translation":"ロマンチストとして、彼は世界をバラ色のメガネを通して見ていた。"},{"sentence":"The romancer's vision of a utopian society clashed with the harsh realities of the world.","translation":"ロマンチストの理想郷のビジョンは、世界の厳しい現実と衝突した。"}],"collocations":["a hopeless romancer","an idealistic romancer","a naive romancer"],"synonyms":["idealist","dreamer","visionary","romantic"],"antonyms":["cynic","skeptic"]}],"etymology":{"value":"Derived from 'romance,' referring to a romantic story or affair. The suffix '-er' denotes a person who performs the action or is associated with the noun.","priority":"★★☆"},"pronunciation":{"ipa":"/roʊˈmænsər/","syllables":"ro-manc-er"},"inflection":{"noun_plural":"Romancers"},"usage_notes":{"explanation":"The term 'Romancer' can have different connotations depending on the context. It can refer to someone who tells or creates romantic stories, someone who is skilled at seduction, or someone who holds an idealized view of the world. The specific meaning is usually clear from the surrounding text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a romancer, so he always tells the truth.","correct":"He is a romancer, so he often exaggerates the truth.","note":"Romancers are often associated with embellishing or exaggerating stories, not necessarily telling the truth."},{"incorrect":"She is a romancer of cars.","correct":"She is a romantic about cars.","note":"When referring to someone who is passionate about something, use 'romantic' instead of 'romancer'."}],"priority":"★☆☆"},"related_words":{"derivatives":["romance (noun, verb)","romantic (adjective, noun)","romantically (adverb)"],"phrases":["romanticize (verb)","romancing (gerund)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Romancer' is a relatively uncommon word that can refer to someone who creates romantic stories, someone who is skilled at seduction, or someone who holds an idealized view of the world. The meaning is usually clear from the context, but it's important to be aware of the different possible interpretations. It is more often used in literature or in discussions about character types than in everyday conversation."},"example_sentences":[{"sentence":"The old man was a romancer, filling his grandchildren's heads with tales of knights and dragons.","translation":"その老人はロマンチストで、孫たちの頭の中を騎士やドラゴンの物語で満たしていた。","type":"noun","meaning_category":"Storyteller"},{"sentence":"She easily saw through his romancer's charm, recognizing it as a ploy to win her over.","translation":"彼女は彼の口説き文句を簡単に見抜き、自分を虜にするための策略だと認識した。","type":"noun","meaning_category":"Seducer"},{"sentence":"He was a romancer at heart, always searching for the perfect love story.","translation":"彼は根っからのロマンチストで、いつも完璧なラブストーリーを探し求めていた。","type":"noun","meaning_category":"Idealist"}]}