{"word":"nondeterminism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非決定性：ある状態から複数の可能な結果が生じうる性質。特に、計算機科学、物理学、哲学などの分野で使用される。","english_definition":"The property of a system or process in which the outcome is not uniquely determined by the initial state; the possibility of multiple outcomes from a single starting point.","examples":[{"sentence":"The algorithm exhibits nondeterminism, potentially leading to different results on each execution.","translation":"そのアルゴリズムは非決定性を示し、実行ごとに異なる結果をもたらす可能性がある。"},{"sentence":"Quantum mechanics introduces nondeterminism at the fundamental level of the universe.","translation":"量子力学は、宇宙の根本的なレベルで非決定性を導入する。"},{"sentence":"Some philosophers argue for nondeterminism to support the concept of free will.","translation":"自由意志の概念を支持するために、非決定性を主張する哲学者もいる。"}],"collocations":["exhibit nondeterminism","introduce nondeterminism","quantum nondeterminism","computational nondeterminism","inherent nondeterminism"],"synonyms":["indeterminacy","randomness","unpredictability"],"antonyms":["determinism","predictability","causality"]}],"etymology":{"value":"\"non-\" (否定) + \"determinism\" (決定論)。決定論の否定として作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒndɪˈtɜːmɪnɪzəm/","syllables":"non-de-ter-mi-ni-sm"},"inflection":{"noun_plural":"nondeterminisms"},"usage_notes":{"explanation":"\"Nondeterminism\"は、結果が事前に決定されていない、または予測できないシステムやプロセスを指します。計算機科学では、同じ入力に対して異なる出力が得られるアルゴリズムを指すことがあります。物理学では、量子力学における粒子の振る舞いなどが非決定性の例として挙げられます。哲学では、自由意志と関連して議論されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is nondeterministic, so it will always give the same result.","correct":"✓ The program is nondeterministic, so it may give different results each time it runs.","note":"非決定的なプログラムは、同じ入力でも常に同じ結果を出すとは限りません。"},{"incorrect":"✗ Nondeterminism means the program is broken.","correct":"✓ Nondeterminism doesn't necessarily mean the program is broken; it might be intentional.","note":"非決定性は必ずしもプログラムの欠陥を意味するわけではありません。意図的に非決定性を取り入れている場合もあります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["nondeterministic (adjective)"],"related_concepts":["determinism","quantum mechanics","free will","algorithm","state space"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の分野で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nondeterminism\" is a complex term used to describe systems where the outcome isn't fixed from the start. Think of it like flipping a coin – you know the possibilities (heads or tails), but you can't predict the result beforehand. In computer science, it means a program might run differently each time, even with the same instructions. In physics, it's linked to quantum mechanics, where things are probabilistic rather than certain. It's also a topic in philosophy when discussing free will. Understanding this term requires some background knowledge in these fields."},"example_sentences":[{"sentence":"The parallel processing system introduced significant nondeterminism in the execution order.","translation":"並列処理システムは、実行順序に大きな非決定性をもたらした。","type":"general","meaning_category":"general"},{"sentence":"In the context of quantum computing, nondeterminism allows for exploring multiple solutions simultaneously.","translation":"量子コンピューティングの文脈では、非決定性により、複数の解を同時に探索することが可能になる。","type":"technical","meaning_category":"technical"},{"sentence":"The debate about free will often revolves around the question of whether human actions are governed by determinism or nondeterminism.","translation":"自由意志に関する議論は、人間の行動が決定論または非決定性のどちらに支配されるかという問題を中心に展開されることが多い。","type":"philosophical","meaning_category":"philosophical"}]}