{"word":"rearii","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマ) レアリイ：ローマ軍の階級の一つで、最も経験の浅い兵士で構成され、通常は軍の後方に配置された。","english_definition":"(Ancient Rome) rearii: A class of soldiers in the Roman army, composed of the least experienced soldiers, usually placed in the rear of the army.","examples":[{"sentence":"The rearii were held in reserve during the battle.","translation":"レアリイは戦闘中、予備兵力として待機していた。"},{"sentence":"The rearii were not as well-equipped as the other soldiers.","translation":"レアリイは他の兵士ほど装備が整っていなかった。"}],"collocations":["Roman rearii","rearii formation","rearii soldiers"],"synonyms":["velites","triarii"],"antonyms":[]}],"etymology":{"value":"ラテン語の「re-」（再び）と「aro」（耕す、準備する）に由来する可能性がある。これは、彼らが戦場での最後の防衛線であり、必要に応じて「再び」戦う準備をするという役割を示唆している。","priority":"☆☆☆"},"pronunciation":{"ipa":"/riˈɛəri.aɪ/","syllables":"re-ar-i-i"},"inflection":{"noun_plural":"rearii"},"usage_notes":{"explanation":"「rearii」は古代ローマ軍の歴史的文脈でのみ使用される専門用語です。現代英語では一般的ではありません。","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"rearii\" is a highly specialized term from ancient Roman military history. It refers to a specific class of soldiers within the Roman legion. Understanding this term requires knowledge of Roman military organization and tactics. It is unlikely to be encountered outside of academic or historical contexts."},"example_sentences":[{"sentence":"The Roman army deployed its hastati, principes, and triarii, with the rearii positioned at the rear.","translation":"ローマ軍はハスタティ、プリンキペス、トリアリイを配置し、レアリイは後方に配置された。","type":"noun","meaning_category":"軍事"},{"sentence":"As the battle intensified, the rearii were called upon to reinforce the front lines.","translation":"戦闘が激化するにつれて、レアリイは前線を強化するために召集された。","type":"noun","meaning_category":"軍事"}]}