{"word":"Peptization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ペプタイゼーション、解膠(かいこう)","english_definition":"The process of converting a precipitate into a colloidal solution.","examples":[{"sentence":"Peptization is used in the preparation of colloidal solutions.","translation":"ペプタイゼーションは、コロイド溶液の調製に用いられる。"},{"sentence":"The peptization of ferric hydroxide can be achieved by adding a small amount of ferric chloride.","translation":"水酸化鉄のペプタイゼーションは、少量の塩化鉄を加えることで達成できる。"}],"collocations":["peptization process","peptization agent"],"synonyms":["dispersion","colloid formation"],"antonyms":["coagulation","precipitation"]}],"etymology":{"value":"Derived from 'peptize,' which comes from 'pepsin,' an enzyme that breaks down proteins into smaller peptides. The term was extended to describe the general process of dispersing a precipitate into a colloidal solution.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpeptaɪˈzeɪʃən/","syllables":"pep-ti-za-tion"},"inflection":{"noun_plural":"peptizations"},"usage_notes":{"explanation":"Peptization is a specific process in colloid chemistry where a precipitate is converted back into a colloidal solution. This is typically achieved by adding a peptizing agent which adsorbs onto the precipitate particles, causing them to repel each other and disperse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Peptization is the same as precipitation.","correct":"✓ Peptization is the reverse of precipitation.","note":"Peptization is the process of dispersing a precipitate, while precipitation is the formation of a solid from a solution."}],"priority":"★☆☆"},"related_words":{"derivatives":["peptize (verb)","peptizing (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peptization' is a technical term used in chemistry, specifically in the field of colloid chemistry. It refers to the process of converting a precipitate (a solid that has come out of a solution) back into a colloidal solution (a mixture where tiny particles are evenly dispersed in a liquid). This is usually done by adding a 'peptizing agent' which helps to stabilize the dispersed particles. This term is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The **peptization** of silver chloride can be induced by adding a small amount of silver nitrate.","translation":"塩化銀のペプタイゼーションは、少量の硝酸銀を加えることで誘導できる。","type":"noun","meaning_category":"解膠"},{"sentence":"Understanding the mechanism of **peptization** is crucial in many industrial applications.","translation":"ペプタイゼーションのメカニズムを理解することは、多くの産業応用において重要である。","type":"noun","meaning_category":"解膠"}]}