{"word":"Noma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"壊疽性口内炎（かいそせいこうないえん）：顔面、特に口や鼻の周囲に急速に広がる重度の壊死性感染症。主に栄養不良の子供に見られる。","english_definition":"A severe necrotizing infection that rapidly spreads on the face, especially around the mouth and nose. It primarily affects malnourished children.","examples":[{"sentence":"Noma is a devastating disease that can cause significant facial disfigurement.","translation":"野間は、顔面に重大な変形を引き起こす可能性のある壊滅的な疾患です。"},{"sentence":"Early diagnosis and treatment are crucial to prevent the progression of Noma.","translation":"野間の進行を防ぐためには、早期の診断と治療が不可欠です。"}],"collocations":["facial Noma (顔面の野間)","Noma treatment (野間治療)","Noma prevention (野間予防)","Noma awareness (野間啓発)"],"synonyms":["cancrum oris","gangrenous stomatitis","necrotizing stomatitis"],"antonyms":[]}],"etymology":{"value":"語源はギリシャ語の 'νομή' (nomē) で、「むさぼり食うこと、広がり」を意味する。これは、この病気が組織を急速に破壊する様子を表している。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnoʊmə/","syllables":"No-ma"},"inflection":{"notes":"名詞なので、複数形はありません。"},"usage_notes":{"explanation":"Noma (野間) は、主に栄養不良、不衛生な環境、免疫系の低下が原因で発生する重篤な感染症です。多くの場合、貧困地域で見られます。治療には、栄養補給、抗生物質、外科的再建が含まれます。世界保健機関（WHO）は、野間の撲滅に取り組んでいます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Noma is a contagious disease like the flu.","correct":"✓ Noma is not directly contagious, but it often affects those with weakened immune systems.","note":"野間は直接的な伝染病ではありませんが、免疫力が低下している人に発生しやすいです。"},{"incorrect":"✗ Noma only affects adults.","correct":"✓ Noma primarily affects children, especially those who are malnourished.","note":"野間は主に子供、特に栄養不良の子供に影響を与えます。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (医学用語)","frequency_google_ngram":"低頻度 (Low frequency) - 医学文献や特定の分野以外ではあまり使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Noma」は、主に医療関係者や公衆衛生に関わる人々が使用する専門用語です。栄養不良や不衛生な環境に起因する、顔面に急速に広がる重度の壊死性感染症を指します。この単語は、一般的な会話や文章ではほとんど見られませんが、医学的な文脈では重要な意味を持ちます。WHOなどの国際機関が、この病気の撲滅に取り組んでいます。"},"example_sentences":[{"sentence":"The NGO is working to combat Noma in several African countries.","translation":"そのNGOは、アフリカのいくつかの国で野間と闘う活動をしています。","type":"noun","meaning_category":"壊疽性口内炎"},{"sentence":"Children suffering from Noma often face social stigma.","translation":"野間を患っている子供たちは、しばしば社会的な偏見に直面します。","type":"noun","meaning_category":"壊疽性口内炎"},{"sentence":"Surgical reconstruction can help improve the quality of life for Noma survivors.","translation":"外科的再建は、野間からの生存者の生活の質を向上させるのに役立ちます。","type":"noun","meaning_category":"壊疽性口内炎"}]}