{"word":"epexegesis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"付加的説明、詳細な解釈、補足説明","english_definition":"An additional explanation; a detailed interpretation or supplementary explanation.","examples":[{"sentence":"The author provided an epexegesis of the poem's complex symbolism.","translation":"著者はその詩の複雑な象徴主義について詳細な解釈を提供した。"},{"sentence":"His epexegesis clarified the ambiguous passage in the text.","translation":"彼の補足説明は、テキスト中の曖昧な箇所を明確にした。"},{"sentence":"The professor's epexegesis of the ancient text was insightful and comprehensive.","translation":"教授による古代テキストの付加的説明は、洞察力に富み、包括的だった。"}],"collocations":["provide an epexegesis","offer an epexegesis","detailed epexegesis","exegetical epexegesis"],"synonyms":["explanation","interpretation","elucidation","explication","commentary","exposition"],"antonyms":["obfuscation","mystification","simplification"]}],"etymology":{"value":"Derived from the Greek word ἐπεξήγησις (epexēgēsis), meaning 'explanation' or 'interpretation'. It is composed of ἐπί (epi), meaning 'upon' or 'in addition to', and ἐξήγησις (exēgēsis), meaning 'explanation' or 'interpretation'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪkˈsiːdʒɪsɪs/","syllables":"ep-e-xe-ge-sis"},"inflection":{"noun_plural":"epexegeses"},"usage_notes":{"explanation":"'Epexegesis' refers to a detailed or supplementary explanation that clarifies or expands upon a previous statement or text. It is often used in academic, literary, or theological contexts to provide a deeper understanding of complex material. The term implies a thorough and insightful analysis that goes beyond a simple summary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epexegesis was too simplify.","correct":"✓ The epexegesis was too simplistic.","note":"'Simplify' is a verb, whereas 'simplistic' is an adjective that describes something as overly simplified. Therefore, 'simplistic' is more appropriate in this context."},{"incorrect":"✗ He gave an epexegesis, but it confused everyone.","correct":"✓ He gave an explanation, but it confused everyone.","note":"If the explanation is confusing, it might be better to use the more general term 'explanation' rather than 'epexegesis', which implies a clarifying interpretation."}],"priority":"★☆☆"},"related_words":{"derivatives":["exegete (名詞: 注釈者、解釈者)","exegetical (形容詞: 注釈的な、解釈的な)","exegesis (名詞: 注釈、解釈)"],"phrasal_verbs":[],"related_concepts":["hermeneutics (解釈学)","commentary (注釈)","exposition (解説)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epexegesis' is a relatively rare and specialized term, primarily used in academic or literary contexts. It refers to a detailed and supplementary explanation that clarifies or expands upon a previous statement or text. Understanding this word requires a strong vocabulary and familiarity with academic discourse. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The scholar's epexegesis of the ancient manuscript shed new light on its meaning.","translation":"学者による古代写本の付加的説明は、その意味に新たな光を当てた。","type":"noun","meaning_category":"詳細な解釈"},{"sentence":"The author included an epexegesis in the appendix to further explain the complex themes of the novel.","translation":"著者は小説の複雑なテーマをさらに説明するために、付録に補足説明を含めた。","type":"noun","meaning_category":"補足説明"},{"sentence":"The theologian offered an epexegesis of the biblical passage, providing historical and cultural context.","translation":"神学者は聖書の箇所について付加的説明を行い、歴史的および文化的背景を提供した。","type":"noun","meaning_category":"詳細な解釈"}]}