{"word":"oil-hardening","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"油焼き入れ","english_definition":"A heat treatment process in which a metal object is heated and then quenched in oil to increase its hardness.","examples":[{"sentence":"Oil-hardening is a common method for increasing the durability of steel tools.","translation":"油焼き入れは、鋼製工具の耐久性を高める一般的な方法です。"}],"collocations":["oil-hardening process","oil-hardening steel"],"synonyms":["oil quenching"],"antonyms":["annealing","tempering"]},{"part_of_speech":"verb","definition":"油焼き入れする","english_definition":"To subject a metal object to oil-hardening.","examples":[{"sentence":"The manufacturer oil-hardens the gears to improve their wear resistance.","translation":"製造業者は、ギアの耐摩耗性を向上させるために油焼き入れを行います。"}],"collocations":["oil-harden steel","oil-harden a tool"],"synonyms":["oil quench"],"antonyms":["anneal","temper"]}],"etymology":{"value":"Derived from the combination of \"oil\" and \"hardening\", referring to the process of hardening metal by quenching it in oil.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔɪlˌhɑːrdənɪŋ/","syllables":"oil-har-den-ing"},"inflection":{"noun_plural":"oil-hardenings","verb_forms":{"present_simple":["oil-harden","oil-hardens"],"past_simple":"oil-hardened","past_participle":"oil-hardened","present_participle":"oil-hardening"}},"usage_notes":{"explanation":"Oil-hardening is a specific type of heat treatment used to increase the hardness and durability of metal objects, particularly steel. The process involves heating the metal to a high temperature and then rapidly cooling it by immersing it in oil. This rapid cooling, or quenching, causes changes in the metal's crystalline structure, resulting in increased hardness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Water-hardening is the same as oil-hardening.","correct":"Water-hardening and oil-hardening are different quenching methods, each affecting the metal differently.","note":"Water-hardening and oil-hardening are different processes that result in varying degrees of hardness and can affect the metal's properties differently."}],"priority":"★★☆"},"related_words":{"derivatives":["hardened","hardening","oil quenching"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'oil-hardening' refers to a technical process used in metallurgy. It involves heating a metal, typically steel, to a specific temperature and then rapidly cooling it by immersing it in oil. This process increases the hardness and durability of the metal. The rapid cooling causes changes in the metal's crystalline structure, which is what leads to the increased hardness. This term is most commonly used in engineering and manufacturing contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The steel was subjected to oil-hardening to improve its strength.","translation":"鋼は強度を向上させるために油焼き入れ処理を受けました。","type":"noun","meaning_category":"熱処理"},{"sentence":"They oil-harden the blades to ensure they stay sharp longer.","translation":"彼らは刃がより長く鋭さを保つように油焼き入れをします。","type":"verb","meaning_category":"熱処理する"}]}