{"word":"bankers","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"銀行家たち、銀行業に携わる人々","english_definition":"plural of banker: people who work in banking, especially at a high level","examples":[{"sentence":"The bankers made a lot of money this year.","translation":"銀行家たちは今年、たくさんのお金を稼ぎました。"},{"sentence":"The government is trying to regulate the activities of the bankers.","translation":"政府は銀行家たちの活動を規制しようとしています。"},{"sentence":"Many bankers attended the conference.","translation":"多くの銀行家がその会議に出席しました。"}],"collocations":["investment bankers (投資銀行家)","central bankers (中央銀行家)","local bankers (地元の銀行家)"],"synonyms":["financiers","investors","lenders","creditors"],"antonyms":["borrowers","debtors"]}],"etymology":{"value":"'Bankers' is simply the plural form of 'banker.' 'Banker' itself comes from 'bank,' referring to a financial institution. The word 'bank' is derived from the Italian word 'banca,' which means 'bench' or 'moneychanger's table.' Early bankers conducted their business on benches in public squares.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæŋkərz/","syllables":"ban-kers"},"inflection":{"noun_plural":"bankers"},"usage_notes":{"explanation":"'Bankers' refers to a group of people who work in the banking industry, typically in positions of authority or influence. It is often used in discussions about finance, economics, and investment. The term can sometimes carry negative connotations, especially when referring to perceived greed or unethical behavior within the banking sector.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The banker are responsible for the crisis.","correct":"✓ The bankers are responsible for the crisis.","note":"'Bankers' is plural, so it requires a plural verb ('are')."},{"incorrect":"✗ He is one of the banker.","correct":"✓ He is one of the bankers.","note":"When using 'one of,' the following noun must be plural."}],"priority":"★★☆"},"related_words":{"derivatives":["bank (noun, verb)","banking (noun)","banker (noun singular)"],"related_concepts":["finance","investment","economics","regulation","capitalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in news and financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bankers' is the plural form of 'banker,' referring to individuals who work in the banking industry, often in positions of management or finance. The term is commonly used in discussions related to economics, financial markets, and government regulations affecting the banking sector. Understanding the role of bankers is important for comprehending how financial systems operate and the impact of banking decisions on the economy. The word can sometimes carry negative connotations, particularly in discussions about economic inequality or financial crises."},"example_sentences":[{"sentence":"The **bankers** discussed the new economic policy at the meeting.","translation":"銀行家たちは会議で新しい経済政策について議論しました。","type":"noun","meaning_category":"銀行業に携わる人々"},{"sentence":"Many **bankers** were criticized for their role in the financial crisis.","translation":"多くの銀行家が金融危機における彼らの役割について批判されました。","type":"noun","meaning_category":"銀行業に携わる人々"},{"sentence":"The **bankers** are responsible for managing the bank's assets.","translation":"銀行家たちは銀行の資産を管理する責任があります。","type":"noun","meaning_category":"銀行業に携わる人々"}]}