{"word":"thyroidin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"乾燥甲状腺製剤、チロイド剤","english_definition":"A preparation of dried thyroid gland, formerly used as a medicine to treat hypothyroidism.","examples":[{"sentence":"The doctor prescribed thyroidin for her hypothyroidism.","translation":"医師は彼女の甲状腺機能低下症に対してチロイド剤を処方した。"},{"sentence":"Thyroidin was one of the earliest treatments for thyroid deficiency.","translation":"チロイド剤は甲状腺機能不全に対する最も初期の治療法の1つだった。"}],"collocations":["thyroidin tablets","thyroidin therapy","prescribe thyroidin"],"synonyms":["thyroid extract","desiccated thyroid"],"antonyms":[]}],"etymology":{"value":"Derived from 'thyroid' (甲状腺) + '-in' (接尾辞, 製剤を示す).","priority":"★★☆"},"pronunciation":{"ipa":"/θaɪˈrɔɪdɪn/","syllables":"thy-roid-in"},"inflection":{"noun_plural":"thyroidins"},"usage_notes":{"explanation":"'Thyroidin' is an older term for desiccated thyroid extract, a medication derived from animal thyroid glands. It was historically used to treat hypothyroidism. Modern treatments often use synthetic thyroid hormones, but desiccated thyroid is still prescribed by some practitioners.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take thyroxin, which is the same as thyroidin.","correct":"✓ I take thyroxine, which is a synthetic thyroid hormone, while thyroidin is a natural extract.","note":"Thyroxine (T4) is a specific thyroid hormone, often synthetic, while thyroidin is a broader term for desiccated thyroid extract containing various thyroid hormones."}],"priority":"★☆☆"},"related_words":{"derivatives":["thyroid","thyroxine","triiodothyronine","hypothyroidism","hyperthyroidism"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thyroidin' is a technical term related to medicine and endocrinology. It refers to a specific type of medication derived from animal thyroid glands. Understanding this term requires knowledge of thyroid function and hormone replacement therapy. It's primarily encountered in medical contexts or historical discussions of thyroid treatments."},"example_sentences":[{"sentence":"The patient was started on a low dose of thyroidin to manage her symptoms.","translation":"患者は症状を管理するために、チロイド剤の低用量から投与を開始された。","type":"noun","meaning_category":"medication"},{"sentence":"Historically, thyroidin was used to treat goiter and other thyroid disorders.","translation":"歴史的に、チロイド剤は甲状腺腫やその他の甲状腺疾患の治療に使用されていた。","type":"noun","meaning_category":"historical treatment"}]}