{"word":"red-figure","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"（古代ギリシアの陶器について）赤像式の","english_definition":"(of ancient Greek pottery) having red figures on a black background.","examples":[{"sentence":"red-figure pottery was a popular style in ancient Greece.","translation":"赤像式陶器は古代ギリシアで人気のある様式でした。"},{"sentence":"The museum has a large collection of red-figure vases.","translation":"その博物館は赤像式花瓶の大きなコレクションを持っています。"}],"collocations":["red-figure vase","red-figure pottery","red-figure style"],"synonyms":[],"antonyms":["black-figure"]},{"part_of_speech":"noun","definition":"赤像式陶器","english_definition":"the red-figure style of ancient Greek pottery.","examples":[{"sentence":"The red-figure is characterized by its intricate details.","translation":"赤像式陶器はその複雑なディテールによって特徴づけられる。"},{"sentence":"Many examples of red-figure have been found in archaeological digs.","translation":"赤像式陶器の多くの例が考古学的発掘で発見されている。"}],"collocations":["examples of red-figure","red-figure technique"],"synonyms":[],"antonyms":["black-figure"]}],"etymology":{"value":"Derived from the visual characteristic of the pottery style, where figures are depicted in red against a black background.","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛd ˈfɪɡər/","syllables":"red-fig-ure"},"inflection":{"notes":"The noun form is typically uncountable, referring to the style in general. Plural may be used when referring to specific examples."},"usage_notes":{"explanation":"'Red-figure' refers specifically to a style of ancient Greek pottery that emerged around 520 BC in Athens. It is characterized by figures painted in red on a black background, which is the reverse of the earlier black-figure style. The red-figure technique allowed for greater detail and naturalism in the depiction of figures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ red figure pottery","correct":"✓ red-figure pottery","note":"It is generally written with a hyphen when used as a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["black-figure (pottery style)","Attic pottery"],"related_terms":["pottery","vase","ancient Greece","archaeology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'red-figure' is specific to the field of classical archaeology and art history, particularly in the study of ancient Greek pottery. Understanding this term requires familiarity with ancient Greek art and culture. It is not commonly used outside of academic or specialized contexts."},"example_sentences":[{"sentence":"The artist used a fine brush to create intricate details on the red-figure vase.","translation":"その芸術家は細い筆を使って赤像式花瓶に複雑なディテールを描いた。","type":"adjective","meaning_category":"describing pottery"},{"sentence":"Scholars study red-figure to learn about ancient Greek life and mythology.","translation":"学者たちは古代ギリシアの生活と神話について学ぶために赤像式陶器を研究する。","type":"noun","meaning_category":"pottery style"}]}