{"word":"Mainstreetism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に軽蔑的に) 小さな町やその住民に関連する価値観、態度、ライフスタイル。保守的、狭量、物質主義的、知的でない、または洗練されていないと見なされることが多い。","english_definition":"(often derogatory) the values, attitudes, and lifestyle associated with small towns and their inhabitants, often viewed as conservative, narrow-minded, materialistic, unintellectual, or unsophisticated.","examples":[{"sentence":"The novel satirizes the Mainstreetism of small-town America.","translation":"その小説は、アメリカの小さな町のメインストリートイズムを風刺している。"},{"sentence":"He rejected the Mainstreetism he grew up with, seeking a more cosmopolitan life.","translation":"彼は育ったメインストリートイズムを拒否し、より国際的な生活を求めた。"},{"sentence":"The politician's appeal to Mainstreetism resonated with many voters.","translation":"その政治家のメインストリートイズムへの訴えは、多くの有権者の共感を呼んだ。"}],"collocations":["small-town Mainstreetism (小さな町のメインストリートイズム)","provincial Mainstreetism (地方のメインストリートイズム)","rural Mainstreetism (田舎のメインストリートイズム)","escape Mainstreetism (メインストリートイズムから逃れる)","reject Mainstreetism (メインストリートイズムを拒否する)","criticize Mainstreetism (メインストリートイズムを批判する)"],"synonyms":["provincialism","parochialism","small-mindedness","narrow-mindedness","conservatism","materialism","anti-intellectualism"],"antonyms":["cosmopolitanism","sophistication","intellectualism","progressivism"]}],"etymology":{"value":"Sinclair Lewisの小説『Main Street』（1920年）に由来する。この小説は、ミネソタ州の架空の小さな町であるGopher Prairieの住民の生活と価値観を批判的に描いた。小説の成功により、「Main Street」はアメリカの小さな町を指す一般的な言葉となり、「Mainstreetism」はそれらの町に関連する価値観や態度を指す言葉として生まれた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmeɪnstriːtɪzəm/","syllables":"Main-street-ism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Mainstreetism**」は、アメリカの小さな町（特にメインストリートのあるような）に関連付けられる価値観、態度、ライフスタイルを指す言葉です。多くの場合、保守的、狭量、物質主義的、知的でない、または洗練されていないという否定的な意味合いで使用されます。この言葉は、Sinclair Lewisの小説『Main Street』に由来し、この小説は小さな町の生活を批判的に描いています。この言葉はしばしば軽蔑的な意味合いで使用されますが、時には小さな町のコミュニティの結束や伝統を指す肯定的な意味合いで使用されることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He embraced Mainstreetism and moved to the city.","correct":"✓ He rejected Mainstreetism and moved to the city.","note":"Mainstreetismは通常、都市生活とは対照的な、小さな町の価値観を指すため、都市に引っ越すことはMainstreetismを受け入れることとは対照的です。"},{"incorrect":"✗ Mainstreetism is a positive force for innovation.","correct":"✓ Mainstreetism is often criticized for its resistance to change and innovation.","note":"Mainstreetismは、変化や革新に対する抵抗と関連付けられることが多いため、革新のための肯定的な力とは見なされにくいです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Main Street (メインストリート)","Main Streeter (メインストリートに住む人、メインストリート的な価値観を持つ人)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Mainstreetism**」は、アメリカの小さな町に見られるとされる価値観や考え方を指す言葉で、少し難しい単語です。保守的で、視野が狭く、物質主義的であるといった、あまり良くないイメージで使われることが多いです。この言葉は、Sinclair Lewisという作家の有名な小説「Main Street」から来ています。この小説は、小さな町の生活を批判的に描いています。そのため、「Mainstreetism」は、都会的で洗練された生活とは対照的な、田舎の保守的な考え方を表す言葉として使われます。"},"example_sentences":[{"sentence":"The film explores the tensions between urban progressivism and rural **Mainstreetism**.","translation":"その映画は、都市部の進歩主義と田舎のメインストリートイズムの間の緊張関係を探求している。","type":"noun","meaning_category":"小さな町の価値観"},{"sentence":"Her art was a reaction against the perceived limitations of **Mainstreetism**.","translation":"彼女の芸術は、認識されているメインストリートイズムの限界に対する反発だった。","type":"noun","meaning_category":"小さな町の価値観"},{"sentence":"The candidate tried to appeal to both urban and rural voters, but struggled to bridge the gap between their differing values and the perceived **Mainstreetism** of his rural base.","translation":"その候補者は都市部と農村部の両方の有権者にアピールしようとしたが、彼らの異なる価値観と、彼の農村部の支持基盤の認識されているメインストリートイズムとの間のギャップを埋めるのに苦労した。","type":"noun","meaning_category":"小さな町の価値観"}]}