{"word":"Dungan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(人) ドゥンガン人：中国と中央アジアに住む、中国系のイスラム教徒","english_definition":"A member of a Chinese-speaking Muslim people living primarily in Kazakhstan, Kyrgyzstan, and Russia. They are descendants of Hui people who migrated from China in the 19th century.","examples":[{"sentence":"The Dungan people maintain many of their unique cultural traditions.","translation":"ドゥンガン人は独自の文化的伝統の多くを維持している。"},{"sentence":"Dungan is closely related to Mandarin Chinese.","translation":"ドゥンガン語は標準中国語（普通話）と密接な関係がある。"}],"collocations":["Dungan language","Dungan cuisine","Dungan culture"],"synonyms":["Hui","Chinese Muslim"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ドゥンガン人の、ドゥンガン語の","english_definition":"Relating to the Dungan people or their language.","examples":[{"sentence":"This book is a study of Dungan folklore.","translation":"この本はドゥンガンの民俗学の研究である。"},{"sentence":"He speaks fluent Dungan.","translation":"彼は流暢なドゥンガン語を話す。"}],"collocations":["Dungan language","Dungan script","Dungan traditions"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(言語) ドゥンガン語：主にキリル文字で書かれる中国語の方言","english_definition":"The Dungan language, a variety of Mandarin Chinese spoken by the Dungan people, primarily written in the Cyrillic script.","examples":[{"sentence":"Dungan is mutually intelligible with Mandarin Chinese to a certain extent.","translation":"ドゥンガン語はある程度まで標準中国語と相互理解可能である。"},{"sentence":"The Dungan language has borrowed many words from Russian and other Central Asian languages.","translation":"ドゥンガン語はロシア語やその他の中央アジアの言語から多くの単語を借用している。"}],"collocations":["speak Dungan","learn Dungan","Dungan dictionary"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"Dungan\" is of uncertain origin, but it is believed to be derived from the Turkic word \"Tungan\" or \"Döngän,\" which was used to refer to Chinese Muslims. Another theory suggests it comes from the Chinese word \"东干\" (Dōnggān), meaning \"Eastern Gansu,\" referring to the origin of many Dungan people.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʊŋɡən/","syllables":"Dun-gan"},"inflection":{"notes":"'Dungan' can be a noun (referring to the people or the language) or an adjective (describing something related to the Dungan people or language). It does not have typical plural forms or comparative/superlative forms."},"usage_notes":{"explanation":"The term \"Dungan\" refers to a specific group of Chinese-speaking Muslims primarily located in Central Asia (Kazakhstan, Kyrgyzstan, Russia). They are descendants of Hui people who migrated from China in the 19th century. Their language, also called Dungan, is a dialect of Mandarin Chinese but is written in Cyrillic script. When referring to the language, it is often specified as \"the Dungan language\" to avoid ambiguity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dungans live in China.","correct":"✓ Dungans live in Central Asia (Kazakhstan, Kyrgyzstan, Russia).","note":"While the Dungans originated from China, they primarily reside in Central Asia today."},{"incorrect":"✗ Dungan is written in Chinese characters.","correct":"✓ Dungan is written in Cyrillic script.","note":"The Dungan language uses the Cyrillic alphabet, not Chinese characters."}],"priority":"★★☆"},"related_words":{"derivatives":["Hui (related ethnic group in China)","Mandarin (related language)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Dungan\" is a specialized term referring to a specific ethnic group of Chinese-speaking Muslims living primarily in Central Asia. It can also refer to their language, which is a dialect of Mandarin Chinese written in the Cyrillic script. Understanding this term requires knowledge of the history and demographics of Central Asia and the relationship between the Dungan people and the Hui people in China. It's not a commonly used word in general English conversation."},"example_sentences":[{"sentence":"The **Dungan** community in Kazakhstan has preserved its unique cultural identity.","translation":"カザフスタンの**ドゥンガン**人コミュニティは、独自の文化的アイデンティティを維持している。","type":"noun","meaning_category":"人"},{"sentence":"The **Dungan** language is an unwritten language until the Soviet Union created a Cyrillic script for it.","translation":"**ドゥンガン**語は、ソビエト連邦がキリル文字の文字体系を作るまで、文字を持たない言語だった。","type":"noun","meaning_category":"言語"},{"sentence":"She is studying **Dungan** history at the university.","translation":"彼女は大学で**ドゥンガン**の歴史を研究している。","type":"adjective","meaning_category":"形容詞"}]}