{"word":"resurrectable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"復活可能な、生き返らせることができる","english_definition":"Capable of being resurrected; able to be brought back to life or restored to a former condition.","examples":[{"sentence":"Is this old computer truly resurrectable, or is it beyond repair?","translation":"この古いコンピュータは本当に復活可能なのか、それとも修理不能なのか？"},{"sentence":"The company's reputation, once tarnished, is now considered resurrectable with the new management.","translation":"かつて傷ついたその会社の評判は、新しい経営陣によって復活可能だと考えられている。"}],"collocations":["easily resurrectable","potentially resurrectable","not resurrectable","resurrectable reputation","resurrectable career"],"synonyms":["restorable","revivable","recoverable","renewable","reclaimable"],"antonyms":["irretrievable","irreversible","unrecoverable","irreparable","unsalvageable"]}],"etymology":{"value":"Formed from 'resurrect' (to bring back to life) and '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛzəˈrɛktəbəl/","syllables":"re-sur-rect-a-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more resurrectable' and 'most resurrectable'."},"usage_notes":{"explanation":"'Resurrectable' is used to describe something that, although damaged, ruined, or even dead, has the potential to be brought back to a functional or successful state. It implies that the necessary conditions or means exist to restore it. It is not a very common word, but it is understood in contexts where restoration or revival is being discussed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resurrectable man walked again.","correct":"✓ The resurrected man walked again.","note":"'Resurrectable' describes the *potential* for resurrection, while 'resurrected' describes something that *has already* been resurrected."},{"incorrect":"✗ The resurrectable of the project depends on funding.","correct":"✓ The resurrection of the project depends on funding.","note":"'Resurrectable' is an adjective. The noun form, 'resurrection', should be used when referring to the act or state of being resurrected."}],"priority":"★★☆"},"related_words":{"derivatives":["resurrect (verb): to bring back to life","resurrection (noun): the act of bringing back to life","resurrected (adjective): having been brought back to life"],"phrases":["resurrectable from the ashes (idiomatic): able to rise again from a state of ruin or destruction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resurrectable' is a relatively uncommon word used to describe something that can be brought back to life or restored to a previous condition. It's often used in contexts where something has failed or been damaged but has the potential to be revived. Understanding the base word 'resurrect' (to bring back to life) helps in understanding 'resurrectable'."},"example_sentences":[{"sentence":"The old car was in terrible condition, but the mechanic believed it was still resurrectable.","translation":"その古い車はひどい状態だったが、整備士はまだ復活可能だと信じていた。","type":"adjective","meaning_category":"capable of being restored"},{"sentence":"With enough investment, the failed business plan might be resurrectable.","translation":"十分な投資があれば、その失敗した事業計画は復活可能かもしれない。","type":"adjective","meaning_category":"able to be revived"},{"sentence":"The politician's career, though damaged by scandal, was considered resurrectable by some political analysts.","translation":"その政治家のキャリアは、スキャンダルによって傷つけられたものの、一部の政治アナリストによって復活可能だと考えられていた。","type":"adjective","meaning_category":"having the potential for recovery"}]}