{"word":"oxytocins","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オキシトシン (脳下垂体後葉から分泌されるホルモンで、子宮収縮や母乳分泌を促進する。また、愛情や信頼感などの社会的な行動にも関与するとされる)","english_definition":"plural form of oxytocin; a peptide hormone and neuropeptide normally produced in the hypothalamus and released by the posterior pituitary gland. It plays a role in social bonding, reproduction, childbirth, and the period after childbirth.","examples":[{"sentence":"Oxytocins are often referred to as the 'love hormone' or 'cuddle hormone'.","translation":"オキシトシンはしばしば「愛のホルモン」または「抱擁ホルモン」と呼ばれます。"},{"sentence":"Studies have shown that oxytocins can promote feelings of trust and empathy.","translation":"研究により、オキシトシンは信頼感や共感の気持ちを促進することが示されています。"},{"sentence":"During childbirth, oxytocins stimulate uterine contractions.","translation":"出産中、オキシトシンは子宮の収縮を刺激します。"}],"collocations":["release of oxytocins (オキシトシンの放出)","oxytocins and social bonding (オキシトシンと社会的な絆)","synthetic oxytocins (合成オキシトシン)","oxytocins receptor (オキシトシン受容体)"],"synonyms":["love hormone","cuddle hormone"],"antonyms":[]}],"etymology":{"value":"Derived from 'oxy-' (meaning 'quick, sharp') and '-tocin' (from Greek 'tokos' meaning 'childbirth'), referring to its role in speeding up childbirth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒksɪˈtoʊsɪnz/","syllables":"ox-i-to-cins"},"inflection":{"noun_plural":"oxytocins"},"usage_notes":{"explanation":"'Oxytocins' is the plural form of 'oxytocin.' It is a hormone that plays a key role in various physiological and psychological processes, particularly those related to social bonding and reproduction. While the singular form 'oxytocin' is generally used when discussing the hormone in general, 'oxytocins' may be used when referring to multiple instances of the hormone or different types of oxytocin-related substances.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The oxytocins is important for childbirth.","correct":"✓ Oxytocin is important for childbirth.","note":"When referring to the hormone in general, use the singular form 'oxytocin' with a singular verb. 'Oxytocins' is used when referring to multiple instances or types."},{"incorrect":"✗ She took oxytocins to induce labor.","correct":"✓ She was given oxytocin to induce labor.","note":"In medical contexts, 'oxytocin' is typically administered, not 'taken' by the patient. Also, use the singular form unless referring to multiple types or instances."}],"priority":"★★☆"},"related_words":{"derivatives":["oxytocin (singular form)","oxytocinergic (adjective: relating to or producing oxytocin)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1 (専門的な文脈で使用される)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 医学、生物学、心理学などの専門分野で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oxytocins' is a technical term primarily used in scientific and medical contexts. It refers to a group of hormones, specifically the plural form of 'oxytocin.' Understanding its usage requires familiarity with biology, endocrinology, or related fields. The term is most commonly encountered in research papers, medical journals, or discussions related to childbirth, social behavior, and psychological studies. General English learners are unlikely to encounter this word frequently unless they are studying these specific subjects."},"example_sentences":[{"sentence":"The release of oxytocins during breastfeeding promotes bonding between mother and child.","translation":"授乳中にオキシトシンが放出されることで、母親と子供の間の絆が促進されます。","type":"noun","meaning_category":"ホルモン"},{"sentence":"Researchers are studying the effects of oxytocins on social anxiety.","translation":"研究者たちは、オキシトシンが社会不安に与える影響について研究しています。","type":"noun","meaning_category":"ホルモン"},{"sentence":"Synthetic oxytocins are sometimes used to induce or augment labor.","translation":"合成オキシトシンは、陣痛を誘発または促進するために使用されることがあります。","type":"noun","meaning_category":"ホルモン"},{"sentence":"Dysregulation of oxytocins system has been implicated in autism spectrum disorder.","translation":"オキシトシン系の調節不全は、自閉症スペクトラム障害に関与しているとされています。","type":"noun","meaning_category":"ホルモン"}]}