{"word":"endemisms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)固有性、地方病性","english_definition":"the ecological state of a species being unique to a defined geographic location, such as an island, nation, country or other defined zone, or habitat type; organisms that are indigenous to a place are not endemic to it if they are also found elsewhere.","examples":[{"sentence":"Island ecosystems often exhibit high levels of endemisms.","translation":"島の生態系はしばしば高い固有性を示す。"},{"sentence":"The study focused on the endemisms of the Galapagos Islands.","translation":"その研究はガラパゴス諸島の固有性に焦点を当てた。"}],"collocations":["high endemisms (高い固有性)","island endemisms (島の固有性)","local endemisms (地方の固有性)","species endemisms (種の固有性)"],"synonyms":["native species","indigenous species","local species"],"antonyms":["cosmopolitan species","widespread species"]}],"etymology":{"value":"endemic + -ism","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛndəmɪzəmz/","syllables":"en-de-miz-ems"},"inflection":{"noun_plural":"endemisms"},"usage_notes":{"explanation":"\"Endemisms\" refers to the state or condition of being endemic, which means native and restricted to a particular place. It is often used in the context of biology and ecology to describe species that are found only in a specific geographic area. The plural form, \"endemisms,\" is used to refer to multiple instances or examples of endemic species or the overall phenomenon of endemism in a region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endemism is very high in this region.","correct":"✓ The endemisms are very high in this region.","note":"When referring to multiple instances or the overall phenomenon, use the plural form \"endemisms.\""},{"incorrect":"✗ Endemic is the state of being unique to a place.","correct":"✓ Endemism is the state of being unique to a place.","note":"\"Endemism\" is the noun referring to the state, while \"endemic\" is an adjective describing a species or characteristic."}],"priority":"★★☆"},"related_words":{"derivatives":["endemic (adjective: 固有の)","endemicity (noun: 固有性)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的に低い (Relatively low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Endemisms\" is a term used in biology and ecology to describe the phenomenon of species being unique to a specific geographic location. It's a more technical term, often used in scientific literature or discussions about biodiversity and conservation. The level of understanding required is higher, as it involves ecological concepts and geographic specificity."},"example_sentences":[{"sentence":"The high levels of endemisms in Madagascar make it a biodiversity hotspot.","translation":"マダガスカルの高い固有性は、そこを生物多様性のホットスポットにしている。","type":"noun","meaning_category":"生物学"},{"sentence":"Conservation efforts are crucial to protect areas with high endemisms.","translation":"高い固有性を持つ地域を保護するためには、保全活動が不可欠である。","type":"noun","meaning_category":"生態学"}]}