{"word":"NTIS","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"米国商務省の国立技術情報サービス (National Technical Information Service)","english_definition":"National Technical Information Service; an agency of the U.S. Department of Commerce that serves as a central source for government-funded scientific, technical, engineering, and business-related information.","examples":[{"sentence":"You can find the report on the NTIS website.","translation":"その報告書はNTISのウェブサイトで見つけることができます。"},{"sentence":"NTIS provides access to a wide range of government documents.","translation":"NTISは幅広い政府文書へのアクセスを提供しています。"}],"collocations":["NTIS database","NTIS website","NTIS report"],"synonyms":["National Technical Information Service"],"antonyms":[]}],"etymology":{"value":"An acronym for National Technical Information Service.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛnˌtiːˈaɪˌɛs/","syllables":"en-tee-eye-es"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"NTIS is primarily known as a repository and distributor of government-funded research and technical information. It provides access to reports, data, and other resources that can be valuable for researchers, businesses, and the public.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The NTIS are a good resource.","correct":"✓ NTIS is a good resource.","note":"NTIS is treated as a singular entity, even though it's an acronym for a plural phrase."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["technical report","government document","research data"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in technical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"NTIS is a specialized term referring to the National Technical Information Service, a U.S. government agency. It is primarily encountered in technical, scientific, or business contexts when discussing government-funded research reports and data. Understanding this term is important for accessing and utilizing these resources.","priority":"★★★"},"example_sentences":[{"sentence":"The NTIS collection includes a vast archive of scientific studies.","translation":"NTISのコレクションには、科学研究の膨大なアーカイブが含まれています。","type":"noun","meaning_category":"国立技術情報サービス"},{"sentence":"Researchers often use the NTIS database to find relevant publications.","translation":"研究者は関連する出版物を見つけるために、NTISデータベースをよく利用します。","type":"noun","meaning_category":"国立技術情報サービス"}]}