{"word":"Jewelfish","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ベニツチホ、シクリッド科の観賞魚","english_definition":"A freshwater fish of the cichlid family, Hemichromis bimaculatus, popular in aquariums due to its bright colors.","examples":[{"sentence":"The jewelfish is a beautiful addition to any freshwater aquarium.","translation":"ベニツチホは、どんな淡水水槽にも美しい彩りを添えます。"},{"sentence":"Jewelfish are known for their aggressive behavior, especially during breeding.","translation":"ベニツチホは、特に繁殖期に攻撃的な行動をとることで知られています。"}],"collocations":["freshwater jewelfish","breeding jewelfish","aquarium jewelfish"],"synonyms":["Hemichromis bimaculatus"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヘミクロミス属の魚の総称","english_definition":"Any fish of the genus Hemichromis.","examples":[{"sentence":"Many species of Hemichromis are called jewelfish due to their vibrant colors.","translation":"ヘミクロミス属の多くの種は、鮮やかな色彩からジュエルフィッシュと呼ばれています。"}],"collocations":["African jewelfish"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Jewelfish\" refers to the bright, iridescent colors that resemble jewels on the fish's body.","priority":"★★★"},"pronunciation":{"ipa":"ˈdʒuːəlˌfɪʃ/","syllables":"Jew-el-fish"},"inflection":{"noun_plural":"Jewelfishes or Jewelfish"},"usage_notes":{"explanation":"The term \"Jewelfish\" commonly refers to *Hemichromis bimaculatus*, but it can also refer to other species within the *Hemichromis* genus. These fish are native to Africa and are popular in the aquarium trade. They are known for their vibrant colors, especially when breeding. They can be aggressive, so careful consideration should be taken when choosing tankmates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Jewelfishes are peaceful fish.","correct":"✓ Jewelfish can be aggressive, especially during breeding.","note":"Jewelfish are known to be aggressive, especially when breeding, so it's a common misconception to think they are peaceful."}],"priority":"★★☆"},"related_words":{"derivatives":["Cichlid","Aquarium fish"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"\"Jewelfish\" refers to a type of freshwater fish, specifically those belonging to the *Hemichromis* genus, which are known for their bright, jewel-like colors. The most common species referred to as \"Jewelfish\" is *Hemichromis bimaculatus*. These fish are popular in aquariums but are known for their aggressive behavior, especially when they are breeding. Understanding their temperament is important for aquarium enthusiasts. The term is not commonly used outside of the context of aquarium keeping or fishkeeping.","priority":"★★★"},"example_sentences":[{"sentence":"The **jewelfish** in the aquarium shimmered under the light.","translation":"水槽の中のベニツチホは光の下できらめいていた。","type":"noun","meaning_category":"fish"},{"sentence":"Experienced aquarists recommend providing plenty of hiding places for **jewelfish** to reduce aggression.","translation":"経験豊富なアクアリストは、ベニツチホの攻撃性を軽減するために、隠れ場所をたくさん用意することを推奨しています。","type":"noun","meaning_category":"fish"}]}