{"word":"underbooked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"予約が少ない、予約が埋まっていない","english_definition":"having fewer bookings than expected or desired.","examples":[{"sentence":"The hotel was underbooked during the off-season.","translation":"オフシーズン中、そのホテルの予約は少なかった。"},{"sentence":"The restaurant was surprisingly underbooked on a Saturday night.","translation":"土曜日の夜なのに、そのレストランの予約が驚くほど少なかった。"},{"sentence":"We need to find ways to attract more customers; we're consistently underbooked.","translation":"もっと顧客を引きつける方法を見つける必要があります。予約が常に少ないのです。"}],"collocations":["be underbooked","remain underbooked","become underbooked"],"synonyms":["not fully booked","lightly booked","sparsely booked","under-reserved"],"antonyms":["overbooked","fully booked","completely booked","heavily booked"],"related_words":["booking","reservation","occupancy","capacity"],"usage_notes":{"explanation":"'Underbooked' is often used in the hospitality industry (hotels, restaurants, airlines, etc.) to describe a situation where there are not enough reservations to fill available capacity. It implies that the business is not performing as well as expected.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used outside specific industries.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Underbooked' is a term specifically used in business contexts, particularly in the hospitality and travel industries. It describes a situation where a business has fewer reservations or bookings than they expected or needed. This is the opposite of 'overbooked,' where a business has more reservations than they can accommodate. Understanding this term requires familiarity with business vocabulary. "},"example_sentences":[{"sentence":"The flight was severely underbooked, so they offered upgrades to encourage more passengers.","translation":"その便は予約が非常に少なかったので、より多くの乗客を促すためにアップグレードを提供した。","type":"adjective","meaning_category":"予約が少ない"},{"sentence":"The spa was underbooked all week, which meant the staff had a lot of downtime.","translation":"そのスパは一週間中予約が少なかったので、スタッフは多くの休憩時間があった。","type":"adjective","meaning_category":"予約が少ない"},{"sentence":"We need to analyze why our tours are underbooked compared to last year.","translation":"なぜ私たちのツアーの予約が昨年と比べて少ないのかを分析する必要があります。","type":"adjective","meaning_category":"予約が少ない"}]}],"etymology":{"value":"Formed by adding the prefix 'under-' (meaning 'less than' or 'not enough') to the word 'booked' (meaning 'having reservations').","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌʌndərˈbʊkt/","syllables":"un-der-booked"},"inflection":{},"common_mistakes":{}}