{"word":"pretermitting","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"見過ごす、無視する、考慮に入れない","english_definition":"To leave unsaid or unnoticed; to omit to mention; to pass over without notice; to disregard.","examples":[{"sentence":"Pretermitting other considerations, the cost alone makes this project unfeasible.","translation":"他の考慮事項は見過ごすとして、費用だけでもこのプロジェクトは実現不可能だ。"},{"sentence":"I am pretermitting the details of the argument for the sake of brevity.","translation":"簡潔にするために、議論の詳細は省略する。"}],"collocations":["pretermitting details","pretermitting considerations"],"synonyms":["disregarding","overlooking","omitting","ignoring","bypassing"],"antonyms":["considering","mentioning","noting","including"]}],"etymology":{"value":"From Latin 'praetermittere', meaning 'to pass by, omit, neglect'. 'Praeter-' means 'beyond' and 'mittere' means 'to send'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːtərˈmɪtɪŋ/","syllables":"pre-ter-mit-ting"},"inflection":{"verb_forms":{"present_simple":["pretermits"],"past_simple":"pretermitted","past_participle":"pretermitted","present_participle":"pretermitting"}},"usage_notes":{"explanation":"'Pretermitting' is a relatively formal and uncommon word that means to intentionally leave something unsaid or unconsidered. It is often used to indicate that something is being deliberately omitted for the sake of brevity, clarity, or to focus on more important issues. It suggests a conscious decision to set something aside, rather than a simple oversight.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was pretermitted from the team.","correct":"✓ He was omitted from the team.","note":"'Pretermitting' is not typically used to describe a person being excluded from a group. 'Omitted' is more appropriate in this context."},{"incorrect":"✗ Pretermitting the rain, it was a great day.","correct":"✓ Despite the rain, it was a great day.","note":"'Pretermitting' is not a direct synonym for 'despite'. It implies a deliberate choice to ignore something, rather than simply acknowledging it."}],"priority":"★☆☆"},"related_words":{"derivatives":["pretermission (noun): the act of omitting or disregarding something"],"related_terms":["omit","overlook","disregard","ignore"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pretermitting' is a formal and relatively rare word. It means to deliberately leave something unsaid or unconsidered. It is typically used in academic or legal contexts to indicate that certain details or arguments are being intentionally omitted for the sake of brevity or clarity. Understanding this word requires a strong vocabulary and familiarity with formal writing styles."},"example_sentences":[{"sentence":"Pretermitting the question of his motives, his actions were clearly illegal.","translation":"彼の動機はさておき、彼の行動は明らかに違法だった。","type":"verb","meaning_category":"見過ごす"},{"sentence":"Pretermitting minor errors, the report is generally accurate.","translation":"小さな誤りは見過ごすとして、報告書は概ね正確だ。","type":"verb","meaning_category":"無視する"},{"sentence":"Pretermitting the financial implications, the project is a success.","translation":"財政的な影響は考慮に入れないとして、プロジェクトは成功だ。","type":"verb","meaning_category":"考慮に入れない"}]}