{"word":"unscalably","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"拡張性がないほどに、規模を拡大できないほどに","english_definition":"In a manner that cannot be scaled or expanded effectively.","examples":[{"sentence":"The process was unscalably complex, making it impossible to implement across the entire organization.","translation":"そのプロセスは拡張できないほど複雑で、組織全体に実装することは不可能でした。"},{"sentence":"The initial design proved unscalably inefficient as the user base grew.","translation":"初期の設計は、ユーザーベースの拡大に伴い、規模を拡大できないほど非効率であることが判明しました。"}],"collocations":["unscalably complex (拡張できないほど複雑)","unscalably inefficient (拡張できないほど非効率)","unscalably expensive (拡張できないほど高価)"],"synonyms":["non-scalably","inflexibly","rigidly"],"antonyms":["scalably","flexibly","adaptably"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'scalably', which is derived from 'scalable'. 'Scalable' comes from 'scale', referring to the ability to increase in size or extent.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈskeɪləbli/","syllables":"un-scal-a-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Unscalably' describes something that cannot be easily or effectively expanded to meet increased demand or size. It often implies that the limitations are inherent or fundamental to the design, process, or system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is unscalable, but we can scale it.","correct":"✓ The system is unscalable, so we need to redesign it.","note":"'Unscalable' means it cannot be scaled, so you wouldn't say you can scale it. Instead, indicate a need for change or redesign."},{"incorrect":"✗ The problem is scalably unfixable.","correct":"✓ The problem is unscalably unfixable.","note":"The correct word order is 'unscalably unfixable' to emphasize the inherent inability to scale and fix the issue."}],"priority":"★★☆"},"related_words":{"derivatives":["unscalable (adjective)","scalable (adjective)","scalability (noun)","scale (verb, noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - technical or specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unscalably' is an advanced term used to describe something that cannot be easily expanded or adapted to handle increased demands or growth. It's often used in technical or business contexts to indicate a fundamental limitation in a system, process, or design. If something is described as 'unscalably complex', it means its complexity is so inherent that it cannot be simplified to allow for scaling. Understanding this term requires familiarity with the concept of scalability and the implications of its absence."},"example_sentences":[{"sentence":"The original database architecture proved unscalably slow as the company's data grew exponentially.","translation":"会社のデータが指数関数的に増加するにつれて、元のデータベースアーキテクチャは拡張できないほど遅いことが判明しました。","type":"adverb","meaning_category":"Inability to scale efficiently"},{"sentence":"The manual process was unscalably labor-intensive, requiring a large team even for small increases in workload.","translation":"その手作業のプロセスは拡張できないほど労働集約型であり、作業負荷がわずかに増加した場合でも大規模なチームが必要でした。","type":"adverb","meaning_category":"Inability to handle increased workload"},{"sentence":"The pricing model was unscalably expensive, making it unattractive to larger clients.","translation":"その価格モデルは拡張できないほど高価であり、大規模なクライアントには魅力的ではありませんでした。","type":"adverb","meaning_category":"Inability to scale cost-effectively"}]}