{"word":"Preshapes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) あらかじめ形作られたもの、前もって準備された形状","english_definition":"(plural noun) Objects or forms that have been shaped or prepared in advance.","examples":[{"sentence":"The construction project used preshapes for the arches to save time.","translation":"建設プロジェクトでは、時間を節約するためにアーチのプレシェイプを使用した。"},{"sentence":"The artist created sculptures using various metal preshapes.","translation":"そのアーティストは様々な金属のプレシェイプを使って彫刻を制作した。"},{"sentence":"These plastic preshapes are designed to be easily assembled into toys.","translation":"これらのプラスチック製のプレシェイプは、おもちゃに簡単に組み立てられるように設計されている。"}],"collocations":["metal preshapes (金属製のプレシェイプ)","plastic preshapes (プラスチック製のプレシェイプ)","architectural preshapes (建築用のプレシェイプ)","custom preshapes (カスタムプレシェイプ)"],"synonyms":["preforms","prefabricated shapes","pre-molded forms","ready-made shapes"],"antonyms":["raw materials","unformed shapes","shapeless materials"]}],"etymology":{"value":"The word \"preshapes\" is formed by combining the prefix \"pre-\" (meaning before or in advance) with the noun \"shapes\" (meaning forms or outlines).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpriːʃeɪps/","syllables":"pree-shapes"},"inflection":{"noun_plural":"preshapes (already plural)"},"usage_notes":{"explanation":"\"Preshapes\" refers to items that have been given a preliminary form before further processing or assembly. It is commonly used in manufacturing, construction, and art to describe components that are partially or fully shaped before being incorporated into a final product.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preshape was used for the building.","correct":"✓ The preshapeS were used for the building.","note":"Since it's almost always used in the plural to refer to multiple pre-formed shapes, using the singular is usually incorrect unless referring to a single, specific item."}],"priority":"★★☆"},"related_words":{"derivatives":["preshape (verb: to shape in advance; less common)"],"related_terms":["preform","prefabricate","mold","shape","form"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Preshapes\" is a technical term used to describe objects that have been partially or fully formed before being used in a final product. It's often used in manufacturing, construction, and art. Understanding this term requires some familiarity with these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The factory produces plastic bottle preshapes for beverage companies.","translation":"その工場は飲料会社向けにプラスチックボトルのプレシェイプを製造している。","type":"noun","meaning_category":"manufacturing"},{"sentence":"Using metal preshapes simplified the construction of the dome.","translation":"金属製のプレシェイプを使用することで、ドームの建設が簡素化された。","type":"noun","meaning_category":"construction"},{"sentence":"The artist experimented with various ceramic preshapes to create unique sculptures.","translation":"そのアーティストはユニークな彫刻を作るために、様々なセラミックのプレシェイプを試した。","type":"noun","meaning_category":"art"}]}