{"word":"carpetbeater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に昔使われた) カーペット叩き、絨毯叩き","english_definition":"A tool, usually made of wicker or wire, formerly used for beating carpets to remove dust.","examples":[{"sentence":"She used a carpetbeater to clean the rug.","translation":"彼女は絨毯をきれいにするためにカーペット叩きを使った。"},{"sentence":"Carpetbeaters are rarely used nowadays.","translation":"今日ではカーペット叩きはめったに使われない。"}],"collocations":["use a carpetbeater","old carpetbeater","wicker carpetbeater"],"synonyms":["rug beater"],"antonyms":[]}],"etymology":{"value":"'Carpet' + 'beater'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrpɪtˌbiːtər/","syllables":"car-pet-beat-er"},"inflection":{"noun_plural":"carpetbeaters"},"usage_notes":{"explanation":"A carpetbeater is a tool that was used to remove dust from carpets and rugs. It is typically made of wicker, rattan, or wire. The carpet would be hung up, and then beaten with the carpetbeater to dislodge the dust. Carpetbeaters are rarely used today, as vacuum cleaners are more effective and convenient.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a carpet cleaner to beat the carpet.","correct":"✓ I used a carpetbeater to beat the carpet.","note":"A carpet cleaner is a machine that cleans carpets, while a carpetbeater is a tool used to beat carpets."}],"priority":"★★☆"},"related_words":{"derivatives":["beat (verb)","carpet (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'carpetbeater' refers to a tool that was historically used to clean carpets by beating them to remove dust. It's not a commonly used word in modern English because vacuum cleaners have largely replaced this method of cleaning. If you encounter this word, it's likely in a historical context or when discussing older cleaning methods."},"example_sentences":[{"sentence":"The antique shop had a collection of old household items, including a rusty carpetbeater.","translation":"その骨董品店には、錆びたカーペット叩きを含む古い家庭用品のコレクションがあった。","type":"noun","meaning_category":"tool"},{"sentence":"She found an old carpetbeater in the attic and wondered what it was used for.","translation":"彼女は屋根裏部屋で古いカーペット叩きを見つけ、それが何に使われたのか疑問に思った。","type":"noun","meaning_category":"tool"}]}