{"word":"subradiancy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being somewhat radiant; a lesser degree of radiance.","english_definition":"A lesser or secondary degree of radiance or luminosity.","examples":[{"sentence":"The moon exhibited a gentle subradiancy, barely illuminating the forest floor.","translation":"月は穏やかな準放射性を示し、かろうじて森の地面を照らした。"},{"sentence":"Even in its diminished state, the ember retained a subradiancy that hinted at its former heat.","translation":"弱まった状態でも、燃えさしは以前の熱を示唆する準放射性を保持していた。"}],"collocations":["gentle subradiancy","faint subradiancy","inherent subradiancy"],"synonyms":["dim radiance","faint glow","soft luminosity"],"antonyms":["brilliance","intense radiance"]}],"etymology":{"value":"Derived from the prefix 'sub-' (meaning under, below, or less than) combined with 'radiancy' (the quality of emitting rays of light; brightness).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈreɪdiənsi/","syllables":"sub-ra-di-an-cy"},"inflection":{"noun_plural":"subradiancies"},"usage_notes":{"explanation":"'Subradiancy' is a relatively rare word, often used in descriptive or poetic contexts to denote a subdued or secondary form of radiance. It suggests a gentle or weak emission of light, less intense than full radiance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun's subradiancy was blinding.","correct":"✓ The sun's radiance was blinding.","note":"'Subradiancy' implies a lesser degree of radiance, so it would be contradictory to describe it as blinding."},{"incorrect":"✗ The room was filled with subradiancy.","correct":"✓ The room was filled with a soft glow or The room had a subradiancy.","note":"It's more appropriate to say a room 'had' subradiancy or was filled with something that caused it, like a soft glow."}],"priority":"★☆☆"},"related_words":{"derivatives":["subradiant (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Subradiancy' is a sophisticated term used to describe a faint or secondary form of radiance. It is not commonly used in everyday language and is more likely to be found in literature or scientific writing where precise descriptions of light and luminosity are required. Understanding the prefix 'sub-' and the root word 'radiancy' is key to grasping its meaning."},"example_sentences":[{"sentence":"The fireflies emitted a subtle subradiancy in the twilight.","translation":"ホタルは薄明かりの中で微妙な準放射性を放った。","type":"noun","meaning_category":"Lesser radiance"},{"sentence":"The old photograph had a subradiancy that made it seem almost ethereal.","translation":"古い写真には、ほとんど非現実的に見える準放射性があった。","type":"noun","meaning_category":"Faint glow"}]}