{"word":"Timothies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テモテ (人名) の複数形、またはテモテに由来するもの","english_definition":"Plural form of the name Timothy, or something derived from Timothy.","examples":[{"sentence":"The two Timothies in the Bible were important figures.","translation":"聖書に登場する二人のテモテは重要な人物でした。"},{"sentence":"There are several churches named after the Timothies.","translation":"テモテにちなんで名付けられた教会がいくつかあります。"}],"collocations":["The Epistles to the Timothies","named after Timothies"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek name Τιμόθεος (Timótheos), meaning \"honoring God\" or \"valued by God.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪməθiz/","syllables":"Tim-o-thies"},"inflection":{"noun_plural":"Timothies"},"usage_notes":{"explanation":"\"Timothies\" is primarily used as the plural form of the proper noun \"Timothy,\" which is a male given name. It can refer to multiple individuals named Timothy or things associated with the name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the Timothy.","correct":"✓ He is one of the Timothies.","note":"When referring to multiple people named Timothy, use the plural form \"Timothies.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Timothy (singular form)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Timothies\" is a plural proper noun, referring to multiple individuals named Timothy or entities associated with that name. It is relatively uncommon outside specific contexts such as biblical studies or genealogy. Understanding its usage requires familiarity with proper noun pluralization. "},"example_sentences":[{"sentence":"The professor mentioned the two Timothies in his lecture on early Christian history.","translation":"教授は初期キリスト教史の講義で二人のテモテについて言及しました。","type":"noun","meaning_category":"複数人"},{"sentence":"Several paintings depict scenes from the lives of the Timothies.","translation":"いくつかの絵画は、テモテの生涯からの場面を描いています。","type":"noun","meaning_category":"複数人"}]}