{"word":"Handtrap","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(トレーディングカードゲーム、特に遊戯王OCGにおいて)相手ターンのドローフェイズ、スタンバイフェイズ、メインフェイズ、バトルフェイズ、エンドフェイズに手札から効果を発動できるモンスターカードの総称","english_definition":"(In trading card games, especially Yu-Gi-Oh! OCG) A general term for monster cards whose effects can be activated from the hand during the opponent's Draw Phase, Standby Phase, Main Phase, Battle Phase, or End Phase.","examples":[{"sentence":"Handtraps are commonly used to disrupt the opponent's strategy.","translation":"手札誘発は相手の戦略を妨害するために一般的に使用される。"},{"sentence":"Ash Blossom & Joyous Spring is a popular handtrap.","translation":"灰流うららは人気の手札誘発である。"}],"collocations":["play a handtrap (手札誘発を発動する)","activate a handtrap (手札誘発を発動する)","common handtraps (一般的な手札誘発)"],"synonyms":["disruptive monster","response card"],"antonyms":["combo piece","engine card"]}],"etymology":{"value":"「手札(hand)」から「誘発(trap)」効果を発動することから。","priority":"★★★"},"pronunciation":{"ipa":"/ˈhændˌtræp/","syllables":"hand-trap"},"inflection":{"noun_plural":"Handtraps"},"usage_notes":{"explanation":"Handtraps are a specific type of card found in trading card games, most notably Yu-Gi-Oh! OCG. They are designed to be activated from the hand during the opponent's turn to disrupt their plays or strategies. They are a key element of competitive play.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I set a handtrap.","correct":"✓ I activated a handtrap.","note":"Handtraps are activated from the hand, not set on the field like trap cards."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Handtrap' refers to a specific category of cards in trading card games like Yu-Gi-Oh! OCG.  These cards are monsters that can activate their effects directly from the player's hand during the opponent's turn, disrupting their strategy. Understanding this term requires familiarity with trading card game mechanics."},"example_sentences":[{"sentence":"Many decks include handtraps to control the pace of the game.","translation":"多くのデッキはゲームのペースを制御するために手札誘発を含んでいる。","type":"noun","meaning_category":"card game term"}]}