{"word":"non-stackable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"積み重ねることができない、積み重ねに適さない","english_definition":"Not able to be stacked; designed or made in such a way that it cannot be easily or safely stacked.","examples":[{"sentence":"These chairs are non-stackable, so they take up a lot of storage space.","translation":"これらの椅子は積み重ねられないので、保管スペースをかなり取ります。"},{"sentence":"The irregular shape of the containers makes them non-stackable.","translation":"容器の不規則な形状のため、積み重ねることができません。"},{"sentence":"Due to its delicate construction, this item is non-stackable.","translation":"繊細な構造のため、この商品は積み重ねることができません。"}],"collocations":["non-stackable chairs","non-stackable containers","non-stackable items","non-stackable design","non-stackable goods"],"synonyms":["unstackable","not designed for stacking"],"antonyms":["stackable"],"related_words":["stack (verb, noun)","stacking (noun)"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the adjective 'stackable'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈstækəbəl/","syllables":"non-stack-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are less common for compound adjectives like this one.","adjective_forms":{"comparative":"less non-stackable","superlative":"least non-stackable"}},"usage_notes":{"explanation":"'Non-stackable' is used to describe items that cannot be efficiently or safely piled on top of each other. This might be due to their shape, weight distribution, fragility, or design. It's a practical term often used in logistics, warehousing, and retail to indicate storage limitations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non stackable boxes.","correct":"✓ The non-stackable boxes.","note":"The hyphen is important for clarity. Without it, it might be misread."},{"incorrect":"✗ This is a not stackable item.","correct":"✓ This is a non-stackable item.","note":"Use 'non-stackable' rather than 'not stackable' for a more concise and standard way of expressing the inability to stack."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but common in specific contexts like logistics and storage.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Non-stackable' means something cannot be easily or safely put on top of other things. Imagine chairs that are oddly shaped and would fall over if you tried to stack them; those would be 'non-stackable'. It's a useful word when talking about storing or moving items.","priority":"★★★"},"example_sentences":[{"sentence":"We need to find a different storage solution for these non-stackable crates.","translation":"これらの積み重ねられない木箱のために、別の保管方法を見つける必要があります。","type":"example","meaning_category":"General Use"},{"sentence":"The label clearly indicates that the product is non-stackable.","translation":"ラベルには、製品が積み重ねられないことが明確に示されています。","type":"example","meaning_category":"Product Information"},{"sentence":"Due to the delicate glass inside, the boxes are marked as non-stackable during shipping.","translation":"内部のガラスが壊れやすいため、輸送中に箱は積み重ね不可としてマークされています。","type":"example","meaning_category":"Shipping/Logistics"}]}