{"word":"unconcernedlies","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"(rare) In an unconcerned manner; without worry or interest.","english_definition":"In a manner indicating a lack of concern; without worry or interest.","examples":[{"sentence":"He unconcernedlies shrugged off the criticism.","translation":"彼は批判を気にせず肩をすくめた。"},{"sentence":"She unconcernedlies walked past the accident scene.","translation":"彼女は事故現場を気にせず通り過ぎた。"}],"collocations":["act unconcernedlies","shrug unconcernedlies","walk unconcernedlies"],"synonyms":["nonchalantly","indifferently","apathetically","casually"],"antonyms":["anxiously","worriedly","concerned"]}],"etymology":{"value":"Formed by adding the suffix '-lies' to 'unconcerned', likely as a humorous or emphatic construction. The base word 'unconcerned' is derived from 'concerned' with the prefix 'un-' indicating negation.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʌnkənˈsɜːrnɪdliz/","syllables":"un-con-cern-ed-lies"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The word 'unconcernedlies' is quite rare and not commonly used in modern English. It is formed in a way that mimics how adverbs are created (adding '-ly' to adjectives), but it sounds somewhat awkward. More common and natural alternatives include 'nonchalantly', 'indifferently', or simply rephrasing the sentence to use 'unconcerned' in a different way. Its usage is often found in descriptive writing where the author wants to emphasize a lack of concern in a somewhat unusual or emphatic manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted unconcernedlies about the test results.","correct":"✓ She acted unconcerned about the test results. / ✓ She acted nonchalantly about the test results.","note":"Using 'unconcerned' as an adjective or 'nonchalantly' as a more common adverb is preferred."}],"priority":"★☆☆"},"related_words":{"derivatives":["unconcerned (adjective)","concern (verb, noun)","concerned (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare - almost non-existent in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unconcernedlies' is a rare and somewhat contrived adverb. It means 'in an unconcerned manner'. Due to its uncommon usage, it is best to use more standard adverbs like 'nonchalantly' or 'indifferently' to convey the same meaning. This word is more likely to be encountered in older literature or as a deliberate stylistic choice to create a specific effect."},"example_sentences":[{"sentence":"He unconcernedlies dismissed the rumors, much to the surprise of his colleagues.","translation":"彼は同僚を驚かせたことに頓着せず、その噂を一蹴した。","type":"adverb","meaning_category":"without worry"},{"sentence":"She unconcernedlies continued her meal, despite the commotion around her.","translation":"彼女は周りの騒ぎを気にせず食事を続けた。","type":"adverb","meaning_category":"without interest"}]}