{"word":"buhlworks","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"寄木細工、特に真鍮や他の金属、べっ甲、真珠層などを用いた象嵌細工","english_definition":"Inlaid work, especially that employing tortoiseshell, mother-of-pearl, or other materials inlaid with brass or other metals.","examples":[{"sentence":"The antique desk was decorated with intricate buhlworks.","translation":"そのアンティークの机は、複雑な寄木細工で装飾されていた。"},{"sentence":"Buhlworks furniture was popular during the 17th and 18th centuries.","translation":"寄木細工の家具は17世紀から18世紀にかけて人気があった。"}],"collocations":["intricate buhlworks","antique buhlworks","buhlworks furniture"],"synonyms":["marquetry","inlay","parquetry","intarsia"],"antonyms":[]}],"etymology":{"value":"André-Charles Boulle (1642–1732), a French cabinetmaker who worked for Louis XIV, and who popularized the technique. The term is a corruption of his name.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbuːlˌwɜːrks/","syllables":"buhl-works"},"inflection":{"noun_plural":"buhlworks"},"usage_notes":{"explanation":"\"Buhlworks\" refers specifically to a type of marquetry or inlay that uses particular materials like tortoiseshell, mother-of-pearl, and metals (often brass). It's often associated with furniture and decorative arts from the 17th and 18th centuries, particularly French styles. It is often used to describe the technique or the objects created using this technique.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful piece of boullework.","correct":"✓ I saw a beautiful piece of buhlworks.","note":"The correct spelling is \"buhlworks,\" not \"boullework,\" although it is derived from the name Boulle."}],"priority":"★★☆"},"related_words":{"derivatives":["boulle (adjective: relating to or characteristic of André-Charles Boulle or his style)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"buhlworks\" is specialized vocabulary related to decorative arts and furniture history. Understanding requires familiarity with historical design styles and techniques. It's unlikely to be encountered in everyday conversation but may appear in texts about antiques, art history, or interior design."},"example_sentences":[{"sentence":"The museum displayed a stunning collection of buhlworks clocks.","translation":"博物館には、見事な寄木細工の時計のコレクションが展示されていた。","type":"noun","meaning_category":"寄木細工"},{"sentence":"The craftsman carefully restored the intricate buhlworks on the antique cabinet.","translation":"職人はアンティークのキャビネットの複雑な寄木細工を丁寧に修復した。","type":"noun","meaning_category":"寄木細工"}]}