{"word":"alloying","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"合金化、合金作り","english_definition":"The process of forming an alloy, which is a mixture of two or more elements, at least one of which is a metal.","examples":[{"sentence":"Alloying improves the strength and corrosion resistance of metals.","translation":"合金化は金属の強度と耐食性を向上させます。"},{"sentence":"The alloying of iron with carbon produces steel.","translation":"鉄と炭素の合金化は鋼鉄を生み出します。"}],"collocations":["alloying elements","alloying process","alloying technique","surface alloying"],"synonyms":["blending","mixing","fusion","amalgamation"],"antonyms":["separation","purification"]},{"part_of_speech":"verb","definition":"合金化する","english_definition":"To form an alloy by mixing two or more elements, at least one of which is a metal.","examples":[{"sentence":"Copper is often alloyed with zinc to make brass.","translation":"銅はしばしば亜鉛と合金化されて真鍮になります。"},{"sentence":"The metal was alloyed to improve its hardness.","translation":"その金属は硬度を向上させるために合金化されました。"}],"collocations":["alloy with","alloy together","surface alloy"],"synonyms":["blend","mix","fuse","amalgamate"],"antonyms":["separate","purify"]}],"etymology":{"value":"Derived from the verb 'alloy,' which comes from the Old French 'aloi,' meaning 'mixture,' ultimately from Latin 'ad ligare,' meaning 'to bind to.'","priority":"★★★"},"pronunciation":{"ipa":"/əˈlɔɪɪŋ/","syllables":"al-loy-ing"},"inflection":{"noun_plural":"alloyings","verb_forms":{"present_simple":["alloy","alloys"],"past_simple":"alloyed","past_participle":"alloyed","present_participle":"alloying"}},"usage_notes":{"explanation":"'Alloying' refers to the process of creating an alloy, which is a metallic substance composed of two or more elements. The purpose of alloying is generally to enhance certain properties of the base metal, such as strength, hardness, corrosion resistance, or machinability. The term can be used as a noun to describe the process itself or as a verb to describe the act of creating an alloy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Alloying is when you mix two metals together.","correct":"✓ Alloying is the process of mixing two or more elements, at least one of which is a metal, to form an alloy.","note":"It's important to specify that alloying involves mixing elements, not just metals, and that at least one of the elements must be a metal."},{"incorrect":"✗ The alloying made the metal more strong.","correct":"✓ The alloying made the metal stronger.","note":"Use the comparative form 'stronger' to indicate an increase in strength."}],"priority":"★★☆"},"related_words":{"derivatives":["alloy (noun, verb)","alloyed (adjective)"],"related_terms":["metallurgy","metalworking","smelting","casting"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Alloying' is a technical term used in materials science and metallurgy. It describes the process of combining two or more elements, where at least one is a metal, to create a new substance called an alloy. This process is done to improve the properties of the original metal, such as making it stronger, more resistant to corrosion, or easier to work with. The term is most often encountered in scientific or engineering contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **alloying** of nickel with steel increases its resistance to corrosion.","translation":"ニッケルと鋼の合金化は、耐食性を高めます。","type":"noun","meaning_category":"合金化 (名詞)"},{"sentence":"They are **alloying** different metals to create a new type of super-strong material.","translation":"彼らは新しいタイプの超強力材料を作るために、異なる金属を合金化しています。","type":"verb","meaning_category":"合金化する (動詞)"},{"sentence":"**Alloying** elements are added to control the properties of the final product.","translation":"合金元素は、最終製品の特性を制御するために添加されます。","type":"noun","meaning_category":"合金化 (名詞)"}]}