{"word":"repersonalization","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"再パーソナライズ、再個人化","english_definition":"The act or process of making something personal again, or adapting something to better suit an individual's needs or preferences after a period of depersonalization or standardization.","examples":[{"sentence":"The repersonalization of the healthcare system aims to provide more patient-centered care.","translation":"医療システムの再パーソナライズは、より患者中心のケアを提供することを目的としています。"},{"sentence":"After years of mass production, the company is focusing on repersonalization to cater to individual customer tastes.","translation":"長年の大量生産の後、同社は個々の顧客の好みに応えるために再パーソナライズに焦点を当てています。"},{"sentence":"The repersonalization of education involves tailoring learning experiences to each student's unique learning style.","translation":"教育の再パーソナライズには、各生徒のユニークな学習スタイルに合わせた学習経験の調整が含まれます。"}],"collocations":["repersonalization of services","repersonalization strategy","repersonalization process","mass repersonalization"],"synonyms":["customization","personalization","individualization","tailoring","adaptation"],"antonyms":["depersonalization","standardization","generalization","mass production"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'anew') to 'personalization', which itself comes from 'personalize'. 'Personalize' is derived from 'personal', relating to a particular person. Thus, 'repersonalization' literally means 'to personalize again'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːpɜːrsənəlaɪˈzeɪʃən/","syllables":"re-per-son-a-li-za-tion"},"inflection":{"noun_plural":"repersonalizations"},"usage_notes":{"explanation":"'Repersonalization' is often used in contexts where there has been a move away from individual attention or customization, such as in mass production, standardized services, or depersonalized healthcare. It implies a conscious effort to restore or enhance the personal touch.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The repersonalization was very personal.","correct":"✓ The repersonalization aimed to make the service more personal.","note":"'Repersonalization' is the process, not a quality. Avoid using 'personal' to describe 'repersonalization' directly. Instead, focus on what the repersonalization achieves."},{"incorrect":"✗ They repersonalized the product to be more general.","correct":"✓ They repersonalized the product to be more specific to customer needs.","note":"Repersonalization is about making something more individual, not more general. The goal is to cater to specific needs."}],"priority":"★★☆"},"related_words":{"derivatives":["repersonalize (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Repersonalization' is a complex term primarily used in specialized fields like marketing, healthcare, and education. It refers to the process of making something more tailored to individual needs after it has become standardized or impersonal. Understanding this word requires grasping the concept of personalization first and then recognizing the 're-' prefix as indicating a return to that state. This word is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The company's repersonalization strategy led to increased customer satisfaction.","translation":"その会社の再パーソナライズ戦略は、顧客満足度の向上につながりました。","type":"noun","meaning_category":"Process/Strategy"},{"sentence":"The repersonalization of online advertising aims to deliver more relevant ads to users.","translation":"オンライン広告の再パーソナライズは、ユーザーにより関連性の高い広告を配信することを目的としています。","type":"noun","meaning_category":"Application"},{"sentence":"The hospital implemented a repersonalization program to improve patient care.","translation":"その病院は、患者ケアを改善するために再パーソナライズプログラムを実施しました。","type":"noun","meaning_category":"Program/Initiative"}]}