{"word":"THC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テトラヒドロカンナビノール (Tetrahydrocannabinol)","english_definition":"Tetrahydrocannabinol: the main psychoactive compound in cannabis that causes the sensation of being high.","examples":[{"sentence":"THC is responsible for the psychoactive effects of marijuana.","translation":"THCは大麻の精神作用の原因物質です。"},{"sentence":"The THC content of cannabis varies widely.","translation":"大麻のTHC含有量は大きく異なります。"},{"sentence":"Some studies suggest that THC may have therapeutic benefits.","translation":"いくつかの研究では、THCが治療効果を持つ可能性が示唆されています。"}],"collocations":["THC content (THC含有量)","THC level (THCレベル)","THC effects (THCの効果)","THC oil (THCオイル)"],"synonyms":["tetrahydrocannabinol"],"antonyms":[]}],"etymology":{"value":"Abbreviation of tetrahydrocannabinol.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtiːˌeɪtʃˈsiː/","syllables":"T-H-C"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"THC is the abbreviation for tetrahydrocannabinol, the primary psychoactive compound found in cannabis plants. It is responsible for the intoxicating effects associated with marijuana use. The concentration of THC in cannabis products can vary significantly, influencing the intensity of the effects experienced. THC interacts with the body's endocannabinoid system, affecting various functions such as mood, perception, and appetite.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ THC is a type of CBD.","correct":"✓ CBD and THC are both cannabinoids found in cannabis.","note":"CBD (cannabidiol) and THC (tetrahydrocannabinol) are different compounds found in cannabis. THC is psychoactive, while CBD is not."},{"incorrect":"✗ THC is legal everywhere.","correct":"✓ The legality of THC varies by jurisdiction.","note":"The legality of THC varies significantly depending on the country, state, or region. It is not universally legal."}],"priority":"★★☆"},"related_words":{"derivatives":["THCA (tetrahydrocannabinolic acid)","cannabis","marijuana","hemp","cannabinoid","psychoactive"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in specialized contexts (scientific, medical, legal).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"THC (テトラヒドロカンナビノール) は、大麻に含まれる主要な精神活性化合物です。つまり、THCは大麻を使用すると「ハイ」になる感覚を引き起こす物質です。大麻製品に含まれるTHCの量は大きく異なり、その効果の強さに影響します。THCは、気分、知覚、食欲など、さまざまな機能に影響を与える体のエンドカンナビノイドシステムと相互作用します。THCの合法性は国や地域によって大きく異なるため、注意が必要です。CBD（カンナビジオール）は大麻に含まれる別の化合物ですが、THCとは異なり精神活性作用はありません。"},"example_sentences":[{"sentence":"The effects of THC can last for several hours.","translation":"THCの効果は数時間続くことがあります。","type":"noun","meaning_category":"psychoactive compound"},{"sentence":"The government regulates the amount of THC allowed in cannabis products.","translation":"政府は大麻製品に許可されるTHCの量を規制しています。","type":"noun","meaning_category":"psychoactive compound"},{"sentence":"Research is ongoing to determine the potential medical uses of THC.","translation":"THCの潜在的な医療用途を特定するための研究が進行中です。","type":"noun","meaning_category":"psychoactive compound"}]}