{"word":"acculturates","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を異文化に適応させる、文化変容させる","english_definition":"to modify the culture of a group or individual as a result of contact with a different culture.","examples":[{"sentence":"The school acculturates immigrant children to American customs.","translation":"その学校は移民の子供たちをアメリカの習慣に適応させている。"},{"sentence":"They were acculturated into the dominant culture.","translation":"彼らは支配的な文化に文化変容させられた。"}],"collocations":["acculturate someone to something","acculturate into a culture"],"synonyms":["assimilate","integrate","adapt","socialize"],"antonyms":["alienate","isolate"]},{"part_of_speech":"verb","transitivity":"vi","definition":"異文化に適応する、文化変容する","english_definition":"to change the culture of a group or individual as a result of contact with a different culture.","examples":[{"sentence":"Immigrants acculturate to a new society over time.","translation":"移民は時間とともに新しい社会に適応していく。"},{"sentence":"The community acculturated to the changing environment.","translation":"そのコミュニティは変化する環境に適応していった。"}],"collocations":["acculturate to something"],"synonyms":["assimilate","integrate","adapt","socialize"],"antonyms":["resist","reject"]}],"etymology":{"value":"'Acculturate' is derived from 'acculturation,' which comes from the Latin 'ad-' (to) + 'cultura' (culture) + '-tion' (a process or action). It signifies the process of adopting or adapting to a different culture.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkʌltʃəreɪts/","syllables":"ac-cul-tur-ates"},"inflection":{"verb_forms":{"present_simple":["acculturates"],"past_simple":"acculturated","past_participle":"acculturated","present_participle":"acculturating"}},"usage_notes":{"explanation":"'Acculturate' refers to the process of cultural modification resulting from intercultural contact. It can be used both transitively (to acculturate someone) and intransitively (to acculturate). The term emphasizes the adaptation and integration of cultural elements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of acculturation was very acculturate.","correct":"✓ The process of acculturation was very rapid.","note":"Avoid using 'acculturate' as an adjective. Use related adjectives like 'cultural' or adverbs like 'culturally' instead."},{"incorrect":"✗ They acculturate the language.","correct":"✓ They learned the language. / ✓ They acculturated to the new language environment.","note":"'Acculturate' is about broader cultural adaptation, not just language acquisition. Use 'learn' or specify 'acculturate to the language environment' for language-related contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["acculturation (noun): The process of cultural change and adaptation.","acculturative (adjective): Relating to or promoting acculturation."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Primarily used in academic or sociological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acculturate' means to adapt or change culturally as a result of contact with another culture. It's often used in discussions about immigration, globalization, and cultural exchange. This word is more common in academic or sociological contexts rather than everyday conversation."},"example_sentences":[{"sentence":"New immigrants often acculturate to the customs of their new country.","translation":"新しい移民はしばしば新しい国の習慣に適応する。","type":"verb (vi)","meaning_category":"異文化に適応する"},{"sentence":"Schools can help acculturate children from different cultural backgrounds.","translation":"学校は異なる文化的背景を持つ子供たちを適応させるのに役立つ。","type":"verb (vt)","meaning_category":"異文化に適応させる"},{"sentence":"The process of acculturating to a new culture can be challenging.","translation":"新しい文化に適応するプロセスは困難なことがある。","type":"verb (vi)","meaning_category":"異文化に適応する"},{"sentence":"They acculturate their children to respect local traditions.","translation":"彼らは子供たちに地元の伝統を尊重するように文化変容させる。","type":"verb (vt)","meaning_category":"異文化に適応させる"}]}