{"word":"outwriggling","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(他動詞) (競争相手)よりもさらに体をくねらせて出し抜く、(競争相手)よりもさらに体をくねらせて優位に立つ","english_definition":"To surpass or outdo (a competitor) by wriggling more effectively or skillfully.","examples":[{"sentence":"The little fish was outwriggling the bigger ones to get to the food.","translation":"その小さな魚は、餌にたどり着くために、大きな魚たちよりも体をくねらせて出し抜いていた。"},{"sentence":"He was outwriggling his opponents in the dance competition.","translation":"彼はダンスコンテストで、対戦相手よりも体をくねらせて優位に立っていた。"}],"collocations":["outwriggle an opponent","outwriggle competitors"],"synonyms":["outmaneuver","outsmart","surpass","exceed"],"antonyms":["be inferior","be outdone"]}],"etymology":{"value":"The word is formed by combining the prefix 'out-' (meaning 'more than' or 'surpassing') with the verb 'wriggling' (the act of moving by twisting and turning).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈrɪɡəlɪŋ/","syllables":"out-wrig-gling"},"inflection":{"verb_forms":{"present_simple":["outwriggles"],"past_simple":"outwriggled","past_participle":"outwriggled","present_participle":"outwriggling"}},"usage_notes":{"explanation":"'Outwriggling' is a relatively rare and specific verb. It implies not just wriggling, but doing so in a way that gives one an advantage over others, often in a competitive context. The word suggests a combination of agility, cunning, and determination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The snake was outwriggling because it was hungry.","correct":"✓ The snake was outwriggling the other snakes to get the mouse.","note":"'Outwriggling' typically involves a direct comparison or competition with others. It's not just about wriggling for a reason, but wriggling *better* than others to achieve a goal."}],"priority":"★★☆"},"related_words":{"derivatives":["outwriggle (verb)","wriggle (verb)","wriggling (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'outwriggling' is a niche verb that combines the action of 'wriggling' with the competitive prefix 'out-'. It suggests surpassing others in the act of wriggling, often to gain an advantage. Due to its specific and uncommon nature, it's likely to be encountered in more advanced or specialized contexts, such as describing animal behavior or competitive scenarios where agility and cunning are involved."},"example_sentences":[{"sentence":"The worm was desperately outwriggling its rivals to reach the juiciest part of the apple.","translation":"その虫は、リンゴの一番おいしい部分にたどり着くために、必死になってライバルたちよりも体をくねらせていた。","type":"verb","meaning_category":"surpassing in wriggling"},{"sentence":"In the political arena, he was known for outwriggling his opponents with clever maneuvers.","translation":"政界では、彼は巧妙な策略で対戦相手よりも体をくねらせて出し抜くことで知られていた。","type":"verb","meaning_category":"outmaneuvering through wriggling (figurative)"}]}