{"word":"self-modification","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"自己改造、自己修正、自己改変","english_definition":"The act or process of changing or altering oneself, especially one's behavior, beliefs, or physical form, by one's own efforts.","examples":[{"sentence":"Through self-modification, he was able to overcome his bad habits.","translation":"自己改造を通して、彼は自分の悪い習慣を克服することができた。"},{"sentence":"The software allows for self-modification to adapt to different user needs.","translation":"そのソフトウェアは、さまざまなユーザーのニーズに適応するために自己修正を可能にする。"},{"sentence":"Some transhumanists advocate for self-modification through technology to enhance human capabilities.","translation":"一部のトランスヒューマニストは、人間の能力を高めるために、テクノロジーによる自己改変を提唱している。"}],"collocations":["behavioral self-modification (行動的自己修正)","genetic self-modification (遺伝子的自己改変)","cognitive self-modification (認知的自己修正)","self-modification techniques (自己修正テクニック)","undergo self-modification (自己改造を受ける)"],"synonyms":["self-improvement","self-alteration","self-transformation","personal development","self-change"],"antonyms":["stagnation","deterioration","regression"]},{"part_of_speech":"noun","definition":"(プログラミング) 自己書き換え、自己変更","english_definition":"(In programming) The ability of a program to alter its own code during execution.","examples":[{"sentence":"Self-modification can be used to optimize code performance.","translation":"自己書き換えは、コードのパフォーマンスを最適化するために使用できる。"},{"sentence":"Self-modifying code is often difficult to debug and maintain.","translation":"自己書き換えコードは、デバッグと保守が難しいことが多い。"},{"sentence":"The virus used self-modification to evade detection.","translation":"そのウイルスは、検出を回避するために自己書き換えを使用した。"}],"collocations":["self-modifying code (自己書き換えコード)","dynamic self-modification (動的な自己書き換え)","runtime self-modification (実行時自己書き換え)"],"synonyms":["dynamic code generation","runtime code modification"],"antonyms":["static code","non-self-modifying code"]}],"etymology":{"value":"The term is formed by combining \"self\" (referring to oneself) with \"modification\" (the act of changing something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˌmɒdɪfɪˈkeɪʃən/","syllables":"self-mod-i-fi-ca-tion"},"inflection":{"notes":"Plural: self-modifications"},"usage_notes":{"explanation":"\"Self-modification\" can refer to changes made to oneself (behavior, beliefs, physical form) or, in programming, to code that changes itself during execution. The context determines the meaning. In the context of personal development, it often implies a conscious effort to improve oneself. In programming, it is a more technical term referring to a specific coding technique.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doing self modification for become better person.","correct":"✓ He is doing self-modification to become a better person.","note":"Use the noun form \"self-modification\" and the correct infinitive \"to become\"."},{"incorrect":"✗ Self modification code is very dangerous.","correct":"✓ Self-modifying code is very dangerous.","note":"Use the adjective form \"self-modifying\" to describe the code."}],"priority":"★★☆"},"related_words":{"derivatives":["modify","modification","self","self-improving","self-correcting"],"related_terms":["transhumanism","biohacking","personal development","behavioral therapy","metaprogramming","dynamic programming"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (technical contexts)","frequency_google_ngram":"Relatively low frequency, more common in technical or philosophical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-modification\" refers to the process of intentionally changing oneself, whether it's one's behavior, beliefs, or even physical form. It can also describe a program's ability to alter its own code while running. The term is most often encountered in discussions about personal development, technology, or philosophy. Understanding the context is key to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Through consistent effort and self-modification, she transformed her lifestyle.","translation":"一貫した努力と自己改造を通して、彼女は自分のライフスタイルを変えた。","type":"noun","meaning_category":"Personal Development"},{"sentence":"The AI system uses self-modification to learn from new data.","translation":"そのAIシステムは、新しいデータから学習するために自己修正を使用する。","type":"noun","meaning_category":"Programming"},{"sentence":"Self-modification is a key concept in transhumanist philosophy.","translation":"自己改変は、トランスヒューマニスト哲学の重要な概念である。","type":"noun","meaning_category":"Philosophy"},{"sentence":"He employed various self-modification techniques to quit smoking.","translation":"彼は禁煙するためにさまざまな自己修正テクニックを用いた。","type":"noun","meaning_category":"Personal Development"},{"sentence":"Self-modifying code can be difficult to analyze for security vulnerabilities.","translation":"自己書き換えコードは、セキュリティの脆弱性を分析するのが難しい場合がある。","type":"adjective (self-modifying)","meaning_category":"Programming"}]}