{"word":"Eskimo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エスキモー（かつて使われた、北極圏に住む先住民族を指す言葉。現在では差別的とみなされることがあるため、イヌイットやユピックといった個別の民族名を推奨）","english_definition":"(dated, sometimes offensive) a member of a people inhabiting the Arctic (northern Canada, Greenland, Alaska, and eastern Siberia). Now often considered offensive; the terms Inuit and Yupik are preferred.","examples":[{"sentence":"The term 'Eskimo' is now often considered offensive, especially in Canada.","translation":"「エスキモー」という言葉は、特にカナダでは、現在では差別的とみなされることが多い。"},{"sentence":"It's more respectful to refer to them as Inuit or Yupik, depending on their specific group.","translation":"彼らを指す場合は、特定のグループに応じてイヌイットやユピックと呼ぶ方がより敬意を払っている。"}],"collocations":["Eskimo culture (エスキモー文化)","Eskimo language (エスキモー語)","Eskimo village (エスキモーの村)"],"synonyms":["Inuit","Yupik"],"antonyms":[]}],"etymology":{"value":"語源は、アルゴンキン語族の言葉に由来するとされるが、正確な起源は不明。有力な説としては、「生肉を食べる人」を意味する言葉から派生したというものがある。しかし、この語源には異論もあり、別の説も存在する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeskɪmoʊ/","syllables":"Es-ki-mo"},"inflection":{"noun_plural":"Eskimos"},"usage_notes":{"explanation":"「**Eskimo**」は、かつて北極圏に住む先住民族を指す言葉として広く使われていましたが、現在では差別的なニュアンスを含むとみなされることが多くなっています。特にカナダでは、イヌイットの人々がこの言葉を嫌う傾向があります。そのため、個々の民族グループを指す場合は、「Inuit（イヌイット）」や「Yupik（ユピック）」といった、より具体的な名称を使うことが推奨されます。総称として使う場合でも、「Arctic peoples（北極圏の人々）」のような表現を使う方が適切です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ All Eskimos live in igloos.","correct":"✓ Some Inuit people traditionally built igloos as temporary shelters.","note":"「すべてのエスキモーがイグルーに住んでいる」という表現は不正確です。イグルーは、イヌイットの人々が一時的なシェルターとして伝統的に建設したものであり、すべての北極圏の民族がイグルーに住んでいたわけではありません。"},{"incorrect":"✗ It's okay to use the term 'Eskimo' because that's what I learned in school.","correct":"✓ While 'Eskimo' was commonly used in the past, it's now often considered offensive. It's better to use Inuit or Yupik.","note":"過去に「エスキモー」という言葉が一般的に使われていたとしても、現在では差別的とみなされることが多いため、使用を避けるべきです。代わりに「イヌイット」や「ユピック」といった言葉を使う方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"比較的低い (Relatively low frequency) - 現在では使用が推奨されないため、頻度は低下傾向にある。","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"「**Eskimo**」は、昔は北極圏に住む人々を指す言葉として使われていましたが、今はあまり使わない方が良いとされています。なぜなら、この言葉を嫌う人もいるからです。代わりに、「Inuit（イヌイット）」や「Yupik（ユピック）」という言葉を使う方が、より丁寧で正確です。学校で「Eskimo」という言葉を習ったとしても、今は別の言葉を使うようにしましょう。"},"example_sentences":[{"sentence":"(Avoided) The Eskimo people have a rich cultural heritage.","translation":"（避けるべき表現）エスキモーの人々は豊かな文化遺産を持っている。","type":"noun","meaning_category":"民族名 (非推奨)"},{"sentence":"(Preferred) The Inuit people have a rich cultural heritage.","translation":"（推奨される表現）イヌイットの人々は豊かな文化遺産を持っている。","type":"noun","meaning_category":"民族名 (推奨)"},{"sentence":"It's important to be respectful when referring to Arctic peoples.","translation":"北極圏の人々を指す際には、敬意を払うことが重要です。","type":"noun phrase","meaning_category":"総称 (推奨)"}]}