{"word":"cumulant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"キュムラント：確率変数または確率分布の特性を記述する統計量の一つ。","english_definition":"A statistical quantity that, like moments, describes the characteristics of a probability distribution or random variable.","examples":[{"sentence":"The cumulants of a normal distribution beyond the second cumulant are all zero.","translation":"正規分布のキュムラントは、2次キュムラントを超えるとすべてゼロになる。"},{"sentence":"Cumulant analysis is used in various fields, including statistics, probability theory, and signal processing.","translation":"キュムラント解析は、統計学、確率論、信号処理を含む様々な分野で使用されている。"}],"collocations":["cumulant generating function","joint cumulant","higher-order cumulant"],"synonyms":["semi-invariant"],"antonyms":[]},{"part_of_speech":"adjective","definition":"キュムラントの、キュムラントに関する","english_definition":"Relating to or involving cumulants.","examples":[{"sentence":"cumulant expansion","translation":"キュムラント展開"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'cumulant' was introduced by Danish mathematician Thorvald N. Thiele in 1889. It is derived from the Latin word 'cumulare,' meaning 'to accumulate' or 'to heap up.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkjuːmjʊlənt/","syllables":"cu-mu-lant"},"inflection":{"noun_plural":"cumulants"},"usage_notes":{"explanation":"Cumulants provide an alternative way to characterize the shape of a probability distribution compared to moments. Unlike moments, cumulants have the property that the cumulants of the sum of independent random variables are the sum of the cumulants of the individual random variables. This property makes cumulants particularly useful in certain statistical analyses. The first cumulant is the mean, the second is the variance, and higher-order cumulants describe skewness and kurtosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cumulant is same as moment.","correct":"✓ The first cumulant is the same as the first moment (mean).","note":"The first cumulant is the mean, which is also the first moment. Higher-order cumulants are different from moments."}],"priority":"★★☆"},"related_words":{"derivatives":["cumulatively"],"phrasal_verbs":[],"related_terms":["moment","skewness","kurtosis","probability distribution","characteristic function"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cumulant' is a technical term used in statistics and probability theory. It is a less commonly used term compared to 'mean' or 'variance,' and understanding it requires a solid foundation in statistical concepts. It's mostly encountered in advanced statistical analysis and research.","priority":"★☆☆"},"example_sentences":[{"sentence":"The first cumulant of a distribution is equal to its mean.","translation":"分布の最初のキュムラントは、その平均に等しい。","type":"noun","meaning_category":"statistics"},{"sentence":"Cumulant analysis is a powerful tool for studying non-Gaussian processes.","translation":"キュムラント解析は、非ガウス過程を研究するための強力なツールである。","type":"noun","meaning_category":"statistics"}]}