{"word":"bisbisear","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(Aragonese, obsolete) to whisper","english_definition":"(Aragonese, obsolete) to whisper","examples":[{"sentence":"Ya no se bisbisea en las esquinas.","translation":"Whispering is no longer heard in the corners.","note":"Example sentence uses the verb in a context indicating its former usage."}],"collocations":[],"synonyms":["susurrar","murmurar"],"antonyms":[],"related_words":[]}],"etymology":{"value":"Likely derived from a sound-imitative origin, reflecting the soft, rustling sound of whispering. Related to other Romance language words for whispering.","priority":"low"},"pronunciation":{"ipa":"bis.bi.seˈaɾ","notes":"Pronunciation is based on standard Aragonese phonetics."},"inflection":{"verb_forms":{"present_simple":["bisbiseo","bisbiseas","bisbisea","bisbiseamos","bisbiseáis","bisbisean"],"past_simple":["bisbiseé","bisbiseaste","bisbiseó","bisbiseamos","bisbiseasteis","bisbisearon"],"future_simple":["bisbisearé","bisbisearás","bisbiseará","bisbisearemos","bisbisearéis","bisbisearán"]}},"usage_notes":{"explanation":"\"Bisbisear\" is an archaic verb in Aragonese, primarily meaning 'to whisper'. It is not commonly used in modern Aragonese, having been largely replaced by other terms such as \"susurrar\" or \"murmurar.\" Its usage is mostly confined to historical texts or discussions of the Aragonese language itself. The verb conveys the act of speaking very softly, often secretly or discreetly.","priority":"high"},"common_mistakes":{"examples":[],"note":"Because the word is obsolete, common mistakes are unlikely, but modern speakers might incorrectly assume it's a standard term."},"related_words":{"derivatives":[],"related_terms":["susurrar","murmurar"]},"level_frequency":{"frequency_google_ngram":"Very low frequency due to its archaic nature.","priority":"high"},"readability_explanation":{"level":"Advanced (due to obsolescence)","text":"\"Bisbisear\" is an obsolete term in Aragonese, meaning 'to whisper.' It is rarely encountered in contemporary usage. Understanding this word requires familiarity with historical Aragonese texts or linguistic studies. Modern speakers of Aragonese are more likely to use synonyms like \"susurrar\" or \"murmurar.\""},"example_sentences":[{"sentence":"En la obra antigua, se describe a los conspiradores bisbiseando sus planes.","translation":"In the old work, the conspirators are described whispering their plans.","type":"verb","meaning_category":"whispering"}]}