{"word":"peraturan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"aturan atau kaidah yang mengikat warga suatu kelompok; undang-undang; tata tertib","english_definition":"a rule or regulation that binds the members of a group; law; code of conduct","examples":[{"sentence":"Setiap warga negara harus mematuhi peraturan yang berlaku.","translation":"Every citizen must obey the applicable regulations.","example_notes":"This sentence illustrates the general obligation to follow rules."},{"sentence":"Peraturan sekolah melarang siswa membawa telepon genggam ke kelas.","translation":"School regulations prohibit students from bringing cell phones to class.","example_notes":"This sentence gives a specific example of a school regulation."},{"sentence":"Perusahaan itu memiliki peraturan ketat mengenai keselamatan kerja.","translation":"That company has strict regulations regarding workplace safety.","example_notes":"This sentence shows regulations in a business context."}],"collocations":["peraturan lalu lintas (traffic regulations)","peraturan perusahaan (company regulations)","peraturan sekolah (school regulations)","mematuhi peraturan (to obey regulations)","melanggar peraturan (to violate regulations)","peraturan pemerintah (government regulations)"],"synonyms":["undang-undang","kaidah","hukum","ketentuan","tata tertib"],"antonyms":["pengecualian (exception)","kelonggaran (leniency)"]},{"part_of_speech":"noun","definition":"proses, cara, perbuatan mengatur","english_definition":"the process, method, or act of regulating","examples":[{"sentence":"Peraturan penggunaan dana bantuan harus dilakukan secara transparan.","translation":"The regulation of the use of grant funds must be done transparently.","example_notes":"This sentence focuses on the process of regulating something."},{"sentence":"Peraturan lalu lintas bertujuan untuk menciptakan keamanan di jalan raya.","translation":"The regulation of traffic aims to create safety on the highway.","example_notes":"This sentence explains the purpose of traffic regulation."}],"collocations":["peraturan penggunaan (regulation of use)","peraturan lalu lintas (regulation of traffic)"],"synonyms":["pengaturan","penertiban","penataan"],"antonyms":["kekacauan (chaos)","ketidakteraturan (irregularity)"]}],"etymology":{"value":"Derived from the root word 'atur' (to arrange, to regulate) with the prefix 'per-' and suffix '-an' to form a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/pə.ra.tu.ran/","syllables":"pe-ra-tu-ran"},"inflection":{"notes":"'Peraturan' is a noun and does not inflect for tense or number in the same way as verbs. The plural form is often 'peraturan-peraturan', though the singular form can also refer to multiple regulations collectively."},"usage_notes":{"explanation":"'Peraturan' is a general term for rules, regulations, or laws. It can refer to formal laws enacted by a government or informal rules within a group. The context usually clarifies the specific type of regulation being discussed. It's important to distinguish 'peraturan' from 'aturan' (rule), as 'peraturan' often implies a more formal or structured set of rules.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya tidak tahu aturan itu.","correct":"Saya tidak tahu peraturan itu.","note":"'Aturan' can mean a simple rule, but 'peraturan' is more appropriate for formal regulations or laws."},{"incorrect":"Dia melanggar aturan.","correct":"Dia melanggar peraturan.","note":"While 'aturan' is understandable, 'peraturan' is more commonly used when referring to breaking a formal regulation."}],"priority":"★★☆"},"related_words":{"derivatives":["mengatur (to regulate, to arrange)","teratur (regulated, arranged, orderly)","pengaturan (regulation, arrangement)"],"phrases":["sesuai peraturan (according to regulations)","melanggar peraturan (to violate regulations)","mematuhi peraturan (to obey regulations)"],"priority":"★★★"},"level_frequency":{"frequency_indicator":"High","notes":"'Peraturan' is a common word in Indonesian, especially in formal contexts such as news, government documents, and school settings."},"readability_explanation":{"level":"Intermediate","text":"The word 'peraturan' is commonly used in Indonesian to refer to rules, regulations, or laws. It's important to understand the context to determine the specific type of regulation being discussed. The word is derived from 'atur' (to arrange) and implies a structured set of rules."},"example_sentences":[{"sentence":"Pemerintah mengeluarkan peraturan baru tentang impor barang.","translation":"The government issued new regulations regarding the import of goods.","type":"General","meaning_category":"Law"},{"sentence":"Peraturan di perpustakaan mengharuskan pengunjung untuk menjaga ketenangan.","translation":"The regulations in the library require visitors to maintain silence.","type":"Specific","meaning_category":"Code of Conduct"},{"sentence":"Peraturan perusahaan harus dipatuhi oleh semua karyawan.","translation":"Company regulations must be obeyed by all employees.","type":"Business","meaning_category":"Rule"}]}