{"word":"titrated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(化学)滴定する","english_definition":"To determine the concentration of a substance in solution by measuring the amount of a reagent of known concentration required to react with the substance.","examples":[{"sentence":"The solution was titrated against a standard acid.","translation":"その溶液は標準酸で滴定された。"},{"sentence":"We titrated the sample to determine the amount of iron present.","translation":"サンプルを滴定して、存在する鉄の量を決定した。"}],"collocations":["titrate a solution","titrate against a standard","titrate to the endpoint"],"synonyms":["analyze volumetrically","quantify by titration"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"(医学)少量ずつ投与量を調整する","english_definition":"To determine the proper dosage of a medication by gradually increasing the amount given until the desired effect is achieved.","examples":[{"sentence":"The doctor titrated the patient's medication to manage the pain.","translation":"医師は痛みを管理するために患者の薬の投与量を滴定した。"},{"sentence":"The insulin dose was carefully titrated to maintain stable blood sugar levels.","translation":"インスリンの投与量は、安定した血糖値を維持するために慎重に滴定された。"}],"collocations":["titrate a medication","titrate the dosage","titrate to effect"],"synonyms":["adjust dosage","gradually increase dose","optimize medication"],"antonyms":[]}],"etymology":{"value":"From the verb 'titrate', which comes from the French word 'titre' meaning 'standard' or 'title'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaɪtreɪtɪd/","syllables":"ti-trat-ed"},"inflection":{"verb_forms":{"present_simple":["titrate","titrates"],"past_simple":"titrated","past_participle":"titrated","present_participle":"titrating"}},"usage_notes":{"explanation":"'Titrated' is the past participle and past tense form of the verb 'titrate'. It is used in scientific contexts, particularly in chemistry and medicine, to describe a process of careful measurement and adjustment. In chemistry, it refers to determining the concentration of a solution. In medicine, it refers to carefully adjusting the dosage of a medication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was titrated quickly.","correct":"✓ The medicine was titrated carefully.","note":"Titration implies a gradual and careful process, so using adverbs like 'quickly' is contradictory."},{"incorrect":"✗ He titrated the solution with his eyes.","correct":"✓ He titrated the solution using a burette.","note":"Titration requires specific equipment, such as a burette, for accurate measurement."}],"priority":"★★☆"},"related_words":{"derivatives":["titrate (verb)","titration (noun)","titrant (noun)","titrator (noun)"],"related_terms":["volumetric analysis","standard solution","endpoint","dosage adjustment"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Titrated' means to have been subjected to the process of titration. Titration is a scientific technique, primarily used in chemistry, to determine the concentration of a substance by reacting it with a known amount of another substance. In a medical context, 'titrated' refers to carefully adjusting the dosage of a medication to achieve the desired effect. This term is technical and generally used in scientific or medical discussions."},"example_sentences":[{"sentence":"The acid solution was carefully titrated with a base to determine its concentration.","translation":"酸溶液は、その濃度を決定するために、塩基で慎重に滴定された。","type":"verb","meaning_category":"Chemistry"},{"sentence":"Her blood pressure medication was titrated over several weeks to find the optimal dose.","translation":"彼女の血圧薬は、最適な投与量を見つけるために数週間かけて滴定された。","type":"verb","meaning_category":"Medicine"}]}