{"word":"Accursedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"呪われて、忌まわしく、ひどく不運にも","english_definition":"In a cursed or damnable manner; in a way that deserves a curse; unfortunately or wretchedly.","examples":[{"sentence":"The project was accursedly doomed from the start due to poor planning.","translation":"そのプロジェクトは、計画の不備により、最初から呪われた運命にあった。"},{"sentence":"Accursedly, the rain started just as we arrived for the picnic.","translation":"不運にも、ピクニックに着いた途端に雨が降り始めた。"},{"sentence":"He accursedly lost all his savings in the stock market crash.","translation":"彼はひどく不運にも、株式市場の暴落ですべての貯金を失った。"}],"collocations":["accursedly unlucky","accursedly difficult","accursedly expensive"],"synonyms":["damnedly","wretchedly","unfortunately","miserably","hopelessly"],"antonyms":["fortunately","blessedly","happily"]}],"etymology":{"value":"Derived from 'accursed' (past participle of 'accurse', meaning to put under a curse) with the addition of the adverbial suffix '-ly'. The word 'accurse' comes from Middle English 'acursen', from Old English 'ācursian', meaning 'to curse, execrate'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkɜːrsɪdlɪ/","syllables":"ac-curs-ed-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Accursedly' is an adverb that intensifies the negative aspect of a situation or action, suggesting it is either cursed or extremely unfortunate. It is not commonly used in modern English and may sound archaic or overly dramatic. It is often used to express strong feelings of frustration or despair.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived accursedly ever after.","correct":"✓ He lived miserably ever after.","note":"'Accursedly' is not a common substitute for 'miserably' in general use. It implies a sense of being under a curse, rather than simply being unhappy."}],"priority":"★☆☆"},"related_words":{"derivatives":["accursed (adjective, past participle)","accurse (verb)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rare and literary)","frequency_google_ngram":"Very low frequency - rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Accursedly' is a rare and somewhat archaic adverb used to describe something done in a cursed or unfortunate manner. It is not commonly used in everyday conversation and is more likely to be found in literature or historical texts. Its use suggests a strong sense of doom or ill-fortune. Because of its rarity and strong connotations, it should be used carefully and deliberately."},"example_sentences":[{"sentence":"The treasure hunt was accursedly difficult, leading to hours of fruitless searching.","translation":"その宝探しはひどく難しく、何時間も無駄な探索をすることになった。","type":"adverb","meaning_category":"Unfortunate/Difficult"},{"sentence":"The land was accursedly barren, unable to yield any crops.","translation":"その土地は呪われているかのように不毛で、作物を何も産出することができなかった。","type":"adverb","meaning_category":"Cursed"}]}