{"word":"antisophist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ソフィストを批判する人、ソフィストに反対する人","english_definition":"One who opposes or criticizes sophists or sophistry.","examples":[{"sentence":"As an antisophist, Socrates challenged the relativism and skepticism promoted by the sophists.","translation":"反ソフィストとして、ソクラテスはソフィストによって推進された相対主義と懐疑主義に異議を唱えた。"}],"collocations":["an ardent antisophist (熱心な反ソフィスト)","a philosophical antisophist (哲学的な反ソフィスト)"],"synonyms":["critic of sophistry","opponent of sophists"],"antonyms":["sophist","pro-sophist"]}],"etymology":{"value":"\"anti-\" (反対) + \"sophist\" (ソフィスト)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈsɒfɪst/","syllables":"an-ti-soph-ist"},"inflection":{"noun_plural":"antisophists"},"usage_notes":{"explanation":"The term \"antisophist\" is primarily used in the context of ancient Greek philosophy to describe individuals who opposed the teachings and methods of the sophists. Sophists were known for their rhetorical skills and their willingness to argue any side of an issue, often for a fee. Antisophists, such as Socrates and Plato, criticized the sophists for their relativism, skepticism, and lack of concern for truth. The term can also be used more generally to describe anyone who opposes or criticizes sophistry, which is the use of clever but fallacious arguments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an antisophist because he hated knowledge.","correct":"✓ He was an antisophist because he believed in objective truth and opposed the sophists' relativism.","note":"Antisophists opposed the sophists' methods and beliefs, not knowledge itself. They typically believed in objective truth and virtue.","priority":"★★★"}],"priority":"★★☆"},"related_words":{"derivatives":["antisophistry (noun: 反ソフィズム)"],"related_concepts":["sophistry (noun: 詭弁)","sophism (noun: 詭弁)","rhetoric (noun: 修辞学)","Socrates (noun: ソクラテス)","Plato (noun: プラトン)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively rare word, primarily used in philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antisophist\" is a relatively uncommon term primarily used in the context of ancient Greek philosophy. It refers to someone who opposes the sophists, who were known for their rhetorical skills and relativistic views. Understanding the term requires familiarity with the historical and philosophical context of ancient Greece, particularly the debates between the sophists and their critics, such as Socrates and Plato. The word is not typically encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Plato, as an antisophist, argued for the existence of objective truth and moral values.","translation":"反ソフィストとして、プラトンは客観的な真実と道徳的価値の存在を主張した。","type":"noun","meaning_category":"Opponent of sophists"},{"sentence":"The antisophist movement in ancient Greece sought to counter the influence of relativistic thinking.","translation":"古代ギリシャの反ソフィスト運動は、相対主義的な考え方の影響に対抗しようとした。","type":"noun","meaning_category":"Opponent of sophists"}]}