{"word":"adjuratory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"懇願的な、厳粛に命じるような、誓約を求めるような","english_definition":"containing or expressing an earnest request or command; involving or resembling an oath.","examples":[{"sentence":"The prophet delivered an adjuratory speech, urging the people to repent.","translation":"預言者は、人々に悔い改めるよう促す懇願的な演説を行った。"},{"sentence":"The judge's adjuratory tone made it clear that he expected the witness to tell the truth.","translation":"裁判官の厳粛に命じるような口調は、彼が証人に真実を語ることを期待していることを明らかにした。"},{"sentence":"The letter contained an adjuratory appeal for help.","translation":"その手紙には、助けを求める懇願的な訴えが含まれていた。"}],"collocations":["adjuratory oath","adjuratory appeal","adjuratory tone","adjuratory speech"],"synonyms":["entreating","imploring","beseeching","exhortatory","commanding","solemn"],"antonyms":["mild","gentle","persuasive","suggestive"]}],"etymology":{"value":"Derived from the verb 'adjure,' which comes from Latin 'adjurare,' meaning 'to swear to,' 'to charge on oath,' from 'ad-' (to) + 'jurare' (to swear).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈdʒʊərəˌtɔːri/","syllables":"ad-ju-ra-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which are rare for 'adjuratory')."},"usage_notes":{"explanation":"'Adjuratory' is a relatively formal word, typically used in contexts involving serious requests, commands, or appeals, often with a moral or ethical dimension. It suggests a sense of urgency and importance. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The advertisement had an adjuratory effect on sales.","correct":"✓ The advertisement had a persuasive effect on sales.","note":"'Adjuratory' implies a solemn command or earnest request, not simply a persuasive influence. Use 'persuasive' or 'effective' instead."},{"incorrect":"✗ He gave an adjuratory smile.","correct":"✓ He gave a reassuring smile.","note":"'Adjuratory' is not used to describe smiles or other casual expressions. Use a more appropriate adjective like 'reassuring,' 'friendly,' or 'warm'."}],"priority":"★☆☆"},"related_words":{"derivatives":["adjure (verb)","adjuration (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adjuratory' is a formal and uncommon word, typically used in legal, religious, or rhetorical contexts. It describes something that contains a solemn command or earnest request, often resembling an oath. Understanding requires a strong vocabulary and familiarity with formal language. It is unlikely to be encountered in everyday conversation or casual reading materials."},"example_sentences":[{"sentence":"The lawyer's adjuratory plea to the jury was filled with emotional appeals.","translation":"弁護士から陪審員への懇願的な弁論は、感情的な訴えで満たされていた。","type":"adjective","meaning_category":"懇願的な"},{"sentence":"The king issued an adjuratory decree, demanding absolute obedience from his subjects.","translation":"王は、臣民からの絶対的な服従を要求する厳粛な命令を発した。","type":"adjective","meaning_category":"厳粛に命じるような"},{"sentence":"The priest delivered an adjuratory sermon on the importance of forgiveness.","translation":"司祭は、許しの重要性について懇願的な説教を行った。","type":"adjective","meaning_category":"誓約を求めるような"}]}