{"word":"Magnetoplasmadynamics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"磁気プラズマ力学、磁流体力学","english_definition":"The study of the dynamics of electrically conducting fluids, especially plasma, in the presence of magnetic fields.","examples":[{"sentence":"Magnetoplasmadynamics is used in the design of fusion reactors.","translation":"磁気プラズマ力学は核融合炉の設計に用いられる。"},{"sentence":"The principles of magnetoplasmadynamics are applied in astrophysics to understand stellar phenomena.","translation":"磁気プラズマ力学の原理は、天体現象を理解するために天体物理学に応用される。"}],"collocations":["MHD generator","MHD simulation","MHD stability"],"synonyms":["magnetohydrodynamics","MHD"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'magneto-' (referring to magnetic fields), 'plasma' (ionized gas), and 'dynamics' (the study of motion and forces).","priority":"★★☆"},"pronunciation":{"ipa":"/mæɡˌniːtoʊˌplæzmədaɪˈnæmɪks/","syllables":"mag-ne-to-plas-ma-dy-nam-ics"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Magnetoplasmadynamics (MPD), often used interchangeably with Magnetohydrodynamics (MHD), is a field of study focusing on the interaction between magnetic fields and electrically conductive fluids, particularly plasmas. It's crucial in understanding phenomena in astrophysics, fusion energy, and industrial applications involving plasmas. While the terms are often used synonymously, MPD sometimes implies a broader scope, including kinetic effects and non-equilibrium plasmas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Magneto plasma dynamics are important.","correct":"✓ Magnetoplasmadynamics is important.","note":"Magnetoplasmadynamics is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ MHD are used in fusion research.","correct":"✓ MHD is used in fusion research.","note":"MHD (Magnetohydrodynamics) is also treated as a singular noun."}],"priority":"★★☆"},"related_words":{"derivatives":["magnetohydrodynamic","plasma physics","fluid dynamics"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Magnetoplasmadynamics' is a highly specialized term used in physics and engineering, particularly in contexts involving plasma and magnetic fields. Understanding this term requires a background in physics, especially electromagnetism and fluid dynamics. It's commonly encountered in scientific literature related to fusion energy, astrophysics, and certain industrial applications. The term itself describes the study of how magnetic fields influence the behavior of electrically conductive fluids, such as plasma, and is often used interchangeably with 'magnetohydrodynamics' (MHD)."},"example_sentences":[{"sentence":"The stability of plasma in a fusion reactor is analyzed using magnetoplasmadynamics.","translation":"核融合炉におけるプラズマの安定性は、磁気プラズマ力学を用いて解析される。","type":"general","meaning_category":"physics"},{"sentence":"Researchers are developing new MPD thrusters for space propulsion.","translation":"研究者たちは宇宙推進用の新しい磁気プラズマ力学スラスターを開発している。","type":"application","meaning_category":"engineering"}]}