{"word":"whitehass","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of sweet, white cheese made from goat's or sheep's milk, traditionally produced in Scotland.","english_definition":"A type of sweet, white cheese made from goat's or sheep's milk, traditionally produced in Scotland.","examples":[{"sentence":"The whitehass had a delicate, slightly tangy flavor.","translation":"ホワイトハスは繊細で、わずかにピリッとした風味がした。"},{"sentence":"Traditionally, whitehass was made during the summer months when milk was plentiful.","translation":"伝統的に、ホワイトハスは牛乳が豊富にある夏の間に作られていた。"}],"collocations":["Scottish whitehass","traditional whitehass","goat's milk whitehass","sheep's milk whitehass"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'whitehass' likely comes from the Scots language, combining 'white' (referring to the cheese's color) and 'hass' (possibly related to a term for a type of cheese or dairy product).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhwaɪtˌhæs/","syllables":"white-hass"},"inflection":{"noun_plural":"whitehasses"},"usage_notes":{"explanation":"Whitehass is a relatively obscure type of cheese, primarily known within Scotland. It is not widely available commercially and is more often made in small batches or at home. Information about whitehass can be limited, and it may not be familiar to those outside of Scotland.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some white house cheese.","correct":"✓ I bought some whitehass cheese.","note":"The correct spelling is 'whitehass,' not 'white house.'"}],"priority":"★★☆"},"related_words":{"derivatives":["N/A"],"phrasal_verbs":["N/A"],"related_terms":["crowdie (another type of Scottish cheese)","Cottage cheese","Ricotta"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - This word is not commonly found in general texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Whitehass' refers to a specific type of sweet, white cheese traditionally made in Scotland from goat's or sheep's milk. Due to its regional specificity and limited commercial availability, the term is not widely known or used outside of Scotland. Understanding the term requires familiarity with Scottish culinary traditions and cheese-making practices."},"example_sentences":[{"sentence":"The cheesemaker prided herself on her traditional method of producing whitehass.","translation":"そのチーズ職人は、ホワイトハスを製造する伝統的な方法に誇りを持っていた。","type":"noun","meaning_category":"cheese"},{"sentence":"We sampled a variety of Scottish cheeses, including a creamy whitehass.","translation":"私たちはクリーミーなホワイトハスを含む、様々なスコットランドのチーズを試食した。","type":"noun","meaning_category":"cheese"}]}