{"word":"unbarreled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"樽詰めされていない、樽熟成されていない","english_definition":"Not stored or aged in a barrel.","examples":[{"sentence":"This whiskey is unbarreled and has a very raw flavor.","translation":"このウイスキーは樽詰めされておらず、非常に生の風味がします。"},{"sentence":"Unbarreled sake can have a fresher, more vibrant taste.","translation":"樽詰めされていない日本酒は、より新鮮で活気に満ちた味がすることがあります。"}],"collocations":["unbarreled whiskey","unbarreled sake","unbarreled spirit"],"synonyms":["unaged","unmatured"],"antonyms":["barreled","barrel-aged","matured"]}],"etymology":{"value":"The word 'unbarreled' is formed by adding the prefix 'un-' (meaning 'not') to the word 'barreled'. 'Barreled' itself comes from 'barrel', referring to a cylindrical container typically made of wood.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈbærəld/","syllables":"un-bar-reled"},"inflection":{"adjective_forms":{"comparative":"more unbarreled","superlative":"most unbarreled"}},"usage_notes":{"explanation":"'Unbarreled' is primarily used to describe alcoholic beverages, especially spirits like whiskey and sake, that have not undergone the aging process in wooden barrels. This process typically imparts flavors and colors to the beverage. Unbarreled spirits often have a clearer color and a stronger, more direct flavor profile.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbarreled car sped down the street.","correct":"✓ The unbarreled whiskey had a strong taste.","note":"'Unbarreled' is almost exclusively used in the context of alcoholic beverages. Using it to describe other objects is generally incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["barrel","barreled","barrel-aged"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unbarreled' is a specialized term primarily used in the context of alcoholic beverages, specifically to describe those that have not been aged in barrels. Understanding this term requires familiarity with the process of barrel aging and its effects on the flavor and characteristics of spirits like whiskey or sake. It is not a commonly used word in everyday conversation and is more likely to be encountered in specialized contexts such as culinary or beverage-related discussions."},"example_sentences":[{"sentence":"The distillery also produces an unbarreled version of their popular rye.","translation":"その蒸留所では、人気のライ麦の樽詰めされていないバージョンも製造しています。","type":"adjective","meaning_category":"樽詰めされていない"},{"sentence":"Many connoisseurs prefer the complex flavors that barrel-aging imparts, but some appreciate the purity of unbarreled spirits.","translation":"多くの愛好家は樽熟成が与える複雑な風味を好みますが、樽詰めされていないスピリッツの純粋さを評価する人もいます。","type":"adjective","meaning_category":"樽熟成されていない"}]}