{"word":"vassalizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(他国や地域を)属国化する、家臣化する","english_definition":"to make (a country or region) a vassal; to bring under feudal obligation.","examples":[{"sentence":"The emperor aimed at vassalizing the surrounding kingdoms.","translation":"皇帝は周辺の王国を属国化しようと目論んだ。"},{"sentence":"Through military conquest, they were able to vassalize many smaller tribes.","translation":"軍事征服を通じて、彼らは多くの小規模な部族を家臣化することができた。"}],"collocations":["vassalize a kingdom","vassalize a tribe","vassalize a region"],"synonyms":["subjugate","subordinate","dominate","control","annex"],"antonyms":["liberate","emancipate","free"]},{"part_of_speech":"verb","transitivity":"vi","definition":"属国になる、家臣になる","english_definition":"to become a vassal; to be brought under feudal obligation.","examples":[{"sentence":"The small nation feared being vassalizing by the larger empire.","translation":"その小国は、より大きな帝国によって属国化されることを恐れていた。"}],"collocations":["be vassalizing","become vassalizing"],"synonyms":["become subordinate","become dependent"],"antonyms":["become independent","become autonomous"]}],"etymology":{"value":"The word 'vassalizing' is derived from 'vassal,' which comes from the Medieval Latin 'vassallus,' meaning 'servant' or 'dependent.' The suffix '-ize' (or '-ise' in British English) is added to form a verb meaning 'to make into a vassal' or 'to subject to vassalage.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæsəlaɪzɪŋ/","syllables":"vas-sal-iz-ing"},"inflection":{"verb_forms":{"present_simple":["vassalize","vassalizes"],"past_simple":"vassalized","past_participle":"vassalized","present_participle":"vassalizing"}},"usage_notes":{"explanation":"'Vassalizing' is a verb primarily used in historical and political contexts to describe the act of bringing a country or region under the control of another, making it a vassal state. A vassal state owes allegiance and tribute to a more powerful overlord. The term implies a relationship of dependency and subordination. It is less commonly used in modern political discourse, but can appear in discussions of historical empires and feudal systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is vassalizing with its neighbor.","correct":"✓ The country is vassalizing its neighbor.","note":"'Vassalize' is a transitive verb, so it requires a direct object (the entity being vassalized). The preposition 'with' is unnecessary and incorrect in this context."},{"incorrect":"✗ They are vassalizing because they are weak.","correct":"✓ They are being vassalized because they are weak.","note":"When describing a country undergoing the process of being vassalized, use the passive voice ('being vassalized'). The active voice implies the country is actively vassalizing others, which is the opposite of what is intended."}],"priority":"★★☆"},"related_words":{"derivatives":["vassal (noun: a person or state in a subordinate position to another)","vassalage (noun: the condition of being a vassal)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'vassalizing' is a relatively uncommon term, primarily used in historical or political contexts. It describes the act of making a country or region a vassal, meaning it is subordinate and owes allegiance to a more powerful entity. Understanding the concept of feudalism and historical power dynamics is helpful for comprehending the meaning of this word. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The Roman Empire was known for vassalizing numerous territories to expand its influence.","translation":"ローマ帝国は、影響力を拡大するために多くの領土を属国化することで知られていた。","type":"verb (vt)","meaning_category":"属国化する"},{"sentence":"The treaty aimed to prevent any further attempts at vassalizing neighboring states.","translation":"その条約は、近隣諸国をさらに属国化しようとする試みを阻止することを目的としていた。","type":"verb (vt)","meaning_category":"属国化する"},{"sentence":"The small kingdom risked being vassalizing if it didn't form alliances.","translation":"その小王国は同盟を結ばなければ属国化される危険があった。","type":"verb (vi)","meaning_category":"属国になる"}]}