{"word":"non-Zionism","priority":"2","meanings":[{"part_of_speech":"noun","definition":"シオニズムではないこと、またはシオニズムを支持しない立場。","english_definition":"A political stance that is neither Zionist nor anti-Zionist; a position of indifference to Zionism, or support for Jewish existence and culture without necessarily supporting a Jewish state.","examples":[{"sentence":"Non-Zionism historically represented a variety of views within the Jewish community.","translation":"非シオニズムは歴史的に、ユダヤ人コミュニティ内のさまざまな見解を代表していました。"},{"sentence":"Some religious groups adhere to non-Zionism, believing that a Jewish state should only be established by divine intervention.","translation":"一部の宗教団体は、ユダヤ人国家は神の介入によってのみ樹立されるべきだと信じて、非シオニズムを支持しています。"},{"sentence":"Non-Zionism differs from anti-Zionism in that it does not actively oppose the existence of Israel.","translation":"非シオニズムは、イスラエルの存在に積極的に反対しない点で、反シオニズムとは異なります."}],"collocations":["religious non-Zionism","cultural non-Zionism","historical non-Zionism"],"synonyms":["anti-Zionism (in some contexts, although this is often a stronger opposition)","post-Zionism (in some contexts, referring to views after the establishment of Israel)"],"antonyms":["Zionism"],"related_words":["Zionist","anti-Zionist","post-Zionist","Diaspora Judaism","Jewish nationalism","Israel","Palestine"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'Zionism'.","priority":"3"},"pronunciation":{"ipa":"/ˌnɒnˈzaɪənɪzəm/","syllables":"non-Zi-on-ism"},"usage_notes":{"explanation":"Non-Zionism is a nuanced position. It can range from indifference to the idea of a Jewish state, to supporting Jewish cultural and religious life without advocating for statehood, to believing that a Jewish state should only arise through divine action, not political means. It is important to distinguish it from anti-Zionism, which actively opposes the existence of a Jewish state.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"Non-Zionism is the same as anti-Zionism.","correct":"Non-Zionism is distinct from anti-Zionism; it doesn't necessarily oppose the existence of Israel.","note":"It is crucial to differentiate non-Zionism from anti-Zionism."}],"priority":"3"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'non-Zionism' refers to a position that is neither for nor necessarily against the establishment or existence of a Jewish state (Israel). It can encompass indifference, alternative visions of Jewish identity, or religious beliefs. Understanding it requires knowledge of the history and politics surrounding Zionism and the creation of Israel."},"example_sentences":[{"sentence":"Early 20th-century non-Zionism emphasized cultural and religious autonomy for Jewish communities worldwide.","translation":"20世紀初頭の非シオニズムは、世界中のユダヤ人コミュニティの文化的および宗教的自治を強調していました。"},{"sentence":"Some Orthodox Jewish groups maintain a non-Zionist stance based on theological grounds.","translation":"一部の正統派ユダヤ人グループは、神学的根拠に基づいて非シオニズムの立場を維持しています。"},{"sentence":"The debate between Zionism and non-Zionism shaped Jewish politics in the pre-state era.","translation":"シオニズムと非シオニズムの間の議論は、国家成立前の時代のユダヤ人政治を形作りました。"}]}