{"word":"antiurease","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウレアーゼ阻害剤","english_definition":"A substance that inhibits the activity of urease.","examples":[{"sentence":"The use of antiurease can reduce ammonia volatilization from urea-based fertilizers.","translation":"抗ウレアーゼ剤の使用は、尿素系肥料からのアンモニア揮散を減少させることができる。"}],"collocations":["antiurease activity","antiurease compound","antiurease inhibitor"],"synonyms":["urease inhibitor"],"antonyms":[]}],"etymology":{"value":"'anti-' (against) + 'urease' (enzyme that catalyzes the hydrolysis of urea).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈjʊəreɪs/","syllables":"an-ti-u-re-ase"},"inflection":{"noun_plural":"antiureases"},"usage_notes":{"explanation":"'Antiurease' refers to substances that specifically target and inhibit the urease enzyme. This enzyme is responsible for the hydrolysis of urea into ammonia and carbon dioxide. Inhibiting this process is important in agriculture to reduce nitrogen loss from urea-based fertilizers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antiurease was added to increase urease activity.","correct":"✓ The antiurease was added to decrease urease activity.","note":"Antiureases inhibit, not increase, urease activity."}],"priority":"★★☆"},"related_words":{"derivatives":["urease","urea","hydrolysis","inhibitor"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiurease' is a technical term primarily used in agricultural science and chemistry. It refers to a class of compounds that inhibit the activity of the urease enzyme, which breaks down urea into ammonia. This is important for improving the efficiency of urea-based fertilizers by reducing nitrogen loss. The term is not commonly used outside of specialized contexts. "},"example_sentences":[{"sentence":"The effectiveness of the antiurease was evaluated in field trials.","translation":"その抗ウレアーゼ剤の有効性は、圃場試験で評価された。","type":"noun","meaning_category":"ウレアーゼ阻害剤"},{"sentence":"Different types of antiurease have varying degrees of efficacy.","translation":"異なる種類の抗ウレアーゼ剤は、有効性が異なる。","type":"noun","meaning_category":"ウレアーゼ阻害剤"}]}