{"word":"thiourethane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チオウレタン","english_definition":"A chemical compound containing sulfur, nitrogen, carbon, and hydrogen, derived from urethane by replacing one or more oxygen atoms with sulfur atoms.","examples":[{"sentence":"Thiourethane is used in the production of pesticides.","translation":"チオウレタンは殺虫剤の製造に使用されます。"},{"sentence":"Some thiourethanes are known to be carcinogenic.","translation":"一部のチオウレタンは発がん性物質として知られています。"}],"collocations":["synthesis of thiourethane","properties of thiourethane","toxicity of thiourethane"],"synonyms":["ethyl thiocarbamate"],"antonyms":[]}],"etymology":{"value":"Derived from 'thio-' (indicating the presence of sulfur), 'urethane' (a type of organic compound), and the suffix '-ane' (used in organic chemistry nomenclature).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθaɪoʊˈjʊərəθeɪn/","syllables":"thi-o-u-re-thane"},"inflection":{"noun_plural":"thiourethanes"},"usage_notes":{"explanation":"Thiourethanes are a class of organosulfur compounds structurally related to urethanes, where one or more oxygen atoms have been replaced by sulfur atoms. They find applications in various industrial processes, including the production of pesticides, rubber accelerators, and pharmaceuticals. Due to potential health hazards, handling and disposal should be done with care.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["urethane","thiocarbamate"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Thiourethane' is a highly specialized term in organic chemistry, referring to a specific class of compounds. Understanding its properties and uses requires a strong background in chemistry. Due to its limited use outside of scientific contexts, it is not commonly encountered.","priority":"★★☆"},"example_sentences":[{"sentence":"The synthesis of thiourethane derivatives is a key area of research in organic chemistry.","translation":"チオウレタン誘導体の合成は、有機化学における重要な研究分野です。","type":"general","meaning_category":"chemical compound"},{"sentence":"The study investigated the effects of thiourethane on various biological systems.","translation":"その研究では、様々な生物系に対するチオウレタンの影響を調査しました。","type":"scientific","meaning_category":"chemical compound"}]}