{"word":"presusceptible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"感受性を持つ前の、影響を受けやすい状態にある","english_definition":"Susceptible or vulnerable before a specific event or condition occurs.","examples":[{"sentence":"The children were presusceptible to the flu before they received their vaccinations.","translation":"子供たちは予防接種を受ける前にインフルエンザにかかりやすい状態でした。"},{"sentence":"The old bridge was presusceptible to collapse due to years of neglect.","translation":"その古い橋は何年も放置されていたため、崩壊しやすい状態でした。"}],"collocations":["presusceptible to disease","presusceptible to influence","presusceptible to damage"],"synonyms":["vulnerable","predisposed","susceptible","prone","open"],"antonyms":["immune","resistant","protected","invulnerable"]}],"etymology":{"value":"The word 'presusceptible' is formed by adding the prefix 'pre-' (meaning 'before') to the word 'susceptible' (meaning 'likely to be influenced or harmed by a particular thing).","priority":"★★☆"},"pronunciation":{"ipa":"/priːsəˈseptɪbəl/","syllables":"pre-suh-cep-ti-ble"},"inflection":{"adjective_forms":{"comparative":"more presusceptible","superlative":"most presusceptible"}},"usage_notes":{"explanation":"'Presusceptible' is used to describe a state of vulnerability or susceptibility that exists before a specific event or condition takes place. It highlights the idea that someone or something is already in a weakened or receptive state before being exposed to a particular influence or harm.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is presusceptible with the disease.","correct":"✓ The patient is presusceptible to the disease.","note":"Use the preposition 'to' after 'presusceptible' to indicate what the subject is vulnerable to."},{"incorrect":"✗ The presusceptible of the building caused the collapse.","correct":"✓ The presusceptibility of the building caused the collapse.","note":"'Presusceptible' is an adjective. Use the noun form 'presusceptibility' to refer to the state of being presusceptible."}],"priority":"★★☆"},"related_words":{"derivatives":["presusceptibility (noun): the state of being presusceptible"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'presusceptible' is a relatively uncommon term used to describe a state of vulnerability or susceptibility that exists before a specific event or condition. It is often used in scientific or medical contexts to indicate a predisposition to a particular disease or condition. Understanding this word requires a good grasp of the prefix 'pre-' and the base word 'susceptible.'"},"example_sentences":[{"sentence":"The study aimed to identify individuals who were presusceptible to developing the condition.","translation":"その研究は、その状態を発症しやすい個人を特定することを目的としていました。","type":"general","meaning_category":"vulnerable before a condition"},{"sentence":"The plants were presusceptible to fungal infections due to the damp environment.","translation":"植物は湿った環境のため、真菌感染症にかかりやすい状態でした。","type":"general","meaning_category":"vulnerable before an event"}]}