{"word":"undecorously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"下品に、みっともなく、不作法に、礼儀をわきまえず","english_definition":"in a way that is not in keeping with accepted standards of good taste and propriety; in a manner that is unseemly or indecorous.","examples":[{"sentence":"The guest behaved undecorously at the formal dinner, speaking loudly and interrupting others.","translation":"その客は正式な夕食会で、大声で話したり、他の人の話を遮ったりして、下品な振る舞いをした。"},{"sentence":"He laughed undecorously at the serious announcement, causing discomfort among those present.","translation":"彼は深刻な発表に対して下品に笑い、その場にいた人々に不快感を与えた。"},{"sentence":"She dressed undecorously for the religious ceremony, wearing revealing clothing that was inappropriate for the occasion.","translation":"彼女は宗教的な儀式にそぐわない、露出度の高い服を着て、みっともない服装で参加した。"}],"collocations":["behave undecorously","dress undecorously","laugh undecorously","act undecorously","speak undecorously"],"synonyms":["improperly","indecently","unseemly","inappropriately","tastelessly","vulgar","crudely","boorishly","churlishly","gauchely","badly","poorly","wrongly"],"antonyms":["decorously","properly","appropriately","decently","tastefully","respectfully","politely","elegantly","gracefully"]}],"etymology":{"value":"\"Undecorously\" is formed by adding the prefix \"un-\" (meaning \"not\") to \"decorously.\" \"Decorously\" comes from \"decorous,\" which is derived from the Latin word \"decorus,\" meaning \"suitable,\" \"becoming,\" or \"graceful.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈkɔːrəsli/","syllables":"un-de-co-rous-ly"},"inflection":{"notes":"As an adverb, \"undecorously\" does not have different inflections."},"usage_notes":{"explanation":"\"Undecorously\" describes actions or behaviors that violate social norms of propriety, good taste, or decorum. It implies a lack of refinement, politeness, or respect for the situation or others present. The term is often used in contexts where formal or traditional standards of behavior are expected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted undecorous.","correct":"✓ He acted undecorously.","note":"\"Undecorous\" is an adjective, while \"undecorously\" is the adverb. Use the adverb to modify verbs (actions)."},{"incorrect":"✗ She behaved undecorously, that was very bad.","correct":"✓ She behaved undecorously; that was very bad. / ✓ Her behavior was undecorous; that was very bad.","note":"Ensure correct usage of the adverb (undecorously) to describe the manner of the action and the adjective (undecorous) to describe the quality of the behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["undecorous (adjective): lacking good taste or propriety; unseemly.","decorous (adjective): in keeping with good taste and propriety; polite and restrained.","decorum (noun): behavior in keeping with good taste and propriety; etiquette."],"antonyms":["decorously (adverb): in a decorous manner; properly."],"synonyms":["improperly","indecently","unseemly","inappropriately","tastelessly","vulgar","crudely","boorishly","churlishly","gauchely","badly","poorly","wrongly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undecorously\" is a formal term used to describe behavior that lacks good taste or violates social norms of propriety. It is the adverbial form of \"undecorous,\" which means unseemly or inappropriate. This word is not commonly used in everyday conversation but is more likely to appear in literature, formal writing, or discussions about etiquette and social behavior. Understanding this word helps in comprehending nuanced descriptions of behavior that deviates from expected standards of politeness and decorum."},"example_sentences":[{"sentence":"The politician spoke undecorously about his opponent, using insults and personal attacks.","translation":"その政治家は対立候補について、侮辱や個人攻撃を用いて下品に語った。","type":"adverb","meaning_category":"improperly"},{"sentence":"The children behaved undecorously at the wedding reception, running around and making noise.","translation":"子供たちは結婚披露宴で走り回ったり騒いだりして、みっともない振る舞いをした。","type":"adverb","meaning_category":"unseemly"},{"sentence":"He ate his meal undecorously, with his elbows on the table and his mouth open.","translation":"彼は肘をテーブルにつき、口を開けたまま食事をするという、不作法な食べ方をした。","type":"adverb","meaning_category":"inappropriately"}]}