{"word":"Parshuram","priority":"★★★","meanings":[{"part_of_speech":"proper noun","definition":"ヒンドゥー教の神話に登場するヴィシュヌ神の6番目のアヴァターラ（化身）で、斧を持つ戦士の姿をした聖仙","english_definition":"The sixth avatar of Lord Vishnu in Hindu mythology, depicted as a warrior-sage wielding an axe.","examples":[{"sentence":"Parshuram is revered as the immortal warrior who cleansed the world of corrupt Kshatriyas.","translation":"パラシュラーマは腐敗したクシャトリヤを浄化した不死の戦士として崇拝されている。"},{"sentence":"The legend says Parshuram received his divine axe from Lord Shiva after severe penance.","translation":"伝説によると、パラシュラーマは厳しい苦行の後、シヴァ神から神聖な斧を授かったという。"}],"cultural_context":["21回にわたり地球を腐敗した王族から浄化したとされる","クリタユガ（最初のユガ）に出現したと信じられている","武術の祖師としても崇拝される（特にカラリパヤットなど）"],"synonyms":["Bhargava Rama","Jamadagnya"]},{"part_of_speech":"proper noun","definition":"インドのマハーラーシュトラ州コンカン地方における重要な文化的象徴","english_definition":"An important cultural symbol in the Konkan region of Maharashtra, India.","examples":[{"sentence":"Many temples in coastal Maharashtra are dedicated to Parshuram.","translation":"マハーラーシュトラ州の沿岸部にはパラシュラーマに捧げられた寺院が多数存在する。"}],"cultural_context":["コンカン地方の創設者と信じられている","パラシュラーマ・クシェトラ（聖地）と関連"]}],"etymology":{"value":"サンスクリット語の「परशुराम (Paraśurāma)」に由来。『परशु (paraśu)』は『斧』、『राम (rāma)』は『ラーマ（喜ばしい者）』を意味する。文字通り『斧を持つラーマ』を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/pər.ʃu.ˈrɑː.mə/","syllables":"Par-shu-ram"},"cultural_significance":{"hindu_texts":["『マハーバーラタ』に重要な役割で登場","『ヴィシュヌ・プラーナ』でアヴァターラとして言及","『アグニ・プラーナ』に記載"],"festivals":["パラシュラーマ・ジャヤンティ（誕生日を祝う祭り）"],"regional_influence":["ケーララ州・カルナータカ州・マハーラーシュトラ州で特に崇拝","ネパールの一部地域でも信仰"]},"iconography":{"description":"白髪の修行者姿で斧（パラシュ）を持ち、聖なる紐（ヤジョーパヴィータ）をかけた姿で描かれる","symbolism":["斧：腐敗の断罪と浄化の象徴","白髪：永遠の若さ（不死性）のパラドックス"]},"related_figures":[{"name":"Rama","relation":"ヴィシュヌの7番目のアヴァターラ（後継の化身）"},{"name":"Bhisma","relation":"マハーバーラタでパラシュラーマから武術を学んだ"}],"example_sentences":[{"sentence":"Parshuram is believed to still meditate on Mahendra Mountain according to Hindu traditions.","translation":"ヒンドゥーの伝承によれば、パラシュラーマは今もマヘンドラ山で瞑想を続けていると信じられている。"},{"sentence":"The Parshuram Kund in Arunachal Pradesh is a sacred pilgrimage site associated with him.","translation":"アルナーチャル・プラデーシュ州のパラシュラーマ・クンドは彼に関連する聖なる巡礼地である。"}]}