{"word":"Cymophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"波や水に対する恐怖症","english_definition":"The fear of waves or bodies of water.","examples":[{"sentence":"Her cymophobia made trips to the beach a challenge.","translation":"彼女の波恐怖症は、海水浴旅行を困難にした。"},{"sentence":"The therapist helped him overcome his cymophobia through gradual exposure.","translation":"セラピストは、段階的な暴露療法を通して、彼の波恐怖症の克服を助けた。"}],"collocations":["overcome cymophobia","treat cymophobia","suffer from cymophobia"],"synonyms":["aquaphobia (general fear of water)","thalassophobia (fear of the sea)"],"antonyms":["aquaphilia (love of water)"],"notes":"Cymophobia is a specific phobia related to the fear of waves or bodies of water, while aquaphobia is a general fear of water. Thalassophobia is the fear of the sea or ocean."}],"etymology":{"value":"The word \"cymophobia\" comes from the Greek words \"κῦμα\" (kyma) meaning \"wave\" and \"φόβος\" (phobos) meaning \"fear\".","priority":"★★☆"},"pronunciation":{"ipa":"ˌsaɪməˈfoʊbiə","syllables":"cy-mo-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Cymophobia is a relatively rare specific phobia. People with cymophobia may experience anxiety, panic attacks, or avoidance behaviors when exposed to waves or bodies of water. Treatment options include therapy, such as cognitive-behavioral therapy (CBT), and medication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have cymophobia, so I like swimming.","correct":"✓ I have cymophobia, so I avoid swimming.","note":"Cymophobia is a fear of waves or bodies of water, so someone with cymophobia would likely avoid swimming."}],"priority":"★☆☆"},"related_words":{"derivatives":["cymophobic (adjective)"],"related_terms":["phobia","aquaphobia","thalassophobia","hydrophobia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cymophobia is a specific phobia, meaning it's an intense and irrational fear of a particular thing or situation. In this case, it's the fear of waves or bodies of water. If someone has cymophobia, they might feel very anxious or scared when they see waves, or even when they think about them. They might avoid going to the beach or swimming pools because of this fear. It's important to remember that phobias are different from normal fears, as they can significantly impact a person's life."},"example_sentences":[{"sentence":"Her **cymophobia** prevented her from enjoying boat trips.","translation":"彼女の波恐怖症は、ボート旅行を楽しむことを妨げた。","type":"example","meaning_category":"General"},{"sentence":"He sought treatment for his **cymophobia** to be able to swim in the ocean.","translation":"彼は海で泳げるようになるために、波恐怖症の治療を求めた。","type":"example","meaning_category":"Treatment"}]}