{"word":"Angeling","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー)天使のような存在、天使の特性を持つ者、または天使に関連する何か","english_definition":"(Fantasy) An angelic being, someone with angelic qualities, or something related to angels. This is often used in the context of fictional worlds or online games.","examples":[{"sentence":"The Angeling in the game was a powerful healer.","translation":"ゲームの中のアンジェリングは強力なヒーラーだった。"},{"sentence":"She drew an Angeling with shimmering wings.","translation":"彼女はきらめく翼を持つアンジェリングを描いた。"}],"collocations":["Angeling sprite","Angeling wings","powerful Angeling"],"synonyms":["angelic being","celestial being","divine creature"],"antonyms":["demonic being","evil creature"]}],"etymology":{"value":"Likely a derivative of 'angel' with a suffix '-ing', often used to denote a creature or being, especially in fantasy contexts.","priority":"★★★"},"pronunciation":{"ipa":"/ˈeɪndʒəlɪŋ/","syllables":"An-gel-ing"},"inflection":{"noun_plural":"Angelings"},"usage_notes":{"explanation":"'Angeling' is not a standard English word found in most dictionaries. It is primarily used in fantasy literature, online games (such as Ragnarok Online), or creative writing to describe a type of angelic creature or something related to angels. Its meaning is generally understood through its association with 'angel'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The angeling flew high in the sky, it was a bird.","correct":"✓ The angeling flew high in the sky, it was an angelic being.","note":"'Angeling' refers to an angelic creature, not just any bird or flying object."}],"priority":"★★☆"},"related_words":{"derivatives":["angel","angelic","angelical"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in specific contexts (e.g., gaming, fantasy literature).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Angeling' is a specialized term, mostly used in fantasy or gaming contexts. It refers to a creature or being that is angelic in nature. Because it's not a common word, understanding its meaning relies on familiarity with fantasy tropes or the specific context in which it's used. It is derived from the word 'angel' and the suffix '-ing', which often denotes a type of being or creature.","priority":"★★☆"},"example_sentences":[{"sentence":"The player summoned an Angeling to aid them in battle.","translation":"プレイヤーは戦闘で助けるためにアンジェリングを召喚した。","type":"noun","meaning_category":"Fantasy creature"},{"sentence":"Her costume featured delicate Angeling wings.","translation":"彼女の衣装は繊細なアンジェリングの翼が特徴だった。","type":"noun","meaning_category":"Angelic feature"}]}