{"word":"form-focused","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"形式に焦点を当てた、形式重視の","english_definition":"Emphasizing or concentrating on the formal aspects of something, such as grammar, structure, or style.","examples":[{"sentence":"The lesson was very form-focused, with a lot of grammar exercises.","translation":"そのレッスンは形式に非常に焦点を当てており、文法練習がたくさんありました。"},{"sentence":"Form-focused instruction can be helpful for language learners.","translation":"形式に焦点を当てた指導は、言語学習者にとって役立つことがあります。"},{"sentence":"The art critic described the painting as form-focused, emphasizing its composition and technique.","translation":"美術評論家は、その絵画を形式重視であると評し、その構成と技法を強調しました。"}],"collocations":["form-focused instruction (形式に焦点を当てた指導)","form-focused learning (形式に焦点を当てた学習)","form-focused approach (形式に焦点を当てたアプローチ)","form-focused activities (形式に焦点を当てた活動)"],"synonyms":["structure-oriented","grammar-based","style-conscious","formalistic"],"antonyms":["meaning-focused","content-based","communicative"],"notes":"Often used in the context of language teaching and art criticism."}],"etymology":{"value":"A compound adjective formed by combining 'form' (referring to the structure or shape of something) and 'focused' (meaning having one's attention directed on something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrm ˌfoʊkəst/","syllables":"form-fo-cused"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Form-focused' is used to describe something that prioritizes the structure, style, or grammar of a subject over its content or meaning. In language learning, it refers to teaching methods that emphasize grammar rules and sentence structure. In art, it describes works that highlight the artist's technique and composition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The teacher was form-focus.","correct":"✓ The teacher was form-focused.","note":"'Form-focused' is the correct adjective form."},{"incorrect":"✗ The form focus lesson.","correct":"✓ The form-focused lesson.","note":"'Form-focused' is used as an adjective to describe the lesson."}],"priority":"★★☆"},"related_words":{"derivatives":["form (noun)","focus (verb, noun)","focused (adjective)"],"related_terms":["grammar-focused","content-focused","meaning-focused","task-based learning","communicative approach"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in academic and educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'form-focused' is primarily used in academic or specialized contexts, such as education or art criticism. It describes an approach that emphasizes the structure, style, or grammar of something. For example, a 'form-focused' language lesson would concentrate on grammar rules and sentence construction rather than conversational fluency. Understanding this term requires familiarity with abstract concepts and specialized vocabulary. "},"example_sentences":[{"sentence":"The course includes both form-focused and meaning-focused activities.","translation":"そのコースには、形式に焦点を当てた活動と意味に焦点を当てた活動の両方が含まれています。","type":"general","meaning_category":"general"},{"sentence":"Form-focused feedback can help students improve their writing skills.","translation":"形式に焦点を当てたフィードバックは、学生がライティングスキルを向上させるのに役立ちます。","type":"education","meaning_category":"education"},{"sentence":"The artist's work is highly form-focused, with precise attention to detail.","translation":"そのアーティストの作品は非常に形式に焦点を当てており、細部への注意が正確です。","type":"art","meaning_category":"art"}]}