{"word":"proscriber","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人)禁止する人、追放する人、排斥する人","english_definition":"A person who proscribes; one who prohibits or outlaws something; one who denounces or condemns.","examples":[{"sentence":"The proscriber of the new law faced public backlash.","translation":"その新しい法律を禁止した人は、世間の反発に直面した。"},{"sentence":"He was known as a proscriber of certain books and ideas.","translation":"彼は特定の書籍や思想を排斥する人として知られていた。"}],"collocations":["proscriber of books","proscriber of ideas","political proscriber"],"synonyms":["banisher","outlawer","censor","denouncer","condemner"],"antonyms":["advocate","supporter","promoter"]}],"etymology":{"value":"From the verb 'proscribe,' which comes from Latin 'proscribere,' meaning 'to announce publicly in writing, to post, to outlaw, to banish.' 'Pro' means 'before' and 'scribere' means 'to write.'","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈskraɪbər/","syllables":"pro-scrib-er"},"inflection":{"noun_plural":"proscribers"},"usage_notes":{"explanation":"'Proscriber' refers to someone who formally prohibits or condemns something, often with legal or official authority. It can also refer to someone who strongly denounces or rejects certain ideas or practices. The term often carries a negative connotation, implying an authoritarian or censorious attitude.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proscriber advocated for the new policy.","correct":"✓ The proscriber condemned the new policy.","note":"'Proscriber' implies opposition and condemnation, not advocacy. Use 'advocate' or 'supporter' to indicate support."}],"priority":"★☆☆"},"related_words":{"derivatives":["proscribe (verb): to forbid, outlaw, or denounce","proscription (noun): the act of proscribing; a prohibition or banishment","proscriptive (adjective): tending to proscribe; prohibitive"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proscriber' is a relatively uncommon and formal word. It is typically used in legal, political, or academic contexts to describe someone who officially prohibits or strongly condemns something. Understanding the root verb 'proscribe' is helpful for comprehending the meaning of 'proscriber.'"},"example_sentences":[{"sentence":"The government acted as a proscriber of dissent, silencing any opposing voices.","translation":"政府は異議を唱える者を排斥する者として行動し、反対意見を封じ込めた。","type":"general","meaning_category":"排斥する人"},{"sentence":"As a moral proscriber, she condemned what she saw as the decadence of modern society.","translation":"道徳的な排斥者として、彼女は現代社会の退廃と見なすものを非難した。","type":"general","meaning_category":"非難する人"}]}