{"word":"mosaic-floored","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"モザイクの床の、モザイク敷きの","english_definition":"Having a floor covered with mosaics.","examples":[{"sentence":"The ancient Roman villa was mosaic-floored, showcasing intricate designs.","translation":"その古代ローマの別荘はモザイク敷きで、複雑なデザインが展示されていた。"},{"sentence":"We entered a mosaic-floored courtyard, where a fountain bubbled gently.","translation":"私たちはモザイクの床の中庭に入り、そこでは噴水が穏やかに湧き出ていた。"},{"sentence":"The museum's mosaic-floored hall was filled with visitors admiring the artwork.","translation":"博物館のモザイク敷きのホールは、美術品を鑑賞する訪問者でいっぱいだった。"}],"collocations":["mosaic-floored hall","mosaic-floored courtyard","mosaic-floored room","mosaic-floored bathroom","mosaic-floored villa"],"synonyms":["tiled","paved with mosaics","mosaic-tiled"],"antonyms":[]}],"etymology":{"value":"The word is a compound adjective formed by combining \"mosaic\" (referring to the art form of creating images or patterns with small pieces of colored material) and \"floored\" (meaning having a floor).","priority":"★★☆"},"pronunciation":{"ipa":"/moʊˈzeɪɪk flɔːrd/","syllables":"mo-sa-ic floored"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"mosaic-floored\" is typically used to describe spaces, often historical or luxurious, where the floor is a prominent feature due to its artistic mosaic design. It suggests a level of craftsmanship and aesthetic detail beyond a simple floor covering.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The floor was mosaic floored.","correct":"✓ The floor was mosaic-floored.","note":"When using 'mosaic-floored' as an adjective before a noun, it's correctly hyphenated. When describing the floor separately, you could say, 'The floor was covered in mosaics.'"},{"incorrect":"✗ The mosaic floored was beautiful.","correct":"✓ The mosaic-floored hall was beautiful.","note":"'Mosaic-floored' needs to modify a noun; it describes something that has a mosaic floor, not the floor itself."}],"priority":"★★☆"},"related_words":{"derivatives":["mosaic","floor","tiled","paved"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"mosaic-floored\" is relatively uncommon and specific, typically used in descriptions of architecture or interior design where the floor is a significant artistic element. Its usage implies a higher level of vocabulary and familiarity with design terminology. The word is straightforward in meaning but less frequently encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The restaurant featured a stunning mosaic-floored entrance.","translation":"そのレストランは、見事なモザイクの床の入り口が特徴だった。","type":"descriptive","meaning_category":"モザイクの床の"},{"sentence":"Archaeologists carefully excavated the mosaic-floored bathhouse.","translation":"考古学者はモザイク敷きの浴場を注意深く発掘した。","type":"historical","meaning_category":"モザイク敷きの"},{"sentence":"Sunlight streamed through the windows, illuminating the mosaic-floored terrace.","translation":"日光が窓から差し込み、モザイクの床のテラスを照らした。","type":"descriptive","meaning_category":"モザイクの床の"}]}