{"word":"Redeemers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) 贖い主、救済者、買い戻す人","english_definition":"(plural form) Those who redeem; saviors; those who buy back or recover something by payment or other means.","examples":[{"sentence":"The Redeemers were celebrated for their efforts to rebuild the community after the disaster.","translation":"贖い主たちは、災害後のコミュニティ再建の努力を称えられた。"},{"sentence":"History remembers the Redeemers as figures who brought hope during dark times.","translation":"歴史は、贖い主たちを暗黒時代に希望をもたらした人物として記憶している。"}],"collocations":["Southern Redeemers (南部贖い主)","spiritual redeemers (精神的な贖い主)"],"synonyms":["saviors","liberators","deliverers","rescuers"],"antonyms":["oppressors","enslavers"]}],"etymology":{"value":"Derived from the verb 'redeem,' which comes from Latin 'redimere,' meaning 'to buy back, repurchase, ransom.' The addition of '-er' creates a noun denoting someone who performs the action of redeeming. The plural '-s' indicates multiple individuals.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈdiːmərz/","syllables":"re-deem-ers"},"inflection":{"noun_plural":"Redeemers"},"usage_notes":{"explanation":"'Redeemers' typically refers to individuals who liberate or save others from negative circumstances, whether literal or figurative. It can have religious connotations, referring to figures who provide spiritual salvation. Historically, in the United States, 'Redeemers' referred to a political coalition in the Southern states during the Reconstruction era who sought to overthrow the Republican state governments. The term can also apply to people who repurchase something, such as property or possessions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Redeemer are coming.","correct":"✓ The Redeemers are coming.","note":"Since 'Redeemers' is plural, the verb should agree with a plural subject (i.e., 'are' instead of 'is')."},{"incorrect":"✗ He is one of the redeemer.","correct":"✓ He is one of the redeemers.","note":"When referring to one person among a group of redeemers, the plural form 'redeemers' should still be used."}],"priority":"★★☆"},"related_words":{"derivatives":["redeem (verb)","redeemer (singular noun)","redemption (noun)","redeemable (adjective)"],"phrasal_verbs":["N/A"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Redeemers' is a term that is not commonly used in everyday conversation but may appear in historical, political, or religious contexts. It refers to a group of people who act to save or liberate others, often with connotations of sacrifice or significant effort. Understanding the term requires a grasp of the concept of redemption and its various applications."},"example_sentences":[{"sentence":"The historical accounts portray the Redeemers as controversial figures.","translation":"歴史的記述は、贖い主たちを物議を醸す人物として描いている。","type":"noun","meaning_category":"historical"},{"sentence":"Many saw the political party as the redeemers of the nation.","translation":"多くの人々がその政党を国家の救済者とみなした。","type":"noun","meaning_category":"political"},{"sentence":"The spiritual leaders were considered redeemers by their followers.","translation":"その精神的指導者たちは、信者たちから贖い主とみなされていた。","type":"noun","meaning_category":"religious"}]}