{"word":"astronomy-themed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"天文学をテーマにした、天文学的なテーマの","english_definition":"Having a theme related to astronomy; relating to the study of stars, planets, and other objects in outer space.","examples":[{"sentence":"The party was astronomy-themed, with decorations of stars and planets.","translation":"パーティーは天文学をテーマにしており、星や惑星の装飾が施されていました。"},{"sentence":"She created an astronomy-themed website to share her passion for space.","translation":"彼女は宇宙への情熱を共有するために、天文学をテーマにしたウェブサイトを作成しました。"},{"sentence":"The museum featured an astronomy-themed exhibit on the solar system.","translation":"博物館では、太陽系に関する天文学をテーマにした展示が行われました。"}],"collocations":["astronomy-themed party (天文学をテーマにしたパーティー)","astronomy-themed event (天文学をテーマにしたイベント)","astronomy-themed exhibit (天文学をテーマにした展示)","astronomy-themed website (天文学をテーマにしたウェブサイト)","astronomy-themed classroom (天文学をテーマにした教室)","astronomy-themed gift (天文学をテーマにした贈り物)"],"synonyms":["space-themed","celestial-themed","star-themed","planetary-themed"],"antonyms":["earth-themed","terrestrial-themed"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"astronomy\" (the scientific study of celestial objects and phenomena) with \"themed\" (having a particular theme or subject).","priority":"☆☆☆"},"pronunciation":{"ipa":"/əˈstrɒnəmi θiːmd/","syllables":"as-tron-o-my themed"},"inflection":{"notes":"This is an adjective, so it does not inflect."},"usage_notes":{"explanation":"\"Astronomy-themed\" is used to describe something that has astronomy as its central subject or motif. It is often used in contexts such as parties, events, exhibits, educational materials, and gifts. The term implies that the object or event incorporates elements related to stars, planets, galaxies, and other aspects of space.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The astronomy themed party was great.","correct":"✓ The astronomy-themed party was great.","note":"The hyphen is important to connect \"astronomy\" and \"themed\" to form a compound adjective. Without the hyphen, it can be misinterpreted."}],"priority":"☆☆☆"},"related_words":{"derivatives":["astronomy (noun)","astronomical (adjective)","astronomer (noun)"],"related_terms":["space","celestial","planetary","stellar","cosmic"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'astronomy-themed' is a compound adjective used to describe something that has astronomy as its main subject or motif. It is generally used in specific contexts such as events, exhibits, or educational materials. Understanding the meaning of 'astronomy' is essential to grasp the meaning of this term. It is more commonly used among people with an interest in astronomy or related fields."},"example_sentences":[{"sentence":"They decorated the room with astronomy-themed posters and models of planets.","translation":"彼らは部屋を天文学をテーマにしたポスターや惑星の模型で飾りました。","type":"example","meaning_category":"general"},{"sentence":"The school organized an astronomy-themed science fair to encourage students' interest in space.","translation":"学校は生徒たちの宇宙への関心を高めるために、天文学をテーマにした理科展を企画しました。","type":"example","meaning_category":"education"},{"sentence":"She received an astronomy-themed telescope as a birthday gift.","translation":"彼女は誕生日プレゼントに天文学をテーマにした望遠鏡をもらいました。","type":"example","meaning_category":"gifts"}]}