{"word":"Terebratuloid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of articulate brachiopod characterized by a smooth, oval or rounded shell with a prominent loop supporting the lophophore.","english_definition":"A brachiopod belonging to the order Terebratulida, typically having a smooth shell and a loop-like structure supporting the lophophore.","examples":[{"sentence":"Terebratuloids are common fossils in many marine sedimentary rocks.","translation":"テリブラツロイドは多くの海洋性堆積岩によく見られる化石です。"}],"collocations":["fossil terebratuloid","extinct terebratuloid","terebratuloid brachiopod"],"synonyms":["Terebratulida (order)"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Terebratula* (from Latin *terebra* 'auger, borer', referring to the foramen in the pedicle valve) + -oid (suffix indicating resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛrɪˌbrætjuˈlɔɪd/","syllables":"Te-re-brat-u-loid"},"inflection":{"noun_plural":"Terebratuloids"},"usage_notes":{"explanation":"'Terebratuloid' is primarily used in paleontology and geology when discussing or identifying fossil brachiopods. It refers to a specific type of brachiopod with particular shell characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The terebratuloid was a type of mollusk.","correct":"✓ The terebratuloid was a type of brachiopod.","note":"Terebratuloids are brachiopods, not mollusks."}],"priority":"★★☆"},"related_words":{"derivatives":["Terebratula","Terebratulida"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Terebratuloid' is highly specialized, primarily used within the fields of paleontology and geology. Understanding requires familiarity with the classification and morphology of brachiopods, a relatively obscure group of marine animals. The word's etymology and usage are technical, making it inaccessible to general audiences."},"example_sentences":[{"sentence":"The museum exhibit featured a well-preserved terebratuloid fossil from the Jurassic period.","translation":"博物館の展示では、ジュラ紀の保存状態の良いテリブラツロイドの化石が展示されていました。","type":"noun","meaning_category":"brachiopod"},{"sentence":"Researchers studied the shell structure of the terebratuloid to understand its evolutionary history.","translation":"研究者たちは、その進化の歴史を理解するために、テリブラツロイドの殻の構造を研究しました。","type":"noun","meaning_category":"brachiopod"}]}