{"word":"antineoplastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"抗腫瘍性の、抗腫瘍薬の","english_definition":"Acting to prevent, inhibit, or halt the development of a neoplasm (tumor).","examples":[{"sentence":"Antineoplastic drugs are used in chemotherapy.","translation":"抗腫瘍薬は化学療法で使用されます。"},{"sentence":"The antineoplastic effect of the compound was demonstrated in vitro.","translation":"その化合物の抗腫瘍効果はin vitroで実証されました。"}],"collocations":["antineoplastic agent","antineoplastic drug","antineoplastic therapy","antineoplastic activity"],"synonyms":["anticancer","tumor-inhibiting"],"antonyms":["pro-neoplastic","tumor-promoting"]}],"etymology":{"value":"The word \"antineoplastic\" is formed from the prefix \"anti-\" (meaning against), the word \"neoplasm\" (meaning a new and abnormal growth of tissue in the body; a tumor), and the suffix \"-ic\" (meaning pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiːnɪəˈplæstɪk/","syllables":"an-ti-neo-plas-tic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Antineoplastic\" specifically refers to substances or treatments that target neoplasms, which are abnormal growths that can be either benign or malignant. It is most commonly used in the context of cancer treatment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed an antineoplastic for my infection.","correct":"✓ The doctor prescribed an antibiotic for my infection.","note":"Antineoplastics are for treating neoplasms (tumors), not infections. Antibiotics are used for infections."},{"incorrect":"✗ Antineoplastic is a type of cancer.","correct":"✓ Antineoplastic is a type of treatment for cancer.","note":"Antineoplastic refers to the treatment, not the disease itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["antineoplastically (adverb)"],"related_terms":["neoplasm","chemotherapy","cancer","tumor","oncology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a specialized term used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antineoplastic\" is a technical term primarily used in medical and scientific contexts. It describes substances or treatments that work against neoplasms, which are abnormal growths of tissue, often associated with cancer. Understanding this term requires a basic knowledge of medical terminology related to cancer and tumor biology."},"example_sentences":[{"sentence":"The new antineoplastic drug showed promising results in clinical trials.","translation":"その新しい抗腫瘍薬は臨床試験で有望な結果を示しました。","type":"adjective","meaning_category":"抗腫瘍性の"},{"sentence":"Antineoplastic agents can have significant side effects.","translation":"抗腫瘍薬は重大な副作用を伴うことがあります。","type":"adjective","meaning_category":"抗腫瘍性の"}]}