{"word":"Ethnohistorical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"民族歴史学的な","english_definition":"Relating to ethnohistory, the study of cultures and indigenous peoples by using historical records as well as anthropological methods.","examples":[{"sentence":"The ethnohistorical research provided new insights into the tribe's past.","translation":"その民族歴史学的な研究は、部族の過去に関する新たな洞察を提供した。"},{"sentence":"Ethnohistorical methods combine historical documents with oral traditions.","translation":"民族歴史学的な手法は、歴史的な文書と口頭伝承を組み合わせる。"}],"collocations":["ethnohistorical research","ethnohistorical analysis","ethnohistorical study"],"synonyms":["anthropological","historical"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining 'ethno-' (referring to ethnicity or people) with 'historical' (relating to history).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛθnoʊhɪˈstɒrɪkəl/","syllables":"eth-no-his-tor-i-cal"},"inflection":{},"usage_notes":{"explanation":"'Ethnohistorical' is primarily used in academic and research contexts. It emphasizes the interdisciplinary nature of studying cultures, combining historical and anthropological approaches.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":["ethnohistory (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'ethnohistorical' is a specialized term used in academic fields such as anthropology, history, and archaeology. It refers to research or analysis that combines historical documents and anthropological methods to study the history of ethnic groups, especially indigenous peoples. Understanding this term requires familiarity with interdisciplinary research methods and academic discourse."},"example_sentences":[{"sentence":"The ethnohistorical account detailed the interactions between the settlers and the native population.","translation":"その民族歴史学的な記述は、入植者と先住民との間の交流を詳細に記述した。","type":"adjective","meaning_category":"民族歴史学的な"},{"sentence":"An ethnohistorical perspective is crucial for understanding the complexities of cultural change.","translation":"民族歴史学的な視点は、文化変容の複雑さを理解するために不可欠である。","type":"adjective","meaning_category":"民族歴史学的な"}]}