{"word":"archlute","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アーチリュート：リュートの一種で、ネックが二つあり、低音域を拡張するために長いベース弦（ダイアポン弦）が追加されたもの。主にバロック時代に使用された。","english_definition":"A large lute with two necks, the second one holding long bass strings (diapasons) that extend the instrument's lower range; used primarily in the Baroque period.","examples":[{"sentence":"The archlute was a popular instrument in Baroque music.","translation":"アーチリュートはバロック音楽で人気のある楽器でした。"},{"sentence":"He played a beautiful solo on the archlute.","translation":"彼はアーチリュートで美しいソロを演奏しました。"}],"collocations":["play the archlute (アーチリュートを演奏する)","archlute solo (アーチリュートのソロ)","Baroque archlute music (バロック時代のアーチリュート音楽)"],"synonyms":["theorbo","liuto attiorbato"],"antonyms":[],"notes":"The archlute is distinct from the theorbo, although the terms are sometimes used interchangeably.  The archlute typically has a shorter neck extension than the theorbo."}],"etymology":{"value":"\"Arch-\" (イタリア語の \"arci-\", \"主要な、より高い\" の意) + \"lute\" (リュート)。低音域を拡張したリュートであることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrtʃˈluːt/","syllables":"arch-lute"},"inflection":{"noun_plural":"archlutes"},"usage_notes":{"explanation":"The archlute is a plucked string instrument closely related to the lute. It is characterized by its extended neck and additional bass strings, which provide a wider range and richer sound than a standard lute. It was primarily used in the Baroque era for basso continuo and solo performances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an archlute in the museum, it looked like a big guitar.","correct":"✓ I saw an archlute in the museum; it looked like a large lute with an extended neck.","note":"An archlute is more closely related to a lute than a guitar, although both are plucked string instruments. The key distinguishing feature is the extended neck for bass strings."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_instruments":["lute","theorbo","guitar","mandolin"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"archlute\" refers to a specific type of lute, a plucked string instrument popular in the Baroque period. It is characterized by its double neck and extended bass strings, giving it a wider tonal range than a standard lute. Understanding this term requires familiarity with musical instruments and music history. It's not a commonly used word outside of the context of classical music.","priority":"★★☆"},"example_sentences":[{"sentence":"The musician tuned the archlute before the concert.","translation":"音楽家はコンサートの前にアーチリュートを調律した。","type":"noun","meaning_category":"instrument"},{"sentence":"The archlute's deep bass notes provided a rich foundation for the ensemble.","translation":"アーチリュートの深い低音は、アンサンブルに豊かな基盤を提供した。","type":"noun","meaning_category":"instrument"}]}