{"word":"saprogenous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"腐生性の、腐生的な","english_definition":"Living on or obtaining nourishment from decaying organic matter.","examples":[{"sentence":"Saprogenous bacteria play a vital role in decomposition.","translation":"腐生性細菌は分解において重要な役割を果たす。"},{"sentence":"Some fungi are saprogenous, feeding on dead plants and animals.","translation":"一部の菌類は腐生性であり、枯れた植物や動物を栄養源とする。"}],"collocations":["saprogenous bacteria","saprogenous fungi","saprogenous microorganisms"],"synonyms":["saprophytic","decomposer","detritivorous"],"antonyms":["autotrophic","photosynthetic"]}],"etymology":{"value":"Derived from the Greek words 'sapros' (rotten, decaying) and 'genos' (origin, birth, kind).","priority":"★★☆"},"pronunciation":{"ipa":"/sæˈprɒdʒənəs/","syllables":"sa-prog-e-nous"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Saprogenous' describes organisms, especially bacteria and fungi, that obtain their nutrients from dead or decaying organic matter. These organisms are crucial for decomposition and nutrient cycling in ecosystems. It is often used in scientific and ecological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The saprogenous plant was green and thriving.","correct":"✓ The saprogenous fungus was growing on the dead log.","note":"Saprogenous organisms feed on dead matter, so describing a green, thriving plant as saprogenous is incorrect. They are typically fungi or bacteria, not plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["saprophyte (noun): An organism that lives on dead or decaying organic matter.","saprophytic (adjective): Relating to or being a saprophyte.","saprotroph (noun): An organism that feeds on or derives nourishment from decaying organic matter."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Saprogenous' is a technical term primarily used in biology and ecology to describe organisms that obtain nutrients from decaying organic matter. Understanding this term requires knowledge of biological processes such as decomposition and nutrient cycling. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The forest floor was teeming with saprogenous organisms.","translation":"森林の地面は腐生性生物で溢れていた。","type":"general","meaning_category":"General"},{"sentence":"Saprogenous fungi are essential for breaking down leaf litter.","translation":"腐生性菌類は落葉を分解するために不可欠である。","type":"biology","meaning_category":"Biology"},{"sentence":"The study focused on the role of saprogenous bacteria in the soil.","translation":"その研究は、土壌における腐生性細菌の役割に焦点を当てた。","type":"ecology","meaning_category":"Ecology"}]}