{"word":"somatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"肉体の、身体的な","english_definition":"Relating to the body, especially as distinct from the mind or spirit; bodily; physical.","examples":[{"sentence":"The somatous needs of the patient were carefully attended to.","translation":"患者の肉体的なニーズは注意深く満たされた。"},{"sentence":"He focused on the somatous aspects of the disease.","translation":"彼はその病気の身体的な側面に焦点を当てた。"}],"collocations":["somatous sensations","somatous symptoms","somatous care"],"synonyms":["physical","bodily","corporeal","somatic"],"antonyms":["spiritual","mental","psychic"]}],"etymology":{"value":"From the Greek word 'somatikos', pertaining to the body, derived from 'soma' meaning body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsoʊmətəs/","syllables":"so-ma-tous"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more somatous' and 'most somatous' respectively."},"usage_notes":{"explanation":"'Somatous' is a relatively rare and formal term, typically used in medical, philosophical, or academic contexts to emphasize the physical or bodily nature of something, especially in contrast to the mental or spiritual aspects. It is often used to describe needs, sensations, or symptoms that are directly related to the body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The somatous was happy.","correct":"✓ The body was happy.","note":"'Somatous' is an adjective, not a noun. It describes something, it doesn't replace the noun itself."}],"priority":"★★☆"},"related_words":{"derivatives":["soma (noun): the body, especially as distinct from the mind.","somatic (adjective): relating to the body, especially as distinct from the mind."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'somatous' is a formal and technical term used to describe things related to the physical body, particularly when contrasting it with the mind or spirit. It is often found in medical or philosophical contexts and is not commonly used in everyday conversation. Understanding this word requires a good grasp of abstract concepts and specialized vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor examined the patient's somatous condition.","translation":"医者は患者の身体的な状態を診察した。","type":"general","meaning_category":"physical condition"},{"sentence":"The study explored the somatous effects of stress on the human body.","translation":"その研究は、ストレスが人体に与える身体的な影響を調査した。","type":"medical","meaning_category":"medical effects"},{"sentence":"Philosophers often discuss the relationship between the somatous and the spiritual.","translation":"哲学者たちはしばしば肉体と精神の関係について議論する。","type":"philosophical","meaning_category":"philosophical discussion"}]}