{"word":"Abd-el-Krim","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"Abd el-Krim (also known as Abd al-Karim), a Moroccan political and military leader who led a large-scale revolt against French and Spanish rule in the Rif region of Morocco during the 1920s.","english_definition":"A Moroccan political and military leader who led a rebellion against Spanish and French colonization of the Rif.","examples":[{"sentence":"Abd-el-Krim was a key figure in the Moroccan resistance movement.","translation":"Abd-el-Krimは、モロッコの抵抗運動における重要な人物でした。"},{"sentence":"The rebellion led by Abd-el-Krim challenged European colonial powers.","translation":"Abd-el-Krimが率いた反乱は、ヨーロッパの植民地支配国に挑戦しました。"}],"collocations":["Rif War","Moroccan history","colonial resistance"],"synonyms":["Muhammad ibn Abd al-Karim al-Khattabi","Abd al-Karim"],"antonyms":[]}],"etymology":{"value":"The name is derived from Arabic, meaning 'Servant of the Generous One'. 'Abd' means servant, 'el' (al) is the definite article, and 'Krim' refers to 'al-Karim', one of the names of God in Islam, signifying 'The Most Generous'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæb dɛl ˈkriːm/","syllables":"Abd-el-Krim"},"inflection":{},"usage_notes":{"explanation":"Abd-el-Krim is a significant historical figure in Moroccan history and anti-colonial movements. His leadership in the Rif War is widely studied. The name may appear with variations in spelling, including Abd al-Karim, but the reference is generally the same person.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Rif","Rif War","colonialism","Morocco","Spanish Protectorate","French Protectorate"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The name Abd-el-Krim refers to a specific historical figure, making it less common in general conversation but relevant in historical or political contexts. Understanding the historical significance of Abd-el-Krim requires some background knowledge of Moroccan history and the colonial period. The name itself is not difficult to pronounce, but its relevance is context-dependent."},"example_sentences":[{"sentence":"Abd-el-Krim's strategies were studied by revolutionaries worldwide.","translation":"Abd-el-Krimの戦略は、世界中の革命家によって研究されました。","type":"historical context","meaning_category":"Historical Figure"},{"sentence":"The Rif War, led by Abd-el-Krim, was a major challenge to European colonial powers.","translation":"Abd-el-Krimが率いたリフ戦争は、ヨーロッパの植民地支配国にとって大きな挑戦でした。","type":"historical event","meaning_category":"Rif War"}]}