{"word":"Pieridine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A butterfly belonging to the family Pieridae.","english_definition":"A butterfly belonging to the family Pieridae, characterized by their white, yellow, or orange wings, often with black markings.","examples":[{"sentence":"The Pieridine butterflies fluttered among the flowers in the meadow.","translation":"シロチョウ科の蝶が牧草地の花の間を舞っていた。"}],"collocations":["Pieridine butterfly","Pieridine wings","Pieridine species"],"synonyms":["White butterfly","Yellow butterfly","Sulfur butterfly"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Pieridae, which is named after Pieris, a genus within the family. The name Pieris itself comes from Greek mythology, referring to the Pierides, daughters of Pierus.","priority":"N/A"},"pronunciation":{"ipa":"/paɪˈɛrɪdiːn/","syllables":"Pi-er-i-dine"},"inflection":{"noun_plural":"Pieridines"},"usage_notes":{"explanation":"'Pieridine' is a term used to refer to any butterfly belonging to the family Pieridae. These butterflies are commonly known as whites, yellows, or sulfurs due to their wing coloration. The term is more commonly used in scientific or entomological contexts.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Pieridae (family name)","Pieris (genus name)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Pieridine' is a scientific term referring to butterflies in the family Pieridae. It's not commonly used in everyday language but is found in entomological or biological contexts. Understanding the term requires familiarity with biological classification.","priority":"N/A"},"example_sentences":[{"sentence":"The field guide identified the butterfly as a Pieridine based on its wing patterns.","translation":"そのフィールドガイドは、その蝶の羽の模様からシロチョウ科であると同定した。","type":"noun","meaning_category":"Butterfly family"},{"sentence":"Many agricultural pests are Pieridines, whose larvae feed on crop plants.","translation":"多くの農業害虫はシロチョウ科であり、その幼虫は作物を食い荒らす。","type":"noun","meaning_category":"Butterfly family"}]}