{"word":"Hidage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) アングロサクソン時代のイングランドにおける土地税の評価単位","english_definition":"(historical) A system of land assessment used in Anglo-Saxon England, primarily for taxation purposes.","examples":[{"sentence":"The Domesday Book provides valuable information about the hidage of various manors.","translation":"ドゥームズデイ・ブックは、様々な荘園のハイデージに関する貴重な情報を提供している。"},{"sentence":"The assessment of hidage was often based on the potential yield of the land.","translation":"ハイデージの評価は、土地の潜在的な収穫量に基づいて行われることが多かった。"}],"collocations":["assess hidage","Domesday hidage","calculate hidage"],"synonyms":["land assessment","land tax","taxation unit"],"antonyms":[]}],"etymology":{"value":"Old English 'hīd' (hide of land) + '-age' (suffix denoting a system or collection).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɪdɪdʒ/","syllables":"hi-dage"},"inflection":{"noun_plural":"hidages"},"usage_notes":{"explanation":"'Hidage' refers specifically to the system used in Anglo-Saxon England. It is a historical term and not used in modern contexts. The 'hide' was a unit of land, notionally enough to support one household.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hidage of the property is still used today for tax purposes.","correct":"✓ The modern equivalent of property tax is used today.","note":"Hidage is a historical system and no longer in use."}],"priority":"★☆☆"},"related_words":{"derivatives":["hide (unit of land)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史学の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hidage' is a specialized historical term referring to a land assessment system in Anglo-Saxon England. Understanding requires familiarity with English history and taxation systems of that period. It is unlikely to be encountered outside of academic or historical contexts."},"example_sentences":[{"sentence":"The king used the hidage system to raise funds for defense.","translation":"王はハイデージ制度を利用して防衛のための資金を調達した。","type":"noun","meaning_category":"land assessment"},{"sentence":"Variations in hidage assessments reflected the differing wealth of regions.","translation":"ハイデージ評価の変動は、地域の異なる富を反映していた。","type":"noun","meaning_category":"land assessment"}]}