{"word":"Tripoline","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"トリポリ（リビアの首都、またはレバノンの都市）の、トリポリ出身の、トリポリに関する","english_definition":"Of or relating to Tripoli (the capital of Libya, or the city in Lebanon); a native or inhabitant of Tripoli.","examples":[{"sentence":"Tripoline cuisine is influenced by Mediterranean flavors.","translation":"トリポリの料理は地中海の影響を受けている。"},{"sentence":"He is a Tripoline citizen.","translation":"彼はトリポリの市民です。"}],"collocations":["Tripoline cuisine","Tripoline citizen","Tripoline dialect"],"synonyms":["Libyan","Lebanese"],"antonyms":[]}],"etymology":{"value":"From Tripoli + -ine","priority":"N/A"},"pronunciation":{"ipa":"/trɪˈpɒlɪn/","syllables":"Tri-po-line"},"inflection":{"notes":"Adjective, no specific inflectional forms beyond comparative/superlative (more Tripoline, most Tripoline)."},"usage_notes":{"explanation":"This term is relatively specific and refers to things, people, or concepts associated with either of the cities named Tripoli. Context is usually required to determine which Tripoli is being referenced.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The Tripoline are known for their pyramids.","correct":"✓ The Libyans are known for their pyramids.","note":"If referring to Libya's Tripoli, avoid generalizing about all Libyans using 'Tripoline' as it only refers to the city's inhabitants."}],"priority":"N/A"},"related_words":{"derivatives":["Tripoli"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'Tripoline' is a relatively uncommon adjective used to describe something or someone from either of the cities named Tripoli (one in Libya, one in Lebanon). Its usage is specific and requires understanding of geography and cultural context. It's more likely to be encountered in specialized texts or conversations about these regions."},"example_sentences":[{"sentence":"The museum featured a collection of Tripoline artifacts.","translation":"その博物館にはトリポリの工芸品のコレクションが展示されていた。","type":"adjective","meaning_category":"Relating to Tripoli"},{"sentence":"She described her experiences growing up in a Tripoline neighborhood.","translation":"彼女はトリポリの近所で育った経験について語った。","type":"adjective","meaning_category":"From Tripoli"}]}