{"word":"bugweed","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Any of several plants, especially of the genus Solanum, that are considered weeds and may attract or harbor bugs.","english_definition":"Any of several plants, especially of the genus Solanum, that are considered weeds and may attract or harbor bugs.","examples":[{"sentence":"The garden was overrun with bugweed, making it difficult to grow anything else.","translation":"庭はbugweedに覆われており、他のものを育てることが困難でした。"},{"sentence":"Farmers often struggle to control bugweed in their fields.","translation":"農家は畑のbugweedの防除に苦労することがよくあります。"}],"collocations":["control bugweed","remove bugweed","bugweed infestation"],"synonyms":["nightshade","weed"],"antonyms":[]}],"etymology":{"value":"The term 'bugweed' likely originates from the plant's tendency to attract bugs or insects, combined with the general term 'weed' to denote its unwanted presence in gardens or agricultural lands.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌɡwiːd/","syllables":"bug-weed"},"inflection":{"noun_plural":"bugweeds"},"usage_notes":{"explanation":"'Bugweed' is a common name applied to various weedy plants, especially those in the Solanum genus (which includes nightshades). These plants are often considered undesirable in gardens and fields because they can compete with crops or ornamental plants for resources, and they may also serve as hosts for pests.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted bugweed in my garden.","correct":"✓ I removed bugweed from my garden.","note":"Since bugweed is considered a weed, it's generally something you remove rather than plant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very uncommon)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bugweed' refers to various weedy plants, particularly those that attract insects or are considered pests in gardens or fields. It is not a commonly used term, so understanding requires some familiarity with botanical terminology and agricultural contexts. The word implies a negative connotation due to its association with unwanted plants and pests."},"example_sentences":[{"sentence":"The farmer spent hours trying to eradicate the bugweed from his soybean field.","translation":"農家はダイズ畑からbugweedを根絶するために何時間も費やしました。","type":"noun","meaning_category":"weed"},{"sentence":"This particular type of bugweed is known for its rapid growth and ability to spread quickly.","translation":"この特定の種類のbugweedは、急速な成長と急速に広がる能力で知られています。","type":"noun","meaning_category":"weed"}]}