{"word":"Heterotelism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学)他者目標主義：本来の目標とは異なる目標を達成しようとする動機。ある行為の真の目的が、表面的な目的とは異なり、他者の利益や影響を及ぼすことにある状態。","english_definition":"(Psychology) The motivation to achieve a goal that is different from the original goal; a state in which the true purpose of an action differs from its superficial purpose, often involving the benefit or influence of others.","examples":[{"sentence":"His apparent altruism might be explained by heterotelism; he seemed to be helping others, but his real goal was to gain social approval.","translation":"彼の表面的な利他主義は、他者目標主義によって説明できるかもしれない。彼は他人を助けているように見えたが、本当の目標は社会的な承認を得ることだった。"},{"sentence":"The company's stated mission was to improve the environment, but some suspected heterotelism, believing their true aim was to enhance their public image.","translation":"その会社の公表された使命は環境を改善することだったが、彼らの真の目的は世間のイメージを高めることだと信じ、他者目標主義を疑う者もいた。"}],"collocations":["altruistic behavior and heterotelism (利他的行動と他者目標主義)","heterotelism in organizational behavior (組織行動における他者目標主義)","suspect heterotelism (他者目標主義を疑う)","uncover heterotelism (他者目標主義を暴く)"],"synonyms":["ulterior motive","hidden agenda","indirect motivation","instrumental goal","secondary goal"],"antonyms":["autotelism","intrinsic motivation","pure altruism","selflessness","genuine altruism"]}],"etymology":{"value":"ギリシャ語の 'heteros' (異なる) + 'telos' (目標、目的) + '-ism' (主義)。文字通りには「異なる目標の主義」を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtəˈtɛlɪzəm/","syllables":"het-er-o-tel-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Heterotelismは、心理学や行動科学の分野で使用される専門用語であり、日常会話ではまれです。この概念は、特に組織行動、政治学、倫理学などの分野で、行動の背後にある隠れた動機や意図を分析する際に重要となります。例えば、企業がCSR活動を行う際に、本当に社会貢献を目的としているのか、それとも企業イメージの向上を目的としているのかを判断する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was acting with autotelism, trying to impress everyone.","correct":"✓ He was acting with heterotelism, trying to impress everyone.","note":"Autotelismは自己目的的な行動を指し、Heterotelismは他者の影響や評価を目的とした行動を指します。文脈に応じて使い分けましょう。"},{"incorrect":"✗ The project failed due to a lack of heterotelism.","correct":"✓ The project failed due to a lack of intrinsic motivation.","note":"プロジェクトの失敗は、内発的動機（intrinsic motivation）の欠如が原因であることが多く、他者目標主義（heterotelism）の欠如が直接的な原因となることは少ないです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["heterotelic (形容詞：他者目標的な)"],"related_concepts":["instrumentalism","strategic altruism","impression management","self-presentation","ulterior motive"]},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Heterotelism**」は、心理学や行動科学で使われる専門的な言葉で、ある行動の本当の目的が、表面的な目的とは違っていて、他人に影響を与えたり、他人の役に立ったりすることにある状態を指します。例えば、会社が環境保護活動をしているように見えても、実は会社のイメージアップが目的だったりする場合に使われます。日常会話ではほとんど使われませんが、人の行動の裏にある本当の理由を考えるときに役立つ概念です。"},"example_sentences":[{"sentence":"The politician's support for the bill was seen as heterotelism, designed to win votes rather than genuinely improve the community.","translation":"その政治家の法案への支持は、地域社会を本当に改善するよりも、むしろ票を獲得するための他者目標主義と見なされた。","type":"noun","meaning_category":"他者目標主義"},{"sentence":"Researchers studied the heterotelism behind charitable donations, finding that donors often sought social recognition.","translation":"研究者たちは慈善寄付の背後にある他者目標主義を研究し、寄付者はしばしば社会的な認知を求めていることを発見した。","type":"noun","meaning_category":"他者目標主義"},{"sentence":"The CEO's commitment to diversity was questioned as a form of heterotelism, aimed at improving the company's reputation.","translation":"CEOの多様性へのコミットメントは、企業の評判を向上させることを目的とした他者目標主義の一形態として疑問視された。","type":"noun","meaning_category":"他者目標主義"}]}