{"word":"radiation-permeable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"放射線透過性の、放射線を通しやすい","english_definition":"allowing radiation to pass through; radiolucent.","examples":[{"sentence":"The container is made of a radiation-permeable material to allow for sterilization.","translation":"その容器は、滅菌処理を可能にするために放射線透過性の材料で作られています。"},{"sentence":"The window is radiation-permeable, allowing the device to function properly.","translation":"その窓は放射線透過性であり、デバイスが適切に機能することを可能にします。"},{"sentence":"For this experiment, we need a radiation-permeable shield.","translation":"この実験では、放射線透過性のシールドが必要です。"}],"collocations":["radiation-permeable material (放射線透過性材料)","radiation-permeable window (放射線透過性窓)","radiation-permeable shield (放射線透過性シールド)"],"synonyms":["radiolucent","radiation-transparent"],"antonyms":["radiation-opaque","radiation-resistant"],"related_terms":["radiation","permeable","radiolucency","radiation shielding"]}],"etymology":{"value":"The word is formed by combining 'radiation' (energy or particles emitted from a source), 'permeable' (allowing liquids or gases to pass through), and a hyphen.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌreɪdiˈeɪʃən ˈpɜːrmiəbəl/","syllables":"ra-di-a-tion-per-me-a-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Radiation-permeable' describes materials or objects that do not significantly block or absorb radiation, allowing it to pass through. This property is important in various applications, such as medical imaging, sterilization, and scientific research, where it is necessary to allow radiation to reach a target or detector. The term is often used in technical or scientific contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is radiation permeable.","correct":"✓ The material is radiation-permeable.","note":"The hyphen is important to correctly link the words and form a compound adjective."}],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'radiation-permeable' is a technical term used to describe materials that allow radiation to pass through them. It is commonly used in scientific, medical, and engineering contexts. Understanding this term requires a basic knowledge of radiation and material properties."},"example_sentences":[{"sentence":"The X-ray machine requires a radiation-permeable table for imaging.","translation":"X線装置は、イメージングのために放射線透過性のテーブルを必要とします。","type":"general","meaning_category":"descriptive"},{"sentence":"The packaging material is designed to be radiation-permeable for sterilization purposes.","translation":"その包装材料は、滅菌目的のために放射線透過性になるように設計されています。","type":"technical","meaning_category":"application"},{"sentence":"Researchers are testing different radiation-permeable polymers for use in medical devices.","translation":"研究者たちは、医療機器での使用のためにさまざまな放射線透過性ポリマーをテストしています。","type":"scientific","meaning_category":"research"}]}