{"word":"rod-pointing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(オーストラリア先住民の文化における)呪術の一種で、特定の人物に呪いをかけるために、儀式用の棒をその人物に向けること。","english_definition":"A form of sorcery practiced by some Australian Aboriginal peoples, involving the pointing of a ritual object (usually a bone or wooden rod) at a person to inflict harm or death.","examples":[{"sentence":"Rod-pointing is a serious matter in Aboriginal culture, and is believed to cause illness or death.","translation":"棒を向ける呪術はアボリジニ文化において重大な問題であり、病気や死を引き起こすと信じられている。"},{"sentence":"The anthropologist studied the practice of rod-pointing among the indigenous community.","translation":"人類学者は、先住民族コミュニティにおける棒を向ける呪術の慣習を研究した。"}],"collocations":["bone-pointing (骨を向ける呪術 - 類似の慣習)","ritual killing (儀式殺人 - 結果として起こりうる)","sorcery (妖術)","magic (魔法)","curse (呪い)"],"synonyms":["bone-pointing","sorcery","magic","hex","curse"],"antonyms":[]}],"etymology":{"value":"「rod」(棒)と「pointing」(向けること)の組み合わせ。アボリジニの文化における特定の呪術行為を指すために作られた言葉。","priority":"★★★"},"pronunciation":{"ipa":"/ˈrɒdˌpɔɪntɪŋ/","syllables":"rod-point-ing"},"inflection":{"noun_plural":"rod-pointings (複数形はあまり一般的ではない)"},"usage_notes":{"explanation":"「**rod-pointing**」は、オーストラリア先住民の文化に特有の呪術行為を指す専門用語です。一般的には、部外者が日常会話で使用する言葉ではありません。学術的な文脈や、アボリジニ文化について議論する際に用いられます。類似の行為として「bone-pointing」(骨を向ける呪術)があります。この慣習は、対象者に心理的な影響を与え、実際に体調を崩したり、死に至らしめると信じられています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was accused of rod-pointing the politician with a stick.","correct":"✓ He was accused of performing rod-pointing on the politician.","note":"「rod-pointing」は棒を使って何かをする行為ではなく、呪術の儀式そのものを指します。棒を使うことはその儀式の一部ですが、儀式全体を指す言葉として「rod-pointing」を使用します。"},{"incorrect":"✗ Rod-pointing is a common practice in all cultures.","correct":"✓ Rod-pointing is a practice specific to some Australian Aboriginal cultures.","note":"Rod-pointingは、すべて文化に共通するものではなく、オーストラリア先住民の文化に特有のものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["point (動詞: 向ける、指す；名詞: 点)","rod (名詞: 棒)"],"phrasal_verbs":[],"related_concepts":["dreaming (ドリーミング - アボリジニの創世神話)","taboo (タブー - 禁止事項)","shamanism (シャーマニズム - 呪術的宗教)","cultural sensitivity (文化的な配慮)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - アボリジニ文化の研究や議論でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**rod-pointing**」は、オーストラリア先住民の文化における特定の呪術行為を指す非常に特殊な用語です。この言葉は、アボリジニ文化、人類学、社会学などの分野で専門的な知識を持つ人々によって使用されることがほとんどです。一般の英語話者には馴染みが薄く、理解するためにはアボリジニの信仰体系や社会構造に関する背景知識が必要です。この言葉の使用は、文化的な配慮をもって慎重に行われるべきです。"},"example_sentences":[{"sentence":"The elders of the tribe still practice rod-pointing in certain circumstances.","translation":"部族の長老たちは、特定の状況下で今でも棒を向ける呪術を行っている。","type":"noun","meaning_category":"呪術"},{"sentence":"Scholars debate the psychological effects of rod-pointing on its victims.","translation":"学者たちは、棒を向ける呪術が被害者に与える心理的影響について議論している。","type":"noun","meaning_category":"呪術"},{"sentence":"The film depicted a scene of rod-pointing, sparking controversy over its cultural accuracy.","translation":"その映画は棒を向ける呪術のシーンを描写し、文化的な正確性をめぐって論争を引き起こした。","type":"noun","meaning_category":"呪術"}]}