{"word":"unidealization","priority":"low","meanings":[{"part_of_speech":"noun","definition":"The act or process of removing ideal qualities or characteristics from something; the state of being unidealized.","english_definition":"The process of removing ideal or idealized qualities or characteristics from something; the state of being unidealized.","examples":[{"sentence":"The unidealization of historical figures allows for a more realistic understanding of their actions and motivations.","translation":"歴史上の人物から理想化された側面を取り除くことで、彼らの行動や動機をより現実的に理解することができる。"},{"sentence":"The artist's work is a deliberate unidealization of the human form, portraying subjects with flaws and imperfections.","translation":"その芸術家の作品は、人間の姿を意図的に理想化せず、欠点や不完全さを持つ被写体を描いている。"},{"sentence":"The unidealization of the workplace can lead to more realistic expectations and less disappointment.","translation":"職場を理想化しないことで、より現実的な期待を持ち、失望を減らすことができる。"}],"collocations":["process of unidealization","deliberate unidealization","unidealization of historical figures","unidealization of the workplace"],"synonyms":["de-idealization","realization","demystification","debunking","disillusionment"],"antonyms":["idealization","romanticization","glorification"]},{"part_of_speech":"noun","definition":"A representation or portrayal that lacks ideal qualities; a realistic or unflattering depiction.","english_definition":"A representation or portrayal that lacks ideal qualities; a realistic or unflattering depiction.","examples":[{"sentence":"The painting is an unidealization of the subject, showing wrinkles and blemishes.","translation":"その絵は被写体を理想化しておらず、しわやしみを描いている。"},{"sentence":"The movie offers an unidealization of war, depicting its brutality and suffering.","translation":"その映画は戦争を理想化せず、その残虐性と苦しみを描いている。"},{"sentence":"The biography presents an unidealization of the celebrity, revealing their flaws and struggles.","translation":"その伝記は有名人を理想化せず、彼らの欠点や苦闘を明らかにしている。"}],"collocations":["realistic unidealization","unflattering unidealization","unidealization of war","unidealization of a celebrity"],"synonyms":["realistic portrayal","unflattering depiction","warts-and-all representation"],"antonyms":["idealized representation","romanticized portrayal","glorified depiction"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to 'idealization'. 'Idealization' comes from 'idealize,' which is formed from 'ideal' + '-ize' (a suffix indicating a process or action).","priority":"low"},"pronunciation":{"ipa":"/ˌʌnˌaɪdiːəlaɪˈzeɪʃən/","syllables":"un-i-de-al-i-za-tion"},"inflection":{"noun_plural":"unidealizations"},"usage_notes":{"explanation":"'Unidealization' refers to the process of removing idealized or unrealistic qualities from something, or a representation that lacks such qualities. It often involves portraying something or someone in a more realistic, and sometimes less flattering, light. It is the opposite of 'idealization,' which is the process of presenting something or someone as perfect or ideal.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The unidealization made the hero less likeable.","correct":"The de-idealization made the hero less likeable.","note":"'De-idealization' is a more common and widely understood term than 'unidealization'."}],"priority":"low"},"related_words":{"derivatives":["unidealized (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C2","text":"'Unidealization' is a relatively uncommon and complex term. It is most often used in academic or critical contexts to describe the process of removing idealized qualities from a subject, often to present a more realistic or critical perspective. Understanding this word requires a strong vocabulary and familiarity with abstract concepts."},"example_sentences":[{"sentence":"The author's unidealization of motherhood challenged traditional portrayals.","translation":"その作家による母性の非理想化は、伝統的な描写に異議を唱えた。","type":"noun","meaning_category":"process of removing ideal qualities"},{"sentence":"The documentary offered an unidealization of the tech industry, exposing its ethical challenges.","translation":"そのドキュメンタリーは、技術産業を理想化せず、その倫理的な課題を暴露した。","type":"noun","meaning_category":"realistic portrayal"}]}