{"word":"meliorism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"改良主義、世界は努力によって改善できるという信念","english_definition":"the belief that the world tends to improve and that humans can assist its betterment.","examples":[{"sentence":"Meliorism is an optimistic philosophy that emphasizes the potential for progress.","translation":"改良主義は、進歩の可能性を強調する楽観的な哲学です。"},{"sentence":"Through education and social reform, meliorists believe we can create a better future.","translation":"教育と社会改革を通じて、改良主義者はより良い未来を創造できると信じています。"},{"sentence":"His meliorism inspired him to dedicate his life to social work.","translation":"彼の改良主義は、彼に生涯を社会福祉に捧げるよう促しました。"}],"collocations":["social meliorism (社会改良主義)","philosophical meliorism (哲学的改良主義)","melioristic approach (改良主義的アプローチ)"],"synonyms":["progressivism","optimism","humanism"],"antonyms":["pessimism","fatalism","nihilism"]}],"etymology":{"value":"Derived from the Latin word 'melior' meaning 'better'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmiːliərɪzəm/","syllables":"me-li-o-rism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Meliorism is a philosophical doctrine holding that progress is neither inevitable (as in optimism) nor impossible (as in pessimism), but rather that it requires human effort. It suggests that the world can be made better through human action and intervention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a meliorist person.","correct":"✓ He is a meliorist.","note":"'Meliorist' can be used as a noun referring to a person who believes in meliorism."},{"incorrect":"✗ Meliorism is about believing everything will be good without effort.","correct":"✓ Meliorism is about believing the world can be made better through effort.","note":"Meliorism emphasizes the importance of effort in improving the world, unlike naive optimism."}],"priority":"★★☆"},"related_words":{"derivatives":["meliorist (noun: 改良主義者)","melioristic (adjective: 改良主義的な)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meliorism' is a relatively uncommon philosophical term. It refers to the belief that the world can be improved through human effort. It's distinct from optimism (which assumes the world will improve regardless) and pessimism (which assumes the world will not improve). Understanding this term requires a grasp of philosophical concepts and vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician's speech reflected a strong sense of meliorism, promising a brighter future through hard work.","translation":"その政治家の演説は、努力によってより明るい未来を約束する、強い改良主義の感覚を反映していました。","type":"noun","meaning_category":"belief"},{"sentence":"She adopted a melioristic approach to urban planning, focusing on sustainable development and community engagement.","translation":"彼女は都市計画に改良主義的なアプローチを採用し、持続可能な開発と地域社会の関与に焦点を当てました。","type":"adjective (melioristic)","meaning_category":"approach"},{"sentence":"As a meliorist, he dedicated his career to advocating for social justice and equality.","translation":"改良主義者として、彼は社会正義と平等を提唱することにキャリアを捧げました。","type":"noun (meliorist)","meaning_category":"person"}]}