{"word":"recessione","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"景気後退、不況","english_definition":"a period of temporary economic decline during which trade and industrial activity are reduced, generally identified by a fall in GDP in two successive quarters.","examples":[{"sentence":"L'economia italiana è in recessione.","translation":"イタリア経済は不況に陥っている。"},{"sentence":"La recessione ha causato un aumento della disoccupazione.","translation":"不況は失業率の増加を引き起こした。"},{"sentence":"Il governo sta cercando di combattere la recessione con misure economiche.","translation":"政府は経済対策によって不況を克服しようとしている。"}],"collocations":["crisi di recessione (不況の危機)","entrare in recessione (不況に入る)","uscire dalla recessione (不況から脱する)","recessione economica (経済不況)","recessione globale (世界的な不況)"],"synonyms":["crisi economica","stagnazione","contrazione economica"],"antonyms":["espansione","crescita economica","ripresa economica"]}],"etymology":{"value":"Dal latino 'recessio', derivato da 'recedere' (ritirarsi, allontanarsi). Originariamente indicava un ritiro o un allontanamento fisico, poi esteso al significato di un declino o una contrazione, in particolare in ambito economico.","priority":"★★☆"},"pronunciation":{"ipa":"/ret͡ʃesˈsjoːne/","syllables":"re-ces-sio-ne"},"inflection":{"noun_plural":"recessioni"},"usage_notes":{"explanation":"'Recessione' indica una fase di declino economico. Si distingue dalla 'depressione' che è una recessione prolungata e grave. In italiano, come in inglese, si usa per descrivere un periodo in cui l'attività economica si riduce, portando a cali di produzione, aumento della disoccupazione e diminuzione degli investimenti.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"La recessione è una cosa buona per l'economia.","correct":"La recessione è una cosa negativa per l'economia.","note":"La recessione è un fenomeno economico negativo, non positivo."},{"incorrect":"La recessione è la stessa cosa della depressione.","correct":"La recessione è meno grave della depressione.","note":"La recessione è una fase di declino economico meno grave della depressione."}],"priority":"★★☆"},"related_words":{"derivatives":["recessivo (aggettivo: recessivo)"],"phrasal_verbs":[],"related_terms":["PIL (prodotto interno lordo)","inflazione","deflazione","disoccupazione","crisi economica"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderatamente frequente.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recessione' è un termine economico che indica un periodo di declino temporaneo dell'attività economica. È caratterizzata da una diminuzione del PIL (Prodotto Interno Lordo) per almeno due trimestri consecutivi, aumento della disoccupazione e riduzione degli investimenti. È un termine utilizzato nel linguaggio economico e giornalistico per descrivere una fase negativa del ciclo economico.","example_sentences":[{"sentence":"La pandemia ha causato una grave recessione a livello globale.","translation":"パンデミックは世界的に深刻な不況を引き起こした。","type":"general","meaning_category":"economic decline"},{"sentence":"Il governo sta implementando politiche per stimolare la ripresa dalla recessione.","translation":"政府は不況からの回復を促進するための政策を実施している。","type":"general","meaning_category":"economic decline"},{"sentence":"Molti esperti prevedono una recessione nel prossimo futuro.","translation":"多くの専門家は近い将来に不況が起こると予測している。","type":"general","meaning_category":"economic decline"}]}}