{"word":"tonners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of 'tonner'. A 'tonner' can refer to several things depending on the context: a person or thing weighing a ton, a type of sailboat, or (less commonly) a container holding a ton of something.","english_definition":"Plural of 'tonner'. This term can have different meanings depending on the context.","examples":[{"sentence":"The trucks were loaded with several tonners of gravel.","translation":"トラックには数トンの砂利が積まれていた。"},{"sentence":"The regatta featured a fleet of sleek tonners.","translation":"そのレガッタでは、洗練されたトン級ヨットの艦隊が注目を集めた。"}],"collocations":["several tonners","fleet of tonners"],"synonyms":["ton-weight","ton-class sailboat"],"antonyms":[]}],"etymology":{"value":"Derived from 'ton', referring to a unit of weight, with the suffix '-er' indicating a person or thing associated with that weight.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtʌnərz/","syllables":"ton-ners"},"inflection":{"noun_plural":"tonners"},"usage_notes":{"explanation":"The meaning of 'tonners' is highly context-dependent. It's crucial to understand the surrounding information to determine whether it refers to weight, boats, or something else.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["ton","tonnage"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'tonners' is a plural noun with multiple potential meanings depending on the context. It can refer to objects weighing a ton, a class of sailboats, or containers holding a ton of material. Understanding the context is essential to correctly interpret its meaning."},"example_sentences":[{"sentence":"The construction site used multiple tonners of cement each week.","translation":"その建設現場では、毎週数トンのセメントが使用されていた。","type":"noun","meaning_category":"weight"},{"sentence":"The classic tonners raced along the coast.","translation":"その古典的なトン級ヨットは海岸沿いをレースした。","type":"noun","meaning_category":"sailboat"}]}