{"word":"Ionones","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イオノン類：スミレの香りのする有機化合物群。香水や食品香料として使用される。","english_definition":"A group of closely related fragrant chemical compounds that are components of a number of essential oils, notably rose oil. Ionones are used in perfumery and flavorings.","examples":[{"sentence":"Ionones are important ingredients in many perfumes.","translation":"イオノン類は多くの香水において重要な成分です。"},{"sentence":"The aroma of ionones is reminiscent of violets.","translation":"イオノン類の香りはスミレを連想させます。"}],"collocations":["alpha-ionone","beta-ionone","gamma-ionone","used in perfumes","used in flavorings","synthetic ionones"],"synonyms":["violet ketone","methylionone"],"antonyms":[]}],"etymology":{"value":"Derived from 'ionone,' which is a blend of 'ion' (from violet, referring to its violet-like scent) and '-one' (a suffix indicating a ketone).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪ.əˌnoʊnz/","syllables":"I-o-nones"},"inflection":{"noun_plural":"Ionones"},"usage_notes":{"explanation":"'Ionones' refers to a class of chemical compounds, rather than a single substance. They are valued for their pleasant floral scent, similar to violets, and are widely used in the fragrance and flavor industries. Alpha-, beta-, and gamma-ionone are common variants.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I smell ionone in this perfume, it's very strong.","correct":"✓ I smell ionones in this perfume, they're very strong.","note":"Since perfumes typically contain a mixture of ionones, it's more accurate to use the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["ionone","isomers of ionone","alpha-ionone","beta-ionone","gamma-ionone"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ionones' are a group of chemical compounds used in perfumes and flavorings that have a scent similar to violets. The term is technical and most likely to be encountered in chemistry or perfumery contexts. It's important to note that 'ionones' is plural, referring to the group of compounds, while 'ionone' is singular, referring to a specific compound in the group."},"example_sentences":[{"sentence":"The subtle floral notes in the fragrance are due to the presence of ionones.","translation":"その香水の繊細なフローラルノートは、イオノン類の存在によるものです。","type":"noun","meaning_category":"chemical compounds"},{"sentence":"Different isomers of ionones contribute to the complexity of the scent.","translation":"イオノン類の異なる異性体が、香りの複雑さに貢献しています。","type":"noun","meaning_category":"chemical compounds"},{"sentence":"Synthetic ionones are often used as a cost-effective alternative to natural extracts.","translation":"合成イオノン類は、天然抽出物の費用対効果の高い代替品としてよく使用されます。","type":"noun","meaning_category":"chemical compounds"}]}