{"word":"degeneracy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"退化、堕落、衰退","english_definition":"the state or process of declining or being degenerate; moral corruption.","examples":[{"sentence":"The degeneracy of the Roman Empire is a well-studied historical phenomenon.","translation":"ローマ帝国の退廃はよく研究された歴史的現象である。"},{"sentence":"Some people believe that modern society is in a state of moral degeneracy.","translation":"現代社会は道徳的退廃の状態にあると信じる人もいる。"},{"sentence":"The degeneracy of his artistic style was evident in his later works.","translation":"彼の芸術スタイルの退化は、彼の後期の作品に明らかだった。"}],"collocations":["moral degeneracy (道徳的退廃)","cultural degeneracy (文化的退廃)","social degeneracy (社会的退廃)","intellectual degeneracy (知的退廃)"],"synonyms":["decline","deterioration","decay","corruption","degradation","depravity","immorality","vice"],"antonyms":["improvement","progress","advancement","morality","virtue"]},{"part_of_speech":"noun","definition":"(物理学)縮退","english_definition":"(in physics) the condition in which different quantum states have the same energy.","examples":[{"sentence":"The degeneracy of the energy levels is lifted by the application of a magnetic field.","translation":"エネルギー準位の縮退は、磁場を印加することによって解消される。"},{"sentence":"Degeneracy is a common phenomenon in atomic physics.","translation":"縮退は原子物理学における一般的な現象である。"},{"sentence":"The high degeneracy of the electron gas leads to interesting quantum effects.","translation":"電子ガスの高い縮退は、興味深い量子効果につながる。"}],"collocations":["energy degeneracy (エネルギー縮退)","level degeneracy (準位縮退)","spin degeneracy (スピン縮退)","remove degeneracy (縮退を解消する)","lift degeneracy (縮退を解消する)"],"synonyms":["equivalence","indistinguishability"],"antonyms":["non-degeneracy","distinctness"]}],"etymology":{"value":"Late Middle English: from late Latin degeneratio(n-), from degenerare ‘degenerate’","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈdʒɛnərəsi/","syllables":"de-gen-er-a-cy"},"inflection":{"noun_plural":"degeneracies"},"usage_notes":{"explanation":"The word \"degeneracy\" has two main meanings. In a general sense, it refers to a decline in quality or moral standards. In physics, it has a specific technical meaning related to quantum states having the same energy. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The degeneracy of the old building made it unsafe.","correct":"The dilapidated state of the old building made it unsafe.","note":"While 'degeneracy' can be used to describe the decline of a building, 'dilapidated state' or 'deterioration' is more common and natural in this context."},{"incorrect":"The degeneracy of the atom was measured.","correct":"The energy level degeneracy of the atom was measured.","note":"In physics, it's important to specify what kind of degeneracy is being discussed, such as 'energy level degeneracy' or 'spin degeneracy'."}],"priority":"★★☆"},"related_words":{"derivatives":["degenerate (verb, adjective, noun)","degeneration (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"degeneracy\" has two primary meanings, one general and one technical. The general meaning refers to a decline in quality, morals, or standards. The technical meaning, used in physics, refers to a situation where different quantum states have the same energy level. Understanding the context is crucial to interpreting the intended meaning. The word is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The **degeneracy** of the city's infrastructure was a major concern.","translation":"都市のインフラの退化は大きな懸念事項だった。","type":"noun","meaning_category":"decline"},{"sentence":"The **degeneracy** of the political system led to widespread corruption.","translation":"政治システムの堕落は広範囲な腐敗につながった。","type":"noun","meaning_category":"corruption"},{"sentence":"The **degeneracy** of the energy levels in the atom was lifted by applying a magnetic field.","translation":"原子内のエネルギー準位の縮退は、磁場を印加することによって解消された。","type":"noun","meaning_category":"physics"}]}