{"word":"Chautauqua","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国ニューヨーク州西部の)ショートークア、ショートークア運動","english_definition":"A town in western New York State, on Lake Chautauqua; a summer resort and educational center. Also, a popular educational movement originating there in the late 19th and early 20th centuries, featuring lectures, concerts, and other cultural events.","examples":[{"sentence":"We spent a week at Chautauqua, attending lectures and concerts.","translation":"私たちはショートークアで一週間過ごし、講義やコンサートに参加しました。"},{"sentence":"The Chautauqua movement brought education and culture to rural communities.","translation":"ショートークア運動は、地方のコミュニティに教育と文化をもたらしました。"}],"collocations":["Chautauqua Institution","Chautauqua Lake","Chautauqua movement","attend a Chautauqua","Chautauqua program"],"synonyms":["lecture series","cultural event","educational retreat"],"antonyms":[]}],"etymology":{"value":"Derived from the Seneca Native American word for \"bag tied in the middle,\" referring to the shape of Chautauqua Lake.","priority":"★★☆"},"pronunciation":{"ipa":"/ʃəˈtɔːkwə/","syllables":"Shuh-taw-kwuh"},"inflection":{"noun_plural":"Chautauquas"},"usage_notes":{"explanation":"'Chautauqua' refers both to a specific place (a town and lake in New York) and to a historical movement focused on adult education and cultural enrichment. The movement was particularly popular in the late 19th and early 20th centuries in the United States. It is often associated with summer programs and traveling lecturers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Chautauqua for the rock concert.","correct":"✓ I'm going to Chautauqua for the summer program.","note":"While Chautauqua does host events, it's more known for educational and cultural programs than rock concerts. It is more appropriate to associate it with lectures, classical music, or theater."},{"incorrect":"✗ Chautauqua is a type of university.","correct":"✓ Chautauqua is an educational movement and a place for summer programs.","note":"Chautauqua is not a university in the traditional sense, but rather a center for lifelong learning and cultural activities."}],"priority":"★★☆"},"related_words":{"derivatives":["Chautauquan (noun: a person associated with Chautauqua)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (proper noun, historical/cultural reference)","frequency_google_ngram":"Low frequency (historical/cultural context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chautauqua' is a proper noun referring to a specific place and a historical movement in the United States. Understanding its meaning requires knowledge of American cultural history. It is not a commonly used word in general conversation, but may appear in historical or cultural contexts.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The **Chautauqua** movement aimed to bring education to rural communities.","translation":"ショートークア運動は、地方のコミュニティに教育をもたらすことを目的としていました。","type":"noun","meaning_category":"educational movement"},{"sentence":"We vacationed at **Chautauqua** Lake last summer.","translation":"私たちは昨年の夏、ショートークア湖で休暇を過ごしました。","type":"noun","meaning_category":"place (lake)"},{"sentence":"She is a **Chautauquan** who has been involved with the institution for many years.","translation":"彼女はショートークア人で、長年その施設に関わっています。","type":"noun","meaning_category":"person associated with Chautauqua"}]}