{"word":"telegrams","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 電報","english_definition":"plural of telegram: messages sent by electrical telegraph and then delivered in written or printed form.","examples":[{"sentence":"Telegrams were once a common way to send urgent messages.","translation":"電報はかつて緊急のメッセージを送る一般的な手段でした。"},{"sentence":"He received several telegrams congratulating him on his success.","translation":"彼は成功を祝う電報をいくつか受け取りました。"}],"collocations":["send telegrams","receive telegrams","urgent telegrams"],"synonyms":["cables","wires","radiograms"],"antonyms":[]}],"etymology":{"value":"'Telegrams' is the plural form of 'telegram.' The word 'telegram' is a combination of 'tele-' (from Greek 'tēle' meaning 'far off, at a distance') and '-gram' (from Greek 'gramma' meaning 'something written or drawn'). It originally referred to a message transmitted by telegraph.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛlɪɡræmz/","syllables":"tel-e-grams"},"inflection":{"noun_plural":"telegrams"},"usage_notes":{"explanation":"'Telegrams' refers to multiple instances of a telegram, which is a message sent via telegraph. While telegrams were a common method of communication in the past, they are now largely obsolete due to the advent of more modern technologies like email and text messaging. The term is primarily used in historical contexts or when discussing older forms of communication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I sent a telegrams to my family.","correct":"✓ I sent telegrams to my family. / ✓ I sent a telegram to my family.","note":"When referring to multiple telegrams, use the plural form 'telegrams'. When referring to a single telegram, use the singular form 'a telegram'."},{"incorrect":"✗ The telegrams was delivered yesterday.","correct":"✓ The telegrams were delivered yesterday.","note":"'Telegrams' is a plural noun, so it requires the plural verb 'were'."}],"priority":"★★☆"},"related_words":{"derivatives":["telegram (singular noun)","telegraph (noun: an apparatus for transmitting messages to a distance, verb: to send a message by telegraph)","telegraphic (adjective: relating to or communicated by telegraph; brief and abrupt)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency (primarily used in historical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'telegrams' refers to multiple messages that were sent using a telegraph. A telegraph was an old way of sending messages over long distances using electrical signals. Nowadays, telegrams are not commonly used because we have faster and easier ways to communicate, like email and text messages. You might come across the word 'telegrams' when reading historical books or watching movies set in the past."},"example_sentences":[{"sentence":"During the war, families relied on telegrams to receive news from the front lines.","translation":"戦時中、家族は戦線からのニュースを受け取るために電報に頼っていました。","type":"noun","meaning_category":"historical communication"},{"sentence":"The museum has a collection of old telegrams and telegraph equipment.","translation":"博物館には古い電報と電信機器のコレクションがあります。","type":"noun","meaning_category":"historical artifacts"},{"sentence":"He sent two telegrams: one to his business partner and another to his wife.","translation":"彼は2通の電報を送りました。1通はビジネスパートナーに、もう1通は妻に送りました。","type":"noun","meaning_category":"communication"}]}