{"word":"Muong","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ムオン族（ベトナムの少数民族）","english_definition":"An ethnic group native to northern Vietnam, closely related to the Vietnamese.","examples":[{"sentence":"The Muong people have a rich cultural heritage.","translation":"ムオン族は豊かな文化遺産を持っている。"},{"sentence":"Muong is a language spoken by the Muong ethnic group.","translation":"ムオン語はムオン族によって話される言語である。"}],"collocations":["Muong language","Muong culture","Muong people"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Originates from the Vietnamese word 'Mường', referring to a type of administrative division and the people living within it.","priority":"★★☆"},"pronunciation":{"ipa":"/mʊɔŋ/","syllables":"Muong (1 syllable)"},"inflection":{"notes":"This is a proper noun, so it doesn't inflect."},"usage_notes":{"explanation":"'Muong' refers specifically to the ethnic group and their language. It is important to use the term respectfully and accurately when discussing Vietnamese culture and ethnicity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Muongs live in Vietnam.","correct":"✓ The Muong live in Vietnam.","note":"'Muong' is already plural when referring to the people. Adding an 's' is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["Muongese (adjective: relating to the Muong people or language)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Muong' is a term used to refer to a specific ethnic group in Vietnam. Understanding this term requires some knowledge of Vietnamese ethnic diversity. It's not a commonly used word outside of contexts discussing Southeast Asian cultures or ethnology."},"example_sentences":[{"sentence":"The traditional houses of the Muong are often built on stilts.","translation":"ムオン族の伝統的な家屋は、高床式であることが多い。","type":"noun","meaning_category":"ethnic group"},{"sentence":"Learning about the Muong language provides insight into the history of Vietnamese languages.","translation":"ムオン語について学ぶことは、ベトナム語の歴史への洞察を提供する。","type":"noun","meaning_category":"ethnic group"}]}