{"word":"sustentational","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"維持の、扶養の、持続させる","english_definition":"Providing sustenance; maintaining or supporting life or existence.","examples":[{"sentence":"The government provides sustentational aid to low-income families.","translation":"政府は低所得世帯に扶養援助を提供している。"},{"sentence":"The soil's sustentational capacity is crucial for agriculture.","translation":"土壌の維持能力は農業にとって非常に重要である。"}],"collocations":["sustentational aid","sustentational capacity","sustentational resources"],"synonyms":["nutritive","nourishing","supporting","maintaining","life-sustaining"],"antonyms":["destructive","harmful"]}],"etymology":{"value":"Derived from the word 'sustentation,' which comes from the Latin 'sustentare,' meaning 'to sustain, support, or maintain.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌstənˈteɪʃənəl/","syllables":"sus-ten-ta-tion-al"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative and superlative forms (more sustentational, most sustentational)."},"usage_notes":{"explanation":"'Sustentational' is a relatively rare adjective primarily used in formal or technical contexts. It describes something that provides sustenance, support, or maintenance, especially for life or existence. It is often used in discussions related to nutrition, agriculture, or social welfare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sustentational of the building was completed.","correct":"✓ The sustenance of the building was ensured.","note":"'Sustentational' is an adjective, not a noun. Use 'sustenance' or a similar noun instead."}],"priority":"★★☆"},"related_words":{"derivatives":["sustentation (noun): the act of sustaining; means of support","sustain (verb): to support, maintain, or endure"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sustentational' is a formal and uncommon word. It is best understood by knowing its root word, 'sustentation,' which means providing support or maintenance. This word is mainly used in academic or technical writing related to topics like nutrition, agriculture, or social support systems."},"example_sentences":[{"sentence":"The sustentational value of the diet was carefully analyzed.","translation":"その食事の維持価値は慎重に分析された。","type":"adjective","meaning_category":"維持の"},{"sentence":"The sustentational program aimed to provide food and shelter to the homeless.","translation":"その扶養プログラムは、ホームレスに食料と住居を提供することを目的としていた。","type":"adjective","meaning_category":"扶養の"},{"sentence":"The sustentational effects of the new farming techniques were significant.","translation":"新しい農業技術の持続効果は大きかった。","type":"adjective","meaning_category":"持続させる"}]}