{"word":"gentianic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リンドウ属の、リンドウ（ゲンチアナ）に似た、リンドウから得られる","english_definition":"of, relating to, or derived from gentians or the gentian family of plants.","examples":[{"sentence":"gentianic bitters are used in some aperitifs.","translation":"ゲンチアナの苦味成分は、一部のアペリティフに使用されている。"},{"sentence":"The plant has gentianic properties.","translation":"その植物はリンドウに似た特性を持っている。"}],"collocations":["gentianic acid","gentianic bitters","gentianic properties"],"synonyms":["gentianaceous"],"antonyms":[]}],"etymology":{"value":"Derived from 'gentian' (the plant name) + '-ic' (suffix indicating 'of or pertaining to'). The plant name 'gentian' comes from Latin 'Gentiana', named after Gentius, a king of Illyria who is said to have discovered the medicinal properties of the plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɛnʃiˈænɪk/","syllables":"gen-shi-an-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms are 'more gentianic' and 'most gentianic', respectively, but are rarely used."},"usage_notes":{"explanation":"'Gentianic' is a relatively uncommon adjective used in botanical or pharmaceutical contexts to describe something related to or derived from gentians. It is most often found in technical or scientific writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The color was very gentianic.","correct":"✓ The color was gentian blue.","note":"While 'gentianic' relates to gentians, it doesn't directly describe colors. Use 'gentian blue' or similar terms for colors resembling gentians."}],"priority":"★☆☆"},"related_words":{"derivatives":["gentian (noun: a plant of the genus Gentiana)","gentianaceous (adjective: belonging to the gentian family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gentianic' is a specialized term primarily encountered in botanical, pharmaceutical, or historical contexts. Understanding requires familiarity with the plant genus 'Gentiana' and the suffix '-ic', which denotes 'relating to' or 'derived from'. Its usage is limited to discussions directly involving gentians or their properties."},"example_sentences":[{"sentence":"The herbal remedy contained gentianic extracts to stimulate digestion.","translation":"その薬草療法には、消化を促進するためにゲンチアナ抽出物が含まれていた。","type":"adjective","meaning_category":"derived from gentians"},{"sentence":"Researchers studied the gentianic compounds found in the plant's roots.","translation":"研究者たちは、植物の根に含まれるゲンチアナ化合物について研究した。","type":"adjective","meaning_category":"relating to gentians"}]}