{"word":"Synanon","priority":"★☆☆","meanings":[{"part_of_speech":"proper noun","definition":"アメリカで1958年に設立された薬物依存症リハビリテーション・コミューン組織","english_definition":"A controversial drug rehabilitation program and communal living organization founded in 1958 in California, originally for alcohol and drug addicts, later evolving into a cult-like movement.","examples":[{"sentence":"Synanon started as a radical approach to drug rehabilitation.","translation":"シナノンは薬物依存症リハビリテーションへの過激なアプローチとして始まった。"},{"sentence":"By the 1970s, Synanon had transformed into a cult with violent tendencies.","translation":"1970年代までに、シナノンは暴力的傾向を持つカルト集団へと変質していた。"}],"historical_context":"初期は画期的なリハビリ手法で評価されたが、後に指導者チャールズ・ディードリッヒの下で独裁的組織に変貌。1970年代後半に暴力事件や脱税で法的問題が表面化し解散。","priority":"★★☆"},{"part_of_speech":"proper noun","definition":"シナノンが開発した「ゲーム」と呼ばれる集団心理療法手法","english_definition":"A confrontational group therapy technique called 'The Game' developed by Synanon, involving intense peer criticism sessions.","examples":[{"sentence":"The Synanon Game involved brutal honesty and verbal attacks.","translation":"シナノンの「ゲーム」は残酷なほど率直な言葉の攻撃を含んでいた。"}],"notes":"後のエスタなど自己啓発プログラムに影響を与えたが、心理的虐待の手段としても批判された","priority":"★☆☆"}],"pronunciation":{"ipa":"/ˈsɪnənɒn/","syllables":"Syn-a-non"},"etymology":{"value":"組織創設者チャールズ・ディードリッヒによる造語。『統合(synthesis)』と『匿名(anonymous)』を組み合わせたとする説や、初期メンバーが「シナーノン(synanon)」と発音していた言葉に由来するとの説がある。","priority":"★☆☆"},"usage_notes":{"explanation":"現代では主に歴史的文脈で言及される。薬物リハビリ分野では初期の革新的手法として、またカルト研究ではコミューンが独裁化する過程の事例として参照される。一般的な会話で使われることは稀。","priority":"★☆☆"},"related_words":{"historical_connections":["Charles Dederich (創設者)","Daytop Village (影響を受けたリハビリ施設)","EST (影響を受けた自己啓発プログラム)","commune (コミューン)","cult (カルト)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な歴史/社会学文脈)","frequency_google_ngram":"極めて低頻度 (Very low frequency) - 1970年代にピーク","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Synanon」は20世紀アメリカの特殊な社会現象を指す専門用語です。薬物リハビリテーションの歴史やカルト研究の文脈で稀に登場しますが、一般的な英語運用ではまず必要とされません。歴史資料や社会学文献で遭遇する可能性がある専門語と認識してください。"}}