{"word":"Vasopressin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"バソプレシン（抗利尿ホルモン）","english_definition":"A hormone secreted by the posterior lobe of the pituitary gland that constricts blood vessels, raises blood pressure, and reduces excretion of urine.","examples":[{"sentence":"Vasopressin is used to treat diabetes insipidus.","translation":"バソプレシンは尿崩症の治療に使用されます。"},{"sentence":"The release of vasopressin is stimulated by dehydration.","translation":"バソプレシンの放出は脱水症状によって刺激されます。"}],"collocations":["vasopressin receptor","vasopressin release","synthetic vasopressin"],"synonyms":["antidiuretic hormone (ADH)","arginine vasopressin (AVP)"],"antonyms":[]},{"part_of_speech":"noun","definition":"バソプレシン製剤","english_definition":"A pharmaceutical preparation containing vasopressin, used to treat certain medical conditions.","examples":[{"sentence":"The doctor prescribed vasopressin for the patient's low blood pressure.","translation":"医師は患者の低血圧のためにバソプレシンを処方した。"}],"collocations":["vasopressin injection","vasopressin infusion"],"synonyms":["pitressin"],"antonyms":[]}],"etymology":{"value":"Derived from 'vaso-' (referring to blood vessels) + 'pressin' (from its ability to increase blood pressure by constricting blood vessels).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌveɪzoʊˈprɛsɪn/","syllables":"va-so-pres-sin"},"inflection":{"notes":"Noun, plural: vasopressins"},"usage_notes":{"explanation":"Vasopressin, also known as antidiuretic hormone (ADH) or arginine vasopressin (AVP), is a crucial hormone that regulates fluid balance in the body. It acts on the kidneys to reduce urine production, and it also constricts blood vessels, which helps to raise blood pressure. Synthetic vasopressin is used medically to treat conditions such as diabetes insipidus (a condition characterized by excessive thirst and urination) and low blood pressure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The vasopressin effect.","correct":"✓ The effect of vasopressin.","note":"When referring to the effects or properties of vasopressin, it's more common to use 'the effect of vasopressin' rather than directly modifying 'effect' with 'vasopressin'."}],"priority":"★★☆"},"related_words":{"derivatives":["vasopressor (noun: a drug that raises blood pressure)","desmopressin (noun: a synthetic analog of vasopressin)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Vasopressin is a complex term primarily encountered in medical or scientific contexts. It denotes a hormone vital for regulating fluid balance and blood pressure. Understanding its function and implications requires a background in biology or medicine. The term is not typically used in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The patient's blood pressure increased after administration of vasopressin.","translation":"バソプレシンの投与後、患者の血圧が上昇した。","type":"general","meaning_category":"Physiology"},{"sentence":"Vasopressin plays a key role in maintaining osmotic balance in the body.","translation":"バソプレシンは体内の浸透圧バランスを維持する上で重要な役割を果たしている。","type":"general","meaning_category":"Physiology"},{"sentence":"Synthetic vasopressin is used to treat nocturnal enuresis in some children.","translation":"合成バソプレシンは、一部の子供の夜尿症の治療に使用される。","type":"medical","meaning_category":"Treatment"}]}