{"word":"Pharmacognostics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"薬物学 (特に天然物由来の薬物)","english_definition":"The study of medicines derived from natural sources (plants, animals, microorganisms). It focuses on the chemical, biochemical, and biological aspects of drugs, drug substances, or potential drugs of natural origin.","examples":[{"sentence":"Pharmacognostics plays a crucial role in the discovery of new drugs from plants.","translation":"薬物学は植物からの新薬発見において重要な役割を果たします。"},{"sentence":"The pharmacognostics research team isolated several bioactive compounds from the medicinal plant.","translation":"薬物学の研究チームは、その薬用植物からいくつかの生理活性化合物を分離しました。"}],"collocations":["natural products pharmacognostics","medicinal plants pharmacognostics","marine pharmacognostics","pharmacognostics research","pharmacognostics study","pharmacognostics analysis","pharmacognostics screening"],"synonyms":["natural products chemistry","phytochemistry","ethnopharmacology"],"antonyms":[]}],"etymology":{"value":"The term \"pharmacognostics\" is derived from the Greek words \"pharmakon\" (drug) and \"gnosis\" (knowledge). It essentially means \"knowledge of drugs\". The term was coined in the early 19th century to describe the branch of pharmacy dealing with crude drugs of natural origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrməkɒɡˈnɒstɪks/","syllables":"phar-ma-cog-nos-tics"},"inflection":{"noun_plural":"N/A (generally used as a singular uncountable noun)"},"usage_notes":{"explanation":"Pharmacognostics is a specialized field within pharmacy and pharmacology that focuses on the study of natural products as sources of medicinal agents. It involves the identification, isolation, characterization, and analysis of biologically active compounds from plants, animals, and microorganisms. It also includes the study of the historical and traditional uses of medicinal plants (ethnopharmacology).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pharmacognostics are important for drug discovery.","correct":"✓ Pharmacognostics is important for drug discovery.","note":"Pharmacognostics is generally used as a singular, uncountable noun, referring to the field of study itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["pharmacognosy (薬物学 - より一般的な用語)","phytochemical (植物化学物質)","bioactive compound (生理活性化合物)","ethnopharmacologist (民族薬理学者)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野の用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Pharmacognostics is a specialized term referring to the study of drugs derived from natural sources. It involves identifying and analyzing the chemical compounds in plants, animals, and microorganisms that have medicinal properties. This field is important for discovering new drugs and understanding traditional medicine. It's a complex area of study, typically encountered in advanced science or medical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor specialized in pharmacognostics and taught a course on medicinal plants.","translation":"その教授は薬物学を専門とし、薬用植物に関する講座を担当していました。","type":"noun","meaning_category":"薬物学"},{"sentence":"Pharmacognostics research has led to the development of many important drugs, including antibiotics and anticancer agents.","translation":"薬物学の研究は、抗生物質や抗がん剤など、多くの重要な医薬品の開発につながっています。","type":"noun","meaning_category":"薬物学"},{"sentence":"The pharmacognostics laboratory is equipped with advanced instruments for analyzing plant extracts.","translation":"薬物学の研究室には、植物抽出物を分析するための高度な機器が備えられています。","type":"noun","meaning_category":"薬物学"}]}