{"word":"overmeekly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に柔順に、卑屈なほど従順に","english_definition":"In an excessively meek or submissive manner.","examples":[{"sentence":"He overmeekly accepted their criticism, even though he knew he was right.","translation":"彼は自分が正しいとわかっていたにもかかわらず、卑屈なほど彼らの批判を受け入れた。"},{"sentence":"She overmeekly apologized for something that wasn't her fault.","translation":"彼女は自分のせいではないことに対して、過度に柔順に謝罪した。"}],"collocations":["act overmeekly","respond overmeekly","behave overmeekly"],"synonyms":["submissively","obsequiously","servilely","ingratiatingly","cringingly"],"antonyms":["assertively","boldly","confidently","defiantly","arrogantly"]}],"etymology":{"value":"\"over-\" (過度に) + \"meekly\" (柔順に、従順に)","priority":"★★☆"},"pronunciation":{"ipa":"ˌoʊvərˈmiːkli","syllables":"o-ver-meek-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Overmeekly\" describes an action performed with excessive meekness, often implying a lack of self-respect or an attempt to ingratiate oneself with others. It suggests a level of submissiveness that is considered inappropriate or excessive in the given situation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted overmeek.","correct":"✓ He acted overmeekly.","note":"\"Overmeek\" is not a standard adjective. Use \"overmeekly\" as an adverb to modify a verb. Alternatively, rephrase the sentence using a different construction, such as \"He was overly meek.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["overmeek (adjective)","meekly (adverb)","meekness (noun)","meek (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (extremely rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Overmeekly\" is a relatively rare word that describes acting in an excessively submissive or meek manner. It implies a level of deference that is beyond what is appropriate or expected, often suggesting a lack of self-confidence or an attempt to please others excessively. Because of its rarity and nuanced meaning, it's more likely to be encountered in advanced texts or discussions about social behavior."},"example_sentences":[{"sentence":"The employee overmeekly agreed to work overtime every weekend, fearing he would lose his job if he refused.","translation":"その従業員は、拒否すれば職を失うことを恐れて、毎週末残業することに過度に柔順に同意した。","type":"adverb","meaning_category":"過度に柔順に"},{"sentence":"She responded overmeekly to the manager's harsh criticism, even though she knew it was unfair.","translation":"彼女は、それが不当だとわかっていたにもかかわらず、マネージャーの厳しい批判に卑屈なほど従順に答えた。","type":"adverb","meaning_category":"卑屈なほど従順に"}]}