{"word":"endotoxin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"内毒素","english_definition":"A toxin that is present inside a bacterial cell and is released when the cell disintegrates.","examples":[{"sentence":"Endotoxins are lipopolysaccharides found in the outer membrane of Gram-negative bacteria.","translation":"内毒素はグラム陰性細菌の外膜に見られるリポ多糖です。"},{"sentence":"The presence of endotoxin in medical devices can cause severe inflammatory responses.","translation":"医療機器中の内毒素の存在は、重度の炎症反応を引き起こす可能性があります。"}],"collocations":["endotoxin contamination","endotoxin level","endotoxin assay","detect endotoxin","remove endotoxin"],"synonyms":["lipopolysaccharide (LPS)"],"antonyms":["exotoxin"],"scientific_field":"Microbiology, Immunology, Biochemistry"}],"etymology":{"value":"From 'endo-' (meaning 'within') + 'toxin' (meaning 'poison').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊˈtɒksɪn/","syllables":"en-do-tox-in"},"inflection":{"noun_plural":"endotoxins"},"usage_notes":{"explanation":"Endotoxins are structural components of bacteria, specifically lipopolysaccharides (LPS) found in the outer membrane of Gram-negative bacteria. They are released when the bacteria die and their cell walls break down. Endotoxins are heat-stable and can cause a variety of physiological effects in humans and animals, including fever, inflammation, and shock. Because of their potential to cause harm, it's crucial to monitor and control endotoxin levels in pharmaceuticals, medical devices, and water systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Endotoxins are produced by viruses.","correct":"✓ Endotoxins are produced by Gram-negative bacteria.","note":"Endotoxins are specific to Gram-negative bacteria, not viruses."},{"incorrect":"✗ Endotoxins are proteins.","correct":"✓ Endotoxins are lipopolysaccharides.","note":"Endotoxins are lipopolysaccharides (LPS), which are composed of both lipids and polysaccharides, not just proteins."}],"priority":"★★☆"},"related_words":{"derivatives":["endotoxic (adjective: relating to or caused by endotoxins)","endotoxemia (noun: the presence of endotoxins in the blood)"],"scientific_terms":["Gram-negative bacteria","lipopolysaccharide (LPS)","septic shock","pyrogen"],"priority":"★★☆"},"level_frequency":{"scientific_level":"High frequency in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endotoxin' is a technical term primarily used in scientific and medical contexts. It refers to a toxic substance found within bacterial cells, specifically Gram-negative bacteria. When these bacteria die and break apart, the endotoxin is released, potentially causing harmful effects like fever, inflammation, and shock in humans and animals. Understanding endotoxins is important in fields like microbiology, immunology, and pharmaceutical science due to their impact on health and safety.","target_audience":"Scientists, medical professionals, and advanced students in related fields."},"example_sentences":[{"sentence":"The water sample was tested for the presence of endotoxin.","translation":"その水サンプルは、内毒素の存在について検査されました。","type":"scientific","meaning_category":"presence of endotoxin"},{"sentence":"Endotoxin contamination can lead to severe complications in patients.","translation":"内毒素汚染は、患者に重篤な合併症を引き起こす可能性があります。","type":"medical","meaning_category":"endotoxin contamination"},{"sentence":"The endotoxin assay is used to quantify the amount of endotoxin in a sample.","translation":"内毒素アッセイは、サンプル中の内毒素の量を定量するために使用されます。","type":"scientific","meaning_category":"endotoxin assay"}]}