{"word":"heliophilia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"日光を愛する性質、日光浴を好むこと","english_definition":"Love of sunlight; fondness for being in the sun.","examples":[{"sentence":"Her heliophilia led her to spend every summer day at the beach.","translation":"彼女の日光愛は、夏の間毎日彼女をビーチで過ごさせることになった。"},{"sentence":"Heliophilia is common in many reptiles, who need sunlight to regulate their body temperature.","translation":"日光愛は多くの爬虫類に共通しており、彼らは体温を調節するために日光を必要とする。"}],"collocations":["extreme heliophilia","natural heliophilia","display heliophilia"],"synonyms":["sun-loving","photophilia"],"antonyms":["heliophobia","photophobia"]}],"etymology":{"value":"ギリシャ語の「helios」（太陽）+ 「philia」（愛）から。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːli.oʊˈfɪliə/","syllables":"he-li-o-phil-i-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Heliophilia is a relatively uncommon word, primarily used in scientific or literary contexts. It describes a strong attraction or love for sunlight. It can refer to a behavioral trait in animals or a personal preference in humans.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has heliophilia because she burns easily in the sun.","correct":"✓ She has heliophilia despite burning easily in the sun.","note":"Heliophilia is a love of sunlight, so it doesn't make sense to say someone has it because they burn easily. It would be more accurate to say they have it despite the negative effects of the sun."}],"priority":"★☆☆"},"related_words":{"derivatives":["heliophile (noun: 日光を好む人や生物)","heliophilic (adjective: 日光を好む)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heliophilia' is a specialized term that is not commonly used. It refers to the love or fondness for sunlight, typically found in scientific or literary contexts. Understanding this word requires a strong vocabulary and familiarity with scientific terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient's heliophilia was so strong that he insisted on sitting by the window every day.","translation":"その患者の日光愛は非常に強く、毎日窓際に座ることを主張した。","type":"general","meaning_category":"love of sunlight"},{"sentence":"Certain plant species exhibit heliophilia, thriving in environments with direct sunlight.","translation":"特定の植物種は日光愛を示し、直射日光の当たる環境で繁栄する。","type":"scientific","meaning_category":"love of sunlight"}]}