{"word":"supply-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"供給に敏感な、供給量の変化に影響を受けやすい","english_definition":"Responsive to changes in the level of supply; affected by the availability of supply.","examples":[{"sentence":"The price of oil is highly supply-sensitive.","translation":"原油の価格は供給量に非常に敏感である。"},{"sentence":"Healthcare costs can be supply-sensitive, as an increase in the number of specialists may lead to more procedures being performed.","translation":"医療費は、専門医の数が増加するとより多くの処置が行われる可能性があるため、供給に敏感になることがある。"},{"sentence":"The market for rare earth minerals is supply-sensitive due to limited sources.","translation":"レアアース鉱物の市場は、供給源が限られているため、供給に敏感である。"}],"collocations":["supply-sensitive market","supply-sensitive industry","highly supply-sensitive","less supply-sensitive"],"synonyms":["supply-dependent","supply-responsive"],"antonyms":["demand-sensitive","supply-insensitive"]}],"etymology":{"value":"The word is formed by combining 'supply' (the amount of a resource or product available) with 'sensitive' (easily affected or responsive).","priority":"N/A"},"pronunciation":{"ipa":"/səˈplaɪ ˈsɛnsətɪv/","syllables":"sup-ply-sen-si-tive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Supply-sensitive' is used to describe a market, industry, or commodity whose price or availability is greatly affected by changes in the supply. If supply decreases, prices tend to rise, and if supply increases, prices tend to fall. This term is often used in economics and business contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The product is sensitive of supply.","correct":"✓ The product is supply-sensitive.","note":"The correct preposition to use with 'sensitive' in this context is 'to,' but 'supply-sensitive' is a compound adjective, so no preposition is needed."},{"incorrect":"✗ The supply is sensitive.","correct":"✓ The market is supply-sensitive.","note":"It's more accurate to say the *market* or *price* is supply-sensitive, rather than just the supply itself."}],"priority":"N/A"},"related_words":{"derivatives":["supply (noun, verb)","sensitive (adjective)","sensitivity (noun)"],"phrases":["supply and demand","market sensitivity","price elasticity of supply"],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'supply-sensitive' is used in economics and business to describe how much the price or availability of something changes when the amount of it available (the supply) changes. If something is supply-sensitive, it means that even a small change in supply can cause a big change in price or how easy it is to get. This term is more common in specialized discussions about markets and economics."},"example_sentences":[{"sentence":"The agricultural sector is often supply-sensitive due to weather conditions affecting crop yields.","translation":"農業部門は、天候が収穫量に影響を与えるため、供給に敏感であることが多い。","type":"adjective","meaning_category":"General"},{"sentence":"The stock market can be supply-sensitive when a large number of shares are suddenly released.","translation":"株式市場は、大量の株式が突然放出された場合に供給に敏感になることがある。","type":"adjective","meaning_category":"Finance"},{"sentence":"The real estate market in that area is supply-sensitive, with prices rising quickly when new construction is limited.","translation":"その地域の不動産市場は供給に敏感であり、新規建設が制限されると価格が急速に上昇する。","type":"adjective","meaning_category":"Real Estate"}]}