{"word":"coelome","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"体腔（たいこう）","english_definition":"The main body cavity in most animals and is positioned inside the body to surround and contain the digestive tract and other organs.","examples":[{"sentence":"The coelome is a fluid-filled cavity.","translation":"体腔は液体で満たされた空洞である。"},{"sentence":"The earthworm's body is segmented, with a coelome in each segment.","translation":"ミミズの体は分節化されており、各分節に体腔がある。"}],"collocations":["coelomic fluid","coelomic cavity","true coelome","body coelome"],"synonyms":["body cavity"],"antonyms":[],"notes":"体腔は中胚葉によって裏打ちされている必要があります。"}],"etymology":{"value":"From Ancient Greek κοίλωμα (koílōma, “cavity, hollow”), from κοῖλος (koîlos, “hollow”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːləʊm/","syllables":"ce-lome"},"inflection":{"noun_plural":"coelomes or coelomata"},"usage_notes":{"explanation":"The coelome is a key feature in the classification of animals. Animals with a true coelome are called coelomates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coelome is the same as the pseudocoel.","correct":"✓ The coelome is different from the pseudocoel.","note":"The coelome is a true body cavity lined by mesoderm, while the pseudocoel is only partially lined by mesoderm."}],"priority":"★★☆"},"related_words":{"derivatives":["coelomic","coelomate"],"related_terms":["pseudocoel","acoelomate"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coelome' is a technical term used in biology, specifically in zoology and comparative anatomy. It refers to the main body cavity in animals, and understanding its structure and function requires knowledge of animal anatomy and embryology. Therefore, it is suitable for advanced learners or those with a background in biology."},"example_sentences":[{"sentence":"The presence of a coelome allows for greater flexibility and movement.","translation":"体腔の存在は、より大きな柔軟性と運動を可能にする。","type":"general","meaning_category":"function"},{"sentence":"The coelome provides space for organ development.","translation":"体腔は臓器の発達のためのスペースを提供する。","type":"general","meaning_category":"function"},{"sentence":"The coelome is lined with a layer of epithelial cells.","translation":"体腔は上皮細胞の層で裏打ちされている。","type":"anatomy","meaning_category":"structure"}]}