{"word":"oenin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学) マルビジン-3-グルコシド; 赤ワインの色素","english_definition":"(organic chemistry) malvidin-3-glucoside; the pigment responsible for the color of red wine.","examples":[{"sentence":"Oenin is a type of anthocyanin found in grapes.","translation":"オエニンはブドウに含まれるアントシアニンの一種です。"},{"sentence":"The concentration of oenin affects the color intensity of red wine.","translation":"オエニンの濃度は赤ワインの色の濃さに影響を与えます。"}],"collocations":["oenin concentration (オエニン濃度)","grape oenin (ブドウのオエニン)","red wine oenin (赤ワインのオエニン)"],"synonyms":["malvidin-3-glucoside"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'oinos' meaning wine, combined with '-in', a common suffix for chemical compounds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːnɪn/","syllables":"o-e-nin"},"inflection":{"notes":"単数形のみ"},"usage_notes":{"explanation":"Oenin is a technical term used primarily in the fields of organic chemistry, enology (the study of wine), and viticulture (grape cultivation). It refers specifically to a type of anthocyanin, malvidin-3-glucoside, which is a key pigment responsible for the red color in red wine. The term is not commonly used outside of these specialized contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Oenin is a type of protein.","correct":"✓ Oenin is a type of anthocyanin.","note":"Oenin is a type of anthocyanin, not a protein."},{"incorrect":"✗ Oenin is only found in white wine.","correct":"✓ Oenin is primarily responsible for the color of red wine.","note":"Oenin is responsible for the red color in red wine."}],"priority":"★★☆"},"related_words":{"derivatives":["anthocyanin","malvidin","glucoside"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oenin' is a specialized term used in chemistry and wine-making. It refers to a specific chemical compound, malvidin-3-glucoside, which gives red wine its color. You'll mostly find this word in scientific papers or discussions about wine production. It's not a word you'd use in everyday conversation unless you're talking about the chemistry of wine.","priority":"★★☆"},"example_sentences":[{"sentence":"The amount of oenin in the grapes determines the final color of the wine.","translation":"ブドウ中のオエニンの量がワインの最終的な色を決定します。","type":"scientific","meaning_category":"organic chemistry"},{"sentence":"Winemakers often analyze oenin levels to ensure consistent color in their red wines.","translation":"ワインメーカーは、赤ワインの色の一貫性を保つために、オエニンのレベルを分析することがよくあります。","type":"enology","meaning_category":"wine production"}]}