{"word":"ten-strike","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ボーリング)ストライク","english_definition":"(bowling) a strike","examples":[{"sentence":"He got a ten-strike on his first try.","translation":"彼は最初の一投でストライクを取った。"}],"collocations":["get a ten-strike"],"synonyms":["strike"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)大成功、大当たり","english_definition":"(figuratively) a great success; a hit","examples":[{"sentence":"The new product was a ten-strike for the company.","translation":"その新製品は会社にとって大成功だった。"}],"collocations":["a real ten-strike"],"synonyms":["success","hit","winner"],"antonyms":["failure"]}],"etymology":{"value":"'Ten-strike' is a term originating from bowling, where knocking down all ten pins with the first ball results in a 'strike'. The figurative sense extends from this, representing a complete and immediate success.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛnˌstraɪk/","syllables":"ten-strike"},"inflection":{"noun_plural":"ten-strikes"},"usage_notes":{"explanation":"'Ten-strike' is primarily used in the context of bowling to refer to a strike. Figuratively, it describes something that is a complete and immediate success, similar to hitting all the pins in bowling with one ball. While 'strike' is the more common term for the bowling achievement, 'ten-strike' emphasizes the completeness of the success, both literally and figuratively.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a ten-strike in the meeting.","correct":"✓ His idea was a ten-strike in the meeting.","note":"'Ten-strike' as a figurative term usually refers to an idea, product, or event that is highly successful, not an action someone performs. You can't 'make' a ten-strike; something 'is' a ten-strike."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["strike","spare","bowling","pin"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ten-strike' has a specific meaning in bowling and a figurative sense indicating a great success. Understanding requires familiarity with bowling terminology and the ability to interpret figurative language. The term is not commonly used outside of these contexts, making it less frequent in general conversation."},"example_sentences":[{"sentence":"He hoped to bowl a ten-strike in the final frame.","translation":"彼は最終フレームでストライクを出したいと願った。","type":"noun","meaning_category":"bowling"},{"sentence":"The new marketing campaign was a real ten-strike for the company.","translation":"その新しいマーケティングキャンペーンは会社にとって本当に大成功だった。","type":"noun","meaning_category":"figurative success"}]}