{"word":"blotchily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"まだらに、しみだらけに、むらになって","english_definition":"In a blotchy manner; covered with or characterized by blotches (irregular patches or spots).","examples":[{"sentence":"The paint was applied blotchily, resulting in an uneven finish.","translation":"ペンキはまだらに塗られ、仕上がりが不均一になった。"},{"sentence":"The skin was blotchily red after the sunburn.","translation":"日焼け後、肌はまだらに赤くなっていた。"},{"sentence":"The dye stained the fabric blotchily.","translation":"染料は生地をむらのある染め方で染めた。"}],"collocations":["apply blotchily","stain blotchily","appear blotchily","blotchily red","blotchily colored"],"synonyms":["patchily","mottledly","spottily","unevenly","irregularly"],"antonyms":["evenly","uniformly","consistently"]}],"etymology":{"value":"Derived from the adjective 'blotchy' (covered with blotches) and the suffix '-ly' (forming adverbs). 'Blotch' comes from Middle English 'blot', possibly related to Old Norse 'blettr' meaning 'spot'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblɒtʃɪli/","syllables":"blotch-i-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Blotchily' describes the manner in which something appears or is done, specifically relating to the presence of irregular patches or spots. It is often used to describe uneven application of paint, skin discoloration, or fabric staining. The adverb emphasizes the lack of uniformity and the presence of distinct, irregular marks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wall was blotchy because of the blotchily paint.","correct":"✓ The wall was blotchy because the paint was applied blotchily.","note":"'Blotchily' is an adverb and modifies a verb, not a noun. It describes *how* the paint was applied, not the paint itself."},{"incorrect":"✗ He painted blotchily the wall.","correct":"✓ He painted the wall blotchily.","note":"Adverbs often come after the verb and object in a sentence, especially when describing the manner of the action."}],"priority":"★☆☆"},"related_words":{"derivatives":["blotchy (adjective: covered with blotches)","blotch (noun: an irregular patch or spot)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (low frequency)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'blotchily' is a relatively uncommon adverb that describes something done or appearing in an uneven, spotted, or patchy way. It's used to indicate a lack of uniformity in color or texture, often due to an irregular application or distribution of something. Because of its specific meaning and relatively low frequency, it is more likely to be encountered in advanced or specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The sunblock was applied so quickly that it left the skin looking blotchily white.","translation":"日焼け止めを急いで塗ったので、肌がまだらに白く見えた。","type":"adverb","meaning_category":"Appearance"},{"sentence":"The old photograph had faded blotchily over the years.","translation":"古い写真は長年かけてまだらに色褪せていた。","type":"adverb","meaning_category":"Condition"},{"sentence":"The artist applied the watercolor blotchily to create a textured effect.","translation":"アーティストは水彩絵の具をまだらに塗り、質感のある効果を出した。","type":"adverb","meaning_category":"Manner of application"}]}