{"word":"unreliable-eyed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that suggest untrustworthiness or a tendency to deceive; appearing untrustworthy based on one's eyes.","english_definition":"Having eyes that give an impression of untrustworthiness or deceptiveness.","examples":[{"sentence":"The con artist had an unreliable-eyed gaze that made people wary.","translation":"その詐欺師は、人を警戒させるような、信用できない目つきをしていた。"},{"sentence":"He gave me an unreliable-eyed look, and I knew he was lying.","translation":"彼は私に信用できない目つきをしたので、彼が嘘をついていると分かった。"}],"collocations":["unreliable-eyed gaze","unreliable-eyed look","unreliable-eyed expression"],"synonyms":["shifty-eyed","deceptive-eyed","untrustworthy-eyed","furtive-eyed"],"antonyms":["trustworthy-eyed","honest-eyed","reliable-eyed"],"notes":"This is a descriptive adjective, often used in literature or character descriptions to convey a sense of untrustworthiness through someone's eyes. It is not a common, everyday term."}],"etymology":{"value":"Formed by combining 'unreliable' (not able to be relied on) and 'eyed' (having eyes of a specified kind).","priority":"Low"},"pronunciation":{"ipa":"ʌnriˈlaɪəbl aɪd","syllables":"un-re-li-a-ble-eyed"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'unreliable-eyed' is figurative and descriptive. It is used to convey a sense of untrustworthiness or deception through the appearance of someone's eyes. It is more common in literary or descriptive contexts than in everyday conversation. The eyes are metaphorically described as 'unreliable,' suggesting that they cannot be trusted to reflect the truth or honest intentions.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is unreliable-eyed person.","correct":"He is an unreliable-eyed person.","note":"Use the article 'an' before 'unreliable-eyed' because it begins with a vowel sound."}],"priority":"Low"},"related_words":{"derivatives":[],"related_terms":["shifty","furtive","deceptive","untrustworthy"],"priority":"Low"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Unreliable-eyed' is a complex, descriptive adjective. It is not commonly used and would likely be encountered in literature or detailed character descriptions. Understanding requires a strong vocabulary and the ability to interpret figurative language. The term implies that someone's eyes give the impression of untrustworthiness or deception."},"example_sentences":[{"sentence":"The character in the novel was described as having an unreliable-eyed stare.","translation":"小説の登場人物は、信用できない目つきをしていると描写されていた。","type":"descriptive","meaning_category":"untrustworthiness"},{"sentence":"His unreliable-eyed expression made it difficult to believe anything he said.","translation":"彼の信用できない目つきのせいで、彼が言うことを何も信じることができなかった。","type":"descriptive","meaning_category":"deception"}]}