{"word":"Gangerel","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(World of Darkness) A clan of nomadic vampires known for their connection to animals and the wilderness.","english_definition":"In the World of Darkness setting, a clan of vampires known for their connection to animals and the wilderness.","examples":[{"sentence":"The Gangerel vampire shifted into the form of a wolf.","translation":"そのギャンゲルの一族の吸血鬼は狼の姿に変身した。"}],"collocations":["Gangerel clan","Embrace (vampire creation)","Protean Discipline"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The etymology is uncertain, but it is likely derived from a Germanic word referring to a wanderer or vagabond. It is primarily used within the context of the World of Darkness role-playing game.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈɡæŋɡərɛl","syllables":"Gan-ge-rel"},"inflection":{},"usage_notes":{"explanation":"'Gangerel' is a term almost exclusively used within the context of the World of Darkness role-playing game, specifically Vampire: The Masquerade. It refers to a specific clan of vampires with particular characteristics and abilities.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency outside of World of Darkness contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Gangerel' is highly specialized and primarily encountered within the World of Darkness role-playing game community. Understanding requires familiarity with the game's lore and terminology."},"example_sentences":[{"sentence":"The **Gangerel** are often found wandering the outskirts of cities.","translation":"ギャンゲルの一族は都市の郊外をさまよっていることが多い。","type":"noun","meaning_category":"Vampire Clan"},{"sentence":"A **Gangerel** character in Vampire: The Masquerade can develop a close bond with animals.","translation":"Vampire: The Masqueradeのギャンゲルのキャラクターは動物と親密な絆を築くことができる。","type":"noun","meaning_category":"Vampire Clan"}]}