{"word":"Musquaspen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of apple originating from Long Island, New York, known for its late ripening and good keeping qualities.","english_definition":"A variety of apple originating in Long Island, New York, characterized by its late ripening and ability to store well.","examples":[{"sentence":"The Musquaspen apple was a popular choice for winter storage in colonial times.","translation":"Musquaspenのリンゴは、植民地時代には冬の保存用として人気がありました。"}],"collocations":["Musquaspen apple tree","Musquaspen fruit","growing Musquaspen apples"],"synonyms":["None (specific synonyms, as it's a specific apple variety)"],"antonyms":["None (as it's a specific apple variety)"]}],"etymology":{"value":"Likely derived from a Native American language, reflecting the apple's origin in Long Island. The exact origin and meaning are not definitively known.","priority":"★★☆"},"pronunciation":{"ipa":"/mʌsˈkwɑːspən/","syllables":"Mus-quas-pen"},"inflection":{"noun_plural":"Musquaspens"},"usage_notes":{"explanation":"'Musquaspen' is a relatively obscure apple variety, primarily of historical interest. It is not commonly grown or available today. Information about it is often found in historical texts about apple varieties.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_apple_varieties":["Newtown Pippin","Rhode Island Greening"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (very rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Musquaspen' is a highly specialized term referring to a specific, relatively rare apple variety. Understanding this word requires knowledge of historical apple cultivation and regional agricultural history. It's unlikely to be encountered outside of specialized contexts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"Old agricultural records mention the Musquaspen as a reliable late-season apple.","translation":"古い農業記録には、Musquaspenが信頼できる晩生のリンゴとして記載されています。","type":"noun","meaning_category":"Apple variety"}]}