{"word":"ivory-black","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"象牙黒：骨を焼いて作った黒色の顔料","english_definition":"A black pigment made by calcining ivory or bone.","examples":[{"sentence":"Ivory-black was commonly used by artists in the past.","translation":"象牙黒は、過去に芸術家によって一般的に使用されていました。"},{"sentence":"The painting used ivory-black to create deep shadows.","translation":"その絵画は、深い影を作るために象牙黒を使用した。"}],"collocations":["artist's pigment","bone black","calcined bone","charred bone"],"synonyms":["bone black","animal black"],"antonyms":["titanium white","zinc white"]},{"part_of_speech":"adjective","definition":"象牙黒色の","english_definition":"Of a dark black color, resembling ivory-black pigment.","examples":[{"sentence":"She wore an ivory-black dress to the formal event.","translation":"彼女はフォーマルなイベントに象牙黒色のドレスを着て行った。"},{"sentence":"The car was painted in an ivory-black shade.","translation":"その車は象牙黒色に塗装されていた。"}],"collocations":["ivory-black dress","ivory-black shade","ivory-black paint"],"synonyms":["jet black","ebony","coal black"],"antonyms":["snow-white","alabaster"]}],"etymology":{"value":"The term 'ivory-black' comes from the historical practice of making the pigment by charring ivory scraps. However, bone is more commonly used today, so it is often synonymous with 'bone black'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪvəri ˌblæk/","syllables":"i-vo-ry-black"},"inflection":{"notes":"As a noun, it is typically uncountable. As an adjective, it does not inflect."},"usage_notes":{"explanation":"Ivory-black is a deep, rich black pigment traditionally made from charred ivory, though now more commonly made from bone. It is valued for its depth of color and is often used in fine art. It can refer to the pigment itself or the color.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used ivory black to paint the sky blue.","correct":"✓ I used ivory-black to paint the shadows.","note":"Ivory-black is a black pigment, so it would not be used to paint something blue."},{"incorrect":"✗ The ivory-black is very expensive because it is made of elephant tusks.","correct":"✓ Ivory-black was traditionally made from elephant tusks, but now it is more commonly made from bone.","note":"While traditionally made from ivory, most ivory-black today is made from bone."}],"priority":"★★☆"},"related_words":{"derivatives":["black","ivory","pigment","bone black"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ivory-black' refers to a specific type of black pigment. It is a specialized term, primarily used in the context of art, painting, and historical materials. Understanding this term requires a knowledge of art history and pigment production. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The artist preferred ivory-black for its rich, velvety texture.","translation":"そのアーティストは、象牙黒の豊かでビロードのような質感を好んだ。","type":"noun","meaning_category":"pigment"},{"sentence":"She chose an ivory-black frame to complement the monochrome photograph.","translation":"彼女はモノクロ写真を引き立てるために象牙黒色のフレームを選んだ。","type":"adjective","meaning_category":"color"}]}