{"word":"stereoisomerism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"立体異性、立体異性現象","english_definition":"The property by which a molecule exists in different spatial arrangements.","examples":[{"sentence":"Stereoisomerism is important in drug design because different stereoisomers can have different biological effects.","translation":"立体異性現象は、異なる立体異性体が異なる生物学的効果を持つ可能性があるため、医薬品設計において重要です。"}],"collocations":["exhibit stereoisomerism (立体異性を示す)","stereoisomerism in organic chemistry (有機化学における立体異性)"],"synonyms":["optical isomerism","chirality"],"antonyms":[]}],"etymology":{"value":"\"Stereo-\" (立体) + \"isomerism\" (異性現象)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsteriːoʊaɪˈsɒmərɪzəm/","syllables":"ste-re-o-i-som-er-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Stereoisomerism refers to the existence of molecules with the same molecular formula and sequence of bonded atoms (constitution), but differing in the three-dimensional orientations of their atoms in space. This is a crucial concept in chemistry, particularly in organic and biological chemistry, as different stereoisomers can exhibit vastly different properties and biological activities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ stereoisomerism is when molecules have the same formula.","correct":"✓ Stereoisomerism is when molecules have the same formula but different spatial arrangements.","note":"It's crucial to specify that stereoisomers have the same formula *and* the same connectivity, but differ in spatial arrangement."}],"priority":"★★☆"},"related_words":{"derivatives":["stereoisomer (立体異性体)","stereospecific (立体特異的な)","stereoselective (立体選択的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的小さめ (Relatively low frequency) - 化学分野の専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Stereoisomerism\" is a technical term used in chemistry to describe a situation where molecules have the same chemical formula and the same sequence of bonded atoms, but they differ in their three-dimensional arrangement in space. This difference in spatial arrangement can lead to different properties and biological activities. Understanding this concept is important in fields like drug design and biochemistry.","priority":"★★☆"},"example_sentences":[{"sentence":"The drug exists as two stereoisomers, one of which is more effective.","translation":"その薬は2つの立体異性体として存在し、そのうちの1つがより効果的です。","type":"general","meaning_category":"general"},{"sentence":"Stereoisomerism plays a critical role in enzyme-substrate interactions.","translation":"立体異性現象は、酵素と基質の相互作用において重要な役割を果たします。","type":"scientific","meaning_category":"scientific"}]}