{"word":"Univocability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of having only one possible meaning or interpretation; the property of being unambiguous.","english_definition":"The quality or state of being univocal; having only one possible meaning or interpretation; the property of being unambiguous.","examples":[{"sentence":"The univocability of mathematical symbols is essential for clear communication.","translation":"数学記号の一意性は、明確なコミュニケーションに不可欠です。"},{"sentence":"Legal documents require univocability to avoid disputes.","translation":"法的文書は、紛争を避けるために一意性を必要とします。"}],"collocations":["ensure univocability","achieve univocability","semantic univocability"],"synonyms":["unambiguity","clarity","precision","explicitness"],"antonyms":["ambiguity","equivocation","polysemy"]}],"etymology":{"value":"Derived from 'univocal', which comes from the Latin 'uni-' (one) + 'vocalis' (sounding, relating to the voice).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːnɪˈvɒkəˈbɪlɪti/","syllables":"U-ni-vo-ca-bi-li-ty"},"inflection":{"noun_plural":"Univocabilities"},"usage_notes":{"explanation":"'Univocability' is primarily used in formal contexts, such as philosophy, mathematics, and law, where precision of meaning is paramount. It emphasizes the importance of a term or symbol having a single, clear interpretation to prevent confusion or misinterpretation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The univocability of his feelings was obvious.","correct":"✓ The sincerity of his feelings was obvious.","note":"'Univocability' refers to the clarity of meaning, not the genuineness of feelings."},{"incorrect":"✗ The univocability of the painting made it boring.","correct":"✓ The lack of ambiguity in the painting made it boring.","note":"'Univocability' is not about aesthetic appeal but about the clarity of meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["univocal (adjective)","univocally (adverb)"],"related_concepts":["semantics","hermeneutics","logic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Univocability' refers to the quality of something having only one possible meaning. It's a term mainly used in academic or technical fields where it's important to be very precise and avoid any confusion. For example, in mathematics, symbols need to have univocability so that everyone understands them in the same way. This word isn't commonly used in everyday conversation."},"example_sentences":[{"sentence":"The contract's univocability was challenged in court.","translation":"契約の一意性が法廷で争われた。","type":"general","meaning_category":"clarity of meaning"},{"sentence":"Philosophers debate the univocability of certain theological terms.","translation":"哲学者たちは、特定の神学用語の一意性について議論する。","type":"academic","meaning_category":"philosophical concept"}]}