{"word":"burnishable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"磨き上げることができる、研磨可能な","english_definition":"Capable of being burnished; able to be polished to a shine.","examples":[{"sentence":"This metal is highly burnishable, making it ideal for jewelry.","translation":"この金属は非常に磨き上げやすく、ジュエリーに最適です。"},{"sentence":"The clay surface needs to be burnishable to achieve a smooth finish.","translation":"粘土の表面は、滑らかな仕上がりを実現するために磨き上げられる必要があります。"}],"collocations":["highly burnishable","easily burnishable","burnishable surface","burnishable material"],"synonyms":["polishable","buffable","smoothable"],"antonyms":["unpolishable","unbuffable"]}],"etymology":{"value":"The word 'burnishable' is derived from the verb 'burnish,' which comes from the Old French word 'burnir' meaning 'to polish, make shiny.' This ultimately traces back to the Proto-Germanic '*brunijan,' meaning 'to make brown, to shine.' The suffix '-able' indicates capability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrnɪʃəbəl/","syllables":"bur-nish-a-ble"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more burnishable, most burnishable), though these are less common."},"usage_notes":{"explanation":"'Burnishable' is a relatively technical term, primarily used in contexts where the ability to polish a material to a high shine is important. This includes fields like metallurgy, ceramics, and leatherworking. It describes a property of the material itself, indicating its suitability for a burnishing process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The burnishable is on the table.","correct":"✓ The burnishable metal is on the table.","note":"'Burnishable' is an adjective, so it must modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The metal was burnished, so it is burnishable.","correct":"✓ The metal is burnishable, so it can be easily burnished.","note":"'Burnishable' describes an inherent property of the material, not a state achieved through a process. The second sentence is grammatically correct but could be improved for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["burnish (verb: to polish; noun: a gloss or shine)","burnishing (noun: the act of polishing)","burnisher (noun: a tool used for burnishing)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'burnishable' is a technical adjective used to describe materials that can be polished to a high sheen. It's not commonly used in everyday conversation, but rather in specialized fields like metalworking, ceramics, or leather crafting. Understanding this word requires a knowledge of the verb 'burnish,' which means to polish something until it shines. The suffix '-able' indicates the capability of being burnished. Therefore, 'burnishable' means 'capable of being polished to a shine.'"},"example_sentences":[{"sentence":"The silversmith chose a highly burnishable alloy for the intricate design.","translation":"銀細工師は、複雑なデザインのために、非常に磨き上げやすい合金を選びました。","type":"adjective","meaning_category":"研磨可能な"},{"sentence":"This type of leather is burnishable, allowing for a beautiful, glossy finish.","translation":"このタイプの革は磨き上げることができ、美しく光沢のある仕上がりになります。","type":"adjective","meaning_category":"研磨可能な"},{"sentence":"The burnishable quality of the metal made it suitable for creating mirrors.","translation":"その金属の磨き上げやすさから、鏡の製造に適していました。","type":"adjective","meaning_category":"研磨可能な"}]}