{"word":"Suboxides","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"Oxides with unusually low oxygen content, typically with metal-metal bonding.","english_definition":"Chemical compounds that are oxides, but with a lower oxygen-to-metal ratio than would be expected based on the typical valency of the metal. They often feature metal-metal bonding.","examples":[{"sentence":"Carbon suboxide (C3O2) is an example of a suboxide.","translation":"亜酸化炭素 (C3O2) は亜酸化物の例です。"},{"sentence":"Some alkali metals form suboxides with unusual structures.","translation":"一部のアルカリ金属は、珍しい構造の亜酸化物を形成します。"}],"collocations":["carbon suboxide","alkali metal suboxides","unusual suboxides"],"synonyms":["oxygen-deficient oxides"],"antonyms":["normal oxides","peroxides"]},{"part_of_speech":"noun","definition":"(plural only) A group or class of chemical compounds with a lower oxygen-to-metal ratio.","english_definition":"A category of chemical compounds that are oxides with a reduced amount of oxygen relative to the metal.","examples":[{"sentence":"The study focused on the properties of various suboxides.","translation":"その研究は、さまざまな亜酸化物の特性に焦点を当てました。"},{"sentence":"Suboxides often exhibit unique electronic and structural properties.","translation":"亜酸化物は、独特の電子構造的特性を示すことが多いです。"}],"collocations":["properties of suboxides","synthesis of suboxides","structure of suboxides"],"synonyms":["oxygen-poor oxides"],"antonyms":["oxygen-rich oxides"]}],"etymology":{"value":"The prefix 'sub-' indicates 'less than' or 'below', combined with 'oxide', indicating an oxide with a lower oxygen content than a typical oxide.","priority":"Medium"},"pronunciation":{"ipa":"/sʌbˈɒksaɪdz/","syllables":"sub-ox-ides"},"inflection":{"noun_plural":"suboxides"},"usage_notes":{"explanation":"'Suboxides' are typically encountered in specialized chemistry contexts. The term is used to describe compounds where the metal has a higher positive charge than would be expected from the number of oxygen atoms present. This often leads to the formation of metal-metal bonds within the structure.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Suboxide is used as a common fertilizer.","correct":"Typical oxides are used as common fertilizers.","note":"Suboxides are not typically used as fertilizers due to their specialized nature and often unstable properties."}],"priority":"Low"},"related_words":{"derivatives":["suboxide"],"related_compounds":["carbon suboxide (C3O2)","rubidium suboxide"],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Suboxides' are a specialized class of chemical compounds, typically discussed in advanced chemistry. The term refers to oxides with a lower oxygen-to-metal ratio than expected, often involving metal-metal bonding. Understanding this term requires knowledge of basic chemistry principles and terminology."},"example_sentences":[{"sentence":"The synthesis of novel suboxides is an active area of research.","translation":"新規亜酸化物の合成は、活発な研究分野です。","type":"General Chemistry","meaning_category":"Synthesis"},{"sentence":"The crystal structure of rubidium suboxide shows unusual metal-metal bonding.","translation":"亜酸化ルビジウムの結晶構造は、珍しい金属-金属結合を示しています。","type":"Solid State Chemistry","meaning_category":"Structure"},{"sentence":"Carbon suboxide is a linear molecule with interesting polymerization properties.","translation":"亜酸化炭素は、興味深い重合特性を持つ直線状分子です。","type":"Organic Chemistry","meaning_category":"Properties"}]}