{"word":"Purine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プリン、プリン塩基","english_definition":"A heterocyclic aromatic organic compound consisting of fused pyrimidine and imidazole rings.","examples":[{"sentence":"Purines are found in high concentrations in meat products and some vegetables.","translation":"プリン体は、肉製品や一部の野菜に高濃度で含まれています。"},{"sentence":"The breakdown of purines in the body produces uric acid.","translation":"体内のプリン体の分解は尿酸を生成します。"}],"collocations":["high purine foods","low purine diet"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'pur' (from 'pure uric') + '-ine'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpjʊəriːn/","syllables":"Pu-rine"},"inflection":{"noun_plural":"Purines"},"usage_notes":{"explanation":"Purines are a class of organic molecules that are important components of DNA and RNA. They are also found in many foods, and their breakdown in the body can lead to the formation of uric acid, which can cause gout.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He needs to avoid purine when he has gout.","correct":"✓ He needs to avoid purines when he has gout.","note":"Purine is a class of compounds, so the plural form 'purines' is generally used when referring to dietary intake. "},{"incorrect":"✗ Purine is a type of protein.","correct":"✓ Purines are components of DNA and RNA.","note":"Purines are not proteins; they are nitrogenous bases that are components of nucleic acids."}],"priority":"★★☆"},"related_words":{"derivatives":["purinergic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Purine' is a technical term primarily used in the context of biochemistry, nutrition, and medicine. It refers to a specific type of organic compound found in DNA, RNA, and certain foods. Understanding this term is important for comprehending discussions about gout, uric acid levels, and dietary recommendations related to these conditions. It is not a word commonly encountered in everyday conversation but is relevant in specialized contexts.","example_sentences":[]},"example_sentences":[{"sentence":"Individuals with gout are often advised to limit their intake of foods high in purines.","translation":"痛風の人は、プリン体の多い食品の摂取を制限するようにアドバイスされることが多いです。","type":"noun","meaning_category":"プリン塩基"},{"sentence":"The structure of purine consists of a pyrimidine ring fused to an imidazole ring.","translation":"プリンの構造は、ピリミジン環とイミダゾール環が縮合したものです。","type":"noun","meaning_category":"プリン塩基"}]}