{"word":"Oculinid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A coral belonging to the family Oculinidae.","english_definition":"A coral belonging to the family Oculinidae, typically characterized by their branching or massive structures and deep calices.","examples":[{"sentence":"The oculinid coral formed a delicate branching structure.","translation":"そのオキュリナのサンゴは繊細な枝状の構造を形成した。"},{"sentence":"Oculinids are found in various marine environments, from shallow reefs to deep-sea habitats.","translation":"オキュリナは、浅いサンゴ礁から深海生息地まで、さまざまな海洋環境で見られる。"}],"collocations":["oculinid coral","oculinid colony","oculinid reef"],"synonyms":["coral","stony coral"],"antonyms":[]}],"etymology":{"value":"From the family name Oculinidae, derived from Latin 'oculus' (eye) referring to the eye-like appearance of the coral's calices (cups).","priority":"★★★"},"pronunciation":{"ipa":"/ɒˈkjʊlɪnɪd/","syllables":"O-cu-li-nid"},"inflection":{"noun_plural":"oculinids"},"usage_notes":{"explanation":"'Oculinid' refers specifically to corals within the family Oculinidae. These corals are often characterized by their distinct calices, which resemble eyes. They can form branching or massive structures and are found in diverse marine environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oculinid is a type of fish.","correct":"✓ The oculinid is a type of coral.","note":"Oculinids are corals, not fish or other marine animals."}],"priority":"★★☆"},"related_words":{"derivatives":["Oculinidae (family name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oculinid' is a specialized term used in marine biology and coral reef ecology. It refers to a specific family of corals characterized by their unique physical structures. This term is unlikely to be encountered outside of scientific or technical contexts related to marine life."},"example_sentences":[{"sentence":"The deep-sea exploration revealed a new species of oculinid.","translation":"深海探査でオキュリナの新種が発見された。","type":"noun","meaning_category":"coral"},{"sentence":"Oculinid reefs provide habitat for many marine organisms.","translation":"オキュリナのサンゴ礁は多くの海洋生物の生息地となっている。","type":"noun","meaning_category":"coral"}]}