{"word":"unlitigable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"訴訟に適さない、訴訟を起こすことができない、法的に争うことができない","english_definition":"Not suitable or able to be litigated; not subject to legal dispute or contest.","examples":[{"sentence":"The issue was considered unlitigable due to lack of standing.","translation":"その問題は、当事者適格の欠如により訴訟に適さないと判断された。"},{"sentence":"An unlitigable claim is one that cannot be successfully pursued in court.","translation":"訴訟に適さない請求とは、裁判所で成功裏に追求できない請求のことである。"}],"collocations":["unlitigable claim","unlitigable issue","considered unlitigable"],"synonyms":["nonjusticiable","non-actionable","uncontestable","indisputable"],"antonyms":["litigable","justiciable","actionable","disputable"]}],"etymology":{"value":"Prefix 'un-' (not) + 'litigable' (capable of being litigated). 'Litigable' comes from 'litigate,' which originates from Latin 'litigare' (to dispute, to quarrel), from 'litis' (a lawsuit) + 'agere' (to do, to drive).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlɪtɪɡəbəl/","syllables":"un-lit-i-ga-ble"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Unlitigable' is a legal term describing issues or claims that a court will not hear or decide, often because they are too abstract, hypothetical, or lack a proper legal basis or standing. It suggests that there is no legitimate legal dispute to resolve.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contract was unlitigable, so we sued anyway.","correct":"✓ The contract was unlitigable, so we sought alternative dispute resolution.","note":"If a contract is unlitigable, suing is not a viable option. Alternative methods of dispute resolution would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["litigate (verb): to contest at law.","litigation (noun): the process of taking legal action.","litigious (adjective): prone to engage in lawsuits.","litigability (noun): the quality of being litigable."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily a legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unlitigable' is a specialized legal term that means something cannot be taken to court or legally disputed. It's used when there's no legal basis for a lawsuit or when a court wouldn't be able to make a decision on the matter. This word is more common in legal contexts and not typically used in everyday conversation."},"example_sentences":[{"sentence":"The court determined that the plaintiff's grievance was based on a purely political question and therefore unlitigable.","translation":"裁判所は、原告の不満は純粋に政治的な問題に基づいており、したがって訴訟に適さないと判断した。","type":"adjective","meaning_category":"訴訟に適さない"},{"sentence":"Because the agreement lacked specific terms, any dispute arising from it would likely be unlitigable.","translation":"合意には具体的な条件が欠けているため、そこから生じる紛争は訴訟に適さない可能性が高い。","type":"adjective","meaning_category":"法的に争うことができない"}]}