{"word":"Fistiana","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional or humorous term referring to works of fiction, particularly novels or films, that heavily feature fistfights or hand-to-hand combat.","english_definition":"A humorous term for fictional works featuring many fistfights.","examples":[{"sentence":"The movie was pure Fistiana, with a brawl in every scene.","translation":"その映画は純粋なFistianaで、どのシーンにも乱闘があった。"},{"sentence":"He enjoys reading Fistiana novels for their action-packed fight sequences.","translation":"彼はアクション満載の格闘シーンのためにFistiana小説を読むのを楽しんでいる。"}],"collocations":["pure Fistiana","Fistiana novel","Fistiana movie"],"synonyms":["action fiction","fighting genre"],"antonyms":[]}],"etymology":{"value":"A blend of 'fist' (referring to hand-to-hand combat) and '-iana' (a suffix used to denote a collection of items or topics related to a specific subject).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪstiˈɑːnə/","syllables":"fis-ti-a-na"},"inflection":{"noun_plural":"Fistianas"},"usage_notes":{"explanation":"'Fistiana' is primarily used humorously or informally to describe works that are dominated by fistfights. It is not a formal genre classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The library had a large section of Fistiana.","correct":"✓ The library had a large section of action and adventure novels.","note":"'Fistiana' is not a standard genre term, so it's better to use established genre categories in formal contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fistiana' is a niche term, primarily used in informal contexts to describe action-heavy fiction featuring frequent fistfights. It's a blend of 'fist' and '-iana', indicating a collection or genre focused on hand-to-hand combat. Due to its informal and humorous nature, it's not commonly found in formal writing or discussions."},"example_sentences":[{"sentence":"The critic dismissed the film as mindless Fistiana.","translation":"批評家はその映画を頭を使わないFistianaだと一蹴した。","type":"noun","meaning_category":"fiction genre"},{"sentence":"He's a big fan of classic Fistiana films from the 1970s.","translation":"彼は1970年代の古典的なFistiana映画の大ファンだ。","type":"noun","meaning_category":"fiction genre"}]}