{"word":"conduct-money","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"出廷手当、召喚に応じるための旅費","english_definition":"money paid to a witness to cover the cost of traveling to and from court, and for their expenses while attending.","examples":[{"sentence":"The witness was paid conduct-money to appear in court.","translation":"証人は出廷するために出廷手当を支払われた。"},{"sentence":"The lawyer ensured that the conduct-money was sufficient to cover all the witness's expenses.","translation":"弁護士は、出廷手当が証人のすべての費用を賄うのに十分であることを確認した。"}],"collocations":["pay conduct-money","receive conduct-money","sufficient conduct-money","conduct-money for travel","conduct-money for expenses"],"synonyms":["witness fees","travel allowance","expense money","subsistence allowance"],"antonyms":[]}],"etymology":{"value":"The term 'conduct-money' is derived from the idea of 'conducting' or leading someone to court, implying the expenses associated with that process. It combines 'conduct' (leading, guiding) and 'money' (payment).","priority":"★★★"},"pronunciation":{"ipa":"/kənˈdʌktˌmʌni/","syllables":"con-duct-mon-ey"},"inflection":{"noun_plural":"conduct-monies (rarely used)"},"usage_notes":{"explanation":"Conduct-money is specifically related to the expenses incurred by a witness when they are summoned to appear in court. It is intended to cover their travel costs, accommodation (if necessary), and other reasonable expenses. The amount of conduct-money is usually determined by legal regulations or court rules.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The defendant received conduct-money.","correct":"✓ The witness received conduct-money.","note":"Conduct-money is paid to witnesses, not defendants. Defendants may have their own legal costs, but they do not receive conduct-money for appearing in court."},{"incorrect":"✗ Conduct-money covers legal fees.","correct":"✓ Conduct-money covers travel and expenses.","note":"Conduct-money is specifically for travel and expenses related to attending court as a witness, not for legal fees or other costs."}],"priority":"★★★"},"related_words":{"derivatives":["conduct (verb, noun)","money (noun)"],"phrasal_verbs":[],"related_legal_terms":["subpoena","witness","testimony","court","legal expenses","fees"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily a legal term.","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Conduct-money' is a specialized legal term referring to the payment made to a witness to cover their travel and related expenses for attending court. It is not commonly used in everyday conversation and is primarily encountered in legal contexts. Understanding this term requires familiarity with legal procedures and terminology related to witnesses and court appearances."},"example_sentences":[{"sentence":"The court clerk explained the process for claiming conduct-money after providing testimony.","translation":"裁判所の書記官は、証言後に旅費手当を請求するプロセスについて説明した。","type":"example","meaning_category":"legal procedure"},{"sentence":"Without sufficient conduct-money, some witnesses may be unable to afford to attend court.","translation":"十分な出廷手当がないと、一部の証人は裁判所に出廷する余裕がないかもしれない。","type":"example","meaning_category":"financial implications"},{"sentence":"The lawyer requested clarification on the calculation of conduct-money for expert witnesses.","translation":"弁護士は、専門家の証人に対する出廷手当の計算方法について明確化を求めた。","type":"example","meaning_category":"legal practice"}]}