{"word":"Prochurchian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Supporting or promoting the institutional church, often to the exclusion of other forms of Christian community or expression.","english_definition":"Favoring the established church system and its structures, sometimes at the expense of other Christian practices or gatherings.","examples":[{"sentence":"His prochurchian views led him to criticize house churches as being less legitimate.","translation":"彼の教会制度支持の考え方は、家庭教会を正当性に欠けると批判することにつながった。"},{"sentence":"The article explored the tension between prochurchian attitudes and more decentralized forms of worship.","translation":"その記事は、教会制度支持の姿勢と、より分散型の礼拝形式との間の緊張関係を探求した。"}],"collocations":["prochurchian attitude","prochurchian bias","prochurchian theology","prochurchian perspective"],"synonyms":["ecclesiocentric","institutionalist","establishmentarian"],"antonyms":["anti-institutional","decentralized","non-denominational","house-church oriented"]},{"part_of_speech":"noun","definition":"A person who strongly supports the institutional church.","english_definition":"An individual who advocates for and prioritizes the traditional church organization.","examples":[{"sentence":"The prochurchians in the congregation were resistant to the proposed changes in worship style.","translation":"会衆の中の教会制度支持者たちは、提案された礼拝スタイルの変更に抵抗した。"},{"sentence":"As a prochurchian, he believed that the church building was essential for maintaining community.","translation":"教会制度支持者として、彼は教会の建物が共同体を維持するために不可欠だと信じていた。"}],"collocations":["staunch prochurchian","devout prochurchian","traditional prochurchian"],"synonyms":["church supporter","institutional advocate","ecclesiastic"],"antonyms":["non-churchgoer","independent believer","free Christian"]}],"etymology":{"value":"Likely a neologism formed by combining \"pro-\" (supporting) with \"churchian,\" an informal term referring to someone closely associated with or focused on the institutional church.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌproʊtʃɜːrtʃiən/","syllables":"pro-church-i-an"},"inflection":{"notes":"Adjective: prochurchian; Noun: prochurchian (plural: prochurchians)"},"usage_notes":{"explanation":"\"Prochurchian\" is a relatively uncommon term, often used in discussions about ecclesiology (the study of the church) and the role of the institutional church in modern Christianity. It can sometimes carry a negative connotation, suggesting an overemphasis on church structures at the expense of personal faith or other forms of Christian community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very pro-churchian, so he never prays at home.","correct":"✓ He is very prochurchian, so he always attends church services.","note":"Prochurchian implies support for the church, not necessarily a lack of personal prayer life. The corrected sentence better reflects the likely behavior of someone with prochurchian views."}],"priority":"★☆☆"},"related_words":{"derivatives":["churchianity (the state of being focused on church)"],"phrasal_verbs":[],"related_concepts":["ecclesiology","institutional church","house church","denominationalism","non-denominationalism"]},"level_frequency":{"CEFR":"N/A (term is not common enough to be rated)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"prochurchian\" is a niche word, primarily used in theological or religious discussions. Understanding it requires familiarity with concepts like ecclesiology and the distinction between institutional and non-institutional forms of Christian practice. The word's meaning is relatively transparent, being formed from \"pro-\" and \"churchian,\" but its usage is nuanced and often carries implicit value judgments."},"example_sentences":[{"sentence":"The pastor's prochurchian stance was evident in his emphasis on regular attendance and tithing.","translation":"牧師の教会制度支持の姿勢は、定期的な出席と十分の一献金に対する彼の強調に明らかだった。","type":"adjective","meaning_category":"Supporting the institutional church"},{"sentence":"Many prochurchians believe that the sacraments should only be administered within the context of a recognized church.","translation":"多くの教会制度支持者は、秘跡は公認された教会の中でしか執行されるべきではないと考えている。","type":"noun","meaning_category":"A person who supports the institutional church"}]}