{"word":"grignet","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(フランス語) バゲットの表面にある切れ込み","english_definition":"(French) The score or cut on the surface of a baguette.","examples":[{"sentence":"Le grignet permet à la baguette de gonfler correctement pendant la cuisson.","translation":"The score allows the baguette to rise properly during baking."}],"collocations":["faire un grignet (to make a score)","beau grignet (beautiful score)"],"synonyms":["scarification","incision"],"antonyms":[]}],"etymology":{"value":"フランス語のgrigner（歯をむき出しにする、しかめっ面をする）に由来。バゲットの表面の切れ込みが、歯をむき出しにしたような見た目であることから。","priority":"★★★"},"pronunciation":{"ipa":"/ɡʁiɲɛ/","syllables":"gri-gnet"},"inflection":{"noun_plural":"grignets"},"usage_notes":{"explanation":"フランス語のパン用語。英語圏ではフランスパン作りの専門家の間で使われることがある。一般的にはあまり知られていない。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a knife to grignet the baguette.","correct":"✓ I used a knife to score the baguette.","note":"英語では、バゲットに切れ込みを入れる行為は \"score\" と表現するのが一般的。"},{"incorrect":"✗ The grignet of the bread was too deep.","correct":"✓ The score of the bread was too deep.","note":"英語では、バゲットの切れ込み自体も \"score\" と表現するのが一般的。"}],"priority":"★★☆"},"related_words":{"derivatives":["grigner (フランス語の動詞: 歯をむき出しにする、しかめっ面をする)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Grignet\" is a specialized term from French baking, referring to the cuts made on the surface of a baguette before baking. It's not commonly used in general English, but may be encountered in recipes or discussions among baking enthusiasts. Understanding the term requires familiarity with French baking techniques and vocabulary. In most English contexts, \"score\" is the preferred term.","note":"This word is not commonly used in English. It is a French loanword used in the context of baking."},"example_sentences":[{"sentence":"The baker's signature was a perfectly executed grignet on each baguette.","translation":"そのパン職人のサインは、各バゲットに見事に施された切れ込みだった。","type":"noun","meaning_category":"切れ込み"},{"sentence":"A shallow grignet can prevent the baguette from expanding properly.","translation":"浅い切れ込みは、バゲットが適切に膨らむのを妨げる可能性がある。","type":"noun","meaning_category":"切れ込み"}]}