{"word":"deceitful-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having eyes that suggest or indicate deceit or dishonesty.","english_definition":"Having eyes that appear to be dishonest or intending to deceive.","examples":[{"sentence":"The con artist had a deceitful-eyed look that made people wary.","translation":"その詐欺師は、人を警戒させるような、欺瞞に満ちた目をしていた。"},{"sentence":"I couldn't trust him; he seemed deceitful-eyed.","translation":"私は彼を信用できなかった。彼は欺瞞的な目をしているように見えた。"},{"sentence":"The character in the novel was described as deceitful-eyed, adding to his sinister portrayal.","translation":"小説の登場人物は欺瞞的な目つきをしていると描写されており、彼の不吉な人物像をさらに際立たせていた。"}],"collocations":["deceitful-eyed look","deceitful-eyed expression","deceitful-eyed stare"],"synonyms":["shifty-eyed","untrustworthy-eyed","cunning-eyed","sly-eyed","guileful-eyed"],"antonyms":["honest-eyed","trustworthy-eyed","sincere-eyed","open-eyed","innocent-eyed"]}],"etymology":{"value":"Compound word formed by combining 'deceitful' (full of deceit) and 'eyed' (having eyes of a certain kind). The term suggests that the eyes themselves convey a sense of dishonesty or deception.","priority":"★☆☆"},"pronunciation":{"ipa":"/dɪˈsiːtfəl aɪd/","syllables":"de-ceit-ful-eyed"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Deceitful-eyed' is a descriptive adjective used to characterize someone whose eyes give the impression of dishonesty or a tendency to deceive. It's often used in literature or descriptive writing to quickly convey a character's untrustworthy nature. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a deceitful eyed person.","correct":"✓ He is a deceitful-eyed person.","note":"The term 'deceitful-eyed' functions as a single adjective, so it should be hyphenated when used before a noun. "},{"incorrect":"✗ Her eyes were deceitfully.","correct":"✓ Her eyes were deceitful-eyed.","note":"'Deceitfully' is an adverb. 'Deceitful-eyed' is an adjective describing the eyes themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["deceitful (adjective)","deceitfully (adverb)","deceitfulness (noun)","eyed (suffix)"],"phrases":["look someone in the eye","eyes are the window to the soul"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used in everyday speech. More likely to be found in literature or descriptive writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'deceitful-eyed' is a relatively uncommon and descriptive adjective used to convey that someone's eyes give an impression of dishonesty or a tendency to deceive. It's more likely to be encountered in literature or descriptive writing rather than everyday conversation. Understanding the meaning requires a good grasp of vocabulary related to deception and physical description."},"example_sentences":[{"sentence":"The villain in the story was portrayed as a deceitful-eyed character, making his treachery believable.","translation":"物語の悪役は、欺瞞的な目をした人物として描かれており、彼の裏切りを信じさせるものにしていた。","type":"general","meaning_category":"general"},{"sentence":"Even though he smiled, his deceitful-eyed gaze betrayed his true intentions.","translation":"彼は微笑んでいたが、その欺瞞的な目つきが彼の本当の意図を暴露していた。","type":"general","meaning_category":"general"},{"sentence":"The detective noticed the suspect's deceitful-eyed expression during the interrogation.","translation":"刑事は尋問中に容疑者の欺瞞的な目つきに気づいた。","type":"general","meaning_category":"general"}]}