{"word":"grouted","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(タイルなどの)目地を埋める、グラウト処理をする","english_definition":"To fill in the gaps between tiles with grout.","examples":[{"sentence":"We grouted the bathroom tiles yesterday.","translation":"昨日、浴室のタイルにグラウトを詰めました。"},{"sentence":"The newly tiled floor needs to be grouted.","translation":"新しくタイルを張った床は、目地を埋める必要があります。"}],"collocations":["grout tiles","apply grout","grout a floor","grout a shower"],"synonyms":["seal","fill","caulk"],"antonyms":["remove grout","chip out grout"]},{"part_of_speech":"adjective","definition":"グラウト処理された、目地が埋められた","english_definition":"Having the gaps between tiles filled with grout.","examples":[{"sentence":"The grouted tiles look much better now.","translation":"目地が埋められたタイルは、ずっと見栄えが良くなりました。"},{"sentence":"Make sure the surface is clean before applying grout to the grouted area.","translation":"グラウト処理された場所にグラウトを塗る前に、表面がきれいであることを確認してください。"}],"collocations":["grouted tile","grouted surface","freshly grouted"],"synonyms":["sealed","filled","caulked"],"antonyms":["ungrouted","open-jointed"]}],"etymology":{"value":"The word \"grout\" comes from Old English \"grut,\" meaning coarse meal or crushed fragments. The verb \"grout\" and its past participle \"grouted\" derive directly from this noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡraʊtɪd/","syllables":"grou-ted"},"inflection":{"verb_forms":{"present_simple":["grout","grouts"],"past_simple":"grouted","past_participle":"grouted","present_participle":"grouting"}},"usage_notes":{"explanation":"\"Grouted\" is primarily used in the context of tiling and construction. It refers to the process of filling the spaces between tiles with grout, a dense fluid mixture used to fill gaps or seal joints. As an adjective, it describes something that has undergone this process. It is a relatively specialized term, mainly used by those involved in tiling or construction work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I cemented the tiles.","correct":"✓ I grouted the tiles.","note":"Cement and grout are different materials. Cement is used for bonding, while grout is for filling gaps. Using \"cemented\" instead of \"grouted\" is incorrect in this context."},{"incorrect":"✗ The tiles are grout.","correct":"✓ The tiles are grouted.","note":"\"Grout\" is the material, while \"grouted\" describes the state of having been filled with grout."}],"priority":"★★☆"},"related_words":{"derivatives":["grout (noun: a dense fluid mixture used to fill gaps or seal joints, especially between tiles)","grouting (noun: the process of applying grout)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"grouted\" is a technical term primarily associated with tiling and construction. It describes the state of having the gaps between tiles filled with grout. Understanding this word requires some familiarity with the process of tiling. While not a common word in everyday conversation, it is essential for anyone involved in home improvement or construction projects involving tiles."},"example_sentences":[{"sentence":"The **grouted** shower walls are now waterproof.","translation":"グラウト処理されたシャワーの壁は、現在防水です。","type":"adjective","meaning_category":"グラウト処理された"},{"sentence":"He carefully **grouted** around each tile.","translation":"彼は各タイルの周りを注意深くグラウト処理しました。","type":"verb","meaning_category":"目地を埋める"}]}