{"word":"Presbyterianism","pronunciation":{"ipa_uk":"/prɪzˈbɪtəriənɪzəm/","ipa_us":"/prɛzˈbɪtɪriənɪz(ə)m/","syllables":"Pres-by-te-ri-an-ism"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency - specialized term"},"readability_explanation":{"level":"C1","text":"\"**Presbyterianism**\" is a branch of Protestant Christianity that originated in the Scottish Reformation during the 16th century. It's characterized by its belief in God’s sovereignty, the authority of Scripture, and governance by elders (presbyters).  Unlike some other denominations, Presbyterian churches are not typically led by a single pastor but by a council of elected elders known as a session or consistory. Key theological tenets include predestination—the idea that God has predetermined who will be saved—and covenant theology, emphasizing the binding agreements between God and humanity. Historically, Presbyterianism has been influential in countries like Scotland, Ireland, the United States (especially among early settlers), and Korea.  Different branches of Presbyterianism exist today with varying degrees of theological conservatism or liberalism."},"example_sentences":[{"sentence":"Many Scottish immigrants brought their **Presbyterianism** to North America in the 18th century.","translation":"多くのスコットランドからの移民が18世紀に北アメリカに彼らの長老主義を持ち込んだ。","type":"historical context","meaning_category":"Religious tradition's spread"},{"sentence":"The core of **Presbyterianism** lies in the belief that God is all-powerful and has a plan for everyone.","translation":"長老主義の中核は、神が全能であり、すべての人々のための計画を持っているという信念にある。","type":"theological foundation","meaning_category":"Belief system"},{"sentence":"The debate over the interpretation of scripture is a common issue within various **Presbyterianism** denominations.","translation":"聖書の解釈をめぐる議論は、さまざまな長老主義教派の間で一般的な問題です。","type":"denominational differences","meaning_category":"Internal debates"},{"sentence":"Unlike episcopal churches, **Presbyterianism** emphasizes a shared governance structure among elected elders.","translation":"司教制の教会とは異なり、長老主義は選出された長老たちの間で共有されるガバナンス構造を強調する。","type":"comparison with other denominations","meaning_category":"Governance structure"},{"sentence":"The strict moral code often associated with **Presbyterianism** influenced the social values of many communities.","translation":"長老主義と関連付けられる厳格な道徳規範は、多くのコミュニティの社会的価値観に影響を与えた。","type":"societal impact","meaning_category":"Social influence"}]}