{"word":"Presbyterianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"長老派教会主義、長老派","english_definition":"A Protestant Christian religious system of church government in which the local church is governed by a body of elected elders; the doctrines and practices of Presbyterian churches.","examples":[{"sentence":"Presbyterianism emphasizes the sovereignty of God and the authority of Scripture.","translation":"長老派教会主義は、神の主権と聖書の権威を強調する。"},{"sentence":"The church follows the principles of Presbyterianism.","translation":"その教会は長老派教会主義の原則に従っている。"}],"collocations":["practice Presbyterianism","adhere to Presbyterianism","teach Presbyterianism"],"synonyms":["Calvinism","Reformed theology"],"antonyms":["Episcopalianism","Catholicism"]}],"etymology":{"value":"From 'Presbyterian' (referring to a system of church governance by elders) + '-ism' (denoting a system of beliefs or practices). 'Presbyterian' itself comes from the Greek word 'presbyteros' meaning 'elder'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɛzbɪˈtɪəriənɪzəm/","syllables":"Pres-by-te-ri-an-i-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Presbyterianism' refers to both a system of church governance and a set of theological beliefs. It is characterized by a representative form of church government, where elected elders govern the local church. Theologically, it aligns with Calvinistic or Reformed theology, emphasizing God's sovereignty and the authority of Scripture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Presbyterianism.","correct":"✓ He is a Presbyterian.","note":"'Presbyterianism' is the system of beliefs or governance; a person who adheres to it is a 'Presbyterian'."},{"incorrect":"✗ Presbyterianism are a type of Protestantism.","correct":"✓ Presbyterianism is a type of Protestantism.","note":"'Presbyterianism' is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Presbyterian (noun, adjective)","Presbytery (noun)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Presbyterianism' is a term related to a specific branch of Protestant Christianity. It refers to both a system of church governance by elected elders and a set of theological beliefs rooted in Calvinism. The term is typically encountered in discussions of religious history, theology, or church governance. Understanding requires familiarity with basic concepts of Protestantism and church structure."},"example_sentences":[{"sentence":"The spread of Presbyterianism in Scotland was a significant historical event.","translation":"スコットランドにおける長老派教会主義の広がりは、重要な歴史的出来事だった。","type":"noun","meaning_category":"Church system"},{"sentence":"Many early American settlers brought their Presbyterianism with them.","translation":"多くのアメリカ初期入植者は、長老派教会主義を携えてきた。","type":"noun","meaning_category":"Religious beliefs"},{"sentence":"The principles of Presbyterianism guide the decisions of the church council.","translation":"長老派教会主義の原則が、教会評議会の決定を導く。","type":"noun","meaning_category":"Guiding principles"}]}