{"word":"patchery","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"まだらな、継ぎ当てだらけの、一様でない","english_definition":"Irregular or uneven in appearance or quality; covered with patches.","examples":[{"sentence":"The landscape was patchery, with fields of green interspersed with barren areas.","translation":"その風景はまだらで、緑の畑と不毛な地域が混ざり合っていた。"},{"sentence":"The old quilt was patchery, a testament to years of use and repair.","translation":"その古いキルトは継ぎ当てだらけで、長年の使用と修理の証だった。"},{"sentence":"His knowledge of the subject was patchery; he knew a lot about some areas, but little about others.","translation":"彼のその主題に関する知識は一様でなく、ある分野については多くを知っていたが、他の分野についてはほとんど知らなかった。"}],"collocations":["patchery landscape","patchery quilt","patchery knowledge","patchery coverage"],"synonyms":["uneven","irregular","spotty","mottled","variegated","fragmentary","inconsistent"],"antonyms":["uniform","even","consistent","homogeneous","smooth"]},{"part_of_speech":"noun","definition":"継ぎ当て細工、まだら模様","english_definition":"Something that is patchery; a collection of patches.","examples":[{"sentence":"The garden was a patchery of different flowers and herbs.","translation":"その庭は様々な花やハーブの継ぎ当て細工のようだった。"},{"sentence":"The project became a patchery of different ideas, none of which were fully developed.","translation":"そのプロジェクトは様々なアイデアの寄せ集めとなり、どれも十分に発展しなかった。"}],"collocations":["a patchery of ideas","a patchery of colors","a patchery of textures"],"synonyms":["medley","hodgepodge","jumble","assortment","collection"]}],"etymology":{"value":"Derived from 'patch' (a piece of material used to mend or cover a hole) + '-ery' (a suffix denoting a place, collection, or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpætʃəri/","syllables":"patch-er-y"},"inflection":{"notes":"The word 'patchery' can function as both an adjective and a noun. As an adjective, it describes something that is uneven or covered in patches. As a noun, it refers to something that is composed of patches or is uneven in nature. There are no plural forms for the adjective use. The noun use is uncommon."},"usage_notes":{"explanation":"'Patchery' is used to describe something that is not uniform or consistent, either in appearance or quality. It often implies a lack of cohesiveness or a mixture of different elements. When used to describe knowledge or skills, it suggests that someone has gaps in their understanding or abilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The wall was very patchery with paint.","correct":"The wall had a patchery appearance due to the uneven paint.","note":"Better to use 'patchery' as a descriptive adjective rather than directly modifying with 'very'."},{"incorrect":"He made a patchery of his homework.","correct":"His homework was patchery and incomplete.","note":"Use 'patchery' to describe the state of the homework, not as a direct action."}],"priority":"★★☆"},"related_words":{"derivatives":["patch","patchwork","patchiness"],"phrasal_verbs":[],"related_adjectives":["patchy"],"related_nouns":["patchiness"]},"level_frequency":{"CEFR":"N/A (Low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patchery' is a relatively uncommon word used to describe something that is uneven, irregular, or composed of patches. It can be used to describe physical appearances, such as a 'patchery landscape,' or abstract concepts, such as 'patchery knowledge.' The word implies a lack of uniformity or consistency. Understanding its meaning requires a strong vocabulary and an ability to infer meaning from context."},"example_sentences":[{"sentence":"The forest floor was a patchery mix of sunlight and shadow.","translation":"森の地面は太陽の光と影がまだらに混ざり合っていた。","type":"adjective","meaning_category":"まだらな"},{"sentence":"The quilt was a colorful patchery of different fabrics.","translation":"そのキルトは様々な生地のカラフルな継ぎ当て細工だった。","type":"noun","meaning_category":"継ぎ当て細工"},{"sentence":"The satellite image revealed a patchery distribution of vegetation across the region.","translation":"衛星画像は、その地域全体に植生がまだらに分布していることを明らかにした。","type":"adjective","meaning_category":"一様でない"},{"sentence":"The artist created a patchery of textures using different painting techniques.","translation":"そのアーティストは様々な絵画技法を用いて、まだらな質感を作り出した。","type":"noun","meaning_category":"まだら模様"}]}