{"word":"resales","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再販、転売 (resale の複数形)","english_definition":"plural of resale: the act of selling something that you have bought.","examples":[{"sentence":"The company profits from resales of used equipment.","translation":"その会社は中古機器の再販で利益を上げている。"},{"sentence":"Ticket resales are often illegal if they are above face value.","translation":"チケットの転売は、額面価格を超える場合、しばしば違法となる。"}],"collocations":["ticket resales (チケットの転売)","property resales (不動産の再販)","online resales (オンラインでの再販)"],"synonyms":["secondhand sales","used goods sales","pre-owned sales"],"antonyms":["new sales","original sales"]}],"etymology":{"value":"\"Resales\" is the plural form of \"resale,\" which is formed by adding the prefix \"re-\" (meaning again) to the word \"sale.\" The word \"sale\" comes from Old English \"sala,\" meaning the act of selling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːseɪlz/","syllables":"re-sales"},"inflection":{"noun_plural":"resales"},"usage_notes":{"explanation":"\"Resales\" refers to multiple instances of selling something again after it has already been purchased. It is commonly used in contexts such as ticket resales, property resales, and the reselling of used goods. The term implies that the items being sold are not new and have been previously owned.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The resale are booming.","correct":"✓ Resales are booming.","note":"Since \"resales\" is plural, use the plural form of the verb \"to be\" (are)."},{"incorrect":"✗ Resales is a growing market.","correct":"✓ Resale is a growing market.","note":"When referring to the market in general, use the singular form \"resale.\" When referring to multiple instances of selling again, use \"resales.\""}],"priority":"★★☆"},"related_words":{"derivatives":["resale (noun: 再販、転売)","resell (verb: 再販する、転売する)","reseller (noun: 再販業者、転売業者)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Resales\" means selling something again after it has already been bought by someone else. For example, if you buy a ticket to a concert and then sell it to someone else because you can't go, that's a resale. The word is often used when talking about markets for used items, like clothes or electronics. It's a plural noun, so it refers to multiple instances of reselling.","example_sentences":[]},"example_sentences":[{"sentence":"The resales market for vintage clothing is thriving.","translation":"ヴィンテージ衣料品の再販市場は活況を呈している。","type":"noun","meaning_category":"再販市場"},{"sentence":"Many people make a living through online resales of collectibles.","translation":"多くの人々が収集品のオンライン再販で生計を立てている。","type":"noun","meaning_category":"再販"},{"sentence":"The company specializes in resales of refurbished electronics.","translation":"その会社は、再生電子機器の再販を専門としている。","type":"noun","meaning_category":"再販"}]}