{"word":"acroparesthesia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"四肢末端異常感覚","english_definition":"A condition characterized by tingling, numbness, or pain in the extremities (hands and feet), often occurring at night.","examples":[{"sentence":"She experienced acroparesthesia in her hands during the night.","translation":"彼女は夜間に手に四肢末端異常感覚を経験した。"},{"sentence":"Acroparesthesia can be a symptom of carpal tunnel syndrome.","translation":"四肢末端異常感覚は、手根管症候群の症状である可能性がある。"}],"collocations":["nocturnal acroparesthesia (夜間四肢末端異常感覚)"],"synonyms":["paresthesia","peripheral neuropathy"],"antonyms":[]}],"etymology":{"value":"The term is derived from the Greek words 'acro-' (extremity), 'par-' (abnormal), 'esthesia' (sensation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌækroʊˌpærəsˈθiːziə/","syllables":"ac-ro-par-es-the-si-a"},"inflection":{"noun_plural":"acroparesthesias"},"usage_notes":{"explanation":"Acroparesthesia is not a disease itself, but rather a symptom that can be associated with various underlying conditions, such as carpal tunnel syndrome, thoracic outlet syndrome, vitamin deficiencies, or thyroid disorders. It is important to consult a healthcare professional for proper diagnosis and treatment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have acroparesthesia all over my body.","correct":"✓ I have acroparesthesia in my hands and feet.","note":"Acroparesthesia specifically refers to the extremities (hands and feet)."},{"incorrect":"✗ Acroparesthesia is a contagious disease.","correct":"✓ Acroparesthesia is a symptom, not a contagious disease.","note":"Acroparesthesia is a symptom, not a disease, and it is not contagious."}],"priority":"★★☆"},"related_words":{"derivatives":["acral (pertaining to the extremities)","paresthesia (abnormal sensation)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acroparesthesia' is a medical term referring to abnormal sensations like tingling or numbness in the hands and feet. It's not a common word in everyday language and is mostly used in medical contexts. If you experience these symptoms, it's best to consult a doctor for diagnosis and treatment.","priority":"★★★"},"example_sentences":[{"sentence":"The patient reported nocturnal acroparesthesia, which was interfering with her sleep.","translation":"患者は夜間の四肢末端異常感覚を訴え、それが睡眠を妨げていると述べた。","type":"medical","meaning_category":"symptom"},{"sentence":"Acroparesthesia can sometimes be relieved with wrist splints or physical therapy.","translation":"四肢末端異常感覚は、手首の添え木や理学療法で緩和されることがある。","type":"treatment","meaning_category":"symptom management"}]}