{"word":"Sadducism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"サドカイ派の主義、サドカイ派の教義","english_definition":"The beliefs and teachings of the Sadducees, a Jewish sect during the Second Temple period.","examples":[{"sentence":"Sadducism denied the resurrection of the dead.","translation":"サドカイ派の主義は死者の復活を否定した。"},{"sentence":"The Gospels often contrast the teachings of Jesus with Sadducism.","translation":"福音書はしばしばイエスの教えとサドカイ派の主義を対比させる。"}],"collocations":["oppose Sadducism","reject Sadducism","contrast with Sadducism"],"synonyms":["Sadduceeism","Sadduceanism"],"antonyms":[]}],"etymology":{"value":"From Sadducee + -ism. The term \"Sadducee\" comes from Hebrew (צדוקי, Ṣadduqī), likely derived from Zadok (צדוק, Ṣāḏōq), the high priest during the reigns of David and Solomon.","priority":"中"},"pronunciation":{"ipa":"ˈsædʒʊˌsiːɪzəm","syllables":"Sad-du-cee-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Sadducism refers to the religious and philosophical beliefs held by the Sadducees, a Jewish sect that was prominent during the Second Temple period (roughly 515 BCE to 70 CE). They were often associated with the priestly aristocracy and held significant political power. Key tenets of Sadducism included the rejection of the oral Torah, a strict adherence to the written Torah, and a denial of the resurrection of the dead, angels, and the afterlife. They also had different interpretations of laws and rituals compared to other Jewish groups like the Pharisees.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Sadducism believed in the resurrection.","correct":"Sadducism denied the resurrection.","note":"Sadducism is characterized by its denial of the resurrection of the dead."}],"priority":"中"},"related_words":{"derivatives":["Sadducee","Sadducean","Sadduceeism"],"phrases":["Second Temple period","Torah","Pharisees"],"priority":"高"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低い","priority":"低"},"readability_explanation":{"level":"C1","text":"'Sadducism' is a term referring to the religious and philosophical views of the Sadducees, a Jewish sect influential during the Second Temple period. Understanding this term requires knowledge of ancient Jewish history and religious movements. Key aspects include their literal interpretation of the Torah, rejection of oral traditions, and denial of the afterlife. The word is typically encountered in theological or historical contexts.","priority":"中"},"example_sentences":[{"sentence":"The Essenes and Pharisees held beliefs that were in direct opposition to Sadducism.","translation":"エッセネ派とパリサイ派は、サドカイズムに真っ向から対立する信念を持っていた。","type":"general","meaning_category":"belief system"},{"sentence":"Scholars debate the precise nature of Sadducism due to limited surviving sources.","translation":"学者は、現存する資料が限られているため、サドカイズムの正確な性質について議論している。","type":"historical","meaning_category":"historical context"}]}