{"word":"anabiotic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"無代謝状態の、仮死状態の","english_definition":"Relating to or characterized by anabiosis; capable of returning to life after a period of dormancy or apparent death.","examples":[{"sentence":"Anabiotic organisms can survive extreme conditions.","translation":"無代謝状態の生物は極限状態を生き残ることができる。"},{"sentence":"The tardigrade is a famous example of an anabiotic animal.","translation":"クマムシは無代謝状態の動物の有名な例である。"}],"collocations":["anabiotic state","anabiotic organism","anabiotic ability"],"synonyms":["dormant","latent","suspended animation"],"antonyms":["active","alive","living"]}],"etymology":{"value":"Derived from the Greek words 'ana-' (meaning 'again' or 'up') and 'bios' (meaning 'life'), combined with the suffix '-tic' (meaning 'relating to'). Thus, 'anabiotic' literally means 'relating to returning to life'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænəbaɪˈɒtɪk/","syllables":"a-na-bi-ot-ic"},"inflection":{"notes":"This word is primarily used as an adjective. The noun form is 'anabiosis'."},"usage_notes":{"explanation":"'Anabiotic' describes the state or ability of an organism to enter a state of suspended animation, allowing it to survive harsh environmental conditions and later return to active life. This term is often used in biology and related scientific fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anabiotic process is when something dies.","correct":"✓ The anabiotic process is when something enters a state of suspended animation.","note":"Anabiosis is not death, but a state of dormancy or suspended animation. The organism is still alive but with greatly reduced metabolic activity."},{"incorrect":"✗ Only bacteria are anabiotic.","correct":"✓ Some animals, like tardigrades, can also be anabiotic.","note":"While bacteria can enter anabiotic states, some animals, such as tardigrades (water bears), are also known for their anabiotic abilities."}],"priority":"★★☆"},"related_words":{"derivatives":["anabiosis (noun): the state of suspended animation or dormancy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Anabiotic' is a scientific term used to describe the state or ability of an organism to enter suspended animation, allowing it to survive extreme conditions and later return to life. It's derived from Greek roots meaning 'returning to life'. This term is primarily used in biology and related scientific fields and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"Certain bacteria can enter an **anabiotic** state to survive harsh conditions.","translation":"特定の細菌は、過酷な条件を生き残るために無代謝状態に入ることができる。","type":"adjective","meaning_category":"無代謝状態の"},{"sentence":"The **anabiotic** abilities of tardigrades have fascinated scientists for years.","translation":"クマムシの無代謝能力は、長年科学者たちを魅了してきた。","type":"adjective","meaning_category":"無代謝状態の"}]}