{"word":"Uncircularised","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not distributed in a circular fashion; not made available to a wide audience.","english_definition":"Not distributed widely or made available to a broad audience, especially in a circular or widespread manner.","examples":[{"sentence":"The document remained uncircularised within the department.","translation":"その文書は部署内で回覧されなかった。"},{"sentence":"An uncircularised memo was found in the archives.","translation":"回覧されなかったメモが公文書館で見つかった。"}],"collocations":["uncircularised document","uncircularised memo","uncircularised information"],"synonyms":["undistributed","uncirculated","restricted","limited"],"antonyms":["circulated","distributed","public","widespread"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'circularised', which itself is derived from 'circular' (round or distributed to a circle of people).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsɜːrkjələraɪzd/","syllables":"un-cir-cu-lar-ised"},"inflection":{"notes":"Adjective; comparative and superlative forms (more uncircularised, most uncircularised) are possible, but rarely used."},"usage_notes":{"explanation":"'Uncircularised' is a relatively uncommon word. It describes something that has not been distributed widely or made available to a broad audience. It is often used in formal or technical contexts, such as in business or government, to indicate that a document or piece of information has been kept within a limited group of people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The news was uncircularised to everyone.","correct":"✓ The news was not circularised to everyone.","note":"'Uncircularised' describes the state of the document or information itself, not the action of preventing distribution. Using 'not circularised' is clearer in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["circularise (verb): to distribute widely","circularization (noun): the act of distributing widely","circular (adjective/noun): related to a circle or a document for wide distribution"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Uncircularised' is a technical term indicating that something has not been widely distributed. It's most often found in professional or bureaucratic settings where the distribution of information is carefully controlled. It is the opposite of 'circularised,' which means to distribute widely. Due to its specific and uncommon usage, it's considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The report was marked 'confidential' and remained uncircularised.","translation":"その報告書は「機密」とされ、回覧されなかった。","type":"adjective","meaning_category":"Not distributed"},{"sentence":"Due to its sensitive nature, the information was deliberately kept uncircularised.","translation":"その情報の機密性から、意図的に回覧されなかった。","type":"adjective","meaning_category":"Not distributed"}]}