{"word":"subharmonic","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"下位高調波、サブハーモニック","english_definition":"A frequency that is an integer fraction of a fundamental frequency.","examples":[{"sentence":"The subharmonic of a 100 Hz tone is 50 Hz.","translation":"100Hzの音の下位高調波は50Hzです。"},{"sentence":"Subharmonics can be used in music synthesis to create richer sounds.","translation":"下位高調波は、より豊かなサウンドを作成するために音楽合成で使用できます。"}],"collocations":["generate subharmonics","subharmonic oscillation","subharmonic frequency","subharmonic resonance"],"synonyms":["undertone","subfrequency"],"antonyms":["harmonic","overtone"]},{"part_of_speech":"adjective","definition":"下位高調波の","english_definition":"Relating to or having the characteristics of a subharmonic.","examples":[{"sentence":"The subharmonic component was clearly visible on the spectrum analyzer.","translation":"スペクトルアナライザで下位高調波成分がはっきりと見えました。"},{"sentence":"Subharmonic signals can be used in nonlinear optics.","translation":"下位高調波信号は非線形光学で使用できます。"}],"collocations":["subharmonic signal","subharmonic component","subharmonic generation"],"synonyms":["underharmonic"],"antonyms":["harmonic"]}],"etymology":{"value":"The term 'subharmonic' is formed by combining the prefix 'sub-' (meaning below or less than) with 'harmonic' (relating to harmonics or multiples of a fundamental frequency).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbhɑːrˈmɒnɪk/","syllables":"sub-har-mon-ic"},"inflection":{"notes":"Plural form: subharmonics"},"usage_notes":{"explanation":"A subharmonic is a frequency component that is an integer fraction (1/2, 1/3, 1/4, etc.) of the fundamental frequency. For example, if the fundamental frequency is 100 Hz, the subharmonics would be 50 Hz (1/2), 33.33 Hz (1/3), 25 Hz (1/4), and so on. Subharmonics are often found in nonlinear systems and can be used in various applications, such as music synthesis, signal processing, and nonlinear optics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subharmonic is higher than the fundamental frequency.","correct":"✓ The subharmonic is lower than the fundamental frequency.","note":"Subharmonics are always lower in frequency than the fundamental frequency."},{"incorrect":"✗ Subharmonics are integer multiples of the fundamental frequency.","correct":"✓ Subharmonics are integer fractions of the fundamental frequency.","note":"Harmonics are integer multiples, while subharmonics are integer fractions."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["fundamental frequency","harmonic","overtone","nonlinear optics","signal processing","frequency divider"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subharmonic' refers to a frequency that is a fraction (1/2, 1/3, 1/4, etc.) of a fundamental frequency. It is used in technical contexts such as music, physics, and engineering to describe signals and oscillations. Understanding this term requires familiarity with concepts like frequency, harmonics, and signal processing.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of a strong subharmonic indicated a nonlinearity in the system.","translation":"強い下位高調波の存在は、システムに非線形性があることを示していました。","type":"general","meaning_category":"general"},{"sentence":"Musicians can use subharmonics to create deeper, richer tones.","translation":"ミュージシャンは下位高調波を使って、より深く豊かな音色を作ることができます。","type":"music","meaning_category":"music"},{"sentence":"Subharmonic mixing is used in some radio receivers to improve sensitivity.","translation":"下位高調波ミキシングは、一部のラジオ受信機で感度を向上させるために使用されます。","type":"engineering","meaning_category":"engineering"}]}