{"word":"vasomotor","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"血管運動性の、血管運動神経の","english_definition":"Relating to or causing the constriction or dilation of blood vessels.","examples":[{"sentence":"Vasomotor nerves control the diameter of blood vessels.","translation":"血管運動神経は血管の直径を制御する。"},{"sentence":"Vasomotor instability can lead to symptoms like flushing and sweating.","translation":"血管運動の不安定は、ほてりや発汗などの症状につながる可能性がある。"}],"collocations":["vasomotor nerves","vasomotor center","vasomotor rhinitis","vasomotor instability","vasomotor control"],"synonyms":["angiotonic","vasoactive"],"antonyms":[],"notes":"Often used in the context of physiology and medicine."}],"etymology":{"value":"From vaso- (from Latin vas 'vessel') + motor (from Latin motor 'mover').","priority":"★★☆"},"pronunciation":{"ipa":"ˌveɪzoʊˈmoʊtər","syllables":"vay-zo-mo-ter"},"inflection":{},"usage_notes":{"explanation":"'Vasomotor' specifically describes something related to the nerves or mechanisms that control the constriction (narrowing) and dilation (widening) of blood vessels. It is commonly used in medical and physiological contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["vasomotility (noun): The ability of blood vessels to constrict or dilate.","vasoconstriction (noun): The narrowing of blood vessels.","vasodilation (noun): The widening of blood vessels."],"related_terms":["autonomic nervous system","sympathetic nervous system","parasympathetic nervous system"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'vasomotor' is a specialized term primarily used in medical and physiological contexts to describe the mechanisms controlling the constriction and dilation of blood vessels. Understanding requires familiarity with basic anatomy and physiology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The doctor suspected a vasomotor cause for the patient's persistent flushing.","translation":"医師は、患者の持続的なほてりの原因として血管運動性の原因を疑った。","type":"general"},{"sentence":"Certain drugs can have vasomotor effects, altering blood pressure.","translation":"特定の薬物は血管運動効果を持ち、血圧を変化させる可能性がある。","type":"medical"},{"sentence":"The vasomotor center in the brainstem plays a crucial role in regulating blood flow.","translation":"脳幹にある血管運動中枢は、血流の調節に重要な役割を果たす。","type":"physiological"}]}