{"word":"irritants","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"刺激物、炎症誘発物質、いらいらの原因","english_definition":"substances or things that cause irritation or annoyance.","examples":[{"sentence":"Pollution is a major source of respiratory irritants.","translation":"汚染は呼吸器系の主要な刺激物です。"},{"sentence":"He tried to eliminate all the irritants from his life.","translation":"彼は自分の生活からすべてのいらいらの原因を取り除こうとした。"},{"sentence":"Certain chemicals can act as skin irritants.","translation":"特定の化学物質は皮膚刺激物として作用する可能性があります。"}],"collocations":["skin irritants (皮膚刺激物)","respiratory irritants (呼吸器刺激物)","common irritants (一般的な刺激物)","avoid irritants (刺激物を避ける)","remove irritants (刺激物を取り除く)"],"synonyms":["stimulant","provocant","nuisance","annoyance","bother","pest"],"antonyms":["soother","calmative","reliever"]}],"etymology":{"value":"Derived from the verb 'irritate', which comes from Latin 'irritare' (to excite, provoke, annoy). The suffix '-ant' indicates something that causes or performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɪrɪtənts","syllables":"ir-ri-tants"},"inflection":{"noun_plural":"irritants"},"usage_notes":{"explanation":"'Irritants' refers to things that cause physical or emotional irritation. Physically, it often refers to substances that cause inflammation or discomfort when they come into contact with the body. Emotionally, it refers to things that cause annoyance or frustration. It is the plural form of 'irritant'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The irritant caused me to sneeze.","correct":"✓ The irritant caused me to sneeze.","note":"'Irritant' (singular) refers to one specific thing causing irritation. 'Irritants' (plural) refers to multiple things causing irritation."},{"incorrect":"✗ She was surrounded by irritant people.","correct":"✓ She was surrounded by irritating people.","note":"'Irritant' is a noun. Use 'irritating' (adjective) to describe people who cause irritation."}],"priority":"★★☆"},"related_words":{"derivatives":["irritate (verb: to annoy, provoke, or cause inflammation)","irritation (noun: the state of being annoyed or inflamed)","irritating (adjective: causing annoyance)","irritated (adjective: feeling annoyed)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., health, environment).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Irritants' are things that cause irritation. This word is often used in contexts related to health, environment, or personal well-being. It can refer to substances that cause physical discomfort, such as allergens or pollutants, or to things that cause annoyance or frustration in daily life. Understanding this word can help you discuss topics related to health, environmental issues, and personal stress management more effectively."},"example_sentences":[{"sentence":"Dust mites are common household irritants for allergy sufferers.","translation":"ダニはアレルギー患者にとって一般的な家庭内の刺激物です。","type":"noun","meaning_category":"刺激物 (アレルギー)"},{"sentence":"He tried to identify and eliminate the emotional irritants in his life.","translation":"彼は自分の生活の中で感情的な刺激物を特定し、排除しようとしました。","type":"noun","meaning_category":"いらいらの原因"},{"sentence":"The doctor recommended avoiding known skin irritants to reduce eczema flare-ups.","translation":"医師は湿疹の再発を減らすために、既知の皮膚刺激物を避けるように勧めました。","type":"noun","meaning_category":"刺激物 (皮膚)"}]}