{"word":"patokan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"Standard, benchmark, reference point, guideline, criterion","english_definition":"A standard, benchmark, or reference point used for comparison or evaluation; a guideline or criterion.","examples":[{"sentence":"Harga emas dunia menjadi patokan harga emas lokal.","translation":"The world gold price becomes the benchmark for local gold prices."},{"sentence":"Nilai ujian ini akan menjadi patokan untuk menilai kemampuan siswa.","translation":"This exam score will be the standard for evaluating students' abilities."},{"sentence":"Kita harus memiliki patokan yang jelas dalam menilai kinerja karyawan.","translation":"We must have clear guidelines in evaluating employee performance."}],"collocations":["menjadi patokan (to become a standard)","patokan harga (price benchmark)","patokan kualitas (quality standard)","patokan penilaian (assessment criteria)"],"synonyms":["standar","tolok ukur","kriteria","pedoman","ukuran"],"antonyms":[]}],"etymology":{"value":"Derived from the Indonesian word 'patok' which means 'stake' or 'marker'. The suffix '-an' is added to form a noun, indicating something that serves as a marker or reference point.","priority":"★★☆"},"pronunciation":{"ipa":"/paˈto.kan/","syllables":"pa-to-kan"},"inflection":{"noun_plural":"patokan-patokan","notes":"While 'patokan' is already a noun, it can be repeated for emphasis (patokan-patokan) to indicate multiple standards or benchmarks."},"usage_notes":{"explanation":"'Patokan' is used to refer to something that serves as a reference point or standard for evaluation. It is often used in contexts related to pricing, quality control, performance assessment, and other areas where objective criteria are needed. It implies a level of objectivity and is used to ensure consistency and fairness in evaluations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dia menggunakan 'contoh' sebagai patokan.","correct":"✓ Dia menggunakan 'standar' sebagai patokan.","note":"While 'contoh' (example) can be used for reference, 'standar' (standard) is a more appropriate synonym for 'patokan' when referring to a formal benchmark."}],"priority":"★★☆"},"related_words":{"derivatives":["mematok (to stake, to mark)","terpatok (staked, marked)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Common in formal and business contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Patokan' is a word that means a standard or reference point. It's used to measure or compare things. For example, if you want to know if something is good, you can compare it to a 'patokan' or standard. It's often used in formal situations, like in business or school."},"example_sentences":[{"sentence":"Perusahaan menetapkan standar keselamatan yang tinggi sebagai patokan.","translation":"The company sets high safety standards as a benchmark.","type":"noun","meaning_category":"Standard"},{"sentence":"IPK minimal 3.0 adalah patokan untuk melamar beasiswa ini.","translation":"A minimum GPA of 3.0 is the criterion for applying for this scholarship.","type":"noun","meaning_category":"Criterion"},{"sentence":"Harga minyak dunia menjadi patokan bagi harga BBM di Indonesia.","translation":"World oil prices serve as a reference point for fuel prices in Indonesia.","type":"noun","meaning_category":"Reference point"}]}