{"word":"prepricing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(小売業で)事前に価格を設定すること、または事前に価格が設定された状態","english_definition":"The act of setting a price on something before it is offered for sale, or the state of having a price set in advance.","examples":[{"sentence":"The store uses prepricing to streamline the checkout process.","translation":"その店は、チェックアウトプロセスを効率化するために事前価格設定を使用しています。"},{"sentence":"All items in the clearance section have prepricing labels.","translation":"クリアランスセクションのすべての商品には、事前価格設定のラベルが貼られています。"}],"collocations":["prepricing labels","prepricing system","automated prepricing"],"synonyms":["price setting","price labeling"],"antonyms":["dynamic pricing","variable pricing"]},{"part_of_speech":"verb","definition":"(小売業で)事前に価格を設定する","english_definition":"To set the price of something before it is offered for sale.","examples":[{"sentence":"We preprice all our merchandise before putting it on the shelves.","translation":"当店では、すべての商品を棚に並べる前に価格を設定します。"},{"sentence":"The company is prepricing its new line of products.","translation":"その会社は、新製品ラインの価格を事前に設定しています。"}],"collocations":["preprice merchandise","preprice inventory"],"synonyms":["price","label"],"antonyms":["price dynamically","adjust prices"]}],"etymology":{"value":"The word 'prepricing' is formed by combining the prefix 'pre-' (meaning 'before') with the word 'pricing' (the act of setting a price).","priority":"★★★"},"pronunciation":{"ipa":"/priːˈpraɪsɪŋ/","syllables":"pre-pric-ing"},"inflection":{"verb_forms":{"present_simple":["preprice","preprices"],"past_simple":"prepriced","past_participle":"prepriced","present_participle":"prepricing"}},"usage_notes":{"explanation":"'Prepricing' is commonly used in retail contexts to describe the practice of marking items with a price before they are displayed for sale. This can be done manually or through automated systems. It is often used to ensure consistent pricing and to speed up the checkout process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The prepricing was done after the sale.","correct":"✓ The prepricing was done before the sale.","note":"Prepricing, by definition, occurs before the sale."},{"incorrect":"✗ He is prepricing the product after it's sold.","correct":"✓ He is prepricing the product before it's sold.","note":"The action of prepricing must happen before the sale."}],"priority":"★★☆"},"related_words":{"derivatives":["price","pricing","pre-sale"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prepricing' refers to the practice of setting prices on products before they are offered for sale. This term is often used in retail and business contexts. Understanding this term helps in comprehending retail operations and pricing strategies."},"example_sentences":[{"sentence":"The advantage of prepricing is that it saves time at the cash register.","translation":"事前価格設定の利点は、レジでの時間を節約できることです。","type":"noun","meaning_category":"事前価格設定"},{"sentence":"They preprice all items to maintain price consistency.","translation":"彼らは価格の一貫性を保つために、すべての商品の価格を事前に設定します。","type":"verb","meaning_category":"事前に価格を設定する"}]}