{"word":"dochmiacal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(韻律学で)ドクミアス格の、ドクミアス詩形の","english_definition":"(prosody) of or pertaining to the dochmius; composed of dochmiuses.","examples":[{"sentence":"The poem contained several dochmiacal verses.","translation":"その詩にはいくつかのドクミアス詩形が含まれていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word 'δοχμιακός' (dokhmiakós), relating to the 'δοχμῖος' (dokhmîos), a type of metrical foot.","priority":"★★★"},"pronunciation":{"ipa":"/dɒkˈmaɪəkəl/","syllables":"doch-mi-a-cal"},"inflection":{},"usage_notes":{"explanation":"The term 'dochmiacal' is primarily used in the context of classical Greek and Latin prosody (the study of verse forms). It refers to verses or passages composed of 'dochmiuses', which are complex metrical feet typically associated with heightened emotional expression in dramatic poetry.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["dochmius (noun): a metrical foot consisting of five syllables, typically with a pattern of long and short syllables that varies.","dochmee (noun): rare variant of dochmius"],"related_terms":["prosody","meter","scansion","iambic","trochaic","dactylic","anapestic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. This term is highly specialized and rarely encountered outside of academic discussions of classical literature and linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'dochmiacal' is a highly specialized term used in the field of classical prosody, specifically when analyzing the metrical structure of ancient Greek and Latin poetry. Understanding this term requires familiarity with the concepts of metrical feet, scansion, and the conventions of classical verse. It is unlikely to be encountered outside of advanced academic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The chorus's lament was marked by a series of dochmiacal rhythms, conveying intense grief.","translation":"合唱隊の哀歌は、激しい悲しみを伝える一連のドクミアス律によって特徴づけられていた。","type":"adjective","meaning_category":"(韻律学で)ドクミアス格の"}]}