{"word":"foreclosable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律) 差し押さえ可能な、抵当権実行可能な","english_definition":"(of property) liable to be foreclosed on; subject to foreclosure.","examples":[{"sentence":"The property became foreclosable after the homeowner defaulted on their mortgage payments.","translation":"住宅所有者が住宅ローンの支払いを滞納した後、その物件は差し押さえ可能になった。"},{"sentence":"The bank determined that the loan was secured by foreclosable assets.","translation":"銀行は、そのローンが差し押さえ可能な資産によって担保されていると判断した。"}],"collocations":["foreclosable property","foreclosable asset","deemed foreclosable"],"synonyms":["seizable","attachable","lienable"],"antonyms":["non-foreclosable","unattachable","unseizable"]}],"etymology":{"value":"The word 'foreclosable' is derived from 'foreclose', which comes from the Anglo-French 'forclos', meaning 'excluded, barred'. This in turn comes from Old French 'forsclos', past participle of 'forsclore' meaning 'to shut out, exclude legally'. The suffix '-able' indicates the capability or suitability of being foreclosed.","priority":"★★★"},"pronunciation":{"ipa":"/fɔːrˈkloʊzəbəl/","syllables":"fore-clo-sa-ble"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. It can be modified by adverbs (e.g., 'easily foreclosable')."},"usage_notes":{"explanation":"'Foreclosable' is a relatively uncommon adjective used in legal and financial contexts to describe property or assets that can be subjected to foreclosure proceedings. Foreclosure is a legal process by which a lender takes possession of a property when the borrower fails to make mortgage payments. Therefore, if a property is 'foreclosable', it means the lender has the right to initiate foreclosure if the terms of the loan agreement are not met.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was foreclosed, so it is not foreclosable anymore.","correct":"✓ The house was foreclosed, so it is no longer subject to foreclosure.","note":"Once a property has been foreclosed, it is no longer in a state of being 'foreclosable'. The process has already occurred. Instead, describe the past action of foreclosure."},{"incorrect":"✗ Foreclosable is when you lose your house.","correct":"✓ Foreclosable describes a property that is at risk of being lost through foreclosure.","note":"'Foreclosable' describes the state of being at risk of foreclosure, not the act of losing the house itself."}],"priority":"★★☆"},"related_words":{"derivatives":["foreclose (verb)","foreclosure (noun)"],"related_terms":["mortgage","lien","default","repossession","eviction"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized legal/financial term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Foreclosable' is a specialized term primarily used in legal and financial contexts. Understanding this word requires familiarity with the concept of 'foreclosure,' which is the legal process a lender undertakes to seize property from a borrower who has defaulted on their loan. The term is used to describe property that is eligible for this process. It's not a word commonly used in everyday conversation but is important in discussions about real estate, mortgages, and financial law."},"example_sentences":[{"sentence":"Due to the unpaid property taxes, the land became foreclosable.","translation":"未払いの固定資産税のため、その土地は差し押さえ可能になった。","type":"adjective","meaning_category":"差し押さえ可能な"},{"sentence":"The bank reviewed the loan agreement to ensure that the collateral was indeed foreclosable.","translation":"銀行は、担保が実際に差し押さえ可能であることを確認するために、ローン契約を見直した。","type":"adjective","meaning_category":"差し押さえ可能な"},{"sentence":"If the business fails to meet its debt obligations, its assets may become foreclosable.","translation":"もし会社が債務を履行できない場合、その資産は差し押さえ可能になる可能性がある。","type":"adjective","meaning_category":"差し押さえ可能な"}]}