{"word":"shape-knife","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A knife used for shaping materials, such as clay, wood, or metal.","english_definition":"A knife specifically designed for shaping materials like clay, wood, or metal. The blade is often curved or angled to allow for precise carving and shaping.","examples":[{"sentence":"The potter used a shape-knife to refine the curves of the vase.","translation":"陶芸家は、ヘラを使って花瓶の曲線を修正した。"},{"sentence":"He carefully selected a shape-knife from his tool collection before starting the wood carving.","translation":"彼は木彫りを始める前に、道具箱から慎重にヘラを選んだ。"}],"collocations":["clay shape-knife","wood shape-knife","metal shape-knife","sculpting shape-knife","carving shape-knife"],"synonyms":["carving knife","sculpting knife","modeling knife","forming tool","shaping tool"],"antonyms":[]}],"etymology":{"value":"The word 'shape-knife' is a compound word formed by combining 'shape,' referring to the act of giving form to something, and 'knife,' the cutting tool.","priority":"N/A"},"pronunciation":{"ipa":"/ˈʃeɪpˌnaɪf/","syllables":"shape-knife"},"inflection":{"noun_plural":"shape-knives"},"usage_notes":{"explanation":"A shape-knife is a specialized tool used in various crafts and industries where precise shaping is required. It is not a general-purpose knife but rather a tool designed for a specific function. The design of the blade varies depending on the material being worked on.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a kitchen knife as a shape-knife.","correct":"✓ I used a shape-knife to carve the wood.","note":"A shape-knife is designed for specific shaping tasks and is different from a general kitchen knife."}],"priority":"N/A"},"related_words":{"derivatives":["shape","knife","shaping","carving","sculpting"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'shape-knife' is relatively specialized and would likely be encountered in contexts related to crafts, sculpting, or woodworking. Understanding its meaning requires some familiarity with these activities."},"example_sentences":[{"sentence":"The artist used a variety of shape-knives to create the intricate details in the sculpture.","translation":"アーティストは、彫刻の複雑なディテールを作成するために、さまざまなヘラを使用した。","type":"noun","meaning_category":"shaping tool"},{"sentence":"A shape-knife is essential for removing excess clay from the pottery wheel.","translation":"ヘラは、陶芸のロクロから余分な粘土を取り除くために不可欠だ。","type":"noun","meaning_category":"shaping tool"}]}