{"word":"dormancy-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"休眠に関連する、休眠期の、休眠状態の","english_definition":"Relating to or associated with a state of dormancy, in which normal physical functions are suspended or curtailed for a period.","examples":[{"sentence":"Dormancy-related genes are activated during the onset of winter.","translation":"休眠に関連する遺伝子は、冬の始まりに活性化されます。"},{"sentence":"The study focused on dormancy-related changes in plant metabolism.","translation":"その研究は、植物の代謝における休眠関連の変化に焦点を当てました。"},{"sentence":"Understanding dormancy-related mechanisms is crucial for crop management.","translation":"休眠関連のメカニズムを理解することは、作物管理にとって重要です。"}],"collocations":["dormancy-related genes (休眠関連遺伝子)","dormancy-related changes (休眠関連の変化)","dormancy-related mechanisms (休眠関連メカニズム)","dormancy-related proteins (休眠関連タンパク質)","dormancy-related processes (休眠関連プロセス)"],"synonyms":["quiescent","latent","inactive","resting","hibernating"],"antonyms":["active","growing","developing","germinating"]}],"etymology":{"value":"The term is formed by combining 'dormancy' (from the French 'dormance,' meaning 'sleeping') with '-related,' indicating a connection or association.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɔːrmənsi rɪˈleɪtɪd/","syllables":"dor-man-cy re-lat-ed"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Dormancy-related' is primarily used in scientific and technical contexts, particularly in biology, botany, and agriculture, to describe factors, processes, or characteristics associated with the state of dormancy in organisms such as plants, animals, and microorganisms. It is often used to specify genes, proteins, metabolic changes, or environmental cues that are involved in initiating, maintaining, or breaking dormancy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree is dormancy-related.","correct":"✓ The tree is in a state of dormancy.","note":"'Dormancy-related' describes something *associated with* dormancy, not the state itself. Use 'dormant' or 'in a state of dormancy' to describe the state directly."},{"incorrect":"✗ Dormancy-relate factors.","correct":"✓ Dormancy-related factors.","note":"Ensure correct spelling of 'related' with the '-ed' ending."}],"priority":"★★☆"},"related_words":{"derivatives":["dormancy (noun: 休眠)","dormant (adjective: 休眠中の)"],"phrases":["breaking dormancy (休眠打破)","entering dormancy (休眠に入る)","seed dormancy (種子休眠)","bud dormancy (芽の休眠)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dormancy-related' is a specialized term primarily found in scientific and technical contexts, particularly in fields like biology, botany, and agriculture. It describes factors, processes, or characteristics that are associated with the state of dormancy in organisms. Understanding this term requires familiarity with the concept of dormancy itself, which refers to a period of suspended or reduced physical activity. Due to its specific usage, it is more likely to be encountered in academic or professional reading materials rather than general texts."},"example_sentences":[{"sentence":"The researchers identified several dormancy-related proteins in the seeds.","translation":"研究者たちは種子の中でいくつかの休眠関連タンパク質を特定しました。","type":"adjective","meaning_category":"休眠に関連する"},{"sentence":"Environmental cues play a critical role in regulating dormancy-related gene expression.","translation":"環境的要因は、休眠関連遺伝子の発現を調節する上で重要な役割を果たします。","type":"adjective","meaning_category":"休眠に関連する"},{"sentence":"The study investigated the effects of temperature on dormancy-related metabolic pathways.","translation":"その研究では、温度が休眠関連の代謝経路に及ぼす影響を調査しました。","type":"adjective","meaning_category":"休眠に関連する"}]}