{"word":"injuriously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"有害に、不当に、中傷的に","english_definition":"in a harmful, unjust, or defamatory manner.","examples":[{"sentence":"He spoke injuriously of his former colleagues.","translation":"彼は以前の同僚を中傷的に語った。"},{"sentence":"The chemicals were used injuriously, causing damage to the environment.","translation":"その化学物質は有害に使用され、環境に損害を与えた。"},{"sentence":"The article injuriously misrepresented the facts.","translation":"その記事は事実を不当に歪曲した。"}],"collocations":["speak injuriously","act injuriously","use injuriously"],"synonyms":["harmfully","damagingly","detrimentally","prejudicially","unfairly","defamatorily","libelously","slanderously"],"antonyms":["beneficially","favorably","justly","fairly"]}],"etymology":{"value":"\"Injuriously\" is derived from the adjective \"injurious,\" which comes from the Latin word \"injuria\" meaning \"wrong, injustice, insult.\" The suffix \"-ly\" transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdʒʊəriəsli/","syllables":"in-jur-i-ous-ly"},"inflection":{"notes":"As an adverb, \"injuriously\" does not have different forms."},"usage_notes":{"explanation":"\"Injuriously\" describes the manner in which something is done that causes harm, injustice, or defamation. It emphasizes the damaging or unfair nature of the action. It is often used in formal or legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He injuriously hurt himself.","correct":"✓ He injured himself.","note":"\"Injurious\" describes the *manner* of an action, not the direct action itself. \"Injured\" is the correct verb to describe hurting oneself. "},{"incorrect":"✗ The injuriously effects were clear.","correct":"✓ The injurious effects were clear.","note":"\"Injuriously\" is an adverb and modifies a verb or adjective. To describe harmful effects, use the adjective \"injurious.\""}],"priority":"★★☆"},"related_words":{"derivatives":["injurious (adjective: harmful, causing injury)","injury (noun: harm or damage)","injure (verb: to cause harm or damage)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency"},"readability_explanation":{"level":"C1","text":"The word \"injuriously\" is a formal adverb that describes actions performed in a way that causes harm, injustice, or defamation. It is not commonly used in everyday conversation, but rather in more formal or legal contexts. Understanding this word requires a good grasp of vocabulary and the ability to recognize subtle differences in meaning between related words like \"injurious\" and \"injured.\""},"example_sentences":[{"sentence":"The defendant was accused of acting injuriously toward the plaintiff.","translation":"被告は原告に対して不当な行為をしたとして告発された。","type":"adverb","meaning_category":"Unjustly"},{"sentence":"The newspaper injuriously published false information about the politician.","translation":"その新聞は政治家に関する誤った情報を中傷的に掲載した。","type":"adverb","meaning_category":"Defamatorily"},{"sentence":"The company's practices were found to be operating injuriously to the local ecosystem.","translation":"その会社の慣行は、地域の生態系に有害に作用していることが判明した。","type":"adverb","meaning_category":"Harmfully"}]}