{"word":"achromatization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無彩色化、アクロマチゼーション：色を取り除く、または無彩色（白、黒、灰色）に変換するプロセス。","english_definition":"The process of removing color or converting something to achromatic colors (white, black, and gray).","examples":[{"sentence":"The achromatization of the old photograph gave it a timeless quality.","translation":"その古い写真の無彩色化は、それに時代を超越した品質を与えた。"},{"sentence":"Software can perform achromatization on digital images to create black and white versions.","translation":"ソフトウェアは、デジタル画像に対して無彩色化を実行して、白黒バージョンを作成できる。"}],"collocations":["image achromatization (画像の無彩色化)","digital achromatization (デジタル無彩色化)","partial achromatization (部分的な無彩色化)"],"synonyms":["desaturation","grayscale conversion","monochromatization"],"antonyms":["chromatization","colorization"]}],"etymology":{"value":"'Achromatization' derives from 'achromatic,' meaning without color, combined with the suffix '-ization,' which denotes a process or action. 'Achromatic' itself comes from the Greek 'a-' (without) + 'chroma' (color).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌkroʊmətɪˈzeɪʃən/","syllables":"a-chro-ma-ti-za-tion"},"inflection":{"noun_plural":"achromatizations"},"usage_notes":{"explanation":"'Achromatization' is primarily used in technical contexts such as image processing, optics, and art conservation. It refers specifically to the act of making something colorless or converting it to grayscale. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist used achromatization to add more color to the painting.","correct":"✓ The artist used achromatization to reduce the color in the painting.","note":"Achromatization reduces or removes color, it does not add color."}],"priority":"★★☆"},"related_words":{"derivatives":["achromatic (adjective: 無色の、アクロマチックの)","achromatism (noun: 無色性、アクロマチズム)","achromatize (verb: 無彩色化する、アクロマチズする)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Achromatization' is a technical term used in fields like image processing and art conservation. It refers to the process of removing color from an image or object, converting it to grayscale or black and white. Understanding this term requires familiarity with concepts of color theory and image manipulation."},"example_sentences":[{"sentence":"The photographer used achromatization to emphasize the textures in the landscape.","translation":"写真家は風景の質感を強調するために無彩色化を使用した。","type":"general","meaning_category":"色を取り除くプロセス"},{"sentence":"The software offers various options for achromatization, including different grayscale conversion algorithms.","translation":"このソフトウェアは、さまざまなグレースケール変換アルゴリズムを含む、無彩色化のためのさまざまなオプションを提供します。","type":"technical","meaning_category":"グレースケール変換"}]}