{"word":"Garlopa","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(道具)西洋鉋(かんな)の一種","english_definition":"A type of hand plane used in woodworking, typically longer than a smoothing plane, for flattening and straightening long boards.","examples":[{"sentence":"The carpenter used a garlopa to flatten the long plank of wood.","translation":"その大工は西洋鉋を使って長い木の板を平らにした。"}],"collocations":["use a garlopa","flatten with a garlopa","long garlopa","wooden garlopa"],"synonyms":["jointer plane","fore plane","try plane"],"antonyms":[]}],"etymology":{"value":"The etymology of \"garlopa\" is uncertain, but it is believed to be derived from the Old French word \"garlope,\" which referred to a type of woodworking plane.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡärˈlōpä/","syllables":"gar-lo-pa"},"inflection":{"noun_plural":"garlopas"},"usage_notes":{"explanation":"A garlopa is a specialized woodworking tool used for preparing long boards by creating a flat, straight surface. It is longer than other types of planes, which helps to average out imperfections in the wood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the garlopa for smoothing the small piece of wood.","correct":"✓ He used the smoothing plane for the small piece of wood.","note":"A garlopa is typically used for long boards, while a smoothing plane is used for smaller pieces."}],"priority":"★☆☆"},"related_words":{"derivatives":["planer","plane","woodworking"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"garlopa\" refers to a specialized woodworking tool. It is not a common word, and understanding its meaning requires some knowledge of woodworking tools and techniques. It is typically encountered in technical contexts related to carpentry or woodworking. A garlopa is a type of plane used for flattening long boards.","priority":"★★☆"},"example_sentences":[{"sentence":"The cabinet maker used a garlopa to ensure the table top was perfectly flat.","translation":"その家具職人は、テーブルの天板が完全に平らになるように西洋鉋を使った。","type":"noun","meaning_category":"tool"},{"sentence":"The antique garlopa was a prized possession of the woodworker.","translation":"そのアンティークの西洋鉋は、木工職人の大切な所有物だった。","type":"noun","meaning_category":"tool"}]}