{"word":"irrecusable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(law, formal) that cannot be rejected or refused; unchallengeable.","english_definition":"(law, formal) Not able to be refused or rejected; unchallengeable.","examples":[{"sentence":"The evidence presented was irrecusable, leaving no room for doubt.","translation":"提示された証拠は反論の余地がなく、疑いの余地を残さなかった。"},{"sentence":"The judge's decision was considered irrecusable by all parties involved.","translation":"裁判官の判決は、関係者全員から異議を唱えられないものと見なされた。"}],"collocations":["irrecusable evidence","irrecusable decision","irrecusable right"],"synonyms":["unchallengeable","incontrovertible","indisputable","unassailable","unquestionable","irrefutable"],"antonyms":["refutable","challengeable","disputable","questionable"]}],"etymology":{"value":"Formed from the prefix 'ir-' (not) + 'recusable' (able to be refused or challenged). 'Recusable' comes from the verb 'recuse,' meaning to challenge or reject, especially in a legal context.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌrɛkjuːzəbəl/","syllables":"ir-re-cu-sa-ble"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"'Irrecusable' is a formal and somewhat rare term, primarily used in legal contexts. It describes something that is so compelling or authoritative that it cannot be reasonably refused, rejected, or challenged. The term implies a high degree of certainty or validity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The irrecusable fact that he was there proved his guilt.","correct":"✓ The incontrovertible fact that he was there proved his guilt.","note":"'Incontrovertible' is a more common and widely understood synonym for 'irrecusable' in general usage."}],"priority":"★☆☆"},"related_words":{"derivatives":["recuse (verb): to challenge or reject, especially a judge or juror, as being unqualified to act.","recusation (noun): the act of recusing oneself."],"related_terms":["incontrovertible","indisputable","unassailable","unquestionable","irrefutable"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency - Primarily used in legal and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Irrecusable' is a highly formal and specialized term, primarily encountered in legal or academic writing. It signifies something that is so definitively established or authoritative that it is beyond reasonable challenge or rejection. Due to its rarity and formal nature, it is not typically used in everyday conversation. Understanding this word requires familiarity with legal terminology and a high level of English proficiency."},"example_sentences":[{"sentence":"The prosecution presented irrecusable evidence linking the defendant to the crime scene.","translation":"検察は、被告を犯罪現場に結びつける反論の余地のない証拠を提示した。","type":"adjective","meaning_category":"law, formal"},{"sentence":"The contract contained an irrecusable clause that protected the company's interests.","translation":"契約には、会社の利益を保護する異議を唱えられない条項が含まれていた。","type":"adjective","meaning_category":"law, formal"}]}