{"word":"unist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治)統一主義者、特にアイルランド統一主義者","english_definition":"(politics) A supporter of political union, especially of the union of Ireland with Great Britain.","examples":[{"sentence":"The unists celebrated the election results.","translation":"統一主義者たちは選挙結果を祝った。"},{"sentence":"The unist party advocates for maintaining the union.","translation":"統一主義政党は統一維持を主張している。"}],"collocations":["Irish unist","political unist"],"synonyms":["unionist"],"antonyms":["separatist","nationalist"]},{"part_of_speech":"adjective","definition":"統一主義の、特にアイルランド統一主義の","english_definition":"(politics) Supporting political union, especially of the union of Ireland with Great Britain.","examples":[{"sentence":"The unist perspective is often overlooked.","translation":"統一主義者の視点はしばしば見過ごされる。"},{"sentence":"The unist stance on the border issue is firm.","translation":"国境問題に対する統一主義者の立場は固い。"}],"collocations":["unist party","unist views"],"synonyms":["unionist"],"antonyms":["separatist","nationalist"]}],"etymology":{"value":"From 'union' + '-ist'. Primarily used in the context of Irish politics to describe those who support the union of Northern Ireland with the United Kingdom.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːnɪst/","syllables":"u-nist"},"inflection":{"noun_plural":"unists","notes":"The adjective form does not inflect."},"usage_notes":{"explanation":"'Unist' is primarily used in the context of Irish and British politics to describe someone who supports the union of Northern Ireland with the United Kingdom. It is closely related to the term 'unionist', and the two are often used interchangeably. However, 'unist' can also refer more broadly to anyone who supports political union in other contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a unist of the European Union.","correct":"✓ He is a supporter of the European Union.","note":"'Unist' is usually specific to the context of Irish/British politics. For the European Union, use 'supporter of the European Union' or 'pro-EU'."},{"incorrect":"✗ The unist party is very popular in the south of Ireland.","correct":"✓ The unist party is more popular in Northern Ireland.","note":"Unist parties are generally more popular in Northern Ireland, where there is a significant population that supports remaining part of the United Kingdom."}],"priority":"★★☆"},"related_words":{"derivatives":["unism (noun): The principle or policy of political union."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unist' is a specialized term primarily used in the context of Irish and British politics. It refers to someone who supports the union of Northern Ireland with the United Kingdom. Understanding this term requires familiarity with the political history and current issues of the region. It is not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"The **unist** community held a parade to celebrate their heritage.","translation":"統一主義者のコミュニティは、彼らの伝統を祝うパレードを開催した。","type":"noun","meaning_category":"supporter of political union"},{"sentence":"The **unist** politician argued for maintaining the current constitutional arrangements.","translation":"統一主義の政治家は、現在の憲法上の取り決めを維持することを主張した。","type":"adjective","meaning_category":"supporting political union"},{"sentence":"The debate focused on the future of Northern Ireland and the **unist** perspective.","translation":"討論は、北アイルランドの将来と統一主義者の視点に焦点を当てた。","type":"adjective","meaning_category":"supporting political union"},{"sentence":"Many **unists** feel that their cultural identity is tied to the United Kingdom.","translation":"多くの統一主義者は、彼らの文化的アイデンティティがイギリスと結びついていると感じている。","type":"noun","meaning_category":"supporter of political union"}]}