{"word":"work-and-twist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な) 糸紡ぎの仕事と娯楽を組み合わせた集まり","english_definition":"(historical) A gathering combining work (especially spinning) with entertainment.","examples":[{"sentence":"The historical society hosted a work-and-twist to demonstrate traditional spinning techniques.","translation":"歴史協会は、伝統的な糸紡ぎ技術を実演するために、ワーク・アンド・ツイストを開催しました。"}],"collocations":["attend a work-and-twist","host a work-and-twist"],"synonyms":["spinning bee","quilting bee"],"antonyms":[]}],"etymology":{"value":"The term combines the concepts of 'work' (referring to the spinning or other labor) and 'twist' (referring to the twisting of fibers to make thread, and perhaps also implying a social 'twist' or gathering).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrk ænd twɪst/","syllables":"work-and-twist"},"inflection":{"noun_plural":"work-and-twists"},"usage_notes":{"explanation":"'Work-and-twist' is a historical term, less commonly used today, referring to a social gathering centered around a productive activity like spinning or quilting. These events were often opportunities for socializing and entertainment alongside the work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a work and twist next week.","correct":"✓ I'm going to a work-and-twist next week.","note":"The term is typically hyphenated."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'work-and-twist' refers to a specific type of historical social gathering where people combined work, such as spinning or quilting, with entertainment. It's not a commonly used term in modern English, so understanding requires some historical context. The term itself is straightforward, combining 'work' and 'twist', but its meaning is specialized."},"example_sentences":[{"sentence":"The museum recreated a 19th-century work-and-twist, complete with period costumes and equipment.","translation":"博物館は、時代の衣装と道具を完備した19世紀のワーク・アンド・ツイストを再現しました。","type":"noun","meaning_category":"historical gathering"}]}