{"word":"Johnny-come-latelies","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新参者、後発組、最近になって現れた人たち (軽蔑的な意味合いを含む)","english_definition":"people who have only recently arrived in a place or joined an activity, especially if they try to change things that others have been doing for a long time (often used in a derogatory way).","examples":[{"sentence":"The established companies resented the Johnny-come-latelies who were trying to disrupt the market.","translation":"既存の企業は、市場を混乱させようとする新参者たちに不満を抱いていた。"},{"sentence":"All these Johnny-come-latelies think they know better than the people who have been working here for years.","translation":"これらの新参者は皆、長年ここで働いている人々よりも自分たちの方がよく知っていると思っている。"},{"sentence":"The locals viewed the new residents as Johnny-come-latelies who didn't understand the community's values.","translation":"地元住民は、新しい住民をコミュニティの価値観を理解していない新参者と見なした。"}],"collocations":["resent the Johnny-come-latelies","these Johnny-come-latelies think","view the new residents as Johnny-come-latelies"],"synonyms":["newcomers","upstarts","latecomers","recent arrivals","greenhorns"],"antonyms":["old-timers","veterans","long-term residents","established members"]}],"etymology":{"value":"この表現は、文字通りには「遅れて来たジョニーたち」を意味します。'Johnny' は一般的な名前として使われ、'come lately' は最近来た人を指します。このフレーズは、後から参加して、既存の秩序ややり方に挑戦する人々を軽蔑的に表現するために使われるようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɒni kʌm ˈleɪtliz/","syllables":"John-ny-come-late-lies"},"inflection":{"noun_plural":"Johnny-come-latelies"},"usage_notes":{"explanation":"「**Johnny-come-latelies**」は、新しく参加した人たち、特に既存のグループやコミュニティに最近加わった人たちを指す軽蔑的な表現です。これらの人々は、しばしば経験不足であるか、既存のやり方を尊重しないと見なされます。この言葉は、既存のメンバーが新しいメンバーに対して不満や軽蔑を抱いている状況でよく使われます。単数形は \"Johnny-come-lately\" ですが、複数形で使われることが一般的です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Johnny-come-lately in the company, so he knows everything.","correct":"✓ He is a Johnny-come-lately in the company, so he doesn't know much yet.","note":"「Johnny-come-lately」は、経験が浅く、知識が不足しているというニュアンスを含むため、文脈に注意が必要です。"},{"incorrect":"✗ The Johnny-come-latelies are very welcome in our club.","correct":"✓ The newcomers are very welcome in our club.","note":"「Johnny-come-latelies」は軽蔑的な意味合いを持つため、歓迎する場面では「newcomers」などのより中立的な言葉を使う方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低い (Relatively low frequency) - 特定の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Johnny-come-latelies**」は、ある場所や活動に最近参加した人々を指す、少し皮肉を込めた表現です。特に、古くからいる人たちが、新しく来た人たちを「経験が浅い」「既存のやり方を理解していない」と感じるときに使われます。例えば、昔からある会社に新しい人が入ってきて、すぐにいろいろと変えようとするときに、古くからいる社員がその新しい人たちを「Johnny-come-latelies」と呼ぶことがあります。この言葉は、新参者に対する不満や軽蔑の気持ちを表すときに使われることが多いです。"},"example_sentences":[{"sentence":"The long-time residents dismissed the new developers as Johnny-come-latelies who were only interested in making money.","translation":"長年の住民たちは、新しい開発業者を金儲けにしか興味がない新参者だと軽視した。","type":"noun","meaning_category":"新参者"},{"sentence":"The established artists saw the younger generation as Johnny-come-latelies who hadn't paid their dues.","translation":"ベテランのアーティストたちは、若い世代を苦労を知らない新参者だと見ていた。","type":"noun","meaning_category":"後発組"},{"sentence":"Many felt that the new regulations were being pushed by Johnny-come-latelies who didn't understand the industry's history.","translation":"多くの人が、新しい規制は業界の歴史を理解していない新参者によって推し進められていると感じていた。","type":"noun","meaning_category":"最近になって現れた人たち"}]}