{"word":"refractorily","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"手に負えないほどに、強情に、反抗的に","english_definition":"in a refractory manner; stubbornly or resistantly.","examples":[{"sentence":"The child behaved refractorily, refusing to listen to any instructions.","translation":"その子供は手に負えないほどに振る舞い、どんな指示にも従おうとしなかった。"},{"sentence":"He argued refractorily against the proposed changes, unwilling to compromise.","translation":"彼は妥協を拒み、提案された変更に対して強情に反論した。"}],"collocations":["behave refractorily","argue refractorily","respond refractorily"],"synonyms":["stubbornly","obstinately","intractably","rebelliously","defiant"],"antonyms":["obediently","compliantly","tractably","amenably"]}],"etymology":{"value":"\"refractory\" + \"-ly\". \"Refractory\" comes from Latin \"refractarius\" meaning \"stubborn, obstinate,\" from \"re-\" (again) + \"frangere\" (to break).","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈfræktərɪli/","syllables":"re-frac-to-ri-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Refractorily\" describes actions or behaviors that are stubbornly resistant to control or authority. It implies a deliberate unwillingness to yield or cooperate. It is not a commonly used word, and its use often suggests a high degree of resistance or defiance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The light refracted refractorily through the prism.","correct":"✓ The light refracted through the prism.","note":"\"Refractorily\" describes behavior, not optical phenomena. Use \"refract\" or \"refracts\" to describe how light bends. "},{"incorrect":"✗ He felt refractorily after the defeat.","correct":"✓ He felt refractory after the defeat.","note":"\"Refractorily\" is an adverb modifying a verb or adjective. To describe a state of being, use the adjective \"refractory.\""}],"priority":"★★☆"},"related_words":{"derivatives":["refractory (adjective)","refractoriness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refractorily' means acting in a stubborn or resistant way, refusing to obey or cooperate. It's not a common word, so you'll mostly find it in formal writing or when someone wants to strongly emphasize how uncooperative someone is being. It describes the manner in which someone is acting, highlighting their defiance or unwillingness to follow instructions or accept authority."},"example_sentences":[{"sentence":"The defendant answered the judge refractorily, showing no remorse for his actions.","translation":"被告は裁判官に対して反抗的に答え、自身の行動に対する後悔の念を全く示さなかった。","type":"adverb","meaning_category":"反抗的に"},{"sentence":"The machine continued to malfunction refractorily, despite repeated attempts to repair it.","translation":"その機械は、修理を繰り返しても強情に故障し続けた。","type":"adverb","meaning_category":"強情に"},{"sentence":"She refused to participate in the discussion, sitting refractorily in the corner.","translation":"彼女は議論への参加を拒否し、隅で手に負えない様子で座っていた。","type":"adverb","meaning_category":"手に負えないほどに"}]}