{"word":"glaucophyllous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"（植物学）青緑色の葉を持つ","english_definition":"(botany) Having bluish-green leaves.","examples":[{"sentence":"The glaucophyllous eucalyptus trees are a common sight in Australia.","translation":"青緑色の葉を持つユーカリの木は、オーストラリアではよく見られる光景です。"}],"collocations":["glaucophyllous leaves","glaucophyllous foliage"],"synonyms":["glaucous","blue-green"],"antonyms":["chlorophyllous","green"]},{"part_of_speech":"adjective","definition":"（一般的に）青緑色の","english_definition":"(generally) Of a bluish-green color.","examples":[{"sentence":"The glaucophyllous hue of the sea was mesmerizing.","translation":"その海の青緑色は、人を魅了した。"}],"collocations":["glaucophyllous color","glaucophyllous shade"],"synonyms":["blue-green","sea-green"],"antonyms":["red","yellow"]}],"etymology":{"value":"From the Ancient Greek words γλαυκός (glaukós) meaning \"bluish-green\" or \"grayish-blue\", and φύλλον (phúllon) meaning \"leaf\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡlɔːkoʊˈfɪləs/","syllables":"glau-co-phyl-lous"},"inflection":{"notes":"This word does not have common inflections beyond comparative/superlative forms (more glaucophyllous, most glaucophyllous), which are rarely used."},"usage_notes":{"explanation":"The term \"glaucophyllous\" is primarily used in botany to describe plants with leaves that have a bluish-green color due to a waxy coating on the leaf surface. This coating reduces water loss and protects the plant from UV radiation. While the term can be used more generally to describe anything that is bluish-green, it is most commonly encountered in botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The glaucophyllous sky was beautiful.","correct":"✓ The blue-green sky was beautiful.","note":"While 'glaucophyllous' can technically describe any bluish-green color, it's more appropriate in botanical contexts. Use 'blue-green' for general descriptions."}],"priority":"★☆☆"},"related_words":{"derivatives":["glaucous (adjective: having a powdery or waxy coating giving a bluish-green appearance)","phyllous (adjective: having leaves)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - a specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"glaucophyllous\" is a highly specialized term primarily used in botany. It describes plants that have leaves with a distinctive bluish-green color. This coloration is often due to a waxy coating on the leaf surface. Due to its specialized nature, this word is unlikely to be encountered outside of scientific or technical contexts related to plant biology. A more common synonym for general use would be \"blue-green.\""},"example_sentences":[{"sentence":"The glaucophyllous leaves of the succulent plant helped it to survive in the arid environment.","translation":"多肉植物の青緑色の葉は、乾燥した環境で生き残るのに役立った。","type":"adjective","meaning_category":"botanical"},{"sentence":"Botanists studied the glaucophyllous characteristics of the rare alpine flower.","translation":"植物学者は、その珍しい高山植物の青緑色の特徴を研究した。","type":"adjective","meaning_category":"botanical"}]}