{"word":"Molluscum","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"伝染性軟属腫","english_definition":"A viral skin infection that causes raised, pearly nodules or bumps.","examples":[{"sentence":"My child has molluscum contagiosum on their skin.","translation":"私の子どもは皮膚に伝染性軟属腫があります。"},{"sentence":"The doctor diagnosed the rash as molluscum.","translation":"医師はその発疹を伝染性軟属腫と診断しました。"}],"collocations":["molluscum contagiosum","treat molluscum","remove molluscum","molluscum infection"],"synonyms":["water warts"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'molluscus', meaning 'soft', referring to the soft, smooth appearance of the bumps.","priority":"★★★"},"pronunciation":{"ipa":"/məˈlʌskəm/","syllables":"mo-llus-cum"},"inflection":{"noun_plural":"molluscums"},"usage_notes":{"explanation":"Molluscum contagiosum is a common skin infection, especially in children. It is characterized by small, raised bumps on the skin. The condition is contagious and can be spread through direct contact or by sharing items.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a molluscum on my leg.","correct":"✓ I have molluscum contagiosum on my leg.","note":"While 'molluscum' is the base word, it's more common and precise to say 'molluscum contagiosum' when referring to the infection."}],"priority":"★★☆"},"related_words":{"derivatives":["molluscoid (adjective: resembling a mollusk)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Molluscum' refers to a specific skin condition, molluscum contagiosum, caused by a virus. The term itself is not commonly used in everyday conversation but is more often encountered in medical contexts or when discussing dermatology. Understanding the term implies a familiarity with medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The pediatrician confirmed it was just molluscum and not something more serious.","translation":"小児科医は、それがただの伝染性軟属腫であり、もっと深刻なものではないことを確認しました。","type":"medical","meaning_category":"skin infection"},{"sentence":"Treatment for molluscum often involves cryotherapy or topical creams.","translation":"伝染性軟属腫の治療には、しばしば凍結療法または外用クリームが用いられます。","type":"medical","meaning_category":"treatment"}]}