{"word":"nullipara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"未産婦、未経産婦","english_definition":"A woman who has never given birth to a child.","examples":[{"sentence":"She is a nullipara and is pregnant for the first time.","translation":"彼女は未産婦で、今回が初めての妊娠です。"},{"sentence":"The study focused on nulliparas to assess the risk factors for pre-eclampsia.","translation":"その研究は、子癇前症のリスク因子を評価するために未産婦に焦点を当てました。"}],"collocations":["primipara (初産婦)","multipara (経産婦)"],"synonyms":["never-pregnant woman"],"antonyms":["multipara","parous woman"]}],"etymology":{"value":"Derived from Latin: 'nulli-' meaning 'none' and '-para' from 'parere' meaning 'to give birth'.","priority":"★★☆"},"pronunciation":{"ipa":"/nʌˈlɪpərə/","syllables":"nul-lip-a-ra"},"inflection":{"noun_plural":"nulliparas"},"usage_notes":{"explanation":"'Nullipara' is a medical term used to describe a woman who has not carried a pregnancy to the point of viability (usually considered 20 weeks of gestation). It's important to note that a woman can be a nullipara even if she has been pregnant but the pregnancy did not result in a live birth (e.g., miscarriage, abortion).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a nullipara, so she has children.","correct":"✓ She is a nullipara, so she has no children.","note":"Nullipara means never having given birth, so she would not have children."}],"priority":"☆☆☆"},"related_words":{"derivatives":["nulliparous (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Nullipara' is a technical term used in medicine, specifically in obstetrics and gynecology. It refers to a woman who has never given birth to a viable infant. The term is used in medical records and research to distinguish between women who have and have not experienced childbirth, as this can influence various health outcomes and risks. Understanding this term is primarily relevant for those in healthcare or related fields."},"example_sentences":[{"sentence":"As a nullipara, she received extra counseling on labor and delivery.","translation":"未産婦である彼女は、分娩に関する追加のカウンセリングを受けました。","type":"general","meaning_category":"general"},{"sentence":"The study compared the incidence of postpartum depression in nulliparas and multiparas.","translation":"その研究は、未産婦と経産婦における産後うつ病の発生率を比較しました。","type":"medical","meaning_category":"medical"}]}