{"word":"Bloomerism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"女性の服装改革運動、特に、ゆったりとしたズボン（ブルーマーズ）をスカートの下に着用するスタイル","english_definition":"A style of women's clothing consisting of a short skirt worn over loose trousers, popularized in the 1850s by Amelia Bloomer; also, the movement advocating this style of dress.","examples":[{"sentence":"Bloomerism was a controversial fashion trend in the mid-19th century.","translation":"ブルーマリズムは19世紀半ばに物議を醸したファッショントレンドでした。"},{"sentence":"She was a strong advocate of Bloomerism, believing it offered women more freedom of movement.","translation":"彼女はブルーマリズムの強力な支持者であり、女性にもっと自由な動きを提供すると信じていました。"}],"collocations":["wear bloomers","advocate bloomerism","bloomer costume"],"synonyms":["rational dress","reform dress"],"antonyms":[]}],"etymology":{"value":"Amelia Bloomer (1818–1894), an American women's rights and temperance advocate, who promoted the style in her magazine, *The Lily*. Although she did not invent the style, her advocacy made it widely known.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbluːmərɪzəm/","syllables":"bloo-mer-ism"},"inflection":{"noun_plural":"Bloomerisms (rarely used)"},"usage_notes":{"explanation":"\"Bloomerism\" refers both to the style of dress (loose trousers under a short skirt) and the movement associated with advocating this style as a more practical and liberating alternative to traditional women's clothing of the 19th century. The term is somewhat historical and not commonly used in modern contexts, except when discussing the history of women's fashion and rights.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a bloomerism to the party.","correct":"✓ She wore bloomers to the party.","note":"While \"Bloomerism\" refers to the movement or style, the actual garment is \"bloomers\" (plural)."},{"incorrect":"✗ Bloomerism is a type of flower.","correct":"✓ Bloomerism is a style of dress reform.","note":"\"Bloomer\" (without the \"-ism\") can sometimes refer to a type of plant or animal that blooms, but \"Bloomerism\" specifically refers to the dress reform movement."}],"priority":"★★☆"},"related_words":{"derivatives":["bloomers (noun: the loose trousers worn as part of the Bloomerism style)","Bloomer (noun: a supporter of Bloomerism; short for Amelia Bloomer)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (historical term)","frequency_google_ngram":"Low frequency (historical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Bloomerism\" is a historical term referring to a 19th-century women's dress reform movement, named after Amelia Bloomer, who popularized the style of wearing loose trousers (called \"bloomers\") under a short skirt. Understanding this term requires some knowledge of 19th-century social history and the women's rights movement. It is not a commonly used word in contemporary English.","priority":"★★☆"},"example_sentences":[{"sentence":"The adoption of Bloomerism was seen as a radical statement by many women in the 1850s.","translation":"ブルーマリズムの採用は、1850年代の多くの女性にとって過激な声明と見なされました。","type":"noun","meaning_category":"dress reform movement"},{"sentence":"Early photographs show women proudly wearing the Bloomerism style of dress.","translation":"初期の写真には、ブルーマリズムのスタイルの服を誇らしげに着ている女性たちが写っています。","type":"noun","meaning_category":"style of dress"}]}