{"word":"Entelechial","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学)エンテレケイアの、目的因的な、潜在的なものが現実化する性質の","english_definition":"Relating to or characterized by entelechy; having the potential for development or realization.","examples":[{"sentence":"The entelechial principle suggests that every organism has an inherent drive to realize its full potential.","translation":"エンテレケイアの原理は、すべての生物がその潜在能力を最大限に発揮しようとする固有の衝動を持っていることを示唆している。"},{"sentence":"His entelechial vision of society involved a harmonious integration of individual and collective goals.","translation":"彼の社会に関するエンテレケイア的なビジョンは、個人と集団の目標が調和的に統合されることを意味していた。"}],"collocations":["entelechial principle","entelechial vision","entelechial development"],"synonyms":["teleological","purposeful","developmental","actualizing","realizing"],"antonyms":["potential","undeveloped","unrealized"]}],"etymology":{"value":"ギリシャ語の「entelekheia」（エンテレケイア）に由来する。アリストテレス哲学における概念で、「en」（内に）、「telos」（目的、目標）、「ekhein」（持つ、保つ）から構成され、「内に目的を持つもの」を意味する。潜在的なものが現実化する過程や、その過程を導く内在的な力、またはその現実化した状態を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛntɪˈlɛkiəl/","syllables":"en-te-le-chi-al"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「Entelechial」は、哲学、特にアリストテレス哲学において用いられる専門的な用語です。生物や物体が持つ潜在的な能力が現実化する過程、またはその能力自体を指します。日常会話で使われることは稀で、哲学、形而上学、生物学などの分野で、より厳密な議論を行う際に用いられます。潜在的なものが単に可能性として存在するだけでなく、実現に向かって内在的な力によって導かれるというニュアンスを含みます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The entelechial energy powered the machine.","correct":"✓ The machine's design allowed for entelechial development of its capabilities.","note":"「entelechial」はエネルギーの種類を指す言葉ではありません。能力が潜在的に持っている実現への性質を表します。"},{"incorrect":"✗ He had an entelechial feeling of sadness.","correct":"✓ He had a deep feeling of sadness.","note":"「entelechial」は感情の種類を指す言葉ではありません。感情が潜在的に持っている実現への性質を表すことは通常ありません。より一般的な感情を表す言葉を使用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["entelechy (名詞: エンテレケイア)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学、形而上学などの専門分野に限られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Entelechial**」は、アリストテレス哲学の「エンテレケイア」に関連する形容詞であり、非常に専門的な用語です。これは、何かが潜在的な状態から現実の状態へと発展する性質や、その発展を促す内在的な力を指します。この単語は、哲学、形而上学、生物学などの分野で、より高度な議論を行う際に使用されます。日常会話で使われることはほとんどありません。"},"example_sentences":[{"sentence":"The sculptor aimed to reveal the entelechial form hidden within the raw stone.","translation":"彫刻家は、荒削りの石の中に隠されたエンテレケイア的な形を明らかにしようとした。","type":"adjective","meaning_category":"エンテレケイアの"},{"sentence":"According to Aristotle, the entelechial nature of an acorn is to become an oak tree.","translation":"アリストテレスによれば、ドングリのエンテレケイア的な本質は、オークの木になることである。","type":"adjective","meaning_category":"目的因的な"},{"sentence":"The entelechial drive within the seed ensures its growth into a mature plant.","translation":"種子の中にあるエンテレケイア的な衝動が、成熟した植物への成長を保証する。","type":"adjective","meaning_category":"潜在的なものが現実化する性質の"}]}