{"word":"Heritabilities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(遺伝学) 遺伝率 (heritability の複数形)","english_definition":"Plural form of heritability: The proportion of phenotypic variation in a population that is attributable to genetic variation.","examples":[{"sentence":"The heritabilities of different traits vary greatly.","translation":"異なる形質の遺伝率は大きく異なる。"},{"sentence":"Estimates of heritabilities are population-specific.","translation":"遺伝率の推定値は、集団に特有である。"}],"collocations":["estimate heritabilities (遺伝率を推定する)","calculate heritabilities (遺伝率を計算する)","high heritabilities (高い遺伝率)","low heritabilities (低い遺伝率)"],"synonyms":["genetic determination","inheritability"],"antonyms":[],"notes":"Heritabilities are statistical measures that estimate the proportion of phenotypic variation due to genetic factors. They do not indicate the degree to which a trait is genetically determined in an individual."}],"etymology":{"value":"Derived from 'heritable' (capable of being inherited) + '-ity' (state or quality of being).","priority":"★★★"},"pronunciation":{"ipa":"/ˌherɪtəˈbɪlətiz/","syllables":"her-i-ta-bil-i-ties"},"inflection":{"noun_plural":"heritabilities"},"usage_notes":{"explanation":"'Heritabilities' refers to multiple estimates of heritability, which is a population-level statistic. It is important to note that heritability estimates are specific to a particular population and environment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heritability of this individual is high.","correct":"✓ The trait has high heritability in this population.","note":"Heritability is a population-level statistic, not an individual-level measure."},{"incorrect":"✗ High heritability means the trait is entirely determined by genes.","correct":"✓ High heritability means a large proportion of the variation in the trait is due to genetic factors, but environmental factors still play a role.","note":"Heritability does not imply complete genetic determinism."}],"priority":"★★☆"},"related_words":{"derivatives":["heritability","heritable","inherit","inheritance","genetics","phenotype","genotype"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in genetics and related fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heritabilities' is a technical term used in genetics. It refers to multiple estimates of the proportion of differences in a trait among individuals in a population that are due to genetic factors. This term is typically encountered in scientific literature related to genetics, evolution, and breeding. It is important to understand that heritability is a population-specific measure and does not indicate the degree to which a trait is genetically determined in an individual."},"example_sentences":[{"sentence":"The study compared the heritabilities of various agricultural traits across different breeds.","translation":"その研究では、異なる品種間で様々な農業形質の遺伝率を比較した。","type":"noun","meaning_category":"genetics"},{"sentence":"Researchers are investigating the heritabilities of complex diseases to better understand their genetic basis.","translation":"研究者たちは、複雑な疾患の遺伝的基盤をより良く理解するために、それらの遺伝率を調査している。","type":"noun","meaning_category":"genetics"}]}