{"word":"Exarchate","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"総主教代理区、府主教管区: 正教会における、総主教または府主教の代理が管轄する地域。","english_definition":"A territory or jurisdiction governed by an exarch, especially in the Eastern Orthodox Church.","examples":[{"sentence":"The Patriarch decided to establish a new Exarchate in the region.","translation":"総主教はその地域に新たな総主教代理区を設立することを決定した。"},{"sentence":"The Exarchate is responsible for the spiritual well-being of the Orthodox Christians in that country.","translation":"その総主教代理区は、その国の正教徒の精神的な幸福に責任を負っている。"}],"collocations":["establish an Exarchate (総主教代理区を設立する)","dissolve an Exarchate (総主教代理区を解散する)","head of the Exarchate (総主教代理区の長)"],"synonyms":["Patriarchal Vicariate","Metropolitanate"],"antonyms":[]}],"etymology":{"value":"Late Latin exarchatus, from Greek exarchos 'governor, leader', from exarkhein 'to begin, to rule over', from ex- 'out' + arkhein 'to rule'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛksɑːrkeɪt/","syllables":"Ex-ar-chate"},"inflection":{"noun_plural":"Exarchates"},"usage_notes":{"explanation":"The term 'Exarchate' is primarily used within the context of the Eastern Orthodox Church to denote a specific type of administrative division. It refers to a territory or group of churches under the direct authority of an exarch, who is a representative of a higher-ranking bishop, such as a patriarch or metropolitan. The establishment and governance of an exarchate are subject to the canons and regulations of the Orthodox Church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exarchate is a type of Catholic diocese.","correct":"✓ The exarchate is a type of administrative division in the Eastern Orthodox Church.","note":"Exarchates are specific to the Eastern Orthodox Church, not the Catholic Church."}],"priority":"★☆☆"},"related_words":{"derivatives":["exarch (noun: 総主教代理、府主教代理)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Exarchate' is a specialized term primarily used in the context of Eastern Orthodox Church administration. Understanding its meaning requires familiarity with the hierarchical structure of the Orthodox Church and its administrative divisions. It refers to a territory or group of churches governed by an exarch, who represents a higher-ranking bishop. Due to its specific and religious context, it is not commonly used in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The newly formed Exarchate aimed to strengthen the Orthodox faith in the diaspora.","translation":"新しく設立された総主教代理区は、在外の正教信仰を強化することを目指した。","type":"noun","meaning_category":"総主教代理区"},{"sentence":"The Exarchate reported directly to the Patriarch in Constantinople.","translation":"その総主教代理区は、コンスタンティノープルの総主教に直接報告した。","type":"noun","meaning_category":"総主教代理区"}]}