{"word":"haemotoxic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"血液毒性の、血液を害する","english_definition":"toxic to the blood","examples":[{"sentence":"The snake's venom is haemotoxic, causing damage to blood cells and tissues.","translation":"そのヘビの毒は血液毒性があり、血球や組織に損傷を与えます。"},{"sentence":"Haemotoxic effects can lead to internal bleeding and organ damage.","translation":"血液毒性の影響は、内出血や臓器損傷につながる可能性があります。"}],"collocations":["haemotoxic venom","haemotoxic snake","haemotoxic effects"],"synonyms":["hematotoxic"],"antonyms":["neurotoxic","cytotoxic"]}],"etymology":{"value":"Derived from the Greek words 'haemo-' (blood) and 'toxic' (poisonous).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈtɒksɪk/","syllables":"hee-mo-tox-ic"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Haemotoxic' specifically refers to substances that damage or destroy blood cells and/or interfere with blood clotting. It is often used in the context of snake venom, but can also apply to other toxins. It is distinct from 'neurotoxic', which affects the nervous system, and 'cytotoxic', which is toxic to cells in general.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The poison was haemotoxic to the brain.","correct":"✓ The poison was neurotoxic to the brain.","note":"Haemotoxic refers to blood, neurotoxic refers to the nervous system."}],"priority":"★★☆"},"related_words":{"derivatives":["haemotoxin (noun): a toxin that destroys red blood cells or disrupts blood clotting."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haemotoxic' is a specialized term used in biology, medicine, and related fields to describe substances that are poisonous to blood. It is relatively rare in general conversation but important in technical contexts. Understanding the term requires knowledge of basic biology and toxicology.","priority":"★★☆"},"example_sentences":[{"sentence":"The effects of the haemotoxic venom were evident in the patient's blood tests.","translation":"血液毒性のある毒の影響は、患者の血液検査で明らかでした。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the haemotoxic properties of certain plant extracts.","translation":"研究者たちは、特定の植物抽出物の血液毒性特性を研究しています。","type":"research","meaning_category":"research"}]}