{"word":"dystrophic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"栄養障害の、ジストロフィー性の","english_definition":"Relating to or affected by dystrophy, especially muscular dystrophy; characterized by defective nutrition or metabolism.","examples":[{"sentence":"The patient exhibited dystrophic changes in their muscles.","translation":"患者は筋肉にジストロフィー性の変化を示した。"},{"sentence":"Dystrophic lakes are often characterized by low nutrient levels and high acidity.","translation":"栄養不良の湖は、しばしば低い栄養レベルと高い酸性度を特徴とする。"}],"collocations":["dystrophic muscle","dystrophic lake","dystrophic changes"],"synonyms":["atrophic","malnourished","degenerate"],"antonyms":["eutrophic","healthy","well-nourished"]}],"etymology":{"value":"From the prefix 'dys-' (bad, difficult) + 'trophic' (relating to nutrition or growth), ultimately from Greek 'dys' (bad) and 'trophē' (nourishment).","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈstrɒfɪk/","syllables":"dis-tro-phic"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"'Dystrophic' is primarily used in medical and ecological contexts. In medicine, it often refers to muscular dystrophy or other conditions characterized by tissue degeneration due to poor nutrition or metabolism. In ecology, it describes environments (like lakes) with poor nutrient availability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant was dystrophic because it was watered too much.","correct":"✓ The plant was unhealthy because it was watered too much.","note":"'Dystrophic' implies a nutritional or metabolic problem, not simply being overwatered."},{"incorrect":"✗ He felt dystrophic after a long day of work.","correct":"✓ He felt fatigued after a long day of work.","note":"'Dystrophic' describes a medical or ecological condition, not general fatigue."}],"priority":"★★☆"},"related_words":{"derivatives":["dystrophy (noun): a degenerative disorder caused by inadequate nutrition or metabolism."],"related_terms":["muscular dystrophy","eutrophic","oligotrophic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dystrophic' is a technical term primarily used in medical and ecological contexts. It describes conditions characterized by poor nutrition, defective metabolism, or degenerative changes. Understanding its usage requires familiarity with these specific fields."},"example_sentences":[{"sentence":"The biopsy revealed dystrophic features in the muscle tissue.","translation":"生検で筋肉組織にジストロフィー性の特徴が認められた。","type":"medical","meaning_category":"ジストロフィー性の"},{"sentence":"Dystrophic lakes are typically acidic and have low biodiversity.","translation":"栄養不良の湖は通常酸性で、生物多様性が低い。","type":"ecological","meaning_category":"栄養障害の"}]}