{"word":"uninductive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"帰納的でない、帰納法に基づかない","english_definition":"Not inductive; not based on or arrived at by induction.","examples":[{"sentence":"The argument presented was uninductive, relying instead on deductive reasoning.","translation":"提示された議論は帰納的ではなく、代わりに演繹的推論に依存していた。"},{"sentence":"An uninductive approach to problem-solving may involve applying pre-existing rules rather than observing patterns.","translation":"問題解決への非帰納的アプローチは、パターンを観察するのではなく、既存のルールを適用することを含む場合がある。"}],"collocations":["uninductive reasoning","uninductive argument","uninductive approach"],"synonyms":["deductive","non-empirical","theoretical"],"antonyms":["inductive","empirical","experimental"]}],"etymology":{"value":"The word \"uninductive\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"inductive.\" \"Inductive\" itself comes from the Latin word \"inductio,\" meaning \"a leading in.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪnˈdʌktɪv/","syllables":"un-in-duc-tive"},"inflection":{"notes":"Since it is an adjective, it can form comparative and superlative degrees, though these are not commonly used: more uninductive, most uninductive."},"usage_notes":{"explanation":"\"Uninductive\" is used to describe methods of reasoning or approaches that do not rely on inductive principles. Inductive reasoning involves drawing general conclusions from specific observations or data. Therefore, something that is uninductive would use a different method, such as deduction (reasoning from general principles to specific cases) or pure theory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uninductive oven failed to heat the food evenly.","correct":"✓ The non-convection oven failed to heat the food evenly.","note":"\"Uninductive\" is specifically related to reasoning or methods, not physical processes. Use \"non-convection\" instead if referring to an oven that doesn't use convection heating."},{"incorrect":"✗ His uninductive behavior was confusing.","correct":"✓ His unpredictable/illogical behavior was confusing.","note":"\"Uninductive\" is a technical term. If referring to general behavior that is not guided by experience, use more common words like \"unpredictable\" or \"illogical.\""}],"priority":"★★☆"},"related_words":{"derivatives":["uninductively"],"related_terms":["induction","inductive","deductive","reasoning","logic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"uninductive\" is a specialized term primarily used in the context of logic, philosophy, and scientific methodology. It describes something that does not use inductive reasoning, which is the process of making generalizations based on specific observations. Understanding this word requires familiarity with different types of reasoning and the principles of logic."},"example_sentences":[{"sentence":"The philosophical argument was criticized for being uninductive and lacking empirical support.","translation":"その哲学的議論は、帰納的でなく、経験的裏付けを欠いているとして批判された。","type":"adjective","meaning_category":"Not based on induction"},{"sentence":"An uninductive approach to mathematics might focus on axioms and theorems rather than real-world examples.","translation":"数学への非帰納的アプローチは、現実世界の例よりも公理や定理に焦点を当てるかもしれない。","type":"adjective","meaning_category":"Not using inductive methods"}]}