{"word":"critical-gazed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having a critical gaze; characterized by a scrutinizing and judgmental look.","english_definition":"Having or showing a tendency to find fault or to judge harshly.","examples":[{"sentence":"The professor gave the student's essay a critical-gazed reading, marking numerous errors.","translation":"教授は学生のエッセイを批判的な視線で読み、多くの誤りを指摘した。"},{"sentence":"The art critic's critical-gazed review of the exhibition was scathing.","translation":"美術評論家の展示会に対する批判的な視線でのレビューは手厳しかった。"},{"sentence":"She gave the proposal a critical-gazed assessment, pointing out several potential weaknesses.","translation":"彼女は提案を批判的な視線で評価し、いくつかの潜在的な弱点を指摘した。"}],"collocations":["critical-gazed assessment","critical-gazed review","critical-gazed reading","critical-gazed examination","critical-gazed eye"],"synonyms":["scrutinizing","judgmental","discerning","analytical","evaluative","censorious","faultfinding"],"antonyms":["approving","accepting","uncritical","complimentary","laudatory","praising"]}],"etymology":{"value":"The word is formed by combining \"critical\" (expressing adverse or disapproving comments or judgments) with \"gazed\" (having a fixed or intent look).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkrɪtɪkəl ɡeɪzd/","syllables":"crit-i-cal-gazed"},"inflection":{"adjective_forms":{"comparative":"more critical-gazed","superlative":"most critical-gazed"}},"usage_notes":{"explanation":"\"Critical-gazed\" describes someone who looks at something or someone with a very critical eye. It implies a detailed and often negative evaluation. The term is not commonly used, and might be considered somewhat formal or literary.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The critical-gazed dog stared at the mailman.","correct":"The dog stared critically at the mailman.","note":"Dogs don't typically have critical gazes in the human sense. Use 'critically' instead."},{"incorrect":"He critical-gazed the situation.","correct":"He gave the situation a critical gaze.","note":"\"Critical-gazed\" is an adjective, not a verb. Use it to describe a noun (e.g., a critical-gazed look)."}],"priority":"N/A"},"related_words":{"derivatives":["critical","gaze","critically","gazing"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is not widely used.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"\"Critical-gazed\" is a compound adjective describing a look or assessment characterized by a tendency to find fault or judge harshly. It suggests a scrutinizing and often negative evaluation. Due to its relatively low frequency and somewhat formal tone, it is more likely to be encountered in advanced or literary contexts."},"example_sentences":[{"sentence":"With a critical-gazed expression, the judge listened to the lawyer's arguments.","translation":"批判的な視線をたたえた表情で、裁判官は弁護士の主張に耳を傾けた。","type":"adjective","meaning_category":"judgmental look"},{"sentence":"The editor gave the manuscript a critical-gazed review before publishing it.","translation":"編集者は原稿を出版する前に、批判的な視線でのレビューを行った。","type":"adjective","meaning_category":"scrutinizing assessment"},{"sentence":"The architect studied the blueprints with a critical-gazed eye, searching for potential flaws.","translation":"建築家は潜在的な欠陥を探すため、批判的な視線で設計図を調べた。","type":"adjective","meaning_category":"evaluative examination"}]}