{"word":"was-was","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Islam) Whispers or suggestions from the devil (Shaitan) or from one's own lower self (nafs) that lead to doubt, confusion, or negative thoughts, particularly regarding faith and worship.","english_definition":"(Islam) Whispers or suggestions from the devil (Shaitan) or from one's own lower self (nafs) that lead to doubt, confusion, or negative thoughts, particularly regarding faith and worship.","examples":[{"sentence":"He struggled with was-was during his prayers, constantly doubting his intentions.","translation":"彼は祈りの最中にワスワスに苦しみ、常に自分の意図を疑っていた。"},{"sentence":"Seeking knowledge and strengthening faith are ways to combat was-was.","translation":"知識を求め、信仰を強めることは、ワスワスと戦う方法である。"}],"collocations":["struggle with was-was","combat was-was","overcome was-was","source of was-was"],"synonyms":["temptation","doubt","whispers","evil suggestion"],"antonyms":["certainty","faith","conviction"]}],"etymology":{"value":"Derived from the Arabic word 'وسوس' (waswasa), which means 'to whisper,' 'to suggest,' or 'to insinuate.' The repetition 'was-was' emphasizes the persistent and insidious nature of these whispers.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɑːs.wɑːs/","syllables":"was-was"},"inflection":{"notes":"Plural form is 'was-was' (the term is often used in a non-count manner)."},"usage_notes":{"explanation":"'Was-was' is a term primarily used within Islamic contexts to describe intrusive thoughts, doubts, or temptations that originate from external (Shaitan) or internal (nafs) sources. It is often associated with obsessive-compulsive tendencies, anxiety, and religious scrupulosity. Recognizing was-was and seeking appropriate religious or psychological guidance is considered important for maintaining spiritual well-being.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a was-was about cleanliness.","correct":"✓ He experiences was-was related to cleanliness.","note":"'Was-was' refers to the experience of intrusive thoughts, not a general feeling or attribute. Therefore, it's more accurate to say someone 'experiences was-was' or 'struggles with was-was' rather than saying they 'have a was-was.'"},{"incorrect":"✗ Was-was is a mental illness.","correct":"✓ Was-was can contribute to mental distress and may be associated with conditions like OCD or anxiety.","note":"While was-was can be a source of significant distress and may overlap with symptoms of mental health conditions, it is primarily understood as a spiritual or religious challenge within the Islamic tradition. It's important to avoid equating it directly with a clinical diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily within Islamic religious texts and discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Was-was' is a term specific to Islamic discourse, referring to insidious whispers or suggestions that cause doubt or confusion, especially in matters of faith. Understanding this term requires familiarity with Islamic concepts of Shaitan (devil) and nafs (lower self). The term is often used in discussions about spiritual purification and overcoming negative influences. Due to its specialized context, it is not typically encountered in general English conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The scholar explained how to differentiate between genuine spiritual insights and was-was.","translation":"学者は、真の霊的な洞察とワスワスを区別する方法を説明した。","type":"noun","meaning_category":"Islamic concept"},{"sentence":"Reciting certain prayers is believed to ward off was-was.","translation":"特定の祈りを唱えることは、ワスワスを追い払うと信じられている。","type":"noun","meaning_category":"Islamic concept"},{"sentence":"He sought guidance from a religious leader to deal with the persistent was-was affecting his worship.","translation":"彼は礼拝に影響を与える持続的なワスワスに対処するために、宗教指導者に指導を求めた。","type":"noun","meaning_category":"Islamic concept"}]}