{"word":"yellow-armed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"黄色い腕をした、または黄色い腕を持つ","english_definition":"Having yellow arms. This could describe someone whose arms are painted yellow, or someone with a skin condition that makes their arms appear yellow. It can also be used figuratively.","examples":[{"sentence":"The clown was yellow-armed and wore a bright red nose.","translation":"その道化師は黄色い腕をしており、真っ赤な鼻をつけていた。"},{"sentence":"The artist painted a yellow-armed figure in the center of the canvas.","translation":"その画家はカンバスの中央に黄色い腕の人物を描いた。"},{"sentence":"(Figurative) The old pirate was described as yellow-armed from years of sailing in the sun.","translation":"(比喩的に) その老海賊は、長年太陽の下で航海していたため、黄色い腕をしていると描写された。"}],"collocations":["yellow-armed clown","yellow-armed figure","yellow-armed pirate"],"synonyms":["yellow-limbed","jaundiced-armed"],"antonyms":["normal-armed","pink-armed"],"notes":"The term is rare and often used in descriptive or creative writing."}],"etymology":{"value":"Compound word formed by combining the adjective 'yellow' and the adjective 'armed'. 'Yellow' refers to the color, and 'armed' describes the part of the body.","priority":"★★★"},"pronunciation":{"ipa":"/ˈjɛloʊ ɑːrmd/","syllables":"yel-low-armed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The adjective 'yellow-armed' is a descriptive term that is not commonly used. It is most likely to be found in fictional or descriptive contexts where the author wishes to emphasize the unusual color of someone's arms. It can also be used metaphorically to suggest illness or a particular lifestyle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a yellow-arm.","correct":"✓ He is yellow-armed.","note":"'Yellow-armed' is an adjective, so it should be used to describe a noun, not as a noun itself."}],"priority":"★★☆"},"related_words":{"derivatives":["yellow (adjective, noun)","arm (noun, verb)"],"related_terms":["yellowish","yellow-skinned","armed (adjective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'yellow-armed' is not a common expression and would likely be encountered in descriptive or literary contexts. Understanding requires a good vocabulary and the ability to interpret compound adjectives."},"example_sentences":[{"sentence":"The alien creature was yellow-armed and had three eyes.","translation":"その異星人は黄色い腕をしており、目が3つあった。","type":"descriptive","meaning_category":"description"},{"sentence":"The yellow-armed statue stood in the center of the courtyard.","translation":"黄色い腕の像が中庭の中央に立っていた。","type":"descriptive","meaning_category":"description"}]}