{"word":"Shintoism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神道","english_definition":"A Japanese religion incorporating the worship of ancestors and nature spirits and a belief in sacred power (kami) in both animate and inanimate things.","examples":[{"sentence":"Shintoism is one of the major religions in Japan.","translation":"神道は日本における主要な宗教の一つです。"},{"sentence":"Many Japanese people practice both Shintoism and Buddhism.","translation":"多くの日本人は神道と仏教の両方を信仰しています。"},{"sentence":"Shintoism emphasizes the importance of purity and harmony with nature.","translation":"神道は純粋さと自然との調和の重要性を強調しています。"}],"collocations":["Shinto shrine (神社)","Shinto priest (神主)","Shinto rituals (神道の儀式)","practice Shintoism (神道を信仰する)"],"synonyms":["Shinto","Japanese native religion"],"antonyms":["(Abrahamic religions such as) Christianity, Islam, Judaism"],"related_terms":["kami (神)","torii (鳥居)","miko (巫女)","Matsuri (祭り)"]},{"part_of_speech":"noun","definition":"神道（の体系）","english_definition":"The system of beliefs and practices associated with Shinto.","examples":[{"sentence":"The principles of Shintoism are deeply rooted in Japanese culture.","translation":"神道の原則は日本の文化に深く根ざしています。"},{"sentence":"Shintoism has evolved over centuries, incorporating various local beliefs and practices.","translation":"神道は何世紀にもわたって進化し、様々な地域の信仰や慣習を取り入れてきました。"}],"collocations":["Shinto mythology (神道の神話)","Shinto philosophy (神道の哲学)","Shinto theology (神道の神学)"],"synonyms":["Shinto","Shinto religion"],"antonyms":[]}],"etymology":{"value":"From Japanese 神道 (Shintō), from Middle Chinese 神 (ɕiɪn, “god, spirit”) + 道 (dɑu, “way, path, doctrine”).","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃɪntoʊɪzəm/","syllables":"Shin-to-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Shintoism' refers to the religion itself, its beliefs, and practices. It's often used interchangeably with 'Shinto,' although 'Shinto' can also refer more broadly to the cultural practices and shrines associated with the religion. It is a native religion of Japan, deeply intertwined with Japanese culture and history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to a Shintoism last week.","correct":"✓ I went to a Shinto shrine last week.","note":"'Shintoism' is the religion itself, not a place. Use 'Shinto shrine' to refer to the physical place of worship."},{"incorrect":"✗ He is a Shintoism.","correct":"✓ He is a Shinto priest. / ✓ He practices Shintoism.","note":"'Shintoism' is the religion. Use 'Shinto priest' to refer to a person who practices the religion professionally, or 'He practices Shintoism' to describe someone's religious affiliation."}],"priority":"★★☆"},"related_words":{"derivatives":["Shinto (noun, adjective)","Shintoist (noun, adjective)"],"phrases":["Shinto shrine","Shinto priest","Shinto rituals"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but commonly used in discussions about Japanese culture and religion.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Shintoism' is a term referring to the indigenous religion of Japan. It involves the worship of kami (spirits or deities) and emphasizes harmony with nature and purity. While not as frequently used in everyday conversation as more common words, it is important for understanding Japanese culture and history. You'll often encounter it in discussions about religion, culture, or travel in Japan."},"example_sentences":[{"sentence":"Many traditional Japanese festivals are rooted in Shintoism.","translation":"多くの日本の伝統的な祭りは神道に根ざしています。","type":"general","meaning_category":"General"},{"sentence":"The torii gate marks the entrance to a Shinto shrine.","translation":"鳥居は神社の入り口を示しています。","type":"related term","meaning_category":"Related Term"},{"sentence":"Shintoism has no founder or single sacred text.","translation":"神道には創始者や単一の聖典はありません。","type":"characteristic","meaning_category":"Characteristic"},{"sentence":"Respect for ancestors is a key aspect of Shintoism.","translation":"祖先崇拝は神道の重要な側面です。","type":"belief","meaning_category":"Belief"}]}