{"word":"monosexual","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一の性別に対してのみ性的または恋愛的な魅力を感じる、または単一の性別としか性的または恋愛的な関係を持たないこと。","english_definition":"experiencing sexual or romantic attraction to members of only one sex or gender.","examples":[{"sentence":"While many people identify as bisexual or pansexual, others are strictly monosexual.","translation":"バイセクシュアルやパンセクシュアルを自認する人が多い一方で、厳密にモノセクシュアルの人もいます。"},{"sentence":"Heterosexuality and homosexuality are both forms of monosexuality.","translation":"異性愛と同性愛はどちらもモノセクシュアリティの一形態です。"}],"collocations":["monosexual orientation","monosexual identity","monosexual relationship"],"synonyms":["heterosexual","homosexual"],"antonyms":["bisexual","pansexual","polysexual","omnisexual"]},{"part_of_speech":"noun","definition":"単一の性別に対してのみ性的または恋愛的な魅力を感じる人。","english_definition":"a person who experiences sexual or romantic attraction to members of only one sex or gender.","examples":[{"sentence":"Monosexuals may face unique challenges in a society that is becoming more accepting of diverse sexual orientations.","translation":"モノセクシュアルの人は、多様な性的指向を受け入れるようになっている社会において、特有の課題に直面する可能性があります。"}],"collocations":[],"synonyms":["heterosexual","homosexual"],"antonyms":["bisexual","pansexual","polysexual","omnisexual"]}],"etymology":{"value":"「mono-」(単一の) + 「sexual」(性的な)の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnəˈsekʃuəl/","syllables":"mon-o-sex-u-al"},"inflection":{"notes":"名詞としても形容詞としても使われます。"},"usage_notes":{"explanation":"「monosexual」は、性的指向を表す用語で、単一の性別（男性または女性）にのみ性的または恋愛的な魅力を感じる人を指します。異性愛者（異性のみに惹かれる）と同性愛者（同性のみに惹かれる）は、どちらもモノセクシュアルです。この用語は、バイセクシュアル、パンセクシュアル、ポリセクシュアルなど、複数の性別に惹かれる性的指向と区別するために使われます。近年、LGBTQ+コミュニティ内で、性的指向の多様性をより正確に表現するために使用されることが増えています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Monosexual people are always heterosexual.","correct":"✓ Monosexual people can be heterosexual or homosexual.","note":"モノセクシュアルは異性愛者と同性愛者の両方を含みます。"},{"incorrect":"✗ Monosexuality is the same as being straight.","correct":"✓ Being straight (heterosexual) is a type of monosexuality.","note":"「ストレート」であることは異性愛を指し、異性愛はモノセクシュアリティの一種です。"},{"incorrect":"✗ Monosexuals are not part of the LGBTQ+ community.","correct":"✓ Some monosexuals may identify with the LGBTQ+ community, particularly if they experience discrimination or marginalization due to their sexual orientation.","note":"モノセクシュアルの人でも、性的指向を理由に差別や疎外を経験した場合、LGBTQ+コミュニティに共感したり、参加したりすることがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["monosexuality"],"phrasal_verbs":[],"related_terms":["heterosexual","homosexual","bisexual","pansexual","polysexual","omnisexual","sexual orientation","LGBTQ+"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈やLGBTQ+関連の議論で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**monosexual**」は、ある人が1つの性別の人だけに性的または恋愛的な魅力を感じることを意味する言葉です。異性愛者（異性だけに惹かれる人）と同性愛者（同性だけに惹かれる人）は、どちらもモノセクシュアルです。この言葉は、複数の性別の人に惹かれるバイセクシュアルやパンセクシュアルの人たちと区別するために使われます。性的指向について話すときに使う、少し専門的な言葉です。"},"example_sentences":[{"sentence":"The study focused on the experiences of monosexual individuals in the workplace.","translation":"その研究は、職場におけるモノセクシュアルの個人の経験に焦点を当てました。","type":"adjective","meaning_category":"単一の性別に対してのみ魅力を感じる"},{"sentence":"Many monosexuals feel that their experiences are often overlooked in discussions about LGBTQ+ issues.","translation":"多くのモノセクシュアルは、LGBTQ+の問題に関する議論において、自分たちの経験が見過ごされがちだと感じています。","type":"noun","meaning_category":"単一の性別に対してのみ魅力を感じる人"}]}