{"word":"angarep","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Filipino bed or sleeping platform, often made of bamboo or wood.","english_definition":"A traditional Filipino bed or sleeping platform, typically made of bamboo or wood.","examples":[{"sentence":"The old man slept soundly on his angarep.","translation":"その老人はアンガレプの上でぐっすり眠った。"},{"sentence":"The children played on the angarep during the hot afternoon.","translation":"子供たちは暑い午後にアンガレプの上で遊んだ。"}],"collocations":["sleep on an angarep","make an angarep","bamboo angarep","wooden angarep"],"synonyms":["bamboo bed","sleeping platform"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language. Further research needed for precise origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/aŋˈɡa.ɾɛp/","syllables":"an-ga-rep"},"inflection":{"noun_plural":"angareps"},"usage_notes":{"explanation":"An 'angarep' is a cultural item specific to the Philippines. It is a simple bed, often elevated, and traditionally made from readily available materials like bamboo or wood. It is not a common word in general English but would be understood within a Filipino context.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["banig (sleeping mat)","kama (bed)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used within the Philippines.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'angarep' is not commonly known outside of the Philippines. Understanding its meaning requires cultural context related to traditional Filipino homes and furniture. It is unlikely to appear in general English texts but might be found in literature or anthropological studies related to the Philippines."},"example_sentences":[{"sentence":"The farmer rested on the angarep after a long day in the fields.","translation":"農夫は畑での長い一日の後、アンガレプで休憩した。","type":"noun","meaning_category":"Traditional Filipino bed"},{"sentence":"She decorated the angarep with colorful woven fabrics.","translation":"彼女はアンガレプを色鮮やかな織物で飾った。","type":"noun","meaning_category":"Traditional Filipino bed"}]}