{"word":"Destalinize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"スターリン批判を行う、脱スターリン化する","english_definition":"To remove the influence or legacy of Joseph Stalin, especially in the former Soviet Union and other communist countries. This includes denouncing his policies, removing monuments, and revising historical narratives.","examples":[{"sentence":"After Stalin's death, Khrushchev began to Destalinize the Soviet Union.","translation":"スターリンの死後、フルシチョフはソビエト連邦の脱スターリン化を開始した。"},{"sentence":"The process to Destalinize the country involved renaming cities and removing statues.","translation":"その国を脱スターリン化するプロセスには、都市の名前の変更や像の撤去が含まれていた。"}],"collocations":["Destalinize the Soviet Union","Destalinize a country","begin to Destalinize","process to Destalinize"],"synonyms":["de-Stalinize","decommunize","liberalize","reform"],"antonyms":["Stalinize","communize","totalitarianize","oppress"]}],"etymology":{"value":"Formed from the prefix 'de-' (meaning 'remove' or 'reverse') and the verb 'Stalinize' (to bring under the influence or control of Stalin).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈstɑːlɪnaɪz/","syllables":"De-sta-lin-ize"},"inflection":{"verb_forms":{"present_simple":["Destalinize","Destalinizes"],"past_simple":"Destalinized","past_participle":"Destalinized","present_participle":"Destalinizing"}},"usage_notes":{"explanation":"'Destalinize' is primarily used in historical and political contexts to describe the efforts to undo the effects of Stalin's rule. It involves not only political and ideological changes but also cultural and social reforms. The term is most commonly associated with the Khrushchev Thaw in the Soviet Union during the 1950s and 1960s.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was destalinized of its past.","correct":"✓ The country was destalinized.","note":"The verb 'Destalinize' is typically used without the preposition 'of'. It directly takes the object that is being freed from Stalinist influence."},{"incorrect":"✗ Destalinization is a quick process.","correct":"✓ Destalinization is a complex and lengthy process.","note":"Destalinization is a multifaceted and often prolonged process, involving significant political, social, and cultural changes. It is rarely quick or simple."}],"priority":"★★☆"},"related_words":{"derivatives":["Destalinization (noun): The process of removing Stalin's influence.","de-Stalinization (noun): Alternative spelling for the process of removing Stalin's influence.","Stalinism (noun): The political and economic policies implemented by Stalin.","Stalinist (adjective/noun): Relating to or supporting Stalinism."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary used in history and political science)","frequency_google_ngram":"Low frequency, primarily used in academic and historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Destalinize' is a specialized term used in the context of Soviet history and political science. It describes the actions taken to reverse the policies and legacy of Joseph Stalin, including denouncing his actions, removing monuments, and revising historical narratives. Understanding this term requires knowledge of 20th-century history and political ideologies. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The reforms aimed to Destalinize the legal system.","translation":"その改革は法制度の脱スターリン化を目的としていた。","type":"verb","meaning_category":"脱スターリン化する"},{"sentence":"Historians continue to debate the extent to which the Soviet Union was truly Destalinized.","translation":"歴史家たちは、ソビエト連邦が真に脱スターリン化された程度について議論し続けている。","type":"verb","meaning_category":"脱スターリン化する"}]}