{"word":"trusteeism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(しばしば軽蔑的に) 専門家やエリート層が、一般大衆よりも物事をより良く理解していると想定し、社会の運営や意思決定を主導すべきだという考え方。","english_definition":"(often derogatory) the belief that experts or elites know better than the general public and should lead the operation and decision-making of society.","examples":[{"sentence":"Some critics argue that certain policies reflect a form of trusteeism, where experts impose their views without sufficient public input.","translation":"一部の批評家は、特定の政策は、専門家が十分な国民の意見なしに彼らの見解を押し付ける、ある種のトラスティーイズムを反映していると主張している。"},{"sentence":"The debate over healthcare reform often involves clashes between those who advocate for professional expertise and those who prioritize public autonomy, highlighting the tension around trusteeism.","translation":"医療改革に関する議論は、専門家の専門知識を擁護する人々 と、国民の自主性を優先する人々との間の衝突を伴うことが多く、トラスティーイズムをめぐる緊張を浮き彫りにしている。"}],"collocations":["exercise trusteeism (トラスティーイズムを行使する)","criticize trusteeism (トラスティーイズムを批判する)","a form of trusteeism (トラスティーイズムの一形態)","paternalistic trusteeism (パターナリスティックなトラスティーイズム)"],"synonyms":["elitism","paternalism","technocracy","expert rule"],"antonyms":["populism","democracy","egalitarianism"]},{"part_of_speech":"noun","definition":"(歴史的に) 教会の財産を管理する信託委員制度、またはその信託委員の職務。","english_definition":"(historically) the system of trustees managing church property, or the duties of such trustees.","examples":[{"sentence":"Trusteeism in the early 19th century involved disputes over who had the authority to appoint priests and manage church finances.","translation":"19世紀初頭のトラスティーイズムは、誰が司祭を任命し、教会の財政を管理する権限を持つかについての紛争を伴っていた。"}],"collocations":["church trusteeism (教会のトラスティーイズム)","historical trusteeism (歴史的なトラスティーイズム)"],"synonyms":["church management","ecclesiastical administration"],"antonyms":[]}],"etymology":{"value":"「trustee」（受託者、管理者）に「-ism」（主義、思想）を付けたもの。元々は教会の財産管理制度を指す言葉だったが、後に専門家やエリートによる社会運営を支持する思想を指す言葉として使われるようになった。","priority":"★☆☆"},"pronunciation":{"ipa":"/trʌˈstiːɪzəm/","syllables":"trust-ee-ism"},"inflection":{"noun_plural":"trusteeisms"},"usage_notes":{"explanation":"「**trusteeism**」は、主に2つの意味で使用されます。\n\n1.  **専門家主義、エリート主義:** これは、社会の運営や意思決定は、一般大衆よりも知識や専門性を持つエリート層に委ねるべきだという考え方を指します。しばしば批判的な意味合いで使用され、民主主義や大衆の意見を軽視していると見なされることがあります。\n\n2.  **歴史的な教会の財産管理制度:** これは、19世紀初頭のアメリカで、教会の財産を信託委員が管理する制度を指します。この制度は、聖職者の任命権や教会の財政管理をめぐって紛争を引き起こすことがありました。\n\n現代では、1の意味で使われることが多く、政治学や社会学の分野で議論されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supports trustee, believing in expert opinions.","correct":"✓ He supports trusteeism, believing in expert opinions.","note":"「trustee」は受託者、管理者という名詞であり、「trusteeism」が思想や主義を表す名詞です。"},{"incorrect":"✗ The company is based on trusteeism principles.","correct":"✓ The company is based on elitist principles.","note":"企業運営において専門家を重視する方針を指す場合、より一般的な「elitism（エリート主義）」の方が適切な場合があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["trustee (受託者、管理者)","trust (信託、信頼)"],"phrases":["elite rule (エリート支配)","expertocracy (専門家支配)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**trusteeism**」は、社会や組織の運営において、専門家やエリートが一般の人々よりも優れた判断力を持つと信じ、彼らに主導権を委ねるべきだという考え方を指す、やや専門的な言葉です。この言葉は、しばしば批判的な意味合いで使用され、民主主義的な意思決定プロセスを軽視する傾向があると見なされることがあります。また、歴史的には、教会の財産管理制度を指す言葉としても使われていました。政治学や社会学の分野で議論されることが多く、日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The professor criticized the university's policy as an example of **trusteeism**, where administrators make decisions without consulting faculty.","translation":"教授は、大学の政策を、管理者が教員に相談せずに決定を下す、トラスティーイズムの例として批判した。","type":"noun","meaning_category":"専門家主義"},{"sentence":"Historically, **trusteeism** in some churches led to conflicts over the control of church finances.","translation":"歴史的に、一部の教会におけるトラスティーイズムは、教会の財政管理をめぐる対立につながった。","type":"noun","meaning_category":"教会の財産管理制度"}]}