{"word":"Triticism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"穀物（特に小麦）の生産、加工、利用に関する知識や実践","english_definition":"The knowledge and practice related to the production, processing, and utilization of grains, especially wheat.","examples":[{"sentence":"His expertise in triticism allowed him to optimize wheat yields on the farm.","translation":"彼の穀物、特に小麦の生産に関する専門知識により、農場で小麦の収穫量を最適化することができました。"},{"sentence":"The university offers a course in triticism covering various aspects of grain cultivation and processing.","translation":"大学では、穀物の栽培と加工のさまざまな側面を網羅する穀物学のコースを提供しています。"}],"collocations":["applied triticism","agricultural triticism","scientific triticism"],"synonyms":["cerealiculture","grain science","agronomy (related)","crop science (related)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'Triticum,' which is the genus name for wheat, combined with the suffix '-ism,' indicating a practice, knowledge, or system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪtɪsɪzəm/","syllables":"tri-ti-ci-sm"},"inflection":{"noun_plural":"Triticisms"},"usage_notes":{"explanation":"'Triticism' is a relatively specialized term, primarily used in agricultural and scientific contexts. It refers to the comprehensive understanding and application of knowledge related to grains, with a particular emphasis on wheat. This includes aspects such as cultivation techniques, processing methods, and utilization strategies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying triticity.","correct":"✓ He is studying triticism.","note":"'Triticity' is not a recognized term. The correct term is 'triticism.'"},{"incorrect":"✗ Triticism is only about growing wheat.","correct":"✓ Triticism involves the production, processing, and utilization of grains, especially wheat.","note":"Triticism encompasses more than just cultivation; it includes processing and utilization as well."}],"priority":"★★☆"},"related_words":{"derivatives":["Triticum (wheat genus)","Triticale (wheat-rye hybrid)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized term)","frequency_google_ngram":"Low frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Triticism' is a specialized term used in agricultural and scientific contexts to describe the knowledge and practice of grain production, processing, and utilization, especially concerning wheat. It is not commonly used in everyday language and is more likely to be encountered in academic or professional discussions related to agriculture or crop science."},"example_sentences":[{"sentence":"The farmer's deep understanding of triticism enabled him to improve crop yields.","translation":"農家の穀物学への深い理解により、作物の収穫量を改善することができました。","type":"general","meaning_category":"Grain Knowledge"},{"sentence":"Modern triticism integrates genetic research to enhance wheat varieties.","translation":"現代の穀物学は、小麦の品種を改良するために遺伝子研究を統合しています。","type":"scientific","meaning_category":"Scientific Application"}]}