{"word":"virgas","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"雨や雪が降る際に、地上に到達する前に蒸発してしまう現象。または、そのように蒸発している雨や雪の筋。","english_definition":"Precipitation (such as rain or snow) falling from a cloud but evaporating before reaching the ground; also, the streaks of water or ice particles that appear to hang under the cloud.","examples":[{"sentence":"We could see virgas trailing from the clouds in the distance, but no rain reached us.","translation":"遠くの雲から雨の筋が垂れ下がっているのが見えたが、雨は私たちのところには届かなかった。"},{"sentence":"The desert landscape is often marked by virgas, a sign of moisture that never quite arrives.","translation":"砂漠の風景はしばしば雨の筋によって特徴づけられ、それは決して届かない水分の兆候である。"}],"collocations":["see virgas","observe virgas","virgas falling","desert virgas"],"synonyms":["fall streaks","precipitation trails"],"antonyms":[]},{"part_of_speech":"noun","definition":"（複数形）細い棒、小枝、杖。特に、占い棒や魔法の杖として使われるもの。","english_definition":"(plural) Thin rods, twigs, or wands, especially those used for divination or magic.","examples":[{"sentence":"The wizard carried a bundle of virgas, each imbued with a different magical property.","translation":"魔法使いは、それぞれ異なる魔法の特性が込められた小枝の束を持ち歩いていた。"},{"sentence":"Ancient diviners used virgas to locate underground water sources.","translation":"古代の占師たちは、地下水源の位置を特定するために占い棒を使った。"}],"collocations":["divining virgas","magical virgas","bundle of virgas"],"synonyms":["rods","wands","twigs"],"antonyms":[]}],"etymology":{"value":"ラテン語の「virga」（棒、小枝）に由来する。気象学的な意味合いは、20世紀初頭に気象学者のウィリアム・ヘンリー・ダンによって導入された。","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɜːrɡəz/","syllables":"vir-gas"},"inflection":{"noun_plural":"virgas (常に複数形で使われることが多い)"},"usage_notes":{"explanation":"「**virgas**」は、主に気象学の用語として使われ、地上に到達する前に蒸発する雨や雪の筋を指します。この現象は、乾燥した地域や高地でよく見られます。また、古風な用法として、占い棒や魔法の杖といった意味もありますが、現代ではあまり一般的ではありません。気象学的な意味合いで使われる場合、通常は複数形で用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a virga falling from the cloud.","correct":"✓ I saw virgas falling from the cloud.","note":"気象現象としての「雨の筋」を指す場合は、通常複数形で使われます。"},{"incorrect":"✗ The virgas was beautiful.","correct":"✓ The virgas were beautiful.","note":"複数形で使われることが多いので、動詞も複数形にします。"}],"priority":"★★☆"},"related_words":{"derivatives":["virgate (名詞: 古代の土地の単位)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な気象学の文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"「**virgas**」は、主に気象学で使われる専門用語で、日常会話ではほとんど使われません。意味としては、雲から降ってくる雨や雪が、地上に届く前に蒸発してしまう現象、またはそのように蒸発している雨や雪の筋を指します。乾燥地帯などで見られる現象です。古風な用法では「杖」や「小枝」という意味もありますが、現代ではほとんど使われません。気象学の文脈以外では、まず見かけることはないでしょう。"},"example_sentences":[{"sentence":"The shimmering virgas hinted at rain, but the ground remained dry.","translation":"きらめく雨の筋は雨を示唆していたが、地面は乾いたままだった。","type":"noun","meaning_category":"気象現象"},{"sentence":"The old maps showed the boundaries marked with virgas.","translation":"古い地図には、境界線が小枝で示されているのが示されていた。","type":"noun","meaning_category":"小枝 (古風な用法)"}]}