{"word":"uniperiodic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一周期の、単周期の","english_definition":"Having a single period; occurring or recurring at a single, fixed interval.","examples":[{"sentence":"The uniperiodic signal was easy to analyze because it repeated exactly the same pattern.","translation":"単一周期の信号は、全く同じパターンを繰り返すため、解析が容易だった。"},{"sentence":"Uniperiodic functions are important in various fields of science and engineering.","translation":"単周期関数は、科学と工学の様々な分野で重要である。"}],"collocations":["uniperiodic function","uniperiodic signal","uniperiodic motion"],"synonyms":["periodic","cyclic","rhythmic"],"antonyms":["aperiodic","nonperiodic","irregular"]}],"etymology":{"value":"'uni-' (単一の) + 'periodic' (周期的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːniːpɪriˈɒdɪk/","syllables":"u-ni-pe-ri-od-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Uniperiodic' is a technical term, mostly used in mathematics, physics, and engineering, to describe something that repeats itself at a single, constant interval. It's often used to describe signals, functions, or motions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was uniperiodic, happening only once.","correct":"✓ The event was a one-time event, happening only once.","note":"'Uniperiodic' implies repetition at a fixed interval, not a single occurrence. Use 'one-time event' or similar phrasing for something that happens only once."}],"priority":"★★★"},"related_words":{"derivatives":["periodicity (名詞: 周期性)","periodic (形容詞: 周期的な)","aperiodic (形容詞: 非周期的な)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uniperiodic' is a technical term used to describe something that repeats itself at a single, fixed interval. It's commonly used in fields like mathematics, physics, and engineering to describe signals, functions, or motions that exhibit this property. Because it's a specialized term, it's not commonly used in everyday language."},"example_sentences":[{"sentence":"The researcher studied the properties of the uniperiodic wave.","translation":"研究者は単周期波の特性を研究した。","type":"general","meaning_category":"単一周期の"},{"sentence":"The system exhibited uniperiodic behavior under certain conditions.","translation":"そのシステムは、特定の条件下で単周期的な挙動を示した。","type":"technical","meaning_category":"単一周期の"}]}