{"word":"Fallas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バレンシアの火祭り (Las Fallas)","english_definition":"Las Fallas is a traditional celebration held annually in the city of Valencia, Spain.","examples":[{"sentence":"Las Fallas is a spectacular festival with impressive ninots.","translation":"バレンシアの火祭りは、印象的なニノット（人形）がある壮大な祭りです。"}],"collocations":["Las Fallas festival","Fallas celebration","Fallas ninots"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The etymology of 'Fallas' comes from the Valencian word 'falla,' which means torches or bonfires. The festival's origins are linked to the tradition of carpenters burning wood scraps and broken artifacts on the eve of Saint Joseph's Day.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɑːjɑːs/","syllables":"Fa-llas"},"inflection":{"notes":"Plural form of 'falla' in Valencian, but used as a proper noun to refer to the festival."},"usage_notes":{"explanation":"'Fallas' refers specifically to the Las Fallas festival in Valencia, Spain. It is a proper noun and is often used in the context of the festival's events, traditions, and artistic creations (ninots).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a fallas.","correct":"✓ I'm going to Las Fallas.","note":"When referring to the festival, use the full name 'Las Fallas'."}],"priority":"★★☆"},"related_words":{"derivatives":["falla (Valencian: torch, bonfire, or the individual monuments/sculptures)","ninot (Valencian: the figures/puppets that are part of the Fallas monuments)","fallero/fallera (Valencian: a participant in the Fallas festival)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific cultural reference)","frequency_google_ngram":"Low frequency (specific to discussions about Valencian culture)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Fallas' is a cultural term referring to the Las Fallas festival in Valencia, Spain. Understanding its meaning requires cultural context related to Spanish traditions. The term is used in discussions about the festival's history, art (ninots), and cultural significance.","priority":"★★★"},"example_sentences":[{"sentence":"Every year, thousands of tourists visit Valencia to experience Las Fallas.","translation":"毎年、何千人もの観光客がバレンシアの火祭りを体験するためにバレンシアを訪れます。","type":"noun","meaning_category":"Festival"},{"sentence":"The ninots displayed during Las Fallas are often satirical and politically charged.","translation":"バレンシアの火祭りで展示されるニノット（人形）は、しばしば風刺的で政治的な意味合いを持っています。","type":"noun","meaning_category":"Festival elements"}]}