{"word":"Angkhak","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Angkhak (アンカック) is a traditional fermented rice product used in Southeast Asian cuisine, particularly in the Philippines and Indonesia. It's made by fermenting cooked rice with a mold, Monascus purpureus, which gives it a distinctive red color. It is also known as red yeast rice.","english_definition":"Angkhak is a fermented rice product, also known as red yeast rice, used in Southeast Asian cuisine, particularly in the Philippines and Indonesia.","examples":[{"sentence":"Angkhak is used as a natural food coloring.","translation":"アンカックは天然の食品着色料として使用されます。"},{"sentence":"Some people believe Angkhak has health benefits.","translation":"アンカックには健康上の利点があると信じている人もいます。"},{"sentence":"Angkhak is used in various traditional dishes.","translation":"アンカックは様々な伝統料理に使用されています。"}],"collocations":["red yeast rice","fermented rice","Monascus purpureus"],"synonyms":["red yeast rice"],"antonyms":[]}],"etymology":{"value":"The name 'Angkhak' is derived from Hokkien Chinese, where 'Ang' means red and 'Khak' means rice.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɑːŋkˌhæk/","syllables":"Ang-khak"},"inflection":{},"usage_notes":{"explanation":"Angkhak is primarily known as a food ingredient and natural food coloring. It's also sometimes discussed in the context of traditional medicine or health supplements due to the presence of monacolins.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"Angkhak is a specialized term related to Southeast Asian cuisine and food science. It is not a common word in general English conversation."},"example_sentences":[{"sentence":"The dish was colored with Angkhak to give it a vibrant red hue.","translation":"料理は鮮やかな赤色を出すためにアンカックで着色されました。","type":"noun","meaning_category":"food ingredient"},{"sentence":"Angkhak is a key ingredient in some traditional Filipino recipes.","translation":"アンカックは、いくつかの伝統的なフィリピン料理の重要な材料です。","type":"noun","meaning_category":"food ingredient"}]}