{"word":"strake","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(船の)外板の一列、(航空機の)ストレーキ","english_definition":"a plank or line of planks running lengthwise along the side or bottom of a boat or ship; a small aerodynamic surface, typically blade-shaped, attached to an aircraft fuselage to improve stability or control.","examples":[{"sentence":"The ship's hull was made of multiple strakes of wood.","translation":"その船の船体は、何列もの木のストレーキでできていた。"},{"sentence":"The aircraft had prominent strakes near the nose.","translation":"その航空機は、機首付近に目立つストレーキを備えていた。"}],"collocations":["hull strake","chine strake","bilge strake","keel strake","wing strake","leading-edge strake"],"synonyms":["plank","board","strip","fairing"],"antonyms":[]}],"etymology":{"value":"Middle English: from Middle Dutch or Middle Low German; related to stretch.","priority":"★★☆"},"pronunciation":{"ipa":"/streɪk/","syllables":"strake"},"inflection":{"noun_plural":"strakes"},"usage_notes":{"explanation":"The word \"strake\" is primarily used in nautical and aeronautical contexts. In shipbuilding, it refers to a continuous line of planks forming part of the hull. In aviation, it refers to a small aerodynamic surface used to improve airflow and stability. The word is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The mechanic replaced a streak on the car.","correct":"The mechanic replaced a panel on the car.","note":"'Streak' (筋) is often confused with 'strake', but they have different meanings. 'Strake' is specific to boats and aircraft."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'strake' is a technical term primarily used in the fields of shipbuilding and aviation. It is unlikely to be encountered in general English conversation or writing. Understanding requires specialized knowledge of these fields."},"example_sentences":[{"sentence":"The carpenter carefully fitted each strake to the hull.","translation":"船大工は注意深く各ストレーキを船体に取り付けた。","type":"noun","meaning_category":"外板の一列"},{"sentence":"The strakes on the fighter jet improved its maneuverability.","translation":"戦闘機のストレーキは、その操縦性を向上させた。","type":"noun","meaning_category":"ストレーキ"}]}