{"word":"anticonventionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"反慣習的に、慣習に反して","english_definition":"In a manner that opposes or deviates from established conventions or norms.","examples":[{"sentence":"She dressed anticonventionally, often mixing vintage pieces with modern designs.","translation":"彼女は反慣習的な服装をし、ヴィンテージ品とモダンなデザインを組み合わせることが多かった。"},{"sentence":"The artist approached the subject matter anticonventionally, challenging traditional interpretations.","translation":"そのアーティストは反慣習的なアプローチで主題に取り組み、伝統的な解釈に挑戦した。"},{"sentence":"The film was praised for its anticonventionally narrative structure.","translation":"その映画は、反慣習的な物語構成で賞賛された。"}],"collocations":["dress anticonventionally","approach a subject anticonventionally","behave anticonventionally"],"synonyms":["unconventionally","nonconformally","irregularly","unorthodoxy"],"antonyms":["conventionally","traditionally","formally","orthodoxly"]}],"etymology":{"value":"The word is formed by adding the prefix 'anti-' (meaning 'against') to 'conventionally', which itself is derived from 'convention' (meaning 'a way in which something is usually done').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiːkənˈvɛnʃənəli/","syllables":"an-ti-con-ven-tion-al-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Anticonventionally' describes actions or behaviors that deliberately go against what is normally accepted or practiced. It often implies a conscious decision to reject established norms in favor of a different, often more creative or individualistic, approach. It is stronger than simply 'unconventionally' as it suggests an active opposition to convention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted anticonventional.","correct":"✓ He acted anticonventionally.","note":"'Anticonventional' is an adjective, while 'anticonventionally' is an adverb. Use the adverb to modify a verb."},{"incorrect":"✗ She is anticonventionally person.","correct":"✓ She is an anticonventional person.","note":"Use the adjective 'anticonventional' to describe a person. 'Anticonventionally' is used to describe how someone does something."}],"priority":"★★☆"},"related_words":{"derivatives":["anticonventional (adjective)","convention (noun)","conventional (adjective)","conventionally (adverb)"],"phrases":["think outside the box","challenge the status quo"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anticonventionally' is a sophisticated word used to describe something done in a way that goes against the usual or accepted norms. It's often used in discussions about art, fashion, or social behavior where someone is deliberately breaking with tradition. Because it's a longer word with a specific meaning, it's more common in formal writing or discussions than in everyday conversation."},"example_sentences":[{"sentence":"The architect designed the building anticonventionally, using unusual materials and shapes.","translation":"その建築家は反慣習的に建物を設計し、珍しい素材と形状を使用した。","type":"adverb","meaning_category":"manner of design"},{"sentence":"The author wrote the novel anticonventionally, abandoning traditional narrative structures.","translation":"その作家は反慣習的に小説を書き、伝統的な物語構造を放棄した。","type":"adverb","meaning_category":"manner of writing"},{"sentence":"The company marketed its product anticonventionally, relying on viral campaigns rather than traditional advertising.","translation":"その会社は反慣習的に製品をマーケティングし、従来の広告ではなくバイラルキャンペーンに頼った。","type":"adverb","meaning_category":"manner of marketing"}]}