{"word":"pemekaran","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(インドネシア語) 拡張、拡大、発展、分離、分割","english_definition":"(Indonesian) expansion, enlargement, development, separation, division (of a region, province, etc.)","examples":[{"sentence":"Pemekaran wilayah bertujuan untuk meningkatkan kesejahteraan masyarakat.","translation":"The expansion of the region aims to improve the welfare of the community.","note":"This sentence illustrates the general use of 'pemekaran' in the context of regional expansion."},{"sentence":"Pemerintah sedang mempertimbangkan pemekaran provinsi tersebut.","translation":"The government is considering the division of the province.","note":"This sentence shows 'pemekaran' used in the context of splitting a province."}],"collocations":["pemekaran wilayah (regional expansion)","pemekaran daerah (area expansion)","proses pemekaran (expansion process)","usulan pemekaran (expansion proposal)"],"synonyms":["ekspansi","perluasan","pengembangan","pemisahan","pembagian"],"antonyms":["penggabungan","penyatuan","peleburan"]}],"etymology":{"value":"Derived from the Indonesian word 'mekar' which means 'to bloom' or 'to expand'. The suffix '-an' turns it into a noun.","priority":"N/A"},"pronunciation":{"ipa":"/pə.mə.ka.ran/","syllables":"pe-me-ka-ran"},"inflection":{"noun_forms":{"singular":"pemekaran","plural":"pemekaran"}},"usage_notes":{"explanation":"'Pemekaran' in Indonesian refers to the act or process of something expanding or developing. It is often used in the context of regional or administrative divisions, such as the creation of new provinces or districts from existing ones. It can also refer to the general expansion or development of an idea, concept, or organization. The specific meaning depends on the context.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"*pemekaran is bloom","correct":"pemekaran is expansion","note":"'Pemekaran' is not a direct translation of 'bloom' in English, although it is derived from 'mekar' (to bloom). The more accurate translation is 'expansion' or 'development'."}],"priority":"N/A"},"related_words":{"derivatives":["mekar (to bloom, to expand)","memekarkan (to expand something, to develop something)","terkembang (expanded, developed)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency in Indonesian texts related to government and regional development.","priority":"N/A"},"readability_explanation":{"level":"Advanced","text":"'Pemekaran' is a formal Indonesian term often used in discussions about government policy, regional development, and administrative divisions. It implies a deliberate and planned process of expansion or separation for the purpose of improving efficiency or welfare."},"example_sentences":[{"sentence":"Pemekaran desa itu diharapkan dapat mempercepat pembangunan.","translation":"The expansion of that village is expected to accelerate development.","type":"noun","meaning_category":"Expansion (of a village)"},{"sentence":"Pemekaran wilayah otonomi baru memerlukan persiapan yang matang.","translation":"The creation of a new autonomous region requires careful preparation.","type":"noun","meaning_category":"Creation (of a new region)"},{"sentence":"Kebijakan pemekaran ini bertujuan untuk mendekatkan pelayanan kepada masyarakat.","translation":"This expansion policy aims to bring services closer to the community.","type":"noun","meaning_category":"Expansion (of policy)"}]}