{"word":"quasi-obedient","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ほとんど従順な、半ば従順な","english_definition":"seemingly or partially obedient; obedient to some extent but not fully.","examples":[{"sentence":"The dog was quasi-obedient, following some commands but ignoring others.","translation":"その犬はほとんど従順で、いくつかの命令には従うものの、他の命令は無視した。"},{"sentence":"The students were quasi-obedient, complying with the dress code but occasionally talking out of turn.","translation":"生徒たちはほとんど従順で、服装規定には従っていたが、時々勝手に話し出した。"}],"collocations":["quasi-obedient behavior","quasi-obedient child","quasi-obedient response"],"synonyms":["partially obedient","somewhat obedient","nominally obedient","ostensibly obedient"],"antonyms":["disobedient","rebellious","insubordinate"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning 'resembling' or 'seemingly') with \"obedient\" (meaning 'complying with commands').","priority":"★★★"},"pronunciation":{"ipa":"/ˌkweɪzaɪ oʊˈbiːdiənt/","syllables":"qua-si-o-be-di-ent"},"inflection":{"adjective_forms":{"comparative":"more quasi-obedient","superlative":"most quasi-obedient"}},"usage_notes":{"explanation":"\"Quasi-obedient\" describes a state of being obedient to a limited degree or in certain situations, but not fully or consistently. It suggests a superficial or incomplete compliance with rules or commands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quasi-obedient student always follows the rules.","correct":"✓ The quasi-obedient student usually follows the rules, but sometimes deviates.","note":"\"Quasi-obedient\" implies that obedience is not absolute or consistent. The student does not *always* follow the rules."},{"incorrect":"✗ The dog was quasi-obedient, so he never disobeyed.","correct":"✓ The dog was quasi-obedient, so he sometimes disobeyed.","note":"The prefix \"quasi-\" indicates that the obedience is not complete, so disobedience is possible."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb): seemingly; virtually","obedience (noun): the act of obeying","obedient (adjective): complying with commands"],"related_terms":["semi-obedient","near-obedient","partially compliant"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"quasi-obedient\" is a relatively uncommon term used to describe someone or something that exhibits obedience to a partial or limited extent. The prefix \"quasi-\" indicates that the obedience is not complete or absolute. This word is best used in formal contexts where a nuanced description of obedience is required."},"example_sentences":[{"sentence":"The child's quasi-obedient behavior frustrated his parents, as he would follow some instructions but ignore others.","translation":"子供のほとんど従順な態度は、親をイライラさせた。なぜなら、いくつかの指示には従うものの、他の指示は無視したからだ。","type":"adjective","meaning_category":"partially obedient"},{"sentence":"The new recruits were quasi-obedient during training, showing a willingness to learn but occasionally questioning the methods.","translation":"新兵たちは訓練中、ほとんど従順で、学ぶ意欲を示したが、時々その方法に疑問を呈した。","type":"adjective","meaning_category":"partially obedient"},{"sentence":"The company's quasi-obedient adherence to the new regulations was met with skepticism by the public.","translation":"その会社の新しい規制に対するほとんど従順な態度は、大衆から懐疑的に見られた。","type":"adjective","meaning_category":"partially obedient"}]}