{"word":"holy-created","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"神聖に創造された、神によって創造された","english_definition":"Created in a sacred or divine manner; created by God.","examples":[{"sentence":"The artist depicted Adam as a holy-created being, imbued with divine essence.","translation":"その芸術家はアダムを、神の精髄を吹き込まれた、神聖に創造された存在として描いた。"},{"sentence":"Some believe that the universe is a holy-created entity, a testament to divine craftsmanship.","translation":"宇宙は、神の職人技の証である、神聖に創造された存在だと信じる人もいる。"}],"collocations":["holy-created being","holy-created entity","holy-created world"],"synonyms":["divinely created","sacredly created","god-made","divine origin","heavenly made"],"antonyms":["naturally created","man-made","artificially created","profane","secular"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'holy' (sacred, divine) and 'created' (brought into existence). It suggests something brought into existence by a divine or sacred power.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊli kriˈeɪtɪd/","syllables":"ho-ly cre-a-ted"},"inflection":{"notes":"This is a compound adjective and does not have different inflections."},"usage_notes":{"explanation":"'Holy-created' is often used in religious or spiritual contexts to emphasize the divine origin or sacred nature of something. It is not a commonly used word in everyday conversation, but it can be found in theological or philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The holy created the world.","correct":"✓ God holy-created the world.","note":"'Holy-created' is an adjective, so it needs a noun to modify. To use it in a sentence like this, you would need to use it as part of a verb phrase, or use a different construction."}],"priority":"★☆☆"},"related_words":{"derivatives":["holy","created","creation","creator","divine","sacred"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly used in general English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Holy-created' is a compound adjective used to describe something that is believed to have been brought into existence through divine or sacred means. This term is not commonly used in everyday language but may appear in religious, philosophical, or theological contexts. Understanding the term requires familiarity with concepts of divinity and creation. "},"example_sentences":[{"sentence":"The scriptures describe humanity as a holy-created species, blessed with intellect and spirit.","translation":"聖典は人類を、知性と精神に恵まれた、神聖に創造された種として記述している。","type":"adjective","meaning_category":"divinely created"},{"sentence":"The garden was seen as a holy-created space, untouched by the corruption of the outside world.","translation":"その庭は、外界の堕落に触れられていない、神聖に創造された空間と見なされていた。","type":"adjective","meaning_category":"sacredly created"}]}