{"word":"Neurosurgery","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脳神経外科、脳外科","english_definition":"The branch of surgery concerned with disorders of the nervous system, including the brain, spinal cord, peripheral nerves, and cerebrovascular system.","examples":[{"sentence":"He is a specialist in neurosurgery.","translation":"彼は脳神経外科の専門医です。"},{"sentence":"The patient underwent neurosurgery to remove a brain tumor.","translation":"患者は脳腫瘍を取り除くために脳神経外科手術を受けました。"},{"sentence":"Neurosurgery is a complex and demanding field of medicine.","translation":"脳神経外科は複雑で要求の厳しい医学分野です。"}],"collocations":["perform neurosurgery (脳神経外科手術を行う)","neurosurgery department (脳神経外科)","neurosurgery clinic (脳神経外科クリニック)","pediatric neurosurgery (小児脳神経外科)","vascular neurosurgery (血管脳神経外科)"],"synonyms":["brain surgery","nerve surgery"],"antonyms":[]}],"etymology":{"value":"The term \"neurosurgery\" is derived from the Greek words \"neuron\" (nerve) and \"surgery\" (hand work). It reflects the surgical treatment of the nervous system.","priority":"★★★"},"pronunciation":{"ipa":"ˌnjʊərəʊˈsɜːrdʒəri","syllables":"neu-ro-sur-ge-ry"},"inflection":{"noun_plural":"Neurosurgeries (rarely used)"},"usage_notes":{"explanation":"\"Neurosurgery\" refers to the surgical specialty dealing with the diagnosis and treatment of disorders affecting the brain, spinal cord, and peripheral nerves. It encompasses a wide range of procedures, from minimally invasive techniques to complex open surgeries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doing a neurosurgery.","correct":"✓ He is performing neurosurgery. / ✓ He is doing neurosurgical work.","note":"\"Neurosurgery\" is the field or the procedure itself. Use \"perform neurosurgery\" or \"doing neurosurgical work\" to describe the act of performing the surgery."},{"incorrect":"✗ Neurosurgery is very easy.","correct":"✓ Neurosurgery is very complex.","note":"Neurosurgery is a highly specialized and complex field, so describing it as \"easy\" is inaccurate."}],"priority":"★★☆"},"related_words":{"derivatives":["neurosurgical (adjective: relating to neurosurgery)","neurosurgeon (noun: a surgeon specializing in neurosurgery)"],"fields":["neurology (神経学)","neuroradiology (神経放射線学)","neuroanesthesiology (神経麻酔学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, specific to medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Neurosurgery\" is a specialized medical term referring to the surgical treatment of the nervous system. It involves complex procedures performed by highly trained surgeons to address conditions affecting the brain, spinal cord, and nerves. Understanding this term requires familiarity with medical terminology and the structure of the nervous system.","priority":"★★☆"},"example_sentences":[{"sentence":"The hospital has a state-of-the-art neurosurgery unit.","translation":"その病院には最新鋭の脳神経外科部門があります。","type":"general"},{"sentence":"The neurosurgery team worked tirelessly to save the patient's life.","translation":"脳神経外科チームは患者の命を救うためにたゆまぬ努力をしました。","type":"general"},{"sentence":"Advances in neurosurgery have significantly improved outcomes for patients with brain tumors.","translation":"脳神経外科の進歩により、脳腫瘍患者の転帰は大幅に改善されました。","type":"technical"}]}