{"word":"Hymenoptera","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハチ目","english_definition":"An order of insects including the sawflies, wasps, bees, and ants. They are distinguished by having four membranous wings, a narrow waist (in most cases), and often complex social behavior.","examples":[{"sentence":"Ants, bees, and wasps all belong to the order Hymenoptera.","translation":"アリ、ハチ、スズメバチはすべてハチ目に属する。"}],"collocations":["Hymenoptera venom (ハチ目の毒)","Hymenoptera sting (ハチ目の刺し傷)","Hymenoptera allergy (ハチ目のアレルギー)"],"synonyms":["ants","bees","wasps","sawflies"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ὑμήν (humḗn, “membrane, skin”) + πτερόν (pterón, “wing”), referring to the membranous wings characteristic of this order.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪmənˈɒptərə/","syllables":"Hy-men-op-te-ra"},"inflection":{"noun_plural":"Hymenopterans or Hymenoptera"},"usage_notes":{"explanation":"'Hymenoptera' is a scientific term used in biology and entomology to classify a large and diverse order of insects. It is not commonly used in everyday conversation. When discussing specific insects within this order, it is more common to use their common names, such as 'ants,' 'bees,' or 'wasps.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Hymenoptera in my garden, it was very beautiful.","correct":"✓ I saw a bee in my garden, it was very beautiful.","note":"In general conversation, use the common name (e.g., bee, wasp, ant) rather than the scientific term 'Hymenoptera'."}],"priority":"★☆☆"},"related_words":{"derivatives":["hymenopteran (noun: an insect belonging to the order Hymenoptera)","hymenopterous (adjective: relating to or belonging to the order Hymenoptera)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Hymenoptera' is a scientific classification used in biology and entomology. It refers to a specific order of insects characterized by their membranous wings. This term is typically encountered in academic or scientific contexts rather than in everyday conversation. Understanding this term requires a background in biology or entomology."},"example_sentences":[{"sentence":"The order Hymenoptera is one of the largest in the class Insecta.","translation":"ハチ目は昆虫綱の中で最も大きな目の一つである。","type":"noun","meaning_category":"ハチ目"},{"sentence":"Many Hymenoptera species exhibit complex social structures.","translation":"多くのハチ目の種は複雑な社会構造を示す。","type":"noun","meaning_category":"ハチ目"}]}