{"word":"micrographically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"微細に描写して、微細な文字で、微細構造に関して","english_definition":"In a manner that involves or relates to micrographs; using micrographic techniques; in terms of micrographic detail.","examples":[{"sentence":"The sample was analyzed micrographically to determine its composition.","translation":"その試料は、その組成を決定するために顕微鏡写真的に分析された。"},{"sentence":"The document was created micrographically, making it difficult to read without magnification.","translation":"その文書は微細な文字で作成されており、拡大しないと読むのが難しい。"}],"collocations":["analyzed micrographically","created micrographically","examined micrographically"],"synonyms":["detailedly","minutely","finely","precisely"],"antonyms":["macroscopically","generally","broadly"]}],"etymology":{"value":"Formed from 'micrographic' + '-ally'. 'Micrographic' combines 'micro-' (small) with '-graphic' (relating to writing or visual representation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈɡræfɪkli/","syllables":"mi-cro-graph-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Micrographically' describes actions or analyses performed at a microscopic level, often involving visual representation or detailed examination of minute structures. It is commonly used in scientific and technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist painted the mural micrographically.","correct":"✓ The artist painted the mural in great detail.","note":"'Micrographically' implies the use of microscopic techniques or extremely small writing, not just general detail. Using 'in great detail' is better if microscopy is not involved."},{"incorrect":"✗ He described the event micrographically.","correct":"✓ He described the event in vivid detail.","note":"Unless the description involves actual microscopic analysis, 'in vivid detail' or 'graphically' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["micrograph (noun): a photograph or visual record taken through a microscope or similar instrument.","micrographic (adjective): relating to micrographs or microphotography.","micrography (noun): the art or process of writing or drawing very small.","microminiature (adjective): extremely small"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'micrographically' is a technical term primarily used in scientific or technical contexts. It refers to doing something in a way that involves detailed microscopic analysis or very small writing. It is not a common word in everyday conversation and requires understanding of microscopy and related techniques to use correctly."},"example_sentences":[{"sentence":"The surface of the material was studied micrographically to identify defects.","translation":"その材料の表面は、欠陥を特定するために顕微鏡写真的に研究された。","type":"example","meaning_category":"microscopic analysis"},{"sentence":"The secret message was encoded micrographically on a grain of sand.","translation":"秘密のメッセージは、砂の一粒に微細な文字で符号化されていた。","type":"example","meaning_category":"microscopic writing"}]}