{"word":"self-perfectionment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己完成、自己啓発、自己改善","english_definition":"The act or process of improving oneself, especially morally or intellectually; self-improvement.","examples":[{"sentence":"She dedicated her life to self-perfectionment through rigorous study and meditation.","translation":"彼女は厳格な学習と瞑想を通して自己完成に人生を捧げた。"},{"sentence":"His pursuit of self-perfectionment led him to explore various philosophies and spiritual practices.","translation":"彼の自己完成の追求は、彼を様々な哲学や精神的な実践を探求させることになった。"},{"sentence":"The concept of self-perfectionment is central to many ethical and religious traditions.","translation":"自己完成の概念は、多くの倫理的および宗教的な伝統の中心にある。"}],"collocations":["pursuit of self-perfectionment (自己完成の追求)","path to self-perfectionment (自己完成への道)","striving for self-perfectionment (自己完成への努力)"],"synonyms":["self-improvement","self-cultivation","self-development","personal growth","spiritual growth"],"antonyms":["self-destruction","self-degradation","regression"]},{"part_of_speech":"noun","definition":"(哲学)自己完成主義","english_definition":"(Philosophy) The doctrine that self-perfection is the supreme goal of human life.","examples":[{"sentence":"Self-perfectionment, as a philosophical ideal, emphasizes the importance of developing one's full potential.","translation":"哲学的理想としての自己完成主義は、人が自身の潜在能力を最大限に開発することの重要性を強調する。"}],"collocations":[],"synonyms":["self-realization","actualization"],"antonyms":[]}],"etymology":{"value":"'Self-' + 'perfectionment'. 'Perfectionment' is a less common noun form of 'perfect', meaning the act or process of making something perfect or more perfect.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself pərˈfekʃənmənt/","syllables":"self-per-fec-tion-ment"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Self-perfectionment' is a relatively formal and less commonly used term compared to 'self-improvement'. It often implies a more profound or ambitious goal of achieving moral, intellectual, or spiritual excellence. It is frequently encountered in philosophical, religious, or ethical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doing self-perfection every day.","correct":"✓ He is practicing self-perfectionment every day. / ✓ He is working on his self-perfectionment every day.","note":"'Self-perfectionment' is a noun, so it's not typically used as a verb. Use verbs like 'practice', 'work on', or 'pursue' with it."}],"priority":"★★☆"},"related_words":{"derivatives":["perfect (adjective, verb)","perfection (noun)","perfectionism (noun)","self-improvement (noun)","self-cultivation (noun)"],"phrases":["pursue self-perfectionment","strive for self-perfectionment"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'self-perfectionment' is a somewhat formal and uncommon term that refers to the process of improving oneself, particularly in a moral, intellectual, or spiritual sense. It is often used in philosophical or religious contexts. It is similar to 'self-improvement' but often implies a more ambitious and profound goal.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient Stoics placed great emphasis on self-perfectionment as a means to achieving inner peace.","translation":"古代ストア派は、心の平安を達成する手段として自己完成を非常に重視した。","type":"noun","meaning_category":"自己完成"},{"sentence":"Her lifelong dedication to self-perfectionment was evident in her unwavering commitment to ethical principles.","translation":"彼女の生涯にわたる自己完成への献身は、倫理的原則への揺るぎないコミットメントに明らかだった。","type":"noun","meaning_category":"自己改善"},{"sentence":"He believed that self-perfectionment was a journey, not a destination, and that continuous effort was essential.","translation":"彼は、自己完成は目的地ではなく旅であり、継続的な努力が不可欠であると信じていた。","type":"noun","meaning_category":"自己啓発"}]}