{"word":"Untensible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Archaic) Incapable of being held or maintained; untenable.","english_definition":"(Archaic) Not capable of being defended against attack or criticism; impossible to maintain.","examples":[{"sentence":"The argument was untensible, and quickly fell apart under scrutiny.","translation":"その議論は維持できず、精査の下でたちまち崩壊した。"},{"sentence":"Their position on the matter became untensible as more evidence emerged.","translation":"より多くの証拠が出てくるにつれて、その問題に対する彼らの立場は擁護できなくなった。"}],"collocations":["untensible argument","untensible position","untensible claim"],"synonyms":["untenable","indefensible","unsustainable","insupportable"],"antonyms":["tenable","defensible","sustainable","supportable"]}],"etymology":{"value":"A variant spelling of 'untenable', formed from 'un-' (not) + 'tenable' (capable of being held or defended).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈtɛnsɪbəl/","syllables":"un-ten-si-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms. However, 'untensible' is rare enough that comparative/superlative forms are not commonly used."},"usage_notes":{"explanation":"'Untensible' is an archaic and less common variant of 'untenable'. 'Untenable' is the preferred and more widely recognized term. 'Untensible' is rarely used in modern English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The rope was untensible, so it broke.","correct":"✓ The rope was not strong enough, so it broke.","note":"'Untensible' refers to arguments or positions, not physical objects. Use 'not strong enough' or another appropriate adjective to describe a weak rope."},{"incorrect":"✗ His feelings were untensible.","correct":"✓ His feelings were uncontrollable.","note":"'Untensible' is not used to describe feelings. Use 'uncontrollable' or another appropriate adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["untenable (more common synonym)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (due to rarity)","frequency_google_ngram":"Very low frequency - virtually unused in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Untensible' is a rare and archaic word meaning 'untenable'. It is not commonly used in modern English. If you intend to convey that something cannot be defended or maintained, use 'untenable' instead. Due to its rarity, understanding and using 'untensible' is suitable for advanced learners who encounter it in older texts, but it is not recommended for general use."},"example_sentences":[{"sentence":"The politician's claims about the economy were ultimately proven untensible.","translation":"その政治家の経済に関する主張は、最終的に擁護できないことが証明された。","type":"adjective","meaning_category":"Incapable of being defended"},{"sentence":"The old theory became untensible in light of new scientific discoveries.","translation":"その古い理論は、新たな科学的発見に照らして維持できなくなった。","type":"adjective","meaning_category":"Impossible to maintain"}]}