{"word":"hypopituitarism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"下垂体機能低下症","english_definition":"A condition in which the pituitary gland does not produce sufficient amounts of one or more of its hormones.","examples":[{"sentence":"Hypopituitarism can lead to various hormonal deficiencies.","translation":"下垂体機能低下症は、様々なホルモン欠乏を引き起こす可能性がある。"},{"sentence":"The diagnosis of hypopituitarism requires careful hormonal evaluation.","translation":"下垂体機能低下症の診断には、慎重なホルモン評価が必要である。"}],"collocations":["cause of hypopituitarism","diagnosis of hypopituitarism","treatment of hypopituitarism","symptoms of hypopituitarism"],"synonyms":["pituitary insufficiency","pituitary hypofunction"],"antonyms":["hyperpituitarism"]},{"part_of_speech":"noun","definition":"(より詳細な定義)脳下垂体前葉から分泌される一つまたは複数のホルモンの分泌が低下または欠如している状態。","english_definition":"(More detailed definition) A state of decreased or absent secretion of one or more hormones produced by the anterior pituitary gland.","examples":[{"sentence":"Hypopituitarism can result in growth retardation in children.","translation":"下垂体機能低下症は、子供の成長遅延を引き起こす可能性がある。"},{"sentence":"Secondary hypopituitarism is caused by hypothalamic dysfunction.","translation":"二次性下垂体機能低下症は、視床下部の機能不全によって引き起こされる。"}],"collocations":["partial hypopituitarism","complete hypopituitarism","secondary hypopituitarism"],"synonyms":["anterior pituitary insufficiency"],"antonyms":["pituitary hyperfunction"]}],"etymology":{"value":"'hypo-' (under, deficient) + 'pituitary' (referring to the pituitary gland) + '-ism' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊpɪˈtjuːɪtərɪzəm/","syllables":"hy-po-pi-tu-i-ta-ri-sm"},"inflection":{"noun_plural":"hypopituitarisms"},"usage_notes":{"explanation":"Hypopituitarism is a medical term referring to a deficiency in one or more hormones produced by the pituitary gland. It can be caused by various factors, including tumors, injury, or genetic conditions. The specific symptoms and treatment depend on which hormones are deficient.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ hypopituitarism is cure by hormone replacement therapy.","correct":"✓ hypopituitarism is treated by hormone replacement therapy.","note":"'Cure' implies a complete resolution, while 'treated' is more accurate as hormone replacement manages the condition."},{"incorrect":"✗ The patient has a hypopituitarism.","correct":"✓ The patient has hypopituitarism.","note":"Hypopituitarism is a condition, not a countable object, so the article 'a' is not used."}],"priority":"★★☆"},"related_words":{"derivatives":["pituitary","hormone","hypopituitary"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypopituitarism' is a specialized medical term referring to a condition where the pituitary gland doesn't produce enough hormones. Understanding this term requires familiarity with medical terminology and the endocrine system. The word is constructed from prefixes and suffixes commonly used in medical contexts, such as 'hypo-' meaning 'under' or 'deficient,' and '-ism' indicating a condition or state. Due to its technical nature, it's primarily encountered in medical or scientific contexts."},"example_sentences":[{"sentence":"Untreated hypopituitarism can lead to life-threatening complications.","translation":"未治療の下垂体機能低下症は、生命を脅かす合併症を引き起こす可能性がある。","type":"general"},{"sentence":"Growth hormone deficiency is a common manifestation of hypopituitarism in children.","translation":"成長ホルモン欠乏症は、小児における下垂体機能低下症の一般的な症状である。","type":"symptom"},{"sentence":"MRI scans are often used to evaluate the pituitary gland in patients suspected of having hypopituitarism.","translation":"MRI検査は、下垂体機能低下症が疑われる患者の下垂体を評価するためによく使用される。","type":"diagnosis"},{"sentence":"Hormone replacement therapy is the standard treatment for most cases of hypopituitarism.","translation":"ホルモン補充療法は、ほとんどの下垂体機能低下症の標準的な治療法である。","type":"treatment"}]}