{"word":"Hyperdiatessaron","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical reconstruction of the Diatessaron, a gospel harmony compiled by Tatian in the 2nd century AD, based on the assumption that Tatian used a single, unknown gospel as his primary source and supplemented it with material from the other three canonical gospels.","english_definition":"A hypothetical reconstruction of Tatian's Diatessaron, assuming a single, unknown gospel as the primary source.","examples":[{"sentence":"Scholars have attempted to reconstruct the Hyperdiatessaron to understand the nature of the original Diatessaron.","translation":"学者たちは、元のディアテッサロンの性質を理解するために、ヒペルディアテッサロンの再構築を試みてきた。"}],"collocations":["reconstruct the Hyperdiatessaron","study the Hyperdiatessaron"],"synonyms":["reconstructed Diatessaron"],"antonyms":[]}],"etymology":{"value":"The term 'Hyperdiatessaron' is derived from 'Diatessaron,' the name of Tatian's gospel harmony, with the prefix 'hyper-' indicating a hypothetical reconstruction or an advanced form of the Diatessaron.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərdaɪəˈtɛsərɒn/","syllables":"Hy-per-di-a-tes-sa-ron"},"inflection":{"noun_plural":"Hyperdiatessarons"},"usage_notes":{"explanation":"The term 'Hyperdiatessaron' is primarily used in academic and theological contexts when discussing the textual history of the gospels and the reconstruction of early Christian texts. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Diatessaron"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Hyperdiatessaron' is a highly specialized term used in biblical studies and textual criticism. It refers to a specific type of reconstruction of an ancient gospel harmony. Understanding this term requires familiarity with the history of the New Testament texts and the methods of textual reconstruction."},"example_sentences":[{"sentence":"The Hyperdiatessaron hypothesis suggests that Tatian relied on a single, pre-existing gospel narrative.","translation":"ヒペルディアテッサロン仮説は、タティアヌスが単一の既存の福音書物語に依存していたことを示唆している。","type":"noun","meaning_category":"Hypothetical reconstruction"}]}