{"word":"verification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"検証、確認、立証","english_definition":"the process of establishing the truth, accuracy, or validity of something.","examples":[{"sentence":"The verification of her identity took several steps.","translation":"彼女の身元確認にはいくつかの段階が必要だった。"},{"sentence":"We need to perform a thorough verification of the data.","translation":"データの徹底的な検証を行う必要がある。"},{"sentence":"The software undergoes rigorous verification testing.","translation":"そのソフトウェアは厳格な検証テストを受ける。"}],"collocations":["data verification (データ検証)","identity verification (本人確認)","software verification (ソフトウェア検証)","verification process (検証プロセス)","verification system (検証システム)","successful verification (検証成功)","independent verification (独立検証)"],"synonyms":["confirmation","validation","authentication","corroboration","proof","substantiation","attestation"],"antonyms":["disproof","refutation","invalidation"]},{"part_of_speech":"noun","definition":"(法律)宣誓供述書","english_definition":"(law) a formal declaration made in the presence of an authorized officer, such as a notary public, confirming the truth of a statement or document.","examples":[{"sentence":"The affidavit required a verification by a notary.","translation":"宣誓供述書には公証人による認証が必要だった。"},{"sentence":"He signed the verification at the bottom of the document.","translation":"彼は書類の末尾にある宣誓供述書に署名した。"}],"collocations":["affidavit verification (宣誓供述書の認証)","legal verification (法的認証)","notary verification (公証人による認証)"],"synonyms":["affidavit","sworn statement","declaration under oath"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Old French, from medieval Latin verificatio(n- ), from Latin verificare ‘make true’ (see verify).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛrɪfɪˈkeɪʃən/","syllables":"ver-i-fi-ca-tion"},"inflection":{"noun_plural":"verifications"},"usage_notes":{"explanation":"\"Verification\" refers to the act of proving something to be true or accurate. It often involves checking facts, data, or procedures to ensure they meet certain standards or requirements. In a legal context, it can refer to a formal declaration confirming the truth of a document. The level of rigor involved in a verification process can vary depending on the context, from simple checks to complex testing and analysis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The verify of the data is important.","correct":"✓ The verification of the data is important.","note":"\"Verification\" is the noun form, while \"verify\" is the verb. Use the correct form depending on the grammatical structure of the sentence."},{"incorrect":"✗ We need to do a verify.","correct":"✓ We need to do a verification.","note":"Again, use the noun form \"verification\" when referring to the process itself."},{"incorrect":"✗ The verification was verify.","correct":"✓ The verification was verified.","note":"The correct past participle of \"verify\" is \"verified.\""}],"priority":"★★☆"},"related_words":{"derivatives":["verify (verb)","verifiable (adjective)","verifier (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"verification\" signifies the process of confirming the truth or accuracy of something. It's used in various contexts, including data analysis, identity checks, and legal proceedings. The term implies a systematic approach to ensure that information or claims are valid and reliable. While not an everyday word, it's essential in professional and academic settings where accuracy and trustworthiness are paramount. Understanding the concept of verification is crucial for critical thinking and decision-making.","note":"This explanation is aimed at a C1 level, assuming the reader has a good command of English and is familiar with abstract concepts."},"example_sentences":[{"sentence":"The bank requires verification of your address before opening an account.","translation":"銀行は口座開設の前に住所の確認を求めています。","type":"noun","meaning_category":"確認"},{"sentence":"Independent verification of the research findings is crucial for its acceptance.","translation":"研究結果の独立検証は、その受け入れにとって非常に重要です。","type":"noun","meaning_category":"検証"},{"sentence":"The election results underwent a thorough verification process.","translation":"選挙結果は徹底的な検証プロセスを経た。","type":"noun","meaning_category":"検証プロセス"},{"sentence":"The company uses a two-factor verification system to protect user accounts.","translation":"その会社は、ユーザーアカウントを保護するために二段階認証システムを使用している。","type":"noun","meaning_category":"検証システム"},{"sentence":"The legal document included a verification clause.","translation":"その法的文書には宣誓供述条項が含まれていた。","type":"noun","meaning_category":"(法律)宣誓供述書"}]}