{"word":"pitot","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピトー管（航空機などの速度を測定する装置）","english_definition":"A pitot tube is a pressure measurement instrument used to measure fluid flow velocity. It is widely used to determine the airspeed of an aircraft.","examples":[{"sentence":"The pitot tube on the aircraft was iced over, leading to inaccurate airspeed readings.","translation":"航空機のピトー管が凍結し、対気速度の測定値が不正確になった。"},{"sentence":"The engineer checked the pitot tube for any obstructions before the flight.","translation":"エンジニアは飛行前にピトー管に障害物がないか確認した。"}],"collocations":["pitot tube","pitot-static system","heated pitot tube"],"synonyms":["airspeed indicator","velocity sensor"],"antonyms":[]}],"etymology":{"value":"Named after French engineer Henri Pitot, who invented it in the early 18th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpiːtoʊ/","syllables":"pi-tot"},"inflection":{"noun_plural":"pitot tubes"},"usage_notes":{"explanation":"A pitot tube is a crucial component in aircraft for measuring airspeed. It works by measuring the total pressure (also known as stagnation pressure) of the air flowing into the tube. This pressure, along with the static pressure, is used to calculate the airspeed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pilot tube was blocked.","correct":"✓ The pitot tube was blocked.","note":"The correct term is 'pitot tube', not 'pilot tube'."}],"priority":"★★☆"},"related_words":{"derivatives":["pitot-static system"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pitot tube' is a technical term primarily used in the context of aviation and fluid dynamics. Understanding requires familiarity with basic physics concepts related to pressure and velocity measurement. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The aircraft's airspeed is determined by the difference between the dynamic pressure and static pressure measured by the pitot tube.","translation":"航空機の対気速度は、ピトー管で測定された動圧と静圧の差によって決定される。","type":"noun","meaning_category":"instrumentation"},{"sentence":"The pitot tube heater prevents ice from forming and blocking the tube.","translation":"ピトー管ヒーターは、氷が形成されて管を塞ぐのを防ぐ。","type":"noun","meaning_category":"aviation safety"}]}