{"word":"insubordinate-eyed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that express or suggest insubordination; defiant or rebellious in gaze.","english_definition":"Having eyes that express or suggest a lack of obedience or a rebellious attitude.","examples":[{"sentence":"The character was described as insubordinate-eyed, hinting at his rebellious nature.","translation":"その登場人物は反抗的な目をしていると描写されており、彼の反抗的な性格を示唆していた。"},{"sentence":"Her insubordinate-eyed stare made it clear she wouldn't follow orders blindly.","translation":"彼女の反抗的な目つきは、彼女が盲目的に命令に従うことはないだろうということを明らかにした。"}],"collocations":["insubordinate-eyed stare","insubordinate-eyed glance","with an insubordinate-eyed look"],"synonyms":["defiant-eyed","rebellious-eyed","mutinous-eyed","unruly-eyed","disobedient-eyed"],"antonyms":["obedient-eyed","submissive-eyed","compliant-eyed","docile-eyed"]}],"etymology":{"value":"A compound adjective formed by combining 'insubordinate' (not obeying authority) with 'eyed' (having eyes of a specified kind). The construction implies that the quality of insubordination is evident in the eyes.","priority":"Medium"},"pronunciation":{"ipa":"ɪnˌsʌˈbɔːrdɪnət aɪd","syllables":"in-sub-or-di-nate-eyed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This adjective is typically used in descriptive writing to quickly convey a character's rebellious or defiant nature through their gaze. It is not a common word in everyday conversation but can be effective in literary contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He was insubordinate eyed.","correct":"✓ He was insubordinate-eyed.","note":"The hyphen is necessary to connect the compound adjective. Without it, the phrase is grammatically incorrect."},{"incorrect":"✗ The insubordinate-eyed person.","correct":"✓ The insubordinate-eyed character.","note":"While grammatically correct, 'insubordinate-eyed person' is less evocative than using 'character' or another noun that implies a narrative context."}],"priority":"Low"},"related_words":{"derivatives":["insubordinate (adjective)","insubordination (noun)","eyed (suffix)"],"phrasal_verbs":[],"priority":"Low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low (rare, primarily found in literary contexts)","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'insubordinate-eyed' is a sophisticated adjective used to describe someone whose eyes convey a sense of defiance or lack of obedience. It is more commonly found in literature and descriptive writing rather than everyday speech. The word combines 'insubordinate,' meaning disobedient or rebellious, with 'eyed,' indicating that this quality is visible in the person's eyes. Understanding this word requires a good grasp of both its component parts and the context in which it is used."},"example_sentences":[{"sentence":"The pirate captain, insubordinate-eyed and scarred, surveyed his mutinous crew.","translation":"反抗的な目をし、傷跡のある海賊の船長は、反乱を起こした乗組員を見渡した。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"With an insubordinate-eyed glare, she challenged the authority of the court.","translation":"反抗的な目つきで、彼女は裁判所の権威に異議を唱えた。","type":"adjective","meaning_category":"Descriptive"}]}