{"word":"infusorium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"繊毛虫類（せんもうちゅうるい）","english_definition":"(plural infusoria) Any of a group of minute aquatic organisms, including protozoans, especially ciliates, formerly believed to arise spontaneously in infusions of decaying organic matter.","examples":[{"sentence":"The pond water teemed with infusoria.","translation":"池の水は繊毛虫類でいっぱいだった。"},{"sentence":"Early microscopists observed infusoria in hay infusions.","translation":"初期の顕微鏡研究者たちは、干し草の浸出液の中に繊毛虫類を観察した。"}],"collocations":["hay infusion infusoria","pond infusoria","microscopic infusoria"],"synonyms":["ciliate","protozoan"],"antonyms":[]},{"part_of_speech":"noun","definition":"培養液","english_definition":"A liquid medium used for culturing microorganisms.","examples":[{"sentence":"The infusorium provided a nutrient-rich environment for the bacteria.","translation":"培養液はバクテリアにとって栄養豊富な環境を提供した。"}],"collocations":["nutrient infusorium","bacterial infusorium"],"synonyms":["culture medium","broth"],"antonyms":[]}],"etymology":{"value":"From New Latin, from Latin infusus, past participle of infundere (\"to pour in\"), because they were first observed in infusions (liquids into which something has been steeped).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌfjuːˈzɔːriəm/","syllables":"in-fu-so-ri-um"},"inflection":{"noun_plural":"infusoria"},"usage_notes":{"explanation":"The term \"infusorium\" is somewhat outdated in modern scientific classification. It historically referred to a diverse group of microscopic organisms, especially ciliates, found in infusions of decaying organic matter. Today, these organisms are classified more precisely within various groups of protists and other microorganisms. The term may still be encountered in older literature or in general discussions about microscopic life.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Infusorium are animals.","correct":"✓ Infusoria are protists.","note":"Infusoria are not animals but rather protists, specifically ciliates and other microorganisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["infusion"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"infusorium\" is a technical term primarily used in historical or scientific contexts related to microbiology and early microscopy. It refers to microscopic organisms, especially ciliates, found in infusions. Due to its specialized nature, it's not commonly encountered in general language use."},"example_sentences":[{"sentence":"Leeuwenhoek was among the first to describe infusoria under the microscope.","translation":"レーウェンフックは顕微鏡で繊毛虫類を最初に記述した人物の一人だった。","type":"noun","meaning_category":"繊毛虫類"},{"sentence":"The biology class prepared an infusorium to study microorganisms.","translation":"生物学の授業では、微生物を研究するために培養液を準備した。","type":"noun","meaning_category":"培養液"}]}