{"word":"inurements","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)慣れさせること、順応させること、鍛錬すること","english_definition":"(plural form) The act or process of inuring; habituation; adaptation.","examples":[{"sentence":"The inurements to the cold weather made them strong.","translation":"寒さへの慣れは彼らを強くした。"}],"collocations":[],"synonyms":["habituation","adaptation","acclimatization","hardening","conditioning"],"antonyms":[],"notes":"'Inurement' (単数形) is less common than 'inurement to'. It refers to the process of becoming accustomed to something, especially something unpleasant or difficult."}],"etymology":{"value":"Derived from 'inure,' which comes from the Anglo-French 'enurer,' meaning 'to put into use, practice, or habituate.' Ultimately from Latin 'in' (in, into) + 'opus' (work).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈnjʊərmənts/","syllables":"i-nure-ments"},"inflection":{"noun_plural":"inurements"},"usage_notes":{"explanation":"'Inurements' refers to the processes or instances of becoming accustomed to something, often something unpleasant or challenging. It emphasizes the repeated exposure or experiences that lead to adaptation. The singular form, 'inurement,' is less frequently used.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["inure (verb): to accustom to hardship, difficulty, pain, etc.; harden or toughen.","inured (adjective): accustomed to hardship, difficulty, pain, etc.; hardened; toughened."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inurements' is a relatively uncommon word that refers to the process of becoming accustomed to something difficult or unpleasant. It is more frequently encountered in formal or technical contexts. Understanding the verb 'inure' is helpful for comprehending the meaning of 'inurements.'"},"example_sentences":[{"sentence":"The constant drills and exercises were part of their inurements to the rigors of military life.","translation":"絶え間ない訓練と演習は、軍隊生活の厳しさへの彼らの慣れの一部だった。","type":"noun","meaning_category":"慣れさせること"},{"sentence":"These inurements helped the athletes perform better under pressure.","translation":"これらの慣れは、アスリートがプレッシャーの下でより良いパフォーマンスを発揮するのに役立った。","type":"noun","meaning_category":"順応させること"},{"sentence":"The repeated exposure to the toxin led to certain inurements in the population.","translation":"毒素への繰り返しの暴露は、集団における特定の順応につながった。","type":"noun","meaning_category":"順応させること"}]}