{"word":"hypopharyngoscopy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"下咽頭鏡検査","english_definition":"A medical procedure in which a doctor uses a thin, flexible tube with a light and camera on the end (endoscope) to examine the hypopharynx (the lower part of the throat).","examples":[{"sentence":"The doctor recommended a hypopharyngoscopy to investigate the cause of my persistent sore throat.","translation":"医師は、私の持続的な喉の痛みの原因を調べるために、下咽頭鏡検査を勧めました。"},{"sentence":"Hypopharyngoscopy can help detect tumors or other abnormalities in the hypopharynx.","translation":"下咽頭鏡検査は、下咽頭の腫瘍やその他の異常を発見するのに役立ちます。"}],"collocations":["undergo hypopharyngoscopy","perform hypopharyngoscopy","rigid hypopharyngoscopy","flexible hypopharyngoscopy"],"synonyms":["laryngoscopy","endoscopy"],"antonyms":[]}],"etymology":{"value":"The word is derived from the following Greek roots: 'hypo-' (under, below), 'pharynx' (throat), and '-scopy' (to view or examine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˌfærɪŋˈɡɒskəpi/","syllables":"hy-po-phar-yn-gos-co-py"},"inflection":{"noun_plural":"hypopharyngoscopies"},"usage_notes":{"explanation":"Hypopharyngoscopy is a diagnostic procedure used to visualize the hypopharynx, which is located at the back of the throat, below the oropharynx (the part of the throat you can see when you open your mouth). It is often performed to evaluate symptoms such as persistent sore throat, difficulty swallowing, hoarseness, or the sensation of a lump in the throat. The procedure can be done with either a rigid or flexible endoscope.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a hypopharyngoscopy done on my stomach.","correct":"✓ I had a hypopharyngoscopy done on my throat.","note":"Hypopharyngoscopy is specifically for examining the throat (hypopharynx), not the stomach."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypopharyngeal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypopharyngoscopy' is a specialized medical term referring to a procedure to examine the hypopharynx. It is primarily used and understood within medical contexts. Due to its specificity, it is not commonly encountered in general conversation or writing."},"example_sentences":[{"sentence":"The ENT specialist performed a hypopharyngoscopy to rule out any cancerous growths.","translation":"耳鼻咽喉科医は、癌性の増殖がないか確認するために下咽頭鏡検査を実施しました。","type":"general","meaning_category":"medical procedure"},{"sentence":"During the hypopharyngoscopy, the doctor was able to take a biopsy of a suspicious lesion.","translation":"下咽頭鏡検査中、医師は疑わしい病変の生検を採取することができました。","type":"general","meaning_category":"medical procedure"}]}