{"word":"Tiffanyite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare gemstone composed of opalized fluorite, typically exhibiting a swirling pattern of purple, blue, and white.","english_definition":"A rare gemstone composed of opalized fluorite, typically exhibiting a swirling pattern of purple, blue, and white.","examples":[{"sentence":"The jeweler showcased a stunning Tiffanyite pendant.","translation":"宝石商は目を奪うようなティファニ石のペンダントを展示した。"},{"sentence":"Tiffanyite is prized for its unique colors and patterns.","translation":"ティファニ石はその独特の色と模様で珍重されている。"}],"collocations":["Tiffanyite gemstone","Tiffanyite pendant","Tiffanyite cabochon","Polished Tiffanyite","Raw Tiffanyite"],"synonyms":["Bertrandite","Opalized Fluorite"],"antonyms":[]}],"etymology":{"value":"Named after Tiffany & Co., though the gemstone is not directly associated with the company. The name was chosen to evoke a sense of luxury and rarity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪfənaɪt/","syllables":"tif-fa-ny-ite"},"inflection":{"noun_plural":"Tiffanyites"},"usage_notes":{"explanation":"Tiffanyite is a relatively new gemstone on the market, and information about it may be limited compared to more established gems. It's often used in jewelry making, particularly in cabochons and pendants, to showcase its swirling patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tiffanyite is a type of diamond.","correct":"✓ Tiffanyite is a type of opalized fluorite.","note":"Tiffanyite is not related to diamonds; it is a form of opalized fluorite."},{"incorrect":"✗ Tiffanyite is very hard and durable.","correct":"✓ Tiffanyite is relatively soft compared to other gemstones.","note":"Tiffanyite is relatively soft, so it requires careful handling to avoid scratches."}],"priority":"★★☆"},"related_words":{"derivatives":["Opal","Fluorite","Gemstone","Cabochon"],"phrases":["Rare gemstone","Swirling pattern","Purple gemstone","Blue gemstone"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tiffanyite is a rare gemstone composed of opalized fluorite. Its name is inspired by Tiffany & Co., though it is not affiliated with the company. It is known for its unique swirling patterns and colors, typically purple, blue, and white. Due to its relative softness, it requires careful handling. It is often used in jewelry, such as pendants and cabochons, to showcase its distinctive appearance.","priority":"★★☆"},"example_sentences":[{"sentence":"The collector added a rare Tiffanyite specimen to their collection.","translation":"収集家は珍しいティファニ石の標本をコレクションに加えた。","type":"noun","meaning_category":"Gemstone"},{"sentence":"The Tiffanyite pendant featured a beautiful swirling pattern.","translation":"そのティファニ石のペンダントは美しい渦巻き模様が特徴だった。","type":"noun","meaning_category":"Gemstone"},{"sentence":"Tiffanyite is often polished into cabochons for jewelry making.","translation":"ティファニ石はしばしば宝石製作のためにカボションに研磨される。","type":"noun","meaning_category":"Gemstone"}]}