{"word":"describent","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(分類学) 新種記載者、新種記載論文の著者","english_definition":"(taxonomy) The author of a description of a new species.","examples":[{"sentence":"The describent of this rare orchid is a renowned botanist.","translation":"この珍しい蘭の新種記載者は、著名な植物学者です。"},{"sentence":"The original describent's notes were invaluable in understanding the species' characteristics.","translation":"最初の新種記載者の記録は、その種の特徴を理解する上で非常に貴重でした。"}],"collocations":["original describent","first describent","noted describent","prominent describent"],"synonyms":["taxonomist","classifier","nomenclator"],"antonyms":[]}],"etymology":{"value":"From 'describe' + '-ent'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈskraɪbənt/","syllables":"de-scrib-ent"},"inflection":{"noun_plural":"describents"},"usage_notes":{"explanation":"The term 'describent' is primarily used in the context of taxonomy and biological nomenclature. It refers specifically to the person who first formally describes and names a new species or other taxon according to established scientific conventions. The describent's work is crucial for establishing the scientific identity and classification of the organism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The description was written by the describor.","correct":"✓ The description was written by the describent.","note":"'Describent' is the correct term in taxonomy, not 'describor'."}],"priority":"★☆☆"},"related_words":{"derivatives":["describe","description","descriptive"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'describent' is a specialized term used in the field of taxonomy. It refers to the person who first formally describes a new species or other taxon. Understanding this word requires familiarity with the scientific process of classifying organisms."},"example_sentences":[{"sentence":"Linnaeus is considered the describent of many plant species.","translation":"リンネは多くの植物種の新種記載者とみなされています。","type":"noun","meaning_category":"新種記載者"},{"sentence":"The describent carefully documented the unique characteristics of the newly discovered beetle.","translation":"新種記載者は、新しく発見された甲虫の独自の特徴を注意深く記録しました。","type":"noun","meaning_category":"新種記載者"}]}