{"word":"immortalization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不朽にすること、不滅化、永続化","english_definition":"the act of making someone or something immortal; the state of being immortalized.","examples":[{"sentence":"The artist sought immortalization through his art.","translation":"その芸術家は自身の芸術を通して不朽の名声を得ようとした。"},{"sentence":"The discovery led to the immortalization of the cell line.","translation":"その発見は、その細胞株の不死化につながった。"},{"sentence":"He achieved immortalization in the hearts of his fans.","translation":"彼はファンたちの心の中で不滅の存在となった。"}],"collocations":["achieve immortalization","seek immortalization","through immortalization","immortalization of memory","immortalization project"],"synonyms":["perpetuation","eternalization","memorialization","preservation"],"antonyms":["oblivion","extinction","annihilation"]}],"etymology":{"value":"The word \"immortalization\" is derived from \"immortalize,\" which comes from \"immortal\" (not subject to death) + \"-ize\" (to make). \"Immortal\" comes from Latin \"immortalis\" (not mortal), from \"im-\" (not) + \"mortalis\" (mortal).","priority":"★★☆"},"pronunciation":{"ipa":"ɪˌmɔːrtələˈzeɪʃən/","syllables":"im-mor-tal-i-za-tion"},"inflection":{"noun_plural":"immortalizations"},"usage_notes":{"explanation":"\"Immortalization\" refers to the process of making something or someone remembered forever, or the state of being made immortal, either literally or figuratively. It is often used in the context of art, literature, science, and historical events. In biology, it can refer to the process of making cells capable of dividing indefinitely.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The immortalization was achieved by a potion.","correct":"✓ Immortalization was achieved through a potion.","note":"\"By\" is less appropriate than \"through\" when describing the means or method by which immortalization is achieved."},{"incorrect":"✗ He wanted to immortalize his name, so he wrote a book.","correct":"✓ He wanted to achieve immortalization, so he wrote a book.","note":"The verb form \"immortalize\" is more appropriate when describing the action of making something immortal. \"Immortalization\" is the state or process."}],"priority":"★★☆"},"related_words":{"derivatives":["immortalize (verb)","immortal (adjective, noun)","mortality (noun)","mortal (adjective, noun)"],"related_concepts":["legacy","eternity","immortality","memorial","remembrance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"immortalization\" is a complex noun that refers to the act of making something immortal, or the state of being immortal. It's often used in contexts related to art, history, and science, where the goal is to preserve something indefinitely. Understanding the word requires a grasp of the root word \"immortal\" and the suffix \"-ization,\" which denotes a process or state. The word is relatively infrequent in everyday conversation but common in academic and literary contexts."},"example_sentences":[{"sentence":"The pharaohs sought immortalization through elaborate tombs and monuments.","translation":"ファラオたちは、手の込んだ墓や記念碑を通して不朽の名声を得ようとした。","type":"general","meaning_category":"不朽にすること"},{"sentence":"The immortalization of HeLa cells revolutionized medical research.","translation":"HeLa細胞の不死化は医学研究に革命をもたらした。","type":"scientific","meaning_category":"不滅化"},{"sentence":"Poetry can provide a form of immortalization for fleeting moments and emotions.","translation":"詩は、過ぎゆく瞬間や感情を不朽のものにする手段となりうる。","type":"literary","meaning_category":"永続化"}]}