{"word":"impersonalisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非人格化、個性の喪失、人間味の喪失","english_definition":"The act or process of removing personal characteristics or individuality; making something impersonal.","examples":[{"sentence":"The impersonalisation of modern society can lead to feelings of alienation.","translation":"現代社会の非人格化は、疎外感につながる可能性がある。"},{"sentence":"The company's impersonalisation of customer service has resulted in many complaints.","translation":"会社の顧客サービスの非人格化は、多くの苦情につながっている。"},{"sentence":"Some fear that technology will lead to the impersonalisation of human interaction.","translation":"テクノロジーが人間同士の交流の非人格化につながることを懸念する人もいる。"}],"collocations":["impersonalisation of customer service","impersonalisation of communication","impersonalisation of relationships","impersonalisation of society"],"synonyms":["dehumanization","objectification","alienation","standardization","commodification"],"antonyms":["personalization","humanization","individualization","customization"]},{"part_of_speech":"noun","definition":"（精神医学）離人症","english_definition":"(Psychiatry) A state in which one's thoughts and feelings seem unreal or not to belong to oneself, or in which one loses all sense of identity.","examples":[{"sentence":"One of the symptoms of her anxiety disorder was impersonalisation.","translation":"彼女の不安障害の症状の一つは離人症だった。"},{"sentence":"He experienced impersonalisation during the panic attack.","translation":"彼はパニック発作中に離人症を経験した。"},{"sentence":"Impersonalisation can be a distressing symptom of mental illness.","translation":"離人症は精神疾患の苦痛な症状となりうる。"}],"collocations":["symptoms of impersonalisation","experience impersonalisation","impersonalisation disorder"],"synonyms":["depersonalization","derealization"],"antonyms":[]}],"etymology":{"value":"\"Impersonal\" + \"-isation\". \"Impersonal\" comes from \"im-\" (not) + \"personal\". \"-isation\" is a suffix used to form nouns denoting a process or result.","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˌpɜːsənəlaɪˈzeɪʃən/","syllables":"im-per-son-a-li-sa-tion"},"inflection":{"noun_plural":"impersonalisations"},"usage_notes":{"explanation":"\"Impersonalisation\" can refer to the general process of making something impersonal, lacking human characteristics, or it can specifically refer to the psychiatric symptom of depersonalization, where a person feels detached from their own thoughts and feelings. The context usually makes the intended meaning clear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The impersonization of the company made it difficult to connect with customers.","correct":"✓ The impersonalisation of the company made it difficult to connect with customers.","note":"\"Impersonalisation\" (with an 's') is the correct spelling in British English. \"Impersonalization\" (with a 'z') is the correct spelling in American English. \"Impersonization\" is an incorrect spelling."},{"incorrect":"✗ She felt a strong sense of impersonation.","correct":"✓ She felt a strong sense of impersonalisation.","note":"\"Impersonation\" means pretending to be someone else. \"Impersonalisation\" refers to the loss of personal characteristics or the psychiatric symptom of depersonalization."}],"priority":"★★☆"},"related_words":{"derivatives":["impersonal (adjective)","impersonally (adverb)","personalisation (noun, opposite meaning)","depersonalisation (noun, often used interchangeably)"],"phrases":["impersonalisation disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"impersonalisation\" is a relatively complex term that refers to the process of making something impersonal or lacking in human characteristics. It can also refer to a psychiatric condition where a person feels detached from their own thoughts and feelings. Understanding this word requires a good grasp of abstract concepts and the ability to differentiate between its general and specific uses."},"example_sentences":[{"sentence":"The impersonalisation of online interactions can make it difficult to build meaningful relationships.","translation":"オンラインでのやり取りの非人格化は、有意義な関係を築くことを難しくする可能性がある。","type":"general"},{"sentence":"He described his experience of impersonalisation as feeling like he was watching himself from outside his body.","translation":"彼は、離人症の経験を、まるで自分の体を外から見ているような感覚だと説明した。","type":"psychiatric"}]}