{"word":"hot work","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(産業安全)火花、炎、または高温を伴う作業。溶接、切断、研削などが含まれる","english_definition":"(Industrial safety) Work that involves sparks, flames, or high temperatures, such as welding, cutting, or grinding.","examples":[{"sentence":"Hot work permits are required before any welding can begin.","translation":"溶接を開始する前に、火気作業許可が必要です。"},{"sentence":"Proper ventilation is crucial during hot work to prevent the build-up of flammable gases.","translation":"可燃性ガスの蓄積を防ぐために、火気作業中は適切な換気が不可欠です。"},{"sentence":"All hot work areas must be cleared of combustible materials.","translation":"すべての火気作業エリアから可燃性物質を取り除く必要があります。"}],"collocations":["hot work permit (火気作業許可)","hot work area (火気作業エリア)","perform hot work (火気作業を行う)","hot work safety (火気作業安全)","hot work equipment (火気作業機器)"],"synonyms":["welding","cutting","grinding","brazing","soldering"],"antonyms":["cold work"],"related_words":["fire watch","combustible materials","flammable gases","personal protective equipment (PPE)"]},{"part_of_speech":"noun","definition":"(軍事)激しい戦闘、激戦","english_definition":"(Military) Intense combat or fighting.","examples":[{"sentence":"The battalion saw a lot of hot work during the campaign.","translation":"その大隊は作戦中に多くの激戦を経験しました。"},{"sentence":"He earned a medal for his bravery in the hot work of the battle.","translation":"彼は激戦での勇敢さで勲章を授与されました。"}],"collocations":["see hot work (激戦を経験する)","in the hot work of battle (戦闘の激戦の中で)"],"synonyms":["intense combat","heavy fighting","fierce battle"],"antonyms":["peace","ceasefire"],"related_words":["front line","battlefield","engagement"]}],"etymology":{"value":"The term 'hot work' likely originated from the literal heat generated by processes like welding and cutting.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɒt wɜːrk/","syllables":"hot-work"},"inflection":{"notes":"It is a noun, so it has a plural form (hot works), but it is not commonly used."},"usage_notes":{"explanation":"The term 'hot work' has two primary meanings depending on the context. In industrial safety, it refers to any work that involves a potential source of ignition. In a military context, it refers to intense combat.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was doing hot work on his car in the garage.","correct":"✓ He was welding on his car in the garage.","note":"While 'hot work' is technically correct, it is more common to specify the type of hot work being done (e.g., welding, cutting)."},{"incorrect":"✗ The soldier was injured during hot work.","correct":"✓ The soldier was injured during heavy fighting.","note":"In a military context, it's more common to use phrases like 'heavy fighting' or 'intense combat' instead of 'hot work'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'hot work' has specific meanings in industrial safety and military contexts. It is important to understand the context to interpret the meaning correctly. In industrial safety, it refers to work that involves sparks, flames, or high temperatures. In a military context, it refers to intense combat. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The construction crew needed a hot work permit to weld the steel beams.","translation":"建設作業員は、鉄骨を溶接するために火気作業許可証が必要でした。","type":"noun","meaning_category":"Industrial safety"},{"sentence":"The soldiers endured hot work for days, fighting off the enemy advance.","translation":"兵士たちは数日間激戦に耐え、敵の進軍を阻止しました。","type":"noun","meaning_category":"Military"}]}