{"word":"radiations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"放射線、放射能","english_definition":"The emission of energy as electromagnetic waves or as moving subatomic particles, especially high-energy particles which cause ionization.","examples":[{"sentence":"Exposure to high levels of radiations can be harmful.","translation":"高レベルの放射線への暴露は有害となる可能性があります。"},{"sentence":"The device measures radiations levels in the area.","translation":"その装置は、その地域の放射線レベルを測定します。"},{"sentence":"Different types of radiations have different penetrating powers.","translation":"放射線の種類によって、透過力が異なります。"}],"collocations":["ionizing radiations (電離放射線)","background radiations (自然放射線)","electromagnetic radiations (電磁放射線)","nuclear radiations (核放射線)","cosmic radiations (宇宙放射線)","exposure to radiations (放射線への暴露)","effects of radiations (放射線の影響)","level of radiations (放射線レベル)"],"synonyms":["radioactivity","emission","energy waves","particle emission"],"antonyms":["absorption","shielding","containment"]},{"part_of_speech":"noun","definition":"(比喩的に)影響、効果、波及","english_definition":"(Figurative) The influence or effect spreading outwards from a central source.","examples":[{"sentence":"The radiations of his ideas spread throughout the scientific community.","translation":"彼のアイデアの影響は科学界全体に広がりました。"},{"sentence":"The radiations of the scandal reached even the smallest villages.","translation":"そのスキャンダルの影響は、最も小さな村々にまで及びました。"}],"collocations":["radiations of influence (影響の波及)","radiations of ideas (アイデアの波及)","radiations of consequences (結果の波及)"],"synonyms":["influence","effect","impact","spread","outreach"],"antonyms":["containment","isolation"]}],"etymology":{"value":"The word 'radiations' comes from the Latin word 'radiare,' meaning 'to emit rays, shine.' It is the plural form of 'radiation,' which refers to the process of emitting energy as waves or particles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdiˈeɪʃənz/","syllables":"ray-dee-ay-shuhnz"},"inflection":{"noun_plural":"radiations"},"usage_notes":{"explanation":"'Radiations' is typically used as the plural form of 'radiation,' referring to multiple instances or types of radiation. However, 'radiation' can also be used as an uncountable noun to refer to radiation in general. The plural form 'radiations' is often used when discussing different types of radiation or multiple sources of radiation. In a figurative sense, 'radiations' can refer to the spread of influence or effects from a central source.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiation are harmful.","correct":"✓ The radiations are harmful. / ✓ Radiation is harmful.","note":"When referring to multiple types or instances of radiation, use 'radiations.' When referring to radiation in general, use the singular uncountable noun 'radiation.'"},{"incorrect":"✗ He was exposed to radiation. It caused radiations.","correct":"✓ He was exposed to radiation. It caused radiation damage. / ✓ He was exposed to radiation. The radiations caused damage.","note":"'Radiations' should be used when referring to multiple types or sources. 'Radiation' is often used to describe the phenomenon in general."}],"priority":"★★☆"},"related_words":{"derivatives":["radiate (verb)","radiant (adjective)","radiator (noun)","radio (noun)","radioactive (adjective)","radioactivity (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'radiations' refers to the emission of energy as electromagnetic waves or particles, particularly those with high energy that can cause ionization. It is often used in scientific and technical contexts, such as nuclear physics, medicine, and environmental science. In a figurative sense, it can also refer to the spread of influence or effects. Understanding the context is crucial to interpreting the intended meaning. The word is generally used in more advanced discussions related to science, technology, and their impacts."},"example_sentences":[{"sentence":"The study examined the effects of different types of radiations on human cells.","translation":"その研究では、さまざまな種類の放射線がヒト細胞に及ぼす影響を調べました。","type":"noun","meaning_category":"放射線"},{"sentence":"The device is designed to detect low levels of radiations.","translation":"その装置は、低レベルの放射線を検出するように設計されています。","type":"noun","meaning_category":"放射線"},{"sentence":"The radiations of his philosophical ideas influenced many thinkers.","translation":"彼の哲学的思想の影響は、多くの思想家に影響を与えました。","type":"noun","meaning_category":"影響"},{"sentence":"The radiations from the nuclear accident spread across a wide area.","translation":"原子力事故からの放射線は広い地域に広がりました。","type":"noun","meaning_category":"放射線"},{"sentence":"The radiations of the company's success were felt throughout the industry.","translation":"その会社の成功の影響は、業界全体に感じられました。","type":"noun","meaning_category":"影響"}]}