{"word":"greencoat","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(歴史的に)グリニッジ病院の生徒；（現在では）観光ガイド、ツアーガイド","english_definition":"(Historically) A pupil at Greenwich Hospital; (now) a tourist guide, a tour guide.","examples":[{"sentence":"The greencoats led the tourists around the historic buildings.","translation":"緑色のコートを着たガイドたちが、観光客を歴史的建造物へと案内した。"},{"sentence":"He worked as a greencoat at the museum during the summer.","translation":"彼は夏の間、博物館で観光ガイドとして働いていた。"}],"collocations":["work as a greencoat","greencoat guide"],"synonyms":["tour guide","guide","docent"],"antonyms":[]},{"part_of_speech":"noun","definition":"緑色のコート","english_definition":"A green coat.","examples":[{"sentence":"She wore a greencoat to the park.","translation":"彼女は緑色のコートを着て公園に行った。"}],"collocations":["wear a greencoat"],"synonyms":["green coat"],"antonyms":[]}],"etymology":{"value":"From the green coats historically worn by pupils at Greenwich Hospital, and later by tourist guides.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːn.koʊt/","syllables":"green-coat"},"inflection":{"noun_plural":"greencoats"},"usage_notes":{"explanation":"The term \"greencoat\" originally referred to the students of Greenwich Hospital, who wore green coats as part of their uniform. Over time, it has come to be associated with tourist guides, especially in historical settings, who may or may not actually wear green coats. The term can also simply refer to a green coat.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a greencoat bird in the park.","correct":"✓ I saw a green bird in the park.","note":"'Greencoat' refers to a person (tour guide) or a green coat, not a type of bird. Use 'green bird' to describe a bird that is green."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Greenwich Hospital"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"greencoat\" can have two meanings. Historically, it referred to students at Greenwich Hospital who wore green coats. Nowadays, it often refers to tourist guides, especially in historical places. It can also simply mean a green coat. Context is important to understand the intended meaning. It is not a very common word.","priority":"★★☆"},"example_sentences":[{"sentence":"The **greencoats** at the palace provided fascinating historical insights.","translation":"宮殿の観光ガイドたちは、魅力的な歴史的洞察を提供してくれた。","type":"noun","meaning_category":"tour guide"},{"sentence":"She wrapped herself in a warm **greencoat** before venturing out into the cold.","translation":"彼女は寒さの中へ出かける前に、暖かい緑色のコートに身を包んだ。","type":"noun","meaning_category":"green coat"}]}