{"word":"wormhole","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ワームホール、時空のトンネル","english_definition":"A hypothetical topological feature of spacetime that would fundamentally be a shortcut connecting two separate points in spacetime.","examples":[{"sentence":"Scientists theorize that wormholes could potentially allow for faster-than-light travel.","translation":"科学者たちは、ワームホールが光速を超える移動を可能にする可能性があると理論立てている。"},{"sentence":"The science fiction movie featured a wormhole as a means of interstellar travel.","translation":"そのSF映画は、星間旅行の手段としてワームホールを扱っていた。"}],"collocations":["travel through a wormhole (ワームホールを通って移動する)","open a wormhole (ワームホールを開く)","close a wormhole (ワームホールを閉じる)","stable wormhole (安定したワームホール)","traversable wormhole (通過可能なワームホール)"],"synonyms":["Einstein-Rosen bridge","spacetime tunnel"],"antonyms":[]}],"etymology":{"value":"The term 'wormhole' was coined by American theoretical physicist John A. Wheeler in 1957. The name is derived from the analogy of an apple with a worm burrowing through it, creating a shortcut between two points on the apple's surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrmhoʊl/","syllables":"worm-hole"},"inflection":{"noun_plural":"wormholes"},"usage_notes":{"explanation":"Wormholes are theoretical constructs in spacetime, predicted by the theory of general relativity.  They are often depicted in science fiction as shortcuts through the universe, allowing for travel over vast distances in a short amount of time.  However, their existence has not been proven, and even if they exist, it is unknown whether they would be traversable or stable. The term is primarily used in the context of theoretical physics and science fiction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a wormhole in my garden.","correct":"✓ I saw a worm in my garden.","note":"Wormholes are theoretical features of spacetime, not something you would see in a garden. Use 'worm' for the animal. "},{"incorrect":"✗ Wormholes are proven to exist.","correct":"✓ Wormholes are theorized to exist.","note":"The existence of wormholes is still theoretical and has not been proven."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["general relativity","spacetime","black hole","singularity","cosmology","theoretical physics","astrophysics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency outside of scientific and science fiction contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'wormhole' refers to a theoretical concept in physics and is commonly used in science fiction. It describes a hypothetical shortcut through spacetime, connecting two distant points. Understanding this word requires some familiarity with concepts like spacetime and general relativity. It's not a word used in everyday conversation but is more likely to appear in scientific articles, documentaries, or science fiction stories."},"example_sentences":[{"sentence":"The spaceship used a **wormhole** to travel to a distant galaxy.","translation":"その宇宙船はワームホールを使って遠い銀河へ移動した。","type":"noun","meaning_category":"時空のトンネル"},{"sentence":"Scientists are still researching the possibility of creating a stable **wormhole**.","translation":"科学者たちは、安定したワームホールを作り出す可能性についてまだ研究している。","type":"noun","meaning_category":"時空のトンネル"},{"sentence":"The novel explores the implications of using **wormholes** for time travel.","translation":"その小説は、タイムトラベルにワームホールを使用することの影響を探求している。","type":"noun","meaning_category":"時空のトンネル"}]}