{"word":"fruit-eater","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"果実食動物、果食主義者","english_definition":"An animal or person that primarily eats fruit.","examples":[{"sentence":"Bats are important fruit-eaters in many tropical ecosystems.","translation":"コウモリは、多くの熱帯生態系において重要な果実食動物です。"},{"sentence":"Some people choose to be fruit-eaters for ethical or health reasons.","translation":"倫理的または健康上の理由から、果食主義者になることを選ぶ人もいます。"}],"collocations":["fruit-eating bats","fruit-eating birds","strict fruit-eater"],"synonyms":["frugivore"],"antonyms":["carnivore","herbivore","omnivore"]}],"etymology":{"value":"'Fruit' + 'eater'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfruːtˌiːtər/","syllables":"fruit-eat-er"},"inflection":{"noun_plural":"fruit-eaters"},"usage_notes":{"explanation":"The term 'fruit-eater' is used to describe animals or people whose diet consists mainly of fruits. The more scientific term for a fruit-eating animal is 'frugivore'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a fruit eater. I eat only apples.","correct":"✓ I am a fruit-eater. I eat mostly apples.","note":"'Fruit-eater' implies a diet primarily of fruit, not necessarily exclusively."},{"incorrect":"✗ Fruit eater animals are important for seed dispersal.","correct":"✓ Fruit-eater animals are important for seed dispersal.","note":"Compound nouns like 'fruit-eater' are typically written as one word or hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":["fruitarian","frugivorous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'fruit-eater' refers to an animal or person whose primary food source is fruit. This word is straightforward in its meaning, combining 'fruit' and 'eater' to describe the diet. It's often used in ecological contexts to describe animals that play a role in seed dispersal or in discussions about dietary choices. A more formal synonym is 'frugivore,' which is commonly used in scientific literature."},"example_sentences":[{"sentence":"The rainforest is home to many fruit-eaters, including monkeys and parrots.","translation":"熱帯雨林には、サルやオウムなど、多くの果実食動物が生息しています。","type":"noun","meaning_category":"果実食動物"},{"sentence":"As a fruit-eater, she avoids all vegetables and grains.","translation":"果食主義者として、彼女はすべての野菜と穀物を避けています。","type":"noun","meaning_category":"果食主義者"}]}