{"word":"Nonfigurativeness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抽象性、非具象性、比喩的でないこと","english_definition":"The quality or state of being nonfigurative; lacking representation of concrete objects or realistic forms; not using figures of speech.","examples":[{"sentence":"The nonfigurativeness of the painting made it difficult to interpret.","translation":"その絵画の抽象性ゆえに、解釈が困難だった。"},{"sentence":"The author chose nonfigurativeness to convey a sense of ambiguity.","translation":"作者は曖昧さを伝えるために非具象性を選んだ。"}],"collocations":["artistic nonfigurativeness (芸術的な非具象性)","literary nonfigurativeness (文学的な非比喩性)"],"synonyms":["abstraction","nonrepresentationalism","abstractness","non-representation"],"antonyms":["figurativeness","representation","realism"]}],"etymology":{"value":"Formed from \"non-\" (prefix meaning \"not\") + \"figurativeness\" (the state of being figurative, from \"figurative,\" ultimately from Latin \"figura\" meaning \"shape, form, figure\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈfɪɡjərətɪvnəs/","syllables":"non-fig-u-ra-tive-ness"},"inflection":{"noun_plural":"Nonfigurativenesses (rarely used)"},"usage_notes":{"explanation":"\"Nonfigurativeness\" refers to the absence of recognizable figures or forms in art, literature, or other forms of expression. It is often associated with abstract art and can also describe writing that avoids metaphorical or symbolic language. The term is relatively uncommon in everyday conversation but is frequently used in art criticism and literary analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonfigurativeness is very good.","correct":"✓ The degree of nonfigurativeness is very high.","note":"\"Nonfigurativeness\" is a quality or state, so it's better to quantify it with terms like \"degree,\" \"level,\" or \"extent.\" Avoid treating it as a directly measurable attribute."}],"priority":"★★☆"},"related_words":{"derivatives":["nonfigurative (adjective)"],"related_terms":["abstract art","abstraction","nonrepresentational art","figurative","figurativeness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonfigurativeness\" is a somewhat technical term, primarily used in the context of art and literature. It describes the degree to which something lacks recognizable figures or realistic representation. Understanding this word requires familiarity with abstract art and literary theory. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The critic praised the artist's commitment to complete nonfigurativeness.","translation":"評論家は、芸術家の完全な非具象性へのコミットメントを称賛した。","type":"noun","meaning_category":"抽象性"},{"sentence":"The poem's nonfigurativeness made it open to multiple interpretations.","translation":"その詩の非比喩性により、複数の解釈が可能になった。","type":"noun","meaning_category":"比喩的でないこと"},{"sentence":"The trend towards nonfigurativeness in sculpture began in the early 20th century.","translation":"彫刻における非具象性への傾向は、20世紀初頭に始まった。","type":"noun","meaning_category":"非具象性"}]}