{"word":"inversionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文法)倒置法の使用者、倒置法を好む人","english_definition":"A person who uses or favors inversion, especially in grammar or rhetoric.","examples":[{"sentence":"The inversionist argued that placing the adjective after the noun created a more poetic effect.","translation":"その倒置法主義者は、形容詞を名詞の後に置くことで、より詩的な効果が生まれると主張した。"}],"collocations":["grammatical inversionist","rhetorical inversionist"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(精神医学、古)同性愛者、性的倒錯者","english_definition":"(historical, psychiatry) A homosexual person; a person with a sexual perversion.","examples":[{"sentence":"In early 20th-century psychiatric texts, 'inversionist' was sometimes used as a clinical term for homosexuals.","translation":"20世紀初頭の精神医学の文献では、「倒錯者」は同性愛者の臨床用語として使われることがあった。"}],"collocations":["sexual inversionist"],"synonyms":["homosexual (dated)","sexual invert (dated)"],"antonyms":[]}],"etymology":{"value":"From 'inversion' + '-ist'. 'Inversion' comes from Latin 'inversio', meaning 'a turning upside down or inside out'. The term was used in the late 19th and early 20th centuries in sexology and psychiatry to describe individuals whose sexual characteristics or desires were seen as 'inverted' from the norm.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈvɜːrʃənɪst/","syllables":"in-ver-sion-ist"},"inflection":{"noun_plural":"inversionists"},"usage_notes":{"explanation":"The term 'inversionist' has two primary historical contexts. In grammar and rhetoric, it refers to someone who uses or advocates for inversion, which is the reversal of the normal order of words. In historical psychiatry and sexology, 'inversionist' was a term used to describe homosexuals or individuals with other forms of sexual 'perversion', based on the now-outdated idea that their sexual characteristics were 'inverted' from the norm. This usage is now considered offensive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an inversionist because he likes to stand on his head.","correct":"✓ He is an acrobat, not an inversionist.","note":"'Inversionist' does not refer to someone who physically inverts their body, but rather to someone who uses inversion in language or, historically, to a homosexual person."}],"priority":"★☆☆"},"related_words":{"derivatives":["inversion (noun)","invert (verb)","inverted (adjective)"],"related_terms":["inversion therapy (unrelated)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'inversionist' is rare and has specialized meanings. It can refer to someone who uses inversion in grammar or rhetoric, or, historically and now offensively, to a homosexual person. Understanding its meaning requires knowledge of these specific contexts. The historical usage is particularly sensitive and should be avoided.","note":"This word has a potentially offensive historical usage and should be used with extreme caution, if at all."},"example_sentences":[{"sentence":"The professor, a noted inversionist, often rearranged sentence structures for emphasis.","translation":"その教授は、著名な倒置法主義者で、強調のためにしばしば文の構造を並べ替えた。","type":"noun","meaning_category":"Grammar/Rhetoric"},{"sentence":"Early sexologists sometimes labeled homosexuals as 'inversionists,' a term now considered outdated and offensive.","translation":"初期の性科学者は、同性愛者を「倒錯者」と呼ぶことがあったが、この用語は現在では時代遅れで侮辱的だと考えられている。","type":"noun","meaning_category":"Historical (Offensive)"}]}