{"word":"nonsterilization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非滅菌、不妊化の否定","english_definition":"The absence of sterilization; the state of not being sterilized.","examples":[{"sentence":"The nonsterilization of medical equipment can lead to infections.","translation":"医療機器の非滅菌は感染症を引き起こす可能性があります。"},{"sentence":"The company was criticized for its nonsterilization practices.","translation":"その会社は非滅菌慣行で批判されました。"}],"collocations":["nonsterilization process","nonsterilization technique","nonsterilization method"],"synonyms":["unsterilized","non-sterile"],"antonyms":["sterilization","sterile"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'sterilization'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌstɛrɪlaɪˈzeɪʃən/","syllables":"non-ster-i-li-za-tion"},"inflection":{"noun_plural":"nonsterilizations"},"usage_notes":{"explanation":"'Nonsterilization' refers to the condition or process where something is not made free from living microorganisms, such as bacteria or viruses. It's often used in medical or industrial contexts where sterilization is crucial.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonsterilization is good for the environment.","correct":"✓ Avoiding sterilization might be good for the environment in some cases, but it's not the primary meaning of 'nonsterilization'.","note":"'Nonsterilization' refers to the state of something not being sterilized, not a general benefit."}],"priority":"★★☆"},"related_words":{"derivatives":["sterilize","sterilization","unsterilized"],"related_terms":["disinfection","antisepsis","asepsis"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonsterilization' is a technical term primarily used in medical, scientific, and industrial contexts. It refers to the state of something not being sterilized, meaning it still contains living microorganisms. Due to its specific usage, it is more commonly encountered in specialized literature and discussions rather than general conversation."},"example_sentences":[{"sentence":"The risk of infection is higher with nonsterilization.","translation":"非滅菌の場合、感染のリスクが高くなります。","type":"general"},{"sentence":"Proper sterilization protocols are essential to prevent nonsterilization.","translation":"適切な滅菌プロトコルは、非滅菌を防ぐために不可欠です。","type":"medical"}]}