{"word":"reinterment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再埋葬、改葬","english_definition":"the act of burying a body again, especially after it has been disinterred.","examples":[{"sentence":"The family decided on reinterment in the family plot.","translation":"家族は家族の墓地への再埋葬を決定した。"},{"sentence":"The reinterment ceremony was a private affair.","translation":"再埋葬の儀式は内輪で行われた。"},{"sentence":"After the archaeological dig, the remains underwent reinterment.","translation":"考古学的発掘の後、遺体は再埋葬された。"}],"collocations":["ceremony of reinterment","site of reinterment","request for reinterment"],"synonyms":["reburial"],"antonyms":["disinterment","exhumation"]}],"etymology":{"value":"\"re-\" (再び) + \"interment\" (埋葬)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈtɜːrmənt/","syllables":"re-in-ter-ment"},"inflection":{"noun_plural":"reinterments"},"usage_notes":{"explanation":"\"Reinterment\" refers specifically to the act of burying remains that have previously been buried and then exhumed (taken out of the ground). It often occurs when remains are moved to a new location, or after they have been studied for historical or scientific purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The interment happened after the reinterment.","correct":"✓ The reinterment happened after the disinterment.","note":"Reinterment follows disinterment (exhumation). Interment is the initial burial."}],"priority":"★★☆"},"related_words":{"derivatives":["reinter (verb): 再埋葬する","interment (noun): 埋葬","disinterment (noun): 発掘、掘り起こし"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reinterment\" is a formal term that describes the act of burying a body again after it has been removed from its initial burial place. This often happens when remains are moved to a more suitable or desired location, or after they have been exhumed for examination or study. Because it is a specific and somewhat uncommon term, it is more likely to be encountered in formal writing, historical contexts, or discussions related to archaeology and funerary practices."},"example_sentences":[{"sentence":"The remains of the queen underwent reinterment in the royal mausoleum.","translation":"女王の遺体は王室霊廟に再埋葬された。","type":"general","meaning_category":"再埋葬"},{"sentence":"The museum oversaw the reinterment of the indigenous artifacts.","translation":"博物館は先住民の工芸品の再埋葬を監督した。","type":"general","meaning_category":"再埋葬"},{"sentence":"The family held a private ceremony for the reinterment of their loved one.","translation":"家族は愛する人の再埋葬のために内密な儀式を執り行った。","type":"general","meaning_category":"再埋葬"}]}