{"word":"suburb-centric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"郊外中心の、郊外に偏った","english_definition":"Focused on or biased towards the suburbs; designed primarily for the needs or preferences of suburban residents.","examples":[{"sentence":"The city's transportation plan was criticized for being too suburb-centric, neglecting the needs of downtown residents.","translation":"その都市の交通計画は、郊外中心に偏りすぎており、都心居住者のニーズを無視していると批判された。"},{"sentence":"Many argue that American culture is suburb-centric, with an emphasis on single-family homes and car-dependent lifestyles.","translation":"多くの人が、アメリカ文化は郊外中心であり、一戸建て住宅と自動車依存のライフスタイルを重視していると主張している。"},{"sentence":"The new shopping mall is very suburb-centric, with large parking lots and chain stores.","translation":"その新しいショッピングモールは、広い駐車場とチェーン店があり、非常に郊外中心である。"}],"collocations":["suburb-centric development (郊外中心の開発)","suburb-centric policies (郊外中心の政策)","suburb-centric lifestyle (郊外中心のライフスタイル)","suburb-centric planning (郊外中心の計画)"],"synonyms":["suburban-focused","suburban-oriented","suburban-biased"],"antonyms":["urban-centric","city-centric","downtown-centric"]}],"etymology":{"value":"The word is formed by combining \"suburb\" (an area on the edge of a city or town) with \"-centric\" (having something as its center).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbɜːrb ˈsɛntrɪk/","syllables":"sub-urb-cen-tric"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns. Comparative and superlative forms (more suburb-centric, most suburb-centric) are possible but less common."},"usage_notes":{"explanation":"\"Suburb-centric\" is used to describe something that prioritizes or caters primarily to the suburbs, often at the expense of urban areas or other communities. It can be used in a neutral or critical way, depending on the context. It often implies a focus on car-dependent infrastructure, single-family housing, and other characteristics commonly associated with suburban development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very center-suburb.","correct":"✓ The city is very suburb-centric.","note":"The correct term is \"suburb-centric,\" not \"center-suburb.\""},{"incorrect":"✗ The plan is suburb center.","correct":"✓ The plan is suburb-centric.","note":"\"Suburb center\" is not the correct term to describe a focus on the suburbs. Use \"suburb-centric\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["suburb (名詞: 郊外)","centric (接尾辞: ～中心の)"],"related_terms":["urban-centric","city-centric","exurb","sprawl","urban sprawl","suburbanization"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency; more common in academic or policy discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Suburb-centric\" is a relatively specialized term used to describe policies, planning, or perspectives that primarily benefit or focus on suburban areas. It often implies a bias towards suburban lifestyles and infrastructure, potentially at the expense of urban or rural areas. Understanding this term requires familiarity with the characteristics of suburban development and the potential consequences of prioritizing suburban needs over those of other communities."},"example_sentences":[{"sentence":"The county's zoning laws are largely suburb-centric, promoting low-density residential development.","translation":"その郡のゾーニング法は、主に郊外中心であり、低密度の住宅開発を促進している。","type":"general","meaning_category":"general"},{"sentence":"Critics argue that the highway expansion project is a suburb-centric boondoggle that will only increase traffic congestion.","translation":"批評家たちは、その高速道路拡張プロジェクトは、交通渋滞を悪化させるだけの郊外中心の無駄遣いだと主張している。","type":"critical","meaning_category":"critical"},{"sentence":"The suburb-centric design of the community made it difficult for residents without cars to access essential services.","translation":"そのコミュニティの郊外中心の設計は、車を持たない住民が不可欠なサービスにアクセスすることを困難にした。","type":"descriptive","meaning_category":"descriptive"}]}