{"word":"rifted","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"N/A","definition":"(geology) past tense and past participle of 'rift'; to form or develop rifts (long, narrow cracks or breaks) in something, especially in the earth's crust.","english_definition":"Having undergone the process of rifting; characterized by the presence of rifts.","examples":[{"sentence":"The area is heavily rifted due to tectonic activity.","translation":"その地域は、地殻変動により大きく裂けている。"},{"sentence":"The rifted landscape was dramatic and desolate.","translation":"裂け目の入った地形は劇的で荒涼としていた。"},{"sentence":"We studied the rifted zones to understand the geological history.","translation":"地質学的歴史を理解するために、裂け目の入った地帯を調査した。"}],"collocations":["heavily rifted","rifted zones","rifted landscape","rifted terrain","rifted valley"],"synonyms":["fractured","cracked","split","fissured"],"antonyms":["unbroken","intact","continuous"]}],"etymology":{"value":"Derived from the verb 'rift,' which comes from Old Norse 'ript' meaning 'breach, crack.' The past tense and past participle 'rifted' describes a state or condition resulting from the process of rifting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɪftɪd/","syllables":"rif-ted"},"inflection":{"verb_forms":{"present_simple":["rift"],"past_simple":"rifted","past_participle":"rifted","present_participle":"rifting"}},"usage_notes":{"explanation":"'Rifted' is primarily used in geological contexts to describe areas where the earth's crust has been pulled apart, creating rifts. It can also be used more generally to describe something that has cracks or splits. The word emphasizes the result of the rifting process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relationship was rifted after the argument.","correct":"✓ The relationship was strained after the argument. / ✓ A rift developed in the relationship after the argument.","note":"While 'rift' can be used metaphorically to describe a serious disagreement, 'rifted' is less commonly used in this context. 'Strained' or 'a rift developed' are more common and natural-sounding alternatives."}],"priority":"★★☆"},"related_words":{"derivatives":["rift (noun): a crack, split, or break in something; a serious disagreement that separates people.","rifting (noun): the process of forming rifts.","rift valley (noun): a valley formed by rifting.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary - geology)","frequency_google_ngram":"Low frequency (primarily used in specific geological or technical contexts).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rifted' is a technical term mainly used in geology. It describes an area or landscape that has been affected by the formation of rifts, which are long, narrow cracks or breaks in the earth's crust. If you're not studying geology, you're unlikely to encounter this word frequently. However, understanding it can help you grasp descriptions of geographical features and tectonic processes."},"example_sentences":[{"sentence":"The satellite images showed a clearly **rifted** region in East Africa.","translation":"衛星画像は、東アフリカの明らかに地割れした地域を示していた。","type":"adjective","meaning_category":"geology"},{"sentence":"The **rifted** terrain made travel difficult and dangerous.","translation":"地割れした地形は旅行を困難かつ危険にした。","type":"adjective","meaning_category":"geography"},{"sentence":"The basalt rock was **rifted** by ancient lava flows.","translation":"玄武岩は古代の溶岩流によって裂けていた。","type":"adjective","meaning_category":"geology"}]}