{"word":"veld-kost","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(South Africa) Food obtained from the veld (open country), such as edible plants and small animals.","english_definition":"(South Africa) Food obtained from the veld, such as edible plants and small animals.","examples":[{"sentence":"During the Boer War, many civilians relied on veld-kost to survive.","translation":"ボーア戦争中、多くの民間人が生き残るためにveld-kostに頼った。"},{"sentence":"Learning about veld-kost is an important survival skill in the South African bush.","translation":"veld-kostについて学ぶことは、南アフリカのブッシュにおける重要なサバイバルスキルである。"}],"collocations":["eating veld-kost","surviving on veld-kost","traditional veld-kost"],"synonyms":["bush food","foraged food","wild food"],"antonyms":[]}],"etymology":{"value":"From Afrikaans veldkos, from veld (“field, open country”) + kos (“food”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛltˌkɒst/","syllables":"veld-kost"},"inflection":{"noun_plural":"veld-kosts"},"usage_notes":{"explanation":"Veld-kost refers specifically to food sourced directly from the South African veld. It encompasses a range of edible plants, insects, and small animals that can be foraged or hunted. The term is often associated with survival situations or traditional lifestyles in rural areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought veld-kost at the supermarket.","correct":"✓ I foraged veld-kost in the veld.","note":"Veld-kost is obtained directly from the veld, not purchased in a store."}],"priority":"★☆☆"},"related_words":{"derivatives":["veld (field, open country)","kos (food)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Veld-kost' is a specialized term used in South Africa to describe food sourced directly from the veld, or open country. It's not a common word outside of this context, so understanding its meaning requires familiarity with South African culture and history. The term is most likely to appear in literature or discussions related to survival skills, traditional lifestyles, or the Boer War.","requires_context":true},"example_sentences":[{"sentence":"The indigenous people have a deep knowledge of veld-kost.","translation":"先住民はveld-kostに関する深い知識を持っている。","type":"noun","meaning_category":"food from the veld"},{"sentence":"During the trek, they supplemented their rations with veld-kost.","translation":"トレッキング中、彼らは配給食をveld-kostで補った。","type":"noun","meaning_category":"food from the veld"}]}