{"word":"archaeolater","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A worshiper of ancient things or customs.","english_definition":"One who worships or excessively admires ancient things or customs.","examples":[{"sentence":"The archaeolater clung to outdated traditions, resisting any form of progress.","translation":"その古代崇拝者は時代遅れの伝統に固執し、あらゆる形の進歩に抵抗した。"},{"sentence":"Some critics accused the museum curator of being an archaeolater, favoring old artifacts over contemporary art.","translation":"一部の批評家は、その美術館の学芸員が現代アートよりも古い工芸品を好む古代崇拝者だと非難した。"}],"collocations":["extreme archaeolater","staunch archaeolater","cultural archaeolater"],"synonyms":["antiquarian","traditionalist","classicist","archaist"],"antonyms":["futurist","modernist","innovator"]}],"etymology":{"value":"From 'archaeo-' (ancient) + 'later' (worshiper), combining elements indicating a focus on and reverence for ancient things.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrkiˈɒlətər/","syllables":"ar-chae-o-la-ter"},"inflection":{"noun_plural":"archaeolaters"},"usage_notes":{"explanation":"'Archaeolater' is a relatively rare term used to describe someone who excessively admires or worships ancient things or customs. It often carries a negative connotation, suggesting an excessive attachment to the past that hinders progress or appreciation of the present.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an archaeolator of modern art.","correct":"✓ He is a critic of modern art.","note":"'Archaeolater' implies admiration for ancient things, not modern ones."},{"incorrect":"✗ Archaeolaters are always historians.","correct":"✓ Some historians might be considered archaeolaters if they excessively value the past.","note":"While historians study the past, not all are archaeolaters, as the term implies worshipful admiration."}],"priority":"★★☆"},"related_words":{"derivatives":["archaeolatry (noun: worship of ancient things)"],"phrases":["cultural archaeolatry","historical archaeolatry"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'archaeolater' is a niche term, typically encountered in academic or specialized discussions concerning cultural attitudes toward history and tradition. Its usage implies a critical perspective on excessive reverence for the past. Understanding the term requires a grasp of its etymological components and the nuances of its negative connotation."},"example_sentences":[{"sentence":"The professor was labeled an archaeolater for his unwavering defense of classical literature.","translation":"その教授は古典文学に対する揺るぎない擁護から、古代崇拝者というレッテルを貼られた。","type":"general","meaning_category":"worship of ancient things"},{"sentence":"Her archaeolatry was evident in her refusal to adopt any modern technology.","translation":"彼女の古代崇拝は、現代技術を一切受け入れないことに明らかだった。","type":"behavioral","meaning_category":"excessive admiration of customs"}]}