{"word":"extrapersonal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"個人的な範囲を超えた、個人的な関係を超越した、人間関係を超えた","english_definition":"Beyond or outside the personal; transcending personal relationships or concerns; impersonal.","examples":[{"sentence":"The artist sought to explore extrapersonal themes in their work, focusing on universal experiences.","translation":"そのアーティストは、普遍的な経験に焦点を当て、作品の中で個人的なテーマを超越したものを探求しようとした。"},{"sentence":"Meditation can help individuals connect with extrapersonal aspects of existence.","translation":"瞑想は、個人が実存の個人的範囲を超えた側面とつながるのを助けることができる。"},{"sentence":"The study examined the impact of extrapersonal factors, such as economic conditions, on community well-being.","translation":"その研究は、経済状況のような個人的範囲を超えた要因が、地域社会の幸福に与える影響を調査した。"}],"collocations":["extrapersonal relationships","extrapersonal awareness","extrapersonal experiences","extrapersonal consciousness","extrapersonal reality"],"synonyms":["transpersonal","impersonal","universal","objective","nonpersonal"],"antonyms":["personal","interpersonal","intrapersonal"]},{"part_of_speech":"adjective","definition":"(心理学)自己の境界を超えた認識や経験に関連する","english_definition":"(Psychology) Relating to awareness or experiences that extend beyond the boundaries of the self.","examples":[{"sentence":"Extrapersonal psychology explores the connection between individual consciousness and the larger universe.","translation":"自己超越心理学は、個人の意識とより大きな宇宙とのつながりを研究する。"},{"sentence":"Some spiritual practices aim to cultivate extrapersonal states of awareness.","translation":"いくつかの精神的な実践は、自己を超越した意識状態を養うことを目的としている。"},{"sentence":"The therapist helped the client explore their extrapersonal experiences in a safe and supportive environment.","translation":"セラピストは、クライアントが安全で支援的な環境で自己を超越した経験を探求するのを助けた。"}],"collocations":["extrapersonal psychology","extrapersonal awareness","extrapersonal experiences","extrapersonal states","extrapersonal dimensions"],"synonyms":["transpersonal","spiritual","mystical","cosmic"],"antonyms":["egoic","self-centered","individualistic"]}],"etymology":{"value":"Derived from the prefix 'extra-' (meaning 'beyond' or 'outside') and 'personal' (relating to a person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌekstrəˈpɜːrsənəl/","syllables":"ex-tra-per-son-al"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Extrapersonal' refers to something that exists or occurs beyond the realm of the individual or personal relationships. It often implies a connection to something larger, more universal, or spiritual. In psychology, it relates to experiences that transcend the ego or self-identity. The term is often used in philosophical, spiritual, and psychological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The extrapersonal relationship between the two friends was very strong.","correct":"✓ The interpersonal relationship between the two friends was very strong.","note":"'Extrapersonal' refers to something beyond personal relationships, whereas 'interpersonal' refers to relationships between people."},{"incorrect":"✗ He had an intrapersonal experience that connected him to the universe.","correct":"✓ He had an extrapersonal experience that connected him to the universe.","note":"'Intrapersonal' refers to something within oneself, while 'extrapersonal' refers to something beyond oneself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["transpersonal","impersonal","interpersonal","intrapersonal","personal","self","ego","consciousness","spirituality","mysticism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'extrapersonal' is a relatively uncommon term used to describe something that goes beyond the individual or personal sphere. It often refers to experiences, relationships, or concepts that transcend the self and connect to something larger, such as the universe or a collective consciousness. It is often used in philosophical, psychological, and spiritual contexts to describe phenomena that are not limited to individual experience. Understanding this word requires a good grasp of abstract concepts and the ability to differentiate it from related terms like 'interpersonal' (between people) and 'intrapersonal' (within oneself)."},"example_sentences":[{"sentence":"The philosopher explored the extrapersonal dimensions of reality.","translation":"その哲学者は、現実の個人的範囲を超えた次元を探求した。","type":"adjective","meaning_category":"Beyond personal"},{"sentence":"She sought to connect with extrapersonal sources of wisdom.","translation":"彼女は個人的な範囲を超えた知恵の源とつながろうとした。","type":"adjective","meaning_category":"Beyond personal"},{"sentence":"His art reflected his engagement with extrapersonal themes.","translation":"彼の芸術は、個人的なテーマを超えたものへの彼の関与を反映していた。","type":"adjective","meaning_category":"Beyond personal"}]}