{"word":"RNA-positive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"RNA陽性の、RNAが検出される","english_definition":"Indicates that a sample tests positive for the presence of RNA, typically of a specific virus or other pathogen.","examples":[{"sentence":"The patient tested RNA-positive for the virus.","translation":"その患者はウイルスのRNA検査で陽性だった。"},{"sentence":"An RNA-positive result indicates active infection.","translation":"RNA陽性の結果は活動的な感染を示唆する。"}],"collocations":["RNA-positive test","RNA-positive result","test RNA-positive","be RNA-positive"],"synonyms":["viral RNA detected","RNA detected"],"antonyms":["RNA-negative"],"related_terms":["PCR test","viral load","RT-PCR","nucleic acid","COVID-19","influenza"],"notes":"Often used in the context of viral infections, especially when referring to diagnostic testing. The presence of RNA indicates that the virus is actively replicating in the body."}],"etymology":{"value":"Combination of 'RNA' (ribonucleic acid) and 'positive' (indicating presence or detection).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌɑːrˌɛnˈeɪ ˈpɒzətɪv","syllables":"R-NA-pos-i-tive"},"usage_notes":{"explanation":"'RNA-positive' is a technical term used in medical and scientific contexts. It signifies that a test has confirmed the presence of RNA, usually from a specific virus or other pathogen, within a sample. This is a key indicator of active infection or the presence of the targeted genetic material.","priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency, primarily used in scientific and medical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'RNA-positive' is a specialized term primarily encountered in scientific or medical discussions. It means that a test has detected the presence of RNA (ribonucleic acid), often from a virus or other pathogen, in a sample. This usually indicates an active infection or the presence of the genetic material being tested for. It's not a term used in everyday conversation."},"example_sentences":[{"sentence":"The water sample was found to be RNA-positive for the presence of norovirus.","translation":"その水サンプルはノロウイルスのRNAが検出され、陽性であることが判明した。","type":"adjective","meaning_category":"RNAが検出される"},{"sentence":"Early detection through RNA-positive testing is crucial for controlling the spread of the disease.","translation":"RNA陽性検査による早期発見は、感染症の拡大を抑制するために非常に重要である。","type":"adjective","meaning_category":"RNA陽性の"}]}