{"word":"eirenicon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(神学)和解案、平和提案、融和策","english_definition":"A proposal or plan for promoting peace or reconciliation, especially between different religious denominations.","examples":[{"sentence":"The theologian published an eirenicon aimed at bridging the gap between Protestant and Catholic doctrines.","translation":"その神学者は、プロテスタントとカトリックの教義の間の溝を埋めることを目的とした和解案を発表した。"},{"sentence":"The conference explored various eirenicons for resolving the long-standing conflict.","translation":"会議では、長年の紛争を解決するための様々な融和策が検討された。"}],"collocations":["publish an eirenicon","explore eirenicons","present an eirenicon","religious eirenicon","theological eirenicon"],"synonyms":["peace proposal","reconciliation plan","mediation","compromise","olive branch"],"antonyms":["polemic","discord","conflict","contention"]}],"etymology":{"value":"Derived from Greek 'eirēnē' (peace) and '-ikon' (pertaining to).","priority":"★★★"},"pronunciation":{"ipa":"/aɪˈrɛnɪkɒn/","syllables":"I-ren-i-con"},"inflection":{"noun_plural":"eirenicons"},"usage_notes":{"explanation":"The term 'eirenicon' is primarily used in theological or religious contexts to refer to proposals or plans aimed at achieving peace and understanding between different religious groups or denominations. It often involves finding common ground or areas of compromise to overcome doctrinal differences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The eirenicon was a complete agreement between the two parties.","correct":"✓ The eirenicon was a proposal for agreement between the two parties.","note":"An eirenicon is a proposal or plan, not necessarily a complete agreement."},{"incorrect":"✗ The eirenicon caused more conflict than peace.","correct":"✓ The eirenicon failed to achieve its goal of peace.","note":"While an eirenicon aims for peace, it may not always succeed."}],"priority":"★★☆"},"related_words":{"derivatives":["eirenic (adjective: promoting peace or reconciliation)"],"related_terms":["ecumenism (the principle or aim of promoting unity among the world's Christian churches)","interfaith dialogue (dialogue between people of different religions)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eirenicon' is a specialized term primarily used in theological and academic contexts. It refers to a specific type of proposal or plan aimed at achieving peace or reconciliation, particularly between different religious groups. Understanding this term requires familiarity with theological discourse and the history of religious conflict and reconciliation efforts."},"example_sentences":[{"sentence":"The archbishop presented his eirenicon to the assembly of religious leaders.","translation":"大司教は宗教指導者たちの集会で彼の和解案を発表した。","type":"noun","meaning_category":"和解案"},{"sentence":"The eirenicon sought to find common ground on issues of doctrine and practice.","translation":"その融和策は、教義と実践の問題に関する共通の基盤を見つけることを目指した。","type":"noun","meaning_category":"融和策"},{"sentence":"Despite initial optimism, the eirenicon ultimately failed to bridge the divide between the two faiths.","translation":"当初の楽観的な見方にもかかわらず、その和解案は最終的に二つの信仰の間の隔たりを埋めることができなかった。","type":"noun","meaning_category":"和解案"}]}