{"word":"non-using","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not currently being used; abstaining from use.","english_definition":"Not currently employing or utilizing something; refraining from using something.","examples":[{"sentence":"The non-using equipment was stored in the warehouse.","translation":"未使用の機器は倉庫に保管されていました。"},{"sentence":"She is a non-using member of the gym, as she hasn't visited in months.","translation":"彼女は数ヶ月間ジムに行っていないので、非アクティブ会員です。"},{"sentence":"The company implemented a policy to encourage employees to be non-using of single-use plastics.","translation":"会社は、従業員に使い捨てプラスチックの使用を控えるように促すポリシーを実施しました。"}],"collocations":["non-using member","non-using equipment","non-using status","non-using policy"],"synonyms":["unused","idle","inactive","abstaining","refraining"],"antonyms":["using","active","employed","utilized"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the present participle 'using'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˈjuːzɪŋ/","syllables":"non-u-sing"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"'Non-using' is typically used to describe a state of not currently using something, often with the implication of a deliberate choice or policy. It can also describe equipment or resources that are available but not presently in service. The term is not as common as 'unused' or 'inactive,' but it provides a specific nuance of abstention or non-utilization.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The non using of the computer is a waste.","correct":"The non-use of the computer is a waste.","note":"It's better to use the noun form 'non-use' in this context."},{"incorrect":"She is non using drugs.","correct":"She is not using drugs.","note":"In this context, it's more common to simply say 'not using'."}],"priority":"Low"},"related_words":{"derivatives":["non-use (noun)","use (verb)","using (adjective)"],"related_concepts":["abstinence","conservation","idleness","preservation"],"priority":"Low"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"'Non-using' is a relatively uncommon adjective that describes something or someone that is not currently using something. It's formed by adding the prefix 'non-' to 'using.' It suggests a deliberate choice or a temporary state of not being in use. Because it is less common, it's important to ensure clarity when using it, and consider whether a more common alternative like 'unused' or 'inactive' would be more appropriate."},"example_sentences":[{"sentence":"The hospital had a number of non-using ventilators in storage.","translation":"その病院には、保管されている未使用の人工呼吸器が多数ありました。","type":"adjective","meaning_category":"Not currently being used"},{"sentence":"The program aims to support individuals in becoming non-using of addictive substances.","translation":"そのプログラムは、中毒性物質の使用をやめる個人を支援することを目的としています。","type":"adjective","meaning_category":"Abstaining from use"}]}