{"word":"cosmopolitan-focused","meanings":[{"part_of_speech":"adjective","definition":"国際色豊かな、または国際的な視点や興味に焦点を当てた","english_definition":"Focused on or characterized by a broad range of international influences, perspectives, or interests.","examples":[{"sentence":"The magazine has a cosmopolitan-focused approach to travel and culture.","translation":"その雑誌は、旅行と文化に対して国際色豊かな視点に焦点を当てたアプローチをとっています。"},{"sentence":"The city's cosmopolitan-focused policies attract diverse businesses and residents.","translation":"その都市の国際的な視点に焦点を当てた政策は、多様な企業や住民を引きつけています。"},{"sentence":"The university offers a cosmopolitan-focused curriculum designed to prepare students for global careers.","translation":"その大学は、学生をグローバルなキャリアに備えさせるために設計された、国際的な視点に焦点を当てたカリキュラムを提供しています。"}],"collocations":["cosmopolitan-focused magazine","cosmopolitan-focused policies","cosmopolitan-focused curriculum","cosmopolitan-focused approach","cosmopolitan-focused city"],"synonyms":["international","global","worldly","multicultural","diverse"],"antonyms":["parochial","provincial","insular","nationalistic"],"notes":"This adjective is often used to describe organizations, policies, or individuals that prioritize or emphasize international perspectives and diversity."}],"etymology":{"value":"Combines 'cosmopolitan' (from Greek 'kosmopolitēs' meaning 'citizen of the world') with 'focused' indicating a specific area of concentration.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkɒzməˈpɒlɪtən ˈfoʊkəst/","syllables":"cos-mo-pol-i-tan fo-cused"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Cosmopolitan-focused' is used to describe something that is specifically oriented towards or emphasizes a cosmopolitan perspective. This often implies an openness to diverse cultures, ideas, and influences from around the world. It suggests a deliberate effort to incorporate international elements into a particular area, such as education, business, or policy.","priority":"★★☆"},"related_words":{"derivatives":["cosmopolitan (adjective, noun)","focus (verb, noun)"],"related_terms":["global-minded","internationalist","multiculturalist"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cosmopolitan-focused' is a relatively complex term used to describe something that has a strong emphasis on international or global perspectives. It's often used in contexts related to culture, education, or policy where diversity and global awareness are valued. Understanding the meaning of 'cosmopolitan' is essential to grasping the full meaning of this term."},"example_sentences":[{"sentence":"The art gallery features a cosmopolitan-focused collection of works from around the globe.","translation":"その美術館は、世界中の作品を集めた国際的な視点に焦点を当てたコレクションを展示しています。","type":"general"},{"sentence":"The company's cosmopolitan-focused marketing strategy targets a global audience.","translation":"その会社の国際的な視点に焦点を当てたマーケティング戦略は、グローバルな視聴者をターゲットにしています。","type":"business"},{"sentence":"The school's cosmopolitan-focused exchange program allows students to study in various countries.","translation":"その学校の国際的な視点に焦点を当てた交換プログラムにより、学生はさまざまな国で学ぶことができます。","type":"education"}]}