{"word":"autoconduction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物理学)自己誘導","english_definition":"(Physics) Self-induction; the induction of a voltage in a circuit by a change in current in the same circuit.","examples":[{"sentence":"The autoconduction in the coil caused a significant voltage spike.","translation":"コイル内の自己誘導が著しい電圧スパイクを引き起こした。"}],"collocations":["high autoconduction","strong autoconduction","low autoconduction","measure autoconduction","calculate autoconduction"],"synonyms":["self-induction"],"antonyms":[]}],"etymology":{"value":"The word \"autoconduction\" is formed from the prefix \"auto-\" (meaning self) and the noun \"conduction\" (meaning the process of transmitting something, especially electricity or heat, through a medium).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊkənˈdʌkʃən/","syllables":"au-to-con-duc-tion"},"inflection":{"noun_plural":"autoconductions"},"usage_notes":{"explanation":"\"Autoconduction\" is a technical term primarily used in physics and electrical engineering. It refers to the phenomenon of self-induction, where a changing current in a coil induces a voltage in the same coil. This concept is fundamental to understanding the behavior of inductors and transformers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The autoconduction was very quietly.","correct":"✓ The autoconduction was very high.","note":"Autoconduction is a noun, so it's modified by adjectives (e.g., high, low, strong) rather than adverbs."}],"priority":"★★☆"},"related_words":{"derivatives":["autoconductivity"],"related_terms":["inductance","self-inductance","electromagnetic induction","Faraday's law","inductor","coil"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"autoconduction\" is a specialized term used in the field of physics, specifically electromagnetism. It refers to the phenomenon of self-induction, where a changing current in a circuit induces a voltage within the same circuit. Understanding this term requires a solid foundation in physics principles, particularly those related to electromagnetic induction and circuit theory. It is not commonly used in everyday language but is essential for those studying or working in these technical fields."},"example_sentences":[{"sentence":"The experiment demonstrated the principles of **autoconduction** in a simple circuit.","translation":"その実験は、単純な回路における自己誘導の原理を実証した。","type":"noun","meaning_category":"自己誘導"},{"sentence":"The high **autoconduction** of the coil resulted in a significant energy storage.","translation":"コイルの高い自己誘導により、かなりのエネルギーが蓄積された。","type":"noun","meaning_category":"自己誘導"}]}