{"word":"graticule","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地図・望遠鏡などの)格子目盛り、座標線","english_definition":"a network of lines representing meridians and parallels, on which a map or plan can be represented; a scale or grid used as a measuring device in an optical instrument such as a telescope or microscope.","examples":[{"sentence":"The graticule on the map helped me find the exact location.","translation":"地図上の格子目盛りのおかげで、正確な場所を見つけることができました。"},{"sentence":"The astronomer used the graticule in the telescope to measure the position of the stars.","translation":"天文学者は望遠鏡の格子目盛りを使って、星の位置を測定しました。"},{"sentence":"The microscope has a graticule to help measure the size of cells.","translation":"その顕微鏡には、細胞のサイズを測定するのに役立つ格子目盛りがあります。"}],"collocations":["map graticule","telescope graticule","microscope graticule","engraved graticule","etched graticule"],"synonyms":["grid","reticle","scale","network","coordinate system"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'graticule', which comes from the Latin word 'craticula', meaning 'small gridiron'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrætɪkjuːl/","syllables":"gra-tic-ule"},"inflection":{"noun_plural":"graticules"},"usage_notes":{"explanation":"A 'graticule' specifically refers to the network of lines representing meridians and parallels on a map, globe, or chart, or the grid/scale used for measurement in optical instruments. It is a technical term, not commonly used in everyday conversation. It is important to distinguish it from a general 'grid' which can refer to any network of lines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a grid to find the location on the map.","correct":"✓ I used a graticule to find the location on the map.","note":"While 'grid' is generally understood, 'graticule' is more specific when referring to the network of lines representing meridians and parallels on a map."}],"priority":"★☆☆"},"related_words":{"derivatives":["graticular (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'graticule' is a specialized term primarily used in the fields of cartography (mapmaking), astronomy, and microscopy. It refers to the network of lines on a map representing latitude and longitude, or the grid used for measurement in optical instruments. Due to its technical nature, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The map's **graticule** allowed for precise location identification.","translation":"その地図の格子目盛りのおかげで、正確な位置を特定できました。","type":"noun","meaning_category":"格子目盛り (地図)"},{"sentence":"The technician adjusted the **graticule** on the microscope for accurate measurements.","translation":"技術者は正確な測定のために、顕微鏡の格子目盛りを調整しました。","type":"noun","meaning_category":"格子目盛り (顕微鏡)"}]}