{"word":"antimonous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"アンチモンを含む、またはアンチモンに由来する","english_definition":"Containing antimony, especially in the lower of its two valence states; derived from or pertaining to antimony.","examples":[{"sentence":"Antimonous compounds are used in flame retardants.","translation":"アンチモン化合物は難燃剤に使用されます。"},{"sentence":"The antimonous oxide is a white powder.","translation":"亜酸化アンチモンは白い粉末です。"}],"collocations":["antimonous chloride","antimonous oxide"],"synonyms":["antimonial"],"antonyms":[]}],"etymology":{"value":"From antimony + -ous. The suffix -ous indicates the lower oxidation state of the element.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈtɪməˌnəs/","syllables":"an-ti-mo-nous"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms, though they are not commonly used: more antimonous, most antimonous."},"usage_notes":{"explanation":"'Antimonous' specifically refers to compounds where antimony is in a lower oxidation state, typically +3. This is in contrast to 'antimonic', which refers to compounds where antimony is in the higher oxidation state, +5.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antimonic compound is used as a substitute for antimonous.","correct":"✓ The antimonous compound is used as a substitute for antimonic.","note":"Make sure to use the correct term based on the oxidation state of antimony. Antimonous refers to the +3 state, while antimonic refers to the +5 state."}],"priority":"★★☆"},"related_words":{"derivatives":["antimony","antimonic"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'antimonous' is a technical term used in chemistry to describe compounds containing antimony in its lower oxidation state. It is not a common word and is primarily used in scientific or technical contexts. Understanding the difference between 'antimonous' and 'antimonic' requires knowledge of chemical nomenclature and oxidation states."},"example_sentences":[{"sentence":"The antimonous sulfide was heated in a vacuum.","translation":"硫化亜アンチモンは真空中で加熱された。","type":"adjective","meaning_category":"chemistry"},{"sentence":"The researcher studied the properties of antimonous compounds.","translation":"研究者はアンチモン化合物の特性を研究した。","type":"adjective","meaning_category":"chemistry"}]}