{"word":"pokingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"突くように、つつくように、からかうように","english_definition":"In a manner that involves poking or prodding; in a teasing or playfully annoying way.","examples":[{"sentence":"He smiled pokingly as he nudged his friend.","translation":"彼は友達を軽く突っつきながら、からかうように微笑んだ。"},{"sentence":"She asked the question pokingly, knowing it would irritate him.","translation":"彼女は彼をイライラさせると分かっていて、からかうようにその質問をした。"},{"sentence":"The child prodded the sleeping dog pokingly with a stick.","translation":"子供は棒で眠っている犬をつつくように突いた。"}],"collocations":["smile pokingly","ask pokingly","prod pokingly","nudge pokingly"],"synonyms":["teasingly","playfully","annoyingly","prodly","jabbing"],"antonyms":["seriously","respectfully","gently","carefully"]}],"etymology":{"value":"Derived from the adjective 'poking' (tending to poke or prod) with the addition of the adverbial suffix '-ly'. The root verb 'poke' comes from Middle Dutch 'poken' meaning 'to thrust, stab'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpoʊkɪŋli/","syllables":"po-king-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Pokingly' describes an action done in a manner that involves poking, either literally with a physical object or figuratively through teasing or annoying behavior. It often implies a lighthearted or mischievous intent. The word is relatively uncommon in formal writing, but can be used effectively to add nuance to descriptions of actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She looked pokingly at the painting.","correct":"✓ She peered intently at the painting.","note":"'Pokingly' describes an action involving poking or teasing, not simply looking. 'Intently' would be more appropriate to describe focused observation."},{"incorrect":"✗ The cat jumped pokingly on the table.","correct":"✓ The cat jumped playfully on the table.","note":"'Pokingly' implies a poking or prodding action, which doesn't fit the action of jumping. 'Playfully' better describes the cat's behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["poke (verb, noun)","poking (adjective)","poker (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pokingly' is a relatively uncommon adverb that describes an action done in a way that involves poking or prodding, often with a teasing or mischievous intent. It is more likely to be found in descriptive writing where the author wants to convey a specific manner of action that goes beyond simple poking. Because of its relative rarity, it is more suitable for advanced learners of English who wish to expand their vocabulary and understanding of nuanced adverbs."},"example_sentences":[{"sentence":"He stirred the soup pokingly with his spoon, clearly not wanting to eat it.","translation":"彼はスプーンでスープをつつくように混ぜ、明らかに食べたくないようだった。","type":"adverb","meaning_category":"poking/prodding"},{"sentence":"She questioned him pokingly about his date, enjoying his discomfort.","translation":"彼女は彼のデートについてからかうように質問し、彼の居心地の悪さを楽しんでいた。","type":"adverb","meaning_category":"teasingly"},{"sentence":"The curious child touched the strange object pokingly, unsure of what it was.","translation":"好奇心旺盛な子供は、それが何であるか分からず、その奇妙な物体をつつくように触った。","type":"adverb","meaning_category":"poking/prodding"}]}