{"word":"disjunctively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"分離的に、区別して、選択的に","english_definition":"in a disjunctive manner; separately; distinctly; alternatively.","examples":[{"sentence":"The elements were treated disjunctively in the analysis.","translation":"その要素は分析において分離的に扱われた。"},{"sentence":"The options were presented disjunctively, allowing for individual choice.","translation":"選択肢は区別して提示され、個々の選択を可能にした。"},{"sentence":"We must consider each possibility disjunctively before making a decision.","translation":"決定を下す前に、各可能性を分離的に検討しなければならない。"}],"collocations":["treat disjunctively","present disjunctively","consider disjunctively"],"synonyms":["separately","distinctly","alternatively","severally","independently"],"antonyms":["conjunctively","jointly","collectively","together"]}],"etymology":{"value":"From 'disjunctive' + '-ly'. 'Disjunctive' originates from Latin 'disjunctus', the past participle of 'disjungere' (to disjoin).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈdʒʌŋktɪvli/","syllables":"dis-junc-tive-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Disjunctively' describes actions or processes that involve separation, distinction, or alternatives. It is often used in formal or technical contexts, such as logic, mathematics, or linguistics, to indicate that items are being considered or treated as distinct entities rather than as a unified whole. The term emphasizes the act of separating or distinguishing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The team worked disjunctively, leading to a lack of coordination.","correct":"The team worked separately, leading to a lack of coordination.","note":"While 'disjunctively' could technically be used, 'separately' is more common and clearer in this context to describe a lack of teamwork."},{"incorrect":"The data was analyzed disjunctively, which made it hard to see the relationships.","correct":"The data was analyzed separately, which made it hard to see the relationships.","note":"Again, 'separately' is more common and easily understood in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["disjunctive (adjective)","disjunction (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disjunctively' is an advanced term used to describe something done in a way that separates or distinguishes elements. It's not commonly used in everyday conversation but might appear in academic or technical writing. It implies a deliberate act of treating things as distinct and unrelated. For example, if you analyze data 'disjunctively,' you're looking at each piece individually rather than as a connected set."},"example_sentences":[{"sentence":"The arguments were presented disjunctively, each standing on its own merit.","translation":"議論は分離的に提示され、それぞれが独自のメリットに基づいて成り立っていた。","type":"general","meaning_category":"separately"},{"sentence":"The problem can be solved disjunctively by addressing each component independently.","translation":"その問題は、各構成要素を個別に処理することで、分離的に解決できる。","type":"technical","meaning_category":"distinctly"},{"sentence":"The committee considered the proposals disjunctively before voting.","translation":"委員会は投票前に提案を分離的に検討した。","type":"formal","meaning_category":"alternatively"}]}