{"word":"sooterkin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語、まれ) 小さな子供、特に死産児または非常に小さく生まれた子供を指す言葉。また、オランダの女性がウサギのような動物を産んだという迷信的な話に登場する、そのような生き物を指すこともある。","english_definition":"(archaic, rare) A little child, especially a stillborn or very small one. Also, a supposed creature said to be born to Dutch women, resembling a rabbit.","examples":[{"sentence":"The old wives' tale spoke of Dutch women giving birth to sooterkins.","translation":"老婆の昔話では、オランダの女性がスーターキン（ウサギのような生き物）を産むと言われていた。"},{"sentence":"The sooterkin was so small, it barely resembled a human child.","translation":"そのスーターキンは非常に小さく、ほとんど人間の子供のようには見えなかった。"}],"collocations":["old wives' tale about sooterkins (スーターキンに関する老婆の昔話)"],"synonyms":["dwarf","homunculus","abortus"],"antonyms":[]}],"etymology":{"value":"おそらくオランダ語の 'zoteken' または 'soetekijn' から派生。'Zoet' は「甘い、かわいい」を意味し、'-kijn' は指小辞。つまり、文字通りには「小さくてかわいいもの」を意味する。18世紀に、オランダの女性がウサギのような生き物を産んだという噂が広まり、この言葉がそのような生き物を指すようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsuːtərkɪn/","syllables":"soo-ter-kin"},"inflection":{"noun_plural":"sooterkins"},"usage_notes":{"explanation":"「**sooterkin**」は非常に古風で珍しい単語であり、現代英語ではほとんど使用されません。主に歴史的な文脈や、17世紀から18世紀にかけてのオランダに関する奇妙な噂や迷信を議論する際に現れることがあります。この単語は、当時の人々の奇妙な信念や、科学的知識の欠如を反映しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She gave birth to a healthy sooterkin.","correct":"✓ She gave birth to a healthy baby.","note":"「sooterkin」は通常、死産児や非常に小さい子供を指すため、健康な子供を指すのには適していません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低い (Extremely low) - 現代英語ではほぼ使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**sooterkin**」は、現代英語ではほとんど使われない古風な単語です。この単語に出会う可能性が高いのは、17世紀から18世紀にかけての歴史的なテキストや、当時の奇妙な信念や迷信について議論する学術的な文脈です。この単語は、当時の科学的知識の欠如と、それによって生まれた奇妙な物語を反映しています。現代の会話や文章で使用することは適切ではありません。"},"example_sentences":[{"sentence":"The pamphlet described the alleged birth of a sooterkin in great detail.","translation":"そのパンフレットは、スーターキン（奇妙な生物）の出産とされる出来事を詳細に記述していた。","type":"noun","meaning_category":"奇妙な生物"},{"sentence":"In the 18th century, some believed that Dutch women were prone to giving birth to sooterkins.","translation":"18世紀には、オランダの女性はスーターキン（奇妙な生物）を産みやすいと信じられていた人もいた。","type":"noun","meaning_category":"奇妙な生物"}]}