{"word":"cervicohumeral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"頸椎と上腕骨に関する、頸椎上腕の","english_definition":"Relating to the cervical vertebrae and the humerus.","examples":[{"sentence":"The patient presented with cervicohumeral pain.","translation":"患者は頸椎上腕の痛みを訴えて来院した。"},{"sentence":"Cervicohumeral syndrome can be caused by poor posture.","translation":"頸椎上腕症候群は、姿勢の悪さによって引き起こされることがある。"}],"collocations":["cervicohumeral pain (頸椎上腕の痛み)","cervicohumeral syndrome (頸椎上腕症候群)"],"synonyms":["cervicobrachial"],"antonyms":[]}],"etymology":{"value":"Derived from 'cervico-' (relating to the neck or cervical vertebrae) + 'humeral' (relating to the humerus or upper arm bone).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrvɪkoʊˈhjuːmərəl/","syllables":"cer-vi-co-hu-mer-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than with comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"'Cervicohumeral' is a specialized term used in medicine and anatomy to describe structures, conditions, or regions involving both the cervical spine (neck) and the humerus (upper arm bone). It is often used in the context of pain or musculoskeletal disorders affecting these areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ cervico-humoral","correct":"✓ cervicohumeral","note":"The correct spelling is 'cervicohumeral,' not 'cervico-humoral.'"},{"incorrect":"✗ This muscle connects the cervicohumeral.","correct":"✓ This muscle connects the cervical spine and the humerus.","note":"'Cervicohumeral' is an adjective, not a noun. Therefore, it should be used to describe something, not as the subject or object of a sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["cervical (adjective: relating to the neck)","humerus (noun: upper arm bone)"],"related_terms":["cervicobrachial (adjective: relating to the neck and arm)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cervicohumeral' is a technical term used in medical and anatomical contexts. It combines 'cervico-' (referring to the cervical spine or neck) and 'humeral' (referring to the humerus or upper arm bone). Therefore, it describes something related to both the neck and the upper arm. Understanding this term requires familiarity with medical terminology. It is primarily used by healthcare professionals.","priority":"★★☆"},"example_sentences":[{"sentence":"The physical therapist assessed the patient's cervicohumeral range of motion.","translation":"理学療法士は、患者の頸椎上腕の可動域を評価した。","type":"adjective","meaning_category":"Anatomical"},{"sentence":"Cervicohumeral dysfunction can lead to referred pain in the shoulder.","translation":"頸椎上腕機能不全は、肩への関連痛を引き起こす可能性がある。","type":"adjective","meaning_category":"Medical Condition"}]}