{"word":"God-centeredness","priority":"low","meanings":[{"part_of_speech":"noun","definition":"神中心主義、神を中心とすること","english_definition":"The quality of having God as the central focus or priority in one's life, thoughts, and actions.","examples":[{"sentence":"Her life was marked by God-centeredness, evident in her daily prayers and acts of service.","translation":"彼女の人生は神中心主義によって特徴づけられ、日々の祈りと奉仕活動にそれが表れていた。"},{"sentence":"The pastor emphasized the importance of God-centeredness in all aspects of life.","translation":"牧師は、生活のあらゆる面において神中心主義が重要であることを強調した。"},{"sentence":"They strive for God-centeredness in their marriage, seeking to honor Him in their relationship.","translation":"彼らは結婚生活において神中心主義を目指し、二人の関係において神を敬うように努めている。"}],"collocations":["live a God-centered life","practice God-centeredness","promote God-centeredness","emphasize God-centeredness"],"synonyms":["theocentricity","faithfulness","devotion","piety","spirituality"],"antonyms":["self-centeredness","secularism","materialism","atheism"]}],"etymology":{"value":"Formed by combining 'God' + 'centered' + '-ness'. 'God' refers to the deity. 'Centered' means having something as the main focus. '-ness' is a suffix that turns an adjective into a noun, indicating a state or quality.","priority":"low"},"pronunciation":{"ipa":"/ˈɡɒdˌsentərdnəs/","syllables":"God-cen-terd-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'God-centeredness' is a concept primarily used in religious contexts, particularly within Christianity, but it can also be found in other theistic religions. It describes a way of living and thinking where God's will, glory, and presence are the primary considerations. It involves prioritizing spiritual values and seeking to align one's life with divine principles.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"Living with God-centeredness is easy.","correct":"Living with God-centeredness requires constant effort.","note":"While the goal is to make God the center of one's life, it's important to acknowledge that achieving true God-centeredness often involves ongoing dedication and effort, rather than being an easy or automatic state."}],"priority":"low"},"related_words":{"derivatives":["God-centered (adjective)"],"phrases":["Center one's life on God","Live for God's glory"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low Frequency - Primarily used in religious or theological discussions.","priority":"low"},"readability_explanation":{"level":"C1","text":"'God-centeredness' is a relatively abstract concept primarily used in religious or spiritual contexts. Understanding this term requires familiarity with theological concepts and the ability to grasp abstract ideas related to faith and devotion. The word itself is a combination of familiar elements, but the overall concept is more nuanced and less commonly encountered in everyday language."},"example_sentences":[{"sentence":"The retreat focused on cultivating God-centeredness through prayer and meditation.","translation":"そのリトリートは、祈りと瞑想を通して神中心主義を育むことに焦点を当てていた。","type":"general","meaning_category":"神を中心とすること"},{"sentence":"Her decisions reflected a deep commitment to God-centeredness.","translation":"彼女の決断は、神中心主義への深い献身を反映していた。","type":"general","meaning_category":"神を中心とすること"},{"sentence":"They teach their children the importance of God-centeredness from a young age.","translation":"彼らは幼い頃から子供たちに神中心主義の重要性を教えている。","type":"general","meaning_category":"神を中心とすること"}]}