{"word":"indylic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(有機化学) インデン環に類似した構造を持つさま","english_definition":"(organic chemistry) Relating to or having a structure similar to that of indene.","examples":[{"sentence":"The indylic compound exhibited unique spectral properties.","translation":"そのインデンのような化合物は、独特のスペクトル特性を示した。"}],"collocations":["indylic compound","indylic structure"],"synonyms":["indene-like","indenic"],"antonyms":[]}],"etymology":{"value":"Derived from 'indene' (a bicyclic aromatic hydrocarbon) with the suffix '-ylic' indicating a derivative or related structure.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdɪlɪk/","syllables":"in-dil-ic"},"inflection":{"adjective_forms":{"comparative":"more indylic","superlative":"most indylic"}},"usage_notes":{"explanation":"\"indylic\" is a specialized term used in organic chemistry to describe compounds or structures that are related to or resemble indene. It is primarily found in scientific literature and discussions related to chemical synthesis and analysis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The indylic reaction was fast.","correct":"✓ The reaction involving the indylic compound was fast.","note":"Ensure the term is used to describe the compound or structure, not the reaction itself."}],"priority":"★★☆"},"related_words":{"derivatives":["indene","indane"],"related_terms":["aromatic","hydrocarbon","bicyclic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Indylic\" is a technical term from organic chemistry. It describes something that has a structure similar to indene, which is a specific type of bicyclic aromatic hydrocarbon. This word is mainly used by chemists and in scientific papers. If you're not studying chemistry, you probably won't come across it very often."},"example_sentences":[{"sentence":"The researchers synthesized a novel indylic derivative for potential pharmaceutical applications.","translation":"研究者たちは、潜在的な医薬品用途のために、新しいインデン類似体を合成した。","type":"adjective","meaning_category":"organic chemistry"},{"sentence":"The UV spectrum confirmed the presence of an indylic moiety in the molecule.","translation":"UVスペクトルは、分子内にインデンのような部分が存在することを確認した。","type":"adjective","meaning_category":"organic chemistry"}]}