{"word":"Oophoromania","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A historical medical diagnosis referring to excessive sexual desire in women, believed to be caused by a disorder of the ovaries.","english_definition":"(historical) Excessive sexual desire in women, attributed to a supposed disease of the ovaries.","examples":[{"sentence":"In the 19th century, oophoromania was used to explain and sometimes 'treat' women who displayed what was considered to be inappropriate sexual behavior.","translation":"19世紀には、婦女性欲亢進症は、不適切とみなされた性的行動を示す女性を説明し、時には「治療」するために用いられた。"},{"sentence":"The concept of oophoromania reflects historical attitudes towards female sexuality and the medicalization of social norms.","translation":"婦女性欲亢進症の概念は、女性の性に対する歴史的な態度と、社会規範の医療化を反映している。"}],"collocations":["diagnosed with oophoromania","symptoms of oophoromania","treatment for oophoromania","historical view of oophoromania"],"synonyms":["nymphomania (though nymphomania is a broader term)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'oophoro-' meaning 'ovary' and '-mania' meaning 'madness' or 'obsession'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊˌɑːfərəˈmeɪniə/","syllables":"o-o-pho-ro-ma-ni-a"},"inflection":{"noun_plural":"oophoromanias"},"usage_notes":{"explanation":"'Oophoromania' is primarily of historical interest. It is no longer a valid medical diagnosis and is considered a reflection of outdated and often sexist views on female sexuality. The term is sometimes encountered in discussions of the history of medicine, gender studies, or the social construction of illness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was suffering from oophoromania and needed immediate surgery.","correct":"✓ The historical diagnosis of oophoromania was sometimes used to justify unnecessary surgeries on women.","note":"Oophoromania is not a current medical diagnosis, so saying someone 'suffers' from it is incorrect in a modern context. It is more accurate to discuss it as a historical concept."}],"priority":"★★☆"},"related_words":{"derivatives":["oophorectomy (surgical removal of an ovary or ovaries)","mania (mental illness marked by periods of great excitement or euphoria, delusions, and overactivity)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare, historical term)","frequency_google_ngram":"Very low frequency - primarily found in historical texts and discussions of medical history.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oophoromania' is a highly specialized and historical term. Understanding it requires knowledge of medical history, gender studies, and the social construction of illness. It is unlikely to be encountered outside of academic or historical contexts. The term reflects outdated and often sexist views on female sexuality and is no longer a valid medical diagnosis. Therefore, it should be approached with caution and awareness of its historical context."},"example_sentences":[{"sentence":"The diagnosis of oophoromania in the 19th century often led to drastic and unnecessary medical interventions.","translation":"19世紀における婦女性欲亢進症の診断は、しばしば過激で不必要な医療介入につながった。","type":"noun","meaning_category":"historical medical diagnosis"},{"sentence":"Historians of medicine examine the concept of oophoromania to understand past attitudes towards women's health and sexuality.","translation":"医学史家は、婦女性欲亢進症の概念を検証し、女性の健康と性に対する過去の態度を理解する。","type":"noun","meaning_category":"historical medical diagnosis"}]}