{"word":"plumbing-related","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"配管に関連する、水道工事に関連する","english_definition":"connected with or relating to plumbing.","examples":[{"sentence":"We need to hire a plumbing-related specialist to fix this leak.","translation":"この漏れを修理するには、配管関連の専門家を雇う必要があります。"},{"sentence":"This store sells plumbing-related supplies.","translation":"この店では、配管関連の用品を販売しています。"},{"sentence":"He has years of experience in plumbing-related work.","translation":"彼は配管関連の仕事で長年の経験があります。"}],"collocations":["plumbing-related issues (配管関連の問題)","plumbing-related supplies (配管関連の用品)","plumbing-related services (配管関連のサービス)","plumbing-related problems (配管関連のトラブル)","plumbing-related repairs (配管関連の修理)"],"synonyms":["pipefitting-related","sanitary-related"],"antonyms":[]}],"etymology":{"value":"The term 'plumbing-related' is a compound adjective formed by combining 'plumbing' (referring to the system of pipes, drains, and fixtures for water and waste in a building) with 'related' (meaning connected or associated).","priority":"★★☆"},"pronunciation":{"ipa":"ˈplʌmɪŋ rɪˌleɪtɪd","syllables":"plumb-ing-re-lat-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Plumbing-related' is used to describe anything that is associated with the installation, repair, or maintenance of plumbing systems. It is commonly used in commercial contexts to describe products, services, or professions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ plumbing related","correct":"✓ plumbing-related","note":"The hyphen is important when using it as a compound adjective before a noun. Without the hyphen, it might be interpreted as 'plumbing that is related to something else'."}],"priority":"★★☆"},"related_words":{"derivatives":["plumbing (noun)","plumber (noun)"],"phrasal_verbs":[],"related_terms":["pipe","faucet","drain","sewer","water heater","toilet","sink"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'plumbing-related' is a compound adjective used to describe things connected to plumbing. It is generally used in professional or technical contexts. Understanding the meaning of 'plumbing' itself is essential to understand this term. It's not a very common term in everyday conversation but is frequently used in the context of construction, home repair, and maintenance.","priority":"★★☆"},"example_sentences":[{"sentence":"The homeowner needed to address several plumbing-related problems before selling the house.","translation":"家を売る前に、住宅所有者はいくつかの配管関連の問題に対処する必要がありました。","type":"general","meaning_category":"general"},{"sentence":"Our company offers a wide range of plumbing-related services, including installation and repair.","translation":"当社は、設置や修理を含む幅広い配管関連サービスを提供しています。","type":"commercial","meaning_category":"commercial"},{"sentence":"He attended a vocational school to learn plumbing-related skills.","translation":"彼は配管関連のスキルを学ぶために職業訓練学校に通いました。","type":"educational","meaning_category":"educational"}]}