{"word":"Troas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トロアス：古代ギリシアの地域名。現在のトルコ北西部、ダーダネルス海峡の南に位置する。ホメロスの叙事詩『イリアス』の舞台となったトロイア（トロイ）の都市を含む地域。","english_definition":"Troas: An ancient region in northwestern Anatolia (modern-day Turkey), located south of the Dardanelles. It encompasses the area around the ancient city of Troy (Troia), the setting of Homer's Iliad.","examples":[{"sentence":"The archaeological site of Troy is located in the Troas region.","translation":"トロイアの遺跡はトロアス地方に位置している。"},{"sentence":"Paul the Apostle visited Troas during his missionary journeys.","translation":"使徒パウロは伝道旅行中にトロアスを訪れた。"}],"collocations":["Troas region (トロアス地方)","ancient Troas (古代トロアス)","visit Troas (トロアスを訪問する)"],"synonyms":["Troy","Ilium"],"antonyms":[]}],"etymology":{"value":"「Troas」という名前は、トロイア（Troy）の都市に由来する。トロイアは、この地域の主要な都市であり、その名前が地域全体を指すようになった。ギリシア語の「Τρωάς (Trōás)」から。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtroʊæs/","syllables":"Tro-as"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Troas**」は、歴史的な文脈でのみ使用される地名です。現代の地図では、この地域はトルコの一部として認識されます。聖書（新約聖書）にも登場し、使徒パウロが訪れた場所として知られています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to visit Troas next year, it's a city.","correct":"✓ I am going to visit the Troas region next year; it contains the site of the ancient city of Troy.","note":"Troasは都市ではなく地域名です。トロイアの遺跡がある地域を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["Trojan (トロイアの、トロイア人)"],"related_places":["Troy (トロイア)","Dardanelles (ダーダネルス海峡)","Anatolia (アナトリア)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (歴史的な文脈でのみ使用されるため)","frequency_google_ngram":"低頻度 (Low frequency) - 歴史、考古学、聖書研究などの特定の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Troas**」は古代の地名であり、現代の日常会話ではほとんど使用されません。主に歴史、考古学、または聖書研究の文脈で見られます。ホメロスの叙事詩『イリアス』の舞台であるトロイア（トロイ）の遺跡がある地域として知られています。また、新約聖書において、使徒パウロが訪れた場所としても言及されます。この単語を理解するには、古代史や聖書に関するある程度の知識が必要です。"},"example_sentences":[{"sentence":"The apostle Paul received a vision in Troas, prompting him to travel to Macedonia.","translation":"使徒パウロはトロアスで幻を見て、マケドニアへ向かうことになった。","type":"historical context","meaning_category":"地域名・歴史"},{"sentence":"Excavations in the Troas region have revealed significant information about the Bronze Age.","translation":"トロアス地方の発掘調査により、青銅器時代に関する重要な情報が明らかになった。","type":"archaeological context","meaning_category":"地域名・考古学"}]}