{"word":"illustration-poor","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Containing few or no illustrations.","english_definition":"Having a lack or scarcity of illustrations.","examples":[{"sentence":"The textbook was illustration-poor, making it difficult to understand the concepts.","translation":"その教科書はイラストが少なく、概念を理解するのが難しかった。"},{"sentence":"Compared to other books on the subject, this one is illustration-poor.","translation":"このテーマに関する他の本と比べると、この本はイラストが少ない。"}],"collocations":["illustration-poor textbook","illustration-poor article","illustration-poor presentation"],"synonyms":["under-illustrated","sparsely illustrated","lacking illustrations","unillustrated"],"antonyms":["well-illustrated","richly illustrated","abundantly illustrated"]}],"etymology":{"value":"Formed by combining \"illustration\" and \"poor,\" indicating a deficiency in illustrations.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɪləˈstreɪʃən pʊər/","syllables":"il-lus-tra-tion poor"},"inflection":{"notes":"Adjective, no standard inflection."},"usage_notes":{"explanation":"The term \"illustration-poor\" is used to describe content, typically books or articles, that lacks a sufficient number of illustrations to effectively support or enhance the text. It implies that the absence of illustrations detracts from the overall quality or usability of the material.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The illustration-poor book was very expensive.","correct":"The poorly illustrated book was very expensive.","note":"While \"illustration-poor\" is a valid term, \"poorly illustrated\" is more commonly used."}],"priority":"N/A"},"related_words":{"derivatives":["illustration","poor"],"related_terms":["well-illustrated","illustration-rich","poorly illustrated"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"illustration-poor\" is a relatively uncommon adjective used to describe written material that lacks sufficient illustrations. It is generally understood in contexts where the presence of illustrations is expected or beneficial for comprehension. The word is straightforward in its meaning, combining the concept of \"illustration\" with \"poor\" to indicate a deficiency."},"example_sentences":[{"sentence":"The report was criticized for being illustration-poor, making it difficult for readers to grasp the key findings.","translation":"その報告書はイラストが少ないと批判され、読者が重要な発見を把握するのが難しくなった。","type":"adjective","meaning_category":"lacking illustrations"},{"sentence":"The website was illustration-poor, relying heavily on text and lacking visual appeal.","translation":"そのウェブサイトはイラストが少なく、テキストに大きく依存し、視覚的な魅力に欠けていた。","type":"adjective","meaning_category":"lacking illustrations"}]}