{"word":"spider-crab","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クモガニ","english_definition":"A crab of the family Majidae, characterized by their long legs and small, rounded bodies.","examples":[{"sentence":"The spider-crab scuttled along the seabed.","translation":"クモガニが海底をちょこちょこと歩いた。"},{"sentence":"Spider-crabs are known for their slow movements.","translation":"クモガニは動きが遅いことで知られている。"}],"collocations":["Japanese spider-crab (タカアシガニ)","spider-crab migration (クモガニの移動)"],"synonyms":["majid crab"],"antonyms":[]},{"part_of_speech":"noun","definition":"(特に)タカアシガニ (Japanese spider crab)","english_definition":"Specifically, Macrocheira kaempferi, a very large species of spider crab found in the waters around Japan.","examples":[{"sentence":"The Japanese spider-crab is the largest arthropod in the world.","translation":"タカアシガニは世界最大の節足動物である。"},{"sentence":"The legs of a Japanese spider-crab can span up to 4 meters.","translation":"タカアシガニの脚は最大4メートルまで広がる。"}],"collocations":["giant spider-crab","deep-sea spider-crab"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Spider' refers to the crab's long, spindly legs, reminiscent of a spider. 'Crab' indicates its classification as a crustacean within the crab infraorder.","priority":"★★★"},"pronunciation":{"ipa":"/ˈspaɪdərˌkræb/","syllables":"spi-der-crab"},"inflection":{"noun_plural":"spider-crabs"},"usage_notes":{"explanation":"'Spider-crab' generally refers to any crab within the family Majidae, characterized by their long legs and relatively small bodies. However, it can also specifically refer to the Japanese spider crab (Macrocheira kaempferi), which is the largest living arthropod. When used in a general sense, it describes a group of crabs with spider-like features. When referring to the Japanese spider crab, it denotes a specific species known for its immense size.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a spider crab with eight legs. All crabs have ten legs.","correct":"✓ I saw a spider crab with ten legs.","note":"All crabs, including spider crabs, have ten legs (five pairs)."},{"incorrect":"✗ Spider crab is an insect.","correct":"✓ Spider crab is a crustacean.","note":"Spider crabs are crustaceans, not insects."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Macrocheira kaempferi (Japanese spider crab)","Maja squinado (European spider crab)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'spider-crab' refers to a group of crabs known for their long, spindly legs, resembling those of a spider. While the term can apply to various species within the Majidae family, it often specifically denotes the Japanese spider crab (Macrocheira kaempferi), which is famous for being the largest arthropod in the world. Understanding the context is important to determine whether the term is used generally or to refer to this particular species.","priority":"★★★"},"example_sentences":[{"sentence":"The aquarium featured a large display of spider-crabs from around the world.","translation":"水族館では、世界中のクモガニが大規模に展示されていた。","type":"general"},{"sentence":"The Japanese spider-crab is a popular dish in some parts of Japan.","translation":"タカアシガニは日本の一部地域で人気の料理である。","type":"specific"},{"sentence":"Divers observed a group of spider-crabs migrating along the ocean floor.","translation":"ダイバーたちは、海底を移動するクモガニの群れを観察した。","type":"general"},{"sentence":"The shell of the spider-crab was covered in algae and small marine organisms.","translation":"クモガニの甲羅は藻類や小さな海洋生物で覆われていた。","type":"general"}]}