{"word":"sun-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"耐光性の、耐候性の、日焼け止めの","english_definition":"able to resist damage or fading from exposure to sunlight.","examples":[{"sentence":"This fabric is sun-resistant and won't fade easily.","translation":"この生地は耐光性があり、色褪せしにくいです。"},{"sentence":"We need to choose sun-resistant paint for the exterior of the house.","translation":"家の外装には耐候性の塗料を選ぶ必要があります。"},{"sentence":"She applied a sun-resistant cream to protect her skin.","translation":"彼女は肌を保護するために日焼け止めクリームを塗った。"}],"collocations":["sun-resistant fabric (耐光性生地)","sun-resistant paint (耐候性塗料)","sun-resistant material (耐光性素材)","sun-resistant coating (耐光性コーティング)","sun-resistant sunscreen (耐光性日焼け止め)"],"synonyms":["UV-resistant","lightfast","fade-resistant","weather-resistant"],"antonyms":["sun-sensitive","non-resistant"]},{"part_of_speech":"adjective","definition":"(特に肌が)日焼けしにくい、太陽に強い","english_definition":"(especially of skin) not easily sunburned.","examples":[{"sentence":"People with darker skin are often more sun-resistant.","translation":"肌の色が濃い人は、日焼けしにくいことが多いです。"},{"sentence":"She's quite sun-resistant and rarely gets sunburned.","translation":"彼女はかなり太陽に強く、めったに日焼けしません。"}],"collocations":["sun-resistant skin (日焼けしにくい肌)"],"synonyms":["tan-prone","less likely to burn"],"antonyms":["sun-sensitive","easily sunburned"]}],"etymology":{"value":"Compound word formed by combining \"sun\" and \"resistant\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsʌn rɪˈzɪstənt/","syllables":"sun-re-sist-ant"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"\"Sun-resistant\" is primarily used to describe materials or products that can withstand prolonged exposure to sunlight without significant damage, fading, or degradation. It can also describe a person's skin that is less prone to sunburn. The term is often used in marketing and product descriptions to highlight the durability and protective qualities of an item.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This sunscreen is very sun resistant.","correct":"✓ This sunscreen is sun-resistant.","note":"The term \"sun-resistant\" is already an adjective indicating resistance to the sun. Adding \"very\" doesn't change the meaning significantly and can sound redundant. It's better to say \"This sunscreen is highly effective\" or \"This sunscreen provides excellent sun protection\"."}],"priority":"☆☆☆"},"related_words":{"derivatives":["sun resistance (耐光性、耐候性)"],"phrasal_verbs":[],"related_terms":["sunscreen","sunblock","UV protection","SPF (Sun Protection Factor)","weatherproof","waterproof"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term \"sun-resistant\" is a compound adjective that describes something that can withstand the effects of sunlight. It's commonly used in the context of materials, fabrics, paints, and sunscreens to indicate their ability to resist fading, damage, or degradation from sun exposure. It can also refer to skin that is less prone to sunburn. Understanding the term requires knowledge of both \"sun\" and \"resistant\" and how they combine to form a specific meaning. It is not a very common word, but it is easily understood in context."},"example_sentences":[{"sentence":"The new patio furniture is made from a sun-resistant material to prevent fading.","translation":"新しいパティオの家具は、色褪せを防ぐために耐光性のある素材で作られています。","type":"adjective","meaning_category":"耐光性"},{"sentence":"She chose a sun-resistant umbrella to protect herself from the harsh sunlight.","translation":"彼女は強い日差しから身を守るために、耐光性のある傘を選びました。","type":"adjective","meaning_category":"耐光性"},{"sentence":"The company claims their new paint is sun-resistant and will last for years without fading.","translation":"その会社は、新しい塗料は耐光性があり、色褪せることなく何年も長持ちすると主張しています。","type":"adjective","meaning_category":"耐光性"}]}