{"word":"epigraphist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"金石学者、碑文研究者","english_definition":"A person who studies epigraphs, i.e. inscriptions on stone or other durable materials.","examples":[{"sentence":"The epigraphist carefully analyzed the ancient inscription.","translation":"金石学者は古代の碑文を注意深く分析した。"},{"sentence":"Epigraphists play a crucial role in deciphering historical records.","translation":"金石学者は歴史的記録の解読において重要な役割を果たす。"}],"collocations":["leading epigraphist","renowned epigraphist","study of epigraphy"],"synonyms":["inscription specialist","paleographer","archaeologist"],"antonyms":[]}],"etymology":{"value":"The word \"epigraphist\" is derived from \"epigraphy,\" which comes from the Greek words \"epi\" (ἐπί) meaning \"on\" or \"upon,\" and \"graphe\" (γραφή) meaning \"writing.\" Thus, epigraphy is literally the study of writings on something.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈpɪɡrəfɪst/","syllables":"e-pig-ra-phist"},"inflection":{"noun_plural":"epigraphists"},"usage_notes":{"explanation":"An \"epigraphist\" is a specialist who studies inscriptions, which are writings engraved or inscribed on stone, metal, pottery, or other durable materials. Epigraphists analyze these inscriptions to understand their historical context, language, and meaning. Their work is essential for reconstructing ancient history, understanding past cultures, and verifying historical documents.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The epigraphist studied the manuscript.","correct":"✓ The epigraphist studied the inscription.","note":"Epigraphists study inscriptions, not manuscripts. Manuscripts are studied by paleographers or historians."},{"incorrect":"✗ He is an epigraphy.","correct":"✓ He is an epigraphist.","note":"\"Epigraphy\" is the study itself, while \"epigraphist\" is the person who studies it."}],"priority":"★★☆"},"related_words":{"derivatives":["epigraphy (金石学、碑文研究)","epigraphic (金石学の、碑文の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"epigraphist\" refers to a specialist who studies inscriptions, which are writings on durable materials like stone or metal. This word is not commonly used in everyday conversation but is relevant in academic or historical contexts. Understanding the role of an epigraphist is important for those interested in archaeology, history, and ancient languages."},"example_sentences":[{"sentence":"The **epigraphist** deciphered the hieroglyphs on the ancient Egyptian tomb.","translation":"その金石学者は古代エジプトの墓の象形文字を解読した。","type":"general","meaning_category":"金石学者"},{"sentence":"As a leading **epigraphist**, she has published numerous articles on Roman inscriptions.","translation":"一流の金石学者として、彼女はローマの碑文に関する多くの論文を発表している。","type":"general","meaning_category":"金石学者"}]}