{"word":"Kiwanian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キワニス会員","english_definition":"A member of Kiwanis International.","examples":[{"sentence":"He is a dedicated Kiwanian, volunteering every week.","translation":"彼は熱心なキワニス会員で、毎週ボランティア活動をしています。"},{"sentence":"The Kiwanians organized a fundraising event for the local children's hospital.","translation":"キワニス会員たちは地元の子供病院のために資金調達イベントを企画しました。"}],"collocations":["active Kiwanian","dedicated Kiwanian","local Kiwanian club"],"synonyms":["Kiwanis member"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the service club, Kiwanis International, plus the suffix '-ian' indicating membership or association. The name 'Kiwanis' itself is said to be derived from a Native American language, meaning 'we trade' or 'we have a good time'.","priority":"★★☆"},"pronunciation":{"ipa":"/kɪˈwɑːniən/","syllables":"Ki-wa-ni-an"},"inflection":{"noun_plural":"Kiwanians"},"usage_notes":{"explanation":"'Kiwanian' specifically refers to a member of the Kiwanis International service organization. It is not a general term and should only be used in the context of this organization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Kiwanis.","correct":"✓ He is a Kiwanian.","note":"'Kiwanis' is the name of the organization; 'Kiwanian' is the term for a member."}],"priority":"★★☆"},"related_words":{"derivatives":["Kiwanis (noun: the organization itself)","Kiwanis International (noun: the full name of the organization)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not in CEFR vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kiwanian' is a specialized term referring to a member of the Kiwanis International service organization. It's not commonly used outside of contexts directly related to Kiwanis. Understanding requires familiarity with the organization itself."},"example_sentences":[{"sentence":"As a long-time Kiwanian, she has contributed significantly to community projects.","translation":"長年のキワニス会員として、彼女は地域プロジェクトに大きく貢献してきました。","type":"noun","meaning_category":"キワニス会員"},{"sentence":"The Kiwanians volunteer their time to support youth programs.","translation":"キワニス会員たちは、若者向けプログラムを支援するために時間を割いてボランティア活動をしています。","type":"noun","meaning_category":"キワニス会員"}]}