{"word":"clusteringly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"クラスタリングするように、群がるように、集団的に","english_definition":"In a manner that forms clusters or groups.","examples":[{"sentence":"The data points are clusteringly distributed around the central values.","translation":"データ点は中心値の周りにクラスタリングするように分布している。"},{"sentence":"The children gathered clusteringly around the storyteller.","translation":"子供たちは物語の語り手の周りに群がるように集まった。"}],"collocations":["distributed clusteringly","gathered clusteringly"],"synonyms":["collectively","groupedly","aggregatedly"],"antonyms":["separately","individually","dispersedly"]}],"etymology":{"value":"Formed from 'clustering' (present participle of 'cluster') + '-ly'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈklʌstərɪŋli/","syllables":"clus-ter-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Clusteringly' is an adverb that describes an action or state of being where things are grouped together in clusters. It is often used in scientific or technical contexts, such as data analysis or biology, but can also be used more generally to describe people or objects gathering in groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stars were clusteringly in the sky.","correct":"✓ The stars were clustered in the sky.","note":"'Clusteringly' is an adverb, so it modifies a verb or adjective. 'Clustered' is an adjective that describes the state of the stars."}],"priority":"★☆☆"},"related_words":{"derivatives":["cluster (noun, verb)","clustering (noun, adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Clusteringly' is an adverb that is not commonly used in everyday language. It is typically used in more formal or technical contexts to describe something that is happening in a clustered or grouped manner. Because of its limited use, it is considered a higher-level vocabulary word."},"example_sentences":[{"sentence":"The galaxies are clusteringly arranged in the observable universe.","translation":"銀河は観測可能な宇宙の中でクラスタリングするように配置されている。","type":"adverb","meaning_category":"クラスタリングするように"},{"sentence":"The students worked clusteringly on the group project.","translation":"学生たちはグループプロジェクトに集団的に取り組んだ。","type":"adverb","meaning_category":"集団的に"}]}