{"word":"cacotrophy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"栄養不良、栄養失調","english_definition":"A state of malnutrition or defective nutrition.","examples":[{"sentence":"The child suffered from cacotrophy due to the lack of essential nutrients.","translation":"その子供は必須栄養素の欠乏により栄養失調に苦しんだ。"}],"collocations":["severe cacotrophy","childhood cacotrophy"],"synonyms":["malnutrition","undernourishment","inanition"],"antonyms":["eutrophy","good nutrition"]}],"etymology":{"value":"From Greek 'kakos' (bad) + 'trophe' (nourishment).","priority":"★★★"},"pronunciation":{"ipa":"/kəˈkɒtrəfi/","syllables":"ca-cot-ro-phy"},"inflection":{"noun_plural":"cacotrophies"},"usage_notes":{"explanation":"'Cacotrophy' is a relatively rare and technical term primarily used in medical or scientific contexts to describe a state of poor nutrition. It is often used synonymously with 'malnutrition' but may emphasize the defective or inadequate nature of the nourishment received.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed signs of cacotrophy due to overwatering.","correct":"✓ The plant showed signs of nutrient deficiency due to overwatering.","note":"'Cacotrophy' specifically refers to poor nutrition, not conditions caused by excess. Nutrient deficiency is more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["cacotrophic (adjective)"],"phrasal_verbs":[],"related_terms":["atrophy","dystrophy","malnutrition"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cacotrophy' is a highly specialized term rarely encountered outside of medical or nutritional science contexts. Understanding requires a strong grasp of scientific vocabulary and concepts related to nutrition and metabolism. It is not suitable for general English learners."},"example_sentences":[{"sentence":"The study investigated the prevalence of cacotrophy in developing countries.","translation":"その研究は発展途上国における栄養失調の有病率を調査した。","type":"noun","meaning_category":"栄養不良"},{"sentence":"Early intervention is crucial to prevent the long-term effects of cacotrophy.","translation":"早期介入は栄養失調の長期的な影響を防ぐために重要である。","type":"noun","meaning_category":"栄養失調"}]}