{"word":"immunochemistry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"免疫化学","english_definition":"The branch of chemistry concerned with the study of the chemical and physicochemical aspects of the immune system and immunological reactions.","examples":[{"sentence":"Immunochemistry plays a vital role in the development of diagnostic tools.","translation":"免疫化学は診断ツールの開発において重要な役割を果たしています。"},{"sentence":"The lab specializes in research related to immunochemistry.","translation":"その研究所は免疫化学に関連する研究を専門としています。"}],"collocations":["immunochemistry assay","immunochemistry analysis","immunochemistry techniques","immunochemistry research","clinical immunochemistry"],"synonyms":["immunological chemistry"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'immuno-' (referring to the immune system) and 'chemistry'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪmjuːnoʊˈkemɪstri/","syllables":"im-mu-no-chem-is-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Immunochemistry is a specialized field that combines immunology and chemistry. It involves the study of the chemical structures and reactions of immune system components, such as antibodies and antigens. It is used in various applications including diagnostics, therapeutics, and research.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Immunochemistry is the study of immune cells under a microscope.","correct":"✓ Immunochemistry involves studying the chemical components of the immune system.","note":"Immunochemistry focuses on the chemical aspects of the immune system, not just the cells themselves. Microscopy is a separate technique often used in conjunction with immunochemistry."}],"priority":"★★☆"},"related_words":{"derivatives":["immunochemical (adjective)"],"related_terms":["immunology","chemistry","antibody","antigen","immunoassay","histochemistry"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Immunochemistry is a complex term used in science. It refers to the study of the chemical parts of the immune system and how they interact. This field is important for understanding diseases and developing new treatments. It is a combination of immunology (the study of the immune system) and chemistry (the study of substances and their properties)."},"example_sentences":[{"sentence":"The ELISA test is a common application of immunochemistry.","translation":"ELISA検査は、免疫化学の一般的な応用例です。","type":"general","meaning_category":"application"},{"sentence":"Immunochemistry techniques are used to identify specific proteins in tissue samples.","translation":"免疫化学的手法は、組織サンプル中の特定のタンパク質を同定するために使用されます。","type":"research","meaning_category":"techniques"},{"sentence":"Understanding immunochemistry is crucial for developing effective vaccines.","translation":"効果的なワクチンの開発には、免疫化学の理解が不可欠です。","type":"medical","meaning_category":"importance"}]}