{"word":"fistulization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"瘻孔形成（ろうこうけいせい）","english_definition":"The formation of a fistula, an abnormal connection between two body parts.","examples":[{"sentence":"Fistulization is a complication of Crohn's disease.","translation":"瘻孔形成はクローン病の合併症です。"},{"sentence":"Surgical intervention may be necessary to correct fistulization.","translation":"瘻孔形成を矯正するには外科的介入が必要となる場合があります。"}],"collocations":["anal fistulization (肛門瘻孔形成)","intestinal fistulization (腸瘻孔形成)"],"synonyms":["fistula formation"],"antonyms":[]}],"etymology":{"value":"From 'fistula' (Latin for 'pipe' or 'tube') + '-ization' (a suffix denoting a process or action).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɪstʃələˈzeɪʃən/","syllables":"fis-tu-li-za-tion"},"inflection":{"noun_plural":"fistulizations"},"usage_notes":{"explanation":"'Fistulization' refers specifically to the process of a fistula forming. A fistula is an abnormal passageway between two organs, vessels, or other structures that are not normally connected. This term is primarily used in medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor treated the fistulization with antibiotics.","correct":"✓ The doctor treated the fistula with antibiotics.","note":"'Fistulization' is the process of forming a fistula. Antibiotics would treat an infection related to the fistula itself, not the process of its formation."}],"priority":"★★☆"},"related_words":{"derivatives":["fistula (noun: 瘻孔)","fistulous (adjective: 瘻孔性の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fistulization' is a medical term that describes the process by which a fistula forms in the body. A fistula is an abnormal connection between two body parts, such as organs or blood vessels. The term is mainly used in medical contexts when discussing complications of diseases or the results of surgical procedures. Because it is a specialized term, it is not commonly used outside of healthcare settings."},"example_sentences":[{"sentence":"The patient's inflammatory bowel disease led to severe fistulization.","translation":"患者の炎症性腸疾患は重度の瘻孔形成を引き起こした。","type":"noun","meaning_category":"瘻孔形成"},{"sentence":"Imaging studies confirmed the presence of fistulization between the bladder and the vagina.","translation":"画像検査で膀胱と膣の間の瘻孔形成の存在が確認された。","type":"noun","meaning_category":"瘻孔形成"}]}