{"word":"peace-building","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"平和構築","english_definition":"Activities undertaken to consolidate peace and prevent conflict recurrence after a ceasefire or peace agreement. It involves a range of measures targeted to reduce the risk of relapsing into conflict and to lay the foundations for sustainable peace and development.","examples":[{"sentence":"The UN is deeply involved in peace-building efforts in the region.","translation":"国連はその地域での平和構築活動に深く関わっています。"},{"sentence":"Effective peace-building requires the participation of all sectors of society.","translation":"効果的な平和構築には、社会のあらゆる分野の参加が必要です。"},{"sentence":"Education plays a crucial role in peace-building.","translation":"教育は平和構築において重要な役割を果たします。"}],"collocations":["peace-building process (平和構築プロセス)","peace-building activities (平和構築活動)","peace-building initiatives (平和構築イニシアチブ)","community-based peace-building (コミュニティベースの平和構築)","international peace-building (国際平和構築)"],"synonyms":["conflict resolution","peace promotion","reconciliation","nation-building"],"antonyms":["warfare","conflict","violence","aggression"]},{"part_of_speech":"adjective","definition":"平和構築の、平和構築に関する","english_definition":"Relating to or involved in the process of building or maintaining peace.","examples":[{"sentence":"This is a peace-building project aimed at fostering reconciliation.","translation":"これは和解を促進することを目的とした平和構築プロジェクトです。"},{"sentence":"The organization focuses on peace-building initiatives in post-conflict countries.","translation":"その組織は紛争後の国々における平和構築イニシアチブに焦点を当てています。"},{"sentence":"Peace-building efforts are essential for long-term stability.","translation":"平和構築の取り組みは長期的な安定のために不可欠です。"}],"collocations":["peace-building mission (平和構築ミッション)","peace-building organization (平和構築組織)","peace-building strategy (平和構築戦略)","peace-building training (平和構築トレーニング)"],"synonyms":["peace-promoting","reconciliatory"],"antonyms":["war-mongering","conflict-inducing"]}],"etymology":{"value":"The term 'peace-building' emerged in the 1990s, gaining prominence with the work of Johan Galtung and the UN's 'Agenda for Peace' report. It combines 'peace' (from Latin 'pax', meaning absence of war) and 'building' (the act of constructing or establishing something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpiːsˌbɪldɪŋ/","syllables":"peace-build-ing"},"inflection":{"notes":"As a noun, it is generally uncountable. As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Peace-building' refers to a comprehensive set of activities undertaken after conflict to prevent its recurrence and create sustainable peace. It goes beyond peacekeeping and peacemaking to address the root causes of conflict and build resilient societies. It often involves political, economic, social, and security measures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ peace building (without the hyphen)","correct":"✓ peace-building","note":"The hyphen is important to indicate that it is a compound word with a specific meaning."},{"incorrect":"✗ peace building is only about stopping wars.","correct":"✓ peace-building is about preventing conflict recurrence and building sustainable peace.","note":"Peace-building is more than just stopping wars; it involves long-term efforts to address the root causes of conflict."}],"priority":"★★☆"},"related_words":{"derivatives":["peacebuilder (noun: a person or organization involved in peace-building)"],"phrases":["peacekeeping (維持和平)","peacemaking (和平工作)","conflict prevention (紛争予防)","reconciliation (和解)","transitional justice (移行期正義)","good governance (グッドガバナンス)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing in academic and policy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peace-building' is a specialized term used in international relations, political science, and development studies. It refers to the complex process of creating lasting peace after conflict. This involves addressing the underlying causes of violence, promoting reconciliation, and building strong institutions. It is a more comprehensive approach than simply peacekeeping or peacemaking. Understanding this term requires familiarity with concepts of conflict resolution, development, and international security."},"example_sentences":[{"sentence":"The international community is supporting peace-building efforts in the region.","translation":"国際社会は、その地域における平和構築の取り組みを支援しています。","type":"noun","meaning_category":"平和構築"},{"sentence":"The peace-building process requires a long-term commitment.","translation":"平和構築プロセスには長期的なコミットメントが必要です。","type":"noun","meaning_category":"平和構築"},{"sentence":"The organization specializes in peace-building training.","translation":"その組織は平和構築トレーニングを専門としています。","type":"adjective","meaning_category":"平和構築の"},{"sentence":"Community-based peace-building initiatives are crucial for sustainable peace.","translation":"コミュニティベースの平和構築イニシアチブは、持続可能な平和のために重要です。","type":"adjective","meaning_category":"平和構築の"}]}