{"word":"anilid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"環形動物","english_definition":"A segmented worm of the phylum Annelida, such as an earthworm or a leech.","examples":[{"sentence":"Earthworms are anilids that play an important role in soil health.","translation":"ミミズは土壌の健康に重要な役割を果たす環形動物です。"},{"sentence":"Leeches are parasitic anilids that feed on the blood of other animals.","translation":"ヒルは他の動物の血液を吸って生きる寄生性の環形動物です。"}],"collocations":["marine anilid","freshwater anilid","terrestrial anilid"],"synonyms":["segmented worm"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'anellus' meaning 'little ring,' referring to the ring-like segments of the body.","priority":"★★☆"},"pronunciation":{"ipa":"ˈænəlɪd","syllables":"an-i-lid"},"inflection":{"noun_plural":"anilids"},"usage_notes":{"explanation":"'Anilid' is a scientific term used in biology and zoology to refer to any member of the phylum Annelida. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an anilid in the garden, it was very big.","correct":"✓ I saw an earthworm in the garden, it was very big.","note":"In general conversation, it's more common to use the specific name of the anilid (e.g., earthworm, leech) rather than the general term 'anilid'."}],"priority":"★★☆"},"related_words":{"derivatives":["Annelida (phylum name)","annelidan (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'anilid' is a technical term used in the field of zoology to describe segmented worms belonging to the phylum Annelida. It's more common to use specific examples such as 'earthworm' or 'leech' in general conversation. Understanding this term is helpful in scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The diversity of anilids in marine environments is vast.","translation":"海洋環境における環形動物の多様性は広大です。","type":"noun","meaning_category":"環形動物"},{"sentence":"Annelids, including anilids, are characterized by their segmented bodies.","translation":"環形動物（環形動物を含む）は、その体節構造によって特徴付けられます。","type":"noun","meaning_category":"環形動物"}]}