{"word":"declassato","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Italian, of a wine) downgraded; having had its classification lowered.","english_definition":"(Italian, of a wine) having had its classification lowered, typically due to failing to meet the required standards or regulations.","examples":[{"sentence":"Il vino era declassato a causa di problemi di qualità.","translation":"The wine was downgraded due to quality issues.","note":"Example sentence demonstrates the use of 'declassato' to describe a wine that has had its classification lowered."}],"collocations":["vino declassato (downgraded wine)"],"synonyms":["downgraded","reclassified","demoted"],"antonyms":["promoted","upgraded","classified"],"notes":"This term is primarily used in the context of Italian wines and their classifications, such as DOC and DOCG."}],"etymology":{"value":"From the Italian verb 'declassare,' meaning 'to declassify' or 'downgrade.' This is formed from the prefix 'de-' (meaning 'down' or 'away from') and 'classare' (meaning 'to classify').","priority":"N/A"},"pronunciation":{"ipa":"/dek.lasˈsa.to/","syllables":"de-clas-sa-to"},"inflection":{"gender":"masculine","number":"singular","notes":"As an adjective in Italian, 'declassato' changes form to agree in gender and number with the noun it modifies. The feminine singular form is 'declassata,' the masculine plural is 'declassati,' and the feminine plural is 'declassate.'"},"usage_notes":{"explanation":"'Declassato' is used specifically to describe a wine that has been officially downgraded from a higher classification to a lower one. This often happens when the wine does not meet the standards required for its original classification, such as failing quality control tests or not adhering to production regulations.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Il vino è declassato al supermercato.","correct":"Il vino è venduto come vino declassato.","note":"The first sentence implies the wine is downgraded *at* the supermarket, which doesn't make sense. The correction clarifies that the wine is *sold* as a downgraded wine."}],"priority":"N/A"},"related_words":{"derivatives":["declassare (verb: to declassify, to downgrade)","classificato (adjective: classified)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in specialist contexts related to Italian wine.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Declassato' is a specialized term primarily used in the context of Italian wine. Understanding its meaning requires familiarity with the Italian wine classification system (e.g., DOC, DOCG) and the regulations governing wine production. The term indicates that a wine has been downgraded from a higher classification due to failing to meet certain standards or regulations. It is not commonly used in general conversation and is more likely to be encountered in wine reviews, articles, or discussions among wine enthusiasts."},"example_sentences":[{"sentence":"Questo Barolo è stato declassato a Nebbiolo d'Alba.","translation":"This Barolo was downgraded to Nebbiolo d'Alba.","type":"adjective","meaning_category":"downgraded wine"}]}