{"word":"dacha","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ダーチャ (ロシア風別荘)","english_definition":"A country house or cottage in Russia or other post-Soviet countries, typically used as a vacation or second home.","examples":[{"sentence":"Many city dwellers in Russia have a dacha where they spend their weekends.","translation":"ロシアの多くの都市住民は、週末を過ごすダーチャを持っています。"},{"sentence":"We spent the summer at our dacha, growing vegetables and relaxing.","translation":"私たちは夏をダーチャで過ごし、野菜を育てたり、リラックスしたりしました。"},{"sentence":"The dacha is a traditional part of Russian culture.","translation":"ダーチャはロシア文化の伝統的な一部です。"}],"collocations":["summer dacha","country dacha","family dacha","go to the dacha","spend time at the dacha"],"synonyms":["country house","cottage","villa (sometimes)"],"antonyms":["city apartment"],"related_terms":["садовый участок (sadovy uchastok) - garden plot","огород (ogorod) - vegetable garden"],"cultural_notes":"ダーチャは、ソ連時代に都市住民に割り当てられた小さな土地付きの別荘として始まりました。食糧難の時代には、食料を自給自足するための菜園としても重要な役割を果たしました。現在では、週末や休暇を自然の中で過ごすための場所として人気があります。","regional_variations":"ダーチャの形態や利用方法は、ロシアだけでなく、ウクライナ、ベラルーシ、その他の旧ソ連諸国でも異なります。"}],"etymology":{"value":"Derived from the Russian word 'дача' (dacha), which originally meant 'something given' or 'allotment'. It comes from the verb 'дать' (dat'), meaning 'to give'. In the 18th century, dachas were plots of land given by the Tsar to loyal servants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɑːtʃə/","syllables":"da-cha"},"inflection":{"noun_plural":"dachas"},"usage_notes":{"explanation":"The term 'dacha' is primarily used in the context of Russian and other post-Soviet cultures. It refers to a specific type of country house that often has a garden or vegetable plot. While it can be translated as 'country house' or 'cottage', it carries a cultural significance that those terms may not fully capture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to my summer house in Russia. It's like a dacha.","correct":"✓ I'm going to my dacha for the summer.","note":"While 'summer house' can be used, 'dacha' is more specific and culturally relevant when referring to a Russian country house."},{"incorrect":"✗ Dachas are only for rich people.","correct":"✓ Dachas are common among people of various income levels in Russia.","note":"While some dachas can be luxurious, many are simple and affordable, reflecting their historical role as allotments for ordinary citizens."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["Russian culture","Soviet history","gardening","summer vacation"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (due to cultural specificity)","frequency_google_ngram":"Relatively low frequency outside of contexts related to Russia and post-Soviet countries.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'dacha' refers to a specific type of country house common in Russia and other post-Soviet countries. It's more than just a second home; it's often associated with gardening, relaxation, and a connection to nature. Understanding the cultural context is key to using this word correctly. While you could use 'country house' or 'cottage' as a general translation, 'dacha' carries a unique cultural weight."},"example_sentences":[{"sentence":"Every spring, the family packs up their belongings and heads to their dacha outside of Moscow.","translation":"毎年春になると、家族は荷物をまとめてモスクワ郊外のダーチャに向かいます。","type":"noun","meaning_category":"Russian country house"},{"sentence":"Growing your own vegetables at the dacha is a popular pastime for many Russians.","translation":"ダーチャで自分の野菜を育てることは、多くのロシア人にとって人気のある趣味です。","type":"noun","meaning_category":"Russian country house"},{"sentence":"The dacha provided a much-needed escape from the hustle and bustle of city life.","translation":"ダーチャは、都会の喧騒から逃れるための必要不可欠な場所を提供してくれました。","type":"noun","meaning_category":"Russian country house"},{"sentence":"During the Soviet era, the dacha served as a vital source of food for many families.","translation":"ソ連時代には、ダーチャは多くの家族にとって重要な食料源でした。","type":"noun","meaning_category":"Russian country house"}]}