{"word":"distichal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学)二列生の、二方向に並んだ","english_definition":"arranged in two vertical rows or ranks.","examples":[{"sentence":"The leaves of this grass are distichal.","translation":"この草の葉は二列生です。"},{"sentence":"Distichal phyllotaxis is common in many plant species.","translation":"二列生の葉序は多くの植物種によく見られます。"}],"collocations":["distichal leaves (二列生の葉)","distichal arrangement (二列の配置)","distichal phyllotaxis (二列生の葉序)"],"synonyms":["two-ranked","biseriate"],"antonyms":["spiral","alternate"]}],"etymology":{"value":"Derived from the Greek word 'distichos', meaning 'arranged in two rows' or 'in two ranks'. 'Dis-' means 'two' and 'stichos' means 'row' or 'rank'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪstɪkəl/","syllables":"dis-ti-chal"},"inflection":{"notes":"Adjectives do not typically inflect in English, but they can be modified by adverbs (e.g., very distichal)."},"usage_notes":{"explanation":"'Distichal' is a botanical term used to describe the arrangement of leaves, flowers, or other plant parts in two vertical rows on opposite sides of a stem. It is a specific type of phyllotaxis (leaf arrangement). This term is primarily used in botany and related scientific fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has a distichal pattern all over.","correct":"✓ The plant has a distichal arrangement of leaves.","note":"'Distichal' specifically refers to the arrangement in two rows; it's best used to describe specific plant parts like leaves or flowers, rather than a general pattern. "},{"incorrect":"✗ The distichal plant grew taller than the others.","correct":"✓ The plant with distichal leaves grew taller than the others.","note":"It's more precise to say 'plant with distichal leaves' rather than implying the entire plant is distichal. "},{"incorrect":"✗ The leaves are distichal to each other.","correct":"✓ The leaves are distichal on the stem.","note":"'Distichal' describes the arrangement on a stem or axis, not the relationship between individual leaves."}],"priority":"★☆☆"},"related_words":{"derivatives":["distichously (adverb)"],"phrasal_verbs":[],"related_terms":["phyllotaxis (葉序)","alternate (互生)","opposite (対生)","whorled (輪生)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Distichal' is a technical term used in botany to describe a specific arrangement of leaves or other plant parts. It means that these parts are arranged in two vertical rows along a stem, with each row on opposite sides of the stem. This term is not commonly used outside of botanical contexts. Understanding this term requires knowledge of basic botanical concepts like 'phyllotaxis' (leaf arrangement)."},"example_sentences":[{"sentence":"The bamboo shoot exhibited a clear distichal arrangement of bracts.","translation":"そのタケノコは苞が明確な二列生配列を示していた。","type":"descriptive","meaning_category":"botany"},{"sentence":"In distichal leaf arrangement, each leaf emerges at a 180-degree angle from the previous one.","translation":"二列生の葉序では、各葉は前の葉から180度の角度で生じる。","type":"descriptive","meaning_category":"botany"},{"sentence":"The distichal pattern allows maximum light exposure for each leaf.","translation":"二列生パターンは各葉が最大限に光を浴びることを可能にする。","type":"functional","meaning_category":"botany"}]}