{"word":"Eisenhower","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アイゼンハワー (姓)","english_definition":"A surname.","examples":[]},{"part_of_speech":"noun","definition":"ドワイト・D・アイゼンハワー (アメリカ合衆国の第34代大統領)","english_definition":"Dwight D. Eisenhower (1890-1969), the 34th President of the United States (1953-1961).","examples":[{"sentence":"Eisenhower was a five-star general in the United States Army during World War II.","translation":"アイゼンハワーは第二次世界大戦中、アメリカ陸軍の五つ星将軍でした。"},{"sentence":"Eisenhower signed the legislation that created the Interstate Highway System.","translation":"アイゼンハワーは州間高速道路システムを創設する法律に署名しました。"}],"synonyms":["Ike"],"antonyms":[]},{"part_of_speech":"noun","definition":"アイゼンハワー (人名に由来する地名、施設名など)","english_definition":"Places, institutions, etc. named after Dwight D. Eisenhower.","examples":[{"sentence":"Eisenhower National Historic Site preserves Eisenhower's home and farm near Gettysburg, Pennsylvania.","translation":"アイゼンハワー国立史跡は、ペンシルベニア州ゲティスバーグ近郊にあるアイゼンハワーの家と農場を保存しています。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"German surname, originally from the Rhineland.  The first element is likely from Middle High German 'isen' (iron), and the second element is from 'hauer' (hewer, cutter), referring to a metalworker or miner.","priority":"★★☆"},"pronunciation":{"ipa":"ˈaɪzənˌhaʊər","syllables":"I-zen-how-er"},"inflection":{},"usage_notes":{"explanation":"'Eisenhower' is primarily known as the surname of Dwight D. Eisenhower, a prominent figure in American history. It is also used to refer to places or things named in his honor.","priority":"★★★"},"common_mistakes":{},"related_words":[],"level_frequency":{"frequency_google_ngram":"Relatively frequent, especially in historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Eisenhower' is a proper noun, primarily referring to Dwight D. Eisenhower, a former U.S. President. It is commonly encountered in history lessons or discussions about American politics and World War II. It may also refer to places or institutions named after him."},"example_sentences":[{"sentence":"President Eisenhower warned against the military-industrial complex.","translation":"アイゼンハワー大統領は軍産複合体について警告しました。","type":"noun","meaning_category":"President"},{"sentence":"The Eisenhower Matrix is a time management tool based on urgency and importance.","translation":"アイゼンハワーマトリックスは、緊急性と重要性に基づく時間管理ツールです。","type":"noun","meaning_category":"Other uses"}]}