{"word":"clean-souled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"心が清い、純粋な魂を持つ","english_definition":"Having a pure and virtuous soul; morally untainted.","examples":[{"sentence":"She was a clean-souled woman, always helping those in need.","translation":"彼女は心が清い女性で、いつも困っている人々を助けていた。"},{"sentence":"His clean-souled nature made him a beloved figure in the community.","translation":"彼の純粋な魂は、彼を地域社会で愛される人物にした。"}],"collocations":["a clean-souled person","clean-souled and kind","clean-souled individual"],"synonyms":["pure-hearted","virtuous","innocent","upright","noble","good-natured","kind-hearted"],"antonyms":["evil-souled","corrupt","wicked","dishonest","immoral","tainted"]},{"part_of_speech":"adjective","definition":"汚れのない魂を持つ、罪のない","english_definition":"Free from sin or moral impurity.","examples":[{"sentence":"The artist portrayed the angel as a clean-souled being of light.","translation":"その芸術家は、天使を罪のない光の存在として描いた。"},{"sentence":"He sought to live a clean-souled life, avoiding temptation and wrongdoing.","translation":"彼は誘惑や不正行為を避け、罪のない人生を送ろうとした。"}],"collocations":["clean-souled angel","clean-souled life","clean-souled spirit"],"synonyms":["sinless","immaculate","unblemished","spotless","unsullied"],"antonyms":["sinful","defiled","polluted","stained"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'clean' (meaning pure, untainted) and 'souled' (having a soul). It emphasizes the purity and moral integrity of one's soul or inner being.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkliːn ˈsoʊld/","syllables":"clean-souled"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., very clean-souled) and used in comparative and superlative forms, though these are less common (e.g., more clean-souled, most clean-souled)."},"usage_notes":{"explanation":"'Clean-souled' is often used to describe someone who is genuinely good, kind, and morally upright. It suggests a deep-seated purity of character and a lack of malice or corruption. The term is somewhat literary and is often used in a positive and complimentary way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a clean-soul person.","correct":"✓ He is a clean-souled person.","note":"The correct form is 'clean-souled,' which is an adjective. 'Clean-soul' is not a standard term."},{"incorrect":"✗ She has clean-souled.","correct":"✓ She is clean-souled.","note":"'Clean-souled' is an adjective and should be used with a linking verb like 'is,' 'was,' etc."}],"priority":"★★☆"},"related_words":{"derivatives":["cleanliness (noun: the state of being clean)","soul (noun: the spiritual or immaterial part of a human being or animal)"],"phrases":["pure of heart","morally upright","of good character"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (The term is relatively uncommon and not typically included in CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency - The term is not very common in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Clean-souled' is a more advanced adjective used to describe someone with a pure and virtuous soul. It suggests a high level of moral integrity and a lack of corruption or malice. This term is not commonly used in everyday conversation but is more often found in literature or formal writing to convey a strong sense of moral purity. Understanding the nuances of this word requires a good grasp of abstract concepts related to morality and virtue."},"example_sentences":[{"sentence":"The protagonist was portrayed as a clean-souled hero, fighting for justice and truth.","translation":"主人公は、正義と真実のために戦う、心が清い英雄として描かれていた。","type":"adjective","meaning_category":"pure and virtuous"},{"sentence":"Despite the hardships he faced, he remained a clean-souled individual, never succumbing to bitterness.","translation":"彼が直面した苦難にもかかわらず、彼は心が清い人物のままで、決して苦味に屈することはなかった。","type":"adjective","meaning_category":"morally untainted"},{"sentence":"Her clean-souled nature shone through in her selfless acts of kindness.","translation":"彼女の心が清い性質は、彼女の無私の親切な行為を通して輝いていた。","type":"adjective","meaning_category":"pure and virtuous"}]}