{"word":"Coredemptress","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Roman Catholicism) A title applied to the Virgin Mary by some Roman Catholics, referring to her participation in the redemption of humanity by Jesus Christ.","english_definition":"A title used by some Roman Catholics to describe the Virgin Mary's role in the redemption of humanity alongside Jesus Christ.","examples":[{"sentence":"Some theologians support the formal recognition of Mary as Coredemptress.","translation":"一部の神学者は、マリアを共同贖罪者として正式に認めることを支持している。"},{"sentence":"The concept of Mary as Coredemptress is a point of theological debate within the Catholic Church.","translation":"マリアを共同贖罪者とする概念は、カトリック教会内で神学的な議論の的となっている。"}],"collocations":["invoke Mary as Coredemptress","the theology of Coredemptress","debate about Coredemptress"],"synonyms":["Mediatrix","Advocate","Queen Mother"],"antonyms":[]}],"etymology":{"value":"A combination of 'co-' (meaning 'together with' or 'jointly'), 'redemptress' (the feminine form of 'redeemer,' referring to a female who redeems or saves), and the Latin root 'redimere' (to buy back, redeem).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊ.riˈdɛmptrɪs/","syllables":"Co-re-demp-tress"},"inflection":{"noun_plural":"Coredemptresses"},"usage_notes":{"explanation":"The term 'Coredemptress' is controversial within Roman Catholicism. While some Catholics advocate for its formal recognition as a dogma, others oppose it, arguing that it diminishes the unique role of Jesus Christ as the sole Redeemer. The official position of the Catholic Church does not formally recognize Mary with this title. The term suggests that Mary played a subordinate but essential role in the salvation of humanity through her cooperation with Jesus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Coredemptress is equal to Jesus in power.","correct":"✓ The Coredemptress is believed to have a subordinate role to Jesus in the redemption.","note":"The Coredemptress, if the title is accepted, is understood to have a subordinate role to Jesus, not equal power. Jesus is considered the sole Redeemer. Mary's role is seen as cooperative and secondary."},{"incorrect":"✗ All Catholics believe in Mary as Coredemptress.","correct":"✓ Some Catholics believe in Mary as Coredemptress, but it is not a universally accepted doctrine.","note":"Belief in Mary as Coredemptress is not a universally held belief among Catholics. It is a debated topic."}],"priority":"★★☆"},"related_words":{"derivatives":["Redemptress","Redeemer","Redemption"],"phrases":["Immaculate Conception","Assumption of Mary","Veneration of Mary"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is primarily used within specific theological discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Coredemptress' is a complex theological term primarily used within Roman Catholicism. It refers to the belief that the Virgin Mary participated in the redemption of humanity alongside Jesus Christ. Understanding this term requires familiarity with Catholic theology and Marian doctrines. It is not a commonly used term in everyday language and is mainly found in theological discussions and writings. The term is controversial, and its meaning and implications are debated among theologians and within the Catholic Church.","priority":"★☆☆"},"example_sentences":[{"sentence":"The faithful often invoke the Virgin Mary as Coredemptress in their prayers.","translation":"信者たちはしばしば祈りの中で聖母マリアを共同贖罪者として呼び求める。","type":"noun","meaning_category":"Religious Title"},{"sentence":"The theological implications of Mary's role as Coredemptress are extensively debated.","translation":"マリアの共同贖罪者としての役割の神学的意味合いは広範囲にわたって議論されている。","type":"noun","meaning_category":"Theological Concept"}]}