{"word":"OECD","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"経済協力開発機構","english_definition":"Organisation for Economic Co-operation and Development: an international organisation founded in 1961 to stimulate economic progress and world trade.","examples":[{"sentence":"The OECD publishes economic forecasts for its member countries.","translation":"OECDは、加盟国の経済予測を発表している。"},{"sentence":"The OECD promotes policies to improve the well-being of people around the world.","translation":"OECDは、世界中の人々の幸福を向上させるための政策を推進している。"}],"collocations":["OECD countries (OECD加盟国)","OECD report (OECD報告書)","OECD average (OECD平均)","OECD guidelines (OECDガイドライン)","OECD data (OECDデータ)","OECD member (OECDメンバー)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The acronym OECD stands for Organisation for Economic Co-operation and Development. It was formed in 1961 to succeed the Organisation for European Economic Co-operation (OEEC), which was created in 1948 to administer the Marshall Plan for the reconstruction of Europe after World War II. The OECD expanded its membership beyond Europe to include countries from North America, Asia, and other regions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊˌiːˌsiːˈdiː/","syllables":"O-E-C-D"},"inflection":{"notes":"It is an acronym, so it does not inflect."},"usage_notes":{"explanation":"OECD is an acronym for the Organisation for Economic Co-operation and Development. It is typically used as a noun to refer to the organization itself or to data, reports, and policies associated with the organization. It is commonly used in economics, political science, and international relations contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The OECD are meeting next week.","correct":"✓ The OECD is meeting next week.","note":"Although the OECD represents multiple countries, it is treated as a singular entity when referring to the organization as a whole."},{"incorrect":"✗ I work for the OEcd.","correct":"✓ I work for the OECD.","note":"Pay attention to the capitalization of the acronym."}],"priority":"★★☆"},"related_words":{"derivatives":["OECD member (OECD加盟国)","OECD report (OECD報告書)","OECD average (OECD平均)"],"related_organizations":["United Nations (国連)","World Bank (世界銀行)","International Monetary Fund (IMF)","World Trade Organization (WTO)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in economics and policy-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'OECD' refers to the Organisation for Economic Co-operation and Development, an international organization that works to promote policies that improve the economic and social well-being of people around the world. It is commonly used in discussions related to economics, international relations, and public policy. Understanding the role and function of the OECD is important for comprehending global economic trends and policy debates.","example_sentences":[]},"example_sentences":[{"sentence":"The **OECD** has called for governments to increase investment in education.","translation":"OECDは、各国政府に教育への投資を増やすよう求めている。","type":"noun","meaning_category":"Organization"},{"sentence":"According to the **OECD** report, income inequality is rising in many developed countries.","translation":"OECDの報告書によると、多くの先進国で所得格差が拡大している。","type":"noun","meaning_category":"Report"},{"sentence":"The **OECD** countries have agreed to a new set of environmental standards.","translation":"OECD加盟国は、新たな環境基準に合意した。","type":"noun","meaning_category":"Member countries"}]}