{"word":"imbruted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"獣のような、野蛮な、知性を失った","english_definition":"Reduced to the condition of a brute; brutalized; degraded in intellect or sensibility.","examples":[{"sentence":"The prisoner was imbruted by years of solitary confinement.","translation":"囚人は長年の独房監禁によって獣のようになった。"},{"sentence":"The constant violence had imbruted the soldiers.","translation":"絶え間ない暴力は兵士たちを野蛮にした。"},{"sentence":"His face was imbruted by rage.","translation":"彼の顔は怒りによって獣のようだった。"}],"collocations":["imbruted mind","imbruted state","imbruted by violence","imbruted by despair"],"synonyms":["brutalized","degraded","animalistic","bestial","savage","feral","coarsened","debased"],"antonyms":["civilized","refined","cultivated","enlightened","humane"]}],"etymology":{"value":"Derived from the verb 'imbrute,' which comes from 'brute,' meaning a non-human creature or a cruel, insensitive person. The prefix 'im-' means 'to cause to become.' Thus, 'imbruted' means 'caused to become like a brute.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈbruːtɪd/","syllables":"im-bru-ted"},"inflection":{"adjective_forms":{"comparative":"more imbruted","superlative":"most imbruted"}},"usage_notes":{"explanation":"'Imbruted' describes a state where someone has lost their higher intellectual or moral qualities and has become more like a brute animal. It often implies a loss of sensitivity, intelligence, or humanity due to harsh conditions, violence, or other degrading influences. This word is not commonly used in modern English and is more often found in literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The imbruted dog wagged its tail.","correct":"✓ The brutal dog bit the child.","note":"'Imbruted' is usually applied to humans who have lost their humanity, not to animals. Use 'brutal' or another appropriate adjective for animals."},{"incorrect":"✗ He felt imbruted after a good night's sleep.","correct":"✓ He felt refreshed after a good night's sleep.","note":"'Imbruted' implies a negative state of degradation, not a positive state of refreshment."}],"priority":"★★☆"},"related_words":{"derivatives":["imbrute (verb): to degrade to the level of a brute","brute (noun): a brutal person or animal; (adjective): characterized by violence or insensitivity","brutish (adjective): resembling or characteristic of a brute; coarse or stupid","brutality (noun): savage cruelty"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A relatively rare word, primarily found in literary or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Imbruted' is a sophisticated word that describes someone who has lost their intellectual or moral sensibilities, becoming more like a brute animal. It's often used in literature to depict characters who have been degraded by harsh conditions or violence. Because of its specific and negative connotation, it's not a word you'd typically encounter in everyday conversation. Instead, you'd find it in more formal or literary contexts where the author wants to emphasize the loss of humanity in a character or group of people."},"example_sentences":[{"sentence":"The years of war had left the population imbruted and desensitized to violence.","translation":"長年の戦争は住民を獣のようにし、暴力に無感覚にさせた。","type":"adjective","meaning_category":"degraded by war"},{"sentence":"He saw the imbruted look in the prisoner's eyes, a reflection of the cruelty he had endured.","translation":"彼は囚人の目に獣のような表情を見た。それは彼が耐え忍んだ残酷さの反映だった。","type":"adjective","meaning_category":"loss of humanity"},{"sentence":"The once-gentle man had become imbruted by his addiction, losing all sense of compassion.","translation":"かつては優しかった男は、中毒によって獣のようになり、同情心をすべて失った。","type":"adjective","meaning_category":"degraded by addiction"}]}