{"word":"dizenment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"着飾ること、飾り立てること","english_definition":"The act of dressing up or adorning oneself in a showy or elaborate manner.","examples":[{"sentence":"The queen's dizenment was truly impressive.","translation":"女王の着飾りは本当に印象的だった。"},{"sentence":"She spent hours on her dizenment before the party.","translation":"彼女はパーティーの前に何時間もかけて着飾った。"}],"collocations":["elaborate dizenment","showy dizenment"],"synonyms":["adornment","embellishment","decoration","finery","array"],"antonyms":["simplicity","plainness","understatement"]}],"etymology":{"value":"Derived from the verb 'dizen', which means to dress or adorn. The suffix '-ment' is added to form a noun indicating the act or result of dizening.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪzənmənt/","syllables":"di-zen-ment"},"inflection":{"noun_plural":"dizenments"},"usage_notes":{"explanation":"'Dizenment' refers to the process or state of being elaborately dressed or adorned. It often implies a degree of showiness or ostentation. The word is not commonly used in modern English, and might be considered somewhat archaic or literary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dizenment of the room was simple.","correct":"✓ The decoration of the room was simple.","note":"'Dizenment' is generally used to describe personal adornment, not the decoration of a room. Use 'decoration' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["dizen (verb)","dizened (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dizenment' is a relatively rare and formal word that describes the act of dressing up in a fancy or elaborate way. It's not something you'd hear in everyday conversation, but you might encounter it in literature or historical contexts. It is related to the verb 'dizen', which means to adorn or dress up. Because of its rarity, it's best to use it in contexts where the formality and precision of the word are appropriate."},"example_sentences":[{"sentence":"The actress's dizenment for the premiere was breathtaking.","translation":"女優のプレミア上映のための着飾りは息をのむほどだった。","type":"noun","meaning_category":"着飾ること"},{"sentence":"The excessive dizenment of the wealthy was criticized during the economic crisis.","translation":"経済危機の際、富裕層の過度な着飾りが批判された。","type":"noun","meaning_category":"飾り立てること"}]}