{"word":"Anagennesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再生、復活、回帰","english_definition":"Spiritual rebirth; regeneration. A return to a former or original state.","examples":[{"sentence":"The concept of anagennesis is central to many religious and philosophical traditions.","translation":"再生の概念は、多くの宗教的および哲学的伝統の中心です。"},{"sentence":"The anagennesis of the ecosystem after the volcanic eruption was remarkable.","translation":"火山噴火後の生態系の再生は目覚ましいものでした。"}],"collocations":["spiritual anagennesis","ecosystem anagennesis"],"synonyms":["rebirth","regeneration","renewal","resurrection","restoration"],"antonyms":["degeneration","decay","destruction"]}],"etymology":{"value":"From Greek ἀναγέννησις (anagennēsis), from ἀνά (aná, \"again\") + γένεσις (genesis, \"birth, origin\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈdʒɛnəsɪs/","syllables":"an-a-gen-ne-sis"},"inflection":{"noun_plural":"anageneses"},"usage_notes":{"explanation":"Anagennesis is a relatively rare and formal word, often used in religious, philosophical, or scientific contexts to describe a process of renewal or return to an original state. It is more commonly encountered in academic or specialized writing than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anagennesis was quick and easy.","correct":"✓ The anagennesis was a slow and complex process.","note":"Anagennesis typically refers to a complex and gradual process, not a quick or easy one."}],"priority":"★☆☆"},"related_words":{"derivatives":["anagenetic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anagennesis' is a highly specialized term primarily used in academic or philosophical discussions. It refers to a spiritual or physical rebirth, or a return to an original state. Due to its limited usage and complex context, it is considered a C2 level word."},"example_sentences":[{"sentence":"The scientist studied the anagennesis of the damaged tissue.","translation":"科学者は損傷した組織の再生を研究しました。","type":"noun","meaning_category":"再生"},{"sentence":"Many believed that spiritual anagennesis was the key to eternal life.","translation":"多くの人が、精神的な再生が永遠の命の鍵だと信じていました。","type":"noun","meaning_category":"復活"},{"sentence":"The city underwent an anagennesis after the devastating earthquake.","translation":"その都市は壊滅的な地震の後、復興を遂げました。","type":"noun","meaning_category":"回帰"}]}