{"word":"Japhetic","priority":"低","meanings":[{"part_of_speech":"形容詞","definition":"ヤペテに属する、ヤペテの、ヤペテ語族の","english_definition":"Relating to Japheth or the Japhetic languages.","examples":[{"sentence":"The Japhetic peoples are believed to be the ancestors of many European and Asian groups.","translation":"ヤペテ族の人々は、多くのヨーロッパおよびアジアのグループの祖先であると考えられています。"}],"collocations":[],"synonyms":["Indo-European"],"antonyms":[]},{"part_of_speech":"名詞","definition":"ヤペテ語族","english_definition":"The Japhetic language family.","examples":[{"sentence":"Some linguists consider Indo-European languages to be Japhetic.","translation":"一部の言語学者は、インド・ヨーロッパ語族をヤペテ語族と見なしています。"}],"collocations":[],"synonyms":["Indo-European languages"],"antonyms":[]}],"etymology":{"value":"Derived from Japheth, a son of Noah in the Bible.","priority":"中"},"pronunciation":{"ipa":"/dʒæˈfɛtɪk/","syllables":"Ja-phet-ic"},"inflection":{"notes":"Adjective and noun forms exist. No plural form for the adjective."},"usage_notes":{"explanation":"The term 'Japhetic' is primarily used in historical linguistics and biblical studies to refer to the descendants of Japheth, one of Noah's sons in the Bible. It is often associated with the Indo-European language family, although this connection is debated among scholars.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"Japhetic languages are spoken only in Africa.","correct":"Japhetic languages are believed to be the ancestors of many European and Asian languages.","note":"Japhetic languages are associated with European and Asian languages, not African."}],"priority":"低"},"related_words":{"derivatives":["Japheth","Japhetite"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C2","text":"The term 'Japhetic' is highly specialized and primarily used in the context of historical linguistics and biblical genealogy. It refers to the descendants of Japheth, a son of Noah, and is often linked to the Indo-European language family. Due to its specific and academic usage, it is not commonly encountered in general language contexts."},"example_sentences":[{"sentence":"The study explores the potential links between Japhetic languages and ancient migrations.","translation":"その研究は、ヤペテ語族と古代の移住との潜在的なつながりを調査しています。","type":"adjective","meaning_category":"言語学"},{"sentence":"Some theories suggest that the Indo-European languages originated from a common Japhetic ancestor.","translation":"一部の説では、インド・ヨーロッパ語族は共通のヤペテ祖語に由来するとされています。","type":"adjective","meaning_category":"言語学"}]}