{"word":"gamboge","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"顔料としてのカンボジアゴム、カンボジアゴム色（濃い黄褐色）","english_definition":"A partially transparent deep yellow pigment, originally obtained from a resin from trees of the genus Garcinia, especially Garcinia hanburyi.","examples":[{"sentence":"The artist used gamboge to create a warm, golden effect in the painting.","translation":"その画家はカンボジアゴムを使って、絵に暖かく金色のような効果を出した。"},{"sentence":"Gamboge is a traditional pigment used in watercolor painting.","translation":"カンボジアゴムは水彩画に使われる伝統的な顔料です。"}],"collocations":["gamboge pigment","gamboge color","watercolor gamboge"],"synonyms":["deep yellow","golden brown","yellow pigment"],"antonyms":[]}],"etymology":{"value":"Derived from French 'gomme gutte' (gum-resin), from Dutch 'gom gutti', from Malay 'gatah' (gum) and 'Jambi' (a region in Sumatra known for its gamboge production). The ultimate origin is likely from the Khmer word 'kampuuch', referring to Cambodia, a source of the resin.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡæmˈbuːʒ/","syllables":"gam-boge"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"Gamboge is primarily known as a pigment used in art, particularly in watercolor painting. It produces a transparent, deep yellow color with a slightly brownish or golden undertone. Historically, it was extracted from the resin of certain trees in Southeast Asia, especially Cambodia. Due to its toxicity and lightfastness issues (fading over time), synthetic alternatives are now more commonly used. However, the term 'gamboge' is still used to refer to the specific shade of deep yellow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I painted with gamboge yesterday. It was very bright.","correct":"✓ I painted with gamboge yesterday. It was a deep yellow.","note":"Gamboge is a deep yellow color, not a bright yellow. It has a brownish or golden undertone."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gamboge' refers to a specific deep yellow pigment used in art. It's a relatively uncommon term outside of artistic or historical contexts. Understanding its origin and use requires familiarity with art history and pigment terminology."},"example_sentences":[{"sentence":"The antique map was colored with delicate washes of gamboge.","translation":"その古地図はカンボジアゴムの繊細な色合いで彩色されていた。","type":"noun","meaning_category":"顔料"},{"sentence":"Many traditional Buddhist robes are dyed using natural gamboge.","translation":"多くの伝統的な仏教の僧衣は天然のカンボジアゴムで染色されている。","type":"noun","meaning_category":"顔料"}]}