{"word":"arrestability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"逮捕可能性、逮捕されやすさ","english_definition":"The state or condition of being liable or subject to arrest; the degree to which someone is likely to be arrested.","examples":[{"sentence":"The suspect's high visibility in the area increased his arrestability.","translation":"容疑者の地域での高い視認性は、彼の逮捕可能性を高めた。"},{"sentence":"Factors such as prior offenses and outstanding warrants can influence a person's arrestability.","translation":"前科や未処理の逮捕状などの要因は、人の逮捕可能性に影響を与える可能性がある。"}],"collocations":["high arrestability","low arrestability","increase arrestability","decrease arrestability","assess arrestability","determine arrestability"],"synonyms":["liability to arrest","risk of arrest","vulnerability to arrest"],"antonyms":["immunity from arrest","unlikelihood of arrest"],"notes":"This term is often used in legal and law enforcement contexts."}],"etymology":{"value":"Derived from 'arrestable' (capable of being arrested) + '-ity' (a suffix indicating a state or condition).","priority":"☆☆☆"},"pronunciation":{"ipa":"/əˌrɛstəˈbɪləti/","syllables":"ar-rest-a-bil-i-ty"},"inflection":{"noun_plural":"arrestabilities (rarely used)"},"usage_notes":{"explanation":"'Arrestability' refers to the likelihood or susceptibility of a person being arrested. It's a concept often considered in law enforcement strategy and legal discussions. It is not a commonly used word in everyday conversation.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arrestability of the crime was high.","correct":"✓ The arrestability of the suspect was high.","note":"'Arrestability' refers to a person's likelihood of being arrested, not the crime itself."}],"priority":"☆☆☆"},"related_words":{"derivatives":["arrestable (adjective: capable of being arrested)","arrest (verb/noun: to seize and take into custody)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in legal or law enforcement contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Arrestability' is a specialized term primarily used in legal and law enforcement contexts. It refers to the degree to which someone is likely to be arrested, based on factors such as their behavior, location, or outstanding warrants. Due to its specific usage, it is not commonly encountered in general English conversation."},"example_sentences":[{"sentence":"The police focused on areas with high crime rates to maximize arrestability.","translation":"警察は逮捕可能性を最大化するために、犯罪率の高い地域に焦点を当てた。","type":"general","meaning_category":"likelihood of arrest"},{"sentence":"A lawyer might assess a client's arrestability based on the available evidence.","translation":"弁護士は入手可能な証拠に基づいて、クライアントの逮捕可能性を評価するかもしれない。","type":"legal","meaning_category":"likelihood of arrest"},{"sentence":"Increased surveillance led to a higher arrestability for individuals involved in illegal activities.","translation":"監視の強化は、違法行為に関与する個人の逮捕可能性を高めた。","type":"law enforcement","meaning_category":"likelihood of arrest"}]}