{"word":"Master-at-arms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(海軍)憲兵長、警邏長","english_definition":"(Naval) An enlisted member of the navy or coast guard who is responsible for maintaining order, enforcing regulations, and conducting investigations.","examples":[{"sentence":"The master-at-arms apprehended the sailor for being drunk and disorderly.","translation":"憲兵長は、酔っ払って騒いでいた水兵を逮捕した。"},{"sentence":"The master-at-arms is in charge of security on the ship.","translation":"憲兵長は船内の警備を担当している。"}],"collocations":["chief master-at-arms","assistant master-at-arms"],"synonyms":["military police","shore patrol"],"antonyms":[]}],"etymology":{"value":"The term 'master-at-arms' dates back to the age of sail, referring to the officer responsible for the ship's weapons and maintaining order. The role has evolved over time to focus primarily on law enforcement and security.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmæstər ət ˈɑːrmz/","syllables":"mas-ter-at-arms"},"inflection":{"noun_plural":"masters-at-arms"},"usage_notes":{"explanation":"The term 'master-at-arms' is specific to naval forces, including the navy and coast guard. It refers to an enlisted member who serves as a law enforcement and security specialist. The master-at-arms is responsible for maintaining good order and discipline, enforcing regulations, and conducting investigations of offenses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a master at arms.","correct":"✓ He is a master-at-arms.","note":"The correct term is 'master-at-arms' (with hyphens) when referring to the naval law enforcement specialist. 'Master at arms' (without hyphens) could refer to someone skilled in weaponry."}],"priority":"★★☆"},"related_words":{"derivatives":["MAA (abbreviation for master-at-arms)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'master-at-arms' is specialized military jargon. Understanding requires familiarity with naval ranks and law enforcement roles. The phrase refers to a specific position within the navy or coast guard responsible for maintaining order and enforcing regulations."},"example_sentences":[{"sentence":"The master-at-arms conducted a routine inspection of the barracks.","translation":"憲兵長は兵舎の定期検査を実施した。","type":"noun","meaning_category":"憲兵長、警邏長"},{"sentence":"All sailors are expected to obey the orders of the master-at-arms.","translation":"すべての水兵は憲兵長の命令に従うことが求められる。","type":"noun","meaning_category":"憲兵長、警邏長"}]}