{"word":"bibliologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"書誌学者、文献学者","english_definition":"A person who studies or is knowledgeable about books, especially their physical characteristics, printing history, and rarity.","examples":[{"sentence":"The bibliologist carefully examined the first edition of the novel.","translation":"その書誌学者は、その小説の初版を注意深く調べた。"},{"sentence":"A good bibliologist needs to know about paper types, binding techniques, and printing methods.","translation":"優れた書誌学者は、紙の種類、製本技術、印刷方法について知っている必要がある。"}],"collocations":["rare book bibliologist","historical bibliologist","manuscript bibliologist"],"synonyms":["book historian","book scholar","textual scholar","codicologist"],"antonyms":[]}],"etymology":{"value":"The word \"bibliologist\" is formed from \"biblio-\" (from Greek βιβλίον (biblion) meaning \"book\") + \"-logist\" (from Greek -λογία (-logia) meaning \"study of\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪbliˈɒlədʒɪst/","syllables":"bib-li-ol-o-gist"},"inflection":{"noun_plural":"bibliologists"},"usage_notes":{"explanation":"A bibliologist is someone who studies books as physical objects, focusing on their printing, binding, and other material aspects. This is distinct from a literary critic, who focuses on the content and meaning of the text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bibliologist interested in the story of the book.","correct":"✓ He is a bibliologist interested in the physical aspects of the book.","note":"Bibliologists focus on the physical characteristics of books, not the story itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["bibliology (noun: 書誌学)"],"phrases":["descriptive bibliography","analytical bibliography","historical bibliography"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"bibliologist\" is a specialized term used to describe someone who studies books as physical objects. It is not a common word and is typically used in academic or scholarly contexts. Understanding the term requires knowledge of the field of bibliography and its focus on the material aspects of books rather than their content.","priority":"★★☆"},"example_sentences":[{"sentence":"The bibliologist identified the watermark on the paper to determine the book's origin.","translation":"その書誌学者は、本の起源を特定するために、紙の透かしを調べた。","type":"example","meaning_category":"書誌学者"},{"sentence":"As a bibliologist, she specializes in the study of medieval manuscripts.","translation":"書誌学者として、彼女は中世写本の研究を専門としている。","type":"example","meaning_category":"書誌学者"}]}