{"word":"overfaithfully","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に忠実に、忠実すぎるほどに","english_definition":"In an excessively faithful manner; to an extreme degree of faithfulness.","examples":[{"sentence":"The movie adapted the book overfaithfully, resulting in a long and somewhat boring film.","translation":"その映画は原作に忠実すぎたため、長くてやや退屈な映画になってしまった。"},{"sentence":"He followed the instructions overfaithfully, even when it seemed illogical.","translation":"彼は指示が非論理的に思えるときでさえ、指示に忠実すぎるほどに従った。"}],"collocations":["adapt overfaithfully","follow overfaithfully","render overfaithfully"],"synonyms":["excessively faithfully","slavishly","pedantically","scrupulously"],"antonyms":["loosely","inaccurately","unfaithfully"]}],"etymology":{"value":"Derived from the adverbial combination of \"over-\" (excessively) and \"faithfully\" (in a faithful manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈfeɪθfəli/","syllables":"o-ver-faith-ful-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Overfaithfully\" describes actions or representations that adhere to a source material or set of instructions with excessive precision, often to the detriment of the final product or outcome. It implies a lack of independent judgment or creative interpretation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He overfaithfully is loyal.","correct":"✓ He is overfaithfully loyal.","note":"Adverbs typically modify verbs, adjectives, or other adverbs. In this case, 'overfaithfully' modifies the adjective 'loyal,' so it should be placed before it."},{"incorrect":"✗ She overfaithfully the instructions.","correct":"✓ She followed the instructions overfaithfully.","note":"'Overfaithfully' is an adverb and requires a verb to modify. You need to use a verb like 'followed' to make the sentence grammatically correct."}],"priority":"★★☆"},"related_words":{"derivatives":["overfaithful (adjective)","faithfully (adverb)","faithfulness (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"overfaithfully\" is a relatively uncommon adverb used to describe doing something in an excessively faithful manner. It suggests a level of adherence to detail that may be seen as excessive or even detrimental. Because of its nuanced meaning and infrequent use, it is more likely to be encountered in advanced texts or formal writing."},"example_sentences":[{"sentence":"The artist rendered the photograph overfaithfully, capturing every minute detail.","translation":"その芸術家は写真を細部まで忠実に再現しすぎた。","type":"adverb","meaning_category":"excessive faithfulness"},{"sentence":"The translator interpreted the text overfaithfully, resulting in a stilted and unnatural rendering.","translation":"翻訳者はテキストを忠実に解釈しすぎたため、不自然でぎこちない翻訳になった。","type":"adverb","meaning_category":"excessive faithfulness"}]}