{"word":"unscrutinisingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"綿密な調査なしに、吟味せずに、注意深く調べずに","english_definition":"without careful and thorough examination or analysis; without scrutinizing.","examples":[{"sentence":"The report was accepted unscrutinisingly by the committee.","translation":"その報告書は委員会によって吟味されずに受け入れられた。"},{"sentence":"He believed the advertisement unscrutinisingly, which led to his misfortune.","translation":"彼はその広告を注意深く調べずに信じてしまい、それが彼の不幸につながった。"}],"collocations":["accept unscrutinisingly","believe unscrutinisingly","approve unscrutinisingly"],"synonyms":["uncritically","naively","credulously","indiscriminately","carelessly"],"antonyms":["scrutinisingly","critically","carefully","thoroughly"]}],"etymology":{"value":"接頭辞 un- (否定) + scrutinisingly (scrutinizing + -ly)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnskruːtɪˈnaɪzɪŋli/","syllables":"un-scru-ti-ni-sing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Unscrutinisingly' means doing something without careful examination or critical evaluation. It suggests a lack of thoroughness or a willingness to accept things at face value. It is the opposite of 'scrutinisingly,' which implies a detailed and critical analysis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He unscrutinisingly accepted the gift with suspicion.","correct":"✓ He scrutinisingly examined the gift with suspicion.","note":"'Unscrutinisingly' implies a lack of suspicion or critical examination. If someone is suspicious, they are likely to scrutinize something, not accept it unscrutinisingly."},{"incorrect":"✗ She unscrutinisingly reviewed the document, making many errors.","correct":"✓ She unscrutinisingly reviewed the document, resulting in many errors.","note":"The action of reviewing 'unscrutinisingly' leads to errors. So, the correct sentence should reflect that the errors were a result of the unscrutinising review, not that she was making the errors while reviewing."}],"priority":"★★☆"},"related_words":{"derivatives":["unscrutinized (adjective)","scrutinizingly (adverb)","scrutinize (verb)","scrutiny (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unscrutinisingly' is a complex adverb that means 'without careful examination or analysis.' It is formed by adding the prefix 'un-' (meaning 'not') to 'scrutinisingly,' which itself is derived from 'scrutinize' (to examine closely and critically). This word is rare and typically used in formal or academic contexts to describe a lack of thoroughness or critical thinking. Understanding this word requires a strong vocabulary and the ability to recognize prefixes and suffixes."},"example_sentences":[{"sentence":"The contract was signed unscrutinisingly, leading to unforeseen legal problems.","translation":"その契約書は吟味されずに署名され、予期せぬ法的問題につながった。","type":"adverb","meaning_category":"lack of examination"},{"sentence":"She unscrutinisingly trusted the source of the information.","translation":"彼女はその情報の出所を吟味せずに信じた。","type":"adverb","meaning_category":"lack of examination"},{"sentence":"The data was accepted unscrutinisingly, resulting in flawed conclusions.","translation":"そのデータは吟味されずに受け入れられ、欠陥のある結論につながった。","type":"adverb","meaning_category":"lack of examination"}]}