{"word":"Recalcination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再焼成、再石灰化","english_definition":"The process of reheating a substance to drive off volatile matter or to restore it to its original condition; specifically, the reheating of calcium carbonate (limestone) to produce quicklime (calcium oxide).","examples":[{"sentence":"Recalcination of the lime sludge is necessary to recover the lime for reuse.","translation":"石灰泥を再焼成して、石灰を回収し再利用する必要があります。"},{"sentence":"The recalcination process reduces the amount of waste material.","translation":"再焼成プロセスは、廃棄物の量を削減します。"}],"collocations":["lime recalcination","sludge recalcination"],"synonyms":["reheating","reburning","calcination"],"antonyms":[]}],"etymology":{"value":"The word \"recalcination\" comes from the prefix \"re-\" (again) combined with \"calcination,\" which itself comes from the Latin word \"calcinare\" (to calcine), derived from \"calx\" (lime).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːkælsaɪˈneɪʃən/","syllables":"re-cal-ci-na-tion"},"inflection":{"noun_plural":"recalcinations"},"usage_notes":{"explanation":"Recalcination is primarily used in industrial contexts, particularly in processes involving calcium carbonate (limestone) and the production of lime. It refers to the process of reheating a material that has already been calcined (heated to a high temperature to drive off volatile substances). The most common application is in the lime cycle, where lime sludge (calcium carbonate) is a byproduct and is then re-heated to regenerate quicklime (calcium oxide) for reuse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recalcinated material was used directly without cooling.","correct":"✓ The recalcined material was used directly without cooling.","note":"\"Recalcined\" is the past participle adjective form, not \"recalcinated\"."}],"priority":"★★☆"},"related_words":{"derivatives":["recalcine (verb)","calcination (noun)","calcine (verb)","calcium carbonate (noun)","calcium oxide (noun)","lime (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recalcination' is a technical term used in chemistry and industrial processes, specifically related to the reheating of materials, particularly calcium carbonate, to regenerate lime. It is not commonly used in everyday language and is more likely to be encountered in scientific or engineering contexts."},"example_sentences":[{"sentence":"The efficiency of the lime cycle depends on the effective recalcination of the calcium carbonate.","translation":"石灰サイクルの効率は、炭酸カルシウムの効果的な再焼成に依存します。","type":"noun","meaning_category":"再焼成"},{"sentence":"Recalcination helps to reduce the environmental impact of lime production.","translation":"再焼成は、石灰製造の環境への影響を軽減するのに役立ちます。","type":"noun","meaning_category":"再焼成"}]}