{"word":"Metapsychosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"輪廻転生、霊魂転生","english_definition":"The supposed transmigration of the soul, especially its reincarnation after death.","examples":[{"sentence":"The concept of metapsychosis is central to many Eastern religions.","translation":"輪廻転生の概念は、多くの東洋の宗教において中心的なものです。"},{"sentence":"Ancient Greek philosophers also discussed the idea of metapsychosis.","translation":"古代ギリシャの哲学者たちもまた、輪廻転生の概念について議論しました。"}],"collocations":["belief in metapsychosis","doctrine of metapsychosis"],"synonyms":["transmigration of souls","reincarnation","metempsychosis"],"antonyms":["annihilationism","soul sleep"]}],"etymology":{"value":"From Ancient Greek μετά (metá, \"after, beyond\") + ψυχή (psūkhḗ, \"soul\") + -ωσις (-ōsis, suffix denoting a condition or process).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəsaɪˈkoʊsɪs/","syllables":"met-a-psy-cho-sis"},"inflection":{"noun_plural":"metapsychoses"},"usage_notes":{"explanation":"'Metapsychosis' refers specifically to the philosophical or religious concept of the soul moving from one body to another after death. It is closely related to, and often used interchangeably with, 'metempsychosis' and 'transmigration of souls'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied metapsychosis as a science.","correct":"✓ He studied metapsychosis as a philosophical concept.","note":"Metapsychosis is a philosophical or religious concept, not a scientific one."}],"priority":"★★☆"},"related_words":{"derivatives":["metempsychosis","transmigration","reincarnation"],"related_concepts":["afterlife","immortality","karma"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - A relatively rare term, primarily used in philosophical or religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Metapsychosis' is a specialized term primarily encountered in philosophical or religious discussions about the afterlife and the nature of the soul. It specifically refers to the belief that the soul moves from one body to another after death. Due to its niche usage, it is not a common word in everyday conversation. Understanding its etymology (Greek roots relating to 'beyond' and 'soul') can aid in grasping its meaning."},"example_sentences":[{"sentence":"The ancient Egyptians held strong beliefs in metapsychosis and the journey of the soul after death.","translation":"古代エジプト人は、輪廻転生と死後の魂の旅について強い信念を持っていました。","type":"general","meaning_category":"輪廻転生"},{"sentence":"Some philosophical schools view metapsychosis as a continuous cycle of birth, death, and rebirth.","translation":"一部の哲学学派は、輪廻転生を誕生、死、再生の連続的なサイクルと見なしています。","type":"philosophical","meaning_category":"輪廻転生"}]}