{"word":"extrospection","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"内省の反対; 自分の外側の世界に焦点を当てること、外部世界の観察。","english_definition":"The examination or observation of things external to oneself; the opposite of introspection.","examples":[{"sentence":"Extrospection involves looking outward and focusing on the external world.","translation":"外省は外に目を向け、外部世界に焦点を当てることを伴います。"},{"sentence":"Scientists rely on extrospection to gather data about the natural world.","translation":"科学者は、自然界に関するデータを収集するために外省に頼っています。"},{"sentence":"Unlike introspection, which explores internal thoughts and feelings, extrospection examines external realities.","translation":"内部の思考と感情を探求する内省とは異なり、外省は外部の現実を調べます。"}],"collocations":["focus on extrospection","practice extrospection","use extrospection","extrospection and introspection"],"synonyms":["observation","external observation","objectivity","outer perception"],"antonyms":["introspection","self-analysis","self-examination","self-reflection"]},{"part_of_speech":"noun","definition":"(心理学)他者の行動や感情を観察し、理解しようとすること。","english_definition":"(Psychology) The act of observing and attempting to understand the behavior and emotions of others.","examples":[{"sentence":"Extrospection is crucial for developing empathy and understanding social dynamics.","translation":"外省は共感を育み、社会のダイナミクスを理解するために不可欠です。"},{"sentence":"Psychologists use extrospection to study human behavior in various social contexts.","translation":"心理学者は、さまざまな社会的状況における人間の行動を研究するために外省を使用します。"},{"sentence":"Through extrospection, we can gain insights into the motivations and intentions of others.","translation":"外省を通して、私たちは他者の動機と意図についての洞察を得ることができます。"}],"collocations":["social extrospection","psychological extrospection","extrospection skills","develop extrospection"],"synonyms":["social perception","empathy","understanding others","observational skills"],"antonyms":["egocentrism","self-absorption","lack of empathy"]}],"etymology":{"value":"Formed from 'extro-' (meaning 'outward') and 'specere' (Latin for 'to look'), combined with the suffix '-tion' indicating an action or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌekstrəˈspɛkʃən/","syllables":"ex-tro-spec-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Extrospection is often contrasted with introspection. While introspection involves examining one's own thoughts and feelings, extrospection focuses on observing and understanding the external world or the behavior of others. It is a key concept in fields like psychology, sociology, and philosophy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used introspection to understand the behavior of his colleagues.","correct":"✓ He used extrospection to understand the behavior of his colleagues.","note":"Introspection is for understanding oneself, while extrospection is for understanding others or the external world."},{"incorrect":"✗ Extrospection is the same as being self-aware.","correct":"✓ Introspection is the same as being self-aware.","note":"Self-awareness is related to introspection, not extrospection."}],"priority":"★★☆"},"related_words":{"derivatives":["extrospective (adjective)"],"phrasal_verbs":null,"related_terms":["introspection","perception","observation","empathy"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Extrospection' is a less common word that refers to the act of looking outward and observing the external world, or understanding others, as opposed to looking inward at one's own thoughts and feelings (introspection). It is often used in academic contexts, particularly in psychology and philosophy, to describe the process of gaining knowledge through external observation. Understanding this word requires a good grasp of abstract concepts and the ability to differentiate it from its more commonly used counterpart, 'introspection'."},"example_sentences":[{"sentence":"The scientist employed careful extrospection to analyze the behavior of the primates in their natural habitat.","translation":"科学者は、自然の生息地における霊長類の行動を分析するために、注意深い外省を用いました。","type":"noun","meaning_category":"External observation"},{"sentence":"Effective communication relies on extrospection, allowing us to understand the needs and perspectives of others.","translation":"効果的なコミュニケーションは外省に依存しており、他者のニーズと視点を理解することができます。","type":"noun","meaning_category":"Understanding others"},{"sentence":"Through extrospection, the detective pieced together the events leading up to the crime.","translation":"外省を通して、刑事は犯罪に至るまでの出来事をまとめました。","type":"noun","meaning_category":"External observation"},{"sentence":"Extrospection is a valuable tool for researchers studying social interactions.","translation":"外省は、社会的な相互作用を研究する研究者にとって貴重なツールです。","type":"noun","meaning_category":"External observation"}]}