{"word":"beggarwise","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Wise only in matters relating to poverty or beggary; having the cunning or knowledge associated with beggars.","english_definition":"Wise only in matters relating to poverty or beggary; cunning in the ways of a beggar.","examples":[{"sentence":"The character was beggarwise, knowing all the tricks to get a free meal.","translation":"その登場人物は乞食に関する事柄だけ賢く、無料の食事を得るためのすべての策略を知っていた。"},{"sentence":"He was beggarwise, able to spot the most generous marks in a crowd.","translation":"彼は乞食に関する事柄だけ賢く、群衆の中で最も気前の良いカモを見抜くことができた。"}],"collocations":["beggarwise tricks","beggarwise cunning","beggarwise knowledge"],"synonyms":["streetwise","cunning","shrewd","wily"],"antonyms":["naive","unsophisticated","innocent"]}],"etymology":{"value":"Formed from 'beggar' + 'wise'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛɡərˌwaɪz/","syllables":"beg-gar-wise"},"inflection":{"notes":"The word 'beggarwise' does not have different inflections, as it is an adjective."},"usage_notes":{"explanation":"'Beggarwise' is a somewhat archaic or literary term, not commonly used in modern English. It describes someone who is clever or knowledgeable only in the ways of poverty or begging, often implying a certain level of cunning or lack of broader wisdom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was beggarwise in mathematics.","correct":"✓ He was skilled in mathematics.","note":"'Beggarwise' should only be used in the context of poverty or beggary, not general skills."}],"priority":"★☆☆"},"related_words":{"derivatives":["beggar (noun)","wise (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Beggarwise' is a rare and specialized word. It is used to describe someone who is knowledgeable or cunning only in matters related to poverty or begging. Because of its limited use and specialized meaning, it is not typically encountered in general English texts and would be considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The old man was beggarwise, knowing where to find the best scraps of food in the city.","translation":"その老人は乞食に関する事柄だけ賢く、街で最高の食べ残しを見つける場所を知っていた。","type":"adjective","meaning_category":"cunning in poverty"},{"sentence":"Only someone beggarwise could have survived on the streets for so long.","translation":"乞食に関する事柄だけ賢い人だけが、それほど長い間路上で生き残ることができたのだろう。","type":"adjective","meaning_category":"knowledgeable about beggary"}]}