{"word":"intercompany","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"会社間の、企業間の、関連会社間の","english_definition":"between or involving two or more companies, especially those within the same group or having a business relationship.","examples":[{"sentence":"The intercompany transactions must be carefully documented.","translation":"会社間の取引は慎重に記録されなければならない。"},{"sentence":"We need to eliminate intercompany profit from the consolidated financial statements.","translation":"連結財務諸表から会社間の利益を消去する必要がある。"},{"sentence":"The intercompany loan was used to finance the subsidiary's expansion.","translation":"会社間の融資は、子会社の拡大を資金調達するために使用された。"}],"collocations":["intercompany transactions (会社間取引)","intercompany loan (会社間融資)","intercompany transfer (会社間移転)","intercompany agreement (会社間契約)","intercompany account (会社間勘定)","intercompany pricing (会社間価格設定)"],"synonyms":["intra-group","affiliated","related"],"antonyms":["external","independent","unrelated"]}],"etymology":{"value":"'Inter-' (between, among) + 'company'.  Indicates something occurring or existing between companies.","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈkʌmpəni","syllables":"in-ter-com-pa-ny"},"inflection":{"notes":"This word does not inflect, as it is an adjective."},"usage_notes":{"explanation":"'Intercompany' refers to activities, agreements, or relationships that take place between two or more companies. It is frequently used in the context of financial transactions, legal agreements, and business operations involving related companies, such as parent companies and their subsidiaries. It is important to distinguish it from 'intracompany', which refers to activities within a single company.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intercompany is doing well.","correct":"✓ The intercompany transactions are doing well.","note":"'Intercompany' is an adjective, so it needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The company has intercompany relationships with its employees.","correct":"✓ The company has employee relationships. / ✓ The company has intercompany relationships with its subsidiaries.","note":"'Intercompany' refers to relationships between companies, not between a company and its employees."}],"priority":"★★☆"},"related_words":{"derivatives":["intercompany (noun - rare, referring to something that is intercompany in nature)"],"phrasal_verbs":[],"related_terms":["intracompany (形容詞: 社内の、企業内の)","subsidiary (名詞: 子会社)","parent company (名詞: 親会社)","affiliate (名詞: 関連会社)","consolidation (名詞: 連結)","transfer pricing (名詞: 移転価格)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in business and finance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intercompany' is a specialized term primarily used in business, finance, and accounting contexts. It describes activities, transactions, or relationships that occur between two or more companies, particularly within a corporate group (e.g., between a parent company and its subsidiaries). Understanding this term requires familiarity with basic business concepts and financial reporting practices. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The **intercompany** sales increased significantly this quarter.","translation":"今四半期、会社間の売上が大幅に増加した。","type":"adjective","meaning_category":"会社間の (売上)"},{"sentence":"All **intercompany** debts must be settled before the end of the fiscal year.","translation":"すべての会社間の債務は、会計年度末までに決済されなければならない。","type":"adjective","meaning_category":"会社間の (債務)"},{"sentence":"The audit focused on the **intercompany** transactions to ensure compliance.","translation":"監査は、コンプライアンスを確保するために会社間の取引に焦点を当てた。","type":"adjective","meaning_category":"会社間の (取引)"}]}