{"word":"conscionable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"良心的な、道理にかなった、公正な","english_definition":"guided by or in accordance with conscience; reasonable or acceptable according to moral standards.","examples":[{"sentence":"It is not conscionable to charge such high prices for essential goods during a crisis.","translation":"危機の間、生活必需品にそのような高い価格を請求することは良心的ではありません。"},{"sentence":"A conscionable business will always prioritize ethical practices.","translation":"良心的な企業は常に倫理的な慣行を優先します。"},{"sentence":"He made a conscionable decision, considering all the factors involved.","translation":"彼は関係するすべての要素を考慮して、良心的な決定を下しました。"}],"collocations":["conscionable behavior","conscionable decision","conscionable business practices","not conscionable"],"synonyms":["ethical","moral","principled","just","fair","reasonable","right-minded"],"antonyms":["unconscionable","unethical","immoral","unprincipled","unfair","unjust","wrong"]},{"part_of_speech":"adjective","definition":"良心にかなうと信じられる","english_definition":"that one can, in good conscience, do or allow.","examples":[{"sentence":"It is conscionable for me to support this cause because I believe in its goals.","translation":"私はこの活動の目標を信じているので、良心的にこの活動を支援することができます。"},{"sentence":"The judge found it conscionable to dismiss the case due to lack of evidence.","translation":"裁判官は証拠不足のため、訴訟を棄却することが良心的に可能であると判断しました。"}],"collocations":["find it conscionable","deem it conscionable","consider it conscionable"],"synonyms":["permissible","allowable","justifiable","defensible","acceptable"],"antonyms":["unjustifiable","indefensible","unacceptable"]}],"etymology":{"value":"From Latin 'conscientia' (knowledge within oneself, conscience) + '-able'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnʃənəbəl/","syllables":"con-scion-a-ble"},"inflection":{"notes":"Comparative and superlative forms are 'more conscionable' and 'most conscionable', respectively."},"usage_notes":{"explanation":"'Conscionable' is often used in legal and ethical contexts to describe actions, decisions, or behaviors that are morally acceptable or justifiable. It is the opposite of 'unconscionable', which describes something that is shockingly unfair or unjust. The word implies a sense of moral awareness and adherence to principles of fairness and justice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The conscionable person always gets what they want.","correct":"✓ A conscionable person always tries to do what is right.","note":"'Conscionable' relates to moral correctness, not necessarily achieving personal desires."},{"incorrect":"✗ The contract was conscionable because it was written in clear language.","correct":"✓ The contract was conscionable because it was fair to both parties.","note":"While clarity is important, 'conscionable' primarily refers to fairness and ethical considerations."}],"priority":"★★☆"},"related_words":{"derivatives":["conscience (noun)","conscientious (adjective)","unconscionable (adjective)","unconscionably (adverb)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conscionable' is a relatively formal and uncommon word that means 'guided by conscience' or 'morally acceptable'. It is often used in legal or ethical discussions to describe something that is fair, just, and reasonable according to moral standards. Understanding this word requires a strong grasp of abstract concepts related to morality and ethics."},"example_sentences":[{"sentence":"The company's decision to donate a portion of its profits to charity was considered a conscionable act.","translation":"会社の利益の一部を慈善団体に寄付するという決定は、良心的な行為と見なされました。","type":"adjective","meaning_category":"Ethical/Moral"},{"sentence":"Is it conscionable to ignore the suffering of others when we have the power to help?","translation":"助ける力があるのに、他人の苦しみを無視することは良心的に許されることでしょうか？","type":"adjective","meaning_category":"Ethical/Moral"},{"sentence":"The lawyer argued that the contract was not conscionable due to its unfair terms.","translation":"弁護士は、契約条件が不当であるため、その契約は良心的ではないと主張しました。","type":"adjective","meaning_category":"Fair/Just"}]}