{"word":"stereoselective","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"立体選択的な","english_definition":"(of a chemical reaction) preferentially producing one stereoisomer over others.","examples":[{"sentence":"The reaction is highly stereoselective, yielding almost exclusively the desired isomer.","translation":"その反応は非常に立体選択的であり、ほぼ排他的に望ましい異性体を生じる。"},{"sentence":"Stereoselective synthesis is crucial for the production of many pharmaceuticals.","translation":"立体選択的合成は、多くの医薬品の製造にとって重要である。"}],"collocations":["highly stereoselective","stereoselective synthesis","stereoselective reaction"],"synonyms":["enantioselective","diastereoselective"],"antonyms":["stereospecific","non-stereoselective"]}],"etymology":{"value":"Derived from 'stereo-' (referring to three-dimensional structure) + 'selective' (preferentially choosing one option over others).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstɪəriːəʊsɪˈlɛktɪv/","syllables":"ste-re-o-se-lec-tive"},"inflection":{"adjective_forms":{"comparative":"more stereoselective","superlative":"most stereoselective"}},"usage_notes":{"explanation":"'Stereoselective' describes a chemical reaction that favors the formation of one stereoisomer (molecules with the same connectivity but different spatial arrangement of atoms) over others. It is important in organic chemistry, especially in the synthesis of pharmaceuticals and other fine chemicals where specific stereoisomers are required for activity or to avoid unwanted side effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction was stereo selective.","correct":"✓ The reaction was stereoselective.","note":"The correct spelling is 'stereoselective' (one word)."},{"incorrect":"✗ This reaction is stereospecific, but not stereoselective.","correct":"✓ This reaction is stereoselective, but not stereospecific.","note":"Stereospecificity implies that a specific stereoisomer of the reactant will give a specific stereoisomer of the product. Stereoselectivity only implies a preference for one stereoisomer of the product."}],"priority":"★★☆"},"related_words":{"derivatives":["stereoselectivity (noun)"],"related_terms":["stereoisomer","enantiomer","diastereomer","stereospecific","asymmetric synthesis","chiral"],"priority":"★★☆"},"level_frequency":{"level":"Advanced (Chemistry)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stereoselective' is a term used in chemistry to describe a reaction that produces more of one stereoisomer than others. Stereoisomers are molecules with the same chemical formula and connectivity, but different spatial arrangements of atoms. A stereoselective reaction is useful when you want to create a specific 3D shape of a molecule, which is very important in making drugs and other chemicals."},"example_sentences":[{"sentence":"The enzyme catalyzes a stereoselective reduction of the ketone.","translation":"その酵素は、ケトンの立体選択的な還元を触媒する。","type":"general","meaning_category":"general"},{"sentence":"This new catalyst allows for highly stereoselective olefin polymerization.","translation":"この新しい触媒により、高度に立体選択的なオレフィン重合が可能になる。","type":"specific","meaning_category":"specific"},{"sentence":"The stereoselective nature of the reaction is key to the synthesis of the natural product.","translation":"その反応の立体選択的な性質は、天然物の合成の鍵となる。","type":"general","meaning_category":"general"}]}