{"word":"deviability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"逸脱性、偏倚性、逸脱の可能性、標準からのずれやすさ","english_definition":"The quality or state of being deviable; the capacity or tendency to deviate or diverge from a standard, norm, or expected behavior.","examples":[{"sentence":"The deviability of the experimental results raised concerns about the reliability of the study.","translation":"実験結果の逸脱性が、研究の信頼性に対する懸念を引き起こした。"},{"sentence":"The deviability of the new policy from established procedures caused confusion among employees.","translation":"新しい方針が確立された手順から逸脱したため、従業員の間で混乱が生じた。"},{"sentence":"The deviability of the data points suggested a need for further investigation.","translation":"データ点の逸脱性は、さらなる調査の必要性を示唆していた。"}],"collocations":["high deviability (高い逸脱性)","low deviability (低い逸脱性)","measure of deviability (逸脱性の尺度)","degree of deviability (逸脱の度合い)","assess deviability (逸脱性を評価する)"],"synonyms":["divergence","variation","aberration","nonconformity","irregularity","departure","discrepancy"],"antonyms":["conformity","uniformity","consistency","regularity","predictability"]}],"etymology":{"value":"The word \"deviability\" is derived from \"deviable,\" which comes from \"deviate.\" \"Deviate\" originates from the Latin \"deviare,\" meaning \"to turn aside from the road,\" formed from \"de-\" (from, away) and \"via\" (road, way). The suffix \"-ability\" indicates the capacity or potential to perform the action.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːviəˈbɪləti/","syllables":"de-vi-a-bil-i-ty"},"inflection":{"noun_plural":"deviabilities"},"usage_notes":{"explanation":"\"Deviability\" refers to the extent to which something can deviate or vary from an established norm, standard, or expected behavior. It is often used in scientific, statistical, or technical contexts to describe the tendency of data, results, or processes to diverge from what is considered typical or acceptable. It implies a potential for variation or irregularity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deviability of the results was due to human error.","correct":"✓ The deviation of the results was due to human error.","note":"While \"deviability\" refers to the *potential* to deviate, \"deviation\" refers to the *actual* act or instance of deviating. In this case, since the results have already deviated, \"deviation\" is more appropriate."},{"incorrect":"✗ The deviability is high, so we need to control it.","correct":"✓ The deviability is high, so we need to control the process to reduce it.","note":"\"Deviability\" is an inherent property. You control the process or factors that *cause* the deviation, not the deviability itself."}],"priority":"★★☆"},"related_words":{"derivatives":["deviate (verb)","deviation (noun)","deviant (adjective/noun)","deviable (adjective)"],"phrases":["standard deviation (標準偏差)","statistical deviability (統計的な逸脱性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (専門的な文脈で使われる)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Deviability\" is a relatively uncommon term, primarily used in technical or academic contexts. It describes the degree to which something is likely to diverge from a standard or expected norm. Understanding this word requires familiarity with abstract concepts and technical vocabulary. It's not typically encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The high deviability of the manufacturing process led to inconsistent product quality.","translation":"製造プロセスの高い逸脱性が、製品品質のばらつきにつながった。","type":"general","meaning_category":"逸脱性"},{"sentence":"The statistical model accounts for the deviability of individual data points from the mean.","translation":"その統計モデルは、個々のデータ点が平均から逸脱する可能性を考慮している。","type":"technical","meaning_category":"偏倚性"},{"sentence":"The deviability of the system's behavior under stress was a major concern for the engineers.","translation":"ストレス下でのシステムの動作の逸脱性は、エンジニアにとって大きな懸念事項だった。","type":"technical","meaning_category":"逸脱の可能性"}]}