{"word":"cultivar-specific","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"特定の栽培品種に特有の、栽培品種に依存する","english_definition":"relating to or characteristic of a particular cultivar.","examples":[{"sentence":"The disease resistance is cultivar-specific; some cultivars are highly resistant while others are susceptible.","translation":"その病気への抵抗性は栽培品種に特異的であり、抵抗性の高い栽培品種もあれば、感受性の高い栽培品種もある。"},{"sentence":"Cultivar-specific growing conditions may be required for optimal yield.","translation":"最適な収量を得るためには、栽培品種に特有の栽培条件が必要となる場合がある。"},{"sentence":"The flavor profile of the fruit is cultivar-specific, varying significantly between different varieties.","translation":"果実の風味特性は栽培品種に特有であり、品種によって大きく異なる。"}],"collocations":["cultivar-specific resistance","cultivar-specific traits","cultivar-specific requirements","cultivar-specific management"],"synonyms":["variety-specific","strain-specific","breed-specific"],"antonyms":["general","non-specific","universal"]}],"etymology":{"value":"Derived from 'cultivar' (a plant variety that has been produced in cultivation by selective breeding) and 'specific' (clearly defined or identified).","priority":"medium"},"pronunciation":{"ipa":"/ˈkʌltɪˌvɑːr spəˈsɪfɪk/","syllables":"cul-ti-var spe-ci-fic"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms would be 'more cultivar-specific' and 'most cultivar-specific'."},"usage_notes":{"explanation":"'Cultivar-specific' is used in agricultural, horticultural, and botanical contexts to describe characteristics, requirements, or responses that are unique to a particular cultivar. It emphasizes that generalizations across all plants of a species may not be accurate, and that specific cultivars need to be considered individually.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The fertilizer is specific for all plants.","correct":"The fertilizer is cultivar-specific for tomatoes.","note":"'Specific for all plants' is contradictory to the meaning of 'cultivar-specific', which implies a particular subset of plants."}],"priority":"low"},"related_words":{"derivatives":["cultivar","specific","specificity"],"phrasal_verbs":[],"related_terms":["variety","strain","genotype","phenotype"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'cultivar-specific' is a technical term used in specialized fields such as agriculture and horticulture. It implies a level of understanding of plant breeding and genetics. Therefore, it is more likely to be encountered in academic or professional contexts rather than in general conversation."},"example_sentences":[{"sentence":"The study investigated cultivar-specific responses to drought stress in wheat.","translation":"その研究では、小麦の乾燥ストレスに対する栽培品種特異的な反応を調査した。","type":"general","meaning_category":"general"},{"sentence":"Cultivar-specific nutrient requirements must be considered for optimal growth.","translation":"最適な成長のためには、栽培品種に特有の栄養要求量を考慮する必要がある。","type":"general","meaning_category":"general"},{"sentence":"The fungicide is effective against the disease, but its efficacy is cultivar-specific.","translation":"その殺菌剤はその病気に効果的だが、その有効性は栽培品種に特有である。","type":"general","meaning_category":"general"}]}