{"word":"stipulationism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"（哲学、特に言語哲学において）ある用語や概念に対して、特定の意味を明示的に定めること、またはそのように定められた意味に基づいて議論や理論を展開する立場。","english_definition":"(In philosophy, especially philosophy of language) the practice of explicitly assigning a specific meaning to a term or concept, or the position that arguments and theories should be developed based on such stipulated meanings.","examples":[{"sentence":"The debate hinged on whether the philosopher's definition was a legitimate stipulation or a distortion of the common usage.","translation":"その議論は、哲学者の定義が正当な規定なのか、それとも一般的な用法を歪曲するものなのかにかかっていた。"},{"sentence":"Critics of stipulationism argue that it can lead to arbitrary definitions that are disconnected from real-world phenomena.","translation":"規定主義の批判者たちは、それが現実世界の現象から切り離された恣意的な定義につながる可能性があると主張している。"}],"collocations":["stipulative definition","stipulationist approach","criticism of stipulationism"],"synonyms":["definitionism","conventionalism (related concept)"],"antonyms":[]}],"etymology":{"value":"「stipulation」（規定、明記）+ 「-ism」（主義）に由来。Stipulationは、ラテン語の「stipulari」（正式に約束する）から派生。","priority":"中"},"pronunciation":{"ipa":"/ˌstɪpjʊˈleɪʃənɪzəm/","syllables":"sti-pu-la-tion-ism"},"inflection":{"noun_plural":"stipulationisms"},"usage_notes":{"explanation":"Stipulationismは、議論の明確化や理論構築のために、用語の意味を意図的に定める手法を指します。これは、既存の用法に依存せず、独自の定義を導入することで、曖昧さを避け、特定の理論的枠組みを構築するのに役立ちます。ただし、その定義が恣意的であったり、一般的な理解からかけ離れている場合、批判の対象となることがあります。哲学、法学、数学など、厳密な定義が求められる分野でよく見られます。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"Stipulationism is when you just make up words.","correct":"Stipulationism is when you assign a specific meaning to an existing word or concept for a particular purpose."}],"priority":"低"},"related_words":{"derivatives":["stipulate (動詞: 規定する、明記する)","stipulative (形容詞: 規定的な、明記的な)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"低"},"readability_explanation":{"level":"C1/C2","text":"「stipulationism」は、哲学や言語学で使われる専門用語であり、日常会話ではほとんど使われません。特定の用語や概念に対して、議論のために独自の定義を与えることを指します。この定義は、一般的な用法とは異なる場合があり、議論の範囲を明確にするために用いられます。この単語を理解するには、哲学的な議論における定義の重要性や、言葉の曖昧さを避ける必要性を理解している必要があります。"},"example_sentences":[{"sentence":"By employing stipulationism, the researcher aimed to create a precise framework for analyzing the data.","translation":"規定主義を採用することで、研究者はデータを分析するための正確な枠組みを作ることを目指した。","type":"noun","meaning_category":"定義を定める立場"},{"sentence":"The philosopher defended his use of stipulationism by arguing that it was necessary to avoid ambiguity in the discussion of complex concepts.","translation":"その哲学者は、複雑な概念の議論における曖昧さを避けるために必要であると主張し、規定主義の使用を擁護した。","type":"noun","meaning_category":"定義を定める立場"}]}