{"word":"commark","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A mark or symbol indicating common ownership or usage, especially in historical contexts.","english_definition":"A mark or symbol indicating common ownership or usage, especially in historical contexts.","examples":[{"sentence":"The cattle were branded with the commark of the village.","translation":"その牛は村の共有を示す印であるcommarkで焼印が押された。"},{"sentence":"Historical documents mention the use of a commark on shared tools.","translation":"歴史的な文書には、共有の道具にcommarkが使われていたことが記されている。"}],"collocations":["village commark","common commark","brand with a commark"],"synonyms":["common mark","ownership mark","brand","symbol"],"antonyms":[]}],"etymology":{"value":"Likely a combination of 'common' and 'mark'. The term is relatively rare and its etymology is not definitively established in major dictionaries.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒmɑːrk/","syllables":"com-mark"},"inflection":{"noun_plural":"commarks"},"usage_notes":{"explanation":"The term 'commark' is not widely used in modern English. It primarily appears in historical or specialized contexts related to land ownership, common rights, or branding practices. It signifies a mark that identifies something as belonging to a community or group rather than an individual.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He put a commark on his personal property.","correct":"✓ He put a mark on his personal property.","note":"'Commark' implies shared ownership, so it's not typically used for individual property."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["common land","branding","ownership","symbolism"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Commark' is a rare term, primarily encountered in historical or legal contexts. Understanding its meaning requires familiarity with concepts of common land ownership and historical branding practices. Due to its limited usage, it is not part of standard English vocabulary."},"example_sentences":[{"sentence":"The ancient village used a specific commark to identify its livestock.","translation":"古代の村は、家畜を識別するために特定のcommarkを使用した。","type":"noun","meaning_category":"shared ownership mark"},{"sentence":"Researchers studied the commarks found on medieval tools to understand communal practices.","translation":"研究者たちは、中世の道具に見られるcommarkを研究して、共同体の慣習を理解しようとした。","type":"noun","meaning_category":"shared usage symbol"}]}