{"word":"axon","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"軸索 (じくさく): 神経細胞 (ニューロン) から伸びる細長い突起で、他の神経細胞、筋肉、または腺に電気信号を伝達する。","english_definition":"The long, slender projection of a nerve cell, or neuron, that conducts electrical impulses away from the neuron's cell body to other neurons, muscles, or glands.","examples":[{"sentence":"The axon of a motor neuron can be very long, reaching from the spinal cord to a muscle in the leg.","translation":"運動ニューロンの軸索は非常に長く、脊髄から脚の筋肉まで達することがある。"},{"sentence":"Myelin sheaths insulate axons and speed up the transmission of nerve impulses.","translation":"ミエリン鞘は軸索を絶縁し、神経インパルスの伝達速度を速める。"},{"sentence":"Damage to axons can lead to neurological disorders.","translation":"軸索の損傷は神経疾患につながる可能性がある。"}],"collocations":["axon terminal (軸索終末)","myelinated axon (有髄軸索)","unmyelinated axon (無髄軸索)","axon guidance (軸索誘導)","axon regeneration (軸索再生)"],"synonyms":["nerve fiber","neurite"],"antonyms":["dendrite (樹状突起)"]}],"etymology":{"value":"Derived from the Greek word 'axon' (ἄξων), meaning 'axis'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæksɒn/","syllables":"ax-on"},"inflection":{"noun_plural":"axons"},"usage_notes":{"explanation":"An axon is a single, long, slender projection from a neuron. Its primary function is to transmit electrical signals called action potentials to other cells. Axons can be myelinated (covered in myelin, a fatty substance that insulates the axon and speeds up signal transmission) or unmyelinated. The axon originates from the cell body at a region called the axon hillock and terminates at axon terminals, where it forms synapses with other cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dendrite carries signals away from the cell body, while the axon receives them.","correct":"✓ The axon carries signals away from the cell body, while the dendrite receives them.","note":"Axons transmit signals away from the cell body, while dendrites receive signals."}],"priority":"★★☆"},"related_words":{"derivatives":["axonal (形容詞: 軸索の)","axonopathy (名詞: 軸索障害)"],"related_terms":["neuron (ニューロン)","synapse (シナプス)","myelin (ミエリン)","nerve (神経)","neurotransmitter (神経伝達物質)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'axon' is a specialized term in biology, specifically in the field of neuroscience. It refers to the long, slender projection of a nerve cell (neuron) that conducts electrical impulses. Understanding the function of axons is crucial for comprehending how the nervous system transmits information. The term is primarily encountered in scientific literature, textbooks, and discussions related to neurology, physiology, and related disciplines."},"example_sentences":[{"sentence":"The **axon** transmits electrical signals to other neurons.","translation":"軸索は電気信号を他のニューロンに伝達する。","type":"noun","meaning_category":"physiology"},{"sentence":"The speed of nerve impulse transmission is increased by the myelin sheath surrounding the **axon**.","translation":"神経インパルスの伝達速度は、軸索を囲むミエリン鞘によって増加する。","type":"noun","meaning_category":"physiology"},{"sentence":"Axonal damage can result in various neurological disorders.","translation":"軸索の損傷は、さまざまな神経疾患を引き起こす可能性がある。","type":"noun","meaning_category":"medicine"}]}