{"word":"Sturniform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having the shape or characteristics of a starling (birds of the family Sturnidae).","english_definition":"Resembling or pertaining to starlings.","examples":[{"sentence":"The bird's flight pattern was sturniform, reminiscent of a starling's swift movements.","translation":"その鳥の飛行パターンはムクドリのようで、ムクドリの素早い動きを彷彿とさせた。"},{"sentence":"The avian species exhibited sturniform characteristics in its foraging behavior.","translation":"その鳥類は採餌行動においてムクドリのような特徴を示した。"}],"collocations":["sturniform flight","sturniform behavior","sturniform appearance"],"synonyms":["sturnoid","starling-like"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'Sturnus' (starling) + '-form' (having the form of).","priority":"★★☆"},"pronunciation":{"ipa":"/stɜːrˈnɪfɔːrm/","syllables":"stur-ni-form"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative/superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"'Sturniform' is a relatively uncommon term primarily used in ornithology or zoology to describe features that resemble those of starlings. It is most frequently used to describe flight patterns, behaviors, or physical characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sturniform bird was actually a sparrow.","correct":"✓ The bird, although resembling a starling, was actually a sparrow.","note":"'Sturniform' describes resemblance, not actual classification. If the bird is a sparrow, it's not 'sturniform'; rather, it *resembles* a starling."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sturnus (genus of starlings)","Sturnidae (family of starlings)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sturniform' is a specialized term, primarily used in scientific contexts, particularly ornithology. Understanding requires familiarity with the characteristics of starlings and the use of '-form' as a suffix indicating resemblance. Due to its limited use, it's considered advanced vocabulary."},"example_sentences":[{"sentence":"The flock displayed a striking sturniform pattern as they wheeled through the sky.","translation":"その群れは空を旋回する際に、印象的なムクドリ型のパターンを示した。","type":"adjective","meaning_category":"resembling a starling"},{"sentence":"The biologist noted the sturniform feeding habits of the introduced species.","translation":"生物学者は、導入された種のムクドリのような摂食習慣に注目した。","type":"adjective","meaning_category":"resembling a starling"}]}