{"word":"retinoscopist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"検影者、レチノスコープ検査技師","english_definition":"An eye care professional who performs retinoscopy to objectively determine the refractive error of the eye and determine the need for corrective lenses.","examples":[{"sentence":"The retinoscopist used a retinoscope to measure the patient's refractive error.","translation":"検影者はレチノスコープを使って患者の屈折異常を測定した。"},{"sentence":"A skilled retinoscopist can accurately prescribe glasses for children.","translation":"熟練した検影者は子供のために正確に眼鏡を処方することができる。"}],"collocations":["perform retinoscopy","measure refractive error","prescribe glasses"],"synonyms":["optometrist","ophthalmologist","eye doctor"],"antonyms":[]}],"etymology":{"value":"The word \"retinoscopist\" is derived from \"retinoscope\" (an instrument used to examine the retina) and the suffix \"-ist\" (denoting a person who practices or is skilled in something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛtɪˈnɒskəpɪst/","syllables":"re-ti-nos-co-pist"},"inflection":{"noun_plural":"retinoscopists"},"usage_notes":{"explanation":"A retinoscopist is a specialized eye care professional who uses a retinoscope, a handheld instrument that projects a beam of light into the eye, to assess the eye's refractive error (e.g., nearsightedness, farsightedness, astigmatism). This objective measurement helps determine the appropriate lens prescription for glasses or contact lenses. Retinoscopy is particularly useful for examining infants, young children, and individuals who may have difficulty with subjective refraction tests (e.g., responding to questions about lens preferences).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The retinoscopist did a retina scan.","correct":"✓ The retinoscopist performed retinoscopy.","note":"Retinoscopy is the procedure, not a retina scan. A retina scan is a different type of eye exam."},{"incorrect":"✗ A retinoscopist is the same as an optician.","correct":"✓ A retinoscopist is a type of eye care professional who may work with opticians.","note":"An optician primarily fits and dispenses eyeglasses and contact lenses based on prescriptions from optometrists or ophthalmologists/retinoscopists. A retinoscopist performs eye exams."}],"priority":"★★☆"},"related_words":{"derivatives":["retinoscope (noun: instrument used for retinoscopy)","retinoscopy (noun: the procedure performed by a retinoscopist)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - a specialized term used within the field of eye care.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"retinoscopist\" refers to a specialized eye care professional who uses a retinoscope to objectively measure the refractive error of the eye. This is a technical term primarily used within the optometry and ophthalmology fields. Understanding this term requires familiarity with eye care procedures and equipment."},"example_sentences":[{"sentence":"The experienced retinoscopist quickly identified the child's astigmatism.","translation":"経験豊富な検影者は、子供の乱視をすぐに特定しました。","type":"noun","meaning_category":"eye care professional"},{"sentence":"During the eye exam, the retinoscopist explained the retinoscopy procedure to the patient.","translation":"眼科検査中、検影者は患者に検影法の手順を説明しました。","type":"noun","meaning_category":"eye care professional"}]}