{"word":"proud-glancing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"得意げな視線を送る、誇らしげな目つきをする","english_definition":"Looking or glancing in a proud or self-satisfied manner.","examples":[{"sentence":"The athlete gave a proud-glancing look to the audience after winning the race.","translation":"その選手はレースに勝利した後、観客に得意げな視線を送った。"},{"sentence":"With a proud-glancing gaze, she admired her reflection in the mirror.","translation":"彼女は誇らしげな目つきで鏡の中の自分の姿に見惚れた。"}],"collocations":["proud-glancing gaze","proud-glancing look","proud-glancing expression"],"synonyms":["self-satisfied","smug","arrogant","conceited"],"antonyms":["humble","modest","self-effacing"]}],"etymology":{"value":"Compound word formed by combining 'proud' (feeling deep pleasure or satisfaction as a result of one's own achievements, qualities, or possessions or those of someone with whom one is closely associated) and 'glancing' (taking a brief or hurried look).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraʊd ˈɡlænsɪŋ/","syllables":"proud-glanc-ing"},"inflection":{"notes":"Adjective, does not have plural forms."},"usage_notes":{"explanation":"'Proud-glancing' describes someone who looks at something or someone with a sense of pride or self-satisfaction. It implies a brief or quick look that conveys this feeling. It is often used to describe a facial expression or gaze.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was proud-glancing of his trophy.","correct":"✓ He gave a proud-glancing look at his trophy.","note":"'Proud-glancing' is an adjective describing the look or gaze, not a feeling directed towards something. Use it to describe the manner of looking, not as a direct complement to 'proud'."}],"priority":"★★☆"},"related_words":{"derivatives":["proud (adjective)","glancing (verb)","proudly (adverb)","glance (noun/verb)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proud-glancing' is a descriptive adjective used to convey a sense of pride or self-satisfaction in someone's gaze or look. It's not a common word, so it's more likely to be found in descriptive writing to add nuance to a character's expression. It combines the feeling of pride with a quick or brief look."},"example_sentences":[{"sentence":"The winner cast a proud-glancing look at his defeated opponent.","translation":"勝者は打ち負かした相手に得意げな視線を送った。","type":"adjective","meaning_category":"得意げな視線を送る"},{"sentence":"Her proud-glancing expression revealed her confidence in her abilities.","translation":"彼女の誇らしげな表情は、自分の能力に対する自信を表していた。","type":"adjective","meaning_category":"誇らしげな目つきをする"}]}