{"word":"Peptone","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ペプトン：タンパク質が酵素、酸、またはアルカリによって加水分解された混合物。細菌培養培地や栄養剤として使用される。","english_definition":"A mixture of peptides and amino acids formed by the partial hydrolysis of protein, used as a nutrient medium for growing bacteria and fungi.","examples":[{"sentence":"Peptone is a common ingredient in microbiological culture media.","translation":"ペプトンは微生物培養培地によく使われる成分です。"},{"sentence":"The growth of the bacteria was enhanced by the addition of peptone to the broth.","translation":"その細菌の増殖は、ブロスにペプトンを加えることで促進されました。"}],"collocations":["peptone broth","peptone water","bacteriological peptone","enzymatic peptone"],"synonyms":["protein hydrolysate","hydrolyzed protein"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'peptos' meaning 'digested'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeptaʊn/","syllables":"pep-tone"},"inflection":{"noun_plural":"peptones"},"usage_notes":{"explanation":"Peptone is a complex mixture, so its exact composition varies depending on the source protein and the method of hydrolysis. It provides a source of amino acids, peptides, and other nutrients needed for microbial growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added a peptone in the agar.","correct":"✓ I added peptone to the agar.","note":"Peptone is typically used as a mass noun in this context, so the article 'a' is not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["peptic","peptide","proteose"],"related_terms":["agar","broth","culture medium","hydrolysis"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peptone' is a technical term primarily used in microbiology and biochemistry. Understanding its meaning requires familiarity with these fields. The term refers to a complex mixture of peptides and amino acids obtained from protein hydrolysis, serving as a nutrient source for microorganisms in culture media."},"example_sentences":[{"sentence":"The scientist prepared a peptone solution for the bacterial culture.","translation":"科学者は細菌培養のためにペプトン溶液を準備しました。","type":"general","meaning_category":"ペプトン溶液の調製"},{"sentence":"Different types of peptone can influence the growth rate of microorganisms.","translation":"ペプトンの種類が異なると、微生物の増殖速度に影響を与える可能性があります。","type":"scientific","meaning_category":"微生物の増殖への影響"}]}