{"word":"unnephritic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)腎臓炎を患っていない、または腎臓炎に関連しない","english_definition":"Not affected by or relating to nephritis (inflammation of the kidneys).","examples":[{"sentence":"The patient's condition was described as unnephritic, indicating the absence of kidney inflammation.","translation":"患者の状態は非腎炎性であると記述され、腎臓の炎症がないことを示していました。"},{"sentence":"Unnephritic proteinuria is a condition where protein is found in the urine, but it is not caused by kidney inflammation.","translation":"非腎炎性蛋白尿は、尿中にタンパク質が見られる状態ですが、腎臓の炎症が原因ではありません。"}],"collocations":["unnephritic proteinuria","unnephritic syndrome"],"synonyms":["non-nephritic"],"antonyms":["nephritic"]}],"etymology":{"value":"'Un-' (not) + 'nephritic' (relating to nephritis). Nephritic comes from 'nephritis', which is from 'nephro-' (kidney) + '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌn.nɪˈfrɪtɪk/","syllables":"un-ne-phri-tic"},"inflection":{"notes":"Adjective, comparative and superlative forms are possible (more unnephritic, most unnephritic) but not commonly used."},"usage_notes":{"explanation":"'Unnephritic' is a medical term primarily used to describe conditions or symptoms that are not associated with kidney inflammation (nephritis). It's often used in differential diagnosis to distinguish between kidney-related issues caused by inflammation and those caused by other factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has unnephritic kidneys.","correct":"✓ The patient has no signs of nephritis.","note":"'Unnephritic' describes a state or condition, not the organ itself. It's better to say the patient doesn't have nephritis, or that the kidneys show no signs of inflammation."}],"priority":"★★☆"},"related_words":{"derivatives":["nephritis","nephro-","nephrology","nephrologist"],"phrases":["unnephritic syndrome","unnephritic proteinuria"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unnephritic' is a specialized medical term indicating the absence of kidney inflammation (nephritis). It's used by healthcare professionals to describe conditions or symptoms not directly caused by nephritis, often in the context of differential diagnosis. Understanding this term requires a background in medical terminology and kidney-related diseases."},"example_sentences":[{"sentence":"The differential diagnosis included both nephritic and unnephritic causes of hematuria.","translation":"鑑別診断には、血尿の腎炎性および非腎炎性の原因の両方が含まれていました。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"The patient presented with unnephritic proteinuria, requiring further investigation to determine the underlying cause.","translation":"患者は非腎炎性蛋白尿を呈し、根本的な原因を特定するためにさらなる調査が必要でした。","type":"adjective","meaning_category":"Medical Condition"}]}