{"word":"bashawdom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) バシャ（高官）の地位、権力、領地","english_definition":"The office, authority, or territory of a bashaw (a high-ranking Ottoman official).","examples":[{"sentence":"The corrupt bashawdom was overthrown by a popular revolt.","translation":"腐敗したバシャの支配は民衆の反乱によって打倒された。"},{"sentence":"He ruled his bashawdom with an iron fist.","translation":"彼は鉄拳で自分の領地を支配した。"}],"collocations":["corrupt bashawdom","overthrow a bashawdom","rule a bashawdom"],"synonyms":["pashalik","pashadom"],"antonyms":[]}],"etymology":{"value":"From 'bashaw' (an archaic term for pasha) + '-dom' (suffix denoting domain, rank, or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/bəˈʃɔːdəm/","syllables":"ba-shaw-dom"},"inflection":{"noun_plural":"bashawdoms"},"usage_notes":{"explanation":"'Bashawdom' is a somewhat archaic term, primarily used in historical contexts to refer to the dominion or authority of a bashaw. A bashaw was a high-ranking official in the Ottoman Empire, similar to a pasha. The term is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived in a bashawdom style.","correct":"✓ He lived in a style befitting a bashaw.","note":"'Bashawdom' refers to the office or territory, not a style of living. Use 'in a style befitting a bashaw' or similar phrasing to describe a luxurious or autocratic lifestyle."}],"priority":"★☆☆"},"related_words":{"derivatives":["bashaw (noun: an archaic term for pasha)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bashawdom' is a rare and specialized term primarily encountered in historical texts concerning the Ottoman Empire. It denotes the rank, authority, or territory governed by a bashaw (an archaic term for pasha, a high-ranking official). Understanding this word requires familiarity with Ottoman history and archaic English vocabulary. Its use is limited to scholarly or historical contexts."},"example_sentences":[{"sentence":"The memoirs described the opulence and corruption within the bashawdom.","translation":"回顧録は、バシャの領地内の贅沢と腐敗について記述していた。","type":"noun","meaning_category":"領地・権力"},{"sentence":"The local population resented the heavy taxation imposed by the bashawdom.","translation":"地元の住民は、バシャの支配によって課された重税を恨んでいた。","type":"noun","meaning_category":"領地・権力"}]}