{"word":"micrograph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"顕微鏡写真、マイクログラフ","english_definition":"A photograph or digital image taken through a microscope or similar instrument to show a magnified image of an object or substance.","examples":[{"sentence":"The scientist examined the micrograph of the cell sample.","translation":"科学者は細胞サンプルの顕微鏡写真を調べた。"},{"sentence":"The textbook included several micrographs to illustrate the different types of tissues.","translation":"その教科書には、さまざまな種類の組織を説明するために、いくつかの顕微鏡写真が含まれていた。"},{"sentence":"The micrograph revealed the presence of bacteria in the water sample.","translation":"その顕微鏡写真は、水サンプル中の細菌の存在を明らかにした。"}],"collocations":["electron micrograph (電子顕微鏡写真)","optical micrograph (光学顕微鏡写真)","scanning electron micrograph (走査型電子顕微鏡写真)","transmission electron micrograph (透過型電子顕微鏡写真)","take a micrograph (顕微鏡写真を撮る)","examine a micrograph (顕微鏡写真を調べる)","analyze a micrograph (顕微鏡写真を分析する)"],"synonyms":["photomicrograph","microscopic image"],"antonyms":[],"related_terms":["microscopy","microscope","magnification","image analysis"]}],"etymology":{"value":"Formed from 'micro-' (small) + '-graph' (something written or drawn). Essentially, it's a 'small writing/drawing' that is made visible through magnification.","priority":"★★★"},"pronunciation":{"ipa":"ˈmaɪkrəˌɡræf","syllables":"mi-cro-graph"},"inflection":{"noun_plural":"micrographs"},"usage_notes":{"explanation":"A micrograph is a visual representation of something that is too small to be seen with the naked eye. It's a crucial tool in various scientific fields, including biology, materials science, and medicine. The type of microscope used (e.g., optical, electron) will determine the resolution and magnification of the micrograph.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The micrograph was taken with a telescope.","correct":"✓ The micrograph was taken with a microscope.","note":"Micrographs are taken with microscopes, not telescopes (which are for viewing distant objects)."},{"incorrect":"✗ I saw a macrograph of the cell.","correct":"✓ I saw a micrograph of the cell.","note":"'Macrograph' refers to images of objects that are slightly magnified but still visible to the naked eye. 'Micrograph' is specifically for images taken with a microscope."}],"priority":"★★☆"},"related_words":{"derivatives":["micrographic"],"related_terms":["microscopy","microscope","photomicrography"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'micrograph' refers to a photograph or digital image obtained through a microscope. It's a technical term primarily used in scientific and technical contexts. Understanding this word requires familiarity with basic scientific concepts such as microscopy and magnification. It's not typically encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The electron micrograph clearly showed the structure of the virus.","translation":"その電子顕微鏡写真は、ウイルスの構造を明確に示していた。","type":"example","meaning_category":"顕微鏡写真"},{"sentence":"Analyzing the micrographs helped the researchers understand the material's properties.","translation":"顕微鏡写真を分析することで、研究者たちはその材料の特性を理解することができた。","type":"example","meaning_category":"顕微鏡写真"},{"sentence":"The journal published a series of micrographs illustrating the different stages of cell division.","translation":"その学術誌は、細胞分裂のさまざまな段階を示す一連の顕微鏡写真を掲載した。","type":"example","meaning_category":"顕微鏡写真"}]}