{"word":"Hyperanakinesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An excessive or exaggerated movement or activity.","english_definition":"Excessive or exaggerated movement or activity; exaggerated motor activity.","examples":[{"sentence":"The patient exhibited hyperanakinesis, constantly pacing and fidgeting.","translation":"その患者は過剰な運動を示し、常に歩き回ったり、そわそわしていた。"},{"sentence":"Hyperanakinesis can be a symptom of certain neurological disorders.","translation":"過剰な運動は、特定の神経学的疾患の症状である可能性がある。"}],"collocations":["exhibit hyperanakinesis","symptom of hyperanakinesis","neurological hyperanakinesis"],"synonyms":["hyperactivity","exaggerated movement","excessive motor activity","fidgeting","restlessness"],"antonyms":["hypoactivity","akinesia","reduced movement"]}],"etymology":{"value":"The word is formed from the Greek prefixes and root words: 'hyper-' (excessive), 'ana-' (again, anew), and 'kinesis' (movement).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˌænəkɪˈniːsɪs/","syllables":"hy-per-an-a-ki-ne-sis"},"inflection":{"noun_plural":"hyperanakineses"},"usage_notes":{"explanation":"'Hyperanakinesis' is a relatively rare term, primarily used in medical and psychological contexts to describe abnormally increased motor activity. It is often associated with conditions such as ADHD, mania, or certain types of brain damage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child's hyperanakinesis was due to eating too much sugar.","correct":"✓ The child's hyperactivity was possibly due to eating too much sugar.","note":"While sugar intake can influence activity levels, 'hyperanakinesis' is a more specific, clinical term that implies a pathological level of increased motor activity, not just normal childhood energy."}],"priority":"★☆☆"},"related_words":{"derivatives":["hyperkinetic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hyperanakinesis' is a highly specialized term predominantly found in medical or psychological literature. Understanding requires familiarity with medical terminology and an ability to comprehend complex descriptions of behavioral symptoms. Due to its rarity and technical nature, it is not suitable for general use."},"example_sentences":[{"sentence":"The neurologist noted the patient's hyperanakinesis during the examination.","translation":"神経科医は診察中に患者の過剰な運動に注目した。","type":"general","meaning_category":"medical"},{"sentence":"Drug-induced hyperanakinesis was observed in the animal model.","translation":"薬物誘発性の過剰な運動が動物モデルで観察された。","type":"scientific","meaning_category":"research"}]}