{"word":"reillustrated","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(本、記事などを)再びイラストで飾る、新たにイラストを付ける","english_definition":"to illustrate (a book, article, etc.) again or anew.","examples":[{"sentence":"The publisher decided to have the children's book reillustrated with more modern artwork.","translation":"出版社は、その児童書をより現代的なアートワークで再イラスト化することを決定した。"},{"sentence":"The classic novel was reillustrated for a new edition.","translation":"その古典小説は、新版のために新たにイラストが付けられた。"}],"collocations":["reillustrated edition","reillustrated version"],"synonyms":["redraw","re-image","re-design"],"antonyms":["deillustrate","unillustrate"]}],"etymology":{"value":"The word is formed by adding the prefix \"re-\" (meaning again or anew) to the past participle of \"illustrate\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɪləstreɪtɪd/","syllables":"re-il-lus-trat-ed"},"inflection":{"verb_forms":{"present_simple":["reillustrate","reillustrates"],"past_simple":"reillustrated","past_participle":"reillustrated","present_participle":"reillustrating"}},"usage_notes":{"explanation":"\"Reillustrated\" implies that the original work already had illustrations, and the process involves creating new or updated illustrations. It's often done to modernize the look of a book, appeal to a new audience, or correct perceived deficiencies in the original illustrations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was re-illustrating.","correct":"✓ The book was reillustrated.","note":"Make sure to use the correct past participle form, which is 'reillustrated'."}],"priority":"★☆☆"},"related_words":{"derivatives":["reillustrate (verb)","illustration (noun)","illustrate (verb)","illustrator (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Reillustrated\" is a relatively uncommon word that means to provide a new set of illustrations for something, usually a book. It implies that the original work already had illustrations, but they are being replaced for some reason, such as to update the style or appeal to a new audience. The word is formed by adding the prefix \"re-\" to \"illustrated,\" which makes its meaning relatively transparent. However, its infrequent use makes it more suitable for advanced learners."},"example_sentences":[{"sentence":"The children's story was beautifully reillustrated with watercolor paintings.","translation":"その子供向け物語は、水彩画で美しく再イラスト化された。","type":"verb","meaning_category":"illustration"},{"sentence":"The publisher decided to have the novel reillustrated to attract a younger readership.","translation":"出版社は、より若い読者層を引き付けるために、その小説を再イラスト化することを決定した。","type":"verb","meaning_category":"illustration"}]}