{"word":"Jatoba","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ジャトバ（マメ科の広葉樹、およびその木材）","english_definition":"A tropical hardwood tree of the legume family (Hymenaea courbaril), native to the Americas, or its reddish-brown wood.","examples":[{"sentence":"Jatoba is a popular choice for flooring due to its hardness and durability.","translation":"ジャトバはその硬さと耐久性から、フローリング材として人気があります。"},{"sentence":"The table was made of solid jatoba wood.","translation":"そのテーブルは無垢のジャトバ材で作られていました。"}],"collocations":["jatoba flooring (ジャトバのフローリング)","jatoba wood (ジャトバの木材)","jatoba tree (ジャトバの木)"],"synonyms":["Brazilian cherry","courbaril"],"antonyms":[]}],"etymology":{"value":"Tupi language (Brazilian indigenous language)","priority":"★★☆"},"pronunciation":{"ipa":"/ʒəˈtoʊbə/","syllables":"ja-to-ba"},"inflection":{"noun_plural":"jatobas"},"usage_notes":{"explanation":"Jatoba is valued for its strength, hardness, and resistance to decay, making it suitable for various applications, including flooring, furniture, and construction. It is also known as Brazilian cherry due to its reddish-brown color that resembles cherry wood.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a furniture made of jatobas.","correct":"✓ I bought a piece of furniture made of jatoba.","note":"Jatoba is usually used as an uncountable noun when referring to the wood itself. When referring to multiple trees, 'jatobas' can be used."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Jatoba is a specialized term referring to a specific type of tropical hardwood. Understanding its properties and uses requires some knowledge of woodworking or construction materials. The word is not commonly encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The **jatoba** tree can grow to a height of 30 meters.","translation":"ジャトバの木は高さ30メートルまで成長することがあります。","type":"noun","meaning_category":"植物"},{"sentence":"We chose **jatoba** flooring for its rich color and durability.","translation":"私たちはその豊かな色と耐久性から、ジャトバのフローリングを選びました。","type":"noun","meaning_category":"木材"}]}