{"word":"transcalescency","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"変態点、変質点 (特に鋼の加熱・冷却時における温度変化)","english_definition":"The phenomenon of a change in the rate of temperature change of a substance at a critical temperature during heating or cooling, especially in steel.","examples":[{"sentence":"The transcalescency point of this steel alloy is crucial for its heat treatment process.","translation":"この鋼合金の変態点は、その熱処理プロセスにとって非常に重要です。"}],"collocations":["transcalescency point","critical temperature","phase transition"],"synonyms":["critical point","transformation temperature","phase transition temperature"],"antonyms":[]}],"etymology":{"value":"Derived from 'trans-' (across, beyond), 'calescence' (increasing in heat), and '-ency' (state, quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtrænskæləˈsɛnsi/","syllables":"trans-ca-les-cen-cy"},"inflection":{"noun_plural":"transcalescencies"},"usage_notes":{"explanation":"'Transcalescency' is a term mainly used in materials science and metallurgy, specifically when discussing the thermal behavior of metals, especially steel, during heating or cooling processes. It refers to the point at which a change in the crystal structure occurs, leading to a change in the rate of temperature change.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["transcalescent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Transcalescency' is a highly specialized term primarily used in the fields of metallurgy and materials science. It describes a specific phenomenon observed during the heating or cooling of metals, particularly steel, where the rate of temperature change alters due to a phase transition. Understanding this term requires a background in these scientific disciplines."},"example_sentences":[{"sentence":"The observation of transcalescency helped determine the optimal quenching temperature.","translation":"変態点の観察は、最適な焼入れ温度を決定するのに役立ちました。","type":"scientific","meaning_category":"metallurgy"},{"sentence":"The transcalescency point is a critical parameter in the design of heat treatment processes.","translation":"変態点は、熱処理プロセスの設計における重要なパラメータです。","type":"engineering","meaning_category":"materials science"}]}