{"word":"globalizing","priority":"★★☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"グローバル化する、世界規模にする","english_definition":"The present participle of the verb 'globalize', meaning to extend to other or all parts of the world; to make worldwide in scope or application.","examples":[{"sentence":"The company is globalizing its operations by opening branches in Asia.","translation":"その会社はアジアに支店を開設することで事業をグローバル化している。"},{"sentence":"Globalizing education requires adapting curricula to diverse cultural contexts.","translation":"教育をグローバル化するには、多様な文化的背景に合わせてカリキュラムを適応させる必要がある。"},{"sentence":"They are globalizing their brand through international marketing campaigns.","translation":"彼らは国際的なマーケティングキャンペーンを通じてブランドをグローバル化している。"}],"collocations":["globalizing operations (事業をグローバル化する)","globalizing markets (市場をグローバル化する)","globalizing education (教育をグローバル化する)","globalizing trade (貿易をグローバル化する)","globalizing culture (文化をグローバル化する)"],"synonyms":["internationalizing","universalizing","worldwide","transnationalizing"],"antonyms":["localizing","nationalizing","regionalizing"]}],"etymology":{"value":"The term 'globalizing' is derived from the verb 'globalize', which emerged in the mid-20th century. It combines 'global' (from Latin 'globus', meaning sphere or globe) with the suffix '-ize', indicating a process of making something global.","priority":"★★★"},"pronunciation":{"ipa":"ˈɡloʊbəˌlaɪzɪŋ","syllables":"glo-bal-iz-ing"},"inflection":{"verb_forms":{"present_simple":["globalize","globalizes"],"past_simple":"globalized","past_participle":"globalized","present_participle":"globalizing"}},"usage_notes":{"explanation":"'Globalizing' refers to the ongoing process of making something worldwide in scope or application. It is often used in the context of business, economics, culture, and politics. The term implies increasing interconnectedness and interdependence among nations and people. It's important to note that globalization can have both positive and negative consequences, including economic growth, cultural exchange, and increased competition, as well as environmental degradation and cultural homogenization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The globalizing is important for the economy.","correct":"✓ Globalization is important for the economy.","note":"'Globalizing' is the present participle of the verb 'globalize'. When referring to the general process, use the noun 'globalization'."},{"incorrect":"✗ They are globalizing the local culture.","correct":"✓ They are adapting the local culture to global trends.","note":"While 'globalizing' can sometimes imply adapting to global trends, it's important to consider the potential negative impact on local cultures. Use more nuanced language to describe the process of cultural adaptation."}],"priority":"★★☆"},"related_words":{"derivatives":["globalize (verb)","globalization (noun)","global (adjective)","globally (adverb)","globalist (noun)","anti-globalization (noun)"],"related_concepts":["international trade","multinational corporations","cultural exchange","economic integration","political interdependence"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in academic and business contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Globalizing' is a term used to describe the process of making something worldwide in scope or application. It is often used in the context of business, economics, culture, and politics. The term implies increasing interconnectedness and interdependence among nations and people. Understanding this term requires familiarity with complex concepts related to international relations and economics."},"example_sentences":[{"sentence":"The company is **globalizing** its supply chain to reduce costs.","translation":"その会社はコスト削減のためにサプライチェーンをグローバル化している。","type":"verb (present participle)","meaning_category":"事業・経済"},{"sentence":"**Globalizing** the curriculum can help students develop a broader worldview.","translation":"カリキュラムをグローバル化することで、学生はより広い世界観を養うことができる。","type":"verb (present participle)","meaning_category":"教育・文化"},{"sentence":"They are **globalizing** their marketing strategy to reach new customers.","translation":"彼らは新しい顧客にリーチするためにマーケティング戦略をグローバル化している。","type":"verb (present participle)","meaning_category":"マーケティング"}]}