{"word":"dextroamphetamine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"デキストロアンフェタミン（中枢神経刺激薬、注意欠陥・多動性障害(ADHD)やナルコレプシーの治療に用いられる）","english_definition":"A central nervous system stimulant used in the treatment of attention deficit hyperactivity disorder (ADHD) and narcolepsy.","examples":[{"sentence":"Dextroamphetamine can help improve focus and attention in individuals with ADHD.","translation":"デキストロアンフェタミンは、ADHDを持つ人の集中力と注意力を改善するのに役立ちます。"},{"sentence":"The doctor prescribed dextroamphetamine to manage the patient's narcolepsy symptoms.","translation":"医師は、患者のナルコレプシーの症状を管理するためにデキストロアンフェタミンを処方した。"}],"collocations":["dextroamphetamine sulfate","dextroamphetamine side effects","dextroamphetamine dosage","dextroamphetamine medication"],"synonyms":["amphetamine","stimulant"],"antonyms":["depressant"]}],"etymology":{"value":"Derived from 'dextro-' (referring to the dextrorotatory isomer) + 'amphetamine' (a synthetic stimulant).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛkstroʊæmˈfɛtəmiːn/","syllables":"dex-tro-am-phe-ta-mine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dextroamphetamine is a potent stimulant and should only be used under the strict supervision of a healthcare professional. It is a controlled substance due to its potential for misuse and dependence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take dextroamphetamine for my anxiety.","correct":"✓ I take dextroamphetamine for my ADHD.","note":"Dextroamphetamine is primarily prescribed for ADHD and narcolepsy, not anxiety. Consult a doctor for appropriate treatment for anxiety."},{"incorrect":"✗ Dextroamphetamine is safe for everyone.","correct":"✓ Dextroamphetamine has potential side effects and is not safe for everyone.","note":"Dextroamphetamine can have side effects and is not suitable for individuals with certain medical conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["amphetamine","stimulant","Adderall (a combination drug containing dextroamphetamine and amphetamine salts)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dextroamphetamine' is a specialized term primarily used in medical and pharmaceutical contexts. It refers to a specific type of stimulant medication. Understanding of this term requires a background in pharmacology or medicine due to its technical nature and specific application in treating conditions like ADHD and narcolepsy."},"example_sentences":[{"sentence":"The psychiatrist adjusted the patient's dextroamphetamine dosage to optimize its therapeutic effects.","translation":"精神科医は、治療効果を最適化するために患者のデキストロアンフェタミンの投与量を調整した。","type":"noun","meaning_category":"medication"},{"sentence":"Long-term use of dextroamphetamine can lead to tolerance and dependence.","translation":"デキストロアンフェタミンの長期使用は、耐性と依存症につながる可能性がある。","type":"noun","meaning_category":"medication"},{"sentence":"Dextroamphetamine works by increasing dopamine and norepinephrine levels in the brain.","translation":"デキストロアンフェタミンは、脳内のドーパミンとノルエピネフリンのレベルを増加させることによって作用する。","type":"noun","meaning_category":"mechanism of action"}]}