{"word":"well-inscribed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(図形が別の図形に)内接している、かつ、接点が適切に配置されている","english_definition":"(of a figure) inscribed in another figure such that the points of tangency are suitably placed.","examples":[{"sentence":"The triangle is well-inscribed in the circle.","translation":"その三角形は円に適切に内接している。"},{"sentence":"A well-inscribed polygon has specific geometric properties.","translation":"適切に内接した多角形は特定の幾何学的特性を持つ。"}],"collocations":["well-inscribed triangle","well-inscribed polygon","well-inscribed circle"],"synonyms":["inscribed","tangentially inscribed"],"antonyms":["circumscribed"],"notes":"This term is mainly used in geometry. It implies that the inscribed figure is not just inside another figure, but also has specific points of contact or tangency that satisfy certain geometric conditions."}],"etymology":{"value":"Derived from 'well' (meaning 'properly' or 'suitably') and 'inscribed' (meaning 'drawn within' or 'enclosed by').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛl ɪnˈskraɪbd/","syllables":"well-in-scribed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative degrees (more well-inscribed, most well-inscribed)."},"usage_notes":{"explanation":"'Well-inscribed' is a technical term in geometry, indicating a specific relationship between two figures where one is inside the other and the points of contact meet certain conditions. It's more precise than simply saying 'inscribed'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The circle is inscribed to the square.","correct":"✓ The circle is well-inscribed in the square.","note":"The correct preposition is 'in', not 'to'. Also, using 'well-inscribed' adds precision."},{"incorrect":"✗ The figure is well inscribed.","correct":"✓ The figure is well-inscribed in the other figure.","note":"It's important to specify what the figure is inscribed in."}],"priority":"★★☆"},"related_words":{"derivatives":["inscription (名詞: 碑文、刻印)","inscribe (動詞: 刻む、内接させる)"],"related_terms":["circumscribe (外接する)","tangent (接線)","geometry (幾何学)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized geometric term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'well-inscribed' is a specialized term used in geometry to describe a figure that is inscribed within another figure in a specific and precise way. It implies that the points where the inner figure touches the outer figure (points of tangency) are arranged in a manner that satisfies certain geometric properties or conditions. Understanding this term requires a good grasp of geometric concepts.","notes":"This explanation assumes a reader with a background in mathematics, particularly geometry."},"example_sentences":[{"sentence":"The equilateral triangle is well-inscribed in a circle such that its vertices lie on the circumference.","translation":"正三角形は、その頂点が円周上にあるように円に適切に内接している。","type":"technical","meaning_category":"geometry"},{"sentence":"A well-inscribed square in another square has its vertices on the sides of the outer square.","translation":"別の正方形に適切に内接する正方形は、外側の正方形の辺に頂点がある。","type":"technical","meaning_category":"geometry"}]}