{"word":"Housman","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"A surname, notably of A.E. Housman, an English poet and classical scholar.","english_definition":"A surname, most famously associated with A.E. Housman, an English poet and classical scholar known for his cycle of poems 'A Shropshire Lad'.","examples":[{"sentence":"I'm reading the poetry of Housman.","translation":"私はハウズマンの詩を読んでいます。"},{"sentence":"Housman's poems often explore themes of mortality and loss.","translation":"ハウズマンの詩はしばしば死や喪失というテーマを探求しています。"}],"collocations":["A.E. Housman","the poetry of Housman","Housman's work","Housman's poems"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Housman is of English origin. It is believed to be derived from a place name, possibly a lost or unidentified location.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaʊsmən/","syllables":"House-man"},"inflection":{},"usage_notes":{"explanation":"'Housman' is primarily recognized as a surname, particularly associated with the poet A.E. Housman. When used in literary contexts, it typically refers to his works or biographical details. It is not a common first name or a word with general use beyond this association.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a housman in the park.","correct":"✓ I saw a house in the park.","note":"'Housman' is a surname, not a common noun. Use 'house' instead if referring to a building."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_people":["A.E. Housman (Alfred Edward Housman) - English poet and scholar.","Laurence Housman - A.E. Housman's brother, also a writer and illustrator."],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Proper noun)","frequency_google_ngram":"Relatively low frequency, primarily in literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Housman' is a proper noun, specifically a surname. Its usage is primarily limited to discussions of the Housman family, especially the poet A.E. Housman and his works. Understanding its significance requires familiarity with English literature and cultural history. It is not part of everyday vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"A.E. Housman is best known for his collection of poems, 'A Shropshire Lad'.","translation":"A.E.ハウズマンは、詩集『シュロップシャーの若者』で最もよく知られています。","type":"example","meaning_category":"surname"},{"sentence":"Scholars continue to analyze the themes in Housman's poetry.","translation":"学者たちはハウズマンの詩のテーマを分析し続けています。","type":"example","meaning_category":"surname"},{"sentence":"The Housman Society promotes the study and appreciation of his works.","translation":"ハウズマン協会は、彼の作品の研究と評価を推進しています。","type":"example","meaning_category":"surname"}]}