{"word":"catarrhous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(医学) カタル性の、粘液性の","english_definition":"Relating to or characterized by catarrh (inflammation of the mucous membrane, with increased flow of mucus).","examples":[{"sentence":"The patient presented with catarrhous symptoms such as a runny nose and cough.","translation":"患者は鼻水や咳などのカタル性症状を呈した。"},{"sentence":"The doctor diagnosed a catarrhous inflammation of the sinuses.","translation":"医師は副鼻腔のカタル性炎症と診断した。"}],"collocations":["catarrhous inflammation (カタル性炎症)","catarrhous symptoms (カタル性症状)","catarrhous condition (カタル性の状態)"],"synonyms":["mucous","phlegmatic","rhinal","coryzal"],"antonyms":["non-mucous","dry"]}],"etymology":{"value":"Derived from the word 'catarrh', which comes from the Greek word 'katarrhein', meaning 'to flow down'. This refers to the increased flow of mucus associated with the condition.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈtɑːrəs/","syllables":"ca-tar-rhous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Catarrhous' is a medical term primarily used to describe conditions or symptoms associated with increased mucus production and inflammation of the mucous membranes, especially in the nose and throat. It is often used in a medical context to describe the nature of an illness or inflammation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather is catarrhous today.","correct":"✓ The weather is conducive to catarrhous conditions.","note":"'Catarrhous' describes a medical condition, not the weather itself. The weather might contribute to such conditions, but it is not 'catarrhous'."},{"incorrect":"✗ He felt very catarrhous.","correct":"✓ He felt catarrhal. / ✓ He had catarrhous symptoms.","note":"While 'catarrhous' is an adjective, it's more common to say someone 'has catarrhous symptoms' or is 'catarrhal' (another adjective form)."}],"priority":"★★☆"},"related_words":{"derivatives":["catarrh (noun: カタル)","catarrhal (adjective: カタル性の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Catarrhous' is a technical medical term that describes conditions related to catarrh, which involves inflammation of the mucous membranes and increased mucus production. It is primarily used in medical contexts to describe symptoms or inflammations, such as 'catarrhous inflammation of the sinuses.' This word is not commonly used in everyday conversation and is more likely to be encountered in medical texts or discussions."},"example_sentences":[{"sentence":"The child's constant runny nose was indicative of a catarrhous condition.","translation":"その子供の絶え間ない鼻水は、カタル性の状態を示していた。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"The doctor noted the catarrhous nature of the patient's nasal discharge.","translation":"医師は患者の鼻水のカタル性の性質に注目した。","type":"adjective","meaning_category":"Medical Description"}]}