{"word":"uninterpolated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"補間されていない、補完されていない","english_definition":"Not interpolated; not having values inserted between known values.","examples":[{"sentence":"The raw data was unintrerpolated.","translation":"生データは補間されていませんでした。"},{"sentence":"We used the unintrerpolated data for the initial analysis.","translation":"初期分析には、補間されていないデータを使用しました。"}],"collocations":["uninterpolated data","uninterpolated values"],"synonyms":["raw","original","unprocessed"],"antonyms":["interpolated","smoothed"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the word 'interpolated'. 'Interpolated' comes from the verb 'interpolate', which originates from the Latin word 'interpolare' (to alter, to refresh, to insert between).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪnˈtɜːrpəleɪtɪd/","syllables":"un-in-ter-po-la-ted"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Uninterpolated' is used in technical contexts, particularly in mathematics, statistics, signal processing, and computer graphics, to describe data or values that have not been estimated or inserted between known data points. It indicates that the data is in its original, unprocessed form.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unintrerpolated data was smoother than the interpolated data.","correct":"✓ The unintrerpolated data was less smooth than the interpolated data.","note":"Uninterpolated data is typically less smooth because it lacks the estimated values that interpolation provides."}],"priority":"★★☆"},"related_words":{"derivatives":["interpolate (verb)","interpolation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'uninterpolated' is a technical term primarily used in fields involving data analysis and processing. It signifies that data has not undergone interpolation, a process of estimating values between known data points. Understanding this term requires familiarity with the concept of interpolation and its applications in various domains.","priority":"★★☆"},"example_sentences":[{"sentence":"The graph shows the unintrerpolated measurements.","translation":"グラフは補間されていない測定値を示しています。","type":"general","meaning_category":"descriptive"},{"sentence":"We compared the results obtained using unintrerpolated and interpolated datasets.","translation":"補間されていないデータセットと補間されたデータセットを使用して得られた結果を比較しました。","type":"technical","meaning_category":"comparative"}]}