{"word":"poundbreach","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)囲い地からの不法な家畜の解放","english_definition":"(law) The unlawful breaking of a pound in order to release distrained livestock.","examples":[{"sentence":"The farmer was accused of poundbreach after freeing his cattle from the town's enclosure.","translation":"その農夫は、自分の家畜を町の囲い地から解放した後、囲い地からの不法な家畜の解放で告発された。"}],"collocations":["commit poundbreach","accused of poundbreach"],"synonyms":["rescue","escape","liberation"],"antonyms":["impoundment","confinement"]},{"part_of_speech":"noun","definition":"(歴史)囲い地からの不法な物品の解放","english_definition":"(historical) The unlawful breaking of a pound to release goods that have been impounded.","examples":[{"sentence":"Poundbreach was a serious offense in the medieval period, undermining the authority of the local courts.","translation":"囲い地からの不法な物品の解放は中世において重大な犯罪であり、地方裁判所の権威を弱体化させた。"}],"collocations":["historical poundbreach","commit an act of poundbreach"],"synonyms":["theft","recovery","seizure"],"antonyms":["impoundment","detainment"]}],"etymology":{"value":"The word \"poundbreach\" is derived from the combination of \"pound\" (an enclosure for confining stray livestock or distrained goods) and \"breach\" (the act of breaking or violating).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaʊndˌbriːtʃ/","syllables":"pound-breach"},"inflection":{"noun_plural":"poundbreaches"},"usage_notes":{"explanation":"Poundbreach is a legal term, primarily historical, referring to the act of illegally breaking into a pound (an enclosure) to release animals or goods that have been legally seized or impounded. It was considered a serious offense as it undermined the legal process of distraint or seizure. Today, the term is less commonly used, but the underlying principle of unlawfully interfering with legal impoundment remains relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He committed a pound breach by accident.","correct":"✓ He committed poundbreach by accident.","note":"Poundbreach is one word, not two. It's a single compound noun."},{"incorrect":"✗ The police were investigating a pound breach.","correct":"✓ The police were investigating a poundbreach.","note":"Again, poundbreach is a single word."}],"priority":"★☆☆"},"related_words":{"derivatives":["impound (verb)","distraint (noun)","replevin (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Poundbreach\" is a highly specialized and archaic legal term. It refers to the act of illegally breaking into a \"pound\" (an enclosure where stray livestock or seized goods are kept) to free the animals or goods. Understanding this term requires knowledge of historical legal practices related to distraint and impoundment. It is rarely encountered outside of legal or historical contexts."},"example_sentences":[{"sentence":"The historical records detail several instances of poundbreach, often involving disputes over land rights.","translation":"歴史的記録には、囲い地からの不法な家畜の解放の事例がいくつか詳述されており、多くの場合、土地の権利をめぐる紛争が関係している。","type":"noun","meaning_category":"(historical) unlawful breaking of a pound"},{"sentence":"Poundbreach was a punishable offense, aimed at protecting the legal process of impounding goods or livestock.","translation":"囲い地からの不法な物品の解放は処罰の対象となる犯罪であり、物品や家畜を差し押さえるという法的手続きの保護を目的としていた。","type":"noun","meaning_category":"(law) unlawful breaking of a pound"}]}