{"word":"mellimide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A cyclic imide derived from mellitic acid.","english_definition":"A cyclic imide derived from mellitic acid, having the chemical formula C12H3N3O6.","examples":[{"sentence":"Mellimide is a chemical compound used in the synthesis of various materials.","translation":"メリミドは、様々な材料の合成に使用される化合物です。"},{"sentence":"The structure of mellimide contains a benzene ring fused to three imide rings.","translation":"メリミドの構造は、ベンゼン環が3つのイミド環と縮合しています。"}],"collocations":["mellimide derivative","mellimide synthesis","mellimide structure"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'mellitic' (referring to mellitic acid) + 'imide' (referring to the imide functional group).","priority":"★★★"},"pronunciation":{"ipa":"/məˈlɪmɪd/","syllables":"mel-li-mide"},"inflection":{"noun_plural":"mellimides"},"usage_notes":{"explanation":"Mellimide is a specific chemical compound, and its usage is primarily within the field of chemistry. It's unlikely to be encountered in general conversation.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["mellitic acid","imide"],"related_compounds":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mellimide' is a highly specialized chemical term. Understanding requires a strong background in organic chemistry. It is not a word used in everyday language. Its meaning is directly tied to its chemical structure and its relationship to mellitic acid and imide functional groups."},"example_sentences":[{"sentence":"The researchers investigated the properties of a novel mellimide-based polymer.","translation":"研究者たちは、新しいメリミドベースのポリマーの特性を調査しました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"The synthesis of mellimide requires specific reaction conditions.","translation":"メリミドの合成には、特定の反応条件が必要です。","type":"noun","meaning_category":"chemical compound"}]}