{"word":"Wahhabism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ワッハーブ主義（イスラム教スンニ派の厳格な宗教運動）","english_definition":"A conservative and austere form of Sunni Islam that advocates a return to the practices of the early Muslims.","examples":[{"sentence":"Wahhabism is the dominant religious ideology in Saudi Arabia.","translation":"ワッハーブ主義はサウジアラビアにおける支配的な宗教イデオロギーである。"},{"sentence":"Critics argue that Wahhabism has contributed to the rise of extremist groups.","translation":"批判者たちは、ワッハーブ主義が過激派グループの台頭に貢献したと主張する。"}],"collocations":["spread of Wahhabism (ワッハーブ主義の広がり)","influence of Wahhabism (ワッハーブ主義の影響)","Wahhabism ideology (ワッハーブ主義のイデオロギー)"],"synonyms":["Salafism (サラフィー主義)","Islamic fundamentalism (イスラム原理主義)"],"antonyms":["Progressive Islam (進歩的イスラム)","Liberal Islam (リベラル・イスラム)"]}],"etymology":{"value":"Named after Muhammad ibn Abd al-Wahhab, an 18th-century religious leader who founded the movement. The suffix '-ism' denotes a doctrine or system of beliefs.","priority":"★★★"},"pronunciation":{"ipa":"/wɑːˈhɑːbɪzəm/","syllables":"Wa-ha-bi-sm"},"inflection":{"notes":"Uncountable noun (不可算名詞)"},"usage_notes":{"explanation":"Wahhabism is often associated with strict interpretations of Islamic law and a rejection of practices not explicitly sanctioned in the Quran or the Sunnah (the teachings and practices of the Prophet Muhammad). It is a controversial movement, with supporters viewing it as a purification of Islam and critics accusing it of intolerance and extremism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Wahhabism are a religion.","correct":"✓ Wahhabism is a religious movement.","note":"Wahhabism is a movement or ideology, not a religion itself. It is a branch within Sunni Islam."},{"incorrect":"✗ Wahhabism promote violence.","correct":"✓ Some groups influenced by Wahhabism promote violence.","note":"It's important to specify that not all followers of Wahhabism promote violence, but some extremist groups have been influenced by its teachings."}],"priority":"★★☆"},"related_words":{"derivatives":["Wahhabi (ワッハーブ派の信者、ワッハーブ主義者)"],"phrases":["Muhammad ibn Abd al-Wahhab (ムハンマド・イブン＝アブドゥルワッハーブ)","Salafi (サラフィー)","Jihadism (ジハード主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. Commonly found in academic or journalistic contexts related to Islam, politics, and international relations.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wahhabism' is a term used in political science, history, and religious studies to describe a particular Islamic movement. Understanding it requires knowledge of Islamic history and terminology. It's often discussed in the context of global politics and religious extremism, so familiarity with these topics is helpful when encountering this word.","priority":"★★☆"},"example_sentences":[{"sentence":"The Saudi government has historically supported the spread of Wahhabism.","translation":"サウジアラビア政府は歴史的にワッハーブ主義の拡大を支援してきた。","type":"general","meaning_category":"General Statement"},{"sentence":"Some scholars argue that Wahhabism is a major source of Islamic terrorism.","translation":"一部の学者は、ワッハーブ主義がイスラムテロの主要な源であると主張する。","type":"controversial","meaning_category":"Controversial View"},{"sentence":"Wahhabism emphasizes the importance of Tawhid, the oneness of God.","translation":"ワッハーブ主義はタウヒード、すなわち神の唯一性を強調する。","type":"religious","meaning_category":"Religious Doctrine"}]}