{"word":"Hispanist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イスパニア研究者、スペイン語研究者、スペイン文化研究者","english_definition":"A scholar of Hispanic languages, literatures, and cultures.","examples":[{"sentence":"He is a renowned Hispanist specializing in the works of Cervantes.","translation":"彼はセルバンテスの作品を専門とする著名なイスパニア研究者です。"},{"sentence":"The conference brought together Hispanists from around the world.","translation":"その会議には世界中のイスパニア研究者が集まりました。"}],"collocations":["leading Hispanist","prominent Hispanist","renowned Hispanist","international conference of Hispanists"],"synonyms":["Spanish scholar","Hispanic scholar","Spanish cultural historian"],"antonyms":[]}],"etymology":{"value":"The word \"Hispanist\" is derived from \"Hispanic,\" which comes from \"Hispania,\" the Roman name for the Iberian Peninsula (modern-day Spain and Portugal). The suffix \"-ist\" denotes a person who studies or is an expert in a particular subject.","priority":"★★★"},"pronunciation":{"ipa":"/hɪˈspænɪst/","syllables":"His-pan-ist"},"inflection":{"noun_plural":"Hispanists"},"usage_notes":{"explanation":"A \"Hispanist\" is someone who studies the languages, literatures, and cultures of the Spanish-speaking world. This can include Spain, Latin America, and other regions where Spanish is spoken or has had a significant historical influence. The term is often used in academic contexts to refer to scholars who specialize in Hispanic studies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Spanish.","correct":"✓ He is a Hispanist.","note":"\"Spanish\" refers to a person from Spain or the Spanish language. \"Hispanist\" refers to a scholar of Hispanic studies."}],"priority":"★★☆"},"related_words":{"derivatives":["Hispanic (adjective, noun)","Hispanism (noun)","Hispanize (verb)"],"phrases":["Hispanic studies","Spanish literature","Latin American literature"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"Hispanist\" is a specialized academic term referring to scholars who study Hispanic languages, literatures, and cultures. It is not commonly used in everyday conversation but is prevalent in academic and scholarly contexts. Understanding this term requires familiarity with academic terminology and the field of Hispanic studies."},"example_sentences":[{"sentence":"The university's Department of Spanish and Portuguese has several distinguished Hispanists on its faculty.","translation":"大学のスペイン・ポルトガル語学科には、著名なイスパニア研究者が何人か在籍しています。","type":"general","meaning_category":"academic"},{"sentence":"Her research on the Golden Age of Spanish literature established her as a leading Hispanist in the field.","translation":"彼女のスペイン黄金時代文学に関する研究は、彼女をその分野における第一人者のイスパニア研究者として確立しました。","type":"specific","meaning_category":"literature"},{"sentence":"As a Hispanist, he is deeply interested in the cultural connections between Spain and Latin America.","translation":"イスパニア研究者として、彼はスペインとラテンアメリカの文化的なつながりに深い関心を持っています。","type":"cultural","meaning_category":"culture"}]}