{"word":"antiuniversity","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"反大学、アンチユニバーシティ","english_definition":"An educational institution established in opposition to traditional universities, often characterized by experimental, radical, or non-hierarchical approaches to learning.","examples":[{"sentence":"The antiuniversity aimed to challenge the established academic norms.","translation":"その反大学は、確立された学術的な規範に挑戦することを目指した。"},{"sentence":"Students at the antiuniversity had a significant role in shaping the curriculum.","translation":"その反大学の学生たちは、カリキュラムの形成において重要な役割を担っていた。"}],"collocations":["radical education (ラディカルな教育)","alternative education (オルタナティブ教育)","non-hierarchical learning (非階層的な学習)","experimental curriculum (実験的なカリキュラム)"],"synonyms":["free university","experimental college","alternative school"],"antonyms":["traditional university","conventional college"]},{"part_of_speech":"adjective","definition":"反大学の、アンチユニバーシティの","english_definition":"Relating to or characteristic of an antiuniversity.","examples":[{"sentence":"The antiuniversity movement promoted a more democratic approach to education.","translation":"反大学運動は、教育に対するより民主的なアプローチを推進した。"},{"sentence":"The antiuniversity's pedagogical methods were highly innovative.","translation":"その反大学の教育方法は非常に革新的だった。"}],"collocations":["antiuniversity movement (反大学運動)","antiuniversity principles (反大学の原則)","antiuniversity pedagogy (反大学の教育学)"],"synonyms":["unorthodox","radical","experimental"],"antonyms":["orthodox","traditional","conventional"]}],"etymology":{"value":"The term \"antiuniversity\" is formed by combining the prefix \"anti-\" (meaning against or opposed to) with the word \"university.\" It signifies an institution that is fundamentally opposed to the traditional structure, values, and methods of conventional universities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌjuːnɪˈvɜːrsəti/","syllables":"an-ti-u-ni-ver-si-ty"},"inflection":{"noun_plural":"antiuniversities"},"usage_notes":{"explanation":"The term \"antiuniversity\" refers to an educational institution that intentionally rejects the norms and structures of traditional universities. These institutions often emphasize student autonomy, non-hierarchical relationships between teachers and students, and experimental or radical approaches to curriculum and pedagogy. The concept emerged in the 1960s as part of broader social and political movements that questioned established institutions and sought alternative forms of education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The anti-university is a type of traditional school.","correct":"✓ The antiuniversity is an alternative to traditional schools.","note":"Antiuniversities are designed to be the opposite of traditional schools, not a type of them."},{"incorrect":"✗ Antiuniversity is always a negative term.","correct":"✓ Antiuniversity is a descriptive term, not necessarily negative.","note":"While the term implies opposition to traditional universities, it does not inherently carry a negative connotation. It simply describes a different approach to education."}],"priority":"★★☆"},"related_words":{"derivatives":["anti-establishment (反体制)","alternative education (オルタナティブ教育)","free school (自由学校)"],"phrases":["open classroom (オープンスクール)","deschooling (脱学校化)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'antiuniversity' refers to an educational institution that deliberately opposes the conventional structures, values, and methods of traditional universities. These institutions often prioritize student autonomy, non-hierarchical relationships between educators and learners, and experimental or radical approaches to curriculum and teaching. The concept emerged in the 1960s as part of broader social and political movements that questioned established institutions and sought alternative forms of education. Understanding this term requires familiarity with educational theory and the history of alternative education movements."},"example_sentences":[{"sentence":"The London **antiuniversity** was founded in the 1960s as a response to perceived limitations in traditional higher education.","translation":"ロンドンの反大学は、従来の高等教育における認識された限界への対応として1960年代に設立された。","type":"noun","meaning_category":"反大学"},{"sentence":"The **antiuniversity** movement sought to create more accessible and democratic forms of learning.","translation":"反大学運動は、よりアクセスしやすく民主的な学習形態を創造しようとした。","type":"adjective","meaning_category":"反大学の"},{"sentence":"The **antiuniversity** offered courses on topics not typically found in mainstream university curricula.","translation":"その反大学は、主流の大学のカリキュラムでは通常見られないトピックに関するコースを提供した。","type":"noun","meaning_category":"反大学"}]}