{"word":"Lungworts","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(植物) ルングウォルト属の植物","english_definition":"Plants of the genus Pulmonaria, typically having spotted leaves and clusters of blue, pink, or white flowers.","examples":[{"sentence":"Lungworts are popular in shade gardens for their early spring blooms.","translation":"ルングウォルトは早春の開花のために日陰の庭で人気があります。"},{"sentence":"The spotted leaves of lungworts are quite distinctive.","translation":"ルングウォルトの斑点のある葉は非常に特徴的です。"}],"collocations":["grow lungworts","plant lungworts","lungworts in shade gardens"],"synonyms":["Pulmonaria"],"antonyms":[]}],"etymology":{"value":"The name \"lungwort\" comes from the resemblance of the leaves to a diseased lung. In medieval times, it was believed that plants resembling body parts could be used to treat diseases of those parts.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlʌŋˌwɔːrts/","syllables":"lung-worts"},"inflection":{"noun_plural":"lungworts"},"usage_notes":{"explanation":"Lungworts are known for their attractive foliage and colorful flowers, making them a favorite in ornamental gardens. The name reflects the historical belief in the Doctrine of Signatures, where a plant's appearance suggested its medicinal use.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ lungwort","correct":"✓ lungworts","note":"When referring to the genus of plants, it's typically pluralized as 'lungworts'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pulmonaria (scientific name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lungworts' refers to a specific genus of plants often grown in gardens. The term is not commonly used outside of gardening or botany contexts. Understanding the term requires some familiarity with plant names and gardening practices."},"example_sentences":[{"sentence":"The garden featured a variety of lungworts with different flower colors.","translation":"その庭には、さまざまな花色のルングウォルトが植えられていた。","type":"noun","meaning_category":"植物"},{"sentence":"Lungworts thrive in moist, shady conditions.","translation":"ルングウォルトは湿った日陰の環境でよく育つ。","type":"noun","meaning_category":"植物"}]}