{"word":"Disprovers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of disprover. A disprover is someone or something that disproves a claim, theory, or hypothesis.","english_definition":"The plural of disprover, which is someone or something that disproves a claim, theory, or hypothesis.","examples":[{"sentence":"The disprovers of the flat earth theory have presented overwhelming evidence.","translation":"地球平面説の反証者は圧倒的な証拠を提示した。"}],"collocations":[],"synonyms":["refuters","contradictors","invalidators"],"antonyms":["supporters","validators","proofs"]}],"etymology":{"value":"Derived from 'disprove' (to prove something to be false) + '-er' (suffix denoting an agent or instrument).","priority":"N/A"},"pronunciation":{"ipa":"/dɪsˈpruːvərz/","syllables":"dis-prov-ers"},"inflection":{"noun_plural":"Disprovers"},"usage_notes":{"explanation":"'Disprovers' is used to refer to multiple entities (people, studies, experiments, etc.) that provide evidence against a particular assertion. It is most often used in academic or scientific contexts.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["Disprove","Disproved","Disproving","Proof","Prover"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Disprovers' is a relatively uncommon word, mostly used in formal or academic contexts when discussing the refutation of claims or theories. It is the plural form of 'disprover,' which refers to someone or something that provides evidence against a claim. Understanding the base word 'disprove' is essential for comprehending the meaning of 'disprovers.'"},"example_sentences":[{"sentence":"The scientific community is full of disprovers, constantly testing and challenging existing theories.","translation":"科学界は反証者で溢れており、既存の理論を常にテストし、挑戦している。","type":"noun","meaning_category":"people who disprove"},{"sentence":"These experiments served as disprovers to the original hypothesis.","translation":"これらの実験は、元の仮説に対する反証として役立った。","type":"noun","meaning_category":"things that disprove"}]}