{"word":"Post-Kantian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カント以後の、カント哲学の影響を受けた","english_definition":"Relating to or characteristic of the period in philosophy following Immanuel Kant, or influenced by his philosophy.","examples":[{"sentence":"Post-Kantian philosophy saw a shift towards idealism.","translation":"カント以後の哲学は、観念論への移行を見せた。"},{"sentence":"Hegel is a major figure in Post-Kantian thought.","translation":"ヘーゲルはカント以後の思想における主要な人物である。"}],"collocations":["Post-Kantian idealism","Post-Kantian philosophy","Post-Kantian thinkers"],"synonyms":["after Kant","influenced by Kantianism"],"antonyms":["pre-Kantian","Kantian"]},{"part_of_speech":"noun","definition":"カント以後の哲学者、カント哲学の影響を受けた人","english_definition":"A philosopher or thinker who lived or worked after Immanuel Kant and whose ideas were influenced by his philosophy.","examples":[{"sentence":"Many Post-Kantians attempted to reconcile Kant's transcendental idealism with realism.","translation":"多くのカント以後の哲学者たちは、カントの超越論的観念論と現実主義を調和させようと試みた。"}],"collocations":["a prominent Post-Kantian","influential Post-Kantians"],"synonyms":["follower of Kant","student of Kantianism"],"antonyms":["pre-Kantian philosopher","Kantian"]}],"etymology":{"value":"Formed from \"post-\" (after) + \"Kantian\" (relating to Immanuel Kant).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊstˈkæntiən/","syllables":"post-kan-ti-an"},"inflection":{"notes":"Adjective and noun forms exist. The adjective does not inflect. The noun can be pluralized as \"Post-Kantians.\""},"usage_notes":{"explanation":"\"Post-Kantian\" refers to the period in philosophy following Immanuel Kant (1724-1804) and the philosophical movements and thinkers influenced by his work. Key themes in Post-Kantian philosophy include idealism, phenomenology, and existentialism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Post-Kantian is the same as Kantian.","correct":"✓ Post-Kantian comes after Kantian and is influenced by it, but is not the same.","note":"Post-Kantian thought builds upon and reacts to Kantian philosophy, but it represents a distinct set of ideas."}],"priority":"★★☆"},"related_words":{"derivatives":["Post-Kantianism (noun: the philosophical movements and ideas following Kant)"],"related_terms":["Kantian","Immanuel Kant","idealism","phenomenology","existentialism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Post-Kantian\" is a specialized term used in philosophy to describe the period and thinkers that followed Immanuel Kant. Understanding this term requires familiarity with Kant's philosophy and the subsequent developments in philosophical thought. It is typically encountered in advanced academic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Schelling's philosophy is often described as a bridge between Kant and later Post-Kantian thinkers.","translation":"シェリングの哲学は、カントと後のカント以後の思想家たちとの間の橋渡しとしてよく説明される。","type":"adjective","meaning_category":"Relating to the period after Kant"},{"sentence":"Hegel and Fichte are considered important Post-Kantians.","translation":"ヘーゲルとフィヒテは重要なカント以後の哲学者とみなされている。","type":"noun","meaning_category":"Philosopher after Kant"}]}