{"word":"fideicommiss","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 遺産限定相続、信託遺贈","english_definition":"(Law) A legal institution, similar to a trust, in which property is bequeathed to a person (the fiduciary) who is obligated to hand it over to another person (the fideicommissary) at a later time or upon the occurrence of a specified event.","examples":[{"sentence":"The fideicommiss ensured that the family estate remained within the bloodline.","translation":"遺産限定相続によって、家族の財産が血縁者の間で維持されることが保証された。"},{"sentence":"Under the terms of the fideicommiss, the property will pass to his eldest son upon his death.","translation":"遺産限定相続の条件の下で、その財産は彼の死後、長男に引き継がれる。"}],"collocations":["establish a fideicommiss","terms of the fideicommiss","revoke a fideicommiss"],"synonyms":["trust","entailment","settlement"],"antonyms":[]}],"etymology":{"value":"From Latin *fidei commissum*, from *fidei* (of faith, trust) + *commissum* (something entrusted), past participle of *committere* (to entrust).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪdiɪkəˈmɪs/","syllables":"fi-de-i-co-mmiss"},"inflection":{"noun_plural":"fideicommisses"},"usage_notes":{"explanation":"A *fideicommiss* is a legal device, primarily in civil law jurisdictions, used to control the inheritance of property over multiple generations. It restricts the freedom of the initial heir (the fiduciary) to dispose of the property, as they are obligated to pass it on to a designated beneficiary (the fideicommissary) at a specified time or under particular conditions. It is similar to a trust in common law systems, but with specific differences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He created a fideicommiss for his cats.","correct":"✓ He created a trust for his cats.","note":"While a fideicommiss can be used for various beneficiaries, it's more commonly associated with preserving family wealth and lineage. A trust is more flexible for different types of beneficiaries, including animals."},{"incorrect":"✗ The fideicommiss allows the heir to sell the property immediately.","correct":"✓ The fideicommiss restricts the heir from selling the property immediately.","note":"The primary purpose of a fideicommiss is to restrict the heir's ability to freely dispose of the property, ensuring it passes to the intended beneficiary."}],"priority":"★☆☆"},"related_words":{"derivatives":["fiduciary","fideicommissary"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Law-specific vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *fideicommiss* is a specialized legal term referring to a type of inheritance restriction, similar to a trust, where property is passed down through generations with specific obligations on the initial heir. It's primarily used in civil law jurisdictions and is not commonly encountered in everyday language. Understanding this term requires familiarity with legal concepts related to inheritance and property law."},"example_sentences":[{"sentence":"The family established a fideicommiss to ensure the ancestral home remained in the family for generations.","translation":"その家族は、先祖代々の家が何世代にもわたって家族に残るように、遺産限定相続を設定した。","type":"noun","meaning_category":"遺産限定相続"},{"sentence":"The lawyer explained the intricacies of the fideicommiss to the client.","translation":"弁護士は遺産限定相続の複雑な詳細を依頼人に説明した。","type":"noun","meaning_category":"遺産限定相続"}]}