{"word":"stereograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"立体写真、ステレオ写真","english_definition":"A photograph produced as two side-by-side images that, when viewed through a stereoscope, appear three-dimensional.","examples":[{"sentence":"Old stereographs provide a fascinating glimpse into the past in three dimensions.","translation":"昔の立体写真は、3次元で過去を垣間見ることができる魅力的な手段です。"},{"sentence":"He collected stereographs of famous landmarks from around the world.","translation":"彼は世界中の有名なランドマークの立体写真を収集しました。"}],"collocations":["stereograph card","stereograph viewer","vintage stereograph","historical stereograph"],"synonyms":["stereoscopic photograph","3D photograph"],"antonyms":["flat photograph","2D photograph"]}],"etymology":{"value":"From 'stereo-' (meaning 'solid' or 'three-dimensional') + '-graph' (meaning 'something written or drawn').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɛriəˌɡræf/","syllables":"ste-re-o-graph"},"inflection":{"noun_plural":"stereographs"},"usage_notes":{"explanation":"A stereograph consists of two nearly identical photographs taken from slightly different angles. When viewed through a stereoscope, the brain combines these two images to create the illusion of depth, resulting in a three-dimensional image. Stereographs were particularly popular in the late 19th and early 20th centuries as a form of entertainment and education.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a stereograph with my phone.","correct":"✓ I took a stereoscopic photo with my phone.","note":"While modern phones can take stereoscopic photos, 'stereograph' typically refers to the older, card-mounted images."},{"incorrect":"✗ Stereographs are viewed with a telescope.","correct":"✓ Stereographs are viewed with a stereoscope.","note":"A stereoscope is specifically designed for viewing stereographs."}],"priority":"★★☆"},"related_words":{"derivatives":["stereography (the art or process of producing stereographs)","stereoscopic (relating to or denoting stereoscopy or a stereoscope)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stereograph' is a relatively uncommon word referring to a specific type of photograph designed to create a 3D effect when viewed with a special device called a stereoscope. Understanding the word requires knowledge of the history of photography and optical devices. The word is more likely to be encountered in historical contexts or discussions of photography techniques."},"example_sentences":[{"sentence":"The museum displayed a collection of antique stereographs.","translation":"博物館にはアンティークの立体写真のコレクションが展示されていました。","type":"noun","meaning_category":"立体写真"},{"sentence":"Viewing the stereograph transported me back to the 19th century.","translation":"その立体写真を見ると、19世紀にタイムスリップしたような気分になった。","type":"noun","meaning_category":"立体写真"}]}