{"word":"angheria","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(historical) forced labor or services demanded by a feudal lord or government; a form of extortion or oppression.","english_definition":"Forced labor or services demanded by a feudal lord or government; a form of extortion or oppression.","examples":[{"sentence":"The peasants suffered under the angheria imposed by the local nobleman.","translation":"農民たちは地元の貴族が課した強制労働に苦しんだ。"},{"sentence":"Angheria was a common practice in many parts of medieval Europe.","translation":"アンゲリアは中世ヨーロッパの多くの地域で一般的な慣習だった。"}],"collocations":["impose angheria","suffer under angheria","abolish angheria"],"synonyms":["forced labor","corvée","oppression","extortion"],"antonyms":["voluntary service","freedom"]}],"etymology":{"value":"From Medieval Latin *angaria*, from Late Greek *angareia* (ἀγγαρεία, “compulsory service, impressment”), from *angaros* (ἄγγαρος, “mounted courier”), of Persian origin.","priority":"medium"},"pronunciation":{"ipa":"/anˈɡɛːria/","syllables":"an-ghe-ri-a"},"inflection":{"noun_plural":"angherias"},"usage_notes":{"explanation":"The term 'angheria' is primarily used in historical contexts to describe the oppressive practice of forced labor or services demanded by feudal lords or governments. It is not commonly used in modern English.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"He was a victim of modern angheria in the workplace.","correct":"He was a victim of exploitation in the workplace.","note":"While 'angheria' implies oppression, it's specifically tied to historical forced labor. 'Exploitation' is more appropriate for modern contexts."}],"priority":"medium"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["feudalism","serfdom","slavery","oppression"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Angheria' is a rare and specialized term referring to historical forced labor or oppressive demands. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires familiarity with feudal systems and historical forms of oppression."},"example_sentences":[{"sentence":"The historical records detailed the various forms of angheria imposed on the peasantry.","translation":"歴史的記録は、農民に課せられた様々な形態のアンゲリアを詳述していた。","type":"noun","meaning_category":"forced labor"},{"sentence":"The system of angheria contributed to widespread social unrest and eventual revolt.","translation":"アンゲリアの制度は、広範囲にわたる社会不安と最終的な反乱の一因となった。","type":"noun","meaning_category":"oppression"}]}