{"word":"rhabdoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"桿状体様の、ラブドイド様の","english_definition":"Resembling rhabdoid cells, which are characterized by eccentric nuclei, prominent nucleoli, and abundant eosinophilic cytoplasm containing globular inclusions.","examples":[{"sentence":"rhabdoid tumor","translation":"ラブドイド腫瘍"},{"sentence":"rhabdoid morphology","translation":"ラブドイド様の形態"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"桿状体細胞、ラブドイド細胞","english_definition":"A type of cell characterized by an eccentric nucleus, prominent nucleolus, and abundant eosinophilic cytoplasm containing globular inclusions; often associated with aggressive tumors.","examples":[{"sentence":"Rhabdoid cells are often found in malignant rhabdoid tumors.","translation":"ラブドイド細胞はしばしば悪性ラブドイド腫瘍に見られる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'rhabdos' meaning 'rod' or 'staff', referring to the rod-like or staff-like inclusions seen within the cytoplasm of these cells.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræbdɔɪd/","syllables":"rhab-doid"},"inflection":{"notes":"The word 'rhabdoid' can function as both an adjective and a noun. As an adjective, it does not inflect. As a noun, the plural form is 'rhabdoid cells' or simply 'rhabdoids'."},"usage_notes":{"explanation":"'Rhabdoid' is a term primarily used in pathology and oncology to describe cells and tumors exhibiting specific morphological characteristics. These cells are notable for their eccentric nuclei, prominent nucleoli, and abundant eosinophilic cytoplasm containing globular inclusions. The term is most commonly associated with malignant rhabdoid tumors, which are aggressive cancers that can occur in various parts of the body, particularly in infants and young children.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tumor was rhabdoid. (implying benign)","correct":"✓ The tumor was a malignant rhabdoid tumor.","note":"Rhabdoid tumors are typically malignant, so specifying 'malignant' provides important clinical context."}],"priority":"★☆☆"},"related_words":{"derivatives":["rhabdomyosarcoma","rhabdovirus"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Rhabdoid' is a highly specialized term used in the fields of pathology and oncology. It describes cells with specific morphological features, including eccentric nuclei, prominent nucleoli, and abundant eosinophilic cytoplasm containing globular inclusions. These cells are often associated with aggressive tumors, particularly malignant rhabdoid tumors. Due to its specific and technical nature, this term is primarily encountered in medical and scientific contexts. Understanding requires knowledge of cell biology, pathology, and oncology."},"example_sentences":[{"sentence":"The pathologist identified **rhabdoid** cells in the tumor sample.","translation":"病理医は腫瘍サンプルの中にラブドイド細胞を特定した。","type":"noun","meaning_category":"細胞"},{"sentence":"The tumor exhibited **rhabdoid** features under microscopic examination.","translation":"その腫瘍は顕微鏡検査でラブドイド様の特性を示した。","type":"adjective","meaning_category":"桿状体様の"}]}