{"word":"malaria-prone","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"マラリアが発生しやすい、マラリアの危険がある","english_definition":"likely to be affected by malaria; having a high risk of malaria transmission.","examples":[{"sentence":"The region is malaria-prone, especially during the rainy season.","translation":"その地域は、特に雨季にはマラリアが発生しやすい。"},{"sentence":"Malaria-prone areas require preventative measures such as mosquito nets and insecticide spraying.","translation":"マラリアの危険がある地域では、蚊帳や殺虫剤の散布などの予防措置が必要です。"}],"collocations":["malaria-prone area","malaria-prone region","highly malaria-prone","increasingly malaria-prone"],"synonyms":["malarious","malaria-affected","at risk of malaria","endemic for malaria"],"antonyms":["malaria-free","malaria-resistant","malaria-safe"]},{"part_of_speech":"adjective","definition":"マラリアに罹患しやすい、マラリアに対する抵抗力がない","english_definition":"susceptible to malaria; having a low resistance to malaria infection.","examples":[{"sentence":"Children in malaria-prone countries are particularly vulnerable to the disease.","translation":"マラリアが発生しやすい国の子どもたちは、特にこの病気にかかりやすい。"},{"sentence":"Certain genetic factors can make individuals less malaria-prone.","translation":"特定の遺伝的要因により、マラリアにかかりにくくなる人がいる。"}],"collocations":["less malaria-prone","more malaria-prone","genetically malaria-prone"],"synonyms":["susceptible to malaria","vulnerable to malaria","sensitive to malaria"],"antonyms":["malaria-resistant","immune to malaria"]}],"etymology":{"value":"The word is a compound adjective formed from \"malaria\" and \"prone.\" \"Malaria\" comes from Italian mala aria, meaning \"bad air,\" reflecting the historical belief that the disease was caused by unhealthy air. \"Prone\" means likely to suffer from or do something undesirable.","priority":"★☆☆"},"pronunciation":{"ipa":"/məˈlɛəriəˌproʊn/","syllables":"ma-lar-i-a-prone"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term \"malaria-prone\" is used to describe areas or individuals that have a high likelihood of being affected by malaria. It is often used in public health and medical contexts to identify regions where malaria prevention and treatment efforts are most needed. The term can refer to both the environmental conditions that favor malaria transmission and the susceptibility of a population to the disease.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The malaria-prone is a dangerous disease.","correct":"✓ Malaria is a dangerous disease in malaria-prone areas.","note":"\"Malaria-prone\" is an adjective and should be used to describe a noun, such as \"area\" or \"region.\""},{"incorrect":"✗ He is malaria-prone because he doesn't use mosquito nets.","correct":"✓ He is at risk of malaria because he doesn't use mosquito nets.","note":"While you can say someone lives in a malaria-prone area, saying someone *is* malaria-prone usually implies a biological susceptibility, not just a behavioral risk."}],"priority":"★☆☆"},"related_words":{"derivatives":["prone","malaria","malarious","malaria-free"],"related_terms":["endemic","epidemic","vector-borne disease","mosquito-borne disease","public health"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - typically used in specialized contexts (medical, public health).","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"malaria-prone\" is a specialized term used in the context of public health and medicine. It describes an area or population that is likely to be affected by malaria. Understanding this term requires knowledge of both the disease malaria and the general meaning of \"prone\" (likely to experience or suffer from something). It is more commonly encountered in scientific articles, health reports, and discussions about global health issues."},"example_sentences":[{"sentence":"The government is implementing new strategies to combat malaria in malaria-prone regions.","translation":"政府は、マラリアが発生しやすい地域でマラリアと闘うための新しい戦略を実施している。","type":"adjective","meaning_category":"area at risk"},{"sentence":"Individuals with weakened immune systems are more malaria-prone.","translation":"免疫システムが弱い人は、マラリアにかかりやすい。","type":"adjective","meaning_category":"susceptible to malaria"},{"sentence":"This study focuses on identifying the factors that make certain communities more malaria-prone than others.","translation":"この研究は、特定のコミュニティが他のコミュニティよりもマラリアにかかりやすい要因を特定することに焦点を当てている。","type":"adjective","meaning_category":"susceptible to malaria"}]}