{"word":"ferality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"野生状態、野性味、野蛮さ","english_definition":"The state or condition of being feral; wildness; savagery.","examples":[{"sentence":"The ferality of the abandoned dogs was evident in their aggressive behavior.","translation":"その捨て犬たちの野性味は、彼らの攻撃的な行動に明らかだった。"},{"sentence":"The child's ferality was a result of being raised in isolation from human contact.","translation":"その子供の野性味は、人間との接触から隔離されて育った結果だった。"},{"sentence":"The researchers studied the ferality of the reintroduced wolves.","translation":"研究者たちは、再導入されたオオカミの野生状態を研究した。"}],"collocations":["exhibit ferality (野性味を示す)","degree of ferality (野性味の度合い)","study ferality (野性味を研究する)","human ferality (人間の野性)"],"synonyms":["wildness","savagery","untamedness","uncivilized state","barbarity"],"antonyms":["domesticity","tameness","civilization","cultivation"]}],"etymology":{"value":"Derived from 'feral,' which comes from Latin 'feralis,' meaning 'relating to the dead' or 'savage.' The connection to 'the dead' is through the idea of wild animals being associated with death and the wilderness.","priority":"★★☆"},"pronunciation":{"ipa":"/fəˈrælɪti/","syllables":"fe-ral-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Ferality' refers to the state of being feral, meaning existing in a wild or untamed state, especially after having escaped from domestication. It can describe the behavior, appearance, or condition of an animal or, less commonly, a human. It often implies a lack of socialization or adaptation to human environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The ferality of the garden was beautiful.","correct":"The wildness of the garden was beautiful.","note":"'Ferality' is generally used to describe animals or humans that have reverted to a wild state. For plants or landscapes, 'wildness' is more appropriate."},{"incorrect":"He had a ferality for sports.","correct":"He had a passion for sports.","note":"'Ferality' is not used to describe enthusiasm or passion. Use 'passion,' 'enthusiasm,' or similar words instead."}],"priority":"★★☆"},"related_words":{"derivatives":["feral (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ferality' is a relatively uncommon word that describes the state of being feral, meaning wild or untamed, especially after having been domesticated. It is often used in scientific or academic contexts when discussing animals that have returned to a wild state or humans who have grown up without socialization. Understanding this word requires a good vocabulary and an understanding of abstract concepts related to nature and civilization."},"example_sentences":[{"sentence":"The island was overrun by feral cats, their ferality posing a threat to native bird populations.","translation":"その島は野良猫で溢れかえっており、彼らの野性味が在来の鳥類の個体数に脅威を与えていた。","type":"noun","meaning_category":"wildness"},{"sentence":"The anthropologist studied the ferality of children raised in the wilderness.","translation":"人類学者は、荒野で育った子供たちの野性味を研究した。","type":"noun","meaning_category":"untamedness"},{"sentence":"The ferality of the landscape made it difficult to traverse.","translation":"その景観の野性味が、横断を困難にしていた。","type":"noun","meaning_category":"wildness"}]}