{"word":"minoring","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(大学などで)副専攻する","english_definition":"pursuing a minor course of study at a college or university.","examples":[{"sentence":"She is minoring in French while majoring in Biology.","translation":"彼女は生物学を専攻しながら、フランス語を副専攻している。"},{"sentence":"Many students choose to minor in a subject that complements their major.","translation":"多くの学生は、専攻を補完する科目を副専攻として選択する。"}],"collocations":["minor in (a subject)"],"synonyms":["studying as a minor","taking a minor in"],"antonyms":["majoring"]},{"part_of_speech":"noun","definition":"副専攻","english_definition":"The act of pursuing a minor course of study.","examples":[{"sentence":"Minoring in history can broaden your understanding of current events.","translation":"歴史を副専攻することで、最近の出来事に対する理解を深めることができる。"}],"collocations":[],"synonyms":["minor study"],"antonyms":["major"]}],"etymology":{"value":"The word \"minoring\" is derived from the word \"minor,\" which comes from the Latin word \"minor,\" meaning \"smaller\" or \"lesser.\" In an academic context, it refers to a secondary field of study that is smaller or less emphasized than the major.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmaɪnərɪŋ/","syllables":"mi-nor-ing"},"inflection":{"verb_forms":{"present_participle":"minoring","past_simple":"minored","past_participle":"minored","present_simple":["minor","minors"]}},"usage_notes":{"explanation":"\"Minoring\" refers to the act of studying a secondary academic subject at a college or university. It is less intensive than a major and is often chosen to complement or broaden a student's primary area of study. The term is primarily used in the context of higher education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am minoring of history.","correct":"✓ I am minoring in history.","note":"The correct preposition to use with \"minoring\" is \"in.\" You minor *in* a subject."},{"incorrect":"✗ He is minoring a major in biology.","correct":"✓ He is majoring in biology and minoring in chemistry.","note":"The terms \"major\" and \"minor\" refer to different levels of focus. You major *in* one subject and minor *in* another."}],"priority":"★★☆"},"related_words":{"derivatives":["minor (noun, adjective)","minority (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"minoring\" is used in the context of higher education to describe the act of studying a secondary subject, known as a minor. It is less common than the term \"majoring\" and is typically used when discussing academic pursuits at a college or university level. Understanding this term requires familiarity with the structure of academic programs in higher education.","priority":"★★☆"},"example_sentences":[{"sentence":"She decided on minoring in art history to complement her architecture degree.","translation":"彼女は建築の学位を補完するために、美術史を副専攻することに決めた。","type":"verb","meaning_category":"副専攻する"},{"sentence":"Minoring in a foreign language can be a valuable asset in today's global economy.","translation":"外国語を副専攻することは、今日のグローバル経済において貴重な財産となり得る。","type":"noun","meaning_category":"副専攻"}]}