{"word":"deiparous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"一度の出産で一子以上を産む、多産性の","english_definition":"Bearing more than one offspring at a birth; multiparous.","examples":[{"sentence":"Deiparous animals often have shorter gestation periods.","translation":"多産性の動物はしばしば妊娠期間が短い。"},{"sentence":"The deiparous nature of rabbits contributes to their rapid population growth.","translation":"ウサギの多産性という性質が、その急速な個体数増加に貢献している。"}],"collocations":["deiparous animals","deiparous mammals","deiparous species"],"synonyms":["multiparous","prolific","fecund"],"antonyms":["uniparous","monoparous"]}],"etymology":{"value":"Derived from Latin 'deus' (god) + 'parere' (to bring forth, give birth), suggesting divine or abundant birth. However, the actual etymology is a blend of 'di-' (two) + '-parous' (bearing), indicating multiple births.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈɪpərəs/","syllables":"di-ip-a-rous"},"inflection":{"notes":"Comparative and superlative forms are not typically used for this adjective."},"usage_notes":{"explanation":"'Deiparous' is a relatively uncommon term, primarily used in biological or zoological contexts to describe animals that give birth to multiple offspring in a single birth event. It is often used in contrast to 'uniparous' or 'monoparous,' which describe animals that typically give birth to only one offspring at a time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deiparous woman gave birth to twins.","correct":"✓ The deiparous animal gave birth to twins.","note":"'Deiparous' is generally used to describe animals, not humans. While humans can have multiple births, 'deiparous' is not the standard term for describing human pregnancies or births."}],"priority":"★☆☆"},"related_words":{"derivatives":["deiparity (noun: the state of being deiparous)"],"phrasal_verbs":[],"related_terms":["uniparous","monoparous","multiparous","viviparous","oviparous"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deiparous' is a technical term used in biology and zoology. It describes animals that give birth to multiple offspring in a single birth event. Understanding this word requires familiarity with scientific vocabulary related to reproduction and animal biology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Many rodents are naturally **deiparous**, producing litters of several pups at a time.","translation":"多くの齧歯類は自然に多産性であり、一度に数匹の子を産む。","type":"adjective","meaning_category":"多産性の"},{"sentence":"The **deiparous** nature of certain fish species allows for rapid population recovery after environmental disturbances.","translation":"特定の魚種の多産性という性質は、環境の混乱後の急速な個体数回復を可能にする。","type":"adjective","meaning_category":"多産性の"}]}