{"word":"Peritonism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腹膜刺激症状（腹膜炎はないものの、腹膜が刺激されている状態）","english_definition":"A condition resembling peritonitis but without inflammation of the peritoneum. It is characterized by abdominal pain, tenderness, and muscle guarding.","examples":[{"sentence":"The patient presented with signs of peritonism, but imaging ruled out peritonitis.","translation":"患者は腹膜刺激症状を呈したが、画像検査で腹膜炎は除外された。"},{"sentence":"Peritonism can be caused by various underlying conditions, such as appendicitis or pelvic inflammatory disease.","translation":"腹膜刺激症状は、虫垂炎や骨盤内炎症性疾患などの様々な基礎疾患によって引き起こされる可能性がある。"}],"collocations":["signs of peritonism","cause of peritonism","diagnose peritonism","rule out peritonitis"],"synonyms":["abdominal guarding","rebound tenderness","abdominal rigidity"],"antonyms":[]}],"etymology":{"value":"'Peritonism' is derived from 'peritoneum' (the membrane lining the abdominal cavity) and '-ism' (a condition or state). It indicates a condition mimicking peritonitis.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪtəˈnɪzəm/","syllables":"pe-ri-to-nizm"},"inflection":{"noun_plural":"peritonisms"},"usage_notes":{"explanation":"'Peritonism' is a clinical sign, not a disease itself. It indicates irritation of the peritoneum, which can be caused by various conditions. It's important to differentiate it from peritonitis, which involves actual inflammation of the peritoneum.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has peritonitis, which is a type of peritonism.","correct":"✓ The patient has peritonism, but further tests are needed to rule out peritonitis.","note":"Peritonism is a set of signs mimicking peritonitis, but it is not a type of peritonitis. It needs to be differentiated from peritonitis. "},{"incorrect":"✗ Peritonism is always caused by infection.","correct":"✓ Peritonism can be caused by various factors, including inflammation or irritation, but not always infection.","note":"Peritonism can be caused by various factors, including chemical irritation, inflammation, or even referred pain. It is not always caused by infection."}],"priority":"★★☆"},"related_words":{"derivatives":["peritoneum","peritonitis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peritonism' is a medical term used to describe clinical signs that resemble peritonitis (inflammation of the peritoneum) but without the actual inflammation. It's characterized by abdominal pain, tenderness, and guarding. The term is primarily used in medical contexts by healthcare professionals. "},"example_sentences":[{"sentence":"The doctor suspected peritonitis due to the patient's peritonism, but imaging was inconclusive.","translation":"医師は患者の腹膜刺激症状から腹膜炎を疑ったが、画像検査では結論が出なかった。","type":"medical","meaning_category":"腹膜刺激症状"},{"sentence":"Peritonism can be a diagnostic challenge, as it can mimic other abdominal conditions.","translation":"腹膜刺激症状は他の腹部疾患に似ているため、診断が難しい場合がある。","type":"medical","meaning_category":"腹膜刺激症状"}]}