{"word":"slime-washed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Covered or coated with slime; having the appearance of being washed with slime.","english_definition":"Covered or coated with slime; appearing as if washed with slime.","examples":[{"sentence":"The rocks near the polluted river were slime-washed and slippery.","translation":"汚染された川の近くの岩は、ぬるぬるしたもので覆われ、滑りやすかった。"},{"sentence":"The abandoned building had a slime-washed look due to the damp conditions and mold growth.","translation":"その廃墟は、湿気とカビのせいで、ぬるぬるしたもので覆われたような外観をしていた。"}],"collocations":["slime-washed rocks","slime-washed surface","slime-washed appearance"],"synonyms":["slime-covered","slimy","mucous-coated"],"antonyms":["clean","pristine","unsoiled"]}],"etymology":{"value":"Combination of 'slime' (a slippery, mucous substance) and 'washed' (past participle of 'wash', meaning to cleanse or cover with liquid).","priority":"N/A"},"pronunciation":{"ipa":"/ˈslaɪmˌwɒʃt/","syllables":"slime-washed"},"inflection":{"notes":"Adjective; no comparative or superlative forms typically used."},"usage_notes":{"explanation":"The term 'slime-washed' is descriptive, often used to convey a sense of uncleanliness, decay, or pollution. It vividly depicts a surface or object that appears to have been coated or 'washed' with a layer of slime.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The slime-washed car looked brand new.","correct":"✓ The slime-covered car looked old and neglected.","note":"'Slime-washed' implies a dirty or neglected state, not a new one."}],"priority":"N/A"},"related_words":{"derivatives":["slime","washed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; not a common term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Slime-washed' is a descriptive adjective combining the concepts of 'slime' (a slippery, often unpleasant substance) and 'washed' (covered with liquid). It suggests that something has been coated in slime, often implying a negative condition like decay or pollution. Due to its specific and somewhat uncommon nature, it is more likely to be encountered in descriptive writing at a higher reading level."},"example_sentences":[{"sentence":"The old well had a slime-washed interior, making it unsafe to draw water from.","translation":"その古い井戸の内部はぬるぬるしたもので覆われており、水を汲むのは危険だった。","type":"adjective","meaning_category":"Covered in slime"},{"sentence":"After the flood, the entire town had a slime-washed appearance.","translation":"洪水の後、町全体がぬるぬるしたもので覆われたような外観になった。","type":"adjective","meaning_category":"Appearance of being washed with slime"}]}