{"word":"adriamycin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ドキソルビシン：抗がん剤の一種","english_definition":"An anthracycline antibiotic used as a chemotherapy medication; also known as doxorubicin.","examples":[{"sentence":"Adriamycin is used to treat various types of cancer.","translation":"アドリアマイシンは様々な種類のがんの治療に使われる。"},{"sentence":"The side effects of adriamycin can be severe.","translation":"アドリアマイシンの副作用は重度になることがある。"}],"collocations":["adriamycin chemotherapy","adriamycin side effects","adriamycin treatment"],"synonyms":["doxorubicin"],"antonyms":[]}],"etymology":{"value":"Adriamycin is derived from the name of the Adriatic Sea region in Italy, where the *Streptomyces peucetius* bacteria that produces the drug was originally found. The suffix '-mycin' indicates that it is an antibiotic.","priority":"★★☆"},"pronunciation":{"ipa":"ˌeɪdriəˈmaɪsɪn","syllables":"a-dri-a-my-cin"},"inflection":{"noun_plural":"adriamycins"},"usage_notes":{"explanation":"Adriamycin is a powerful chemotherapy drug used to treat a variety of cancers. It is an anthracycline antibiotic, meaning it interferes with the DNA of cancer cells, preventing them from growing and multiplying. However, it can also damage healthy cells, leading to significant side effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is taking adriamycins for his cancer.","correct":"✓ He is taking adriamycin for his cancer.","note":"Adriamycin is often used as a non-count noun, referring to the drug in general. While 'adriamycins' is a valid plural form, it is less common and typically used when referring to different formulations or derivatives of the drug."}],"priority":"★★☆"},"related_words":{"derivatives":["doxorubicin"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Adriamycin is a specialized term exclusively used in the context of oncology and pharmacology. It refers to a specific chemotherapy drug, doxorubicin, and is unlikely to be encountered outside of medical or scientific literature and discussions. Understanding its function and potential side effects requires a background in biology or medicine.","priority":"★☆☆"},"example_sentences":[{"sentence":"The oncologist prescribed adriamycin as part of the patient's treatment plan.","translation":"腫瘍医は患者の治療計画の一部としてアドリアマイシンを処方した。","type":"noun","meaning_category":"抗がん剤"},{"sentence":"Cardiotoxicity is a potential long-term side effect of adriamycin.","translation":"心毒性はアドリアマイシンの潜在的な長期的な副作用である。","type":"noun","meaning_category":"抗がん剤"},{"sentence":"Adriamycin works by interfering with the DNA of cancer cells.","translation":"アドリアマイシンは、がん細胞のDNAを阻害することによって作用する。","type":"noun","meaning_category":"抗がん剤"}]}