{"word":"burleycue","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国俗語) バレスク、軽演劇、ストリップショー","english_definition":"(US, informal) A variety show, typically including striptease acts and broad comedy; a burlesque show.","examples":[{"sentence":"They went to see a burleycue downtown.","translation":"彼らはダウンタウンにバレスクを見に行った。"},{"sentence":"The old theater used to host burleycue shows every weekend.","translation":"その古い劇場は、毎週末バレスクショーを開催していた。"}],"collocations":["burleycue show","old-time burleycue"],"synonyms":["burlesque","variety show","striptease show"],"antonyms":[]},{"part_of_speech":"adjective","definition":"バレスク風の、軽演劇の","english_definition":"Relating to or characteristic of burlesque shows.","examples":[{"sentence":"The burleycue dancers wore elaborate costumes.","translation":"バレスクのダンサーたちは手の込んだ衣装を着ていた。"},{"sentence":"The comedian told burleycue jokes.","translation":"そのコメディアンはバレスク風のジョークを言った。"}],"collocations":["burleycue dancer","burleycue humor"],"synonyms":["burlesque"],"antonyms":[]}],"etymology":{"value":"A variant of 'burlesque,' influenced by the pronunciation of certain regional dialects. The term gained popularity in the early 20th century in the United States to specifically refer to a type of variety show featuring striptease.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrliˌkjuː/","syllables":"bur-ley-cue"},"inflection":{"noun_plural":"burleycues"},"usage_notes":{"explanation":"'Burleycue' is an older, somewhat dated term for burlesque, particularly the type of burlesque that featured striptease. While 'burlesque' itself can refer to a form of satire or parody, 'burleycue' almost exclusively refers to the variety show format with striptease elements. The term is less common now, with 'burlesque' being the more widely used term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The burleycue was a serious drama.","correct":"✓ The burleycue was a comedic performance with striptease.","note":"Burleycue is associated with comedy and striptease, not serious drama."}],"priority":"★☆☆"},"related_words":{"derivatives":["burlesque"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Burleycue' is a relatively obscure term, primarily used in historical contexts to refer to a specific type of burlesque show featuring striptease. It is not commonly used in modern English. Understanding requires familiarity with the history of American entertainment.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old vaudeville circuit included many stops for burleycue shows.","translation":"昔のヴォードヴィル巡業には、多くのバレスクショーの公演場所が含まれていた。","type":"noun","meaning_category":"バレスク"},{"sentence":"The costumes were typical of burleycue, with feathers and sequins.","translation":"その衣装は、羽とスパンコールを使った典型的なバレスク風だった。","type":"adjective","meaning_category":"バレスク風の"}]}