{"word":"trailing-point","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(鉄道) 渡り線の分岐器において、列車が分岐器を通過する際に、分岐器のトングレールが列車の進行方向に対して後ろに位置する状態。","english_definition":"(Rail transport) A turnout or switch where the train passes through the frog before reaching the points. The points are 'trailing' relative to the direction of travel.","examples":[{"sentence":"The train passed through the trailing-point without incident.","translation":"列車は問題なく渡り線の分岐器を通過した。"},{"sentence":"Trailing-point movements are generally safer than facing-point movements.","translation":"一般的に、渡り線の分岐器を通過する動きは、対向する分岐器を通過する動きよりも安全である。"}],"collocations":["trailing-point movement","trailing-point turnout","trailing-point switch"],"synonyms":["following-point"],"antonyms":["facing-point"]},{"part_of_speech":"adjective","definition":"(鉄道) 渡り線の分岐器に関連して、列車が分岐器を通過する際に、分岐器のトングレールが列車の進行方向に対して後ろに位置する状態を表す。","english_definition":"(Rail transport) Describing a turnout or switch where the train passes through the frog before reaching the points. The points are 'trailing' relative to the direction of travel.","examples":[{"sentence":"The trailing-point configuration of the turnout allowed for smoother train operation.","translation":"渡り線の分岐器の構成により、列車の運行がよりスムーズになった。"}],"collocations":["trailing-point configuration","trailing-point design"],"synonyms":["following-point"],"antonyms":["facing-point"]}],"etymology":{"value":"The term 'trailing-point' is derived from the fact that the points (switch blades) are 'trailing' behind the direction of the train's movement as it passes through the turnout.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtreɪlɪŋ pɔɪnt/","syllables":"trail-ing point"},"inflection":{"notes":"This word is a compound noun, and its form does not change for pluralization. It can also be used as an adjective."},"usage_notes":{"explanation":"'Trailing-point' is a railway term that describes a specific configuration of a turnout or switch. When a train passes through a trailing-point, the wheels encounter the frog (the point where the rails cross) before they reach the switch blades. This is in contrast to a 'facing-point,' where the wheels encounter the switch blades first. Trailing-points are generally considered safer because a train is less likely to be diverted onto the wrong track if the switch is not properly set.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The train approached the facing-point from the trailing direction.","correct":"The train approached the trailing-point.","note":"Facing-point and trailing-point describe the configuration of the switch, not the direction of travel. A train approaches either a facing-point or a trailing-point."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["facing-point","turnout","switch","points","frog","railroad switch"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C2","text":"The term 'trailing-point' is a specialized term used in the context of railway engineering and operations. Understanding its meaning requires familiarity with the components of a railroad switch (turnout) and the different ways a train can traverse it. The concept is best understood in contrast to 'facing-point,' which represents the opposite configuration. Due to its technical nature, this term is unlikely to be encountered outside of specific professional or enthusiast contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The trailing-point allowed the train to merge onto the main line.","translation":"渡り線により、列車は本線に合流することができた。","type":"noun","meaning_category":"railway"},{"sentence":"The design incorporated a trailing-point configuration for increased safety.","translation":"安全性を高めるため、設計には渡り線の構成が組み込まれた。","type":"adjective","meaning_category":"railway"}]}