{"word":"porphyrized","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(岩石などを)斑岩状組織にする；(比喩的に)硬直させる、石のようにする","english_definition":"To cause to resemble porphyry in texture; to render hard or stony.","examples":[{"sentence":"The lava was porphyrized by rapid cooling.","translation":"溶岩は急速な冷却によって斑岩状組織になった。"},{"sentence":"His face was porphyrized by years of hardship.","translation":"彼の顔は長年の苦難によって石のように硬直していた。"}],"collocations":[],"synonyms":["petrified","ossified","hardened"],"antonyms":[],"notes":"This word is relatively rare and often used in geological or literary contexts."}],"etymology":{"value":"Derived from 'porphyry,' a type of igneous rock with large crystals embedded in a fine-grained matrix. The suffix '-ize' indicates the process of making something resemble porphyry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːrfəraɪzd/","syllables":"por-phy-rized"},"inflection":{"verb_forms":{"present_simple":["porphyrize","porphyrizes"],"past_simple":"porphyrized","past_participle":"porphyrized","present_participle":"porphyrizing"}},"usage_notes":{"explanation":"'Porphyrized' is primarily used in geology to describe the texture of rocks that have undergone a specific cooling process, resulting in a porphyritic structure. Figuratively, it can describe something becoming hardened or rigid, often due to emotional or physical stress.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["porphyry (noun)","porphyritic (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'porphyrized' is a technical term, primarily used in geology. It describes a rock texture where large crystals are embedded in a finer-grained matrix, similar to the appearance of porphyry. Figurative use is rare and typically found in advanced literature to describe something becoming hardened or rigid."},"example_sentences":[{"sentence":"The geologist examined the porphyrized basalt sample.","translation":"地質学者は斑岩状組織になった玄武岩のサンプルを調べた。","type":"verb","meaning_category":"geological"},{"sentence":"Years of war had porphyrized his heart, leaving him incapable of empathy.","translation":"長年の戦争が彼の心を硬直させ、共感力を失わせた。","type":"verb","meaning_category":"figurative"}]}