{"word":"desquamated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(皮膚などが)剥離した、脱落した","english_definition":"Having shed the outer layers of a tissue, especially the skin.","examples":[{"sentence":"The patient's skin was dry and desquamated.","translation":"患者の皮膚は乾燥して剥離していた。"},{"sentence":"Desquamated epithelial cells were observed in the sample.","translation":"剥離した上皮細胞がサンプル中に観察された。"}],"collocations":["desquamated skin","desquamated epithelium","desquamated cells"],"synonyms":["shed","peeled","flaked","exfoliated"],"antonyms":[]}],"etymology":{"value":"From Latin 'desquamatus', past participle of 'desquamare' meaning 'to scale off'. 'De-' means 'off' and 'squama' means 'scale'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛskwəˌmeɪtɪd/","syllables":"de-squa-mat-ed"},"inflection":{"notes":"This is the past participle form of the verb 'desquamate', which can also be used as an adjective."},"usage_notes":{"explanation":"'Desquamated' is a technical term primarily used in medical and biological contexts to describe the shedding or peeling off of outer layers of tissue, particularly skin. It's often used when describing a symptom or observation in a clinical setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The snake desquamated its skin.","correct":"✓ The snake shed its skin.","note":"While technically correct, 'desquamated' is less common in general use. 'Shed' is preferred for snakes and similar animals. 'Desquamated' is more often used in medical or scientific contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["desquamate (verb): to shed the outer layers of a tissue","desquamation (noun): the shedding of the outer layers of a tissue"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Desquamated' is a highly specialized term typically encountered in medical or biological texts. It refers to the process where the outer layers of a tissue, especially skin, peel off or shed. Due to its specific application, it is not common in everyday language and is more relevant to professionals in healthcare or related scientific fields."},"example_sentences":[{"sentence":"The rash was characterized by intensely itchy, desquamated skin.","translation":"発疹は、激しいかゆみを伴う剥離した皮膚を特徴としていた。","type":"adjective","meaning_category":"medical"},{"sentence":"Microscopic examination revealed numerous desquamated cells in the sample.","translation":"顕微鏡検査により、サンプル中に多数の剥離した細胞が認められた。","type":"adjective","meaning_category":"scientific"}]}