{"word":"Ecclesiography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"教会の記述、教会誌、教会組織の記述","english_definition":"A description of the church, either as a whole or of a particular denomination; a branch of ecclesiastical science.","examples":[{"sentence":"His ecclesiography provided valuable insights into the structure of the early Christian communities.","translation":"彼の教会誌は、初期キリスト教共同体の構造に関する貴重な洞察を提供した。"},{"sentence":"The book is an ecclesiography of the various religious movements in the region.","translation":"その本は、その地域の様々な宗教運動の教会誌である。"}],"collocations":["historical ecclesiography","comparative ecclesiography","modern ecclesiography"],"synonyms":["church history","ecclesiology","religious studies"],"antonyms":[]}],"etymology":{"value":"From ecclesiastical + -graphy.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌkliːziˈɒɡrəfi/","syllables":"Ec-cle-si-og-ra-phy"},"inflection":{"noun_plural":"Ecclesiographies"},"usage_notes":{"explanation":"Ecclesiography is a descriptive science, focusing on the observable characteristics and organization of churches. It differs from ecclesiology, which is more theological and concerned with the nature and purpose of the church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied ecclesiography to become a priest.","correct":"✓ He studied theology to become a priest.","note":"Ecclesiography is the study of church organization, not the training for priesthood, which falls under theology."}],"priority":"★☆☆"},"related_words":{"derivatives":["ecclesiographer (noun)","ecclesiographic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Ecclesiography is a specialized term related to the descriptive study of churches, their organization, and history. It is not commonly used in everyday language and is more likely to be encountered in academic or theological contexts."},"example_sentences":[{"sentence":"The professor specialized in the ecclesiography of medieval monasteries.","translation":"その教授は中世の修道院の教会誌を専門としていた。","type":"noun","meaning_category":"教会の記述"},{"sentence":"Her research contributed significantly to the ecclesiography of Protestant denominations in America.","translation":"彼女の研究は、アメリカのプロテスタント教派の教会誌に大きく貢献した。","type":"noun","meaning_category":"教会の記述"}]}