{"word":"Carbonification","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"炭化（作用）、炭化作用","english_definition":"The process of converting organic matter into carbon or a carbon-containing residue through destructive distillation or incomplete combustion.","examples":[{"sentence":"The carbonification of plant matter over millions of years leads to the formation of coal.","translation":"植物性物質が数百万年かけて炭化することで、石炭が形成される。"},{"sentence":"During pyrolysis, biomass undergoes carbonification to produce biochar.","translation":"熱分解中、バイオマスは炭化作用を受け、バイオ炭を生成する。"}],"collocations":["incomplete carbonification","rapid carbonification","slow carbonification","artificial carbonification","natural carbonification"],"synonyms":["charring","pyrolysis","coalification","carbonization"],"antonyms":["combustion","oxidation","mineralization"]}],"etymology":{"value":"Derived from 'carbon' (炭素) + '-ification' (～化).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrbənɪfɪˈkeɪʃən/","syllables":"car-bon-i-fi-ca-tion"},"inflection":{"noun_plural":"carbonifications"},"usage_notes":{"explanation":"'Carbonification' refers to the process where organic material is converted into carbon or a carbon-rich substance. This typically happens through heating or incomplete burning, leaving behind a carbonaceous residue. It's often used in scientific and industrial contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The carbonification was made by oxygen.","correct":"✓ The carbonification was achieved through a lack of oxygen.","note":"Carbonification typically occurs in the absence or near-absence of oxygen. Combustion involves oxygen."},{"incorrect":"✗ Carbonification is the same as combustion.","correct":"✓ Carbonification is different from combustion.","note":"Combustion is burning with oxygen, while carbonification is the process of becoming carbon-rich, often without complete burning."}],"priority":"★★★"},"related_words":{"derivatives":["carbonify (verb)","carbonaceous (adjective)"],"related_terms":["coalification","pyrolysis","biochar","carbonization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carbonification' is a technical term used in chemistry, geology, and materials science to describe the process by which organic matter is converted into carbon or a carbon-rich material. It's often associated with the formation of fossil fuels or the production of biochar. Understanding this term requires a good grasp of scientific vocabulary and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient forest underwent carbonification, eventually forming a vast coal deposit.","translation":"古代の森林は炭化作用を受け、最終的に広大な石炭鉱床を形成した。","type":"scientific"},{"sentence":"The process of carbonification is crucial in the production of high-quality biochar.","translation":"炭化のプロセスは、高品質のバイオ炭の製造において非常に重要である。","type":"industrial"},{"sentence":"Scientists are studying the carbonification of plastics as a method of carbon sequestration.","translation":"科学者たちは、炭素隔離の方法としてプラスチックの炭化を研究している。","type":"environmental"}]}