{"word":"stereospecificity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"立体特異性：特定の立体異性体のみが反応するか、または特定の立体異性体のみを生成する化学反応の性質","english_definition":"The property of a chemical reaction mechanism that leads to different stereoisomeric reaction products from different stereoisomeric reactants, or which operates on only one (or a subset) of the stereoisomers.","examples":[{"sentence":"The enzyme exhibits high stereospecificity in catalyzing the reaction.","translation":"その酵素は、反応を触媒する際に高い立体特異性を示す。"},{"sentence":"Stereospecificity is crucial in the synthesis of chiral drugs.","translation":"立体特異性は、キラル医薬品の合成において重要である。"}],"collocations":["high stereospecificity","stereospecific reaction","stereospecific synthesis"],"synonyms":["enantioselectivity","diastereoselectivity"],"antonyms":["stereoselectivity (broader term)","non-stereospecificity"]}],"etymology":{"value":"'Stereo-' (立体) + 'specificity' (特異性)。立体化学における特定の異性体に対する反応の特異性を示す合成語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌstɪəriːəʊspesɪˈfɪsɪti/","syllables":"ste-re-o-spe-ci-fi-ci-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Stereospecificity is a term used in stereochemistry to describe reactions where the stereochemical outcome is dependent on the stereochemical configuration of the reactants. A stereospecific reaction will convert a single reactant into a single stereoisomer of a product. If the starting material is chiral, the reaction will proceed with complete retention or inversion of configuration. It is a stricter term than stereoselectivity, which refers to reactions where one stereoisomer is formed in preference over others, but not exclusively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction is stereoselective, so it's also stereospecific.","correct":"✓ The reaction is stereospecific, therefore it is also stereoselective.","note":"Stereospecificity implies stereoselectivity, but not vice versa. A stereospecific reaction is always stereoselective, but a stereoselective reaction is not necessarily stereospecific."}],"priority":"★★☆"},"related_words":{"derivatives":["stereospecific (adjective)","stereoselectivity (noun - related but broader concept)","stereoisomer (noun)","chiral (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stereospecificity' is a technical term used in chemistry, particularly in organic chemistry and biochemistry. It describes a reaction where the stereochemical outcome (the spatial arrangement of atoms in the product) is determined by the stereochemistry of the reactants. In simpler terms, it means that different starting molecules with different spatial arrangements will lead to different products with specific spatial arrangements. It's important in areas like drug synthesis, where the spatial arrangement of a molecule can greatly affect its biological activity."},"example_sentences":[{"sentence":"The Diels-Alder reaction can be highly stereospecific under certain conditions.","translation":"ディールス・アルダー反応は、特定の条件下で高い立体特異性を示すことがある。","type":"example","meaning_category":"general"},{"sentence":"Enzymes often catalyze reactions with remarkable stereospecificity.","translation":"酵素はしばしば驚くべき立体特異性で反応を触媒する。","type":"example","meaning_category":"enzymatic reactions"},{"sentence":"The stereospecificity of the reaction is determined by the catalyst used.","translation":"反応の立体特異性は、使用される触媒によって決定される。","type":"example","meaning_category":"catalysis"}]}