{"word":"ligninsulphonate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リグニンスルホン酸塩","english_definition":"A water-soluble anionic polyelectrolyte polymer derived from lignin, a complex polymer found in wood. Lignosulfonates are byproducts of the sulfite pulping process. They are used in a wide variety of applications, including as dispersants, binders, and complexing agents.","examples":[{"sentence":"Ligninsulphonate is used as a dust suppressant on roads.","translation":"リグニンスルホン酸塩は、道路の防塵剤として使用されます。"},{"sentence":"Ligninsulphonate can be used as a dispersant in concrete mixtures.","translation":"リグニンスルホン酸塩は、コンクリート混合物中の分散剤として使用できます。"}],"collocations":["ligninsulphonate dispersant","calcium ligninsulphonate","sodium ligninsulphonate"],"synonyms":["lignosulfonate","sulfonated lignin"],"antonyms":[]}],"etymology":{"value":"Derived from 'lignin' (a complex polymer in wood) + 'sulphonate' (a salt or ester of sulfonic acid).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪɡnɪnˈsʌlfəneɪt/","syllables":"lig-nin-sul-pho-nate"},"inflection":{"noun_plural":"ligninsulphonates"},"usage_notes":{"explanation":"Ligninsulphonates are typically used in industrial applications due to their ability to modify the properties of various materials. They are valued for their low cost and availability as a byproduct of the paper pulping industry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ lignosulfonate is use for...","correct":"✓ lignosulfonate is used for...","note":"Ensure correct verb conjugation. 'Used' is the past participle form, appropriate for passive voice."}],"priority":"★★☆"},"related_words":{"derivatives":["lignin","sulfonate","sulfonic acid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ligninsulphonate' is a technical term primarily used in chemistry, engineering, and industrial contexts. Understanding requires familiarity with polymer chemistry and industrial processes like paper pulping. The word is not commonly encountered in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The addition of ligninsulphonate improved the flow properties of the cement slurry.","translation":"リグニンスルホン酸塩の添加により、セメントスラリーの流動性が向上しました。","type":"noun","meaning_category":"chemical additive"},{"sentence":"Ligninsulphonate is an environmentally friendly alternative to some synthetic dispersants.","translation":"リグニンスルホン酸塩は、一部の合成分散剤の環境に優しい代替品です。","type":"noun","meaning_category":"environmentally friendly material"}]}