{"word":"heredity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"遺伝、遺伝的形質","english_definition":"the passing on of physical or mental characteristics genetically from one generation to another.","examples":[{"sentence":"Eye color is determined by heredity.","translation":"目の色は遺伝によって決まる。"},{"sentence":"Heredity plays a significant role in the development of certain diseases.","translation":"遺伝は特定の病気の発症に重要な役割を果たす。"},{"sentence":"The study of heredity is a key aspect of genetics.","translation":"遺伝の研究は遺伝学の重要な側面である。"}],"collocations":["heredity and environment (遺伝と環境)","laws of heredity (遺伝の法則)","role of heredity (遺伝の役割)","study of heredity (遺伝の研究)","influence of heredity (遺伝の影響)"],"synonyms":["inheritance","genes","genetic makeup","ancestry","descent"],"antonyms":["environment","nurture","acquired characteristics"]}],"etymology":{"value":"Late Middle English: from Old French heridite, from Latin hereditas, from heres ‘heir’.","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈrɛdɪti/","syllables":"he-red-i-ty"},"inflection":{"noun_plural":"heredities (まれに)"},"usage_notes":{"explanation":"\"Heredity\" refers to the transmission of traits from parents to offspring. It's a fundamental concept in biology and genetics. It's often discussed in the context of nature versus nurture, where nature refers to inherited traits and nurture refers to environmental influences. While \"heredity\" primarily refers to biological inheritance, it can also be used metaphorically to describe the transmission of cultural or social traits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heredity is responsible for his behavior.","correct":"✓ Heredity is a factor in his behavior.","note":"Heredity is a complex process, and behavior is rarely determined solely by genetics. It's more accurate to say that heredity is a factor or influence."},{"incorrect":"✗ Hereditary is the process of passing traits.","correct":"✓ Heredity is the process of passing traits. / ✓ Inheritance is the process of passing traits.","note":"\"Hereditary\" is an adjective (e.g., \"hereditary disease\"), while \"heredity\" is the noun referring to the process itself. \"Inheritance\" is also a suitable noun."},{"incorrect":"✗ Environment has no effect, it's all heredity.","correct":"✓ Environment also plays a role, it's not all heredity.","note":"It's important to acknowledge that both heredity and environment contribute to the development of traits. It's rarely one or the other."}],"priority":"★★☆"},"related_words":{"derivatives":["hereditary (adjective: 遺伝性の)","inherit (verb: 受け継ぐ)","inheritance (noun: 遺伝、相続)","genetic (adjective: 遺伝子の、遺伝的な)","genetics (noun: 遺伝学)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"中頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Heredity\" is a term used in biology to describe how traits are passed down from parents to their children through genes. It's a key concept in understanding how living things evolve and why family members often share similar characteristics. The word is often used in scientific contexts and discussions about health, genetics, and evolution. It's important to understand that while heredity plays a role in many aspects of our lives, it's not the only factor, as environment and lifestyle also have a significant impact."},"example_sentences":[{"sentence":"Scientists are studying the role of **heredity** in cancer development.","translation":"科学者たちは癌の発症における遺伝の役割を研究している。","type":"noun","meaning_category":"遺伝"},{"sentence":"Mental illness can sometimes be linked to **heredity**.","translation":"精神疾患は時に遺伝と関連付けられることがある。","type":"noun","meaning_category":"遺伝"},{"sentence":"The traits passed down through **heredity** can influence physical appearance.","translation":"遺伝によって受け継がれる形質は外見に影響を与える可能性がある。","type":"noun","meaning_category":"遺伝"}]}