{"word":"quacky","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(アヒルなどの)ガーガー鳴くような","english_definition":"Resembling the sound of a duck; characterized by or making quacking sounds.","examples":[{"sentence":"The toy made a quacky noise when you squeezed it.","translation":"そのおもちゃを握ると、ガーガーという音がした。"},{"sentence":"The recording had a quacky quality, making it hard to understand.","translation":"その録音はガーガーした音質で、聞き取りにくかった。"}],"collocations":["quacky voice","quacky sound","quacky toy"],"synonyms":["quacking","ducklike"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(俗語,軽蔑的)いんちきな、怪しげな、信頼できない","english_definition":"(Slang, derogatory) Dishonest or unreliable; resembling or characteristic of a quack (a person who falsely claims medical skill or knowledge).","examples":[{"sentence":"That doctor sounds a bit quacky to me; I'd get a second opinion.","translation":"その医者は少し怪しい気がする。セカンドオピニオンをもらった方がいい。"},{"sentence":"The website looked quacky, so I didn't enter my credit card information.","translation":"そのウェブサイトは怪しげだったので、クレジットカード情報を入力しなかった。"}],"collocations":["quacky doctor","quacky medicine","quacky website","quacky scheme"],"synonyms":["fraudulent","fake","phony","dubious","suspicious","untrustworthy"],"antonyms":["genuine","authentic","reliable","trustworthy"]}],"etymology":{"value":"Derived from 'quack,' which imitates the sound a duck makes. The sense of 'dishonest' comes from the association of quacking with the loud, boastful claims of fraudulent doctors or salespeople.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwæki/","syllables":"quack-y"},"inflection":{"adjective_forms":{"comparative":"quackier","superlative":"quackiest"}},"usage_notes":{"explanation":"The word 'quacky' has two main meanings. The first refers to something that sounds like a duck's quack. The second, and more commonly used meaning, is a derogatory term for something or someone that is fraudulent or unreliable, often in a medical or scientific context. When used in this sense, it implies that the subject is making false or exaggerated claims.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The quacky duck swam in the pond.","correct":"✓ The quacking duck swam in the pond.","note":"'Quacky' describes the *quality* of the sound, not the action of making the sound. Use 'quacking' to describe a duck that is currently making a quack sound."},{"incorrect":"✗ He was a quacky mechanic, so I took my car elsewhere.","correct":"✓ He was a dodgy mechanic, so I took my car elsewhere.","note":"While 'quacky' can mean untrustworthy, it's often associated with medical or scientific contexts. For a dishonest mechanic, words like 'dodgy', 'unreliable', or 'shady' might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["quack (noun, verb)","quackery (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quacky' is a word that can describe something that sounds like a duck or, more commonly, something that seems fake or untrustworthy. If someone calls a doctor 'quacky,' they mean the doctor seems like a fraud. It's not a very common word, but it's useful to know, especially in informal contexts."},"example_sentences":[{"sentence":"The child's toy duck had a very **quacky** sound.","translation":"その子供のおもちゃのアヒルはとてもガーガー鳴く音がした。","type":"adjective","meaning_category":"duck-like sound"},{"sentence":"I wouldn't trust that website; it looks a bit **quacky**.","translation":"あのウェブサイトは信用しない方がいい。少し怪しげに見える。","type":"adjective","meaning_category":"untrustworthy"}]}