{"word":"vicegerentship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"代理職、代理統治、副官の地位","english_definition":"The position or office of a vicegerent; the exercise of delegated power.","examples":[{"sentence":"He was appointed to the vicegerentship of the province.","translation":"彼はその州の代理統治の地位に任命された。"},{"sentence":"The vicegerentship allowed him to act on behalf of the king.","translation":"代理職によって、彼は王の代理として行動することができた。"}],"collocations":["assume the vicegerentship","hold the vicegerentship","exercise the vicegerentship"],"synonyms":["deputyship","regency","lieutenancy","governorship"],"antonyms":[]}],"etymology":{"value":"From \"vicegerent\" (one who acts in the place of another) + \"-ship\" (a suffix denoting a state, condition, office, or dignity). \"Vicegerent\" comes from Latin \"vicegerens\", present participle of \"vicegerere\" (to act in place of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvaɪsˈdʒɪərəntʃɪp/","syllables":"vice-ger-ent-ship"},"inflection":{"noun_plural":"vicegerentships"},"usage_notes":{"explanation":"\"Vicegerentship\" refers to the office, position, or authority held by a vicegerent. A vicegerent is someone who acts as a deputy or representative of another person, especially a ruler or deity. The term is often used in historical or religious contexts to describe someone who governs or rules on behalf of a higher authority.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had the vicegerent.","correct":"✓ He had the vicegerentship.","note":"\"Vicegerent\" is the person, while \"vicegerentship\" is the position or office. Use the correct noun form to refer to the office itself."}],"priority":"★★☆"},"related_words":{"derivatives":["vicegerent (noun: a person acting as deputy or representative)"],"related_terms":["viceroyalty (noun: the position or territory governed by a viceroy)","regency (noun: the office or period of rule of a regent)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is relatively rare in modern English usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"vicegerentship\" is a formal and relatively rare term. It refers to the position or office held by a vicegerent, who is someone acting as a deputy or representative, often of a ruler or deity. The term is most often encountered in historical, political, or religious contexts. Understanding the word requires familiarity with the concept of delegated authority and representation.","priority":"★★☆"},"example_sentences":[{"sentence":"The transfer of power marked the beginning of his vicegerentship.","translation":"権力の移譲は彼の代理統治の始まりを示した。","type":"general","meaning_category":"代理職"},{"sentence":"During his vicegerentship, he implemented several important reforms.","translation":"彼の代理統治の間、彼はいくつかの重要な改革を実行した。","type":"general","meaning_category":"代理統治"},{"sentence":"The responsibilities of the vicegerentship were considerable.","translation":"代理職の責任は相当なものだった。","type":"general","meaning_category":"代理職"}]}