{"word":"cytophil","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"細胞親和性の、細胞に結合しやすい","english_definition":"Having an affinity for cells; tending to bind to cells.","examples":[{"sentence":"Cytophil antibodies bind strongly to cell surfaces.","translation":"細胞親和性抗体は細胞表面に強く結合する。"},{"sentence":"The cytophil nature of the protein allows it to be easily taken up by cells.","translation":"そのタンパク質の細胞親和性により、細胞に容易に取り込まれる。"}],"collocations":["cytophil antibody","cytophil protein","cytophil binding"],"synonyms":["cell-binding","cell-avid"],"antonyms":["cytophobic","cell-repelling"]}],"etymology":{"value":"Derived from the Greek words 'cyto-' (referring to cells) and '-phil' (meaning 'loving' or 'having an affinity for').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪtəfɪl/","syllables":"cy-to-phil"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are 'more cytophil' and 'most cytophil', respectively."},"usage_notes":{"explanation":"The term 'cytophil' is primarily used in the context of biology and biochemistry, particularly when describing molecules (such as antibodies or proteins) that have a strong tendency to associate with or bind to cells. This property is often crucial for their biological function.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is cytophil to the blood.","correct":"✓ The virus is cytophil for blood cells.","note":"'Cytophil' describes an affinity for cells, so it's more accurate to specify the type of cells (e.g., blood cells) rather than a general substance like 'blood'."},{"incorrect":"✗ Cytophil is a cell.","correct":"✓ Cytophil is a property of some molecules that allows them to bind to cells.","note":"'Cytophil' is an adjective describing a property, not a noun referring to a cell or substance."}],"priority":"★★☆"},"related_words":{"derivatives":["cytophilia (noun: the property of being cytophil)"],"phrasal_verbs":[],"related_terms":["cell adhesion","receptor binding","immunoglobulin","antibody","protein interaction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cytophil' is a specialized term used in biology and biochemistry to describe molecules that have a strong affinity for cells, meaning they tend to bind to cells. This property is important for various biological processes, such as immune responses and cellular uptake of substances. The term is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"IgE antibodies are known for their cytophil nature, particularly their affinity for mast cells and basophils.","translation":"IgE抗体は、特に肥満細胞および好塩基球に対する親和性がある細胞親和性で知られている。","type":"adjective","meaning_category":"cell affinity"},{"sentence":"The researchers investigated the cytophil properties of the novel protein to understand its mechanism of action.","translation":"研究者らは、作用機序を理解するために、新規タンパク質の細胞親和性特性を調査した。","type":"adjective","meaning_category":"cell affinity"},{"sentence":"The cytophil binding of the antibody to the target cells initiated an immune response.","translation":"標的細胞への抗体の細胞親和性結合は、免疫応答を開始した。","type":"adjective","meaning_category":"cell affinity"}]}