{"word":"prequarantine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"隔離前（の状態）、検疫前（の状態）","english_definition":"The period or state of being before a quarantine; actions taken before a quarantine is officially imposed.","examples":[{"sentence":"The government advised prequarantine measures to prevent the spread of the virus.","translation":"政府はウイルスの蔓延を防ぐために、隔離前の対策を推奨した。"},{"sentence":"During the prequarantine period, people stocked up on essential supplies.","translation":"隔離前の期間中、人々は生活必需品を買いだめした。"}],"collocations":["prequarantine measures","prequarantine period","undergo prequarantine"],"synonyms":["pre-isolation","pre-lockdown"],"antonyms":["postquarantine"]},{"part_of_speech":"verb","definition":"隔離前に（自主的に）隔離する、検疫前に（自主的に）検疫する","english_definition":"To self-isolate or take quarantine-like measures before an official quarantine is implemented.","examples":[{"sentence":"We decided to prequarantine ourselves after learning about the outbreak.","translation":"私たちは発生について知った後、自主的に隔離することに決めた。"},{"sentence":"Many travelers chose to prequarantine upon arrival to ensure they were not infected.","translation":"多くの旅行者は、感染していないことを確認するために、到着時に自主的に隔離することを選択した。"}],"collocations":["prequarantine oneself","choose to prequarantine"],"synonyms":["self-isolate","self-quarantine"],"antonyms":["postquarantine"]}],"etymology":{"value":"\"pre-\" (before) + \"quarantine\" (a period of isolation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˈkwɒrənˌtiːn/","syllables":"pre-quar-an-tine"},"inflection":{"noun_plural":"prequarantines","verb_forms":{"present_simple":["prequarantine","prequarantines"],"past_simple":"prequarantined","past_participle":"prequarantined","present_participle":"prequarantining"}},"usage_notes":{"explanation":"\"Prequarantine\" refers to the period or actions taken before an official quarantine is put in place. It often involves voluntary self-isolation or taking precautions to prevent potential spread of illness. The term gained prominence during the COVID-19 pandemic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am prequarantining for two week.","correct":"✓ I am prequarantining for two weeks.","note":"The correct plural form of \"week\" should be used when referring to a duration of more than one week."},{"incorrect":"✗ The prequarantine is very strict.","correct":"✓ The quarantine is very strict. / ✓ The prequarantine measures are very strict.","note":"Unless referring to specific measures, it's more common to use \"quarantine\" when discussing the strictness of isolation protocols. If referring to actions before quarantine, specify \"prequarantine measures\"."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-emptive quarantine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing during and after the COVID-19 pandemic.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"prequarantine\" is a relatively new term, primarily used in the context of public health and disease control. It refers to the period or actions taken before an official quarantine is implemented, often involving voluntary self-isolation. Understanding the term requires a grasp of the prefix \"pre-\" and the concept of quarantine itself. It is most likely to be encountered in news articles, health advisories, or discussions related to pandemic management."},"example_sentences":[{"sentence":"The company implemented a prequarantine policy for employees returning from international travel.","translation":"その会社は、海外旅行から帰国する従業員に対して、隔離前の方針を実施した。","type":"noun","meaning_category":"隔離前の状態"},{"sentence":"To protect her elderly parents, she decided to prequarantine before visiting them.","translation":"高齢の両親を保護するために、彼女は訪問する前に自主的に隔離することにした。","type":"verb","meaning_category":"隔離前に自主的に隔離する"}]}