{"word":"strial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)線条の、線条状の","english_definition":"Relating to or resembling a stria (a small furrow, ridge, or streak).","examples":[{"sentence":"The strial area of the brain is involved in motor control.","translation":"脳の線条領域は運動制御に関与している。"},{"sentence":"Strial patterns were observed in the muscle tissue.","translation":"筋肉組織に線条模様が観察された。"}],"collocations":["strial area","strial patterns","strial cortex"],"synonyms":["striate","striated","striped"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'stria', meaning 'furrow' or 'streak', with the adjectival suffix '-al'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstraɪəl/","syllables":"stri-al"},"inflection":{"notes":"Adjective, comparative and superlative forms are more strial, most strial, though these are rarely used."},"usage_notes":{"explanation":"The term 'strial' is primarily used in anatomical and biological contexts to describe structures or patterns that exhibit linear streaks or ridges. It is often associated with the brain, muscles, or other tissues where such features are prominent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The strial muscle was smooth.","correct":"✓ The strial muscle was striated.","note":"'Strial' is a general term referring to the presence of striae, while 'striated' specifically describes muscles with a striped appearance due to the arrangement of muscle fibers."}],"priority":"★★☆"},"related_words":{"derivatives":["stria (noun: a small furrow, ridge, or streak)","striate (verb: to mark with striae)","striated (adjective: marked with striae)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Strial' is a technical term primarily used in anatomy and biology. It describes something that relates to or resembles a stria, which is a small furrow, ridge, or streak. This word is not commonly used in everyday language and is more likely to be encountered in scientific or medical texts. Understanding this term requires familiarity with anatomical and biological terminology."},"example_sentences":[{"sentence":"The strial arteries supply blood to the basal ganglia.","translation":"線条動脈は基底核に血液を供給する。","type":"adjective","meaning_category":"anatomy"},{"sentence":"Microscopic examination revealed strial formations within the sample.","translation":"顕微鏡検査により、サンプル内に線条構造が明らかになった。","type":"adjective","meaning_category":"biology"}]}