{"word":"noncelestially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"天上的でない方法で、天国に関連しない方法で","english_definition":"In a manner that is not celestial; in a way that is not related to the heavens or the sky.","examples":[{"sentence":"The events on Earth are often explained noncelestially, focusing on earthly causes rather than divine intervention.","translation":"地球上の出来事は、神の介入よりも地上の原因に焦点を当てて、天上的でない方法で説明されることが多いです。"},{"sentence":"The phenomenon was analyzed noncelestially, using purely scientific methods.","translation":"その現象は、純粋に科学的な方法を用いて、天上的でない方法で分析されました。"}],"collocations":["explain noncelestially","analyze noncelestially","interpret noncelestially"],"synonyms":["earthly","mundanely","terrestrially","secularly"],"antonyms":["celestially","heavenly","divinely"]}],"etymology":{"value":"\"non-\" (否定) + \"celestially\" (天上の方法で)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnsɪˈlɛstɪəli/","syllables":"non-ce-les-ti-al-ly"},"inflection":{"notes":"Adverb, no inflections"},"usage_notes":{"explanation":"\"Noncelestially\" is used to describe something that is explained or analyzed without reference to celestial bodies or divine forces. It is often used in scientific or secular contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The music sounded noncelestially.","correct":"✓ The music sounded earthly.","note":"\"Noncelestially\" refers to the method of explanation or analysis, not the quality of sound. Use \"earthly\" or another appropriate adjective to describe the sound."}],"priority":"★★☆"},"related_words":{"derivatives":["celestial","celestially"],"related_forms":["noncelestial (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'noncelestially' is a highly technical term used to describe explanations or analyses that do not involve celestial or heavenly elements. It is rarely used in everyday conversation and is more common in academic or scientific writing. Understanding the root words 'non-' (not) and 'celestial' (relating to the sky or heavens) is essential to grasp its meaning. Due to its rarity and technical nature, it is considered a C2 level word. "},"example_sentences":[{"sentence":"The origin of the crop circles was explained noncelestially, attributing them to human activity rather than extraterrestrial beings.","translation":"ミステリーサークルの起源は、地球外生命体ではなく、人間の活動によるものとして、天上的でない方法で説明されました。","type":"general","meaning_category":"manner of explanation"},{"sentence":"The data was interpreted noncelestially, focusing on terrestrial factors that could have influenced the results.","translation":"データは、結果に影響を与えた可能性のある地上の要因に焦点を当てて、天上的でない方法で解釈されました。","type":"scientific","meaning_category":"method of analysis"}]}