{"word":"down-wash","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(航空) 下方噴流、下方気流","english_definition":"The downward movement of air behind an airfoil, such as a wing.","examples":[{"sentence":"The down-wash from the helicopter made it difficult to stand nearby.","translation":"ヘリコプターからの下方噴流のせいで、近くに立っているのが難しかった。"},{"sentence":"The angle of down-wash affects the stability of the aircraft.","translation":"下方噴流の角度は航空機の安定性に影響を与える。"}],"collocations":["helicopter down-wash","wing down-wash","aircraft down-wash"],"synonyms":["downwash","wake","slipstream"],"antonyms":["upwash"]},{"part_of_speech":"noun","definition":"(気象) 降水によって洗い流されること、洗い流されたもの","english_definition":"The action or effect of rain washing something down, such as soil or pollutants.","examples":[{"sentence":"The heavy rain caused significant down-wash of topsoil into the river.","translation":"大雨により、表土が大量に川に洗い流された。"},{"sentence":"The down-wash carried pollutants from the factory into the nearby lake.","translation":"降水によって、工場からの汚染物質が近くの湖に洗い流された。"}],"collocations":["soil down-wash","pollutant down-wash","rain down-wash"],"synonyms":["runoff","washoff","erosion"],"antonyms":["deposition"]}],"etymology":{"value":"Combination of the words \"down\" and \"wash\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊnˌwɒʃ/","syllables":"down-wash"},"inflection":{"noun_plural":"down-washes"},"usage_notes":{"explanation":"The term \"down-wash\" has two primary meanings depending on the context. In aviation, it refers to the downward movement of air caused by the wings or rotors of an aircraft. In environmental science or meteorology, it refers to the washing down of materials by rain or other precipitation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The downwash was very up.","correct":"✓ The downwash was very strong.","note":"Downwash refers to downward moving air. Describing it as 'up' is contradictory. Use adjectives like 'strong' or 'intense' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["downwash (alternative spelling)"],"phrasal_verbs":[],"related_terms":["upwash","wind shear","turbulence","erosion","runoff"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical contexts)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"down-wash\" is primarily used in two specific contexts: aviation and environmental science. In aviation, it describes the downward flow of air created by the wings or rotors of an aircraft, which is important for understanding aircraft stability and control. In environmental science, it refers to the process by which rain or other precipitation washes materials (like soil or pollutants) downwards, contributing to erosion and water contamination. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The pilot compensated for the down-wash during the landing.","translation":"パイロットは着陸中に下方噴流を補正した。","type":"noun","meaning_category":"aviation"},{"sentence":"The heavy rains caused significant down-wash of fertilizers into the stream.","translation":"大雨により、肥料が大量に小川に洗い流された。","type":"noun","meaning_category":"environmental science"}]}