{"word":"mediodorsally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"正中線に近く、背側に向かって","english_definition":"In a direction that is both medially (toward the midline) and dorsally (toward the back).","examples":[{"sentence":"The structure is located mediodorsally in the brain.","translation":"その構造は脳の正中線に近く、背側に位置している。"},{"sentence":"The muscle fibers run mediodorsally.","translation":"その筋肉繊維は正中線に近く、背側に向かって走っている。"}],"collocations":["located mediodorsally","oriented mediodorsally","extending mediodorsally"],"synonyms":["dorsomedially"],"antonyms":["ventrolaterally"]},{"part_of_speech":"adjective","definition":"正中線に近く、背側にある","english_definition":"Located or oriented in a direction that is both medially (toward the midline) and dorsally (toward the back).","examples":[{"sentence":"The mediodorsal thalamus is involved in memory function.","translation":"内背側視床は記憶機能に関与している。"},{"sentence":"The mediodorsal region of the fin shows a distinct pattern.","translation":"ひれの正中線に近く背側の領域は、明確なパターンを示す。"}],"collocations":["mediodorsal thalamus","mediodorsal region","mediodorsal aspect"],"synonyms":["dorsomedial"],"antonyms":["ventrolateral"]}],"etymology":{"value":"Formed from a combination of 'medio-' (referring to the middle or midline) and 'dorsal' (referring to the back or upper surface).","priority":"★★☆"},"pronunciation":{"ipa":"ˌmiːdioʊˈdɔːrsəli","syllables":"me-di-o-dor-sal-ly"},"inflection":{"notes":"As an adverb, it does not inflect. The adjective form is 'mediodorsal', which also does not inflect."},"usage_notes":{"explanation":"'Mediodorsally' is a term used primarily in anatomy and zoology to describe the location or orientation of a structure or feature. It indicates a position that is both towards the midline (medial) and towards the back or upper surface (dorsal) of an organism. It is often used in describing the location of anatomical structures in the brain, muscles, or other body parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nerve runs medially and dorsally.","correct":"✓ The nerve runs mediodorsally.","note":"While 'medially and dorsally' is technically correct, 'mediodorsally' is more concise and commonly used when referring to a direction that is both medial and dorsal. "},{"incorrect":"✗ The structure is mediodorsal.","correct":"✓ The structure is located mediodorsally.","note":"'Mediodorsal' is an adjective, so it describes the structure itself. 'Mediodorsally' is an adverb, so it describes the location of the structure."}],"priority":"★☆☆"},"related_words":{"derivatives":["medial","dorsal","dorsomedial","ventrolateral"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mediodorsally' is a specialized term used in anatomy and biology to describe a location that is both medial (toward the midline of the body) and dorsal (toward the back). It's commonly used to describe the position of structures in the brain or other parts of the body. Understanding this term requires a knowledge of anatomical directional terms."},"example_sentences":[{"sentence":"The lesion was found to extend mediodorsally from the hippocampus.","translation":"その病変は海馬から正中線に近く背側に向かって広がっていることがわかった。","type":"adverb","meaning_category":"location/direction"},{"sentence":"The mediodorsal nucleus of the thalamus plays a role in executive functions.","translation":"視床の内背側核は実行機能において役割を果たす。","type":"adjective","meaning_category":"anatomy"}]}