{"word":"educatedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"教養をもって、教育を受けているように、学識高く","english_definition":"In a manner showing or resulting from good education; knowledgeably; intelligently; with erudition.","examples":[{"sentence":"He spoke educatedly on the topic, displaying a deep understanding.","translation":"彼はその話題について教養をもって話し、深い理解を示した。"},{"sentence":"She educatedly defended her position in the debate.","translation":"彼女は討論で学識高く自分の立場を擁護した。"}],"collocations":["speak educatedly","argue educatedly","write educatedly","approach a problem educatedly"],"synonyms":["knowledgeably","intelligently","eruditely","scholarly","learnedly","wisely"],"antonyms":["ignorantly","uneducatedly","unintelligently","foolishly"]}],"etymology":{"value":"Formed from 'educated' + '-ly'. The adjective 'educated' comes from the Latin 'educatus', the past participle of 'educare' meaning 'to bring up, rear, educate'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈedʒʊkeɪtɪdli/","syllables":"ed-u-cat-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Educatedly' is an adverb that describes the manner in which something is done, implying that the action is performed with knowledge, intelligence, and a good understanding of the subject matter due to education. It is a relatively uncommon word, and its use suggests a deliberate effort to display one's education or learning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted educatedly.","correct":"✓ He acted intelligently.","note":"'Educatedly' is best used to describe speech, writing, or argumentation where knowledge is explicitly demonstrated, rather than general actions. 'Intelligently' is a more common and versatile alternative for describing actions done with intelligence."},{"incorrect":"✗ She educatedly knew the answer.","correct":"✓ She knew the answer because she was well-educated.","note":"'Educatedly' describes how something is done, not a state of being. To describe knowing something due to education, rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["educated (adjective)","educate (verb)","education (noun)","educator (noun)"],"phrases":["well-educated","highly educated"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'educatedly' means to do something in a way that shows you have a good education and a lot of knowledge. It's not a very common word, so you'll mostly find it in formal writing or when someone wants to emphasize that something was done with a lot of learning and understanding. For example, you might say someone 'educatedly debated' an issue, meaning they used their knowledge and education to make their arguments."},"example_sentences":[{"sentence":"The professor spoke educatedly about the history of the region.","translation":"教授はその地域の歴史について教養をもって話した。","type":"general","meaning_category":"knowledgeably"},{"sentence":"She argued educatedly for the importance of environmental conservation.","translation":"彼女は環境保護の重要性について学識高く主張した。","type":"general","meaning_category":"intelligently"},{"sentence":"The author wrote educatedly on the complex topic of quantum physics.","translation":"著者量子物理学という複雑なテーマについて学識高く書いた。","type":"general","meaning_category":"eruditely"}]}