{"word":"castellanship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"城主の地位、城主職、城主の任期","english_definition":"The office, position, or term of office of a castellan.","examples":[{"sentence":"He held the castellanship for many years, overseeing the castle's defenses.","translation":"彼は長年城主の地位にあり、城の防衛を監督した。"},{"sentence":"The castellanship was a position of great responsibility and authority.","translation":"城主職は大きな責任と権限を持つ地位だった。"}],"collocations":["hold the castellanship","assume the castellanship","relinquish the castellanship"],"synonyms":["castellanry","wardenship","governorship"],"antonyms":[]}],"etymology":{"value":"'Castellanship' is derived from 'castellan,' which comes from the Latin 'castellanus,' meaning 'of or belonging to a castle.' The suffix '-ship' denotes a state, condition, office, or dignity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæstələnsɪp/","syllables":"cas-tel-lan-ship"},"inflection":{"noun_plural":"castellanships"},"usage_notes":{"explanation":"'Castellanship' specifically refers to the role or position of a castellan, who is the governor or keeper of a castle. It emphasizes the responsibilities and authority associated with managing and defending a castle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a castellan, so he had a castellanships.","correct":"✓ He was a castellan, so he held the castellanship.","note":"'Castellanship' is the position or office, not something one possesses in plural form. Use 'held the castellanship' to indicate holding the position."}],"priority":"★★☆"},"related_words":{"derivatives":["castellan","castle","castellany"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Castellanship' is a relatively uncommon word that refers to the position or office of a castellan, the governor or keeper of a castle. Understanding this word requires knowledge of medieval history and castle administration. It is more likely to appear in historical texts or academic discussions related to castles and feudalism."},"example_sentences":[{"sentence":"The documents detailed the duties and responsibilities of the castellanship.","translation":"その文書は城主職の義務と責任を詳細に記述していた。","type":"noun","meaning_category":"城主の地位"},{"sentence":"The king appointed a trusted knight to the castellanship of the strategic fortress.","translation":"王は信頼できる騎士を、戦略的な要塞の城主に任命した。","type":"noun","meaning_category":"城主職"},{"sentence":"During his castellanship, the castle underwent significant renovations.","translation":"彼の城主の任期中、城は大規模な改修を受けた。","type":"noun","meaning_category":"城主の任期"}]}