{"word":"airplays","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(楽曲の)放送回数、オンエア回数","english_definition":"The number of times a song is played on the radio or other broadcast media.","examples":[{"sentence":"The song gained popularity due to its high airplays.","translation":"その曲は、高いオンエア回数によって人気を得た。"},{"sentence":"The band's success was driven by consistent airplays across various radio stations.","translation":"そのバンドの成功は、様々なラジオ局での安定したオンエア回数によって牽引された。"},{"sentence":"The record label focused on increasing airplays to promote the new single.","translation":"レコード会社は、新しいシングルのプロモーションのためにオンエア回数を増やすことに注力した。"}],"collocations":["high airplays (高いオンエア回数)","low airplays (低いオンエア回数)","consistent airplays (安定したオンエア回数)","radio airplays (ラジオでのオンエア回数)","increase airplays (オンエア回数を増やす)","get airplays (オンエアされる)"],"synonyms":["broadcasts","plays","radio play","on-air time"],"antonyms":[]}],"etymology":{"value":"'Airplay' is a compound word formed from 'air' (referring to the broadcast medium, i.e., 'on the air') and 'play' (referring to the playing of a song or recording). The plural form 'airplays' simply refers to multiple instances of such broadcasts.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeərpleɪz/","syllables":"air-plays"},"inflection":{"noun_plural":"airplays"},"usage_notes":{"explanation":"'Airplays' is almost exclusively used in the music industry to quantify how often a song is broadcast. It is a count of individual instances, not a measure of audience reach or listener numbers (although higher airplays often correlate with greater audience exposure). It is typically tracked by monitoring services that listen to radio stations and other broadcast media. The term is not commonly used outside of the context of music or audio broadcasting.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The airplay was very high for the new song.","correct":"✓ The airplays were very high for the new song.","note":"When referring to the total number of times a song has been played, use the plural 'airplays.' The singular 'airplay' is more often used as a general concept or uncountable noun (e.g., 'The song received a lot of airplay.')."},{"incorrect":"✗ The song had many airplay.","correct":"✓ The song had many airplays.","note":"'Airplays' is a countable noun when referring to individual instances. Therefore, use the plural form with quantifiers like 'many,' 'few,' 'several,' etc."}],"priority":"★★☆"},"related_words":{"derivatives":["airplay (singular form)"],"phrasal_verbs":[],"related_terms":["radio promotion","music chart","streaming statistics","record sales","broadcast media"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, used primarily in the music industry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Airplays' is a specialized term used in the music industry. It refers to the number of times a song is broadcast on radio or other media. Understanding this term requires familiarity with the music industry and how songs gain popularity through broadcast exposure. The plural form is used when referring to multiple instances of a song being played. It is not a common word in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The song's **airplays** on top 40 stations helped it climb the charts.","translation":"その曲のトップ40局でのオンエア回数が、チャートを上昇するのに役立った。","type":"noun","meaning_category":"放送回数"},{"sentence":"The company tracks **airplays** to measure the success of its artists' releases.","translation":"その会社は、アーティストのリリース作品の成功を測るためにオンエア回数を追跡している。","type":"noun","meaning_category":"放送回数"},{"sentence":"Despite positive reviews, the album suffered from low **airplays**.","translation":"好意的なレビューにもかかわらず、そのアルバムはオンエア回数が低迷した。","type":"noun","meaning_category":"放送回数"}]}