{"word":"photodynamics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"光力学、光線力学","english_definition":"The study of the effects of light on the motion of objects or particles; the branch of physics that deals with the interaction of light and mechanical systems.","examples":[{"sentence":"Photodynamics plays a crucial role in understanding the behavior of solar sails.","translation":"光力学は、ソーラーセイルの挙動を理解する上で重要な役割を果たします。"},{"sentence":"The principles of photodynamics are applied in the design of optical tweezers.","translation":"光力学の原理は、光ピンセットの設計に応用されています。"}],"collocations":["solar sail photodynamics","optical tweezers photodynamics"],"synonyms":["radiation pressure dynamics","light-matter interaction dynamics"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'photo-' (related to light) and 'dynamics' (the study of motion and forces).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊdaɪˈnæmɪks/","syllables":"pho-to-dy-nam-ics"},"inflection":{"noun_plural":"photodynamics (usually uncountable)"},"usage_notes":{"explanation":"Photodynamics is often used in the context of physics, engineering, and astrophysics. It describes the forces exerted by light (photons) on objects, influencing their movement. It is a specialized term and not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Photodynamics is used to treat cancer.","correct":"✓ Photodynamic therapy is used to treat cancer.","note":"Photodynamics is a field of study. Photodynamic therapy (PDT) is a medical treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["photodynamic (adjective)"],"related_terms":["radiation pressure","optical tweezers","solar sail","photon momentum","light-matter interaction","photodynamic therapy (PDT)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Photodynamics' is a technical term used in physics and related fields to describe the study of how light affects the movement of objects. It's not a word you'd typically encounter in everyday conversation. Understanding requires a background in physics or engineering. It's most often used in scientific research and technical documentation.","translation":"「光力学」は、光が物体の運動にどのように影響するかを研究する、物理学および関連分野で使用される専門用語です。 日常会話で遭遇する単語ではありません。 理解するには、物理学または工学のバックグラウンドが必要です。 最も一般的には、科学研究および技術文書で使用されます。"},"example_sentences":[{"sentence":"The **photodynamics** of dust particles in protoplanetary disks influences planet formation.","translation":"原始惑星系円盤における塵粒子の光力学は、惑星の形成に影響を与えます。","type":"noun","meaning_category":"physics"},{"sentence":"Advanced models are needed to accurately simulate the **photodynamics** of complex systems.","translation":"複雑な系の光力学を正確にシミュレートするには、高度なモデルが必要です。","type":"noun","meaning_category":"physics"}]}