{"word":"burroweed","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A plant of the genus *Isocoma* (formerly *Haplopappus*), especially *Isocoma tenuisecta*, a shrubby plant found in the southwestern United States and northern Mexico. It is known for its narrow, thread-like leaves and yellow flowers. It is considered a weed in some areas, but it also has some traditional medicinal uses.","english_definition":"A plant of the genus *Isocoma*, especially *Isocoma tenuisecta*.","examples":[{"sentence":"The desert landscape was dotted with creosote bushes and burroweed.","translation":"砂漠の風景には、クレオソートブッシュとバローウィードが点在していた。"},{"sentence":"Burroweed is known to be toxic to livestock if consumed in large quantities.","translation":"バローウィードは、大量に摂取すると家畜に有毒であることが知られている。"}],"collocations":["burroweed control","burroweed toxicity","Isocoma tenuisecta"],"synonyms":["rayless goldenrod","jimmyweed"],"antonyms":[]}],"etymology":{"value":"The name likely refers to the plant's ability to grow in disturbed soils, including those disturbed by burrowing animals. The genus name *Isocoma* comes from the Greek words 'isos' (equal) and 'kome' (hair), referring to the equal length of the pappus bristles on the seeds.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbʌroʊˌwiːd/","syllables":"bur-row-weed"},"inflection":{"noun_plural":"burrowweeds"},"usage_notes":{"explanation":"Burroweed is primarily used as a specific botanical term. It is most commonly encountered in ecological studies, range management, and discussions of southwestern US flora. The plant is often considered a weed due to its ability to thrive in overgrazed or disturbed areas, but it also plays a role in desert ecosystems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a burroweed in my garden, so I used weed killer.","correct":"✓ I saw a burroweed in my garden, so I pulled it out.","note":"While burroweed is considered a weed, using a targeted approach like pulling it out is more environmentally friendly than using broad-spectrum weed killer, unless the infestation is severe."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Isocoma","Haplopappus","Asteraceae","Compositae","goldenrod","weed","rangeland","desert flora"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"burroweed\" is a specialized botanical term, primarily encountered in ecological or agricultural contexts related to the southwestern United States and northern Mexico. Understanding requires familiarity with plant taxonomy and ecological concepts. The term may appear in scientific literature, field guides, or discussions related to rangeland management and invasive species.","priority":"★★☆"},"example_sentences":[{"sentence":"The rancher was concerned about the spread of burroweed in the pasture.","translation":"牧場主は牧草地でのバローウィードの広がりを懸念していた。","type":"noun","meaning_category":"plant"},{"sentence":"Burroweed can be an indicator of overgrazing in arid environments.","translation":"バローウィードは、乾燥地帯での過放牧の指標となることがある。","type":"noun","meaning_category":"plant"}]}