{"word":"votabile","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"投票可能な、投票に適した","english_definition":"eligible to be voted for; suitable for voting.","examples":[{"sentence":"Il candidato deve avere almeno 18 anni per essere votabile.","translation":"The candidate must be at least 18 years old to be eligible to be voted for."},{"sentence":"La proposta è votabile se rispetta i requisiti del regolamento.","translation":"The proposal is suitable for voting if it meets the requirements of the regulations."}],"collocations":["essere votabile (to be eligible to be voted for)","proposta votabile (votable proposal)"],"synonyms":["eleggibile","candidabile","idoneo al voto"],"antonyms":["ineleggibile","non votabile"]}],"etymology":{"value":"Deriva dal verbo 'votare' (to vote) con l'aggiunta del suffisso '-abile' (able), che indica la possibilità o l'idoneità a compiere l'azione espressa dal verbo.","priority":"★★☆"},"pronunciation":{"ipa":"/voˈta.bi.le/","syllables":"vo-ta-bi-le"},"inflection":{"notes":"Maschile/Femminile singolare: votabile; Maschile plurale: votabili; Femminile plurale: votabili"},"usage_notes":{"explanation":"'Votabile' si riferisce alla condizione di qualcosa o qualcuno che può essere oggetto di voto o che soddisfa i requisiti per essere votato. Si usa sia in contesti politici che in contesti più generali dove si esprime una preferenza tramite voto.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"La legge è votabile da tutti.","correct":"Tutti possono votare sulla legge.","note":"'Votabile' si riferisce all'oggetto o al soggetto del voto, non a chi vota. In questo caso, è più corretto dire che tutti possono votare sulla legge."}],"priority":"★☆☆"},"related_words":{"derivatives":["votare (to vote)","voto (vote)","votazione (voting)"],"compounds":["non votabile (not votable)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relativamente raro (Relatively rare)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Votabile' è un aggettivo che indica la possibilità o l'idoneità di qualcosa o qualcuno ad essere votato. È utilizzato in contesti formali, come politica o diritto, per descrivere se una persona o una proposta soddisfa i requisiti necessari per essere inclusa in una votazione. La sua comprensione richiede una buona conoscenza del lessico formale italiano."},"example_sentences":[{"sentence":"Questo emendamento è votabile in quanto rispetta i limiti di spesa.","translation":"This amendment is votable because it respects the spending limits.","type":"adjective","meaning_category":"idoneo al voto"},{"sentence":"Il candidato non è votabile perché ha una condanna penale.","translation":"The candidate is not votable because he has a criminal conviction.","type":"adjective","meaning_category":"non eleggibile"}]}