{"word":"Cretaceous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"白亜紀の","english_definition":"Relating to or denoting the last period of the Mesozoic era, between the Jurassic and Tertiary periods, characterized by the dominance of flowering plants and the extinction of dinosaurs.","examples":[{"sentence":"Cretaceous rocks are found in many parts of the world.","translation":"白亜紀の岩石は世界の多くの地域で見られる。"},{"sentence":"The Cretaceous period ended with a mass extinction event.","translation":"白亜紀は大量絶滅イベントで終わった。"}],"collocations":["Cretaceous period","Cretaceous rocks","Cretaceous-Paleogene boundary"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"白亜紀","english_definition":"The Cretaceous period or the system of rocks deposited during it.","examples":[{"sentence":"The Cretaceous was a time of great geological change.","translation":"白亜紀は地質学的に大きな変化の時代だった。"},{"sentence":"Fossils from the Cretaceous provide valuable insights into prehistoric life.","translation":"白亜紀の化石は、先史時代の生命に関する貴重な洞察を提供する。"}],"collocations":["Early Cretaceous","Late Cretaceous","End of the Cretaceous"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin 'creta' meaning 'chalk', referring to the extensive chalk deposits formed during this period.","priority":"★★★"},"pronunciation":{"ipa":"/krɪˈteɪʃəs/","syllables":"Cre-ta-ceous"},"inflection":{"notes":"Adjective and noun forms exist. Noun is both countable and uncountable depending on context."},"usage_notes":{"explanation":"'Cretaceous' refers to the geological period between the Jurassic and Paleogene periods, characterized by specific rock formations and the extinction of dinosaurs. It is commonly used in geology, paleontology, and related fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cretaceous era was before the Jurassic.","correct":"✓ The Cretaceous era was after the Jurassic.","note":"The Cretaceous period followed the Jurassic period."}],"priority":"★★☆"},"related_words":{"derivatives":["Cretaceous-Paleogene extinction event","Upper Cretaceous","Lower Cretaceous"],"phrases":["Mesozoic Era","Geological Time Scale"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency outside of scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'Cretaceous' is a technical term primarily used in the fields of geology and paleontology. It refers to a specific period in Earth's history and is not commonly used in everyday conversation. Understanding its meaning requires some background knowledge of geological time scales and the history of life on Earth."},"example_sentences":[{"sentence":"The boundary between the Cretaceous and Paleogene periods is marked by a layer of iridium.","translation":"白亜紀と古第三紀の境界は、イリジウムの層によって示されている。","type":"both","meaning_category":"Geology"},{"sentence":"Many fossils of dinosaurs have been found in Cretaceous sediments.","translation":"白亜紀の堆積物から多くの恐竜の化石が発見されている。","type":"both","meaning_category":"Paleontology"}]}