{"word":"cellarage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"地下室の容積、地下室のスペース、地下室の保管能力","english_definition":"The space or capacity of a cellar; storage space in a cellar.","examples":[{"sentence":"The wine merchant boasted about the extensive cellarage of his shop.","translation":"そのワイン商は、自分の店の広大な地下室の容積を自慢した。"},{"sentence":"The old house had ample cellarage for storing preserves and root vegetables.","translation":"その古い家には、保存食や根菜を保管するための十分な地下室のスペースがあった。"}],"collocations":["ample cellarage","extensive cellarage","limited cellarage"],"synonyms":["cellar space","basement storage","underground storage"],"antonyms":["above-ground storage","surface storage"]}],"etymology":{"value":"'Cellar' + '-age'. 'Cellar' comes from Latin 'cellarium' (storehouse), from 'cella' (small room). '-age' is a suffix denoting a collection, mass, or space.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛlərɪdʒ/","syllables":"cel-lar-age"},"inflection":{"noun_plural":"cellarages"},"usage_notes":{"explanation":"'Cellarage' refers specifically to the capacity or space available within a cellar. It is not commonly used in everyday conversation but is more frequently found in contexts related to real estate, wine storage, or historical descriptions of properties. It emphasizes the storage aspect of a cellar.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cellarage was full of light.","correct":"✓ The cellar was full of light.","note":"'Cellarage' refers to the space itself, not the contents or conditions within it. Use 'cellar' to describe the room."},{"incorrect":"✗ We need to buy more cellarage for our wine collection.","correct":"✓ We need more cellar space for our wine collection.","note":"'Cellar space' is a more common and natural way to express the need for more room in a cellar."}],"priority":"★☆☆"},"related_words":{"derivatives":["cellar (noun: 地下室)"],"phrases":["wine cellar","root cellar"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cellarage' is a relatively uncommon word that refers to the amount of space or storage capacity available in a cellar. It is more likely to appear in specialized contexts such as real estate descriptions or historical documents. Understanding the word requires a good vocabulary and familiarity with less frequently used terms. It's not a word typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The estate offered impressive wine **cellarage**.","translation":"その地所は印象的なワインの地下室の容積を提供した。","type":"noun","meaning_category":"地下室の容積"},{"sentence":"They were looking for a house with sufficient **cellarage** to store their harvest.","translation":"彼らは収穫物を保管するのに十分な地下室のスペースがある家を探していた。","type":"noun","meaning_category":"地下室のスペース"}]}