{"word":"ironworker","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"鉄骨工、鉄工","english_definition":"A construction worker who erects the steel framework of buildings, bridges, and other structures.","examples":[{"sentence":"The ironworkers were busy assembling the steel beams.","translation":"鉄骨工たちは鉄骨梁の組み立てに忙しかった。"},{"sentence":"Ironworkers often work at great heights.","translation":"鉄骨工はしばしば高所で作業する。"},{"sentence":"Being an ironworker is a physically demanding job.","translation":"鉄骨工は肉体的にきつい仕事だ。"}],"collocations":["steel erection","structural steel","high-rise construction","bridge building","welding","bolting","rigging"],"synonyms":["steelworker","construction ironworker","structural ironworker"],"antonyms":[]}],"etymology":{"value":"The term 'ironworker' comes from the combination of 'iron' (a strong, hard, magnetic silvery-gray metal) and 'worker' (a person who works, especially at a physical job). The term specifically refers to those who work with iron and steel in construction.","priority":"★★★"},"pronunciation":{"ipa":"/ˈaɪərnˌwɜːrkər/","syllables":"i-ron-work-er"},"inflection":{"noun_plural":"ironworkers"},"usage_notes":{"explanation":"An 'ironworker' is a skilled tradesperson specializing in the erection and fabrication of structural steel and iron components in buildings, bridges, and other structures. Their work often involves welding, bolting, rigging, and working at significant heights. The job requires physical strength, dexterity, and a thorough understanding of safety procedures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a iron worker.","correct":"✓ He is an ironworker.","note":"'Ironworker' starts with a vowel sound, so use 'an' as the indefinite article."},{"incorrect":"✗ The ironworkers are working on the iron works.","correct":"✓ The ironworkers are working on the ironwork.","note":"'Ironwork' (one word) refers to the iron or steel components of a structure, while 'iron works' (two words) refers to a factory where iron is processed."}],"priority":"★★☆"},"related_words":{"derivatives":["ironwork (noun: structural iron or steel components)","ironworking (noun: the craft or trade of an ironworker)"],"phrases":["high iron (working at great heights)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'ironworker' refers to a specific type of construction worker who works with steel and iron, often at great heights. This word is not commonly used in everyday conversation but is important to know when discussing construction or engineering. It's a compound word, combining 'iron' and 'worker,' making its meaning relatively straightforward once the context is understood. The job itself is physically demanding and requires specialized skills.","priority":"★★☆"},"example_sentences":[{"sentence":"The **ironworkers** carefully secured the steel beams to the columns.","translation":"鉄骨工たちは慎重に鉄骨梁を柱に固定した。","type":"noun","meaning_category":"occupation"},{"sentence":"Without the skilled **ironworkers**, the skyscraper could not have been built.","translation":"熟練した鉄骨工がいなければ、その超高層ビルは建設できなかっただろう。","type":"noun","meaning_category":"occupation"},{"sentence":"Safety is the top priority for **ironworkers** on the construction site.","translation":"建設現場の鉄骨工にとって、安全は最優先事項だ。","type":"noun","meaning_category":"occupation"}]}