{"word":"nightmarishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"悪夢のように、恐ろしく、ぞっとするほど","english_definition":"in a manner resembling a nightmare; in a frightening or disturbing way.","examples":[{"sentence":"The traffic was nightmarishly slow.","translation":"交通は悪夢のように遅かった。"},{"sentence":"The house was nightmarishly decorated for Halloween.","translation":"その家はハロウィーンのためにぞっとするほど飾り付けられていた。"},{"sentence":"He described the accident in nightmarishly vivid detail.","translation":"彼はその事故を悪夢のように鮮明な詳細で描写した。"}],"collocations":["nightmarishly slow","nightmarishly decorated","nightmarishly vivid"],"synonyms":["horrifically","terrifyingly","dreadfully","gruesomely","appallingly"],"antonyms":["pleasantly","delightfully","comfortingly"]}],"etymology":{"value":"nightmare + -ishly","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪtˌmɛərɪʃli/","syllables":"night-mare-ish-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Nightmarishly' is an adverb that describes something done or existing in a way that is very unpleasant, frightening, or disturbing, similar to a nightmare. It emphasizes the negative and often surreal or irrational qualities of the situation being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was nightmarish.","correct":"✓ The movie was nightmarishly bad.","note":"While 'nightmarish' (adjective) can describe the general quality of something, 'nightmarishly' (adverb) modifies verbs, adjectives, or other adverbs to describe how something is done or to what extent something exists in a nightmarish way."}],"priority":"★★☆"},"related_words":{"derivatives":["nightmare (noun)","nightmarish (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nightmarishly' is used to describe something that is extremely unpleasant or frightening, similar to what you might experience in a nightmare. It's not a common word, so it's usually found in more advanced texts or conversations where the speaker wants to emphasize the disturbing nature of something. For example, 'The journey was nightmarishly long' means the journey was not just long, but also very unpleasant and difficult to endure."},"example_sentences":[{"sentence":"The project was nightmarishly complex, requiring weeks of overtime.","translation":"そのプロジェクトは悪夢のように複雑で、数週間の残業を必要とした。","type":"general"},{"sentence":"The old house was nightmarishly silent, adding to the feeling of unease.","translation":"その古い家は悪夢のように静かで、不安感を増した。","type":"general"},{"sentence":"He recalled the battle in nightmarishly graphic detail, making it hard for her to listen.","translation":"彼はその戦いを悪夢のように生々しい詳細で回想し、彼女は聞くのが辛くなった。","type":"general"}]}