{"word":"stubborn-stout","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"頑固でがっしりした、強情で体格の良い","english_definition":"Having both stubbornness and a stout, sturdy build; obstinate and physically robust.","examples":[{"sentence":"The old farmer was stubborn-stout, refusing to sell his land despite the developers' offers.","translation":"その年老いた農夫は頑固でがっしりしており、開発業者の申し出にもかかわらず土地を売ることを拒否した。"},{"sentence":"With a stubborn-stout determination, she continued to hike up the mountain, despite the difficult terrain.","translation":"頑固でがっしりした決意を持って、彼女は困難な地形にもかかわらず山を登り続けた。"}],"collocations":["stubborn-stout character","stubborn-stout figure","stubborn-stout resistance"],"synonyms":["obstinate and robust","unyielding and sturdy","firm and stout"],"antonyms":["flexible and weak","compliant and frail","yielding and delicate"]}],"etymology":{"value":"Combination of 'stubborn' (determined not to change one's attitude or position) and 'stout' (somewhat fat or of heavy build; also, brave and determined).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstʌbərn ˈstaʊt/","syllables":"stub-born-stout"},"inflection":{"adjective_forms":{"comparative":"more stubborn-stout","superlative":"most stubborn-stout"}},"usage_notes":{"explanation":"The term 'stubborn-stout' is a descriptive adjective that combines the qualities of stubbornness (unwillingness to change one's mind or course of action) with a stout physical build (strong and sturdy). It suggests a person who is not only mentally resolute but also physically robust, making them difficult to persuade or overcome. The term is relatively uncommon and may be considered somewhat informal or literary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was stubborn-stoutly in his beliefs.","correct":"✓ He was stubborn-stout in his beliefs.","note":"'stubborn-stout' is an adjective, not an adverb. Do not add '-ly'."},{"incorrect":"✗ The stubborn-stout of the tree prevented it from falling.","correct":"✓ The sturdiness of the tree prevented it from falling.","note":"When referring to an object's physical strength, 'sturdy' or 'robust' may be more appropriate than 'stubborn-stout'."}],"priority":"★★☆"},"related_words":{"derivatives":["stubbornness (noun)","stoutness (noun)"],"compound_words":["stubborn","stout"],"related_adjectives":["stubborn","stout","robust","resolute","unyielding"]},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'stubborn-stout' is a relatively uncommon and descriptive adjective. It combines the concepts of being 'stubborn' (determined and resistant to change) and 'stout' (physically strong and sturdy). The term is used to describe someone who is both mentally and physically resilient, making them difficult to influence or overcome. Due to its specific and somewhat literary nature, it is more likely to be encountered in advanced texts or creative writing."},"example_sentences":[{"sentence":"The stubborn-stout prospector refused to abandon his claim, convinced that gold lay beneath the surface.","translation":"その頑固でがっしりした探鉱者は、金の鉱脈が地表の下にあると確信し、自分の権利を放棄することを拒否した。","type":"adjective","meaning_category":"頑固でがっしりした"},{"sentence":"Despite his age, the stubborn-stout fisherman continued to brave the rough seas every day.","translation":"高齢にもかかわらず、その頑固でがっしりした漁師は毎日荒れた海に立ち向かい続けた。","type":"adjective","meaning_category":"頑固でがっしりした"}]}