{"word":"overbookishness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"過度の書物好き、書物への過剰な執着","english_definition":"The state or quality of being excessively fond of books or learning; an excessive devotion to books.","examples":[{"sentence":"His overbookishness led him to neglect his social life.","translation":"彼の過度の書物好きは、彼の社会生活を疎かにさせた。"},{"sentence":"She recognized her own overbookishness and tried to find a better balance.","translation":"彼女は自身の過度の書物好きを自覚し、より良いバランスを見つけようとした。"}],"collocations":["extreme overbookishness","childhood overbookishness"],"synonyms":["bibliomania","excessive reading","book obsession"],"antonyms":["lack of interest in books","dislike of reading"]}],"etymology":{"value":"Derived from \"overbookish\" (excessively fond of books) + \"-ness\" (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈbʊkɪʃnəs/","syllables":"o-ver-book-ish-ness"},"inflection":{"noun_plural":"overbookishnesses (rarely used)"},"usage_notes":{"explanation":"\"Overbookishness\" describes a state of being excessively devoted to books and learning, often to the detriment of other aspects of life. It implies an imbalance where reading and studying take precedence over social interactions, physical activities, or practical concerns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from overbookish.","correct":"✓ He suffered from overbookishness.","note":"\"Overbookish\" is an adjective, while \"overbookishness\" is the noun form representing the state of being excessively fond of books."}],"priority":"★★☆"},"related_words":{"derivatives":["overbookish (adjective)","bookish (adjective)","book (noun)"],"related_concepts":["bibliophile","bookworm","intellectualism","academic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overbookishness\" is a relatively uncommon word that describes the state of being excessively fond of books. It implies that someone's love for reading and learning is so strong that it might be negatively impacting other areas of their life, such as their social life or physical health. This word is more likely to be found in academic or literary contexts."},"example_sentences":[{"sentence":"The professor's overbookishness was legendary; he rarely left his study.","translation":"その教授の過度の書物好きは伝説的で、ほとんど書斎から出なかった。","type":"noun","meaning_category":"過度の書物好き"},{"sentence":"She worried that her son's overbookishness might prevent him from developing social skills.","translation":"彼女は息子の過度の書物好きが、社会性を発達させるのを妨げるのではないかと心配した。","type":"noun","meaning_category":"過度の書物好き"}]}