{"word":"smooth-podded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)滑らかな莢を持つ","english_definition":"Having smooth seed pods; used especially in botany to describe plants with smooth, non-hairy or non-rough seed pods.","examples":[{"sentence":"The smooth-podded pea is a popular variety for home gardens.","translation":"滑らかな莢のエンドウは家庭菜園で人気の品種です。"},{"sentence":"This species is characterized by its smooth-podded fruit.","translation":"この種は、滑らかな莢を持つ果実によって特徴付けられます。"}],"collocations":["smooth-podded pea","smooth-podded bean","smooth-podded variety"],"synonyms":["glabrous-podded","non-hairy-podded"],"antonyms":["rough-podded","hairy-podded"]}],"etymology":{"value":"A compound adjective formed from 'smooth' (meaning having an even surface) and 'podded' (meaning having pods or seed vessels).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmuːð ˈpɒdɪd/","syllables":"smooth-pod-ded"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Smooth-podded' is a descriptive term used in botany and gardening to specify that a plant's seed pods are smooth in texture, lacking hairs, ridges, or other irregularities. It is often used to differentiate between varieties of plants, such as peas or beans, where some varieties have smooth pods and others have rough or hairy pods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is smooth podded.","correct":"✓ The plant is smooth-podded.","note":"The hyphen is important to indicate that 'smooth' and 'podded' are acting together as a single adjective modifying the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["pod","smooth","glabrous"],"phrasal_verbs":[],"related_terms":["seed pod","glabrous","legume","botany","horticulture"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'smooth-podded' is a technical term used in botany. It describes plants that have smooth seed pods, meaning the pods do not have hairs or a rough texture. This term is most likely to be encountered in botanical descriptions, gardening guides, or scientific literature related to plant identification and classification."},"example_sentences":[{"sentence":"The gardener preferred the smooth-podded variety of green beans because they were easier to clean.","translation":"庭師は、掃除が簡単なので、滑らかな莢のインゲン豆の品種を好みました。","type":"descriptive","meaning_category":"botanical description"},{"sentence":"The catalog listed several types of peas, including both smooth-podded and wrinkled-podded options.","translation":"カタログには、滑らかな莢と皺のある莢のオプションを含む、いくつかの種類のエンドウ豆がリストされていました。","type":"comparative","meaning_category":"variety comparison"}]}