{"word":"outpoison","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)より多くの毒を盛る、(人)より効果的な毒を使う","english_definition":"To surpass or exceed someone in the act of poisoning, either by administering a greater quantity of poison or by using a more potent or effective poison.","examples":[{"sentence":"The villain attempted to outpoison his rival, using a newly developed toxin.","translation":"悪役は、新たに開発された毒素を使って、ライバルよりも多くの毒を盛ろうとした。"},{"sentence":"In the ancient courts, nobles would often try to outpoison each other to gain power.","translation":"古代の宮廷では、貴族たちは権力を得るために、互いにより効果的な毒を使おうとすることがよくあった。"}],"collocations":["outpoison a rival","outpoison an enemy","attempt to outpoison","try to outpoison"],"synonyms":["surpass in poisoning","exceed in poisoning","poison more effectively"],"antonyms":[]}],"etymology":{"value":"The word 'outpoison' is formed by combining the prefix 'out-' (meaning 'more than' or 'to surpass') with the verb 'poison'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈpɔɪzən/","syllables":"out-poi-son"},"inflection":{"verb_forms":{"present_simple":["outpoison","outpoisons"],"past_simple":"outpoisoned","past_participle":"outpoisoned","present_participle":"outpoisoning"}},"usage_notes":{"explanation":"'Outpoison' is a relatively rare and somewhat archaic verb. It specifically refers to the act of surpassing someone else in the administration or effectiveness of poison. It is often used in historical or fictional contexts involving intrigue, rivalry, and the use of poisons as weapons or tools for assassination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to outpoison the food.","correct":"✓ He tried to poison the food.","note":"'Outpoison' is typically used in the context of poisoning a person, not an object like food. If the intent is simply to poison the food, use 'poison' instead."},{"incorrect":"✗ The two assassins outpoisoned.","correct":"✓ The two assassins tried to outpoison each other.","note":"'Outpoison' requires a direct object (someone being poisoned). It's typically used in a competitive context where one person is trying to surpass another in poisoning."}],"priority":"★★☆"},"related_words":{"derivatives":["poison (noun, verb)","poisoner (noun)","poisoning (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Outpoison' is a rare and specialized verb that means to surpass someone in the act of poisoning, either by using more poison or a more effective poison. It is not a commonly used word and is more likely to be found in literature or historical contexts involving intrigue and assassination. Because of its rarity and specific meaning, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The Borgias were known for their attempts to outpoison their political enemies.","translation":"ボルジア家は、政敵よりも多くの毒を盛ろうとすることで知られていた。","type":"verb","meaning_category":"毒を盛る"},{"sentence":"He sought to outpoison his rival by using a more potent venom.","translation":"彼は、より強力な毒液を使って、ライバルよりも多くの毒を盛ろうとした。","type":"verb","meaning_category":"毒を盛る"}]}