{"word":"Gentium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Gentiumフォント","english_definition":"A Unicode font family designed for the diverse writing systems of the world, with a focus on linguistic accuracy and readability.","examples":[{"sentence":"Gentium is a versatile font for academic publishing.","translation":"Gentiumは学術出版のための汎用性の高いフォントです。"},{"sentence":"The Gentium font supports a wide range of characters.","translation":"Gentiumフォントは幅広い文字をサポートしています。"}],"collocations":["Gentium font","Gentium Plus","Unicode font","font family"],"synonyms":["typeface"],"antonyms":[]}],"etymology":{"value":"The name 'Gentium' is derived from the Latin word meaning 'of the nations' or 'belonging to the peoples'. This reflects the font's aim to support a wide variety of languages and writing systems.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛnʃiəm/","syllables":"Gen-ti-um"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"'Gentium' refers to a specific font family designed to support a wide range of characters, especially those used in various writing systems around the world. It is often used in academic and linguistic contexts where accurate representation of diverse scripts is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I installed a gentium font.","correct":"✓ I installed the Gentium font.","note":"Since it refers to a specific font family, it's usually preceded by 'the'."},{"incorrect":"✗ Gentium are a good font.","correct":"✓ Gentium is a good font.","note":"'Gentium' refers to a single font family, so use a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Gentium Plus (an enhanced version of the Gentium font)"],"related_terms":["Unicode","typeface","font family","SIL International (the organization that developed Gentium)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized contexts such as typography, linguistics, and academic publishing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gentium' is a term primarily encountered in contexts related to typography, linguistics, and academic publishing. It refers to a specific font family designed to support a wide range of characters from various writing systems. Understanding this term requires familiarity with font design and Unicode standards. It is not commonly used in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The linguist chose Gentium for its comprehensive Unicode support.","translation":"言語学者は、その包括的なUnicodeサポートのためにGentiumを選びました。","type":"noun","meaning_category":"Font"},{"sentence":"Gentium is known for its clear and readable glyphs.","translation":"Gentiumは、その明確で読みやすいグリフで知られています。","type":"noun","meaning_category":"Font"},{"sentence":"Many scholars use Gentium in their publications.","translation":"多くの学者が彼らの出版物でGentiumを使用しています。","type":"noun","meaning_category":"Font"}]}