{"word":"engagement-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エンゲージメントを重視した、エンゲージメントを目的とした","english_definition":"Focused on fostering and maximizing engagement, interaction, and participation.","examples":[{"sentence":"The company launched an engagement-oriented marketing campaign to build stronger relationships with its customers.","translation":"その会社は、顧客とのより強固な関係を築くために、エンゲージメントを重視したマーケティングキャンペーンを開始しました。"},{"sentence":"The new social media strategy is engagement-oriented, aiming to increase user interaction and community building.","translation":"新しいソーシャルメディア戦略はエンゲージメントを重視しており、ユーザーのインタラクションとコミュニティ構築の促進を目指しています。"},{"sentence":"An engagement-oriented approach to education emphasizes active learning and student involvement.","translation":"教育におけるエンゲージメント重視のアプローチは、アクティブラーニングと学生の参加を重視します。"}],"collocations":["engagement-oriented marketing","engagement-oriented strategy","engagement-oriented approach","engagement-oriented content","engagement-oriented design"],"synonyms":["interaction-focused","participation-driven","community-centered","relationship-focused","involvement-oriented"],"antonyms":["transactional","passive","detached","isolated","disengaged"]}],"etymology":{"value":"The term is derived from combining 'engagement' (the act of engaging or being engaged) with 'oriented' (directed or focused towards).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈɡeɪdʒmənt ˈɔːriˌentɪd/","syllables":"en-gage-ment-o-ri-ent-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are rarely used for compound adjectives like this)."},"usage_notes":{"explanation":"'Engagement-oriented' is commonly used in business, marketing, education, and technology contexts to describe strategies, designs, or approaches that prioritize active participation, interaction, and relationship-building. It implies a focus on creating meaningful connections and fostering a sense of community or involvement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The program is engagement.","correct":"The program is engagement-oriented.","note":"'Engagement' alone is not an adjective. You need to use 'engagement-oriented' to describe something focused on engagement."},{"incorrect":"The engagement program.","correct":"The engagement-oriented program.","note":"Again, 'engagement' by itself doesn't function as an adjective in this context. Use 'engagement-oriented' to correctly modify the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["engagement","oriented"],"phrasal_verbs":[],"related_terms":["user engagement","customer engagement","employee engagement","community engagement","engagement rate","engagement metrics"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in use due to the emphasis on engagement in various fields.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Engagement-oriented' describes something designed to get people actively involved and interacting. It's often used in business, marketing, and education to talk about strategies or content that aim to build relationships and create a sense of community. Think of it as the opposite of something passive or detached. It's a more advanced term, so you'll typically find it in professional or academic contexts."},"example_sentences":[{"sentence":"The website's design is engagement-oriented, featuring interactive elements and social sharing options.","translation":"そのウェブサイトのデザインはエンゲージメントを重視しており、インタラクティブな要素とソーシャル共有オプションを備えています。","type":"adjective","meaning_category":"general"},{"sentence":"The company's engagement-oriented training program improved employee morale and productivity.","translation":"その会社のエンゲージメントを重視した研修プログラムは、従業員の士気と生産性を向上させました。","type":"adjective","meaning_category":"business"},{"sentence":"The professor adopted an engagement-oriented teaching style, encouraging students to participate actively in class discussions.","translation":"その教授はエンゲージメントを重視した教育スタイルを採用し、学生が授業での議論に積極的に参加することを奨励しました。","type":"adjective","meaning_category":"education"}]}