{"word":"palestrian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"レスリングの、またはレスリングに関する","english_definition":"Of or pertaining to wrestling, or to a wrestling-school.","examples":[{"sentence":"The palestrian exercises were very popular in ancient Greece.","translation":"古代ギリシャでは、レスリングの練習は非常に人気がありました。"},{"sentence":"He was known for his palestrian skills.","translation":"彼はレスリングの技術で知られていました。"}],"collocations":["palestrian exercises","palestrian skills"],"synonyms":["wrestling","athletic"],"antonyms":[]}],"etymology":{"value":"From Latin palaestra, from Greek παλαίστρα (palaistra), wrestling school, from παλαίω (palaio), I wrestle.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɛstriən/","syllables":"pa-les-tri-an"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms, though they are rarely used: more palestrian, most palestrian."},"usage_notes":{"explanation":"The term 'palestrian' is quite rare in modern English. It is primarily used in historical contexts when discussing ancient Greek or Roman wrestling and athletic training. It refers specifically to things related to wrestling schools or wrestling exercises.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a palestrian.","correct":"✓ He is a wrestler.","note":"'Palestrian' is an adjective, not a noun. Use 'wrestler' to describe a person who wrestles."}],"priority":"★☆☆"},"related_words":{"derivatives":["palaestra (noun: a wrestling school)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Palestrian' is a very rare and specialized word. It is primarily used in historical or academic contexts when discussing ancient Greek or Roman wrestling. It is unlikely to be encountered in everyday English. Understanding its meaning requires familiarity with classical history and athletic terminology."},"example_sentences":[{"sentence":"The ancient Greeks valued both intellectual and palestrian pursuits.","translation":"古代ギリシャ人は知的活動とレスリングの追求の両方を重視しました。","type":"adjective","meaning_category":"レスリングの、またはレスリングに関する"},{"sentence":"The palestrian games were an important part of their culture.","translation":"レスリングの試合は彼らの文化の重要な一部でした。","type":"adjective","meaning_category":"レスリングの、またはレスリングに関する"}]}