{"word":"misresolved","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(問題、紛争などを)誤って解決する、不適切に解決する","english_definition":"to resolve (a problem, conflict, etc.) incorrectly or inappropriately.","examples":[{"sentence":"The dispute was misresolved due to a lack of understanding of the local customs.","translation":"その紛争は、現地の慣習に対する理解不足のために誤って解決された。"},{"sentence":"The issue was misresolved by the committee, leading to further complications.","translation":"その問題は委員会によって誤って解決され、さらなる複雑化を招いた。"}],"collocations":["misresolve a dispute","misresolve an issue","misresolve a problem"],"synonyms":["incorrectly resolve","inadequately resolve","improperly resolve","badly resolve"],"antonyms":["correctly resolve","properly resolve","adequately resolve","appropriately resolve"]}],"etymology":{"value":"The word is formed by adding the prefix \"mis-\" (meaning wrong or incorrect) to the verb \"resolve\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪs.rɪˈzɒlvd/","syllables":"mis-re-solved"},"inflection":{"verb_forms":{"present_simple":["misresolve","misresolves"],"past_simple":"misresolved","past_participle":"misresolved","present_participle":"misresolving"}},"usage_notes":{"explanation":"\"Misresolved\" implies that the resolution was not only unsuccessful but also somehow flawed in its approach or outcome. It suggests a failure to address the core issues or a decision that created new problems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was misresolved because of lack of information.","correct":"✓ The problem was misresolved because of a lack of information.","note":"Use the article \"a\" before \"lack\" in this context."},{"incorrect":"✗ The conflict was misresolved, that caused more problems.","correct":"✓ The conflict was misresolved, which caused more problems.","note":"Use \"which\" to introduce a non-restrictive relative clause that refers to the entire preceding clause."}],"priority":"★★☆"},"related_words":{"derivatives":["misresolution (noun): an incorrect or inappropriate resolution"],"phrasal_verbs":[],"related_terms":["resolve","resolution","misunderstanding","conflict","dispute"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Misresolved\" is a relatively uncommon word that means to resolve something incorrectly or inappropriately. It is typically used in formal contexts when discussing problems, conflicts, or disputes that have been handled poorly. The word implies that the resolution was not only unsuccessful but also flawed in its approach or outcome. It is formed by adding the prefix \"mis-\" to the verb \"resolve\", indicating that the resolution was done incorrectly. Understanding this word requires a good vocabulary and an understanding of formal language.","priority":"★★☆"},"example_sentences":[{"sentence":"The initial complaint was misresolved, leading to a formal investigation.","translation":"最初の苦情は誤って解決され、正式な調査につながった。","type":"verb","meaning_category":"incorrectly resolved"},{"sentence":"The committee misresolved the issue, causing further dissatisfaction among the members.","translation":"委員会はその問題を誤って解決し、メンバー間のさらなる不満を引き起こした。","type":"verb","meaning_category":"inappropriately resolved"}]}