{"word":"Miscuing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(読書指導において)誤読の手がかり、誤読の兆候","english_definition":"(in reading instruction) A deviation from text during oral reading.","examples":[{"sentence":"The teacher analyzed the student's miscuing to understand their reading difficulties.","translation":"先生は生徒の読解困難を理解するために、生徒の誤読の手がかりを分析した。"}],"collocations":["miscue analysis"],"synonyms":["reading error","deviation from text"],"antonyms":[]}],"etymology":{"value":"'Miscue' is a term coined by Kenneth Goodman in the 1960s to describe deviations from text during oral reading. It's a combination of 'mis-' (wrongly) and 'cue' (a signal or hint), reflecting the idea that readers make errors based on their interpretation of cues in the text.","priority":"★★☆"},"pronunciation":{"ipa":"/mɪsˈkjuːɪŋ/","syllables":"mis-cu-ing"},"inflection":{"noun_plural":"miscues"},"usage_notes":{"explanation":"'Miscuing' is primarily used in the context of reading education and literacy research. It refers to the observable responses (or 'miscues') that readers make when reading aloud, which are different from the expected or correct text. These miscues are not simply random errors but are seen as valuable sources of information about the reader's comprehension strategies and reading processes. Miscue analysis involves examining these deviations to understand the reader's strengths and weaknesses, and to inform instructional decisions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The student's miscuing showed they were not intelligent.","correct":"✓ The student's miscuing showed areas where they needed more support in reading.","note":"Miscuing is not an indicator of intelligence but rather provides information about a student's reading strategies and areas where they may need additional support."}],"priority":"★☆☆"},"related_words":{"derivatives":["miscue (verb, noun)","miscue analysis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Miscuing' is a technical term used in education, specifically in the field of reading instruction. It refers to the errors or deviations a reader makes when reading aloud. These 'miscues' are analyzed to understand the reader's comprehension processes and to identify areas where they may be struggling. The concept is based on the idea that reading is an active process of constructing meaning, and that errors provide valuable insights into this process. The term is not typically used in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The teacher used miscuing analysis to assess the student's reading comprehension.","translation":"先生は生徒の読解力を評価するために誤読分析を用いた。","type":"noun","meaning_category":"reading assessment"},{"sentence":"The student's miscuing suggested they were relying heavily on context clues.","translation":"生徒の誤読は、彼らが文脈の手がかりに大きく依存していることを示唆していた。","type":"noun","meaning_category":"reading behavior"}]}