{"word":"triality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"三つ組、三位一体、三元性","english_definition":"The state of being threefold; a group of three; a concept involving three aspects or entities.","examples":[{"sentence":"The concept of triality is important in understanding certain mathematical structures.","translation":"三元性の概念は、特定の数学的構造を理解する上で重要です。"},{"sentence":"In some mythologies, the deity is expressed as a triality of distinct figures.","translation":"いくつかの神話では、神は異なる姿の三位一体として表現されています。"}],"collocations":["mathematical triality","physical triality","mythological triality"],"synonyms":["trinity","triad","trio","threefoldness"],"antonyms":["duality","singularity"]}],"etymology":{"value":"Formed from 'trial' (meaning 'group of three') + '-ity' (suffix indicating a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/traɪˈælɪti/","syllables":"tri-al-i-ty"},"inflection":{"noun_plural":"trialities"},"usage_notes":{"explanation":"'Triality' is a relatively rare term, often used in specialized contexts such as mathematics, physics, and mythology. It refers to a state or concept involving three distinct but related elements. It is not a common word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The triality of the situation made it simple.","correct":"✓ The complexity of the situation made it difficult.","note":"'Triality' implies complexity due to the involvement of three aspects, not simplicity. It is misused if the situation is simple."}],"priority":"★☆☆"},"related_words":{"derivatives":["trial (noun: a group of three)"],"related_concepts":["trinity","triad","threefold symmetry"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Triality' is a specialized term primarily encountered in advanced academic or theoretical contexts. It describes a condition or system characterized by three interconnected elements or aspects. Understanding this term requires familiarity with abstract concepts and specialized vocabulary. It is not typically used in general conversation or introductory-level materials."},"example_sentences":[{"sentence":"The principle of triality connects three seemingly disparate areas of mathematics.","translation":"三元性の原理は、一見すると異質な数学の3つの領域を結びつけます。","type":"general","meaning_category":"general"},{"sentence":"In string theory, triality suggests a deep symmetry between different descriptions of the same physical system.","translation":"弦理論では、三元性は同じ物理システムに対する異なる記述の間に深い対称性があることを示唆しています。","type":"physics","meaning_category":"physics"},{"sentence":"Some interpretations of the goddess Hecate present her as a triality representing maiden, mother, and crone.","translation":"女神ヘカテーのいくつかの解釈では、彼女は乙女、母、老婆を表す三位一体として表現されています。","type":"mythology","meaning_category":"mythology"}]}