{"word":"nonelliptically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非省略的に、省略を用いずに","english_definition":"In a manner that is not elliptical; without using ellipsis or omission.","examples":[{"sentence":"The sentence was written nonelliptically to avoid ambiguity.","translation":"曖昧さを避けるために、その文は非省略的に書かれた。"},{"sentence":"He answered the question nonelliptically, providing a complete and detailed response.","translation":"彼は質問に非省略的に答え、完全かつ詳細な回答を提供した。"}],"collocations":["write nonelliptically","answer nonelliptically","state nonelliptically"],"synonyms":["explicitly","fully","completely","unabbreviatedly","uncondensedly"],"antonyms":["elliptically","abbreviatedly","condensedly","incompletely"]},{"part_of_speech":"adverb","definition":"(幾何学)非楕円的に","english_definition":"In a manner that is not elliptical; not having the shape of an ellipse.","examples":[{"sentence":"The orbit was determined to be nonelliptically shaped.","translation":"その軌道は非楕円形であると判断された。"},{"sentence":"The lens was ground nonelliptically to correct for distortion.","translation":"歪みを修正するために、レンズは非楕円形に研磨された。"}],"collocations":["shaped nonelliptically","ground nonelliptically"],"synonyms":["non-oval","non-ovally"],"antonyms":["elliptically","ovally"]}],"etymology":{"value":"Derived from \"non-\" (prefix meaning 'not'), \"elliptical\" (relating to an ellipse or ellipsis), and \"-ly\" (suffix forming adverbs).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪˈlɪptɪkli/","syllables":"non-el-lip-ti-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The adverb \"nonelliptically\" is used in two main contexts. In linguistics and writing, it describes communication that avoids ellipsis (omission of words) for clarity or emphasis. In mathematics and physics, it describes shapes or orbits that are not elliptical. The intended meaning is usually clear from the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The speaker spoke nonelliptically, so no one understood him.","correct":"✓ The speaker spoke elliptically, so no one understood him. / ✓ The speaker spoke nonelliptically, so everyone understood him.","note":"Speaking nonelliptically usually aids understanding because it means speaking clearly and completely, without omissions. Speaking elliptically, on the other hand, can cause confusion. Make sure the sentence logic matches the intended meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonelliptical (adjective)","ellipsis (noun)"],"antonyms":["elliptically"],"related_concepts":["ellipsis","ellipse","geometry","linguistics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonelliptically\" is a technical term, primarily used in formal writing or specialized fields like linguistics and mathematics. It means 'not in an elliptical manner' – either without using ellipsis (omission of words) or not having the shape of an ellipse. Due to its specific and uncommon usage, it is not typically encountered in everyday language. Understanding the terms 'elliptical' and 'ellipsis' is crucial for comprehending the meaning of \"nonelliptically.\""},"example_sentences":[{"sentence":"The instructions were written nonelliptically to ensure that every step was clearly understood.","translation":"すべてのステップが明確に理解されるように、指示は非省略的に書かれていた。","type":"adverb","meaning_category":"without ellipsis"},{"sentence":"The path of the comet was determined to be moving nonelliptically around the sun.","translation":"彗星の軌道は、太陽の周りを非楕円的に移動していると判断された。","type":"adverb","meaning_category":"not elliptical"}]}