{"word":"self-evacuation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自主避難、自力避難","english_definition":"The act of evacuating oneself from a dangerous area or situation without external assistance or official orders.","examples":[{"sentence":"The residents decided on self-evacuation before the hurricane made landfall.","translation":"住民たちはハリケーンが上陸する前に自主避難することを決めた。"},{"sentence":"During the wildfire, many people chose self-evacuation rather than waiting for official evacuation notices.","translation":"山火事の間、多くの人々は公式の避難指示を待つよりも自主避難を選んだ。"},{"sentence":"Self-evacuation is often recommended for individuals with mobility issues who may require extra time to leave an area.","translation":"自主避難は、避難に時間がかかる可能性のある移動に問題のある個人によく推奨される。"}],"collocations":["voluntary evacuation","independent evacuation","early evacuation","emergency preparedness","disaster response"],"synonyms":["voluntary evacuation","independent evacuation","unassisted evacuation"],"antonyms":["mandatory evacuation","assisted evacuation","ordered evacuation"]}],"etymology":{"value":"The term is formed by combining \"self,\" indicating an action done by oneself, and \"evacuation,\" referring to the act of leaving a dangerous place.","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfɪˌvækjʊˈeɪʃən/","syllables":"self-e-vac-u-a-tion"},"inflection":{"noun_plural":"self-evacuations"},"usage_notes":{"explanation":"\"Self-evacuation\" refers to the act of individuals or groups choosing to leave a dangerous area on their own initiative, without being officially ordered or assisted by authorities. This is often done when people perceive an imminent threat and believe that waiting for official instructions would put them at greater risk. It's an important aspect of emergency preparedness and disaster response, emphasizing individual responsibility and proactive measures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The self evacuation was mandatory.","correct":"✓ The evacuation was mandatory. / ✓ The self-evacuation was voluntary.","note":"Self-evacuation, by definition, is not mandatory. A mandatory evacuation is ordered by authorities, while self-evacuation is a personal choice."},{"incorrect":"✗ The government organized the self-evacuation.","correct":"✓ The government supported the self-evacuation. / ✓ The residents organized the self-evacuation.","note":"Self-evacuation is organized by the individuals themselves, not by an external entity like the government. The government might support or facilitate it, but the initiative comes from the people."}],"priority":"★★☆"},"related_words":{"derivatives":["evacuate","evacuation","self"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"self-evacuation\" is a compound noun that describes the act of leaving a dangerous area on one's own accord, without waiting for official orders or assistance. It is commonly used in the context of disaster preparedness and emergency management. Understanding the term requires a good grasp of the individual words \"self\" and \"evacuation\" and the concept of taking independent action in response to a threat."},"example_sentences":[{"sentence":"During the flood, many residents performed a **self-evacuation** to higher ground.","translation":"洪水の間、多くの住民が高台へ自主避難を行った。","type":"noun","meaning_category":"自主避難"},{"sentence":"**Self-evacuation** plans should be part of every family's emergency preparedness strategy.","translation":"自主避難計画は、すべての家族の防災戦略の一部であるべきだ。","type":"noun","meaning_category":"自主避難"},{"sentence":"The local authorities encouraged **self-evacuation** for those living near the coastline.","translation":"地方自治体は、海岸線付近に住む人々に自主避難を推奨した。","type":"noun","meaning_category":"自主避難"}]}