{"word":"race-murder","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的・法律的)人種的動機に基づく殺人","english_definition":"(historical, legal) A murder motivated by racial hatred or prejudice.","examples":[{"sentence":"The crime was classified as a race-murder due to the clear evidence of racial animus.","translation":"その犯罪は、人種的敵意の明らかな証拠から、人種的動機に基づく殺人として分類された。"},{"sentence":"The term 'race-murder' is sometimes used in legal contexts to describe hate crimes resulting in death.","translation":"「人種的動機に基づく殺人」という用語は、死に至るヘイトクライムを説明するために、法的な文脈で時々使用される。"}],"collocations":["commit a race-murder","classify as race-murder","investigate a race-murder","victim of race-murder"],"synonyms":["hate crime resulting in death","racially motivated killing","racially motivated homicide"],"antonyms":[]}],"etymology":{"value":"The term is a compound of 'race' and 'murder', indicating that the murder is motivated by the victim's race.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈreɪsˌmɜːrdər/","syllables":"race-mur-der"},"inflection":{"noun_plural":"race-murders"},"usage_notes":{"explanation":"The term 'race-murder' is often used in a historical or legal context to specifically denote a murder where the victim's race was a primary motivating factor. It is a sensitive term due to its association with racial violence and prejudice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was charged with race-murder because he was a different race than the victim.","correct":"✓ He was charged with race-murder because he murdered the victim and his motive was racial hatred.","note":"The term 'race-murder' implies that the murder was motivated by racial hatred, not simply that the perpetrator and victim were of different races."}],"priority":"★☆☆"},"related_words":{"derivatives":["racism","racial","murder","hate crime"],"phrases":["racially motivated violence","hate crime","bias crime"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'race-murder' is a specialized term used to describe a murder motivated by racial hatred. It is not commonly used in everyday language and is more likely to be encountered in legal or historical contexts. The term is sensitive and should be used with caution."},"example_sentences":[{"sentence":"The historical records documented several cases of race-murder during the period of segregation.","translation":"歴史的記録は、隔離政策の時代に発生した人種的動機に基づく殺人の事例をいくつか記録している。","type":"noun","meaning_category":"人種的動機に基づく殺人"},{"sentence":"The prosecution argued that the killing was a clear case of race-murder, citing the defendant's history of racist remarks.","translation":"検察側は、被告の人種差別的な発言の経歴を引用し、この殺害は明白な人種的動機に基づく殺人であると主張した。","type":"noun","meaning_category":"人種的動機に基づく殺人"}]}