{"word":"sexipolar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having six poles or points of maximal intensity or influence; relating to a world or system with six major powers or centers of influence.","english_definition":"Relating to or characterized by six poles or centers of power or influence.","examples":[{"sentence":"The political scientist described a sexipolar world order emerging in the 21st century.","translation":"政治学者は、21世紀に出現しつつある六極体制の世界秩序について述べた。"},{"sentence":"The sexipolar magnetic field configuration is used in certain types of particle accelerators.","translation":"六極磁場構成は、特定の種類の粒子加速器で使用される。"}],"collocations":["sexipolar world order","sexipolar magnetic field","sexipolar system"],"synonyms":["hexapolar"],"antonyms":["unipolar","bipolar","multipolar"]}],"etymology":{"value":"Derived from the combination of 'sexi-' (from Latin 'sex', meaning six) and 'polar' (relating to poles or points of intensity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛksaɪˈpoʊlər/","syllables":"sex-i-po-lar"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'sexipolar' is used to describe systems or configurations that have six poles or centers of influence. It is relatively rare compared to terms like 'unipolar,' 'bipolar,' or 'multipolar.' In political science, it can refer to a world order dominated by six major powers. In physics, particularly in the context of magnets or fields, it describes a configuration with six poles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is sexipolar in its political views.","correct":"✓ The country has diverse political views.","note":"'Sexipolar' refers to a system with six dominant powers, not diverse opinions within a country."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["unipolar","bipolar","tripolar","multipolar","pole","magnetic pole"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sexipolar' is a specialized term primarily used in academic or technical contexts, such as political science or physics. It describes a system or configuration characterized by six poles or centers of influence. Due to its specific and infrequent usage, it is considered a higher-level vocabulary word."},"example_sentences":[{"sentence":"The international relations scholar argued that the previous bipolar system was evolving into a more complex sexipolar arrangement.","translation":"国際関係学者は、以前の二極体制がより複雑な六極体制へと進化していると主張した。","type":"adjective","meaning_category":"Political Science"},{"sentence":"The sexipolar magnet was crucial for maintaining the stability of the ion beam.","translation":"その六極磁石は、イオンビームの安定性を維持するために非常に重要だった。","type":"adjective","meaning_category":"Physics"}]}