{"word":"ogres","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人食い鬼、怪物","english_definition":"A monstrous, cruel or hideous giant or monster of folklore and fairy tales that eats humans.","examples":[{"sentence":"The story featured brave knights fighting ogres.","translation":"その物語は、勇敢な騎士たちが人食い鬼と戦う様子を描いていた。"},{"sentence":"Many fairy tales warn children about the dangers of ogres.","translation":"多くのおとぎ話は、人食い鬼の危険性について子供たちに警告している。"},{"sentence":"He was portrayed as an ogre in the media.","translation":"彼はメディアで怪物として描かれた。"}],"collocations":["fairy tale ogre","fearsome ogre","mythical ogre","ogre-like appearance","ogre's lair"],"synonyms":["giant","monster","fiend","demon","brute","villain"],"antonyms":["hero","benefactor","savior"]}],"etymology":{"value":"フランス語の『ogre』から派生。初出はシャルル・ペローの童話。語源は不明だが、Orcus（ローマ神話の冥府の神）や、ハンガリーのオグール族などの説がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊɡərz/","syllables":"o-gres"},"inflection":{"noun_plural":"ogres"},"usage_notes":{"explanation":"「ogre」は、おとぎ話や民間伝承に登場する、人食いをする巨大な怪物です。比喩的には、非常に不快で残酷な人を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an ogre, so he is very kind.","correct":"✓ He is an ogre, so he is very cruel.","note":"Ogres are typically portrayed as cruel, not kind."},{"incorrect":"✗ The ogre lived in a beautiful palace.","correct":"✓ The ogre lived in a dark cave.","note":"Ogres are usually depicted as living in unpleasant places."}],"priority":"★★☆"},"related_words":{"derivatives":["ogress (女性の人食い鬼)","ogreish (人食い鬼のような)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"ogre\" refers to a large, monstrous humanoid creature, often depicted in folklore as feeding on humans. While not a common word in everyday conversation, it is frequently encountered in fantasy literature, fairy tales, and discussions of mythology. Understanding the term requires familiarity with classic narratives and the ability to interpret figurative language, as it can also be used to describe someone with a frightening or unpleasant personality."},"example_sentences":[{"sentence":"The children were scared of the ogres in the story.","translation":"子供たちは物語の中の人食い鬼を怖がっていた。","type":"noun","meaning_category":"怪物"},{"sentence":"He was a real ogre to his employees.","translation":"彼は従業員にとって本当にひどい人だった。","type":"noun","meaning_category":"残酷な人"}]}