{"word":"well-drugged","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"薬を十分に投与された、薬でうまく治療された、薬でいい気分にさせられた","english_definition":"having been given a sufficient or effective dose of a drug; feeling the effects of a drug, often in a positive or comfortable way.","examples":[{"sentence":"The patient was well-drugged to manage the pain after surgery.","translation":"患者は手術後の痛みを管理するために、薬を十分に投与された。"},{"sentence":"He seemed calm and relaxed, as if he were well-drugged.","translation":"彼は落ち着いてリラックスしているように見え、まるで薬でいい気分にさせられているかのようだった。"}],"collocations":["well-drugged patient","well-drugged state"],"synonyms":["medicated","sedated","tranquilized","stupefied"],"antonyms":["sober","unmedicated"]}],"etymology":{"value":"'Well-' (adverb meaning 'thoroughly' or 'effectively') combined with 'drugged' (past participle of 'drug', meaning 'to administer a drug to').","priority":"N/A"},"pronunciation":{"ipa":"/ˌwel ˈdrʌɡd/","syllables":"well-drugged"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Well-drugged' generally implies that someone has been given enough medication to achieve a desired effect, such as pain relief or sedation. It can also describe someone who is experiencing the effects of a drug, often in a way that makes them feel calm or comfortable. The term can sometimes carry a negative connotation, suggesting a loss of control or awareness due to the drug's effects.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["drug","drugged","drugging"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'well-drugged' describes a state where someone has received an adequate amount of medication, often to manage pain or induce relaxation. It's a relatively uncommon term and may carry a slightly negative connotation, suggesting a diminished state of awareness. It is important to use this term carefully and consider the context in which it is being used."},"example_sentences":[{"sentence":"The veterinarian ensured the animal was well-drugged before starting the procedure.","translation":"獣医は手術を始める前に、動物に薬が十分に投与されていることを確認した。","type":"adjective","meaning_category":"薬を十分に投与された"},{"sentence":"After the accident, she was kept well-drugged to ease her suffering.","translation":"事故の後、彼女の苦痛を和らげるために、薬を十分に投与され続けた。","type":"adjective","meaning_category":"薬でうまく治療された"}]}