{"word":"puerman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A man who was employed to pull a rickshaw or sedan chair.","english_definition":"A man who was employed to pull a rickshaw or sedan chair.","examples":[{"sentence":"The puerman waited patiently for his fare.","translation":"人力車の車夫は辛抱強く客を待った。"}],"collocations":["hire a puerman","puerman's wage","tired puerman"],"synonyms":["rickshaw puller","coolie"],"antonyms":[]}],"etymology":{"value":"Likely a corruption of 'pull man' or a similar phrase used in early contact with English speakers in areas where rickshaws were common.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpuːərmən/","syllables":"pu-er-man"},"inflection":{"noun_plural":"puermen"},"usage_notes":{"explanation":"The term 'puerman' is largely historical and may be considered offensive in some contexts due to its association with exploitative labor practices. Use with caution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a puermen pulling a cart.","correct":"✓ I saw a puerman pulling a cart.","note":"Puerman is a singular noun; the plural is puermen."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["rickshaw","sedan chair","coolie"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - largely historical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Puerman' is a relatively uncommon and historical term referring to a person who pulled rickshaws or sedan chairs, primarily in East Asia. The word itself is straightforward, but the cultural and historical context is important to understand. Because of the historical associations with poverty and exploitation, it's a term best used with caution and sensitivity."},"example_sentences":[{"sentence":"In old Shanghai, puermen were a common sight on the streets.","translation":"昔の上海では、人力車の車夫は街の通りでよく見かける光景だった。","type":"noun","meaning_category":"historical occupation"},{"sentence":"The puerman struggled to pull the heavy load up the steep hill.","translation":"車夫は重い荷物を急な坂道で引くのに苦労した。","type":"noun","meaning_category":"physical labor"}]}