{"word":"Grecise","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ギリシャ語風にする、ギリシャ語の語法に従って表現する","english_definition":"To express in a manner conforming to Greek idiom; to give a Greek form or character to.","examples":[{"sentence":"He tried to Grecise the English sentence, but it sounded awkward.","translation":"彼はその英文をギリシャ語風にしようとしたが、不自然に聞こえた。"},{"sentence":"The author Grecised the names of the characters in his novel.","translation":"著者は小説の登場人物の名前をギリシャ語風にした。"}],"collocations":["Grecise a word","Grecise a sentence","Grecise a name"],"synonyms":["Hellenize","Atticize"],"antonyms":["Latinize","Romanize"]}],"etymology":{"value":"\"Grecise\" is derived from \"Greek\" with the suffix \"-ise\" (or \"-ize\" in American English), which means \"to make or become.\" It essentially means \"to make Greek\" or \"to conform to Greek style or language.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡriːsaɪz","syllables":"Grec-ise"},"inflection":{"verb_forms":{"present_simple":["Grecise","Grecises"],"past_simple":"Grecised","past_participle":"Grecised","present_participle":"Grecising"}},"usage_notes":{"explanation":"\"Grecise\" is a relatively rare verb that specifically refers to making something conform to Greek language or style. This can involve adapting words, names, or expressions to follow Greek grammatical rules or cultural conventions. It is often used in academic or literary contexts when discussing the influence of Greek language and culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He Grecised the Italian food.","correct":"✓ He adapted the Italian dish to include Greek ingredients.","note":"\"Grecise\" is typically used in the context of language or names, not food. To describe adding Greek elements to food, use a phrase like \"add Greek ingredients\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["Grecism (名詞: ギリシャ語法、ギリシャ風の表現)","Greek (形容詞: ギリシャの、ギリシャ語の；名詞: ギリシャ語、ギリシャ人)","Hellenize (動詞: ギリシャ化する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Grecise\" is a specialized term that means to make something conform to Greek language or style. It is not commonly used in everyday conversation and is more likely to be found in academic or literary contexts. Understanding this word requires a good grasp of both English and Greek linguistic concepts."},"example_sentences":[{"sentence":"The translator had to Grecise the Latin names to fit the context of the Greek play.","translation":"翻訳者は、ギリシャ劇の文脈に合わせてラテン語の名前をギリシャ語風にする必要があった。","type":"verb (vt)","meaning_category":"ギリシャ語風にする"},{"sentence":"Many English words have been Grecised over time, adopting Greek roots and suffixes.","translation":"多くの英単語は、時間の経過とともにギリシャ語化され、ギリシャ語の語根や接尾辞を採用してきた。","type":"verb (vt)","meaning_category":"ギリシャ語風にする"}]}