{"word":"mengaduk","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"mencampur sesuatu dengan gerakan berputar atau naik turun menggunakan alat (seperti sendok, spatula, dll.)","english_definition":"to mix something by stirring with a circular or up-and-down motion using a tool (such as a spoon, spatula, etc.)","examples":[{"sentence":"Ibu sedang mengaduk adonan kue di dalam mangkuk.","translation":"Mother is stirring the cake batter in the bowl."},{"sentence":"Dia mengaduk kopi dengan sendok sebelum meminumnya.","translation":"He stirs the coffee with a spoon before drinking it."},{"sentence":"Pastikan untuk mengaduk cat dengan baik sebelum digunakan.","translation":"Make sure to stir the paint well before using it."}],"collocations":["mengaduk adonan (stir the dough)","mengaduk kopi (stir coffee)","mengaduk cat (stir paint)","mengaduk minuman (stir a drink)","mengaduk gula (stir sugar)"],"synonyms":["mencampur","mengocok","membaur","menggaul"],"antonyms":[]}],"etymology":{"value":"Berasal dari kata dasar 'aduk' yang berarti gerakan memutar atau naik turun untuk mencampur.","priority":"N/A"},"pronunciation":{"ipa":"/məŋˈa.dʊk/","syllables":"meng-a-duk"},"inflection":{"verb_forms":{"present":"mengaduk","past":"mengaduk","future":"akan mengaduk"}},"usage_notes":{"explanation":"Kata 'mengaduk' digunakan untuk menggambarkan tindakan mencampur bahan-bahan dengan gerakan berputar atau naik turun. Tindakan ini biasanya dilakukan untuk memastikan bahan-bahan tercampur rata atau untuk melarutkan sesuatu ke dalam cairan.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Saya mengaduk air dengan tangan.","correct":"Saya mengaduk air dengan sendok.","note":"Meskipun mungkin, lebih umum menggunakan alat seperti sendok atau spatula untuk mengaduk."}],"priority":"N/A"},"related_words":{"derivatives":["aduk (dasar)","adukan (hasil mengaduk)","pengaduk (alat untuk mengaduk)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"frequency_google_ngram":"Cukup sering digunakan dalam konteks memasak dan kegiatan sehari-hari.","priority":"N/A"},"readability_explanation":{"level":"Mudah dipahami dalam konteks yang tepat, terutama dalam resep atau instruksi memasak.","text":"Kata 'mengaduk' berarti mencampur sesuatu dengan gerakan memutar atau naik turun. Biasanya menggunakan alat seperti sendok. Contohnya, saat membuat kue, kita perlu 'mengaduk' adonan agar semua bahan tercampur rata."},"example_sentences":[{"sentence":"Dia harus terus mengaduk saus agar tidak gosong.","translation":"She has to keep stirring the sauce so it doesn't burn.","type":"verb","meaning_category":"mencampur"},{"sentence":"Tolong aduk teh ini, gulanya belum larut.","translation":"Please stir this tea, the sugar hasn't dissolved yet.","type":"verb","meaning_category":"mencampur"}]}