{"word":"anaclisis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(精神分析)対象選択における、依存的な愛着の対象","english_definition":"(psychoanalysis) In object choice, the attachment to an object based on its association with a primary caregiver or a source of security and dependency.","examples":[{"sentence":"Anaclitic object choice is often seen in individuals who seek partners who resemble their parents.","translation":"対象選択における依存的愛着は、しばしばパートナーに親に似た人物を求める人に見られる。"},{"sentence":"The patient's anaclisis on the therapist was evident in their constant need for reassurance.","translation":"患者のセラピストへの依存的愛着は、絶え間ない安心感を求める欲求に明らかだった。"}],"collocations":["anaclitic depression","anaclitic object choice","anaclitic relationship"],"synonyms":["dependency","attachment","reliance"],"antonyms":["detachment","independence","autonomy"]}],"etymology":{"value":"From Ancient Greek ἀνάκλισις (anáklisis), meaning \"leaning back, reclining,\" from ἀνακλίνω (anaklínō, \"I lean back, recline\"), from ἀνά (aná, \"up, back\") + κλίνω (klínō, \"I lean, incline\"). The term was adopted into psychoanalysis to describe the way an infant \"leans on\" or depends on a caregiver.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænəˈklaɪsɪs/","syllables":"a-na-cli-sis"},"inflection":{"noun_plural":"anaclises"},"usage_notes":{"explanation":"In psychoanalysis, 'anaclisis' refers to a specific type of object choice where the individual's attraction to someone is based on that person's perceived ability to provide care, security, or fulfill needs similar to those provided by a primary caregiver (often a parent). This concept is central to understanding certain relationship patterns and dependency issues. It is often contrasted with narcissistic object choice, where attraction is based on perceived similarity to oneself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The anaclisis of the building was causing it to collapse.","correct":"✓ The structural support of the building was failing, causing it to collapse.","note":"'Anaclisis' is a psychoanalytic term and should not be confused with structural support or other unrelated concepts."},{"incorrect":"✗ He had an anaclisis for fast cars and expensive clothes.","correct":"✓ He had a strong preference for fast cars and expensive clothes.","note":"'Anaclisis' is a specific type of attachment related to dependency needs, not simply a preference or liking."}],"priority":"★★☆"},"related_words":{"derivatives":["anaclitic (adjective)"],"phrasal_verbs":[],"related_concepts":["object relations theory","attachment theory","narcissistic object choice","dependency"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term in psychoanalysis)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaclisis' is a specialized term used in psychoanalysis to describe a type of attachment where a person's choice of a love object is based on the object's ability to provide care and support, similar to a caregiver. It is a concept often discussed in the context of object relations theory and attachment theory. Understanding this term requires familiarity with psychoanalytic concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The child's **anaclisis** on their mother was evident in their constant need for physical contact.","translation":"子供の母親への依存的愛着は、絶え間ない身体的接触の必要性に明らかだった。","type":"noun","meaning_category":"psychoanalysis"},{"sentence":"**Anaclisis** can play a significant role in the formation of adult relationships.","translation":"依存的愛着は、成人後の人間関係の形成に重要な役割を果たす可能性がある。","type":"noun","meaning_category":"psychoanalysis"},{"sentence":"Freud introduced the concept of **anaclisis** to explain certain patterns of object choice.","translation":"フロイトは、対象選択の特定のパターンを説明するために、依存的愛着の概念を導入した。","type":"noun","meaning_category":"psychoanalysis"}]}