{"word":"Peritlia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Greek mythology) A daughter of Autolycus and Amphithea; the mother of Ajax the Lesser by Locrian Oileus.","english_definition":"In Greek mythology, Peritlia was the daughter of Autolycus and Amphithea, and the mother of Ajax the Lesser by Oileus.","examples":[{"sentence":"According to some accounts, Peritlia was known for her beauty and virtue.","translation":"いくつかの記述によれば、ペリトリアは美しさと美徳で知られていた。"},{"sentence":"The story of Peritlia is often overshadowed by the more famous exploits of her son, Ajax the Lesser.","translation":"ペリトリアの物語は、息子の小アイアスのより有名な武勇伝によってしばしば影が薄くなっている。"}],"collocations":["mother of Ajax the Lesser","daughter of Autolycus","Greek mythology"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek Πηρίτλη (Pēritlē).","priority":"★★★"},"pronunciation":{"ipa":"/pəˈrɪtliə/","syllables":"Pe-rit-li-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Peritlia is a relatively obscure figure in Greek mythology. She is primarily known as the mother of Ajax the Lesser, a prominent hero in the Trojan War. Accounts of her life and character are scarce.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Ajax the Lesser","Autolycus","Oileus"],"related_characters":["Amphithea"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Peritlia' is highly specialized and primarily encountered in the context of Greek mythology. Understanding requires familiarity with classical literature and genealogical accounts of mythological figures."},"example_sentences":[{"sentence":"The ancient texts mention Peritlia as the mother of a great warrior.","translation":"古代の文献には、ペリトリアが偉大な戦士の母として言及されている。","type":"mythological reference","meaning_category":"mythology"},{"sentence":"Peritlia's lineage connects her to a network of important figures in Greek myth.","translation":"ペリトリアの血統は、彼女をギリシャ神話の重要な人物たちのネットワークに結び付けている。","type":"genealogical context","meaning_category":"genealogy"}]}