{"word":"gossipred","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語)神に誓った、神によって保証された、神聖な、スピリチュアルな","english_definition":"(archaic) sworn to by God; guaranteed by God; sacred; spiritual.","examples":[{"sentence":"The gossipred bond between them was unbreakable.","translation":"彼らの間の神に誓った絆は壊れることがなかった。"}],"collocations":["gossipred bond","gossipred oath"],"synonyms":["sacred","hallowed","divine","spiritual"],"antonyms":["profane","secular"]}],"etymology":{"value":"Middle English: from God + sip (kinsman) + -red (state, condition). Originally referred to the spiritual relationship between a child and its godparents.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒsɪprɛd/","syllables":"gos-sip-red"},"inflection":{"notes":"This word is primarily used as an adjective and does not have common inflections."},"usage_notes":{"explanation":"\"Gossipred\" is an archaic word, rarely used in modern English. It signifies something that is divinely sanctioned or spiritually bonded. It is related to the word \"gossip,\" which originally referred to a godparent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They gossipred the secret.","correct":"✓ They swore a gossipred oath to keep the secret.","note":"The word is an adjective, not a verb. Use it to describe a noun, such as 'oath' or 'bond'."}],"priority":"★★☆"},"related_words":{"derivatives":["gossip (originally meant godparent or close friend)","godparent"],"phrases":["gossipred bond","gossipred oath"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency. The word is virtually absent from modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Gossipred\" is an archaic term with limited modern usage, primarily found in historical or literary contexts. Understanding its meaning requires familiarity with older forms of English and its etymological roots. The word signifies a bond or oath that is divinely sanctioned or spiritually guaranteed. Due to its rarity, it is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The knights took a gossipred oath to defend the realm.","translation":"騎士たちは王国を守るという神に誓った誓いを立てた。","type":"adjective","meaning_category":"神に誓った"},{"sentence":"Their gossipred friendship was a testament to their shared faith.","translation":"彼らの神聖な友情は、共有する信仰の証だった。","type":"adjective","meaning_category":"神聖な"}]}