{"word":"victuallership","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"食糧供給（業）、食糧供給者の地位、食糧供給権","english_definition":"The position or occupation of a victualler; the supply of food or provisions.","examples":[{"sentence":"He held the victuallership for the entire fleet.","translation":"彼は艦隊全体の食糧供給者の地位を保持していた。"},{"sentence":"The contract for the victuallership was highly sought after.","translation":"その食糧供給権の契約は非常に人気があった。"}],"collocations":["hold a victuallership","contract for the victuallership"],"synonyms":["provisioning","catering","supply"],"antonyms":[]}],"etymology":{"value":"From 'victualler' (one who supplies food or provisions) + '-ship' (suffix denoting a state, condition, or office). 'Victualler' comes from the Middle English 'vitailer', from the Old French 'vitaille' (food, provisions), ultimately from the Latin 'victualia' (food, provisions).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɪt(ə)ləʃɪp/","syllables":"vic-tual-ler-ship"},"inflection":{"noun_plural":"victuallerships"},"usage_notes":{"explanation":"'Victuallership' refers to the role or position of someone who provides food and supplies, especially to a large organization or group such as a military fleet or institution. It can also refer to the right or contract to provide such supplies. The term is somewhat archaic and not commonly used in modern English, except in historical or specialized contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a victuallership.","correct":"✓ He holds a victuallership.","note":"'Victuallership' is a position or role, not a person. Use 'victualler' to refer to the person."}],"priority":"★☆☆"},"related_words":{"derivatives":["victual (verb: to supply with food)","victualler (noun: a person who supplies food)","victuals (noun: food supplies, provisions)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Victuallership' is a rare and formal word referring to the job or position of providing food supplies, especially for large groups like armies or ships. It is not commonly used in everyday language. Understanding this word requires a strong grasp of historical and specialized vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The family made a fortune through their control of the naval victuallership.","translation":"その家族は海軍の食糧供給権を掌握することで財を成した。","type":"noun","meaning_category":"食糧供給者の地位"},{"sentence":"Securing the victuallership ensured a steady income for the merchant.","translation":"食糧供給権を確保することで、その商人は安定した収入を得ることができた。","type":"noun","meaning_category":"食糧供給権"}]}