{"word":"non-hypoallergenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低刺激性ではない、アレルギーを起こしやすい","english_definition":"Not hypoallergenic; likely to cause an allergic reaction.","examples":[{"sentence":"This blanket is made of wool, so it is non-hypoallergenic.","translation":"この毛布はウール製なので、低刺激性ではありません。"},{"sentence":"Many people with sensitive skin cannot use non-hypoallergenic soaps.","translation":"敏感肌の多くの人々は、低刺激性でない石鹸を使用できません。"},{"sentence":"Be careful when buying products that are non-hypoallergenic if you have allergies.","translation":"アレルギーがある場合は、低刺激性でない製品を購入する際に注意してください。"}],"collocations":["non-hypoallergenic product","non-hypoallergenic material","non-hypoallergenic soap","non-hypoallergenic cosmetics"],"synonyms":["allergenic","irritating","allergy-inducing"],"antonyms":["hypoallergenic"],"related_words":["allergy","hypoallergenic","irritant","sensitive skin"],"level_frequency":{"frequency_google_ngram":"Low frequency"},"usage_notes":{"explanation":"'Non-hypoallergenic' describes products or materials that are likely to cause allergic reactions. It is the opposite of 'hypoallergenic,' which means less likely to cause an allergic reaction. When choosing products, especially for individuals with allergies or sensitive skin, it's important to consider whether they are hypoallergenic or non-hypoallergenic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"This product is non hypoallergenic, so it's safe for everyone.","correct":"This product is non-hypoallergenic, so it is NOT safe for everyone, especially those with allergies.","note":"'Non-hypoallergenic' means it is likely to cause allergies, so it's not safe for everyone."}],"priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Non-hypoallergenic' means something is likely to cause an allergic reaction. It's used to describe products that are not designed to minimize allergies. If you have sensitive skin or allergies, you should avoid non-hypoallergenic products. It is the opposite of 'hypoallergenic', which means less likely to cause an allergic reaction."},"example_sentences":[{"sentence":"This lotion is non-hypoallergenic and caused a rash on my skin.","translation":"このローションは低刺激性ではなく、私の肌に発疹を引き起こしました。","type":"adjective","meaning_category":"アレルギーを起こしやすい"},{"sentence":"The label clearly stated that the product was non-hypoallergenic.","translation":"ラベルには、その製品が低刺激性ではないことが明確に記載されていました。","type":"adjective","meaning_category":"低刺激性ではない"},{"sentence":"Many inexpensive cosmetics are non-hypoallergenic.","translation":"安価な化粧品の多くは低刺激性ではありません。","type":"adjective","meaning_category":"アレルギーを起こしやすい"}]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'hypoallergenic'. 'Hypoallergenic' itself is a term coined in the mid-20th century, combining 'hypo-' (meaning 'less' or 'under') with 'allergenic' (causing allergies). Therefore, 'non-hypoallergenic' simply means 'not less likely to cause allergies'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌhaɪpoʊæləˈdʒɛnɪk/","syllables":"non-hy-po-al-ler-gen-ic"},"inflection":{"notes":"This is an adjective and does not inflect."}}