{"word":"horripilation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥肌、総毛立ち","english_definition":"The erection or bristling of hairs due to a sympathetic reflex usually triggered by cold, shock, fright, etc.","examples":[{"sentence":"The sudden chill caused horripilation on her arms.","translation":"突然の寒さで彼女の腕に鳥肌が立った。"},{"sentence":"He felt horripilation as he watched the scary movie.","translation":"彼は怖い映画を見ていると総毛立ちを感じた。"}],"collocations":["experience horripilation","feel horripilation","cause horripilation"],"synonyms":["goosebumps","gooseflesh","piloerection","cutis anserina"],"antonyms":[]}],"etymology":{"value":"From Latin *horripilatio*, from *horrere* ('to bristle, shudder') + *pilus* ('hair') + *-atio* (a suffix indicating a process or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒrɪpɪˈleɪʃən/","syllables":"hor-rip-i-la-tion"},"inflection":{"noun_plural":"horripilations"},"usage_notes":{"explanation":"*Horripilation* is a formal or scientific term for what is commonly known as 'goosebumps' or 'gooseflesh'. It refers specifically to the physiological response of hairs standing on end, often due to cold, fear, or excitement. While 'goosebumps' is more common in everyday conversation, *horripilation* is used in medical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a horripilation when I was happy.","correct":"✓ I had horripilation when I was cold/scared/moved.","note":"Horripilation is typically caused by cold, fear, or strong emotion (sadness/awe), not happiness. "},{"incorrect":"✗ Horripilation is contagious.","correct":"✓ Goosebumps are not contagious, but can be triggered by seeing someone else experience them.","note":"Horripilation is a physiological response and not contagious. Seeing someone else experiencing it can trigger a similar response due to empathy."}],"priority":"★☆☆"},"related_words":{"derivatives":["horripilate (verb)"],"phrasal_verbs":[],"related_medical_terms":["piloerection"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Rare and technical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Horripilation' is a technical term referring to the physiological response commonly known as goosebumps or gooseflesh. It's not typically used in everyday conversation but may appear in scientific or medical contexts when discussing the body's reaction to cold, fear, or other stimuli that cause the hairs to stand on end. Understanding this word requires a good grasp of scientific vocabulary."},"example_sentences":[{"sentence":"The eerie silence in the old house gave him horripilation.","translation":"古い家の不気味な静けさが彼に鳥肌を立たせた。","type":"noun","meaning_category":"鳥肌"},{"sentence":"Doctors noted the patient's horripilation as a symptom of his condition.","translation":"医師たちは患者の状態の症状として鳥肌に注目した。","type":"noun","meaning_category":"医学的症状"}]}