{"word":"Masurium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テクネチウムの旧称","english_definition":"An obsolete name for the element technetium (Tc), element number 43.","examples":[{"sentence":"Masurium was the name given to element 43 by Walter Noddack, Ida Tacke, and Otto Berg when they claimed to have discovered it in 1925.","translation":"マスリウムは、1925年にウォルター・ノダック、イダ・タッケ、オットー・ベルクが元素43を発見したと主張した際に与えられた名前です。"}],"collocations":[],"synonyms":["Technetium"],"antonyms":[]}],"etymology":{"value":"Walter Noddack, Ida Tacke, and Otto Berg named it after Masuria (Masuren), a region in East Prussia (now Poland). However, their discovery was disputed, and the name 'technetium' was later officially adopted.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈzjʊəriəm/","syllables":"ma-su-ri-um"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"'Masurium' is no longer the accepted name for element 43. The claim of its discovery under this name was controversial, and later, the element was definitively synthesized and named 'technetium'. It is primarily of historical interest in the context of the history of chemistry.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Technetium","Periodic table","Chemical element"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 科学史の文脈でのみ使われる。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Masurium' is a historical term referring to what is now known as 'technetium.' It is rarely used outside of discussions about the history of chemistry and the periodic table. Understanding its context requires knowledge of the scientific history of element discovery.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The existence of masurium, later known as technetium, was predicted by Mendeleev.","translation":"後にテクネチウムとして知られるマスリウムの存在は、メンデレーエフによって予測されました。","type":"noun","meaning_category":"旧称"},{"sentence":"Some historical texts still refer to technetium as masurium.","translation":"一部の歴史的な文献では、テクネチウムをマスリウムと呼んでいます。","type":"noun","meaning_category":"旧称"}]}