{"word":"extraenteric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"腸の外の、腸管外の","english_definition":"Located or occurring outside of the intestines.","examples":[{"sentence":"The patient presented with extraenteric manifestations of Crohn's disease.","translation":"患者はクローン病の腸管外症状を呈した。"},{"sentence":"Extraenteric infections can be difficult to diagnose.","translation":"腸管外感染症は診断が難しいことがある。"}],"collocations":["extraenteric infection","extraenteric manifestation","extraenteric disease"],"synonyms":["intestinal","enteral"],"antonyms":["intestinal","enteral"]}],"etymology":{"value":"From the prefix 'extra-' (outside) combined with 'enteric' (relating to the intestines).","priority":"★★★"},"pronunciation":{"ipa":"/ˌekstrəɛnˈtɛrɪk/","syllables":"ex-tra-en-ter-ic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Extraenteric' is a medical term used to describe conditions, symptoms, or locations outside of the intestines. It is often used in the context of diseases that primarily affect the intestines but can have manifestations elsewhere in the body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pain was extraenteric, so it must be appendicitis.","correct":"✓ The pain was extraenteric, so it might be referred pain from appendicitis, or another condition.","note":"Extraenteric pain does not automatically mean appendicitis, it only means the pain is felt outside of the intestines. Appendicitis can cause referred pain."}],"priority":"★☆☆"},"related_words":{"derivatives":["extraenterically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'extraenteric' is a specialized medical term. Understanding requires familiarity with medical terminology and the anatomy of the digestive system. It is typically encountered in medical literature or discussions among healthcare professionals."},"example_sentences":[{"sentence":"The study focused on the extraenteric effects of gut microbiota on the brain.","translation":"その研究は、腸内細菌叢の脳に対する腸管外の影響に焦点を当てた。","type":"general","meaning_category":"medical"},{"sentence":"Sclerosing cholangitis is an example of an extraenteric complication of inflammatory bowel disease.","translation":"硬化性胆管炎は、炎症性腸疾患の腸管外合併症の一例である。","type":"medical","meaning_category":"medical"}]}