{"word":"nonconjugality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非配偶性、非夫婦関係","english_definition":"The state of not being married or in a conjugal relationship; the condition of not living as a married couple.","examples":[{"sentence":"The study explored the social implications of increasing nonconjugality in modern society.","translation":"その研究は、現代社会における非配偶性の増加の社会的影響を調査した。"},{"sentence":"Nonconjugality can be a conscious choice or a result of circumstances.","translation":"非配偶性は意識的な選択であることも、状況の結果であることもある。"}],"collocations":["increasing nonconjugality","study of nonconjugality","causes of nonconjugality","effects of nonconjugality"],"synonyms":["celibacy","singlehood","unmarried state","non-marital status"],"antonyms":["conjugality","marriage","married state","matrimony"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not'), combined with 'conjugality' (the state of being married or in a conjugal relationship).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkɒndʒʊˈɡæləti/","syllables":"non-con-ju-gal-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Nonconjugality' is a formal term often used in sociological, demographic, and legal contexts to describe the condition of individuals or households that are not based on a marital or conjugal union. It encompasses a range of living arrangements, including single individuals, cohabiting but unmarried couples, and other non-traditional family structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonconjugality of the couple was a surprise.","correct":"✓ The nonconjugal status of the couple was a surprise.","note":"'Nonconjugality' refers to the state or condition, not a characteristic of a specific couple. Use 'nonconjugal status' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonconjugal (adjective)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - primarily used in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonconjugality' is a formal term used in social sciences to describe the state of not being in a marital or conjugal relationship. This term is often used in academic research and discussions about family structures and social trends. It's important to understand that it refers to a condition or state, rather than a personal characteristic. You'll typically encounter this word in scholarly articles, demographic reports, or legal discussions related to family law and social policy."},"example_sentences":[{"sentence":"The rise in nonconjugality has implications for social welfare programs.","translation":"非配偶性の増加は、社会福祉プログラムに影響を与える。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the economic factors contributing to nonconjugality.","translation":"研究者たちは、非配偶性に寄与する経済的要因を研究している。","type":"academic","meaning_category":"academic"},{"sentence":"Nonconjugality is increasingly recognized as a valid lifestyle choice.","translation":"非配偶性は、有効なライフスタイル選択としてますます認識されている。","type":"sociological","meaning_category":"sociological"}]}