{"word":"orthophoric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学で、照応表現について)文脈内の先行詞を指す、前方照応の","english_definition":"(of a linguistic expression, especially a pronoun) referring to a linguistic unit that follows it in the text; cataphoric.","examples":[{"sentence":"In the sentence 'When he arrived, John sat down,' the pronoun 'he' is orthophoric because it refers to 'John' which follows it.","translation":"「彼が到着したとき、ジョンは座った」という文では、代名詞「彼」は、後に続く「ジョン」を指すため、前方照応的である。"},{"sentence":"Orthophoric reference is less common than anaphoric reference.","translation":"前方照応は、後方照応よりも一般的ではない。"}],"collocations":["orthophoric reference","orthophoric pronoun"],"synonyms":["cataphoric"],"antonyms":["anaphoric"],"notes":"Orthophoric is sometimes used interchangeably with cataphoric, although some linguists make a distinction."}],"etymology":{"value":"From the Greek words 'orthos' (straight, correct) and 'phoros' (bearing, carrying), suggesting 'carrying forward' or 'pointing ahead'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθəˈfɔːrɪk/","syllables":"or-tho-phor-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which are not commonly used with 'orthophoric')."},"usage_notes":{"explanation":"'Orthophoric' describes a type of reference where a word or phrase (usually a pronoun or other referring expression) refers to something that is mentioned later in the text. This is the opposite of anaphoric reference, where the reference is to something mentioned earlier. While 'orthophoric' and 'cataphoric' are often used synonymously, some linguists reserve 'orthophoric' for cases where the later reference is essential for understanding the sentence, and 'cataphoric' for cases where it is merely helpful.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The word 'it' is an orthophoric reference to the previous sentence.","correct":"The word 'it' is an anaphoric reference to the previous sentence.","note":"Orthophoric refers to a *following* linguistic unit, not a previous one. Anaphoric is used for references to previous units."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["anaphora","cataphora","reference","linguistics","pronoun"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A specialized term in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Orthophoric' is a technical term used in linguistics to describe a specific type of reference. It means that a word or phrase (like a pronoun) refers to something that is mentioned *later* in the text. It's the opposite of 'anaphoric,' where a word refers back to something mentioned earlier. Understanding this term requires a background in linguistics and discourse analysis."},"example_sentences":[{"sentence":"In 'Before he left, David said goodbye,' 'he' is an **orthophoric** reference to 'David'.","translation":"「彼が出発する前に、デイビッドはさよならを言った」では、「彼」は「デイビッド」への前方照応である。","type":"adjective","meaning_category":"linguistics"},{"sentence":"The use of **orthophoric** pronouns can create suspense in writing.","translation":"前方照応代名詞の使用は、文章にサスペンスを生み出すことができる。","type":"adjective","meaning_category":"linguistics"}]}