{"word":"Mouthingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"口を動かすように、口の動きだけで言葉を発するように。","english_definition":"In a manner that involves moving the lips as if speaking, but without producing audible sound.","examples":[{"sentence":"She mouthingly apologized from across the room.","translation":"彼女は部屋の向こう側から、声を出さずに口の動きだけで謝った。"},{"sentence":"The actor mouthingly delivered his lines during the rehearsal.","translation":"俳優はリハーサル中、声を出さずに口の動きだけでセリフを言った。"}],"collocations":["mouthingly apologize","mouthingly say","mouthingly speak","mouthingly express"],"synonyms":["silently","wordlessly","noiselessly","in whispers"],"antonyms":["audibly","vocally","loudly","expressively"]}],"etymology":{"value":"The word is derived from the adjective 'mouthing' (related to the act of moving the mouth) with the addition of the adverbial suffix '-ly'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmaʊðɪŋli/","syllables":"mouth-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Mouthingly' describes the action of forming words with the mouth without making any sound. It often implies that the speaker wants to communicate something discreetly or secretly, or that they are unable to speak audibly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He mouthingly spoke the words loud.","correct":"✓ He mouthingly spoke the words.","note":"'Mouthingly' already implies that the action is silent, so adding 'loud' creates a contradiction."},{"incorrect":"✗ She was mouthingly, but I couldn't understand.","correct":"✓ She was mouthingly speaking, but I couldn't understand.","note":"'Mouthingly' is an adverb and needs a verb to modify. 'Speaking' provides the necessary verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["mouth (noun)","mouthing (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mouthingly' describes an action performed silently, using only the movement of the mouth to form words. It is a relatively uncommon word, typically used in descriptive writing or when detailing specific actions where audible speech is absent. Understanding its meaning requires a good vocabulary and an awareness of how adverbs modify verbs to describe actions.","priority":"★☆☆"},"example_sentences":[{"sentence":"Even though he was far away, I could see him mouthingly saying 'I love you'.","translation":"たとえ彼が遠くにいても、彼が声を出さずに「愛してる」と口を動かしているのが見えた。","type":"adverb","meaning_category":"silent communication"},{"sentence":"The hostage mouthingly pleaded for help, hoping someone would notice.","translation":"人質は誰かが気づいてくれることを願い、声を出さずに助けを求めた。","type":"adverb","meaning_category":"silent pleading"},{"sentence":"During the play, the actor mouthingly repeated the lines to help the understudy.","translation":"劇中、俳優は代役を助けるために、声を出さずにセリフを繰り返した。","type":"adverb","meaning_category":"silent rehearsal"}]}