{"word":"unconvertibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"兌換不可能性、転換不可能性","english_definition":"The state or condition of not being convertible; the inability to be changed into another form or substance.","examples":[{"sentence":"The unconvertibility of the currency made international trade difficult.","translation":"その通貨の兌換不可能性が国際貿易を困難にした。"},{"sentence":"The unconvertibility of the old factory into a modern office space was a major obstacle.","translation":"その古い工場を近代的なオフィス空間に転換できないことが大きな障害となった。"}],"collocations":["currency unconvertibility (通貨の兌換不可能性)","asset unconvertibility (資産の転換不可能性)"],"synonyms":["non-convertibility","irreversibility","immutability"],"antonyms":["convertibility","exchangeability","mutability"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'convertibility'. 'Convertibility' itself comes from 'convertible', which is derived from the verb 'convert' (to change from one form or use to another).","priority":"★★★"},"pronunciation":{"ipa":"ˌʌnkənˌvɜːrtɪˈbɪləti","syllables":"un-con-vert-i-bil-i-ty"},"inflection":{"noun_plural":"unconvertibilities"},"usage_notes":{"explanation":"'Unconvertibility' refers to the state where something cannot be converted or exchanged into something else. This term is often used in the context of currency, where a currency is said to be unconvertible if it cannot be freely exchanged for other currencies on the foreign exchange market. It can also be used more broadly to describe the inability to transform or adapt something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unconvertibility of the idea made it useless.","correct":"✓ The impracticality of the idea made it useless.","note":"While 'unconvertibility' can be used metaphorically, it's more common to use words like 'impracticality' or 'infeasibility' when referring to ideas."}],"priority":"★★☆"},"related_words":{"derivatives":["unconvertible (adjective)","convertibility (noun)","convertible (adjective, noun)","convert (verb)"],"related_concepts":["fixed exchange rate","capital controls","currency peg","foreign exchange market"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unconvertibility' is a relatively rare and technical term, primarily used in economics and finance. It describes the state of something, usually a currency, that cannot be exchanged for something else, such as other currencies or assets. Understanding this word requires familiarity with abstract concepts related to economics and international finance. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The government's decision to declare the currency's unconvertibility led to a sharp decline in foreign investment.","translation":"政府が通貨の兌換不可能性を宣言したことが、海外投資の急激な減少につながった。","type":"economic context","meaning_category":"currency"},{"sentence":"The unconvertibility of the old manufacturing plant into a modern data center posed a significant challenge for the company.","translation":"その古い製造工場を最新のデータセンターに転換できないことが、会社にとって大きな課題となった。","type":"business context","meaning_category":"asset"},{"sentence":"Due to the country's economic sanctions, the local currency suffered from unconvertibility on the international market.","translation":"その国の経済制裁のため、現地通貨は国際市場で兌換不可能性に苦しんだ。","type":"geopolitical context","meaning_category":"currency"}]}