{"word":"agency-referred","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(人またはサービスが)機関から紹介された、斡旋された","english_definition":"(of a person or service) having been referred or recommended by an agency.","examples":[{"sentence":"The family hired an agency-referred nanny.","translation":"その家族は、機関から紹介されたナニーを雇った。"},{"sentence":"We use agency-referred caregivers for our elderly patients.","translation":"私たちは、高齢の患者のために、機関から紹介された介護者を利用しています。"},{"sentence":"The agency-referred contractor completed the repairs quickly.","translation":"機関から紹介された請負業者は、修理を迅速に完了させた。"}],"collocations":["agency-referred nanny","agency-referred caregiver","agency-referred contractor","agency-referred employee","agency-referred service"],"synonyms":["agency-recommended","agency-provided","agency-sourced","agency-vetted"],"antonyms":["independently-sourced","self-referred","privately-hired"],"notes":"This term is commonly used in contexts where agencies (employment, social services, etc.) play a role in connecting individuals with services or employment opportunities."}],"etymology":{"value":"A compound word formed by combining 'agency' (referring to an organization or body that acts on behalf of another) and 'referred' (past participle of 'refer,' meaning to direct or send someone to a person or place for assistance or information).","priority":"N/A"},"pronunciation":{"ipa":"/ˈeɪdʒənsi rɪˈfɜːrd/","syllables":"a-gen-cy re-ferred"},"inflection":{"notes":"Adjective; no inflection."},"usage_notes":{"explanation":"The term 'agency-referred' indicates that a person or service has been vetted or sourced through a specific agency. This implies a level of screening or endorsement by the agency, which can provide assurance of quality or reliability. It is often used in professional contexts to denote that a service provider has met certain standards or criteria set by the referring agency.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The referred agency nanny.","correct":"✓ The agency-referred nanny.","note":"The correct order is 'agency-referred' when used as a compound adjective before a noun."}],"priority":"N/A"},"related_words":{"derivatives":["referral (noun): the act of referring someone or something for assistance or information.","agency (noun): a business or organization providing a specific service on behalf of others."],"priority":"N/A"},"level_frequency":{"priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'agency-referred' is a compound adjective used to describe someone or something that has been recommended or provided by an agency. It is commonly used in professional settings to indicate that a person or service has been vetted or sourced through a specific organization. Understanding this term requires a good grasp of compound adjectives and professional vocabulary."},"example_sentences":[{"sentence":"We decided to hire an agency-referred therapist for our child.","translation":"私たちは、子供のために機関から紹介されたセラピストを雇うことにしました。","type":"adjective","meaning_category":"機関から紹介された"},{"sentence":"The agency-referred cleaning service was very reliable.","translation":"機関から紹介された清掃サービスは非常に信頼できた。","type":"adjective","meaning_category":"機関から紹介された"}]}