{"word":"confabulator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"作り話をする人、虚言癖のある人","english_definition":"a person who confabulates; one who fills in gaps in memory with fabrications that they believe to be true.","examples":[{"sentence":"The doctor suspected the patient was a confabulator due to the inconsistencies in their story.","translation":"医師は、患者の話の矛盾から、患者が作り話をする人ではないかと疑った。"},{"sentence":"He was labeled a confabulator after repeatedly presenting false memories as facts.","translation":"彼は、誤った記憶を事実として繰り返し提示したため、作り話をする人と見なされた。"}],"collocations":["chronic confabulator","habitual confabulator"],"synonyms":["fabricator","liar","storyteller","inventor","fabulist"],"antonyms":["truthful person","honest person"]}],"etymology":{"value":"From the verb 'confabulate,' which comes from Latin 'confabulari,' meaning 'to chat together.' The noun 'confabulator' is formed by adding the agent suffix '-or' to the stem of 'confabulate.'","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈfæbjʊleɪtər/","syllables":"con-fab-u-la-tor"},"inflection":{"noun_plural":"confabulators"},"usage_notes":{"explanation":"A 'confabulator' is someone who unconsciously creates false memories or fills in gaps in their memory with fabricated details, often believing these fabrications to be true. This is different from lying, where the person is intentionally deceiving others. Confabulation is often associated with certain neurological conditions or brain damage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a confabulator because he always lies.","correct":"✓ He is a confabulator because he has a memory disorder that causes him to create false memories.","note":"Confabulation is not the same as lying. A confabulator believes their false memories are real, while a liar intentionally deceives others."}],"priority":"★★☆"},"related_words":{"derivatives":["confabulate (verb)","confabulation (noun)","confabulatory (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'confabulator' is a relatively uncommon term used to describe someone who engages in confabulation. Confabulation is the act of creating false memories or filling in gaps in one's memory with fabricated details, often without the intention to deceive. This term is typically used in medical or psychological contexts to describe a symptom of certain neurological conditions or brain damage."},"example_sentences":[{"sentence":"The psychiatrist noted that the patient was a frequent **confabulator**, often inventing elaborate stories about his past.","translation":"精神科医は、患者が頻繁に作り話をする人で、過去について手の込んだ話をでっち上げることが多いと指摘した。","type":"noun","meaning_category":"作り話をする人"},{"sentence":"As a **confabulator**, she genuinely believed the false memories she recounted were true events.","translation":"作り話をする人として、彼女は自分が語った誤った記憶を真実の出来事だと心から信じていた。","type":"noun","meaning_category":"作り話をする人"}]}