{"word":"antibonding","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反結合性の","english_definition":"(of a molecular orbital) having a higher energy and lower stability than the atomic orbitals from which it is formed; tending to destabilize a chemical bond.","examples":[{"sentence":"The antibonding orbital is higher in energy than the bonding orbital.","translation":"反結合性軌道は、結合性軌道よりもエネルギーが高い。"},{"sentence":"Electrons in antibonding orbitals weaken the bond between atoms.","translation":"反結合性軌道にある電子は、原子間の結合を弱める。"}],"collocations":["antibonding orbital","antibonding electron","antibonding state"],"synonyms":["destabilizing"],"antonyms":["bonding"]},{"part_of_speech":"noun","definition":"反結合性軌道","english_definition":"a molecular orbital having a higher energy and lower stability than the atomic orbitals from which it is formed.","examples":[{"sentence":"Filling the antibonding orbital reduces the bond order.","translation":"反結合性軌道を占有すると、結合次数が減少する。"},{"sentence":"The presence of electrons in the antibonding orbitals indicates a weaker bond.","translation":"反結合性軌道に電子が存在することは、結合が弱いことを示している。"}],"collocations":["pi antibonding orbital","sigma antibonding orbital"],"synonyms":[],"antonyms":["bonding orbital"]}],"etymology":{"value":"Formed by combining \"anti-\" (meaning opposite or against) with \"bonding\".","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌæntiˈbɒndɪŋ","syllables":"an-ti-bond-ing"},"inflection":{"notes":"The word 'antibonding' does not change form for pluralization or conjugation."},"usage_notes":{"explanation":"In chemistry, 'antibonding' refers to a type of molecular orbital that, if occupied by electrons, weakens the chemical bond between atoms. Antibonding orbitals are higher in energy than bonding orbitals. The concept is crucial in understanding molecular orbital theory and predicting the stability of molecules.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The molecule is stable because it has many antibonding electrons.","correct":"The molecule is unstable because it has many antibonding electrons.","note":"Antibonding electrons decrease stability, so a high number of them would make a molecule unstable."}],"priority":"☆☆☆"},"related_words":{"derivatives":["antibond","nonbonding"],"related_terms":["molecular orbital theory","bond order","bonding orbital","sigma orbital","pi orbital"],"priority":"☆☆☆"},"level_frequency":{"level":"Advanced Chemistry","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Antibonding' is a term used in advanced chemistry to describe molecular orbitals that, when occupied by electrons, reduce the stability of a chemical bond. These orbitals are higher in energy than 'bonding' orbitals. Understanding this concept requires knowledge of molecular orbital theory. It is not a commonly used word outside of chemistry.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The diatomic molecule is destabilized by the presence of electrons in the σ* antibonding orbital.","translation":"その二原子分子は、σ*反結合性軌道に電子が存在することで不安定化される。","type":"adjective","meaning_category":"反結合性の"},{"sentence":"The bond order is calculated by subtracting the number of electrons in antibonding orbitals from the number in bonding orbitals, then dividing by two.","translation":"結合次数は、結合性軌道にある電子の数から反結合性軌道にある電子の数を引き、それを2で割ることによって計算される。","type":"noun","meaning_category":"反結合性軌道"}]}