{"word":"co-wife","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に一夫多妻制の社会における) 複数の妻の一人、側妻、妾","english_definition":"one of two or more wives of the same man in a polygamous marriage.","examples":[{"sentence":"In some cultures, it is common for a man to have multiple co-wives.","translation":"一部の文化では、男性が複数の妻を持つことは一般的です。"},{"sentence":"The co-wives lived together in the same household.","translation":"複数の妻たちは同じ家庭で一緒に暮らしていました。"},{"sentence":"She considered her co-wife as a sister.","translation":"彼女は自分の妻の一人を姉妹のように考えていました。"}],"collocations":["live with co-wives (複数の妻と暮らす)","relationship with co-wife (妻の一人との関係)","co-wife rivalry (妻同士の競争)"],"synonyms":["sister-wife","fellow wife","secondary wife","concubine"],"antonyms":["sole wife","only wife"],"notes":"The term is most often used in the context of cultures or religions where polygamy is accepted."}],"etymology":{"value":"\"co-\" (共に) + \"wife\" (妻) の組み合わせ。一夫多妻制における複数の妻の関係を示すために作られた言葉。","priority":"★★★"},"pronunciation":{"ipa":"/ˈkoʊˌwaɪf/","syllables":"co-wife"},"inflection":{"noun_plural":"co-wives"},"usage_notes":{"explanation":"The term \"co-wife\" is used to describe the relationship between women who share a husband in a polygamous marriage. It is a neutral term, but the dynamics between co-wives can vary greatly depending on cultural norms, personal relationships, and the husband's treatment of each wife. The term is most commonly used in discussions of cultures or religions where polygamy is practiced.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is my co-wife's husband.","correct":"✓ She is my co-wife.","note":"A co-wife is another wife of the same husband. The husband is not the co-wife."},{"incorrect":"✗ He has a co-wife. She is his first wife.","correct":"✓ He has a co-wife. She is his second (or subsequent) wife.","note":"A co-wife is not the first wife, but one of the subsequent wives in a polygamous marriage."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["polygamy (一夫多妻制)","polygyny (一夫多妻制)","husband","wife","marriage"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"co-wife\" refers to one of multiple wives sharing a single husband in a polygamous marriage. It's most often used when discussing cultures or religions where polygamy is accepted. The word is formed by combining \"co-\" (meaning together or shared) and \"wife.\" It's important to understand that the relationships between co-wives can be complex and vary widely depending on cultural norms and individual circumstances. This term is not commonly used in everyday conversation but is relevant in discussions of family structures and cultural practices related to polygamy."},"example_sentences":[{"sentence":"The anthropologist studied the relationships between the man and his three co-wives.","translation":"人類学者は、その男性と彼の3人の妻たちの関係を研究した。","type":"general","meaning_category":"一夫多妻制における妻"},{"sentence":"The co-wives worked together to manage the household.","translation":"妻たちは協力して家事をこなした。","type":"general","meaning_category":"一夫多妻制における妻"},{"sentence":"The documentary explored the challenges and rewards of being a co-wife.","translation":"そのドキュメンタリーは、複数の妻の一人であることの課題と報酬を探求した。","type":"general","meaning_category":"一夫多妻制における妻"}]}