{"word":"creepie-peepie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(俗語, 軽蔑的) こっそり覗き見する人、盗撮者","english_definition":"(slang, derogatory) A person who secretly watches others, often with malicious or sexual intent; a voyeur or peeping Tom.","examples":[{"sentence":"He was known as the creepie-peepie of the neighborhood because he was always lurking around windows.","translation":"彼はいつも窓の周りをうろついているので、近所のこっそり覗き見する人として知られていた。"},{"sentence":"The police arrested a creepie-peepie who had been filming people in the park.","translation":"警察は公園で人々を撮影していた盗撮者を逮捕した。"}],"collocations":["catch a creepie-peepie (こっそり覗き見する人を捕まえる)","creepie-peepie behavior (こっそり覗き見するような行動)"],"synonyms":["voyeur","peeping Tom","stalker","pervert"],"antonyms":[]}],"etymology":{"value":"Reduplication of \"creepy\" and \"peeping\", emphasizing the unpleasant and intrusive nature of the behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkriːpi ˈpiːpi/","syllables":"creep-ie-peep-ie"},"inflection":{"noun_plural":"creepie-peepies"},"usage_notes":{"explanation":"This term is highly informal and often used in a derogatory or humorous way to describe someone who engages in voyeuristic behavior. It carries a strong negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a creepie-peepie, so he is very kind.","correct":"✓ He is a creepie-peepie, so people avoid him.","note":"The term has negative connotations, so it's unlikely to be associated with positive traits like kindness."}],"priority":"★★☆"},"related_words":{"derivatives":["creepy (adj: 気味の悪い、ぞっとする)","peep (v: 覗き見る、ひょっこり現れる; n: 覗き見)","peeping Tom (n: 覗き魔)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Slang, low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"creepie-peepie\" is slang and not commonly used in formal contexts. It is a derogatory term for someone who secretly watches other people, often for sexual gratification. Understanding this term requires familiarity with informal English and its negative connotations."},"example_sentences":[{"sentence":"The residents installed security cameras to deter any potential creepie-peepies.","translation":"住民たちは、こっそり覗き見する可能性のある人を阻止するために防犯カメラを設置した。","type":"noun","meaning_category":"覗き見する人"},{"sentence":"She felt uneasy knowing there was a creepie-peepie in the neighborhood.","translation":"近所にこっそり覗き見する人がいると知って、彼女は不安を感じた。","type":"noun","meaning_category":"覗き見する人"}]}