{"word":"tame-lived","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a short lifespan in captivity or domestication; not long-lived when kept as a pet or in a controlled environment.","english_definition":"Having a short lifespan in captivity or domestication.","examples":[{"sentence":"Hamsters are tame-lived creatures, rarely surviving beyond two years in a cage.","translation":"ハムスターは飼育下では寿命が短い生き物で、ケージの中で2年以上生きることはめったにありません。"},{"sentence":"Despite their popularity, many exotic birds are tame-lived and require specialized care to thrive.","translation":"人気があるにもかかわらず、多くのエキゾチックな鳥は飼育下では寿命が短く、成長するためには特別なケアが必要です。"}],"collocations":["tame-lived animal","tame-lived pet","relatively tame-lived","generally tame-lived"],"synonyms":["short-lived (in captivity)","ephemeral (in domestication)","not long-lived (as a pet)"],"antonyms":["long-lived (in captivity)","hardy (in domestication)"]}],"etymology":{"value":"Combination of 'tame' (brought from wildness into a domesticated state) and 'lived' (having life or lifespan).","priority":"N/A"},"pronunciation":{"ipa":"/ˈteɪmˌlɪvd/","syllables":"tame-lived"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more tame-lived' and 'most tame-lived' respectively."},"usage_notes":{"explanation":"'Tame-lived' is used to describe animals or organisms that, when kept in a domestic or captive setting, do not live as long as one might expect or as long as they might in their natural habitat. It implies that the conditions of captivity or domestication are not conducive to a long life for that particular species.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is tame-lived, so it needs a lot of care.","correct":"✓ The plant is short-lived, so it needs a lot of care.","note":"'Tame-lived' is typically used for animals, not plants. For plants, 'short-lived' is more appropriate."},{"incorrect":"✗ Wild rabbits are tame-lived compared to domestic ones.","correct":"✓ Wild rabbits are short-lived compared to domestic ones.","note":"'Tame-lived' refers to lifespan in captivity. Wild animals are generally described as 'short-lived' or having a 'short lifespan' in the wild."}],"priority":"N/A"},"related_words":{"derivatives":["tame (adjective, verb)","lived (adjective)","lifespan (noun)","captivity (noun)","domestication (noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; not a common term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Tame-lived' is a relatively uncommon and specialized term used to describe animals that have a short lifespan when kept as pets or in captivity. It combines the concept of 'tame' (domesticated or kept as a pet) with 'lived' (referring to lifespan). Understanding this term requires familiarity with both the concept of domestication and the typical lifespans of various animals. It is most likely to be encountered in discussions about animal care, zoology, or pet ownership."},"example_sentences":[{"sentence":"Many small rodents are tame-lived and require careful attention to their environment to maximize their lifespan.","translation":"多くの小型げっ歯類は飼育下では寿命が短く、寿命を最大限に延ばすためには、周囲の環境に注意を払う必要があります。","type":"adjective","meaning_category":"short lifespan in captivity"},{"sentence":"Compared to larger parrots, budgies are relatively tame-lived, often living only 5-10 years.","translation":"大型のオウムと比較して、セキセイインコは比較的寿命が短く、通常5〜10年しか生きません。","type":"adjective","meaning_category":"short lifespan in captivity"}]}