{"word":"Pasquils","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"(複数形)匿名で書かれた風刺的な詩や文章。特に公共の場所に掲示されるもの。","english_definition":"(plural) Anonymous satirical writings or lampoons, especially those posted in a public place.","examples":[{"sentence":"The city was rife with Pasquils criticizing the corrupt officials.","translation":"その都市は、堕落した役人を批判するパスキルで溢れていた。"},{"sentence":"Reading the Pasquils became a popular form of entertainment and political commentary.","translation":"パスキルを読むことは、娯楽と政治的評論の人気の形となった。"}],"collocations":["post Pasquils","write Pasquils","anonymous Pasquils","political Pasquils"],"synonyms":["lampoon","satire","squib","libel","caricature"],"antonyms":[],"notes":"しばしば政治的または社会的な風刺を含む。"}],"etymology":{"value":"16世紀にローマで、Pasquinoという名前の人物の像に風刺的な文章が貼り付けられたことに由来する。","priority":"中"},"pronunciation":{"ipa":"/ˈpæskwɪlz/","syllables":"pas-kwils"},"inflection":{"noun_plural":"Pasquils"},"usage_notes":{"explanation":"Pasquilsは、匿名で書かれた風刺的な文章を指す言葉であり、特に公共の場所に掲示されるものを指します。歴史的な文脈で使用されることが多く、現代ではあまり一般的ではありません。","priority":"低"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a Pasquil about his friend's birthday.","correct":"✓ He wrote a humorous poem about his friend's birthday.","note":"Pasquilは通常、風刺的で批判的な内容を含むため、友人の誕生日を祝うような文脈には適していません。"},{"incorrect":"✗ The Pasquil was signed with the author's name.","correct":"✓ The Pasquil was anonymous.","note":"Pasquilは匿名で書かれることが特徴です。"}],"priority":"中"},"related_words":{"derivatives":["pasquinade (名詞: パスキルのような風刺的な文章)"],"related_terms":["satire","lampoon","libel","pamphlet"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"'Pasquils' is a rare and specialized term referring to anonymous satirical writings, particularly those posted publicly. It is primarily encountered in historical or literary contexts when discussing political or social commentary from past eras. Due to its infrequent use, it is not a common word in modern English vocabulary."},"example_sentences":[{"sentence":"During the Reformation, Pasquils were used to spread propaganda and criticize religious figures.","translation":"宗教改革の時代、パスキルはプロパガンダを広め、宗教的人物たちを批判するために用いられた。","type":"historical context","meaning_category":"風刺的な文章"},{"sentence":"The government tried to suppress the publication of Pasquils, but they continued to appear overnight.","translation":"政府はパスキルの出版を抑圧しようとしたが、それらは一晩のうちに現れ続けた。","type":"political satire","meaning_category":"風刺的な文章"}]}