{"word":"larding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(料理) ラードを刺すこと、ラルドンの挿入","english_definition":"The process of inserting strips of fat (lardons) into meat that is to be roasted, to keep it moist.","examples":[{"sentence":"Larding is a technique used to add flavor and moisture to lean cuts of meat.","translation":"ラルディングは、赤身の肉に風味と水分を加えるために使用される技術です。"},{"sentence":"The recipe calls for larding the beef with salt pork.","translation":"レシピでは、牛肉に塩漬け豚肉をラルディングするように指示しています。"}],"collocations":["larding needle","larding pork","larding beef"],"synonyms":["barding","fattening"],"antonyms":["degreasing"]},{"part_of_speech":"verb","definition":"lardの現在分詞","english_definition":"Present participle of lard.","examples":[{"sentence":"She is larding the chicken before roasting it.","translation":"彼女は鶏肉をローストする前にラルディングしています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the verb 'lard,' which comes from Old French 'larder' (to put lard on), from 'lard' (bacon, lard), from Latin 'lardum' (bacon, lard).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɑːrdɪŋ/","syllables":"lar-ding"},"inflection":{"verb_forms":{"present_participle":"larding"}},"usage_notes":{"explanation":"'Larding' refers specifically to the culinary technique of inserting strips of fat, usually pork fat (lardons), into lean meat before cooking. This helps to baste the meat from the inside, keeping it moist and adding flavor during the cooking process. It is a technique often used with game meats or leaner cuts of beef.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am larding the vegetables.","correct":"✓ I am larding the meat.","note":"Larding is typically done with meat, not vegetables."},{"incorrect":"✗ Larding is when you cover the meat in fat.","correct":"✓ Larding is when you insert strips of fat into the meat.","note":"Larding involves inserting fat into the meat, not just covering it."}],"priority":"★★☆"},"related_words":{"derivatives":["lard","larder","lardoon"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Larding' is a culinary term referring to the process of inserting strips of fat (usually lardons) into lean meat before cooking to keep it moist and add flavor. It's a technique primarily used in professional cooking or by experienced home cooks when preparing specific dishes that require this method to achieve the desired result. The term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The chef demonstrated the technique of larding the venison.","translation":"シェフは鹿肉をラルディングする技術を実演しました。","type":"noun","meaning_category":"料理"},{"sentence":"He spent the afternoon larding the beef roast for the dinner party.","translation":"彼は午後の時間をディナーパーティーのために牛肉のローストをラルディングして過ごしました。","type":"verb","meaning_category":"料理"}]}