{"word":"pseudomorular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"仮晶状の、偽球状の","english_definition":"Having a false or deceptive globular shape or structure; resembling a morula (an early-stage embryo).","examples":[{"sentence":"The mineral exhibited a pseudomorular texture, resembling a cluster of grapes.","translation":"その鉱物は、ブドウの房に似た仮晶状の組織を示した。"}],"collocations":["pseudomorular texture","pseudomorular habit"],"synonyms":["botryoidal","globular","reniform"],"antonyms":[]}],"etymology":{"value":"Derived from 'pseudo-' (false, deceptive) + 'morular' (resembling a morula). The term describes structures that falsely appear to be composed of small, rounded masses, similar to a morula.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊˈmɒrjʊlər","syllables":"pseu-do-mor-u-lar"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"Used primarily in geology and mineralogy to describe the appearance of certain mineral formations or textures that resemble a cluster of small spheres, similar to the morula stage of an embryo. It indicates a superficial resemblance rather than a true structural composition.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pseudomorph (noun)","morula (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'pseudomorular' is highly specialized, primarily used in geology and mineralogy. It describes a texture or structure that superficially resembles a cluster of small spheres or a morula. Understanding requires familiarity with geological and embryological terminology."},"example_sentences":[{"sentence":"The chalcedony displayed a striking pseudomorular structure after replacing the original mineral.","translation":"玉髄は、元の鉱物を置き換えた後、印象的な仮晶状構造を示した。","type":"adjective","meaning_category":"geology"},{"sentence":"Microscopic analysis revealed the pseudomorular arrangement of the crystals within the rock sample.","translation":"顕微鏡分析により、岩石サンプル内の結晶の仮晶状配列が明らかになった。","type":"adjective","meaning_category":"mineralogy"}]}