{"word":"perisomal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"細胞体の周囲の、細胞体を取り囲む","english_definition":"Relating to or surrounding the cell body (soma) of a neuron or other cell.","examples":[{"sentence":"Perisomal inhibitory neurons play a crucial role in regulating neuronal excitability.","translation":"細胞体周囲の抑制性ニューロンは、ニューロンの興奮性を調節する上で重要な役割を果たします。"},{"sentence":"The perisomal region is rich in mitochondria and other organelles.","translation":"細胞体周囲の領域は、ミトコンドリアやその他の細胞小器官が豊富です。"}],"collocations":["perisomal region","perisomal space","perisomal inhibition","perisomal targeting"],"synonyms":["somatic","circumcellular","pericellular"],"antonyms":["distal","axonal","dendritic"]}],"etymology":{"value":"Derived from the Greek prefix 'peri-' meaning 'around' or 'surrounding', and 'soma' meaning 'body', referring to the cell body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪˈsoʊməl/","syllables":"per-i-so-mal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more perisomal' and 'most perisomal', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Perisomal' is a term primarily used in the context of cell biology, particularly neurobiology, to describe structures, processes, or locations that are in close proximity to the cell body (soma). It is often used to specify the location of certain receptors, proteins, or inhibitory synapses that have a significant impact on the cell's overall function.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ perisome","correct":"✓ perisomal","note":"'Perisome' is a different term, referring to a microbody in eukaryotic cells. 'Perisomal' is the adjective relating to the cell body (soma)."},{"incorrect":"✗ periaxial","correct":"✓ perisomal","note":"'Periaxial' refers to structures around an axis. While the cell body could be considered a central point, 'perisomal' is the more specific and appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["soma","somatic","perikaryon"],"related_terms":["axon","dendrite","synapse","neuron","cell body","pericellular","perineuronal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perisomal' is a specialized term used in cell biology and neuroscience to describe the area surrounding the cell body, or soma, of a cell. It is often used to specify the location of certain cellular processes or structures. Understanding this term requires familiarity with basic cell biology concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers investigated the distribution of receptors in the perisomal region of hippocampal neurons.","translation":"研究者たちは、海馬ニューロンの細胞体周囲領域における受容体の分布を調査しました。","type":"scientific research","meaning_category":"cell biology"},{"sentence":"Perisomal inhibitory synapses are critical for maintaining the balance between excitation and inhibition in the brain.","translation":"細胞体周囲の抑制性シナプスは、脳内の興奮と抑制のバランスを維持するために重要です。","type":"neuroscience","meaning_category":"neurobiology"}]}