{"word":"rustication","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"田舎暮らし、田園生活","english_definition":"The state of living in the country.","examples":[{"sentence":"He enjoyed his rustication after retiring from the city.","translation":"彼は都会を引退した後、田舎暮らしを楽しんだ。"}],"synonyms":["rural life","country living","bucolic existence"],"antonyms":["urban life","city living"]},{"part_of_speech":"noun","definition":"（建築）粗面仕上げ、野面仕上げ：石材の表面を粗く仕上げること、またはそのように仕上げられた壁面。","english_definition":"A type of decorative masonry in which the facing stones are left with a rough, unfinished surface and raised joints.","examples":[{"sentence":"The building's rustication gave it a strong, fortress-like appearance.","translation":"その建物の粗面仕上げは、要塞のような力強い外観を与えた。"},{"sentence":"The rustication of the facade added to the building's grandeur.","translation":"ファサードの野面仕上げが、建物の壮大さを増した。"}],"synonyms":["rough-faced masonry","dressed stone","textured surface"],"antonyms":["smooth finish","polished surface"]}],"etymology":{"value":"From Latin 'rusticus' meaning 'rural' or 'rustic'. The architectural sense developed later, referring to the rough, unfinished appearance reminiscent of rural buildings.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrʌstɪˈkeɪʃən/","syllables":"rus-ti-ca-tion"},"inflection":{"noun_plural":"rustications"},"usage_notes":{"explanation":"The word 'rustication' has two main meanings. The first refers to living in the countryside, often after having lived in a city. The second, and more technical meaning, refers to a specific architectural technique. It's important to understand the context to determine which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rustication was very smooth and polished.","correct":"✓ The surface was smooth and polished. / ✓ The rustication was rough and unfinished.","note":"Rustication, in the architectural sense, is characterized by a rough, unfinished surface. A smooth surface would contradict the definition."}],"priority":"★★☆"},"related_words":{"derivatives":["rustic (adjective, noun)","rusticate (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rustication\" has two primary meanings. The first refers to the act of living in the countryside, often as a retreat from urban life. The second, and more common usage, is an architectural term describing a type of masonry where stones are left with a rough, unfinished surface. This technique is often used to give buildings a rugged or fortress-like appearance. Understanding the context is crucial to determining the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"After years in the bustling city, he longed for the peace and quiet of rustication.","translation":"賑やかな都会で何年も過ごした後、彼は田舎暮らしの静けさを切望した。","type":"noun","meaning_category":"田舎暮らし"},{"sentence":"The heavy rustication of the building's base gave it a sense of solidity and permanence.","translation":"建物の基礎部分の重厚な野面仕上げは、堅牢さと永続性をもたらした。","type":"noun","meaning_category":"建築（粗面仕上げ）"}]}