{"word":"carbo-hydrate","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"炭水化物","english_definition":"Any of a large group of organic compounds occurring in foods and living tissues and including sugars, starch, and cellulose. They contain hydrogen and oxygen in the same ratio as water (2:1) and typically can be broken down to release energy in the animal body.","examples":[{"sentence":"Bread, potatoes, and pasta are high in carbohydrates.","translation":"パン、ジャガイモ、パスタは炭水化物が多い。"},{"sentence":"Athletes often load up on carbohydrates before a big event.","translation":"アスリートは大きなイベントの前に炭水化物をたくさん摂取することが多い。"}],"collocations":["complex carbohydrate (複合炭水化物)","simple carbohydrate (単純炭水化物)","low-carbohydrate diet (低炭水化物ダイエット)","carbohydrate metabolism (炭水化物代謝)","carbohydrate intake (炭水化物摂取量)"],"synonyms":["saccharide","starch","sugar"],"antonyms":["protein","fat"]}],"etymology":{"value":"'Carbo-' refers to carbon, and 'hydrate' refers to a compound containing water. The term reflects the early understanding that these compounds were composed of carbon and water.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrboʊˈhaɪdreɪt/","syllables":"car-bo-hy-drate"},"inflection":{"noun_plural":"carbo-hydrates"},"usage_notes":{"explanation":"'Carbohydrate' is a scientific and nutritional term referring to a class of compounds essential for energy in living organisms. It's often shortened to 'carb' in informal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm trying to cut down on carbo.","correct":"✓ I'm trying to cut down on carbs.","note":"The informal abbreviation for 'carbohydrates' is 'carbs,' not 'carbo'."},{"incorrect":"✗ Carbohydrate is important for energy, but too much are bad.","correct":"✓ Carbohydrates are important for energy, but too much is bad.","note":"'Carbohydrate' is a countable noun, so use the plural form 'carbohydrates' when referring to the class of compounds in general."}],"priority":"★★☆"},"related_words":{"derivatives":["carbohydratic (adjective: relating to carbohydrates)"],"phrases":["low-carb (low-carbohydrate)","carb-loading (the practice of increasing carbohydrate intake before an athletic event)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Carbo-hydrate' refers to a group of compounds including sugars, starches, and cellulose, essential for energy in living organisms. It's a scientific term commonly used in the context of nutrition and diet. The word is often shortened to 'carb' in informal settings. Understanding the term is important for discussing dietary choices and health."},"example_sentences":[{"sentence":"A balanced diet should include a variety of carbohydrates.","translation":"バランスの取れた食事には、さまざまな炭水化物を含めるべきです。","type":"general"},{"sentence":"Many processed foods are high in simple carbohydrates.","translation":"多くの加工食品は単純炭水化物が多い。","type":"nutrition"},{"sentence":"The athlete increased his carbohydrate intake before the marathon.","translation":"そのアスリートはマラソンの前に炭水化物の摂取量を増やした。","type":"sports"}]}