{"word":"deteriorants","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"劣化剤、品質劣化を引き起こす物質","english_definition":"Substances or factors that cause something to deteriorate or decline in quality.","examples":[{"sentence":"Exposure to UV light is one of the major deteriorants of plastics.","translation":"紫外線への暴露は、プラスチックの主要な劣化要因の一つです。"},{"sentence":"Pollution and acid rain are deteriorants that affect the longevity of buildings.","translation":"汚染と酸性雨は、建物の寿命に影響を与える劣化要因です。"}],"collocations":["environmental deteriorants (環境劣化要因)","major deteriorants (主要な劣化要因)","common deteriorants (一般的な劣化要因)"],"synonyms":["degradants","spoiling agents","decaying agents"],"antonyms":["preservatives","stabilizers"]},{"part_of_speech":"noun","definition":"(比喩的に) 悪化させるもの、堕落させるもの","english_definition":"(Figuratively) Things that cause a decline in moral or ethical standards.","examples":[{"sentence":"The constant exposure to violence in media can be a deteriorant to societal values.","translation":"メディアにおける絶え間ない暴力への暴露は、社会の価値観を悪化させる可能性があります。"},{"sentence":"Lack of education and opportunities are deteriorants to social progress.","translation":"教育と機会の不足は、社会の進歩を阻害する要因です。"}],"collocations":["moral deteriorants (道徳的劣化要因)","social deteriorants (社会的劣化要因)"],"synonyms":["corrupting influences","degrading factors"],"antonyms":["improving influences","uplifting factors"]}],"etymology":{"value":"The word 'deteriorants' comes from the verb 'deteriorate,' which originates from the Late Latin 'deteriorare,' meaning 'to make worse.' The suffix '-ants' indicates something that causes or promotes the action.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈtɪəriərənts/","syllables":"de-te-ri-o-rants"},"inflection":{"noun_plural":"deteriorants"},"usage_notes":{"explanation":"'Deteriorants' is primarily used to refer to substances or conditions that cause physical decay or degradation. It can also be used in a more abstract sense to describe factors that contribute to a decline in quality, standards, or values. The term is often used in technical or scientific contexts when discussing the preservation of materials or the causes of degradation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deteriorant of the house was the rain.","correct":"✓ The deteriorant to the house was the rain.","note":"While 'deteriorant' can be used as a noun, it's more common to use 'deterioration' or 'cause of deterioration' in this context. Alternatively, 'deteriorant' is better used as an adjective: 'The deteriorating effect on the house was the rain.'"},{"incorrect":"✗ The deteriorants are affecting the building's structure.","correct":"✓ The deteriorants are affecting the building's structure.","note":"The plural form 'deteriorants' is correct when referring to multiple factors causing deterioration."}],"priority":"★☆☆"},"related_words":{"derivatives":["deteriorate (verb)","deterioration (noun)","deteriorative (adjective)"],"synonyms":["degradants","decaying agents","spoiling agents"],"antonyms":["preservatives","stabilizers"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'deteriorants' refers to things that cause something to get worse or decay. It's often used in technical or scientific contexts to describe factors that damage materials or reduce their quality. For example, pollution can be a deteriorant for buildings, causing them to break down over time. The word can also be used more broadly to describe things that negatively affect something, like how a lack of funding can be a deteriorant for a school's programs. It is a relatively uncommon word, so it's more likely to be encountered in specialized texts or discussions."},"example_sentences":[{"sentence":"High humidity and temperature are major deteriorants of archival materials.","translation":"高湿度と高温は、アーカイブ資料の主要な劣化要因です。","type":"noun","meaning_category":"劣化剤"},{"sentence":"The deteriorants in the air pollution are causing the statue to erode.","translation":"大気汚染に含まれる劣化物質が、像の浸食を引き起こしています。","type":"noun","meaning_category":"劣化剤"},{"sentence":"The constant negativity can be a deteriorant to team morale.","translation":"絶え間ない否定的な態度は、チームの士気を低下させる可能性があります。","type":"noun","meaning_category":"悪化させるもの"}]}