{"word":"noncontending","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"争わない、競争しない、議論しない","english_definition":"Not contending; not engaging in strife or competition; not arguing or disputing.","examples":[{"sentence":"The two parties reached a noncontending agreement to avoid further conflict.","translation":"両当事者は、さらなる紛争を避けるために、争わない合意に達した。"},{"sentence":"He adopted a noncontending attitude in the meeting, choosing to listen rather than argue.","translation":"彼は会議で争わない姿勢を取り、議論するよりも聞くことを選んだ。"},{"sentence":"A noncontending approach can sometimes be more effective in resolving disputes.","translation":"争わないアプローチは、紛争解決においてより効果的な場合がある。"}],"collocations":["noncontending agreement","noncontending attitude","noncontending approach","noncontending party"],"synonyms":["peaceful","amicable","harmonious","non-combative","non-aggressive","cooperative"],"antonyms":["contending","combative","aggressive","argumentative","disputatious"]},{"part_of_speech":"adjective","definition":"（法的に）争わない、不抗争の","english_definition":"(Legally) Not contesting; not challenging or disputing the validity or legality of something.","examples":[{"sentence":"The defendant entered a noncontending plea, neither admitting nor denying the charges.","translation":"被告は不抗争の答弁を行い、容疑を認めも否定もしなかった。"},{"sentence":"A noncontending divorce is often quicker and less expensive than a contested one.","translation":"不抗争離婚は、争う離婚よりも迅速かつ費用が少ないことが多い。"},{"sentence":"The company agreed to a noncontending settlement to avoid a lengthy and costly lawsuit.","translation":"会社は、長くて費用のかかる訴訟を避けるために、不抗争の和解に合意した。"}],"collocations":["noncontending plea","noncontending divorce","noncontending settlement","noncontending will"],"synonyms":["unchallenged","undisputed","uncontested","unopposed","agreed"],"antonyms":["contested","disputed","challenged","opposed"]}],"etymology":{"value":"Derived from the prefix \"non-\" (meaning \"not\") and the word \"contending\" (meaning \"struggling, competing, arguing\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈtɛndɪŋ/","syllables":"non-con-tend-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"\"Noncontending\" describes a state or action of avoiding conflict, competition, or argument. It can refer to a general attitude of peacefulness or cooperation, or to a specific legal situation where someone chooses not to dispute a claim or charge. The legal usage often implies a strategic decision to minimize costs or avoid further complications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very non-contending person, always looking for fights.","correct":"✓ He is a very contending person, always looking for fights.","note":"The sentence contradicts itself. A noncontending person would avoid fights, not seek them out."},{"incorrect":"✗ The noncontending divorce was very argumentative.","correct":"✓ The contested divorce was very argumentative.","note":"A noncontending divorce should be amicable and without arguments. An argumentative divorce would be a contested one."}],"priority":"★★☆"},"related_words":{"derivatives":["noncontention (noun): the state of not contending","contend (verb): to struggle, compete, argue","contention (noun): strife, competition, argument"],"synonyms":["peaceful","amicable","harmonious","cooperative","non-aggressive","non-combative"],"antonyms":["contending","combative","aggressive","argumentative","disputatious"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"noncontending\" is a relatively uncommon and formal term. It describes someone or something that avoids conflict, competition, or argument. In a legal context, it means not challenging or disputing something, such as a claim or charge. Understanding this word requires a good vocabulary and familiarity with formal language and legal concepts. It's more likely to be encountered in written texts or formal discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The company adopted a noncontending strategy to resolve the labor dispute.","translation":"会社は労働争議を解決するために、争わない戦略を採用した。","type":"adjective","meaning_category":"争わない"},{"sentence":"He entered a noncontending plea in court to expedite the legal process.","translation":"彼は法的手続きを迅速化するために、裁判所で不抗争の答弁を行った。","type":"adjective","meaning_category":"（法的に）争わない"},{"sentence":"The two nations maintained a noncontending relationship despite their historical differences.","translation":"その二国は、歴史的な違いにもかかわらず、争わない関係を維持した。","type":"adjective","meaning_category":"争わない"}]}