{"word":"dendrologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"樹木学者、樹木研究家","english_definition":"A person who studies trees; a scientist specializing in dendrology.","examples":[{"sentence":"The dendrologist identified the rare species of oak.","translation":"その樹木学者は珍しい種類のオークを特定した。"},{"sentence":"Dendrologists study the growth patterns and life cycles of trees.","translation":"樹木学者は木の成長パターンとライフサイクルを研究する。"}],"collocations":["work as a dendrologist","consult with a dendrologist","dendrologist's report","dendrologist's expertise"],"synonyms":["arborist","botanist","forest scientist","tree expert"],"antonyms":[]}],"etymology":{"value":"The word \"dendrologist\" comes from the Greek words \"dendron\" (δένδρον), meaning \"tree,\" and \"logia\" (-λογία), meaning \"study of.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˌdɛnˈdrɒlədʒɪst","syllables":"den-drol-o-gist"},"inflection":{"noun_plural":"dendrologists"},"usage_notes":{"explanation":"A dendrologist is a scientist who specializes in the study of trees, shrubs, and other woody plants. Their work involves identifying, classifying, and studying the characteristics, distribution, and ecological roles of different tree species. Dendrologists may work in various fields, including forestry, conservation, horticulture, and academia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dendrology.","correct":"✓ He is a dendrologist.","note":"\"Dendrology\" is the study of trees, while a \"dendrologist\" is a person who studies trees."},{"incorrect":"✗ The dendrologist study trees.","correct":"✓ The dendrologist studies trees.","note":"Remember subject-verb agreement. Since \"dendrologist\" is singular, the verb should be \"studies.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["dendrology (noun: 樹木学)","dendrological (adjective: 樹木学の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"dendrologist\" is a specialized term used to describe a scientist who studies trees. It is not commonly used in everyday conversation but is relevant in academic or professional contexts related to botany, forestry, or environmental science. Understanding this term requires a familiarity with scientific vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The dendrologist used tree rings to determine the age of the forest.","translation":"その樹木学者は年輪を使って森の樹齢を測定した。","type":"general","meaning_category":"General Use"},{"sentence":"As a dendrologist, she travels the world to study different species of trees.","translation":"樹木学者として、彼女は世界のさまざまな種類の木を研究するために旅をする。","type":"professional","meaning_category":"Professional Context"},{"sentence":"The dendrologist's report provided valuable insights into the health of the urban trees.","translation":"その樹木学者の報告書は、都市の木の健康状態に関する貴重な洞察を提供した。","type":"research","meaning_category":"Research/Report"}]}