{"word":"reprobacy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(神学) 予定説における、神によって救済されることが予め定められていない状態、見捨てられた状態","english_definition":"(in theology) the state of being reprobate; the state of being rejected by God and destined for damnation.","examples":[{"sentence":"According to Calvinistic theology, some individuals are predestined to salvation, while others are predestined to reprobacy.","translation":"カルヴァン主義神学によれば、ある人々は救済されるように予定されており、他の人々は見捨てられるように予定されている。"},{"sentence":"The concept of reprobacy is a controversial aspect of predestination.","translation":"見捨てられるという概念は、予定説の論争の的となる側面である。"}],"collocations":["doctrine of reprobacy (見捨てられるという教義)","state of reprobacy (見捨てられた状態)"],"synonyms":["damnation","perdition","rejection","condemnation"],"antonyms":["election","salvation","grace","redemption"]}],"etymology":{"value":"Late Middle English: from Old French reprobacion, from late Latin reprobatio(n-), from reprobare ‘disapprove of’ (see reprobate).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛprəbəsi/","syllables":"re-pro-ba-cy"},"inflection":{"noun_plural":"reprobacies"},"usage_notes":{"explanation":"\"Reprobacy\" is a theological term primarily used within the context of Calvinistic Protestantism. It refers to the doctrine that God has predetermined some individuals for damnation, as opposed to election, where God has predetermined others for salvation. It is a controversial and complex concept, often debated within theological circles. The term is not commonly used outside of religious or philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He experienced reprobacy after losing his job.","correct":"✓ He experienced despair after losing his job.","note":"\"Reprobacy\" is a theological term related to divine rejection, not a general feeling of misfortune or failure. Use words like \"despair,\" \"disappointment,\" or \"setback\" for secular contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["reprobate (noun, adjective, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency. Primarily found in theological texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"reprobacy\" is a highly specialized term primarily found in theological discussions, particularly within Calvinistic Protestantism. It refers to the doctrine that God has predetermined some individuals for damnation. Due to its specific and complex theological meaning, it is not commonly used or understood outside of these contexts. Understanding requires familiarity with theological concepts like predestination and election."},"example_sentences":[{"sentence":"The theologian discussed the implications of the doctrine of **reprobacy**.","translation":"その神学者は、見捨てられるという教義が持つ意味について議論した。","type":"noun","meaning_category":"theological doctrine"},{"sentence":"Some find the concept of **reprobacy** morally objectionable.","translation":"見捨てられるという概念は、道徳的に不快だと感じる人もいる。","type":"noun","meaning_category":"theological concept"}]}