{"word":"error-cost-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(機械学習において)誤りにかかるコストを考慮する、エラーコストセンシティブな","english_definition":"(In machine learning) taking into account the cost associated with different types of errors.","examples":[{"sentence":"An error-cost-sensitive algorithm can be used to minimize the overall cost of misclassification.","translation":"エラーコストセンシティブなアルゴリズムは、誤分類の全体的なコストを最小限に抑えるために使用できます。"},{"sentence":"In medical diagnosis, false negatives may have a higher error cost than false positives, so an error-cost-sensitive model is preferred.","translation":"医療診断では、偽陰性は偽陽性よりも高いエラーコストを持つ可能性があるため、エラーコストセンシティブなモデルが好まれます。"}],"collocations":["error-cost-sensitive learning","error-cost-sensitive classification","error-cost-sensitive model"],"synonyms":["cost-sensitive","cost-weighted"],"antonyms":["cost-insensitive","error-cost-insensitive"]}],"etymology":{"value":"The term is formed by combining 'error,' 'cost,' and 'sensitive,' indicating that the algorithm or model is sensitive to the cost associated with errors.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɛrər kɔst ˈsɛnsətɪv/","syllables":"er-ror-cost-sen-si-tive"},"inflection":{"notes":"This is an adjective and does not have different forms for inflection."},"usage_notes":{"explanation":"'Error-cost-sensitive' is a term used in machine learning to describe algorithms or models that are designed to take into account the different costs associated with making different types of errors. For example, in some applications, a false negative (failing to identify a positive case) may be much more costly than a false positive (incorrectly identifying a negative case as positive). Error-cost-sensitive algorithms aim to minimize the overall cost of errors, rather than simply minimizing the number of errors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ error cost sensitive","correct":"✓ error-cost-sensitive","note":"The hyphenation is important to indicate that 'error-cost' is a single compound adjective modifying 'sensitive'."}],"priority":"★☆☆"},"related_words":{"derivatives":["cost-sensitive learning","cost-sensitive classification","cost-sensitive analysis"],"related_concepts":["machine learning","classification","cost function","false positive","false negative"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in technical and academic contexts related to machine learning.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'error-cost-sensitive' is a technical term used in the field of machine learning. It describes algorithms or models that are designed to consider the different costs associated with different types of errors. Understanding this term requires familiarity with concepts such as cost functions, false positives, and false negatives. It is typically encountered in academic papers and technical documentation related to machine learning. "},"example_sentences":[{"sentence":"The error-cost-sensitive approach improved the performance of the fraud detection system.","translation":"エラーコストセンシティブなアプローチは、不正検出システムのパフォーマンスを向上させました。","type":"adjective","meaning_category":"machine learning"},{"sentence":"We implemented an error-cost-sensitive model to handle imbalanced datasets.","translation":"不均衡なデータセットを処理するために、エラーコストセンシティブなモデルを実装しました。","type":"adjective","meaning_category":"machine learning"}]}