{"word":"Superworldliness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"超越性、超俗性、世俗を超越した状態","english_definition":"The state of being beyond or above the concerns of the world; transcendence of worldly matters.","examples":[{"sentence":"Her superworldliness was evident in her detachment from material possessions.","translation":"彼女の超俗性は、物質的な所有物への執着のなさによく表れていた。"},{"sentence":"The philosopher's teachings emphasized superworldliness as a path to enlightenment.","translation":"その哲学者の教えは、悟りへの道として超俗性を強調していた。"}],"collocations":["achieve superworldliness","demonstrate superworldliness","religious superworldliness","spiritual superworldliness"],"synonyms":["transcendence","otherworldliness","spiritual detachment","asceticism","immateriality"],"antonyms":["worldliness","materialism","secularity","earthliness"]}],"etymology":{"value":"Formed by combining \"super-\" (above, beyond) with \"worldliness\" (concern with worldly matters).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈwɜːrldlinəs/","syllables":"su-per-world-li-ness"},"inflection":{"noun_plural":"superworldlinesses (rarely used)"},"usage_notes":{"explanation":"\"Superworldliness\" refers to a state of being detached from worldly concerns, often associated with spiritual or philosophical pursuits. It implies a focus on higher, more transcendent values rather than material possessions or social status. The term is relatively uncommon and often used in philosophical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced superworldliness by ignoring his responsibilities.","correct":"✓ He practiced superworldliness by giving away his possessions and meditating daily.","note":"Superworldliness involves detachment from material concerns, not neglecting responsibilities. The corrected sentence better reflects the concept."}],"priority":"★☆☆"},"related_words":{"derivatives":["superworldly (adjective)"],"related_concepts":["asceticism","spiritualism","transcendentalism","detachment","enlightenment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, philosophical contexts)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Superworldliness\" is a rare and abstract term referring to a state of being beyond or detached from worldly concerns, often in a spiritual or philosophical context. Understanding requires familiarity with concepts like transcendence, asceticism, and immateriality. Due to its rarity and abstract nature, it is typically encountered in advanced philosophical or religious texts."},"example_sentences":[{"sentence":"The monk's **superworldliness** allowed him to find peace in solitude.","translation":"その僧侶の超俗性は、彼が孤独の中で平和を見出すことを可能にした。","type":"noun","meaning_category":"超俗性"},{"sentence":"She cultivated **superworldliness** through meditation and selfless service.","translation":"彼女は瞑想と無私の奉仕を通して超俗性を養った。","type":"noun","meaning_category":"超俗性"}]}