{"word":"Ribes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スグリ属（スグリぞく）の植物","english_definition":"a genus of about 150 species of flowering plants in the family Grossulariaceae, native throughout the temperate regions of the Northern Hemisphere. They are shrubs or small trees, typically 1–3 m tall.","examples":[{"sentence":"The genus Ribes includes currants and gooseberries.","translation":"スグリ属には、カラントやグーズベリーが含まれる。"}],"collocations":["Ribes plant","Ribes fruit","Ribes species"],"synonyms":["gooseberry","currant"],"antonyms":[]}],"etymology":{"value":"The word \"Ribes\" comes from the Old French \"ribes\", which in turn comes from the Arabic word \"ribas\" (رباس), used for a type of rhubarb. The name was transferred to the genus Ribes because some species have similar acidic fruits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪbiːz/","syllables":"Ri-bes"},"inflection":{"noun_plural":"Ribes (the plural is the same as the singular)"},"usage_notes":{"explanation":"\"Ribes\" is a botanical term referring to a genus of flowering plants. It is used in scientific and horticultural contexts. In general conversation, it's more common to refer to specific species within the genus, such as \"gooseberries\" or \"currants.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted a Ribes in my garden, it's a red.","correct":"✓ I planted a Ribes in my garden; it's a redcurrant. / ✓ I planted a redcurrant in my garden.","note":"It's better to specify the species (e.g., redcurrant, gooseberry) rather than just saying \"Ribes\"."}],"priority":"★★☆"},"related_words":{"derivatives":["Grossulariaceae (family)","currant (species)","gooseberry (species)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ribes\" is a scientific term used to refer to a genus of plants. It is typically encountered in botanical texts or discussions about horticulture. While the term itself might not be widely known, understanding that it refers to a group of plants including currants and gooseberries can aid comprehension in specific contexts."},"example_sentences":[{"sentence":"Ribes are often cultivated for their edible berries.","translation":"スグリ属の植物は、食用となるベリーのために栽培されることが多い。","type":"general","meaning_category":"general"},{"sentence":"Different species of Ribes have varying levels of resistance to diseases.","translation":"スグリ属の異なる種は、病気に対する抵抗力が異なる。","type":"scientific","meaning_category":"scientific"}]}