{"word":"yomin","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Japanese mythology) the underworld; the land of the dead.","english_definition":"In Japanese mythology, Yomi (黄泉, Yomitsu Kuni 黄泉の国, also read as Hades) is the Japanese word for the underworld.","examples":[{"sentence":"In Japanese mythology, Izanagi traveled to Yomi to bring back Izanami.","translation":"日本の神話では、イザナギはイザナミを連れ戻すために黄泉の国へ旅をした。"}],"collocations":[],"synonyms":["Hades","underworld","netherworld","afterlife"],"antonyms":["heaven","paradise"]}],"etymology":{"value":"From Japanese 黄泉 (yomi), referring to the land of the dead in Shinto mythology.","priority":"★★★"},"pronunciation":{"ipa":"/joʊˈmiːn/","syllables":"yo-min"},"inflection":{},"usage_notes":{"explanation":"Yomi is a specific term from Japanese mythology and Shinto religion. It is not a general term for 'death' or 'afterlife' but refers to a particular mythological location. It's often translated as 'the underworld' or 'the land of the dead' in English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He went to Yomi after he died, like heaven.","correct":"✓ According to Japanese mythology, he went to Yomi after he died.","note":"Yomi is a specific concept within Japanese mythology, not a general term for the afterlife or equivalent to heaven."}],"priority":"★★☆"},"related_words":{"derivatives":["Yomotsu Hirasaka (黄泉比良坂) - the slope that leads to Yomi"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in discussions of Japanese mythology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Yomi' is a term specific to Japanese mythology, referring to the underworld or land of the dead. It's not a common word in everyday English but may appear in discussions of mythology, religion, or Japanese culture. Understanding its context within Shinto beliefs is important.","priority":"★★☆"},"example_sentences":[{"sentence":"The entrance to Yomi is said to be located in Izumo Province.","translation":"黄泉の入り口は出雲の国にあると言われている。","type":"noun","meaning_category":"underworld"},{"sentence":"Izanami retreated to Yomi after her death.","translation":"イザナミは死後、黄泉の国へ退いた。","type":"noun","meaning_category":"underworld"}]}