{"word":"Loranthaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物) オオバヤドリギ科","english_definition":"a family of flowering plants, also known as the showy mistletoes, characterized by their parasitic habit on the branches of trees and shrubs.","examples":[{"sentence":"Plants in the Loranthaceae family are hemiparasitic, meaning they can photosynthesize but rely on their host for water and nutrients.","translation":"オオバヤドリギ科の植物は半寄生植物であり、光合成はできるものの、水と栄養分を宿主に頼っています。"}],"collocations":["Loranthaceae species (オオバヤドリギ科の種)","Loranthaceae distribution (オオバヤドリギ科の分布)","Loranthaceae parasitism (オオバヤドリギ科の寄生)"],"synonyms":["showy mistletoes"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Loranthus' + '-aceae' (standard suffix for plant families). 'Loranthus' comes from Greek 'lōron' (strap, thong) and 'anthos' (flower), referring to the shape of the petals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɔːrænˈθeɪsiːˌaɪ/","syllables":"Lo-ran-tha-ce-ae"},"inflection":{"noun_plural":"Loranthaceaes"},"usage_notes":{"explanation":"Loranthaceae is a botanical term referring to a specific family of flowering plants. It is primarily used in scientific and botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Loranthaceae is a type of animal.","correct":"✓ Loranthaceae is a family of plants.","note":"Loranthaceae refers to a family of plants, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["Loranthaceous (adjective: relating to or belonging to the Loranthaceae family)","Loranthus (genus within the Loranthaceae family)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Loranthaceae' is a scientific term used in botany to refer to a specific family of flowering plants known as showy mistletoes. Understanding this term requires a background in plant biology or botany. It is not commonly used in everyday language. The family is characterized by plants that are typically hemiparasitic, meaning they can perform photosynthesis but still rely on a host plant for water and nutrients."},"example_sentences":[{"sentence":"Research on Loranthaceae focuses on their ecological interactions with host trees.","translation":"オオバヤドリギ科に関する研究は、宿主の木との生態学的相互作用に焦点を当てています。","type":"noun","meaning_category":"オオバヤドリギ科"},{"sentence":"The distribution of Loranthaceae species varies greatly depending on the climate and availability of suitable host plants.","translation":"オオバヤドリギ科の種の分布は、気候と適切な宿主植物の入手可能性によって大きく異なります。","type":"noun","meaning_category":"オオバヤドリギ科"}]}