{"word":"aerobiologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"航空生物学者、空気生物学者","english_definition":"A scientist who studies airborne biological particles, such as bacteria, fungi, viruses, pollen, and algae.","examples":[{"sentence":"The aerobiologist collected samples of pollen from the air to study seasonal allergies.","translation":"航空生物学者は、季節性アレルギーを研究するために、空気中の花粉のサンプルを収集しました。"},{"sentence":"Aerobiologists play a crucial role in monitoring air quality and predicting the spread of airborne diseases.","translation":"航空生物学者は、大気質を監視し、空気感染症の蔓延を予測する上で重要な役割を果たします。"},{"sentence":"An aerobiologist studies the transport of microorganisms in the atmosphere.","translation":"航空生物学者は、大気中の微生物の輸送を研究します。"}],"collocations":["study airborne particles","monitor air quality","predict disease spread","collect air samples","research pollen dispersal"],"synonyms":["airborne biologist","atmospheric biologist"],"antonyms":[]}],"etymology":{"value":"The word \"aerobiologist\" is formed from the combination of \"aero-\" (referring to air), \"bio-\" (referring to life or living organisms), and \"-logist\" (a suffix indicating a person who studies a particular subject).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɛəroʊbaɪˈɒlədʒɪst","syllables":"a-er-o-bi-ol-o-gist"},"inflection":{"noun_plural":"aerobiologists"},"usage_notes":{"explanation":"An \"aerobiologist\" is a specialized type of biologist who focuses on biological particles that are transported through the air. This field is important for understanding allergies, respiratory diseases, and the spread of certain types of infections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aerobiologist studied the water samples.","correct":"✓ The aerobiologist studied the air samples.","note":"Aerobiologists specifically study airborne particles, not water samples."},{"incorrect":"✗ Aerobiologist is a doctor who treats allergies.","correct":"✓ An allergist is a doctor who treats allergies. An aerobiologist studies the causes of allergies.","note":"An aerobiologist studies the causes and distribution of airborne allergens, while an allergist is a medical doctor who treats allergic conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["aerobiology (noun): The study of airborne organisms and particles.","aerosol (noun): A substance enclosed under pressure and able to be released as a fine spray, typically by means of a propellant gas."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"aerobiologist\" refers to a specialized scientist who studies biological particles in the air. This includes things like pollen, fungal spores, bacteria, and viruses. Their work is important for understanding and addressing issues related to air quality, allergies, and the spread of airborne diseases. The word itself is a combination of \"aero\" (air), \"bio\" (life), and \"-logist\" (one who studies), making it relatively straightforward to understand its meaning."},"example_sentences":[{"sentence":"The aerobiologist used a specialized filter to collect airborne fungal spores.","translation":"航空生物学者は、特殊なフィルターを使用して、空気中の真菌胞子を収集しました。","type":"general","meaning_category":"study of airborne particles"},{"sentence":"Aerobiologists are working to develop better models for predicting pollen dispersal.","translation":"航空生物学者は、花粉の飛散を予測するためのより良いモデルを開発するために取り組んでいます。","type":"general","meaning_category":"predicting airborne particle behavior"},{"sentence":"The aerobiologist's research helped identify the source of the airborne allergen.","translation":"航空生物学者の研究は、空気中のアレルゲンの特定に役立ちました。","type":"general","meaning_category":"identifying airborne allergens"}]}