{"word":"shovel-mouthed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人類学)シャベル状歯を持つ","english_definition":"(anthropology) having incisor teeth with a strongly concave lingual (tongue) surface, especially common in Native American and Asian populations.","examples":[{"sentence":"The anthropologist examined the shovel-mouthed incisors of the ancient skeleton.","translation":"人類学者は古代の骨格のシャベル状の切歯を調べた。"},{"sentence":"Shovel-mouthed teeth are a common characteristic among people of East Asian descent.","translation":"シャベル状歯は東アジア系の人々の間で一般的な特徴である。"}],"collocations":["shovel-mouthed incisors","shovel-shaped incisors","dental anthropology"],"synonyms":["shovel-shaped incisors"],"antonyms":[]}],"etymology":{"value":"The term \"shovel-mouthed\" refers to the distinctive shape of the incisor teeth, which resemble a shovel due to the concavity on the lingual (tongue) surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʌvəlˌmaʊθd/","syllables":"shov-el-mouthed"},"inflection":{"notes":"Adjective, no inflections."},"usage_notes":{"explanation":"The term 'shovel-mouthed' is primarily used in the field of dental anthropology to describe a specific dental trait. It refers to incisor teeth that have a pronounced concavity on their lingual (tongue) surface, resembling the shape of a shovel. This trait is more commonly found in certain populations, particularly those of Native American and Asian descent. It is important to note that while shovel-shaped incisors are more frequent in these groups, they can also occur in other populations. The presence or absence of this trait is often used in anthropological studies to trace population origins and migration patterns.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dentist noticed the patient had shovel-mouthed teeth, indicating a problem.","correct":"✓ The dentist noticed the patient had shovel-mouthed teeth. This is a normal variation, especially common in certain populations.","note":"Having shovel-mouthed teeth is not a dental problem or indication of poor health. It's a normal variation. "},{"incorrect":"✗ The shovel-mouthed person had difficulty eating.","correct":"✓ The person had shovel-shaped incisors.","note":"The trait does not typically cause any functional issues with eating or speaking."}],"priority":"★★☆"},"related_words":{"derivatives":["shovel-shaped"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily a technical term used in anthropology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"shovel-mouthed\" is a technical term used in anthropology, specifically dental anthropology. It describes a specific trait of incisor teeth where the lingual (tongue) surface is markedly concave, resembling a shovel. This trait is more common in certain populations, such as those of Native American and Asian descent, and is used in anthropological studies to understand population origins and migrations. It is important to note that this trait is a normal variation and not a dental problem. Because of its specialized usage, the term is not commonly encountered outside of anthropological contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers used the presence of shovel-mouthed incisors to help determine the ancestry of the skeletal remains.","translation":"研究者たちは、シャベル状歯の存在を利用して、骨格の遺骸の祖先を特定するのに役立てた。","type":"adjective","meaning_category":"anthropology"},{"sentence":"The study showed a high prevalence of shovel-mouthed teeth among the indigenous population.","translation":"その研究は、先住民族の間でシャベル状歯の有病率が高いことを示した。","type":"adjective","meaning_category":"anthropology"}]}