{"word":"pseudonucleolus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偽核","english_definition":"A structure resembling a nucleolus but not having the same function or composition.","examples":[{"sentence":"The pseudonucleolus is often observed in cells undergoing apoptosis.","translation":"偽核は、アポトーシスを起こしている細胞でよく観察されます。"},{"sentence":"Unlike the nucleolus, the pseudonucleolus does not participate in ribosome biogenesis.","translation":"核小体とは異なり、偽核はリボソーム生合成には関与しません。"}],"collocations":["observe a pseudonucleolus","formation of pseudonucleolus"],"synonyms":["nuclear body","paraspeckle"],"antonyms":[]},{"part_of_speech":"noun","definition":"(細胞学) 核小体に似た構造体だが、核小体としての機能や構成要素を持たないもの。","english_definition":"(cytology) A structure within the cell nucleus that resembles the nucleolus but lacks its specific functions and components.","examples":[{"sentence":"Pseudonucleoli can be induced by certain viral infections.","translation":"偽核は特定のウイルス感染によって誘導されることがあります。"},{"sentence":"The composition of the pseudonucleolus can vary depending on the cell type and condition.","translation":"偽核の構成は、細胞の種類や状態によって異なる場合があります。"}],"collocations":["induce pseudonucleoli","composition of pseudonucleolus"],"synonyms":["nuclear inclusion","nuclear aggregate"],"antonyms":[]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"nucleolus\" (核小体)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈnjuːkliːələs/","syllables":"pseu-do-nu-cle-o-lus"},"inflection":{"noun_plural":"pseudonucleoli"},"usage_notes":{"explanation":"Pseudonucleolus is a technical term used in cell biology to describe structures that resemble nucleoli but are distinct in function and composition. They can arise under various cellular stresses or conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pseudonucleolus is the site of ribosome synthesis.","correct":"✓ The nucleolus is the site of ribosome synthesis.","note":"The nucleolus, not the pseudonucleolus, is the primary site of ribosome synthesis."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudonucleolar (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"pseudonucleolus\" is a highly specialized term in cell biology, referring to a structure that mimics the nucleolus but lacks its characteristic functions. Understanding requires a strong background in cell biology and molecular biology. It's not commonly used outside of research contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The presence of a pseudonucleolus can be an indicator of cellular stress.","translation":"偽核の存在は、細胞ストレスの指標となることがあります。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the formation of pseudonucleoli in cancer cells.","translation":"研究者たちは、がん細胞における偽核の形成を研究しています。","type":"research","meaning_category":"research"}]}