{"word":"one-handedness","priority":"low","meanings":[{"part_of_speech":"noun","definition":"片手性、片手操作、片手で行うこと","english_definition":"The state or quality of being one-handed; the ability to be operated or performed with one hand.","examples":[{"sentence":"The design of the tool allows for easy one-handedness.","translation":"その道具の設計は、片手で簡単に操作できることを可能にしている。"},{"sentence":"The athlete demonstrated impressive one-handedness during the basketball game.","translation":"その選手はバスケットボールの試合中に、見事な片手での操作技術を披露した。"},{"sentence":"One-handedness can be a useful skill in certain situations.","translation":"片手で行う能力は、特定の状況において役立つスキルとなりうる。"}],"collocations":["easy one-handedness","demonstrate one-handedness","improve one-handedness"],"synonyms":["single-handedness","unimanual operation"],"antonyms":["two-handedness","bimanual operation"]},{"part_of_speech":"noun","definition":"（医学）片手しかない状態、片手機能障害","english_definition":"(Medical) The condition of having only one hand or impaired function in one hand.","examples":[{"sentence":"The patient's one-handedness required adaptive devices for daily living.","translation":"その患者の片手機能障害は、日常生活のための適応装置を必要とした。"},{"sentence":"The rehabilitation program focused on maximizing the patient's one-handedness capabilities.","translation":"リハビリテーションプログラムは、患者の片手機能能力を最大限に引き出すことに焦点を当てた。"},{"sentence":"One-handedness can present challenges in performing certain tasks.","translation":"片手機能障害は、特定のタスクを実行する上で課題となることがある。"}],"collocations":["adaptive devices for one-handedness","rehabilitation for one-handedness","challenges of one-handedness"],"synonyms":["unilateral limb deficiency","single limb amputation"],"antonyms":["two-handedness","full limb function"]}],"etymology":{"value":"Derived from 'one-handed' + '-ness'. 'One-handed' refers to having or using only one hand. The suffix '-ness' transforms the adjective into a noun, denoting a state or quality.","priority":"low"},"pronunciation":{"ipa":"/wʌnˈhændɪdnəs/","syllables":"one-hand-ed-ness"},"inflection":{"noun_plural":"one-handednesses (rarely used)"},"usage_notes":{"explanation":"The term 'one-handedness' can refer to either the physical condition of having only one hand or the ability to perform tasks using only one hand. The context usually clarifies the intended meaning. In medical contexts, it refers to the physical condition or disability. In other contexts, it refers to the skill or design feature that allows for single-handed operation.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He showed his one-handedness to open the jar.","correct":"He showed his ability to open the jar one-handed.","note":"Using 'one-handed' as an adverb is more common than using 'one-handedness' to describe the action directly."}],"priority":"low"},"related_words":{"derivatives":["one-handed (adjective)"],"phrasal_verbs":[],"related_terms":["single-handed","unilateral","unimanual"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"'One-handedness' is a relatively uncommon term. It generally refers to the condition of having only one hand or the capability of performing tasks with one hand. Understanding requires familiarity with the base adjective 'one-handed' and the noun-forming suffix '-ness'."},"example_sentences":[{"sentence":"The device's design emphasizes ease of one-handedness.","translation":"その装置の設計は、片手での操作の容易さを重視している。","type":"noun","meaning_category":"片手操作"},{"sentence":"His one-handedness didn't stop him from becoming a skilled musician.","translation":"彼の片手機能障害は、彼が熟練した音楽家になることを妨げなかった。","type":"noun","meaning_category":"片手機能障害"}]}