{"word":"resistiveness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"電気抵抗率、比抵抗","english_definition":"a measure of the resistance of a material to the flow of electric current. It is a fundamental property of a material that quantifies how strongly it opposes the flow of electricity.","examples":[{"sentence":"Copper has a low resistiveness, making it a good conductor.","translation":"銅は電気抵抗率が低いため、優れた導体です。"},{"sentence":"The resistiveness of the semiconductor changes with temperature.","translation":"半導体の電気抵抗率は温度によって変化します。"},{"sentence":"High resistiveness materials are used as insulators.","translation":"電気抵抗率の高い材料は絶縁体として使用されます。"}],"collocations":["low resistiveness (低い電気抵抗率)","high resistiveness (高い電気抵抗率)","measure the resistiveness (電気抵抗率を測定する)","temperature dependence of resistiveness (電気抵抗率の温度依存性)","material resistiveness (材料の電気抵抗率)"],"synonyms":["specific resistance","electrical resistivity"],"antonyms":["conductivity"],"related_terms":["resistance","conductivity","ohm","conductor","insulator","semiconductor"]}],"etymology":{"value":"The word 'resistiveness' is derived from 'resistive,' which comes from 'resist.' 'Resist' comes from the Latin word 'resistere,' meaning 'to stand against' or 'oppose.' The suffix '-ness' is added to 'resistive' to form the noun 'resistiveness,' indicating the state or quality of being resistive.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɪzɪˈstɪvnəs/","syllables":"re-zis-tive-ness"},"inflection":{"noun_plural":"resistivities (less common, used when referring to different types or conditions of resistiveness)"},"usage_notes":{"explanation":"Resistiveness is an intrinsic property of a material, meaning it does not depend on the size or shape of the material. It is measured in ohm-meters (Ω⋅m) in the SI system. It's important to distinguish resistiveness from resistance, which depends on the geometry of the object. A long, thin wire will have a higher resistance than a short, thick wire made of the same material, but their resistiveness will be the same.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The resistance of the wire is its resistiveness.","correct":"✓ The resistance of the wire depends on its resistiveness, length, and cross-sectional area.","note":"Resistance is a property of a specific object, while resistiveness is a property of the material the object is made from. They are related but not the same."},{"incorrect":"✗ High resistiveness means high conductivity.","correct":"✓ High resistiveness means low conductivity.","note":"Resistiveness and conductivity are inversely related. A material with high resistiveness will have low conductivity, and vice versa."}],"priority":"★★☆"},"related_words":{"derivatives":["resistive (adjective)","resist (verb)","resistance (noun)"],"related_terms":["conductivity","ohm","conductor","insulator","semiconductor","electrical field","current density"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resistiveness' is a technical term primarily used in physics and electrical engineering. It refers to a material's inherent ability to oppose the flow of electric current. It's a concept usually encountered in higher-level science courses or in professional contexts dealing with electrical properties of materials. The term is often used in comparison to 'resistance,' which is a property of a specific object, while 'resistiveness' is a property of the material itself. Understanding this term requires a basic knowledge of electrical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **resistiveness** of the new alloy was significantly lower than that of pure iron.","translation":"その新しい合金の電気抵抗率は純粋な鉄よりも大幅に低かった。","type":"noun","meaning_category":"電気抵抗率"},{"sentence":"The experiment aimed to measure the **resistiveness** of various carbon nanotubes.","translation":"その実験は、さまざまなカーボンナノチューブの電気抵抗率を測定することを目的としていた。","type":"noun","meaning_category":"電気抵抗率"},{"sentence":"The **resistiveness** of a material is an important factor in determining its suitability for electrical wiring.","translation":"材料の電気抵抗率は、電気配線への適合性を判断する上で重要な要素です。","type":"noun","meaning_category":"電気抵抗率"}]}