{"word":"allergy-marked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アレルギー表示のある、アレルギーに関する表示がされている","english_definition":"Having a mark or label indicating the presence of allergens or providing allergy-related information.","examples":[{"sentence":"The product is allergy-marked to help consumers with sensitivities.","translation":"その製品は、敏感な体質を持つ消費者を助けるためにアレルギー表示がされています。"},{"sentence":"Make sure to choose allergy-marked food items if you have dietary restrictions.","translation":"食事制限がある場合は、必ずアレルギー表示のある食品を選んでください。"},{"sentence":"Allergy-marked packaging helps prevent accidental exposure to harmful ingredients.","translation":"アレルギー表示のある包装は、有害な成分への偶発的な暴露を防ぐのに役立ちます。"}],"collocations":["allergy-marked product","allergy-marked food","allergy-marked packaging","clearly allergy-marked","properly allergy-marked"],"synonyms":["allergen-labeled","allergy-labeled","allergy-identified"],"antonyms":["allergy-unmarked","unlabeled","unmarked"]}],"etymology":{"value":"The term is a compound word formed by combining 'allergy' (a noun referring to a damaging immune response by the body to a substance) and 'marked' (past participle of the verb 'mark,' indicating something that has a visible sign or label).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈælərʤi ˈmɑːrkt/","syllables":"al-ler-gy-marked"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Allergy-marked' is used to describe products, especially food items, that have labels or markings indicating the presence of potential allergens. These markings are intended to help individuals with allergies avoid consuming substances that could trigger an allergic reaction. The term emphasizes the presence of a clear indication or label related to allergies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was allergy marked.","correct":"✓ The food was allergy-marked.","note":"The correct form is 'allergy-marked' with a hyphen, as it is a compound adjective."},{"incorrect":"✗ The allergy marked product.","correct":"✓ The allergy-marked product.","note":"The hyphen is necessary to properly combine 'allergy' and 'marked' into a single adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["allergy","marked","allergen","allergy-free","allergy-friendly"],"phrasal_verbs":[],"related_terms":["allergy testing","allergy symptoms","food allergy","skin allergy","allergy warning","allergy information"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'allergy-marked' is a compound adjective used to describe products that have labels or markings indicating the presence of allergens. It is commonly used in contexts related to food, cosmetics, and other consumer goods where allergy information is important for consumers with sensitivities. Understanding this term requires knowledge of both 'allergy' and 'marked' and how they combine to form a specific meaning."},"example_sentences":[{"sentence":"Look for allergy-marked products when shopping for someone with food sensitivities.","translation":"食物過敏症の人に買い物をするときは、アレルギー表示のある製品を探してください。","type":"general","meaning_category":"general"},{"sentence":"This allergy-marked cereal is safe for people with nut allergies.","translation":"このアレルギー表示のあるシリアルは、ナッツアレルギーの人にとって安全です。","type":"food","meaning_category":"food"},{"sentence":"The allergy-marked cosmetics help consumers avoid irritating ingredients.","translation":"アレルギー表示のある化粧品は、消費者が刺激性のある成分を避けるのに役立ちます。","type":"cosmetics","meaning_category":"cosmetics"}]}