{"word":"arsenous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"亜ヒ酸の、三価のヒ素を含む","english_definition":"Of or pertaining to arsenic in the trivalent state; containing arsenic in the lower valence; specifically designating the lower oxide of arsenic, As₂O₃, and the acids derived from it.","examples":[{"sentence":"Arsenous compounds are generally more toxic than arsenic compounds.","translation":"一般的に、亜ヒ素化合物はヒ素化合物よりも毒性が高い。"},{"sentence":"Arsenous oxide is used in the production of insecticides.","translation":"亜ヒ酸は殺虫剤の製造に使用される。"}],"collocations":["arsenous acid","arsenous oxide","arsenous chloride"],"synonyms":["trivalent arsenic","arsenic(III)"],"antonyms":["arsenic","pentavalent arsenic"]}],"etymology":{"value":"Derived from 'arsenic' + '-ous' (suffix indicating a lower oxidation state).","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈsɛnəs/","syllables":"ar-se-nous"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are more arsenous, most arsenous, or less arsenous, least arsenous."},"usage_notes":{"explanation":"'Arsenous' specifically refers to compounds where arsenic has a +3 oxidation state. This is important in chemistry and toxicology because the oxidation state of arsenic affects its properties and toxicity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arsenous gas was released.","correct":"✓ The arsine gas was released.","note":"Arsenous refers to compounds containing arsenic in a +3 oxidation state, not elemental arsenic gas (arsine)."},{"incorrect":"✗ Arsenous is an element.","correct":"✓ Arsenic is an element; arsenous describes compounds of arsenic.","note":"Arsenic is the element. Arsenous describes compounds containing arsenic in a lower oxidation state."}],"priority":"★★☆"},"related_words":{"derivatives":["arsenite (noun: a salt or ester of arsenous acid)","arsenous acid (noun: H₃AsO₃)","arsenous oxide (noun: As₂O₃)"],"related_terms":["arsenic (noun: the element)","arsine (noun: AsH₃, arsenic trihydride)","arsenic trioxide (noun: As₂O₃)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arsenous' is a technical term used in chemistry and toxicology to describe compounds containing arsenic in a specific oxidation state (+3). It is less commonly encountered in general language. Understanding requires familiarity with basic chemistry concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The toxicity of arsenous compounds is a concern in environmental studies.","translation":"環境研究では、亜ヒ素化合物の毒性が懸念されている。","type":"general","meaning_category":"toxicity"},{"sentence":"Arsenous oxide is a precursor in the synthesis of other arsenic-containing chemicals.","translation":"亜ヒ酸は、他のヒ素含有化学物質の合成における前駆体である。","type":"chemical synthesis","meaning_category":"chemical synthesis"},{"sentence":"The properties of arsenous acid make it useful in certain industrial processes.","translation":"亜ヒ酸の特性は、特定の工業プロセスで有用である。","type":"industrial use","meaning_category":"industrial use"}]}