{"word":"unindentable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"インデントできない、字下げできない","english_definition":"Not able to be indented; not permitting indentation.","examples":[{"sentence":"This line of code is unindentable due to the syntax rules.","translation":"このコード行は、構文規則によりインデントできません。"},{"sentence":"The first line of a paragraph is often unindentable in certain formatting styles.","translation":"段落の最初の行は、特定の書式スタイルでは字下げできないことがよくあります。"}],"collocations":["unindentable code","unindentable text","unindentable line"],"synonyms":["non-indentable","fixed-indent","non-adjustable indent"],"antonyms":["indentable"],"related_terms":["indent","indentation"]}],"etymology":{"value":"The word 'unindentable' is formed by adding the prefix 'un-' (meaning 'not') to the word 'indentable'. 'Indentable' itself is formed from 'indent' (meaning to set in from the margin) and the suffix '-able' (meaning capable of being).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪˈdɛntəbəl/","syllables":"un-i-dent-a-ble"},"inflection":{"adjective_forms":{"comparative":"more unindentable","superlative":"most unindentable"}},"usage_notes":{"explanation":"'Unindentable' is primarily used in technical contexts, especially in programming and typesetting, to describe elements that cannot be indented due to constraints such as syntax rules or formatting requirements. It is less commonly used in general conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paragraph was unindentable, so I used spaces instead.","correct":"✓ The paragraph was unindentable, so I left it aligned to the margin.","note":"Using spaces to simulate indentation when something is 'unindentable' can lead to formatting inconsistencies. It's better to adjust the overall formatting or accept the lack of indentation."}],"priority":"★★☆"},"related_words":{"derivatives":["unindented"],"related_terms":["indent","indentation","outdent"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unindentable' is a technical term used to describe something that cannot be indented. This term is most commonly used in the context of computer programming, word processing, and typesetting where the ability to indent text or code is a common formatting feature. Understanding this word requires familiarity with these technical contexts."},"example_sentences":[{"sentence":"The error message indicated that the block of code was unindentable.","translation":"エラーメッセージは、そのコードブロックがインデントできないことを示していました。","type":"general","meaning_category":"cannot be indented"},{"sentence":"Due to the CSS rules, the list items were unindentable.","translation":"CSSルールにより、リスト項目はインデントできませんでした。","type":"technical","meaning_category":"cannot be indented"}]}