{"word":"linker","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(コンピュータ) リンカ、リンケージエディタ: 複数のオブジェクトファイルやライブラリを結合して実行可能なプログラムを生成するソフトウェア","english_definition":"(computing) A program that combines several object files and libraries into an executable program.","examples":[{"sentence":"The linker combines the object files created by the compiler.","translation":"リンカはコンパイラによって生成されたオブジェクトファイルを結合します。"},{"sentence":"The linker resolves external references between different modules.","translation":"リンカは異なるモジュール間の外部参照を解決します。"},{"sentence":"A linker error can occur if a required library is not specified.","translation":"必要なライブラリが指定されていない場合、リンカエラーが発生することがあります。"}],"collocations":["static linker","dynamic linker","linkage editor","object file","executable file","library"],"synonyms":["linkage editor"],"antonyms":[],"related_terms":["compiler","assembler","loader","object code","executable code"]},{"part_of_speech":"noun","definition":"(化学) リンカー: 分子や原子を結合させるための化学物質または分子の一部","english_definition":"(chemistry) A chemical substance or part of a molecule that joins molecules or atoms together.","examples":[{"sentence":"The linker molecule connects the two proteins.","translation":"リンカー分子は2つのタンパク質を結合させます。"},{"sentence":"The DNA linker sequences are important for chromatin structure.","translation":"DNAリンカー配列はクロマチン構造にとって重要です。"},{"sentence":"The linker arm in the chelating agent binds to the metal ion.","translation":"キレート剤のリンカーアームは金属イオンに結合します。"}],"collocations":["DNA linker","protein linker","cross-linker","linker arm","linker sequence"],"synonyms":["crosslinker","spacer"],"antonyms":[],"related_terms":["ligand","polymer","monomer","chemical bond"]},{"part_of_speech":"noun","definition":"(一般) 連結するもの、繋ぐもの","english_definition":"Something that connects or joins things together.","examples":[{"sentence":"The bridge serves as a linker between the two cities.","translation":"その橋は2つの都市を結ぶ役割を果たしています。"},{"sentence":"This project aims to be a linker between research and industry.","translation":"このプロジェクトは研究と産業を結びつけることを目指しています。"}],"collocations":["social linker","communication linker"],"synonyms":["connector","joiner","bridge"],"antonyms":["separator"],"related_terms":["connection","link","bond"]}],"etymology":{"value":"The word \"linker\" is derived from the verb \"link,\" which means to connect or join together. The suffix \"-er\" is added to indicate something that performs the action of linking.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪŋkər/","syllables":"link-er"},"inflection":{"noun_plural":"linkers"},"usage_notes":{"explanation":"The term \"linker\" has different meanings depending on the context. In computer science, it refers to a software tool that combines object files into an executable program. In chemistry, it refers to a molecule or chemical group that connects other molecules. In a more general sense, it can refer to anything that connects or joins things together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compiler is a linker.","correct":"✓ The linker is different from the compiler.","note":"The compiler translates source code into object code, while the linker combines object files into an executable program. They are distinct tools. "},{"incorrect":"✗ The linker connects atoms in a molecule.","correct":"✓ A linker connects atoms in a molecule.","note":"In chemistry, a linker is a molecule or chemical group, not the process of connecting atoms."}],"priority":"★★☆"},"related_words":{"derivatives":["link","linking","linked","linkable"],"phrases":["linker script","linker map"],"related_terms":["linkage","connection","binding","crosslinking"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"linker\" has specialized meanings in computer science and chemistry. In computer science, it's a program that combines object files to create an executable. In chemistry, it's a molecule that connects other molecules. Understanding the context is important to determine the correct meaning. The general sense of something that connects things is less common but still relevant."},"example_sentences":[{"sentence":"The **linker** resolved all the symbol dependencies.","translation":"リンカはすべてのシンボル依存関係を解決しました。","type":"noun","meaning_category":"(コンピュータ)リンカ"},{"sentence":"A **linker** molecule was used to conjugate the antibody to the drug.","translation":"抗体を薬物に結合させるためにリンカー分子が使用されました。","type":"noun","meaning_category":"(化学)リンカー"},{"sentence":"The organization acted as a **linker** between the community and the government.","translation":"その組織は地域社会と政府を結びつける役割を果たしました。","type":"noun","meaning_category":"(一般)繋ぐもの"}]}