{"word":"Isodomon","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(architecture) A type of ancient Greek masonry in which all courses are of equal height, and the blocks are of equal length within each course.","english_definition":"(architecture) A type of ancient Greek masonry in which all courses are of equal height, and the blocks are of equal length within each course.","examples":[{"sentence":"The Parthenon is an example of isodomon construction.","translation":"パルテノン神殿はイソドモスの建築の一例です。"}],"collocations":["isodomon masonry","isodomic masonry","isodomic construction"],"synonyms":["isodomic masonry","isodomic construction"],"antonyms":[]}],"etymology":{"value":"From the Greek words \"isos\" (equal) and \"domos\" (building).","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈsɒdəˌmɒn/","syllables":"I-so-do-mon"},"inflection":{"noun_plural":"Isodoma"},"usage_notes":{"explanation":"Isodomon refers to a specific type of masonry used in ancient Greek architecture. It is characterized by the use of blocks of equal height and, within each course, equal length. This creates a regular and orderly appearance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Isodomon is only used in Roman architecture.","correct":"✓ Isodomon is primarily associated with ancient Greek architecture.","note":"Isodomon is more closely associated with Greek architecture, although similar techniques may have been used elsewhere."}],"priority":"★★☆"},"related_words":{"derivatives":["isodomic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Isodomon is a specialized architectural term referring to a specific type of masonry in ancient Greek construction characterized by equal height and length of blocks within each course. Understanding this term requires familiarity with architectural terminology and ancient Greek building techniques."},"example_sentences":[{"sentence":"The use of isodomon in the temple's construction demonstrates the high level of precision achieved by ancient Greek builders.","translation":"神殿の建設におけるイソドモンの使用は、古代ギリシャの建築家によって達成された高レベルの精度を示しています。","type":"noun","meaning_category":"architectural term"}]}