{"word":"World-apprehended","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学) 世界を認識した、世界を理解した","english_definition":"Having an understanding or perception of the world; having apprehended the world. (Primarily used in philosophical contexts).","examples":[{"sentence":"The world-apprehended self is aware of its place in the cosmos.","translation":"世界を認識した自己は、宇宙における自身の位置を自覚している。"},{"sentence":"A truly enlightened individual possesses a world-apprehended consciousness.","translation":"真に悟りを開いた人は、世界を理解した意識を持っている。"}],"collocations":["world-apprehended self","world-apprehended consciousness","world-apprehended perspective"],"synonyms":["world-aware","world-conscious","world-perceiving","world-understanding"],"antonyms":["world-ignorant","world-unaware","uncomprehending","imperceptive"]}],"etymology":{"value":"A compound word formed by combining 'world' (referring to the totality of existence) and 'apprehended' (past participle of 'apprehend,' meaning to understand or perceive).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrld əˌprɛhɛndɪd/","syllables":"world-ap-pre-hend-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have typical inflections like plural forms."},"usage_notes":{"explanation":"The term 'world-apprehended' is primarily used in philosophical discussions, particularly those concerning phenomenology, existentialism, and related fields. It describes a state of being where an individual has a developed understanding or perception of the world around them, including its complexities, interconnectedness, and their own place within it. It suggests a deeper level of awareness than simply being 'world-aware'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child was world-apprehended.","correct":"✓ The child was becoming world-apprehended as they learned more.","note":"'World-apprehended' typically implies a developed understanding, so it's more appropriate for describing adults or individuals with significant experience or philosophical insight."},{"incorrect":"✗ He had a world-apprehended car.","correct":"✓ He had a world-apprehended view of the economic crisis.","note":"'World-apprehended' should be used to describe understanding or perception, not physical objects."}],"priority":"★☆☆"},"related_words":{"derivatives":["apprehend (verb)","apprehension (noun)","worldview (noun)","weltanschauung (noun - German, meaning worldview)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary, primarily used in academic and philosophical contexts)","frequency_google_ngram":"Very Low Frequency - A relatively rare term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'World-apprehended' is a sophisticated term primarily used in philosophical contexts to describe a deep understanding or perception of the world and one's place within it. It's not commonly used in everyday language. Understanding requires familiarity with philosophical concepts such as phenomenology and existentialism."},"example_sentences":[{"sentence":"The philosopher argued that achieving a world-apprehended state is essential for true wisdom.","translation":"その哲学者は、真の知恵を得るためには世界を理解した状態になることが不可欠だと主張した。","type":"adjective","meaning_category":"philosophical understanding"},{"sentence":"Her art reflected a deeply world-apprehended view of human suffering.","translation":"彼女の芸術は、人間の苦しみに対する深く世界を理解した視点を反映していた。","type":"adjective","meaning_category":"perspective"},{"sentence":"Through meditation, he sought to cultivate a more world-apprehended consciousness.","translation":"瞑想を通して、彼はより世界を理解した意識を育むことを目指した。","type":"adjective","meaning_category":"consciousness"}]}