{"word":"yuppie","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に)都会に住む、高収入で野心的な若い専門職の人","english_definition":"(derogatory) a young college-educated adult who is employed in a well-paying profession and who lives and works in or near a large city.","examples":[{"sentence":"The neighborhood used to be affordable, but now it's full of yuppies.","translation":"その地域は以前は手頃な価格だったが、今は都会に住む高収入な若い専門職の人々でいっぱいだ。"},{"sentence":"He's a typical yuppie, always talking about his investments and career.","translation":"彼は典型的なヤッピーで、いつも自分の投資やキャリアについて話している。"}],"collocations":["a yuppie neighborhood (ヤッピーの多い地域)","yuppie lifestyle (ヤッピーのライフスタイル)","yuppie culture (ヤッピー文化)"],"synonyms":["young urban professional","buppie (black urban professional)"],"antonyms":[],"notes":"The term is often used negatively to suggest materialism and social climbing."},{"part_of_speech":"adjective","definition":"ヤッピーの、ヤッピー的な","english_definition":"relating to or characteristic of yuppies.","examples":[{"sentence":"The restaurant has a very yuppie atmosphere.","translation":"そのレストランはとてもヤッピー的な雰囲気だ。"},{"sentence":"He has a yuppie attitude.","translation":"彼はヤッピー的な態度だ。"}],"collocations":["yuppie bar (ヤッピーが集まるバー)","yuppie values (ヤッピー的な価値観)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"An acronym of \"young urban professional.\" The term emerged in the early 1980s to describe young, ambitious professionals living in cities.","priority":"★★★"},"pronunciation":{"ipa":"/ˈjʌpi/","syllables":"yup-pie"},"inflection":{"noun_plural":"yuppies"},"usage_notes":{"explanation":"The term \"yuppie\" is often used with negative connotations, implying that someone is overly concerned with money, status, and material possessions. While it originally simply described a demographic group, it has evolved to carry a critical or satirical tone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a yuppie because he lives in the suburbs.","correct":"✓ He is a yuppie because he lives in the city center.","note":"Yuppies typically live in or near large cities, not the suburbs."},{"incorrect":"✗ She is a yuppie because she is unemployed.","correct":"✓ She is a yuppie because she has a well-paying job.","note":"Yuppies are typically employed in well-paying professions."}],"priority":"★★☆"},"related_words":{"derivatives":["yuppiedom (名詞: ヤッピーの世界)","yuppification (名詞: ヤッピー化)"],"related_terms":["buppie (black urban professional)","dink (dual income, no kids)","bobo (bourgeois bohemian)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (cultural reference)","frequency_google_ngram":"Relatively infrequent, but recognizable due to its historical context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"yuppie\" is a somewhat dated term that refers to a young, urban professional, typically with a high income and a focus on career and material success. It's often used in a slightly critical or satirical way to describe a stereotype of someone who is ambitious and materialistic. While the term was more common in the 1980s, it still appears in discussions about social and economic trends.","priority":"★★☆"},"example_sentences":[{"sentence":"The area has become a haven for **yuppies** with its trendy boutiques and upscale restaurants.","translation":"その地域は、流行のブティックや高級レストランがあり、都会に住む高収入な若い専門職の人々の安息の地となっている。","type":"noun","meaning_category":"都会に住む高収入な若い専門職の人"},{"sentence":"He embodies the **yuppie** lifestyle with his expensive car and designer clothes.","translation":"彼は高価な車やデザイナー服で、ヤッピーのライフスタイルを体現している。","type":"adjective","meaning_category":"ヤッピーの、ヤッピー的な"},{"sentence":"Many **yuppies** are drawn to the city for its career opportunities and cultural attractions.","translation":"多くのヤッピーは、キャリアの機会と文化的な魅力のために都市に惹かれる。","type":"noun","meaning_category":"都会に住む高収入な若い専門職の人"}]}