{"word":"Arachnophobia","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"クモ恐怖症","english_definition":"An extreme or irrational fear of spiders.","examples":[{"sentence":"She suffers from arachnophobia and cannot stand being near spiders.","translation":"彼女はクモ恐怖症で、クモの近くにいることに耐えられない。"},{"sentence":"Arachnophobia is one of the most common phobias.","translation":"クモ恐怖症は最も一般的な恐怖症の一つです。"}],"collocations":["have arachnophobia","suffer from arachnophobia","severe arachnophobia","treat arachnophobia"],"synonyms":["spider phobia"],"antonyms":[]}],"etymology":{"value":"The word \"arachnophobia\" comes from the Greek words \"arachne\" (meaning spider) and \"phobos\" (meaning fear).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌræknəˈfoʊbiə/","syllables":"a-rach-no-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Arachnophobia is a specific phobia, meaning it is an irrational and excessive fear of a particular object or situation. In this case, the object is spiders. People with arachnophobia may experience anxiety, panic attacks, and avoidance behaviors when confronted with spiders or even images of spiders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a arachnophobia.","correct":"✓ I have arachnophobia.","note":"\"Arachnophobia\" is a noun and does not require an article (a/an/the) before it unless you are referring to a specific instance of the phobia."},{"incorrect":"✗ I'm arachnophobic.","correct":"✓ I have arachnophobia.","note":"While \"arachnophobic\" is a valid adjective, it's more common to say \"I have arachnophobia\" to describe the condition."}],"priority":"★★☆"},"related_words":{"derivatives":["arachnophobic (adjective): having arachnophobia"],"phobias":["claustrophobia (fear of confined spaces)","acrophobia (fear of heights)","ophidiophobia (fear of snakes)"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively infrequent, but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"arachnophobia\" is a specialized term referring to the fear of spiders. It is commonly used in discussions about phobias and mental health. Although not an everyday word, it is widely understood due to its frequent appearance in popular culture and scientific contexts. Understanding the etymology (Greek roots) can aid in remembering the meaning."},"example_sentences":[{"sentence":"His arachnophobia made it impossible for him to enter the old, dusty basement.","translation":"彼のクモ恐怖症のせいで、古くて埃っぽい地下室に入ることができなかった。","type":"noun","meaning_category":"クモ恐怖症"},{"sentence":"She sought therapy to overcome her arachnophobia.","translation":"彼女はクモ恐怖症を克服するためにセラピーを受けた。","type":"noun","meaning_category":"クモ恐怖症"}]}