{"word":"lineality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"直系であること、直系関係","english_definition":"The state or quality of being in a direct line of descent from an ancestor; direct descent.","examples":[{"sentence":"The lineality of the royal family is carefully documented.","translation":"王室の直系関係は注意深く記録されている。"},{"sentence":"Lineality is important in determining inheritance rights.","translation":"直系関係は相続権を決定する上で重要である。"}],"collocations":["establish lineality (直系関係を確立する)","prove lineality (直系関係を証明する)","trace lineality (直系関係をたどる)"],"synonyms":["direct descent","genealogical succession","pedigree","ancestry"],"antonyms":["collaterality"]},{"part_of_speech":"noun","definition":"線形性、線状性","english_definition":"The property of being linear; linearity.","examples":[{"sentence":"The lineality of the equation allows for a simple solution.","translation":"その方程式の線形性により、簡単な解法が可能になる。"},{"sentence":"Lineality is a key assumption in many statistical models.","translation":"線形性は多くの統計モデルにおける重要な仮定である。"}],"collocations":["assume lineality (線形性を仮定する)","test for lineality (線形性をテストする)"],"synonyms":["linearity"],"antonyms":["nonlinearity"]}],"etymology":{"value":"Derived from 'linear' + '-ity'. 'Linear' comes from Latin 'linearis', from 'linea' (line). '-ity' is a suffix denoting a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪniˈæləti/","syllables":"li-ne-al-i-ty"},"inflection":{"noun_plural":"linealities"},"usage_notes":{"explanation":"The word 'lineality' has two primary meanings: one related to direct descent in genealogy, and the other related to the property of being linear, particularly in mathematics and statistics. The genealogical sense is less common in everyday language than the mathematical sense. When used in a genealogical context, it emphasizes the direct line of ancestry, excluding collateral relatives. In a mathematical context, it refers to the property of a relationship or function where the output varies directly with the input.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lineality of the painting was striking.","correct":"✓ The linearity of the painting was striking.","note":"When referring to the visual characteristic of being composed of lines, 'linearity' is more appropriate than 'lineality'. 'Lineality' is better suited for discussions of ancestry or mathematical properties."}],"priority":"★★☆"},"related_words":{"derivatives":["linear","lineal","linearly","linearity"],"related_terms":["collaterality (傍系関係)","genealogy (系図学)","descent (血統)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lineality' is a relatively uncommon word with two main meanings. One meaning refers to the direct line of descent from an ancestor, which is often relevant in discussions of family history or inheritance. The other meaning, more common in technical fields like mathematics and statistics, refers to the property of being linear. Because it is a specialized term, its usage is typically limited to contexts where these specific meanings are relevant."},"example_sentences":[{"sentence":"The king's claim to the throne rested on his proven lineality from the previous monarch.","translation":"王の王位継承権は、先代の君主からの証明された直系関係に基づいていた。","type":"noun","meaning_category":"直系関係"},{"sentence":"The model assumes the lineality of the relationship between the variables.","translation":"そのモデルは、変数間の関係の線形性を仮定している。","type":"noun","meaning_category":"線形性"}]}