{"word":"norm-referenced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(テストなどが)標準参照された、相対評価の","english_definition":"(of a test or assessment) designed to compare and rank test takers in relation to one another; evaluating performance in terms of a comparison group.","examples":[{"sentence":"The standardized test is norm-referenced, so students are ranked against each other.","translation":"その標準化テストは標準参照されているため、生徒たちは互いに比較してランク付けされます。"},{"sentence":"Norm-referenced assessments are often used for college admissions.","translation":"標準参照評価は、大学入学選考によく使用されます。"},{"sentence":"Unlike criterion-referenced tests, norm-referenced tests do not measure mastery of specific content.","translation":"基準参照テストとは異なり、標準参照テストは特定のコンテンツの習得度を測定しません。"}],"collocations":["norm-referenced test (標準参照テスト)","norm-referenced assessment (標準参照評価)","norm-referenced interpretation (標準参照解釈)","norm-referenced scoring (標準参照スコアリング)"],"synonyms":["relative","comparative","standardized"],"antonyms":["criterion-referenced","absolute"],"related_terms":["percentile","standard deviation","bell curve"]}],"etymology":{"value":"The term is derived from the concept of a 'norm' (a standard or average) to which individual scores are referenced.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈnɔːrm ˈrefrənst/","syllables":"norm-ref-renced"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Norm-referenced' describes a type of evaluation where an individual's performance is compared to a larger group (the 'norm' group). The score indicates how well someone performs relative to others, rather than whether they have mastered specific skills or knowledge. This is often used in situations where ranking or selection is necessary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The test is norm-reference.","correct":"✓ The test is norm-referenced.","note":"Ensure the correct spelling of 'norm-referenced' with the '-ed' ending."},{"incorrect":"✗ This test measures absolute knowledge, so it's norm-referenced.","correct":"✓ This test measures relative performance, so it's norm-referenced.","note":"Norm-referenced tests measure relative performance, not absolute knowledge."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["standardization","percentile rank","normal distribution","bell curve","assessment","evaluation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Norm-referenced' is a term used in education and assessment to describe tests that compare a student's performance to that of other students. Instead of measuring whether a student has mastered specific skills, it shows how well they performed compared to the average. This type of assessment is often used for ranking students or for making decisions about admissions or scholarships. It's important to understand that a norm-referenced test doesn't tell you what a student knows, but rather how they perform in relation to others."},"example_sentences":[{"sentence":"The IQ test is a classic example of a norm-referenced assessment.","translation":"IQテストは、標準参照評価の典型的な例です。","type":"general","meaning_category":"assessment"},{"sentence":"The results of the norm-referenced test showed that she scored in the 90th percentile.","translation":"標準参照テストの結果は、彼女が90パーセンタイルにランクインしたことを示しました。","type":"result","meaning_category":"performance"},{"sentence":"Norm-referenced tests are often criticized for promoting competition among students.","translation":"標準参照テストは、生徒間の競争を促進すると批判されることがよくあります。","type":"criticism","meaning_category":"evaluation"}]}