{"word":"colluvial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学) 崩積土の、集積土の","english_definition":"(geology) relating to or consisting of colluvium.","examples":[{"sentence":"The colluvial deposits were rich in minerals.","translation":"その崩積土堆積物は鉱物が豊富だった。"},{"sentence":"Colluvial soils are often found at the base of slopes.","translation":"崩積土壌はしばしば斜面の麓に見られる。"}],"collocations":["colluvial soil","colluvial deposit","colluvial material","colluvial fan"],"synonyms":["alluvial","sedimentary","residual"],"antonyms":[]}],"etymology":{"value":"From Latin 'colluere' meaning 'to wash together'.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈluːviəl/","syllables":"col-lu-vi-al"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Colluvial' refers specifically to geological material or soil that has been transported and deposited primarily by gravity, such as through landslides, soil creep, or rockfall. It is often found at the base of slopes or hills. It is distinct from alluvial deposits, which are transported by water.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The alluvial soil was found on the steep slope.","correct":"The colluvial soil was found on the steep slope.","note":"Alluvial soils are deposited by water, while colluvial soils are deposited by gravity. Steep slopes are more likely to have colluvial soils."}],"priority":"★★☆"},"related_words":{"derivatives":["colluvium (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'colluvial' is a technical term used in geology and soil science to describe material that has accumulated at the base of a slope due to gravity. It is important to understand the distinction between colluvial and alluvial, as the former is associated with gravity-driven processes, while the latter is associated with water-driven processes. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The vineyard was planted on colluvial soil, which provided excellent drainage.","translation":"そのブドウ畑は崩積土壌に植えられており、優れた排水性を提供していた。","type":"adjective","meaning_category":"崩積土の"},{"sentence":"The colluvial fan at the base of the mountain was formed by centuries of erosion.","translation":"山の麓にある崩積錐は、何世紀にもわたる浸食によって形成された。","type":"adjective","meaning_category":"崩積土の"}]}