{"word":"Purgers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) 大掃除をする人、浄化する人、粛清する人","english_definition":"(plural) People who perform a purge, i.e., to rid (someone or something) of unwanted qualities, conditions, or feelings; cleanse; purify; to remove (undesirable people) from a group, country, etc., often violently and suddenly.","examples":[{"sentence":"The new regime was known for its ruthless purgers.","translation":"その新しい政権は、冷酷な粛清者で知られていた。"},{"sentence":"The party's purgers eliminated all dissenters.","translation":"党の粛清者たちは、すべての反対者を排除した。"}],"collocations":["ruthless purgers (冷酷な粛清者)","political purgers (政治的な粛清者)","ideological purgers (思想的な粛清者)"],"synonyms":["cleansers","purifiers","eliminators","exterminators","expurgators"],"antonyms":["polluters","contaminators","corruptors","protectors","preservers"]}],"etymology":{"value":"The word 'purgers' is derived from the verb 'purge', which comes from the Latin word 'purgare' meaning 'to cleanse'. The suffix '-er' is added to indicate someone who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrdʒərz/","syllables":"Pur-gers"},"inflection":{"noun_plural":"Purgers"},"usage_notes":{"explanation":"'Purgers' refers to individuals or groups who carry out a 'purge'. A purge can be a literal cleansing or purification, but it more commonly refers to the removal of undesirable elements from a group or organization, often through violent or forceful means. The term often carries a negative connotation, implying injustice and brutality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The purgers purged the building with water.","correct":"✓ The purgers purged the dissidents from the party.","note":"'Purgers' are people who perform the purging, not the method used to purge. The sentence should reflect the removal of people or ideas, not physical objects."}],"priority":"★★☆"},"related_words":{"derivatives":["purge (verb, noun)","purging (gerund, participle)","purgation (noun)","purgative (adjective, noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'purgers' is a relatively uncommon term that is primarily used in political or historical contexts. It refers to individuals who actively participate in the removal of unwanted or undesirable elements from a group or organization, often through forceful or violent means. Understanding the term requires familiarity with the concept of 'purging' and its implications of power, control, and potential abuse."},"example_sentences":[{"sentence":"The historical accounts detailed the actions of the purgers during the French Revolution.","translation":"その歴史的な記録は、フランス革命中の粛清者たちの行動を詳細に記述していた。","type":"noun","meaning_category":"Historical Context"},{"sentence":"The company hired consultants as purgers to eliminate inefficiencies and redundancies.","translation":"会社は、非効率と冗長性を排除するために、コンサルタントを粛清者として雇った。","type":"noun","meaning_category":"Business/Organizational Context"},{"sentence":"The dictator's inner circle was filled with loyal purgers who enforced his policies without question.","translation":"独裁者の側近は、彼の政策を疑問なく実行する忠実な粛清者で満たされていた。","type":"noun","meaning_category":"Political Context"}]}