{"word":"inofficiosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)遺言無効の理由となる、遺留分を侵害する行為、遺言の不当性","english_definition":"(law) the state or fact of violating the duty of affection or natural obligation to one's heirs; a will that fails to make adequate provision for one's family.","examples":[{"sentence":"The lawyer argued the inofficiosity of the will, citing the testator's failure to provide for his children.","translation":"弁護士は、遺言者が子供たちのために適切な条項を設けなかったことを理由に、その遺言の不当性を主張した。"},{"sentence":"In Roman law, a will could be challenged on grounds of inofficiosity if it unjustly disinherited close relatives.","translation":"ローマ法では、近親者を不当に相続から排除した場合、遺言はその不当性を理由に異議申し立てを受ける可能性があった。"}],"collocations":["claim of inofficiosity","grounds for inofficiosity","challenge based on inofficiosity"],"synonyms":["unnaturalness","unreasonableness","unfairness","inequity","disinheritance"],"antonyms":["fairness","reasonableness","equity"]}],"etymology":{"value":"Derived from Late Latin 'inofficiosus,' meaning 'undutiful' or 'contrary to duty,' which comes from 'in-' (not) + 'officiosus' (dutiful, obliging). 'Officiosus' itself comes from 'officium' (duty, service).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnəˌfɪʃiˈɒsɪti/","syllables":"in-of-fi-ci-os-i-ty"},"inflection":{"noun_plural":"inofficiosities"},"usage_notes":{"explanation":"'Inofficiosity' is a legal term, primarily used in the context of wills and inheritance law. It refers to the situation where a will is considered invalid or questionable because it fails to adequately provide for the testator's close family members, who would normally be considered the natural objects of their bounty. The concept is rooted in the idea that individuals have a moral or legal duty to provide for their families, and a will that completely disregards this duty may be challenged in court. The term is more commonly encountered in legal discussions and historical contexts, particularly when discussing Roman law or civil law systems that have similar provisions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inofficiosity of the machine caused it to break down.","correct":"✓ The malfunction of the machine caused it to break down.","note":"'Inofficiosity' refers specifically to the unjustness of a will, not to the malfunctioning of a machine. Use 'malfunction' or another appropriate term instead."},{"incorrect":"✗ His inofficiosity made him unpopular.","correct":"✓ His lack of consideration made him unpopular.","note":"'Inofficiosity' is not a general term for rudeness or lack of consideration. Use other terms like 'lack of consideration,' 'discourtesy,' or 'rudeness' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["inofficious (adjective: lacking in duty or kindness)"],"phrases":["action for reduction of inofficious testament (法律用語: 遺留分減殺請求訴訟)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, primarily legal contexts)","frequency_google_ngram":"Extremely low frequency - primarily a legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Inofficiosity' is a highly specialized legal term referring to the condition of a will being potentially invalid because it unfairly deprives close family members of their expected inheritance. It's a concept often discussed in legal settings, particularly when examining inheritance laws and the rights of heirs. This term is rarely used outside of legal or historical discussions related to wills and estates."},"example_sentences":[{"sentence":"The court examined the will for signs of inofficiosity, focusing on the disproportionate distribution of assets.","translation":"裁判所は、資産の不均衡な分配に焦点を当て、遺言に不当性がないか審査した。","type":"noun","meaning_category":"遺言の不当性"},{"sentence":"The claim of inofficiosity was based on the fact that the testator left his entire estate to a charity, excluding his children.","translation":"遺留分侵害の主張は、遺言者が全財産を慈善団体に寄付し、子供たちを排除したという事実に基づいていた。","type":"noun","meaning_category":"遺留分を侵害する行為"}]}