{"word":"parasitism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"寄生（きせい）","english_definition":"A relationship between two species in which one species (the parasite) benefits and the other species (the host) is harmed.","examples":[{"sentence":"Parasitism is a common ecological interaction.","translation":"寄生は一般的な生態学的相互作用です。"},{"sentence":"The parasite benefits from the parasitism, while the host suffers.","translation":"寄生者は寄生から利益を得る一方、宿主は苦しみます。"},{"sentence":"Some plants exhibit parasitism by drawing nutrients from other plants.","translation":"他の植物から栄養分を吸収することで、寄生を示す植物もあります。"}],"collocations":["obligate parasitism (絶対寄生)","facultative parasitism (条件的寄生)","social parasitism (社会寄生)","brood parasitism (托卵)"],"synonyms":["exploitation","infestation","dependence"],"antonyms":["mutualism","symbiosis","commensalism"]},{"part_of_speech":"noun","definition":"寄生根性（きせいこんじょう）","english_definition":"Behavior in which one person habitually relies on others for support or advantage without offering fair compensation.","examples":[{"sentence":"His parasitism on his family became a source of tension.","translation":"彼の家族への寄生根性は、緊張の原因となった。"},{"sentence":"The company discouraged parasitism among its employees.","translation":"会社は従業員間の寄生根性を阻止しました。"},{"sentence":"She accused him of parasitism because he never contributed to the household expenses.","translation":"彼女は彼が家計費に全く貢献しないので、寄生根性だと非難した。"}],"collocations":["social parasitism (社会寄生)","economic parasitism (経済的寄生)"],"synonyms":["dependence","leeching","sponging","exploitation"],"antonyms":["self-reliance","independence","self-sufficiency"]}],"etymology":{"value":"Derived from the Greek word 'parasitos' (παράσιτος), meaning 'one who eats at the table of another,' from 'para-' (beside) + 'sitos' (food).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpærəˌsɪtɪzəm/","syllables":"pa-ra-si-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Parasitism refers to a relationship where one organism benefits at the expense of another. In biology, it describes the interaction between a parasite and its host. Figuratively, it can describe a person who takes advantage of others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The parasitism is good for both organisms.","correct":"Parasitism is harmful to the host organism.","note":"Parasitism benefits the parasite but harms the host."},{"incorrect":"He shows parasitism by working hard.","correct":"He shows parasitism by relying on others to do his work.","note":"Parasitism involves taking advantage of others, not working hard."}],"priority":"★★☆"},"related_words":{"derivatives":["parasite (noun)","parasitic (adjective)","parasitically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in scientific or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parasitism' is a term used to describe a relationship where one organism benefits at the expense of another. It's often used in biology to describe how parasites live off hosts. It can also be used more broadly to describe situations where someone takes advantage of others. Because it's a more specialized term, it's more common in scientific or academic settings."},"example_sentences":[{"sentence":"Ticks are an example of parasitism, as they feed on the blood of animals.","translation":"ダニは寄生の例であり、動物の血を吸って生きています。","type":"noun","meaning_category":"Biological parasitism"},{"sentence":"Some argue that welfare programs encourage parasitism by making people dependent on government assistance.","translation":"福祉プログラムは人々を政府の援助に依存させることで寄生を助長すると主張する人もいます。","type":"noun","meaning_category":"Social parasitism"},{"sentence":"Brood parasitism is a reproductive strategy used by some birds, where they lay their eggs in the nests of other species.","translation":"托卵は一部の鳥が用いる繁殖戦略であり、他の種の巣に卵を産みます。","type":"noun","meaning_category":"Brood parasitism"},{"sentence":"The novel explores themes of economic parasitism and exploitation.","translation":"その小説は経済的寄生と搾取のテーマを探求しています。","type":"noun","meaning_category":"Economic parasitism"},{"sentence":"The relationship between the cuckoo and the reed warbler is a classic example of parasitism.","translation":"カッコウとヨシキリの関係は、寄生の典型的な例です。","type":"noun","meaning_category":"Biological parasitism"}]}