{"word":"costumey","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"衣装を着ているような、コスチュームを着ているような","english_definition":"Resembling or suggestive of a costume; characterized by elaborate or theatrical clothing.","examples":[{"sentence":"The play felt a bit too costumey, lacking a sense of realism.","translation":"その劇は少し衣装を着ているように感じられ、現実感が欠けていた。"},{"sentence":"The party had a costumey atmosphere, with everyone dressed up in elaborate outfits.","translation":"パーティーはコスチュームを着ているような雰囲気で、みんな手の込んだ衣装を着ていた。"}],"collocations":["costumey atmosphere","costumey event","costumey party","costumey production"],"synonyms":["theatrical","fancy","elaborate","ornate","stagy","affected"],"antonyms":["plain","simple","understated","realistic","natural"]},{"part_of_speech":"adjective","definition":"（イベントなどが）コスチュームを着用することが期待される、コスチュームが重要な要素である","english_definition":"Relating to or involving costumes; where costumes are a significant or expected element.","examples":[{"sentence":"It's a costumey affair, so be sure to dress up!","translation":"コスチュームを着ることが期待されるイベントなので、必ずドレスアップしてください！"},{"sentence":"The costumey aspect of the convention is what attracts many attendees.","translation":"そのコンベンションのコスチュームを着るという側面が、多くの参加者を引きつけている。"}],"collocations":["costumey affair","costumey convention","costumey celebration"],"synonyms":["fancy dress","themed","dress-up"],"antonyms":["casual","informal","non-themed"]}],"etymology":{"value":"Derived from \"costume\" + \"-y\" (suffix indicating resemblance or characteristic).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒstjuːmi/","syllables":"cos-tu-mey"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically \"more costumey\" and \"most costumey\" respectively, though less common."},"usage_notes":{"explanation":"The adjective \"costumey\" describes something that resembles or is characterized by costumes. It can refer to an event where costumes are expected or to something that appears overly theatrical or artificial due to its elaborate clothing. It often carries a connotation of being somewhat artificial or exaggerated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was very costumey.","correct":"✓ The room was decorated in a costumey style.","note":"\"Costumey\" typically describes the style or atmosphere, not a physical space directly. It's better to describe the style or atmosphere as being costumey."},{"incorrect":"✗ He is a costumey person.","correct":"✓ He is a person who likes to wear costumes.","note":"It's more common to say someone likes to wear costumes rather than describing them as a \"costumey person.\""}],"priority":"★★☆"},"related_words":{"derivatives":["costume","costumer","costuming"],"related_terms":["fancy dress","cosplay","masquerade"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Costumey\" is a relatively uncommon adjective used to describe something that is reminiscent of or related to costumes. It suggests an atmosphere or style that is theatrical, elaborate, or artificial due to the presence or expectation of costumes. It is not a core vocabulary word but is useful for describing specific types of events or aesthetics.","priority":"★★☆"},"example_sentences":[{"sentence":"The opera's staging was incredibly costumey, with each character in an extravagant outfit.","translation":"そのオペラの舞台演出は信じられないほど衣装じみており、各キャラクターが豪華な衣装を身に着けていた。","type":"adjective","meaning_category":"衣装を着ているような"},{"sentence":"The annual Halloween party is always a very costumey event.","translation":"毎年恒例のハロウィンパーティーはいつもとてもコスチュームを着るイベントです。","type":"adjective","meaning_category":"コスチュームが重要な要素である"},{"sentence":"The restaurant had a strangely costumey feel, like stepping into a historical drama.","translation":"そのレストランは奇妙なほど衣装を着ているような雰囲気で、まるで歴史ドラマに足を踏み入れたかのようだった。","type":"adjective","meaning_category":"衣装を着ているような"}]}