{"word":"debatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"議論するように、議論しながら、議論の余地があるように","english_definition":"In a manner that involves or suggests debate; in a way that is open to discussion or disagreement.","examples":[{"sentence":"He looked at the proposal debatingly, clearly unsure of its merits.","translation":"彼は提案を議論するように見て、明らかにそのメリットを確信していなかった。"},{"sentence":"She presented her findings debatingly, inviting feedback from the audience.","translation":"彼女は聴衆からのフィードバックを求めながら、議論の余地があるように調査結果を発表した。"},{"sentence":"The issue was approached debatingly, with various perspectives considered.","translation":"その問題は、さまざまな視点が考慮されながら、議論の余地があるように取り組まれた。"}],"collocations":["look debatingly","present debatingly","approach debatingly","consider something debatingly"],"synonyms":["argumentatively","disputatiously","questioningly","hesitantly","tentatively","in a controversial manner","in a questionable manner"],"antonyms":["decisively","definitely","certainly","unquestionably","conclusively","resolutely"]}],"etymology":{"value":"Formed from the verb 'debate' and the suffix '-ingly'. 'Debate' comes from the Old French 'debatre' (to fight, contend), which in turn comes from the Latin 'battuere' (to beat, strike). The suffix '-ingly' transforms the verb into an adverb, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈbeɪtɪŋli/","syllables":"de-bat-ing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Debatingly' is an adverb that describes an action performed in a manner that suggests or involves debate. It implies a questioning or argumentative approach, where different viewpoints are considered or expressed. The word is often used to describe how someone speaks, acts, or presents information, indicating that they are open to discussion, disagreement, or further consideration. It suggests a lack of certainty or a willingness to explore different perspectives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He debatingly decided to accept the offer.","correct":"✓ He hesitantly decided to accept the offer.","note":"'Debatingly' implies a manner of presenting or considering something. If the intention is to convey hesitation in making a decision, 'hesitantly' is more appropriate."},{"incorrect":"✗ The evidence was presented debatingly, proving his innocence.","correct":"✓ The evidence was presented convincingly, proving his innocence.","note":"If the intention is to convey that the evidence was presented in a way that proves something, 'convincingly' is more appropriate. 'Debatingly' suggests that the evidence was presented in a way that invites discussion or disagreement."}],"priority":"★★☆"},"related_words":{"derivatives":["debate (noun, verb)","debatable (adjective)","debated (adjective)","debater (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'debatingly' is an adverb that describes the manner in which something is done, specifically suggesting that it is done in a way that involves or invites debate. It implies a questioning or argumentative approach, where different viewpoints are considered or expressed. The word is not commonly used in everyday conversation and is more likely to be found in formal writing or discussions where nuanced descriptions of behavior are required. The word suggests a lack of certainty or a willingness to explore different perspectives. It is important to distinguish 'debatingly' from adverbs that describe the outcome or result of a discussion, such as 'conclusively' or 'decisively'."},"example_sentences":[{"sentence":"She considered the problem debatingly, weighing all the options before speaking.","translation":"彼女は発言する前にすべての選択肢を検討し、問題を議論するように考えた。","type":"general","meaning_category":"manner of considering"},{"sentence":"The lawyer presented the case debatingly, acknowledging the weaknesses in his argument.","translation":"弁護士は、自身の主張の弱点を認めながら、議論の余地があるように事件を提示した。","type":"general","meaning_category":"manner of presenting"},{"sentence":"The committee approached the issue debatingly, seeking input from all members.","translation":"委員会はすべてのメンバーからの意見を求めながら、問題を議論の余地があるように検討した。","type":"general","meaning_category":"manner of approaching"}]}