{"word":"technology-positive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a generally optimistic or favorable view of technology and its potential benefits.","english_definition":"Characterized by a generally optimistic or favorable view of technology and its potential benefits; believing that technology is a force for good.","examples":[{"sentence":"The company has a technology-positive culture, always eager to adopt new tools.","translation":"その会社はテクノロジーに対して前向きな文化を持っており、常に新しいツールを導入することに意欲的です。"},{"sentence":"She is technology-positive and believes that AI can solve many of the world's problems.","translation":"彼女はテクノロジーに対して肯定的であり、AIが世界の多くの問題を解決できると信じています。"},{"sentence":"A technology-positive approach can lead to innovative solutions.","translation":"テクノロジーに対して前向きなアプローチは、革新的な解決策につながる可能性があります。"}],"collocations":["technology-positive attitude","technology-positive culture","technology-positive mindset","technology-positive outlook"],"synonyms":["tech-optimistic","pro-technology","technology-friendly"],"antonyms":["technology-negative","tech-pessimistic","technophobic"]}],"etymology":{"value":"A compound word formed by combining 'technology' with 'positive'.","priority":"N/A"},"pronunciation":{"ipa":"/tɛkˈnɒlədʒi ˈpɒzətɪv/","syllables":"tech-nol-o-gy-pos-i-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., very technology-positive)."},"usage_notes":{"explanation":"'Technology-positive' is a relatively new term often used in discussions about the impact of technology on society, business, and culture. It describes an attitude or perspective that sees technology as primarily beneficial and tends to focus on its potential to improve various aspects of life. It is often contrasted with 'technology-negative' or 'tech-pessimistic' viewpoints.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a technology positive person.","correct":"✓ He is a technology-positive person.","note":"The hyphen is important to connect 'technology' and 'positive' when used as a compound adjective before a noun."},{"incorrect":"✗ The technology positive is good.","correct":"✓ The technology-positive approach is good.","note":"'Technology-positive' is an adjective and needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["technology","positive","technophile","technophobia"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - relatively new and specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Technology-positive' is a compound adjective describing someone or something that has a generally optimistic or favorable view of technology. It suggests a belief that technology is a force for good and has the potential to solve problems and improve lives. This term is often used in discussions about the societal impact of technology. It is the opposite of 'technology-negative' or 'tech-pessimistic.'"},"example_sentences":[{"sentence":"The company's technology-positive stance has led to rapid innovation.","translation":"その会社のテクノロジーに対する前向きな姿勢が、急速なイノベーションにつながっています。","type":"adjective","meaning_category":"Optimistic view of technology"},{"sentence":"We need more technology-positive leaders in government to drive progress.","translation":"進歩を推進するためには、政府にはより多くのテクノロジーに対して前向きなリーダーが必要です。","type":"adjective","meaning_category":"Optimistic view of technology"},{"sentence":"The conference focused on the benefits of a technology-positive approach to education.","translation":"その会議では、教育に対するテクノロジーに対して前向きなアプローチの利点に焦点が当てられました。","type":"adjective","meaning_category":"Optimistic view of technology"}]}