{"word":"cottered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(機械部品などが)コッターで固定された","english_definition":"Fitted or fastened with a cotter (a pin or wedge passing through a hole to fix parts together).","examples":[{"sentence":"a cottered axle","translation":"コッターで固定された車軸"},{"sentence":"cottered cranks","translation":"コッターで固定されたクランク"}],"collocations":[],"synonyms":["pinned","wedged","fastened"],"antonyms":["unfastened","loose"]}],"etymology":{"value":"Derived from the noun 'cotter,' referring to a pin or wedge used to fasten machine parts. The suffix '-ed' indicates the state of being fitted or fastened with a cotter.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒtərd/","syllables":"cot-tered"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb."},"usage_notes":{"explanation":"'Cottered' is a technical term primarily used in engineering and mechanics to describe parts that are joined using a cotter pin. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["cotter (noun): A pin or wedge used to fasten parts together.","cotter pin (noun): A split pin used for fastening.","cotter joint (noun): A type of mechanical joint using a cotter.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cottered' is a specialized term used in engineering and mechanics. It describes something that is fastened with a cotter, which is a type of pin or wedge. Due to its technical nature, it is not commonly encountered outside of these specific fields."},"example_sentences":[{"sentence":"The bicycle's cranks were cottered to the bottom bracket spindle.","translation":"その自転車のクランクは、コッターによってボトムブラケットのスピンドルに固定されていた。","type":"adjective","meaning_category":"コッターで固定された"},{"sentence":"Cottered joints were commonly used in older machinery.","translation":"コッター継手は、古い機械によく使用されていた。","type":"adjective","meaning_category":"コッターで固定された"}]}