{"word":"Hydrocoralline","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロサンゴ類：刺胞動物門花虫綱に属するサンゴの一種で、石灰質の骨格を持つ。","english_definition":"Any of various colonial marine hydrozoans of the order Anthoathecata, characterized by a massive calcareous skeleton resembling that of true corals.","examples":[{"sentence":"Hydrocorallines are often brightly colored and contribute to reef ecosystems.","translation":"ヒドロサンゴ類はしばしば鮮やかな色をしており、礁生態系に貢献しています。"}],"collocations":["hydrocoralline colony","hydrocoralline skeleton","hydrocoralline reef"],"synonyms":["stinging coral","lace coral"],"antonyms":[]}],"etymology":{"value":"'Hydro-' (水) + 'coralline' (サンゴのような)に由来。","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈkɔːrəˌlaɪn/","syllables":"Hy-dro-co-ral-line"},"inflection":{"noun_plural":"Hydrocorallines"},"usage_notes":{"explanation":"Hydrocorallines are not true corals, but are hydrozoans that secrete a hard, calcareous skeleton. They are often brightly colored and can cause painful stings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydrocoralline is a true coral.","correct":"✓ Hydrocoralline is a hydrozoan that resembles coral.","note":"Hydrocorallines are not true corals, but are closely related to jellyfish and hydroids."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrocoral"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hydrocoralline is a technical term used in marine biology and oceanography. It refers to a specific group of colonial hydrozoans that secrete a calcareous skeleton, resembling true corals. Understanding this term requires a background in zoology or marine science."},"example_sentences":[{"sentence":"The hydrocoralline colonies provide habitat for many small fish and invertebrates.","translation":"ヒドロサンゴ類のコロニーは、多くの小魚や無脊椎動物の生息地を提供しています。","type":"noun","meaning_category":"Marine Biology"},{"sentence":"Divers should be cautious when approaching hydrocoralline, as they can inflict painful stings.","translation":"ダイバーはヒドロサンゴ類に近づく際には注意が必要です。なぜなら、それらは痛みを伴う刺傷を引き起こす可能性があるからです。","type":"noun","meaning_category":"Marine Biology"}]}