{"word":"fertilization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"受精、受粉","english_definition":"The process of fertilizing an egg, female animal, or plant, involving the fusion of male and female gametes to form a zygote.","examples":[{"sentence":"Fertilization occurs when the sperm cell unites with the egg cell.","translation":"受精は精子細胞が卵細胞と結合するときに起こります。"},{"sentence":"Successful fertilization is essential for the development of a new organism.","translation":"受精の成功は新しい生物の発生に不可欠です。"},{"sentence":"In plants, fertilization follows pollination.","translation":"植物では、受精は受粉に続きます。"}],"collocations":["in vitro fertilization (体外受精)","artificial fertilization (人工授精)","cross-fertilization (異種受精、異花受粉)","self-fertilization (自家受精、自家受粉)","double fertilization (重複受精)"],"synonyms":["conception","impregnation","pollination","breeding"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'fertilize', which comes from the Latin 'fertilis' meaning 'fruitful' or 'fertile'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɜːrtɪlaɪˈzeɪʃən/","syllables":"fer·ti·li·za·tion"},"inflection":{"noun_plural":"fertilizations"},"usage_notes":{"explanation":"'Fertilization' refers to the process where male and female reproductive cells (gametes) fuse to create a new individual. In animals, this typically involves the union of a sperm and an egg. In plants, it often follows pollination and involves the fusion of gametes within the ovule. The term can be used generally to describe the process or specifically in the context of assisted reproductive technologies like in vitro fertilization (IVF).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The fertilization of the soil is important for agriculture.","correct":"The fertilization of the soil with fertilizers is important for agriculture.","note":"While 'fertilization' can sometimes loosely refer to enriching soil, it's more accurate to use 'fertilizing' or specify 'fertilization with fertilizers' in that context. 'Fertilization' primarily refers to the biological process of gamete fusion."}],"priority":"★★☆"},"related_words":{"derivatives":["fertilize (verb)","fertilized (adjective)","fertilizer (noun)","fertility (noun)","fertile (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, primarily used in scientific or medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Fertilization' is a scientific term referring to the process of combining male and female reproductive cells to create a new organism. It's commonly used in biology, medicine, and agriculture. Understanding this term requires a good grasp of biological concepts related to reproduction. It appears more frequently in scientific texts than in everyday conversation."},"example_sentences":[{"sentence":"The study examined the effects of different temperatures on the rate of fertilization.","translation":"その研究では、異なる温度が受精の速度に与える影響を調べました。","type":"general","meaning_category":"受精"},{"sentence":"In vitro fertilization offers hope to many infertile couples.","translation":"体外受精は多くの不妊カップルに希望を与えます。","type":"medical","meaning_category":"受精"},{"sentence":"The process of fertilization in flowering plants is quite complex.","translation":"顕花植物における受精の過程は非常に複雑です。","type":"botanical","meaning_category":"受精"}]}