{"word":"Congregationalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"会衆派教会主義、組合教会主義","english_definition":"A system of church government in which each local church is self-governing.","examples":[{"sentence":"Congregationalism emphasizes the autonomy of the local church.","translation":"会衆派教会主義は、地方教会の自治を重視する。"},{"sentence":"Congregationalism arose from the Puritan movement in England.","translation":"会衆派教会主義は、イングランドのピューリタン運動から生まれた。"}],"collocations":["local church autonomy","church government","Puritan movement"],"synonyms":["Independency"],"antonyms":["Episcopalism","Presbyterianism"]}],"etymology":{"value":"From 'congregational' (relating to a congregation) + '-ism' (denoting a system, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒŋɡrɪˈɡeɪʃənəlɪzəm/","syllables":"con-gre-ga-tion-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Congregationalism is a form of Protestant church governance where each individual congregation is autonomous and self-governing. It emphasizes the independence of the local church from any external authority. It originated in the Puritan movement in England and spread to other parts of the world, particularly North America.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Congregationalism believe in the Bible.","correct":"✓ Congregationalists believe in the Bible.","note":"'Congregationalism' is a system or belief, not a group of people. Use 'Congregationalists' to refer to the people who adhere to this system."}],"priority":"★★☆"},"related_words":{"derivatives":["Congregational (adjective)","Congregationalist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Congregationalism refers to a system of church governance where each local congregation is independent and self-governing. This means that each church makes its own decisions without being controlled by a central authority. The term is often used in the context of Protestant denominations that follow this model, emphasizing local autonomy and the direct participation of members in church affairs. Understanding this term requires familiarity with different forms of church organization and governance. "},"example_sentences":[{"sentence":"The principles of Congregationalism promote democratic decision-making within the church.","translation":"会衆派教会主義の原則は、教会内での民主的な意思決定を促進する。","type":"noun","meaning_category":"教会主義の原則"},{"sentence":"Many early American churches were founded on the principles of Congregationalism.","translation":"初期のアメリカの教会の多くは、会衆派教会主義の原則に基づいて設立された。","type":"noun","meaning_category":"歴史的背景"}]}