{"word":"hypotaxis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"従属構造、複文構造","english_definition":"The grammatical arrangement of functionally diverse linguistic elements, none of which is grammatically equivalent to any other. It is the syntactic relation between clauses where one is subordinate to another.","examples":[{"sentence":"The complex sentence showed hypotaxis, with several subordinate clauses modifying the main clause.","translation":"その複雑な文は従属構造を示しており、いくつかの従属節が主節を修飾していた。"},{"sentence":"Hypotaxis is often used in formal writing to express complex relationships between ideas.","translation":"従属構造は、アイデア間の複雑な関係を表現するために、正式な文章でよく使用される。"}],"collocations":["use hypotaxis","demonstrate hypotaxis","complex hypotaxis","formal hypotaxis"],"synonyms":["subordination","complex sentence structure","dependent clause construction"],"antonyms":["parataxis","coordination","simple sentence structure"]}],"etymology":{"value":"From Ancient Greek ὑπόταξις (hupótaxis), from ὑπό (hupó, “under”) + τάξις (táxis, “arrangement”).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈtæksɪs/","syllables":"hy-po-tax-is"},"inflection":{"noun_plural":"hypotaxes"},"usage_notes":{"explanation":"Hypotaxis refers to the grammatical relationship where clauses are not equal; one is subordinate to the other. This contrasts with parataxis, where clauses are simply placed one after another without clear subordination. Hypotaxis is often used to create complex and nuanced sentences, showing logical relationships such as cause and effect, condition, or concession.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The writer used parataxis to show the relationship between clauses, which is hypotaxis.","correct":"✓ The writer used hypotaxis to show the relationship between clauses.","note":"Parataxis and hypotaxis are opposite concepts. Make sure to use the correct term for the intended sentence structure."},{"incorrect":"✗ Hypotaxis is when sentences are short and simple.","correct":"✓ Hypotaxis is when sentences are complex and contain subordinate clauses.","note":"Hypotaxis involves complex sentences, not short and simple ones."}],"priority":"★★☆"},"related_words":{"derivatives":["hypotactic (adjective)","hypotactical (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hypotaxis is a term used in grammar and rhetoric to describe a complex sentence structure where clauses are not equal, and some are subordinate to others. It is a more advanced concept often encountered in formal writing and linguistic analysis. Understanding hypotaxis helps in analyzing how complex ideas are connected within sentences.","priority":"★★☆"},"example_sentences":[{"sentence":"The essay employed hypotaxis to carefully delineate the nuances of the argument.","translation":"そのエッセイは、議論のニュアンスを注意深く描写するために従属構造を採用した。","type":"general","meaning_category":"grammatical structure"},{"sentence":"By using hypotaxis, the author created a layered and sophisticated narrative.","translation":"従属構造を使うことで、著者は階層的で洗練された物語を作り上げた。","type":"general","meaning_category":"grammatical structure"},{"sentence":"The teacher explained the difference between hypotaxis and parataxis to the students.","translation":"先生は生徒たちに従属構造と並列構造の違いを説明した。","type":"educational","meaning_category":"grammatical structure"}]}