{"word":"membrane-affecting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"膜に影響を与える、膜作用性の","english_definition":"Having an effect on or influencing biological membranes.","examples":[{"sentence":"This drug is membrane-affecting, altering the permeability of cell membranes.","translation":"この薬は膜作用性であり、細胞膜の透過性を変化させる。"},{"sentence":"Membrane-affecting toxins can disrupt cellular function.","translation":"膜作用性の毒素は、細胞機能を破壊する可能性がある。"}],"collocations":["membrane-affecting drug","membrane-affecting toxin","membrane-affecting agent","membrane-affecting properties"],"synonyms":["membrane-active","membrane-disrupting","membrane-interacting"],"antonyms":[]}],"etymology":{"value":"The term is formed by combining 'membrane' (a thin sheet of tissue or material forming a lining, covering, or partition), 'affecting' (having an effect on), and '-ing' (present participle suffix indicating an action or process).","priority":"N/A"},"pronunciation":{"ipa":"/ˈmɛmbreɪn əˈfɛktɪŋ/","syllables":"mem-brane a-ffect-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, besides comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"'Membrane-affecting' is a descriptive term used in biology, chemistry, and pharmacology to describe substances or processes that interact with or alter the structure or function of biological membranes. These membranes are crucial for cell integrity, transport, and signaling.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["membrane (noun)","affect (verb)","affecting (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Membrane-affecting' is a technical term used in scientific contexts, particularly in biology and chemistry. It describes something that has an impact on biological membranes, which are crucial for cell function. Understanding this term requires knowledge of basic cell biology and chemistry."},"example_sentences":[{"sentence":"The researchers studied the effects of the membrane-affecting compound on cancer cells.","translation":"研究者らは、膜作用性化合物が癌細胞に及ぼす影響を研究した。","type":"adjective","meaning_category":"General"},{"sentence":"Certain antibiotics are membrane-affecting, targeting the bacterial cell membrane.","translation":"特定の抗生物質は膜作用性であり、細菌の細胞膜を標的とする。","type":"adjective","meaning_category":"Specific example"}]}