{"word":"retinophore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"網膜色素胞：ある種の甲殻類（例えばエビ）の眼にある光受容細胞の一部で、光感受性色素を含み、視覚において重要な役割を果たす。","english_definition":"A part of a photoreceptor cell in the eye of certain crustaceans (e.g., shrimp) that contains the light-sensitive pigment and plays a crucial role in vision.","examples":[{"sentence":"The retinophore in the shrimp's eye helps it see in low-light conditions.","translation":"エビの眼にある網膜色素胞は、薄暗い環境下での視覚を助ける。"}],"collocations":["retinophore structure","retinophore pigment","crustacean retinophore"],"synonyms":["photoreceptor","rhabdomere"],"antonyms":[]}],"etymology":{"value":"Derived from 'retina' (the light-sensitive layer of the eye) and '-phore' (from Greek 'phoros' meaning 'bearing' or 'carrying'), indicating a structure that carries or contains something related to the retina.","priority":"★★★"},"pronunciation":{"ipa":"/rɛˈtɪnəˌfɔːr/","syllables":"re-ti-no-phore"},"inflection":{"noun_plural":"retinophores"},"usage_notes":{"explanation":"The term 'retinophore' is primarily used in the context of invertebrate zoology and comparative physiology, specifically when discussing the visual systems of crustaceans. It refers to a specialized part of the photoreceptor cell responsible for light detection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The retinophore is found in human eyes.","correct":"✓ Retinophores are found in the eyes of certain crustaceans, not humans.","note":"Retinophores are specific to certain invertebrates, particularly crustaceans."}],"priority":"★★☆"},"related_words":{"derivatives":["retina","photoreceptor","rhabdom","ommatidium"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized scientific vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Retinophore' is a highly specialized term in zoology and physiology, specifically related to the visual systems of certain crustaceans. Understanding this term requires familiarity with the anatomy and physiology of invertebrate eyes. It is not commonly encountered outside of scientific literature in these fields."},"example_sentences":[{"sentence":"Electron microscopy revealed the detailed structure of the retinophore in the compound eye.","translation":"電子顕微鏡は、複眼における網膜色素胞の詳細な構造を明らかにした。","type":"noun","meaning_category":"Structure of photoreceptor cell"},{"sentence":"The orientation of the retinophore microvilli is crucial for polarized light detection in shrimp.","translation":"エビにおける偏光検出には、網膜色素胞の微絨毛の方向が重要である。","type":"noun","meaning_category":"Function in polarized light detection"}]}