{"word":"unwomanish","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"女性らしくない、女性的でない","english_definition":"Not having qualities or characteristics traditionally associated with women.","examples":[{"sentence":"Her unwomanish strength surprised everyone.","translation":"彼女の女性らしくない力強さは皆を驚かせた。"},{"sentence":"She preferred unwomanish pursuits like engineering and mathematics.","translation":"彼女は工学や数学のような女性的でない活動を好んだ。"}],"collocations":["unwomanish behavior","unwomanish interests","unwomanish strength"],"synonyms":["unfeminine","masculine","androgynous"],"antonyms":["womanish","feminine"]},{"part_of_speech":"adjective","definition":"(女性に対して)女性らしさを欠いている、女性らしくない","english_definition":"(Of a woman) lacking qualities or characteristics traditionally associated with women.","examples":[{"sentence":"She was criticized for her unwomanish appearance.","translation":"彼女は女性らしくない外見で批判された。"},{"sentence":"Some people found her unwomanish attitude refreshing.","translation":"彼女の女性らしくない態度は新鮮だと感じる人もいた。"}],"collocations":["unwomanish appearance","unwomanish attitude","unwomanish manner"],"synonyms":["unfeminine","unladylike","unconventional"],"antonyms":["womanish","feminine","ladylike"]}],"etymology":{"value":"\"un-\" (否定) + \"womanish\" (女性的な)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈwʊmənɪʃ/","syllables":"un-wom-an-ish"},"inflection":{"adjective_forms":{"comparative":"more unwomanish","superlative":"most unwomanish"}},"usage_notes":{"explanation":"The word \"unwomanish\" is used to describe someone or something that does not possess qualities traditionally associated with women. It can be applied to both men and women, although it is more commonly used to describe women who do not conform to traditional gender roles or stereotypes. The term can sometimes carry negative connotations, implying a deviation from what is considered \"normal\" or \"appropriate\" for women, but it can also be used in a neutral or even positive way to describe someone who is strong, independent, or unconventional.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is very unwoman.","correct":"✓ She is very unwomanish.","note":"\"Unwoman\" is not a standard word. Use \"unwomanish\" to describe someone lacking feminine qualities."},{"incorrect":"✗ He has unwomanish qualities.","correct":"✓ He has unmanly qualities.","note":"When describing a man lacking masculine qualities, use \"unmanly\" or \"effeminate\" rather than \"unwomanish.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unwomanly (similar meaning to unwomanish)"],"antonyms":["womanish","feminine","ladylike","effeminate (for men)"],"related":["masculine","androgynous","gender-neutral"]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unwomanish\" is a relatively uncommon word used to describe someone or something that lacks qualities traditionally associated with women. It is often used to challenge or subvert traditional gender roles and stereotypes. The word can have both positive and negative connotations, depending on the context and the speaker's intent. It is important to be aware of the potential implications of using this word and to use it carefully and thoughtfully."},"example_sentences":[{"sentence":"Her unwomanish demeanor made her stand out in the male-dominated field.","translation":"彼女の女性らしくない振る舞いは、男性優位の分野で彼女を際立たせた。","type":"adjective","meaning_category":"女性的でない"},{"sentence":"The character was praised for her unwomanish strength and independence.","translation":"そのキャラクターは、女性らしくない力強さと自立心で賞賛された。","type":"adjective","meaning_category":"女性的でない"},{"sentence":"She rejected the expectation that she should be womanish and instead embraced her own unique style.","translation":"彼女は女性らしくあるべきだという期待を拒否し、代わりに彼女自身のユニークなスタイルを受け入れた。","type":"adjective","meaning_category":"女性的でない"}]}