{"word":"subsoiler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サブソイラー（深耕機）：土壌の深層を耕起する農機具","english_definition":"An agricultural implement used to loosen and break up soil at depths greater than those reached by conventional tillage equipment.","examples":[{"sentence":"The farmer used a subsoiler to improve drainage in the field.","translation":"その農家は、畑の排水を改善するためにサブソイラーを使用した。"},{"sentence":"Subsoilers are essential for breaking up hardpan layers in the soil.","translation":"サブソイラーは、土壌中の硬盤層を破壊するために不可欠である。"}],"collocations":["use a subsoiler","pull a subsoiler","heavy-duty subsoiler","single-shank subsoiler","multi-shank subsoiler"],"synonyms":["deep tillage implement","ripper","chisel plow"],"antonyms":[]}],"etymology":{"value":"'Sub-' (under) + 'soil' (earth) + '-er' (instrument suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌsɔɪlər/","syllables":"sub-soil-er"},"inflection":{"noun_plural":"subsoilers"},"usage_notes":{"explanation":"A subsoiler is a tillage implement that fractures and loosens soil at depths typically ranging from 15 to 45 inches (38 to 114 cm). It is used to break up hardpan, compacted layers, and other subsurface impediments to root growth and water infiltration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subsoiler are used for planting seeds.","correct":"✓ The subsoiler is used for breaking up compacted soil.","note":"Subsoilers are not used for planting seeds; they are used for deep tillage to improve soil structure."}],"priority":"★★☆"},"related_words":{"derivatives":["subsoil","soil","tillage"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subsoiler' refers to a specialized piece of agricultural equipment used for deep tillage. It's not a common term in everyday conversation, but it's important in the context of farming and soil management. Understanding its function requires knowledge of agricultural practices and soil science."},"example_sentences":[{"sentence":"The **subsoiler** helped improve water infiltration into the dry soil.","translation":"サブソイラーは乾燥した土壌への水の浸透を改善するのに役立った。","type":"noun","meaning_category":"農機具"},{"sentence":"Using a **subsoiler** can reduce soil compaction and increase crop yields.","translation":"サブソイラーを使用すると、土壌の圧密を軽減し、作物の収量を増やすことができる。","type":"noun","meaning_category":"農機具"}]}