{"word":"ungregariousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非社交性、群れを嫌う性質、孤独を好むこと","english_definition":"The state or quality of being ungregarious; a disinclination for being sociable or associating with others in groups.","examples":[{"sentence":"His ungregariousness made it difficult for him to fit in at social events.","translation":"彼の非社交性は、社交的なイベントに馴染むのを難しくした。"},{"sentence":"Her ungregariousness was often mistaken for aloofness, but she simply preferred her own company.","translation":"彼女の非社交性はしばしばよそよそしさと間違われたが、彼女はただ単に一人でいることを好んだだけだった。"},{"sentence":"The ungregariousness of the species makes it difficult to study their social behavior in the wild.","translation":"その種の非社交性は、野生での彼らの社会行動を研究することを困難にしている。"}],"collocations":["extreme ungregariousness","inherent ungregariousness","natural ungregariousness","perceived ungregariousness"],"synonyms":["unsociability","introversion","reclusiveness","aloofness","solitariness","isolation"],"antonyms":["gregariousness","sociability","extroversion","outgoingness","conviviality"]}],"etymology":{"value":"Formed from \"ungregarious\" (not liking to be in groups) + \"-ness\" (a suffix denoting a state or quality). \"Ungregarious\" is derived from \"gregarious\" (fond of company; sociable), which comes from the Latin \"gregarius\" (belonging to a flock or herd), from \"grex\" (flock, herd).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɡrɪˈɡɛəriəsnəs/","syllables":"un-gre-gar-i-ous-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Ungregariousness\" describes a personality trait or behavior characterized by a preference for solitude and an avoidance of social interaction or group activities. It is often used to describe individuals who are introverted, reclusive, or simply enjoy spending time alone. The term can also be applied to animals or species that do not typically form large social groups. It is important to note that ungregariousness is not necessarily negative; it can simply reflect a different way of interacting with the world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of ungregariousness at the party.","correct":"✓ He displayed ungregarious behavior at the party.","note":"While \"ungregariousness\" is a noun, it refers to a state or quality. To describe specific actions, it's better to use \"ungregarious behavior\" or \"ungregarious actions.\""},{"incorrect":"✗ Her ungregariousness made her a bad leader.","correct":"✓ Her ungregariousness made it challenging for her to lead.","note":"Ungregariousness itself doesn't necessarily make someone a bad leader, but it might present challenges in roles that require a lot of social interaction and group coordination."}],"priority":"★☆☆"},"related_words":{"derivatives":["ungregarious (adjective)"],"phrasal_verbs":null,"related_concepts":["introversion","solitude","social isolation","reclusiveness","social anxiety (though ungregariousness is not necessarily linked to anxiety)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ungregariousness\" is a relatively uncommon and complex term. It describes the quality of not being sociable or enjoying the company of others. It's often used in discussions about personality traits, social behavior, and preferences for solitude. Understanding this word requires a good grasp of abstract concepts and a familiarity with related terms like \"introversion\" and \"reclusiveness.\" It's more likely to be encountered in academic or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"The researcher noted the ungregariousness of the solitary bees, which rarely interact with others of their species.","translation":"研究者は、同種の他の個体とほとんど交流しない、単独性のハチの非社交性に注目した。","type":"general","meaning_category":"Non-sociability"},{"sentence":"His ungregariousness was a source of concern for his parents, who wished he would make more friends.","translation":"彼の非社交性は、もっと友達を作ってほしいと願う両親の心配の種だった。","type":"general","meaning_category":"Non-sociability"},{"sentence":"Despite her ungregariousness, she was highly productive and creative when working alone.","translation":"彼女は非社交的だったが、一人で作業するときは非常に生産的で創造的だった。","type":"general","meaning_category":"Non-sociability"}]}