{"word":"holocrine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(細胞分泌について)全分泌の、細胞全体が分泌物となる","english_definition":"(of a gland or cell) relating to or denoting a gland or cell that discharges a secretion together with the entire cell, which disintegrates in the process.","examples":[{"sentence":"Sebaceous glands are holocrine glands, where the entire cell breaks down to release sebum.","translation":"皮脂腺は全分泌腺であり、細胞全体が崩壊して皮脂を放出する。"},{"sentence":"Holocrine secretion involves the destruction of the secretory cell.","translation":"全分泌は、分泌細胞の破壊を伴う。"}],"collocations":["holocrine gland","holocrine secretion"],"synonyms":[],"antonyms":["merocrine","apocrine"]}],"etymology":{"value":"From Greek 'holos' meaning 'whole' + 'krinein' meaning 'to secrete'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɒləkrɪn","syllables":"hol-o-crine"},"inflection":{"notes":"No specific inflectional forms exist as it is an adjective."},"usage_notes":{"explanation":"Holocrine glands release their secretions by rupturing the entire cell. This contrasts with merocrine glands, which secrete via exocytosis, and apocrine glands, which secrete by pinching off a portion of the cell. Holocrine secretion results in cell death.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["holocrine (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Holocrine' is a technical term used in biology and medicine, specifically when discussing types of glandular secretion. It describes a process where the entire cell disintegrates to release its contents. This term is not commonly used outside of scientific or medical contexts, making it a high-level vocabulary word."},"example_sentences":[{"sentence":"The sebaceous glands in the skin utilize a **holocrine** method of secretion.","translation":"皮膚の皮脂腺は、全分泌の分泌方法を利用する。","type":"adjective","meaning_category":"全分泌の"},{"sentence":"**Holocrine** secretion is characterized by the complete lysis of the secretory cell.","translation":"全分泌は、分泌細胞の完全な溶解を特徴とする。","type":"adjective","meaning_category":"全分泌の"}]}