{"word":"antiferroelectric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反強誘電性の","english_definition":"Relating to or exhibiting antiferroelectricity.","examples":[{"sentence":"Antiferroelectric materials have a characteristic antiparallel alignment of electric dipoles.","translation":"反強誘電体材料は、電気双極子の特徴的な反平行配列を有する。"}],"collocations":["antiferroelectric material","antiferroelectric phase","antiferroelectric transition"],"synonyms":[],"antonyms":["ferroelectric"]}],"etymology":{"value":"The term is formed by combining the prefix 'anti-' (meaning opposite or against) with 'ferroelectric', indicating a property that is in opposition to ferroelectricity.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˌfɛroʊɪˈlɛktrɪk/","syllables":"an-ti-fer-ro-i-lec-tric"},"inflection":{"notes":"This word is primarily used as an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"Antiferroelectric materials are characterized by an ordered arrangement of electric dipoles that alternate in direction, resulting in zero net polarization in the absence of an external electric field.  Above a certain temperature (the Néel temperature), the antiferroelectric order is lost, and the material becomes paraelectric.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is ferroelectric, not antiferroelectric.","correct":"✓ The material is antiferroelectric, not ferroelectric.","note":"Ensure the correct prefix is used to distinguish between ferroelectric and antiferroelectric properties."}],"priority":"★★☆"},"related_words":{"derivatives":["antiferroelectricity (noun)"],"related_terms":["ferroelectric","paraelectric","dielectric","piezoelectric"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiferroelectric' is a technical term used in materials science and physics to describe a specific type of electrical ordering in materials. It is the opposite of 'ferroelectric', where dipoles align in parallel. Understanding this term requires a background in solid-state physics or materials science."},"example_sentences":[{"sentence":"The antiferroelectric transition temperature of the crystal was determined using differential scanning calorimetry.","translation":"その結晶の反強誘電転移温度は、示差走査熱量測定法を用いて決定された。","type":"adjective","meaning_category":"Material Property"},{"sentence":"Applying a strong electric field can induce a transition from the antiferroelectric to the ferroelectric phase.","translation":"強い電場を印加すると、反強誘電相から強誘電相への転移を誘起することができる。","type":"adjective","meaning_category":"Phase Transition"}]}