{"word":"hydatid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"包虫嚢、包虫嚢胞","english_definition":"a cyst formed in the liver, lungs, or other parts of the body, containing the larvae of the dog tapeworm Echinococcus granulosus.","examples":[{"sentence":"The patient was diagnosed with a hydatid cyst in the liver.","translation":"患者は肝臓に包虫嚢胞があると診断された。"},{"sentence":"Hydatid disease is a parasitic infection caused by the Echinococcus tapeworm.","translation":"包虫症は、エキノコックス条虫によって引き起こされる寄生虫感染症である。"}],"collocations":["hydatid cyst","hydatid disease","hepatic hydatid","pulmonary hydatid"],"synonyms":["Echinococcus cyst"],"antonyms":[]},{"part_of_speech":"adjective","definition":"包虫嚢の、包虫嚢に関する","english_definition":"relating to or resembling a hydatid cyst.","examples":[{"sentence":"The hydatid membrane is the inner layer of the cyst.","translation":"包虫嚢膜は、嚢胞の内側の層である。"},{"sentence":"Hydatid fluid is aspirated for diagnostic purposes.","translation":"包虫嚢液は、診断目的で吸引される。"}],"collocations":["hydatid membrane","hydatid fluid"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek word 'hydatis' meaning 'a drop of water, a vesicle'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaɪdətɪd/","syllables":"hy-da-tid"},"inflection":{"noun_plural":"hydatids"},"usage_notes":{"explanation":"'Hydatid' primarily refers to the cyst formed by the larval stage of the Echinococcus granulosus tapeworm. It is most commonly used in medical contexts when discussing hydatid disease or related parasitic infections. The term can also be used adjectivally to describe structures or fluids associated with these cysts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hydatid is a type of bacteria.","correct":"✓ The hydatid is a cyst caused by a tapeworm.","note":"Hydatids are cysts formed by tapeworm larvae, not bacteria."},{"incorrect":"✗ Hydatid disease is easily treatable with antibiotics.","correct":"✓ Hydatid disease often requires surgery or long-term medication.","note":"Antibiotics are not effective against hydatid disease; treatment usually involves surgery, medication, or both."}],"priority":"★★☆"},"related_words":{"derivatives":["Echinococcus","cyst","parasite","larva"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hydatid' is a specialized medical term primarily used to describe cysts formed by the larval stage of the Echinococcus granulosus tapeworm. It is most often encountered in the context of medical or veterinary discussions related to parasitic infections. Understanding the term requires a basic knowledge of parasitology and medical terminology."},"example_sentences":[{"sentence":"Surgical removal of the hydatid cyst is often necessary to prevent rupture.","translation":"包虫嚢胞の外科的除去は、破裂を防ぐためにしばしば必要である。","type":"noun","meaning_category":"cyst"},{"sentence":"The hydatid fluid was analyzed to confirm the presence of parasitic antigens.","translation":"包虫嚢液を分析して、寄生虫抗原の存在を確認した。","type":"adjective","meaning_category":"relating to a cyst"}]}