{"word":"pupiled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"瞳のある、瞳孔のある","english_definition":"Having pupils; furnished with pupils.","examples":[{"sentence":"The artist carefully rendered the pupiled eyes of the portrait.","translation":"その画家は肖像画の瞳のある目を注意深く描写した。"},{"sentence":"The cat stared with its pupiled gaze.","translation":"その猫は瞳孔のある視線で見つめた。"}],"collocations":["pupiled eyes","pupiled gaze","brightly pupiled"],"synonyms":["eyed","oculate","visioned"],"antonyms":["pupilless"],"notes":"Rarely used outside of descriptive or literary contexts."}],"etymology":{"value":"Derived from 'pupil' (the opening in the center of the iris of the eye), with the addition of the '-ed' suffix, indicating possession or being furnished with.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpjuːpɪld/","syllables":"pu-piled"},"inflection":{"notes":"This is an adjective and does not inflect like a verb."},"usage_notes":{"explanation":"The word 'pupiled' is a descriptive adjective used to indicate that something has pupils, typically referring to eyes. It is not commonly used in everyday conversation and is more often found in literary or highly descriptive contexts. It emphasizes the presence and perhaps the nature of the pupils in the eyes being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The pupiled student listened attentively.","correct":"The attentive student listened carefully.","note":"Using 'pupiled' to describe a person is unusual. It is more appropriate to describe the eyes themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["pupil (noun): the black circular opening in the center of the iris of the eye","pupillary (adjective): relating to the pupil of the eye"],"related_concepts":["iris","cornea","eye","vision"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pupiled' is a rare and highly descriptive adjective. It is not part of everyday vocabulary and is typically found in literary or specialized contexts. Understanding its meaning requires familiarity with the word 'pupil' and the function of the '-ed' suffix to indicate possession. Its use is generally limited to detailed descriptions of eyes or vision."},"example_sentences":[{"sentence":"The creature's pupiled eyes glowed in the dim light.","translation":"その生き物の瞳のある目は薄暗い光の中で光っていた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Her brightly pupiled gaze reflected her excitement.","translation":"彼女の明るく瞳孔のある視線は彼女の興奮を反映していた。","type":"adjective","meaning_category":"descriptive"}]}