{"word":"neglector","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人)怠慢な人、無視する人、放置する人","english_definition":"A person who neglects someone or something; someone who fails to care for or attend to properly.","examples":[{"sentence":"He was labeled a neglectful parent by the authorities.","translation":"彼は当局から育児放棄の親だと見なされた。"},{"sentence":"The landlord was a known neglecter of his properties.","translation":"その家主は所有物件の管理を怠ることで知られていた。"}],"collocations":["child neglector (児童虐待者)","animal neglector (動物虐待者)","property neglector (財産管理を怠る人)"],"synonyms":["derelict","remiss","lax","careless","inattentive"],"antonyms":["caretaker","guardian","attentive","diligent"]}],"etymology":{"value":"From the verb 'neglect' + '-or' suffix, indicating a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈɡlɛktər/","syllables":"ne-glec-tor"},"inflection":{"noun_plural":"neglectors"},"usage_notes":{"explanation":"'Neglector' is a noun that refers to a person who neglects their duties, responsibilities, or someone/something under their care. It is often used in contexts involving child welfare, animal rights, or property management. The term carries a negative connotation, implying a failure to provide necessary care or attention.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a neglecter about his health.","correct":"He is neglectful about his health.","note":"Use 'neglectful' (adjective) to describe someone who neglects something, or use 'neglector' as a noun: 'He is a neglecter of his health.'"},{"incorrect":"She is a neglecter person.","correct":"She is a neglectful person.","note":"Use 'neglectful' (adjective) to describe the person."}],"priority":"★★☆"},"related_words":{"derivatives":["neglect (verb/noun)","neglectful (adjective)","neglectfully (adverb)","neglectfulness (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'neglector' is a noun that describes someone who does not properly care for something or someone they are responsible for. It's often used in serious contexts, like when talking about people who don't take care of children or animals. It's not a very common word, but it's important to understand if you come across it, especially in legal or social work settings."},"example_sentences":[{"sentence":"The social worker identified the parents as neglectors due to the unsanitary living conditions of the home.","translation":"ソーシャルワーカーは、家の不衛生な生活環境から、両親を育児放棄者と認定した。","type":"noun","meaning_category":"怠慢な人"},{"sentence":"Animal rights activists protested against the farm owner, calling him a neglecter of his livestock.","translation":"動物権利活動家は、農場主を家畜の世話を怠る者だと非難し、抗議活動を行った。","type":"noun","meaning_category":"無視する人"},{"sentence":"The city council took action against the property neglector for failing to maintain the building.","translation":"市議会は、建物の維持管理を怠ったため、その不動産管理を怠る者に対して措置を講じた。","type":"noun","meaning_category":"放置する人"}]}