{"word":"unstranded","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人・船などが)座礁していない、立ち往生していない","english_definition":"Not left in a difficult or helpless position on land or at sea.","examples":[{"sentence":"The rescue team ensured that no one was left unstranded after the storm.","translation":"救助隊は、嵐の後、誰も座礁したままにならないように徹底した。"},{"sentence":"The ship remained unstranded despite the shallow waters.","translation":"その船は浅瀬にもかかわらず座礁せずに済んだ。"}],"collocations":["remain unstranded","ensure someone is unstranded"],"synonyms":["rescued","safe","afloat"],"antonyms":["stranded","aground","marooned"]},{"part_of_speech":"adjective","definition":"(DNAなどが)一本鎖になっていない、二本鎖のままの","english_definition":"Not separated into single strands; remaining in a double-stranded or multi-stranded form (especially referring to DNA or RNA).","examples":[{"sentence":"The unstranded DNA was more stable than the single-stranded version.","translation":"一本鎖になっていないDNAは、一本鎖のものよりも安定していた。"},{"sentence":"The experiment required the DNA to remain unstranded throughout the process.","translation":"その実験では、DNAがプロセス全体を通して一本鎖にならないようにする必要があった。"}],"collocations":["unstranded DNA","unstranded RNA"],"synonyms":["double-stranded","duplex"],"antonyms":["single-stranded"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'stranded'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈstrændɪd/","syllables":"un-strand-ed"},"inflection":{"notes":"Adjective; comparative and superlative forms (more unstranded, most unstranded) are possible but uncommon."},"usage_notes":{"explanation":"The word 'unstranded' is relatively uncommon. Its primary use is to describe something that has *avoided* being stranded, either literally (like a ship) or figuratively (like a person in a difficult situation). In scientific contexts, particularly genetics, it describes nucleic acids (DNA, RNA) that remain in their double- or multi-stranded form, rather than being separated into single strands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unstranded people were happy to be rescued.","correct":"✓ The stranded people were happy to be rescued. / ✓ The people were happy to be unstranded (after being rescued).","note":"'Unstranded' describes the state *after* being rescued or avoiding being stranded. The initial state is 'stranded'."}],"priority":"★★☆"},"related_words":{"derivatives":["strand (verb, noun)","stranded (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very uncommon, technical or specialized contexts)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unstranded' is a less common word that means 'not stranded'. 'Stranded' means being left in a difficult or helpless situation, often referring to ships stuck on land or people stuck in a place without a way to leave. Therefore, 'unstranded' means not being in that situation. It can also refer to DNA that is still in its double-stranded form, rather than being separated into single strands. This usage is more technical and found in scientific contexts."},"example_sentences":[{"sentence":"The lifeboat worked tirelessly to ensure all passengers were unstranded.","translation":"救命艇は、すべての乗客が座礁しないように休むことなく活動した。","type":"adjective","meaning_category":"Not stranded (people)"},{"sentence":"Researchers studied the properties of unstranded DNA in the experiment.","translation":"研究者たちは実験で一本鎖になっていないDNAの特性を研究した。","type":"adjective","meaning_category":"Not single-stranded (DNA)"}]}