{"word":"sulphuran","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学)硫黄原子が4つ以上の原子または原子団と結合している化合物","english_definition":"(organic chemistry) A chemical compound in which a sulfur atom is bonded to four or more atoms or groups of atoms.","examples":[{"sentence":"Tetravalent sulfur compounds are known as sulfuranes, while hexavalent sulfur compounds are called persulfuranes or sulfur(VI) compounds; both are types of sulphurans.","translation":"四価の硫黄化合物はスルファンとして知られており、六価の硫黄化合物はペルスルファンまたは硫黄(VI)化合物と呼ばれています。どちらもスルファンの一種です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'sulfur' (or 'sulphur', an alternative spelling) and the suffix '-ane', indicating a saturated hydrocarbon. The 'ur' is inserted for euphony.","priority":"★★★"},"pronunciation":{"ipa":"/sʌlˈfjʊəræn/","syllables":"sul-phu-ran"},"inflection":{"noun_plural":"sulphurans"},"usage_notes":{"explanation":"'Sulphuran' refers to a specific class of chemical compounds in organic chemistry. It's important to note the spelling can also be 'sulfuran' (without the 'ph'), and the term is primarily used within the context of chemistry.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["sulfur","sulfane","persulfuran"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily a technical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Sulphuran' is a highly specialized term used in organic chemistry to describe a compound where a sulfur atom is bonded to four or more other atoms or groups. Understanding this term requires a strong background in chemistry, making it unsuitable for general English language learners. It's more relevant to those studying advanced organic chemistry. The term may also be spelled 'sulfuran'."},"example_sentences":[{"sentence":"The synthesis of a stable sulphurane has been a significant achievement in the field of hypervalent chemistry.","translation":"安定なスルファンの合成は、超原子価化学の分野における重要な成果です。","type":"noun","meaning_category":"chemical compound"}]}