{"word":"dedicator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"献呈者、奉納者、寄贈者","english_definition":"A person who dedicates something, especially a book, work of art, or building, to a person or cause.","examples":[{"sentence":"The author was a generous dedicator, always acknowledging those who helped him.","translation":"その著者は寛大な献呈者であり、常に彼を助けた人々を称えていた。"},{"sentence":"The museum has a plaque listing the names of the dedicators who made the new wing possible.","translation":"博物館には、新しい翼の建設を可能にした献納者の名前が刻まれた銘板がある。"}],"collocations":["generous dedicator","prominent dedicator","lead dedicator","principal dedicator"],"synonyms":["donor","benefactor","patron","sponsor","contributor","giver"],"antonyms":["recipient"]}],"etymology":{"value":"Derived from the verb 'dedicate', which comes from Latin 'dedicatus', the past participle of 'dedicare' meaning 'to declare, consecrate, devote'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛdɪkeɪtər/","syllables":"ded-i-ca-tor"},"inflection":{"noun_plural":"dedicators"},"usage_notes":{"explanation":"'Dedicator' refers to someone who formally offers or commits something (like a book or building) to a specific person, cause, or purpose. It often implies a sense of honor, respect, or gratitude towards the recipient of the dedication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good dedicator because he always gives money.","correct":"✓ He is a good donor because he always gives money.","note":"'Dedicator' specifically refers to someone who dedicates something, like a book or building, to a person or cause, not just someone who gives money. 'Donor' is more appropriate for someone who gives money."}],"priority":"★★☆"},"related_words":{"derivatives":["dedicate (verb)","dedication (noun)","dedicated (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dedicator' is a relatively uncommon term that refers to someone who dedicates something, such as a book, building, or work of art, to a person, cause, or idea. It is often used in formal contexts, such as acknowledgments in books or plaques in buildings. Understanding the word requires a grasp of the related terms 'dedicate' and 'dedication'."},"example_sentences":[{"sentence":"The library acknowledged the primary dedicator, whose generous donation funded the entire project.","translation":"図書館は、プロジェクト全体の資金を提供した寛大な寄贈者である主要な献呈者を称えた。","type":"noun","meaning_category":"寄贈者"},{"sentence":"As the dedicator of the new research facility, she was invited to cut the ribbon at the opening ceremony.","translation":"新しい研究施設の献呈者として、彼女は開会式でテープカットに招待された。","type":"noun","meaning_category":"献呈者"},{"sentence":"The author thanked the dedicator in the book's preface.","translation":"著者は本の序文で献呈者に感謝した。","type":"noun","meaning_category":"献呈者"}]}