{"word":"spark-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"耐火花の、防爆の","english_definition":"Designed to prevent sparks from being emitted, especially in environments where flammable materials are present.","examples":[{"sentence":"The factory uses spark-resistant tools to minimize the risk of explosions.","translation":"その工場では、爆発のリスクを最小限に抑えるために、耐火花工具を使用しています。"},{"sentence":"Spark-resistant flooring is essential in areas where flammable liquids are stored.","translation":"可燃性液体が保管されている場所では、耐火花性の床材が不可欠です。"},{"sentence":"The equipment is designed with spark-resistant components to ensure safety.","translation":"その装置は安全を確保するために、耐火花性の部品で設計されています。"}],"collocations":["spark-resistant tools (耐火花工具)","spark-resistant flooring (耐火花床材)","spark-resistant equipment (耐火花装置)","spark-resistant material (耐火花材料)","spark-resistant design (耐火花設計)"],"synonyms":["spark-proof","explosion-proof","flame-resistant","ignition-proof"],"antonyms":["spark-producing","flammable","combustible"]}],"etymology":{"value":"The word is formed by combining 'spark' (a small flash of light produced by electrical discharge or friction) with 'resistant' (having the ability to resist something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈspɑːrk rɪˈzɪstənt/","syllables":"spark-re-sist-ant"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Spark-resistant' is used to describe materials, tools, or equipment that are designed to not produce sparks, especially in environments where flammable substances are present. This is important for safety in industries such as oil and gas, chemical manufacturing, and mining.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spark-resistance material.","correct":"✓ The spark-resistant material.","note":"'Spark-resistance' is a noun referring to the property, while 'spark-resistant' is the adjective describing the material."}],"priority":"☆☆☆"},"related_words":{"derivatives":["resistance (noun)","resist (verb)"],"phrasal_verbs":[],"related_terms":["explosion-proof","intrinsically safe"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'spark-resistant' is a technical term used in safety and engineering contexts. It describes something that is designed to not produce sparks, which is important in environments where there is a risk of fire or explosion. Understanding this term is important for anyone working in industries where flammable materials are present."},"example_sentences":[{"sentence":"The pump is made of spark-resistant metal to prevent ignition of the fuel.","translation":"そのポンプは燃料の着火を防ぐために、耐火花金属で作られています。","type":"example","meaning_category":"general"},{"sentence":"All electrical connections in the area must be spark-resistant.","translation":"その地域のすべての電気接続は耐火花性でなければなりません。","type":"example","meaning_category":"general"},{"sentence":"The spark-resistant coating protects the underlying material from ignition.","translation":"耐火花コーティングは、下にある材料を着火から保護します。","type":"example","meaning_category":"general"}]}