{"word":"gyplures","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主に昆虫学) 雌の蛾が放出する性フェロモンを模倣した合成化学物質で、雄の蛾を引き寄せて罠にかけたり、交尾を妨害したりするために使用される。","english_definition":"(primarily entomology) A synthetic chemical substance that mimics the sex pheromone released by female moths, used to attract male moths for trapping or mating disruption.","examples":[{"sentence":"Gyplures are used in traps to monitor and control populations of gypsy moths.","translation":"ジプルーアは、ドクガの個体数を監視および制御するためにトラップで使用されます。"},{"sentence":"The effectiveness of gyplures depends on the specific moth species and environmental conditions.","translation":"ジプルーアの有効性は、特定の蛾の種類と環境条件によって異なります。"}],"collocations":["gyplure trap","gyplure application","gyplure effectiveness","gyplure monitoring"],"synonyms":["pheromone mimic","sex attractant"],"antonyms":[]}],"etymology":{"value":"「gypsy moth」と「lure」を組み合わせた造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɪplʊərz/","syllables":"gyp-lures"},"inflection":{"noun_plural":"gyplures"},"usage_notes":{"explanation":"「gyplure」は、ドクガの防除によく使用される特定の種類の性フェロモン模倣物質を指すことが多いですが、他の蛾の種にも使用できます。この用語は、主に科学的および専門的な文脈で使用されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The gyplure was sprayed to kill the moths.","correct":"✓ The gyplure was used to attract the moths to a trap.","note":"ジプルーアは蛾を殺すのではなく、トラップに誘い込むために使用されます。殺虫剤ではありません。"},{"incorrect":"✗ Gyplure is a natural pheromone produced by male moths.","correct":"✓ Gyplure is a synthetic pheromone that mimics the natural pheromone produced by female moths.","note":"ジプルーアは合成物質であり、雄の蛾ではなく雌の蛾によって生成される天然フェロモンを模倣したものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["gypsy moth","pheromone","lure","attractant","mating disruption"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「gyplure」は、ドクガ（gypsy moth）の防除に使われる合成化学物質の名前です。この物質は、雌の蛾が出すフェロモンという匂いを真似て作られており、雄の蛾を誘い寄せる働きがあります。誘い寄せられた雄の蛾は、罠にかけられたり、交尾を邪魔されたりすることで、ドクガの繁殖を抑えることができます。この言葉は専門的な分野で使われることが多く、日常会話ではあまり耳にしません。"},"example_sentences":[{"sentence":"Scientists are studying the effectiveness of different gyplure formulations.","translation":"科学者たちは、さまざまなジプルーア製剤の有効性を研究しています。","type":"noun","meaning_category":"性フェロモン模倣物質"},{"sentence":"Gyplure traps are a common method for monitoring gypsy moth populations.","translation":"ジプルーアトラップは、ドクガの個体数を監視するための一般的な方法です。","type":"noun","meaning_category":"性フェロモン模倣物質"}]}