{"word":"ethnocentric","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自民族中心主義的な、自文化中心主義的な","english_definition":"evaluating other peoples and cultures according to the standards of one's own culture.","examples":[{"sentence":"The book explores the dangers of ethnocentric attitudes.","translation":"その本は、自民族中心的な態度の危険性を探求している。"},{"sentence":"His ethnocentric views prevented him from understanding other cultures.","translation":"彼の自民族中心的な見方は、彼が他の文化を理解することを妨げた。"},{"sentence":"It is important to avoid being ethnocentric when studying different societies.","translation":"異なる社会を研究する際には、自民族中心主義的になることを避けることが重要である。"}],"collocations":["ethnocentric attitude (自民族中心的な態度)","ethnocentric view (自民族中心的な見方)","ethnocentric perspective (自民族中心的な視点)","ethnocentric bias (自民族中心的な偏見)"],"synonyms":["parochial","insular","chauvinistic","nationalistic","xenophobic"],"antonyms":["cosmopolitan","multicultural","tolerant","open-minded","inclusive"]}],"etymology":{"value":"「ethno-」（民族）と「centric」（中心の）を組み合わせた言葉。ギリシャ語の「ethnos」（民族、国民）とラテン語の「centricus」（中心の）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛθnoʊˈsɛntrɪk/","syllables":"eth-no-cen-tric"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**ethnocentric**」は、自分の属する民族や文化の価値観を基準にして、他の民族や文化を評価する傾向を指す言葉です。自文化を優位とみなし、異文化を劣っていると判断する態度を批判的に表現する際に用いられます。文化人類学、社会学、国際関係論などの分野でよく使われます。単に「自国の文化が好き」という感情とは異なり、「他文化を理解しようとせず、自文化の基準で判断する」という点が強調されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an ethnocentric person because he loves his country.","correct":"✓ He is ethnocentric because he believes his country is superior to all others.","note":"愛国心と自民族中心主義は異なります。自国を愛することは必ずしも自民族中心主義ではありません。自民族中心主義は、自国の文化が他国よりも優れていると信じることです。"},{"incorrect":"✗ The company's ethnocentric marketing strategy was very successful.","correct":"✓ The company's ethnocentric marketing strategy was insensitive and offensive to other cultures.","note":"自民族中心的な戦略は、多くの場合、異文化に対して無神経または攻撃的であるため、成功することは稀です。"},{"incorrect":"✗ She is ethnocentric, so she travels a lot to learn about other cultures.","correct":"✓ Despite being somewhat ethnocentric, she is trying to learn about other cultures.","note":"自民族中心主義的な人は、通常、他の文化を学ぶことに興味を持ちません。"}],"priority":"★★☆"},"related_words":{"derivatives":["ethnocentrism (名詞: 自民族中心主義)","ethnocentrically (副詞: 自民族中心主義的に)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"低頻度 (Low frequency) - 学術的な文脈でよく使われる単語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**ethnocentric**」は、自分の文化や民族の価値観を基準にして、他の文化や民族を評価する傾向を指す言葉です。つまり、自分の文化が一番優れていると考え、他の文化を理解しようとしない態度を表します。この言葉は、社会科学や人文科学の分野でよく使われ、異文化理解の重要性を議論する際に用いられます。例えば、「ethnocentric viewpoint（自民族中心的な視点）」や「ethnocentric bias（自民族中心的な偏見）」といった表現で使われます。"},"example_sentences":[{"sentence":"The documentary highlighted the ethnocentric biases in historical narratives.","translation":"そのドキュメンタリーは、歴史的記述における自民族中心的な偏見を強調した。","type":"adjective","meaning_category":"自民族中心主義的な"},{"sentence":"An ethnocentric perspective can hinder effective cross-cultural communication.","translation":"自民族中心的な視点は、効果的な異文化コミュニケーションを妨げる可能性がある。","type":"adjective","meaning_category":"自民族中心主義的な"},{"sentence":"The company was criticized for its ethnocentric advertising campaign.","translation":"その会社は、自民族中心的な広告キャンペーンで批判された。","type":"adjective","meaning_category":"自民族中心主義的な"},{"sentence":"It's important to be aware of our own ethnocentric tendencies.","translation":"私たち自身の自民族中心的な傾向に気づくことが重要だ。","type":"adjective","meaning_category":"自民族中心主義的な"}]}