{"word":"unfabricable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Impossible to fabricate; that cannot be fabricated or manufactured.","english_definition":"Not capable of being fabricated or manufactured.","examples":[{"sentence":"The design was deemed unfabricable with current technology.","translation":"その設計は現在の技術では製造不可能と判断された。"},{"sentence":"An unfabricable story is one that is too far-fetched to be believed.","translation":"製造不可能な話とは、信じられないほど突飛な話のことです。"}],"collocations":["unfabricable design","unfabricable claim","unfabricable material"],"synonyms":["unmanufacturable","unproducible","impossible to make"],"antonyms":["fabricable","manufacturable","producible"]}],"etymology":{"value":"Formed from 'un-' (not) + 'fabricable' (capable of being fabricated).","priority":"medium"},"pronunciation":{"ipa":"/ʌnˈfæbrɪkəbəl/","syllables":"un-fab-ri-ca-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which are rarely used for 'unfabricable')."},"usage_notes":{"explanation":"'Unfabricable' is a relatively rare word, primarily used in technical or formal contexts. It describes something that cannot be made or manufactured, often due to technological limitations or the nature of the materials involved. It can also be used figuratively to describe a story or claim that is so unbelievable that it seems 'made up' or fabricated.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The story was unfabricated.","correct":"The story was unfabricable.","note":"'Unfabricated' means not fabricated, while 'unfabricable' means impossible to fabricate."}],"priority":"low"},"related_words":{"derivatives":["fabricate","fabrication","fabricable"],"related_terms":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unfabricable' is a technical term meaning something cannot be made or manufactured. It's formed by adding the prefix 'un-' to 'fabricable', which means capable of being made. This word is rarely used in everyday conversation and is more common in engineering, manufacturing, or theoretical discussions. Understanding the root word 'fabricate' (to make or invent) is helpful in understanding 'unfabricable'."},"example_sentences":[{"sentence":"The engineer determined that the proposed component was unfabricable due to its complex geometry.","translation":"エンジニアは、提案されたコンポーネントが複雑な形状のため製造不可能であると判断しました。","type":"technical","meaning_category":"manufacturing"},{"sentence":"The witness's account of the events was so inconsistent and illogical that it seemed completely unfabricable.","translation":"目撃者の出来事の説明は非常に矛盾していて非論理的だったので、完全に作り話のように思えた。","type":"figurative","meaning_category":"believability"}]}