{"word":"transconductance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"相互コンダクタンス","english_definition":"The ratio of the change in current at the output terminal of a device to the change in voltage at the input terminal. It is a measure of the device's ability to control output current with input voltage.","examples":[{"sentence":"The transconductance of this transistor is very high.","translation":"このトランジスタの相互コンダクタンスは非常に高い。"},{"sentence":"Increasing the bias current increases the transconductance.","translation":"バイアス電流を増やすと、相互コンダクタンスが増加する。"}],"collocations":["high transconductance","low transconductance","transconductance amplifier","transconductance curve"],"synonyms":["mutual conductance","gm"],"antonyms":[]}],"etymology":{"value":"Derived from 'trans-' (across, through) + 'conductance' (the measure of the ease with which electric current flows).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænz.kənˈdʌk.təns/","syllables":"trans-con-duc-tance"},"inflection":{"noun_plural":"transconductances"},"usage_notes":{"explanation":"Transconductance (gm) is a parameter used to characterize the performance of electronic devices such as transistors and vacuum tubes. It indicates how effectively the input voltage controls the output current. A higher transconductance generally means better amplification or control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transconductance is measured in ohms.","correct":"✓ The transconductance is measured in siemens (S) or mhos (℧).","note":"Transconductance is the reciprocal of resistance, so it's measured in units of conductance, not resistance."}],"priority":"★★☆"},"related_words":{"derivatives":["transconductance amplifier"],"related_terms":["conductance","resistance","transistor","amplifier"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Transconductance is a technical term used in electronics to describe how effectively a device, like a transistor, can convert an input voltage signal into an output current signal. It's a measure of the device's amplification capability. Understanding transconductance is crucial for designing and analyzing electronic circuits.","priority":"★★☆"},"example_sentences":[{"sentence":"The MOSFET has a higher transconductance than the BJT in certain operating regions.","translation":"MOSFETは、特定の動作領域において、BJTよりも高い相互コンダクタンスを持つ。","type":"general","meaning_category":"Definition"},{"sentence":"The transconductance amplifier converts an input voltage to an output current.","translation":"相互コンダクタンス増幅器は、入力電圧を出力電流に変換する。","type":"example","meaning_category":"Application"}]}