{"word":"Coal-banned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a country, region, or industry) having a ban on the use, production, or import/export of coal.","english_definition":"Describes a country, region, or industry where the use, production, or trade of coal is prohibited.","examples":[{"sentence":"Germany is becoming increasingly coal-banned, aiming to phase out coal power plants by 2038.","translation":"ドイツは石炭の使用禁止をますます進めており、2038年までに石炭火力発電所を段階的に廃止することを目指しています。"},{"sentence":"The city council declared the downtown area coal-banned to improve air quality.","translation":"市議会は大気質を改善するために、ダウンタウン地区を石炭使用禁止区域に指定しました。"},{"sentence":"The company became coal-banned due to increasing pressure from environmental groups.","translation":"その会社は環境団体からの圧力が高まるにつれて、石炭の使用を禁止するようになりました。"}],"collocations":["coal-banned country","coal-banned region","coal-banned industry","become coal-banned","declare coal-banned"],"synonyms":["coal-free","decoalized","post-coal"],"antonyms":["coal-dependent","coal-reliant","coal-intensive"]}],"etymology":{"value":"A compound word formed by combining 'coal' (referring to the fossil fuel) and 'banned' (meaning prohibited or forbidden). The term describes something that has had coal use prohibited.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkoʊlˌbænd/","syllables":"coal-banned"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are possible (more coal-banned, most coal-banned), but less common."},"usage_notes":{"explanation":"'Coal-banned' is a relatively new term that reflects the growing global movement to reduce reliance on coal as an energy source due to its environmental impact. It is often used in discussions about climate change, energy policy, and environmental regulations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coal-banned is effective.","correct":"✓ The coal ban is effective. / ✓ The coal-banned policy is effective.","note":"'Coal-banned' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect. Use 'coal ban' as a noun phrase instead."}],"priority":"★★☆"},"related_words":{"derivatives":["ban","banned","coal","coal ban","coal phase-out","decarbonization"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - relatively new and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coal-banned' is a compound adjective used to describe entities (countries, regions, industries) that have implemented a ban on coal. It is commonly found in discussions related to environmental policy, renewable energy, and climate change mitigation strategies. Understanding this term requires familiarity with the broader context of global efforts to reduce carbon emissions and transition away from fossil fuels."},"example_sentences":[{"sentence":"The government's decision made the country effectively **coal-banned**.","translation":"政府の決定により、その国は事実上石炭使用禁止となった。","type":"adjective","meaning_category":"having a ban on coal"},{"sentence":"The **coal-banned** initiative aims to promote renewable energy sources.","translation":"石炭使用禁止イニシアチブは、再生可能エネルギー源の促進を目指している。","type":"adjective","meaning_category":"having a ban on coal"}]}