{"word":"trichroic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"三色性の、三色鏡の","english_definition":"Exhibiting three different colors when viewed from different angles or with polarized light.","examples":[{"sentence":"The mineral sample was trichroic, displaying distinct colors depending on the viewing angle.","translation":"その鉱物標本は三色性を示し、見る角度によって異なる色を示した。"},{"sentence":"Certain gemstones are prized for their trichroic properties.","translation":"特定の宝石は、その三色性特性で珍重されている。"}],"collocations":["trichroic mineral","trichroic crystal","exhibit trichroism","trichroic behavior"],"synonyms":["pleochroic","polychromatic"],"antonyms":["monochromatic","achromatic"]}],"etymology":{"value":"From the Greek words 'tri-' (three) + 'chroos' (color) + '-ic' (suffix indicating characteristic or pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈkroʊɪk/","syllables":"tri-chro-ic"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Trichroic' is a term primarily used in mineralogy and optics to describe materials that show three different colors depending on the angle of observation or the polarization of light. This property is due to the differential absorption of light along different crystallographic axes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paint was trichromatic.","correct":"✓ The paint was trichroic.","note":"'Trichroic' refers to the property of showing three different colors from different angles, whereas 'trichromatic' usually refers to a system using three primary colors to produce a range of colors."},{"incorrect":"✗ The trichroic flower.","correct":"✓ The pleochroic flower.","note":"While 'trichroic' technically means 'three colors', in practice, the term 'pleochroic' is more commonly used to describe plants or other biological samples that show varying colors."}],"priority":"★★☆"},"related_words":{"derivatives":["trichroism (noun: the property of being trichroic)"],"related_terms":["pleochroism (a more general term for displaying different colors from different angles)","dichroism (displaying two different colors)","monochromatic (displaying one color)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trichroic' is a specialized term used in scientific contexts, particularly in mineralogy and optics. It describes the property of a material exhibiting three distinct colors when viewed from different angles or with polarized light. Understanding this term requires a background in crystallography or optics to grasp the underlying principles of light absorption and polarization within anisotropic materials."},"example_sentences":[{"sentence":"The gemologist identified the stone as trichroic using a dichroscope.","translation":"宝石学者は、二色鏡を使ってその石が三色性であることを確認した。","type":"general","meaning_category":"descriptive"},{"sentence":"The trichroic nature of the crystal allowed scientists to determine its crystallographic orientation.","translation":"その結晶の三色性により、科学者たちはその結晶学的配向を決定することができた。","type":"scientific","meaning_category":"scientific"}]}