{"word":"yew-hedged","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"イチイの生垣で囲まれた、イチイの生垣のある","english_definition":"Enclosed or bordered by a hedge made of yew trees.","examples":[{"sentence":"The yew-hedged garden provided a secluded and peaceful retreat.","translation":"イチイの生垣で囲まれた庭は、人目を避けた静かな隠れ家を提供した。"},{"sentence":"They walked along the yew-hedged path, enjoying the symmetry and order of the landscape.","translation":"彼らはイチイの生垣のある小道を歩き、景観の対称性と秩序を楽しんだ。"}],"collocations":["yew-hedged garden","yew-hedged path","yew-hedged lawn"],"synonyms":["yew-bordered","yew-lined","yew-enclosed"],"antonyms":[]}],"etymology":{"value":"The term 'yew-hedged' is a compound adjective formed by combining 'yew' (referring to the yew tree) and 'hedged' (meaning enclosed or bordered by a hedge). The term describes something that is surrounded or defined by a hedge made of yew trees.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːˌhɛdʒd/","syllables":"yew-hedged"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are not typically used, as it describes a state of being."},"usage_notes":{"explanation":"'Yew-hedged' is a descriptive adjective often used in the context of gardens, estates, or landscapes. It evokes a sense of formality, privacy, and traditional English garden design, as yew hedges are commonly associated with well-maintained and historically significant gardens.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The yew hedged was beautiful.","correct":"✓ The yew-hedged garden was beautiful.","note":"'yew-hedged' is an adjective and needs to modify a noun. Using it alone as a noun is incorrect."},{"incorrect":"✗ The yew-hedge garden.","correct":"✓ The yew-hedged garden.","note":"The correct form is 'yew-hedged' as a compound adjective, not 'yew-hedge' followed by a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["yew (noun): イチイ (植物)","hedge (noun): 生垣","hedged (adjective): 生垣で囲まれた","yew hedge (noun): イチイの生垣"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a relatively specific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Yew-hedged' is a compound adjective that describes something enclosed or bordered by a hedge made of yew trees. Yew trees are evergreen trees often used in formal gardens to create dense, neatly trimmed hedges. The term is most likely to be encountered in descriptions of gardens, estates, or landscapes, and it suggests a sense of formality, privacy, and traditional English garden design. Understanding the individual words 'yew' and 'hedged' helps to grasp the meaning of the compound adjective."},"example_sentences":[{"sentence":"The stately home featured a long, yew-hedged driveway leading to the entrance.","translation":"その堂々とした家は、入り口へと続く、イチイの生垣のある長い私道が特徴だった。","type":"adjective","meaning_category":"description"},{"sentence":"Visitors admired the intricate topiary within the yew-hedged gardens.","translation":"訪問者たちは、イチイの生垣で囲まれた庭園内の複雑なトピアリーに感心した。","type":"adjective","meaning_category":"description"}]}