{"word":"versifications","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"韻文にすること、韻文作品、詩作","english_definition":"The act or process of versifying; the conversion of prose into verse; a metrical composition; a version or rendering in verse.","examples":[{"sentence":"His versifications of the Psalms were widely sung.","translation":"彼の詩編の韻文訳は広く歌われた。"},{"sentence":"The book contains several of his early versifications.","translation":"その本には彼の初期の韻文作品がいくつか含まれている。"}],"collocations":["Psalm versifications (詩編の韻文訳)","early versifications (初期の韻文作品)"],"synonyms":["poetry","verse","poesy","poem","rhymes"],"antonyms":["prose"]}],"etymology":{"value":"From the verb 'versify,' which comes from Middle French 'versifier' and ultimately from Latin 'versus' (a line, verse) + '-fy' (to make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɜːrsɪfɪˈkeɪʃənz/","syllables":"ver-si-fi-ca-tions"},"inflection":{"noun_plural":"versifications"},"usage_notes":{"explanation":"'Versifications' refers to the process of turning something (usually prose) into verse, or to the resulting poems or metrical compositions. It is often used in the context of religious texts or classical literature that have been re-written in verse form. The word can also simply refer to instances of poetry or poetic writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The novel was full of versification.","correct":"✓ The novel was full of verse.","note":"'Versification' refers to the act or process of creating verse or specific examples of verse. 'Verse' is the more general term for poetry or metrical writing. Using 'verse' is more appropriate when referring to poetry in general."}],"priority":"★★☆"},"related_words":{"derivatives":["versify (verb: to turn into or express in verse)","versifier (noun: a person who versifies, especially one who is unskilled)","verse (noun: writing arranged with a metrical rhythm, typically having a rhyme)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'versifications' is a relatively uncommon and formal term. It refers to the act of creating poetry or to specific examples of poetic writing. Understanding this word requires a strong vocabulary and familiarity with literary terms. It is not typically used in everyday conversation but may appear in academic or literary contexts."},"example_sentences":[{"sentence":"His later years were devoted to religious versifications.","translation":"彼の晩年は宗教的な韻文作品に費やされた。","type":"noun","meaning_category":"韻文作品"},{"sentence":"The versifications of the Bible were intended to make the text more accessible to the common people.","translation":"聖書の韻文訳は、一般の人々がテキストにアクセスしやすくすることを目的としていた。","type":"noun","meaning_category":"韻文にすること"}]}