{"word":"cuckooed","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(俗語)出し抜く、騙す、出し抜いて手に入れる","english_definition":"(slang) to outwit, deceive, or trick someone, especially to gain something unfairly","examples":[{"sentence":"He cuckooed his business partner out of a large sum of money.","translation":"彼はビジネスパートナーを騙して大金を奪い取った。"},{"sentence":"She felt cuckooed when she realized the sales clerk had overcharged her.","translation":"店員に多く請求されたことに気づき、彼女は騙されたと感じた。"}],"collocations":["cuckoo someone out of something","get cuckooed"],"synonyms":["swindle","defraud","cheat","dupe","trick","outwit"],"antonyms":["be honest","be fair"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(俗語)気が狂う、正気を失う、頭がおかしくなる","english_definition":"(slang) to go mad or crazy; to lose one's sanity","examples":[{"sentence":"He's completely cuckooed after working on that project for so long.","translation":"彼はそのプロジェクトに長期間取り組んだ後、完全に気が狂ってしまった。"},{"sentence":"The pressure of the job nearly cuckooed her.","translation":"仕事のプレッシャーで彼女は気が狂いそうになった。"}],"collocations":["go cuckooed","become cuckooed"],"synonyms":["go crazy","go mad","lose one's mind","become insane","snap"],"antonyms":["stay sane","remain rational"]}],"etymology":{"value":"Derived from the behavior of cuckoo birds, which lay their eggs in other birds' nests, effectively tricking the host birds into raising their young. The verb 'cuckoo' came to mean to trick or deceive, and later, to go crazy, possibly due to the bird's unusual behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkuːkuːd/","syllables":"cu-ckooed"},"inflection":{"verb_forms":{"present_simple":["cuckoo","cuckoos"],"past_simple":"cuckooed","past_participle":"cuckooed","present_participle":"cuckooing"}},"usage_notes":{"explanation":"'Cuckooed' is a slang term that can mean either to deceive someone or to go crazy. The meaning depends on the context. It is not a formal word and is more commonly used in informal settings. The origin of the word comes from the cuckoo bird, which is known for laying its eggs in other birds' nests.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The clock cuckooed loudly.","correct":"✓ The cuckoo clock cuckooed loudly.","note":"'Cuckooed' as a verb is not directly related to the sound a cuckoo clock makes, but rather to the act of deceiving or going crazy. To describe the sound, use 'cuckooed' as part of the noun phrase 'cuckoo clock'."},{"incorrect":"✗ He cuckooed the truth.","correct":"✓ He cuckooed me. / He cuckooed me out of my money.","note":"When used to mean 'deceive', 'cuckoo' usually takes a person as the direct object. To express deceiving about a fact, use other verbs like 'lied about' or 'misrepresented'."}],"priority":"★★☆"},"related_words":{"derivatives":["cuckoo (noun: a type of bird, a crazy person; adjective: crazy)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cuckooed' is a slang term with two main meanings: to deceive someone or to become mentally unstable. The term is derived from the cuckoo bird's habit of laying its eggs in other birds' nests, symbolizing trickery. When used to mean 'deceive,' it implies unfairly gaining something by tricking someone. When used to mean 'go crazy,' it suggests losing one's sanity, often due to stress or pressure. This term is informal and not commonly used in formal contexts."},"example_sentences":[{"sentence":"The con artist cuckooed several elderly people out of their life savings.","translation":"その詐欺師は数人の高齢者を騙して生涯の貯蓄を奪った。","type":"verb","meaning_category":"deceive"},{"sentence":"After months of isolation, he felt like he was going cuckooed.","translation":"数ヶ月の隔離の後、彼は気が狂いそうだと感じた。","type":"verb","meaning_category":"go crazy"}]}