{"word":"CFC","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クロロフルオロカーボン (chlorofluorocarbon)","english_definition":"A chlorofluorocarbon; any of a class of organic compounds that contain only carbon, chlorine, and fluorine, formerly used extensively as refrigerants, propellants, and solvents, but now largely banned because they contribute to ozone depletion.","examples":[{"sentence":"CFCs were widely used in refrigerators before their harmful effects were known.","translation":"CFCはその有害な影響が知られる前に、冷蔵庫に広く使用されていました。"},{"sentence":"The Montreal Protocol aimed to phase out the production and use of CFCs.","translation":"モントリオール議定書は、CFCの生産と使用の段階的廃止を目指しました。"}],"collocations":["ozone depletion (オゾン層破壊)","Montreal Protocol (モントリオール議定書)","refrigerant (冷媒)","greenhouse gas (温室効果ガス)"],"synonyms":["Freon"],"antonyms":[],"related_terms":["HCFC (ハイドロクロロフルオロカーボン)","HFC (ハイドロフルオロカーボン)"]}],"etymology":{"value":"An abbreviation of chlorofluorocarbon.","priority":"★★★"},"pronunciation":{"ipa":"ˌsiːˌefˈsiː","syllables":"C-F-C"},"inflection":{"noun_plural":"CFCs"},"usage_notes":{"explanation":"CFCs are synthetic chemical compounds that were once widely used in various applications due to their stability and non-toxicity. However, it was later discovered that CFCs contribute significantly to the depletion of the ozone layer, which protects the Earth from harmful ultraviolet radiation. As a result, international agreements like the Montreal Protocol have led to the phasing out of CFCs and their replacement with less harmful alternatives such as HCFCs and HFCs. While HCFCs are also being phased out due to their ozone-depleting potential, HFCs are now under scrutiny as potent greenhouse gases that contribute to climate change.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ CFC is a very good refrigerant.","correct":"✓ CFCs were once considered very good refrigerants.","note":"While CFCs were once considered good refrigerants, it's important to acknowledge that their use is now largely banned due to their harmful environmental effects."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ozone layer","global warming","climate change","environmental protection","sustainable development"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderate frequency, especially in scientific and environmental contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'CFC' refers to chlorofluorocarbons, which are synthetic chemicals that were widely used in the past as refrigerants, propellants, and solvents. However, due to their significant contribution to ozone depletion, CFCs have been largely phased out under international agreements like the Montreal Protocol. Understanding the term 'CFC' requires knowledge of environmental science and the impact of human activities on the atmosphere. The term is often discussed in the context of global warming, climate change, and the search for environmentally friendly alternatives.","priority":"★★★"},"example_sentences":[{"sentence":"The use of **CFCs** in aerosols was banned in many countries in the 1980s.","translation":"エアゾールにおけるCFCの使用は、1980年代に多くの国で禁止されました。","type":"noun","meaning_category":"chlorofluorocarbon"},{"sentence":"Scientists discovered that **CFCs** were damaging the ozone layer.","translation":"科学者たちは、CFCがオゾン層を破壊していることを発見しました。","type":"noun","meaning_category":"chlorofluorocarbon"},{"sentence":"The Montreal Protocol has been successful in reducing the production of **CFCs**.","translation":"モントリオール議定書は、CFCの生産削減に成功しています。","type":"noun","meaning_category":"chlorofluorocarbon"}]}