{"word":"climate-naive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"気候変動の影響を受けていない、またはほとんど受けていない状態。特に、過去の気候データに基づいて意思決定を行う際に、将来の気候変動の影響を考慮していない状況を指す。","english_definition":"Not having experienced or been affected by climate change impacts; specifically, referring to a situation where decisions are made based on historical climate data without considering the effects of future climate change.","examples":[{"sentence":"The original infrastructure design was climate-naive, failing to account for increased flooding risks.","translation":"当初のインフラ設計は気候変動の影響を考慮しておらず、洪水リスクの増加を考慮していなかった。"},{"sentence":"Many older building codes are climate-naive and need to be updated to reflect current and future climate realities.","translation":"多くの古い建築基準は気候変動の影響を考慮しておらず、現在および将来の気候の現実を反映するように更新する必要がある。"},{"sentence":"A climate-naive approach to water resource management can lead to unsustainable practices.","translation":"水資源管理に対する気候変動を考慮しないアプローチは、持続不可能な慣行につながる可能性がある。"}],"collocations":["climate-naive design (気候変動を考慮しない設計)","climate-naive infrastructure (気候変動を考慮しないインフラ)","climate-naive planning (気候変動を考慮しない計画)","climate-naive assumptions (気候変動を考慮しない前提)","climate-naive policies (気候変動を考慮しない政策)"],"synonyms":["climate-unaware","climate-agnostic","climate-blind"],"antonyms":["climate-aware","climate-informed","climate-resilient"]}],"etymology":{"value":"「climate（気候）」と「naive（世間知らずの、単純な）」の組み合わせ。気候変動の影響を考慮しない、または認識していない状態を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklaɪmət neɪˈiːv/","syllables":"cli-mate-nai-ive"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります（more climate-naive, most climate-naive）。"},"usage_notes":{"explanation":"「**climate-naive**」は、気候変動のリスクや影響を考慮せずに、過去のデータや経験に基づいて意思決定や計画を行うことを批判的に指す言葉です。特に、インフラ設計、都市計画、農業、水資源管理などの分野で使用されます。将来の気候変動によって、過去のデータがもはや信頼できない場合に、この言葉が用いられます。より積極的なアプローチは、「climate-aware（気候変動を認識している）」または「climate-resilient（気候変動に強い）」です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is climate-naive about recycling.","correct":"✓ The company is climate-naive about the effects of climate change on their supply chain.","note":"「climate-naive」は、気候変動の影響を考慮していないことを指します。リサイクルに関する無知は、別の表現が適切です。"},{"incorrect":"✗ He is a climate-naive person.","correct":"✓ He is taking a climate-naive approach to the problem.","note":"「climate-naive」は、人そのものを指すよりも、その人の行動やアプローチを指すことが多いです。"}],"priority":"★★☆"},"related_words":{"derivatives":["naivete (名詞: 世間知らず、単純さ)","climate change (名詞: 気候変動)","climate risk (名詞: 気候リスク)","climate resilience (名詞: 気候変動に対する強靭性)","climate adaptation (名詞: 気候変動適応)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用される比較的新しい用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**climate-naive**」という言葉は、気候変動がもたらす影響を十分に理解していない、または考慮していないことを表す専門的な用語です。これは、将来の気候変動によって過去のデータや経験が通用しなくなる可能性がある状況において、特に問題となります。たとえば、過去の降水量データに基づいて設計されたインフラが、将来の極端な降雨イベントに対応できない場合、その設計は「climate-naive」であると言えます。この言葉は、より積極的な気候変動対策を促すために、批判的な意味合いで使用されることが多いです。"},"example_sentences":[{"sentence":"The city's flood defenses were built using a climate-naive model, which underestimated future sea-level rise.","translation":"その都市の洪水防御施設は、将来の海面上昇を過小評価した気候変動を考慮しないモデルを使用して建設された。","type":"adjective","meaning_category":"気候変動を考慮しない"},{"sentence":"Relying solely on historical weather patterns is a climate-naive strategy for agriculture in the face of increasing climate variability.","translation":"気候変動の変動性が増大する中で、過去の気象パターンのみに頼ることは、農業にとって気候変動を考慮しない戦略である。","type":"adjective","meaning_category":"気候変動を考慮しない"},{"sentence":"The company's investment decisions were criticized for being climate-naive and ignoring the long-term risks of fossil fuels.","translation":"その企業の投資決定は、気候変動を考慮せず、化石燃料の長期的なリスクを無視しているとして批判された。","type":"adjective","meaning_category":"気候変動を考慮しない"}]}