{"word":"name-caller","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に公の場で)相手を侮辱するような名前で呼ぶ人、悪口を言う人","english_definition":"a person who insults or criticizes others by using abusive names, especially in public.","examples":[{"sentence":"He accused his opponent of being a name-caller during the debate.","translation":"彼は討論中、対戦相手が相手を侮辱するような名前で呼ぶ人だと非難した。"},{"sentence":"The politician is known for being a name-caller, often resorting to personal attacks.","translation":"その政治家は、個人的な攻撃に訴えることが多く、悪口を言う人として知られている。"},{"sentence":"Instead of engaging in constructive dialogue, some people resort to being name-callers online.","translation":"建設的な対話をする代わりに、一部の人々はオンラインで悪口を言うことに頼っている。"}],"collocations":["a habitual name-caller (常習的な悪口を言う人)","online name-callers (オンラインで悪口を言う人たち)","political name-callers (政治的な悪口を言う人たち)"],"synonyms":["insulter","abuser","critic","slanderer","defamer","vilifier"],"antonyms":["peacemaker","mediator","conciliator","harmonizer"]},{"part_of_speech":"noun","definition":"(子供の言葉で)悪口を言う人","english_definition":"(in children's language) someone who calls people names in an unkind way.","examples":[{"sentence":"Don't be a name-caller; it's not nice to say mean things to others.","translation":"悪口を言う人にならないで。人に意地悪なことを言うのは良くないことだよ。"},{"sentence":"The teacher told the children not to be name-callers and to treat each other with respect.","translation":"先生は子供たちに悪口を言う人にならないように、お互いを尊重するように言った。"}],"collocations":["stop being a name-caller (悪口を言うのをやめる)"],"synonyms":["bully","tease","tormentor"],"antonyms":["friend","supporter"]}],"etymology":{"value":"The term 'name-caller' is a compound word formed from 'name' (referring to a label or designation) and 'caller' (someone who calls or refers to something). It describes someone who uses names, often derogatory or insulting, to address or refer to others.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪmˌkɔːlər/","syllables":"name-call-er"},"inflection":{"noun_plural":"name-callers"},"usage_notes":{"explanation":"'Name-caller' typically refers to someone who uses offensive or insulting names to attack or criticize others, especially in a public or political context. It can also be used in a more general sense to describe someone who is simply unkind or disrespectful in their language. In children's language, it specifically refers to someone who calls people names in an unkind way, often associated with bullying or teasing behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a name caller.","correct":"✓ He is a name-caller.","note":"The correct form is 'name-caller' with a hyphen."},{"incorrect":"✗ Name callers are not good peoples.","correct":"✓ Name-callers are not good people.","note":"'People' is the plural form of 'person.'"}],"priority":"★★☆"},"related_words":{"derivatives":["name-calling (noun: the act of insulting or criticizing someone by using abusive names)"],"related_terms":["ad hominem (argument)","personal attack","insult","abuse","vilification"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"relatively low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'name-caller' refers to someone who uses insulting or offensive names to criticize or attack others, especially in public or political contexts. It implies a lack of constructive engagement and a reliance on personal attacks rather than reasoned arguments. The term is often used in discussions about political discourse, online behavior, and interpersonal communication. Understanding the term requires a grasp of abstract concepts such as insult, criticism, and public discourse."},"example_sentences":[{"sentence":"The debate quickly devolved into a shouting match with both candidates resorting to **name-caller** tactics.","translation":"討論はすぐに怒鳴り合いに発展し、両候補者とも悪口を言う戦術に頼った。","type":"noun","meaning_category":"insulter"},{"sentence":"The website has a strict policy against **name-callers** and abusive language.","translation":"そのウェブサイトには、悪口を言う人や乱暴な言葉に対する厳格なポリシーがある。","type":"noun","meaning_category":"insulter"},{"sentence":"The teacher warned the students not to be **name-callers** on the playground.","translation":"先生は生徒たちに、運動場で悪口を言う人にならないように注意した。","type":"noun","meaning_category":"bully (children's language)"}]}