{"word":"haecceity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"個物性、個別性、個別存在性：ある個物を他のすべての個物から区別する性質、または、それ自体がそれであり、他の何者でもないという性質。","english_definition":"The property of being a unique individual; the 'thisness' of a thing that makes it different from every other thing.","examples":[{"sentence":"Each person possesses a unique haecceity that distinguishes them from all others.","translation":"各人は、他のすべての人と区別する独自の個物性を持っている。"},{"sentence":"The concept of haecceity is central to discussions of identity and existence in metaphysics.","translation":"個物性の概念は、形而上学におけるアイデンティティと存在に関する議論の中心である。"}],"collocations":["possess haecceity","unique haecceity","discuss haecceity","concept of haecceity"],"synonyms":["thisness","individuality","particularity","singularity"],"antonyms":["universality","generality"]}],"etymology":{"value":"ラテン語の 'haecceitas' に由来し、'haec' (これ) に接尾辞 '-itas' (～性) が付いたもの。スコラ哲学において、個々の存在を他の存在から区別する本質的な性質を指すために用いられた。","priority":"★★☆"},"pronunciation":{"ipa":"/hɛkˈsiːɪti/","syllables":"haec-ce-i-ty"},"inflection":{"noun_plural":"haecceities"},"usage_notes":{"explanation":"'Haecceity' は哲学、特に形而上学で用いられる専門用語であり、日常会話ではほとんど使用されない。個々の存在が持つ、他のいかなる存在とも共有できない固有の性質を指す。例えば、ある特定の人物の「私」という感覚や、ある特定のリンゴの「このリンゴである」という性質が、その個物の個物性にあたる。この概念は、同一性、存在、そして可能性世界に関する議論で重要な役割を果たす。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The haecceity of the painting is its beauty.","correct":"✓ The haecceity of the painting is its unique combination of brushstrokes, colors, and history that makes it distinct from all other paintings.","note":"個物性は、単なる一般的な性質（美しさなど）ではなく、その個物を他のすべてのものから区別する具体的な個別の性質を指す。"},{"incorrect":"✗ Haecceity is the same as personality.","correct":"✓ Haecceity is related to identity, but it is a more fundamental concept that refers to the unique 'thisness' of an individual, while personality refers to their characteristic patterns of thinking, feeling, and behaving.","note":"性格（personality）は、思考、感情、行動のパターンを指すが、個物性は、その個物を唯一無二の存在たらしめる根本的な性質を指す。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["identity","essence","existence","possible worlds","individualism","particularism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (哲学分野の専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学分野の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Haecceity' is a philosophical term that refers to the unique 'thisness' of an individual, the property that makes it distinct from all other individuals. It's a concept used in metaphysics to discuss identity and existence. Think of it as the specific set of qualities that make a particular thing itself, and not something else. This term is rarely used outside of philosophical discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The philosopher argued that each grain of sand possesses its own unique haecceity.","translation":"その哲学者は、砂の一粒一粒が独自の個物性を持っていると主張した。","type":"noun","meaning_category":"個物性"},{"sentence":"Understanding the haecceity of an object requires considering its entire history and all of its properties.","translation":"物体の個物性を理解するには、その全歴史とすべての特性を考慮する必要がある。","type":"noun","meaning_category":"個物性"},{"sentence":"The debate over whether haecceity is an intrinsic or extrinsic property continues among philosophers.","translation":"個物性が内在的性質であるか外在的性質であるかの議論は、哲学者たちの間で続いている。","type":"noun","meaning_category":"個物性"}]}