{"word":"flat-hatted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(米俗語) (特に海軍のパイロットが)危険なほど大胆な、向こう見ずな","english_definition":"(US slang) recklessly daring or audacious, especially of a naval aviator.","examples":[{"sentence":"He was known for his flat-hatted flying, often buzzing the control tower.","translation":"彼は危険なほど大胆な飛行で知られており、管制塔をかすめることもよくあった。"},{"sentence":"The flat-hatted pilot performed a daring maneuver over the aircraft carrier.","translation":"その向こう見ずなパイロットは空母の上で大胆な操縦を行った。"}],"collocations":["flat-hatted flying","flat-hatted maneuver","flat-hatted behavior"],"synonyms":["reckless","audacious","daredevil","imprudent","foolhardy"],"antonyms":["cautious","prudent","circumspect","careful"]}],"etymology":{"value":"'Flat-hatted' derives from the image of a pilot flying so low that they could theoretically knock a hat off someone's head. The 'flat hat' refers to the type of hat often worn by sailors and other naval personnel.","priority":"★★★"},"pronunciation":{"ipa":"/ˈflætˌhætɪd/","syllables":"flat-hat-ted"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'flat-hatted' is primarily used in American slang, particularly within naval aviation contexts. It describes behavior that is considered dangerously bold and often involves disregarding safety regulations. While it can sometimes be used admiringly to describe someone's skill or daring, it generally carries a negative connotation due to the inherent risk involved.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a flat-hatted dresser.","correct":"✓ He was a reckless pilot.","note":"'Flat-hatted' specifically refers to reckless behavior, especially in aviation, not general style or fashion."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["buzzing (flying low and fast)","dogfighting (aerial combat)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (slang)","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Flat-hatted' is a slang term, primarily used in American English, to describe someone, especially a pilot, who is recklessly daring. It implies a disregard for safety and regulations, often involving showy or dangerous maneuvers. Due to its specialized and informal nature, it is not commonly used in general conversation and is more likely to be encountered in specific contexts, such as stories or discussions about aviation."},"example_sentences":[{"sentence":"His flat-hatted antics got him grounded for a month.","translation":"彼の向こう見ずな行動のせいで、彼は1ヶ月間飛行停止になった。","type":"adjective","meaning_category":"recklessly daring"},{"sentence":"The admiral warned against any flat-hatted behavior that could endanger the mission.","translation":"提督は任務を危険にさらす可能性のある向こう見ずな行動をしないように警告した。","type":"adjective","meaning_category":"recklessly daring"}]}