{"word":"expungable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"消去可能な、抹消可能な","english_definition":"Capable of being expunged; able to be erased or removed completely.","examples":[{"sentence":"The record was expungable after a certain period of good behavior.","translation":"一定期間の良好な行動の後、その記録は抹消可能だった。"},{"sentence":"Whether the information is expungable depends on the specific laws.","translation":"その情報が消去可能かどうかは、特定の法律に依存する。"}],"collocations":["expungable record (抹消可能な記録)","expungable offense (抹消可能な違反)","become expungable (抹消可能になる)"],"synonyms":["erasable","removable","deletable","obliterable"],"antonyms":["permanent","indelible","irremovable"]}],"etymology":{"value":"The word \"expungable\" is derived from the verb \"expunge,\" which comes from the Latin word \"expungere,\" meaning \"to mark out, blot out, erase.\" \"Ex-\" means \"out\" and \"pungere\" means \"to prick, puncture, mark.\" The suffix \"-able\" indicates capability.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspʌndʒəbəl/","syllables":"ex-punge-a-ble"},"inflection":{"adjective_forms":{"comparative":"more expungable","superlative":"most expungable"}},"usage_notes":{"explanation":"\"Expungable\" is primarily used in legal contexts to describe records or information that can be officially erased or removed from a person's official history, often after a certain period of time or under specific conditions. It suggests the possibility of a clean slate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stain was expungable from the fabric.","correct":"✓ The stain was removable from the fabric.","note":"While 'expungable' means capable of being erased, it is typically reserved for legal or official records, not physical stains or marks. 'Removable' is more appropriate for physical objects."},{"incorrect":"✗ He wanted to expunge his memories.","correct":"✓ He wanted to erase his memories.","note":"'Expunge' and 'expungable' are generally used for official records, not personal memories. 'Erase' is more suitable for memories or thoughts."}],"priority":"★★☆"},"related_words":{"derivatives":["expunge (verb: to erase or remove completely)","expungement (noun: the act of expunging)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (Relatively uncommon word, primarily used in legal or formal contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"expungable\" is a relatively uncommon term, primarily used in legal and formal contexts. It describes something that is capable of being officially erased or removed, typically referring to records or information. Understanding this word requires familiarity with legal terminology and a high level of English proficiency. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The judge ruled that the conviction was expungable after five years.","translation":"裁判官は、有罪判決は5年後に抹消可能であると判決を下した。","type":"adjective","meaning_category":"消去可能な (法律)"},{"sentence":"Not all criminal records are expungable under the current law.","translation":"現在の法律では、すべての犯罪記録が抹消可能であるわけではない。","type":"adjective","meaning_category":"抹消可能な (法律)"}]}