{"word":"union-avoidance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"労働組合回避、ユニオン・アヴォイダンス","english_definition":"The practice of employers attempting to prevent their employees from forming or joining a labor union.","examples":[{"sentence":"The company was accused of union-avoidance tactics.","translation":"その会社は、労働組合回避戦術を使ったとして非難された。"},{"sentence":"Consultants specializing in union-avoidance are often hired by companies facing unionization efforts.","translation":"労働組合回避を専門とするコンサルタントは、労働組合結成の動きに直面している企業によく雇われる。"}],"collocations":["union-avoidance strategy","union-avoidance consultant","union-avoidance tactics","union-avoidance training"],"synonyms":["union busting","anti-union activities"],"antonyms":["union organizing","union support","collective bargaining"]}],"etymology":{"value":"The term is formed by combining \"union\" (referring to labor unions) and \"avoidance\" (the act of avoiding or preventing something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈjuːnjən əˈvɔɪdəns/","syllables":"u-nion a-void-ance"},"inflection":{"noun_plural":"union-avoidances (rarely used)"},"usage_notes":{"explanation":"\"Union-avoidance\" refers to the actions taken by employers to remain non-unionized. These actions can range from legal strategies, such as improving employee relations and offering competitive benefits, to illegal tactics, such as intimidation and discrimination against union supporters. The term often carries a negative connotation, implying that the employer is acting against the best interests of their employees.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company promoted union-avoidance.","correct":"✓ The company practiced union-avoidance.","note":"\"Union-avoidance\" is a practice or strategy, so it's more accurate to say a company \"practices\" or \"employs\" union-avoidance, rather than \"promotes\" it.  \"Promote\" could be used if the company is openly advocating for other companies to do the same."},{"incorrect":"✗ Union avoidance is always illegal.","correct":"✓ Some union avoidance tactics are illegal.","note":"Not all union-avoidance strategies are illegal. Some legal strategies include improving employee relations and offering competitive benefits. Illegal tactics include intimidation and discrimination."}],"priority":"★★☆"},"related_words":{"derivatives":["union-avoidance consultant","union-avoidance training"],"phrasal_verbs":[],"related_concepts":["labor relations","collective bargaining","union busting","employee rights","National Labor Relations Act (NLRA) (in the US)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Union-avoidance\" is a specialized term used in the context of labor relations. It refers to the strategies and actions taken by employers to prevent their employees from forming or joining a labor union. Understanding this term requires familiarity with concepts such as labor unions, collective bargaining, and employee rights. The term often implies a conflict of interest between employers and employees regarding unionization."},"example_sentences":[{"sentence":"The company implemented a new employee engagement program as part of its union-avoidance strategy.","translation":"その会社は、労働組合回避戦略の一環として、新しい従業員エンゲージメントプログラムを実施した。","type":"noun","meaning_category":"労働組合回避戦略"},{"sentence":"Critics argue that some union-avoidance tactics are unethical and harmful to workers' rights.","translation":"批評家たちは、一部の労働組合回避戦術は非倫理的であり、労働者の権利を侵害すると主張している。","type":"noun","meaning_category":"労働組合回避戦術"},{"sentence":"The seminar focused on legal methods of union-avoidance.","translation":"そのセミナーは、合法的な労働組合回避の方法に焦点を当てた。","type":"noun","meaning_category":"労働組合回避の方法"}]}