{"word":"Glaucosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare condition where the iris of the eye appears bluish-green.","english_definition":"A rare condition where the iris of the eye appears bluish-green.","examples":[{"sentence":"The patient presented with glaucosis in both eyes.","translation":"その患者は両目に緑内障様の色素沈着を呈していた。"}],"collocations":["glaucosis iridis","bilateral glaucosis"],"synonyms":["blue iris","green iris"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek γλαύκωσις (glaúkōsis), from γλαυκός (glaukós, \"bluish-green, gray\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɡlɔːˈkoʊsɪs/","syllables":"glau-co-sis"},"inflection":{"noun_plural":"glaucoses"},"usage_notes":{"explanation":"Glaucosis is a very rare term, primarily used in ophthalmology or historical medical contexts. It describes a specific coloration of the iris, distinct from glaucoma.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with glaucosis, which is a type of glaucoma.","correct":"✓ The doctor noted the unusual bluish-green coloration of his iris, a condition known as glaucosis.","note":"Glaucosis is a coloration of the iris, not a form of glaucoma."}],"priority":"★★☆"},"related_words":{"derivatives":["glaucous (adjective: bluish-green or gray in color)","glaucoma (noun: a group of eye diseases that can cause vision loss and blindness)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glaucosis' is a highly specialized term primarily found in medical literature, specifically ophthalmology. It refers to a rare bluish-green coloration of the iris, distinct from the more common eye disease glaucoma. Due to its rarity and specific context, it is unlikely to be encountered outside of professional medical settings."},"example_sentences":[{"sentence":"The historical medical text described the patient's eyes as exhibiting glaucosis.","translation":"その歴史的な医学書は、患者の目が緑内障様の色素沈着を示していると記述していた。","type":"noun","meaning_category":"medical condition"},{"sentence":"The ophthalmologist noted the unusual glaucosis during the eye examination.","translation":"眼科医は眼科検査中に珍しい緑内障様の色素沈着に気づいた。","type":"noun","meaning_category":"medical condition"}]}