{"word":"emulsin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乳化酵素、エマルシン","english_definition":"A mixture of enzymes, present in almonds and other plants, that catalyzes the hydrolysis of amygdalin and similar glycosides.","examples":[{"sentence":"Emulsin is used in the hydrolysis of amygdalin.","translation":"エマルシンはアミグダリンの加水分解に使われる。"}],"collocations":[],"synonyms":["enzyme mixture"],"antonyms":[]}],"etymology":{"value":"Derived from 'emulsion' (referring to the milky appearance of the solution) + '-in' (suffix used for enzymes).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmʌlsɪn/","syllables":"e-mul-sin"},"inflection":{"noun_plural":"emulsins"},"usage_notes":{"explanation":"'Emulsin' is a historical term referring to a mixture of enzymes, especially those found in almonds, capable of hydrolyzing certain glycosides like amygdalin. Modern biochemistry has identified that 'emulsin' is not a single enzyme but a complex mixture of glycosidases, including beta-glucosidase. The term is less commonly used in modern scientific literature, which prefers to specify the individual enzymes involved.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["emulsification","emulsify"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emulsin' is a technical term from biochemistry, specifically referring to a historical enzyme mixture found in almonds. It's not commonly used in everyday language and is more relevant in the context of historical biochemistry or specific enzymatic reactions involving glycosides. Modern texts tend to use more specific enzyme names rather than 'emulsin'."},"example_sentences":[{"sentence":"Historically, **emulsin** was used to study the hydrolysis of amygdalin in almonds.","translation":"歴史的に、**エマルシン**はアーモンド中のアミグダリンの加水分解の研究に使われた。","type":"noun","meaning_category":"enzyme mixture"},{"sentence":"The activity of **emulsin** is due to a combination of different glycosidases.","translation":"**エマルシン**の活性は、異なるグリコシダーゼの組み合わせによるものである。","type":"noun","meaning_category":"enzyme mixture"}]}