{"word":"Marsyas","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ギリシャ神話に登場するサテュロス（半人半獣の森の精）","english_definition":"A satyr in Greek mythology who challenged Apollo to a musical contest and was flayed alive after losing.","examples":[{"sentence":"In the myth, Marsyas found Athena's discarded flute and became skilled at playing it.","translation":"神話では、マルシュアスはアテナが捨てた笛を見つけ、それを巧みに演奏できるようになった。"},{"sentence":"The punishment of Marsyas by Apollo became a popular subject in Renaissance art.","translation":"アポロンによるマルシュアスの罰はルネサンス美術で人気の題材となった。"}],"cultural_context":"マルシュアス神話は古代ギリシャにおいて芸術的才能の危険性や神々への挑戦の愚かさを象徴する物語として知られる。特にアポロン（理性と秩序の神）対マルシュアス（野生と激情の象徴）の対比が強調される。","synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"天文学における小惑星の名称 (小惑星番号 1876)","english_definition":"An asteroid in the Solar System's asteroid belt (designated 1876 Marsyas).","examples":[{"sentence":"Asteroid Marsyas was discovered in 1971 by Dutch astronomer Cornelis van Houten.","translation":"小惑星マルシュアスは1971年にオランダの天文学者コルネリス・ファン・ハウテンによって発見された。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"古代ギリシャ語 Μᾰρσύᾱς (Marsúās) に由来。語源は不明だが、アナトリア（小アジア）起源の可能性が指摘されている。フリギア地方（現在のトルコ中央部）に関連する名前と考えられる。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmɑːrsɪəs/ (英), /ˈmɑːrsiəs/ (米)","syllables":"Mar-syas"},"usage_notes":{"explanation":"「Marsyas」は主に以下の文脈で使用される:\n1. ギリシャ神話において、アポロンに音楽の技量で挑戦し敗れたサテュロスとして言及される場合\n2. 天文学において、1971年に発見されたアポロ群の小惑星を指す場合\n3. 西洋美術史において、マルシュアスの神話を題材とした芸術作品（特にルネサンス期の絵画や彫刻）を論じる文脈\n現代では比喩的に、『過度の自信による破滅』や『芸術的野心の危険性』を象徴する存在として文学・哲学で引用されることがある。","priority":"★★☆"},"cultural_significance":{"description":"マルシュアス神話は西洋文化において重要なモチーフとして繰り返し取り上げられてきた。特に:\n1. ルネサンス期（ティツィアーノ作『マルシュアスの皮剥ぎ』など）\n2. バロック音楽（マルカントワーヌ・シャルパンティエのオペラ『マルシュアスの罰』）\n3. 現代哲学（ジル・ドゥルーズによるマルシュアスの解釈）\nにおいて顕著な影響が見られる。神話の解釈は時代によって変化し、単なる警告譚から、創造的苦悩の象徴へと意味が拡張されてきた。","priority":"★★☆"},"related_terms":[{"term":"Apollo","relation":"音楽の競争相手であり、マルシュアスに罰を与えた神"},{"term":"Athena","relation":"元々笛を発明したが、演奏中に頬が膨らむのを嘲笑され捨てた女神"},{"term":"Satyr","relation":"マルシュアスの種族（半人半獣の森の精）"},{"term":"Aulos","relation":"マルシュアスが演奏した古代ギリシャの笛（ダブルリード楽器）"},{"term":"Flaying","relation":"マルシュアスが受けた皮剥ぎの刑"}],"level_frequency":{"CEFR":"C2 (専門的な文化/神話用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的文脈以外では稀","priority":"★☆☆"},"example_sentences":[{"sentence":"The myth of Marsyas serves as a cautionary tale about hubris against the gods.","translation":"マルシュアスの神話は、神々に対する過信に対する戒めの物語として機能する。","type":"mythology context"},{"sentence":"Titian's 'The Flaying of Marsyas' vividly depicts the satyr's gruesome punishment.","translation":"ティツィアーノの『マルシュアスの皮剥ぎ』は、サテュロスのおぞましい刑罰を生々しく描いている。","type":"art history context"},{"sentence":"Asteroid 1876 Marsyas is classified as a near-Earth object of the Apollo group.","translation":"小惑星1876マルシュアスはアポロ群の地球近傍天体に分類される。","type":"astronomy context"}]}