{"word":"nonvexatious","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)訴訟を起こす権利の濫用をしない、嫌がらせ目的でない","english_definition":"(law) not involving the abuse of the right to bring legal proceedings, not intended to harass or annoy.","examples":[{"sentence":"The court determined that the plaintiff's claim was nonvexatious and had merit.","translation":"裁判所は、原告の訴えは訴訟を起こす権利の濫用ではなく、正当な理由があると判断した。"},{"sentence":"The defendant argued that the lawsuit was vexatious, but the judge ruled it was nonvexatious.","translation":"被告は訴訟が嫌がらせ目的であると主張したが、裁判官はそうではないと判断した。"}],"collocations":["nonvexatious claim","nonvexatious lawsuit","nonvexatious litigation"],"synonyms":["non-harassing","non-abusive","legitimate","justified"],"antonyms":["vexatious","harassing","abusive","frivolous"]}],"etymology":{"value":"「non-」（否定）+ 「vexatious」（いらいらさせる、悩ませる）","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnvekˈseɪʃəs/","syllables":"non-vex-a-tious"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**nonvexatious**」は、主に法律用語として用いられ、訴訟や訴えが嫌がらせや権利の濫用を目的としていないことを意味します。裁判所が訴えを「nonvexatious」と判断した場合、その訴えは正当な根拠に基づいていると認められます。日常会話ではほとんど使用されず、法律関連の文書や議論で用いられる専門用語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The customer's complaint was nonvexatious, so we ignored it.","correct":"✓ The customer's complaint was vexatious, so we ignored it. / ✓ The customer's complaint was nonvexatious, so we investigated it.","note":"「nonvexatious」な訴えは正当な根拠があるため、無視する理由にはなりません。嫌がらせ目的の訴え（vexatious）であれば無視する、または正当な訴え（nonvexatious）であれば調査するという文脈が適切です。"},{"incorrect":"✗ He filed a nonvexatious lawsuit just to annoy his neighbor.","correct":"✓ He filed a vexatious lawsuit just to annoy his neighbor.","note":"嫌がらせ目的で訴訟を起こす場合は「vexatious lawsuit」が適切です。「nonvexatious lawsuit」は、嫌がらせ目的ではない正当な訴訟を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["vexatious (形容詞: いらいらさせる、悩ませる、嫌がらせの)","vexatiously (副詞: いらいらさせるように、悩ませるように)","vexation (名詞: いらだち、悩み、苦悩)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (法律・専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 法律文書や専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**nonvexatious**」は、法律の分野で使われる専門的な単語です。訴訟や訴えが、相手を困らせたり、嫌がらせたりする目的ではなく、正当な理由に基づいて行われていることを意味します。日常会話ではほとんど使われず、法律関係の文書や議論で目にすることがあります。法律を専門とする人や、訴訟に関わる人が理解しておくべき単語です。"},"example_sentences":[{"sentence":"The judge dismissed the case, finding it to be without merit and therefore nonvexatious.","translation":"裁判官は、その訴えに正当な理由がないと判断し、訴訟を起こす権利の濫用ではないとして訴えを退けた。","type":"adjective","meaning_category":"訴訟を起こす権利の濫用をしない"},{"sentence":"The lawyer argued that the claim was nonvexatious and based on solid evidence.","translation":"弁護士は、その訴えは嫌がらせ目的ではなく、確固たる証拠に基づいていると主張した。","type":"adjective","meaning_category":"嫌がらせ目的でない"}]}