{"word":"Earth-gravity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"地球の重力、地球重力","english_definition":"The gravitational force exerted by the Earth, typically experienced at the Earth's surface.","examples":[{"sentence":"The experiment was conducted under Earth-gravity conditions.","translation":"その実験は地球重力条件下で行われた。"},{"sentence":"Simulating Earth-gravity in space is a challenge for long-duration missions.","translation":"宇宙空間で地球重力を再現することは、長期ミッションにおける課題である。"}],"collocations":["under Earth-gravity","simulate Earth-gravity","experience Earth-gravity","Earth-gravity conditions"],"synonyms":["terrestrial gravity","standard gravity"],"antonyms":["microgravity","zero gravity"]},{"part_of_speech":"adjective","definition":"地球重力下の、地球重力による","english_definition":"Relating to or characterized by the gravitational force of the Earth.","examples":[{"sentence":"Earth-gravity experiments are crucial for understanding human physiology.","translation":"地球重力下での実験は、人間の生理機能を理解する上で重要である。"},{"sentence":"The Earth-gravity environment affects plant growth differently than space.","translation":"地球重力環境は、宇宙とは異なり、植物の成長に影響を与える。"}],"collocations":["Earth-gravity environment","Earth-gravity experiments","Earth-gravity effects"],"synonyms":["terrestrial gravitational","standard gravitational"],"antonyms":["microgravitational","zero-g"]}],"etymology":{"value":"Combination of \"Earth\" (the planet) and \"gravity\" (the force of attraction between objects with mass).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɜːrθ ˈɡrævɪti/","syllables":"Earth-grav-i-ty"},"inflection":{"noun_plural":"Earth-gravities (rarely used)"},"usage_notes":{"explanation":"\"Earth-gravity\" refers specifically to the gravitational force experienced on Earth, distinguishing it from the gravity of other celestial bodies or from conditions of reduced gravity (microgravity) or artificial gravity. It is often used in scientific and engineering contexts, particularly in discussions of space travel, biology, and physics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The gravity of Earth is different than Earth-gravity.","correct":"✓ The gravity of Earth is the same as Earth-gravity.","note":"\"Earth-gravity\" is a specific term for the gravity experienced on Earth; it's not different from the Earth's gravity itself."},{"incorrect":"✗ We need to create Earth gravity on Mars.","correct":"✓ We need to create Earth-gravity on Mars.","note":"Using the hyphenated form \"Earth-gravity\" emphasizes that it is specifically the gravity level found on Earth that is being referred to."}],"priority":"★★☆"},"related_words":{"derivatives":["Earth (noun)","gravity (noun)","gravitational (adjective)","microgravity (noun)","artificial gravity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Earth-gravity\" is a technical term used to describe the gravitational force experienced on the surface of the Earth. It is often used in scientific and engineering contexts, especially when comparing conditions on Earth to those in space or on other planets. Understanding this term requires a basic knowledge of physics and gravitational forces. It is not commonly used in everyday conversation. The hyphenated form emphasizes that it is specifically the gravity level found on Earth that is being referred to."},"example_sentences":[{"sentence":"The effects of long-term exposure to reduced gravity can be studied using Earth-gravity as a control.","translation":"低重力への長期暴露の影響は、地球重力を対照として用いて研究することができる。","type":"noun","meaning_category":"地球の重力"},{"sentence":"The Earth-gravity environment is essential for the proper development of many biological systems.","translation":"地球重力環境は、多くの生物学的システムの適切な発達に不可欠である。","type":"adjective","meaning_category":"地球重力下の"}]}