{"word":"nitrogen-purged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"窒素パージされた、窒素置換された","english_definition":"Having had air or other gases replaced with nitrogen.","examples":[{"sentence":"The equipment was nitrogen-purged to prevent oxidation.","translation":"酸化を防ぐために、その装置は窒素パージされた。"},{"sentence":"Nitrogen-purged packaging helps extend the shelf life of the product.","translation":"窒素パージされた包装は、製品の保存期間を延ばすのに役立ちます。"}],"collocations":["nitrogen-purged system","nitrogen-purged container","nitrogen-purged environment"],"synonyms":["nitrogen-filled","nitrogen-blanketed"],"antonyms":["air-filled","oxygenated"]}],"etymology":{"value":"The term is derived from the process of 'purging' (removing unwanted substances) using nitrogen gas. Nitrogen is used because it is an inert gas, meaning it doesn't readily react with other substances, making it suitable for preventing oxidation or other undesirable reactions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪtrədʒən pɜːrdʒd/","syllables":"ni-tro-gen purged"},"inflection":{"notes":"This is an adjective, so it does not inflect."},"usage_notes":{"explanation":"'Nitrogen-purged' describes something that has undergone a process where nitrogen gas is used to displace other gases, typically air or oxygen. This is done to create an inert environment, often to prevent oxidation, contamination, or other unwanted reactions. It's commonly used in industries like food packaging, pharmaceuticals, and electronics manufacturing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nitrogen-purged the tank.","correct":"✓ The tank was nitrogen-purged.","note":"'Nitrogen-purged' is an adjective describing the state of something, not a verb. Use it to describe the object that has undergone the process, not as the action itself."}],"priority":"★★☆"},"related_words":{"derivatives":["purge (verb, noun)","nitrogen (noun)","purging (noun)"],"phrasal_verbs":[],"related_terms":["inert gas","oxidation","contamination","controlled atmosphere","modified atmosphere packaging (MAP)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nitrogen-purged' is a technical term used to describe a process where nitrogen gas is used to remove other gases, usually to prevent unwanted reactions like oxidation. This term is typically encountered in scientific or industrial contexts. Understanding the term requires knowledge of basic chemistry and industrial processes."},"example_sentences":[{"sentence":"The sensitive electronic components were stored in a nitrogen-purged cabinet.","translation":"その敏感な電子部品は、窒素パージされたキャビネットに保管されていた。","type":"adjective","meaning_category":"description"},{"sentence":"The wine bottles were nitrogen-purged before sealing to prevent oxidation.","translation":"酸化を防ぐために、ワインボトルは密閉する前に窒素パージされた。","type":"adjective","meaning_category":"process"}]}