{"word":"pretypographical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"活版印刷以前の、印刷技術が発達する前の","english_definition":"Relating to the period before the invention or widespread use of typography (printing with movable type).","examples":[{"sentence":"The pretypographical era relied heavily on hand-copied manuscripts.","translation":"活版印刷以前の時代は、手書きの写本に大きく依存していた。"},{"sentence":"Pretypographical texts often featured unique artistic embellishments.","translation":"活版印刷以前のテキストには、独特の芸術的な装飾が施されていることが多かった。"}],"collocations":["pretypographical manuscript","pretypographical society","pretypographical culture","pretypographical art"],"synonyms":["pre-printing","pre-press","manuscript-era"],"antonyms":["typographical","post-typographical","printed"]},{"part_of_speech":"adjective","definition":"印刷技術が発達する前の特徴を持つ","english_definition":"Exhibiting characteristics of the period before the invention or widespread use of typography.","examples":[{"sentence":"The document's layout has a pretypographical feel to it.","translation":"その文書のレイアウトは、活版印刷以前の雰囲気がある。"},{"sentence":"The font choice evokes a pretypographical aesthetic.","translation":"そのフォントの選択は、活版印刷以前の美学を呼び起こす。"}],"collocations":["pretypographical layout","pretypographical design","pretypographical style"],"synonyms":["archaic","old-fashioned","historical"],"antonyms":["modern","contemporary","digital"]}],"etymology":{"value":"Derived from the prefix \"pre-\" (before) + \"typographical\" (relating to typography). Typography comes from the Greek words \"typos\" (impression, figure) and \"graphia\" (writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˌtaɪpəˈɡræfɪkəl/","syllables":"pre-ty-po-graph-i-cal"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more pretypographical' and 'most pretypographical' respectively."},"usage_notes":{"explanation":"\"Pretypographical\" is used to describe things that existed or occurred before the invention and widespread adoption of typography, which is the printing of text using movable type. It is often used in historical or academic contexts when discussing manuscripts, books, or other forms of communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pretypographical books were easier to read.","correct":"✓ The pretypographical books were more difficult to read.","note":"Hand-copied manuscripts from the pretypographical era were generally more difficult to read due to variations in handwriting and lack of standardization."},{"incorrect":"✗ Pretypographical art is always black and white.","correct":"✓ Pretypographical art often used vibrant colors in illuminated manuscripts.","note":"Illuminated manuscripts, a common form of pretypographical art, often featured vibrant colors and intricate designs."}],"priority":"★★☆"},"related_words":{"derivatives":["pretypography"],"related_terms":["typography","manuscript","illuminated manuscript","codex","incunabula"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pretypographical\" describes anything related to the time before printing with movable type became common. This means it refers to the era when books and documents were primarily handwritten. The word is often used in academic or historical discussions about the development of writing and printing technologies."},"example_sentences":[{"sentence":"Scholars study pretypographical manuscripts to understand the history of writing.","translation":"学者は、筆記の歴史を理解するために、活版印刷以前の写本を研究する。","type":"general","meaning_category":"活版印刷以前の"},{"sentence":"The art of calligraphy flourished in pretypographical societies.","translation":"書道の芸術は、活版印刷以前の社会で栄えた。","type":"general","meaning_category":"活版印刷以前の"}]}