{"word":"smudgily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ぼやけて、汚れて、にじんで、不鮮明に","english_definition":"in a smudged manner; in a way that is blurred, smeared, or dirty.","examples":[{"sentence":"The ink was written smudgily across the page.","translation":"インクはページ全体にぼやけて書かれていた。"},{"sentence":"The drawing was smudgily rendered, making it hard to see the details.","translation":"その絵はぼやけて描かれていたので、細部を見るのが難しかった。"},{"sentence":"The fingerprints were smudgily left on the glass.","translation":"指紋がガラスに汚れて残っていた。"}],"collocations":["written smudgily","rendered smudgily","left smudgily"],"synonyms":["blurredly","smearedly","dirtily","indistinctly","unclearly"],"antonyms":["clearly","distinctly","cleanly"]}],"etymology":{"value":"「smudgy」に接尾辞「-ly」が付いた形。","priority":"★★★"},"pronunciation":{"ipa":"/ˈsmʌdʒɪli/","syllables":"smud-gi-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Smudgily' describes something done in a way that creates a smudge, meaning a blurred or dirty mark. It often refers to writing, drawing, or prints where the ink or pigment has been smeared.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The picture was smudgily.","correct":"✓ The picture was smudged.","note":"'Smudged' is the past participle of the verb 'smudge' and can be used as an adjective. 'Smudgily' is an adverb and modifies a verb, not a noun."}],"priority":"★★★"},"related_words":{"derivatives":["smudge (noun, verb)","smudgy (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smudgily' is an adverb that describes how something is done in a blurred, smeared, or dirty way. It is derived from the adjective 'smudgy,' which means covered in smudges or tending to smudge. This word is not commonly used in everyday conversation but may appear in descriptive writing or technical contexts where the quality of marks or images is being discussed."},"example_sentences":[{"sentence":"The charcoal drawing was shaded smudgily to create a soft effect.","translation":"木炭画は、柔らかい効果を出すためにぼやけて陰影が付けられていた。","type":"general","meaning_category":"manner"},{"sentence":"The old document was stamped smudgily, making the date difficult to read.","translation":"古い書類はスタンプがにじんで押されており、日付が読みにくかった。","type":"general","meaning_category":"manner"}]}