{"word":"unmitred","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"留め継ぎされていない、斜め接ぎされていない","english_definition":"Not joined at an angle; not having a mitre joint.","examples":[{"sentence":"The frame was constructed with unmitred corners, resulting in a less refined appearance.","translation":"そのフレームは留め継ぎされていない角で組み立てられており、洗練されていない外観になった。"},{"sentence":"Unmitred joints are often used in simpler woodworking projects.","translation":"留め継ぎされていない接合部は、より単純な木工プロジェクトでよく使用される。"}],"collocations":["unmitred corner","unmitred joint","unmitred edge"],"synonyms":["square-cut","butt-jointed"],"antonyms":["mitred"],"notes":"Typically used to describe joints in woodworking, metalworking, or other crafts where precise angled joints are possible."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'mitred'. 'Mitred' itself comes from 'mitre', referring to a joint made by beveling each of two parts to be joined, usually at a 45° angle, to form a corner, or a headdress with a pointed shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmaɪtərd/","syllables":"un-mi-tred"},"inflection":{"notes":"Adjective; comparative and superlative forms would be 'more unmitred' and 'most unmitred', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Unmitred' specifically describes a joint or edge that has *not* been cut or joined at an angle to create a clean corner. It implies a straight, often less aesthetically pleasing, connection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmitred joint was stronger than the mitred one.","correct":"✓ The butt joint was stronger than the mitred one.","note":"While an unmitred joint *could* be stronger in some specific cases, it's more accurate to refer to it as a 'butt joint' if you want to emphasize the type of joint rather than just the lack of a mitre."}],"priority":"★★☆"},"related_words":{"derivatives":["mitre (noun, verb)","mitred (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unmitred' is a technical term primarily used in woodworking, metalworking, and related fields. It describes a joint where the edges haven't been cut at an angle to form a precise corner. Understanding this term requires familiarity with basic joinery techniques."},"example_sentences":[{"sentence":"The simple box was constructed with **unmitred** corners for ease of assembly.","translation":"そのシンプルな箱は、組み立てを容易にするために、留め継ぎされていない角で組み立てられた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Using **unmitred** edges can save time and material in certain projects.","translation":"留め継ぎされていないエッジを使用すると、特定のプロジェクトで時間と材料を節約できる。","type":"adjective","meaning_category":"practical"}]}