{"word":"reserve-funded","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(通常、地方自治体やその他の組織について)準備金によって資金が供給される、準備金から資金が拠出される","english_definition":"(typically of a local authority or other organization) having its expenditure met from reserves.","examples":[{"sentence":"The council approved a reserve-funded project to improve local parks.","translation":"市議会は、地元の公園を改善するための準備金によって資金が供給されるプロジェクトを承認した。"},{"sentence":"The organization's reserve-funded initiatives aim to address critical community needs.","translation":"その組織の準備金から資金が拠出されるイニシアチブは、重要なコミュニティのニーズに対処することを目的としている。"}],"collocations":["reserve-funded project","reserve-funded initiative","reserve-funded program"],"synonyms":["funded from reserves","financed by reserves"],"antonyms":["externally funded","grant-funded"]}],"etymology":{"value":"The term is a compound word formed by combining 'reserve' (referring to a financial reserve) and 'funded' (meaning provided with funds).","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈzɜːrv ˈfʌndɪd/","syllables":"re-serve-fund-ed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Reserve-funded' is typically used in the context of government, non-profit, or organizational finance. It indicates that a particular project, program, or expenditure is being paid for using money that has been set aside in a reserve fund for that purpose. This is often seen as a responsible financial practice, as it avoids the need to borrow money or raise taxes/fees to cover the cost.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The project is reserve funded.","correct":"✓ The project is reserve-funded.","note":"The hyphen is important to show that 'reserve' and 'funded' are acting as a single adjective modifying the noun."}],"priority":"N/A"},"related_words":{"derivatives":["reserve fund (準備基金)","funded (資金提供された)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized term used in financial and organizational contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Reserve-funded' is a technical term primarily used in financial and organizational contexts, particularly when discussing how projects or initiatives are financed. It means that the money for the project comes from a specific fund that has been set aside (a reserve fund) for such purposes. Understanding this term requires familiarity with financial management concepts and the way organizations budget and allocate resources."},"example_sentences":[{"sentence":"The city's new community center is a reserve-funded project, ensuring its completion without raising taxes.","translation":"その都市の新しいコミュニティセンターは準備金によって資金が供給されるプロジェクトであり、増税なしで完成を保証する。","type":"adjective","meaning_category":"Financed by reserves"},{"sentence":"The school board approved several reserve-funded initiatives to improve student literacy.","translation":"教育委員会は、生徒の識字能力を向上させるためのいくつかの準備金から資金が拠出されるイニシアチブを承認した。","type":"adjective","meaning_category":"Financed by reserves"}]}