{"word":"atomicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"原子論、原子説","english_definition":"The belief that all things are composed of indivisible and indestructible elements (atoms).","examples":[{"sentence":"Atomicism is a fundamental concept in chemistry and physics.","translation":"原子論は化学と物理学における基本的な概念です。"},{"sentence":"The ancient Greek philosophers Leucippus and Democritus were proponents of atomicism.","translation":"古代ギリシャの哲学者レウキッポスとデモクリトスは原子論の提唱者でした。"}],"collocations":["philosophical atomicism","logical atomicism","historical atomicism"],"synonyms":["atomism","atom theory"],"antonyms":["holism","monism"]}],"etymology":{"value":"From 'atomic' + '-ism'. 'Atomic' comes from Greek 'atomos' (ἄτομος) meaning 'indivisible'.","priority":"★★★"},"pronunciation":{"ipa":"/əˈtɒmɪsɪzəm/","syllables":"a-tom-i-cism"},"inflection":{"noun_plural":"atomicisms"},"usage_notes":{"explanation":"'Atomicism' refers to the philosophical or scientific theory that all things are composed of discrete, indivisible units. It can apply to various fields beyond just physics and chemistry, including philosophy and social theory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He believed in atomism as a political ideology.","correct":"✓ He supported individualism as a political ideology.","note":"'Atomicism' is typically used in scientific or philosophical contexts, not political ones. 'Individualism' might be a more appropriate term for political contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["atomic","atom","atomist"],"related_terms":["Democritus","Leucippus","Dalton","Bohr"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Atomicism' is a term primarily used in philosophy and science to describe the theory that everything is made of fundamental, indivisible particles called atoms. It's a relatively advanced concept, so it's not commonly encountered in everyday language. Understanding requires some familiarity with scientific and philosophical vocabulary."},"example_sentences":[{"sentence":"The concept of atomicism has evolved significantly since its inception in ancient Greece.","translation":"原子論の概念は、古代ギリシャでの発祥以来、大きく進化してきました。","type":"general"},{"sentence":"Logical atomicism, as proposed by Bertrand Russell, sought to analyze complex propositions into their simplest components.","translation":"バートランド・ラッセルによって提唱された論理的原子論は、複雑な命題を最も単純な構成要素に分解しようとしました。","type":"philosophical"},{"sentence":"Modern chemistry is based on the principles of atomicism, with atoms combining to form molecules.","translation":"現代化学は原子論の原理に基づいており、原子が結合して分子を形成します。","type":"scientific"}]}