{"word":"cion","meanings":[{"part_of_speech":"noun","definition":"a detached shoot or twig containing buds from a woody plant, used in grafting.","english_definition":"a shoot or twig taken from a plant and grafted onto another.","examples":[{"sentence":"The gardener carefully selected a cion from the apple tree for grafting.","translation":"庭師は接ぎ木のためにリンゴの木から慎重に穂木を選びました。"},{"sentence":"A healthy cion is essential for successful grafting.","translation":"健全な穂木は接ぎ木の成功に不可欠です。"}],"synonyms":["scion","graft","shoot","twig"],"antonyms":[]}],"etymology":{"value":"From Middle French 'scion', from Old French 'cion', from Frankish '*kīmō' (sprout, shoot), from Proto-Germanic '*kīmō' (seed, sprout).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪən/","syllables":"sci-on"},"inflection":{"noun_plural":"cions"},"usage_notes":{"explanation":"The term 'cion' is primarily used in the context of horticulture and botany, specifically related to grafting. It refers to the part of a plant, usually a shoot or twig, that is joined to the rootstock of another plant. The 'cion' provides the desired characteristics (e.g., fruit type) while the rootstock provides the root system and other beneficial traits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He planted a cion in the ground.","correct":"✓ He grafted a cion onto the rootstock.","note":"A cion is not planted directly into the ground; it is grafted onto a rootstock. Planting a seed or seedling would be more appropriate if planting directly into the ground."}],"priority":"★★☆"},"related_words":{"derivatives":["scion (variant spelling, more common)","graft","grafting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cion' is a technical term used in horticulture, specifically related to grafting plants. It refers to a detached shoot or twig containing buds from a woody plant, which is then joined to the rootstock of another plant. Because it is a specialized term, it is not commonly encountered in general English and is more likely to be found in texts about gardening, botany, or agriculture."},"example_sentences":[{"sentence":"The success of the grafted tree depends on the compatibility between the rootstock and the cion.","translation":"接ぎ木された木の成功は、台木と穂木の相性にかかっています。","type":"noun","meaning_category":"grafting"},{"sentence":"The nurseryman carefully prepared the cion for grafting onto the disease-resistant rootstock.","translation":"苗木屋は、耐病性の台木に接ぎ木するために穂木を慎重に準備しました。","type":"noun","meaning_category":"horticulture"}]}