{"word":"moilingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"骨折って、精を出して、せっせと","english_definition":"In a laborious, diligent, or bustling manner.","examples":[{"sentence":"She worked moilingly in the garden all day.","translation":"彼女は一日中庭で骨折って働いた。"},{"sentence":"The students were moilingly preparing for their exams.","translation":"学生たちは試験に向けてせっせと準備していた。"}],"collocations":["work moilingly","prepare moilingly"],"synonyms":["laboriously","diligently","industriously","busily","assiduously"],"antonyms":["lazily","idly","leisurely"]}],"etymology":{"value":"Derived from the verb 'moil,' meaning to toil or work hard, with the addition of the adverbial suffix '-ingly.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔɪlɪŋli/","syllables":"moil-ing-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Moilingly' describes an action performed with great effort and diligence. It suggests a sense of bustling activity and hard work. The word is relatively uncommon in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He moilingly slept.","correct":"✓ He worked moilingly.","note":"'Moilingly' describes actions involving effort, not passive states like sleeping."}],"priority":"★☆☆"},"related_words":{"derivatives":["moil (verb: to toil or work hard; noun: toil, labor)","moiler (noun: someone who toils or works hard)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Moilingly' is a rare and sophisticated adverb that describes doing something in a very hardworking and diligent way. It is not commonly used in everyday conversation or writing. You are more likely to encounter it in older literature or specialized contexts where precise and evocative language is valued."},"example_sentences":[{"sentence":"The ants were seen traveling moilingly up the hill, each carrying a crumb many times their size.","translation":"アリたちは、自分たちの何倍もの大きさのパンくずをそれぞれ運びながら、丘を骨折って登っていくのが見られた。","type":"adverb","meaning_category":"骨折って"},{"sentence":"The seamstresses worked moilingly into the night to finish the costumes for the play.","translation":"仕立て屋たちは、劇の衣装を仕上げるために、夜遅くまで精を出して働いた。","type":"adverb","meaning_category":"精を出して"}]}