{"word":"three-in-hand","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(馬車の)3頭立て、(ネクタイの)プレーンノット","english_definition":"a team of three horses driven by one person; a simple necktie knot.","examples":[{"sentence":"He drove the three-in-hand with skill.","translation":"彼は熟練した腕前で3頭立ての馬車を操った。"},{"sentence":"The three-in-hand knot is easy to tie.","translation":"プレーンノットは簡単に結べる。"}],"collocations":["drive a three-in-hand (3頭立ての馬車を操る)","tie a three-in-hand knot (プレーンノットを結ぶ)"],"synonyms":["plain knot","simple knot"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(馬車が)3頭立ての","english_definition":"(of a carriage) drawn by three horses.","examples":[{"sentence":"They arrived in a three-in-hand carriage.","translation":"彼らは3頭立ての馬車で到着した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"18th century: from the fact that the driver held three reins in one hand.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθriː ɪn ˈhænd/","syllables":"three-in-hand"},"inflection":{"noun_plural":"three-in-hands"},"usage_notes":{"explanation":"The term \"three-in-hand\" has two distinct meanings. The first refers to a team of three horses driven by a single person, a practice common in the past. The second, and perhaps more common usage today, refers to a simple and versatile necktie knot, also known as a plain knot or a four-in-hand knot (though the latter term is sometimes used more loosely). Context is crucial to understanding which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a four-in-hand, which is more complicated than a three-in-hand.","correct":"✓ He wore a four-in-hand knot, which is more complicated than a three-in-hand knot.","note":"When referring to the necktie knot, it's best to specify \"three-in-hand knot\" or \"four-in-hand knot\" to avoid ambiguity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["four-in-hand (knot)","coachman","reins"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"three-in-hand\" is relatively uncommon. It refers either to a team of three horses driven by one person, or to a simple type of necktie knot. The context usually makes it clear which meaning is intended. The necktie knot meaning is more common today. The etymology comes from the practice of a driver holding three reins in one hand when driving a three-horse team."},"example_sentences":[{"sentence":"The elegant gentleman sported a perfectly tied three-in-hand knot.","translation":"その上品な紳士は完璧に結ばれたプレーンノットのネクタイをしていた。","type":"noun","meaning_category":"ネクタイの結び方"},{"sentence":"Driving a three-in-hand requires considerable skill and coordination.","translation":"3頭立ての馬車を操るには、かなりの技術と調整が必要だ。","type":"noun","meaning_category":"馬車"}]}