{"word":"refusion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再注入、再輸血","english_definition":"The act of infusing or transfusing again. Specifically, the reintroduction of blood or other fluid into the body after it has been withdrawn or collected.","examples":[{"sentence":"The patient underwent refusion of their own blood during the surgery to minimize the need for donor blood.","translation":"患者は手術中に自己血再輸血を受け、ドナー血の必要性を最小限に抑えた。"},{"sentence":"Refusion techniques are used in some medical procedures to conserve a patient's blood volume.","translation":"再注入技術は、患者の血液量を維持するためにいくつかの医療処置で使用される。"}],"collocations":["autologous refusion (自己血再注入)","blood refusion (血液再注入)"],"synonyms":["reinfusion","retransfusion"],"antonyms":[]}],"etymology":{"value":"From re- (again) + fusion (the act of pouring or infusing).","priority":"★★☆"},"pronunciation":{"ipa":"/riˈfjuːʒən/","syllables":"re-fu-sion"},"inflection":{"noun_plural":"refusions"},"usage_notes":{"explanation":"'Refusion' is a relatively uncommon medical term referring to the reintroduction of a fluid, typically blood, back into the body. It is often used in the context of autologous transfusion, where the patient's own blood is collected and then returned to them during or after a procedure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refusion of the metal created a strong bond.","correct":"✓ The fusion of the metals created a strong bond.","note":"'Refusion' refers to re-infusing a fluid. For the joining of metals, use 'fusion'."}],"priority":"★☆☆"},"related_words":{"derivatives":["refuse (verb: to deny, decline)","fusion (noun: the process of joining or blending)","infusion (noun: the introduction of a fluid into a vein)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refusion' is a specialized medical term that describes the process of reintroducing a fluid, typically blood, back into a patient's body. This is often done to conserve blood volume or to minimize the need for donor blood during surgical procedures. The term is not commonly used outside of medical contexts. Understanding the prefix 're-' (again) and the root word 'fusion' (the act of joining or blending) can help in understanding the meaning of 'refusion.'"},"example_sentences":[{"sentence":"During the heart surgery, the surgical team performed a refusion of the patient's own blood to minimize blood loss.","translation":"心臓手術中、手術チームは出血量を最小限に抑えるために、患者自身の血液の再注入を行った。","type":"noun","meaning_category":"再注入"}]}