{"word":"child-woman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的) 大人だが子供っぽい女性、精神的に未熟な女性","english_definition":"(derogatory) An adult woman who behaves in a childish or immature way.","examples":[{"sentence":"Some critics described the character as a child-woman, unable to take responsibility for her actions.","translation":"一部の批評家は、そのキャラクターを自分の行動に責任を持てない子供っぽい女性だと評した。"},{"sentence":"He was attracted to her childlike innocence, but soon realized she was just a child-woman.","translation":"彼は彼女の子供のような無邪気さに惹かれたが、すぐに彼女がただの子供っぽい女性だと気づいた。"}],"collocations":["immature woman","childish adult","woman-child (less common, sometimes used with a different connotation)"],"synonyms":["immature adult","flighty woman","girlish woman (can be positive or negative depending on context)"],"antonyms":["mature woman","responsible adult","woman of substance"]},{"part_of_speech":"noun","definition":"(文学的または芸術的) 子供のような性質を持つ女性、若々しい女性","english_definition":"(literary or artistic) A woman who possesses childlike qualities, such as innocence, naivety, or playfulness; a woman who appears young or youthful. This usage is less common and can be more neutral or even positive depending on context.","examples":[{"sentence":"The artist portrayed her as a child-woman, capturing her youthful beauty and delicate features.","translation":"画家は彼女を子供のような女性として描き、若々しい美しさと繊細な特徴を捉えた。"},{"sentence":"Her child-woman charm captivated audiences.","translation":"彼女の子供のような魅力は観客を魅了した。"}],"collocations":["youthful woman","innocent woman","naive woman","woman with childlike qualities"],"synonyms":["ingénue","nymphet (controversial, use with caution)","young-at-heart woman"],"antonyms":["worldly woman","sophisticated woman"]}],"etymology":{"value":"A compound word formed by combining 'child' and 'woman'. The meaning derives from the juxtaposition of these two terms, highlighting a perceived incongruity between the woman's age and her behavior or character.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃaɪldˌwʊmən/","syllables":"child-wom-an"},"inflection":{"noun_plural":"child-women"},"usage_notes":{"explanation":"The term 'child-woman' is often used in a derogatory way to criticize a woman for being immature, irresponsible, or overly dependent. However, it can also be used in a more neutral or even positive way to describe a woman who possesses childlike qualities such as innocence, naivety, or playfulness. The context in which the term is used is crucial for determining its intended meaning. Due to its potential for negative connotations, it's important to use this term with caution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He described her as a child-woman, which was a compliment.","correct":"✓ He described her as youthful and innocent, which was a compliment.","note":"Calling someone a 'child-woman' is rarely a compliment. It's better to use more specific and positive terms like 'youthful', 'innocent', or 'playful' if you want to express admiration for those qualities."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["woman-child (similar meaning, but can have different connotations)","man-child (male equivalent)","Peter Pan syndrome (related concept)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Child-woman' is a complex term with potentially negative connotations. It's used to describe an adult woman who exhibits childish or immature behavior. However, it can also be used in a more literary or artistic context to describe a woman who possesses childlike qualities such as innocence or naivety. The term is not commonly used and should be used with caution due to its potential for being offensive. It's important to consider the context in which the term is used to determine its intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel explores the complexities of a woman struggling to reconcile her adult responsibilities with her inner child, often portraying her as a child-woman.","translation":"その小説は、大人の責任と内なる子供との調和に苦労する女性の複雑さを探求し、しばしば彼女を子供っぽい女性として描いている。","type":"noun","meaning_category":"Immature adult"},{"sentence":"Some critics found the character's naivety endearing, while others dismissed her as a silly child-woman.","translation":"一部の批評家はそのキャラクターの無邪気さを好意的に感じたが、他の批評家は彼女を愚かな子供っぽい女性として切り捨てた。","type":"noun","meaning_category":"Immature adult"},{"sentence":"The artist's muse was a child-woman, whose innocent gaze inspired his most celebrated works.","translation":"アーティストのミューズは子供のような女性で、その無邪気な視線が彼の最も有名な作品にインスピレーションを与えた。","type":"noun","meaning_category":"Youthful qualities"}]}