{"word":"Fourieristic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"フーリエ主義の、フーリエ主義に関する","english_definition":"Relating to or characteristic of Fourierism, the social and political beliefs of Charles Fourier.","examples":[{"sentence":"The Fourieristic ideals of communal living were popular in some 19th-century American utopian communities.","translation":"共同生活というフーリエ主義の理想は、19世紀のアメリカのユートピアコミュニティで人気があった。"}],"collocations":["Fourieristic society","Fourieristic community","Fourieristic principles"],"synonyms":["utopian","communalistic","socialistic"],"antonyms":["individualistic","capitalistic"]}],"etymology":{"value":"From Charles Fourier (1772-1837), a French utopian socialist, + -istic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʊəriəˈrɪstɪk/","syllables":"Fu-ri-er-is-tic"},"inflection":{"notes":"Adjective, comparative and superlative forms are more Fourieristic, most Fourieristic, though rarely used."},"usage_notes":{"explanation":"'Fourieristic' describes something related to Fourierism, a utopian socialist ideology developed by Charles Fourier. Fourierism advocated for the reorganization of society into self-sufficient communities called phalanxes, based on cooperative principles and the harmonious division of labor. The term is primarily used in historical and academic contexts when discussing 19th-century utopian movements and socialist thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Fourieristic mathematician.","correct":"✓ He was a mathematician known for applying Fourier analysis.","note":"'Fourieristic' refers to the social and political ideas of Charles Fourier, not mathematical analysis. Use 'Fourier analysis' or similar phrasing when discussing the mathematics. Fourier analysis is named after Joseph Fourier, a different person."}],"priority":"★☆☆"},"related_words":{"derivatives":["Fourierism (noun): フーリエ主義","Fourierist (noun): フーリエ主義者"],"phrases":["phalanstery (noun): (フーリエ主義の)共同生活体"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Fourieristic' is a specialized term used in the context of social and political history, specifically referring to the ideas of Charles Fourier and his utopian socialist theories. It is not commonly used in everyday language and is more likely to be encountered in academic or historical texts discussing 19th-century social movements. Understanding the term requires familiarity with Fourier's concept of Fourierism and its emphasis on communal living and social harmony."},"example_sentences":[{"sentence":"The Brook Farm community was inspired by Fourieristic ideals.","translation":"ブルックファームのコミュニティは、フーリエ主義の理想に触発された。","type":"general","meaning_category":"general"},{"sentence":"Many critics viewed Fourieristic schemes as impractical and naive.","translation":"多くの批評家は、フーリエ主義の計画を非現実的でナイーブだと見ていた。","type":"historical","meaning_category":"historical"}]}