{"word":"Firebrats","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of wingless insect in the order Thysanura, closely related to silverfish, known for their preference for warmer temperatures.","english_definition":"A wingless insect of the order Thysanura (also known as Thysanura), closely related to silverfish, that thrives in warm environments.","examples":[{"sentence":"Firebrats are often found in bakeries and near heating appliances.","translation":"シミはパン屋や暖房器具の近くでよく見られます。"}],"collocations":["control firebrats","eliminate firebrats","firebrats infestation"],"synonyms":["silverfish","thysanuran"],"antonyms":[]}],"etymology":{"value":"Derived from \"fire\" referring to their preference for warm environments, and \"brat,\" an archaic term for a child or offspring, used here to denote a small creature.","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈfaɪərˌbræts","syllables":"fire-brats"},"inflection":{"noun_plural":"firebrats"},"usage_notes":{"explanation":"Firebrats are nocturnal insects that feed on carbohydrates and proteins. They are considered pests due to their ability to damage paper, fabric, and other household items.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"firebrats\" refers to a specific type of insect. Understanding this term requires knowledge of entomology or pest control. The word itself is descriptive, combining \"fire\" and \"brats\" to indicate the insect's characteristics and nature."},"example_sentences":[{"sentence":"The exterminator identified the pests as firebrats due to their preference for the boiler room's heat.","translation":"駆除業者は、ボイラー室の熱を好むことから、害虫をシミであると特定しました。","type":"noun","meaning_category":"insect identification"},{"sentence":"Homeowners often struggle to control firebrats infestations in warm climates.","translation":"住宅所有者は、温暖な気候でシミの蔓延を抑えるのに苦労することがよくあります。","type":"noun","meaning_category":"pest control"}]}