{"word":"De-Europeanization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脱ヨーロッパ化：ヨーロッパ的な特徴、価値観、制度、影響力などが失われる、または減少するプロセス。","english_definition":"The process by which European characteristics, values, institutions, or influence are lost or diminished.","examples":[{"sentence":"Some scholars argue that Brexit represents a form of de-Europeanization for the UK.","translation":"一部の学者は、ブレグジットはイギリスにとって脱ヨーロッパ化の一形態であると主張している。"},{"sentence":"The rise of nationalist sentiments can contribute to de-Europeanization within a country.","translation":"ナショナリズムの高まりは、国内における脱ヨーロッパ化に寄与する可能性がある。"},{"sentence":"De-Europeanization can be seen in the rejection of EU laws and regulations.","translation":"脱ヨーロッパ化は、EUの法律や規制の拒否に見られることがある。"}],"collocations":["political de-Europeanization (政治的脱ヨーロッパ化)","economic de-Europeanization (経済的脱ヨーロッパ化)","cultural de-Europeanization (文化的脱ヨーロッパ化)","social de-Europeanization (社会的脱ヨーロッパ化)"],"synonyms":["disintegration","separation","withdrawal","divergence"],"antonyms":["Europeanization","integration","harmonization","convergence"]}],"etymology":{"value":"\"De-\" (否定の接頭辞) + \"Europeanization\" (ヨーロッパ化)","priority":"★★★"},"pronunciation":{"ipa":"/diːˌjʊərəpɪnaɪˈzeɪʃən/","syllables":"De-Eu-ro-pe-an-i-za-tion"},"inflection":{"noun_plural":"De-Europeanizations"},"usage_notes":{"explanation":"\"De-Europeanization\" は、ヨーロッパ統合の逆のプロセスを指す言葉で、政治、経済、文化など、さまざまな分野で使用されます。特に、EUからの離脱や、EUの法律や政策への反対など、ヨーロッパ的な統合から離れる動きを説明する際に用いられます。この言葉は、必ずしも否定的な意味合いを持つわけではなく、特定の状況や視点によっては、肯定的な変化として捉えられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The de-Europeanization is good for all countries.","correct":"✓ De-Europeanization might be good for some countries, but not all.","note":"脱ヨーロッパ化がすべての国にとって良いとは限りません。国や状況によって影響は異なります。"},{"incorrect":"✗ De-Europeanization only affects the economy.","correct":"✓ De-Europeanization can affect various aspects, including politics, economy, and culture.","note":"脱ヨーロッパ化は経済だけでなく、政治や文化など、さまざまな側面に影響を与える可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["De-Europeanize (verb)"],"related_concepts":["Brexit","Euroscepticism","Nationalism","Populism","European integration","European Union"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"De-Europeanization\" is a complex term used in political science and international relations to describe the process of reversing European integration or diminishing European influence. It is often used in academic and policy discussions related to the European Union, nationalism, and global politics. Understanding this term requires a strong grasp of European history, politics, and economics."},"example_sentences":[{"sentence":"The government's policies have led to a gradual de-Europeanization of the country's legal system.","translation":"政府の政策は、国の法制度の段階的な脱ヨーロッパ化につながっている。","type":"general","meaning_category":"脱ヨーロッパ化の例"},{"sentence":"Scholars are studying the potential impacts of de-Europeanization on regional stability.","translation":"学者たちは、脱ヨーロッパ化が地域の安定に与える潜在的な影響を研究している。","type":"academic","meaning_category":"研究における使用例"},{"sentence":"The rise of populist movements has fueled debates about de-Europeanization in several member states.","translation":"ポピュリスト運動の台頭は、いくつかの加盟国で脱ヨーロッパ化に関する議論を活発化させている。","type":"political","meaning_category":"政治的な文脈での使用例"}]}