{"word":"criterion-referenced","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"(テストなどが)基準準拠の、絶対評価の","english_definition":"(of a test or assessment) designed to measure a student's performance against a fixed set of predetermined criteria or learning standards.","examples":[{"sentence":"The exam is criterion-referenced, so students are graded based on how well they meet specific learning objectives.","translation":"その試験は基準準拠なので、学生は特定の学習目標をどれだけ達成しているかに基づいて評価されます。"},{"sentence":"Criterion-referenced assessments provide a clear picture of what a student knows and can do.","translation":"基準準拠評価は、学生が何を知っていて何ができるのかを明確に示します。"},{"sentence":"Unlike norm-referenced tests, criterion-referenced tests do not compare students to each other.","translation":"標準準拠テストとは異なり、基準準拠テストは学生同士を比較しません。"}],"collocations":["criterion-referenced test (基準準拠テスト)","criterion-referenced assessment (基準準拠評価)","criterion-referenced measurement (基準準拠測定)","criterion-referenced grading (基準準拠の成績評価)","criterion-referenced interpretation (基準準拠の解釈)"],"synonyms":["standards-based","objective-based","performance-based"],"antonyms":["norm-referenced"]},{"part_of_speech":"adjective","definition":"(教育において)特定の基準や目標に照らして評価される","english_definition":"(in education) evaluated against a specific set of criteria or learning objectives.","examples":[{"sentence":"The curriculum is designed with criterion-referenced goals in mind.","translation":"カリキュラムは、基準準拠の目標を念頭に置いて設計されています。"},{"sentence":"Teachers use criterion-referenced feedback to help students improve their skills.","translation":"教師は、基準準拠のフィードバックを使用して、生徒がスキルを向上させるのを支援します。"}],"collocations":["criterion-referenced goals (基準準拠の目標)","criterion-referenced feedback (基準準拠のフィードバック)","criterion-referenced instruction (基準準拠の指導)","criterion-referenced learning (基準準拠の学習)"],"synonyms":["standards-aligned","objective-driven","performance-focused"],"antonyms":[]}],"etymology":{"value":"The term 'criterion-referenced' is derived from the combination of 'criterion' (a standard by which something is judged) and 'referenced' (related to or based on). It indicates that the assessment is specifically linked to predetermined criteria.","priority":"★★☆"},"pronunciation":{"ipa":"/kraɪˈtɪəriən ˈrɛfərənsd/","syllables":"cri-te-ri-on ref-er-enced"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"'Criterion-referenced' is primarily used in the context of education and assessment. It describes a method of evaluating student performance based on a predefined set of standards or criteria. The focus is on whether students have mastered specific skills or content, rather than comparing them to their peers. This type of assessment is often used to determine whether students are ready to move on to the next level of learning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The test is criterion-referencing.","correct":"✓ The test is criterion-referenced.","note":"The correct term is 'criterion-referenced,' not 'criterion-referencing.'"},{"incorrect":"✗ Criterion-referenced tests compare students to each other.","correct":"✓ Criterion-referenced tests measure students against a set of standards.","note":"Criterion-referenced tests focus on individual performance against criteria, not comparison with other students."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["assessment","evaluation","standard","objective","performance","norm-referenced","rubric","learning objective","competency-based assessment"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency compared to more common educational terms.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Criterion-referenced' is a term used in education to describe how a test or assessment is designed. Instead of comparing students to each other, a criterion-referenced test measures how well a student has learned specific skills or knowledge. Think of it like a checklist: the test checks off whether the student has met certain standards. This helps teachers understand what a student knows and where they might need more help.","priority":"★★★"},"example_sentences":[{"sentence":"The state's standardized tests are criterion-referenced, aligning with the curriculum standards.","translation":"州の標準化テストは基準準拠であり、カリキュラム基準に沿っています。","type":"general","meaning_category":"General"},{"sentence":"Teachers use criterion-referenced rubrics to evaluate student projects.","translation":"教師は、基準準拠のルーブリックを使用して学生のプロジェクトを評価します。","type":"education","meaning_category":"Education"},{"sentence":"The training program uses a criterion-referenced approach to ensure all participants meet the required skill level.","translation":"トレーニングプログラムは、すべての参加者が必要なスキルレベルを満たすように、基準準拠のアプローチを使用しています。","type":"training","meaning_category":"Training"}]}