{"word":"gonorrhea","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"淋病","english_definition":"A sexually transmitted disease caused by the bacterium Neisseria gonorrhoeae that can infect the urethra, rectum, or throat. In women, it can also infect the cervix.","examples":[{"sentence":"He was diagnosed with gonorrhea.","translation":"彼は淋病と診断された。"},{"sentence":"Gonorrhea can be treated with antibiotics.","translation":"淋病は抗生物質で治療できる。"},{"sentence":"It is important to get tested for gonorrhea if you are sexually active.","translation":"性的に活動的な場合は、淋病の検査を受けることが重要です。"}],"collocations":["contract gonorrhea (淋病に感染する)","treat gonorrhea (淋病を治療する)","test for gonorrhea (淋病の検査をする)","gonorrhea infection (淋病感染)"],"synonyms":["clap (俗語)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gonos' (seed) and 'rhoia' (flow), reflecting an early and incorrect belief that the discharge associated with the disease was semen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɑːnəˈriːə/","syllables":"gon-or-rhe-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Gonorrhea is a sexually transmitted infection (STI) caused by bacteria. It can affect various parts of the body, including the genitals, rectum, and throat. It's crucial to seek medical attention if you suspect you have gonorrhea, as untreated infections can lead to serious health complications. Safe sexual practices, such as using condoms, can help prevent the spread of gonorrhea.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Gonorrhea is a virus.","correct":"✓ Gonorrhea is a bacterial infection.","note":"Gonorrhea is caused by bacteria, not a virus."},{"incorrect":"✗ You can catch gonorrhea from toilet seats.","correct":"✓ Gonorrhea is typically spread through sexual contact.","note":"Gonorrhea is primarily transmitted through sexual contact."}],"priority":"★★☆"},"related_words":{"derivatives":["gonorrheal (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低い (Relatively low frequency) - 医学・健康関連の文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**gonorrhea**」は、性感染症（STI）の一種である「淋病」を指す医学用語です。淋病は、細菌によって引き起こされ、性行為を通じて感染します。症状としては、排尿時の痛みや異常な分泌物などが挙げられます。放置すると重篤な合併症を引き起こす可能性があるため、早期発見と治療が重要です。性感染症予防のため、コンドームの使用や定期的な検査が推奨されます。","note":"This explanation is for informational purposes only and does not constitute medical advice. Consult a healthcare professional for diagnosis and treatment."},"example_sentences":[{"sentence":"Regular screening can help detect gonorrhea early.","translation":"定期的な検査は淋病の早期発見に役立ちます。","type":"general","meaning_category":"検査と診断"},{"sentence":"The doctor prescribed antibiotics to treat the gonorrhea infection.","translation":"医師は淋病感染を治療するために抗生物質を処方した。","type":"treatment","meaning_category":"治療"},{"sentence":"Using condoms can reduce the risk of contracting gonorrhea.","translation":"コンドームを使用することで、淋病に感染するリスクを減らすことができます。","type":"prevention","meaning_category":"予防"}]}