{"word":"equitativamente","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"公平に、平等に、公正に","english_definition":"fairly, equally, justly","examples":[{"sentence":"Los recursos deben distribuirse equitativamente entre todos los ciudadanos.","translation":"資源はすべての市民に公平に分配されるべきです。"},{"sentence":"El juez decidió dividir los bienes equitativamente entre los herederos.","translation":"裁判官は相続人たちの間で財産を公平に分割することを決定しました。"},{"sentence":"Es importante tratar a todos los empleados equitativamente.","translation":"すべての従業員を公平に扱うことが重要です。"}],"collocations":["distribuir equitativamente (公平に分配する)","dividir equitativamente (公平に分割する)","tratar equitativamente (公平に扱う)"],"synonyms":["justamente","imparcialmente","igualitariamente","proporcionadamente"],"antonyms":["injustamente","parcialmente","desigualmente"]}],"etymology":{"value":"Del latín 'aequitas', que significa 'igualdad, justicia'.","priority":"N/A"},"pronunciation":{"ipa":"ekitatiβamente","syllables":"e-qui-ta-ti-va-men-te"},"inflection":{"notes":"Adverbio, no tiene flexión de género o número."},"usage_notes":{"explanation":"'Equitativamente' se usa para indicar que algo se hace con equidad, es decir, respetando la igualdad de oportunidades y tratando a todos de manera justa, teniendo en cuenta sus circunstancias individuales. Se diferencia de 'igualmente' en que 'igualmente' implica una distribución idéntica, mientras que 'equitativamente' implica una distribución justa que puede no ser idéntica.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"*distribuir igualmente cuando se requiere equidad","correct":"distribuir equitativamente","note":"'Igualmente' implica una distribución idéntica, mientras que 'equitativamente' considera las necesidades individuales."}],"priority":"N/A"},"related_words":{"derivatives":["equidad (justicia, imparcialidad)","equitativo (justo, imparcial)"],"phrases":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Baja","priority":"N/A"},"readability_explanation":{"level":"C1","text":"La palabra 'equitativamente' se usa para describir una acción que se realiza de manera justa y proporcional, teniendo en cuenta las necesidades y circunstancias individuales. Es un término más formal que 'justamente' o 'imparcialmente', y se usa comúnmente en contextos legales, económicos y sociales para describir la distribución de recursos o el tratamiento de personas.","priority":"N/A"},"example_sentences":[{"sentence":"La herencia fue repartida equitativamente entre los hijos, considerando las necesidades de cada uno.","translation":"The inheritance was divided equitably among the children, considering the needs of each one.","type":"adverb","meaning_category":"fairly"},{"sentence":"El programa de becas busca apoyar equitativamente a estudiantes de diversos orígenes socioeconómicos.","translation":"The scholarship program seeks to support students from diverse socioeconomic backgrounds equitably.","type":"adverb","meaning_category":"justly"},{"sentence":"Es fundamental que todos los ciudadanos tengan acceso equitativamente a los servicios de salud.","translation":"It is essential that all citizens have equitable access to health services.","type":"adverb","meaning_category":"fairly"}]}