{"word":"national-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"国家を基盤とする、国家に基づいた","english_definition":"Organized, supported, or primarily operating within the boundaries of a single nation.","examples":[{"sentence":"The organization is national-based, focusing solely on issues within the country.","translation":"その組織は国家を基盤としており、国内の問題のみに焦点を当てています。"},{"sentence":"A national-based economy can be vulnerable to global market fluctuations.","translation":"国家に基づいた経済は、世界市場の変動に脆弱である可能性があります。"},{"sentence":"They promote national-based solutions to environmental problems.","translation":"彼らは環境問題に対する国家に基づいた解決策を推進しています。"}],"collocations":["national-based organization","national-based economy","national-based policy","national-based approach","national-based company","national-based identity"],"synonyms":["domestic","localized","country-specific","in-country","nationwide"],"antonyms":["international","global","multinational","transnational"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'national' (relating to a nation) with 'based' (having a foundation or origin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnæʃənəlˌbeɪst/","syllables":"na-tion-al-based"},"inflection":{"notes":"Adjectives do not typically inflect in English, so there are no different forms. It can be used to modify nouns in various contexts."},"usage_notes":{"explanation":"'National-based' is used to describe entities, organizations, systems, or approaches that are primarily rooted in or operate within a specific nation. It implies a focus on domestic concerns, policies, or markets rather than international or global ones. It is often used in contrast to 'international' or 'global' to highlight the scope of operations or influence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is national based in several countries.","correct":"✓ The company has national bases in several countries.","note":"'National-based' describes the nature of something, not the location of its bases. Use 'national bases' to indicate locations within countries."},{"incorrect":"✗ They are national-based people.","correct":"✓ They are nationals. / ✓ They are national citizens.","note":"'National-based' is not used to describe people. Use 'nationals' or 'national citizens' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["nationalism (名詞: 国家主義)","nationalist (名詞: 国家主義者)","nationalize (動詞: 国有化する)","nation (名詞: 国家)","nationally (副詞: 全国的に)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'National-based' means something is primarily focused on or operating within a single country. It's used to describe organizations, economies, or policies that are not international or global in scope. You might see it used when comparing domestic strategies to international ones."},"example_sentences":[{"sentence":"The research project has a national-based focus, studying the effects of the policy within the country.","translation":"その研究プロジェクトは国家を基盤とした焦点を持っており、国内での政策の影響を研究しています。","type":"adjective","meaning_category":"国家を基盤とする"},{"sentence":"Many small businesses are national-based and do not engage in international trade.","translation":"多くの中小企業は国家を基盤としており、国際貿易には関与していません。","type":"adjective","meaning_category":"国家に基づいた"},{"sentence":"The national-based curriculum is designed to promote local culture and values.","translation":"国家に基づいたカリキュラムは、地元の文化と価値観を促進するように設計されています。","type":"adjective","meaning_category":"国家に基づいた"}]}