{"word":"poorhouse","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"救貧院、貧民収容所","english_definition":"(historical) A place where very poor people could live and be given food and basic care.","examples":[{"sentence":"In the 19th century, many impoverished people ended up in the poorhouse.","translation":"19世紀には、多くの貧困者が救貧院にたどり着いた。"},{"sentence":"The threat of the poorhouse was a powerful incentive to find work.","translation":"救貧院に入るという脅威は、仕事を見つけるための強力な動機となった。"},{"sentence":"The conditions in the poorhouse were often harsh and overcrowded.","translation":"救貧院の状況はしばしば過酷で、過密状態だった。"}],"collocations":["end up in the poorhouse","go to the poorhouse","live in the poorhouse","the threat of the poorhouse"],"synonyms":["workhouse","almshouse","pauper house"],"antonyms":["wealth","affluence","prosperity"]}],"etymology":{"value":"'Poor' + 'house'.  Reflects the historical practice of housing impoverished individuals in a dedicated institution.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊərhaʊs/","syllables":"poor-house"},"inflection":{"noun_plural":"poorhouses"},"usage_notes":{"explanation":"The term 'poorhouse' is largely historical and refers to institutions that existed primarily in the 19th and early 20th centuries to provide basic care for the extremely poor. These institutions were often associated with harsh conditions and social stigma. The term is rarely used in modern contexts, as social welfare systems have evolved significantly. It may be used metaphorically to describe a state of extreme poverty or destitution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He lives in a poorhouse.","correct":"✓ He is living in poverty.","note":"It's more accurate to say someone is living in poverty rather than in a poorhouse, as poorhouses are largely historical. The first suggests a general state of poverty, while the second implies residing in a specific type of institution that is now rare."},{"incorrect":"✗ The poorhouse is a good place to live.","correct":"✓ The poorhouse was often a place of last resort.","note":"Poorhouses were generally not considered desirable places to live due to harsh conditions and social stigma."}],"priority":"★★☆"},"related_words":{"derivatives":["pauper (名詞: 極貧者)","impoverished (形容詞: 貧困な)","destitute (形容詞: 極貧の)"],"idioms_phrases":["go to the poorhouse (破産する、困窮する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists due to its historical context)","frequency_google_ngram":"Low frequency (historical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'poorhouse' refers to a historical institution where very poor people lived and received basic care. It's not commonly used today because these institutions are largely a thing of the past. You might encounter it in historical texts or discussions about social welfare history. The term often carries negative connotations due to the harsh conditions associated with these institutions. It's important to understand the historical context to fully grasp the meaning and implications of the word."},"example_sentences":[{"sentence":"The elderly woman feared ending up in the **poorhouse** after her savings ran out.","translation":"その老女は貯金が底をつき、救貧院に送られることを恐れていた。","type":"noun","meaning_category":"貧困者収容施設"},{"sentence":"The stories of the **poorhouse** painted a grim picture of life for the destitute.","translation":"救貧院の話は、困窮者の生活の暗い実情を描き出した。","type":"noun","meaning_category":"貧困者収容施設"},{"sentence":"The government established the **poorhouse** to provide shelter for the homeless.","translation":"政府はホームレスに住居を提供するために救貧院を設立した。","type":"noun","meaning_category":"貧困者収容施設"}]}