{"word":"non-referential","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"指示対象を持たない、指示的でない、非指示的な","english_definition":"Not having a referent; not referring to a specific object, person, or concept in the real world.","examples":[{"sentence":"The word 'unicorn' is non-referential because unicorns do not exist.","translation":"「ユニコーン」という言葉は、ユニコーンが存在しないため、指示対象を持たない。"},{"sentence":"In some philosophical contexts, logical constants are considered non-referential.","translation":"哲学的な文脈では、論理定数は非指示的であると考えられることがある。"},{"sentence":"The use of non-referential language can sometimes lead to ambiguity.","translation":"非指示的な言葉の使用は、時として曖昧さを生む可能性がある。"}],"collocations":["non-referential expression","non-referential term","non-referential use","non-referential language"],"synonyms":["non-denotational","abstract","intensional"],"antonyms":["referential","denotational","extensional"]}],"etymology":{"value":"Formed from the prefix 'non-' (meaning 'not') and the adjective 'referential' (meaning 'relating to reference').","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌrɛfəˈrɛnʃəl/","syllables":"non-ref-er-en-tial"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are less common with 'non-referential'."},"usage_notes":{"explanation":"'Non-referential' describes something that does not point to or designate a specific entity in the real world. It is often used in linguistics, philosophy, and logic to describe words, phrases, or expressions that do not have a concrete referent. Examples include fictional characters, abstract concepts, or logical operators.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentence is non-referential because it's very long.","correct":"✓ The sentence is non-referential because it uses abstract concepts without specific examples.","note":"Length does not determine whether something is non-referential. It depends on whether the terms used have real-world referents."},{"incorrect":"✗ All nouns are non-referential.","correct":"✓ Some nouns are non-referential, like 'nothingness' or 'infinity'.","note":"Many nouns refer to concrete objects or people, so they are referential. Only nouns that represent abstract or nonexistent entities are non-referential."}],"priority":"★★☆"},"related_words":{"derivatives":["referentiality (noun): The quality or state of being referential.","non-reference (noun): The state of not having a reference."],"related_terms":["reference","referent","denotation","intension","extension"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-referential' is a term used in fields like linguistics and philosophy to describe something that doesn't refer to a specific thing in the real world. Think of words like 'unicorn' or 'justice' – they don't point to a tangible object or person. Understanding this term requires a grasp of abstract concepts and how language relates to reality. It's more common in academic discussions than everyday conversation."},"example_sentences":[{"sentence":"The term 'phlogiston' is now considered non-referential because it doesn't correspond to any real substance.","translation":"「フロギストン」という用語は、現実の物質に対応しないため、現在では指示対象を持たないと考えられている。","type":"adjective","meaning_category":"Linguistics/Philosophy"},{"sentence":"Mathematical symbols, in some interpretations, can be seen as non-referential signs.","translation":"数学記号は、解釈によっては、非指示的な記号と見なすことができる。","type":"adjective","meaning_category":"Mathematics/Logic"},{"sentence":"The poem's power lies in its use of non-referential imagery to evoke emotions.","translation":"その詩の力は、感情を喚起するために非指示的なイメージを使用している点にある。","type":"adjective","meaning_category":"Literature"}]}