{"word":"archdolt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A supreme or principal dolt; a person preeminent in stupidity or foolishness.","english_definition":"A person preeminent in stupidity or foolishness; a supreme dolt.","examples":[{"sentence":"He was such an archdolt that he couldn't even tie his own shoes.","translation":"彼はひどい愚か者で、自分の靴ひもさえ結べなかった。"},{"sentence":"Only an archdolt would make such a ridiculous mistake.","translation":"そんな馬鹿げた間違いをするのは、とんでもない愚か者だけだろう。"}],"collocations":["complete archdolt","utter archdolt","supreme archdolt"],"synonyms":["fool","idiot","moron","imbecile","simpleton","nitwit","blockhead","numbskull"],"antonyms":["genius","intellect","sage","wise person"]}],"etymology":{"value":"Formed from \"arch-\" (meaning chief or principal) and \"dolt\" (a stupid person).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrtʃˈdoʊlt/","syllables":"arch-dolt"},"inflection":{"noun_plural":"archdolts"},"usage_notes":{"explanation":"The term \"archdolt\" is used to emphasize the extreme degree of foolishness or stupidity of a person. It is more emphatic than simply calling someone a \"dolt\". It is not a commonly used word, and may be considered humorous or derogatory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted as an archdolt.","correct":"✓ He is an archdolt.","note":"\"Archdolt\" is a noun, referring to a person. It is not typically used as an adjective or adverb."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["dolt","arch-","foolish","stupid","idiotic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. The word is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"archdolt\" is a rare and somewhat humorous term used to describe someone who is supremely foolish or stupid. It combines the prefix \"arch-\" (meaning chief or principal) with the word \"dolt\" (a stupid person). Because of its rarity, it's more likely to be encountered in literature or specialized contexts rather than everyday conversation. Understanding the components of the word (arch- and dolt) helps in deciphering its meaning. It's generally used for emphasis or comedic effect."},"example_sentences":[{"sentence":"The politician's blunder was so egregious that he was labeled an archdolt by the media.","translation":"その政治家の失態はひどすぎて、メディアからとんでもない愚か者だとレッテルを貼られた。","type":"noun","meaning_category":"foolish person"},{"sentence":"Only an archdolt would attempt to climb that mountain in such dangerous conditions.","translation":"そんな危険な状況でその山に登ろうとするのは、とんでもない愚か者だけだろう。","type":"noun","meaning_category":"foolish person"}]}