{"word":"Unprejudiciable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(law) not capable of being prejudiced or biased; that cannot be prejudged.","english_definition":"(law) Not capable of being prejudiced or biased; that cannot be prejudged; not able to be decided beforehand.","examples":[{"sentence":"The case was presented in an unprejudiciable manner, allowing the jury to form their own opinions.","translation":"その事件は先入観なしに提示され、陪審員が独自の意見を形成することができた。"},{"sentence":"The evidence was considered to be unprejudiciable and therefore admissible in court.","translation":"その証拠は偏見を生まないと判断され、法廷で認められた。"}],"collocations":["unprejudiciable evidence","unprejudiciable manner","unprejudiciable decision"],"synonyms":["impartial","unbiased","objective","fair","equitable"],"antonyms":["prejudicial","biased","subjective","unfair"]}],"etymology":{"value":"Formed from the prefix 'un-' (not), 'prejudiciable' (capable of being prejudged), and the suffix '-able' (capable of). 'Prejudiciable' itself comes from 'prejudice' (preconceived opinion) and '-able'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnprɛdʒʊˈdɪʃəbəl/","syllables":"un-pre-ju-di-cia-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which is uncommon for this word)."},"usage_notes":{"explanation":"'Unprejudiciable' is primarily a legal term, indicating something that should not or cannot be prejudged or decided before all the facts are known. It is often used to describe evidence, proceedings, or arguments that are presented in a way that does not create bias or prejudice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The judge made a prejudiciable decision.","correct":"✓ The judge made a prejudicial decision.","note":"'Prejudicial' (harmful or biased) is often confused with 'unprejudiciable' (not capable of being prejudged)."},{"incorrect":"✗ The information was unprejudiciable to the case.","correct":"✓ The information was relevant to the case.","note":"'Unprejudiciable' describes the nature of something that cannot be prejudged, not its relevance. If information is relevant, use 'relevant' or 'pertinent' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["prejudice (noun, verb)","prejudicial (adjective)","unprejudiced (adjective)"],"phrases":["without prejudice (legal term indicating that rights are reserved)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare and specialized legal vocabulary)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unprejudiciable' is a highly specialized legal term that means something cannot be prejudged or biased. It's used in formal contexts, especially in law, to describe evidence or situations presented without creating bias. Due to its rarity and specific context, it is considered advanced vocabulary."},"example_sentences":[{"sentence":"The lawyer presented the facts in an unprejudiciable way so that the jury could come to a fair conclusion.","translation":"弁護士は、陪審員が公平な結論に達することができるように、先入観なしに事実を提示した。","type":"adjective","meaning_category":"impartial"},{"sentence":"It is important that the evidence remains unprejudiciable until the trial begins.","translation":"裁判が始まるまで、証拠が偏見を生まない状態を保つことが重要である。","type":"adjective","meaning_category":"unbiased"}]}