{"word":"Saprolegnious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ミズカビ属（Saprolegnia）に属する、またはミズカビ属に類似した。","english_definition":"Relating to or resembling Saprolegnia.","examples":[{"sentence":"The fish was infected with a saprolegnious fungus.","translation":"その魚はミズカビ属の真菌に感染していた。"},{"sentence":"Saprolegnious infections are common in freshwater fish.","translation":"ミズカビ属による感染症は淡水魚によく見られる。"}],"collocations":["saprolegnious fungus","saprolegnious infection"],"synonyms":["fungal","mycotic"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Saprolegnia' + '-ous'. Saprolegnia comes from Greek 'sapros' (rotten) + 'legnon' (border, fringe) + '-ia'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsæprəˈlɛɡniəs/","syllables":"Sa-pro-leg-ni-ous"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more saprolegnious, most saprolegnious."},"usage_notes":{"explanation":"'Saprolegnious' is primarily used in scientific or technical contexts, specifically in discussions related to aquatic mycology and fish pathology. It describes something that is related to or resembles the fungus Saprolegnia, which is a common water mold that can cause infections in fish and other aquatic organisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was saprolegnia.","correct":"✓ The water contained Saprolegnia.","note":"'Saprolegnia' is the name of the fungus, while 'saprolegnious' is the adjective describing something related to it."}],"priority":"★★★"},"related_words":{"derivatives":["Saprolegnia (noun): The genus of water molds to which this adjective refers.","Saprolegniaceae (noun): The family of fungi to which Saprolegnia belongs."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Saprolegnious' is a highly specialized term used in biology, particularly in the context of aquatic fungi and fish diseases. It describes something related to or resembling the fungus Saprolegnia, a water mold known for causing infections in fish. The word is not commonly used outside of scientific or technical discussions. Understanding requires knowledge of biology and mycology."},"example_sentences":[{"sentence":"The veterinarian identified a saprolegnious infection on the koi.","translation":"獣医は鯉にミズカビ属による感染症を確認した。","type":"adjective","meaning_category":"Relating to Saprolegnia"},{"sentence":"Microscopic examination revealed the presence of saprolegnious hyphae.","translation":"顕微鏡検査でミズカビ属の菌糸の存在が明らかになった。","type":"adjective","meaning_category":"Relating to Saprolegnia"}]}