{"word":"salloo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインド亜大陸で使用される) ショール、肩掛け","english_definition":"(chiefly Indian subcontinent) a shawl or wrap.","examples":[{"sentence":"She wore a beautiful salloo embroidered with gold thread.","translation":"彼女は金糸で刺繍された美しいショールを身に着けていた。"}],"collocations":["embroidered salloo","silk salloo","woolen salloo"],"synonyms":["shawl","wrap","stole"],"antonyms":[]}],"etymology":{"value":"From Hindi/Urdu 'शालू' (śālū) / 'شالو' (shālū), referring to a type of shawl or wrap, often red in color and used for ceremonial purposes.","priority":"★★☆"},"pronunciation":{"ipa":"/sæˈluː/","syllables":"sal-loo"},"inflection":{"noun_plural":"salloos"},"usage_notes":{"explanation":"The term 'salloo' is primarily used in the Indian subcontinent to refer to a specific type of shawl or wrap. It is often associated with traditional clothing and ceremonial occasions. While 'shawl' or 'wrap' can be used as general terms, 'salloo' carries a cultural connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a salloo for warmth in the winter.","correct":"✓ She wore a shawl for warmth in the winter.","note":"While a salloo can provide warmth, it's more commonly associated with cultural or ceremonial attire. 'Shawl' is a more general term for warmth."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["dupatta","odhni","chador"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specific cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'salloo' is not commonly used in general English. It is a culturally specific term, primarily used in the Indian subcontinent, to refer to a type of shawl or wrap. Understanding its meaning requires familiarity with South Asian culture and textiles."},"example_sentences":[{"sentence":"The bride was adorned with a vibrant red salloo.","translation":"花嫁は鮮やかな赤いショールで飾られていた。","type":"noun","meaning_category":"shawl"},{"sentence":"She draped the salloo over her shoulders as she entered the temple.","translation":"彼女は寺院に入るとき、ショールを肩にかけた。","type":"noun","meaning_category":"shawl"}]}