{"word":"paradidymal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"精巣上体に隣接する、精巣上体に関連する","english_definition":"Relating to or located near the epididymis.","examples":[{"sentence":"The paradidymal tissue showed signs of inflammation.","translation":"精巣上体傍組織に炎症の兆候が見られた。"},{"sentence":"A paradidymal cyst was detected during the examination.","translation":"検査中に精巣上体傍嚢胞が検出された。"}],"collocations":["paradidymal cyst","paradidymal tissue","paradidymal region"],"synonyms":["epididymal","periepididymal"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'para-' (beside, near) and 'epididymis' (the coiled tube in the testicle).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈdɪdɪməl/","syllables":"pa-ra-did-i-mal"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'paradidymal' is specifically used in medical and anatomical contexts to describe structures, conditions, or locations in close proximity to the epididymis. It is often used in discussions of cysts, inflammation, or other abnormalities affecting the male reproductive system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pain was paradidymal the testicle.","correct":"✓ The pain was paradidymal to the testicle. / ✓ The pain was in the paradidymal region.","note":"'Paradidymal' describes a location or tissue. Use 'to' or specify the region. "},{"incorrect":"✗ He had a epididymal cyst. It was paradidymal.","correct":"✓ He had an epididymal cyst. It was paradidymal to the epididymis.","note":"'Paradidymal' needs a reference point, usually the epididymis. It describes proximity."}],"priority":"★★☆"},"related_words":{"derivatives":["epididymis","epididymal"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paradidymal' is a technical term used in medicine, specifically in the fields of urology and anatomy. It refers to the area or structures located near the epididymis, a coiled tube in the testicle responsible for storing and transporting sperm. Understanding this term requires knowledge of basic anatomy and medical terminology. It is unlikely to be encountered in everyday conversation or general reading materials."},"example_sentences":[{"sentence":"The ultrasound revealed a small paradidymal mass.","translation":"超音波検査で小さな精巣上体傍腫瘤が明らかになった。","type":"general","meaning_category":"medical"},{"sentence":"Surgical exploration of the paradidymal region was necessary to determine the nature of the lesion.","translation":"病変の性質を判断するために、精巣上体傍領域の外科的探査が必要であった。","type":"general","meaning_category":"medical"}]}