{"word":"tripersonal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"三位一体の、三つの人格を持つ","english_definition":"Relating to or consisting of three persons, especially relating to the Trinity.","examples":[{"sentence":"The tripersonal God is a central concept in Christian theology.","translation":"三位一体の神はキリスト教神学の中心的な概念です。"},{"sentence":"The doctrine of the tripersonal nature of God.","translation":"神の三位一体性に関する教義。"}],"collocations":["tripersonal God","tripersonal nature","tripersonal deity"],"synonyms":["trinitarian","triune"],"antonyms":["unipersonal","monotheistic"]}],"etymology":{"value":"'Tri-' (three) + 'personal' (relating to a person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtraɪˈpɜːrsənəl/","syllables":"tri-per-son-al"},"inflection":{"notes":"Comparative and superlative forms are not typically used."},"usage_notes":{"explanation":"The term 'tripersonal' is primarily used in theological contexts to describe the nature of God as existing in three distinct persons: the Father, the Son, and the Holy Spirit. It emphasizes the distinctness of these persons while affirming their unity within the Godhead.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tripersonal is a person.","correct":"✓ The tripersonal refers to three persons in one God.","note":"'Tripersonal' describes a concept, not a single person."},{"incorrect":"✗ The tripersonal god has three bodies.","correct":"✓ The tripersonal god has three persons, not three bodies.","note":"In theology, 'person' refers to a distinct individual within the Godhead, not a physical body."}],"priority":"★★☆"},"related_words":{"derivatives":["person","personality","trinity","trinitarianism"],"phrases":["Holy Trinity","Father, Son, and Holy Spirit"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in theological or philosophical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tripersonal' is a technical term primarily used in theology to describe the Christian doctrine of the Trinity. It refers to the belief that God exists as three distinct persons (Father, Son, and Holy Spirit) who are united in one being. Understanding this term requires familiarity with theological concepts and language. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The tripersonal nature of the Godhead is a complex theological concept.","translation":"神性の三位一体の性質は、複雑な神学的概念です。","type":"adjective","meaning_category":"三位一体の"},{"sentence":"Some theological debates center on the interpretation of the tripersonal God.","translation":"一部の神学的議論は、三位一体の神の解釈を中心に展開されます。","type":"adjective","meaning_category":"三つの人格を持つ"}]}