{"word":"whizzingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ヒューンと音を立てて、ブンブンと音を立てて、ものすごい速さで","english_definition":"In a manner characterized by a whizzing sound or rapid movement.","examples":[{"sentence":"The car went whizzingly past.","translation":"車はヒューンと音を立てて通り過ぎた。"},{"sentence":"The blades of the helicopter turned whizzingly.","translation":"ヘリコプターの羽根がブンブンと音を立てて回った。"}],"collocations":["whizzingly fast","whizzingly by"],"synonyms":["speedily","rapidly","swiftly","zoomingly","hissingly"],"antonyms":["slowly"]}],"etymology":{"value":"The word 'whizzingly' is derived from the verb 'whiz' (to make a rushing or hissing sound, or to move rapidly) with the addition of the suffix '-ing' to form the present participle or gerund, and then the suffix '-ly' to transform it into an adverb. The word 'whiz' itself is likely onomatopoeic, imitating the sound of something moving quickly through the air.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪzɪŋli/","syllables":"whiz-zing-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Whizzingly' is an adverb that describes the manner of an action, specifically one that involves a 'whizzing' sound or very rapid movement. It is relatively uncommon in everyday speech and writing, often used for descriptive or evocative purposes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The whizzingly car.","correct":"✓ The whizzing car.","note":"'Whizzingly' is an adverb and cannot directly modify a noun. Use the adjective 'whizzing' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["whiz (noun, verb)","whizzing (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Whizzingly' is an advanced adverb that is not commonly used. It describes something moving very quickly and making a 'whizzing' sound. It is more often found in descriptive writing than in everyday conversation."},"example_sentences":[{"sentence":"The cyclist sped whizzingly down the hill.","translation":"自転車乗りはヒューンと音を立てて丘を下った。","type":"adverb","meaning_category":"rapid movement with sound"},{"sentence":"The meteor streaked whizzingly across the night sky.","translation":"流れ星が夜空をヒューンと音を立てて横切った。","type":"adverb","meaning_category":"rapid movement with sound"}]}