{"word":"endrin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エンドリン（有機塩素系殺虫剤の一種）","english_definition":"An organochlorine insecticide that was formerly used to control insects on crops. It is a persistent environmental pollutant and is highly toxic to humans and wildlife.","examples":[{"sentence":"Endrin is a highly toxic pesticide.","translation":"エンドリンは非常に有毒な殺虫剤です。"},{"sentence":"The use of endrin has been banned in many countries due to its harmful effects.","translation":"エンドリンの使用は、その有害な影響のために多くの国で禁止されています。"}],"collocations":["endrin contamination","endrin poisoning","ban on endrin"],"synonyms":["pesticide","insecticide","organochlorine"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure and related to other cyclodiene insecticides.","priority":"★★★"},"pronunciation":{"ipa":"ˈɛndrɪn","syllables":"en-drin"},"inflection":{"noun_plural":"endrins"},"usage_notes":{"explanation":"Endrin is a highly toxic and persistent insecticide. Its use is now largely banned or restricted due to its environmental and health impacts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Endrin is safe for use in agriculture.","correct":"✓ Endrin is not safe for use in agriculture and is banned in many countries.","note":"Endrin is highly toxic and its use is restricted or banned."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Endrin is a technical term referring to a specific type of organochlorine insecticide. It is not commonly used in everyday language and is primarily encountered in scientific or regulatory contexts related to environmental science, toxicology, or agriculture. Understanding of this term requires advanced vocabulary and knowledge of these specialized fields."},"example_sentences":[{"sentence":"The soil samples showed traces of endrin.","translation":"土壌サンプルはエンドリンの痕跡を示した。","type":"noun","meaning_category":"insecticide"},{"sentence":"Endrin poisoning can cause severe neurological damage.","translation":"エンドリン中毒は重度の神経学的損傷を引き起こす可能性がある。","type":"noun","meaning_category":"toxicity"}]}