{"word":"sky-measuring","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"天を測るような、非常に高い、または広大な","english_definition":"Extremely tall or vast, as if measuring the sky; reaching or encompassing a great height or distance.","examples":[{"sentence":"The sky-measuring skyscraper dominated the city skyline.","translation":"天を測るような超高層ビルが、都市のスカイラインを支配していた。"},{"sentence":"His ambitions were sky-measuring, with no limit to what he wanted to achieve.","translation":"彼の野望は天を測るほど大きく、達成したいことに限界はなかった。"}],"collocations":["sky-measuring ambition","sky-measuring building","sky-measuring height"],"synonyms":["towering","immense","vast","lofty","soaring","gigantic"],"antonyms":["small","tiny","limited","low"]},{"part_of_speech":"noun","definition":"天体観測、天文学","english_definition":"The act or practice of observing and measuring the sky, especially for astronomical purposes.","examples":[{"sentence":"Sky-measuring was an ancient practice used for navigation and predicting seasons.","translation":"天体観測は、航海や季節の予測のために使われた古代の慣習だった。"},{"sentence":"The observatory was dedicated to sky-measuring and the study of celestial bodies.","translation":"その天文台は、天体観測と天体の研究に捧げられていた。"}],"collocations":["ancient sky-measuring","astronomical sky-measuring","scientific sky-measuring"],"synonyms":["astronomy","celestial observation","star-gazing"],"antonyms":[]}],"etymology":{"value":"This word is a compound formed by combining 'sky' (referring to the atmosphere and outer space visible from Earth) and 'measuring' (the act of determining size, amount, or degree). The combination suggests something that is so large or ambitious that it seems to be attempting to measure the vastness of the sky.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskaɪˌmɛʒərɪŋ/","syllables":"sky-mea-sur-ing"},"inflection":{"notes":"As a compound adjective, it does not typically inflect. The noun form is the gerund of the implied verb phrase, so it doesn't inflect either."},"usage_notes":{"explanation":"'Sky-measuring' is often used metaphorically to describe something of immense scale, ambition, or height. It evokes a sense of grandeur and limitlessness. While it can refer to the literal act of astronomical observation, it is more commonly used in a figurative sense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sky-measuring was done by the ancient Egyptians.","correct":"✓ Sky-measuring was practiced by the ancient Egyptians.","note":"When referring to the practice, use 'practiced' or 'performed' to indicate the action of measuring the sky, rather than using 'was done,' which is less idiomatic."},{"incorrect":"✗ The building is sky measuring.","correct":"✓ The building is sky-measuring.","note":"Hyphenate the compound adjective 'sky-measuring' when it precedes the noun it modifies. Without the hyphen, it reads awkwardly."}],"priority":"★★☆"},"related_words":{"derivatives":["sky","measuring","measure","skyline","astronomical","celestial"],"phrases":["reaching for the sky","the sky's the limit"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sky-measuring' is a relatively uncommon and evocative term, often used in descriptive or literary contexts to convey a sense of vastness or extreme height. It is best suited for advanced English speakers who are comfortable with figurative language and nuanced vocabulary. The term may not be immediately understood by those with a basic or intermediate level of English proficiency."},"example_sentences":[{"sentence":"The architect designed a sky-measuring tower that would become a symbol of the city.","translation":"建築家は、都市の象徴となるような天を測るようなタワーを設計した。","type":"adjective","meaning_category":"Extremely tall"},{"sentence":"Ancient civilizations engaged in sky-measuring to understand the movements of the stars and planets.","translation":"古代文明は、星や惑星の動きを理解するために天体観測を行った。","type":"noun","meaning_category":"Astronomy"},{"sentence":"Her sky-measuring dreams inspired her to pursue a career in astrophysics.","translation":"彼女の天を測るような夢は、彼女に天体物理学のキャリアを追求する気にさせた。","type":"adjective","meaning_category":"Vast ambition"}]}