{"word":"thought-hounded","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人がある考えに)取り憑かれた、悩まされた、考えに追い詰められた","english_definition":"Tormented or persistently bothered by a particular thought or idea.","examples":[{"sentence":"He was a thought-hounded man, unable to escape the memory of the accident.","translation":"彼は事故の記憶から逃れられず、考えに追い詰められた男だった。"},{"sentence":"The author described his protagonist as thought-hounded by guilt.","translation":"その作家は、主人公が罪悪感に取り憑かれていると描写した。"},{"sentence":"She felt thought-hounded by the possibility of failure.","translation":"彼女は失敗の可能性に考えを悩まされた。"}],"collocations":["thought-hounded by guilt (罪悪感に苛まれる)","thought-hounded by memories (記憶に悩まされる)","thought-hounded by fear (恐怖に怯える)","thought-hounded mind (考えに囚われた心)"],"synonyms":["obsessed","preoccupied","haunted","tormented","consumed","plagued"],"antonyms":["carefree","unburdened","untroubled","at peace","serene"]}],"etymology":{"value":"The word is a compound of 'thought' and 'hounded'. 'Thought' refers to the mental activity of thinking, and 'hounded' implies being pursued or harassed relentlessly, as if being chased by hounds. Thus, 'thought-hounded' describes someone relentlessly pursued by their own thoughts.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɔːtˌhaʊndɪd/","syllables":"thought-hound-ed"},"inflection":{"notes":"This is an adjective and does not inflect further."},"usage_notes":{"explanation":"'Thought-hounded' describes a state of mental distress where someone is constantly and negatively affected by a specific thought or idea. It suggests a level of torment and lack of control over one's own thoughts. The word is relatively uncommon and often used in literary or descriptive contexts to convey a character's internal struggle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was thought-hounded of his past.","correct":"✓ He was thought-hounded by his past.","note":"The correct preposition to use with 'thought-hounded' is 'by'."},{"incorrect":"✗ She felt thought-hounding.","correct":"✓ She felt thought-hounded.","note":"'Thought-hounded' is an adjective describing a state. 'Thought-hounding' would imply the act of hounding someone with thoughts, which is not the intended meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["thought (noun, verb)","hound (noun, verb)","haunted (adjective)","tormented (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. The term is relatively rare and more often found in literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thought-hounded' is a relatively uncommon and sophisticated term used to describe someone who is mentally tormented or persistently bothered by a particular thought or idea. It suggests a state of being relentlessly pursued or haunted by one's own thoughts, leading to distress or anxiety. The word is often used in literary or descriptive contexts to convey a character's internal struggle or psychological state. Understanding the word requires a good grasp of vocabulary and an ability to infer meaning from context.","priority":"★☆☆"},"example_sentences":[{"sentence":"The detective was thought-hounded by the unsolved case.","translation":"その刑事は未解決事件に考えを悩まされた。","type":"adjective","meaning_category":"悩まされた"},{"sentence":"His past mistakes left him thought-hounded and unable to move forward.","translation":"過去の過ちは彼を考えに囚われ、前進できなくさせた。","type":"adjective","meaning_category":"取り憑かれた"},{"sentence":"She became thought-hounded by the fear that she had made the wrong decision.","translation":"彼女は間違った決断をしたのではないかという恐怖に考えを悩まされるようになった。","type":"adjective","meaning_category":"考えに追い詰められた"}]}