{"word":"thermetograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"温度記録計、自記温度計","english_definition":"A recording thermometer; a device that automatically records temperature over time.","examples":[{"sentence":"The thermetograph showed a steady increase in temperature throughout the day.","translation":"温度記録計は、一日を通して温度が着実に上昇していることを示した。"},{"sentence":"Thermetographs are used in meteorology to track temperature changes.","translation":"温度記録計は、気象学において温度変化を追跡するために使用される。"}],"collocations":["used in meteorology (気象学で使用される)","record temperature changes (温度変化を記録する)","show a steady increase (着実な増加を示す)"],"synonyms":["recording thermometer","temperature recorder","thermograph"],"antonyms":[]}],"etymology":{"value":"'Thermo-' (heat) + '-graph' (something written or recorded).","priority":"★★★"},"pronunciation":{"ipa":"/θɜːrˈmɛtəˌɡræf/","syllables":"ther-me-to-graph"},"inflection":{"noun_plural":"thermetographs"},"usage_notes":{"explanation":"A thermetograph is a specific type of thermometer that automatically records temperature over a period of time. It's often used in scientific or industrial settings where continuous temperature monitoring is required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a thermometer instead of thermetograph.","correct":"✓ Use a thermetograph for continuous temperature recording.","note":"A thermometer provides a current temperature reading, while a thermetograph provides a historical record of temperature changes."}],"priority":"★★☆"},"related_words":{"derivatives":["thermo- (prefix relating to heat)","-graph (suffix relating to writing or recording)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A thermetograph is a specialized instrument used to record temperature over time. It is primarily used in scientific and industrial contexts where continuous monitoring of temperature is essential. Understanding the term requires a familiarity with scientific vocabulary and the concept of automated data recording."},"example_sentences":[{"sentence":"The scientist analyzed the data from the thermetograph to understand the temperature trends.","translation":"科学者は温度の傾向を理解するために、温度記録計からのデータを分析した。","type":"noun","meaning_category":"温度記録計"},{"sentence":"The thermetograph provided a detailed record of the temperature fluctuations during the experiment.","translation":"温度記録計は、実験中の温度変動の詳細な記録を提供した。","type":"noun","meaning_category":"温度記録計"}]}