{"word":"hairworm","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハリガネムシ","english_definition":"A nematode worm of the class Gordiacea, parasitic in arthropods.","examples":[{"sentence":"The grasshopper was infected with a hairworm.","translation":"そのバッタはハリガネムシに寄生されていた。"},{"sentence":"Hairworms emerge from their hosts near water.","translation":"ハリガネムシは水辺近くで宿主から出てくる。"}],"collocations":["hairworm infection","hairworm parasite"],"synonyms":["Gordian worm","nematomorph"],"antonyms":[]}],"etymology":{"value":"From 'hair' (referring to the worm's thin, hair-like appearance) + 'worm'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɛərwɜːrm/","syllables":"hair-worm"},"inflection":{"noun_plural":"hairworms"},"usage_notes":{"explanation":"'Hairworm' refers specifically to worms of the class Gordiacea, known for their parasitic lifestyle in arthropods like grasshoppers, crickets, and beetles. They are often found in or near water, as the adult worms are free-living in aquatic environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hairworm in my dog's fur.","correct":"✓ I saw a worm in my dog's fur.","note":"Hairworms are parasites of arthropods, not mammals. If you see a worm in a mammal's fur, it's likely a different type of worm."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hairworm' is a specific scientific term for a type of parasitic worm. It is not commonly used in everyday conversation, but may appear in scientific or nature-related contexts. Understanding the term requires some knowledge of biology and parasitism."},"example_sentences":[{"sentence":"The hairworm manipulates its host's behavior to ensure it returns to water.","translation":"ハリガネムシは、宿主が水辺に戻るように行動を操作する。","type":"general","meaning_category":"parasitic worm"},{"sentence":"Scientists are studying the complex life cycle of the hairworm.","translation":"科学者たちはハリガネムシの複雑なライフサイクルを研究している。","type":"scientific","meaning_category":"parasitic worm"}]}