{"word":"foxly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"キツネのように、ずる賢く、油断なく","english_definition":"In a manner resembling a fox; cunningly, slyly, or vigilantly.","examples":[{"sentence":"He foxly avoided answering the difficult questions.","translation":"彼はキツネのようにずる賢く、難しい質問に答えるのを避けた。"},{"sentence":"She foxly watched the situation unfold, waiting for the right moment to act.","translation":"彼女はキツネのように油断なく状況の展開を見守り、行動する適切な瞬間を待った。"}],"collocations":["act foxly","observe foxly","move foxly","smile foxly"],"synonyms":["cunningly","slyly","craftily","warily","astutely","deviously"],"antonyms":["naively","openly","honestly","candidly","artlessly"]}],"etymology":{"value":"The word 'foxly' is derived from the word 'fox' (referring to the animal) with the addition of the suffix '-ly', which is commonly used to form adverbs indicating manner or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɒksli/","syllables":"fox-ly"},"inflection":{"notes":"Since 'foxly' is an adverb, it does not have different inflections like nouns or verbs."},"usage_notes":{"explanation":"'Foxly' is an adverb that describes actions or behaviors that resemble those attributed to foxes, such as cunning, slyness, and watchfulness. It is not a very common word in modern English, and its use can sometimes sound archaic or literary. When using 'foxly', it is important to consider the context and ensure that the intended meaning of cunning or slyness is clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She walked foxly through the forest.","correct":"✓ She walked stealthily/cautiously through the forest.","note":"While 'foxly' implies a cunning or sly manner, if the intention is to describe a quiet or careful movement, 'stealthily' or 'cautiously' might be more appropriate."},{"incorrect":"✗ He foxly gave away his secrets.","correct":"✓ He inadvertently/unintentionally gave away his secrets.","note":"'Foxly' implies cunning or slyness, so it wouldn't be appropriate to use it to describe someone giving away secrets, as that would suggest they did so intentionally and deceptively."}],"priority":"★★☆"},"related_words":{"derivatives":["fox (noun)","foxlike (adjective)","foxy (adjective)"],"phrases":["as sly as a fox","outfox (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Foxly' is an uncommon adverb that means 'in a manner resembling a fox,' typically implying cunning, slyness, or watchfulness. It is not frequently used in contemporary English, and its usage might be perceived as somewhat archaic or literary. Therefore, it's important to ensure the context clearly conveys the intended meaning of cunning or sly behavior when using this word. More common synonyms like 'cunningly' or 'slyly' might be preferred for clarity in modern usage."},"example_sentences":[{"sentence":"The politician foxly dodged the reporter's questions, never giving a straight answer.","translation":"その政治家はキツネのようにずる賢く記者の質問をかわし、決して率直な答えを与えなかった。","type":"adverb","meaning_category":"cunningly"},{"sentence":"The cat foxly stalked its prey, inching closer with each step.","translation":"その猫はキツネのように獲物を待ち伏せし、一歩ごとにゆっくりと近づいた。","type":"adverb","meaning_category":"slyly"},{"sentence":"The security guard foxly surveyed the crowd, looking for any signs of trouble.","translation":"警備員はキツネのように油断なく群衆を見渡し、問題の兆候を探した。","type":"adverb","meaning_category":"vigilantly"}]}