{"word":"market-controlling","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"市場を支配している、市場支配的な","english_definition":"Having a dominant position in a market, able to influence prices and control supply.","examples":[{"sentence":"The company is accused of market-controlling practices.","translation":"その会社は市場を支配する行為で告発されている。"},{"sentence":"They have a market-controlling share of the industry.","translation":"彼らは業界の市場を支配するシェアを持っている。"}],"collocations":["market-controlling company (市場支配的な会社)","market-controlling position (市場を支配する地位)","market-controlling power (市場を支配する力)","market-controlling behavior (市場を支配する行動)","market-controlling practices (市場を支配する慣行)"],"synonyms":["dominant","monopolistic","hegemonic","commanding","leading"],"antonyms":["competitive","minor","insignificant","subordinate"]}],"etymology":{"value":"'Market' + 'controlling'. Combining the noun 'market' referring to a place or system for trade, with the present participle 'controlling' of the verb 'control', indicating the act of dominating or regulating.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːrkɪt kənˈtroʊlɪŋ/","syllables":"mar-ket-con-trol-ling"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Market-controlling' describes an entity (usually a company) that has significant power over a particular market. This power allows them to influence prices, limit competition, and generally dictate the terms of trade. Such dominance is often scrutinized by regulatory bodies to prevent anti-competitive practices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is controlling the market. It's market-control.","correct":"✓ The company is controlling the market. It's market-controlling.","note":"'Market-control' is not a commonly used term. 'Market-controlling' is the correct adjective to describe the act of controlling the market."}],"priority":"★★☆"},"related_words":{"derivatives":["control (noun, verb)","market (noun)","controlling (adjective, gerund)"],"related_terms":["monopoly","oligopoly","market dominance","antitrust","regulation","competition"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'market-controlling' is a specialized term used in economics, business, and law. It describes a situation where a single company or a small group of companies has enough power to control prices, limit competition, and dictate terms in a particular market. Understanding this term requires knowledge of basic economic concepts and business strategy. It is not a common term in everyday conversation."},"example_sentences":[{"sentence":"The government investigated the company for its market-controlling activities.","translation":"政府はその会社の市場を支配する活動を調査した。","type":"adjective","meaning_category":"Market Dominance"},{"sentence":"Their market-controlling strategies led to higher prices for consumers.","translation":"彼らの市場を支配する戦略は、消費者にとってより高い価格につながった。","type":"adjective","meaning_category":"Business Strategy"},{"sentence":"The new regulations aim to prevent market-controlling behavior by large corporations.","translation":"新しい規制は、大企業による市場を支配する行動を防ぐことを目的としている。","type":"adjective","meaning_category":"Regulation"}]}