{"word":"Trialism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) オーストリア＝ハンガリー帝国において、スラヴ人のために第三の構成単位を設けることを提唱する政治運動。特にクロアチアがハンガリー王国から分離し、帝国に加わることを目指した。","english_definition":"(historical) A political movement that aimed to reorganize the Austro-Hungarian Empire by creating a third Croatian or Slavic entity, equal in status to Austria and Hungary. Specifically, it often involved detaching Croatia from the Kingdom of Hungary and uniting it with other Slavic territories within the Empire.","examples":[{"sentence":"Trialism was a significant political idea within the Austro-Hungarian Empire in the late 19th and early 20th centuries.","translation":"トライアリズムは、19世紀後半から20世紀初頭にかけてのオーストリア＝ハンガリー帝国における重要な政治思想であった。"},{"sentence":"The assassination of Archduke Franz Ferdinand, a supporter of trialism, contributed to the outbreak of World War I.","translation":"トライアリズムの支持者であったフランツ・フェルディナンド大公の暗殺は、第一次世界大戦の勃発の一因となった。"}],"collocations":["advocate for trialism (トライアリズムを提唱する)","support trialism (トライアリズムを支持する)","the concept of trialism (トライアリズムの概念)","the failure of trialism (トライアリズムの失敗)"],"synonyms":["federalism","autonomism"],"antonyms":["centralism","unitarism"]}],"etymology":{"value":"The term 'trialism' is derived from 'tri-' (meaning 'three') and '-alism' (referring to a system or principle). It reflects the idea of creating a third, equal entity within the existing dual structure of Austria-Hungary.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtraɪəlɪzəm/","syllables":"Tri-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Trialism refers specifically to the historical movement within the Austro-Hungarian Empire. It is not a general term for any system involving three entities. The movement aimed to address the grievances of Slavic populations within the Empire, who felt marginalized by the existing power structure. The assassination of Archduke Franz Ferdinand, who considered trialism as a possible solution to the empire's internal problems, is often cited as a trigger for World War I.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Trialism is a form of government with three branches.","correct":"✓ Trialism was a movement to create a third Slavic entity within Austria-Hungary.","note":"Trialism is a specific historical movement, not a general term for a government with three branches (which would be more accurately described as a tripartite system or separation of powers)."},{"incorrect":"✗ Trialism is still a relevant political ideology in modern Europe.","correct":"✓ Trialism was a relevant political ideology in the late Austro-Hungarian Empire.","note":"Trialism is largely a historical concept tied to the specific context of the Austro-Hungarian Empire, which dissolved after World War I. It is not a contemporary political ideology."}],"priority":"★★☆"},"related_words":{"derivatives":["trialist (noun: a supporter of trialism)"],"phrasal_verbs":null,"related_concepts":["Austro-Hungarian Empire","Dualism","Slavs","Archduke Franz Ferdinand","World War I","Federalism","Autonomism","Greater Croatia"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - primarily found in historical texts and academic discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trialism' is a specialized term related to the history of the Austro-Hungarian Empire. Understanding it requires knowledge of the Empire's political structure and the aspirations of its Slavic populations. The term is primarily encountered in historical contexts and academic discussions of Central European history. It describes the movement to create a third, equal entity for Slavic peoples within the Empire, alongside Austria and Hungary. Familiarity with related concepts like federalism, autonomism, and the historical figures involved is helpful for comprehending the meaning of 'trialism.'"},"example_sentences":[{"sentence":"The proponents of **trialism** believed it would stabilize the Austro-Hungarian Empire by addressing Slavic grievances.","translation":"トライアリズムの提唱者たちは、それがスラヴ人の不満に対処することでオーストリア＝ハンガリー帝国を安定させると信じていた。","type":"definition","meaning_category":"historical movement"},{"sentence":"The assassination of Archduke Franz Ferdinand, who had considered **trialism**, triggered a chain of events leading to World War I.","translation":"トライアリズムを検討していたフランツ・フェルディナンド大公の暗殺は、第一次世界大戦につながる一連の出来事を引き起こした。","type":"historical event","meaning_category":"historical movement"}]}