{"word":"kochliarion","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A spoon, especially a liturgical spoon used in the Eastern Orthodox Church to distribute Holy Communion.","english_definition":"A liturgical spoon used in the Eastern Orthodox Church to distribute Holy Communion.","examples":[{"sentence":"The priest carefully used the kochliarion to give the sacrament to the communicants.","translation":"司祭は注意深くコクリアリオンを使って聖餐を信徒に分け与えた。"}],"collocations":["liturgical kochliarion","holy kochliarion"],"synonyms":["spoon"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek κοχλιάριον (kochliárion), diminutive of κοχλίας (kochlías, “snail; anything spiral; a screw; a snail-shell spoon”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒkliˈɑːriən/","syllables":"koch-li-ar-i-on"},"inflection":{"noun_plural":"kochliaria"},"usage_notes":{"explanation":"The term 'kochliarion' is primarily used within the context of Eastern Orthodox Christian liturgy. It refers specifically to the small spoon used to administer the Eucharist (Holy Communion), where the consecrated bread and wine are mixed together in the chalice and then spooned into the mouths of the communicants.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'kochliarion' is a specialized term primarily used in the context of Eastern Orthodox Christian liturgy. It refers to the liturgical spoon used to distribute Holy Communion. Due to its specific religious context and etymological origin from Ancient Greek, it is not a commonly encountered word in general English vocabulary."},"example_sentences":[{"sentence":"During the Divine Liturgy, the priest uses the kochliarion to administer the Holy Eucharist.","translation":"聖体礼儀の間、司祭はコクリアリオンを使って聖体を分け与える。","type":"noun","meaning_category":"liturgical spoon"},{"sentence":"The intricate design of the kochliarion reflected the sacredness of the sacrament.","translation":"コクリアリオンの複雑なデザインは、秘蹟の神聖さを反映していた。","type":"noun","meaning_category":"liturgical spoon"}]}