{"word":"bajochi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of small, low-value coin formerly used in Italy.","english_definition":"A small, low-value coin formerly used in Italy, especially in the Papal States.","examples":[{"sentence":"The beggar asked for a few bajochi to buy bread.","translation":"物乞いはパンを買うために数バジョッキを求めた。"},{"sentence":"The price of the goods was only a few bajochi.","translation":"その商品の値段はほんの数バジョッキだった。"}],"collocations":["a few bajochi","worthless bajochi"],"synonyms":["soldo","centesimo"],"antonyms":[]}],"etymology":{"value":"From Italian 'baiocco', a former coin of the Papal States. The origin of 'baiocco' is uncertain, possibly from 'Baja', a town near Rome where it was first minted, or from 'bagattino', a small coin from Bologna.","priority":"★★☆"},"pronunciation":{"ipa":"/baˈjɔki/","syllables":"ba-jo-chi"},"inflection":{"noun_plural":"bajochi"},"usage_notes":{"explanation":"'Bajochi' refers specifically to a historical coin, primarily associated with the Papal States and other regions of Italy. It is rarely used in modern contexts except when discussing historical economics or numismatics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I paid with bajochi at the supermarket.","correct":"✓ I paid with euros at the supermarket.","note":"Bajochi are no longer in circulation; use modern currency terms."}],"priority":"★☆☆"},"related_words":{"derivatives":["baiocco (singular form)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bajochi' is a highly specialized term referring to a historical coin. It is unlikely to be encountered outside of historical or numismatic contexts. Understanding requires familiarity with historical currency.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old man remembered when goods could be bought for just a few bajochi.","translation":"その老人は、ほんの数バジョッキで商品が買えた時代を覚えていた。","type":"noun","meaning_category":"historical currency"}]}