{"word":"Orthoptera","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"直翅目（ちょくし目）の昆虫","english_definition":"An order of insects that includes the grasshoppers, locusts, crickets, and katydids, characterized by having straight, leathery forewings and membranous hindwings, and often large hind legs for jumping.","examples":[{"sentence":"Grasshoppers belong to the order Orthoptera.","translation":"バッタは直翅目に属する。"},{"sentence":"The Orthoptera are known for their jumping ability.","translation":"直翅目は跳躍能力で知られている。"}],"collocations":["Orthoptera species","Orthoptera family","order Orthoptera"],"synonyms":["grasshoppers","crickets","locusts","katydids"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'orthos' meaning 'straight' and 'pteron' meaning 'wing', referring to the straight, leathery forewings characteristic of this insect order.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈθɒptərə/","syllables":"Or-thop-te-ra"},"inflection":{"noun_plural":"Orthopterans / Orthoptera"},"usage_notes":{"explanation":"'Orthoptera' is a scientific term used to classify a specific order of insects. It is often used in biological contexts and may not be commonly used in everyday conversation. When referring to specific insects within this order, it is more common to use their common names, such as 'grasshopper' or 'cricket'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Orthoptera in my garden yesterday.","correct":"✓ I saw an orthopteran in my garden yesterday. / ✓ I saw a grasshopper/cricket in my garden yesterday.","note":"While 'Orthoptera' is the name of the order, when referring to a single insect, it's more common to use 'orthopteran' or the specific insect's name (e.g., grasshopper, cricket)."},{"incorrect":"✗ Orthopteras are insects with straight wings.","correct":"✓ Orthoptera are insects with straight wings.","note":"'Orthoptera' can be used as a plural noun without adding an 's'. Alternatively, 'Orthopterans' is also acceptable."}],"priority":"★★☆"},"related_words":{"derivatives":["orthopteran (noun: an insect belonging to the order Orthoptera)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Orthoptera' is a scientific classification used in biology and entomology. It refers to a specific order of insects characterized by their straight forewings and jumping legs. Understanding this term requires familiarity with scientific nomenclature and basic entomological concepts. It is not typically used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Entomologists study the behavior and ecology of Orthoptera.","translation":"昆虫学者は直翅目の行動と生態を研究している。","type":"general","meaning_category":"scientific"},{"sentence":"Many species of Orthoptera are economically important as agricultural pests.","translation":"多くの直翅目の種は農業害虫として経済的に重要である。","type":"general","meaning_category":"scientific"}]}