{"word":"cosmical","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"宇宙の、宇宙的な","english_definition":"relating to the cosmos or the universe; vast in scale.","examples":[{"sentence":"Cosmical events can have a profound impact on our planet.","translation":"宇宙的な出来事は、私たちの惑星に深刻な影響を与える可能性があります。"},{"sentence":"The telescope allows us to observe cosmical phenomena.","translation":"その望遠鏡は、私たちが宇宙的な現象を観察することを可能にします。"},{"sentence":"He studied the cosmical forces that shape galaxies.","translation":"彼は銀河を形作る宇宙的な力を研究しました。"}],"collocations":["cosmical event (宇宙的な出来事)","cosmical phenomena (宇宙的な現象)","cosmical forces (宇宙的な力)","cosmical scale (宇宙的な規模)","cosmical dust (宇宙塵)"],"synonyms":["universal","celestial","astronomical","galactic","outer space"],"antonyms":["terrestrial","earthly","local"]},{"part_of_speech":"adjective","definition":"(星などが)日の出または日の入りと同時に昇る、または沈む","english_definition":"(of a star) rising or setting at the same time as the sun.","examples":[{"sentence":"The cosmical rising of Sirius marked the start of the Nile's flooding season in ancient Egypt.","translation":"シリウスの宇宙的な出没は、古代エジプトにおけるナイル川の氾濫期の始まりを示しました。"},{"sentence":"The cosmical setting of a particular constellation was used to determine the time of year.","translation":"特定の星座の宇宙的な沈没は、一年のある時期を決定するために使用されました。"}],"collocations":["cosmical rising (宇宙的な出没)","cosmical setting (宇宙的な出没)"],"synonyms":["heliacal","simultaneous"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'kosmikos' (κοσμικός), meaning 'relating to the world or universe', which in turn comes from 'kosmos' (κόσμος) meaning 'order, arrangement, world, universe'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒzmɪkəl/","syllables":"cos-mi-cal"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (more cosmical, most cosmical), which are rarely used for this word."},"usage_notes":{"explanation":"The word 'cosmical' has two main meanings. The first and more common meaning relates to the cosmos or universe, often implying a vast scale or importance. The second, more technical meaning, refers to the simultaneous rising or setting of a star with the sun, particularly in the context of ancient astronomy and calendars. The second meaning is less frequently used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem is cosmical. (when meaning 'very large')","correct":"✓ The problem is cosmic. (more common usage for 'very large' or 'significant')","note":"While 'cosmical' can refer to the universe, 'cosmic' is more commonly used in modern English to describe something vast, significant, or related to the universe in a general sense."}],"priority":"★☆☆"},"related_words":{"derivatives":["cosmic (adjective: relating to the universe or cosmos, extremely large)","cosmos (noun: the universe seen as a well-ordered whole)","cosmology (noun: the science of the origin and development of the universe)","cosmically (adverb: in a way that relates to the cosmos)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"cosmical\" is a relatively uncommon adjective that primarily means \"relating to the cosmos or universe.\" It can also refer to the simultaneous rising or setting of a star with the sun, a more specialized astronomical meaning. Because of its less frequent use and more technical applications, it is typically encountered in advanced texts related to astronomy, cosmology, or philosophy. The more common and accessible synonym is \"cosmic.\""},"example_sentences":[{"sentence":"The cosmical microwave background radiation provides evidence for the Big Bang theory.","translation":"宇宙マイクロ波背景放射は、ビッグバン理論の証拠を提供します。","type":"adjective","meaning_category":"宇宙の"},{"sentence":"Ancient civilizations tracked the cosmical rising of certain stars to predict seasonal changes.","translation":"古代文明は、季節の変化を予測するために、特定の星の宇宙的な出没を追跡しました。","type":"adjective","meaning_category":"(星などが)日の出または日の入りと同時に昇る、または沈む"}]}