{"word":"Hatshepset","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"ハトシェプスト (古代エジプト第18王朝の女王)","english_definition":"Hatshepsut (Fifth pharaoh of the Eighteenth Dynasty of Egypt).","examples":[{"sentence":"Hatshepset was one of the few female pharaohs of ancient Egypt.","translation":"ハトシェプストは古代エジプトの数少ない女性ファラオの一人でした。"},{"sentence":"The mortuary temple of Hatshepset at Deir el-Bahri is a famous architectural masterpiece.","translation":"デル・エル＝バハリにあるハトシェプスト女王の葬祭殿は、有名な建築の傑作です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Egyptian, meaning \"Foremost of Noble Ladies\".","priority":"★★☆"},"pronunciation":{"ipa":"/hætˈʃɛpsʊt/","syllables":"Hat-shep-sut"},"inflection":{},"usage_notes":{"explanation":"Hatshepset was a female pharaoh of the Eighteenth Dynasty of Egypt, who reigned for approximately 20 years (c. 1479–1458 BC). She is considered one of Egypt's most successful pharaohs, reigning longer than any other woman of an indigenous Egyptian dynasty. Her reign was marked by peace, prosperity, and extensive building projects, including her famous mortuary temple at Deir el-Bahri.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_figures":["Thutmose II (ハトシェプストの夫)","Thutmose III (ハトシェプストの義理の息子、共同統治者)"],"related_places":["Deir el-Bahri (ハトシェプストの葬祭殿がある場所)","Karnak (ハトシェプストが多くの建築プロジェクトを行った場所)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的低い (Relatively low) - 歴史、考古学関連の文脈で出現。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hatshepset is a proper noun referring to a specific historical figure, a female pharaoh of ancient Egypt. Understanding the term requires some familiarity with ancient Egyptian history. While the name itself is not complex, the historical context and significance of Hatshepset's reign contribute to a higher readability level."},"example_sentences":[{"sentence":"The reign of Hatshepset was a period of peace and prosperity for Egypt.","translation":"ハトシェプストの治世は、エジプトにとって平和と繁栄の時代でした。","type":"historical context","meaning_category":"historical significance"},{"sentence":"Hatshepset's mortuary temple is a testament to her power and architectural vision.","translation":"ハトシェプストの葬祭殿は、彼女の権力と建築的ビジョンを証明するものです。","type":"architectural significance","meaning_category":"architectural landmark"}]}