{"word":"hydroplaning","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハイドロプレーニング現象","english_definition":"The loss of control of a vehicle when a layer of water separates the tires from the road surface.","examples":[{"sentence":"Hydroplaning can occur when driving on wet roads at high speeds.","translation":"ハイドロプレーニング現象は、雨の日の道路を高速で運転する際に起こりうる。"},{"sentence":"The driver lost control due to hydroplaning and crashed into a barrier.","translation":"運転手はハイドロプレーニング現象により制御を失い、バリアに衝突した。"}],"collocations":["cause hydroplaning","experience hydroplaning","avoid hydroplaning","hydroplaning accident"],"synonyms":["aquaplaning"],"antonyms":[]},{"part_of_speech":"verb","definition":"ハイドロプレーニング現象を起こす","english_definition":"(of a vehicle) to slide uncontrollably on a wet surface because of a layer of water between the tires and the road.","examples":[{"sentence":"The car started to hydroplane as it entered the puddle.","translation":"車が水たまりに入ったとき、ハイドロプレーニング現象を起こし始めた。"},{"sentence":"I felt the car hydroplaning, so I gently eased off the accelerator.","translation":"車がハイドロプレーニング現象を起こしているのを感じたので、そっとアクセルを緩めた。"}],"collocations":["start to hydroplane","feel the car hydroplaning"],"synonyms":["aquaplane"],"antonyms":[]}],"etymology":{"value":"'Hydro-' (water) + 'plane' (to glide on a surface). The term describes the action of a vehicle's tires riding on a layer of water, similar to a boat planing on the water's surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdrəˈpleɪnɪŋ/","syllables":"hy·dro·plan·ing"},"inflection":{"noun_plural":"N/A (uncountable)","verb_forms":{"present_simple":["hydroplane","hydroplanes"],"past_simple":"hydroplaned","past_participle":"hydroplaned","present_participle":"hydroplaning"}},"usage_notes":{"explanation":"'Hydroplaning' refers to the dangerous situation where a vehicle's tires lose contact with the road surface due to a layer of water. This can cause a loss of steering and braking control. The verb form describes the action of a vehicle experiencing this phenomenon. It's crucial to slow down in wet conditions to reduce the risk of hydroplaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was hydroplaned.","correct":"✓ The car hydroplaned.","note":"'Hydroplane' is the verb, so use it directly. 'Was hydroplaned' is grammatically incorrect in this context."},{"incorrect":"✗ Hydroplaning is caused by too much air in the tires.","correct":"✓ Hydroplaning is caused by too much water on the road.","note":"Hydroplaning is caused by a layer of water between the tires and the road surface, not by air in the tires."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["aquaplaning","traction","tire tread","skidding","loss of control"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hydroplaning' is a term used to describe a dangerous situation that can occur when driving a vehicle on wet roads. It happens when a layer of water builds up between the tires of the vehicle and the road surface, causing the tires to lose contact with the road. This loss of contact can make it difficult or impossible to steer or brake the vehicle, potentially leading to an accident. To avoid hydroplaning, it's important to slow down when driving in wet conditions and ensure that your tires have adequate tread depth.","priority":"★★☆"},"example_sentences":[{"sentence":"The car began **hydroplaning** on the rain-slicked highway.","translation":"車は雨で滑りやすくなった高速道路でハイドロプレーニング現象を起こし始めた。","type":"verb","meaning_category":"ハイドロプレーニング現象を起こす"},{"sentence":"Proper tire inflation can help prevent **hydroplaning**.","translation":"適切なタイヤの空気圧はハイドロプレーニング現象を防ぐのに役立つ。","type":"noun","meaning_category":"ハイドロプレーニング現象"},{"sentence":"The driver's quick reaction prevented a **hydroplaning** accident.","translation":"運転手の迅速な反応がハイドロプレーニング現象による事故を防いだ。","type":"adjective (attributive)","meaning_category":"ハイドロプレーニング現象"}]}