{"word":"lazurite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ラズライト、青金石","english_definition":"A blue tectosilicate mineral with the formula (Na,Ca)₈(AlSiO₄)₆(S,Cl,SO₄,OH)₂. It is a feldspathoid and a member of the sodalite group.","examples":[{"sentence":"Lazurite is a key component of lapis lazuli.","translation":"ラズライトはラピスラズリの主要な構成要素です。"},{"sentence":"The deep blue color of lazurite is highly prized in jewelry.","translation":"ラズライトの濃い青色は、宝石として非常に高く評価されています。"}],"collocations":["lapis lazuli","sodalite group","tectosilicate mineral"],"synonyms":["lapis lazuli (often used interchangeably, though lapis lazuli is a rock containing lazurite)"],"antonyms":[]},{"part_of_speech":"noun","definition":"（色としての）ラズライトブルー、青金石色","english_definition":"The color of lazurite, a deep, vivid blue.","examples":[{"sentence":"The artist used lazurite to paint the Virgin Mary's robe.","translation":"画家はラズライトを使って聖母マリアのローブを描いた。"},{"sentence":"Her eyes were the color of lazurite.","translation":"彼女の瞳はラズライトの色をしていた。"}],"collocations":["lazurite blue"],"synonyms":["ultramarine","royal blue"],"antonyms":[]}],"etymology":{"value":"Derived from the Persian word 'lāzaward' (لاژورد), which referred to lapis lazuli and the place where it was mined. This Persian word then entered Latin as 'lazur' and eventually became 'lazurite' in English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæzjʊraɪt/","syllables":"laz-u-rite"},"inflection":{"noun_plural":"lazurites"},"usage_notes":{"explanation":"Lazurite is a mineral, while lapis lazuli is a rock composed primarily of lazurite, along with other minerals like calcite and pyrite. Therefore, while the terms are often used interchangeably, it's more accurate to refer to pure lazurite as the mineral and lapis lazuli as the rock.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a lazurite necklace, but it has gold flecks in it.","correct":"✓ I bought a lapis lazuli necklace, and it has gold flecks in it.","note":"The gold flecks suggest the presence of pyrite, meaning the necklace is more accurately described as lapis lazuli, not pure lazurite."}],"priority":"★☆☆"},"related_words":{"derivatives":["lazuline (related mineral, sometimes used as a synonym, but technically distinct)","lapis lazuli (rock containing lazurite)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lazurite' is a technical term used in mineralogy to describe a specific blue mineral. It's most commonly encountered in discussions of lapis lazuli, where it's a primary component. Understanding the distinction between lazurite (the mineral) and lapis lazuli (the rock) requires some familiarity with geological terminology."},"example_sentences":[{"sentence":"The chemical formula of **lazurite** is complex, involving sodium, calcium, aluminum, silicon, oxygen, sulfur, chlorine, and hydroxyl groups.","translation":"ラズライトの化学式は複雑で、ナトリウム、カルシウム、アルミニウム、シリコン、酸素、硫黄、塩素、およびヒドロキシル基を含みます。","type":"noun","meaning_category":"mineral"},{"sentence":"The museum's collection includes several specimens of **lazurite** from Afghanistan.","translation":"博物館のコレクションには、アフガニスタン産のラズライトの標本がいくつか含まれています。","type":"noun","meaning_category":"mineral"},{"sentence":"The artist sought a pigment that matched the intense blue of **lazurite**.","translation":"その芸術家は、ラズライトの強烈な青色に匹敵する顔料を探していました。","type":"noun","meaning_category":"color"}]}