{"word":"Crabsidle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Humorous) A sideways walk, especially one that is awkward or comical.","english_definition":"(Humorous) A sideways walk, especially one that is awkward or comical, resembling the movement of a crab.","examples":[{"sentence":"His attempt at a crabsidle across the stage drew laughter from the audience.","translation":"彼の舞台上でのカニ歩きのような横移動は、観客から笑いを誘った。"},{"sentence":"She tried a crabsidle to avoid bumping into the table.","translation":"彼女はテーブルにぶつからないようにカニ歩きを試みた。"}],"collocations":["do a crabsidle","attempt a crabsidle","awkward crabsidle","comical crabsidle"],"synonyms":["sideways shuffle","sideways walk","crabwalk"],"antonyms":["normal walk","forward stride"]}],"etymology":{"value":"A blend of 'crab' (referring to the sideways movement of crabs) and 'sidle' (to move sideways).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkræbzˌaɪdəl/","syllables":"Crabs-i-dle"},"inflection":{"noun_plural":"Crabsidles"},"usage_notes":{"explanation":"'Crabsidle' is a humorous and informal term, often used to describe an awkward or comical sideways walk. It is not a commonly used word, but it is easily understood due to its descriptive nature. It implies a movement similar to that of a crab, which typically moves sideways.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He crabsidled quickly forward.","correct":"✓ He crabsidled quickly sideways.","note":"The essence of 'crabsidle' is sideways movement, so avoid combining it with 'forward'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning resources)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crabsidle' is a niche word, easily understood through its composition but not commonly encountered. Its usage is primarily humorous or descriptive, referring to an awkward sideways walk reminiscent of a crab's movement. Due to its specialized and informal nature, it is not typically included in standard language learning curricula."},"example_sentences":[{"sentence":"The toddler's first attempt at a crabsidle was more of a wobbly shuffle.","translation":"幼児が初めてカニ歩きを試みたところ、よろめきながらのシャッフルになった。","type":"noun","meaning_category":"sideways walk"},{"sentence":"To navigate the narrow hallway, he had to crabsidle his way through.","translation":"狭い廊下を通り抜けるために、彼はカニ歩きで進む必要があった。","type":"verb (implied)","meaning_category":"sideways movement"}]}