{"word":"butyric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"酪酸の、酪酸に関する","english_definition":"relating to or derived from butyric acid.","examples":[{"sentence":"Butyric acid is responsible for the unpleasant odor of rancid butter.","translation":"酪酸は、腐ったバターの不快な臭いの原因である。"},{"sentence":"Butyric fermentation is a type of anaerobic fermentation.","translation":"酪酸発酵は、嫌気性発酵の一種である。"}],"collocations":["butyric acid","butyric fermentation"],"synonyms":["butanoic"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'butyrum', meaning butter, referring to the fact that butyric acid was first discovered in butter.","priority":"★★★"},"pronunciation":{"ipa":"/bjuːˈtɪrɪk/","syllables":"bu-ty-ric"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Butyric' is primarily used in scientific and technical contexts, especially in chemistry and biology, to describe substances or processes related to butyric acid. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The butyric smell was nice.","correct":"✓ The butyric smell was unpleasant.","note":"Butyric acid, and therefore things described as 'butyric', typically have an unpleasant odor. Using 'nice' would be unusual."}],"priority":"★★☆"},"related_words":{"derivatives":["butyrate (noun: 酪酸塩)","butyric acid (noun: 酪酸)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'butyric' is a technical term primarily used in scientific contexts, specifically in chemistry and biology. It refers to substances or processes related to butyric acid, which is a fatty acid found in butter and other sources. Due to its specialized usage, it is not commonly encountered in general conversation or writing. Understanding requires familiarity with basic chemistry concepts."},"example_sentences":[{"sentence":"The laboratory identified a high concentration of butyric acid in the sample.","translation":"その研究所は、サンプル中に高濃度の酪酸が検出された。","type":"general","meaning_category":"technical"},{"sentence":"Butyric fermentation plays a role in the production of certain cheeses.","translation":"酪酸発酵は、特定のチーズの製造において役割を果たす。","type":"specific","meaning_category":"technical"}]}