{"word":"Solanaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ナス科","english_definition":"The nightshade family of plants, characterized by alternate leaves, regular flowers with fused petals, and berries or capsules as fruits.","examples":[{"sentence":"Tomatoes, potatoes, and peppers all belong to the Solanaceae family.","translation":"トマト、ジャガイモ、ピーマンはすべてナス科に属する。"}],"collocations":["Solanaceae family","members of Solanaceae","cultivated Solanaceae"],"synonyms":["nightshade family"],"antonyms":[]}],"etymology":{"value":"Derived from Solanum, the type genus of the family, which comes from the Latin word 'sol' meaning 'sun', possibly referring to the plant's association with sunny places or its star-shaped flowers. The suffix '-aceae' is a standard suffix used in botanical nomenclature to denote a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊləˈneɪsiːˌaɪ/","syllables":"So-la-na-ce-ae"},"inflection":{"noun_plural":"Solanaceaes/Solanaceae"},"usage_notes":{"explanation":"'Solanaceae' refers to the plant family that includes many important food crops, medicinal plants, and ornamental species. It is a taxonomic term used in botany and agriculture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Solanaceae is a single plant.","correct":"✓ Solanaceae is a plant family.","note":"Solanaceae refers to the entire family, not a single species."}],"priority":"★★☆"},"related_words":{"derivatives":["Solanum (genus)","Solanaceous (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Solanaceae' is a scientific term used in botany and agriculture to refer to the nightshade family of plants. It is typically encountered in academic or technical contexts related to plant science, horticulture, or agriculture.","priority":"★★☆"},"example_sentences":[{"sentence":"The Solanaceae family is economically important due to its inclusion of crops like potatoes and tomatoes.","translation":"ナス科は、ジャガイモやトマトなどの作物が含まれているため、経済的に重要である。","type":"general","meaning_category":"Botany"},{"sentence":"Many species within the Solanaceae contain alkaloids, some of which are toxic.","translation":"ナス科の多くの種はアルカロイドを含んでおり、その一部は有毒である。","type":"scientific","meaning_category":"Botany"}]}