{"word":"paleomagnetism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"古地磁気学","english_definition":"The study of the intensity and direction of the Earth's magnetic field in the geologic past.","examples":[{"sentence":"Paleomagnetism provides evidence for continental drift.","translation":"古地磁気学は大陸移動の証拠を提供する。"},{"sentence":"Researchers use paleomagnetism to reconstruct the movements of tectonic plates.","translation":"研究者たちは古地磁気学を用いて、構造プレートの動きを再構築する。"}],"collocations":["paleomagnetic data","paleomagnetic studies","paleomagnetic analysis","reverse polarity","magnetic declination","magnetic inclination"],"synonyms":["geomagnetism","rock magnetism"],"antonyms":[]}],"etymology":{"value":"The word \"paleomagnetism\" is derived from the Greek words \"palaios\" (ancient), \"magnetis\" (magnetic), and \"-ismos\" (the process or study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpeɪlioʊˈmæɡnɪtɪzəm/","syllables":"pa-le-o-mag-net-i-sm"},"inflection":{"notes":"This is a noun and does not have inflectional forms."},"usage_notes":{"explanation":"Paleomagnetism is a branch of geophysics concerned with studying the Earth's magnetic field in the past. Rocks can preserve a record of the magnetic field's direction and intensity at the time they formed. This information is used to study continental drift, plate tectonics, polar wander, and reversals of the Earth's magnetic field.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Paleomagnetism is the study of ancient magnets.","correct":"✓ Paleomagnetism is the study of the Earth's ancient magnetic field.","note":"Paleomagnetism specifically refers to the Earth's magnetic field, not just any ancient magnets."}],"priority":"★★☆"},"related_words":{"derivatives":["paleomagnetic (adjective)","magnetostratigraphy (noun)","geomagnetism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Paleomagnetism is a specialized term in geophysics, referring to the study of the Earth's magnetic field in the geological past. It involves understanding how rocks record magnetic information and using this information to reconstruct past continental positions and magnetic field behavior. The term is primarily encountered in scientific contexts, such as geology, geophysics, and earth science.","priority":"★★☆"},"example_sentences":[{"sentence":"The paleomagnetism of these rocks indicates that they formed near the equator.","translation":"これらの岩石の古地磁気は、それらが赤道付近で形成されたことを示している。","type":"general","meaning_category":"Earth's magnetic field in the past"},{"sentence":"Paleomagnetism is crucial for understanding the history of plate tectonics.","translation":"古地磁気学は、プレートテクトニクスの歴史を理解するために不可欠である。","type":"general","meaning_category":"Earth's magnetic field in the past"}]}