{"word":"Unbankably","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"In a manner or to an extent that makes it impossible to obtain a bank loan or financial services.","english_definition":"In a way that makes something or someone ineligible for banking services or loans, typically due to high risk or lack of financial stability.","examples":[{"sentence":"The project was unbankably risky, so they had to seek alternative funding.","translation":"そのプロジェクトは銀行融資を受けるにはリスクが高すぎたため、別の資金調達方法を探す必要があった。"},{"sentence":"Many small businesses in the area are unbankably small, making it difficult for them to grow.","translation":"その地域の多くの中小企業は、規模が小さすぎて銀行融資を受けられないため、成長が難しい。"}],"collocations":["unbankably risky","unbankably small","unbankably unstable"],"synonyms":["financially unviable","uncreditworthy","ineligible for financing"],"antonyms":["bankably","creditworthy","financially viable"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"bankable\" (suitable for a bank loan) + \"-ly\" (adverbial suffix).","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈbæŋkəbli/","syllables":"un-bank-a-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Unbankably\" describes situations or entities that are considered too risky or unstable for banks to provide loans or financial services. It is often used in the context of business, finance, and economic development.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was unbankable.","correct":"✓ The situation was unbankably risky.","note":"\"Unbankable\" is an adjective, while \"unbankably\" is an adverb.  Use \"unbankable\" to describe the thing itself (e.g., \"the project is unbankable\"), and \"unbankably\" to describe the manner in which something is (e.g., \"the project is unbankably risky\")."}],"priority":"N/A"},"related_words":{"derivatives":["unbankable (adjective)","bankable (adjective)","bankability (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"\"Unbankably\" is a specialized term used in finance and economics to describe something that is not eligible for bank loans or financial services due to high risk or instability. It is formed by adding the prefix \"un-\" to \"bankable\" and the suffix \"-ly\" to make it an adverb. The term is relatively rare and is typically used in professional or academic contexts related to finance. "},"example_sentences":[{"sentence":"The startup's business model was deemed unbankably speculative by traditional lenders.","translation":"そのスタートアップ企業のビジネスモデルは、従来の貸し手からは投機的すぎて銀行融資を受けられないと判断された。","type":"adverb","meaning_category":"Financial Ineligibility"},{"sentence":"The region's political instability made investment unbankably risky.","translation":"その地域の政治的不安定さが、投資を銀行融資を受けるにはリスクが高すぎるものにした。","type":"adverb","meaning_category":"Financial Ineligibility"}]}