{"word":"Porokeratosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ポロケラトーシス（角化症）","english_definition":"A group of skin disorders characterized by the presence of a coronoid lamella, a thin column of scale-like cells on the skin surface.","examples":[{"sentence":"Porokeratosis is a chronic skin condition.","translation":"ポロケラトーシスは慢性の皮膚疾患です。"},{"sentence":"Treatment for porokeratosis can include topical creams or laser therapy.","translation":"ポロケラトーシスの治療には、外用クリームやレーザー治療などがあります。"}],"collocations":["porokeratosis treatment","disseminated superficial actinic porokeratosis (DSAP)"],"synonyms":["skin keratosis","follicular keratosis"],"antonyms":[]}],"etymology":{"value":"Derived from Greek words 'poros' (pore, channel), 'kerato-' (horny), and '-osis' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɔːroʊˌkɛrəˈtoʊsɪs/","syllables":"po-ro-ke-ra-to-sis"},"inflection":{"noun_plural":"porokeratoses"},"usage_notes":{"explanation":"Porokeratosis refers to a group of genetic skin disorders that disrupt keratinization. Lesions typically appear as small, round or oval, slightly raised patches with a characteristic thin, raised border called a coronoid lamella. Different clinical variants exist, such as disseminated superficial actinic porokeratosis (DSAP), which is exacerbated by sun exposure. Diagnosis is usually clinical, sometimes confirmed by skin biopsy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have porokeratosis on my knee. It's just a small bump.","correct":"✓ I have a skin condition on my knee. It might be porokeratosis, but I need to see a doctor to confirm.","note":"Self-diagnosing skin conditions can be inaccurate. It's best to consult a dermatologist for a proper diagnosis."}],"priority":"★☆☆"},"related_words":{"derivatives":["porokeratotic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Porokeratosis' is a technical term used in dermatology to describe a specific group of skin disorders. It's not a commonly used word in everyday language. Understanding the term requires a basic knowledge of medical terminology, particularly related to skin conditions and keratinization processes. The key feature is the 'coronoid lamella,' which is a diagnostic marker. Due to its specialized nature, the term is primarily encountered in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The dermatologist diagnosed her with disseminated superficial actinic porokeratosis (DSAP).","translation":"皮膚科医は彼女を播種性表在性光線角化症（DSAP）と診断しました。","type":"medical","meaning_category":"skin disorder diagnosis"},{"sentence":"He noticed small, ring-shaped lesions on his skin, which were later confirmed to be porokeratosis.","translation":"彼は皮膚に小さなリング状の病変があることに気づき、後にポロケラトーシスと確認されました。","type":"medical","meaning_category":"symptoms"}]}