{"word":"pig-bribed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(slang, humorous) Having received a bribe, especially in a corrupt or unethical manner. This term is often used facetiously.","english_definition":"(slang, humorous) Having received a bribe, especially in a corrupt or unethical manner. This term is often used facetiously.","examples":[{"sentence":"The election results seemed suspicious; many suspected the officials were pig-bribed.","translation":"選挙結果は疑わしく見えた。多くの人が当局者が賄賂を受け取ったのではないかと疑った。"},{"sentence":"He joked that the referee must be pig-bribed after a controversial call.","translation":"彼は物議を醸す判定の後、審判は賄賂を受け取ったに違いないと冗談を言った。"}],"collocations":["pig-bribed officials","pig-bribed referee","suspect pig-bribed"],"synonyms":["corrupted","bribed","bought off","influenced"],"antonyms":["honest","incorruptible","ethical"]}],"etymology":{"value":"A humorous and slangy compound word formed from 'pig' (often associated with greed or corruption) and 'bribed' (having received a bribe). The term plays on the negative connotations of both words.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪɡ ˈbraɪbd/","syllables":"pig-bribed"},"inflection":{"notes":"Adjective, not typically inflected."},"usage_notes":{"explanation":"'Pig-bribed' is a slang term used humorously to suggest that someone has been bribed, especially in a way that is considered corrupt or unethical. The term is not formal and is often used in a facetious or sarcastic manner. It's important to note that using this term could be considered offensive if taken seriously.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pig-bribed.","correct":"✓ He is pig-bribed. (less common) / ✓ He was pig-bribed. (more common)","note":"The term is usually used as an adjective to describe someone's state or condition, not as a noun. It's more common to say 'he was pig-bribed' to indicate he received a bribe."}],"priority":"★☆☆"},"related_words":{"derivatives":["bribe","bribery","corrupt","corruption"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically found in standard language learning materials)","frequency_google_ngram":"Low frequency (Slang term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pig-bribed' is a slang term used humorously to suggest someone has been bribed in a corrupt manner. It is not formal and should be used with caution as it can be offensive. The term combines 'pig,' often associated with greed, and 'bribed,' meaning having received a bribe. It is typically used facetiously or sarcastically.","priority":"★★☆"},"example_sentences":[{"sentence":"The fans were convinced the judge was pig-bribed after the controversial decision.","translation":"物議を醸す決定の後、ファンは裁判官が賄賂を受け取ったと確信していた。","type":"adjective","meaning_category":"corrupted"},{"sentence":"It's just a joke; I don't really think the politician is pig-bribed.","translation":"ただの冗談だよ。私は本当にその政治家が賄賂を受け取ったとは思わない。","type":"adjective","meaning_category":"corrupted"}]}