{"word":"Canadine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A quaternary isoquinoline alkaloid found in some plants, including goldenseal and bloodroot. It has been studied for its potential medicinal properties.","english_definition":"A quaternary isoquinoline alkaloid found in some plants, including goldenseal and bloodroot. It has been studied for its potential medicinal properties.","examples":[{"sentence":"Canadine is one of the active compounds found in goldenseal.","translation":"カナジンは、ゴールデンシールに含まれる活性化合物の一つです。"},{"sentence":"Research suggests that canadine may have antimicrobial effects.","translation":"研究によると、カナジンは抗菌作用がある可能性があります。"}],"collocations":["isolate canadine","canadine alkaloid","medicinal properties of canadine"],"synonyms":["tetrahydroberberine"],"antonyms":[]}],"etymology":{"value":"Derived from the plant genus name 'Canadensis', indicating its discovery or prevalence in plants native to Canada.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkænədiːn/","syllables":"Ca-na-dine"},"inflection":{"noun_plural":"canadines"},"usage_notes":{"explanation":"Canadine is primarily a chemical term used in botany, pharmacology, and related scientific fields. It refers to a specific naturally occurring compound. It is not a commonly used word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Canadine is a type of vitamin.","correct":"✓ Canadine is a type of alkaloid.","note":"Canadine is an alkaloid, not a vitamin."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["goldenseal","bloodroot","alkaloid","isoquinoline"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Canadine\" is a technical term primarily encountered in scientific contexts, specifically in fields like botany, chemistry, and pharmacology. It refers to a specific isoquinoline alkaloid found in certain plants. Understanding this term requires a familiarity with scientific vocabulary and concepts related to plant compounds and their properties. It is not typically used in general conversation."},"example_sentences":[{"sentence":"The researchers investigated the effects of canadine on bacterial growth.","translation":"研究者たちは、カナジンが細菌の成長に与える影響を調査しました。","type":"noun","meaning_category":"alkaloid"},{"sentence":"Canadine has shown promise as a potential anti-inflammatory agent in preliminary studies.","translation":"予備研究では、カナジンが潜在的な抗炎症剤として有望であることが示されています。","type":"noun","meaning_category":"alkaloid"}]}