{"word":"non-touch-optimized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"タッチ操作向けに最適化されていない","english_definition":"Not optimized for touch-based interaction; designed primarily for use with a mouse and keyboard rather than touchscreens.","examples":[{"sentence":"This website is non-touch-optimized, so it's difficult to use on a tablet.","translation":"このウェブサイトはタッチ操作向けに最適化されていないため、タブレットでの使用は困難です。"},{"sentence":"The software was originally designed for desktop computers and is non-touch-optimized.","translation":"このソフトウェアは元々デスクトップコンピュータ向けに設計されており、タッチ操作向けに最適化されていません。"}],"collocations":["non-touch-optimized website","non-touch-optimized application","non-touch-optimized interface"],"synonyms":["not touch-friendly","not touch-compatible"],"antonyms":["touch-optimized","touch-friendly","touch-compatible"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the phrase 'touch-optimized'. 'Touch-optimized' refers to something that has been designed or adapted to work well with touch-based input methods, such as touchscreens.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn tʌtʃ ˈɒptɪmaɪzd/","syllables":"non-touch-op-ti-mized"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Non-touch-optimized' is used to describe applications, websites, or interfaces that are not designed or adapted for use with touchscreens. This often means that the elements are too small, too close together, or not responsive enough to be easily used with a finger or stylus. It implies that the user experience will be less than ideal on a touchscreen device.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The app is non touch optimized.","correct":"✓ The app is non-touch-optimized.","note":"The correct spelling includes a hyphen between 'non' and 'touch' and 'touch' and 'optimized' ."},{"incorrect":"✗ This website is not optimized for touch.","correct":"✓ This website is non-touch-optimized.","note":"While 'not optimized for touch' is understandable, 'non-touch-optimized' is a more concise and specific term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["touch-optimized","touchscreen","user interface","UI","UX","responsive design"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-touch-optimized' describes something, usually a website or app, that isn't designed to be easily used on devices with touchscreens, like tablets or smartphones. This means it might be hard to click buttons or navigate because the elements are too small or close together for fingers to use comfortably. It's a technical term used to indicate a design that's better suited for a mouse and keyboard."},"example_sentences":[{"sentence":"Many older websites are non-touch-optimized, making them difficult to navigate on mobile devices.","translation":"多くの古いウェブサイトはタッチ操作向けに最適化されておらず、モバイルデバイスでのナビゲーションが困難になっています。","type":"adjective","meaning_category":"Not optimized for touch"},{"sentence":"The company is redesigning its software to be touch-optimized, as the current version is non-touch-optimized.","translation":"同社はソフトウェアをタッチ操作向けに再設計しており、現在のバージョンはタッチ操作向けに最適化されていません。","type":"adjective","meaning_category":"Not optimized for touch"}]}