{"word":"bone-lace","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボーンレース（骨製のボビンを使って編むレース）","english_definition":"A delicate lace made by winding thread around pins set in a pattern on a cushion, the pins often being supported by small bone bobbins.","examples":[{"sentence":"She learned to make bone-lace from her grandmother.","translation":"彼女は祖母からボーンレースの作り方を教わった。"},{"sentence":"The museum has a beautiful collection of antique bone-lace.","translation":"その博物館には、美しいアンティークのボーンレースのコレクションがある。"}],"collocations":["make bone-lace (ボーンレースを作る)","antique bone-lace (アンティークのボーンレース)","bone-lace pattern (ボーンレースのパターン)"],"synonyms":["bobbin lace"],"antonyms":[]}],"etymology":{"value":"The term 'bone-lace' likely refers to the bone (or ivory) bobbins traditionally used in the lace-making process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈboʊnˌleɪs/","syllables":"bone-lace"},"inflection":{"noun_plural":"bone-laces"},"usage_notes":{"explanation":"Bone-lace is a specific type of lace made using bobbins, which were historically often made of bone or ivory. The term is somewhat archaic but still used in historical contexts and by lace-making enthusiasts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a dress with bone lace.","correct":"✓ She wore a dress with bone-lace.","note":"The correct spelling is 'bone-lace' (with a hyphen)."},{"incorrect":"✗ I prefer bone lace to machine made lace.","correct":"✓ I prefer bone-lace to machine-made lace.","note":"When comparing bone-lace to machine-made lace, ensure both are hyphenated for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["lace-making (レース作り)","bobbin (ボビン)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bone-lace' is a specialized term referring to a specific type of handmade lace crafted using bobbins, often historically made from bone. Its usage is primarily confined to contexts involving historical textiles, crafts, or lacemaking as a hobby. Due to its niche application, it is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The intricate design of the bone-lace shawl was admired by all.","translation":"そのボーンレースのショールの複雑なデザインは皆に賞賛された。","type":"noun","meaning_category":"ボーンレース"},{"sentence":"Making bone-lace requires patience and a steady hand.","translation":"ボーンレースを作るには忍耐力と安定した手が必要だ。","type":"noun","meaning_category":"ボーンレース"},{"sentence":"The bone-lace pillow held dozens of bobbins.","translation":"ボーンレースの枕は何十個ものボビンを支えていた。","type":"noun","meaning_category":"ボーンレース"}]}