{"word":"Abiogeny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自然発生説、無生起源説","english_definition":"The obsolete theory that living organisms arise from nonliving matter.","examples":[{"sentence":"Abiogeny was disproven by experiments conducted by Pasteur and others.","translation":"自然発生説は、パスツールらによって行われた実験によって反証された。"}],"collocations":["spontaneous generation","origin of life"],"synonyms":["spontaneous generation","archegenesis"],"antonyms":["biogenesis"],"notes":["Abiogenesis is the correct scientific term for the origin of life from non-living matter. Abiogeny is an older term for spontaneous generation, which is now considered obsolete."],"field":"Biology, History of Science"}],"etymology":{"value":"From the Greek ἀ- (a-, \"not\") + βίος (bios, \"life\") + -γένεια (-geneia, \"generation\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪbaɪˈɒdʒəni/","syllables":"a-bi-o-ge-ny"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Abiogeny' is an older term for spontaneous generation, the idea that life can arise from non-living matter. It is largely replaced by the term 'abiogenesis' when referring to the scientific study of the origin of life from non-living matter.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Abiogeny is the same as abiogenesis.","correct":"Abiogeny is an older term for spontaneous generation, while abiogenesis is the scientific study of the origin of life.","note":"Abiogeny is an older term for spontaneous generation. Abiogenesis is the scientific term for the origin of life from non-living matter."}],"priority":"★★☆"},"related_words":{"derivatives":["abiogenetic"],"related_terms":["abiogenesis","biogenesis","spontaneous generation"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Abiogeny' refers to the outdated idea that life can spontaneously emerge from non-living things. It's an older term, now mostly replaced by 'abiogenesis,' which is the scientific study of how life originated from non-living matter. You'll mostly encounter 'abiogeny' in historical contexts when discussing the history of biology and the refutation of spontaneous generation."},"example_sentences":[{"sentence":"The theory of abiogeny was widely accepted until the 19th century.","translation":"自然発生説は19世紀まで広く受け入れられていた。","type":"noun","meaning_category":"自然発生説"},{"sentence":"Experiments by Redi and Pasteur helped to disprove abiogeny.","translation":"レディとパスツールの実験は、自然発生説を反証するのに役立った。","type":"noun","meaning_category":"自然発生説"}]}