{"word":"uricosuric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"尿酸排泄促進性の、尿酸排泄を促進する","english_definition":"Promoting the excretion of uric acid in the urine.","examples":[{"sentence":"Uricosuric drugs are used to treat gout.","translation":"尿酸排泄促進薬は痛風の治療に用いられる。"}],"collocations":["uricosuric agent","uricosuric drug","uricosuric effect"],"synonyms":["uric acid lowering","hypouricemic"],"antonyms":["uric acid retaining"],"notes":"Often used to describe a medication or treatment that increases the excretion of uric acid."}],"etymology":{"value":"From 'uric' (referring to uric acid) + 'o-' (connecting vowel) + '-suric' (referring to excretion in the urine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjʊərɪkəˈsʊərɪk/","syllables":"u-ri-co-su-ric"},"inflection":{"notes":"This word is primarily an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Uricosuric' describes substances or medications that increase the excretion of uric acid in the urine. This is important in treating conditions like gout, where uric acid crystals accumulate in the joints.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed a uricosuric for his high blood pressure.","correct":"✓ The doctor prescribed a uricosuric for his gout.","note":"Uricosurics are primarily used for conditions related to uric acid levels, such as gout, not high blood pressure."}],"priority":"★★☆"},"related_words":{"derivatives":["uricosuric (noun): A uricosuric agent or drug."],"related_terms":["uric acid","gout","hyperuricemia","probenecid","sulfinpyrazone"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uricosuric' is a technical term used in medicine to describe substances that increase the excretion of uric acid in the urine. It is most commonly encountered in the context of treating gout or other conditions related to high uric acid levels. Understanding this term requires some background knowledge in biology or medicine."},"example_sentences":[{"sentence":"Probenecid is a commonly prescribed uricosuric medication.","translation":"プロベネシドは一般的に処方される尿酸排泄促進薬です。","type":"adjective","meaning_category":"尿酸排泄促進性の"},{"sentence":"A uricosuric diet may help lower uric acid levels.","translation":"尿酸排泄を促進する食事療法は、尿酸値を下げるのに役立つかもしれません。","type":"adjective","meaning_category":"尿酸排泄促進性の"}]}