{"word":"promulgation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"公布、発布、宣布、普及","english_definition":"the act of officially announcing or making something known widely; the act of putting a law or decree into effect by public declaration.","examples":[{"sentence":"The promulgation of the new law was met with mixed reactions.","translation":"新法の公布は賛否両論の反応を引き起こした。"},{"sentence":"The government announced the promulgation of the decree.","translation":"政府は法令の発布を発表した。"},{"sentence":"The promulgation of these ideas is essential for social progress.","translation":"これらの考えの普及は社会の進歩に不可欠である。"}],"collocations":["promulgation of a law (法律の公布)","promulgation of a decree (法令の発布)","promulgation of information (情報の普及)","official promulgation (公式な公布)"],"synonyms":["announcement","declaration","proclamation","publication","dissemination","spreading","communication","notification"],"antonyms":["suppression","concealment","withholding","secrecy"]}],"etymology":{"value":"Late Middle English: from Latin promulgatio(n-), from the verb promulgare, from pro- 'forth' + mulgere 'to milk' (perhaps originally referring to the public exposure of something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɒməlˈɡeɪʃən/","syllables":"prom-ul-ga-tion"},"inflection":{"noun_plural":"promulgations"},"usage_notes":{"explanation":"\"Promulgation\" refers to the formal act of making something, especially a law, decree, or idea, widely known or publicly declared. It implies an official and authoritative announcement. The word is often used in legal, governmental, and academic contexts. It is a more formal and specific term than general words like \"announcement\" or \"publication.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The promulgation was very secret.","correct":"✓ The promulgation was very public.","note":"Promulgation inherently implies a public announcement, so describing it as \"secret\" is contradictory."},{"incorrect":"✗ The promulgation of the rumor caused panic.","correct":"✓ The spreading of the rumor caused panic.","note":"Promulgation is typically used for official or formal announcements, not for spreading rumors or unverified information."}],"priority":"★★☆"},"related_words":{"derivatives":["promulgate (verb: 公布する、発布する、宣布する、普及させる)","promulgator (noun: 公布者、発布者、普及者)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency - more common in formal or legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Promulgation\" is a formal word that means to officially announce or make something (like a new law or idea) widely known. It's often used in legal or government settings. Think of it as the official act of telling everyone about something important. It's not a word you'd use in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The official **promulgation** of the new regulations is scheduled for next week.","translation":"新しい規制の公式な公布は来週に予定されている。","type":"noun","meaning_category":"公布"},{"sentence":"The **promulgation** of the treaty was a significant step towards peace.","translation":"条約の公布は平和に向けた重要な一歩だった。","type":"noun","meaning_category":"発布"},{"sentence":"The **promulgation** of scientific knowledge is crucial for societal advancement.","translation":"科学的知識の普及は社会の発展にとって不可欠である。","type":"noun","meaning_category":"普及"}]}