{"word":"Paracelsic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"パラケルススの、またはパラケルススに関する","english_definition":"Of or relating to Paracelsus or his doctrines.","examples":[{"sentence":"The Paracelsic approach to medicine emphasized alchemy and natural philosophy.","translation":"医学に対するパラケルススの手法は、錬金術と自然哲学を重視した。"}],"collocations":[],"synonyms":["alchemical","hermetic"],"antonyms":[]}],"etymology":{"value":"Named after Paracelsus (1493-1541), a Swiss physician and alchemist.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpærəˈsɛlsɪk/","syllables":"Par-a-cel-sic"},"inflection":{},"usage_notes":{"explanation":"'Paracelsic' is primarily used in historical or academic contexts when discussing the history of medicine, alchemy, or philosophy. It refers specifically to the ideas and practices associated with Paracelsus, who was a controversial figure in his time but influential in the development of certain scientific and medical concepts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Paracelsian (noun, adjective)","Paracelsus (proper noun)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word `Paracelsic` is a specialized term primarily encountered in academic or historical contexts related to the study of alchemy, medicine, and the history of science. It is not commonly used in everyday language. Understanding its meaning requires familiarity with the historical figure Paracelsus and his contributions. Therefore, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The museum exhibit showcased various artifacts related to Paracelsic medicine.","translation":"博物館の展示では、パラケルススの医学に関連する様々な工芸品が展示されていた。","type":"adjective","meaning_category":"relating to Paracelsus"},{"sentence":"His research focused on the Paracelsic view of the human body as a microcosm of the universe.","translation":"彼の研究は、宇宙の小宇宙としての人体というパラケルススの見解に焦点を当てていた。","type":"adjective","meaning_category":"relating to Paracelsus"}]}