{"word":"pro-Israelism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イスラエル支持主義、親イスラエル主義","english_definition":"Advocacy for or support of the state of Israel and its policies.","examples":[{"sentence":"Pro-Israelism is a complex issue with diverse perspectives.","translation":"イスラエル支持主義は、多様な視点を持つ複雑な問題です。"},{"sentence":"Some critics argue that pro-Israelism can sometimes lead to overlooking the concerns of Palestinians.","translation":"批判家の中には、イスラエル支持主義がパレスチナ人の懸念を見過ごすことにつながる場合があると主張する人もいます。"}],"collocations":["political pro-Israelism","religious pro-Israelism","support for pro-Israelism","oppose pro-Israelism"],"synonyms":["support for Israel","Israel advocacy","Israelophilia"],"antonyms":["anti-Israelism","anti-Zionism"]},{"part_of_speech":"noun","definition":"イスラエル支持者、親イスラエル主義者","english_definition":"The belief or political movement that supports the existence and policies of the state of Israel.","examples":[{"sentence":"He is known for his pro-Israelism and active involvement in organizations that support Israel.","translation":"彼はイスラエル支持者として知られており、イスラエルを支援する団体に積極的に関わっています。"},{"sentence":"Pro-Israelism is a significant factor in US foreign policy towards the Middle East.","translation":"イスラエル支持主義は、米国の中東政策において重要な要素です。"}],"collocations":["staunch pro-Israelism","moderate pro-Israelism","vocal pro-Israelism"],"synonyms":["supporter of Israel","advocate for Israel","Israelophile"],"antonyms":["anti-Israel activist","critic of Israel"]}],"etymology":{"value":"The term 'pro-Israelism' is formed by combining the prefix 'pro-' (meaning 'in favor of') with 'Israel' and the suffix '-ism' (denoting a belief, ideology, or movement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈɪzriːəlɪzəm/","syllables":"pro-Is-ra-el-ism"},"inflection":{"notes":"This is a noun and typically does not inflect (change form)."},"usage_notes":{"explanation":"'Pro-Israelism' refers to the support for the state of Israel, its right to exist, and often its policies. It is a multifaceted concept with varying degrees and motivations, ranging from political and strategic considerations to religious and cultural affinities. The term is often used in discussions about Middle Eastern politics, international relations, and human rights. It's important to note that support for Israel does not necessarily imply agreement with all of its government's actions or policies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-Israel.","correct":"✓ He is pro-Israel. / ✓ He is a pro-Israel advocate.","note":"'Pro-Israel' can be used as an adjective, but to refer to a person, use 'pro-Israel advocate' or 'supporter.'"},{"incorrect":"✗ Pro-Israelism means supporting everything Israel does.","correct":"✓ Pro-Israelism generally means supporting the existence and security of Israel, but it doesn't necessarily mean agreeing with every policy.","note":"It's important to clarify that pro-Israelism doesn't automatically equate to endorsing every action taken by the Israeli government."}],"priority":"★★☆"},"related_words":{"derivatives":["pro-Israel (adjective)","Israel (noun)","Zionism (noun)","anti-Israelism (noun)","anti-Zionism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, mainly used in political and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-Israelism' is a term used to describe the support for the state of Israel and its policies. This support can be based on various factors, including political, religious, or strategic considerations. Understanding this term is important for comprehending discussions about Middle Eastern politics and international relations. It's also crucial to recognize that pro-Israelism is a complex issue with diverse perspectives, and it does not necessarily imply agreement with all of Israel's actions.","example_sentences":[{"sentence":"The conference focused on the role of pro-Israelism in shaping US foreign policy.","translation":"その会議は、米国外交政策の形成におけるイスラエル支持主義の役割に焦点を当てました。","type":"noun","meaning_category":"イスラエル支持主義"},{"sentence":"Many argue that pro-Israelism in the United States is driven by a combination of political and religious factors.","translation":"多くの人が、米国におけるイスラエル支持主義は、政治的および宗教的要因の組み合わせによって推進されていると主張しています。","type":"noun","meaning_category":"イスラエル支持主義"},{"sentence":"The organization is known for its pro-Israelism and advocacy for stronger ties between the US and Israel.","translation":"その組織は、イスラエル支持主義と、米国とイスラエルのより強い関係を提唱することで知られています。","type":"noun","meaning_category":"イスラエル支持主義"}]}}