{"word":"renormalizable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(物理学で)繰り込み可能な","english_definition":"(of a quantum field theory) able to be made finite by the absorption of infinities into a finite number of parameters.","examples":[{"sentence":"The Standard Model of particle physics is a renormalizable theory.","translation":"素粒子物理学の標準模型は繰り込み可能な理論である。"},{"sentence":"Renormalizable quantum field theories are generally considered to be well-behaved.","translation":"繰り込み可能な場の量子論は一般的に扱いやすいと考えられている。"}],"collocations":["renormalizable theory","renormalizable quantum field theory"],"synonyms":[],"antonyms":["non-renormalizable"]}],"etymology":{"value":"The term \"renormalizable\" is derived from the process of \"renormalization\" in quantum field theory. It combines the prefix \"re-\" (meaning again) with \"normalize\" (to make standard or normal) and the suffix \"-able\" (indicating capability). The process involves redefining physical quantities to remove infinities that arise in calculations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈnɔːrməlaɪzəbəl/","syllables":"re-nor-mal-iz-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs like 'highly renormalizable' or 'easily renormalizable'."},"usage_notes":{"explanation":"In quantum field theory, calculations often lead to infinite results. Renormalization is a technique used to remove these infinities by redefining physical quantities like mass and charge. A theory is considered \"renormalizable\" if all infinities can be absorbed into a finite number of parameters. Renormalizable theories are preferred because they are predictive and can be tested experimentally. Non-renormalizable theories require an infinite number of parameters to be defined, making them less useful.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory is renormalizable, so it doesn't need any corrections.","correct":"✓ The theory is renormalizable, but it still requires careful calculations.","note":"Renormalizability doesn't mean a theory is perfect or doesn't need corrections; it just means the infinities can be handled in a consistent way."}],"priority":"★★☆"},"related_words":{"derivatives":["renormalization (noun)","renormalize (verb)","renormalized (adjective)","non-renormalizable (adjective)"],"phrases":["quantum field theory","Standard Model","divergence","cutoff"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in physics literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"renormalizable\" is highly specialized and primarily used within the context of advanced physics, specifically quantum field theory. It describes a property of a theory where infinite values that arise in calculations can be systematically removed by redefining a limited number of physical parameters. This allows the theory to make meaningful predictions. Understanding this term requires a solid background in physics and mathematics.","priority":"★★☆"},"example_sentences":[{"sentence":"The renormalizable nature of quantum electrodynamics made precise calculations possible.","translation":"量子電磁力学の繰り込み可能な性質により、正確な計算が可能になった。","type":"adjective","meaning_category":"physics"},{"sentence":"Although the theory is non-renormalizable, effective field theory techniques can still be applied.","translation":"その理論は繰り込み不可能であるが、有効場の理論の手法を適用することは可能である。","type":"adjective","meaning_category":"physics"}]}