{"word":"nonsubmergibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不沈性、非水没性","english_definition":"The quality or state of not being able to be submerged or sunk in water or another liquid.","examples":[{"sentence":"The nonsubmergibility of the vessel was crucial for its survival in the storm.","translation":"その船の不沈性は、嵐の中での生存にとって非常に重要だった。"},{"sentence":"Engineers tested the nonsubmergibility of the new submarine design.","translation":"エンジニアたちは、新しい潜水艦設計の不沈性を試験した。"}],"collocations":["test nonsubmergibility","ensure nonsubmergibility","improve nonsubmergibility"],"synonyms":["buoyancy","unsinkability","floatability"],"antonyms":["submergibility","sinkability"]}],"etymology":{"value":"Derived from \"submergibility\" (the ability to be submerged), with the addition of the prefix \"non-\" (meaning \"not\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.səbˌmɜː.dʒɪˈbɪl.ə.ti/","syllables":"non-sub-mer-gi-bil-i-ty"},"inflection":{"noun_plural":"nonsubmergibilities"},"usage_notes":{"explanation":"\"Nonsubmergibility\" is a technical term primarily used in engineering, physics, and naval architecture. It refers to the inherent property of an object or vessel to remain afloat and resist sinking, even when partially or fully immersed in a liquid. It's often a key design consideration for ships, submarines, and other marine vehicles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonsubmergibility is important for all objects.","correct":"✓ Nonsubmergibility is important for objects designed to float.","note":"Nonsubmergibility is only relevant for objects that are intended to float or resist sinking. It's not a general property of all objects."}],"priority":"★☆☆"},"related_words":{"derivatives":["submerge","submergible","submergence"],"related_terms":["buoyancy","Archimedes' principle","flotation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonsubmergibility\" is a specialized term that describes the ability of something to stay afloat and not sink. It's mostly used in technical fields like engineering when talking about boats or submarines. Because it's a long and uncommon word, it's not used in everyday conversation."},"example_sentences":[{"sentence":"The high degree of nonsubmergibility allowed the life raft to support many passengers.","translation":"高い不沈性により、その救命いかだは多くの乗客を支えることができた。","type":"noun","meaning_category":"不沈性"}]}