{"word":"Batruk","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Historical) A hostage, typically a son of a tribal leader, given as a guarantee of good faith or loyalty, especially among the Circassians.","english_definition":"(Historical) A hostage, typically a son of a tribal leader, given as a guarantee of good faith or loyalty, especially among the Circassians.","examples":[{"sentence":"The Circassian chiefs often sent their sons as batruks to the Russian court as a sign of submission.","translation":"チェルケス人の首長たちは、服従の証として息子たちをバトルクとしてロシアの宮廷に送ることが多かった。"}],"collocations":["send a batruk","become a batruk"],"synonyms":["hostage","pledge","guarantee"],"antonyms":[]}],"etymology":{"value":"From Circassian (Adyghe) бэтрыкъу (bɛtrɨqʷə), meaning 'companion, friend'.","priority":"★★☆"},"pronunciation":{"ipa":"/bæˈtrʊk/","syllables":"Ba-truk"},"inflection":{"noun_plural":"batruks"},"usage_notes":{"explanation":"The term 'batruk' is primarily used in historical contexts when discussing the relationships between the Russian Empire and various tribal groups, particularly the Circassians, in the 18th and 19th centuries. It highlights a specific form of political and social interaction involving the exchange of hostages as a means of ensuring peace or allegiance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a batruk for the king.","correct":"✓ He was sent as a batruk to the king's court.","note":"The term 'batruk' describes the role or status of the hostage, not a direct relationship 'for' someone. It's more accurate to say someone was 'sent as a batruk'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["amanat (similar concept in other cultures)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily a historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Batruk' is a specialized historical term. Understanding requires knowledge of 18th-19th century Russian-Circassian relations. The concept involves complex political and social dynamics related to hostage-taking as a form of diplomacy and control.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The young prince was offered as a batruk to ensure the treaty's enforcement.","translation":"若い王子は、条約の履行を確実にするためにバトルクとして差し出された。","type":"noun","meaning_category":"hostage"},{"sentence":"Life as a batruk in a foreign court was often fraught with uncertainty and political intrigue.","translation":"外国の宮廷でのバトルクとしての生活は、しばしば不安定さと政治的陰謀に満ちていた。","type":"noun","meaning_category":"hostage"}]}