{"word":"Discontinuances","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 中止、中断、打ち切り、中断されたもの、廃止されたもの","english_definition":"(plural form) Cessations; terminations; instances of something being discontinued.","examples":[{"sentence":"The discontinuances of the project were due to lack of funding.","translation":"そのプロジェクトの中止は資金不足が原因だった。"},{"sentence":"We reviewed the list of discontinuances to identify potential cost savings.","translation":"潜在的なコスト削減を特定するために、打ち切りリストを見直した。"},{"sentence":"The discontinuances of certain product lines allowed the company to focus on its core offerings.","translation":"特定の製品ラインの廃止により、会社は中核的な製品に集中することができた。"}],"collocations":["project discontinuances (プロジェクトの中止)","product discontinuances (製品の廃止)","service discontinuances (サービスの中断)","program discontinuances (プログラムの中止)"],"synonyms":["cessations","terminations","interruptions","suspensions","abolitions","endings"],"antonyms":["continuations","beginnings","commencements","establishments"]}],"etymology":{"value":"The word 'discontinuance' is derived from 'discontinue,' which comes from the prefix 'dis-' (meaning 'not' or 'opposite of') and 'continue' (meaning 'to proceed' or 'to persist'). Therefore, 'discontinuance' refers to the act or state of not continuing something.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˌkɒntɪˈnjuːənsɪz/","syllables":"dis-con-tin-u-an-ces"},"inflection":{"noun_plural":"Discontinuances"},"usage_notes":{"explanation":"'Discontinuances' is the plural form of 'discontinuance,' referring to multiple instances of something being stopped or terminated. It is often used in business, legal, or administrative contexts to describe the cessation of projects, services, or processes. The term implies a deliberate act of stopping something that was previously ongoing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The discontinuance were announced yesterday.","correct":"✓ The discontinuances were announced yesterday.","note":"Since we're talking about multiple instances of something being discontinued, the plural form 'discontinuances' should be used with the plural verb 'were'."},{"incorrect":"✗ The discontinuances of the project was a surprise.","correct":"✓ The discontinuances of the project were a surprise.","note":"'Discontinuances' is plural, so it requires the plural verb 'were'."}],"priority":"★★☆"},"related_words":{"derivatives":["discontinue (verb: 中止する、中断する、廃止する)","discontinued (adjective: 中止された、廃止された)","continuance (noun: 継続、続行)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Discontinuances' is a formal term referring to multiple instances where something has been stopped or terminated. It's often used in professional or administrative contexts when discussing the cessation of projects, services, or product lines. The word implies a deliberate decision to end something that was previously in progress. Due to its specific and formal usage, it's more commonly found in written documents and professional discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The company announced several product discontinuances due to low sales.","translation":"会社は、売上不振のため、いくつかの製品の廃止を発表した。","type":"noun","meaning_category":"中止、廃止"},{"sentence":"The discontinuances of these programs will free up resources for new initiatives.","translation":"これらのプログラムの中止により、新しいイニシアチブのためのリソースが解放される。","type":"noun","meaning_category":"中止、中断"},{"sentence":"A detailed report outlined the reasons for the project discontinuances.","translation":"詳細な報告書には、プロジェクト中止の理由が概説されていた。","type":"noun","meaning_category":"中止、中断"}]}