{"word":"horsefight","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A traditional sport, primarily found in certain regions of Asia, where horses are pitted against each other in a fight.","english_definition":"A sport in which horses fight each other, typically for entertainment or cultural purposes.","examples":[{"sentence":"Horsefight is a popular event during local festivals in some parts of the Philippines.","translation":"ホースファイトは、フィリピンの一部の地域における地元の祭りで人気のあるイベントです。"},{"sentence":"Animal rights activists often protest against horsefights due to concerns about animal cruelty.","translation":"動物愛護活動家は、動物虐待の懸念から、ホースファイトに抗議することがよくあります。"}],"collocations":["attend a horsefight","organize a horsefight","ban horsefights","horsefight tournament"],"synonyms":["horse fighting","equine combat"],"antonyms":[]}],"etymology":{"value":"Combination of 'horse' and 'fight', describing the activity where horses are made to fight.","priority":"Medium"},"pronunciation":{"ipa":"/ˈhɔːrsfaɪt/","syllables":"horse-fight"},"inflection":{"noun_plural":"horsefights"},"usage_notes":{"explanation":"The term 'horsefight' is typically used to describe a specific type of animal fighting sport. It is important to note that such activities are controversial and often illegal due to animal welfare concerns.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dogfight with horses.","correct":"✓ I saw a horsefight.","note":"'Horsefight' specifically refers to fights between horses, not other animals."}],"priority":"Medium"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Low","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Horsefight' refers to a specific type of animal fighting, which may not be widely known or discussed. The term itself is straightforward, but understanding the context and ethical implications requires a higher level of comprehension."},"example_sentences":[{"sentence":"The annual horsefight drew a large crowd of spectators.","translation":"毎年恒例のホースファイトには、多くの観客が集まりました。","type":"noun","meaning_category":"sport"},{"sentence":"Many people consider horsefight to be a cruel and inhumane practice.","translation":"多くの人々は、ホースファイトを残酷で非人道的な行為だと考えています。","type":"noun","meaning_category":"ethical concerns"}]}