{"word":"fruitarianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"果食主義、フルータリアニズム：植物性の食物のうち、主に果実、種子、ナッツ、および植物が傷つかない方法で収穫できるその他の植物性食品を食べる食事法。","english_definition":"A diet consisting primarily of fruits, seeds, nuts, and other plant-based foods that can be harvested without harming the plant.","examples":[{"sentence":"Fruitarianism is a very restrictive diet.","translation":"果食主義は非常に制限の多い食事法です。"},{"sentence":"Some people choose fruitarianism for ethical reasons.","translation":"倫理的な理由で果食主義を選ぶ人もいます。"},{"sentence":"A fruitarian diet typically excludes grains and most vegetables.","translation":"果食主義の食事は通常、穀物とほとんどの野菜を除外します。"}],"collocations":["strict fruitarianism (厳格な果食主義)","ethical fruitarianism (倫理的な果食主義)","practice fruitarianism (果食主義を実践する)","adopt fruitarianism (果食主義を採用する)"],"synonyms":["fruitarian diet","fruitarian lifestyle"],"antonyms":["omnivorism","vegetarianism","veganism"]}],"etymology":{"value":"\"fruit\"（果物）と \"-arian\"（～主義者）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/fruːˈtɛəriənɪzəm/","syllables":"fru-i-tar-i-an-i-sm"},"inflection":{"noun_plural":"fruitarianisms"},"usage_notes":{"explanation":"Fruitarianism is a highly restrictive form of dietary practice often motivated by ethical or environmental concerns. It is distinct from veganism and vegetarianism, as it further limits the types of plant-based foods consumed. A fruitarian diet typically includes fruits (botanical definition), nuts, seeds, and sometimes foods like tomatoes, avocados, and some legumes, but excludes grains, most vegetables, and any animal products.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Fruitarianism is the same as veganism.","correct":"✓ Fruitarianism is more restrictive than veganism.","note":"Fruitarianism is a subset of veganism but has stricter rules. Not all vegans are fruitarians."},{"incorrect":"✗ Fruitarians can eat any type of fruit and vegetable.","correct":"✓ Fruitarians primarily eat fruits, nuts, and seeds, and avoid most vegetables.","note":"Fruitarians avoid vegetables that require harming the plant to harvest."}],"priority":"★★☆"},"related_words":{"derivatives":["fruitarian (noun: 果食主義者, adjective: 果食主義の)"],"phrasal_verbs":[],"related_concepts":["veganism","vegetarianism","raw veganism","ethical eating","plant-based diet"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Fruitarianism is a specific and uncommon diet where people mainly eat fruits, nuts, and seeds. This diet is more restrictive than veganism or vegetarianism because it avoids foods that would harm the plant when harvested. It's often chosen for ethical reasons. The word itself is formed by combining 'fruit' and '-arian,' indicating a person who follows this diet."},"example_sentences":[{"sentence":"She adopted fruitarianism after learning about sustainable harvesting practices.","translation":"彼女は持続可能な収穫方法について学んだ後、果食主義を採用しました。","type":"general","meaning_category":"Dietary practice"},{"sentence":"The fruitarian diet is often deficient in certain essential nutrients.","translation":"果食主義の食事は、特定の必須栄養素が不足しがちです。","type":"health","meaning_category":"Nutritional aspects"},{"sentence":"Some fruitarians include tomatoes and avocados in their diet.","translation":"一部の果食主義者は、トマトやアボカドを食事に取り入れています。","type":"food","meaning_category":"Food inclusion"}]}