{"word":"macroergate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A chemical compound that releases a large amount of free energy upon hydrolysis, especially one used in muscular contraction.","english_definition":"A compound whose hydrolysis releases a large amount of free energy, useful for driving biological processes.","examples":[{"sentence":"ATP is a macroergate that provides energy for muscle contraction.","translation":"ATPは筋肉収縮のエネルギーを提供するマクロエルゲートです。"}],"collocations":["high-energy phosphate bond","energy currency"],"synonyms":["high-energy compound"],"antonyms":[]}],"etymology":{"value":"From 'macro-' (large) + 'erg' (unit of energy) + '-ate' (chemical suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmækroʊˈɜːrɡeɪt/","syllables":"mac-ro-er-gate"},"inflection":{"noun_plural":"macroergates"},"usage_notes":{"explanation":"Macroergates are essential in biochemistry for energy transfer. They are characterized by having high-energy bonds that, when broken, release a significant amount of energy that can be used to drive other reactions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Macroergates are only used in muscle cells.","correct":"✓ Macroergates are used in various cells for energy transfer.","note":"Macroergates are not limited to muscle cells; they are used throughout the body for various energy-requiring processes."}],"priority":"★★☆"},"related_words":{"derivatives":["macroergic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Macroergate' is a technical term used in biochemistry to describe compounds that release a large amount of energy when hydrolyzed. These compounds are crucial for driving various biological processes, such as muscle contraction and nerve impulse transmission. Understanding this term requires a background in chemistry and biology."},"example_sentences":[{"sentence":"Creatine phosphate is another example of a macroergate used in muscle cells.","translation":"クレアチンリン酸は、筋肉細胞で使用されるマクロエルゲートの別の例です。","type":"noun","meaning_category":"Chemical compound"},{"sentence":"The hydrolysis of macroergates is essential for cellular function.","translation":"マクロエルゲートの加水分解は、細胞機能に不可欠です。","type":"noun","meaning_category":"Chemical compound"}]}