{"word":"enlarger","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)引伸機","english_definition":"A photographic instrument used to project an enlarged image from a negative or transparency onto sensitized paper.","examples":[{"sentence":"He used an enlarger to make a large print from the small negative.","translation":"彼は引伸機を使って、小さなネガから大きなプリントを作成した。"},{"sentence":"The darkroom was equipped with several enlargers of different sizes.","translation":"暗室には、さまざまなサイズの引伸機がいくつか備え付けられていた。"}],"collocations":["photographic enlarger","darkroom enlarger","use an enlarger","set up an enlarger"],"synonyms":["projector","photo printer"],"antonyms":[]}],"etymology":{"value":"The word 'enlarger' is derived from the verb 'enlarge,' which comes from the Old French 'eslargir,' meaning 'to widen, extend.' The suffix '-er' is added to denote an instrument or device that performs the action of enlarging.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈlɑːrdʒər/","syllables":"en-larg-er"},"inflection":{"noun_plural":"enlargers"},"usage_notes":{"explanation":"An enlarger is a specialized piece of equipment used in photography, primarily in traditional darkroom settings. It projects light through a negative onto photographic paper, allowing for the creation of prints larger than the original negative. Digital enlargers also exist, but the term is most commonly associated with analog photography.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a projector to enlarge the photo.","correct":"✓ I used an enlarger to enlarge the photo.","note":"While a projector can display images, an enlarger is specifically designed for photographic printing and offers greater control over image quality and exposure."}],"priority":"★☆☆"},"related_words":{"derivatives":["enlarge (verb)","enlargement (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'enlarger' refers to a specific tool used in traditional photography for creating prints from film negatives. Understanding this term requires some familiarity with the processes of analog photography and darkroom work. While the concept is relatively straightforward, its usage is limited to contexts involving film photography. Therefore, its readability is geared towards individuals with some technical knowledge in this area."},"example_sentences":[{"sentence":"The photographer carefully adjusted the focus on the **enlarger**.","translation":"写真家は引伸機の焦点を慎重に調整した。","type":"noun","meaning_category":"photographic instrument"},{"sentence":"He learned how to use an **enlarger** in his photography class.","translation":"彼は写真の授業で引伸機の使い方を学んだ。","type":"noun","meaning_category":"photographic instrument"}]}