{"word":"nonvenally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非買収的に、金銭に左右されずに","english_definition":"In a way that is not influenced by bribery or corruption; without being motivated by financial gain.","examples":[{"sentence":"He acted nonvenally, refusing any bribes to influence his decision.","translation":"彼は非買収的に行動し、彼の決定に影響を与えるためのいかなる賄賂も拒否した。"},{"sentence":"The judge was known for judging cases nonvenally, ensuring fairness and justice.","translation":"その裁判官は、公平性と正義を確保するために、事件を非買収的に判断することで知られていた。"}],"collocations":["act nonvenally","judge nonvenally","decide nonvenally"],"synonyms":["impartially","fairly","justly","honestly","ethically","uprightly"],"antonyms":["venally","corruptly","dishonestly"]}],"etymology":{"value":"Derived from \"venal\" (corruptible, able to be bribed) with the prefix \"non-\" (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈviːnəli/","syllables":"non-ve-nal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb \"nonvenally\" describes actions or behaviors that are free from corruption or bribery. It emphasizes the absence of financial or other improper incentives in decision-making or conduct. It is often used to describe the behavior of officials, judges, or anyone in a position of power or trust.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He nonvenally accepted the gift.","correct":"✓ He accepted the gift without compromising his principles.","note":"If someone accepts a gift, it is difficult to describe that action as 'nonvenally' because it implies that the gift did not influence their behavior. Instead, you would need to rephrase to emphasize that their principles were not compromised."}],"priority":"★★☆"},"related_words":{"derivatives":["venal (adjective: corruptible, able to be bribed)","venality (noun: corruptibility, the state of being able to be bribed)"],"phrases":["act with integrity","uphold ethical standards"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonvenally\" is a formal and uncommon word that means \"in a way that is not corrupt or influenced by bribery.\" It is used to describe actions that are done with integrity and without being motivated by financial gain. Because it is a relatively rare word, it is more likely to be encountered in legal or academic contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The audit was conducted nonvenally, ensuring an unbiased assessment of the company's finances.","translation":"監査は非買収的に実施され、会社の財務の偏りのない評価を保証した。","type":"adverb","meaning_category":"without bribery"},{"sentence":"She served the community nonvenally, dedicating her time and resources without seeking personal enrichment.","translation":"彼女は個人的な利益を求めることなく、時間と資源を捧げ、非買収的に地域社会に貢献した。","type":"adverb","meaning_category":"without financial gain"}]}