{"word":"subindicative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(文法)準指示的な、部分的に指示的な","english_definition":"(grammar) partially or secondarily indicative; having some but not all of the characteristics of the indicative mood.","examples":[{"sentence":"The use of 'would' in that sentence is subindicative, as it expresses both a condition and a potential outcome.","translation":"その文での'would'の使用は、条件と潜在的な結果の両方を表しているため、準指示的です。"}],"collocations":["subindicative mood","subindicative verb form"],"synonyms":["partially indicative","quasi-indicative"],"antonyms":["indicative","subjunctive"]}],"etymology":{"value":"'sub-' (下位の、部分的な) + 'indicative' (指示的な) から構成される。文法用語として、完全な指示法ではないが、指示法的な要素を持つことを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbɪnˈdɪkətɪv/","syllables":"sub-in-di-ca-tive"},"inflection":{"notes":"比較変化なし"},"usage_notes":{"explanation":"'subindicative' は文法用語であり、動詞のムードや形式が完全に指示的ではないが、指示的な要素を含んでいる場合に使用されます。これは、条件節や仮定的な状況を表す文脈でよく見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subindicative mood is always used for factual statements.","correct":"✓ The indicative mood is always used for factual statements.","note":"指示法は事実を述べるために使用され、準指示法は部分的に指示的な要素を持つ文で使用されます。"},{"incorrect":"✗ Use subindicative when you are certain about something.","correct":"✓ Use indicative when you are certain about something.","note":"確信がある場合は指示法を使用します。準指示法は不確実性や条件を示唆します。"}],"priority":"★★☆"},"related_words":{"derivatives":["subindication (名詞: 準指示)"],"related_terms":["indicative mood","subjunctive mood","conditional mood"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文法用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subindicative' is a highly specialized grammatical term used to describe a verb form or mood that partially exhibits the characteristics of the indicative mood. It's typically encountered in advanced grammatical discussions or linguistic analyses, particularly when dealing with conditional or hypothetical constructions. Understanding this term requires a solid foundation in grammatical terminology and concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The conditional clause uses a subindicative form to express a possible outcome.","translation":"条件節は、起こりうる結果を表すために準指示的な形式を使用します。","type":"adjective","meaning_category":"文法"},{"sentence":"The verb's tense in this sentence is not purely indicative, but rather subindicative due to the element of uncertainty.","translation":"この文の動詞の時制は純粋に指示的ではなく、不確実性の要素があるため、むしろ準指示的です。","type":"adjective","meaning_category":"文法"}]}