{"word":"Venn","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ベン図","english_definition":"A diagram representing mathematical or logical sets pictorially as circles or other closed curves within an enclosing rectangle (the universal set), common elements of the sets being represented by the areas of overlap between the circles, etc.","examples":[{"sentence":"A Venn diagram is a useful tool for visualizing set relationships.","translation":"ベン図は、集合の関係を視覚化するのに役立つツールです。"},{"sentence":"We used a Venn diagram to compare and contrast the two novels.","translation":"私たちは2つの小説を比較対照するためにベン図を使いました。"}],"collocations":["Venn diagram","draw a Venn diagram","use a Venn diagram","three-circle Venn diagram"],"synonyms":["set diagram","logic diagram"],"antonyms":[]}],"etymology":{"value":"Named after John Venn (1834–1923), a British logician and philosopher who popularized the diagram in 1880.","priority":"★★★"},"pronunciation":{"ipa":"/vɛn/","syllables":"Venn"},"inflection":{"noun_plural":"Venn diagrams"},"usage_notes":{"explanation":"'Venn' is almost exclusively used in the context of 'Venn diagram'. It refers to a specific type of diagram used in mathematics, logic, statistics, computer science, and business to show relationships between sets.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I created a Venn to show the data.","correct":"✓ I created a Venn diagram to show the data.","note":"Always use 'Venn diagram' unless the context makes it absolutely clear that you are referring to a Venn diagram."}],"priority":"★★☆"},"related_words":{"derivatives":["Venn diagram"],"related_terms":["set theory","set","intersection","union","complement","Euler diagram"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'Venn' is primarily encountered in academic or technical contexts, specifically when discussing set theory, logic, or data analysis. Understanding the concept of sets and their relationships is necessary to fully grasp the meaning and application of a Venn diagram. The term itself is straightforward, but its usage implies a certain level of familiarity with mathematical or logical concepts."},"example_sentences":[{"sentence":"The **Venn diagram** clearly showed the overlap between the two groups.","translation":"ベン図は、2つのグループ間の重複を明確に示していました。","type":"noun","meaning_category":"ベン図"},{"sentence":"She explained the concept of set theory using a **Venn diagram**.","translation":"彼女はベン図を使って集合論の概念を説明しました。","type":"noun","meaning_category":"ベン図"},{"sentence":"We used a three-circle **Venn diagram** to analyze the survey results.","translation":"私たちはアンケートの結果を分析するために3つの円を使ったベン図を使いました。","type":"noun","meaning_category":"ベン図"}]}