{"word":"unprojected","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"投影されていない、映写されていない","english_definition":"Not projected; not thrown or cast forward; not shown on a screen or surface.","examples":[{"sentence":"The unprojected image remained hidden within the device.","translation":"投影されていない画像は、デバイスの中に隠されたままだった。"},{"sentence":"He analyzed the unprojected data to find underlying patterns.","translation":"彼は投影されていないデータを分析して、根本的なパターンを見つけようとした。"},{"sentence":"The unprojected light source was surprisingly bright.","translation":"投影されていない光源は、驚くほど明るかった。"}],"collocations":["unprojected image","unprojected data","unprojected light"],"synonyms":["unshown","unrevealed","untransmitted"],"antonyms":["projected","shown","displayed"]}],"etymology":{"value":"The word 'unprojected' is formed by adding the prefix 'un-' (meaning 'not') to the word 'projected'. 'Projected' itself comes from the verb 'project', which originates from the Latin word 'proiectus', the past participle of 'proicere' (to throw forth).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnprəˈdʒektɪd/","syllables":"un-pro-ject-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Unprojected' is used to describe something that has not been projected, either in a literal sense (like an image not shown on a screen) or in a more abstract sense (like data that has not been extrapolated or predicted). It often implies that something is in its original or raw state, before being presented or manipulated in some way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unprojected film was still in the can.","correct":"✓ The unprojected film was still in the can.","note":"The sentence is already correct. 'Unprojected' accurately describes a film that has not been shown. There are no common mistakes associated with this word."}],"priority":"★☆☆"},"related_words":{"derivatives":["project (verb, noun)","projection (noun)","projector (noun)"],"antonyms":["projected"],"related_concepts":["optics","visualization","data analysis"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unprojected' is a relatively uncommon term, typically used in technical or specialized contexts. It describes something that has not been shown or displayed, often referring to images, data, or light. Understanding the root word 'project' and the prefix 'un-' is essential for grasping its meaning. It is more likely to be encountered in academic or professional settings dealing with visual or analytical processes."},"example_sentences":[{"sentence":"The scientist studied the unprojected satellite images to identify anomalies.","translation":"科学者は、異常を特定するために、投影されていない衛星画像を研究した。","type":"adjective","meaning_category":"Not displayed"},{"sentence":"The unprojected sales figures offered a different perspective on the company's performance.","translation":"投影されていない売上高は、会社の業績について異なる視点を提供した。","type":"adjective","meaning_category":"Not predicted"},{"sentence":"The museum displayed the unprojected slides alongside the final presentation.","translation":"博物館は、最終プレゼンテーションと並んで、投影されていないスライドを展示した。","type":"adjective","meaning_category":"Not shown"}]}