{"word":"re-image","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(コンピュータの)イメージを再作成する、再インストールする","english_definition":"to create a new image of (a computer system), typically by reinstalling the operating system and applications.","examples":[{"sentence":"The IT department had to re-image my computer after it was infected with a virus.","translation":"IT部門は、私のコンピュータがウイルスに感染した後、再イメージ化する必要がありました。"},{"sentence":"Re-imaging the hard drive is the quickest way to fix many software problems.","translation":"ハードドライブを再イメージ化することは、多くのソフトウェアの問題を修正する最も迅速な方法です。"},{"sentence":"Before you re-image your computer, be sure to back up all your important files.","translation":"コンピュータを再イメージ化する前に、必ずすべての重要なファイルをバックアップしてください。"}],"collocations":["re-image a computer","re-image a hard drive","re-image a system","re-image a machine"],"synonyms":["reinstall","restore","reset","refresh"],"antonyms":["backup","image"],"related_terms":["image","disk image","system image","ghosting","deployment"],"domain":"computing","notes":"This term is primarily used in the context of computer systems and IT support.","priority":"★★★"}],"etymology":{"value":"The prefix 're-' means 'again' or 'anew'. 'Image' refers to a complete snapshot of a computer system's software and data. Therefore, 're-image' means to create a new image or restore the system to a previous image.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɪmɪdʒ/","syllables":"ree-im-idge"},"inflection":{"verb_forms":{"present_simple":["re-image","re-images"],"past_simple":"re-imaged","past_participle":"re-imaged","present_participle":"re-imaging"}},"usage_notes":{"explanation":"'Re-image' is a verb specific to the field of computing. It describes the process of completely wiping a computer's hard drive and reinstalling the operating system, drivers, and applications from a backup image. This is often done to resolve severe software issues, remove malware, or standardize systems across an organization. It's a more drastic measure than simply reinstalling individual programs or restoring from a backup, as it overwrites the entire system partition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to re-image my photo.","correct":"✓ I need to edit my photo.","note":"'Re-image' is used for computer systems, not for editing photos or other types of images."},{"incorrect":"✗ Re-imaging the computer will save my files.","correct":"✓ Re-imaging the computer will erase my files. Back them up first.","note":"Re-imaging erases all data on the hard drive. Always back up important files before re-imaging."}],"priority":"★★☆"},"related_words":{"derivatives":["re-imaging (noun: the process of re-imaging)"],"related_terms":["ghosting (creating a disk image)","disk cloning (copying the contents of one hard drive to another)","system recovery (restoring a system to a previous state)","factory reset (returning a device to its original factory settings)"],"priority":"★★☆"},"level_frequency":{"level":"Technical/IT","frequency_google_ngram":"Low (specific to IT contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 're-image' is a technical term used in the field of computing. It refers to the process of completely erasing a computer's hard drive and reinstalling the operating system and other software from a backup image. This is typically done to fix serious software problems or to standardize computer systems. It's important to understand that re-imaging will erase all data on the hard drive, so it's crucial to back up important files beforehand. This term is not commonly used in everyday conversation and is primarily encountered in IT-related contexts."},"example_sentences":[{"sentence":"We had to **re-image** all the laptops in the lab after the network was compromised.","translation":"ネットワークが侵害された後、研究室のすべてのラップトップを再イメージ化する必要がありました。","type":"verb","meaning_category":"再インストールする"},{"sentence":"The technician suggested that I **re-image** my computer to get rid of the persistent malware.","translation":"技術者は、永続的なマルウェアを駆除するために、コンピュータを再イメージ化することを提案しました。","type":"verb","meaning_category":"再インストールする"},{"sentence":"**Re-imaging** is often the fastest way to resolve complex software issues.","translation":"再イメージ化は、多くの場合、複雑なソフトウェアの問題を解決する最も速い方法です。","type":"noun (gerund)","meaning_category":"再インストール"}],"tags":["computing","IT","technical"]}