{"word":"dandy-brush","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(馬の手入れ用)仕上げブラシ、柔らかいブラシ","english_definition":"a grooming brush with soft bristles, used especially on horses to remove dust and smooth the coat after using a curry comb.","examples":[{"sentence":"After currying the horse, use a dandy-brush to remove the remaining dirt and smooth the coat.","translation":"馬を梳いた後、残った汚れを取り除き、毛並みを整えるために仕上げブラシを使ってください。"},{"sentence":"The dandy-brush is gentler than a curry comb and is used for the final grooming touches.","translation":"仕上げブラシは、梳き櫛よりも優しく、最後の仕上げの手入れに使用されます。"}],"collocations":["use a dandy-brush","soft dandy-brush","horse dandy-brush","grooming with a dandy-brush"],"synonyms":["soft brush","grooming brush"],"antonyms":["curry comb"]}],"etymology":{"value":"The term 'dandy' in 'dandy-brush' likely refers to the brush's function in making the horse look 'dandy' or well-groomed. The term 'dandy' itself, referring to a man unduly devoted to style, emerged in the late 18th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdændiˌbrʌʃ/","syllables":"dan-dy-brush"},"inflection":{"noun_plural":"dandy-brushes"},"usage_notes":{"explanation":"A 'dandy-brush' is specifically used for grooming horses. It is typically used after a curry comb to remove loose hair, dirt, and debris and to smooth the horse's coat. It is not generally used on other animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a dandy-brush on my dog.","correct":"✓ I used a brush on my dog.","note":"Dandy-brushes are primarily for horses; use a regular brush for dogs."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["curry comb","grooming kit","horse grooming","brush","stable"],"priority":"★★☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dandy-brush' is specialized vocabulary related to horse grooming. It is unlikely to be encountered outside of contexts involving horses or equestrian activities. Understanding of the term requires familiarity with horse care practices."},"example_sentences":[{"sentence":"She carefully used the dandy-brush to remove any lingering dust from the horse's coat.","translation":"彼女は、馬の毛並みに残った埃を丁寧に取り除くために、仕上げブラシを使った。","type":"noun","meaning_category":"grooming"},{"sentence":"The dandy-brush is an essential tool in any horse grooming kit.","translation":"仕上げブラシは、あらゆる馬の手入れ用キットに不可欠な道具です。","type":"noun","meaning_category":"grooming"}]}