{"word":"loanword-poor","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"外国語からの借用語が少ない、またはほとんどない","english_definition":"Having few or no loanwords (words adopted from another language).","examples":[{"sentence":"The language is relatively loanword-poor, preserving much of its native vocabulary.","translation":"その言語は比較的に借用語が少なく、多くの固有の語彙を保持しています。"},{"sentence":"Compared to English, Japanese is loanword-poor in certain domains.","translation":"英語と比較して、日本語はある分野では借用語が少ないです。"}],"collocations":["relatively loanword-poor","historically loanword-poor"],"synonyms":["native-rich","endogenous","autochthonous"],"antonyms":["loanword-rich","exogenous"],"notes":"This term is often used in linguistic discussions."}],"etymology":{"value":"Compound word formed from 'loanword' (a word borrowed from another language) and 'poor' (lacking).","priority":"N/A"},"pronunciation":{"ipa":"/ˈloʊnˌwɜːrd pʊr/","syllables":"loan-word poor"},"inflection":{"notes":"Adjective; comparative and superlative forms (more loanword-poor, most loanword-poor) are possible but not common."},"usage_notes":{"explanation":"The term 'loanword-poor' is used to describe languages that have resisted borrowing words from other languages, or where the borrowed words make up a relatively small proportion of the total vocabulary. This can be due to various factors, such as a strong sense of linguistic purism, geographical isolation, or a rich native vocabulary that adequately covers most concepts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The language is loanword-poorer than English.","correct":"✓ The language is more loanword-poor than English.","note":"While 'loanword-poor' is an adjective, it's generally better to use 'more loanword-poor' for the comparative form, although 'loanword-poorer' is sometimes used."}],"priority":"N/A"},"related_words":{"derivatives":["loanword (noun)","poor (adjective)"],"related_terms":["linguistic purism","language contact","borrowing","nativism"],"priority":"N/A"},"level_frequency":{"notes":"This is a technical term used in linguistics, so its frequency is low outside of academic contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Loanword-poor' is a term used in linguistics to describe a language that has relatively few words borrowed from other languages. It's the opposite of 'loanword-rich'. You might encounter this term when reading about language history, language contact, or linguistic purism. It implies that the language has either actively resisted borrowing or simply has not needed to borrow extensively due to a rich native vocabulary."},"example_sentences":[{"sentence":"Icelandic is often cited as an example of a relatively **loanword-poor** language.","translation":"アイスランド語は、比較的借用語が少ない言語の例としてよく挙げられます。","type":"adjective","meaning_category":"Describing a language with few loanwords"},{"sentence":"Efforts to maintain a **loanword-poor** vocabulary are sometimes seen as a form of linguistic nationalism.","translation":"借用語の少ない語彙を維持しようとする努力は、言語ナショナリズムの一形態と見なされることがあります。","type":"adjective","meaning_category":"Describing efforts to limit loanwords"}]}