{"word":"anarchisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アナーキズム（無政府主義）の複数の形態、または特定の学説や運動","english_definition":"plural of anarchism; various forms of anarchism, or specific doctrines or movements within anarchism.","examples":[{"sentence":"Different anarchisms offer varying solutions to societal problems.","translation":"様々なアナーキズムは、社会問題に対して異なる解決策を提示する。"},{"sentence":"The history of anarchisms is complex and diverse.","translation":"アナーキズムの歴史は複雑で多様である。"}],"collocations":["types of anarchisms","history of anarchisms","schools of anarchisms"],"synonyms":["libertarian socialism","autonomism","mutualism","individualist anarchism","collectivist anarchism"],"antonyms":["statism","authoritarianism","totalitarianism"]}],"etymology":{"value":"anarchism + -s (plural suffix)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈænərkɪzəmz/","syllables":"an-ar-chis-ms"},"inflection":{"noun_plural":"anarchisms"},"usage_notes":{"explanation":"'Anarchisms' is used to refer to the diverse range of theories, practices, and historical movements that fall under the umbrella of anarchism. It highlights the internal variety and disagreements within anarchism, rather than presenting it as a monolithic ideology.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anarchism are different.","correct":"✓ The anarchisms are different.","note":"When referring to multiple types or schools of thought within anarchism, use the plural form 'anarchisms'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["anarchism","anarchist","anarchistic"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Anarchisms' is a plural noun referring to the different forms, theories, and movements within anarchism. It's used in academic or political contexts when discussing the diversity of anarchist thought. Understanding this term requires familiarity with the basic concepts of anarchism and its various branches."},"example_sentences":[{"sentence":"A comparative study of anarchisms reveals significant differences in their proposed social structures.","translation":"アナーキズムの比較研究は、提案された社会構造に大きな違いがあることを明らかにしている。","type":"general"},{"sentence":"The debates among different anarchisms often revolve around the role of organization and strategy.","translation":"異なるアナーキズム間の議論は、組織と戦略の役割を中心に展開されることが多い。","type":"general"}]}