{"word":"quasi-proudly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ほとんど誇らしげに、いくらか誇らしげに","english_definition":"In a manner that is somewhat or seemingly proud.","examples":[{"sentence":"He quasi-proudly displayed his amateur artwork.","translation":"彼はほとんど誇らしげに彼のアマチュアの芸術作品を展示した。"},{"sentence":"She quasi-proudly admitted her mistake, as if it were a badge of honor.","translation":"彼女はまるでそれが名誉の印であるかのように、いくらか誇らしげに自分の過ちを認めた。"}],"collocations":[],"synonyms":["somewhat proudly","seemingly proudly","almost proudly"],"antonyms":["humbly","unassumingly"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning \"resembling\" or \"somewhat\") with the adverb \"proudly.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ˈpraʊdli/","syllables":"quasi-proud-ly"},"inflection":{},"usage_notes":{"explanation":"The adverb \"quasi-proudly\" is used to describe an action or statement that is done or said in a way that suggests pride, but not entirely or genuinely. It implies a sense of reservation, irony, or self-awareness that prevents the person from being fully proud.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["quasi- (prefix)","proudly (adverb)","proud (adjective)"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word \"quasi-proudly\" is a relatively uncommon adverb used to describe a manner that is somewhat or seemingly proud, but not entirely genuine. It is formed by combining the prefix \"quasi-\" (meaning \"resembling\" or \"somewhat\") with the adverb \"proudly.\" Due to its nuanced meaning and infrequent usage, it is more likely to be encountered in advanced or literary contexts."},"example_sentences":[{"sentence":"The cat quasi-proudly presented the dead mouse to its owner.","translation":"その猫はほとんど誇らしげに死んだネズミを飼い主に差し出した。","type":"example","meaning_category":"manner of action"},{"sentence":"He quasi-proudly recounted the story of his near-disaster.","translation":"彼はいくらか誇らしげに、彼が経験した危うい災難の話を語った。","type":"example","meaning_category":"manner of speech"}]}