{"word":"Apozemical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語)煎じ薬の、煎じ薬に関する","english_definition":"(archaic) Pertaining to or of the nature of an apozem.","examples":[{"sentence":"The apozemical herbs were carefully selected for their medicinal properties.","translation":"その煎じ薬のハーブは、薬効のために注意深く選ばれました。"}],"collocations":["apozemical herbs","apozemical preparation"],"synonyms":["decoctive","medicinal","pharmaceutical"],"antonyms":[]}],"etymology":{"value":"Derived from 'apozem', which comes from the Greek 'apozema' (ἀπόζεμα), meaning 'decoction' or 'infusion'. The suffix '-ical' indicates pertaining to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæpəˈzɛmɪkəl/","syllables":"A-po-zem-i-cal"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Apozemical' is an archaic term primarily found in historical medical texts. It refers to anything related to or having the characteristics of an apozem, which is a medicinal decoction or infusion made by boiling herbs or other substances in water. The term is rarely used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The apozemical properties of the compound were unknown.","correct":"✓ The medicinal properties of the compound were unknown.","note":"In modern context, 'medicinal' is a more common and understandable term than 'apozemical'."}],"priority":"★☆☆"},"related_words":{"derivatives":["apozem (noun: a medicinal decoction or infusion)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency - archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apozemical' is a highly specialized and archaic term, primarily encountered in historical or academic contexts related to medicine and herbal remedies. Understanding requires familiarity with historical medical practices and terminology. It is not part of contemporary English vocabulary. Use of this term is generally discouraged in modern writing unless specifically discussing historical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old apothecary described the apozemical process for extracting the essence of the plant.","translation":"その老いた薬屋は、植物のエッセンスを抽出するための煎じ薬のプロセスを説明しました。","type":"adjective","meaning_category":"煎じ薬の"}]}