{"word":"self-exclusion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己排除、自主規制、自己隔離","english_definition":"The act of voluntarily excluding oneself from certain activities or environments, typically to address a problem behavior or protect oneself.","examples":[{"sentence":"He signed up for self-exclusion from all casinos in the state.","translation":"彼は州内のすべてのカジノから自己排除されるように申し込んだ。"},{"sentence":"Self-exclusion programs are designed to help people with gambling problems.","translation":"自己排除プログラムは、ギャンブル問題を抱える人々を支援するために設計されています。"},{"sentence":"She chose self-exclusion from social media to improve her mental health.","translation":"彼女は精神的な健康を改善するために、ソーシャルメディアからの自己隔離を選んだ。"}],"collocations":["self-exclusion program","self-exclusion agreement","voluntary self-exclusion","permanent self-exclusion","temporary self-exclusion"],"synonyms":["self-ban","voluntary exclusion","self-imposed restriction","self-isolation"],"antonyms":["participation","inclusion","engagement"]}],"etymology":{"value":"The term is formed by combining \"self\" (referring to oneself) and \"exclusion\" (the act of being excluded). It describes the action of excluding oneself from something.","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfɪkˈskluːʒən/","syllables":"self-ex-clu-sion"},"inflection":{"noun_plural":"self-exclusions"},"usage_notes":{"explanation":"\"Self-exclusion\" refers to a voluntary process where an individual chooses to be banned or excluded from certain activities or places. This is often used in the context of gambling, where individuals with gambling problems can request to be banned from casinos or online gambling sites. It can also apply to other areas, such as social media or certain social activities, where an individual might choose to exclude themselves for personal or mental health reasons. The key aspect is that the exclusion is self-initiated and voluntary.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a self-exclude from the casino.","correct":"✓ He signed up for self-exclusion from the casino.","note":"The correct phrase is \"sign up for self-exclusion\" or \"request self-exclusion.\""},{"incorrect":"✗ Self-exclusion is a good method to exclude yourself.","correct":"✓ Self-exclusion is a good method to exclude oneself.","note":"The reflexive pronoun should be \"oneself\" in formal contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["exclude","exclusion","self-imposed","voluntary"],"phrasal_verbs":[],"related_concepts":["responsible gambling","addiction treatment","behavioral therapy","harm reduction"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., gambling addiction).","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"\"Self-exclusion\" is a term that describes the act of someone voluntarily removing themselves from a particular activity or place. It's often used when people want to control a problem behavior, like gambling. For example, someone might sign up for a self-exclusion program at a casino, which means the casino will prevent them from entering. The idea is that by excluding themselves, they can avoid temptation and manage their behavior. It's a deliberate and voluntary action.","priority":"★★★"},"example_sentences":[{"sentence":"The casino offers a self-exclusion program for problem gamblers.","translation":"そのカジノは、ギャンブル依存症者向けの自己排除プログラムを提供しています。","type":"general"},{"sentence":"She decided on self-exclusion from the online forum to avoid arguments.","translation":"彼女は議論を避けるために、オンラインフォーラムから自己排除することに決めた。","type":"general"},{"sentence":"Self-exclusion can be a useful tool for managing addictive behaviors.","translation":"自己排除は、中毒性のある行動を管理するための有効なツールとなり得る。","type":"general"}]}