{"word":"divisibly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"割り切れるように、分割可能に","english_definition":"in a manner that allows something to be divided without a remainder; in a way that is divisible.","examples":[{"sentence":"The number 12 is divisibly by 2, 3, 4, and 6.","translation":"12という数字は、2、3、4、そして6で割り切れます。"},{"sentence":"The cake was cut divisibly into equal slices.","translation":"ケーキは等しい大きさに割り切れるようにカットされました。"}],"collocations":["divisibly by (～で割り切れる)","divisibly into (～に分割可能に)"],"synonyms":["evenly","equally","fractionally"],"antonyms":["indivisibly","unevenly"]}],"etymology":{"value":"The word \"divisibly\" is formed from the adjective \"divisible\" by adding the suffix \"-ly,\" which transforms it into an adverb. \"Divisible\" comes from the Latin word \"dividere,\" meaning \"to divide.\"","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈvɪzɪbli/","syllables":"di-vi-si-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb \"divisibly\" describes the manner in which something can be divided. It indicates that the division can be performed without leaving a remainder, or that something can be easily separated into distinct parts. It is most commonly used in mathematical contexts to describe numbers that can be divided evenly by other numbers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The land was divisibly between the heirs.","correct":"✓ The land was divided divisibly among the heirs.","note":"The correct usage is to use \"divisibly\" to describe *how* something is divided, not to replace the verb \"divided.\" It's better to use \"divided equally\" or \"divided evenly\" in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["divisible (adjective: 割り切れる、分割可能な)","divide (verb: 分ける、割る)","division (noun: 分割、割り算)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"divisibly\" is an adverb that indicates the manner in which something can be divided without leaving a remainder. It is often used in mathematical or technical contexts. Understanding its meaning requires a good grasp of mathematical concepts related to division and remainders. The word is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The inheritance was split divisibly among the siblings.","translation":"相続財産は兄弟間で割り切れるように分割されました。","type":"adverb","meaning_category":"分割可能に"},{"sentence":"The task force was organized divisibly into specialized units.","translation":"タスクフォースは、専門ユニットに割り切れるように編成されました。","type":"adverb","meaning_category":"分割可能に"},{"sentence":"The budget was allocated divisibly across different departments.","translation":"予算は各部署に割り切れるように配分されました。","type":"adverb","meaning_category":"分割可能に"}]}