{"word":"anocarpous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"果実を生じない、または偽果でない","english_definition":"(botany) Not producing fruit; or, not a pseudocarp.","examples":[{"sentence":"Anocarpous flowers do not develop into fruits.","translation":"無果実性の花は果実に発達しません。"},{"sentence":"The anocarpous nature of the plant is a distinguishing feature.","translation":"その植物の無果実性という性質は、際立った特徴です。"}],"collocations":["anocarpous flower","anocarpous plant"],"synonyms":["nonfruiting"],"antonyms":["carpous","fruiting"]}],"etymology":{"value":"Derived from the Greek words 'an-' (meaning 'without') and 'karpos' (meaning 'fruit').","priority":"★★★"},"pronunciation":{"ipa":"/ˌænoʊˈkɑːrpəs/","syllables":"a-no-car-pous"},"inflection":{"notes":"The word 'anocarpous' is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'anocarpous' is primarily used in botany to describe plants or flowers that do not produce fruit, or to differentiate true fruits from pseudocarps (false fruits). It is a technical term and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree is anocarpous because it has many fruits.","correct":"✓ The tree is not anocarpous because it has many fruits.","note":"Anocarpous means not producing fruit, so a tree with many fruits cannot be described as anocarpous."}],"priority":"★☆☆"},"related_words":{"derivatives":["anocarpy (noun: the state of being anocarpous)"],"related_terms":["pseudocarp (false fruit)","carpel (fruit-producing structure)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term, not in CEFR vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anocarpous' is a highly specialized botanical term used to describe plants that do not produce fruit or to distinguish true fruits from pseudocarps. Due to its technical nature, it is rarely encountered outside of scientific contexts. Understanding requires familiarity with basic botanical concepts such as fruit development and classification."},"example_sentences":[{"sentence":"The botanist identified the species as anocarpous based on the absence of fruit development.","translation":"植物学者は、果実の発達が見られないことから、その種を無果実性であると特定しました。","type":"general","meaning_category":"botany"},{"sentence":"Unlike many flowering plants, this variety remains anocarpous throughout its life cycle.","translation":"多くの顕花植物とは異なり、この品種はライフサイクル全体を通じて無果実性のままです。","type":"general","meaning_category":"botany"}]}