{"word":"Baronetize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"男爵位を授ける","english_definition":"To raise to the rank or dignity of a baronet.","examples":[{"sentence":"The Queen baronetized the prominent philanthropist for his contributions to society.","translation":"女王は、社会への貢献を理由に、著名な慈善家を男爵にした。"}],"collocations":["baronetize someone","be baronetized"],"synonyms":["ennoble","elevate","honor","title"],"antonyms":["degrade","demote"]}],"etymology":{"value":"From 'baronet' (a hereditary title of honour) + '-ize' (a suffix indicating the act of making or causing to be).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbærənətaɪz/","syllables":"ba-ro-net-ize"},"inflection":{"verb_forms":{"present_simple":["baronetize","baronetizes"],"past_simple":"baronetized","past_participle":"baronetized","present_participle":"baronetizing"}},"usage_notes":{"explanation":"'Baronetize' is a relatively rare verb that specifically means to confer the title of baronet upon someone. A baronetcy is a hereditary title, ranking below a baron but above a knight. The term is primarily used in historical or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was knighted, then baronetized to Duke.","correct":"✓ He was knighted, then baronetized. Later, he was elevated to Duke.","note":"Baronet is a distinct title, it is not a step to become a Duke. "},{"incorrect":"✗ They baronetized the city.","correct":"✓ They honored the city.","note":"Baronetize is only used for people, not places or things."}],"priority":"★★☆"},"related_words":{"derivatives":["baronet (noun): A member of an order of hereditary rank, below a baron but above a knight.","baronetcy (noun): The state or rank of a baronet.","baron (noun): A member of the lowest rank of the British peerage.","knight (noun): A person granted an honorary title of knighthood by a head of state."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Baronetize' is a highly specialized and rare word. It is used to describe the act of bestowing the hereditary title of 'baronet' upon someone. Understanding this word requires knowledge of the British honors system. It is unlikely to be encountered outside of historical or very formal contexts."},"example_sentences":[{"sentence":"The king decided to baronetize the war hero for his bravery.","translation":"王は、その戦争の英雄の勇気を称え、男爵位を授与することを決定した。","type":"verb","meaning_category":"ennoble"},{"sentence":"He was baronetized in recognition of his services to the crown.","translation":"彼は王室への貢献が認められ、男爵位を授与された。","type":"verb","meaning_category":"ennoble"}]}