{"word":"revaccinate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再予防接種する、再ワクチン接種する","english_definition":"to vaccinate again, especially after the effect of the first vaccination has diminished.","examples":[{"sentence":"The doctor decided to revaccinate the patient against influenza.","translation":"医師は患者にインフルエンザの再予防接種をすることを決定した。"},{"sentence":"Children may need to be revaccinated against certain diseases before starting school.","translation":"子供たちは入学前に特定の病気に対する再ワクチン接種が必要になるかもしれない。"}],"collocations":["revaccinate against (disease)","revaccinate with (vaccine)"],"synonyms":["boost","reimmunize"],"antonyms":["vaccinate","immunize"]}],"etymology":{"value":"接頭辞 re- (再び) + vaccinate (ワクチン接種する)","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈvæksɪneɪt/","syllables":"re-vac-ci-nate"},"inflection":{"verb_forms":{"present_simple":["revaccinate","revaccinates"],"past_simple":"revaccinated","past_participle":"revaccinated","present_participle":"revaccinating"}},"usage_notes":{"explanation":"'Revaccinate' implies a repeat vaccination to maintain or restore immunity. It is often used when the initial vaccine's effectiveness has waned over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to revaccinate my car.","correct":"✓ I need to get my car inspected.","note":"'Revaccinate' is only used for medical vaccinations, not for vehicles or other non-medical items."}],"priority":"★★☆"},"related_words":{"derivatives":["revaccination (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'revaccinate' is a technical term related to medicine and public health. It refers to the act of giving someone a vaccine again, usually because the protection from the first vaccine has decreased over time. This word is commonly used in medical contexts, scientific articles, and public health discussions. Understanding this term is important for comprehending information about disease prevention and immunization strategies."},"example_sentences":[{"sentence":"The elderly are often revaccinated against pneumonia to boost their immunity.","translation":"高齢者は免疫力を高めるために、肺炎に対する再ワクチン接種を頻繁に受ける。","type":"general","meaning_category":"medical"},{"sentence":"The health organization recommended to revaccinate the population after the new strain of the virus emerged.","translation":"保健機関は、新しい株のウイルスが出現した後、国民に再ワクチン接種をすることを推奨した。","type":"recommendation","meaning_category":"medical"}]}