{"word":"single-heritage","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"単一の遺産を持つ、単一の祖先を持つ","english_definition":"Having a single, identifiable heritage or ancestry.","examples":[{"sentence":"She identifies as single-heritage, tracing her roots back to Ireland.","translation":"彼女は単一の遺産を持つと自認しており、自身のルーツをアイルランドに辿っています。"},{"sentence":"The community was predominantly single-heritage, with most residents sharing a common cultural background.","translation":"そのコミュニティは主に単一の遺産を持つ人々で構成されており、ほとんどの住民が共通の文化的背景を共有していました。"},{"sentence":"The study focused on the experiences of single-heritage individuals compared to those with mixed heritage.","translation":"その研究は、混合の遺産を持つ人々と比較して、単一の遺産を持つ個人の経験に焦点を当てました。"}],"collocations":["single-heritage individual","single-heritage community","single-heritage background","single-heritage identity"],"synonyms":["monoethnic","monocultural"],"antonyms":["mixed-heritage","multicultural","multiethnic"]}],"etymology":{"value":"'Single' + 'heritage'. 'Single' refers to one, and 'heritage' refers to the traditions, achievements, beliefs, etc., that are part of the history of a group or nation.","priority":"N/A"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈhɛrɪtɪdʒ/","syllables":"sin-gle-her-i-tage"},"inflection":{"notes":"Adjective; does not inflect"},"usage_notes":{"explanation":"The term 'single-heritage' is used to describe someone whose ancestors all come from the same cultural or ethnic background. It is often used in contrast to 'mixed-heritage' or 'multi-heritage' to differentiate between individuals with one identifiable cultural background and those with multiple.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a single heritage person.","correct":"✓ He is a single-heritage person.","note":"Hyphenation is important to correctly convey the meaning of the compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["heritage","mixed-heritage","multi-heritage"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Single-heritage' is a term used to describe individuals who have ancestors from a single, identifiable cultural or ethnic background. It's often used in discussions about identity, culture, and ethnicity, particularly in contrast to those with mixed or multiple heritages. The term is relatively straightforward, but understanding its context requires some familiarity with discussions around cultural identity."},"example_sentences":[{"sentence":"Many people in the town have a single-heritage background, tracing their ancestry back to the original settlers.","translation":"町の人々の多くは単一の遺産を持つ背景を持ち、祖先を最初の入植者に辿っています。","type":"adjective","meaning_category":"ancestry"},{"sentence":"The museum exhibit explored the traditions of various single-heritage communities in the region.","translation":"博物館の展示では、その地域の様々な単一の遺産を持つコミュニティの伝統が紹介されました。","type":"adjective","meaning_category":"community"},{"sentence":"She grew up in a single-heritage household, where her family maintained strong ties to their ancestral culture.","translation":"彼女は単一の遺産を持つ家庭で育ち、家族は祖先の文化との強い繋がりを維持していました。","type":"adjective","meaning_category":"household"}]}