{"word":"twice-sacked","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度解雇された","english_definition":"Having been dismissed from a job or position on two separate occasions.","examples":[{"sentence":"The twice-sacked manager was struggling to find new employment.","translation":"二度解雇されたマネージャーは、新しい仕事を見つけるのに苦労していた。"},{"sentence":"He was a twice-sacked employee, but eventually started his own successful business.","translation":"彼は二度解雇された従業員だったが、最終的には自身の成功したビジネスを始めた。"}],"collocations":["twice-sacked manager","twice-sacked employee","twice-sacked coach"],"synonyms":["repeatedly dismissed","double-fired"],"antonyms":["never sacked","continuously employed"]}],"etymology":{"value":"A compound word formed from 'twice' (meaning two times) and 'sacked' (meaning dismissed from employment).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtwaɪsˈsækt/","syllables":"twice-sacked"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'twice-sacked' is used to describe someone who has been fired from a job on two separate occasions. It often carries a negative connotation, suggesting that the person may have difficulty maintaining employment or has a history of poor performance. However, it can also be used neutrally to simply state the fact that someone has been fired twice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was twice sack.","correct":"He was twice sacked.","note":"'Sacked' is the past participle of the verb 'to sack', meaning to dismiss from employment."}]},"related_words":{"derivatives":["sack (verb, noun)","sacking (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'twice-sacked' is a relatively uncommon compound adjective. It is easily understood by those familiar with the idiom 'to be sacked' (meaning to be fired). The word implies a negative history of employment but can be used factually. Due to its specific meaning and relatively low frequency, it is more likely to be encountered in formal or specialized contexts, such as news reports or discussions about employment history."},"example_sentences":[{"sentence":"The football coach, a twice-sacked figure, was given another chance by the team.","translation":"そのサッカーコーチは、二度解雇された人物だったが、チームからもう一度チャンスを与えられた。","type":"adjective","meaning_category":"解雇された"}]}