{"word":"autonomy","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"自治権、自主性、自律性","english_definition":"the right or condition of self-government; freedom from external control or influence; independence.","examples":[{"sentence":"The university enjoys a high degree of autonomy in its research programs.","translation":"その大学は研究プログラムにおいて高度な自治権を有している。"},{"sentence":"Individuals should have the autonomy to make their own decisions.","translation":"個人は自分で決定を下す自主性を持つべきだ。"},{"sentence":"The company encourages employee autonomy and creativity.","translation":"その会社は従業員の自主性と創造性を奨励している。"}],"collocations":["grant autonomy (自治権を与える)","exercise autonomy (自治権を行使する)","regional autonomy (地域自治)","personal autonomy (個人の自主性)","financial autonomy (財政的自立)","political autonomy (政治的自治)"],"synonyms":["independence","self-government","self-rule","freedom","liberty","self-determination","sovereignty"],"antonyms":["dependence","subordination","control","heteronomy"]}],"etymology":{"value":"From Greek *autonomia*, from *autos* 'self' + *nomos* 'law'. Originally referred to the condition of having one's own laws or government.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtɒnəmi/","syllables":"au-ton-o-my"},"inflection":{"noun_plural":"autonomies"},"usage_notes":{"explanation":"\"Autonomy\" refers to the capacity or right of self-governance. It can apply to nations, organizations, or individuals. It implies a degree of independence and freedom from external control. In ethics and philosophy, it often refers to the capacity of an individual to make their own moral decisions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a lot of autonomies.","correct":"✓ He has a lot of autonomy.","note":"While \"autonomies\" is a valid plural form, \"autonomy\" is often used as an uncountable noun, especially when referring to a general state or condition."},{"incorrect":"✗ The company gives too much autonomies to its employees.","correct":"✓ The company gives too much autonomy to its employees.","note":"Again, \"autonomy\" is often used as an uncountable noun in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["autonomous (adjective)","autonomously (adverb)"],"related_concepts":["sovereignty","independence","liberty","self-determination","self-reliance","self-sufficiency"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, especially in academic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Autonomy\" is a more advanced word that refers to the ability to govern oneself or to be independent. It's often used in discussions about politics, ethics, and personal development. Understanding this word is important for comprehending complex texts and discussions in these areas."},"example_sentences":[{"sentence":"The region was granted greater autonomy after years of negotiation.","translation":"その地域は長年の交渉の末、より大きな自治権を与えられた。","type":"noun","meaning_category":"自治権"},{"sentence":"The project aims to promote the autonomy of local communities.","translation":"そのプロジェクトは地域社会の自主性を促進することを目的としている。","type":"noun","meaning_category":"自主性"},{"sentence":"Robots with full autonomy are still largely a thing of science fiction.","translation":"完全な自律性を持つロボットは、依然として主にSFの世界の話だ。","type":"noun","meaning_category":"自律性"},{"sentence":"Respect for patient autonomy is a cornerstone of medical ethics.","translation":"患者の自主性の尊重は、医療倫理の基礎である。","type":"noun","meaning_category":"自主性"}]}