{"word":"hipokrit","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(道徳的、宗教的信念に関して)偽善者、ごう慢な人","english_definition":"a person who pretends to have moral standards or beliefs that they do not actually possess.","examples":[{"sentence":"Dia seorang hipokrit, selalu berbicara tentang kejujuran tetapi sering berbohong.","translation":"彼は偽善者だ。いつも正直さについて話しているが、よく嘘をつく。"},{"sentence":"Jangan menjadi hipokrit, lakukan apa yang kamu katakan.","translation":"偽善者になるな。言うことを実行しろ。"}],"collocations":["seorang hipokrit (一人の偽善者)","menjadi hipokrit (偽善者になる)"],"synonyms":["munafik","penjilat","orang bermuka dua"],"antonyms":["jujur","tulus","ikhlas"]}],"etymology":{"value":"Kata 'hipokrit' berasal dari bahasa Yunani Kuno 'hypokrites' (ὑποκριτής), yang berarti 'aktor' atau 'orang yang berpura-pura'. Dalam konteks drama Yunani, hypokrites adalah orang yang memainkan peran di atas panggung. Seiring waktu, makna kata ini berkembang menjadi seseorang yang berpura-pura memiliki keyakinan atau perasaan yang sebenarnya tidak mereka miliki.","priority":"★★☆"},"pronunciation":{"ipa":"/hi.po.krit/","syllables":"hi-po-krit"},"inflection":{"noun_plural":"hipokrit-hipokrit"},"usage_notes":{"explanation":"'Hipokrit' digunakan untuk menggambarkan seseorang yang tidak konsisten antara perkataan dan perbuatan mereka, terutama dalam hal nilai-nilai moral atau agama. Kata ini memiliki konotasi negatif yang kuat dan sering digunakan untuk mengkritik perilaku yang dianggap tidak tulus atau palsu.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dia adalah hipokrit karena dia tidak pernah membantu orang lain.","correct":"Dia dianggap hipokrit karena dia sering berbicara tentang membantu orang lain tetapi tidak pernah melakukannya.","note":"Menjadi 'tidak membantu' saja tidak cukup untuk disebut 'hipokrit'. Harus ada ketidaksesuaian antara perkataan dan perbuatan."}],"priority":"★★☆"},"related_words":{"derivatives":["kemunafikan (kemunafikan)"],"phrases":["berpura-pura (berpura-pura)","bermuka dua (bermuka dua)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Cukup sering digunakan dalam konteks formal dan diskusi moral.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hipokrit' adalah kata yang digunakan untuk menggambarkan seseorang yang tidak jujur atau tidak tulus dalam keyakinan atau tindakan mereka. Kata ini sering digunakan dalam diskusi tentang moralitas dan etika, dan pemahaman yang baik tentang kata ini penting untuk memahami argumen-argumen tersebut. Kata ini memiliki konotasi negatif yang kuat.","priority":"★★☆"},"example_sentences":[{"sentence":"Politisi itu dicap sebagai hipokrit karena janji-janjinya tidak sesuai dengan tindakannya.","translation":"政治家は、彼の約束が彼の行動と一致しないため、偽善者として非難された。","type":"noun","meaning_category":"偽善者"},{"sentence":"Jangan menjadi hipokrit dengan mengkritik orang lain atas kesalahan yang sama yang kamu lakukan.","translation":"あなたが犯したのと同じ過ちで他人を批判することで偽善者になるな。","type":"noun","meaning_category":"偽善者"}]}