{"word":"nonrhetorically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"修辞的でなく、率直に、文字通りに","english_definition":"in a manner that is not rhetorical; plainly; literally","examples":[{"sentence":"I'm asking nonrhetorically; I genuinely want to know your opinion.","translation":"修辞的に言っているのではなく、率直にあなたの意見を聞きたいのです。"},{"sentence":"To answer nonrhetorically, the solution requires significant investment.","translation":"率直に答えると、その解決策には多大な投資が必要です。"}],"collocations":["answer nonrhetorically","ask nonrhetorically"],"synonyms":["literally","plainly","directly","sincerely","frankly"],"antonyms":["rhetorically"]}],"etymology":{"value":"\"non-\" (否定) + \"rhetorically\" (修辞的に)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.rɪˈtɒr.ɪ.kli/","syllables":"non-rhe-tor-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"\"Nonrhetorically\" is used to emphasize that a question or statement is meant to be taken at face value, without any hidden agenda or intention to persuade. It indicates sincerity and a genuine desire for information or understanding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke very nonrhetorically, using many metaphors.","correct":"✓ He spoke very plainly, avoiding metaphors.","note":"Metaphors are a rhetorical device, so using them contradicts the meaning of speaking nonrhetorically."}],"priority":"★★☆"},"related_words":{"derivatives":["rhetorical (adjective)","rhetoric (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonrhetorically' means to communicate in a direct, straightforward way, without using persuasive or elaborate language techniques. It's the opposite of speaking 'rhetorically,' which involves using language to impress or convince others. This word is not commonly used. You'll typically find it in formal writing or discussions where clarity and sincerity are emphasized."},"example_sentences":[{"sentence":"She asked, nonrhetorically, if they had considered all the options.","translation":"彼女は、修辞的にではなく、すべての選択肢を検討したかどうかを尋ねた。","type":"adverb","meaning_category":"率直に"},{"sentence":"To respond nonrhetorically, the project's success depends on several factors.","translation":"率直に答えると、プロジェクトの成功はいくつかの要因に左右される。","type":"adverb","meaning_category":"率直に"}]}