{"word":"splanchnopathy","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"内臓疾患、内臓病","english_definition":"Any disease of the viscera (internal organs, especially those of the abdomen).","examples":[{"sentence":"The patient was diagnosed with a severe splanchnopathy.","translation":"患者は重度の内臓疾患と診断された。"},{"sentence":"Splanchnopathy can result from various infections or autoimmune disorders.","translation":"内臓疾患は、様々な感染症や自己免疫疾患によって引き起こされる可能性がある。"}],"collocations":["severe splanchnopathy","chronic splanchnopathy","acute splanchnopathy"],"synonyms":["visceropathy"],"antonyms":[]}],"etymology":{"value":"From Greek 'splanchna' (internal organs) + 'pathos' (suffering, disease) + '-y' (suffix indicating a condition or disease).","priority":"Medium"},"pronunciation":{"ipa":"/ˌsplæŋkˈnɒpəθi/","syllables":"splank-nop-a-thy"},"inflection":{"noun_plural":"splanchnopathies"},"usage_notes":{"explanation":"'Splanchnopathy' is a relatively rare and technical term used in medicine to refer to diseases affecting the internal organs, particularly those in the abdomen. It is often used as a general term when the specific cause or nature of the visceral disease is not yet determined.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor treated the splanchnopathy with surgery on the skin.","correct":"✓ The doctor treated the splanchnopathy with surgery on the affected organ.","note":"Splanchnopathy refers to diseases of the internal organs, so treatment would typically involve addressing the affected organ directly, not the skin."}],"priority":"Low"},"related_words":{"derivatives":["splanchnopathic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Splanchnopathy' is a highly specialized medical term rarely encountered outside of professional medical contexts. Understanding requires knowledge of medical terminology and anatomy. It is not suitable for general English learners.","priority":"Low"},"example_sentences":[{"sentence":"The gastroenterologist specialized in the diagnosis and treatment of various forms of splanchnopathy.","translation":"その消化器科医は、様々な形態の内臓疾患の診断と治療を専門としていた。","type":"general","meaning_category":"definition"},{"sentence":"Chronic splanchnopathy can significantly impact a patient's quality of life.","translation":"慢性的な内臓疾患は、患者の生活の質に大きな影響を与える可能性がある。","type":"general","meaning_category":"definition"}]}