{"word":"nonimperially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"帝国主義的でない方法で、非帝国主義的に","english_definition":"In a way that is not imperialistic; without imperialistic practices or characteristics.","examples":[{"sentence":"The country sought to engage with its neighbors nonimperially, focusing on mutual benefit and respect.","translation":"その国は、相互利益と尊重に焦点を当て、帝国主義的でない方法で近隣諸国と関わろうとした。"},{"sentence":"The aid organization operated nonimperially, ensuring that its programs were designed and implemented in collaboration with local communities.","translation":"その援助団体は、そのプログラムが地域社会との協力で設計され実施されるようにし、非帝国主義的に運営された。"}],"collocations":["act nonimperially","operate nonimperially","engage nonimperially"],"synonyms":["anti-imperialistically","non-domineeringly","non-exploitatively"],"antonyms":["imperially","domineeringly","exploitatively"]}],"etymology":{"value":"'non-' (否定) + 'imperially' (帝国主義的に)。'Imperially' は 'imperial' (帝国の、帝国主義の) + '-ly' (副詞化接尾辞) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪmˈpɪəriəli/","syllables":"non-im-pe-ri-al-ly"},"inflection":{"notes":"Adverb; no inflection."},"usage_notes":{"explanation":"'Nonimperially' is used to describe actions, policies, or approaches that avoid or reject imperialistic tendencies. It emphasizes a relationship or interaction based on equality, respect, and mutual benefit, rather than domination or exploitation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They approached the negotiation non imperial.","correct":"✓ They approached the negotiation nonimperially.","note":"'Nonimperially' is an adverb and must be used to modify a verb. 'Non imperial' is grammatically incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["nonimperial (adjective)","imperialism (noun)","imperialist (noun/adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nonimperially' is a relatively uncommon and complex term. It is formed by adding the prefix 'non-' to 'imperially,' indicating the absence or negation of imperialistic qualities or actions. Understanding this word requires a grasp of the concept of imperialism and the ability to recognize how actions can be carried out in a way that avoids or opposes imperialistic tendencies. It is most likely to be encountered in academic or political contexts when discussing international relations, colonialism, or cultural exchange."},"example_sentences":[{"sentence":"The organization aimed to distribute resources nonimperially, respecting local customs and needs.","translation":"その組織は、現地の慣習やニーズを尊重し、非帝国主義的に資源を分配することを目指した。","type":"general","meaning_category":"manner"},{"sentence":"The treaty was designed to ensure that trade relations were conducted nonimperially, without exploiting weaker nations.","translation":"その条約は、貿易関係がより弱い国々を搾取することなく、非帝国主義的に行われることを保証するように設計された。","type":"political","meaning_category":"international relations"}]}