{"word":"dimorphous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"二形の、二重形態の","english_definition":"(chiefly of plants and animals) occurring in two distinct forms. (of a substance, especially a mineral) crystallizing in two different forms.","examples":[{"sentence":"Dimorphous fungi exhibit two distinct spore types.","translation":"二形性の菌類は、2つの異なる胞子のタイプを示す。"},{"sentence":"Calcite is a dimorphous mineral, crystallizing in both trigonal and hexagonal forms.","translation":"方解石は二形性の鉱物であり、三方晶系と六方晶系の両方で結晶化する。"}],"collocations":["dimorphous fungus","dimorphous mineral","dimorphous crystal"],"synonyms":["biform","dual-form","two-formed"],"antonyms":["monomorphous","uniform"]},{"part_of_speech":"adjective","definition":"（化学において）二つの異なる結晶形を持つ","english_definition":"(chemistry) existing in two different crystalline forms.","examples":[{"sentence":"Sulfur is dimorphous, existing as both rhombic and monoclinic crystals.","translation":"硫黄は二形性であり、斜方晶と単斜晶の両方の結晶として存在する。"}],"collocations":["dimorphous crystal","dimorphous structure"],"synonyms":["polymorphous (more general term)"],"antonyms":["amorphous"]}],"etymology":{"value":"From Greek δι- (di-) meaning \"two\" + μορφή (morphē) meaning \"form\".","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈmɔːrfəs/","syllables":"di-mor-phous"},"inflection":{"notes":"This word does not have typical inflections as it is an adjective."},"usage_notes":{"explanation":"'Dimorphous' describes something that exists in two distinct forms. In biology, it often refers to organisms with two different physical appearances. In chemistry and mineralogy, it describes substances that can crystallize in two different forms. It is more specific than 'polymorphous,' which indicates multiple forms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The species is dimorphic, showing three distinct forms.","correct":"✓ The species is polymorphic, showing three distinct forms.","note":"'Dimorphous' means two forms, not more. Use 'polymorphic' for more than two forms."},{"incorrect":"✗ The rock was dimorphous, meaning it had no crystal structure.","correct":"✓ The rock was amorphous, meaning it had no crystal structure.","note":"'Dimorphous' refers to two crystal structures, while 'amorphous' means no crystal structure."}],"priority":"★★☆"},"related_words":{"derivatives":["dimorphism (noun)"],"phrasal_verbs":[],"related_terms":["polymorphous","amorphous","monomorphous"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dimorphous' is a technical term used in biology, chemistry, and mineralogy to describe something that exists in two distinct forms. It is more commonly used in scientific contexts and may not be familiar to the general public. Understanding the etymology (di- meaning 'two' and morph meaning 'form') can help in remembering its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The plant is dimorphous, with different leaf shapes at different stages of growth.","translation":"その植物は二形性であり、成長の異なる段階で異なる葉の形を持つ。","type":"general","meaning_category":"biology"},{"sentence":"Titanium dioxide is dimorphous, existing as both rutile and anatase.","translation":"二酸化チタンは二形性であり、ルチルとアナターゼの両方として存在する。","type":"scientific","meaning_category":"chemistry/mineralogy"}]}