{"word":"endarterium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管内膜","english_definition":"The innermost layer of an artery or other blood vessel, composed of a single layer of endothelial cells and a thin layer of subendothelial connective tissue.","examples":[{"sentence":"The endarterium plays a crucial role in regulating blood flow and preventing blood clot formation.","translation":"血管内膜は、血流の調節と血栓の形成を防ぐ上で重要な役割を果たします。"}],"collocations":["endarterial (形容詞：血管内膜の)","endothelial cells (内皮細胞)"],"synonyms":["tunica intima"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'endon' (within), 'arteria' (artery), and '-ium' (a suffix denoting a structure or tissue).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛndɑːrˈtɪəriəm/","syllables":"en-dar-te-ri-um"},"inflection":{"noun_plural":"endarteria"},"usage_notes":{"explanation":"The term 'endarterium' is primarily used in medical and anatomical contexts to refer specifically to the innermost lining of blood vessels. It is essential for maintaining vascular health.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The endarterium is the outer layer of the artery.","correct":"✓ The endarterium is the inner layer of the artery.","note":"The endarterium is the innermost, not the outermost, layer of the artery."}],"priority":"★★☆"},"related_words":{"derivatives":["endarterectomy (内膜摘除術)","endarteritis (内膜炎)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'endarterium' is a technical term used in medicine and biology to describe the innermost layer of a blood vessel. Understanding this term requires knowledge of basic anatomy and medical terminology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Damage to the endarterium can lead to atherosclerosis.","translation":"血管内膜の損傷はアテローム性動脈硬化症につながる可能性があります。","type":"general","meaning_category":"medical"},{"sentence":"The integrity of the endarterium is vital for vascular function.","translation":"血管機能には血管内膜の完全性が不可欠です。","type":"general","meaning_category":"anatomy"}]}