{"word":"sievings","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ふるい分けられたもの、ふるいかす、ふるい分けの過程","english_definition":"Material that has been separated by sieving; the process of separating materials by sieving.","examples":[{"sentence":"The sievings contained larger particles that did not pass through the mesh.","translation":"ふるい分けられたものには、網目を通過しなかった大きな粒子が含まれていた。"},{"sentence":"The sievings from the flour mill were used as animal feed.","translation":"製粉所のふるいかすは動物の飼料として使われた。"},{"sentence":"The process of sievings helped to refine the final product.","translation":"ふるい分けの過程は最終製品の精製に役立った。"}],"collocations":["flour sievings","sand sievings","gravel sievings"],"synonyms":["screenings","leavings","residue","waste"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'sieve', which comes from Old English 'sife', meaning a mesh or strainer. The addition of '-ing' transforms it into a noun describing the action or the result of sieving.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪvɪŋz/","syllables":"siv-ings"},"inflection":{"noun_plural":"sievings"},"usage_notes":{"explanation":"'Sievings' refers to the material that remains after a substance has been passed through a sieve. It can also refer to the act of sieving itself. It's often used in contexts related to milling, mining, or construction, where separating materials by size is common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sieving was used to build the house.","correct":"✓ The sievings were used to build the house.","note":"'Sievings' is typically used in the plural form when referring to the material that remains after sieving."},{"incorrect":"✗ He used sievings to filter the water.","correct":"✓ He used a sieve to filter the water.","note":"'Sievings' refers to the material left behind, not the tool used for sieving. The tool is called a 'sieve'."}],"priority":"★★☆"},"related_words":{"derivatives":["sieve (noun: ふるい; verb: ふるいにかける)","sift (verb: ふるいにかける、選別する)","screening (noun: ふるい分け、選別)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sievings' is a relatively uncommon term that refers to the materials that are separated out during the process of sieving. It is most often used in technical or industrial contexts where the separation of materials by size is important. The word can also refer to the process of sieving itself. Understanding the term requires a familiarity with processes involving the separation of materials.","priority":"★★☆"},"example_sentences":[{"sentence":"The gold miners carefully examined the sievings for any traces of precious metals.","translation":"金鉱採掘者は、貴金属の痕跡がないか、ふるいかすを注意深く調べた。","type":"noun","meaning_category":"ふるい分けられたもの"},{"sentence":"The sievings from the construction site were analyzed to determine their composition.","translation":"建設現場からのふるい分けられたものを分析して、その組成を決定した。","type":"noun","meaning_category":"ふるい分けられたもの"},{"sentence":"The farmer used the flour sievings as feed for his chickens.","translation":"農夫は小麦粉のふるいかすを鶏の餌として使った。","type":"noun","meaning_category":"ふるいかす"}]}