{"word":"podocephalous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having the head attached to the stem or peduncle; said of certain fungi.","english_definition":"(Botany, Mycology) Having the head or spore-bearing structure directly attached to the stem or peduncle, without a distinct neck or intervening structure; used especially to describe certain fungi.","examples":[{"sentence":"The fungus was described as podocephalous due to its head being directly attached to the stem.","translation":"その菌類は、頭部が茎に直接付着しているため、podocephalous（ポドセファラス）であると記述された。"}],"collocations":["podocephalous fungus","podocephalous structure"],"synonyms":["stipitate","stalked"],"antonyms":["sessile (when referring to structures directly attached to a surface without a stalk)"]}],"etymology":{"value":"From Ancient Greek ποδός (podós, \"foot, stem\") + κεφαλή (kephalḗ, \"head\") + -ous (suffix indicating possession or resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒdəʊˈsɛfələs/","syllables":"po-do-ceph-a-lous"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more podocephalous' and 'most podocephalous'."},"usage_notes":{"explanation":"This term is primarily used in botany and mycology to describe the physical structure of certain fungi where the head (spore-bearing structure) is directly attached to the stem. It is a relatively uncommon term, mainly found in scientific literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leaf is podocephalous.","correct":"✓ The fungus is podocephalous.","note":"'Podocephalous' specifically describes the structure of certain fungi, not leaves or other plant parts."}],"priority":"★☆☆"},"related_words":{"derivatives":["podocephaly (noun): the condition of being podocephalous"],"related_terms":["cephalic (relating to the head)","peduncle (a stem or stalk supporting a flower or fruit)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency; primarily used in specialized botanical or mycological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'podocephalous' is a highly specialized term used in the fields of botany and mycology to describe fungi with a specific structural characteristic: the direct attachment of the head (spore-bearing structure) to the stem. Due to its limited usage, it is considered a high-level vocabulary word. Understanding requires familiarity with botanical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The distinguishing feature of this species is its podocephalous fruiting body.","translation":"この種の際立った特徴は、そのpodocephalous（ポドセファラス）の子実体である。","type":"descriptive","meaning_category":"botanical description"}]}