{"word":"Thrallborn","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person born into a state of thralldom or servitude; a person born as a slave or serf.","english_definition":"An individual whose birthright is a condition of servitude or slavery.","examples":[{"sentence":"The thrallborn toiled in the fields, knowing no other life.","translation":"奴隷として生まれた者は、他の生き方を知らずに畑で働いた。"},{"sentence":"Laws were enacted to eventually free the thrallborn from their bonds.","translation":"奴隷として生まれた者をその束縛から最終的に解放するための法律が制定された。"}],"collocations":["thrallborn child","thrallborn lineage","free the thrallborn"],"synonyms":["slave","serf","bondsman","captive"],"antonyms":["freeborn","freeman","liberated"],"notes":"This term is often used in historical or fantasy contexts."}],"etymology":{"value":"Derived from the Old Norse word 'þræll', meaning 'slave' or 'thrall', combined with 'born', indicating birth into that condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθrɔːl.bɔːrn/","syllables":"thrawl-born"},"inflection":{"noun_plural":"thrallborn (can also be thrallborns)"},"usage_notes":{"explanation":"'Thrallborn' specifically denotes someone who is a slave from birth, rather than someone who became a slave later in life. It emphasizes the inherited nature of their servitude.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a thrallborn because he was captured in battle.","correct":"✓ He was a thrall because he was captured in battle. / ✓ He was thrallborn because his parents were slaves.","note":"Thrallborn refers to being born into slavery, not becoming a slave through capture or other means."}],"priority":"★☆☆"},"related_words":{"derivatives":["thralldom (noun: the state of being a thrall or slave)","thrall (noun: a slave or bondman)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in historical or fantasy literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thrallborn' is a relatively uncommon word, primarily encountered in historical or fantasy literature. It refers to someone born into slavery, emphasizing the inherited nature of their servitude. Understanding the etymology (Old Norse 'þræll' meaning 'slave') helps to grasp its meaning. It is important to distinguish it from 'thrall,' which can refer to anyone in a state of servitude, regardless of their birth status."},"example_sentences":[{"sentence":"The epic saga tells of a hero who rose from being thrallborn to leading a rebellion.","translation":"その壮大な物語は、奴隷として生まれた者が反乱を率いる英雄に成長する様子を描いている。","type":"noun","meaning_category":"slave by birth"},{"sentence":"Many ancient societies had a class of thrallborn individuals who were considered property from the moment of their birth.","translation":"多くの古代社会には、生まれた瞬間から財産と見なされる奴隷として生まれた階級が存在した。","type":"noun","meaning_category":"slave by birth"}]}