{"word":"epeirogeny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 造陸運動、広域造陸運動","english_definition":"(geology) Broad regional uplift or subsidence of the Earth's crust, typically without significant folding or faulting.","examples":[{"sentence":"Epeirogeny is responsible for the formation of many plateaus and coastal plains.","translation":"造陸運動は、多くの台地や海岸平野の形成の原因となっている。"},{"sentence":"The slow uplift due to epeirogeny can expose vast areas of sedimentary rock.","translation":"造陸運動による緩やかな隆起は、広大な堆積岩の地域を露出させることがある。"}],"collocations":["epeirogenic uplift","epeirogenic movement","epeirogenic activity"],"synonyms":["broad warping","regional uplift","crustal warping"],"antonyms":["orogeny (造山運動)"]}],"etymology":{"value":"Derived from the Greek words 'epeiros' (ἤπειρος) meaning 'mainland, continent' and 'genesis' (γένεσις) meaning 'origin, creation'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌpaɪˈrɒdʒəni/","syllables":"e-pei-rog-e-ny"},"inflection":{"noun_plural":"epeirogenies"},"usage_notes":{"explanation":"Epeirogeny refers to the vertical movement of large landmasses, either upward (uplift) or downward (subsidence), over a long period. Unlike orogeny, which involves mountain building through folding and faulting, epeirogeny typically involves broad, gentle warping of the Earth's crust. This process can result in the formation of plateaus, coastal plains, and other large-scale geological features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Epeirogeny creates mountains like the Himalayas.","correct":"✓ Orogeny creates mountains like the Himalayas. Epeirogeny causes broad uplift or subsidence.","note":"Epeirogeny is not responsible for mountain formation; that is orogeny."}],"priority":"★★☆"},"related_words":{"derivatives":["epeirogenic (adjective)"],"related_terms":["isostasy","tectonics","diastrophism","uplift","subsidence"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epeirogeny' is a specialized term in geology that describes the slow, broad uplift or sinking of large areas of the Earth's crust. It's different from 'orogeny,' which is the process of mountain building. Epeirogeny doesn't usually involve folding or faulting of rocks; instead, it's a more gentle, regional warping. You'll typically encounter this term in advanced geology textbooks or discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The formation of the Canadian Shield is partly attributed to epeirogeny.","translation":"カナダ楯状地の形成は、一部、造陸運動に起因すると考えられている。","type":"general","meaning_category":"geological process"},{"sentence":"Epeirogeny can significantly alter drainage patterns in a region.","translation":"造陸運動は、ある地域の排水パターンを大きく変える可能性がある。","type":"general","meaning_category":"geological process"}]}