{"word":"TBD","priority":"★★☆","meanings":[{"part_of_speech":"abbreviation","definition":"To Be Determined（未定）","english_definition":"An abbreviation for \"To Be Determined\" or \"To Be Decided,\" indicating that a piece of information is not yet known but will be decided and announced later.","examples":[{"sentence":"The date of the meeting is TBD.","translation":"会議の日程は未定です。"},{"sentence":"The speaker for the event is TBD.","translation":"イベントの講演者は未定です。"},{"sentence":"Further details TBD.","translation":"詳細は後日決定。"}],"collocations":["Date TBD","Location TBD","Speaker TBD","Price TBD","More details TBD"],"synonyms":["pending","undecided","unconfirmed","provisional","subject to change"],"antonyms":["confirmed","decided","finalized","scheduled"]}],"etymology":{"value":"The abbreviation is derived directly from the phrase \"To Be Determined.\" It's a common placeholder used in planning and documentation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtiː.biːˈdiː/","syllables":"Tee-Bee-Dee"},"inflection":{"notes":"It's an abbreviation, so it doesn't inflect."},"usage_notes":{"explanation":"\"TBD\" is used as a placeholder when specific information is not yet available or finalized. It's commonly found in schedules, project plans, and announcements. It indicates that the details are still being worked out and will be communicated at a later time. It is similar to 'TBA' (To Be Announced), but 'TBD' implies that the decision-making process is still ongoing, whereas 'TBA' might suggest the decision has been made but not yet revealed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The event is TBD on next week.","correct":"✓ The event is TBD; the date will be announced next week.","note":"TBD replaces the missing information. It doesn't take a preposition like 'on'. Instead, use it as a placeholder and provide context separately."},{"incorrect":"✗ We are TBD the schedule.","correct":"✓ The schedule is TBD.","note":"TBD is not a verb. It describes the state of something (being undetermined)."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_abbreviations":["TBA (To Be Announced)","TBC (To Be Confirmed)","ASAP (As Soon As Possible)","ETA (Estimated Time of Arrival)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Abbreviation)","frequency_google_ngram":"Moderately frequent in professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"TBD\" is an abbreviation that stands for \"To Be Determined.\" It means that some information, like a date, time, location, or speaker, is not yet known and will be decided later. You'll often see \"TBD\" in schedules, plans, or announcements where the details are still being worked out. It's a useful placeholder to show that information is missing but will be provided in the future."},"example_sentences":[{"sentence":"The budget for the project is TBD.","translation":"プロジェクトの予算は未定です。","type":"general","meaning_category":"undetermined"},{"sentence":"The exact location is TBD, but it will be in downtown.","translation":"正確な場所は未定ですが、ダウンタウンになります。","type":"general","meaning_category":"undetermined"},{"sentence":"The agenda for tomorrow's meeting is still TBD.","translation":"明日の会議の議題はまだ未定です。","type":"general","meaning_category":"undetermined"}]}