{"word":"Coinmaking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"貨幣製造、造幣","english_definition":"The process or activity of producing coins.","examples":[{"sentence":"The history of coinmaking is closely tied to the development of metallurgy.","translation":"貨幣製造の歴史は、冶金学の発展と密接に結びついている。"},{"sentence":"Ancient coinmaking techniques involved hammering metal between two dies.","translation":"古代の貨幣製造技術では、金属を2つの型の間で叩いて成形していた。"},{"sentence":"Modern coinmaking uses sophisticated machinery to produce large quantities of coins.","translation":"現代の貨幣製造では、高度な機械を使用して大量の貨幣を製造する。"}],"collocations":["coinmaking process (貨幣製造プロセス)","ancient coinmaking (古代の貨幣製造)","modern coinmaking (現代の貨幣製造)","coinmaking technology (貨幣製造技術)","coinmaking machine (貨幣製造機)"],"synonyms":["minting","coinage","numismatics (related, study of coins)"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'coin' and 'making'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɔɪnˌmeɪkɪŋ/","syllables":"coin-mak-ing"},"inflection":{"noun_plural":"Coinmakings (rarely used)"},"usage_notes":{"explanation":"'Coinmaking' refers specifically to the process of manufacturing coins. It is often used in historical or technical contexts when discussing the methods and technologies used to produce coins. The term 'minting' is a more common synonym.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying coinmaking as a hobby.","correct":"✓ He is studying numismatics as a hobby.","note":"While 'coinmaking' refers to the process, 'numismatics' refers to the study or collection of coins and currency."}],"priority":"★★☆"},"related_words":{"derivatives":["coinmaker (noun: a person who makes coins)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coinmaking' is a technical term that refers to the process of manufacturing coins. It is most commonly used in historical, economic, or technical contexts when discussing the production of currency. While not an everyday word, it is important to understand its meaning when encountering it in specialized texts or discussions related to money and finance."},"example_sentences":[{"sentence":"The museum exhibit detailed the history of coinmaking in the Roman Empire.","translation":"博物館の展示では、ローマ帝国における貨幣製造の歴史が詳しく解説されていた。","type":"noun","meaning_category":"貨幣製造"},{"sentence":"Coinmaking was a closely guarded secret in many ancient civilizations.","translation":"貨幣製造は、多くの古代文明において厳重に守られた秘密だった。","type":"noun","meaning_category":"貨幣製造"},{"sentence":"The development of the screw press revolutionized coinmaking in the 16th century.","translation":"スクリュープレスの開発は、16世紀の貨幣製造に革命をもたらした。","type":"noun","meaning_category":"貨幣製造"}]}