{"word":"procoercion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"支持強制、強制支持","english_definition":"The advocacy or support of coercion, especially in a political or social context.","examples":[{"sentence":"The group's procoercion stance on mandatory vaccinations sparked controversy.","translation":"その団体の義務予防接種に対する強制支持の姿勢は論争を呼んだ。"},{"sentence":"Some argue that procoercion policies are necessary for public safety.","translation":"公共の安全のためには、強制支持政策が必要だと主張する人もいる。"}],"collocations":["procoercion stance","procoercion policy","procoercion argument"],"synonyms":["advocacy of force","support for compulsion"],"antonyms":["anticoercion","opposition to coercion"]}],"etymology":{"value":"Derived from the prefix 'pro-' (meaning 'in favor of') and 'coercion' (the practice of persuading someone to do something by using force or threats).","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊkoʊˈɜːrʒən/","syllables":"pro-co-er-cion"},"inflection":{"noun_plural":"procoercions"},"usage_notes":{"explanation":"'Procoercion' is a relatively rare term used to describe the support or advocacy of coercive measures, often in the context of government policies or social norms. It implies a belief that coercion is a necessary or justifiable means to achieve a desired outcome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The procoercion was evident in their forceful arguments.","correct":"✓ The procoercion stance was evident in their forceful arguments.","note":"'Procoercion' is a noun, so it needs to be used as such in a sentence. 'Procoercion stance' or 'procoercion policy' are common phrases."}],"priority":"★★☆"},"related_words":{"derivatives":["coercion","coercive","pro-"],"related_terms":["authoritarianism","totalitarianism","compulsion","mandate"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Procoercion' is a niche term primarily found in academic or political discussions concerning the justification of force or compulsion in governance or social control. It requires a high level of English proficiency to both understand and use correctly, as it is not part of everyday vocabulary. Understanding the nuances of 'coercion' itself is essential to grasping the meaning of 'procoercion.'"},"example_sentences":[{"sentence":"The government's procoercion approach to immigration reform has been widely criticized.","translation":"政府の移民改革に対する強制支持的なアプローチは広く批判されている。","type":"general","meaning_category":"political stance"},{"sentence":"The debate centered on whether a procoercion strategy was ethical in this particular situation.","translation":"議論は、この特定の状況において強制支持戦略が倫理的かどうかを中心に展開された。","type":"ethical discussion","meaning_category":"ethical consideration"}]}