{"word":"Lamarckism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ラマルク説、用不用説","english_definition":"An evolutionary theory (now largely discredited) stating that changes acquired by an organism during its lifetime can be transmitted to its offspring.","examples":[{"sentence":"Lamarckism was an early theory of evolution, predating Darwin's theory of natural selection.","translation":"ラマルク説は、ダーウィンの自然選択説に先立つ初期の進化論でした。"},{"sentence":"Although largely rejected, some aspects of epigenetics have led to a re-evaluation of certain Lamarckian ideas.","translation":"大部分が否定されていますが、エピジェネティクスのいくつかの側面は、ある種のラマルク説的な考え方の再評価につながっています。"}],"collocations":["theory of Lamarckism","Lamarckism vs. Darwinism","neo-Lamarckism"],"synonyms":["inheritance of acquired characteristics","transformism"],"antonyms":["Darwinism","natural selection"]},{"part_of_speech":"noun","definition":"ラマルク主義","english_definition":"The belief in or support for Lamarck's theory of evolution.","examples":[{"sentence":"He was a proponent of Lamarckism, believing that organisms could adapt to their environment and pass those adaptations on.","translation":"彼はラマルク主義の支持者であり、生物は環境に適応し、それらの適応を子孫に伝えることができると信じていました。"}],"collocations":["support for Lamarckism","adherent of Lamarckism"],"synonyms":["Lamarckianism"],"antonyms":[]}],"etymology":{"value":"Named after French naturalist Jean-Baptiste Lamarck (1744-1829), who proposed the theory.","priority":"★★★"},"pronunciation":{"ipa":"/ləˈmɑːrkɪzəm/","syllables":"La-marck-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Lamarckism is a theory of evolution based on the idea that an organism can pass on characteristics that it acquired during its lifetime to its offspring (also known as the inheritance of acquired characteristics). This is in contrast to Darwinism, which proposes that evolution occurs through natural selection. Lamarckism is largely discredited today, but it was an important early theory of evolution and has had some influence on modern evolutionary thought. The term Lamarckian is used to describe someone who believes in Lamarckism or something that is related to Lamarck's theory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Lamarckism is the same as Darwinism.","correct":"✓ Lamarckism is different from Darwinism.","note":"Lamarckism and Darwinism are competing theories of evolution. Darwinism is the widely accepted theory today."},{"incorrect":"✗ Lamarckism is a modern theory of evolution.","correct":"✓ Lamarckism is an early theory of evolution.","note":"Lamarckism was proposed in the early 19th century and is not considered a modern theory."}],"priority":"★★☆"},"related_words":{"derivatives":["Lamarckian (adjective, noun)","neo-Lamarckism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lamarckism' is a scientific term referring to an early evolutionary theory proposed by Jean-Baptiste Lamarck. It suggests that organisms can pass on characteristics acquired during their lifetime to their offspring. This concept is different from Darwin's theory of natural selection. The term is mainly used in scientific or historical contexts when discussing the history of evolutionary thought. Understanding this term requires a background in biology or evolutionary theory."},"example_sentences":[{"sentence":"Lamarckism suggested that giraffes stretched their necks during their lifetime and passed on longer necks to their offspring.","translation":"ラマルク説では、キリンは生涯に首を伸ばし、より長い首を子孫に伝えたとされています。","type":"definition","meaning_category":"evolutionary theory"},{"sentence":"The debate between Lamarckism and Darwinism shaped early evolutionary biology.","translation":"ラマルク説とダーウィン説の間の議論は、初期の進化生物学を形作りました。","type":"historical context","meaning_category":"evolutionary theory"},{"sentence":"Some modern epigenetic studies have sparked renewed interest in certain aspects of Lamarckism.","translation":"現代のエピジェネティクスの研究の中には、ラマルク説の特定の側面への関心を新たに喚起しているものがあります。","type":"modern science","meaning_category":"evolutionary theory"}]}