{"word":"pseudoascetically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"見せかけの禁欲主義的に、偽りの禁欲主義的に","english_definition":"In a manner that is falsely or superficially ascetic; appearing or pretending to be austere or self-denying.","examples":[{"sentence":"He lived pseudoascetically, indulging in secret pleasures while maintaining a facade of simplicity.","translation":"彼は見せかけの禁欲生活を送り、簡素な外見を保ちながら密かに快楽にふけっていた。"},{"sentence":"The guru pseudoascetically preached detachment from worldly possessions, yet amassed a considerable fortune.","translation":"その導師は見せかけの禁欲主義で世俗的な所有物からの離脱を説いたが、かなりの財産を蓄積した。"}],"collocations":["live pseudoascetically","preach pseudoascetically","behave pseudoascetically"],"synonyms":["hypocritically","falsely","superficially","ostentatiously"],"antonyms":["genuinely","authentically","sincerely"]}],"etymology":{"value":"Derived from \"pseudo-\" (false, pretended) + \"ascetically\" (in an ascetic manner). The word \"ascetic\" comes from the Greek \"askētikos,\" meaning \"practicing self-discipline.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊæsˈsɛtɪkli/","syllables":"pseu-do-as-cet-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The word \"pseudoascetically\" describes behavior that outwardly appears ascetic (self-denying, austere) but is not genuine. It implies a level of hypocrisy or pretense, where the individual is either secretly indulging in the very things they claim to reject or is using the appearance of asceticism for personal gain or social approval.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived ascetically, but pseudoascetically.","correct":"✓ He lived ascetically, but his actions were pseudoascetic.","note":"\"Ascetically\" describes a genuine practice, while \"pseudoascetic\" describes a false appearance. They are contrasting concepts, not directly interchangeable. Use \"pseudoascetic\" to describe the nature of the actions, not the manner of living if it is genuinely ascetic."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoascetic (adjective, noun)","ascetic (adjective, noun)","asceticism (noun)"],"related_terms":["hypocrisy","pretense","austerity","self-denial"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudoascetically\" is a highly specialized and uncommon term. It is used in formal or academic contexts to describe behavior that appears ascetic but is not genuinely so, implying hypocrisy or pretense. Understanding this word requires a strong vocabulary and an awareness of the nuances of philosophical and religious concepts related to asceticism."},"example_sentences":[{"sentence":"The politician pseudoascetically denounced luxury while accepting lavish gifts from lobbyists.","translation":"その政治家はロビイストから豪華な贈り物を受け取りながら、見せかけの禁欲主義で贅沢を非難した。","type":"adverb","meaning_category":"偽りの禁欲主義的に"},{"sentence":"She dressed pseudoascetically, hoping to impress the spiritual community with her apparent humility.","translation":"彼女は見せかけの禁欲的な服装をし、表面的な謙虚さで精神的なコミュニティに感銘を与えようとした。","type":"adverb","meaning_category":"偽りの禁欲主義的に"}]}