{"word":"orthochromatize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"正色性にする、正色写真フィルムにする","english_definition":"To render orthochromatic; to treat (a photographic plate or film) so as to make it orthochromatic.","examples":[{"sentence":"The process orthochromatizes the film, making it sensitive to a wider spectrum of light.","translation":"そのプロセスはフィルムを正色性にし、より広い光のスペクトルに感度を持たせる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'orthochromatic' (meaning reproducing colors in correct tonal relations) + '-ize' (a suffix used to form verbs).","priority":"★★★"},"pronunciation":{"ipa":"ɔːrˈθɒkrəˌmaɪz","syllables":"or-tho-chro-ma-tize"},"inflection":{"verb_forms":{"present_simple":["orthochromatize","orthochromatizes"],"past_simple":"orthochromatized","past_participle":"orthochromatized","present_participle":"orthochromatizing"}},"usage_notes":{"explanation":"'Orthochromatize' is a technical term primarily used in the context of photography, specifically relating to the treatment of photographic materials to make them orthochromatic. Orthochromatic films are sensitive to all colors of light except red, which allows for a more accurate representation of tonal values in black and white photography compared to earlier films that were only sensitive to blue light.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["orthochromatic","orthochromatization"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'orthochromatize' is a highly specialized term primarily encountered in the context of historical photography or technical discussions about photographic processes. Understanding requires familiarity with the concept of orthochromatic film and its properties. Due to its limited use, it is not part of common vocabulary."},"example_sentences":[{"sentence":"Early photographic processes were improved by methods to orthochromatize the plates.","translation":"初期の写真プロセスは、プレートを正色性にする方法によって改善されました。","type":"verb","meaning_category":"正色性にする"},{"sentence":"To orthochromatize the film, a specific dye was added to the emulsion.","translation":"フィルムを正色性にするために、特定の色素が乳剤に加えられました。","type":"verb","meaning_category":"正色写真フィルムにする"}]}