{"word":"re-edify","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び啓発する、再び教化する、再び陶冶する","english_definition":"To edify again; to instruct or improve morally or intellectually again.","examples":[{"sentence":"The speaker sought to re-edify the audience after the controversial debate.","translation":"講演者は、物議を醸した討論の後に聴衆を再び啓発しようと努めた。"},{"sentence":"The course aims to re-edify students with updated knowledge in the field.","translation":"このコースは、その分野の最新の知識で学生を再び教化することを目的としている。"}],"collocations":["re-edify the mind","re-edify the soul","re-edify the community"],"synonyms":["re-educate","re-enlighten","re-instruct","re-moralize"],"antonyms":["corrupt","degrade","misinform"]}],"etymology":{"value":"The word 're-edify' is formed by adding the prefix 're-' (meaning again or anew) to the word 'edify'. 'Edify' comes from the Latin word 'aedificare', meaning 'to build, construct,' which is derived from 'aedes' (a building, temple) and 'facere' (to make). Thus, 're-edify' literally means 'to build up again' in a moral, intellectual, or spiritual sense.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈedɪfaɪ/","syllables":"re-ed-i-fy"},"inflection":{"verb_forms":{"present_simple":["re-edify","re-edifies"],"past_simple":"re-edified","past_participle":"re-edified","present_participle":"re-edifying"}},"usage_notes":{"explanation":"'Re-edify' is a relatively rare word that means to edify again. It implies a process of moral, intellectual, or spiritual improvement that is being repeated or renewed. It is often used in contexts where there has been a decline or lapse in understanding or morality, and there is a need to rebuild or reinforce positive values or knowledge.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The school re-edified the building.","correct":"✓ The school re-edified the students.","note":"'Re-edify' is used for moral or intellectual improvement, not physical construction. Use 'renovate' or 'rebuild' for physical structures."},{"incorrect":"✗ He re-edified quickly.","correct":"✓ He was re-edified by the teachings.","note":"'Re-edify' is a transitive verb, so it requires a direct object (who or what is being edified)."}],"priority":"★★☆"},"related_words":{"derivatives":["edify (verb: to instruct or improve morally or intellectually)","edification (noun: the instruction or improvement of a person morally or intellectually)","edifying (adjective: providing moral or intellectual instruction)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Re-edify' is a rare and sophisticated word that means to instruct or improve someone morally or intellectually again. It implies that there was a previous attempt at edification, and that it needs to be renewed or reinforced. This word is not commonly used in everyday conversation, and is more likely to appear in academic or philosophical contexts. Understanding the prefix 're-' and the root word 'edify' can help to grasp its meaning."},"example_sentences":[{"sentence":"The program aimed to re-edify the inmates with life skills and ethical principles.","translation":"そのプログラムは、受刑者にライフスキルと倫理原則を再び教化することを目的としていた。","type":"verb","meaning_category":"教化する"},{"sentence":"After a period of moral decline, the community sought to re-edify its values through education.","translation":"道徳的衰退の後、地域社会は教育を通じてその価値観を再び陶冶しようとした。","type":"verb","meaning_category":"陶冶する"},{"sentence":"The seminar was designed to re-edify the participants on the importance of environmental stewardship.","translation":"そのセミナーは、参加者に環境保護の重要性を再び啓発するように設計されていた。","type":"verb","meaning_category":"啓発する"}]}