{"word":"undelegable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"委任できない、委譲できない","english_definition":"Not able to be delegated or assigned to another person or entity.","examples":[{"sentence":"This responsibility is undelegable; it must be handled by the CEO directly.","translation":"この責任は委任できません。CEOが直接対応する必要があります。"},{"sentence":"Certain duties are considered undelegable due to their sensitive nature.","translation":"特定の義務は、その機密性の高さから委任できないと見なされます。"}],"collocations":["undelegable responsibility","undelegable duty","undelegable task"],"synonyms":["non-delegable","non-transferable","inalienable"],"antonyms":["delegable","transferable","assignable"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'delegable', which itself comes from 'delegate' (to entrust a task or responsibility to another person).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndɛlɪˈɡeɪbəl/","syllables":"un-del-e-ga-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are rarely used with 'undelegable'."},"usage_notes":{"explanation":"'Undelegable' is used to describe tasks, responsibilities, or duties that cannot be assigned to someone else. This is often because the task requires specific expertise, authority, or is considered too important to be handled by anyone other than the designated individual.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The task was undelegate.","correct":"✓ The task was undelegable.","note":"'Undelegate' is not a word. The correct term is 'undelegable'."},{"incorrect":"✗ He tried to undelegable the responsibility.","correct":"✓ He could not delegate the responsibility. / ✓ The responsibility was undelegable.","note":"'Undelegable' is an adjective, not a verb. You cannot 'undelegable' something. Instead, use 'could not delegate' or state that the responsibility 'was undelegable'."}],"priority":"★★☆"},"related_words":{"derivatives":["delegable (adjective: able to be delegated)","delegate (verb: to entrust a task or responsibility)","delegation (noun: the act of delegating)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undelegable' is a formal and specialized term, primarily used in business, legal, and management contexts. It means that a particular task, duty, or responsibility cannot be delegated or assigned to another person. Understanding this word requires a good grasp of abstract concepts related to authority, responsibility, and organizational structure. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The board determined that approving the budget was an undelegable function of the CFO.","translation":"取締役会は、予算の承認がCFOの委任できない職務であると判断しました。","type":"example","meaning_category":"委任できない職務"},{"sentence":"Due to the confidential nature of the project, certain aspects were deemed undelegable.","translation":"プロジェクトの機密性のために、特定の側面は委任できないと見なされました。","type":"example","meaning_category":"委任できない側面"},{"sentence":"As a leader, it's important to know which tasks are undelegable and which can be effectively assigned to your team.","translation":"リーダーとして、どのタスクが委任できず、どのタスクをチームに効果的に割り当てられるかを知ることが重要です。","type":"example","meaning_category":"委任できないタスク"}]}