{"word":"immune-suppressed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"免疫抑制された、免疫機能が抑制された","english_definition":"Having a weakened immune system, making one more susceptible to infections.","examples":[{"sentence":"The patient is immune-suppressed due to chemotherapy.","translation":"その患者は化学療法により免疫抑制状態にある。"},{"sentence":"Immune-suppressed individuals are at higher risk of severe illness from common infections.","translation":"免疫抑制された人は、一般的な感染症から重症化するリスクが高い。"},{"sentence":"Certain medications can leave you immune-suppressed.","translation":"特定の薬は免疫抑制状態を引き起こす可能性がある。"}],"collocations":["become immune-suppressed (免疫抑制状態になる)","remain immune-suppressed (免疫抑制状態が続く)","severely immune-suppressed (重度に免疫抑制された)","mildly immune-suppressed (軽度に免疫抑制された)"],"synonyms":["immunocompromised","immunodeficient"],"antonyms":["immunocompetent","immunologically healthy"]}],"etymology":{"value":"Formed by combining \"immune\" (resistant to disease) and \"suppressed\" (inhibited, weakened).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmjuːn səˈprest/","syllables":"im-mune-sup-pressed"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Immune-suppressed\" describes a state where the immune system is not functioning at its full capacity, often due to medical treatments, certain diseases, or genetic conditions. Individuals in this state are more vulnerable to infections and may have difficulty fighting off diseases. It is important to note that the term refers to a condition, not a personality trait or choice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is immune-suppress.","correct":"✓ He is immune-suppressed.","note":"\"Immune-suppressed\" is an adjective, so it should be used to describe a noun (e.g., \"He is an immune-suppressed patient.\"). \"Immune-suppress\" is not a correct form."},{"incorrect":"✗ Immune-suppressed people don't need vaccines.","correct":"✓ Immune-suppressed people may need special vaccines or precautions.","note":"Immune-suppressed individuals often require modified vaccination schedules or specific types of vaccines to ensure safety and efficacy, as their immune response may be compromised."}],"priority":"★★☆"},"related_words":{"derivatives":["immunosuppression (名詞: 免疫抑制)","immunosuppressant (名詞/形容詞: 免疫抑制剤)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"immune-suppressed\" is a technical term used in medical and scientific contexts to describe someone whose immune system is not working as well as it should. This can be due to medications, illnesses, or other factors. Because it is a technical term, it is more commonly used and understood by healthcare professionals and those with a higher level of education or specific interest in health-related topics."},"example_sentences":[{"sentence":"Organ transplant recipients are often immune-suppressed to prevent rejection of the new organ.","translation":"臓器移植を受けた人は、新しい臓器の拒絶反応を防ぐために、しばしば免疫抑制剤を投与される。","type":"adjective","meaning_category":"Medical condition"},{"sentence":"The immune-suppressed child was kept away from crowded places to avoid exposure to infections.","translation":"免疫抑制された子供は、感染症への曝露を避けるために、混雑した場所から遠ざけられた。","type":"adjective","meaning_category":"Medical condition"},{"sentence":"Long-term use of corticosteroids can lead to an immune-suppressed state.","translation":"コルチコステロイドの長期使用は、免疫抑制状態につながる可能性がある。","type":"adjective","meaning_category":"Medical condition"}]}