{"word":"Hispanics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒスパニック系の人々（特にアメリカ合衆国において、スペイン語を母語とする、またはスペイン語圏の文化を持つ人々を指す）","english_definition":"People of Hispanic origin or descent, especially those living in the United States; typically referring to people who speak Spanish or have cultural ties to Spanish-speaking countries.","examples":[{"sentence":"The Hispanic population in the United States is growing rapidly.","translation":"アメリカ合衆国におけるヒスパニック系の人口は急速に増加しています。"},{"sentence":"Many Hispanics celebrate their cultural heritage during Hispanic Heritage Month.","translation":"多くのヒスパニック系の人々は、ヒスパニック遺産月間中に彼らの文化的遺産を祝います。"},{"sentence":"The city has a large community of Hispanics.","translation":"その都市には大規模なヒスパニック系のコミュニティがあります。"}],"collocations":["Hispanic community (ヒスパニック系コミュニティ)","Hispanic culture (ヒスパニック文化)","Hispanic heritage (ヒスパニック遺産)","Hispanic population (ヒスパニック系人口)","Hispanic American (ヒスパニック系アメリカ人)"],"synonyms":["Latino/Latina","Spanish-speaking people","People of Latin American descent"],"antonyms":["Anglo-American","Non-Hispanic"],"usage_notes":"The term 'Hispanic' generally refers to people who speak Spanish or are descended from Spanish-speaking populations. It is often used interchangeably with 'Latino/Latina,' but there are differences. 'Latino/Latina' refers to people of Latin American origin, which includes Brazil (where Portuguese is spoken), while 'Hispanic' typically excludes Brazil but includes Spain."}],"etymology":{"value":"The term 'Hispanic' comes from the Latin word 'Hispania,' which was the Roman name for the Iberian Peninsula (modern-day Spain and Portugal). It was adopted in the United States to refer to people with origins in Spanish-speaking countries.","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈspænɪks/","syllables":"his-pan-ics"},"inflection":{"noun_plural":"Hispanics (already plural)"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in discussions about demographics and culture in the United States.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ All Hispanics are from Mexico.","correct":"✓ Hispanics come from many different countries, including Mexico, Spain, and various Latin American nations.","note":"Hispanics originate from various countries, not just Mexico. It's important to recognize the diversity within the Hispanic community."},{"incorrect":"✗ Hispanic is a race.","correct":"✓ Hispanic is an ethnicity, not a race.","note":"Hispanic refers to a shared language and cultural heritage, not a racial category."}],"priority":"★★☆"},"related_words":{"derivatives":["Hispanic (adjective)","Hispanidad (Spanish: Hispanicity, the quality of being Hispanic)"],"related_terms":["Latino/Latina (often used interchangeably, but refers to Latin American origin)","Chicano/Chicana (specifically refers to Mexican Americans)","Tejano/Tejana (specifically refers to Texans of Mexican descent)"],"priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Hispanics' refers to people who originate from or have ancestors from Spanish-speaking countries. It's commonly used in the United States to describe a large and diverse population with shared cultural and linguistic ties. It's important to remember that 'Hispanic' is an ethnicity, not a race, and that people of Hispanic origin come from many different countries and backgrounds. The term is often used alongside 'Latino/Latina,' which refers to people of Latin American origin, but there are nuances in usage."},"example_sentences":[{"sentence":"The contributions of Hispanics to American society are significant.","translation":"アメリカ社会へのヒスパニック系の人々の貢献は重要です。","type":"general"},{"sentence":"Many television channels offer programming in Spanish to cater to Hispanics.","translation":"多くのテレビチャンネルが、ヒスパニック系の人々に対応するためにスペイン語での番組を提供しています。","type":"cultural"},{"sentence":"Understanding the diversity within the community of Hispanics is essential.","translation":"ヒスパニック系のコミュニティ内の多様性を理解することが不可欠です。","type":"social"}]}