{"word":"pseudoepiscopal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"仮の司教の、司教を装った","english_definition":"Falsely or spuriously episcopal; pretending to be episcopal.","examples":[{"sentence":"The pseudoepiscopal church claimed apostolic succession, but their claims were dubious.","translation":"その仮の司教教会は使徒継承を主張したが、彼らの主張は疑わしかった。"},{"sentence":"He was accused of pseudoepiscopal practices, as he performed ceremonies without proper authorization.","translation":"彼は適切な許可なしに儀式を行ったため、司教を装った行為で告発された。"}],"collocations":["pseudoepiscopal authority","pseudoepiscopal claims","pseudoepiscopal practices"],"synonyms":["falsely episcopal","spuriously episcopal","pretended episcopal"],"antonyms":["genuinely episcopal","authentically episcopal"]}],"etymology":{"value":"From pseudo- (false) + episcopal (relating to a bishop or episcopacy).","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊɪˈpɪskəpəl","syllables":"pseu-do-e-pis-co-pal"},"inflection":{},"usage_notes":{"explanation":"Used to describe something that falsely claims to be episcopal, or related to a bishop. Often used in theological or historical contexts to denote illegitimate or unauthorized claims of episcopal authority.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["pseudoepiscopacy (noun): the state or condition of being pseudoepiscopal"],"related_terms":["episcopal","pseudo-","episcopalianism"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'pseudoepiscopal' is a highly specialized term, primarily used in theological or historical discussions to describe something falsely claiming to be episcopal. Understanding requires familiarity with ecclesiastical terminology and concepts of authority within church structures.","priority":"★☆☆"},"example_sentences":[{"sentence":"The group was accused of establishing a pseudoepiscopal structure without proper authorization from the established church.","translation":"そのグループは、確立された教会からの適切な許可なしに、仮の司教構造を確立したとして告発された。","type":"adjective","meaning_category":"仮の司教の"}]}