{"word":"when-issued","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(金融)発行前取引の、発行条件確定前の","english_definition":"(of a security) traded before it has been issued; conditional on the issue.","examples":[{"sentence":"The stock is trading on a when-issued basis.","translation":"その株は発行前取引されている。"},{"sentence":"When-issued trading allows investors to buy or sell securities before they are officially available.","translation":"発行前取引により、投資家は証券が正式に利用可能になる前に売買できる。"}],"collocations":["when-issued trading","when-issued basis","trade when-issued"],"synonyms":["pre-issuance","pre-market (in some contexts)"],"antonyms":["regular way","ex-distribution"],"notes":"This term is primarily used in financial contexts, especially when discussing stocks, bonds, or other securities. It indicates that the trading is contingent on the security actually being issued."}],"etymology":{"value":"The term 'when-issued' directly reflects the condition of the trading: it will occur 'when' the security is 'issued'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛn ˈɪʃud/","syllables":"when-is-sued"},"inflection":{"notes":"This term is typically used as an adjective and does not have plural forms or inflections."},"usage_notes":{"explanation":"'When-issued' (often abbreviated as 'WI') refers to a conditional transaction in a security (like a stock or bond) that has been authorized but not yet issued. Trading occurs with the understanding that the transaction will only be completed if and when the security is actually issued. This type of trading allows investors to express their interest and potentially secure a position in the new security early on.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is when issued.","correct":"✓ The company's stock is trading on a when-issued basis.","note":"'When-issued' describes the trading status of a security, not the status of the company itself. It's more accurate to say that the stock or bond is trading on a when-issued basis."},{"incorrect":"✗ When issued stocks are always a good investment.","correct":"✓ Trading in when-issued stocks carries risks and is not always a good investment.","note":"Like any investment, trading in when-issued securities involves risk. It's not guaranteed to be profitable."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["ex-dividend","record date","issuance","security","bond","stock","underwriting"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized financial vocabulary)","frequency_google_ngram":"Low (Specific to finance)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'When-issued' is a term used in finance to describe trading that happens before a new stock or bond is officially available. It's like making a deal to buy something before it's even made. The trade will only go through if the company actually issues the stock or bond. It's a bit risky, so it's mostly used by people who know a lot about investing."},"example_sentences":[{"sentence":"The new Treasury bonds are currently trading on a **when-issued** basis.","translation":"新しい国債は現在、発行前取引されている。","type":"general","meaning_category":"Financial Trading"},{"sentence":"Investors can participate in **when-issued** trading to get early access to the security.","translation":"投資家は発行前取引に参加することで、その証券への早期アクセスを得ることができる。","type":"general","meaning_category":"Financial Trading"},{"sentence":"The **when-issued** price can provide an indication of the market's expectation for the security's value.","translation":"発行前価格は、市場がその証券の価値に期待する指標となる可能性がある。","type":"general","meaning_category":"Financial Trading"}]}