{"word":"aromatization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"芳香族化、芳香族化反応","english_definition":"A chemical reaction in which a non-aromatic compound is converted to an aromatic compound.","examples":[{"sentence":"Aromatization of alkanes is an important process in the production of gasoline.","translation":"アルカンの芳香族化は、ガソリン製造における重要なプロセスです。"},{"sentence":"The aromatization reaction is typically carried out at high temperatures and pressures.","translation":"芳香族化反応は通常、高温高圧下で行われます。"}],"collocations":["catalytic aromatization","thermal aromatization"],"synonyms":["dehydrocyclization"],"antonyms":["hydrogenation","reduction"]},{"part_of_speech":"noun","definition":"（ワインなどの）アロマの強化、芳香付け","english_definition":"The process of enhancing or adding aroma, especially to food or beverages.","examples":[{"sentence":"Aromatization of the wine was achieved through the addition of oak chips.","translation":"ワインの芳香付けは、オークチップの添加によって行われました。"},{"sentence":"The chef used various herbs for the aromatization of the sauce.","translation":"シェフはソースの芳香付けに様々なハーブを使用しました。"}],"collocations":["wine aromatization","food aromatization"],"synonyms":["flavoring","scenting","infusion"],"antonyms":["deodorization"]}],"etymology":{"value":"From 'aromatic' + '-ization'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌroʊmətaɪˈzeɪʃən/","syllables":"a-ro-ma-ti-za-tion"},"inflection":{"noun_plural":"aromatizations"},"usage_notes":{"explanation":"'Aromatization' primarily refers to a chemical process in organic chemistry where a non-aromatic compound becomes aromatic. It can also refer to the process of adding or enhancing aroma, particularly in the context of food and beverages. The specific meaning depends on the context in which it is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aromatization of the room was done with air freshener.","correct":"✓ The scenting of the room was done with air freshener.","note":"While 'aromatization' can refer to adding aroma, it's more common to use 'scenting' or 'fragrancing' in everyday contexts like air fresheners. 'Aromatization' is more often used in technical or scientific contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["aromatize (verb)","aromatic (adjective)","aromaticity (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aromatization' is a technical term primarily used in chemistry to describe the process of converting a non-aromatic compound into an aromatic one. It can also be used in the context of food and beverages to refer to the process of enhancing or adding aroma. Due to its technical nature, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Catalytic **aromatization** is used to convert alkanes into aromatic hydrocarbons.","translation":"接触芳香族化は、アルカンを芳香族炭化水素に変換するために使用されます。","type":"noun","meaning_category":"Chemical reaction"},{"sentence":"The **aromatization** of the wine was carefully controlled to achieve the desired flavor profile.","translation":"ワインの芳香付けは、望ましい風味特性を達成するために慎重に管理されました。","type":"noun","meaning_category":"Food/beverage aroma enhancement"}]}