{"word":"recoagulated","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt/vi","definition":"再凝固した、再び凝固させた","english_definition":"To coagulate again; to cause to coagulate again.","examples":[{"sentence":"The blood recoagulated after the initial clot was disrupted.","translation":"最初の血栓が崩壊した後、血液は再び凝固した。"},{"sentence":"The scientist recoagulated the protein solution for further analysis.","translation":"科学者はさらなる分析のためにタンパク質溶液を再凝固させた。"}],"collocations":["recoagulate blood","recoagulate protein"],"synonyms":["re-clotted","re-solidified"],"antonyms":["liquefied","dissolved"]}],"etymology":{"value":"The word \"recoagulated\" is formed by adding the prefix \"re-\" (meaning again) to the word \"coagulated.\" \"Coagulated\" comes from the Latin word \"coagulare,\" meaning \"to cause to curdle or congeal.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriː.koʊˈæɡ.jə.leɪ.tɪd/","syllables":"re-co-ag-u-la-ted"},"inflection":{"verb_forms":{"present_simple":["recoagulate","recoagulates"],"past_simple":"recoagulated","past_participle":"recoagulated","present_participle":"recoagulating"}},"usage_notes":{"explanation":"\"Recoagulated\" describes the process of something that was previously coagulated (thickened or solidified) returning to a coagulated state after being disrupted or liquefied. It is often used in scientific or medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The milk was recoagulating before I heated it.","correct":"✓ The milk was coagulating before I heated it.","note":"If the milk hasn't been coagulated before, use \"coagulating\" instead of \"recoagulating.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["recoagulation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"recoagulated\" is a technical term primarily used in scientific or medical contexts. It describes the process of something solidifying again after it has been liquefied or disrupted. Understanding this word requires familiarity with the base word \"coagulate\" and the prefix \"re-,\""},"example_sentences":[{"sentence":"The cheese curds were gently heated to encourage the whey to separate before being recoagulated.","translation":"チーズカードは、ホエーが分離するのを促すために穏やかに加熱され、その後再凝固された。","type":"verb","meaning_category":"再凝固した"},{"sentence":"The experimental process involved dissolving and then recoagulating the protein sample.","translation":"実験プロセスでは、タンパク質サンプルを溶解してから再凝固させる必要があった。","type":"verb","meaning_category":"再凝固させた"}]}