{"word":"supermoral","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"道徳を超越した、道徳的区別を超えた","english_definition":"Transcending morality; beyond moral distinctions.","examples":[{"sentence":"The artist's vision was supermoral, concerned with beauty rather than ethics.","translation":"その芸術家のビジョンは道徳を超越しており、倫理よりも美に関心があった。"},{"sentence":"Some philosophers argue that certain acts of self-sacrifice are supermoral.","translation":"自己犠牲の特定の行為は道徳を超越していると主張する哲学者もいる。"}],"collocations":["supermoral act","supermoral vision","supermoral perspective"],"synonyms":["amoral","nonmoral","transmoral"],"antonyms":["moral","immoral"]},{"part_of_speech":"adjective","definition":"道徳的に非常に優れている、極めて道徳的な","english_definition":"Exceedingly moral; surpassing ordinary moral standards.","examples":[{"sentence":"Her supermoral behavior inspired everyone around her.","translation":"彼女の極めて道徳的な行動は周りのすべての人々を鼓舞した。"},{"sentence":"He was praised for his supermoral integrity and unwavering principles.","translation":"彼はその非常に道徳的な誠実さと揺るぎない原則で賞賛された。"}],"collocations":["supermoral behavior","supermoral integrity","supermoral principles"],"synonyms":["hypermoral","ultramoral","highly moral"],"antonyms":["immoral","unethical"]}],"etymology":{"value":"'Super-' (above, beyond) + 'moral' (concerned with the principles of right and wrong behavior). The term suggests either a state beyond conventional morality or an extreme adherence to moral principles.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈmɔːrəl/","syllables":"su-per-mor-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., 'very supermoral')."},"usage_notes":{"explanation":"The term 'supermoral' can have two distinct interpretations: either transcending or being beyond the scope of morality altogether (similar to 'amoral'), or exceeding ordinary moral standards to an extreme degree. The context usually dictates which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ His actions were supermoral, so he couldn't be judged.","correct":"✓ His actions were amoral, so he couldn't be judged by moral standards.","note":"If the intention is that the actions are outside the realm of moral judgment, 'amoral' is more appropriate. 'Supermoral' suggests either beyond morality or extremely moral."},{"incorrect":"✗ She was supermoral because she always followed the rules.","correct":"✓ She was highly moral because she always followed the rules.","note":"Simply following rules doesn't necessarily make someone 'supermoral'; it suggests they are 'moral' or 'highly moral'."}],"priority":"★★☆"},"related_words":{"derivatives":["supermorality (noun)"],"phrases":["beyond morality","transcending morality"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supermoral' is a relatively uncommon word with two primary interpretations: either transcending or being beyond the scope of morality (similar to 'amoral'), or exceeding ordinary moral standards to an extreme degree. The context usually dictates which meaning is intended. It is often used in philosophical or ethical discussions. Understanding the nuances requires a sophisticated grasp of moral philosophy.","priority":"★★☆"},"example_sentences":[{"sentence":"The character's choices were seen as supermoral, operating outside the bounds of conventional ethics.","translation":"そのキャラクターの選択は、従来の倫理の範囲外で作用する、道徳を超越したものと見なされた。","type":"adjective","meaning_category":"Transcending morality"},{"sentence":"Her supermoral dedication to helping others was an inspiration to the community.","translation":"彼女の他人を助けることへの極めて道徳的な献身は、地域社会へのインスピレーションとなった。","type":"adjective","meaning_category":"Extremely moral"}]}