{"word":"Sovietisation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ソビエト化、ソ連化","english_definition":"The adoption of a political and economic system based on that of the Soviet Union; the process of becoming Soviet.","examples":[{"sentence":"The Sovietisation of Eastern Europe after World War II led to significant political and social changes.","translation":"第二次世界大戦後の東ヨーロッパのソビエト化は、重大な政治的および社会的変化をもたらした。"},{"sentence":"Many Baltic states resisted Sovietisation efforts.","translation":"多くのバルト諸国はソビエト化の試みに抵抗した。"},{"sentence":"The cultural Sovietisation involved the promotion of socialist realism in arts and literature.","translation":"文化的なソビエト化は、芸術と文学における社会主義リアリズムの推進を伴った。"}],"collocations":["cultural Sovietisation (文化的ソビエト化)","political Sovietisation (政治的ソビエト化)","economic Sovietisation (経済的ソビエト化)","forced Sovietisation (強制的なソビエト化)","process of Sovietisation (ソビエト化の過程)"],"synonyms":["communization","Stalinization","Bolshevization"],"antonyms":["de-Sovietisation","Westernization","democratization"]}],"etymology":{"value":"Formed from 'Soviet' + '-isation'. 'Soviet' refers to the political organization in the former Soviet Union. '-isation' is a suffix denoting a process or action of making something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊviːtɪˈzeɪʃən/","syllables":"So-vi-et-i-sa-tion"},"inflection":{"noun_plural":"Sovietisations"},"usage_notes":{"explanation":"'Sovietisation' describes the process by which states or societies adopt political, economic, and social systems modeled after the Soviet Union. This often involved the implementation of communist ideology, collectivization of agriculture, nationalization of industries, and suppression of political opposition. It is often associated with the post-World War II era in Eastern Europe.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sovietisation was a peaceful process in all countries.","correct":"✓ The Sovietisation was rarely a peaceful process and often involved coercion.","note":"Sovietisation typically involved coercion and was rarely peaceful."},{"incorrect":"✗ Sovietisation only affected the economy.","correct":"✓ Sovietisation affected political, economic, and social aspects of life.","note":"Sovietisation affected all aspects of society, not just the economy."}],"priority":"★★☆"},"related_words":{"derivatives":["Sovietize (verb)","Soviet (adjective, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Sovietisation' refers to the process of adopting the political, economic, and social systems of the Soviet Union. This term is typically used in historical and political contexts, particularly when discussing the influence of the Soviet Union on other countries, especially in Eastern Europe after World War II. Understanding this term requires knowledge of the Soviet Union's history and political system."},"example_sentences":[{"sentence":"The Baltic states experienced significant Sovietisation after being annexed by the Soviet Union.","translation":"バルト三国は、ソビエト連邦に併合された後、著しいソビエト化を経験した。","type":"general","meaning_category":"General"},{"sentence":"Economic Sovietisation involved the collectivization of agriculture and nationalization of industries.","translation":"経済的なソビエト化は、農業の集団化と産業の国有化を伴った。","type":"economic","meaning_category":"Economic"},{"sentence":"Cultural Sovietisation aimed to promote socialist realism in arts and suppress dissenting voices.","translation":"文化的なソビエト化は、芸術における社会主義リアリズムの推進と、異議を唱える声の抑圧を目的とした。","type":"cultural","meaning_category":"Cultural"}]}