{"word":"Tegeticula","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ユッカ蛾属：ユッカと共生関係にある蛾の属","english_definition":"A genus of moths in the family Prodoxidae, known for their obligate mutualism with yucca plants, where they pollinate the yucca flowers and lay their eggs in the developing fruit.","examples":[{"sentence":"Tegeticula moths are essential for the reproduction of many yucca species.","translation":"ユッカ蛾属の蛾は、多くのユッカ種の繁殖に不可欠です。"},{"sentence":"The larvae of Tegeticula feed exclusively on yucca seeds.","translation":"ユッカ蛾属の幼虫は、ユッカの種子のみを餌とします。"}],"collocations":["yucca moth","yucca pollination","moth-plant mutualism"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Tegeticula' is derived from the Latin word 'tegeticula,' meaning 'small mat' or 'covering,' possibly referring to the appearance of the moth's wings or its behavior of covering the yucca flower.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛdʒɪˈkjuːlə/","syllables":"Te-ge-tic-u-la"},"inflection":{"notes":"Plural: Tegeticulas"},"usage_notes":{"explanation":"'Tegeticula' is a scientific term used in botany and entomology to refer specifically to the yucca moth genus. It's typically encountered in academic or scientific contexts when discussing plant-insect interactions, pollination biology, or the ecology of yucca plants. The mutualistic relationship between Tegeticula moths and yucca plants is a classic example of coevolution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tegeticula is a type of yucca.","correct":"✓ Tegeticula is a type of moth.","note":"Tegeticula is a genus of moths, not a type of yucca plant."},{"incorrect":"✗ Tegeticula moths harm yucca plants.","correct":"✓ Tegeticula moths help yucca plants by pollinating them.","note":"Tegeticula moths have a mutualistic relationship with yucca plants, meaning they benefit each other."}],"priority":"★★☆"},"related_words":{"derivatives":["Tegeticulidae (a family sometimes used to classify these moths)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tegeticula' is a highly specialized scientific term used primarily within the fields of entomology and botany. Understanding its meaning requires familiarity with biological nomenclature and ecological concepts such as mutualism and coevolution. The term is unlikely to be encountered outside of academic or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Research on Tegeticula has provided valuable insights into the evolution of mutualistic relationships.","translation":"ユッカ蛾属に関する研究は、共生関係の進化に関する貴重な洞察を提供してきました。","type":"noun","meaning_category":"ユッカ蛾属"},{"sentence":"The survival of many yucca species depends on the pollination services provided by Tegeticula moths.","translation":"多くのユッカ種の生存は、ユッカ蛾属の蛾によって提供される受粉サービスに依存しています。","type":"noun","meaning_category":"ユッカ蛾属"}]}