{"word":"all-peopled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Populated entirely by people; where people are the only inhabitants.","english_definition":"Consisting entirely of people; inhabited exclusively by people.","examples":[{"sentence":"The all-peopled planet was a bustling metropolis.","translation":"その人々だけの惑星は、賑やかな大都市だった。"},{"sentence":"The all-peopled conference room buzzed with conversation.","translation":"人々だけで埋め尽くされた会議室は、会話で騒がしかった。"}],"collocations":["all-peopled world","all-peopled city","all-peopled gathering"],"synonyms":["populated","manned","inhabited"],"antonyms":["uninhabited","deserted","empty"]}],"etymology":{"value":"Compound word formed by combining 'all' and 'peopled'. 'Peopled' is the past participle of the verb 'people', meaning to populate or inhabit.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɔːl ˌpiːpəld/","syllables":"all-peo-pled"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'All-peopled' is used to emphasize that a place or situation is exclusively populated by people, with no other types of inhabitants or elements present. It is often used to create a specific image or to highlight the human presence in a particular context.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The all-peopled animal shelter was surprisingly quiet.","correct":"The animal shelter was full of people.","note":"'All-peopled' is generally used for places or situations where you would expect to find a mix of people and other things, not just people. An animal shelter would naturally have animals, so 'all-peopled' doesn't fit."}],"priority":"N/A"},"related_words":{"derivatives":["people (noun, verb)","peopled (adjective)","overpeopled (adjective)","underpeopled (adjective)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly used.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'All-peopled' is a relatively uncommon and complex adjective used to describe a place or situation that is entirely populated by people. It is used to emphasize the absence of anything other than people. Due to its specific and somewhat unusual nature, it is more likely to be encountered in advanced texts or creative writing."},"example_sentences":[{"sentence":"The spaceship landed on an all-peopled colony, where generations had lived in isolation.","translation":"その宇宙船は、何世代にもわたって隔離された状態で暮らしてきた、人々だけの植民地に着陸した。","type":"adjective","meaning_category":"populated by people"},{"sentence":"The artist depicted an all-peopled cityscape, devoid of any natural elements.","translation":"そのアーティストは、自然の要素が一切ない、人々だけの都市景観を描いた。","type":"adjective","meaning_category":"populated by people"}]}