{"word":"empyreumatic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"焦げ臭い、焙焼臭い、乾留性の","english_definition":"Having a smell or taste characteristic of burning or charring organic matter; produced by or resulting from dry distillation.","examples":[{"sentence":"The air was thick with the empyreumatic odor of the forest fire.","translation":"空気は山火事の焦げ臭い匂いで充満していた。"},{"sentence":"Empyreumatic oils are produced during the pyrolysis of wood.","translation":"乾留性の油は木材の熱分解中に生成される。"}],"collocations":["empyreumatic odor","empyreumatic oil","empyreumatic taste"],"synonyms":["pyrolytic","charred","burnt","smoky"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'empyreuein' meaning 'to kindle into flame', from 'en' (in) + 'pyr' (fire).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌempɪruːˈmætɪk/","syllables":"em-py-reu-mat-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Empyreumatic' describes smells or tastes associated with the burning or charring of organic materials. It is often used in contexts related to chemistry, cooking, or describing environmental conditions after a fire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perfume had an empyreumatic scent.","correct":"✓ The perfume had a smoky or woody scent.","note":"'Empyreumatic' specifically refers to the smell of burning organic matter, not just any strong or unusual scent."}],"priority":"★☆☆"},"related_words":{"derivatives":["empyreuma (noun): The characteristic smell or taste of burning organic matter.","empyreumatize (verb): To impart an empyreumatic quality to something."],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Empyreumatic' is a technical term used to describe the smell or taste of something that has been burned or charred, especially organic matter. It's a relatively rare word, most often encountered in scientific or technical contexts, such as chemistry or environmental science, or in very descriptive writing."},"example_sentences":[{"sentence":"The old distillery had a distinct empyreumatic aroma from the charred oak barrels.","translation":"その古い蒸留所は、焦げたオーク樽から独特の焦げ臭い香りがした。","type":"adjective","meaning_category":"焦げ臭い"},{"sentence":"The empyreumatic compounds in the smoke were irritating to the respiratory system.","translation":"煙の中の乾留性化合物は呼吸器系を刺激した。","type":"adjective","meaning_category":"乾留性の"}]}