{"word":"three-corded","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"3本のひもで編まれた、3重の","english_definition":"Made of or consisting of three cords or strands intertwined.","examples":[{"sentence":"A three-corded rope is stronger than a single strand.","translation":"3本のひもで編まれたロープは、1本のひもよりも強い。"},{"sentence":"The necklace featured a three-corded design.","translation":"そのネックレスは3重のデザインが特徴だった。"}],"collocations":["three-corded rope","three-corded necklace","three-corded bracelet"],"synonyms":["triple-stranded","three-ply","braided"],"antonyms":["single-stranded"]},{"part_of_speech":"adjective","definition":"（比喩的に）3つの要素が強く結びついた、3者間の強い絆","english_definition":"(Figuratively) Characterized by a strong bond or connection between three elements or parties.","examples":[{"sentence":"Their three-corded friendship could withstand any challenge.","translation":"彼らの3者間の強い友情は、どんな困難にも耐えられた。"},{"sentence":"The success of the project relied on a three-corded partnership between the company, the government, and the community.","translation":"プロジェクトの成功は、会社、政府、地域社会の3者間の強い協力関係にかかっていた。"}],"collocations":["three-corded friendship","three-corded partnership","three-corded alliance"],"synonyms":["tripartite","threefold","united","intertwined"],"antonyms":["divided","separate","independent"]}],"etymology":{"value":"Derived from the combination of 'three' (number 3) and 'corded' (made of cords). The figurative sense likely originates from the idea that three strands intertwined are stronger than one.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθriːˌkɔːrdɪd/","syllables":"three-cord-ed"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'three-corded' is often used metaphorically to describe a strong and resilient bond or relationship, drawing on the image of three strands intertwined to create a stronger whole. It emphasizes the idea that unity and cooperation between multiple parties can lead to greater strength and stability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The three-corded team worked well.","correct":"✓ The three-member team worked well.","note":"Use 'three-corded' when referring to a bond or relationship, not just a group of three people. If you simply mean a team of three, use 'three-member team' or 'three-person team'."}],"priority":"★★☆"},"related_words":{"derivatives":["cord (noun): a length of twisted fibers","threefold (adjective/adverb): having three parts or aspects; by three times as much"],"idioms_phrases":["a cord of three strands is not easily broken (Ecclesiastes 4:12): a biblical reference emphasizing the strength of unity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly used in general English; more likely to be found in specialized contexts or literature)","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Three-corded' is a relatively uncommon adjective, often used in a metaphorical or symbolic sense. It suggests a strong bond or connection formed by three elements working together. The term is more likely to be encountered in literature, religious texts, or specialized contexts where the idea of unity and strength through collaboration is emphasized. Understanding the figurative meaning requires a higher level of English proficiency.","priority":"★★☆"},"example_sentences":[{"sentence":"The success of the project depended on the three-corded relationship between the designers, the engineers, and the marketing team.","translation":"プロジェクトの成功は、デザイナー、エンジニア、マーケティングチームの3者間の強い関係にかかっていた。","type":"adjective","meaning_category":"Metaphorical strong bond"},{"sentence":"The ancient manuscript was bound with a three-corded string.","translation":"古代の写本は3本のひもで綴じられていた。","type":"adjective","meaning_category":"Physical description"},{"sentence":"The three-corded alliance proved to be unbreakable.","translation":"その3者間の同盟は、壊れることのないものだと証明された。","type":"adjective","meaning_category":"Metaphorical strong bond"}]}