{"word":"Ruhr","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ルール（ドイツの工業地帯）","english_definition":"An industrial region in western Germany, located in North Rhine-Westphalia.","examples":[{"sentence":"The Ruhr is known for its coal mines and steel production.","translation":"ルール地方は、炭鉱と鉄鋼生産で知られています。"},{"sentence":"The Ruhr region underwent significant economic changes in the late 20th century.","translation":"ルール地方は20世紀後半に大きな経済変化を経験しました。"}],"collocations":["Ruhr area","Ruhr region","Ruhr valley","industrial Ruhr"],"synonyms":["Ruhrgebiet (German)"],"antonyms":[]}],"etymology":{"value":"The name 'Ruhr' comes from the Ruhr River, which flows through the region. The origin of the river name is uncertain, but it may be related to Old High German words for 'rusty' or 'turbid'.","priority":"★★☆"},"pronunciation":{"ipa":"/ruːr/","syllables":"Ruhr (1 syllable)"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"'Ruhr' refers specifically to the industrialized area in Germany. It's a geographical region, not a city or town. When referring to the area, it's common to use phrases like 'the Ruhr region' or 'the Ruhr area'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Ruhr city.","correct":"✓ I'm going to the Ruhr region.","note":"'Ruhr' is a region, not a city, so you can't go to 'Ruhr city'."}],"priority":"★★☆"},"related_words":{"derivatives":["Ruhrgebiet (German for Ruhr region)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (in specific contexts related to geography, history, or economics)","frequency_google_ngram":"Relatively low frequency, except in specialized texts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Ruhr' is a proper noun referring to a specific industrial region in Germany. Understanding its meaning requires some knowledge of European geography and history, particularly concerning industrial development in the 19th and 20th centuries. It is not a common word in everyday conversation but may appear in news articles, documentaries, or academic texts related to economics, geography, or European history."},"example_sentences":[{"sentence":"The **Ruhr** was a major center of heavy industry in Germany.","translation":"ルール地方はドイツの重工業の主要な中心地でした。","type":"noun","meaning_category":"Geographic Region"},{"sentence":"Efforts are being made to revitalize the economy of the **Ruhr** region.","translation":"ルール地方の経済を活性化するための努力がなされています。","type":"noun","meaning_category":"Geographic Region"}]}