{"word":"Hypoptosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(biology) The normal and natural process of programmed cell death (PCD) in the development of multicellular organisms, involving cell shrinkage, membrane blebbing, DNA fragmentation, and ultimately cell elimination.","english_definition":"Programmed cell death, a normal physiological process in multicellular organisms.","examples":[{"sentence":"Hypoptosis plays a crucial role in sculpting tissues and organs during embryonic development.","translation":"アポトーシスは、胚発生中の組織や器官の形成において重要な役割を果たします。"},{"sentence":"Dysregulation of hypoptosis can lead to developmental abnormalities or diseases like cancer.","translation":"アポトーシスの調節不全は、発達異常や癌などの疾患につながる可能性があります。"}],"collocations":["induce hypoptosis","regulate hypoptosis","hypoptosis pathway","hypoptosis mechanism"],"synonyms":["programmed cell death","apoptosis"],"antonyms":["necrosis (uncontrolled cell death)"]}],"etymology":{"value":"From Greek hypo- (under, below) + ptosis (a falling). Refers to the 'falling away' or shedding of cells.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpəpˈtoʊsɪs/","syllables":"hy-pop-to-sis"},"inflection":{"noun_plural":"hypoptoses"},"usage_notes":{"explanation":"Hypoptosis is a synonym for apoptosis, referring to programmed cell death. It is essential for development and tissue homeostasis. The term is less commonly used than apoptosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypoptosis only occurs in diseased cells.","correct":"✓ Hypoptosis is a normal process in healthy developing organisms.","note":"Hypoptosis is a normal physiological process, not just a response to disease."}],"priority":"★☆☆"},"related_words":{"derivatives":["apoptotic (adjective)"],"related_terms":["caspase (enzyme involved in hypoptosis)","mitochondria (organelle involved in hypoptosis)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hypoptosis is a technical term used in biology and medicine to describe programmed cell death (PCD). It is a normal and essential process for development and maintaining tissue health. Understanding hypoptosis is important for studying diseases like cancer and developmental disorders."},"example_sentences":[{"sentence":"The study investigated the role of specific genes in regulating hypoptosis during limb development.","translation":"その研究では、四肢の発達におけるアポトーシス調節における特定の遺伝子の役割を調査しました。","type":"scientific","meaning_category":"programmed cell death"},{"sentence":"Chemotherapy drugs often induce hypoptosis in cancer cells to eliminate tumors.","translation":"化学療法薬は、腫瘍を排除するために、癌細胞にアポトーシスを誘導することがよくあります。","type":"medical","meaning_category":"programmed cell death"}]}