{"word":"hypotony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"筋緊張低下、低緊張","english_definition":"abnormally low muscle tone (the amount of tension or resistance to stretch in a muscle), often resulting in floppiness.","examples":[{"sentence":"Infants with hypotony may have difficulty feeding and holding their heads up.","translation":"筋緊張低下の乳児は、授乳や頭を支えるのが困難な場合があります。"},{"sentence":"Hypotony can be a symptom of various neurological or muscular disorders.","translation":"筋緊張低下は、さまざまな神経または筋肉の疾患の症状である可能性があります。"}],"collocations":["severe hypotony (重度の筋緊張低下)","generalized hypotony (全身性筋緊張低下)","neonatal hypotony (新生児筋緊張低下)","hypotony and weakness (筋緊張低下と脱力)"],"synonyms":["muscle weakness","floppiness","decreased muscle tone","flaccidity"],"antonyms":["hypertonia","spasticity","muscle rigidity"]}],"etymology":{"value":"From Greek 'hypo-' (under, below) + 'tonos' (tension) + '-y' (state, condition).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈpɒtəni/","syllables":"hy-po-to-ny"},"inflection":{"noun_plural":"hypotonias (rarely used)"},"usage_notes":{"explanation":"Hypotony refers specifically to reduced muscle tone, not necessarily muscle strength (although weakness may also be present). It is a clinical sign, not a disease itself, and can be caused by various underlying conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has hypotonia in their brain.","correct":"✓ The patient has hypotonia in their muscles. / ✓ The patient has hypotonia.","note":"Hypotonia affects muscles, not the brain directly, although the cause may be neurological. The location of hypotonia should be specified as muscles, or the sentence can be shortened to just 'The patient has hypotonia.'"},{"incorrect":"✗ Hypotonia is the same as paralysis.","correct":"✓ Hypotonia is not the same as paralysis.","note":"Hypotonia is reduced muscle tone, while paralysis is the complete loss of muscle function. They are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["hypotonic (adjective: having reduced tone or tension)","hypotonically (adverb)"],"medical_terms":["hypertonia (increased muscle tone)","atonia (lack of muscle tone)","dystonia (movement disorder with sustained muscle contractions)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypotony' is a medical term referring to abnormally low muscle tone, often resulting in floppiness. It is important to note that hypotony is a sign, not a disease itself, and can be caused by various underlying conditions affecting the nervous system or muscles. The term is primarily used in medical contexts and is not commonly encountered in everyday language. Distinguishing it from related terms like 'hypertonia' (increased muscle tone) and 'atonia' (lack of muscle tone) is crucial for precise communication in healthcare settings."},"example_sentences":[{"sentence":"The doctor noted significant **hypotony** in the infant's trunk and limbs.","translation":"医師は、その乳児の体幹と四肢に著しい筋緊張低下を認めた。","type":"noun","meaning_category":"筋緊張低下"},{"sentence":"Early intervention is crucial for children diagnosed with **hypotony**.","translation":"筋緊張低下と診断された子供たちには、早期介入が重要である。","type":"noun","meaning_category":"筋緊張低下"},{"sentence":"Physical therapy can help improve muscle tone and function in patients with **hypotony**.","translation":"理学療法は、筋緊張低下の患者の筋緊張と機能を改善するのに役立つ。","type":"noun","meaning_category":"筋緊張低下"}]}