{"word":"Hysterolithiasis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"子宮石症（しきゅうせきしょう）：子宮内に石ができる病状","english_definition":"The presence of calculi (stones) in the uterus.","examples":[{"sentence":"Hysterolithiasis is a rare condition that can cause pelvic pain.","translation":"子宮石症はまれな病状であり、骨盤痛を引き起こす可能性があります。"},{"sentence":"The diagnosis of hysterolithiasis is typically made through imaging techniques such as ultrasound or X-ray.","translation":"子宮石症の診断は通常、超音波やX線などの画像診断技術によって行われます。"}],"collocations":["uterine calculi","uterine stones","pelvic pain","imaging techniques","ultrasound","X-ray"],"synonyms":["uterine calculi","uterine lithiasis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hystera' (uterus), 'lithos' (stone), and 'iasis' (process, condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstəroʊlɪˈθaɪəsɪs/","syllables":"his-ter-o-li-thi-a-sis"},"inflection":{"noun_plural":"hysterolithiases"},"usage_notes":{"explanation":"Hysterolithiasis is a relatively rare medical condition. Diagnosis often involves excluding other causes of pelvic pain or abnormal bleeding. Treatment options depend on the size and location of the stones, as well as the patient's symptoms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hysterolithiasis is the same as kidney stones.","correct":"✓ Hysterolithiasis refers to stones specifically in the uterus, not the kidneys.","note":"Hysterolithiasis is specific to the uterus, while kidney stones are found in the kidneys."}],"priority":"★☆☆"},"related_words":{"derivatives":["hysterolith (子宮石)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hysterolithiasis is a complex medical term referring to the presence of stones within the uterus. Understanding this term requires a background in medical terminology, specifically knowledge of the Greek roots from which it is derived. The condition itself is rare, and discussion of it is typically limited to medical contexts."},"example_sentences":[{"sentence":"The patient presented with chronic pelvic pain, and imaging revealed a case of hysterolithiasis.","translation":"患者は慢性的な骨盤痛を訴え、画像検査で子宮石症の症例が明らかになった。","type":"medical","meaning_category":"子宮石症"}]}