{"word":"undercutter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ビジネス) 不当廉売者、ダンピング業者、出し抜き業者","english_definition":"A person or company that sells goods or services at a lower price than their competitors, often in a way that is considered unfair or unethical.","examples":[{"sentence":"The local businesses struggled to compete with the undercutter who slashed prices.","translation":"地元の企業は、価格を大幅に引き下げた不当廉売業者との競争に苦戦した。"},{"sentence":"He was known as an undercutter because he always offered the lowest bid on projects.","translation":"彼は常にプロジェクトで最低価格を提示するため、出し抜き業者として知られていた。"}],"collocations":["price undercutter","market undercutter"],"synonyms":["price cutter","discounter","dumping agent","competitor","rival"],"antonyms":["price fixer","colluder"]},{"part_of_speech":"noun","definition":"(機械) アンダーカッター (鉱山などで下から切り込む機械)","english_definition":"A machine used in mining to cut into the base of a coal seam or other mineral deposit.","examples":[{"sentence":"The undercutter made quick work of the coal seam, preparing it for extraction.","translation":"アンダーカッターは石炭層を迅速に処理し、採掘の準備を整えた。"}],"collocations":["coal undercutter","mining undercutter"],"synonyms":["mining machine","cutter"],"antonyms":[]}],"etymology":{"value":"The word \"undercutter\" is formed by combining the verb \"undercut\" (to sell goods or services at a lower price than a competitor) with the suffix \"-er\" (indicating a person or thing that performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈkʌtər/","syllables":"un-der-cut-ter"},"inflection":{"noun_plural":"undercutters"},"usage_notes":{"explanation":"The term \"undercutter\" typically carries a negative connotation in business contexts, suggesting that the person or company is engaging in practices that are harmful to the market or to other businesses. It can also refer to a specific type of mining machinery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an undercutter of wood.","correct":"✓ He is a wood undercutter.","note":"When referring to the machine, the word order is typically \"wood undercutter\" or \"coal undercutter\", specifying the material being cut."}],"priority":"★☆☆"},"related_words":{"derivatives":["undercut (verb, noun)","undercutting (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undercutter\" has two main meanings. In a business context, it refers to someone who unfairly lowers prices to gain an advantage over competitors. In mining, it refers to a machine that cuts into mineral deposits. The business meaning often carries a negative connotation."},"example_sentences":[{"sentence":"The new online retailer was accused of being an **undercutter** by the established brick-and-mortar stores.","translation":"その新しいオンライン小売業者は、既存の店舗型小売店から不当廉売業者であると非難された。","type":"noun","meaning_category":"不当廉売者"},{"sentence":"The **undercutter** efficiently prepared the coal seam for the miners.","translation":"アンダーカッターは効率的に石炭層を準備し、鉱夫たちのために採掘しやすい状態にした。","type":"noun","meaning_category":"(機械) アンダーカッター"}]}