{"word":"opacities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不透明度、不透明な部分、濁り (opacity の複数形)","english_definition":"plural form of opacity: the condition of lacking transparency or translucence; opaque areas or spots.","examples":[{"sentence":"The X-ray showed some opacities in the lungs.","translation":"レントゲン写真には肺にいくつかの不透明な影が見られた。"},{"sentence":"The artist used different opacities of paint to create depth in the painting.","translation":"そのアーティストは絵画に奥行きを出すために、さまざまな濃さの不透明な絵の具を使った。"},{"sentence":"These opacities can indicate various medical conditions.","translation":"これらの濁りは様々な病状を示している可能性がある。"}],"collocations":["lung opacities (肺の濁り)","ground-glass opacities (すりガラス状陰影)","increased opacities (不透明度の増加)","multiple opacities (複数の濁り)"],"synonyms":["cloudiness","murkiness","nontransparency","opaqueness","turbidity"],"antonyms":["transparencies","clarities","lucidities"]}],"etymology":{"value":"'Opacities' is the plural of 'opacity'. 'Opacity' comes from the Latin word 'opacitas', which is derived from 'opacus' meaning 'dark' or 'shaded'.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈpæsətiz/","syllables":"o-pac-i-ties"},"inflection":{"noun_plural":"opacities","singular_form":"opacity"},"usage_notes":{"explanation":"'Opacities' refers to multiple instances or areas of being opaque (not transparent). In medical contexts, it often appears in imaging reports (X-rays, CT scans) to describe areas of the body that are less transparent than they should be, possibly indicating a medical issue. In art and design, it refers to varying degrees of nontransparency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opacity are visible on the scan.","correct":"✓ The opacities are visible on the scan.","note":"'Opacities' is plural, so it requires a plural verb ('are')."},{"incorrect":"✗ He only had one opacities.","correct":"✓ He only had one opacity.","note":"For a single instance, use the singular form 'opacity'."}],"priority":"★★☆"},"related_words":{"derivatives":["opacity (noun: the state of being opaque)","opaque (adjective: not able to be seen through; not transparent)","opaquely (adverb: in an opaque manner)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, typically found in specialized or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Opacities' is a technical term, most commonly used in medical imaging or in discussions of visual arts and design. It refers to areas or instances where something is not transparent, meaning light cannot pass through clearly. It's usually found in contexts where detailed descriptions of visual properties are important. Understanding this word requires familiarity with technical or specialized vocabulary."},"example_sentences":[{"sentence":"The CT scan revealed several small opacities in the patient's lungs.","translation":"CTスキャンで、患者の肺にいくつかの小さな濁りが見つかった。","type":"medical imaging","meaning_category":"medical"},{"sentence":"The artist layered different glazes with varying opacities to achieve the desired effect.","translation":"アーティストは、望ましい効果を得るために、さまざまな濃さのグレーズを重ね塗りした。","type":"art and design","meaning_category":"art"},{"sentence":"These opacities may indicate an infection or inflammation.","translation":"これらの濁りは、感染症や炎症を示している可能性がある。","type":"medical diagnosis","meaning_category":"medical"}]}