{"word":"outfabling","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"to surpass in fables or storytelling; to create more elaborate or impressive fables than another.","english_definition":"To exceed or surpass in the creation or telling of fables; to be more skilled at crafting or presenting fables.","examples":[{"sentence":"The new poet hoped to outfable his predecessors with his imaginative tales.","translation":"その新しい詩人は、想像力豊かな物語で前任者たちを凌駕したいと願っていた。"},{"sentence":"Her ability to outfable any storyteller made her famous throughout the land.","translation":"彼女のどんな語り手よりも素晴らしい寓話を作る能力は、彼女を国中に有名にした。"}],"collocations":[],"synonyms":["surpass","exceed","outdo","excel","outshine"],"antonyms":["underperform","fall behind"]}],"etymology":{"value":"Derived from the verb 'fable' (to create or tell a fable) with the prefix 'out-' (meaning to surpass or exceed).","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈfeɪblɪŋ/","syllables":"out-fa-bling"},"inflection":{"verb_forms":{"present_simple":["outfables"],"past_simple":"outfabled","past_participle":"outfabled","present_participle":"outfabling"}},"usage_notes":{"explanation":"'Outfabling' is a relatively rare and specialized word. It is used to describe the act of surpassing someone in the creation or telling of fables. The word emphasizes the skill and creativity involved in crafting fables.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is outfabling in the garden.","correct":"✓ He is outfabling other storytellers.","note":"'Outfabling' is transitive, requiring a direct object (what or whom is being surpassed)."},{"incorrect":"✗ The outfabling of the story was amazing.","correct":"✓ The outfabling storyteller was amazing.","note":"'Outfabling' is a verb; to use it as an adjective, you would typically use a related noun or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["fable","fabled","fabulist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly found in standard language learning resources)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Outfabling' is a niche word that combines 'out-' (to exceed) with 'fable' (a short story, typically with animals as characters, conveying a moral). It means to surpass someone in the creation or telling of fables. Due to its specificity and rarity, it would be typically encountered in advanced literary contexts. Understanding the component parts helps in deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The young writer aimed at outfabling the established authors with his innovative allegories.","translation":"その若い作家は、革新的な寓話で確立された作家たちを凌駕することを目指した。","type":"verb","meaning_category":"surpassing in fables"},{"sentence":"It was said that no one could outfable Aesop in his ability to convey wisdom through animal stories.","translation":"動物の物語を通して知恵を伝える能力において、イソップを凌駕できる者はいないと言われていた。","type":"verb","meaning_category":"surpassing in fables"}]}