{"word":"Dimercury","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A diatomic molecule consisting of two mercury atoms (Hg₂). It is unstable under normal conditions but can exist in mercury vapor at high temperatures.","english_definition":"A diatomic molecule consisting of two mercury atoms (Hg₂). It is unstable under normal conditions but can exist in mercury vapor at high temperatures.","examples":[{"sentence":"Dimercury molecules can be detected in mercury vapor lamps.","translation":"二水銀分子は水銀蒸気ランプで検出できます。"},{"sentence":"The formation of dimercury is favored at high temperatures due to increased kinetic energy.","translation":"二水銀の形成は、運動エネルギーの増加により高温で促進されます。"}],"collocations":["mercury vapor","diatomic molecule","high temperature","kinetic energy","chemical equilibrium"],"synonyms":["Hg₂","mercury dimer"],"antonyms":[]}],"etymology":{"value":"From 'di-' (meaning two) + 'mercury', indicating a molecule composed of two mercury atoms.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈmɜːrkjʊri/","syllables":"di-mer-cu-ry"},"inflection":{"noun_plural":"Dimercuries"},"usage_notes":{"explanation":"Dimercury (Hg₂) is primarily of theoretical and spectroscopic interest. It is not a stable compound under normal conditions but exists transiently in high-temperature mercury vapor. Its existence is important for understanding the behavior of mercury in various applications, such as lighting and plasma physics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dimercury is a stable compound at room temperature.","correct":"✓ Dimercury is unstable at room temperature.","note":"Dimercury is not stable under normal conditions."},{"incorrect":"✗ Dimercury is used as a catalyst in many reactions.","correct":"✓ Mercury compounds are used as catalysts in some reactions, but dimercury itself is not commonly used as a catalyst.","note":"While mercury compounds have catalytic applications, dimercury is not typically used as a catalyst."}],"priority":"★★☆"},"related_words":{"derivatives":["mercury","monatomic mercury","mercurous","mercuric"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Dimercury' refers to a specific diatomic molecule (Hg₂) formed by two mercury atoms. It is typically discussed in advanced chemistry and physics contexts, particularly when analyzing the behavior of mercury vapor at high temperatures. Understanding its existence and properties requires knowledge of chemical bonding and thermodynamics.","priority":"★★☆"},"example_sentences":[{"sentence":"Spectroscopic studies have confirmed the presence of dimercury in mercury discharges.","translation":"分光学的研究により、水銀放電中の二水銀の存在が確認されています。","type":"scientific","meaning_category":"chemistry"},{"sentence":"The equilibrium between monatomic and diatomic mercury is temperature-dependent.","translation":"単原子水銀と二原子水銀の平衡は温度に依存します。","type":"scientific","meaning_category":"chemistry"}]}