{"word":"companheirismo","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"友情、仲間意識、連帯感、協力","english_definition":"friendship, camaraderie, fellowship, solidarity, cooperation, or a sense of shared purpose and mutual support among companions or colleagues.","examples":[{"sentence":"Eles demonstraram companheirismo ao ajudar os necessitados.","translation":"They demonstrated solidarity by helping those in need."}],"collocations":["espírito de companheirismo (spirit of camaraderie)","laços de companheirismo (bonds of friendship)","promover o companheirismo (to promote fellowship)","companheirismo no trabalho (fellowship at work)","companheirismo entre amigos (friendship among friends)"],"synonyms":["amizade","camaradagem","solidariedade","fraternidade","união","cooperação"],"antonyms":["individualismo","isolamento","antagonismo","rivalidade"]}],"etymology":{"value":"Derivado de \"companheiro\" (companion), que vem do latim \"companio\", significando \"aquele que divide o pão com outro\" (com-panis).","priority":"★★☆"},"pronunciation":{"ipa":"/kõpaɲˈeɪ̯ɾiʒmu/","syllables":"com-pa-nhei-ris-mo"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"\"Companheirismo\" é um substantivo que descreve a relação de amizade, apoio mútuo e colaboração entre pessoas que compartilham interesses, objetivos ou experiências. É frequentemente usado para descrever a relação entre colegas de trabalho, amigos, membros de uma equipe ou grupo, e até mesmo entre soldados. Implica um senso de lealdade, confiança e respeito mútuo.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"*O companheirismo foi muito alto na empresa.*","correct":"O nível de companheirismo era muito alto na empresa.","note":"\"Companheirismo\" é um substantivo abstrato, então é mais apropriado usar frases como \"o nível de companheirismo\" ou \"o espírito de companheirismo\"."},{"incorrect":"*Ela sentiu muito companheirismo para ele.*","correct":"Ela sentiu muito companheirismo por ele.","note":"A preposição correta a ser usada é \"por\"."}],"priority":"★★☆"},"related_words":{"derivatives":["companheiro (companion)","companheira (female companion)"],"phrases":["em espírito de companheirismo (in a spirit of camaraderie)","demonstrar companheirismo (to demonstrate fellowship)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Moderately frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Companheirismo\" é uma palavra que descreve a boa relação entre pessoas que trabalham ou convivem juntas. Significa que elas se ajudam, são amigas e se apoiam. É como ter um bom amigo no trabalho ou na escola. A palavra vem de \"companheiro\", que é alguém que está junto com você. É importante ter companheirismo para que o ambiente seja mais agradável e as pessoas se sintam bem."},"example_sentences":[{"sentence":"O companheirismo entre os jogadores foi fundamental para a vitória do time.","translation":"The camaraderie among the players was fundamental to the team's victory.","type":"general","meaning_category":"friendship/camaraderie"},{"sentence":"Eles mostraram companheirismo ao dividir seus recursos com os necessitados.","translation":"They showed solidarity by sharing their resources with those in need.","type":"general","meaning_category":"solidarity/cooperation"},{"sentence":"O companheirismo no escritório melhorou a produtividade da equipe.","translation":"Fellowship in the office improved the team's productivity.","type":"workplace","meaning_category":"workplace fellowship"},{"sentence":"O espírito de companheirismo era evidente durante a viagem.","translation":"The spirit of camaraderie was evident during the trip.","type":"travel","meaning_category":"general"},{"sentence":"O companheirismo entre os vizinhos tornou a comunidade mais forte.","translation":"The fellowship among the neighbors made the community stronger.","type":"community","meaning_category":"community fellowship"}]}