{"word":"Iodosobenzene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヨードソベンゼン","english_definition":"A chemical compound with the formula C6H5IO, consisting of a benzene ring with an iodine atom and an oxygen atom attached to the same carbon atom. It is an organoiodine compound and a member of the class of iodosylarenes.","examples":[{"sentence":"Iodosobenzene is used as an oxidizing agent in organic synthesis.","translation":"ヨードソベンゼンは有機合成において酸化剤として使用される。"}],"collocations":["synthesis of iodosobenzene","reaction with iodosobenzene","use of iodosobenzene"],"synonyms":["phenyliodine oxide","iodosylbenzene"],"antonyms":[]}],"etymology":{"value":"The name is derived from 'iodo-' indicating the presence of iodine, 'so-' indicating a single oxygen atom bonded to the iodine, and 'benzene' indicating the presence of a benzene ring.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌaɪodoʊˈbɛnziːn/","syllables":"I-o-do-ben-zene"},"inflection":{"notes":"This is a noun, so it primarily exists in singular form. Plural forms are rarely used."},"usage_notes":{"explanation":"Iodosobenzene is primarily encountered in the context of organic chemistry, specifically in discussions of oxidation reactions and organoiodine compounds. Its use is largely confined to research and specialized chemical applications.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Iodosobenzene is a type of alcohol.","correct":"✓ Iodosobenzene is an organoiodine compound.","note":"Iodosobenzene is not an alcohol; it's an organoiodine compound containing iodine and oxygen bonded to a benzene ring."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Iodosylbenzene diacetate","phenyliodine(III) diacetate"],"related_compounds":["benzene","iodine","organoiodine compound"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - encountered mainly in specialized chemistry literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Iodosobenzene' is a highly specialized term used within organic chemistry. Understanding it requires familiarity with chemical nomenclature and the structure of organic compounds, particularly benzene derivatives and organoiodine compounds. It is unlikely to be encountered outside of advanced chemistry contexts."},"example_sentences":[{"sentence":"The reaction of iodosobenzene with alkenes leads to epoxidation.","translation":"ヨードソベンゼンとアルケンの反応はエポキシ化につながる。","type":"scientific","meaning_category":"chemical reaction"},{"sentence":"Iodosobenzene is synthesized from iodobenzene through oxidation.","translation":"ヨードソベンゼンは、ヨードベンゼンを酸化することによって合成される。","type":"scientific","meaning_category":"chemical synthesis"}]}