{"word":"Archiblast","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(発生学) 卵割によって生じた細胞のうち、栄養分が少なく、将来個体となる部分。","english_definition":"(embryology) The part of the egg that contains little or no yolk and undergoes cleavage to form the embryo.","examples":[{"sentence":"The archiblast is responsible for the development of the main body structures.","translation":"アーキブラストは、主要な身体構造の発達を担っています。"}],"collocations":["archiblast development","archiblast formation"],"synonyms":["germinal disc","blastodisc"],"antonyms":["deutoplasm","megalecithal"]}],"etymology":{"value":"From Ancient Greek ἀρχή (arkhḗ, \"beginning\") + βλαστός (blastós, \"sprout, bud\").","priority":"★★★"},"pronunciation":{"ipa":"/ˈɑːrkɪˌblæst/","syllables":"Ar-chi-blast"},"inflection":{"noun_plural":"archiblasts"},"usage_notes":{"explanation":"The term 'archiblast' is primarily used in the context of embryology, specifically when discussing the development of eggs with a small amount of yolk (meroblastic cleavage). It refers to the active part of the egg that forms the embryo, as opposed to the yolk-rich part.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The archiblast is the yolk of the egg.","correct":"✓ The archiblast is the part of the egg that develops into the embryo, not the yolk.","note":"The archiblast is the part of the egg that forms the embryo, while the yolk (deutoplasm) is the nutrient reserve."}],"priority":"★★☆"},"related_words":{"derivatives":["archiblastic"],"related_terms":["meroblastic cleavage","holoblastic cleavage","blastomere","blastula"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term used in embryology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archiblast' is a technical term used in embryology to describe the part of an egg with little or no yolk that develops into the embryo. It is relevant in the context of meroblastic cleavage, where only a portion of the egg divides. Understanding this term requires a background in developmental biology."},"example_sentences":[{"sentence":"During meroblastic cleavage, the archiblast undergoes cell division to form the embryo.","translation":"部分割の間、アーキブラストは細胞分裂を起こして胚を形成します。","type":"scientific","meaning_category":"embryology"}]}