{"word":"umbelwort","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"セリ科の植物","english_definition":"A plant of the family Apiaceae (formerly Umbelliferae), characterized by flowers arranged in umbels.","examples":[{"sentence":"Carrots, parsley, and dill are all umbelworts.","translation":"ニンジン、パセリ、ディルはすべてセリ科の植物です。"}],"collocations":["wild umbelwort","flowering umbelwort"],"synonyms":["apiaceous plant"],"antonyms":[]}],"etymology":{"value":"From 'umbel' (referring to the umbrella-like arrangement of flowers) + 'wort' (Old English for plant).","priority":"★★☆"},"pronunciation":{"ipa":"ˈʌmbəlˌwɜːrt","syllables":"um-bel-wort"},"inflection":{"noun_plural":"umbelworts"},"usage_notes":{"explanation":"'Umbelwort' is a botanical term referring to plants in the Apiaceae family, known for their distinctive umbel-shaped flower clusters. The term is not commonly used in everyday language but is more frequent in botany and horticulture contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful umbelwort in my garden, it was a rose.","correct":"✓ I saw a beautiful plant in my garden, it was a rose.","note":"Roses are not umbelworts. Umbelworts are in the Apiaceae family, like carrots and parsley."}],"priority":"★☆☆"},"related_words":{"derivatives":["umbel","Apiaceae","Umbelliferae (obsolete)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Umbelwort' is a technical term used in botany to describe plants in the Apiaceae family. These plants are characterized by their umbel-shaped flower clusters, where multiple flower stalks radiate from a central point, resembling an umbrella. This term is not commonly used outside of scientific or horticultural contexts. Examples of umbelworts include carrots, parsley, and dill."},"example_sentences":[{"sentence":"The meadow was filled with various umbelworts, attracting many pollinators.","translation":"その草原は様々なセリ科の植物で満たされており、多くの送粉者を魅了していた。","type":"noun","meaning_category":"セリ科の植物"},{"sentence":"Botanists identified several species of umbelwort along the riverbank.","translation":"植物学者は川岸に沿っていくつかのセリ科植物の種を特定した。","type":"noun","meaning_category":"セリ科の植物"}]}