{"word":"strabotomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"斜視手術、斜視筋切離術","english_definition":"A surgical procedure to correct strabismus (crossed eyes) by detaching and reattaching an eye muscle to weaken it.","examples":[{"sentence":"The child underwent a strabotomy to correct their crossed eyes.","translation":"その子供は斜視を矯正するために斜視筋切離術を受けた。"},{"sentence":"Strabotomy is a common surgical treatment for certain types of strabismus.","translation":"斜視筋切離術は、特定の種類の斜視に対する一般的な外科的治療法である。"}],"collocations":["perform a strabotomy","undergo strabotomy","correct strabismus with strabotomy"],"synonyms":["eye muscle surgery","strabismus surgery"],"antonyms":[]}],"etymology":{"value":"From 'strabismus' (斜視) + '-otomy' (切開術).","priority":"★★☆"},"pronunciation":{"ipa":"/strəˈbɒtəmi/","syllables":"stra-bot-o-my"},"inflection":{"noun_plural":"strabotomies"},"usage_notes":{"explanation":"'Strabotomy' refers specifically to the surgical procedure involving the cutting of an eye muscle to correct eye misalignment. It is a more precise term than general 'eye surgery' when referring to strabismus correction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a strabismus on the patient.","correct":"✓ The doctor performed a strabotomy on the patient.","note":"'Strabismus' is the condition, while 'strabotomy' is the surgical procedure to correct it."}],"priority":"★★☆"},"related_words":{"derivatives":["strabismic (adjective: relating to or having strabismus)","strabism (noun: 斜視)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Strabotomy' is a specialized medical term used in ophthalmology. Understanding requires knowledge of medical terminology and surgical procedures related to eye muscle correction. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The ophthalmologist recommended a strabotomy to improve the child's binocular vision.","translation":"眼科医は、子供の両眼視を改善するために斜視筋切離術を推奨した。","type":"general","meaning_category":"斜視手術"},{"sentence":"Post-operative care after strabotomy includes eye drops and monitoring for any complications.","translation":"斜視筋切離術後のケアには、点眼薬と合併症のモニタリングが含まれる。","type":"medical","meaning_category":"斜視手術"}]}