{"word":"sensist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学で)感覚主義者、感覚論者","english_definition":"A proponent of sensism, the philosophical doctrine that all knowledge originates from sensory experience.","examples":[{"sentence":"The sensist argued that abstract concepts are ultimately derived from concrete sensations.","translation":"その感覚主義者は、抽象的な概念は最終的には具体的な感覚から派生すると主張した。"}],"collocations":["sensist philosophy","sensist theory"],"synonyms":["empiricist","sensationalist"],"antonyms":["rationalist","idealist"]}],"etymology":{"value":"Formed from 'sense' + '-ist'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛnsɪst/","syllables":"sen-sist"},"inflection":{"noun_plural":"sensists"},"usage_notes":{"explanation":"The term 'sensist' is primarily used in philosophical contexts to describe someone who adheres to sensism. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very sensist person.","correct":"✓ He is a very sensitive person.","note":"'Sensist' (a believer in sensism) is often confused with 'sensitive' (easily affected by feelings or emotions)."},{"incorrect":"✗ The sensist said that numbers exist independently of our minds.","correct":"✓ The sensist said that numbers are derived from our sensory experiences.","note":"This is because sensists believe all knowledge comes from sensory experience, not from innate ideas or abstract reasoning."}],"priority":"★★☆"},"related_words":{"derivatives":["sensism (noun: 感覚主義)","sensation (noun: 感覚)","sensory (adjective: 感覚の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sensist' is a specialized term used primarily in philosophy. It refers to someone who believes that all knowledge comes from sensory experience. Because of its specific and technical usage, it is not commonly encountered outside of philosophical discussions. Understanding this term requires familiarity with philosophical concepts and terminology."},"example_sentences":[{"sentence":"As a committed sensist, Locke believed that the mind was a blank slate at birth.","translation":"熱心な感覚主義者として、ロックは人の心は生まれたときは白紙であると信じていた。","type":"noun","meaning_category":"哲学"},{"sentence":"The sensist approach to epistemology emphasizes the role of observation and experimentation.","translation":"認識論への感覚主義的アプローチは、観察と実験の役割を強調する。","type":"adjective (sensist approach)","meaning_category":"哲学"}]}