{"word":"Templet","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)型板、ひな形、鋳型；(機械)テンプレート、定規","english_definition":"A pattern or gauge used as a guide in shaping materials; a template. Specifically in architecture, a horizontal timber or stone set in a wall to receive and distribute the pressure of a girder or beam.","examples":[{"sentence":"The carpenter used a templet to ensure consistent shapes in the woodwork.","translation":"その大工は、木工細工で一貫した形状を確保するために型板を使用した。"},{"sentence":"The templet helped the mason cut the stones accurately.","translation":"その型板は、石工が石を正確に切るのに役立った。"},{"sentence":"A steel templet is used to check the thread form of the bolts.","translation":"鋼鉄製のテンプレートは、ボルトのねじ山形状をチェックするために使用されます。"}],"collocations":["use a templet","steel templet","wooden templet"],"synonyms":["template","pattern","gauge","mold","form"],"antonyms":[]}],"etymology":{"value":"Derived from the Middle English 'templet', which comes from the Old French 'templet' or 'temple', meaning a small piece of timber. The architectural sense refers to a horizontal piece of timber or stone used to distribute weight, while the more general sense refers to a pattern or guide.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛmplɪt/","syllables":"Tem-plit"},"inflection":{"noun_plural":"Templets"},"usage_notes":{"explanation":"'Templet' is often used interchangeably with 'template', but 'templet' can sometimes refer more specifically to physical patterns or gauges used in construction or manufacturing. 'Template' is more commonly used in digital contexts or for more abstract patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a templet for my website design.","correct":"✓ I need a template for my website design.","note":"In the context of website design, 'template' is the more appropriate term. 'Templet' is less commonly used in digital contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["template"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Templet' is a somewhat specialized term, often used in construction, manufacturing, or engineering contexts to refer to a physical pattern or guide. While it is similar to 'template', 'templet' often implies a more tangible, physical object used for shaping or guiding the creation of other objects. It is less common in general usage compared to 'template'."},"example_sentences":[{"sentence":"The machinist created a precise templet to ensure all parts were identical.","translation":"その機械工は、すべての部品が同一であることを保証するために、精密な型板を作成した。","type":"noun","meaning_category":"型板"},{"sentence":"The stonemason used a templet to carve the intricate designs into the facade.","translation":"その石工は、複雑なデザインをファサードに彫るために型板を使用した。","type":"noun","meaning_category":"型板"},{"sentence":"The engineer specified a steel templet for the bridge construction.","translation":"そのエンジニアは、橋の建設に鋼鉄製の型板を指定した。","type":"noun","meaning_category":"型板"}]}