{"word":"RNOC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(諜報活動における) 連絡要員 (Resident NOC)","english_definition":"(Intelligence) Resident Non-Official Cover; an intelligence officer operating in a foreign country without any official ties to their government.","examples":[{"sentence":"The RNOC was tasked with gathering information on the target organization.","translation":"その連絡要員は、標的組織に関する情報を収集する任務を負っていた。"},{"sentence":"Maintaining a low profile is crucial for an RNOC's success.","translation":"目立たないようにすることは、連絡要員の成功にとって非常に重要である。"}],"collocations":["establish an RNOC (連絡要員を配置する)","deploy an RNOC (連絡要員を派遣する)","manage an RNOC (連絡要員を管理する)","activate an RNOC (連絡要員を作動させる)","deactivate an RNOC (連絡要員を停止させる)"],"synonyms":["sleeper agent","deep cover agent","unofficial cover operative"],"antonyms":["official cover operative"]}],"etymology":{"value":"Acronym for Resident Non-Official Cover.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrˌɛnˌoʊˈsiː/","syllables":"R-N-O-C"},"inflection":{"notes":"It's an acronym, so it doesn't inflect."},"usage_notes":{"explanation":"RNOC stands for Resident Non-Official Cover. It refers to an intelligence operative who lives in a foreign country and operates without any official ties to their government. This means they don't have diplomatic immunity or any other form of official protection, making their work extremely risky. They often assume a false identity and blend into the local population to gather intelligence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The RNOC was wearing a uniform.","correct":"✓ The RNOC was trying to blend in with the crowd.","note":"RNOCs operate under non-official cover, so they would avoid anything that draws attention to them or identifies them as government personnel."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["NOC (Non-Official Cover)","Intelligence Officer","Agent","Covert Operation","Espionage","Counterintelligence"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency. This is a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"RNOC is a highly specialized term used within the intelligence community. It refers to an intelligence officer who lives in a foreign country and operates without any official ties to their government. Understanding this term requires familiarity with espionage and covert operations. It's not commonly used in general conversation."},"example_sentences":[{"sentence":"The agency decided to deploy an RNOC to monitor the suspect's activities.","translation":"その機関は、容疑者の活動を監視するために連絡要員を派遣することを決定した。","type":"noun","meaning_category":"諜報活動"},{"sentence":"The RNOC had successfully infiltrated the organization and was providing valuable intelligence.","translation":"その連絡要員は組織への潜入に成功し、貴重な情報を提供していた。","type":"noun","meaning_category":"諜報活動"}]}