{"word":"fakers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偽物を作る人、詐欺師、ごまかしをする人","english_definition":"plural of faker: someone who pretends to be someone they are not, or to have qualities they do not have; someone who creates or sells fake items.","examples":[{"sentence":"Those street vendors are fakers selling counterfeit goods.","translation":"あの露店の商人は偽物を売る詐欺師だ。"},{"sentence":"He accused the politician of being a faker, promising things he couldn't deliver.","translation":"彼はその政治家を実現できないことを約束する詐欺師だと非難した。"},{"sentence":"She saw through his facade; she knew he was a faker.","translation":"彼女は彼の上辺を見抜いた。彼がごまかしをする人だとわかっていた。"}],"collocations":["a bunch of fakers","phony fakers","out the fakers"],"synonyms":["imposters","frauds","charlatans","deceivers","pretenders"],"antonyms":["genuine people","authentic individuals"]}],"etymology":{"value":"'Faker' is derived from the verb 'fake,' which originated in the 18th century. The origin of 'fake' itself is uncertain, but it's possibly related to the Dutch word 'facken,' meaning 'to strike, beat, or cheat.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfeɪkərz/","syllables":"fay-kers"},"inflection":{"noun_plural":"fakers"},"usage_notes":{"explanation":"'Fakers' is the plural form of 'faker,' referring to multiple individuals who are not genuine or authentic. They might be selling counterfeit products, pretending to be someone they are not, or generally deceiving others. The word carries a negative connotation, implying dishonesty and a lack of integrity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the fakers in the company.","correct":"✓ He is one of the fakers in the company. / ✓ He is a faker in the company.","note":"The first sentence is grammatically correct. The second is also correct and more common. If you mean one specific faker, use 'a faker'. If you mean he is among a group of fakers, 'one of the fakers' is appropriate."},{"incorrect":"✗ The fakers are very expensives.","correct":"✓ The fakers are very expensive.","note":"'Expensive' is an adjective, so it should be used to describe the fakers. 'Expensives' is not a standard word."}],"priority":"★★☆"},"related_words":{"derivatives":["fake (verb, adjective, noun)","faking (verb - present participle)","faked (verb - past tense, past participle)","fakery (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'fakers' refers to people who are not genuine or honest. It implies that they are pretending to be something they are not, often to deceive others for personal gain. This word is more commonly used in informal settings or when expressing strong disapproval of someone's behavior. It's important to understand the context in which 'fakers' is used to fully grasp the speaker's or writer's intent.","priority":"★★☆"},"example_sentences":[{"sentence":"The internet is full of fakers trying to scam people out of their money.","translation":"インターネットは人々からお金を騙し取ろうとする詐欺師で溢れている。","type":"noun","meaning_category":"詐欺師"},{"sentence":"She quickly realized that the self-proclaimed guru was just one of many fakers.","translation":"彼女はすぐに、自称グルが多くの詐欺師の一人に過ぎないことに気づいた。","type":"noun","meaning_category":"偽物を作る人"},{"sentence":"The art market is plagued by fakers who create and sell counterfeit paintings.","translation":"美術市場は偽の絵画を制作・販売する偽物を作る人に悩まされている。","type":"noun","meaning_category":"偽物を作る人"},{"sentence":"Don't trust everything you see online; there are a lot of fakers out there.","translation":"オンラインで見るものすべてを信用しないでください。そこには多くの詐欺師がいる。","type":"noun","meaning_category":"詐欺師"}]}