{"word":"Assayers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 試金者、分析者、評価者","english_definition":"Plural form of assayer: people who analyze substances to determine their composition or quality.","examples":[{"sentence":"The assayers carefully examined the ore samples for their gold content.","translation":"試金者たちは鉱石サンプル中の金の含有量を注意深く調べた。"},{"sentence":"Assayers play a crucial role in the mining industry.","translation":"試金者は鉱業において重要な役割を果たす。"}],"collocations":["gold assayers","independent assayers","certified assayers"],"synonyms":["analysts","evaluators","testers","examiners"],"antonyms":[]}],"etymology":{"value":"The word \"assayer\" comes from the verb \"assay,\" which originates from the Old French word \"assai\" meaning \"trial, test.\" This, in turn, comes from the Latin word \"exagium,\" meaning \"a weighing.\"","priority":"★★★"},"pronunciation":{"ipa":"/æˈseɪərz/","syllables":"As-say-ers"},"inflection":{"noun_plural":"Assayers"},"usage_notes":{"explanation":"\"Assayers\" refers to multiple individuals who perform assays. An assay is an analytical technique used to determine the quantity of a particular substance in a sample. Assayers are commonly employed in mining, metallurgy, and chemistry to determine the purity or composition of materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The assayer is working. There are many assayers in the lab.","correct":"✓ The assayer is working. There are many assayers in the lab.","note":"The plural form \"assayers\" is used when referring to multiple assayers."}],"priority":"★★☆"},"related_words":{"derivatives":["assay (noun, verb)","assaying (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Assayers\" is a plural noun referring to individuals who conduct assays, which are analytical tests to determine the composition or purity of a substance. This term is typically used in technical or industrial contexts, such as mining or metallurgy. Understanding the role of assayers requires familiarity with analytical chemistry and quality control processes."},"example_sentences":[{"sentence":"The team of **assayers** worked diligently to analyze the samples.","translation":"試金者チームはサンプルを分析するために熱心に働いた。","type":"noun","meaning_category":"試金者"},{"sentence":"Experienced **assayers** are essential for ensuring the accuracy of the results.","translation":"経験豊富な試金者は、結果の精度を確保するために不可欠である。","type":"noun","meaning_category":"試金者"}]}