{"word":"supereligibly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非常に適格に、極めて適格な方法で","english_definition":"In a manner that demonstrates a very high degree of eligibility or qualification.","examples":[{"sentence":"The candidate presented themselves supereligibly during the interview, highlighting every relevant skill and experience.","translation":"候補者は面接中に、関連するすべてのスキルと経験を強調し、非常に適格な自己紹介を行った。"},{"sentence":"The project was supereligibly designed to meet all the grant requirements.","translation":"プロジェクトは、すべての助成金要件を満たすように非常に適格に設計された。"}],"collocations":["demonstrate supereligibly","design supereligibly","qualify supereligibly"],"synonyms":["highly eligibly","extremely qualifiedly","very suitably"],"antonyms":["ineligibly","unqualifiedly"]}],"etymology":{"value":"Formed by combining 'super-' (meaning 'above' or 'beyond') with 'eligibly' (meaning 'in an eligible manner').","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈɛlɪdʒɪbli/","syllables":"su-per-el-i-gi-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Supereligibly' is a relatively rare adverb used to emphasize the high degree to which someone or something meets the criteria for eligibility. It suggests not just meeting the requirements, but exceeding them significantly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The form was filled supereligibly.","correct":"✓ The form was filled out supereligibly.","note":"When referring to filling out a form, it's better to use the phrasal verb 'fill out' instead of just 'fill'."},{"incorrect":"✗ He is supereligibly for the position.","correct":"✓ He is super eligible for the position.","note":"'Supereligibly' is an adverb, so it should modify a verb. To describe someone's state of eligibility, use the adjective 'super eligible'."}],"priority":"★★☆"},"related_words":{"derivatives":["supereligible (adjective)","eligibly (adverb)","eligibility (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language curricula)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Supereligibly' is a sophisticated adverb that is rarely used in everyday language. It is best suited for formal contexts where a high degree of precision and emphasis is required to convey the extent of someone or something's eligibility. Understanding the prefix 'super-' and the root word 'eligibly' is key to interpreting its meaning. This word is more likely to be encountered in specialized or technical documentation rather than general conversation."},"example_sentences":[{"sentence":"The proposal was presented supereligibly, leaving no doubt about its compliance with the regulations.","translation":"提案は非常に適格に提示され、規制への準拠に疑問の余地を残さなかった。","type":"adverb","meaning_category":"highly qualifiedly"},{"sentence":"She answered the questions supereligibly, demonstrating her deep understanding of the subject matter.","translation":"彼女は質問に非常に適格に答え、主題に対する深い理解を示した。","type":"adverb","meaning_category":"extremely suitably"}]}