{"word":"carats","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カラット (宝石の質量の単位; 純度の単位)","english_definition":"A unit of weight for precious stones, especially diamonds, equal to 200 milligrams. Also, a unit of purity for gold alloys, with 24 carats being pure gold.","examples":[{"sentence":"The diamond is three carats.","translation":"そのダイヤモンドは3カラットです。"},{"sentence":"This ring is 18 carats gold.","translation":"この指輪は18金の金です。"}],"collocations":["three carats","18 carats gold","carat weight","total carats"],"synonyms":["weight","purity","fineness"],"antonyms":[]}],"etymology":{"value":"Derived from the French 'carat', which in turn comes from the Italian 'carato', and ultimately from the Greek 'keration' (κεράτιον) meaning 'carob seed'. Carob seeds were historically used to weigh small quantities of gold and gemstones.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkærəts/","syllables":"car-ats"},"inflection":{"noun_plural":"carats"},"usage_notes":{"explanation":"'Carats' is the plural form of 'carat'. It refers to the weight of gemstones, particularly diamonds, and the purity of gold. When referring to the weight of a gemstone, 'carat' is a unit of mass. When referring to gold, 'carat' indicates the proportion of pure gold to other metals in the alloy. For example, 24-carat gold is pure gold, while 12-carat gold is 50% gold.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The diamond was 24 carats.","correct":"✓ The diamond was 24 carats, but that's impossible because diamonds are measured by weight, not purity.","note":"Diamonds are measured in terms of weight (mass), not purity. Gold is measured by purity. A very large diamond could be 24 carats in weight. "},{"incorrect":"✗ The gold ring is 100% pure, so it is 24 carat.","correct":"✓ The gold ring is 100% pure, so it is 24 carats.","note":"When indicating the purity of gold, use 'carats' (plural)."},{"incorrect":"✗ The diamond has a carat weight of 1.5.","correct":"✓ The diamond has a carat weight of 1.5 carats.","note":"Always include the plural 'carats' when stating the weight of a gemstone."}],"priority":"★★☆"},"related_words":{"derivatives":["carat","karat (alternate spelling, often used for gold purity)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Carats' is a specialized term primarily used in the context of jewelry and precious stones. It refers to the unit of weight for gemstones, especially diamonds, and the purity of gold. Understanding this term is important when discussing or evaluating jewelry, but it is not a common word in everyday conversation. It's important to distinguish between 'carat' (weight of gemstones) and 'karat' (purity of gold), although 'carat' is sometimes used for both.","priority":"★★☆"},"example_sentences":[{"sentence":"The jeweler showed us a selection of diamonds ranging from one to five carats.","translation":"宝石商は私たちに1カラットから5カラットまでのダイヤモンドのセレクションを見せてくれた。","type":"noun","meaning_category":"weight of gemstones"},{"sentence":"Most engagement rings feature a diamond of at least one carat.","translation":"ほとんどの婚約指輪には少なくとも1カラットのダイヤモンドがあしらわれている。","type":"noun","meaning_category":"weight of gemstones"},{"sentence":"The antique necklace was made of 22 carats gold.","translation":"そのアンティークのネックレスは22金の金で作られていた。","type":"noun","meaning_category":"purity of gold"},{"sentence":"The value of the diamond increases exponentially with its carats weight.","translation":"ダイヤモンドの価値はカラット重量とともに指数関数的に増加する。","type":"noun","meaning_category":"weight of gemstones"},{"sentence":"She received a beautiful pair of earrings, each featuring a two carats diamond.","translation":"彼女は美しいイヤリングのペアを受け取った。それぞれに2カラットのダイヤモンドがあしらわれていた。","type":"noun","meaning_category":"weight of gemstones"}]}