{"word":"woman-hating","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"女性嫌悪の、女性を憎む","english_definition":"having or showing a dislike of, contempt for, or ingrained prejudice against women.","examples":[{"sentence":"His comments were interpreted as woman-hating.","translation":"彼のコメントは女性嫌悪的だと解釈された。"},{"sentence":"The article criticized the movie for its woman-hating themes.","translation":"その記事は、映画の女性嫌悪的なテーマを批判した。"}],"collocations":["woman-hating remarks","woman-hating attitudes","woman-hating ideology"],"synonyms":["misogynistic","sexist","chauvinistic"],"antonyms":["feminist","pro-woman","egalitarian"]}],"etymology":{"value":"'Woman' + 'hating'. Combination of the noun 'woman' and the present participle of the verb 'hate'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈwʊmənˌheɪtɪŋ/","syllables":"wom-an-hat-ing"},"inflection":{"notes":"This is an adjective and does not inflect like a verb."},"usage_notes":{"explanation":"'Woman-hating' is a descriptive term that characterizes attitudes, behaviors, or ideologies expressing dislike, contempt, or prejudice against women. It is often used to describe actions or statements that demean, objectify, or discriminate against women. The term is frequently used in discussions about sexism and gender inequality.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He is a woman-hating.","correct":"He is a woman-hater. / His views are woman-hating.","note":"'Woman-hating' is an adjective. To describe a person, use 'woman-hater' (noun)."},{"incorrect":"The woman-hating is wrong.","correct":"Woman-hating is wrong.","note":"'Woman-hating' can be used as a noun in a general sense to refer to the concept itself."}],"priority":"N/A"},"related_words":{"derivatives":["woman-hater (noun)","misogyny (noun)","misogynist (noun)"],"phrases":["internalized misogyny"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Woman-hating' describes a strong dislike or hatred of women. It's a term used to identify attitudes, behaviors, or beliefs that are prejudiced against women. It's often used in discussions about sexism and gender equality to describe actions or statements that demean or discriminate against women. Understanding this term is important for analyzing and discussing issues related to gender bias and discrimination."},"example_sentences":[{"sentence":"The film was criticized for its portrayal of women as weak and helpless, which some viewers saw as woman-hating.","translation":"その映画は、女性を弱くて無力な存在として描いている点が批判され、一部の視聴者はそれを女性嫌悪的だと捉えた。","type":"adjective","meaning_category":"女性嫌悪の"},{"sentence":"The politician's woman-hating remarks sparked outrage and protests.","translation":"その政治家の女性嫌悪的な発言は、怒りと抗議を引き起こした。","type":"adjective","meaning_category":"女性嫌悪の"},{"sentence":"It's important to challenge woman-hating attitudes and promote gender equality.","translation":"女性嫌悪的な態度に異議を唱え、男女平等を促進することが重要だ。","type":"adjective","meaning_category":"女性嫌悪の"}]}