{"word":"lampases","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A rich, figured silk fabric, often with gold or silver thread, used for clothing, upholstery, and wall hangings.","english_definition":"A luxurious silk fabric with intricate patterns, often incorporating gold or silver threads, traditionally used for garments, furniture coverings, and wall decorations.","examples":[{"sentence":"The queen's gown was made of the finest lampases.","translation":"女王のドレスは最高級のランパセスで作られていた。"},{"sentence":"The walls of the palace were hung with exquisite lampases tapestries.","translation":"宮殿の壁には、精巧なランパセスのタペストリーが掛けられていた。"}],"collocations":["silk lampases","gold lampases","figured lampases","antique lampases","lampases upholstery","lampases wall hangings"],"synonyms":["brocade","damask","tapestry","silk fabric","textile"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'lampas', which itself comes from the Spanish 'lámpara' (lamp). The connection is thought to be related to the shimmering quality of the fabric, reminiscent of light.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæmpəsɪz/","syllables":"lam-pa-ses"},"inflection":{"noun_plural":"lampases"},"usage_notes":{"explanation":"'Lampases' refers specifically to a type of patterned silk fabric, often luxurious and historically significant. It is not a common word in modern English, primarily encountered in historical or textile-related contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She bought a lampases for her bedroom.","correct":"✓ She bought lampases for her bedroom.","note":"'Lampases' is typically used as an uncountable noun when referring to the fabric in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["lampas (singular form)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lampases' is a specialized term referring to a specific type of luxury silk fabric with intricate patterns. Due to its historical context and limited modern usage, it is considered a high-level vocabulary word. Understanding its meaning requires familiarity with textile history and terminology."},"example_sentences":[{"sentence":"The museum displayed a collection of 18th-century lampases fragments.","translation":"博物館は18世紀のランパセスの断片のコレクションを展示した。","type":"noun","meaning_category":"historical fabric"},{"sentence":"The antique chair was reupholstered with a beautiful lampases.","translation":"そのアンティークの椅子は美しいランパセスで張り替えられた。","type":"noun","meaning_category":"historical fabric"}]}