{"word":"tapeworm","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サナダムシ","english_definition":"a parasitic flatworm that lives in the intestines of humans and other animals. It has a long, ribbon-like body and no digestive system of its own, absorbing nutrients directly from the host's gut.","examples":[{"sentence":"He was diagnosed with a tapeworm infection after experiencing abdominal pain and weight loss.","translation":"彼は腹痛と体重減少を経験した後、サナダムシ感染症と診断された。"},{"sentence":"Properly cooking meat can help prevent tapeworm infestations.","translation":"肉を適切に調理することで、サナダムシの寄生を防ぐことができる。"},{"sentence":"The vet prescribed medication to eliminate the tapeworm from the dog's system.","translation":"獣医は犬の体からサナダムシを駆除する薬を処方した。"}],"collocations":["tapeworm infection","tapeworm infestation","get a tapeworm","remove a tapeworm","treat a tapeworm","tapeworm eggs","tapeworm segments"],"synonyms":["cestode"],"antonyms":[],"related_terms":["parasite","flatworm","intestine","proglottid","scolex","cysticercosis"]}],"etymology":{"value":"The word \"tapeworm\" comes from the worm's tape-like appearance.","priority":"★★★"},"pronunciation":{"ipa":"/ˈteɪp.wɜːrm/","syllables":"tape-worm"},"inflection":{"noun_plural":"tapeworms"},"usage_notes":{"explanation":"Tapeworms are parasitic flatworms that can infect humans and animals. Infection typically occurs by ingesting food or water contaminated with tapeworm eggs or larvae. While some infections may be asymptomatic, others can cause abdominal pain, weight loss, and other complications. Proper hygiene and food handling practices are essential for preventing tapeworm infestations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a tapeworm in my stomach.","correct":"✓ I have a tapeworm in my intestines.","note":"Tapeworms live in the intestines, not the stomach."},{"incorrect":"✗ Tapeworms are insects.","correct":"✓ Tapeworms are worms.","note":"Tapeworms are a type of flatworm, not insects."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["cestode","parasite","flatworm","proglottid","scolex","cysticercosis"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"tapeworm\" refers to a specific type of parasitic flatworm that resides in the intestines of various animals, including humans. Understanding the term requires knowledge of basic biology, including concepts such as parasites, intestines, and infection. The word itself is not commonly used in everyday conversation, but it may appear in scientific or medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor suspected a tapeworm infection based on the patient's symptoms.","translation":"医師は患者の症状からサナダムシ感染を疑った。","type":"general","meaning_category":"medical"},{"sentence":"Tapeworm segments can sometimes be seen in the stool of infected individuals.","translation":"サナダムシの片節は、感染者の便に見られることがある。","type":"general","meaning_category":"biological"},{"sentence":"Some people mistakenly believe that tapeworms can be used for weight loss.","translation":"サナダムシが減量に使用できると誤って信じている人もいる。","type":"general","meaning_category":"misconception"}]}