{"word":"Venedy","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(古語、歴史)ヴェネディ人：古代ヨーロッパに居住していた民族。スラヴ民族の祖先と考えられている。","english_definition":"(historical) The Venedi: an ancient people inhabiting areas of Central and Eastern Europe, considered to be among the early ancestors of the Slavic peoples.","examples":[{"sentence":"Tacitus described the Venedi in his work Germania.","translation":"タキトゥスは著書『ゲルマニア』の中でヴェネディ人について記述した。"},{"sentence":"The origin and ethnolinguistic affiliation of the Venedi are still debated among historians.","translation":"ヴェネディ人の起源と民族言語学的所属は、歴史家の間でいまだに議論されている。"}],"collocations":["Venedic language (ヴェネディ語 - 存在が仮定された古代言語)","Tacitus' Venedi (タキトゥスの記述によるヴェネディ人)"],"synonyms":["Slavs (スラヴ人 - 祖先と考えられている)","Venethi (ヴェネティ - 別の表記)"],"antonyms":[]}],"etymology":{"value":"語源は不明。ゲルマン語族の言語を通じてラテン語に入ったと考えられている。スラヴ語派の「*venedъ」という自己呼称に関連があるという説もある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɛnɪdi/","syllables":"Ve-ne-dy"},"inflection":{"notes":"複数形は Venedi (変化なし)。固有名詞のため、通常は単数形で使用。"},"usage_notes":{"explanation":"「**Venedi**」は、主に歴史的な文脈で使用される名称です。古代ローマの歴史家タキトゥスなどが記述した、中央・東ヨーロッパに居住していた民族を指します。彼らがスラヴ民族の祖先であるという説が有力ですが、その起源や民族構成については、まだ議論が続いています。現代の日常会話で使われることはほとんどありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Venedy are a modern Slavic nation.","correct":"✓ The Venedi were an ancient people, considered ancestors of the Slavic nations.","note":"ヴェネディ人は古代の民族であり、現代のスラヴ民族ではありません。"},{"incorrect":"✗ Venedy language is still spoken in Poland.","correct":"✓ There is no evidence that Venedic language is still spoken.","note":"ヴェネディ語は、その存在自体が仮説であり、現代の言語ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Venedic (形容詞: ヴェネディ人の、ヴェネディ語の)","Venethi (別の表記)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史用語のため)","frequency_google_ngram":"低頻度 (Low frequency) - 歴史研究や専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Venedi**」は、古代史を専門とする文献に登場する単語で、一般的には馴染みのない言葉です。古代ヨーロッパに居住していた民族の名前であり、スラヴ民族の祖先と考えられています。タキトゥスの『ゲルマニア』などの歴史的資料で言及されていますが、その起源や民族構成については、未だに議論が続いています。歴史学の研究や専門的な文脈以外では、ほとんど使われることはありません。"},"example_sentences":[{"sentence":"The Venedi were mentioned by Pliny the Elder as one of the peoples inhabiting the Baltic coast.","translation":"ヴェネディ人は、大プリニウスによってバルト海沿岸に居住する民族の一つとして言及された。","type":"noun","meaning_category":"古代民族"},{"sentence":"Archaeological findings provide some insights into the culture of the Venedi.","translation":"考古学的発見は、ヴェネディ人の文化に関するいくつかの手がかりを提供している。","type":"noun","meaning_category":"古代民族"},{"sentence":"The Venedic theory suggests a possible connection between the Venedi and the early Slavs.","translation":"ヴェネディック説は、ヴェネディ人と初期のスラヴ人との間にありうる関連性を示唆している。","type":"adjective (Venedic)","meaning_category":"ヴェネディ人の"}]}