{"word":"withier","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(植物などが)しなびた、しおれた、枯れた","english_definition":"(of plants) dry and decaying; withered.","examples":[{"sentence":"The withier leaves fell from the tree.","translation":"しおれた葉が木から落ちた。"},{"sentence":"The flowers looked withier than they had yesterday.","translation":"花は昨日よりも枯れているように見えた。"}],"collocations":["withier leaves","withier flowers","withier branches"],"synonyms":["withered","shriveled","dried up","faded","decayed"],"antonyms":["fresh","blooming","lush","vibrant"]},{"part_of_speech":"adjective","definition":"(人や身体の一部が)やつれた、しぼんだ、活気のない","english_definition":"(of a person or part of the body) lean and wrinkled with age; shrunken or shriveled.","examples":[{"sentence":"His face looked withier after his illness.","translation":"病気の後、彼の顔はやつれて見えた。"},{"sentence":"Her hands were withier than I remembered.","translation":"彼女の手は私が覚えていたよりもやつれていた。"}],"collocations":["withier face","withier hands","withier skin"],"synonyms":["shriveled","wrinkled","gaunt","haggard","drawn","wasted"],"antonyms":["plump","full","youthful","vigorous"]}],"etymology":{"value":"\"Withier\" is the comparative form of \"withered\". \"Wither\" comes from Middle English \"widderen,\" from Old English \"witherian,\" meaning \"to dry up, shrivel, decay.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪðiər/","syllables":"wi-thi-er"},"inflection":{"adjective_forms":{"comparative":"withier","superlative":"withiest"}},"usage_notes":{"explanation":"\"Withier\" is the comparative form of the adjective \"withered,\" indicating a greater degree of withering or shriveling. It is used to describe something that is more dried up, decayed, or shrunken compared to something else. It can apply to both plants and people, describing a loss of freshness, vitality, or plumpness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The withier weather made the plants die.","correct":"✓ The withering weather made the plants die.","note":"\"Withier\" is a comparative adjective, meaning 'more withered'. \"Withering\" is the present participle of the verb \"wither\" and can be used as an adjective to describe something that causes withering."},{"incorrect":"✗ She became withier after winning the lottery.","correct":"✓ She became wealthier after winning the lottery.","note":"\"Withier\" (more withered) and \"wealthier\" (more wealthy) are different words with different meanings. Pay attention to the context to use the correct word."}],"priority":"★★☆"},"related_words":{"derivatives":["wither (verb: しおれる、枯れる、やつれる)","withered (adjective: しおれた、枯れた、やつれた)","withering (adjective: 衰えさせる、しおれさせる、軽蔑的な)","withiest (adjective: 最も枯れた、最もやつれた)"],"idioms_phrases":["a withering look (軽蔑的な視線)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Withier\" is a comparative adjective that means 'more withered' or 'more shriveled'. It is used to compare two things, indicating that one is more dried up, decayed, or shrunken than the other. This word is less common than its base form, \"withered,\" and is typically found in descriptive writing. It is important to understand the base word \"wither\" to fully grasp the meaning of \"withier.\" It is used to describe plants, parts of the body, or even metaphorical concepts that are losing vitality or freshness."},"example_sentences":[{"sentence":"The withier of the two roses was discarded.","translation":"2つのバラのうち、よりしおれた方が捨てられた。","type":"adjective","meaning_category":"しおれた"},{"sentence":"His face seemed withier each time I saw him.","translation":"彼に会うたびに、彼の顔はやつれていくように見えた。","type":"adjective","meaning_category":"やつれた"},{"sentence":"The withier branches were pruned from the tree.","translation":"より枯れた枝は木から剪定された。","type":"adjective","meaning_category":"枯れた"}]}