{"word":"mayings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of gathering flowers or greenery in May; things gathered in May.","english_definition":"Activities associated with celebrating May Day, such as gathering flowers or greenery; things gathered during May Day celebrations.","examples":[{"sentence":"The children went out to collect mayings for the village festival.","translation":"子供たちは村の祭りのためにメイイングを集めに出かけた。"},{"sentence":"The mayings were used to decorate the maypole.","translation":"メイイングは、メイポールを飾るために使われた。"}],"collocations":["collect mayings","gather mayings","May Day mayings"],"synonyms":["May flowers","spring greenery","May Day decorations"],"antonyms":[]}],"etymology":{"value":"Derived from 'May,' referring to the month, with the addition of '-ing,' indicating an activity or things associated with that activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmeɪɪŋz/","syllables":"may-ings"},"inflection":{"noun_plural":"mayings"},"usage_notes":{"explanation":"'Mayings' refers to the activities and collected items associated with May Day celebrations, particularly the gathering of flowers and greenery. It is often used in a historical or cultural context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to maying.","correct":"✓ I am going to collect mayings.","note":"The word 'mayings' is typically used as a plural noun referring to the collected items, not as a gerund."}],"priority":"★☆☆"},"related_words":{"derivatives":["May Day","Maypole","May Queen"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mayings' is a relatively uncommon term referring to the flowers and greenery collected during May Day celebrations. It is often found in historical or cultural contexts describing traditional May Day activities."},"example_sentences":[{"sentence":"The villagers prepared for May Day by gathering colorful mayings from the fields and forests.","translation":"村人たちは野原や森から色とりどりのメイイングを集めて、メーデーの準備をした。","type":"noun","meaning_category":"Gathered items"},{"sentence":"The children proudly displayed their mayings, woven into garlands and bouquets.","translation":"子供たちは花輪や花束に織り込まれたメイイングを誇らしげに飾った。","type":"noun","meaning_category":"Gathered items"}]}