{"word":"Dictyophora","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キヌガサタケ属","english_definition":"A genus of fungi in the family Phallaceae, characterized by a net-like structure (indusium) hanging from the cap.","examples":[{"sentence":"The Dictyophora mushroom is known for its delicate, lacy skirt.","translation":"キヌガサタケ属のキノコは、繊細なレースのようなスカートで知られています。"}],"collocations":["Dictyophora indusiata (キヌガサタケ)","edible mushroom","fungal species"],"synonyms":["Phallus"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'dictyon' (net) and 'phoros' (bearing), referring to the net-like indusium.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪktiˈɒfərə/","syllables":"Dic-ty-o-pho-ra"},"inflection":{"noun_plural":"Dictyophoras"},"usage_notes":{"explanation":"'Dictyophora' refers to a specific genus of mushrooms, primarily known for the distinctive net-like structure called an indusium that hangs from the cap. These mushrooms are often found in tropical and subtropical regions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Dictyophora in the forest, it was a very quiet mushroom.","correct":"✓ I saw a Dictyophora in the forest, it had a very delicate, lacy skirt.","note":"'Quiet' is not a typical descriptor; focus on the visual characteristics of the mushroom."}],"priority":"★☆☆"},"related_words":{"derivatives":["Phallaceae (スッポンタケ科)","indusium (菌網)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dictyophora' is a scientific term referring to a specific genus of fungi. Understanding this term requires familiarity with botanical nomenclature and fungal biology. The key characteristic is the presence of an indusium, a net-like structure hanging from the cap. This term is primarily used in mycological or botanical contexts."},"example_sentences":[{"sentence":"The rare Dictyophora mushroom is prized in some Asian cuisines.","translation":"珍しいキヌガサタケ属のキノコは、アジア料理で珍重されています。","type":"noun","meaning_category":"キノコ属"},{"sentence":"The delicate indusium of the Dictyophora is easily damaged.","translation":"キヌガサタケ属の繊細な菌網は損傷しやすい。","type":"noun","meaning_category":"キノコ属"}]}