{"word":"Significator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(占星術) 特定の人物、場所、または事柄を表す惑星または星","english_definition":"(astrology) A planet or star that represents a particular person, place, or thing in a horoscope.","examples":[{"sentence":"In his natal chart, Jupiter is the significator of wealth and prosperity.","translation":"彼の出生図では、木星は富と繁栄の象徴星です。"},{"sentence":"The astrologer identified Mars as the significator of conflict in the relationship chart.","translation":"占星術師は、火星を関係図における争いの象徴星として特定しました。"}],"collocations":["planetary significator","chart significator","primary significator","secondary significator"],"synonyms":["indicator","marker","representative","symbol","designator"],"antonyms":[]}],"etymology":{"value":"Late Latin *significator*, from Latin *significare* (to signify).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪɡˈnɪfɪkeɪtər/","syllables":"sig-nif-i-ca-tor"},"inflection":{"noun_plural":"Significators"},"usage_notes":{"explanation":"In astrology, a significator is a planet or point in a chart that is particularly relevant to a specific question or area of life. The choice of significator depends on the type of chart being used (natal, horary, etc.) and the specific question being asked.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The significator of the house is its color.","correct":"✓ The significator of the house in the natal chart is often associated with the planet ruling the cusp of that house.","note":"Significators in astrology are celestial bodies, not physical attributes of a house."}],"priority":"★☆☆"},"related_words":{"derivatives":["signify","signification","significant"],"related_terms":["astrology","horoscope","planet","aspect","chart","cusp"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Significator' is a specialized term primarily used in astrology. It refers to a planet or celestial body that symbolizes or represents a specific person, object, or concept within a horoscope chart. Understanding this term requires familiarity with astrological concepts and terminology."},"example_sentences":[{"sentence":"The Moon is often the significator for the querent in horary astrology.","translation":"月はしばしば時事占星術で質問者の象徴星となります。","type":"noun","meaning_category":"Astrology"},{"sentence":"The condition of the significator can reveal important information about the outcome of the situation.","translation":"象徴星の状態は、状況の結果に関する重要な情報を明らかにすることができます。","type":"noun","meaning_category":"Astrology"}]}