{"word":"prerogativa","priority":"★★☆","meanings":[{"part_of_speech":"noun","gender":"feminine","definition":"特権、特典、恩恵","english_definition":"a special right or advantage that a particular person or group of people has.","examples":[{"sentence":"L'istruzione è una prerogativa di tutti i cittadini.","translation":"教育はすべての市民の特権である。"},{"sentence":"Il re esercitava le sue prerogative senza consultare il parlamento.","translation":"王は議会に諮らずに自身の特権を行使した。"},{"sentence":"Avere un posto auto riservato è una prerogativa dei dirigenti.","translation":"専用駐車場を持つことは幹部の特権である。"}],"collocations":["avere la prerogativa di (～の特権を持つ)","esercitare una prerogativa (特権を行使する)","prerogativa esclusiva (排他的特権)","prerogativa reale (王室特権)"],"synonyms":["privilegio","diritto","vantaggio","facoltà","immunità"],"antonyms":["obbligo","dovere","limitazione"]},{"part_of_speech":"noun","gender":"feminine","definition":"(特定の役職・地位などに伴う)権限、職権","english_definition":"a power or right that belongs to a particular office or position.","examples":[{"sentence":"È prerogativa del presidente nominare i ministri.","translation":"大臣を任命するのは大統領の権限である。"},{"sentence":"La decisione finale è prerogativa del consiglio di amministrazione.","translation":"最終決定は取締役会の権限である。"}],"collocations":["prerogativa del presidente (大統領の権限)","prerogativa del giudice (裁判官の権限)","prerogativa del parlamento (議会の権限)"],"synonyms":["competenza","attribuzione","potere","facoltà","autorità"],"antonyms":["incompetenza","incapacità"]}],"etymology":{"value":"Dal latino *praerogātīva*, derivato di *praerogāre* ('chiedere prima'), composto da *prae-* ('prima') e *rogāre* ('chiedere'). Originariamente si riferiva alla centuria che, nell'antica Roma, votava per prima nelle assemblee popolari, influenzando così il voto delle altre centurie.","priority":"★★☆"},"pronunciation":{"ipa":"/prereɡaˈtiːva/","syllables":"pre-ro-ga-ti-va"},"inflection":{"noun_plural":"prerogative"},"usage_notes":{"explanation":"La parola \"prerogativa\" indica un diritto o un vantaggio speciale, spesso esclusivo, che spetta a una persona, un gruppo o un'istituzione in virtù della sua posizione, del suo status o della legge. Può riferirsi a diritti legali, poteri decisionali o benefici particolari. Il termine implica una certa autorità o privilegio che non è disponibile a tutti.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ha usato la sua prerogativa per obbligare tutti a lavorare di più.","correct":"✓ Ha usato la sua autorità per obbligare tutti a lavorare di più.","note":"\"Prerogativa\" si riferisce a un diritto o un vantaggio, non all'atto di obbligare qualcuno. In questo caso, \"autorità\" è più appropriato."},{"incorrect":"✗ La prerogativa di essere felice.","correct":"✓ Il diritto di essere felice.","note":"La felicità è un diritto umano fondamentale, non una prerogativa speciale. \"Diritto\" è più appropriato in questo contesto."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_languages":{"english":"prerogative","french":"prérogative","spanish":"prerrogativa","german":"Prärogative"},"priority":"★★★"},"level_frequency":{"frequency_corpus":"Moderately frequent in formal contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"La parola \"prerogativa\" è un termine formale che indica un diritto o un vantaggio speciale che spetta a una persona o a un gruppo. È spesso usata in contesti legali, politici o istituzionali. La comprensione del termine richiede una buona conoscenza del lessico formale e della grammatica italiana.","priority":"★★☆"},"example_sentences":[{"sentence":"È sua prerogativa decidere come spendere i suoi soldi.","translation":"It is his prerogative to decide how to spend his money.","type":"general","meaning_category":"特権"},{"sentence":"La prerogativa del governo è quella di garantire la sicurezza dei cittadini.","translation":"The government's prerogative is to ensure the safety of citizens.","type":"political","meaning_category":"権限"},{"sentence":"L'azienda si riserva la prerogativa di modificare le condizioni contrattuali.","translation":"The company reserves the right to change the contractual conditions.","type":"legal","meaning_category":"権限"}]}