{"word":"ventriloquizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive/transitive","definition":"腹話術を行う、腹話術で話す","english_definition":"to perform ventriloquism; to speak using ventriloquism.","examples":[{"sentence":"He was ventriloquizing with a dummy on stage.","translation":"彼は舞台で人形を使って腹話術をしていた。"},{"sentence":"She practiced ventriloquizing in front of the mirror.","translation":"彼女は鏡の前で腹話術の練習をした。"},{"sentence":"The magician ventriloquized, making the audience laugh.","translation":"マジシャンは腹話術を行い、観客を笑わせた。"},{"sentence":"He ventriloquized a funny dialogue between the two puppets.","translation":"彼は2つの人形の間で面白い腹話術の対話を行った。"}],"collocations":["ventriloquize with a dummy","ventriloquize a dialogue","practice ventriloquizing"],"synonyms":["speak without moving lips","throw one's voice"],"antonyms":["speak normally","use one's own voice"]},{"part_of_speech":"verb","transitivity":"transitive","definition":"（自分の考えや感情を）人に代弁させる、人に吹き込ませる","english_definition":"to express (one's thoughts or feelings) through another person.","examples":[{"sentence":"He felt like the politician was ventriloquizing his own fears.","translation":"彼は政治家が自分の恐怖を代弁しているように感じた。"},{"sentence":"The author ventriloquized her beliefs through the main character.","translation":"作者は主人公を通して自分の信念を代弁させた。"},{"sentence":"Some critics accused the director of ventriloquizing his political views through the film.","translation":"一部の批評家は、監督が映画を通して政治的見解を吹き込ませていると非難した。"}],"collocations":["ventriloquize one's fears","ventriloquize one's beliefs","ventriloquize through a character"],"synonyms":["express through another","speak through","impute","ascribe"],"antonyms":["express directly","speak for oneself"]}],"etymology":{"value":"From 'ventriloquize', derived from 'ventriloquist' (one who performs ventriloquism), which comes from the Latin 'venter' (belly) and 'loqui' (to speak). The original (and incorrect) belief was that ventriloquists spoke from their stomachs.","priority":"★★☆"},"pronunciation":{"ipa":"/vɛnˈtrɪləˌkwaɪzɪŋ/","syllables":"ven-tril-o-quiz-ing"},"inflection":{"verb_forms":{"present_simple":["ventriloquize","ventriloquizes"],"past_simple":"ventriloquized","past_participle":"ventriloquized","present_participle":"ventriloquizing"}},"usage_notes":{"explanation":"'Ventriloquizing' is the present participle and gerund form of the verb 'ventriloquize'. It refers to the act of performing ventriloquism or, metaphorically, expressing one's thoughts through another person. The literal sense involves creating the illusion that one's voice is coming from another source, often a puppet. The figurative sense implies indirect expression or manipulation of speech.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was ventriloquizing his voice.","correct":"✓ He was ventriloquizing.","note":"'Ventriloquize' already implies using one's voice in a specific way, so specifying 'his voice' is redundant in the literal sense. If using figuratively, one might say, 'He was ventriloquizing his opinions through the character.'"},{"incorrect":"✗ She is ventriloquizing with the puppet since five years.","correct":"✓ She has been ventriloquizing with the puppet for five years.","note":"For an action that started in the past and continues to the present, use the present perfect continuous tense ('has/have been + -ing'). Also, use 'for' to indicate a duration of time."}],"priority":"★★☆"},"related_words":{"derivatives":["ventriloquize (verb)","ventriloquist (noun)","ventriloquism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ventriloquizing' is a relatively uncommon term, generally used in contexts related to performing arts or figurative speech. Understanding it requires familiarity with the concept of ventriloquism and the ability to recognize its metaphorical extension to indirect expression or manipulation of ideas. The word is more likely to appear in written texts about theatre, magic, or political commentary.","priority":"★★☆"},"example_sentences":[{"sentence":"The comedian was ventriloquizing to entertain the children.","translation":"コメディアンは子供たちを楽しませるために腹話術をしていた。","type":"verb","meaning_category":"Performing Arts"},{"sentence":"She was ventriloquizing with her puppet, making it seem alive.","translation":"彼女は人形を使って腹話術をし、まるで生きているように見せていた。","type":"verb","meaning_category":"Performing Arts"},{"sentence":"The author was accused of ventriloquizing his own opinions through the protagonist.","translation":"作者は主人公を通して自分の意見を代弁させていると非難された。","type":"verb","meaning_category":"Figurative Speech"},{"sentence":"He spent years ventriloquizing on stage, perfecting his act.","translation":"彼は何年も舞台で腹話術を行い、自分の芸を完成させた。","type":"verb","meaning_category":"Performing Arts"},{"sentence":"The politician seemed to be ventriloquizing the party's official line.","translation":"その政治家は党の公式見解を代弁しているように見えた。","type":"verb","meaning_category":"Figurative Speech"}]}