{"word":"expert-defined","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Defined or determined by an expert or experts; based on the knowledge and judgment of experts.","english_definition":"Defined or determined by an expert or experts; based on the knowledge and judgment of experts.","examples":[{"sentence":"The algorithm uses expert-defined rules to classify the data.","translation":"そのアルゴリズムは、専門家が定義したルールを使用してデータを分類します。"},{"sentence":"The treatment plan is based on expert-defined guidelines.","translation":"その治療計画は、専門家が定義したガイドラインに基づいています。"},{"sentence":"We need to ensure that the criteria are expert-defined and not arbitrary.","translation":"基準が専門家によって定義され、恣意的でないことを確認する必要があります。"}],"collocations":["expert-defined criteria","expert-defined rules","expert-defined guidelines","expert-defined standards","expert-defined parameters"],"synonyms":["expert-determined","expert-specified","expert-derived","expert-based"],"antonyms":["lay-defined","arbitrary","subjective","non-expert"]}],"etymology":{"value":"Compound word formed from 'expert' and 'defined'. Indicates that the definition or determination originates from the expertise of qualified individuals.","priority":"N/A"},"pronunciation":{"ipa":"/ˌekspɜːrt dɪˈfaɪnd/","syllables":"ex-pert-de-fined"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"The term 'expert-defined' is used to emphasize that a particular definition, rule, guideline, or standard is based on the knowledge, experience, and judgment of experts in a specific field. This implies a higher level of reliability and validity compared to definitions or criteria established by non-experts or through arbitrary means.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The expert defined the problem.","correct":"The expert-defined problem was complex.","note":"Using 'expert defined' (two separate words) changes the meaning. 'Expert-defined' as a single word acts as an adjective describing the problem."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["expert system","expert opinion","expert witness","knowledge-based"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical and academic contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'expert-defined' is typically used in academic, technical, or professional contexts. It implies that the definition or criteria being discussed are based on the knowledge and judgment of experts in the relevant field. Understanding this term requires familiarity with the concept of expertise and the importance of relying on expert knowledge in certain situations."},"example_sentences":[{"sentence":"The success of the project depended on adhering to the expert-defined specifications.","translation":"プロジェクトの成功は、専門家が定義した仕様を遵守することにかかっていました。","type":"adjective","meaning_category":"Based on expert knowledge"},{"sentence":"The expert-defined risk assessment identified several potential hazards.","translation":"専門家が定義したリスク評価により、いくつかの潜在的な危険性が特定されました。","type":"adjective","meaning_category":"Determined by experts"}]}