{"word":"tensor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(数学、物理学)テンソル：多次元配列として表現できる数学的対象。スカラー、ベクトル、行列を一般化したもの。","english_definition":"(mathematics, physics) A mathematical object that can be represented as a multidimensional array. Tensors generalize scalars, vectors, and matrices.","examples":[{"sentence":"A scalar is a zero-dimensional tensor.","translation":"スカラーはゼロ次元のテンソルです。"},{"sentence":"A vector is a one-dimensional tensor.","translation":"ベクトルは一次元のテンソルです。"},{"sentence":"A matrix is a two-dimensional tensor.","translation":"行列は二次元のテンソルです。"},{"sentence":"Tensors are used extensively in physics to describe physical quantities.","translation":"テンソルは物理学において物理量を記述するために広く用いられます。"}],"collocations":["tensor product","tensor field","rank of a tensor","covariant tensor","contravariant tensor"],"synonyms":["multilinear form"],"antonyms":[]}],"etymology":{"value":"The word 'tensor' was introduced by William Rowan Hamilton in 1846 to describe what we now call the norm (or modulus) of a vector. The modern meaning was introduced by Woldemar Voigt in 1898.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛnsər/","syllables":"ten-sor"},"inflection":{"noun_plural":"tensors"},"usage_notes":{"explanation":"Tensors are fundamental objects in linear algebra and multilinear algebra. They are used to represent various physical quantities and mathematical relationships in a coordinate-independent way. The rank of a tensor is the number of indices needed to specify one of its components.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"A tensor is just a matrix.","correct":"A matrix is a two-dimensional tensor.","note":"While a matrix is a tensor, not all tensors are matrices. Tensors can have any number of dimensions."}],"priority":"★★☆"},"related_words":{"derivatives":["tensorial","tensorially"],"related_terms":["vector","matrix","scalar","linear algebra","multilinear algebra"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Relatively low frequency in general English, but common in scientific and mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tensor' is a technical term primarily used in mathematics and physics. It refers to a mathematical object that generalizes the concepts of scalars, vectors, and matrices. Understanding tensors requires a solid foundation in linear algebra and multilinear algebra. While the concept can be abstract, it is essential for describing many physical phenomena and mathematical relationships in a coordinate-independent manner."},"example_sentences":[{"sentence":"The stress tensor describes the internal forces within a deformable body.","translation":"応力テンソルは、変形可能な物体内の内部力を記述します。","type":"noun","meaning_category":"mathematics, physics"},{"sentence":"Einstein's theory of general relativity uses tensors to describe the curvature of spacetime.","translation":"アインシュタインの一般相対性理論は、時空の曲率を記述するためにテンソルを使用します。","type":"noun","meaning_category":"mathematics, physics"},{"sentence":"Machine learning libraries often use tensors to represent and manipulate data.","translation":"機械学習ライブラリは、データを表現および操作するためにテンソルを使用することがよくあります。","type":"noun","meaning_category":"mathematics, computer science"}]}