{"word":"recompounding","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再複合化、再合成","english_definition":"The process of forming new words by combining existing compound words or morphemes.","examples":[{"sentence":"Recompounding is a common process in language evolution.","translation":"再複合化は言語進化において一般的なプロセスです。"},{"sentence":"The word 'aircraft carrier' is an example of recompounding.","translation":"「航空母艦」という単語は再複合化の例です。"}],"collocations":["lexical recompounding","morphological recompounding"],"synonyms":["recombination","recombination of compounds"],"antonyms":[]}],"etymology":{"value":"The word 'recompounding' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'compounding', which refers to the process of combining words or morphemes to form new words.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːkəmˈpaʊndɪŋ/","syllables":"re-com-pound-ing"},"inflection":{"noun_plural":"recompoundings"},"usage_notes":{"explanation":"Recompounding is a linguistic process where existing compound words are combined to create new, more complex words. It's a form of word formation that builds upon already established compounds. This process can lead to the creation of very long and specific terms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of compounding again is recompounding.","correct":"✓ The process of combining existing compound words is recompounding.","note":"Recompounding specifically refers to combining existing compound words, not just any form of repeated compounding."}],"priority":"★★☆"},"related_words":{"derivatives":["recompound (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recompounding' refers to the process of creating new words by combining existing compound words. This is a more advanced linguistic concept, often discussed in the context of morphology and word formation. Understanding the concept requires familiarity with compounding itself, as well as the idea of recursive application of word-formation rules."},"example_sentences":[{"sentence":"The creation of 'super-duper-deluxe' is an example of **recompounding**.","translation":"「超弩級デラックス」の作成は、**再複合化**の例です。","type":"noun","meaning_category":"再複合化"},{"sentence":"**Recompounding** allows for the creation of highly specific and nuanced terms.","translation":"**再複合化**により、非常に具体的でニュアンスのある用語を作成できます。","type":"noun","meaning_category":"再複合化"}]}