{"word":"polyphoned","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(過去形・過去分詞) ポリフォニーとして編曲する、多声音楽にする","english_definition":"(past tense and past participle of polyphone) to arrange or compose (a piece of music) in polyphony; to make polyphonic.","examples":[{"sentence":"The composer polyphoned the folk tune, creating a rich and complex texture.","translation":"作曲家はその民謡をポリフォニーとして編曲し、豊かで複雑なテクスチャを作り出した。"},{"sentence":"The song was originally monophonic, but it was later polyphoned for a choir.","translation":"その歌は元々モノフォニックだったが、後に合唱のためにポリフォニーとして編曲された。"}],"collocations":["polyphone a melody","polyphone a song","polyphone a tune"],"synonyms":["harmonize","arrange","orchestrate","counterpoint"],"antonyms":["monophone"]},{"part_of_speech":"adjective","definition":"(過去分詞形容詞) ポリフォニーとして編曲された、多声音楽の","english_definition":"(past participle adjective) arranged or composed in polyphony; having multiple independent melodic lines.","examples":[{"sentence":"The polyphoned version of the song was much more interesting than the original.","translation":"その歌のポリフォニー版は、オリジナルよりもはるかに面白かった。"},{"sentence":"The polyphoned arrangement showcased the choir's vocal abilities.","translation":"ポリフォニー編曲は、合唱団の歌唱力を際立たせた。"}],"collocations":["polyphoned arrangement","polyphoned version","polyphoned music"],"synonyms":["harmonized","contrapuntal"],"antonyms":["monophonic"]}],"etymology":{"value":"The word \"polyphoned\" is derived from the verb \"polyphone,\" which is formed by combining \"poly-\" (meaning \"many\" or \"multiple\") with \"phone\" (referring to sound or voice). It describes the act of creating or arranging music in a polyphonic style, where multiple independent melodic lines are interwoven.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɒlɪfoʊnd/","syllables":"pol-y-phoned"},"inflection":{"verb_forms":{"present_simple":["polyphone","polyphones"],"past_simple":"polyphoned","past_participle":"polyphoned","present_participle":"polyphoning"}},"usage_notes":{"explanation":"The term \"polyphoned\" is relatively uncommon in general usage. It is primarily used in musical contexts to describe the process or result of arranging or composing music in a polyphonic style. Polyphony involves multiple independent melodic lines occurring simultaneously, creating a rich and complex texture. The verb \"polyphone\" is used to describe the act of creating such an arrangement, while the adjective \"polyphoned\" describes the resulting music.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The composer polyphoned the song with a new instrument.","correct":"✓ The composer polyphoned the song, adding new instrumental lines.","note":"When using \"polyphone,\" focus on the act of creating multiple melodic lines rather than simply adding an instrument. The addition of an instrument doesn't necessarily make the music polyphonic."},{"incorrect":"✗ The music was polyphoned and beautiful.","correct":"✓ The music was polyphonic and beautiful. / ✓ The music was polyphoned and beautifully arranged.","note":"Use \"polyphonic\" as the adjective to describe the style of the music. \"Polyphoned\" is used to describe the act of arranging or composing in that style."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyphony (noun: the style of simultaneously combining a number of parts, each forming an individual melody and harmonizing with each other.)","polyphonic (adjective: relating to or characterized by polyphony.)","monophony (noun: music consisting of a single melodic line.)","homophony (noun: music characterized by the movement of accompanying parts in the same rhythm as the melody.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"polyphoned\" is a specialized term primarily used in the context of music theory and composition. It refers to the act of arranging or composing a piece of music in a polyphonic style, which involves multiple independent melodic lines occurring simultaneously. Understanding this term requires familiarity with musical concepts and terminology. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The choir performed a beautifully polyphoned version of the Christmas carol.","translation":"合唱団はクリスマスキャロルの美しくポリフォニー編曲されたバージョンを演奏した。","type":"adjective","meaning_category":"多声音楽の"},{"sentence":"The composer polyphoned the simple melody into a complex and layered composition.","translation":"作曲家は単純なメロディーをポリフォニーとして編曲し、複雑で重層的な楽曲にした。","type":"verb","meaning_category":"ポリフォニーとして編曲する"}]}