{"word":"overprotraction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歯科)過度突出、(姿勢)肩の過剰な前方突出","english_definition":"(Dentistry) The condition of a tooth being excessively protruded or extended beyond the normal alignment; (Posture) The excessive forward positioning of a body part, especially the shoulders.","examples":[{"sentence":"The orthodontist noticed significant overprotraction of the patient's upper incisors.","translation":"歯科矯正医は、患者の上顎前歯の著しい過度突出に気づいた。"},{"sentence":"Poor posture can lead to overprotraction of the shoulders, causing neck and back pain.","translation":"悪い姿勢は肩の過剰な前方突出につながり、首や背中の痛みを引き起こす可能性がある。"}],"collocations":["shoulder overprotraction (肩の過剰な前方突出)","dental overprotraction (歯の過度突出)","cervical overprotraction (頸椎の過剰な前方突出)"],"synonyms":["protrusion","extension","forward displacement"],"antonyms":["retraction","rearward displacement"]}],"etymology":{"value":"The word is formed by combining the prefix 'over-' (meaning excessively or beyond the normal limit) with 'protraction' (the act of protruding or extending something forward).","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərproʊˈtrækʃən/","syllables":"o-ver-pro-trac-tion"},"inflection":{"noun_plural":"overprotractions"},"usage_notes":{"explanation":"'Overprotraction' is a technical term primarily used in dentistry and posture analysis. In dentistry, it refers to the excessive forward positioning of a tooth. In posture, it describes the forward displacement of a body part, most commonly the shoulders. It is often associated with poor posture and can contribute to various musculoskeletal problems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had a lot of protraction in his shoulders.","correct":"✓ The patient had overprotraction in his shoulders.","note":"'Protraction' itself simply means a forward movement or position. 'Overprotraction' specifically implies an excessive or abnormal forward positioning."}],"priority":"★★☆"},"related_words":{"derivatives":["overprotract (verb)"],"related_terms":["protraction","retraction","posture","anterior pelvic tilt","kyphosis","forward head posture"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overprotraction' is a relatively uncommon term, primarily used in specialized contexts such as dentistry and physical therapy. It refers to an excessive forward positioning of a body part, such as a tooth or the shoulders. Understanding this term requires familiarity with anatomical and medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The dentist recommended braces to correct the overprotraction of her front teeth.","translation":"歯科医は、彼女の前歯の過度突出を矯正するためにブレースを推奨した。","type":"general","meaning_category":"Dentistry"},{"sentence":"Exercises focusing on scapular retraction can help counteract shoulder overprotraction.","translation":"肩甲骨の引き寄せに焦点を当てたエクササイズは、肩の過剰な前方突出を打ち消すのに役立つ。","type":"general","meaning_category":"Posture"}]}