{"word":"shikarred","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Marked or scarred by a shikar, a hunting expedition, especially in India.","english_definition":"Marked or scarred by a shikar, a hunting expedition, especially in India.","examples":[{"sentence":"His face was shikarred from years spent hunting in the jungle.","translation":"彼の顔は、ジャングルで狩猟に費やした年月によって傷跡が残っていた。"},{"sentence":"The old rifle was shikarred with scratches and dents, a testament to countless hunts.","translation":"その古いライフルは、無数の狩猟の証として、傷やへこみで傷だらけだった。"}],"collocations":["shikarred face","shikarred rifle","shikarred hands"],"synonyms":["scarred","marked","weathered"],"antonyms":["unmarked","unblemished"]}],"etymology":{"value":"Derived from 'shikar', a Hindi word meaning 'hunt' or 'hunting expedition'. The suffix '-ed' indicates a state of being marked or affected by shikar.","priority":"★★☆"},"pronunciation":{"ipa":"/ʃɪˈkɑːrd/","syllables":"shi-karred"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'shikarred' is relatively rare and specific, primarily used to describe something or someone marked by the experience of hunting, especially in the context of Indian or South Asian hunting traditions. It often implies a rugged or experienced quality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He shikarred the deer.","correct":"✓ His face was shikarred by the sun and wind during his shikar.","note":"'Shikarred' is an adjective, not a verb. It describes something that has been marked or scarred."}],"priority":"★☆☆"},"related_words":{"derivatives":["shikar (noun: a hunt or hunting expedition)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Shikarred' is a niche adjective describing something marked by hunting, particularly in India. It's rare and requires understanding of 'shikar' (a hunt). Use it to add vivid detail when describing someone or something deeply connected to hunting traditions, emphasizing experience and ruggedness."},"example_sentences":[{"sentence":"The hunter's hands, shikarred and calloused, told tales of a life spent in the wilderness.","translation":"狩猟者の手は、狩猟によって傷つき、タコができ、荒野で過ごした人生を物語っていた。","type":"adjective","meaning_category":"Marked by hunting"},{"sentence":"The shikarred leather of his hunting jacket bore witness to years of adventure.","translation":"彼のハンティングジャケットの傷だらけの革は、長年の冒険の証だった。","type":"adjective","meaning_category":"Marked by hunting"}]}