{"word":"Hansenosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハンセン病","english_definition":"Leprosy; a chronic infectious disease caused by Mycobacterium leprae, affecting the skin, peripheral nerves, upper respiratory tract, eyes, and testes.","examples":[{"sentence":"Hansenosis is a chronic infectious disease that can cause nerve damage, muscle weakness, and skin lesions.","translation":"ハンセン病は、神経損傷、筋力低下、および皮膚病変を引き起こす可能性のある慢性感染症です。"}],"collocations":["treatment of Hansenosis","diagnosis of Hansenosis","signs of Hansenosis"],"synonyms":["Leprosy"],"antonyms":[]}],"etymology":{"value":"Named after Norwegian physician Gerhard Armauer Hansen, who discovered Mycobacterium leprae in 1873. The suffix '-osis' indicates a disease or abnormal condition.","priority":"★★☆"},"pronunciation":{"ipa":"/hænˈsinoʊsɪs/","syllables":"han-se-no-sis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Hansenosis' is a more neutral and preferred term for leprosy, as 'leprosy' can carry stigma. It is used in medical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has Hansen.","correct":"✓ He has Hansenosis.","note":"'Hansen' refers to the person (Gerhard Armauer Hansen), not the disease. Use 'Hansenosis' to refer to the disease."}],"priority":"★★☆"},"related_words":{"derivatives":["Hansen's disease"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hansenosis' is a scientific term for leprosy, a chronic infectious disease. It is primarily used in medical contexts to avoid the stigma associated with the term 'leprosy.' Understanding this term is relevant in discussions about infectious diseases and medical history."},"example_sentences":[{"sentence":"Early diagnosis and treatment of Hansenosis are crucial to prevent disability.","translation":"ハンセン病の早期診断と治療は、障害を防ぐために非常に重要です。","type":"noun","meaning_category":"disease"}]}