{"word":"Loxodograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"航程線図、斜航線図","english_definition":"A chart or diagram showing loxodromes (rhumb lines).","examples":[{"sentence":"The loxodograph is useful for navigation because it shows rhumb lines as straight lines.","translation":"航程線図は、航程線を直線として表示するため、航海に役立ちます。"}],"collocations":["use a loxodograph","create a loxodograph","navigation with loxodograph"],"synonyms":["rhumb chart","Mercator chart"],"antonyms":[]}],"etymology":{"value":"From loxodrome (from Greek loxos 'oblique' + dromos 'course') + -graph (denoting something written or drawn).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɒksəˈdoʊɡræf/","syllables":"lox-o-do-graph"},"inflection":{"noun_plural":"loxodographs"},"usage_notes":{"explanation":"A loxodograph is a type of map projection, specifically a Mercator projection, that displays rhumb lines (lines of constant bearing) as straight lines. This makes it valuable for navigation, as sailors can easily plot a course with a constant compass bearing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The loxodograph is a type of great circle route.","correct":"✓ The loxodograph displays rhumb lines, not great circle routes.","note":"Loxodographs are used for rhumb lines, while gnomonic projections are used for great circle routes."}],"priority":"★★☆"},"related_words":{"derivatives":["loxodrome","rhumb line","Mercator projection"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"A loxodograph is a specialized type of map, specifically a Mercator projection, used in navigation. It displays rhumb lines (lines of constant compass bearing) as straight lines, making it easier for sailors to plot courses. This term is rarely used outside of cartography and navigation contexts. Understanding requires knowledge of map projections and navigational terminology."},"example_sentences":[{"sentence":"The navigator consulted the loxodograph to determine the correct compass bearing.","translation":"航海士は正しいコンパス方位を決定するために航程線図を参照した。","type":"noun","meaning_category":"航海図"},{"sentence":"The loxodograph's straight rhumb lines simplified course plotting.","translation":"航程線図の直線的な航程線は、コースのプロットを簡略化した。","type":"noun","meaning_category":"航海図"}]}