{"word":"Hydrophiinae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウミヘビ亜科：コブラ科に属する有毒な海生ヘビの亜科","english_definition":"A subfamily of venomous, mostly marine snakes belonging to the family Elapidae (cobras and allies).","examples":[{"sentence":"Hydrophiinae are found in tropical and subtropical waters of the Indian and Pacific Oceans.","translation":"ウミヘビ亜科は、インド洋および太平洋の熱帯および亜熱帯水域に生息しています。"},{"sentence":"Members of Hydrophiinae are highly adapted to marine life.","translation":"ウミヘビ亜科のメンバーは、海洋生活に高度に適応しています。"}],"collocations":["sea snake venom","marine reptiles","elapid snakes"],"synonyms":["sea snakes"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water) and 'ophis' (snake), combined with the suffix '-inae' used in zoological taxonomy to denote a subfamily.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈfaɪˌiːniː/","syllables":"Hy-dro-phi-i-nae"},"inflection":{"noun_plural":"Hydrophiinae (already plural form)"},"usage_notes":{"explanation":"Hydrophiinae is a taxonomic term used in zoology to classify a specific group of sea snakes. It is important to use the correct spelling and capitalization when referring to this group of animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydrophinae is a sea snake.","correct":"✓ A Hydrophiinae snake is a sea snake.","note":"Hydrophiinae is a plural or collective term, so it should be used with plural verbs or in a descriptive context."}],"priority":"★★☆"},"related_words":{"derivatives":["Hydrophis (a genus within Hydrophiinae)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hydrophiinae' is a scientific term used in biology and zoology to classify a subfamily of sea snakes. Understanding this term requires knowledge of biological taxonomy and the specific characteristics of these marine reptiles. It is primarily used in scientific literature and discussions. The pronunciation and spelling should be precise to avoid confusion with other terms."},"example_sentences":[{"sentence":"Research on Hydrophiinae venom is crucial for developing effective antivenom treatments.","translation":"ウミヘビ亜科の毒に関する研究は、効果的な抗毒素治療の開発に不可欠です。","type":"noun","meaning_category":"scientific research"},{"sentence":"The distribution of Hydrophiinae is largely confined to the warm waters of the Indo-Pacific region.","translation":"ウミヘビ亜科の分布は、主にインド太平洋地域の温暖な海域に限られています。","type":"noun","meaning_category":"geographic distribution"}]}