{"word":"DEI","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"多様性、公平性、包括性 (Diversity, Equity, and Inclusion)","english_definition":"An acronym that stands for Diversity, Equity, and Inclusion. It refers to organizational frameworks and initiatives aimed at promoting representation and participation of different groups of individuals, ensuring fair treatment and access to opportunities, and fostering a sense of belonging for all members.","examples":[{"sentence":"The company has a strong commitment to DEI.","translation":"その会社はDEIに強く取り組んでいます。"},{"sentence":"We need to improve our DEI efforts.","translation":"私たちはDEIの取り組みを改善する必要があります。"},{"sentence":"The DEI training was very informative.","translation":"DEIの研修は非常に有益でした。"}],"collocations":["DEI initiatives (DEIの取り組み)","DEI training (DEI研修)","DEI committee (DEI委員会)","DEI strategy (DEI戦略)","DEI goals (DEI目標)","DEI metrics (DEI指標)","DEI report (DEIレポート)"],"synonyms":["diversity","equity","inclusion"],"antonyms":["exclusion","inequity","homogeneity"]}],"etymology":{"value":"An acronym formed from the first letters of Diversity, Equity, and Inclusion.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌiːˈaɪ/","syllables":"DEE-EE-EYE"},"inflection":{"notes":"It is a noun, so it can be pluralized as DEIs, but it is often used as a singular concept."},"usage_notes":{"explanation":"DEI is an acronym that stands for Diversity, Equity, and Inclusion. These three interconnected values are increasingly important in modern organizations and societies. Diversity refers to the presence of differences within a group, including race, ethnicity, gender, sexual orientation, socioeconomic status, age, physical abilities, religious beliefs, political beliefs, and other ideologies. Equity refers to fair treatment, access, opportunity, and advancement for all people, while at the same time striving to identify and eliminate barriers that have prevented the full participation of some groups. Inclusion refers to creating a culture where all individuals are respected, valued, and feel a sense of belonging. DEI initiatives aim to create more just and equitable environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is very DEI.","correct":"✓ The company is committed to DEI.","note":"DEI is a concept, not an adjective to describe a company. Use it with verbs like 'committed to', 'focused on', or 'invested in'."},{"incorrect":"✗ We need more diversity, but not DEI.","correct":"✓ We need more diversity as part of our DEI strategy.","note":"Diversity is a component of DEI. You can't have DEI without diversity."},{"incorrect":"✗ DEI is just about quotas.","correct":"✓ DEI is about creating a fair and inclusive environment for everyone.","note":"DEI is not just about meeting quotas. It's about creating a culture of belonging and fairness."}],"priority":"★★☆"},"related_words":{"derivatives":["diversity","equity","inclusion","belonging","fairness","justice"],"acronyms":["ESG (Environmental, Social, and Governance)","EDI (Equity, Diversity, and Inclusion)","JEDI (Justice, Equity, Diversity, and Inclusion)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (specialized vocabulary)","frequency_google_ngram":"Increasingly frequent, especially in business and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'DEI' is an acronym standing for Diversity, Equity, and Inclusion. It's used in discussions about creating fairer and more representative workplaces and communities. Diversity means having people from different backgrounds and identities represented. Equity means ensuring everyone has fair access to opportunities and resources, recognizing that some people may need more support to overcome barriers. Inclusion means creating a welcoming and respectful environment where everyone feels valued and can participate fully. DEI is a complex topic with many different perspectives and approaches."},"example_sentences":[{"sentence":"The company's DEI program aims to increase representation of underrepresented groups.","translation":"その会社のDEIプログラムは、過小評価されているグループの代表を増やすことを目指しています。","type":"noun","meaning_category":"Diversity, Equity, and Inclusion"},{"sentence":"Our DEI strategy includes initiatives to promote pay equity.","translation":"私たちのDEI戦略には、賃金公平を促進するためのイニシアチブが含まれています。","type":"noun","meaning_category":"Diversity, Equity, and Inclusion"},{"sentence":"The DEI committee is responsible for developing and implementing DEI policies.","translation":"DEI委員会は、DEIポリシーの開発と実施を担当しています。","type":"noun","meaning_category":"Diversity, Equity, and Inclusion"}]}