{"word":"diagnoseable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"診断可能な、診断できる","english_definition":"capable of being diagnosed; able to be identified through medical examination or analysis.","examples":[{"sentence":"This condition is easily diagnoseable with a blood test.","translation":"この状態は血液検査で簡単に診断可能です。"},{"sentence":"The disease is diagnoseable in its early stages, which improves the chances of successful treatment.","translation":"その病気は初期段階で診断可能であり、それにより治療成功の可能性が高まります。"},{"sentence":"With advanced imaging techniques, many previously undetectable conditions are now diagnoseable.","translation":"高度な画像技術により、以前は検出不可能だった多くの状態が現在では診断可能です。"}],"collocations":["easily diagnoseable (簡単に診断可能な)","readily diagnoseable (容易に診断可能な)","clinically diagnoseable (臨床的に診断可能な)","diagnoseable condition (診断可能な状態)","diagnoseable disease (診断可能な病気)","diagnoseable illness (診断可能な病気)"],"synonyms":["identifiable","ascertainable","determinable","detectable","recognizable"],"antonyms":["undiagnosable","undetectable","unidentifiable","unrecognizable"]}],"etymology":{"value":"The word 'diagnoseable' is formed by adding the suffix '-able' (meaning 'capable of' or 'suitable for') to the verb 'diagnose'. 'Diagnose' comes from the Greek word 'diagnōsis', meaning 'discernment' or 'distinguishing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəɡˈnoʊzəbəl/","syllables":"di-ag-nos-a-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations. Comparative and superlative forms are 'more diagnoseable' and 'most diagnoseable', respectively."},"usage_notes":{"explanation":"'Diagnoseable' is used to describe a condition, disease, or illness that can be identified or determined through medical examination, testing, or analysis. It emphasizes the possibility of reaching a diagnosis, which is crucial for appropriate treatment and management of the condition. The term is commonly used in medical and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is diagnoseable with cancer.","correct":"✓ The patient's condition is diagnoseable as cancer. / ✓ The patient can be diagnosed with cancer.","note":"The adjective 'diagnoseable' describes the condition, not the patient. The correct phrasing is to say that the condition is diagnoseable as something or that the patient can be diagnosed with something."},{"incorrect":"✗ The diagnoseable of the disease is difficult.","correct":"✓ The diagnosis of the disease is difficult. / ✓ Determining whether the disease is diagnoseable is difficult.","note":"'Diagnoseable' is an adjective, not a noun. The noun form is 'diagnosis'."},{"incorrect":"✗ This test is diagnoseable for the disease.","correct":"✓ This test is used to make the disease diagnoseable. / ✓ This test helps to diagnose the disease.","note":"Tests don't get diagnosed, but they help make a disease diagnoseable or help in diagnosing the disease."}],"priority":"★★☆"},"related_words":{"derivatives":["diagnose (verb: 診断する)","diagnosis (noun: 診断)","diagnostic (adjective: 診断の、診断的な; noun: 診断薬)","undiagnosable (adjective: 診断不可能な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diagnoseable' means that something can be identified through medical examination or testing. It's used to describe conditions or diseases that doctors can figure out by looking at symptoms, running tests, or using other medical tools. If a disease is 'diagnoseable,' it means doctors have ways to find out if someone has it. This word is mostly used in medical or scientific discussions."},"example_sentences":[{"sentence":"Many mental health conditions are now more readily diagnoseable thanks to advancements in psychological testing.","translation":"心理検査の進歩により、多くの精神疾患がより容易に診断可能になりました。","type":"adjective","meaning_category":"Medical"},{"sentence":"The tumor was diagnoseable through a simple MRI scan.","translation":"腫瘍は簡単なMRIスキャンで診断可能でした。","type":"adjective","meaning_category":"Medical"},{"sentence":"Early detection is crucial because the disease is more easily diagnoseable in its initial stages.","translation":"早期発見が重要です。なぜなら、その病気は初期段階でより簡単に診断可能だからです。","type":"adjective","meaning_category":"Medical"}]}