{"word":"meritocracia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"能力主義、実力主義","english_definition":"meritocracy","examples":[{"sentence":"A meritocracia é um sistema onde o sucesso é baseado no mérito.","translation":"能力主義は、成功が能力に基づいて決まるシステムです。"},{"sentence":"Alguns argumentam que a sociedade moderna se tornou uma meritocracia.","translation":"現代社会は能力主義社会になったと主張する人もいます。"}],"collocations":["ascensão na meritocracia (能力主義社会での出世)","princípios da meritocracia (能力主義の原則)","críticas à meritocracia (能力主義への批判)"],"synonyms":["competência","capacidade","habilidade"],"antonyms":["nepotismo","clientelismo"]},{"part_of_speech":"noun","definition":"能力主義社会","english_definition":"meritocratic society","examples":[{"sentence":"Em uma meritocracia, espera-se que os mais talentosos alcancem as posições de liderança.","translation":"能力主義社会では、最も才能のある人がリーダーシップの地位に就くことが期待されます。"}],"collocations":["sociedade meritocrática (能力主義社会)","sistema meritocrático (能力主義システム)"],"synonyms":["sociedade baseada no mérito","sistema de mérito"],"antonyms":["sociedade desigual","sistema de privilégios"]}],"etymology":{"value":"A palavra \"meritocracia\" foi cunhada em 1958 pelo sociólogo britânico Michael Young em seu livro satírico \"The Rise of the Meritocracy\". Ele usou o termo de forma crítica para descrever uma sociedade onde o poder é concentrado nas mãos daqueles considerados mais inteligentes e talentosos, com possíveis consequências negativas para a igualdade social.","priority":"★★☆"},"pronunciation":{"ipa":"/meɾitokɾaˈsia/","syllables":"me-ri-to-cra-ci-a"},"inflection":{"noun_gender":"feminine","noun_plural":"meritocracias"},"usage_notes":{"explanation":"O termo \"meritocracia\" é usado tanto para descrever um sistema ideal onde o sucesso é baseado no mérito individual, quanto para criticar sociedades que afirmam ser meritocráticas, mas que na prática perpetuam desigualdades. É importante considerar o contexto em que a palavra é usada para entender se ela está sendo usada de forma positiva ou crítica.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"A meritocracia garante igualdade de resultados.","correct":"A meritocracia busca igualdade de oportunidades.","note":"A meritocracia não garante que todos terão os mesmos resultados, mas sim que todos terão as mesmas oportunidades para alcançar o sucesso com base em seu mérito."}],"priority":"★★☆"},"related_words":{"derivatives":["meritocrático (adjective)","meritocraticamente (adverb)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relativamente frequente em discussões sobre política e sociologia.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Meritocracia\" é um termo usado em discussões sobre sistemas políticos e sociais. Refere-se à ideia de que o sucesso e o poder devem ser distribuídos com base no mérito individual, como talento, esforço e habilidade, em vez de fatores como riqueza, família ou status social. No entanto, o termo também é frequentemente usado de forma crítica para descrever sociedades que afirmam ser meritocráticas, mas que na realidade perpetuam desigualdades. É importante entender os diferentes significados e conotações da palavra para interpretar corretamente as discussões sobre o tema."},"example_sentences":[{"sentence":"A meritocracia é vista por muitos como um ideal de justiça social.","translation":"能力主義は多くの人によって社会正義の理想と見なされています。","type":"noun","meaning_category":"能力主義"},{"sentence":"A falta de oportunidades pode impedir o funcionamento de uma verdadeira meritocracia.","translation":"機会の欠如は、真の能力主義の機能を妨げる可能性があります。","type":"noun","meaning_category":"能力主義社会"},{"sentence":"O sistema de avaliação é baseado em princípios meritocráticos.","translation":"評価システムは能力主義の原則に基づいています。","type":"adjective","meaning_category":"能力主義的な"}]}