{"word":"wild-oat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"野生のカラスムギ","english_definition":"A type of grass that grows wild.","examples":[{"sentence":"The field was overgrown with wild-oat.","translation":"その畑は野生のカラスムギが生い茂っていた。"}],"collocations":[],"synonyms":["Avena fatua"],"antonyms":[]},{"part_of_speech":"noun","definition":"放蕩者、道楽息子","english_definition":"A person who leads a dissolute or unrestrained life, especially a young man.","examples":[{"sentence":"He sowed his wild oats in his youth, but later settled down.","translation":"彼は若い頃は放蕩生活を送ったが、後に落ち着いた。"}],"collocations":["sow one's wild oats"],"synonyms":["rake","libertine","prodigal","wastrel"],"antonyms":[]}],"etymology":{"value":"The term 'wild oat' originally referred to the plant. The figurative sense, referring to a person leading a dissolute life, likely arose from the idea of scattering seeds without care, similar to how a wild oat plant spreads its seeds indiscriminately.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwaɪld oʊt/","syllables":"wild-oat"},"inflection":{"noun_plural":"wild-oats"},"usage_notes":{"explanation":"The term 'wild-oat' has two distinct meanings: a type of wild grass and a person who leads a dissolute life. The latter is often used in the phrase 'sow one's wild oats,' meaning to engage in youthful indiscretions or reckless behavior before settling down.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a wild oat plant.","correct":"✓ He is sowing his wild oats.","note":"The phrase 'sow one's wild oats' is more common than simply calling someone 'a wild oat' to describe their behavior."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'wild-oat' has two meanings. The first is literal, referring to a type of wild grass. The second is figurative, describing a person, typically a young man, who leads a dissolute or unrestrained life. This usage is often found in the idiom 'sow one's wild oats,' indicating a period of youthful indulgence before settling down. Understanding the context is crucial to interpreting the intended meaning.","note":"The figurative meaning is more common in literature and older texts."},"example_sentences":[{"sentence":"The farmer struggled to control the spread of wild-oat in his fields.","translation":"農夫は畑での野生のカラスムギの蔓延を抑えるのに苦労した。","type":"noun","meaning_category":"植物"},{"sentence":"He decided to travel the world and sow his wild oats before starting a career.","translation":"彼はキャリアを始める前に世界を旅して放蕩生活を送ることに決めた。","type":"noun","meaning_category":"放蕩者"}]}