{"word":"overindustrialism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過度な工業化、過剰工業化","english_definition":"The excessive or extreme development of industry.","examples":[{"sentence":"The environmental damage caused by overindustrialism is a major concern.","translation":"過剰な工業化によって引き起こされる環境破壊は、大きな懸念事項です。"},{"sentence":"Some argue that overindustrialism leads to social and economic inequality.","translation":"過剰な工業化は、社会経済的な不平等につながると主張する人もいます。"}],"collocations":["environmental impact of overindustrialism (過剰な工業化の環境への影響)","negative consequences of overindustrialism (過剰な工業化の負の側面)"],"synonyms":["excessive industrialization","hyperindustrialization"],"antonyms":["deindustrialization"]}],"etymology":{"value":"\"over-\" (過剰な) + \"industrialism\" (工業化)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərɪnˈdʌstriəlɪzəm/","syllables":"o-ver-in-dus-tri-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Overindustrialism\" refers to a state where industrial development is considered excessive, often leading to negative consequences such as environmental damage, social inequality, and economic instability. It is often used in discussions about sustainable development and the balance between economic growth and environmental protection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overindustrialism is good for the economy.","correct":"✓ Overindustrialism can have short-term economic benefits, but it often leads to long-term environmental problems.","note":"While industrialization can boost the economy, overindustrialism often has negative consequences."}],"priority":"★☆☆"},"related_words":{"derivatives":["overindustrialized (adjective)"],"related_terms":["industrialization","post-industrialism","deindustrialization","sustainable development"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overindustrialism\" is a complex term referring to excessive industrial development, often associated with negative environmental and social impacts. It's used in discussions about sustainable development and the balance between economic growth and environmental protection. The term is not commonly used in everyday conversation but is more frequently found in academic and policy-related contexts."},"example_sentences":[{"sentence":"The government is trying to curb overindustrialism in the region to protect natural resources.","translation":"政府は、天然資源を保護するために、その地域での過剰な工業化を抑制しようとしています。","type":"general","meaning_category":"general"},{"sentence":"Critics argue that overindustrialism prioritizes profit over the well-being of communities.","translation":"批評家たちは、過剰な工業化は地域社会の幸福よりも利益を優先すると主張しています。","type":"general","meaning_category":"general"}]}