{"word":"tabific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Making or causing to waste away; consumptive.","english_definition":"Causing or characterized by wasting away of the body; consumptive.","examples":[{"sentence":"The patient exhibited tabific symptoms, including weight loss and fatigue.","translation":"患者は、体重減少や疲労などの消耗性の症状を示しました。"},{"sentence":"A tabific disease can severely weaken the body's immune system.","translation":"消耗性の病気は、体の免疫システムを著しく弱める可能性があります。"}],"collocations":["tabific disease","tabific symptoms","tabific condition"],"synonyms":["consumptive","wasting","emaciating","debilitating"],"antonyms":["strengthening","invigorating","building up"]}],"etymology":{"value":"From Latin tabes ('a wasting disease, decay'), + -fic (from facere 'to make').","priority":"★★★"},"pronunciation":{"ipa":"/təˈbɪfɪk/","syllables":"ta-bif-ic"},"inflection":{"adjective_forms":{"comparative":"more tabific","superlative":"most tabific"}},"usage_notes":{"explanation":"'Tabific' is a relatively rare and somewhat archaic term, primarily used in medical or literary contexts to describe conditions or diseases that cause the body to waste away. It is closely related to the term 'tabes,' which refers to a progressive wasting of the body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tabific food made him sick.","correct":"✓ The spoiled food made him sick.","note":"'Tabific' describes a condition causing wasting, not food that causes sickness. Use terms like 'spoiled' or 'contaminated' for food. "},{"incorrect":"✗ He felt tabific after a long day of work.","correct":"✓ He felt exhausted after a long day of work.","note":"'Tabific' describes a chronic wasting condition, not temporary tiredness. Use words like 'exhausted' or 'fatigued' for temporary states."}],"priority":"★★☆"},"related_words":{"derivatives":["tabes (noun: a wasting disease)","tabetic (adjective: relating to or affected by tabes)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - archaic and rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tabific' is a specialized term, primarily encountered in historical medical texts or literature. It describes something that causes the body to waste away, often due to disease. Due to its rarity, it is not typically used in general conversation or writing. Understanding its meaning requires familiarity with medical terminology and Latin roots."},"example_sentences":[{"sentence":"The old medical texts described the symptoms as being indicative of a tabific condition.","translation":"古い医学書では、その症状は消耗性の状態を示していると説明されていました。","type":"general","meaning_category":"wasting away"},{"sentence":"The tabific effects of the illness left him frail and weak.","translation":"その病気の消耗性の影響で、彼は虚弱で弱々しくなりました。","type":"general","meaning_category":"wasting away"}]}