{"word":"bahuvrihi","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) 外心複合語、所有複合語：複合語の一種で、複合語全体が、構成要素に直接言及されるものではなく、それらが特徴づける何か（または誰か）を指すもの。","english_definition":"(linguistics) A type of compound word whose overall referent is neither of the constituents but something (or someone) characterized by them.","examples":[{"sentence":"The word 'pale-face' is a bahuvrihi because it refers to a person who has a pale face, not a face or paleness itself.","translation":"「青白い顔」という言葉は、青白い顔の人を指し、顔や青白さそのものを指すわけではないので、外心複合語です。"},{"sentence":"'Blockhead' is a bahuvrihi compound, referring to a stupid person, not a block or a head.","translation":"「石頭」は外心複合語で、ブロックや頭ではなく、愚かな人を指します。"}],"collocations":["bahuvrihi compound","exocentric compound"],"synonyms":["exocentric compound","possessive compound"],"antonyms":["endocentric compound"],"notes":"Bahuvrihi compounds are a type of exocentric compound, where the meaning of the compound is not derived from the meaning of its parts. The term comes from Sanskrit, literally meaning 'having much rice'."}],"etymology":{"value":"From Sanskrit बहुव्रीहि (bahuvrīhi), from बहु (bahu, “much”) + व्रीहि (vrīhi, “rice”), literally “having much rice”. It refers to a rich man who has much rice.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɑːhuːˈvriːhiː/","syllables":"ba-hu-vri-hi"},"inflection":{"notes":"Plural: bahuvrihis"},"usage_notes":{"explanation":"A bahuvrihi compound functions as a descriptive adjective or noun, where the compound describes something that possesses the qualities described by its constituent parts. The compound itself does not refer to the parts directly but to something associated with those parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A bahuvrihi compound's meaning is derived directly from the sum of its parts.","correct":"✓ A bahuvrihi compound's meaning is not derived directly from the sum of its parts; it refers to something characterized by those parts.","note":"The key characteristic of a bahuvrihi is that its meaning is exocentric, not a direct combination of its parts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["exocentric","endocentric","compound word","linguistics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'bahuvrihi' is a technical term used in linguistics to describe a specific type of compound word. Understanding it requires familiarity with linguistic terminology related to morphology and word formation. It is not commonly used outside of academic contexts. The key concept is that the meaning of the compound is not a direct combination of the meanings of its parts, but rather refers to something that possesses the characteristics described by those parts."},"example_sentences":[{"sentence":"In the phrase 'redhead,' 'redhead' is a bahuvrihi compound because it describes a person with red hair.","translation":"「赤毛」という句では、「赤毛」は赤毛の人を指す外心複合語です。","type":"noun","meaning_category":"linguistics"},{"sentence":"The term 'blue-collar' is a bahuvrihi, referring to workers who wear blue work clothes.","translation":"「ブルーカラー」という用語は、青い作業着を着ている労働者を指す外心複合語です。","type":"noun","meaning_category":"linguistics"}]}