{"word":"antimachine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(SF)機械に反対する人、機械を破壊する人、または機械に敵対する勢力","english_definition":"(Science Fiction) A person, group, or force that opposes or destroys machines.","examples":[{"sentence":"The antimachine faction sabotaged the factory's robotic assembly line.","translation":"反機械派閥は、工場のロボット組立ラインを妨害した。"},{"sentence":"He was labeled an antimachine extremist for advocating a return to manual labor.","translation":"彼は手作業への回帰を提唱したため、反機械過激派のレッテルを貼られた。"}],"collocations":["antimachine faction","antimachine sentiment","antimachine philosophy"],"synonyms":["luddite","technophobe"],"antonyms":["technophile","machine enthusiast"]},{"part_of_speech":"adjective","definition":"機械に反対する、機械に敵対する","english_definition":"Opposed to or hostile towards machines.","examples":[{"sentence":"The artist's work expressed an antimachine message, highlighting the dehumanizing effects of technology.","translation":"そのアーティストの作品は、テクノロジーの非人間化効果を強調し、反機械的なメッセージを表現していた。"},{"sentence":"The antimachine movement gained traction as automation threatened jobs.","translation":"自動化が雇用を脅かすにつれて、反機械運動は勢いを増した。"}],"collocations":["antimachine movement","antimachine rhetoric","antimachine bias"],"synonyms":["against technology","opposed to automation"],"antonyms":["pro-technology","pro-automation"]}],"etymology":{"value":"\"anti-\" (反対) + \"machine\" (機械)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiːməˈʃiːn/","syllables":"an-ti-ma-chine"},"inflection":{"noun_plural":"antimachines"},"usage_notes":{"explanation":"\"Antimachine\" is primarily used in science fiction or speculative contexts to describe individuals or groups who are against the use of machines, often due to concerns about job displacement, dehumanization, or the potential for machines to become too powerful. It can also describe a general sentiment or philosophy that is critical of technology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is antimachines.","correct":"✓ He is antimachine.","note":"When referring to a person who is against machines, \"antimachine\" is often used as a noun adjunct (attributive noun) or an adjective. The plural form is less common in this context."},{"incorrect":"✗ The antimachine was destroyed.","correct":"✓ The machine was destroyed by antimachine activists.","note":"\"Antimachine\" refers to the opposition to machines, not a machine itself. If a machine is destroyed by those opposing machines, specify the actors."}],"priority":"★★☆"},"related_words":{"derivatives":["antitechnology","luddism","technophobia"],"phrases":["resistance to technology","opposition to automation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antimachine\" is a compound word used to describe opposition to machines or technology. It is most often encountered in science fiction or philosophical discussions about the role of technology in society. The term implies a critical or hostile stance towards machines, often stemming from concerns about their impact on employment, human autonomy, or the environment. Understanding the prefix \"anti-\" (meaning against) and the word \"machine\" is key to grasping the meaning of \"antimachine.\""},"example_sentences":[{"sentence":"The protagonist in the novel is an outspoken advocate for the antimachine cause.","translation":"小説の主人公は、反機械運動の大声での提唱者である。","type":"noun","meaning_category":"機械に反対する人"},{"sentence":"The government feared the rise of antimachine terrorism.","translation":"政府は反機械テロの台頭を恐れた。","type":"adjective","meaning_category":"機械に敵対する"}]}