{"word":"technique-specific","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"特定の技術に特有の、特定の技術に限定された","english_definition":"Relating to or characteristic of a particular technique. Limited to a specific technique.","examples":[{"sentence":"This exercise is technique-specific, focusing on improving your backhand.","translation":"この練習は特定の技術に特化しており、バックハンドの向上に重点を置いています。"},{"sentence":"The software uses technique-specific algorithms to optimize performance.","translation":"そのソフトウェアは、パフォーマンスを最適化するために、特定の技術に特化したアルゴリズムを使用しています。"},{"sentence":"Technique-specific training is crucial for mastering advanced skills.","translation":"高度なスキルを習得するには、特定の技術に特化したトレーニングが不可欠です。"}],"collocations":["technique-specific training","technique-specific algorithm","technique-specific approach","technique-specific knowledge","technique-specific skill"],"synonyms":["specialized","particular","focused","dedicated","customized"],"antonyms":["general","broad","universal","non-specific"]}],"etymology":{"value":"Combination of \"technique\" (from French, ultimately from Greek \"tekhnē\" meaning art or skill) and \"specific\" (from Latin \"specificus\" meaning particular or definite).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛkˈniːk spəˈsɪfɪk/","syllables":"tech-nique-spe-ci-fic"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Technique-specific\" is used to describe something that is designed for or related to a particular technique. It emphasizes the focused and specialized nature of the subject. It is often used in the context of training, skills, and algorithms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a specific technique.","correct":"✓ This is a technique-specific approach.","note":"While \"specific technique\" is grammatically correct, \"technique-specific\" emphasizes that the approach, training, etc., is designed *for* that technique, rather than just being a specific technique among many."}],"priority":"★★☆"},"related_words":{"derivatives":["technique","specific","specificity","technically"],"related_terms":["skill-specific","domain-specific","task-specific"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Technique-specific\" is a compound adjective used in specialized or technical contexts to describe something that is particularly designed for or related to a particular technique. It implies a high degree of specialization and focus. It is commonly used in fields such as sports, engineering, and computer science."},"example_sentences":[{"sentence":"The coach designed a technique-specific drill to improve the player's footwork.","translation":"コーチは、選手のフットワークを向上させるために、特定の技術に特化したドリルを設計しました。","type":"adjective","meaning_category":"Relating to a particular technique."},{"sentence":"This training program includes technique-specific exercises for advanced climbers.","translation":"このトレーニングプログラムには、上級クライマー向けの特定の技術に特化したエクササイズが含まれています。","type":"adjective","meaning_category":"Limited to a specific technique."}]}