{"word":"Mocock","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Archaic) A type of basket or container, often made of birch bark or similar material.","english_definition":"An archaic term for a basket or container, typically crafted from birch bark or comparable materials.","examples":[{"sentence":"The trapper carried his provisions in a sturdy mocock.","translation":"その罠猟師は丈夫なモコックの中に食料を詰めて運んだ。"},{"sentence":"Native Americans used mococks to store maple sugar.","translation":"ネイティブアメリカンはモコックを使ってメープルシュガーを保存した。"}],"collocations":["birch bark mocock","maple sugar mocock"],"synonyms":["basket","container","box","vessel"],"antonyms":[]}],"etymology":{"value":"Likely derived from an Algonquian language, possibly related to words for 'box' or 'container'. The exact origin is uncertain.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊkɒk/","syllables":"Mo-cock"},"inflection":{"noun_plural":"mococks"},"usage_notes":{"explanation":"The term 'mocock' is relatively rare in modern English. It is primarily encountered in historical contexts or in discussions of Native American culture and crafts. It specifically refers to a type of container, often made from natural materials like birch bark, used for storage or transport.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He put the water in a mocock.","correct":"✓ He put the water in a waterskin.","note":"Mococks are not typically used for liquids, as they are made of bark or similar materials and are not watertight. Waterskins or other specialized containers would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mocock' is an archaic term rarely used in contemporary English. It refers to a specific type of container, often made from birch bark, used historically by Native Americans and early settlers. Understanding this word requires familiarity with historical contexts and specialized vocabulary related to material culture."},"example_sentences":[{"sentence":"The archaeologist discovered fragments of a mocock at the excavation site.","translation":"考古学者は発掘現場でモコックの破片を発見した。","type":"noun","meaning_category":"container"},{"sentence":"Early settlers learned to make mococks from the local Native American tribes.","translation":"初期の入植者は地元のネイティブアメリカンの部族からモコックの作り方を学んだ。","type":"noun","meaning_category":"container"}]}