{"word":"poetico-mythological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"詩的・神話的な","english_definition":"Combining elements of poetry and mythology; relating to or characteristic of both poetry and mythology.","examples":[{"sentence":"The painting has a poetico-mythological quality, blending classical motifs with a lyrical style.","translation":"その絵画は、古典的なモチーフと叙情的なスタイルを融合させ、詩的・神話的な性質を持っている。"},{"sentence":"His works often explore poetico-mythological themes, drawing inspiration from ancient legends and folklore.","translation":"彼の作品は、古代の伝説や民話からインスピレーションを得て、詩的・神話的なテーマを探求することが多い。"}],"collocations":["poetico-mythological imagery","poetico-mythological narrative","poetico-mythological interpretation"],"synonyms":["mythopoetic","allegorical","symbolic","fabled"],"antonyms":["realistic","literal","historical","factual"]}],"etymology":{"value":"A combination of 'poetic' and 'mythological'. 'Poetic' comes from the Greek 'poiesis' (making, poetry), and 'mythological' comes from the Greek 'mythos' (story, myth) and 'logos' (word, study).","priority":"★★☆"},"pronunciation":{"ipa":"/poʊˌɛtɪkoʊˌmɪθəˈlɒdʒɪkəl/","syllables":"po-e-ti-co-my-tho-lo-gi-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'poetico-mythological' is used to describe something that combines the characteristics of both poetry and mythology. It often refers to artistic or literary works that draw inspiration from myths and legends, and are expressed in a lyrical or imaginative style. The term suggests a deep connection to cultural heritage and a creative interpretation of traditional stories.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poetico-mythological is a type of poem.","correct":"✓ The poetico-mythological element is present in the poem.","note":"'Poetico-mythological' is an adjective, not a noun. It describes a quality or characteristic, not a type of thing."},{"incorrect":"✗ He wrote a poetico-mythological about his life.","correct":"✓ He wrote a poetico-mythological poem about his life.","note":"The adjective should be used to describe a noun, such as 'poem', 'story', or 'work'."}],"priority":"★☆☆"},"related_words":{"derivatives":["poetic","mythological","mythopoetry","mythopoeia"],"phrases":["poetic license","mythological creatures","classical mythology"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'poetico-mythological' is a complex term used in literary and artistic criticism to describe works that blend poetic and mythological elements. Understanding this word requires familiarity with both poetry and mythology, as well as the ability to recognize how these elements can be combined to create a specific effect. This term is not commonly used in everyday conversation and is more often found in academic or specialized contexts."},"example_sentences":[{"sentence":"The opera's libretto is rich in poetico-mythological allusions.","translation":"そのオペラの台本は、詩的・神話的な暗示に富んでいる。","type":"general","meaning_category":"general"},{"sentence":"Her sculptures often explore poetico-mythological themes related to nature and transformation.","translation":"彼女の彫刻は、自然と変容に関連する詩的・神話的なテーマを探求することが多い。","type":"general","meaning_category":"general"}]}