{"word":"schizophytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"分裂植物の、分裂植物性の","english_definition":"Relating to or characteristic of schizophytes (bacteria and cyanobacteria).","examples":[{"sentence":"Schizophytic organisms are typically unicellular and reproduce by binary fission.","translation":"分裂植物性の生物は通常単細胞で、二分裂によって繁殖する。"}],"collocations":[],"synonyms":["bacterial","cyanobacterial"],"antonyms":[]}],"etymology":{"value":"From 'schizo-' (splitting) + '-phyte' (plant), reflecting the historical classification of bacteria and cyanobacteria as plants that reproduce by fission.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskɪtsəˈfɪtɪk/","syllables":"skit-so-phyt-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'schizophytic' is largely historical and less commonly used in modern biological classification. Bacteria and cyanobacteria are now classified in different kingdoms (Bacteria and Archaea for bacteria, and as a phylum within Bacteria for cyanobacteria). However, the term may still be encountered in older texts or in contexts discussing the historical classification of these organisms.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["schizophyte (noun)"],"related_scientific_terms":["bacteria","cyanobacteria","prokaryote","binary fission"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in scientific or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Schizophytic' is a technical term primarily encountered in scientific or historical contexts related to the classification of bacteria and cyanobacteria. Understanding requires familiarity with biological taxonomy and the history of microbiology."},"example_sentences":[{"sentence":"The schizophytic nature of these organisms was a key characteristic in their early classification.","translation":"これらの生物の分裂植物的な性質は、初期の分類における重要な特徴であった。","type":"adjective","meaning_category":"分裂植物の"}]}