{"word":"Ahamkara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド哲学)自我、エゴ、自己意識。個々の魂が世界や他の魂から分離しているという感覚。","english_definition":"(Indian philosophy) The ego; the sense of 'I-ness' or individuality; the identification of the self with the body, mind, and senses, leading to a sense of separation from the true Self (Atman) and the universal consciousness (Brahman).","examples":[{"sentence":"Overcoming ahamkara is essential for spiritual liberation.","translation":"自我を克服することは、精神的な解放に不可欠です。"},{"sentence":"Ahamkara is the root cause of suffering and attachment.","translation":"自我は苦しみと執着の根本原因です。"},{"sentence":"Through self-inquiry, one can gradually dissolve ahamkara.","translation":"自己探求を通して、人は徐々に自我を解消することができます。"}],"collocations":["destroy ahamkara (自我を破壊する)","transcend ahamkara (自我を超越する)","dissolve ahamkara (自我を解消する)","overcome ahamkara (自我を克服する)","ahamkara vritti (自我の働き)"],"synonyms":["ego","self-conceit","vanity","pride","I-consciousness"],"antonyms":["Atman (真我)","Brahman (宇宙の根本原理)","Self (自己)"],"notes":["Ahamkara is a key concept in various schools of Indian philosophy, including Samkhya, Yoga, and Vedanta. It is considered an obstacle to spiritual realization."]}],"etymology":{"value":"Sanskrit: अहङ्कार (ahaṅkāra) - From aham (अहम्) meaning 'I' and kara (कार) meaning 'maker, doer, form'. Thus, 'the I-maker' or 'the form of I'.","priority":"★★★"},"pronunciation":{"ipa":"/ɑːhʌŋˈkɑːrə/","syllables":"A-ham-ka-ra"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"Ahamkara is not simply 'ego' in the Western psychological sense. It represents a deeper, more fundamental misidentification of the self. It is the illusion that the individual self is separate and distinct from the ultimate reality. Overcoming ahamkara involves realizing the true nature of the Self as being one with Brahman.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ahamkara is always a positive trait.","correct":"✓ Ahamkara is generally considered a negative trait in spiritual contexts.","note":"Ahamkara is generally seen as an obstacle to spiritual growth, not a positive attribute."},{"incorrect":"✗ Ahamkara is the same as self-esteem.","correct":"✓ Ahamkara is different from self-esteem. Self-esteem is a positive sense of self-worth, while ahamkara is the identification with the ego, which is seen as an illusion.","note":"Self-esteem and ahamkara are distinct concepts. Self-esteem is a healthy sense of self-worth, while ahamkara is the ego-based sense of self that creates separation."}],"priority":"★★☆"},"related_words":{"derivatives":["Aham (अहम्) - I","kara (कार) - maker, doer"],"related_concepts":["Atman (真我)","Brahman (宇宙の根本原理)","Maya (マーヤー、幻影)","Moksha (モクシャ、解脱)","Samkhya (数論派)","Yoga (ヨガ)","Vedanta (ヴェーダーンタ)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 主にインド哲学や精神世界に関する文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Ahamkara**」は、インド哲学における重要な概念であり、特にサーンキヤ学派、ヨーガ学派、ヴェーダーンタ学派で扱われます。これは、個人が自分自身を肉体、精神、感覚と同一視し、真の自己（アートマン）や普遍的な意識（ブラフマン）から分離していると感じる、自我または「私」という感覚を指します。アハンカーラを克服することは、精神的な解放に不可欠であると考えられています。この単語は、哲学や宗教の文脈でのみ使用されるため、一般的な語彙ではありません。"},"example_sentences":[{"sentence":"The guru emphasized the importance of reducing **ahamkara** to achieve inner peace.","translation":"その導師は、心の平安を達成するために自我を減らすことの重要性を強調しました。","type":"noun","meaning_category":"自我"},{"sentence":"Through meditation, he sought to transcend **ahamkara** and connect with the divine.","translation":"瞑想を通して、彼は自我を超越し、神とつながることを目指しました。","type":"noun","meaning_category":"自我"},{"sentence":"**Ahamkara** is often seen as the primary obstacle to self-realization.","translation":"自我はしばしば自己実現への主要な障害と見なされます。","type":"noun","meaning_category":"自我"}]}