{"word":"unrare","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ありふれた、珍しくない","english_definition":"Not rare; common; frequent.","examples":[{"sentence":"This species, once thought to be endangered, is now unrare in this region.","translation":"かつて絶滅危惧種と考えられていたこの種は、現在この地域ではありふれた存在となっている。"},{"sentence":"With the advent of technology, such occurrences are becoming unrare.","translation":"テクノロジーの出現により、そのような出来事は珍しくなくなってきている。"}],"collocations":["become unrare","relatively unrare","increasingly unrare"],"synonyms":["common","frequent","ordinary","usual","prevalent"],"antonyms":["rare","uncommon","scarce","infrequent"]}],"etymology":{"value":"\"Un-\" (not) + \"rare.\" Formed by adding the prefix \"un-\" to the adjective \"rare\" to negate its meaning.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈrɛər/","syllables":"un-rare"},"inflection":{"adjective_forms":{"comparative":"more unrare","superlative":"most unrare"}},"usage_notes":{"explanation":"\"Unrare\" is a straightforward negation of \"rare,\" meaning something is no longer uncommon or infrequent. It's less frequently used than \"common\" or \"frequent,\" but it serves to directly contrast with the idea of something being rare. Its usage often implies a shift from a state of rarity to one of commonness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unrare jewel was found in the mine.","correct":"✓ The common jewel was found in the mine.","note":"In most contexts, \"common\" is a more natural and widely accepted word than \"unrare.\" Use \"unrare\" when specifically emphasizing the shift from a state of rarity."},{"incorrect":"✗ The unrare occurrence surprised everyone.","correct":"✓ The frequent occurrence surprised everyone.","note":"\"Frequent\" is often a better choice when describing the occurrence of events."}],"priority":"★★☆"},"related_words":{"derivatives":["rareness (rarity)","rarely"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unrare' is formed by adding the prefix 'un-' to 'rare,' indicating something that is not rare or uncommon. While grammatically correct, it's less frequently used than alternatives like 'common' or 'frequent.' Its use is best reserved for contexts where emphasizing the shift from a state of rarity is desired. It is more often found in technical or descriptive writing where precision is important, but it is not part of everyday vocabulary."},"example_sentences":[{"sentence":"What was once a rare sight has now become unrare due to conservation efforts.","translation":"かつて珍しい光景だったものが、保全活動のおかげで今ではありふれたものになった。","type":"adjective","meaning_category":"ありふれた"},{"sentence":"The disease, previously unrare, is now affecting a large portion of the population.","translation":"以前は珍しくなかったその病気が、今では人口の大部分に影響を与えている。","type":"adjective","meaning_category":"ありふれた"}]}