{"word":"transfusion-compatible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"輸血適合性の、輸血可能な","english_definition":"Suitable for transfusion; having blood types that can be safely mixed during a blood transfusion.","examples":[{"sentence":"The patient needs transfusion-compatible blood immediately.","translation":"患者はすぐに輸血適合性の血液を必要としています。"},{"sentence":"We are testing the donor's blood to ensure it is transfusion-compatible with the recipient.","translation":"ドナーの血液がレシピエントと輸血適合性があることを確認するために検査しています。"}],"collocations":["transfusion-compatible blood","transfusion-compatible donor","transfusion-compatible recipient"],"synonyms":["blood-type matched","crossmatch compatible"],"antonyms":["transfusion-incompatible"],"notes":["Typically refers to blood types (ABO and Rh factors) that will not cause a dangerous immune reaction in the recipient."]}],"etymology":{"value":"Derived from 'transfusion' (the process of transferring blood or blood products into a person's circulation intravenously) and 'compatible' (able to exist or occur together without conflict).","priority":"★★☆"},"pronunciation":{"ipa":"/trænsˈfjuːʒən kəmˈpætɪbəl/","syllables":"trans-fu-sion com-pat-i-ble"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Transfusion-compatible' is a technical term used in medicine, specifically in the context of blood transfusions. It indicates that the donor's blood type is such that it will not cause an adverse reaction when transfused into the recipient. This compatibility is primarily determined by the ABO blood group system and the Rh factor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The blood is transfusion compatible.","correct":"✓ The blood is transfusion-compatible.","note":"The hyphen is important to connect the two words and create a single adjective."},{"incorrect":"✗ The patient needs a transfusion compatible blood.","correct":"✓ The patient needs transfusion-compatible blood.","note":"The adjective 'transfusion-compatible' should correctly modify the noun 'blood'."}],"priority":"★★☆"},"related_words":{"derivatives":["transfusion","compatibility","incompatible"],"related_terms":["blood type","crossmatching","ABO blood group system","Rh factor","blood transfusion"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transfusion-compatible' is a specialized term used in medical settings to describe blood that can be safely transfused from a donor to a recipient without causing a harmful immune reaction. This determination is based on matching blood types, including ABO and Rh factors. Understanding this term requires knowledge of basic medical concepts related to blood transfusions and immunology."},"example_sentences":[{"sentence":"The lab confirmed that the donor's blood was transfusion-compatible with the patient's.","translation":"検査室は、ドナーの血液が患者と輸血適合性があることを確認しました。","type":"adjective","meaning_category":"輸血適合性"},{"sentence":"Finding transfusion-compatible blood can be challenging for patients with rare blood types.","translation":"まれな血液型の患者にとって、輸血適合性の血液を見つけるのは難しい場合があります。","type":"adjective","meaning_category":"輸血適合性"}]}