{"word":"Tenzing","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"テンジン・ノルゲイ、ネパール人シェルパであり、エドモンド・ヒラリーと共に1953年に初めてエベレスト登頂に成功した人物","english_definition":"Tenzing Norgay (1914-1986), a Nepali-Indian Sherpa mountaineer who was one of the first two individuals known to reach the summit of Mount Everest, which he accomplished with Edmund Hillary in 1953.","examples":[{"sentence":"Tenzing Norgay and Edmund Hillary are celebrated for their historic ascent of Mount Everest.","translation":"テンジン・ノルゲイとエドモンド・ヒラリーは、エベレストの歴史的な登頂で称えられています。"},{"sentence":"Tenzing's experience as a Sherpa was crucial to the success of the expedition.","translation":"シェルパとしてのテンジンの経験は、遠征の成功に不可欠でした。"}],"collocations":["Mount Everest ascent","Sherpa guide","historic expedition"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Tenzing Norgay's name combines 'Tenzing', meaning 'wealthy fortunate follower of religion', and 'Norgay', meaning 'fortunate'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtɛnzɪŋ","syllables":"Ten-zing"},"inflection":{},"usage_notes":{"explanation":"'Tenzing' refers specifically to Tenzing Norgay, a famous Sherpa mountaineer. It's generally used in historical or biographical contexts related to mountaineering and the first successful ascent of Mount Everest.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Sherpa","mountaineer","Everest"],"idioms_phrases":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"'Tenzing' is a proper noun, specifically the name of a person. Understanding its significance requires knowledge of the history of mountaineering, particularly the first successful ascent of Mount Everest."},"example_sentences":[{"sentence":"The Tenzing Norgay National Adventure Award is given in India to recognize outstanding achievement in adventure sports.","translation":"テンジン・ノルゲイ国家冒険賞は、インドで冒険スポーツにおける傑出した功績を称えるために授与されます。","type":"proper noun","meaning_category":"person"},{"sentence":"Many books and documentaries have been made about Tenzing's life and accomplishments.","translation":"テンジンの生涯と業績について、多くの書籍やドキュメンタリーが制作されています。","type":"proper noun","meaning_category":"person"}]}