{"word":"bibliognostic","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"本の知識に通じた人、書物に関する深い知識を持つ人","english_definition":"A person having extensive knowledge of books; a book expert.","examples":[{"sentence":"The bibliognostic could identify the rare first edition simply by feeling the paper.","translation":"その書物に精通した人は、紙の感触だけで希少な初版を特定できた。"},{"sentence":"He was a true bibliognostic, able to discuss the history and significance of any book in the library.","translation":"彼は真の書物に通じた人で、図書館にあるどんな本についても歴史と意義を語ることができた。"}],"collocations":["rare book bibliognostic","library bibliognostic"],"synonyms":["bibliophile","bookworm","book expert","book lover","scholar"],"antonyms":["bibliophobe","illiterate"],"notes":"Often used to describe someone with a deep, scholarly understanding of books, not just a love for reading."}],"etymology":{"value":"From 'biblio-' (relating to books) + 'gnostic' (relating to knowledge or knowing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪbli.ɒɡˈnɒstɪk/","syllables":"bib-li-og-nos-tic"},"inflection":{"noun_plural":"bibliognostics"},"usage_notes":{"explanation":"'Bibliognostic' is a relatively uncommon word. It suggests a profound and comprehensive knowledge of books, often including their history, printing, and cultural significance. It's more than just being a 'bibliophile' (book lover); it implies expertise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bibliognostic because he reads a lot of books.","correct":"✓ He is a bibliognostic because he knows a lot about the history and printing of books.","note":"Reading a lot of books doesn't automatically make someone a bibliognostic. The term implies deeper knowledge."}],"priority":"★☆☆"},"related_words":{"derivatives":["bibliognosis (noun: knowledge of books)","bibliognost (noun: a person with knowledge of books - less common than bibliognostic)"],"related_terms":["bibliography","bibliology","bibliomania","bibliophile"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'bibliognostic' is a rare and sophisticated term. It is used to describe someone who possesses a deep and extensive knowledge of books, often going beyond simply reading them to include understanding their history, printing techniques, and cultural significance. This word is more likely to be encountered in academic or literary contexts."},"example_sentences":[{"sentence":"The professor, a renowned bibliognostic, lectured on the evolution of the printed word.","translation":"その教授は、著名な書物に通じた人で、印刷された言葉の進化について講義した。","type":"general","meaning_category":"general"},{"sentence":"Only a true bibliognostic could appreciate the subtle differences between the various editions of Shakespeare's plays.","translation":"真に書物に通じた人だけが、シェイクスピアの戯曲の様々な版の微妙な違いを理解できるだろう。","type":"general","meaning_category":"general"}]}