{"word":"trichinosed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"旋毛虫症にかかった、旋毛虫に汚染された","english_definition":"infected with or relating to trichinosis.","examples":[{"sentence":"The trichinosed pork was recalled from the market.","translation":"旋毛虫症にかかった豚肉は市場から回収された。"},{"sentence":"Eating undercooked meat can lead to becoming trichinosed.","translation":"加熱不十分な肉を食べると旋毛虫症になる可能性がある。"}],"collocations":["trichinosed meat","trichinosed pork"],"synonyms":["infected with trichinosis","trichinous"],"antonyms":["uninfected","trichinosis-free"]}],"etymology":{"value":"from trichinosis + -ed","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrɪkɪnoʊzd/","syllables":"tri-chi-nosed"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb."},"usage_notes":{"explanation":"'Trichinosed' is primarily used to describe meat, especially pork, that is infected with the Trichinella parasite, which causes trichinosis in humans if consumed undercooked. It can also be used to describe an animal or person suffering from trichinosis, though this is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt trichinosed after eating the bad sushi.","correct":"✓ He felt sick after eating the bad sushi.","note":"Trichinosis is specifically caused by the Trichinella parasite found in meat, not fish. If someone feels sick after eating sushi, it's more likely due to other foodborne illnesses. Use 'sick' or 'ill' in such cases."}],"priority":"★★☆"},"related_words":{"derivatives":["trichinosis (noun: 旋毛虫症)","trichinous (adjective: 旋毛虫の、旋毛虫症の)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"The word 'trichinosed' is a highly specialized term primarily used in the context of food safety and parasitology. Understanding requires familiarity with the disease trichinosis and its causative agent, Trichinella. Due to its limited application, it is not commonly encountered outside of specific scientific or medical discussions."},"example_sentences":[{"sentence":"The hunter discovered that the bear meat was trichinosed and therefore unsafe to eat.","translation":"猟師はクマの肉が旋毛虫症にかかっており、食べるには安全でないことを発見した。","type":"adjective","meaning_category":"infected"},{"sentence":"The government issued a warning about trichinosed pork products.","translation":"政府は旋毛虫症にかかった豚肉製品について警告を発令した。","type":"adjective","meaning_category":"contaminated"}]}