{"word":"Marxism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マルクス主義","english_definition":"The political and economic theories of Karl Marx and Friedrich Engels, in which class struggle is a central element in the analysis of social change in Western societies.","examples":[{"sentence":"Marxism is a social, political, and economic theory originated by Karl Marx.","translation":"マルクス主義は、カール・マルクスによって提唱された社会、政治、経済理論です。"},{"sentence":"The rise of Marxism in the 20th century had a profound impact on global politics.","translation":"20世紀におけるマルクス主義の台頭は、世界政治に深い影響を与えました。"}],"collocations":["classical Marxism","Western Marxism","Marxism-Leninism","apply Marxism","study Marxism","criticize Marxism"],"synonyms":["communism","socialism","historical materialism","dialectical materialism"],"antonyms":["capitalism","liberalism","conservatism"]}],"etymology":{"value":"Named after Karl Marx (1818-1883), German philosopher, economist, and revolutionary socialist.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɑːrksɪzəm/","syllables":"Marx-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Marxism is a complex set of theories that analyze the role of class struggle in historical development and advocate for a classless society. It encompasses various schools of thought and interpretations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a marxism.","correct":"✓ He is a Marxist.","note":"'Marxism' is the theory, 'Marxist' is a person who adheres to Marxism."}],"priority":"★★☆"},"related_words":{"derivatives":["Marxist (noun, adjective)","Marxian (adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively frequent in academic and political contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Marxism is a complex socio-political and economic theory developed by Karl Marx and Friedrich Engels. It analyzes history through the lens of class struggle, arguing that societal development is driven by conflicts between different social classes, particularly the bourgeoisie (capitalist class) and the proletariat (working class). Marxism advocates for a classless, communist society where the means of production are collectively owned. Understanding Marxism requires familiarity with concepts such as historical materialism, dialectical materialism, surplus value, and the critique of capitalism. It's a term frequently encountered in political science, sociology, and history, often in discussions about ideology, revolution, and social justice."},"example_sentences":[{"sentence":"The professor lectured on the key tenets of Marxism.","translation":"教授はマルクス主義の主要な教義について講義した。","type":"general"},{"sentence":"Some scholars argue that contemporary social movements are influenced by Marxism.","translation":"一部の学者は、現代の社会運動がマルクス主義の影響を受けていると主張している。","type":"academic"},{"sentence":"The government's policies were criticized for being rooted in Marxism.","translation":"政府の政策は、マルクス主義に根ざしているとして批判された。","type":"political"}]}