{"word":"recall-boosting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"想起を促進する、記憶の想起を向上させる","english_definition":"Enhancing or improving the ability to remember or retrieve information from memory.","examples":[{"sentence":"This technique is recall-boosting, helping students remember key concepts.","translation":"このテクニックは想起を促進し、学生が重要な概念を覚えるのを助けます。"},{"sentence":"Using flashcards is a recall-boosting strategy for learning new vocabulary.","translation":"フラッシュカードを使うことは、新しい語彙を学ぶための想起を促進する戦略です。"}],"collocations":["recall-boosting technique","recall-boosting strategy","recall-boosting method","recall-boosting effect"],"synonyms":["memory-enhancing","retention-improving","memory-boosting"],"antonyms":["memory-impairing","recall-reducing"]}],"etymology":{"value":"The term is formed by combining 'recall' (the act of remembering something) with 'boosting' (enhancing or increasing).","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈkɔːl ˌbuːstɪŋ/","syllables":"re-call boost-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Recall-boosting' is often used in the context of educational techniques, memory improvement methods, or cognitive strategies designed to help individuals better remember information. It emphasizes the active process of retrieving information from memory, rather than simply storing it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The recall-boosted method.","correct":"✓ The recall-boosting method.","note":"Ensure the correct form of the adjective is used. 'Recall-boosted' might imply something that has already been boosted, while 'recall-boosting' describes something that actively boosts recall."}],"priority":"★★☆"},"related_words":{"derivatives":["recall (noun, verb)","boost (noun, verb)","boosting (gerund)"],"phrasal_verbs":[],"related_concepts":["memory","retrieval","cognitive enhancement","mnemonic devices"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recall-boosting' is a specialized term used to describe methods or techniques that improve one's ability to remember information. It is often found in academic or technical contexts related to education, psychology, or cognitive science. Understanding this term requires a familiarity with the concept of memory recall and the idea of enhancing cognitive functions."},"example_sentences":[{"sentence":"Spaced repetition is a highly effective recall-boosting learning technique.","translation":"間隔反復は、非常に効果的な想起を促進する学習テクニックです。","type":"adjective","meaning_category":"memory improvement"},{"sentence":"The software includes recall-boosting exercises to help users memorize new information.","translation":"そのソフトウェアには、ユーザーが新しい情報を記憶するのを助けるための想起を促進するエクササイズが含まれています。","type":"adjective","meaning_category":"cognitive enhancement"}]}