{"word":"reinstil","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(再び)徐々に教え込む、染み込ませる、吹き込む","english_definition":"to put back gradually into someone's mind (an idea, feeling, etc.)","examples":[{"sentence":"The coach tried to reinstil confidence in the team after their defeat.","translation":"コーチは敗北後、チームに自信を再び植え付けようとした。"},{"sentence":"The school aims to reinstil a sense of community in its students.","translation":"その学校は生徒たちに共同体意識を再び植え付けることを目指している。"},{"sentence":"We need to reinstil traditional values in society.","translation":"私たちは社会に伝統的な価値観を再び吹き込む必要がある。"}],"collocations":["reinstil confidence (自信を再び植え付ける)","reinstil values (価値観を再び吹き込む)","reinstil a sense of (～の感覚を再び植え付ける)"],"synonyms":["restore","revive","reintroduce","re-establish","rekindle"],"antonyms":["remove","eliminate","eradicate"]}],"etymology":{"value":"\"re-\" (再び) + \"instil\" (徐々に教え込む)","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːɪnˈstɪl/","syllables":"re-in-stil"},"inflection":{"verb_forms":{"present_simple":["reinstil","reinstils"],"past_simple":"reinstilled","past_participle":"reinstilled","present_participle":"reinstilling"}},"usage_notes":{"explanation":"\"Reinstil\" is used when something (like a belief, value, or feeling) was once present but has diminished or disappeared, and there's an effort to bring it back. It implies a gradual process of re-introducing or reinforcing something that already existed before. It is often used in contexts related to education, society, or personal development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are trying to install confidence in the players.","correct":"✓ They are trying to reinstil confidence in the players.","note":"\"Install\" means to put something in for the first time. \"Reinstil\" means to put something back in that was there before. Use \"reinstil\" when referring to restoring something that was previously present."}],"priority":"★★☆"},"related_words":{"derivatives":["instil (動詞: 徐々に教え込む、染み込ませる)","instillation (名詞: 徐々に教え込むこと、点滴)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reinstil\" means to gradually put something back into someone's mind or feelings, especially something that used to be there but has faded. It's like replanting a seed that had already sprouted before. This word is often used when talking about bringing back values, beliefs, or confidence that have been lost or weakened. It suggests a deliberate and gentle process of re-introducing something important.","priority":"★★☆"},"example_sentences":[{"sentence":"The new manager aimed to reinstil a sense of discipline within the team.","translation":"新しいマネージャーはチーム内に規律を取り戻すことを目指した。","type":"verb","meaning_category":"教え込む"},{"sentence":"After the scandal, the company worked hard to reinstil trust among its customers.","translation":"スキャンダルの後、会社は顧客の信頼を取り戻すために懸命に努力した。","type":"verb","meaning_category":"染み込ませる"},{"sentence":"The program is designed to reinstil hope in young people who have lost their way.","translation":"そのプログラムは、道に迷った若者に希望を再び植え付けるように設計されている。","type":"verb","meaning_category":"吹き込む"}]}