{"word":"Goethean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ゲーテの、ゲーテ的な","english_definition":"Relating to or characteristic of Johann Wolfgang von Goethe, or his works and ideas.","examples":[{"sentence":"Goethean science emphasizes direct observation and experience.","translation":"ゲーテ的な科学は、直接的な観察と経験を重視する。"},{"sentence":"The Goethean approach to literature focuses on the organic unity of the work.","translation":"文学へのゲーテ的なアプローチは、作品の有機的な統一性に焦点を当てる。"}],"collocations":["Goethean science","Goethean approach","Goethean worldview"],"synonyms":["Goethian"],"antonyms":[]},{"part_of_speech":"noun","definition":"ゲーテ主義者、ゲーテの研究者","english_definition":"A follower or admirer of Johann Wolfgang von Goethe, or a student of his works and ideas.","examples":[{"sentence":"Goetheans often gather to discuss his philosophical and scientific ideas.","translation":"ゲーテ主義者は、彼の哲学的および科学的なアイデアについて議論するために集まることが多い。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of Johann Wolfgang von Goethe (1749-1832), the German writer and polymath, with the suffix '-an' indicating affiliation or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡøːˈteɪən/","syllables":"Goethe-an"},"inflection":{"notes":"Adjective: comparative and superlative forms are possible (more Goethean, most Goethean), but less common. Noun: plural form is Goetheans."},"usage_notes":{"explanation":"'Goethean' is used to describe something related to Goethe's philosophy, literature, or scientific approach. It often implies a holistic and experiential perspective, particularly in science and art. The term is relatively uncommon outside academic or specialized contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Goethian writer, like Shakespeare.","correct":"✓ He is a writer influenced by Goethe, like Shakespeare.","note":"'Goethean' directly implies a connection to Goethe's ideas. If the writer is simply similar to Goethe, it's better to say 'influenced by Goethe'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Goethe (proper noun: Johann Wolfgang von Goethe)","Goethianism (noun: the philosophical or artistic principles associated with Goethe)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Goethean' refers to something related to the German polymath Johann Wolfgang von Goethe. It is most often used in academic or intellectual contexts to describe ideas, approaches, or works that are influenced by or characteristic of Goethe's philosophy, literature, or scientific theories. Understanding the word requires familiarity with Goethe's work and thought.","priority":"★★☆"},"example_sentences":[{"sentence":"The school's curriculum includes a strong emphasis on Goethean studies.","translation":"その学校のカリキュラムには、ゲーテ研究に重点が置かれている。","type":"adjective","meaning_category":"Relating to Goethe"},{"sentence":"As a Goethean, she believed in the importance of personal experience in understanding the world.","translation":"ゲーテ主義者として、彼女は世界を理解する上で個人的な経験の重要性を信じていた。","type":"noun","meaning_category":"Follower of Goethe"}]}