{"word":"Fistulariidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘラヤガラ科","english_definition":"The family of cornetfishes and flutemouths.","examples":[{"sentence":"The Fistulariidae are a family of marine fishes.","translation":"ヘラヤガラ科は、海洋魚の科の一つです。"}],"collocations":[],"synonyms":["cornetfishes","flutemouths"],"antonyms":[]}],"etymology":{"value":"From the genus name Fistularia, which comes from the Latin word 'fistula' meaning 'pipe' or 'tube', referring to the elongated snout of these fishes. The suffix '-idae' is used to denote a zoological family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪstjʊləˈraɪɪdiː/","syllables":"Fis-tu-la-ri-i-dae"},"inflection":{"notes":"Plural form is Fistulariidae (already plural as it's a family name)."},"usage_notes":{"explanation":"Fistulariidae is a taxonomic family name used in zoology, specifically for the cornetfishes and flutemouths. It is primarily used in scientific contexts, such as marine biology, ichthyology, and taxonomy.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Fistularia (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific context)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Fistulariidae' is a scientific term used in the classification of marine fishes. It refers specifically to the family of cornetfishes and flutemouths. Due to its specialized nature, it is primarily encountered in academic or scientific literature related to marine biology or ichthyology."},"example_sentences":[{"sentence":"Members of the Fistulariidae family are characterized by their elongated bodies and tube-like snouts.","translation":"ヘラヤガラ科の魚は、細長い体と管状の口先を特徴とします。","type":"noun","meaning_category":"description"},{"sentence":"Research on the Fistulariidae is crucial for understanding the biodiversity of coral reef ecosystems.","translation":"ヘラヤガラ科の研究は、サンゴ礁生態系の生物多様性を理解するために重要です。","type":"noun","meaning_category":"research"}]}