{"word":"Pasternak","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"パステルナーク：ロシアの詩人、小説家。代表作は『ドクトル・ジバゴ』。","english_definition":"Boris Pasternak (1890-1960), a Russian poet, novelist, and literary translator. He is best known for his novel 'Doctor Zhivago'.","examples":[{"sentence":"Pasternak won the Nobel Prize in Literature in 1958, but was forced to decline it by the Soviet government.","translation":"パステルナークは1958年にノーベル文学賞を受賞したが、ソビエト政府によって辞退を余儀なくされた。"},{"sentence":"'Doctor Zhivago' by Pasternak is a sweeping epic set during the Russian Revolution.","translation":"パステルナークの『ドクトル・ジバゴ』は、ロシア革命を舞台にした壮大な叙事詩である。"}],"collocations":["Boris Pasternak","Doctor Zhivago","Nobel Prize in Literature","Russian literature","Soviet Union"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Pasternak is of Ukrainian origin. It is derived from the word 'pasternak', meaning parsnip, a root vegetable.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæstərnæk/","syllables":"Pas-ter-nak"},"inflection":{},"usage_notes":{"explanation":"'Pasternak' is primarily used as a surname. When referring to Boris Pasternak, it is often used in the context of Russian literature, the novel 'Doctor Zhivago', or the Nobel Prize in Literature.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Pasternakian (adjective: relating to or characteristic of Boris Pasternak or his works)"],"related_names":["Boris Pasternak","Olga Ivinskaya (Pasternak's muse and lover)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. The name is not commonly used outside of literary or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pasternak' is a proper noun, specifically a surname, referring primarily to Boris Pasternak, a significant figure in Russian literature. Understanding its usage requires familiarity with Russian literature and history, particularly the context of the Soviet Union and the Nobel Prize. The word is not commonly encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The novel 'Doctor Zhivago' brought Pasternak international fame, but also caused controversy in the Soviet Union.","translation":"小説『ドクトル・ジバゴ』はパステルナークに国際的な名声をもたらしたが、ソビエト連邦では論争を引き起こした。","type":"noun","meaning_category":"person"},{"sentence":"Pasternak's poetry is known for its lyrical beauty and philosophical depth.","translation":"パステルナークの詩は、その叙情的な美しさと哲学的な深さで知られている。","type":"noun","meaning_category":"person"},{"sentence":"The Pasternak family has Ukrainian roots.","translation":"パステルナーク家はウクライナにルーツを持つ。","type":"noun","meaning_category":"surname"}]}