{"word":"invigilancy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"試験監督（業務）、監視","english_definition":"The act of invigilating; supervision, especially during an examination.","examples":[{"sentence":"The invigilancy during the exam was very strict.","translation":"試験中の監督は非常に厳しかった。"},{"sentence":"She was responsible for invigilancy in the main hall.","translation":"彼女はメインホールでの試験監督を担当していた。"}],"collocations":["exam invigilancy","strict invigilancy","invigilancy duties","invigilancy responsibilities"],"synonyms":["supervision","monitoring","surveillance","observation"],"antonyms":["neglect","abandonment"]}],"etymology":{"value":"Derived from 'invigilate', which comes from Latin 'invigilare' meaning 'to watch over'.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈvɪdʒɪlənsi/","syllables":"in-vig-i-lan-cy"},"inflection":{"noun_plural":"invigilancies"},"usage_notes":{"explanation":"'Invigilancy' refers specifically to the act of supervising or monitoring, particularly in the context of examinations. It emphasizes the role of ensuring fair and proper conduct during a formal assessment. It is less commonly used than 'invigilation', but carries a similar meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The invigilancy was responsible for marking the papers.","correct":"✓ The invigilators were responsible for marking the papers.","note":"'Invigilancy' is the act of supervising, not the person doing it. Use 'invigilator' for the person."},{"incorrect":"✗ He showed invigilancy towards his younger brother.","correct":"✓ He showed vigilance towards his younger brother.","note":"'Invigilancy' is specific to exams. Use 'vigilance' for general watchfulness."}],"priority":"★★☆"},"related_words":{"derivatives":["invigilate (verb): to supervise during an examination","invigilator (noun): a person who supervises candidates during an examination","invigilation (noun): the act of supervising during an examination"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Invigilancy' is a formal term primarily used in educational settings to describe the act of supervising students during an examination. It is less common than 'invigilation' but conveys the same meaning of ensuring proper conduct and preventing cheating. The word is derived from 'invigilate,' which means to supervise an exam. Understanding this word is useful in academic contexts or when discussing examination procedures."},"example_sentences":[{"sentence":"Effective invigilancy is crucial for maintaining the integrity of the examination process.","translation":"効果的な試験監督は、試験プロセスの完全性を維持するために不可欠です。","type":"noun","meaning_category":"試験監督（業務）"},{"sentence":"The university has strict guidelines for invigilancy during final exams.","translation":"大学には期末試験中の試験監督に関する厳格なガイドラインがあります。","type":"noun","meaning_category":"試験監督（業務）"}]}