{"word":"exultantly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"歓喜して、大喜びで、得意げに","english_definition":"in a joyful and triumphant manner; with great happiness and excitement.","examples":[{"sentence":"The team cheered exultantly after winning the championship.","translation":"チームは選手権で優勝した後、歓喜して応援した。"},{"sentence":"She announced the news exultantly, her face beaming with pride.","translation":"彼女は得意げにニュースを発表し、顔は誇らしげに輝いていた。"},{"sentence":"He raised his arms exultantly in victory.","translation":"彼は勝利に歓喜して腕を上げた。"}],"collocations":["cheer exultantly","announce exultantly","raise arms exultantly","speak exultantly","celebrate exultantly"],"synonyms":["joyfully","triumphantly","ecstatically","gleefully","jubilantly","delightedly","rapturously"],"antonyms":["sadly","mournfully","dejectedly","disappointedly"]}],"etymology":{"value":"Derived from the verb 'exult,' which comes from the Latin 'exsultare,' meaning 'to leap for joy.' The suffix '-antly' transforms the verb into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzʌltəntli/","syllables":"ex-ul-tant-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Exultantly' describes an action performed with great joy, often because of a victory or success. It suggests a feeling of triumph and intense happiness. It is a relatively formal word and is not as commonly used as its synonyms like 'joyfully' or 'triumphantly.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt exultantly.","correct":"✓ She felt exultant.","note":"'Exultantly' is an adverb and modifies verbs, adverbs, or adjectives. 'Exultant' is an adjective and describes nouns or pronouns. Use 'exultant' to describe how someone feels, and 'exultantly' to describe how someone acts."},{"incorrect":"✗ He exultantly the prize.","correct":"✓ He accepted the prize exultantly.","note":"'Exultantly' is an adverb and needs a verb to modify. It cannot directly follow a verb and act as a direct object. Add a verb like 'accepted,' 'celebrated,' or 'received' to make the sentence grammatically correct."}],"priority":"★☆☆"},"related_words":{"derivatives":["exult (verb): to show or feel elation or jubilation, especially as the result of a success.","exultant (adjective): triumphantly happy.","exultation (noun): the feeling of triumphant elation or jubilation; rejoicing."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'exultantly' is an advanced adverb that describes doing something in a very joyful and triumphant way. It's not commonly used in everyday conversation but appears in more formal writing or when describing intense emotions related to success or victory. Understanding the root word 'exult' (to rejoice greatly) helps to grasp its meaning. It's more nuanced than simply saying 'happily' or 'joyfully,' as it carries a stronger sense of triumph and elation."},"example_sentences":[{"sentence":"The crowd roared exultantly as the winning goal was scored.","translation":"決勝ゴールが決まると、観衆は歓喜して叫んだ。","type":"adverb","meaning_category":"歓喜して"},{"sentence":"Having completed the marathon, she smiled exultantly at the finish line.","translation":"マラソンを完走した彼女は、ゴールラインで得意げに微笑んだ。","type":"adverb","meaning_category":"得意げに"},{"sentence":"The scientist announced his groundbreaking discovery exultantly to the world.","translation":"科学者は画期的な発見を世界に向けて歓喜して発表した。","type":"adverb","meaning_category":"歓喜して"}]}