{"word":"urbanistically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"都市計画的に、都市的に","english_definition":"In a manner relating to urban planning or the characteristics of a city.","examples":[{"sentence":"The area was developed urbanistically, with careful consideration of green spaces and public transportation.","translation":"その地域は都市計画的に開発され、緑地や公共交通機関が慎重に考慮された。"},{"sentence":"Urbanistically speaking, the city lacks a central pedestrian zone.","translation":"都市計画的に言えば、その都市には中心となる歩行者専用区域がない。"}],"collocations":["develop urbanistically","plan urbanistically","design urbanistically","analyze urbanistically"],"synonyms":["city-planning-wise","in terms of urban design","from an urban perspective"],"antonyms":["rurally","country-style","in a non-urban way"]}],"etymology":{"value":"Derived from 'urbanistic' (relating to urban planning), which comes from 'urban' (relating to a city), ultimately from Latin 'urbanus' (belonging to a city). The suffix '-ally' is added to form the adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɜːrbənˈɪstɪkli/","syllables":"ur-ban-is-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Urbanistically' is used to describe actions or analyses performed with consideration of urban planning principles or the characteristics of urban areas. It often implies a deliberate and structured approach to development or assessment. It is a relatively formal word, most commonly found in academic or professional contexts related to urban studies, architecture, or planning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was urbanistically.","correct":"✓ The building was designed urbanistically.","note":"'Urbanistically' is an adverb and should modify a verb, not a noun. It describes how something was done, not what something is."},{"incorrect":"✗ The city is very urbanistic.","correct":"✓ The city is very urban.","note":"'Urbanistic' is an adjective relating to urban planning, while 'urban' is a more general adjective relating to a city. Use 'urban' to describe the general character of a city."}],"priority":"★★☆"},"related_words":{"derivatives":["urban (adjective: relating to a city)","urbanism (noun: the way of life of city dwellers; the study of urban areas)","urbanist (noun: a city planner or urban scholar)","urbanization (noun: the process of becoming more urban)","suburbanistically (adverb: in a suburban manner)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Urbanistically' is a specialized adverb used in the context of urban planning and design. It implies a deliberate and structured approach to development or assessment of urban areas. The word is relatively formal and is most commonly found in academic or professional contexts related to urban studies or architecture. Understanding the word requires familiarity with the concepts of urban planning and design.","priority":"★★☆"},"example_sentences":[{"sentence":"The new district was planned urbanistically to promote sustainable living.","translation":"新しい地区は、持続可能な生活を促進するために都市計画的に計画された。","type":"general"},{"sentence":"The impact of the highway was analyzed urbanistically to determine its effects on local communities.","translation":"高速道路の影響は、地域社会への影響を判断するために都市計画的に分析された。","type":"general"},{"sentence":"The project aims to integrate green spaces urbanistically within the dense city center.","translation":"このプロジェクトは、緑地を都市計画的に密集した都心部に統合することを目指している。","type":"general"}]}