{"word":"Sumage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Slang, Internet) A combination of 'simp' and 'rage', referring to someone who is excessively subservient or flattering to another person (often a love interest) and then becomes angry or resentful when their affections are not reciprocated.","english_definition":"(Slang, Internet) A portmanteau of 'simp' and 'rage', describing a person who acts overly submissive or complimentary towards someone (typically a romantic interest) and subsequently expresses anger or resentment when their feelings are not returned.","examples":[{"sentence":"He was acting like a total sumage, buying her expensive gifts and then complaining when she didn't text him back.","translation":"彼は完全にサメージのように振る舞い、彼女に高価な贈り物を買って、彼女から返信がないと文句を言っていた。"},{"sentence":"Don't be a sumage; respect yourself and don't let anyone take advantage of you.","translation":"サメージになるな。自分を大切にして、誰にも利用されないようにしろ。"}],"collocations":["act like a sumage","total sumage","avoid being a sumage"],"synonyms":["simp","white knight","nice guy (derogatory)"],"antonyms":["chad","alpha male"]}],"etymology":{"value":"A portmanteau of the slang terms 'simp' (a person who does too much for someone they like) and 'rage' (intense anger).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌmɪdʒ/","syllables":"Su-mage"},"inflection":{"noun_plural":"sumages"},"usage_notes":{"explanation":"'Sumage' is a derogatory slang term primarily used online to criticize individuals who exhibit excessive simping behavior followed by anger or resentment. It implies that the person's initial acts of kindness or flattery were insincere and motivated by a desire for reciprocation rather than genuine affection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sumage because he is always happy.","correct":"✓ He is a sumage because he does everything she asks and then gets mad when she ignores him.","note":"'Sumage' is not simply about being nice or happy; it involves a specific pattern of behavior: excessive simping followed by anger when the affection is not returned."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang)","frequency_google_ngram":"Low frequency (Relatively new slang)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sumage' is a slang term that combines 'simp' and 'rage'. It describes someone who is overly eager to please another person, especially in a romantic context, and then becomes angry or resentful when their efforts are not appreciated. It's a critical term, suggesting that the person's actions are insincere and driven by a desire for something in return."},"example_sentences":[{"sentence":"His sumage tendencies were obvious when he started demanding attention after showering her with gifts.","translation":"彼がプレゼントを浴びせた後、注目を要求し始めたとき、彼のサメージの傾向は明らかだった。","type":"noun","meaning_category":"derogatory slang"},{"sentence":"She called him a sumage because he was always complaining that she didn't appreciate his 'nice guy' act.","translation":"彼女は彼の『いい人』アピールに感謝しないといつも文句を言っていたので、彼をサメージと呼んだ。","type":"noun","meaning_category":"derogatory slang"}]}