{"word":"orchiopexy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"精巣固定術、停留精巣固定術","english_definition":"A surgical procedure to correct cryptorchidism (undescended testicle) by bringing the testicle down into the scrotum and fixing it in place.","examples":[{"sentence":"Orchiopexy is usually performed in infancy or early childhood.","translation":"精巣固定術は通常、乳児期または幼児期に行われます。"},{"sentence":"The orchiopexy was successful, and the testicle is now in the correct position.","translation":"精巣固定術は成功し、精巣は現在正しい位置にあります。"}],"collocations":["perform orchiopexy","undergo orchiopexy","successful orchiopexy","bilateral orchiopexy (両側精巣固定術)"],"synonyms":["testicular fixation","testopexy"],"antonyms":[]}],"etymology":{"value":"The word \"orchiopexy\" comes from the Greek words \"orchis\" (testicle), \"pexis\" (fixation, surgical attachment), and the suffix \"-y\" (denoting a process or procedure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrki.oʊˈpɛksi/","syllables":"or-chi-o-pex-y"},"inflection":{"noun_plural":"orchiopexies"},"usage_notes":{"explanation":"Orchiopexy is the standard surgical treatment for cryptorchidism. The goal of the procedure is to place the undescended testicle into the scrotum, where the temperature is optimal for sperm production. This reduces the risk of infertility and testicular cancer later in life.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ orchiopexy surgery","correct":"✓ orchiopexy","note":"Orchiopexy is already a surgical procedure, so adding \"surgery\" is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["orchidopexy (variant spelling)","cryptorchidism (停留精巣)","orchidectomy (精巣摘除術)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な医学用語)","frequency_google_ngram":"低頻度 (Low frequency) - 医学分野の専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Orchiopexy\" is a medical term referring to a surgical procedure to correct cryptorchidism, where a testicle has not descended properly into the scrotum. The surgery involves bringing the testicle down and fixing it in place. This is typically done in young children to improve fertility and reduce the risk of testicular cancer. The term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The urologist recommended orchiopexy for the child's undescended testicle.","translation":"泌尿器科医は、その子供の停留精巣に対して精巣固定術を推奨しました。","type":"noun","meaning_category":"精巣固定術"},{"sentence":"Post-orchiopexy, regular check-ups are necessary to monitor the testicle's health.","translation":"精巣固定術後、精巣の健康状態を監視するために定期的な検査が必要です。","type":"noun","meaning_category":"精巣固定術"}]}