{"word":"pithed","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(動物の)延髄を破壊する、脳髄を抜き取る","english_definition":"To destroy the spinal cord or brain of (an animal), typically for scientific or experimental purposes.","examples":[{"sentence":"The frog was pithed before the experiment.","translation":"そのカエルは実験の前に延髄を破壊された。"},{"sentence":"Pithing is a method used in some biological studies.","translation":"延髄破壊は、いくつかの生物学的研究で使用される方法である。"}],"collocations":[],"synonyms":["decerebrate","spinalize"],"antonyms":[],"notes":"Pithing is often done to prevent the animal from experiencing pain during an experiment."}],"etymology":{"value":"Derived from the noun 'pith,' referring to the soft, spongy tissue in the stems of plants or the spinal cord. The verb 'pithed' means to remove or destroy this tissue, specifically in the context of animal experimentation.","priority":"★★☆"},"pronunciation":{"ipa":"/pɪθt/","syllables":"pithed"},"inflection":{"verb_forms":{"present_simple":["pithe","pithes"],"past_simple":"pithed","past_participle":"pithed","present_participle":"pithing"}},"usage_notes":{"explanation":"'Pithed' is a technical term primarily used in scientific and veterinary contexts. It refers to a specific procedure performed on animals, particularly amphibians and reptiles, to render them unable to move or feel pain without killing them immediately. The procedure involves inserting a needle or wire into the spinal cord or brain to destroy the central nervous system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant was pithed.","correct":"✓ The plant was cored.","note":"'Pithing' specifically refers to the destruction of the spinal cord or brain of an animal. For plants, the term 'cored' or 'hollowed out' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["pith (noun)","pithing (noun)"],"related_terms":["decerebration","spinal cord","central nervous system"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pithed' is a highly specialized term used in scientific and veterinary contexts. It describes the procedure of destroying the spinal cord or brain of an animal, typically for experimental purposes. Due to its specific and technical nature, it is not commonly encountered in general language use. Understanding this term requires a background in biology or related fields."},"example_sentences":[{"sentence":"The **pithed** frog was used for studying muscle contractions.","translation":"延髄を破壊されたカエルは、筋肉の収縮を研究するために使用された。","type":"verb (past participle)","meaning_category":"延髄を破壊された"},{"sentence":"The researcher **pithed** the newt to prevent it from feeling pain during the procedure.","translation":"研究者は、処置中の痛みを防ぐためにイモリの延髄を破壊した。","type":"verb (past simple)","meaning_category":"延髄を破壊する"}]}