{"word":"orthocephalous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"直頭の、中頭型の：頭蓋骨の前後径と左右径の比が特定の範囲内にあることを指す。人類学において、頭の形を分類する際に用いられる。","english_definition":"Having a cephalic index within a particular range, indicating a head shape that is neither particularly long nor particularly broad; mesocephalic. Used in anthropology to classify head shapes.","examples":[{"sentence":"The population exhibited a mix of dolichocephalous, mesocephalous, and orthocephalous head shapes.","translation":"その集団は、長頭型、中頭型、直頭型の頭の形が混在していた。"},{"sentence":"Anthropologists measured the cephalic indices of the skulls to determine if they were orthocephalous.","translation":"人類学者は、頭蓋骨の頭指数を測定して、それらが直頭型であるかどうかを判断した。"}],"collocations":["cephalic index","head shape","skull measurement"],"synonyms":["mesocephalic","brachycephalic (in contrast)","dolichocephalic (in contrast)"],"antonyms":["dolichocephalous","brachycephalous"]}],"etymology":{"value":"Derived from the Greek words 'orthos' (straight, right) and 'kephalē' (head).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθoʊˈsɛfələs/","syllables":"or-tho-ceph-a-lous"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more orthocephalous, most orthocephalous)."},"usage_notes":{"explanation":"'Orthocephalous' is a technical term primarily used in anthropology and related fields to describe a specific head shape based on the cephalic index. It is less commonly used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orthocephalous person was very intelligent.","correct":"✓ The skull was determined to be orthocephalous based on measurements.","note":"'Orthocephalous' describes a skull shape, not a personality trait or general characteristic of a person. It's a measurement-based classification."}],"priority":"★☆☆"},"related_words":{"derivatives":["orthocephaly (noun): the state of being orthocephalous","cephalic index (noun): the ratio of the maximum width of the head to its maximum length"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Orthocephalous' is a highly specialized term used in anthropology to describe a specific head shape based on the cephalic index. It is not part of everyday vocabulary and would primarily be encountered in academic or scientific contexts related to physical anthropology or craniometry. Understanding requires familiarity with anthropological terminology and measurement techniques."},"example_sentences":[{"sentence":"The skeletal remains were identified as belonging to an orthocephalous individual based on cranial measurements.","translation":"その骨格遺体は、頭蓋骨の測定に基づいて直頭型の人に属するものと特定された。","type":"adjective","meaning_category":"頭の形"},{"sentence":"The study analyzed the distribution of dolichocephalous, mesocephalous, and orthocephalous head shapes within the ancient population.","translation":"その研究では、古代の人々における長頭型、中頭型、直頭型の頭の形の分布を分析した。","type":"adjective","meaning_category":"頭の形"}]}