{"word":"achromatism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無彩色性、無彩色症、アクロマティズム","english_definition":"The state of being achromatic; absence of color; the condition of an achromatic lens or optical system.","examples":[{"sentence":"The artist aimed for achromatism in his black and white photography.","translation":"そのアーティストは、白黒写真で無彩色性を目指した。"},{"sentence":"Achromatism is a desirable property in optical lenses to prevent color fringing.","translation":"アクロマティズムは、色のにじみを防ぐために光学レンズに望ましい特性である。"}],"collocations":["optical achromatism","lens achromatism","degree of achromatism"],"synonyms":["achromaticity","colorlessness","greyscale"],"antonyms":["chromaticity","colorfulness","polychromatism"]},{"part_of_speech":"noun","definition":"(医学)完全色盲、全色盲","english_definition":"(Medicine) A condition of total color blindness; inability to perceive any color other than black, white, and shades of gray.","examples":[{"sentence":"The patient suffered from achromatism, seeing the world in shades of gray.","translation":"その患者はアクロマティズムを患っており、世界を灰色の濃淡で見ていた。"},{"sentence":"Achromatism can be caused by genetic mutations affecting cone cells in the retina.","translation":"アクロマティズムは、網膜の錐体細胞に影響を与える遺伝子変異によって引き起こされることがある。"}],"collocations":["complete achromatism","congenital achromatism","acquired achromatism"],"synonyms":["total color blindness","monochromacy","achromatopsia"],"antonyms":["normal color vision","trichromacy","dichromacy"]}],"etymology":{"value":"From Greek ἀχρωμάτιστος (akhrōmátistos, “colorless”), from ἀ- (a-, “not”) + χρῶμα (khrôma, “color”).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkroʊmətɪzəm/","syllables":"a-chro-ma-tism"},"inflection":{"noun_plural":"achromatisms"},"usage_notes":{"explanation":"'Achromatism' has two primary meanings: one related to optics and the absence of color fringing in lenses, and the other related to a medical condition of total color blindness. The context usually clarifies which meaning is intended. In art and photography, it refers to the use of only black, white, and shades of gray. In medicine, it describes a severe visual impairment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The achromatism of the painting was very vibrant.","correct":"The lack of color in the painting made it appear stark.","note":"'Achromatism' refers to the absence of color, so it cannot be vibrant. Use alternative phrasing to describe the effect of the lack of color."},{"incorrect":"He had achromatism, so he could see all colors perfectly.","correct":"He had achromatism, so he could only see in shades of gray.","note":"Achromatism is a form of color blindness, not perfect color vision."}],"priority":"★★☆"},"related_words":{"derivatives":["achromatic (adjective: without color, corrected for chromatic aberration)","achromate (noun: an achromatic lens)","achromatopsia (noun: total color blindness)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Achromatism' is a technical term primarily used in optics and medicine. In optics, it describes the quality of a lens that corrects for chromatic aberration, preventing color fringing. In medicine, it refers to a rare condition of total color blindness where individuals can only perceive shades of gray. Understanding the context is crucial to interpreting the intended meaning. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The telescope's **achromatism** provided a clear, color-accurate view of the stars.","translation":"その望遠鏡のアクロマティズムは、星の鮮明で色精度の高い像を提供した。","type":"noun","meaning_category":"Optics"},{"sentence":"Due to his **achromatism**, he struggled to distinguish between different fruits at the market.","translation":"彼のアクロマティズムのため、市場でさまざまな果物を区別するのに苦労した。","type":"noun","meaning_category":"Medicine"},{"sentence":"The photographer's use of **achromatism** created a striking, timeless effect in the portrait.","translation":"写真家によるアクロマティズムの使用は、肖像画に印象的で時代を超越した効果を生み出した。","type":"noun","meaning_category":"Artistic Style"}]}