{"word":"shogunate","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"幕府（ばくふ）","english_definition":"the government, rule, or period of rule of a shogun in Japan.","examples":[{"sentence":"The Tokugawa shogunate ruled Japan for over 250 years.","translation":"徳川幕府は250年以上にわたり日本を統治した。"},{"sentence":"The end of the shogunate marked a major turning point in Japanese history.","translation":"幕府の終焉は、日本史における大きな転換点となった。"}],"collocations":["Tokugawa shogunate (徳川幕府)","Kamakura shogunate (鎌倉幕府)","establish a shogunate (幕府を設立する)","the end of the shogunate (幕府の終焉)"],"synonyms":["bakufu (Japanese term)","military government"],"antonyms":["imperial court"],"notes":"The term 'shogunate' refers specifically to the government led by a shogun, a military dictator in Japan. It is often used in historical contexts when discussing the periods of Japanese history when the shoguns held significant power."}],"etymology":{"value":"Derived from the Japanese term 'shōgun' (将軍), a military title, combined with '-ate', a suffix indicating a state, office, or period of rule.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃoʊɡəˌneɪt/","syllables":"sho-gu-nate"},"inflection":{"noun_plural":"shogunates"},"usage_notes":{"explanation":"'Shogunate' is used to describe the period of rule or the system of government under a shogun in Japanese history. It is most commonly associated with the Kamakura, Ashikaga, and Tokugawa shogunates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The emperor was the head of the shogunate.","correct":"✓ The shogun was the head of the shogunate.","note":"The shogun, not the emperor, was the head of the shogunate."},{"incorrect":"✗ Shogunate refers to any form of government in Japan.","correct":"✓ Shogunate refers specifically to the military government led by a shogun.","note":"The term is specific to the military government of the shogun, not any government in Japan."}],"priority":"★★☆"},"related_words":{"derivatives":["shogun (将軍)","shogunal (将軍の)"],"historical_terms":["daimyo (大名)","samurai (侍)","bakufu (幕府)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'shogunate' is a specialized term used in the context of Japanese history. It refers to the government or period of rule by a shogun, who was a military dictator. Understanding this term requires familiarity with Japanese history and political structures. It is not commonly used in everyday conversation but is important in historical studies."},"example_sentences":[{"sentence":"The Ashikaga shogunate was characterized by internal conflict and weakening central authority.","translation":"足利幕府は、内紛と中央権力の弱体化を特徴としていた。","type":"noun","meaning_category":"幕府"},{"sentence":"The Meiji Restoration brought an end to the Tokugawa shogunate and restored imperial rule.","translation":"明治維新は徳川幕府を終わらせ、天皇による統治を復活させた。","type":"noun","meaning_category":"幕府"}]}