{"word":"Wycliffian","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"ウィクリフの、またはウィクリフ主義の","english_definition":"Of or pertaining to John Wycliffe or Wycliffism.","examples":[{"sentence":"Wycliffian doctrines were condemned by the Church.","translation":"ウィクリフ主義の教義は教会によって非難された。"},{"sentence":"The Wycliffian Bible was translated into English.","translation":"ウィクリフ聖書は英語に翻訳された。"}],"collocations":["Wycliffian Bible","Wycliffian doctrines","Wycliffian movement"],"synonyms":["Wycliffite"],"antonyms":[]},{"part_of_speech":"noun","definition":"ウィクリフ主義者","english_definition":"A follower of John Wycliffe; a Wycliffite.","examples":[{"sentence":"The Wycliffians were persecuted for their beliefs.","translation":"ウィクリフ主義者たちはその信仰のために迫害された。"}],"collocations":["early Wycliffians","persecuted Wycliffians"],"synonyms":["Wycliffite"],"antonyms":[]}],"etymology":{"value":"John Wycliffe (c. 1320-1384) + -ian","priority":"★★☆"},"pronunciation":{"ipa":"/wɪˈklɪfiən/","syllables":"Wy-clif-fi-an"},"inflection":{"noun_plural":"Wycliffians"},"usage_notes":{"explanation":"The term \"Wycliffian\" refers to anything related to John Wycliffe, an English theologian, reformer, and university professor in the 14th century, or to Wycliffism, the set of religious beliefs and practices he advocated. These beliefs often challenged the authority of the Church and promoted the translation of the Bible into vernacular languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Wycliffian was a language.","correct":"✓ Wycliffian refers to the followers or teachings of John Wycliffe.","note":"Wycliffian is not a language but a term related to a person and his religious movement."}],"priority":"★☆☆"},"related_words":{"derivatives":["Wycliffe","Wycliffism","Wycliffite"],"related_terms":["Lollard"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低い","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Wycliffian\" is a specialized term relating to the historical figure John Wycliffe and the religious movement he inspired in the 14th century. It is primarily encountered in historical or theological contexts when discussing the pre-Reformation period in England. Understanding the term requires familiarity with the history of Christianity and the challenges to the Catholic Church during that era."},"example_sentences":[{"sentence":"The Wycliffian movement advocated for the translation of the Bible into English.","translation":"ウィクリフ主義運動は、聖書の英語への翻訳を提唱した。","type":"adjective","meaning_category":"ウィクリフの、またはウィクリフ主義の"},{"sentence":"Many Wycliffians faced persecution for their dissenting views.","translation":"多くのウィクリフ主義者が、異議を唱える見解のために迫害に直面した。","type":"noun","meaning_category":"ウィクリフ主義者"}]}