{"word":"non-pecuniary","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"金銭的でない、金銭に関係しない","english_definition":"Not relating to or measured in money.","examples":[{"sentence":"The award included both pecuniary and non-pecuniary damages.","translation":"その裁定には、金銭的損害賠償と非金銭的損害賠償の両方が含まれていた。"},{"sentence":"Job satisfaction is often linked to non-pecuniary benefits.","translation":"仕事の満足度は、しばしば金銭的でない利益と関連付けられる。"},{"sentence":"Employees may value non-pecuniary rewards such as flexible working hours.","translation":"従業員は、柔軟な勤務時間などの金銭的でない報酬を重視するかもしれない。"}],"collocations":["non-pecuniary damages","non-pecuniary benefits","non-pecuniary loss","non-pecuniary reward","non-pecuniary compensation"],"synonyms":["intangible","nonmonetary","nonfinancial"],"antonyms":["pecuniary","monetary","financial"]}],"etymology":{"value":"'Non-' (not) + 'pecuniary' (relating to money). 'Pecuniary' comes from Latin 'pecuniarius,' from 'pecunia' (money), which in turn comes from 'pecus' (cattle), reflecting the ancient use of cattle as a form of currency.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn pɪˈkjuːniəri/","syllables":"non-pi-cu-ni-a-ri"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Non-pecuniary' is used to describe things that cannot be easily valued in terms of money. It often refers to intangible aspects like emotional distress, loss of enjoyment of life, or the value of recognition. It is commonly used in legal and economic contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-pecuniary of the painting was high.","correct":"✓ The non-pecuniary value of the painting was high.","note":"'Non-pecuniary' is an adjective, so it needs to modify a noun like 'value,' 'benefits,' or 'damages.'"},{"incorrect":"✗ He received pecuniary damages for his emotional distress.","correct":"✓ He received non-pecuniary damages for his emotional distress.","note":"Emotional distress is a non-monetary loss, so it should be described as 'non-pecuniary damages.'"}],"priority":"★★☆"},"related_words":{"derivatives":["pecuniary"],"phrases":["non-economic loss"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-pecuniary' is a formal term, primarily used in legal and economic contexts, to describe something that is not related to money. It is often used to refer to intangible losses or benefits that are difficult to quantify in monetary terms. Understanding this term requires a good grasp of formal vocabulary and abstract concepts."},"example_sentences":[{"sentence":"The court awarded her non-pecuniary damages for pain and suffering.","translation":"裁判所は彼女に苦痛に対する非金銭的損害賠償を認めた。","type":"adjective","meaning_category":"金銭的でない"},{"sentence":"Many employees value the non-pecuniary aspects of their jobs, such as a positive work environment.","translation":"多くの従業員は、良好な職場環境など、仕事の金銭的でない側面を重視している。","type":"adjective","meaning_category":"金銭的でない"},{"sentence":"The study examined the impact of non-pecuniary incentives on employee motivation.","translation":"その研究は、従業員のモチベーションに対する非金銭的インセンティブの影響を調査した。","type":"adjective","meaning_category":"金銭的でない"}]}