{"word":"Sahiwal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サヒワール（パキスタン原産の乳牛の品種）","english_definition":"A breed of zebu cow, originating in the Sahiwal district of Pakistan, primarily used for milk production.","examples":[{"sentence":"The Sahiwal is a popular breed of dairy cattle in India and Pakistan.","translation":"サヒワールはインドとパキスタンで人気の乳牛の品種です。"},{"sentence":"Sahiwal cows are known for their high milk yield and heat tolerance.","translation":"サヒワール牛は、高い乳量と耐暑性で知られています。"}],"collocations":["Sahiwal cattle","Sahiwal cow","Sahiwal bull","Sahiwal breed","Sahiwal milk"],"synonyms":["None (breed name)"],"antonyms":["None (breed name)"]}],"etymology":{"value":"Named after the Sahiwal district in Punjab, Pakistan, where the breed originated.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɑːhiwɑːl/","syllables":"Sa-hi-wal"},"inflection":{"notes":"Noun, singular and plural forms are the same (Sahiwal)."},"usage_notes":{"explanation":"'Sahiwal' refers specifically to a breed of cattle. It is typically used in agricultural contexts, particularly when discussing dairy farming, livestock, or animal husbandry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Sahiwal at the zoo.","correct":"✓ I saw a Sahiwal cow at the farm.","note":"Sahiwal are not typically found in zoos, they are farm animals."}],"priority":"★★☆"},"related_words":{"derivatives":["None"],"related_breeds":["Gir","Red Sindhi","Tharparkar"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (specific term)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Sahiwal' is a specialized term related to animal husbandry and agriculture. Understanding and use are generally limited to those with specific knowledge in these fields. It is not part of general vocabulary.","priority":"★★★"},"example_sentences":[{"sentence":"The farmer decided to raise Sahiwal cattle because of their reputation for high milk production.","translation":"その農家は、乳量の多さで評判のサヒワール牛を飼育することに決めた。","type":"general","meaning_category":"breed"},{"sentence":"Sahiwal cows are well-adapted to the hot and humid climates of South Asia.","translation":"サヒワール牛は、南アジアの高温多湿な気候によく適応している。","type":"characteristic","meaning_category":"breed"}]}