{"word":"WCTU","priority":"低","meanings":[{"part_of_speech":"noun","definition":"Woman's Christian Temperance Union（女性キリスト教禁酒同盟）","english_definition":"An international temperance organization founded in the United States in 1874, advocating for abstinence from alcohol and other social reforms.","examples":[{"sentence":"The WCTU played a significant role in the prohibition movement.","translation":"WCTUは禁酒運動において重要な役割を果たした。"},{"sentence":"Members of the WCTU campaigned against alcohol consumption.","translation":"WCTUのメンバーはアルコール消費に反対する運動を行った。"}],"collocations":["WCTU member","WCTU chapter","WCTU convention","support the WCTU","join the WCTU"],"synonyms":["Temperance movement","Prohibition movement"],"antonyms":[]}],"etymology":{"value":"The acronym stands for Woman's Christian Temperance Union.","priority":"高"},"pronunciation":{"ipa":"/ˌdʌbəljuː siː tiː ˈjuː/","syllables":"W-C-T-U (four syllables)"},"inflection":{"notes":"It is a proper noun and acronym, so it doesn't inflect."},"usage_notes":{"explanation":"WCTU refers to a specific organization with historical significance, particularly in the context of the temperance movement in the United States and other countries. It is typically used in historical or social studies contexts.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a member of WCTU.","correct":"✓ I am a member of the WCTU.","note":"The acronym is usually preceded by the definite article 'the' because it refers to a specific organization."}],"priority":"低"},"related_words":{"derivatives":["temperance","prohibition","abstinence"],"phrasal_verbs":[],"related_organizations":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'WCTU' is a historical reference to the Woman's Christian Temperance Union, an organization that played a significant role in the temperance and prohibition movements. Understanding its meaning requires knowledge of historical and social contexts related to these movements. It is not commonly used in everyday conversation. "},"example_sentences":[{"sentence":"The history of the WCTU is closely tied to the history of prohibition in the United States.","translation":"WCTUの歴史は、アメリカ合衆国における禁酒の歴史と密接に結びついている。","type":"noun","meaning_category":"Organization"},{"sentence":"Many prominent women were active in the WCTU.","translation":"多くの著名な女性がWCTUで活動していた。","type":"noun","meaning_category":"Organization"}]}