{"word":"Moringaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ワサビノキ科","english_definition":"The family of flowering plants to which the Moringa tree belongs.","examples":[{"sentence":"Moringaceae is a small family of trees and shrubs.","translation":"ワサビノキ科は、低木と高木からなる小さな科です。"}],"collocations":["Moringaceae family","Moringa oleifera (ワサビノキ)"],"synonyms":["Moringa family"],"antonyms":[]}],"etymology":{"value":"From the genus name Moringa, plus the suffix '-aceae' which is used to denote a plant family.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɔːrɪŋˈɡeɪsiːˌaɪ/","syllables":"Mo-rin-ga-ce-ae"},"inflection":{"noun_plural":"Moringaceaes / Moringaceae"},"usage_notes":{"explanation":"Moringaceae is primarily used in botanical contexts when discussing plant taxonomy and classification. The most well-known member of this family is Moringa oleifera, commonly known as the Moringa tree or drumstick tree, which is cultivated for its nutritional and medicinal properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Moringa is a Moringaceae.","correct":"✓ Moringa is a member of the Moringaceae family.","note":"Moringaceae refers to the family, not an individual plant. Use 'member of the Moringaceae family' to specify a plant belonging to this family."}],"priority":"★★☆"},"related_words":{"derivatives":["Moringa (genus)","Moringa oleifera (species)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moringaceae' is a technical term used in botany and plant science. It refers to the family of plants that includes the Moringa tree. This term is typically encountered in scientific literature or academic discussions related to plant classification and characteristics. Understanding this term requires familiarity with botanical nomenclature.","priority":"★★☆"},"example_sentences":[{"sentence":"The Moringaceae family is native to Africa and Asia.","translation":"ワサビノキ科はアフリカとアジア原産です。","type":"noun","meaning_category":"plant family"},{"sentence":"Research is being conducted on the various species within the Moringaceae.","translation":"ワサビノキ科の様々な種に関する研究が行われています。","type":"noun","meaning_category":"plant family"}]}