{"word":"Abelonian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史) アベロニア派の、アベロニア派に関する","english_definition":"Relating to the Abelonians, an ancient sect that practiced celibacy and adopted children to continue their community.","examples":[{"sentence":"The Abelonian sect was known for its unique approach to reproduction.","translation":"アベロニア派は、その独特な生殖方法で知られていました。"},{"sentence":"Abelonian beliefs differed significantly from mainstream Christian doctrines.","translation":"アベロニア派の信仰は、主流のキリスト教の教義とは大きく異なっていました。"}],"collocations":["Abelonian sect","Abelonian practice","Abelonian belief"],"synonyms":["celibate","ascetic"],"antonyms":["procreative","reproductive"]},{"part_of_speech":"noun","definition":"(歴史) アベロニア派の人","english_definition":"A member of the Abelonians.","examples":[{"sentence":"The Abelonians maintained their community through adoption.","translation":"アベロニア派の人々は、養子縁組によってコミュニティを維持していました。"},{"sentence":"Few historical records remain about the daily lives of the Abelonians.","translation":"アベロニア派の人々の日常生活に関する歴史的記録はほとんど残っていません。"}],"collocations":["the Abelonians"],"synonyms":["Abelite"],"antonyms":[]}],"etymology":{"value":"From 'Abel' (referring to the biblical figure Abel, who was believed to have died childless) + '-onian' (suffix indicating affiliation or origin).","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪbəˈloʊniən/","syllables":"A-be-lo-ni-an"},"inflection":{"notes":"The word can function as both an adjective and a noun. The plural form of the noun is 'Abelonians'."},"usage_notes":{"explanation":"'Abelonian' refers specifically to a historical religious sect known for practicing celibacy and sustaining their community through adoption. The term is rarely used outside of historical or religious contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived an Abelonian lifestyle, enjoying many children.","correct":"✓ He lived a celibate lifestyle, abstaining from marriage and sexual relations.","note":"'Abelonian' implies celibacy, so it's contradictory to associate it with having many children. The Abelonians adopted, rather than bore, children."}],"priority":"★★★"},"related_words":{"derivatives":["Abelite (synonym)","Abelites (plural form)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Abelonian' is highly specialized and primarily encountered in historical or religious studies contexts. Understanding requires familiarity with obscure religious sects and historical practices. Due to its rarity and specific context, it's not suitable for general language learning. "},"example_sentences":[{"sentence":"The Abelonian heresy was condemned by early church fathers.","translation":"アベロニア派の異端は、初期の教父たちによって非難されました。","type":"adjective","meaning_category":"historical/religious context"},{"sentence":"The Abelonians sought to emulate Abel's perceived purity.","translation":"アベロニア派の人々は、アベルの純粋さを模範としようとしました。","type":"noun","meaning_category":"historical/religious context"}]}