{"word":"configuration-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"設定に依存する、構成に依存する","english_definition":"Relating to or being a system, program, or function whose behavior or performance is dependent on the specific configuration or settings in which it is used.","examples":[{"sentence":"The software is configuration-sensitive, requiring specific settings for optimal performance.","translation":"そのソフトウェアは設定に依存するため、最適なパフォーマンスを得るには特定の設定が必要です。"},{"sentence":"Configuration-sensitive applications may exhibit different behavior across different environments.","translation":"設定に依存するアプリケーションは、異なる環境間で異なる動作を示すことがあります。"}],"collocations":["configuration-sensitive software","configuration-sensitive application","configuration-sensitive system","configuration-sensitive code"],"synonyms":["settings-dependent","environment-dependent","parameter-dependent"],"antonyms":["configuration-independent","configuration-agnostic","settings-independent"]}],"etymology":{"value":"The term is formed by combining 'configuration' (the arrangement of elements in a system) with 'sensitive' (easily affected or influenced by something).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˌfɪɡjəˈreɪʃən ˈsɛnsətɪv/","syllables":"con-fig-u-ra-tion-sen-si-tive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Configuration-sensitive' is used to describe systems or applications that behave differently based on their configuration. This often implies that the system needs to be carefully set up to work correctly, and that changes to the configuration can have significant effects. It's commonly used in technical contexts, particularly in software and IT.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is very sensitive, it must be configuration-sensitive.","correct":"✓ The program is very sensitive; it must be configuration-sensitive. / ✓ The program is very sensitive and is configuration-sensitive.","note":"The original sentence is a run-on sentence. Use a semicolon or conjunction to separate the clauses."}],"priority":"★★☆"},"related_words":{"derivatives":["configuration","sensitive","sensitivity"],"related_terms":["parameterized","customizable","configurable"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical documentation and discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'configuration-sensitive' is a technical term used to describe something (usually software or a system) that changes its behavior depending on how it's set up. This means that the specific settings or parameters used to configure the system have a direct impact on how it works. Understanding this term is important in fields like software development, IT, and systems administration, where configuring systems correctly is crucial for optimal performance."},"example_sentences":[{"sentence":"The game engine is highly configuration-sensitive, allowing developers to fine-tune performance on different hardware.","translation":"このゲームエンジンは設定に非常に依存しており、開発者はさまざまなハードウェアでパフォーマンスを微調整できます。","type":"general","meaning_category":"general"},{"sentence":"A configuration-sensitive firewall can be customized to provide different levels of security based on network requirements.","translation":"設定に依存するファイアウォールは、ネットワーク要件に基づいてさまざまなレベルのセキュリティを提供するようにカスタマイズできます。","type":"technical","meaning_category":"technical"}]}