{"word":"Azoospermia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無精子症","english_definition":"A medical condition in men where there is a complete absence of sperm in the ejaculate.","examples":[{"sentence":"Azoospermia is a cause of male infertility.","translation":"無精子症は男性不妊の原因の一つです。"},{"sentence":"Diagnosis of azoospermia requires semen analysis.","translation":"無精子症の診断には精液検査が必要です。"}],"collocations":["Obstructive azoospermia","Non-obstructive azoospermia","Semen analysis for azoospermia","Treatment for azoospermia"],"synonyms":["Sperm absence","No sperm count"],"antonyms":["Normozoospermia (normal sperm count)"]},{"part_of_speech":"noun","definition":"(より詳細な定義)射精された精液中に精子が全く存在しない状態。閉塞性と非閉塞性の2種類がある。閉塞性無精子症は、精子の輸送経路が閉塞している場合に起こり、非閉塞性無精子症は、精巣での精子産生が障害されている場合に起こる。","english_definition":"(More detailed definition) A condition characterized by the complete absence of sperm in the ejaculate. It can be classified into two main types: obstructive azoospermia, caused by a blockage in the sperm transport pathways, and non-obstructive azoospermia, resulting from impaired sperm production in the testicles.","examples":[{"sentence":"Obstructive azoospermia can sometimes be treated with surgery.","translation":"閉塞性無精子症は手術で治療できる場合があります。"},{"sentence":"Non-obstructive azoospermia may require more complex treatments such as hormone therapy or sperm retrieval.","translation":"非閉塞性無精子症は、ホルモン療法や精子回収などのより複雑な治療が必要になる場合があります。"}],"collocations":["Obstructive azoospermia diagnosis","Non-obstructive azoospermia treatment","Hormone therapy for azoospermia","Sperm retrieval for azoospermia"],"synonyms":["Complete absence of sperm in ejaculate","Zero sperm count"],"antonyms":["Normal sperm production"]}],"etymology":{"value":"The term 'azoospermia' is derived from the Greek words 'a-' (meaning 'no' or 'without'), 'zoo-' (referring to 'animal' or 'life,' in this case, sperm), and 'spermia' (referring to 'sperm'). Thus, it literally means 'without sperm'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪzoʊspɜːrmiə/","syllables":"A-zo-o-sper-mi-a"},"inflection":{"notes":"Azoospermia is a noun and does not have different inflectional forms."},"usage_notes":{"explanation":"Azoospermia is a medical term used exclusively in the context of male reproductive health. It is important to distinguish between azoospermia (absence of sperm) and oligospermia (low sperm count). Diagnosis requires a semen analysis performed by a qualified laboratory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with azoospermia, so he is fertile.","correct":"✓ He was diagnosed with azoospermia, so he is infertile.","note":"Azoospermia means the absence of sperm, which leads to infertility."},{"incorrect":"✗ Azoospermia can be cured with antibiotics.","correct":"✓ Treatment for azoospermia depends on the cause and may involve surgery, hormone therapy, or assisted reproductive techniques.","note":"Antibiotics are not a general treatment for azoospermia; treatment depends on the underlying cause."}],"priority":"★★☆"},"related_words":{"derivatives":["Oligospermia (low sperm count)","Spermatogenesis (sperm production)","Infertility (inability to conceive)","Semen analysis (test to evaluate sperm)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Azoospermia' is a technical term used in medicine to describe a condition where a man's semen contains no sperm. It is a cause of infertility. The word is built from Greek roots: 'a-' (no), 'zoo-' (animal/sperm), and 'spermia' (sperm). Understanding this term is important in discussions about reproductive health and fertility treatments.","priority":"★★☆"},"example_sentences":[{"sentence":"The couple sought medical advice due to the husband's azoospermia.","translation":"夫婦は夫の無精子症のため、医師の診察を受けた。","type":"general","meaning_category":"General medical context"},{"sentence":"Further tests are needed to determine the cause of his azoospermia.","translation":"彼の無精子症の原因を特定するためには、さらなる検査が必要です。","type":"diagnosis","meaning_category":"Diagnosis and testing"},{"sentence":"Treatment options for azoospermia vary depending on whether it is obstructive or non-obstructive.","translation":"無精子症の治療法は、閉塞性か非閉塞性かによって異なります。","type":"treatment","meaning_category":"Treatment options"},{"sentence":"Azoospermia can be a challenging condition to manage, requiring a multidisciplinary approach.","translation":"無精子症は管理が難しい病状であり、学際的なアプローチが必要です。","type":"management","meaning_category":"Disease management"}]}