{"word":"cystourethritis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"膀胱尿道炎","english_definition":"Inflammation of both the urinary bladder and the urethra.","examples":[{"sentence":"Cystourethritis is more common in women due to their shorter urethra.","translation":"膀胱尿道炎は、女性の方が尿道が短いため、より一般的です。"},{"sentence":"Symptoms of cystourethritis include frequent urination, pain during urination, and lower abdominal discomfort.","translation":"膀胱尿道炎の症状には、頻尿、排尿時の痛み、下腹部の不快感などがあります。"}],"collocations":["acute cystourethritis (急性膀胱尿道炎)","chronic cystourethritis (慢性膀胱尿道炎)","bacterial cystourethritis (細菌性膀胱尿道炎)"],"synonyms":["urinary tract infection (UTI)","urethrocystitis"],"antonyms":[]}],"etymology":{"value":"\"cysto-\" (膀胱) + \"urethr-\" (尿道) + \"-itis\" (炎症)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪstoʊjʊˌriːθraɪtɪs/","syllables":"cis-to-u-re-thri-tis"},"inflection":{"noun_plural":"cystourethritides (稀)"},"usage_notes":{"explanation":"Cystourethritis is a specific type of urinary tract infection (UTI) that involves inflammation of both the bladder (cystitis) and the urethra (urethritis). It's often used to describe cases where it's difficult to determine whether the infection is primarily in the bladder or urethra, or when both are clearly affected.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cystourethritis is a disease of the kidney.","correct":"✓ Cystourethritis is a disease of the bladder and urethra.","note":"Cystourethritis affects the bladder and urethra, not the kidney."},{"incorrect":"✗ Cystourethritis only affects men.","correct":"✓ Cystourethritis is more common in women, but can affect men.","note":"While more common in women, men can also develop cystourethritis."}],"priority":"★★☆"},"related_words":{"derivatives":["cystitis (膀胱炎)","urethritis (尿道炎)","UTI (尿路感染症)"],"medical_terms":["hematuria (血尿)","dysuria (排尿困難)","pyuria (膿尿)","bacteriuria (細菌尿)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cystourethritis is a medical term referring to the inflammation of both the bladder and the urethra. It is a specific type of urinary tract infection (UTI). Understanding this term requires knowledge of medical terminology related to the urinary system. The symptoms are similar to those of a UTI, but the term specifically indicates that both the bladder and urethra are involved. It is more commonly diagnosed and discussed within medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was diagnosed with acute cystourethritis after complaining of painful urination and frequent urges to urinate.","translation":"患者は、排尿痛と頻尿の訴えの後、急性膀胱尿道炎と診断されました。","type":"general","meaning_category":"diagnosis"},{"sentence":"Treatment for cystourethritis typically involves antibiotics to clear the bacterial infection.","translation":"膀胱尿道炎の治療は通常、細菌感染を除去するための抗生物質の使用を含みます。","type":"treatment","meaning_category":"treatment"},{"sentence":"Proper hygiene can help prevent cystourethritis, especially in women.","translation":"適切な衛生管理は、特に女性において、膀胱尿道炎の予防に役立ちます。","type":"prevention","meaning_category":"prevention"}]}