{"word":"unthreadable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of a needle or other object with an eye) not able to have thread passed through the eye.","english_definition":"Not capable of being threaded; having an eye too small or obstructed to allow thread to pass through.","examples":[{"sentence":"The needle was old and rusty, making it virtually unthreadable.","translation":"その針は古くて錆びており、ほとんど糸を通すことができなかった。"},{"sentence":"She discarded the unthreadable needle and selected a new one.","translation":"彼女は糸を通せない針を捨て、新しい針を選んだ。"}],"collocations":["unthreadable needle","unthreadable eye"],"synonyms":["non-threadable"],"antonyms":["threadable"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning 'not') to the word \"threadable\" (capable of being threaded).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈθrɛdəbəl/","syllables":"un-thread-a-ble"},"inflection":{"adjective_forms":{"comparative":"more unthreadable","superlative":"most unthreadable"}},"usage_notes":{"explanation":"The term 'unthreadable' is generally used to describe a condition where a needle's eye is too small, damaged, or obstructed, preventing the passage of thread. It is relatively uncommon in everyday conversation but may be used in sewing, crafting, or manufacturing contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unthreadable material made the sewing difficult.","correct":"✓ The material was difficult to sew.","note":"'Unthreadable' refers to the needle or the eye, not the material being sewn."},{"incorrect":"✗ The needle was unthreaded.","correct":"✓ The needle was unthreadable.","note":"'Unthreaded' means that the thread has been removed from the needle, whereas 'unthreadable' means that thread cannot be passed through the needle's eye."}],"priority":"★★☆"},"related_words":{"derivatives":["thread","threadable","un-"],"related_terms":["needle","eye","thread","sewing","crafting"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unthreadable' is a technical term primarily used in contexts related to sewing or crafting. It describes a situation where thread cannot be passed through the eye of a needle or similar object. Understanding this word requires a familiarity with the process of threading a needle and the potential issues that can arise. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"She realized the antique needle was unthreadable due to its corroded eye.","translation":"彼女はアンティークの針の穴が腐食しているため、糸を通すことができないことに気づいた。","type":"adjective","meaning_category":"not able to have thread passed through the eye"},{"sentence":"The sewing machine came with a few unthreadable needles, which were quickly discarded.","translation":"そのミシンには糸を通すことができない針がいくつか付属しており、すぐに廃棄された。","type":"adjective","meaning_category":"not able to have thread passed through the eye"}]}