{"word":"UREP","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米軍)緊急状況報告 (Urgent Report)","english_definition":"(US Military) An Urgent Report; a report used to immediately notify the National Military Command Center (NMCC) of critical information.","examples":[{"sentence":"A UREP was filed after the aircraft malfunctioned.","translation":"航空機の故障後、緊急状況報告が提出された。"},{"sentence":"The commander requested a UREP be sent immediately.","translation":"司令官は緊急状況報告を直ちに送るよう要請した。"}],"collocations":["file a UREP","submit a UREP","request a UREP"],"synonyms":["urgent report","situation report (SITREP)"],"antonyms":[]}],"etymology":{"value":"Acronym of 'Urgent Report'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈjuːˌrɛp/","syllables":"U-REP"},"inflection":{"noun_plural":"UREPs"},"usage_notes":{"explanation":"A UREP is a specific type of report used within the US military to quickly communicate critical information that requires immediate attention at higher command levels. It is used for serious incidents, such as equipment failures, security breaches, or significant changes in operational status. The report is designed to bypass normal reporting channels to ensure rapid notification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I sent a UREP to my friend.","correct":"✓ I submitted a UREP through the proper channels.","note":"UREPs are formal military reports and are not sent to individuals outside the chain of command."},{"incorrect":"✗ The UREP was about the weather.","correct":"✓ The UREP was about a critical system failure.","note":"UREPs are reserved for urgent and critical information, not routine matters."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_acronyms":["SITREP (Situation Report)","NMCC (National Military Command Center)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Military Specific)","frequency_google_ngram":"Low (within general English; high within US military contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'UREP' is a highly specialized term used within the US military. It stands for 'Urgent Report' and is used to immediately notify the National Military Command Center of critical information. Understanding its use requires familiarity with military procedures and terminology. It is not a term commonly used in general English.","priority":"★★★"},"example_sentences":[{"sentence":"The unit submitted a UREP following the security breach.","translation":"部隊はセキュリティ侵害の後、緊急状況報告を提出した。","type":"noun","meaning_category":"緊急状況報告"},{"sentence":"The UREP detailed the extent of the equipment malfunction.","translation":"緊急状況報告は、機器の故障の程度を詳細に記述した。","type":"noun","meaning_category":"緊急状況報告"},{"sentence":"Due to the severity of the incident, a UREP was required.","translation":"事件の重大さから、緊急状況報告が必要とされた。","type":"noun","meaning_category":"緊急状況報告"}]}