{"word":"violable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"侵害可能な、破ることができる、犯しやすい","english_definition":"capable of being violated; susceptible to violation or infringement.","examples":[{"sentence":"No right is absolute; all rights are violable under certain circumstances.","translation":"絶対的な権利はなく、すべての権利はある状況下では侵害されうる。"},{"sentence":"The contract was violable if certain conditions were not met.","translation":"特定の条件が満たされない場合、その契約は破棄可能だった。"},{"sentence":"A person's privacy is violable in the digital age.","translation":"デジタル時代において、個人のプライバシーは侵害されやすい。"}],"collocations":["easily violable","inherently violable","potentially violable","violable right","violable contract","violable agreement"],"synonyms":["infringible","susceptible","vulnerable","penetrable","assailable","liable"],"antonyms":["inviolable","sacrosanct","immune","protected","secure","impregnable"]},{"part_of_speech":"adjective","definition":"(女性が)貞操を奪われやすい、性的暴行を受けやすい","english_definition":"(of a woman) susceptible to being raped or sexually assaulted.","examples":[{"sentence":"In times of war, women are often seen as violable.","translation":"戦時中、女性はしばしば性的暴行を受けやすい存在として見なされる。"},{"sentence":"The novel explores the theme of women being violable in a patriarchal society.","translation":"その小説は、家父長制社会において女性が性的暴行を受けやすいというテーマを探求している。"}],"collocations":["seen as violable","considered violable","made violable"],"synonyms":["vulnerable","defenseless","susceptible to assault"],"antonyms":["safe","protected","secure"]}],"etymology":{"value":"From \"violate\" + \"-able\".","priority":"★★☆"},"pronunciation":{"ipa":"ˈvaɪələbəl","syllables":"vi-o-la-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more violable' and 'most violable'."},"usage_notes":{"explanation":"\"Violable\" describes something that can be violated, meaning it can be broken, infringed upon, or treated with disrespect. It often refers to rights, laws, contracts, or personal boundaries. In some contexts, it can also refer to the vulnerability of a person, particularly a woman, to sexual assault. The term implies a lack of protection or defense against such violations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The rule is inviolable, it cannot be violable.","correct":"The rule is inviolable, it cannot be violated.","note":"\"Inviolable\" means something cannot be violated, while \"violable\" means it can. The mistake is using \"violable\" when \"violated\" (past participle of the verb) is intended."},{"incorrect":"Her privacy is violable by anyone.","correct":"Her privacy can be violated by anyone.","note":"While grammatically correct, \"violable\" is less common than saying \"can be violated.\" Using the verb form is often clearer and more direct."}],"priority":"★★☆"},"related_words":{"derivatives":["violate (verb)","violation (noun)","violability (noun)"],"phrases":["easily violable","potentially violable"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Violable\" is an adjective that means something is capable of being violated or infringed upon. This word is typically used in formal contexts when discussing laws, rights, or agreements. It suggests a lack of protection or a susceptibility to being broken or disregarded. The opposite of \"violable\" is \"inviolable,\" which means not capable of being violated."},"example_sentences":[{"sentence":"The terms of the treaty were violable under specific circumstances.","translation":"その条約の条項は、特定の状況下では破棄可能だった。","type":"adjective","meaning_category":"Infringible"},{"sentence":"Personal data is increasingly violable in the digital age.","translation":"デジタル時代において、個人データはますます侵害されやすくなっている。","type":"adjective","meaning_category":"Susceptible"},{"sentence":"Some argue that human rights are inherently violable.","translation":"人権は本質的に侵害されうると主張する人もいる。","type":"adjective","meaning_category":"Liable"}]}