{"word":"papolatrous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"教皇崇拝の、ローマ教皇を過度に崇拝する","english_definition":"Exhibiting or characterized by papolatry; excessively revering or idolizing the Pope.","examples":[{"sentence":"The article criticized the papolatrous tendencies within the church.","translation":"その記事は、教会内の教皇崇拝的な傾向を批判した。"},{"sentence":"Some viewed his devotion to the Pope as papolatrous.","translation":"彼の教皇への献身を、教皇崇拝的だと見る者もいた。"}],"collocations":["papolatrous tendencies","papolatrous devotion","papolatrous attitude"],"synonyms":["pope-worshipping","pro-papal","ultra-montane"],"antonyms":["anti-papal","anti-clerical","secular"],"notes":"Often used in a critical or disapproving context."}],"etymology":{"value":"Derived from 'papolatry' (excessive veneration of the Pope) + '-ous' (suffix indicating possession or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæpəˈleɪtrəs/","syllables":"pa-po-la-trous"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Papolatrous' is used to describe someone or something that shows excessive or extreme reverence for the Pope, often to a degree that is seen as inappropriate or excessive. It's a relatively uncommon word, often used in religious or political discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a papolatry man.","correct":"✓ He was a papolatrous man.","note":"'Papolatry' is the noun (the worship itself), while 'papolatrous' is the adjective (describing someone who engages in that worship)."},{"incorrect":"✗ The church was papolatrous.","correct":"✓ The church exhibited papolatrous tendencies.","note":"It is more accurate to say that a church *exhibits* papolatrous tendencies, rather than saying the church *is* papolatrous, as the latter implies the entire institution is engaged in Pope worship."}],"priority":"★★☆"},"related_words":{"derivatives":["papolatry (noun: excessive veneration of the Pope)"],"related_terms":["papal (adjective: relating to the Pope)","ultramontanism (noun: advocacy of papal authority)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'papolatrous' is a highly specialized term primarily used in religious or academic contexts to describe an excessive or extreme veneration of the Pope. Due to its specific and critical connotation, it is rarely encountered in general conversation or writing. Understanding requires familiarity with religious terminology and nuanced critique of religious authority."},"example_sentences":[{"sentence":"The historian described the era as one of intense papolatrous fervor.","translation":"歴史家はその時代を、激しい教皇崇拝の熱情の時代だと描写した。","type":"general","meaning_category":"教皇崇拝の"},{"sentence":"Critics accused the movement of promoting a papolatrous view of the pontiff.","translation":"批評家たちはその運動が、教皇に対する教皇崇拝的な見方を助長していると非難した。","type":"general","meaning_category":"教皇崇拝の"}]}