{"word":"Undispassionately","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"冷静に、公平に、感情を交えずに","english_definition":"In a calm and objective manner, without being influenced by emotions or personal feelings; impartially.","examples":[{"sentence":"The judge listened to the arguments undispassionately before making a ruling.","translation":"裁判官は判決を下す前に、感情を交えずに冷静に弁論を聞いた。"},{"sentence":"She analyzed the data undispassionately, focusing only on the facts.","translation":"彼女は事実のみに焦点を当て、感情を交えずにデータを分析した。"},{"sentence":"He approached the problem undispassionately, seeking a logical solution.","translation":"彼は論理的な解決策を求め、感情を交えずに問題に取り組んだ。"}],"collocations":["analyze undispassionately","judge undispassionately","observe undispassionately","evaluate undispassionately","approach undispassionately"],"synonyms":["objectively","impartially","neutrally","calmly","coolly","rationally","logically","fairly"],"antonyms":["passionately","emotionally","subjectively","biassed","partially"]}],"etymology":{"value":"Prefix 'un-' (not) + 'dispassionate' (having or showing no strong feelings) + suffix '-ly' (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈspæʃənətli/","syllables":"un-dis-pash-uh-nate-ly"},"inflection":{"notes":"Adverb, no inflections"},"usage_notes":{"explanation":"'Undispassionately' describes actions or processes carried out without emotional influence, emphasizing objectivity and fairness. It is often used in contexts where impartiality is crucial, such as legal proceedings, scientific research, or decision-making processes. The word suggests a deliberate effort to set aside personal feelings and biases in order to arrive at a rational conclusion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke undispassionately about the passionate issue.","correct":"✓ He spoke dispassionately about the passionate issue.","note":"The prefix 'un-' negates 'dispassionate,' so 'undispassionately' means 'not dispassionately.' If the intention is to convey objectivity, 'dispassionately' is the correct word. Using 'undispassionately' would imply that the person spoke with passion about the issue."},{"incorrect":"✗ She undispassionately felt the pain.","correct":"✓ She dispassionately described the pain.","note":"'Undispassionately' describes actions or processes. Feelings themselves cannot be 'undispassionate' but can be described or analyzed 'undispassionately'."}],"priority":"★★☆"},"related_words":{"derivatives":["dispassionate (adjective)","passion (noun)","passionate (adjective)"],"phrases":["with dispassion","without passion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undispassionately' is an adverb that describes doing something in a calm, objective, and impartial way, without being influenced by emotions. It is used in formal contexts where neutrality is important, such as in legal, scientific, or analytical settings. It implies a deliberate effort to set aside personal feelings and biases in order to make a rational judgment or decision. It is not a commonly used word and is more likely to be encountered in written texts than in everyday conversation."},"example_sentences":[{"sentence":"The committee reviewed the evidence undispassionately before reaching a verdict.","translation":"委員会は評決に達する前に、証拠を感情を交えずに検討した。","type":"general","meaning_category":"冷静に"},{"sentence":"The scientist approached the experiment undispassionately, ensuring no bias influenced the results.","translation":"科学者は先入観が結果に影響を与えないように、感情を交えずに実験に取り組んだ。","type":"scientific","meaning_category":"公平に"},{"sentence":"The historian analyzed the events of the war undispassionately, avoiding emotional interpretations.","translation":"歴史家は感情的な解釈を避け、戦争の出来事を感情を交えずに分析した。","type":"analytical","meaning_category":"感情を交えずに"}]}