{"word":"heart-heaviness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"心の重さ、憂鬱、悲しみ、落胆","english_definition":"a feeling of sadness, depression, or sorrow; a state of being burdened with grief or unhappiness.","examples":[{"sentence":"She felt a deep heart-heaviness after hearing the news.","translation":"彼女はその知らせを聞いて、深い心の重さを感じた。"},{"sentence":"The heart-heaviness in his eyes was evident to everyone.","translation":"彼の目の中の憂鬱は誰の目にも明らかだった。"},{"sentence":"He tried to shake off the heart-heaviness that had been plaguing him for days.","translation":"彼は何日も彼を苦しめていた心の重さを振り払おうとした。"}],"collocations":["a feeling of heart-heaviness","deep heart-heaviness","overcome heart-heaviness","shake off heart-heaviness"],"synonyms":["sorrow","grief","sadness","melancholy","despondency","depression","gloom","anguish","woe","heaviness of heart"],"antonyms":["joy","happiness","cheerfulness","lightheartedness","glee","contentment","elation","exuberance"]}],"etymology":{"value":"'Heart-heaviness' is a compound word. 'Heart' refers to the emotional center, and 'heaviness' describes a feeling of being weighed down or burdened. The combination suggests a state where the heart is burdened with sadness or sorrow.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrtˌhɛvinəs/","syllables":"heart-heav-i-ness"},"inflection":{"noun_plural":"heart-heavinesses"},"usage_notes":{"explanation":"'Heart-heaviness' is a relatively uncommon word, often used in literature or more formal contexts to describe a deep emotional burden. It conveys a sense of being weighed down by sadness or grief, affecting one's overall mood and outlook. It's more evocative than simply saying 'sadness' and implies a profound emotional weight.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a heart-heaviness in my stomach.","correct":"✓ I have a heart-heaviness in my chest. / ✓ I feel heart-heaviness.","note":"Heart-heaviness is an emotional feeling, not a physical sensation in the stomach. It's typically described as being felt in the heart or chest, or as a general emotional state."},{"incorrect":"✗ He showed heart-heaviness with smiling.","correct":"✓ He tried to hide his heart-heaviness, but it was evident.","note":"Heart-heaviness is associated with sadness, so it's contradictory to show it with smiling. It's usually manifested through expressions of sadness or attempts to conceal it."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":["heavy-hearted (adj): sad or depressed","weigh heavily on someone's heart (idiom): to cause someone to feel sad or worried"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The term is relatively rare in modern usage, more commonly found in literature or formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heart-heaviness' is a sophisticated term used to describe a profound feeling of sadness, sorrow, or emotional burden. It's not commonly used in everyday conversation but is more often found in literature or formal writing to convey a deep sense of emotional weight. Understanding this term requires a good grasp of emotional vocabulary and an appreciation for nuanced language.","priority":"★☆☆"},"example_sentences":[{"sentence":"A wave of heart-heaviness washed over her as she remembered her lost loved one.","translation":"愛する人を亡くしたことを思い出すと、彼女は心の重さに襲われた。","type":"noun","meaning_category":"sadness"},{"sentence":"Despite his attempts to appear cheerful, the heart-heaviness lingered in his voice.","translation":"陽気に振る舞おうとしたにもかかわらず、彼の声には心の重さが残っていた。","type":"noun","meaning_category":"sorrow"},{"sentence":"The heart-heaviness in the room was palpable as they discussed the difficult decision.","translation":"難しい決断について話し合うにつれて、部屋の中の心の重さは明白になった。","type":"noun","meaning_category":"depression"}]}