{"word":"Morphea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"限局性強皮症（皮膚が硬化する病気）の一種","english_definition":"A localized form of scleroderma characterized by patches of thickened, discolored skin.","examples":[{"sentence":"Morphea typically affects the skin but can sometimes involve underlying tissues.","translation":"限局性強皮症は通常、皮膚に影響を与えますが、場合によっては皮下組織にも及ぶことがあります。"},{"sentence":"The diagnosis of morphea is usually based on clinical examination and sometimes a skin biopsy.","translation":"限局性強皮症の診断は、通常、臨床検査に基づいて行われ、場合によっては皮膚生検も行われます。"}],"collocations":["localized morphea","generalized morphea","linear morphea","morphea en coup de sabre"],"synonyms":["localized scleroderma"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「morphe」（形、外観）に由来し、皮膚の形状変化を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/mɔrˈfiːə/","syllables":"Mor-phe-a"},"inflection":{"noun_plural":"morpheas"},"usage_notes":{"explanation":"Morphea is a rare skin condition. It is a type of localized scleroderma, meaning it affects only certain areas of the skin. The condition is characterized by patches of discolored, thickened skin. The cause of morphea is unknown, but it is thought to be related to an autoimmune disorder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ morphea is a contagious disease.","correct":"✓ morphea is not a contagious disease.","note":"Morphea is not contagious."}],"priority":"★☆☆"},"related_words":{"derivatives":["scleroderma","linear scleroderma"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Morphea is a medical term referring to a specific skin condition. Understanding requires familiarity with medical terminology and concepts related to dermatology and autoimmune diseases. The text uses technical terms such as 'localized scleroderma' and 'skin biopsy,' which may be unfamiliar to a general audience. Therefore, it is suitable for readers with a background in medicine or a strong interest in health-related topics."},"example_sentences":[{"sentence":"The patient presented with several patches of morphea on her back.","translation":"患者は背中にいくつかの限局性強皮症の斑点を呈していた。","type":"medical case","meaning_category":"symptom"},{"sentence":"Treatment for morphea may include topical corticosteroids or phototherapy.","translation":"限局性強皮症の治療には、局所コルチコステロイドまたは光線療法が含まれる場合があります。","type":"treatment","meaning_category":"treatment"}]}