{"word":"adiposity-prone","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"肥満傾向のある、脂肪がつきやすい","english_definition":"Having a tendency to develop obesity; easily gaining fat.","examples":[{"sentence":"Studies show that some individuals are genetically adiposity-prone.","translation":"研究によると、遺伝的に肥満傾向のある人がいることが示されています。"},{"sentence":"An adiposity-prone lifestyle includes a diet high in processed foods and a lack of exercise.","translation":"肥満傾向のあるライフスタイルには、加工食品を多く含む食事と運動不足が含まれます。"}],"collocations":["genetically adiposity-prone (遺伝的に肥満傾向のある)","lifestyle that is adiposity-prone (肥満傾向のあるライフスタイル)"],"synonyms":["obesity-prone","fat-prone","predisposed to obesity","susceptible to weight gain"],"antonyms":["adiposity-resistant","lean","thin","naturally slim"],"notes":"This term is often used in scientific or medical contexts."}],"etymology":{"value":"The word is formed by combining 'adiposity' (the state of being fat or obese) with 'prone' (likely to suffer from or experience something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌædɪˈpɒsɪti proʊn/","syllables":"ad-i-pos-i-ty prone"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs like 'very' or 'somewhat' and can be used in comparative and superlative forms (more adiposity-prone, most adiposity-prone), although these are less common."},"usage_notes":{"explanation":"'Adiposity-prone' describes a person or thing that has a high likelihood of developing obesity or accumulating excess body fat. It's often used in research or clinical settings to discuss factors contributing to weight gain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is adiposity prone.","correct":"✓ He is adiposity-prone.","note":"The hyphen is important to correctly form the compound adjective."},{"incorrect":"✗ Adiposity prone people should exercise.","correct":"✓ Adiposity-prone people should exercise.","note":"The hyphen is necessary to link the words and create a compound adjective modifying 'people'."}],"priority":"★★☆"},"related_words":{"derivatives":["adiposity (名詞: 肥満、脂肪過多)","prone (形容詞: ～しやすい、～の傾向がある)"],"phrasal_verbs":[],"related_terms":["obesity","overweight","body fat","metabolism","genetics","lifestyle","diet","exercise"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency. This is a relatively technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adiposity-prone' is a term used in medical and scientific contexts to describe someone who has a high likelihood of becoming obese or gaining excess body fat. It's often used when discussing genetic predispositions or lifestyle factors that contribute to weight gain. The word combines 'adiposity,' which refers to the state of being fat, with 'prone,' meaning likely to experience something. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The researchers were studying the effects of diet on adiposity-prone mice.","translation":"研究者たちは、食事が肥満傾向のあるマウスに与える影響を研究していた。","type":"adjective","meaning_category":"肥満傾向のある"},{"sentence":"Identifying individuals who are adiposity-prone early in life can help with preventative measures.","translation":"人生の早い段階で肥満傾向のある人を特定することは、予防策に役立つ。","type":"adjective","meaning_category":"肥満傾向のある"}]}