{"word":"Interlaken","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インターラーケン：スイス中部のベルナーオーバーラント地方にある町。トゥーン湖とブリエンツ湖の間に位置し、ユングフラウ地方への観光拠点として知られる。","english_definition":"Interlaken: A town in the Interlaken-Oberhasli administrative district in the Swiss canton of Bern. It is an important and well-known tourist destination in the Bernese Oberland region of the Swiss Alps, and the main transport gateway to the mountains and lakes of that area.","examples":[{"sentence":"We spent a week in Interlaken, enjoying the stunning views of the Alps.","translation":"私たちはインターラーケンに1週間滞在し、アルプスの素晴らしい景色を楽しみました。"},{"sentence":"Interlaken is famous for its adventure sports and beautiful scenery.","translation":"インターラーケンは、アドベンチャースポーツと美しい景色で有名です。"}],"collocations":["visit Interlaken (インターラーケンを訪れる)","in Interlaken (インターラーケンで)","near Interlaken (インターラーケンの近くに)","Interlaken Switzerland (スイスのインターラーケン)"],"synonyms":["none (proper noun)"],"antonyms":["none (proper noun)"]}],"etymology":{"value":"The name Interlaken comes from its geographical position between two lakes, Lake Thun and Lake Brienz. The name is German, meaning 'between lakes'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪntərˌleɪkən/","syllables":"In-ter-la-ken"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Interlaken is primarily used as a proper noun to refer to the town in Switzerland. It's known for tourism, adventure activities, and its scenic location. When using it in a sentence, ensure it is capitalized, as it is a place name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to visit interlaken.","correct":"✓ I am going to visit Interlaken.","note":"Interlaken is a proper noun and should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":["Interlaken-Oberhasli (インターラーケン＝オーバーハスリ：行政区)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B1 (if discussing travel or geography)","frequency_google_ngram":"Relatively infrequent, but common in travel-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Interlaken' is a place name, specifically a town in Switzerland. It's known as a popular tourist destination, especially for people who enjoy outdoor activities and beautiful scenery. If you're talking about traveling to Switzerland or discussing famous places there, you might use this word. Remember to capitalize it because it's the name of a place."},"example_sentences":[{"sentence":"Many tourists flock to Interlaken for paragliding.","translation":"多くの観光客がパラグライダーをするためにインターラーケンに集まります。","type":"example","meaning_category":"Location/Tourism"},{"sentence":"The train journey from Zurich to Interlaken offers breathtaking views.","translation":"チューリッヒからインターラーケンへの列車の旅は息をのむような景色を提供します。","type":"example","meaning_category":"Travel"},{"sentence":"Interlaken is a great base for exploring the Jungfrau region.","translation":"インターラーケンはユングフラウ地方を探索するための素晴らしい拠点です。","type":"example","meaning_category":"Location/Tourism"}]}