{"word":"unbrutalised","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not brutalized; not made cruel or savage.","english_definition":"Not having been made cruel, savage, or insensitive; not subjected to brutal treatment or experiences.","examples":[{"sentence":"The children, thankfully, remained unbrutalised by their harsh surroundings.","translation":"ありがたいことに、子供たちは厳しい環境によって残酷にされることはなかった。"},{"sentence":"He retained an unbrutalised perspective, despite witnessing many atrocities.","translation":"彼は多くの残虐行為を目撃したにもかかわらず、残酷に染まっていない視点を保っていた。"}],"collocations":["remain unbrutalised","an unbrutalised perspective","an unbrutalised view"],"synonyms":["unsullied","untainted","unspoiled","unhardened","innocent"],"antonyms":["brutalised","hardened","desensitized","callous"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'brutalised'. 'Brutalise' itself comes from 'brutal', which is derived from the Latin word 'brutalis' (relating to beasts or irrational).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbruːtəlaɪzd/","syllables":"un-bru-ta-lised"},"inflection":{"adjective_forms":{"comparative":"more unbrutalised","superlative":"most unbrutalised"}},"usage_notes":{"explanation":"'Unbrutalised' describes a state of being where someone or something has not been made cruel, insensitive, or savage, typically through harsh experiences or treatment. It emphasizes the preservation of innocence, empathy, or a humane perspective. The word is relatively uncommon and often used in contexts discussing the effects of violence, trauma, or oppressive conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brutalised children became unbrutalised after therapy.","correct":"✓ The brutalised children began to heal and recover after therapy.","note":"'Unbrutalised' describes a state of *not having been* brutalized. Once someone *has been* brutalized, they cannot become 'unbrutalised,' but rather can heal or recover. The sentence should reflect a process of healing rather than a return to a previous state."}],"priority":"★★☆"},"related_words":{"derivatives":["brutalise (verb): to make brutal or savage","brutal (adjective): savagely violent","brutality (noun): savage violence; great cruelty"],"antonyms":["brutalised (adjective): made cruel or savage"]},"level_frequency":{"CEFR":"C2 (uncommon, used in specific contexts)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unbrutalised' is an uncommon word that means someone or something has not been made cruel or insensitive by harsh experiences. It is the opposite of 'brutalised'. You might see this word used when discussing the effects of war, abuse, or other traumatic events, to describe someone who has managed to maintain their humanity or innocence despite difficult circumstances. Because it is a relatively rare and complex word, it is more likely to be encountered in advanced texts or discussions. "},"example_sentences":[{"sentence":"Despite the horrors of war, some soldiers managed to remain unbrutalised, holding onto their compassion.","translation":"戦争の恐怖にもかかわらず、一部の兵士は思いやりを持ち続け、残酷にならずに済んだ。","type":"adjective","meaning_category":"Not made cruel"},{"sentence":"The author aimed to portray the characters as unbrutalised individuals in a corrupt society.","translation":"作者は、堕落した社会の中で、登場人物たちを残酷に染まっていない個人として描くことを目指した。","type":"adjective","meaning_category":"Not made savage"}]}