{"word":"dero","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング) 放浪者、ホームレス、社会から疎外された人","english_definition":"(slang, derogatory) A homeless person; a vagrant; someone considered to be socially undesirable.","examples":[{"sentence":"The park was full of deros sleeping on benches.","translation":"公園はベンチで寝ている放浪者でいっぱいだった。"},{"sentence":"He was labeled a dero by the more affluent members of the community.","translation":"彼は地域社会の裕福なメンバーから、社会から疎外された人だと決めつけられた。"}],"collocations":["street dero","park dero"],"synonyms":["vagrant","homeless person","tramp","bum","hobo","outcast","reject"],"antonyms":["affluent citizen","well-adjusted individual"]},{"part_of_speech":"noun","definition":"(オーストラリア・スラング) 怠け者、やる気のない人","english_definition":"(Australian slang) A lazy, unmotivated person; a shirker.","examples":[{"sentence":"Don't be such a dero, get up and help with the chores.","translation":"怠けてないで、起きて家事を手伝いなさい。"},{"sentence":"He's a complete dero, never does any work around the house.","translation":"彼は全くの怠け者で、家の周りの仕事を全くしない。"}],"collocations":["complete dero","lazy dero"],"synonyms":["slacker","loafer","idler","shirker","layabout"],"antonyms":["hard worker","diligent person"]}],"etymology":{"value":"Origin uncertain. Possibly a shortening of 'derelict' or a blend of 'degraded' and 'alcoholic'. The Australian slang sense may have evolved independently or been influenced by the general sense of social undesirability.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɛroʊ/","syllables":"de-ro"},"inflection":{"noun_plural":"deros"},"usage_notes":{"explanation":"'Dero' is a derogatory term and should be used with caution. It carries negative connotations and can be offensive, especially when referring to homeless people or those struggling with poverty. The Australian slang sense, while less harsh, still implies disapproval of laziness or lack of motivation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a dero of the company.","correct":"✓ He's a derelict employee.","note":"'Dero' is not typically used to describe someone who has abandoned their job or responsibilities in a formal setting. 'Derelict' or other more appropriate terms should be used. "},{"incorrect":"✗ She's a very dero person.","correct":"✓ She's a very lazy person.","note":"When describing someone as lazy, it's generally better to use the adjective 'lazy' rather than the noun 'dero'. Using 'dero' as an adjective is uncommon and can sound awkward."}],"priority":"★★☆"},"related_words":{"derivatives":["derelict (adjective, noun)","degraded (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dero' is a slang term with derogatory connotations, primarily used to describe homeless individuals or, in Australian slang, lazy people. Due to its offensive nature and limited usage, it's not a common word and is generally avoided in formal contexts. Understanding its negative implications is crucial to avoid causing offense. The word's etymology is uncertain, adding to its obscurity for non-native speakers."},"example_sentences":[{"sentence":"The council is trying to provide more support for the deros in the city center.","translation":"市議会は、市の中心部の放浪者への支援を増やそうとしている。","type":"noun","meaning_category":"Homeless person"},{"sentence":"Stop being such a dero and help me clean up this mess!","translation":"怠けてないで、この散らかった場所を片付けるのを手伝って！","type":"noun","meaning_category":"Lazy person (Australian slang)"}]}