{"word":"plunderous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"略奪的な、強奪的な、不正に富を得る","english_definition":"involving or characterized by plunder; taking goods by force; characterized by unjust enrichment.","examples":[{"sentence":"The plunderous pirates raided the coastal town.","translation":"略奪的な海賊たちは沿岸の町を襲撃した。"},{"sentence":"The company engaged in plunderous practices, exploiting its workers.","translation":"その会社は労働者を搾取する略奪的な行為に関わっていた。"},{"sentence":"The museum denounced the plunderous acquisition of artifacts during the colonial era.","translation":"博物館は植民地時代における遺物の略奪的な取得を非難した。"}],"collocations":["plunderous pirates","plunderous practices","plunderous acquisition"],"synonyms":["predatory","rapacious","looting","pillaging","exploitative","avaricious"],"antonyms":["benevolent","altruistic","generous","honest","ethical"]}],"etymology":{"value":"\"Plunder\" + \"-ous\". \"Plunder\" is from Middle Dutch \"plunderen\" meaning \"to rob, pillage,\" from Middle High German \"plundern\" meaning \"to rob of clothes or baggage.\" The suffix \"-ous\" means \"full of\" or \"characterized by.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʌndərəs/","syllables":"plun-der-ous"},"inflection":{"notes":"Adjective, comparative and superlative forms are: more plunderous, most plunderous."},"usage_notes":{"explanation":"\"Plunderous\" describes something that involves or is characterized by plunder, which is the act of taking goods by force, especially during a war or raid. It can also describe practices that are exploitative and result in unjust enrichment. This word often carries a negative connotation, implying unethical or illegal behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The generous king was plunderous.","correct":"✓ The greedy king was plunderous.","note":"\"Plunderous\" implies greed and taking by force, so it doesn't align with generosity."},{"incorrect":"✗ The plunderous act was legal.","correct":"✓ The plunderous act was illegal.","note":"Plunderous acts are generally illegal and unethical."}],"priority":"★★☆"},"related_words":{"derivatives":["plunder (noun, verb)","plunderer (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"plunderous\" is a relatively uncommon adjective used to describe something characterized by plunder, which means taking goods by force, especially in a time of conflict or war. It suggests unethical or illegal acquisition of wealth or possessions. Because it is not frequently used, it is more commonly found in advanced texts or historical contexts."},"example_sentences":[{"sentence":"The museum returned the plunderous artifacts to their country of origin.","translation":"博物館は略奪された遺物を元の国に返還した。","type":"adjective","meaning_category":"略奪的な"},{"sentence":"The invaders engaged in plunderous activities throughout the conquered territory.","translation":"侵略者たちは占領地域全体で略奪行為を行った。","type":"adjective","meaning_category":"強奪的な"},{"sentence":"The government investigated the company's plunderous business dealings.","translation":"政府はその会社の不正な商取引を調査した。","type":"adjective","meaning_category":"不正に富を得る"}]}