{"word":"close-span","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築) 近接スパン、短いスパン","english_definition":"(Architecture) A short span; a span that is relatively short in comparison to other spans in the same structure.","examples":[{"sentence":"The bridge featured a series of close-spans to navigate the uneven terrain.","translation":"その橋は、不均一な地形を通過するために、一連の短いスパンを特徴としていました。"},{"sentence":"The architect designed the roof with alternating close-spans and wider spans for aesthetic appeal.","translation":"建築家は、美的魅力を出すために、短いスパンと広いスパンを交互に配置して屋根を設計しました。"}],"collocations":["bridge close-span","roof close-span","series of close-spans","alternating close-spans"],"synonyms":["short span","narrow span"],"antonyms":["long span","wide span"]},{"part_of_speech":"adjective","definition":"(建築) 近接スパンの、短いスパンの","english_definition":"(Architecture) Relating to or characterized by having short spans.","examples":[{"sentence":"The close-span construction allowed for greater stability in the earthquake-prone region.","translation":"短いスパン構造により、地震の多い地域での安定性が向上しました。"},{"sentence":"The close-span design was chosen to minimize the visual impact on the surrounding landscape.","translation":"周囲の景観への視覚的影響を最小限に抑えるために、短いスパン設計が選択されました。"}],"collocations":["close-span construction","close-span design","close-span bridge","close-span roof"],"synonyms":["short-span","narrow-span"],"antonyms":["long-span","wide-span"]}],"etymology":{"value":"The term 'close-span' is a compound word derived from 'close,' indicating proximity or shortness, and 'span,' referring to the distance between two supports in a structure.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkloʊsˌspæn/","syllables":"close-span"},"inflection":{"notes":"'Close-span' can function as both a noun and an adjective. As a noun, it can be pluralized as 'close-spans.' As an adjective, it does not change form."},"usage_notes":{"explanation":"'Close-span' is primarily used in architectural and engineering contexts to describe structures with relatively short spans between supports. It is often used to emphasize the difference in span length compared to other parts of the same structure or to alternative designs. The term is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bridge has a closed span.","correct":"✓ The bridge has a close-span.","note":"'Close-span' refers to a short span, while 'closed span' would imply a span that is blocked or inaccessible."},{"incorrect":"✗ The close span was very long.","correct":"✓ The span was relatively short.","note":"Using 'close-span' to describe something long is contradictory. Use 'close-span' to indicate that a span is short relative to other spans or typical spans."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["span","short span","long span","bridge design","structural engineering","architecture"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Close-span' is a technical term primarily used in architecture and structural engineering. It refers to a structural span that is relatively short. Understanding this term requires familiarity with architectural concepts and terminology. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The **close-span** design of the footbridge made it suitable for the narrow gorge.","translation":"歩道橋の短いスパン設計は、狭い峡谷に適していました。","type":"adjective","meaning_category":"建築設計"},{"sentence":"The series of **close-spans** allowed the bridge to follow the contours of the land.","translation":"一連の短いスパンにより、橋は地形の輪郭に沿うことができました。","type":"noun","meaning_category":"構造"},{"sentence":"The **close-span** section of the roof provided extra support over the entrance.","translation":"屋根の短いスパン部分は、入り口の上に追加のサポートを提供しました。","type":"adjective","meaning_category":"建築構造"}]}