{"word":"Demarchy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治)無作為抽出による選出を用いた政治システム","english_definition":"A political system in which policy decisions are made by randomly selected citizens who are competent in the relevant area.","examples":[{"sentence":"Some propose demarchy as an alternative to traditional democracy.","translation":"伝統的な民主主義の代替案として、デマーキーを提案する人もいます。"},{"sentence":"In a demarchy, decision-makers are chosen by lot, not by election.","translation":"デマーキーでは、意思決定者は選挙ではなく、くじ引きで選ばれます。"}],"collocations":["implement demarchy","promote demarchy","consider demarchy","demarchy system","demarchy model"],"synonyms":["sortition","lottocracy","aleatory democracy"],"antonyms":["democracy","oligarchy","autocracy","dictatorship"]}],"etymology":{"value":"The word \"demarchy\" is derived from the Greek words \"demos\" (people) and \"arche\" (rule or government). It essentially means \"rule by the people\" but in a specific way, through random selection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛmɑːrki/","syllables":"de-mar-chy"},"inflection":{"noun_plural":"demarchies"},"usage_notes":{"explanation":"Demarchy is a political system where decision-makers are selected randomly from a pool of eligible citizens, often with specific expertise or interest in the relevant policy area. This contrasts with traditional democracy, where representatives are elected. Proponents of demarchy argue that it can reduce corruption and increase citizen participation, while critics raise concerns about the competence and accountability of randomly selected officials. It is a theoretical concept and not widely implemented in practice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Demarchy is the same as democracy.","correct":"✓ Demarchy is a different system from democracy, using random selection instead of elections.","note":"Demarchy uses random selection, while democracy uses elections."},{"incorrect":"✗ Only unqualified people are selected in a demarchy.","correct":"✓ Demarchy can involve selecting people with specific expertise or interest in the relevant area.","note":"Demarchy often involves selecting people who are competent in the area of decision-making."}],"priority":"★★☆"},"related_words":{"derivatives":["demarchic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Demarchy is a less common term referring to a political system where decision-makers are chosen randomly from the citizenry. This contrasts with traditional democracy, where leaders are elected. The concept is often discussed in academic or theoretical contexts related to political science and governance. Understanding the term requires familiarity with political theory and alternative governance models."},"example_sentences":[{"sentence":"The idea of using a demarchy to select members of parliament has been proposed by some political theorists.","translation":"議会の議員を選ぶためにデマーキーを使うという考えは、一部の政治理論家によって提案されています。","type":"example","meaning_category":"political system"},{"sentence":"A demarchy aims to reduce the influence of special interests by randomly selecting decision-makers.","translation":"デマーキーは、意思決定者を無作為に選ぶことによって、特殊な利益の影響を減らすことを目指しています。","type":"example","meaning_category":"political system"}]}