{"word":"nonavoidance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"回避しないこと、非回避","english_definition":"The act or practice of not avoiding something; a deliberate choice not to avoid a situation, person, or thing.","examples":[{"sentence":"His nonavoidance of difficult conversations allowed him to resolve conflicts effectively.","translation":"彼が難しい会話を回避しなかったことが、効果的に紛争を解決することを可能にした。"},{"sentence":"The therapist encouraged nonavoidance of anxiety-provoking situations to help the patient overcome their fears.","translation":"セラピストは、患者が恐怖を克服するのを助けるために、不安を引き起こす状況を回避しないことを勧めた。"}],"collocations":["practicing nonavoidance","encourage nonavoidance","strategy of nonavoidance"],"synonyms":["confrontation","engagement","facing","approach"],"antonyms":["avoidance","evasion","shunning","circumvention"]}],"etymology":{"value":"'non-' (否定の接頭辞) + 'avoidance' (回避)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnəˈvɔɪdəns/","syllables":"non-a-void-ance"},"inflection":{"noun_plural":"nonavoidances"},"usage_notes":{"explanation":"'Nonavoidance' refers to the conscious decision or practice of not avoiding something, often something unpleasant or challenging. It is frequently used in therapeutic contexts, particularly in exposure therapy for anxiety disorders, where patients are encouraged to face their fears rather than avoid them. It implies a proactive approach to dealing with difficulties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices non-avoidance in his life.","correct":"✓ He practices nonavoidance in his life.","note":"Hyphenation is generally not needed unless it's for clarity or style. In this case, 'nonavoidance' is a single word."},{"incorrect":"✗ Nonavoidance is a good strategy to avoid problems.","correct":"✓ Nonavoidance is a good strategy to address problems.","note":"The purpose of nonavoidance is not to avoid problems but to confront or address them."}],"priority":"★★☆"},"related_words":{"derivatives":["avoidance","avoid"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonavoidance' is a more advanced term that describes the act of intentionally not avoiding something, especially something difficult or uncomfortable. It's often used in psychology to describe a strategy for dealing with anxiety or fear by facing the things that cause those feelings, rather than trying to avoid them. It's the opposite of 'avoidance,' which means to stay away from something.","priority":"★☆☆"},"example_sentences":[{"sentence":"The key to overcoming social anxiety is the nonavoidance of social situations.","translation":"社会不安を克服するための鍵は、社会的な状況を回避しないことである。","type":"general","meaning_category":"general"},{"sentence":"Through consistent nonavoidance, she was able to desensitize herself to her phobia.","translation":"継続的な非回避を通して、彼女は恐怖症に対する感受性を鈍化させることができた。","type":"therapeutic","meaning_category":"therapeutic"}]}