{"word":"spoilsmen","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に)猟官主義者、戦利品を貪る政治家、縁故採用者","english_definition":"(derogatory) a person who uses a public office or position of power for personal gain; a politician who rewards supporters with jobs and favors; a person who exploits a situation for personal advantage.","examples":[{"sentence":"The new administration was criticized for being filled with spoilsmen.","translation":"新政権は猟官主義者で満たされていると批判された。"},{"sentence":"He accused his opponent of being a spoilsman who only cared about enriching himself and his friends.","translation":"彼は対立候補を、自分自身と友人を豊かにすることしか考えていない猟官主義者だと非難した。"},{"sentence":"The spoilsmen in the government were lining their pockets with public funds.","translation":"政府内の猟官主義者たちは公的資金で私腹を肥やしていた。"}],"collocations":["spoils system (猟官制度)","political spoilsmen (政治的な猟官主義者)"],"synonyms":["opportunist","profiteer","grafter","favoritist","patronage appointee"],"antonyms":["public servant","altruist","philanthropist","reformer"],"notes":"通常、複数形で使われる (spoilsman)。政治腐敗や縁故主義を批判的に表現する際に用いられる。"}],"etymology":{"value":"「spoils」 (戦利品、略奪品) + 「men」 (人々) から構成される。勝利した政党や政治家が、支持者や関係者に役職や利益を分配する行為を、戦利品を分け与えることに例えた表現。","priority":"中"},"pronunciation":{"ipa":"/ˈspɔɪlz.mən/","syllables":"spoils-men"},"inflection":{"noun_plural":"spoilsmen"},"usage_notes":{"explanation":"「spoilsmen」は、政治的な文脈で、権力や地位を利用して個人的な利益を得る人々を指す軽蔑的な言葉です。特に、政治的な支持の見返りとして、役職や便宜を図る行為を批判する際に用いられます。この言葉は、政治腐敗、縁故主義、不正行為といったネガティブなイメージを伴います。単数形は「spoilsman」ですが、複数形で使われることが一般的です。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a spoilsman, so he is very popular.","correct":"✓ He is a spoilsman, so he is very corrupt.","note":"「spoilsman」は、良い意味では使われません。腐敗や不正行為を指す言葉なので、肯定的な文脈で使用するのは不適切です。"},{"incorrect":"✗ The spoilsman is a good leader.","correct":"✓ The spoilsman is a corrupt leader.","note":"「spoilsman」は、リーダーシップの資質とは対照的な意味合いを持ちます。腐敗したリーダーを指す言葉として使用します。"}],"priority":"中"},"related_words":{"derivatives":["spoils system (猟官制度)","spoils (戦利品、略奪品)"],"related_concepts":["patronage (後援、縁故)","nepotism (縁故主義)","corruption (腐敗)","cronyism (仲間びいき)"],"priority":"高"},"level_frequency":{"frequency_google_ngram":"低い (Low frequency) - 一般的な会話や文章ではあまり使われない。政治や歴史に関する議論で稀に見られる。","priority":"低"},"readability_explanation":{"level":"C1","text":"「spoilsmen」は、政治的な文脈で使用される専門用語に近い単語です。政治的な権力や地位を利用して個人的な利益を得る人々を指す軽蔑的な言葉であり、政治腐敗や縁故主義を批判する際に用いられます。この単語を理解するには、政治や歴史に関する知識が必要となるため、一般的には高度な読解力が必要です。"},"example_sentences":[{"sentence":"The old political machine was run by ruthless spoilsmen who cared nothing for the public good.","translation":"その古い政治機構は、公益を全く気にかけない冷酷な猟官主義者たちによって運営されていた。","type":"noun","meaning_category":"猟官主義者"},{"sentence":"The new law aimed to curb the power of spoilsmen and promote merit-based appointments.","translation":"その新しい法律は、猟官主義者の力を抑制し、能力主義に基づく任命を促進することを目的としていた。","type":"noun","meaning_category":"猟官主義者"},{"sentence":"Critics argued that the president's appointments were based on patronage rather than merit, turning his administration into a haven for spoilsmen.","translation":"批判家たちは、大統領の任命は能力ではなく縁故に基づいていると主張し、彼の政権を猟官主義者の避難所にした。","type":"noun","meaning_category":"猟官主義者"}]}