{"word":"company-verified","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"会社によって検証された、企業が確認した","english_definition":"Verified or confirmed by a company; authenticated by a business entity.","examples":[{"sentence":"This product is company-verified to meet the highest quality standards.","translation":"この製品は、最高の品質基準を満たすことが会社によって検証されています。"},{"sentence":"Only company-verified accounts can access this feature.","translation":"会社によって検証されたアカウントのみがこの機能にアクセスできます。"},{"sentence":"The information provided is company-verified and up-to-date.","translation":"提供される情報は、会社によって検証されており、最新の状態です。"}],"collocations":["company-verified account (会社によって検証されたアカウント)","company-verified information (会社によって検証された情報)","company-verified product (会社によって検証された製品)","company-verified source (会社によって検証された情報源)"],"synonyms":["authenticated","certified","validated","confirmed","official"],"antonyms":["unverified","uncertified","unofficial"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'company' (referring to a business or organization) with 'verified' (meaning to have proven the truth or accuracy of something). The combination indicates that the verification process was conducted or endorsed by a company.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌmpəni ˈvɛrɪfaɪd/","syllables":"com-pa-ny ver-i-fied"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Company-verified' is commonly used to indicate that information, products, or accounts have been authenticated or confirmed by a business entity. This implies a certain level of trust and reliability, as the company has taken responsibility for verifying the accuracy or quality of the item in question. It is often used in contexts where trust and security are important, such as online platforms, product listings, and official communications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company verified information.","correct":"✓ The company-verified information.","note":"When used as an adjective before a noun, it should be hyphenated: company-verified. When used as a verb phrase, it would be 'The company verified the information.'"},{"incorrect":"✗ This is a company verify product.","correct":"✓ This is a company-verified product.","note":"'Verified' is the past participle form used as an adjective. 'Verify' is the verb form."}],"priority":"★★☆"},"related_words":{"derivatives":["verify (verb)","verification (noun)","company (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing due to online authentication processes.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Company-verified' means that a company has checked something to make sure it's true or correct. It's often used for products, information, or accounts online to show they are trustworthy because the company has confirmed them. It's more common in business and online contexts where trust is important."},"example_sentences":[{"sentence":"The website displays a 'company-verified' badge to show that the business is legitimate.","translation":"そのウェブサイトには、企業が正当であることを示す「会社によって検証済み」のバッジが表示されています。","type":"adjective","meaning_category":"認証済み"},{"sentence":"Customers prefer to purchase company-verified products for the assurance of quality.","translation":"顧客は、品質保証のために会社によって検証された製品を購入することを好みます。","type":"adjective","meaning_category":"認証済み"},{"sentence":"The company-verified data is used for market analysis.","translation":"会社によって検証されたデータは、市場分析に使用されます。","type":"adjective","meaning_category":"認証済み"}]}