{"word":"microcardius","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person with an exceptionally small heart, either physically or metaphorically.","english_definition":"A person with an exceptionally small heart, either physically or metaphorically.","examples":[{"sentence":"The doctor diagnosed him with microcardius after the X-ray revealed an abnormally small heart.","translation":"レントゲンの結果、異常に小さい心臓が明らかになったため、医師は彼を小心臓と診断した。"},{"sentence":"His actions were so cruel; he must suffer from microcardius.","translation":"彼の行動はとても残酷だった。彼は小心臓に違いない。"}],"collocations":["diagnosed with microcardius","suffer from microcardius"],"synonyms":["small-hearted","mean-spirited","uncharitable","petty"],"antonyms":["large-hearted","generous","kind","compassionate"]}],"etymology":{"value":"Formed from the Greek roots 'micro-' (small) and 'cardius' (heart).","priority":"N/A"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈkɑːrdiəs/","syllables":"mi-cro-car-di-us"},"inflection":{"noun_plural":"microcardiuses"},"usage_notes":{"explanation":"The term 'microcardius' is not a standard medical term but is used informally, often humorously or critically, to describe someone lacking in compassion or generosity. It can also refer literally to an abnormally small heart, though this is rare.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He has microcardius, so he is very healthy.","correct":"✓ He has microcardius, which explains his lack of empathy.","note":"Microcardius, if used in a literal medical sense, would indicate a health problem, not good health. More commonly, it's used metaphorically to describe someone lacking empathy."}],"priority":"N/A"},"related_words":{"derivatives":["microcardia (the condition of having a small heart)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Microcardius' is a rare and specialized term, primarily used in informal or metaphorical contexts to describe someone lacking compassion. Its literal medical usage is infrequent. Understanding requires knowledge of Greek roots and nuanced figurative language."},"example_sentences":[{"sentence":"His miserly behavior suggested a severe case of microcardius.","translation":"彼のケチな行動は、重度の小心臓症を示唆していた。","type":"noun","meaning_category":"metaphorical"},{"sentence":"The autopsy revealed no signs of microcardius, despite his reputation for coldness.","translation":"検死の結果、彼の冷酷な評判にもかかわらず、小心臓の兆候は見られなかった。","type":"noun","meaning_category":"literal/medical"}]}