{"word":"underwork","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を過小評価して扱う、(仕事)を十分にしない、(機械など)を定格より低い能力で運転する","english_definition":"to treat (someone) unfairly by not giving them enough work or responsibility; to not work hard enough at (a job); to operate (a machine or system) below its rated capacity.","examples":[{"sentence":"The manager was accused of underworking his junior staff by giving them only menial tasks.","translation":"そのマネージャーは、部下のスタッフに雑用ばかりさせて過小評価していると非難された。"},{"sentence":"He was underworking the project, resulting in delays and poor quality.","translation":"彼はそのプロジェクトを十分にこなしていなかったため、遅延や品質低下につながった。"},{"sentence":"The engine was underworked to prolong its lifespan.","translation":"エンジンの寿命を延ばすために、定格より低い能力で運転されていた。"}],"collocations":["underwork staff (スタッフを過小評価する)","underwork a project (プロジェクトを十分にこなさない)","underwork equipment (機器を定格より低い能力で運転する)"],"synonyms":["underutilize","underemploy","undervalue","neglect","slack off"],"antonyms":["overwork","overutilize","overemploy","value","maximize"]},{"part_of_speech":"noun","definition":"過小労働、不十分な仕事、能力以下の稼働","english_definition":"the state of being underworked; insufficient work; operation below capacity.","examples":[{"sentence":"The factory's underwork led to significant financial losses.","translation":"工場の稼働率低下は、大きな経済的損失につながった。"},{"sentence":"The employee complained about the underwork and lack of challenging assignments.","translation":"従業員は、仕事が少なく、やりがいのある課題がないことを不満に思った。"}],"collocations":["factory underwork (工場の稼働率低下)","employee underwork (従業員の過小労働)"],"synonyms":["underutilization","underemployment","inactivity","idleness"],"antonyms":["overwork","overutilization","activity"]}],"etymology":{"value":"'Under-' (below, less than) + 'work' (to perform labor or effort).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈwɜːrk/","syllables":"un-der-work"},"inflection":{"verb_forms":{"present_simple":["underwork","underworks"],"past_simple":"underworked","past_participle":"underworked","present_participle":"underworking"},"noun_plural":"underworks"},"usage_notes":{"explanation":"'Underwork' implies a failure to utilize resources or effort effectively, either in terms of human labor or mechanical capacity. It often suggests a deliberate choice to operate below potential, sometimes with negative consequences. The noun form refers to the state or condition resulting from this underutilization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is underworking because he is lazy.","correct":"✓ He is underperforming because he is lazy.","note":"'Underwork' refers to the act of not providing enough work or not utilizing resources properly. 'Underperform' refers to doing a job poorly or below expectations. If the person is simply not doing their job well, 'underperforming' is more appropriate."},{"incorrect":"✗ The machine is underworking.","correct":"✓ The machine is being underworked. / ✓ The machine is operating below capacity.","note":"When referring to a machine, it's more common to say 'the machine is being underworked' (passive voice) or 'the machine is operating below capacity' rather than simply 'the machine is underworking'."}],"priority":"★★☆"},"related_words":{"derivatives":["underworked (adjective: not given enough work or responsibility; operated below capacity)"],"phrasal_verbs":[],"related_concepts":["understaffed (人手不足の)","underfunded (資金不足の)","underdeveloped (未開発の)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underwork' is a relatively uncommon word that describes the act of not providing enough work to someone, not working hard enough at a job, or operating a machine below its capacity. It implies a failure to utilize resources or effort effectively. The word is often used in professional or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The company was accused of underworking its employees by not providing them with enough projects.","translation":"その会社は、従業員に十分なプロジェクトを提供せず、過小評価していると非難された。","type":"verb","meaning_category":"過小評価して扱う"},{"sentence":"The machine was underworked to reduce wear and tear.","translation":"摩耗を減らすために、機械は定格より低い能力で運転されていた。","type":"verb","meaning_category":"定格より低い能力で運転する"},{"sentence":"The underwork in the factory led to decreased productivity.","translation":"工場での稼働率低下は、生産性の低下につながった。","type":"noun","meaning_category":"過小労働"}]}