{"word":"superfuse","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過剰に融合させる、過度に一体化させる","english_definition":"To fuse or unite excessively; to blend or integrate beyond what is necessary or desirable.","examples":[{"sentence":"The artist attempted to superfuse elements from different cultures, resulting in a confusing and incoherent piece.","translation":"そのアーティストは異なる文化の要素を過剰に融合させようとした結果、混乱してまとまりのない作品になった。"},{"sentence":"The software developers superfused functionalities from various programs, making the user interface overly complex.","translation":"そのソフトウェア開発者は様々なプログラムの機能を過剰に融合させ、ユーザーインターフェースを過度に複雑にした。"}],"collocations":["superfuse elements","superfuse functionalities","superfuse ideas","superfuse styles"],"synonyms":["over-integrate","over-blend","over-merge","over-unite"],"antonyms":["separate","differentiate","distinguish","divide"]}],"etymology":{"value":"'super-' (above, beyond) + 'fuse' (to join or blend). Indicates a fusion that is excessive or goes beyond normal or desirable limits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈfjuːz/","syllables":"su-per-fuse"},"inflection":{"verb_forms":{"present_simple":["superfuse","superfuses"],"past_simple":"superfused","past_participle":"superfused","present_participle":"superfusing"}},"usage_notes":{"explanation":"'Superfuse' implies a negative outcome due to excessive fusion. It suggests that the elements or components being joined would have been better kept separate or integrated to a lesser degree. The term is relatively rare and often used in technical or artistic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef superfused the ingredients, creating a delicious dish.","correct":"✓ The chef carefully blended the ingredients, creating a delicious dish.","note":"'Superfuse' typically implies a negative outcome. If the blending was successful, 'blend', 'fuse', or 'combine' would be more appropriate."},{"incorrect":"✗ The company plans to superfuse its departments for better efficiency.","correct":"✓ The company plans to integrate its departments for better efficiency.","note":"If the intention is simply to integrate without the implication of excessiveness, 'integrate' is a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["superfusion (noun): The act of superfusing; excessive fusion."],"related_terms":["fuse","fusion","integrate","blend","merge"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency - not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Superfuse' is a relatively rare word that describes the act of combining or blending elements to an excessive degree, often resulting in a negative outcome. It is typically used in technical or artistic contexts to indicate that the integration has gone too far, leading to confusion or incoherence. Due to its specialized meaning and low frequency, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The director superfused too many plot lines into the movie, making it difficult to follow.","translation":"監督は映画に多くのプロットラインを過剰に融合させたため、内容を追うのが難しくなった。","type":"verb (vt)","meaning_category":"過剰な融合"},{"sentence":"The architect superfused modern and classical styles, resulting in a building that looked disjointed.","translation":"建築家は現代と古典のスタイルを過剰に融合させたため、建物はまとまりがないように見えた。","type":"verb (vt)","meaning_category":"過剰な融合"}]}