{"word":"charm-built","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Built or constructed in a way that is intended to be charming or attractive.","english_definition":"Constructed or designed to exude charm and attractiveness.","examples":[{"sentence":"The cottage was charm-built with its thatched roof and flower-filled window boxes.","translation":"そのコテージは、茅葺き屋根と花でいっぱいの窓辺で、魅力的に建てられていました。"},{"sentence":"The developers aimed for a charm-built aesthetic in the new neighborhood, emphasizing traditional architectural details.","translation":"開発者は、新しい近隣地域で魅力的な美学を目指し、伝統的な建築のディテールを強調しました。"}],"collocations":["charm-built cottage","charm-built neighborhood","charm-built aesthetic"],"synonyms":["attractively constructed","delightfully designed","quaintly built","picturesquely constructed"],"antonyms":["plainly built","unattractively constructed","functionally built"]}],"etymology":{"value":"Derived from the combination of 'charm' (the quality of pleasing or delighting) and 'built' (past participle of 'build', indicating construction). The term suggests that the construction was intentionally designed to evoke a sense of charm.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtʃɑːrmˌbɪlt/","syllables":"charm-built"},"inflection":{"notes":"This is a compound adjective, so it doesn't have typical inflectional forms like comparative or superlative degrees."},"usage_notes":{"explanation":"'Charm-built' is an adjective used to describe something that has been constructed or designed with the specific intention of being charming or attractive. It often implies attention to detail and a focus on aesthetic appeal rather than purely functional considerations. It is not a very common word, but it is easily understood due to its straightforward composition.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was charm-building.","correct":"✓ The house was charm-built.","note":"'Charm-built' is an adjective, not a verb. Use it to describe the state of being built with charm, not the act of building with charm."}],"priority":"N/A"},"related_words":{"derivatives":["charm (noun)","charming (adjective)","build (verb)","builder (noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Charm-built' is a compound adjective that describes something constructed or designed to be charming. It's not a commonly used term, but its meaning is relatively straightforward to understand based on its components: 'charm' (attractive quality) and 'built' (constructed). The term is often used in descriptions of architecture or design where aesthetic appeal is a primary consideration."},"example_sentences":[{"sentence":"The charm-built guesthouse offered a cozy retreat for weary travelers.","translation":"魅力的に建てられたゲストハウスは、疲れた旅行者にとって居心地の良い隠れ家を提供しました。","type":"adjective","meaning_category":"attractively constructed"},{"sentence":"The town's charm-built architecture attracts tourists from around the world.","translation":"その町の魅力的に建てられた建築は、世界中から観光客を引きつけます。","type":"adjective","meaning_category":"attractively constructed"}]}