{"word":"Sabbatine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Roman Catholicism) Of or pertaining to the Sabbatine Privilege, a papal indulgence associated with devotion to the Blessed Virgin Mary of Mount Carmel.","english_definition":"Relating to the Sabbatine Privilege, a belief and practice in Roman Catholicism.","examples":[{"sentence":"Sabbatine devotion is associated with the scapular of Our Lady of Mount Carmel.","translation":"サバティーヌの信心は、カルメル山の聖母のスカプラリオと関連付けられています。"}],"collocations":["Sabbatine Privilege","Sabbatine Indulgence","Sabbatine devotion"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the word Sabbath, possibly referencing a Saturday release from Purgatory according to the Sabbatine Privilege.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæbəˌtiːn/","syllables":"Sab-ba-tine"},"inflection":{},"usage_notes":{"explanation":"The term 'Sabbatine' is almost exclusively used in the context of Roman Catholic theology and devotion, specifically concerning the Sabbatine Privilege. This privilege is a disputed indulgence promising deliverance from Purgatory on the first Saturday after death for those who wear the Brown Scapular of Our Lady of Mount Carmel, observe chastity according to their state in life, and recite the Little Office of the Blessed Virgin, or abstain from meat on Wednesdays while additionally observing Fridays and Saturdays.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Sabbatine Jew.","correct":"✓ He was a Sabbath-observing Jew.","note":"'Sabbatine' refers specifically to the Catholic Sabbatine Privilege, not to Jewish Sabbath observance. Use 'Sabbath-observing' for Jewish contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["Sabbat (noun)","Sabbatical (adjective, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized religious term)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Sabbatine' is a highly specialized term primarily used within Roman Catholic theological discussions. It refers almost exclusively to the Sabbatine Privilege, a specific belief related to the wearing of the Brown Scapular and certain devotional practices promising early release from Purgatory. Due to its limited and specific context, it is not a term commonly encountered in general English usage."},"example_sentences":[{"sentence":"The Sabbatine Privilege has been a subject of debate within the Catholic Church.","translation":"サバティーヌの特権は、カトリック教会内で議論の対象となってきました。","type":"adjective","meaning_category":"Religious"},{"sentence":"Some Catholics practice Sabbatine devotion to honor the Virgin Mary.","translation":"一部のカトリック教徒は、聖母マリアを敬うためにサバティーヌの信心を行っています。","type":"adjective","meaning_category":"Religious"}]}