{"word":"aribine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アリビン：特定の植物（通常は熱帯地域に自生する）から抽出される化学物質の総称、または特定の種類のアルカロイドを指す可能性がある。具体的な植物種や化学構造に関する情報は、文脈によって異なる。","english_definition":"A general term that may refer to a chemical substance extracted from certain plants (typically those native to tropical regions), or to a specific type of alkaloid. Information regarding the specific plant species or chemical structure may vary depending on the context.","examples":[{"sentence":"Research is being conducted to determine the potential medicinal properties of aribine extracted from the leaves of the *XYZ* plant.","translation":"XYZ植物の葉から抽出されたアリビンの潜在的な薬効を特定するための研究が行われている。"},{"sentence":"The presence of aribine in the plant extract suggests possible anti-inflammatory effects.","translation":"植物抽出物中のアリビンの存在は、抗炎症効果の可能性を示唆している。"}],"collocations":["extract aribine","aribine extract","medicinal properties of aribine","anti-inflammatory effects of aribine"],"synonyms":["alkaloid (アルカロイド)","plant extract (植物抽出物)","phytochemical (植物化学物質)"],"antonyms":[]}],"etymology":{"value":"語源に関する情報は限られている。おそらく、この物質が最初に発見された植物種に関連する名前から派生したものと思われる。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈærɪbiːn/","syllables":"a-ri-bine"},"inflection":{"notes":"可算名詞"},"usage_notes":{"explanation":"「aribine」は、特定の植物由来の化学物質を指す専門用語であるため、一般的な会話ではほとんど使用されない。科学論文、植物学の研究、または薬理学の文脈で遭遇する可能性が高い。具体的な意味は、参照している植物または化学構造によって異なるため、文脈を考慮することが重要である。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Aribine is a common household ingredient.","correct":"✓ Aribine is a chemical compound found in certain plants.","note":"アリビンは一般的な家庭用品ではない。特定の植物に含まれる化学物質である。"},{"incorrect":"✗ The doctor prescribed aribine for my headache.","correct":"✓ The doctor prescribed medication for my headache. (Unless the medication specifically contains aribine, this would be incorrect.)","note":"アリビンは一般的な医薬品ではない。特定の研究または伝統医学の文脈で使用される可能性がある。"}],"priority":"★☆☆"},"related_words":{"derivatives":["aribinol (アリビノール - 関連する可能性のある化学物質)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A（非常に専門的な用語のため）","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「aribine」は、植物化学、薬理学、または関連分野の専門家が使用する可能性のある非常に専門的な用語です。一般の読者が遭遇することはほとんどありません。この単語を理解するには、植物由来の化学物質に関する高度な知識が必要です。"},"example_sentences":[{"sentence":"The study focused on the isolation and characterization of aribine from the *GenusSpecies* plant.","translation":"その研究は、*GenusSpecies*植物からのアリビンの分離と特性評価に焦点を当てた。","type":"scientific research","meaning_category":"chemical substance"},{"sentence":"Aribine derivatives are being investigated for their potential therapeutic applications.","translation":"アリビン誘導体は、その潜在的な治療応用について研究されている。","type":"pharmacology","meaning_category":"alkaloid"}]}