{"word":"archaize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"古風になる、古めかしくなる","english_definition":"to become archaic; to take on archaic characteristics.","examples":[{"sentence":"The language in the novel began to archaize, making it difficult to understand.","translation":"その小説の言葉遣いは古風になり始め、理解するのが難しくなった。"}],"collocations":[],"synonyms":["become obsolete","become outdated"],"antonyms":["modernize","update"]},{"part_of_speech":"verb","transitivity":"vt","definition":"古風にする、古めかしくする","english_definition":"to give an archaic quality to; to imitate or reproduce archaic features in.","examples":[{"sentence":"The author deliberately archaized the dialogue to create a historical atmosphere.","translation":"著者は意図的に対話を古風にして、歴史的な雰囲気を作り出した。"},{"sentence":"The artist archaized his style by using techniques from the Renaissance.","translation":"その芸術家はルネサンス時代の技法を用いることで、自身のスタイルを古風にした。"}],"collocations":["archaize language","archaize style"],"synonyms":["make archaic","make old-fashioned","antiquate"],"antonyms":["modernize","update","streamline"]}],"etymology":{"value":"From 'archaic' + '-ize'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrki.aɪz/","syllables":"ar-cha-ize"},"inflection":{"verb_forms":{"present_simple":["archaize","archaizes"],"past_simple":"archaized","past_participle":"archaized","present_participle":"archaizing"}},"usage_notes":{"explanation":"'Archaize' refers to the process of something becoming archaic (old-fashioned) or making something appear archaic. It can apply to language, style, or other cultural elements. It is often a deliberate choice to evoke a sense of history or tradition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was archaizing by the rain.","correct":"✓ The building was being archaized by the recent renovations.","note":"'Archaize' is not typically caused by natural elements like rain. It usually refers to intentional efforts to make something appear old or outdated."}],"priority":"★☆☆"},"related_words":{"derivatives":["archaism (名詞: 古語、古風な表現)","archaic (形容詞: 古風な、時代遅れの)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archaize' is a relatively uncommon word that means to make something old-fashioned or to become old-fashioned. It is often used in discussions about language, literature, or art where there is a deliberate attempt to imitate or evoke a past style or period. Understanding this word requires a good vocabulary and familiarity with discussions about style and historical periods."},"example_sentences":[{"sentence":"The writer archaized the prose to give the novel a Victorian feel.","translation":"作家は散文を古風にして、その小説にヴィクトリア朝の雰囲気を与えた。","type":"verb","meaning_category":"古風にする"},{"sentence":"Over time, the dialect began to archaize, diverging from the standard language.","translation":"時が経つにつれて、その方言は古風になり始め、標準語から逸脱していった。","type":"verb","meaning_category":"古風になる"}]}