{"word":"Intoxicatedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"酩酊状態、陶酔状態、中毒状態","english_definition":"The state of being intoxicated; inebriation; the condition of being poisoned or overwhelmed by a substance or emotion.","examples":[{"sentence":"His intoxicatedness was evident in his slurred speech and unsteady gait.","translation":"彼の酩酊状態は、不明瞭な話し方と不安定な歩き方にはっきりと表れていた。"},{"sentence":"The intoxicatedness of the crowd was palpable as the band played their final song.","translation":"バンドが最後の曲を演奏するにつれて、群衆の陶酔状態は明白になった。"},{"sentence":"She described the intoxicatedness she felt when she first fell in love.","translation":"彼女は初めて恋に落ちた時に感じた陶酔状態を説明した。"}],"collocations":["degree of intoxicatedness (酩酊の度合い)","level of intoxicatedness (酩酊のレベル)","signs of intoxicatedness (酩酊の兆候)","state of intoxicatedness (酩酊状態)"],"synonyms":["inebriation","drunkenness","tipsiness","inebriety","intoxication","ebriety","befuddlement","stupefaction","delirium","exaltation","euphoria","mania","frenzy"],"antonyms":["sobriety","clearmindedness","clearheadedness","abstinence","temperance"]}],"etymology":{"value":"Formed from 'intoxicated' (past participle of 'intoxicate') + '-ness' (suffix denoting a state or condition). 'Intoxicate' comes from Medieval Latin 'intoxicatus,' past participle of 'intoxicare' ('to poison'), from Latin 'toxicum' ('poison').","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtɒksɪkeɪtɪdnəs/","syllables":"in-tox-i-cat-ed-ness"},"inflection":{"noun_plural":"intoxicatednesses (rarely used)"},"usage_notes":{"explanation":"'Intoxicatedness' is a formal and somewhat uncommon noun that describes the state of being intoxicated, whether by alcohol, drugs, or strong emotions. While 'intoxication' is a more frequently used synonym, 'intoxicatedness' can emphasize the ongoing condition or degree of being intoxicated. It's often used in technical or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a high intoxicatedness after the party.","correct":"✓ He showed a high level of intoxicatedness after the party. / ✓ He was highly intoxicated after the party.","note":"'Intoxicatedness' is a noun, so it's more appropriate to use it with a quantifier like 'level' or 'degree.' Alternatively, use the adjective 'intoxicated' with an adverb like 'highly.'"},{"incorrect":"✗ The intoxicatedness made him happy.","correct":"✓ The intoxicatedness made him feel euphoric.","note":"While 'intoxicatedness' can be associated with positive emotions, it primarily refers to the state of being affected by a substance or emotion. Using more specific terms like 'euphoric' can provide a clearer description of the feeling."}],"priority":"★☆☆"},"related_words":{"derivatives":["intoxicate (verb)","intoxicated (adjective)","intoxicating (adjective)","intoxication (noun)"],"phrases":["under the influence (of alcohol/drugs)","drunk and disorderly"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and technical)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Intoxicatedness' is a relatively rare and formal word that describes the state of being intoxicated. It is similar to 'intoxication' but is less commonly used. This word is more likely to be found in technical or descriptive writing rather than everyday conversation. Understanding the word requires a strong vocabulary and familiarity with abstract nouns. It is often used to describe the degree or level of intoxication. It is important to note that more common synonyms like 'drunkenness' or 'inebriation' are generally preferred in most contexts."},"example_sentences":[{"sentence":"The medical report detailed the patient's level of intoxicatedness upon arrival at the hospital.","translation":"医療報告書は、患者が病院に到着した際の酩酊のレベルを詳細に記述した。","type":"noun","meaning_category":"酩酊状態"},{"sentence":"The intoxicatedness of the revelers was amplified by the loud music and flashing lights.","translation":"騒ぎ立てる人々の陶酔状態は、大音量の音楽と点滅する光によって増幅された。","type":"noun","meaning_category":"陶酔状態"},{"sentence":"Her intoxicatedness with the idea blinded her to its potential flaws.","translation":"その考えに対する彼女の陶酔状態は、その潜在的な欠点を見えなくさせた。","type":"noun","meaning_category":"中毒状態"}]}