{"word":"unspiritually","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"精神的にではなく、霊的でない方法で","english_definition":"In a manner that is not spiritual; without spiritual qualities or considerations.","examples":[{"sentence":"He approached the problem unspiritually, focusing only on the material aspects.","translation":"彼はその問題に精神性を持たずに取り組み、物質的な側面のみに焦点を当てた。"},{"sentence":"She lived unspiritually, neglecting her inner self and values.","translation":"彼女は精神性を無視して生き、内なる自己や価値観を軽視した。"}],"collocations":["live unspiritually","approach unspiritually","act unspiritually"],"synonyms":["materially","secularly","worldly","profanely"],"antonyms":["spiritually","religiously","piously"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the adverb 'spiritually'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈspɪrɪtʃuəli/","syllables":"un-spir-it-u-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Unspiritually' describes actions, behaviors, or approaches that lack a spiritual dimension or focus. It implies a concentration on material or secular concerns rather than inner values, faith, or a connection to something greater than oneself. It is the opposite of acting 'spiritually,' which involves considering moral, ethical, or religious principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He unspiritually felt sad.","correct":"✓ He felt sad in an unspiritual way.","note":"'Unspiritually' modifies the verb, describing the manner of action, not the feeling itself. It's better to rephrase to clarify the meaning. "},{"incorrect":"✗ She is unspiritually.","correct":"✓ She is not spiritual.","note":"'Unspiritually' is an adverb, not an adjective. To describe a person's state, use the adjective 'unspiritual' or a phrase like 'not spiritual'."}],"priority":"★★☆"},"related_words":{"derivatives":["spiritual","spirituality","unspiritual"],"phrases":["in an unspiritual manner","without spiritual consideration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unspiritually' is relatively uncommon and is used to describe actions or behaviors that are devoid of spiritual qualities or considerations. It suggests a focus on material or secular aspects rather than inner values or a connection to something greater. It is the antonym of 'spiritually' and is typically used in more formal or philosophical contexts."},"example_sentences":[{"sentence":"The company's decisions were made unspiritually, with no regard for the employees' well-being.","translation":"その会社の決定は精神性を持たずに行われ、従業員の幸福は考慮されなかった。","type":"adverb","meaning_category":"lack of spiritual consideration"},{"sentence":"He approached his work unspiritually, seeing it only as a means to an end.","translation":"彼は仕事に精神性を持たずに取り組み、それを単なる目的のための手段としか見ていなかった。","type":"adverb","meaning_category":"material focus"}]}