{"word":"genecology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物の個体群の遺伝的構成と、その生態学的環境との関係を研究する生態学の一分野。","english_definition":"The branch of ecology concerned with the genetic constitution of plant populations in relation to their habitats.","examples":[{"sentence":"Genecology studies the adaptation of plant populations to different environmental conditions.","translation":"遺伝生態学は、植物個体群の異なる環境条件への適応を研究する。"}],"collocations":["plant genecology","population genecology","evolutionary genecology"],"synonyms":["ecological genetics","population genetics","evolutionary ecology"],"antonyms":[]}],"etymology":{"value":"「gene（遺伝子）」と「ecology（生態学）」の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiːnɪˈkɒlədʒi/","syllables":"ge-ne-col-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Genecology is a specialized field within ecology and genetics, focusing specifically on the genetic variation within plant populations and how this variation relates to their environment. It often involves studying ecotypes, which are genetically distinct populations adapted to specific local conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Genecology is the study of animal populations.","correct":"✓ Genecology is the study of plant populations.","note":"Genecology specifically focuses on plant populations, not animal populations."}],"priority":"★★☆"},"related_words":{"derivatives":["genecological (adjective)"],"phrases":["ecotype","ecological adaptation","population genetics"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Genecology is a specialized term used in advanced studies of ecology and genetics. It's not commonly encountered outside of academic or research contexts. Understanding this term requires a solid foundation in both ecology and genetics."},"example_sentences":[{"sentence":"The genecology of this species reveals significant local adaptation.","translation":"この種の遺伝生態学は、重要な局所適応を明らかにしている。","type":"scientific","meaning_category":"study of plant populations"},{"sentence":"Studies in genecology help us understand how plants evolve in response to environmental pressures.","translation":"遺伝生態学の研究は、植物が環境圧に応じてどのように進化するかを理解するのに役立つ。","type":"scientific","meaning_category":"evolutionary adaptation"}]}