{"word":"short-headed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人や動物が)短頭の、頭の幅が広い","english_definition":"Having a head that is broad in proportion to its length; brachycephalic. Used of people and animals.","examples":[{"sentence":"The breed is known for its short-headed appearance.","translation":"その品種は短頭の外見で知られている。"},{"sentence":"Short-headed dogs are prone to certain respiratory problems.","translation":"短頭の犬は特定の呼吸器系の問題を起こしやすい。"}],"collocations":["short-headed breed","short-headed dog","short-headed cat"],"synonyms":["brachycephalic"],"antonyms":["long-headed","dolichocephalic"]},{"part_of_speech":"adjective","definition":"(俗語、侮蔑的)頭の悪い、愚かな、思慮深くない","english_definition":"(Slang, derogatory) Stupid; unintelligent; lacking in foresight or good judgment.","examples":[{"sentence":"Don't be so short-headed! Think before you act.","translation":"そんなに頭が悪くならないで！行動する前に考えなさい。"},{"sentence":"That was a short-headed decision.","translation":"それは思慮の足りない決定だった。"}],"collocations":["short-headed decision","short-headed idea","short-headed move"],"synonyms":["stupid","foolish","unintelligent","brainless","thoughtless","shortsighted"],"antonyms":["intelligent","smart","clever","thoughtful","wise"]}],"etymology":{"value":"The term is a compound of 'short' and 'headed,' literally referring to the physical characteristic of having a short head. The figurative meaning likely arose from the association of physical appearance with intelligence or lack thereof.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʃɔːrtˈhedɪd/","syllables":"short-head-ed"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more short-headed' and 'most short-headed', respectively, although these are not commonly used."},"usage_notes":{"explanation":"The term 'short-headed' has two distinct meanings. The first is a literal description of head shape, primarily used in zoology and anthropology. The second is a derogatory term for someone considered unintelligent or foolish. The slang usage is considered offensive and should be used with caution. When referring to animals, it is a neutral descriptive term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a short-headed person because he's physically small.","correct":"✓ He's a short person.","note":"'Short-headed' refers to head shape or intelligence, not overall height."},{"incorrect":"✗ The short-headed dog is very smart.","correct":"✓ The dog is short-headed. / ✓ The dog is not very smart.","note":"The adjective describes a physical characteristic. If intending to convey lack of intelligence, consider using a different word."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["brachycephalic","long-headed","dolichocephalic"]},"level_frequency":{"CEFR":"N/A (low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'short-headed' has two meanings, one literal and one figurative. The literal meaning describes a head shape that is broad relative to its length, a term used in zoology and anthropology. The figurative meaning is a derogatory term for someone considered unintelligent. The figurative meaning is informal and potentially offensive. Context is crucial for understanding the intended meaning. The literal meaning is technical and less common in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The veterinarian noted the bulldog's short-headed features.","translation":"獣医はブルドッグの短頭の特徴に注目した。","type":"adjective","meaning_category":"Describing head shape"},{"sentence":"That was a short-headed thing to do; you should have thought it through.","translation":"それは思慮の足りない行動だった。もっとよく考えるべきだった。","type":"adjective","meaning_category":"Stupid/unintelligent"}]}