{"word":"Spiegeleisen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鏡鉄鉱、含マンガン銑鉄","english_definition":"A type of pig iron containing a high percentage of manganese, used in the manufacture of steel.","examples":[{"sentence":"Spiegeleisen is added to molten steel to remove oxygen and sulfur.","translation":"鏡鉄鉱は溶鋼に添加され、酸素と硫黄を除去する。"}],"collocations":["add Spiegeleisen","use Spiegeleisen","Spiegeleisen addition"],"synonyms":["manganese pig iron"],"antonyms":[]}],"etymology":{"value":"From German Spiegeleisen, from Spiegel (mirror) + Eisen (iron), referring to its shiny, crystalline fracture surface.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃpiːɡəlˌʔaɪzən/","syllables":"Spie-gel-ei-sen"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Spiegeleisen is a historical term for a specific type of pig iron used in steelmaking. It's primarily of interest in the context of metallurgy and the history of steel production.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pig iron","manganese","steelmaking","metallurgy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Spiegeleisen is a highly specialized term primarily encountered in the fields of metallurgy and materials science, particularly in discussions of historical steelmaking processes. It refers to a specific type of pig iron with a high manganese content. Due to its niche usage, it is unlikely to be encountered outside of technical contexts. Understanding requires familiarity with metallurgical terminology and steel production techniques."},"example_sentences":[{"sentence":"The Bessemer process benefited greatly from the use of Spiegeleisen.","translation":"ベッセマー法は、鏡鉄鉱の使用により大きく恩恵を受けた。","type":"noun","meaning_category":"含マンガン銑鉄"},{"sentence":"Early steelmakers found that adding Spiegeleisen improved the quality of their steel.","translation":"初期の製鋼業者は、鏡鉄鉱を添加することで鋼の品質が向上することを発見した。","type":"noun","meaning_category":"含マンガン銑鉄"}]}