{"word":"one-lunger","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(俗語)単気筒エンジン","english_definition":"(slang) A single-cylinder engine.","examples":[{"sentence":"My old motorcycle has a one-lunger engine.","translation":"私の古いバイクは単気筒エンジンを搭載しています。"},{"sentence":"One-lungers are known for their simplicity and reliability.","translation":"単気筒エンジンはそのシンプルさと信頼性で知られています。"}],"collocations":["old one-lunger","reliable one-lunger"],"synonyms":["thumper","single-cylinder engine"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語、軽蔑的)肺活量の少ない人、息切れしやすい人","english_definition":"(slang, derogatory) A person with poor lung capacity or who is easily winded.","examples":[{"sentence":"He's such a one-lunger; he can't even walk up a flight of stairs without getting winded.","translation":"彼は本当に肺活量が少ない。階段を一段上るだけでも息切れしてしまう。"}],"collocations":["out-of-shape one-lunger"],"synonyms":["winded person","asthmatic"],"antonyms":[]}],"etymology":{"value":"A compound word combining \"one\" and \"lunger,\" referring to something (like an engine) that operates with a single \"lung\" or cylinder.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwʌnˌlʌŋər/","syllables":"one-lung-er"},"inflection":{"noun_plural":"one-lungers"},"usage_notes":{"explanation":"The term \"one-lunger\" has two primary meanings. The first, and more common, refers to a single-cylinder engine, often used in older motorcycles or small machinery. The second meaning is a derogatory term for someone with poor lung capacity or who easily gets out of breath. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ My car is a one-lunger.","correct":"✓ My car has a one-lunger engine.","note":"Cars typically do not have single-cylinder engines. This term is more commonly used for motorcycles or small machinery."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["single-cylinder","engine","motorcycle"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (slang/technical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"one-lunger\" is an informal term that can refer to either a single-cylinder engine or, derogatorily, to someone with poor lung capacity. Its usage is relatively uncommon and context-dependent. Understanding the context is crucial to interpreting the intended meaning. The term is not typically found in formal or academic settings.","priority":"★★☆"},"example_sentences":[{"sentence":"The old tractor had a reliable one-lunger engine.","translation":"その古いトラクターは信頼性の高い単気筒エンジンを搭載していた。","type":"noun","meaning_category":"Single-cylinder engine"},{"sentence":"After running just a short distance, he was breathing heavily; he's such a one-lunger.","translation":"ほんの少し走っただけで、彼は激しく息を切らしていた。彼は本当に肺活量が少ない。","type":"noun","meaning_category":"Person with poor lung capacity"}]}