{"word":"pyranometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"日射計、全天日射計：太陽からの全天日射量（直達日射と散乱日射の合計）を測定する機器","english_definition":"An instrument for measuring total solar radiation (both direct and diffuse) received from the entire hemisphere.","examples":[{"sentence":"The pyranometer is used to measure the amount of solar energy available at a particular location.","translation":"日射計は、特定の場所で利用可能な太陽エネルギーの量を測定するために使用されます。"},{"sentence":"Data from the pyranometer is essential for solar power plant design.","translation":"日射計からのデータは、太陽光発電所の設計に不可欠です。"},{"sentence":"The research team installed a pyranometer on the roof to monitor solar irradiance.","translation":"研究チームは、太陽放射照度を監視するために屋根に日射計を設置しました。"}],"collocations":["install a pyranometer (日射計を設置する)","pyranometer data (日射計データ)","calibrate a pyranometer (日射計を校正する)","measure solar radiation with a pyranometer (日射計で太陽放射を測定する)"],"synonyms":["solar radiation sensor","irradiance meter"],"antonyms":[]}],"etymology":{"value":"「pyro-」（火、熱）+「ano-」（上向き）+「-meter」（測定器）の組み合わせ。ギリシャ語の「pyr」（火）、「ano」（上に）、「metron」（測定）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪrəˈnɒmɪtər/","syllables":"py-ra-nom-e-ter"},"inflection":{"noun_plural":"pyranometers"},"usage_notes":{"explanation":"Pyranometers are typically used in meteorological studies, climate monitoring, and solar energy applications. They measure the total solar radiation incident on a surface, which is crucial for determining the efficiency of solar panels and for understanding climate patterns. The instrument usually consists of a thermopile sensor covered by one or two glass domes, which allows for the measurement of radiation from all directions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyranometer measures only direct sunlight.","correct":"✓ The pyranometer measures both direct and diffuse sunlight.","note":"Pyranometers measure total solar radiation, which includes both direct and diffuse components. Direct sunlight comes directly from the sun, while diffuse sunlight is scattered by the atmosphere."},{"incorrect":"✗ A pyrheliometer is the same as a pyranometer.","correct":"✓ A pyrheliometer measures direct solar radiation, while a pyranometer measures total solar radiation.","note":"A pyrheliometer measures only direct solar radiation, while a pyranometer measures both direct and diffuse solar radiation. They are different instruments used for different purposes."}],"priority":"★★☆"},"related_words":{"derivatives":["pyranometry (名詞：日射測定法)"],"related_terms":["pyrheliometer (直達日射計)","radiometer (放射計)","albedometer (アルベドメーター)","solar radiation (太陽放射)","irradiance (放射照度)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **pyranometer** is a scientific instrument used to measure the amount of solar radiation that reaches a surface. It's important in fields like meteorology, climate science, and solar energy, where understanding the intensity of sunlight is crucial. Unlike a pyrheliometer, which only measures direct sunlight, a pyranometer measures the total solar radiation, including both direct and diffuse components. The data collected by pyranometers helps scientists and engineers assess solar energy potential, study climate change, and optimize solar panel performance.","priority":"★★☆"},"example_sentences":[{"sentence":"The **pyranometer** recorded a high level of solar irradiance on the clear summer day.","translation":"晴れた夏の日に、日射計は高いレベルの太陽放射照度を記録しました。","type":"general","meaning_category":"measurement"},{"sentence":"Researchers use **pyranometers** to study the effects of cloud cover on solar energy production.","translation":"研究者たちは、雲量が太陽エネルギー生産に与える影響を研究するために日射計を使用しています。","type":"research","meaning_category":"application"},{"sentence":"The **pyranometer** needs to be calibrated regularly to ensure accurate measurements.","translation":"正確な測定を保証するために、日射計は定期的に校正する必要があります。","type":"technical","meaning_category":"maintenance"}]}