{"word":"Thamnophilinae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アリドリ科 (アリサザイ科) の亜科の一つ","english_definition":"a subfamily of birds in the family Thamnophilidae (antbirds).","examples":[{"sentence":"The Thamnophilinae subfamily includes many species of antbirds found in Central and South America.","translation":"アリドリ亜科には、中南米で見られる多くのアリドリ種が含まれています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the family name Thamnophilidae, with the suffix '-inae' indicating a subfamily. Thamnophilidae comes from the Greek 'thamnos' (shrub) and 'philos' (loving), referring to their habitat, plus '-idae', a standard suffix for bird families.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθæmnoʊˈfɪlɪˌnaɪ/","syllables":"Tham-no-phil-i-nae"},"inflection":{"notes":"Plural form is Thamnophilinae (same as singular)."},"usage_notes":{"explanation":"Thamnophilinae is a taxonomic rank used in zoology to classify a group of related bird species within the larger family Thamnophilidae. It is primarily used in scientific contexts, such as ornithology and evolutionary biology.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Thamnophilidae (family)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (scientific vocabulary)","frequency_google_ngram":"Very low frequency (scientific contexts only)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Thamnophilinae' is a highly specialized term used within the field of ornithology and evolutionary biology to classify a specific subfamily of antbirds. Its usage is confined to scientific literature and discussions among experts in these fields. Due to its technical nature and limited applicability, it is not part of general vocabulary. Understanding this term requires familiarity with taxonomic classification systems and avian biology."},"example_sentences":[{"sentence":"Phylogenetic studies have helped to refine the classification within the Thamnophilinae.","translation":"系統発生学的研究は、アリドリ亜科内の分類を洗練するのに役立っています。","type":"scientific context","meaning_category":"classification"},{"sentence":"Several genera are included in the Thamnophilinae, each with distinct ecological adaptations.","translation":"いくつか属がアリドリ亜科に含まれており、それぞれが異なる生態学的適応を持っています。","type":"scientific context","meaning_category":"taxonomy"}]}