{"word":"nonselectivity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非選択性、無選択性","english_definition":"The quality or state of not being selective; lacking the ability or tendency to choose carefully or discriminate.","examples":[{"sentence":"The nonselectivity of the herbicide meant it killed all the plants, not just the weeds.","translation":"その除草剤の非選択性のため、雑草だけでなくすべての植物を枯らしてしまった。"},{"sentence":"Due to the nonselectivity of the sensor, it responded to a wide range of stimuli.","translation":"センサーの無選択性により、広範囲の刺激に反応した。"}],"collocations":["herbicide nonselectivity","sensor nonselectivity","catalyst nonselectivity"],"synonyms":["indiscrimination","promiscuity","generality"],"antonyms":["selectivity","discrimination","specificity"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'selectivity'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnsɪˌlɛkˈtɪvɪti/","syllables":"non-se-lec-tiv-i-ty"},"inflection":{"noun_plural":"nonselectivities"},"usage_notes":{"explanation":"'Nonselectivity' describes a lack of preference or discrimination. It is often used in scientific or technical contexts to describe processes or substances that affect a wide range of targets rather than specific ones. The opposite of 'nonselectivity' is 'selectivity' or 'specificity'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The nonselectivity of the group allowed anyone to join, even if they didn't share the same goals.","correct":"The inclusiveness of the group allowed anyone to join, even if they didn't share the same goals.","note":"'Nonselectivity' implies a lack of discrimination, which may not always be the intended meaning. 'Inclusiveness' might be a better word if the intention is to emphasize openness."}],"priority":"★★☆"},"related_words":{"derivatives":["nonselective (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonselectivity' is a technical term that means the lack of ability to choose or discriminate. It is often used in scientific or technical contexts to describe something that affects a wide range of things rather than specific ones. For example, a nonselective herbicide kills all plants, not just weeds. Understanding this word requires a good vocabulary and familiarity with technical language."},"example_sentences":[{"sentence":"The drug's nonselectivity resulted in several unwanted side effects.","translation":"その薬の非選択性により、いくつかの望ましくない副作用が生じた。","type":"noun","meaning_category":"general"},{"sentence":"Due to its nonselectivity, the enzyme catalyzed a variety of similar reactions.","translation":"その酵素は非選択性のため、さまざまな類似反応を触媒した。","type":"noun","meaning_category":"technical"}]}