{"word":"allotriophagy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異食症、食糞症","english_definition":"The eating of non-nutritive substances; pica.","examples":[{"sentence":"Allotriophagy can be a sign of a nutritional deficiency.","translation":"異食症は栄養不足の兆候である可能性がある。"},{"sentence":"In some animals, allotriophagy is a normal behavior.","translation":"一部の動物では、食糞症は正常な行動である。"}],"collocations":["associated with iron deficiency (鉄欠乏に関連する)","observed in children (子供に見られる)","a symptom of pica (異食症の症状)"],"synonyms":["pica","parorexia"],"antonyms":[]}],"etymology":{"value":"From Greek ἀλλότριος (allotrios, \"belonging to another, foreign\") + -phagy (eating).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌlɒtriˈɒfədʒi/","syllables":"al-lo-tri-oph-a-gy"},"inflection":{"noun_plural":"allotriophagies"},"usage_notes":{"explanation":"Allotriophagy is a medical term referring to the consumption of non-food items. It is often used interchangeably with 'pica', although allotriophagy can also refer specifically to the eating of feces (coprophagy). It is important to note that the term is generally used when the behavior is considered abnormal or indicative of a medical condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog is allotriophagy because he is hungry.","correct":"✓ The dog is exhibiting allotriophagy, which may be due to a nutritional deficiency or behavioral issue.","note":"Allotriophagy is a condition, not a direct cause of hunger. It's better to describe it as a behavior or symptom that might have underlying causes."}],"priority":"★☆☆"},"related_words":{"derivatives":["allotriophagic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["pica","coprophagy","geophagy","amylophagy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Allotriophagy' is a specialized medical term referring to the consumption of non-nutritive substances. It is often used in medical or veterinary contexts to describe a condition where an individual or animal ingests items that are not considered food. Understanding this term requires a strong grasp of medical terminology and biology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The child's allotriophagy was concerning to her parents, who sought medical advice.","translation":"その子供の異食症は両親にとって心配であり、医療機関に相談した。","type":"general","meaning_category":"異食症"},{"sentence":"Allotriophagy in livestock can lead to health problems and reduced productivity.","translation":"家畜の異食症は、健康上の問題や生産性の低下につながる可能性がある。","type":"veterinary","meaning_category":"異食症"},{"sentence":"The doctor suspected allotriophagy when the patient reported eating clay.","translation":"医師は、患者が粘土を食べたと報告した際に、異食症を疑った。","type":"medical","meaning_category":"異食症"}]}