{"word":"unoppressed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"抑圧されていない、圧迫されていない、虐げられていない","english_definition":"Not oppressed; free from tyranny or unjust hardship.","examples":[{"sentence":"The unoppressed people celebrated their newfound freedom.","translation":"抑圧されていなかった人々は、新たに得た自由を祝った。"},{"sentence":"We strive for a society where all are unoppressed.","translation":"私たちは誰もが抑圧されない社会を目指して努力する。"},{"sentence":"The unoppressed farmers were able to sell their crops at a fair price.","translation":"圧迫されていなかった農民たちは、公正な価格で自分たちの作物を売ることができた。"}],"collocations":["unoppressed people","unoppressed society","remain unoppressed","fight for unoppressed"],"synonyms":["free","liberated","independent","unburdened","unenslaved"],"antonyms":["oppressed","suppressed","repressed","enslaved"]}],"etymology":{"value":"The word \"unoppressed\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"oppressed.\" \"Oppressed\" comes from the Latin word \"oppressus,\" the past participle of \"opprimere,\" meaning \"to press against, suppress, overwhelm.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈprest/","syllables":"un-op-pressed"},"inflection":{"adjective_forms":{"comparative":"more unoppressed","superlative":"most unoppressed"}},"usage_notes":{"explanation":"\"Unoppressed\" is a relatively uncommon word, primarily used in formal or political contexts to describe a state of freedom from oppression. It emphasizes the absence of unjust control or hardship. It is often used when discussing human rights, social justice, and the fight against tyranny.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unoppressed feeling in the room was palpable.","correct":"✓ The lack of oppression in the room was palpable.","note":"\"Unoppressed\" describes a state of being, not a feeling. Use a phrase like \"lack of oppression\" to describe the absence of oppressive feelings."},{"incorrect":"✗ He unoppressed the people.","correct":"✓ He liberated the people.","note":"\"Unoppressed\" is an adjective, not a verb. Use verbs like \"liberate\" or \"free\" to describe the act of freeing people from oppression."}],"priority":"★☆☆"},"related_words":{"derivatives":["un- (prefix meaning \"not\")","oppressed (adjective: subjected to harsh and unjust treatment)","oppression (noun: prolonged cruel or unjust treatment or control)","oppress (verb: to keep (someone) in subservience and hardship, especially by the unjust exercise of authority)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unoppressed\" is a formal and less common term that means 'not subjected to harsh or unjust treatment.' It is typically used in discussions about social justice, human rights, and political freedom, often in contrast to the state of being 'oppressed.' Because it's a more advanced term, it's important to understand the meaning of 'oppressed' first.","priority":"★★☆"},"example_sentences":[{"sentence":"The goal of the revolution was to create an unoppressed society.","translation":"革命の目標は、抑圧のない社会を創造することだった。","type":"adjective","meaning_category":"freedom from oppression"},{"sentence":"They fought tirelessly to ensure that future generations would remain unoppressed.","translation":"彼らは、将来の世代が抑圧されないように、たゆまぬ努力を続けた。","type":"adjective","meaning_category":"ensuring freedom"},{"sentence":"The unoppressed citizens enjoyed the rights and privileges denied to them under the previous regime.","translation":"抑圧されていなかった市民は、以前の政権下では否定されていた権利と特権を享受した。","type":"adjective","meaning_category":"enjoying rights"}]}