{"word":"gonidia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(藻類・菌類などの)無性生殖細胞","english_definition":"A non-motile asexual reproductive cell of algae, fungi, and some other organisms.","examples":[{"sentence":"The alga reproduces asexually by forming gonidia.","translation":"その藻類は無性生殖によってゴニディアを形成する。"},{"sentence":"The gonidia are released from the parent cell.","translation":"ゴニディアは母細胞から放出される。"}],"collocations":[],"synonyms":["asexual spore","propagule"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word \"gonos\" (seed, offspring) + -idia (plural suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ɡəˈnɪdiə/","syllables":"go-nid-i-a"},"inflection":{"noun_plural":"gonidia (already plural, singular form is gonidium)"},"usage_notes":{"explanation":"Gonidia are asexual reproductive cells, typically non-motile, found in algae, fungi, and some other organisms. They are involved in asexual reproduction, allowing the organism to propagate without the need for sexual reproduction. The singular form of the word is 'gonidium'.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["gonidial (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'gonidia' is a specialized term used in biology, specifically in the context of algae, fungi, and other simple organisms. It refers to non-motile asexual reproductive cells. Understanding this term requires a background in biology or related scientific fields."},"example_sentences":[{"sentence":"The lichen reproduces asexually through the dispersal of gonidia and algal cells.","translation":"その地衣類は、ゴニディアと藻類の細胞の散布によって無性生殖を行う。","type":"noun","meaning_category":"無性生殖細胞"},{"sentence":"Microscopic examination revealed numerous gonidia within the algal filaments.","translation":"顕微鏡検査により、藻類の繊維内に多数のゴニディアが観察された。","type":"noun","meaning_category":"無性生殖細胞"}]}