{"word":"Evangelary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(典礼)福音書、福音書朗読箇所集","english_definition":"A liturgical book containing the Gospels, or selected passages from the Gospels, arranged in the order that they are read during Mass or other services.","examples":[{"sentence":"The priest read from the Evangelary during the service.","translation":"司祭は礼拝中に福音書から朗読した。"}],"collocations":["Illuminated Evangelary","Gospel Book"],"synonyms":["Gospel Book","Lectionary (related)"],"antonyms":[]}],"etymology":{"value":"From Late Latin 'evangeliarium', from Latin 'evangelium' (gospel), from Greek 'euangelion' (good news).","priority":"★★☆"},"pronunciation":{"ipa":"ɪˈvændʒəˌleri","syllables":"E-van-ge-la-ry"},"inflection":{"noun_plural":"Evangelaries"},"usage_notes":{"explanation":"An Evangelary is a specific type of liturgical book used in Christian services, particularly in the Roman Catholic, Eastern Orthodox, and some Anglican traditions. It contains the Gospel readings for the liturgical year. These books are often beautifully decorated and considered sacred objects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a bible instead of an evangelary.","correct":"✓ He used a Bible instead of an Evangelary. / ✓ He used a lectionary instead of an Evangelary.","note":"A Bible contains the entire text of the Old and New Testaments, while an Evangelary contains only selected Gospel passages. A lectionary contains all the readings for the Mass, including the Old Testament, Psalms, Epistles, and Gospels."}],"priority":"★☆☆"},"related_words":{"derivatives":["Evangelist","Evangelical","Gospel"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Evangelary' is a specialized term used in religious contexts, specifically referring to a liturgical book containing Gospel readings. Understanding this term requires familiarity with Christian liturgical practices. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The monks carefully transcribed and illuminated the Evangelary.","translation":"修道士たちは注意深く福音書を書き写し、装飾した。","type":"noun","meaning_category":"liturgical book"},{"sentence":"The bishop processed into the church carrying the ornate Evangelary.","translation":"司教は華麗な福音書を持って教会に入堂した。","type":"noun","meaning_category":"liturgical book"}]}