{"word":"innateism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"生得説、先天説","english_definition":"The theory that certain knowledge, ideas, or principles are present in the mind at birth.","examples":[{"sentence":"Innateism suggests that some cognitive structures are hardwired into the brain.","translation":"生得説は、いくつかの認知構造が脳に先天的に組み込まれていることを示唆する。"},{"sentence":"The debate between empiricism and innateism is central to the philosophy of mind.","translation":"経験主義と生得説の間の論争は、心の哲学の中心である。"}],"collocations":["theory of innateism","arguments for innateism","against innateism"],"synonyms":["nativism","rationalism"],"antonyms":["empiricism","environmentalism"]},{"part_of_speech":"noun","definition":"（言語学における）生得説","english_definition":"(In linguistics) the theory that humans are born with a universal grammar, which forms the basis for language acquisition.","examples":[{"sentence":"Chomsky's theory of universal grammar is a form of linguistic innateism.","translation":"チョムスキーの普遍文法理論は、言語学的生得説の一形態である。"},{"sentence":"Innateism in linguistics proposes that children do not learn language solely through imitation.","translation":"言語学における生得説は、子供たちが模倣だけを通して言語を学習するのではないと提案する。"}],"collocations":["linguistic innateism","Chomsky's innateism","universal grammar"],"synonyms":["universal grammar theory"],"antonyms":["behaviorism","constructionism"]}],"etymology":{"value":"From 'innate' (existing from birth) + '-ism' (a doctrine or theory).","priority":"★★☆"},"pronunciation":{"ipa":"ɪˈneɪtɪzəm","syllables":"in-nate-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Innateism is a philosophical and linguistic theory that suggests certain knowledge or abilities are inborn rather than learned through experience. It contrasts with empiricism, which emphasizes the role of experience in acquiring knowledge. In linguistics, innateism is associated with the idea of a universal grammar, suggesting that humans have an innate capacity for language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Innateism believes that all knowledge is innate.","correct":"✓ Innateism believes that some knowledge is innate.","note":"Innateism does not claim that *all* knowledge is innate, but rather that *some* knowledge or predispositions are present at birth."}],"priority":"★★☆"},"related_words":{"derivatives":["innate (adjective)","innately (adverb)"],"phrases":["nature versus nurture"],"priority":"★★☆"},"level_frequency":{"level":"Advanced","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Innateism' is a term primarily used in philosophy and linguistics. It refers to the idea that certain knowledge or abilities are present from birth, rather than acquired through learning or experience. This concept is often contrasted with 'empiricism,' which emphasizes the role of experience. In linguistics, innateism is associated with the theory of universal grammar, suggesting that humans have an inborn capacity for language acquisition. Understanding this term requires familiarity with philosophical and linguistic concepts."},"example_sentences":[{"sentence":"The theory of innateism has been debated by philosophers for centuries.","translation":"生得説の理論は、何世紀にもわたって哲学者によって議論されてきた。","type":"noun","meaning_category":"生得説"},{"sentence":"Linguistic innateism argues that children are born with a predisposition to learn language.","translation":"言語学的生得説は、子供たちが言語を学習する素質を持って生まれてくると主張する。","type":"noun","meaning_category":"言語学における生得説"}]}