{"word":"Tabellaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of freshwater diatoms belonging to the family Tabellariaceae.","english_definition":"A genus of freshwater diatoms (a type of algae) characterized by their ribbon-like colonies and rectangular frustules (silica cell walls). They are commonly found in oligotrophic (nutrient-poor) and slightly acidic waters.","examples":[{"sentence":"Tabellaria is an indicator species for certain water quality conditions.","translation":"Tabellariaはある水質状態の指標種である。"},{"sentence":"The presence of Tabellaria can affect the taste and odor of drinking water.","translation":"Tabellariaの存在は飲料水の味と臭いに影響を与えることがある。"}],"collocations":["Tabellaria flocculosa","Tabellaria fenestrata","diatom community","water quality","algal bloom"],"synonyms":["diatom","algae"],"antonyms":[]}],"etymology":{"value":"The name 'Tabellaria' is derived from the Latin word 'tabella,' meaning 'tablet' or 'small board,' referring to the rectangular shape of the diatom's frustules.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtæbəˈlɛəriə/","syllables":"Ta-bel-la-ri-a"},"inflection":{"notes":"Plural: Tabellaria (it is a genus name, which is typically used as a singular noun but refers to a group of organisms)."},"usage_notes":{"explanation":"'Tabellaria' is a scientific term used in the field of phycology (the study of algae) and aquatic ecology. It refers specifically to a genus of diatoms with characteristic ribbon-like colonies. It is not a commonly used word outside of scientific contexts. When discussing water quality or diatom communities, the term may be relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tabellaria are a type of bacteria.","correct":"✓ Tabellaria are a type of diatom (algae).","note":"Tabellaria is a type of diatom, which is a type of algae, not bacteria."},{"incorrect":"✗ Tabellaria is only found in saltwater.","correct":"✓ Tabellaria is typically found in freshwater.","note":"Tabellaria is a freshwater diatom."}],"priority":"★★☆"},"related_words":{"derivatives":["Tabellariaceae (family to which Tabellaria belongs)","diatomaceous earth (sedimentary rock formed from diatom frustules)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tabellaria' is a technical term used in the scientific fields of phycology and aquatic ecology. Understanding this term requires familiarity with biological classification and diatom morphology. It is not a word commonly encountered in general English usage. The text assumes a reader with a background in biology or environmental science."},"example_sentences":[{"sentence":"Samples were collected to analyze the abundance of Tabellaria in the lake.","translation":"湖におけるTabellariaの存在量を分析するためにサンプルを採取した。","type":"noun","meaning_category":"Diatom genus"},{"sentence":"The dominance of Tabellaria indicated oligotrophic conditions in the stream.","translation":"Tabellariaの優占は小川における貧栄養状態を示していた。","type":"noun","meaning_category":"Diatom genus"}]}