{"word":"redbug","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ツツガムシ（の一種）","english_definition":"The larva of certain mites of the family Trombiculidae, known for their itchy bites on humans and other animals. Also known as a chigger.","examples":[{"sentence":"Redbugs are common in grassy and wooded areas.","translation":"ツツガムシは草地や森林地帯によくいます。"},{"sentence":"I got bitten by redbugs while hiking.","translation":"ハイキング中にツツガムシに刺されました。"}],"collocations":["redbug bite","redbug rash","avoid redbugs"],"synonyms":["chigger","harvest mite","trombiculid mite larva"],"antonyms":[]},{"part_of_speech":"noun","definition":"ベニカスムシ（の一種）","english_definition":"A type of insect, specifically a true bug, that is red in color.","examples":[{"sentence":"The redbug was crawling on the leaf.","translation":"ベニカスムシが葉の上を這っていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'red' (referring to the color of the larva) and 'bug' (general term for insect).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛdˌbʌɡ/","syllables":"red-bug"},"inflection":{"noun_plural":"redbugs"},"usage_notes":{"explanation":"The term 'redbug' can refer to either the larva of trombiculid mites (chiggers), or to certain red-colored true bugs. The meaning is often determined by geographic location and context. When referring to the mites, the focus is usually on their irritating bites.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a redbug and it was very big.","correct":"✓ I saw a redbug and it was very small.","note":"Redbug larvae (chiggers) are very small, typically less than 1mm in size."}],"priority":"★☆☆"},"related_words":{"derivatives":["redbug bite (noun): the bite caused by a redbug larva","chigger (noun): a synonym for redbug (trombiculid mite larva)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Redbug' is a specific term referring to either the larval stage of certain mites (chiggers) or certain red-colored true bugs. Understanding the term requires some knowledge of entomology. The context usually clarifies which meaning is intended, but it's a relatively uncommon word overall."},"example_sentences":[{"sentence":"After walking through the tall grass, I found several redbug bites on my ankles.","translation":"背の高い草むらを歩いた後、足首にいくつかのツツガムシの刺し跡を見つけました。","type":"noun","meaning_category":"ツツガムシ"},{"sentence":"The gardener sprayed insecticide to control the redbugs in the garden.","translation":"庭師は庭のツツガムシを駆除するために殺虫剤を散布しました。","type":"noun","meaning_category":"ツツガムシ"}]}