{"word":"nitrocellulose","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ニトロセルロース、硝化綿","english_definition":"A highly flammable compound formed by nitrating cellulose through exposure to nitric acid or another powerful nitrating agent.","examples":[{"sentence":"Nitrocellulose is used in the production of explosives, lacquers, and celluloid.","translation":"ニトロセルロースは、爆薬、ラッカー、セルロイドの製造に使用されます。"},{"sentence":"The flammability of nitrocellulose makes it a dangerous material to handle.","translation":"ニトロセルロースの可燃性は、取り扱いを危険なものにしています。"}],"collocations":["nitrocellulose lacquer","nitrocellulose membrane","soluble nitrocellulose","collodion nitrocellulose"],"synonyms":["cellulose nitrate","guncotton","nitrated cellulose","pyroxylin"],"antonyms":[]}],"etymology":{"value":"Formed from 'nitro-' (referring to the presence of nitro groups) and 'cellulose' (the structural component of plant cell walls).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnaɪtroʊˈsɛljʊloʊs/","syllables":"ni-tro-cel-lu-lose"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Nitrocellulose is a chemical compound that is highly flammable and explosive. It is produced by treating cellulose with nitric acid or another nitrating agent. The degree of nitration affects its properties; highly nitrated cellulose is used in explosives (guncotton), while less nitrated forms are used in lacquers, coatings, and membranes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Nitrocellulose is safe to handle without precautions.","correct":"✓ Nitrocellulose requires careful handling due to its flammability.","note":"Nitrocellulose is highly flammable and requires precautions."}],"priority":"★☆☆"},"related_words":{"derivatives":["nitrate","cellulose","nitration"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Nitrocellulose is a technical term referring to a specific chemical compound. Understanding its properties and uses requires a background in chemistry or related fields. The term is primarily encountered in scientific or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old film stock was made of nitrocellulose, making it highly flammable.","translation":"古いフィルムの素材はニトロセルロースでできていたため、非常に可燃性でした。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Nitrocellulose membranes are commonly used in Western blotting.","translation":"ニトロセルロース膜は、ウェスタンブロッティングで一般的に使用されています。","type":"noun","meaning_category":"application in science"}]}