{"word":"exhibitionistically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"露出狂的に、誇示的に、見せびらかすように","english_definition":"In an exhibitionistic manner; in a way that seeks to attract attention by displaying one's body or abilities.","examples":[{"sentence":"He behaved exhibitionistically, constantly showing off his muscles.","translation":"彼は露出狂的に振る舞い、常に筋肉を見せびらかしていた。"},{"sentence":"She danced exhibitionistically, trying to capture the audience's attention.","translation":"彼女は観客の注意を引こうと、誇示的に踊った。"}],"collocations":["behave exhibitionistically","dance exhibitionistically","dress exhibitionistically"],"synonyms":["ostentatiously","flauntingly","showily","boastfully","theatrically"],"antonyms":["modestly","reservedly","discreetly","humbly"]}],"etymology":{"value":"Derived from 'exhibitionistic', which comes from 'exhibitionism' (the tendency to behave in an extravagant manner for attention) + '-ally'. 'Exhibitionism' comes from 'exhibition' (a public display) + '-ism' (a behavior or practice).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksɪbɪʃənˈɪstɪkli/","syllables":"ex-hi-bi-tion-is-ti-cal-ly"},"inflection":{"notes":"Adverb; no inflection."},"usage_notes":{"explanation":"'Exhibitionistically' describes actions performed in a way that deliberately seeks attention, often through display of the body or abilities. It carries a negative connotation, implying that the behavior is excessive or inappropriate. The term is often associated with psychological or clinical contexts but can also be used more generally to describe attention-seeking behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He sang exhibitionistically, but he had no talent.","correct":"He sang loudly, but he had no talent.","note":"'Exhibitionistically' implies a deliberate attempt to show off, often related to the body or abilities. If there's no implication of showing off, a simpler adverb like 'loudly' might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["exhibitionism (noun)","exhibitionist (noun)","exhibitionistic (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'exhibitionistically' is used to describe behavior that is intended to attract attention, often in a showy or extravagant way. It is typically used in formal contexts or when discussing psychological behavior. It is derived from 'exhibitionism,' which is a psychological term, so understanding the root word is helpful in grasping its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist painted exhibitionistically, using bold colors and dramatic strokes.","translation":"その芸術家は、大胆な色と劇的な筆遣いで、誇示的に絵を描いた。","type":"adverb","meaning_category":"誇示的に"},{"sentence":"He dressed exhibitionistically, hoping to turn heads wherever he went.","translation":"彼はどこへ行っても注目を集めようと、露出狂的に着飾った。","type":"adverb","meaning_category":"露出狂的に"}]}