{"word":"contrastingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"対照的に、著しく異なって","english_definition":"in a way that is strikingly different; in contrast.","examples":[{"sentence":"The north of the country is industrial, contrastingly, the south is mainly agricultural.","translation":"国の北部は工業地帯ですが、対照的に南部は主に農業地帯です。"},{"sentence":"He was calm and collected; contrastingly, she was nervous and agitated.","translation":"彼は冷静沈着でしたが、対照的に彼女は神経質で興奮していました。"},{"sentence":"The first half of the movie was slow; contrastingly, the second half was full of action.","translation":"映画の前半は退屈でしたが、対照的に後半はアクション満載でした。"}],"collocations":["contrastingly different","contrastingly opposite","contrastingly similar (まれ)"],"synonyms":["conversely","differently","oppositely","on the other hand","by contrast","in opposition"],"antonyms":["similarly","likewise","identically","in the same way"]}],"etymology":{"value":"The word 'contrastingly' is formed by adding the suffix '-ly' to the adjective 'contrasting'. 'Contrasting' comes from the verb 'contrast', which originates from the Latin word 'contra' (against) and 'stare' (to stand).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈtræstɪŋli/","syllables":"con-trast-ing-ly"},"inflection":{"notes":"As an adverb, 'contrastingly' does not have different inflections."},"usage_notes":{"explanation":"'Contrastingly' is used to highlight a significant difference between two or more things. It emphasizes the opposition or dissimilarity between them. It is often used to introduce a statement that presents a different perspective or characteristic compared to what was previously mentioned. It's a formal word and is more common in written English than spoken English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She dressed contrastingly than her sister.","correct":"✓ She dressed contrastingly to her sister. / ✓ She dressed in contrast to her sister.","note":"'Contrastingly' is an adverb and doesn't directly take 'than'. Use 'contrastingly to' or rephrase using 'in contrast to'."},{"incorrect":"✗ Contrastingly, they both enjoyed the same hobbies.","correct":"✓ Similarly, they both enjoyed the same hobbies.","note":"'Contrastingly' is used to show differences, not similarities. If the subjects share hobbies, use 'similarly' or 'likewise'."}],"priority":"★★☆"},"related_words":{"derivatives":["contrast (noun, verb)","contrasting (adjective)","contrastive (adjective)"],"phrases":["in contrast to","by contrast","on the contrary","on the other hand"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contrastingly' is an adverb used to show a strong difference between two things. It's a more formal word that means 'in a way that is strikingly different'. You would use it to introduce a fact or idea that is very different from something you just mentioned. For example, 'The city is very modern; contrastingly, the countryside is very traditional.' It's not a very common word in everyday conversation, but you might see it in more formal writing or academic texts."},"example_sentences":[{"sentence":"The original painting was dark and somber; contrastingly, the copy was bright and vibrant.","translation":"オリジナルの絵は暗くて陰鬱でしたが、対照的にコピーは明るく鮮やかでした。","type":"adverb","meaning_category":"対照的に"},{"sentence":"Some students learn best by listening; contrastingly, others learn best by doing.","translation":"聞くことで最もよく学ぶ学生もいれば、対照的に、することで最もよく学ぶ学生もいます。","type":"adverb","meaning_category":"対照的に"},{"sentence":"The weather in July was hot and sunny; contrastingly, August was cool and rainy.","translation":"7月の天気は暑くて晴れていましたが、対照的に8月は涼しくて雨が降りました。","type":"adverb","meaning_category":"対照的に"}]}