{"word":"diaplexal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Linguistics) Exhibiting both accusative and ergative alignment patterns.","english_definition":"(Linguistics) Exhibiting both accusative and ergative alignment patterns.","examples":[{"sentence":"Some languages are described as diaplexal because they show characteristics of both accusative and ergative alignment.","translation":"一部の言語は、対格と能格の両方のアライメントの特性を示すため、ダイアプレキサルと記述されています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'dia-' (through, across) + 'plexal' (related to plexus, network), suggesting a crossing or mixing of alignment patterns.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdaɪəˈplɛksəl/","syllables":"di-a-plex-al"},"inflection":{},"usage_notes":{"explanation":"The term 'diaplexal' is primarily used in linguistic typology to categorize languages that do not neatly fit into either accusative or ergative alignment systems. These languages may exhibit accusative alignment in some constructions and ergative alignment in others, or they may have split ergativity based on factors such as tense, aspect, or animacy.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["accusative","ergative","alignment","linguistic typology","split ergativity"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'diaplexal' is a highly specialized term used in theoretical linguistics, specifically within the subfield of linguistic typology. It describes languages that exhibit characteristics of both accusative and ergative alignment systems, making them complex and challenging to categorize. Understanding this term requires a solid foundation in linguistic theory. "},"example_sentences":[{"sentence":"The analysis revealed that the language exhibited a diaplexal alignment system.","translation":"分析により、その言語がダイアプレキサルのアライメントシステムを示すことが明らかになりました。","type":"example","meaning_category":"Linguistics"}]}