{"word":"Ilissus","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"イリソス川：ギリシャのアテネを流れていた川。現在は大部分が暗渠化されている。","english_definition":"The Ilissus is a river in Athens, Greece, that used to flow southeast of the Acropolis. It is now mostly channeled underground.","examples":[{"sentence":"The banks of the Ilissus were once a popular spot for recreation in ancient Athens.","translation":"かつてイリソス川の岸辺は、古代アテネにおいて人気のレクリエーションスポットであった。"},{"sentence":"Plato's dialogue Phaedrus is set on the banks of the Ilissus.","translation":"プラトンの対話篇『パイドロス』は、イリソス川の岸辺を舞台としている。"}],"collocations":["banks of the Ilissus","near the Ilissus","along the Ilissus"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'Ilissus' comes from ancient Greek, but the exact origin and meaning are uncertain. Some theories connect it to words related to 'mud' or 'winding.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɪsəs/","syllables":"I-lis-sus"},"inflection":{"notes":"単数形のみ"},"usage_notes":{"explanation":"The Ilissus River is primarily known for its historical and cultural significance in ancient Athens. It's often mentioned in classical literature and philosophical texts. Today, much of the river is covered, so it's not a prominent feature of modern Athens.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"related_places":["Athens","Acropolis"],"related_concepts":["Ancient Greece","Greek mythology","Classical literature"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い (Very low) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Ilissus' refers to a specific geographical location (a river in Athens) with historical and cultural importance. Understanding requires familiarity with ancient Greek history and literature. The word is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Ilissus** river, though now mostly underground, played a significant role in the history of Athens.","translation":"イリソス川は、現在では大部分が地下に埋められているものの、アテネの歴史において重要な役割を果たした。","type":"noun","meaning_category":"geographical feature"},{"sentence":"In Plato's Phaedrus, Socrates and Phaedrus discuss rhetoric while walking along the banks of the **Ilissus**.","translation":"プラトンの『パイドロス』において、ソクラテスとパイドロスはイリソス川の岸辺を散歩しながら弁論術について議論する。","type":"noun","meaning_category":"cultural reference"}]}