{"word":"craniectomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"頭蓋骨切除術","english_definition":"A surgical procedure in which a portion of the skull is removed to allow a swelling brain to expand without being compressed. It may be performed to treat traumatic brain injury, stroke, or other conditions that cause increased intracranial pressure.","examples":[{"sentence":"The patient underwent a craniectomy to relieve the pressure on his brain.","translation":"患者は脳の圧力を軽減するために頭蓋骨切除術を受けた。"},{"sentence":"A craniectomy is a serious procedure with potential complications.","translation":"頭蓋骨切除術は、合併症の可能性がある深刻な処置である。"}],"collocations":["decompressive craniectomy","perform a craniectomy","undergo a craniectomy"],"synonyms":["skull removal","bone flap removal"],"antonyms":["craniotomy (頭蓋切開術)"]},{"part_of_speech":"noun","definition":"頭蓋骨の一部を除去する外科手術","english_definition":"Surgical removal of a portion of the skull.","examples":[{"sentence":"The craniectomy allowed the neurosurgeon to access the brain.","translation":"頭蓋骨切除術によって、脳神経外科医は脳にアクセスすることができた。"}],"collocations":["emergency craniectomy","elective craniectomy"],"synonyms":["partial skull removal"],"antonyms":["skull replacement"]}],"etymology":{"value":"From the Greek words 'cranion' (skull) and 'ektome' (excision).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkreɪniˈɛktəmi/","syllables":"cra-ni-ec-to-my"},"inflection":{"noun_plural":"craniectomies"},"usage_notes":{"explanation":"A craniectomy is distinct from a craniotomy, in which the bone flap is temporarily removed and then replaced at the end of the procedure. In a craniectomy, the removed bone flap is not immediately replaced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a craniotomy, which is the same as a craniectomy.","correct":"✓ The doctor performed a craniectomy to relieve the pressure.","note":"Craniotomy and craniectomy are different procedures. A craniotomy involves replacing the bone flap, while a craniectomy does not immediately replace it."}],"priority":"★★☆"},"related_words":{"derivatives":["cranium","ectomy","craniotomy","neurosurgeon","neurology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Craniectomy' is a specialized medical term referring to a surgical procedure involving the removal of a portion of the skull. It is typically encountered in medical contexts related to neurosurgery, traumatic brain injury, or conditions causing increased intracranial pressure. Understanding this term requires a background in medical terminology or familiarity with neurosurgical procedures."},"example_sentences":[{"sentence":"Following the severe head trauma, the patient required an emergency craniectomy.","translation":"重度の頭部外傷の後、患者は緊急の頭蓋骨切除術を必要とした。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"The craniectomy helped to reduce the risk of further brain damage.","translation":"頭蓋骨切除術は、さらなる脳損傷のリスクを軽減するのに役立った。","type":"noun","meaning_category":"surgical procedure"}]}