{"word":"Tribulus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハマビシ属 (植物)","english_definition":"A genus of plants in the family Zygophyllaceae, native to warm temperate and tropical regions of the world.","examples":[{"sentence":"Tribulus terrestris is used in traditional medicine.","translation":"ハマビシは伝統医学で用いられています。"}],"collocations":["Tribulus extract","Tribulus terrestris"],"synonyms":["Puncture vine","Goathead","Bindii"],"antonyms":[]},{"part_of_speech":"noun","definition":"ハマビシ (Tribulus terrestris)","english_definition":"Specifically, Tribulus terrestris, a plant known for its sharp thorns and use in traditional medicine and as a dietary supplement.","examples":[{"sentence":"Some athletes use Tribulus to enhance performance.","translation":"一部のアスリートはパフォーマンス向上のためにハマビシを使用します。"}],"collocations":["Tribulus supplement","Tribulus benefits","Tribulus dosage"],"synonyms":["Puncture vine","Goathead","Bindii"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'tribulus,' which referred to a caltrop (a spiked weapon) and also the plant Tribulus terrestris. The name refers to the sharp spines on the fruit of the plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪbjʊləs/","syllables":"Trib-u-lus"},"inflection":{"notes":"Plural: Tribuluses"},"usage_notes":{"explanation":"'Tribulus' can refer to the entire genus of plants, but it most commonly refers to Tribulus terrestris. This plant is often used in herbal supplements and traditional medicine, and is known for its sharp spines that can puncture tires and injure feet. When discussing supplements or medicinal uses, it almost always refers to Tribulus terrestris.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take tribulus for my cold.","correct":"✓ I take vitamin C for my cold. / ✓ I take Tribulus for energy.","note":"Tribulus is not typically used for treating colds. It's more commonly associated with energy, libido, or athletic performance. Using it for a cold would be an uncommon application."},{"incorrect":"✗ Tribulus are a tree.","correct":"✓ Tribulus is a plant.","note":"Tribulus is a genus of plants, typically vines or herbs, not trees."}],"priority":"★★☆"},"related_words":{"derivatives":["Tribulaceae (family name - sometimes used, but Zygophyllaceae is more common)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"(Not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency. Primarily found in scientific or health-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tribulus' is a specialized term primarily encountered in botanical, medicinal, or supplement-related contexts. It refers to a genus of plants, most notably Tribulus terrestris, which is used in some traditional medicines and as a dietary supplement. Due to its specific usage, it is not a common word in everyday conversation and is more likely to be found in specialized literature or discussions related to health and wellness."},"example_sentences":[{"sentence":"The farmer was annoyed by the spread of **Tribulus** in his fields.","translation":"農家は畑にハマビシが広がることに悩まされていた。","type":"noun","meaning_category":"Plant"},{"sentence":"Some bodybuilders use **Tribulus** supplements to increase testosterone levels.","translation":"一部のボディービルダーはテストステロンレベルを上げるためにハマビシのサプリメントを使用しています。","type":"noun","meaning_category":"Supplement"},{"sentence":"**Tribulus terrestris** is known for its sharp thorns that can puncture bicycle tires.","translation":"ハマビシはその鋭いトゲで自転車のタイヤをパンクさせることで知られています。","type":"noun","meaning_category":"Specific Plant"}]}