{"word":"nonassumption","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非仮定、無前提、仮定を設けないこと","english_definition":"The state or practice of not assuming something; the absence of presuppositions or assumptions.","examples":[{"sentence":"The study was conducted with a spirit of nonassumption to avoid bias.","translation":"その研究は偏見を避けるために、非仮定の精神で行われた。"},{"sentence":"A key principle of the scientific method is nonassumption.","translation":"科学的方法の重要な原則は、非仮定である。"},{"sentence":"The therapist approached the client with nonassumption, allowing the client to define their own experiences.","translation":"セラピストはクライアントに非仮定の姿勢で接し、クライアント自身が自分の経験を定義できるようにした。"}],"collocations":["principle of nonassumption (非仮定の原則)","spirit of nonassumption (非仮定の精神)"],"synonyms":["impartiality","objectivity","neutrality","open-mindedness","lack of bias"],"antonyms":["assumption","presumption","bias","preconception"]}],"etymology":{"value":"'non-' (否定) + 'assumption' (仮定)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəˈsʌmpʃən/","syllables":"non-as-sump-tion"},"inflection":{"noun_plural":"nonassumptions"},"usage_notes":{"explanation":"'Nonassumption' refers to the deliberate avoidance of making assumptions or presuppositions about a situation, person, or topic. It is often used in contexts where objectivity and impartiality are important, such as scientific research, therapy, and journalism. The term emphasizes the importance of approaching a subject with an open mind and without preconceived notions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonassumption of the results was important.","correct":"✓ The nonassumption of bias was important.","note":"'Nonassumption' refers to the avoidance of making assumptions, not the avoidance of accepting results. The sentence should focus on avoiding bias. "},{"incorrect":"✗ He practiced nonassumption in his life.","correct":"✓ He practiced nonassumption in his approach to problems.","note":"'Nonassumption' is a principle or practice, not something one practices in their life in general. It's applied to specific situations or approaches."}],"priority":"★★☆"},"related_words":{"derivatives":["assume (verb)","assumption (noun)","unassuming (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonassumption' is a relatively uncommon term that describes the practice of avoiding making assumptions or presuppositions. It is often used in academic or professional contexts where objectivity and impartiality are valued. Understanding this term requires a grasp of the meaning of 'assumption' and the ability to recognize the prefix 'non-' as indicating negation or absence. The term is most likely to be encountered in fields such as science, philosophy, or therapy, where critical thinking and unbiased analysis are essential."},"example_sentences":[{"sentence":"The researcher maintained a position of nonassumption throughout the experiment.","translation":"研究者は実験を通して非仮定の立場を維持した。","type":"noun","meaning_category":"非仮定の精神"},{"sentence":"In therapy, nonassumption allows the therapist to truly understand the client's perspective.","translation":"セラピーにおいて、非仮定はセラピストがクライアントの視点を真に理解することを可能にする。","type":"noun","meaning_category":"非仮定の原則"},{"sentence":"Journalists should approach every story with nonassumption, verifying all facts before reporting.","translation":"ジャーナリストはすべての記事に非仮定の姿勢で臨み、報道前にすべての事実を確認すべきである。","type":"noun","meaning_category":"非仮定の精神"}]}