{"word":"incogs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) Informal term for incognito mode or private browsing in a web browser.","english_definition":"(plural only) A slang or informal term referring to incognito mode or private browsing, especially in the context of web browsers.","examples":[{"sentence":"I was browsing in incogs so my search history wouldn't be saved.","translation":"検索履歴が保存されないように、シークレットモードでブラウジングしていました。"},{"sentence":"Make sure you're using incogs if you don't want cookies tracking you.","translation":"クッキーに追跡されたくない場合は、シークレットモードを使用していることを確認してください。"}],"collocations":["use incogs","browse in incogs","open an incogs window"],"synonyms":["private browsing","incognito mode","private window"],"antonyms":["normal browsing","standard mode"]},{"part_of_speech":"noun","definition":"(plural only) A shortened, informal reference to wearing or using incognito glasses or disguises.","english_definition":"(plural only) An abbreviation or informal way of referring to wearing or using incognito glasses or disguises to conceal one's identity.","examples":[{"sentence":"He wore incogs to avoid being recognized at the event.","translation":"彼はイベントで認識されるのを避けるために変装をしました。"},{"sentence":"The spies used incogs to blend in with the crowd.","translation":"スパイは群衆に溶け込むために変装を使用しました。"}],"collocations":["wear incogs","use incogs","put on incogs"],"synonyms":["disguises","camouflage","alterations","masquerade"],"antonyms":["revealing","unveiling"]}],"etymology":{"value":"Shortened, informal derivation of 'incognito,' referring to a state of concealed identity. The plural form 'incogs' is a slangy adaptation.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɪnkɒɡz/","syllables":"in-cogs"},"inflection":{"noun_plural":"incogs (already plural)"},"usage_notes":{"explanation":"'Incogs' is a very informal, slang term. It's primarily used to refer to 'incognito mode' or 'private browsing' in web browsers, especially among younger or more tech-savvy individuals. It can also refer to disguises, though this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I opened an incog.","correct":"✓ I opened an incogs window.","note":"Since 'incogs' is a plural abbreviation of 'incognito mode', it's typically used in plural form, even when referring to a single instance of private browsing."}],"priority":"★☆☆"},"related_words":{"derivatives":["incognito (adjective, adverb, noun)"],"phrasal_verbs":[],"related_terms":["private browsing","incognito mode","disguise","camouflage"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (Primarily used in informal online contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Incogs' is a slang term, primarily used in informal online communication. It refers to 'incognito mode' or 'private browsing' in web browsers. Its usage is generally limited to tech-savvy individuals or younger demographics. While understanding it might be helpful in specific contexts, it's not part of standard English vocabulary and should be used cautiously in formal settings."},"example_sentences":[{"sentence":"I always use incogs when I'm booking flights to get the best prices.","translation":"最高の価格を得るために、フライトを予約するときは常にシークレットモードを使用します。","type":"noun","meaning_category":"private browsing"},{"sentence":"He put on some incogs before entering the restricted area.","translation":"彼は制限区域に入る前に変装をした。","type":"noun","meaning_category":"disguises"}]}