{"word":"polysaprobic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(水質が)極度汚染の、多腐水性の","english_definition":"(of water) containing a very high level of organic pollution, characterized by the presence of anaerobic bacteria and the absence of fish and other higher organisms.","examples":[{"sentence":"The river was polysaprobic due to the sewage discharge.","translation":"その川は下水の排出により極度汚染状態だった。"}],"collocations":["polysaprobic zone","polysaprobic conditions"],"synonyms":["heavily polluted","grossly contaminated"],"antonyms":["oligosaprobic","clean","unpolluted"]}],"etymology":{"value":"Derived from the Greek words 'poly' (many), 'sapros' (rotten, decaying), and 'bios' (life).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪsəˈprɒbɪk/","syllables":"pol-y-sa-prob-ic"},"inflection":{"notes":"No common inflections as it is primarily an adjective."},"usage_notes":{"explanation":"'Polysaprobic' is a technical term used in ecology and water quality assessment to describe the most heavily polluted aquatic environments. It indicates conditions where decomposition of organic matter is dominant, oxygen levels are very low or absent, and only certain types of bacteria and other microorganisms can survive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was polysaprobic, so there were many fish.","correct":"✓ The water was polysaprobic, so there were no fish.","note":"Polysaprobic conditions are so polluted that fish and most other higher organisms cannot survive."}],"priority":"★★☆"},"related_words":{"derivatives":["saprobic","oligosaprobic","mesosaprobic","saprobity"],"related_terms":["water quality","biological oxygen demand (BOD)","eutrophication"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polysaprobic' is a highly specialized term used within the fields of ecology and environmental science to describe extremely polluted aquatic environments. Understanding its meaning requires familiarity with concepts of water quality assessment, organic pollution, and the ecological impacts of pollution on aquatic life. It is not a term commonly used outside of these specific contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The sediment in the heavily industrialized area was found to be in a polysaprobic state.","translation":"重工業地帯の堆積物は極度汚染状態にあることが判明した。","type":"general","meaning_category":"極度汚染の"},{"sentence":"The polysaprobic zone of the river supported only anaerobic bacteria.","translation":"その川の極度汚染区域では、嫌気性細菌のみが生息していた。","type":"technical","meaning_category":"極度汚染の"}]}