{"word":"periosteophyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"骨膜骨棘（こつまくこっきょく）：骨膜に発生する骨の棘状の突起","english_definition":"A bony outgrowth arising from the periosteum.","examples":[{"sentence":"Periosteophytes can be a sign of osteoarthritis.","translation":"骨膜骨棘は変形性関節症の兆候である可能性がある。"},{"sentence":"The X-ray showed periosteophyte formation around the joint.","translation":"レントゲン写真では、関節周囲に骨膜骨棘の形成が見られた。"}],"collocations":["periosteophyte formation (骨膜骨棘形成)","joint periosteophyte (関節骨膜骨棘)"],"synonyms":["bone spur","osteophyte"],"antonyms":[]}],"etymology":{"value":"\"peri-\" (周囲) + \"osteo-\" (骨) + \"-phyte\" (成長) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛriˈɒstiəˌfaɪt/","syllables":"per-i-os-te-o-phyte"},"inflection":{"noun_plural":"periosteophytes"},"usage_notes":{"explanation":"Periosteophytes are bony growths that develop on the surface of a bone, specifically arising from the periosteum (the membrane that covers the bone). They are often associated with conditions like osteoarthritis, where the cartilage in joints breaks down, leading to inflammation and bone remodeling. The presence of periosteophytes can be detected through imaging techniques such as X-rays or MRIs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I have periosteophyte in my muscle.","correct":"✓ The doctor said I have periosteophytes around my joint.","note":"Periosteophytes form on bone, not in muscle. They are commonly found around joints."}],"priority":"★★★"},"related_words":{"derivatives":["periosteal (形容詞: 骨膜の)","osteophyte (名詞: 骨棘)","periosteum (名詞: 骨膜)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Periosteophyte\" is a specialized medical term referring to a bony growth that arises from the periosteum, the membrane covering bones. It is primarily used in the context of diagnosing and describing bone-related conditions, particularly osteoarthritis. Understanding this term requires a background in anatomy and medical terminology. It is not commonly encountered in everyday language.","priority":"★★★"},"example_sentences":[{"sentence":"The MRI revealed several small periosteophytes along the tibial plateau.","translation":"MRI検査で、脛骨高原に沿っていくつかの小さな骨膜骨棘が認められた。","type":"medical","meaning_category":"骨の成長"},{"sentence":"Periosteophyte formation can contribute to joint pain and stiffness.","translation":"骨膜骨棘の形成は、関節の痛みやこわばりの原因となることがある。","type":"medical","meaning_category":"症状の原因"}]}