{"word":"angelophanic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"天使の出現に関する、天使の出現を示す","english_definition":"Relating to or characterized by an angelophany (an appearance of an angel).","examples":[{"sentence":"The angelophanic visions in the Book of Revelation are awe-inspiring.","translation":"ヨハネの黙示録における天使出現の幻影は畏敬の念を起こさせる。"},{"sentence":"Scholars study angelophanic accounts to understand religious beliefs about angels.","translation":"学者たちは、天使に関する宗教的信念を理解するために、天使出現の記録を研究する。"}],"collocations":["angelophanic vision","angelophanic account","angelophanic experience"],"synonyms":["angelic","celestial","divine"],"antonyms":["demonic","earthly","mundane"]}],"etymology":{"value":"Derived from 'angelophany,' which combines 'angelo-' (from 'angel,' ultimately from Greek 'angelos' meaning 'messenger') and '-phany' (from Greek 'phainein' meaning 'to show' or 'to appear'). Thus, 'angelophanic' describes something related to the appearance or manifestation of an angel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪnˌdʒeloʊˈfænɪk/","syllables":"an-ge-lo-phan-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Angelophanic' is a relatively rare term, primarily used in religious studies, theology, and occasionally in literature when discussing the appearance or manifestation of angels. It is used to describe visions, accounts, or experiences that involve the presence or appearance of angels.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The angelophanic was beautiful.","correct":"✓ The angelophanic vision was beautiful.","note":"'Angelophanic' is an adjective and needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["angelophany (noun: an appearance of an angel)","angel (noun: a spiritual being believed to act as an attendant, agent, or messenger of God, conventionally represented in human form with wings.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in academic or theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Angelophanic' is a specialized term used in religious studies and theology to describe anything relating to the appearance or manifestation of angels. Due to its specific context and etymological complexity, it is considered an advanced vocabulary word. Understanding its meaning requires familiarity with religious concepts and Greek root words.","priority":"★★☆"},"example_sentences":[{"sentence":"The medieval painting depicted an angelophanic scene with radiant light.","translation":"その中世の絵画は、輝く光を伴う天使出現の場面を描いていた。","type":"adjective","meaning_category":"天使の出現に関する"},{"sentence":"The scholar analyzed the angelophanic elements in early Christian texts.","translation":"その学者は、初期キリスト教の文献における天使出現の要素を分析した。","type":"adjective","meaning_category":"天使の出現を示す"}]}