{"word":"dofunny","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(slang, informal) silly, amusing in a childish or foolish way.","english_definition":"(slang, informal) silly, amusing in a childish or foolish way.","examples":[{"sentence":"That dofunny cat video made me laugh.","translation":"そのおかしな猫のビデオで笑ってしまった。"},{"sentence":"He's always telling dofunny jokes.","translation":"彼はいつもくだらないジョークを言っている。"}],"collocations":["dofunny video","dofunny joke","dofunny face"],"synonyms":["silly","foolish","goofy","wacky","zany","comical","amusing","funny"],"antonyms":["serious","solemn","grave"]}],"etymology":{"value":"Probably a playful alteration of 'funny', emphasizing the silliness or childishness of the humor.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌduːˈfʌni/","syllables":"do-fun-ny"},"inflection":{"notes":"The word 'dofunny' primarily functions as an adjective. It does not have standard inflections for verb tenses or noun plurals."},"usage_notes":{"explanation":"'Dofunny' is a slang term used to describe something that is silly or amusing in a childish or foolish way. It is often used to describe jokes, videos, or behavior that is not meant to be taken seriously. The term is informal and may not be appropriate in formal settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dofunny person.","correct":"✓ He is a funny person. / ✓ He is a bit dofunny.","note":"While 'dofunny' is an adjective, it's often used to describe things rather than people directly. Saying someone 'is dofunny' sounds awkward. It's better to say they are 'funny' or that their behavior is 'dofunny'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["funny","silly","goofy","amusing","humorous"]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (primarily used in informal contexts)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Dofunny' is a slang word meaning silly or amusing in a childish way. It's not a common word, so you might not hear it often. It's used informally to describe something that's funny but not in a serious or sophisticated way. It's more like something that makes you giggle or smile because it's a bit ridiculous. Because it's slang, it's best to use it in casual conversations with people who understand informal language."},"example_sentences":[{"sentence":"The kids were making dofunny faces at each other.","translation":"子供たちはお互いにおかしな顔をしていた。","type":"adjective","meaning_category":"silly"},{"sentence":"I found a dofunny meme online that made me laugh out loud.","translation":"ネットで面白いミームを見つけて大声で笑ってしまった。","type":"adjective","meaning_category":"amusing"}]}