{"word":"understater","meanings":[{"part_of_speech":"noun","definition":"控えめに言う人、過小評価する人","english_definition":"A person who understates something; someone who describes something as less important, serious, bad, etc. than it really is.","examples":[{"sentence":"He's a master understater; he'll describe a disaster as 'a bit of a problem'.","translation":"彼は控えめに言う達人で、災害のことを「ちょっとした問題」と表現するだろう。"},{"sentence":"As an understater, she downplayed her accomplishments, making them seem insignificant.","translation":"控えめに言う人として、彼女は自分の業績を軽視し、取るに足らないもののように見せかけた。"}],"collocations":["master understater","serial understater"],"synonyms":["minimizer","downplayer","belittler"],"antonyms":["exaggerator","overstater","hyperbolizer"],"related_words":["understatement","understate","downplay","minimize"]}],"etymology":{"value":"Derived from the verb 'understate' (to present something as less significant than it is) + the suffix '-er' (denoting a person who performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈsteɪtər/","syllables":"un-der-stat-er"},"inflection":{"noun_plural":"understaters"},"usage_notes":{"explanation":"An 'understater' is someone who habitually uses understatement, a figure of speech that deliberately makes something seem less important or serious than it is. This can be used for humorous effect, for politeness, or to avoid being seen as boastful or dramatic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a big understater, he always tells the truth.","correct":"He is an understater, he describes things as less important than they are.","note":"Understating doesn't necessarily mean lying, but rather minimizing the significance of something."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Understater' refers to a person who habitually uses understatement, which is a way of speaking that deliberately downplays the significance of something. This word is used when describing someone who tends to minimize or downplay situations, achievements, or problems, often for humorous or ironic effect. It's a more advanced term, implying a nuanced understanding of communication styles."},"example_sentences":[{"sentence":"The British are often characterized as understaters, even in serious situations.","translation":"イギリス人は、深刻な状況でも控えめに言う人として特徴づけられることが多い。","type":"general","meaning_category":"general"},{"sentence":"As a natural understater, he described winning the lottery as 'a bit of good luck'.","translation":"生まれつき控えめに言う人として、彼は宝くじに当たったことを「ちょっとした幸運」と表現した。","type":"example","meaning_category":"example"}]}