{"word":"avianizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(ウイルスなどを)鳥類に適応させる、鳥類細胞で培養する","english_definition":"To adapt (a virus, etc.) to birds or avian cells, often by serial passage through avian embryos or cell cultures.","examples":[{"sentence":"The influenza virus was avianized by repeated passage through chicken embryos.","translation":"そのインフルエンザウイルスは、鶏の胚での連続継代によって鳥類に適応させられた。"},{"sentence":"Avianizing the virus can alter its virulence in mammals.","translation":"ウイルスを鳥類に適応させることは、哺乳類におけるその病原性を変化させる可能性がある。"}],"collocations":["avianize a virus","avianize a pathogen","avianize by serial passage"],"synonyms":["avian adaptation","avian cell culture passage"],"antonyms":[]}],"etymology":{"value":"Formed from 'avian' (relating to birds) + '-ize' (a suffix indicating a process of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪviənaɪzɪŋ/","syllables":"a-vi-an-iz-ing"},"inflection":{"verb_forms":{"present_simple":["avianizes"],"past_simple":"avianized","past_participle":"avianized","present_participle":"avianizing"}},"usage_notes":{"explanation":"'Avianizing' is a technical term primarily used in virology and related fields. It refers to the process of adapting a virus or other pathogen to grow more efficiently in avian (bird) cells or embryos. This is often done to attenuate the virus (reduce its virulence) for use in vaccines or to study viral adaptation. The process typically involves serial passage, where the virus is repeatedly grown in avian cells, selecting for variants that are better adapted to that environment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist avianized the bird.","correct":"✓ The scientist avianized the virus.","note":"'Avianizing' is used for pathogens, not for the birds themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["avian (adjective: relating to birds)","avianization (noun: the process of avianizing)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Avianizing' is a highly specialized term used in the context of virology and vaccine development. Understanding it requires familiarity with concepts such as viral adaptation, serial passage, and cell culture. It is not a term commonly encountered outside of scientific literature and discussions within the relevant fields."},"example_sentences":[{"sentence":"Scientists are investigating whether avianizing the H5N1 virus could lead to a safer vaccine.","translation":"科学者たちは、H5N1ウイルスを鳥類に適応させることで、より安全なワクチンにつながるかどうかを調査している。","type":"verb","meaning_category":"virus adaptation"},{"sentence":"The avianizing process resulted in a strain of the virus with reduced pathogenicity in mammals.","translation":"鳥類への適応プロセスにより、哺乳類における病原性が低下したウイルスの株が得られた。","type":"verb","meaning_category":"attenuation"}]}