{"word":"danli","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A traditional garment worn by women in the Philippines, particularly by the Tausug people. It is a long-sleeved blouse, often made of silk or cotton, and is typically adorned with intricate embroidery and embellishments.","english_definition":"A traditional long-sleeved blouse worn by Tausug women in the Philippines, often made of silk or cotton and decorated with embroidery.","examples":[{"sentence":"The bride wore a beautiful danli, intricately embroidered with gold thread.","translation":"花嫁は美しいダンリを着ており、金糸で複雑に刺繍されていた。"},{"sentence":"The danli is an important part of the Tausug cultural heritage.","translation":"ダンリはタウスグの文化遺産の重要な一部である。"}],"collocations":["wear a danli","embroidered danli","Tausug danli","traditional danli"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The word 'danli' is believed to originate from the Tausug language, spoken in the Sulu Archipelago of the Philippines.","priority":"N/A"},"pronunciation":{"ipa":"/ˈdɑːnli/","syllables":"dan-li"},"inflection":{"noun_plural":"danlis"},"usage_notes":{"explanation":"The 'danli' is a significant cultural symbol for the Tausug people. It is often worn during special occasions such as weddings, festivals, and religious ceremonies. The intricate designs and embellishments on the danli reflect the wearer's status and the artistry of the Tausug weavers and embroiderers.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Tausug","Sulu","Philippines","traditional clothing","cultural heritage"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"This word refers to a specific cultural item. Understanding requires knowledge of Philippine culture, specifically the Tausug people."},"example_sentences":[{"sentence":"She looked stunning in her silk danli.","translation":"彼女は絹のダンリを着て見事に美しかった。","type":"noun","meaning_category":"traditional garment"},{"sentence":"The museum displayed a collection of antique danli blouses.","translation":"博物館にはアンティークのダンリのブラウスのコレクションが展示されていた。","type":"noun","meaning_category":"traditional garment"}]}