{"word":"somatotypology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"体型類型学、体型分類学","english_definition":"The study of human body types; the classification of people according to body shape and physique.","examples":[{"sentence":"Sheldon's somatotypology classified individuals into endomorphs, mesomorphs, and ectomorphs.","translation":"シェルドンの体型類型学では、個人を内胚葉型、中胚葉型、外胚葉型に分類した。"},{"sentence":"Somatotypology has been used in sports science to identify athletes suited for certain activities.","translation":"体型類型学は、特定の活動に適したアスリートを特定するためにスポーツ科学で使用されてきた。"}],"collocations":["Sheldon's somatotypology","body type classification","endomorph","mesomorph","ectomorph"],"synonyms":["body type analysis","constitutional psychology"],"antonyms":[]},{"part_of_speech":"noun","definition":"（個々の）体型類型","english_definition":"A system for classifying body types, or a particular body type within such a system.","examples":[{"sentence":"His somatotypology was predominantly mesomorphic, indicating a muscular build.","translation":"彼の体型類型は主に中胚葉型であり、筋肉質な体格を示していた。"},{"sentence":"The athlete's somatotypology suggested a predisposition for endurance sports.","translation":"そのアスリートの体型類型は、持久力スポーツへの適性を示唆していた。"}],"collocations":["mesomorphic somatotypology","ectomorphic somatotypology","endomorphic somatotypology"],"synonyms":["body type","physique"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'soma' (body), 'typos' (type), and 'logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊmətətaɪˈpɒlədʒi/","syllables":"so-ma-to-ty-po-lo-gy"},"inflection":{"noun_plural":"somatotypologies"},"usage_notes":{"explanation":"Somatotypology is primarily associated with the work of William Herbert Sheldon, who proposed that body type is correlated with temperament. While influential in the mid-20th century, Sheldon's theories have faced criticism for methodological issues and oversimplification. The term is still used in some contexts within sports science and anthropology, but its use is often approached with caution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The somatotypology of the brain.","correct":"✓ The somatotypology of the body.","note":"Somatotypology specifically refers to the study and classification of body types, not brain structures or other non-physical characteristics."},{"incorrect":"✗ Somatotypology is an exact predictor of personality.","correct":"✓ Somatotypology is a classification system of body types.","note":"Somatotypology is a classification system, not a definitive predictor of personality or behavior. While Sheldon proposed correlations, these are not universally accepted or proven."}],"priority":"★★☆"},"related_words":{"derivatives":["somatotype","endomorph","mesomorph","ectomorph"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Somatotypology' is a specialized term referring to the study and classification of body types, particularly as developed by William Sheldon. It's used in contexts related to anthropology, psychology, and sports science. Understanding the term requires familiarity with the concepts of endomorphy, mesomorphy, and ectomorphy, which are the three primary body types identified in Sheldon's system. The term is rarely encountered in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The researcher used somatotypology to analyze the physical characteristics of the athletes.","translation":"研究者は、アスリートの身体的特徴を分析するために体型類型学を使用した。","type":"noun","meaning_category":"体型類型学"},{"sentence":"His somatotypology suggested he was primarily a mesomorph.","translation":"彼の体型類型は、彼が主に中胚葉型であることを示唆していた。","type":"noun","meaning_category":"体型類型"}]}