{"word":"Acervo","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ポルトガル語)コレクション、蓄積、遺産、アーカイブ","english_definition":"(Portuguese) Collection, accumulation, heritage, archive. Refers to a collection of items, documents, or knowledge accumulated over time. Can also refer to a cultural or historical heritage.","examples":[{"sentence":"O museu possui um vasto acervo de arte moderna.","translation":"The museum has a vast collection of modern art.","notes":"Collection of art pieces."},{"sentence":"O acervo documental da biblioteca é muito importante para a pesquisa histórica.","translation":"The documentary archive of the library is very important for historical research.","notes":"Documentary archive."},{"sentence":"Este acervo cultural deve ser preservado para as futuras gerações.","translation":"This cultural heritage must be preserved for future generations.","notes":"Cultural heritage."}],"collocations":["Acervo bibliográfico (bibliographic collection)","Acervo documental (documentary collection)","Acervo histórico (historical collection/heritage)","Acervo cultural (cultural heritage)","Acervo artístico (artistic collection)"],"synonyms":["Coleção (collection)","Conjunto (set)","Repertório (repertoire)","Espólio (estate, legacy)","Patrimônio (heritage, patrimony)"],"antonyms":[]}],"etymology":{"value":"From Latin *acervus*, meaning 'heap' or 'pile'.","priority":"★★☆"},"pronunciation":{"ipa":"/aˈsɛɾvu/","syllables":"A-cer-vo"},"inflection":{"noun_gender":"masculine","noun_plural":"acervos"},"usage_notes":{"explanation":"In Portuguese, *acervo* is a versatile noun that can refer to various types of collections, including books, documents, art pieces, and cultural artifacts. It often implies a significant accumulation of items over time. It can also be used in a more abstract sense to refer to a cultural or historical heritage. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"O acervo de lixo na rua era enorme.","correct":"A quantidade de lixo na rua era enorme.","note":"While *acervo* refers to a collection, it is not typically used for garbage or waste. *Quantidade* (quantity) is more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["Acumulação (accumulation)","Colecionar (to collect)","Arquivar (to archive)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency in Portuguese.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"*Acervo* is a noun used in Portuguese to describe a collection or accumulation of items, knowledge, or cultural heritage. It is commonly found in academic, cultural, and historical contexts. The word implies a significant and often valuable collection that has been gathered over time. It's important to understand the context to determine the specific type of collection being referred to (e.g., a library's *acervo* of books, a museum's *acervo* of artifacts, or a nation's *acervo* of cultural traditions)."},"example_sentences":[{"sentence":"A biblioteca digital disponibiliza um vasto acervo de livros eletrônicos.","translation":"The digital library provides a vast collection of electronic books.","type":"noun","meaning_category":"Collection of books."},{"sentence":"O acervo histórico da cidade foi danificado pelas enchentes.","translation":"The historical heritage of the city was damaged by the floods.","type":"noun","meaning_category":"Historical heritage."},{"sentence":"O artista doou parte do seu acervo pessoal para o museu.","translation":"The artist donated part of his personal collection to the museum.","type":"noun","meaning_category":"Personal collection."}]}