{"word":"self-reporting","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己申告、自己報告","english_definition":"The act of providing information about oneself, typically in response to a survey, questionnaire, or interview.","examples":[{"sentence":"The study relied on self-reporting of symptoms by the participants.","translation":"その研究は参加者による症状の自己申告に頼っていた。"},{"sentence":"Self-reporting can be subject to biases, such as social desirability bias.","translation":"自己申告は、社会的望ましさバイアスのような偏りの影響を受けやすい。"},{"sentence":"The survey used self-reporting to gather data on alcohol consumption.","translation":"その調査はアルコール消費に関するデータを収集するために自己報告を用いた。"}],"collocations":["self-reporting bias (自己申告バイアス)","self-reporting questionnaire (自己申告式アンケート)","rely on self-reporting (自己申告に頼る)","accurate self-reporting (正確な自己申告)"],"synonyms":["self-disclosure","self-assessment","subjective reporting"],"antonyms":["objective measurement","third-party reporting","observation"]},{"part_of_speech":"adjective","definition":"自己申告の、自己報告による","english_definition":"Relating to or based on information provided by the person being studied or assessed.","examples":[{"sentence":"The data are based on self-reporting measures.","translation":"データは自己申告による測定に基づいている。"},{"sentence":"Self-reporting data may not always be reliable.","translation":"自己申告データは必ずしも信頼できるとは限らない。"},{"sentence":"The study used a self-reporting instrument to assess anxiety levels.","translation":"その研究は不安レベルを評価するために自己申告式の道具を用いた。"}],"collocations":["self-reporting data (自己申告データ)","self-reporting measure (自己申告による測定)","self-reporting study (自己申告研究)","self-reporting instrument (自己申告式器具)"],"synonyms":["subjective","self-assessed"],"antonyms":["objective","observed"]}],"etymology":{"value":"The term is formed by combining \"self\" (referring to oneself) and \"reporting\" (the act of providing information).","priority":"★★★"},"pronunciation":{"ipa":"/ˌself rɪˈpɔːrtɪŋ/","syllables":"self-re-port-ing"},"inflection":{"noun_plural":"self-reportings (rarely used)"},"usage_notes":{"explanation":"\"Self-reporting\" refers to the process where individuals provide information about themselves, their behaviors, or their experiences. This is commonly used in research, surveys, and clinical settings. However, it's important to be aware that self-reporting can be influenced by various biases, such as the tendency to present oneself in a favorable light (social desirability bias) or difficulty accurately recalling past events (recall bias). Therefore, researchers often use strategies to minimize these biases and may supplement self-reported data with objective measures or data from other sources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The report was self-reported by the researcher.","correct":"✓ The data were self-reported by the participants.","note":"\"Self-reporting\" describes the *source* of the information (the individual themselves), not the action of reporting. The researcher doesn't self-report; the *participants* do. The researcher *collects* the self-reported data."},{"incorrect":"✗ Self-report is always accurate.","correct":"✓ Self-reporting is subject to biases and may not always be accurate.","note":"It is crucial to acknowledge the potential for biases in self-reported data. It's not inherently inaccurate, but researchers should be aware of the limitations."}],"priority":"★★☆"},"related_words":{"derivatives":["self-report (noun, verb)","report (noun, verb)","reporting (noun)"],"phrasal_verbs":[],"related_concepts":["social desirability bias","recall bias","survey methodology","questionnaire design","psychological assessment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and research contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-reporting\" is a term primarily used in research and academic contexts, particularly in fields like psychology, sociology, and public health. It describes a method of data collection where individuals provide information about themselves, such as their behaviors, attitudes, or experiences. The term implies a subjective perspective, and it's often contrasted with objective measures or data from external sources. Understanding the term requires familiarity with research methodologies and the potential limitations of subjective data. The level is C1 due to its specialized usage and the need to understand related concepts like bias and validity.","priority":"★★☆"},"example_sentences":[{"sentence":"The study used **self-reporting** to assess the participants' levels of stress.","translation":"その研究は参加者のストレスレベルを評価するために自己申告を用いた。","type":"noun","meaning_category":"自己申告"},{"sentence":"**Self-reporting** questionnaires are a common tool in psychological research.","translation":"自己申告式アンケートは心理学研究における一般的なツールである。","type":"adjective","meaning_category":"自己申告の"},{"sentence":"The researchers acknowledged the limitations of relying solely on **self-reporting**.","translation":"研究者たちは自己申告のみに頼ることの限界を認めた。","type":"noun","meaning_category":"自己申告"},{"sentence":"The accuracy of **self-reporting** can be affected by social desirability bias.","translation":"自己申告の正確さは、社会的望ましさバイアスによって影響を受ける可能性がある。","type":"noun","meaning_category":"自己申告"},{"sentence":"The **self-reporting** data were compared with objective measures to assess validity.","translation":"妥当性を評価するために、自己申告データは客観的な測定と比較された。","type":"adjective","meaning_category":"自己申告の"}]}