{"word":"ignitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"点火性の、発火性の、着火しやすい","english_definition":"Capable of igniting or causing to ignite; readily combustible.","examples":[{"sentence":"The ignitive properties of the substance made it dangerous to handle.","translation":"その物質の点火性により、取り扱いが危険になった。"},{"sentence":"The ignitive mixture was carefully prepared to ensure a rapid start.","translation":"迅速な始動を確実にするために、点火性の混合物が慎重に準備された。"}],"collocations":["ignitive substance (点火性物質)","ignitive mixture (点火性混合物)","ignitive power (点火力)"],"synonyms":["inflammable","combustible","flammable","incendiary","pyrophoric"],"antonyms":["nonflammable","incombustible"]}],"etymology":{"value":"From Latin 'ignitus', past participle of 'ignire' (to set on fire), from 'ignis' (fire).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪɡnɪtɪv/","syllables":"ig-ni-tive"},"inflection":{"notes":"Comparative and superlative forms are 'more ignitive' and 'most ignitive', respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Ignitive' describes materials or conditions that can easily catch fire or cause something else to catch fire. It is often used in technical or scientific contexts when discussing the properties of substances. While similar to 'flammable' or 'combustible,' 'ignitive' specifically emphasizes the ability to initiate combustion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ignitive gas was released accidentally.","correct":"✓ The flammable gas was released accidentally.","note":"While 'ignitive' is correct, 'flammable' is more commonly used in general contexts to describe gases that can catch fire easily."}],"priority":"★★☆"},"related_words":{"derivatives":["ignite (verb: to set on fire)","ignition (noun: the act of setting something on fire; the process of starting combustion in an engine)","ignitability (noun: the ability to be ignited)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ignitive' is a technical term used to describe something that can easily start a fire. It is not a common word in everyday conversation, but you might encounter it in scientific or safety-related contexts. For example, you might read about the 'ignitive properties' of a chemical in a lab report. It's important to understand that 'ignitive' emphasizes the ability to initiate combustion, distinguishing it from general flammability."},"example_sentences":[{"sentence":"The experiment demonstrated the material's highly ignitive nature.","translation":"その実験は、その材料の非常に高い点火性を示した。","type":"adjective","meaning_category":"点火性"},{"sentence":"The ignitive temperature of the fuel was critical for engine performance.","translation":"燃料の着火温度は、エンジン性能にとって重要だった。","type":"adjective","meaning_category":"発火性"}]}