{"word":"subjectification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"主観化、主体化","english_definition":"The process by which something external becomes internalized or understood from a subjective perspective; the process of becoming a subject or individual with one's own thoughts, feelings, and agency.","examples":[{"sentence":"The subjectification of political issues can lead to polarized debates.","translation":"政治問題の主観化は、議論の二極化につながる可能性がある。"},{"sentence":"Through therapy, the patient began a process of subjectification, recognizing their own needs and desires.","translation":"セラピーを通して、患者は主体化のプロセスを開始し、自身のニーズや欲求を認識し始めた。"},{"sentence":"Foucault explored the ways in which power structures contribute to the subjectification of individuals.","translation":"フーコーは、権力構造が個人の主体化にどのように貢献するかを探求した。"}],"collocations":["process of subjectification","linguistic subjectification","cultural subjectification","political subjectification"],"synonyms":["internalization","personalization","individuation","becoming a subject","subjectivization"],"antonyms":["objectification","alienation","dehumanization"]}],"etymology":{"value":"Derived from 'subject' (the individual or entity experiencing or acting) and '-ification' (the process of making or becoming).","priority":"★★★"},"pronunciation":{"ipa":"/səbˌdʒɛktɪfɪˈkeɪʃən/","syllables":"sub-jec-ti-fi-ca-tion"},"inflection":{"noun_plural":"subjectifications"},"usage_notes":{"explanation":"'Subjectification' refers to the process by which an individual develops a subjective understanding of the world and their place within it. It is often used in philosophical, sociological, and linguistic contexts to describe how external forces, such as language, culture, and power structures, shape individual identity and consciousness. It can also refer to the act of interpreting something objectively as subjective.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The subjectification was completed immediately.","correct":"The process of subjectification takes time.","note":"Subjectification is a process, not an event that can be completed instantaneously."},{"incorrect":"Objectification is the same as subjectification.","correct":"Objectification is the opposite of subjectification.","note":"Objectification treats someone as an object, while subjectification is the process of becoming a subject."}],"priority":"★★☆"},"related_words":{"derivatives":["subjectify (verb)","subjective (adjective)","subjectivity (noun)"],"related_terms":["intersubjectivity","subject position","agency"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in academic and theoretical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subjectification' is a complex term often used in academic fields like philosophy, sociology, and linguistics. It describes the process by which someone develops their own individual thoughts, feelings, and sense of self, often influenced by external factors like culture and language. It's about how we become subjects with our own perspectives rather than just objects being acted upon. Understanding this term requires familiarity with abstract concepts and theoretical frameworks."},"example_sentences":[{"sentence":"The artist's work explored the **subjectification** of women in advertising.","translation":"そのアーティストの作品は、広告における女性の主体化を探求した。","type":"noun","meaning_category":"process of becoming a subject"},{"sentence":"Linguistic **subjectification** can be seen in how speakers express their attitudes and emotions through language.","translation":"言語的主体化は、話し手が言語を通して自身の態度や感情を表現する方法に見られる。","type":"noun","meaning_category":"linguistic process"},{"sentence":"The novel depicts the protagonist's journey of **subjectification** as they grapple with societal expectations.","translation":"その小説は、主人公が社会の期待と格闘しながら主体化の旅をする様子を描いている。","type":"noun","meaning_category":"personal development"}]}