{"word":"crisp-leaved","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having crisp (stiff and easily broken) leaves.","english_definition":"Describing a plant or variety of plant that has leaves which are stiff, brittle, and easily broken or crumbled.","examples":[{"sentence":"The crisp-leaved lettuce is a popular choice for salads.","translation":"パリッとした葉のレタスはサラダによく使われます。"},{"sentence":"She preferred the crisp-leaved variety of spinach for its texture.","translation":"彼女は食感のために、葉がパリッとした種類のホウレンソウを好んだ。"}],"collocations":["crisp-leaved lettuce","crisp-leaved spinach","crisp-leaved kale"],"synonyms":["curly-leaved","crinkled-leaved"],"antonyms":["smooth-leaved","flat-leaved"]}],"etymology":{"value":"Combination of 'crisp' (describing the texture) and 'leaved' (having leaves).","priority":"N/A"},"pronunciation":{"ipa":"/ˌkrɪsp ˈliːvd/","syllables":"crisp-leaved"},"inflection":{},"usage_notes":{"explanation":"This term is typically used in botany, horticulture, and cooking to describe specific varieties of plants, especially leafy greens, that have a particular texture. It is not a commonly used word in everyday conversation.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["crisp (adjective)","leaf (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'crisp-leaved' is a specialized adjective primarily used in botanical or culinary contexts to describe plants with leaves that have a stiff, brittle texture. Due to its specific usage, it is not commonly encountered in general language. Understanding the meaning of 'crisp' and 'leaved' separately can help in deciphering the compound word."},"example_sentences":[{"sentence":"The farmer cultivated several varieties of crisp-leaved vegetables.","translation":"その農家はいくつかの種類の葉がパリッとした野菜を栽培した。","type":"general","meaning_category":"description"},{"sentence":"This particular strain of basil is known for its uniquely crisp-leaved texture.","translation":"この特定の種類のバジルは、独特の葉のパリッとした食感で知られている。","type":"specific","meaning_category":"description"}]}