{"word":"lighterage","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"艀(はしけ)輸送、艀運送","english_definition":"The process of transferring goods between a ship and the shore using barges or lighters.","examples":[{"sentence":"Lighterage was necessary to unload the cargo ship because the port was too shallow.","translation":"港が浅すぎたため、貨物船から荷物を降ろすには艀輸送が必要だった。"},{"sentence":"The cost of lighterage added significantly to the overall shipping expenses.","translation":"艀輸送の費用が、全体的な輸送費を大幅に増加させた。"}],"collocations":["lighterage costs","lighterage services","perform lighterage","avoid lighterage"],"synonyms":["barge transport","bargeage","ferryage"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'lighter,' referring to a type of flat-bottomed barge used for transferring goods, combined with the suffix '-age,' indicating a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlaɪtərɪdʒ","syllables":"li-ter-age"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Lighterage is specifically used when ships cannot dock directly at a port due to shallow waters or lack of docking facilities. Barges (lighters) are used to transport goods to and from the ship.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lighteraged goods were delivered.","correct":"✓ The goods transported by lighterage were delivered.","note":"'Lighterage' is a process, not an adjective to describe goods. Use a descriptive phrase instead."}],"priority":"★★☆"},"related_words":{"derivatives":["lighter (noun: a flat-bottomed barge)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lighterage' refers to the process of using barges (lighters) to transfer goods between a ship anchored offshore and the land. This is typically done when the ship cannot dock directly at the port. It's a specialized term used in shipping and logistics.","priority":"★★★"},"example_sentences":[{"sentence":"The company specialized in providing lighterage services for large cargo ships.","translation":"その会社は大型貨物船のための艀輸送サービスの提供を専門としていた。","type":"noun","meaning_category":"艀輸送"},{"sentence":"Due to the shallow draft of the harbor, lighterage was the only viable option for unloading the vessel.","translation":"港の喫水が浅いため、艀輸送が船舶からの荷降ろしにおける唯一の実行可能な選択肢だった。","type":"noun","meaning_category":"艀輸送"}]}