{"word":"snottie","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"鼻水まみれの、鼻水を垂らした","english_definition":"Covered with nasal mucus; having a runny nose.","examples":[{"sentence":"The child had a snottie nose and kept wiping it with his sleeve.","translation":"その子は鼻水を垂らしていて、袖で何度も拭いていた。"},{"sentence":"She gave the snottie tissue to her mom.","translation":"彼女は鼻水で汚れたティッシュをお母さんに渡した。"}],"collocations":["snottie nose","snottie tissue"],"synonyms":["runny-nosed","mucousy"],"antonyms":["clean","clear"]},{"part_of_speech":"adjective","definition":"（俗語、主にイギリス英語）気取った、傲慢な、見下した","english_definition":"(Slang, mainly British English) conceited, arrogant, or snobbish.","examples":[{"sentence":"He's a snottie little brat who thinks he's better than everyone else.","translation":"彼は自分が誰よりも優れていると思っている気取ったガキだ。"},{"sentence":"Don't be so snottie; no one likes a show-off.","translation":"そんなに気取るな。自慢好きな奴は誰も好きじゃない。"}],"collocations":["snottie little brat","snottie attitude"],"synonyms":["snobbish","arrogant","conceited","haughty","superior"],"antonyms":["humble","modest","down-to-earth"]},{"part_of_speech":"noun","definition":"（俗語、主にイギリス英語）鼻水、鼻くそ","english_definition":"(Slang, mainly British English) nasal mucus; snot.","examples":[{"sentence":"Wipe your snottie before it drips on the floor.","translation":"鼻水が床に垂れる前に拭きなさい。"},{"sentence":"He flicked a snottie onto the ground.","translation":"彼は鼻くそを地面に弾き飛ばした。"}],"collocations":["wipe your snottie","flick a snottie"],"synonyms":["snot","mucus"]}],"etymology":{"value":"Derived from 'snot,' referring to nasal mucus, with the addition of the adjective suffix '-y' or '-ie'. The sense of 'conceited' likely arose from the association of nasal mucus with childishness and unpleasantness, implying a disdainful attitude.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsnɒti/","syllables":"snot-tie"},"inflection":{"noun_plural":"snotties"},"usage_notes":{"explanation":"The word 'snottie' has two main meanings, one literal and one figurative. The literal meaning refers to someone or something covered in nasal mucus. The figurative meaning, primarily in British English slang, describes someone who is arrogant, conceited, or snobbish. Context is crucial in determining the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was snottie because he had a cold.","correct":"✓ He was snottie because he thought he was better than everyone else.","note":"When using 'snottie' to mean arrogant, it refers to a person's attitude, not necessarily their physical condition. If someone has a cold, it's more accurate to say they have a runny nose or are congested."},{"incorrect":"✗ She's a very snottie person, always helping others.","correct":"✓ She's a very kind person, always helping others.","note":"'Snottie' implies arrogance or snobbishness, which is the opposite of being helpful or kind. Using 'snottie' in this context would be contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["snot (noun: nasal mucus)","snotty (adjective: same as snottie)","snottiness (noun: the state of being snottie)"],"phrasal_verbs":[],"related_adjectives":["arrogant","conceited","snobbish","haughty"],"related_nouns":["brat","show-off"]},"level_frequency":{"CEFR":"B2 (slang usage)","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Snottie' is a word with two distinct meanings. The first, and more literal, meaning refers to someone with a runny nose or covered in nasal mucus. The second, and more figurative, meaning is primarily used in British English slang to describe someone who is arrogant, conceited, or snobbish. The figurative meaning is more nuanced and less common, requiring a good understanding of context to interpret correctly. It's important to be aware of both meanings to avoid miscommunication.","priority":"★★☆"},"example_sentences":[{"sentence":"The toddler had a **snottie** face after playing outside in the cold.","translation":"その幼児は寒い中外で遊んだ後、顔が鼻水まみれだった。","type":"adjective","meaning_category":"鼻水まみれの"},{"sentence":"He's such a **snottie**; he always brags about his expensive car.","translation":"彼は本当に気取っていて、いつも自分の高級車について自慢している。","type":"adjective","meaning_category":"気取った、傲慢な"},{"sentence":"Wipe that **snottie** off your face!","translation":"顔についている鼻水を拭きなさい！","type":"noun","meaning_category":"鼻水"}]}