{"word":"Ionist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A supporter of Ionism, a movement advocating for the standardization and purification of the Greek language, particularly the rejection of Attic Greek influence.","english_definition":"A person who supports Ionism, a linguistic movement in Greece.","examples":[{"sentence":"The Ionists believed that a pure form of the Greek language should be based on the common vernacular.","translation":"イオニア主義者たちは、ギリシャ語の純粋な形は共通の口語に基づいているべきだと信じていた。"},{"sentence":"He was a fervent Ionist, actively campaigning for linguistic reform.","translation":"彼は熱心なイオニア主義者で、言語改革を積極的に提唱していた。"}],"collocations":["fervent Ionist","leading Ionist","prominent Ionist"],"synonyms":["Demoticist","Purist"],"antonyms":["Atticist"],"notes":"Ionism was a significant movement in the 19th and early 20th centuries.","related_terms":["Ionism","Demotic Greek","Attic Greek"]}],"etymology":{"value":"Derived from 'Ion', referring to the Ionian dialect of ancient Greek, and the suffix '-ist', denoting a supporter or follower of a particular ideology or movement.","priority":"★★☆"},"pronunciation":{"ipa":"ˈaɪənɪst","syllables":"I-o-nist"},"inflection":{"noun_plural":"Ionists"},"usage_notes":{"explanation":"The term 'Ionist' specifically refers to proponents of the Ionist movement, which aimed to establish Demotic Greek (the vernacular) as the standard form of the language, distancing it from the perceived artificiality of Attic Greek. The movement was most active during the 19th and early 20th centuries in Greece.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Ionist in physics.","correct":"✓ He is an expert in ion physics.","note":"'Ionist' refers specifically to the linguistic movement. For other contexts involving ions, use related scientific terminology."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ionism"],"related_concepts":["Diglossia","Language reform","Linguistic purism"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Ionist' is relatively specialized and primarily used in the context of the history of the Greek language. Understanding the term requires familiarity with the linguistic debates of 19th and 20th century Greece. It is unlikely to be encountered outside of academic or historical discussions. "},"example_sentences":[{"sentence":"The debate between Atticists and Ionists shaped the modern Greek language.","translation":"アッティカ主義者とイオニア主義者の間の議論は、現代ギリシャ語を形作った。","type":"noun","meaning_category":"linguistics"},{"sentence":"Many early Ionists were motivated by a desire to create a more accessible language for the common people.","translation":"初期のイオニア主義者の多くは、一般の人々にとってよりアクセスしやすい言語を作りたいという願望に動機づけられていた。","type":"noun","meaning_category":"linguistics"}]}