{"word":"Unvitreosity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being unvitreous; lack of vitreousness.","english_definition":"The state or quality of being unvitreous; lack of vitreousness.","examples":[{"sentence":"The unvitreosity of the ceramic material made it unsuitable for use in high-temperature applications.","translation":"そのセラミック材料の非ガラス質性により、高温用途での使用には適していませんでした。"}],"collocations":["degree of unvitreosity","cause of unvitreosity"],"synonyms":["nonvitrification","lack of glassiness"],"antonyms":["vitreosity","glassiness"]}],"etymology":{"value":"From un- (prefix meaning 'not') + vitreosity (the quality of being vitreous, i.e., glassy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnvɪtrɪˈɒsɪti/","syllables":"un-vit-re-os-i-ty"},"inflection":{"noun_plural":"Unvitreosities"},"usage_notes":{"explanation":"'Unvitreosity' refers to the absence or lack of a glassy, vitreous quality in a substance or material. It is often used in the context of ceramics, geology, and materials science to describe materials that have not undergone vitrification (the process of becoming glass-like) or that possess a non-glassy structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unvitreosity made the glass stronger.","correct":"✓ The unvitreosity made the material weaker.","note":"Unvitreosity implies a lack of glass-like properties, which usually means less strength and durability."}],"priority":"★☆☆"},"related_words":{"derivatives":["unvitreous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unvitreosity' is a technical term primarily used in scientific and technical contexts, specifically related to materials science, ceramics, and geology. It describes the condition of a material that lacks the properties of glass or has not undergone vitrification. Due to its specialized usage, it is not commonly encountered in general English. Understanding requires familiarity with the concept of vitrification and material properties."},"example_sentences":[{"sentence":"The high alumina content contributed to the unvitreosity of the refractory brick.","translation":"高アルミナ含有量は、耐火レンガの非ガラス質性に寄与しました。","type":"general","meaning_category":"lack of vitreousness"},{"sentence":"Microscopic analysis revealed the unvitreosity of the sample, indicating incomplete fusion of the particles.","translation":"顕微鏡分析により、サンプルの非ガラス質性が明らかになり、粒子の不完全な融解が示されました。","type":"technical","meaning_category":"lack of glassiness"}]}