{"word":"Ampholytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"両性電解質の、両性イオン性の","english_definition":"Relating to or being an ampholyte; having both acidic and basic groups in the same molecule.","examples":[{"sentence":"Ampholytic polymers are used in various applications due to their unique properties.","translation":"両性電解質ポリマーは、その独特な特性により、さまざまな用途で使用されています。"},{"sentence":"The ampholytic nature of amino acids allows them to act as both acids and bases.","translation":"アミノ酸の両性電解質としての性質により、酸および塩基として作用することができます。"}],"collocations":["ampholytic polymer","ampholytic ion","ampholytic solution"],"synonyms":["amphoteric","zwitterionic"],"antonyms":["non-ampholytic"]}],"etymology":{"value":"Derived from 'ampholyte,' which combines 'amphi-' (meaning 'both' or 'of both kinds') with '-lyte' (referring to an electrolyte).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmfəˈlɪtɪk/","syllables":"am-pho-ly-tic"},"inflection":{"notes":"Adjective; no specific inflections beyond comparative/superlative, which are rarely used."},"usage_notes":{"explanation":"'Ampholytic' describes substances, especially molecules, that can act as both an acid and a base. This behavior is due to the presence of both acidic and basic functional groups within the same molecule. Amino acids are a classic example of ampholytic compounds. The term is primarily used in chemistry and biochemistry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction was ampholytic, so it only acted as an acid.","correct":"✓ The reaction involved an ampholytic substance, allowing it to act as both an acid and a base.","note":"Ampholytic substances can act as both acids and bases, not just one or the other."}],"priority":"★★☆"},"related_words":{"derivatives":["ampholyte (noun: a molecule containing both acidic and basic groups)","amphoterism (noun: the property of being amphoteric)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ampholytic' is a technical term primarily used in chemistry and biochemistry. It describes a substance that can act as both an acid and a base. Understanding this term requires a background in chemistry, particularly acid-base chemistry and the structure of molecules like amino acids."},"example_sentences":[{"sentence":"The isoelectric point of an ampholytic protein is the pH at which it carries no net electrical charge.","translation":"両性電解質タンパク質の等電点は、正味の電荷を帯びていないpHです。","type":"adjective","meaning_category":"chemistry"},{"sentence":"Ampholytic surfactants are effective in a wide range of pH conditions.","translation":"両性電解質界面活性剤は、広範囲のpH条件下で効果的です。","type":"adjective","meaning_category":"chemistry"}]}