{"word":"narcotization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"麻酔、麻酔状態、麻痺状態","english_definition":"The act or process of narcotizing; the state of being narcotized.","examples":[{"sentence":"The narcotization of the patient was carefully monitored by the anesthesiologist.","translation":"患者の麻酔状態は麻酔科医によって注意深く監視された。"},{"sentence":"Prolonged exposure to the chemical led to narcotization of the nervous system.","translation":"その化学物質への長期暴露は、神経系の麻痺を引き起こした。"}],"collocations":["general narcotization (全身麻酔)","partial narcotization (部分麻酔)","cerebral narcotization (脳の麻酔)"],"synonyms":["anesthesia","narcosis","stupefaction","torpor","insensibility"],"antonyms":["stimulation","activation","sensitization"]}],"etymology":{"value":"From 'narcotize' + '-ation'. 'Narcotize' is derived from 'narcotic' + '-ize'. 'Narcotic' comes from the French 'narcotique' and ultimately from the Greek 'narkotikos' (making numb), from 'narkē' (numbness, torpor).","priority":"★★☆"},"pronunciation":{"ipa":"ˌnɑːrkətaɪˈzeɪʃən/","syllables":"nar-co-ti-za-tion"},"inflection":{"noun_plural":"narcotizations"},"usage_notes":{"explanation":"'Narcotization' refers to the process of inducing a state of narcosis, or the state itself. Narcosis involves a depression of the central nervous system, leading to reduced awareness, responsiveness, and sometimes loss of consciousness. It is often used in medical contexts to describe anesthesia or the effects of certain drugs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The narcotization was very stimulate.","correct":"✓ The narcotization was very effective.","note":"'Narcotization' describes a state of reduced activity, not stimulation. 'Effective' is a more appropriate adjective to describe the success of the process."},{"incorrect":"✗ He suffered from narcotization after the surgery.","correct":"✓ He was narcotized during the surgery. / ✓ He experienced the effects of narcotization after the surgery.","note":"'Narcotization' is a process or state, not a condition one suffers from. Use 'was narcotized' to describe being under anesthesia or 'experienced the effects of narcotization' to describe the after-effects."}],"priority":"★☆☆"},"related_words":{"derivatives":["narcotize (verb: to subject to the influence of a narcotic)","narcotic (noun/adjective: a drug that induces narcosis)","narcosis (noun: a state of stupor, drowsiness, or unconsciousness produced by a drug)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Narcotization' is a technical term referring to the process of inducing a state of narcosis, which involves depressing the central nervous system to reduce awareness and responsiveness. It is primarily used in medical or scientific contexts. The word is derived from 'narcotic' and implies a state of numbness or insensibility. Understanding this term requires a good grasp of medical terminology and related concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The surgeon administered the drug to ensure complete narcotization before the operation.","translation":"外科医は手術前に完全な麻酔状態を確実にするために薬物を投与した。","type":"general","meaning_category":"麻酔"},{"sentence":"The narcotization of the brain cells led to a temporary loss of function.","translation":"脳細胞の麻酔は一時的な機能喪失を引き起こした。","type":"scientific","meaning_category":"麻痺状態"},{"sentence":"The patient experienced a smooth recovery from narcotization after the procedure.","translation":"患者は手術後、麻酔からのスムーズな回復を経験した。","type":"medical","meaning_category":"麻酔状態"}]}