{"word":"biformed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二つの形を持つ、二重の形態の","english_definition":"Having two forms or shapes.","examples":[{"sentence":"The mythical creature was biformed, with the head of a lion and the body of a goat.","translation":"その神話上の生き物は、ライオンの頭とヤギの体を持つ二重の形態をしていた。"},{"sentence":"Some deities in ancient religions were depicted as biformed, representing dual aspects of their nature.","translation":"古代宗教における一部の神々は、その性質の二面性を表す二重の形態として描かれていた。"}],"collocations":["biformed deity","biformed creature"],"synonyms":["dimorphous","dual-formed","double-shaped"],"antonyms":["uniform","single-formed"]}],"etymology":{"value":"From the Latin 'bi-' (two) + 'formatus' (formed), past participle of 'formare' (to form).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbaɪfɔrmd/","syllables":"bi-formed"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"The term 'biformed' is relatively rare and often used in academic or mythological contexts to describe something with two distinct forms. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The biformed building was modern and old at the same time.","correct":"✓ The building had two distinct sections, one modern and one old.","note":"'Biformed' is typically used for a single entity with two forms, not for something composed of two separate entities. In this case, it is better to describe the building as having two distinct sections."}],"priority":"★☆☆"},"related_words":{"derivatives":["biformity (noun): the state of having two forms"],"related_terms":["bifurcate (verb): to divide into two branches or forks","bifocal (adjective): having two focuses"]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Biformed' is a relatively uncommon word used to describe something that has two distinct forms or shapes. It is often found in academic, mythological, or scientific contexts. Due to its specialized usage and low frequency, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The statue of Janus, the Roman god of beginnings, is often depicted as biformed, with one face looking to the future and one to the past.","translation":"始まりのローマ神であるヤヌスの像は、未来を見つめる顔と過去を見つめる顔を持つ二重の形態として描かれることが多い。","type":"adjective","meaning_category":"having two forms"},{"sentence":"In some cultures, shamans are believed to be biformed, able to transform between human and animal shapes.","translation":"一部の文化では、シャーマンは人間と動物の姿を変換できる二重の形態を持つと信じられている。","type":"adjective","meaning_category":"having two forms"}]}