{"word":"underoxidised","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"（化学反応において）酸化が不十分な、酸化が不完全な","english_definition":"Not sufficiently oxidized; having undergone incomplete oxidation.","examples":[{"sentence":"The fuel was underoxidised, resulting in incomplete combustion.","translation":"燃料が不完全に酸化されたため、不完全燃焼が起きた。"},{"sentence":"Underoxidised metals may exhibit different properties.","translation":"酸化が不十分な金属は、異なる特性を示すことがある。"}],"collocations":["underoxidised fuel (酸化不足の燃料)","underoxidised metal (酸化不足の金属)"],"synonyms":["partially oxidized","incompletely oxidized"],"antonyms":["overoxidized","fully oxidized"]}],"etymology":{"value":"'under-' (不十分) + 'oxidised' (酸化された)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndərˈɒksɪdaɪzd/","syllables":"un-der-ox-i-dised"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Underoxidised' is primarily used in scientific and technical contexts, particularly in chemistry and materials science, to describe a substance or compound that has not undergone complete oxidation. It implies that the oxidation process was either halted prematurely or did not proceed to the extent required for complete oxidation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was underoxidised.","correct":"✓ The food was undercooked.","note":"'Underoxidised' is generally not used in the context of food. 'Undercooked' is the appropriate term for food that has not been cooked sufficiently."},{"incorrect":"✗ The air was underoxidised.","correct":"✓ The air had a low oxygen content.","note":"'Underoxidised' is not typically used to describe air. Instead, one would say that the air has a low oxygen content."}],"priority":"★★☆"},"related_words":{"derivatives":["underoxidize (verb)","oxidation (noun)","oxidized (adjective)"],"related_terms":["reduction","redox reaction","combustion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underoxidised' is a technical term used in chemistry and related fields. It means that a substance has not been fully oxidized, meaning it hasn't reacted with oxygen to its fullest potential. This term is not commonly used in everyday language and is mostly found in scientific literature or technical discussions. Understanding this term requires a basic knowledge of chemical reactions and oxidation processes."},"example_sentences":[{"sentence":"The catalyst prevented the complete oxidation of the hydrocarbons, resulting in underoxidised byproducts.","translation":"触媒は炭化水素の完全な酸化を妨げ、酸化不足の副産物を生じさせた。","type":"adjective","meaning_category":"化学"},{"sentence":"The analysis revealed that the iron sample was significantly underoxidised.","translation":"分析の結果、鉄のサンプルが著しく酸化不足であることが明らかになった。","type":"adjective","meaning_category":"材料科学"}]}