{"word":"Dualists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二元論者たち、二元論を信奉する人々","english_definition":"Plural form of 'dualist'. People who believe in dualism, the philosophical view that reality consists of two fundamentally different substances or principles, often mind and matter.","examples":[{"sentence":"The debate between the monists and the dualists continued for centuries.","translation":"一元論者と二元論者の間の議論は何世紀も続いた。"},{"sentence":"Many early philosophers were dualists, believing in a separate soul and body.","translation":"多くの初期の哲学者は、魂と肉体が別であると信じる二元論者だった。"}],"collocations":["mind-body dualists (心身二元論者)","Cartesian dualists (デカルト的二元論者)"],"synonyms":["dichotomists","divisionists"],"antonyms":["monists","holists","materialists"]},{"part_of_speech":"noun","definition":"(歴史的な文脈で) カタリ派などの二元論的な宗教の信者たち","english_definition":"(historical context) Followers of dualistic religions, such as the Cathars, who believed in a good god and an evil god.","examples":[{"sentence":"The medieval dualists of Southern France were persecuted for their beliefs.","translation":"南フランスの中世の二元論者たちは、その信仰のために迫害された。"}],"collocations":["medieval dualists (中世の二元論者)","religious dualists (宗教的な二元論者)"],"synonyms":["Cathars","Albigensians","Manicheans"],"antonyms":[]}],"etymology":{"value":"From 'dualist', which comes from 'dual' (two) + '-ist' (a person who believes in or practices something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdjuːəlɪsts/","syllables":"Du-al-ists"},"inflection":{"noun_plural":"Dualists"},"usage_notes":{"explanation":"'Dualists' refers to multiple people who adhere to the philosophical or religious doctrine of dualism. In philosophy, it often refers to the belief that mind and body are distinct entities. In religious contexts, it can refer to those who believe in two opposing forces or deities, one good and one evil.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dualists.","correct":"✓ He is a dualist.","note":"'Dualists' is plural; use 'dualist' for a single person."}],"priority":"★★☆"},"related_words":{"derivatives":["dualist (noun: a single believer in dualism)","dualism (noun: the belief in two fundamental principles)","dualistic (adjective: relating to dualism)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dualists' is a term used in philosophy and religious studies to describe people who believe in dualism. Dualism is the idea that there are two fundamental and distinct aspects to reality, such as mind and body, or good and evil. This term is more common in academic discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The conference featured presentations from both materialists and dualists.","translation":"その会議では、唯物論者と二元論者の両方からの発表が行われた。","type":"noun","meaning_category":"Philosophical Belief"},{"sentence":"Historical accounts describe the persecution of dualists during the Middle Ages.","translation":"歴史的な記録は、中世における二元論者の迫害について記述している。","type":"noun","meaning_category":"Religious Belief"}]}