{"word":"anteposthumous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"死後よりも前に起こるべきだった、または起こると期待されていた","english_definition":"occurring or appearing earlier than what would be expected after death.","examples":[{"sentence":"The book was an anteposthumous publication, as the author had intended to publish it before their death but was unable to.","translation":"その本は死後出版されたが、著者は生前に出版するつもりだったため、本来は生前に出版されるべきだった。"},{"sentence":"The award was given as an anteposthumous honor, recognizing the work the artist should have been celebrated for during their lifetime.","translation":"その賞は、アーティストが生前に評価されるべきだった業績を称える、生前贈られるべきだった名誉として授与された。"}],"collocations":["anteposthumous publication","anteposthumous award","anteposthumous recognition"],"synonyms":["premature","pre-death","premortem"],"antonyms":["posthumous"]},{"part_of_speech":"adjective","definition":"死後の出来事によって影響を受けた","english_definition":"affected or influenced by events occurring after death.","examples":[{"sentence":"The value of his paintings became anteposthumous, increasing significantly after his death due to renewed interest.","translation":"彼の絵画の価値は、死後の出来事によって影響を受け、新たな関心が高まったために死後大幅に上昇した。"},{"sentence":"Her reputation experienced an anteposthumous revival, as critics re-evaluated her work long after she had passed away.","translation":"彼女の評判は、死後の出来事によって復活し、批評家たちは彼女の死後長い年月を経て彼女の作品を再評価した。"}],"collocations":["anteposthumous value","anteposthumous reputation","anteposthumous fame"],"synonyms":["post-mortem influenced","death-affected"],"antonyms":["unaffected by death"]}],"etymology":{"value":"\"ante-\" (before) + \"posthumous\" (occurring after death). The word suggests something that should have happened before death but is somehow tied to events after death.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈpɒstjʊməs/","syllables":"an-te-pos-thu-mous"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"\"Anteposthumous\" is a relatively rare word used to describe situations where something is either intended to occur before death but happens later, or when something's value or recognition is significantly affected by events after the person's death. It's often used in the context of artistic or literary works, awards, or reputation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anteposthumous book was published before his death.","correct":"✓ The book was published posthumously.","note":"If the book was published before the author's death, it's simply a publication, not an anteposthumous one. \"Anteposthumous\" implies a connection to events after death."},{"incorrect":"✗ His success was entirely anteposthumous.","correct":"✓ His success was entirely posthumous.","note":"If the success occurred entirely after death, \"posthumous\" is the correct term. \"Anteposthumous\" suggests some element that should have happened before death."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["posthumous","ante-","pre-mortem"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Anteposthumous\" is a rare and complex word. It describes something that ideally should have happened before someone's death, or something heavily influenced by events after their passing. It's most often used in academic or literary contexts when discussing an artist's reputation, awards, or publications that are significantly affected by their death. Understanding the prefixes \"ante-\" (before) and \"posthumous\" (after death) is essential to grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist received anteposthumous recognition for their early works, which were largely ignored during their lifetime but celebrated after their death.","translation":"そのアーティストは、生前はほとんど無視されていたものの、死後に評価された初期の作品に対して、生前贈られるべきだった名誉を受けた。","type":"adjective","meaning_category":"生前贈られるべきだった名誉"},{"sentence":"The renewed interest in her writing led to an anteposthumous increase in the value of her manuscripts.","translation":"彼女の作品への関心の高まりは、彼女の原稿の価値を生前に得られるべきだったほどに高めた。","type":"adjective","meaning_category":"死後の出来事によって影響を受けた"}]}