{"word":"gowkedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ばかみたいに、愚かそうに","english_definition":"In a foolish or stupid manner; like a gowk.","examples":[{"sentence":"He stared gowkedly at the complex instructions, completely bewildered.","translation":"彼は複雑な指示をばかみたいに見つめ、完全に当惑していた。"},{"sentence":"She smiled gowkedly when she realized her mistake.","translation":"彼女は自分の間違いに気づいたとき、愚かそうに笑った。"}],"collocations":["stare gowkedly","smile gowkedly","look gowkedly"],"synonyms":["foolishly","stupidly","naively","awkwardly","clumsily"],"antonyms":["intelligently","wisely","cleverly"]}],"etymology":{"value":"Derived from the word 'gowk', which is a Scots and Northern English word for a fool or cuckoo, combined with the suffix '-edly' to form an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡaʊkli/","syllables":"gowk-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Gowkedly' is an adverb that describes actions performed in a foolish or stupid manner. It is relatively rare and more commonly used in Scots and Northern English dialects. The word implies a lack of intelligence or understanding in the way someone acts or looks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gowkedly intelligence.","correct":"✓ He acted gowkedly.","note":"'Gowkedly' is an adverb, so it modifies verbs, not nouns. It describes how someone acts, not their inherent qualities."},{"incorrect":"✗ She gowkedly a plan.","correct":"✓ She looked gowkedly at the plan.","note":"'Gowkedly' needs a verb to modify. You can't 'gowkedly' a plan; you can only look or act in a gowkedly manner."}],"priority":"★☆☆"},"related_words":{"derivatives":["gowk (noun: fool, simpleton)","gowkish (adjective: foolish, stupid)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gowkedly' is a rare and dialectal adverb, primarily used in Scots and Northern English. It means 'in a foolish or stupid manner'. Because of its rarity and regional usage, it is unlikely to be encountered by non-native speakers or in standard English contexts. Understanding requires familiarity with the base word 'gowk', which itself is not commonly used. Usage suggests a high level of English proficiency and exposure to regional dialects."},"example_sentences":[{"sentence":"The tourist, staring gowkedly at the map, clearly had no idea where he was.","translation":"観光客は地図をばかみたいに見つめ、自分がどこにいるのか全くわかっていないようだった。","type":"example","meaning_category":"foolishly"},{"sentence":"He grinned gowkedly when she complimented his terrible joke.","translation":"彼女が彼のひどい冗談を褒めたとき、彼は愚かそうにニヤニヤした。","type":"example","meaning_category":"stupidly"}]}