{"word":"Bookism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(韓国語由来のスラング) 金銭や社会的地位によって人を判断する考え方。特に、良い学歴や社会的地位を持つ人を優遇する傾向を指す。","english_definition":"(Korean slang) The idea of judging people based on their money or social status, especially the tendency to favor those with good educational backgrounds or high social positions.","examples":[{"sentence":"그녀는 명품으로 자신을 치장하며 철저한 Bookism에 빠져 있었다. (geunyeoneun myeongpumeuro jasin-eul chijanghamyeo cheoljeohan Bookism-e ppajyeo isseotda.)","translation":"She adorned herself with luxury goods and was thoroughly immersed in Bookism.","original_language":"ko"},{"sentence":"Bookism 사회에서는 학벌이 성공의 중요한 척도가 된다. (Bookism sahoeeseoneun hakbeori seonggong-ui jungyohan cheokdoga doenda.)","translation":"In a Bookism society, academic background becomes an important measure of success.","original_language":"ko"},{"sentence":"Bookism 때문에 많은 젊은이들이 과도한 경쟁에 내몰리고 있다. (Bookism ttaemune maneun jeolmeunideuri gwadohan gyeongjaeng-e naemolligo itda.)","translation":"Because of Bookism, many young people are driven into excessive competition.","original_language":"ko"}],"collocations":["Bookism 사회 (Bookism sahoe) - Bookism society","Bookism에 빠지다 (Bookism-e ppajida) - to be immersed in Bookism","Bookism적 사고 (Bookismjeok sago) - Bookism thinking"],"synonyms":["학벌주의 (hakbeoljuui) - academic elitism","지위주의 (jiuijuui) - status-ism","배금주의 (baegeumjuui) - materialism"],"antonyms":["평등주의 (pyeongdeungjuui) - egalitarianism","실력주의 (sillyeokjuui) - meritocracy"]}],"etymology":{"value":"韓国語の「배경 (背景; baegyeong)」（背景、バックグラウンド）と英語の「-ism」を組み合わせた造語。「背景」は、学歴、財産、社会的地位など、その人が持つバックグラウンドを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊkɪzəm/","syllables":"Book-ism"},"inflection":{"notes":"名詞のため、複数形は通常作られない。"},"usage_notes":{"explanation":"「Bookism」は、韓国社会における学歴偏重や、個人のバックグラウンドを重視する風潮を批判的に表現する言葉として使われることが多い。英語圏では一般的ではないため、説明が必要となる場合がある。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bookism person.","correct":"✓ He believes in Bookism. / ✓ He is influenced by Bookism.","note":"「Bookism」は主義や考え方を指す名詞であり、人を直接修飾する形容詞としては使われない。"},{"incorrect":"✗ Bookism is good for society.","correct":"✓ Bookism is often criticized for creating inequality.","note":"「Bookism」は、社会的不平等を生み出す要因として批判されることが多い。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["금수저 (geumsujeo) - gold spoon (born with a silver spoon)","흙수저 (heuksujeo) - dirt spoon (born into poverty)","헬조선 (heljoseon) - Hell Korea (despair about social mobility)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (スラングのため)","frequency_google_ngram":"低頻度 (Low frequency) - 主に韓国関連の文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Bookism」は、韓国のスラングで、人の価値を学歴や財産などの背景で判断する考え方を指します。この言葉は、社会的な不平等や機会の不均等を批判的に表現するために使われます。英語圏では一般的な言葉ではないため、使用する際には説明が必要となる場合があります。特に、韓国社会の文脈を理解していることが望ましいです。"},"example_sentences":[{"sentence":"The company's hiring practices were criticized for being based on Bookism.","translation":"その会社の採用慣行は、Bookismに基づいているとして批判された。","type":"noun","meaning_category":"金銭や社会的地位による判断"},{"sentence":"Many Koreans feel pressured to succeed academically due to the prevalence of Bookism.","translation":"多くの韓国人は、Bookismが蔓延しているため、学業で成功しなければならないというプレッシャーを感じている。","type":"noun","meaning_category":"金銭や社会的地位による判断"},{"sentence":"Bookism can lead to discrimination against those from less privileged backgrounds.","translation":"Bookismは、恵まれない環境出身の人々に対する差別につながる可能性がある。","type":"noun","meaning_category":"金銭や社会的地位による判断"}]}