{"word":"nonlubriciousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"潤滑性がないこと、滑りにくさ","english_definition":"The state or quality of lacking lubricity; the condition of being non-slippery.","examples":[{"sentence":"The nonlubriciousness of the surface ensured a firm grip.","translation":"その表面の滑りにくさのおかげで、しっかりと握ることができた。"}],"collocations":["surface nonlubriciousness (表面の滑りにくさ)"],"synonyms":["nonslip","lack of lubricity","friction","roughness"],"antonyms":["lubriciousness","slipperiness","smoothness"]}],"etymology":{"value":"\"non-\" (否定) + \"lubriciousness\" (潤滑性があること)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnluːbrɪˈʃʊsnəs/","syllables":"non-lu-bric-i-ous-ness"},"inflection":{"noun_plural":"nonlubriciousnesses (rare)"},"usage_notes":{"explanation":"This word is relatively uncommon and technical, primarily used in scientific or engineering contexts to describe materials or surfaces that do not provide lubrication or are designed to resist slipping.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonlubriciousness made the machine run smoothly.","correct":"✓ The lubriciousness made the machine run smoothly.","note":"Nonlubriciousness implies a lack of smoothness due to friction, so it would not make a machine run smoothly."}],"priority":"★★☆"},"related_words":{"derivatives":["lubriciousness (潤滑性)","lubricious (潤滑性のある、滑りやすい)","lubricate (潤滑する)","lubrication (潤滑)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonlubriciousness\" is a highly technical term rarely used in everyday language. It refers to the property of a surface or substance that lacks lubrication, meaning it is not slippery and provides a high degree of friction. Understanding this word requires a strong grasp of scientific or engineering vocabulary. It's essentially the opposite of \"lubriciousness\" or \"slipperiness.\""},"example_sentences":[{"sentence":"The manufacturer tested the material for its nonlubriciousness to ensure it met safety standards for footwear.","translation":"製造業者は、その素材が履物の安全基準を満たしていることを確認するため、滑りにくさの試験を行った。","type":"noun","meaning_category":"滑りにくさ"},{"sentence":"The nonlubriciousness of the coating prevented the parts from sliding against each other.","translation":"コーティングの滑りにくさにより、部品同士が滑り合うのを防いだ。","type":"noun","meaning_category":"滑りにくさ"}]}