{"word":"Teredinidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フナクイムシ科：船や木材に穴をあける二枚貝の科","english_definition":"A family of saltwater clams, commonly known as shipworms, that bore into wood, including submerged timber.","examples":[{"sentence":"Teredinidae can cause significant damage to wooden structures in marine environments.","translation":"フナクイムシ科は、海洋環境における木造構造物に重大な損害を与える可能性があります。"}],"collocations":["shipworm damage","marine borer","wood-boring bivalve"],"synonyms":["shipworm"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Teredo*, which comes from the Greek word 'teredon' meaning 'woodworm'. The suffix '-idae' is used in biological taxonomy to denote a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛrɪˈdɪnɪdiː/","syllables":"Te-re-di-ni-dae"},"inflection":{"noun_plural":"Teredinidae (used as both singular and plural)"},"usage_notes":{"explanation":"*Teredinidae* is a scientific term used to refer to the family of shipworms. While technically clams, they are highly modified for boring into wood. They are a significant concern for wooden ships, piers, and other submerged wooden structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teredinidae is eating the wood.","correct":"✓ The Teredinidae are eating the wood.","note":"Because Teredinidae refers to a family (plural concept), the plural form of the verb is generally used. However, using 'Teredinidae' as a singular collective noun is also acceptable in some contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["Teredo (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Teredinidae' is a scientific term referring to a specific family of marine bivalves known as shipworms. Understanding this term requires familiarity with biological classification systems and a basic understanding of marine biology. The term is primarily encountered in scientific literature, marine engineering reports, or discussions related to the preservation of wooden maritime structures."},"example_sentences":[{"sentence":"The presence of Teredinidae was confirmed by examining the damaged pilings.","translation":"損傷した杭を調査した結果、フナクイムシ科の存在が確認されました。","type":"noun","meaning_category":"Identification"},{"sentence":"Research is being conducted to find environmentally friendly ways to control Teredinidae infestations.","translation":"フナクイムシ科の蔓延を抑制するための環境に優しい方法を見つける研究が行われています。","type":"noun","meaning_category":"Research"},{"sentence":"Teredinidae have a symbiotic relationship with bacteria that help them digest wood.","translation":"フナクイムシ科は、木材の消化を助ける細菌と共生関係にあります。","type":"noun","meaning_category":"Biology"}]}