{"word":"reappearances","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再登場、再出現、再発","english_definition":"The act or an instance of appearing again.","examples":[{"sentence":"The magician's sudden reappearances amazed the audience.","translation":"マジシャンの突然の再登場は観客を驚かせた。"},{"sentence":"The reappearance of the rare bird delighted birdwatchers.","translation":"その珍しい鳥の再出現はバードウォッチャーを喜ばせた。"},{"sentence":"The reappearance of symptoms after treatment can be discouraging.","translation":"治療後の症状の再発は落胆させられることがある。"}],"collocations":["sudden reappearance (突然の再登場)","unexpected reappearance (予期せぬ再出現)","frequent reappearances (頻繁な再登場)","welcome reappearance (歓迎される再登場)"],"synonyms":["re-emergence","resurgence","return","revival"],"antonyms":["disappearance","departure","exit"]}],"etymology":{"value":"\"Re-\" (再び) + \"appearance\" (出現)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːəˈpɪərənsɪz/","syllables":"re-ap-pear-ance-s"},"inflection":{"noun_plural":"reappearances"},"usage_notes":{"explanation":"\"Reappearances\" is the plural form of \"reappearance,\" referring to multiple instances of something or someone appearing again after a period of absence or disappearance. It can refer to physical reappearances, such as a person returning to a stage, or more abstract reappearances, such as the return of a trend or a symptom.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reappearance of the star was very excited.","correct":"✓ The reappearance of the star was very exciting.","note":"\"Excited\" describes a feeling, while \"exciting\" describes something that causes a feeling. The reappearance itself is exciting, not excited."},{"incorrect":"✗ The reappearance are rare.","correct":"✓ The reappearances are rare.","note":"When referring to multiple instances, use the plural form \"reappearances\" with a plural verb."}],"priority":"★★☆"},"related_words":{"derivatives":["reappear (verb)","appearance (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reappearances\" is a somewhat formal word that refers to multiple instances of something or someone showing up again after they have disappeared or been absent. It is often used in contexts where something has a pattern of vanishing and then returning. Because it is a less common word, it is more likely to be found in formal writing or specialized fields. "},"example_sentences":[{"sentence":"The frequent **reappearances** of the comet allowed scientists to study its trajectory.","translation":"その彗星の頻繁な再出現により、科学者たちはその軌道を研究することができた。","type":"noun","meaning_category":"再出現"},{"sentence":"The actor's **reappearances** on stage were always met with thunderous applause.","translation":"その俳優の舞台への再登場は常に盛大な拍手で迎えられた。","type":"noun","meaning_category":"再登場"},{"sentence":"The **reappearances** of the old symptoms worried the patient.","translation":"古い症状の再発は患者を心配させた。","type":"noun","meaning_category":"再発"}]}