{"word":"under-coloring","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(絵画)下塗り、アンダーカラーリング","english_definition":"A preliminary layer of color applied to a painting, often to establish values or create a base tone.","examples":[{"sentence":"The artist used a warm brown under-coloring to create a sense of depth in the landscape.","translation":"その画家は、風景に奥行きを出すために、暖かい茶色の下塗りを使った。"},{"sentence":"The under-coloring was visible through the thin layers of paint, adding to the painting's complexity.","translation":"薄い絵の具の層を通して下塗りが見え、絵の複雑さを増していた。"}],"collocations":["apply under-coloring","warm under-coloring","cool under-coloring","visible under-coloring"],"synonyms":["underpainting","ground","imprimatura"],"antonyms":["overpainting","glazing"]},{"part_of_speech":"verb","definition":"(絵画)下塗りする、アンダーカラーリングする","english_definition":"To apply a preliminary layer of color to (a painting).","examples":[{"sentence":"He under-colored the canvas with a thin wash of ochre.","translation":"彼はオークルの薄いウォッシュでキャンバスを下塗りした。"},{"sentence":"She carefully under-colored the portrait before adding the final details.","translation":"彼女は最後のディテールを加える前に、丁寧に肖像画を下塗りした。"}],"collocations":["under-color a canvas","under-color a portrait","under-color with ochre","under-color with a wash"],"synonyms":["underpaint","ground"],"antonyms":["overpaint","glaze"]}],"etymology":{"value":"The term 'under-coloring' is formed by combining the prefix 'under-' (meaning beneath or below) with the word 'coloring' (the application of color). It describes the process of applying a base layer of color beneath subsequent layers in a painting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌkʌlərɪŋ/","syllables":"un-der-col-or-ing"},"inflection":{"noun_plural":"under-colorings","verb_forms":{"present_simple":["under-color","under-colors"],"past_simple":"under-colored","past_participle":"under-colored","present_participle":"under-coloring"}},"usage_notes":{"explanation":"'Under-coloring' refers to the initial layer of color applied in a painting. It serves several purposes, including establishing the value structure of the painting, creating a unifying tone, and influencing the colors of subsequent layers. The under-coloring can be visible or completely covered by later layers, depending on the artist's technique. It is a common technique in both traditional and contemporary painting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used undercoloring with the final details.","correct":"✓ He used under-coloring as a base for the final details.","note":"Under-coloring is a base layer, not something used with the final details. It's applied before the details."},{"incorrect":"✗ The painting had a strong undercoloring of blue.","correct":"✓ The painting had a strong under-coloring of blue.","note":"The correct spelling includes the hyphen: under-coloring."}],"priority":"★★☆"},"related_words":{"derivatives":["underpaint","underpainting","glaze","scumble","grisaille","imprimatura"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Under-coloring' is a term used in painting to describe the first layer of color applied to the canvas. It helps set the tone and depth of the painting before the artist adds more details. It's like a foundation for the rest of the artwork. This term is more common among artists and art enthusiasts.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist started with an under-coloring of burnt umber to create a warm base.","translation":"アーティストは、暖かいベースを作るために、バーントアンバーの下塗りから始めた。","type":"noun","meaning_category":"下塗り"},{"sentence":"She decided to under-color the entire canvas with a light green wash.","translation":"彼女はキャンバス全体を薄い緑色のウォッシュで下塗りすることにした。","type":"verb","meaning_category":"下塗りする"}]}