{"word":"burred","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(音声が)巻き舌の、ざらざらした、不明瞭な","english_definition":"(of speech) pronounced with a burr; having a rough or indistinct quality.","examples":[{"sentence":"He spoke with a burred 'r'.","translation":"彼は巻き舌の「r」で話した。"},{"sentence":"The recording was burred and difficult to understand.","translation":"録音は不明瞭で理解するのが難しかった。"}],"collocations":["burred accent","burred pronunciation","burred voice"],"synonyms":["roughened","indistinct","blurred","thick","guttural"],"antonyms":["clear","distinct","articulate"]},{"part_of_speech":"verb","definition":"(動詞の過去形・過去分詞) burrの過去形・過去分詞","english_definition":"Past tense and past participle of the verb 'burr'.","examples":[{"sentence":"The edges of the metal were burred after cutting.","translation":"金属の端は切断後、ざらざらになった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The adjective 'burred' is derived from the noun 'burr', referring to a rough edge or projection. The verb 'burr' means to create such a rough edge.","priority":"★★☆"},"pronunciation":{"ipa":"/bɜːrd/","syllables":"burred"},"inflection":{"verb_forms":{"present_simple":["burr","burrs"],"past_simple":"burred","past_participle":"burred","present_participle":"burring"}},"usage_notes":{"explanation":"'Burred' as an adjective typically describes speech or sounds that are not clear or distinct, often due to a rolling of the 'r' sound (a burr) or some other roughness in the articulation. It can also describe something that has a rough or indistinct quality. As a verb, 'burred' indicates that something has been made rough or has developed rough edges.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The singer had a very blurred voice.","correct":"✓ The singer had a very burred voice.","note":"'Blurred' generally refers to a visual lack of clarity, while 'burred' refers to a roughness or indistinctness in sound or speech."}],"priority":"★☆☆"},"related_words":{"derivatives":["burr (noun: a rough edge or projection on metal or wood; a trilling pronunciation of 'r')","burry (adjective: covered with burrs; having a rough quality)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'burred' is relatively uncommon and may not be familiar to many English language learners. It is most often used to describe speech that has a rough or indistinct quality, often due to a trilled 'r' sound. It can also refer to something that has been made rough or has rough edges. Understanding this word requires a relatively advanced vocabulary. "},"example_sentences":[{"sentence":"The Scottish actor had a distinctly burred accent.","translation":"そのスコットランド人俳優は、はっきりと巻き舌のアクセントがあった。","type":"adjective","meaning_category":"巻き舌の"},{"sentence":"After years of use, the knife's edge had become burred.","translation":"長年の使用の後、ナイフの刃はざらざらになった。","type":"verb (past participle)","meaning_category":"ざらざらした"}]}