{"word":"protozoan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"原生動物","english_definition":"any of a diverse group of single-celled eukaryotic organisms, many of which are motile (able to move). They are heterotrophic, meaning they obtain their nutrition from organic matter.","examples":[{"sentence":"Protozoans are commonly found in aquatic environments.","translation":"原生動物は一般的に水生環境で見られる。"},{"sentence":"Some protozoans are parasitic and can cause diseases.","translation":"原生動物の中には寄生性で、病気を引き起こすものもいる。"},{"sentence":"The pond water contained a variety of protozoans.","translation":"その池の水には多様な原生動物が含まれていた。"}],"collocations":["aquatic protozoan","parasitic protozoan","free-living protozoan","identify protozoan","study protozoan"],"synonyms":["protist","microorganism","single-celled organism"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'protos' (first) and 'zoon' (animal), reflecting the historical view that they were the simplest animals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtəˈzoʊən/","syllables":"pro-to-zo-an"},"inflection":{"noun_plural":"protozoans or protozoa"},"usage_notes":{"explanation":"Protozoans are a diverse group of eukaryotic microorganisms. They are not a formal taxonomic group, but rather a convenient grouping of single-celled organisms that are not fungi, plants, or animals. They are found in a variety of habitats, including soil, water, and as parasites in animals. Protozoans play important roles in ecosystems, such as controlling bacterial populations and serving as food for larger organisms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Protozoan are animals.","correct":"✓ Protozoans are microorganisms.","note":"Protozoans are single-celled microorganisms, not animals in the traditional sense."},{"incorrect":"✗ Protozoan is visible to the naked eye.","correct":"✓ Protozoans are microscopic.","note":"Most protozoans are microscopic and cannot be seen without a microscope."}],"priority":"★★☆"},"related_words":{"derivatives":["protozoic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"protozoan\" refers to a group of single-celled organisms that are eukaryotic, meaning their cells have a nucleus. They are heterotrophic, meaning they obtain nutrients from organic matter. Protozoans are found in diverse environments and play various roles, including being parasitic. This term is typically used in scientific contexts, such as biology and microbiology. Understanding the term requires a basic knowledge of cell biology and classification of organisms."},"example_sentences":[{"sentence":"The scientist studied the **protozoan** under a microscope.","translation":"科学者は顕微鏡で原生動物を研究した。","type":"noun","meaning_category":"organism"},{"sentence":"Some **protozoans** are beneficial to the environment.","translation":"原生動物の中には環境に有益なものもいる。","type":"noun","meaning_category":"organism"},{"sentence":"Certain types of **protozoan** can cause diseases in humans.","translation":"ある種の原生動物は人に病気を引き起こす可能性がある。","type":"noun","meaning_category":"organism"}]}