{"word":"haptenes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハプテン：単独では免疫反応を引き起こさないが、キャリアタンパク質と結合すると抗体を生成する低分子化合物","english_definition":"Small molecules that can elicit an immune response only when attached to a large carrier such as a protein; the carrier may be one that also does not elicit an immune response by itself.","examples":[{"sentence":"Haptenes are often drugs or chemicals that can cause allergic reactions.","translation":"ハプテンはしばしば、アレルギー反応を引き起こす可能性のある薬物または化学物質です。"},{"sentence":"The haptene-carrier conjugate is used to produce antibodies in experimental animals.","translation":"ハプテン-キャリア複合体は、実験動物において抗体を産生するために使用されます。"}],"collocations":["haptene-carrier conjugate (ハプテン-キャリア複合体)","haptene-specific antibody (ハプテン特異的抗体)"],"synonyms":["incomplete antigen"],"antonyms":["antigen"]}],"etymology":{"value":"Derived from the Greek word 'haptein' meaning 'to grasp' or 'to seize', reflecting the haptene's need to bind to a carrier protein to elicit an immune response.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhæptinz/","syllables":"hap-tenes"},"inflection":{"noun_plural":"haptenes","noun_singular":"haptene"},"usage_notes":{"explanation":"Haptenes are small molecules that are not immunogenic (cannot trigger an immune response) on their own. However, when they bind to a larger carrier molecule, typically a protein, they become immunogenic. This complex can then stimulate the production of antibodies. Haptenes are important in understanding allergic reactions to drugs and chemicals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Haptenes are large molecules that directly stimulate the immune system.","correct":"✓ Haptenes are small molecules that must bind to a carrier protein to stimulate the immune system.","note":"Haptenes are small and require a carrier to become immunogenic."},{"incorrect":"✗ Haptenes can be used directly as vaccines.","correct":"✓ Haptenes must be conjugated to a carrier protein before they can be used to elicit an immune response, such as in vaccine development.","note":"Haptenes alone are not effective as vaccines; they need a carrier."}],"priority":"★★☆"},"related_words":{"derivatives":["haptenic (adjective: relating to a haptene)","immunogen (noun: a substance that is capable of inducing an immune response)","antigen (noun: a substance that triggers an immune response)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (scientific/medical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haptenes' are small molecules that can't cause an immune response by themselves. They need to attach to a larger molecule, like a protein, to become capable of triggering an immune response. This concept is important in understanding allergies and how certain drugs or chemicals can cause reactions in the body.","priority":"★★☆"},"example_sentences":[{"sentence":"The allergic reaction was caused by a haptene binding to skin proteins.","translation":"アレルギー反応は、ハプテンが皮膚タンパク質に結合することによって引き起こされました。","type":"scientific","meaning_category":"Immunology"},{"sentence":"Understanding haptenes is crucial in the development of certain diagnostic tests.","translation":"ハプテンを理解することは、特定の診断検査の開発において重要です。","type":"scientific","meaning_category":"Immunology"},{"sentence":"The drug acts as a haptene, triggering an immune response when bound to a carrier protein.","translation":"その薬物はハプテンとして作用し、キャリアタンパク質に結合すると免疫応答を引き起こします。","type":"scientific","meaning_category":"Pharmacology"}]}