{"word":"subtruncation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学、計算機科学) ある数や文字列を指定された桁数や文字数で切り捨てること。特に、元の値よりも絶対値が小さくなるように切り捨てる操作。","english_definition":"(mathematics, computer science) The act of truncating a number or string to a specified number of digits or characters, especially when the truncation results in a value with a smaller absolute value than the original.","examples":[{"sentence":"Subtruncation is often used in numerical analysis to control the precision of calculations.","translation":"サブトランケーションは、数値解析において計算の精度を制御するためによく使用されます。"},{"sentence":"The subtruncation of 3.14159 to three decimal places yields 3.141.","translation":"3.14159を小数点以下3桁でサブトランケーションすると、3.141になります。"},{"sentence":"In string processing, subtruncation can be used to limit the length of text fields.","translation":"文字列処理では、サブトランケーションを使用してテキストフィールドの長さを制限できます。"}],"collocations":["numerical subtruncation (数値サブトランケーション)","string subtruncation (文字列サブトランケーション)","subtruncation error (サブトランケーション誤差)"],"synonyms":["truncation","rounding down","floor function"],"antonyms":["rounding up","ceiling function"]},{"part_of_speech":"noun","definition":"(一般) 何かを部分的に短縮または削減すること。","english_definition":"(general) The act of partially shortening or reducing something.","examples":[{"sentence":"The subtruncation of the project's scope led to significant cost savings.","translation":"プロジェクトの範囲を部分的に削減したことで、大幅なコスト削減につながりました。"}],"collocations":[],"synonyms":["reduction","shortening","abridgment"],"antonyms":["expansion","lengthening"]}],"etymology":{"value":"接頭辞 \"sub-\" (下、部分) + \"truncation\" (切り捨て)。","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbtrʌŋˈkeɪʃən/","syllables":"sub-trun-ca-tion"},"inflection":{"noun_plural":"subtruncations"},"usage_notes":{"explanation":"\"Subtruncation\" は、主に数学や計算機科学の分野で使用される専門用語です。一般的な文脈では、単に \"truncation\" (切り捨て) という言葉がより一般的です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subtruncation was rounded to the nearest integer.","correct":"✓ The subtruncation resulted in a value that was truncated to the nearest integer.","note":"\"Subtruncation\" は操作自体を指す名詞であり、結果を指すわけではありません。結果を説明する場合は、動詞 \"result in\" などを使用します。"},{"incorrect":"✗ Subtruncation is the same as rounding.","correct":"✓ Subtruncation is a type of truncation, but it is not the same as rounding.","note":"Subtruncation は切り捨ての一種ですが、四捨五入（rounding）とは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["truncate (動詞: 切り捨てる)","truncated (形容詞: 切り捨てられた)"],"related_terms":["floor function (床関数)","ceiling function (天井関数)","rounding (四捨五入)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Subtruncation\" is a technical term primarily used in mathematics and computer science. It refers to the process of truncating a number or string, specifically in a way that reduces its absolute value. This is a more precise form of truncation, often used in numerical analysis to control precision. While the term \"truncation\" is more common in general contexts, \"subtruncation\" specifies a particular type of truncation that ensures the resulting value is closer to zero than the original. Understanding this term requires a familiarity with mathematical and computational concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The algorithm uses subtruncation to ensure that the calculated values remain within a specific range.","translation":"そのアルゴリズムは、計算された値が特定の範囲内に収まるように、サブトランケーションを使用します。","type":"noun","meaning_category":"数学、計算機科学"},{"sentence":"Subtruncation can introduce errors in numerical simulations, especially when dealing with very small numbers.","translation":"サブトランケーションは、数値シミュレーション、特に非常に小さな数を扱う場合に誤差を生じさせる可能性があります。","type":"noun","meaning_category":"数学、計算機科学"},{"sentence":"The database system employs subtruncation to limit the size of text fields, preventing overflow errors.","translation":"そのデータベースシステムは、テキストフィールドのサイズを制限し、オーバーフローエラーを防ぐためにサブトランケーションを使用します。","type":"noun","meaning_category":"数学、計算機科学"}]}