{"word":"degrowth","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"脱成長：経済成長の追求を意図的に縮小し、環境の持続可能性と社会の公平性を重視する社会・経済モデル","english_definition":"A planned reduction of energy and resource use to bring the economy into balance with the Earth's ecological limits. It is a political, economic, and social movement based on ecological economics and anti-consumerism.","examples":[{"sentence":"Degrowth is not simply a recession; it's a conscious shift away from prioritizing GDP growth.","translation":"脱成長は単なる景気後退ではなく、GDP成長を優先することからの意識的な転換です。"},{"sentence":"Proponents of degrowth advocate for a more localized and sustainable economy.","translation":"脱成長の支持者たちは、より地域化され持続可能な経済を提唱しています。"},{"sentence":"The degrowth movement challenges the notion that economic growth is always beneficial.","translation":"脱成長運動は、経済成長が常に有益であるという考えに異議を唱えています。"}],"collocations":["sustainable degrowth","degrowth economy","degrowth strategy","degrowth transition","post-growth","ecological economics"],"synonyms":["post-growth","sustainable degrowth","steady-state economy","well-being economy"],"antonyms":["economic growth","growth economy","expansion","development"]},{"part_of_speech":"noun","definition":"(より一般的に) 規模や量の減少","english_definition":"(More generally) A reduction in size or amount.","examples":[{"sentence":"The degrowth in population was concerning to the local government.","translation":"人口の減少は地方自治体にとって懸念事項でした。"},{"sentence":"We observed a degrowth in sales this quarter compared to last year.","translation":"今四半期の売上は昨年と比較して減少しました。"}],"collocations":["population degrowth","sales degrowth","revenue degrowth"],"synonyms":["decrease","reduction","decline","shrinkage"],"antonyms":["growth","increase","expansion"]}],"etymology":{"value":"The term 'degrowth' is a translation of the French word 'décroissance,' which emerged in the early 2000s. It combines the prefix 'de-' (meaning 'down' or 'away from') with 'growth,' indicating a move away from economic growth as a primary goal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˈɡroʊθ/","syllables":"de-growth"},"inflection":{"notes":"It is primarily used as a noun. There is no plural form listed in most dictionaries, but it may be used as 'degrowths' in some contexts."},"usage_notes":{"explanation":"'Degrowth' is a complex and often misunderstood concept. It is not simply about economic recession or austerity. Instead, it is a deliberate and planned reduction of resource and energy consumption to achieve ecological sustainability and social justice. It involves rethinking societal values, production and consumption patterns, and economic systems. It is often used in discussions about climate change, resource depletion, and the limits to growth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Degrowth means everyone will be poor.","correct":"✓ Degrowth aims for a more equitable distribution of wealth and resources, not universal poverty.","note":"Degrowth is often mistakenly associated with poverty or a lower quality of life. However, proponents argue that it is about prioritizing well-being and sustainability over material accumulation."},{"incorrect":"✗ Degrowth is the same as a recession.","correct":"✓ Degrowth is a planned and intentional process, while a recession is an unplanned economic downturn.","note":"Recessions are unplanned and often undesirable economic contractions, while degrowth is a deliberate strategy."}],"priority":"★★☆"},"related_words":{"derivatives":["degrow (verb, less common): to intentionally reduce economic activity"],"phrasal_verbs":[],"related_concepts":["ecological economics","post-growth economics","sustainable development","environmental sustainability","anti-consumerism","voluntary simplicity","steady-state economy","well-being economy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing in academic and political discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Degrowth' is a relatively new and specialized term that is primarily used in academic, political, and environmental discussions. It refers to a planned reduction in economic output and consumption with the goal of achieving ecological sustainability and social equity. It is a complex concept that requires an understanding of ecological economics and alternative economic models. It is often contrasted with traditional economic growth paradigms.","priority":"★★☆"},"example_sentences":[{"sentence":"The city council is considering a degrowth strategy to reduce its carbon footprint.","translation":"市議会は、二酸化炭素排出量を削減するために脱成長戦略を検討しています。","type":"noun","meaning_category":"economic model"},{"sentence":"Some researchers argue that degrowth is the only viable path to a sustainable future.","translation":"一部の研究者は、脱成長が持続可能な未来への唯一の実行可能な道であると主張しています。","type":"noun","meaning_category":"economic model"},{"sentence":"The degrowth movement is gaining traction in Europe.","translation":"脱成長運動はヨーロッパで勢いを増しています。","type":"noun","meaning_category":"economic model"},{"sentence":"A degrowth approach would prioritize local production and consumption.","translation":"脱成長のアプローチは、地域生産と消費を優先します。","type":"noun","meaning_category":"economic model"}]}