{"word":"unmanumissible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"解放できない、解放を許されない","english_definition":"Not capable of being manumitted; not able to be freed from slavery or bondage.","examples":[{"sentence":"The laws of the land rendered certain slaves unmanumissible.","translation":"その土地の法律は、特定の奴隷を解放不可能にした。"},{"sentence":"An unmanumissible serf was bound to the land for life.","translation":"解放を許されない農奴は、生涯その土地に縛り付けられた。"}],"collocations":["unmanumissible slave","unmanumissible serf","legally unmanumissible"],"synonyms":["non-liberatable","non-emancipable","bound","enslaved"],"antonyms":["manumissible","liberatable","emancipable","free"]},{"part_of_speech":"adjective","definition":"(比喩的に) どうすることもできない、変更できない","english_definition":"(Figuratively) Not capable of being altered or changed.","examples":[{"sentence":"His fate seemed unmanumissible, sealed by the choices he had made.","translation":"彼の運命は、彼が下した選択によって封印され、どうすることもできないように思われた。"}],"collocations":["unmanumissible fate","unmanumissible situation"],"synonyms":["immutable","inalterable","irreversible","fixed"],"antonyms":["mutable","alterable","reversible","changeable"]}],"etymology":{"value":"From the prefix 'un-' (not) + 'manumissible' (capable of being manumitted). 'Manumissible' comes from 'manumit,' derived from Latin 'manumittere' (to release from control, set free), from 'manus' (hand) + 'mittere' (to send). The etymology reflects the act of releasing a slave from the 'hand' or control of their owner.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnmənəˈmɪsɪbəl/","syllables":"un-man-u-mis-si-ble"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Unmanumissible' is a relatively rare and formal word, primarily used in historical contexts related to slavery and serfdom. It describes a condition where a person is legally or practically unable to be freed from their enslaved or bonded status. The figurative use, implying something unchangeable, is even rarer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contract was unmanumissible, so we had to follow it.","correct":"✓ The contract was immutable, so we had to follow it.","note":"While 'unmanumissible' can be used figuratively, 'immutable' is a more common and natural choice to describe something unchangeable like a contract."}],"priority":"★☆☆"},"related_words":{"derivatives":["manumit (verb: to release from slavery)","manumission (noun: the act of freeing from slavery)","manumissible (adjective: capable of being freed from slavery)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unmanumissible' is a highly specialized and uncommon word, primarily found in historical or legal texts discussing slavery or serfdom. Understanding its meaning requires knowledge of the concept of 'manumission' (the act of freeing a slave). It is unlikely to be encountered in everyday language. The figurative use is even rarer and requires a sophisticated understanding of language. Due to its limited usage and specialized context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"Under Roman law, certain categories of slaves were considered practically unmanumissible due to their skills or value.","translation":"ローマ法の下では、特定のカテゴリーの奴隷は、その技能や価値のために事実上解放不可能と見なされた。","type":"adjective","meaning_category":"解放できない"},{"sentence":"The feudal system created a class of peasants who were essentially unmanumissible from the land.","translation":"封建制度は、土地から事実上解放不可能な農民階級を生み出した。","type":"adjective","meaning_category":"解放できない"},{"sentence":"The situation seemed unmanumissible; there was no apparent way to resolve the conflict.","translation":"状況はどうすることもできないように思われた。紛争を解決する明白な方法はなかった。","type":"adjective","meaning_category":"(比喩的に) どうすることもできない"}]}