{"word":"prognathous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)顎が突き出た、突出顎の","english_definition":"(anatomy) having a projecting jaw or jaws.","examples":[{"sentence":"The skull was identified as belonging to an early hominid due to its prognathous jaw.","translation":"その頭蓋骨は、突出した顎のために初期の人類に属すると特定された。"},{"sentence":"Prognathous jaws are a characteristic feature in some animal species.","translation":"突出した顎は、一部の動物種における特徴的な特徴である。"}],"collocations":["prognathous jaw","prognathous face","prognathous skull"],"synonyms":["projecting","jutting","protuberant","overhanging"],"antonyms":["retrognathic","orthognathic"]}],"etymology":{"value":"Derived from the Greek words 'pro-' (forward) and 'gnathos' (jaw).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒɡnəθəs/","syllables":"prog-na-thous"},"inflection":{"notes":"Does not inflect; the adjective form is used."},"usage_notes":{"explanation":"'Prognathous' is a technical term primarily used in anatomy, anthropology, and zoology to describe a jaw that protrudes significantly beyond the upper part of the face. It is often used in scientific descriptions of skulls and facial features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The dog had a prognathic nose.","correct":"The dog had a prognathous jaw.","note":"'Prognathous' specifically refers to the jaw. While the nose can protrude, 'prognathous' is not the correct term to describe it."}],"priority":"★☆☆"},"related_words":{"derivatives":["prognathism (noun): The condition of having a prognathous jaw.","prognathic (adjective): Relating to or characterized by prognathism."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prognathous' is a specialized term used in scientific contexts, particularly in anatomy and anthropology, to describe a protruding jaw. It's not commonly used in everyday language. Understanding the term requires some familiarity with anatomical vocabulary."},"example_sentences":[{"sentence":"Anthropologists studied the prognathous features of the Neanderthal skull.","translation":"人類学者は、ネアンデルタール人の頭蓋骨の突出した特徴を研究した。","type":"adjective","meaning_category":"anatomy"},{"sentence":"The patient's prognathous mandible required orthodontic treatment.","translation":"患者の突出した下顎は、歯科矯正治療を必要とした。","type":"adjective","meaning_category":"anatomy"}]}