{"word":"Corydalis","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"キケマン属の植物","english_definition":"A genus of about 470 species of herbaceous flowering plants in the family Papaveraceae, native to the temperate Northern Hemisphere and the high mountains of tropical Africa. They are notable for their spurred flowers and often finely divided leaves.","examples":[{"sentence":"Several species of Corydalis are cultivated as ornamental plants.","translation":"いくつかのキケマン属の種は観賞植物として栽培されています。"}],"collocations":["Corydalis species","Corydalis flower","Corydalis plant"],"synonyms":["fumewort"],"antonyms":[]}],"etymology":{"value":"New Latin, from Ancient Greek κορυδαλλίς (korudallís, “crested lark”), because of the resemblance of the flower spur to the crest of a lark.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈrɪdəlɪs/","syllables":"Co-ry-da-lis"},"inflection":{"noun_plural":"Corydalises or Corydalis"},"usage_notes":{"explanation":"'Corydalis' refers to a genus of flowering plants. When referring to a specific species, the genus name is followed by the species name (e.g., Corydalis sempervirens).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a corydalis in the garden.","correct":"✓ I saw a Corydalis plant in the garden.","note":"It's better to specify that it's a plant for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["Corydaline (an alkaloid found in Corydalis species)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corydalis' is a botanical term referring to a specific genus of flowering plants. Understanding this term requires some familiarity with botanical nomenclature. It is not commonly used outside of botanical or gardening contexts."},"example_sentences":[{"sentence":"The delicate flowers of the Corydalis add a splash of color to the woodland floor.","translation":"キケマン属の繊細な花は、森林の地面に色の飛沫を加えます。","type":"general","meaning_category":"description"},{"sentence":"Corydalis extracts have been used in traditional medicine for their potential medicinal properties.","translation":"キケマン属の抽出物は、その潜在的な薬効のために伝統医学で使用されてきました。","type":"medicinal","meaning_category":"use"}]}