{"word":"Post-Darwinian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ダーウィン以後の、ダーウィンの進化論以降の","english_definition":"Relating to the period after Darwin or to ideas and developments that came after Darwin's theory of evolution.","examples":[{"sentence":"Post-Darwinian evolutionary biology has incorporated genetics and molecular biology.","translation":"ダーウィン以後の進化生物学は、遺伝学と分子生物学を取り入れている。"},{"sentence":"The post-Darwinian synthesis integrated Mendelian genetics with Darwinian natural selection.","translation":"ダーウィン以後の総合説は、メンデル遺伝学とダーウィンの自然選択説を統合した。"}],"collocations":["Post-Darwinian science","Post-Darwinian thought","Post-Darwinian era","Post-Darwinian synthesis"],"synonyms":["Neo-Darwinian","post-evolutionary"],"antonyms":["Pre-Darwinian"],"notes":"Often refers to the modern synthesis of evolutionary theory.","related_terms":["Darwinism","evolutionary biology","natural selection","modern synthesis"]}],"etymology":{"value":"Formed from 'post-' (meaning 'after') + 'Darwinian' (relating to Charles Darwin or his theories).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊst dɑːrˈwɪniən/","syllables":"post-Dar-win-i-an"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Post-Darwinian' is used to describe concepts, theories, or periods that came after Charles Darwin and his initial formulation of evolutionary theory. It often implies an advancement or modification of Darwin's original ideas, incorporating new scientific discoveries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a post-Darwinian.","correct":"✓ He is a post-Darwinian scientist.","note":"'Post-Darwinian' is an adjective, not a noun, so it needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Post-Darwinism"],"related_terms":["Darwin","Darwinian","evolution","evolutionary theory"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency; more common in academic or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Post-Darwinian' is used in scientific and academic contexts to refer to ideas, theories, and developments that have occurred after Charles Darwin's initial formulation of evolutionary theory. It often implies an advancement or modification of Darwin's original ideas, incorporating new scientific discoveries such as genetics and molecular biology. It's a term primarily used by those with a background in biology or history of science."},"example_sentences":[{"sentence":"The field of evolutionary genetics is a distinctly post-Darwinian development.","translation":"進化遺伝学の分野は、明らかにダーウィン以後の発展である。","type":"general"},{"sentence":"Post-Darwinian thought has significantly influenced our understanding of human behavior.","translation":"ダーウィン以後の思想は、人間の行動に関する私たちの理解に大きな影響を与えてきた。","type":"general"}]}