{"word":"plastometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"塑性計、可塑度計","english_definition":"An instrument for measuring plasticity, especially of clay or dough.","examples":[{"sentence":"The plastometer is used to determine the consistency of the clay.","translation":"その塑性計は粘土の硬さを測定するために使われる。"},{"sentence":"The readings from the plastometer helped to optimize the dough formulation.","translation":"塑性計からの読み取り値は、生地の配合を最適化するのに役立った。"}],"collocations":["use a plastometer (塑性計を使用する)","plastometer reading (塑性計の読み取り値)","measure plasticity with a plastometer (塑性計で可塑性を測定する)"],"synonyms":["viscometer","rheometer"],"antonyms":[]}],"etymology":{"value":"\"Plasto-\" comes from the Greek word \"plastos\" meaning molded. \"-meter\" comes from the Greek word \"metron\" meaning measure.","priority":"★★★"},"pronunciation":{"ipa":"/plæˈstɒmɪtər/","syllables":"plas-tom-e-ter"},"inflection":{"noun_plural":"plastometers"},"usage_notes":{"explanation":"A plastometer is a scientific instrument used to measure the plasticity of a substance. Plasticity refers to the ability of a solid material to undergo permanent deformation without rupture or fracture. Plastometers are commonly used in industries such as ceramics, food processing, and polymer science to assess the workability and consistency of materials like clay, dough, and plastics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plastometer measures the elasticity of the material.","correct":"✓ The plastometer measures the plasticity of the material.","note":"Plastometers measure plasticity, not elasticity. Elasticity is the ability of a material to return to its original shape after deformation, while plasticity is the ability to undergo permanent deformation."}],"priority":"★★☆"},"related_words":{"derivatives":["plasticity (可塑性)","plastic (プラスチック)"],"related_terms":["rheology (レオロジー、流動学)","viscosity (粘度)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"A plastometer is a specialized instrument used in material science and engineering to quantify the plasticity of substances. Plasticity is the property of a material that allows it to undergo permanent deformation without breaking. This instrument is particularly relevant in industries dealing with materials like clay, dough, or polymers, where understanding and controlling plasticity is crucial for processing and quality control. The term is not commonly encountered outside of technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The engineer used a plastometer to analyze the plasticity of the polymer sample.","translation":"エンジニアは、ポリマーサンプルの可塑性を分析するために塑性計を使用した。","type":"general","meaning_category":"measurement"},{"sentence":"The plastometer readings indicated that the clay had the right consistency for molding.","translation":"塑性計の読み取り値は、粘土が成形に適した硬さであることを示した。","type":"application","meaning_category":"material analysis"}]}