{"word":"Israelite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イスラエル人、古代イスラエル人、ヘブライ人","english_definition":"A descendant of Jacob (Israel); a member of the ancient Hebrew nation; a Jew.","examples":[{"sentence":"The Israelites were led out of Egypt by Moses.","translation":"イスラエル人はモーセに率いられてエジプトから脱出した。"},{"sentence":"Many ancient texts refer to the history of the Israelites.","translation":"多くの古代文書がイスラエル人の歴史について言及している。"},{"sentence":"He identified himself as an Israelite.","translation":"彼は自身をイスラエル人であると表明した。"}],"collocations":["ancient Israelites (古代イスラエル人)","descendants of the Israelites (イスラエル人の子孫)","the twelve tribes of Israel (イスラエルの十二支族)"],"synonyms":["Hebrew","Jew"],"antonyms":["Gentile"]},{"part_of_speech":"adjective","definition":"イスラエル（人）の、古代イスラエル（人）の、ヘブライ（人）の","english_definition":"Relating to or characteristic of the Israelites or ancient Israel.","examples":[{"sentence":"Israelite history is full of trials and tribulations.","translation":"イスラエル人の歴史は試練と苦難に満ちている。"},{"sentence":"The museum displays artifacts from the Israelite period.","translation":"その博物館にはイスラエル時代の遺物が展示されている。"},{"sentence":"Israelite culture was heavily influenced by its neighbors.","translation":"イスラエル文化は近隣諸国から大きな影響を受けた。"}],"collocations":["Israelite history (イスラエル史)","Israelite culture (イスラエル文化)","Israelite religion (イスラエル教)"],"synonyms":["Hebrew","Jewish"],"antonyms":["Gentile"]}],"etymology":{"value":"From Late Latin *Israhelita*, from Greek *Israēlitēs*, from Hebrew *yiśraʾēlī* (יִשְׂרְאֵלִי), from *yiśraʾēl* (יִשְׂרָאֵל) 'Israel'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɪzriəˌlaɪt","syllables":"Iz-re-a-lite"},"inflection":{"noun_plural":"Israelites","adjective_forms":{}},"usage_notes":{"explanation":"The term \"Israelite\" typically refers to the descendants of Jacob (also known as Israel) and the members of the ancient Hebrew nation. It's often used in historical or religious contexts, particularly when discussing the period before the establishment of the modern State of Israel. While \"Jew\" and \"Hebrew\" are sometimes used interchangeably, \"Israelite\" is generally more specific to the ancient people and their history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Israeli.","correct":"✓ He is an Israelite. / ✓ He is an Israeli.","note":"\"Israeli\" refers to a citizen of the modern State of Israel, while \"Israelite\" refers to a member of the ancient Hebrew nation. The article \"an\" is used before \"Israeli\" because it begins with a vowel sound."},{"incorrect":"✗ The Israelites are the same as Israelis.","correct":"✓ The Israelites are the ancestors of many modern Jews and some Israelis.","note":"While there is a connection, the terms are not interchangeable. \"Israelites\" refers to the ancient people, while \"Israelis\" are citizens of the modern State of Israel."}],"priority":"★★☆"},"related_words":{"derivatives":["Israel (noun: イスラエル)","Israeli (noun/adjective: イスラエル人/の)","Hebrew (noun/adjective: ヘブライ人/の)","Judaism (noun: ユダヤ教)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Israelite\" refers to a member of the ancient people of Israel, descendants of Jacob (also known as Israel) in the Hebrew Bible. It is often used in historical and religious contexts when discussing the period before the modern State of Israel. While related to the terms \"Jew\" and \"Hebrew,\" \"Israelite\" is more specific to this ancient lineage. It's important to distinguish it from \"Israeli,\" which refers to a citizen of the modern State of Israel. The term is most often encountered in religious texts, historical accounts, and academic discussions related to the ancient Near East."},"example_sentences":[{"sentence":"Archaeologists have uncovered many artifacts from the time of the ancient Israelites.","translation":"考古学者たちは古代イスラエル人の時代の多くの遺物を発掘した。","type":"noun","meaning_category":"イスラエル人"},{"sentence":"The Israelite kings ruled over a powerful kingdom in the region.","translation":"イスラエル人の王たちはその地域で強力な王国を統治した。","type":"adjective","meaning_category":"イスラエル（人）の"},{"sentence":"The story of the Exodus is central to the identity of the Israelites.","translation":"出エジプトの物語はイスラエル人のアイデンティティの中心である。","type":"noun","meaning_category":"イスラエル人"},{"sentence":"Ancient Israelite religion had a profound impact on Western civilization.","translation":"古代イスラエル人の宗教は西洋文明に深い影響を与えた。","type":"adjective","meaning_category":"イスラエル（人）の"}]}