{"word":"nonconfiscatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"没収的でない、収用を伴わない","english_definition":"Not involving confiscation; not of the nature of a confiscation.","examples":[{"sentence":"The tax was designed to be nonconfiscatory, allowing businesses to remain profitable.","translation":"その税金は没収的にならないように設計されており、企業が収益性を維持できるように配慮されている。"},{"sentence":"The regulations were deemed nonconfiscatory because they allowed the owner to retain some economic benefit from the property.","translation":"その規制は、所有者が財産からある程度の経済的利益を保持できるため、没収的ではないと見なされた。"}],"collocations":["nonconfiscatory tax (没収的でない税金)","nonconfiscatory regulation (没収的でない規制)","nonconfiscatory measure (没収的でない措置)"],"synonyms":["reasonable","equitable","fair","just","proportionate"],"antonyms":["confiscatory","expropriatory","punitive","excessive","unjust"]},{"part_of_speech":"adjective","definition":"財産権を侵害しない","english_definition":"Not violating or infringing upon property rights.","examples":[{"sentence":"The government aimed to implement nonconfiscatory policies that respected private property.","translation":"政府は、私有財産を尊重する非没収的な政策を実施することを目指した。"},{"sentence":"The proposed changes were carefully reviewed to ensure they were nonconfiscatory and did not unduly burden property owners.","translation":"提案された変更は、非没収的であり、財産所有者に過度の負担をかけないことを確認するために慎重に検討された。"}],"collocations":["nonconfiscatory policy (非没収的な政策)","nonconfiscatory approach (非没収的なアプローチ)","nonconfiscatory method (非没収的な方法)"],"synonyms":["protective","respectful","preservative","non-infringing"],"antonyms":["violating","infringing","depriving","seizing"]}],"etymology":{"value":"The word 'nonconfiscatory' is formed by adding the prefix 'non-' (meaning 'not') to the word 'confiscatory.' 'Confiscatory' itself comes from 'confiscate,' which originates from the Latin word 'confiscare,' meaning 'to take for the treasury,' from 'cum' (together) and 'fiscus' (treasury).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈfɪskətɔːri/","syllables":"non-con-fis-ca-to-ry"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more nonconfiscatory, most nonconfiscatory), although these are less common."},"usage_notes":{"explanation":"'Nonconfiscatory' is primarily used in legal and economic contexts to describe measures, regulations, or policies that do not involve the seizure or taking of private property without just compensation. It is often used to assure property owners that their rights will be protected, even when regulations or taxes are imposed. The term implies a balance between the needs of the government or society and the rights of individuals to own and use their property.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The law was non-confiscated.","correct":"✓ The law was nonconfiscatory.","note":"'Non-confiscated' would mean that something was not confiscated, while 'nonconfiscatory' describes the nature of the law itself (i.e., it does not confiscate property)."},{"incorrect":"✗ The measure was confiscatory, but they claimed it was nonconfiscatory.","correct":"✓ The measure was confiscatory, but they claimed it was nonconfiscatory in effect.","note":"If a measure appears confiscatory, but there's an argument that it isn't, clarify the aspect in which it is claimed to be nonconfiscatory (e.g., 'in effect,' 'in intent')."}],"priority":"★★☆"},"related_words":{"derivatives":["confiscate (verb: to seize or take property)","confiscation (noun: the act of confiscating)","confiscator (noun: one who confiscates)","confiscatory (adjective: of the nature of confiscation)"],"synonyms":["non-expropriating","non-seizing","non-appropriating"],"antonyms":["confiscating","expropriating","seizing","appropriating"],"related_concepts":["eminent domain (土地収用権)","takings clause (収用条項)","property rights (財産権)","just compensation (正当な補償)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonconfiscatory\" is a specialized term primarily used in legal, economic, and political discussions. It describes policies, regulations, or actions that do not involve the seizure or taking of private property without fair compensation. Understanding this word requires familiarity with concepts such as property rights, eminent domain, and government regulation. Due to its specific context and usage, it is more commonly encountered in advanced texts and discussions related to law and economics."},"example_sentences":[{"sentence":"The government assured citizens that the new tax laws would be nonconfiscatory and would not unfairly burden their income.","translation":"政府は、新しい税法が非没収的であり、国民の所得に不当な負担をかけないことを国民に保証した。","type":"adjective","meaning_category":"Not involving confiscation"},{"sentence":"The proposed regulations were designed to be nonconfiscatory, allowing businesses to continue operating profitably while adhering to environmental standards.","translation":"提案された規制は、企業が環境基準を遵守しながら収益性の高い操業を継続できるように、非没収的に設計された。","type":"adjective","meaning_category":"Not violating property rights"},{"sentence":"The court ruled that the zoning ordinance was nonconfiscatory because it still allowed the landowner to develop the property, albeit with certain restrictions.","translation":"裁判所は、ゾーニング条例が非没収的であると判決を下した。なぜなら、その条例は土地所有者が一定の制限はあるものの、財産を開発することを依然として許可していたからである。","type":"adjective","meaning_category":"Not involving confiscation"}]}