{"word":"beestings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"初乳 (特に牛の)","english_definition":"the first milk yielded by a mammal after giving birth, especially a cow.","examples":[{"sentence":"The farmer collected the beestings to feed the newborn calf.","translation":"農夫は生まれたばかりの子牛に与えるために初乳を集めた。"},{"sentence":"Beestings are rich in antibodies and nutrients.","translation":"初乳は抗体と栄養素が豊富である。"}],"collocations":["collect beestings","feed beestings to a calf","rich in beestings"],"synonyms":["colostrum"],"antonyms":[]}],"etymology":{"value":"Middle English 'beestynge', from Old English 'bēost' (beestings) + '-ing' (forming noun). 'Bēost' is related to Old High German 'biost' and Old Norse 'bystingr', all referring to the first milk after birth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbiːstɪŋz/","syllables":"bees-tings"},"inflection":{"noun_plural":"beestings (usually plural)"},"usage_notes":{"explanation":"'Beestings' refers specifically to the first milk produced by mammals after giving birth, which is rich in antibodies and nutrients crucial for the newborn's immune system. It's often used in the context of livestock farming, particularly with cows.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I drank beestings from the store.","correct":"✓ I drank colostrum from the store.","note":"'Beestings' typically refers to the natural first milk from a mammal after birth, not a commercially processed product. 'Colostrum' is a more general term that can refer to a supplement or product derived from this first milk."}],"priority":"★★☆"},"related_words":{"derivatives":["beest (archaic singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (専門的な語彙)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Beestings' is a specialized term primarily used in agricultural or veterinary contexts. It refers to the colostrum, or first milk, produced by mammals after giving birth. This milk is particularly rich in antibodies and nutrients that are essential for the newborn's health and immune system development. Due to its specific usage, it is not commonly encountered in general English conversation or literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The vet advised giving the lamb plenty of beestings to boost its immunity.","translation":"獣医は、子羊の免疫力を高めるために初乳を十分に与えるようにアドバイスした。","type":"noun","meaning_category":"初乳"},{"sentence":"The quality of beestings is crucial for the health of the calf.","translation":"初乳の質は子牛の健康にとって非常に重要である。","type":"noun","meaning_category":"初乳"}]}