{"word":"Cassinette","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"綾織りのウールと綿の混紡生地で、通常はウールが表面に出るように織られている。安価な代替品として、より高価なカシミアやウール生地の代わりに使用される。","english_definition":"A twilled fabric of wool and cotton, usually with the wool predominating on the surface. It is used as a cheaper substitute for more expensive cashmere or woolen fabrics.","examples":[{"sentence":"The suit was made of cassinette, a durable and affordable fabric.","translation":"そのスーツは丈夫でお手頃なカシネットで作られていた。"},{"sentence":"Cassinette was often used for linings and work clothes.","translation":"カシネットは裏地や作業着によく使われた。"}],"collocations":["cassinette suit","cassinette lining","durable cassinette"],"synonyms":["wool-cotton blend","twilled fabric"],"antonyms":[]}],"etymology":{"value":"語源は不明だが、おそらくカシミアに似た生地であることを示すために作られた造語であると考えられる。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkæsɪˈnɛt/","syllables":"Cas-si-nette"},"inflection":{"noun_plural":"cassinettes"},"usage_notes":{"explanation":"Cassinetteは、歴史的な文脈で言及されることが多い生地であり、現代ではあまり一般的ではありません。その主な特徴は、ウールと綿の混紡であり、綾織りであることです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dress was made of cashmere, or maybe it was cassinette, I can't tell the difference.","correct":"✓ The dress was made of either cashmere or cassinette, but cassinette is less soft and luxurious.","note":"カシミアとカシネットは異なる生地であり、カシネットは通常、カシミアよりも安価で粗いです。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Cassinette**」は、ウールと綿を混ぜて作られた綾織りの生地の名前です。昔は、カシミアやウールのような高級な生地の代わりに使われていました。今はあまり使われない言葉なので、歴史や服飾の専門的な文章でしか見かけないかもしれません。もしカシミアやウールと比べて「Cassinette」という言葉が出てきたら、それは安価な代用品として使われていた生地のことだと考えると良いでしょう。"},"example_sentences":[{"sentence":"The old work jacket was made of sturdy cassinette.","translation":"その古い作業用ジャケットは丈夫なカシネットで作られていた。","type":"noun","meaning_category":"生地"},{"sentence":"Cassinette was a popular choice for affordable men's suits in the 19th century.","translation":"カシネットは19世紀のお手頃な紳士服として人気があった。","type":"noun","meaning_category":"生地"}]}