{"word":"Camias","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A sweet and sour fruit native to the Philippines, also known as bilimbi.","english_definition":"A tropical fruit-bearing tree of the family Oxalidaceae, native to Southeast Asia, bearing edible but very acidic fruits; also, the fruit of this tree.","examples":[{"sentence":"Camias can be used to make jams and pickles.","translation":"カミアスはジャムやピクルスを作るのに使うことができます。"},{"sentence":"The camias tree is common in Filipino gardens.","translation":"カミアスの木はフィリピンの庭でよく見られます。"}],"collocations":["camias jam","camias pickle","camias tree"],"synonyms":["bilimbi","cucumber tree"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language. The exact origin is not definitively documented, but it is a common name for the fruit in the region.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæmiæs/","syllables":"Cam-i-as"},"inflection":{"noun_plural":"Camias (usually used as a mass noun or singular)"},"usage_notes":{"explanation":"'Camias' is primarily used to refer to the fruit itself or the tree that bears the fruit. It is most commonly encountered in contexts related to Filipino cuisine and botany.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a camiases.","correct":"✓ I ate a camias.","note":"While 'camias' can technically be pluralized, it is more common to use it in the singular form, even when referring to multiple fruits."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Camias' is a specialized term primarily used in the context of Filipino cuisine and botany. Understanding requires familiarity with tropical fruits and Southeast Asian culture.","priority":"★★☆"},"example_sentences":[{"sentence":"The sinigang was made sour with camias.","translation":"シニガンはカミアスで酸味をつけられた。","type":"noun","meaning_category":"fruit"},{"sentence":"She picked camias from the tree in her backyard.","translation":"彼女は裏庭の木からカミアスを摘んだ。","type":"noun","meaning_category":"fruit"}]}