{"word":"foreheater","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"予熱器、予熱装置","english_definition":"A device or system used to preheat something, typically a fluid or gas, before it enters a main process or apparatus.","examples":[{"sentence":"The power plant uses a foreheater to increase the efficiency of the steam turbine.","translation":"その発電所は、蒸気タービンの効率を上げるために予熱器を使用しています。"},{"sentence":"The foreheater in the chemical reactor ensures that the reactants are at the correct temperature before the reaction starts.","translation":"化学反応器の予熱器は、反応が始まる前に反応物が適切な温度になるようにします。"}],"collocations":["boiler foreheater","air foreheater","water foreheater"],"synonyms":["preheater","heater","warmer"],"antonyms":["cooler"]},{"part_of_speech":"noun","definition":"(内燃機関の)予熱栓","english_definition":"A glow plug or other device used to preheat the combustion chamber of an internal combustion engine, especially a diesel engine, to aid in starting.","examples":[{"sentence":"The diesel engine wouldn't start until the foreheater had warmed up the cylinders.","translation":"ディーゼルエンジンは、予熱栓がシリンダーを暖めるまで始動しませんでした。"},{"sentence":"A faulty foreheater can cause difficulty in starting a diesel engine in cold weather.","translation":"故障した予熱栓は、寒い天候下でのディーゼルエンジンの始動を困難にする可能性があります。"}],"collocations":["glow plug","diesel foreheater","engine foreheater"],"synonyms":["glow plug","preheating element"],"antonyms":[]}],"etymology":{"value":"The word 'foreheater' is a compound word formed from 'fore-' (meaning before or in front) and 'heater' (a device for heating).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrˌhiːtər/","syllables":"fore-heat-er"},"inflection":{"noun_plural":"foreheaters"},"usage_notes":{"explanation":"A 'foreheater' is a specific type of heater designed to preheat substances before they enter a main process. It is commonly used in industrial settings to improve efficiency or ensure proper reaction conditions. In the context of internal combustion engines, particularly diesel engines, a 'foreheater' refers to a glow plug or similar device that preheats the combustion chamber to facilitate starting, especially in cold conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The foreheater is used to cool the engine.","correct":"✓ The foreheater is used to heat the engine.","note":"A foreheater is used to *heat* (preheat) something, not to cool it."}],"priority":"★☆☆"},"related_words":{"derivatives":["foreheat (verb: to preheat)","heater"],"phrasal_verbs":[],"related_terms":["preheating","heat exchanger","glow plug","diesel engine"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'foreheater' is a technical term primarily used in engineering and industrial contexts. Understanding its meaning requires familiarity with concepts such as preheating processes and industrial equipment. In the context of diesel engines, it refers to a specific component (glow plug) used to aid in starting. Therefore, the term is more suitable for individuals with technical knowledge or those working in related fields."},"example_sentences":[{"sentence":"The industrial foreheater raised the temperature of the oil before it entered the refining process.","translation":"産業用予熱器は、油が精製プロセスに入る前に温度を上げました。","type":"noun","meaning_category":"予熱器"},{"sentence":"The mechanic replaced the faulty foreheater in the diesel engine.","translation":"整備士はディーゼルエンジンの故障した予熱栓を交換しました。","type":"noun","meaning_category":"予熱栓"}]}