{"word":"AFSCME","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"米国州郡自治体職員連盟 (American Federation of State, County and Municipal Employees)","english_definition":"American Federation of State, County and Municipal Employees; a labor union representing public service employees.","examples":[{"sentence":"AFSCME is one of the largest unions in the United States.","translation":"AFSCMEは米国最大の労働組合の一つです。"},{"sentence":"AFSCME represents workers in a variety of public sector jobs.","translation":"AFSCMEは様々な公共部門の仕事に従事する労働者を代表しています。"}],"collocations":["AFSCME union","AFSCME member","AFSCME local","AFSCME president"],"synonyms":["public sector union","labor union"],"antonyms":[]}],"etymology":{"value":"An acronym for the American Federation of State, County and Municipal Employees.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæfskmi/","syllables":"AF-SCME"},"inflection":{"notes":"It is a proper noun, so it does not have plural forms."},"usage_notes":{"explanation":"AFSCME is a labor union that represents public sector employees in the United States. It advocates for better wages, benefits, and working conditions for its members. It is a significant political force in many states and at the national level.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"","frequency_google_ngram":"Relatively low frequency, specific to US labor and politics.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"AFSCME is an acronym referring to a specific labor union in the United States. Understanding its meaning requires familiarity with US labor organizations and public sector employment. It is not a commonly used term outside of these contexts."},"example_sentences":[{"sentence":"AFSCME endorsed the candidate in the upcoming election.","translation":"AFSCMEは次の選挙でその候補者を支持しました。","type":"noun","meaning_category":"labor union"},{"sentence":"The AFSCME local negotiated a new contract with the city.","translation":"AFSCMEの地方支部は市と新しい契約を交渉しました。","type":"noun","meaning_category":"labor union"}]}