{"word":"ore-milling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鉱石粉砕、鉱石の粉砕処理","english_definition":"The process of crushing and grinding ore to a fine powder to facilitate the extraction of valuable minerals.","examples":[{"sentence":"The ore-milling process is crucial for efficient mineral recovery.","translation":"鉱石粉砕のプロセスは、効率的な鉱物回収のために重要です。"},{"sentence":"Modern ore-milling techniques have significantly improved the yield of valuable metals.","translation":"現代の鉱石粉砕技術は、貴重な金属の収量を大幅に向上させました。"}],"collocations":["ore-milling plant","ore-milling circuit","fine ore-milling","ore-milling equipment"],"synonyms":["ore grinding","mineral processing","comminution"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'ore,' referring to a naturally occurring solid material from which a valuable mineral can be extracted, and 'milling,' the process of grinding or crushing something into a fine powder.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔːrˌmɪlɪŋ/","syllables":"ore-mill-ing"},"inflection":{"noun_plural":"ore-millings (rare, usually used as a mass noun)"},"usage_notes":{"explanation":"'Ore-milling' refers specifically to the industrial process of reducing the size of ore particles. This is typically done using various types of mills, such as ball mills or rod mills. The goal is to increase the surface area of the ore, making it easier to extract the desired minerals through subsequent processes like leaching or flotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ore-milling was done by hand.","correct":"✓ The ore-milling was done by machine.","note":"While historically some ore-milling was done by hand, modern processes are almost exclusively mechanized."}],"priority":"★☆☆"},"related_words":{"derivatives":["mill","ore","milling","grinding","crushing","mineral processing","beneficiation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ore-milling' is a technical term used in the mining and mineral processing industries. It describes the process of reducing the size of ore particles through crushing and grinding. Understanding this term requires familiarity with mining and metallurgical concepts. It is not a commonly used term outside of these specific fields."},"example_sentences":[{"sentence":"The new ore-milling facility increased the plant's processing capacity.","translation":"新しい鉱石粉砕施設により、工場の処理能力が向上しました。","type":"general"},{"sentence":"Efficient ore-milling is essential for maximizing mineral recovery rates.","translation":"効率的な鉱石粉砕は、鉱物回収率を最大化するために不可欠です。","type":"technical"}]}