{"word":"conceivably","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"考えられる限りでは、ひょっとすると、もしかすると","english_definition":"in a way that is possible to imagine or believe.","examples":[{"sentence":"Conceivably, the project could be completed ahead of schedule.","translation":"考えられる限りでは、そのプロジェクトは予定より早く完了する可能性がある。"},{"sentence":"It is conceivably the best solution to the problem.","translation":"それはひょっとするとその問題に対する最良の解決策かもしれない。"},{"sentence":"Conceivably, he might have forgotten about the meeting.","translation":"もしかすると、彼は会議のことを忘れてしまったのかもしれない。"}],"collocations":["conceivably happen (ひょっとすると起こる)","conceivably be (ひょっとすると～である)","conceivably do (ひょっとすると～する)"],"synonyms":["possibly","potentially","imaginably","feasibly","perchance","maybe","perhaps"],"antonyms":["impossibly","unimaginably","inconceivably"]}],"etymology":{"value":"\"Conceivably\" is derived from the word \"conceivable,\" which comes from the verb \"conceive.\" \"Conceive\" originates from the Latin word \"concipere,\" meaning \"to take in, hold, conceive,\" formed from \"com-\" (together) and \"capere\" (to take). The adverbial form \"conceivably\" was created by adding the suffix \"-ly\" to \"conceivable.\"","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsiːvəbli/","syllables":"con-ceiv-a-bly"},"inflection":{"notes":"As an adverb, \"conceivably\" does not have different inflections."},"usage_notes":{"explanation":"\"Conceivably\" indicates that something is within the realm of possibility or imagination, but it doesn't suggest a high probability. It's used to introduce an idea or scenario that could happen, even if it's unlikely. The word often implies a degree of uncertainty or speculation. It is stronger than 'possibly' but weaker than 'probably'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Conceivably, it will definitely rain tomorrow.","correct":"✓ Conceivably, it might rain tomorrow.","note":"\"Conceivably\" suggests a possibility, not a certainty. Using it with \"definitely\" creates a contradiction. Use \"might,\" \"could,\" or \"may\" instead."},{"incorrect":"✗ He conceivably did the work. (when certainty is implied)","correct":"✓ He possibly did the work. / ✓ He might have done the work.","note":"When the action is more certain, it's better to use 'possibly' or 'might have done' to better reflect the level of uncertainty."}],"priority":"★★☆"},"related_words":{"derivatives":["conceivable (adjective: able to be imagined or believed)","conceive (verb: to form a mental image of something; to become pregnant)","concept (noun: an abstract idea)","conception (noun: the forming of a concept; the state of being pregnant)"],"phrases":["It is conceivable that... (～ということは考えられる)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderately frequent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"conceivably\" is used to show that something is possible, but not necessarily likely. It's a way of saying that you can imagine something happening, even if it's not very probable. It's often used in formal writing or speech to introduce a hypothetical situation or a potential outcome. It indicates a degree of uncertainty and speculation, suggesting that the idea is within the realm of possibility but not guaranteed."},"example_sentences":[{"sentence":"The company could conceivably double its profits this year if the new product is a success.","translation":"その会社は、新製品が成功すれば、今年はひょっとすると利益を倍増させることができるかもしれない。","type":"adverb","meaning_category":"可能性"},{"sentence":"Conceivably, we could take a different route to avoid the traffic.","translation":"もしかすると、交通渋滞を避けるために別のルートを通ることができるかもしれない。","type":"adverb","meaning_category":"可能性"},{"sentence":"It is conceivably the case that no one will ever know the truth.","translation":"誰も真実を知ることがないということもあり得る。","type":"adverb","meaning_category":"可能性"}]}