{"word":"Adipogenesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脂肪細胞分化、脂肪細胞形成","english_definition":"The formation of fat cells (adipocytes) from precursor cells.","examples":[{"sentence":"Adipogenesis is a complex process involving multiple transcription factors.","translation":"脂肪細胞分化は、複数の転写因子が関与する複雑なプロセスです。"},{"sentence":"Dysregulation of adipogenesis can lead to obesity.","translation":"脂肪細胞分化の異常は肥満につながる可能性があります。"}],"collocations":["inhibit adipogenesis (脂肪細胞分化を阻害する)","promote adipogenesis (脂肪細胞分化を促進する)","study adipogenesis (脂肪細胞分化を研究する)","adipogenesis pathway (脂肪細胞分化経路)"],"synonyms":["fat cell differentiation","fat cell formation"],"antonyms":["lipolysis (脂肪分解)"]}],"etymology":{"value":"Derived from the Greek words 'adipo-' (fat), 'genesis' (creation, origin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌædɪpoʊˈdʒɛnəsɪs/","syllables":"a-di-po-gen-e-sis"},"inflection":{"noun_plural":"adipogeneses"},"usage_notes":{"explanation":"Adipogenesis is a biological process crucial for understanding obesity, metabolic diseases, and related health conditions. Research in this area focuses on identifying the molecular mechanisms and signaling pathways that regulate the differentiation of preadipocytes into mature adipocytes. The term is primarily used in scientific and medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Adipogenesis is when you lose fat.","correct":"✓ Adipogenesis is when fat cells are formed.","note":"Adipogenesis is the formation of fat cells, not the loss of fat. Fat loss is lipolysis."}],"priority":"★★☆"},"related_words":{"derivatives":["adipocyte (脂肪細胞)","preadipocyte (前駆脂肪細胞)","lipogenesis (脂肪生成)","lipolysis (脂肪分解)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adipogenesis' refers to the process by which new fat cells are created in the body. This term is mainly used in scientific and medical contexts, particularly when discussing obesity, metabolism, and related health issues. Understanding adipogenesis is important for developing strategies to prevent or treat conditions associated with excessive fat accumulation. It's a complex biological process involving various signaling pathways and transcription factors.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers investigated the effects of a novel compound on adipogenesis in vitro.","translation":"研究者らは、新規化合物が試験管内の脂肪細胞分化に及ぼす影響を調査した。","type":"scientific","meaning_category":"脂肪細胞分化"},{"sentence":"Understanding the molecular mechanisms of adipogenesis is crucial for developing effective anti-obesity therapies.","translation":"脂肪細胞分化の分子メカニズムを理解することは、効果的な抗肥満療法を開発するために不可欠である。","type":"medical","meaning_category":"脂肪細胞分化"}]}