{"word":"rain-blue","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"雨上がりの空のような青色、雨に洗われた青色","english_definition":"Having a blue color reminiscent of the sky after rain; a clear, clean blue.","examples":[{"sentence":"The artist captured the rain-blue hues of the distant mountains.","translation":"その芸術家は、遠くの山の雨上がりの青色を捉えた。"},{"sentence":"Her eyes were a striking rain-blue, clear and bright.","translation":"彼女の瞳は印象的な雨上がりの青色で、澄んで輝いていた。"}],"collocations":["rain-blue eyes (雨上がりの空のような青い瞳)","rain-blue sky (雨上がりの空)","rain-blue color (雨上がりの青色)","rain-blue dress (雨上がりの青色のドレス)"],"synonyms":["sky-blue","azure","cerulean","clear blue","washed blue"],"antonyms":["muddy","dull","grayed"],"notes":"Often used poetically or descriptively to evoke a sense of freshness and clarity."}],"etymology":{"value":"Compound word formed from 'rain' and 'blue', suggesting the specific shade of blue often seen in the sky after rainfall.","priority":"★★★"},"pronunciation":{"ipa":"/ˈreɪnˌbluː/","syllables":"rain-blue"},"inflection":{"notes":"Adjective, does not inflect (no comparative or superlative forms)."},"usage_notes":{"explanation":"'Rain-blue' is primarily a descriptive adjective, used to describe a particular shade of blue. It is not a commonly used term, but it is evocative and can add a poetic touch to descriptions. It suggests a clear, vibrant blue, often associated with cleanliness and freshness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rain-blue was very strong today.","correct":"✓ The rain-blue color was very strong today. / ✓ The rain-blue sky was very strong today.","note":"'Rain-blue' is an adjective, so it needs to modify a noun (e.g., 'rain-blue sky', 'rain-blue color'). It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["rain","blue","azure","cerulean"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common term, but understandable.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rain-blue' is a compound adjective describing a specific shade of blue, reminiscent of the sky after rain. It is not a common term, so it is more likely to be encountered in descriptive or poetic writing. Understanding the individual components ('rain' and 'blue') makes the meaning relatively straightforward, but its infrequent usage places it at a higher readability level."},"example_sentences":[{"sentence":"The lake reflected the rain-blue sky above.","translation":"湖は、上空の雨上がりの青い空を映し出していた。","type":"descriptive","meaning_category":"color"},{"sentence":"She painted the walls a soft, rain-blue to create a calming atmosphere.","translation":"彼女は壁を柔らかい雨上がりの青色に塗り、穏やかな雰囲気を作り出した。","type":"descriptive","meaning_category":"color"},{"sentence":"The artist's rain-blue palette captured the essence of the coastal landscape.","translation":"その芸術家の雨上がりの青色のパレットは、沿岸の風景の本質を捉えていた。","type":"descriptive","meaning_category":"color"}]}