{"word":"physicalist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"唯物論者、物理主義者","english_definition":"A person who believes in physicalism, the philosophical position that everything which exists is ultimately physical, or that there are no mental properties or substances distinct from physical properties or substances.","examples":[{"sentence":"As a physicalist, she denies the existence of a soul.","translation":"唯物論者として、彼女は魂の存在を否定する。"},{"sentence":"Many contemporary philosophers are physicalists in some form.","translation":"現代の哲学者の多くは何らかの形で物理主義者である。"}],"collocations":["reductionist physicalist (還元主義的物理主義者)","eliminative physicalist (除去主義的物理主義者)","non-reductive physicalist (非還元主義的物理主義者)"],"synonyms":["materialist"],"antonyms":["dualist","idealist"]},{"part_of_speech":"adjective","definition":"唯物論的な、物理主義的な","english_definition":"Relating to or characterized by physicalism.","examples":[{"sentence":"The physicalist view of the mind is dominant in many scientific fields.","translation":"心の物理主義的な見方は多くの科学分野で支配的である。"},{"sentence":"He presented a physicalist argument against the existence of free will.","translation":"彼は自由意志の存在に対する唯物論的な議論を提示した。"}],"collocations":["physicalist theory (物理主義理論)","physicalist explanation (物理主義的説明)","physicalist ontology (物理主義的実体論)"],"synonyms":["materialistic"],"antonyms":["dualistic","idealistic"]}],"etymology":{"value":"The term 'physicalist' is derived from 'physicalism,' which emerged in the early 20th century as a refinement of materialism. It emphasizes that everything is ultimately reducible to physical properties and laws.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɪzɪkəlɪst/","syllables":"phys-i-cal-ist"},"inflection":{"notes":"The word 'physicalist' can function as both a noun and an adjective. As a noun, the plural form is 'physicalists.' As an adjective, it does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Physicalist' is primarily used in philosophical contexts, specifically in discussions about the nature of reality, consciousness, and the mind-body problem. It is often contrasted with dualism (the belief that mind and body are distinct substances) and idealism (the belief that reality is fundamentally mental). There are various types of physicalism, including reductive physicalism (which claims that mental states can be reduced to physical states) and non-reductive physicalism (which argues that mental states are dependent on, but not reducible to, physical states).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a physicist, so he must be a physicalist.","correct":"✓ He is a physicist, but that doesn't necessarily mean he is a physicalist.","note":"A physicist studies physics, while a physicalist adheres to the philosophical doctrine of physicalism. The terms are related but distinct."},{"incorrect":"✗ Physicalist is the same as physicist.","correct":"✓ Physicalist is a philosophical term, while physicist is a scientist who studies physics.","note":"These terms are often confused, but they have different meanings and belong to different fields."}],"priority":"★★☆"},"related_words":{"derivatives":["physicalism (名詞: 物理主義)","physicalistically (副詞: 物理主義的に)"],"phrases":["type physicalism (タイプ物理主義)","token physicalism (トークン物理主義)","eliminative materialism (除去主義的唯物論)","reductive materialism (還元主義的唯物論)","non-reductive physicalism (非還元主義的物理主義)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic philosophical discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Physicalist' is a term primarily used in philosophy to describe someone who believes that everything, including the mind and consciousness, can be explained by physical processes and properties. It's a complex concept often discussed in the context of the mind-body problem, where philosophers debate whether mental states are distinct from physical states or can be reduced to them. Different types of physicalism exist, such as reductive and non-reductive physicalism, each with its own nuances and arguments. Understanding this term requires familiarity with philosophical terminology and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The debate between the dualists and the **physicalists** continues to shape our understanding of consciousness.","translation":"二元論者と唯物論者の間の議論は、意識の理解を形成し続けている。","type":"noun","meaning_category":"人"},{"sentence":"The **physicalist** approach to understanding the brain is based on neuroscience.","translation":"脳を理解するための物理主義的アプローチは神経科学に基づいている。","type":"adjective","meaning_category":"性質"}]}