{"word":"digressively","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"本題から逸れて、脱線して","english_definition":"In a digressive manner; tending to stray from the main point or subject.","examples":[{"sentence":"He spoke digressively, often losing track of his original argument.","translation":"彼は脱線しながら話し、しばしば元の議論を見失った。"},{"sentence":"The author writes digressively, making it difficult to follow the main narrative.","translation":"その著者は脱線しながら書くので、主要な物語を追うのが難しい。"},{"sentence":"She explained the concept digressively, including many irrelevant details.","translation":"彼女は脱線しながらその概念を説明し、多くの無関係な詳細を含めた。"}],"collocations":["speak digressively","write digressively","explain digressively"],"synonyms":["tangentially","peripherally","deviatingly","erratically","meanderingly"],"antonyms":["directly","concisely","pertinently","relevantly","straightforwardly"]}],"etymology":{"value":"「digressive」に接尾辞「-ly」が付いたもの。","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈɡrɛsɪvli/","syllables":"di-gres-sive-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Digressively\" describes actions or speech patterns that deviate from the main topic. It indicates a tendency to wander off-topic, often including irrelevant or tangential information. The adverb emphasizes the manner in which something is done, highlighting its deviation from a direct or concise approach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted digressively at the party.","correct":"✓ He behaved erratically at the party.","note":"\"Digressively\" is typically used to describe speech or writing that strays from the main point, not general behavior. Use \"erratically\" or \"unpredictably\" for describing behavior. "},{"incorrect":"✗ The report was digressively written.","correct":"✓ The report was written digressively.","note":"Adverbs usually come before the past participle they modify in passive constructions. "},{"incorrect":"✗ She spoke digressively about her feelings.","correct":"✓ She spoke at length about her feelings.","note":"\"Digressively\" implies straying from a topic, not necessarily talking a lot about a topic. Use \"at length\" or \"extensively\" to indicate talking a lot about something."}],"priority":"★★☆"},"related_words":{"derivatives":["digress (verb)","digression (noun)","digressive (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"digressively\" is used to describe something that moves away from the main subject in speech or writing. It is not a common word, and understanding it requires a good vocabulary. It's often used in formal contexts or when analyzing the style of writing or speaking.","priority":"★★☆"},"example_sentences":[{"sentence":"The speaker talked digressively about his childhood, before returning to the main topic.","translation":"講演者は本題に戻る前に、自分の子供時代について脱線しながら話した。","type":"example"},{"sentence":"She wrote digressively, making it difficult for the reader to follow her argument.","translation":"彼女は脱線しながら書いたので、読者が彼女の議論を追うのが難しかった。","type":"example"},{"sentence":"He often explains things digressively, which can be confusing for the audience.","translation":"彼はしばしば脱線しながら物事を説明するので、聴衆にとって混乱することがある。","type":"example"}]}