{"word":"memilukan","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"mengharukan, menyedihkan, menimbulkan rasa iba","english_definition":"pitiful, heartbreaking, distressing, causing sorrow or compassion","examples":[{"sentence":"Kisah anak yatim piatu itu sangat memilukan.","translation":"The story of the orphans is very heartbreaking.","example_notes":"Describes a story that evokes pity."},{"sentence":"Keadaan pengungsi sangat memilukan.","translation":"The condition of the refugees is very pitiful.","example_notes":"Describes a situation that evokes compassion."},{"sentence":"Melihat hewan terlantar itu memilukan hati.","translation":"Seeing the abandoned animal is heartbreaking.","example_notes":"Describes the emotional impact of seeing something."}],"collocations":["keadaan memilukan (pitiful condition)","kisah memilukan (heartbreaking story)","nasib memilukan (pitiful fate)","peristiwa memilukan (distressing event)"],"synonyms":["mengharukan","menyedihkan","memprihatinkan","tragis","pedih"],"antonyms":["menyenangkan","menggembirakan","membahagiakan"]}],"etymology":{"value":"Berasal dari kata dasar 'pilu' (sedih, haru) yang mendapat imbuhan 'me-' dan '-kan' sehingga membentuk kata sifat yang bermakna 'menyebabkan pilu' atau 'menimbulkan rasa sedih'.","priority":"★★☆"},"pronunciation":{"ipa":"/mə.mi.lu.kan/","syllables":"me-mi-lu-kan"},"inflection":{"notes":"Tidak mengalami perubahan bentuk, tetapi dapat diulang untuk penekanan (memilukan-milukan)."},"usage_notes":{"explanation":"'Memilukan' digunakan untuk menggambarkan sesuatu yang sangat menyedihkan sehingga menimbulkan rasa iba atau kasihan yang mendalam. Kata ini sering digunakan untuk menggambarkan situasi, kisah, atau kondisi yang sangat sulit atau tragis. Tingkat kesedihan yang digambarkan lebih dalam daripada sekadar 'sedih' atau 'mengharukan'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dia merasa memilukan setelah mendengar berita itu.","correct":"Dia merasa sedih setelah mendengar berita itu.","note":"'Memilukan' menggambarkan sesuatu yang menyebabkan rasa iba, bukan perasaan orang itu sendiri. Lebih tepat menggunakan 'sedih' atau 'terharu'."},{"incorrect":"Film itu sangat memilukan sehingga saya tertawa.","correct":"Film itu sangat lucu sehingga saya tertawa.","note":"'Memilukan' menggambarkan sesuatu yang menyedihkan, bukan lucu."}],"priority":"★★☆"},"related_words":{"derivatives":["pilu (sedih, haru)","keterpiluan (kesedihan yang mendalam)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Cukup sering digunakan dalam bahasa Indonesia tertulis, terutama dalam konteks berita, sastra, dan percakapan sehari-hari.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Memilukan' adalah kata sifat yang menggambarkan sesuatu yang sangat menyedihkan dan menimbulkan rasa iba yang mendalam. Kata ini sering digunakan untuk menggambarkan situasi yang sulit, tragis, atau menyentuh hati. Penggunaan kata ini menunjukkan tingkat kesedihan yang lebih tinggi daripada sekadar 'sedih' atau 'mengharukan'. Kata ini sering ditemukan dalam berita, cerita, atau percakapan yang membahas topik-topik yang sensitif atau emosional."},"example_sentences":[{"sentence":"Kisah tentang perjuangan seorang ibu tunggal membesarkan anak-anaknya sangat memilukan.","translation":"The story about a single mother's struggle to raise her children is very heartbreaking.","type":"example","meaning_category":"mengharukan"},{"sentence":"Kondisi para korban bencana alam sangat memilukan dan membutuhkan bantuan segera.","translation":"The condition of the natural disaster victims is very pitiful and requires immediate assistance.","type":"example","meaning_category":"menyedihkan"},{"sentence":"Melihat anak-anak yang kelaparan itu sungguh memilukan hati.","translation":"Seeing the starving children is truly heartbreaking.","type":"example","meaning_category":"menimbulkan rasa iba"}]}