{"word":"noncommemoration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非記念、不祝典","english_definition":"The act or state of not commemorating; a failure or refusal to commemorate.","examples":[{"sentence":"The city council's decision on noncommemoration of the event sparked controversy.","translation":"市議会のそのイベントを非記念とすることの決定は論争を引き起こした。"},{"sentence":"The artist's work was a deliberate act of noncommemoration, challenging traditional heroic narratives.","translation":"そのアーティストの作品は、伝統的な英雄的物語に挑戦する、意図的な非記念の行為だった。"}],"collocations":["act of noncommemoration","policy of noncommemoration"],"synonyms":["anti-commemoration","uncelebration"],"antonyms":["commemoration","celebration","remembrance"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"commemoration\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkəˌmeməˈreɪʃən/","syllables":"non-co-mem-o-ra-tion"},"inflection":{"noun_plural":"noncommemorations"},"usage_notes":{"explanation":"\"Noncommemoration\" refers to the explicit avoidance or refusal to commemorate an event, person, or idea. It can be a deliberate act with political, social, or artistic motivations. It is the opposite of commemoration, which involves honoring or remembering something through ceremonies, monuments, or other forms of recognition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The noncommemoration was a great success.","correct":"✓ The noncommemoration was a deliberate choice.","note":"\"Noncommemoration\" itself cannot be a success, as it implies an absence of celebration. The success might lie in the impact or message conveyed by *not* commemorating something."}],"priority":"★☆☆"},"related_words":{"derivatives":["noncommemorative (adjective)"],"antonyms":["commemorate (verb)","commemorative (adjective)","commemoration (noun)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'noncommemoration' is a relatively rare and complex term. It describes the act of intentionally *not* commemorating something, often as a deliberate statement or protest. Understanding this word requires a grasp of the prefix 'non-' and the base word 'commemoration,' as well as the nuanced reasons why someone might choose to avoid celebrating or remembering a particular event or person."},"example_sentences":[{"sentence":"The museum's decision for noncommemoration of the colonial period aimed to critically reassess its legacy.","translation":"博物館の植民地時代を非記念とする決定は、その遺産を批判的に再評価することを目的としていた。","type":"noun","meaning_category":"非記念 (意図的な不祝典)"},{"sentence":"The group advocated for the noncommemoration of war anniversaries, arguing they glorified violence.","translation":"そのグループは、戦争記念日を非記念とすることを提唱し、それらが暴力を美化していると主張した。","type":"noun","meaning_category":"非記念 (反対運動としての不祝典)"}]}