{"word":"nonrenunciation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(仏教)非放棄、世俗的な欲望や執着を完全に断ち切らないこと。","english_definition":"(Buddhism) The state of not renouncing; not giving up worldly desires and attachments completely.","examples":[{"sentence":"The concept of nonrenunciation suggests a path where one can engage with the world without being attached to it.","translation":"非放棄の概念は、世界との関わりを持ちながら、それに執着しない道を示唆している。"},{"sentence":"Some schools of Buddhism emphasize nonrenunciation as a way to enlightenment.","translation":"一部の仏教の学派は、悟りへの道として非放棄を重視している。"}],"collocations":["practice nonrenunciation (非放棄を実践する)","path of nonrenunciation (非放棄の道)","teachings on nonrenunciation (非放棄に関する教え)"],"synonyms":["non-abandonment","non-rejection","non-denial"],"antonyms":["renunciation","abandonment","rejection","denial"]},{"part_of_speech":"noun","definition":"(一般)放棄しないこと、拒否しないこと、否定しないこと。","english_definition":"(General) The act of not renouncing, rejecting, or denying something.","examples":[{"sentence":"His nonrenunciation of his principles impressed many people.","translation":"彼の主義主張を放棄しない姿勢は多くの人々に感銘を与えた。"},{"sentence":"The company's nonrenunciation of its commitment to sustainability is commendable.","translation":"その企業の持続可能性へのコミットメントを放棄しないことは称賛に値する。"}],"collocations":["nonrenunciation of principles (主義主張の非放棄)","nonrenunciation of commitment (コミットメントの非放棄)"],"synonyms":["non-abandonment","non-rejection","non-denial"],"antonyms":["renunciation","abandonment","rejection","denial"]}],"etymology":{"value":"\"non-\"（否定の接頭辞）+ \"renunciation\"（放棄）","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnriˌnʌnsiˈeɪʃən/","syllables":"non-re-nun-ci-a-tion"},"inflection":{"noun_plural":"nonrenunciations"},"usage_notes":{"explanation":"\"Nonrenunciation\" is a relatively uncommon word, primarily used in Buddhist contexts to describe a path that doesn't require complete detachment from the world. It can also be used more generally to describe the act of not giving up or rejecting something, such as a principle or commitment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced nonrenunciation of his family.","correct":"✓ He practiced non-attachment to his family.","note":"非放棄は、家族そのものを放棄しないという意味ではなく、家族への執着を放棄しないという意味合いで使われることが多い。"},{"incorrect":"✗ Nonrenunciation is the same as acceptance.","correct":"✓ Nonrenunciation is not necessarily the same as acceptance; it's about not being attached.","note":"非放棄は必ずしも受け入れることと同じではない。執着しないことが重要。"}],"priority":"★☆☆"},"related_words":{"derivatives":["renunciation (放棄)","renounce (放棄する)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonrenunciation\" is a formal and relatively rare term, primarily used in philosophical or religious contexts, especially in discussions of Buddhist practice. It refers to the idea of engaging with the world without being attached to worldly desires. The word is formed by adding the prefix \"non-\" to \"renunciation,\" which means the act of giving up or rejecting something. Understanding this word requires familiarity with abstract concepts and philosophical vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The practice of nonrenunciation allows one to live in the world without being consumed by its illusions.","translation":"非放棄の実践は、人が世界の幻想に囚われずに生きることを可能にする。","type":"noun","meaning_category":"Buddhism"},{"sentence":"His nonrenunciation of his beliefs inspired others to stand up for what they believed in.","translation":"彼の信念を放棄しない姿勢は、他の人々に自分の信じるもののために立ち上がるよう促した。","type":"noun","meaning_category":"General"}]}