{"word":"impugner","priority":"low","meanings":[{"part_of_speech":"noun","definition":"One who impugns; one who challenges or attacks as false.","english_definition":"A person who challenges or attacks something as false or questionable.","examples":[{"sentence":"He was known as an impugner of conventional wisdom.","translation":"彼は従来の知恵を攻撃する人として知られていた。"},{"sentence":"The impugner of the witness's testimony was very aggressive.","translation":"証人の証言に異議を唱える人は非常に攻撃的だった。"}],"collocations":["impugner of truth","impugner of character","impugner of motives"],"synonyms":["challenger","attacker","critic","denier","questioner"],"antonyms":["supporter","defender","advocate","believer"]}],"etymology":{"value":"Derived from the verb 'impugn,' which comes from the Latin 'impugnare,' meaning 'to attack.'","priority":"medium"},"pronunciation":{"ipa":"/ɪmˈpjuːnər/","syllables":"im-pugn-er"},"inflection":{"noun_plural":"impugners"},"usage_notes":{"explanation":"The word 'impugner' is relatively rare and formal. It is used to describe someone who actively challenges or questions the validity or truth of something, often with the implication of a strong or aggressive attack.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He is an impugner of the law, always following it strictly.","correct":"He is a follower of the law, always adhering to it strictly.","note":"An 'impugner' challenges or attacks something, so it's contradictory to say they follow the law."}],"priority":"low"},"related_words":{"derivatives":["impugn (verb)","impugnable (adjective)","impugnment (noun)"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C2","text":"'Impugner' is a sophisticated word that describes someone who actively challenges or questions the truth or validity of something. It suggests a more aggressive or formal challenge than a simple disagreement. Because of its rarity and formality, it's more likely to be found in legal or academic contexts."},"example_sentences":[{"sentence":"As an impugner of the established scientific theories, he faced considerable opposition.","translation":"確立された科学理論の攻撃者として、彼はかなりの反対に直面した。","type":"noun","meaning_category":"challenger"},{"sentence":"The journalist became an impugner of the politician's claims, revealing inconsistencies in his statements.","translation":"そのジャーナリストは、政治家の主張の攻撃者となり、彼の声明の矛盾を明らかにした。","type":"noun","meaning_category":"critic"}]}