{"word":"submissions","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"提出物、提出書類、応募作品","english_definition":"The act of presenting a document, proposal, or application for consideration; something presented for consideration.","examples":[{"sentence":"The deadline for submissions is next Friday.","translation":"提出物の締め切りは来週の金曜日です。"},{"sentence":"We received hundreds of submissions for the writing contest.","translation":"私たちはその作文コンテストに何百もの応募作品を受け取りました。"},{"sentence":"All submissions must adhere to the guidelines.","translation":"すべての提出物はガイドラインに従う必要があります。"}],"collocations":["call for submissions (提出を呼びかける)","deadline for submissions (提出締め切り)","review submissions (提出物を審査する)","online submissions (オンライン提出)","art submissions (芸術作品の提出)","literary submissions (文学作品の提出)","legal submissions (法的提出書類)"],"synonyms":["entries","applications","proposals","documents","papers","manuscripts"],"antonyms":["withdrawals","retractions"]},{"part_of_speech":"noun","definition":"服従、降伏、従順","english_definition":"The act of yielding to the authority or control of another.","examples":[{"sentence":"The general demanded the enemy's unconditional submission.","translation":"将軍は敵の無条件降伏を要求した。"},{"sentence":"Her submission to his will was complete.","translation":"彼女の彼の意志への服従は完全だった。"},{"sentence":"Submission is not always a sign of weakness.","translation":"服従は必ずしも弱さの表れではない。"}],"collocations":["unconditional submission (無条件降伏)","complete submission (完全な服従)","forced submission (強制的な服従)","voluntary submission (自発的な服従)","religious submission (宗教的な服従)"],"synonyms":["obedience","compliance","deference","acquiescence","capitulation","surrender"],"antonyms":["resistance","defiance","rebellion","opposition"]}],"etymology":{"value":"The word \"submission\" comes from the Latin word \"submittere,\" which means \"to let down, lower, reduce; yield.\" It is formed from \"sub-\" (under) and \"mittere\" (to send, let go). The sense of \"yielding to authority\" developed in the late 14th century.","priority":"★★☆"},"pronunciation":{"ipa":"/səbˈmɪʃənz/","syllables":"sub-mis-sions"},"inflection":{"noun_plural":"submissions"},"usage_notes":{"explanation":"The word \"submissions\" has two main meanings: 1) things that are submitted, such as documents or applications, and 2) the act of submitting or yielding to someone's authority. The first meaning is more common in contexts related to contests, applications, or academic work. The second meaning is often used in discussions of power dynamics, obedience, or religious faith. It is important to understand the context to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The submission date is on Friday.","correct":"✓ The submission deadline is on Friday.","note":"When referring to the last day to submit something, use \"submission deadline\" instead of \"submission date.\""},{"incorrect":"✗ He showed submission to his boss by arguing with him.","correct":"✓ He showed defiance to his boss by arguing with him.","note":"Arguing with someone is the opposite of showing submission. \"Defiance\" or \"resistance\" would be more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["submit (verb)","submissive (adjective)","submissively (adverb)"],"phrasal_verbs":["submit to (服従する、～に提出する)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately high frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"submissions\" refers to things that are presented for consideration, such as applications or documents. It also means the act of yielding to someone's authority. The first meaning is common in contexts like contests or academic assignments. The second meaning is used when discussing obedience or power dynamics. Understanding the context is important to determine the intended meaning of the word.","priority":"★★☆"},"example_sentences":[{"sentence":"The website is now accepting submissions for the short story competition.","translation":"そのウェブサイトは現在、短編小説コンテストへの応募作品を受け付けています。","type":"noun","meaning_category":"提出物"},{"sentence":"The company requires all employees to follow its code of conduct and demonstrate submission to its policies.","translation":"その会社は、すべての従業員が行動規範に従い、その方針への服従を示すことを要求しています。","type":"noun","meaning_category":"服従"},{"sentence":"The artist carefully reviewed all the submissions before selecting the winners.","translation":"そのアーティストは、受賞者を選ぶ前にすべての提出物を注意深く審査しました。","type":"noun","meaning_category":"提出物"},{"sentence":"In some cultures, submission to elders is considered a virtue.","translation":"一部の文化では、年長者への服従は美徳とされています。","type":"noun","meaning_category":"服従"}]}