{"word":"emigrationist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"移民推進論者、移民奨励者","english_definition":"A person who advocates or promotes emigration.","examples":[{"sentence":"The emigrationist argued that leaving the country would provide better opportunities.","translation":"移民推進論者は、出国することでより良い機会が得られると主張した。"}],"collocations":["support emigration (移民を支持する)","promote emigration (移民を推進する)"],"synonyms":["migrationist","populationist"],"antonyms":["immigrationist"],"notes":"This term is relatively rare and often used in historical or political contexts."}],"etymology":{"value":"From 'emigration' (the act of leaving one's own country to settle permanently in another) + '-ist' (a suffix denoting a person who advocates or is associated with something).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛmɪˈɡreɪʃənɪst/","syllables":"em-i-gra-tion-ist"},"inflection":{"noun_plural":"emigrationists"},"usage_notes":{"explanation":"The term 'emigrationist' is not commonly used. It specifically refers to someone who actively supports or encourages emigration, rather than simply someone who emigrates. It is often found in discussions about population policy or historical migration patterns.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an emigrationist because he emigrated.","correct":"✓ He is an emigrationist because he advocates for others to emigrate.","note":"Emigrating oneself does not make one an 'emigrationist.' The term implies active advocacy."}],"priority":"★☆☆"},"related_words":{"derivatives":["emigrate (verb: 移住する)","emigration (noun: 移住)","immigrant (noun: 移民)","immigration (noun: 移民)"],"related_concepts":["migration","population policy","diaspora"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'emigrationist' is a specialized term rarely encountered in everyday language. It refers to an individual who actively promotes or supports emigration. Understanding requires knowledge of the root word 'emigration' and the suffix '-ist,' which denotes advocacy or association. Usage is typically limited to academic or political discussions concerning migration patterns and population policies."},"example_sentences":[{"sentence":"The government official was labeled an emigrationist after proposing policies that encouraged citizens to seek opportunities abroad.","translation":"その政府高官は、国民に海外での機会を求めることを奨励する政策を提案した後、移民推進論者というレッテルを貼られた。","type":"noun","meaning_category":"移民推進論者"},{"sentence":"Early 20th-century pamphlets often featured emigrationists arguing for the benefits of settling in the New World.","translation":"20世紀初頭のパンフレットには、新世界への定住の利点を主張する移民推進論者がよく登場した。","type":"noun","meaning_category":"移民推進論者"}]}