{"word":"Glycuronid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学) グルクロン酸抱合体","english_definition":"(organic chemistry) A glucuronide is any substance produced by linking glucuronic acid to another substance via a glycosidic bond.","examples":[{"sentence":"The glycuronid formation is an important detoxification pathway in the body.","translation":"グルクロン酸抱合体の形成は、体内の重要な解毒経路である。"}],"collocations":["glycuronidation","glucuronic acid","detoxification"],"synonyms":["glucuronide"],"antonyms":[]}],"etymology":{"value":"The term \"glycuronid\" is derived from \"glucuronic acid\" and the suffix \"-ide,\" indicating a compound formed from it.","priority":"★★★"},"pronunciation":{"ipa":"/ɡlɪˈkjʊərənɪd/","syllables":"gly-cu-ro-nid"},"inflection":{"noun_plural":"Glycuronids"},"usage_notes":{"explanation":"Glycuronides are formed by the attachment of glucuronic acid to other molecules, such as drugs, hormones, or toxins, to make them more water-soluble and easier to excrete from the body. This process, called glucuronidation, is a major detoxification pathway in the liver.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["glucuronidation","glucuronic acid"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Glycuronides are complex organic compounds formed through glucuronidation, a detoxification process. This term is primarily used in biochemistry, pharmacology, and related scientific fields. Understanding requires knowledge of organic chemistry and metabolic pathways."},"example_sentences":[{"sentence":"The drug is metabolized into a glycuronid in the liver.","translation":"その薬物は肝臓でグルクロン酸抱合体に代謝される。","type":"scientific","meaning_category":"metabolism"},{"sentence":"Glycuronid formation enhances the excretion of bilirubin.","translation":"グルクロン酸抱合体の形成はビリルビンの排泄を促進する。","type":"scientific","meaning_category":"biochemistry"}]}