{"word":"unformability","priority":"low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being formable; resistance to being shaped or molded.","english_definition":"The quality or state of being unformable; the inability to be shaped or molded.","examples":[{"sentence":"The unformability of the hardened clay made it unsuitable for sculpting.","translation":"硬化した粘土の成形性の低さから、彫刻には不向きだった。"},{"sentence":"Due to its high brittleness, the material exhibited significant unformability.","translation":"高い脆性のため、その材料は著しい非成形性を示した。"}],"collocations":["high unformability","low unformability","exhibit unformability","material unformability"],"synonyms":["non-formability","inability to be shaped","resistance to deformation"],"antonyms":["formability","malleability","ductility","shapability"],"related_terms":["formable","forming","deformation","molding","shaping"]}],"etymology":{"value":"Derived from \"un-\" (not) + \"formability\" (the ability to be formed).","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnfɔːrməˈbɪləti/","syllables":"un-form-a-bil-i-ty"},"inflection":{"noun_plural":"unformabilities (rare)"},"usage_notes":{"explanation":"This term is typically used in materials science, engineering, and manufacturing contexts to describe materials that are difficult or impossible to shape into desired forms without fracturing or undergoing significant damage. It is the opposite of formability, which indicates how easily a material can be shaped.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The unformability was due to the temperature.","correct":"The unformability was due to the low temperature.","note":"It's better to specify the condition causing unformability."}],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unformability' refers to the characteristic of a material that makes it difficult or impossible to shape or mold. It's often used in technical contexts, such as materials science or manufacturing, to describe how resistant a substance is to being formed into a specific shape. The prefix 'un-' indicates the opposite of 'formability,' which is the ability to be shaped easily."},"example_sentences":[{"sentence":"The alloy's high unformability made it unsuitable for complex designs.","translation":"合金の高い非成形性により、複雑な設計には不向きだった。","type":"general","meaning_category":"inability to be shaped"},{"sentence":"The research focused on reducing the unformability of the composite material.","translation":"その研究は、複合材料の非成形性を低減することに焦点を当てていた。","type":"technical","meaning_category":"resistance to molding"}]}