{"word":"Bonn","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボン (ドイツの都市、旧西ドイツの首都)","english_definition":"A city in western Germany, located on the Rhine river. It was the capital of West Germany from 1949 to 1990 and the seat of government until 1999.","examples":[{"sentence":"Bonn is a city with a rich history.","translation":"ボンは豊かな歴史を持つ都市です。"},{"sentence":"Many international organizations are located in Bonn.","translation":"多くの国際機関がボンにあります。"},{"sentence":"He studied at the University of Bonn.","translation":"彼はボン大学で学びました。"}],"collocations":["University of Bonn (ボン大学)","Bonn Agreement (ボン合意)","Bonn International Center for Conversion (ボン国際転換センター)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Bonn' is derived from the Roman settlement 'Bonna', which is believed to be of Celtic origin.","priority":"★★☆"},"pronunciation":{"ipa":"/bɔn/","syllables":"Bonn"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"'Bonn' is primarily known as the former capital of West Germany. Even after the capital moved to Berlin, Bonn remains an important center for government and international organizations. When referring to the city, it's important to use the correct spelling ('Bonn' with two 'n's).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Bon is a city in Germany.","correct":"✓ Bonn is a city in Germany.","note":"The correct spelling is 'Bonn' with two 'n's."}],"priority":"★★☆"},"related_words":{"derivatives":["Bonn Agreement (ボン合意)","Bonn International Center for Conversion (ボン国際転換センター)"],"related_places":["Cologne (ケルン, a nearby city)","Berlin (ベルリン, the current capital of Germany)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but well-known due to historical significance.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bonn' is a proper noun referring to a specific city in Germany. Its significance stems from its history as the former capital of West Germany. While not as frequently used as other city names, it is important to recognize due to its historical and political context. Understanding its role in post-World War II Germany is crucial for comprehending modern German history."},"example_sentences":[{"sentence":"After the reunification of Germany, Bonn lost its status as the capital.","translation":"ドイツ再統一後、ボンは首都としての地位を失った。","type":"noun","meaning_category":"city"},{"sentence":"The 'Bonn Agreement' refers to a series of agreements reached in Bonn, Germany.","translation":"「ボン合意」とは、ドイツのボンで合意に達した一連の合意を指します。","type":"noun","meaning_category":"city (in a historical context)"}]}