{"word":"fruit-preserve-themed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"果物の保存食（ジャム、コンポート、マーマレードなど）をテーマにした","english_definition":"Having a theme related to fruit preserves (such as jams, compotes, marmalades, etc.).","examples":[{"sentence":"The bakery offered a fruit-preserve-themed afternoon tea, featuring scones with homemade jam and miniature fruit tarts.","translation":"そのベーカリーでは、自家製ジャムを添えたスコーンやミニフルーツタルトなど、果物の保存食をテーマにしたアフタヌーンティーを提供していました。"},{"sentence":"The artist created a fruit-preserve-themed series of paintings, depicting colorful jars of jam and preserves.","translation":"そのアーティストは、色とりどりのジャムや保存食の瓶を描いた、果物の保存食をテーマにした一連の絵画を制作しました。"}],"collocations":["fruit-preserve-themed party (果物の保存食をテーマにしたパーティー)","fruit-preserve-themed gift basket (果物の保存食をテーマにしたギフトバスケット)","fruit-preserve-themed recipe book (果物の保存食をテーマにしたレシピ本)"],"synonyms":["jam-themed","compote-themed","marmalade-themed"],"antonyms":[]}],"etymology":{"value":"複合語: \"fruit preserve\"（果物の保存食） + \"-themed\"（～をテーマにした）。","priority":"N/A"},"pronunciation":{"ipa":"/ˈfruːt pɹɪˈzɜːrv θiːmd/","syllables":"fruit-pre-serve-themed"},"inflection":{"notes":"形容詞であり、活用形はありません。"},"usage_notes":{"explanation":"この形容詞は、特定のテーマやスタイルが果物の保存食に関連していることを示します。イベント、商品、アート作品などを説明するために使用できます。","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["themed"],"related_terms":["fruit preserve","jam","compote","marmalade"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特定の文脈でのみ使用される専門的な語彙。","priority":"N/A"},"readability_explanation":{"level":"C1","text":"\"Fruit-preserve-themed\" is a compound adjective used to describe something that has a theme related to fruit preserves. It is not a common word and is typically used in specific contexts, such as describing a party, a gift basket, or a recipe book. The word is relatively easy to understand if you know the meaning of \"fruit preserve\" and \"themed.\" However, it is not a word that you would encounter frequently in everyday conversation or writing."},"example_sentences":[{"sentence":"The craft fair featured a stall selling fruit-preserve-themed decorations for the kitchen.","translation":"そのクラフトフェアでは、キッチン用の果物の保存食をテーマにした装飾品を販売する屋台が出ていました。","type":"adjective","meaning_category":"テーマ"}]}