{"word":"Uncanonical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"正統でない、規範的でない、標準的でない","english_definition":"Not conforming to orthodox or established rules or standards.","examples":[{"sentence":"The uncanonical interpretation of the text was met with skepticism.","translation":"そのテキストの非正統的な解釈は懐疑的に受け止められた。"},{"sentence":"His uncanonical approach to the problem yielded unexpected results.","translation":"彼のその問題に対する非標準的なアプローチは、予期せぬ結果をもたらした。"},{"sentence":"The uncanonical design of the building stood out in the historic district.","translation":"その建物の非規範的なデザインは、歴史的な地区で際立っていた。"}],"collocations":["uncanonical interpretation","uncanonical approach","uncanonical design","uncanonical status","uncanonical source"],"synonyms":["nonstandard","unorthodox","irregular","heterodox","deviant","nonconforming"],"antonyms":["canonical","orthodox","standard","regular","conventional"]}],"etymology":{"value":"\"Un-\" (not) + \"canonical\" (relating to a canon or standard).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkəˈnɒnɪkəl/","syllables":"un-ca-non-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more uncanonical' and 'most uncanonical', respectively."},"usage_notes":{"explanation":"\"Uncanonical\" describes something that deviates from established rules, standards, or norms. It often implies a departure from what is considered authoritative or traditional. The word is frequently used in academic, religious, or technical contexts to denote something that does not adhere to accepted principles or practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncanonical book was very popular.","correct":"✓ The apocryphal book was very popular.","note":"Use \"apocryphal\" when referring to a book of doubtful authenticity, especially in religious contexts, rather than \"uncanonical,\" which refers to something not conforming to established rules or standards."},{"incorrect":"✗ The uncanonical behavior was praised.","correct":"✓ The unconventional behavior was praised.","note":"Use \"unconventional\" to describe behavior that deviates from social norms, rather than \"uncanonical,\" which is more formal and implies a deviation from established rules or standards."}],"priority":"★★☆"},"related_words":{"derivatives":["uncanonically (adverb)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uncanonical\" is a formal term used to describe something that doesn't follow established rules or standards. It's often used in academic or technical discussions. For example, you might hear about an \"uncanonical interpretation\" of a religious text, meaning an interpretation that goes against traditional or accepted understandings. It's not a word you'd use in everyday conversation, but it's helpful to know in specific contexts."},"example_sentences":[{"sentence":"The uncanonical data source was deemed unreliable for the study.","translation":"その非標準的なデータソースは、研究には信頼できないと判断された。","type":"general","meaning_category":"nonstandard"},{"sentence":"The uncanonical version of the story gained a cult following online.","translation":"その物語の非正統的なバージョンは、オンラインでカルト的な人気を得た。","type":"general","meaning_category":"unorthodox"},{"sentence":"The uncanonical approach to software development led to significant innovation.","translation":"ソフトウェア開発への非規範的なアプローチは、大きな革新につながった。","type":"technical","meaning_category":"irregular"}]}