{"word":"protostome","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"先口動物","english_definition":"Any animal in which the mouth develops from the primary embryonic opening, such as mollusks, annelids, and arthropods.","examples":[{"sentence":"Protostomes are one of the two major divisions of the Bilateria.","translation":"先口動物は左右相称動物の二つの主要な区分の一つです。"},{"sentence":"The evolutionary history of protostomes is complex and still being researched.","translation":"先口動物の進化の歴史は複雑で、まだ研究が進められています。"}],"collocations":["protostome development","protostome lineage","major protostome groups"],"synonyms":[],"antonyms":["deuterostome"]}],"etymology":{"value":"From Ancient Greek πρῶτος (prôtos, \"first\") + στόμα (stóma, \"mouth\"). Referring to the mouth developing from the blastopore.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊtəstoʊm/","syllables":"pro-to-stome"},"inflection":{"noun_plural":"protostomes"},"usage_notes":{"explanation":"Protostomes are a major group of animals characterized by the mouth developing from the blastopore during embryonic development. This contrasts with deuterostomes, where the anus develops from the blastopore. Protostomes include a vast array of invertebrate animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Protostomes are vertebrates.","correct":"✓ Protostomes are invertebrates.","note":"Protostomes are invertebrates, while vertebrates are deuterostomes."},{"incorrect":"✗ Protostome development is the same as deuterostome development.","correct":"✓ Protostome development is different from deuterostome development.","note":"The key difference between protostomes and deuterostomes lies in their embryonic development, particularly the fate of the blastopore."}],"priority":"★★☆"},"related_words":{"derivatives":["protostomic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protostome' is a technical term used in zoology and developmental biology to classify a major group of animals based on their embryonic development. Specifically, it refers to animals where the mouth develops from the blastopore, the first opening that forms during gastrulation. Understanding this term requires familiarity with basic concepts in embryology and animal classification. It is typically encountered in advanced biology courses or scientific literature.","priority":"★★☆"},"example_sentences":[{"sentence":"Most invertebrate species, including insects and mollusks, are classified as **protostomes**.","translation":"昆虫や軟体動物を含むほとんどの無脊椎動物は、先口動物に分類されます。","type":"general","meaning_category":"classification"},{"sentence":"The **protostome** developmental pathway differs significantly from that of deuterostomes.","translation":"先口動物の発生経路は、後口動物のそれとは大きく異なります。","type":"developmental biology","meaning_category":"development"},{"sentence":"Researchers are studying the genetic basis of **protostome** evolution to understand the diversity of body plans.","translation":"研究者たちは、体型の多様性を理解するために、先口動物の進化の遺伝的基盤を研究しています。","type":"evolutionary biology","meaning_category":"evolution"}]}