{"word":"SSE","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Stock Exchange) ロンドン証券取引所における主要な株価指数のひとつ、FTSE 100指数のこと","english_definition":"(Stock Exchange) An abbreviation for the London Stock Exchange, often used to refer to the FTSE 100 index.","examples":[{"sentence":"The SSE closed up 20 points today.","translation":"今日のSSEは20ポイント上昇して取引を終えました。"}],"collocations":["FTSE 100","stock market","index","share price"],"synonyms":["FTSE","stock exchange"],"antonyms":[]},{"part_of_speech":"noun","definition":"(Science/Technology) Server-Sent Eventsの略","english_definition":"(Science/Technology) Abbreviation for Server-Sent Events, a server push technology enabling a server to automatically send data updates to a client's browser.","examples":[{"sentence":"SSE allows for real-time data streaming from the server to the client.","translation":"SSEはサーバーからクライアントへのリアルタイムデータストリーミングを可能にします。"}],"collocations":["server-sent events","real-time data","web technology","data streaming","HTTP"],"synonyms":["server push","event stream"],"antonyms":[]},{"part_of_speech":"noun","definition":"(Energy) Scottish and Southern Energyの略","english_definition":"(Energy) Abbreviation for Scottish and Southern Energy, a major energy company in the UK.","examples":[{"sentence":"SSE is a major provider of electricity and gas in Scotland.","translation":"SSEはスコットランドにおける電気とガスの主要な供給業者です。"}],"collocations":["energy company","electricity","gas","renewable energy","power generation"],"synonyms":["Scottish and Southern Energy"],"antonyms":[]}],"etymology":{"value":"The etymology depends on the meaning. For Stock Exchange, it's simply an abbreviation. For Server-Sent Events, it describes the technology. For Scottish and Southern Energy, it's the name of the company.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛsˌɛsˈiː/","syllables":"ES-ES-EE"},"inflection":{"notes":"It's an abbreviation, so it doesn't inflect."},"usage_notes":{"explanation":"'SSE' is an acronym that can have different meanings depending on the context. It's important to understand the context to know which meaning is intended. The most common meanings are related to the stock exchange (FTSE 100 index), server-sent events (a web technology), or Scottish and Southern Energy (a UK energy company).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I invested in SSE, the server-sent events company.","correct":"✓ I invested in SSE, the Scottish and Southern Energy company.","note":"Make sure you know which SSE is being referred to. Server-sent events is a technology, not a company."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["FTSE 100","HTTP","JavaScript","energy","utilities"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (depending on the context)","frequency_google_ngram":"Low to medium frequency, depending on the context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'SSE' is an abbreviation that can refer to multiple things, so understanding the context is crucial. In finance, it often means the London Stock Exchange or, more specifically, the FTSE 100 index. In web development, it stands for Server-Sent Events, a technology for real-time data updates. In the UK, it can also refer to Scottish and Southern Energy, a major energy provider. Therefore, pay close attention to the surrounding information to determine the correct meaning."},"example_sentences":[{"sentence":"The **SSE** is a key indicator of the UK economy.","translation":"SSEは英国経済の重要な指標です。","type":"noun","meaning_category":"Stock Exchange (FTSE 100)"},{"sentence":"**SSE** provides a simple way to push data from the server to the client.","translation":"SSEはサーバーからクライアントにデータをプッシュする簡単な方法を提供します。","type":"noun","meaning_category":"Server-Sent Events"},{"sentence":"**SSE** is investing heavily in renewable energy sources.","translation":"SSEは再生可能エネルギー源に大規模な投資を行っています。","type":"noun","meaning_category":"Scottish and Southern Energy"}]}