{"word":"Nonconsolidation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(会計)連結除外、非連結","english_definition":"The accounting practice of not combining the financial results of a subsidiary with those of the parent company.","examples":[{"sentence":"The company used nonconsolidation to hide its debt.","translation":"その会社は負債を隠すために連結除外を利用した。"},{"sentence":"Nonconsolidation is permitted under certain circumstances, such as when control is temporary.","translation":"連結除外は、支配が一時的な場合など、特定の状況下で許可される。"}],"collocations":["apply nonconsolidation","permit nonconsolidation"],"synonyms":["separate accounting","standalone reporting"],"antonyms":["consolidation"]},{"part_of_speech":"noun","definition":"(法律)非統合、併合しないこと","english_definition":"The act of not combining or merging entities, assets, or liabilities.","examples":[{"sentence":"The court ruled against nonconsolidation of the assets.","translation":"裁判所は資産の非統合に対して判決を下した。"}],"collocations":["rule against nonconsolidation"],"synonyms":["separation","segregation"],"antonyms":["consolidation","merger"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'consolidation'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkənˌsɒlɪˈdeɪʃən/","syllables":"non-con-sol-i-da-tion"},"inflection":{"noun_plural":"nonconsolidations"},"usage_notes":{"explanation":"'Nonconsolidation' is primarily used in accounting and legal contexts. In accounting, it refers to the decision not to combine the financial statements of a parent company and its subsidiary. This can occur for various reasons, such as the parent company not having full control over the subsidiary, or regulatory requirements. In a legal context, it can refer to the separation of assets or liabilities in bankruptcy proceedings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-consolidation of the company helped increase profits.","correct":"✓ The nonconsolidation of the subsidiary helped increase reported profits.","note":"Nonconsolidation itself doesn't directly increase profits, but it can affect how profits are reported. Be specific about what is being nonconsolidated. "},{"incorrect":"✗ Non-consolidation is always illegal.","correct":"✓ Nonconsolidation is permitted under specific accounting standards and legal situations.","note":"Nonconsolidation is not inherently illegal, but it must be justified and comply with accounting standards and legal requirements."}],"priority":"★★☆"},"related_words":{"derivatives":["nonconsolidated (adjective)"],"related_terms":["consolidation","subsidiary","parent company","financial statements","bankruptcy","assets","liabilities"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Nonconsolidation' is a specialized term primarily encountered in accounting and legal fields. Understanding its meaning requires familiarity with concepts like parent companies, subsidiaries, and financial statements. In accounting, it refers to the practice of not combining the financial results of a subsidiary with those of the parent company. In legal contexts, it can relate to the separation of assets or liabilities, often in bankruptcy proceedings. The term is relatively infrequent in general usage."},"example_sentences":[{"sentence":"The company justified its use of **nonconsolidation** based on the subsidiary's limited operational integration.","translation":"その会社は、子会社の運営統合が限定的であることを理由に、連結除外の利用を正当化した。","type":"noun","meaning_category":"Accounting"},{"sentence":"The court considered the arguments for and against **nonconsolidation** of the debtor's assets.","translation":"裁判所は、債務者の資産の非統合に対する賛成意見と反対意見を検討した。","type":"noun","meaning_category":"Legal"}]}