{"word":"aviculturist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥類飼育家、鳥類学者","english_definition":"A person who keeps and breeds birds; a person who studies birds.","examples":[{"sentence":"The aviculturist carefully monitored the health of the exotic birds.","translation":"その鳥類飼育家は、珍しい鳥たちの健康状態を注意深く観察した。"},{"sentence":"As an aviculturist, she dedicated her life to the conservation of endangered bird species.","translation":"鳥類飼育家として、彼女は絶滅危惧種の鳥類の保護に生涯を捧げた。"}],"collocations":["private aviculturist","professional aviculturist","renowned aviculturist","experienced aviculturist"],"synonyms":["ornithologist","bird breeder","bird keeper"],"antonyms":[]}],"etymology":{"value":"The word \"aviculturist\" is derived from the Latin words \"avis\" (bird) and \"cultura\" (cultivation, care).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪ.viˈkʌl.tʃər.ɪst/","syllables":"a-vi-cul-tur-ist"},"inflection":{"noun_plural":"aviculturists"},"usage_notes":{"explanation":"An \"aviculturist\" is someone involved in aviculture, the practice of keeping and breeding birds, especially wild birds, in captivity. While the terms \"aviculturist\" and \"ornithologist\" are sometimes used interchangeably, an ornithologist is more specifically a scientist who studies birds in their natural habitats, whereas an aviculturist may focus on the care and breeding of birds in a controlled environment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an aviculture.","correct":"✓ She is an aviculturist.","note":"\"Aviculture\" is the practice itself, while \"aviculturist\" is the person who practices it."}],"priority":"★★☆"},"related_words":{"derivatives":["aviculture"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"aviculturist\" is a specialized term referring to someone who practices aviculture, the keeping and breeding of birds, especially wild birds, in captivity. It is a relatively uncommon word, mainly used in contexts related to ornithology, zoology, and conservation. Understanding the word requires familiarity with the concept of aviculture and the distinction between keeping birds in captivity and studying them in the wild (ornithology)."},"example_sentences":[{"sentence":"The zoo hired a new **aviculturist** to manage the bird exhibit.","translation":"動物園は鳥類の展示を管理するために新しい鳥類飼育家を雇った。","type":"noun","meaning_category":"鳥類飼育家"},{"sentence":"As a dedicated **aviculturist**, he built a large aviary in his backyard.","translation":"熱心な鳥類飼育家として、彼は裏庭に大きな鳥小屋を建てた。","type":"noun","meaning_category":"鳥類飼育家"}]}