{"word":"rampancy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(制御不能な)蔓延、猖獗(しょうけつ)、横行、激しさ、手に負えなさ","english_definition":"The state or quality of being rampant; unrestrained or excessive growth, spread, or behavior.","examples":[{"sentence":"The rampancy of corruption in the government was a major concern.","translation":"政府における汚職の蔓延は大きな懸念事項だった。"},{"sentence":"We need to address the rampancy of misinformation online.","translation":"オンラインにおける誤情報の横行に対処する必要がある。"},{"sentence":"The rampancy of the disease threatened to overwhelm the healthcare system.","translation":"その病気の猖獗は医療システムを圧迫する恐れがあった。"},{"sentence":"The rampancy of his anger surprised everyone.","translation":"彼の怒りの激しさは皆を驚かせた。"}],"collocations":["rampancy of crime","rampancy of disease","rampancy of corruption","rampancy of violence","rampancy of rumors","rampancy of speculation"],"synonyms":["unrestraint","excess","outbreak","proliferation","epidemic","fury","intensity","unruliness"],"antonyms":["control","restraint","suppression","containment","moderation","subduedness","orderliness"]}],"etymology":{"value":"Derived from the word 'rampant,' with the suffix '-cy' added to form a noun indicating a state or condition. 'Rampant' comes from Old French 'rampant,' meaning 'rearing up, climbing,' which in turn comes from the verb 'ramper,' meaning 'to climb, creep.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræmpənsi/","syllables":"ram-pan-cy"},"inflection":{"noun_plural":"rampancies (rarely used)"},"usage_notes":{"explanation":"'Rampancy' describes a situation where something negative or undesirable is spreading or growing uncontrollably and excessively. It often refers to abstract concepts like corruption, disease, or rumors, but can also describe intense emotions or behaviors. The term implies a lack of control and a need for intervention. It is a more formal and less common word than 'rampant' itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The rampancy of the building was impressive.","correct":"The size of the building was impressive. / The building's design was impressive.","note":"'Rampancy' is typically used for negative or undesirable phenomena that are spreading uncontrollably, not for physical objects or positive attributes. Use other words to describe the building's size or design."},{"incorrect":"The rampancy of happiness filled the room.","correct":"The joy filled the room. / The happiness in the room was palpable.","note":"'Rampancy' is generally not used with positive emotions or states. Use other words like 'joy,' 'happiness,' or 'excitement' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["rampant (adjective)","rampantly (adverb)"],"phrases":["run rampant"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Rare, used in formal or academic contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rampancy' is a relatively uncommon word that describes a state of being unrestrained or excessive, typically in a negative context. It's often used to describe the uncontrolled spread of something undesirable, such as corruption or disease. Because it's a more formal term, it's most likely to appear in academic or professional writing. Understanding the root word 'rampant' (meaning widespread or uncontrolled) can help in understanding the meaning of 'rampancy.'"},"example_sentences":[{"sentence":"The rampancy of fake news online has become a serious problem.","translation":"オンラインにおけるフェイクニュースの蔓延は深刻な問題となっている。","type":"noun","meaning_category":"蔓延・横行"},{"sentence":"The government is struggling to contain the rampancy of the epidemic.","translation":"政府はその伝染病の猖獗を封じ込めるのに苦労している。","type":"noun","meaning_category":"猖獗"},{"sentence":"The rampancy of his jealousy destroyed their relationship.","translation":"彼の嫉妬の激しさが彼らの関係を壊した。","type":"noun","meaning_category":"激しさ"}]}