{"word":"phylacobiosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 他のアリの巣に住むアリの習性。特に、宿主のアリが積極的に世話をしたり、保護したりするような関係。","english_definition":"(biology) The habit of ants living in the nests of other ants, especially in a relationship where the host ants actively care for or protect the guest ants.","examples":[{"sentence":"Phylacobiosis is a fascinating example of interspecies interaction within ant colonies.","translation":"好蟻性（phylacobiosis）は、アリのコロニー内における種間相互作用の魅力的な例である。"},{"sentence":"The phylacobiosis observed between these two ant species suggests a complex evolutionary history.","translation":"これら2種のアリの間で観察される好蟻性（phylacobiosis）は、複雑な進化の歴史を示唆している。"}],"collocations":["observe phylacobiosis (好蟻性を観察する)","study phylacobiosis (好蟻性を研究する)","example of phylacobiosis (好蟻性の例)","ant phylacobiosis (アリの好蟻性)"],"synonyms":["myrmecophily","social parasitism (in some cases)"],"antonyms":["independent nesting","antagonistic behavior"],"notes":"Phylacobiosis is a specific type of myrmecophily where the guest ant benefits from the host ant's care. It is distinct from other forms of myrmecophily where the relationship may be parasitic or neutral."}],"etymology":{"value":"Derived from Greek: 'phylax' (guard, protector) + 'bios' (life) + '-osis' (condition, state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪləkoʊbaɪˈoʊsɪs/","syllables":"phy-la-co-bi-o-sis"},"inflection":{"noun_plural":"phylacobioses"},"usage_notes":{"explanation":"Phylacobiosis refers to a specific type of symbiotic relationship between ant species. It's important to distinguish it from general myrmecophily, which encompasses a broader range of interactions between ants and other organisms. In phylacobiosis, the guest ant receives active care and protection from the host ant, suggesting a mutually beneficial or at least a commensal relationship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ant exhibits myrmecophily, therefore it is phylacobiosis.","correct":"✓ The ant exhibits myrmecophily, and if the host ant actively cares for it, it could be considered phylacobiosis.","note":"Myrmecophily is a broader term. Phylacobiosis requires specific care from the host. Not all myrmecophilous relationships are phylacobiotic."}],"priority":"★★☆"},"related_words":{"derivatives":["phylacobiotic (adjective)"],"related_terms":["myrmecophily","myrmecophile","social parasitism","symbiosis","commensalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Very low frequency - specialized term used in myrmecology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phylacobiosis' is a highly specialized term in myrmecology (the study of ants). It describes a specific type of interspecies relationship where one ant species lives in the nest of another and receives active care or protection. Understanding this term requires familiarity with biological concepts like symbiosis, commensalism, and parasitism, as well as a basic knowledge of ant behavior and ecology. It is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers documented a rare case of phylacobiosis between a Camponotus species and a smaller Pheidole ant.","translation":"研究者たちは、オオアリ属の一種と小型のトゲアリの間における稀な好蟻性の事例を記録した。","type":"scientific observation","meaning_category":"interspecies interaction"},{"sentence":"Phylacobiosis can provide the guest ant with increased protection from predators and access to resources within the host colony.","translation":"好蟻性は、客のアリに捕食者からの保護の強化と、宿主コロニー内の資源へのアクセスを提供する可能性がある。","type":"ecological benefit","meaning_category":"symbiotic relationship"}]}