{"word":"angiosporous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"被子植物の、被子植物に属する","english_definition":"Relating to or belonging to the angiosperms (flowering plants), which have seeds enclosed within an ovary.","examples":[{"sentence":"Angiosporous plants are the most diverse group of land plants.","translation":"被子植物は陸上植物の中で最も多様なグループです。"},{"sentence":"The angiosporous life cycle involves double fertilization.","translation":"被子植物の生活環は重複受精を含みます。"}],"collocations":["angiosporous plant","angiosporous life cycle","angiosporous seed"],"synonyms":["flowering","flowering plant","angiospermous"],"antonyms":["gymnospermous"]}],"etymology":{"value":"Derived from the Greek words 'angeion' (vessel, container) + 'spora' (seed) + '-ous' (having the nature of). This refers to the characteristic feature of angiosperms, which is having seeds enclosed in an ovary (a 'vessel').","priority":"★★☆"},"pronunciation":{"ipa":"ˌændʒioʊˈspɔːrəs","syllables":"an-gi-o-spo-rous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'angiosporous' is primarily used in botanical contexts to describe plants that belong to the angiosperm group. Angiosperms are characterized by having flowers and producing seeds enclosed within a fruit. This contrasts with gymnosperms, which have 'naked' seeds not enclosed in an ovary. The term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree is angiosperm.","correct":"✓ The tree is an angiosperm. / ✓ The tree is angiosporous.","note":"'Angiosperm' is a noun, so it needs an article ('an'). 'Angiosporous' is an adjective and can be used to describe the tree directly."}],"priority":"★★☆"},"related_words":{"derivatives":["angiosperm (noun: a plant that has flowers and produces seeds enclosed within a carpel)","angiospermae (noun: the taxonomic group containing the angiosperms)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'angiosporous' is a technical term used in botany to describe plants that are flowering plants and have seeds enclosed in an ovary. It's not a word you would typically encounter outside of scientific or educational contexts related to plant biology. Understanding this word requires knowledge of basic botanical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The angiosporous plants dominate most terrestrial ecosystems today.","translation":"今日、被子植物はほとんどの陸上生態系で優勢です。","type":"general","meaning_category":"general"},{"sentence":"The evolution of angiosporous flowers has led to complex pollination strategies.","translation":"被子植物の花の進化は、複雑な受粉戦略につながりました。","type":"evolution","meaning_category":"evolution"}]}