{"word":"attrister","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who exhibits attristation; one who shows sorrow for sin motivated by fear of punishment rather than love of God.","english_definition":"A person who exhibits attristation; one who shows sorrow for sin motivated by fear of punishment rather than love of God.","examples":[{"sentence":"The preacher warned against becoming a mere attrister, urging the congregation to seek genuine contrition.","translation":"牧師は、単なるアトリスターになることを戒め、会衆に真の悔恨を求めるよう促した。"}],"collocations":[],"synonyms":["attritionist"],"antonyms":["contrite person","penitent"],"notes":"The term is primarily used in theological contexts. It is relatively rare. It is related to the theological concept of 'attrition', which is imperfect contrition."}],"etymology":{"value":"Derived from 'attrition' (imperfect contrition) + '-ist' (a person who does or believes something).","priority":"N/A"},"pronunciation":{"ipa":"/əˈtrɪstər/","syllables":"at-tris-ter"},"inflection":{"noun_plural":"attristers"},"usage_notes":{"explanation":"The word 'attrister' is not commonly used. It is mainly found in theological or philosophical discussions about sin, repentance, and divine love. It describes someone who regrets their sins because they are afraid of the consequences, not because they genuinely feel sorry for offending God or doing wrong.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["attrition","attritionist"],"related_terms":["contrition","contrite","penitence"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"This word is highly specialized and rarely encountered outside of theological or philosophical discussions. Understanding requires familiarity with concepts of sin, repentance, and the distinction between perfect and imperfect contrition."},"example_sentences":[{"sentence":"The confessor could discern that the sinner was more of an attrister than a truly contrite soul.","translation":"告解司祭は、罪人が真に悔恨している魂というよりは、むしろアトリスターであることを見抜くことができた。","type":"theological","meaning_category":"person showing sorrow for sin due to fear of punishment"}]}