{"word":"Congroid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(廃語)黒人種に属する人","english_definition":"(obsolete) A member of the Congoid race.","examples":[{"sentence":"The term Congroid is now considered an outdated and offensive way to describe people of African descent.","translation":"「Congroid」という用語は現在、アフリカ系の人々を表現する時代遅れで侮辱的な方法と見なされています。"}],"synonyms":["Negroid (outdated)"],"antonyms":[],"notes":"This term is considered outdated and offensive. It is strongly advised not to use this term."}],"etymology":{"value":"Formed from Congo + -oid.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈkɒŋɡrɔɪd","syllables":"Cong-roid"},"inflection":{},"usage_notes":{"explanation":"The term 'Congroid' is an outdated and offensive term used to classify people of African descent. It is based on now-discredited racial theories and is considered highly inappropriate and insensitive. Modern anthropological and genetic research has demonstrated the complexity and fluidity of human populations, rendering such rigid classifications obsolete and harmful.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency. This term is rarely used and should be avoided.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Congroid' is an outdated and offensive term that was historically used in racial classifications. It is strongly advised not to use this term, as it is considered derogatory and reflects outdated and harmful racial theories. Modern discourse avoids such classifications in favor of more accurate and respectful terminology.","priority":"★★★"},"example_sentences":[{"sentence":"(Historical context only) In older anthropological texts, the term 'Congroid' was sometimes used to refer to people of African descent.","translation":"（歴史的な文脈でのみ）古い人類学のテキストでは、「Congroid」という用語がアフリカ系の人々を指すために使用されることがありました。","type":"historical","meaning_category":"Outdated racial classification"}]}