{"word":"Allotransplantation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同種移植、異人移植","english_definition":"The transplantation of cells, tissues, or organs from one individual to another of the same species but with a different genetic makeup.","examples":[{"sentence":"Allotransplantation is a common procedure for kidney and liver transplants.","translation":"同種移植は、腎臓や肝臓の移植によく行われる処置です。"},{"sentence":"The success of allotransplantation depends on immunosuppressive therapy to prevent rejection.","translation":"同種移植の成功は、拒絶反応を防ぐための免疫抑制療法に依存します。"}],"collocations":["kidney allotransplantation (腎臓同種移植)","liver allotransplantation (肝臓同種移植)","heart allotransplantation (心臓同種移植)","lung allotransplantation (肺同種移植)"],"synonyms":["homotransplantation","allograft"],"antonyms":["autotransplantation","xenotransplantation"]}],"etymology":{"value":"'Allo-' (ギリシャ語で「異なる」を意味する allos から) + 'transplantation' (移植)。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæloʊtrænsplɑːnˈteɪʃən/","syllables":"al-lo-trans-plan-ta-tion"},"inflection":{"noun_plural":"allotransplantations"},"usage_notes":{"explanation":"Allotransplantation is a type of transplantation where the donor and recipient are of the same species, but are genetically different. This contrasts with autotransplantation (where the donor and recipient are the same individual) and xenotransplantation (where the donor and recipient are of different species). Because of the genetic differences, the recipient's immune system is likely to recognize the transplanted tissue or organ as foreign and mount an immune response against it, leading to rejection. Therefore, allotransplantation typically requires the recipient to take immunosuppressive drugs to prevent rejection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The allotransplantation was autologous.","correct":"✓ The allotransplantation was allogeneic.","note":"Allotransplantation is, by definition, allogeneic (between genetically different individuals of the same species), not autologous (from the same individual)."},{"incorrect":"✗ Allotransplantation doesn't require immunosuppression.","correct":"✓ Allotransplantation typically requires immunosuppression.","note":"Due to genetic differences, allotransplantation typically requires immunosuppression to prevent rejection."}],"priority":"★★☆"},"related_words":{"derivatives":["allograft (同種移植片)","allogeneic (同種異系の)"],"related_terms":["transplantation (移植)","immunosuppression (免疫抑制)","rejection (拒絶反応)","graft (移植片)","donor (ドナー、提供者)","recipient (レシピエント、受容者)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical term used in medicine.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Allotransplantation' refers to a medical procedure where cells, tissues, or organs are transplanted from one person to another within the same species, but who are not genetically identical. Because the recipient's body recognizes the transplant as foreign, they typically need to take medication to suppress their immune system and prevent rejection of the transplant. This is a complex topic often discussed in medical contexts."},"example_sentences":[{"sentence":"The patient underwent allotransplantation to receive a new kidney.","translation":"患者は新しい腎臓を受け取るために同種移植を受けた。","type":"noun","meaning_category":"medical procedure"},{"sentence":"Immunosuppressive drugs are crucial after allotransplantation to prevent rejection.","translation":"拒絶反応を防ぐために、同種移植後には免疫抑制剤が不可欠である。","type":"noun","meaning_category":"medical procedure"}]}