{"word":"Antagonisation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"敵対化、反感を買うこと、対立を引き起こすこと","english_definition":"The act of causing someone to become an enemy or opponent; the act of arousing hostility or opposition.","examples":[{"sentence":"His constant criticism led to the antagonisation of his colleagues.","translation":"彼の絶え間ない批判は、同僚たちの反感を買うことにつながった。"},{"sentence":"The company's policies resulted in the antagonisation of its customer base.","translation":"その会社の方針は、顧客基盤の敵対化という結果になった。"},{"sentence":"The politician's inflammatory rhetoric caused the antagonisation of minority groups.","translation":"その政治家の扇動的なレトリックは、少数派グループの敵対化を引き起こした。"}],"collocations":["cause antagonisation","lead to antagonisation","result in antagonisation","avoid antagonisation","prevent antagonisation"],"synonyms":["alienation","estrangement","hostility","opposition","provocation","irritation","resentment"],"antonyms":["appeasement","conciliation","friendship","harmony","peace","agreement"]}],"etymology":{"value":"The word 'antagonisation' is derived from the verb 'antagonise' (or 'antagonize' in American English), which comes from the Greek word 'antagonizesthai', meaning 'to struggle against'. This is further composed of 'anti-' (against) and 'agonizesthai' (to contend for a prize), derived from 'agon' (contest, struggle). The suffix '-ation' is added to form the noun, indicating the process or result of antagonizing.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˌtæɡənaɪˈzeɪʃən/","syllables":"an-tag-o-ni-sa-tion"},"inflection":{"noun_plural":"Antagonisations"},"usage_notes":{"explanation":"'Antagonisation' refers to the process or result of making someone hostile or unfriendly. It emphasizes the action of creating an adversarial relationship. It is often used in contexts where someone's actions or policies lead to widespread opposition or resentment. The verb form, 'antagonise,' is more commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antagonisation was very antagonising.","correct":"✓ The situation was very antagonising. / ✓ The antagonisation caused a lot of problems.","note":"'Antagonisation' is a noun referring to the process or result, while 'antagonising' is an adjective describing something that causes antagonism. Using both in the same sentence can be redundant or grammatically awkward."},{"incorrect":"✗ He was antagonisation by her comments.","correct":"✓ He was antagonised by her comments.","note":"'Antagonisation' is a noun, not a verb. The correct verb form is 'antagonise' (or 'antagonize'). The passive form is 'was antagonised'."}],"priority":"★☆☆"},"related_words":{"derivatives":["antagonise (verb)","antagonize (verb - American English)","antagonistic (adjective)","antagonist (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antagonisation' is a relatively uncommon and complex word. It is typically used in formal or academic contexts to describe the process or result of causing someone to become hostile or unfriendly. Understanding the root verb 'antagonise' and the suffix '-ation' can help in comprehending its meaning. It is important to distinguish it from the adjective 'antagonistic' and the noun 'antagonist'."},"example_sentences":[{"sentence":"The government's new tax policies led to the widespread antagonisation of small business owners.","translation":"政府の新しい税制は、中小企業経営者の広範な敵対化につながった。","type":"noun","meaning_category":"敵対化を引き起こすこと"},{"sentence":"The speaker's controversial remarks resulted in the immediate antagonisation of a large portion of the audience.","translation":"講演者の物議を醸す発言は、聴衆の大部分の即座の敵対化という結果になった。","type":"noun","meaning_category":"反感を買うこと"},{"sentence":"Efforts to prevent the antagonisation of local communities are crucial for the success of the project.","translation":"地域社会の敵対化を防ぐための努力は、プロジェクトの成功にとって非常に重要である。","type":"noun","meaning_category":"対立を引き起こすこと"}]}