{"word":"self-contradictorily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"自己矛盾的に、自家撞着的に","english_definition":"In a manner that involves or expresses a contradiction of oneself or itself.","examples":[{"sentence":"He argued self-contradictorily, claiming both that he was innocent and that he had acted in self-defense.","translation":"彼は自己矛盾的に主張し、無罪であると同時に正当防衛だったと主張した。"},{"sentence":"The policy was implemented self-contradictorily, with different departments enforcing different aspects in conflicting ways.","translation":"その政策は自己矛盾的に実施され、異なる部門が異なる側面を矛盾する方法で施行した。"},{"sentence":"The novel's protagonist behaved self-contradictorily, making it difficult for the reader to understand his true motivations.","translation":"その小説の主人公は自己矛盾的に振る舞い、読者が彼の本当の動機を理解することを困難にした。"}],"collocations":["argue self-contradictorily","behave self-contradictorily","act self-contradictorily","speak self-contradictorily","write self-contradictorily"],"synonyms":["inconsistently","paradoxically","illogically","ambivalently","equivocally"],"antonyms":["consistently","logically","coherently","unambiguously"]}],"etymology":{"value":"Derived from \"self-contradictory\" (adjective) by adding the suffix \"-ly\" to form an adverb. \"Self-contradictory\" is formed from \"self-\" + \"contradictory\", where \"contradictory\" comes from the verb \"contradict\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˌkɒntrəˈdɪktərɪli/","syllables":"self-con-tra-dic-to-ri-ly (7 syllables)"},"inflection":{"notes":"Adverbs do not typically inflect. This word has no comparative or superlative forms."},"usage_notes":{"explanation":"\"Self-contradictorily\" describes actions, statements, or behaviors that contain internal contradictions or inconsistencies. It indicates that someone or something is expressing or behaving in a way that conflicts with itself. It is often used to criticize or point out flaws in reasoning or actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He self-contradictory argued.","correct":"✓ He argued self-contradictorily.","note":"The adverb \"self-contradictorily\" should typically follow the verb it modifies."},{"incorrect":"✗ The statement was self-contradictorily. It made no sense.","correct":"✓ The statement was self-contradictory. It made no sense.","note":"\"Self-contradictory\" is the adjective form, used to describe the statement itself. \"Self-contradictorily\" describes how someone argues or acts."}],"priority":"★★☆"},"related_words":{"derivatives":["self-contradictory (adjective)","self-contradiction (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"self-contradictorily\" is an advanced term used to describe actions or statements that contain an internal contradiction. It is formed by adding the suffix \"-ly\" to the adjective \"self-contradictory\". Understanding the meaning of \"self-contradictory\" is essential to grasping the meaning of the adverb. It is used in formal contexts and academic writing to critique arguments or behaviors that are inconsistent or illogical."},"example_sentences":[{"sentence":"The witness testified self-contradictorily, making his account unreliable.","translation":"証人は自己矛盾的に証言し、彼の説明を信頼できないものにした。","type":"adverb","meaning_category":"manner"},{"sentence":"The company's marketing campaign was implemented self-contradictorily, confusing consumers.","translation":"その会社のマーケティングキャンペーンは自己矛盾的に実施され、消費者を混乱させた。","type":"adverb","meaning_category":"manner"},{"sentence":"The politician spoke self-contradictorily on the issue, leaving voters unsure of his stance.","translation":"その政治家はその問題について自己矛盾的に話し、有権者は彼の立場を確信できなくなった。","type":"adverb","meaning_category":"manner"}]}