{"word":"dehumaniser","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) 人間性を奪うもの、人間性を喪失させるもの、非人間化するもの","english_definition":"(chiefly British English) something that deprives people of their human qualities or treats them as if they are not human.","examples":[{"sentence":"The factory farming system is a dehumaniser.","translation":"工場式畜産システムは人間性を奪うものである。"},{"sentence":"Poverty can be a powerful dehumaniser.","translation":"貧困は強力な非人間化要因となりうる。"}],"collocations":["a powerful dehumaniser","a social dehumaniser"],"synonyms":["dehumanizer (American English)","degrading influence","alienating force"],"antonyms":["humaniser","humanizing influence"]}],"etymology":{"value":"dehumanise + -er (agent noun suffix)","priority":"☆☆☆"},"pronunciation":{"ipa":"/diːˈhjuːmənaɪzə(r)/","syllables":"de-hu-man-i-ser"},"inflection":{"noun_plural":"dehumanisers"},"usage_notes":{"explanation":"'Dehumaniser' (British English spelling) refers to something that strips away a person's humanity, treating them as less than human or depriving them of their individuality, dignity, or compassion. It often refers to systems, processes, or environments that lead to the degradation or alienation of individuals. The American English spelling is 'dehumanizer'.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The dehumaniser made me feel like a robot.","correct":"The dehumaniser made me feel like I was treated as a robot.","note":"The dehumaniser is the *thing* that causes the feeling, not the actor causing the feeling. The sentence should reflect that the dehumaniser caused the person to be *treated* like a robot."}],"priority":"☆☆☆"},"related_words":{"derivatives":["dehumanise (verb)","dehumanisation (noun)","dehumanizing (adjective)"],"related_concepts":["alienation","objectification","degradation","oppression","exploitation"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dehumaniser' refers to something that takes away a person's human qualities. This is a complex concept often used in discussions about social issues, ethics, and the impact of systems on individuals. It is not a commonly used word, and understanding it requires a good grasp of abstract concepts and social commentary."},"example_sentences":[{"sentence":"The long hours and repetitive tasks of the assembly line can be a dehumaniser.","translation":"組み立てラインでの長時間労働と反復作業は、人間性を奪うものとなりうる。","type":"noun","meaning_category":"something that deprives people of their human qualities"},{"sentence":"Bureaucracy, at its worst, can act as a dehumaniser, treating individuals as mere numbers.","translation":"最悪の場合、官僚主義は人間性を奪うものとして機能し、個人を単なる数字として扱う可能性がある。","type":"noun","meaning_category":"something that treats people as if they are not human"}]}