{"word":"Macmillanite","priority":"低","meanings":[{"part_of_speech":"noun","definition":"マクミラン派の人、マクミラン主義者","english_definition":"A follower of Macmillanism; an adherent to the political and economic policies associated with Harold Macmillan, a former British Prime Minister.","examples":[{"sentence":"The Macmillanites within the Conservative party advocated for a mixed economy and social welfare programs.","translation":"保守党内のマクミラン派は、混合経済と社会福祉プログラムを提唱した。"}],"collocations":["Macmillanite policies","Macmillanite ideology"],"synonyms":["Conservative (with social democratic tendencies)"],"antonyms":["Thatcherite","Libertarian"]},{"part_of_speech":"adjective","definition":"マクミラン派の、マクミラン主義の","english_definition":"Relating to or characteristic of Macmillanism, the political and economic policies associated with Harold Macmillan.","examples":[{"sentence":"The government's Macmillanite approach to economic management involved a degree of state intervention.","translation":"政府のマクミラン派的な経済運営へのアプローチは、ある程度の国家介入を伴った。"}],"collocations":["Macmillanite economic policy","Macmillanite social views"],"synonyms":["Socially conservative","One-nation conservative"],"antonyms":["Neoliberal","Free-market oriented"]}],"etymology":{"value":"Derived from the name of Harold Macmillan, a British Conservative Prime Minister (1957-1963), combined with the suffix \"-ite\" indicating a follower or adherent.","priority":"中"},"pronunciation":{"ipa":"/mækˈmɪlənˌaɪt/","syllables":"Mac-mil-lan-ite"},"inflection":{"noun_plural":"Macmillanites"},"usage_notes":{"explanation":"The term \"Macmillanite\" refers to individuals or policies associated with Harold Macmillan, a British Prime Minister known for his pragmatic and moderate approach to Conservatism. Macmillanism typically involves support for a mixed economy, social welfare programs, and a degree of state intervention in the economy. It is often contrasted with more radical free-market ideologies.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He described himself as a Macmillan.","correct":"✓ He described himself as a Macmillanite.","note":"The suffix \"-ite\" is essential to denote a follower or adherent of Macmillanism."}],"priority":"低"},"related_words":{"derivatives":["Macmillanism"],"phrases":["One-nation conservatism"],"related_figures":["Harold Macmillan"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"The word \"Macmillanite\" is a specialized term related to British political history and ideology. It refers to someone who supports the political and economic views of Harold Macmillan, a former British Prime Minister. Understanding the term requires knowledge of British political history and the specific policies associated with Macmillan's government."},"example_sentences":[{"sentence":"As a Macmillanite, he believed in a strong social safety net.","translation":"マクミラン派として、彼は強力な社会保障制度を信じていた。","type":"noun","meaning_category":"Follower of Macmillanism"},{"sentence":"The party's Macmillanite wing still held considerable influence.","translation":"党のマクミラン派は依然としてかなりの影響力を持っていた。","type":"adjective","meaning_category":"Relating to Macmillanism"}]}