{"word":"unpurported","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"主張されていない、自称されていない","english_definition":"Not claimed or professed; not presented as being what it is not.","examples":[{"sentence":"The unpurported benefits of this product are numerous.","translation":"この製品の主張されていない利点は数多くあります。"},{"sentence":"He made an unpurported observation about the situation.","translation":"彼はその状況について、自称しない見解を述べた。"}],"collocations":["unpurported benefits","unpurported observation"],"synonyms":["unclaimed","unprofessed","unasserted","unostentatious"],"antonyms":["purported","claimed","professed","asserted"]}],"etymology":{"value":"\"un-\" (not) + \"purported\" (claimed, professed). Derived from \"purport,\" meaning to claim or profess outwardly.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpərˈpɔːrtɪd/","syllables":"un-pur-port-ed"},"inflection":{"adjective_forms":{"comparative":"more unpurported","superlative":"most unpurported"}},"usage_notes":{"explanation":"\"Unpurported\" is used to describe something that is not explicitly claimed or presented as having certain qualities or benefits. It often implies a sense of understatement or a lack of pretension. It can also suggest that the qualities or benefits are inherent or self-evident, rather than being actively promoted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpurported murderer was caught.","correct":"✓ The alleged murderer was caught.","note":"\"Unpurported\" is not typically used to describe people, especially in legal contexts. \"Alleged\" is more appropriate to indicate that someone is accused but not yet proven guilty."},{"incorrect":"✗ The unpurported reason for his absence was illness.","correct":"✓ The stated reason for his absence was illness.","note":"If you mean the reason given was not the real reason, use 'unstated' or 'real'. If you mean the reason was given, use 'stated'."}],"priority":"★★☆"},"related_words":{"derivatives":["purport (verb, noun)","purportedly (adverb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unpurported\" is a relatively rare and sophisticated word. It means that something is not being explicitly claimed or presented as having certain qualities or benefits. It's often used in formal or academic contexts to describe something that is understated or whose qualities are self-evident. Understanding the word requires familiarity with its root, \"purport,\" and the negative prefix \"un-\"."},"example_sentences":[{"sentence":"The unpurported advantages of this method are its simplicity and low cost.","translation":"この方法の主張されていない利点は、その単純さと低コストです。","type":"adjective","meaning_category":"特徴"},{"sentence":"He offered an unpurported apology, simply stating his regret.","translation":"彼は、ただ後悔の念を述べるだけで、自称しない謝罪をした。","type":"adjective","meaning_category":"行動"}]}