{"word":"quintiles","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"五分位、五分位点","english_definition":"Values that divide a data set into five equal parts.","examples":[{"sentence":"The population was divided into quintiles based on income.","translation":"その母集団は収入に基づいて五分位に分けられた。"},{"sentence":"We analyzed the data by comparing the highest and lowest quintiles.","translation":"我々は最高と最低の五分位を比較することによってデータを分析した。"}],"collocations":["income quintiles (所得五分位)","quintile analysis (五分位分析)","highest quintile (最高五分位)","lowest quintile (最低五分位)"],"synonyms":["percentiles","quartiles","deciles"],"antonyms":[]}],"etymology":{"value":"The word \"quintile\" comes from the Latin word \"quintus,\" meaning \"fifth.\" It is formed by analogy with \"quartile\" and \"percentile.\"","priority":"★★★"},"pronunciation":{"ipa":"ˈkwɪnˌtaɪlz","syllables":"quin-tiles"},"inflection":{"noun_plural":"quintiles"},"usage_notes":{"explanation":"Quintiles are used in statistics to divide a distribution into five equal parts. Each quintile represents 20% of the data. Quintile analysis is often used to examine income distribution, wealth distribution, or other socioeconomic indicators. The quintiles are determined by the four quintile points, which are the data values that mark the boundaries between the quintiles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The quintile is a number.","correct":"✓ A quintile is a range of numbers.","note":"A quintile represents a range of values, not a single number. The quintile point is a number."}],"priority":"★★☆"},"related_words":{"derivatives":["quintile (noun singular)"],"phrasal_verbs":[],"related_terms":["percentile","quartile","decile","median"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quintiles' are statistical values that split a dataset into five equal parts, each containing 20% of the data. They're used to analyze distributions, like income or test scores, by comparing different groups. For example, comparing the highest and lowest income quintiles can show income inequality. It's a tool for understanding how data is spread across a population."},"example_sentences":[{"sentence":"The study examined health outcomes across different income quintiles.","translation":"その研究では、さまざまな所得五分位における健康状態を調査した。","type":"noun","meaning_category":"statistics"},{"sentence":"Students in the top quintile of test scores received scholarships.","translation":"テストの点数が上位五分位に入った学生は奨学金を受け取った。","type":"noun","meaning_category":"statistics"}]}