{"word":"snailery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A place where snails are raised, farmed, or kept.","english_definition":"A place or establishment for raising or keeping snails, especially for culinary purposes.","examples":[{"sentence":"The snailery was a small, enclosed garden where the snails could thrive.","translation":"そのスネイルリーは、カタツムリが育つことができる小さな囲まれた庭でした。"},{"sentence":"He visited a local snailery to learn about the process of snail farming.","translation":"彼はカタツムリ養殖の過程を学ぶために地元のスネイルリーを訪れました。"},{"sentence":"The restaurant sources its escargots from a nearby snailery.","translation":"そのレストランは、近くのスネイルリーからエスカルゴを仕入れています。"}],"collocations":["establish a snailery","visit a snailery","operate a snailery","small snailery","commercial snailery"],"synonyms":["snail farm","heliciculture farm"],"antonyms":[]},{"part_of_speech":"noun","definition":"A collection of snails.","english_definition":"A collection or group of snails.","examples":[{"sentence":"The child's snailery consisted of snails collected from the garden.","translation":"子供のスネイルリーは、庭から集められたカタツムリで構成されていました。"},{"sentence":"She kept a small snailery in a terrarium.","translation":"彼女はテラリウムの中で小さなスネイルリーを飼っていました。"}],"collocations":["small snailery","private snailery"],"synonyms":["collection of snails","group of snails"],"antonyms":[]}],"etymology":{"value":"Derived from 'snail' + '-ery' (a suffix denoting a place or collection).","priority":"★★☆"},"pronunciation":{"ipa":"ˈsneɪləri","syllables":"snail-er-y"},"inflection":{"noun_plural":"snaileries"},"usage_notes":{"explanation":"The term 'snailery' is relatively uncommon, but it is used to describe either a place where snails are raised or a collection of snails. It is most often encountered in contexts related to snail farming or culinary uses of snails.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He works in a snailery, so he loves all animals.","correct":"✓ He works in a snailery, so he knows a lot about snails.","note":"Working in a snailery implies knowledge about snails specifically, not necessarily a general love for all animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["snail","heliciculture"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'snailery' is a niche term, primarily used in contexts related to snail farming or the keeping of snails. It is not a commonly used word, so familiarity with it suggests a specialized knowledge of the subject matter."},"example_sentences":[{"sentence":"The entrepreneur decided to invest in a snailery to meet the growing demand for escargots.","translation":"その起業家は、エスカルゴの需要の高まりに応えるために、スネイルリーに投資することを決めた。","type":"noun","meaning_category":"place for raising snails"},{"sentence":"Her small snailery was a source of fascination for the neighborhood children.","translation":"彼女の小さなスネイルリーは、近所の子供たちの興味の源だった。","type":"noun","meaning_category":"collection of snails"}]}