{"word":"servitorship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"奉仕者の地位、使用人としての身分、奉仕の義務","english_definition":"The state or condition of being a servitor; the duties or obligations of a servitor.","examples":[{"sentence":"He held a servitorship in the royal household.","translation":"彼は王室の使用人としての地位にあった。"},{"sentence":"The servitorship required him to attend to the king's every need.","translation":"その奉仕の義務は、彼に王のあらゆるニーズに応えることを要求した。"}],"collocations":["hold a servitorship","perform servitorship duties"],"synonyms":["service","vassalage","bondage","subservience"],"antonyms":["mastery","leadership","independence"]}],"etymology":{"value":"Derived from 'servitor' (one who serves) + '-ship' (a suffix denoting a state, condition, or office).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɜːrvɪtərʃɪp/","syllables":"ser-vi-tor-ship"},"inflection":{"noun_plural":"servitorships"},"usage_notes":{"explanation":"'Servitorship' is a relatively uncommon word, primarily used in historical or formal contexts to describe the status or obligations of someone in service to another. It emphasizes the role and responsibilities associated with being a servitor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a great servitorship in the company.","correct":"✓ He had a great position in the company.","note":"'Servitorship' implies a formal, often historical, relationship of service. For modern employment, 'position' or 'role' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["servitor","servitude","service"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Servitorship' is a formal and rare term indicating the state or duties of a servitor, someone who serves another. It's not commonly used in modern English and is more likely to appear in historical or literary contexts. Understanding this word requires a strong vocabulary and familiarity with formal language."},"example_sentences":[{"sentence":"The young knight began his career in a humble servitorship, attending to the needs of his lord.","translation":"若い騎士は、領主の世話をするという謙虚な奉仕者の地位からキャリアを始めた。","type":"noun","meaning_category":"奉仕者の地位"},{"sentence":"The obligations of servitorship demanded unwavering loyalty and obedience.","translation":"奉仕の義務は、揺るぎない忠誠心と服従を要求した。","type":"noun","meaning_category":"奉仕の義務"},{"sentence":"His servitorship at the temple involved maintaining the sacred grounds and assisting the priests.","translation":"彼の寺院での奉仕は、神聖な場所の維持と司祭の補助を含んでいた。","type":"noun","meaning_category":"使用人としての身分"}]}