{"word":"tautonymy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同名異物（どうめいいぶつ）：生物学において、属名と種小名が同一である命名法。","english_definition":"(in biological nomenclature) the practice of naming a species with the same name for both the genus and the specific epithet.","examples":[{"sentence":"Tautonymy is permitted in zoological nomenclature but not in botanical nomenclature.","translation":"同名異物は動物命名法では認められているが、植物命名法では認められていない。"},{"sentence":"An example of tautonymy is the scientific name *Vulpes vulpes* for the red fox.","translation":"同名異物の例としては、アカギツネの学名である *Vulpes vulpes* が挙げられる。"}],"collocations":["permitted tautonymy","zoological tautonymy","botanical tautonymy"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"ギリシャ語の *tauto* (同じ) + *onym* (名前) から。","priority":"★★☆"},"pronunciation":{"ipa":"/tɔːˈtɒnɪmi/","syllables":"tau-ton-y-my"},"inflection":{"noun_plural":"tautonymies"},"usage_notes":{"explanation":"Tautonymy is a specific term used in the context of biological nomenclature. It refers to the situation where the genus name and the specific epithet (species name) are identical. This practice is allowed under the International Code of Zoological Nomenclature (ICZN) but is not permitted under the International Code of Nomenclature for algae, fungi, and plants (ICN).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant name *Rosa rosa* is an example of tautonymy.","correct":"✓ The animal name *Vulpes vulpes* is an example of tautonymy.","note":"Tautonymy is not allowed in botanical nomenclature, so plant names cannot be tautonyms."}],"priority":"★★☆"},"related_words":{"derivatives":["tautonymous (adjective)"],"related_terms":["nomenclature","binomial nomenclature","genus","species","epithet"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tautonymy' is a technical term used in biology to describe when a species' scientific name repeats the genus name in the species name. For example, if a fox was named 'Fox fox', that would be tautonymy. This is okay for animals but not for plants, fungi, or algae. It's a word you'll mostly see in scientific discussions about naming living things."},"example_sentences":[{"sentence":"The use of tautonymy simplifies the identification of certain animal species.","translation":"同名異物の使用は、特定の動物種の識別を簡素化する。","type":"general","meaning_category":"definition"},{"sentence":"Botanists avoid tautonymy when assigning scientific names to plants.","translation":"植物学者は植物に学名を付ける際に同名異物を避ける。","type":"contrast","meaning_category":"botany vs. zoology"}]}