{"word":"bottle-brush","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"哺乳瓶ブラシ、試験管ブラシ","english_definition":"A brush, typically cylindrical with bristles radiating from a central wire, used for cleaning bottles, test tubes, or other narrow containers.","examples":[{"sentence":"She used a bottle-brush to clean the baby's bottles.","translation":"彼女は哺乳瓶ブラシを使って赤ちゃんの哺乳瓶を洗った。"},{"sentence":"The lab assistant used a bottle-brush to scrub the test tubes.","translation":"実験助手は試験管ブラシを使って試験管をこすり洗いした。"}],"collocations":["clean with a bottle-brush","use a bottle-brush","bottle-brush cleaner"],"synonyms":["test tube brush","cleaning brush"],"antonyms":[]},{"part_of_speech":"noun","definition":"ブラシノキ（フトモモ科ブラシノキ属の植物の総称）","english_definition":"Any of several Australian shrubs or trees of the genus *Callistemon*, having dense spikes of showy flowers with prominent stamens resembling a bottle brush.","examples":[{"sentence":"The garden featured several bottle-brush trees in full bloom.","translation":"庭には満開のブラシノキが数本あった。"},{"sentence":"Bottle-brush flowers attract many birds and insects.","translation":"ブラシノキの花は多くの鳥や昆虫を引き寄せる。"}],"collocations":["bottle-brush tree","bottle-brush flower","red bottle-brush"],"synonyms":["Callistemon"],"antonyms":[]}],"etymology":{"value":"The term \"bottle-brush\" is derived from the resemblance of the object or plant to a brush used for cleaning bottles. The plant's flower spikes closely resemble the shape of a bottle brush.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒtəlˌbrʌʃ/","syllables":"bot-tle-brush"},"inflection":{"noun_plural":"bottle-brushes"},"usage_notes":{"explanation":"The term \"bottle-brush\" can refer to either a cleaning tool or a type of plant. Context usually makes it clear which meaning is intended. When referring to the plant, it is often written as \"bottle brush tree\" or \"bottle brush plant\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a bottle brush to clean my hair.","correct":"✓ I need a hairbrush to clean my hair.","note":"A bottle brush is for cleaning bottles, not hair. Use a hairbrush for hair. "},{"incorrect":"✗ The bottle-brush is very quiet.","correct":"✓ The bottle-brush is very useful.","note":"Bottle brushes are useful for cleaning, but they don't make noise, so 'quiet' is not a typical descriptor."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["brush","bottle","Callistemon","flower","tree","shrub"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"bottle-brush\" has two main meanings. One refers to a tool used for cleaning bottles, and the other refers to a type of plant with flowers that look like bottle brushes. The context usually makes it clear which meaning is intended. It's not a super common word, but it's useful to know if you're talking about cleaning supplies or Australian plants.","priority":"★★☆"},"example_sentences":[{"sentence":"She bought a new bottle-brush to clean the baby bottles.","translation":"彼女は哺乳瓶を洗うために新しい哺乳瓶ブラシを買った。","type":"noun","meaning_category":"cleaning tool"},{"sentence":"The bottle-brush tree in our garden attracts hummingbirds.","translation":"庭のブラシノキはハチドリを引き寄せる。","type":"noun","meaning_category":"plant"}]}