{"word":"Conventionalists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"慣習主義者、因習主義者","english_definition":"People who adhere to conventional practices and beliefs.","examples":[{"sentence":"The conventionalists in the group opposed any change to the established rules.","translation":"グループ内の慣習主義者たちは、確立された規則へのいかなる変更にも反対した。"},{"sentence":"Conventionalists often prioritize tradition over innovation.","translation":"慣習主義者は、革新よりも伝統を優先することが多い。"}],"collocations":["social conventionalists","political conventionalists","cultural conventionalists"],"synonyms":["traditionalists","conformists","conservatives"],"antonyms":["radicals","innovators","mavericks"]}],"etymology":{"value":"The term is derived from 'conventional,' referring to something based on or in accordance with what is generally done or believed. The suffix '-ist' denotes a person who adheres to or advocates a particular belief or practice.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈvɛnʃənəlɪsts/","syllables":"con-ven-tion-al-ists"},"inflection":{"noun_plural":"Conventionalists"},"usage_notes":{"explanation":"'Conventionalists' refers to individuals who strongly support and adhere to established norms, customs, and traditions. They tend to resist change and prefer the status quo. The term can be used in various contexts, including social, political, and cultural discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a conventionalist, so he likes to try new things.","correct":"✓ He is a conventionalist, so he prefers traditional methods.","note":"Conventionalists typically prefer established methods and traditions, not new things."}],"priority":"★★☆"},"related_words":{"derivatives":["conventional (adjective)","conventionality (noun)","convention (noun)"],"related_terms":["tradition","custom","norm","orthodoxy"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'conventionalists' describes people who strongly follow traditional ways of thinking and behaving. They usually don't like change and prefer things to stay the same. This word is often used in discussions about society, politics, or culture when talking about people who are more conservative or traditional in their views."},"example_sentences":[{"sentence":"The company's management team was largely composed of conventionalists who were hesitant to adopt new technologies.","translation":"その会社の経営陣は、新しい技術の導入に消極的な慣習主義者で大部分が構成されていた。","type":"general"},{"sentence":"In the art world, conventionalists often criticize avant-garde movements for straying too far from established techniques.","translation":"芸術の世界では、慣習主義者は、確立された技術から逸脱しすぎているとして、前衛的な運動を批判することが多い。","type":"general"}]}