{"word":"piloncillo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピロンシージョ：メキシコやラテンアメリカで使用される、精製されていないサトウキビから作られた円錐形の砂糖","english_definition":"Piloncillo is unrefined whole cane sugar, typical of Mexico and Latin America. It is often sold in the shape of a cone.","examples":[{"sentence":"Piloncillo is used to sweeten many traditional Mexican dishes and drinks.","translation":"ピロンシージョは、多くの伝統的なメキシコ料理や飲み物を甘くするために使用されます。"},{"sentence":"You can find piloncillo in most Latin American grocery stores.","translation":"ほとんどのラテンアメリカの食料品店でピロンシージョを見つけることができます。"}],"collocations":["make piloncillo syrup","use piloncillo in cooking","buy piloncillo cones"],"synonyms":["panela","chancaca","rapadura"],"antonyms":[]}],"etymology":{"value":"スペイン語の \"piloncillo\" は、\"pilon\"（円錐形の砂糖の塊）の指小辞。","priority":"★★☆"},"pronunciation":{"ipa":"/pi.lonˈsi.ʝo/","syllables":"pi-lon-ci-llo"},"inflection":{"noun_plural":"piloncillos"},"usage_notes":{"explanation":"Piloncillo is a type of unrefined sugar that retains more of the natural molasses, giving it a distinct flavor compared to refined white sugar. It's commonly used in traditional recipes and can add a unique depth of flavor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used white sugar instead of piloncillo, and it tasted the same.","correct":"✓ I used white sugar instead of piloncillo, but it didn't taste the same.","note":"Piloncillo has a unique flavor that white sugar cannot replicate."}],"priority":"★☆☆"},"related_words":{"derivatives":["melaza (molasses)","azúcar de caña (cane sugar)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 特定の地域や文化に関連する単語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Piloncillo is a specialized culinary term referring to unrefined cane sugar, primarily used in Mexican and Latin American cuisine. Understanding its usage requires familiarity with these culinary traditions. It's not a commonly encountered word outside of this context.","priority":"★☆☆"},"example_sentences":[{"sentence":"She added piloncillo to the atole to give it a rich, caramel-like flavor.","translation":"彼女はアトレにピロンシージョを加えて、濃厚なキャラメルのような風味を出しました。","type":"noun","meaning_category":"砂糖"},{"sentence":"The traditional mole sauce gets its sweetness from piloncillo.","translation":"伝統的なモレソースは、ピロンシージョから甘さを得ています。","type":"noun","meaning_category":"砂糖"}]}