{"word":"downstate","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"(特定の州で)州の南部へ、州の南部で","english_definition":"in or to the southern part of a state (used especially in Illinois and New York).","examples":[{"sentence":"We're going downstate for the weekend.","translation":"週末は州南部に旅行に行く予定です。"},{"sentence":"He moved downstate after retiring.","translation":"彼は退職後、州南部に引っ越しました。"}],"collocations":[],"synonyms":["southward","to the south of the state"],"antonyms":["upstate"]},{"part_of_speech":"adjective","definition":"(特定の州の)州南部の","english_definition":"located in the southern part of a state (used especially in Illinois and New York).","examples":[{"sentence":"The downstate region is primarily agricultural.","translation":"州南部地域は主に農業地帯です。"},{"sentence":"Downstate schools often have different funding priorities.","translation":"州南部の学校は、資金調達の優先順位が異なることが多いです。"}],"collocations":["downstate Illinois","downstate New York"],"synonyms":["southern"],"antonyms":["upstate"]},{"part_of_speech":"noun","definition":"(特定の州の)州南部","english_definition":"the southern part of a state (used especially in Illinois and New York).","examples":[{"sentence":"People from downstate tend to have a different accent.","translation":"州南部出身の人々は異なるアクセントを持っている傾向があります。"},{"sentence":"There's a lot of political tension between upstate and downstate.","translation":"州北部と州南部との間には多くの政治的緊張があります。"}],"collocations":[],"synonyms":["southern part of the state"],"antonyms":["upstate"]}],"etymology":{"value":"A compound word formed from \"down\" (indicating direction towards the south, often towards lower elevations or warmer climates) and \"state\" (referring to a specific state). The term likely originated as a convenient way to differentiate the southern region of a state from its northern counterpart, particularly in states like Illinois and New York where there are significant cultural, economic, and geographic differences between the two regions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaʊnˈsteɪt/","syllables":"down-state"},"inflection":{"notes":"As an adverb, adjective, and noun, 'downstate' does not typically inflect (change form)."},"usage_notes":{"explanation":"The term \"downstate\" is primarily used in the states of Illinois and New York to refer to the southern part of the state. It's important to note that this term is not universally used across all US states. In Illinois, it generally refers to the area south of the Chicago metropolitan area. In New York, it typically refers to the area south of the Catskill Mountains, including New York City and Long Island. The term often carries cultural and political connotations, as there can be significant differences between the northern and southern regions of these states.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to down state New York.","correct":"✓ I'm going downstate in New York. / ✓ I'm going to downstate New York.","note":"When used as an adverb of direction, it's more common to say \"going downstate in [state name]\". When used as an adjective, it's \"downstate [state name]\"."},{"incorrect":"✗ Downstate is a city.","correct":"✓ Downstate is a region.","note":"Downstate refers to a region, not a specific city."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (regional term)","frequency_google_ngram":"Relatively low frequency, primarily used in specific regional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"downstate\" is a regional term primarily used in Illinois and New York to refer to the southern part of the state. It's important to understand that this term is not used universally across the United States. When you hear someone use the term \"downstate,\" it's likely they are from or familiar with these specific states. The term can be used as an adverb (e.g., \"We're traveling downstate\"), an adjective (e.g., \"the downstate region\"), or a noun (e.g., \"People from downstate\")."},"example_sentences":[{"sentence":"Many people from Chicago vacation downstate during the summer.","translation":"シカゴの人々の多くは夏の間、州南部で休暇を過ごします。","type":"adverb","meaning_category":"州の南部へ"},{"sentence":"The downstate economy relies heavily on agriculture.","translation":"州南部の経済は農業に大きく依存しています。","type":"adjective","meaning_category":"州南部の"},{"sentence":"There's a strong cultural identity among those who live in downstate Illinois.","translation":"イリノイ州南部地域に住む人々の間には強い文化的アイデンティティがあります。","type":"noun","meaning_category":"州南部"}]}