{"word":"robotry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ロボット工学、ロボット技術","english_definition":"The art, science, or industry of designing, constructing, and using robots.","examples":[{"sentence":"He is studying robotry at the university.","translation":"彼は大学でロボット工学を学んでいます。"},{"sentence":"The future of manufacturing depends on advances in robotry.","translation":"製造業の未来は、ロボット工学の進歩にかかっています。"}],"collocations":["advanced robotry","industrial robotry","medical robotry","the field of robotry"],"synonyms":["robotics","automation","cybernetics"],"antonyms":[]}],"etymology":{"value":"\"Robotry\" is derived from \"robot\" + the suffix \"-ry,\" which is used to form nouns denoting an art, practice, or skill. The term \"robot\" itself comes from the Czech word \"robota,\" meaning forced labor or servitude, popularized by Karel Čapek's play R.U.R. (Rossum's Universal Robots).","priority":"★★☆"},"pronunciation":{"ipa":"ˈroʊbətri","syllables":"ro-bot-ry"},"inflection":{"noun_plural":"robotries (rarely used)"},"usage_notes":{"explanation":"\"Robotry\" is a less common term than \"robotics\" but essentially refers to the same field: the study, design, construction, and application of robots. While \"robotics\" is the more widely accepted and frequently used term in academic and professional contexts, \"robotry\" can be used interchangeably, though it might sound slightly more informal or archaic to some.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a robotry engineer.","correct":"✓ He is a robotics engineer.","note":"\"Robotics engineer\" is the more common and accepted term. While \"robotry engineer\" might be understood, it is not standard usage."},{"incorrect":"✗ The robotry are becoming more advanced.","correct":"✓ Robotics is becoming more advanced.","note":"\"Robotry\" and \"robotics\" are generally treated as singular nouns, referring to the field or discipline as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["robot (noun)","robotic (adjective)","robotics (noun)"],"phrases":["industrial robotry","surgical robotry","autonomous robotry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - \"robotics\"の方が一般的。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Robotry\" refers to the field of study and application related to robots, encompassing their design, construction, operation, and use. It is synonymous with the more commonly used term \"robotics.\" While \"robotics\" is the preferred term in technical and academic contexts, \"robotry\" can be used, though it may be perceived as slightly less formal. Understanding the term is useful for comprehending discussions about automation, artificial intelligence, and the future of technology.","priority":"★★☆"},"example_sentences":[{"sentence":"The university offers a comprehensive program in robotry.","translation":"その大学はロボット工学の包括的なプログラムを提供しています。","type":"noun","meaning_category":"ロボット工学"},{"sentence":"His research focuses on the ethical implications of advanced robotry.","translation":"彼の研究は、高度なロボット工学の倫理的影響に焦点を当てています。","type":"noun","meaning_category":"ロボット工学"},{"sentence":"The company specializes in the development of industrial robotry solutions.","translation":"その会社は、産業用ロボット工学ソリューションの開発を専門としています。","type":"noun","meaning_category":"ロボット工学"}]}