{"word":"obeyingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"従順に、素直に、言われた通りに","english_definition":"in an obedient manner; willingly following instructions or commands.","examples":[{"sentence":"The dog sat obeyingly when his owner told him to.","translation":"犬は飼い主が言いつけると、従順に座った。"},{"sentence":"She followed the doctor's orders obeyingly, hoping to recover quickly.","translation":"彼女は早く回復したいと思い、医者の指示に素直に従った。"},{"sentence":"The soldiers acted obeyingly, carrying out their orders without question.","translation":"兵士たちは言われた通りに行動し、命令に疑問を抱くことなく実行した。"}],"collocations":["act obeyingly (従順に行動する)","follow obeyingly (従順に従う)","listen obeyingly (従順に聞く)","respond obeyingly (従順に答える)"],"synonyms":["dutifully","compliantly","submissively","docilely","tractably"],"antonyms":["disobediently","rebelliously","insubordinately","defiantely"]}],"etymology":{"value":"The word \"obeyingly\" is formed by adding the suffix \"-ly\" to the word \"obeying\". \"Obeying\" is the present participle of the verb \"obey\", which comes from the Old French word \"obeir\", meaning \"to obey, comply with, submit to\", derived from the Latin word \"obaudire\", meaning \"to give ear to, listen to, obey\".","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈbeɪɪŋli/","syllables":"o-bey-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Obeyingly\" describes the manner in which an action is performed. It implies a willingness to follow instructions or commands without resistance. It is often used to describe the behavior of children, pets, or subordinates. While grammatically correct, it is not as commonly used as other adverbs like \"obediently\" or \"dutifully\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He obeyingly did what he was told.","correct":"✓ He obediently did what he was told.","note":"\"Obediently\" is a more common and natural-sounding alternative to \"obeyingly\"."},{"incorrect":"✗ She acted obeyingly and with respect.","correct":"✓ She acted obediently and respectfully.","note":"Using more common synonyms like \"obediently\" and \"respectfully\" improves the flow and clarity of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["obey (verb: to follow instructions or commands)","obedient (adjective: following instructions or commands)","obedience (noun: the act of following instructions or commands)","obediently (adverb: in an obedient manner)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Obeyingly\" is an adverb that means 'in an obedient manner'. It describes how someone performs an action, showing that they are following instructions or commands willingly. While the word is understandable, it is not as common as its synonym, 'obediently'. Therefore, using 'obediently' is generally preferred for clearer and more natural communication. The word is formed from the verb 'obey' and the suffix '-ingly', which turns it into an adverb. Because it is not frequently used, it may be more appropriate for advanced learners or specific contexts where a more formal or precise tone is desired."},"example_sentences":[{"sentence":"The child listened obeyingly to his mother's instructions.","translation":"子供は母親の指示に素直に耳を傾けた。","type":"general"},{"sentence":"The robot performed its tasks obeyingly, following the programmed commands.","translation":"ロボットはプログラムされた命令に従い、従順にタスクを実行した。","type":"technical"},{"sentence":"The student responded obeyingly to the teacher's questions.","translation":"生徒は先生の質問に素直に答えた。","type":"educational"}]}