{"word":"Cystoidean","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古生物学) 絶滅した棘皮動物の一群である嚢胞動物","english_definition":"(Paleontology) An extinct group of echinoderms belonging to the class Cystoidea.","examples":[{"sentence":"Cystoideans are characterized by their theca, which is a sac-like body covered with plates.","translation":"嚢胞動物は、板で覆われた袋状の体であるテカによって特徴付けられます。"},{"sentence":"Fossil evidence suggests that cystoideans were common in the Ordovician and Silurian periods.","translation":"化石の証拠は、嚢胞動物がオルドビス紀とシルル紀に一般的であったことを示唆しています。"}],"collocations":["cystoidean fossil (嚢胞動物の化石)","cystoidean theca (嚢胞動物のテカ)","cystoidean plate (嚢胞動物の板)"],"synonyms":["Cystoid"],"antonyms":[]}],"etymology":{"value":"Derived from the class name Cystoidea, from Greek kystis (bladder, sac) + -oidea (resembling).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈstɔɪdiən/","syllables":"cis-toi-de-an"},"inflection":{"noun_plural":"Cystoideans"},"usage_notes":{"explanation":"'Cystoidean' refers specifically to an individual or member of the extinct class Cystoidea. It is primarily used in paleontological contexts when discussing or describing these ancient echinoderms. The term is relatively specialized and not commonly encountered outside of scientific literature or discussions related to paleontology and evolutionary biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cystoidean was a type of fish.","correct":"✓ The cystoidean was a type of echinoderm.","note":"Cystoideans are echinoderms, not fish."},{"incorrect":"✗ Cystoideans are still found in modern oceans.","correct":"✓ Cystoideans are an extinct group of echinoderms.","note":"Cystoideans are extinct."}],"priority":"★★☆"},"related_words":{"derivatives":["Cystoidea (class name)"],"phrases":["Echinoderm (棘皮動物)","Paleozoic Era (古生代)","Theca (テカ)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cystoidean' is a highly specialized term used in paleontology to refer to an extinct group of echinoderms. Understanding this term requires knowledge of biology, paleontology, and evolutionary history. The word is rarely encountered outside of academic or scientific contexts."},"example_sentences":[{"sentence":"The museum displayed a well-preserved cystoidean fossil.","translation":"博物館には保存状態の良い嚢胞動物の化石が展示されていました。","type":"noun","meaning_category":"古生物学"},{"sentence":"Researchers analyzed the thecal plates of the cystoidean to understand its evolutionary relationships.","translation":"研究者たちは、その進化関係を理解するために、嚢胞動物のテカの板を分析しました。","type":"noun","meaning_category":"古生物学"}]}