{"word":"performance-originated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"パフォーマンスに由来する、パフォーマンスから生まれた","english_definition":"Derived or originating from a performance; relating to something that has its roots in a performance.","examples":[{"sentence":"The dance piece was performance-originated, evolving from improvisations on stage.","translation":"そのダンス作品はパフォーマンスに由来し、舞台上での即興演奏から発展した。"},{"sentence":"This performance-originated artwork explores themes of identity and transformation.","translation":"このパフォーマンスから生まれたアート作品は、アイデンティティと変容をテーマに探求している。"}],"collocations":["performance-originated art","performance-originated dance","performance-originated piece","performance-originated work"],"synonyms":["performance-based","performance-derived","performance-related","performance-inspired"],"antonyms":["non-performance-based","studio-originated","theoretical"],"notes":"This term is often used in the context of art, dance, and theater to describe works that are developed through the process of performance itself, rather than being conceived in advance and then performed."}],"etymology":{"value":"A compound word formed by combining 'performance' (from Old French 'parfournir', meaning 'to complete' or 'to carry out') with 'originated' (from Latin 'originatus', past participle of 'originari', meaning 'to begin' or 'to arise'). The term describes something that has its origin or source in a performance.","priority":"N/A"},"pronunciation":{"ipa":"/pərˈfɔːrməns əˈrɪdʒɪneɪtɪd/","syllables":"per-form-ance-o-rig-i-nat-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are not commonly used for this particular adjective)."},"usage_notes":{"explanation":"'Performance-originated' is a descriptive term used to specify that a particular artwork, concept, or creation has emerged from a performance setting or process. It emphasizes the role of live action, improvisation, and interaction in the development of the final product.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The performance-originated the idea.","correct":"The performance originated the idea.","note":"'Performance-originated' is an adjective, so it should be used to describe a noun. 'Originated' is the verb form."}],"priority":"N/A"},"related_words":{"derivatives":["performance","originate","origin","performance art"],"related_terms":["site-specific performance","live art","improvisation","performance studies"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a specialized term and not commonly used in general conversation.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Performance-originated' is a complex term used in artistic and academic contexts to describe works that are developed through the process of performance itself. It implies that the final product or concept has emerged from live action, improvisation, or interaction, rather than being pre-planned. Understanding this term requires familiarity with performance art and related concepts."},"example_sentences":[{"sentence":"The installation was a performance-originated sculpture, incorporating elements from previous live events.","translation":"そのインスタレーションは、パフォーマンスから生まれた彫刻であり、過去のライブイベントの要素を取り入れていた。","type":"adjective","meaning_category":"originating from a performance"},{"sentence":"The research explores the unique characteristics of performance-originated knowledge.","translation":"その研究は、パフォーマンスから生まれた知識の独自の特徴を探求している。","type":"adjective","meaning_category":"originating from a performance"}]}