{"word":"Agartala","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アガルタラ：インド北東部、トリプラ州の州都。","english_definition":"Agartala: The capital city of the state of Tripura in northeastern India.","examples":[{"sentence":"Agartala is located near the border with Bangladesh.","translation":"アガルタラはバングラデシュとの国境近くに位置しています。"},{"sentence":"The main language spoken in Agartala is Bengali.","translation":"アガルタラで話されている主な言語はベンガル語です。"}],"collocations":["Agartala city","Agartala airport","near Agartala"],"synonyms":["capital of Tripura"],"antonyms":[]}],"etymology":{"value":"The name Agartala is derived from 'Agar tree', a type of tree that was once abundant in the region. The suffix 'tala' means 'land' or 'settlement'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːɡərˈtɑːlə/","syllables":"A-gar-ta-la"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Agartala is primarily used as a proper noun to refer to the city. It is not commonly used in other contexts. When discussing the city, it's often mentioned in relation to Tripura, its culture, or its geographical location.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Agartala is a big city than Udaipur.","correct":"✓ Agartala is a bigger city than Udaipur.","note":"When comparing the size of cities, use the comparative form of the adjective (bigger)."},{"incorrect":"✗ I live to Agartala.","correct":"✓ I live in Agartala.","note":"Use the preposition 'in' when referring to living in a city."}],"priority":"★★☆"},"related_words":{"derivatives":["Agartalaite (noun: a resident of Agartala)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, specific to geographical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agartala' is a proper noun referring to a specific city, the capital of Tripura, India. Its usage is generally limited to geographical, political, or cultural contexts related to the region. Understanding its significance requires knowledge of Indian geography and state capitals. The word is not commonly used in everyday conversation unless the topic is specifically related to Tripura or northeastern India."},"example_sentences":[{"sentence":"The Maharaja Bir Bikram Airport serves as the primary airport for Agartala.","translation":"マハラジャ・ビール・ビクラム空港はアガルタラの主要空港として機能しています。","type":"noun","meaning_category":"location"},{"sentence":"Agartala experiences a humid subtropical climate.","translation":"アガルタラは温暖湿潤気候です。","type":"noun","meaning_category":"location"},{"sentence":"Many cultural festivals are celebrated in Agartala throughout the year.","translation":"アガルタラでは一年を通して多くの文化的な祭りが開催されます。","type":"noun","meaning_category":"location"}]}