{"word":"contingency fee","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"成功報酬制の弁護士費用","english_definition":"A fee charged by a lawyer that is payable only if the lawsuit is successful or is favorably settled out of court.","examples":[{"sentence":"The lawyer agreed to work on a contingency fee basis, taking 30% of any settlement.","translation":"弁護士は、成功報酬制で働くことに同意し、和解金の30％を受け取ることになった。"},{"sentence":"Many personal injury cases are handled on a contingency fee basis.","translation":"多くの人身傷害事件は、成功報酬制で扱われる。"},{"sentence":"If we lose the case, you won't owe us any legal fees because we work on a contingency fee.","translation":"もし私たちが訴訟に負けた場合、私たちは成功報酬制で働いているため、あなたは私たちに弁護士費用を支払う必要はありません。"}],"collocations":["work on a contingency fee basis (成功報酬制で働く)","charge a contingency fee (成功報酬を請求する)","agree to a contingency fee (成功報酬に同意する)"],"synonyms":["success fee"],"antonyms":["hourly rate","retainer fee"]}],"etymology":{"value":"The term 'contingency fee' comes from the fact that the fee is contingent, or dependent, on a specific outcome, namely a successful resolution of the case.","priority":"★★★"},"pronunciation":{"ipa":"/kənˈtɪndʒənsi fiː/","syllables":"con-tin-gen-cy fee"},"inflection":{"noun_plural":"contingency fees"},"usage_notes":{"explanation":"A 'contingency fee' is a specific type of payment arrangement with a lawyer where the lawyer only gets paid if they win or settle the case favorably for their client. The fee is usually a percentage of the money recovered. This arrangement is common in personal injury cases and other types of civil litigation. It allows people who might not otherwise be able to afford a lawyer to pursue legal action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He paid a contingency fee upfront.","correct":"✓ He agreed to a contingency fee arrangement.","note":"Contingency fees are not paid upfront. They are only paid if the case is won or settled. The agreement is made upfront, but the payment happens later."},{"incorrect":"✗ Contingency fees are allowed in all types of cases.","correct":"✓ Contingency fees are not allowed in all types of cases.","note":"Contingency fees are not allowed in all types of cases. Some jurisdictions prohibit them in criminal cases or divorce cases."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_legal_terms":["retainer","settlement","litigation","damages","plaintiff","defendant"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contingency fee' refers to a payment arrangement with a lawyer where their fee depends on winning the case or achieving a favorable settlement. The lawyer receives a percentage of the money recovered. This is often used in personal injury cases, making legal representation accessible to those who might not afford it otherwise. It's important to understand that if the case is lost, the client typically doesn't owe the lawyer any fees, although they might still be responsible for court costs and other expenses. This type of fee arrangement is not allowed in all types of cases or in all jurisdictions."},"example_sentences":[{"sentence":"Our firm handles medical malpractice claims on a **contingency fee** basis.","translation":"当事務所は、医療過誤の請求を成功報酬制で扱っています。","type":"noun","meaning_category":"弁護士費用"},{"sentence":"Under the **contingency fee** agreement, the lawyer will receive 40% of the final settlement.","translation":"成功報酬制契約に基づき、弁護士は最終的な和解金の40％を受け取ります。","type":"noun","meaning_category":"弁護士費用"},{"sentence":"The client preferred a **contingency fee** arrangement because they couldn't afford to pay an hourly rate.","translation":"依頼人は時間制料金を支払う余裕がなかったため、成功報酬制の契約を希望しました。","type":"noun","meaning_category":"弁護士費用"}]}