{"word":"arginine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルギニン（アミノ酸の一種）","english_definition":"An amino acid that is important for many bodily functions, including wound healing, immune function, and hormone release. It is considered a conditionally essential amino acid, meaning that it is essential under certain conditions, such as during periods of rapid growth or stress.","examples":[{"sentence":"Arginine is often used as a dietary supplement to improve athletic performance.","translation":"アルギニンは、運動能力を向上させるための栄養補助食品としてよく使用されます。"},{"sentence":"Some studies suggest that arginine may help lower blood pressure.","translation":"いくつかの研究では、アルギニンが血圧を下げるのに役立つ可能性があることが示唆されています。"},{"sentence":"Arginine plays a crucial role in the urea cycle, which removes ammonia from the body.","translation":"アルギニンは、体からアンモニアを除去する尿素回路において重要な役割を果たします。"}],"collocations":["L-arginine","arginine supplement","arginine metabolism","arginine biosynthesis"],"synonyms":["2-Amino-5-guanidinovaleric acid"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'argyros' (ἄργυρος) meaning 'silver', referring to the silver-white crystals of arginine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrdʒɪniːn/","syllables":"ar-gi-nine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Arginine is an amino acid classified as conditionally essential. This means the body can usually produce it, but supplementation may be necessary during times of stress, illness, or rapid growth. It's involved in various metabolic processes and is often marketed as a supplement for athletic performance and cardiovascular health, though scientific evidence for these uses is mixed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Arginine is a vitamin.","correct":"✓ Arginine is an amino acid.","note":"Arginine is a building block of proteins, not a vitamin."},{"incorrect":"✗ Everyone needs to supplement with arginine.","correct":"✓ Arginine supplementation may be beneficial for some individuals under specific conditions.","note":"Most people produce enough arginine, but supplementation may be helpful in certain situations."}],"priority":"★★☆"},"related_words":{"derivatives":["arginase","argininosuccinate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency. Primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arginine' is a technical term primarily used in scientific, medical, and nutritional contexts. Understanding requires a basic knowledge of biology and biochemistry, particularly the role of amino acids in the body. The term is most likely encountered in discussions of dietary supplements, cardiovascular health, or metabolic processes.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor recommended an **arginine** supplement to aid in wound healing.","translation":"医師は傷の治癒を助けるためにアルギニンサプリメントを推奨しました。","type":"noun","meaning_category":"amino acid"},{"sentence":"**Arginine** is a precursor to nitric oxide, a molecule that helps relax blood vessels.","translation":"アルギニンは、血管を弛緩させるのに役立つ分子である一酸化窒素の前駆体です。","type":"noun","meaning_category":"amino acid"},{"sentence":"Athletes sometimes use **arginine** to enhance blood flow and improve exercise performance.","translation":"アスリートは、血流を促進し、運動能力を向上させるためにアルギニンを使用することがあります。","type":"noun","meaning_category":"amino acid"}]}