{"word":"epiglottitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"喉頭蓋炎（こうとうがいえん）","english_definition":"Inflammation of the epiglottis, the flap at the base of the tongue that prevents food from entering the trachea (windpipe).","examples":[{"sentence":"Epiglottitis is a serious condition that can cause difficulty breathing.","translation":"喉頭蓋炎は呼吸困難を引き起こす可能性のある深刻な状態です。"},{"sentence":"Prompt diagnosis and treatment are crucial for epiglottitis.","translation":"喉頭蓋炎の迅速な診断と治療は非常に重要です。"}],"collocations":["acute epiglottitis","bacterial epiglottitis","pediatric epiglottitis"],"synonyms":["supraglottitis"],"antonyms":[]}],"etymology":{"value":"From 'epiglottis' (the anatomical term for the structure) + '-itis' (a suffix denoting inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪɡlɒˈtaɪtɪs/","syllables":"ep-i-glot-ti-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Epiglottitis is a medical term referring specifically to the inflammation of the epiglottis. It is most commonly caused by bacterial infection, particularly Haemophilus influenzae type b (Hib), although the incidence of Hib-related epiglottitis has decreased due to widespread vaccination. Viral and fungal infections, as well as burns from hot liquids, can also cause epiglottitis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have epiglottis.","correct":"✓ I have epiglottitis.","note":"'Epiglottis' is the anatomical structure, while 'epiglottitis' is the inflammation of that structure."}],"priority":"★★☆"},"related_words":{"derivatives":["epiglottal (adjective: relating to the epiglottis)","epiglottis (noun: the flap of cartilage at the root of the tongue)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epiglottitis' is a specialized medical term referring to the inflammation of the epiglottis. Understanding this term requires knowledge of medical terminology and human anatomy. It is typically encountered in medical contexts or discussions about respiratory illnesses."},"example_sentences":[{"sentence":"The child presented with a high fever and symptoms suggestive of epiglottitis.","translation":"その子供は高熱を呈し、喉頭蓋炎を示唆する症状が見られました。","type":"medical","meaning_category":"Inflammation"},{"sentence":"Vaccination against Hib has significantly reduced the incidence of epiglottitis in children.","translation":"Hibに対するワクチン接種は、子供の喉頭蓋炎の発生率を大幅に減少させました。","type":"medical","meaning_category":"Prevention"}]}