{"word":"performance-motivated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"成果意欲の高い、業績志向の","english_definition":"Driven or inspired by the desire to achieve high levels of performance or to excel in accomplishments.","examples":[{"sentence":"The company seeks performance-motivated individuals who are eager to contribute to its success.","translation":"会社は、会社の成功に貢献したいと熱望する、成果意欲の高い人材を求めています。"},{"sentence":"A performance-motivated team is more likely to exceed its targets.","translation":"業績志向のチームは、目標を上回る可能性が高くなります。"},{"sentence":"He is a performance-motivated student who always strives for top grades.","translation":"彼は常にトップの成績を目指す、成果意欲の高い学生です。"}],"collocations":["performance-motivated employee (成果意欲の高い従業員)","performance-motivated team (業績志向のチーム)","performance-motivated individual (成果意欲の高い個人)","highly performance-motivated (非常に成果意欲が高い)"],"synonyms":["achievement-oriented","results-driven","ambitious","goal-oriented","driven","motivated"],"antonyms":["unmotivated","apathetic","lackadaisical","indifferent"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'performance' (the act of accomplishing something), 'motivated' (having a reason or incentive to act), and a hyphen to link them.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈfɔːrməns ˌmoʊtɪveɪtɪd/","syllables":"per-for-mance mo-ti-va-ted"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Performance-motivated' describes someone who is strongly driven to achieve high standards and excel in their work or other endeavors. It suggests a proactive and ambitious attitude, where the individual is not only willing but eager to put in the effort required to succeed. This term is often used in professional contexts to describe desirable qualities in employees or team members.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a performance motivate person.","correct":"✓ He is a performance-motivated person.","note":"'Motivated' should be used as a past participle adjective. Also, the hyphen is important to correctly link the words as a compound adjective."},{"incorrect":"✗ The team was performance motivated.","correct":"✓ The team was performance-motivated.","note":"The hyphen is necessary to connect the words and form a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["performance (名詞: 性能、実績、パフォーマンス)","motivation (名詞: 動機、意欲)","motivate (動詞: 動機を与える、刺激する)"],"related_terms":["high-achiever","go-getter","self-starter","career-oriented","success-driven"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, typically used in professional or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Performance-motivated' is a term used to describe individuals who are strongly driven to achieve high levels of success and excel in their work or other activities. It implies a proactive and ambitious attitude, where the person is eager to put in the effort required to succeed. This term is often used in professional settings to describe desirable qualities in employees or team members. It's a more complex term, so it's generally found in higher-level English content."},"example_sentences":[{"sentence":"The company is looking for performance-motivated sales representatives.","translation":"会社は成果意欲の高い営業担当者を募集しています。","type":"adjective","meaning_category":"業績志向"},{"sentence":"A performance-motivated culture can lead to increased productivity.","translation":"成果意欲の高い文化は、生産性の向上につながる可能性があります。","type":"adjective","meaning_category":"業績志向"},{"sentence":"She is a performance-motivated leader who inspires her team to achieve great things.","translation":"彼女はチームを鼓舞して素晴らしい成果を上げる、成果意欲の高いリーダーです。","type":"adjective","meaning_category":"業績志向"}]}