{"word":"vanaspati","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バナスピティ：インド亜大陸で一般的に使用される、部分的に水素添加された植物油。ギー（精製バター）の安価な代替品として用いられる。","english_definition":"Vanaspati: A partially hydrogenated vegetable oil, commonly used in the Indian subcontinent as a cheaper substitute for ghee (clarified butter).","examples":[{"sentence":"Vanaspati is often used in Indian cooking for frying and baking.","translation":"バナスピティは、インド料理で揚げ物や焼き物によく使われます。"},{"sentence":"Some people prefer vanaspati over ghee due to its lower cost.","translation":"ギーよりもコストが低いことから、バナスピティを好む人もいます。"}],"collocations":["used in cooking","substitute for ghee","hydrogenated vegetable oil"],"synonyms":["vegetable ghee","shortening"],"antonyms":["ghee"]}],"etymology":{"value":"「vanaspati」という言葉はサンスクリット語に由来し、「植物の王」または「森の主」を意味する「vanas-pati」に由来します。この名前は、植物油から作られているという事実に由来しています。","priority":"★★☆"},"pronunciation":{"ipa":"/vəˈnɑːspətɪ/","syllables":"va-nas-pa-ti"},"inflection":{"noun_plural":"vanaspatis"},"usage_notes":{"explanation":"Vanaspatiは、インド、パキスタン、バングラデシュなどの国々で広く使用されている一般的な食用油です。部分的に水素添加されているため、室温で固体であり、ギーのような食感を持っています。ただし、完全に水素添加された油よりもトランス脂肪酸含有量が少ないです。健康上の懸念から、一部の消費者はバナスピティの代わりに、より健康的な油（未水素添加の植物油）を使用しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Vanaspati is a type of animal fat.","correct":"✓ Vanaspati is a type of vegetable oil.","note":"Vanaspatiは植物油であり、動物性脂肪ではありません。"},{"incorrect":"✗ Vanaspati is very healthy because it has no fat.","correct":"✓ Vanaspati contains fat, but some people prefer it to ghee because it is cheaper.","note":"Vanaspatiには脂肪が含まれていますが、ギーより安価であるため好む人もいます。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Vanaspati」は、インド亜大陸の料理で使われる、部分的に水素添加された植物油を指す専門用語です。ギーの代替品として使われます。この単語は、インド料理や食文化に関する文脈で現れる可能性が高く、一般的な英語の会話ではあまり使われません。"},"example_sentences":[{"sentence":"Many traditional Indian sweets are made using vanaspati.","translation":"多くの伝統的なインドの菓子は、バナスピティを使って作られています。","type":"general","meaning_category":"cooking"},{"sentence":"The label indicated that the product contained vanaspati.","translation":"ラベルには、その製品にバナスピティが含まれていることが示されていました。","type":"general","meaning_category":"ingredients"}]}