{"word":"BHA","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ベータヒドロキシ酸 (Beta Hydroxy Acid)","english_definition":"Beta Hydroxy Acid: A type of organic acid used in cosmetics and dermatology, primarily for exfoliation.","examples":[{"sentence":"BHA is effective in treating acne because it can penetrate oil glands.","translation":"BHAは油腺に浸透できるため、ニキビの治療に効果的です。"},{"sentence":"Some people may experience skin irritation when using BHA products.","translation":"BHA製品を使用すると、皮膚刺激を感じる人もいます。"}],"collocations":["BHA exfoliant","BHA cleanser","BHA serum","salicylic acid (a common BHA)"],"synonyms":["salicylic acid","beta hydroxy acid"],"antonyms":[]}],"etymology":{"value":"An acronym for Beta Hydroxy Acid.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbiːˌeɪtʃˈeɪ/","syllables":"B-H-A"},"inflection":{"notes":"It's a noun, so plural form is BHAs."},"usage_notes":{"explanation":"BHA (Beta Hydroxy Acid) is a chemical exfoliant used in skincare products. It's oil-soluble, allowing it to penetrate pores and exfoliate inside the pore as well as on the skin's surface. Salicylic acid is the most common type of BHA.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used BHA and my skin became more dry than usual.","correct":"✓ I used a BHA product and my skin became more dry than usual.","note":"BHA is a chemical ingredient, so it's usually used in a product form, not directly."}],"priority":"★★☆"},"related_words":{"derivatives":["exfoliant","salicylic acid","AHA (Alpha Hydroxy Acid)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"BHA stands for Beta Hydroxy Acid. It's a type of acid used in skincare to help exfoliate the skin. It's especially good for oily or acne-prone skin because it can get into pores and clean them out. Salicylic acid is a common example of a BHA. If you use BHA products, start slowly to avoid irritating your skin."},"example_sentences":[{"sentence":"This cleanser contains BHA to help unclog pores.","translation":"この洗顔料には、毛穴の詰まりを解消するBHAが含まれています。","type":"noun","meaning_category":"skincare"},{"sentence":"Using a BHA regularly can improve skin texture.","translation":"BHAを定期的に使用すると、肌の質感が向上する可能性があります。","type":"noun","meaning_category":"skincare"}]}