{"word":"overpersuading","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"説得しすぎる、過剰に説得する、しつこく説得する","english_definition":"To persuade someone to do something more than is necessary or desirable; to be overly persuasive.","examples":[{"sentence":"I think you're overpersuading him; let him make his own decision.","translation":"あなたは彼を説得しすぎていると思います。彼に自分で決断させてあげてください。"},{"sentence":"She felt like the salesperson was overpersuading her to buy the extended warranty.","translation":"彼女は、販売員が延長保証を買うように過剰に説得しているように感じました。"}],"collocations":["overpersuade someone to do something","stop overpersuading","avoid overpersuading"],"synonyms":["badger","coerce","importune","pressure","push too hard"],"antonyms":["underpersuade","discourage","dissuade"],"notes":"Often carries a negative connotation, implying that the persuasion is unwanted or excessive."}],"etymology":{"value":"Formed by adding the prefix 'over-' to the verb 'persuading.' 'Over-' indicates excess or doing something to an excessive degree. 'Persuading' comes from the verb 'persuade,' meaning to convince someone to do or believe something.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvər.pərˈsweɪ.dɪŋ/","syllables":"o-ver-per-sway-ding"},"inflection":{"verb_forms":{"present_simple":["overpersuade","overpersuades"],"past_simple":"overpersuaded","past_participle":"overpersuaded","present_participle":"overpersuading"}},"usage_notes":{"explanation":"'Overpersuading' implies that the act of persuading has gone beyond a reasonable or acceptable point. It often suggests that the person being persuaded feels pressured or uncomfortable. The term is typically used when the persuasion is seen as excessive or unwanted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is overpersuading of me.","correct":"✓ He is overpersuading me.","note":"The verb 'overpersuade' is transitive and takes a direct object. The preposition 'of' is unnecessary and incorrect."},{"incorrect":"✗ She overpersuaded to buy the car.","correct":"✓ She was overpersuaded to buy the car.","note":"The correct structure is 'overpersuade someone to do something' or 'be overpersuaded to do something' (passive voice)."}],"priority":"★★★"},"related_words":{"derivatives":["overpersuasion (noun): The act of persuading excessively.","persuade (verb): To cause (someone) to do something through reasoning or argument.","persuasion (noun): The action or process of persuading someone or of being persuaded to do or believe something.","persuasive (adjective): Good at persuading someone to do or believe something through reasoning or the use of temptation."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'overpersuading' is a relatively uncommon term that combines the prefix 'over-' (meaning excessively) with the verb 'persuading.' It describes the act of persuading someone to an excessive degree, often implying that the persuasion is unwanted or uncomfortable. Understanding this word requires a good grasp of prefixes and the nuances of persuasive language. It is more likely to be encountered in formal writing or discussions about ethics and communication. "},"example_sentences":[{"sentence":"The company was accused of overpersuading elderly customers into buying unnecessary products.","translation":"その会社は、高齢の顧客に不要な製品を買うように過剰に説得したとして告発された。","type":"verb","meaning_category":"説得しすぎる"},{"sentence":"Don't risk overpersuading them; a gentle nudge is often more effective.","translation":"彼らを説得しすぎるリスクを冒さないでください。穏やかな後押しの方が効果的なことが多いです。","type":"verb","meaning_category":"説得しすぎる"},{"sentence":"She worried that she was overpersuading her friend to move to a new city.","translation":"彼女は、友人を新しい都市に引っ越すように説得しすぎているのではないかと心配した。","type":"verb","meaning_category":"説得しすぎる"}]}