{"word":"Traducianistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(神学) 霊魂が親から子へと受け継がれるという説の、またはそれに関する","english_definition":"Relating to or supporting traducianism, the doctrine that the soul is generated by the parents along with the body.","examples":[{"sentence":"The traducianistic view contrasts with creationism, which holds that God creates each individual soul.","translation":"トラドゥキアニスムの観点は、神が個々の魂を創造するという創造説とは対照的です。"}],"collocations":["traducianistic view","traducianistic theory","traducianistic argument"],"synonyms":[],"antonyms":["creationistic"]}],"etymology":{"value":"From the Latin word 'tradux' (meaning 'shoot, offspring, propagation'), referring to the transmission or propagation of the soul.","priority":"★★★"},"pronunciation":{"ipa":"/trəˌdjuːʃəˈnɪstɪk/","syllables":"tra-du-ci-a-nis-tic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term \"traducianistic\" is primarily used in theological discussions concerning the origin of the soul. It describes the belief that the soul, like the body, is generated through natural procreation by the parents, rather than being directly created by God for each individual. This contrasts with creationism, which asserts that God creates a new soul for each person at conception or birth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a traducianistic experience.","correct":"✓ He held a traducianistic belief.","note":"'Traducianistic' describes a belief or theory, not an experience."}],"priority":"★★☆"},"related_words":{"derivatives":["traducianism (noun): the doctrine of the soul being generated by the parents."],"related_terms":["creationism","soul","theology","generation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語 (Theological term).","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"traducianistic\" is a specialized theological term primarily used in discussions about the origin of the soul. It is not commonly used outside of these specific contexts. Understanding requires familiarity with theological concepts and terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The early Church Fathers debated the merits of the traducianistic and creationistic views.","translation":"初期の教父たちは、トラドゥキアニスムと創造説の長所について議論しました。","type":"adjective","meaning_category":"神学"},{"sentence":"Some argue that a traducianistic understanding of the soul better explains the transmission of original sin.","translation":"魂のトラドゥキアニスム的な理解は、原罪の伝達をより良く説明すると主張する人もいます。","type":"adjective","meaning_category":"神学"}]}