{"word":"Baxterian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リチャード・バクスター（17世紀のイングランドのピューリタン神学者）の神学または教えに関連する、またはそれを支持する","english_definition":"Relating to or supporting the theology or teachings of Richard Baxter (17th-century English Puritan theologian).","examples":[{"sentence":"Baxterian theology emphasizes practical piety and a moderate Calvinism.","translation":"バクスター神学は、実践的な敬虔さと穏健なカルヴァン主義を強調する。"},{"sentence":"The Baxterian view of conversion stresses the importance of personal effort alongside divine grace.","translation":"回心に関するバクスターの考え方は、神の恵みとともに個人の努力の重要性を強調する。"}],"collocations":["Baxterian theology","Baxterian view","Baxterian principles"],"synonyms":["Puritan","Calvinistic","theological"],"antonyms":[]}],"etymology":{"value":"Richard Baxter (1615-1691), an influential English Puritan minister, theologian, and hymn-writer.","priority":"★★★"},"pronunciation":{"ipa":"/bækˈstɪəriən/","syllables":"Bak-ste-ri-an"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'Baxterian' is primarily used in theological and historical contexts to describe ideas or individuals associated with Richard Baxter's specific theological positions. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Baxterian doctor.","correct":"✓ He was a doctor with Baxterian beliefs.","note":"'Baxterian' refers specifically to theological or religious beliefs, not to general characteristics or professions."}],"priority":"★☆☆"},"related_words":{"derivatives":["Baxter (noun: referring to Richard Baxter himself)"],"phrases":["Baxterianism (noun: the theological system of Richard Baxter)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Baxterian' is a highly specialized term primarily used in theological or historical discussions related to Richard Baxter and his specific theological views. Understanding this term requires familiarity with 17th-century Puritan theology. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor lectured on the nuances of Baxterian covenant theology.","translation":"教授はバクスターの契約神学のニュアンスについて講義した。","type":"adjective","meaning_category":"theological"},{"sentence":"Some historians argue that Baxterianism influenced the development of evangelicalism.","translation":"一部の歴史家は、バクスター主義が福音主義の発展に影響を与えたと主張している。","type":"adjective","meaning_category":"historical"}]}