{"word":"hegumen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(正教会の)修道院長","english_definition":"The superior of a monastery in the Eastern Orthodox Church; an abbot.","examples":[{"sentence":"The hegumen greeted the visitors at the monastery gates.","translation":"修道院長は修道院の門で訪問者を出迎えた。"},{"sentence":"The hegumen is responsible for the spiritual guidance of the monks.","translation":"修道院長は修道士たちの精神的な指導に責任を負う。"}],"collocations":["hegumen of the monastery","appoint a hegumen","serve as hegumen"],"synonyms":["abbot","archimandrite"],"antonyms":[]}],"etymology":{"value":"From Medieval Greek ἡγούμενος (hēgoúmenos, “leading”), present participle of ἡγέομαι (hēgéomai, “I lead”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛɡjumən/","syllables":"heg-u-men"},"inflection":{"noun_plural":"hegumens"},"usage_notes":{"explanation":"The term 'hegumen' is specific to the Eastern Orthodox Church and refers to the leader of a monastery. It is equivalent to the term 'abbot' used in Western Christianity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The hegumen is a priest in the Catholic Church.","correct":"The hegumen is a leader in the Eastern Orthodox Church.","note":"Hegumens are part of the Eastern Orthodox tradition, not the Catholic Church."}],"priority":"★☆☆"},"related_words":{"derivatives":["hegumena (feminine form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hegumen' is a specialized term used within the context of the Eastern Orthodox Church. It refers to the leader of a monastery, similar to an abbot in Western Christianity. Due to its specific religious context, it is not commonly used in general English conversation. Understanding this term requires familiarity with Eastern Orthodox monastic traditions."},"example_sentences":[{"sentence":"The new hegumen was installed during a solemn ceremony.","translation":"新しい修道院長は厳粛な式典で就任した。","type":"noun","meaning_category":"修道院長"},{"sentence":"The monks sought guidance from their wise hegumen.","translation":"修道士たちは賢明な修道院長に指導を求めた。","type":"noun","meaning_category":"修道院長"}]}