{"word":"under-malted","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"麦芽化が不十分な、麦芽化が足りない","english_definition":"Not malted sufficiently; having undergone insufficient malting.","examples":[{"sentence":"The beer suffered from off-flavors due to the under-malted barley.","translation":"そのビールは、麦芽化が不十分な大麦が原因で異臭がした。"},{"sentence":"Using under-malted grains can lead to lower enzyme activity during mashing.","translation":"麦芽化が不十分な穀物を使用すると、マッシング中の酵素活性が低下する可能性がある。"}],"collocations":["under-malted barley","under-malted grain"],"synonyms":["insufficiently malted","poorly malted"],"antonyms":["over-malted","fully malted"]}],"etymology":{"value":"Formed from the prefix 'under-' meaning 'not enough' and the past participle 'malted' of the verb 'malt', referring to the process of converting grain into malt.","priority":"medium"},"pronunciation":{"ipa":"ˌʌndərˈmɔːltɪd","syllables":"un-der-malt-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Under-malted' describes grain, typically barley, that has not been properly or fully converted into malt. Malting is a process where grain is steeped in water, germinated, and then dried to produce malt. This process develops enzymes necessary for brewing and distilling. Under-malting can result in lower enzyme levels, affecting the conversion of starches into sugars during mashing, which can impact the flavor and alcohol content of the final product.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The under-malted beer was very bitter.","correct":"The beer made with under-malted barley was very bitter.","note":"While under-malting can contribute to off-flavors, bitterness is usually associated with hops or other factors. It's more accurate to say the beer 'made with under-malted barley' was bitter, to highlight the cause."}],"priority":"medium"},"related_words":{"derivatives":["under-malting (noun)"],"related_terms":["malted","malting","barley","grain","wort","mash","enzyme"],"priority":"high"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in brewing and distilling contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'under-malted' is a technical term primarily used in the context of brewing and distilling. It refers to grain that has not undergone the malting process to a sufficient degree. Understanding this term requires familiarity with the malting process and its importance in producing fermentable sugars and enzymes for alcohol production. Therefore, it is more likely to be encountered and understood by individuals with specific knowledge in these fields."},"example_sentences":[{"sentence":"The brewer suspected that the inconsistent batches were due to using some under-malted grain.","translation":"醸造家は、一貫性のないバッチは、麦芽化が不十分な穀物を一部使用したことが原因ではないかと疑った。","type":"general","meaning_category":"麦芽化が不十分な"},{"sentence":"The analysis revealed that the diastatic power of the malt was low, indicating that the barley was likely under-malted.","translation":"分析の結果、麦芽のジアスターゼ力が低いことが明らかになり、大麦が麦芽化不足である可能性が高いことが示唆された。","type":"technical","meaning_category":"麦芽化が不十分な"}]}