{"word":"Hymenophyllaceae","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"コケシノブ科","english_definition":"A family of ferns, commonly known as filmy ferns, characterized by their thin, often translucent fronds, typically one cell layer thick, lacking stomata, and often found in humid environments.","examples":[{"sentence":"The Hymenophyllaceae family includes delicate ferns that thrive in moist, shaded habitats.","translation":"コケシノブ科には、湿った日陰の生息地で生育する繊細なシダが含まれています。"}],"collocations":["filmy fern","fern family","tropical rainforest","epiphyte"],"synonyms":["filmy ferns"],"antonyms":[]}],"etymology":{"value":"The name Hymenophyllaceae is derived from the Greek words 'hymen' meaning membrane or film, 'phyllo' meaning leaf, and '-aceae' which is a suffix used to denote a family in botanical nomenclature. This refers to the thin, membranous nature of the fronds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪmənˌɒfɪˈleɪsiːˌaɪ/","syllables":"Hy-men-o-phyl-la-ce-ae"},"inflection":{"notes":"Plural form is Hymenophyllaceae (family names are usually treated as singular)."},"usage_notes":{"explanation":"Hymenophyllaceae is a family name used in botany to classify a specific group of ferns. These ferns are often referred to as 'filmy ferns' due to their thin, translucent fronds. The term is primarily used in scientific and botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hymenophyllaceae is a type of moss.","correct":"✓ Hymenophyllaceae is a family of ferns.","note":"Hymenophyllaceae are ferns, not mosses."}],"priority":"★★★"},"related_words":{"derivatives":["Hymenophyllum (genus within the family)","Trichomanes (genus within the family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in scientific and botanical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Hymenophyllaceae' is a scientific term used in botany to refer to a specific family of ferns known as filmy ferns. Understanding this term requires familiarity with botanical classification and terminology. The defining characteristic of this family is the thin, often single-cell-layered fronds of the ferns. This term is rarely encountered outside of scientific or specialized botanical contexts."},"example_sentences":[{"sentence":"Species within the Hymenophyllaceae family are often epiphytic.","translation":"コケシノブ科の種はしばしば着生植物です。","type":"general","meaning_category":"general"},{"sentence":"The thin fronds of Hymenophyllaceae lack stomata.","translation":"コケシノブ科の薄い葉には気孔がありません。","type":"descriptive","meaning_category":"characteristics"}]}