{"word":"sambul","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Sri Lankan English) A relish or side dish, typically made with shredded coconut, chili peppers, and other spices.","english_definition":"(Sri Lankan English) A relish or side dish, typically made with shredded coconut, chili peppers, and other spices.","examples":[{"sentence":"We had pol sambol with our rice and curry.","translation":"ご飯とカレーと一緒にポルサンボルを食べました。"},{"sentence":"The table was set with various sambols to accompany the meal.","translation":"食事ができるように、テーブルにはさまざまなサンボルが用意されていました。"}],"collocations":["pol sambol (ココナッツサンボル)","lunu miris sambol (玉ねぎとチリのサンボル)"],"synonyms":["relish","chutney","condiment"],"antonyms":[]}],"etymology":{"value":"Derived from Sinhala 'sambol' (සම්බෝල), referring to a mixture of ingredients.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsæmbʊl/","syllables":"sam-bul"},"inflection":{"noun_plural":"sambols"},"usage_notes":{"explanation":"\"Sambul\" is a term primarily used in Sri Lankan English to refer to a specific type of relish or condiment. It's an integral part of Sri Lankan cuisine, often served with rice and curry or other traditional dishes. The most common type is \"pol sambol\", made with coconut. Other variations exist, using different ingredients like onions, chili, and lime.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want a sambal with my rice.","correct":"✓ I want a sambol with my rice.","note":"The word is 'sambol' (with an 'o'), not 'sambal' (which refers to a similar dish in Southeast Asian cuisine)."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_cuisine":["Sri Lankan cuisine","South Asian cuisine"]},"level_frequency":{"CEFR":"Not applicable (specific regional term)","frequency_google_ngram":"Low frequency (specific to Sri Lankan English)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Sambul\" is a word you'll encounter when discussing Sri Lankan cuisine. It refers to a side dish or relish, often made with coconut and spices. If you're exploring Sri Lankan food, understanding this term will help you appreciate the variety of flavors and textures in their meals. It's similar to a chutney or relish, adding a spicy or flavorful element to the main course."},"example_sentences":[{"sentence":"The chef prepared a selection of traditional Sri Lankan sambols.","translation":"シェフは伝統的なスリランカのサンボルのセレクションを用意しました。","type":"noun","meaning_category":"relish"},{"sentence":"She learned how to make authentic pol sambol from her grandmother.","translation":"彼女は祖母から本場のポルサンボルの作り方を教わった。","type":"noun","meaning_category":"relish"}]}