{"word":"Araceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サトイモ科","english_definition":"The arum family of monocotyledonous flowering plants, characterized by their inflorescence (spadix) surrounded by a spathe.","examples":[{"sentence":"Many popular houseplants belong to the Araceae family, such as peace lilies and pothos.","translation":"多くの人気のある観葉植物は、サトイモ科に属し、例えば、スパティフィラムやポトスなどがある。"}],"collocations":["Araceae family","Araceae species","members of Araceae"],"synonyms":["arum family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Arum, which comes from the Greek word 'aron' referring to a type of plant.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈreɪsiːˌaɪ/","syllables":"a-ra-ce-ae"},"inflection":{"noun_plural":"Araceae (usually treated as a collective noun)"},"usage_notes":{"explanation":"Araceae is a botanical term referring to a large family of flowering plants. It's typically used in scientific or horticultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Araceae are a plant.","correct":"✓ Araceae is a family of plants.","note":"Araceae refers to the entire family, not a single plant."}],"priority":"★★☆"},"related_words":{"derivatives":["aroid (noun: a plant belonging to the Araceae family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Araceae' is a scientific term used to classify a family of flowering plants. It is not commonly used in everyday language and is more likely to be encountered in botanical or horticultural contexts. Understanding this term requires some familiarity with plant classification systems."},"example_sentences":[{"sentence":"The botanical garden features a diverse collection of Araceae, including various species of Anthurium and Philodendron.","translation":"植物園には、様々なアンスリウムやフィロデンドロンなど、多様なサトイモ科の植物が集められている。","type":"noun","meaning_category":"サトイモ科"},{"sentence":"Researchers are studying the unique pollination mechanisms found in certain members of the Araceae family.","translation":"研究者たちは、サトイモ科の一部の植物に見られる独特な受粉メカニズムを研究している。","type":"noun","meaning_category":"サトイモ科"}]}