{"word":"underlever","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(銃の)下部レバー式装填機構","english_definition":"A type of firearm action where a lever located beneath the barrel is used to cycle the action, ejecting a spent cartridge and chambering a new one.","examples":[{"sentence":"The rifle features an underlever action for smooth and rapid reloading.","translation":"そのライフル銃は、スムーズかつ迅速な再装填のために下部レバー式装填機構を備えている。"},{"sentence":"Underlever rifles are known for their accuracy and reliability.","translation":"下部レバー式ライフル銃は、その精度と信頼性で知られている。"}],"collocations":["underlever action","underlever rifle","underlever mechanism"],"synonyms":["lever-action"],"antonyms":[]}],"etymology":{"value":"'Under' + 'lever'. Describes the position of the lever in this type of firearm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌliːvər/","syllables":"un-der-le-ver"},"inflection":{"noun_plural":"underlevers"},"usage_notes":{"explanation":"The term 'underlever' specifically refers to the lever mechanism located beneath the barrel of a firearm. It is a less common action type compared to side lever or bolt-action rifles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a under-lever to open the door.","correct":"✓ He used an underlever rifle.","note":"'Underlever' refers to a specific type of firearm action, not a general lever. If referring to a general lever beneath something, describe its function."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underlever' is a technical term primarily used in the context of firearms, specifically referring to a type of lever-action mechanism. Understanding requires familiarity with firearm terminology."},"example_sentences":[{"sentence":"The hunter preferred the underlever rifle for its quick follow-up shots.","translation":"そのハンターは、素早い連続射撃ができるため、下部レバー式ライフル銃を好んだ。","type":"noun","meaning_category":"firearm action"},{"sentence":"The antique gun collection included a rare underlever model from the 19th century.","translation":"そのアンティーク銃コレクションには、19世紀の珍しい下部レバー式モデルが含まれていた。","type":"noun","meaning_category":"firearm action"}]}