{"word":"refrigerant","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"冷媒、冷却剤","english_definition":"A substance used in a refrigeration cycle, typically a fluid that absorbs heat from its surroundings as it evaporates at low temperatures and pressures, and releases heat as it condenses at higher temperatures and pressures.","examples":[{"sentence":"The refrigerant in the air conditioner needs to be recharged.","translation":"エアコンの冷媒を補充する必要があります。"},{"sentence":"New refrigerants are being developed to reduce environmental impact.","translation":"環境への影響を減らすために、新しい冷媒が開発されています。"}],"collocations":["refrigerant leak (冷媒漏れ)","refrigerant charge (冷媒充填量)","refrigerant recovery (冷媒回収)","refrigerant recycling (冷媒リサイクル)","CFC refrigerant (CFC冷媒)","HFC refrigerant (HFC冷媒)","natural refrigerant (自然冷媒)"],"synonyms":["coolant","cooling agent"],"antonyms":["heat source"]}],"etymology":{"value":"Derived from 'refrigerate' (to make cold) + '-ant' (a suffix indicating a substance or agent). The term reflects the substance's function in refrigeration systems.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfrɪdʒərənt/","syllables":"re-frig-er-ant"},"inflection":{"noun_plural":"refrigerants"},"usage_notes":{"explanation":"'Refrigerant' refers specifically to the working fluid used in refrigeration, air conditioning, and heat pump systems. It undergoes phase changes (evaporation and condensation) to transfer heat. Different refrigerants have varying environmental impacts (e.g., global warming potential), leading to the development of more environmentally friendly alternatives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The refrigerator uses freon as a refrigerant.","correct":"✓ The refrigerator uses a freon-based refrigerant.","note":"'Freon' is a brand name for a specific type of refrigerant. Use 'freon-based refrigerant' or specify the exact refrigerant if known."},{"incorrect":"✗ Add more coolant to the AC, it's low on refrigerant.","correct":"✓ Add more refrigerant to the AC, it's low.","note":"'Coolant' is a more general term for a cooling substance. In the context of air conditioning, 'refrigerant' is the more precise term."}],"priority":"★★☆"},"related_words":{"derivatives":["refrigerate (verb: 冷やす)","refrigeration (noun: 冷凍、冷蔵)","refrigerator (noun: 冷蔵庫)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Refrigerant' is a technical term used to describe the fluid in cooling systems like refrigerators and air conditioners that absorbs and releases heat to cool an area. It's important to use this term when discussing the specific substance used for cooling, as opposed to general cooling methods or other types of coolants."},"example_sentences":[{"sentence":"The technician checked the refrigerant levels in the chiller.","translation":"技術者はチラーの冷媒レベルをチェックしました。","type":"noun","meaning_category":"冷媒"},{"sentence":"Regulations are phasing out the use of ozone-depleting refrigerants.","translation":"規制により、オゾン層破壊物質である冷媒の使用が段階的に廃止されています。","type":"noun","meaning_category":"冷媒"},{"sentence":"Proper handling of refrigerants is essential to prevent environmental damage.","translation":"環境被害を防ぐためには、冷媒の適切な取り扱いが不可欠です。","type":"noun","meaning_category":"冷媒"}]}