{"word":"self-controller","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己制御装置、自動制御装置","english_definition":"A device or mechanism that automatically regulates or controls a system or process.","examples":[{"sentence":"The new furnace has a self-controller that adjusts the temperature automatically.","translation":"新しい暖炉には、温度を自動的に調整する自己制御装置が付いています。"},{"sentence":"The factory uses self-controllers to maintain consistent product quality.","translation":"その工場では、製品の品質を一定に保つために自己制御装置を使用しています。"}],"collocations":["automatic self-controller","temperature self-controller","process self-controller"],"synonyms":["automatic regulator","automatic controller","feedback controller"],"antonyms":["manual control"]},{"part_of_speech":"noun","definition":"自制心のある人、自己抑制力のある人","english_definition":"A person who has the ability to control their own emotions, desires, or behavior, especially in difficult situations.","examples":[{"sentence":"She is a self-controller and never loses her temper, even when provoked.","translation":"彼女は自制心のある人で、挑発されても決して怒りません。"},{"sentence":"He had to be a self-controller to resist the temptation.","translation":"彼は誘惑に打ち勝つために自制心を持たなければなりませんでした。"}],"collocations":["good self-controller","strong self-controller","disciplined self-controller"],"synonyms":["self-disciplined person","self-restrained person","controlled person"],"antonyms":["impulsive person","uncontrolled person"]}],"etymology":{"value":"The word is a compound of 'self' and 'controller', indicating a device or person that controls itself or something automatically.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.kənˈtroʊ.lər/","syllables":"self-con-trol-ler"},"inflection":{"noun_plural":"self-controllers"},"usage_notes":{"explanation":"The term 'self-controller' can refer to either a mechanical device that regulates a system automatically or a person who exhibits strong self-control. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The self-controller of the car broke down.","correct":"✓ The cruise control of the car broke down.","note":"For vehicles, 'cruise control' is more commonly used than 'self-controller' to describe the automatic speed control system."},{"incorrect":"✗ He is a good self-control.","correct":"✓ He has good self-control. / ✓ He is a good self-controller.","note":"'Self-control' is a noun referring to the ability to control oneself, while 'self-controller' is a noun referring to a person who possesses that ability."}],"priority":"★★☆"},"related_words":{"derivatives":["self-control (noun: 自制心、自己抑制)","control (noun/verb: 制御、支配、制御する、支配する)","controller (noun: 制御装置、制御者)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'self-controller' has two main meanings. It can refer to a device that automatically controls something, like the temperature in a room. It can also refer to a person who is very good at controlling their emotions and actions. The meaning depends on the context in which it is used. It is not a very common word, but it is useful for describing these specific concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The thermostat acts as a self-controller, maintaining a constant temperature in the building.","translation":"サーモスタットは自己制御装置として機能し、建物内の温度を一定に保ちます。","type":"noun","meaning_category":"自動制御装置"},{"sentence":"As a diplomat, she needed to be a self-controller to navigate the sensitive negotiations.","translation":"外交官として、彼女はデリケートな交渉を乗り切るために自制心のある人でなければなりませんでした。","type":"noun","meaning_category":"自制心のある人"},{"sentence":"The washing machine has a self-controller that regulates the water level and temperature.","translation":"洗濯機には、水位と温度を調整する自己制御装置が付いています。","type":"noun","meaning_category":"自動制御装置"},{"sentence":"He is known as a self-controller who never lets his emotions get the better of him.","translation":"彼は、感情に流されることのない自制心のある人として知られています。","type":"noun","meaning_category":"自制心のある人"}]}