{"word":"voluntarismo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 意志至上主義、意志主義","english_definition":"(philosophy) voluntarism; the doctrine that will is a fundamental or dominant factor in the individual or the universe.","examples":[{"sentence":"El voluntarismo es una corriente filosófica que enfatiza la importancia de la voluntad sobre el intelecto.","translation":"Voluntarism is a philosophical current that emphasizes the importance of will over intellect."}],"collocations":["voluntarismo psicológico (psychological voluntarism)","voluntarismo teológico (theological voluntarism)"],"synonyms":["voluntad (will)","volición (volition)"],"antonyms":["intelectualismo (intellectualism)","racionalismo (rationalism)"]},{"part_of_speech":"noun","definition":"(政治・社会) ボランタリズム、自発主義、任意主義","english_definition":"(politics, sociology) voluntarism; reliance on voluntary action, especially in the provision of social services.","examples":[{"sentence":"El voluntarismo en la prestación de servicios sociales puede ser complementario a la acción estatal.","translation":"Voluntarism in the provision of social services can be complementary to state action."}],"collocations":["acción voluntaria (voluntary action)","organizaciones de voluntariado (volunteer organizations)"],"synonyms":["voluntariado (volunteering)","altruismo (altruism)"],"antonyms":["obligación (obligation)","coerción (coercion)"]}],"etymology":{"value":"From Spanish 'voluntario' (volunteer) + '-ismo' (-ism).","priority":"★★☆"},"pronunciation":{"ipa":"/boluntaˈɾismo/","syllables":"bo-lun-ta-ris-mo"},"inflection":{"noun_plural":"voluntarismos"},"usage_notes":{"explanation":"The term 'voluntarismo' has two main meanings: one in philosophy, referring to the importance of will, and another in politics and sociology, referring to reliance on voluntary action. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El voluntarismo es siempre mejor que la acción estatal obligatoria.","correct":"El voluntarismo puede ser una forma efectiva de abordar ciertos problemas sociales, pero no siempre es superior a la acción estatal obligatoria.","note":"Voluntarism has advantages and disadvantages. It is not always superior to mandatory state action."}],"priority":"★★☆"},"related_words":{"derivatives":["voluntario (volunteer)","voluntariamente (voluntarily)"],"related_concepts":["libre albedrío (free will)","filantropía (philanthropy)"],"priority":"★★★"},"level_frequency":{"general_frequency":"Low frequency. It is a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Voluntarismo' is a term used in philosophy and social sciences. In philosophy, it refers to the idea that will is more important than reason. In social sciences, it refers to reliance on voluntary action, such as volunteering, to solve problems. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"El voluntarismo como filosofía moral sostiene que la voluntad es la base de la ética.","translation":"Voluntarism as a moral philosophy maintains that the will is the basis of ethics.","type":"noun","meaning_category":"philosophy"},{"sentence":"El voluntarismo es clave para muchas organizaciones sin fines de lucro.","translation":"Voluntarism is key to many non-profit organizations.","type":"noun","meaning_category":"politics/sociology"}]}