{"word":"disappearer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"失踪者、行方不明者","english_definition":"A person who has disappeared, especially one who is thought to have been secretly killed or imprisoned by a government or political organization.","examples":[{"sentence":"The families of the disappearers continue to seek justice.","translation":"失踪者の家族は正義を求め続けている。"},{"sentence":"Many disappearers were never found.","translation":"多くの失踪者は決して見つからなかった。"}],"collocations":["the disappearers of the regime","families of disappearers"],"synonyms":["missing person","vanished person"],"antonyms":["found person","returned person"]}],"etymology":{"value":"Derived from the verb 'disappear' (to cease to be visible) with the agentive suffix '-er' (denoting a person who performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsəˈpɪərə(r)/","syllables":"dis-a-ppear-er"},"inflection":{"noun_plural":"disappearers"},"usage_notes":{"explanation":"'Disappearer' typically refers to individuals who have vanished under suspicious circumstances, often implying involvement of state or political actors. The term carries a strong connotation of human rights violations and enforced disappearances.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a disappearer of his debts.","correct":"✓ He disappeared and left his debts.","note":"'Disappearer' refers to a person who has disappeared, not someone who avoids debts. Use 'disappeared' to describe someone who has vanished. "},{"incorrect":"✗ She is a disappearer from the party.","correct":"✓ She disappeared from the party.","note":"Again, 'disappearer' is a noun referring to the missing person. Use 'disappeared' to describe the act of vanishing."}],"priority":"★★☆"},"related_words":{"derivatives":["disappear (verb)","disappearance (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disappearer' is a specialized term, primarily used in contexts involving human rights, political repression, and historical accounts of forced disappearances. It is not commonly encountered in everyday language. Understanding the term requires awareness of the political and social implications associated with enforced disappearances. "},"example_sentences":[{"sentence":"The government was accused of being responsible for the disappearers.","translation":"政府は失踪者の責任を問われた。","type":"noun","meaning_category":"失踪者"},{"sentence":"Organizations are working to locate the remains of the disappearers.","translation":"団体は失踪者の遺体を発見するために活動している。","type":"noun","meaning_category":"失踪者"}]}