{"word":"socmanry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) 自由農民保有地、自由農民の身分","english_definition":"(historical) A tenure of land held by socage; the body of socmen.","examples":[{"sentence":"The socmanry was a significant class in medieval England.","translation":"ソックマンリーは中世イングランドにおいて重要な階級だった。"},{"sentence":"Land held in socmanry was subject to certain services.","translation":"ソックマンリーで保有された土地は、特定の奉仕義務を負っていた。"}],"collocations":["hold land in socmanry","socmanry tenure"],"synonyms":["free tenure","socage"],"antonyms":["villeinage","serfdom"]}],"etymology":{"value":"From socman + -ry. Socman comes from Old English socmann, from socn ‘jurisdiction, privilege’ + mann ‘man’.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɒkmənri","syllables":"soc-man-ry"},"inflection":{"noun_plural":"socmanries"},"usage_notes":{"explanation":"'Socmanry' refers to a type of land tenure in medieval England where land was held by socmen, who were free tenants. Unlike villeins, socmen were not tied to the land and had more freedom. The term also collectively refers to the body or class of socmen. It is a historical term and not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a socmanry.","correct":"✓ He was a socman.","note":"'Socmanry' refers to the land tenure or the collective body of socmen, not an individual. Use 'socman' to refer to an individual holding land in socage."}],"priority":"★☆☆"},"related_words":{"derivatives":["socman (noun: a free tenant holding land by socage)","socage (noun: a feudal tenure of land involving payment of rent or other nonmilitary service to a superior)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (historical term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Socmanry' is a historical term referring to a type of land tenure in medieval England. It is relevant to the study of English legal and social history. Understanding this term requires familiarity with feudal systems and landholding practices of the time. It is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The documents detailed the obligations of the **socmanry** to the lord of the manor.","translation":"その文書は、荘園領主に対するソックマンリーの義務を詳細に記述していた。","type":"noun","meaning_category":"historical land tenure"},{"sentence":"The **socmanry** enjoyed more freedoms than the villeins on the estate.","translation":"ソックマンリーは、荘園の農奴よりも多くの自由を享受していた。","type":"noun","meaning_category":"historical class of people"}]}