{"word":"chronologists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"年代学者、年代記編者","english_definition":"Plural form of chronologist: experts in determining the dates of events and arranging them in chronological order; those who study or write about chronology.","examples":[{"sentence":"The chronologists debated the exact date of the ancient battle.","translation":"年代学者たちは古代の戦いの正確な日付について議論した。"},{"sentence":"Several chronologists have contributed to the comprehensive timeline of world history.","translation":"数人の年代学者が世界史の包括的な年表作成に貢献している。"}],"collocations":["ancient chronologists","modern chronologists","leading chronologists","historical chronologists"],"synonyms":["historians","annalists","timekeepers","chroniclers"],"antonyms":[]}],"etymology":{"value":"From 'chronology' (from Greek 'chronos' meaning time, and 'logia' meaning study of) + '-ist' (suffix denoting a person who studies or is an expert in a particular field).","priority":"★★☆"},"pronunciation":{"ipa":"/krəˈnɒlədʒɪsts/","syllables":"chro-nol-o-gists"},"inflection":{"noun_plural":"chronologists"},"usage_notes":{"explanation":"'Chronologists' refers specifically to multiple individuals who are experts in chronology. The term implies a scholarly or academic approach to understanding and ordering historical events. It is distinct from 'historians,' though the roles often overlap, as historians also use chronological information.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chronologist are meeting to discuss the timeline.","correct":"✓ The chronologists are meeting to discuss the timeline.","note":"'Chronologists' is plural, so it requires a plural verb ('are')."},{"incorrect":"✗ He is a chronologist of the event.","correct":"✓ He is a chronologist studying the event. / ✓ He is a chronologist of the period.","note":"One is a chronologist *studying* an event, or a chronologist *of* a period."}],"priority":"★★☆"},"related_words":{"derivatives":["chronologist","chronological","chronology","chronometry"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'chronologists' is a specialized term used in historical and academic contexts. It refers to experts who study and establish the correct dates and sequence of past events. Understanding this word requires familiarity with the concept of chronology and an interest in history or related fields. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The team of **chronologists** meticulously examined the ancient scrolls to determine their age.","translation":"年代学者チームは、古代の巻物の年代を特定するために細心の注意を払って調べた。","type":"noun","meaning_category":"年代学者"},{"sentence":"**Chronologists** often rely on carbon dating and other scientific methods to verify historical timelines.","translation":"年代学者は、歴史的な年表を検証するために、放射性炭素年代測定やその他の科学的方法に頼ることが多い。","type":"noun","meaning_category":"年代学者"}]}