{"word":"rollways","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国で歴史的な用法) 丸太を一時的に積み上げておく場所、特に川岸や水辺の近くで、水運のために丸太を転がり落とせるようにした場所。","english_definition":"(chiefly US, historical) A place where logs are temporarily piled up, especially near a riverbank or waterfront, so that they can be rolled into the water for transportation.","examples":[{"sentence":"The lumberjacks built rollways along the river to facilitate the transport of logs to the sawmill.","translation":"木こりたちは、製材所への丸太の輸送を容易にするために、川沿いにロールウェイズを建設した。"},{"sentence":"The rollways were essential for the logging industry in the 19th century.","translation":"ロールウェイズは、19世紀の林業にとって不可欠だった。"}],"collocations":["build rollways","logging rollways","river rollways"],"synonyms":["log landing","log deck"],"antonyms":[]}],"etymology":{"value":"「roll」と「way」の複合語。丸太を転がす道、または丸太を転がして積み上げる場所を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈroʊlˌweɪz/","syllables":"roll-ways"},"inflection":{"noun_plural":"rollways"},"usage_notes":{"explanation":"「rollways」は、主にアメリカ合衆国で、歴史的な文脈で使用される単語です。19世紀から20世紀初頭にかけての木材産業において、伐採された丸太を川や湖に運び出すために一時的に集積しておく場所を指します。水運を利用して丸太を運ぶ際に、効率的に丸太を水面に転がり落とせるように、傾斜がつけられた場所であることが特徴です。現代では、この言葉はあまり一般的ではありませんが、歴史的な文献や博物館などで見かけることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rollway was used for cars.","correct":"✓ The rollway was used for logs.","note":"ロールウェイズは丸太を運ぶために使われた場所であり、車などの他のものを運ぶために使われることはありません。"},{"incorrect":"✗ Rollways are still commonly used in modern logging.","correct":"✓ Rollways were commonly used in historical logging.","note":"ロールウェイズは現代の林業ではあまり使われず、歴史的な林業で使用されていました。"}],"priority":"★☆☆"},"related_words":{"derivatives":["rollway (単数形)"],"phrasal_verbs":[],"related_terms":["lumberjack","logging","sawmill","log boom","river drive"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史的な用語のため、CEFRレベルは該当しない)","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**rollways**」は、現代英語ではあまり一般的ではない専門用語です。主にアメリカの歴史的な林業の文脈で使用され、伐採された丸太を水運で運ぶために、一時的に集積しておく場所を指します。この場所は、丸太を川や湖に転がり落とせるように傾斜がつけられているのが特徴です。この単語を理解するには、19世紀から20世紀初頭のアメリカの林業の歴史的背景を知っておく必要があります。現代の一般的な会話や文章ではほとんど見かけることはありません。"},"example_sentences":[{"sentence":"The old photographs showed lumberjacks working at the **rollways**, preparing the logs for the spring river drive.","translation":"古い写真には、春の川での丸太流送に備えて、木こりたちがロールウェイズで作業している様子が写っていた。","type":"noun","meaning_category":"丸太の集積場所"},{"sentence":"The **rollways** were strategically located along the river to minimize the distance the logs had to be hauled.","translation":"ロールウェイズは、丸太を運ぶ距離を最小限にするために、川沿いに戦略的に配置されていた。","type":"noun","meaning_category":"丸太の集積場所"}]}