{"word":"Overrationalization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰な合理化、理屈をこねること、もっともらしい理由付け","english_definition":"The act of attempting to explain or justify attitudes, behaviors, or feelings with logical reasons, even if these are not the real reasons. It often involves creating a superficially plausible explanation to conceal the true underlying motives or causes.","examples":[{"sentence":"His overrationalization of the company's failures prevented him from seeing the real problems.","translation":"彼の会社の失敗に対する過剰な合理化は、彼が本当の問題点を見ることを妨げた。"},{"sentence":"She engaged in overrationalization to justify her decision, even though she knew it was wrong.","translation":"彼女は自分の決定を正当化するために、それが間違っていると分かっていながらも、理屈をこねた。"},{"sentence":"The therapist helped him recognize his patterns of overrationalization and address the underlying emotional issues.","translation":"セラピストは、彼が過剰な合理化のパターンを認識し、根本的な感情的な問題に取り組むのを助けた。"}],"collocations":["engage in overrationalization (過剰な合理化を行う)","patterns of overrationalization (過剰な合理化のパターン)","defensive overrationalization (防御的な過剰合理化)","avoid overrationalization (過剰な合理化を避ける)","the dangers of overrationalization (過剰な合理化の危険性)"],"synonyms":["rationalization","intellectualization","justification","excuse-making","sophistry"],"antonyms":["authenticity","genuineness","sincerity","emotional honesty","self-awareness"]}],"etymology":{"value":"\"Over-\" (過剰な) + \"rationalization\" (合理化) から構成される。 \"Rationalization\" は、心理学において、無意識的な動機や感情を、社会的に受け入れられる、または論理的に見える理由で説明しようとする防衛機制を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˌræʃənəlɪˈzeɪʃən/","syllables":"o-ver-ra-tion-a-li-za-tion"},"inflection":{"noun_plural":"Overrationalizations"},"usage_notes":{"explanation":"\"Overrationalization\" は、心理学的な文脈でよく使用される言葉で、特に防衛機制や認知バイアスについて議論する際に現れます。 この言葉は、人が自分の行動、感情、または信念に対する真の理由を認識または受け入れることができない場合に、もっともらしい、しかし実際には不正確な説明を提供することを指します。これは、自己欺瞞の一形態であり、人が自分の行動の責任を回避したり、自己イメージを維持したりするために使用されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He overrationalized the problem by ignoring the facts.","correct":"✓ He overrationalized his actions by ignoring the facts.","note":"\"Overrationalize\" は、行動や決定を合理化する際に使われることが多いです。問題を「overrationalize」するのではなく、問題に対する自分の行動や態度を合理化すると表現するのがより適切です。"},{"incorrect":"✗ Overrationalization is always a good thing because it helps you think logically.","correct":"✓ Overrationalization can be problematic because it can prevent you from seeing the truth.","note":"Overrationalization は、必ずしも良いものではありません。論理的に考えることは重要ですが、過剰な合理化は、真実を歪め、現実から目をそらす可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["overrationalize (verb)","rationalize (verb)","rationalization (noun)","rational (adjective)","irrational (adjective)"],"phrases":["cognitive dissonance","defense mechanism","self-deception","confirmation bias","motivated reasoning"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overrationalization\" は、自分の行動や考えの本当の理由を隠すために、もっともらしい理由を過剰に作り出すことを意味する専門的な言葉です。心理学や社会学でよく使われ、人が自分の行動を正当化しようとする時に、無意識のうちに行われることがあります。例えば、本当は欲しかったから買った物を、「必要だったから」と理屈をつけて説明するような場合です。この言葉を理解するには、ある行動の背後にある本当の理由と、後から付け加えられた理由を区別することが重要です。"},"example_sentences":[{"sentence":"The politician's overrationalization of his controversial policies failed to convince the public.","translation":"その政治家の物議を醸す政策に対する過剰な合理化は、大衆を納得させることができなかった。","type":"general","meaning_category":"justification"},{"sentence":"Her overrationalization of her fear of flying prevented her from seeking help.","translation":"彼女の飛行機恐怖症に対する過剰な合理化は、彼女が助けを求めることを妨げた。","type":"psychology","meaning_category":"defense mechanism"},{"sentence":"The company's overrationalization of its environmental impact led to a public relations disaster.","translation":"その会社の環境への影響に対する過剰な合理化は、広報の惨事を招いた。","type":"business","meaning_category":"excuse-making"}]}