{"word":"aircraftswomen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性航空機整備士、女性航空機搭乗員（aircraftswomanの複数形）","english_definition":"Plural of aircraftswoman: female members of an aircraft crew or female mechanics working on aircraft.","examples":[{"sentence":"The aircraftswomen performed a thorough inspection of the engine.","translation":"女性航空機整備士たちはエンジンの徹底的な検査を行った。"},{"sentence":"Several aircraftswomen were honored for their bravery during the rescue mission.","translation":"数名の女性航空機搭乗員が救助作戦中の勇敢さを称えられた。"}],"collocations":["aircraftswomen mechanics","aircraftswomen pilots","aircraftswomen engineers"],"synonyms":["female aviators","female aircrew","female aircraft mechanics"],"antonyms":["aircraftsmen"],"notes":"This term is becoming less common, with more gender-neutral terms like 'aviation professionals' or 'aircraft personnel' being preferred."}],"etymology":{"value":"Formed by combining \"aircraft\" with \"women,\" the plural of \"woman.\" It directly indicates female individuals involved with aircraft.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɛːrkræftˌswɪmɪn","syllables":"air-crafts-wom-en"},"inflection":{"noun_plural":"aircraftswomen"},"usage_notes":{"explanation":"The term 'aircraftswomen' specifically refers to a group of female individuals working with aircraft, either as crew members or mechanics. However, due to the increasing preference for gender-neutral language, terms like 'aircraft personnel' or 'aviation professionals' are more commonly used in contemporary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ aircraftswomans","correct":"✓ aircraftswomen","note":"The correct plural form is 'aircraftswomen,' not 'aircraftswomans'."},{"incorrect":"✗ aircraftwomen","correct":"✓ aircraftswomen","note":"While 'aircraftwomen' might seem logical, the established plural form is 'aircraftswomen'."}],"priority":"★★☆"},"related_words":{"derivatives":["aircraftswoman"],"related_terms":["aircraftsman","airman","airwoman","aviator","pilot","mechanic","engineer"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. The term is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'aircraftswomen' is a specific plural noun referring to multiple female individuals who work with or operate aircraft, either as crew members or in maintenance roles. It's a relatively uncommon term, with more gender-neutral alternatives being preferred in contemporary usage. Understanding the term requires familiarity with the construction of compound nouns and gendered occupational terms."},"example_sentences":[{"sentence":"The aircraftswomen meticulously inspected the aircraft before takeoff.","translation":"女性航空機整備士たちは離陸前に航空機を入念に検査した。","type":"noun","meaning_category":"女性航空機整備士"},{"sentence":"Several aircraftswomen received awards for their outstanding contributions to aviation.","translation":"数名の女性航空機搭乗員が航空業界への傑出した貢献により表彰された。","type":"noun","meaning_category":"女性航空機搭乗員"}]}