{"word":"incapacitatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"無力化するほどに、活動不能にするほどに","english_definition":"in a way that causes someone to be unable to do things normally; to such a degree that someone is deprived of strength or power.","examples":[{"sentence":"The pain was incapacitatingly severe, preventing her from even getting out of bed.","translation":"その痛みは無力化するほどひどく、彼女はベッドから起き上がることもできなかった。"},{"sentence":"The illness affected him incapacitatingly, forcing him to take a leave of absence from work.","translation":"その病気は彼を活動不能にするほどに蝕み、仕事を休職せざるを得なくなった。"}],"collocations":["incapacitatingly painful","incapacitatingly debilitating","incapacitatingly severe"],"synonyms":["debilitatingly","cripplingly","paralyzingly","disablingly"],"antonyms":["enablingly","empoweringly"]}],"etymology":{"value":"Derived from the verb 'incapacitate', meaning 'to deprive of strength or power', with the addition of the suffix '-ing' to form the present participle or gerund, and '-ly' to convert it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnkəˈpæsɪteɪtɪŋli/","syllables":"in-ca-pac-i-tat-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Incapacitatingly' is used to describe the extent or degree to which something causes a person to be unable to function normally. It emphasizes the severity of the condition or effect. It is often used in the context of pain, illness, or injury.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flu was incapacitate.","correct":"✓ The flu was incapacitating.","note":"'Incapacitate' is a verb. The adjective form 'incapacitating' should be used to describe the flu's effect."},{"incorrect":"✗ He felt incapacitatingly after the accident.","correct":"✓ He felt incapacitated after the accident.","note":"'Incapacitated' is the correct adjective form to describe someone who has been made unable to function normally."}],"priority":"★☆☆"},"related_words":{"derivatives":["incapacitate (verb)","incapacitated (adjective)","incapacitating (adjective)","incapacity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'incapacitatingly' is an advanced term used to describe something that severely limits or prevents normal functioning. It is often used in formal or technical contexts, such as medical or legal discussions, to emphasize the disabling nature of a condition or event. Understanding this word requires a strong vocabulary and the ability to grasp nuanced meanings. "},"example_sentences":[{"sentence":"The migraine was incapacitatingly intense, forcing her to cancel all her appointments.","translation":"その偏頭痛は無力化するほど強烈で、彼女はすべての予定をキャンセルせざるを得なかった。","type":"adverb","meaning_category":"intensity"},{"sentence":"He was incapacitatingly injured in the accident and required extensive rehabilitation.","translation":"彼はその事故で活動不能になるほどに負傷し、広範囲なリハビリを必要とした。","type":"adverb","meaning_category":"injury"},{"sentence":"The side effects of the medication were incapacitatingly severe, making it difficult to continue the treatment.","translation":"その薬の副作用は活動不能になるほどひどく、治療を続けるのが困難になった。","type":"adverb","meaning_category":"side effects"}]}