{"word":"humanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒューマニズム、人道主義、人文主義","english_definition":"A philosophical stance that emphasizes the value and agency of human beings, individually and collectively, and generally prefers critical thinking and evidence (rationalism, empiricism) over acceptance of dogma or superstition.","examples":[{"sentence":"Humanism emphasizes reason and ethics over supernatural beliefs.","translation":"ヒューマニズムは、超自然的な信念よりも理性と倫理を重視します。"},{"sentence":"The Renaissance was a period of renewed interest in humanism.","translation":"ルネサンスは、ヒューマニズムへの関心が再び高まった時代でした。"},{"sentence":"Modern humanism seeks to improve human welfare through science and technology.","translation":"現代のヒューマニズムは、科学技術を通じて人間の福祉を向上させようとしています。"}],"collocations":["secular humanism (世俗的ヒューマニズム)","religious humanism (宗教的ヒューマニズム)","Renaissance humanism (ルネサンス・ヒューマニズム)","atheistic humanism (無神論的ヒューマニズム)","ethical humanism (倫理的ヒューマニズム)","humanist philosophy (ヒューマニズム哲学)","humanist values (ヒューマニズムの価値観)"],"synonyms":["humanitarianism","rationalism","secularism","liberalism","philanthropy"],"antonyms":["theism","dogmatism","superstition","authoritarianism"]},{"part_of_speech":"noun","definition":"(特にルネサンス期の)人文主義、古典研究","english_definition":"A Renaissance cultural movement that turned away from medieval scholasticism and revived interest in ancient Greek and Roman thought.","examples":[{"sentence":"Renaissance humanism focused on the study of classical literature and rhetoric.","translation":"ルネサンス・ヒューマニズムは、古典文学と修辞学の研究に焦点を当てました。"},{"sentence":"Humanism played a key role in the development of modern education.","translation":"ヒューマニズムは、近代教育の発展に重要な役割を果たしました。"},{"sentence":"Erasmus was a leading figure in the humanist movement.","translation":"エラスムスは、ヒューマニズム運動の主要な人物でした。"}],"collocations":["classical humanism (古典的人文主義)","literary humanism (文学的人文主義)","civic humanism (市民的人文主義)","Christian humanism (キリスト教人文主義)","humanist scholar (人文主義学者)","humanist education (人文主義教育)"],"synonyms":["classical scholarship","Renaissance learning"],"antonyms":["scholasticism","medievalism"]}],"etymology":{"value":"Derived from the Latin word 'humanus,' meaning 'human.' The term gained prominence during the Renaissance to describe the intellectual movement that emphasized classical learning and human values.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhjuːmənɪzəm/","syllables":"hu-man-ism","audio_url":"https://example.com/humanism.mp3"},"inflection":{"notes":"Noun, singular only (usually)."},"usage_notes":{"explanation":"'Humanism' can refer to two main concepts: 1) A philosophical and ethical stance emphasizing human agency, reason, and ethics, often rejecting supernatural beliefs. 2) The Renaissance intellectual movement focused on classical learning. Context is crucial to determine the intended meaning. The first definition is broader and more contemporary, while the second is historically specific.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Humanism is about being nice to everyone.","correct":"✓ Humanism is a philosophical stance that values human reason and ethics.","note":"While humanists often value kindness, humanism is a broader philosophical framework than simply being nice."},{"incorrect":"✗ Humanism is the same as atheism.","correct":"✓ While many humanists are atheists, humanism is not inherently atheistic.","note":"Humanism emphasizes reason and ethics, which can be compatible with some religious beliefs."},{"incorrect":"✗ Humanism started in the 20th century.","correct":"✓ Humanism has roots in ancient philosophy and experienced a revival during the Renaissance.","note":"While modern humanism is a 20th-century development, the core ideas have a longer history."}],"priority":"★★☆"},"related_words":{"derivatives":["humanist (noun/adjective)","humanistic (adjective)","humanistically (adverb)"],"phrases":["humanist manifesto","human rights","human potential","human condition"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'humanism' refers to a complex set of ideas. It generally means a way of thinking that puts human beings and their values at the center, often emphasizing reason, ethics, and the importance of individual freedom and responsibility. It can also refer to a specific period in history, the Renaissance, when people became very interested in classical Greek and Roman ideas about human life and culture. Understanding the context is important to know which meaning is intended."},"example_sentences":[{"sentence":"Secular **humanism** promotes ethical principles based on reason and empathy.","translation":"世俗的ヒューマニズムは、理性と共感に基づく倫理原則を推進します。","type":"noun","meaning_category":"人道主義"},{"sentence":"The study of classical texts was central to **humanism** during the Renaissance.","translation":"古典文献の研究は、ルネサンス期の人文主義の中心でした。","type":"noun","meaning_category":"人文主義"},{"sentence":"**Humanism** emphasizes the importance of critical thinking and evidence-based decision-making.","translation":"ヒューマニズムは、批判的思考と証拠に基づいた意思決定の重要性を強調します。","type":"noun","meaning_category":"人道主義"},{"sentence":"Many **humanists** advocate for social justice and equality.","translation":"多くのヒューマニストは、社会正義と平等を提唱しています。","type":"related word (humanist)","meaning_category":"人道主義者"}]}