{"word":"Resultingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"結果として、その結果、したがって","english_definition":"As a result; consequently; therefore.","examples":[{"sentence":"The company invested heavily in research and development; resultingly, they saw a significant increase in profits.","translation":"その会社は研究開発に多額の投資を行った。結果として、利益が大幅に増加した。"},{"sentence":"The weather was unusually warm; resultingly, the crops matured earlier than expected.","translation":"気候が異常に暖かかった。その結果、作物は予想よりも早く成熟した。"},{"sentence":"He studied diligently; resultingly, he achieved excellent grades.","translation":"彼は熱心に勉強した。その結果、優秀な成績を収めた。"}],"collocations":["resultingly, the profits increased (結果として、利益が増加した)","resultingly, the crops matured (結果として、作物が成熟した)","resultingly, he achieved (結果として、彼は達成した)"],"synonyms":["consequently","therefore","hence","thus","accordingly","subsequently"],"antonyms":["initially","originally","primarily"]}],"etymology":{"value":"'Result' + '-ing' (present participle suffix) + '-ly' (adverbial suffix). Derived from the verb 'result', meaning 'to proceed or arise as a consequence, effect, or conclusion'.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzʌltɪŋli/","syllables":"re-sult-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Resultingly' is a formal adverb used to indicate that something is a direct consequence or outcome of a preceding action or situation. It is often used in academic or professional writing to establish a clear cause-and-effect relationship. While grammatically correct, it's less common than synonyms like 'consequently', 'therefore', or 'as a result'. Using 'resultingly' can sometimes sound overly formal or stilted, so it's important to consider the context and audience when choosing whether to use it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The team played badly, resultingly of the rain.","correct":"✓ The team played badly, as a result of the rain. / ✓ The team played badly; resultingly, they lost the game.","note":"'Resultingly' is an adverb and should not be used with 'of'. Use 'as a result of' or restructure the sentence to use 'resultingly' correctly."},{"incorrect":"✗ Resultingly, that's why he was late.","correct":"✓ Resultingly, he was late. / ✓ That's why he was late.","note":"'Resultingly' already implies a cause-and-effect relationship, so phrases like 'that's why' are redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["result (noun, verb)","resulting (adjective)"],"phrases":["as a result","with the result that"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. More common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resultingly' is a formal word that means 'as a result' or 'consequently'. It's used to show that something happened because of something else. You'll find it more often in formal writing or academic papers than in everyday conversation. It's important to use it correctly to avoid sounding awkward. Consider using more common alternatives like 'therefore' or 'as a result' in less formal contexts."},"example_sentences":[{"sentence":"The experiment was carefully controlled; resultingly, the data obtained was highly reliable.","translation":"実験は慎重に管理された。結果として、得られたデータは非常に信頼性が高かった。","type":"general","meaning_category":"consequence"},{"sentence":"The company implemented new safety measures; resultingly, workplace accidents decreased significantly.","translation":"会社は新しい安全対策を実施した。結果として、職場での事故が大幅に減少した。","type":"business","meaning_category":"outcome"},{"sentence":"The athlete trained rigorously; resultingly, she achieved a personal best in the competition.","translation":"その選手は厳しくトレーニングを行った。結果として、彼女は競技会で自己最高記録を達成した。","type":"sports","meaning_category":"achievement"}]}