{"word":"autosomatognostic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自己身体失認の、自分の体の部位を認識できない","english_definition":"Relating to or characterized by autosomatognosia, a condition in which a person is unable to recognize or identify parts of their own body.","examples":[{"sentence":"The patient exhibited autosomatognostic symptoms after the stroke.","translation":"その患者は脳卒中後、自己身体失認の症状を示した。"},{"sentence":"Autosomatognostic deficits can significantly impact a person's ability to perform daily tasks.","translation":"自己身体失認の欠損は、人が日常的なタスクを実行する能力に大きな影響を与える可能性がある。"}],"collocations":["autosomatognostic deficit (自己身体失認の欠損)","autosomatognostic symptoms (自己身体失認の症状)","autosomatognostic disorder (自己身体失認症)"],"synonyms":["body agnosia","somatoparaphrenia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'auto' (self), 'somato' (body), 'gnosis' (knowledge), and the suffix '-ic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtoʊˌsoʊmætoʊɡˈnɒstɪk/","syllables":"au-to-so-ma-to-gnos-tic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Autosomatognostic' is a highly specialized term used in neurology and neuropsychology to describe conditions related to the inability to recognize one's own body parts. It is often used in the context of brain damage or neurological disorders affecting body awareness and spatial orientation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was autosomatognostic of the situation.","correct":"✓ The patient exhibited autosomatognostic symptoms related to their left arm.","note":"'Autosomatognostic' relates specifically to the recognition of one's own body parts, not general awareness of situations."}],"priority":"★★☆"},"related_words":{"derivatives":["autosomatognosia (noun: 自己身体失認)"],"phrasal_verbs":[],"related_medical_terms":["agnosia","somatoparaphrenia","neurology","neuropsychology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Autosomatognostic' is a technical term used in medical and psychological contexts, specifically in neurology and neuropsychology. It describes conditions where individuals have difficulty recognizing or identifying parts of their own body. Due to its highly specialized nature, it is not commonly encountered outside of these fields."},"example_sentences":[{"sentence":"The neurologist assessed the patient for autosomatognostic impairments.","translation":"神経科医は、患者の自己身体失認の障害について評価した。","type":"adjective","meaning_category":"medical"},{"sentence":"Autosomatognostic conditions often require extensive rehabilitation.","translation":"自己身体失認の状態は、しばしば広範囲なリハビリテーションを必要とする。","type":"adjective","meaning_category":"medical"}]}