{"word":"disseisee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 不法占拠された人、不動産を不法に奪われた人","english_definition":"(law) A person who has been wrongfully dispossessed of land or property.","examples":[{"sentence":"The disseisee sought legal recourse to reclaim their land.","translation":"不動産を不法に奪われた人は、土地を取り戻すために法的手段を求めた。"},{"sentence":"The rights of the disseisee are protected under property law.","translation":"不法占拠された人の権利は、財産法の下で保護されている。"}],"collocations":["rights of the disseisee","remedies for the disseisee"],"synonyms":["ousted owner","dispossessed person"],"antonyms":["disseisor"]}],"etymology":{"value":"From the verb 'disseise,' which comes from Old French 'disseisir,' meaning 'to dispossess.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪsɪˈziː/","syllables":"dis-si-see"},"inflection":{"noun_plural":"disseisees"},"usage_notes":{"explanation":"'Disseisee' is a legal term referring specifically to the person who has been wrongfully deprived of possession of real property. It is often used in contrast to 'disseisor,' who is the person committing the act of disseisin (wrongful dispossession).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disseisee was happy to lose their land.","correct":"✓ The disseisee was unhappy to lose their land.","note":"A disseisee is someone who has been wrongfully dispossessed, so they would not be happy about it."}],"priority":"★★☆"},"related_words":{"derivatives":["disseise (verb)","disseisin (noun)","disseisor (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disseisee' is a highly specialized legal term. Understanding its meaning requires familiarity with property law concepts, particularly those related to possession and ownership of real property. The term is rarely used outside of legal contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The court recognized the individual as the rightful disseisee of the property.","translation":"裁判所はその個人を、その不動産の正当な不法占拠された人として認めた。","type":"noun","meaning_category":"不法占拠された人"},{"sentence":"As the disseisee, she had the right to file a claim for the return of her land.","translation":"不法占拠された人として、彼女は自分の土地の返還を請求する権利を有していた。","type":"noun","meaning_category":"不法占拠された人"}]}