{"word":"highlighter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"蛍光ペン、ハイライター","english_definition":"a pen with translucent, brightly colored ink used to mark words or passages in a text.","examples":[{"sentence":"She used a yellow highlighter to mark the important points in the document.","translation":"彼女は黄色い蛍光ペンを使って、書類の重要な箇所に印をつけた。"},{"sentence":"He always carries a highlighter when studying.","translation":"彼は勉強するときはいつも蛍光ペンを持ち歩いている。"},{"sentence":"The textbook is full of highlighter marks.","translation":"その教科書は蛍光ペンの跡でいっぱいだ。"}],"collocations":["yellow highlighter","pink highlighter","blue highlighter","green highlighter","use a highlighter","highlight text","highlighter pen","fluorescent highlighter"],"synonyms":["marker pen","felt-tip pen"],"antonyms":[]},{"part_of_speech":"noun","definition":"(化粧品の)ハイライター","english_definition":"a cosmetic product used to accentuate certain areas of the face, giving a radiant or glowing effect.","examples":[{"sentence":"She applied highlighter to her cheekbones and brow bone.","translation":"彼女は頬骨と眉骨にハイライターを塗った。"},{"sentence":"Use a brush to blend the highlighter for a natural look.","translation":"ブラシを使ってハイライターをぼかすと、自然な仕上がりになる。"},{"sentence":"The makeup artist used a shimmering highlighter to enhance her features.","translation":"メイクアップアーティストは、彼女の顔立ちを引き立てるために、きらめくハイライターを使った。"}],"collocations":["liquid highlighter","powder highlighter","cream highlighter","apply highlighter","blend highlighter","shimmering highlighter","matte highlighter"],"synonyms":["illuminator","luminizer"],"antonyms":[]}],"etymology":{"value":"The word 'highlighter' is derived from the verb 'highlight,' which means to give prominence to something. The suffix '-er' is added to indicate an agent or instrument that performs the action of highlighting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaɪˌlaɪtər/","syllables":"high-light-er"},"inflection":{"noun_plural":"highlighters"},"usage_notes":{"explanation":"The term 'highlighter' primarily refers to a type of pen used to mark text with bright, translucent ink. However, it can also refer to a cosmetic product used to enhance the appearance of the face. The context usually makes it clear which meaning is intended. When referring to the pen, it's often used in academic or professional settings for studying or marking important information. When referring to cosmetics, it's used in the context of makeup and beauty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I highlighted the book with a marker.","correct":"✓ I highlighted the book with a highlighter.","note":"While a marker can be used to highlight, the term 'highlighter' specifically refers to the pen designed for this purpose with translucent ink."},{"incorrect":"✗ She used a highlighter on her eyes.","correct":"✓ She used eyeshadow on her eyes. / ✓ She used highlighter on her brow bone.","note":"Highlighter (cosmetic) is typically applied to the cheekbones, brow bone, nose bridge, or cupid's bow, not directly on the eyelids, where eyeshadow is more common."}],"priority":"★★☆"},"related_words":{"derivatives":["highlight (verb, noun)","highlighted (adjective)"],"phrasal_verbs":[],"related_terms":["marker","pen","cosmetics","makeup","shimmer","glow"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Highlighter' is a word that refers to a pen used to mark important parts of text with bright, see-through color. It can also refer to a type of makeup that makes parts of your face look brighter. The first meaning is more common in school or office settings, while the second is used when talking about makeup.","priority":"★★★"},"example_sentences":[{"sentence":"He used a yellow **highlighter** to emphasize the key points in the article.","translation":"彼は黄色い蛍光ペンを使って、記事の要点を強調した。","type":"noun","meaning_category":"蛍光ペン"},{"sentence":"She applied **highlighter** to her cheekbones to give her face a radiant glow.","translation":"彼女は顔に輝きを与えるために、頬骨にハイライターを塗った。","type":"noun","meaning_category":"化粧品"}]}