{"word":"prilled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学物質が)粒状化された、造粒された","english_definition":"(of a chemical substance) formed into small spherical aggregates or granules.","examples":[{"sentence":"Prilled urea is easier to handle than powdered urea.","translation":"粒状化された尿素は、粉末状の尿素よりも扱いやすい。"},{"sentence":"The fertilizer is available in prilled form for easy spreading.","translation":"その肥料は、散布しやすいように粒状化された形で入手できる。"}],"collocations":["prilled urea","prilled ammonium nitrate","prilled fertilizer"],"synonyms":["granulated","pelletized","agglomerated"],"antonyms":["powdered","pulverized"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(化学物質を)粒状化する、造粒する","english_definition":"to form (a chemical substance) into small spherical aggregates or granules.","examples":[{"sentence":"The molten material is prilled by spraying it into a cooling tower.","translation":"溶融した材料は、冷却塔に噴霧されることによって粒状化される。"},{"sentence":"The company prills the product to improve its flowability.","translation":"その会社は、製品の流動性を向上させるために粒状化する。"}],"collocations":["prill urea","prill ammonium nitrate"],"synonyms":["granulate","pelletize","agglomerate"],"antonyms":["pulverize","powder"]}],"etymology":{"value":"Derived from the noun 'prill,' referring to a small globule or bead. The verb 'to prill' and the adjective 'prilled' describe the process and state of being formed into such globules.","priority":"★★☆"},"pronunciation":{"ipa":"/prɪld/","syllables":"prilled"},"inflection":{"verb_forms":{"present_simple":["prill","prills"],"past_simple":"prilled","past_participle":"prilled","present_participle":"prilling"},"adjective_forms":{}},"usage_notes":{"explanation":"'Prilled' is a technical term primarily used in chemistry, agriculture, and manufacturing to describe substances that have been formed into small, spherical granules. This process, known as prilling, improves the handling, flowability, and application of the material. The term is most commonly associated with fertilizers (e.g., urea, ammonium nitrate) but can also apply to other chemical compounds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prilled water is easy to pour.","correct":"✓ The granulated material is easy to pour.","note":"'Prilled' is typically used for chemical substances, not for water. Use 'granulated' or a more general term like 'material' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["prill (noun: a small globule or bead)","prilling (noun: the process of forming prills)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'prilled' is a specialized adjective and verb used in technical contexts, particularly in chemistry, agriculture, and manufacturing. It describes the process of forming a substance into small, spherical granules (prills) to improve its handling and application. Due to its specific usage, it is not commonly encountered in general language. Understanding this term requires familiarity with technical vocabulary related to chemical processes and material science."},"example_sentences":[{"sentence":"The **prilled** sulfur is easier to handle and less dusty than powdered sulfur.","translation":"粒状化された硫黄は、粉末状の硫黄よりも扱いやすく、粉塵も少ない。","type":"adjective","meaning_category":"粒状化された"},{"sentence":"The company **prilled** the molten plastic to create small beads for injection molding.","translation":"その会社は、射出成形用の小さなビーズを作るために、溶融したプラスチックを粒状化した。","type":"verb","meaning_category":"粒状化する"}]}