{"word":"sectionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分離主義者、地方主義者、党派主義者","english_definition":"An advocate of sectionalism; one who supports or promotes the interests of a particular section or region of a country, often at the expense of the nation as a whole; a separatist.","examples":[{"sentence":"The South was accused of being sectionist in the years leading up to the Civil War.","translation":"南北戦争に至るまでの数年間、南部は分離主義者であると非難された。"},{"sentence":"He criticized the politician for appealing to sectionist sentiments.","translation":"彼は政治家が地方主義的な感情に訴えていると批判した。"}],"collocations":["sectionist policies","sectionist rhetoric","extreme sectionist"],"synonyms":["separatist","regionalist","factionalist","partisan"],"antonyms":["nationalist","unionist","integrationist"]},{"part_of_speech":"adjective","definition":"分離主義の、地方主義の、党派主義の","english_definition":"Relating to or characterized by sectionalism; promoting the interests of a particular section or region.","examples":[{"sentence":"The newspaper published a sectionist editorial.","translation":"その新聞は地方主義的な社説を掲載した。"},{"sentence":"Sectionist tendencies were growing in the region.","translation":"その地域では分離主義的な傾向が強まっていた。"}],"collocations":["sectionist agenda","sectionist movement","sectionist views"],"synonyms":["separatist","regionalist","factional","partisan"],"antonyms":["national","unionist","integrative"]}],"etymology":{"value":"Formed from \"section\" + \"-ist\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛkʃənɪst/","syllables":"sec-tion-ist"},"inflection":{"noun_plural":"sectionists","adjective_forms":{}},"usage_notes":{"explanation":"The term \"sectionist\" is often used in historical contexts, particularly when discussing the causes of the American Civil War. It can also be applied to contemporary political situations where regional or local interests are prioritized over national unity. The term carries a negative connotation, implying a lack of concern for the greater good.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sectionist of the company.","correct":"✓ He is a section leader in the company.","note":"\"Sectionist\" refers to political or regional divisions, not organizational sections within a company."}],"priority":"★☆☆"},"related_words":{"derivatives":["sectionalism (noun): excessive regard for local or regional interests; systematic discrimination against a minority group.","section (noun): a distinct part or portion of something; a region or district.","sect (noun): a group of people with somewhat different religious beliefs (typically regarded as heretical) from those of a larger group to which they belong."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"sectionist\" is a relatively uncommon word, typically used in political or historical contexts to describe someone who advocates for the interests of a particular region or group, often at the expense of national unity. It's important to understand the negative connotation associated with the term, as it implies a lack of concern for the greater good. Understanding the related term \"sectionalism\" is also helpful for grasping the meaning of \"sectionist.\""},"example_sentences":[{"sentence":"The politician was labeled a sectionist for prioritizing the needs of his state over the needs of the country.","translation":"その政治家は、国全体のニーズよりも自分の州のニーズを優先したため、地方主義者というレッテルを貼られた。","type":"noun","meaning_category":"分離主義者"},{"sentence":"The sectionist policies of the government led to increased tensions between the regions.","translation":"政府の地方主義的な政策は、地域間の緊張を高めることになった。","type":"adjective","meaning_category":"分離主義の"}]}