{"word":"househusbands","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"主夫、専業主夫","english_definition":"Men who stay at home to take care of the house and family, while their wives go out to work.","examples":[{"sentence":"More and more women are the primary breadwinners, leading to an increase in the number of househusbands.","translation":"主な稼ぎ手となる女性が増えており、主夫の数が増加する傾向にある。"},{"sentence":"He's a househusband, and he enjoys cooking and taking care of the children.","translation":"彼は主夫で、料理や子供の世話を楽しんでいる。"}],"collocations":["stay-at-home dad","full-time dad","male homemaker"],"synonyms":["stay-at-home dad","full-time dad","male homemaker"],"antonyms":["working father","breadwinner"],"notes":"The term 'househusbands' is the plural form of 'househusband'."}],"etymology":{"value":"A combination of 'house' and 'husband', reflecting the traditional role reversal where the husband takes on domestic duties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaʊsˌhʌzbəndz/","syllables":"house-hus-bands"},"inflection":{"noun_plural":"househusbands"},"usage_notes":{"explanation":"'Househusbands' refers specifically to men who have taken on the role of primary caregiver and homemaker, traditionally associated with women. The term acknowledges the shift in societal roles and expectations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a househusband, so he works at home.","correct":"✓ He is a househusband, so he stays at home to take care of the house and family.","note":"'Househusband' implies taking care of the home and family, not necessarily working from home in a professional capacity."}],"priority":"★★☆"},"related_words":{"derivatives":["househusband","housewife","homemaker"],"related_terms":["dual-income family","gender roles","work-life balance"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'househusbands' refers to men who primarily manage the household and care for the family, while their partners (usually wives) are the primary income earners. This term is used to describe a reversal of traditional gender roles within a family. It's important to understand the context in which this term is used, as it often relates to discussions about changing family dynamics and gender equality."},"example_sentences":[{"sentence":"The article explored the challenges and rewards of being househusbands in modern society.","translation":"その記事は、現代社会における主夫であることの課題と報酬について探求した。","type":"general","meaning_category":"general"},{"sentence":"Many househusbands find fulfillment in raising their children and managing their homes.","translation":"多くの主夫は、子供を育て、家を管理することに充実感を見出している。","type":"general","meaning_category":"general"}]}