{"word":"thermoelectrometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱電気計：熱電効果を利用して微小な電流や電圧を測定する装置。","english_definition":"An instrument that measures small electrical currents or voltages using the thermoelectric effect.","examples":[{"sentence":"The thermoelectrometer was used to detect the tiny voltage produced by the thermocouple.","translation":"熱電気計は、熱電対によって生成された微小な電圧を検出するために使用された。"}],"collocations":["use a thermoelectrometer","calibrate a thermoelectrometer"],"synonyms":["galvanometer","electrometer"],"antonyms":[]}],"etymology":{"value":"'thermo-' (熱) + 'electro-' (電気) + '-meter' (計器) から構成される。熱電効果（温度差によって電圧が発生する現象）を利用して電気を測定する計器であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌθɜːrmoʊɪˌlɛktroʊˈmɪtər/","syllables":"ther-mo-i-lec-tro-me-ter"},"inflection":{"noun_plural":"thermoelectrometers"},"usage_notes":{"explanation":"Thermoelectrometers are specialized instruments typically found in research settings where precise measurement of small electrical signals is required. Modern digital multimeters have largely replaced them for general use.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a thermometer to measure the voltage.","correct":"✓ I used a thermoelectrometer to measure the voltage.","note":"A thermometer measures temperature, while a thermoelectrometer measures voltage or current using thermoelectric principles."}],"priority":"★★☆"},"related_words":{"derivatives":["thermoelectric","electrometer","thermocouple"],"related_terms":["Seebeck effect","Peltier effect","Thomson effect"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"A thermoelectrometer is a highly specialized instrument used for measuring very small electrical currents or voltages based on thermoelectric principles. Due to its niche application, it is not commonly encountered outside of advanced scientific or engineering contexts. Understanding the term requires familiarity with thermoelectricity and electrical measurement techniques."},"example_sentences":[{"sentence":"The sensitivity of the thermoelectrometer allowed for precise measurement of the thermoelectric current.","translation":"熱電気計の感度により、熱電電流の正確な測定が可能になった。","type":"general","meaning_category":"measurement"},{"sentence":"Researchers used a thermoelectrometer to study the Seebeck coefficient of the new material.","translation":"研究者たちは、新しい材料のゼーベック係数を研究するために熱電気計を使用した。","type":"research","meaning_category":"research"}]}