{"word":"meandrine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)脳回状構造、迷路状構造","english_definition":"(biology) A convoluted pattern resembling a maze or the windings of a river; a pattern of ridges and valleys, especially on the surface of a coral.","examples":[{"sentence":"The coral's surface displayed a complex meandrine pattern.","translation":"そのサンゴの表面は複雑な脳回状構造を示していた。"},{"sentence":"The meandrine arrangement of the brain's folds increases its surface area.","translation":"脳のひだの迷路状の配置は表面積を増加させる。"}],"collocations":["meandrine coral","meandrine pattern","meandrine valley"],"synonyms":["maze-like","convoluted","labyrinthine"],"antonyms":["straight","linear"]}],"etymology":{"value":"Derived from the Greek word \"Maiandros\", the ancient name of a river in Asia Minor (now Turkey) known for its winding course.","priority":"★★☆"},"pronunciation":{"ipa":"/miˈændraɪn/","syllables":"me-an-drine"},"inflection":{"noun_plural":"meandrines"},"usage_notes":{"explanation":"The term \"meandrine\" is primarily used in scientific contexts, particularly in biology and geology, to describe patterns that resemble the winding course of a meander (a bend in a river). It is often used to describe the surface of certain types of coral or the convoluted structure of the brain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The meandrine was very quiet.","correct":"✓ The meandrine pattern was very complex.","note":"\"Meandrine\" refers to a pattern or structure, not a state of being. It cannot be \"quiet\". The adjective \"complex\" is more appropriate to describe a meandrine pattern."}],"priority":"★☆☆"},"related_words":{"derivatives":["meander (verb: to wander in a winding course; noun: a winding curve or bend of a river or road)","meandering (adjective: winding, rambling)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"meandrine\" is a technical term used in biology and geology to describe a complex, winding pattern similar to a maze or the bends in a river. It is not commonly used in everyday language. Understanding this word requires familiarity with scientific vocabulary and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The fossilized coral exhibited a beautiful meandrine structure.","translation":"その化石化したサンゴは美しい脳回状構造を示していた。","type":"noun","meaning_category":"(biology)脳回状構造、迷路状構造"},{"sentence":"The meandrine valleys carved by the ancient river are a testament to its power.","translation":"古代の川によって刻まれた迷路状の谷は、その力の証である。","type":"noun","meaning_category":"(biology)脳回状構造、迷路状構造"}]}