{"word":"Polycletus","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"ポリュクレイトス (古代ギリシアの彫刻家)","english_definition":"An ancient Greek sculptor from Argos, active in the 5th century BC.","examples":[{"sentence":"Polycletus was known for his bronze sculptures of athletes.","translation":"ポリュクレイトスは、運動選手のブロンズ彫刻で知られていた。"},{"sentence":"The Doryphoros is considered to be Polycletus's most famous work.","translation":"ドリュフォロスは、ポリュクレイトスの最も有名な作品であると考えられている。"}],"collocations":["Polycletus's canon (ポリュクレイトスのカノン)","Doryphoros (ドリュフォロス)","Diadumenos (ディアデュメノス)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek name Πολύκλειτος (Polýkleitos), meaning 'much-renowned' or 'very famous'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈkliːtəs/","syllables":"Po-ly-cle-tus"},"inflection":{},"usage_notes":{"explanation":"Polycletus was a prominent sculptor of the Classical period of ancient Greece. He is known for his theoretical writings on art, particularly his 'Canon,' which outlined his principles of ideal human proportions. His sculptures, such as the Doryphoros (Spear-Bearer) and Diadumenos (Diadem-Bearer), are considered exemplars of classical beauty and influenced subsequent generations of artists.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Polyclitan (形容詞: ポリュクレイトスの、ポリュクレイトス風の)"],"priority":"★☆☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Polycletus is a historical figure, specifically an ancient Greek sculptor. Understanding references to him requires familiarity with classical art history. The term is primarily encountered in academic or art-historical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Copies of Polycletus's Doryphoros can be found in many museums.","translation":"ポリュクレイトスのドリュフォロスの複製は、多くの美術館で見つけることができる。","type":"example","meaning_category":"example"},{"sentence":"Polycletus's Canon established a set of ideal proportions for the human body.","translation":"ポリュクレイトスのカノンは、人体に関する理想的なプロポーションの基準を確立した。","type":"example","meaning_category":"example"}]}