{"word":"trichomatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"毛状の、糸状の、トリコーム（毛状突起）を持つ","english_definition":"Bearing or resembling trichomes (hair-like outgrowths); filamentous.","examples":[{"sentence":"The trichomatous cyanobacteria form long filaments.","translation":"その毛状のシアノバクテリアは長い糸状体を形成する。"},{"sentence":"The plant has a trichomatous surface.","translation":"その植物は毛状の表面を持つ。"}],"collocations":["trichomatous algae","trichomatous bacteria","trichomatous surface"],"synonyms":["filamentous","hairy","pilose"],"antonyms":["glabrous","smooth"]}],"etymology":{"value":"From the Greek word 'trichoma' (hair) + '-ous' (having, full of).","priority":"★★☆"},"pronunciation":{"ipa":"/trɪˈkoʊmətəs/","syllables":"tri-cho-ma-tous"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than with comparative and superlative forms (more trichomatous, most trichomatous)."},"usage_notes":{"explanation":"'Trichomatous' is primarily used in scientific and botanical contexts to describe organisms or structures that have hair-like filaments or trichomes. It's a descriptive term, not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trichomatous feeling of the fabric.","correct":"✓ The hairy or fuzzy feeling of the fabric.","note":"'Trichomatous' is rarely used to describe the texture of fabrics. Common terms like 'hairy' or 'fuzzy' are more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["trichome (noun): A hair-like outgrowth or filament, especially in plants and algae.","trichomatosis (noun): An abnormal condition characterized by excessive hair growth."],"related_terms":["filamentous","pilose","hirsute"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Trichomatous' is a highly specialized term used in botany and microbiology to describe structures or organisms characterized by the presence of trichomes (hair-like filaments). Its usage is confined to scientific contexts and is unlikely to be encountered in general English. Understanding requires familiarity with botanical terminology."},"example_sentences":[{"sentence":"Microscopic examination revealed the presence of trichomatous structures in the fungal colony.","translation":"顕微鏡検査により、その真菌コロニーに毛状の構造が存在することが明らかになった。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The trichomatous growth pattern is characteristic of certain species of cyanobacteria.","translation":"その毛状の成長パターンは、特定の種類のシアノバクテリアに特徴的である。","type":"adjective","meaning_category":"descriptive"}]}