{"word":"unideographically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"表意文字によって、表意文字的に","english_definition":"In a unideographic manner; using or relating to a writing system that uses symbols to represent concepts or ideas rather than sounds.","examples":[{"sentence":"Chinese characters are used unideographically, with each character representing a word or morpheme.","translation":"漢字は表意文字的に使用され、各文字が単語または形態素を表す。"},{"sentence":"The document explains how different languages can be represented unideographically.","translation":"その文書は、異なる言語がどのように表意文字的に表現できるかを説明している。"}],"collocations":["represent unideographically","written unideographically","used unideographically"],"synonyms":["ideographically","symbolically","pictographically"],"antonyms":["phonetically","alphabetically"]}],"etymology":{"value":"Derived from \"unideographic,\" which combines \"uni-\" (meaning one or single), \"ideo-\" (referring to ideas or concepts), and \"-graphic\" (relating to writing). The adverbial form is created by adding \"-ally.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːnaɪˌdiːəˈɡræfɪkli/","syllables":"u-ni-de-o-graph-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The term \"unideographically\" describes something done or represented using a writing system where symbols (characters) represent ideas or concepts, rather than phonetic sounds. This is most commonly associated with Chinese characters (漢字), where each character can represent a word or a morpheme. The adverb is relatively rare and primarily used in linguistic or academic contexts when discussing writing systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is spelled unideographically.","correct":"✓ The word is represented unideographically.","note":"Spelling relates to phonetic scripts. Unideographic writing systems involve representing concepts, not spelling. Use 'represented' instead of 'spelled'."},{"incorrect":"✗ English is written unideographically.","correct":"✓ Chinese is written unideographically.","note":"English uses an alphabetic script, not a unideographic one. Chinese (or other languages using Chinese characters) is a correct example."}],"priority":"★★☆"},"related_words":{"derivatives":["unideographic (adjective)","unideograph (noun)","ideogram (noun)","ideographic (adjective)","ideographically (adverb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unideographically\" is a highly specialized term primarily used in linguistics and related academic fields. It refers to the manner in which a writing system represents ideas or concepts directly, rather than representing sounds. Understanding this word requires familiarity with different types of writing systems and the principles of ideography. Its use is limited to contexts where such technical distinctions are relevant."},"example_sentences":[{"sentence":"The ancient script was interpreted unideographically, revealing insights into their culture.","translation":"その古代文字は表意文字的に解釈され、彼らの文化への洞察を明らかにした。","type":"general","meaning_category":"表意文字的に"},{"sentence":"Japanese kanji are used unideographically alongside phonetic kana.","translation":"日本の漢字は、表音文字である仮名と並んで表意文字的に使用される。","type":"linguistics","meaning_category":"表意文字的に"}]}