{"word":"GKSM","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"Abbreviation for \"Glavniy Kosmicheskiy Shtab Ministerstva Oborony\", which translates to Main Space Directorate of the Ministry of Defense. It refers to a department within the Russian Ministry of Defense responsible for space-related activities.","english_definition":"An abbreviation for the Main Space Directorate of the Ministry of Defense, a department within the Russian Ministry of Defense responsible for space-related activities.","examples":[{"sentence":"The GKSM oversees the launch of military satellites.","translation":"GKSMは軍事衛星の打ち上げを監督しています。"},{"sentence":"Information from the GKSM is crucial for national security.","translation":"GKSMからの情報は国家安全保障にとって重要です。"}],"collocations":["GKSM oversees","GKSM information","GKSM activities"],"synonyms":["Main Space Directorate of the Ministry of Defense"],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of the Russian phrase \"Glavniy Kosmicheskiy Shtab Ministerstva Oborony\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡeɪ.keɪ.ɛsˈɛm/","syllables":"G-K-S-M"},"inflection":{"notes":"It is an acronym, so it does not inflect."},"usage_notes":{"explanation":"GKSM is a specialized term primarily used in military and aerospace contexts when discussing Russian space activities. It is not a common term in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The GKSM are responsible...","correct":"✓ The GKSM is responsible...","note":"Although it represents a directorate, it is treated as a singular entity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["Russian Ministry of Defense","Military Space Forces"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"GKSM is a highly specialized term used in the context of Russian military space activities. Understanding requires knowledge of Russian military structure and space programs. It is unlikely to be encountered outside of specialized literature or discussions."},"example_sentences":[{"sentence":"The GKSM is responsible for coordinating all military space launches.","translation":"GKSMはすべての軍事宇宙打ち上げの調整を担当しています。","type":"noun","meaning_category":"Organization"},{"sentence":"Analysts monitor GKSM activities to assess Russia's space capabilities.","translation":"アナリストは、ロシアの宇宙能力を評価するためにGKSMの活動を監視しています。","type":"noun","meaning_category":"Activities"}]}