{"word":"Discussionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)議論主義：議論や対話を通じて知識、真実、または合意に到達できるという信念または哲学。","english_definition":"(philosophy) The belief or philosophy that knowledge, truth, or agreement can be reached through discussion and dialogue.","examples":[{"sentence":"Discussionism is a core tenet of democratic societies, where open debate is encouraged.","translation":"議論主義は、自由な討論が奨励される民主主義社会の中核的な原則です。"},{"sentence":"Critics of discussionism argue that it can be ineffective when dealing with those who are unwilling to engage in good-faith dialogue.","translation":"議論主義の批判者たちは、誠実な対話に参加する意思のない人々を相手にする場合には、それが非効果的になる可能性があると主張しています。"}],"collocations":["philosophical discussionism","political discussionism","promote discussionism","limitations of discussionism"],"synonyms":["dialogism","rational discourse","deliberative democracy"],"antonyms":["authoritarianism","dogmatism","censorship"]}],"etymology":{"value":"The term 'discussionism' is formed by combining 'discussion' with the suffix '-ism,' which denotes a belief, principle, or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈskʌʃənɪzəm/","syllables":"dis-cus-sion-ism"},"inflection":{"noun_plural":"Discussionisms"},"usage_notes":{"explanation":"'Discussionism' is primarily used in philosophical and political contexts to describe the belief in the power of discussion to resolve conflicts, discover truth, or reach consensus. It is often associated with democratic ideals and the importance of free speech. However, it is also sometimes used critically to point out the limitations of relying solely on discussion, especially in situations where power imbalances or ideological intransigence exist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Discussionism is when you talk a lot.","correct":"✓ Discussionism is the belief that truth can be found through discussion.","note":"Discussionism is not simply talking a lot, but rather the belief that meaningful discussion can lead to truth or agreement."},{"incorrect":"✗ Discussionism always works.","correct":"✓ Discussionism can be effective, but it has limitations.","note":"It's important to acknowledge that discussionism is not a perfect solution and may not be effective in all situations."}],"priority":"★★☆"},"related_words":{"derivatives":["discussionist (noun: someone who believes in discussionism)"],"related_terms":["dialogue","discourse","debate","deliberation","rhetoric"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Discussionism' is a relatively abstract term used in philosophical and political discourse. It refers to the belief that discussion and dialogue are the primary means of achieving knowledge, truth, or consensus. The term implies a commitment to rational discourse and open debate as essential components of a functioning society. Understanding the term requires familiarity with philosophical concepts related to epistemology and political theory."},"example_sentences":[{"sentence":"The professor advocated for discussionism as a means of resolving complex ethical dilemmas.","translation":"教授は、複雑な倫理的ジレンマを解決する手段として議論主義を提唱しました。","type":"general","meaning_category":"philosophy"},{"sentence":"The government's commitment to discussionism was questioned when it suppressed dissenting voices.","translation":"政府が異議を唱える声を抑圧したとき、議論主義へのコミットメントが疑問視されました。","type":"political","meaning_category":"politics"}]}