{"word":"non-cognitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非認知的な、認知能力以外の","english_definition":"Relating to qualities that are not primarily intellectual, such as social skills, emotional intelligence, and character traits.","examples":[{"sentence":"Non-cognitive skills are increasingly recognized as important for success in school and work.","translation":"非認知能力は、学校や職場での成功にとって重要であるとますます認識されています。"},{"sentence":"The study focused on the impact of non-cognitive factors on academic achievement.","translation":"その研究は、学業成績に対する非認知的な要因の影響に焦点を当てました。"},{"sentence":"Developing non-cognitive abilities can improve a child's overall well-being.","translation":"非認知能力を開発することは、子供の全体的な幸福を向上させる可能性があります。"}],"collocations":["non-cognitive skills","non-cognitive abilities","non-cognitive factors","non-cognitive development","non-cognitive assessment"],"synonyms":["social-emotional","character-based","soft skills"],"antonyms":["cognitive","intellectual","academic"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'cognitive'. 'Cognitive' comes from the Latin 'cognoscere', meaning 'to get to know, to learn'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈkɒɡnətɪv/","syllables":"non-cog-ni-tive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-cognitive' refers to skills, abilities, and traits that are not primarily related to intellectual or academic knowledge. These include things like perseverance, self-control, empathy, teamwork, and communication skills. They are often considered essential for success in various aspects of life, complementing cognitive abilities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Non-cognitive skills are not important.","correct":"✓ Non-cognitive skills are very important.","note":"A common misconception is that non-cognitive skills are less important than cognitive skills, but research shows they are both crucial for success."},{"incorrect":"✗ Cognitive skills are the only thing that matters.","correct":"✓ Both cognitive and non-cognitive skills are important.","note":"It's important to recognize the value of both cognitive and non-cognitive skills."}],"priority":"★★☆"},"related_words":{"derivatives":["noncognitively"],"related_terms":["cognitive","skills","abilities","traits","social-emotional learning (SEL)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in academic and educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'non-cognitive' is often used in educational and psychological contexts to describe skills and abilities that are not directly related to academic knowledge or intellectual ability. These skills are essential for success in various aspects of life, including personal relationships, work, and overall well-being. Examples of non-cognitive skills include self-discipline, perseverance, teamwork, and communication skills. Understanding this term is important for comprehending discussions about holistic development and success beyond academic achievement."},"example_sentences":[{"sentence":"The program aims to improve students' non-cognitive skills, such as self-discipline and teamwork.","translation":"そのプログラムは、生徒の自制心やチームワークなどの非認知能力の向上を目指しています。","type":"general","meaning_category":"skills development"},{"sentence":"Employers increasingly value non-cognitive abilities like communication and problem-solving.","translation":"雇用主は、コミュニケーションや問題解決などの非認知能力をますます重視しています。","type":"workplace","meaning_category":"abilities in employment"},{"sentence":"Research shows that non-cognitive factors play a significant role in long-term success.","translation":"研究によると、非認知的な要因は長期的な成功に重要な役割を果たしています。","type":"research","meaning_category":"factors in success"}]}