{"word":"rationalistically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"合理主義的に","english_definition":"In a manner that is consistent with or based on rationalism; according to the principles of rationalism.","examples":[{"sentence":"He approached the problem rationalistically, relying on logic and reason.","translation":"彼は論理と理性に基づいて、その問題に合理主義的に取り組みました。"},{"sentence":"The philosopher argued rationalistically for the existence of innate ideas.","translation":"その哲学者は生得的観念の存在を合理主義的に主張しました。"}],"collocations":["approach something rationalistically","argue rationalistically","think rationalistically","analyze something rationalistically"],"synonyms":["logically","reasonably","intellectually","analytically","systematically"],"antonyms":["empirically","intuitively","subjectively","irrationally"]}],"etymology":{"value":"Formed from 'rationalistic' + '-ally'. 'Rationalistic' comes from 'rationalism' (a philosophical viewpoint emphasizing reason as the primary source of knowledge) + '-istic' (a suffix indicating adherence to a particular system or doctrine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌræʃənəˈlɪstɪkli/","syllables":"ra-tion-al-is-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Rationalistically' describes an action or thought process that is guided by rationalism, a philosophical stance that emphasizes the role of reason and logic in acquiring knowledge. It implies a reliance on intellectual analysis and deduction rather than sensory experience or emotion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He explained the situation rationalistically, showing his feelings.","correct":"✓ He explained the situation rationalistically, showing his reasoning.","note":"'Rationalistically' implies a focus on reason, not emotion. Replace 'feelings' with 'reasoning' to maintain consistency."},{"incorrect":"✗ She approached the problem rationalistically, using only her intuition.","correct":"✓ She approached the problem analytically, using her intuition as a starting point.","note":"Rationalism contrasts with intuition. If intuition is involved, 'analytically' or another term might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["rationalistic (adjective)","rationalism (noun)","rationalist (noun)","rationalize (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rationalistically' is an advanced term indicating an approach based on rationalism, a philosophical system prioritizing reason and logic. It's used to describe methods or arguments that rely on intellectual analysis rather than emotion, intuition, or experience. Understanding the philosophical context of rationalism is crucial for proper usage."},"example_sentences":[{"sentence":"The economic model was developed rationalistically, based on mathematical principles.","translation":"その経済モデルは、数学的原理に基づいて合理主義的に開発されました。","type":"adverb","meaning_category":"method of development"},{"sentence":"He defended his political views rationalistically, citing historical precedents and logical arguments.","translation":"彼は歴史的前例と論理的議論を引用して、自身の政治的見解を合理主義的に擁護しました。","type":"adverb","meaning_category":"method of defense"},{"sentence":"She analyzed the data rationalistically to identify patterns and draw conclusions.","translation":"彼女はパターンを特定し、結論を導き出すために、データを合理主義的に分析しました。","type":"adverb","meaning_category":"method of analysis"}]}