{"word":"phaenogamous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"顕花植物の、有花の","english_definition":"(botany) having conspicuous reproductive organs; bearing flowers.","examples":[{"sentence":"Phaenogamous plants are more complex than cryptogamous plants.","translation":"顕花植物は隠花植物よりも複雑である。"},{"sentence":"The phaenogamous nature of roses makes them popular ornamental plants.","translation":"バラが顕花植物であることは、バラを人気のある観賞植物にしている。"}],"collocations":["phaenogamous plant","phaenogamous reproduction"],"synonyms":["flowering","anthophytic"],"antonyms":["cryptogamous","flowerless"]}],"etymology":{"value":"From Greek *phaneós* (visible, evident) + *gamos* (marriage). Refers to the visible sexual reproduction in flowering plants.","priority":"★★☆"},"pronunciation":{"ipa":"/fiːˈnɒɡəməs/","syllables":"phe-nog-a-mous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible but rare (more phaenogamous, most phaenogamous)."},"usage_notes":{"explanation":"The term 'phaenogamous' is primarily used in botanical contexts to distinguish plants that reproduce sexually with visible flowers and seeds from those that reproduce without conspicuous flowers or seeds (cryptogamous plants). The term is somewhat archaic and less commonly used in modern botany, with more specific classifications being preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phaenogamous animal.","correct":"✓ The phaenogamous plant.","note":"'Phaenogamous' refers specifically to plants, not animals."},{"incorrect":"✗ This plant is phaenogamous because it is green.","correct":"✓ This plant is phaenogamous because it has flowers.","note":"The defining characteristic is the presence of visible reproductive organs (flowers), not just being green."}],"priority":"★☆☆"},"related_words":{"derivatives":["phaenogam (noun, a phaenogamous plant)"],"related_terms":["cryptogamous (antonym, non-flowering plants)","spermatophyte (synonym, seed-bearing plant)","angiosperm (a type of phaenogamous plant)","gymnosperm (a type of phaenogamous plant)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency. Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phaenogamous' is a technical term from botany referring to plants that have visible reproductive structures, namely flowers. It's a relatively uncommon word, primarily used in scientific or academic contexts when contrasting flowering plants with non-flowering plants (cryptogams). Understanding this term requires some familiarity with botanical classification."},"example_sentences":[{"sentence":"Most garden plants are phaenogamous, producing beautiful flowers.","translation":"ほとんどの園芸植物は顕花植物であり、美しい花を咲かせる。","type":"general","meaning_category":"botany"},{"sentence":"The classification of plants into phaenogamous and cryptogamous groups was more common in older botanical texts.","translation":"植物を顕花植物と隠花植物のグループに分類することは、古い植物学のテキストではより一般的だった。","type":"historical","meaning_category":"botany"}]}