{"word":"Metaigneous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Geology) Relating to or denoting a metamorphic rock derived from an igneous rock.","english_definition":"Relating to or denoting a metamorphic rock derived from an igneous rock.","examples":[{"sentence":"The meta-igneous rocks in this region show evidence of intense deformation.","translation":"この地域のメタ火成岩は、激しい変形の証拠を示しています。"},{"sentence":"Analysis of the meta-igneous samples revealed their original igneous composition.","translation":"メタ火成岩サンプルの分析により、元の火成岩組成が明らかになりました。"}],"collocations":["meta-igneous rock","meta-igneous complex"],"synonyms":["metamorphosed igneous","altered igneous"],"antonyms":["igneous","sedimentary","metamorphic (in general)"]}],"etymology":{"value":"Formed from the combination of 'meta-' (denoting change or transformation) and 'igneous' (relating to rocks formed from molten magma or lava).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəˈɪɡniəs/","syllables":"met-aig-ne-ous"},"inflection":{"notes":"The word 'metaigneous' is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'metaigneous' is used specifically in geology to describe metamorphic rocks that were originally igneous rocks. It indicates that the rock has undergone a change in its mineral composition and texture due to heat, pressure, or chemically active fluids.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock is metaigneous, so it must be sedimentary.","correct":"✓ The rock is metaigneous, so it was originally igneous but has been metamorphosed.","note":"Metaigneous rocks are metamorphic rocks with igneous origins, not sedimentary."}],"priority":"★★☆"},"related_words":{"derivatives":["metamorphism","igneous","metamorphic"],"related_terms":["orthogneiss","paragneiss","amphibolite"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'metaigneous' is a specialized geological term used to describe a type of metamorphic rock. Understanding this term requires familiarity with basic geological concepts such as igneous and metamorphic rocks. The prefix 'meta-' indicates that the rock has undergone a transformation from its original igneous state."},"example_sentences":[{"sentence":"The presence of meta-igneous rocks suggests a history of volcanic activity followed by metamorphism.","translation":"メタ火成岩の存在は、火山活動の歴史とその後の変成作用を示唆しています。","type":"adjective","meaning_category":"Geology"}]}