{"word":"goatlike","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヤギに似た、ヤギのような","english_definition":"resembling or characteristic of a goat.","examples":[{"sentence":"The creature had goatlike eyes and a scraggly beard.","translation":"その生き物はヤギのような目と、まばらな顎ひげを持っていた。"},{"sentence":"His voice had a goatlike bleating quality.","translation":"彼の声はヤギのようなメーメーいう音質だった。"},{"sentence":"The old man had a goatlike appetite, eating everything in sight.","translation":"その老人はヤギのような食欲で、目に入るもの全てを食べた。"}],"collocations":["goatlike beard (ヤギのような顎ひげ)","goatlike eyes (ヤギのような目)","goatlike smell (ヤギのような臭い)","goatlike behavior (ヤギのような行動)"],"synonyms":["caprine","hircine"],"antonyms":[],"notes":"Often used to describe physical characteristics or behaviors reminiscent of goats."}],"etymology":{"value":"From 'goat' + '-like'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡoʊtlaɪk/","syllables":"goat-like"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Goatlike' is used to describe something that resembles a goat in appearance, behavior, or smell. It can be used literally to describe animals or creatures that share characteristics with goats, or figuratively to describe people or things that have goat-like qualities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted goat.","correct":"✓ He acted goatlike.","note":"'Goat' is a noun, while 'goatlike' is an adjective used to describe the manner of acting."}],"priority":"★★☆"},"related_words":{"derivatives":["goat","like"],"related_terms":["caprine","hircine"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Goatlike' is a descriptive adjective used to indicate that something has characteristics similar to those of a goat. This can refer to physical features, behaviors, or even sounds. Because it's a compound word formed from a common noun (goat) and the suffix '-like,' it's relatively easy to understand, but its usage is less frequent than more common adjectives. Understanding the characteristics of goats can help infer the meaning when encountering this word."},"example_sentences":[{"sentence":"The mythical satyr is often depicted with goatlike legs and horns.","translation":"神話に登場するサテュロスは、しばしばヤギのような足と角を持つ姿で描かれる。","type":"descriptive"},{"sentence":"The old barn had a strong, goatlike odor.","translation":"古い納屋は、強烈なヤギのような臭いがした。","type":"descriptive"},{"sentence":"His stubbornness was almost goatlike; he refused to change his mind.","translation":"彼の頑固さはほとんどヤギのようで、考えを変えようとしなかった。","type":"figurative"}]}