{"word":"pluton","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"深成岩体、深成岩","english_definition":"A body of intrusive igneous rock that crystallized at considerable depth below the earth's surface.","examples":[{"sentence":"The granite pluton is exposed after millions of years of erosion.","translation":"数百万年の浸食の後、花崗岩の深成岩体が露出している。"},{"sentence":"Geologists studied the composition of the pluton to understand its origin.","translation":"地質学者たちはその起源を理解するために深成岩体の組成を研究した。"}],"collocations":["granite pluton","large pluton","study of plutons","pluton emplacement"],"synonyms":["intrusive rock body","batholith","stock"],"antonyms":["extrusive rock","volcanic rock"]},{"part_of_speech":"noun","definition":"冥王星 (Pluto)","english_definition":"(Archaic) Pluto.","examples":[{"sentence":"In old astronomy books, Pluton is used to refer to Pluto.","translation":"古い天文学の本では、Plutonは冥王星を指すために使われています。"}],"collocations":["refer to Pluton","Pluton and Charon"],"synonyms":["Pluto"],"antonyms":[]}],"etymology":{"value":"From Pluto, the Roman god of the underworld, because these rocks formed deep within the earth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpluːtɒn/","syllables":"plu-ton"},"inflection":{"noun_plural":"plutons"},"usage_notes":{"explanation":"The term 'pluton' refers to a specific type of geological formation. It is not commonly used in everyday conversation. When referring to the dwarf planet, 'Pluto' is the standard term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The volcano erupted and formed a pluton.","correct":"✓ The volcano erupted and formed extrusive rocks.","note":"Plutons are formed deep underground, not from volcanic eruptions. Eruptions form extrusive rocks."},{"incorrect":"✗ I saw Pluton in the night sky.","correct":"✓ I saw Pluto in the night sky.","note":"When referring to the dwarf planet, use 'Pluto', not 'Pluton'."}],"priority":"★★☆"},"related_words":{"derivatives":["plutonic (adjective: relating to or denoting igneous rock formed at great depth)","plutonism (noun: a former geological theory that igneous rocks originated through the action of heat within the earth)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pluton' is a technical term used in geology to describe a specific type of intrusive igneous rock formation. It is not a common word and is primarily used in scientific contexts. Understanding the term requires some knowledge of geology.","priority":"★★☆"},"example_sentences":[{"sentence":"The geologists mapped the extent of the granite pluton.","translation":"地質学者たちは花崗岩の深成岩体の範囲を地図に示した。","type":"noun","meaning_category":"深成岩体"},{"sentence":"The pluton's composition provided clues about the earth's mantle.","translation":"その深成岩体の組成は、地球のマントルに関する手がかりを提供した。","type":"noun","meaning_category":"深成岩"},{"sentence":"The term Pluton was once used to refer to Pluto.","translation":"かつてPlutonという言葉は冥王星を指すために使われていました。","type":"noun","meaning_category":"冥王星 (Archaic)"}]}