{"word":"Judas-like","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ユダのような、裏切り者のような","english_definition":"Resembling Judas Iscariot; betraying trust or loyalty.","examples":[{"sentence":"His Judas-like act of revealing company secrets to competitors shocked everyone.","translation":"彼のユダのような、会社の秘密を競合他社に漏らす行為は皆を驚かせた。"},{"sentence":"She felt a Judas-like guilt for gossiping about her friend behind her back.","translation":"彼女は友人の陰口を言ったことに対して、ユダのような罪悪感を感じた。"}],"collocations":["Judas-like betrayal","Judas-like kiss","Judas-like act"],"synonyms":["treacherous","betraying","disloyal","deceitful","perfidious"],"antonyms":["loyal","faithful","trustworthy","honest"]}],"etymology":{"value":"Derived from the name of Judas Iscariot, the apostle who betrayed Jesus Christ according to the New Testament. The suffix '-like' indicates resemblance.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒuːdəs laɪk/","syllables":"Ju-das-like"},"inflection":{"notes":"Adjective, no standard inflections."},"usage_notes":{"explanation":"'Judas-like' is used to describe actions or characteristics that resemble the betrayal committed by Judas Iscariot. It implies a deep breach of trust, often involving deception and disloyalty to someone who was close or held in high regard. The term carries a strong negative connotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a Judas-like loyalty.","correct":"✓ He showed a Judas-like betrayal.","note":"The term implies betrayal, not loyalty."}],"priority":"★★☆"},"related_words":{"derivatives":["Judas (noun)","Judas kiss (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Judas-like' is an adjective used to describe someone or something that resembles Judas Iscariot, the apostle known for betraying Jesus Christ. It's used to describe acts of extreme betrayal and disloyalty, often involving deception. Due to its religious and historical context, understanding the reference to Judas is crucial for comprehending the term's meaning. It's not a commonly used word, but it's powerful in conveying a sense of profound betrayal."},"example_sentences":[{"sentence":"Revealing confidential information was a Judas-like move.","translation":"機密情報を暴露することはユダのような行為だった。","type":"Adjective","meaning_category":"Betrayal"},{"sentence":"He gave a Judas-like smile before stabbing me in the back.","translation":"彼は背中を刺す前にユダのような笑みを浮かべた。","type":"Adjective","meaning_category":"Betrayal"}]}