{"word":"homothallic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(菌類などが)自家和合性の、同株性の","english_definition":"(of a fungus or other organism) capable of sexual reproduction from a single organism or culture; self-fertile.","examples":[{"sentence":"Homothallic fungi can reproduce sexually without the need for a partner.","translation":"自家和合性の菌類は、パートナーを必要とせずに有性生殖が可能です。"},{"sentence":"The homothallic nature of this species allows for rapid colonization.","translation":"この種の同株性により、迅速なコロニー形成が可能です。"}],"collocations":["homothallic species","homothallic fungi","homothallic reproduction"],"synonyms":["self-fertile","self-compatible","selfing"],"antonyms":["heterothallic","self-sterile","outcrossing"]}],"etymology":{"value":"Derived from the Greek words 'homo' (same) and 'thallos' (shoot or thallus), referring to the same thallus producing compatible gametes.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊməˈθælɪk/","syllables":"ho-mo-thal-lic"},"inflection":{"notes":"Does not inflect (homothallic, more homothallic, most homothallic is technically possible but rare)."},"usage_notes":{"explanation":"'Homothallic' is a term primarily used in mycology (the study of fungi) and sometimes in botany to describe organisms that can reproduce sexually with themselves. This contrasts with 'heterothallic' organisms, which require two different individuals to reproduce sexually. The term is quite technical and specific to these fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is homothallic because it grows quickly.","correct":"✓ The plant is homothallic because it can self-fertilize.","note":"Homothallism refers specifically to the ability to self-fertilize, not just to rapid growth."},{"incorrect":"✗ All fungi are homothallic.","correct":"✓ Some fungi are homothallic, while others are heterothallic.","note":"Not all fungi are self-fertile; some require different mating types."}],"priority":"★★☆"},"related_words":{"derivatives":["homothallism (noun: the condition of being homothallic)"],"related_terms":["heterothallic (adjective: requiring two different individuals for sexual reproduction)","thallus (noun: a vegetative body of a fungus or alga)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'homothallic' is a highly specialized term used in biology, specifically in mycology and botany. It describes organisms, typically fungi, that are capable of sexual reproduction from a single individual. Understanding this term requires a background in biology and familiarity with concepts like sexual reproduction and fungal biology."},"example_sentences":[{"sentence":"Many ascomycete fungi exhibit a homothallic mode of reproduction.","translation":"多くの子嚢菌類は自家和合性の生殖様式を示します。","type":"scientific","meaning_category":"reproduction"},{"sentence":"Genetic analysis confirmed the homothallic nature of the isolated strain.","translation":"遺伝子解析により、分離された株の同株性が確認されました。","type":"scientific","meaning_category":"genetics"}]}