{"word":"chiselly","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having a sharp, well-defined, or angular appearance, especially in the facial features, reminiscent of something carved with a chisel.","english_definition":"Having sharp, well-defined features, as if sculpted with a chisel.","examples":[{"sentence":"He had a chiselly face with a strong jawline and high cheekbones.","translation":"彼は、強い顎のラインと高い頬骨を持つ、彫りの深い顔立ちをしていた。"},{"sentence":"The actor's chiselly features made him perfect for the role of the stoic hero.","translation":"その俳優の彫りの深い顔立ちが、禁欲的なヒーローの役柄にぴったりだった。"}],"collocations":["chiselly features","chiselly face","chiselly jawline","chiselly cheekbones"],"synonyms":["sculpted","defined","angular","sharp","well-defined"],"antonyms":["soft","rounded","undefined","blurred"]}],"etymology":{"value":"Derived from the word 'chisel,' referring to a tool used for shaping wood or stone. The '-ly' suffix is added to form an adjective describing something resembling the effect of a chisel.","priority":"Medium"},"pronunciation":{"ipa":"/ˈtʃɪzəli/","syllables":"chiz-el-ly"},"inflection":{"notes":"Adjective, so it can form comparative (more chiselly) and superlative (most chiselly) forms, though these are not commonly used."},"usage_notes":{"explanation":"The term 'chiselly' is primarily used to describe facial features that are sharp, angular, and well-defined, giving the impression of being sculpted or carved. It often implies attractiveness and strength of character. The word is relatively uncommon and is more often found in descriptive writing than in everyday conversation.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The clay was very chiselly.","correct":"✓ The clay was very hard and difficult to shape.","note":"'Chiselly' is usually used to describe facial features, not the texture or properties of materials like clay."},{"incorrect":"✗ She had a chiselly voice.","correct":"✓ She had a sharp, clear voice.","note":"'Chiselly' is generally reserved for physical appearance, particularly facial features, and not for describing qualities like a voice."}],"priority":"Low"},"related_words":{"derivatives":["chisel (noun, verb)"],"phrases":["chiselled abs (well-defined abdominal muscles)"],"priority":"Low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Chiselly' is an advanced adjective used to describe sharp, well-defined facial features that look as if they have been sculpted. It's not a common word and is mostly found in descriptive writing. To understand it, think of the way a sculptor uses a chisel to carve sharp lines and angles into stone or wood. The word suggests a strong and attractive appearance."},"example_sentences":[{"sentence":"His chiselly jaw and piercing blue eyes made him a captivating figure.","translation":"彼の彫りの深い顎と鋭い青い目は、彼を魅惑的な人物にした。","type":"descriptive","meaning_category":"Physical appearance"},{"sentence":"The model's chiselly cheekbones were highlighted by the dramatic lighting.","translation":"そのモデルの彫りの深い頬骨は、劇的な照明によって強調された。","type":"descriptive","meaning_category":"Physical appearance"}]}