{"word":"Goldwynism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ゴールドウィン風矛盾語法（映画プロデューサー Samuel Goldwyn に由来する、意図せず滑稽な言葉の誤用や矛盾した表現）","english_definition":"A comically illogical or contradictory statement, especially one attributed to movie producer Samuel Goldwyn.","examples":[{"sentence":"\"Include me out\" is a classic Goldwynism.","translation":"「私を除外してくれ」は古典的なゴールドウィン風矛盾表現である"},{"sentence":"\"A verbal contract isn't worth the paper it's written on\" became a famous Goldwynism.","translation":"「口頭契約はそれが書かれた紙の価値もない」は有名なゴールドウィン風矛盾表現となった"}],"collocations":["classic Goldwynism","famous Goldwynism","typical Goldwynism"],"synonyms":["malapropism","mixed metaphor","verbal blunder"],"antonyms":["eloquent phrase","well-constructed statement"]}],"etymology":{"value":"20世紀のハリウッド映画プロデューサー Samuel Goldwyn（1879-1974）の名前から。彼は頻繁に意図せず滑稽な言葉の誤用をしたことで知られ、これらの表現が「Goldwynism」として知られるようになった。ただし、実際には彼のスタッフや脚本家が創作したものも多いと考えられている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡoʊldwɪnɪzəm/","syllables":"Gold-win-ism"},"usage_notes":{"explanation":"Goldwynismは、論理的矛盾や言葉の誤用を含むユーモラスな表現を指します。映画プロデューサーのSamuel Goldwynに帰せられることが多いですが、実際には彼が言ったかどうかは不明なものも多く、ハリウッドの伝説的な表現として定着しています。この種の表現は、公の場でのスピーチや文章で意図せず生まれる言葉の失敗（失言）の典型例としてよく引用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ That politician's error was a real Rooseveltism.","correct":"✓ That politician's error was a real Goldwynism.","note":"この種の言葉の誤用を指す場合はGoldwynismが正しい用語です"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":["\"Include me out\" (私を除外してくれ)","\"A verbal contract isn't worth the paper it's written on\" (口頭契約はそれが書かれた紙の価値もない)","\"I never make predictions, especially about the future\" (私は予測をしない、特に未来についての予測は)","\"Too much coincidence is bad luck\" (あまりに多くの偶然は不運だ)","\"Every Tom, Dick and Harry is named William\" (どこの誰も彼もがウィリアムという名前だ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈でしか使われない専門的な語彙","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Goldwynismは、ハリウッドの映画プロデューサーSamuel Goldwynに由来する、意図せずに生まれた言葉の矛盾や誤用を指す専門的な用語です。この種の表現はしばしばユーモラスな効果を生み出しますが、高度な英語の文化的背景を理解している必要があるため、上級者向けの語彙と言えます。"},"example_sentences":[{"sentence":"The CEO's statement \"We need to move forward in reverse\" was a perfect Goldwynism.","translation":"「我々は後ろ向きに前進する必要がある」というCEOの発言は完璧なゴールドウィン風矛盾表現だった","type":"noun","meaning_category":"矛盾した表現"},{"sentence":"Many so-called Goldwynisms were actually invented by Hollywood writers.","translation":"いわゆるゴールドウィン風矛盾表現の多くは実際にはハリウッドの脚本家たちが創作したものだった","type":"noun","meaning_category":"言葉の誤用"},{"sentence":"\"I'll give you a definite maybe\" is another example of a Goldwynism.","translation":"「はっきりした多分を言おう」は別のゴールドウィン風矛盾表現の例である","type":"noun","meaning_category":"滑稽な表現"}]}