{"word":"double-precision","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"倍精度 (コンピュータ)","english_definition":"(computing) relating to or using numbers represented by twice the usual number of bits, giving greater accuracy.","examples":[{"sentence":"Double-precision floating-point numbers are used for scientific calculations.","translation":"倍精度浮動小数点数は科学計算に使用されます。"},{"sentence":"The double-precision format provides more significant digits than single-precision.","translation":"倍精度形式は、単精度よりも多くの有効桁数を提供します。"}],"collocations":["double-precision floating-point","double-precision arithmetic"],"synonyms":["high-precision"],"antonyms":["single-precision"]},{"part_of_speech":"noun","definition":"倍精度 (コンピュータ)","english_definition":"(computing) a format for representing numbers that uses twice the usual number of bits, giving greater accuracy.","examples":[{"sentence":"The variable was declared as double-precision.","translation":"その変数は倍精度として宣言されました。"},{"sentence":"Using double-precision reduces the risk of rounding errors.","translation":"倍精度を使用すると、丸め誤差のリスクが軽減されます。"}],"collocations":["use double-precision","declare as double-precision"],"synonyms":[],"antonyms":["single-precision"]}],"etymology":{"value":"'Double' referring to twice the usual size or number of bits, combined with 'precision' indicating the level of accuracy.","priority":"★★☆"},"pronunciation":{"ipa":"ˌdʌbəl prɪˈsɪʒən","syllables":"dou-ble-pre-ci-sion"},"inflection":{"notes":"It does not have plural forms."},"usage_notes":{"explanation":"'Double-precision' refers to a computer number format that uses twice the number of bits as single-precision, typically 64 bits instead of 32. This allows for a greater number of significant digits and reduces rounding errors, making it suitable for scientific and engineering applications where high accuracy is required. It is often used in floating-point arithmetic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Use double precision for all calculations.","correct":"✓ Use double-precision when high accuracy is needed.","note":"Double precision requires more memory and processing power, so it should only be used when necessary."}],"priority":"★★☆"},"related_words":{"derivatives":["precision","single-precision","floating-point"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Double-precision' is a term used in computer science to describe a way of storing numbers that allows for greater accuracy. It uses twice the amount of memory compared to 'single-precision', which means it can represent numbers with more digits after the decimal point. This is important for calculations where even small errors can have a big impact, such as in scientific simulations or financial modeling. While it provides better accuracy, it also requires more computing resources, so it's typically used only when necessary."},"example_sentences":[{"sentence":"The simulation requires **double-precision** to accurately model the fluid dynamics.","translation":"そのシミュレーションでは、流体ダイナミクスを正確にモデル化するために倍精度が必要です。","type":"adjective","meaning_category":"倍精度"},{"sentence":"Switching to **double-precision** significantly improved the accuracy of the results.","translation":"倍精度に切り替えることで、結果の精度が大幅に向上しました。","type":"noun","meaning_category":"倍精度"}]}