{"word":"unsavage","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)野蛮な状態から解放する、文明化する","english_definition":"To civilize; to reclaim from a savage state.","examples":[{"sentence":"The missionaries sought to unsavage the native populations.","translation":"宣教師たちは、先住民を野蛮な状態から解放しようと努めた。"}],"collocations":[],"synonyms":["civilize","cultivate","refine","humanize"],"antonyms":["savage","brutalize","dehumanize"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(場所を)荒廃していない状態に戻す、自然の状態に戻す","english_definition":"To restore to a non-ruined or natural state.","examples":[{"sentence":"After the war, they worked to unsavage the ravaged lands.","translation":"戦後、彼らは荒廃した土地を元の状態に戻すために働いた。"}],"collocations":[],"synonyms":["restore","reclaim","renature"],"antonyms":["savage","devastate","ruin"]}],"etymology":{"value":"接頭辞 \"un-\" (否定) + \"savage\" (野蛮な)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsævɪdʒ/","syllables":"un-sav-age"},"inflection":{"verb_forms":{"present_simple":["unsavage","unsavages"],"past_simple":"unsavaged","past_participle":"unsavaged","present_participle":"unsavaging"}},"usage_notes":{"explanation":"\"Unsavage\" is a relatively rare word, primarily used in formal or literary contexts. It implies reversing the effects of savagery, either in terms of behavior or environmental degradation. The word carries a strong connotation of improvement or restoration to a more desirable state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsavaged animal was released back into the wild.","correct":"✓ The tamed animal was released back into the wild.","note":"\"Unsavaged\" implies civilizing or restoring, not simply being wild. Use \"tamed\" or \"domesticated\" to indicate an animal that was once wild but is now accustomed to humans."}],"priority":"★★☆"},"related_words":{"derivatives":["unsavaged (adj.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unsavage\" is a less common and somewhat archaic term. It is used to describe the act of removing the characteristics of savagery from something, whether it be a person, a place, or an idea. It often implies a process of civilization, refinement, or restoration. Due to its infrequent use and somewhat abstract meaning, it is more likely to be encountered in advanced texts or formal discussions."},"example_sentences":[{"sentence":"The project aimed to unsavage the once-polluted river, restoring its ecosystem.","translation":"そのプロジェクトは、かつて汚染されていた川を元の状態に戻し、生態系を回復させることを目的としていた。","type":"verb","meaning_category":"場所を自然の状態に戻す"},{"sentence":"Education was seen as a way to unsavage the minds of the young, instilling values of reason and compassion.","translation":"教育は、若者の心を野蛮な状態から解放し、理性と慈悲の価値観を植え付ける方法と見なされていた。","type":"verb","meaning_category":"人を文明化する"}]}