{"word":"incoherently","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"支離滅裂に、不明瞭に、筋が通らない様子で","english_definition":"in a way that is difficult to understand; not clearly or logically expressed.","examples":[{"sentence":"He was babbling incoherently, making it impossible to understand what had happened.","translation":"彼は支離滅裂にわめき散らしていて、何が起こったのか理解することが不可能だった。"},{"sentence":"She spoke incoherently, her words tumbling over each other in her haste.","translation":"彼女は不明瞭に話し、急いでいるせいで言葉が互いに重なり合っていた。"},{"sentence":"The report was written so incoherently that no one could make sense of it.","translation":"その報告書は非常に支離滅裂に書かれていたため、誰も意味を理解できなかった。"}],"collocations":["speak incoherently (支離滅裂に話す)","write incoherently (支離滅裂に書く)","mutter incoherently (支離滅裂につぶやく)","babble incoherently (支離滅裂にわめく)"],"synonyms":["unintelligibly","confusedly","muddledly","ramblingly","disconnectedly","illogically"],"antonyms":["coherently","clearly","logically","understandably"]}],"etymology":{"value":"\"Incoherently\" is derived from the adjective \"incoherent,\" which comes from the Latin word \"cohaerere\" meaning \"to stick together.\" The prefix \"in-\" negates the meaning, so \"incoherent\" means \"not sticking together,\" referring to a lack of logical connection or clarity. The suffix \"-ly\" transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnkəˈhɪərəntli/","syllables":"in-co-her-ent-ly"},"inflection":{"notes":"As an adverb, \"incoherently\" does not have different inflections."},"usage_notes":{"explanation":"\"Incoherently\" describes the manner in which someone speaks, writes, or expresses themselves when their thoughts are not logically connected or easily understood. It often suggests a state of confusion, agitation, or intoxication. The adverb highlights the lack of clarity and order in the communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted incoherence after the accident.","correct":"✓ He acted incoherently after the accident.","note":"\"Incoherence\" is a noun, while \"incoherently\" is an adverb. The adverb is needed to describe how he acted."},{"incorrect":"✗ The speech was incoherent, so he spoke coherence.","correct":"✓ The speech was incoherent, so he spoke incoherently.","note":"\"Coherence\" is a noun, while \"incoherently\" is an adverb. The adverb is needed to describe how he spoke."}],"priority":"★★☆"},"related_words":{"derivatives":["incoherent (adjective: 支離滅裂な、不明瞭な)","incoherence (noun: 支離滅裂、不明瞭さ)","coherently (adverb: 一貫して、筋が通って)","coherent (adjective: 一貫した、筋が通った)","coherence (noun: 一貫性、整合性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"incoherently\" means in a way that is difficult to understand because the ideas are not clearly connected or organized. It is used to describe speech or writing that lacks logical flow or clarity. This word is more commonly used in formal contexts or when describing complex situations where communication is significantly impaired."},"example_sentences":[{"sentence":"The witness testified incoherently, making it difficult for the jury to follow his account.","translation":"証人は支離滅裂に証言したため、陪審員が彼の説明を理解するのは困難だった。","type":"general","meaning_category":"manner of speaking"},{"sentence":"Due to the high fever, she was mumbling incoherently.","translation":"高熱のため、彼女は支離滅裂につぶやいていた。","type":"cause and effect","meaning_category":"state of confusion"},{"sentence":"The document was translated so poorly that it read incoherently.","translation":"その文書は非常に拙く翻訳されたため、支離滅裂に読めた。","type":"quality of writing","meaning_category":"lack of clarity"}]}