{"word":"grazingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"放牧しながら、草を食みながら","english_definition":"In a manner that involves grazing; feeding on growing grass or vegetation.","examples":[{"sentence":"The sheep moved grazingly across the hillside.","translation":"羊たちは丘の斜面を草を食みながら移動した。"},{"sentence":"Cattle are grazingly managed to improve pasture health.","translation":"牧草地の健康を改善するために、牛は放牧的に管理されている。"}],"collocations":["move grazingly","manage grazingly"],"synonyms":["pasturingly","browsingly"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'graze' (to feed on growing grass) with the addition of the suffix '-ingly', indicating a manner or way of doing something.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡreɪzɪŋli/","syllables":"gra-zing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Grazingly' describes an action performed in the manner of grazing, typically by animals feeding on grass or other vegetation. It emphasizes the continuous or gradual nature of the feeding process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cows were grazingly happy.","correct":"✓ The cows were grazing happily.","note":"'Grazingly' describes the manner of feeding, not a state of being. Use 'happily' to describe the cows' emotional state."}],"priority":"★★☆"},"related_words":{"derivatives":["graze (verb, noun)","grazing (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The adverb 'grazingly' is a relatively rare word that describes how something is done in a manner of grazing. It is mostly used in contexts related to animal husbandry or ecology where the act of feeding on growing vegetation is emphasized. Due to its specific and uncommon usage, it is more likely to be encountered in specialized texts rather than general conversation."},"example_sentences":[{"sentence":"The herd of bison spread out grazingly across the prairie.","translation":"バイソンの群れは草原に散らばり、草を食みながら進んだ。","type":"adverb","meaning_category":"放牧しながら"},{"sentence":"The land was grazingly used to prevent overgrowth.","translation":"土地は草が生い茂るのを防ぐために、放牧的に利用された。","type":"adverb","meaning_category":"放牧しながら"}]}