{"word":"nonpatently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"明白でなく、特許権を有しない方法で","english_definition":"In a manner that is not obvious or patented.","examples":[{"sentence":"The invention was designed nonpatently to avoid infringing on existing patents.","translation":"その発明は、既存の特許を侵害しないように、明白でない方法で設計されました。"},{"sentence":"The process was implemented nonpatently, using publicly available knowledge.","translation":"そのプロセスは、公に入手可能な知識を使用して、特許権を有しない方法で実行されました。"}],"collocations":["designed nonpatently","implemented nonpatently","used nonpatently"],"synonyms":["unobtrusively","inconspicuously","unobviously","discreetly"],"antonyms":["patently","obviously","conspicuously"]}],"etymology":{"value":"Derived from 'non-' (not) + 'patently' (in a clear and obvious manner, or in a manner protected by a patent).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈpeɪtəntli/","syllables":"non-pa-tent-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Nonpatently' is used to describe actions or designs that are intentionally created or implemented in a way that does not infringe on existing patents or is not obvious enough to be patentable. It is often used in legal or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company used the technology non-patently.","correct":"✓ The company used the technology in a non-patented way.","note":"While 'nonpatently' is correct, it is less common. Using 'in a non-patented way' is often clearer and more easily understood."}],"priority":"★☆☆"},"related_words":{"derivatives":["patent (noun, verb, adjective)","patently (adverb)","nonpatentable (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonpatently' is a specialized term primarily used in legal and technical discussions related to intellectual property. It indicates that something is done or designed in a way that avoids patent infringement or is not eligible for patent protection due to its lack of novelty or obviousness. Its usage is rare outside of these specific contexts."},"example_sentences":[{"sentence":"The software was developed nonpatently to ensure it could be freely distributed.","translation":"そのソフトウェアは、自由に配布できるように、特許権を有しない方法で開発されました。","type":"adverb","meaning_category":"Avoiding patent protection"},{"sentence":"The company aimed to create a product that functioned similarly but was designed nonpatently.","translation":"その会社は、同様に機能する製品を作成することを目指しましたが、特許権を有しないように設計されました。","type":"adverb","meaning_category":"Avoiding patent infringement"}]}