{"word":"buyback","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(企業による)自社株買い、買い戻し","english_definition":"the repurchase by a company of its own shares in the open market.","examples":[{"sentence":"The company announced a $1 billion buyback program.","translation":"その会社は10億ドルの自社株買いプログラムを発表した。"},{"sentence":"Shareholders often favor buybacks as a way to increase earnings per share.","translation":"株主は、一株当たり利益を増加させる方法として、自社株買いを好むことが多い。"},{"sentence":"The buyback is intended to boost the company's stock price.","translation":"その自社株買いは、会社の株価を押し上げることを目的としている。"}],"collocations":["stock buyback","share buyback","announce a buyback","initiate a buyback","complete a buyback","buyback program","buyback plan"],"synonyms":["share repurchase","stock repurchase"],"antonyms":["stock issuance","share offering"]},{"part_of_speech":"verb","definition":"(企業が)自社株を買い戻す","english_definition":"to repurchase one's own shares in the open market.","examples":[{"sentence":"The company decided to buy back shares to return value to shareholders.","translation":"その会社は、株主に価値を還元するために自社株を買い戻すことを決定した。"},{"sentence":"They plan to buy back up to 10% of their outstanding shares.","translation":"彼らは発行済み株式の最大10％を買い戻す計画だ。"}],"collocations":["buy back shares","buy back stock"],"synonyms":["repurchase shares","repurchase stock"],"antonyms":["issue shares","offer shares"]},{"part_of_speech":"noun","definition":"(メーカーなどによる)買い戻し、回収","english_definition":"the act of a manufacturer or retailer buying back a product from a customer, often as part of a promotion or recall.","examples":[{"sentence":"The car company offered a buyback program for vehicles with faulty airbags.","translation":"その自動車会社は、欠陥のあるエアバッグを搭載した車両の買い戻しプログラムを提供した。"},{"sentence":"The electronics store has a buyback program for old cell phones.","translation":"その電器店には、古い携帯電話の買い戻しプログラムがある。"},{"sentence":"The government implemented a gun buyback program to reduce gun violence.","translation":"政府は、銃による暴力を減らすために銃の買い戻しプログラムを実施した。"}],"collocations":["gun buyback","offer a buyback","implement a buyback","buyback program","buyback event"],"synonyms":["trade-in","return"],"antonyms":["sale"]}],"etymology":{"value":"'Buy' + 'back'. The term is a compound word formed by combining the verb 'buy' with the adverb 'back', indicating the action of purchasing something again, specifically one's own shares or products.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbaɪˌbæk/","syllables":"buy-back"},"inflection":{"noun_plural":"buybacks","verb_forms":{"present_simple":["buyback","buybacks"],"past_simple":"bought back","past_participle":"bought back","present_participle":"buying back"}},"usage_notes":{"explanation":"'Buyback' can refer to two main scenarios: 1) a company repurchasing its own shares (stock buyback) and 2) a manufacturer or retailer buying back products from customers (product buyback). In the context of finance, it almost always refers to stock buybacks. In other contexts, it can refer to product buybacks, such as car buybacks or electronics buybacks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is doing a buy back of their stocks.","correct":"✓ The company is doing a buyback of their stocks.","note":"'Buyback' is often used as a single word, especially as a noun. While 'buy back' (two words) is correct as a verb phrase, the noun form is typically 'buyback' (one word)."},{"incorrect":"✗ The buyback will make the stock price to increase.","correct":"✓ The buyback will cause the stock price to increase. / ✓ The buyback will increase the stock price.","note":"The verb 'make' is not typically used in this context. Use 'cause' or simply use 'increase' as a transitive verb."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":["buy back (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in business and finance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'buyback' generally refers to a company's action of repurchasing its own shares from the market. This is often done to increase the value of the remaining shares or to return capital to shareholders. It can also refer to a manufacturer or retailer buying back products from customers, often due to recalls or promotions. The context usually makes it clear which type of buyback is being discussed. Understanding this term is important for comprehending financial news and corporate strategies."},"example_sentences":[{"sentence":"The company's stock price soared after the announcement of the massive **buyback**.","translation":"大規模な自社株買いの発表後、その会社の株価は急騰した。","type":"noun","meaning_category":"自社株買い"},{"sentence":"The automaker was forced to **buy back** millions of vehicles due to safety concerns.","translation":"その自動車メーカーは、安全上の懸念から数百万台の車両を買い戻さざるを得なかった。","type":"verb","meaning_category":"買い戻す"},{"sentence":"The city council approved a gun **buyback** program to reduce the number of firearms in the community.","translation":"市議会は、地域社会の銃器数を減らすために銃の買い戻しプログラムを承認した。","type":"noun","meaning_category":"買い戻し（銃）"}]}