{"word":"coal-independent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"石炭に依存しない、石炭からの自立","english_definition":"Not dependent on coal; having achieved or aiming for freedom from reliance on coal as an energy source.","examples":[{"sentence":"The country is striving to become coal-independent by investing in renewable energy sources.","translation":"その国は再生可能エネルギー源に投資することで、石炭からの自立を目指している。"},{"sentence":"A coal-independent economy is seen as crucial for combating climate change.","translation":"石炭に依存しない経済は、気候変動と闘うために不可欠であると考えられている。"}],"collocations":["become coal-independent","coal-independent economy","coal-independent future","coal-independent energy policy"],"synonyms":["decarbonized","fossil-fuel-free","renewable-powered","sustainable"],"antonyms":["coal-dependent","coal-reliant","fossil-fuel-dependent"]},{"part_of_speech":"noun","definition":"石炭依存からの脱却を目指すこと","english_definition":"The state or goal of being free from reliance on coal as an energy source.","examples":[{"sentence":"Coal-independence is a key goal of the government's energy policy.","translation":"石炭からの自立は、政府のエネルギー政策の重要な目標である。"},{"sentence":"The transition to coal-independence requires significant investment in renewable energy.","translation":"石炭からの自立への移行には、再生可能エネルギーへの多大な投資が必要である。"}],"collocations":["achieve coal-independence","transition to coal-independence","pursue coal-independence"],"synonyms":["decarbonization","fossil-fuel independence","renewable energy transition"],"antonyms":["coal dependence","coal reliance","fossil fuel reliance"]}],"etymology":{"value":"The word is formed by combining \"coal\" (referring to the fossil fuel), \"independent\" (meaning not reliant on or controlled by something else), and the hyphen to connect them.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊl ɪn.dɪˈpen.dənt/","syllables":"coal-in-de-pen-dent"},"inflection":{"notes":"As an adjective, it can be used to modify nouns. As a noun, it is typically used in a general sense and does not have a plural form."},"usage_notes":{"explanation":"\"Coal-independent\" is often used in discussions about energy policy, climate change, and sustainable development. It describes a state or goal where a region, country, or economy no longer relies on coal for its energy needs, typically by transitioning to renewable energy sources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is coal independent.","correct":"✓ The city is coal-independent.","note":"The hyphen is necessary to correctly form the compound adjective."},{"incorrect":"✗ Coal independence is easy to achieve.","correct":"✓ Coal-independence is difficult to achieve.","note":"While grammatically correct, the corrected sentence reflects the reality that achieving coal independence is a complex and challenging process."}],"priority":"★★☆"},"related_words":{"derivatives":["coal (noun)","independence (noun)","independent (adjective)"],"related_terms":["renewable energy","sustainable energy","decarbonization","fossil fuels","climate change"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in specialized contexts related to energy and environmental policy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coal-independent' is a compound adjective and noun used in the context of energy policy and environmental sustainability. It signifies a state where an entity (like a country or region) has transitioned away from reliance on coal as a primary energy source, typically through investments in renewable energy. Understanding this term requires familiarity with discussions around climate change, decarbonization, and sustainable energy practices."},"example_sentences":[{"sentence":"The government aims to make the country coal-independent within the next decade.","translation":"政府は今後10年以内に国を石炭から自立させることを目指している。","type":"adjective","meaning_category":"石炭に依存しない"},{"sentence":"Achieving coal-independence requires a significant shift in energy infrastructure.","translation":"石炭からの自立を達成するには、エネルギーインフラの大幅な転換が必要である。","type":"noun","meaning_category":"石炭依存からの脱却"}]}