{"word":"quadrilled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(紙などが)方眼の、升目のある","english_definition":"marked with a grid of squares; having a pattern of squares.","examples":[{"sentence":"quadrilled paper","translation":"方眼紙"},{"sentence":"a quadrilled notebook","translation":"方眼ノート"}],"collocations":["quadrilled paper","quadrilled notebook","quadrilled surface"],"synonyms":["squared","gridded","graph paper"],"antonyms":["plain","unlined"]}],"etymology":{"value":"The word \"quadrilled\" comes from the French word \"quadrille\", which refers to a square dance. The word \"quadrille\" itself is derived from the Spanish word \"cuadrilla\", meaning a small troop of soldiers or a group of people. Ultimately, it comes from the Latin word \"quadrus\", meaning square. The connection to the square shape is what gives \"quadrilled\" its meaning of being marked with squares.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkwɒdrɪld","syllables":"quad-rilled"},"inflection":{"notes":"This is the past participle form of the verb 'to quadrille', but it is primarily used as an adjective."},"usage_notes":{"explanation":"The word \"quadrilled\" is most commonly used to describe paper or other surfaces that have been marked with a grid of squares. It is often used in technical drawing, mathematics, and other fields where precise measurements and diagrams are required. While the verb form \"to quadrille\" exists, it is rarely used in modern English, except perhaps in historical contexts relating to the dance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a quadrilled ruler to draw the line.","correct":"✓ I used a ruler on quadrilled paper to draw the line.","note":"A ruler itself is not typically quadrilled. You would use a ruler in conjunction with quadrilled paper."},{"incorrect":"✗ The wall was quadrilled with paint.","correct":"✓ The wall was painted with a quadrille pattern.","note":"While you could theoretically paint a quadrilled pattern on a wall, it's not a common usage. It's more common to say it was painted with a quadrille pattern."}],"priority":"★☆☆"},"related_words":{"derivatives":["quadrille (noun: a square dance; a piece of music for a quadrille)","quadrangle (noun: a four-sided enclosure, often a courtyard)","square (noun/adjective: a shape with four equal sides and four right angles)","grid (noun: a network of lines that cross each other to form a series of squares or rectangles)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"quadrilled\" is a relatively uncommon adjective used to describe something marked with a grid of squares. It's more likely to be encountered in technical or academic contexts, such as describing paper used for graphing or technical drawings. It's not typically used in everyday conversation. Understanding the root word \"quad-\" (meaning four) and its association with squares can help in understanding the meaning of \"quadrilled.\""},"example_sentences":[{"sentence":"The architect used **quadrilled** paper to create detailed blueprints.","translation":"建築家は詳細な設計図を作成するために方眼紙を使用した。","type":"adjective","meaning_category":"方眼の"},{"sentence":"She preferred writing in a **quadrilled** notebook for her math class.","translation":"彼女は数学の授業のために方眼ノートに書くのを好んだ。","type":"adjective","meaning_category":"升目のある"},{"sentence":"The artist created a mosaic using **quadrilled** tiles.","translation":"アーティストは升目のあるタイルを使ってモザイクを作成した。","type":"adjective","meaning_category":"升目のある"}]}