{"word":"Dieticians","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"栄養士（専門的な資格を持つ）","english_definition":"Qualified health professionals who assess, diagnose and treat dietary and nutritional problems. They use scientific principles of nutrition to advise people on how to improve their health through diet.","examples":[{"sentence":"Dieticians provide personalized meal plans for patients with diabetes.","translation":"栄養士は糖尿病患者のために個別の食事プランを提供する。"},{"sentence":"The hospital employs several dieticians to ensure patients receive proper nutrition.","translation":"その病院では、患者が適切な栄養を摂取できるよう、数名の栄養士を雇用している。"},{"sentence":"Consult a dietician for advice on managing your weight.","translation":"体重管理のアドバイスについては、栄養士に相談してください。"}],"collocations":["registered dietician","clinical dietician","consult a dietician","see a dietician","work as a dietician"],"synonyms":["nutritionist","diet expert","food specialist"],"antonyms":[],"notes":"Dieticians are different from nutritionists. Dieticians are regulated healthcare professionals licensed to assess, diagnose, and treat nutritional problems. Nutritionists may not have the same level of training or qualifications."}],"etymology":{"value":"The word 'dietician' is derived from 'diet' (from Greek 'diaita' meaning 'way of life, regimen') and the suffix '-ician' (indicating a practitioner or expert).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪ.əˈtɪʃ.ənz/","syllables":"Di-e-ti-cianz"},"inflection":{"noun_plural":"Dieticians"},"usage_notes":{"explanation":"'Dieticians' refers to multiple individuals who are qualified and registered health professionals specializing in diet and nutrition. They provide evidence-based dietary advice and interventions to manage and treat various health conditions. They often work in hospitals, clinics, private practice, and public health settings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dieticians are the same as nutritionists.","correct":"✓ Dieticians are regulated healthcare professionals, while nutritionists may not have the same qualifications.","note":"Dieticians have specific qualifications and are regulated, whereas the term 'nutritionist' is less regulated and can be used by individuals with varying levels of training."},{"incorrect":"✗ I saw a dietician for a general health checkup.","correct":"✓ I saw a doctor for a general health checkup, and a dietician for dietary advice.","note":"Dieticians specialize in dietary and nutritional advice, not general health checkups."}],"priority":"★★☆"},"related_words":{"derivatives":["dietetics (the science of applying nutritional principles to health)","dietary (relating to diet)","diet (the kinds of food that a person, animal, or community habitually eats)"],"phrases":["personalized diet plan","nutritional assessment","dietary guidelines","food allergies","weight management"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in health and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'dieticians' refers to trained and qualified health professionals who give advice about food and nutrition. They help people manage health conditions like diabetes or obesity through diet. The term is used in health-related discussions and may appear in articles about nutrition or medical advice. It's important to distinguish dieticians from nutritionists, as dieticians have specific qualifications and are regulated."},"example_sentences":[{"sentence":"The **dieticians** at the clinic helped me create a healthy eating plan.","translation":"クリニックの栄養士たちは、私が健康的な食事プランを作るのを手伝ってくれた。","type":"noun","meaning_category":"professionals"},{"sentence":"**Dieticians** play a crucial role in managing chronic diseases through dietary interventions.","translation":"栄養士は、食事療法による介入を通じて慢性疾患を管理する上で重要な役割を果たす。","type":"noun","meaning_category":"role"},{"sentence":"The team of **dieticians** and doctors worked together to improve patient outcomes.","translation":"栄養士と医師のチームは協力して、患者の転帰を改善した。","type":"noun","meaning_category":"team"}]}