{"word":"pastiches","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パスティーシュ（他の芸術家や作品のスタイルを模倣した作品）の複数形","english_definition":"plural of pastiche: artistic work consisting of a medley of pieces taken from various sources; a work that imitates the style of some previous artist","examples":[{"sentence":"The museum displayed a collection of pastiches, each imitating a different famous painter.","translation":"美術館では、それぞれ異なる有名な画家を模倣したパスティーシュのコレクションが展示されました。"},{"sentence":"Her novel was criticized for being a series of pastiches rather than an original work.","translation":"彼女の小説は、オリジナル作品というよりも、一連のパスティーシュであると批判されました。"}],"collocations":["create pastiches","literary pastiches","musical pastiches","artistic pastiches"],"synonyms":["imitation","parody","spoof","burlesque","medley","hodgepodge"],"antonyms":["original work","authentic piece"]}],"etymology":{"value":"フランス語の \"pastiche\" から来ており、イタリア語の \"pasticcio\"（パイ、ごった煮、寄せ集め）に由来します。これは、ラテン語の \"pasta\"（生地、練り物）から派生しています。元々は様々な材料を混ぜ合わせた料理を指し、それが転じて、様々な芸術家のスタイルを混ぜ合わせた作品を意味するようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/pæˈstiːʃɪz/","syllables":"pas-tee-shiz"},"inflection":{"noun_plural":"pastiches"},"usage_notes":{"explanation":"\"Pastiche\" は、単に模倣するだけでなく、異なるスタイルや要素を意図的に組み合わせることで、新しい表現を生み出すことを指します。パロディや模倣と似ていますが、必ずしも風刺的な意図を持つとは限りません。むしろ、敬意や遊び心を持って既存のスタイルを利用することが多いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He created a pastiche of his own style.","correct":"✓ He created a pastiche of various artists' styles.","note":"Pasticheは、通常、複数の異なるソースからの要素を組み合わせたものを指します。自分のスタイルを模倣する場合は、自己模倣や自己言及といった別の表現が適切です。"},{"incorrect":"✗ The painting was a pastiche, so it was worthless.","correct":"✓ The painting was a pastiche, but it was still valuable and interesting.","note":"Pasticheは、必ずしも価値がないわけではありません。意図的な模倣と組み合わせによって、独自の芸術的価値を生み出すことがあります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["pasticheur (パスティーシュ作家)"],"related_terms":["parody","homage","imitation","collage","montage"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pastiches\" は、芸術、文学、音楽などの分野で使用される専門用語です。さまざまなソースからスタイルや要素を模倣し、組み合わせた作品を指します。単なる模倣ではなく、意図的な組み合わせによって新しい表現を生み出すニュアンスがあります。そのため、芸術や文化に関する議論で頻繁に登場します。"},"example_sentences":[{"sentence":"The film is a series of visual pastiches, referencing classic movies from the 1950s and 60s.","translation":"その映画は、1950年代と60年代の古典的な映画を参照した、視覚的なパスティーシュの連続です。","type":"noun","meaning_category":"芸術作品"},{"sentence":"His architectural designs are often described as pastiches of different historical styles.","translation":"彼の建築デザインは、さまざまな歴史的様式のパスティーシュとしてよく説明されます。","type":"noun","meaning_category":"建築"},{"sentence":"The composer created musical pastiches by blending elements of jazz, classical, and folk music.","translation":"作曲家は、ジャズ、クラシック、フォーク音楽の要素をブレンドすることで、音楽的なパスティーシュを作成しました。","type":"noun","meaning_category":"音楽"}]}