{"word":"tensiometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"表面張力測定法、界面張力測定法","english_definition":"The measurement of surface tension or interfacial tension.","examples":[{"sentence":"Tensiometry is used to characterize the surface properties of liquids.","translation":"表面張力測定法は、液体の表面特性を評価するために用いられる。"},{"sentence":"Various tensiometry techniques exist, each suited for different types of interfaces.","translation":"様々な表面張力測定法が存在し、それぞれ異なる種類の界面に適している。"}],"collocations":["surface tensiometry (表面張力測定)","interfacial tensiometry (界面張力測定)","dynamic tensiometry (動的表面張力測定)","pendant drop tensiometry (懸滴法表面張力測定)","Wilhelmy plate tensiometry (ウィルヘルミープレート法表面張力測定)"],"synonyms":["surface tension measurement","interfacial tension measurement"],"antonyms":[]}],"etymology":{"value":"「tension」（張力）と「-metry」（測定法）を組み合わせた造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛnsiˈɒmɪtri/","syllables":"ten-si-om-e-try"},"inflection":{"noun_plural":"tensiometries"},"usage_notes":{"explanation":"Tensiometry is a scientific technique used to measure the surface tension of a liquid or the interfacial tension between two liquids, or between a liquid and a solid. Surface tension is the force that causes the surface of a liquid to contract to the smallest possible area. Interfacial tension is the force that exists at the interface between two immiscible liquids or between a liquid and a solid. Tensiometry is used in a variety of applications, including the study of surfactants, the development of new materials, and the quality control of industrial products.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tensiometry was measured.","correct":"✓ The surface tension was measured using tensiometry.","note":"Tensiometry is the method, not the property being measured. The surface tension is measured by tensiometry."}],"priority":"★★☆"},"related_words":{"derivatives":["tensiometer (表面張力計、界面張力計)"],"related_fields":["surface chemistry","colloid science","material science"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tensiometry is a specialized term referring to the measurement of surface tension or interfacial tension. It's primarily used in scientific and technical contexts, such as chemistry, physics, and materials science. The term itself combines 'tension' (referring to the force at the surface or interface) and '-metry' (denoting a measurement method). Understanding this term requires familiarity with basic concepts of surface science and measurement techniques."},"example_sentences":[{"sentence":"Pendant drop tensiometry is a common method for measuring interfacial tension.","translation":"懸滴法表面張力測定は、界面張力を測定するための一般的な方法である。","type":"general","meaning_category":"definition"},{"sentence":"The tensiometry results indicated a high surface tension for the solution.","translation":"表面張力測定の結果は、溶液の高い表面張力を示した。","type":"application","meaning_category":"application"}]}