{"word":"Turbocars","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A fictional brand or type of car, likely characterized by having a turbocharger or being very fast.","english_definition":"A fictional brand or type of car, likely characterized by having a turbocharger or being very fast. This word is often used in contexts related to racing, high performance, or futuristic vehicles.","examples":[{"sentence":"In the racing game, I always choose Turbocars because they have the best acceleration.","translation":"そのレースゲームでは、加速が一番良いからいつもターボカーズを選ぶんだ。"},{"sentence":"The movie featured flying Turbocars in a futuristic city.","translation":"その映画には、未来都市を飛ぶターボカーズが登場した。"}],"collocations":["racing Turbocars","flying Turbocars","futuristic Turbocars"],"synonyms":["race cars","sports cars","supercars"],"antonyms":["slow cars","regular cars"]}],"etymology":{"value":"The word is a combination of 'turbo,' referring to a turbocharger (a device that increases engine power), and 'cars,' indicating automobiles.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɜːrboʊˌkɑːrz/","syllables":"Tur-bo-cars"},"inflection":{"noun_plural":"Turbocars"},"usage_notes":{"explanation":"'Turbocars' is typically used in fictional or imaginative contexts. It implies a high-performance vehicle, often associated with speed and advanced technology. It is not a recognized brand or type of car in the real world.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new Turbocars from Toyota.","correct":"✓ I bought a new sports car from Toyota.","note":"'Turbocars' is not a real brand, so you can't buy one from a manufacturer like Toyota."}],"priority":"N/A"},"related_words":{"derivatives":["turbo","car"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, mostly in fictional contexts.","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"'Turbocars' is a made-up word, so it doesn't have a specific readability level. It's easy to understand in context, especially if the reader is familiar with the term 'turbo' in relation to cars."},"example_sentences":[{"sentence":"The video game featured a variety of customizable Turbocars.","translation":"そのビデオゲームには、様々なカスタマイズ可能なターボカーズが登場した。","type":"noun","meaning_category":"fictional cars"},{"sentence":"He dreamed of driving Turbocars on Mars.","translation":"彼は火星でターボカーズを運転する夢を見た。","type":"noun","meaning_category":"fictional cars"}]}