{"word":"codesigners","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数の共同設計者","english_definition":"plural of codesigner: multiple individuals who collaboratively design something.","examples":[{"sentence":"The project involved a team of codesigners from different disciplines.","translation":"そのプロジェクトには、異なる分野からの複数の共同設計者からなるチームが関わっていました。"},{"sentence":"The codesigners worked closely with the community to ensure the design met their needs.","translation":"共同設計者たちは、設計がコミュニティのニーズを満たすように、コミュニティと密接に連携しました。"}],"collocations":["team of codesigners","collaborative codesigners","lead codesigners"],"synonyms":["collaborative designers","joint designers","participatory designers"],"antonyms":["sole designer","individual designer"]}],"etymology":{"value":"Formed by combining \"co-\" (meaning \"together\" or \"jointly\") with \"designers\" (plural of \"designer,\" referring to individuals who create designs).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊdɪˈzaɪnərz/","syllables":"co-de-sign-ers"},"inflection":{"noun_plural":"codesigners"},"usage_notes":{"explanation":"\"Codesigners\" refers to a group of designers working together on a project, often emphasizing a collaborative and participatory design process. The term highlights the shared responsibility and joint effort in creating a design.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The codesigner are responsible for the final product.","correct":"✓ The codesigners are responsible for the final product.","note":"Use the plural form \"codesigners\" when referring to multiple designers. Also, the verb must agree with the plural subject."},{"incorrect":"✗ She is one of the codesigner.","correct":"✓ She is one of the codesigners.","note":"When using \"one of,\" follow it with a plural noun."}],"priority":"★★☆"},"related_words":{"derivatives":["codesign (verb, noun): to design collaboratively; the act of designing collaboratively","codesign (adjective): relating to collaborative design"],"related_terms":["design thinking","user-centered design","participatory design","collaborative design"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"codesigners\" is a specialized term used in design and development contexts to refer to multiple designers working collaboratively on a project. It implies a shared design process and responsibility. Understanding the term requires familiarity with design principles and collaborative work environments."},"example_sentences":[{"sentence":"The software was created by a team of **codesigners** and user representatives.","translation":"そのソフトウェアは、複数の共同設計者とユーザー代表者からなるチームによって作成されました。","type":"general"},{"sentence":"The **codesigners** focused on creating an inclusive and accessible interface.","translation":"共同設計者たちは、包括的でアクセスしやすいインターフェースの作成に焦点を当てました。","type":"specific"},{"sentence":"The success of the project was attributed to the effective collaboration among the **codesigners**.","translation":"プロジェクトの成功は、共同設計者間の効果的なコラボレーションによるものとされました。","type":"general"}]}