{"word":"Magyarization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マジャール化、ハンガリー化：非ハンガリー系の国民や文化をハンガリーの文化や言語に同化させる政策または過程","english_definition":"The policy or process of assimilating non-Hungarian people or culture into Hungarian culture and language.","examples":[{"sentence":"Magyarization policies in the late 19th century aimed to create a unified Hungarian identity.","translation":"19世紀後半のマジャール化政策は、統一されたハンガリーのアイデンティティを創出することを目的としていた。"},{"sentence":"The effects of Magyarization are still visible in some regions today.","translation":"マジャール化の影響は、今日でも一部の地域で見ることができる。"}],"collocations":["policy of Magyarization","process of Magyarization","effects of Magyarization"],"synonyms":["Hungarianization","assimilation","cultural assimilation"],"antonyms":["cultural preservation","multiculturalism"]}],"etymology":{"value":"The term 'Magyarization' comes from 'Magyar,' the Hungarian word for the Hungarian people and language, combined with the suffix '-ization,' indicating a process of becoming or making something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmæɡjəraɪˈzeɪʃən/","syllables":"Mag-yar-i-za-tion"},"inflection":{"noun_plural":"Magyarizations"},"usage_notes":{"explanation":"'Magyarization' refers specifically to the historical policies and processes aimed at assimilating non-Hungarian populations within the Kingdom of Hungary into Hungarian culture. This often involved promoting the Hungarian language, suppressing other languages, and encouraging the adoption of Hungarian customs and names. It is a term often associated with historical and political contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Magyarization of the United States.","correct":"✓ The assimilation of immigrants in the United States.","note":"'Magyarization' is specific to the historical context of Hungary. For general cultural assimilation, use terms like 'assimilation' or 'cultural assimilation.'"},{"incorrect":"✗ Magyarization is always a positive process.","correct":"✓ Magyarization can be a controversial process due to its impact on minority cultures.","note":"The term often carries negative connotations due to its impact on minority cultures and languages. It is important to consider the perspectives of those affected by these policies."}],"priority":"★★☆"},"related_words":{"derivatives":["Magyarize (verb)"],"related_terms":["assimilation","cultural assimilation","Hungarian","nationalism","Kingdom of Hungary"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Magyarization' is a specialized term referring to the historical assimilation policies of Hungary. It is typically encountered in historical or political contexts when discussing the cultural and linguistic impacts on minority populations within the former Kingdom of Hungary. Understanding the term requires knowledge of European history and the concept of cultural assimilation."},"example_sentences":[{"sentence":"The government implemented a program of Magyarization to promote Hungarian language and culture.","translation":"政府はハンガリー語と文化を推進するために、マジャール化政策を実施した。","type":"noun","meaning_category":"assimilation policy"},{"sentence":"The local population resisted the Magyarization efforts, striving to maintain their own traditions.","translation":"地元住民はマジャール化の取り組みに抵抗し、独自の伝統を維持しようと努めた。","type":"noun","meaning_category":"assimilation efforts"}]}