{"word":"water-break","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"産気づいて羊水が破水すること","english_definition":"The rupturing of the amniotic sac during labor, releasing amniotic fluid.","examples":[{"sentence":"Her water-break happened at home before she went to the hospital.","translation":"彼女は病院に行く前に自宅で破水した。"},{"sentence":"The doctor confirmed that it was a water-break and labor was imminent.","translation":"医師は破水であり、出産が間近であることを確認した。"}],"collocations":["have a water-break","experience a water-break"],"synonyms":["rupture of membranes","amniotic sac rupture"],"antonyms":[]},{"part_of_speech":"noun","definition":"（主にゴルフ場で）水路、小川、池など","english_definition":"A natural or artificial water feature, such as a stream or pond, on a golf course.","examples":[{"sentence":"The fifth hole has a challenging water-break that golfers must avoid.","translation":"5番ホールには、ゴルファーが避けなければならない難しいウォーターブレイクがある。"},{"sentence":"The water-break adds to the beauty and difficulty of the course.","translation":"ウォーターブレイクは、コースの美しさと難易度を高めている。"}],"collocations":["golf course water-break"],"synonyms":["water hazard"],"antonyms":[]}],"etymology":{"value":"'Water' referring to the amniotic fluid or a body of water, and 'break' referring to the rupture of the amniotic sac or an interruption in the landscape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɔːtərˌbreɪk/","syllables":"wa-ter-break"},"inflection":{"noun_plural":"water-breaks"},"usage_notes":{"explanation":"The term \"water-break\" primarily refers to the rupturing of the amniotic sac during labor, signaling the start of childbirth. In a secondary, less common usage, it can refer to a water feature on a golf course, acting as a hazard. The context usually makes the intended meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She had a waterbreak and then went to work.","correct":"✓ She had a water-break and then went to the hospital.","note":"A water-break indicates the start of labor, so going to the hospital is the appropriate action, not going to work."},{"incorrect":"✗ The waterbreak was too easy to cross on the golf course.","correct":"✓ The water-break (or water hazard) was too easy to cross on the golf course.","note":"Using \"water-break\" in the context of a golf course is less common than \"water hazard,\" but both are acceptable."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["labor","amniotic fluid","water hazard","golf course"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (in the context of childbirth), C1 (in the context of golf)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"water-break\" has two main meanings. The primary meaning refers to the rupturing of the amniotic sac during childbirth, which is a common term in discussions about pregnancy and labor. A secondary, less common meaning refers to a water feature on a golf course, which acts as a hazard. The context usually clarifies which meaning is intended. Understanding both meanings requires a good vocabulary and familiarity with both childbirth and golf terminology."},"example_sentences":[{"sentence":"The midwife explained what to expect after the water-break.","translation":"助産師は破水後に何が起こるかを説明した。","type":"noun","meaning_category":"childbirth"},{"sentence":"The golfer's ball landed in the water-break on the 18th hole.","translation":"ゴルファーのボールは18番ホールのウォーターブレイクに着地した。","type":"noun","meaning_category":"golf"}]}