{"word":"dengue","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"デング熱","english_definition":"An infectious tropical disease caused by the dengue virus, transmitted by mosquitoes, and characterized by fever, headache, muscle and joint pains, and a skin rash.","examples":[{"sentence":"Dengue fever is common in tropical regions.","translation":"デング熱は熱帯地域でよく見られる。"},{"sentence":"She contracted dengue fever during her trip to Southeast Asia.","translation":"彼女は東南アジアへの旅行中にデング熱に感染した。"},{"sentence":"Prevention of dengue fever involves controlling mosquito populations.","translation":"デング熱の予防には、蚊の個体数を制御することが含まれる。"}],"collocations":["dengue fever","dengue virus","contract dengue","prevent dengue","dengue outbreak"],"synonyms":["breakbone fever"],"antonyms":[]}],"etymology":{"value":"The term \"dengue\" is believed to be derived from the Swahili phrase \"ki-denga pepo,\" meaning \"a sudden cramping seizure caused by an evil spirit.\" The Spanish word \"dengue\" may also be related to \"dandy\" or \"dingy,\" referring to the affected person's affected walk or appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛŋɡi/","syllables":"den-gue"},"inflection":{"noun_plural":"dengues"},"usage_notes":{"explanation":"\"Dengue\" is primarily used as a noun to refer to the disease itself. It is important to distinguish between dengue fever and severe dengue (formerly known as dengue hemorrhagic fever), which is a more dangerous form of the illness. Public health campaigns often focus on preventing mosquito bites to control the spread of dengue.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a dengue.","correct":"✓ I have dengue.","note":"\"Dengue\" is an uncountable noun, so it doesn't usually take an article like \"a\" or \"an.\""},{"incorrect":"✗ Dengue are a dangerous disease.","correct":"✓ Dengue is a dangerous disease.","note":"When referring to dengue as a disease in general, use the singular verb form \"is.\" When referring to multiple cases, you could say \"Dengue cases are increasing.\" However, \"dengues\" as a plural noun is rare."}],"priority":"★★☆"},"related_words":{"derivatives":["dengue hemorrhagic fever (デング出血熱)","severe dengue (重症デング熱)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in discussions of global health and travel.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Dengue\" is a term used to describe a tropical disease spread by mosquitoes. It's important to understand this word because dengue fever is a significant health concern in many parts of the world. You'll often see it in news reports about outbreaks or when discussing travel to tropical countries. Knowing the term helps you understand health information and take necessary precautions.","priority":"★★★"},"example_sentences":[{"sentence":"The city is experiencing a dengue outbreak.","translation":"その都市はデング熱の発生を経験している。","type":"noun","meaning_category":"disease"},{"sentence":"Symptoms of dengue include high fever and severe joint pain.","translation":"デング熱の症状には、高熱と激しい関節痛が含まれる。","type":"noun","meaning_category":"disease"},{"sentence":"The government is implementing measures to control the spread of dengue.","translation":"政府はデング熱の蔓延を抑制するための対策を実施している。","type":"noun","meaning_category":"disease"}]}