{"word":"Adepts","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熟練者、達人、精通者 (adept の複数形)","english_definition":"Plural form of adept: a person who is skilled or proficient at something.","examples":[{"sentence":"The organization relies on a network of adepts in various fields.","translation":"その組織は、様々な分野の熟練者たちのネットワークに頼っている。"},{"sentence":"These adepts can solve problems that others find insurmountable.","translation":"これらの達人たちは、他の人が乗り越えられないと考える問題を解決することができる。"}],"collocations":["group of adepts","team of adepts","skilled adepts"],"synonyms":["experts","masters","professionals","specialists","virtuosos"],"antonyms":["amateurs","beginners","novices"]},{"part_of_speech":"noun","definition":"錬金術師、秘術に通じた者 (歴史的な意味合い)","english_definition":"(historical) A person who has attained a high level of skill or knowledge, especially in alchemy or esoteric arts.","examples":[{"sentence":"The ancient texts spoke of adepts who could transmute base metals into gold.","translation":"古代の文献には、卑金属を金に変えることができる錬金術師について書かれていた。"},{"sentence":"Many believed that these adepts possessed secret knowledge of the universe.","translation":"多くの人々は、これらの秘術に通じた者たちが宇宙の秘密の知識を持っていると信じていた。"}],"collocations":["alchemical adepts","esoteric adepts","secret adepts"],"synonyms":["alchemist","magician","sorcerer","wizard"],"antonyms":[]}],"etymology":{"value":"From Latin 'adeptus', past participle of 'adipisci' meaning 'to obtain, attain'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈædɛpts/","syllables":"A-depts"},"inflection":{"noun_plural":"Adepts"},"usage_notes":{"explanation":"'Adepts' is the plural form of 'adept'. It refers to multiple individuals who are highly skilled or knowledgeable in a particular field. In a historical context, it can also refer to individuals skilled in alchemy or esoteric arts. The term implies a high level of mastery and expertise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the adepts.","correct":"✓ He is one of the adepts in the field.","note":"When referring to one person among many, ensure the context is clear about the field of expertise. Using 'adept' as a singular noun requires an article ('an adept')."},{"incorrect":"✗ The adepts was gathered for the conference.","correct":"✓ The adepts were gathered for the conference.","note":"'Adepts' is a plural noun, so it requires a plural verb form ('were')."}],"priority":"★☆☆"},"related_words":{"derivatives":["adept (noun, adjective)","adeptly (adverb)","adeptness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adepts' refers to multiple individuals who are highly skilled or knowledgeable in a specific field. It implies a level of mastery and expertise beyond that of a typical expert. The word is less common in everyday language and is more often found in specialized or technical contexts. Understanding the historical context, particularly in relation to alchemy, can provide a deeper appreciation of the term."},"example_sentences":[{"sentence":"The team of financial adepts managed to turn the company around in just one year.","translation":"金融の達人たちのチームは、わずか1年で会社を立て直すことに成功した。","type":"noun","meaning_category":"熟練者"},{"sentence":"The ancient alchemists were considered adepts in the art of transmutation.","translation":"古代の錬金術師たちは、変成の術の達人であると考えられていた。","type":"noun","meaning_category":"錬金術師"},{"sentence":"The conference brought together adepts from various fields of artificial intelligence.","translation":"その会議には、様々な人工知能分野の熟練者が集まった。","type":"noun","meaning_category":"熟練者"}]}