{"word":"do-nothingism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"無為主義、何もしない主義、不干渉主義","english_definition":"the policy or practice of doing nothing to solve a problem or improve a situation; a belief in non-intervention.","examples":[{"sentence":"The government's do-nothingism during the crisis was widely criticized.","translation":"危機の間における政府の無為主義は広く批判された。"},{"sentence":"His do-nothingism approach to management led to the company's decline.","translation":"彼の経営における無為主義的なアプローチは、会社の衰退につながった。"},{"sentence":"Some argue that do-nothingism is sometimes the best approach in complex situations.","translation":"複雑な状況においては、無為主義こそが最良のアプローチであると主張する人もいる。"}],"collocations":["government do-nothingism (政府の無為主義)","policy of do-nothingism (無為主義の政策)","approach of do-nothingism (無為主義のアプローチ)"],"synonyms":["inaction","apathy","laissez-faire","non-intervention","passivity"],"antonyms":["activism","interventionism","engagement","proactivity"]}],"etymology":{"value":"「do-nothing」+「-ism」。 「do-nothing」は、文字通り「何もしない」という意味で、19世紀中頃から、特に政治的な文脈で、行動を起こさない、または問題を無視する態度を指す言葉として使われるようになった。それに「-ism」が付くことで、特定の主義や傾向を表す名詞となった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈduːˌnʌθɪŋˌɪzəm/","syllables":"doo-nuth-ing-i-sum"},"inflection":{"noun_plural":"do-nothingisms"},"usage_notes":{"explanation":"「**do-nothingism**」は、特に政治や経済、社会問題など、何らかの行動が期待される状況において、意図的にまたは無関心によって行動を起こさない態度や政策を批判的に指す言葉です。しばしば、問題の解決を先送りしたり、悪化させたりする結果を招くと考えられています。ただし、状況によっては、あえて何もしないことが最善の策であるという考えを指す場合もありますが、その場合は肯定的な意味合いは薄いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices do-nothingism in his personal life, always active and busy.","correct":"✓ He practices do-nothingism in his professional life, avoiding taking responsibility.","note":"「do-nothingism」は、活動的で忙しい状態とは矛盾します。責任を回避したり、行動を起こさない状況で使われます。"},{"incorrect":"✗ Do-nothingism is the best way to solve all problems.","correct":"✓ Do-nothingism can sometimes be a valid approach, but not for all problems.","note":"「do-nothingism」が常に最良の解決策であるとは限りません。状況によっては有効な場合もありますが、一般的には批判的な意味合いが強いです。"}],"priority":"★★☆"},"related_words":{"derivatives":["do-nothing (形容詞: 何もしない、無為な; 名詞: 無為な人、役立たず)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な文脈や政治的な議論で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**do-nothingism**」は、あまり一般的ではない単語で、何か問題があるときに、何もしないことを意味します。特に、政府やリーダーが問題解決のために行動を起こさないときに使われます。たとえば、「The government's do-nothingism led to further economic problems.（政府の無為主義は、さらなる経済問題を引き起こした）」のように使います。この単語は、批判的な意味合いで使われることが多いです。"},"example_sentences":[{"sentence":"The senator was accused of do-nothingism after failing to introduce any new legislation.","translation":"その上院議員は、新たな法案を提出しなかったため、無為主義であると非難された。","type":"noun","meaning_category":"無為主義"},{"sentence":"The company's do-nothingism approach to environmental issues has drawn criticism from activists.","translation":"その会社が環境問題に対して無為主義的なアプローチをとっていることが、活動家からの批判を招いている。","type":"noun","meaning_category":"無為主義"},{"sentence":"Some economists argue that do-nothingism is the best policy during certain economic downturns.","translation":"一部の経済学者は、特定の景気後退期には無為主義こそが最良の政策であると主張している。","type":"noun","meaning_category":"無為主義"}]}