{"word":"stridulously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"きしるように、耳障りな音を立てて","english_definition":"In a stridulous manner; with a harsh, grating, or creaking sound.","examples":[{"sentence":"The cicadas chirped stridulously in the summer heat.","translation":"セミが夏の暑さの中、耳障りな音を立てて鳴いた。"},{"sentence":"The old door creaked stridulously as he pushed it open.","translation":"彼が押し開けると、古いドアがきしるように音を立てた。"}],"collocations":["chirp stridulously","creak stridulously","rub stridulously"],"synonyms":["gratingly","harshly","creakingly","raspingly"],"antonyms":["softly","quietly","silently"]}],"etymology":{"value":"Derived from the adjective 'stridulous,' which comes from the Latin word 'stridulus,' meaning 'making a shrill noise.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrɪdjʊləsli/","syllables":"strid-u-lous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Stridulously' describes an action performed with a harsh, grating, or creaking sound. It is often used to describe sounds made by insects, old objects, or mechanical devices. The word emphasizes the unpleasant or irritating quality of the sound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird sang stridulously.","correct":"✓ The cicada chirped stridulously.","note":"'Stridulously' implies a harsh, grating sound, which is not typical of birdsong. Cicadas, crickets, or grasshoppers are more appropriate subjects."},{"incorrect":"✗ She walked stridulously across the room.","correct":"✓ The floorboards creaked stridulously as she walked across the room.","note":"'Stridulously' describes a sound, not a manner of walking. The floorboards, not the person, would be the subject of the action."}],"priority":"★★☆"},"related_words":{"derivatives":["stridulous (adjective: making a harsh, grating sound)","stridulation (noun: the act of making a harsh, grating sound)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Stridulously' is a relatively rare and sophisticated adverb used to describe actions accompanied by harsh, grating, or creaking sounds. It is more likely to be encountered in formal writing or specialized contexts, such as descriptions of nature or mechanical processes. Understanding the root word 'stridulous' is helpful in grasping its meaning. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The rusty gears turned stridulously, protesting every rotation.","translation":"錆びたギアがきしるように回転し、回転するたびに不快な音を立てた。","type":"adverb","meaning_category":"sound"},{"sentence":"The bow was drawn stridulously across the violin strings, producing a discordant note.","translation":"弓がバイオリンの弦の上をきしるように引かれ、不協和音が生じた。","type":"adverb","meaning_category":"sound"}]}