{"word":"Greenway","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"緑道、遊歩道、緑地帯","english_definition":"A path or route, often for recreational use, that is located within a green area or connects green areas.","examples":[{"sentence":"The city has developed a network of greenways for cyclists and pedestrians.","translation":"その都市は、自転車利用者と歩行者のために緑道のネットワークを開発した。"},{"sentence":"We enjoyed a leisurely walk along the greenway.","translation":"私たちは緑道に沿ってのんびりと散歩を楽しんだ。"},{"sentence":"The greenway provides a safe and scenic route to school.","translation":"その緑道は、学校への安全で景色の良い道を提供している。"}],"collocations":["greenway trail","urban greenway","linear greenway","connect to a greenway","walk along a greenway"],"synonyms":["pathway","trail","walkway","parkway","esplanade"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"(地名)グリーンウェイ (英語圏の地名、姓)","english_definition":"A surname or place name, particularly in English-speaking countries.","examples":[{"sentence":"John Greenway is a well-known historian.","translation":"ジョン・グリーンウェイは有名な歴史家だ。"},{"sentence":"Greenway Park is a popular destination for families.","translation":"グリーンウェイ公園は家族連れに人気の場所だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'greenway' combines 'green' (referring to vegetation or natural areas) and 'way' (referring to a path or route). It suggests a route that incorporates or connects green spaces.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡriːnweɪ/","syllables":"Green-way"},"inflection":{"notes":"Noun: Plural is Greenways."},"usage_notes":{"explanation":"The term 'greenway' is often used in urban planning and environmental contexts to describe corridors of green space that provide recreational opportunities, connect communities, and promote ecological conservation. It can refer to a variety of paths, trails, and linear parks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the green way yesterday.","correct":"✓ I went to the greenway yesterday.","note":"'Greenway' is usually one word, not two separate words ('green way'), when referring to the designated path or route."}],"priority":"★☆☆"},"related_words":{"derivatives":["green (adjective)","way (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (urban planning, recreation).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Greenway' is a term that describes a path or route, often for walking or cycling, that is located in or connects green areas like parks or natural spaces. It's a concept often used in city planning to create more accessible and enjoyable outdoor spaces. While not a very common word in everyday conversation, it's important to understand its meaning if you encounter it in discussions about urban development or recreation."},"example_sentences":[{"sentence":"The local council is planning to extend the greenway along the river.","translation":"地方議会は川沿いの緑道を延長する計画を立てている。","type":"noun","meaning_category":"緑道"},{"sentence":"Many residents use the greenway for their daily exercise.","translation":"多くの住民が毎日の運動のために緑道を利用している。","type":"noun","meaning_category":"緑道"},{"sentence":"The Greenway family has lived in this town for generations.","translation":"グリーンウェイ家はこの町に何世代も住んでいる。","type":"proper noun","meaning_category":"姓"}]}