{"word":"Bowdlerization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（書物・劇などからの）わいせつ・不快な部分の削除、修正、検閲","english_definition":"the act of removing parts of a book, play, film, etc. that are considered likely to offend people.","examples":[{"sentence":"The bowdlerization of classic literature is a controversial topic.","translation":"古典文学のボウダライゼーション（わいせつ・不快な部分の削除）は議論の的となる話題だ。"},{"sentence":"Some argue that bowdlerization distorts the original author's intent.","translation":"ボウダライゼーションは原作者の意図を歪めると主張する人もいる。"},{"sentence":"The film underwent bowdlerization to make it suitable for a wider audience.","translation":"その映画は、より幅広い観客層に適するようにボウダライゼーションを受けた。"}],"collocations":["literary bowdlerization (文学作品のボウダライゼーション)","historical bowdlerization (歴史のボウダライゼーション)","film bowdlerization (映画のボウダライゼーション)"],"synonyms":["censorship","expurgation","sanitization","purification","editing","redaction"],"antonyms":["preservation","restoration","unabridgment"]}],"etymology":{"value":"19世紀初頭に、トーマス・ボウダラー（Thomas Bowdler, 1754-1825）というイギリスの医師・編集者にちなんで名付けられた。彼はシェイクスピア作品やギボンの『ローマ帝国衰亡史』から、彼が「不適切」と判断した箇所を削除・修正した版を出版した。彼の名前は、そのような検閲行為の代名詞となった。","priority":"★★★"},"pronunciation":{"ipa":"/ˌboʊdləraɪˈzeɪʃən/","syllables":"Bowd-ler-i-za-tion"},"inflection":{"noun_plural":"Bowdlerizations"},"usage_notes":{"explanation":"「**Bowdlerization**」は、ある作品からわいせつ、不快、または政治的に不適切とみなされる部分を削除または修正する行為を指します。この言葉は、トーマス・ボウダラーという人物に由来し、彼はシェイクスピアの作品から「不適切」な要素を取り除いた版を出版したことで知られています。ボウダライゼーションは、検閲の一形態と見なされることが多く、オリジナル作品の完全性を損なう可能性があるため、しばしば議論の対象となります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bowdlerization was done to make the book more accurate.","correct":"✓ The bowdlerization was done to make the book more acceptable (to a particular audience).","note":"ボウダライゼーションは、作品をより正確にするためではなく、より受け入れやすくするために行われる。"},{"incorrect":"✗ He bowdlerized the story by adding more details.","correct":"✓ He bowdlerized the story by removing offensive details.","note":"ボウダライゼーションは、詳細を追加するのではなく、不快な詳細を削除することを意味する。"}],"priority":"★★☆"},"related_words":{"derivatives":["bowdlerize (動詞: ボウダライゼーションする、わいせつ・不快な部分を削除する)","bowdlerized (形容詞: ボウダライゼーションされた)","bowdlerizer (名詞: ボウダライゼーションを行う人)"],"synonyms":["censorship","expurgation","sanitization","purification"],"antonyms":["unexpurgated","uncensored"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Bowdlerization**」は、本や映画などの作品から、わいせつだったり、不快だったり、受け入れがたいと思われる部分を削除したり、修正したりすることを指す言葉です。この言葉は、トーマス・ボウダラーという人が、シェイクスピアの作品を「きれい」にしたことに由来します。ボウダライゼーションは、作品を検閲することと見なされることが多く、オリジナル作品の持つ意味や価値を損なう可能性があるため、議論の対象となることがあります。例えば、昔の小説を現代の読者向けにボウダライゼーションすることは、作者の意図を尊重しない行為だと批判されることがあります。"},"example_sentences":[{"sentence":"The publisher decided to proceed with the **bowdlerization** of the novel to appeal to a wider audience.","translation":"出版社は、より幅広い読者にアピールするために、その小説のボウダライゼーションを進めることを決定した。","type":"noun","meaning_category":"わいせつ・不快な部分の削除"},{"sentence":"Critics often argue that **bowdlerization** can distort the original message and artistic value of a work.","translation":"批評家はしばしば、ボウダライゼーションは作品の本来のメッセージや芸術的価値を歪める可能性があると主張する。","type":"noun","meaning_category":"わいせつ・不快な部分の削除"},{"sentence":"The school board considered the **bowdlerization** of certain books in the curriculum to align with community standards.","translation":"教育委員会は、地域社会の基準に合わせるために、カリキュラムにある特定の書籍のボウダライゼーションを検討した。","type":"noun","meaning_category":"わいせつ・不快な部分の削除"}]}