{"word":"uniphonemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"文字体系において、一つの音素が一つの文字で表されること、またはそのように表される文字体系の性質。","english_definition":"Having a writing system in which each phoneme is represented by a single, unique grapheme (letter or symbol). Or, relating to such a writing system.","examples":[{"sentence":"Ideally, a phonetic alphabet should be uniphonemic.","translation":"理想的には、音声アルファベットは単音素的であるべきです。"},{"sentence":"The Korean alphabet, Hangul, is considered to be relatively uniphonemic.","translation":"韓国語のアルファベット、ハングルは、比較的単音素的であると考えられています。"}],"collocations":["uniphonemic alphabet","uniphonemic orthography","nearly uniphonemic"],"synonyms":["phonemic","alphabetic"],"antonyms":["polyphonemic","non-alphabetic"]}],"etymology":{"value":"From 'uni-' (one) + 'phoneme' + '-ic'.  Essentially, 'one sound (phoneme) per symbol'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːnɪfəˈniːmɪk/","syllables":"u-ni-pho-ne-mic"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparative/superlative forms, which are rarely used with this word."},"usage_notes":{"explanation":"The term 'uniphonemic' is primarily used in linguistics and phonetics when discussing writing systems. A truly uniphonemic system is rare, as pronunciation can vary depending on context, and writing systems often evolve over time to become less directly tied to pronunciation.  Hangul is often cited as a good approximation of a uniphonemic system, but even it has some exceptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"This language is uniphonemic.","correct":"This language has a relatively uniphonemic writing system.","note":"It's more accurate to say a language *has* a uniphonemic writing system, rather than saying the language itself is uniphonemic.  The language is spoken, the writing system is written."}],"priority":"★☆☆"},"related_words":{"derivatives":["phoneme","grapheme","orthography","phonetics","phonology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'uniphonemic' is a technical term used in linguistics. It describes a writing system where each sound (phoneme) is represented by only one symbol (grapheme). This is an ideal, but rarely perfectly achieved, situation. Understanding this word requires knowledge of basic linguistic concepts like phonemes and graphemes."},"example_sentences":[{"sentence":"A truly uniphonemic writing system would make pronunciation perfectly predictable from the written form.","translation":"真に単音素的な文字体系は、書き言葉から発音を完全に予測可能にするでしょう。","type":"adjective","meaning_category":"Describing a writing system"},{"sentence":"One of the goals of creating a phonetic alphabet is to have a uniphonemic correspondence between sounds and symbols.","translation":"音声アルファベットを作成する目標の一つは、音と記号の間に単音素的な対応関係を持たせることです。","type":"adjective","meaning_category":"Describing a writing system"}]}