{"word":"ichs","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A slang term for the feeling of disgust or aversion towards something previously enjoyed, often used in the context of relationships or trends.","english_definition":"(plural only) A slang term for the feeling of disgust or aversion towards something previously enjoyed, often used in the context of relationships or trends.","examples":[{"sentence":"I used to love his jokes, but now they just give me the ichs.","translation":"以前は彼のジョークが好きだったけど、今はただ嫌悪感を感じるだけだ。"},{"sentence":"That trend is so over; it's giving me the ichs.","translation":"あのトレンドはもう終わりだ。嫌悪感しかない。"},{"sentence":"The way he chews his food is starting to give me the ichs.","translation":"彼の食べ方を見ていると嫌悪感を抱き始めた。"}],"collocations":["get the ichs","give someone the ichs","the ick"],"synonyms":["disgust","aversion","repulsion","cringe","the ick"],"antonyms":["attraction","fondness","affection","desire"]}],"etymology":{"value":"Likely a variant of \"ick,\" possibly influenced by the sound of disgust. The term gained popularity on social media platforms like TikTok in the early 2020s.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɪks/","syllables":"ichs"},"inflection":{"noun_plural":"ichs (already plural)"},"usage_notes":{"explanation":"\"Ichs\" is a slang term, typically used in the plural form, to describe a sudden feeling of disgust or aversion towards something that was previously liked or enjoyed. It's often used in the context of romantic relationships, where small habits or behaviors of a partner can suddenly become irritating or repulsive. It can also apply to trends, styles, or other cultural phenomena. The singular form, \"ick,\" is also common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has an ich.","correct":"✓ He has the ich. / ✓ He gets the ich.","note":"When referring to the feeling of disgust, it's more common to use \"the ich\" or \"the ichs\" rather than just \"an ich.\""},{"incorrect":"✗ I'm iching from that.","correct":"✓ I'm getting the ichs from that.","note":"\"Ich\" is typically used as a noun, not a verb. To express the feeling, use phrases like \"get the ichs\" or \"give someone the ichs.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["icky (adjective: disgusting, unpleasant)","ick (noun: a feeling of disgust or aversion)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency (relatively new slang term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Ichs\" is a slang term, primarily used by younger generations, to describe a feeling of sudden disgust or aversion towards something previously liked. It is most often used in the context of romantic relationships, where small, previously unnoticed habits of a partner suddenly become repulsive. The term is relatively new and has gained popularity through social media. Because it is slang, its usage may not be appropriate in formal settings."},"example_sentences":[{"sentence":"His constant need for validation is giving me the ichs.","translation":"彼の絶え間ない承認欲求が私に嫌悪感を抱かせる。","type":"noun","meaning_category":"disgust"},{"sentence":"I used to find his clumsiness endearing, but now I just get the ichs.","translation":"以前は彼の不器用さを愛嬌があると思っていたけど、今はただ嫌悪感を抱くだけだ。","type":"noun","meaning_category":"disgust"},{"sentence":"That song was catchy at first, but now it just gives me the ichs.","translation":"その歌は最初はキャッチーだったけど、今はただ嫌悪感を感じるだけだ。","type":"noun","meaning_category":"disgust"}]}