{"word":"palpitation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(心臓の)動悸、鼓動","english_definition":"a noticeably rapid, strong, or irregular heartbeat due to agitation, exertion, or illness.","examples":[{"sentence":"She experienced palpitations after drinking too much coffee.","translation":"彼女はコーヒーを飲みすぎた後、動悸を経験した。"},{"sentence":"Anxiety can cause heart palpitations.","translation":"不安は動悸を引き起こす可能性がある。"},{"sentence":"He went to the doctor because of frequent palpitations.","translation":"彼は頻繁な動悸のために医者に行った。"}],"collocations":["heart palpitation","experience palpitations","cause palpitations","frequent palpitations","irregular palpitations"],"synonyms":["fluttering","thumping","throbbing","pounding","racing heart"],"antonyms":["steady heartbeat","regular heartbeat"]}],"etymology":{"value":"Late Middle English: from late Latin palpitatio(n-), from Latin palpitare ‘to throb’","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpælpɪˈteɪʃən/","syllables":"pal·pi·ta·tion"},"inflection":{"noun_plural":"palpitations"},"usage_notes":{"explanation":"'Palpitation' refers to the sensation of feeling your heart beat rapidly, strongly, or irregularly. It is often associated with anxiety, stress, or excessive caffeine intake, but can also be a symptom of underlying medical conditions. If palpitations are frequent or accompanied by other symptoms like chest pain or shortness of breath, it's important to seek medical advice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I have a palpitation in my stomach.","correct":"I have a palpitation in my chest.","note":"Palpitations are specifically related to the heart, so they are felt in the chest, not the stomach."},{"incorrect":"Palpitation is a disease.","correct":"Palpitation is a symptom.","note":"Palpitation is a symptom, not a disease itself. It can be a symptom of various conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["palpitate (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Palpitation' is a medical term that describes the sensation of feeling your heart beat rapidly, strongly, or irregularly. It is a less common word in everyday conversation and is more likely to be used in medical contexts or when discussing health concerns. Understanding this word helps in comprehending medical information and describing specific physical sensations accurately."},"example_sentences":[{"sentence":"She felt a strong palpitation after running up the stairs.","translation":"彼女は階段を駆け上がった後、強い動悸を感じた。","type":"noun","meaning_category":"動悸"},{"sentence":"He ignored the palpitations, thinking they were just due to stress.","translation":"彼は動悸を無視し、ただのストレスのせいだと思った。","type":"noun","meaning_category":"動悸"},{"sentence":"The doctor asked her about the frequency and duration of her palpitations.","translation":"医者は彼女に動悸の頻度と持続時間について尋ねた。","type":"noun","meaning_category":"動悸"}]}