{"word":"bondsmen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 保証人、身元引受人 (特に法的な文脈で、債務不履行の場合に責任を負う人)","english_definition":"(plural) A person who acts as a surety or guarantor, especially in a legal context, assuming responsibility for another's debt or obligation in case of default.","examples":[{"sentence":"The accused needed bondsmen to secure his release from jail.","translation":"被告は刑務所からの釈放を確実にするために保証人を必要とした。"},{"sentence":"Several bondsmen vouched for his character.","translation":"数人の保証人が彼の性格を保証した。"}],"collocations":["act as bondsmen","provide bondsmen","release on bondsmen"],"synonyms":["guarantor","surety","backer","sponsor"],"antonyms":["debtor","principal"]},{"part_of_speech":"noun","definition":"(歴史的用法) 隷農、農奴 (土地に縛り付けられ、領主に奉仕する義務を負う農民)","english_definition":"(historical) A serf; a peasant bound to the land and owing service to a lord.","examples":[{"sentence":"The bondsmen were tied to the land and could not leave without the lord's permission.","translation":"隷農は土地に縛り付けられており、領主の許可なしに離れることはできなかった。"},{"sentence":"Feudal society relied heavily on the labor of bondsmen.","translation":"封建社会は隷農の労働に大きく依存していた。"}],"collocations":["feudal bondsmen","medieval bondsmen"],"synonyms":["serf","villein","peasant","thrall"],"antonyms":["freeman","landowner"]}],"etymology":{"value":"'Bondsmen' is the plural of 'bondsman.' The term combines 'bond' (something that binds or restrains) with 'man.' The legal sense derives from the bond or obligation assumed by the surety. The historical sense comes from the bond to the land.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒndzmən/","syllables":"bonds-men"},"inflection":{"noun_plural":"bondsmen"},"usage_notes":{"explanation":"The word 'bondsmen' has two primary meanings, one legal and one historical. In a legal context, it refers to individuals who guarantee another person's obligations, such as appearing in court. Historically, it refers to serfs or peasants bound to the land under feudal systems. The context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He hired a bondsman to fix his house.","correct":"✓ He hired a contractor to fix his house.","note":"'Bondsman' refers to a guarantor, not a repairman."},{"incorrect":"✗ The bondsmen were free to travel.","correct":"✓ The serfs were not free to travel.","note":"Historically, bondsmen (serfs) were restricted in their movement."}],"priority":"★★☆"},"related_words":{"derivatives":["bondsman","bondswoman","bondage"],"phrasal_verbs":[],"related_terms":["bond","bail","surety","serfdom","feudalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bondsmen' refers either to people who provide financial guarantees in legal settings or, historically, to serfs tied to the land. It's not a common word in everyday conversation, so it's more likely to be encountered in legal documents or historical texts. Understanding the context is key to interpreting its meaning correctly."},"example_sentences":[{"sentence":"The defendant was released on bail thanks to his bondsmen.","translation":"被告は保証人のおかげで保釈された。","type":"noun","meaning_category":"guarantor"},{"sentence":"Medieval bondsmen were obligated to work the lord's fields.","translation":"中世の隷農は領主の畑を耕す義務を負っていた。","type":"noun","meaning_category":"serf"}]}