{"word":"preaffirm","priority":"★★★","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律) (証言などが)宣誓済であることを再度確認する、再宣誓する","english_definition":"To affirm again; to confirm a previous affirmation, especially under oath in a legal context.","examples":[{"sentence":"The witness was asked to preaffirm their previous testimony.","translation":"証人は以前の証言を再宣誓するように求められた。"},{"sentence":"Before the new evidence was presented, the expert had to preaffirm his qualifications.","translation":"新しい証拠が提示される前に、専門家は自分の資格を再宣誓する必要があった。"}],"collocations":["preaffirm testimony","preaffirm qualifications","preaffirm statement"],"synonyms":["reaffirm","reassert","confirm","validate","corroborate"],"antonyms":["deny","recant","retract"]}],"etymology":{"value":"The word \"preaffirm\" is formed by combining the prefix \"pre-\" (meaning \"before\" or \"again\") with the word \"affirm\" (meaning \"to state positively or declare firmly\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːəˈfɜːrm/","syllables":"pre-af-firm"},"inflection":{"verb_forms":{"present_simple":["preaffirm","preaffirms"],"past_simple":"preaffirmed","past_participle":"preaffirmed","present_participle":"preaffirming"}},"usage_notes":{"explanation":"\"Preaffirm\" is primarily used in legal or formal contexts to emphasize the continued validity and truthfulness of a previous statement or oath. It is often used when a witness or expert is asked to confirm that their earlier testimony or qualifications remain accurate and truthful before proceeding with further questioning or evidence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He preaffirmed to go to the store.","correct":"✓ He reaffirmed his intention to go to the store.","note":"\"Preaffirm\" is typically used in legal contexts related to oaths or testimony. For general intentions, \"reaffirm\" is more appropriate."},{"incorrect":"✗ The document was preaffirmed by the printer.","correct":"✓ The document was certified by the notary.","note":"\"Preaffirm\" is usually done by the person who made the original statement, not by a third party. Certification or notarization is more appropriate for documents."}],"priority":"★★☆"},"related_words":{"derivatives":["preaffirmation (noun): The act of preaffirming."],"related_terms":["affirm","affirmation","reaffirm","reaffirmation","oath","testimony"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Preaffirm\" is a formal term primarily used in legal settings. It means to confirm again something that was previously stated under oath or as a formal declaration. This word is not commonly used in everyday conversation and is more likely to be encountered in legal documents or proceedings. It emphasizes the continued validity and truthfulness of a previous statement.","priority":"★★☆"},"example_sentences":[{"sentence":"The judge asked the witness to preaffirm the truth of their initial statement before cross-examination began.","translation":"裁判官は、反対尋問が始まる前に、証人に最初の供述の真実性を再宣誓するように求めた。","type":"verb","meaning_category":"legal"},{"sentence":"The expert witness was required to preaffirm their credentials and expertise before presenting their findings.","translation":"専門家証人は、調査結果を提示する前に、資格と専門知識を再宣誓する必要があった。","type":"verb","meaning_category":"legal"},{"sentence":"Before the new evidence was admitted, the lawyer requested that the plaintiff preaffirm their original claim.","translation":"新しい証拠が認められる前に、弁護士は原告に最初の主張を再宣誓するように要求した。","type":"verb","meaning_category":"legal"}]}