{"word":"pursuitmeter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"追跡計測器（仮想の測定装置）","english_definition":"A hypothetical or fictional measuring device for tracking pursuit or following behavior","examples":[{"sentence":"The sci-fi novel featured a pursuitmeter that could quantify how closely someone was being followed.","translation":"そのSF小説には、誰かにどれほど密かに追跡されているかを数値化できる追跡計測器が登場した"},{"sentence":"Our experimental pursuitmeter measures the intensity of chase scenarios in predator-prey studies.","translation":"我々の実験用追跡計測器は捕食者-被食者研究における追跡シナリオの強度を測定する"}],"notes":"This appears to be a specialized/technical term or possibly a neologism with limited usage. May be context-dependent in scientific or fictional works.","synonyms":["tracking device","pursuit tracker","following gauge"]}],"etymology":{"value":"Compound word from 'pursuit' (追跡) + '-meter' (計測器). Modeled after similar measurement device names like speedometer or pedometer.","priority":"★☆☆"},"pronunciation":{"ipa":"/pərˈsuːtmiːtər/","syllables":"pur-suit-me-ter"},"usage_notes":{"explanation":"This term appears to be either: 1) A specialized technical term in certain scientific fields (possibly biology or behavioral studies) for measuring pursuit behavior, or 2) A fictional/created device term seen in some speculative fiction works. Not a commonly recognized English word.","priority":"★☆☆"},"related_words":{"components":["pursuit (追跡)","meter (計測器)"],"similar_devices":["odometer (走行距離計)","speedometer (速度計)","pedometer (歩数計)","tachometer (回転計)"]},"level_frequency":{"status":"Highly specialized/technical or possibly fictional term","frequency":"Extremely low - appears to be a very niche or invented term"},"example_sentences":[{"sentence":"The new pursuitmeter technology allows researchers to precisely measure hunting behaviors in wild animals.","translation":"新しい追跡計測器技術により、研究者は野生動物の狩猟行動を正確に測定できるようになった","context":"scientific research"},{"sentence":"In the video game, your pursuitmeter glows red when enemies are close to detecting you.","translation":"そのビデオゲームでは、敵があなたを発見しそうになると追跡計測器が赤く光る","context":"gaming/fictional"}]}