{"word":"basaltiform","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"玄武岩質の、玄武岩のような形状の","english_definition":"Resembling basalt in appearance or structure.","examples":[{"sentence":"The columnar jointing created basaltiform structures in the rock.","translation":"柱状節理が岩石中に玄武岩質の構造を作り出した。"},{"sentence":"The lava flow cooled to form a basaltiform landscape.","translation":"溶岩流は冷却して玄武岩のような地形を形成した。"}],"collocations":["basaltiform structure","basaltiform jointing","basaltiform landscape"],"synonyms":["columnar","basaltic"],"antonyms":[]}],"etymology":{"value":"From 'basalt' (a dark, fine-grained volcanic rock) + '-iform' (having the form or shape of).","priority":"★★☆"},"pronunciation":{"ipa":"/bəˈsɔltɪˌfɔrm/","syllables":"ba-salt-i-form"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Basaltiform' is a relatively specialized term used in geology and related fields to describe something that resembles basalt, particularly in its structure or appearance. It is often used to describe rock formations with columnar jointing, which are characteristic of basalt flows.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was basaltiform because it was black.","correct":"✓ The rock was basaltiform because it had columnar jointing.","note":"Black color alone does not make something basaltiform; the term refers to the structure or appearance resembling basalt, especially columnar jointing."}],"priority":"★★☆"},"related_words":{"derivatives":["basalt","basaltic","-iform"],"related_terms":["columnar jointing","volcanic rock","igneous rock"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Basaltiform' is a technical term used in geology to describe something resembling basalt, a dark volcanic rock. It is most commonly used to describe columnar jointing, a pattern of fractures that forms columns in basalt flows. Understanding this word requires knowledge of geology and rock formations."},"example_sentences":[{"sentence":"The Giant's Causeway in Northern Ireland is a famous example of basaltiform columns.","translation":"北アイルランドのジャイアンツ・コーズウェイは、玄武岩質の柱の有名な例です。","type":"example","meaning_category":"geology"},{"sentence":"The geologist described the rock formation as having a basaltiform appearance.","translation":"地質学者は、その岩石の構造を玄武岩のような外観を持つと説明した。","type":"example","meaning_category":"geology"}]}