{"word":"outcull","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(家畜・植物などを)間引く、淘汰する、選り分ける","english_definition":"To remove inferior or unwanted individuals from a group of livestock, plants, or other items.","examples":[{"sentence":"The farmer outculled the weaker chickens from the flock.","translation":"農家は群れから弱い鶏を間引いた。"},{"sentence":"We need to outcull the diseased plants to prevent the spread of infection.","translation":"感染の拡大を防ぐために、病気の植物を選り分ける必要がある。"}],"collocations":["outcull weaker animals","outcull diseased plants"],"synonyms":["cull","select","remove","thin out"],"antonyms":["add","include","breed"]},{"part_of_speech":"noun","definition":"間引き、淘汰、選り分けられたもの","english_definition":"The act of removing inferior or unwanted individuals; the items that have been removed.","examples":[{"sentence":"The outcull from the herd was sold at auction.","translation":"群れから間引かれたものは競売で売られた。"},{"sentence":"The outcull process helps improve the overall quality of the crop.","translation":"間引きのプロセスは、作物の全体的な品質を向上させるのに役立つ。"}],"collocations":["the outcull from the herd","the outcull process"],"synonyms":["culling","selection","removal"],"antonyms":["addition","inclusion"]}],"etymology":{"value":"\"Out-\" (接頭辞: ～より外へ、～より優れて) + \"cull\" (選ぶ、間引く)","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaʊtˌkʌl/","syllables":"out-cull"},"inflection":{"verb_forms":{"present_simple":["outcull","outculls"],"past_simple":"outculled","past_participle":"outculled","present_participle":"outculling"},"noun_plural":"outculls"},"usage_notes":{"explanation":"\"Outcull\" is a relatively uncommon word, primarily used in agricultural or biological contexts. It refers to the process of selectively removing individuals from a group, typically because they are considered inferior, diseased, or otherwise undesirable. The goal is usually to improve the overall quality or health of the remaining group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We outculled the information from the report.","correct":"✓ We culled the information from the report.","note":"\"Outcull\" is typically used for living organisms, not information. Use \"cull\" or \"extract\" for information. "},{"incorrect":"✗ The outcull was added to the group.","correct":"✓ The outcull was removed from the group.","note":"The outcull is what has been removed, not added."}],"priority":"★★☆"},"related_words":{"derivatives":["cull (動詞/名詞: 選ぶ、間引く、選り分ける)","selection (名詞: 選択)","thinning (名詞: 間引き)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Outcull\" is a specialized term, primarily used in agriculture and biology. It describes the process of removing inferior or unwanted individuals from a group, such as livestock or plants, to improve the overall quality of the remaining population. It's not a common word in everyday conversation, so understanding its meaning is more relevant for those working in related fields or reading specialized texts."},"example_sentences":[{"sentence":"The farmer decided to outcull the smallest piglets to ensure the others had enough resources.","translation":"農家は他の子豚に十分な資源を確保するために、最も小さい子豚を間引くことにした。","type":"verb","meaning_category":"間引く"},{"sentence":"The outcull from the breeding program was carefully documented.","translation":"育種プログラムからの選り分けは慎重に記録された。","type":"noun","meaning_category":"選り分けられたもの"}]}