{"word":"republic","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共和国","english_definition":"a state in which supreme power is held by the people and their elected representatives, and which has an elected or nominated president rather than a monarch.","examples":[{"sentence":"The United States is a republic.","translation":"アメリカ合衆国は共和国です。"},{"sentence":"The French Republic was established after the revolution.","translation":"フランス共和国は革命後に設立されました。"},{"sentence":"He is a strong supporter of the republic.","translation":"彼は共和国の強力な支持者です。"}],"collocations":["federal republic (連邦共和国)","democratic republic (民主共和国)","republican government (共和制政府)","establish a republic (共和国を設立する)","president of the republic (共和国大統領)"],"synonyms":["commonwealth","state","nation"],"antonyms":["monarchy","kingdom","empire"]}],"etymology":{"value":"From Middle French république, from Latin rēs pūblica (“public affair”), from rēs (“thing, affair”) + pūblica, feminine of pūblicus (“public”).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈpʌblɪk/","syllables":"re-pub-lic"},"inflection":{"noun_plural":"republics"},"usage_notes":{"explanation":"A **republic** is a form of government where the people hold power and elect representatives to govern them. It's often contrasted with a monarchy, where power is held by a hereditary ruler. Republics can vary in their specific structures and how they distribute power.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The republic is ruled by a king.","correct":"✓ The republic is ruled by an elected president.","note":"Republics are not ruled by kings; they have elected or nominated leaders."},{"incorrect":"✗ Republic and democracy are the same thing.","correct":"✓ Republic is a type of government where elected officials represent the citizens. Democracy is a system where citizens have the power to vote.","note":"While many republics are democratic, the terms aren't interchangeable. A republic emphasizes representation, while democracy emphasizes direct participation."}],"priority":"★★☆"},"related_words":{"derivatives":["republican (adjective: of or supporting a republic; noun: a supporter of a republic)","republicanism (noun: support for a republican form of government)"],"phrases":["separation of powers (権力分立)","checks and balances (抑制と均衡)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"republic\" refers to a type of government where the citizens hold power, typically through elected representatives. It's a key concept in political science and history, often discussed in the context of different forms of government and their characteristics. Understanding the term is essential for comprehending political discussions and historical events.","priority":"★★☆"},"example_sentences":[{"sentence":"The Roman Republic was a powerful state in ancient times.","translation":"古代ローマ共和国は強力な国家でした。","type":"example","meaning_category":"historical example"},{"sentence":"The constitution of the republic guarantees freedom of speech.","translation":"その共和国の憲法は言論の自由を保障しています。","type":"example","meaning_category":"constitution"},{"sentence":"The transition to a republic was a major turning point in the country's history.","translation":"共和国への移行は、その国の歴史における大きな転換点でした。","type":"example","meaning_category":"transition"}]}