{"word":"hyperepinephry","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Excessive secretion or activity of the adrenal medulla, resulting in elevated levels of epinephrine (adrenaline) in the bloodstream.","english_definition":"Excessive secretion or activity of the adrenal medulla, resulting in elevated levels of epinephrine (adrenaline) in the bloodstream.","examples":[{"sentence":"Hyperepinephry can lead to symptoms such as increased heart rate, elevated blood pressure, and anxiety.","translation":"高アドレナリン血症は、心拍数の増加、血圧の上昇、不安などの症状を引き起こす可能性があります。"}],"collocations":["associated with stress","caused by tumors","treatment for hyperepinephry"],"synonyms":["adrenal hyperactivity","epinephrine excess"],"antonyms":["hypoepinephry"]}],"etymology":{"value":"Derived from the Greek words 'hyper' (excessive), 'epi' (upon, above), 'nephros' (kidney), and '-y' (state, condition). It refers to the condition of excessive epinephrine secretion from the adrenal glands, which are located above the kidneys.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌɛpɪˈnɛfri/","syllables":"hy-per-e-pi-neph-ry"},"inflection":{"noun_plural":"hyperepinephries"},"usage_notes":{"explanation":"Hyperepinephry is a medical condition characterized by an overproduction of epinephrine, often due to adrenal gland tumors or chronic stress. Diagnosis typically involves blood and urine tests to measure epinephrine levels. Treatment options vary depending on the underlying cause and may include medication or surgery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Hyperepinephry is the same as hyperthyroidism.","correct":"Hyperepinephry involves excessive epinephrine, while hyperthyroidism involves excessive thyroid hormones.","note":"Hyperepinephry and hyperthyroidism are distinct conditions involving different hormones and glands."}],"priority":"★★☆"},"related_words":{"derivatives":["epinephrine","adrenal gland","adrenal medulla","catecholamine"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hyperepinephry' is a specialized medical term referring to the excessive secretion of epinephrine (adrenaline) by the adrenal medulla. This condition can result from various factors, including adrenal tumors or chronic stress, leading to symptoms such as increased heart rate, elevated blood pressure, and anxiety. Understanding this term requires a background in physiology and medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's symptoms suggested hyperepinephry, prompting further diagnostic testing.","translation":"患者の症状は高アドレナリン血症を示唆しており、さらなる診断検査が必要となった。","type":"medical","meaning_category":"excessive epinephrine secretion"}]}