{"word":"cuck","meanings":[{"part_of_speech":"noun","definition":"(スラング、侮辱的) カック、寝取られ男、妻が不倫している男","english_definition":"(slang, derogatory) A cuckold; a man whose wife is unfaithful, especially one who is regarded as weak or pathetic.","examples":[{"sentence":"He was labeled a cuck online after his wife's affair became public.","translation":"妻の不倫が公になった後、彼はネット上でカックだとレッテルを貼られた。"},{"sentence":"The term 'cuck' is often used as an insult to emasculate men.","translation":"「カック」という言葉は、男性を去勢するために侮辱としてよく使われる。"}],"synonyms":["cuckold","weakling","loser"],"antonyms":[],"usage_notes":"This term is highly offensive and should be used with extreme caution. It is often used in online contexts to insult and demean men.","warning":"Offensive and derogatory. Use with extreme caution."},{"part_of_speech":"verb","definition":"(スラング、侮辱的) (人)をカックにする、(人)の妻と不倫する","english_definition":"(slang, derogatory) To make (a man) a cuckold; to commit adultery with (a man's wife).","examples":[{"sentence":"He was accused of cucking his friend by sleeping with his wife.","translation":"彼は友人の妻と寝て、友人をカックにしたと非難された。"}],"synonyms":["cuckold"],"antonyms":[],"usage_notes":"This term is highly offensive and should be used with extreme caution. It is often used in online contexts to insult and demean men.","warning":"Offensive and derogatory. Use with extreme caution."}],"etymology":"Derived from 'cuckold,' which has a long history of being a derogatory term for a man whose wife is unfaithful. The shortened form 'cuck' has gained popularity online, often associated with alt-right and incel communities.","pronunciation":"/kʌk/","related_words":["cuckold","cuckolding","cuckservative"],"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in online communities.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cuck' is a highly offensive slang term derived from 'cuckold.' It is primarily used online to insult and demean men, often in the context of infidelity. Due to its offensive nature, it is rarely used in formal settings."},"example_sentences":[{"sentence":"The online forum was filled with users calling each other 'cuck'.","translation":"オンラインフォーラムは、お互いを「カック」と呼び合うユーザーで溢れていた。","type":"noun","meaning_category":"侮辱的な言葉"},{"sentence":"He was accused of 'cucking' his friend.","translation":"彼は友人を「カックにした」と非難された。","type":"verb","meaning_category":"侮辱的な行為"}]}