{"word":"Carbophilous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"好炭性の、二酸化炭素を好む","english_definition":"Thriving in or having an affinity for carbon dioxide.","examples":[{"sentence":"Carbophilous bacteria are often found in environments with high CO2 concentrations.","translation":"好炭性細菌は、多くの場合、高濃度の二酸化炭素環境で見られる。"}],"collocations":["carbophilous bacteria","carbophilous algae"],"synonyms":["carbonophilic"],"antonyms":["carbophobic"]},{"part_of_speech":"adjective","definition":"(土壌学で)石灰質の土壌を好む","english_definition":"(In soil science) Preferring or thriving in calcareous (lime-rich) soil.","examples":[{"sentence":"Some plant species are carbophilous, growing best in alkaline soils.","translation":"一部の植物種は好石灰性であり、アルカリ性土壌で最もよく育つ。"}],"collocations":["carbophilous plants"],"synonyms":["calciphilous","calcicole"],"antonyms":["calcifuge"]}],"etymology":{"value":"Derived from the combination of 'carbo-' (referring to carbon or lime) and '-philous' (loving, having an affinity for).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrboʊˈfɪləs/","syllables":"car-bo-phi-lous"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'carbophilous' is primarily used in two contexts: microbiology and soil science. In microbiology, it describes organisms (especially bacteria) that thrive in environments rich in carbon dioxide. In soil science, it refers to plants that prefer or thrive in calcareous soils, which are rich in lime (calcium carbonate). The specific meaning depends on the field of study.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Carbophilous plants can grow anywhere.","correct":"✓ Carbophilous plants thrive in alkaline soils.","note":"Carbophilous plants have specific soil requirements and do not grow well in all types of soil."}],"priority":"★☆☆"},"related_words":{"derivatives":["carbophile (noun: a carbophilous organism or plant)","carbophily (noun: the state of being carbophilous)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Carbophilous' is a technical term used in specialized fields like microbiology and soil science. It describes organisms or plants that thrive in environments rich in carbon dioxide or lime, respectively. Understanding this term requires familiarity with scientific vocabulary and concepts. It is not typically encountered in general English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scientist studied the growth of carbophilous bacteria in a controlled environment.","translation":"科学者は、制御された環境下での好炭性細菌の成長を研究した。","type":"general","meaning_category":"Microbiology"},{"sentence":"Many carbophilous plant species are adapted to the alkaline conditions of chalk grasslands.","translation":"多くの好石灰性植物種は、白亜草原のアルカリ性条件に適応している。","type":"general","meaning_category":"Soil Science"}]}