{"word":"proctocolitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"直腸結腸炎","english_definition":"Inflammation of both the rectum and the colon.","examples":[{"sentence":"The patient was diagnosed with proctocolitis after experiencing abdominal pain and bloody stools.","translation":"患者は、腹痛と血便を経験した後、直腸結腸炎と診断された。"}],"collocations":["ulcerative proctocolitis","acute proctocolitis","chronic proctocolitis"],"synonyms":["inflammatory bowel disease (IBD)","colitis","proctitis"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'procto-' (referring to the rectum), 'colo-' (referring to the colon), and '-itis' (denoting inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɑːktəkoʊˈlaɪtɪs/","syllables":"proc-to-co-li-tis"},"inflection":{"noun_plural":"proctocolitides (rare)"},"usage_notes":{"explanation":"Proctocolitis is a medical term used to describe inflammation affecting both the rectum and the colon. It is often associated with conditions like ulcerative colitis, a type of inflammatory bowel disease (IBD). Symptoms can include abdominal pain, diarrhea, rectal bleeding, and urgency to defecate. Diagnosis typically involves colonoscopy and biopsy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Proctocolitis is a virus.","correct":"✓ Proctocolitis is an inflammation.","note":"Proctocolitis is an inflammatory condition, not a viral infection."},{"incorrect":"✗ Proctocolitis only affects the rectum.","correct":"✓ Proctocolitis affects both the rectum and the colon.","note":"The condition specifically involves inflammation of both the rectum and the colon."}],"priority":"★★☆"},"related_words":{"derivatives":["proctitis (inflammation of the rectum only)","colitis (inflammation of the colon only)","ulcerative colitis (a specific type of IBD often causing proctocolitis)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proctocolitis' is a specialized medical term referring to inflammation of both the rectum and colon. It is typically used in medical contexts and may not be familiar to the general public. Understanding the term requires knowledge of medical terminology related to the digestive system and inflammatory conditions. It's important to note that this condition can be associated with various underlying causes, including inflammatory bowel disease (IBD)."},"example_sentences":[{"sentence":"The gastroenterologist suspected ulcerative proctocolitis based on the colonoscopy findings.","translation":"消化器内科医は、大腸内視鏡検査の結果に基づいて潰瘍性直腸結腸炎を疑った。","type":"medical","meaning_category":"inflammation"},{"sentence":"Symptoms of proctocolitis can significantly impact a patient's quality of life.","translation":"直腸結腸炎の症状は、患者の生活の質に大きな影響を与える可能性がある。","type":"medical","meaning_category":"symptoms"}]}