{"word":"cottierism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"小作制度（特にアイルランドにおける）。土地所有者が土地を小作人に貸し出し、小作人は地代を支払う制度。小作人は通常、貧困にあえぎ、土地所有者に搾取されることが多い。","english_definition":"A system of land tenure, especially in Ireland, where land is let to cottiers (small tenant farmers) who pay rent to the landlord. Cottiers were typically impoverished and subject to exploitation by landlords.","examples":[{"sentence":"Cottierism was a major factor in the Irish famine.","translation":"小作制度はアイルランドの飢饉の主要な要因でした。"},{"sentence":"The reforms aimed to alleviate the problems caused by cottierism.","translation":"改革は小作制度によって引き起こされた問題を軽減することを目的としていました。"}],"collocations":["Irish cottierism","effects of cottierism","abolish cottierism"],"synonyms":["tenant farming","sharecropping"],"antonyms":["land ownership","freehold"],"notes":"Cottierism is particularly associated with Ireland and the historical conditions that led to widespread poverty and social unrest."}],"etymology":{"value":"Cottier (小作人) + -ism (主義、制度)","priority":"中"},"pronunciation":{"ipa":"/ˈkɒtiərɪzəm/","syllables":"cot-ti-er-ism"},"inflection":{"noun_plural":"cottierisms (まれ)"},"usage_notes":{"explanation":"Cottierismは、特にアイルランドの歴史的な文脈で使用される専門用語です。現代英語では一般的ではありません。","priority":"低"},"common_mistakes":{"examples":[{"incorrect":"He supported cottierism because it helped the poor.","correct":"He opposed cottierism because it exploited the poor.","note":"Cottierismは貧困層を搾取する制度であったため、支持されることは稀でした。"}],"priority":"低"},"related_words":{"derivatives":["cottier"],"related_terms":["landlord","tenant","famine","eviction"]},"level_frequency":{"frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「Cottierism」は、特にアイルランドの歴史における小作制度を指す専門用語であり、現代英語では一般的ではありません。この用語は、土地所有者が小作人に土地を貸し出し、小作人が地代を支払う制度を指します。小作人はしばしば貧困にあえぎ、土地所有者に搾取されることが多かったため、この制度は社会問題を引き起こしました。この単語は、歴史、社会学、経済学などの分野で、アイルランドの歴史的背景を議論する際に使用されることがあります。"},"example_sentences":[{"sentence":"The prevalence of cottierism contributed to the vulnerability of the Irish population during the potato famine.","translation":"小作制度の蔓延は、ジャガイモ飢饉の際にアイルランドの人々が脆弱になる一因となりました。","type":"general","meaning_category":"小作制度"},{"sentence":"Historians often analyze the social and economic consequences of cottierism in 19th-century Ireland.","translation":"歴史家は、19世紀のアイルランドにおける小作制度の社会的および経済的影響を分析することがよくあります。","type":"academic","meaning_category":"小作制度"}]}