{"word":"hypermetron","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(韻律学)過剰音節、行末に余分な音節を持つ詩行","english_definition":"(prosody) a line of verse having one more syllable than the normal meter calls for.","examples":[{"sentence":"The poem contains several hypermetra, adding to its rhythmic complexity.","translation":"その詩にはいくつかの過剰音節が含まれており、リズムの複雑さを増している。"}],"collocations":["hypermetric line","catalectic line","acatalectic line"],"synonyms":["hypercatalectic","overmeasure"],"antonyms":["catalexis","brachycatalectic"]},{"part_of_speech":"adjective","definition":"(韻律学)過剰音節の、行末に余分な音節を持つ","english_definition":"(prosody) having one more syllable than the normal meter calls for.","examples":[{"sentence":"The hypermetron verse created an interesting effect.","translation":"その過剰音節の詩は興味深い効果を生み出した。"}],"collocations":["hypermetric verse","hypermetric rhythm"],"synonyms":["hypercatalectic","overmeasured"],"antonyms":["catalectic","brachycatalectic"]}],"etymology":{"value":"From Ancient Greek ὑπέρ (hupér, \"over, beyond\") + μέτρον (métron, \"measure\").","priority":"★★☆"},"pronunciation":{"ipa":"/haɪpərˈmiːtrɒn/","syllables":"hy-per-me-tron"},"inflection":{"noun_plural":"hypermetra or hypermetrons"},"usage_notes":{"explanation":"In prosody, a hypermetron is a line of verse that exceeds the expected metrical length by one syllable. This extra syllable typically occurs at the end of the line and is often unstressed. The use of hypermetron can create a sense of rhythmic variation or emphasis within a poem.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypermetron is when a line is too short.","correct":"✓ The hypermetron is when a line is too long by one syllable.","note":"A hypermetron involves an extra syllable, not a shortened line."}],"priority":"★★☆"},"related_words":{"derivatives":["hypermetric (adjective)","hypercatalexis (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hypermetron' is a technical term from prosody, the study of verse forms and metrical structures in poetry. It refers to a line of verse that contains an extra syllable beyond what the established meter would normally allow. This term is rarely encountered outside of academic or specialized discussions of poetry. Understanding it requires familiarity with basic concepts of meter and rhythm in poetry."},"example_sentences":[{"sentence":"The use of a hypermetron at the end of the stanza disrupted the otherwise regular rhythm.","translation":"連の終わりに過剰音節を使用することで、それまで規則的だったリズムが崩れた。","type":"noun","meaning_category":"(韻律学)過剰音節"},{"sentence":"The hypermetron line added a subtle emphasis to the final word.","translation":"その過剰音節の行は、最後の単語に微妙な強調を加えた。","type":"adjective","meaning_category":"(韻律学)過剰音節の"}]}