{"word":"scatteredly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"散らばって、ばらばらに、点在して","english_definition":"in a scattered manner; in a way that is not concentrated or organized.","examples":[{"sentence":"The houses were scatteredly located across the valley.","translation":"家々は谷全体に散らばって位置していた。"},{"sentence":"The protesters were scatteredly dispersed by the police.","translation":"抗議者たちは警察によってばらばらに解散させられた。"},{"sentence":"The information is scatteredly presented throughout the report.","translation":"情報はレポート全体に点在して提示されている。"}],"collocations":["scatteredly located","scatteredly dispersed","scatteredly distributed","scatteredly populated"],"synonyms":["randomly","sporadically","irregularly","diffusely","spread out"],"antonyms":["concentratedly","densely","uniformly","organizedly","systematically"]}],"etymology":{"value":"The word 'scatteredly' is derived from the verb 'scatter', meaning to throw loosely about; to sprinkle; to spread sparsely. The suffix '-ed' forms the past participle and adjective, and '-ly' transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskætərdli/","syllables":"scat-ter-ed-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms based on gender or number."},"usage_notes":{"explanation":"'Scatteredly' describes actions or arrangements where items or people are not grouped together but are instead spread out over an area. It implies a lack of order or concentration. It often modifies verbs of location, distribution, or arrangement. It is less common than its related verb 'scatter' or adjective 'scattered'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The seeds were planted scatter.","correct":"✓ The seeds were planted scatteredly.","note":"'Scatter' is a verb; to describe how they were planted, you need the adverb 'scatteredly'."},{"incorrect":"✗ The toys were scattered around the room, it was scatteredly.","correct":"✓ The toys were scattered around the room, they were scattered.","note":"'Scatteredly' describes the manner of scattering; 'scattered' describes the state of being scattered."}],"priority":"★★☆"},"related_words":{"derivatives":["scatter (verb, noun)","scattered (adjective)","scattering (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'scatteredly' is an adverb that describes something happening in a way that is not organized or concentrated, but rather spread out. It's used to indicate a lack of order or a wide distribution. Because it is a more complex adverb derived from the common verb 'scatter', it is less frequently encountered in everyday language and is more typical of formal writing or specialized contexts. Understanding the root verb 'scatter' helps in grasping the meaning of 'scatteredly'."},"example_sentences":[{"sentence":"The debris from the explosion was scatteredly strewn across the landscape.","translation":"爆発の瓦礫は風景全体に散らばって散乱していた。","type":"adverb","meaning_category":"manner of distribution"},{"sentence":"The few remaining houses stood scatteredly among the ruins.","translation":"残されたわずかな家々は、廃墟の中に点在して立っていた。","type":"adverb","meaning_category":"location"},{"sentence":"The audience members were scatteredly seated throughout the auditorium.","translation":"聴衆は講堂全体にばらばらに座っていた。","type":"adverb","meaning_category":"arrangement"}]}