{"word":"Cineradiography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"映画撮影式X線検査法、X線動画撮影法","english_definition":"A diagnostic technique that combines radiography with cinematography, allowing the motion of internal structures to be viewed in real time.","examples":[{"sentence":"Cineradiography is used to study the movement of the heart.","translation":"映画撮影式X線検査法は、心臓の動きを調べるために用いられる。"},{"sentence":"The doctor used cineradiography to diagnose the patient's swallowing difficulties.","translation":"医師は映画撮影式X線検査法を用いて、患者の嚥下困難を診断した。"}],"collocations":["used in cardiology (心臓病学で使用される)","diagnose swallowing disorders (嚥下障害を診断する)","real-time imaging (リアルタイム画像)"],"synonyms":["fluoroscopy","videofluoroscopy"],"antonyms":[]}],"etymology":{"value":"'Cine-' (from cinema, referring to motion pictures) + 'radio-' (referring to radiation, specifically X-rays) + '-graphy' (referring to a process of recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪnɪˌreɪdiˈɒɡrəfi/","syllables":"ci-ne-ra-di-og-ra-phy"},"inflection":{"noun_plural":"cineradiographies"},"usage_notes":{"explanation":"Cineradiography is a specialized medical imaging technique primarily used to visualize dynamic processes within the body. It involves taking a continuous sequence of X-ray images, which are then displayed as a moving image, similar to a movie. This allows doctors to observe the function and movement of organs and structures in real-time. While fluoroscopy is a related technique, cineradiography typically involves a higher radiation dose and provides a more detailed and permanent record of the examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cineradiography is a type of therapy.","correct":"✓ Cineradiography is a type of diagnostic imaging.","note":"Cineradiography is a diagnostic tool, not a treatment or therapy."},{"incorrect":"✗ Cineradiography uses sound waves to create images.","correct":"✓ Cineradiography uses X-rays to create images.","note":"Cineradiography uses X-rays, not sound waves (like ultrasound)."}],"priority":"★★☆"},"related_words":{"derivatives":["cineradiographic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["angiography","fluoroscopy","radiology","radiography","echocardiography"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cineradiography is a complex medical term referring to a specific type of diagnostic imaging. It combines X-rays with motion picture technology to visualize internal body movements in real-time. This technique is primarily used by medical professionals to diagnose conditions related to moving organs and structures, such as the heart or swallowing mechanisms. Due to its specialized nature, it's not commonly encountered outside of medical contexts. Understanding the etymology (cine- + radio- + -graphy) can help in deciphering the term's meaning."},"example_sentences":[{"sentence":"The cardiologist used cineradiography to assess the valve function.","translation":"心臓専門医は、弁機能を評価するために映画撮影式X線検査法を用いた。","type":"noun","meaning_category":"medical imaging"},{"sentence":"Cineradiography revealed the cause of the patient's dysphagia.","translation":"映画撮影式X線検査法は、患者の嚥下障害の原因を明らかにした。","type":"noun","meaning_category":"medical imaging"}]}