{"word":"seismology","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"地震学","english_definition":"the scientific study of earthquakes and the propagation of elastic waves through the Earth or other planet-like bodies.","examples":[{"sentence":"Seismology is crucial for understanding the Earth's internal structure.","translation":"地震学は地球の内部構造を理解するために不可欠です。"},{"sentence":"The seismology department at the university studies earthquake patterns.","translation":"大学の地震学部門は地震のパターンを研究しています。"},{"sentence":"Advances in seismology have improved our ability to predict earthquakes.","translation":"地震学の進歩により、地震を予測する能力が向上しました。"}],"collocations":["earthquake seismology","exploration seismology","global seismology","regional seismology","theoretical seismology","applied seismology"],"synonyms":["earthquake science"],"antonyms":[]}],"etymology":{"value":"The word \"seismology\" comes from the Greek words \"seismos\" (σεισμός), meaning \"earthquake\" or \"shock,\" and \"-logia\" (-λογία), meaning \"study of.\"","priority":"★★☆"},"pronunciation":{"ipa":"/saɪzˈmɒlədʒi/","syllables":"seis-mol-o-gy"},"inflection":{"noun_plural":"seismologies"},"usage_notes":{"explanation":"Seismology is a branch of geophysics that focuses on earthquakes and related phenomena. It involves the study of seismic waves, which are vibrations that travel through the Earth. Seismologists use instruments called seismographs to detect and record these waves. The data collected helps them to determine the location, magnitude, and depth of earthquakes. Seismology also contributes to our understanding of the Earth's structure, plate tectonics, and volcanic activity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Seismology is the study of storms.","correct":"✓ Seismology is the study of earthquakes.","note":"Seismology focuses on earthquakes, not storms."},{"incorrect":"✗ Seismology uses telescopes to study earthquakes.","correct":"✓ Seismology uses seismographs to study earthquakes.","note":"Seismology uses seismographs, not telescopes."}],"priority":"★★☆"},"related_words":{"derivatives":["seismological (adjective)","seismologist (noun)","seismogram (noun)","seismograph (noun)","seismic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Seismology\" is a specialized term referring to the scientific study of earthquakes and the waves that travel through the Earth. It's a field within geophysics that uses instruments like seismographs to detect and analyze seismic waves. Understanding seismology requires knowledge of geology, physics, and mathematics. It's a term more commonly encountered in scientific or academic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The field of seismology has greatly advanced our understanding of plate tectonics.","translation":"地震学の分野は、プレートテクトニクスに関する私たちの理解を大きく進歩させました。","type":"general","meaning_category":"study of earthquakes"},{"sentence":"Seismology plays a crucial role in assessing earthquake hazards in populated areas.","translation":"地震学は、人口密集地域における地震の危険性を評価する上で重要な役割を果たしています。","type":"applied","meaning_category":"risk assessment"},{"sentence":"The seismology lab is equipped with state-of-the-art seismographs.","translation":"地震学研究室には、最先端の地震計が装備されています。","type":"research","meaning_category":"equipment"}]}