{"word":"Nedder","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(dialectal, Scotland) An adder; a snake, especially a venomous one.","english_definition":"(dialectal, Scotland) An adder; a snake, especially a venomous one.","examples":[{"sentence":"The wee bairn was fashed by a nedder in the lang grass.","translation":"(Translation: The small child was bothered by an adder in the long grass.)"}],"collocations":[],"synonyms":["adder","snake","viper"],"antonyms":[]}],"etymology":{"value":"Likely a dialectal variation or corruption of 'adder', influenced by phonetic shifts or regional pronunciations in Scotland.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɛdər/","syllables":"Ned-der"},"inflection":{"noun_plural":"nedders"},"usage_notes":{"explanation":"'Nedder' is primarily a Scottish dialect term, so its usage is geographically restricted. It is not part of standard English vocabulary. When communicating with a broader audience, 'adder' or 'snake' would be more appropriate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a nedder in my garden in London.","correct":"✓ I saw an adder in my garden in London.","note":"'Nedder' is specific to Scottish dialects. Use 'adder' in standard English."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Dialectal)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nedder' is a dialectal term primarily found in Scotland. It is not part of standard English and would likely be unfamiliar to most English speakers outside of Scotland. Its meaning is equivalent to 'adder,' a type of venomous snake. Use of this term should be limited to contexts where Scottish dialect is appropriate or intended."},"example_sentences":[{"sentence":"The farmer warned us about the nedders in the fields.","translation":"(Translation: The farmer warned us about the adders in the fields.)","type":"noun","meaning_category":"Snake"},{"sentence":"Be careful where you step; there might be a nedder lurking.","translation":"(Translation: Be careful where you step; there might be an adder lurking.)","type":"noun","meaning_category":"Snake"}]}