{"word":"corepressor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コリプレッサー：遺伝子発現の抑制因子に結合し、転写を抑制するタンパク質または分子","english_definition":"A protein or molecule that binds to a repressor, causing it to bind to the operator and inhibit gene expression.","examples":[{"sentence":"The corepressor binds to the repressor protein.","translation":"コリプレッサーはリプレッサータンパク質に結合する。"},{"sentence":"Corepressors play a crucial role in gene regulation.","translation":"コリプレッサーは遺伝子調節において重要な役割を果たす。"}],"collocations":["bind to a repressor","inhibit gene expression","gene regulation"],"synonyms":["transcriptional repressor","silencer"],"antonyms":["activator","coactivator"]}],"etymology":{"value":"'Co-' (collaborative) + 'repressor' (a substance that represses gene expression).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊriˈprɛsər/","syllables":"co-re-press-or"},"inflection":{"noun_plural":"corepressors"},"usage_notes":{"explanation":"Corepressors do not bind directly to DNA. Instead, they bind to repressor proteins, which then bind to DNA and inhibit transcription. They often recruit other proteins, such as histone deacetylases, to further repress gene expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corepressor binds directly to the DNA.","correct":"✓ The corepressor binds to a repressor protein, which then binds to the DNA.","note":"Corepressors do not bind directly to DNA, they bind to repressor proteins."}],"priority":"★★☆"},"related_words":{"derivatives":["repression","repressor","transcription","gene expression"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'corepressor' is a specialized term in molecular biology, specifically related to gene regulation. It refers to a molecule that works with a repressor protein to inhibit gene transcription. Understanding this term requires familiarity with concepts such as gene expression, transcription, and repressor proteins."},"example_sentences":[{"sentence":"In the absence of tryptophan, the trp repressor cannot bind to the operator; however, when tryptophan is present, it acts as a **corepressor** and allows the repressor to bind.","translation":"トリプトファンが存在しない場合、trpリプレッサーはオペレーターに結合できません。しかし、トリプトファンが存在すると、コリプレッサーとして機能し、リプレッサーが結合できるようになります。","type":"scientific","meaning_category":"gene regulation"},{"sentence":"The **corepressor** recruits histone deacetylases to the promoter region, leading to chromatin condensation and transcriptional silencing.","translation":"コリプレッサーはヒストン脱アセチル化酵素をプロモーター領域にリクルートし、クロマチン凝縮と転写サイレンシングを引き起こします。","type":"scientific","meaning_category":"gene regulation"}]}