{"word":"deltoidal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"三角筋の、または三角筋に似た","english_definition":"Relating to or resembling the deltoid muscle.","examples":[{"sentence":"The deltoidal tuberosity is the insertion point for the deltoid muscle on the humerus.","translation":"三角筋粗面は、上腕骨における三角筋の付着点です。"},{"sentence":"He had well-developed deltoidal muscles from years of weightlifting.","translation":"彼は長年のウェイトリフティングで発達した三角筋を持っていました。"}],"collocations":["deltoidal muscle","deltoidal tuberosity"],"synonyms":["deltoid","triangular"],"antonyms":[]}],"etymology":{"value":"From 'deltoid' (the muscle), which comes from the Greek letter delta (Δ), which is triangular in shape, + '-al'.","priority":"★★★"},"pronunciation":{"ipa":"/dɛlˈtɔɪdəl/","syllables":"del-toi-dal"},"inflection":{"notes":"Adjective, so it can be used to modify nouns. Comparative and superlative forms are 'more deltoidal' and 'most deltoidal', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Deltoidal' specifically refers to something related to or resembling the deltoid muscle, which is a large, triangular muscle covering the shoulder joint. It is most often used in anatomical or medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The shape of the cake was deltoidal.","correct":"✓ The shape of the cake was triangular.","note":"'Deltoidal' specifically relates to the deltoid muscle. For general triangular shapes, use 'triangular'."}],"priority":"★★☆"},"related_words":{"derivatives":["deltoid (noun, adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deltoidal' is a technical term primarily used in anatomy and medicine to describe something related to the deltoid muscle or its triangular shape. It is not a common word in everyday conversation. Understanding its meaning requires knowledge of anatomy or related fields."},"example_sentences":[{"sentence":"The surgeon made an incision near the deltoidal region to access the shoulder joint.","translation":"外科医は肩関節にアクセスするために、三角筋領域の近くを切開しました。","type":"adjective","meaning_category":"Anatomical"},{"sentence":"The painting depicted a figure with prominent deltoidal muscles.","translation":"その絵は、顕著な三角筋を持つ人物を描いていました。","type":"adjective","meaning_category":"Descriptive"}]}