{"word":"Trojan-horse","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"トロイの木馬 (ギリシア神話に由来する、外見は贈り物だが内部に兵士が隠されている木馬)","english_definition":"(Greek mythology) a large hollow wooden figure of a horse (filled with Greek soldiers) left by the Greeks outside Troy during the Trojan War.","examples":[{"sentence":"The Greeks used the Trojan horse to enter the city of Troy.","translation":"ギリシャ人はトロイの木馬を使ってトロイの都市に入った。"}],"collocations":["build a Trojan horse (トロイの木馬を作る)","hide in a Trojan horse (トロイの木馬に隠れる)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"トロイの木馬 (コンピュータセキュリティにおけるマルウェアの一種。有用なソフトウェアを装い、実行されると悪意のある動作を行う)","english_definition":"(computing) a program that appears desirable but actually contains something harmful, such as a virus.","examples":[{"sentence":"Be careful when downloading files from the internet, as they may contain a Trojan horse.","translation":"インターネットからファイルをダウンロードする際は、トロイの木馬が含まれている可能性があるため注意してください。"},{"sentence":"His computer was infected with a Trojan horse that stole his passwords.","translation":"彼のコンピュータは、パスワードを盗むトロイの木馬に感染した。"}],"collocations":["detect a Trojan horse (トロイの木馬を検出する)","remove a Trojan horse (トロイの木馬を削除する)","a Trojan horse virus (トロイの木馬ウイルス)","a Trojan horse attack (トロイの木馬攻撃)"],"synonyms":["malware","virus"],"antonyms":[]}],"etymology":{"value":"ギリシア神話のトロイア戦争におけるトロイの木馬の話に由来する。ギリシャ軍は、見かけ上は和平の証として巨大な木馬をトロイア人に贈った。しかし、木馬の中には兵士が隠れており、夜に城門を開けてトロイアを陥落させた。この故事から、コンピュータセキュリティの分野で、一見無害に見えるが、実際には悪意のあるプログラムを「トロイの木馬」と呼ぶようになった。","priority":"★★★"},"pronunciation":{"ipa":"/ˈtroʊdʒən hɔːrs/","syllables":"Tro-jan-horse"},"inflection":{"noun_plural":"Trojan horses"},"usage_notes":{"explanation":"「**Trojan horse**」は、主に2つの意味で使用されます。1つはギリシア神話に登場するトロイの木馬そのものを指し、もう1つはコンピュータセキュリティの用語で、無害なソフトウェアを装って侵入し、悪意のある動作を行うマルウェアを指します。文脈によってどちらの意味で使われているかを判断する必要があります。コンピュータ関連の文脈では、ほぼ間違いなくマルウェアの意味で使用されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He got a Trojan horse from the email.","correct":"✓ He got a Trojan horse through the email.","note":"トロイの木馬がメールを「送る」のではなく、メールを「通して」感染することを意味するため、`from` ではなく `through` を使用するのが適切です。"},{"incorrect":"✗ The Trojan horse is a kind of virus.","correct":"✓ The Trojan horse is a type of malware.","note":"トロイの木馬はウイルスの一種ではなく、マルウェアの一種です。ウイルスは自己複製能力を持ちますが、トロイの木馬は他のファイルに寄生して感染を広げることはありません。"},{"incorrect":"✗ My computer has a Trojan horse, so I need to virus scan.","correct":"✓ My computer has a Trojan horse, so I need to run a malware scan.","note":"トロイの木馬はウイルスではないため、ウイルススキャンではなく、マルウェアスキャンを実行する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Trojan (形容詞: トロイの、トロイアの)"],"phrases":["Trojan horse attack (トロイの木馬攻撃)","Trojan horse program (トロイの木馬プログラム)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (コンピュータ関連の文脈)","frequency_google_ngram":"中頻度 (Moderate frequency)","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"「**Trojan horse**」は、ギリシャ神話のトロイア戦争に由来する言葉で、一見無害に見えるものが、実は内部に危険を秘めていることを指します。コンピュータの世界では、この言葉は、ユーザーがインストールすると、知らないうちに悪意のある動作をするソフトウェアを指します。例えば、無料のゲームや便利なツールを装って、個人情報を盗んだり、コンピュータを遠隔操作したりするプログラムがこれにあたります。トロイの木馬は、ウイルスとは異なり、自己複製する機能はありませんが、セキュリティ上の大きな脅威となります。インターネットからソフトウェアをダウンロードする際は、信頼できる提供元からのみダウンロードするように注意しましょう。"},"example_sentences":[{"sentence":"The antivirus software detected and removed the **Trojan horse** before it could cause any damage.","translation":"アンチウイルスソフトウェアは、トロイの木馬が損害を引き起こす前に検出し、削除した。","type":"noun","meaning_category":"マルウェア"},{"sentence":"The story of the **Trojan horse** is a classic example of deception.","translation":"トロイの木馬の物語は、欺瞞の古典的な例である。","type":"noun","meaning_category":"ギリシア神話"},{"sentence":"Users should be wary of opening attachments from unknown senders, as they may contain a **Trojan horse**.","translation":"ユーザーは、不明な送信者からの添付ファイルを開く際には注意する必要がある。トロイの木馬が含まれている可能性があるため。","type":"noun","meaning_category":"マルウェア"},{"sentence":"The enemy used a **Trojan horse** strategy to infiltrate the organization.","translation":"敵は、トロイの木馬戦略を使って組織に侵入した。","type":"noun","meaning_category":"比喩的表現 (欺瞞)"}]}