{"word":"dichroitic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二色性の、多色性の","english_definition":"exhibiting dichroism; showing different colors when viewed from different directions, especially as a result of polarized light.","examples":[{"sentence":"The dichroitic material changed color depending on the angle of the light.","translation":"その二色性材料は、光の角度によって色が変わった。"},{"sentence":"Some minerals are dichroitic, displaying different colors along different crystal axes.","translation":"いくつかの鉱物は二色性を示し、異なる結晶軸に沿って異なる色を表示する。"}],"collocations":["dichroitic glass","dichroitic filter","dichroitic mirror"],"synonyms":["pleochroic","polychromatic"],"antonyms":["monochromatic","achromatic"]}],"etymology":{"value":"Derived from the Greek words 'dichroos' (of two colors), from 'di-' (two) + 'chroos' (color).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪkroʊˈɪtɪk/","syllables":"di-chro-it-ic"},"inflection":{"notes":"This word does not have typical inflectional forms as it is an adjective."},"usage_notes":{"explanation":"'Dichroitic' describes materials that show different colors when viewed from different angles, a phenomenon known as dichroism. This is often due to the material absorbing different wavelengths of light depending on the polarization and viewing direction. It is commonly used in the context of minerals, glass, and optical filters.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dichromatic material was actually dichroitic.","correct":"✓ The dichroitic material showed two different colors.","note":"'Dichromatic' means having or relating to two colors, while 'dichroitic' refers to the property of showing different colors from different angles. Ensure the correct term is used based on the intended meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["dichroism (noun: the property of exhibiting different colors when viewed from different directions)"],"cross_references":["pleochroism (a similar phenomenon, often used interchangeably but technically refers to variation in absorption of light with different crystal orientations)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dichroitic' is a technical term used in physics, mineralogy, and materials science to describe substances that exhibit different colors when viewed from different angles. This effect is due to the varying absorption of light depending on its polarization and the viewing direction. It is not a commonly used word in everyday language."},"example_sentences":[{"sentence":"The artist used dichroitic glass to create a stunning mosaic.","translation":"そのアーティストは、見事なモザイクを作るために二色性ガラスを使用した。","type":"general"},{"sentence":"Dichroitic filters are used in some optical instruments to selectively transmit light of certain wavelengths.","translation":"二色性フィルターは、特定の波長の光を選択的に透過させるために、一部の光学機器で使用されている。","type":"technical"}]}