{"word":"landlordry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"地主制度、地主政治","english_definition":"A system in which land is owned by landlords who rent it out to tenants; the political or economic power of landlords.","examples":[{"sentence":"The reforms aimed to dismantle the oppressive landlordry that had dominated the region for centuries.","translation":"その改革は、何世紀にもわたって地域を支配してきた抑圧的な地主制度を解体することを目的としていた。"},{"sentence":"The rise of commercial agriculture led to the expansion of landlordry and the displacement of small farmers.","translation":"商業的農業の台頭は、地主制度の拡大と小規模農家の立ち退きにつながった。"}],"collocations":["feudal landlordry (封建的な地主制度)","oppressive landlordry (抑圧的な地主制度)","abolish landlordry (地主制度を廃止する)","reform landlordry (地主制度を改革する)"],"synonyms":["land tenure system","feudalism","estate system"],"antonyms":["peasant proprietorship","family farming"],"notes":"Often associated with historical or political contexts where land ownership is concentrated in the hands of a few."}],"etymology":{"value":"Derived from 'landlord' (one who owns and rents out land) + '-ry' (suffix denoting a system, practice, or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlændˌlɔːrdri/","syllables":"land-lord-ry"},"inflection":{"noun_plural":"landlordries"},"usage_notes":{"explanation":"'Landlordry' refers to a system or the power structure arising from the ownership of land by landlords who lease it to tenants. It often carries a negative connotation, especially when associated with exploitation or social inequality. The term is less commonly used in modern contexts, as direct land ownership is less prevalent in many developed countries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The landlordry was very kind to their tenants.","correct":"✓ The landlords were very kind to their tenants.","note":"'Landlordry' refers to the system, not the landlords themselves. To describe the landlords, use 'landlords' or 'the landlord class'."},{"incorrect":"✗ He is a landlordry.","correct":"✓ He is a landlord.","note":"'Landlordry' is the system, not a person. Use 'landlord' to refer to a person who owns and rents out land."}],"priority":"★★☆"},"related_words":{"derivatives":["landlord (地主)","tenant (小作人、賃借人)","land tenure (土地保有)","leasehold (借地権)"],"phrases":["land reform (土地改革)","agrarian reform (農業改革)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Landlordry' is a formal term referring to a system where land is owned by landlords who rent it out to tenants. It often implies a historical or political context where this system has significant social and economic implications. Understanding the term requires familiarity with concepts of land ownership, tenancy, and historical power structures. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The government implemented land reforms to break up the concentration of land ownership under landlordry.","translation":"政府は、地主制度下での土地所有の集中を解消するために土地改革を実施した。","type":"general","meaning_category":"地主制度"},{"sentence":"The history of landlordry in Ireland is marked by periods of famine and social unrest.","translation":"アイルランドにおける地主制度の歴史は、飢饉と社会不安の時代によって特徴づけられている。","type":"historical","meaning_category":"地主制度の歴史"}]}