{"word":"Suprarationalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"超理性主義：理性や論理を超越した、直感、霊感、信仰、神秘主義などを重視する哲学または思想。","english_definition":"A philosophical or ideological viewpoint that emphasizes the importance of intuition, inspiration, faith, mysticism, or other non-rational forms of knowledge or experience, as being superior to reason and logic.","examples":[{"sentence":"Suprarationalism suggests that some truths can only be accessed through spiritual insight.","translation":"超理性主義は、ある種の真実は霊的な洞察を通してのみアクセス可能であることを示唆する。"},{"sentence":"Critics argue that suprarationalism can lead to irrational beliefs and actions.","translation":"批評家は、超理性主義が不合理な信念や行動につながる可能性があると主張する。"}],"collocations":["spiritual insight","mystical experience","intuitive understanding","transcendental knowledge"],"synonyms":["Intuitionism","Mysticism","Spiritualism","Transcendentalism"],"antonyms":["Rationalism","Empiricism","Materialism"]}],"etymology":{"value":"\"Supra-\" (above, beyond) + \"rationalism\" (belief in reason as the primary source of knowledge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːprəˈræʃənəlɪzəm/","syllables":"su-pra-ra-tion-al-ism"},"inflection":{"noun_plural":"Suprarationalisms"},"usage_notes":{"explanation":"Suprarationalism is often contrasted with rationalism, which emphasizes reason and logic as the primary sources of knowledge. It is often associated with religious or spiritual beliefs, as well as artistic or creative endeavors that rely on intuition and inspiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced suprarationalism in his scientific research.","correct":"✓ He incorporated intuition into his scientific research, which some might consider a form of suprarationalism.","note":"Suprarationalism is generally considered incompatible with scientific research, which relies on empirical evidence and logical reasoning. It is more commonly associated with fields like religion, spirituality, and art."}],"priority":"★☆☆"},"related_words":{"derivatives":["Suprarational (adjective)","Suprarationalist (noun/adjective)"],"related_concepts":["Intuition","Faith","Mysticism","Spirituality","Transcendentalism","Rationalism","Empiricism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Suprarationalism is a complex philosophical term that describes a belief system where knowledge and understanding come from sources beyond reason and logic. This could include intuition, spiritual experiences, or faith. It's often used in discussions about religion, art, and philosophy, and is often contrasted with rationalism, which values reason as the primary source of knowledge. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The artist's work was driven by suprarationalism, embracing intuition over logical thought.","translation":"その芸術家の作品は超理性主義に突き動かされ、論理的な思考よりも直感を受け入れた。","type":"general","meaning_category":"general"},{"sentence":"Some theologians incorporate elements of suprarationalism to explain aspects of faith that defy logical explanation.","translation":"一部の神学者は、論理的な説明に反する信仰の側面を説明するために、超理性主義の要素を取り入れている。","type":"specific","meaning_category":"theology"}]}