{"word":"Amalaka","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Ayurveda) Amla, the fruit of the Indian gooseberry tree (Phyllanthus emblica), known for its high vitamin C content and medicinal properties.","english_definition":"In Ayurveda, the fruit of the Indian gooseberry tree (Phyllanthus emblica), valued for its high vitamin C content and therapeutic uses.","examples":[{"sentence":"Amalaka is a key ingredient in many Ayurvedic formulations.","translation":"アムラカは多くのアーユルヴェーダ製剤の重要な成分です。"},{"sentence":"Consuming Amalaka is believed to boost immunity.","translation":"アムラカの摂取は免疫力を高めると信じられています。"}],"collocations":["Ayurvedic medicine","vitamin C","immune system","health benefits"],"synonyms":["Amla","Indian gooseberry","Phyllanthus emblica"],"antonyms":[]}],"etymology":{"value":"Derived from Sanskrit, where 'Amalaka' refers to the Indian gooseberry fruit.","priority":"★★★"},"pronunciation":{"ipa":"/ɑːməˈlɑːkə/","syllables":"A-ma-la-ka"},"inflection":{"notes":"Singular noun. No plural form typically used."},"usage_notes":{"explanation":"'Amalaka' is primarily used in the context of Ayurveda and traditional Indian medicine. It refers specifically to the fruit, Amla, and its uses in promoting health and wellness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought amalaka juice at the grocery store.","correct":"✓ I bought amla juice at the Indian grocery store.","note":"Outside of Ayurvedic contexts, 'amla' is the more common term."}],"priority":"★★☆"},"related_words":{"derivatives":["Amalaki (alternative spelling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"None (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Amalaka' is a specialized term primarily encountered in discussions of Ayurveda, traditional Indian medicine, and related health topics. Understanding its meaning requires familiarity with these contexts. It is not a commonly used word in general English.","priority":"★★★"},"example_sentences":[{"sentence":"The doctor recommended taking Amalaka supplements for its antioxidant properties.","translation":"医師は、抗酸化作用のためにアムラカのサプリメントを摂取することを勧めました。","type":"noun","meaning_category":"Ayurvedic medicine"},{"sentence":"Amalaka is known for its sour and astringent taste.","translation":"アムラカは、その酸味と渋みで知られています。","type":"noun","meaning_category":"Description of fruit"}]}