{"word":"exaltedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"得意げに、大げさに、誇らしげに、高慢に","english_definition":"In a proud, elated, or boastful manner; in a way that expresses great joy, pride, or importance.","examples":[{"sentence":"He spoke exaltedly of his achievements.","translation":"彼は自分の業績を得意げに語った。"},{"sentence":"She behaved exaltedly after winning the award.","translation":"彼女は受賞後、誇らしげに振る舞った。"},{"sentence":"The leader addressed the crowd exaltedly, promising a brighter future.","translation":"指導者は群衆に向かって得意げに演説し、明るい未来を約束した。"}],"collocations":["speak exaltedly","behave exaltedly","address exaltedly"],"synonyms":["proudly","elatedly","boastfully","arrogantly","haughtily","pompously","grandiosely"],"antonyms":["humbly","modestly","unassumingly"]}],"etymology":{"value":"Derived from the verb 'exalt,' meaning to raise in rank or estimation, with the suffix '-edly' added to form an adverb. 'Exalt' comes from Latin 'exaltare,' meaning 'to raise on high.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzɔːltɪdli/","syllables":"ex-alt-ed-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Exaltedly' describes actions or speech done in a way that shows excessive pride, joy, or self-importance. It often implies a sense of superiority or boastfulness. The term is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt exaltedly after the good news.","correct":"✓ He felt elated after the good news.","note":"'Exaltedly' describes *how* someone acts or speaks, not the feeling itself. 'Elated' is a better choice to describe the feeling of great happiness."},{"incorrect":"✗ She exaltedly accepted the gift.","correct":"✓ She proudly accepted the gift.","note":"While 'exaltedly' can imply pride, 'proudly' is a more common and straightforward way to describe accepting something with a sense of accomplishment."}],"priority":"★★☆"},"related_words":{"derivatives":["exalt (verb): to praise or elevate","exalted (adjective): of high rank or noble","exaltation (noun): the act of exalting or the state of being exalted"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'exaltedly' is a formal adverb that describes doing something in a proud, elated, or boastful way. It suggests a sense of self-importance or superiority. It's not a commonly used word, so it's important to understand its precise meaning and use it appropriately in writing or formal speech."},"example_sentences":[{"sentence":"The general spoke exaltedly of the victory, exaggerating his own role in the battle.","translation":"将軍は勝利について得意げに語り、戦闘における自身の役割を誇張した。","type":"adverb","meaning_category":"boastfully"},{"sentence":"She walked exaltedly onto the stage, basking in the applause of the audience.","translation":"彼女は得意げに舞台に上がり、観客の拍手を浴びた。","type":"adverb","meaning_category":"proudly"},{"sentence":"He described his accomplishments so exaltedly that many listeners were put off by his arrogance.","translation":"彼は自分の功績をあまりにも得意げに語ったので、多くの聴衆は彼の傲慢さにうんざりした。","type":"adverb","meaning_category":"arrogantly"}]}