{"word":"diaceturia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジアセトン尿（症）: 尿中にジアセトン（アセト酢酸）が異常に排出される状態。糖尿病、飢餓、または他の代謝異常によって引き起こされることがある。","english_definition":"The presence of diacetic acid (acetoacetic acid) in the urine, often associated with diabetes mellitus, starvation, or other metabolic abnormalities.","examples":[{"sentence":"Diaceturia can be a sign of uncontrolled diabetes.","translation":"ジアセトン尿は、コントロールされていない糖尿病の兆候である可能性がある。"},{"sentence":"The patient's urine test revealed diaceturia.","translation":"患者の尿検査でジアセトン尿が認められた。"}],"collocations":["test for diaceturia (ジアセトン尿の検査)","cause diaceturia (ジアセトン尿を引き起こす)","detect diaceturia (ジアセトン尿を検出する)"],"synonyms":["acetonuria","ketonuria"],"antonyms":[]}],"etymology":{"value":"'Di-' (two) + 'acet-' (acetic acid) + '-uria' (urine condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪˌæsɪˈtjʊəriə/","syllables":"di-a-ce-tu-ri-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Diaceturia is a medical term indicating an abnormal presence of diacetic acid (acetoacetic acid) in urine. It's often associated with conditions where the body is not properly metabolizing carbohydrates and starts breaking down fats for energy, leading to the production of ketone bodies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Diaceturia is a disease itself.","correct":"✓ Diaceturia is a symptom of an underlying condition.","note":"Diaceturia is a symptom, not a disease. It indicates an underlying metabolic issue."}],"priority":"★☆☆"},"related_words":{"derivatives":["diacetic acid","ketone","ketosis","ketonemia"],"related_medical_terms":["diabetes mellitus","starvation","metabolic acidosis"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. It's a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diaceturia' is a specialized medical term referring to the presence of diacetic acid in urine. It is typically used in medical contexts and is not commonly encountered in everyday language. Understanding this term requires knowledge of basic biochemistry and medical terminology."},"example_sentences":[{"sentence":"Persistent diaceturia requires further medical evaluation to determine the underlying cause.","translation":"持続的なジアセトン尿は、根本的な原因を特定するために、さらなる医学的評価が必要です。","type":"general","meaning_category":"medical"},{"sentence":"The presence of diaceturia in a pregnant woman may indicate gestational diabetes.","translation":"妊娠中の女性におけるジアセトン尿の存在は、妊娠糖尿病を示唆する可能性があります。","type":"specific","meaning_category":"medical"}]}