{"word":"ozonizing","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"オゾン処理する、オゾン化する","english_definition":"To treat something with ozone, typically for purification or sterilization.","examples":[{"sentence":"The water is ozonizing to remove impurities.","translation":"不純物を取り除くために、その水はオゾン処理されています。"},{"sentence":"The air purifier works by ozonizing the air.","translation":"その空気清浄機は、空気をオゾン処理することで機能します。"},{"sentence":"They are ozonizing the swimming pool to kill bacteria.","translation":"彼らはバクテリアを殺すために、そのスイミングプールをオゾン処理しています。"}],"collocations":["ozonizing water (水をオゾン処理する)","ozonizing air (空気をオゾン処理する)","ozonizing equipment (オゾン処理装置)"],"synonyms":["sterilizing with ozone","purifying with ozone","treating with ozone"],"antonyms":["contaminating","polluting"]}],"etymology":{"value":"Formed from 'ozone' + '-ize' + '-ing'. The suffix '-ize' indicates the process of treating something with a specific substance (in this case, ozone), and '-ing' indicates the present participle or gerund form of the verb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊzoʊˌnaɪzɪŋ/","syllables":"o-zo-niz-ing"},"inflection":{"verb_forms":{"present_participle":"ozonizing","gerund":"ozonizing"}},"usage_notes":{"explanation":"'Ozonizing' refers specifically to the process of using ozone (O3) to purify, sterilize, or deodorize something. It is commonly used in water treatment, air purification, and in some medical applications. The process involves generating ozone and exposing the target substance to it. Ozone is a powerful oxidizing agent, which allows it to effectively kill bacteria, viruses, and other microorganisms, as well as break down odor-causing molecules.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ozonizing is very effective.","correct":"✓ The ozonation is very effective.","note":"'Ozonizing' is a verb form. If you need a noun, use 'ozonation' instead."},{"incorrect":"✗ Ozonizing is dangerous if you breathe it directly.","correct":"✓ Ozone is dangerous if you breathe it directly.","note":"'Ozonizing' is the process. It's ozone itself that is dangerous to breathe."}],"priority":"★★☆"},"related_words":{"derivatives":["ozone (名詞: オゾン)","ozonation (名詞: オゾン処理)","ozonize (動詞: オゾン処理する)","ozonated (形容詞: オゾン処理された)","ozonator (名詞: オゾン発生器)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ozonizing' is a technical term that refers to the process of treating something with ozone, typically for purification or sterilization purposes. Ozone (O3) is a powerful oxidizing agent that can kill bacteria, viruses, and other microorganisms, as well as break down odor-causing molecules. The term is often used in the context of water treatment, air purification, and medical applications. Understanding this term requires familiarity with basic chemistry and environmental science concepts."},"example_sentences":[{"sentence":"The company specializes in ozonizing systems for industrial water treatment.","translation":"その会社は、工業用水処理用のオゾン処理システムを専門としています。","type":"verb","meaning_category":"オゾン処理する"},{"sentence":"Ozonizing the air can help to reduce mold and mildew.","translation":"空気をオゾン処理することで、カビを減らすのに役立ちます。","type":"verb","meaning_category":"オゾン処理する"},{"sentence":"The machine is capable of ozonizing large volumes of water quickly.","translation":"その機械は、大量の水を迅速にオゾン処理することができます。","type":"verb","meaning_category":"オゾン処理する"}]}