{"word":"pharmaceutics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"製剤学、調剤学","english_definition":"The science of preparing and dispensing drugs, including dosage form design.","examples":[{"sentence":"Pharmaceutics is a crucial field in the development of effective medications.","translation":"製剤学は、効果的な医薬品の開発において非常に重要な分野です。"},{"sentence":"The pharmaceutics department is responsible for formulating new drugs.","translation":"製剤部門は、新しい薬の製剤化を担当しています。"},{"sentence":"He specialized in pharmaceutics during his graduate studies.","translation":"彼は大学院で製剤学を専攻しました."}],"collocations":["pharmaceutics research (製剤学研究)","pharmaceutics department (製剤部門)","study pharmaceutics (製剤学を学ぶ)","pharmaceutics industry (製薬業界)","pharmaceutics company (製薬会社)"],"synonyms":["drug formulation","pharmaceutical technology","dosage form design","drug delivery"],"antonyms":[]}],"etymology":{"value":"Derived from 'pharmaceutical' (related to drugs) and the suffix '-ics' (denoting a field of study or science).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɑːrməˈsuːtɪks/","syllables":"phar-ma-ceu-tics"},"inflection":{"notes":"It is a plural noun, but is treated as singular when referring to the field of study."},"usage_notes":{"explanation":"'Pharmaceutics' is the science concerned with the formulation, manufacture, stability, and effectiveness of pharmaceutical preparations. It focuses on converting a drug substance into a medication suitable for use by patients. This includes dosage form design, drug delivery systems, and the study of how drugs are absorbed, distributed, metabolized, and excreted by the body.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies pharmaceutical.","correct":"✓ He studies pharmaceutics.","note":"'Pharmaceutical' is an adjective, while 'pharmaceutics' is the noun referring to the field of study."},{"incorrect":"✗ Pharmaceutic is an important science.","correct":"✓ Pharmaceutics is an important science.","note":"Use the correct noun form 'pharmaceutics' to refer to the science."}],"priority":"★★☆"},"related_words":{"derivatives":["pharmaceutical (adjective, noun)","pharmacist (noun)","pharmacology (noun)","pharmacy (noun)"],"phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Pharmaceutics' is a specialized term used in the context of pharmaceutical sciences. It refers to the scientific discipline that deals with the design, development, and manufacturing of effective and safe medicines. Understanding this term requires familiarity with scientific and medical vocabulary. It is commonly encountered in academic research, pharmaceutical industry reports, and advanced medical texts."},"example_sentences":[{"sentence":"The principles of pharmaceutics guide the development of novel drug delivery systems.","translation":"製剤学の原則は、新規なドラッグデリバリーシステムの開発を導きます。","type":"general","meaning_category":"general"},{"sentence":"Advances in pharmaceutics have led to more effective and patient-friendly medications.","translation":"製剤学の進歩により、より効果的で患者に優しい医薬品が開発されました。","type":"general","meaning_category":"general"},{"sentence":"Her research in pharmaceutics focuses on improving drug bioavailability.","translation":"彼女の製剤学の研究は、薬物のバイオアベイラビリティの向上に焦点を当てています。","type":"research","meaning_category":"research"}]}