{"word":"Amaryllidaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒガンバナ科","english_definition":"The Amaryllis family of herbaceous (perennial) flowering plants with bulbs, corms, or rhizomes, including amaryllis, daffodils, snowdrops, onions, garlic, and related genera.","examples":[{"sentence":"Onions and garlic belong to the Amaryllidaceae family.","translation":"タマネギとニンニクはヒガンバナ科に属する。"},{"sentence":"Many plants in the Amaryllidaceae family are cultivated for their beautiful flowers.","translation":"ヒガンバナ科の植物の多くは、その美しい花のために栽培されている。"}],"collocations":["Amaryllidaceae family","plants of Amaryllidaceae","genera of Amaryllidaceae"],"synonyms":["Amaryllis family"],"antonyms":[]}],"etymology":{"value":"Formed from the genus name 'Amaryllis' + '-aceae' (a suffix used to form the names of plant families). 'Amaryllis' is derived from a shepherdess name in Virgil's Eclogues.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæməˌrɪlɪˈdeɪsiː/","syllables":"A-ma-ryl-li-da-ce-ae"},"inflection":{"noun_plural":"Amaryllidaceaes / Amaryllidaceae"},"usage_notes":{"explanation":"'Amaryllidaceae' is a botanical term used in scientific contexts to classify a specific family of flowering plants. It is typically used by botanists, horticulturalists, and those with a strong interest or expertise in plant taxonomy. In general conversation, people are more likely to refer to specific plants within the family (e.g., daffodils, onions) rather than using the family name itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Amaryllidaceae is a type of animal.","correct":"✓ Amaryllidaceae is a family of plants.","note":"Amaryllidaceae refers to a family of flowering plants, not animals."},{"incorrect":"✗ Amaryllidaceae are only found in tropical regions.","correct":"✓ Amaryllidaceae are found in various climates around the world.","note":"While some Amaryllidaceae species are tropical, others are found in temperate and even colder climates."}],"priority":"★★☆"},"related_words":{"derivatives":["amaryllis (genus)","narcissus (genus)","galanthus (genus)","allium (genus)"],"other_related_terms":["monocotyledon","bulb","corm","rhizome","herbaceous plant"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Low frequency (scientific/botanical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amaryllidaceae' is a technical term used in botany to refer to a specific family of flowering plants. This term is typically encountered in scientific literature, botanical gardens, or advanced horticultural contexts. Understanding this term requires familiarity with plant classification systems and botanical terminology. The average person is more likely to know the common names of plants within this family (e.g., daffodils, onions) rather than the family name itself."},"example_sentences":[{"sentence":"The botanical garden featured a diverse collection of Amaryllidaceae species.","translation":"その植物園には、ヒガンバナ科の多様な種が集められていた。","type":"general"},{"sentence":"Researchers are studying the chemical compounds found in Amaryllidaceae for their potential medicinal properties.","translation":"研究者たちは、ヒガンバナ科の植物に含まれる化学物質の潜在的な薬効について研究している。","type":"scientific"},{"sentence":"Many members of the Amaryllidaceae family are popular ornamental plants.","translation":"ヒガンバナ科の多くの種は、人気の観賞植物である。","type":"horticultural"}]}