{"word":"intra-corporate","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"企業内の、企業内における","english_definition":"Relating to activities or relationships within a corporation.","examples":[{"sentence":"The company facilitates intra-corporate communication through its online platform.","translation":"その会社は、オンラインプラットフォームを通じて企業内コミュニケーションを促進している。"},{"sentence":"Intra-corporate transfers of employees are common in multinational corporations.","translation":"多国籍企業では、従業員の企業内異動が一般的である。"},{"sentence":"The audit focused on intra-corporate transactions to ensure compliance.","translation":"監査は、コンプライアンスを確保するために企業内取引に焦点を当てた。"}],"collocations":["intra-corporate communication (企業内コミュニケーション)","intra-corporate transfer (企業内異動)","intra-corporate transaction (企業内取引)","intra-corporate network (企業内ネットワーク)","intra-corporate policy (企業内ポリシー)"],"synonyms":["internal","in-house","within the company"],"antonyms":["inter-corporate","external","outside the company"]}],"etymology":{"value":"The prefix 'intra-' comes from Latin, meaning 'within' or 'inside'. 'Corporate' refers to a corporation or company. Thus, 'intra-corporate' means 'within a corporation'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəˈkɔːrpərət/","syllables":"in-tra-cor-po-rate"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Intra-corporate' is used to describe activities, relationships, or processes that occur within the boundaries of a single corporation. It emphasizes that something is happening internally, as opposed to between different companies (inter-corporate) or with external entities. It is commonly used in business, legal, and economic contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inter-corporate memo was sent to all employees.","correct":"✓ The intra-corporate memo was sent to all employees.","note":"'Inter-corporate' refers to communication between different companies, while 'intra-corporate' refers to communication within a single company."},{"incorrect":"✗ The intra-corporate agreement was between two separate companies.","correct":"✓ The inter-corporate agreement was between two separate companies.","note":"'Intra-corporate' agreements are within one company; agreements between two companies are 'inter-corporate'."}],"priority":"★★☆"},"related_words":{"derivatives":["intra (prefix: within, inside)","corporate (adjective: relating to a corporation; noun: a corporation)","corporation (noun: a company or group of people authorized to act as a single entity)"],"phrases":["intra-corporate loan","intra-corporate services","intra-corporate restructuring"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in business and legal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Intra-corporate' is a specialized term primarily used in business, legal, and economic contexts. It describes activities, relationships, or processes that occur within a single company. Understanding this term requires familiarity with business vocabulary and the ability to distinguish between internal and external relationships of a corporation. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The company's success is partly due to efficient intra-corporate communication.","translation":"その会社の成功は、効率的な企業内コミュニケーションによる部分もある。","type":"general","meaning_category":"Communication"},{"sentence":"The legal team reviewed the intra-corporate agreements to ensure compliance with regulations.","translation":"法務チームは、規制遵守を徹底するため、企業内契約を見直した。","type":"legal","meaning_category":"Legal"},{"sentence":"Intra-corporate knowledge sharing is encouraged through regular training sessions.","translation":"定期的な研修を通じて、企業内での知識共有が奨励されている。","type":"business","meaning_category":"Business"}]}