{"word":"Ethnohistoric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"民族歴史学的な","english_definition":"Relating to ethnohistory, the study of cultures and indigenous peoples by examining historical records as well as other sources.","examples":[{"sentence":"Ethnohistoric research provides valuable insights into pre-colonial societies.","translation":"民族歴史学的な研究は、植民地化以前の社会に関する貴重な洞察を提供する。"},{"sentence":"The ethnohistoric approach combines historical documents with anthropological methods.","translation":"民族歴史学的なアプローチは、歴史的文書と人類学的な方法を組み合わせる。"}],"collocations":["ethnohistoric study","ethnohistoric research","ethnohistoric analysis","ethnohistoric data","ethnohistoric perspective"],"synonyms":["historical anthropological","cultural historical"],"antonyms":[]}],"etymology":{"value":"'Ethno-' (relating to people or a nation) + 'historic' (relating to history).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛθnoʊhɪˈstɔːrɪk/","syllables":"eth-no-hi-stor-ic"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Ethnohistoric' is primarily used in academic and research contexts, particularly in anthropology, history, and archaeology. It describes studies, data, or perspectives that integrate historical records with ethnographic methods to understand past cultures and societies, especially those of indigenous peoples.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ethnohistoric event was fascinating.","correct":"✓ The historical event was fascinating.","note":"'Ethnohistoric' describes research or analysis, not events themselves. Use 'historical' for events."}],"priority":"★☆☆"},"related_words":{"derivatives":["ethnohistory (noun)","ethnohistorically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ethnohistoric' is a specialized academic term used to describe research that combines historical and anthropological methods to study cultures, particularly indigenous cultures. It's not a commonly used word in everyday conversation, but is important in academic fields like anthropology and history when referring to a specific type of research methodology."},"example_sentences":[{"sentence":"The museum exhibit presented an ethnohistoric account of the tribe's migration patterns.","translation":"博物館の展示は、その部族の移動パターンに関する民族歴史学的な説明を提示した。","type":"adjective","meaning_category":"民族歴史学的な"},{"sentence":"Ethnohistoric sources reveal complex social structures within the pre-colonial society.","translation":"民族歴史学的な資料は、植民地化以前の社会における複雑な社会構造を明らかにする。","type":"adjective","meaning_category":"民族歴史学的な"}]}