{"word":"proflated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(economics) Describes a situation where prices have been deliberately lowered, often by government intervention, to counteract inflation or to stimulate demand.","english_definition":"(economics) Characterized by prices that have been deliberately lowered, typically by government intervention, to combat inflation or boost economic activity.","examples":[{"sentence":"The government's proflated prices on essential goods helped to stabilize the economy during the recession.","translation":"政府が生活必需品の価格を意図的に引き下げたことで、不況時の経済安定に役立った。"}],"collocations":["proflated prices","government proflated","proflated economy"],"synonyms":["deflated (in a deliberate context)","controlled (prices)","regulated (prices)"],"antonyms":["inflated","unregulated","market-driven"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(economics) To deliberately lower prices, typically through government policy or intervention.","english_definition":"(economics) To intentionally reduce prices, usually through governmental policies or actions.","examples":[{"sentence":"The central bank proflated interest rates to encourage borrowing and investment.","translation":"中央銀行は借り入れと投資を促進するために金利を意図的に引き下げた。"}],"collocations":["proflate prices","proflate interest rates","proflate the market"],"synonyms":["deflate (deliberately)","regulate (prices)","control (prices)"],"antonyms":["inflate","deregulate"]}],"etymology":{"value":"A blend of 'profit' and 'deflated', suggesting an artificial deflation aimed at benefiting consumers or the economy. The term is relatively new and not widely recognized.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈproʊfleɪtɪd/","syllables":"pro-flat-ed"},"inflection":{"verb_forms":{"present_simple":["proflate","proflates"],"past_simple":"proflated","past_participle":"proflated","present_participle":"proflating"}},"usage_notes":{"explanation":"The term 'proflated' is not a standard or widely recognized term in economics. It is a neologism, likely a blend, used to describe a deliberate effort to lower prices, often by government intervention. Its usage is very limited.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proflated balloon lost all its air.","correct":"✓ The deflated balloon lost all its air.","note":"'Proflated' refers to economic manipulation of prices, not the physical deflation of an object. Use 'deflated' for balloons or tires. "},{"incorrect":"✗ The company proflated their profits this quarter.","correct":"✓ The company reported lower profits this quarter.","note":"'Proflated' is about prices, not profits. Use standard business language to describe profit changes."}],"priority":"★☆☆"},"related_words":{"derivatives":["proflation (noun)"],"related_terms":["deflation","inflation","price control","market manipulation"]},"level_frequency":{"CEFR":"N/A (not a standard term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Proflated' is a specialized and uncommon term, primarily relevant in advanced economic discussions. It describes a deliberate lowering of prices, often through government action, to combat economic issues. Because it is not a standard term, careful explanation is needed when using it."},"example_sentences":[{"sentence":"Economists debated whether the government should proflate the housing market to make homes more affordable.","translation":"経済学者たちは、住宅をより手頃な価格にするために、政府が住宅市場の価格を意図的に引き下げるべきかどうかについて議論した。"},{"sentence":"The proflated prices on agricultural products helped to support local farmers.","translation":"農産物の価格を意図的に引き下げたことが、地元の農家を支援することに繋がった。"}]}