{"word":"eolation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"風食、風化","english_definition":"erosion and weathering, especially in arid regions, caused by the wind.","examples":[{"sentence":"The eolation of the desert landscape created unique rock formations.","translation":"砂漠の地形の風食作用は、独特な岩の形状を作り出した。"},{"sentence":"Eolation is a major factor in the degradation of soil in arid climates.","translation":"風食は、乾燥地帯の土壌劣化の主要な要因である。"}],"collocations":["aeolian processes","wind erosion","desert eolation","soil eolation"],"synonyms":["wind erosion","deflation","abrasion"],"antonyms":["deposition","sedimentation"]}],"etymology":{"value":"Derived from Aeolus, the Greek god of the winds, plus the suffix -ation, indicating a process or action.","priority":"★★★"},"pronunciation":{"ipa":"/iːoʊˈleɪʃən/","syllables":"e-o-la-tion"},"inflection":{"noun_plural":"eolations"},"usage_notes":{"explanation":"Eolation refers specifically to the erosive action of wind, particularly in dry environments where vegetation is sparse. It's often used in geological and environmental science contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The eolation was caused by water.","correct":"✓ The erosion was caused by water.","note":"Eolation is specifically caused by wind, not water. Water erosion is simply called erosion or water erosion."}],"priority":"★★☆"},"related_words":{"derivatives":["aeolian (adjective: relating to or arising from the action of the wind)","aeolian deposit (noun: a geological deposit of material transported and accumulated by the wind)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eolation' is a specialized term used in geography and geology to describe the process of erosion caused by wind. It's most relevant in arid or desert environments where wind is a significant agent of weathering and transportation of sediment. The term is derived from Aeolus, the Greek god of wind, which helps to remember its meaning. It's not a commonly used word in everyday conversation, but understanding it is useful for those studying earth sciences."},"example_sentences":[{"sentence":"Extensive eolation has sculpted the sandstone cliffs over millions of years.","translation":"広範囲にわたる風食作用が、何百万年にもわたって砂岩の崖を削り出してきた。","type":"noun","meaning_category":"wind erosion"},{"sentence":"The effects of eolation are evident in the formation of sand dunes.","translation":"風食の影響は、砂丘の形成に明らかである。","type":"noun","meaning_category":"wind erosion"}]}