{"word":"Gum-bichromate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)ガム・ビクロメート印画法","english_definition":"(Photography) A photographic printing process based on the light sensitivity of dichromates. A coating of gum arabic, dichromate, and pigment is applied to a base material, exposed to light through a negative, and then washed to remove the unhardened gum.","examples":[{"sentence":"Gum-bichromate printing allows for a high degree of artistic control.","translation":"ガム・ビクロメート印画法は、高度な芸術的コントロールを可能にする。"},{"sentence":"The gum-bichromate process is known for its painterly aesthetic.","translation":"ガム・ビクロメート印画法は、絵画的な美しさで知られている。"}],"collocations":["gum-bichromate print","gum-bichromate process","gum print"],"synonyms":["gum print","dichromate print"],"antonyms":[]}],"etymology":{"value":"The term comes from the ingredients used in the process: gum arabic, a natural gum, and a dichromate salt, typically potassium dichromate or ammonium dichromate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡʌm baɪˈkroʊmeɪt/","syllables":"gum-bi-chro-mate"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"The gum-bichromate process is a historical photographic printing technique that allows for significant artistic manipulation. Each print is unique, and the process is known for its soft, painterly quality. It is a labor-intensive process that requires skill and experimentation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used gum bichromate to take a photo.","correct":"✓ I used the gum-bichromate process to make a print.","note":"Gum-bichromate is a printing process, not a way to take a photograph. It's used to create a final print from a negative."}],"priority":"★☆☆"},"related_words":{"derivatives":["gum arabic","dichromate","pigment"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gum-bichromate' refers to a specialized and historical photographic printing process. Understanding this term requires familiarity with photographic techniques and art history. The process involves using gum arabic, a dichromate salt, and pigment to create a unique print. Due to its technical nature and limited use outside of fine art photography, it is not a commonly encountered term."},"example_sentences":[{"sentence":"She created a stunning landscape using the gum-bichromate technique.","translation":"彼女はガム・ビクロメート技法を使って素晴らしい風景を作り出した。","type":"noun","meaning_category":"印画法"},{"sentence":"The artist is known for his experimental gum-bichromate prints.","translation":"そのアーティストは、実験的なガム・ビクロメート印画で知られている。","type":"noun","meaning_category":"印画法"}]}