{"word":"non-climate-controlled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"温度や湿度が調整されていない、空調設備がない","english_definition":"Not having systems to regulate temperature and humidity.","examples":[{"sentence":"We store the extra inventory in a non-climate-controlled warehouse.","translation":"余った在庫は、空調設備のない倉庫に保管しています。"},{"sentence":"The old building has a non-climate-controlled storage area.","translation":"その古い建物には、温度や湿度が調整されていない保管エリアがあります。"},{"sentence":"Items sensitive to temperature should not be stored in a non-climate-controlled environment.","translation":"温度に敏感な品物は、温度や湿度が調整されていない環境で保管すべきではありません。"}],"collocations":["non-climate-controlled storage (空調設備のない保管場所)","non-climate-controlled warehouse (空調設備のない倉庫)","non-climate-controlled environment (空調設備のない環境)"],"synonyms":["unconditioned","unheated","uncooled"],"antonyms":["climate-controlled","temperature-controlled","air-conditioned"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the phrase 'climate-controlled'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn ˈklaɪmət kənˈtroʊld/","syllables":"non-cli-mate-con-trolled"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Non-climate-controlled' is used to describe spaces or facilities that do not have systems in place to regulate temperature and humidity. This is important for storing items that are sensitive to environmental conditions, such as electronics, documents, artwork, and certain types of food.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ non climate controlled","correct":"✓ non-climate-controlled","note":"The hyphen is important for clarity, especially when used as a pre-modifying adjective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'non-climate-controlled' describes a space lacking temperature and humidity regulation. It's often used in contexts related to storage, warehousing, and preservation of sensitive items. Understanding this term is important for those dealing with goods that can be damaged by extreme temperatures or humidity levels."},"example_sentences":[{"sentence":"The museum's archives are in a climate-controlled environment, but the temporary exhibit is in a non-climate-controlled area.","translation":"博物館の保管室は温度と湿度が調整された環境にありますが、一時的な展示は空調設備のないエリアにあります。","type":"general","meaning_category":"environment"},{"sentence":"Storing furniture in a non-climate-controlled unit can lead to mold and mildew growth.","translation":"家具を空調設備のない場所に保管すると、カビが生える可能性があります。","type":"storage","meaning_category":"storage"},{"sentence":"The cost of a non-climate-controlled storage unit is typically lower than a climate-controlled one.","translation":"空調設備のない保管ユニットの費用は、通常、空調設備のあるユニットよりも安価です。","type":"cost","meaning_category":"cost"}]}