{"word":"tonnishly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a fashionable or stylish manner, especially associated with high society or wealthy individuals.","english_definition":"In a fashionable or stylish manner, especially associated with high society or wealthy individuals.","examples":[{"sentence":"She was dressed tonnishly for the gala, attracting admiring glances from all around.","translation":"彼女はガラのために上品に着飾っており、周囲から羨望の眼差しを集めていた。"},{"sentence":"The restaurant was tonnishly decorated with modern art and designer furniture.","translation":"そのレストランは、モダンアートとデザイナー家具で上品に装飾されていた。"}],"collocations":["dressed tonnishly","decorated tonnishly","behaved tonnishly"],"synonyms":["fashionably","stylishly","elegantly","chicly","smartly"],"antonyms":["unfashionably","dowdily","shabbily"]}],"etymology":{"value":"Derived from 'tonnish,' which is related to 'ton,' an archaic term for high society or fashionable circles. The suffix '-ly' is added to form an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʌnɪʃli/","syllables":"ton-nish-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Tonnishly' describes actions or appearances that are highly fashionable or stylish, often in a way that is associated with wealth or high social status. It implies a deliberate effort to be seen as sophisticated and up-to-date.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The car drove tonnishly down the street.","correct":"The car drove stylishly down the street.","note":"'Tonnishly' is more appropriate for describing appearance or behavior, not the manner of driving."}],"priority":"★★★"},"related_words":{"derivatives":["tonnish","ton"],"related_terms":["fashionable","stylish","chic","elegant"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★★"},"readability_explanation":{"level":"C2","text":"'Tonnishly' is a rare and sophisticated word used to describe something done in a highly fashionable or stylish manner, typically associated with high society. Its usage is limited to contexts where the speaker wishes to convey a sense of refined elegance and social awareness."},"example_sentences":[{"sentence":"The party was tonnishly arranged, with every detail meticulously planned.","translation":"パーティーは細部まで綿密に計画され、上品に演出されていた。","type":"general","meaning_category":"fashionable manner"},{"sentence":"He tonnishly displayed his wealth through expensive cars and designer clothes.","translation":"彼は高価な車やデザイナー服を通して、自分の富を上品に見せびらかしていた。","type":"general","meaning_category":"stylish behavior"}]}