{"word":"Non-juring","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史)宣誓拒否者の、不服従の","english_definition":"(historical) refusing to take an oath of allegiance, especially to the British monarch after the Glorious Revolution of 1688.","examples":[{"sentence":"The Non-juring clergy refused to swear allegiance to William and Mary.","translation":"宣誓拒否聖職者は、ウィリアムとメアリーに忠誠を誓うことを拒否した。"}],"collocations":["Non-juring clergy","Non-juring bishops","Non-juring schism"],"synonyms":["dissenting","disaffected","nonconformist"],"antonyms":["juring","loyal","allegiant"]},{"part_of_speech":"noun","definition":"(歴史)宣誓拒否者","english_definition":"(historical) a person who refused to take an oath of allegiance, especially to the British monarch after the Glorious Revolution of 1688.","examples":[{"sentence":"The Non-jurors formed a separate church.","translation":"宣誓拒否者は別の教会を設立した。"}],"collocations":["become a Non-juror","support the Non-jurors"],"synonyms":["dissenter","nonconformist","schismatic"],"antonyms":["juror","loyalist","allegiant"]}],"etymology":{"value":"From 'non-' (not) + 'juring' (swearing an oath), referring to those who refused to swear allegiance to William and Mary after the Glorious Revolution in 1688.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈdʒʊərɪŋ/","syllables":"non-jur-ing"},"inflection":{"notes":"Adjective: Non-juring (no comparative or superlative forms). Noun: Non-juror (plural: Non-jurors)."},"usage_notes":{"explanation":"'Non-juring' specifically refers to individuals, primarily clergy, who refused to swear an oath of allegiance to William and Mary after the Glorious Revolution because they believed they were still bound by their oath to the previous monarch, James II. This led to a schism within the Church of England. The term is primarily historical.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a non-jury.","correct":"✓ He was a Non-juror.","note":"'Non-jury' refers to a trial without a jury. The correct term for someone who refused the oath is 'Non-juror'."}],"priority":"★★☆"},"related_words":{"derivatives":["juring (adjective: taking an oath of allegiance)","abjure (verb: to renounce or reject solemnly)","adjure (verb: to urge or request earnestly)"],"historical_context":["Glorious Revolution","Oath of Allegiance","Jacobitism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Low frequency (historical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-juring' is a specialized historical term referring to people, especially clergy members in England, who refused to swear an oath of allegiance to the new monarchs, William and Mary, after the Glorious Revolution of 1688. This refusal stemmed from their belief that they were still bound by their previous oath to King James II. Understanding this term requires knowledge of 17th-century British history and the political and religious conflicts of that era."},"example_sentences":[{"sentence":"The **Non-juring** bishops maintained their loyalty to James II.","translation":"宣誓拒否派の司教たちはジェームズ2世への忠誠を維持した。","type":"adjective","meaning_category":"(historical) refusing to take an oath of allegiance"},{"sentence":"Many **Non-jurors** faced persecution for their beliefs.","translation":"多くの宣誓拒否者は、その信念のために迫害に直面した。","type":"noun","meaning_category":"(historical) a person who refused to take an oath of allegiance"}]}