{"word":"hemitropism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物の器官が、最初は特定の方向に成長し、その後成長方向を変える性質。特に、葉柄が最初は上向きに成長し、その後水平になるような現象を指す。","english_definition":"The tendency of a plant organ to grow in one direction for a time, and then to change its direction of growth, especially when a petiole grows upward at first and then becomes horizontal.","examples":[{"sentence":"Hemitropism is observed in the petioles of many plant species.","translation":"半傾性（へみとろぴずむ）は、多くの植物種の葉柄に見られる。"},{"sentence":"The hemitropism of leaves allows them to maximize light capture while avoiding excessive exposure.","translation":"葉の半傾性により、過度な露出を避けながら、光の捕獲を最大化することができる。"}],"collocations":["exhibit hemitropism (半傾性を示す)","leaf hemitropism (葉の半傾性)","petiole hemitropism (葉柄の半傾性)"],"synonyms":["nastic movement","tropism"],"antonyms":[]}],"etymology":{"value":"「hemi-」（半分）+「tropism」（屈性）に由来する。器官の成長方向が完全に一方向ではなく、途中で変化することを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmɪˈtrɒpɪzəm/","syllables":"he-mi-tro-pi-sm"},"inflection":{"noun_plural":"hemitropisms"},"usage_notes":{"explanation":"Hemitropismは、植物学において特定の成長パターンを指す専門用語であり、日常会話ではほとんど使用されない。主に研究論文や植物学の教科書などで見られる。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed a strong phototropism, growing horizontally.","correct":"✓ The plant showed hemitropism; the leaves initially grew upwards, then horizontally.","note":"Phototropismは光に向かう成長を指し、常に一定方向です。Hemitropismは成長方向が変化する場合に使います。"}],"priority":"★☆☆"},"related_words":{"derivatives":["hemitropic (形容詞: 半傾性の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Hemitropism」は、植物学の専門用語であり、特定の成長パターンを指します。この単語は、植物の器官が最初に特定の方向に成長し、その後成長方向を変える性質を表します。一般的には、葉柄が最初は上向きに成長し、その後水平になる現象を指します。この単語は、植物学の研究論文や教科書などで使用され、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The leaves of *Oxalis* species often exhibit hemitropism, adjusting their orientation throughout the day.","translation":"カタバミ属の葉はしばしば半傾性を示し、一日を通してその向きを調整する。","type":"noun","meaning_category":"植物の成長特性"},{"sentence":"Studies on hemitropism can provide insights into the mechanisms of plant movement and adaptation.","translation":"半傾性に関する研究は、植物の運動と適応のメカニズムに関する洞察を提供することができる。","type":"noun","meaning_category":"植物学研究"}]}