{"word":"evolutionism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"進化論、進化主義","english_definition":"The belief that organisms develop and diversify from earlier forms during the history of the earth. More broadly, the belief that things gradually develop from simpler to more complex forms.","examples":[{"sentence":"Evolutionism is a central concept in modern biology.","translation":"進化論は現代生物学における中心的な概念です。"},{"sentence":"Some people reject evolutionism for religious reasons.","translation":"宗教的な理由から進化論を拒否する人もいます。"},{"sentence":"Evolutionism explains the diversity of life on Earth.","translation":"進化論は地球上の生命の多様性を説明します。"}],"collocations":["Darwinian evolutionism (ダーウィン進化論)","Social evolutionism (社会進化論)","Reject evolutionism (進化論を拒否する)","Support evolutionism (進化論を支持する)"],"synonyms":["evolutionary theory","Darwinism"],"antonyms":["creationism","intelligent design"]},{"part_of_speech":"noun","definition":"(社会・文化人類学における)進化主義","english_definition":"A 19th-century social theory about the evolution of societies and cultures.","examples":[{"sentence":"Early anthropologists adopted evolutionism to explain cultural differences.","translation":"初期の人類学者は、文化的な違いを説明するために進化主義を採用しました。"},{"sentence":"Social evolutionism has been largely discredited.","translation":"社会進化主義は、ほとんど信用を失っています。"},{"sentence":"Evolutionism in anthropology often assumed Western culture was the most advanced.","translation":"人類学における進化主義は、西洋文化が最も進んでいると仮定することがよくありました。"}],"collocations":["Cultural evolutionism (文化進化主義)","Unilineal evolutionism (単線的進化主義)","Multilinear evolutionism (多線的進化主義)","Criticize evolutionism (進化主義を批判する)"],"synonyms":["social evolution","cultural evolution"],"antonyms":["relativism","diffusionism"]}],"etymology":{"value":"From 'evolution' + '-ism'. 'Evolution' comes from Latin 'evolvere' meaning 'to unroll'. '-ism' is a suffix denoting a doctrine, principle, or theory.","priority":"★★★"},"pronunciation":{"ipa":"/ˌiːvəˈluːʃənɪzəm/","syllables":"e-vo-lu-tion-ism"},"inflection":{"notes":"It is a noun and thus has no inflection for gender or number, although it can be pluralized in some contexts (e.g., different types of evolutionisms)."},"usage_notes":{"explanation":"'Evolutionism' can refer to the general theory of biological evolution or to specific social and cultural theories that are now largely discredited. It's important to understand the context to know which meaning is intended. In biology, it is often used interchangeably with 'evolutionary theory' or 'Darwinism', although the latter is more specific. In social sciences, it often refers to outdated 19th-century theories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Evolutionism is just a theory, not a fact.","correct":"Evolution is a theory supported by a vast amount of evidence.","note":"While evolution is a scientific theory, it's supported by a large body of evidence, making it more than just a guess. The term 'evolutionism' is less common in this context."},{"incorrect":"Evolutionism proves that humans are superior to other animals.","correct":"Evolution explains the relationships between different species, but does not imply superiority.","note":"Evolution does not imply that some species are 'better' or 'more advanced' than others."}],"priority":"★★☆"},"related_words":{"derivatives":["evolutionist (noun)","evolutionary (adjective)","evolve (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in academic and scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Evolutionism' is a term used in biology and social sciences to describe the idea that things change and develop over time. In biology, it refers to the theory of evolution, which explains how living things have changed over millions of years. In social sciences, it refers to older theories about how societies develop, which are not widely accepted today. The word is most often found in academic writing and discussions about science and society."},"example_sentences":[{"sentence":"The debate over evolutionism continues in some parts of the world.","translation":"進化論をめぐる議論は、世界のいくつかの地域で続いています。","type":"general","meaning_category":"general"},{"sentence":"Social evolutionism posited a linear progression of societies.","translation":"社会進化主義は、社会の直線的な進歩を仮定しました。","type":"social science","meaning_category":"social science"},{"sentence":"Modern biology is based on the principles of evolutionism.","translation":"現代生物学は進化論の原理に基づいています。","type":"biology","meaning_category":"biology"}]}