{"word":"lubritory","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A place where lubrication is performed.","english_definition":"A place where lubrication is performed.","examples":[{"sentence":"The old factory had a dedicated lubritory for maintaining its machinery.","translation":"その古い工場には、機械をメンテナンスするための専用の潤滑室があった。"}],"collocations":["factory lubritory","machine lubritory"],"synonyms":["lubrication room","maintenance area"],"antonyms":[]}],"etymology":{"value":"Derived from 'lubricate' + '-ory' (suffix denoting a place or thing associated with the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈluːbrɪtɔːri/","syllables":"lu-bri-to-ry"},"inflection":{"noun_plural":"lubritories"},"usage_notes":{"explanation":"The term 'lubritory' is quite rare and not commonly used in modern English. It refers specifically to a room or area designated for the purpose of lubricating machinery or equipment. It is more likely to be encountered in technical or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He worked in the lubritory, lubricating engines.","correct":"✓ He worked in the lubrication room, lubricating engines.","note":"Using 'lubrication room' is more common and easily understood."}],"priority":"★☆☆"},"related_words":{"derivatives":["lubricate","lubrication","lubricant"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lubritory' is a specialized and uncommon term referring to a dedicated space for lubrication activities. Due to its rarity, it is unlikely to be encountered in general conversation and is more suited for technical or historical contexts. Understanding the word requires familiarity with the concept of lubrication and the function of '-ory' as a suffix indicating a place or thing associated with an action."},"example_sentences":[{"sentence":"The factory's maintenance schedule included weekly visits to the lubritory.","translation":"工場のメンテナンススケジュールには、毎週の潤滑室への訪問が含まれていた。","type":"noun","meaning_category":"place for lubrication"},{"sentence":"Inside the lubritory, various types of oils and greases were neatly organized.","translation":"潤滑室の中には、様々な種類のオイルやグリースがきちんと整理されていた。","type":"noun","meaning_category":"place for lubrication"}]}