{"word":"nubility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"適齢期、結婚適齢期、結婚適性","english_definition":"the state of being suitable for marriage, especially in regard to age and physical development.","examples":[{"sentence":"The girl was approaching nubility.","translation":"その少女は結婚適齢期に近づいていた。"},{"sentence":"Nubility rites are common in many cultures.","translation":"結婚適性儀式は多くの文化で一般的である。"},{"sentence":"Physical development is a key factor in determining nubility.","translation":"身体の発達は、結婚適性を判断する上で重要な要素である。"}],"collocations":["age of nubility (結婚適齢)","rites of nubility (結婚適性儀式)","assess nubility (結婚適性を評価する)"],"synonyms":["marriageability","eligibility for marriage","womanhood","maturity"],"antonyms":["infancy","childhood"]}],"etymology":{"value":"Late Middle English: from Latin nubilis ‘marriageable’, from nubere ‘to marry’ (of a woman).","priority":"★★☆"},"pronunciation":{"ipa":"/njuːˈbɪlɪti/","syllables":"nu-bil-i-ty"},"inflection":{"noun_plural":"nubilities (rarely used)"},"usage_notes":{"explanation":"'Nubility' refers specifically to the state of being physically and socially ready for marriage, typically referring to a young woman. It is a formal and somewhat archaic term, often used in anthropological or historical contexts when discussing marriage customs and traditions. It is rarely used in modern, everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His nubility was questioned because of his lack of social skills.","correct":"✓ His eligibility for marriage was questioned because of his lack of social skills.","note":"'Nubility' is generally used for women, not men. 'Eligibility for marriage' is a more appropriate term for men."},{"incorrect":"✗ The nubility of the wine was excellent.","correct":"✓ The quality of the wine was excellent.","note":"'Nubility' only applies to people suitable for marriage, not to inanimate objects."}],"priority":"★★☆"},"related_words":{"derivatives":["nubile (adjective: of marriageable age or condition, especially (of a girl or young woman) sexually attractive.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly used in general English)","frequency_google_ngram":"Low frequency - Primarily found in academic or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nubility' is a formal and specialized term referring to the state of being suitable for marriage, particularly concerning a young woman's age and physical maturity. It is not commonly used in everyday language and is more often found in academic, historical, or anthropological contexts. Understanding its meaning requires a sophisticated vocabulary and familiarity with formal language.","priority":"★★☆"},"example_sentences":[{"sentence":"The anthropologist studied the nubility customs of the tribe.","translation":"人類学者はその部族の結婚適性に関する慣習を研究した。","type":"general","meaning_category":"marriageability"},{"sentence":"Her family considered her to have reached nubility at the age of sixteen.","translation":"彼女の家族は、彼女が16歳で結婚適齢期に達したと考えた。","type":"general","meaning_category":"marriageability"},{"sentence":"The concept of nubility varies greatly across different cultures.","translation":"結婚適性の概念は、文化によって大きく異なる。","type":"general","meaning_category":"marriageability"}]}