{"word":"Trumpetry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大げさな宣伝、見え透いた宣伝、空虚な主張、誇張された言葉","english_definition":"Extravagant or empty boasting; showy but deceptive talk or action.","examples":[{"sentence":"The politician's speech was full of trumpetry and empty promises.","translation":"その政治家の演説は、大げさな宣伝と空約束でいっぱいだった。"},{"sentence":"The company's marketing campaign relied on trumpetry to attract customers.","translation":"その会社のマーケティングキャンペーンは、顧客を引きつけるために見え透いた宣伝に頼っていた。"},{"sentence":"His trumpetry was easily seen through by those who knew the truth.","translation":"彼の誇張された言葉は、真実を知っている人には簡単に見破られた。"}],"collocations":["empty trumpetry","political trumpetry","marketing trumpetry"],"synonyms":["boasting","braggadocio","empty rhetoric","exaggeration","grandiloquence","pompousness"],"antonyms":["honesty","modesty","truthfulness","understatement"]}],"etymology":{"value":"The word 'trumpetry' is derived from 'trumpet,' referring to the loud, showy sound of a trumpet used to announce something important. The suffix '-ry' is added to denote a practice, art, or collection of something. Thus, 'trumpetry' implies the practice of making loud, showy, and often deceptive announcements or claims.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrʌmpɪtri/","syllables":"trump-et-ry"},"inflection":{"noun_plural":"trumpeteries"},"usage_notes":{"explanation":"'Trumpetry' is a somewhat uncommon word, often used in a critical or satirical context to describe speech or actions that are perceived as overly boastful, exaggerated, or deceptive. It suggests that the claims being made are not genuine or substantial but are intended to impress or mislead.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trumpetry of the music was overwhelming.","correct":"✓ The trumpeting of the music was overwhelming.","note":"'Trumpetry' refers to boastful or deceptive talk, not the sound of trumpets. Use 'trumpeting' to describe the sound of trumpets. "},{"incorrect":"✗ She used trumpetry to decorate her house.","correct":"✓ She used gaudy decorations to decorate her house.","note":"'Trumpetry' refers to deceptive language or actions, not physical decorations."}],"priority":"★☆☆"},"related_words":{"derivatives":["trumpet (noun, verb)"],"phrasal_verbs":[],"related_adjectives":["trumpeting"],"related_verbs":["trumpet"],"related_nouns":["trumpet"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'trumpetry' is a sophisticated term used to describe boastful, exaggerated, or deceptive language or actions. It's not a commonly used word, so it's more likely to be encountered in formal writing or speech where the author aims to convey a critical or satirical tone about someone's inflated claims or self-promotion. Understanding this word can enhance comprehension of nuanced arguments and critiques in literature, political commentary, or analytical essays.","priority":"★☆☆"},"example_sentences":[{"sentence":"The candidate's speech was dismissed as mere trumpetry by the opposition.","translation":"その候補者の演説は、野党によって単なる大げさな宣伝として退けられた。","type":"noun","meaning_category":"大げさな宣伝"},{"sentence":"The report exposed the trumpetry behind the company's claims of rapid growth.","translation":"その報告書は、会社の急速な成長という主張の背後にある見え透いた宣伝を暴露した。","type":"noun","meaning_category":"見え透いた宣伝"},{"sentence":"We grew tired of the constant trumpetry coming from the marketing department.","translation":"私たちは、マーケティング部門から絶え間なく発せられる誇張された言葉にうんざりした。","type":"noun","meaning_category":"誇張された言葉"}]}