{"word":"disableable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"無効にできる、機能を停止できる","english_definition":"capable of being disabled; able to be turned off or made inactive.","examples":[{"sentence":"The feature is disableable in the settings menu.","translation":"その機能は設定メニューで無効にできます。"},{"sentence":"This warning message is disableable, so you can turn it off if it becomes annoying.","translation":"この警告メッセージは無効にできるので、煩わしい場合はオフにできます。"}],"collocations":["disableable feature","disableable option","disableable setting"],"synonyms":["deactivatable","switchable off","turn-offable"],"antonyms":["enableable","non-disableable","un-disableable"]}],"etymology":{"value":"The word \"disableable\" is formed by adding the suffix \"-able\" to the verb \"disable.\" \"Disable\" comes from \"dis-\" (meaning \"not\" or \"opposite of\") and \"able\" (meaning \"capable\" or \"having the ability\"). Therefore, \"disable\" means to make something not able or not capable, and \"disableable\" means capable of being disabled.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈeɪbləbəl/","syllables":"dis-a-ble-a-ble"},"inflection":{"notes":"The word \"disableable\" is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"The adjective \"disableable\" describes something that can be turned off or made inactive. It's often used in the context of software, hardware, or features that can be optionally turned off by the user. The term implies that the functionality is present but can be deactivated if desired.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disableable is in the menu.","correct":"✓ The disableable option is in the menu.","note":"\"Disableable\" is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ This function is disable.","correct":"✓ This function is disableable. / ✓ This function is disabled.","note":"\"Disable\" is a verb. To describe the capability, use \"disableable.\" To describe the state of being turned off, use \"disabled.\""}],"priority":"★★☆"},"related_words":{"derivatives":["disable (verb)","disabled (adjective)","disability (noun)"],"antonyms":["enable","activate"],"synonyms":["deactivate","switch off","turn off"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"disableable\" is a relatively technical term used to describe something that can be turned off or made inactive. It is commonly used in the context of software, hardware, or features that can be optionally turned off by the user. Understanding the meaning of the root word \"disable\" and the suffix \"-able\" can help in comprehending the meaning of \"disableable.\""},"example_sentences":[{"sentence":"The automatic updates are disableable if you prefer to manage them manually.","translation":"自動更新は、手動で管理したい場合は無効にできます。","type":"adjective","meaning_category":"無効にできる"},{"sentence":"Is this feature disableable, or is it permanently active?","translation":"この機能は無効にできますか、それとも常にアクティブですか？","type":"adjective","meaning_category":"無効にできる"},{"sentence":"The pop-up notifications are disableable in the application's settings.","translation":"ポップアップ通知は、アプリケーションの設定で無効にできます。","type":"adjective","meaning_category":"無効にできる"}]}