{"word":"Treponemiasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トレポネーマ症（梅毒、風土病性梅毒、イチゴ腫、ピンタ病を含む感染症の総称）","english_definition":"A group of infectious diseases caused by spirochete bacteria of the genus Treponema, including syphilis, endemic syphilis (bejel), yaws, and pinta.","examples":[{"sentence":"Treponemiasis is a significant public health concern in many parts of the world.","translation":"トレポネーマ症は世界の多くの地域で重要な公衆衛生上の懸念事項です。"},{"sentence":"Early diagnosis and treatment are crucial for managing treponemiasis.","translation":"トレポネーマ症の管理には、早期の診断と治療が不可欠です。"}],"collocations":["congenital treponemiasis (先天性トレポネーマ症)","nonvenereal treponemiasis (非性病性トレポネーマ症)","endemic treponemiasis (風土病性トレポネーマ症)"],"synonyms":["syphilis","yaws","bejel","pinta"],"antonyms":[]}],"etymology":{"value":"The term \"treponemiasis\" is derived from the genus name of the causative bacteria, Treponema, combined with the suffix \"-iasis,\" which indicates a disease or condition. Treponema comes from the Greek words \"trepo\" (to turn) and \"nema\" (thread), referring to the spiral shape of the bacteria.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrɛpəniˈmaɪəsɪs/","syllables":"tre-po-ne-mi-a-sis"},"inflection":{"noun_plural":"treponemiases"},"usage_notes":{"explanation":"\"Treponemiasis\" is a collective term that encompasses several distinct diseases caused by different subspecies or strains of Treponema bacteria. These diseases share similarities in their transmission, clinical manifestations, and treatment approaches. It is important to specify which specific treponemal disease is being discussed (e.g., syphilis, yaws) for clarity and accurate communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Treponemiasis is caused by a virus.","correct":"✓ Treponemiasis is caused by bacteria.","note":"Treponemiasis is caused by bacteria of the genus Treponema, not by a virus."},{"incorrect":"✗ Treponemiasis only refers to syphilis.","correct":"✓ Treponemiasis refers to a group of diseases including syphilis, yaws, bejel, and pinta.","note":"Treponemiasis is a broader term that includes several diseases, not just syphilis."}],"priority":"★★☆"},"related_words":{"derivatives":["treponemal (adjective: relating to Treponema bacteria or treponemiasis)"],"related_diseases":["syphilis","yaws","bejel","pinta"],"causative_agent":"Treponema pallidum, Treponema pertenue, Treponema carateum"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency (専門的な医学用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Treponemiasis\" is a technical term used in medicine to refer to a group of infectious diseases caused by bacteria called Treponema. These diseases include syphilis, yaws, bejel, and pinta. The term is primarily used in medical and public health contexts when discussing these diseases collectively. It is not a term commonly used in everyday language. Understanding the term requires some knowledge of medical terminology and infectious diseases."},"example_sentences":[{"sentence":"The public health program aimed to control the spread of treponemiasis in the rural communities.","translation":"その公衆衛生プログラムは、農村地域におけるトレポネーマ症の蔓延を抑制することを目的としていた。","type":"general","meaning_category":"general"},{"sentence":"Diagnosis of treponemiasis involves serological tests to detect antibodies against Treponema bacteria.","translation":"トレポネーマ症の診断には、トレポネーマ菌に対する抗体を検出するための血清学的検査が含まれる。","type":"diagnostic","meaning_category":"diagnosis"},{"sentence":"Benzathine penicillin is commonly used to treat various forms of treponemiasis.","translation":"ベンザチンペニシリンは、さまざまな形態のトレポネーマ症の治療に一般的に使用される。","type":"treatment","meaning_category":"treatment"}]}