{"word":"Jezebel","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(聖書) イゼベル: 旧約聖書に登場するフェニキア出身の王妃。イスラエルのアハブ王の妻であり、バアル崇拝をイスラエルに導入しようとしたため、預言者エリヤと対立した。","english_definition":"(Biblical) Jezebel: A Phoenician princess who, as the wife of King Ahab of Israel, promoted the worship of Baal and persecuted the prophets of Yahweh, particularly Elijah.","examples":[{"sentence":"The story of Jezebel is found in the Books of Kings in the Old Testament.","translation":"イゼベルの物語は旧約聖書列王記に記されている。"}],"collocations":["Queen Jezebel","the story of Jezebel"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(軽蔑的) あばずれ女、悪女、妖婦: 道徳的に堕落した、または不道徳な女性を指す言葉。特に、扇情的で人を誘惑するような女性を指す。","english_definition":"(Derogatory) A shameless, immoral, or wicked woman; especially, a seductress.","examples":[{"sentence":"Some critics accused the actress of playing a Jezebel role.","translation":"一部の批評家は、その女優があばずれ女の役を演じていると非難した。"},{"sentence":"He described her as a Jezebel because of her manipulative behavior.","translation":"彼は彼女の操作的な行動から、彼女を悪女だと評した。"}],"collocations":["call someone a Jezebel","Jezebel-like behavior"],"synonyms":["harlot","siren","temptress","vamp","loose woman"],"antonyms":["virtuous woman"]}],"etymology":{"value":"ヘブライ語の 'ʾÎzeḇel (אִיזֶבֶל‎) に由来し、その意味は議論があるが、「バアルは高貴である」または「どこに王子がいるのか？」と解釈されることがある。聖書における彼女の悪評が、後の英語における軽蔑的な意味合いに繋がった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛzəbəl/","syllables":"Jez-e-bel"},"inflection":{"notes":"複数形は Jezebels"},"usage_notes":{"explanation":"「**Jezebel**」は、聖書の登場人物に由来する言葉であり、強い否定的な意味合いを持ちます。文字通りには旧約聖書に登場する王妃の名前ですが、一般的には道徳的に堕落した女性、特に扇情的で人を誘惑するような女性を指す軽蔑的な言葉として使われます。この言葉を使う際には、その強い否定的な意味合いを理解し、慎重に判断する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a Jezebel for helping the poor.","correct":"✓ N/A (The term 'Jezebel' implies negative traits, so this sentence is contradictory.)","note":"「Jezebel」は本来否定的な意味を持つため、貧しい人々を助けるような肯定的な行動と結びつけるのは不適切です。"},{"incorrect":"✗ He admired her for being a Jezebel.","correct":"✓ N/A (The term 'Jezebel' is rarely used in a positive way.)","note":"「Jezebel」は通常、賞賛の対象とはなりません。この言葉を使う場合は、非難や軽蔑の意を込めるのが一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Jezebelic (形容詞: イゼベルのような、悪女のような)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (文学作品や歴史的文脈で稀に使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 日常会話ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Jezebel**」は、聖書に登場する悪名高い王妃の名前に由来する言葉で、現代英語では道徳的に堕落した、特に扇情的で人を誘惑するような女性を指す軽蔑的な表現として使われます。この言葉は非常に強い否定的な意味合いを持つため、使用する際には注意が必要です。文学作品や歴史的な文脈で使われることがありますが、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The preacher condemned the modern Jezebels who flaunted their sexuality.","translation":"牧師は、自身のセクシュアリティを誇示する現代の悪女たちを非難した。","type":"noun","meaning_category":"悪女"},{"sentence":"Her character was portrayed as a manipulative Jezebel in the play.","translation":"彼女の役柄は、その劇の中で人を操る悪女として描かれていた。","type":"noun","meaning_category":"悪女"},{"sentence":"Some feminist scholars have reinterpreted Jezebel as a strong woman resisting patriarchal oppression.","translation":"一部のフェミニスト研究者は、イゼベルを家父長制の抑圧に抵抗する強い女性として再解釈している。","type":"noun","meaning_category":"聖書の人物 (再解釈)"}]}