{"word":"derau","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Sarawak Malay) a communal work party, especially for agricultural tasks.","english_definition":"(Sarawak Malay) A traditional practice in Sarawak, Malaysia, where community members come together to help each other with tasks, especially in agriculture. It is a form of mutual assistance and cooperation.","examples":[{"sentence":"The villagers organized a derau to harvest the rice.","translation":"村人たちは米を収穫するためにデラウを組織した。"},{"sentence":"Derau is an important part of the community's tradition.","translation":"デラウはコミュニティの伝統の重要な一部である。"}],"collocations":["mengadakan derau (to organize a derau)","ikut serta dalam derau (to participate in a derau)"],"synonyms":["gotong-royong (Indonesian/Malay: mutual assistance)"],"antonyms":[]}],"etymology":{"value":"From Sarawak Malay, likely influenced by similar concepts of communal work in other Austronesian languages.","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈraʊ/","syllables":"de-rau"},"inflection":{"noun_plural":"deraus"},"usage_notes":{"explanation":"'Derau' is a term specific to Sarawak, Malaysia, and refers to a traditional form of communal labor. It is similar to the Indonesian/Malay term 'gotong-royong', but is more localized in its usage. It reflects the importance of community cooperation in agricultural societies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We had a derau for cleaning the house.","correct":"✓ We had a derau for harvesting the rice.","note":"Derau is typically used for agricultural tasks, not general cleaning."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["gotong-royong (mutual assistance)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (regional term)","frequency_google_ngram":"Low (regional term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Derau' is a specialized term from Sarawak, Malaysia, referring to a communal labor practice, primarily in agriculture. Understanding this word requires knowledge of Sarawakian culture and traditions. It is not commonly used outside of this specific context."},"example_sentences":[{"sentence":"The longhouse community held a 'derau' to repair the damaged roof after the storm.","translation":"長屋のコミュニティは、嵐の後に損傷した屋根を修理するために「デラウ」を開催した。","type":"noun","meaning_category":"communal work party"},{"sentence":"The spirit of 'derau' fosters strong bonds among the villagers.","translation":"「デラウ」の精神は、村人たちの間に強い絆を育む。","type":"noun","meaning_category":"communal work party"}]}