{"word":"blackfishing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的な意味で)白人または非黒人が、黒人の外見を模倣したり、黒人文化を盗用したりする行為。多くの場合、日焼けスプレー、特定のヘアスタイル、メイクアップ、ファッションスタイルなどを用いて行われる。","english_definition":"(derogatory) The practice of white or non-Black people attempting to present themselves as Black, often through the use of tanning, certain hairstyles, makeup, or fashion.","examples":[{"sentence":"Critics accused the influencer of blackfishing after she posted photos with a noticeably darker skin tone.","translation":"そのインフルエンサーが明らかに肌の色が濃くなった写真を投稿した後、批評家たちは彼女をブラックフィッシングだと非難した。"},{"sentence":"The debate around blackfishing highlights the complexities of cultural appropriation and racial identity.","translation":"ブラックフィッシングをめぐる議論は、文化の盗用と人種的アイデンティティの複雑さを浮き彫りにしている。"}],"collocations":["accused of blackfishing","cultural appropriation","racial identity","digital blackface"],"synonyms":["cultural appropriation","digital blackface"],"antonyms":[]}],"etymology":{"value":"「black」(黒人)と「catfishing」(オンライン上で偽のアイデンティティを作る行為)を組み合わせた造語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblækˌfɪʃɪŋ/","syllables":"black-fish-ing"},"inflection":{"notes":"名詞"},"usage_notes":{"explanation":"「**blackfishing**」は、多くの場合、ソーシャルメディア上で、白人または非黒人が黒人のように見せかける行為を指す軽蔑的な用語です。これは、文化の盗用の一形態とみなされ、黒人の文化やアイデンティティを商品化し、不当に利用していると批判されます。日焼けスプレー、特定のヘアスタイル（アフロ、ブレードなど）、メイクアップ、ファッションスタイルを使用することが特徴です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is just admiring Black culture, it's not blackfishing.","correct":"✓ Even if she admires Black culture, intentionally altering her appearance to appear Black can be considered blackfishing.","note":"ブラックフィッシングは、文化への敬意とは異なり、意図的に外見を変えて黒人に見せかける行為を指します。"},{"incorrect":"✗ Only celebrities can be accused of blackfishing.","correct":"✓ Anyone, including non-celebrities, can be accused of blackfishing if they engage in the practice.","note":"有名人だけでなく、一般の人々もブラックフィッシングと非難される可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["catfishing","cultural appropriation","digital blackface","racebending"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低い (Relatively low) - 比較的新しい用語であり、特定の文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**blackfishing**」は、白人または非黒人が、黒人の外見を模倣しようとする行為を指す言葉で、多くの場合、批判的な意味合いを持ちます。これは、日焼けをしたり、黒人の特徴的なヘアスタイルやメイクをしたりすることを含みます。この言葉は、文化の盗用や人種的アイデンティティの問題と深く関わっており、ソーシャルメディアなどで議論されることが多いです。文化的な背景や人種に関する理解が必要となるため、やや高度な語彙と言えます。"},"example_sentences":[{"sentence":"The singer faced backlash after being accused of **blackfishing** in her latest music video.","translation":"その歌手は、最新のミュージックビデオでブラックフィッシングだと非難され、強い反発を受けた。","type":"noun","meaning_category":"文化盗用"},{"sentence":"Some argue that **blackfishing** perpetuates harmful stereotypes and diminishes the experiences of Black individuals.","translation":"ブラックフィッシングは有害な固定観念を永続させ、黒人の経験を矮小化すると主張する人もいる。","type":"noun","meaning_category":"文化盗用"}]}