{"word":"sweating-sickness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な病気)発汗病","english_definition":"(historical) An acute and highly fatal infectious disease of uncertain cause that occurred in epidemics in England and continental Europe in the late 15th and early 16th centuries, characterized by fever, headache, and profuse sweating.","examples":[{"sentence":"The sweating-sickness caused widespread panic in Tudor England.","translation":"発汗病はテューダー朝時代のイングランドで広範囲にわたるパニックを引き起こした。"}],"collocations":["contract sweating-sickness (発汗病にかかる)","epidemic of sweating-sickness (発汗病の流行)"],"synonyms":["English sweat"],"antonyms":[]}],"etymology":{"value":"'Sweating' (発汗) + 'sickness' (病気). 病気の主な症状である発汗から名付けられた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈswɛtɪŋ ˈsɪknəs/","syllables":"sweat-ing-sick-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Sweating-sickness' is a historical term referring to a specific disease that was prominent in Europe, particularly England, during the late 15th and early 16th centuries. It is not a general term for any illness causing sweating.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has sweating-sickness because he's exercising.","correct":"✓ He is sweating because he's exercising.","note":"'Sweating-sickness' refers to a specific historical disease, not simply the act of sweating due to exercise."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sweating-sickness' is a term referring to a specific historical disease that occurred in Europe during the late 15th and early 16th centuries. It is characterized by sudden onset of fever, headache, and profuse sweating, often leading to death within hours. This term is rarely used outside of historical or medical contexts. It is important to note that this is not simply a general term for any illness causing sweating, but a specific, now likely extinct, disease. Due to its historical and specialized nature, this term is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The symptoms of sweating-sickness included fever, headache, and profuse sweating.","translation":"発汗病の症状には、発熱、頭痛、および大量の発汗が含まれていた。","type":"noun","meaning_category":"病気"},{"sentence":"Historians believe that sweating-sickness may have been caused by a hantavirus.","translation":"歴史家たちは、発汗病はハンタウイルスによって引き起こされた可能性があると考えている。","type":"noun","meaning_category":"病気"}]}