{"word":"mausolean","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"霊廟のような、荘厳な墓所の","english_definition":"resembling or having the characteristics of a mausoleum; monumental, stately, or gloomy.","examples":[{"sentence":"The family built a mausolean structure to honor their ancestors.","translation":"その家族は先祖を祀るために霊廟のような建造物を建てた。"},{"sentence":"The abandoned mansion had a mausolean atmosphere.","translation":"その廃墟となった大邸宅は、霊廟のような雰囲気を持っていた。"},{"sentence":"The library was a mausolean space, filled with the scent of old books and silence.","translation":"その図書館は、古い本の香りと静寂に満ちた、霊廟のような空間だった。"}],"collocations":["mausolean grandeur","mausolean silence","mausolean atmosphere","mausolean monument","mausolean structure"],"synonyms":["sepulchral","funereal","monumental","stately","gloomy","somber"],"antonyms":["cheerful","lively","bright"]},{"part_of_speech":"noun","definition":"壮大な霊廟、墓所","english_definition":"a stately and magnificent tomb.","examples":[{"sentence":"The emperor was buried in a lavish mausolean.","translation":"皇帝は豪華な霊廟に埋葬された。"},{"sentence":"The mausolean was built to house the remains of the royal family.","translation":"その霊廟は王室の遺体を安置するために建てられた。"},{"sentence":"Visitors came from all over the world to see the mausolean.","translation":"観光客が世界中からその霊廟を見にやってきた。"}],"collocations":["build a mausolean","visit a mausolean","royal mausolean","family mausolean"],"synonyms":["tomb","sepulcher","crypt","vault","memorial"],"antonyms":[]}],"etymology":{"value":"The word \"mausolean\" comes from the Mausoleum at Halicarnassus, a grand tomb built for Mausolus, a satrap in the Persian Empire, and his sister-wife Artemisia II of Caria, in the 4th century BC. It was considered one of the Seven Wonders of the Ancient World.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɔːzəˈliːən/","syllables":"mau-so-le-an"},"inflection":{"adjective_forms":{"comparative":null,"superlative":null},"noun_plural":"mausoleans"},"usage_notes":{"explanation":"The term \"mausolean\" is primarily used to describe structures or atmospheres that are reminiscent of a grand tomb, often implying a sense of solemnity, grandeur, or gloom. While it can refer to an actual mausoleum, it is frequently used figuratively to describe places or situations that evoke a similar feeling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was very mausoleum.","correct":"✓ The room had a mausolean atmosphere.","note":"\"Mausolean\" is an adjective, so it should be used to describe a noun, not as a substitute for a noun. It's better to say \"mausolean atmosphere\" or \"mausolean structure\"."},{"incorrect":"✗ He lived in a mausoleum.","correct":"✓ He lived in a house with a mausolean atmosphere.","note":"Unless he actually lived *inside* a tomb, it's more accurate to say the house had a mausolean atmosphere. The term implies a certain feeling or quality, not necessarily the literal structure."}],"priority":"★★☆"},"related_words":{"derivatives":["mausoleum (noun)"],"phrases":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"mausolean\" is relatively rare and sophisticated. It describes something that resembles a mausoleum, which is a large and impressive tomb. The word often implies a sense of grandeur, solemnity, and sometimes gloom. It's more commonly used in literature or formal writing to create a specific atmosphere or evoke a particular feeling. Understanding the historical context (the Mausoleum at Halicarnassus) can help grasp the full meaning of the word."},"example_sentences":[{"sentence":"The old library, with its towering shelves and hushed atmosphere, had a distinctly mausolean feel.","translation":"その古い図書館は、そびえ立つ棚と静まり返った雰囲気で、明らかに霊廟のような趣があった。","type":"adjective","meaning_category":"resembling a mausoleum"},{"sentence":"The family's mausolean stood on a hill overlooking the valley.","translation":"その家族の霊廟は、谷を見下ろす丘の上に立っていた。","type":"noun","meaning_category":"grand tomb"},{"sentence":"The abandoned castle had a mausolean silence that unnerved the visitors.","translation":"その廃墟となった城は、訪問者を不安にさせる霊廟のような静けさを持っていた。","type":"adjective","meaning_category":"gloomy"}]}