{"word":"Hartberry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional or uncommon type of berry, often used in fantasy literature or games.","english_definition":"A type of berry, usually fictional, with no established real-world meaning. Its characteristics are determined by the context in which it is used.","examples":[{"sentence":"The potion required three sprigs of nightshade and a handful of hartberries.","translation":"その薬には、ヨモギの小枝3本と一握りのハートベリーが必要でした。"},{"sentence":"Hartberries are known for their vibrant color and sweet taste in the game.","translation":"ハートベリーは、その鮮やかな色と甘い味でゲーム内で知られています。"}],"collocations":["potion ingredient","rare berry","magical ingredient","sweet berry"],"synonyms":["fictional berry","fantasy fruit"],"antonyms":[]}],"etymology":{"value":"Likely a compound word combining 'hart' (an archaic word for 'male deer') and 'berry'. The connection to deer is unclear and probably stylistic.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɑːrtˌbɛri/","syllables":"Hart-ber-ry"},"inflection":{"noun_plural":"hartberries"},"usage_notes":{"explanation":"'Hartberry' is not a standard English word. It is generally used in fictional contexts, such as fantasy novels or video games, to refer to a specific type of berry with unique properties or characteristics defined by the author or game developer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought hartberries at the grocery store.","correct":"✓ I bought blueberries at the grocery store.","note":"Hartberries are not real and cannot be purchased in stores."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency, primarily in fiction.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hartberry' is not a commonly known word and is primarily encountered in fictional contexts. Understanding its meaning relies on understanding the context in which it is used, as its properties are not fixed or universally defined. It is often used to add a sense of uniqueness or fantasy to a setting.","priority":"★☆☆"},"example_sentences":[{"sentence":"The wizard needed hartberries to complete his spell.","translation":"魔法使いは呪文を完成させるためにハートベリーを必要とした。","type":"noun","meaning_category":"fictional ingredient"},{"sentence":"The hartberry bush grew only in the deepest parts of the forest.","translation":"ハートベリーの茂みは、森の最も奥深い場所にのみ生えていた。","type":"noun","meaning_category":"fictional plant"}]}