{"word":"ungainly-legged","meanings":[{"part_of_speech":"adjective","definition":"足が不格好な、足がぎこちない","english_definition":"Having legs that are awkward or clumsy in appearance or movement.","examples":[{"sentence":"The foal was ungainly-legged as it tried to stand for the first time.","translation":"その子馬は初めて立とうとしたとき、足が不格好だった。"},{"sentence":"An ungainly-legged heron waded through the shallow water.","translation":"足がぎこちないサギが浅瀬を歩いていた。"}],"collocations":["ungainly-legged foal","ungainly-legged bird","ungainly-legged creature"],"synonyms":["awkward-legged","clumsy-legged","gangly-legged"],"antonyms":["graceful-legged","lithe-legged","agile-legged"]}],"etymology":{"value":"Derived from 'ungainly' (awkward, clumsy) and 'legged' (having legs).","note":"The word combines the description of awkwardness with the physical attribute of having legs."},"pronunciation":{"ipa":"/ʌnˈɡeɪnli ˈlɛɡɪd/","syllables":"un-gain-ly-leg-ged"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"This adjective is primarily descriptive, used to convey the visual impression or movement of a creature or object with awkward or clumsy legs. It often implies a lack of grace or coordination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The ungainly-legged table wobbled.","correct":"The table with ungainly legs wobbled.","note":"While 'ungainly-legged' can describe animals, it's less common for inanimate objects. Consider rephrasing."}],"priority":"★☆☆"},"related_words":{"derivatives":["ungainly (adjective)","legged (adjective)"],"related_phrases":["awkward gait","clumsy movement"]},"level_frequency":{"level":"C2","note":"Relatively uncommon; likely to be encountered in descriptive literature."},"readability_explanation":{"level":"C1","text":"'Ungainly-legged' is a descriptive adjective used to describe something with awkward or clumsy legs. It combines 'ungainly,' meaning awkward or clumsy, with 'legged,' indicating the presence of legs. It's most often used to describe animals or creatures whose legs appear disproportionate or whose movements are awkward due to their legs. The word is not commonly used in everyday conversation and is more likely to be found in descriptive writing."},"example_sentences":[{"sentence":"The newborn giraffe was ungainly-legged and struggled to find its balance.","translation":"生まれたばかりのキリンは足が不格好で、バランスを取るのに苦労していた。","type":"descriptive","meaning_category":"appearance"},{"sentence":"Despite being ungainly-legged, the young bird managed to hop to safety.","translation":"足がぎこちないにもかかわらず、その若い鳥はなんとか安全な場所に飛び跳ねて行った。","type":"descriptive","meaning_category":"movement"}]}