{"word":"mizzenmast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(帆船の)ミズンマスト、最後尾のマスト","english_definition":"the third or rear mast from the bow in a three-masted vessel; the aftermost mast of a vessel having more than two masts.","examples":[{"sentence":"The mizzenmast of the tall ship towered above the deck.","translation":"その大型船のミズンマストは甲板の上にそびえ立っていた。"},{"sentence":"He climbed the mizzenmast to get a better view of the horizon.","translation":"彼は水平線をより良く見るためにミズンマストに登った。"}],"collocations":["foremast","mainmast","mizzenmast staysail","mizzenmast top"],"synonyms":["aftermast","rear mast"],"antonyms":[],"notes":"On a four-masted vessel, the mizzenmast is the third mast from the bow. On a vessel with five or more masts, the aftermost mast is usually called the jiggermast or spankermast."}],"etymology":{"value":"From Middle English 'mysen', possibly from Old French 'mizen' (sail), of uncertain origin. The 'mast' part is self-explanatory.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪzənˌmæst/","syllables":"miz-zen-mast"},"inflection":{"noun_plural":"mizzenmasts"},"usage_notes":{"explanation":"The mizzenmast is a crucial part of a sailing ship's rigging, contributing to both propulsion and stability. Its specific function and sail configuration can vary depending on the type and size of the vessel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mizenmast was broken.","correct":"✓ The mizzenmast was broken.","note":"The correct spelling is 'mizzenmast', not 'mizenmast'."}],"priority":"★☆☆"},"related_words":{"derivatives":["mizzen (noun: a sail set on the mizzenmast)","jiggermast (noun: the aftermost mast on a vessel with five or more masts)","spankermast (noun: another term for the aftermost mast on a vessel with five or more masts)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in nautical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mizzenmast' is a specialized nautical term referring to the aftermost mast on a sailing vessel with more than two masts. Understanding this term requires familiarity with sailing terminology and ship structures. It is not commonly used outside of contexts related to sailing or historical ships."},"example_sentences":[{"sentence":"The captain ordered the crew to adjust the sails on the mizzenmast.","translation":"船長は乗組員にミズンマストの帆を調整するように命じた。","type":"noun","meaning_category":"nautical"},{"sentence":"The artist's painting depicted a tall ship with a prominent mizzenmast.","translation":"その画家の絵は、目立つミズンマストを持つ大型船を描いていた。","type":"noun","meaning_category":"nautical"}]}