{"word":"porcelaneous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"磁器のような、磁器質の","english_definition":"Resembling porcelain; having a smooth, translucent appearance like porcelain.","examples":[{"sentence":"The shell had a porcelaneous sheen.","translation":"その貝殻は磁器のような光沢があった。"},{"sentence":"The fossil's surface was porcelaneous and difficult to examine.","translation":"その化石の表面は磁器質で、調査が困難だった。"}],"collocations":["porcelaneous shell","porcelaneous surface","porcelaneous texture"],"synonyms":["china-like","vitreous","glazed","translucent"],"antonyms":["dull","opaque","rough"]}],"etymology":{"value":"Derived from 'porcelain' + '-eous'. 'Porcelain' comes from the Italian 'porcellana', originally referring to cowrie shells (because of their resemblance to a pig's vulva), and later applied to the fine ceramic material. The suffix '-eous' indicates resemblance or composition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrsəˈleɪniəs/","syllables":"por-ce-la-ne-ous"},"inflection":{"notes":"Adjective, no comparative or superlative forms typically used."},"usage_notes":{"explanation":"'Porcelaneous' is used to describe something that has the appearance or texture of porcelain. It's often used in geology, zoology (especially describing shells), and occasionally in art or design when referring to materials that have a similar smooth, translucent quality. The term emphasizes the visual or tactile similarity to porcelain rather than the actual composition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The porcelaneous was very expensive.","correct":"✓ The porcelaneous object was very expensive.","note":"'Porcelaneous' is an adjective, so it needs to modify a noun. You can't say 'the porcelaneous' by itself to refer to an object. You need to say 'the porcelaneous object', 'the porcelaneous surface', etc."}],"priority":"★☆☆"},"related_words":{"derivatives":["porcelain (noun)","porcellanite (noun)"],"related_terms":["vitreous","ceramic","china","translucent"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Porcelaneous' is a relatively uncommon word used to describe something that resembles porcelain. It is most often found in technical or descriptive contexts, particularly in fields like geology or zoology when describing the appearance of rocks, minerals, or shells. Understanding this word requires a good vocabulary and an understanding of the properties of porcelain."},"example_sentences":[{"sentence":"The inside of the clam shell had a beautiful, porcelaneous finish.","translation":"その二枚貝の内側は美しく、磁器のような仕上がりだった。","type":"adjective","meaning_category":"appearance"},{"sentence":"Geologists noted the porcelaneous texture of the newly discovered mineral.","translation":"地質学者たちは、新しく発見された鉱物の磁器質の質感に注目した。","type":"adjective","meaning_category":"texture"},{"sentence":"The artist aimed for a porcelaneous effect in her sculpture by using a special glazing technique.","translation":"そのアーティストは、特殊な釉薬技術を用いて、彫刻に磁器のような効果を出すことを目指した。","type":"adjective","meaning_category":"effect"}]}