{"word":"stickleback","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イトヨ（棘魚）","english_definition":"A small freshwater fish of the family Gasterosteidae, characterized by the presence of strong spines on its back.","examples":[{"sentence":"The three-spined stickleback is a common species in many European rivers.","translation":"イトヨはヨーロッパの多くの川でよく見られる種です。"},{"sentence":"Sticklebacks are known for their elaborate courtship rituals.","translation":"イトヨは手の込んだ求愛行動で知られています。"}],"collocations":["three-spined stickleback","ten-spined stickleback","brook stickleback"],"synonyms":["tiddler (informal)"],"antonyms":[]}],"etymology":{"value":"Derived from 'stickle' (referring to the spines) and 'back' (referring to the location of the spines).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɪkəlˌbæk/","syllables":"stick-le-back"},"inflection":{"noun_plural":"sticklebacks"},"usage_notes":{"explanation":"Sticklebacks are small fish known for the spines on their backs. They are often studied for their behavior, especially their mating rituals. The three-spined stickleback is one of the most well-known species.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["sticklebacked (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stickleback' refers to a family of small freshwater fish distinguished by the presence of spines along their backs. These fish are often subjects of scientific study, particularly in the fields of behavioral ecology and evolutionary biology, due to their complex mating behaviors and adaptations to different environments. The three-spined stickleback is a particularly well-studied species. The term is relatively specialized and not commonly used outside of scientific or natural history contexts."},"example_sentences":[{"sentence":"The male stickleback builds a nest to attract a mate.","translation":"オスのイトヨは、メスを引きつけるために巣を作ります。","type":"general","meaning_category":"behavior"},{"sentence":"Sticklebacks are an important part of the freshwater ecosystem.","translation":"イトヨは淡水生態系の重要な一部です。","type":"general","meaning_category":"ecology"}]}