{"word":"trichromate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"重クロム酸塩","english_definition":"A salt containing the dichromate anion (Cr₂O₇²⁻).","examples":[{"sentence":"Potassium trichromate is a strong oxidizing agent.","translation":"重クロム酸カリウムは強力な酸化剤です。"}],"collocations":[],"synonyms":["dichromate"],"antonyms":[]},{"part_of_speech":"adjective","definition":"三色性の","english_definition":"Having or relating to the condition of trichromacy.","examples":[{"sentence":"Humans are trichromate, possessing three types of cone cells in their eyes.","translation":"人間は三色性であり、眼に3種類の錐体細胞を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'tri-' (three) + 'chroma' (color) + '-ate' (suffix indicating a salt).","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈkroʊmeɪt/","syllables":"tri-chro-mate"},"inflection":{"noun_plural":"trichromates"},"usage_notes":{"explanation":"The term 'trichromate' can refer to a chemical compound (a dichromate salt) or to a type of color vision. When referring to color vision, it describes organisms, including humans, that have three independent channels for conveying color information, derived from three different types of cone cells in the eye.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["trichromacy (noun): The state of having three independent color channels.","dichromate (noun): A similar chemical compound.","chromate (noun): A salt containing the chromate anion (CrO₄²⁻)."],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Trichromate' is a technical term used in chemistry and biology. In chemistry, it refers to a specific type of salt. In biology, it describes the type of color vision possessed by humans and some other animals, which relies on three different types of color-sensitive cells in the eye. Understanding the context is crucial for interpreting the meaning correctly."},"example_sentences":[{"sentence":"The experiment involved the use of sodium trichromate.","translation":"その実験では、重クロム酸ナトリウムが使用されました。","type":"noun","meaning_category":"重クロム酸塩"},{"sentence":"Most primates are trichromate, allowing them to see a wide range of colors.","translation":"ほとんどの霊長類は三色性であり、広範囲の色を見ることができます。","type":"adjective","meaning_category":"三色性の"}]}