{"word":"roadability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being roadable; the ability of a vehicle to be driven safely and efficiently on roads.","english_definition":"The quality or state of being roadable; the ability of a vehicle to be driven safely and efficiently on roads.","examples":[{"sentence":"The engineers focused on improving the roadability of the new truck.","translation":"エンジニアたちは新型トラックの路上走行性能の向上に焦点を当てた。"},{"sentence":"Good suspension is essential for the roadability of a car.","translation":"良好なサスペンションは車の路上走行性能にとって不可欠です。"}],"collocations":["improve roadability","test roadability","ensure roadability","enhance roadability"],"synonyms":["driveability","handling","roadworthiness"],"antonyms":[]}],"etymology":{"value":"Derived from 'roadable' (capable of being driven on roads) + '-ity' (suffix indicating a state or quality).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌroʊdəˈbɪləti/","syllables":"road-a-bil-i-ty"},"inflection":{"noun_plural":"roadabilities"},"usage_notes":{"explanation":"\"Roadability\" refers specifically to how well a vehicle performs on roads. It encompasses factors like handling, stability, and overall driving experience. It's often used in the context of vehicle design and testing.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"The roadability of the plan is questionable.","correct":"The feasibility of the plan is questionable.","note":"\"Roadability\" is specific to vehicles and their performance on roads. For plans or ideas, use terms like \"feasibility\" or \"viability\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["roadable"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Roadability\" is a technical term primarily used in the automotive industry. It describes how well a vehicle handles and performs when driven on roads. Understanding this term is helpful when discussing vehicle engineering or reviewing car specifications."},"example_sentences":[{"sentence":"The manufacturer conducted extensive tests to ensure the roadability of the new SUV.","translation":"製造業者は新型SUVの路上走行性能を確保するために広範囲なテストを実施した。","type":"noun","meaning_category":"Quality of being roadable"},{"sentence":"Factors affecting roadability include tire pressure, suspension, and steering system.","translation":"路上走行性能に影響を与える要因には、タイヤの空気圧、サスペンション、ステアリングシステムなどがある。","type":"noun","meaning_category":"Quality of being roadable"}]}