{"word":"substrate-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Oriented or designed to interact with or be influenced by a substrate (in various scientific contexts).","english_definition":"Describing something that is designed or adapted to interact with or be influenced by a substrate. The specific meaning depends on the context (e.g., biology, materials science).","examples":[{"sentence":"The enzyme is substrate-oriented, meaning it binds specifically to a particular molecule.","translation":"その酵素は基質指向性であり、特定の分子に特異的に結合することを意味します。","context":"Biochemistry/Enzymology"},{"sentence":"The growth of the thin film was substrate-oriented, with the crystal structure aligning to that of the underlying material.","translation":"薄膜の成長は基板指向性であり、結晶構造は下地材料の結晶構造に整列していました。","context":"Materials Science"}],"collocations":["substrate-oriented enzyme","substrate-oriented growth","substrate-oriented design"],"synonyms":["substrate-specific","substrate-dependent","substrate-selective"],"antonyms":["substrate-independent"]}],"etymology":{"value":"Combination of 'substrate' (a substance or layer on which something acts or occurs) and 'oriented' (directed or focused towards).","priority":"low"},"pronunciation":{"ipa":"/ˈsʌbstreɪt ˌɔːriɛn.tɪd/","syllables":"sub-strate-o-ri-en-ted"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"The term 'substrate-oriented' is used in various scientific and technical fields. Its precise meaning depends on the context. In biology (especially enzymology), it refers to enzymes or other biological molecules that are designed to interact specifically with a particular substrate. In materials science, it often describes processes where the properties of a substrate influence the growth or behavior of a material deposited on it.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The reaction was substrate-orientated.","correct":"The reaction was substrate-oriented.","note":"The correct spelling is 'oriented', not 'orientated'."}],"priority":"low"},"related_words":{"derivatives":["substrate","orientation"],"phrases":["substrate specificity","epitaxial growth"]},"level_frequency":{"CEFR":"C1-C2 (technical vocabulary)","frequency_google_ngram":"Low (specialized term)","priority":"low"},"readability_explanation":{"level":"C1","text":"'Substrate-oriented' is a technical term used in science and engineering. It describes something that is designed or influenced by the properties of a 'substrate,' which is a base material or surface. The meaning varies depending on the field. For example, an enzyme might be substrate-oriented if it is designed to bind to a specific molecule (the substrate). In materials science, a thin film's growth might be substrate-oriented if its structure is influenced by the underlying material."},"example_sentences":[{"sentence":"The researchers developed a substrate-oriented catalyst for the reaction.","translation":"研究者たちは、その反応のための基質指向性触媒を開発しました。","type":"adjective","meaning_category":"Designed for a specific substrate"},{"sentence":"Substrate-oriented deposition techniques are crucial for creating high-quality thin films.","translation":"基板指向性の成膜技術は、高品質の薄膜を作成するために不可欠です。","type":"adjective","meaning_category":"Influenced by the substrate"}]}