{"word":"Stereogastrula","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（動物学）胞胚腔が消失し、内部が細胞で満たされた状態の胞胚。特に、卵黄が多い卵で発生する。","english_definition":"(Zoology) A type of gastrula in which the blastocoel is filled with cells, resulting in a solid embryo. This typically occurs in eggs with a large amount of yolk.","examples":[{"sentence":"The stereogastrula stage is observed in some invertebrates with yolky eggs.","translation":"内部胞胚期は、卵黄の多い卵を持つ一部の無脊椎動物に見られる。"}],"collocations":["stereogastrula formation","development of stereogastrula"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Stereo-' (solid, three-dimensional) + 'gastrula'. The term refers to the solid nature of the gastrula due to the absence of a blastocoel.","priority":"★★★"},"pronunciation":{"ipa":"/ˌstɪəriːoʊˈɡæstrʊlə/","syllables":"ste-re-o-gas-tru-la"},"inflection":{"noun_plural":"stereogastrulae"},"usage_notes":{"explanation":"Stereogastrula formation is a type of gastrulation, the process during which the single-layered blastula is reorganized into a multilayered structure known as the gastrula. This process is common in animals with yolky eggs, where the large amount of yolk impedes the formation of a typical blastocoel.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["gastrulation","blastula","blastocoel"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Stereogastrula' is a technical term in developmental biology, specifically zoology. It refers to a specific type of gastrula, characterized by the absence of a blastocoel (fluid-filled cavity) due to the filling of the embryo with cells. This term is primarily used in scientific contexts when discussing embryonic development. Understanding requires knowledge of basic embryology terms like blastula and gastrulation."},"example_sentences":[{"sentence":"The stereogastrula lacks a blastocoel, distinguishing it from other types of gastrulae.","translation":"内部胞胚は胞胚腔を欠いており、他の種類の胞胚と区別される。","type":"general","meaning_category":"description"},{"sentence":"In some species, the stereogastrula develops directly into the larval form.","translation":"一部の種では、内部胞胚は直接幼生形態に発達する。","type":"development","meaning_category":"development"}]}