{"word":"personally-motivated","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"個人的な動機を持つ、個人的な理由で動機づけられている","english_definition":"driven or influenced by personal reasons, desires, or goals.","examples":[{"sentence":"His actions were personally-motivated, stemming from a desire to prove himself.","translation":"彼の行動は個人的な動機によるもので、自分自身を証明したいという願望から来ていた。"},{"sentence":"The project became personally-motivated after the incident affected her family.","translation":"そのプロジェクトは、その事件が彼女の家族に影響を与えた後、個人的な動機を持つようになった。"},{"sentence":"She is a personally-motivated individual who always strives for excellence.","translation":"彼女は常に卓越性を目指す、個人的な動機を持つ個人だ。"}],"collocations":["be personally-motivated","become personally-motivated","personally-motivated individual","personally-motivated action","personally-motivated decision"],"synonyms":["self-motivated","driven","ambitious","determined","passionate","dedicated"],"antonyms":["unmotivated","apathetic","indifferent","disinterested"]}],"etymology":{"value":"\"Personally\" + \"motivated\". \"Personally\" comes from \"person\", and \"motivated\" comes from \"motive\", indicating a drive originating from within an individual's personal desires or goals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrsənəli ˈmoʊtɪveɪtɪd/","syllables":"per-son-al-ly mo-ti-vat-ed"},"inflection":{"adjective_forms":{"comparative":"more personally-motivated","superlative":"most personally-motivated"}},"usage_notes":{"explanation":"\"Personally-motivated\" describes actions, decisions, or individuals who are driven by personal reasons rather than external pressures or obligations. It implies a strong internal desire or goal that fuels their behavior. This term is often used to highlight the dedication and passion someone brings to a task or project because it is deeply connected to their own values or aspirations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was personally motivated by the company's goals.","correct":"✓ He was motivated by the company's goals.","note":"If the motivation comes from the company's goals, it's not \"personally-motivated.\" Use \"motivated\" alone or specify the source of motivation. "},{"incorrect":"✗ She is a person who is personally motivate.","correct":"✓ She is a personally-motivated person.","note":"Use the adjective form \"personally-motivated\" to describe the person. \"Motivate\" is a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["motivation (noun)","motivate (verb)","personal (adjective)","personally (adverb)"],"related_terms":["self-interest","intrinsic motivation","personal goals","personal values","ambition","drive","determination","passion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"personally-motivated\" is used to describe someone whose actions are strongly influenced by their own desires, goals, or values. It suggests that the individual has a deep, internal reason for pursuing a particular course of action. This is different from being motivated by external factors like money, recognition, or pressure from others. The term is often used in discussions about work ethic, leadership, and individual achievement. It implies a high level of commitment and passion. "},"example_sentences":[{"sentence":"The artist's work was deeply personally-motivated, reflecting her own life experiences.","translation":"そのアーティストの作品は非常に個人的な動機によるもので、彼女自身の人生経験を反映していた。","type":"adjective","meaning_category":"driven by personal experiences"},{"sentence":"He became personally-motivated to solve the problem after it affected his community.","translation":"彼はその問題が自分のコミュニティに影響を与えた後、それを解決するために個人的な動機を持つようになった。","type":"adjective","meaning_category":"driven by personal connection"},{"sentence":"She is a personally-motivated student who consistently exceeds expectations.","translation":"彼女は常に期待を超える、個人的な動機を持つ学生だ。","type":"adjective","meaning_category":"driven by personal goals"}]}