{"word":"Greek-unfriendly","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"ギリシャ人にとって不快な、ギリシャ文化を尊重しない、またはギリシャを敵視する","english_definition":"unwelcoming, disrespectful, or hostile towards Greeks, Greek culture, or Greece.","examples":[{"sentence":"The new regulations were seen as Greek-unfriendly by many in the diaspora.","translation":"その新しい規制は、在外ギリシャ人の多くからギリシャ人にとって不快なものと見なされた。"},{"sentence":"Some travel guides have been criticized for being Greek-unfriendly in their portrayal of the country.","translation":"一部の旅行ガイドは、その国の描写においてギリシャ人にとって不快であると批判されている。"}],"collocations":["Greek-unfriendly policies","Greek-unfriendly remarks","Greek-unfriendly attitude"],"synonyms":["anti-Greek","xenophobic towards Greeks","culturally insensitive to Greeks"],"antonyms":["Greek-friendly","pro-Greek","Hellenophile"],"notes":"This term is often used in political or cultural contexts to describe actions or attitudes that are perceived as discriminatory or offensive towards Greeks."}],"etymology":{"value":"Formed by adding the suffix '-unfriendly' to the word 'Greek'. The suffix '-unfriendly' indicates opposition, hostility, or lack of suitability.","priority":"low"},"pronunciation":{"ipa":"/ˌɡriːk.ʌnˈfrend.li/","syllables":"Greek-un-friend-ly"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (more Greek-unfriendly, most Greek-unfriendly)."},"usage_notes":{"explanation":"'Greek-unfriendly' is a relatively uncommon term, usually employed to describe policies, statements, or attitudes that are perceived as being biased against or harmful to Greek people or culture. It is often used in discussions about international relations, cultural sensitivity, or political correctness.","priority":"low"},"common_mistakes":{"examples":[{"incorrect":"The weather is Greek-unfriendly.","correct":"The weather is unfavorable.","note":"'Greek-unfriendly' is typically used to describe attitudes or policies, not general conditions like weather."}],"priority":"low"},"related_words":{"derivatives":["unfriendly","friendly","Greek"],"related_terms":["xenophobia","anti-Hellenism","cultural sensitivity"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - This is a niche term.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'Greek-unfriendly' is a complex adjective formed by combining 'Greek' with the suffix '-unfriendly'. It is used to describe something that is unwelcoming, hostile, or insensitive towards Greek people, culture, or the country of Greece. This term is not commonly used and would likely appear in discussions about cultural sensitivity, international relations, or political issues related to Greece."},"example_sentences":[{"sentence":"The newspaper published a series of articles that were widely considered Greek-unfriendly.","translation":"その新聞は、ギリシャ人にとって不快であると広く考えられている一連の記事を掲載した。","type":"adjective","meaning_category":"unwelcoming"},{"sentence":"The government's new economic policies were seen as Greek-unfriendly by many investors.","translation":"政府の新しい経済政策は、多くの投資家からギリシャ人にとって不快であると見なされた。","type":"adjective","meaning_category":"hostile"}]}