{"word":"cnidosac","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"刺胞嚢（しほうのう）: ある種の軟体動物（特に裸鰓類）が、刺胞動物（例えば、ヒドラやクラゲ）を食べた際に、その刺胞細胞（刺胞）を体内に取り込み、特定の器官に貯蔵する袋状の構造。この刺胞は、防御機構として利用される。","english_definition":"A sac-like structure in certain mollusks (especially nudibranchs) where nematocysts (stinging cells) obtained from consumed cnidarians (e.g., hydras, jellyfish) are stored for defensive purposes.","examples":[{"sentence":"The nudibranch uses the nematocysts stored in its cnidosac for defense against predators.","translation":"その裸鰓は、捕食者に対する防御のために、刺胞嚢に貯蔵された刺胞を使用する。"}],"collocations":["store nematocysts","defensive mechanism","nudibranch","kleptocnidae"],"synonyms":["nematocyst storage sac","kleptocnidae"],"antonyms":[]}],"etymology":{"value":"The word 'cnidosac' is derived from 'cnido-' (referring to cnidarians, the animals possessing nematocysts) and 'sac' (a pouch or bag).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪdəˌsæk/","syllables":"ni-do-sac"},"inflection":{"noun_plural":"cnidosacs"},"usage_notes":{"explanation":"Cnidosacs are a fascinating example of kleptoplasty, where an animal steals organelles (in this case, nematocysts) from its prey for its own benefit.  This is primarily observed in nudibranchs, but can occur in other mollusks as well. The nematocysts are not digested but rather carefully transported and stored within the cnidosac. When threatened, the nudibranch can deploy these stinging cells as a defense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cnidosac creates nematocysts.","correct":"✓ The cnidosac stores nematocysts.","note":"The cnidosac does not create nematocysts; it only stores them after the nudibranch consumes cnidarians."}],"priority":"★★☆"},"related_words":{"derivatives":["cnidarian","nematocyst","kleptoplasty"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term used primarily in marine biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cnidosac' is a specialized term in marine biology, specifically related to nudibranchs and their unique defensive mechanism. Understanding requires familiarity with cnidarians and nematocysts. The concept of kleptoplasty is also helpful for full comprehension. Due to its highly specific usage, it is not commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The bright colors of the nudibranch warn predators that it possesses functional nematocysts in its **cnidosac**.","translation":"その裸鰓の鮮やかな色彩は、捕食者に対して、その刺胞嚢に機能的な刺胞を持っていることを警告する。","type":"noun","meaning_category":"刺胞嚢 (defensive structure)"}]}