{"word":"Relativization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"相対化、関係節化","english_definition":"The grammatical process of forming a relative clause from a sentence by introducing a relative pronoun or relative adverb.","examples":[{"sentence":"Relativization is a key process in complex sentence formation.","translation":"相対化は複雑な文を形成する上で重要なプロセスです。"},{"sentence":"English uses relative pronouns like 'who', 'which', and 'that' for relativization.","translation":"英語では、'who'、'which'、'that'のような関係代名詞を相対化に使用します。"}],"collocations":["relative clause formation","relative pronoun","relative adverb","subject relativization","object relativization"],"synonyms":["embedding","subordination"],"antonyms":[]}],"etymology":{"value":"The term 'relativization' is derived from 'relative' (referring to a relationship) and '-ization' (a suffix indicating a process or action). It describes the process of making a clause relative to a noun phrase.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛlətɪvaɪˈzeɪʃən/","syllables":"re-la-ti-vi-za-tion"},"inflection":{"noun_plural":"Relativizations"},"usage_notes":{"explanation":"Relativization is a linguistic term referring to the process of forming relative clauses. It involves embedding one clause inside another to modify a noun phrase. This is typically achieved using relative pronouns (e.g., 'who', 'which', 'that') or relative adverbs (e.g., 'where', 'when', 'why'). Relativization is a fundamental aspect of syntax and is crucial for creating complex sentences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relativization of the sentence is not clear.","correct":"✓ The relativization in the sentence is not clear.","note":"Using 'of' instead of 'in' can be grammatically incorrect in this context. 'Relativization in' refers to the process within the sentence."},{"incorrect":"✗ Relativization is when you use commas.","correct":"✓ Relativization involves using relative pronouns or adverbs to form relative clauses.","note":"Relativization is not simply about using commas; it's about the grammatical process of embedding clauses."}],"priority":"★★☆"},"related_words":{"derivatives":["relativize (verb)","relative (adjective, noun)","relative clause (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Relativization' is a term used in linguistics to describe how we create relative clauses. A relative clause adds extra information about a noun in a sentence. For example, in the sentence 'The book that I read was interesting,' the clause 'that I read' is a relative clause that modifies 'the book.' The process of forming this clause using a relative pronoun ('that') is called relativization. This concept is more commonly discussed in advanced grammar and linguistics courses.","example_sentences":[]},"example_sentences":[{"sentence":"The study examined different strategies of relativization in various languages.","translation":"その研究では、様々な言語における異なる相対化の戦略を調査しました。","type":"noun","meaning_category":"相対化"},{"sentence":"Subject relativization is generally easier to process than object relativization.","translation":"主語の相対化は、一般的に目的語の相対化よりも処理が容易です。","type":"noun","meaning_category":"相対化"}]}