{"word":"scientism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"科学主義: 科学的方法論を他の探求分野（人文科学、社会科学、哲学など）に不適切に適用すること、または科学がすべての知識の唯一の客観的な手段であるという信念。","english_definition":"The belief that the methods of natural science, or the categories and concepts characteristic of it, are either the only appropriate methods of investigation, or the most appropriate methods of investigation, for all areas of reality; or the belief that science is the only objective means of knowledge.","examples":[{"sentence":"Critics argue that scientism leads to a narrow and reductionist view of the world.","translation":"批判者たちは、科学主義が世界の狭く還元主義的な見方につながると主張している。"},{"sentence":"Scientism often dismisses subjective experiences as unimportant or irrelevant.","translation":"科学主義は、主観的な経験を重要でない、または無関係なものとして退けることが多い。"},{"sentence":"The debate over scientism involves discussions about the limits of scientific inquiry.","translation":"科学主義に関する議論は、科学的探求の限界についての議論を含む。"}],"collocations":["Embrace of scientism","Critique of scientism","Dangers of scientism","Limits of scientism"],"synonyms":["Positivism","Physicalism","Reductionism"],"antonyms":["Humanism","Art","Religion","Philosophy"]}],"etymology":{"value":"Formed from 'science' + '-ism'. The term emerged in the mid-19th century, initially used by those who opposed the perceived overreach of science into areas traditionally handled by other disciplines like philosophy and religion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪənˌtɪzəm/","syllables":"sci-en-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Scientism' is often used pejoratively to criticize the perceived overreliance on scientific methods and explanations, especially when applied to areas where subjective experience, values, or qualitative understanding are considered important. It implies a belief that science can answer all questions or that scientific knowledge is superior to other forms of knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Scientism is always a good approach to understanding complex issues.","correct":"A scientific approach is often helpful, but scientism can be limiting when dealing with subjective experiences.","note":"Scientism, as a concept, is often viewed critically. It's more accurate to say that a scientific approach is valuable, but scientism can be problematic when applied inappropriately."}],"priority":"★★☆"},"related_words":{"derivatives":["Scientistic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scientism' refers to the belief that science is the only or best way to understand everything. It's often used critically to suggest that someone relies too much on science and ignores other important ways of knowing, like art, philosophy, or personal experience. Understanding this term requires grasping abstract concepts and nuanced arguments about the nature of knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"The author warns against the dangers of **scientism** in ethical decision-making.","translation":"著者は、倫理的な意思決定における科学主義の危険性について警告している。","type":"noun","meaning_category":"Philosophy"},{"sentence":"Some critics argue that modern economics suffers from **scientism**, focusing too much on mathematical models and neglecting real-world complexities.","translation":"一部の批評家は、現代経済学は科学主義に苦しんでおり、数学的モデルに焦点を当てすぎて、現実世界の複雑さを無視していると主張している。","type":"noun","meaning_category":"Critique"},{"sentence":"The rise of **scientism** has led to a decline in the appreciation for the humanities, according to some scholars.","translation":"一部の学者によると、科学主義の台頭は、人文科学への評価の低下につながっている。","type":"noun","meaning_category":"Cultural impact"}]}