{"word":"Unavian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not relating to birds; not avian.","english_definition":"Not of or relating to birds; the opposite of avian.","examples":[{"sentence":"The creature was clearly unavian, possessing no feathers or wings.","translation":"その生物は明らかに鳥類ではなく、羽毛も翼も持っていなかった。"},{"sentence":"The fossil showed unavian characteristics, suggesting it belonged to a different class of animals.","translation":"その化石は鳥類ではない特徴を示しており、異なる種類の動物に属していることを示唆していた。"}],"collocations":["unavian species","unavian characteristics","unavian creature","unavian fossil"],"synonyms":["non-avian","non-ornithic"],"antonyms":["avian","ornithic"]}],"etymology":{"value":"Formed from the prefix 'un-' (meaning 'not') and 'avian' (relating to birds).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈeɪviən/","syllables":"un-a-vi-an"},"inflection":{"notes":"Adjectives do not typically inflect in English, apart from comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"'Unavian' is primarily used in scientific or technical contexts to specifically denote something as not belonging to the class Aves (birds). It is often used in paleontology or zoology when discussing the evolutionary relationships between different animal groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unavian flu is spreading.","correct":"✓ The avian flu is spreading.","note":"'Avian flu' refers to bird flu, so using 'unavian' would be incorrect in this context."},{"incorrect":"✗ The unavian dinosaur evolved into birds.","correct":"✓ Some non-avian dinosaurs evolved into birds.","note":"While some dinosaurs were unavian, it's more accurate to specify 'non-avian dinosaurs' when discussing their evolution into birds."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["avian","aves","ornithology","non-avian dinosaur"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unavian' is a specialized term primarily used in scientific contexts, particularly in fields like zoology and paleontology. It is used to describe characteristics, species, or fossils that are not related to birds. The word is formed by adding the prefix 'un-' to 'avian,' making it relatively easy to understand for those familiar with scientific terminology. However, due to its limited usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The paleontologists discovered unavian reptile fossils in the same stratum as early bird remains.","translation":"古生物学者たちは、初期の鳥類の化石と同じ地層で、鳥類ではない爬虫類の化石を発見した。","type":"general","meaning_category":"General"},{"sentence":"The study focused on differentiating avian and unavian skeletal structures.","translation":"その研究は、鳥類と鳥類ではない骨格構造を区別することに焦点を当てた。","type":"technical","meaning_category":"Technical"}]}