{"word":"Rifter","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にアイスランド語圏の地質学用語) 地溝帯、リフト帯","english_definition":"(Primarily Icelandic geological term) A rift zone, a linear series of volcanoes, fumaroles, and hot springs, typically associated with a spreading center or continental rift.","examples":[{"sentence":"The Silfra fissure is located in the Þingvellir Rifter, where the North American and Eurasian tectonic plates meet.","translation":"シルフラの割れ目は、北米プレートとユーラシアプレートが出会うシンクヴェトリル地溝帯に位置しています。"}],"collocations":["Þingvellir Rifter","volcanic rifter","geothermal rifter"],"synonyms":["rift zone","spreading center","divergent boundary"],"antonyms":[],"notes":"This term is most commonly used in the context of Icelandic geology due to the country's location on the Mid-Atlantic Ridge."},{"part_of_speech":"noun","definition":"(EVE Onlineのゲーム用語) アマー帝国のフリゲート艦の一種","english_definition":"(EVE Online game term) A Minmatar Frigate class spaceship.","examples":[{"sentence":"The Rifter is a popular choice for PvP combat due to its speed and firepower.","translation":"リフターは、その速度と火力から、PvP戦闘で人気のある選択肢です。"}],"collocations":["Minmatar Rifter","T1 Frigate","PvP Rifter"],"synonyms":[],"antonyms":[],"notes":"This definition is specific to the EVE Online universe."}],"etymology":{"value":"Derived from the verb 'rift', meaning to form fissures or cracks; to split apart.","priority":"N/A"},"pronunciation":{"ipa":"/ˈrɪftər/","syllables":"rif-ter"},"inflection":{"noun_plural":"Rifters"},"usage_notes":{"explanation":"The word 'Rifter' has two primary meanings, one geological and one related to the EVE Online game. The geological meaning refers to a rift zone, especially in the context of Iceland. The gaming meaning refers to a specific type of spaceship in EVE Online.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["rift","rifting"],"related_terms":["tectonic plates","fissure","frigate","EVE Online"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of specific contexts (geology of Iceland, EVE Online).","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'Rifter' is a specialized term. Its geological meaning is primarily used in the context of Icelandic geology. Its gaming meaning is specific to the EVE Online community. Therefore, understanding requires background knowledge in either geology or the EVE Online game."},"example_sentences":[{"sentence":"The Icelandic landscape is characterized by numerous rifters and volcanic activity.","translation":"アイスランドの景観は、多数の地溝帯と火山活動によって特徴付けられています。","type":"noun","meaning_category":"Geology"},{"sentence":"He piloted his Rifter skillfully, dodging enemy fire in the asteroid belt.","translation":"彼は小惑星帯で敵の攻撃を巧みに回避しながら、リフターを操縦しました。","type":"noun","meaning_category":"EVE Online"}]}