{"word":"somatologically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"体質学的に","english_definition":"In a manner relating to somatology (the study of the human body, its constitution, and its development).","examples":[{"sentence":"The data was analyzed somatologically to determine correlations between body type and certain health conditions.","translation":"体型と特定の健康状態との相関関係を判断するために、データは体質学的に分析されました。"}],"collocations":["analyze somatologically","study somatologically"],"synonyms":["physically","anatomically"],"antonyms":[]}],"etymology":{"value":"Formed from 'somatological' (relating to somatology) + '-ly' (adverbial suffix). Somatology comes from Greek 'soma' (body) + '-logy' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/səˌmætəˈlɒdʒɪkli/","syllables":"so-ma-to-lo-gi-cal-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Somatologically' is a technical term primarily used in academic or scientific contexts, specifically when discussing the body's constitution and development in relation to various factors. It is rarely used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was addressed somatically.","correct":"✓ The problem was addressed somatologically.","note":"'Somatically' refers to the body in the context of somatic cells or somatic experiences, while 'somatologically' refers specifically to the study of body types and constitutions."}],"priority":"★★☆"},"related_words":{"derivatives":["somatology (noun: the study of the human body and its constitution)","somatological (adjective: relating to somatology)","somatologist (noun: a person who studies somatology)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Somatologically' is an advanced term used in the context of studying the human body's constitution and development. It is mainly found in scientific or academic texts related to anthropology, medicine, or physical education. Due to its specialized nature, it is unlikely to be encountered in general English usage."},"example_sentences":[{"sentence":"The research aimed to categorize individuals somatologically based on their body measurements.","translation":"その研究は、身体測定に基づいて個人を体質学的に分類することを目的としていました。","type":"adverb","meaning_category":"体質学的に"},{"sentence":"The effects of nutrition were examined somatologically to understand their impact on growth.","translation":"栄養の影響が成長に与える影響を理解するために、体質学的に調査されました。","type":"adverb","meaning_category":"体質学的に"}]}