{"word":"Zionism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シオニズム：ユダヤ人の民族自決権を支持し、イスラエルをユダヤ人のための国家として建設・維持しようとする思想・運動。","english_definition":"A political movement that supports the self-determination of the Jewish people and the establishment and maintenance of a Jewish state, primarily in the historical Land of Israel (roughly corresponding to modern Israel, the Palestinian territories, and parts of Jordan, Lebanon, and Syria).","examples":[{"sentence":"Zionism emerged in the late 19th century in response to rising antisemitism in Europe.","translation":"シオニズムは、19世紀後半にヨーロッパで高まる反ユダヤ主義に対応して生まれた。"},{"sentence":"Modern Zionism is primarily concerned with supporting the State of Israel.","translation":"現代のシオニズムは、主にイスラエル国の支援に関わっている。"},{"sentence":"There are different streams of Zionism, ranging from secular to religious.","translation":"シオニズムには、世俗的なものから宗教的なものまで、さまざまな流れがある。"}],"collocations":["political Zionism (政治的シオニズム)","religious Zionism (宗教的シオニズム)","cultural Zionism (文化的シオニズム)","Labor Zionism (労働シオニズム)","post-Zionism (ポスト・シオニズム)","anti-Zionism (反シオニズム)"],"synonyms":["Jewish nationalism","Israelism"],"antonyms":["anti-Zionism","post-Zionism"]},{"part_of_speech":"noun","definition":"シオニズム支持者","english_definition":"Support for Zionism; belief in the right of the Jewish people to have a sovereign nation in their ancestral homeland.","examples":[{"sentence":"He is a strong believer in Zionism.","translation":"彼はシオニズムの強い信奉者だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"Zionism\" was coined in 1890 by Nathan Birnbaum, deriving from \"Zion\" (Hebrew: ציון, Tziyon), a hill in Jerusalem and, by extension, a synonym for Jerusalem and the Land of Israel.","priority":"★★★"},"pronunciation":{"ipa":"/ˈzaɪənɪzəm/","syllables":"Zi-on-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Zionism is a complex and often controversial topic. It encompasses a range of ideologies and approaches to Jewish self-determination. While it is primarily associated with the establishment and support of the State of Israel, it also involves cultural, religious, and political dimensions. It's important to distinguish between Zionism as a historical movement and contemporary debates surrounding Israeli policies and the Israeli-Palestinian conflict. The term \"anti-Zionism\" is often used to describe opposition to Zionism, but it can also be used in ways that are considered antisemitic, so it's important to be aware of the context in which it is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Zionism is just about religion.","correct":"✓ Zionism is a political movement with religious and cultural dimensions.","note":"Zionism has religious aspects for some, but it is fundamentally a political movement about Jewish self-determination."},{"incorrect":"✗ All Jews are Zionists.","correct":"✓ Not all Jews are Zionists; there is a diversity of views within the Jewish community regarding Zionism.","note":"There are Jews who support Zionism, oppose it, or have nuanced views on the subject."},{"incorrect":"✗ Zionism is the same as Judaism.","correct":"✓ Zionism is a political ideology, while Judaism is a religion.","note":"While Zionism draws on Jewish history and culture, it is distinct from the Jewish religion itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Zionist (noun/adjective)","Zionistically (adverb)","anti-Zionism (noun)","anti-Zionist (noun/adjective)","post-Zionism (noun)","post-Zionist (noun/adjective)"],"phrases":["Land of Israel","Aliyah (immigration to Israel)","Kibbutz (collective community in Israel)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but important in political and historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Zionism\" is a term referring to the political movement supporting Jewish self-determination and the establishment of a Jewish state in the historical Land of Israel. Understanding this term requires knowledge of 19th and 20th-century European history, the history of the Jewish people, and the complexities of the Israeli-Palestinian conflict. It is crucial to be aware of the diverse interpretations and often contentious debates surrounding Zionism, as well as the potential for misuse of the term in antisemitic contexts. The term is most often encountered in political science, history, and Middle Eastern studies contexts."},"example_sentences":[{"sentence":"Theodor Herzl is considered the father of modern Zionism.","translation":"テオドール・ヘルツルは現代シオニズムの父と考えられている。","type":"noun","meaning_category":"political movement"},{"sentence":"Many early Zionists were motivated by the desire to escape persecution in Europe.","translation":"初期のシオニストの多くは、ヨーロッパでの迫害から逃れたいという願望に突き動かされていた。","type":"noun","meaning_category":"political movement"},{"sentence":"Discussions about Zionism often involve complex and sensitive issues.","translation":"シオニズムに関する議論は、しばしば複雑でデリケートな問題を含む。","type":"noun","meaning_category":"political movement"}]}