{"word":"untenability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主張・理論・立場などの)維持不可能性、擁護不可能性、正当化不可能性","english_definition":"the state of not being able to be defended or maintained against attack or objection; the quality of being indefensible.","examples":[{"sentence":"The untenability of his argument became clear under scrutiny.","translation":"彼の主張の維持不可能性は、精査の下で明らかになった。"},{"sentence":"The government's position on the issue was marked by its untenability.","translation":"その問題に関する政府の立場は、その擁護不可能性によって特徴づけられた。"},{"sentence":"The untenability of the theory led to its eventual abandonment.","translation":"その理論の正当化不可能性が、最終的な放棄につながった。"}],"collocations":["prove the untenability of","demonstrate the untenability of","the inherent untenability of","the logical untenability of"],"synonyms":["indefensibility","unsustainability","invalidity","flimsiness","weakness","vulnerability"],"antonyms":["tenability","defensibility","sustainability","validity","soundness","robustness"]}],"etymology":{"value":"Derived from 'un-' (prefix meaning 'not'), 'tenable' (capable of being held or defended), and '-ity' (suffix denoting a state or quality). Thus, 'untenability' literally means 'the state of not being tenable'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌtɛnəˈbɪləti/","syllables":"un-ten-a-bil-i-ty"},"inflection":{"noun_plural":"untenabilities (rarely used)"},"usage_notes":{"explanation":"'Untenability' is a formal term used to describe the condition where a claim, theory, or position cannot be reasonably defended or maintained, often due to logical flaws, lack of evidence, or practical difficulties. It is typically used in academic, political, or legal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The untenability of the situation made it difficult to breathe.","correct":"✓ The gravity of the situation made it difficult to breathe.","note":"'Untenability' refers to arguments or positions, not general situations. Use 'gravity', 'seriousness', or a similar word for describing a dire situation."},{"incorrect":"✗ He showed untenability in his work.","correct":"✓ He showed a lack of skill in his work.","note":"'Untenability' applies to ideas or stances, not personal abilities. Use 'lack of skill', 'incompetence', or a similar phrase to describe someone's poor performance."}],"priority":"★★☆"},"related_words":{"derivatives":["untenable (adjective: not able to be defended)","tenability (noun: the state of being tenable)","tenably (adverb: in a tenable manner)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Untenability' is a formal and relatively rare word that describes the state of something (like an argument or a belief) being impossible to defend or support. It's often used in academic or political discussions where ideas are being critically examined. If something has 'untenability,' it means it's very weak and likely to fail under scrutiny.","priority":"★★★"},"example_sentences":[{"sentence":"The **untenability** of the witness's testimony led the jury to dismiss it.","translation":"証人の証言の維持不可能性が、陪審員にそれを退けさせた。","type":"noun","meaning_category":"擁護不可能性"},{"sentence":"The report highlighted the **untenability** of the company's financial projections.","translation":"報告書は、会社の財務予測の正当化不可能性を強調した。","type":"noun","meaning_category":"正当化不可能性"},{"sentence":"The **untenability** of his claim was evident from the lack of supporting evidence.","translation":"彼の主張の維持不可能性は、裏付けとなる証拠の欠如から明らかだった。","type":"noun","meaning_category":"維持不可能性"}]}