{"word":"erythroblastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"赤芽球性の、赤芽球増加性の","english_definition":"Relating to or characterized by erythroblasts (nucleated red blood cell precursors).","examples":[{"sentence":"The patient's bone marrow showed erythroblastic hyperplasia.","translation":"患者の骨髄は赤芽球性過形成を示した。"},{"sentence":"Erythroblastic islands are found in the bone marrow.","translation":"赤芽球島は骨髄に見られる。"}],"collocations":["erythroblastic anemia","erythroblastic hyperplasia","erythroblastic island"],"synonyms":["normoblastic"],"antonyms":[]}],"etymology":{"value":"From erythroblast (a nucleated precursor of a red blood cell) + -ic (suffix meaning 'relating to'). erythro- comes from Greek erythros meaning 'red', and blast means 'bud' or 'germ'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌrɪθroʊˈblæstɪk/","syllables":"e-ryth-ro-blas-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms (which are not commonly used for this word)."},"usage_notes":{"explanation":"'Erythroblastic' is a term used in hematology to describe conditions or features related to erythroblasts, which are immature red blood cells found in the bone marrow. It is often used in the context of describing bone marrow activity or certain types of anemia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cells were erythroblast.","correct":"✓ The cells were erythroblastic.","note":"'Erythroblast' is a noun (the cell itself), while 'erythroblastic' is an adjective (describing something related to erythroblasts)."},{"incorrect":"✗ The condition caused a decrease in erythroblastic cells.","correct":"✓ The condition caused a decrease in erythroblasts.","note":"When referring to the cells themselves, use the noun 'erythroblasts'. When describing a condition related to these cells, use the adjective 'erythroblastic'."}],"priority":"★★☆"},"related_words":{"derivatives":["erythroblast (noun): A nucleated precursor of a red blood cell.","erythropoiesis (noun): The production of red blood cells."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Erythroblastic' is a technical term primarily used in the field of hematology. It describes something related to erythroblasts, which are immature red blood cells. Understanding this term requires a background in biology or medicine. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The bone marrow aspirate revealed **erythroblastic** proliferation.","translation":"骨髄穿刺液は赤芽球の増殖を示した。","type":"adjective","meaning_category":"赤芽球性"},{"sentence":"**Erythroblastic** islands are specialized microenvironmental niches in the bone marrow.","translation":"赤芽球島は骨髄内の特殊な微小環境ニッチである。","type":"adjective","meaning_category":"赤芽球性"}]}