{"word":"especificidade","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(qualidade de ser) específico; caráter do que é particular, detalhado ou preciso.","english_definition":"(quality of being) specific; the characteristic of being particular, detailed, or precise.","examples":[{"sentence":"A especificidade do contrato deve ser cuidadosamente analisada.","translation":"The specificity of the contract must be carefully analyzed."},{"sentence":"O relatório carece de especificidade; é muito vago.","translation":"The report lacks specificity; it is too vague."}],"collocations":["alta especificidade","baixa especificidade","nível de especificidade","detalhar a especificidade","aumentar a especificidade"],"synonyms":["precisão","detalhe","particularidade","minúcia","exatidão"],"antonyms":["generalidade","vagueza","imprecisão","indeterminação"]},{"part_of_speech":"noun","definition":"(em biologia ou medicina) capacidade de uma substância ou teste reagir ou detectar apenas uma determinada entidade ou condição.","english_definition":"(in biology or medicine) the ability of a substance or test to react with or detect only a particular entity or condition.","examples":[{"sentence":"A especificidade do anticorpo é crucial para o diagnóstico preciso.","translation":"The specificity of the antibody is crucial for accurate diagnosis."},{"sentence":"Este teste tem alta especificidade para detectar a presença do vírus.","translation":"This test has high specificity for detecting the presence of the virus."}],"collocations":["especificidade do anticorpo","especificidade do teste","alta especificidade (biologia)","baixa especificidade (biologia)","especificidade de ligação"],"synonyms":["seletividade","afinidade","exclusividade"],"antonyms":["reatividade cruzada","não seletividade"]}],"etymology":{"value":"Derivado do latim tardio 'specificus' (específico) + '-idade' (sufixo formador de substantivos que indicam qualidade ou estado).","priority":"★★☆"},"pronunciation":{"ipa":"/is.pe.si.fi.siˈda.dʒi/","syllables":"es-pe-ci-fi-ci-da-de"},"inflection":{"noun_plural":"especificidades"},"usage_notes":{"explanation":"A palavra 'especificidade' é usada em diversos contextos, desde discussões gerais sobre clareza e detalhe até aplicações técnicas em biologia e medicina. É importante considerar o contexto para entender o significado preciso.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"A especificação é mais importante que a especificidade.","correct":"A especificação é diferente da especificidade.","note":"'Especificação' refere-se ao ato de especificar ou a um conjunto de requisitos, enquanto 'especificidade' refere-se à qualidade de ser específico."}],"priority":"★☆☆"},"related_words":{"derivatives":["específico","especificar"],"related_terms":["particularidade","detalhe","precisão"]},"level_frequency":{"frequency_corpus":"Moderada. Comum em textos técnicos e acadêmicos.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"A palavra 'especificidade' é um substantivo que se refere à qualidade de ser específico, detalhado e preciso. Pode ser usada em contextos gerais para descrever a clareza de informações ou em contextos técnicos, como na biologia, para descrever a capacidade de uma substância reagir apenas com um alvo específico. É importante entender o contexto para interpretar corretamente o significado."},"example_sentences":[{"sentence":"A especificidade das instruções era essencial para o sucesso do projeto.","translation":"The specificity of the instructions was essential for the success of the project.","type":"general"},{"sentence":"A alta especificidade do teste de PCR garante resultados confiáveis.","translation":"The high specificity of the PCR test ensures reliable results.","type":"biology/medicine"},{"sentence":"O advogado enfatizou a especificidade das leis aplicáveis ao caso.","translation":"The lawyer emphasized the specificity of the laws applicable to the case.","type":"law"}]}