{"word":"Coxey","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"Jacob Coxey (1854-1951), an American businessman and populist politician.","english_definition":"An American businessman and populist politician who led Coxey's Army in 1894.","examples":[{"sentence":"Jacob Coxey was a prominent advocate for public works programs during economic downturns.","translation":"ジェイコブ・コクシーは、景気後退時の公共事業プログラムの著名な提唱者でした。"}],"collocations":["Coxey's Army","Jacob Coxey"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(historical) Coxey's Army, a protest march by unemployed workers in 1894, led by Jacob Coxey.","english_definition":"A protest march by unemployed workers in 1894, led by Jacob Coxey, advocating for government action to create jobs.","examples":[{"sentence":"Coxey's Army marched on Washington D.C. to demand economic relief.","translation":"コクシーの軍隊は、経済的救済を求めてワシントンD.C.へ行進しました。"}],"collocations":["Coxey's Army march","Coxey's Army protest"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the name of Jacob Coxey, the leader of Coxey's Army.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒksi/","syllables":"Cox-ey"},"inflection":{},"usage_notes":{"explanation":"The term \"Coxey\" primarily refers to Jacob Coxey, but it is also strongly associated with \"Coxey's Army,\" a significant historical event in the United States. When used as a noun, it almost always refers to the historical event.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"The word \"Coxey\" is primarily a proper noun referring to a historical figure and event. Understanding its meaning requires knowledge of American history, specifically the economic depression of the 1890s and the protest movement led by Jacob Coxey."},"example_sentences":[{"sentence":"The story of Coxey's Army is a reminder of the struggles faced by unemployed workers during economic depressions.","translation":"コクシーの軍隊の物語は、経済不況時に失業した労働者が直面した苦闘を思い出させるものです。","type":"noun","meaning_category":"Coxey's Army"},{"sentence":"Jacob Coxey's ideas were considered radical for his time.","translation":"ジェイコブ・コクシーの考えは、彼の時代には過激だと考えられていました。","type":"proper noun","meaning_category":"Jacob Coxey"}]}