{"word":"piache","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Mexico, slang) a person who sells or distributes illegal or counterfeit goods, often in the streets.","english_definition":"(Mexico, slang) A person who sells or distributes illegal or counterfeit goods, often in the streets.","examples":[{"sentence":"Los piaches vendían DVDs piratas en la calle.","translation":"The piaches were selling pirated DVDs on the street."},{"sentence":"Ten cuidado con los piaches, a veces venden productos robados.","translation":"Be careful with the piaches, sometimes they sell stolen goods."}],"collocations":["vender como piache (sell like a piache - to sell quickly or aggressively)"],"synonyms":["vendedor ambulante (street vendor)","pirata (pirate - referring to counterfeit goods)","ilegal (illegal vendor)"],"antonyms":["vendedor legal (legal vendor)","comerciante establecido (established merchant)"]}],"etymology":{"value":"The origin of the word 'piache' is uncertain, but it is believed to come from Mexican slang. It is associated with the informal and often illegal nature of street vending.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpjatʃe/","syllables":"pia-che"},"inflection":{"noun_plural":"piaches"},"usage_notes":{"explanation":"'Piache' is a slang term primarily used in Mexico to refer to individuals who sell illegal or counterfeit products, often in public spaces. It carries a negative connotation, implying involvement in illicit activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ El piache vendió un coche nuevo.","correct":"✓ El piache vendió un DVD pirata.","note":"'Piache' is typically used for small, illegal or counterfeit items, not for large, legitimate products like new cars."},{"incorrect":"✗ La tienda era un piache.","correct":"✓ El vendedor era un piache.","note":"'Piache' refers to the person selling the goods, not the store or location."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang, regional)","frequency_google_ngram":"Low frequency, specific to Mexican Spanish.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'piache' is a slang term from Mexico used to describe someone who sells illegal or counterfeit goods, usually in the streets. It is not a formal word and may not be understood outside of Mexico or by those unfamiliar with Mexican slang. The term carries a negative connotation, implying involvement in illicit activities. It's important to use this word with caution and awareness of its cultural context."},"example_sentences":[{"sentence":"Los turistas fueron engañados por un piache que vendía relojes falsos.","translation":"The tourists were deceived by a piache selling fake watches.","type":"example","meaning_category":"illegal vendor"},{"sentence":"La policía arrestó a varios piaches que operaban cerca del mercado.","translation":"The police arrested several piaches operating near the market.","type":"example","meaning_category":"illegal vendor"},{"sentence":"Es difícil competir con los piaches que no pagan impuestos.","translation":"It's difficult to compete with the piaches who don't pay taxes.","type":"example","meaning_category":"illegal vendor"}]}