{"word":"unvoluptuously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"色っぽくなく、ふくよかさや官能性を欠いて","english_definition":"In a manner that is not voluptuous; lacking in curves, sensuality, or attractiveness associated with a full, pleasing form.","examples":[{"sentence":"She was dressed plainly and moved unvoluptuously, almost unnoticed in the crowd.","translation":"彼女は質素な服を着て、色っぽくなく動き、群衆の中でほとんど気づかれなかった。"},{"sentence":"The room was decorated unvoluptuously, with simple, functional furniture.","translation":"部屋は色っぽくなく飾られており、シンプルで機能的な家具が置かれていた。"}],"collocations":["dressed unvoluptuously","decorated unvoluptuously","moved unvoluptuously"],"synonyms":["plainly","unattractively","without curves","without sensuality","ascetically"],"antonyms":["voluptuously","sensually","attractively","curvaceously"]}],"etymology":{"value":"Derived from the adjective 'voluptuous' (characterized by luxury, pleasure, and sensuality) with the addition of the prefix 'un-' (not) and the suffix '-ly' (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnvəˈlʌptʃuəsli/","syllables":"un-vo-lup-tu-ous-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Unvoluptuously' is used to describe something that lacks the qualities of being voluptuous, such as curves, sensuality, or luxuriousness. It often implies a deliberate absence or suppression of these qualities. It is a relatively rare word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She sang unvoluptuously, filling the room with passion.","correct":"✓ She sang passionately, filling the room with passion.","note":"'Unvoluptuously' implies a lack of sensuality, so it is contradictory to describe a passionate performance as 'unvoluptuous.'"},{"incorrect":"✗ The sculpture was unvoluptuously shaped, with flowing lines and curves.","correct":"✓ The sculpture was plainly shaped, with simple lines.","note":"'Unvoluptuously' implies a lack of curves, so it is contradictory to describe something with flowing lines and curves as 'unvoluptuous.'"}],"priority":"★★☆"},"related_words":{"derivatives":["voluptuous (adjective)","voluptuously (adverb)","voluptuousness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unvoluptuously' is a rare and complex word, best understood by advanced English speakers. It means the opposite of 'voluptuously,' indicating a lack of sensuality, curves, or luxuriousness. It is often used to describe something that is plain, simple, or even austere in appearance or manner. Due to its rarity and specific meaning, it is not commonly used in everyday conversation or writing."},"example_sentences":[{"sentence":"The dancer moved unvoluptuously across the stage, her movements sharp and angular rather than fluid and sensual.","translation":"ダンサーは舞台を色っぽくなく動き、彼女の動きは流動的で官能的というよりは、鋭く角ばっていた。","type":"adverb","meaning_category":"lacking sensuality"},{"sentence":"The room was furnished unvoluptuously, with only the bare necessities.","translation":"部屋は色っぽくなく家具が置かれ、必要最低限のものしかなかった。","type":"adverb","meaning_category":"lacking luxuriousness"}]}