{"word":"Lipuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A sweet dish originating from the Bundelkhand region of India, typically made with khoya (dried evaporated milk solids) and stuffed in a maida (all-purpose flour) shell, then deep-fried and soaked in sugar syrup.","english_definition":"A sweet dish from Bundelkhand, India, made with khoya filling in a maida shell, deep-fried and soaked in sugar syrup.","examples":[{"sentence":"She prepared Lipuria for the Diwali festival.","translation":"彼女はディワリ祭のためにリपुरियाを作った。"},{"sentence":"Lipuria is a popular sweet during Holi celebrations.","translation":"リपुरियाはホーリー祭のお祝いの際に人気のあるお菓子です。"}],"collocations":["make Lipuria","eat Lipuria","serve Lipuria","Lipuria sweet","traditional Lipuria"],"synonyms":["Gujiya","Pedakiya"],"antonyms":[]}],"etymology":{"value":"The name 'Lipuria' is likely derived from the local dialect of the Bundelkhand region. The exact etymology is not widely documented, but it is associated with the ingredients and preparation style specific to the region.","priority":"★☆☆"},"pronunciation":{"ipa":"/lɪˈpʊəriə/","syllables":"Li-pu-ri-a"},"inflection":{"noun_plural":"Lipurias"},"usage_notes":{"explanation":"Lipuria is a regional sweet dish, primarily associated with the Bundelkhand area of India. It is often prepared during festivals like Diwali and Holi. The dish is similar to Gujiya, which is popular in other parts of India, but may have slight variations in ingredients or preparation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I want a Lipuria recipe, but it's the same as samosa.","correct":"✓ I want a Lipuria recipe, but it's similar to Gujiya.","note":"Lipuria is a sweet dish, whereas samosa is a savory snack. Lipuria is more similar to Gujiya."},{"incorrect":"✗ Lipuria is made with rice flour.","correct":"✓ Lipuria is made with maida (all-purpose flour).","note":"The outer shell of Lipuria is typically made with maida, not rice flour."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_sweets":["Gujiya","Pedakiya","Khoya Barfi","Jalebi"],"ingredients":["Khoya","Maida","Sugar","Ghee","Cardamom"],"festivals":["Diwali","Holi"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in regions where the dish is popular.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Lipuria is a regional Indian sweet, specifically from the Bundelkhand region. It involves a somewhat complex preparation process, including making a dough from maida, creating a khoya-based filling, deep-frying the stuffed pastry, and then soaking it in sugar syrup. Understanding its cultural context and preparation methods requires some familiarity with Indian cuisine and traditions.","priority":"★☆☆"},"example_sentences":[{"sentence":"My grandmother always makes the best Lipuria during Diwali.","translation":"私の祖母はいつもディワリの時に最高のリपुरियाを作ります。","type":"example","meaning_category":"Traditional Sweet"},{"sentence":"The aroma of freshly fried Lipuria filled the kitchen.","translation":"揚げたばかりのリपुरियाの香りが台所に満ちていた。","type":"example","meaning_category":"Preparation"},{"sentence":"Lipuria is a must-have sweet during Holi celebrations in our village.","translation":"リपुरiaは私たちの村のホーリー祭のお祝いに欠かせないお菓子です。","type":"example","meaning_category":"Festival Sweet"}]}