{"word":"Xenophontian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クセノフォン（古代ギリシアの著作家・軍人）の、クセノフォンに関する、クセノフォンのような","english_definition":"Of or relating to Xenophon, the ancient Greek writer and soldier, or his writings; resembling Xenophon or his style.","examples":[{"sentence":"The Xenophontian style of writing is known for its clarity and simplicity.","translation":"クセノフォンの文体は、その明晰さと簡潔さで知られている。"},{"sentence":"He adopted a Xenophontian approach to leadership.","translation":"彼はリーダーシップにおいてクセノフォンのようなアプローチを採用した。"}],"collocations":["Xenophontian prose (クセノフォンの散文)","Xenophontian leadership (クセノフォンのリーダーシップ)"],"synonyms":["classical","Greek","Attic"],"antonyms":[]},{"part_of_speech":"noun","definition":"クセノフォンの著作の研究者、クセノフォンの信奉者","english_definition":"A scholar of the works of Xenophon; an admirer or follower of Xenophon.","examples":[{"sentence":"He is a noted Xenophontian, specializing in the Anabasis.","translation":"彼は著名なクセノフォン研究者であり、アナバシスを専門としている。"}],"collocations":["a dedicated Xenophontian (熱心なクセノフォン研究者)"],"synonyms":["classicist","Hellenist"],"antonyms":[]}],"etymology":{"value":"From the name of Xenophon (Ξενοφῶν), the ancient Greek historian and soldier, + -ian.","priority":"★★★"},"pronunciation":{"ipa":"/ˌzɛnəˈfɒntiən/","syllables":"Ze-no-phon-ti-an"},"inflection":{"notes":"Adjective and noun forms exist. The noun can be pluralized as Xenophontians."},"usage_notes":{"explanation":"'Xenophontian' is primarily used in academic or historical contexts when discussing or referencing Xenophon, his works, or his influence. It can describe a style, approach, or even a person who embodies qualities associated with Xenophon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a Xenophontian about the war.","correct":"✓ He wrote a Xenophontian account of the war.","note":"'Xenophontian' is an adjective, so it needs to modify a noun (e.g., account, style, approach)."},{"incorrect":"✗ She is a Xenophon.","correct":"✓ She is a Xenophontian.","note":"To describe someone who studies or admires Xenophon, use 'Xenophontian,' not just 'Xenophon,' which is the name of the person."}],"priority":"★☆☆"},"related_words":{"derivatives":["Xenophon (クセノフォン)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Xenophontian' is highly specialized and primarily found in academic or historical texts. Understanding requires familiarity with Xenophon and his works. Usage is limited to contexts directly related to Xenophon's life, writings, or influence."},"example_sentences":[{"sentence":"The professor gave a lecture on Xenophontian military tactics.","translation":"教授はクセノフォンの軍事戦術について講義を行った。","type":"adjective","meaning_category":"relating to Xenophon"},{"sentence":"As a Xenophontian, she dedicated her life to studying his works.","translation":"クセノフォン研究者として、彼女は彼の作品の研究に生涯を捧げた。","type":"noun","meaning_category":"scholar of Xenophon"}]}