{"word":"Saproplankton","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"腐食性プランクトン：死んだ有機物や分解物を栄養源とするプランクトン","english_definition":"Plankton that feed on dead organic matter and detritus.","examples":[{"sentence":"Saproplankton play an important role in the decomposition process in aquatic ecosystems.","translation":"腐食性プランクトンは水生生態系における分解過程で重要な役割を果たします。"},{"sentence":"The abundance of saproplankton can indicate the level of organic pollution in a water body.","translation":"腐食性プランクトンの豊富さは、水域における有機汚染のレベルを示す可能性があります。"}],"collocations":["abundance of saproplankton","role of saproplankton","saproplankton community"],"synonyms":["detritus feeders","bacterioplankton (in some cases)"],"antonyms":[]}],"etymology":{"value":"Derived from 'sapro-' (from Greek 'sapros' meaning rotten or decaying) + 'plankton' (from Greek 'planktos' meaning wandering or drifting).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsæproʊˈplæŋktən","syllables":"sap-ro-plank-ton"},"inflection":{"noun_plural":"saproplankton (usually treated as uncountable)"},"usage_notes":{"explanation":"Saproplankton are a component of plankton communities that are crucial in nutrient cycling, particularly in environments where there is a significant amount of dead organic material. They help break down this material, making nutrients available to other organisms. Saproplankton are not a distinct taxonomic group but rather a functional group defined by their feeding habits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Saproplankton are autotrophs.","correct":"✓ Saproplankton are heterotrophs.","note":"Saproplankton are heterotrophs, meaning they obtain nutrients from organic matter, unlike autotrophs which produce their own food. "},{"incorrect":"✗ Saproplankton are only found in polluted waters.","correct":"✓ Saproplankton are found in waters with high levels of organic matter, which can include polluted waters.","note":"While saproplankton can thrive in polluted waters due to the abundance of organic matter, they are also found in natural environments where decomposition is occurring."}],"priority":"★☆☆"},"related_words":{"derivatives":["saprophytic","planktonic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'saproplankton' refers to planktonic organisms that feed on decaying organic matter. This term is primarily used in ecological and limnological contexts. Understanding this term requires knowledge of basic ecology and the role of decomposers in ecosystems. It is not a commonly used term outside of scientific discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The analysis of water samples revealed a high concentration of saproplankton.","translation":"水サンプル分析により、腐食性プランクトンの高濃度が明らかになりました。","type":"general","meaning_category":"general"},{"sentence":"Saproplankton contribute to the natural purification of water by consuming organic pollutants.","translation":"腐食性プランクトンは有機汚染物質を消費することで、水の自然浄化に貢献します。","type":"ecological role","meaning_category":"ecological role"}]}