{"word":"enterrologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A specialist in enterrology; a medical professional who studies and treats diseases of the intestines.","english_definition":"A medical specialist who studies and treats diseases of the intestines.","examples":[{"sentence":"The enterrologist examined the patient's colonoscopy results.","translation":"腸病学者は患者のコロノスコピーの結果を調べました。"},{"sentence":"She consulted an enterrologist about her chronic abdominal pain.","translation":"彼女は慢性的な腹痛について腸病学者に相談しました。"}],"collocations":["consult an enterrologist","see an enterrologist","enterrologist examination","pediatric enterrologist"],"synonyms":["gastroenterologist","intestinal specialist"],"antonyms":[]}],"etymology":{"value":"The word \"enterrologist\" is derived from the Greek words \"enteron\" (intestine) and \"-logia\" (study of).","priority":"★★★"},"pronunciation":{"ipa":"ˌɛntəˈrɒlədʒɪst","syllables":"en-ter-rol-o-gist"},"inflection":{"noun_plural":"enterrologists"},"usage_notes":{"explanation":"The term \"enterrologist\" is less commonly used than \"gastroenterologist,\" which refers to a specialist in the entire digestive system, including the stomach, intestines, liver, and pancreas. An enterrologist specifically focuses on the intestines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I need to see an enterology.","correct":"I need to see an enterrologist.","note":"\"Enterology\" is the study of the intestines, while \"enterrologist\" is the medical specialist."}],"priority":"★★★"},"related_words":{"derivatives":["enterology (study of the intestines)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'enterrologist' is a highly specialized medical term referring to a doctor who specializes in the study and treatment of intestinal diseases. It is less commonly used than 'gastroenterologist,' which covers a broader range of the digestive system. Understanding this term requires a strong grasp of medical terminology."},"example_sentences":[{"sentence":"The enterrologist recommended a colonoscopy to investigate the patient's symptoms.","translation":"腸病学者は、患者の症状を調べるために大腸内視鏡検査を勧めました。","type":"general","meaning_category":"medical"},{"sentence":"After years of research, the enterrologist published a groundbreaking study on inflammatory bowel disease.","translation":"長年の研究の後、その腸病学者は炎症性腸疾患に関する画期的な研究を発表しました。","type":"research","meaning_category":"medical"}]}