{"word":"musterable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"召集可能な、動員可能な","english_definition":"Capable of being assembled or gathered together, especially for military service or other duty.","examples":[{"sentence":"The general needed to know how many musterable troops he had at his disposal.","translation":"将軍は、自分が自由に使える召集可能な兵力がどれくらいあるかを知る必要があった。"},{"sentence":"Only a fraction of the population was considered musterable for the national guard.","translation":"国民 Guard に召集可能とみなされたのは、人口のごく一部に過ぎなかった。"}],"collocations":["musterable troops","musterable forces","musterable population"],"synonyms":["callable","mobilizable","conscriptable","summonable"],"antonyms":["unsummonable","unmobilizable"]}],"etymology":{"value":"The word 'musterable' is derived from 'muster,' which comes from the Old French word 'mostrer,' meaning 'to show' or 'to display.' This evolved to mean assembling troops for review or service. The suffix '-able' indicates capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌstərəbəl/","syllables":"mus-ter-a-ble"},"inflection":{"notes":"Comparative and superlative forms are 'more musterable' and 'most musterable,' respectively, though these are rarely used."},"usage_notes":{"explanation":"The term 'musterable' is often used in military contexts or when discussing emergency response capabilities. It implies that a group or resource can be readily gathered and prepared for a specific purpose. It is relatively uncommon in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The musterable evidence was presented in court.","correct":"✓ The admissible evidence was presented in court.","note":"'Musterable' refers to people or resources that can be gathered, not to evidence. Use 'admissible' for evidence that is allowed in court."},{"incorrect":"✗ The musterable plan was put into action.","correct":"✓ The feasible plan was put into action.","note":"'Musterable' does not describe the quality of a plan. Use 'feasible' or 'workable' to describe a plan that can be put into action."}],"priority":"★★☆"},"related_words":{"derivatives":["muster (verb, noun)","mustering (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Too specific for CEFR levels)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'musterable' is a relatively uncommon term, primarily used in formal or technical contexts, particularly those related to military or emergency preparedness. It describes something (usually people or resources) that can be readily assembled or gathered for a specific purpose. Due to its specialized usage, it is more likely to be encountered in advanced texts or professional settings."},"example_sentences":[{"sentence":"The commander assessed the number of musterable soldiers before planning the operation.","translation":"指揮官は作戦を計画する前に、召集可能な兵士の数を評価した。","type":"adjective","meaning_category":"召集可能な"},{"sentence":"The city needed to determine its musterable resources in case of a natural disaster.","translation":"市は自然災害に備えて、動員可能な資源を特定する必要があった。","type":"adjective","meaning_category":"動員可能な"}]}