{"word":"unventable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of an idea, product, etc.) that cannot be invented; not capable of being invented.","english_definition":"Impossible to invent.","examples":[{"sentence":"The concept of a perpetual motion machine is likely unventable, given the laws of physics.","translation":"永久機関の概念は、物理法則を考えると、発明不可能である可能性が高いです。"},{"sentence":"Some argue that truly novel ideas are unventable, as they already exist in some form.","translation":"真に斬新なアイデアは、何らかの形で既に存在するため、発明不可能であると主張する人もいます。"}],"collocations":["unventable idea","unventable concept","unventable technology"],"synonyms":["unimaginable","inconceivable","impossible to create","non-inventable"],"antonyms":["inventable","possible to invent","creatable"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and the adjective 'inventable' (capable of being invented).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnɪnˈvɛntəbəl/","syllables":"un-in-ven-ta-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms (more unventable, most unventable) are possible but rare."},"usage_notes":{"explanation":"'Unventable' is a relatively rare word used to describe something that is considered impossible to invent, typically due to fundamental limitations or contradictions with established principles. It is often used in theoretical discussions or speculative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unventable car.","correct":"✓ The unimprovable car.","note":"'Unventable' refers to something that cannot be invented at all, not something that cannot be improved. Use 'unimprovable' for the latter. "},{"incorrect":"✗ This problem is unventable.","correct":"✓ This problem is unsolvable.","note":"'Unventable' applies to things that are created, not problems that are solved. Use 'unsolvable' for problems."}],"priority":"★★☆"},"related_words":{"derivatives":["inventable (adjective: capable of being invented)","invent (verb: to create or design something that has not existed before)","invention (noun: something that has been invented)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unventable' is a relatively uncommon word. It means something that is impossible to invent. It is often used in discussions about science, technology, or philosophy when considering the limits of what can be created or discovered. Understanding the word requires a good vocabulary and the ability to understand abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"Many believed that a flying machine was unventable until the Wright brothers proved otherwise.","translation":"ライト兄弟がそれを証明するまで、多くの人々は飛行機は発明不可能であると信じていました。","type":"adjective","meaning_category":"impossible to invent"},{"sentence":"Some mathematical theorems might be considered unventable, as they are discovered rather than created.","translation":"いくつかの数学的定理は、作成されるのではなく発見されるため、発明不可能と見なされる可能性があります。","type":"adjective","meaning_category":"impossible to invent"}]}