{"word":"Hamitism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハム語族起源説：かつて用いられた人種理論で、アフリカの一部の民族（特に北アフリカや東アフリカの民族）は、聖書のノアの息子ハムの子孫であるとし、彼らが他のアフリカ民族よりも文明的に進んでいると主張した。現在では科学的根拠がない人種差別的な理論として否定されている。","english_definition":"A discredited anthropological theory that claimed that some peoples of Africa, particularly those in North and East Africa, were descended from Ham, one of the sons of Noah in the Bible, and were therefore superior to other African peoples. It is now considered a racist and scientifically unfounded theory.","examples":[{"sentence":"Hamitism was used to justify colonial rule in Africa.","translation":"ハム語族起源説は、アフリカにおける植民地支配を正当化するために利用された。"},{"sentence":"The theory of Hamitism has been widely rejected by modern scholars.","translation":"ハム語族起源説は、現代の学者によって広く否定されている。"}],"collocations":["racial theory (人種理論)","colonialism (植民地主義)","scientific racism (科学的人種主義)","ethnic superiority (民族的優越性)"],"synonyms":["Hamitic theory","Hamitic hypothesis"],"antonyms":[]}],"etymology":{"value":"聖書のノアの息子「ハム (Ham)」に由来し、人種や言語の分類に「-ism」を付加して理論や学説を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈhæmɪtɪzəm/","syllables":"Ham-i-tism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Hamitism**」は、現在では否定されている人種理論を指す言葉であり、使用には注意が必要です。この理論は、アフリカの一部の民族がハムの子孫であるとし、彼らが他のアフリカ民族よりも優れていると主張しました。しかし、現代の科学的、倫理的な観点からは、人種差別的な思想として完全に否定されています。歴史的な文脈で言及する場合を除き、この言葉を安易に使うことは避けるべきです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hamitism is a valid scientific theory.","correct":"✓ Hamitism is a discredited racial theory.","note":"ハム語族起源説は、科学的な根拠がない人種差別的な理論であり、科学的な理論ではありません。"},{"incorrect":"✗ Hamitism is a good way to understand African history.","correct":"✓ Hamitism is a harmful ideology that was used to justify colonialism.","note":"ハム語族起源説は、植民地主義を正当化するために利用された有害なイデオロギーであり、アフリカの歴史を理解するための良い方法ではありません。"}],"priority":"★★★"},"related_words":{"derivatives":["Hamite (ハム語族の人)","Hamitic (ハム語族の)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Hamitism**」は、人種理論に関する専門用語であり、一般的にはあまり使われません。この言葉は、アフリカの一部の民族が聖書のハムの子孫であり、他のアフリカ民族よりも優れているという、現在では否定されている考え方を指します。この理論は、過去に植民地支配を正当化するために使われましたが、現代では人種差別的な思想として非難されています。歴史や社会科学の文脈で出てくることがありますが、使用には注意が必要です。"},"example_sentences":[{"sentence":"The concept of Hamitism contributed to the racial hierarchy during the colonial era.","translation":"ハム語族起源説の概念は、植民地時代の人種階層の形成に貢献した。","type":"noun","meaning_category":"人種理論"},{"sentence":"Hamitism is now recognized as a pseudo-scientific justification for racism.","translation":"ハム語族起源説は現在、人種差別を正当化するための疑似科学として認識されている。","type":"noun","meaning_category":"人種理論"}]}