{"word":"tawdrily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"けばけばしく、安っぽく、下品に","english_definition":"in a tawdry manner; cheaply and tastelessly showy.","examples":[{"sentence":"The room was tawdrily decorated with plastic flowers and glitter.","translation":"部屋はプラスチックの花とラメでけばけばしく飾られていた。"},{"sentence":"She dressed tawdrily in a sequined dress that was too tight.","translation":"彼女はきつすぎるスパンコールのドレスを着て、下品な格好をしていた。"},{"sentence":"The story was tawdrily sensationalized by the tabloid newspapers.","translation":"その話はタブロイド紙によってけばけばしく扇情的に報道された。"}],"collocations":["tawdrily decorated","tawdrily dressed","tawdrily sensationalized"],"synonyms":["gaudily","flashily","garishly","vulgarity","cheaply","tastelessly"],"antonyms":["elegantly","tastefully","subtly","classily"]}],"etymology":{"value":"Derived from \"tawdry,\" which originated as a shortened form of \"St. Audrey's lace,\" a cheap, showy lace sold at the St. Audrey's Fair in England.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɔːdrɪli/","syllables":"taw-dri-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Tawdrily\" describes something done in a way that is cheap, showy, and often tasteless. It implies a lack of sophistication or refinement, and often suggests an attempt to appear glamorous or luxurious that ultimately fails due to poor quality or excessive ornamentation. The word often carries a negative connotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted tawdrily in the play, giving a subtle and nuanced performance.","correct":"✓ She acted poorly in the play, giving a hammy and over-the-top performance.","note":"\"Tawdrily\" implies a lack of subtlety and refinement, so it wouldn't be used to describe a nuanced performance."}],"priority":"★★☆"},"related_words":{"derivatives":["tawdry (adjective)","tawdriness (noun)"],"phrasal_verbs":[],"related_concepts":["kitsch","camp","gaudy","vulgar"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"tawdrily\" is used to describe something done in a cheap, showy, and tasteless manner. It suggests a lack of sophistication and an attempt to appear glamorous that ultimately fails. This word is not commonly used in everyday conversation and is more likely to be found in literature or descriptive writing."},"example_sentences":[{"sentence":"The stage was tawdrily set with cheap props and garish lighting.","translation":"舞台は安物の小道具とけばけばしい照明でけばけばしく飾られていた。","type":"adverb","meaning_category":"manner"},{"sentence":"The magazine tawdrily exploited the celebrity's personal problems for profit.","translation":"その雑誌は利益のために、その有名人の個人的な問題をけばけばしく利用した。","type":"adverb","meaning_category":"manner"},{"sentence":"The bar was tawdrily decorated, with neon signs and plastic furniture.","translation":"そのバーはネオンサインとプラスチック製の家具でけばけばしく飾られていた。","type":"adverb","meaning_category":"manner"}]}