{"word":"animists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アニミズム信奉者、アニミスト","english_definition":"plural of animist: a person who believes that all natural things, such as plants, animals, and natural features, have spirits and can influence human events.","examples":[{"sentence":"Animists believe that trees have souls.","translation":"アニミストは木に魂が宿ると信じている。"},{"sentence":"Some animists practice rituals to communicate with spirits.","translation":"アニミストの中には、霊と交信する儀式を行う人もいる。"}],"collocations":["traditional animists","modern animists","indigenous animists"],"synonyms":["spiritualist","pagan","shamanist"],"antonyms":["atheist","materialist","nonbeliever"]}],"etymology":{"value":"The word \"animist\" comes from the word \"animism\", which is derived from the Latin word \"anima\" meaning \"soul, life\".","priority":"★★★"},"pronunciation":{"ipa":"ˈænɪmɪsts","syllables":"an-i-mists"},"inflection":{"noun_plural":"animists"},"usage_notes":{"explanation":"\"Animists\" refers to people who adhere to the beliefs of animism. Animism is the belief that objects, places, and creatures all possess a distinct spiritual essence. Animism is a broad term that encompasses many different beliefs and practices. It is often associated with indigenous cultures and traditional religions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a animists.","correct":"✓ He is an animist.","note":"When referring to a single person, use the singular form \"animist\" and the indefinite article \"an\" because it starts with a vowel sound."},{"incorrect":"✗ Animists believes in spirits.","correct":"✓ Animists believe in spirits.","note":"When using the plural noun \"animists\", the verb should be in the plural form as well."}],"priority":"★★☆"},"related_words":{"derivatives":["animism","animistic"],"phrases":["animistic beliefs","animistic practices","animistic religions"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"animists\" refers to people who practice animism, which is the belief that all things—animals, plants, rocks, rivers, weather systems, human works, and sometimes even words—are animated or possess a discrete spirit and conscious life. It is a term often used in anthropology and religious studies. Understanding this word requires familiarity with concepts related to cultural anthropology and religious beliefs.","priority":"★★★"},"example_sentences":[{"sentence":"Many indigenous cultures include **animists** who believe in the spirits of nature.","translation":"多くの先住民族文化には、自然の霊を信じるアニミストが含まれている。","type":"general"},{"sentence":"Some **animists** perform rituals to honor the spirits of their ancestors.","translation":"先祖の霊を敬う儀式を行うアニミストもいる。","type":"cultural"},{"sentence":"Modern **animists** often combine traditional beliefs with contemporary spiritual practices.","translation":"現代のアニミストは、伝統的な信仰と現代的な精神修養を組み合わせることが多い。","type":"modern"},{"sentence":"The anthropologist studied the practices of the local **animists**.","translation":"人類学者は、地元ののアニミストの慣習を研究した。","type":"academic"}]}