{"word":"elatives","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(文法)最上級に似た意味を持つが、必ずしも比較を伴わない語形や表現。非常に高い程度や性質を表す。","english_definition":"(grammar) A word form or expression similar to a superlative, but not necessarily involving comparison; expressing a very high degree or quality.","examples":[{"sentence":"'Very good' can be considered an elative.","translation":"「とても良い」は、叙述的用法とみなすことができる。"},{"sentence":"Some languages have specific morphological elative forms.","translation":"いくつかの言語には、特定の形態的叙述的用法がある。"}],"collocations":["morphological elative","semantic elative"],"synonyms":["superlative (loosely)","intensive"],"antonyms":["comparative","positive (degree)"]},{"part_of_speech":"noun","definition":"(まれ) 優れたもの、最上のもの。","english_definition":"(rare) Something excellent or of the highest quality.","examples":[{"sentence":"This wine is among the elatives of the vintage.","translation":"このワインは、その年の最高のもののひとつだ。"}],"collocations":[],"synonyms":["best","finest","superior"],"antonyms":["worst","inferior"]}],"etymology":{"value":"Derived from 'elate,' meaning to raise or lift up, suggesting a high degree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛlətɪvz/","syllables":"el-a-tives"},"inflection":{"noun_plural":"elatives"},"usage_notes":{"explanation":"In grammar, 'elatives' refer to words or constructions that express a high degree of something without necessarily comparing it to anything else. While similar to superlatives, elatives don't always imply a direct comparison. For example, 'very good' is elative because it indicates a high degree of goodness, but it doesn't say that something is 'the best.' Some languages have specific grammatical forms for elatives, while in English, we often use adverbs like 'very,' 'extremely,' or 'highly' to create elative effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the elative of all students.","correct":"✓ He is the best of all students.","note":"'Elative' is not a direct substitute for 'best' or 'superlative' in comparative sentences. Use 'best' or 'superlative' when a direct comparison is intended."}],"priority":"★★☆"},"related_words":{"derivatives":["elative (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Elatives' is a term primarily used in advanced grammatical discussions. It refers to words or phrases that express a high degree of a quality without necessarily making a direct comparison. Understanding 'elatives' requires a solid grasp of grammatical concepts like superlatives and intensifiers. The term is more common in linguistic analysis than in everyday conversation."},"example_sentences":[{"sentence":"The professor discussed the use of elatives in ancient languages.","translation":"教授は古代言語における叙述的用法の使用について議論した。","type":"noun","meaning_category":"grammar"},{"sentence":"The critic described the performance as elative, praising its intensity.","translation":"評論家はその演奏を叙述的だと評し、その激しさを称賛した。","type":"adjective","meaning_category":"grammar"},{"sentence":"The chef used only elative spices to create the dish.","translation":"シェフはその料理を作るために、最高のスパイスだけを使った。","type":"adjective","meaning_category":"high quality"}]}