{"word":"nonvagrancies","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The state or condition of not being vagrant; the absence of vagrancy.","english_definition":"The absence of vagrancy; the condition of not being a vagrant.","examples":[{"sentence":"The city aimed to reduce vagrancy and promote nonvagrancies through social programs.","translation":"市は社会プログラムを通じて、浮浪を減らし、非浮浪状態を促進することを目指した。"}],"synonyms":["stability","settledness","permanence","residency"],"antonyms":["vagrancy","homelessness","transience","nomadism"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'vagrancy'. 'Vagrancy' itself comes from 'vagrant', which is derived from the Latin 'vagari' meaning 'to wander'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˈveɪɡrənsiz/","syllables":"non-va-gran-cies"},"inflection":{"noun_plural":"nonvagrancies"},"usage_notes":{"explanation":"'Nonvagrancies' is a relatively rare and formal term. It is primarily used in legal, sociological, or academic contexts when discussing efforts to combat or prevent vagrancy. It emphasizes the positive state of being settled and not wandering.","priority":"Low"},"common_mistakes":{"examples":[{"incorrect":"The nonvagrancy of the birds was surprising.","correct":"The sedentary nature of the birds was surprising.","note":"'Nonvagrancy' is typically used in reference to humans, not animals. Use 'sedentary' or other appropriate terms for animals."}],"priority":"Low"},"related_words":{"derivatives":["nonvagrant (adjective, noun)"],"related_terms":["vagrancy","vagrant","settled","resident"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Nonvagrancies' is a complex term generally used in formal or academic contexts. It refers to the state of not being vagrant, which means not wandering from place to place without a home or job. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The government implemented policies to encourage nonvagrancies among the unemployed.","translation":"政府は失業者間の非浮浪状態を奨励するための政策を実施した。","type":"general","meaning_category":"Absence of vagrancy"},{"sentence":"The study examined the factors contributing to both vagrancy and nonvagrancies in urban areas.","translation":"この研究では、都市部における浮浪と非浮浪状態の両方に寄与する要因を調査した。","type":"academic","meaning_category":"Absence of vagrancy"}]}