{"word":"monoracial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一民族の、単一人種の","english_definition":"Consisting of or relating to only one race.","examples":[{"sentence":"The study focused on monoracial individuals to avoid confounding factors.","translation":"その研究は、交絡因子を避けるために単一民族の個人に焦点を当てた。"},{"sentence":"Historically, some societies have promoted the idea of a monoracial nation.","translation":"歴史的に、一部の社会は単一民族国家という考えを推進してきた。"}],"collocations":["monoracial identity","monoracial background","monoracial population","monoracial society"],"synonyms":["single-race","uniethnic"],"antonyms":["multiracial","biracial","mixed-race"]}],"etymology":{"value":"The word \"monoracial\" is formed by combining the prefix \"mono-\" (meaning \"one\" or \"single\") with the word \"racial\" (relating to race).","priority":"★★☆"},"pronunciation":{"ipa":"ˌmɒnəˈreɪʃəl/","syllables":"mon-o-ra-cial"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more monoracial' and 'most monoracial', respectively."},"usage_notes":{"explanation":"\"Monoracial\" is used to describe individuals or groups who identify with or are composed of only one racial background. It is often used in contrast to \"multiracial\" or \"biracial,\" which describe individuals with multiple racial backgrounds. The term is commonly used in sociological, anthropological, and genetic studies to categorize populations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a monoracial of Japanese.","correct":"✓ She is monoracial and of Japanese descent.","note":"\"Monoracial\" is an adjective describing the racial composition, not a noun referring to a person. You would say someone is 'monoracial' and then specify their race, or that they are 'of monoracial Japanese descent'."},{"incorrect":"✗ Monoracial people are all the same.","correct":"✓ Monoracial people can have diverse experiences and backgrounds within their race.","note":"Avoid generalizations about monoracial groups, as individuals within any race can have vastly different experiences, cultures, and backgrounds."}],"priority":"★★☆"},"related_words":{"derivatives":["monoracism (noun): the belief that one race is superior to others; discrimination based on race.","monoethnic (adjective): similar to monoracial, emphasizing a single ethnicity."],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"monoracial\" is a formal term used to describe someone who belongs to a single racial group. It's often used in academic or sociological contexts when discussing race and identity. Understanding this word helps in discussions about diversity, identity, and race relations, especially when contrasting it with terms like 'multiracial' or 'biracial'."},"example_sentences":[{"sentence":"The survey aimed to collect data specifically from monoracial participants.","translation":"その調査は、特に単一民族の参加者からデータを収集することを目的としていた。","type":"general","meaning_category":"single race"},{"sentence":"She identifies as monoracial African American.","translation":"彼女は単一民族のアフリカ系アメリカ人であると認識している。","type":"identity","meaning_category":"single race"},{"sentence":"Genetic studies sometimes focus on monoracial populations to simplify analysis.","translation":"遺伝子研究では、分析を単純化するために単一民族の集団に焦点を当てることがある。","type":"scientific","meaning_category":"single race"}]}