{"word":"vocalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"母音主義、母音中心主義","english_definition":"The use of vowels as the primary or sole means of communication or expression.","examples":[{"sentence":"The language relies heavily on vocalism for conveying meaning.","translation":"その言語は意味を伝えるために、母音主義に大きく依存している。"},{"sentence":"The artist explored vocalism in their performance, focusing on the sound and texture of vowels.","translation":"そのアーティストはパフォーマンスで母音主義を探求し、母音の音と質感に焦点を当てた。"}],"collocations":["vocalism in language","artistic vocalism","experimental vocalism"],"synonyms":["vowelism","vowel harmony","phonetic vowel system"],"antonyms":["consonantism"]},{"part_of_speech":"noun","definition":"（言語学における）母音の変化または使用","english_definition":"A vowel change or the use of vowels in a language.","examples":[{"sentence":"The vocalism of Old English differs significantly from that of Modern English.","translation":"古英語の母音体系は、現代英語の母音体系とは大きく異なる。"},{"sentence":"This dialect exhibits a unique vocalism compared to the standard language.","translation":"この方言は、標準語と比較して独特の母音体系を示す。"}],"collocations":["historical vocalism","dialectal vocalism","vocalism of a language"],"synonyms":["vowel system","vowel phonology","vowel inventory"],"antonyms":["consonantal system"]}],"etymology":{"value":"From 'vocal' + '-ism'. 'Vocal' derives from Latin 'vocalis', meaning 'uttering a distinct sound, speaking, having a voice'. The suffix '-ism' denotes a principle, practice, or system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvoʊkəlɪzəm/","syllables":"vo-cal-ism"},"inflection":{"noun_plural":"vocalisms"},"usage_notes":{"explanation":"'Vocalism' refers to the emphasis or reliance on vowels, either in a general sense of using vocal sounds or specifically in the context of linguistic vowel systems. It can also describe artistic expressions that prioritize vowel sounds. The term is relatively uncommon outside of linguistics and specialized artistic discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The singer's vocalism was impressive.","correct":"The singer's vocals were impressive.","note":"'Vocalism' refers to the system or use of vowels, not the quality of singing. Use 'vocals' to describe singing ability."}],"priority":"★★☆"},"related_words":{"derivatives":["vocalic","vocalist","vocalize"],"related_terms":["vowel","phoneme","phonology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vocalism' is a technical term primarily used in linguistics and sometimes in artistic contexts. It refers to the system or use of vowels in a language or the emphasis on vowel sounds in artistic expression. Understanding this term requires familiarity with linguistic concepts or specialized knowledge of artistic techniques. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study of vocalism in ancient languages helps us understand their pronunciation.","translation":"古代言語における母音体系の研究は、その発音を理解するのに役立つ。","type":"noun","meaning_category":"Linguistics"},{"sentence":"Her performance explored the possibilities of vocalism, creating a unique soundscape.","translation":"彼女のパフォーマンスは母音主義の可能性を探求し、ユニークな音風景を作り出した。","type":"noun","meaning_category":"Artistic Expression"}]}