{"word":"FCCSET","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Acronym for the Federal Coordinating Council for Science, Engineering, and Technology. A former council in the United States government.","english_definition":"An acronym for the Federal Coordinating Council for Science, Engineering, and Technology. A former council in the United States government.","examples":[{"sentence":"The FCCSET played a key role in coordinating federal research and development efforts.","translation":"FCCSETは、連邦政府の研究開発努力を調整する上で重要な役割を果たしました。"}],"collocations":["established by","recommendations of","report by"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym derived from the initial letters of the Federal Coordinating Council for Science, Engineering, and Technology.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɛfˌsiːˌsiːˈsɛt/","syllables":"ef-cee-cee-set"},"inflection":{"noun_plural":"FCCSETs"},"usage_notes":{"explanation":"FCCSET was an interagency committee that coordinated science and technology policy across the U.S. federal government. It is now defunct, having been replaced by other structures.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_organizations":["National Science and Technology Council (NSTC)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency due to its specific and historical context.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'FCCSET' is highly specialized and primarily used in discussions related to U.S. government science and technology policy during the period it was active. Understanding its meaning requires familiarity with the structure of the U.S. federal government and its approach to coordinating scientific research."},"example_sentences":[{"sentence":"The Clinton administration relied on the FCCSET to guide its investments in emerging technologies.","translation":"クリントン政権は、新興技術への投資を導くためにFCCSETに依存していました。","type":"noun","meaning_category":"Government Council"},{"sentence":"The FCCSET report outlined several key recommendations for improving STEM education.","translation":"FCCSETの報告書は、STEM教育を改善するためのいくつかの重要な提言を概説しました。","type":"noun","meaning_category":"Government Council"}]}