{"word":"Slovenwood","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Slang) A nickname for the Slovenian film industry, or films produced in Slovenia.","english_definition":"(Slang) A nickname for the Slovenian film industry, or films produced in Slovenia, playing on the name 'Hollywood'.","examples":[{"sentence":"I'm interested in seeing more films from Slovenwood.","translation":"スロヴェンウッドの映画をもっと見てみたいです。"},{"sentence":"Slovenwood is starting to gain international recognition.","translation":"スロヴェンウッドは国際的な評価を得始めています。"}],"collocations":["Slovenian film","Slovenian cinema"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'Slovenia' and 'Hollywood'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsloʊvənwʊd/","syllables":"Slo-ven-wood"},"inflection":{"noun_plural":"N/A"},"usage_notes":{"explanation":"'Slovenwood' is an informal and relatively recent term. It is primarily used in discussions about Slovenian cinema, often with a sense of irony or affection. It is not a widely recognized term outside of film circles or those familiar with Slovenian culture.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Slovenian","Hollywood"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Slovenwood' is a niche slang term, primarily used within film communities or those familiar with Slovenian culture. Understanding requires knowledge of both 'Slovenia' and 'Hollywood' and the concept of portmanteau words. Its usage is infrequent in general conversation."},"example_sentences":[{"sentence":"The director hopes to bring more attention to Slovenwood with his latest film.","translation":"監督は最新作でスロヴェンウッドにもっと注目を集めたいと考えています。","type":"noun","meaning_category":"Slovenian film industry"},{"sentence":"Critics are starting to recognize the unique style of Slovenwood productions.","translation":"批評家たちはスロヴェンウッド作品の独特なスタイルを認識し始めています。","type":"noun","meaning_category":"Slovenian film industry"}]}