{"word":"dividedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"意見が分かれて、賛否両論で、分裂して","english_definition":"In a way that shows disagreement or separation; with divided opinions or feelings.","examples":[{"sentence":"The issue was discussed dividedly among the committee members.","translation":"その問題は委員の間で意見が分かれて議論された。"},{"sentence":"The critics reviewed the film dividedly, with some praising it and others condemning it.","translation":"批評家たちはその映画を賛否両論で評価し、賞賛する者もいれば非難する者もいた。"}],"collocations":["discuss something dividedly","review something dividedly","feel dividedly about something"],"synonyms":["controversially","disagreeingly","separately"],"antonyms":["unanimously","agreeably","unitedly"]}],"etymology":{"value":"Derived from the adjective 'divided' by adding the suffix '-ly'. 'Divided' comes from the verb 'divide', which originates from Latin 'dividere' (to separate, part).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvaɪdɪdlɪ/","syllables":"di-vid-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Dividedly' is used to describe actions or situations where there is a lack of agreement or unity. It emphasizes the presence of opposing viewpoints or a split in opinion. It is not a very common word, and its use can sometimes sound formal or slightly awkward.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The team worked dividedly on the project.","correct":"✓ The team worked separately on the project. / ✓ The team was divided on the project.","note":"'Dividedly' usually refers to opinions or feelings, not physical separation in work. Use 'separately' or rephrase to indicate disagreement."},{"incorrect":"✗ She felt dividedly happy about the news.","correct":"✓ She felt ambivalent about the news. / ✓ She had mixed feelings about the news.","note":"'Dividedly' is not commonly used to describe personal feelings. Use 'ambivalent' or 'mixed feelings' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["divide (verb, noun)","divided (adjective)","division (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dividedly' is an adverb that describes something done in a way that shows disagreement or separation. It's not a common word, so you'll mostly find it in formal writing or discussions where people have very different opinions. It's related to the words 'divide' and 'divided', which you may already know. If you want to say that people disagree about something, using 'dividedly' can be a precise way to express that."},"example_sentences":[{"sentence":"The board members voted dividedly on the proposal, resulting in a tie.","translation":"取締役たちは提案に対して意見が分かれて投票し、結果は同点となった。","type":"adverb","meaning_category":"意見が分かれて"},{"sentence":"The critics responded dividedly to the author's new book, with some praising its originality and others criticizing its complexity.","translation":"批評家たちはその作家の新しい本に対して賛否両論の反応を示し、独創性を賞賛する者もいれば複雑さを批判する者もいた。","type":"adverb","meaning_category":"賛否両論で"}]}