{"word":"Venereophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"性病恐怖症、性病に対する病的な恐怖","english_definition":"An irrational fear of contracting a sexually transmitted infection (STI) or venereal disease.","examples":[{"sentence":"His venereophobia made it difficult for him to form intimate relationships.","translation":"彼の性病恐怖症は、親密な関係を築くことを困難にした。"},{"sentence":"She sought therapy to overcome her venereophobia.","translation":"彼女は性病恐怖症を克服するためにセラピーを受けた。"}],"collocations":["suffer from venereophobia","overcome venereophobia","treat venereophobia"],"synonyms":["STI phobia","sexually transmitted disease phobia"],"antonyms":[]}],"etymology":{"value":"The word \"venereophobia\" comes from the Latin word \"venereus\" (relating to Venus, the goddess of love, and thus to sexual love or venereal disease) + \"phobia\" (fear).","priority":"★★☆"},"pronunciation":{"ipa":"/vɪˌnɪəriəˈfoʊbiə/","syllables":"vi-ne-re-o-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Venereophobia is a specific phobia characterized by excessive anxiety and fear about contracting sexually transmitted infections (STIs). It can manifest as compulsive behaviors such as excessive handwashing, avoiding physical contact, and repeatedly seeking medical tests despite negative results. It is considered a mental health condition that may require therapy or counseling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a venereophobic.","correct":"✓ He has venereophobia.","note":"Venereophobia is the condition itself, not a person. A person who has it could be described as 'having venereophobia' or, informally, 'venereophobic' (though this is less common)."},{"incorrect":"✗ Venereophobia is a disease.","correct":"✓ Venereophobia is a phobia.","note":"Venereophobia is a phobia, which is a type of anxiety disorder, not a disease itself."}],"priority":"★★☆"},"related_words":{"derivatives":["venereal (adjective: relating to or transmitted by sexual contact)","phobia (noun: persistent, excessive, unrealistic fear of an object, person, animal, activity or situation)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Venereophobia\" is a specialized term referring to an intense and irrational fear of contracting sexually transmitted infections (STIs). It is derived from Latin roots and is primarily used in medical or psychological contexts. Understanding this term requires a familiarity with medical terminology and the concept of phobias as anxiety disorders. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The psychologist diagnosed him with venereophobia after he expressed extreme anxiety about STIs despite consistent negative test results.","translation":"心理学者は、彼が継続的な陰性検査結果にもかかわらず、性感染症について極度の不安を表明した後、彼を性病恐怖症と診断した。","type":"noun","meaning_category":"性病恐怖症"}]}