{"word":"LCC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"格安航空会社 (Low-Cost Carrier)","english_definition":"Low-Cost Carrier; an airline that offers low fares in exchange for eliminating many traditional passenger services.","examples":[{"sentence":"LCCs have become increasingly popular in recent years.","translation":"近年、格安航空会社はますます人気が高まっています。"},{"sentence":"Many travelers choose LCCs to save money on flights.","translation":"多くの旅行者は、航空券の費用を節約するために格安航空会社を選びます。"}],"collocations":["fly with an LCC","LCC flight","budget airline"],"synonyms":["low-cost airline","budget carrier"],"antonyms":["full-service carrier"]}],"etymology":{"value":"An abbreviation of 'Low-Cost Carrier'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛlˌsiːˈsiː/","syllables":"el-see-see"},"inflection":{"notes":"Plural form is LCCs."},"usage_notes":{"explanation":"LCC stands for Low-Cost Carrier. These airlines typically offer lower fares by cutting out amenities such as complimentary meals, checked baggage allowance, and seat selection. Passengers often pay extra for these services. LCCs can be a cost-effective option for travelers willing to forgo certain comforts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I flew with a low cost company.","correct":"✓ I flew with a low-cost carrier. / ✓ I flew with an LCC.","note":"While 'low cost company' might be understood, 'low-cost carrier' or 'LCC' are the standard terms for this type of airline."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["full-service carrier","budget travel","no-frills airline"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderate","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'LCC' is an abbreviation for 'Low-Cost Carrier,' which refers to an airline that offers cheaper tickets by reducing or eliminating traditional passenger services. This term is commonly used in the travel industry and is understood by people who frequently travel or follow travel news. To understand the term fully, one should be aware of the typical features of LCCs, such as extra charges for baggage and meals, and the trade-offs between cost and comfort when choosing an airline."},"example_sentences":[{"sentence":"The rise of LCCs has made air travel more accessible to a wider range of people.","translation":"格安航空会社の台頭により、より多くの人々が飛行機旅行を利用しやすくなりました。","type":"general","meaning_category":"general"},{"sentence":"Many LCCs operate from smaller, regional airports to reduce costs.","translation":"多くの格安航空会社は、コスト削減のため、より小規模な地方空港から運航しています。","type":"operational","meaning_category":"business model"},{"sentence":"When flying with an LCC, be sure to check the baggage allowance carefully.","translation":"格安航空会社を利用する際は、手荷物許容量をよく確認してください。","type":"practical","meaning_category":"travel tips"}]}