{"word":"indexed-color","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インデックスカラー (indexed color)","english_definition":"A technique to manage digital images' colors in a limited fashion, by storing only a set of color indices in the image file. These indices reference a color map (palette) which stores the actual color values.","examples":[{"sentence":"Indexed-color images are often used to reduce file size.","translation":"インデックスカラー画像は、ファイルサイズを削減するためによく使用されます。"},{"sentence":"The GIF format uses indexed color.","translation":"GIF形式はインデックスカラーを使用します。"}],"collocations":["indexed color image","color palette","color depth"],"synonyms":["palette color","color lookup table (CLUT)"],"antonyms":["true color","direct color"]}],"etymology":{"value":"The term 'indexed-color' comes from the concept of using an 'index' (a numerical reference) to point to a specific color in a 'color table' or 'palette'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪndɛkst ˈkʌlər/","syllables":"in-dexed-col-or"},"inflection":{"notes":"This is a noun, so it has a plural form: indexed-colors."},"usage_notes":{"explanation":"Indexed color is a method used in digital images to reduce the amount of data needed to represent the image. Instead of storing the full color information for each pixel, the image stores an index number that corresponds to a color in a color palette. This is particularly useful for images with a limited number of colors, such as logos, icons, and simple graphics. The number of colors in the palette is limited by the color depth (e.g., 256 colors for an 8-bit indexed image).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The photo is indexed color.","correct":"✓ The photo uses indexed color.","note":"'Indexed color' is a technique, not a property of the photo itself. So it's better to say the photo 'uses' indexed color."},{"incorrect":"✗ Indexed color is better than true color.","correct":"✓ Indexed color is suitable for images with few colors, while true color is better for photographs.","note":"Indexed color is not inherently 'better' or 'worse' than true color. It depends on the image type and the desired file size. True color provides a wider range of colors but results in larger file sizes."}],"priority":"★★☆"},"related_words":{"derivatives":["index","color","palette","colormap","pixel","dithering"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Indexed color' is a technical term related to digital image processing. It describes a method where an image uses a limited set of colors, typically 256 or fewer. Instead of storing the full color value for each pixel, the image stores an index number that refers to a specific color in a 'palette' or 'color lookup table'. This technique is useful for reducing file size, especially for images with simple graphics or limited color variations. Understanding indexed color is helpful when working with image formats like GIF or when optimizing images for web use."},"example_sentences":[{"sentence":"The image was saved using indexed color to reduce its file size.","translation":"画像のファイルサイズを削減するために、インデックスカラーを使用して保存されました。","type":"general","meaning_category":"File size reduction"},{"sentence":"The GIF format is limited to 256 colors due to its use of indexed color.","translation":"GIF形式は、インデックスカラーを使用しているため、256色に制限されています。","type":"technical","meaning_category":"GIF format limitation"},{"sentence":"Dithering can be used to simulate more colors in an indexed color image.","translation":"ディザリングは、インデックスカラー画像でより多くの色をシミュレートするために使用できます。","type":"technical","meaning_category":"Dithering technique"}]}