{"word":"plushly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"豪華に、ぜいたくに、けばけばしく","english_definition":"In a luxurious, extravagant, or ostentatious manner; richly and opulently.","examples":[{"sentence":"The hotel room was plushly decorated with velvet drapes and antique furniture.","translation":"ホテルの部屋は、ベルベットのドレープとアンティーク家具で豪華に飾られていた。"},{"sentence":"She plushly furnished her apartment, sparing no expense on designer items.","translation":"彼女はデザイナーズアイテムにお金を惜しまず、アパートを贅沢に飾り付けた。"},{"sentence":"The celebrity arrived at the event plushly dressed in a designer gown.","translation":"その有名人は、デザイナーのガウンを豪華に着飾ってイベントに到着した。"}],"collocations":["plushly decorated","plushly furnished","plushly appointed","plushly dressed"],"synonyms":["luxuriously","opulently","sumptuously","lavishly","richly","extravagantly"],"antonyms":["sparsely","plainly","simply","austerely"]}],"etymology":{"value":"Derived from the adjective 'plush' (meaning luxurious or richly textured), with the addition of the adverbial suffix '-ly'. The word 'plush' itself likely originates from the French 'peluche', referring to a shaggy fabric.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʌʃli/","syllables":"plush-ly"},"inflection":{"notes":"Adverb; no inflection."},"usage_notes":{"explanation":"'Plushly' describes actions or states characterized by luxury, extravagance, and richness. It often implies a high level of comfort and expense. The word is relatively uncommon in everyday conversation but is used in descriptive writing to convey a sense of opulence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cat sat plushly on the mat.","correct":"✓ The cat sat comfortably on the mat.","note":"'Plushly' describes the manner of decoration or furnishing, not the manner of sitting. Use 'comfortably' instead."},{"incorrect":"✗ She felt plushly after the spa treatment.","correct":"✓ She felt relaxed/pampered after the spa treatment.","note":"'Plushly' describes the environment or objects, not feelings. Use 'relaxed' or 'pampered' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["plush (adjective: luxurious, richly textured; noun: a fabric with a soft, thick pile)","plushness (noun: the quality of being plush)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plushly' is an adverb that means 'in a luxurious or extravagant way.' It's used to describe something that is richly decorated or furnished, suggesting a high level of comfort and expense. This word is not commonly used in everyday conversation and is more often found in descriptive writing to create a sense of opulence or richness. For example, 'The hotel room was plushly decorated' means the room was decorated in a very luxurious and expensive manner."},"example_sentences":[{"sentence":"The theater was plushly furnished with velvet seats and gilded decorations.","translation":"劇場は、ベルベットの座席と金色の装飾で豪華に飾られていた。","type":"descriptive","meaning_category":"luxurious decoration"},{"sentence":"The magazine described her lifestyle as being plushly extravagant.","translation":"その雑誌は、彼女のライフスタイルを豪華で贅沢だと表現した。","type":"descriptive","meaning_category":"extravagant lifestyle"},{"sentence":"The restaurant was plushly appointed, with crystal chandeliers and fine linens.","translation":"そのレストランは、クリスタルのシャンデリアと上質なリネンで豪華に飾られていた。","type":"descriptive","meaning_category":"luxurious setting"}]}