{"word":"henter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Internet) A person who creates or enjoys hentai.","english_definition":"A person who creates or enjoys hentai.","examples":[{"sentence":"He's known as a prolific henter in the online community.","translation":"彼はオンラインコミュニティで多作なヘンターとして知られています。"}],"collocations":["prolific henter","avid henter"],"synonyms":["hentai artist","hentai enthusiast"],"antonyms":[]}],"etymology":{"value":"Derived from 'hentai', a Japanese term for perverted or abnormal, used to refer to pornographic anime or manga.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛntər/","syllables":"hen-ter"},"inflection":{"noun_plural":"henters"},"usage_notes":{"explanation":"The term 'henter' is slang and primarily used within internet communities to refer to individuals involved with hentai. It can be used to describe both creators and consumers of this type of content. The term can sometimes carry a negative connotation depending on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a henter of classical music.","correct":"✓ He is a fan of classical music.","note":"'Henter' specifically refers to someone involved with hentai, not just any type of interest."}],"priority":"★★☆"},"related_words":{"derivatives":["hentai"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Henter' is a slang term primarily used within specific online communities. Understanding requires familiarity with internet culture and the term 'hentai'. Due to its niche usage and potentially offensive connotations, it is not a word commonly encountered in general English conversation."},"example_sentences":[{"sentence":"The forum is full of discussions among henters about their favorite artists.","translation":"そのフォーラムは、ヘンターたちが好きなアーティストについて議論する場となっています。","type":"noun","meaning_category":"person involved with hentai"}]}