{"word":"Ctenoidei","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スズキ亜目","english_definition":"A taxonomic suborder of ray-finned fishes within the order Perciformes (perch-like fishes), characterized by having ctenoid scales.","examples":[{"sentence":"Many commercially important fish belong to the Ctenoidei suborder.","translation":"多くの商業的に重要な魚がスズキ亜目に属しています。"}],"collocations":[],"synonyms":["Acanthopterygii (historical usage)"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek κτείς (kteís, “comb”) + -οειδής (-oeidḗs, “-oid”, “having the form or appearance of”). Refers to the comb-like (ctenoid) scales that characterize many fish in this group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛnɔɪˈdiːaɪ/","syllables":"Cte-noi-de-i"},"inflection":{"noun_plural":"Ctenoidei (often treated as a plural already)"},"usage_notes":{"explanation":"'Ctenoidei' is a scientific term used in the classification of fish. It is a suborder within the larger order Perciformes. The defining characteristic is the presence of ctenoid scales, which have a comb-like structure on their exposed edge. This suborder includes a vast number of fish species, many of which are familiar and commercially important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ctenoidei is a type of scale.","correct":"✓ Ctenoidei is a suborder of fish characterized by ctenoid scales.","note":"Ctenoidei refers to the group of fish, not the scales themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["ctenoid (adjective/noun)"],"phrasal_verbs":[],"related_terms":["Perciformes","Acanthopterygii","Teleostei"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ctenoidei' is a technical term used in ichthyology (the study of fish) to classify a specific group of ray-finned fishes. Understanding this term requires familiarity with biological classification systems and some knowledge of fish anatomy, specifically the structure of scales. It is not a term commonly encountered outside of scientific literature or specialized contexts.","requires_background":"Requires background in biology, specifically fish anatomy and taxonomy."},"example_sentences":[{"sentence":"The evolutionary success of the Ctenoidei is partly attributed to their specialized jaw structures.","translation":"スズキ亜目の進化的成功は、部分的には彼らの特殊化された顎の構造に起因しています。","type":"scientific","meaning_category":"classification"},{"sentence":"Ctenoidei fish exhibit a wide range of body shapes and sizes, adapted to various aquatic environments.","translation":"スズキ亜目の魚は、様々な水生環境に適応した、幅広い体型とサイズを示します。","type":"scientific","meaning_category":"characteristics"}]}