{"word":"commutatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"交換法則に従って、可換的に","english_definition":"In a commutative manner; in accordance with the commutative property.","examples":[{"sentence":"The operators must act commutatively to ensure the correct result.","translation":"正しい結果を保証するためには、演算子は可換的に作用しなければならない。"},{"sentence":"The variables can be multiplied commutatively.","translation":"変数は可換的に乗算できる。"}],"collocations":["act commutatively","multiply commutatively","add commutatively"],"synonyms":["interchangeably","reversibly"],"antonyms":["non-commutatively"]}],"etymology":{"value":"\"Commutative\" + \"-ly\". \"Commutative\" comes from the Latin \"commutare\" (to exchange).","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈmjuːtətɪvli/","syllables":"com-mu-ta-tive-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Commutatively\" describes how operations or actions can be performed while still adhering to the commutative property. This property states that the order of the operands does not affect the result. It is most commonly used in mathematics, physics, and computer science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The process is commutatively, so the order doesn't matter.","correct":"✓ The process is commutative, so the order doesn't matter.","note":"Use the adjective \"commutative\" to describe the process itself, not the adverb \"commutatively.\""}],"priority":"★★☆"},"related_words":{"derivatives":["commutative (adjective)","commutativity (noun)","commute (verb)","commutation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"commutatively\" is an adverb used to describe actions that follow the commutative property. This property is a mathematical principle that states that the order of operations does not change the result. This term is primarily used in technical or academic contexts, specifically in mathematics, physics, and computer science. Understanding the base word \"commutative\" is essential before using \"commutatively.\""},"example_sentences":[{"sentence":"The matrices must be multiplied commutatively to obtain the correct transformation.","translation":"正しい変換を得るためには、行列は可換的に乗算されなければならない。","type":"adverb","meaning_category":"可換的に"},{"sentence":"The addition of real numbers can be done commutatively.","translation":"実数の加算は可換的に行うことができる。","type":"adverb","meaning_category":"可換的に"}]}