{"word":"Knapping","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"石器製作技術、打製石器製作","english_definition":"The shaping of flint, chert, obsidian or other conchoidal fracturing stone through percussion or pressure to manufacture tools, weapons, or flakes to be used as tools or weapons.","examples":[{"sentence":"Knapping is an ancient technology used to create sharp tools.","translation":"石器製作は、鋭利な道具を作るために使われた古代の技術です。"},{"sentence":"He demonstrated the art of knapping using obsidian.","translation":"彼は黒曜石を使った石器製作の技術を実演しました。"}],"collocations":["Flint knapping","Obsidian knapping","Stone knapping","Pressure flaking","Percussion flaking"],"synonyms":["Flintknapping","Lithic reduction","Stone tool manufacturing"],"antonyms":[]},{"part_of_speech":"verb","definition":"(石などを) 打ち欠いて成形する","english_definition":"To shape (flint, etc.) by striking or pressure.","examples":[{"sentence":"He is knapping a flint arrowhead.","translation":"彼はフリントの矢じりを打ち欠いて成形している。"},{"sentence":"She learned to knap stone tools from an expert.","translation":"彼女は専門家から石器を打ち欠いて成形する方法を学びました。"}],"collocations":["Knap flint","Knap stone","Knap obsidian","Knap an arrowhead","Knap a tool"],"synonyms":["Flake","Chip","Shape","Fashion"],"antonyms":[]}],"etymology":{"value":"Derived from the Middle English word \"knappe,\" meaning to strike or break.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnæpɪŋ/","syllables":"knap-ping"},"inflection":{"verb_forms":{"present_simple":["knap","knaps"],"past_simple":"knapped","past_participle":"knapped","present_participle":"knapping"},"noun_plural":"knappings"},"usage_notes":{"explanation":"'Knapping' refers to the process of shaping stone, especially flint or obsidian, by striking it with a tool or applying pressure to remove flakes. This technique was crucial for creating tools and weapons in prehistoric times. As a noun, it refers to the activity or skill itself; as a verb, it describes the action of shaping the stone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is nipping the stone.","correct":"✓ He is knapping the stone.","note":"'Nipping' means to pinch or bite lightly, while 'knapping' specifically refers to shaping stone by striking or pressure. Use 'knapping' when referring to stone tool creation."},{"incorrect":"✗ Knapping is easy to learn.","correct":"✓ Knapping is challenging to learn.","note":"While some may find it easy, knapping generally requires skill and practice. Therefore, stating it is 'challenging' is more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["Knapper (noun: A person who knaps stone)","Flake (noun: A piece of stone removed during knapping)","Core (noun: The remaining stone after flakes are removed)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'knapping' is a specialized term related to archaeology and historical crafts. It describes the process of shaping stones like flint or obsidian by striking or pressing off flakes to create tools or weapons. Understanding this term requires some familiarity with prehistoric technologies and stone tool manufacturing techniques. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The archaeologist studied the knapping techniques used by early humans.","translation":"考古学者は、初期の人類が使用した石器製作技術を研究しました。","type":"noun","meaning_category":"石器製作技術"},{"sentence":"She is knapping a replica of a Clovis point.","translation":"彼女はクローヴィス尖頭器のレプリカを打ち欠いて成形しています。","type":"verb","meaning_category":"(石などを) 打ち欠いて成形する"}]}