{"word":"suavastika","priority":"低","meanings":[{"part_of_speech":"noun","definition":"卍（まんじ）。鉤十字（かぎじゅうじ）。古代から様々な文化で使用されてきたシンボルで、通常は正十字の腕が直角に曲がった形をしている。右回りのもの（卐）と左回りのもの（卍）がある。","english_definition":"A swastika is an ancient religious symbol, usually in the form of a cross with its arms bent at right angles. It has been used in various cultures throughout history. There are both right-facing (卐) and left-facing (卍) versions.","examples":[{"sentence":"The swastika has a long history as a religious symbol in Hinduism, Buddhism, and Jainism.","translation":"卍はヒンドゥー教、仏教、ジャイナ教において、宗教的なシンボルとして長い歴史を持っています。"},{"sentence":"Unfortunately, the swastika is now strongly associated with Nazism and hate.","translation":"残念ながら、卍は現在、ナチズムと憎悪と強く結び付けられています。"}],"collocations":["ancient swastika (古代の卍)","Nazi swastika (ナチスの卍)","religious swastika (宗教的な卍)"],"synonyms":["hooked cross","fylfot","gammadion"],"antonyms":[]},{"part_of_speech":"symbol","definition":"（シンボルとして）卍。特にナチス・ドイツの象徴として用いられたもの。","english_definition":"(As a symbol) the swastika, especially as used as the emblem of Nazi Germany.","examples":[{"sentence":"The swastika became a symbol of hate and oppression during World War II.","translation":"第二次世界大戦中、卍は憎悪と抑圧の象徴となりました。"},{"sentence":"The display of swastikas is illegal in some countries.","translation":"一部の国では、卍の表示は違法です。"}],"collocations":["Nazi swastika (ナチスの卍)","display of swastikas (卍の表示)"],"synonyms":["Nazi symbol","symbol of hate"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の「svastika」（स्वस्तिक）に由来し、「幸運をもたらすもの」または「良い状態にあるもの」を意味する。「su-」（良い）+「asti」（存在）+「-ka」（接尾辞）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswɑːstɪkə/","syllables":"swa-sti-ka"},"inflection":{"notes":"名詞なので、複数形は\"swastikas\""},"usage_notes":{"explanation":"「**suavastika**」は、古代から様々な文化で使用されてきたシンボルですが、現代では特にナチス・ドイツの象徴として知られています。そのため、使用する際には非常に慎重な配慮が必要です。本来は幸運や繁栄を意味するシンボルでしたが、ナチズムとの関連から、憎悪や差別の象徴と見なされることが多くなっています。学術的な文脈や歴史的な議論を除き、不用意な使用は避けるべきです。右回りの卍（卐）と左回りの卍（卍）があり、文化や宗教によって意味が異なる場合があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The swastika is a symbol of peace.","correct":"✓ The swastika was originally a symbol of peace, but it is now associated with hate.","note":"卍は元々平和の象徴でしたが、ナチズムとの関連で意味合いが大きく変わってしまったため、現在では注意が必要です。"},{"incorrect":"✗ It's okay to display the swastika if you don't mean any harm.","correct":"✓ Displaying the swastika can be offensive, regardless of your intentions.","note":"意図に関わらず、卍を表示することは不快感を与える可能性があるため、避けるべきです。"}],"priority":"★★☆"},"related_words":{"derivatives":["swastika-shaped (卍の形をした)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2-C1 (歴史や文化に関する文脈で登場)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 日常会話ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**suavastika**」は、古代から存在するシンボルですが、ナチス・ドイツの象徴として広く知られています。元々は幸運や繁栄を意味するシンボルでしたが、第二次世界大戦中のナチスの使用により、憎悪、差別、反ユダヤ主義の象徴として強く結び付けられるようになりました。そのため、現代では非常にデリケートなシンボルであり、使用する際には歴史的背景や文化的影響を十分に理解し、慎重な配慮が必要です。学術的な文脈や歴史的な議論を除き、不用意な使用は避けるべきです。この単語は、歴史、政治、文化に関する高度な議論で現れることがあります。"},"example_sentences":[{"sentence":"The ancient swastika symbol has been found in archaeological sites around the world.","translation":"古代の卍のシンボルは、世界中の遺跡で発見されています。","type":"noun","meaning_category":"シンボル"},{"sentence":"The Nazi swastika is a symbol of hate and oppression.","translation":"ナチスの卍は、憎悪と抑圧の象徴です。","type":"noun","meaning_category":"シンボル"},{"sentence":"The use of the swastika is highly controversial due to its association with Nazism.","translation":"卍の使用は、ナチズムとの関連性から非常に議論の的となっています。","type":"noun","meaning_category":"シンボル"},{"sentence":"Many people find the swastika deeply offensive.","translation":"多くの人々が卍を非常に不快に感じています。","type":"noun","meaning_category":"シンボル"}]}