{"word":"piddlingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ごくわずかに、取るに足らないほどに","english_definition":"In a trifling or insignificant manner; to a piddling degree.","examples":[{"sentence":"The amount of money he donated was piddlingly small.","translation":"彼が寄付した金額はごくわずかだった。"},{"sentence":"She piddlingly contributed to the project, barely doing any work.","translation":"彼女はプロジェクトにほとんど貢献せず、ごくわずかな作業しか行わなかった。"}],"collocations":["piddlingly small","piddlingly insignificant","piddlingly little"],"synonyms":["insignificantly","triflingly","negligibly","minimally","slightly"],"antonyms":["significantly","substantially","considerably","greatly"]}],"etymology":{"value":"Derived from the adjective 'piddling', with the addition of the adverbial suffix '-ly'. 'Piddling' itself comes from the verb 'piddle', meaning to waste time or effort on trivial matters, or to urinate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪdlɪŋli/","syllables":"pid-dling-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Piddlingly' is used to describe something that is done or exists to a very small or insignificant degree. It often carries a negative connotation, suggesting that something is so small or unimportant that it is almost not worth considering. It is not a commonly used word, and might be considered somewhat informal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He piddlingly the water.","correct":"✓ He piddled with the water.","note":"'Piddlingly' is an adverb and cannot be used as a verb. The verb form is 'piddle'."},{"incorrect":"✗ The piddlingly problem was solved.","correct":"✓ The piddling problem was solved.","note":"'Piddlingly' is an adverb and modifies verbs, adjectives, or other adverbs. To modify a noun like 'problem', use the adjective 'piddling'."}],"priority":"★★☆"},"related_words":{"derivatives":["piddle (verb: to waste time; to urinate)","piddler (noun: someone who piddles)","piddling (adjective: trifling, insignificant)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Piddlingly' is an uncommon adverb that means 'in a trifling or insignificant manner'. It's used to describe the degree to which something is small, unimportant, or negligible. Because it's not frequently used, it's more likely to be encountered in advanced texts or specialized contexts. It's derived from the more common adjective 'piddling', which itself comes from the verb 'piddle'. Understanding the root words can help in grasping the meaning of 'piddlingly'."},"example_sentences":[{"sentence":"The company's profits increased piddlingly compared to the previous year.","translation":"その会社の利益は前年と比べてごくわずかに増加した。","type":"adverb","meaning_category":"insignificantly"},{"sentence":"He contributed piddlingly to the group project, doing almost no work.","translation":"彼はグループプロジェクトにほとんど貢献せず、ごくわずかな作業しか行わなかった。","type":"adverb","meaning_category":"triflingly"},{"sentence":"The amount of rain we received was piddlingly small, not enough to alleviate the drought.","translation":"降水量はごくわずかで、干ばつを緩和するには不十分だった。","type":"adverb","meaning_category":"negligibly"}]}