{"word":"Savadove","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"A fictional country in the 1951 film 'The Lavender Hill Mob'.","english_definition":"A fictional country featured in the 1951 British comedy film 'The Lavender Hill Mob'. It is depicted as a small, obscure nation where gold bars can be easily melted down and reshaped without attracting suspicion.","examples":[{"sentence":"In 'The Lavender Hill Mob', Holland and Pendlebury plan to smuggle stolen gold to Savadove.","translation":"『ラベンダー・ヒルのモブ』では、ホーランドとペンドルベリーは盗んだ金をサヴァドーヴェに密輸する計画を立てる。"},{"sentence":"Savadove's lax regulations make it an ideal location for their scheme.","translation":"サヴァドーヴェの緩い規制は、彼らの計画にとって理想的な場所となる。"}],"collocations":["The Lavender Hill Mob","fictional country","gold smuggling"],"synonyms":["None (fictional)"],"antonyms":["None (fictional)"]}],"etymology":{"value":"The name 'Savadove' is likely a fictional creation, possibly intended to sound vaguely Eastern European or Balkan. There is no known real-world country with that name.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsævəˈdoʊv/","syllables":"Sa-va-dove"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"'Savadove' is exclusively used in reference to the film 'The Lavender Hill Mob'. It is not a real place and has no other significant cultural or historical context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm planning a trip to Savadove next year.","correct":"✗ I'm planning a trip to Savadove next year. (Savadove is not a real place.)","note":"Savadove is a fictional country and cannot be visited."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_films":["The Lavender Hill Mob"],"related_themes":["crime","comedy","gold smuggling"]},"level_frequency":{"frequency_google_ngram":"Very low frequency (only in reference to the film).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Savadove' is a proper noun referring to a fictional country, so its usage is limited to discussions about the film 'The Lavender Hill Mob'. Understanding its meaning requires familiarity with the film's plot. It is not part of general vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The protagonists in 'The Lavender Hill Mob' chose Savadove because of its lack of extradition treaties.","translation":"『ラベンダー・ヒルのモブ』の主人公たちがサヴァドーヴェを選んだのは、同国が犯罪人引渡し条約を結んでいなかったからだ。","type":"proper noun","meaning_category":"fictional country"}]}