{"word":"curatorship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"館長職、学芸員職、キュレーターの地位","english_definition":"The position or role of a curator; the office, duties, or responsibilities of a curator.","examples":[{"sentence":"She was offered the curatorship of the museum's modern art collection.","translation":"彼女は美術館の現代美術コレクションの館長職をオファーされた。"},{"sentence":"His curatorship was marked by innovative exhibitions and increased public engagement.","translation":"彼の館長職は、革新的な展示会と一般市民の関与の増加によって特徴付けられた。"},{"sentence":"The board is seeking a candidate with extensive experience in museum curatorship.","translation":"理事会は、美術館の館長職における豊富な経験を持つ候補者を求めている。"}],"collocations":["museum curatorship (美術館の館長職)","art curatorship (美術の館長職)","hold a curatorship (館長職を務める)","assume a curatorship (館長職を引き継ぐ)","resign from a curatorship (館長職を辞任する)"],"synonyms":["directorship","headship","leadership","management","superintendence"],"antonyms":[]}],"etymology":{"value":"'Curator' + '-ship'. Curator comes from Latin 'curator' (guardian, manager), from 'curare' (to take care of). '-ship' is a suffix denoting a position, office, or status.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkjʊərətərʃɪp/","syllables":"cu-ra-tor-ship"},"inflection":{"noun_plural":"curatorships"},"usage_notes":{"explanation":"'Curatorship' refers specifically to the role, position, or term of office of a curator. It emphasizes the responsibilities and duties associated with being a curator, such as managing collections, organizing exhibitions, and conducting research. The term is most commonly used in the context of museums, galleries, libraries, and other cultural institutions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She has a curatorship in history.","correct":"She has a curatorship of the history collection.","note":"The correct preposition to use is 'of' to specify the collection or area of responsibility."},{"incorrect":"He is studying curatorship at university.","correct":"He is studying museum studies at university, with a focus on curatorship.","note":"'Curatorship' is not a field of study itself, but rather a role within a broader field like museum studies or art history."}],"priority":"★★☆"},"related_words":{"derivatives":["curator","curatorial"],"phrasal_verbs":[],"related_nouns":["museum","gallery","collection","exhibition"],"related_verbs":["curate"],"related_adjectives":["curatorial"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'curatorship' is a specialized term used in the context of museums, galleries, and other cultural institutions. It refers to the position or role of a curator, who is responsible for managing collections, organizing exhibitions, and conducting research. Understanding this word requires familiarity with the workings of these institutions and the specific responsibilities of a curator."},"example_sentences":[{"sentence":"The university established a new chair in curatorship to promote the study of museum management.","translation":"大学は、美術館経営の研究を促進するために、館長職の新しい講座を設立した。","type":"noun","meaning_category":"館長職"},{"sentence":"Her innovative approach to curatorship revitalized the museum's image.","translation":"彼女の革新的な館長職へのアプローチは、美術館のイメージを活性化させた。","type":"noun","meaning_category":"館長職"},{"sentence":"He is a leading expert in the field of digital curatorship.","translation":"彼はデジタルキュレーションの分野における第一人者である。","type":"noun","meaning_category":"館長職"}]}