{"word":"Protozoa","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"原生動物","english_definition":"A diverse group of unicellular eukaryotic organisms, many of which are motile (able to move).","examples":[{"sentence":"Protozoa are found in a variety of habitats, including soil, water, and the bodies of animals.","translation":"原生動物は、土壌、水、動物の体内など、さまざまな生息地で見られる。"},{"sentence":"Some protozoa are parasitic and can cause diseases in humans and animals.","translation":"一部の原生動物は寄生性であり、人間や動物に病気を引き起こす可能性がある。"},{"sentence":"Protozoa play an important role in many ecosystems, serving as a food source for other organisms and helping to decompose organic matter.","translation":"原生動物は、他の生物の食料源として、また有機物の分解を助けるなど、多くの生態系において重要な役割を果たしている。"}],"collocations":["parasitic protozoa (寄生性原生動物)","free-living protozoa (自由生活性原生動物)","aquatic protozoa (水生原生動物)","soil protozoa (土壌原生動物)"],"synonyms":["protist","unicellular eukaryote"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'protos' (first) and 'zoon' (animal), reflecting the historical view that these organisms were the 'first animals'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtəˈzoʊə/","syllables":"pro-to-zo-a"},"inflection":{"noun_plural":"Protozoa (same as singular); Protozoans is also sometimes used, though less common"},"usage_notes":{"explanation":"'Protozoa' is a general term that encompasses a wide variety of single-celled eukaryotic organisms. While historically considered part of the animal kingdom, they are now classified as protists. The term is still widely used, especially in medical and veterinary contexts when discussing parasitic species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Protozoa is a type of bacteria.","correct":"✓ Protozoa are eukaryotes, while bacteria are prokaryotes.","note":"Protozoa are eukaryotes (cells with a nucleus), while bacteria are prokaryotes (cells without a nucleus). They are fundamentally different types of organisms."},{"incorrect":"✗ All protozoa are harmful.","correct":"✓ Not all protozoa are harmful; many are beneficial or play important roles in ecosystems.","note":"While some protozoa are parasitic and cause disease, many others are free-living and play important roles in ecosystems."}],"priority":"★★☆"},"related_words":{"derivatives":["protozoan (adjective: relating to protozoa; noun: a single protozoon)","protozoology (noun: the study of protozoa)"],"phrases":["protozoal infection (原生動物感染症)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (technical vocabulary)","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protozoa' refers to a group of single-celled organisms with a nucleus (eukaryotes). They are often discussed in biology, ecology, and medicine. While some are harmless and play a role in ecosystems, others are parasitic and cause diseases. The term is more technical and less common in everyday conversation."},"example_sentences":[{"sentence":"Giardia is a type of **protozoa** that can cause intestinal infections.","translation":"ジアルジアは腸内感染症を引き起こす可能性のある原生動物の一種です。","type":"noun","meaning_category":"原生動物"},{"sentence":"Scientists are studying the diversity of **protozoa** in freshwater ecosystems.","translation":"科学者たちは淡水生態系における原生動物の多様性を研究しています。","type":"noun","meaning_category":"原生動物"},{"sentence":"The **protozoa** were observed under a microscope.","translation":"その原生動物は顕微鏡下で観察された。","type":"noun","meaning_category":"原生動物"}]}