{"word":"Wormship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Science Fiction) A spaceship or other vessel that resembles or is inspired by a worm, often in terms of its shape, movement, or function.","english_definition":"A spaceship or other vessel that resembles or is inspired by a worm, often in terms of its shape, movement, or function.","examples":[{"sentence":"The colossal Wormship burrowed through the asteroid field, its segmented hull undulating with each maneuver.","translation":"巨大なワームシップは、小惑星帯を掘り進み、分節化された船体は操作のたびにうねっていた。"},{"sentence":"The design of the new scout ship was based on the sandworms of Arrakis, resulting in a sleek, armored Wormship capable of traversing harsh terrains.","translation":"新型偵察船の設計は、アラキスの砂虫に基づいており、その結果、過酷な地形を横断できる洗練された装甲ワームシップが完成した。"}],"collocations":["colossal Wormship","armored Wormship","segmented hull","burrow through"],"synonyms":["space worm","sandworm ship"],"antonyms":[]}],"etymology":{"value":"A compound word combining \"worm\" (referring to the animal) and \"ship\" (referring to a vessel). The term is primarily used in science fiction to describe vessels that have worm-like characteristics.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrmʃɪp/","syllables":"worm-ship"},"inflection":{"noun_plural":"Wormships"},"usage_notes":{"explanation":"The term \"Wormship\" is primarily found in science fiction contexts. It often implies a vessel that is long, segmented, and possibly capable of burrowing or moving in a manner similar to a worm. The concept can be inspired by various fictional worms, such as the sandworms from Frank Herbert's \"Dune\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wormship are attacking.","correct":"✓ The wormship is attacking.","note":"\"Wormship\" is a singular noun, so it takes a singular verb unless referring to multiple wormships."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in science fiction contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Wormship\" is a niche term primarily used within science fiction. Understanding requires familiarity with the genre and the concept of spaceships or vessels designed to resemble worms. The word's meaning is relatively straightforward, being a combination of \"worm\" and \"ship,\" but its usage is limited to specific fictional contexts."},"example_sentences":[{"sentence":"The alien invaders deployed their Wormships to tunnel beneath the city's defenses.","translation":"エイリアンの侵略者たちは、都市の防衛線を地下からトンネルを掘って突破するために、ワームシップを展開した。","type":"noun","meaning_category":"science fiction vessel"},{"sentence":"The artist's rendering of the Wormship showed a bioluminescent craft with pulsating segments.","translation":"アーティストが描いたワームシップのレンダリングは、脈動するセグメントを持つ生物発光の宇宙船を示していた。","type":"noun","meaning_category":"science fiction vessel"}]}