{"word":"repunish","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び罰する、二度罰する","english_definition":"to punish again; to punish a second time for the same offense.","examples":[{"sentence":"The judge decided not to repunish the offender, considering the remorse shown.","translation":"裁判官は、違反者が示した反省を考慮し、違反者を再び罰しないことを決定した。"},{"sentence":"It is considered unjust to repunish someone for a crime they have already served time for.","translation":"すでに服役した犯罪に対して、誰かを再び罰することは不当であると考えられている。"}],"collocations":["repunish someone for something","decide not to repunish","unjust to repunish"],"synonyms":["penalize again","discipline again","correct again"],"antonyms":["forgive","pardon","exonerate"]}],"etymology":{"value":"The word 'repunish' is formed by adding the prefix 're-' (meaning again) to the word 'punish'.","priority":"★★★"},"pronunciation":{"ipa":"/riːˈpʌnɪʃ/","syllables":"re-pun-ish"},"inflection":{"verb_forms":{"present_simple":["repunish","repunishes"],"past_simple":"repunished","past_participle":"repunished","present_participle":"repunishing"}},"usage_notes":{"explanation":"'Repunish' is used to describe the act of punishing someone more than once for the same offense. It often carries a negative connotation, implying unfairness or injustice. It is not a commonly used word, and its usage often occurs in legal or ethical discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The child was repunished for doing his homework incorrectly.","correct":"✓ The child was punished again for doing his homework incorrectly.","note":"'Repunish' implies a second punishment for the *same* offense, not a punishment for a new or ongoing issue."},{"incorrect":"✗ The system repunishes the poor.","correct":"✓ The system disadvantages the poor.","note":"If the intention is to describe a system that unfairly affects a group, use 'disadvantage' or 'penalize' rather than 'repunish'."}],"priority":"★★☆"},"related_words":{"derivatives":["punish","punishment","re-","again"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'repunish' is a relatively uncommon word that means to punish someone again for the same offense. It is often used in legal or ethical contexts when discussing the fairness of repeated punishments. Because it is not a frequently used word, it is more likely to be encountered in advanced texts or discussions. Understanding the prefix 're-' is helpful in deducing the meaning of this word."},"example_sentences":[{"sentence":"The court ruled that it was illegal to repunish the defendant for the same crime after they had already served their sentence.","translation":"裁判所は、被告がすでに刑期を務めた後、同じ犯罪で被告を再び罰することは違法であると判決を下した。","type":"verb","meaning_category":"legal context"},{"sentence":"Some argue that the social stigma is a way to repunish individuals even after they have been released from prison.","translation":"社会的な偏見は、刑務所から釈放された後でも個人を再び罰する方法であると主張する人もいる。","type":"verb","meaning_category":"social context"},{"sentence":"The teacher decided not to repunish the student after realizing the mistake was unintentional.","translation":"教師は、間違いが意図的ではないことに気づいた後、生徒を再び罰しないことに決めた。","type":"verb","meaning_category":"educational context"}]}