{"word":"Brandenburg","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ブランデンブルク州 (ドイツの州)","english_definition":"A state in northeastern Germany surrounding Berlin.","examples":[{"sentence":"Brandenburg is known for its many lakes and forests.","translation":"ブランデンブルク州は、多くの湖や森林で知られています。"},{"sentence":"Potsdam, the capital of Brandenburg, is a popular tourist destination.","translation":"ブランデンブルク州の州都であるポツダムは、人気の観光地です。"}],"collocations":["State of Brandenburg","Brandenburg Gate"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ブランデンブルク辺境伯領 (かつての神聖ローマ帝国の領邦)","english_definition":"A former margraviate (border march) in the Holy Roman Empire.","examples":[{"sentence":"The Hohenzollern family ruled Brandenburg for centuries.","translation":"ホーエンツォレルン家は何世紀にもわたってブランデンブルクを統治しました。"},{"sentence":"Brandenburg played a key role in the rise of Prussia.","translation":"ブランデンブルクはプロイセンの台頭において重要な役割を果たしました。"}],"collocations":["Margraviate of Brandenburg","Electorate of Brandenburg"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name is derived from the town of Brandenburg an der Havel, which means 'fortress in the Brenna'. The Brenna were a Slavic tribe who inhabited the area.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbʁandənbʊʁk/","syllables":"Bran-den-burg"},"inflection":{},"usage_notes":{"explanation":"'Brandenburg' can refer to the modern German state or the historical territory. The historical context is important to understand its significance in the rise of Prussia and later Germany.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["Brandenburger (noun: a person from Brandenburg)"],"phrasal_verbs":[],"related_places":["Berlin","Prussia","Potsdam"]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"'Brandenburg' is a proper noun referring to a region in Germany with a rich history. Understanding its historical context is important for comprehending European history, especially the rise of Prussia. It's also relevant in the context of modern Germany as a state surrounding Berlin."},"example_sentences":[{"sentence":"Many tourists visit Brandenburg to see its beautiful countryside.","translation":"多くの観光客が、ブランデンブルクの美しい田園風景を見るために訪れます。","type":"noun","meaning_category":"German state"},{"sentence":"The Elector of Brandenburg became the King of Prussia in 1701.","translation":"1701年、ブランデンブルク選帝侯はプロイセン王となりました。","type":"noun","meaning_category":"Historical territory"}]}