{"word":"unsluiced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not washed or separated by a sluice.","english_definition":"Not having been washed or separated by a sluice.","examples":[{"sentence":"The unsluiced ore contained a significant amount of impurities.","translation":"水洗分離されていない鉱石には、かなりの量の不純物が含まれていた。"},{"sentence":"Unsluiced gravel can be difficult to process efficiently.","translation":"水洗分離されていない砂利は、効率的に処理するのが難しい場合がある。"}],"collocations":["unsluiced ore","unsluiced gravel","unsluiced material"],"synonyms":["unwashed","unseparated","unrefined"],"antonyms":["sluiced","washed","separated","refined"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'sluiced' of the verb 'sluice'. The verb 'sluice' comes from the Middle English 'sclus', which is derived from the Old French 'escluse' and ultimately from the Late Latin 'exclusa', meaning 'barrier'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsluːst/","syllables":"un-sluiced"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unsluiced' is a relatively uncommon adjective, primarily used in technical contexts related to mining, geology, or water management. It describes material that has not undergone the process of being washed or separated using a sluice. A sluice is an artificial channel for conveying water, often equipped with a gate for regulating the flow, and used to separate heavier materials (like gold) from lighter ones (like sand or gravel). The term is most often encountered in discussions of historical or artisanal mining techniques.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsluiced water was murky.","correct":"✓ The unsluiced sediment made the water murky.","note":"Water itself is not 'sluiced.' The sediment or material within the water might be unsluiced, leading to murky water."},{"incorrect":"✗ He unsluiced the gold.","correct":"✓ He found unsluiced gold.","note":"'Unsluiced' is an adjective, not a verb. You can't 'unsluice' something. You can find or process unsluiced material."}],"priority":"★☆☆"},"related_words":{"derivatives":["sluice (noun, verb)","sluicing (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary, not in CEFR)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unsluiced' is a technical term, primarily used in the context of mining or water management. It describes material that has not been processed using a sluice, which is a channel with a gate used to separate heavier materials from lighter ones by washing them with water. Because it is a specialized term, it is unlikely to be encountered outside of these specific fields."},"example_sentences":[{"sentence":"The miners examined the unsluiced tailings for any remaining valuable minerals.","translation":"鉱夫たちは、未水洗の尾鉱に貴重な鉱物が残っていないか調べた。","type":"adjective","meaning_category":"Mining"},{"sentence":"The geologist analyzed the composition of the unsluiced riverbed sediments.","translation":"地質学者は、未水洗の川床堆積物の組成を分析した。","type":"adjective","meaning_category":"Geology"}]}