{"word":"Pneumonoultramicroscopicsilicovolcanoconiosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"珪肺塵肺症（けいはいじんぱいしょう）：非常に細かいケイ酸や火山灰の粉塵を吸い込むことによって起こる肺の病気。","english_definition":"A lung disease caused by the inhalation of very fine silica or quartz dust, especially that found in volcanoes; silicosis.","examples":[{"sentence":"He was diagnosed with pneumonoultramicroscopicsilicovolcanoconiosis after working in the mines for many years.","translation":"彼は長年鉱山で働いた後、珪肺塵肺症と診断された。"}],"collocations":["contract pneumonoultramicroscopicsilicovolcanoconiosis (珪肺塵肺症にかかる)"],"synonyms":["silicosis","asbestosis"],"antonyms":[]}],"etymology":{"value":"This word is an artificial construction intended to be the longest word in the English language that is defined in a major dictionary. It combines elements from words related to lungs, dust, and volcanoes: 'pneumono-' (relating to the lungs), 'ultra-' (extremely), 'microscopic' (extremely small), 'silico-' (relating to silicon or silica), 'volcano' (volcano), 'coni-' (dust), and '-osis' (a disease or abnormal condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjuːmənoʊˌʌltrəˌmaɪkrəˈskɒpɪkˌsɪlɪkoʊvɒlˌkeɪnoʊˌkoʊniˈoʊsɪs/","syllables":"pneu-mo-no-ul-tra-mi-cro-scop-ic-sil-i-co-vol-ca-no-co-ni-o-sis"},"inflection":{"noun_plural":"pneumonoultramicroscopicsilicovolcanoconioses"},"usage_notes":{"explanation":"This word is more of a linguistic curiosity than a commonly used term. It is often cited as one of the longest words in the English language and is primarily used to demonstrate the ability to create long words by combining prefixes and suffixes. In medical contexts, simpler and more precise terms like 'silicosis' or 'pneumoconiosis' are preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I think I have pneumonoultramicroscopicsilicovolcanoconiosis because I coughed.","correct":"✓ I have a cough; I should see a doctor.","note":"This word refers to a specific lung disease caused by silica dust inhalation, not a general cough. Medical conditions should be diagnosed by professionals."}],"priority":"★☆☆"},"related_words":{"derivatives":["pneumonia","microscopic","silicon","volcano","coniosis","pneumoconiosis"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not applicable due to rarity)","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"Difficult. This word is rarely used and primarily exists as a linguistic curiosity. Understanding the component parts (pneumo-, ultra-, microscopic, silico-, volcano-, coni-, -osis) can help in deciphering its meaning, but it is not a word typically encountered in everyday language.","text":"This word is extremely long and complex, referring to a specific lung disease. It is not commonly used in conversation or writing. It is more of a curiosity than a practical term."},"example_sentences":[{"sentence":"The medical textbook mentioned pneumonoultramicroscopicsilicovolcanoconiosis as an example of a lung disease caused by inhaling fine particles.","translation":"その医学書は、微粒子を吸入することによって引き起こされる肺疾患の例として、珪肺塵肺症について言及していた。","type":"noun","meaning_category":"disease"}]}