{"word":"diascope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"透過原画映写機、透過光式映写機","english_definition":"A projector for transparent pictures or slides; an apparatus for viewing transparent objects by transmitted light.","examples":[{"sentence":"The museum used a diascope to display historical photographs.","translation":"博物館は、歴史的な写真を展示するために透過原画映写機を使用した。"},{"sentence":"Scientists use a diascope to examine microscopic slides.","translation":"科学者たちは、顕微鏡スライドを調べるために透過光式映写機を使用する。"}],"collocations":["use a diascope","examine with a diascope","display with a diascope"],"synonyms":["projector","slide projector","transparency projector"],"antonyms":["episcope (反射原画映写機)"]}],"etymology":{"value":"Derived from the Greek words 'dia' (through) and 'skopeō' (I view).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaɪəˌskoʊp/","syllables":"di-a-scope"},"inflection":{"noun_plural":"diascopes"},"usage_notes":{"explanation":"A diascope is specifically used for projecting or viewing transparent images, such as photographic slides or transparencies. It contrasts with an episcope, which projects images of opaque objects by reflected light. The term is somewhat technical and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used an episcope to show the slides.","correct":"✓ He used a diascope to show the slides.","note":"Episcopes are for opaque objects, diascopes are for transparent slides."}],"priority":"★☆☆"},"related_words":{"derivatives":["diascopic (adjective)"],"related_terms":["episcope","projector","slide projector","overhead projector"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'diascope' is a technical term rarely used outside of specialized contexts such as museums, scientific laboratories, or photography. It refers to a specific type of projector designed for transparent images. Understanding the distinction between a diascope and related devices like episcopes or overhead projectors requires some familiarity with technical equipment. "},"example_sentences":[{"sentence":"The old diascope allowed us to view the antique glass slides with remarkable clarity.","translation":"その古い透過原画映写機のおかげで、私たちは驚くほど鮮明にアンティークのガラススライドを見ることができた。","type":"noun","meaning_category":"device"},{"sentence":"The scientist used a diascope to analyze the cellular structures on the prepared slide.","translation":"科学者は、用意されたスライド上の細胞構造を分析するために透過光式映写機を使用した。","type":"noun","meaning_category":"device"}]}