{"word":"overunionize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過度に労働組合化する、労働組合の組織率が高すぎる状態にする","english_definition":"To organize into labor unions to an excessive degree; to cause a situation where the proportion of workers belonging to labor unions is excessively high.","examples":[{"sentence":"The company feared that the new regulations would overunionize the workforce.","translation":"会社は、新しい規制が労働力を過度に労働組合化することを恐れていました。"},{"sentence":"Some argue that certain industries are overunionized, leading to inefficiencies.","translation":"一部の人は、特定の産業は労働組合の組織率が高すぎるため、非効率につながると主張しています。"}],"collocations":["overunionize the workforce","prevent overunionization","risk of overunionization"],"synonyms":["unionize excessively","over-organize labor"],"antonyms":["deunionize","reduce unionization"],"notes":"This term often carries a negative connotation, implying that excessive unionization can be detrimental to business or economic efficiency."}],"etymology":{"value":"Formed by adding the prefix 'over-' to the verb 'unionize'. 'Unionize' comes from 'union', referring to a labor union. The prefix 'over-' indicates excess or doing something to an extreme degree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈjuːniənaɪz/","syllables":"o-ver-u-ni-on-ize"},"inflection":{"verb_forms":{"present_simple":["overunionize","overunionizes"],"past_simple":"overunionized","past_participle":"overunionized","present_participle":"overunionizing"}},"usage_notes":{"explanation":"'Overunionize' is typically used in discussions about labor relations, economics, and business management. It suggests that the presence or power of labor unions has become excessive, potentially leading to negative consequences such as reduced competitiveness, increased labor costs, or inflexible work practices. The term is often used in a critical or cautionary context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The factory was overunionized by the workers themselves.","correct":"✓ The factory became overunionized due to external organizers.","note":"'Overunionize' usually implies an external force or policy causing the excessive unionization, not the workers themselves directly. The corrected sentence clarifies that external organizers were responsible."},{"incorrect":"✗ Overunionize is always good for workers.","correct":"✓ Some argue that overunionization can have negative consequences.","note":"The term 'overunionize' often carries a negative connotation, suggesting potential downsides. It's important to acknowledge this potential negativity rather than assuming it's always beneficial."}],"priority":"★★☆"},"related_words":{"derivatives":["overunionization (noun)"],"related_terms":["unionize","unionization","labor union","collective bargaining","labor relations"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is relatively uncommon and typically used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overunionize' is a relatively uncommon term used in discussions about labor relations and economics. It means to organize workers into labor unions to an excessive degree, often implying negative consequences such as reduced efficiency or competitiveness. The word is formed by adding the prefix 'over-' to 'unionize', indicating excess. Understanding the context in which this term is used is crucial, as it often carries a negative connotation."},"example_sentences":[{"sentence":"The government policy was criticized for potentially overunionizing the agricultural sector.","translation":"政府の政策は、農業部門を過度に労働組合化する可能性があるとして批判されました。","type":"verb","meaning_category":"過度に労働組合化する"},{"sentence":"The company's management feared that the proposed changes would overunionize their workforce.","translation":"会社の経営陣は、提案された変更が労働力を過度に労働組合化することを恐れていました。","type":"verb","meaning_category":"過度に労働組合化する"}]}