{"word":"statfarad","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"静電容量の単位；1 statfarad は、1 statcoulomb の電荷を 1 statvolt の電位差で蓄えることができる静電容量である。","english_definition":"A unit of capacitance in the CGS electrostatic system of units; the capacitance of a capacitor in which a charge of one statcoulomb results in a potential difference of one statvolt.","examples":[{"sentence":"The capacitance of the small capacitor was measured to be 5 statfarads.","translation":"その小さなコンデンサの静電容量は5スタットファラドと測定された。"}],"collocations":[],"synonyms":["esu of capacitance"],"antonyms":[]}],"etymology":{"value":"'stat-' (static electricity) + 'farad' (after Michael Faraday)","priority":"★★★"},"pronunciation":{"ipa":"/stætˈfærəd/","syllables":"stat-far-ad"},"inflection":{"noun_plural":"statfarads"},"usage_notes":{"explanation":"The statfarad is a unit of capacitance within the CGS (centimeter-gram-second) system, specifically the electrostatic (esu) variant. It is rarely used in practical applications, as the SI unit, the farad (F), is much more common. The statfarad is related to the farad by the conversion factor: 1 F ≈ 8.98755 × 10¹¹ statF.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["statvolt","statcoulomb","farad","capacitance"],"related_terms":["CGS units","electrostatic units (esu)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'statfarad' is highly specialized, belonging to the realm of physics and electrical engineering. Understanding it requires familiarity with the CGS unit system and electrostatics. It is not typically encountered outside of advanced scientific or technical contexts."},"example_sentences":[{"sentence":"The theoretical calculation yielded a capacitance value of 2.5 statfarads.","translation":"理論計算により、2.5スタットファラドの静電容量値が得られた。","type":"example","meaning_category":"Definition"},{"sentence":"Converting from farads to statfarads involves a large conversion factor due to the different unit systems.","translation":"ファラドからスタットファラドへの変換は、異なる単位系のため、大きな変換係数を伴う。","type":"example","meaning_category":"Usage"}]}