{"word":"euhemerist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"実証主義者、神話や伝説を歴史的事実の歪曲として解釈する人","english_definition":"A person who interprets myths and legends as distorted accounts of actual historical events.","examples":[{"sentence":"The euhemerist believed that Zeus was originally a mortal king.","translation":"その実証主義者は、ゼウスは元々人間の王だったと信じていた。"}],"collocations":["historical euhemerist","classical euhemerist"],"synonyms":["rationalist","historicist"],"antonyms":["mythologist"]},{"part_of_speech":"adjective","definition":"実証主義的な、神話や伝説を歴史的事実の歪曲として解釈する","english_definition":"Interpreting myths and legends as distorted accounts of actual historical events.","examples":[{"sentence":"The euhemerist approach to mythology seeks to find historical kernels within the stories.","translation":"神話に対する実証主義的なアプローチは、物語の中に歴史的な核を見つけようとする。"}],"collocations":["euhemerist interpretation","euhemerist approach"],"synonyms":["rationalistic","historicizing"],"antonyms":["mythological"]}],"etymology":{"value":"エウヘメロス（Euhemerus）という古代ギリシャの著者の名前に由来する。エウヘメロスは、神話の神々をかつての人間である王や英雄として解釈したことで知られる。","priority":"★★★"},"pronunciation":{"ipa":"/juːˈhiːmərɪst/","syllables":"eu-he-mer-ist"},"inflection":{"noun_plural":"euhemerists"},"usage_notes":{"explanation":"The term \"euhemerist\" is used to describe someone who follows the theory of Euhemerism, which posits that mythological figures were originally real people whose stories became exaggerated over time. This approach contrasts with more symbolic or allegorical interpretations of myth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a euhemeristic.","correct":"✓ He is a euhemerist.","note":"The correct noun form is 'euhemerist', not 'euhemeristic'."},{"incorrect":"✗ The euhemerist theory is about believing in myths.","correct":"✓ The euhemerist theory is about interpreting myths as distorted history.","note":"Euhemerism is about interpreting myths as based on historical events, not about believing in them literally."}],"priority":"★★☆"},"related_words":{"derivatives":["euhemerism (名詞: 実証主義)","euhemeristic (形容詞: 実証主義的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"euhemerist\" refers to someone who believes that myths and legends are based on real historical events that have been exaggerated over time. This is a specialized term often used in the context of mythology, history, and literary studies. Understanding the concept requires familiarity with the study of myths and legends and the different approaches to interpreting them."},"example_sentences":[{"sentence":"As a dedicated **euhemerist**, he sought to uncover the historical basis of every myth.","translation":"熱心な実証主義者として、彼はあらゆる神話の歴史的根拠を明らかにしようと努めた。","type":"noun","meaning_category":"実証主義者"},{"sentence":"The **euhemerist** interpretation of the Hercules myth suggests he was a powerful chieftain.","translation":"ヘラクレス神話の実証主義的な解釈は、彼が強力な首長であったことを示唆している。","type":"adjective","meaning_category":"実証主義的な"}]}