{"word":"Goniatitidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ゴニアタイト科：古生代に生息したアンモナイトの一種を含む絶滅した頭足類の科","english_definition":"A family of extinct cephalopods belonging to the order Goniatitida, which existed during the Paleozoic era. They are characterized by their goniatitic suture patterns on their shells.","examples":[{"sentence":"Fossils of Goniatitidae are commonly found in Paleozoic marine sediments.","translation":"ゴニアタイト科の化石は、古生代の海洋堆積物によく見られます。"}],"collocations":["Goniatitidae fossil","Goniatitidae shell","Paleozoic Goniatitidae"],"synonyms":["goniatite (general term)"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Goniatites' + '-idae' (a suffix used to denote a zoological family). 'Goniatites' comes from Greek 'gonia' (γωνία) meaning 'angle' or 'corner', referring to the angular sutures on the shell.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɒniəˈtaɪtɪdiː/","syllables":"Go-ni-a-ti-ti-dae"},"inflection":{"noun_plural":"Goniatitidae (already plural form for a family name)"},"usage_notes":{"explanation":"'Goniatitidae' refers specifically to the family within the order Goniatitida. The term 'goniatite' is a more general term referring to any member of the order Goniatitida, while 'Goniatitidae' is a more specific taxonomic classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Goniatitidae is a genus.","correct":"✓ Goniatitidae is a family.","note":"Goniatitidae is a family-level classification, not a genus. A genus within the family would be 'Goniatites', for example."}],"priority":"★★☆"},"related_words":{"derivatives":["Goniatites (genus)","Goniatitida (order)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized paleontological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Goniatitidae' is a highly specialized term used in paleontology and geology. It refers to a specific family of extinct cephalopods characterized by a particular suture pattern on their shells. Understanding this term requires knowledge of taxonomic classification and paleontology. It is unlikely to be encountered outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The evolutionary relationships within the Goniatitidae family are still being studied.","translation":"ゴニアタイト科内の進化関係は、まだ研究されています。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"The Goniatitidae were an important group of marine predators during the Devonian period.","translation":"ゴニアタイト科は、デボン紀において重要な海洋捕食者の一群でした。","type":"scientific","meaning_category":"paleontology"}]}