{"word":"Communism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"共産主義","english_definition":"A political theory advocating class war and leading to a society in which all property is publicly owned and each person works and is paid according to their abilities and needs.","examples":[{"sentence":"Communism as a political system was implemented in the Soviet Union.","translation":"共産主義は政治体制としてソビエト連邦で実施された。"},{"sentence":"The ideals of communism include a classless society and equal distribution of wealth.","translation":"共産主義の理想には、階級のない社会と富の平等な分配が含まれる。"}],"collocations":["Marxist communism","implement communism","fall of communism","principles of communism"],"synonyms":["Marxism","socialism","collectivism"],"antonyms":["capitalism","democracy","individualism"]}],"etymology":{"value":"From French *communisme*, from *commun* 'common'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒmjʊnɪzəm/","syllables":"com-mu-nism"},"inflection":{"noun_plural":"Communisms (rare, usually used when referring to different types or instances of communism)"},"usage_notes":{"explanation":"Communism is often associated with specific historical implementations, such as in the Soviet Union and China. It is important to distinguish between the theoretical ideals of communism and the practical outcomes of communist states.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a communist, so he must be poor.","correct":"✓ Being a communist does not necessarily mean someone is poor.","note":"Communism is a political ideology, not a direct indicator of personal wealth."},{"incorrect":"✗ Communism is when the government does stuff.","correct":"✓ Communism is a political and economic ideology advocating for a classless society and public ownership of the means of production.","note":"This is an oversimplification. Communism involves specific principles about ownership and social structure."}],"priority":"★★☆"},"related_words":{"derivatives":["communist (noun/adjective)","communal (adjective)","commune (noun/verb)"],"phrases":["Communist Party","Communist Manifesto","command economy"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively high frequency, especially in historical and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Communism' refers to a complex political and economic ideology advocating for a classless society with public ownership of the means of production. Understanding it requires familiarity with political theory and historical context, including the works of Karl Marx and the history of communist states. The term is often used in discussions of political systems, economic structures, and historical events.","priority":"★★☆"},"example_sentences":[{"sentence":"The rise of **communism** in the 20th century significantly altered global politics.","translation":"20世紀における共産主義の台頭は、世界政治を大きく変えた。","type":"noun","meaning_category":"political theory"},{"sentence":"Critics argue that the implementation of **communism** often leads to authoritarianism.","translation":"批評家は、共産主義の実施はしばしば権威主義につながると主張する。","type":"noun","meaning_category":"political system"},{"sentence":"The collapse of the Soviet Union marked a decline in the influence of **communism**.","translation":"ソビエト連邦の崩壊は、共産主義の影響力の低下を示した。","type":"noun","meaning_category":"historical influence"}]}