{"word":"naturism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自然主義（芸術、文学における）","english_definition":"a style and theory of representation based on the accurate depiction of detail.","examples":[{"sentence":"Zola was a key figure in the development of literary naturism.","translation":"ゾラは文学的自然主義の発展における重要な人物でした。"}],"collocations":["literary naturism","artistic naturism"],"synonyms":["realism","naturalism"],"antonyms":["idealism"]},{"part_of_speech":"noun","definition":"裸体主義、ヌーディズム","english_definition":"the practice of living unclothed, especially in a group and in a natural environment.","examples":[{"sentence":"Naturism is often associated with a philosophy of healthy living and respect for nature.","translation":"裸体主義はしばしば健康的な生活と自然への尊重の哲学と関連付けられています。"},{"sentence":"They spent their vacation at a naturist resort.","translation":"彼らはヌーディストリゾートで休暇を過ごしました。"}],"collocations":["naturist resort","practice naturism"],"synonyms":["nudism"],"antonyms":["conventional clothing"]}],"etymology":{"value":"'Naturism' derives from 'nature' and the suffix '-ism'. In the context of art and literature, it reflects a focus on depicting nature and reality as they are. In the context of nudism, it signifies a return to a natural state of being.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪtʃərɪzəm/","syllables":"na-tur-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"The term 'naturism' has two primary meanings. In art and literature, it refers to a movement focused on realistic depictions of the natural world and human life, often emphasizing social and environmental factors. In the context of lifestyle, 'naturism' (also known as nudism) refers to the practice of social nudity, often associated with values of freedom, health, and respect for nature. It's important to consider the context to understand which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a naturalist, I like to be naked.","correct":"✓ I am a naturist, I like to be naked.","note":"'Naturalist' refers to someone who studies nature, while 'naturist' refers to someone who practices nudism."}],"priority":"★★☆"},"related_words":{"derivatives":["naturist (noun: 裸体主義者, adjective: 裸体主義の)","naturalistic (adjective: 自然主義的な)","nature (noun: 自然)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Naturism' is a term with two distinct meanings, which can lead to confusion. In art and literature, it represents a movement emphasizing realistic and detailed depictions of the natural world and human existence. In lifestyle contexts, 'naturism' (often used interchangeably with 'nudism') refers to the practice of social nudity, often associated with specific values and philosophies. Understanding the context is crucial to correctly interpret the intended meaning. The term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel is a prime example of literary naturism, depicting the harsh realities of working-class life.","translation":"その小説は、労働者階級の厳しい現実を描いた、文学的自然主義の代表的な例です。","type":"noun","meaning_category":"自然主義（芸術、文学における）"},{"sentence":"The couple decided to embrace naturism and joined a local club.","translation":"そのカップルは裸体主義を受け入れることを決意し、地元のクラブに入会しました。","type":"noun","meaning_category":"裸体主義、ヌーディズム"},{"sentence":"The artist's naturalistic style captured the beauty of the landscape.","translation":"その芸術家の自然主義的なスタイルは、風景の美しさを捉えました。","type":"adjective (related word)","meaning_category":"自然主義的な"}]}