{"word":"cauma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)熱傷、火傷","english_definition":"(medicine) a burn","examples":[{"sentence":"The patient suffered a severe cauma.","translation":"患者は重度の熱傷を負った。"}],"synonyms":["burn","scald"],"antonyms":[]}],"etymology":{"value":"This word appears to be a misspelling or a less common variant of \"trauma\" or a medical term specific to certain regions or languages. Without further context, its exact etymology is difficult to determine. It might be a regional or technical term.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkɔːmə/","syllables":"cau-ma"},"inflection":{"noun_plural":"caumata (rare)"},"usage_notes":{"explanation":"The word \"cauma\" is not a standard English term. It is likely a misspelling of \"trauma\" or a technical term used in specific medical contexts or languages. If referring to a burn, \"burn\" or \"scald\" are more common and widely understood terms.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a cauma to his head after the accident.","correct":"✓ He had a trauma to his head after the accident.","note":"If referring to a head injury from an accident, use \"trauma\"."},{"incorrect":"✗ She treated the cauma with ointment.","correct":"✓ She treated the burn with ointment.","note":"If referring to a skin injury caused by heat, use \"burn\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["caumatic (adjective, relating to burns)"],"related_medical_terms":["burn","scald","trauma"]},"level_frequency":{"CEFR":"N/A (not a standard English word)","frequency_google_ngram":"Very low frequency (likely a misspelling or technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"cauma\" is not a common English word. It is likely a technical term or a misspelling. If you encounter this word, it is important to verify its meaning in the specific context in which it is used. In most cases, \"burn\" or \"trauma\" would be more appropriate and widely understood terms."},"example_sentences":[{"sentence":"The emergency room doctor documented the cauma in the patient's chart.","translation":"救急治療室の医師は患者のカルテに熱傷の記録を記載した。","type":"noun","meaning_category":"(medical) burn"}]}