{"word":"zygomycetous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"接合菌類の、接合菌に属する","english_definition":"Relating to or belonging to the Zygomycota, a former division or phylum of fungi characterized by the formation of zygospores during sexual reproduction.","examples":[{"sentence":"The zygomycetous fungi are known for their rapid growth.","translation":"接合菌類の菌類は、その急速な成長で知られています。"},{"sentence":"Rhizopus is a zygomycetous fungus commonly found on bread.","translation":"リゾープスは、パンによく見られる接合菌類の菌です。"}],"collocations":["zygomycetous fungi","zygomycetous infection"],"synonyms":["zygomycete"],"antonyms":[]}],"etymology":{"value":"Derived from the term 'Zygomycota', which combines 'zygo-' (referring to the zygospore) and '-mycota' (referring to fungi).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzaɪɡoʊmaɪˈsiːtəs/","syllables":"zy-go-my-ce-tous"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'zygomycetous' is primarily used in the context of mycology (the study of fungi) to describe organisms belonging to the former division/phylum Zygomycota. Modern taxonomy has reclassified many of these fungi, but the term remains in use, particularly in medical contexts referring to infections caused by these types of fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria was zygomycetous.","correct":"✓ The fungus was zygomycetous.","note":"Zygomycetous refers to fungi, not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["Zygomycota (noun: former phylum of fungi)","zygomycete (noun: a fungus belonging to the Zygomycota)","zygospore (noun: a thick-walled resting cell of certain fungi and algae, arising from the fusion of two similar gametes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"zygomycetous\" is a highly specialized term used in the field of mycology (the study of fungi). It describes organisms belonging to the former division/phylum Zygomycota, which are characterized by the formation of zygospores during sexual reproduction. Due to its technical nature and limited application outside of specialized scientific contexts, it is considered an advanced vocabulary word. Understanding requires knowledge of fungal taxonomy and reproductive biology."},"example_sentences":[{"sentence":"Mucormycosis is a serious infection caused by zygomycetous fungi.","translation":"ムーコル症は、接合菌類の菌によって引き起こされる深刻な感染症です。","type":"adjective","meaning_category":"接合菌類の"},{"sentence":"The identification of the zygomycetous species required microscopic examination.","translation":"接合菌類の種の同定には、顕微鏡検査が必要でした。","type":"adjective","meaning_category":"接合菌類の"}]}