{"word":"Nitrobacteriaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ニトロバクター科：亜硝酸を硝酸に酸化する化学合成独立栄養細菌の一群を含む細菌科","english_definition":"A family of bacteria that includes a group of chemolithoautotrophic bacteria that oxidize nitrite into nitrate.","examples":[{"sentence":"Nitrobacteriaceae play a crucial role in the nitrogen cycle in soil and aquatic environments.","translation":"ニトロバクター科は、土壌や水生環境における窒素循環において重要な役割を果たします。"}],"collocations":["nitrogen cycle","soil bacteria","aquatic bacteria","chemolithoautotrophs"],"synonyms":["nitrite-oxidizing bacteria","NOB (Nitrite-Oxidizing Bacteria)"],"antonyms":[]}],"etymology":{"value":"属名 *Nitrobacter* + 接尾辞 *-iaceae* (細菌の科名に用いられる)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnaɪtroʊbækˌtɪəriˈeɪsiˌaɪ/","syllables":"Ni-tro-bac-te-ri-a-ce-ae"},"inflection":{"noun_plural":"Nitrobacteriaceae (変化なし)"},"usage_notes":{"explanation":"Nitrobacteriaceae are a family of Gram-negative bacteria that are important in the nitrogen cycle. They are chemolithoautotrophs, meaning they obtain energy by oxidizing inorganic compounds (nitrite) and use carbon dioxide as their carbon source. This family is crucial for converting toxic nitrite to less toxic nitrate in various ecosystems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Nitrobacteriaceae is a bacterium.","correct":"✓ Nitrobacteriaceae is a family of bacteria.","note":"Nitrobacteriaceae is a family, not a single bacterium. Use 'Nitrobacter' to refer to a genus within the family."}],"priority":"★★☆"},"related_words":{"derivatives":["Nitrobacter (属名)","Nitrobacter winogradskyi (代表的な種)"],"phrases":["Nitrogen cycle","Nitrification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な科学分野)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な科学論文や教科書でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nitrobacteriaceae' is a scientific term referring to a family of bacteria involved in the nitrogen cycle, specifically the oxidation of nitrite to nitrate. Understanding this term requires a background in microbiology and biochemistry. It is primarily used in academic and research contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The abundance of Nitrobacteriaceae in agricultural soils is vital for maintaining soil fertility.","translation":"農業土壌におけるニトロバクター科の豊富さは、土壌の肥沃度を維持するために不可欠です。","type":"general"},{"sentence":"Studies have shown that certain pesticides can negatively impact the activity of Nitrobacteriaceae.","translation":"研究によると、特定の農薬はニトロバクター科の活動に悪影響を与える可能性があります。","type":"research"}]}