{"word":"Falconinae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハヤブサ亜科：鳥綱ハヤブサ目ハヤブサ科に属する亜科の一つ。","english_definition":"A subfamily of birds of prey in the family Falconidae, order Falconiformes (or Accipitriformes depending on classification). It includes falcons, hobbies, kestrels, merlins, and related species.","examples":[{"sentence":"The Falconinae subfamily is known for its fast and agile flight.","translation":"ハヤブサ亜科は、その速く俊敏な飛行で知られています。"}],"collocations":["Falconinae species","Falconinae habitat","Falconinae behavior"],"synonyms":["falcons","kestrels","hobbies","merlins"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Falco' (Latin for 'falcon') + '-inae' (a standard suffix used in zoological nomenclature to denote a subfamily).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfæl.kəˈnaɪ.niː/","syllables":"Fal-co-ni-nae"},"inflection":{"noun_plural":"Falconinaes"},"usage_notes":{"explanation":"'Falconinae' is a taxonomic term used in ornithology to classify a specific group of birds of prey. It is primarily used in scientific contexts and is not commonly used in everyday language. The classification of birds of prey is subject to change, and the exact composition of the Falconinae subfamily may vary depending on the source.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Falconinae are mammals.","correct":"✓ Falconinae are birds.","note":"Falconinae are birds, specifically birds of prey, not mammals."}],"priority":"★★☆"},"related_words":{"derivatives":["Falconidae (family)","Falco (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Falconinae' is a scientific term used in biology, specifically in zoology and ornithology. It refers to a specific subfamily within the Falconidae family, which includes falcons and related birds of prey. Understanding this term requires familiarity with biological classification systems. It is typically encountered in scientific literature, textbooks, or specialized discussions about birds.","priority":"★★☆"},"example_sentences":[{"sentence":"The evolutionary relationships within the Falconinae are still being studied.","translation":"ハヤブサ亜科内の進化関係はまだ研究中です。","type":"scientific","meaning_category":"classification"},{"sentence":"Various species of Falconinae can be found across different continents.","translation":"ハヤブサ亜科の様々な種が、異なる大陸で見られます。","type":"scientific","meaning_category":"distribution"}]}