{"word":"kedge-anchor","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"小型の錨（いかり）。小型ボートを移動させたり、座礁した船を離礁させたりするのに使用される。","english_definition":"A small anchor used for warping a vessel, or for keeping her steady in a tide-way.","examples":[{"sentence":"The sailors used a kedge-anchor to warp the boat into deeper water.","translation":"船乗りたちは小型ボートをより深い水域に移動させるために、小型の錨を使用した。"},{"sentence":"They dropped the kedge-anchor to prevent the boat from drifting.","translation":"彼らはボートが漂流するのを防ぐために小型の錨を降ろした。"}],"collocations":["drop a kedge-anchor","weigh a kedge-anchor","warp with a kedge-anchor"],"synonyms":["small anchor"],"antonyms":["bower anchor","stream anchor","sheet anchor"]}],"etymology":{"value":"Middle English *kedge*, possibly from a Scandinavian source.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɛdʒˌæŋkər/","syllables":"kedge-an-chor"},"inflection":{"noun_plural":"kedge-anchors"},"usage_notes":{"explanation":"A *kedge-anchor* is a relatively small and light anchor compared to the main anchors (bower, stream, or sheet anchors) of a vessel. It is primarily used for tasks such as warping (moving a vessel by hauling on a line attached to the anchor), kedging (moving a vessel in a calm by repeatedly dropping and retrieving a kedge-anchor), or temporarily securing a small boat.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ship used its kedge-anchor as its main anchor in the storm.","correct":"✓ The ship used its bower anchor as its main anchor in the storm.","note":"A kedge-anchor is too small to be used as a main anchor, especially in rough weather. Bower anchors are the primary anchors for most situations."},{"incorrect":"✗ They used a kedge-anchor to moor the large cargo ship.","correct":"✓ They used a large mooring buoy to moor the large cargo ship.","note":"Kedge-anchors are not typically used for mooring large vessels. Mooring buoys or larger anchors are more suitable."}],"priority":"★★☆"},"related_words":{"derivatives":["kedging (verb: using a kedge-anchor to move a vessel)"],"phrasal_verbs":[],"related_terms":["anchor","warp","kedging","moor","bower anchor","stream anchor","sheet anchor"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *kedge-anchor* is a specialized nautical term referring to a small anchor used for specific purposes such as warping or kedging a vessel. Understanding its function requires familiarity with nautical terminology and practices. It is not a commonly used word outside of maritime contexts."},"example_sentences":[{"sentence":"The crew deployed the kedge-anchor to pull the sailboat off the sandbar.","translation":"乗組員は、ヨットを砂州から引き離すために小型の錨を展開した。","type":"noun","meaning_category":"small anchor"},{"sentence":"Using the kedge-anchor, they slowly warped the boat upstream against the current.","translation":"小型の錨を使って、彼らはゆっくりと流れに逆らってボートを上流に移動させた。","type":"noun","meaning_category":"small anchor"}]}