{"word":"Secularizers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"世俗化する人々、世俗主義者たち","english_definition":"Plural form of 'secularizer', referring to individuals or groups who promote or implement secularization, the process by which religion loses social and cultural significance.","examples":[{"sentence":"The secularizers aimed to remove religious influence from public education.","translation":"世俗主義者たちは公教育から宗教の影響を取り除くことを目指した。"},{"sentence":"Some historians view the French Revolution as a period driven by secularizers.","translation":"一部の歴史家は、フランス革命を世俗主義者たちによって推進された時代と見なしている。"}],"collocations":["modern secularizers","early secularizers","influential secularizers","secularizers of society","secularizers of culture"],"synonyms":["secularists","modernizers","rationalists","humanists","non-believers"],"antonyms":["religious conservatives","traditionalists","fundamentalists","theocrats"]}],"etymology":{"value":"Derived from 'secularize', which comes from 'secular', ultimately from Latin 'saecularis' meaning 'belonging to an age or generation', from 'saeculum' meaning 'age, generation'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɛkjʊləˌraɪzərz","syllables":"sec-u-lar-i-zers"},"inflection":{"noun_plural":"Secularizers"},"usage_notes":{"explanation":"'Secularizers' refers to those who actively work to reduce the role of religion in public life and society. This can involve advocating for separation of church and state, promoting rationalism and science, or challenging traditional religious beliefs and practices. The term often carries a connotation of intentional effort to make society less religious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The secularizers is promoting atheism.","correct":"✓ The secularizers are promoting atheism.","note":"'Secularizers' is a plural noun, so it requires a plural verb form ('are' instead of 'is')."},{"incorrect":"✗ Secularizers believe in God.","correct":"✓ Secularizers do not believe in God.","note":"Generally, secularizers advocate for a non-religious or less religious society, so they typically do not adhere to traditional religious beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["secularize (verb)","secularization (noun)","secular (adjective)","secularism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Secularizers' is a term used in academic and sociological contexts to describe individuals or groups who actively promote the separation of religious influence from public and social life. Understanding this term requires familiarity with the concept of secularization and its historical and contemporary implications. The word is less common in everyday conversation and more frequently encountered in scholarly discussions about religion, politics, and society."},"example_sentences":[{"sentence":"The secularizers argued for a more inclusive and rational approach to governance.","translation":"世俗主義者たちは、より包括的で合理的な統治へのアプローチを主張した。","type":"noun","meaning_category":"世俗化を推進する人々"},{"sentence":"Modern secularizers often focus on issues such as LGBTQ+ rights and reproductive freedom.","translation":"現代の世俗主義者たちは、しばしばLGBTQ+の権利やリプロダクティブ・ヘルス/ライツなどの問題に焦点を当てている。","type":"noun","meaning_category":"世俗化を推進する人々"},{"sentence":"The influence of secularizers can be seen in the decline of religious observance in many Western countries.","translation":"世俗主義者たちの影響は、多くの西欧諸国における宗教的慣習の衰退に見ることができる。","type":"noun","meaning_category":"世俗化を推進する人々"}]}