{"word":"micropetrography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"岩石薄片の顕微鏡観察による岩石組織の研究","english_definition":"The study of the texture of rocks by microscopic examination of thin sections.","examples":[{"sentence":"Micropetrography is an essential tool for identifying minerals in fine-grained rocks.","translation":"微小岩石学は、細粒岩石中の鉱物を特定するための不可欠なツールです。"}],"collocations":["thin section micropetrography","quantitative micropetrography"],"synonyms":["petrographic microscopy","thin section analysis"],"antonyms":[]}],"etymology":{"value":"\"micro-\" (小さい) + \"petrography\" (岩石組織学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊpɪˈtrɒɡrəfi/","syllables":"mi-cro-pe-trog-ra-phy"},"inflection":{"noun_plural":"micropetrographies"},"usage_notes":{"explanation":"Micropetrography involves preparing a thin slice of rock (a thin section) and examining it under a polarized light microscope. This allows geologists to identify minerals, textures, and structures that are too small to see with the naked eye.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["micropetrographic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Micropetrography is a specialized term used in geology, specifically in the field of petrology. It refers to the microscopic study of rock textures and mineral composition using thin sections of rocks. This technique requires a strong understanding of mineralogy, optics, and rock formation processes. The term itself is not commonly used outside of geological contexts."},"example_sentences":[{"sentence":"The micropetrography of the basalt sample revealed the presence of olivine and plagioclase.","translation":"玄武岩試料の微小岩石学的分析により、かんらん石と斜長石の存在が明らかになった。","type":"noun","meaning_category":"岩石組織の研究"},{"sentence":"Detailed micropetrography is necessary to fully characterize the metamorphic rock.","translation":"変成岩を完全に特徴づけるためには、詳細な微小岩石学的分析が必要である。","type":"noun","meaning_category":"岩石組織の研究"}]}