{"word":"reading-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"読解に基づいた、読書を基礎とした","english_definition":"Based on or derived from reading; relying on reading as a primary source of information or skill development.","examples":[{"sentence":"The course includes a reading-based assignment where students analyze several articles.","translation":"そのコースには、学生がいくつかの記事を分析する読解に基づいた課題が含まれています。"},{"sentence":"His research is reading-based, focusing on historical documents and literary texts.","translation":"彼の研究は読書を基礎としており、歴史的文書や文学作品に焦点を当てています。"},{"sentence":"We offer a reading-based program to improve comprehension skills.","translation":"読解力を向上させるための読書を基礎としたプログラムを提供しています。"}],"collocations":["reading-based assignment (読解に基づいた課題)","reading-based research (読解に基づいた研究)","reading-based program (読解に基づいたプログラム)","reading-based curriculum (読解に基づいたカリキュラム)","reading-based learning (読解に基づいた学習)"],"synonyms":["literature-based","text-based","document-based"],"antonyms":["experience-based","practice-based","activity-based"]}],"etymology":{"value":"The term 'reading-based' is formed by combining the noun 'reading' with the past participle 'based'. 'Reading' refers to the activity of interpreting written or printed matter, while 'based' indicates that something is founded or derived from a particular source. Therefore, 'reading-based' signifies that something is primarily or significantly reliant on reading.","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"read-ing-based"},"inflection":{"notes":"Adjectives do not typically inflect in English, so there are no different forms for number or gender."},"usage_notes":{"explanation":"'Reading-based' is often used to describe educational activities, research methods, or training programs that heavily involve reading. It implies that the primary way of learning or gathering information is through written materials. It is often contrasted with methods that emphasize hands-on experience, practical application, or auditory learning.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The class is base on reading.","correct":"✓ The class is reading-based.","note":"The correct adjective form is 'reading-based,' not 'base on reading'."},{"incorrect":"✗ The study was reading base.","correct":"✓ The study was reading-based.","note":"The correct adjective form is 'reading-based,' not 'reading base'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["reading (noun)","base (verb)","based (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'reading-based' is used to describe something that relies heavily on reading. It is often used in academic or educational contexts to describe courses, assignments, or research that require a significant amount of reading. The word is relatively straightforward but may not be commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"The exam was entirely reading-based, requiring students to analyze passages from several novels.","translation":"試験は完全に読解に基づいたもので、学生はいくつかの小説からの文章を分析する必要がありました。","type":"general","meaning_category":"読解に基づいた"},{"sentence":"The company's training program is reading-based, with employees required to study manuals and articles.","translation":"その会社の研修プログラムは読書を基礎としており、従業員はマニュアルや記事を学習する必要があります。","type":"general","meaning_category":"読解に基づいた"}]}