{"word":"Analemma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学) 均時差曲線、アナレンマ","english_definition":"(astronomy) a diagram showing the variation of the sun's declination and equation of time throughout the year. It resembles a figure-eight and represents the sun's apparent position in the sky at a specific time of day (usually noon) as viewed from a fixed location on Earth over the course of a year.","examples":[{"sentence":"The analemma is often superimposed on globes to show the sun's position at noon throughout the year.","translation":"均時差曲線は、一年を通して正午の太陽の位置を示すために、地球儀に重ねて表示されることが多い。"},{"sentence":"By photographing the sun from the same location at the same time each day, you can create an image of the analemma.","translation":"毎日同じ場所から同じ時刻に太陽を撮影することで、均時差曲線のイメージを作成できる。"}],"collocations":["photograph an analemma (均時差曲線を撮影する)","create an analemma (均時差曲線を作成する)","observe an analemma (均時差曲線を観察する)","analemma shape (均時差曲線の形状)","solar analemma (太陽均時差曲線)"],"synonyms":["figure-eight solar curve","equation of time curve"],"antonyms":[]}],"etymology":{"value":"「Analemma」という言葉は、古代ギリシャ語の「ἀνάλημμα (analēmma)」に由来します。これは「支え、台」または「投影」を意味し、元々は日時計の作図法に関連する用語でした。日時計の針の影が指す位置を投影して得られる曲線、特に太陽の赤緯の変化を示す曲線を指すようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈlɛmə/","syllables":"a-na-lem-ma"},"inflection":{"noun_plural":"Analemmas / Analemmata (まれ)"},"usage_notes":{"explanation":"「**Analemma**」は、天文学の分野で使用される専門用語であり、日常会話ではほとんど使われません。主に、太陽の動きや地球の軌道に関する議論や、天文学的な図表や説明の中で見られます。均時差曲線は、太陽の位置が一年を通してどのように変化するかを視覚的に表現したもので、その独特な形状（通常は8の字型）が特徴です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an anaconda in the sky, it looked like an analemma.","correct":"✓ I saw an analemma in the sky. It is a figure-eight shaped representation of the sun's position throughout the year.","note":"`analemma`（均時差曲線）と `anaconda`（アナコンダ）は全く異なる単語です。"},{"incorrect":"✗ The analemma shows the phases of the moon.","correct":"✓ The analemma shows the sun's position at a specific time of day throughout the year.","note":"均時差曲線は、月の満ち欠けではなく、太陽の位置の変化を示します。"}],"priority":"★★☆"},"related_words":{"derivatives":["analemmatic (形容詞：均時差曲線の)"],"related_terms":["declination (赤緯)","equation of time (均時差)","solar declination (太陽赤緯)","celestial sphere (天球)","ecliptic (黄道)","solar noon (太陽正午)","gnomon (日時計の針)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 天文学の専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Analemma**」は、天文学で使われる専門的な言葉で、一年を通して毎日同じ時刻に見た太陽の位置を記録したときにできる、8の字のような形をした曲線を指します。これは、地球の軌道が完全な円ではなく、少し楕円形であることと、地球の自転軸が傾いているために起こります。この言葉は、日常会話ではほとんど使われませんが、天文学や地球科学の分野では重要な概念です。均時差曲線は、日時計の精度を理解したり、太陽の動きを視覚的に表現したりするのに役立ちます。"},"example_sentences":[{"sentence":"The **analemma** is a visual representation of the sun's apparent movement in the sky over a year.","translation":"均時差曲線は、一年間の太陽の見かけの動きを視覚的に表現したものです。","type":"noun","meaning_category":"天文学"},{"sentence":"By photographing the sun from the same spot at the same time each day, you can create your own **analemma**.","translation":"毎日同じ場所から同じ時刻に太陽を撮影することで、独自の均時差曲線を作成できます。","type":"noun","meaning_category":"天文学"},{"sentence":"The shape of the **analemma** is due to the Earth's axial tilt and elliptical orbit.","translation":"均時差曲線の形状は、地球の自転軸の傾きと楕円軌道によるものです。","type":"noun","meaning_category":"天文学"}]}