{"word":"obesity-positive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"肥満肯定的な、肥満を肯定的に捉える","english_definition":"promoting or characterized by a positive view of obesity; challenging negative stereotypes and discrimination against obese people.","examples":[{"sentence":"The movement aims to create a more obesity-positive culture.","translation":"その運動は、より肥満肯定的な文化を創造することを目指しています。"},{"sentence":"She identifies as obesity-positive and advocates for body acceptance.","translation":"彼女は自身を肥満肯定と認識し、身体の受容を提唱しています。"}],"collocations":["obesity-positive movement (肥満肯定運動)","obesity-positive advocate (肥満肯定の提唱者)","obesity-positive community (肥満肯定コミュニティ)"],"synonyms":["fat-positive","body-positive","size-positive"],"antonyms":["fat-shaming","weight-stigmatizing"],"notes":"This term is often used within the body positivity movement."}],"etymology":{"value":"'Obesity' (肥満) + 'positive' (肯定的な)","priority":"★★★"},"pronunciation":{"ipa":"/oʊˈbiːsɪti ˈpɒzətɪv/","syllables":"o-be-si-ty po-si-tive"},"inflection":{},"usage_notes":{"explanation":"'Obesity-positive' is a term used to describe attitudes, movements, or individuals that challenge negative stereotypes and discrimination against people with obesity. It is often associated with the body positivity movement, which promotes acceptance and appreciation of all body types, regardless of size or shape. The term can be controversial, as some people believe that it normalizes or encourages unhealthy lifestyles.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["obesity (肥満)","positive (肯定的な)","body positivity (身体肯定)","fat acceptance (肥満受容)"],"related_concepts":["Health at Every Size (HAES)","weight stigma","fat shaming"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Obesity-positive' is a term used to describe the attitude of accepting and valuing people who are obese, and challenging the negative stereotypes and discrimination they often face. It's related to the broader 'body positivity' movement, which promotes the idea that all bodies are good bodies, regardless of size, shape, or ability. This term can be controversial, as some argue that it normalizes or encourages unhealthy lifestyles. It's important to understand the nuances and context when discussing this topic."},"example_sentences":[{"sentence":"The artist's work is a celebration of diverse bodies and an expression of an obesity-positive perspective.","translation":"そのアーティストの作品は、多様な身体を祝福し、肥満肯定的な視点を表現しています。","type":"general","meaning_category":"肥満肯定的な視点"},{"sentence":"The organization promotes obesity-positive messages to combat weight stigma and discrimination.","translation":"その組織は、体重に関する偏見や差別と闘うために、肥満肯定的なメッセージを推進しています。","type":"general","meaning_category":"肥満肯定的なメッセージ"}]}