{"word":"characterology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"性格学、人相学","english_definition":"The study of character, especially the attempt to determine personality traits from external features or handwriting.","examples":[{"sentence":"Characterology was once considered a legitimate science, but it is now largely discredited.","translation":"性格学はかつて正当な科学と見なされていましたが、現在ではほとんど信用されていません。"},{"sentence":"Some people still believe in characterology and use it to make judgments about others.","translation":"性格学を信じ、それを使って他人を判断する人もいます。"}],"collocations":["scientific characterology","historical characterology","modern characterology"],"synonyms":["personology","personality theory","physiognomy","graphology"],"antonyms":[]}],"etymology":{"value":"From 'character' + '-ology'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkærəktəˈrɒlədʒi/","syllables":"ca-rac-ter-o-lo-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Characterology is a field of study that attempts to understand and classify personality traits. Historically, it involved analyzing physical features (physiognomy) or handwriting (graphology) to infer personality. However, these methods are now largely considered pseudoscientific. Modern personality psychology relies on more empirical and validated methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a characterology.","correct":"✓ He studies characterology.","note":"'Characterology' is a field of study, not a person. You can't 'be' a characterology; you can study it or be a characterologist."}],"priority":"★★☆"},"related_words":{"derivatives":["characterological (adjective)","characterologist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Characterology' is a specialized term referring to the study of character and personality, often through methods now considered pseudoscientific like physiognomy or graphology. It is not a common word and is primarily used in academic or historical contexts related to psychology and the history of science."},"example_sentences":[{"sentence":"The professor lectured on the history of characterology and its influence on early psychological theories.","translation":"教授は性格学の歴史と、それが初期の心理学理論に与えた影響について講義しました。","type":"noun","meaning_category":"性格学"},{"sentence":"Despite its lack of scientific validity, characterology continues to fascinate some people.","translation":"科学的妥当性がないにもかかわらず、性格学は一部の人々を魅了し続けています。","type":"noun","meaning_category":"性格学"}]}