{"word":"subcultrated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having a subcultrate surface; having a surface that is somewhat crusty or covered with a thin layer of a different substance.","english_definition":"Describing a surface that is somewhat crusty or covered with a thin layer of a different substance.","examples":[{"sentence":"The lichen had a subcultrated thallus, making it difficult to identify.","translation":"その地衣類は表面がやや痂状であったため、識別が困難だった。"},{"sentence":"The mineral specimen exhibited a subcultrated appearance due to the deposition of secondary minerals.","translation":"その鉱物標本は、二次鉱物の沈着により、表面がやや痂状を呈していた。"}],"collocations":["subcultrated surface","subcultrated thallus","subcultrated appearance"],"synonyms":["crustose","encrusted","coated"],"antonyms":["smooth","uncoated"]}],"etymology":{"value":"Derived from 'sub-' (meaning 'under' or 'somewhat') and 'cultrate' (meaning 'knife-shaped' or 'crust-like'). The term suggests a surface that is not fully crustose but has a tendency towards it.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈkʌltreɪtɪd/","syllables":"sub-cul-tra-ted"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'subcultrated' is primarily used in botany (especially lichenology) and mineralogy to describe a surface texture. It indicates that the surface is not entirely smooth or bare but has a thin, crust-like layer or appearance. The prefix 'sub-' suggests that the characteristic is present to a lesser degree than a fully developed crustose surface.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subcultrated rock was easy to break.","correct":"✓ The rock with a subcultrated surface was easy to break.","note":"The term describes the surface texture, not the entire object. Clarify that it is the surface that is subcultrated."}],"priority":"★☆☆"},"related_words":{"derivatives":["subcultrate (adjective, noun)"],"related_terms":["crustose","thallus","lichenology","mineralogy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized scientific vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'subcultrated' is a highly specialized term primarily used in scientific fields such as botany and mineralogy. It describes a surface texture that is somewhat crusty or covered with a thin layer. Due to its limited usage and technical nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The geologist noted the subcultrated texture of the rock sample under the microscope.","translation":"地質学者は、顕微鏡下で岩石サンプルの表面がやや痂状であることに注目した。","type":"adjective","meaning_category":"Describing surface texture"},{"sentence":"The subcultrated nature of the lichen's thallus made accurate species identification challenging.","translation":"その地衣類の葉状体の表面がやや痂状であるため、正確な種の同定が困難であった。","type":"adjective","meaning_category":"Describing surface texture"}]}