{"word":"paradoxicalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"逆説主義；逆説的な性質または傾向","english_definition":"A fondness for paradoxes; the use of paradoxes; a paradoxical nature or tendency.","examples":[{"sentence":"The author's paradoxicalism is evident in his constant use of contradictory statements to make a point.","translation":"その著者の逆説主義は、主張を明確にするために矛盾した記述を常に用いる点に明らかである。"},{"sentence":"Her paradoxicalism made it difficult to understand her true feelings.","translation":"彼女の逆説主義は、彼女の本当の気持ちを理解することを困難にした。"}],"collocations":["intellectual paradoxicalism (知的な逆説主義)","philosophical paradoxicalism (哲学的な逆説主義)"],"synonyms":["paradoxicality","contradictoriness","self-contradiction"],"antonyms":["consistency","straightforwardness"]}],"etymology":{"value":"\"paradoxical\" + \"-ism\".  \"Paradoxical\" comes from the word \"paradox\", which originates from the Greek word \"paradoxos\" meaning 'contrary to expectation'. The suffix \"-ism\" denotes a doctrine, principle, or distinctive practice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈdɒksɪkəlɪzəm/","syllables":"par-a-dox-i-cal-ism"},"inflection":{"noun_plural":"paradoxicalisms"},"usage_notes":{"explanation":"\"Paradoxicalism\" is a relatively uncommon word that refers to a fondness for or use of paradoxes, or the quality of being paradoxical. It often implies a deliberate or stylistic use of contradictory statements or ideas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His paradoxicalism is make me confused.","correct":"✓ His paradoxicalism makes me confused.","note":"\"Paradoxicalism\" is a noun, so it requires a verb that agrees in number. In this case, the singular noun \"paradoxicalism\" requires the singular verb \"makes\"."},{"incorrect":"✗ She showed a great paradoxicalism in her life.","correct":"✓ She showed great paradoxicality in her life.","note":"While \"paradoxicalism\" is correct, \"paradoxicality\" is a more common and natural-sounding alternative. Both refer to the quality of being paradoxical."}],"priority":"★★☆"},"related_words":{"derivatives":["paradox (名詞: 逆説)","paradoxical (形容詞: 逆説的な)","paradoxically (副詞: 逆説的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"paradoxicalism\" refers to the use of or fondness for paradoxes, which are statements that appear self-contradictory but contain a deeper truth. This term is not commonly used in everyday language and is more frequently found in philosophical or literary contexts. Understanding the root word \"paradox\" is essential for grasping the meaning of \"paradoxicalism.\""},"example_sentences":[{"sentence":"The essay explored the paradoxicalism inherent in modern political discourse.","translation":"そのエッセイは、現代の政治的議論に内在する逆説主義を探求した。","type":"general","meaning_category":"逆説的な性質"},{"sentence":"His philosophical paradoxicalism often challenged conventional wisdom.","translation":"彼の哲学的な逆説主義は、しばしば従来の知恵に挑戦した。","type":"specific","meaning_category":"逆説主義"}]}