{"word":"lintier","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who works with or is knowledgeable about lint, especially in the context of textiles or laundry.","english_definition":"A person who works with or is knowledgeable about lint.","examples":[{"sentence":"The lintier carefully examined the fabric for any imperfections caused by excess lint.","translation":"そのlintierは、余分な糸くずによって引き起こされた欠陥がないか、生地を注意深く調べました。"},{"sentence":"As a seasoned lintier, she could identify the source of the lint buildup in the dryer with ease.","translation":"ベテランのlintierとして、彼女は乾燥機内の糸くずの蓄積の原因を簡単に見つけることができました。"}],"collocations":["professional lintier","experienced lintier","textile lintier","laundry lintier"],"synonyms":["textile specialist","laundry expert","fabric inspector"],"antonyms":[]}],"etymology":{"value":"Likely a derivative of 'lint' with the agentive suffix '-ier'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈlɪntiər/","syllables":"lin-ti-er"},"inflection":{"noun_plural":"lintiers"},"usage_notes":{"explanation":"The term 'lintier' is not a widely recognized or commonly used word in standard English. It is a neologism, possibly used in specialized contexts related to textiles or laundry, to describe someone who deals with lint. Its usage is limited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lintier is responsible for cleaning the lints.","correct":"✓ The lintier is responsible for removing the lint."}],"priority":"★☆☆"},"related_words":{"derivatives":["lint","linty"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'lintier' is a rare and specialized term, not typically encountered in general English. Understanding its meaning requires knowledge of the base word 'lint' and the function of the '-ier' suffix. Due to its limited usage, it is more likely to be understood by those with expertise in textiles or laundry."},"example_sentences":[{"sentence":"The factory hired a lintier to ensure the quality of the finished garments.","translation":"工場は、完成した衣服の品質を保証するためにlintierを雇いました。","type":"noun","meaning_category":"textiles"},{"sentence":"Only a skilled lintier could remove all traces of the stubborn fibers from the delicate fabric.","translation":"熟練したlintierだけが、繊細な生地から頑固な繊維の痕跡をすべて取り除くことができました。","type":"noun","meaning_category":"laundry"}]}