{"word":"uranin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウラニン","english_definition":"A water-soluble dye used as a tracer, especially in hydrology, and also in ophthalmology to detect corneal lesions.","examples":[{"sentence":"Uranin is often used to trace the flow of water in underground rivers.","translation":"ウラニンは、地下河川における水の流れを追跡するためによく使用されます。"},{"sentence":"The ophthalmologist used uranin to check for damage to the patient's cornea.","translation":"眼科医は、患者の角膜の損傷を確認するためにウラニンを使用しました。"}],"collocations":["uranin dye","uranin solution","trace with uranin"],"synonyms":["fluorescein sodium","D&C Yellow No. 8"],"antonyms":[]}],"etymology":{"value":"Derived from 'uranium' (referring to its yellow-green fluorescence) and the chemical suffix '-in'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈjʊərənɪn","syllables":"u-ra-nin"},"inflection":{"noun_plural":"uranins"},"usage_notes":{"explanation":"Uranin is a synthetic organic salt. It's highly fluorescent, making it easily detectable even in small concentrations. It is primarily used as a tracer dye in various applications, including hydrology (studying water movement) and medicine (diagnosing eye conditions).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Uranin is a type of uranium.","correct":"✓ Uranin is a dye, not a form of uranium.","note":"Uranin is a fluorescent dye, while uranium is a radioactive element. They are chemically distinct."}],"priority":"★★☆"},"related_words":{"derivatives":["fluorescein","dye","tracer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Uranin is a technical term primarily used in scientific and medical contexts. It refers to a specific type of fluorescent dye used for tracing and diagnostic purposes. Understanding its usage requires familiarity with scientific vocabulary related to chemistry, hydrology, or ophthalmology."},"example_sentences":[{"sentence":"The researchers added uranin to the stream to track its course through the forest.","translation":"研究者たちは、森の中を流れる小川の経路を追跡するために、ウラニンを加えました。","type":"noun","meaning_category":"tracer dye"},{"sentence":"A uranin solution was used to highlight any abrasions on the cornea during the eye exam.","translation":"眼科検査中に、角膜の擦り傷を強調するために、ウラニン溶液が使用されました。","type":"noun","meaning_category":"ophthalmological dye"}]}