{"word":"interjectionary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"間投詞の、感動詞の","english_definition":"Of, relating to, or characteristic of an interjection.","examples":[{"sentence":"The sentence was filled with interjectionary remarks.","translation":"その文章は間投詞的な発言で満たされていた。"},{"sentence":"He used an interjectionary phrase to express his surprise.","translation":"彼は驚きを表現するために間投詞的なフレーズを使った。"}],"collocations":["interjectionary phrase","interjectionary remark","interjectionary word"],"synonyms":["exclamatory","interjectional"],"antonyms":[]}],"etymology":{"value":"From interjection + -ary.","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌɪntərdʒekʃəneri","syllables":"in-ter-jec-tion-ar-y"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not common for this word."},"usage_notes":{"explanation":"'Interjectionary' is an adjective that describes something related to or characteristic of an interjection. Interjections are words or phrases used to express sudden emotion or feeling. Therefore, 'interjectionary' describes something that has this quality.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interjectionary was used incorrectly.","correct":"✓ The interjection was used incorrectly.","note":"'Interjectionary' is an adjective, not a noun. Use 'interjection' as the noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["interjection (noun): An abrupt remark, especially as an aside or interruption.","interject (verb): To say (something) abruptly, especially as an aside."],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interjectionary' is a relatively uncommon adjective that describes something related to an interjection. An interjection is a word or phrase used to express a sudden emotion or feeling, such as 'Wow!' or 'Oh dear!'. Therefore, 'interjectionary' is used to describe something that has this quality of expressing sudden emotion or feeling. Because it is related to a specific grammatical concept, it is not commonly used in everyday conversation, and is more likely to be encountered in academic or formal writing about language."},"example_sentences":[{"sentence":"The speaker's presentation included several interjectionary comments, which added a personal touch.","translation":"講演者のプレゼンテーションには、いくつかの間投詞的なコメントが含まれており、それが個人的な雰囲気を加えていた。","type":"general","meaning_category":"general"},{"sentence":"Her writing style is characterized by frequent interjectionary expressions.","translation":"彼女の文体は、頻繁な間投詞的な表現によって特徴づけられている。","type":"writing style","meaning_category":"writing style"}]}