{"word":"functionalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"機能主義 (社会学、心理学、建築学などにおける理論)","english_definition":"(in sociology, psychology, architecture, etc.) the theory that all aspects of a society serve a function and are necessary for the survival of that society; the design of something according to its purpose rather than its appearance.","examples":[{"sentence":"Functionalism in sociology emphasizes the interdependence of social institutions.","translation":"社会学における機能主義は、社会制度の相互依存性を強調する。"},{"sentence":"The functionalism of the building is evident in its efficient use of space.","translation":"その建物の機能主義は、空間の効率的な利用に明らかである。"},{"sentence":"Functionalism views society as a system with interdependent parts.","translation":"機能主義は、社会を相互依存的な部分からなるシステムとして捉える。"}],"collocations":["structural functionalism (構造機能主義)","architectural functionalism (建築機能主義)","psychological functionalism (心理学的機能主義)","social functionalism (社会機能主義)"],"synonyms":["structuralism","holism","systems theory"],"antonyms":["conflict theory","individualism"]},{"part_of_speech":"noun","definition":"機能主義 (哲学における心の理論)","english_definition":"(in philosophy of mind) the theory that mental states are constituted solely by their functional role – that is, they are causal relations to other mental states, sensory inputs, and behavioral outputs.","examples":[{"sentence":"Functionalism argues that mental states are defined by what they do, not what they are made of.","translation":"機能主義は、精神状態はそれが何でできているかではなく、何をするかによって定義されると主張する。"},{"sentence":"According to functionalism, a mental state can be realized by different physical states.","translation":"機能主義によれば、精神状態は異なる物理状態によって実現されうる。"},{"sentence":"Functionalism is a dominant theory in contemporary philosophy of mind.","translation":"機能主義は、現代の心の哲学における支配的な理論である。"}],"collocations":["machine functionalism (機械機能主義)","computational functionalism (計算機能主義)","role functionalism (役割機能主義)"],"synonyms":["behaviorism","identity theory","eliminative materialism"],"antonyms":["dualism","substance dualism"]}],"etymology":{"value":"\"Function\" + \"-al\" + \"-ism\".  Derived from the concept of focusing on the function or purpose of something, rather than its structure or form.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌŋkʃənəlɪzəm/","syllables":"func-tion-al-ism"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"Functionalism is a broad term that refers to different theoretical perspectives across various disciplines. In sociology, it views society as a complex system whose parts work together to promote solidarity and stability. In psychology, it focuses on the purpose of mental processes in adapting to the environment. In architecture and design, it emphasizes practicality and utility over aesthetics. In philosophy of mind, it's a theory about the nature of mental states. It's important to specify the context when using this term to avoid ambiguity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Functionalism is only about architecture.","correct":"✓ Functionalism is a theory used in sociology, psychology, architecture, and philosophy.","note":"Functionalism applies to various fields, not just architecture."},{"incorrect":"✗ Functionalism believes that everything is equal.","correct":"✓ Functionalism believes that every part of a system has a function.","note":"Functionalism focuses on the function of each part, not necessarily equality."}],"priority":"★★☆"},"related_words":{"derivatives":["functional (形容詞: 機能的な)","function (名詞: 機能；動詞: 機能する)","dysfunctional (形容詞: 機能不全の)","structuralism (名詞: 構造主義)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (専門的な文脈で使用される)","frequency_google_ngram":"比較的低い (Relatively low) - 学術的な分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**functionalism**」は、社会学、心理学、建築学、哲学など、さまざまな分野で使われる専門用語です。基本的には、あるシステムや構造の「機能」や「目的」に焦点を当てる考え方を指します。例えば、社会学では、社会の各部分（家族、教育、経済など）が、社会全体の安定や維持のためにどのような役割を果たしているかを分析します。建築学では、建物の美しさよりも、使いやすさや効率性を重視するデザインを指します。哲学では、心の状態を、その機能的な役割（入力、出力、他の心の状態との関係）によって定義する理論です。それぞれの分野で少しずつ意味合いが異なるため、文脈を理解することが重要です。"},"example_sentences":[{"sentence":"Robert Merton refined the concept of **functionalism** in sociology.","translation":"ロバート・マートンは、社会学における機能主義の概念を洗練した。","type":"noun","meaning_category":"社会学"},{"sentence":"**Functionalism** in architecture often leads to minimalist designs.","translation":"建築における機能主義は、しばしばミニマリストなデザインにつながる。","type":"noun","meaning_category":"建築学"},{"sentence":"**Functionalism** in psychology examines the purpose of consciousness.","translation":"心理学における機能主義は、意識の目的を調べる。","type":"noun","meaning_category":"心理学"},{"sentence":"**Functionalism** faces challenges from other theories of mind.","translation":"機能主義は、心の他の理論からの挑戦に直面している。","type":"noun","meaning_category":"哲学"}]}