{"word":"Prem","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(インド系の名前) प्रेम (Prem)の英語表記。主に男性名として使われる。愛情、愛着、愛情を込めた気持ちといった意味合いを持つ。","english_definition":"(Indian name) An English transliteration of the name प्रेम (Prem), primarily used as a male given name. It carries the meaning of love, affection, and loving feelings.","examples":[{"sentence":"Prem is a common name in India, often given to boys.","translation":"Premはインドで一般的な名前で、男の子によく付けられます。"},{"sentence":"He introduced himself as Prem.","translation":"彼はPremと自己紹介しました。"}],"collocations":["Prem Kumar","Prem Singh","Prem Chopra"],"synonyms":["Love","Affection","Devotion"],"antonyms":["Hatred","Dislike"],"related_cultural_notes":"In Hinduism, प्रेम (Prem) is considered one of the highest forms of love, often associated with divine love and devotion.","etymology":{"value":"The name Prem originates from the Sanskrit word प्रेम (prēma), which means 'love', 'affection', or 'tenderness'.","priority":"★★★"},"pronunciation":{"ipa":"/prem/","syllables":"Prem"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms or different inflections."},"usage_notes":{"explanation":"Prem is a relatively common name in India and among the Indian diaspora. It is often chosen for its positive connotations of love and affection. The name is more frequently used as a given name, but it can also be found as a part of surnames.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Prems are very kind people.","correct":"✓ Prem is a kind person.","note":"When referring to a specific individual named Prem, use the singular form. The plural form is not typically used unless referring to multiple individuals named Prem."}],"priority":"★★☆"},"related_words":{"derivatives":["Premal (related name, meaning 'full of love')","Prema (related name, often used for females)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Proper noun)","frequency_google_ngram":"Low frequency, primarily in regions with Indian populations.","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"'Prem' is a name. Names are usually easy to read, but you might not know this name if you don't know people from India. It means 'love'.","priority":"★☆☆"},"example_sentences":[{"sentence":"My friend Prem is a very talented musician.","translation":"私の友達のPremはとても才能のある音楽家です。","type":"example","meaning_category":"Name"},{"sentence":"She felt a deep prem for her family.","translation":"彼女は家族に深い愛情を感じていた。","type":"example","meaning_category":"Love (abstract)"}]}],"additional_notes":"The name Prem is often associated with positive qualities such as kindness, compassion, and a loving nature."}