{"word":"iulidan","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Chinese: 浴兒單) A traditional Chinese festival celebrated on the fifth day of the fifth lunar month, also known as the Double Fifth Festival or Dragon Boat Festival. It is a day for families to gather and participate in various activities, such as eating zongzi (sticky rice dumplings), drinking realgar wine, and watching dragon boat races.","english_definition":"A traditional Chinese festival celebrated on the fifth day of the fifth lunar month, also known as the Double Fifth Festival or Dragon Boat Festival.","examples":[{"sentence":"We celebrate iulidan every year with my family.","translation":"私たちは毎年家族とiulidanを祝います。"}],"collocations":["celebrate iulidan","eat zongzi during iulidan","dragon boat races during iulidan"],"synonyms":["Double Fifth Festival","Dragon Boat Festival"],"antonyms":[]}],"etymology":{"value":"The name 'iulidan' is likely a transliteration of a Chinese term related to the Dragon Boat Festival.","priority":"N/A"},"pronunciation":{"ipa":"/juːˈliːˈdɑːn/","syllables":"yu-li-dan"},"inflection":{"noun_plural":"iulidans"},"usage_notes":{"explanation":"'iulidan' is another name for the Dragon Boat Festival, primarily used in certain regions or dialects. While 'Dragon Boat Festival' is more widely recognized, using 'iulidan' can add a cultural nuance or specificity depending on the context.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"The word 'iulidan' refers to the Dragon Boat Festival, a traditional Chinese holiday. It is less commonly used than 'Dragon Boat Festival' but carries the same cultural significance.","priority":"N/A"},"example_sentences":[{"sentence":"Many families prepare zongzi for iulidan.","translation":"多くの家族がiulidanのために粽を準備します。","type":"noun","meaning_category":"festival"},{"sentence":"The iulidan celebrations include dragon boat races and other traditional activities.","translation":"iulidanの祝祭には、ドラゴンボートレースやその他の伝統的な活動が含まれます。","type":"noun","meaning_category":"festival"}]}