{"word":"hornmouth","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に熱帯に生息する)スイショウガイ属の巻貝","english_definition":"A marine gastropod mollusk of the genus *Terebra*, characterized by its elongated, slender, and pointed shell.","examples":[{"sentence":"The diver found a beautiful hornmouth shell on the seabed.","translation":"ダイバーは海底で美しいスイショウガイの殻を見つけた。"},{"sentence":"Hornmouths are known for their carnivorous feeding habits.","translation":"スイショウガイは肉食性の食性で知られている。"}],"collocations":["hornmouth shell","hornmouth snail","tropical hornmouth"],"synonyms":["auger shell","auger snail"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)口が大きく、声が大きく、騒々しい人","english_definition":"(slang) A person with a loud, boisterous, and often obnoxious manner of speaking.","examples":[{"sentence":"That hornmouth never stops shouting.","translation":"あの口の大きいやつはいつも騒いでいる。"},{"sentence":"Ignore him; he's just a hornmouth trying to get attention.","translation":"無視しろ、彼はただ注目を集めようとしている騒々しいやつだ。"}],"collocations":["loud hornmouth","obnoxious hornmouth","attention-seeking hornmouth"],"synonyms":["loudmouth","blatherskite","braggart"],"antonyms":["quiet person","reserved person"]}],"etymology":{"value":"The term \"hornmouth\" likely refers to the horn-like appearance of the shell's aperture in some species of *Terebra*. The slang usage probably derives from the idea of someone having a \"mouth like a horn,\" meaning loud and projecting.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɔːrnmaʊθ","syllables":"horn-mouth"},"inflection":{"noun_plural":"hornmouths"},"usage_notes":{"explanation":"The term \"hornmouth\" has two distinct meanings. Primarily, it refers to a specific type of marine snail belonging to the genus *Terebra*. These snails are characterized by their long, slender shells and are often found in tropical waters. In slang, \"hornmouth\" is a derogatory term for someone who is loud, boisterous, and often obnoxious. The slang usage is less common than the zoological one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hornmouth bird in the forest.","correct":"✓ I saw a hornmouth shell on the beach.","note":"Hornmouths are marine snails, not birds. They are found in the ocean, not in forests."},{"incorrect":"✗ He's a hornmouth, so he must be a marine biologist.","correct":"✓ He's a hornmouth, always shouting and interrupting.","note":"The slang term \"hornmouth\" refers to a loud, obnoxious person, not necessarily someone involved in marine biology."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Terebra (genus of hornmouth snails)","gastropod","mollusk","shellfish","loudmouth","boisterous","obnoxious"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hornmouth\" is relatively uncommon. Its primary meaning refers to a specific type of marine snail, which is a niche topic. The slang usage is also infrequent and may not be widely understood. Therefore, understanding this word requires a relatively advanced vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The collector carefully added the hornmouth to his collection of seashells.","translation":"収集家は注意深くスイショウガイを彼の貝殻コレクションに加えた。","type":"noun","meaning_category":"Marine snail"},{"sentence":"Don't pay attention to him; he's just a hornmouth trying to start an argument.","translation":"彼に注意を払うな、彼はただ議論を始めようとしている騒々しいやつだ。","type":"noun","meaning_category":"Loud person"}]}