{"word":"iconolatry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偶像崇拝、聖像崇敬","english_definition":"The worship of icons or images; excessive veneration of images or symbols.","examples":[{"sentence":"Some religious groups condemn iconolatry as a form of idolatry.","translation":"一部の宗教団体は、偶像崇拝を偶像崇拝の一形態として非難している。"},{"sentence":"The debate over iconolatry has been a recurring theme in religious history.","translation":"偶像崇拝をめぐる議論は、宗教史における繰り返しのテーマとなっている。"},{"sentence":"The museum exhibit explored the history of iconolatry in various cultures.","translation":"博物館の展示では、さまざまな文化における偶像崇拝の歴史が探求された。"}],"collocations":["religious iconolatry","cultural iconolatry","condemn iconolatry","practice iconolatry","history of iconolatry"],"synonyms":["idolatry","image worship","veneration of images","fetishism"],"antonyms":["iconoclasm","aniconism"]}],"etymology":{"value":"Derived from the Greek words 'eikon' (image) and 'latreia' (worship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪkɒˈnɒlətri/","syllables":"i-co-nol-a-try"},"inflection":{"noun_plural":"iconolatries"},"usage_notes":{"explanation":"Iconolatry refers to the worship or excessive veneration of images, icons, or symbols. It is often used in a religious context to describe the practice of worshiping religious images, but can also be used more broadly to describe excessive admiration or reverence for any image or symbol. The term is often contrasted with iconoclasm, which is the rejection or destruction of images.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was accused of iconolatry for destroying the statue.","correct":"✓ He was accused of iconoclasm for destroying the statue.","note":"Iconolatry is the worship of images, while iconoclasm is the destruction of images."}],"priority":"★★☆"},"related_words":{"derivatives":["iconolater (noun: an image worshipper)","iconolatrous (adjective: relating to or practicing iconolatry)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Iconolatry' is a specialized term primarily used in religious studies, art history, and cultural criticism. It refers to the worship of images or icons, often in a religious context. Understanding this word requires familiarity with concepts of religious veneration and the historical debates surrounding the use of images in worship. It's not a word commonly encountered in everyday language, making it suitable for advanced learners."},"example_sentences":[{"sentence":"The Byzantine Empire experienced periods of intense debate over the legitimacy of iconolatry.","translation":"ビザンチン帝国は、偶像崇拝の正当性をめぐる激しい議論の時代を経験した。","type":"noun","meaning_category":"聖像崇敬"},{"sentence":"Critics of modern consumer culture often accuse it of fostering a kind of iconolatry towards brands and celebrities.","translation":"現代の消費文化の批評家は、ブランドや有名人に対する一種の偶像崇拝を助長していると非難することがよくある。","type":"noun","meaning_category":"偶像崇拝"},{"sentence":"The practice of iconolatry is central to some branches of Christianity.","translation":"偶像崇拝の実践は、キリスト教のいくつかの宗派の中心である。","type":"noun","meaning_category":"聖像崇敬"}]}