{"word":"counterblast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"反論、反撃、対抗策","english_definition":"a strong response or argument made in opposition to something; a retaliatory action or measure.","examples":[{"sentence":"The government issued a strong counterblast to the opposition's accusations.","translation":"政府は野党の非難に対し、強力な反論を発表した。"},{"sentence":"The company launched a media counterblast to repair its damaged reputation.","translation":"その会社は、傷ついた評判を回復するために、メディアを通じた反撃を開始した。"},{"sentence":"His speech was a counterblast against the prevailing cynicism.","translation":"彼の演説は、蔓延するシニシズムに対する反論だった。"}],"collocations":["issue a counterblast","launch a counterblast","media counterblast","political counterblast"],"synonyms":["rebuttal","retort","response","refutation","riposte","rejoinder","counterattack"],"antonyms":["agreement","endorsement","support","acquiescence"]},{"part_of_speech":"verb","definition":"反論する、反撃する","english_definition":"to respond strongly in opposition to something; to retaliate.","examples":[{"sentence":"The senator counterblasted the allegations with detailed evidence.","translation":"その上院議員は、詳細な証拠をもって疑惑に反論した。"},{"sentence":"The organization counterblasted the negative publicity with a series of positive stories.","translation":"その組織は、一連の肯定的な記事でネガティブな報道に反撃した。"}],"collocations":["counterblast allegations","counterblast criticism","counterblast a statement"],"synonyms":["rebut","retort","respond","refute","counterattack"],"antonyms":["agree","endorse","support","concede"]}],"etymology":{"value":"The word 'counterblast' is formed from 'counter-' (meaning 'opposing' or 'in response') and 'blast' (meaning a strong burst or attack). The term originally appeared in a 1604 publication by King James I of England titled 'A Counter-Blaste to Tobacco', where he strongly opposed the use of tobacco.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkaʊntərblæst","syllables":"coun-ter-blast"},"inflection":{"verb_forms":{"present_simple":["counterblast","counterblasts"],"past_simple":"counterblasted","past_participle":"counterblasted","present_participle":"counterblasting"}},"usage_notes":{"explanation":"'Counterblast' is often used to describe a forceful and public response, typically in political, social, or media contexts. It implies a direct and often aggressive opposition to an initial statement or action. The term can be used both as a noun to describe the response itself and as a verb to describe the act of responding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The company issued a counterblast of support for the new policy.","correct":"The company issued a statement of support for the new policy.","note":"'Counterblast' implies opposition, not support. Use 'statement of support' or a similar phrase to indicate approval."},{"incorrect":"He counterblasted with silence.","correct":"He responded with silence.","note":"'Counterblast' implies a strong, verbal or written response, not silence. Use 'responded' or a similar verb to describe a silent reaction."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["counterattack","rebuttal","refutation","retort","response"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'counterblast' is relatively uncommon and is typically used in formal or literary contexts to describe a strong, often public, response or argument against something. It suggests a forceful opposition, similar to a counterattack in a debate or conflict. Understanding the word requires a good vocabulary and familiarity with formal language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The politician's speech was a fierce counterblast against the proposed tax increase.","translation":"その政治家の演説は、提案された増税に対する激しい反論だった。","type":"noun","meaning_category":"反論"},{"sentence":"The newspaper published a counterblast to the allegations of bias.","translation":"その新聞は、偏向の疑いに対する反論を掲載した。","type":"noun","meaning_category":"反撃"},{"sentence":"The activist counterblasted the criticism with a well-researched report.","translation":"その活動家は、十分に調査された報告書で批判に反論した。","type":"verb","meaning_category":"反論する"}]}