{"word":"dockhands","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"港湾労働者、船荷役作業員","english_definition":"A person who works at a dock, loading and unloading ships; a longshoreman or stevedore.","examples":[{"sentence":"The dockhands worked tirelessly to unload the cargo ship.","translation":"港湾労働者たちは貨物船から荷物を降ろすために休むことなく働いた。"},{"sentence":"Dockhands are essential for the smooth operation of any port.","translation":"港湾労働者はあらゆる港のスムーズな運営に不可欠である。"}],"collocations":["hire dockhands (港湾労働者を雇う)","dockhands union (港湾労働者組合)","experienced dockhands (経験豊富な港湾労働者)"],"synonyms":["longshoremen","stevedores","wharfies","port workers","harbor workers"],"antonyms":[],"notes":"'Dockhand' is often used interchangeably with 'longshoreman' and 'stevedore', although there might be subtle regional or historical differences in usage."}],"etymology":{"value":"The word 'dockhand' is a compound word formed from 'dock' (a structure built along the shore of a harbor or river for vessels to lie alongside) and 'hand' (a worker, especially a manual laborer).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɒkˌhændz/","syllables":"dock-hands"},"inflection":{"noun_plural":"dockhands"},"usage_notes":{"explanation":"'Dockhands' refers specifically to the people who perform manual labor related to ships in a dock or port. It emphasizes the physical aspect of their work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dockhand repaired the ship's engine.","correct":"✓ The mechanic repaired the ship's engine.","note":"Dockhands load and unload cargo, they do not typically repair engines. That is the job of a mechanic."},{"incorrect":"✗ She is a dockhand, managing the port's finances.","correct":"✓ She is a port manager, overseeing the port's finances.","note":"Dockhands perform manual labor, not administrative tasks. A port manager would oversee finances."}],"priority":"★★☆"},"related_words":{"derivatives":["dock (noun: a structure for ships)","hand (noun: a worker)"],"phrases":["working on the docks (港で働くこと)","down at the docks (港で)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'dockhands' is relatively specific, referring to workers who load and unload ships at a dock. While not extremely common in everyday conversation, it is readily understood in contexts related to shipping, ports, and maritime activities. Understanding the individual words 'dock' and 'hand' provides a good clue to the meaning of the compound word."},"example_sentences":[{"sentence":"The **dockhands** efficiently unloaded the containers from the ship.","translation":"港湾労働者たちは効率的に船からコンテナを降ろした。","type":"example"},{"sentence":"The **dockhands** went on strike for better wages and working conditions.","translation":"港湾労働者たちはより良い賃金と労働条件を求めてストライキに入った。","type":"example"},{"sentence":"The **dockhands** secured the ropes to moor the vessel safely at the pier.","translation":"港湾労働者たちは船を安全に埠頭に係留するためにロープを固定した。","type":"example"}]}