{"word":"chonchina","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Chile, colloquial) A small, insignificant thing; a trifle; a thing of little value.","english_definition":"(Chile, colloquial) A small, insignificant thing; a trifle; a thing of little value.","examples":[{"sentence":"No te preocupes por esa chonchina, no vale la pena. (Don't worry about that trifle, it's not worth it.)","translation":"その些細なことでくよくよしないで、価値がないよ。"}],"collocations":[],"synonyms":["cosa","tontera","nimiedad","bagatela"],"antonyms":["importante","valioso"]}],"etymology":{"value":"Likely of Chilean Spanish origin, possibly related to indigenous languages or other regional dialects, but the exact etymology is uncertain.","priority":"★☆☆"},"pronunciation":{"ipa":"/t͡ʃonˈt͡ʃina/","syllables":"chon-chi-na"},"inflection":{"noun_plural":"chonchinas"},"usage_notes":{"explanation":"\"Chonchina\" is a colloquial term used primarily in Chile to refer to something small, insignificant, or of little value. It's often used to dismiss something as unimportant or not worth worrying about. The word carries a slightly negative connotation, implying that the object or situation is trivial.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in Chilean Spanish.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"chonchina\" is a highly regional and colloquial term, primarily used in Chile. Understanding its meaning and usage requires familiarity with Chilean Spanish slang. It is not a common word and would likely not be understood by speakers of other Spanish dialects or non-native speakers."},"example_sentences":[{"sentence":"Esa chonchina no sirve para nada. (That thing is useless.)","translation":"そのガラクタは何の役にも立たない。","type":"noun","meaning_category":"insignificant thing"},{"sentence":"Deja de preocuparte por esas chonchinas. (Stop worrying about those trifles.)","translation":"そんな些細なことで悩むのはやめなさい。","type":"noun","meaning_category":"trifle"}]}