{"word":"reparations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"賠償金、償い","english_definition":"the making of amends for a wrong one has done, by paying money to or otherwise helping those who have been wronged.","examples":[{"sentence":"Germany paid reparations to the Allied nations after World War I.","translation":"ドイツは第一次世界大戦後、連合国に賠償金を支払った。"},{"sentence":"The company was ordered to pay reparations to the victims of the pollution.","translation":"その会社は、汚染の被害者への賠償金の支払いを命じられた。"},{"sentence":"There are ongoing debates about reparations for slavery.","translation":"奴隷制に対する賠償金については、現在も議論が続いている。"}],"collocations":["pay reparations (賠償金を支払う)","demand reparations (賠償金を要求する)","seek reparations (賠償を求める)","historical reparations (歴史的な賠償)"],"synonyms":["amends","compensation","indemnity","recompense","restitution"],"antonyms":[],"notes":"Often used in the plural form."}],"etymology":{"value":"From the Latin word 'reparare,' meaning 'to repair' or 'restore.' It evolved to signify making amends for damages or wrongs committed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛpəˈreɪʃənz/","syllables":"re-pa-ra-tions"},"inflection":{"noun_plural":"reparations (usually used in plural)"},"usage_notes":{"explanation":"'Reparations' refers to the act of making amends for a wrong or injury, often involving financial compensation. It is commonly used in the context of international relations after wars or conflicts, where a defeated nation is required to pay reparations to the victorious nations. It can also apply to domestic legal cases where a company or individual is ordered to compensate victims of their actions. The term often carries a strong historical and political weight, especially when discussing reparations for historical injustices like slavery or colonialism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reparation was paid to the victims.","correct":"✓ Reparations were paid to the victims.","note":"'Reparations' is typically used in the plural form, even when referring to a single instance of compensation."},{"incorrect":"✗ He asked for a reparation for his broken vase.","correct":"✓ He asked for compensation for his broken vase.","note":"For individual cases of damage, 'compensation' or 'reimbursement' is more appropriate than 'reparations,' which is usually reserved for larger-scale or historical injustices."}],"priority":"★★☆"},"related_words":{"derivatives":["reparative (adjective: serving to repair or restore)","repair (verb: to restore to good condition)","reparation (singular form, less common)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent but important in specific contexts (e.g., history, politics).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reparations' refers to the act of making amends for a wrong, often through financial compensation. This term is frequently encountered in discussions about historical injustices, such as the aftermath of wars or the legacy of slavery, where there are demands for financial payments or other forms of restitution to those who have been wronged. It's a term with significant political and ethical implications, often involving complex historical and economic considerations."},"example_sentences":[{"sentence":"After the war, the defeated country was required to pay substantial **reparations**.","translation":"戦後、敗戦国は多額の賠償金を支払うことを要求された。","type":"noun","meaning_category":"賠償金"},{"sentence":"The descendants of enslaved people are seeking **reparations** for the injustices of the past.","translation":"奴隷にされた人々の末裔は、過去の不正に対する賠償を求めている。","type":"noun","meaning_category":"償い"},{"sentence":"The government is considering the issue of **reparations** for the victims of the environmental disaster.","translation":"政府は、環境災害の被害者への賠償の問題を検討している。","type":"noun","meaning_category":"賠償金"}]}