{"word":"rope-dancer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"綱渡り芸人、ロープダンサー","english_definition":"A performer who dances or performs acrobatic feats on a rope or tightrope.","examples":[{"sentence":"The rope-dancer thrilled the audience with their daring stunts.","translation":"綱渡り芸人は大胆なスタントで観客を魅了した。"},{"sentence":"The circus featured a skilled rope-dancer who balanced effortlessly.","translation":"そのサーカスは、楽々とバランスをとる熟練した綱渡り芸人を呼び物にした。"}],"collocations":["circus rope-dancer","skilled rope-dancer","talented rope-dancer"],"synonyms":["tightrope walker","funambulist","acrobat"],"antonyms":[]}],"etymology":{"value":"The term combines \"rope\" (a thick cord) and \"dancer\" (someone who performs rhythmic movements, especially to music). It describes someone who dances or performs acrobatic feats on a rope.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈroʊpˌdænsər/","syllables":"rope-danc-er"},"inflection":{"noun_plural":"rope-dancers"},"usage_notes":{"explanation":"The term \"rope-dancer\" specifically refers to someone who performs on a rope, often a tightrope. It implies a combination of dancing and acrobatic skills. While \"tightrope walker\" and \"funambulist\" are synonyms, \"rope-dancer\" emphasizes the performance aspect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a rope dancer. He dances with ropes.","correct":"✓ He is a rope-dancer. He performs acrobatic feats on a rope.","note":"A rope-dancer doesn't dance *with* ropes, but *on* a rope. The hyphen is important to indicate the compound noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["rope","dance","dancer"],"phrasal_verbs":[],"related_occupations":["acrobat","circus performer","aerialist"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"rope-dancer\" is relatively uncommon but easily understood. It refers to a performer who combines acrobatic skills with balancing on a rope, often in a circus or similar entertainment setting. The word is a compound noun, combining \"rope\" and \"dancer.\" Understanding the individual words makes the meaning clear.","priority":"★☆☆"},"example_sentences":[{"sentence":"The rope-dancer's performance was the highlight of the evening.","translation":"その綱渡り芸人のパフォーマンスは、その夜のハイライトだった。","type":"example","meaning_category":"general"},{"sentence":"The rope-dancer carefully balanced as they walked across the high wire.","translation":"綱渡り芸人は、高いワイヤーの上を歩く際に慎重にバランスを取った。","type":"example","meaning_category":"performance"},{"sentence":"The audience gasped as the rope-dancer performed a daring flip.","translation":"綱渡り芸人が大胆な宙返りを披露すると、観客は息をのんだ。","type":"example","meaning_category":"skill"}]}