{"word":"weight-biased","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(統計、機械学習などで)重み付けされた、重み付けバイアスのある","english_definition":"(statistics, machine learning, etc.) Having a bias due to the application of weights; influenced disproportionately by certain data points due to their assigned weights.","examples":[{"sentence":"The model is weight-biased towards recent data.","translation":"そのモデルは最近のデータに重み付けバイアスがかかっている。"},{"sentence":"Weight-biased sampling can improve the efficiency of simulations.","translation":"重み付けバイアスのあるサンプリングは、シミュレーションの効率を向上させることができる。"},{"sentence":"We need to correct for the weight-biased estimates.","translation":"重み付けバイアスのある推定値を修正する必要がある。"}],"collocations":["weight-biased sampling","weight-biased estimate","weight-biased model","correct for weight-biased","remove weight-biased"],"synonyms":["weighted","biased","skewed"],"antonyms":["unweighted","unbiased","uniform"],"notes":"This term is commonly used in technical contexts such as statistics, machine learning, and data analysis."}],"etymology":{"value":"A combination of 'weight' (referring to the numerical value assigned to data points) and 'biased' (meaning having a tendency to favor certain outcomes or data).","priority":"N/A"},"pronunciation":{"ipa":"/ˈweɪtˌbaɪəst/","syllables":"weight-bi-ased"},"inflection":{"notes":"The adjective 'weight-biased' does not have different forms for gender or number."},"usage_notes":{"explanation":"The term 'weight-biased' describes a situation where certain elements within a dataset or model are given more importance or influence than others through the assignment of weights. This can be intentional, for example, to emphasize more recent data or to correct for known biases. However, it can also inadvertently introduce bias if not handled carefully. It is often used in discussions of statistical models, machine learning algorithms, and sampling techniques.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is weight-biased to the positive.","correct":"✓ The data is weight-biased towards the positive.","note":"The correct preposition to use with 'weight-biased' is 'towards' when indicating the direction of the bias."},{"incorrect":"✗ The model is weight biased.","correct":"✓ The model is weight-biased.","note":"It is generally written as a hyphenated word: 'weight-biased'."}],"priority":"N/A"},"related_words":{"derivatives":["weighting (noun): the process of assigning weights","bias (noun): a tendency to favor certain outcomes","weighted (adjective): having weights assigned"],"related_terms":["sampling bias","selection bias","statistical bias","machine learning bias"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in technical literature.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Weight-biased' describes a situation where some data points are given more importance than others when analyzing data or building models. This can happen intentionally to improve accuracy or unintentionally due to how the data was collected. It's a technical term used in statistics and machine learning, indicating that the results are influenced more by some data points than others because those points have been assigned higher 'weights'."},"example_sentences":[{"sentence":"The algorithm uses a weight-biased approach to prioritize high-value customers.","translation":"そのアルゴリズムは、価値の高い顧客を優先するために、重み付けバイアスのあるアプローチを使用している。","type":"adjective","meaning_category":"重み付けされた"},{"sentence":"The study's findings were criticized for being weight-biased due to the sampling method.","translation":"その研究の調査結果は、サンプリング方法のために重み付けバイアスがあるとして批判された。","type":"adjective","meaning_category":"重み付けバイアスのある"}]}