{"word":"relationary","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"関係的な、関係に基づく、関係性を重視する","english_definition":"Relating to or based on relationships; emphasizing the importance of relationships.","examples":[{"sentence":"Relationary leadership focuses on building strong connections with team members.","translation":"関係的なリーダーシップは、チームメンバーとの強固なつながりを築くことに重点を置いています。"},{"sentence":"The therapy is based on a relationary approach, emphasizing the importance of interpersonal connections.","translation":"そのセラピーは関係的なアプローチに基づいており、対人関係の重要性を強調しています。"},{"sentence":"Relationary databases organize data into related tables.","translation":"リレーショナルデータベースは、データを関連するテーブルに整理します。"}],"collocations":["relationary leadership (関係的なリーダーシップ)","relationary therapy (関係的なセラピー)","relationary approach (関係的なアプローチ)","relationary database (リレーショナルデータベース)"],"synonyms":["relational","interpersonal","connected","related"],"antonyms":["individualistic","isolated","independent"]}],"etymology":{"value":"The word 'relationary' is derived from 'relation' (from Latin 'relatio', meaning 'a bringing back, a referring') + the suffix '-ary' (indicating relating to or connected with). It emphasizes the quality of being related or the importance of relationships.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈleɪʃənɛri/","syllables":"re-la-tion-ar-y"},"inflection":{"notes":"The word 'relationary' is primarily used as an adjective and does not have typical inflectional forms like verbs or nouns. Its comparative and superlative forms are 'more relationary' and 'most relationary,' respectively."},"usage_notes":{"explanation":"'Relationary' is often used in contexts where the quality or nature of relationships is central to the discussion. It is frequently found in fields such as psychology, sociology, leadership studies, and database management. It is used to describe approaches, systems, or qualities that prioritize or are based on relationships. The term is sometimes used interchangeably with 'relational,' but 'relationary' often carries a stronger emphasis on the dynamic and interactive aspects of relationships.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The relationary of the two concepts is clear.","correct":"✓ The relationship of the two concepts is clear.","note":"'Relationary' is an adjective, not a noun. Use 'relationship' as the noun form."},{"incorrect":"✗ He is a very relationary person.","correct":"✓ He is a very relational person. / ✓ He is a person who values relationships.","note":"While 'relationary' can describe a person who emphasizes relationships, 'relational' is more commonly used in this context. Alternatively, rephrase to emphasize the value of relationships."}],"priority":"★★☆"},"related_words":{"derivatives":["relation (名詞: 関係)","relational (形容詞: 関係的な)","relationship (名詞: 関係)","relate (動詞: 関連付ける、関係がある)"],"phrases":["relationary ethics (関係倫理)","relationary practice (関係実践)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (Specialized vocabulary)","frequency_google_ngram":"Relatively low frequency. More common in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Relationary' is a term used to describe something that is based on or emphasizes relationships. It is often found in academic or professional contexts, such as psychology, sociology, or business management. The word highlights the importance of connections and interactions between people or entities. It is similar to 'relational' but often implies a stronger focus on the dynamics and quality of relationships."},"example_sentences":[{"sentence":"The success of the project depended on a relationary approach to teamwork.","translation":"プロジェクトの成功は、チームワークへの関係的なアプローチにかかっていました。","type":"adjective","meaning_category":"関係に基づく"},{"sentence":"Relationary theories in psychology emphasize the impact of social connections on mental health.","translation":"心理学における関係理論は、社会的なつながりが精神的な健康に与える影響を強調しています。","type":"adjective","meaning_category":"関係的な"},{"sentence":"The company adopted a relationary model to improve customer satisfaction.","translation":"会社は顧客満足度を向上させるために、関係的なモデルを採用しました。","type":"adjective","meaning_category":"関係性を重視する"},{"sentence":"Effective communication is key to building a strong relationary environment.","translation":"効果的なコミュニケーションは、強固な関係環境を構築するための鍵です。","type":"adjective","meaning_category":"関係的な"}]}