{"word":"uncardinally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"Not in a cardinal manner; not fundamentally or essentially.","english_definition":"In a way that is not cardinal; not of primary importance; not fundamental.","examples":[{"sentence":"The issue was treated uncardinally, focusing on minor details rather than the core problem.","translation":"その問題は本質的ではなく、主要な問題よりも些細な詳細に焦点を当てて扱われた。"},{"sentence":"He approached the task uncardinally, lacking a clear understanding of the fundamental principles.","translation":"彼は基本的な原則を明確に理解せずに、そのタスクに本質的でない方法で取り組みました。"}],"collocations":["treat something uncardinally","approach something uncardinally"],"synonyms":["nonessentially","incidentally","secondarily","peripherally"],"antonyms":["cardinally","fundamentally","essentially","primarily"]}],"etymology":{"value":"Formed from the prefix \"un-\" (not) + \"cardinally\" (in a cardinal manner). \"Cardinally\" is derived from \"cardinal,\" which comes from Latin \"cardinalis,\" meaning \"serving as a hinge\" or \"principal.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkɑːrdɪnəli/","syllables":"un-car-di-nal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Uncardinally\" is a relatively rare word, primarily used in formal or academic contexts to describe something done or considered in a way that does not address the core or fundamental aspects of a matter. It implies a focus on secondary or less important details.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was solved uncardinally.","correct":"✓ The problem was addressed uncardinally, focusing on peripheral issues.","note":"It's more common to say that something is *treated* or *approached* uncardinally, rather than *solved* uncardinally. The adverb describes the manner of addressing the problem, not the solution itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["uncardinal (adjective)"],"related_terms":["cardinal (adjective, noun)","cardinally (adverb)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Uncardinally\" is a rare and complex word. It means 'not in a cardinal way,' which implies not focusing on the most important or fundamental aspects of something. It is used in formal contexts. You would likely encounter this word in academic writing or sophisticated discussions."},"example_sentences":[{"sentence":"The research paper examined the topic uncardinally, neglecting the central theories.","translation":"その研究論文は中心的な理論を無視して、そのトピックを本質的でない方法で検討した。","type":"adverb","meaning_category":"Not fundamentally"},{"sentence":"He addressed the concerns uncardinally, focusing on minor complaints rather than the underlying issues.","translation":"彼は根本的な問題ではなく、些細な不満に焦点を当てて、懸念事項を本質的でない方法で処理した。","type":"adverb","meaning_category":"Not fundamentally"}]}