{"word":"frondiferous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"葉の多い、葉状の","english_definition":"Bearing or producing fronds; leafy.","examples":[{"sentence":"The frondiferous plants added a lush, green touch to the landscape.","translation":"葉の多い植物は、風景に緑豊かな趣を添えた。"},{"sentence":"The frondiferous canopy provided ample shade.","translation":"葉の多い天蓋は十分な日陰を提供した。"}],"collocations":["frondiferous plants","frondiferous canopy"],"synonyms":["leafy","foliaceous","verdant"],"antonyms":["leafless","bare","defoliated"]}],"etymology":{"value":"From Latin 'frondifer' (frons 'leafy branch, frond' + -fer 'bearing').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfrɒnˈdɪfərəs/","syllables":"fron-dif-er-ous"},"inflection":{"notes":"Comparative and superlative forms are possible but rare (more frondiferous, most frondiferous)."},"usage_notes":{"explanation":"'Frondiferous' is a relatively uncommon adjective used to describe plants or environments characterized by an abundance of fronds or leaves. It is often used in botanical or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The forest was frondiferous with pine trees.","correct":"✓ The forest was frondiferous with ferns.","note":"'Frondiferous' specifically refers to plants with fronds (like ferns) or an abundance of leaves. Pine trees, while leafy, are not typically described as frondiferous."}],"priority":"★☆☆"},"related_words":{"derivatives":["frond (noun): a large divided leaf or leaflike part, especially as applied to ferns, palms, and certain algae.","frondescence (noun): the production of leaves or fronds; foliage."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Frondiferous' is a highly specialized term, primarily used in botanical descriptions. It indicates that something bears many fronds or leaves, creating a lush or leafy appearance. Due to its limited use and technical nature, it is generally encountered in advanced texts related to botany or ecology."},"example_sentences":[{"sentence":"The frondiferous vegetation created a dense understory in the rainforest.","translation":"葉の多い植生は、熱帯雨林に密な下層植生を作り出した。","type":"descriptive","meaning_category":"leafy"},{"sentence":"The artist was captivated by the frondiferous beauty of the tropical garden.","translation":"その芸術家は、熱帯庭園の葉の多い美しさに魅了された。","type":"descriptive","meaning_category":"leafy"}]}