{"word":"legendarian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"伝説の研究家、伝説の収集家、伝説に詳しい人","english_definition":"A person knowledgeable about legends; a collector or student of legends.","examples":[{"sentence":"He was known as the local legendarian, always ready with a tale of the past.","translation":"彼は地元の伝説研究家として知られており、いつも過去の物語を語る準備ができていた。"},{"sentence":"The library hired a legendarian to help catalog their collection of folklore.","translation":"図書館は、民話のコレクションの目録作成を手伝うために、伝説研究家を雇った。"}],"collocations":["local legendarian","hired legendarian","amateur legendarian","renowned legendarian"],"synonyms":["folklorist","mythologist","storyteller","historian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"伝説的な、伝説に関する","english_definition":"Relating to legends; legendary.","examples":[{"sentence":"The legendarian accounts of King Arthur vary widely.","translation":"アーサー王に関する伝説的な記述は大きく異なる。"},{"sentence":"The author took a legendarian approach to writing the historical novel.","translation":"著者は、歴史小説を書くにあたって、伝説的なアプローチをとった。"}],"collocations":["legendarian accounts","legendarian approach","legendarian sources","legendarian tales"],"synonyms":["legendary","mythical","fabled","traditional"],"antonyms":["factual","historical","verifiable"]}],"etymology":{"value":"\"Legend\" + \"-arian\". From \"legend\" (a traditional story sometimes popularly regarded as historical but not authenticated) and the suffix \"-arian\" (denoting a person concerned with or specializing in something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛdʒənˈdɛəriən/","syllables":"le-gen-dar-i-an"},"inflection":{"noun_plural":"legendarians"},"usage_notes":{"explanation":"The term \"legendarian\" is relatively uncommon. It is used to describe someone who is deeply involved in the study, collection, or preservation of legends. As an adjective, it describes something related to legends. It is more frequently used in academic or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a legendarian player.","correct":"✓ He is a legendary player.","note":"\"Legendarian\" refers to someone who studies or knows about legends, while \"legendary\" describes someone or something that has become a legend. In this case, \"legendary\" is more appropriate."},{"incorrect":"✗ The legendarian is very famous.","correct":"✓ The legendarian is very knowledgeable about local folklore.","note":"While a legendarian might be known within a specific community, the term itself doesn't imply fame. It emphasizes expertise in legends."}],"priority":"★★☆"},"related_words":{"derivatives":["legend","legendary","legendarily"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"legendarian\" is a relatively rare term, typically used in academic or literary contexts to describe someone who studies or is knowledgeable about legends. It can also be used as an adjective to describe something related to legends. Because of its specialized usage, it is more likely to be encountered in advanced reading materials. Understanding the root word \"legend\" is essential for grasping the meaning of \"legendarian.\""},"example_sentences":[{"sentence":"The visiting professor was a renowned legendarian, specializing in Celtic myths.","translation":"訪問教授は有名な伝説研究家で、ケルト神話が専門だった。","type":"noun","meaning_category":"伝説の研究家"},{"sentence":"The museum's exhibit featured a collection of legendarian artifacts.","translation":"博物館の展示会では、伝説に関する工芸品のコレクションが展示されていた。","type":"adjective","meaning_category":"伝説に関する"}]}