{"word":"aortography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"大動脈造影（法）","english_definition":"radiographic visualization of the aorta after introduction of a contrast substance.","examples":[{"sentence":"Aortography is used to diagnose aortic aneurysms.","translation":"大動脈造影は、大動脈瘤の診断に用いられる。"},{"sentence":"The doctor recommended aortography to assess the extent of the aortic dissection.","translation":"医師は大動脈解離の範囲を評価するために大動脈造影を推奨した。"}],"collocations":["renal aortography (腎動脈造影)","selective aortography (選択的大動脈造影)","perform aortography (大動脈造影を行う)"],"synonyms":["aortogram"],"antonyms":[]}],"etymology":{"value":"'Aorto-' (aorta, 大動脈) + '-graphy' (writing, recording, 記録) に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/eɪɔːrˈtɒɡrəfi/","syllables":"a-or-tog-ra-phy"},"inflection":{"noun_plural":"aortographies"},"usage_notes":{"explanation":"Aortography is a medical imaging technique used to visualize the aorta and its major branches. It involves injecting a contrast dye into the aorta and then taking X-ray images. It is used to diagnose various conditions affecting the aorta, such as aneurysms, dissections, and blockages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aortography was painless, but the aortogram was not.","correct":"✓ The aortography procedure was painless, but I felt some discomfort after.","note":"Aortography is the procedure; an aortogram is the image produced. The procedure itself might not be painful, but there can be discomfort afterwards."}],"priority":"★★☆"},"related_words":{"derivatives":["aortogram (大動脈造影写真)","aortic (大動脈の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aortography' is a specialized medical term referring to the radiographic visualization of the aorta after the injection of a contrast substance. It's used to diagnose conditions affecting the aorta. Understanding this term requires knowledge of medical terminology and procedures.","priority":"★★☆"},"example_sentences":[{"sentence":"The aortography revealed a significant narrowing of the abdominal aorta.","translation":"大動脈造影により、腹部大動脈の著しい狭窄が明らかになった。","type":"noun","meaning_category":"診断"},{"sentence":"Before the surgery, the patient underwent aortography to map the blood vessels.","translation":"手術前に、患者は血管をマッピングするために大動脈造影を受けた。","type":"noun","meaning_category":"手術準備"}]}