{"word":"lipoxeny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of an organism that is unable to maintain its body fat reserves, resulting in a lean phenotype.","english_definition":"The state of an organism that is unable to maintain its body fat reserves, resulting in a lean phenotype.","examples":[{"sentence":"The researchers studied the genetic factors contributing to lipoxeny in mice.","translation":"研究者たちは、マウスにおけるリポキセニーの原因となる遺伝的要因を研究した。"},{"sentence":"Lipoxeny can be a desirable trait in livestock breeding programs.","translation":"リポキセニーは、家畜の育種プログラムにおいて望ましい特性となり得る。"}],"collocations":["genetic lipoxeny","diet-induced lipoxeny"],"synonyms":["leanness","hypo-adiposity"],"antonyms":["obesity","adiposity","hyper-adiposity"]}],"etymology":{"value":"Derived from the Greek words 'lipo-' (fat) and 'xenos' (foreign, strange), suggesting an unusual or atypical relationship with fat.","priority":"★★★"},"pronunciation":{"ipa":"/lɪˈpɒksɪni/","syllables":"li-pox-e-ny"},"inflection":{"noun_plural":"lipoxenies"},"usage_notes":{"explanation":"Lipoxeny is a term primarily used in scientific and technical contexts, particularly in genetics, animal physiology, and agricultural research. It describes a condition where an organism, often an animal, has a reduced ability to store or maintain body fat. This trait is of interest in fields such as livestock breeding, where leaner animals may be desirable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was diagnosed with lipoxeny due to overeating.","correct":"✓ The patient was diagnosed with lipodystrophy due to overeating.","note":"Lipoxeny is the inability to store fat, so it's the opposite of a condition caused by overeating. Lipodystrophy, an abnormal distribution of fat, might be a more appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["lipodystrophy","adiposity","hypo-adiposity","hyper-adiposity"],"related_terms":["phenotype","genotype","metabolism","lipid"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very Low Frequency - Primarily a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lipoxeny' is a highly specialized term used in scientific fields like genetics and animal physiology. It refers to the condition where an organism has difficulty storing body fat, leading to a lean body type. This term is not commonly used in everyday language and is primarily found in research papers and technical discussions. Understanding this term requires a strong background in biology and related scientific disciplines."},"example_sentences":[{"sentence":"The study aimed to identify the genes responsible for lipoxeny in the selected breed of cattle.","translation":"その研究は、選択された品種の牛におけるリポキセニーの原因となる遺伝子を特定することを目的とした。","type":"scientific","meaning_category":"genetics"},{"sentence":"Lipoxeny is often associated with increased metabolic rate and reduced fat deposition.","translation":"リポキセニーは、しばしば代謝率の増加および脂肪沈着の減少と関連している。","type":"scientific","meaning_category":"physiology"}]}