{"word":"uncommemorated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"記念されていない、追悼されていない","english_definition":"Not commemorated; not remembered or celebrated with a special event or ceremony.","examples":[{"sentence":"The soldiers who died in that forgotten battle remain uncommemorated.","translation":"その忘れられた戦いで亡くなった兵士たちは、今もなお記念されていない。"},{"sentence":"Many acts of kindness go uncommemorated.","translation":"多くの親切な行いは、記念されることなく過ぎ去る。"}],"collocations":["remain uncommemorated","go uncommemorated"],"synonyms":["unremembered","uncelebrated","unhonored","forgotten"],"antonyms":["commemorated","remembered","celebrated","honored"]}],"etymology":{"value":"prefix 'un-' (not) + 'commemorated' (past participle of 'commemorate'). 'Commemorate' comes from Latin 'commemorare' (to remember together), from 'com-' (together) + 'memorare' (to remember), from 'memor' (mindful, remembering).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkəˈmeməreɪtɪd/","syllables":"un-co-mem-o-rat-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are possible (more uncommemorated, most uncommemorated), but are not common."},"usage_notes":{"explanation":"'Uncommemorated' describes something that has not been officially or publicly remembered, honored, or celebrated. It often implies a sense of neglect or oversight. It is a relatively formal word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was uncommemorated because it was too recent.","correct":"✓ The event was uncommemorated because it was considered too controversial.","note":"'Uncommemorated' often implies a reason for the lack of commemoration, such as being forgotten, overlooked, or considered inappropriate to celebrate, not simply because it is recent."}],"priority":"★☆☆"},"related_words":{"derivatives":["commemorate (verb): to remember and show respect for someone or something in a ceremony.","commemoration (noun): a ceremony or celebration in which a person or event is remembered.","commemorative (adjective): intended to commemorate something."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uncommemorated' means that something hasn't been officially remembered or celebrated. It's often used when something important has been forgotten or not given the recognition it deserves. It's not a common word, so you'll mostly find it in formal writing or discussions about history or remembrance."},"example_sentences":[{"sentence":"The victims of the disaster remained largely uncommemorated by the government.","translation":"その災害の犠牲者は、政府によってほとんど記念されることはなかった。","type":"adjective","meaning_category":"Not commemorated"},{"sentence":"Many local heroes' contributions go uncommemorated in the history books.","translation":"多くの地元の英雄たちの貢献は、歴史書の中で記念されることなく過ぎ去る。","type":"adjective","meaning_category":"Not commemorated"}]}