{"word":"brachycephalic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"短頭の、短頭型の","english_definition":"having a relatively broad, short head (typically with the breadth at least 80% of the length)","examples":[{"sentence":"Bulldogs and pugs are brachycephalic breeds.","translation":"ブルドッグやパグは短頭種の犬です。"},{"sentence":"Brachycephalic skulls are more rounded in shape.","translation":"短頭の頭蓋骨は、より丸みを帯びた形をしています。"}],"collocations":["brachycephalic dog","brachycephalic skull","brachycephalic airway syndrome"],"synonyms":["short-headed","round-headed"],"antonyms":["dolichocephalic","long-headed"]}],"etymology":{"value":"From the Greek words 'brachy' (short) and 'kephalē' (head).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbrækiːsəˈfælɪk/","syllables":"bra-chy-se-phal-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more brachycephalic, most brachycephalic)."},"usage_notes":{"explanation":"'Brachycephalic' is a term mainly used in anthropology and zoology to describe head shapes. In veterinary medicine, it's commonly used to refer to dog and cat breeds with shortened snouts and flattened faces, which can predispose them to certain health issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The dog is brachycephalic, so he doesn't need exercise.","correct":"The dog is brachycephalic, so he needs careful monitoring during exercise.","note":"Brachycephalic breeds are prone to breathing problems and overheating, so they require careful monitoring during exercise."}],"priority":"★★☆"},"related_words":{"derivatives":["brachycephaly (noun)"],"phrasal_verbs":[],"related_terms":["cephalic index","dolichocephalic","mesocephalic"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'brachycephalic' is a technical term primarily used in scientific or veterinary contexts. It describes a specific head shape characterized by its broadness and shortness. Understanding this term is crucial when discussing certain animal breeds or anthropological studies related to skull morphology. Due to its specialized nature, it is less commonly encountered in everyday language."},"example_sentences":[{"sentence":"The veterinarian explained the risks associated with brachycephalic airway syndrome.","translation":"獣医は短頭種気道症候群に関連するリスクについて説明しました。","type":"general","meaning_category":"health"},{"sentence":"Anthropologists use the cephalic index to classify skulls as brachycephalic, dolichocephalic, or mesocephalic.","translation":"人類学者は頭指数を使って、頭蓋骨を短頭、長頭、または中頭に分類します。","type":"technical","meaning_category":"anthropology"}]}