{"word":"curved-fruited","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having curved fruits.","english_definition":"Describing a plant or tree that produces fruits with a curved shape.","examples":[{"sentence":"The curved-fruited cucumber is a popular variety for pickling.","translation":"曲がった実のキュウリは、ピクルスにするのに人気のある品種です。"},{"sentence":"We identified the tree by its distinctive curved-fruited pods.","translation":"その木は、特徴的な曲がった実のさやによって識別しました。"}],"collocations":["curved-fruited cucumber","curved-fruited pod","curved-fruited tree"],"synonyms":["bent-fruited","crooked-fruited"],"antonyms":["straight-fruited"]}],"etymology":{"value":"Derived from the combination of 'curved' and 'fruited', indicating the characteristic of having curved fruits.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɜːvd ˈfruːtɪd/","syllables":"curved-fruit-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative and superlative forms, which are not commonly used with this adjective."},"usage_notes":{"explanation":"This adjective is typically used in botanical descriptions or horticultural contexts to specify a plant variety or species based on the shape of its fruit. It is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree is curved fruited.","correct":"✓ The tree is curved-fruited.","note":"The hyphen is important to connect the two words and create a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["fruit","curved"],"related_terms":["fruit shape","plant morphology"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'curved-fruited' is a specialized adjective used in botanical or horticultural contexts. It describes plants that bear fruits with a curved shape. Due to its specific usage, it is not commonly encountered in general language but is relevant in scientific or agricultural discussions."},"example_sentences":[{"sentence":"The botanist noted the presence of a curved-fruited shrub in the undergrowth.","translation":"植物学者は、下草の中に曲がった実をつける低木があることに気づいた。","type":"descriptive","meaning_category":"botanical description"},{"sentence":"Farmers often select curved-fruited varieties of peppers for their unique appearance in markets.","translation":"農家は、市場での独特な外観のために、曲がった実のピーマンの品種を選ぶことがよくあります。","type":"horticultural","meaning_category":"agricultural practice"}]}