{"word":"Wendigo","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウェンディゴ：北米のアルゴンキン族の伝承に登場する人食いの怪物。冬の厳しさ、飢餓、孤立、タブーの象徴とされる。","english_definition":"A cannibalistic monster or evil spirit from the folklore of the Algonquian peoples of North America, often associated with winter, famine, and isolation.","examples":[{"sentence":"The legend of the Wendigo served as a warning against cannibalism.","translation":"ウェンディゴの伝説は、人食いに対する警告として機能した。"},{"sentence":"Some believe that the Wendigo is a person transformed by the consumption of human flesh.","translation":"ウェンディゴは、人肉を食べることによって変身した人間だと信じられている人もいる。"},{"sentence":"The Wendigo is often depicted as a gaunt and terrifying figure.","translation":"ウェンディゴはしばしば、痩せ衰えた恐ろしい姿で描かれる。"}],"collocations":["Wendigo legend (ウェンディゴの伝説)","Wendigo myth (ウェンディゴの神話)","Wendigo spirit (ウェンディゴの霊)","Wendigo psychosis (ウェンディゴ精神病)"],"synonyms":["cannibal","monster","evil spirit"],"antonyms":[]}],"etymology":{"value":"アルゴンキン語族の言語に由来し、正確な語源は不明だが、「悪霊」や「人食い」といった意味合いを持つ言葉が起源と考えられる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɛndɪɡoʊ/","syllables":"Wen-di-go"},"inflection":{"noun_plural":"Wendigos"},"usage_notes":{"explanation":"「**Wendigo**」は、主に北米のアルゴンキン族の伝承に登場する怪物です。人食いの性質を持ち、冬の飢餓や孤立、タブーを犯した結果として現れると考えられています。現代では、ホラー作品やファンタジー作品にも登場し、そのイメージは多様化しています。心理学用語として「ウェンディゴ精神病」という、人肉食への強い欲求を伴う精神疾患を指す言葉もありますが、これは文化的な概念に基づいたものであり、医学的な診断名ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Wendigoes are only found in Canada.","correct":"✓ Wendigos are part of the folklore of Algonquian peoples across North America.","note":"ウェンディゴの伝説はカナダだけでなく、北米のアルゴンキン語族全体に広がっています。"},{"incorrect":"✗ The Wendigo is a type of bear.","correct":"✓ The Wendigo is a cannibalistic monster or spirit.","note":"ウェンディゴは熊のような動物ではなく、人食いの怪物または悪霊です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (cultural term)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の文化やジャンルに関連する語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Wendigo**」は、北米の先住民族の伝承に登場する怪物に関する単語です。この単語は、一般的な英語の語彙ではなく、特定の文化的な背景を持つため、英語学習者にとっては馴染みが薄いかもしれません。ウェンディゴは、人食いの怪物として知られ、冬の飢餓や孤立、タブーを破ることの象徴として語られます。この単語を理解するには、北米先住民族の文化や伝承に関する知識があると役立ちます。"},"example_sentences":[{"sentence":"The film depicted a terrifying encounter with a **Wendigo**.","translation":"その映画は、ウェンディゴとの恐ろしい遭遇を描いていた。","type":"noun","meaning_category":"怪物"},{"sentence":"The harsh winter conditions were said to bring out the **Wendigo** spirit.","translation":"厳しい冬の状況は、ウェンディゴの霊を引き出すと言われていた。","type":"noun","meaning_category":"精霊・悪霊"},{"sentence":"Stories of the **Wendigo** served as a cautionary tale for survival in the wilderness.","translation":"ウェンディゴの物語は、荒野での生存のための教訓話として役立った。","type":"noun","meaning_category":"伝説・物語"}]}