{"word":"Iconian","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Star Trek) A member of an ancient and powerful race from the planet Iconia, known for their advanced technology, especially their interdimensional gateways called 'Iconian Gateways'.","english_definition":"In the Star Trek universe, an Iconian is a member of an ancient and powerful race from the planet Iconia. They are renowned for their advanced technology, particularly their interdimensional gateways known as 'Iconian Gateways', which allowed them to travel vast distances instantaneously.","examples":[{"sentence":"The USS Enterprise encountered evidence of the Iconians' advanced technology.","translation":"USSエンタープライズ号は、アイコニア人の高度な技術の証拠に遭遇した。"},{"sentence":"The Iconian Gateways were a key strategic asset in their empire.","translation":"アイコニアのゲートウェイは、彼らの帝国の重要な戦略的資産だった。"}],"collocations":["Iconian Gateway","Iconian technology","Iconian War","ancient Iconian civilization"],"synonyms":["N/A"],"antonyms":["N/A"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of the Iconians.","english_definition":"Relating to or characteristic of the Iconians, their technology, or their civilization.","examples":[{"sentence":"The ruins showed evidence of Iconian architecture.","translation":"その遺跡はアイコニアの建築様式の証拠を示していた。"},{"sentence":"The Iconian threat loomed large in the galaxy.","translation":"アイコニアの脅威が銀河に大きく迫っていた。"}],"collocations":["Iconian architecture","Iconian threat","Iconian artifact"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The term 'Iconian' is derived from 'Iconia', the name of their home planet. The origin of 'Iconia' itself is not explicitly stated within Star Trek canon, but it suggests a connection to 'icon', implying a civilization of great significance or representation.","priority":"N/A"},"pronunciation":{"ipa":"/aɪˈkoʊniən/","syllables":"I-co-ni-an"},"inflection":{"noun_plural":"Iconians"},"usage_notes":{"explanation":"'Iconian' is primarily used within the context of the Star Trek fictional universe. It refers to a specific race and their associated technology and history. Outside of this context, the term has no common usage.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Iconia (planet name)","Iconian Gateway (interdimensional portal)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency outside of Star Trek contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Iconian' requires familiarity with the Star Trek universe. Understanding its meaning necessitates knowledge of the fictional history and technology associated with this race. It is not a term commonly used in general English.","priority":"N/A"},"example_sentences":[{"sentence":"The Federation feared the return of the Iconian civilization.","translation":"連邦はアイコニア文明の復活を恐れた。","type":"noun","meaning_category":"Race in Star Trek"},{"sentence":"The Starfleet officers analyzed the ancient Iconian technology.","translation":"宇宙艦隊の士官たちは古代アイコニアの技術を分析した。","type":"adjective","meaning_category":"Relating to the Iconians"}]}