{"word":"valerianaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オミナエシ科の、またはオミナエシ科に属する","english_definition":"Of or pertaining to the Valerianaceae, the valerian family of plants.","examples":[{"sentence":"The valerianaceous plants are characterized by their opposite leaves and cymose inflorescences.","translation":"オミナエシ科の植物は、対生の葉と集散花序を特徴とする。"}],"collocations":["valerianaceous plant","valerianaceous flower"],"synonyms":["valerian"],"antonyms":[]}],"etymology":{"value":"Formed from \"Valerianaceae\" (the family name) + \"-ous\".  Valerianaceae is derived from \"Valeriana\" (the genus name) + \"-aceae\" (standard suffix for plant families). \"Valeriana\" comes from Latin \"Valerius\" (a personal name), possibly referring to a person who first described the plant, or from \"valere\" (to be strong, healthy), referring to its medicinal properties.","priority":"★★☆"},"pronunciation":{"ipa":"/vəˌlɪəriəˈneɪʃəs/","syllables":"va-ler-i-a-na-ce-ous"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparative/superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"This term is primarily used in botanical contexts to describe plants belonging to or related to the Valerianaceae family. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The valerianaceous animal was found in the forest.","correct":"✓ The valerianaceous plant was found in the forest.","note":"This adjective only applies to plants within the Valerianaceae family, not to animals."}],"priority":"★★☆"},"related_words":{"derivatives":["Valerianaceae (family name)","Valerian (genus name, common name of a plant in the family)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'valerianaceous' is a technical term used in botany. It is used to describe plants that belong to the Valerianaceae family, also known as the valerian family. This family includes plants like valerian, which are known for their medicinal properties. The word is not commonly used outside of scientific or botanical contexts."},"example_sentences":[{"sentence":"Many **valerianaceous** species are used in traditional medicine.","translation":"多くのオミナエシ科の種は伝統医学で使用されている。","type":"adjective","meaning_category":"植物学"}]}