{"word":"Post-Babylonian","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"バビロン崩壊後の、バビロン以後の","english_definition":"Relating to the period after the fall or decline of Babylon.","examples":[{"sentence":"The post-Babylonian era saw the rise of new empires in Mesopotamia.","translation":"バビロン崩壊後の時代には、メソポタミアに新たな帝国が台頭した。"}],"collocations":[],"synonyms":["After the Babylonian period","Subsequent to Babylonian rule"],"antonyms":["Pre-Babylonian"]},{"part_of_speech":"adjective","definition":"バビロン捕囚後の、バビロン捕囚時代以後の","english_definition":"Relating to the period after the Babylonian captivity of the Jews.","examples":[{"sentence":"Post-Babylonian Jewish literature shows a renewed focus on religious law.","translation":"バビロン捕囚後のユダヤ文学は、宗教的法への新たな焦点を当てている。"}],"collocations":[],"synonyms":["After the Babylonian exile"],"antonyms":["Pre-Babylonian exile"]}],"etymology":{"value":"Formed by combining \"post-\" (meaning after) with \"Babylonian\" (relating to Babylon).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpoʊst bæbɪˈloʊniən/","syllables":"post-bab-y-lo-ni-an"},"inflection":{},"usage_notes":{"explanation":"The term \"Post-Babylonian\" is used in historical contexts to describe periods or events that occurred after significant events related to Babylon, such as its fall as a major power or the end of the Babylonian captivity of the Jews. The specific meaning depends on the context in which it is used.","priority":"★★☆"},"common_mistakes":{},"related_words":["Babylonian","Babylon","Neo-Babylonian","Post-exilic"],"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"Post-Babylonian\" is a specialized term used in historical and archaeological contexts. It refers to the period following the decline or fall of Babylon or, more specifically, the period after the Babylonian exile of the Jewish people. Understanding requires knowledge of Babylonian history."},"example_sentences":[{"sentence":"The influence of Zoroastrianism increased in the post-Babylonian Persian Empire.","translation":"ゾロアスター教の影響力は、バビロン崩壊後のペルシャ帝国で増大した。","type":"adjective","meaning_category":"バビロン崩壊後の"},{"sentence":"Many changes in Jewish religious practices occurred during the post-Babylonian period.","translation":"ユダヤ教の宗教的慣習の多くは、バビロン捕囚後の時代に起こった。","type":"adjective","meaning_category":"バビロン捕囚後の"}]}