{"word":"colourability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"着色できる性質、染色性","english_definition":"The property of being able to be coloured.","examples":[{"sentence":"The colourability of this fabric is excellent, allowing for vibrant and long-lasting dyes.","translation":"この生地の染色性は優れており、鮮やかで長持ちする染料を使用できます。"}],"collocations":[],"synonyms":["dyeability","tintability"],"antonyms":["noncolourability"]}],"etymology":{"value":"Formed from 'colourable' (capable of being coloured) + '-ity' (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkʌlərəˈbɪləti/","syllables":"col-our-a-bil-i-ty"},"inflection":{"noun_plural":"colourabilities"},"usage_notes":{"explanation":"'Colourability' is primarily used in technical or industrial contexts, such as textiles, plastics, or paints, where the ease and effectiveness of colouring a material are important considerations. It refers to the inherent properties of a substance that allow it to accept and retain colour.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The colourability is very colour.","correct":"✓ The colourability is very high.","note":"'Colourability' is a property, not a colour itself. Use it to describe the degree to which something can be coloured, not the colour it is."}],"priority":"★★☆"},"related_words":{"derivatives":["colourable (adjective: capable of being coloured; plausible but not necessarily true)","colour (noun/verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Colourability' is a technical term primarily used in specialized fields such as textile manufacturing, plastics engineering, and paint chemistry. It describes the extent to which a material can be effectively coloured or dyed. Due to its specialized usage, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The enhanced colourability of the new polymer allows for a wider range of aesthetic applications.","translation":"新しいポリマーの向上した染色性により、より幅広い美的用途が可能になります。","type":"general","meaning_category":"着色できる性質"},{"sentence":"Testing the colourability of different cotton strains is crucial for the textile industry.","translation":"繊維産業にとって、さまざまな綿株の染色性をテストすることは非常に重要です。","type":"technical","meaning_category":"染色性"}]}