{"word":"intra-vitam","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"生体内で、生存中に","english_definition":"Within the lifetime; during life. Used especially in scientific or medical contexts to describe processes or observations made on a living organism.","examples":[{"sentence":"Intra-vitam studies are essential for understanding disease progression.","translation":"生体内研究は、病気の進行を理解するために不可欠です。"},{"sentence":"The intra-vitam microscopy allowed for real-time observation of cellular interactions.","translation":"生体内顕微鏡検査により、細胞間相互作用のリアルタイム観察が可能になった。"}],"collocations":["intra-vitam microscopy","intra-vitam imaging","intra-vitam study"],"synonyms":["in vivo"],"antonyms":["in vitro","post-mortem"]}],"etymology":{"value":"From Latin intra (\"within\") + vitam (accusative of vita \"life\").","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəˈvaɪtæm/","syllables":"in-tra-vi-tam"},"inflection":{"notes":"Invariable (not inflected)."},"usage_notes":{"explanation":"'Intra-vitam' is primarily used in scientific and medical contexts to describe processes or observations that occur within a living organism. It contrasts with 'in vitro' (in glass, i.e., in a test tube or other artificial environment) and 'post-mortem' (after death).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The experiment was done intra vitam.","correct":"✓ The experiment was done intra-vitam.","note":"Hyphenation is generally preferred in English when using 'intra-vitam' as an adverbial modifier."}],"priority":"☆☆☆"},"related_words":{"derivatives":["vita (life)","in vivo (in a living organism)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in specialized scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Intra-vitam' is a highly specialized term primarily encountered in advanced scientific and medical literature. Understanding its meaning requires familiarity with Latin prefixes and a strong background in biology or medicine. Its usage is restricted to contexts where distinguishing between processes occurring within a living organism versus those occurring in vitro or post-mortem is crucial."},"example_sentences":[{"sentence":"The researchers conducted intra-vitam imaging to track the migration of cancer cells.","translation":"研究者たちは、がん細胞の移動を追跡するために生体内イメージングを実施した。","type":"adverb","meaning_category":"生体内で"},{"sentence":"Intra-vitam analysis revealed significant changes in gene expression during the inflammatory response.","translation":"生体内分析により、炎症反応中の遺伝子発現の重要な変化が明らかになった。","type":"adverb","meaning_category":"生体内で"}]}