{"word":"Coppola","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コッポラ（イタリア系の姓）","english_definition":"An Italian surname.","examples":[{"sentence":"Francis Ford Coppola is a famous film director.","translation":"フランシス・フォード・コッポラは有名な映画監督です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"コッポラ（特にシチリア地方の伝統的な帽子）","english_definition":"A traditional Sicilian cap, typically flat and round.","examples":[{"sentence":"He wore a Coppola to protect himself from the sun.","translation":"彼は日差しから身を守るためにコッポラ帽をかぶっていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Italian surname, likely derived from a diminutive of 'coppo' meaning 'skullcap' or 'dome'. The cap meaning is a direct reference to the headwear associated with the surname or region.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒpələ/","syllables":"Cop-po-la"},"inflection":{},"usage_notes":{"explanation":"'Coppola' can refer to a surname, most famously associated with the film director Francis Ford Coppola and his family. It can also refer to a specific type of traditional Sicilian cap. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_people":["Francis Ford Coppola","Sofia Coppola","Nicolas Cage (born Nicolas Kim Coppola)"],"related_places":["Sicily"]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"'Coppola' is a proper noun that can refer to a famous surname (particularly in film) or a specific type of cultural headwear. Understanding the context is key to knowing which meaning is intended. It's not a common word outside of discussions about film or Sicilian culture."},"example_sentences":[{"sentence":"Sofia Coppola followed in her father's footsteps as a director.","translation":"ソフィア・コッポラは監督として父親の足跡をたどった。","type":"surname","meaning_category":"surname"},{"sentence":"The old man always wore a Coppola when he went out.","translation":"その老人は外出するときはいつもコッポラ帽をかぶっていた。","type":"cap","meaning_category":"cap"}]}