{"word":"microgabbro","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"微斑糲岩（びはんれいがん）: 細粒の斑糲岩。深成岩である斑糲岩と、火山岩である玄武岩の中間的な性質を持つ岩石。","english_definition":"A fine-grained gabbro. It is an intrusive igneous rock, intermediate in composition between gabbro and basalt.","examples":[{"sentence":"The microgabbro sample showed a holocrystalline texture.","translation":"その微斑糲岩のサンプルは完晶質組織を示した。"},{"sentence":"Microgabbro is often found in dikes and sills.","translation":"微斑糲岩はしばしば岩脈や岩床に見られる。"}],"collocations":["fine-grained microgabbro (細粒微斑糲岩)","holocrystalline microgabbro (完晶質微斑糲岩)"],"synonyms":["dolerite","diabase"],"antonyms":[]}],"etymology":{"value":"'Micro-' (小さい) + 'gabbro' (斑糲岩)","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈɡæbroʊ/","syllables":"mi-cro-gab-bro"},"inflection":{"noun_plural":"microgabbros"},"usage_notes":{"explanation":"Microgabbro is an intrusive igneous rock, meaning it cools slowly beneath the Earth's surface. This slow cooling results in the formation of small crystals, giving it a fine-grained texture. It is chemically similar to gabbro but has smaller crystals. Dolerite and diabase are often used synonymously, although there may be subtle distinctions depending on the geological context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Microgabbro is an extrusive rock.","correct":"✓ Microgabbro is an intrusive rock.","note":"Microgabbro is an intrusive rock, not an extrusive one. Extrusive rocks cool quickly on the surface, while intrusive rocks cool slowly underground."}],"priority":"★☆☆"},"related_words":{"derivatives":["gabbro (斑糲岩)","basalt (玄武岩)","dolerite (粗粒玄武岩)","diabase (粗粒玄武岩)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Microgabbro is a geological term referring to a specific type of igneous rock. Understanding this term requires knowledge of geology and petrology, specifically the classification of igneous rocks based on grain size and mineral composition. It's typically encountered in advanced geological studies or specialized literature. The distinction between intrusive and extrusive rocks, as well as the concept of grain size in rock formation, are crucial for comprehending the meaning of microgabbro."},"example_sentences":[{"sentence":"The geologist identified the rock as microgabbro based on its mineral composition and fine-grained texture.","translation":"地質学者は、その岩石の鉱物組成と細粒の組織に基づいて、微斑糲岩であると特定した。","type":"noun","meaning_category":"geology"},{"sentence":"The microgabbro sill intruded into the sedimentary layers, causing thermal metamorphism.","translation":"その微斑糲岩の岩床は堆積層に貫入し、熱変成作用を引き起こした。","type":"noun","meaning_category":"geology"}]}