{"word":"splendorproof","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Resistant to or unaffected by splendor; impervious to magnificence or grandeur.","english_definition":"(rare) Not susceptible to being overwhelmed or influenced by splendor or magnificence.","examples":[{"sentence":"The king's resolve was splendorproof, unmoved by the riches and temptations offered by his enemies.","translation":"王の決意は壮麗さにも揺るがず、敵から差し出された富や誘惑にも動じなかった。"},{"sentence":"Her simple tastes were splendorproof, finding beauty in the ordinary rather than the opulent.","translation":"彼女の質素な趣味は華やかさには影響されず、豪華さよりも日常の中に美を見出していた。"}],"collocations":["splendorproof resolve","splendorproof tastes","splendorproof spirit"],"synonyms":["unaffected by grandeur","impervious to magnificence","resistant to splendor","unmoved by opulence"],"antonyms":["susceptible to splendor","vulnerable to magnificence","overwhelmed by grandeur","tempted by opulence"]}],"etymology":{"value":"Formed by combining 'splendor' (magnificence, grandeur) and 'proof' (resistant to, impervious to).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsplɛndərˌpruːf/","syllables":"splen-dor-proof"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"'Splendorproof' is a rare and somewhat whimsical word, suggesting an immunity or resistance to the allure of splendor. It implies a steadfastness or simplicity that is not easily swayed by outward displays of magnificence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The armor was splendorproof against the dragon's fire.","correct":"✓ The armor was fireproof against the dragon's fire.","note":"'Splendorproof' refers to resistance to magnificence, not physical elements like fire. 'Fireproof' is the correct term for resistance to fire."},{"incorrect":"✗ He lived a splendorproof life, avoiding all luxuries.","correct":"✓ He lived a simple life, avoiding all luxuries.","note":"While 'splendorproof' implies resistance to luxury, it doesn't directly mean 'avoiding all luxuries.' A more common term like 'simple' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["splendor (noun): magnificence, grandeur","proof (adjective): resistant, impervious"],"related_concepts":["asceticism","stoicism","simplicity","humility"]},"level_frequency":{"CEFR":"N/A (very rare, not in CEFR vocabulary)","frequency_google_ngram":"Extremely rare (almost non-existent in corpora)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Splendorproof' is a highly uncommon word that combines the concepts of magnificence ('splendor') and resistance ('proof'). It suggests an immunity to the allure of grandeur or opulence, implying a steadfastness or simplicity that is not easily swayed by outward displays of wealth or power. Due to its rarity, it is primarily encountered in sophisticated or creative writing where the author aims to convey a specific nuance of resistance to superficial allurements."},"example_sentences":[{"sentence":"The monk's austere lifestyle was entirely splendorproof, rejecting all forms of worldly extravagance.","translation":"その修道士の禁欲的な生活様式は完全に華やかさを拒絶し、あらゆる世俗的な贅沢を拒否した。","type":"adjective","meaning_category":"Resistant to splendor"},{"sentence":"Her artistic vision was splendorproof, finding beauty in the mundane rather than the ostentatious.","translation":"彼女の芸術的ビジョンは華やかさに影響されず、派手さよりも日常の中に美を見出した。","type":"adjective","meaning_category":"Unaffected by magnificence"}]}