{"word":"araphostic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Relating to or characterized by a gradual decline or wasting away.","english_definition":"Relating to or characterized by a gradual decline or wasting away.","examples":[{"sentence":"The patient exhibited araphostic symptoms, with a slow but steady deterioration of their condition.","translation":"患者は、緩やかではあるが着実な状態の悪化を伴う、消耗性の症状を示した。"}],"collocations":["araphostic symptoms","araphostic condition","araphostic decline"],"synonyms":["atrophic","degenerative","wasting","declining"],"antonyms":["improving","regenerative","anabolic"]}],"etymology":{"value":"From Greek ἀραίωσις (araiōsis) meaning 'rarefaction, thinning' + -ωσις (-osis) denoting a process or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌærəˈfɒstɪk/","syllables":"a-ra-phos-tic"},"inflection":{"adjective_forms":{"comparative":"more araphostic","superlative":"most araphostic"}},"usage_notes":{"explanation":"'Araphostic' is a relatively rare term, typically used in medical or biological contexts to describe a condition or process involving a gradual decline or wasting away. It emphasizes the slow and progressive nature of the deterioration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The araphostic growth of the plant was concerning.","correct":"✓ The atrophic growth of the plant was concerning.","note":"'Araphostic' refers to a decline or wasting, not stunted growth. 'Atrophic' is more appropriate for describing stunted or underdeveloped growth."}],"priority":"★☆☆"},"related_words":{"derivatives":["araxis (related concept of thinning or rarefaction)"],"phrases":["araphostic process","araphostic change"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Araphostic' is a highly specialized term, primarily encountered in medical or biological literature. It describes a gradual decline or wasting away of tissue or a condition. Due to its rarity and specific context, it is unlikely to be encountered outside of advanced academic or professional settings."},"example_sentences":[{"sentence":"The araphostic changes in the muscle tissue were evident under microscopic examination.","translation":"顕微鏡検査で、筋肉組織における消耗性の変化が明らかになった。","type":"adjective","meaning_category":"Gradual decline"},{"sentence":"The disease led to a progressive araphostic condition affecting the patient's mobility.","translation":"その病気は、患者の運動能力に影響を与える進行性の消耗状態を引き起こした。","type":"adjective","meaning_category":"Wasting away"}]}