{"word":"cast-iron-plant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハラン（葉蘭）","english_definition":"a hardy plant (Aspidistra elatior) of the lily family, native to eastern Asia, with long, broad, dark green leaves, widely grown as a houseplant because of its ability to withstand neglect.","examples":[{"sentence":"The cast-iron plant is known for its ability to thrive in low-light conditions.","translation":"ハランは、日当たりの悪い場所でもよく育つことで知られています。"},{"sentence":"My grandmother always had a cast-iron plant in her living room.","translation":"私の祖母はいつも居間にハランを置いていました。"}],"collocations":["grow a cast-iron plant","care for a cast-iron plant","a potted cast-iron plant"],"synonyms":["aspidistra"],"antonyms":[]}],"etymology":{"value":"その丈夫さから、まるで鋳鉄(cast iron)のように手入れをしなくても育つ植物であることに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkæst ˈaɪərn ˌplænt/","syllables":"cast-i-ron-plant"},"inflection":{"noun_plural":"cast-iron-plants"},"usage_notes":{"explanation":"「cast-iron plant」は、非常に丈夫で手入れが簡単な観葉植物であるハランを指します。日陰や乾燥に強く、手入れを怠っても比較的よく育つため、その名が付けられました。英語圏では、特に手入れが苦手な人や、植物を育てるのが難しい環境でも育てられる植物として人気があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a cast iron plant in my garden.","correct":"✓ I have a cast-iron plant in my living room.","note":"cast-iron plants are typically grown indoors, so 'living room' is more appropriate than 'garden'."},{"incorrect":"✗ The cast-iron plant needs a lot of sunlight.","correct":"✓ The cast-iron plant tolerates low light conditions.","note":"cast-iron plants are known for their ability to survive in low light, so they don't need a lot of sunlight."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_plants":["snake plant","ZZ plant","peace lily"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"cast-iron plant\" refers to a specific type of houseplant known for its resilience and ability to withstand neglect. It's a relatively uncommon term, so familiarity with gardening or houseplants may be necessary to understand its meaning. The name itself is descriptive, comparing the plant's hardiness to cast iron, a durable material. Understanding the etymology can aid in comprehension.","priority":"★★☆"},"example_sentences":[{"sentence":"The **cast-iron plant** is perfect for beginners because it requires minimal care.","translation":"ハランは手入れがほとんど必要ないので、初心者には最適です。","type":"general","meaning_category":"general"},{"sentence":"Even if you forget to water it for weeks, the **cast-iron plant** will likely survive.","translation":"数週間水をやるのを忘れても、ハランはおそらく生き残るでしょう。","type":"care","meaning_category":"care"},{"sentence":"The dark green leaves of the **cast-iron plant** add a touch of elegance to any room.","translation":"ハランの濃い緑色の葉は、どんな部屋にも優雅さを添えます。","type":"appearance","meaning_category":"appearance"}]}