{"word":"Enhypostasia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(キリスト教神学)受肉したキリストの人性は、それ自体では存在せず、神の子（ロゴス）の位格においてのみ存在するという教義。","english_definition":"(Christian theology) the doctrine that the human nature of Christ has no independent subsistence of its own, but exists only in the Person of the Son (the Logos).","examples":[{"sentence":"The concept of enhypostasia is crucial to understanding Chalcedonian Christology.","translation":"エンヒュポスタシス（位格内存在）の概念は、カルケドン信条のキリスト論を理解する上で非常に重要です。"}],"collocations":["enhypostatic union (位格的結合)"],"synonyms":["anhypostasia","hypostasis","hypostatic union"],"antonyms":[]}],"etymology":{"value":"ギリシア語の en (～の中に) + hypostasis (位格、本質) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ɛnˌhaɪpoʊˈsteɪʒ(ə)n/","syllables":"en-hy-po-sta-sia"},"inflection":{"noun_plural":"enhypostasias"},"usage_notes":{"explanation":"Enhypostasiaはキリスト教神学、特にキリスト論において用いられる専門用語です。キリストの人性が独立した位格を持たず、神の子（ロゴス）の位格においてのみ存在するという考え方を指します。この概念は、キリストの神性と人性の結合（位格的結合）を理解する上で重要な役割を果たします。関連語として、anhypostasia（キリストの人性が独立した位格を持たないこと）やhypostasis（位格、本質）があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Enhypostasia refers to the divine nature of Christ.","correct":"✓ Enhypostasia refers to the human nature of Christ existing in the divine Person.","note":"Enhypostasiaはキリストの人性が神の位格において存在することを指し、神性そのものを指すわけではありません。"},{"incorrect":"✗ Enhypostasia means that Christ has two separate persons.","correct":"✓ Enhypostasia means that Christ has one divine Person in which His human nature exists.","note":"Enhypostasiaはキリストが二つの位格を持つのではなく、一つの神の位格の中に人性が存在することを意味します。"}],"priority":"★★☆"},"related_words":{"derivatives":["enhypostatic (形容詞: 位格内存在的な)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - キリスト教神学の専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Enhypostasia**」はキリスト教神学の専門用語で、キリストの人性が独立した位格を持たず、神の子（ロゴス）の位格においてのみ存在するという概念を指します。この概念は、キリストの神性と人性の結合（位格的結合）を理解する上で重要です。専門的な文脈以外ではほとんど使用されません。関連する概念として、anhypostasia（キリストの人性が独立した位格を持たないこと）やhypostasis（位格、本質）があります。カルケドン信条などの歴史的文書や神学論文で目にすることがあります。"},"example_sentences":[{"sentence":"The doctrine of enhypostasia helps to explain how Christ could be both fully God and fully human.","translation":"エンヒュポスタシス（位格内存在）の教義は、キリストがどのように完全に神であり、完全に人であり得るのかを説明するのに役立ちます。","type":"noun","meaning_category":"キリスト教神学"},{"sentence":"Some theologians debate the precise implications of enhypostasia for Christology.","translation":"一部の神学者は、キリスト論におけるエンヒュポスタシス（位格内存在）の正確な意味合いについて議論しています。","type":"noun","meaning_category":"キリスト教神学"}]}