{"word":"PDT","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"太平洋夏時間 (Pacific Daylight Time)","english_definition":"Pacific Daylight Time; a daylight saving time (DST) time zone in the Pacific Time Zone of North America, observed from the second Sunday in March to the first Sunday in November. It is equivalent to UTC-7.","examples":[{"sentence":"The meeting will be held at 2 PM PDT.","translation":"会議はPDT午後2時に開催されます。"},{"sentence":"Please adjust your clocks for PDT.","translation":"PDTに合わせて時計を調整してください。"}],"collocations":["PDT time","PDT conversion","PDT zone"],"synonyms":["UTC-7"],"antonyms":["PST (Pacific Standard Time)"]}],"etymology":{"value":"Acronym for Pacific Daylight Time.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpiː.diːˈtiː/","syllables":"P-D-T"},"inflection":{"notes":"It's an abbreviation, so it doesn't inflect."},"usage_notes":{"explanation":"PDT is used to indicate a specific time during daylight saving time in the Pacific Time Zone. It's important to specify PDT when scheduling events or communicating times during the summer months to avoid confusion with PST, which is used during standard time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The event is at 3 PM PST, which is 6 PM PDT.","correct":"✓ The event is at 3 PM PST, which is 6 PM EDT.","note":"PST is standard time, and PDT is daylight saving time. The difference between PST and EDT (Eastern Daylight Time) is 3 hours, not between PST and PDT."},{"incorrect":"✗ We are currently on PDT all year round.","correct":"✓ We are currently on PDT from March to November.","note":"PDT is only observed during daylight saving time, typically from March to November. The rest of the year, PST (Pacific Standard Time) is used."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["PST","EST","EDT","MST","MDT","CST","CDT","UTC","GMT"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to time zone discussions.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'PDT' stands for Pacific Daylight Time. It's a time zone used in parts of North America during the summer months. If you see 'PDT' after a time, it means that the time is based on this specific time zone during daylight saving time. It's important to know this if you're scheduling meetings or calls with people in those areas during that time of year.","priority":"★★★"},"example_sentences":[{"sentence":"The webinar will begin at 10:00 AM PDT.","translation":"ウェビナーはPDT午前10時に開始されます。","type":"general","meaning_category":"Time reference"},{"sentence":"Make sure to convert PDT to your local time zone.","translation":"PDTをあなたの地域のタイムゾーンに変換してください。","type":"general","meaning_category":"Time conversion"},{"sentence":"Our office is closed on weekends and all federal holidays observed in PDT.","translation":"当社のオフィスは週末とPDTで定められたすべての連邦祝日に休業します。","type":"general","meaning_category":"Business hours"}]}