{"word":"battutos","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Italian cooking) A finely chopped mixture of vegetables, herbs, and sometimes meat, used as a base for sauces, soups, and stews.","english_definition":"A finely chopped mixture of vegetables, herbs, and sometimes meat, used as a base for sauces, soups, and stews in Italian cooking.","examples":[{"sentence":"The chef started the sauce with a battuto of carrots, celery, and onion.","translation":"シェフはニンジン、セロリ、玉ねぎのバットゥートでソースを作り始めた。"},{"sentence":"A good battuto is essential for a flavorful ragu.","translation":"美味しいラグーを作るには、良いバットゥートが不可欠だ。"}],"collocations":["make a battuto","add battuto to","use battuto as a base"],"synonyms":["soffritto","mirepoix"],"antonyms":[]}],"etymology":{"value":"From Italian 'battuto', past participle of 'battere' meaning 'to beat, to chop'.","priority":"★★☆"},"pronunciation":{"ipa":"/batˈtuːtoʊz/","syllables":"bat-tu-toes"},"inflection":{"noun_plural":"battutos"},"usage_notes":{"explanation":"'Battuto' is an Italian culinary term. It refers to a mixture of finely chopped ingredients, usually vegetables and herbs, that are sautéed in fat as the first step in making a sauce, soup, or stew. It is similar to the French 'mirepoix' or the Spanish 'sofrito'. The plural form is 'battutos'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I added battuto to the salad.","correct":"✓ I used battuto as a base for the sauce.","note":"Battuto is typically used as a base for cooked dishes, not added raw to salads."}],"priority":"★★☆"},"related_words":{"derivatives":["battere (Italian verb: to beat, to chop)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Battuto' is a culinary term used in Italian cooking. It refers to a finely chopped mixture of vegetables, herbs, and sometimes meat, used as a flavor base. Understanding this term requires some familiarity with cooking terminology and Italian cuisine. It's not a commonly used word outside of culinary contexts."},"example_sentences":[{"sentence":"She prepared a flavorful battuto with garlic, parsley, and pancetta.","translation":"彼女はニンニク、パセリ、パンチェッタで風味豊かなバットゥートを用意した。","type":"noun","meaning_category":"Italian cooking base"},{"sentence":"The secret to his amazing pasta sauce is the carefully prepared battuto.","translation":"彼の素晴らしいパスタソースの秘訣は、丁寧に作られたバットゥートだ。","type":"noun","meaning_category":"Italian cooking base"}]}