{"word":"noncontagiously","priority":"low","meanings":[{"part_of_speech":"adverb","definition":"In a manner that is not contagious; in a way that does not spread from one person or organism to another.","english_definition":"In a manner that does not spread from one person or organism to another.","examples":[{"sentence":"The patient was treated in isolation until it was confirmed that the disease was transmitted noncontagiously.","translation":"その患者は、病気が非感染性の方法で伝染することが確認されるまで隔離された状態で治療された。"},{"sentence":"The doctor assured the family that the rash was caused by an allergic reaction and was spreading noncontagiously.","translation":"医師は家族に、発疹はアレルギー反応によって引き起こされたものであり、非感染性の方法で広がっていると保証した。"}],"collocations":["spread noncontagiously","transmit noncontagiously","occur noncontagiously"],"synonyms":["non-infectiously","non-communicably"],"antonyms":["contagiously","infectiously","communicably"]}],"etymology":{"value":"Derived from the adjective 'noncontagious' by adding the suffix '-ly'. 'Noncontagious' is formed by adding the prefix 'non-' (meaning 'not') to 'contagious'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒnkənˈteɪdʒəsli/","syllables":"non-con-ta-gious-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Noncontagiously' is used to describe how a disease or condition spreads, indicating that it does not spread through direct or indirect contact between individuals. It is often used in medical contexts to reassure people that a condition is not easily transmissible.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The virus spread non contagiously.","correct":"The virus spread noncontagiously.","note":"The word should be written as one word: noncontagiously."},{"incorrect":"The disease is noncontagious, so it spread contagiously.","correct":"The disease is noncontagious, so it spread through other means.","note":"'Noncontagious' and 'contagiously' are antonyms. A noncontagious disease cannot spread contagiously."}],"priority":"low"},"related_words":{"derivatives":["noncontagious (adjective)","contagious (adjective)","contagion (noun)"],"priority":"medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'noncontagiously' is a technical term primarily used in medical and scientific contexts. It describes the manner in which a disease or condition does not spread through direct or indirect contact. Understanding this term requires familiarity with medical terminology and the concept of disease transmission."},"example_sentences":[{"sentence":"The study showed that the disease was transmitted noncontagiously through a specific vector.","translation":"その研究は、病気が特定の媒介物を介して非感染性の方法で伝染することを示した。","type":"general","meaning_category":"manner of transmission"},{"sentence":"The doctor explained that the skin condition was caused by genetics and would not spread noncontagiously to others.","translation":"医師は、その皮膚の状態は遺伝によって引き起こされたものであり、他の人に非感染性の方法で広がることはないと説明した。","type":"medical","meaning_category":"medical condition"}]}