{"word":"sympathomimetic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"交感神経刺激性の、アドレナリン作動性の","english_definition":"producing physiological effects characteristic of the sympathetic nervous system by promoting the stimulation of sympathetic nerves.","examples":[{"sentence":"The drug has sympathomimetic effects, increasing heart rate and blood pressure.","translation":"その薬は交感神経刺激作用があり、心拍数と血圧を上昇させる。"}],"collocations":["sympathomimetic drug","sympathomimetic agent"],"synonyms":["adrenergic","adrenomimetic"],"antonyms":["sympatholytic","adrenergic antagonist"]},{"part_of_speech":"noun","definition":"交感神経刺激薬、アドレナリン作動薬","english_definition":"a drug that produces physiological effects characteristic of the sympathetic nervous system by promoting the stimulation of sympathetic nerves.","examples":[{"sentence":"Ephedrine is a sympathomimetic commonly used as a decongestant.","translation":"エフェドリンは、一般的に鼻づまり緩和薬として使用される交感神経刺激薬である。"}],"collocations":["direct-acting sympathomimetic","indirect-acting sympathomimetic"],"synonyms":["adrenergic agonist","adrenomimetic agent"],"antonyms":["sympatholytic drug","adrenergic antagonist"]}],"etymology":{"value":"From 'sympatho-' (referring to the sympathetic nervous system) + 'mimetic' (imitating).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪmpəθoʊmɪˈmɛtɪk/","syllables":"sym-pa-tho-mi-met-ic"},"inflection":{"notes":"Plural noun form: sympathomimetics"},"usage_notes":{"explanation":"'Sympathomimetic' refers to substances that mimic the effects of the sympathetic nervous system, often by stimulating adrenergic receptors. These substances can increase heart rate, blood pressure, and bronchodilation, among other effects. They are used in various medical applications, such as treating asthma, nasal congestion, and hypotension.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was given a sympathomimetic to decrease blood pressure.","correct":"✓ The patient was given a sympathomimetic to increase blood pressure.","note":"Sympathomimetics typically increase blood pressure, not decrease it."}],"priority":"★★☆"},"related_words":{"derivatives":["sympathetic nervous system","adrenergic receptor","adrenergic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sympathomimetic' is a specialized term primarily used in medical and pharmacological contexts. It describes substances that mimic the effects of the sympathetic nervous system, leading to increased heart rate, blood pressure, and other related physiological responses. This term is typically encountered in advanced scientific literature or discussions related to medicine and pharmacology."},"example_sentences":[{"sentence":"Phenylephrine is a **sympathomimetic** used to treat nasal congestion.","translation":"フェニレフリンは鼻づまりの治療に使用される交感神経刺激薬です。","type":"noun","meaning_category":"交感神経刺激薬"},{"sentence":"The drug's **sympathomimetic** action caused an increase in the patient's heart rate.","translation":"その薬の交感神経刺激作用により、患者の心拍数が上昇した。","type":"adjective","meaning_category":"交感神経刺激性の"}]}