{"word":"quasi-poorly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"準貧困状態で、ほとんど貧困状態で","english_definition":"In a state that is nearly poor or approaching poverty.","examples":[{"sentence":"The family was living quasi-poorly after the factory closed.","translation":"その家族は工場の閉鎖後、準貧困状態で生活していた。"},{"sentence":"Even with two jobs, they were still living quasi-poorly.","translation":"二つの仕事を掛け持ちしても、彼らはまだほとんど貧困状態で生活していた。"}],"collocations":["live quasi-poorly","remain quasi-poorly"],"synonyms":["near poverty","almost impoverished","marginally poor"],"antonyms":["comfortably","wealthily","richly"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning resembling or seemingly) with \"poorly\" (in a poor manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ˈpʊərli/","syllables":"quasi-poor-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"quasi-poorly\" describes a state of living that is close to being poor but not quite fully in poverty. It suggests a precarious financial situation where resources are scarce, and the standard of living is low, but the individuals or families may still have some assets or income that prevent them from being classified as completely impoverished.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is quasi-poor.","correct":"✓ He is living quasi-poorly.","note":"\"Quasi-poor\" could be used as an adjective, but \"quasi-poorly\" is specifically an adverb describing how someone lives."},{"incorrect":"✗ They were quasi-poorly, but they managed.","correct":"✓ They were living quasi-poorly, but they managed.","note":"The adverb modifies the verb 'living' to describe the manner of living."}],"priority":"★★★"},"related_words":{"derivatives":["quasi (adverb)","poorly (adverb)","poverty (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Quasi-poorly\" is an advanced term used to describe living in a state that is close to poverty but not quite fully impoverished. It is used to convey a precarious financial situation where resources are scarce, but the individuals or families may still have some assets or income that prevent them from being classified as completely poor. This term is not commonly used in everyday conversation and is more likely to be found in academic or specialized contexts when discussing economic conditions."},"example_sentences":[{"sentence":"Despite working long hours, the family continued to live quasi-poorly.","translation":"長時間労働にもかかわらず、その家族は準貧困状態で生活し続けた。","type":"adverb","meaning_category":"準貧困状態で"},{"sentence":"The economic downturn caused many families to live quasi-poorly, struggling to make ends meet.","translation":"景気後退により、多くの家族が準貧困状態で生活し、生活費をなんとかやりくりしていた。","type":"adverb","meaning_category":"準貧困状態で"}]}