{"word":"psychedelically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"サイケデリックに、サイケデリックな方法で","english_definition":"In a psychedelic manner; in a way that produces or is characterized by psychedelic effects or experiences.","examples":[{"sentence":"The room was decorated psychedelically, with swirling colors and patterns.","translation":"部屋はサイケデリックに装飾され、渦巻く色彩と模様が施されていた。"},{"sentence":"The music sounded psychedelically distorted.","translation":"その音楽はサイケデリックに歪んで聞こえた。"}],"collocations":["psychedelically decorated","psychedelically colored","psychedelically enhanced"],"synonyms":["trippily","hallucinogenically"],"antonyms":[]}],"etymology":{"value":"Formed from 'psychedelic' + '-ally'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsaɪkəˈdɛlɪkli/","syllables":"psy-che-del-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Psychedelically' is an adverb that describes something done in a psychedelic style or manner. It often refers to visual or auditory experiences that are distorted or altered, resembling the effects of psychedelic drugs. It can also describe art, music, or decor that is characterized by vibrant colors, swirling patterns, and surreal imagery.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"The painting was psychedelical.","correct":"The painting was psychedelic.","note":"'Psychedelical' is not a standard adjective. The correct adjective is 'psychedelic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["psychedelic (adjective, noun)","psychedelia (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'psychedelically' is an adverb used to describe something done in a way that resembles or produces the effects of psychedelic drugs, such as altered perceptions of reality, hallucinations, and intense sensory experiences. It's often used in the context of art, music, and visual displays to describe vibrant colors, distorted shapes, and surreal imagery. Because it is related to specific subcultures and experiences, it is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The concert hall was lit psychedelically, creating a surreal atmosphere.","translation":"コンサートホールはサイケデリックにライトアップされ、シュールな雰囲気を作り出していた。","type":"adverb","meaning_category":"サイケデリックな方法で"},{"sentence":"The film depicted the drug trip psychedelically.","translation":"その映画はドラッグトリップをサイケデリックに描いていた。","type":"adverb","meaning_category":"サイケデリックな方法で"}]}