{"word":"metallogeny","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"金属成因論、金属生成論、金属区生成論","english_definition":"The study of the origin and distribution of ore deposits, especially with regard to their relationship in space and time to regional geologic features and events.","examples":[{"sentence":"Metallogeny helps us understand how ore deposits form.","translation":"金属成因論は鉱床がどのように形成されるかを理解するのに役立ちます。"},{"sentence":"The metallogeny of the region is complex due to its tectonic history.","translation":"その地域の金属成因は、その構造的な歴史のために複雑です。"}],"collocations":["regional metallogeny","metallogenic province","metallogenic epoch","metallogenic map"],"synonyms":["ore genesis","economic geology","geochemistry"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'metallon' (metal) and 'genesis' (origin, creation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəlˈɒdʒəni/","syllables":"me-tal-lo-ge-ny"},"inflection":{"noun_plural":"metallogenies"},"usage_notes":{"explanation":"Metallogeny is a specialized term used primarily in geology and mining. It focuses on the processes that lead to the formation of ore deposits and their distribution across different regions and time periods. It's closely related to economic geology, which deals with the practical application of geological knowledge to find and exploit mineral resources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metallogeny is about metals themselves.","correct":"✓ The metallogeny is about the origin and distribution of ore deposits.","note":"Metallogeny is not simply about metals, but about the geological processes that create ore deposits."}],"priority":"★☆☆"},"related_words":{"derivatives":["metallogenic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Metallogeny is a highly specialized term used in geology and mining. It requires a strong understanding of geological processes, regional tectonics, and geochemistry. It's not a term commonly encountered outside of academic or professional contexts related to mineral exploration and resource management."},"example_sentences":[{"sentence":"The metallogeny of the Andes Mountains is characterized by porphyry copper deposits.","translation":"アンデス山脈の金属成因は、斑岩銅鉱床によって特徴づけられる。","type":"general","meaning_category":"Origin of ore deposits"},{"sentence":"Understanding the metallogeny of a region is crucial for successful mineral exploration.","translation":"ある地域の金属成因を理解することは、鉱物探査を成功させるために不可欠である。","type":"application","meaning_category":"Mineral exploration"}]}