{"word":"Platonic","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"プラトニックな、精神的な、肉体関係のない","english_definition":"(of a relationship) intimate and affectionate but not sexual.","examples":[{"sentence":"They have a platonic relationship.","translation":"彼らはプラトニックな関係です。"},{"sentence":"Their friendship is purely platonic.","translation":"彼らの友情は純粋にプラトニックなものです。"},{"sentence":"She insists that their relationship is platonic, despite what others may think.","translation":"他の人がどう思おうと、彼女は彼らの関係はプラトニックだと主張しています。"}],"collocations":["platonic love","platonic friendship","platonic relationship"],"synonyms":["nonsexual","spiritual","chaste","pure"],"antonyms":["sexual","romantic","physical"]},{"part_of_speech":"adjective","definition":"（哲学的に）プラトンの、プラトン主義の","english_definition":"relating to Plato or his philosophy.","examples":[{"sentence":"Platonic ideals","translation":"プラトン的な理想"},{"sentence":"Platonic philosophy","translation":"プラトン哲学"},{"sentence":"The concept of Forms is central to Platonic thought.","translation":"イデアの概念はプラトン思想の中心です。"}],"collocations":["Platonic solids","Platonic Forms","Platonic Academy"],"synonyms":["idealistic","philosophical"],"antonyms":["materialistic","empirical"]}],"etymology":{"value":"Derived from the name of the Greek philosopher Plato (428/427 or 424/423 – 348/347 BC), whose philosophy emphasized the importance of the spiritual and intellectual over the physical. The term 'platonic love' was popularized in the Renaissance, drawing on Plato's Symposium, where love is discussed as a path to higher understanding and the contemplation of beauty, rather than purely physical desire.","priority":"★★★"},"pronunciation":{"ipa":"/pləˈtɒnɪk/","syllables":"pla-ton-ic"},"inflection":{"notes":"The word 'platonic' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'platonic' is most commonly used to describe a relationship that is close and affectionate but lacks sexual or romantic involvement. It's important to note that a platonic relationship can be just as meaningful and important as a romantic one. In philosophical contexts, 'platonic' refers to ideas or concepts associated with Plato's philosophy, particularly his emphasis on the realm of Forms or Ideas as the true reality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They are living in a platonic marriage.","correct":"✓ They have a platonic marriage.","note":"While 'platonic relationship' is common, 'platonic marriage' is less so and might imply a marriage without sexual intimacy, which could be a sensitive topic. It's better to say 'They have a marriage that is platonic.'"},{"incorrect":"✗ He is a platonic friend.","correct":"✓ He is a platonic friend of mine. / ✓ We have a platonic friendship.","note":"Saying 'He is a platonic friend' is grammatically awkward. It's better to say 'He is a platonic friend of mine' or 'We have a platonic friendship.'"}],"priority":"★★☆"},"related_words":{"derivatives":["Platonism (プラトン主義)","Platonist (プラトン主義者)"],"idioms_phrases":["Platonic love (プラトニックラブ)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Platonic' is a word that describes a relationship that is close and loving but not romantic or sexual. It comes from the philosopher Plato, who wrote about love in a way that focused on the mind and spirit rather than just physical attraction. So, when we say a friendship is 'platonic,' it means there's a deep connection and care between the people, but it's not a romantic relationship. It can also refer to ideas related to Plato's philosophy."},"example_sentences":[{"sentence":"She and her male roommate have a completely platonic relationship.","translation":"彼女と男性のルームメイトは完全にプラトニックな関係です。","type":"adjective","meaning_category":"nonsexual relationship"},{"sentence":"The philosopher explored the Platonic concept of ideal forms.","translation":"その哲学者は、理想的な形というプラトン的な概念を探求しました。","type":"adjective","meaning_category":"philosophical"},{"sentence":"Their platonic love was based on mutual respect and intellectual connection.","translation":"彼らのプラトニックな愛は、相互の尊敬と知的なつながりに基づいていました。","type":"adjective","meaning_category":"nonsexual relationship"},{"sentence":"The Platonic solids are a set of five geometric shapes.","translation":"プラトン立体は、5つの幾何学的形状のセットです。","type":"adjective","meaning_category":"philosophical"}]}