{"word":"ornature","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)装飾的な自然、自然の装飾、自然を取り入れた装飾","english_definition":"(neologism) decorative nature; ornamentation that incorporates natural elements.","examples":[{"sentence":"The designer's signature style is 'ornature,' blending organic forms with luxurious materials.","translation":"そのデザイナーのシグネチャースタイルは「オーネイチャー」であり、有機的なフォルムと豪華な素材を融合させている。"},{"sentence":"The exhibition showcased 'ornature' installations, featuring living plants arranged in artistic patterns.","translation":"その展示会では、「オーネイチャー」のインスタレーションが展示され、生きている植物が芸術的なパターンで配置されていた。"}],"collocations":["ornature design","ornature installation","ornature style","ornature element"],"synonyms":["biophilic design","natural ornamentation","organic decoration"],"antonyms":["artificial decoration","synthetic ornamentation"]},{"part_of_speech":"noun","definition":"(比喩的に)自然の美しさ、自然の装い","english_definition":"(figuratively) the beauty or adornment of nature.","examples":[{"sentence":"The poet described the forest in its full 'ornature,' with vibrant colors and intricate details.","translation":"詩人は、鮮やかな色彩と複雑なディテールを持つ、完全な「オーネイチャー」に包まれた森を描写した。"},{"sentence":"The garden was a testament to the 'ornature' that could be achieved with careful planning and cultivation.","translation":"その庭は、注意深い計画と栽培によって達成できる「オーネイチャー」の証だった。"}],"collocations":["full ornature","natural ornature","garden ornature"],"synonyms":["natural beauty","natural splendor","natural adornment"],"antonyms":["artificiality","plainness"]}],"etymology":{"value":"A blend of 'ornament' and 'nature.' A relatively recent coinage, likely emerging in the late 20th or early 21st century to describe design aesthetics that integrate natural elements into decorative schemes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːrnətʃər/","syllables":"or-na-ture"},"inflection":{"notes":"Plural form: ornatures"},"usage_notes":{"explanation":"'Ornature' is a relatively new and uncommon word, primarily used in design, architecture, and art contexts to describe the integration of natural elements into decorative or ornamental designs. It can also be used more broadly to refer to the inherent beauty and adornment found in nature itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was full of ornaments and nature.","correct":"✓ The building was full of ornature.","note":"Using 'ornature' provides a concise way to express the combination of ornamentation and natural elements, rather than listing them separately."},{"incorrect":"✗ The ornature of the forest was breathtaking.","correct":"✓ The beauty of the forest was breathtaking.","note":"In general contexts, 'beauty of nature' is more common than 'ornature of the forest,' unless specifically referring to the decorative aspects of nature."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["biophilic design","organic architecture","nature-inspired art","environmental art","sustainable design"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language curricula)","frequency_google_ngram":"Low frequency (relatively rare word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ornature' is a niche word, primarily used in the fields of design and art to describe the blending of ornamentation with natural elements. It is not a commonly used word in everyday language. Understanding the word requires familiarity with design concepts and an appreciation for the integration of nature into artistic and architectural expressions. It is more likely to be encountered in specialized publications or discussions related to these fields."},"example_sentences":[{"sentence":"The hotel lobby featured an impressive 'ornature' display, with a vertical garden cascading down the wall.","translation":"ホテルのロビーには印象的な「オーネイチャー」のディスプレイがあり、垂直庭園が壁に流れ落ちていた。","type":"noun","meaning_category":"decorative nature"},{"sentence":"The artist's 'ornature' sculptures combined metal and living plants to create dynamic and evolving artworks.","translation":"そのアーティストの「オーネイチャー」の彫刻は、金属と生きている植物を組み合わせて、ダイナミックで進化するアート作品を生み出した。","type":"noun","meaning_category":"decorative nature"},{"sentence":"The interior design incorporated 'ornature' elements such as wood paneling, stone accents, and indoor plants.","translation":"そのインテリアデザインには、木製パネル、石のアクセント、屋内植物などの「オーネイチャー」要素が組み込まれていた。","type":"noun","meaning_category":"decorative nature"}]}