{"word":"underpossessor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"One who possesses something to a lesser degree than another; one who has limited or insufficient possession.","english_definition":"A person who possesses something to a lesser extent than another, or who has an insufficient amount of something.","examples":[{"sentence":"In this economic climate, many feel like underpossessors of financial security.","translation":"この経済状況では、多くの人が経済的な安定を十分に持っていないと感じています。"},{"sentence":"Compared to his wealthy neighbors, he felt like an underpossessor of material goods.","translation":"裕福な隣人と比較して、彼は物質的なものを十分に持っていないと感じました。"}],"collocations":["financial underpossessor","material underpossessor"],"synonyms":["lesser owner","limited possessor","deficient holder"],"antonyms":["overpossessor","wealthy owner","abundant holder"]}],"etymology":{"value":"Formed by combining \"under-\" (meaning less or insufficient) with \"possessor\" (one who possesses).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərpəˈzɛsər/","syllables":"un-der-pos-ses-sor"},"inflection":{"noun_plural":"underpossessors"},"usage_notes":{"explanation":"The term 'underpossessor' is not commonly used and may be considered a neologism. Its meaning is fairly transparent, referring to someone who possesses less of something than others or less than is desired or needed. It is often used in contexts discussing economic inequality or resource distribution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an underpossessor than her.","correct":"✓ He is an underpossessor compared to her.","note":"When making a comparison, use 'compared to' or 'in relation to' rather than 'than'."},{"incorrect":"✗ Underpossessor of skills is a problem.","correct":"✓ Underpossession of skills is a problem.","note":"When referring to the state of lacking, 'underpossession' is more appropriate than 'underpossessor'."}],"priority":"★☆☆"},"related_words":{"derivatives":["underpossession (noun: the state of possessing less than is needed or desired)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Underpossessor' is a rarely used word that describes someone who has less of something than others or less than they need. It's formed from 'under-' (meaning less) and 'possessor' (someone who owns something). Because it's not a common word, it's best used in formal writing or when a precise term is needed to describe this specific situation. You might see it in discussions about economics or social inequality."},"example_sentences":[{"sentence":"The study examined the challenges faced by underpossessors of healthcare in rural communities.","translation":"この研究では、地方のコミュニティにおける医療を十分に受けていない人々が直面する課題を調査しました。","type":"noun","meaning_category":"limited possession"},{"sentence":"As an underpossessor of land, he struggled to make a living from farming.","translation":"土地を十分に持っていないため、彼は農業で生計を立てるのに苦労しました。","type":"noun","meaning_category":"limited possession"}]}