{"word":"rousedness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"覚醒度、喚起された状態、興奮状態","english_definition":"The state of being awakened or excited; the degree of physiological or psychological activation.","examples":[{"sentence":"The medication affected his level of rousedness, making him feel more alert.","translation":"その薬は彼の覚醒度に影響を与え、より注意深く感じさせた。"},{"sentence":"The loud noise increased her rousedness, causing her to jump.","translation":"大きな音は彼女の覚醒度を高め、飛び上がらせた。"},{"sentence":"High levels of rousedness can interfere with sleep.","translation":"高い覚醒度は睡眠を妨げることがある。"}],"collocations":["level of rousedness (覚醒度)","increase rousedness (覚醒度を高める)","affect rousedness (覚醒度に影響を与える)","physiological rousedness (生理的な覚醒度)","psychological rousedness (心理的な覚醒度)"],"synonyms":["alertness","wakefulness","excitation","arousal","stimulation","vigilance"],"antonyms":["sleepiness","drowsiness","lethargy","sedation","calmness"]}],"etymology":{"value":"Derived from the verb 'rouse,' which means to awaken or excite. The suffix '-ness' is added to form a noun indicating the state or quality of being roused.","priority":"★★★"},"pronunciation":{"ipa":"/ˈraʊzdnəs/","syllables":"roused-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Rousedness' refers to the state of being awake, alert, and responsive to stimuli. It is often used in a physiological or psychological context to describe the level of activation of the nervous system. The term can indicate a general state of alertness or a more intense state of excitement or agitation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The rousedness of the lion was frightening.","correct":"✓ The arousal of the lion was frightening.","note":"While 'rousedness' is technically correct, 'arousal' is more commonly used to describe the state of an animal being stirred up or excited. 'Rousedness' is more often used in a medical or psychological context."},{"incorrect":"✗ She had a lot of rousedness after drinking coffee.","correct":"✓ She had a high level of rousedness after drinking coffee.","note":"'Rousedness' is a state, so it's better to describe it as a 'level of rousedness' rather than just 'rousedness' itself."}],"priority":"★★☆"},"related_words":{"derivatives":["rouse (verb: 目を覚まさせる、奮い立たせる)","roused (adjective: 目を覚ました、奮い立った)","arousal (noun: 覚醒、興奮)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Rousedness' is a relatively uncommon noun that refers to the state of being awake, alert, and responsive. It is often used in scientific or medical contexts to describe the level of physiological or psychological activation. The word is formed by adding the suffix '-ness' to the adjective 'roused,' which comes from the verb 'rouse' (to awaken or excite)."},"example_sentences":[{"sentence":"The experiment measured the participants' level of rousedness in response to different stimuli.","translation":"その実験では、さまざまな刺激に対する参加者の覚醒度を測定した。","type":"general","meaning_category":"覚醒度"},{"sentence":"His rousedness increased significantly after the adrenaline injection.","translation":"アドレナリン注射後、彼の覚醒度は著しく上昇した。","type":"medical","meaning_category":"覚醒度"},{"sentence":"The therapist worked with her to manage her excessive rousedness and anxiety.","translation":"セラピストは彼女の過剰な覚醒度と不安を管理するために彼女と協力した。","type":"psychological","meaning_category":"覚醒度"}]}