{"word":"recesivo","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"劣性の、潜性の","english_definition":"(genetics) relating to or denoting heritable characteristics controlled by genes that are expressed in offspring only when inherited from both parents, i.e., when not masked by a dominant characteristic.","examples":[{"sentence":"Un rasgo recesivo.","translation":"A recessive trait."}],"collocations":["gen recesivo (recessive gene)","carácter recesivo (recessive trait)","alelo recesivo (recessive allele)"],"synonyms":["latente","subyacente"],"antonyms":["dominante"]}],"etymology":{"value":"Del latín 'recessus', participio pasado de 'recedere' (retirarse, retroceder). En genética, se refiere a un gen que 'retrocede' o se oculta en presencia de un gen dominante.","priority":"★★☆"},"pronunciation":{"ipa":"/re.θeˈsi.βo/ (Spain), /re.seˈsi.bo/ (Latin America)","syllables":"re-ce-si-vo"},"inflection":{"gender":"masculine","number":"singular","other_forms":["recesiva (feminine singular)","recesivos (masculine plural)","recesivas (feminine plural)"]},"usage_notes":{"explanation":"En genética, un gen o alelo **recesivo** solo se expresa fenotípicamente (es decir, en las características observables del organismo) cuando un individuo hereda dos copias del gen recesivo, una de cada progenitor. Si el individuo hereda un gen recesivo y un gen dominante para el mismo rasgo, el rasgo dominante se expresará, y el rasgo recesivo permanecerá 'oculto' o 'latente'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El gen es recesivo a los ojos marrones.","correct":"El gen para los ojos azules es recesivo.","note":"Es más correcto decir que el gen *para un rasgo específico* es recesivo, en lugar de decir que es recesivo *a otro rasgo*."},{"incorrect":"Un gen recesivo siempre se expresa.","correct":"Un gen recesivo solo se expresa cuando se hereda de ambos padres.","note":"Esta es la definición clave de un gen recesivo."}],"priority":"★★☆"},"related_words":{"derivatives":["recesividad (recessiveness)"],"related_scientific_terms":["genotipo (genotype)","fenotipo (phenotype)","alelo (allele)","herencia (inheritance)","cromosoma (chromosome)","dominante (dominant)","homocigoto (homozygous)","heterocigoto (heterozygous)"],"priority":"★★★"},"level_frequency":{"level_estimation":"B2-C1 (Término técnico usado en contextos científicos, especialmente en biología y medicina)","frequency_corpus":"Relativamente frecuente en textos científicos y académicos sobre genética.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"El término 'recesivo' se utiliza en el campo de la genética para describir un tipo de gen que necesita estar presente en dos copias (una heredada de cada padre) para que el rasgo asociado a ese gen se manifieste en el individuo. Si solo hay una copia del gen recesivo y una copia de un gen dominante, el rasgo dominante se expresará en su lugar. Este concepto es fundamental para entender cómo se transmiten las características hereditarias.","priority":"★★☆"},"example_sentences":[{"sentence":"La fibrosis quística es una enfermedad causada por un gen recesivo.","translation":"Cystic fibrosis is a disease caused by a recessive gene.","type":"general","meaning_category":"genetics"},{"sentence":"Para que un niño tenga ojos azules, debe heredar el alelo recesivo de ambos padres.","translation":"For a child to have blue eyes, they must inherit the recessive allele from both parents.","type":"genetics","meaning_category":"inheritance"},{"sentence":"El albinismo es a menudo el resultado de la herencia de genes recesivos.","translation":"Albinism is often the result of inheriting recessive genes.","type":"medicine","meaning_category":"disease"}]}