{"word":"scaphocephalus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"舟状頭蓋、舟状頭","english_definition":"A type of cephalic disorder where premature fusion of the sagittal suture results in a long, narrow head shape resembling an inverted boat.","examples":[{"sentence":"Scaphocephalus is the most common type of craniosynostosis.","translation":"舟状頭蓋は、頭蓋骨縫合早期癒合症の中で最も一般的なタイプです。"},{"sentence":"The diagnosis of scaphocephalus is typically made through physical examination and imaging studies.","translation":"舟状頭蓋の診断は、通常、身体検査と画像検査によって行われます。"}],"collocations":["craniosynostosis","sagittal suture","premature fusion","cephalic disorder","head shape"],"synonyms":["dolichocephaly","keel-shaped head"],"antonyms":[]}],"etymology":{"value":"From Greek 'skaphe' (boat) + 'kephale' (head) + '-os' (suffix indicating a condition or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskæfoʊˈsɛfələs/","syllables":"scaph-o-ceph-a-lus"},"inflection":{"noun_plural":"scaphocephali"},"usage_notes":{"explanation":"'Scaphocephalus' is a medical term specifically referring to a cranial deformity resulting from premature fusion of the sagittal suture. It is important to use this term in the correct medical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has a large head, it must be scaphocephalus.","correct":"✓ The baby has a long, narrow head; it may be scaphocephalus, but a doctor needs to confirm.","note":"Scaphocephalus is a specific condition and requires a medical diagnosis, not just a large head. A long, narrow head is a characteristic, but professional evaluation is needed."}],"priority":"★☆☆"},"related_words":{"derivatives":["scaphocephalic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Very low frequency (Specialized medical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scaphocephalus' is a highly specialized medical term used to describe a specific type of cranial deformity. Understanding and using this term correctly requires medical knowledge. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Surgical intervention is often required to correct severe cases of scaphocephalus.","translation":"重度の舟状頭蓋を矯正するには、外科的介入が必要となることが多い。","type":"noun","meaning_category":"medical condition"},{"sentence":"The infant presented with a prominent sagittal ridge, indicative of scaphocephalus.","translation":"その乳児は顕著な矢状隆起を呈しており、舟状頭蓋を示唆していた。","type":"noun","meaning_category":"medical condition"}]}