{"word":"dopant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(半導体)ドーパント、不純物","english_definition":"An impurity added to a semiconductor to enhance its electrical conductivity.","examples":[{"sentence":"Phosphorus is a common dopant used in silicon semiconductors.","translation":"リンはシリコン半導体で一般的に使用されるドーパントです。"},{"sentence":"The type and concentration of the dopant determine the properties of the semiconductor.","translation":"ドーパントの種類と濃度が半導体の特性を決定します。"}],"collocations":["n-type dopant (n型ドーパント)","p-type dopant (p型ドーパント)","dopant concentration (ドーパント濃度)","introduce dopants (ドーパントを導入する)"],"synonyms":["impurity","doping agent"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'dope', meaning to add an impurity. The term was adopted in the context of semiconductors to describe the intentional addition of impurities to modify their electrical properties.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdoʊpənt/","syllables":"do-pant"},"inflection":{"noun_plural":"dopants"},"usage_notes":{"explanation":"A 'dopant' is a specific type of impurity intentionally added to a semiconductor material to modify its electrical conductivity. The process of adding dopants is called 'doping'. Dopants are crucial in the manufacturing of transistors, diodes, and other semiconductor devices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The semiconductor is made of only dopant.","correct":"✓ The semiconductor is doped with a dopant.","note":"Dopant is added to the semiconductor, not the sole component. The correct usage involves the verb 'dope' or 'dope with'."}],"priority":"★★☆"},"related_words":{"derivatives":["dope (verb: to add a dopant)","doping (noun: the process of adding a dopant)","doped (adjective: having had a dopant added)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'dopant' is specialized vocabulary used in the field of semiconductor physics and electrical engineering. It refers to an impurity intentionally added to a semiconductor material to alter its electrical properties. Understanding this term requires knowledge of semiconductor physics.","priority":"★★★"},"example_sentences":[{"sentence":"Arsenic is used as a dopant to create n-type silicon.","translation":"砒素はn型シリコンを作成するためのドーパントとして使用されます。","type":"noun","meaning_category":"半導体不純物"},{"sentence":"The choice of dopant affects the performance of the transistor.","translation":"ドーパントの選択はトランジスタの性能に影響を与えます。","type":"noun","meaning_category":"半導体不純物"}]}