{"word":"botfly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウマバエ (ウマバエ科のハエの総称)。哺乳類に寄生する","english_definition":"Any fly of the family Oestridae, whose larvae are internal parasites of mammals.","examples":[{"sentence":"The botfly larvae burrowed into the cow's skin.","translation":"ウマバエの幼虫は牛の皮膚に穴を掘って侵入した。"},{"sentence":"Botflies can cause painful swellings in their hosts.","translation":"ウマバエは宿主に痛みを伴う腫れを引き起こすことがある。"}],"collocations":["botfly larva","botfly infestation","remove a botfly"],"synonyms":["oestrid fly"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヒトヒフバエ (特に Dermatobia hominis)","english_definition":"Specifically, Dermatobia hominis, a species of botfly that parasitizes humans.","examples":[{"sentence":"He contracted a botfly infection while traveling in South America.","translation":"彼は南米旅行中にヒトヒフバエに感染した。"},{"sentence":"The doctor removed the botfly larva from the patient's skin.","translation":"医師は患者の皮膚からヒトヒフバエの幼虫を取り除いた。"}],"collocations":["human botfly","Dermatobia hominis","botfly removal"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Bot' は古英語で「腫れ、できもの」を意味し、'fly' はハエを意味する。つまり、腫れやできものを引き起こすハエという意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒtflaɪ/","syllables":"bot-fly"},"inflection":{"noun_plural":"botflies"},"usage_notes":{"explanation":"'Botfly' は、哺乳類に寄生するハエの総称ですが、特にヒトに寄生するヒトヒフバエ (Dermatobia hominis) を指す場合もあります。幼虫が皮膚に侵入し、成長することで、痛みを伴う炎症を引き起こします。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a botfly on the flower.","correct":"✓ I saw a regular fly on the flower.","note":"Botflies are not typically found on flowers. They are parasites and usually found near their hosts (mammals)."},{"incorrect":"✗ Botfly bites are harmless.","correct":"✓ Botfly infestations can be painful and require medical attention.","note":"Botfly infestations are not harmless. The larvae burrowing into the skin can cause pain, inflammation, and secondary infections."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["parasite","larva","myiasis","insect","fly"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Botfly' refers to a type of fly whose larvae live as parasites inside the bodies of mammals, including humans. The term can refer to the entire family of these flies, or specifically to the human botfly (Dermatobia hominis). These flies are known for laying their eggs on other insects, which then carry the eggs to a host animal. When the eggs hatch, the larvae burrow into the host's skin, causing a painful condition called myiasis. Removal of the larvae usually requires medical assistance."},"example_sentences":[{"sentence":"The veterinarian treated the horse for a botfly infestation.","translation":"獣医は馬のウマバエ寄生を治療した。","type":"noun","meaning_category":"parasitic fly"},{"sentence":"Travelers to tropical regions should take precautions against botfly larvae.","translation":"熱帯地域への旅行者は、ヒトヒフバエの幼虫に対する予防措置を講じるべきである。","type":"noun","meaning_category":"parasitic fly"}]}