{"word":"Nazarenes","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ナザレ人 (イエス・キリストの初期の信者たちを指す言葉)","english_definition":"A term used to describe the early followers of Jesus Christ, particularly in the New Testament. It can also refer to people from the city of Nazareth.","examples":[{"sentence":"The book of Acts mentions the Nazarenes as a sect within Judaism.","translation":"使徒言行録には、ナザレ人がユダヤ教内の宗派として言及されている。"},{"sentence":"Some scholars believe that the term 'Nazarene' was initially used derisively.","translation":"一部の学者は、「ナザレ人」という言葉は当初、軽蔑的に使われていたと考えている。"}],"collocations":["early Nazarenes","followers of Jesus","sect of Nazarenes"],"synonyms":["Christians (キリスト教徒)","Followers of the Way (道の信者)"],"antonyms":[]},{"part_of_speech":"noun","definition":"ナザレ人 (ナザレの出身者)","english_definition":"People who came from the city of Nazareth.","examples":[{"sentence":"Jesus was often referred to as Jesus of Nazareth, identifying him as a Nazarene.","translation":"イエスはしばしばナザレのイエスと呼ばれ、彼がナザレ人であることを示していた。"}],"collocations":["Jesus of Nazareth","people of Nazareth"],"synonyms":["resident of Nazareth","inhabitant of Nazareth"],"antonyms":[]}],"etymology":{"value":"The term 'Nazarene' is derived from the Greek word 'Nazarenos' (Ναζωραῖος), which is related to the city of Nazareth in Galilee. The exact etymological connection is debated, but it is generally accepted to refer to people from Nazareth or followers of Jesus, who was associated with Nazareth.","priority":"中"},"pronunciation":{"ipa":"/ˈnæzəˌriːnz/","syllables":"Naz-a-renes"},"inflection":{"noun_plural":"Nazarenes"},"usage_notes":{"explanation":"The term 'Nazarenes' has historical and religious significance, primarily referring to the early followers of Jesus Christ. It is also used to denote people from the city of Nazareth. The term appears in the New Testament and other historical texts.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The Nazarenes are a modern-day religion.","correct":"✓ The term 'Nazarenes' refers to the early followers of Jesus.","note":"The term 'Nazarenes' is primarily used in historical and biblical contexts to refer to early Christians, not a modern-day religion."}],"priority":"低"},"related_words":{"derivatives":["Nazareth (ナザレ)","Nazarene (形容詞: ナザレの、ナザレ人の)"],"phrasal_verbs":[],"priority":"低"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'Nazarenes' is primarily encountered in religious or historical contexts, specifically related to early Christianity and the city of Nazareth. Understanding the term requires familiarity with biblical history and terminology."},"example_sentences":[{"sentence":"The early Nazarenes faced persecution for their beliefs.","translation":"初期のナザレ人は、その信仰のために迫害に直面した。","type":"noun","meaning_category":"Early followers of Jesus"},{"sentence":"Archaeological evidence suggests that Nazareth was a small village during the time of the Nazarenes.","translation":"考古学的証拠は、ナザレがナザレ人の時代には小さな村であったことを示唆している。","type":"noun","meaning_category":"People from Nazareth"}]}