{"word":"Sabellianism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"サベリウス主義：3世紀にサベリウスによって提唱されたキリスト教の異端説で、三位一体の神（父、子、聖霊）は、本質的には同一の神が異なる様相（モード）で現れたものだと主張する説。様態論（Modalism）とも呼ばれる。","english_definition":"A Christian heresy, originating with Sabellius in the 3rd century, that asserts the Father, Son, and Holy Spirit are different modes or aspects of the one God, rather than distinct persons. Also known as Modalism.","examples":[{"sentence":"Sabellianism was condemned as a heresy by the early Church councils.","translation":"サベリウス主義は、初期の教会会議によって異端として非難された。"},{"sentence":"Some argue that certain modern theological views bear similarities to Sabellianism.","translation":"現代の神学的見解の中には、サベリウス主義との類似性を持つものもあると主張する者もいる。"}],"collocations":["Modalistic Monarchianism","Patripassianism"],"synonyms":["Modalism","Modalistic Monarchianism","Patripassianism"],"antonyms":[]}],"etymology":{"value":"サベリウス（Sabellius）の名前に由来。","priority":"中"},"pronunciation":{"ipa":"/səˈbɛliənɪzəm/","syllables":"Sa-bel-li-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"サベリウス主義は、三位一体の教義を理解する上で重要な歴史的背景となる異端説です。正統的なキリスト教の教義では、父、子、聖霊はそれぞれが独立した人格（ペルソナ）でありながら、同一の本質（ウーシア）を持つとされます。サベリウス主義は、この人格の区別を否定し、神は状況に応じて異なる役割を演じていると主張します。","priority":"中"},"common_mistakes":{},"related_words":{"derivatives":["Sabellian (サベリウス主義者)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"高","text":"「サベリウス主義」は、キリスト教神学における専門用語であり、一般的にはなじみのない言葉です。この言葉は、3世紀の神学者サベリウスの教えを指し、三位一体の神が異なる「様相」で現れるという考え方を表します。この概念は、正統的なキリスト教の三位一体の教義とは異なり、異端とされています。神学や宗教学の研究者以外には、あまり使われない言葉です。"},"example_sentences":[{"sentence":"The doctrine of Sabellianism was refuted by theologians such as Tertullian.","translation":"サベリウス主義の教義は、テルトゥリアヌスのような神学者によって反駁された。","type":"noun","meaning_category":"キリスト教異端説"},{"sentence":"Understanding Sabellianism helps to clarify the nuances of Trinitarian theology.","translation":"サベリウス主義を理解することは、三位一体神学のニュアンスを明確にするのに役立つ。","type":"noun","meaning_category":"キリスト教異端説"}]}