{"word":"autonomism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自治主義、自律主義","english_definition":"A political and social theory that emphasizes autonomy, self-determination, and decentralization.","examples":[{"sentence":"Autonomism is a diverse set of social movements and political philosophies.","translation":"自治主義は多様な社会運動と政治哲学の集合体である。"},{"sentence":"The autonomist movement seeks greater local control over resources.","translation":"自治主義運動は、資源に対するより大きな地方の管理権を求めている。"}],"collocations":["autonomist movement","autonomist theory","autonomist politics"],"synonyms":["self-governance","independence","self-determination","libertarianism","decentralization"],"antonyms":["centralization","authoritarianism","statism"]},{"part_of_speech":"noun","definition":"(特にマルクス主義における)自律主義","english_definition":"(Specifically within Marxism) A left-wing political and social movement advocating for workers' self-management and the abolition of hierarchical structures.","examples":[{"sentence":"Autonomism in the Marxist tradition emphasizes the power of the working class to organize independently.","translation":"マルクス主義の伝統における自律主義は、労働者階級が自主的に組織する力を強調する。"},{"sentence":"Autonomism rejects traditional forms of political organization, such as parties and unions.","translation":"自律主義は、政党や労働組合のような伝統的な政治組織の形態を拒否する。"}],"collocations":["autonomist Marxism","autonomist struggles","autonomist organization"],"synonyms":["workerism","operaismo"],"antonyms":["state socialism","vanguardism"]}],"etymology":{"value":"From 'autonomy' (Greek 'autos' = self + 'nomos' = law or rule) + '-ism' (a suffix indicating a doctrine, theory, or system of beliefs).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtɒnəmɪzəm/","syllables":"au-ton-o-mism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Autonomism' refers to a range of political and social theories centered on the concept of autonomy or self-governance. It can refer to general movements for greater regional or local independence. More specifically, within Marxist theory, autonomism describes a left-wing movement focused on workers' self-management and the rejection of traditional hierarchical structures. The specific meaning depends on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Autonomism is when the government controls everything.","correct":"✓ Autonomism is when people control their own affairs.","note":"Autonomism is about self-governance, not government control."},{"incorrect":"✗ Autonomism is the same as anarchism.","correct":"✓ Autonomism shares some similarities with anarchism, but it is not the same thing.","note":"While both value freedom, autonomism doesn't necessarily reject all forms of organization, unlike some forms of anarchism."}],"priority":"★★☆"},"related_words":{"derivatives":["autonomist (noun/adjective)","autonomy (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autonomism' is a complex political term referring to theories and movements emphasizing self-governance and decentralization. It has a general meaning related to regional independence, and a specific meaning within Marxist theory related to workers' self-management. Understanding the context is crucial to interpreting its meaning correctly. It is not a common term in everyday conversation."},"example_sentences":[{"sentence":"The rise of autonomism in the region led to increased calls for independence.","translation":"その地域における自治主義の台頭は、独立を求める声の高まりにつながった。","type":"noun","meaning_category":"General Autonomy"},{"sentence":"Autonomism challenges traditional notions of state power.","translation":"自律主義は、国家権力に関する伝統的な概念に挑戦する。","type":"noun","meaning_category":"General Autonomy"},{"sentence":"Autonomism, as a Marxist theory, focuses on the self-organization of the working class.","translation":"マルクス主義の理論としての自律主義は、労働者階級の自己組織化に焦点を当てる。","type":"noun","meaning_category":"Marxist Theory"}]}