{"word":"overknavery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Excessive or extreme knavery; an abundance of deceitful or dishonest behavior.","english_definition":"An extreme or excessive amount of knavery; an abundance of deceitful or dishonest behavior.","examples":[{"sentence":"The politician's actions were seen as a display of utter overknavery, shocking even the most cynical observers.","translation":"その政治家の行動は、完全な過剰な悪党行為の表れと見なされ、最も皮肉な観察者でさえ衝撃を与えた。"},{"sentence":"The company's overknavery in manipulating the market led to severe consequences.","translation":"その会社の市場操作における過剰な悪党行為は、深刻な結果をもたらした。"}],"collocations":["display of overknavery","act of overknavery","example of overknavery"],"synonyms":["extreme dishonesty","excessive deceit","outright fraud","flagrant trickery"],"antonyms":["honesty","integrity","fairness","uprightness"]}],"etymology":{"value":"Formed by combining \"over-\" (meaning excessive or beyond) with \"knavery\" (meaning dishonest or deceitful behavior).","priority":"★★★"},"pronunciation":{"ipa":"ˌoʊvərˈneɪvəri","syllables":"o-ver-kna-ve-ry"},"inflection":{"noun_plural":"overknaveries"},"usage_notes":{"explanation":"\"Overknavery\" is a relatively rare and somewhat archaic term used to describe an extreme or excessive amount of dishonest or deceitful behavior. It is often used in contexts where the level of dishonesty is considered particularly egregious or shocking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed overknavery behavior.","correct":"✓ He showed overknavery.","note":"\"Overknavery\" itself refers to the behavior, so adding \"behavior\" is redundant."},{"incorrect":"✗ The overknavery was done by overknaves.","correct":"✓ The overknavery was committed by knaves.","note":"While \"overknave\" could theoretically exist, it's not a recognized word. Use \"knave\" to refer to the person committing knavery."}],"priority":"★★☆"},"related_words":{"derivatives":["knavery","knave","over-"],"phrasal_verbs":[],"related_terms":["dishonesty","deceit","fraud","trickery","corruption"]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Overknavery\" is a sophisticated and uncommon word, best suited for advanced English speakers. It describes an extreme level of dishonesty or deceit, implying that the actions are particularly shocking or egregious. Due to its rarity, it's more likely to be encountered in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"The sheer overknavery of the scheme left investigators stunned.","translation":"その計画のまさに過剰な悪党行為は、捜査官たちを唖然とさせた。","type":"noun","meaning_category":"Excessive dishonesty"},{"sentence":"Such blatant overknavery cannot be tolerated in a democratic society.","translation":"そのような露骨な過剰な悪党行為は、民主主義社会では容認できない。","type":"noun","meaning_category":"Extreme deceit"}]}