{"word":"combiner","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"結合器、混合器","english_definition":"A device or circuit that combines or mixes two or more signals, frequencies, or data streams into a single output.","examples":[{"sentence":"The antenna combiner allowed multiple antennas to feed into a single receiver.","translation":"アンテナ結合器により、複数のアンテナからの信号を1つの受信機に供給することができました。"},{"sentence":"This audio combiner mixes the signals from several microphones.","translation":"このオーディオ混合器は、複数のマイクからの信号を混合します。"},{"sentence":"A hybrid combiner is used to combine power from multiple amplifiers.","translation":"ハイブリッド結合器は、複数のアンプからの電力を結合するために使用されます。"}],"collocations":["antenna combiner","hybrid combiner","power combiner","audio combiner","signal combiner"],"synonyms":["mixer","summer","adder","multiplexer"],"antonyms":["splitter","divider","demultiplexer"]},{"part_of_speech":"noun","definition":"(プログラミング) コンバイナ","english_definition":"(In programming) A higher-order function that takes other functions as arguments and returns a new function that combines their behavior.","examples":[{"sentence":"Combinators allow for building complex functions from simpler ones.","translation":"コンビネータを使用すると、より単純な関数から複雑な関数を構築できます。"},{"sentence":"The parser uses combinators to define the grammar.","translation":"パーサーはコンビネータを使用して文法を定義します。"},{"sentence":"Function combinators are a powerful tool for code reuse.","translation":"関数コンビネータは、コードの再利用のための強力なツールです。"}],"collocations":["function combinator","parser combinator","combinator library"],"synonyms":["higher-order function"],"antonyms":[]}],"etymology":{"value":"The word \"combiner\" is derived from the verb \"combine,\" which comes from the Latin word \"combinare,\" meaning \"to join together, unite.\"","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈbaɪnər/","syllables":"com-bin-er"},"inflection":{"noun_plural":"combiners"},"usage_notes":{"explanation":"The term \"combiner\" generally refers to a device or function that merges multiple inputs into a single output. In electronics and telecommunications, it refers to a physical device that combines signals or power. In programming, it refers to a higher-order function that combines the behavior of other functions. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The combiner split the signal.","correct":"✓ The combiner combined the signal.","note":"Combiners combine signals, while splitters divide them."}],"priority":"★★☆"},"related_words":{"derivatives":["combine (verb)","combination (noun)","combinatorial (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"combiner\" is a technical term used in electronics, telecommunications, and computer science. It refers to a device or function that merges multiple inputs into a single output. In electronics, it's a physical device that combines signals or power. In programming, it's a higher-order function that combines the behavior of other functions. Understanding the specific meaning requires knowledge of the context in which it is used.","priority":"★★☆"},"example_sentences":[{"sentence":"The audio **combiner** mixed the signals from the two microphones into a single channel.","translation":"オーディオ**結合器**は、2つのマイクからの信号を1つのチャンネルに混合しました。","type":"noun","meaning_category":"結合器 (オーディオ)"},{"sentence":"The function **combiner** allowed us to create a more complex operation by chaining together simpler functions.","translation":"関数**コンバイナ**を使用すると、より単純な関数を連鎖させることで、より複雑な操作を作成できました。","type":"noun","meaning_category":"コンバイナ (プログラミング)"},{"sentence":"Using a power **combiner**, the output of multiple amplifiers was added together to increase the signal strength.","translation":"電力**結合器**を使用して、複数のアンプの出力を加えて信号強度を高めました。","type":"noun","meaning_category":"結合器 (電力)"}]}