{"word":"Consols","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"英国の永久国債（利付債）","english_definition":"A form of British government bond redeemable at the government's option, with no fixed maturity date, paying a fixed coupon.","examples":[{"sentence":"Consols were once a popular investment for those seeking a steady income.","translation":"コンソル債はかつて、安定した収入を求める人々にとって人気のある投資先でした。"},{"sentence":"The value of Consols fluctuated with changes in interest rates.","translation":"コンソル債の価値は、金利の変動に伴って変動しました。"}],"collocations":["issue consols","trade consols","consol rate","consol yield"],"synonyms":["perpetual bond","annuity","government bond"],"antonyms":["redeemable bond","fixed-term bond"]}],"etymology":{"value":"'Consols' is a shortened form of 'consolidated annuities'. It refers to the consolidation of various British government debts into a single, unified bond issue in the 18th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒnsɒlz/","syllables":"Con-sols"},"inflection":{"noun_plural":"Consols"},"usage_notes":{"explanation":"'Consols' are a specific type of bond issued by the British government. They are characterized by having no maturity date and paying a fixed interest rate indefinitely, unless the government chooses to redeem them. They are historical financial instruments, though some still exist.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a consol for my birthday.","correct":"✓ I bought Consols for my retirement.","note":"'Consol' is a singular noun, but it is almost always used in the plural form 'Consols' when referring to the bonds themselves."},{"incorrect":"✗ Consols are risk-free investments.","correct":"✓ Consols were considered relatively safe investments, but their value can still fluctuate with interest rate changes.","note":"While Consols were historically considered safe, they are still subject to market risks, particularly interest rate risk."}],"priority":"★★☆"},"related_words":{"derivatives":["consolidate","consolidation"],"phrases":["gilt-edged securities","fixed-income securities"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical or financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Consols' refers to a specific type of bond issued by the British government. These bonds are unique because they don't have a set date when the government will pay back the original investment. Instead, they pay a fixed amount of interest forever, unless the government decides to buy them back. Understanding 'Consols' requires some knowledge of financial markets and British economic history."},"example_sentences":[{"sentence":"During the 19th century, Consols were a cornerstone of the British financial system.","translation":"19世紀の間、コンソル債は英国の金融システムの基礎でした。","type":"noun","meaning_category":"British government bond"},{"sentence":"Investors often compared the yield on Consols to that of other government securities.","translation":"投資家はしばしばコンソル債の利回りを他の政府証券の利回りと比較しました。","type":"noun","meaning_category":"British government bond"}]}