{"word":"echometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"音響測深器、エコーメーター","english_definition":"An instrument for measuring distances by means of sound waves; specifically, an instrument for measuring the depth of a well or borehole by measuring the time required for a sound wave to travel to the bottom and return.","examples":[{"sentence":"The echometer is used to determine the water level in the well.","translation":"エコーメーターは井戸の水位を測定するために使用されます。"},{"sentence":"Using an echometer, they were able to accurately measure the depth of the borehole.","translation":"エコーメーターを使って、彼らはボーリング孔の深さを正確に測定することができました。"}],"collocations":["use an echometer","measure with an echometer","echometer reading","digital echometer"],"synonyms":["sonic depth finder","acoustic depth meter"],"antonyms":[]},{"part_of_speech":"noun","definition":"(医学)超音波診断装置","english_definition":"(Medicine) An instrument that uses ultrasound to measure the dimensions of internal body structures or detect abnormalities.","examples":[{"sentence":"The doctor used an echometer to examine the patient's heart.","translation":"医師はエコーメーターを使って患者の心臓を検査しました。"},{"sentence":"The echometer provided a clear image of the fetus.","translation":"エコーメーターは胎児の鮮明な画像を提供しました。"}],"collocations":["medical echometer","cardiac echometer","fetal echometer"],"synonyms":["ultrasound scanner","sonograph"],"antonyms":[]}],"etymology":{"value":"'Echo-' (ギリシャ語の 'ēkhō' (反響) から) + '-meter' (測定器)","priority":"★★☆"},"pronunciation":{"ipa":"/ɛˈkɒmɪtər/","syllables":"e-cho-me-ter"},"inflection":{"noun_plural":"echometers"},"usage_notes":{"explanation":"An echometer is a device that uses sound waves to measure distance. It has two main applications: measuring the depth of wells or boreholes, and medical imaging using ultrasound. In the context of wells, it measures the time it takes for a sound wave to travel to the bottom and back. In medicine, it's used to create images of internal organs and structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the echo meter to check my heart.","correct":"✓ I used the echometer to check my heart.","note":"The correct spelling is 'echometer,' not 'echo meter.'"},{"incorrect":"✗ The echometer measures the speed of sound.","correct":"✓ The echometer measures distance using the time it takes for sound to travel.","note":"The echometer measures distance based on the time it takes for sound to travel, not the speed of sound itself."}],"priority":"★★☆"},"related_words":{"derivatives":["echometry (名詞: エコー測定法)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"An 'echometer' is a specialized instrument that uses sound waves to measure distances or create images. It is used in two main fields: measuring the depth of wells or boreholes (like deep holes in the ground), and in medicine for ultrasound imaging. The medical use is similar to how pregnant women get ultrasound scans to see their baby. The device sends out sound waves and measures how long it takes for them to bounce back, which helps determine the distance or create an image. It's not a common word, but it's important in these specific fields."},"example_sentences":[{"sentence":"The engineers used an echometer to determine the depth of the oil well.","translation":"エンジニアはエコーメーターを使って油井の深さを測定しました。","type":"noun","meaning_category":"井戸の深さ測定"},{"sentence":"The doctor used an echometer to examine the patient's liver.","translation":"医師はエコーメーターを使って患者の肝臓を検査しました。","type":"noun","meaning_category":"超音波診断"}]}