{"word":"angioneurosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血管神経症","english_definition":"A vascular disorder characterized by localized edema or swelling, especially of the skin, mucous membranes, or internal organs.","examples":[{"sentence":"The patient was diagnosed with angioneurosis after experiencing severe swelling.","translation":"患者は重度の腫れを経験した後、血管神経症と診断された。"},{"sentence":"Angioneurosis can be triggered by allergic reactions.","translation":"血管神経症はアレルギー反応によって引き起こされることがある。"}],"collocations":["hereditary angioneurosis","idiopathic angioneurosis","acute angioneurosis","chronic angioneurosis"],"synonyms":["angioedema","Quincke's edema","vascular neurosis"],"antonyms":[]}],"etymology":{"value":"From 'angio-' (referring to blood vessels) + 'neuro-' (referring to nerves) + '-osis' (denoting a condition or disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændʒioʊnʊˈroʊsɪs/","syllables":"an-gi-o-neu-ro-sis"},"inflection":{"noun_plural":"angioneuroses"},"usage_notes":{"explanation":"'Angioneurosis' is a relatively rare term, often used interchangeably with 'angioedema'. It refers to a condition involving swelling due to vascular issues potentially influenced by the nervous system. The term is less commonly used in modern medical contexts, with 'angioedema' being the preferred term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor treated the angioneurosis with antibiotics.","correct":"✓ The doctor treated the angioneurosis with antihistamines and corticosteroids.","note":"Antibiotics are not typically used to treat angioneurosis, as it is not caused by a bacterial infection. Antihistamines and corticosteroids are more common treatments."}],"priority":"★☆☆"},"related_words":{"derivatives":["angioedema"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Angioneurosis' is a highly specialized medical term referring to a vascular disorder. It's primarily encountered in medical literature or discussions. The term is less common than 'angioedema', which is the preferred term in contemporary medical practice. Understanding requires a strong background in medical terminology."},"example_sentences":[{"sentence":"Hereditary angioneurosis can cause life-threatening airway obstruction.","translation":"遺伝性血管神経症は、生命を脅かす気道閉塞を引き起こす可能性がある。","type":"medical","meaning_category":"disease"},{"sentence":"The symptoms of angioneurosis include rapid swelling of the face and throat.","translation":"血管神経症の症状には、顔や喉の急速な腫れが含まれる。","type":"medical","meaning_category":"symptoms"}]}