{"word":"consignor","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"委託者、発送人","english_definition":"a person or company who sends or entrusts goods to another person or company (the consignee) for sale, storage, or shipment.","examples":[{"sentence":"The consignor is responsible for packaging the goods properly.","translation":"委託者は商品を適切に梱包する責任があります。"},{"sentence":"The shipping documents must clearly identify the consignor.","translation":"輸送書類には、委託者を明確に記載する必要があります。"},{"sentence":"As the consignor, we retain ownership of the goods until they are sold.","translation":"委託者として、当社は商品が販売されるまで所有権を保持します。"}],"collocations":["identify the consignor (委託者を特定する)","the consignor's responsibility (委託者の責任)","as the consignor (委託者として)","the consignor retains ownership (委託者は所有権を保持する)"],"synonyms":["shipper","sender","forwarder","exporter"],"antonyms":["consignee","recipient"]},{"part_of_speech":"noun","definition":"(美術品などの)委託販売者","english_definition":"a person who consigns goods, especially works of art, to an agent for sale.","examples":[{"sentence":"The consignor will receive a percentage of the sale price.","translation":"委託販売者は販売価格の一定割合を受け取ります。"},{"sentence":"The auction house acts as an agent for the consignor.","translation":"オークションハウスは、委託販売者の代理人として行動します。"},{"sentence":"We need to agree on the terms of the consignment with the consignor.","translation":"委託販売者と委託販売の条件について合意する必要があります。"}],"collocations":["the consignor receives a percentage (委託販売者は一定割合を受け取る)","agree on terms with the consignor (委託販売者と条件に合意する)","the auction house acts as agent for the consignor (オークションハウスは委託販売者の代理人として行動する)"],"synonyms":["seller","vendor","supplier"],"antonyms":["buyer","purchaser"]}],"etymology":{"value":"From 'consign' + '-or'. 'Consign' comes from Latin 'consignare', meaning 'to seal, register, entrust'.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsaɪnər/","syllables":"con-sign-or"},"inflection":{"noun_plural":"consignors"},"usage_notes":{"explanation":"The term 'consignor' is primarily used in the context of shipping, logistics, and sales agreements where goods are entrusted to another party for a specific purpose (e.g., sale, storage, transportation). It's important to distinguish the consignor from the 'consignee,' who is the recipient of the goods. In the art world, 'consignor' refers to the owner of artwork who entrusts it to a gallery or auction house for sale.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The consignor is the person who receives the goods.","correct":"✓ The consignor is the person who sends the goods.","note":"The consignor is the sender, not the receiver. The receiver is the consignee."},{"incorrect":"✗ The consignor has ownership after the goods are sold.","correct":"✓ The consignor has ownership until the goods are sold.","note":"The consignor retains ownership until the goods are sold to a third party."}],"priority":"★★☆"},"related_words":{"derivatives":["consign (verb)","consignment (noun)","consignee (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'consignor' is a specialized term primarily used in business, logistics, and legal contexts. It refers to the party who sends or entrusts goods to another party (the consignee) for a specific purpose, such as sale or shipment. Understanding this term is essential for interpreting contracts, shipping documents, and other business-related materials. It is less common in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The **consignor** must provide accurate information about the contents of the shipment.","translation":"委託者は、出荷物の内容に関する正確な情報を提供する必要があります。","type":"noun","meaning_category":"shipping"},{"sentence":"The gallery will display the artwork on behalf of the **consignor**.","translation":"ギャラリーは、委託販売者のためにアートワークを展示します。","type":"noun","meaning_category":"art consignment"},{"sentence":"The **consignor** is responsible for any loss or damage to the goods during transit.","translation":"委託者は、輸送中の商品の紛失または損傷について責任を負います。","type":"noun","meaning_category":"shipping"},{"sentence":"The agreement outlines the commission rate the **consignor** will receive upon sale.","translation":"契約には、委託販売者が販売時に受け取る手数料率が記載されています。","type":"noun","meaning_category":"art consignment"}]}