{"word":"martemper","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(金属を)マルテンパー処理する","english_definition":"To heat (metal) to a high temperature, then quench it in a bath of molten salt or metal held at a temperature above the martensite start temperature, and finally air cool it.","examples":[{"sentence":"The steel was martempered to increase its toughness.","translation":"その鋼は靭性を高めるためにマルテンパー処理された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A blend of \"martensite\" and \"temper\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈmɑːrtɛmpər/","syllables":"mar-tem-per"},"inflection":{"verb_forms":{"present_simple":["martemper","martempers"],"past_simple":"martempered","past_participle":"martempered","present_participle":"martempering"}},"usage_notes":{"explanation":"Martempering is a heat treatment process applied to ferrous metals, typically steel, to increase its toughness and reduce the risk of cracking during quenching. It involves austenitizing the metal, quenching it in a molten salt or metal bath held at a temperature just above the martensite start (Ms) temperature, holding it at that temperature until the temperature is uniform throughout the part, and then air cooling it to room temperature. This process results in a more uniform microstructure and reduces internal stresses compared to conventional quenching.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["martempered","martempering"],"related_terms":["austempering","quenching","tempering","martensite"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Martemper' is a specialized term in metallurgy, specifically referring to a heat treatment process for ferrous metals. It is not commonly used outside of engineering and materials science contexts. Understanding requires knowledge of heat treatment processes and materials science principles."},"example_sentences":[{"sentence":"The manufacturer chose to martemper the gears for improved durability.","translation":"製造業者は耐久性を向上させるためにギアをマルテンパー処理することを選択した。","type":"verb","meaning_category":"マルテンパー処理する"}]}