{"word":"karyology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"核学、細胞核の研究","english_definition":"The branch of biology that deals with the study of cell nuclei, especially their structure, function, and behavior.","examples":[{"sentence":"Karyology plays a crucial role in understanding genetics and cell division.","translation":"核学は遺伝学と細胞分裂の理解において重要な役割を果たします。"},{"sentence":"Advances in karyology have led to significant breakthroughs in cancer research.","translation":"核学の進歩は、癌研究において重要なブレークスルーをもたらしました。"}],"collocations":["chromosome karyology","plant karyology","human karyology","karyology research","karyology study","karyology analysis"],"synonyms":["nuclear cytology","nucleology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'karyon' (kernel, nut, or nucleus) and '-logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"ˌkæriˈɒlədʒi","syllables":"kar-y-ol-o-gy"},"inflection":{"noun_plural":"karyologies"},"usage_notes":{"explanation":"Karyology is a specialized field within cell biology that focuses specifically on the nucleus. It involves the study of nuclear structure, the organization of chromosomes, and the processes that occur within the nucleus, such as DNA replication and RNA transcription. Karyology is essential for understanding genetics, heredity, and various cellular processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Karyology is the study of cells in general.","correct":"✓ Karyology is the study of cell nuclei.","note":"Karyology specifically focuses on the cell nucleus, not the entire cell."},{"incorrect":"✗ Cytology and karyology are the same thing.","correct":"✓ Cytology is the study of cells, while karyology is the study of cell nuclei.","note":"Cytology is the broader study of cells, whereas karyology is a more specialized field focused on the nucleus."}],"priority":"★★☆"},"related_words":{"derivatives":["karyological (adjective)","karyologist (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Karyology' is a highly specialized term used in biology, specifically referring to the study of cell nuclei. It's a term primarily encountered in advanced scientific literature, academic research, and specialized textbooks related to cell biology, genetics, and related fields. Due to its specific focus, it is not a common term in general language or introductory science courses."},"example_sentences":[{"sentence":"The researcher specialized in plant **karyology**, studying the chromosome structure of various species.","translation":"その研究者は植物核学を専門とし、様々な種の染色体構造を研究していました。","type":"general","meaning_category":"cell nuclei study"},{"sentence":"**Karyology** provides valuable insights into the genetic basis of certain diseases.","translation":"核学は、特定の疾患の遺伝的基盤に関する貴重な洞察を提供します。","type":"general","meaning_category":"cell nuclei study"}]}