{"word":"redargutory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"反駁する、論駁する、反論の、反駁的な","english_definition":"Serving to refute; containing refutation; refutatory.","examples":[{"sentence":"The lawyer presented a redargutory argument to counter the prosecution's claims.","translation":"弁護士は、検察側の主張に対抗するために、反駁的な議論を提示した。"},{"sentence":"His redargutory remarks effectively dismantled the opposing viewpoint.","translation":"彼の反駁的な発言は、効果的に反対の視点を打ち砕いた。"}],"collocations":["redargutory argument","redargutory remarks","redargutory evidence"],"synonyms":["refutatory","rebutting","contradictory","disproving","invalidating"],"antonyms":["supporting","confirming","validating","corroborating"]}],"etymology":{"value":"Late Latin redargutorius, from redarguere 'to refute,' from re- 'back, against' + arguere 'to argue, prove'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛdɑːrˈɡjuːtəri/","syllables":"re-dar-gu-to-ry"},"inflection":{"notes":"Adjective; comparative and superlative forms (more redargutory, most redargutory) are possible but rare."},"usage_notes":{"explanation":"'Redargutory' is a relatively rare and formal word, primarily used in legal, academic, or rhetorical contexts. It specifically describes something that serves to refute or rebut an argument or claim. It implies a direct and often forceful contradiction of a previous statement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The redargutory statement supported the original claim.","correct":"✓ The redargutory statement refuted the original claim.","note":"'Redargutory' means 'refuting,' so it cannot be used to describe something that supports a claim."}],"priority":"★★☆"},"related_words":{"derivatives":["redargue (verb): to refute","redargution (noun): refutation"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Redargutory' is a highly specialized and uncommon word. Understanding its meaning requires a strong vocabulary and familiarity with formal or academic discourse. It is unlikely to be encountered in everyday conversation or writing. Its use is generally limited to contexts where precise and technical language is required to describe the act of refutation."},"example_sentences":[{"sentence":"The professor delivered a redargutory lecture, systematically dismantling each of the student's flawed premises.","translation":"教授は反駁的な講義を行い、学生の欠陥のある前提を体系的に解体した。","type":"example","meaning_category":"refuting"},{"sentence":"The defense attorney presented redargutory evidence to challenge the credibility of the witness.","translation":"弁護人は、証人の信頼性に異議を唱えるために、反駁的な証拠を提示した。","type":"example","meaning_category":"rebuttal"}]}