{"word":"monobacillary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一の桿菌から成る、または単一の桿菌に関連する","english_definition":"Consisting of or relating to a single bacillus.","examples":[{"sentence":"The infection was determined to be monobacillary, originating from a single strain of bacteria.","translation":"その感染症は、単一の細菌株に由来する単一の桿菌によるものと判断された。"}],"collocations":["monobacillary infection","monobacillary culture"],"synonyms":["single-bacillus","unibacillary"],"antonyms":["polybacillary","multibacillary"]}],"etymology":{"value":"Derived from the combination of 'mono-' (meaning 'single'), 'bacillus' (referring to a rod-shaped bacterium), and '-ary' (a suffix indicating relationship or possession).","priority":"★★★"},"pronunciation":{"ipa":"ˌmɒnəʊbəˈsɪləri","syllables":"mo-no-ba-cil-la-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, besides comparative and superlative forms (which are rare for this word)."},"usage_notes":{"explanation":"The term 'monobacillary' is primarily used in medical and microbiological contexts to describe conditions, infections, or cultures involving only one type of bacillus. It is often used to differentiate from polybacillary or multibacillary conditions involving multiple types of bacilli.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sample was monobacillary with several different bacteria present.","correct":"✓ The sample contained only one type of bacillus.","note":"'Monobacillary' implies only one type of bacillus is present. If there are several different bacteria, it cannot be monobacillary."}],"priority":"★★☆"},"related_words":{"derivatives":["bacillus","bacillary","polybacillary","multibacillary"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Monobacillary' is a highly specialized term used in microbiology and medicine. It indicates the presence or involvement of only one type of bacillus. Understanding this term requires knowledge of basic microbiology and medical terminology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The laboratory analysis confirmed a monobacillary infection, simplifying the treatment plan.","translation":"検査室での分析により、単一の桿菌による感染症であることが確認され、治療計画が簡素化された。","type":"general","meaning_category":"単一の桿菌から成る"},{"sentence":"The monobacillary culture allowed for precise identification of the causative agent.","translation":"単一の桿菌培養により、原因物質の正確な特定が可能になった。","type":"scientific","meaning_category":"単一の桿菌に関連する"}]}