{"word":"diazobenzene","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジアゾベンゼン","english_definition":"An organic compound with the formula C6H5N2X, where X is an anion. Diazobenzenes are diazonium salts derived from benzene. They are often used as intermediates in the synthesis of dyes and other organic compounds.","examples":[{"sentence":"Diazobenzene is used in the production of azo dyes.","translation":"ジアゾベンゼンはアゾ染料の製造に使用される。"},{"sentence":"The reaction of aniline with nitrous acid produces diazobenzene.","translation":"アニリンと亜硝酸の反応によりジアゾベンゼンが生成される。"}],"collocations":["diazobenzene chloride","diazobenzene derivative","diazobenzene synthesis"],"synonyms":["diazonium salt","benzenediazonium"],"antonyms":[]}],"etymology":{"value":"Derived from 'diazo-' (referring to the presence of two nitrogen atoms) + 'benzene' (the aromatic hydrocarbon from which it is derived).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪˌæzoʊˈbɛnziːn/","syllables":"di-a-zo-ben-zene"},"inflection":{"noun_plural":"diazobenzenes"},"usage_notes":{"explanation":"Diazobenzene compounds are typically unstable and are handled with care. They are important in organic chemistry for their ability to undergo various reactions, particularly in the formation of azo dyes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Diazobenzene is a element.","correct":"✓ Diazobenzene is a compound.","note":"Diazobenzene is an organic compound, not an element."}],"priority":"★☆☆"},"related_words":{"derivatives":["diazonium","benzene","azo dye"],"related_compounds":["aniline","nitrous acid"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Diazobenzene refers to a specific class of organic compounds characterized by the presence of a diazonium group attached to a benzene ring. These compounds are primarily encountered in advanced chemistry contexts, particularly in discussions of dye synthesis and organic reactions. Understanding diazobenzene requires familiarity with basic organic chemistry principles.","priority":"★★☆"},"example_sentences":[{"sentence":"The synthesis of azo dyes often involves the use of **diazobenzene** intermediates.","translation":"アゾ染料の合成には、ジアゾベンゼン中間体がよく使用される。","type":"scientific","meaning_category":"chemical compound"},{"sentence":"**Diazobenzene** compounds are known for their reactivity in coupling reactions.","translation":"ジアゾベンゼン化合物は、カップリング反応における反応性で知られている。","type":"scientific","meaning_category":"chemical compound"}]}