{"word":"Dioscorine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A toxic alkaloid found in various plants of the genus Dioscorea (yams), particularly Dioscorea batatas (air potato). It acts as a neurotoxin and can cause convulsions, paralysis, and even death if ingested in sufficient quantities.","english_definition":"A toxic alkaloid found in various plants of the genus Dioscorea (yams).","examples":[{"sentence":"Dioscorine is responsible for the toxicity of some wild yam species.","translation":"ジオスコリンは、一部の野生ヤマイモ種の毒性の原因です。"},{"sentence":"Proper cooking methods can reduce the dioscorine content in yams.","translation":"適切な調理法は、ヤマイモ中のジオスコリン含有量を減らすことができます。"}],"collocations":["dioscorine poisoning","dioscorine content","extract dioscorine"],"synonyms":["yam alkaloid"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Dioscorea, which is named after the ancient Greek physician and botanist Pedanius Dioscorides.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈɒskəˌriːn/","syllables":"Di-os-co-rine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dioscorine is a potent neurotoxin, and plants containing it should be handled with care. Proper identification and preparation are crucial to avoid poisoning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dioscorine is a vitamin.","correct":"✓ Dioscorine is a toxic alkaloid.","note":"Dioscorine is a toxic compound, not a nutrient like a vitamin."}],"priority":"★★☆"},"related_words":{"derivatives":["Dioscorea","yam","alkaloid","neurotoxin"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Dioscorine is a specialized term in botany and toxicology, referring to a specific toxic compound found in certain yam species. Understanding its properties and risks requires advanced knowledge in these fields."},"example_sentences":[{"sentence":"The study investigated the effects of dioscorine on neuronal activity.","translation":"その研究は、ジオスコリンが神経活動に及ぼす影響を調査した。","type":"scientific","meaning_category":"toxicology"},{"sentence":"Traditional preparation methods aim to reduce the dioscorine levels in edible yams.","translation":"伝統的な調理法は、食用ヤマイモ中のジオスコリンレベルを下げることを目的としている。","type":"culinary/botanical","meaning_category":"food preparation"}]}