{"word":"Ordinee","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who is being ordained or has recently been ordained, especially in a religious context.","english_definition":"A person who is about to be or has recently been ordained into a religious order or office.","examples":[{"sentence":"The ordinee knelt before the bishop during the ceremony.","translation":"叙階者は儀式の最中、司教の前にひざまずいた。"},{"sentence":"The ordinee's family watched with pride as he took his vows.","translation":"叙階者の家族は、彼が誓いを立てるのを目を輝かせて見守った。"},{"sentence":"The newly ordained ordinee gave his first sermon.","translation":"新しく叙階された叙階者は、最初の説教を行った。"}],"collocations":["new ordinee","ordinee priest","ordinee bishop","ordinee class","ordinee ceremony"],"synonyms":["candidate","novice","initiate","postulant"],"antonyms":["veteran","established member"],"notes":"The term is most commonly used in Christian contexts, particularly within the Catholic, Anglican, and Orthodox traditions. It emphasizes the transitional status of the individual as they move towards formal incorporation into the clergy."}],"etymology":{"value":"Derived from the verb 'ordain,' which comes from the Latin 'ordinare,' meaning 'to put in order, regulate, appoint.' The suffix '-ee' indicates the recipient of the action.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɔːr.dəˈniː/","syllables":"Or-di-nee"},"inflection":{"noun_plural":"Ordinees"},"usage_notes":{"explanation":"'Ordinee' is a relatively uncommon word, primarily used within religious circles. It specifically refers to someone in the process of being ordained or someone who has just been ordained. It is not generally used in secular contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The ordinee was a member of the board.","correct":"✓ The ordinee was preparing for his ordination.","note":"'Ordinee' refers to someone being ordained, not just any member of a religious organization."},{"incorrect":"✗ She was an ordinee in the company.","correct":"✓ She was a trainee in the company.","note":"'Ordinee' is specific to religious ordination and should not be used in secular contexts like corporate training."}],"priority":"N/A"},"related_words":{"derivatives":["Ordain","Ordination"],"related_terms":["Clergy","Deacon","Priest","Bishop"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'Ordinee' is a specialized term primarily used within religious contexts, specifically referring to someone who is in the process of being or has recently been ordained into a religious order. Due to its limited use and specific meaning, it is considered a word that would be encountered by those with advanced English proficiency or those familiar with religious terminology."},"example_sentences":[{"sentence":"The ordinee spent months in preparation for the priesthood.","translation":"その叙階者は、司祭職の準備に数ヶ月を費やした。","type":"noun","meaning_category":"Religious"},{"sentence":"The bishop welcomed the new ordinees into the diocese.","translation":"司教は、新しい叙階者を教区に迎え入れた。","type":"noun","meaning_category":"Religious"},{"sentence":"The ordinee's vows were a testament to his faith.","translation":"その叙階者の誓いは、彼の信仰の証だった。","type":"noun","meaning_category":"Religious"}]}