{"word":"tumorlytic","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"腫瘍溶解性の","english_definition":"Relating to or causing the destruction or lysis of tumor cells.","examples":[{"sentence":"Tumorlytic viruses are being investigated as a cancer therapy.","translation":"腫瘍溶解性ウイルスは、癌治療として研究されています。"},{"sentence":"The drug has tumorlytic properties.","translation":"その薬は腫瘍溶解性を持っています。"}],"collocations":["tumorlytic virus","tumorlytic activity","tumorlytic effect","tumorlytic properties"],"synonyms":["oncolytic"],"antonyms":["tumorigenic"],"related_terms":["lysis","tumor","cancer","oncolysis"]}],"etymology":{"value":"Formed from 'tumor' + '-lytic' (from lysis, meaning dissolution or destruction).","priority":"中"},"pronunciation":{"ipa":"/ˌtjuːmərˈlɪtɪk/","syllables":"tu-mor-ly-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more tumorlytic, most tumorlytic) but not commonly used."},"usage_notes":{"explanation":"'Tumorlytic' specifically refers to the ability to destroy tumor cells, often in the context of cancer treatment. It's frequently used to describe viruses or other agents that selectively target and kill cancer cells.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The tumorlytic is a type of tumor.","correct":"A tumorlytic agent is used to destroy tumors.","note":"'Tumorlytic' is an adjective, not a noun referring to a type of tumor."}],"priority":"低"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in scientific and medical contexts.","priority":"低"},"readability_explanation":{"level":"C1","text":"'Tumorlytic' is a technical term used in oncology and related fields. It describes something that has the ability to destroy tumor cells. Understanding this term requires knowledge of basic biology and cancer terminology."},"example_sentences":[{"sentence":"The researchers are testing a novel tumorlytic agent in preclinical trials.","translation":"研究者たちは、前臨床試験で新規の腫瘍溶解性薬剤を試験しています。","type":"general","meaning_category":"medical"},{"sentence":"This tumorlytic immunotherapy shows promise in treating advanced cancers.","translation":"この腫瘍溶解性免疫療法は、進行癌の治療に有望です。","type":"general","meaning_category":"medical"}]}