{"word":"heteroinoculation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異種接種：異なる種の生物に接種すること。または、ある種の生物から別の種の生物への接種。","english_definition":"The inoculation of an organism with material from a different species; inoculation from one species to another.","examples":[{"sentence":"Heteroinoculation experiments can help determine the host range of a particular pathogen.","translation":"異種接種実験は、特定の病原体の宿主範囲を決定するのに役立ちます。"},{"sentence":"The study involved heteroinoculation of plant viruses to observe cross-species infectivity.","translation":"その研究では、種を越えた感染性を観察するために、植物ウイルスの異種接種が行われた。"}],"collocations":["experimental heteroinoculation","plant heteroinoculation","viral heteroinoculation"],"synonyms":["cross-species inoculation","xenografting (related, but usually refers to transplantation of tissue)"],"antonyms":["autoinoculation (self-inoculation)","homo inoculation (inoculation within the same species)"]}],"etymology":{"value":"\"hetero-\" (異なる) + \"inoculation\" (接種)","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtəroʊɪˌnɒkjʊˈleɪʃən/","syllables":"het-er-o-in-oc-u-la-tion"},"inflection":{"noun_plural":"heteroinoculations"},"usage_notes":{"explanation":"Heteroinoculation is a term primarily used in scientific and medical contexts, particularly in research related to infectious diseases, immunology, and plant pathology. It is used to describe the process of introducing a pathogen or other biological material from one species into another species. This technique is often used to study disease transmission, immune responses, and the potential for cross-species infection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heteroinoculation was performed between the same species.","correct":"✓ The inoculation was performed within the same species.","note":"Heteroinoculation specifically refers to inoculation between different species. Inoculation within the same species is referred to as homo inoculation."}],"priority":"★★★"},"related_words":{"derivatives":["heteroinoculate (verb)"],"related_terms":["inoculation","xenotransplantation","cross-species transmission","host range"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'heteroinoculation' is specialized vocabulary typically encountered in advanced scientific or medical texts. It refers to the process of inoculating or introducing biological material from one species into another. Understanding this term requires familiarity with basic biological concepts such as species, inoculation, and cross-species transmission. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers used heteroinoculation to test the susceptibility of mice to the human virus.","translation":"研究者らは、ヒトウイルスに対するマウスの感受性をテストするために異種接種を用いた。","type":"general","meaning_category":"異種接種"},{"sentence":"Heteroinoculation studies are crucial for understanding the potential for zoonotic diseases to emerge.","translation":"異種接種研究は、人獣共通感染症が発生する可能性を理解するために非常に重要である。","type":"scientific","meaning_category":"異種接種"},{"sentence":"The success of heteroinoculation can depend on the genetic similarity between the donor and recipient species.","translation":"異種接種の成功は、ドナー種とレシピエント種の遺伝的類似性に依存する可能性がある。","type":"technical","meaning_category":"異種接種"}]}