{"word":"Keatsian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"キーツ風の、キーツに特徴的な、キーツの詩に似た","english_definition":"resembling or characteristic of the poetry of John Keats, especially in its sensuous imagery, romantic themes, and melancholy tone.","examples":[{"sentence":"The poem has a Keatsian quality in its rich descriptions of nature.","translation":"その詩は、自然の豊かな描写においてキーツ風の性質を持っている。"},{"sentence":"The artist's paintings evoke a Keatsian sense of beauty and transience.","translation":"その画家の絵は、美と儚さに関するキーツ的な感覚を呼び起こす。"},{"sentence":"The novel's protagonist is a Keatsian figure, haunted by unfulfilled desires.","translation":"その小説の主人公は、満たされない欲望に取り憑かれたキーツ的な人物である。"}],"collocations":["Keatsian imagery (キーツ風のイメージ)","Keatsian beauty (キーツ風の美しさ)","Keatsian melancholy (キーツ風の憂鬱)","Keatsian ode (キーツ風の頌歌)","Keatsian themes (キーツ風のテーマ)","Keatsian influence (キーツ風の影響)"],"synonyms":["romantic","sensuous","lyrical","melancholy","poetic"],"antonyms":["unromantic","unsentimental","prosaic"]}],"etymology":{"value":"John Keats (1795-1821), an English Romantic poet, + -ian (suffix indicating association or resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːtsiən/","syllables":"Keats-i-an"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The adjective \"Keatsian\" is used to describe something that has qualities similar to the poetry of John Keats. These qualities often include a focus on beauty, nature, sensuality, and a sense of melancholy or sadness. It is often used in literary criticism or art reviews.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The music was very Keatsian, it made me feel happy.","correct":"✓ The music was very Keatsian, it made me feel melancholic.","note":"Keatsian works are generally associated with melancholy, not happiness."},{"incorrect":"✗ He wrote a Keatsian novel which was about science fiction.","correct":"✓ He wrote a novel with Keatsian elements, such as a focus on beauty and nature.","note":"While not impossible, Keatsian themes are more commonly associated with nature, beauty, and romance, not science fiction."}],"priority":"★★☆"},"related_words":{"derivatives":["Keats (noun: John Keats himself)","Keatsianism (noun: the characteristics or qualities of Keats's poetry or thought)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Keatsian' is an adjective used to describe something that resembles the style, themes, or qualities found in the poetry of John Keats, a famous English Romantic poet. It often refers to works that are characterized by sensuous imagery, a focus on beauty and nature, and a sense of melancholy or sadness. This word is most often encountered in literary analysis or discussions of art and poetry."},"example_sentences":[{"sentence":"The garden, with its overgrown roses and crumbling statues, had a distinctly Keatsian atmosphere.","translation":"その庭は、生い茂ったバラと崩れかけた彫像があり、明らかにキーツ風の雰囲気を持っていた。","type":"adjective","meaning_category":"atmosphere/setting"},{"sentence":"The poet's early work showed a strong Keatsian influence, with its emphasis on sensory experience.","translation":"その詩人の初期の作品は、感覚的な経験を重視しており、キーツの影響を強く受けていた。","type":"adjective","meaning_category":"influence"},{"sentence":"Her paintings, filled with images of decaying flowers and fading light, possessed a certain Keatsian beauty.","translation":"彼女の絵は、朽ちていく花や薄れていく光のイメージで満たされており、ある種のキーツ風の美しさを持っていた。","type":"adjective","meaning_category":"beauty"}]}