{"word":"camber-line","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（翼または翼型の）キャンバー線、平均翼型線","english_definition":"The locus of points halfway between the upper and lower surfaces of an airfoil, measured perpendicular to the line.","examples":[{"sentence":"The camber-line is an important factor in determining the aerodynamic characteristics of an airfoil.","translation":"キャンバー線は、翼型の空力特性を決定する重要な要素です。"}],"collocations":["mean camber-line","airfoil camber-line","camber-line shape"],"synonyms":["mean line","mid-camber line"],"antonyms":[]}],"etymology":{"value":"Derived from 'camber' (a slight convex curvature) and 'line', describing the line representing the average curvature of an airfoil.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæmbərˌlaɪn/","syllables":"cam-ber-line"},"inflection":{"noun_plural":"camber-lines"},"usage_notes":{"explanation":"The camber-line is a geometric representation of the curvature of an airfoil. It is crucial in aerodynamics for analyzing and designing wings and other lifting surfaces. The shape of the camber-line significantly affects lift, drag, and stall characteristics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ camber line","correct":"✓ camber-line","note":"While 'camber line' is sometimes used, 'camber-line' is the more formally correct and common term in technical literature."}],"priority":"★★☆"},"related_words":{"derivatives":["camber","airfoil","chord line"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - specialized technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'camber-line' is a specialized term used in the field of aerodynamics, specifically related to the design and analysis of airfoils (wings). It refers to the line that represents the average curvature of the airfoil. Understanding this term requires familiarity with basic aerodynamic principles."},"example_sentences":[{"sentence":"The design software allows engineers to modify the camber-line of the wing to optimize its performance.","translation":"設計ソフトウェアにより、エンジニアは翼の性能を最適化するためにキャンバー線を変更できます。","type":"noun","meaning_category":"aerodynamics"},{"sentence":"Different camber-line shapes result in varying lift and drag characteristics.","translation":"異なるキャンバー線の形状は、さまざまな揚力と抗力の特性をもたらします。","type":"noun","meaning_category":"aerodynamics"}]}