{"word":"Pelvioplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A surgical procedure to reconstruct or reshape the pelvis.","english_definition":"Surgical reconstruction or reshaping of the pelvis.","examples":[{"sentence":"Pelvioplasty is often performed to correct congenital deformities of the pelvis.","translation":"骨盤形成術は、多くの場合、骨盤の先天性変形を矯正するために行われます。"},{"sentence":"The patient underwent pelvioplasty to improve hip joint stability.","translation":"患者は股関節の安定性を改善するために骨盤形成術を受けました。"}],"collocations":["undergo pelvioplasty","perform pelvioplasty","pelvioplasty surgery"],"synonyms":["pelvic reconstruction","pelvic reshaping"],"antonyms":[]}],"etymology":{"value":"From 'pelvis' (Latin for 'basin') + '-plasty' (Greek 'plassein' meaning 'to mold or shape').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛlvioʊˌplæsti/","syllables":"pel-vi-o-plas-ty"},"inflection":{"noun_plural":"pelvioplasties"},"usage_notes":{"explanation":"Pelvioplasty refers to a range of surgical procedures aimed at correcting deformities, injuries, or other structural issues of the pelvis. It is often used in pediatric orthopedics to treat congenital hip dysplasia or other pelvic abnormalities. The specific techniques used in pelvioplasty vary depending on the patient's condition and the goals of the surgery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pelvioplasty was done by a cardiologist.","correct":"✓ The pelvioplasty was done by an orthopedic surgeon.","note":"Pelvioplasty is a surgical procedure performed by orthopedic surgeons or specialized surgeons, not cardiologists."},{"incorrect":"✗ Pelvioplasty is a non-invasive procedure.","correct":"✓ Pelvioplasty is an invasive surgical procedure.","note":"Pelvioplasty involves surgical intervention and is not a non-invasive procedure."}],"priority":"★★☆"},"related_words":{"derivatives":["pelvic","osteotomy","reconstruction"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pelvioplasty' is a specialized medical term referring to surgical procedures that reconstruct or reshape the pelvis. Understanding this term requires knowledge of medical terminology and surgical procedures. The term is primarily used within medical contexts and is not commonly encountered in general conversation."},"example_sentences":[{"sentence":"The surgeon recommended a pelvioplasty to correct the patient's pelvic deformity.","translation":"外科医は患者の骨盤変形を矯正するために骨盤形成術を推奨しました。","type":"general","meaning_category":"surgical procedure"},{"sentence":"Post-operative care after pelvioplasty includes physical therapy to restore mobility.","translation":"骨盤形成術後の術後ケアには、可動性を回復するための理学療法が含まれます。","type":"medical","meaning_category":"post-operative care"}]}