{"word":"Gyplure","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A synthetic pheromone used as an attractant for the gypsy moth.","english_definition":"A synthetic pheromone used as an attractant for the gypsy moth.","examples":[{"sentence":"Gyplure was one of the first insect pheromones to be identified and synthesized.","translation":"ジプルーアは、最初に特定され合成された昆虫フェロモンの一つでした。"},{"sentence":"Traps baited with gyplure are used to monitor gypsy moth populations.","translation":"ジプルーアで誘引されたトラップは、モンシロドクガの個体数を監視するために使用されます。"}],"collocations":["gyplure trap","gyplure-baited trap","synthetic gyplure"],"synonyms":["pheromone attractant"],"antonyms":[]}],"etymology":{"value":"Derived from \"gypsy moth lure\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɪplʊər/","syllables":"Gyp-lure"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Gyplure is a specific pheromone used to attract gypsy moths, primarily for monitoring and control purposes. It's a technical term mainly used in the fields of entomology and pest management.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pheromone","lure","gypsy moth"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Gyplure' is a technical term used specifically in the context of entomology and pest control related to gypsy moths. It refers to a synthetic pheromone used to attract these moths, typically for monitoring their populations. Due to its specialized nature, it is not a word commonly encountered outside of these specific fields."},"example_sentences":[{"sentence":"The effectiveness of gyplure in attracting male gypsy moths has been well-documented.","translation":"雄のモンシロドクガを引き寄せるジプルーアの有効性は十分に文書化されています。","type":"noun","meaning_category":"pheromone"},{"sentence":"Researchers are exploring more environmentally friendly alternatives to gyplure for gypsy moth control.","translation":"研究者たちは、モンシロドクガの防除のために、ジプルーアのより環境に優しい代替手段を模索しています。","type":"noun","meaning_category":"pheromone"}]}