{"word":"stampedingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"殺到するように、我先にと、雪崩を打って","english_definition":"in a manner resembling a stampede; rushing forward in a chaotic and uncontrolled way.","examples":[{"sentence":"The crowd moved stampedingly towards the exit.","translation":"群衆は出口に向かって我先にと殺到した。"},{"sentence":"The investors sold their shares stampedingly after the bad news.","translation":"投資家たちは悪いニュースの後、我先にと株を売った。"}],"collocations":["move stampedingly","rush stampedingly","sell stampedingly"],"synonyms":["tumultuously","chaotically","pell-mell","headlong","frantically"],"antonyms":["calmly","orderly","methodically"]}],"etymology":{"value":"The word is derived from 'stampede' (a sudden panicked rush of a herd of animals or a crowd of people) with the addition of the suffix '-ingly', which transforms it into an adverb indicating the manner of the action.","priority":"★★☆"},"pronunciation":{"ipa":"/stæmˈpiːdɪŋli/","syllables":"stam-peed-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Stampedingly' describes an action done in a way that resembles a stampede. It implies a lack of control, panic, and a large number of people or entities acting in the same way at the same time. It is relatively rare and often used to create a vivid image of chaos or urgency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The water flowed stampedingly down the river.","correct":"✓ The water flowed rapidly down the river.","note":"'Stampedingly' is usually used to describe the movement of people or animals, not inanimate objects like water."},{"incorrect":"✗ He stampedingly finished the race.","correct":"✓ He frantically finished the race.","note":"'Stampedingly' implies a chaotic mass movement, not individual effort. 'Frantically' would be more appropriate here."}],"priority":"★★☆"},"related_words":{"derivatives":["stampede (noun/verb)","stampeder (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stampedingly' is an adverb that describes something happening in a rushed, chaotic, and uncontrolled manner, similar to a stampede. It's not a common word, so it's more likely to be found in advanced texts or when someone wants to create a strong image of panic or disorder. Because it's derived from the more common word 'stampede,' understanding that word helps to understand 'stampedingly'."},"example_sentences":[{"sentence":"The shoppers stampedingly entered the store on Black Friday.","translation":"買い物客たちはブラックフライデーに店に殺到して入った。","type":"adverb","meaning_category":"殺到するように"},{"sentence":"As the fire alarm sounded, the audience stampedingly exited the theater.","translation":"火災報知機が鳴ると、観客は劇場から我先にと出口に向かった。","type":"adverb","meaning_category":"我先にと"}]}