{"word":"pseudomancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偽りの予言、偽の占い","english_definition":"False or pretended divination; deceptive or pretended prophecy.","examples":[{"sentence":"The charlatan practiced pseudomancy, deceiving the gullible with fabricated visions.","translation":"そのペテン師は偽りの予言を行い、でっち上げの幻影で騙されやすい人々を欺いた。"},{"sentence":"Skeptics view astrology as a form of pseudomancy, lacking any scientific basis.","translation":"懐疑論者たちは、占星術を科学的根拠を欠く偽りの占いの一形態と見なしている。"}],"collocations":["practice pseudomancy","a form of pseudomancy","accuse of pseudomancy"],"synonyms":["false prophecy","fake divination","sham divination","deceptive prophecy"],"antonyms":["true prophecy","genuine divination"]},{"part_of_speech":"noun","definition":"偽りの予言術、偽の占い術","english_definition":"The art or practice of false prophecy or divination.","examples":[{"sentence":"The ancient texts warned against the dangers of pseudomancy and its practitioners.","translation":"古代の文献は、偽りの予言術とその実践者の危険性について警告していた。"},{"sentence":"Some historians argue that certain religious practices were simply forms of pseudomancy used to control the masses.","translation":"一部の歴史家は、特定の宗教的慣習が大衆を支配するために用いられた偽りの予言術の一形態に過ぎなかったと主張している。"}],"collocations":["the art of pseudomancy","practice of pseudomancy"],"synonyms":["false divination","fake prophecy","sham divination"],"antonyms":["true divination","genuine prophecy"]}],"etymology":{"value":"Derived from the Greek words 'pseudo-' (meaning false) and '-mancy' (meaning divination or prophecy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdəˈmænsi/","syllables":"pseu-do-man-cy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Pseudomancy' refers to the practice or art of false prophecy or divination. It implies deception and a lack of genuine ability to predict the future. The term is often used in a critical or skeptical context to describe practices that claim to reveal hidden knowledge or predict future events but lack any valid basis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used pseudomancy to heal the sick.","correct":"✓ He used deception to heal the sick. / ✓ He claimed to heal the sick through pseudomancy.","note":"Pseudomancy is about false prophecy, not healing. If someone is falsely claiming to heal, describe it as deception or claim they used pseudomancy to do so."},{"incorrect":"✗ The scientist studied pseudomancy to understand the universe.","correct":"✓ The scientist studied ancient beliefs to understand the universe. / ✓ The scientist debunked pseudomancy.","note":"Scientists study real phenomena or debunk false ones. Studying pseudomancy would be to debunk it or understand its cultural context, not to understand the universe."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudomancer (noun: a practitioner of pseudomancy)"],"phrasal_verbs":null,"related_terms":["divination","prophecy","necromancy","sorcery","magic","fortune-telling","clairvoyance"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudomancy' is a relatively rare and sophisticated term referring to false or deceptive prophecy or divination. It is used to describe practices that claim to predict the future or reveal hidden knowledge but lack any genuine basis or validity. Understanding this term requires familiarity with the concepts of prophecy and divination, as well as the prefix 'pseudo-' which indicates falseness or imitation."},"example_sentences":[{"sentence":"The king consulted oracles, but his advisors suspected pseudomancy was at play.","translation":"王は神託に相談したが、顧問官たちは偽りの予言が行われているのではないかと疑った。","type":"noun","meaning_category":"偽りの予言"},{"sentence":"The rise of scientific thinking led to a decline in the belief in pseudomancy.","translation":"科学的思考の台頭は、偽りの占いへの信仰の衰退につながった。","type":"noun","meaning_category":"偽りの占い"}]}