{"word":"rejectability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"拒否できること、拒否されやすさ、拒絶可能性","english_definition":"The quality or state of being rejectable; the degree to which something is likely to be rejected.","examples":[{"sentence":"The rejectability of the proposal was high due to its unrealistic budget.","translation":"その提案は、非現実的な予算のため、拒否される可能性が高かった。"},{"sentence":"We need to assess the rejectability of our product before launching it in a new market.","translation":"新しい市場で製品を発売する前に、製品が拒否される可能性を評価する必要があります。"},{"sentence":"The rejectability rate of the manufactured parts was reduced by improving the quality control process.","translation":"製造部品の拒否率は、品質管理プロセスを改善することで減少しました。"}],"collocations":["high rejectability (高い拒否可能性)","low rejectability (低い拒否可能性)","assess the rejectability (拒否可能性を評価する)","reduce the rejectability (拒否可能性を減らす)"],"synonyms":["refusability","unacceptability","deniability","declinability"],"antonyms":["acceptability","desirability","attractiveness","suitability"]}],"etymology":{"value":"'Reject' + '-able' + '-ity'. 'Reject' comes from Latin 'reicere' (to throw back). '-able' signifies 'capable of being'. '-ity' is a suffix denoting a state or quality. Thus, 'rejectability' denotes the quality of being capable of being rejected.","priority":"★☆☆"},"pronunciation":{"ipa":"/rɪˌdʒɛktəˈbɪləti/","syllables":"re-ject-a-bil-i-ty"},"inflection":{"noun_plural":"rejectabilities"},"usage_notes":{"explanation":"'Rejectability' is a relatively uncommon noun used to describe how likely something is to be rejected. It is often used in business, marketing, and manufacturing contexts to assess the potential for a product, proposal, or part to be rejected due to flaws, unsuitability, or other factors. It is a more formal and technical term than simply saying something is 'likely to be rejected'.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rejectability of the idea was very rejectable.","correct":"✓ The rejectability of the idea was very high.","note":"Avoid using 'rejectable' and 'rejectability' in the same sentence. Use synonyms like 'high' or 'low' to describe the degree of rejectability."},{"incorrect":"✗ The product had a lot of rejectability.","correct":"✓ The product had a high degree of rejectability. / ✓ The product had a high rejectability.","note":"'Rejectability' is a quality, not a quantity. Use phrases like 'high degree of rejectability' or simply 'high rejectability' rather than 'a lot of rejectability'."}],"priority":"★☆☆"},"related_words":{"derivatives":["reject (verb, noun)","rejectable (adjective)","rejection (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'rejectability' is a formal term used to describe the extent to which something is likely to be rejected. It's often used in business or technical contexts when evaluating proposals, products, or ideas. The word combines 'reject,' meaning to refuse to accept, with the suffix '-ability,' indicating the capacity or potential to be rejected. Understanding the likelihood of rejection can be important for making strategic decisions. "},"example_sentences":[{"sentence":"The high rejectability of the initial design led to a complete overhaul.","translation":"初期デザインの拒否可能性が高かったため、完全な見直しが行われました。","type":"noun","meaning_category":"拒否されやすさ"},{"sentence":"The company focused on reducing the rejectability of their products through rigorous testing.","translation":"その会社は、厳格なテストを通じて製品の拒否可能性を減らすことに注力しました。","type":"noun","meaning_category":"拒否されやすさ"},{"sentence":"The study aimed to quantify the rejectability of different marketing strategies.","translation":"その研究は、さまざまなマーケティング戦略の拒否可能性を定量化することを目的としていました。","type":"noun","meaning_category":"拒否されやすさ"}]}