{"word":"Zeculon","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"A fictional planet or location, often used in science fiction or fantasy contexts.","english_definition":"A made-up name for a planet or place, often found in stories about space or imaginary worlds.","examples":[{"sentence":"The spaceship landed on the dusty plains of Zeculon.","translation":"宇宙船はゼキュロンの埃っぽい平原に着陸した。"},{"sentence":"Zeculon is known for its strange flora and fauna.","translation":"ゼキュロンは奇妙な動植物で知られている。"}],"collocations":["planet Zeculon","the people of Zeculon","the Zeculonian Empire"],"synonyms":["fictional planet","imaginary world","fantasy location"],"antonyms":[]}],"etymology":{"value":"Likely a constructed name, possibly inspired by other science fiction names or sounds. There is no known historical origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈzɛkjʊlɒn/","syllables":"Ze-cu-lon"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"'Zeculon' is almost always used as a proper noun, referring to a specific, though fictional, place. It is not a common word and would only be encountered in the context of the work of fiction in which it appears.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The zeculon is very far from Earth.","correct":"✓ Zeculon is very far from Earth.","note":"'Zeculon' is a proper noun and should be capitalized."}],"priority":"★☆☆"},"related_words":{"derivatives":["Zeculonian (adjective: relating to Zeculon; noun: a person from Zeculon)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a real word)","frequency_google_ngram":"Very low frequency (as it's a fictional name)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Zeculon' is not a real word and would only be encountered in science fiction or fantasy literature. Understanding the word requires familiarity with the conventions of world-building in these genres. It is generally used to refer to a fictional planet or location. The reader would need to infer its meaning from the context of the story.","priority":"★☆☆"},"example_sentences":[{"sentence":"The brave explorers set off for the distant planet of Zeculon.","translation":"勇敢な探検家たちは、遠い惑星ゼキュロンに向けて出発した。","type":"proper noun","meaning_category":"fictional planet"},{"sentence":"The Zeculonian ambassador arrived to negotiate a peace treaty.","translation":"ゼキュロンの大使が平和条約の交渉のために到着した。","type":"proper noun (in derivative form)","meaning_category":"related to Zeculon"}]}