{"word":"sustainment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"維持、持続、維持すること、支えること、支援、兵站","english_definition":"the act or state of sustaining; the provision of support, maintenance, and resources to keep something in operation or existence.","examples":[{"sentence":"The sustainment of peace requires constant effort.","translation":"平和の維持には絶え間ない努力が必要です。"},{"sentence":"The project's success depends on long-term sustainment.","translation":"プロジェクトの成功は長期的な維持にかかっています。"},{"sentence":"Logistics and sustainment are crucial for military operations.","translation":"兵站と維持は軍事作戦にとって非常に重要です。"},{"sentence":"The sustainment of the ecosystem is vital for future generations.","translation":"生態系の維持は将来の世代にとって不可欠です。"}],"collocations":["long-term sustainment (長期的な維持)","environmental sustainment (環境維持)","military sustainment (軍事的な維持)","economic sustainment (経済的な維持)","operational sustainment (作戦上の維持)","logistics and sustainment (兵站と維持)","sustainment activities (維持活動)","sustainment costs (維持費)"],"synonyms":["maintenance","preservation","support","upkeep","conservation","endurance","continuation","prolongation","nourishment","subsistence"],"antonyms":["destruction","termination","depletion","cessation","disruption","failure","collapse","neglect"]},{"part_of_speech":"noun","definition":"(軍事) 兵站支援、補給、整備、維持管理","english_definition":"(military) the provision of personnel, supplies, and equipment to maintain or prolong the combat effectiveness of forces.","examples":[{"sentence":"Effective sustainment is key to winning battles.","translation":"効果的な兵站支援は戦闘に勝利するための鍵です。"},{"sentence":"The sustainment plan ensures that troops have everything they need.","translation":"維持計画により、部隊は必要なものをすべて確実に手に入れることができます。"},{"sentence":"Sustainment operations include transportation, supply, and maintenance.","translation":"維持作戦には、輸送、補給、および整備が含まれます。"},{"sentence":"The sustainment brigade is responsible for providing logistical support.","translation":"維持旅団は兵站支援を提供する責任があります。"}],"collocations":["sustainment brigade (維持旅団)","sustainment plan (維持計画)","sustainment operations (維持作戦)","logistical sustainment (兵站支援)","combat sustainment (戦闘維持)","field sustainment (野戦維持)","strategic sustainment (戦略的維持)"],"synonyms":["logistics","supply","maintenance","support","resupply","provisioning","servicing","upkeep"],"antonyms":["attrition","depletion","exhaustion","starvation","abandonment"]}],"etymology":{"value":"The word \"sustainment\" is derived from the verb \"sustain,\" which comes from the Old French \"sostenir\" and the Latin \"sustinere,\" meaning \"to hold up, support, maintain.\" The suffix \"-ment\" is added to form a noun indicating the act, process, or result of sustaining.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈsteɪnmənt/","syllables":"sus-tain-ment"},"inflection":{"noun_plural":"sustainments (rare, usually used as a mass noun)"},"usage_notes":{"explanation":"\"Sustainment\" refers to the act of keeping something going, whether it's a project, a military operation, an ecosystem, or even peace. It encompasses the resources, support, and maintenance required to ensure its continuation. In a military context, it specifically refers to the logistical support necessary to maintain combat effectiveness. The word often implies a long-term perspective and a proactive approach to ensuring stability and functionality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We need to sustain the project with more money.","correct":"✓ We need to ensure the sustainment of the project with more money. / ✓ We need to sustain the project by providing more money.","note":"While \"sustain\" is a verb, \"sustainment\" is a noun. It's more appropriate to use \"ensure the sustainment of\" or rephrase the sentence to use the verb \"sustain.\""},{"incorrect":"✗ The sustainment is very important for the environment.","correct":"✓ Sustainment is very important for the environment. / ✓ Environmental sustainment is very important.","note":"The article \"the\" is generally not used before \"sustainment\" when referring to the general concept. If referring to a specific type or instance of sustainment, it may be appropriate to use \"the.\" Alternatively, use the adjective form: \"environmental sustainment.\""}],"priority":"★★☆"},"related_words":{"derivatives":["sustain (verb)","sustainable (adjective)","sustainability (noun)","sustaining (adjective)"],"idioms_phrases":["life sustainment (生命維持)","mission sustainment (任務維持)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical, military, and environmental contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Sustainment\" is a relatively formal and specialized term that refers to the act or process of maintaining something over a long period. It often implies providing the necessary resources, support, and maintenance to keep something functioning or in existence. The word is frequently used in military, environmental, and project management contexts. Understanding this word requires a grasp of abstract concepts and the ability to recognize its specific applications within different fields."},"example_sentences":[{"sentence":"The **sustainment** of the program requires ongoing funding and support.","translation":"プログラムの維持には、継続的な資金と支援が必要です。","type":"noun","meaning_category":"維持"},{"sentence":"The military relies on effective **sustainment** to maintain its operational readiness.","translation":"軍隊は、作戦遂行能力を維持するために、効果的な兵站支援に依存しています。","type":"noun","meaning_category":"兵站支援"},{"sentence":"Environmental **sustainment** is crucial for protecting our planet's resources.","translation":"環境維持は、地球の資源を保護するために非常に重要です。","type":"noun","meaning_category":"維持"},{"sentence":"The **sustainment** plan outlines the resources needed to keep the project running smoothly.","translation":"維持計画は、プロジェクトを円滑に進めるために必要な資源の概要を示しています。","type":"noun","meaning_category":"維持計画"},{"sentence":"The **sustainment** costs for the aging infrastructure are becoming increasingly burdensome.","translation":"老朽化したインフラの維持費はますます負担になっています。","type":"noun","meaning_category":"維持費"}]}