{"word":"Rodingite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A metamorphic rock formed by metasomatism of mafic or ultramafic rocks in a calcium-rich environment.","english_definition":"A metamorphic rock formed by metasomatism of mafic or ultramafic rocks in a calcium-rich environment.","examples":[{"sentence":"The rodingite was found in association with serpentinite.","translation":"そのローディング岩は蛇紋岩に伴って発見された。"},{"sentence":"Rodingites are often associated with skarns and other calcium-rich metamorphic rocks.","translation":"ローディング岩はしばしばスカルンや他のカルシウムに富む変成岩と関連している。"}],"collocations":["rodingite dyke","rodingite alteration","calcium metasomatism of rodingite"],"synonyms":["metarodingite"],"antonyms":[]}],"etymology":{"value":"Named after the Roding River in New Zealand, where it was first described.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒdɪŋˌɡaɪt/","syllables":"Rod-ing-ite"},"inflection":{"noun_plural":"Rodingites"},"usage_notes":{"explanation":"Rodingites are characterized by their high calcium content and are often found in association with serpentinites and other altered ultramafic rocks. They are formed by metasomatic processes, where fluids rich in calcium and other elements alter the original rock composition.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["rodingitization"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Rodingite is a technical term used in geology and petrology to describe a specific type of metamorphic rock. Understanding the term requires knowledge of metamorphic processes, metasomatism, and the composition of mafic and ultramafic rocks. The term is primarily used in academic and research contexts within the field of geology."},"example_sentences":[{"sentence":"The mineral composition of the rodingite indicates a high degree of calcium metasomatism.","translation":"そのローディング岩の鉱物組成は、高度なカルシウムメタソマティズムを示している。","type":"noun","meaning_category":"metamorphic rock"},{"sentence":"Rodingite dikes crosscut the serpentinite body in several locations.","translation":"ローディング岩脈は、いくつかの場所で蛇紋岩体を横切っている。","type":"noun","meaning_category":"metamorphic rock"}]}