{"word":"annexationist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"併合主義者、領土拡張主義者","english_definition":"A person who advocates or supports annexation, especially of territory.","examples":[{"sentence":"The annexationists were eager to expand the nation's borders.","translation":"併合主義者たちは、国の国境を拡大することに熱心だった。"},{"sentence":"He was known as an annexationist due to his strong belief in acquiring new territories.","translation":"彼は新しい領土を獲得するという強い信念を持っていたため、併合主義者として知られていた。"}],"collocations":["become an annexationist","oppose annexationists","a strong annexationist"],"synonyms":["expansionist","imperialist","territorialist"],"antonyms":["anti-expansionist","isolationist"]},{"part_of_speech":"adjective","definition":"併合主義の、領土拡張主義の","english_definition":"Advocating or supporting annexation, especially of territory.","examples":[{"sentence":"The annexationist policies of the government led to international condemnation.","translation":"政府の併合主義的な政策は、国際的な非難を招いた。"},{"sentence":"The newspaper published an annexationist editorial, calling for the incorporation of the neighboring region.","translation":"その新聞は、隣接地域の編入を求める併合主義的な社説を掲載した。"}],"collocations":["annexationist policy","annexationist sentiment","annexationist agenda"],"synonyms":["expansionary","imperialistic","territorial"],"antonyms":["anti-expansionist","isolationist"]}],"etymology":{"value":"The word is derived from \"annexation\" (the act of annexing), which comes from the Latin \"annexus,\" the past participle of \"annectere\" (to bind to). The suffix \"-ist\" indicates a person who supports or believes in something.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌnekˈseɪʃənɪst/","syllables":"an-nex-a-tion-ist"},"inflection":{"noun_plural":"annexationists"},"usage_notes":{"explanation":"The term \"annexationist\" is often used in political and historical contexts to describe individuals or groups who actively promote the expansion of a country's territory through annexation. It carries a negative connotation, especially when associated with aggressive or unjust territorial acquisitions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a annexationist for peace.","correct":"✓ He is an annexationist.","note":"The term \"annexationist\" inherently implies a desire for territorial expansion, which is often associated with conflict rather than peace. Therefore, the phrase \"annexationist for peace\" is contradictory."},{"incorrect":"✗ Annexationist is good.","correct":"✓ Annexationism is good.","note":"\"Annexationist\" is a person. \"Annexationism\" is the belief or policy."}],"priority":"★★☆"},"related_words":{"derivatives":["annexation","annex","annexationism"],"related_concepts":["imperialism","colonialism","expansionism","territorialism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"annexationist\" is a relatively complex term used in political science and history. It refers to someone who supports the act of annexing territory, which means incorporating it into an existing political entity, typically a country. This term often appears in discussions about international relations, historical territorial disputes, and political ideologies related to expansionism and imperialism. Understanding this word requires a grasp of related concepts such as sovereignty, territorial integrity, and international law."},"example_sentences":[{"sentence":"The annexationist movement gained momentum in the late 19th century.","translation":"併合主義運動は19世紀後半に勢いを増した。","type":"noun","meaning_category":"supporter of annexation"},{"sentence":"The government's annexationist rhetoric sparked outrage from neighboring countries.","translation":"政府の併合主義的なレトリックは、近隣諸国からの怒りを引き起こした。","type":"adjective","meaning_category":"supporting annexation"}]}