{"word":"Synaxar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聖人伝、聖人暦","english_definition":"A collection of hagiographies arranged according to the liturgical year; a calendar of saints.","examples":[{"sentence":"The Synaxar provides accounts of the lives and martyrdoms of the saints.","translation":"シナクサルは、聖人たちの生涯と殉教の物語を提供します。"}],"collocations":["read the Synaxar","consult the Synaxar"],"synonyms":["hagiography","menologion"],"antonyms":[]}],"etymology":{"value":"From Byzantine Greek συναξάριον (synaxárion), from σύναξις (synaxis, \"assembly, gathering\"), referring to the liturgical assembly where the lives of the saints were read.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈnæksɑːr/","syllables":"Sy-nax-ar"},"inflection":{"noun_plural":"Synaxars"},"usage_notes":{"explanation":"The Synaxar is primarily used in the Eastern Orthodox and Eastern Catholic churches. It is similar to the Roman Catholic Martyrology, but typically contains more detailed accounts of the saints' lives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read the synaxar for entertainment.","correct":"✓ I read the Synaxar for liturgical study.","note":"The Synaxar is typically used for religious or historical study, not casual entertainment."}],"priority":"★☆☆"},"related_words":{"derivatives":["synaxis"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Synaxar' is a specialized term primarily used within the context of Eastern Orthodox and Eastern Catholic liturgical traditions. Understanding its meaning requires familiarity with these religious contexts and a vocabulary related to hagiography and liturgical calendars. The word is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The monk spent hours each day reading from the Synaxar.","translation":"その修道士は毎日何時間もシナクサルを読んで過ごした。","type":"noun","meaning_category":"聖人伝"},{"sentence":"The Synaxar is an important source for understanding the history of the early Church.","translation":"シナクサルは初期教会の歴史を理解するための重要な資料です。","type":"noun","meaning_category":"聖人伝"}]}