{"word":"Encystments","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or process of becoming enclosed in a cyst; the cysts themselves.","english_definition":"Plural form of encystment: The process by which an organism becomes enclosed in a cyst; the state of being encysted; the cysts formed.","examples":[{"sentence":"The encystments of the parasite allow it to survive harsh conditions.","translation":"寄生虫の被包嚢化によって、それは過酷な環境を生き残ることができる。"},{"sentence":"Studies have focused on the factors triggering encystments in various protozoa.","translation":"研究は、様々な原生動物における被包嚢化を引き起こす要因に焦点を当ててきた。"}],"collocations":["trigger encystments","observe encystments","study encystments","environmental encystments"],"synonyms":["encystation","cyst formation","encapsulation"],"antonyms":["excystation","decystation"]}],"etymology":{"value":"From 'encyst' (to enclose in a cyst) + '-ment' (a suffix denoting a condition or process) + '-s' (plural suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈsɪstmənts/","syllables":"en-cyst-ments"},"inflection":{"noun_plural":"encystments"},"usage_notes":{"explanation":"'Encystments' refers to multiple instances or examples of the process of encystment, or to multiple cysts themselves. It is primarily used in biological and medical contexts when discussing organisms (such as bacteria, protozoa, or parasites) that form cysts as a survival strategy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The encystment are visible under the microscope.","correct":"✓ The encystments are visible under the microscope.","note":"Since 'encystments' is plural, the plural form of the verb 'to be' (i.e., 'are') should be used."},{"incorrect":"✗ The encystments is a survival mechanism.","correct":"✓ Encystment is a survival mechanism.","note":"If referring to the process in general, use the singular form 'encystment'."}],"priority":"★★☆"},"related_words":{"derivatives":["encyst (verb): to enclose in a cyst","encysted (adjective): enclosed in a cyst","encystment (noun singular): the process of becoming enclosed in a cyst"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Encystments' is a technical term primarily used in biology and medicine. It refers to multiple instances of the process by which an organism encloses itself in a protective cyst, or to the cysts themselves. Understanding this term requires familiarity with biological processes and terminology related to microorganisms and parasites."},"example_sentences":[{"sentence":"The researchers observed numerous encystments in the water sample.","translation":"研究者らは、その水サンプル中で多数の被包嚢化を観察した。","type":"noun","meaning_category":"cysts formed"},{"sentence":"The study investigated the environmental factors that influence the encystments of the algae.","translation":"その研究は、藻類の被包嚢化に影響を与える環境要因を調査した。","type":"noun","meaning_category":"process of becoming enclosed in a cyst"}]}