{"word":"protosinner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The first sinner; Adam or Eve.","english_definition":"The first person to sin; usually referring to Adam or Eve.","examples":[{"sentence":"Adam and Eve are considered the protosinners in Christian theology.","translation":"アダムとイブはキリスト教神学において最初の罪人とみなされています。"},{"sentence":"The story of the protosinner is a cautionary tale about disobedience.","translation":"最初の罪人の物語は、不服従についての戒めの物語です。"}],"collocations":["original sin","fall of man","Adam and Eve","Garden of Eden"],"synonyms":["first sinner","original transgressor"],"antonyms":["sinless","redeemed"]}],"etymology":{"value":"From 'proto-' (meaning 'first') + 'sinner'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtoʊˈsɪnər/","syllables":"pro-to-sin-ner"},"inflection":{"noun_plural":"protosinners"},"usage_notes":{"explanation":"This term is primarily used in theological or religious contexts, specifically when discussing the concept of original sin or the story of Adam and Eve. It's not a common word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a protosinner because he made a mistake.","correct":"✓ Adam is considered the protosinner because he disobeyed God's command.","note":"'Protosinner' specifically refers to the first person to commit a sin, not just anyone who makes a mistake."}],"priority":"★★☆"},"related_words":{"derivatives":["protosins"],"related_terms":["original sin","the Fall","transgression","sin","Adam","Eve"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily theological or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'protosinner' is a specialized theological term, primarily used in discussions of original sin and the story of Adam and Eve. It is not commonly used in general conversation and requires a strong understanding of religious concepts to fully grasp its meaning."},"example_sentences":[{"sentence":"The concept of the protosinner is central to understanding the doctrine of original sin.","translation":"最初の罪人の概念は、原罪の教義を理解する上で中心となります。","type":"noun","meaning_category":"first sinner"},{"sentence":"Many theologians debate the implications of the protosinner's actions for humanity.","translation":"多くの神学者は、人類に対する最初の罪人の行動の影響について議論しています。","type":"noun","meaning_category":"first sinner"}]}