{"word":"menoridade","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"未成年、未成年であること","english_definition":"minority; the state of being a minor; the period of legal minority","examples":[{"sentence":"Atingiu a maioridade após anos de menoridade.","translation":"He reached adulthood after years of minority.","note":"He became an adult after being a minor for many years."},{"sentence":"Durante a sua menoridade, foi tutelado pelo tio.","translation":"During his minority, he was tutored by his uncle.","note":"While he was a minor, his uncle was his guardian."}],"collocations":["entrar na menoridade (to become a minor)","sair da menoridade (to leave minority)","atingir a maioridade (to reach adulthood)"],"synonyms":["infância","juventude","adolescência"],"antonyms":["maioridade"]}],"etymology":{"value":"From the Latin 'minoritas', meaning 'smaller number' or 'inferiority'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/me.no.ɾiˈda.dʒi/","syllables":"me-no-ri-da-de"},"inflection":{"noun_plural":"menoridades"},"usage_notes":{"explanation":"'Menoridade' refers to the state of being a minor, someone who has not reached the legal age of adulthood. It is often used in legal and formal contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"Ele está em menoridade.","correct":"Ele é menor de idade.","note":"While 'menoridade' refers to the state of being a minor, to say someone *is* a minor, it's more common to say 'Ele é menor de idade' (He is under the age of majority)."}],"priority":"☆☆☆"},"related_words":{"derivatives":["menor (minor)","menor de idade (underage)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Menoridade' is a formal term referring to the state of being a minor, i.e., not having reached the legal age of adulthood. It's commonly used in legal or formal contexts when discussing the rights and responsibilities of individuals who are not yet adults. Understanding this term is important for comprehending legal documents and formal discussions about youth and age.","example_sentences":[{"sentence":"A lei protege os direitos das crianças durante a sua menoridade.","translation":"The law protects the rights of children during their minority.","type":"general","meaning_category":"legal context"},{"sentence":"A representação legal é necessária durante o período de menoridade.","translation":"Legal representation is necessary during the period of minority.","type":"general","meaning_category":"legal context"}]}}