{"word":"Optionees","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) オプション権者、選択権を持つ人々","english_definition":"(plural) Individuals who have been granted an option, especially a stock option.","examples":[{"sentence":"The optionees will benefit if the stock price increases.","translation":"株価が上昇すれば、オプション権者たちは利益を得るだろう。"},{"sentence":"The company granted stock options to its employees, making them optionees.","translation":"会社は従業員にストックオプションを付与し、彼らをオプション権者にした。"}],"collocations":["stock optionees (ストックオプション権者)","employee optionees (従業員オプション権者)","grant options to optionees (オプション権者にオプションを付与する)"],"synonyms":["option holders","beneficiaries","grantees"],"antonyms":[]}],"etymology":{"value":"Derived from 'optionee,' which is formed by adding the suffix '-ee' (denoting the recipient of an action) to 'option.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒpʃəˈniːz/","syllables":"op-tion-ees"},"inflection":{"noun_plural":"Optionees"},"usage_notes":{"explanation":"'Optionees' specifically refers to the individuals or entities that have been granted an option, giving them the right, but not the obligation, to buy or sell something (typically stock) at a predetermined price within a specific timeframe. This term is most commonly used in the context of employee stock option plans.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The optionees is happy about the stock price increase.","correct":"✓ The optionees are happy about the stock price increase.","note":"'Optionees' is a plural noun, so it requires a plural verb ('are')."},{"incorrect":"✗ The company gave optionee stock.","correct":"✓ The company gave optionees stock options.","note":"'Optionees' refers to the people who receive the options, not the options themselves. Use 'stock options' to refer to the options."}],"priority":"★★☆"},"related_words":{"derivatives":["option (名詞: 選択肢、オプション)","optionee (名詞: オプション権者)","optionor (名詞: オプション付与者)","stock option (名詞: ストックオプション)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Business/Finance context)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Optionees' is a specialized term primarily used in business and finance, specifically in the context of stock options. It refers to the people who have been granted the right to purchase shares of a company's stock at a predetermined price. Understanding this term requires familiarity with financial concepts like stock options and employee compensation packages. It's not a word commonly encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The board of directors approved the allocation of stock options to the new optionees.","translation":"取締役会は、新しいオプション権者へのストックオプションの割り当てを承認した。","type":"noun","meaning_category":"オプション権者"},{"sentence":"Many optionees exercised their options when the company went public.","translation":"多くのオプション権者が、会社が株式公開した際にオプションを行使した。","type":"noun","meaning_category":"オプション権者"},{"sentence":"The company communicated the details of the stock option plan to all potential optionees.","translation":"会社は、ストックオプションプランの詳細を、すべての潜在的なオプション権者に伝えた。","type":"noun","meaning_category":"オプション権者"}]}