{"word":"nepotic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"縁故びいきの、親族を優遇する","english_definition":"characterized by nepotism; favoring relatives or friends, especially by giving them jobs.","examples":[{"sentence":"The company was criticized for its nepotic hiring practices.","translation":"その会社は縁故採用の慣行で批判された。"},{"sentence":"He accused the government of being nepotic.","translation":"彼は政府が縁故主義だと非難した。"},{"sentence":"The manager's nepotic tendencies were obvious to everyone.","translation":"そのマネージャーの縁故びいきの傾向は誰の目にも明らかだった。"}],"collocations":["nepotic practices","nepotic hiring","nepotic appointments","nepotic tendencies"],"synonyms":["favoritism","partiality","biased","preferential"],"antonyms":["fair","impartial","equitable","objective","meritocratic"]}],"etymology":{"value":"Derived from \"nepotism,\" which comes from the Italian word \"nepotismo,\" ultimately from the Latin \"nepos\" meaning \"nephew.\" This refers to the historical practice of popes and other high-ranking clergy appointing their nephews (or other relatives) to positions of power and influence.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈpɒtɪk/","syllables":"ne-pot-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The adjective \"nepotic\" describes something characterized by or related to nepotism. Nepotism is the practice of showing favoritism to relatives or close friends, especially in business or politics, by giving them jobs or other advantages.  It generally carries a negative connotation, suggesting unfairness and a lack of meritocracy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very nepotic to his work.","correct":"✓ He was very nepotic in his hiring practices.","note":"Nepotic describes the manner of behavior or a system, not a feeling or relationship to work itself. It is better to say 'He was very nepotic in his hiring practices.'"},{"incorrect":"✗ The company's nepotic.","correct":"✓ The company's hiring practices are nepotic.","note":"It's more precise to say what aspect of the company is nepotic (e.g., hiring practices, appointments)."}],"priority":"★☆☆"},"related_words":{"derivatives":["nepotism (noun): the practice among those with power or influence of favoring relatives or friends, especially by giving them jobs.","nepotist (noun): a person who practices nepotism."],"related_concepts":["cronyism (favoritism towards friends)","patronage (support or encouragement of a person or activity)","conflict of interest (a situation in which someone's personal interests could compromise their judgment)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nepotic\" is used to describe situations or behaviors that show favoritism towards relatives, especially in giving them jobs or positions of power. It is a relatively uncommon word, but it is useful for discussing issues of fairness and meritocracy in organizations and governments. The related word \"nepotism\" is more commonly used."},"example_sentences":[{"sentence":"The newspaper exposed the mayor's nepotic appointments to city boards.","translation":"その新聞は市長が市の委員会に縁故者を任命したことを暴露した。","type":"adjective","meaning_category":"縁故びいきの"},{"sentence":"The small business owner defended his decision to hire his daughter, arguing that it wasn't a nepotic act but a matter of trust.","translation":"その中小企業のオーナーは、娘を雇ったのは縁故採用ではなく信頼の問題だと主張し、自身の決定を擁護した。","type":"adjective","meaning_category":"縁故びいきの"},{"sentence":"The university implemented new policies to prevent nepotic practices in faculty hiring.","translation":"その大学は教員の採用における縁故主義を防ぐために新しい方針を実施した。","type":"adjective","meaning_category":"縁故びいきの"}]}