{"word":"non-coagulable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"凝固しない、凝固性のない","english_definition":"Not capable of being coagulated; unable to clot or solidify.","examples":[{"sentence":"The patient's blood was found to be non-coagulable due to a rare medical condition.","translation":"患者の血液は、まれな病状のために凝固しないことが判明した。"},{"sentence":"Certain substances can render a protein solution non-coagulable.","translation":"特定の物質は、タンパク質溶液を凝固しないようにすることができる。"}],"collocations":["non-coagulable blood","non-coagulable protein"],"synonyms":["unclottable"],"antonyms":["coagulable"],"related_terms":["coagulation","coagulate","anticoagulant"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'coagulable' (capable of being coagulated).","priority":"medium"},"pronunciation":{"ipa":"/ˌnɒn.koʊˈæɡ.jʊ.lə.bəl/","syllables":"non-co-ag-u-la-ble"},"inflection":{"notes":"Adjectives do not inflect in English, other than to form comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"'Non-coagulable' is a technical term primarily used in medical and scientific contexts, particularly in hematology (the study of blood) and biochemistry. It describes a substance, most commonly blood or a protein solution, that does not have the ability to form a clot or solidify under normal conditions. This condition can be caused by various factors, including genetic disorders, certain medications, or the presence of anticoagulants.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The soup is non-coagulable.","correct":"The soup did not coagulate.","note":"'Non-coagulable' is typically used in a scientific or medical context, not for everyday foods like soup. A more common way to describe soup that doesn't thicken is to say it 'did not coagulate' or 'did not thicken'."}],"priority":"low"},"related_words":{"derivatives":["noncoagulability (noun)"],"related_terms":["coagulopathy (noun)","hemophilia (noun)","thrombosis (noun)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'non-coagulable' is a highly specialized term primarily used in medical and scientific fields. Understanding it requires a background in biology, chemistry, or medicine, specifically knowledge of coagulation processes. The term is rarely encountered in general conversation or writing."},"example_sentences":[{"sentence":"The venom of some snakes contains anticoagulants that render the victim's blood non-coagulable.","translation":"一部のヘビの毒には抗凝固剤が含まれており、被害者の血液を凝固しないようにする。","type":"technical","meaning_category":"medical"},{"sentence":"Researchers are studying the mechanisms that cause certain proteins to become non-coagulable at high temperatures.","translation":"研究者たちは、特定のタンパク質が高温で凝固しなくなるメカニズムを研究している。","type":"scientific","meaning_category":"biochemistry"}]}