{"word":"isobarism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同重体異性（核）現象","english_definition":"The phenomenon of different nuclides having the same mass number (total number of nucleons, i.e., protons and neutrons).","examples":[{"sentence":"Isobarism is a common occurrence among radioactive isotopes.","translation":"同重体異性現象は、放射性同位体間ではよく見られる現象です。"},{"sentence":"The study of isobarism helps in understanding nuclear stability.","translation":"同重体異性現象の研究は、原子核の安定性を理解するのに役立ちます。"}],"collocations":["nuclear isobarism","isobaric decay","isobaric chain"],"synonyms":["isobaric state","isobaric transition"],"antonyms":[]}],"etymology":{"value":"Derived from 'isobar' (a line on a map connecting points having the same atmospheric pressure), with the suffix '-ism' indicating a state or condition. 'Iso-' comes from the Greek 'isos' meaning 'equal,' and 'baros' means 'weight' or 'pressure.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsoʊˈbærɪzəm/","syllables":"i-so-bar-ism"},"inflection":{"noun_plural":"isobarisms"},"usage_notes":{"explanation":"'Isobarism' is primarily used in the context of nuclear physics and chemistry to describe nuclides (atomic nuclei) that have the same mass number but different atomic numbers (number of protons). It's important to distinguish isobarism from isotopy (same number of protons, different number of neutrons) and isomerism (same number of protons and neutrons, different energy states).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Isobarism refers to atoms with the same number of protons.","correct":"✓ Isobarism refers to nuclides with the same mass number.","note":"Isobarism is about the same mass number (protons + neutrons), not just the number of protons."},{"incorrect":"✗ Isobarism is the same as isotopy.","correct":"✓ Isobarism is different from isotopy; isotopy refers to atoms with the same number of protons but different numbers of neutrons.","note":"Isobarism and isotopy are distinct concepts in nuclear chemistry."}],"priority":"★★☆"},"related_words":{"derivatives":["isobaric (adjective)","isobar (noun)"],"related_terms":["isotope","isomer","nuclide","nucleon","mass number","atomic number"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized term used in nuclear physics and chemistry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isobarism' is a technical term used in nuclear physics and chemistry. It refers to the condition where different atomic nuclei (nuclides) have the same mass number, which is the total number of protons and neutrons in the nucleus. Understanding this term requires a background in basic atomic structure and nuclear properties. It's important to differentiate it from other related terms like 'isotope' and 'isomer.'"},"example_sentences":[{"sentence":"The isobarism between potassium-40 and calcium-40 is important in radiometric dating.","translation":"カリウム40とカルシウム40の同重体異性現象は、放射年代測定において重要です。","type":"scientific","meaning_category":"nuclear physics"},{"sentence":"Isobarism can lead to complications in mass spectrometry analysis.","translation":"同重体異性現象は、質量分析分析において複雑さを引き起こす可能性があります。","type":"scientific","meaning_category":"analytical chemistry"}]}