{"word":"Anabaptism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再洗礼派","english_definition":"A Protestant movement of the 16th century that advocated the baptism and church membership of adult believers only, nonresistance, and the separation of church and state.","examples":[{"sentence":"Anabaptism emerged during the Reformation in Europe.","translation":"再洗礼派はヨーロッパの宗教改革の間に現れた。"},{"sentence":"Some modern-day Mennonites and Amish trace their origins to Anabaptism.","translation":"現代のメノナイトやアーミッシュの中には、その起源を再洗礼派に遡る人々もいる。"}],"collocations":["radical Anabaptism","early Anabaptism","Swiss Anabaptism"],"synonyms":["Radical Reformation","Swiss Brethren"],"antonyms":[]}],"etymology":{"value":"From Greek ἀνα- (ana-, \"again\") + βαπτίζω (baptízō, \"I baptize\"). Literally meaning \"rebaptizer\".","priority":"★★★"},"pronunciation":{"ipa":"/əˈnæbˌtɪzəm/","syllables":"A-na-bap-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Anabaptism is a significant movement in Christian history, known for its radical approach to Reformation principles. Key tenets include adult baptism (believer's baptism), separation of church and state, pacifism, and a communal lifestyle. The term 'Anabaptist' was originally used pejoratively by opponents, as they considered the practice of re-baptizing adults to be heretical since infant baptism was already performed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anabaptism is a Catholic belief.","correct":"✓ Anabaptism is a Protestant belief.","note":"Anabaptism emerged as a radical movement within the Protestant Reformation, not within Catholicism."},{"incorrect":"✗ Anabaptists believe in infant baptism.","correct":"✓ Anabaptists believe in adult baptism.","note":"A core tenet of Anabaptism is believer's baptism, which is the baptism of adults or those who can profess their faith."}],"priority":"★★☆"},"related_words":{"derivatives":["Anabaptist (noun, adjective)","Anabaptistic (adjective)"],"phrasal_verbs":[],"related_movements":["Mennonites","Amish","Hutterites"],"key_figures":["Menno Simons","Felix Manz","Conrad Grebel"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily used in historical or religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anabaptism' refers to a 16th-century Protestant movement that believed only adults who could consciously profess their faith should be baptized. They also advocated for separation of church and state and nonviolence. It's a term mainly used in historical or religious discussions, so it's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The principles of Anabaptism influenced later movements advocating for religious freedom.","translation":"再洗礼派の原則は、後の宗教的自由を提唱する運動に影響を与えた。","type":"noun","meaning_category":"Religious Movement"},{"sentence":"Early Anabaptists faced persecution for their beliefs in adult baptism and separation from mainstream society.","translation":"初期の再洗礼派は、成人洗礼と主流社会からの分離という信念のために迫害に直面した。","type":"noun","meaning_category":"Historical Context"}]}