{"word":"Catholicophobe","priority":"low","meanings":[{"part_of_speech":"noun","definition":"カトリック嫌悪者、カトリック恐怖症の人","english_definition":"A person who has a phobia of or hatred towards Catholics or Catholicism.","examples":[{"sentence":"He was labeled a Catholicophobe after making disparaging remarks about the Church.","translation":"彼は教会について軽蔑的な発言をした後、カトリック嫌悪者というレッテルを貼られた。"},{"sentence":"The article discusses the rise of Catholicophobes in certain political circles.","translation":"その記事は、特定の政界におけるカトリック嫌悪者の増加について論じている。"}],"collocations":["anti-Catholic","bigot","religious intolerance"],"synonyms":["anti-Catholic","bigot","religious hater"],"antonyms":["Catholicophile","Catholic","tolerant"],"related_words":["Catholicophobia (カトリック恐怖症)","Catholic (カトリック教徒)","Catholicism (カトリック教)"]}],"etymology":{"value":"Formed from \"Catholic\" and \"-phobe\", indicating a fear or hatred of Catholics.","priority":"medium"},"pronunciation":{"ipa":"/kəˈθɒlɪkəfoʊb/","syllables":"ca-thol-i-co-phobe"},"inflection":{"noun_plural":"Catholicophobes"},"usage_notes":{"explanation":"This term is used to describe someone who exhibits prejudice, hatred, or fear towards Catholics or the Catholic Church. It's often used in discussions about religious intolerance and discrimination.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He is a Catholicophobe, so he is afraid of churches in general.","correct":"He is a Catholicophobe, so he is afraid of Catholic churches and people.","note":"Catholicophobe specifically refers to fear or hatred of Catholics and Catholicism, not churches in general."}],"priority":"low"},"level_frequency":{"frequency_google_ngram":"low","priority":"low"},"readability_explanation":{"level":"C2","text":"The word 'Catholicophobe' is a relatively rare and complex term, used to describe someone who has a phobia or hatred towards Catholics or Catholicism. Understanding the word requires familiarity with the term 'phobia' and the religious context of Catholicism. It is typically encountered in discussions about religious discrimination and prejudice."},"example_sentences":[{"sentence":"The speaker was accused of being a Catholicophobe due to his controversial statements.","translation":"その講演者は、物議を醸す発言のためにカトリック嫌悪者だと非難された。","type":"noun","meaning_category":"カトリック嫌悪者"},{"sentence":"Some argue that criticism of the Catholic Church is not necessarily evidence of being a Catholicophobe.","translation":"カトリック教会への批判は必ずしもカトリック嫌悪者である証拠ではないと主張する人もいる。","type":"noun","meaning_category":"カトリック嫌悪者"}]}