{"word":"capillarities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"毛管現象 (複数形)","english_definition":"plural of capillarity: phenomena associated with surface tension and intermolecular forces that cause liquids to rise in narrow tubes or to be drawn into small openings.","examples":[{"sentence":"The capillarities observed in the soil samples varied depending on the composition.","translation":"土壌サンプルで観察された毛管現象は、組成によって異なっていた。"},{"sentence":"Understanding capillarities is crucial in many engineering applications.","translation":"毛管現象を理解することは、多くの工学応用において重要である。"}],"collocations":["soil capillarities (土壌毛管現象)","fluid capillarities (流体毛管現象)","surface capillarities (表面毛管現象)"],"synonyms":["capillary action","capillary effect"],"antonyms":[]}],"etymology":{"value":"The word \"capillarities\" is the plural form of \"capillarity\", which comes from the Latin word \"capillaris\", meaning \"of or resembling hair\". This is because the phenomenon was first observed in narrow tubes, resembling hairs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæpɪˈlærɪtiz/","syllables":"ca-pil-lar-i-ties"},"inflection":{"noun_plural":"capillarities"},"usage_notes":{"explanation":"\"Capillarities\" refers to multiple instances or aspects of the phenomenon of capillarity. Capillarity, in turn, describes the ability of a liquid to flow in narrow spaces without the assistance of, and in opposition to, external forces like gravity. The term is often used in scientific and technical contexts, such as soil science, fluid mechanics, and materials science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The capillarity are important for water transport in plants.","correct":"✓ The capillarities are important for water transport in plants.","note":"Capillarities is the plural form and should be used when referring to multiple instances or aspects of the phenomenon. The singular form, capillarity, is also correct in some contexts. However, the plural form is more common when discussing multiple observations or effects."}],"priority":"★★☆"},"related_words":{"derivatives":["capillarity (noun: 毛管現象 - singular)","capillary (adjective: 毛細管の; noun: 毛細血管)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"capillarities\" is a technical term primarily used in scientific and engineering contexts. It refers to multiple instances or aspects of capillarity, which is the phenomenon of a liquid flowing in narrow spaces due to surface tension and intermolecular forces. Understanding this term requires a background in physics, chemistry, or related fields. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the effects of different surface treatments on the capillarities of the material.","translation":"その研究では、異なる表面処理が材料の毛管現象に及ぼす影響を調査した。","type":"noun","meaning_category":"毛管現象 (複数形)"},{"sentence":"Variations in pore size distribution significantly influence the capillarities observed in porous media.","translation":"細孔径分布の変動は、多孔質媒体で観察される毛管現象に大きな影響を与える。","type":"noun","meaning_category":"毛管現象 (複数形)"}]}