{"word":"Contaminated-looking","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"汚染されているように見える、汚染された外観をしている","english_definition":"Having an appearance that suggests contamination; appearing as if it has been exposed to or contains a harmful substance.","examples":[{"sentence":"The water had a contaminated-looking sheen on its surface.","translation":"水面には汚染されているように見える光沢があった。"},{"sentence":"The food was discarded due to its contaminated-looking color.","translation":"その食品は、汚染されているように見える色のため廃棄された。"},{"sentence":"The soil sample was flagged for further testing because it was contaminated-looking.","translation":"その土壌サンプルは、汚染されているように見えるため、追加の検査が必要とされた。"}],"collocations":["contaminated-looking water (汚染されているように見える水)","contaminated-looking food (汚染されているように見える食品)","contaminated-looking soil (汚染されているように見える土壌)","contaminated-looking substance (汚染されているように見える物質)"],"synonyms":["polluted-looking","tainted-looking","impure-looking","defiled-looking","unclean-looking"],"antonyms":["clean-looking","pure-looking","uncontaminated-looking","pristine-looking","sterile-looking"]}],"etymology":{"value":"Derived from 'contaminated' (past participle of 'contaminate,' meaning to make impure or unclean by contact or mixture) and 'looking' (having a specified appearance).","priority":"☆☆☆"},"pronunciation":{"ipa":"/kənˈtæməˌneɪtɪd ˈlʊkɪŋ/","syllables":"con-tam-i-nat-ed look-ing"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Contaminated-looking' is a descriptive adjective used to convey that something has the visual characteristics of being contaminated. It doesn't necessarily mean the item *is* contaminated, only that its appearance suggests it. It is often used when describing substances or environments where contamination is a concern.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contaminated-looking water was definitely safe to drink.","correct":"✓ The contaminated-looking water turned out to be safe to drink after testing.","note":"If something is 'contaminated-looking,' it suggests it might not be safe. To say it 'was definitely safe' contradicts the initial description. Instead, clarify that despite its appearance, tests showed it was safe."},{"incorrect":"✗ He ate the contaminated-looking food, and nothing happened.","correct":"✓ He avoided the contaminated-looking food, fearing it might be unsafe.","note":"Eating something 'contaminated-looking' implies a risk. It's more logical to avoid it, or to say that it was tested and found safe before consumption."}],"priority":"☆☆☆"},"related_words":{"derivatives":["contaminated (adjective, past participle)","contaminate (verb)","contamination (noun)","looking (adjective, gerund)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Contaminated-looking' is a compound adjective used to describe something that *appears* to be contaminated. It's a descriptive term, implying a visual assessment rather than confirmed contamination. Due to its specific and technical nature, it is likely to be used and understood by those with a good command of English, especially in contexts related to environmental science, health, or safety."},"example_sentences":[{"sentence":"The abandoned factory had a contaminated-looking site due to years of neglect.","translation":"その廃工場は、長年の放置により、汚染されているように見える場所だった。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The suspicious package was reported because it was contaminated-looking and had no labels.","translation":"その不審な荷物は、汚染されているように見え、ラベルがなかったため通報された。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The scientist wore protective gear while examining the contaminated-looking sample.","translation":"科学者は、汚染されているように見えるサンプルを調べる間、防護服を着用した。","type":"adjective","meaning_category":"descriptive"}]}