{"word":"Rearbitrate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"To arbitrate again or anew.","english_definition":"To submit to arbitration a second time or to re-examine and decide (a matter in dispute).","examples":[{"sentence":"The parties agreed to rearbitrate the dispute after the initial arbitration failed to produce a satisfactory outcome.","translation":"当事者たちは、最初の仲裁が満足のいく結果を生み出せなかったため、紛争を再仲裁することに合意した。"}],"collocations":["agree to rearbitrate","decide to rearbitrate","attempt to rearbitrate"],"synonyms":["re-arbitrate","reconsider","rejudge","rehear"],"antonyms":[]}],"etymology":{"value":"The word 'rearbitrate' is formed by adding the prefix 're-' to the word 'arbitrate'. The prefix 're-' means 'again' or 'anew'. 'Arbitrate' comes from the Latin 'arbitratus', past participle of 'arbitrari', meaning 'to judge, decide'.","priority":"★★★"},"pronunciation":{"ipa":"/riːˈɑːrbɪtreɪt/","syllables":"re-ar-bi-trate"},"inflection":{"verb_forms":{"present_simple":["rearbitrate","rearbitrates"],"past_simple":"rearbitrated","past_participle":"rearbitrated","present_participle":"rearbitrating"}},"usage_notes":{"explanation":"'Rearbitrate' is a relatively uncommon verb that describes the act of arbitrating a matter for a second time. This often occurs when the initial arbitration process is deemed insufficient or when new information comes to light that warrants a re-evaluation of the dispute. It implies a renewed effort to resolve a disagreement through a structured, impartial process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They decided to rearbitration the case.","correct":"✓ They decided to rearbitrate the case.","note":"'Rearbitration' is a noun, whereas 'rearbitrate' is the verb. Ensure the correct form is used depending on the context."},{"incorrect":"✗ The rearbitrated decision was the same as before.","correct":"✓ The rearbitrated decision was similar to the previous one.","note":"Rearbitration may lead to a different outcome, so avoid assuming it will always mirror the initial arbitration."}],"priority":"★★☆"},"related_words":{"derivatives":["rearbitration (noun)","arbitrate (verb)","arbitration (noun)","arbitrator (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'rearbitrate' is a specialized term primarily used in legal and business contexts. It means to arbitrate again, usually after an initial arbitration process has failed or when new information requires a re-evaluation. Understanding this word requires familiarity with the concept of arbitration itself, which involves resolving disputes outside of court through a neutral third party. Due to its specific usage and the complexity of the underlying concept, it is considered an advanced term."},"example_sentences":[{"sentence":"The contract stipulated that any disputes would be rearbitrated if the initial ruling was contested.","translation":"契約では、最初の裁定に異議が唱えられた場合、すべての紛争は再仲裁されると規定されていた。","type":"verb","meaning_category":"To arbitrate again"},{"sentence":"After discovering new evidence, the judge ordered the parties to rearbitrate their claims.","translation":"新たな証拠が発見された後、裁判官は当事者たちに主張を再仲裁するよう命じた。","type":"verb","meaning_category":"To arbitrate again"}]}