{"word":"non-hereditary","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"遺伝性でない、非遺伝性の","english_definition":"Not transmitted from parent to offspring through genes; not inherited.","examples":[{"sentence":"The disease is non-hereditary and is caused by environmental factors.","translation":"その病気は遺伝性ではなく、環境要因によって引き起こされます。"},{"sentence":"This trait is non-hereditary; it's acquired through learning.","translation":"この特性は遺伝性ではありません。学習を通して獲得されます。"},{"sentence":"Unlike genetic mutations, non-hereditary changes cannot be passed on to future generations.","translation":"遺伝的変異とは異なり、非遺伝性の変化は将来の世代に伝えられません。"}],"collocations":["non-hereditary disease","non-hereditary trait","non-hereditary condition","non-hereditary factors","non-hereditary cause"],"synonyms":["acquired","environmental","non-genetic"],"antonyms":["hereditary","genetic","inherited","familial"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'hereditary'. 'Hereditary' comes from the Latin 'hereditarius', pertaining to an heir or inheritance.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn hɪˈrɛdɪtəri/","syllables":"non-he-red-i-tar-y"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-hereditary' is used to describe characteristics, diseases, or conditions that are not passed down through genes from parents to their offspring. It emphasizes that the cause is external or acquired rather than being predetermined by genetic inheritance. It's often used in medical and biological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-hereditary disease can be passed down to children.","correct":"✓ The non-hereditary disease cannot be passed down to children.","note":"By definition, a non-hereditary disease cannot be passed down genetically. The sentence should reflect this."},{"incorrect":"✗ This is a hereditary, but also non-hereditary trait.","correct":"✓ This trait has both hereditary and non-hereditary components.","note":"A trait cannot be both entirely hereditary and entirely non-hereditary at the same time. It's more accurate to say that a trait has both genetic and environmental influences."}],"priority":"★★☆"},"related_words":{"derivatives":["nonheritable (synonym)"],"antonyms":["hereditary","inheritable","genetic"],"related_terms":["epigenetics (the study of changes in organisms caused by modification of gene expression rather than alteration of the genetic code itself)","acquired trait (a characteristic or trait that is not genetic or inherited)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'non-hereditary' is a technical term primarily used in scientific and medical contexts. It means that a particular trait, disease, or condition is not passed down from parents to offspring through their genes. Instead, it arises due to environmental factors, lifestyle choices, or other non-genetic influences. Understanding this term requires a basic knowledge of genetics and inheritance. It's often contrasted with 'hereditary,' which means genetically transmitted."},"example_sentences":[{"sentence":"Lung cancer is often a non-hereditary disease caused by smoking.","translation":"肺がんは喫煙によって引き起こされる非遺伝性の病気であることが多いです。","type":"example","meaning_category":"Disease Causation"},{"sentence":"A person's accent is a non-hereditary trait learned from their environment.","translation":"人のアクセントは、環境から学習する非遺伝性の特徴です。","type":"example","meaning_category":"Acquired Trait"},{"sentence":"Researchers are studying the non-hereditary factors that contribute to the development of the condition.","translation":"研究者たちは、その状態の発症に寄与する非遺伝性の要因を研究しています。","type":"example","meaning_category":"Research Context"}]}