{"word":"requisitely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"必要に応じて、必須の程度で、必要な条件を満たして","english_definition":"In a requisite manner; necessarily; in the manner required or needed.","examples":[{"sentence":"The documents were requisitely signed and submitted.","translation":"書類は必要に応じて署名され、提出された。"},{"sentence":"He was requisitely trained for the mission.","translation":"彼はその任務のために必要な訓練を受けた。"},{"sentence":"The software was requisitely updated to meet the new security standards.","translation":"ソフトウェアは新しいセキュリティ基準を満たすために、必要な程度に更新された。"}],"collocations":["requisitely prepared","requisitely trained","requisitely equipped","requisitely signed","requisitely updated"],"synonyms":["necessarily","requiredly","obligatorily","compulsorily","essentially","indispensably"],"antonyms":["unnecessarily","optionally","voluntarily"]}],"etymology":{"value":"From 'requisite' (necessary or needed) + '-ly' (forming adverbs). 'Requisite' comes from Latin 'requisit-,' the past participle of 'requirere' (to require).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛkwɪzɪtli/","syllables":"req-ui-site-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Requisitely' is an adverb that describes actions done in a manner that fulfills a requirement or necessity. It emphasizes that something was done to the extent needed or required. It is a formal word and not commonly used in everyday conversation. It is often used in technical, legal, or official contexts. It is often used to modify verbs that involve preparation, training, or compliance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was requisite trained.","correct":"✓ He was requisitely trained.","note":"'Requisite' is an adjective, while 'requisitely' is the adverb. Use the adverb to modify a verb. The adjective 'requisite' can be used before a noun (e.g., 'requisite training')."},{"incorrect":"✗ The requisitely is that you sign here.","correct":"✓ The requirement is that you sign here.","note":"'Requisitely' is an adverb and cannot be used as a noun. Use 'requirement' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["requisite (adjective, noun)","require (verb)","requirement (noun)"],"phrases":["as requisitely as possible"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Requisitely' is a formal adverb that means 'in a way that is required or necessary.' It's used to describe actions that are performed to meet specific requirements or obligations. This word is not commonly used in everyday conversation and is more often found in formal writing or technical contexts. Understanding this word can help you comprehend complex texts that involve detailed procedures or regulations."},"example_sentences":[{"sentence":"The application form must be requisitely completed before submission.","translation":"申請書は提出前に、必要事項がすべて記入されていなければならない。","type":"adverb","meaning_category":"必要に応じて"},{"sentence":"The equipment was requisitely calibrated to ensure accurate measurements.","translation":"正確な測定を保証するために、機器は必要な程度に校正された。","type":"adverb","meaning_category":"必須の程度で"},{"sentence":"All participants were requisitely informed of the risks involved in the study.","translation":"すべての参加者は、研究に伴うリスクについて必要な範囲で知らされた。","type":"adverb","meaning_category":"必要な条件を満たして"}]}