{"word":"accreditable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"信任できる、信用できる","english_definition":"able to be accredited; worthy of accreditation.","examples":[{"sentence":"The university's programs are accreditable by the national board.","translation":"その大学のプログラムは、国の委員会によって信任される資格があります。"},{"sentence":"The course is accreditable, meaning it meets the required standards for certification.","translation":"そのコースは信任可能であり、認定に必要な基準を満たしていることを意味します。"}],"collocations":["accreditable program","accreditable course","accreditable institution"],"synonyms":["certifiable","creditable","ratifiable","endorsable"],"antonyms":["unaccreditable","discreditable"]}],"etymology":{"value":"\"Accreditable\" is derived from \"accredit,\" which comes from the French \"accréditer\" (to give credence or authority to). The suffix \"-able\" indicates the capacity or suitability to be accredited.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkredɪtəbəl/","syllables":"ac-cred-i-ta-ble"},"inflection":{"adjective_forms":{"comparative":"more accreditable","superlative":"most accreditable"}},"usage_notes":{"explanation":"\"Accreditable\" is used to describe something that can be officially recognized or authorized, typically an institution, program, or course. It implies that the subject meets certain standards or criteria necessary for accreditation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The accreditable of the university is high.","correct":"✓ The accreditation of the university is high.","note":"\"Accreditable\" is an adjective, not a noun. Use \"accreditation\" as the noun. "},{"incorrect":"✗ The program is accrediting.","correct":"✓ The program is accreditable.","note":"\"Accrediting\" implies the act of accrediting something, while \"accreditable\" describes something that is capable of being accredited."}],"priority":"★★☆"},"related_words":{"derivatives":["accredit (verb): to give official authorization or approval to","accreditation (noun): the act of accrediting or the state of being accredited","accredited (adjective): officially recognized or authorized"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"accreditable\" is a formal term used in educational and professional contexts. It describes something that meets the standards to be officially recognized or approved by an accrediting body. It is less commonly used in everyday language and more often found in academic or professional documentation."},"example_sentences":[{"sentence":"The hospital's residency program is accreditable by the national medical board.","translation":"その病院のレジデンシープログラムは、国の医療委員会によって信任される資格があります。","type":"adjective","meaning_category":"信任できる"},{"sentence":"To ensure quality, only accreditable online courses should be considered.","translation":"品質を保証するために、信任可能なオンラインコースのみを検討する必要があります。","type":"adjective","meaning_category":"信用できる"}]}