{"word":"supertankers","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超大型タンカー","english_definition":"An extremely large oil tanker.","examples":[{"sentence":"Supertankers are used to transport crude oil across long distances.","translation":"超大型タンカーは原油を長距離輸送するために使用される。"},{"sentence":"The size of supertankers makes them difficult to maneuver in narrow waterways.","translation":"超大型タンカーの大きさは、狭い水路での操縦を困難にする。"},{"sentence":"Environmental concerns have been raised regarding the potential for oil spills from supertankers.","translation":"超大型タンカーからの石油流出の可能性に関して、環境上の懸念が提起されている。"}],"collocations":["crude oil supertankers","double-hulled supertankers","supertanker fleet","supertanker route"],"synonyms":["very large crude carrier (VLCC)","ultra large crude carrier (ULCC)"],"antonyms":[]}],"etymology":{"value":"The word \"supertanker\" is a combination of \"super\" meaning extremely large or powerful, and \"tanker\" referring to a ship designed to carry liquids in bulk.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsuːpərˌtæŋkərz/","syllables":"su-per-tan-kers"},"inflection":{"noun_plural":"supertankers"},"usage_notes":{"explanation":"\"Supertankers\" specifically refers to very large oil tankers, typically those exceeding 200,000 deadweight tons (DWT). These ships are designed to transport vast quantities of crude oil, making them essential for global oil trade. However, their size also poses environmental risks, as accidents can lead to significant oil spills.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The supertanker was sinked.","correct":"✓ The supertanker sank.","note":"\"Sink\" is an irregular verb. The past simple is \"sank,\" not \"sinked.\""},{"incorrect":"✗ Supertankers are very pollution.","correct":"✓ Supertankers are a major source of pollution.","note":"\"Pollution\" is a noun. Use it correctly in a sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["tanker","oil tanker","VLCC (Very Large Crude Carrier)","ULCC (Ultra Large Crude Carrier)"],"phrases":["oil spill","environmental disaster","shipping lane","deadweight tonnage (DWT)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in discussions about oil transport and environmental issues.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"supertankers\" refers to very large ships that carry oil. Because of their size, they can transport a lot of oil, but they also pose a risk of causing significant environmental damage if there is an accident. This term is generally used in discussions about international trade, energy, and environmental issues."},"example_sentences":[{"sentence":"The supertankers navigate through designated shipping lanes to minimize the risk of collisions.","translation":"超大型タンカーは、衝突のリスクを最小限に抑えるために、指定された航路を航行する。","type":"general"},{"sentence":"Double-hulled supertankers are designed to reduce the likelihood of oil spills in the event of an accident.","translation":"二重船殻の超大型タンカーは、事故が発生した場合の石油流出の可能性を減らすように設計されている。","type":"technical"},{"sentence":"The construction of new supertankers has slowed down due to concerns about overcapacity in the oil shipping industry.","translation":"石油輸送業界の過剰能力への懸念から、新しい超大型タンカーの建造は減速している。","type":"economic"}]}