{"word":"purple-streaming","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"紫色の光を放つ、または紫色の光が流れるような","english_definition":"emitting or characterized by a flowing stream of purple light.","examples":[{"sentence":"The purple-streaming sunset painted the sky with vibrant hues.","translation":"紫色の光が流れる夕焼けが、空を鮮やかな色合いで彩った。"},{"sentence":"A purple-streaming aurora danced across the night sky.","translation":"紫色の光を放つオーロラが夜空を舞った。"}],"collocations":["purple-streaming sunset","purple-streaming aurora","purple-streaming light"],"synonyms":["purple-glowing","purple-radiant","purple-illuminated"],"antonyms":["none (as the word describes a specific visual effect)"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"purple\" (referring to the color) and \"streaming\" (describing a flowing or radiating movement).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɜːrpəl ˈstriːmɪŋ/","syllables":"pur-ple-stream-ing"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Purple-streaming\" is a descriptive adjective often used in literature or poetry to evoke a vivid visual image of purple light in motion. It is not a commonly used word in everyday conversation but is effective in creating a specific aesthetic effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The purple-streaming water.","correct":"✓ The purple-streaming light.","note":"The adjective is best used to describe light or phenomena that emit light, not physical objects like water unless the context implies the water is somehow emitting purple light."}],"priority":"★☆☆"},"related_words":{"derivatives":["streaming (adjective, noun)","purple (adjective, noun)"],"phrasal_verbs":["none"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, used in descriptive or poetic contexts)","frequency_google_ngram":"Very low frequency (highly specialized or literary usage)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Purple-streaming\" is a compound adjective used to describe something emitting a flowing stream of purple light. It is not a common word and is typically found in descriptive or poetic writing aiming to create a vivid visual image. Understanding the individual components (\"purple\" and \"streaming\") helps in deciphering the meaning. Its usage is limited to contexts where the visual effect of purple light in motion is relevant."},"example_sentences":[{"sentence":"The artist captured the ethereal beauty of the purple-streaming clouds.","translation":"そのアーティストは、紫色の光が流れる雲の幻想的な美しさを捉えた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"A single spotlight cast a purple-streaming beam across the stage.","translation":"一本のスポットライトが、紫色の光を放つ光線を舞台に投げかけた。","type":"adjective","meaning_category":"descriptive"}]}