{"word":"chirker","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, chiefly British) A person who is cheerful and optimistic, especially in the face of adversity.","english_definition":"(slang, chiefly British) A person who is cheerful and optimistic, especially in the face of adversity.","examples":[{"sentence":"Despite losing his job, he remained a true chirker, always looking on the bright side.","translation":"仕事を失ったにもかかわらず、彼は真のチャーキーであり続け、常に明るい面を見ていました。"}],"collocations":["true chirker","eternal chirker"],"synonyms":["optimist","cheerleader","positive thinker"],"antonyms":["pessimist","gloomster"]},{"part_of_speech":"noun","definition":"(slang, chiefly British) A person who complains or grumbles frequently. (This is a less common usage, and may be considered contradictory to the primary definition.)","english_definition":"(slang, chiefly British) A person who complains or grumbles frequently. (This is a less common usage, and may be considered contradictory to the primary definition.)","examples":[{"sentence":"Don't be such a chirker! Try to find something positive to say.","translation":"そんなに文句ばかり言わないで！何かポジティブなことを見つけて言ってごらん。"}],"collocations":["constant chirker","habitual chirker"],"synonyms":["complainer","grumbler","whiner"],"antonyms":["content person","satisfied person"]}],"etymology":{"value":"Likely a blend of 'chirp' (referring to a cheerful, bird-like sound) and '-er' (a suffix denoting a person who does something). The contradictory usage as a complainer may arise from ironic or sarcastic application.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɜːrkər/","syllables":"chir-ker"},"inflection":{"noun_plural":"chirkers"},"usage_notes":{"explanation":"The term 'chirker' is primarily British slang. Its dominant meaning refers to someone who is consistently cheerful and optimistic, even when facing difficulties. However, a less common and potentially contradictory usage exists, where it describes someone who complains or grumbles a lot. Context is crucial to determine the intended meaning. The 'cheerful' sense is more widely recognized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's such a chirker, always causing trouble.","correct":"✓ He's such a chirker, always trying to cheer people up.","note":"If intending to convey a positive meaning, ensure the context aligns with cheerfulness and optimism, not troublemaking."}],"priority":"★★☆"},"related_words":{"derivatives":["chirpy (adjective: cheerful, lively)"],"phrases":["keep your chin up (idiom: remain cheerful in a difficult situation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (slang, low frequency)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Chirker' is a slang term, primarily used in British English. It mainly describes someone who is consistently cheerful and optimistic, even when facing challenges. However, it can also, though less commonly, refer to someone who complains frequently. Due to its slang nature and potential for contradictory meanings, understanding the context is essential. It's not a common word, so familiarity with British slang is helpful for comprehension."},"example_sentences":[{"sentence":"She's a real chirker, always smiling no matter what happens.","translation":"彼女は本当にチャーキーで、何が起きてもいつも笑顔だ。","type":"noun","meaning_category":"Cheerful person"},{"sentence":"Despite the bad weather, the chirker in him refused to be dampened.","translation":"悪天候にもかかわらず、彼のチャーキーな性格は落ち込むことを拒んだ。","type":"noun","meaning_category":"Cheerful person"},{"sentence":"Stop being such a chirker and try to be a little more positive!","translation":"そんなに文句ばかり言わないで、もう少しポジティブになろう！","type":"noun","meaning_category":"Complainer (less common)"}]}