{"word":"Lollardry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ロラード派（14世紀後半から15世紀にかけてイングランドで起こった宗教改革運動）","english_definition":"A pre-Reformation religious movement in England from the late 14th century to the 16th century that rejected many of the teachings of the Catholic Church.","examples":[{"sentence":"Lollardry was a significant influence on the English Reformation.","translation":"ロラード派はイングランドの宗教改革に大きな影響を与えた。"},{"sentence":"Followers of Lollardry were often persecuted for their beliefs.","translation":"ロラード派の信者は、その信仰のために迫害されることが多かった。"}],"collocations":["spread of Lollardry","suppression of Lollardry","beliefs of Lollardry","followers of Lollardry"],"synonyms":["Wycliffism"],"antonyms":[]},{"part_of_speech":"noun","definition":"ロラード派の教義、信仰","english_definition":"The religious beliefs and doctrines held by the Lollards.","examples":[{"sentence":"Lollardry emphasized the importance of personal interpretation of the Bible.","translation":"ロラード派は聖書の個人的な解釈の重要性を強調した。"},{"sentence":"Central to Lollardry was the rejection of transubstantiation.","translation":"ロラード派の中心的な教義は、聖体変化の否定であった。"}],"collocations":["tenets of Lollardry","doctrines of Lollardry","principles of Lollardry"],"synonyms":["Lollardism"],"antonyms":[]}],"etymology":{"value":"From Middle English *Lollardrie*, from *Lollard* + *-rie* (suffix denoting doctrine or system of beliefs). *Lollard* comes from Middle Dutch *lollaert* ('mumbler, hypocrite'), a derogatory term applied to followers of the movement.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlɒlərdri","syllables":"Lol-lard-ry"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Lollardry' refers both to the religious movement itself and to the set of beliefs held by its followers. It is a historical term primarily used in the context of religious history, particularly the history of Christianity in England. The term 'Lollard' was originally pejorative, but it became the standard designation for members of the movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced Lollardry as a Catholic priest.","correct":"✓ He abandoned Catholicism to practice Lollardry.","note":"Lollardry rejected many Catholic teachings, so a Catholic priest would not practice it. Lollardry was an alternative to Catholicism."}],"priority":"★☆☆"},"related_words":{"derivatives":["Lollard","Lollardist"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Primarily used in historical and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lollardry' is a specialized term primarily encountered in historical or religious studies contexts. Understanding it requires familiarity with the history of Christianity in England and the pre-Reformation period. The term itself is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study of Lollardry provides insights into the religious landscape of medieval England.","translation":"ロラード派の研究は、中世イングランドの宗教的景観への洞察を提供する。","type":"noun","meaning_category":"ロラード派運動"},{"sentence":"One of the key tenets of Lollardry was the belief that the Bible should be available in the vernacular.","translation":"ロラード派の重要な教義の一つは、聖書が自国語で利用可能であるべきだという信念であった。","type":"noun","meaning_category":"ロラード派の教義"}]}