{"word":"gastrohepatitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胃腸肝炎","english_definition":"Inflammation of the stomach, intestines, and liver.","examples":[{"sentence":"The patient was diagnosed with gastrohepatitis after presenting with vomiting, diarrhea, and abdominal pain.","translation":"患者は嘔吐、下痢、腹痛を訴え、胃腸肝炎と診断された。"}],"collocations":["acute gastrohepatitis","viral gastrohepatitis"],"synonyms":["hepatogastroenteritis"],"antonyms":[]}],"etymology":{"value":"The term 'gastrohepatitis' is derived from the Greek words 'gastro-' (stomach), 'hepato-' (liver), and '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"ˌɡæstroʊˌhɛpəˈtaɪtɪs","syllables":"gas-tro-hep-a-ti-tis"},"inflection":{"noun_plural":"gastrohepatitides (rare)"},"usage_notes":{"explanation":"Gastrohepatitis is a medical condition characterized by the simultaneous inflammation of the stomach, intestines, and liver. It is a relatively rare condition, and its diagnosis often requires a combination of clinical evaluation, laboratory tests, and imaging studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Gastrohepatitis is caused by bacteria only.","correct":"✓ Gastrohepatitis can be caused by viruses, bacteria, or parasites.","note":"Gastrohepatitis can have various causes, including viral, bacterial, or parasitic infections."}],"priority":"★★☆"},"related_words":{"derivatives":["gastroenteritis","hepatitis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Gastrohepatitis is a specialized medical term referring to the inflammation of the stomach, intestines, and liver simultaneously. It is not a common term in everyday language and is primarily used within medical contexts. Understanding this term requires a background in medical terminology and anatomy. The condition itself is relatively rare, making the term less frequently encountered. "},"example_sentences":[{"sentence":"Severe cases of gastrohepatitis may require hospitalization for supportive care.","translation":"重症の胃腸肝炎の場合は、支持療法のために入院が必要になることがある。","type":"general","meaning_category":"medical condition"},{"sentence":"The veterinarian suspected gastrohepatitis in the dog due to its persistent vomiting and jaundice.","translation":"獣医は、犬の持続的な嘔吐と黄疸から胃腸肝炎を疑った。","type":"veterinary","meaning_category":"animal disease"}]}