{"word":"monocarpic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)一生に一度だけ開花・結実する","english_definition":"(of a plant) flowering and fruiting only once and then dying.","examples":[{"sentence":"The bamboo is a monocarpic plant that flowers only once in its lifetime.","translation":"竹は一生に一度だけ花を咲かせる単果植物です。"},{"sentence":"Many agave species are monocarpic, taking years to accumulate resources before their final bloom.","translation":"多くのアガベ属の植物は単果性で、最後の開花まで何年もかけて資源を蓄えます。"}],"collocations":["monocarpic plant","monocarpic species","monocarpic life cycle"],"synonyms":["semelparous (生物学一般)"],"antonyms":["polycarpic"],"notes":"Monocarpic plants often exhibit a dramatic final flowering before they die.","scientific_context":"This term is primarily used in botany and ecology to describe plant life cycles.","related_concepts":["biennial","annual","perennial"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, one) and 'karpos' (fruit).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnəˈkɑːrpɪk/","syllables":"mon-o-car-pic"},"inflection":{"notes":"Adjective; no plural form."},"usage_notes":{"explanation":"The term 'monocarpic' is used to describe plants that flower, produce seeds, and then die. This is in contrast to 'polycarpic' plants, which flower and fruit multiple times during their lifespan.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The monocarpic animal dies after giving birth once.","correct":"✓ The semelparous animal dies after giving birth once.","note":"'Monocarpic' specifically refers to plants. The equivalent term for animals is 'semelparous'."}],"priority":"★★☆"},"related_words":{"derivatives":["monocarpy (noun)"],"related_terms":["semelparous","polycarpic","annual","biennial","perennial"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in botany.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'monocarpic' is a technical term used in botany to describe plants that flower and fruit only once before dying. It's not commonly used outside of scientific or horticultural contexts. Understanding this word requires some familiarity with plant life cycles and botanical terminology."},"example_sentences":[{"sentence":"The century plant is a well-known example of a monocarpic perennial.","translation":"リュウゼツランは、単果性の多年生植物のよく知られた例です。","type":"example","meaning_category":"一生に一度だけ開花・結実する"},{"sentence":"After decades of vegetative growth, the monocarpic plant finally sent up a massive flower stalk.","translation":"数十年にわたる栄養成長の後、その単果植物はついに巨大な花茎を伸ばしました。","type":"example","meaning_category":"一生に一度だけ開花・結実する"}]}