{"word":"phenakism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学) 欺瞞、虚偽、見せかけ、ごまかし。特に、自分自身を騙すこと、または他人を騙すために虚偽の印象を作り出すこと。","english_definition":"(psychology) Deception, falsehood, pretense, or trickery; especially, the act of deceiving oneself or creating a false impression to deceive others.","examples":[{"sentence":"His phenakism was so convincing that everyone believed his story.","translation":"彼の欺瞞は非常に説得力があったので、誰もが彼の話を信じた。"},{"sentence":"The politician's speech was full of phenakism, designed to mislead the voters.","translation":"その政治家の演説は、有権者を誤解させるように設計された欺瞞に満ちていた。"},{"sentence":"She accused him of phenakism, claiming he was not being honest about his intentions.","translation":"彼女は彼が自分の意図について正直ではないと主張し、彼を欺瞞で非難した。"}],"collocations":["act of phenakism","deliberate phenakism","political phenakism","self-phenakism"],"synonyms":["deception","falsehood","pretense","trickery","duplicity","hypocrisy","sham"],"antonyms":["honesty","truthfulness","sincerity","candor"]}],"etymology":{"value":"ギリシャ語の 'phenakizein' (騙す、欺く) に由来する。'phenax' (詐欺師、騙し屋) と関連がある。","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈnækɪzəm/","syllables":"phe-nak-ism"},"inflection":{"noun_plural":"phenakisms"},"usage_notes":{"explanation":"'Phenakism' は、日常会話ではあまり使われない、やや専門的な単語です。心理学や哲学の文脈で、自己欺瞞や他人を欺く意図的な行為を指す場合に用いられます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great phenakism in his generosity.","correct":"✓ He showed great generosity, but it was phenakism.","note":"'Phenakism' は、良い意味では使われません。見せかけの行動を指す場合にのみ使われます。"},{"incorrect":"✗ The phenakism of the situation was obvious.","correct":"✓ The deception of the situation was obvious.","note":"より一般的な単語である 'deception' や 'trickery' で置き換える方が、より自然な表現になる場合があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["phenakist (名詞: 欺瞞者、詐欺師 - 稀)","phenakistic (形容詞: 欺瞞的な - 稀)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phenakism' is a relatively rare and sophisticated term referring to deception or pretense, particularly when it involves self-deception or creating a false impression to mislead others. It is more commonly used in academic or philosophical contexts when discussing psychological or ethical concepts. Due to its infrequent usage, it's important to ensure that the context clearly warrants its use, and that the audience is likely to understand its meaning. In many cases, more common synonyms like 'deception' or 'hypocrisy' may be more appropriate for general communication."},"example_sentences":[{"sentence":"The artist's use of perspective created a powerful sense of phenakism, making the two-dimensional painting appear three-dimensional.","translation":"その芸術家の遠近法の使い方は、強力な欺瞞の感覚を生み出し、二次元の絵画を三次元に見せかけた。","type":"noun","meaning_category":"見せかけ、ごまかし"},{"sentence":"The con man's entire life was built on phenakism, constantly deceiving people for his own gain.","translation":"その詐欺師の人生全体は欺瞞の上に築かれており、自分の利益のために常に人々を欺いていた。","type":"noun","meaning_category":"欺瞞、虚偽"},{"sentence":"The politician's carefully crafted image was a form of phenakism, hiding his true intentions from the public.","translation":"その政治家の注意深く作り上げられたイメージは欺瞞の一形態であり、彼の真の意図を大衆から隠していた。","type":"noun","meaning_category":"見せかけ、ごまかし"},{"sentence":"The novel explores the theme of self-phenakism, showing how characters can deceive themselves to cope with reality.","translation":"その小説は自己欺瞞のテーマを探求し、登場人物が現実に対処するためにどのように自分自身を欺くことができるかを示している。","type":"noun","meaning_category":"自己欺瞞"}]}