{"word":"half-sheathed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"半分だけ鞘に収められた、半分だけ覆われた","english_definition":"Partially covered or enclosed in a sheath or covering.","examples":[{"sentence":"The soldier stood with his sword half-sheathed, ready for action.","translation":"兵士は剣を半分鞘に収めたまま、いつでも行動できるように立っていた。"},{"sentence":"The flower bud was half-sheathed in its protective leaves.","translation":"花のつぼみは保護用の葉に半分覆われていた。"}],"collocations":["half-sheathed sword (半分鞘に収められた剣)","half-sheathed bud (半分覆われた芽)"],"synonyms":["partially covered","partially enclosed","partly sheathed"],"antonyms":["fully sheathed","completely covered","fully enclosed"]}],"etymology":{"value":"The word is formed by combining \"half\" (meaning partially) with \"sheathed\" (meaning covered or enclosed in a sheath).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæfˈʃiːθt/","syllables":"half-sheathed"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Half-sheathed' is typically used to describe something that is only partially covered by a protective layer or casing. It often implies a state of readiness or incomplete protection. It can be used literally, such as with a sword, or figuratively, such as with a flower bud.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The half sheathed sword.","correct":"✓ The half-sheathed sword.","note":"Hyphen is needed to combine 'half' and 'sheathed' when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["sheath (noun): a close-fitting cover or case for something, especially a sword or knife.","sheathe (verb): to put (a weapon such as a sword or knife) into a sheath."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'half-sheathed' is relatively uncommon and may not be familiar to those with a basic understanding of English. It is best used in descriptive contexts where partial covering or enclosure is relevant. Understanding the meaning of 'sheath' is essential to grasping the meaning of 'half-sheathed.'"},"example_sentences":[{"sentence":"The knight stood poised, his half-sheathed sword gleaming in the torchlight.","translation":"騎士は身構え、たいまつに照らされて半分鞘に収められた剣が光っていた。","type":"adjective","meaning_category":"partially covered"},{"sentence":"The chrysalis was now half-sheathed, revealing the butterfly's wings beginning to emerge.","translation":"蛹は半分覆われた状態になり、蝶の羽が姿を現し始めていた。","type":"adjective","meaning_category":"partially enclosed"}]}