{"word":"prosomatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学) 前体部の、前体に関する","english_definition":"Relating to the prosoma (the anterior part of the body in some arthropods).","examples":[{"sentence":"The prosomatic appendages are important for locomotion and feeding.","translation":"前体部の付属肢は、移動と摂食に重要である。"}],"collocations":["prosomatic appendages","prosomatic region"],"synonyms":["cephalothoracic"],"antonyms":["opisthosomatic"]}],"etymology":{"value":"Derived from the Greek words 'pros' (meaning 'forward' or 'anterior') and 'soma' (meaning 'body').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊsoʊˈmætɪk/","syllables":"pro-so-mat-ic"},"inflection":{"notes":"Comparative and superlative forms are possible (more prosomatic, most prosomatic), but rarely used."},"usage_notes":{"explanation":"The term 'prosomatic' is primarily used in zoology, specifically when describing the anatomy of arthropods such as spiders, scorpions, and horseshoe crabs. It refers to structures or characteristics associated with the prosoma, which is the fused head and thorax region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prosomatic is the same as the abdomen.","correct":"✓ The prosoma is not the same as the abdomen.","note":"'Prosomatic' is an adjective, while 'prosoma' is a noun referring to the body region itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["prosoma (noun): The anterior part of the body in some arthropods, comprising the head and thorax fused together."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Prosomatic' is a highly specialized term used within the field of zoology, specifically when discussing the anatomy of certain arthropods. Understanding this term requires familiarity with arthropod body plans and anatomical terminology. It is unlikely to be encountered outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The scorpion's eyes are located on the prosomatic shield.","translation":"サソリの目は前体部の盾板に位置している。","type":"adjective","meaning_category":"前体に関する"},{"sentence":"The prosomatic segments are covered by a carapace in many arachnids.","translation":"多くのクモ類では、前体部の体節は甲羅で覆われている。","type":"adjective","meaning_category":"前体部の"}]}