{"word":"uninoculated","priority":"3","meanings":[{"part_of_speech":"adjective","definition":"予防接種を受けていない、種痘を受けていない","english_definition":"not inoculated; not having received a vaccine or other form of inoculation.","examples":[{"sentence":"The uninoculated children were at higher risk of contracting the disease.","translation":"予防接種を受けていない子供たちは、その病気に感染するリスクが高かった。"},{"sentence":"The study compared the health outcomes of inoculated and uninoculated individuals.","translation":"その研究では、予防接種を受けた個人と受けていない個人の健康状態の結果を比較した。"}],"collocations":["uninoculated population","uninoculated individuals","uninoculated against (a disease)"],"synonyms":["unvaccinated","non-immunized"],"antonyms":["inoculated","vaccinated","immunized"]}],"etymology":{"value":"The word \"uninoculated\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"inoculated.\" \"Inoculated\" comes from the Latin word \"inoculare,\" meaning \"to graft\" or \"to insert a bud into a plant.\" This refers to the early practice of introducing a small amount of disease-causing material into a person to create immunity.","priority":"2"},"pronunciation":{"ipa":"/ˌʌnɪˈnɒkjʊleɪtɪd/","syllables":"un-in-oc-u-lat-ed"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"uninoculated\" is typically used in medical or scientific contexts when discussing vaccination or immunization programs and their effectiveness. It's a more formal and precise term than simply saying someone is \"not vaccinated.\" It emphasizes the lack of the inoculation process.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"The uninoculated patient was given a vaccine.","correct":"The uninoculated patient received a vaccine.","note":"While \"given\" is not incorrect, \"received\" is more commonly used in medical contexts when referring to vaccinations."}],"priority":"1"},"related_words":{"derivatives":["inoculate (verb)","inoculation (noun)"],"related_terms":["vaccinate (verb)","vaccination (noun)","immunize (verb)","immunization (noun)"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency"},"readability_explanation":{"level":"C1","text":"The word 'uninoculated' is a formal term primarily used in medical or scientific discussions. It specifically refers to someone who has not received a vaccine or other form of inoculation to provide immunity against a disease. Understanding this word is important for comprehending medical research, public health information, and discussions about vaccination policies."},"example_sentences":[{"sentence":"The study focused on the risks faced by the uninoculated segment of the population during the outbreak.","translation":"その研究は、発生中に人口の予防接種を受けていないセグメントが直面するリスクに焦点を当てました。","type":"general"},{"sentence":"Public health officials urged uninoculated individuals to get vaccinated to protect themselves and others.","translation":"公衆衛生当局は、予防接種を受けていない個人に対し、自分自身と他の人を守るために予防接種を受けるよう促した。","type":"medical"}]}