{"word":"undershrubby","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"亜低木状の、半低木状の","english_definition":"Resembling or characteristic of an undershrub; having the characteristics of a plant that is partly shrubby and partly herbaceous.","examples":[{"sentence":"The plant has an undershrubby habit, with woody stems at the base and herbaceous growth above.","translation":"その植物は亜低木状の性質を持ち、基部は木質の茎で、上部は草本の成長をしています。"}],"collocations":["undershrubby plant","undershrubby growth","undershrubby habit"],"synonyms":["semi-shrubby","suffrutescent"],"antonyms":["herbaceous","shrubby"]}],"etymology":{"value":"'Under-' (below, beneath) + 'shrubby' (resembling a shrub). Describes plants that are intermediate between shrubs and herbaceous plants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈʃrʌbi/","syllables":"un-der-shrub-by"},"inflection":{"notes":"Comparative and superlative forms are not commonly used.","adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Undershrubby' is a botanical term used to describe plants that have persistent woody stems near the base, but with upper parts that die back each year like herbaceous plants. These plants are intermediate in form between shrubs and herbs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree was undershrubby.","correct":"✓ The plant was undershrubby.","note":"'Undershrubby' applies to plants that are smaller than trees and have characteristics intermediate between shrubs and herbs."}],"priority":"★☆☆"},"related_words":{"derivatives":["undershrub (noun: a small shrub, especially one that is partly herbaceous)","shrubby (adjective: resembling a shrub)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undershrubby' is a specialized botanical term used to describe plants that are intermediate in form between shrubs and herbaceous plants. Understanding this term requires some familiarity with botanical vocabulary. It is not commonly used outside of botanical contexts."},"example_sentences":[{"sentence":"Many plants in arid environments exhibit an undershrubby growth form to conserve resources.","translation":"乾燥した環境の多くの植物は、資源を節約するために亜低木状の成長形態を示します。","type":"adjective","meaning_category":"亜低木状の"},{"sentence":"The lavender plant has an undershrubby base that persists through the winter.","translation":"ラベンダーの植物は、冬の間も残る亜低木状の基部を持っています。","type":"adjective","meaning_category":"亜低木状の"}]}