{"word":"rajaship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) ラージャの地位、ラージャの統治、ラージャの領土","english_definition":"The position, rule, or territory of a raja.","examples":[{"sentence":"The rajaship was passed down through generations.","translation":"ラージャの地位は何世代にもわたって受け継がれてきた。"},{"sentence":"He inherited the rajaship at a young age.","translation":"彼は若い年齢でラージャの地位を相続した。"},{"sentence":"The rajaship controlled a vast area of land.","translation":"そのラージャの領土は広大な土地を支配していた。"}],"collocations":["inherit a rajaship (ラージャの地位を相続する)","establish a rajaship (ラージャの地位を確立する)","lose a rajaship (ラージャの地位を失う)"],"synonyms":["kingdom","principality","chieftaincy","sultanate"],"antonyms":["democracy","republic"]}],"etymology":{"value":"From 'raja' (Sanskrit for 'king' or 'prince') + '-ship' (a suffix denoting a state, condition, or office).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɑːdʒəˌʃɪp/","syllables":"ra-ja-ship"},"inflection":{"noun_plural":"rajaships"},"usage_notes":{"explanation":"'Rajaship' refers specifically to the position, rule, or territory of a raja, a term used in South Asia for a monarch or prince. It is often used in historical contexts when discussing kingdoms or principalities ruled by rajas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the rajaship of the kingdom.","correct":"✓ He held the rajaship of the kingdom. / ✓ He was the raja of the kingdom.","note":"'Rajaship' refers to the position or territory, not the person. Use 'raja' to refer to the person holding the position."}],"priority":"★☆☆"},"related_words":{"derivatives":["raja (noun: king or prince)","rani (noun: queen or princess)","raj (noun: rule, dominion)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'rajaship' is relatively uncommon and is primarily used in historical or academic contexts related to South Asia. It refers to the position, rule, or territory of a raja, a term for a monarch or prince in that region. Understanding the term requires some familiarity with South Asian history and political structures."},"example_sentences":[{"sentence":"The decline of the Mughal Empire led to the rise of several independent rajaships.","translation":"ムガル帝国の衰退は、いくつかの独立したラージャの領土の台頭につながった。","type":"noun","meaning_category":"ラージャの地位・領土"},{"sentence":"The responsibilities of the rajaship included maintaining peace and prosperity within the realm.","translation":"ラージャの地位の責任には、領土内の平和と繁栄を維持することが含まれていた。","type":"noun","meaning_category":"ラージャの地位・統治"},{"sentence":"The history of the region is marked by conflicts and alliances between various rajaships.","translation":"その地域の歴史は、さまざまなラージャの領土間の紛争と同盟によって特徴づけられている。","type":"noun","meaning_category":"ラージャの地位・領土"}]}