{"word":"Clearwing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫)スカシバガの一種","english_definition":"A moth of the family Sesiidae (also known as Aegeriidae), characterized by transparent wings due to the lack of scales in certain areas. They often mimic wasps or bees in appearance.","examples":[{"sentence":"The raspberry clearwing is a pest of raspberry bushes.","translation":"キイチゴスカシバはキイチゴの害虫です。"},{"sentence":"Clearwings are masters of disguise, often resembling stinging insects.","translation":"スカシバガは変装の達人で、しばしば刺す昆虫に似ています。"}],"collocations":["raspberry clearwing","hornet clearwing","clearwing moth","sesiid moth"],"synonyms":["sesiid moth","Aegeriidae"],"antonyms":[]}],"etymology":{"value":"The name \"clearwing\" refers to the transparent or partially transparent wings of these moths, which lack the opaque scales found on most other moths.","priority":"★★★"},"pronunciation":{"ipa":"/ˈklɪərwɪŋ/","syllables":"clear-wing"},"inflection":{"noun_plural":"clearwings"},"usage_notes":{"explanation":"Clearwing moths are known for their wasp or bee mimicry, which helps them avoid predation. They are often brightly colored and have narrow bodies. Many species are pests of fruit trees and other crops.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a clearwing butterfly.","correct":"✓ I saw a clearwing moth.","note":"Clearwings are moths, not butterflies."}],"priority":"★☆☆"},"related_words":{"derivatives":["clearwinged (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"clearwing\" refers to a specific type of moth characterized by its transparent wings. Understanding this term requires some knowledge of entomology and insect morphology. The primary challenge lies in recognizing the specific family of moths being described and their unique characteristics. The term is not commonly used outside of scientific or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The apple clearwing can cause significant damage to apple orchards.","translation":"リンゴスカシバはリンゴ園に大きな被害をもたらす可能性があります。","type":"noun","meaning_category":"昆虫"},{"sentence":"The clearwing's transparent wings allow it to mimic a wasp, deterring predators.","translation":"スカシバガの透明な翅は、捕食者を阻止するためにハチを模倣することを可能にします。","type":"noun","meaning_category":"昆虫"}]}