{"word":"Axometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"等角投影図法、軸測投影図法","english_definition":"A type of parallel projection used for creating a pictorial drawing of an object, where the object is rotated along one or more of its axes relative to the plane of projection.","examples":[{"sentence":"Axometry is commonly used in technical drawings and architectural renderings.","translation":"軸測投影図法は、技術図面や建築レンダリングで一般的に使用されます。"},{"sentence":"The software allows for creating axometry views from 3D models.","translation":"そのソフトウェアでは、3Dモデルから軸測投影図を作成できます。"}],"collocations":["isometric axometry (等角軸測投影)","dimetric axometry (二等角軸測投影)","trimetric axometry (三等角軸測投影)"],"synonyms":["parallel projection","isometric projection"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'axon' (axis) and 'metron' (measure).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæksˈɒmətri/","syllables":"ax-om-e-try"},"inflection":{"noun_plural":"Axometries"},"usage_notes":{"explanation":"Axometry is a type of parallel projection used to create 2D representations of 3D objects. Unlike perspective projection, parallel lines remain parallel in axometry, giving the drawing a non-realistic but measurable appearance. There are three main types: isometric (equal angles), dimetric (two equal angles), and trimetric (no equal angles).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Axometry is a type of perspective projection.","correct":"✓ Axometry is a type of parallel projection.","note":"Axometry is a parallel projection, not a perspective projection. Perspective projection includes vanishing points, while axometry does not."}],"priority":"★★☆"},"related_words":{"derivatives":["axometric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Axometry is a technical term related to graphical projection methods, specifically parallel projections. It's used in technical drawing, engineering, and architecture to create 2D representations of 3D objects where parallel lines remain parallel. The concept involves understanding different types of axometry, such as isometric, dimetric, and trimetric projections, each offering a different way to represent the object's dimensions. This term is more commonly encountered in specialized fields rather than general conversation."},"example_sentences":[{"sentence":"The engineer used axometry to create a detailed drawing of the machine part.","translation":"エンジニアは軸測投影図法を用いて、機械部品の詳細な図面を作成しました。","type":"noun","meaning_category":"technical drawing"},{"sentence":"The architect presented the building design using an isometric axometry.","translation":"建築家は等角軸測投影を用いて、建物のデザインを発表しました。","type":"noun","meaning_category":"architectural design"}]}