{"word":"low-media","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"低メディア：情報伝達に高度な技術や複雑なシステムを必要としない、または最小限しか必要としないコミュニケーション手段やコンテンツ。手書きの手紙、口頭伝承、シンプルな印刷物などが該当する。","english_definition":"Low-media refers to communication methods or content that does not require, or requires minimal, advanced technology or complex systems for information transmission. Examples include handwritten letters, oral traditions, and simple printed materials.","examples":[{"sentence":"デジタルデバイドが深刻な地域では、ローメディアが重要な情報伝達手段となる。","translation":"In regions with a severe digital divide, low-media serves as an important means of information transmission."},{"sentence":"ローメディアアートは、ハイテク技術に頼らない表現を追求する。","translation":"Low-media art pursues expressions that do not rely on high-tech technologies."},{"sentence":"地域コミュニティのニュースは、ローメディアである回覧板で共有されることが多い。","translation":"News in local communities is often shared through low-media methods such as circular notices."}],"collocations":["ローメディアアート (low-media art)","ローメディアコミュニケーション (low-media communication)","ローメディア技術 (low-media technology)","ローメディア戦略 (low-media strategy)","ローメディアコンテンツ (low-media content)"],"synonyms":["アナログメディア (analog media)","伝統的メディア (traditional media)","シンプルメディア (simple media)","非デジタルメディア (non-digital media)"],"antonyms":["ハイメディア (high-media)","高メディア (high-media)","デジタルメディア (digital media)","ニューメディア (new media)"]}],"etymology":{"value":"「low」は低い、少ないという意味。「media」は媒体、手段という意味。合わせて、技術水準が低い媒体、手段という意味になる。","priority":"★★☆"},"pronunciation":{"ipa":"/loʊ ˈmiːdiə/","syllables":"low-me-di-a"},"inflection":{"notes":"名詞なので、複数形は通常ありませんが、文脈によっては 'low-medias' となることもあります。"},"usage_notes":{"explanation":"「ローメディア」は、高度な技術を必要としない情報伝達手段を指す言葉です。デジタルデバイドが問題となる地域や、技術に頼らない表現を追求するアートの分野などで用いられます。対義語は「ハイメディア」や「デジタルメディア」です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ ローメディアはいつも悪い。","correct":"✓ ローメディアは状況によっては有効なコミュニケーション手段である。","note":"ローメディアは必ずしも悪いものではなく、状況や目的に応じて有効な手段となり得ます。デジタルデバイドの解消や、技術に頼らない表現など、ローメディアならではの利点もあります。"},{"incorrect":"✗ ローメディアとハイメディアは同じ意味だ。","correct":"✓ ローメディアはハイメディアの対義語だ。","note":"ローメディアとハイメディアは対義語であり、意味は異なります。ローメディアは技術水準が低い媒体、ハイメディアは技術水準が高い媒体を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"不明","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「ローメディア」は、高度な技術を使わない情報伝達の方法を指す言葉です。例えば、手紙や口頭での伝達などがローメディアにあたります。デジタル技術が普及していない場所や、あえて技術を使わない表現方法を選ぶ場合に、この言葉が使われます。対義語は「ハイメディア」で、こちらはインターネットやデジタル放送など、高度な技術を使った情報伝達方法を指します。"},"example_sentences":[{"sentence":"地方の農村部では、回覧板がローメディアとして重要な役割を果たしている。","translation":"In rural areas, circular notices play an important role as a low-media communication tool.","type":"noun","meaning_category":"情報伝達手段"},{"sentence":"ローメディアアートの展覧会では、手作りの作品が多く展示されていた。","translation":"The low-media art exhibition featured many handmade works.","type":"noun","meaning_category":"アート"},{"sentence":"災害時には、ローメディアであるラジオが重要な情報源となる。","translation":"In the event of a disaster, low-media such as radio becomes an important source of information.","type":"noun","meaning_category":"情報源"}]}