{"word":"Footville","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(架空の地名) フットビル","english_definition":"A fictional place name, often used humorously or generically to refer to a small, unremarkable town or a place associated with football (soccer or American football).","examples":[{"sentence":"Nothing exciting ever happens in Footville.","translation":"フットビルでは何も面白いことは起こらない。"},{"sentence":"The Footville High School football team won the championship.","translation":"フットビル高校のフットボールチームが選手権で優勝した。"}],"collocations":["Welcome to Footville","Footville High School"],"synonyms":["Smallville","Anytown","Podunk"],"antonyms":[]},{"part_of_speech":"noun","definition":"(実在の地名) アメリカ合衆国ウィスコンシン州の村","english_definition":"A village in Green County, Wisconsin, United States.","examples":[{"sentence":"Footville, Wisconsin, is a small village with a population of around 200 people.","translation":"ウィスコンシン州フットビルは、人口約200人の小さな村です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'foot' (likely referring to a measurement or distance, or possibly football) and 'ville' (from Latin 'villa', meaning town or village).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʊtvɪl/","syllables":"Foot-ville"},"inflection":{"notes":"Noun, plural is Footvilles."},"usage_notes":{"explanation":"'Footville' can refer to a real place (a village in Wisconsin) or a fictional, generic small town. When used fictionally, it often implies a lack of excitement or importance. It can also be associated with football, either soccer or American football, depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Footville for vacation.","correct":"✓ I'm going to Footville, Wisconsin, for vacation.","note":"If referring to the actual village, specify the state to avoid confusion."}],"priority":"★☆☆"},"related_words":{"derivatives":["Footvillian (noun: a resident of Footville)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, especially when used as a fictional place name.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Footville' is a place name that can be either real or fictional. As a real place, it refers to a village in Wisconsin. As a fictional place, it's often used humorously to represent a generic, unremarkable small town, similar to 'Smallville' or 'Anytown.' Its meaning is usually clear from context. When used in a fictional context, it often carries a connotation of being boring or insignificant. It may also imply a connection to football (soccer or American football)."},"example_sentences":[{"sentence":"Life in Footville is slow and peaceful.","translation":"フットビルでの生活はゆっくりと平和だ。","type":"fictional","meaning_category":"generic small town"},{"sentence":"The Footville Wildcats are known for their strong defense.","translation":"フットビル・ワイルドキャッツは、その強力なディフェンスで知られている。","type":"fictional","meaning_category":"associated with football"},{"sentence":"We drove through Footville on our way to Madison.","translation":"マディソンへ向かう途中、フットビルを通り過ぎた。","type":"real","meaning_category":"Wisconsin village"}]}