{"word":"spectroheliograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分光日面写真器","english_definition":"An instrument used to photograph the Sun in monochromatic light, typically using a narrow band of wavelengths selected by a spectroscope.","examples":[{"sentence":"The spectroheliograph revealed a large solar flare.","translation":"分光日面写真器は大きな太陽フレアを明らかにした。"},{"sentence":"Scientists use spectroheliographs to study the Sun's chromosphere.","translation":"科学者たちは分光日面写真器を使って太陽の彩層を研究する。"}],"collocations":["solar spectroheliograph","spectroheliograph image","spectroheliograph observation"],"synonyms":["spectroscope","telescope"],"antonyms":[]}],"etymology":{"value":"The word is a combination of 'spectro-' (from 'spectrum', referring to the separation of light into its constituent wavelengths), 'helio-' (from Greek 'helios' meaning 'sun'), and '-graph' (denoting an instrument for recording or writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspektroʊhiːliˈɒɡrɑːf/","syllables":"spec-tro-he-li-o-graph"},"inflection":{"noun_plural":"spectroheliographs"},"usage_notes":{"explanation":"A spectroheliograph is a specialized telescope used to create images of the Sun at specific wavelengths of light. This allows astronomers to study different layers of the Sun's atmosphere, such as the chromosphere, and to observe phenomena like solar flares and prominences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ spectroeliograph","correct":"✓ spectroheliograph","note":"Common misspelling: the correct spelling includes 'helio' referring to the sun."}],"priority":"★☆☆"},"related_words":{"derivatives":["spectroheliogram (noun: a photograph taken with a spectroheliograph)"],"related_terms":["spectroscopy","helioscope","chromosphere","solar flare"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'spectroheliograph' is highly technical and specialized, primarily used within the fields of astronomy and solar physics. Understanding requires familiarity with spectroscopy, solar observation techniques, and astronomical instrumentation. The word itself is complex and not commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The spectroheliograph at the observatory captured detailed images of the solar surface.","translation":"天文台の分光日面写真器は太陽表面の詳細な画像を捉えた。","type":"general"},{"sentence":"By tuning the spectroheliograph to the hydrogen-alpha line, they could observe the Sun's chromosphere.","translation":"分光日面写真器を水素アルファ線に調整することで、彼らは太陽の彩層を観測できた。","type":"technical"}]}