{"word":"sebolith","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A small, rounded mass of sebum and cellular debris found in skin pores.","english_definition":"A small, rounded mass of sebum and cellular debris found in skin pores.","examples":[{"sentence":"The dermatologist removed several seboliths from the patient's face.","translation":"皮膚科医は患者の顔からいくつかの脂腺栓を除去した。"},{"sentence":"Seboliths can contribute to the formation of acne.","translation":"脂腺栓はニキビの形成に寄与することがある。"}],"collocations":["remove seboliths","facial seboliths","skin seboliths"],"synonyms":["comedo","blackhead","whitehead"],"antonyms":[]}],"etymology":{"value":"Derived from 'sebo-' (referring to sebum, the oily secretion of sebaceous glands) and '-lith' (referring to a stone or hardened mass).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛbəlɪθ/","syllables":"se-bo-lith"},"inflection":{"noun_plural":"seboliths"},"usage_notes":{"explanation":"'Sebolith' is a technical term primarily used in dermatology to describe small, hardened plugs of sebum and dead skin cells that accumulate in the pores of the skin. These are often precursors to or components of comedones (blackheads and whiteheads).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a lot of seboliths on my face, so I use a strong soap.","correct":"✓ I have a lot of seboliths on my face, so I use a gentle cleanser.","note":"Strong soaps can irritate the skin and worsen the condition. A gentle cleanser is recommended."},{"incorrect":"✗ Seboliths are caused by bacteria.","correct":"✓ Seboliths are caused by a buildup of sebum and dead skin cells.","note":"While bacteria can contribute to acne, seboliths themselves are primarily composed of sebum and cellular debris."}],"priority":"★★☆"},"related_words":{"derivatives":["sebum","sebaceous","comedo","acne"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sebolith' is a relatively uncommon and technical term used in the field of dermatology to specifically describe a small, hardened mass composed of sebum and cellular debris that blocks skin pores. Understanding this term requires a familiarity with basic dermatological concepts and vocabulary related to skin conditions. It is not typically encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Microscopic examination revealed numerous seboliths within the dilated pores.","translation":"顕微鏡検査により、拡張した毛穴の中に多数の脂腺栓が認められた。","type":"noun","meaning_category":"dermatology"},{"sentence":"Topical retinoids can help to prevent the formation of seboliths.","translation":"局所レチノイドは脂腺栓の形成を防ぐのに役立つ。","type":"noun","meaning_category":"dermatology"},{"sentence":"The presence of seboliths is a common finding in patients with acne vulgaris.","translation":"脂腺栓の存在は、尋常性ざ瘡の患者によく見られる所見である。","type":"noun","meaning_category":"dermatology"}]}