{"word":"Corporification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"法人化、企業化","english_definition":"The act or process of becoming a corporation; the transformation of something into a corporate entity or structure.","examples":[{"sentence":"The corporification of the family farm led to increased efficiency but also a loss of tradition.","translation":"家族経営の農場の企業化は、効率の向上につながったが、伝統の喪失も招いた。"},{"sentence":"Critics argue that the corporification of healthcare prioritizes profit over patient care.","translation":"批判家たちは、医療の企業化は患者ケアよりも利益を優先すると主張している。"},{"sentence":"The corporification of the university has changed its focus from education to revenue generation.","translation":"大学の企業化は、その焦点を教育から収益の創出へと変えてしまった。"}],"collocations":["the corporification of education","the corporification of healthcare","the corporification of culture","complete corporification","rapid corporification"],"synonyms":["incorporation","privatization","commercialization","institutionalization"],"antonyms":["decorporatization","nationalization","communalization"]}],"etymology":{"value":"Derived from 'corporify' (to form into a corporation), which comes from 'corporation' + '-ify' (to make). 'Corporation' originates from the Latin 'corpus' (body).","priority":"★★☆"},"pronunciation":{"ipa":"/kɔːrpərɪfɪˈkeɪʃən/","syllables":"cor-po-ri-fi-ca-tion"},"inflection":{"noun_plural":"corporifications"},"usage_notes":{"explanation":"'Corporification' refers to the process of transforming something into a corporate structure, often involving the adoption of business practices and a focus on profit. It is often used in critical contexts to describe the perceived negative impacts of applying corporate models to non-profit or public sectors. It can also refer to the legal process of forming a corporation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corporification was very corporated.","correct":"✓ The corporification process was very thorough.","note":"Avoid using 'corporated' as an adjective. Use adjectives like 'thorough,' 'complete,' or 'extensive' to describe the corporification process."},{"incorrect":"✗ Corporification is when a person becomes a corporation.","correct":"✓ Corporification is when an entity or organization becomes a corporation.","note":"Corporification applies to entities or organizations, not individual people."}],"priority":"★★☆"},"related_words":{"derivatives":["corporify","corporatize","corporate","corporatism"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corporification' is a complex term used to describe the process of transforming an entity into a corporation or adopting corporate practices. It is often used in academic or critical discussions about the impact of business models on non-profit or public sectors. Understanding this term requires familiarity with concepts of corporate structure and business strategy."},"example_sentences":[{"sentence":"The corporification of the museum has led to an increase in ticket prices and a focus on blockbuster exhibits.","translation":"博物館の企業化は、チケット価格の上昇と大ヒット展覧会への注力につながった。","type":"general","meaning_category":"法人化、企業化"},{"sentence":"The corporification of the charity resulted in a more professional management structure but also a decline in volunteer involvement.","translation":"慈善団体の企業化は、より専門的な経営構造をもたらしたが、ボランティアの関与の低下も招いた。","type":"general","meaning_category":"法人化、企業化"},{"sentence":"The corporification of the local school system was met with resistance from parents and teachers.","translation":"地元の学校制度の企業化は、保護者や教師からの抵抗に遭った。","type":"general","meaning_category":"法人化、企業化"}]}