{"word":"jiltish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Inclined to jilt; given to discarding lovers or friends capriciously.","english_definition":"Having a tendency to jilt or abandon romantic partners or friends in a sudden and heartless manner.","examples":[{"sentence":"Her jiltish behavior left a trail of broken hearts.","translation":"彼女の気まぐれな行動は、多くの失恋を生んだ。"},{"sentence":"He had a reputation for being jiltish, always moving on to someone new.","translation":"彼は気まぐれで、いつも新しい相手に移るという評判があった。"}],"collocations":["jiltish behavior","jiltish attitude","jiltish nature"],"synonyms":["fickle","capricious","unfaithful","treacherous","unreliable"],"antonyms":["loyal","faithful","constant","reliable","steadfast"]}],"etymology":{"value":"Derived from the verb 'jilt,' meaning to reject or cast off a lover, with the suffix '-ish,' indicating a tendency or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɪltɪʃ/","syllables":"jilt-ish"},"inflection":{"adjective_forms":{"comparative":"more jiltish","superlative":"most jiltish"}},"usage_notes":{"explanation":"The adjective 'jiltish' describes someone who has a propensity to jilt others, meaning they are likely to reject or abandon their romantic partners or friends without much consideration. It implies a certain level of heartlessness or capriciousness in their relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was acting very jiltish towards his work.","correct":"✓ He was acting very carelessly towards his work.","note":"'Jiltish' specifically refers to relationships with people, not things like work. Use 'careless' or 'negligent' instead."},{"incorrect":"✗ She had a jiltish of ice cream.","correct":"✓ She had a craving for ice cream.","note":"'Jiltish' is not a noun and cannot be used to describe a craving. Use 'craving' or 'desire' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["jilt (verb, noun)","jilted (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jiltish' is a relatively uncommon word used to describe someone who tends to abandon or reject their romantic partners or friends in a sudden and uncaring way. It implies a lack of loyalty and a capricious nature in relationships. Because it's not a frequently used word, it's more likely to be encountered in literature or more formal writing.","priority":"★★☆"},"example_sentences":[{"sentence":"Her jiltish tendencies made it difficult for her to maintain long-term relationships.","translation":"彼女の気まぐれな性格のせいで、長期的な関係を維持することが難しかった。","type":"adjective","meaning_category":"Inclined to jilt"},{"sentence":"The character was portrayed as having a jiltish disregard for the feelings of others.","translation":"そのキャラクターは、他人の気持ちを顧みない気まぐれな人物として描かれていた。","type":"adjective","meaning_category":"Inclined to jilt"}]}