{"word":"Descendentalist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"超越論者（ちょうえつろんしゃ）のパロディまたは風刺。超越論者の理想や信念を批判的または皮肉的に模倣する人。","english_definition":"A parody or satire of a transcendentalist; someone who critically or ironically imitates the ideals and beliefs of transcendentalists.","examples":[{"sentence":"The author described the character as a 'descendentalist' because he rejected all forms of idealism and sought only the most basic, material aspects of life.","translation":"著者は、その登場人物を「ディセンデンタリスト」と表現した。なぜなら、彼はあらゆる形態の理想主義を拒否し、最も基本的で物質的な生活の側面のみを求めていたからだ。"},{"sentence":"Some critics viewed the movement as a form of descendentalism, mocking the earnestness of the original transcendentalists.","translation":"一部の批評家は、その運動をディセンデンタリズムの一形態と見なし、元の超越論者の真剣さを嘲笑した。"}],"collocations":["descendentalist movement","descendentalist philosophy","anti-transcendentalist"],"synonyms":["anti-transcendentalist","realist","materialist","cynic"],"antonyms":["transcendentalist","idealist","romantic"],"notes":["The term is often used humorously or critically to contrast with transcendentalism."]}],"etymology":{"value":"A blend of 'descend' (to move downward) and 'transcendentalist' (one who believes in the inherent goodness of people and nature). The implication is a movement 'down' from the lofty ideals of transcendentalism to a more grounded or cynical perspective.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˌsɛn.dəˈtæl.ɪst/","syllables":"de-scen-den-tal-ist"},"inflection":{"noun_plural":"Descendentalists"},"usage_notes":{"explanation":"'Descendentalist' is not a widely recognized or formally defined term in philosophy or literature. It is primarily used in a satirical or critical context to describe someone who rejects or mocks the principles of transcendentalism. It suggests a movement away from the idealistic and spiritual views of transcendentalism toward a more practical, materialistic, or cynical outlook.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was a descendentalist, believing in the power of intuition and nature.","correct":"He was a transcendentalist, believing in the power of intuition and nature.","note":"Descendentalism is the opposite of transcendentalism. Transcendentalists value intuition and nature, while descendentalists reject these ideals."}],"priority":"★★☆"},"related_words":{"derivatives":["descendentalism (noun: The philosophy or attitude of a descendentalist.)"],"related_concepts":["Transcendentalism","Realism","Materialism","Cynicism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard term)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Descendentalist' is a niche concept primarily used in literary criticism or philosophical discussions to describe a satirical or critical stance against Transcendentalism. It implies a rejection of idealistic and spiritual beliefs in favor of a more grounded, realistic, or cynical perspective. Understanding this term requires familiarity with Transcendentalism and its core tenets."},"example_sentences":[{"sentence":"The author's descendentalist approach stripped away the romanticism often associated with nature, portraying it as harsh and indifferent.","translation":"著者のディセンデンタリスト的なアプローチは、自然にありがちなロマンチシズムを取り除き、自然を厳しく無関心なものとして描いた。","type":"noun","meaning_category":"parody of transcendentalist"},{"sentence":"He was labeled a descendentalist because he constantly questioned the sincerity of those who claimed to be enlightened.","translation":"彼は啓発されたと主張する人々の誠実さを常に疑っていたため、ディセンデンタリストとレッテルを貼られた。","type":"noun","meaning_category":"parody of transcendentalist"}]}