{"word":"paranematic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(liquid crystal) Exhibiting short-range orientational order, but lacking long-range orientational order.","english_definition":"Describing a state of matter, specifically a liquid crystal, that exhibits short-range orientational order, but lacks long-range orientational order. This means that the molecules tend to align with their neighbors over short distances, but this alignment does not extend throughout the entire material.","examples":[{"sentence":"The material exhibited paranematic behavior at temperatures just above the nematic transition.","translation":"その物質は、ネマチック転移のすぐ上の温度でパラネマチックな挙動を示した。"},{"sentence":"The paranematic phase is characterized by fluctuations in the director field.","translation":"パラネマチック相は、ディレクター場の変動によって特徴づけられる。"}],"collocations":["paranematic phase","paranematic order","paranematic fluctuations","exhibit paranematic behavior"],"synonyms":["short-range order","pre-nematic","local order"],"antonyms":["nematic","smectic","long-range order"]}],"etymology":{"value":"From the prefix 'para-' (beside, near) and 'nematic' (a type of liquid crystal). The term suggests a state that is 'near' or 'related to' the nematic phase, but not fully ordered in the same way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærənɪˈmætɪk/","syllables":"par-a-ne-mat-ic"},"inflection":{"notes":"Comparative and superlative forms are possible but rare (more paranematic, most paranematic)."},"usage_notes":{"explanation":"The term 'paranematic' is primarily used in the context of liquid crystal physics and materials science. It describes a state of matter that is intermediate between an isotropic liquid (no orientational order) and a nematic liquid crystal (long-range orientational order). The paranematic phase is often observed near the transition temperature between these two phases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substance was completely paranematic.","correct":"✓ The substance exhibited paranematic behavior.","note":"'Paranematic' describes a *behavior* or *state*, not an absolute property. It's more accurate to say a substance 'exhibits paranematic behavior' rather than saying it 'is paranematic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nematic","smectic","cholesteric","liquid crystal","order parameter","director"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized scientific terminology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paranematic' is a highly specialized term used in liquid crystal physics to describe a state of matter where molecules exhibit local alignment but lack long-range order. Understanding this term requires familiarity with the concepts of liquid crystals, orientational order, and phase transitions. It is typically encountered in advanced scientific literature and research.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researchers investigated the pre-transitional paranematic effects in the liquid crystal mixture.","translation":"研究者たちは、液晶混合物における転移前のパラネマチック効果を調査した。","type":"adjective","meaning_category":"liquid crystal physics"},{"sentence":"The intensity of the scattered light increased in the paranematic regime.","translation":"散乱光の強度は、パラネマチック領域で増加した。","type":"adjective","meaning_category":"liquid crystal physics"}]}