{"word":"enlarging-gazed","priority":"low","meanings":[{"part_of_speech":"verb (past participle/adjective)","definition":"Having gazed with enlarging eyes, typically expressing surprise, wonder, or intense interest.","english_definition":"Having looked intently with widened eyes, usually indicating surprise, wonder, or intense interest. This is a descriptive term combining the action of 'enlarging' (widening) the eyes with the act of 'gazing' (looking intently).","examples":[{"sentence":"The child, enlarging-gazed, watched the magician pull a rabbit from the hat.","translation":"目を大きく見開いた子供は、マジシャンが帽子からウサギを取り出すのを見ていた。"},{"sentence":"Enlarging-gazed, she stared at the breathtaking view from the mountaintop.","translation":"彼女は目を大きく見開き、山頂からの息をのむような景色をじっと見つめた。"}],"collocations":["enlarging-gazed at","enlarging-gazed upon","enlarging-gazed expression"],"synonyms":["wide-eyed","staring","gaping","astonished-looking","wondering"],"antonyms":["narrow-eyed","unimpressed","bored","indifferent"],"usage_notes":{"explanation":"This term is a compound adjective formed from the present participle 'enlarging' and the past participle 'gazed.' It is used to describe someone's expression or manner of looking. It's not a common term, but it effectively conveys a sense of awe or surprise. It implies not just looking, but looking with eyes that are widened in response to something remarkable.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The enlarging-gazed saw the movie.","correct":"The enlarging-gazed child saw the movie.","note":"'Enlarging-gazed' is descriptive; it needs a noun to describe (e.g., 'child,' 'person'). It's not a noun itself."},{"incorrect":"He was enlarging-gazed because he was happy.","correct":"He was enlarging-gazed because he was surprised.","note":"The term usually implies surprise, wonder, or intense interest, not just general happiness."}],"priority":"medium"},"related_words":{"derivatives":["enlarge","gaze","gazing","enlarged"],"phrases":["with enlarging eyes","with a gazing expression"],"priority":"low"},"level_frequency":{"CEFR":"C2 (rare and descriptive)","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Enlarging-gazed' is a descriptive term used to portray a specific facial expression. It indicates that someone is looking intently with widened eyes, typically due to surprise, wonder, or intense interest. The term is not commonly used in everyday conversation but is more likely to appear in descriptive writing to create a vivid image of a character's reaction. It combines the action of 'enlarging' (widening) the eyes with the act of 'gazing' (looking intently)."},"example_sentences":[{"sentence":"The audience, enlarging-gazed, watched the incredible acrobatic performance.","translation":"観客は目を大きく見開き、信じられないようなアクロバットの演技を見ていた。","type":"descriptive adjective","meaning_category":"expressing wonder"},{"sentence":"Enlarging-gazed, the tourist admired the ancient architecture of the cathedral.","translation":"目を大きく見開いた観光客は、大聖堂の古代建築を感嘆した。","type":"descriptive adjective","meaning_category":"expressing admiration"},{"sentence":"The children stood, enlarging-gazed, as the fireworks lit up the night sky.","translation":"子供たちは目を大きく見開き、花火が夜空を照らすのを見て立っていた。","type":"descriptive adjective","meaning_category":"expressing awe"}]}],"etymology":{}}