{"word":"lysogenic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"溶原性の","english_definition":"Relating to or capable of lysogeny.","examples":[{"sentence":"The phage can exist in either a lytic or a lysogenic state.","translation":"そのファージは、溶解性または溶原性のいずれかの状態で存在できます。"},{"sentence":"Lysogenic conversion can alter the phenotype of the host bacterium.","translation":"溶原性転換は、宿主細菌の表現型を変化させる可能性があります。"}],"collocations":["lysogenic cycle","lysogenic bacteria","lysogenic conversion","lysogenic phage"],"synonyms":["temperate","non-lytic"],"antonyms":["lytic","virulent"],"notes":"Used in the context of virology and microbiology."}],"etymology":{"value":"From 'lyso-' (relating to lysis or dissolution) + '-genic' (producing or generating).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlaɪsəˈdʒɛnɪk/","syllables":"ly-so-gen-ic"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"'Lysogenic' primarily describes a state or process in which a virus (typically a bacteriophage) integrates its DNA into the host cell's DNA without immediately causing the host cell to lyse (burst). The viral DNA replicates along with the host DNA and can later enter a lytic cycle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria was lysogenic.","correct":"✓ The bacterium was lysogenic.","note":"'Bacteria' is plural; 'bacterium' is singular. The adjective 'lysogenic' describes the bacterium or the state it is in."}],"priority":"★★☆"},"related_words":{"derivatives":["lysogeny (noun): The state of a bacterial cell when a temperate bacteriophage has integrated into the host chromosome.","prophage (noun): The viral DNA integrated into the host DNA in lysogeny.","lytic (adjective): Relating to lysis, the bursting of a cell."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Lysogenic' is a technical term used in biology, specifically in virology and microbiology. It describes a state where a virus integrates its genetic material into a host cell's genome without immediately causing cell lysis. Understanding this term requires a background in molecular biology."},"example_sentences":[{"sentence":"The lambda phage is a well-studied example of a virus capable of establishing a lysogenic infection.","translation":"ラムダファージは、溶原性感染を確立できるウイルスのよく研究された例です。","type":"general"},{"sentence":"During the lysogenic cycle, the viral DNA is replicated along with the host cell's DNA.","translation":"溶原性サイクル中、ウイルスDNAは宿主細胞のDNAとともに複製されます。","type":"general"}]}