{"word":"Meherrin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メヘリン族（北米の先住民族）","english_definition":"A Native American tribe originally located in what is now North Carolina and Virginia.","examples":[{"sentence":"The Meherrin people were known for their agricultural skills.","translation":"メヘリン族は農業技術で知られていた。"},{"sentence":"The Meherrin tribe is now recognized by the state of North Carolina.","translation":"メヘリン族は現在、ノースカロライナ州によって認定されている。"}],"collocations":["Meherrin tribe","Meherrin Nation","Meherrin River"],"synonyms":["none"],"antonyms":["none"]},{"part_of_speech":"noun","definition":"メヘリン川（アメリカ合衆国の川）","english_definition":"A river in the United States that flows through Virginia and North Carolina.","examples":[{"sentence":"The Meherrin River is a tributary of the Chowan River.","translation":"メヘリン川はチョーワン川の支流である。"},{"sentence":"Kayaking on the Meherrin River is a popular activity.","translation":"メヘリン川でのカヤックは人気のあるアクティビティである。"}],"collocations":["Meherrin River","Meherrin River basin"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"The name 'Meherrin' is believed to be derived from a Native American language, possibly meaning 'people of the muddy water'.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈhɛrɪn/","syllables":"muh-her-rin"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"'Meherrin' refers to both a Native American tribe and a river in the United States. When referring to the tribe, it can also be called the 'Meherrin Nation'. The river is a geographical feature in Virginia and North Carolina.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Meherrin are a river.","correct":"✓ The Meherrin are a tribe.","note":"'Meherrin' can refer to both a tribe and a river, but it's important to use the correct term depending on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["none"],"phrasal_verbs":["none"],"related_terms":["Native American","Indigenous peoples","Virginia","North Carolina"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Meherrin' is a proper noun referring to a specific Native American tribe and a river in the United States. It is not a commonly used word and would primarily appear in contexts related to the history and geography of Virginia and North Carolina or in discussions about Native American tribes. Understanding the context is essential to correctly interpret the meaning of 'Meherrin'."},"example_sentences":[{"sentence":"The history of the Meherrin tribe is rich and complex.","translation":"メヘリン族の歴史は豊かで複雑である。","type":"noun","meaning_category":"メヘリン族"},{"sentence":"The Meherrin River provides important habitat for local wildlife.","translation":"メヘリン川は地元の野生生物にとって重要な生息地を提供している。","type":"noun","meaning_category":"メヘリン川"}]}