{"word":"relaunder","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To launder again.","english_definition":"To launder (money, etc.) again, especially after it has already been laundered once.","examples":[{"sentence":"The criminals attempted to relaunder the money through a series of offshore accounts.","translation":"犯罪者たちは、一連のオフショア口座を通じて資金を再度洗浄しようと試みた。"},{"sentence":"Authorities discovered that the funds had been relaundered to obscure their original source.","translation":"当局は、資金の元の出所を隠蔽するために資金が再洗浄されたことを発見した。"}],"collocations":["relaunder money","relaunder funds","relaunder proceeds"],"synonyms":["re-launder","launder again"],"antonyms":[]}],"etymology":{"value":"Formed by adding the prefix \"re-\" to \"launder\".","priority":"N/A"},"pronunciation":{"ipa":"/ˌriːˈlɔːndər/","syllables":"re-laun-der"},"inflection":{"verb_forms":{"present_simple":["relaunder","relaunders"],"past_simple":"relaundered","past_participle":"relaundered","present_participle":"relaundering"}},"usage_notes":{"explanation":"The term \"relaunder\" is primarily used in the context of financial crime, specifically referring to the process of laundering money that has already been laundered once before. This is often done to further obscure the original source of the funds and make it more difficult for law enforcement to trace them.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["relaundering (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'relaunder' is a specialized term primarily used in the context of financial crime. It refers to the act of laundering money or assets that have already undergone the laundering process at least once. This is typically done to further obscure the origin of the funds and make it more difficult to trace them back to their illegal source. Due to its specific and technical nature, the word is not commonly used in everyday language and is more likely to be encountered in legal, financial, or journalistic contexts related to money laundering investigations."},"example_sentences":[{"sentence":"The investigation revealed that the illicit profits were first laundered through shell corporations and then relaundered through real estate investments.","translation":"調査により、不正な利益はまずペーパーカンパニーを通じて洗浄され、その後、不動産投資を通じて再洗浄されたことが明らかになった。","type":"verb","meaning_category":"to launder again"},{"sentence":"The process of relaundering money often involves complex international transactions designed to evade detection.","translation":"資金の再洗浄のプロセスには、検出を回避するように設計された複雑な国際取引が伴うことが多い。","type":"verb","meaning_category":"to launder again"}]}