{"word":"seismography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"地震学、地震記録学","english_definition":"The study or science of earthquakes and related phenomena; the art or science of recording earthquakes and interpreting the records.","examples":[{"sentence":"Seismography is crucial for understanding plate tectonics.","translation":"地震学はプレートテクトニクスを理解する上で非常に重要です。"},{"sentence":"Modern seismography uses advanced instruments to detect even the smallest tremors.","translation":"現代の地震記録学では、最新の機器を使用して、ごくわずかな揺れも検出します。"}],"collocations":["applied seismography (応用地震学)","exploration seismography (探査地震学)"],"synonyms":["seismology","earthquake science"],"antonyms":[]}],"etymology":{"value":"From 'seismo-' (referring to earthquakes) + '-graphy' (the process of recording or describing). 'Seismo-' comes from the Greek word 'seismos' meaning 'earthquake' or 'shock'. '-graphy' comes from the Greek word 'graphein' meaning 'to write' or 'to record'.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪzˈmɒɡrəfi/","syllables":"seis-mog-ra-phy"},"inflection":{"noun_plural":"seismographies"},"usage_notes":{"explanation":"'Seismography' refers both to the scientific study of earthquakes and the technique of recording and interpreting seismic waves. It encompasses the use of seismographs to detect and measure ground motion caused by earthquakes, volcanic eruptions, and other sources. The term is often used interchangeably with 'seismology', although 'seismology' generally refers to the broader field of earthquake science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies seismograph.","correct":"✓ He studies seismography.","note":"'Seismograph' is the instrument used to record earthquakes, while 'seismography' is the study or science of earthquakes."},{"incorrect":"✗ Seismography is only about predicting earthquakes.","correct":"✓ Seismography involves studying and recording earthquakes, but it doesn't guarantee prediction.","note":"While seismography helps in understanding earthquakes, it doesn't provide a reliable method for predicting them."}],"priority":"★★☆"},"related_words":{"derivatives":["seismograph (地震計)","seismogram (地震記録)","seismologist (地震学者)","seismic (地震の、地震性の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Seismography' is a technical term related to the study of earthquakes. It involves the use of instruments called seismographs to record and analyze seismic waves. Understanding this term requires some background knowledge in earth science and physics. It's often used in scientific and academic contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The data from the seismography station helped pinpoint the epicenter of the earthquake.","translation":"地震記録観測所のデータは、地震の震源地を特定するのに役立ちました。","type":"noun","meaning_category":"地震学"},{"sentence":"Advancements in seismography have greatly improved our ability to monitor seismic activity.","translation":"地震記録学の進歩により、地震活動を監視する能力が大幅に向上しました。","type":"noun","meaning_category":"地震記録学"}]}