{"word":"Scovy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of duck, specifically the Muscovy duck.","english_definition":"A Muscovy duck.","examples":[{"sentence":"We saw several Scovies at the park today.","translation":"今日公園で何羽かのスコヴィーを見ました。"},{"sentence":"The Scovy duck is known for its distinctive red face.","translation":"スコヴィーダックは特徴的な赤い顔で知られています。"}],"collocations":["Scovy duck","wild Scovy","domestic Scovy"],"synonyms":["Muscovy duck","Cairina moschata"],"antonyms":[]}],"etymology":{"value":"Likely a corruption or alteration of \"Muscovy,\" referring to the region historically associated with the duck, although the exact origin is debated.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈskoʊvi/","syllables":"Sco-vy"},"inflection":{"noun_plural":"Scovies"},"usage_notes":{"explanation":"'Scovy' is a less common, regional, or colloquial term for the Muscovy duck. While 'Muscovy duck' is the more widely recognized and formal name, 'Scovy' may be used in certain areas or by certain groups of people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Muscovy, it was a Scovy duck.","correct":"✓ I saw a Muscovy duck, also known as a Scovy.","note":"Muscovy duck is the more common and formal name."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Scovy' is a relatively uncommon term, primarily used in specific regions or by individuals familiar with waterfowl. Understanding its equivalence to 'Muscovy duck' is key to interpreting its meaning in context. Due to its limited usage, it's not typically encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The old farmer kept a flock of Scovies in his backyard.","translation":"その老農夫は裏庭でスコヴィーの群れを飼っていた。","type":"noun","meaning_category":"Type of duck"},{"sentence":"The Scovy's call is quite distinct from other ducks.","translation":"スコヴィーの鳴き声は他のアヒルとはかなり異なっている。","type":"noun","meaning_category":"Type of duck"}]}