{"word":"recusator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) (特にエリザベス朝時代の) 国教忌避者、カトリック教徒でイングランド国教会への出席を拒否した人","english_definition":"(historical) A person, especially during the reign of Elizabeth I, who refused to attend Anglican services; a Catholic who refused to attend Church of England services.","examples":[{"sentence":"The recusators faced heavy fines and social ostracism.","translation":"国教忌避者は高額な罰金と社会的排斥に直面した。"},{"sentence":"Many recusator families maintained their faith in secret.","translation":"多くの国教忌避者の家族は密かに信仰を守り続けた。"}],"collocations":["Catholic recusator","Elizabethan recusator","recusant family","recusancy laws"],"synonyms":["dissenter","nonconformist","refuser","objector"],"antonyms":["conformist","Anglican"]},{"part_of_speech":"noun","definition":"(一般的に) 拒否者、反対者","english_definition":"A person who refuses or objects to something.","examples":[{"sentence":"He was labeled a recusator for his opposition to the new policy.","translation":"彼は新政策への反対のために拒否者というレッテルを貼られた。"}],"collocations":["policy recusator","law recusator"],"synonyms":["objector","opposer","rejecter","denier"],"antonyms":["accepter","supporter","approver"]}],"etymology":{"value":"Late Latin *recusator*, from Latin *recusare* 'to refuse, reject'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛkjʊzeɪtər/","syllables":"re-cu-sa-tor"},"inflection":{"noun_plural":"recusators"},"usage_notes":{"explanation":"The term \"recusator\" specifically refers to individuals, primarily English Catholics during the Elizabethan era and afterward, who refused to attend compulsory Anglican church services. This refusal, known as \"recusancy,\" was a crime punishable by fines, imprisonment, and other penalties. While the term can be used more broadly to describe someone who refuses or objects to something, its primary and most common usage is within the historical context of religious nonconformity in England.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a recusator because he didn't like any religion.","correct":"✓ He was a recusator because he was Catholic and refused to attend Anglican services.","note":"A recusator specifically refused to attend Anglican services, usually because they were Catholic. It's not just a general dislike of religion."},{"incorrect":"✗ Recusators were common in modern England.","correct":"✓ Recusators were common in Elizabethan England.","note":"Recusancy was a significant issue historically, particularly during the Elizabethan and Stuart periods. It's not a common phenomenon in modern times."}],"priority":"★★☆"},"related_words":{"derivatives":["recusancy (noun: the state or act of being a recusant)","recusant (adjective: refusing to conform; noun: a recusator)"],"historical_terms":["Popish recusant (a Catholic recusator)","Statutory recusant (someone convicted under recusancy laws)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"recusator\" is a specialized term primarily used in historical contexts, specifically referring to individuals in England who refused to attend Anglican church services, particularly during the Elizabethan era due to their Catholic faith. It is not a commonly used word in modern English, and understanding its meaning requires familiarity with English history and religious nonconformity. While it can be used more generally to describe someone who refuses or objects, this usage is rare."},"example_sentences":[{"sentence":"The Elizabethan government imposed harsh penalties on known recusators.","translation":"エリザベス朝政府は、知られている国教忌避者に厳しい罰則を課した。","type":"noun","meaning_category":"国教忌避者"},{"sentence":"The family's recusator past was a closely guarded secret.","translation":"その家族の国教忌避者の過去は、厳重に守られた秘密だった。","type":"noun","meaning_category":"国教忌避者"},{"sentence":"He became a recusator when the new regulations were imposed.","translation":"彼は新しい規制が課されたとき、拒否者になった。","type":"noun","meaning_category":"拒否者"}]}