{"word":"benben","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(古代エジプト)ベンベン石：太陽神アトゥムが創造の丘に最初に現れたとされる聖なる石。ピラミディオン（ピラミッドの頂上石）の原型。","english_definition":"(Ancient Egypt) The benben stone: a sacred stone in ancient Egypt, said to be the mound that arose from the primordial waters upon which the creator god Atum first stood. It was the prototype for the pyramidion (capstone) of pyramids.","examples":[{"sentence":"The benben stone was a symbol of creation and rebirth.","translation":"ベンベン石は創造と再生の象徴でした。"},{"sentence":"The pyramidion was often shaped like a benben stone.","translation":"ピラミディオンはしばしばベンベン石のような形をしていました。"}],"collocations":["benben stone","pyramidion","Atum","creation myth"],"synonyms":["pyramidion","capstone"],"antonyms":[]}],"etymology":{"value":"From Egyptian *bn-bn*. The exact meaning is debated, but it's associated with the verb *weben* meaning 'to rise in brilliance'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɛnbɛn/","syllables":"ben-ben"},"inflection":{"noun_plural":"benbens"},"usage_notes":{"explanation":"The term 'benben' is primarily used in the context of ancient Egyptian religion and archaeology. It refers to a specific type of sacred stone and is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He found a benben in his backyard.","correct":"✓ The archaeologist discovered a benben stone during the excavation.","note":"Benben stones are rare archaeological artifacts, not something commonly found."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["Atum","Ra","Egyptian mythology","pyramid","obelisk"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in academic or specialized contexts related to Egyptology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'benben' is a specialized term primarily encountered in the study of ancient Egyptian religion and architecture. It refers to a specific sacred stone with symbolic significance in the Egyptian creation myth. Understanding the term requires familiarity with Egyptian mythology and archaeological contexts."},"example_sentences":[{"sentence":"The golden pyramidion atop the obelisk was shaped like a benben.","translation":"オベリスクの頂上にある金のピラミディオンはベンベンの形をしていた。","type":"noun","meaning_category":"sacred stone"},{"sentence":"Scholars believe the benben stone was associated with the sun god Ra.","translation":"学者たちはベンベン石が太陽神ラーと関連していたと考えている。","type":"noun","meaning_category":"sacred stone"}]}