{"word":"Shingleback","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(オーストラリアの) ソーラーテイルスキンク (Tiliqua rugosa)","english_definition":"A large, slow-moving Australian lizard (Tiliqua rugosa) with a short, stumpy tail that resembles its head.","examples":[{"sentence":"The shingleback is easily recognized by its stumpy tail and rough scales.","translation":"ソーラーテイルスキンクは、ずんぐりした尾とざらざらした鱗で簡単に見分けられます。"},{"sentence":"Shinglebacks are often seen basking in the sun on roadsides.","translation":"ソーラーテイルスキンクは、道路脇で日光浴をしているのをよく見かけます。"}],"collocations":["blue-tongued skink","Australian wildlife","reptiles of Australia"],"synonyms":["stumpy-tailed skink","pinecone lizard","sleepy lizard"],"antonyms":[]}],"etymology":{"value":"The name 'shingleback' refers to the lizard's rough, overlapping scales that resemble roof shingles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪŋɡəlˌbæk/","syllables":"shing-gle-back"},"inflection":{"noun_plural":"shinglebacks"},"usage_notes":{"explanation":"'Shingleback' is a common name for the *Tiliqua rugosa* lizard, native to Australia. They are known for their distinctive appearance, including a short, broad tail that can be mistaken for their head. They are also called 'stumpy-tailed skinks' or 'pinecone lizards'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a shingleback snake in the garden.","correct":"✓ I saw a shingleback lizard in the garden.","note":"Shinglebacks are lizards, not snakes."},{"incorrect":"✗ The shingleback has a long, slender tail.","correct":"✓ The shingleback has a short, stumpy tail.","note":"Shinglebacks are known for their short, stumpy tails."}],"priority":"★★☆"},"related_words":{"derivatives":["blue-tongued skink (related species)","skink (general term for lizards in the family Scincidae)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'shingleback' refers to a specific species of lizard found in Australia. Understanding this term requires some familiarity with Australian wildlife. The name itself is descriptive of the lizard's appearance, which can aid in recall. However, its relatively low frequency makes it less common in general English conversation."},"example_sentences":[{"sentence":"The **shingleback** is a fascinating reptile found in arid regions of Australia.","translation":"ソーラーテイルスキンクは、オーストラリアの乾燥地帯で見られる魅力的な爬虫類です。","type":"noun","meaning_category":"description"},{"sentence":"We spotted a **shingleback** crossing the road during our outback adventure.","translation":"奥地の冒険中に、ソーラーテイルスキンクが道路を横断しているのを見つけました。","type":"noun","meaning_category":"observation"}]}