{"word":"ammonic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"アンモニアの、アンモニウムの","english_definition":"Relating to or containing ammonia or ammonium.","examples":[{"sentence":"Ammonic fertilizers are commonly used in agriculture.","translation":"アンモニア肥料は農業で一般的に使用されています。"},{"sentence":"The soil sample showed a high level of ammonic nitrogen.","translation":"土壌サンプルは高レベルのアンモニア態窒素を示しました。"}],"collocations":["ammonic fertilizer","ammonic nitrogen","ammonic compound"],"synonyms":["ammonium","ammoniacal"],"antonyms":[]}],"etymology":{"value":"Derived from 'ammonia' + '-ic'. Ammonia itself comes from the Latin 'sal ammoniacus', referring to ammonium chloride, which was originally obtained near the temple of Jupiter Ammon in ancient Egypt.","priority":"★★★"},"pronunciation":{"ipa":"/əˈmɒnɪk/","syllables":"am-mon-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Ammonic' is an adjective describing something related to or containing ammonia or ammonium compounds. It is often used in scientific or technical contexts, particularly in chemistry, agriculture, and environmental science. It is important to distinguish 'ammonic' from 'ammonia' (the compound itself) and 'ammonium' (the cation NH₄⁺).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The ammonic is a gas.","correct":"Ammonia is a gas.","note":"'Ammonic' is an adjective, not a noun. Use 'ammonia' as the noun to refer to the gas itself."},{"incorrect":"The soil contains ammonium, so it is ammonic.","correct":"The soil contains ammonium compounds, so it has ammonic properties.","note":"'Ammonic' describes properties or characteristics related to ammonia or ammonium, not the presence of ammonium itself."}],"priority":"★★☆"},"related_words":{"derivatives":["ammonia","ammonium","ammonification"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ammonic' is a technical term predominantly used in scientific and agricultural contexts. Understanding requires familiarity with basic chemistry concepts, particularly the nature of ammonia and ammonium compounds. Usage is typically limited to specialized fields."},"example_sentences":[{"sentence":"The ammonic content of the fertilizer was carefully measured.","translation":"肥料のアンモニア含有量は慎重に測定されました。","type":"adjective","meaning_category":"chemical composition"},{"sentence":"Ammonic pollution can negatively impact aquatic ecosystems.","translation":"アンモニア汚染は水生生態系に悪影響を与える可能性があります。","type":"adjective","meaning_category":"environmental impact"}]}