{"word":"live-sawed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(木材が)柾目挽きの","english_definition":"(of lumber) sawn so that the growth rings are approximately parallel to the wide surface of the board.","examples":[{"sentence":"Live-sawed lumber is often used for rustic furniture.","translation":"柾目挽きの木材は、しばしば素朴な家具に使われる。"},{"sentence":"The table was made from live-sawed oak.","translation":"そのテーブルは柾目挽きのオーク材で作られていた。"}],"collocations":["live-sawed lumber","live-sawed oak","live-sawed pine"],"synonyms":["flat-sawn","plain-sawn"],"antonyms":["quarter-sawn","rift-sawn"]}],"etymology":{"value":"The term 'live-sawed' refers to the method of sawing a log straight through without changing its orientation, resulting in a mix of grain patterns in the boards.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪv.sɔːd/","syllables":"live-sawed"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Live-sawed' lumber, also known as 'flat-sawn' or 'plain-sawn', is the most common and economical method of sawing logs into boards. This method yields boards with a mix of grain patterns, including tangential and radial grain. It is less stable than quarter-sawn lumber and more prone to cupping and warping.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The live-sawed wood is more expensive.","correct":"✓ The live-sawed wood is less expensive.","note":"Live-sawed lumber is generally less expensive than quarter-sawn lumber due to the efficiency of the sawing method."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["flat-sawn","plain-sawn","quarter-sawn","rift-sawn","lumber","woodworking"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Live-sawed' is a term used in woodworking to describe a specific way of cutting lumber from a log. It means the log is sawn straight through without rotating it, which results in boards with a mix of grain patterns. This method is common because it's efficient and produces a lot of lumber, but the wood is often less stable than wood cut using other methods like quarter-sawing.","priority":"★★☆"},"example_sentences":[{"sentence":"The rustic charm of the cabin was enhanced by the use of live-sawed pine boards.","translation":"その小屋の素朴な魅力は、柾目挽きの松材の使用によって高められた。","type":"example","meaning_category":"description"},{"sentence":"For this project, we chose live-sawed lumber because of its affordability and availability.","translation":"このプロジェクトでは、手頃な価格と入手しやすさから、柾目挽きの木材を選んだ。","type":"example","meaning_category":"choice"}]}