{"word":"semilichen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)不完全地衣類：地衣類の初期段階、または地衣類と共生する藻類が少ない状態の菌類。","english_definition":"(botany) An imperfect lichen; a fungus in the early stages of lichenization, or one in which the algal symbiont is scarce.","examples":[{"sentence":"The semilichen was observed to have a thin fungal layer.","translation":"その不完全地衣類は、薄い菌類の層を持つことが観察された。"},{"sentence":"Some fungi exist as semilichen before fully developing into a lichen.","translation":"いくつかの菌類は、完全に地衣類に発達する前に不完全地衣類として存在する。"}],"collocations":["observe a semilichen","study semilichen development"],"synonyms":["protolichen","imperfect lichen"],"antonyms":[]}],"etymology":{"value":"'Semi-' (半分、不完全) + 'lichen' (地衣類)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmɪˈlaɪkən/","syllables":"se-mi-li-chen"},"inflection":{"noun_plural":"semilichenes"},"usage_notes":{"explanation":"The term 'semilichen' is primarily used in botany and mycology to describe a specific state of fungal-algal symbiosis. It is not a commonly used word outside of these scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The semilichen is a type of animal.","correct":"✓ The semilichen is a type of fungus.","note":"Semilichen are related to fungi, not animals."}],"priority":"★★★"},"related_words":{"derivatives":["lichen","lichenization","protolichen"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'semilichen' is a highly specialized term used within the fields of botany and mycology. Understanding requires knowledge of symbiotic relationships, particularly those involving fungi and algae in the formation of lichens. The prefix 'semi-' indicates an incomplete or partial state, suggesting an understanding of Latin prefixes is also beneficial."},"example_sentences":[{"sentence":"The presence of semilichen indicates a potential for future lichen development in the area.","translation":"不完全地衣類の存在は、その地域における将来の地衣類の発達の可能性を示している。","type":"noun","meaning_category":"botany"}]}