{"word":"Benzoylated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ベンゾイル化された","english_definition":"Having undergone benzoylation, a chemical process where a benzoyl group (C6H5CO-) is introduced into a molecule.","examples":[{"sentence":"The benzoylated derivative showed increased stability.","translation":"そのベンゾイル化された誘導体は、安定性が向上していることを示した。"},{"sentence":"A benzoylated sugar was used in the synthesis.","translation":"合成において、ベンゾイル化された糖が使用された。"}],"collocations":["benzoylated derivative","benzoylated sugar","benzoylated compound"],"synonyms":["benzoyl derivative"],"antonyms":[]}],"etymology":{"value":"Derived from 'benzoyl' (the chemical group C6H5CO-) and the suffix '-ated', indicating the addition or incorporation of that group.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbenzɔɪleɪtɪd/","syllables":"Ben-zo-yl-a-ted"},"inflection":{"notes":"This is the past participle form used as an adjective. The verb form is 'benzoylate'."},"usage_notes":{"explanation":"'Benzoylated' is a technical term primarily used in chemistry. It describes a molecule that has been modified by the addition of a benzoyl group. This process, called benzoylation, is often used to protect functional groups or to modify the properties of a molecule.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The benzoylated water was clear.","correct":"✓ The water was treated with benzoyl chloride.","note":"Benzoylation typically applies to organic compounds, not simple substances like water. The correct usage would describe the process of treating a substance with a benzoylating agent."}],"priority":"★★☆"},"related_words":{"derivatives":["Benzoyl","Benzoylation","Benzoyl chloride"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Benzoylated' is a highly specialized term used in organic chemistry. Understanding its meaning requires familiarity with chemical nomenclature and reactions, particularly the concept of benzoylation. It is unlikely to be encountered outside of advanced scientific contexts."},"example_sentences":[{"sentence":"The **benzoylated** cellulose exhibited enhanced resistance to enzymatic degradation.","translation":"ベンゾイル化されたセルロースは、酵素による分解に対する耐性が向上していることを示した。","type":"adjective","meaning_category":"chemical modification"},{"sentence":"**Benzoylated** amino acids are often used as intermediates in peptide synthesis.","translation":"ベンゾイル化されたアミノ酸は、ペプチド合成の中間体としてよく使用される。","type":"adjective","meaning_category":"chemical synthesis"}]}