{"word":"Megarhyssa","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A genus of ichneumon wasps in the family Ichneumonidae. They are known for their extremely long ovipositors, which they use to lay eggs in the wood-boring larvae of other insects.","english_definition":"A genus of ichneumon wasps in the family Ichneumonidae, known for their extremely long ovipositors used to lay eggs in wood-boring larvae.","examples":[{"sentence":"The female Megarhyssa uses her long ovipositor to drill into wood.","translation":"メガルリッサのメスは、長い産卵管を使って木に穴を開けます。"},{"sentence":"Megarhyssa wasps are parasitoids of wood-boring insects.","translation":"メガルリッサのハチは、木を穿孔する昆虫の寄生蜂です。"}],"collocations":["Megarhyssa macrurus","Megarhyssa atrata","ovipositor length","ichneumon wasp"],"synonyms":["ichneumon wasp"],"antonyms":[]}],"etymology":{"value":"From mega- (large) + Rhyssa, another genus of ichneumon wasps.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛɡəˈrɪsə/","syllables":"Meg-a-rhys-sa"},"inflection":{"noun_plural":"Megarhyssas"},"usage_notes":{"explanation":"Megarhyssa are parasitoid wasps, meaning they lay their eggs inside or on other insects, eventually killing them. The long ovipositor is a key characteristic, allowing them to reach larvae deep inside wood.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":["Megarhyssa macrurus (species)","Megarhyssa atrata (species)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Megarhyssa is a scientific term referring to a genus of ichneumon wasps. Understanding requires knowledge of entomology and biological classification. The key feature is their long ovipositor used for parasitizing wood-boring insects."},"example_sentences":[{"sentence":"The impressive ovipositor of the Megarhyssa wasp is adapted for reaching larvae hidden within tree trunks.","translation":"メガルリッサのハチの印象的な産卵管は、木の幹の中に隠された幼虫に届くように適応されています。","type":"noun","meaning_category":"description"},{"sentence":"Scientists study Megarhyssa to understand parasitoidism and insect behavior.","translation":"科学者たちは、寄生性と昆虫の行動を理解するためにメガルリッサを研究しています。","type":"noun","meaning_category":"scientific study"}]}