{"word":"Hamamelidaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マンサク科","english_definition":"The witch-hazel family of flowering plants, in the order Saxifragales, containing about 27 genera and 82 species of shrubs and small trees.","examples":[{"sentence":"Many plants in the Hamamelidaceae family are cultivated for their ornamental value.","translation":"マンサク科の多くの植物は、観賞価値のために栽培されています。"}],"collocations":["Hamamelidaceae family","genera of Hamamelidaceae","species of Hamamelidaceae"],"synonyms":["witch-hazel family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Hamamelis, which comes from the Greek words 'hama' (together, at the same time) and 'melon' (fruit), referring to the simultaneous presence of flowers and fruit on the plant. The suffix '-aceae' is used to denote a plant family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæməˌmɛlɪˈdeɪsiːˌaɪ/","syllables":"ha-ma-me-li-da-ce-ae"},"inflection":{"noun_plural":"Hamamelidaceaes / Hamamelidaceae"},"usage_notes":{"explanation":"Hamamelidaceae is a botanical term referring to a specific family of flowering plants. It is primarily used in scientific and horticultural contexts. Common genera include Hamamelis (witch-hazel), Fothergilla, and Liquidambar (sweetgum).","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Hamamelis (witch-hazel genus)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hamamelidaceae' is a technical term used in botany and horticulture to refer to the witch-hazel family of plants. Due to its specialized nature, it is typically encountered in scientific literature, academic discussions, or detailed gardening guides. Understanding this term requires familiarity with botanical nomenclature and plant classification systems."},"example_sentences":[{"sentence":"The Hamamelidaceae family is known for its diverse range of flowering shrubs and trees.","translation":"マンサク科は、多様な種類の花を咲かせる低木と高木で知られています。","type":"general","meaning_category":"definition"},{"sentence":"Liquidambar styraciflua, a member of the Hamamelidaceae, displays vibrant fall foliage.","translation":"マンサク科の一種であるモミジバフウは、鮮やかな紅葉を見せます。","type":"example","meaning_category":"example"}]}