{"word":"hypodermis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"皮下組織","english_definition":"The layer of skin immediately below the dermis, which contains fat and connective tissue.","examples":[{"sentence":"The hypodermis is important for insulation and energy storage.","translation":"皮下組織は、断熱とエネルギー貯蔵に重要です。"},{"sentence":"Fat is mainly stored in the hypodermis.","translation":"脂肪は主に皮下組織に蓄えられます。"},{"sentence":"The hypodermis connects the skin to the underlying muscles and bones.","translation":"皮下組織は、皮膚を下にある筋肉や骨に接続します。"}],"collocations":["hypodermis layer","hypodermis injection","subcutaneous fat (皮下脂肪)"],"synonyms":["subcutaneous tissue","subcutis"],"antonyms":["epidermis","dermis"]}],"etymology":{"value":"From the Greek words 'hypo' (under) and 'derma' (skin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈdɜːrmɪs/","syllables":"hy-po-der-mis"},"inflection":{"noun_plural":"hypodermises"},"usage_notes":{"explanation":"The hypodermis is not technically considered part of the skin, but it lies directly beneath the dermis and is closely associated with it. It is composed primarily of loose connective tissue and adipose tissue (fat).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The hypodermis is the outermost layer of the skin.","correct":"The epidermis is the outermost layer of the skin.","note":"The hypodermis is the deepest layer, not the outermost."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypodermic (adjective: relating to the hypodermis; noun: a hypodermic syringe)"],"related_terms":["epidermis","dermis","integumentary system"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hypodermis' is a technical term used in biology and medicine to refer to the layer of tissue beneath the dermis in the skin. It is important for insulation, energy storage, and connecting the skin to underlying structures. Understanding this term requires knowledge of basic anatomy and physiology.","priority":"★★☆"},"example_sentences":[{"sentence":"The thickness of the hypodermis varies depending on the location on the body.","translation":"皮下組織の厚さは、体の部位によって異なります。","type":"noun","meaning_category":"anatomy"},{"sentence":"The hypodermis contains blood vessels and nerves.","translation":"皮下組織には血管と神経が含まれています。","type":"noun","meaning_category":"anatomy"},{"sentence":"Cosmetic procedures sometimes target the hypodermis to reduce cellulite.","translation":"美容整形手術では、セルライトを減らすために皮下組織をターゲットにすることがあります。","type":"noun","meaning_category":"medicine"}]}