{"word":"well-supplemented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"十分に補給された、十分に栄養補給された","english_definition":"having received adequate or plentiful supplements, especially nutritional supplements.","examples":[{"sentence":"A well-supplemented diet can help prevent deficiencies.","translation":"十分に栄養補給された食事は、欠乏症の予防に役立ちます。"},{"sentence":"The study focused on the effects of a well-supplemented vitamin regimen.","translation":"その研究は、十分に補給されたビタミン療法の効果に焦点を当てました。"},{"sentence":"Athletes often need a well-supplemented diet to meet their increased energy demands.","translation":"アスリートは、増加したエネルギー需要を満たすために、十分に栄養補給された食事を必要とすることがよくあります。"}],"collocations":["well-supplemented diet (十分に栄養補給された食事)","well-supplemented vitamin regimen (十分に補給されたビタミン療法)","well-supplemented with vitamins (ビタミンが十分に補給された)","well-supplemented with minerals (ミネラルが十分に補給された)"],"synonyms":["enriched","fortified","enhanced","boosted","enhanced","nourished"],"antonyms":["deficient","lacking","insufficiently supplemented","under-supplemented"]}],"etymology":{"value":"The word is formed by combining \"well\" (meaning in a good or satisfactory way) with the past participle of \"supplement\" (to add something extra to complete or enhance).","priority":"N/A"},"pronunciation":{"ipa":"/ˌwɛl ˈsʌplɪˌmɛntɪd/","syllables":"well-sup-ple-ment-ed"},"inflection":{"notes":"Adjective, no standard inflection."},"usage_notes":{"explanation":"\"Well-supplemented\" generally refers to something that has been adequately or thoroughly enhanced or completed with additions, most commonly referring to diet or nutrition. It implies that any deficiencies have been addressed through the addition of supplements.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was well supplemented of vitamins.","correct":"✓ The food was well supplemented with vitamins.","note":"Use the preposition \"with\" to indicate what the food is supplemented with."},{"incorrect":"✗ He is well supplement with protein.","correct":"✓ He is well-supplemented with protein.","note":"Ensure the correct past participle form \"supplemented\" is used."}],"priority":"N/A"},"related_words":{"derivatives":["supplement (verb, noun)","supplementation (noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word \"well-supplemented\" is a relatively advanced term, typically used in contexts related to nutrition, health, and diet. It describes something that has been adequately enhanced with additional elements, often vitamins or minerals. The term is most commonly found in scientific, medical, or nutritional discussions. Understanding the term requires a good grasp of the meaning of \"supplement\" and the intensifying effect of \"well.\""},"example_sentences":[{"sentence":"A well-supplemented diet is crucial for pregnant women to ensure proper fetal development.","translation":"十分に栄養補給された食事は、妊婦が適切な胎児の発育を確保するために不可欠です。","type":"general","meaning_category":"nutrition"},{"sentence":"The researchers investigated the benefits of a well-supplemented feeding program for malnourished children.","translation":"研究者らは、栄養不良の子供たちのための十分に栄養補給された給餌プログラムの利点を調査しました。","type":"research","meaning_category":"health"},{"sentence":"To maintain peak performance, the athlete followed a well-supplemented training regimen.","translation":"最高のパフォーマンスを維持するために、アスリートは十分に栄養補給されたトレーニング計画に従いました。","type":"sports","meaning_category":"fitness"}]}