{"word":"Pseudo-European","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"疑似ヨーロッパ的な、見せかけだけのヨーロッパ的な","english_definition":"Appearing or pretending to be European, but not genuinely so; superficially resembling European culture or characteristics.","examples":[{"sentence":"The architecture of the building had a pseudo-European style, with fake columns and ornate decorations.","translation":"その建物の建築は、偽の柱や華やかな装飾が施された、疑似ヨーロッパ的なスタイルだった。"},{"sentence":"The restaurant served what they called 'European cuisine,' but it was mostly just bland, Westernized food. It was very pseudo-European.","translation":"そのレストランは「ヨーロッパ料理」と称する料理を提供していたが、ほとんどはただの味気ない西洋風の料理だった。それは非常に疑似ヨーロッパ的だった。"}],"collocations":["pseudo-European style","pseudo-European architecture","pseudo-European culture"],"synonyms":["fake European","mock-European","imitation European","ostensibly European"],"antonyms":["genuinely European","authentically European"]}],"etymology":{"value":"The term is formed by combining the prefix 'pseudo-' (meaning false or pretending) with the adjective 'European'. It implies something that imitates or resembles European characteristics without being truly European.","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊjʊrəˈpiːən","syllables":"pseu-do-Eu-ro-pe-an"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are created using 'more' and 'most' (e.g., more pseudo-European, most pseudo-European)."},"usage_notes":{"explanation":"'Pseudo-European' is used to describe something that superficially resembles European culture, style, or characteristics, but lacks authenticity or genuine connection to Europe. It often carries a negative connotation, suggesting that the imitation is of poor quality or lacks substance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was very pseudo.","correct":"✓ The city had a pseudo-European feel.","note":"'Pseudo-' is a prefix, so it needs to be attached to a word. It can't stand alone as an adjective. You need to specify what is pseudo-European (e.g., the style, the feel, the architecture)."},{"incorrect":"✗ He is a pseudo-European.","correct":"✓ He is pretending to be European. / ✓ He has a pseudo-European accent.","note":"You can't directly describe a person as 'pseudo-European' unless you specify what aspect of them is pseudo-European (e.g., their accent, their mannerisms). It's more common to say someone is 'pretending to be European' or 'affected by European culture'."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false, sham, or imitating)","European (adjective or noun relating to Europe)"],"related_concepts":["cultural appropriation","cultural imitation","kitsch","pastiche"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudo-European' is a term used to describe something that looks or seems European on the surface but isn't genuinely so. It's often used critically to suggest that something is a cheap or superficial imitation of European culture. Think of it as the opposite of something that is authentically European. It's a more advanced term, so you'll likely encounter it in discussions about culture, architecture, or design."},"example_sentences":[{"sentence":"The theme park featured a pseudo-European village with cobblestone streets and fairytale castles.","translation":"そのテーマパークには、石畳の道や童話のお城がある、疑似ヨーロッパ的な村があった。","type":"adjective","meaning_category":"imitation of European style"},{"sentence":"The politician's speech was filled with pseudo-European rhetoric, but lacked any real substance.","translation":"その政治家の演説は疑似ヨーロッパ的なレトリックで満たされていたが、中身はなかった。","type":"adjective","meaning_category":"false appearance of European ideas"},{"sentence":"Many fast-food chains try to create a pseudo-European atmosphere in their restaurants to attract customers.","translation":"多くのファストフードチェーンは、顧客を引き付けるために、レストランに疑似ヨーロッパ的な雰囲気を作り出そうとしている。","type":"adjective","meaning_category":"superficial European resemblance"}]}