{"word":"demonetised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(通貨の)通用を停止する、廃貨にする","english_definition":"to deprive (a coin, currency, etc.) of its status as legal tender.","examples":[{"sentence":"The government demonetised the 500 and 1000 rupee notes.","translation":"政府は500ルピーと1000ルピー紙幣の通用を停止した。"},{"sentence":"Old coins were demonetised and replaced with new ones.","translation":"古い硬貨は廃貨され、新しいものと交換された。"}],"collocations":["demonetise currency (通貨を廃止する)","demonetise banknotes (紙幣を廃止する)"],"synonyms":["devalue","invalidate","retire"],"antonyms":["legalize","validate","introduce"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(ウェブサイト、動画などの)収益化を停止する","english_definition":"to remove the ability of (a website, video, etc.) to generate revenue, typically through advertising.","examples":[{"sentence":"YouTube demonetised his channel due to copyright violations.","translation":"YouTubeは著作権侵害のため、彼のチャンネルの収益化を停止した。"},{"sentence":"The website was demonetised for publishing false information.","translation":"そのウェブサイトは虚偽の情報を公開したため、収益化を停止された。"}],"collocations":["demonetise a channel (チャンネルの収益化を停止する)","demonetise a video (動画の収益化を停止する)","demonetise content (コンテンツの収益化を停止する)"],"synonyms":["disable monetization","revoke monetization"],"antonyms":["monetize","enable monetization"]}],"etymology":{"value":"'Demonetise' is formed from 'de-' (meaning 'remove' or 'reverse') and 'monetise' (meaning 'to convert into or express in terms of money'). The word reflects the action of removing monetary value or the ability to generate revenue.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈmʌnɪtaɪzd/","syllables":"de-mon-e-tised"},"inflection":{"verb_forms":{"present_simple":["demonetise","demonetises"],"past_simple":"demonetised","past_participle":"demonetised","present_participle":"demonetising"}},"usage_notes":{"explanation":"The word 'demonetise' has two primary uses. Firstly, it refers to the act of removing the status of legal tender from a currency, meaning it can no longer be used as a valid form of payment. Secondly, in the context of online content, it refers to the act of disabling the ability of a website, video, or other content to generate revenue, typically through advertising. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The video was demonetized of its ads.","correct":"✓ The video was demonetised. / ✓ The video had its ads removed.","note":"'Demonetise' is a transitive verb, so it takes a direct object (what is being demonetised). The preposition 'of' is not needed. Alternatively, you can say that the ads were removed."},{"incorrect":"✗ The government demonetized to control inflation.","correct":"✓ The government demonetised the currency to control inflation.","note":"When referring to currency, it's important to specify what was demonetised (e.g., 'the currency', 'the banknotes')."}],"priority":"★★☆"},"related_words":{"derivatives":["demonetisation (noun: the act of demonetising)","monetise (verb: to convert into or express in terms of money; to generate revenue from)","monetization (noun: the act of monetising)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - relatively uncommon, but usage is increasing in the digital age.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Demonetise' is a relatively uncommon word that is used in two main contexts. The first is in economics and finance, where it refers to the act of removing the status of legal tender from a currency. This means that the currency can no longer be used as a valid form of payment. The second context is in the online world, where it refers to the act of disabling the ability of a website, video, or other content to generate revenue, typically through advertising. This is often done as a result of copyright violations or other policy breaches. The word is most likely to be encountered in news reports or articles about economics, finance, or online content creation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The central bank decided to **demonetise** the old series of banknotes.","translation":"中央銀行は旧シリーズの紙幣の通用を停止することを決定した。","type":"verb","meaning_category":"廃貨にする"},{"sentence":"Many content creators fear being **demonetised** on YouTube.","translation":"多くのコンテンツクリエイターはYouTubeで収益化を停止されることを恐れている。","type":"verb","meaning_category":"収益化を停止する"},{"sentence":"The **demonetisation** of the old currency caused significant disruption to the economy.","translation":"旧通貨の廃止は経済に大きな混乱を引き起こした。","type":"noun (demonetisation)","meaning_category":"廃貨"},{"sentence":"The platform **demonetised** the account after repeated violations of its terms of service.","translation":"そのプラットフォームは、利用規約への違反が繰り返されたため、そのアカウントの収益化を停止した。","type":"verb","meaning_category":"収益化を停止する"}]}