{"word":"sonority","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(音楽)響き、音色、音響の豊かさ、音の美しさ","english_definition":"the quality of having a full, rich sound; richness or beauty of sound.","examples":[{"sentence":"The sonority of the orchestra filled the concert hall.","translation":"オーケストラの響きがコンサートホールを満たした。"},{"sentence":"The singer's voice had a beautiful sonority.","translation":"その歌手の声は美しい音色を持っていた。"},{"sentence":"The composer explored the sonority of different instrumental combinations.","translation":"作曲家はさまざまな楽器の組み合わせの響きを探求した。"},{"sentence":"The church is known for its excellent acoustics and sonority.","translation":"その教会は、優れた音響特性と豊かな響きで知られている。"}],"collocations":["vocal sonority (声の響き)","instrumental sonority (楽器の響き)","rich sonority (豊かな響き)","full sonority (充実した響き)","dark sonority (暗い響き)","bright sonority (明るい響き)","explore sonority (響きを探求する)","enhance sonority (響きを高める)"],"synonyms":["resonance","richness","fullness","tone","timbre","sound quality","euphony","harmoniousness"],"antonyms":["thinness","weakness","dissonance"]},{"part_of_speech":"noun","definition":"(言語学)語音の響きの強さ、音声の聞こえやすさ","english_definition":"the perceived loudness of a speech sound relative to other sounds with the same length, stress, and pitch.","examples":[{"sentence":"Vowels generally have greater sonority than consonants.","translation":"一般的に、母音は子音よりも語音の響きが強い。"},{"sentence":"The sonority hierarchy ranks speech sounds according to their perceived loudness.","translation":"ソノリティ階層は、知覚される音の大きさに基づいて音声のランク付けを行う。"},{"sentence":"The syllable structure is often determined by the sonority sequencing principle.","translation":"音節構造は、ソノリティ・シーケンシング原理によって決定されることが多い。"},{"sentence":"The /r/ sound has a high degree of sonority.","translation":"/r/の音は、高い響きを持つ。"}],"collocations":["sonority hierarchy (ソノリティ階層)","sonority sequencing principle (ソノリティ・シーケンシング原理)","high sonority (高い響き)","low sonority (低い響き)","vowel sonority (母音の響き)","consonant sonority (子音の響き)"],"synonyms":["loudness","prominence","audibility","perceptibility"],"antonyms":["obscurity","inaudibility"]}],"etymology":{"value":"Late Middle English: from French sonorité, from late Latin sonoritas, from Latin sonorus ‘resounding’ (see sonorous).","priority":"★★☆"},"pronunciation":{"ipa":"/səˈnɒrəti/","syllables":"so-nor-i-ty"},"inflection":{"noun_plural":"sonorities"},"usage_notes":{"explanation":"The term \"sonority\" refers to the quality of sound, particularly its richness, fullness, and beauty. In music, it describes the overall sound quality produced by instruments or voices, often emphasizing the harmonious and resonant aspects. In linguistics, it refers to the perceived loudness or prominence of a speech sound, with vowels generally having higher sonority than consonants. The linguistic concept is crucial for understanding syllable structure and phonological patterns.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sonority of the picture was amazing.","correct":"✓ The clarity of the picture was amazing.","note":"\"Sonority\" refers to the quality of sound, not visual elements. Use \"clarity\" or \"vividness\" for pictures."},{"incorrect":"✗ He spoke with great sonority, but I couldn't understand him.","correct":"✓ He spoke with great volume, but I couldn't understand him.","note":"\"Sonority\" refers to the richness and beauty of the sound, not necessarily its loudness or clarity. Use \"volume\" or \"loudness\" when referring to how loud someone speaks."},{"incorrect":"✗ The sonority of the silence was deafening.","correct":"✓ The intensity of the silence was deafening.","note":"\"Sonority\" implies a richness of sound, which is contradictory to silence. Use \"intensity\" or \"weight\" to describe the impact of silence."}],"priority":"★★☆"},"related_words":{"derivatives":["sonorous (adjective: having a full, deep, or rich sound)","sonorously (adverb: in a sonorous manner)"],"related_terms":["resonance","timbre","tone","acoustics","phonetics","phonology"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"sonority\" is a relatively advanced term that describes the richness, fullness, and beauty of sound. It is commonly used in the context of music to describe the overall sound quality of an orchestra, a singer's voice, or instrumental combinations. In linguistics, \"sonority\" refers to the perceived loudness of a speech sound, particularly vowels compared to consonants. Understanding this word requires a good grasp of abstract concepts related to sound and language. It is more likely to be encountered in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The organ's sonority filled the cathedral with a majestic sound.","translation":"オルガンの響きが、大聖堂を荘厳な音で満たした。","type":"noun","meaning_category":"(音楽)響き、音色"},{"sentence":"The composer carefully crafted the sonority of each chord.","translation":"作曲家は、各コードの響きを注意深く作り上げた。","type":"noun","meaning_category":"(音楽)響き、音色"},{"sentence":"Vowels have a greater degree of sonority than consonants.","translation":"母音は子音よりも語音の響きが大きい。","type":"noun","meaning_category":"(言語学)語音の響きの強さ"},{"sentence":"The sonority hierarchy helps explain the structure of syllables.","translation":"ソノリティ階層は、音節の構造を説明するのに役立つ。","type":"noun","meaning_category":"(言語学)語音の響きの強さ"},{"sentence":"The cellist's rich sonority captivated the audience.","translation":"チェリストの豊かな響きは、聴衆を魅了した。","type":"noun","meaning_category":"(音楽)響き、音色"}]}