{"word":"reality-enhancing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"現実を強化する、現実拡張の","english_definition":"Designed to improve or augment one's perception of reality, often through technological means.","examples":[{"sentence":"The company is developing reality-enhancing software for educational purposes.","translation":"その会社は教育目的で現実拡張ソフトウェアを開発しています。"},{"sentence":"He wore reality-enhancing glasses that overlayed digital information onto his view.","translation":"彼はデジタル情報を視界に重ねる現実拡張メガネをかけていました。"}],"collocations":["reality-enhancing technology","reality-enhancing glasses","reality-enhancing software","reality-enhancing experience"],"synonyms":["augmented reality","enhanced reality"],"antonyms":["virtual reality","reality-reducing"]},{"part_of_speech":"adjective","definition":"（比喩的に）現実をより良く見せる、現実を美化する","english_definition":"(Figuratively) Making reality appear better or more appealing than it actually is.","examples":[{"sentence":"The politician's speech was a reality-enhancing portrayal of the country's economic situation.","translation":"政治家の演説は、国の経済状況を現実よりも良く見せる描写だった。"}],"collocations":["reality-enhancing portrayal","reality-enhancing narrative"],"synonyms":["embellishing","beautifying","idealizing"],"antonyms":["realistic","unvarnished","truthful"]}],"etymology":{"value":"The term is formed by combining 'reality' with 'enhancing,' indicating the act of improving or augmenting reality.","priority":"★★☆"},"pronunciation":{"ipa":"/riˈæləti ɪnˈhænsɪŋ/","syllables":"re-al-i-ty in-hanc-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Reality-enhancing' is often used in the context of technology that overlays digital information onto the real world, improving or augmenting the user's perception. It can also be used figuratively to describe something that makes reality seem better than it is.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The game is reality enhance.","correct":"✓ The game is reality-enhancing.","note":"'Reality-enhancing' is an adjective, so it should be used to describe a noun. 'Reality enhance' is not grammatically correct."}],"priority":"★★☆"},"related_words":{"derivatives":["enhance","enhancement","reality","augmented reality"],"related_concepts":["virtual reality","mixed reality","extended reality (XR)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reality-enhancing' refers to technologies or methods that improve or augment one's perception of the real world. This term is often used in discussions about augmented reality (AR) and similar technologies. It can also be used in a more abstract sense to describe something that makes reality seem better than it is. Understanding this term requires familiarity with technology and abstract concepts."},"example_sentences":[{"sentence":"The new app offers a reality-enhancing experience by providing real-time information about nearby landmarks.","translation":"その新しいアプリは、近くのランドマークに関するリアルタイムの情報を提供することで、現実拡張体験を提供します。","type":"adjective","meaning_category":"Technology"},{"sentence":"The artist created a reality-enhancing mural that seemed to come alive when viewed through a smartphone.","translation":"そのアーティストは、スマートフォンを通して見ると生き生きとして見える現実拡張の壁画を作成しました。","type":"adjective","meaning_category":"Art"},{"sentence":"The politician was accused of using reality-enhancing rhetoric to gloss over the country's problems.","translation":"その政治家は、国の問題をうやむやにするために現実を美化するレトリックを使っていると非難された。","type":"adjective","meaning_category":"Figurative"}]}