{"word":"endocrinology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"内分泌学","english_definition":"the branch of physiology and medicine concerned with endocrine glands and hormones.","examples":[{"sentence":"Endocrinology is a complex field of study.","translation":"内分泌学は複雑な研究分野です。"},{"sentence":"She specializes in endocrinology at the hospital.","translation":"彼女は病院で内分泌学を専門にしています。"},{"sentence":"The endocrinology department is conducting research on diabetes.","translation":"内分泌科は糖尿病の研究を行っています。"}],"collocations":["clinical endocrinology","pediatric endocrinology","reproductive endocrinology","endocrine system","hormone imbalance","thyroid disorders"],"synonyms":["hormonology"],"antonyms":[],"related_terms":["hormone","endocrine gland","diabetes","thyroid","metabolism"]}],"etymology":{"value":"Formed from the Greek words 'endon' (within), 'krinein' (to secrete), and 'logia' (study of). Thus, it literally means 'the study of internal secretions'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndəkrɪˈnɒlədʒi/","syllables":"en-do-cri-nol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Endocrinology is a specialized field of medicine that focuses on the endocrine system, which includes glands that produce hormones. These hormones regulate various bodily functions such as metabolism, growth, reproduction, and mood. Endocrinologists diagnose and treat hormonal disorders such as diabetes, thyroid disorders, and growth disorders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have an endocrinology appointment for my heart.","correct":"✓ I have a cardiology appointment for my heart. / ✓ I have an endocrinology appointment for my thyroid.","note":"Endocrinology deals with hormones and glands like the thyroid, not the heart. Heart problems are typically addressed by a cardiologist."},{"incorrect":"✗ Endocrinology is when you study bones.","correct":"✓ Endocrinology is when you study hormones and glands. / ✓ Osteology is when you study bones.","note":"Endocrinology is the study of hormones and glands, while osteology is the study of bones."}],"priority":"★★☆"},"related_words":{"derivatives":["endocrinologist (noun: 内分泌学者)","endocrine (adjective: 内分泌の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endocrinology' is a specialized medical term referring to the study of the endocrine system, which includes glands and hormones. It's a field that deals with complex bodily functions such as metabolism, growth, and reproduction. This term is typically used in medical or scientific contexts and may not be commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The doctor recommended that she see an endocrinologist for her thyroid issues.","translation":"医師は、彼女の甲状腺の問題で内分泌学者に診てもらうことを勧めました。","type":"general","meaning_category":"medical"},{"sentence":"Research in endocrinology has led to better treatments for diabetes.","translation":"内分泌学の研究は、糖尿病のより良い治療法につながっています。","type":"research","meaning_category":"scientific"},{"sentence":"Endocrinology studies the effects of hormones on the body's functions.","translation":"内分泌学は、ホルモンが体の機能に与える影響を研究します。","type":"definition","meaning_category":"definition"}]}