{"word":"Toryize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"保守党化する、保守党の政策やイデオロギーを取り入れる、またはそれらを適用する","english_definition":"To make something more like the British Conservative Party (the Tories) in terms of policies, ideology, or character; to bring under the influence of Tory principles.","examples":[{"sentence":"The government's plan to Toryize the education system was met with strong opposition.","translation":"政府の教育制度を保守党化する計画は、強い反対に遭った。"},{"sentence":"Critics accused the party leader of trying to Toryize the party by shifting it to the right.","translation":"批判者たちは、党首が党を右寄りにシフトさせることで保守党化しようとしていると非難した。"}],"collocations":["Toryize the economy","Toryize education","Toryize healthcare","Toryize the media"],"synonyms":["conservatize","right-wing","make conservative","impose conservative policies"],"antonyms":["liberalize","left-wing","socialize","democratize"]}],"etymology":{"value":"Derived from 'Tory,' a historical term for a member of the British Conservative Party, combined with the suffix '-ize,' which means 'to make' or 'to become.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɔːri.aɪz/","syllables":"Tor-y-ize"},"inflection":{"verb_forms":{"present_simple":["Toryize","Toryizes"],"past_simple":"Toryized","past_participle":"Toryized","present_participle":"Toryizing"}},"usage_notes":{"explanation":"'Toryize' is a relatively recent and somewhat informal term used to describe the process of adopting or implementing policies and ideologies associated with the British Conservative Party (the Tories). It often carries a negative connotation, implying a shift towards more conservative or right-wing positions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was Toryized by the new mayor.","correct":"✓ The city was influenced by the new mayor's Tory policies.","note":"'Toryize' implies a shift in policies or ideology, not necessarily a direct change in the city itself. It's better to say that the city was influenced by Tory policies."},{"incorrect":"✗ He Toryized his car with a Union Jack flag.","correct":"✓ He decorated his car with a Union Jack flag, showing his Tory leanings.","note":"'Toryize' is not used for superficial decorations or displays of support. It refers to the adoption of Tory principles or policies."}],"priority":"★★☆"},"related_words":{"derivatives":["Tory","Toryism"],"phrases":["Tory agenda","Tory policies","Tory principles"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toryize' is a specialized term used in political discourse, particularly in the UK, to describe the process of adopting or implementing policies and ideologies associated with the Conservative Party. It is often used critically to suggest a shift towards more conservative or right-wing positions. Understanding this term requires familiarity with British politics and the historical context of the Tory party."},"example_sentences":[{"sentence":"The opposition party accused the government of trying to Toryize the National Health Service.","translation":"野党は政府が国民保健サービスを保守党化しようとしていると非難した。","type":"verb","meaning_category":"保守党化する"},{"sentence":"The reforms were seen as an attempt to Toryize the legal system.","translation":"その改革は法制度を保守党化する試みと見なされた。","type":"verb","meaning_category":"保守党化する"}]}