{"word":"monistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"一元論の、一元的な","english_definition":"relating to or characterized by monism.","examples":[{"sentence":"The philosopher developed a monistic view of the universe.","translation":"その哲学者は宇宙に関する一元論的な見解を展開した。"},{"sentence":"Monistic religions emphasize the unity of all things.","translation":"一元論的な宗教は、すべてのものの統一性を強調する。"},{"sentence":"His monistic philosophy sees mind and matter as ultimately one substance.","translation":"彼の一元論的な哲学では、精神と物質は究極的には一つの実体であると見なされる。"}],"collocations":["monistic philosophy","monistic religion","monistic view","monistic system"],"synonyms":["unified","holistic","integrated","unitary"],"antonyms":["dualistic","pluralistic"]},{"part_of_speech":"adjective","definition":"（特に哲学で）唯一の原理または実体からなる、還元主義的な","english_definition":"consisting of only one principle or ultimate substance; reductionist.","examples":[{"sentence":"A monistic explanation simplifies complex phenomena into a single cause.","translation":"一元論的な説明は、複雑な現象を単一の原因に単純化する。"},{"sentence":"Some scientists criticize monistic theories for oversimplifying reality.","translation":"一部の科学者は、現実を単純化しすぎているとして、一元論的な理論を批判している。"}],"collocations":["monistic explanation","monistic theory","monistic approach"],"synonyms":["reductionist","simplistic","unified"],"antonyms":["complex","multifaceted"]}],"etymology":{"value":"Derived from 'monism,' which comes from the Greek word 'monos' meaning 'single' or 'alone.' The suffix '-istic' indicates a characteristic or relating to something.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɪstɪk/","syllables":"mo-nis-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., 'very monistic')."},"usage_notes":{"explanation":"'Monistic' is primarily used in philosophical and religious contexts to describe systems of thought that posit a single underlying substance, principle, or reality. It is often contrasted with dualistic or pluralistic views. While it can be used more broadly to describe something unified or integrated, its core meaning relates to monism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting had a monistic color scheme.","correct":"✓ The painting had a monochromatic color scheme.","note":"'Monistic' refers to a philosophical concept, not a single color. Use 'monochromatic' for a single color scheme."},{"incorrect":"✗ He had a very monistic personality.","correct":"✓ He had a very singular personality.","note":"'Monistic' doesn't describe personality. Use 'singular' or 'unique' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["monism (noun): the philosophical view that reality is ultimately one substance or principle.","monist (noun): a person who believes in monism."],"antonyms":["dualistic (adjective): relating to dualism, the belief in two fundamental principles.","pluralistic (adjective): relating to pluralism, the belief in multiple principles or realities."],"related_concepts":["idealism (philosophy): the view that reality is fundamentally mental or immaterial.","materialism (philosophy): the view that reality is fundamentally material."]},"level_frequency":{"CEFR":"C2 (specialized philosophical vocabulary)","frequency_google_ngram":"Low frequency (primarily used in academic and philosophical texts).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'monistic' is used in philosophical and academic discussions. It describes something related to 'monism,' which is the belief that everything is ultimately one thing or one substance. You'll likely encounter this word in texts about philosophy, religion, or metaphysics. It's a more advanced term, so understanding the context is important to grasp its meaning fully."},"example_sentences":[{"sentence":"The ancient Greek philosophers explored various monistic theories about the nature of existence.","translation":"古代ギリシャの哲学者は、存在の本質に関するさまざまな一元論的な理論を探求した。","type":"adjective","meaning_category":"philosophical"},{"sentence":"Many Eastern religions have monistic elements, emphasizing the interconnectedness of all beings.","translation":"多くの東洋の宗教には一元論的な要素があり、すべての存在の相互のつながりを強調している。","type":"adjective","meaning_category":"religious"},{"sentence":"His monistic worldview influenced his approach to environmental conservation.","translation":"彼の一元論的な世界観は、環境保護への取り組みに影響を与えた。","type":"adjective","meaning_category":"worldview"}]}