{"word":"Simplices","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)単体の複数形","english_definition":"plural form of simplex (a generalization of the notion of a triangle or tetrahedron to spaces of any dimension).","examples":[{"sentence":"The algorithm decomposes a complex shape into a collection of simplices.","translation":"そのアルゴリズムは複雑な形状を単体の集合に分解する。"},{"sentence":"Simplices are used in various areas of mathematics, including topology and geometry.","translation":"単体は、トポロジーや幾何学を含む数学の様々な分野で使用される。"}],"collocations":["collection of simplices","decompose into simplices","tetrahedral simplices","triangular simplices"],"synonyms":["triangles","tetrahedra","n-simplices"],"antonyms":[]}],"etymology":{"value":"Derived from 'simplex', which comes from Latin 'simplex' meaning 'simple' or 'single'. The plural form 'simplices' indicates multiple of these simple geometric objects.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɪmplɪsiːz/","syllables":"Sim-pli-ces"},"inflection":{"noun_plural":"Simplices"},"usage_notes":{"explanation":"'Simplices' is a technical term primarily used in mathematics, specifically in fields like topology, geometry, and numerical analysis. It refers to the plural of 'simplex', which is a basic geometric object that is the simplest possible polytope in any given dimension. A 0-simplex is a point, a 1-simplex is a line segment, a 2-simplex is a triangle, a 3-simplex is a tetrahedron, and so on. Simplices are often used to approximate more complex shapes or spaces, a process called simplicial approximation or triangulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The simplices is a triangle.","correct":"✓ A simplex is a triangle.","note":"'Simplices' is plural, so it requires a plural verb. Use 'simplex' for the singular form."},{"incorrect":"✗ Use simplex when you have multiple triangles.","correct":"✓ Use simplices when you have multiple triangles.","note":"If you are referring to more than one simplex, use the plural form 'simplices'."}],"priority":"★★☆"},"related_words":{"derivatives":["simplex","simplicial","simplicial complex","simplicial approximation","triangulation"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Simplices' is a highly specialized mathematical term. Understanding requires familiarity with concepts from topology and geometry. It refers to the plural form of 'simplex', which represents basic geometric building blocks in various dimensions. The term is typically encountered in advanced mathematical texts and research papers.","priority":"★☆☆"},"example_sentences":[{"sentence":"The finite element method often relies on dividing the domain into tetrahedral **simplices**.","translation":"有限要素法は、しばしば領域を四面体単体に分割することに依存する。","type":"noun","meaning_category":"単体の複数形"},{"sentence":"The surface of the object was approximated using a large number of **simplices**.","translation":"対象物の表面は、多数の単体を使用して近似された。","type":"noun","meaning_category":"単体の複数形"},{"sentence":"The **simplices** in the simplicial complex are glued together along their faces.","translation":"単体複体内の単体は、その面で互いに貼り合わされている。","type":"noun","meaning_category":"単体の複数形"}]}