{"word":"Segregationists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人種隔離主義者、人種差別主義者","english_definition":"People who support or advocate for the separation of different racial groups in a country or community.","examples":[{"sentence":"The segregationists fought against the civil rights movement.","translation":"人種隔離主義者たちは公民権運動に反対して戦った。"},{"sentence":"Segregationists believed in maintaining separate facilities for different races.","translation":"人種隔離主義者たちは異なる人種のために別々の施設を維持することを信じていた。"}],"collocations":["racial segregation","school segregation","segregation laws"],"synonyms":["racists","discriminationists","separatists"],"antonyms":["integrationists","equal rights advocates","abolitionists"]}],"etymology":{"value":"The word 'segregationist' is derived from 'segregation,' which comes from the Latin word 'segregare,' meaning 'to separate from the flock.' The suffix '-ist' indicates a person who supports or practices a particular ideology or system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌseɡrɪˈɡeɪʃənɪsts/","syllables":"seg-re-ga-tion-ists"},"inflection":{"noun_plural":"Segregationists"},"usage_notes":{"explanation":"'Segregationists' refers specifically to individuals who actively supported or implemented policies and practices of racial segregation, particularly in the context of the United States during the Jim Crow era. The term carries strong negative connotations due to the discriminatory and oppressive nature of segregation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a segregationist because he likes to live in a homogeneous neighborhood.","correct":"✓ His preference for a homogeneous neighborhood does not necessarily make him a segregationist; segregationism is about enforced separation.","note":"Liking to live in a homogeneous neighborhood does not automatically make someone a segregationist. Segregationism involves actively supporting or enforcing separation based on race."},{"incorrect":"✗ Segregationists are a thing of the past.","correct":"✓ While legal segregation is largely abolished, segregationist ideas and attitudes can still exist in various forms.","note":"While legal segregation has ended, segregationist attitudes and ideologies may still persist in subtle or indirect ways."}],"priority":"★★☆"},"related_words":{"derivatives":["segregation (noun)","segregationism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'segregationists' refers to individuals who actively supported the policy and practice of segregation, particularly racial segregation. This term is often used in historical contexts, especially when discussing the civil rights movement and the Jim Crow era in the United States. Understanding this term requires knowledge of the historical and social context of segregation.","example_sentences":[]},"example_sentences":[{"sentence":"The segregationists in the South resisted the Supreme Court's decision to desegregate schools.","translation":"南部の隔離主義者たちは、学校の人種隔離を廃止するという最高裁判所の決定に抵抗した。","type":"noun","meaning_category":"人種隔離主義者"}]}