{"word":"polyelectrolyte","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"高分子電解質","english_definition":"A polymer whose repeating units bear an electrolyte group. Polycations and polyanions are polyelectrolytes.","examples":[{"sentence":"Polyelectrolytes are used in a variety of applications, including water treatment and drug delivery.","translation":"高分子電解質は、水処理や薬物送達など、さまざまな用途で使用されています。"}],"collocations":["polyelectrolyte complex","polyelectrolyte solution","polyelectrolyte multilayer"],"synonyms":["ionic polymer"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'poly-' (meaning many), 'electro-' (referring to electrical properties), and '-lyte' (short for electrolyte).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliɪˈlɛktrəˌlaɪt/","syllables":"pol-y-e-lec-tro-lyte"},"inflection":{"noun_plural":"polyelectrolytes"},"usage_notes":{"explanation":"Polyelectrolytes are polymers containing ionizable groups. When dissolved in a polar solvent such as water, these groups dissociate and the polymer chain carries an electrical charge. This charge influences the polymer's conformation and interactions with other molecules. They are used in various applications due to their ability to modify solution properties and interact with charged surfaces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ polyelectrolyte are important.","correct":"✓ Polyelectrolytes are important.","note":"'Polyelectrolyte' is a countable noun, so the plural form 'polyelectrolytes' should be used with the plural verb 'are' when referring to the general class of materials."}],"priority":"★★☆"},"related_words":{"derivatives":["polycation","polyanion","electrolyte","polymer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyelectrolyte' is a technical term used in chemistry and materials science. It refers to polymers that have electrolyte groups, which means they can carry an electrical charge when dissolved in a solvent like water. This property makes them useful in applications like water treatment and drug delivery. Understanding this term requires a background in polymer chemistry and electrostatics."},"example_sentences":[{"sentence":"The behavior of the polyelectrolyte solution changes significantly with pH.","translation":"高分子電解質溶液の挙動はpHによって大きく変化する。","type":"general","meaning_category":"properties"},{"sentence":"The polyelectrolyte complex formed a stable coating on the nanoparticle.","translation":"高分子電解質複合体は、ナノ粒子上に安定なコーティングを形成した。","type":"application","meaning_category":"complexes"}]}