{"word":"teaseller","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物のナベナの別名、またはナベナ属の植物を扱う人","english_definition":"An alternative spelling of teasel, or a person who works with teasels.","examples":[{"sentence":"The teaseller used dried teasel heads to raise the nap on the woollen cloth.","translation":"ナベナを扱う人は、乾燥させたナベナの頭を使って、ウール生地の起毛を立てた。"},{"sentence":"The garden featured various teasellers, attracting many bees.","translation":"その庭には様々なナベナがあり、多くの蜂を引き寄せていた。"}],"collocations":["dried teaseller heads","various teaseller species"],"synonyms":["teasel"],"antonyms":[]}],"etymology":{"value":"'Teaseller' is simply an alternative spelling of 'teasel'. 'Teasel' comes from the Old English word 'tǣsel', which is derived from 'tǣsan', meaning 'to tease or comb'. This refers to the plant's historical use in raising the nap on woolen cloth.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtiːˌsɛlər/","syllables":"tea-sel-ler"},"inflection":{"noun_plural":"teasellers"},"usage_notes":{"explanation":"The term 'teaseller' is not as commonly used as 'teasel'. It refers to the plant itself or someone who works with teasels, especially in the context of raising the nap on woolen cloth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a teaseller at the zoo.","correct":"✓ I saw a teasel at the botanical garden.","note":"Teasels are plants, so you'd typically find them in a botanical garden or natural environment, not a zoo."}],"priority":"★★☆"},"related_words":{"derivatives":["teasel (noun: the plant itself)","teaseling (noun: the process of raising the nap on cloth using teasels)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Teaseller' is a less common term, primarily an alternative spelling of 'teasel'. It refers to the plant used historically in textile processing to raise the nap on woolen cloth. Understanding its usage requires knowledge of historical textile practices or botany."},"example_sentences":[{"sentence":"The old mill still had a teaseller for preparing wool.","translation":"その古い工場にはまだ羊毛を準備するためのナベナがあった。","type":"noun","meaning_category":"plant/worker"},{"sentence":"He collected the teaseller from the field to use in his craft.","translation":"彼は自分の工芸品に使うために、畑からナベナを採取した。","type":"noun","meaning_category":"plant/worker"}]}