{"word":"epigrammatism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"警句主義、警句を用いる傾向、警句的なスタイル","english_definition":"The use of or fondness for epigrams; a concise, clever, often paradoxical statement or saying.","examples":[{"sentence":"His writing is characterized by epigrammatism, making it both witty and insightful.","translation":"彼の文章は警句主義によって特徴づけられており、それが機知に富み、洞察力のあるものにしている。"},{"sentence":"The play's dialogue is full of epigrammatism, with each line carefully crafted for maximum impact.","translation":"その劇の台詞は警句主義に満ちており、各行が最大限の効果を発揮するように注意深く作られている。"}],"collocations":["literary epigrammatism","philosophical epigrammatism","witty epigrammatism"],"synonyms":["aphoristic style","witticism","terseness","conciseness"],"antonyms":["verbosity","long-windedness","diffuseness"]}],"etymology":{"value":"epigram + -ism. Epigram comes from Greek epigramma, 'an inscription, epigram,' from epigraphein 'to write on, inscribe,' from epi 'on, upon' + graphein 'to write.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈɡræmətɪzəm/","syllables":"ep-i-gram-ma-tism"},"inflection":{"noun_plural":"epigrammatisms"},"usage_notes":{"explanation":"'Epigrammatism' refers to the quality or style of using epigrams, which are short, witty statements that often contain a paradox or unexpected twist. It can describe a person's speech, writing, or general way of thinking. The term suggests a deliberate and skillful use of concise and memorable expressions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epigrammatism of the novel made it difficult to understand.","correct":"✓ The epigrammatism of the novel made it enjoyable and thought-provoking.","note":"Epigrammatism is generally seen as a positive quality, adding wit and insight. If a work is difficult to understand, it may be due to other factors, not necessarily the use of epigrams."}],"priority":"★☆☆"},"related_words":{"derivatives":["epigram (noun): A concise, witty statement.","epigrammatic (adjective): Having the style or characteristics of an epigram.","epigrammatist (noun): A writer or speaker of epigrams."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epigrammatism' is a relatively uncommon term that describes the use of epigrams, which are short, witty, and often paradoxical statements. Understanding this word requires a good grasp of literary and rhetorical devices. It is most likely to be encountered in discussions of literature, philosophy, or rhetoric."},"example_sentences":[{"sentence":"The author's **epigrammatism** made his essays both entertaining and thought-provoking.","translation":"その作家の警句主義は、彼の随筆を面白く、かつ考えさせられるものにした。","type":"general"},{"sentence":"Oscar Wilde is famous for his **epigrammatism**.","translation":"オスカー・ワイルドは彼の警句主義で有名である。","type":"example"},{"sentence":"The politician's speech lacked substance but was full of empty **epigrammatism**.","translation":"その政治家の演説は内容に欠けていたが、空虚な警句主義に満ちていた。","type":"negative example"}]}