{"word":"Pyrrhonism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピュロン主義：古代ギリシアの哲学者ピュロンに始まる懐疑主義の一派。あらゆる知識の確実性を否定し、判断を保留すること（エポケー）によって心の平静（アタラクシア）を得ることを目指す。","english_definition":"A school of philosophical skepticism founded by Pyrrho of Elis in ancient Greece, which asserts that certainty is unattainable and advocates suspension of judgment (epoché) in order to achieve mental tranquility (ataraxia).","examples":[{"sentence":"Pyrrhonism emphasizes the limitations of human knowledge and the importance of questioning assumptions.","translation":"ピュロン主義は、人間の知識の限界と、前提を疑うことの重要性を強調する。"},{"sentence":"The central tenet of Pyrrhonism is that one should abstain from making dogmatic assertions about reality.","translation":"ピュロン主義の中心的な教義は、現実について独断的な主張をすることを控えるべきであるということである。"},{"sentence":"Unlike other forms of skepticism, Pyrrhonism does not deny the possibility of knowledge, but rather suspends judgment on whether knowledge is possible.","translation":"他の形態の懐疑主義とは異なり、ピュロン主義は知識の可能性を否定するのではなく、知識が可能かどうかについての判断を保留する。"}],"collocations":["Pyrrhonian skepticism","Pyrrhonian philosopher","practice Pyrrhonism","embrace Pyrrhonism","follow Pyrrhonism"],"synonyms":["skepticism","philosophical skepticism","epoché","ataraxia","zeteticism"],"antonyms":["dogmatism","assertion","certainty","belief","conviction"]}],"etymology":{"value":"ギリシア語の「Πυρρωνισμός (Pyrrhōnismos)」に由来。これは、ピュロン主義の創始者である哲学者ピュロン（Πύρρων, Pyrrhōn）の名前に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪrənɪzəm/","syllables":"Pyr-rho-nism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**Pyrrhonism**」は、哲学の文脈でのみ使用される専門用語です。日常会話で使われることはほとんどありません。哲学、特に懐疑主義の歴史や理論について議論する際に用いられます。ピュロン主義は、単なる疑念や不信感ではなく、特定の哲学的な立場を指すことに注意してください。判断を保留し、確実な知識を求めないことが特徴です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Pyrrhonism about climate change.","correct":"✓ He is a Pyrrhonian skeptic about climate change.","note":"「Pyrrhonism」は主義・学派を指す名詞であり、人に対して使う場合は「Pyrrhonian skeptic（ピュロン主義的な懐疑論者）」のように表現します。"},{"incorrect":"✗ Pyrrhonism is the same as cynicism.","correct":"✓ Pyrrhonism is a form of skepticism, but it is distinct from cynicism.","note":"ピュロン主義は懐疑主義の一種ですが、冷笑主義（cynicism）とは異なります。ピュロン主義は判断を保留しますが、冷笑主義は一般的に人々の動機や誠実さを疑います。"}],"priority":"★★☆"},"related_words":{"derivatives":["Pyrrhonian (形容詞：ピュロン主義の、名詞：ピュロン主義者)","Pyrrho (人名：ピュロン、ピュロン主義の創始者)","skepticism (懐疑主義)","epoché (判断保留)","ataraxia (心の平静)"],"idioms_phrases":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Pyrrhonism**」は、哲学の専門用語であり、一般的には高度な読解力を持つ読者層を対象としています。この単語は、古代ギリシアの哲学者ピュロンに由来する懐疑主義の一派を指し、知識の確実性を否定し、判断を保留することによって心の平静を得ることを目指す思想を意味します。この概念を理解するには、哲学史や認識論に関する一定の知識が必要となるため、一般読者には難解な場合があります。"},"example_sentences":[{"sentence":"The professor lectured on the principles of **Pyrrhonism**.","translation":"教授はピュロン主義の原則について講義した。","type":"noun","meaning_category":"ピュロン主義"},{"sentence":"A **Pyrrhonian** approach to epistemology involves questioning all claims to knowledge.","translation":"認識論へのピュロン主義的なアプローチは、知識に対するすべての主張を疑うことを伴う。","type":"adjective","meaning_category":"ピュロン主義の"},{"sentence":"By practicing **Pyrrhonism**, one can potentially achieve a state of tranquility by avoiding dogmatic beliefs.","translation":"ピュロン主義を実践することで、独断的な信念を避けることによって、心の平静の状態を達成できる可能性がある。","type":"noun","meaning_category":"ピュロン主義"}]}