{"word":"Ornithurous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having a tail like a bird's tail.","english_definition":"Having a tail resembling that of a bird.","examples":[{"sentence":"The ornithurous dinosaur had a distinctive fan-shaped tail.","translation":"その鳥尾状の恐竜は特徴的な扇形の尾を持っていた。"}],"collocations":["ornithurous dinosaur","ornithurous appendage"],"synonyms":["bird-tailed","feather-tailed"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ornis' (bird) and 'oura' (tail).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːrnɪˈθjʊərəs/","syllables":"or-ni-thu-rous"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms: more ornithurous, most ornithurous."},"usage_notes":{"explanation":"This term is primarily used in scientific or technical contexts, especially in paleontology or zoology, to describe animals with bird-like tails. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ornithurous bird flew away.","correct":"✓ The bird with an ornithurous tail flew away.","note":"The term describes the tail, not the entire animal, so it's better to use it as a descriptive adjective rather than implying the whole animal is ornithurous."}],"priority":"★☆☆"},"related_words":{"derivatives":["ornithoid (resembling a bird)","ornithology (the study of birds)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ornithurous' is a highly specialized term used in scientific contexts, particularly in zoology and paleontology, to describe animals possessing a tail that resembles a bird's tail. Due to its limited usage and technical nature, it is not commonly encountered outside of these fields. Understanding the etymology (from Greek 'ornis' for bird and 'oura' for tail) is helpful in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The paleontologists identified the fossil as belonging to an ornithurous dinosaur.","translation":"古生物学者たちはその化石を鳥尾状の恐竜に属するものと特定した。","type":"adjective","meaning_category":"Descriptive (tail-like)"}]}