{"word":"Autoparasitism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A form of parasitism in which the larva of a parasitic insect is parasitic on its own parent or other adult of the same species.","english_definition":"A parasitic relationship in which a parasite is itself parasitized by another member of the same species.","examples":[{"sentence":"Autoparasitism is a rare but fascinating phenomenon in certain wasp species.","translation":"自家寄生はまれですが、特定のハチの種における魅力的な現象です。"},{"sentence":"The life cycle of some insects involves autoparasitism as a survival strategy.","translation":"一部の昆虫のライフサイクルには、生存戦略として自家寄生が含まれています。"}],"collocations":["exhibit autoparasitism","study autoparasitism","rare form of autoparasitism","evolution of autoparasitism"],"synonyms":["hyperparasitism (sometimes used loosely)","intraspecific parasitism"],"antonyms":["mutualism","symbiosis"]}],"etymology":{"value":"Derived from 'auto-' (self), 'parasitism' (the practice of living as a parasite on another organism).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊˈpærəˌsɪtɪzəm/","syllables":"Au-to-par-a-si-tism"},"inflection":{"noun_plural":"Autoparasitisms"},"usage_notes":{"explanation":"Autoparasitism is a specialized term in biology, specifically entomology, referring to a parasitic relationship where the parasite's larva preys on adults of its own species. It is distinct from hyperparasitism, which involves a parasite being parasitized by a different species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Autoparasitism is when a parasite feeds on a different species.","correct":"✓ Autoparasitism is when a parasite's larva feeds on adults of its own species.","note":"Autoparasitism specifically involves parasitism within the same species, not a different one."}],"priority":"★★☆"},"related_words":{"derivatives":["autoparasitic (adjective)"],"related_terms":["parasitism","hyperparasitism","parasitoid","entomology"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autoparasitism' is a scientific term used in biology, particularly in entomology. It describes a specific type of parasitic relationship where the larva of a parasitic insect feeds on adults of its own species. This is a relatively rare phenomenon and is different from general parasitism, where a parasite feeds on a different species, or hyperparasitism, where a parasite is parasitized by another species. Understanding this term requires a background in biology or entomology."},"example_sentences":[{"sentence":"Some species of chalcid wasps exhibit autoparasitism as part of their complex life cycle.","translation":"一部のタマバチの種は、複雑なライフサイクルの一部として自家寄生を示します。","type":"scientific example","meaning_category":"Definition"},{"sentence":"Studies on autoparasitism can provide insights into the evolution of parasitic behaviors.","translation":"自家寄生に関する研究は、寄生行動の進化に関する洞察を提供することができます。","type":"research context","meaning_category":"Research Application"}]}