{"word":"earthmoving","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"土木工事、整地作業","english_definition":"The process of moving large quantities of soil or unformed earth, gravel, rock, or other material.","examples":[{"sentence":"Earthmoving is a crucial part of any construction project.","translation":"土木工事はあらゆる建設プロジェクトにおいて重要な部分です。"},{"sentence":"The company specializes in earthmoving and excavation.","translation":"その会社は土木工事と掘削を専門としています。"}],"collocations":["earthmoving equipment (土木機械)","earthmoving project (土木工事プロジェクト)","earthmoving contractor (土木請負業者)"],"synonyms":["excavation","grading","digging","soil removal","land clearing"],"antonyms":["land filling"]},{"part_of_speech":"adjective","definition":"土木工事用の、整地用の","english_definition":"Relating to or used in the process of moving large quantities of soil or unformed earth.","examples":[{"sentence":"Earthmoving machinery is used to prepare the site for building.","translation":"土木機械は建設用地の準備に使用されます。"},{"sentence":"The earthmoving operations were completed ahead of schedule.","translation":"整地作業は予定よりも早く完了しました。"}],"collocations":["earthmoving machinery (土木機械)","earthmoving equipment (土木機械)","earthmoving operations (土木作業)"],"synonyms":["excavating","grading","digging","soil-removing","land-clearing"],"antonyms":["land-filling"]}],"etymology":{"value":"The word 'earthmoving' is a compound word formed by combining 'earth' (referring to soil, ground, or land) and 'moving' (referring to the act of displacing or relocating something). It literally describes the action of moving earth from one place to another.","priority":"★★★"},"pronunciation":{"ipa":"ˈɜːθˌmuːvɪŋ/","syllables":"earth-mov-ing"},"inflection":{"notes":"As a noun, it is typically uncountable. As an adjective, it doesn't inflect."},"usage_notes":{"explanation":"'Earthmoving' refers to the process of moving large quantities of earth or other materials, typically in construction or civil engineering projects. It can also describe the equipment and machinery used for this purpose. The term is often used in the context of preparing a site for building or infrastructure development.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The earth moving was very difficult.","correct":"The earthmoving was very difficult.","note":"'Earthmoving' is often used as a single word, especially when referring to the activity itself."},{"incorrect":"They used a lot of earth move equipments.","correct":"They used a lot of earthmoving equipment.","note":"'Earthmoving' is used as an adjective to describe the equipment."}],"priority":"★★☆"},"related_words":{"derivatives":["earthmover (noun: a machine used for moving earth)","earthwork (noun: an engineering work involving the movement of earth)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Earthmoving' is a technical term generally used in the context of construction, civil engineering, and related fields. It refers to the process of moving large quantities of soil, rock, or other materials to prepare a site for building or other development. Understanding this term requires some familiarity with construction and engineering terminology."},"example_sentences":[{"sentence":"The **earthmoving** project required the removal of thousands of tons of soil.","translation":"その土木工事プロジェクトでは、数千トンもの土壌を除去する必要がありました。","type":"noun","meaning_category":"土木工事"},{"sentence":"The company invested in new **earthmoving** equipment to improve efficiency.","translation":"その会社は効率を改善するために、新しい土木機械に投資しました。","type":"adjective","meaning_category":"土木工事用の"},{"sentence":"Careful planning is essential for successful **earthmoving**.","translation":"土木工事を成功させるには、慎重な計画が不可欠です。","type":"noun","meaning_category":"土木工事"},{"sentence":"The **earthmoving** machinery prepared the ground for the new building.","translation":"土木機械が新しい建物のために地面を整地しました。","type":"adjective","meaning_category":"土木工事用の"}]}