{"word":"paper-windowed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"紙の窓のある、障子のある","english_definition":"Having windows made of paper, typically in a traditional Japanese or East Asian style.","examples":[{"sentence":"The traditional Japanese house was paper-windowed, allowing soft light to filter through.","translation":"その伝統的な日本の家は障子があり、柔らかい光が差し込んでいた。"},{"sentence":"The paper-windowed room was simple but elegant.","translation":"その障子のある部屋は質素だが上品だった。"}],"collocations":["paper-windowed room","paper-windowed house","paper-windowed screen"],"synonyms":["shoji-screened","translucent-windowed"],"antonyms":["glass-windowed","clear-windowed"]}],"etymology":{"value":"A compound adjective formed by combining 'paper' (referring to the material) and 'windowed' (having windows). The term specifically evokes the image of traditional East Asian windows made with translucent paper.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpeɪpərˌwɪndoʊd/","syllables":"pa-per-win-dowed"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The adjective 'paper-windowed' is primarily used to describe buildings or rooms that feature windows made of paper, particularly those in traditional Japanese or East Asian architecture. It emphasizes the delicate and translucent quality of the windows, which allow light to pass through softly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was paper window.","correct":"✓ The house was paper-windowed.","note":"'paper-windowed' is a single adjective, not a noun phrase. It describes the type of window the house has."}],"priority":"★★☆"},"related_words":{"derivatives":["paper (noun)","window (noun)","windowed (adjective)"],"related_terms":["shoji (noun): A Japanese paper screen serving as a room divider or window covering.","fusuma (noun): A Japanese sliding door or screen made of paper and wood.","washi (noun): Traditional Japanese paper."]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used primarily in descriptions of traditional architecture or cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paper-windowed' is a descriptive adjective used to specify that a structure or room has windows made of paper, often implying a traditional East Asian style. It is less common in everyday conversation and more likely to appear in descriptive writing about architecture, culture, or design. The term highlights the unique quality of paper windows, which diffuse light and create a soft, ambient atmosphere."},"example_sentences":[{"sentence":"The restaurant featured a private, paper-windowed dining area.","translation":"そのレストランには、プライベートな障子のある食事エリアがあった。","type":"descriptive","meaning_category":"description of a room"},{"sentence":"The old temple was famous for its beautifully crafted paper-windowed screens.","translation":"その古い寺は、美しく作られた障子で有名だった。","type":"descriptive","meaning_category":"description of a building"}]}