{"word":"nonsolubly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"不溶性に、溶けないように","english_definition":"In a nonsoluble manner; in a way that something cannot be dissolved.","examples":[{"sentence":"The compound is nonsolubly bound to the matrix.","translation":"その化合物はマトリックスに不溶性に結合している。"},{"sentence":"The pigment is added nonsolubly to the mixture to maintain its color.","translation":"顔料は、その色を維持するために、混合物に溶けないように加えられる。"}],"collocations":["nonsolubly bound","nonsolubly added","nonsolubly attached"],"synonyms":["insolubly","indissolubly"],"antonyms":["solubly","dissolvably"]}],"etymology":{"value":"Derived from \"nonsoluble\" (not soluble) + \"-ly\" (adverbial suffix). \"Nonsoluble\" is formed from the prefix \"non-\" (not) + \"soluble\" (capable of being dissolved).","priority":"★★☆"},"pronunciation":{"ipa":"/nɒnˈsɒljʊbli/","syllables":"non-sol-u-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Nonsolubly\" is used to describe the manner in which something is attached, mixed, or present in a substance such that it does not dissolve. It is often used in scientific or technical contexts. It is the adverbial form of the adjective \"nonsoluble,\" which means not capable of being dissolved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substance was nonsoluble in water, so it was nonsolubly.","correct":"✓ The substance was nonsoluble in water, so it remained undissolved.","note":"\"Nonsoluble\" is an adjective; \"nonsolubly\" is an adverb. The first part of the sentence needs an adjective to describe the substance."},{"incorrect":"✗ The dye was nonsolubly, making it hard to remove.","correct":"✓ The dye was nonsoluble, making it hard to remove.","note":"Here, the adjective form is needed to describe the dye's property."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsoluble (adjective)","solubility (noun)","soluble (adjective)","insoluble (adjective)","insolubly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonsolubly' is a technical term used to describe something that is done in a way that prevents it from dissolving. This word is most often found in scientific or technical writing where the properties of materials are being discussed. It's an uncommon word, so it's not typically used in everyday conversation."},"example_sentences":[{"sentence":"The protein was nonsolubly aggregated, making it difficult to study.","translation":"そのタンパク質は不溶性に凝集しており、研究が困難であった。","type":"adverb","meaning_category":"溶けないように"},{"sentence":"The ceramic particles are nonsolubly dispersed within the polymer matrix.","translation":"セラミック粒子はポリマーマトリックス内に不溶性に分散されている。","type":"adverb","meaning_category":"溶けないように"}]}