{"word":"Clavariaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ホウキタケ科 (ほうきたけか): キノコの一分類群","english_definition":"A family of fungi in the order Agaricales, characterized by simple or branched, club-shaped or coral-like fruiting bodies.","examples":[{"sentence":"Species in the Clavariaceae family are often found in forests.","translation":"ホウキタケ科の種は森林でよく見られる。"}],"collocations":[],"synonyms":["coral fungi","club fungi"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Clavaria', which comes from the Latin 'clava' meaning 'club', referring to the club-shaped fruiting bodies of many species in this family. The suffix '-aceae' is a standard taxonomic suffix used to denote a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌklævərɪˈeɪʃiˌaɪ/","syllables":"Cla-va-ri-a-ce-ae"},"inflection":{"notes":"Plural form is Clavariaceae (already plural as it refers to a family)."},"usage_notes":{"explanation":"Clavariaceae is a family within the Agaricales order of fungi. These fungi are often referred to as coral fungi or club fungi due to their distinctive shapes. Identification can be challenging, and mycological expertise is often required.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Clavaria (genus)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Clavariaceae' is a technical term used in mycology (the study of fungi) to refer to a specific family of fungi. It is unlikely to be encountered outside of scientific or specialist contexts. Understanding requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The taxonomy of the Clavariaceae is complex and subject to ongoing research.","translation":"ホウキタケ科の分類は複雑であり、現在も研究が進められている。","type":"general","meaning_category":"Taxonomy"},{"sentence":"Many members of Clavariaceae are saprophytic, decomposing organic matter in the soil.","translation":"ホウキタケ科の多くのメンバーは腐生植物であり、土壌中の有機物を分解する。","type":"general","meaning_category":"Ecology"}]}