{"word":"nongilled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"えら（鰓）のない","english_definition":"Lacking gills.","examples":[{"sentence":"The nongilled snail breathes through a lung.","translation":"そのえらのない巻貝は肺で呼吸する。"},{"sentence":"Nongilled fish are unable to extract oxygen from water.","translation":"えらのない魚は水から酸素を取り出すことができない。"}],"collocations":["nongilled snail","nongilled fish","nongilled organism"],"synonyms":["gillless"],"antonyms":["gilled"]}],"etymology":{"value":"\"non-\" (not) + \"gilled\" (having gills).","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈɡɪld/","syllables":"non-gilled"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"nongilled\" is primarily used in scientific or technical contexts, specifically in biology and zoology, to describe organisms that do not possess gills. It is often used in contrast to \"gilled\" organisms, which rely on gills for respiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nongilled mushroom.","correct":"✓ The mushroom is nongilled.","note":"Mushrooms are fungi and do not have gills in the same way that aquatic animals do. While some fungi have structures that resemble gills, the term 'nongilled' is not typically applied to them."}],"priority":"★☆☆"},"related_words":{"derivatives":["gill","gilled"],"related_terms":["respiration","aquatic","terrestrial","lung","trachea"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific or technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nongilled\" is a technical term used in biology to describe organisms that do not possess gills. It is formed by adding the prefix \"non-\" to \"gilled,\" indicating the absence of gills. This term is most likely to be encountered in scientific texts or discussions related to zoology, comparative anatomy, or respiratory systems. Understanding the meaning of \"gill\" is essential to comprehending \"nongilled.\""},"example_sentences":[{"sentence":"The study focused on the respiratory adaptations of various nongilled invertebrates.","translation":"その研究は、さまざまなえらのない無脊椎動物の呼吸適応に焦点を当てた。","type":"general","meaning_category":"general"},{"sentence":"Nongilled amphibians rely on cutaneous respiration to supplement oxygen intake.","translation":"えらのない両生類は、酸素摂取を補うために皮膚呼吸に頼っている。","type":"specific","meaning_category":"zoology"}]}