{"word":"intersubsistence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Mutual or reciprocal subsistence; the state of depending on each other for survival or sustenance.","english_definition":"The condition of mutual dependence for survival or sustenance.","examples":[{"sentence":"The intersubsistence of the various species within the ecosystem ensures its stability.","translation":"生態系内の様々な種の相互依存は、その安定性を保証します。"},{"sentence":"The two communities recognized their intersubsistence and began to cooperate on resource management.","translation":"その二つのコミュニティは、相互依存を認識し、資源管理において協力し始めた。"}],"collocations":["ecological intersubsistence","economic intersubsistence","social intersubsistence"],"synonyms":["interdependence","mutual dependence","reciprocal sustenance","symbiosis","coexistence"],"antonyms":["independence","self-sufficiency","autarky"]}],"etymology":{"value":"Derived from the prefix 'inter-' (between, among) combined with 'subsistence' (the state of remaining alive or in existence).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntər.səbˈsɪstəns","syllables":"in-ter-sub-sis-tence"},"inflection":{"noun_plural":"intersubsistences"},"usage_notes":{"explanation":"'Intersubsistence' emphasizes the reciprocal nature of dependence, where multiple entities rely on each other for their continued existence or well-being. It is often used in ecological, economic, or social contexts to highlight the interconnectedness of systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intersubsistence was broken when one species dominated.","correct":"✓ The intersubsistence was disrupted when one species dominated.","note":"'Broken' is less appropriate; 'disrupted' or 'undermined' better conveys the disturbance of mutual dependence."},{"incorrect":"✗ Intersubsistence is only important in nature.","correct":"✓ Intersubsistence is important in both nature and human societies.","note":"While often used in ecological contexts, intersubsistence also applies to economic and social relationships."}],"priority":"★★☆"},"related_words":{"derivatives":["subsistence","inter-","-ence"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intersubsistence' is a relatively uncommon term that describes the state of mutual dependence for survival. It is often used in academic or technical contexts, particularly in discussions of ecology, economics, or social systems. Understanding the prefix 'inter-' and the root word 'subsistence' can aid in comprehending its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The agricultural practices promoted intersubsistence among the local farmers.","translation":"その農業慣行は、地元の農家の間で相互扶助を促進した。","type":"general","meaning_category":"Mutual dependence"},{"sentence":"The economic crisis highlighted the intersubsistence of global markets.","translation":"経済危機は、グローバル市場の相互依存を浮き彫りにした。","type":"economic","meaning_category":"Economic interdependence"},{"sentence":"The study examined the intersubsistence of predator and prey populations.","translation":"その研究は、捕食者と被食者の個体群の相互依存を調査した。","type":"ecological","meaning_category":"Ecological interdependence"}]}