{"word":"ostomatid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A member of the family Ostomatidae of beetles, typically dark-colored and found under bark or in decaying wood.","english_definition":"Any beetle belonging to the family Ostomatidae, characterized by their typically dark coloration and habitat under bark or in decaying wood.","examples":[{"sentence":"The ostomatid beetle was found under the loose bark of the tree.","translation":"そのオストマティド科の甲虫は、木の剥がれた樹皮の下で見つかった。"}],"collocations":["ostomatid beetle","family Ostomatidae"],"synonyms":["bark-gnawing beetle"],"antonyms":[]}],"etymology":{"value":"Derived from the family name 'Ostomatidae', which comes from the Greek words 'osteo' (bone) and 'stoma' (mouth), referring to the bony structure around the mouthparts of these beetles.","priority":"★★☆"},"pronunciation":{"ipa":"/ɒˈstɒmətɪd/","syllables":"os-to-ma-tid"},"inflection":{"noun_plural":"ostomatids"},"usage_notes":{"explanation":"'Ostomatid' is primarily used in scientific or entomological contexts when discussing or identifying beetles belonging to the family Ostomatidae. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an ostomatid fly.","correct":"✓ I saw an ostomatid beetle.","note":"Ostomatids are beetles, not flies."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ostomatidae (family name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ostomatid' is a highly specialized term used in entomology to refer to beetles belonging to the family Ostomatidae. Due to its specific and scientific nature, it is not commonly encountered outside of academic or research contexts related to beetles and their classification."},"example_sentences":[{"sentence":"Entomologists study the diversity of ostomatid beetles in various forest ecosystems.","translation":"昆虫学者は、さまざまな森林生態系におけるオストマティド科の甲虫の多様性を研究している。","type":"noun","meaning_category":"beetle"},{"sentence":"The larvae of some ostomatid species are known to feed on decaying wood.","translation":"一部のオストマティド科の種の幼虫は、腐朽木を食べることで知られている。","type":"noun","meaning_category":"beetle"}]}