{"word":"self-denyingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"自己犠牲的に、禁欲的に、わが身を顧みず","english_definition":"In a self-denying manner; in a way that involves sacrificing one's own desires or interests.","examples":[{"sentence":"She self-denyingly gave up her own dreams to support her family.","translation":"彼女は自己犠牲的に家族を支えるために自分の夢を諦めた。"},{"sentence":"He worked self-denyingly for the benefit of the community.","translation":"彼は地域社会のために自己犠牲的に働いた。"},{"sentence":"The monk lived self-denyingly, renouncing all worldly possessions.","translation":"その僧侶は自己犠牲的な生活を送り、すべての世俗的な所有物を放棄した。"}],"collocations":["live self-denyingly","act self-denyingly","behave self-denyingly","give self-denyingly"],"synonyms":["altruistically","selflessly","ascetically","stoically","unselfishly","sacrificially"],"antonyms":["selfishly","greedily","hedonistically","indulgent"],"related_words":["self-denial","self-denying","self-sacrifice"]}],"etymology":{"value":"Derived from the adjective 'self-denying' (combining 'self' and 'denying') with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.dɪˈnaɪ.ɪŋ.li/","syllables":"self-di-ny-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Self-denyingly' describes actions or behaviors performed with a lack of self-interest, often involving the sacrifice of personal desires or comforts for the sake of others or a higher cause. It implies a conscious choice to forgo personal gratification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He self-denyingly is a good person.","correct":"✓ He is self-denyingly dedicated.","note":"'Self-denyingly' modifies actions or qualities, not states of being. It should be used to describe how someone acts, not simply to state that they are a certain type of person."},{"incorrect":"✗ She acted self-denial.","correct":"✓ She acted self-denyingly.","note":"'Self-denial' is a noun, whereas 'self-denyingly' is an adverb. Adverbs modify verbs, adjectives, or other adverbs."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adverb 'self-denyingly' describes an action done in a way that involves giving up one's own desires or interests, often for the benefit of others. It suggests a high degree of altruism and a willingness to sacrifice personal comfort or pleasure. This word is not commonly used in everyday conversation and is more often found in formal writing or discussions about ethics, morality, or religious practices."},"example_sentences":[{"sentence":"The nurse cared for the patients self-denyingly, often working long hours without complaint.","translation":"その看護師は自己犠牲的に患者の世話をし、文句も言わずに長時間働くことが多かった。","type":"general","meaning_category":"manner of acting"},{"sentence":"He self-denyingly donated all his wealth to charity.","translation":"彼は自己犠牲的に全財産を慈善団体に寄付した。","type":"general","meaning_category":"manner of giving"},{"sentence":"She lived self-denyingly, prioritizing the needs of her children above her own.","translation":"彼女は自己犠牲的な生活を送り、自分のニーズよりも子供たちのニーズを優先した。","type":"general","meaning_category":"manner of living"}]}