{"word":"tulip-grass","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A plant of the genus Sisyrinchium, especially Sisyrinchium angustifolium, having grass-like leaves and tulip-shaped flowers.","english_definition":"A plant of the genus Sisyrinchium, especially Sisyrinchium angustifolium, having grass-like leaves and tulip-shaped flowers.","examples":[{"sentence":"The meadow was dotted with vibrant patches of tulip-grass.","translation":"その牧草地には、鮮やかな色のチューリップグラスが点在していた。"},{"sentence":"Tulip-grass is often found in moist meadows and along stream banks.","translation":"チューリップグラスは、湿った牧草地や小川の土手沿いでよく見られる。"}],"collocations":["grow tulip-grass","patch of tulip-grass","field of tulip-grass"],"synonyms":["blue-eyed grass","Sisyrinchium","narrow-leaf blue-eyed grass"],"antonyms":[]}],"etymology":{"value":"Combination of 'tulip' (referring to the flower shape) and 'grass' (referring to the leaf shape).","priority":"Medium"},"pronunciation":{"ipa":"/ˈtjuːlɪpˌɡræs/","syllables":"tu-lip-grass"},"inflection":{"noun_plural":"tulip-grasses"},"usage_notes":{"explanation":"'Tulip-grass' is a common name for plants in the genus Sisyrinchium, particularly Sisyrinchium angustifolium. Despite the name, these plants are not true grasses but belong to the iris family (Iridaceae). They are characterized by their grass-like leaves and small, tulip-shaped flowers, typically blue or purple.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Tulip-grass is a true grass.","correct":"Tulip-grass is not a true grass; it belongs to the iris family.","note":"Tulip-grass is often mistaken for a true grass due to its foliage, but it is actually related to irises."}],"priority":"Low"},"related_words":{"derivatives":["Sisyrinchium angustifolium","blue-eyed grass"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not applicable","frequency_google_ngram":"Very low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'tulip-grass' refers to a specific type of plant, primarily Sisyrinchium angustifolium, characterized by its grass-like leaves and tulip-shaped flowers. This term is botanical and may not be commonly encountered outside of gardening or botany contexts. Understanding the plant's classification within the iris family is crucial for accurate identification and discussion."},"example_sentences":[{"sentence":"The delicate blue flowers of the tulip-grass swayed gently in the breeze.","translation":"チューリップグラスの繊細な青い花がそよ風に優しく揺れていた。","type":"general","meaning_category":"description"},{"sentence":"Many gardeners appreciate tulip-grass for its low maintenance and attractive foliage.","translation":"多くの庭師は、チューリップグラスの手入れのしやすさと魅力的な葉を高く評価している。","type":"horticulture","meaning_category":"gardening"}]}