{"word":"Taylorization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テイラー化、科学的管理法","english_definition":"The principles or practice of scientific management, especially as advocated by Frederick Winslow Taylor.","examples":[{"sentence":"Taylorization led to increased efficiency in factories.","translation":"テイラー化は工場の効率化につながった。"},{"sentence":"The workers protested against the Taylorization of their jobs.","translation":"労働者たちは仕事のテイラー化に抗議した。"}],"collocations":["scientific management","Taylor system"],"synonyms":["scientific management","Taylor system"],"antonyms":[]}],"etymology":{"value":"Named after Frederick Winslow Taylor (1856-1915), an American mechanical engineer who sought to improve industrial efficiency.","priority":"★★★"},"pronunciation":{"ipa":"/ˌteɪləraɪˈzeɪʃən/","syllables":"Tay-lor-i-za-tion"},"inflection":{"noun_plural":"Taylorizations"},"usage_notes":{"explanation":"Taylorization refers to the principles and practices of scientific management developed by Frederick Winslow Taylor. It involves analyzing and standardizing workflows to maximize efficiency and productivity, often through time and motion studies and division of labor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is Taylorizing their products.","correct":"✓ The company is implementing Taylorization in their production process.","note":"Taylorization is a process or system, not something that is directly applied to products. Instead, it's implemented in the production process."}],"priority":"★★☆"},"related_words":{"derivatives":["Taylorize (verb)"],"related_terms":["Frederick Winslow Taylor","scientific management","time and motion study","efficiency","productivity"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Taylorization is a term referring to the principles of scientific management developed by Frederick Winslow Taylor, aimed at improving industrial efficiency through standardized workflows and division of labor. It's a specialized term primarily used in the context of business, economics, and industrial engineering."},"example_sentences":[{"sentence":"The implementation of Taylorization increased output but also led to worker dissatisfaction.","translation":"テイラー化の導入は生産量を増加させたが、労働者の不満にもつながった。","type":"noun","meaning_category":"科学的管理法"},{"sentence":"Critics of Taylorization argue that it dehumanizes labor.","translation":"テイラー化の批判者たちは、それが労働を非人間化すると主張する。","type":"noun","meaning_category":"科学的管理法"}]}