{"word":"hairpiece","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"部分かつら、つけ毛","english_definition":"a partial wig or toupee, used to cover bald spots or add fullness to existing hair.","examples":[{"sentence":"He wears a hairpiece to cover his bald spot.","translation":"彼は禿げを隠すために部分かつらを着けている。"},{"sentence":"She added a hairpiece to give her hair more volume.","translation":"彼女は髪のボリュームを出すためにつけ毛をつけた。"},{"sentence":"The detective noticed that the suspect's hairpiece was slightly askew.","translation":"刑事は容疑者の部分かつらが少し傾いていることに気づいた。"}],"collocations":["wear a hairpiece (部分かつらを着ける)","attach a hairpiece (部分かつらを装着する)","remove a hairpiece (部分かつらを外す)","a synthetic hairpiece (合成繊維の部分かつら)","a human hair hairpiece (人毛の部分かつら)"],"synonyms":["wig","toupee","hair extension","false hair","partial wig"],"antonyms":["natural hair"],"related_words":["wiglet","fall","extension","weave"]}],"etymology":{"value":"'Hair' + 'piece'. A compound word formed from the noun 'hair' and 'piece'.","priority":"★★★"},"pronunciation":{"ipa":"ˈheərpiːs","syllables":"hair-piece"},"inflection":{"noun_plural":"hairpieces"},"usage_notes":{"explanation":"A 'hairpiece' is typically smaller than a full wig and is designed to blend in with the wearer's existing hair. It can be used for cosmetic reasons, such as adding volume or length, or to conceal hair loss. The term is often used interchangeably with 'toupee,' although 'toupee' generally refers specifically to a hairpiece worn by men to cover baldness on the top of the head.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a hair piece.","correct":"✓ He wore a hairpiece.","note":"'Hairpiece' is one word, not two. Using two words changes the meaning."},{"incorrect":"✗ She bought a hairpieces.","correct":"✓ She bought a hairpiece. / ✓ She bought hairpieces.","note":"'Hairpiece' is a countable noun, so it needs an article ('a') in the singular or be pluralized ('hairpieces')."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'hairpiece' refers to a partial wig or artificial hair used to cover bald spots or add volume to one's natural hair. It's a compound word, easy to understand once broken down. While not an everyday term, it is commonly used in contexts related to personal grooming, fashion, or theatrical productions. The word is relatively straightforward in meaning and usage, but its frequency is not very high in general conversation."},"example_sentences":[{"sentence":"The actor's hairpiece was so realistic that no one suspected he wasn't wearing his own hair.","translation":"その俳優の部分かつらはとてもリアルだったので、誰も彼が自分の髪ではないことに気づかなかった。","type":"general","meaning_category":"appearance"},{"sentence":"She chose a hairpiece that matched her natural hair color perfectly.","translation":"彼女は自分の髪の色に完璧に合った部分かつらを選んだ。","type":"general","meaning_category":"selection"},{"sentence":"The stylist carefully styled the hairpiece to blend seamlessly with her client's hair.","translation":"スタイリストは、部分かつらが顧客の髪にシームレスに馴染むように丁寧にスタイリングした。","type":"general","meaning_category":"styling"}]}