{"word":"spectrocomparator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分光比較器：スペクトル写真のスペクトル線を比較するための装置","english_definition":"An instrument for comparing the spectral lines on spectrograms.","examples":[{"sentence":"The spectrocomparator is used to measure the wavelengths of spectral lines.","translation":"分光比較器は、スペクトル線の波長を測定するために使用されます。"},{"sentence":"By using a spectrocomparator, scientists can identify the elements present in a sample.","translation":"分光比較器を使用することで、科学者はサンプル中に存在する元素を特定できます。"}],"collocations":["use a spectrocomparator","measure with a spectrocomparator","analyze using a spectrocomparator"],"synonyms":["spectrum comparator"],"antonyms":[]}],"etymology":{"value":"'Spectro-' (spectrum) + 'comparator' (比較するもの)","priority":"★★★"},"pronunciation":{"ipa":"/ˌspektrəʊˈkɒmpərˌeɪtər/","syllables":"spec-tro-com-pa-ra-tor"},"inflection":{"noun_plural":"spectrocomparators"},"usage_notes":{"explanation":"A spectrocomparator is a specialized instrument used primarily in astronomy and spectroscopy. It allows for the precise comparison of spectral lines, which are unique fingerprints of elements and compounds. This comparison is crucial for determining the composition, temperature, density, and velocity of celestial objects or laboratory samples.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ spectrocomparer","correct":"✓ spectrocomparator","note":"The correct term is 'spectrocomparator,' not 'spectrocomparer.'"},{"incorrect":"✗ spectroscope","correct":"✓ spectrocomparator","note":"A spectroscope is a more general instrument for observing spectra, while a spectrocomparator is specifically for comparing spectra on spectrograms."}],"priority":"★★☆"},"related_words":{"derivatives":["spectrogram","spectroscopy","spectrum"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★★★"},"readability_explanation":{"level":"C2","text":"A spectrocomparator is a sophisticated scientific instrument used to compare spectrograms. Spectrograms are visual representations of spectra, which are unique patterns of light emitted or absorbed by different substances. The spectrocomparator allows scientists to precisely measure and compare these patterns, enabling them to identify the composition and properties of materials. This instrument is primarily used in specialized fields such as astronomy and analytical chemistry."},"example_sentences":[{"sentence":"The astronomer used a spectrocomparator to analyze the spectra of distant stars.","translation":"天文学者は、遠い星のスペクトルを分析するために分光比較器を使用しました。","type":"example","meaning_category":"analysis of spectra"},{"sentence":"The spectrocomparator allowed for the precise measurement of wavelength shifts in the spectral lines.","translation":"分光比較器により、スペクトル線の波長シフトの正確な測定が可能になりました。","type":"example","meaning_category":"measurement of wavelength shifts"}]}