{"word":"cholesteatoma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"真珠腫","english_definition":"A destructive and expanding growth consisting of squamous epithelium in the middle ear and/or mastoid process.","examples":[{"sentence":"The patient was diagnosed with cholesteatoma after experiencing hearing loss and ear discharge.","translation":"患者は、難聴と耳漏を経験した後、真珠腫と診断された。"},{"sentence":"Surgery is often required to remove a cholesteatoma and prevent further damage.","translation":"真珠腫を除去し、さらなる損傷を防ぐためには、手術が必要となることが多い。"}],"collocations":["acquired cholesteatoma","congenital cholesteatoma","middle ear cholesteatoma","mastoid cholesteatoma","cholesteatoma surgery","remove cholesteatoma"],"synonyms":["epidermoid cyst","keratoma"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'chole' (bile), 'steat' (fat), and 'oma' (tumor). Despite the name, cholesteatomas are not tumors, nor do they contain bile or fat. The name is historical, based on early macroscopic observations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒlɪˌstiːəˈtoʊmə/","syllables":"cho-le-ste-a-to-ma"},"inflection":{"noun_plural":"cholesteatomas"},"usage_notes":{"explanation":"A cholesteatoma is an abnormal skin growth in the middle ear, behind the eardrum. It's usually caused by repeated infections, tears, or retraction of the eardrum. While not cancerous, it can damage the delicate bones of the middle ear, leading to hearing loss, dizziness, and facial paralysis if left untreated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cholesteatoma is a type of cancer.","correct":"✓ Cholesteatoma is not a type of cancer, but it can cause serious damage if left untreated.","note":"Cholesteatoma is a benign growth, not cancerous."},{"incorrect":"✗ Cholesteatoma always causes immediate and severe pain.","correct":"✓ Cholesteatoma may not cause pain initially, but symptoms like hearing loss and ear discharge are common.","note":"Pain is not always the primary symptom in the early stages."}],"priority":"★★☆"},"related_words":{"derivatives":["cholesteatomatous (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cholesteatoma is a medical term referring to an abnormal skin growth in the middle ear. It's important to understand that while it's not cancerous, it can cause significant damage if not treated. The term itself is derived from Greek roots, reflecting its historical naming based on early observations. Understanding the condition requires a grasp of medical terminology and the potential consequences of untreated ear infections.","priority":"★☆☆"},"example_sentences":[{"sentence":"Untreated cholesteatoma can lead to serious complications, including hearing loss and facial paralysis.","translation":"未治療の真珠腫は、難聴や顔面麻痺などの深刻な合併症を引き起こす可能性がある。","type":"medical","meaning_category":"disease"},{"sentence":"The ENT specialist recommended surgery to remove the cholesteatoma.","translation":"耳鼻咽喉科医は、真珠腫を除去するために手術を推奨した。","type":"medical","meaning_category":"treatment"}]}