{"word":"astrography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"天体記述学、星図作成（学）","english_definition":"The branch of astronomy concerned with mapping the positions and characteristics of stars and other celestial objects.","examples":[{"sentence":"Astrography is essential for creating accurate star charts.","translation":"天体記述学は正確な星図を作成するために不可欠です。"},{"sentence":"Early astrography relied on visual observations and manual measurements.","translation":"初期の天体記述学は、目視観測と手動測定に頼っていました。"},{"sentence":"Modern astrography uses advanced telescopes and digital imaging techniques.","translation":"現代の天体記述学は、高度な望遠鏡とデジタル画像処理技術を使用しています。"}],"collocations":["star chart","celestial mapping","astronomical observation","digital imaging","telescopic measurement"],"synonyms":["astrometry","celestial cartography"],"antonyms":[]}],"etymology":{"value":"\"Astrography\" combines \"astro-\" (from Greek \"astron\" meaning \"star\") and \"-graphy\" (from Greek \"graphia\" meaning \"writing\" or \"description\"). Thus, it literally means \"star writing\" or \"star description.\"","priority":"★★☆"},"pronunciation":{"ipa":"/æsˈtrɒɡrəfi/","syllables":"as-tro-gra-phy"},"inflection":{"noun_plural":"astrographies"},"usage_notes":{"explanation":"Astrography focuses on the descriptive and positional aspects of celestial objects. It differs from astrophysics, which deals with the physical properties and processes of these objects. Astrography is crucial for creating catalogs and maps that serve as fundamental resources for astronomers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrography studies the physical properties of stars.","correct":"✓ Astrophysics studies the physical properties of stars.","note":"Astrography deals with mapping and describing celestial objects, while astrophysics studies their physical properties."}],"priority":"★☆☆"},"related_words":{"derivatives":["astrographic (adjective)"],"related_terms":["astronomy","astrophysics","astrometry","celestial mechanics","cosmography"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used within astronomy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Astrography is a specialized term in astronomy that refers to the practice of mapping and describing the positions and characteristics of stars and other celestial objects. It's a more technical field than general astronomy and is often used in the context of creating star charts and astronomical catalogs. Understanding this term requires some background knowledge in astronomy.","priority":"★☆☆"},"example_sentences":[{"sentence":"The astrography project aimed to catalog millions of stars.","translation":"その天体記述学プロジェクトは、数百万の星をカタログ化することを目的としていました。","type":"general","meaning_category":"星図作成"},{"sentence":"Advances in astrography have greatly improved our understanding of the Milky Way.","translation":"天体記述学の進歩は、天の川に対する私たちの理解を大きく向上させました。","type":"general","meaning_category":"天体記述学"},{"sentence":"Precise astrography is needed to track the movement of asteroids.","translation":"小惑星の動きを追跡するには、正確な天体記述学が必要です。","type":"technical","meaning_category":"星図作成"}]}