{"word":"worship-paying","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Paying for worship services or religious activities; often implies a transactional or commercial aspect to religious practice.","english_definition":"Describes activities or systems where participation in worship or religious practices involves payment or financial contribution.","examples":[{"sentence":"The practice of worship-paying was criticized for turning faith into a commercial transaction.","translation":"礼拝にお金を払うという行為は、信仰を商業的な取引に変えてしまうとして批判された。"},{"sentence":"Some historical religious systems were based on a worship-paying model, where access to rituals required monetary contributions.","translation":"歴史的な宗教システムの中には、儀式への参加に金銭的な貢献を必要とする、礼拝にお金を払うモデルに基づいたものもあった。"}],"collocations":["worship-paying system","worship-paying model","worship-paying practice"],"synonyms":["tithe-based","fee-for-service religion"],"antonyms":["free worship","voluntary contribution"],"notes":"This term often carries a negative connotation, suggesting that religious devotion is being commodified."}],"etymology":{"value":"A compound word formed by combining 'worship' (the act of showing reverence and adoration for a deity) and 'paying' (the act of giving money in exchange for goods or services).","priority":"N/A"},"pronunciation":{"ipa":"/ˈwɜːrʃɪpˌpeɪɪŋ/","syllables":"wor-ship-pay-ing"},"inflection":{"notes":"As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Worship-paying' is a descriptive term used to critique or analyze religious practices where financial contributions are directly linked to participation in or access to religious services. It is not a commonly used term and often appears in discussions about the commercialization of religion.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is worship-paying every Sunday.","correct":"✓ He is paying for worship every Sunday.","note":"'Worship-paying' is an adjective, not a verb. Use a verb phrase like 'paying for worship' instead."}],"priority":"N/A"},"related_words":{"derivatives":["worship","paying"],"related_concepts":["tithe","offering","donation","commercialization of religion","prosperity gospel"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a common term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Worship-paying' is a specialized term used in discussions about the economics of religion. It describes situations where individuals are expected to pay for religious services or access to religious rituals. Understanding this term requires familiarity with concepts of religious economics and critiques of commercialism within religious institutions."},"example_sentences":[{"sentence":"The sociologist studied the effects of the worship-paying structure on community engagement.","translation":"社会学者は、礼拝にお金を払うという構造が地域社会の関与に与える影響を研究した。","type":"adjective","meaning_category":"Describing a system where worship involves payment"},{"sentence":"Critics argue that worship-paying can exclude lower-income individuals from participating fully in religious life.","translation":"批判者たちは、礼拝にお金を払うことが低所得者層を宗教生活への完全な参加から排除する可能性があると主張する。","type":"adjective","meaning_category":"Describing a system where worship involves payment"}]}