{"word":"cross-bombard","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(科学)交差照射する、交差爆撃する","english_definition":"To bombard (a target) from multiple directions simultaneously; specifically, in physics or chemistry, to subject a sample to bombardment by multiple types of particles or radiation.","examples":[{"sentence":"The scientists decided to cross-bombard the sample with alpha and beta particles.","translation":"科学者たちは、サンプルにアルファ粒子とベータ粒子を交差照射することに決めた。"},{"sentence":"The tumor was cross-bombarded with radiation from different angles to minimize damage to surrounding tissue.","translation":"腫瘍は周囲の組織への損傷を最小限に抑えるために、異なる角度から放射線を交差照射された。"}],"collocations":["cross-bombard with radiation","cross-bombard with particles","cross-bombard a target"],"synonyms":["bombard","irradiate","radiate","subject to radiation"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"(比喩)質問や批判などを集中的に浴びせる","english_definition":"(Figurative) To subject (someone) to a barrage of questions, criticisms, or attacks from multiple sources.","examples":[{"sentence":"The politician was cross-bombarded with questions from reporters after the scandal broke.","translation":"スキャンダルが発覚した後、政治家は記者たちから質問攻めにされた。"},{"sentence":"The company's new policy was cross-bombarded with criticism from both employees and customers.","translation":"その会社の新しい方針は、従業員と顧客の両方から批判の集中砲火を浴びた。"}],"collocations":["cross-bombard with questions","cross-bombard with criticism","cross-bombard with attacks"],"synonyms":["barrage","bombard","assail","attack","inundate"],"antonyms":["support","defend"]}],"etymology":{"value":"Combination of 'cross' (indicating multiple directions or sources) and 'bombard' (to attack with projectiles or radiation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɔs.bɒmˈbɑːrd/","syllables":"cross-bom-bard"},"inflection":{"verb_forms":{"present_simple":["cross-bombard","cross-bombards"],"past_simple":"cross-bombarded","past_participle":"cross-bombarded","present_participle":"cross-bombarding"}},"usage_notes":{"explanation":"The term 'cross-bombard' is used both in a literal, scientific context (e.g., in physics or medicine) to describe the simultaneous bombardment of a target from multiple directions, and in a figurative sense to describe being subjected to a barrage of questions or criticisms from multiple sources. The figurative usage implies a sense of being overwhelmed or attacked from all sides.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sample was bombarded crossly.","correct":"✓ The sample was cross-bombarded.","note":"'Crossly' is an adverb meaning 'in an angry way,' while 'cross-bombarded' is the correct term for bombardment from multiple directions."}],"priority":"★☆☆"},"related_words":{"derivatives":["cross-bombardment (noun)"],"phrasal_verbs":[],"related_terms":["bombardment","irradiation","radiation","barrage","attack"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cross-bombard' is a relatively uncommon term. In scientific contexts, it describes the process of bombarding a target from multiple directions simultaneously, often with different types of radiation or particles. Figuratively, it means to subject someone to a barrage of questions or criticisms from various sources at once. Understanding requires a grasp of both the literal and metaphorical meanings of 'bombard' and the concept of something coming from multiple directions ('cross-')."},"example_sentences":[{"sentence":"The team used a novel technique to cross-bombard the material with ions.","translation":"チームは、イオンを材料に交差照射する新しい技術を使用した。","type":"verb (vt)","meaning_category":"scientific"},{"sentence":"The CEO was cross-bombarded by shareholders demanding answers about the company's financial losses.","translation":"CEOは、会社の財政赤字について回答を求める株主たちから質問攻めにされた。","type":"verb (vt)","meaning_category":"figurative"}]}