{"word":"unequiangular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"等角でない、不等角の","english_definition":"Not equiangular; having unequal angles.","examples":[{"sentence":"An unequiangular polygon has angles of different measures.","translation":"不等角多角形は、異なる大きさの角を持ちます。"}],"collocations":["unequiangular polygon","unequiangular triangle"],"synonyms":["non-equiangular","scalene"],"antonyms":["equiangular"],"notes":"Often used in geometry to describe polygons, especially triangles, that do not have all angles equal.","related_words":["equiangular","polygon","angle","triangle"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) + 'equiangular' (having equal angles).","notes":"The term 'equiangular' is derived from 'equi-' (equal) + 'angular' (relating to angles)."},"pronunciation":{"ipa":"/ˌʌnɪˈkwɪæŋɡjələr/","syllables":"un-e-qui-an-gu-lar"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (e.g., more unequiangular, most unequiangular), which are rarely used for this word."},"usage_notes":{"explanation":"This term is primarily used in mathematical contexts, specifically in geometry. It describes shapes, particularly polygons, that do not have all their angles equal. The most common example is an unequiangular triangle (also known as a scalene triangle), where all three angles have different measures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The shape is unangular.","correct":"The shape is unequiangular.","note":"'Unequiangular' specifically refers to unequal angles, not the absence of angles."}],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily a technical term used in geometry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unequiangular' is a technical term used in geometry to describe shapes that do not have equal angles. It is primarily used in mathematical and academic contexts. Understanding this word requires familiarity with geometric concepts such as angles and polygons. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The quadrilateral was clearly unequiangular, with angles ranging from 60 to 120 degrees.","translation":"その四角形は明らかに不等角で、角度は60度から120度の範囲でした。","type":"descriptive","meaning_category":"geometry"},{"sentence":"Unlike an equilateral triangle, a scalene triangle is always unequiangular.","translation":"正三角形とは異なり、不等辺三角形は常に不等角です。","type":"comparative","meaning_category":"geometry"}]}