{"word":"Reeligibleness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再選出資格、再適格性","english_definition":"The state or condition of being reeligible; the quality of being able to be elected or chosen again for a position or office.","examples":[{"sentence":"The constitution outlines the reeligibleness requirements for the president.","translation":"憲法は大統領の再選出資格要件を概説している。"},{"sentence":"Her outstanding performance ensured her reeligibleness for the board.","translation":"彼女の傑出した業績は、彼女が理事会に再選出される資格を保証した。"}],"collocations":["assess reeligibleness","determine reeligibleness","meet the reeligibleness criteria","constitutional reeligibleness"],"synonyms":["re избираемость (Russian)","wiederwahlbarkeit (German)"],"antonyms":["ineligibility","disqualification"]}],"etymology":{"value":"Formed from \"reeligible\" (eligible to be elected or chosen again) + \"-ness\" (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɛlɪdʒɪbəlˌnɛs/","syllables":"ree-el-i-gi-ble-ness"},"inflection":{"noun_plural":"reeligiblenesses"},"usage_notes":{"explanation":"\"Reeligibleness\" is a formal noun that refers to the condition or state of being eligible for re-election or re-appointment. It is often used in legal, political, and organizational contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reeligibility of the candidate was questioned.","correct":"✓ The reeligibleness of the candidate was questioned.","note":"\"Reeligibility\" is a more common and slightly different word that refers to the quality of being reeligible. \"Reeligibleness\" is the state or condition of being reeligible."}],"priority":"★★☆"},"related_words":{"derivatives":["reeligible (adjective)","eligibility (noun)","eligible (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - A relatively rare word, primarily used in formal or legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Reeligibleness\" is a complex and rare word that is primarily used in formal or legal contexts. It refers to the state or condition of being eligible for re-election or re-appointment. Due to its formality and infrequent use, it is typically encountered by advanced English speakers. Understanding the word requires familiarity with the root words \"eligible\" and \"reeligible,\" as well as the suffix \"-ness.\""},"example_sentences":[{"sentence":"The committee reviewed the incumbent's record to assess his reeligibleness for another term.","translation":"委員会は、現職者の記録を再検討し、彼の再任資格を評価した。","type":"general","meaning_category":"再選出資格"},{"sentence":"The legal team debated the constitutional reeligibleness of the former president.","translation":"法務チームは、元大統領の憲法上の再選出資格について議論した。","type":"legal","meaning_category":"再選出資格"}]}