{"word":"Quadroons","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史的に)4分の1黒人の血を引く人（特にアメリカ合衆国において）","english_definition":"(Historically) A person who is one-quarter black by descent. (Especially in the United States)","examples":[{"sentence":"In the antebellum South, quadroons occupied a complex social position.","translation":"南北戦争前の南部では、カドゥルーンは複雑な社会的地位を占めていた。"},{"sentence":"The term 'quadroon' is now considered offensive due to its association with the one-drop rule and the history of racial classification.","translation":"「カドゥルーン」という言葉は、ワンドロップ・ルールや人種分類の歴史との関連から、現在では侮辱的であると考えられている。"}],"collocations":[],"synonyms":["octoroon","mulatto"],"antonyms":[]}],"etymology":{"value":"「quadroon」は、スペイン語の「cuarterón」またはポルトガル語の「quarterão」に由来し、「4分の1」を意味する「cuarto」から派生した。これは、その人の血統の4分の1が黒人であることを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/kwɒˈdruːn/","syllables":"qua-droons"},"inflection":{"noun_plural":"quadroons"},"usage_notes":{"explanation":"「**Quadroon**」という言葉は、歴史的な文脈において、ある人物の血統の4分の1がアフリカ系であることを指すために用いられていました。これは、特にアメリカ合衆国において、人種差別的な法律や社会的な構造の中で、人々を分類するために使われた用語です。現在では、この言葉は人種差別的な過去の遺物として、非常に侮辱的であると考えられています。この言葉の使用は避けるべきであり、より尊重的な言葉を使うことが推奨されます。人種に関する議論においては、歴史的な文脈を理解しつつも、現代的な感受性を持つことが重要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He identified as a quadroon.","correct":"✓ He was identified as a quadroon by others (historically). / ✓ It is more appropriate to describe someone's ancestry in terms of specific ethnic or national origins rather than using outdated racial classifications.","note":"現代においては、自己を「quadroon」と認識することは一般的ではありません。人種分類用語の使用は避け、具体的な民族的または国家的起源を説明する方が適切です。"},{"incorrect":"✗ Quadroons are a distinct race.","correct":"✓ Quadroon is a term used to describe a person's ancestry, not a distinct race.","note":"「Quadroon」は人種ではなく、血統を表す言葉です。人種分類は科学的根拠がなく、社会的な構築物であることを理解することが重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Mulatto","Octoroon","Creole","One-drop rule","Misegenation"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Quadroon**」は、歴史的な人種分類用語であり、ある人物の血統の4分の1がアフリカ系であることを指します。この用語は、特にアメリカ合衆国における奴隷制度の時代や、その後の人種差別的な社会構造の中で用いられました。現代においては、この言葉は侮辱的であり、使用は避けるべきです。人種に関する議論においては、歴史的な文脈を理解しつつも、現代的な感受性を持つことが重要です。より尊重的な言葉を使用し、人種差別的な過去の遺物を再生産しないように注意する必要があります。"},"example_sentences":[{"sentence":"The novel explored the life of a quadroon woman in 19th-century New Orleans.","translation":"その小説は、19世紀のニューオーリンズにおけるカドゥルーンの女性の生活を探求した。","type":"noun","meaning_category":"歴史的な人種分類"},{"sentence":"The term 'quadroon' reflects a history of racial categorization and discrimination.","translation":"「カドゥルーン」という言葉は、人種分類と差別の歴史を反映している。","type":"noun","meaning_category":"歴史的な人種分類"}]}