{"word":"Supremities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)至高性、最高位、至上権、最高権力","english_definition":"(plural form) the state or quality of being supreme; the highest authority or power.","examples":[{"sentence":"The supremities of the ancient gods were often challenged in myths.","translation":"古代の神々の至高性は、神話の中でしばしば挑戦された。"},{"sentence":"The supremities of the law must be upheld in a just society.","translation":"法における至上権は、公正な社会において維持されなければならない。"},{"sentence":"Different nations may have conflicting views on their respective supremities.","translation":"異なる国々は、それぞれの至上権について対立する見解を持つかもしれない。"}],"collocations":["divine supremities (神の至高性)","legal supremities (法の至上権)","national supremities (国家の至上権)"],"synonyms":["sovereignty","ascendancy","paramountcy","preeminence","supremacy"],"antonyms":["inferiority","subordination","dependence"]}],"etymology":{"value":"'Supremity' is derived from the Latin word 'supremus,' meaning 'highest' or 'utmost.' The suffix '-ity' is added to form a noun denoting a state or quality. Therefore, 'supremity' refers to the state of being supreme.","priority":"★★☆"},"pronunciation":{"ipa":"/sʊˈprɛmɪtiz/","syllables":"Su-prem-i-ties"},"inflection":{"noun_plural":"Supremities"},"usage_notes":{"explanation":"'Supremities' is the plural form of 'supremity,' which is a relatively uncommon word. It refers to multiple instances or aspects of supreme power, authority, or status. It is often used in formal or academic contexts when discussing abstract concepts of power, law, or divinity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supremitie of the king was absolute.","correct":"✓ The supremacy of the king was absolute.","note":"'Supremacy' is a more common and widely understood term than 'supremity.' While 'supremity' is correct, 'supremacy' is often preferred for clarity. 'Supremities' is used when referring to multiple instances or aspects of supreme power. "},{"incorrect":"✗ The supremities was challenged.","correct":"✓ The supremity was challenged. / ✓ The supremacies were challenged.","note":"'Supremities' is a plural noun and requires a plural verb. If referring to a single instance, use 'supremity' or 'supremacy.'"}],"priority":"★★☆"},"related_words":{"derivatives":["supreme (adjective: highest in rank or authority)","supremacist (noun: a person who believes in the supremacy of a particular group)","supremacy (noun: the state of being supreme)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supremities' is a formal and relatively rare word that means 'the state or quality of being supreme' in its plural form. It is used in academic or formal contexts when discussing different instances or aspects of supreme power or authority. It is more common to use 'supremacy' instead, as it is more widely understood. 'Supremities' is used when referring to multiple, distinct examples of supreme power or authority."},"example_sentences":[{"sentence":"The text explores the various supremities claimed by different empires throughout history.","translation":"そのテキストは、歴史を通じてさまざまな帝国によって主張されたさまざまな至上性を探求しています。","type":"noun","meaning_category":"至高性"},{"sentence":"Philosophical debates often center on the supremities of reason versus faith.","translation":"哲学的な議論は、しばしば理性と信仰の至上性を中心に展開されます。","type":"noun","meaning_category":"至高性"},{"sentence":"The treaty aimed to resolve the conflicting supremities of the neighboring nations.","translation":"その条約は、隣接する国々の対立する至上性を解決することを目的としていました。","type":"noun","meaning_category":"至高性"}]}