{"word":"mudir","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) An administrative title, roughly equivalent to a district governor, used in parts of the Ottoman Empire and its successor states, particularly in Egypt and Sudan.","english_definition":"(historical) An administrative title, roughly equivalent to a district governor, used in parts of the Ottoman Empire and its successor states, particularly in Egypt and Sudan.","examples":[{"sentence":"The mudir of the province was responsible for collecting taxes and maintaining order.","translation":"その州のムディルは、税金を徴収し、秩序を維持する責任を負っていた。"},{"sentence":"The British authorities often worked through local mudirs to implement their policies.","translation":"イギリス当局は、政策を実施するために、しばしば地元のムディルを通じて活動した。"}],"collocations":["mudir of the province","local mudir"],"synonyms":["governor","administrator","district head"],"antonyms":[]}],"etymology":{"value":"From Arabic مُدِير (mudīr), meaning 'manager, director, administrator'.","priority":"★★☆"},"pronunciation":{"ipa":"/muˈdɪər/","syllables":"mu-dir"},"inflection":{"noun_plural":"mudirs"},"usage_notes":{"explanation":"The term 'mudir' is primarily used in historical contexts when discussing the administrative structures of the Ottoman Empire, Egypt under British rule, and Sudan. It refers to a local official responsible for governing a district or province. The role and responsibilities of a mudir could vary depending on the specific region and period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the mudir of the company.","correct":"✓ He is the director/manager of the company.","note":"'Mudir' is a historical title and not generally used for modern company positions. Use 'director' or 'manager' instead."}],"priority":"★★★"},"related_words":{"derivatives":["mudiria (noun: the district or province governed by a mudir)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mudir' is a specialized term primarily encountered in historical texts relating to the Ottoman Empire, Egypt, and Sudan. Understanding its meaning requires familiarity with the administrative structures of these regions during specific historical periods. It is not a commonly used word in modern English.","priority":"★★☆"},"example_sentences":[{"sentence":"The mudir's office was located in the main city of the province.","translation":"ムディルの事務所は、その州の主要都市に位置していた。","type":"noun","meaning_category":"Administrative title"},{"sentence":"The mudir was tasked with resolving disputes among the local tribes.","translation":"ムディルは、地元の部族間の紛争を解決する任務を負っていた。","type":"noun","meaning_category":"Administrative title"}]}