{"word":"onomatology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"命名学、人名学、地名学","english_definition":"The study of the origin, history, and use of proper names, especially personal names (anthroponymy) and place names (toponymy).","examples":[{"sentence":"Onomatology helps us understand the cultural and historical context of names.","translation":"命名学は、名前の文化的および歴史的背景を理解するのに役立ちます。"},{"sentence":"The onomatology of this region reveals a rich linguistic history.","translation":"この地域の地名学は、豊かな言語史を明らかにしています。"}],"collocations":["study of onomatology","onomatological research","historical onomatology","regional onomatology"],"synonyms":["anthroponymy (人名学)","toponymy (地名学)","name study","name lore"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'onoma' (ὄνομα) meaning 'name' and '-logia' (-λογία) meaning 'study of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnəməˈtɒlədʒi/","syllables":"o-no-ma-tol-o-gy"},"inflection":{"noun_plural":"onomatologies"},"usage_notes":{"explanation":"Onomatology is a specialized field of linguistics that focuses on the systematic study of proper names. It encompasses both anthroponymy (the study of personal names) and toponymy (the study of place names). This field is important for understanding cultural history, migration patterns, and linguistic evolution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Onomatology is the study of onomatopoeia.","correct":"✓ Onomatology is the study of proper names.","note":"Onomatology is often confused with onomatopoeia, which is the formation of words that imitate sounds. Onomatology specifically studies names."}],"priority":"★★☆"},"related_words":{"derivatives":["onomatologist (命名学者、人名学者、地名学者)","onomastic (命名の、命名に関する)"],"related_fields":["linguistics (言語学)","etymology (語源学)","history (歴史学)","anthropology (人類学)","geography (地理学)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - A specialized term used primarily in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Onomatology' is a specialized term used in linguistics to refer to the study of the origin, history, and use of proper names. It is a field that requires understanding of etymology, historical context, and cultural influences on naming practices. This term is not commonly used in everyday conversation but is relevant in academic and research settings related to language and history."},"example_sentences":[{"sentence":"The professor specialized in the onomatology of ancient Roman settlements.","translation":"その教授は古代ローマの集落の地名学を専門としていた。","type":"general","meaning_category":"地名学の研究"},{"sentence":"Research in onomatology can reveal fascinating insights into cultural identity.","translation":"命名学の研究は、文化的アイデンティティに関する興味深い洞察を明らかにすることがあります。","type":"general","meaning_category":"命名学の研究"},{"sentence":"The onomatology of surnames provides clues about ancestral occupations.","translation":"姓の人名学は、祖先の職業に関する手がかりを提供します。","type":"general","meaning_category":"人名学の研究"}]}