{"word":"infumation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A method of execution or torture involving confinement in a chimney or other enclosed space and being suffocated by smoke or fumes.","english_definition":"A method of execution or torture in which the victim is confined in a chimney or other enclosed space and suffocated by smoke or fumes.","examples":[{"sentence":"Infumation was a cruel form of punishment used in some ancient cultures.","translation":"燻殺は、古代文化において用いられた残酷な処刑方法であった。"},{"sentence":"The historical records describe infumation as a particularly gruesome way to die.","translation":"歴史的記録は、燻殺を特にぞっとする死に方として記述している。"}],"collocations":["method of infumation","practice of infumation","historical infumation"],"synonyms":["suffocation by smoke","fumigation execution"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'infumare' meaning 'to smoke, to fill with smoke'; from 'in-' (in) + 'fumus' (smoke).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnfjuˈmeɪʃən/","syllables":"in-fu-ma-tion"},"inflection":{"noun_plural":"infumations"},"usage_notes":{"explanation":"The term 'infumation' refers specifically to the historical practice of killing someone by smoke inhalation within a confined space. It is not a common word in modern usage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of infumation is used to preserve food.","correct":"✓ The process of smoking is used to preserve food.","note":"Infumation refers to a specific method of execution, not food preservation. Use 'smoking' for food preservation."}],"priority":"★★☆"},"related_words":{"derivatives":["infume (verb, rare): to fill with smoke"],"related_terms":["fumigation","suffocation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a rare and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Infumation' is a rare and technical term referring to a specific historical method of execution involving smoke inhalation. Due to its limited usage and historical context, it is typically encountered in advanced texts on history, criminology, or related fields. Understanding the etymology helps to grasp its meaning, as it directly relates to filling a space with smoke."},"example_sentences":[{"sentence":"The ancient texts described the horrors of infumation in detail.","translation":"古代の文献は、燻殺の恐怖を詳細に記述していた。","type":"noun","meaning_category":"historical execution method"},{"sentence":"Infumation was a slow and agonizing way to die.","translation":"燻殺は、緩慢で苦痛に満ちた死に方であった。","type":"noun","meaning_category":"historical execution method"}]}