{"word":"body-centered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"身体を中心とした、身体に焦点を当てた","english_definition":"Focused on or relating to the body; emphasizing the importance of the body in physical, emotional, or spiritual well-being.","examples":[{"sentence":"She practices body-centered therapy to address her trauma.","translation":"彼女はトラウマに対処するために身体中心のセラピーを実践しています。"},{"sentence":"The workshop focuses on body-centered awareness and movement.","translation":"そのワークショップは、身体を中心とした意識と動きに焦点を当てています。"},{"sentence":"Body-centered practices can help reduce stress and improve overall health.","translation":"身体を中心とした実践は、ストレスを軽減し、全体的な健康を改善するのに役立ちます。"}],"collocations":["body-centered therapy","body-centered awareness","body-centered practice","body-centered approach","body-centered techniques"],"synonyms":["somatic","embodied"],"antonyms":["mind-centered","intellectual"],"notes":"Often used in the context of therapy, psychology, and holistic health."}],"etymology":{"value":"A compound word formed by combining 'body' and 'centered'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbɒdiˌsentərd/","syllables":"bod-y-cen-tered"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Body-centered' describes something that prioritizes the body and its sensations, movements, and experiences. It's often used to describe therapeutic approaches that emphasize the connection between the mind and body.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very body-centered person, he only cares about his looks.","correct":"✓ He is a very self-centered person, he only cares about his looks.","note":"'Body-centered' refers to a focus on the body's internal experience, while 'self-centered' means someone is primarily concerned with themselves."}],"priority":"N/A"},"related_words":{"derivatives":["body","center","centered"],"related_terms":["somatic experiencing","bodywork","mind-body connection"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Body-centered' is a term used in specialized fields like psychology and therapy to describe approaches that focus on the body's role in well-being. Understanding requires familiarity with these contexts."},"example_sentences":[{"sentence":"Body-centered psychotherapy explores the relationship between physical sensations and emotional states.","translation":"身体中心の心理療法は、身体感覚と感情状態の関係を探求します。","type":"general","meaning_category":"Therapy"},{"sentence":"The yoga class incorporated body-centered exercises to release tension.","translation":"ヨガのクラスでは、緊張を解放するために身体中心のエクササイズを取り入れました。","type":"general","meaning_category":"Exercise"},{"sentence":"Body-centered research investigates how trauma is stored in the body.","translation":"身体中心の研究は、トラウマがどのように身体に蓄積されるかを調査します。","type":"general","meaning_category":"Research"}]}