{"word":"Carpetbags","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) カーペット生地で作られた旅行鞄。また、南北戦争後の南部で私欲のために活動した北部出身者を指す軽蔑的な言葉。","english_definition":"(historical) A traveling bag made of carpeting. Also, a derogatory term for a Northerner who went to the South after the Civil War to profit from the Reconstruction.","examples":[{"sentence":"She packed her belongings into a carpetbag and prepared to leave.","translation":"彼女は所持品をカーペットバッグに詰め、出発の準備をした。"},{"sentence":"The locals viewed the carpetbaggers with suspicion and resentment.","translation":"地元の人々は、カーペットバッガーたちを疑念と憤慨の念をもって見ていた。"}],"collocations":["carpetbagger","carpetbag rule"],"synonyms":["traveling bag","suitcase"],"antonyms":[]}],"etymology":{"value":"「carpet」と「bag」の組み合わせ。初期のカーペットバッグは、安価で入手しやすいカーペット生地で作られていた。南北戦争後の南部で搾取的な活動を行った北部出身者を指す言葉としては、彼らが安価なカーペットバッグ一つでやってきて、すぐに立ち去る様子を揶揄する意味合いがあった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrpɪtbæɡz/","syllables":"car-pet-bags"},"inflection":{"noun_plural":"carpetbags"},"usage_notes":{"explanation":"「**Carpetbags**」という単語は、文字通りにはカーペット生地で作られた旅行鞄を指しますが、歴史的な文脈においては、南北戦争後の南部で私欲のために活動した北部出身者を指す軽蔑的な意味合いを持ちます。この言葉は、彼らが安価なカーペットバッグ一つでやってきて、すぐに立ち去る様子を揶揄するものでした。現代では、この歴史的な意味合いで使用されることは稀ですが、政治的な文脈で、ある地域に一時的に移住して選挙に出馬する候補者を批判する際に比喩的に用いられることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He carried a carpetbags to the office.","correct":"✓ He carried a briefcase to the office.","note":"現代では、カーペットバッグは一般的ではなく、ビジネスシーンではブリーフケースが適切です。"},{"incorrect":"✗ The carpetbags helped rebuild the South.","correct":"✓ Some carpetbaggers helped rebuild the South, but many were seen as opportunistic.","note":"カーペットバッガーの中には南部の再建に貢献した者もいましたが、多くは機会主義者と見なされていました。"}],"priority":"★★☆"},"related_words":{"derivatives":["carpetbagger (名詞: カーペットバッガー)","carpetbagging (名詞: カーペットバッガー行為)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Carpetbags**」は、主に歴史的な文脈で使用される単語です。文字通りの意味は「カーペットで作られた旅行鞄」ですが、南北戦争後のアメリカ南部で、再建期に利益を得ようと北部からやってきた人々を指す、やや軽蔑的な言葉として使われることが一般的です。この言葉は、彼らが安価なカーペットバッグ一つでやってきて、すぐに立ち去る様子を揶揄するものでした。現代では、この歴史的な意味合いで使用されることは稀ですが、政治的な文脈で比喩的に用いられることがあります。"},"example_sentences":[{"sentence":"The old photograph showed a woman carrying a large carpetbag.","translation":"その古い写真は、大きなカーペットバッグを持った女性を写していた。","type":"noun","meaning_category":"旅行鞄"},{"sentence":"Many Southerners resented the influence of carpetbaggers during Reconstruction.","translation":"多くの南部の人々は、再建期におけるカーペットバッガーたちの影響力を恨んでいた。","type":"noun","meaning_category":"北部出身者 (軽蔑的)"}]}