{"word":"non-sporogenous","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(生物学) 胞子を生成しない、非胞子形成性の","english_definition":"(biology) Not producing spores; incapable of forming spores.","examples":[{"sentence":"The non-sporogenous mutant strain was unable to reproduce via spores.","translation":"その非胞子形成性の変異株は、胞子による繁殖ができなかった。"},{"sentence":"Non-sporogenous bacteria are less likely to survive harsh environmental conditions.","translation":"非胞子形成性の細菌は、厳しい環境条件下で生き残る可能性が低い。"}],"collocations":["non-sporogenous bacteria","non-sporogenous mutant","non-sporogenous strain"],"synonyms":["aspogenous","asporogenic"],"antonyms":["sporogenous"],"related_terms":["spore","sporulation","sporogenesis"]}],"etymology":{"value":"'non-' (否定) + 'sporogenous' (胞子を生成する)","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn spɔˈrɒdʒənəs/","syllables":"non-spo-rog-e-nous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is primarily used in biology and microbiology to describe organisms, particularly bacteria and fungi, that do not produce spores. Spores are reproductive structures that allow organisms to survive harsh conditions. Therefore, non-sporogenous organisms are generally more vulnerable to environmental stressors.","priority":"medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency; primarily found in scientific literature.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'non-sporogenous' is a technical term used in biology, specifically microbiology. It describes organisms that lack the ability to produce spores. Understanding this term requires a background in biology, particularly knowledge of microbial reproduction and survival strategies."},"example_sentences":[{"sentence":"The study focused on the characteristics of non-sporogenous strains of Bacillus.","translation":"その研究は、バチルス属の非胞子形成性株の特性に焦点を当てた。","type":"scientific","meaning_category":"biology"},{"sentence":"Unlike its sporogenous counterpart, the non-sporogenous variant is easily eradicated with common disinfectants.","translation":"胞子形成性の対応物とは異なり、非胞子形成性の変異体は一般的な消毒剤で容易に根絶できる。","type":"scientific","meaning_category":"biology"}]}