{"word":"retaxation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再課税","english_definition":"The act of taxing something again, often referring to income or assets that have already been taxed in some form.","examples":[{"sentence":"The proposed retaxation of capital gains has sparked considerable debate.","translation":"提案されているキャピタルゲインへの再課税は、かなりの議論を引き起こしている。"},{"sentence":"Retaxation policies can significantly impact investment decisions.","translation":"再課税政策は、投資決定に大きな影響を与える可能性がある。"}],"collocations":["capital gains retaxation (キャピタルゲインへの再課税)","income retaxation (所得への再課税)","asset retaxation (資産への再課税)"],"synonyms":["reassessment","reimposition of tax"],"antonyms":["tax exemption","tax relief"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again') to the word 'taxation'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːtækˈseɪʃən/","syllables":"re-tax-a-tion"},"inflection":{"noun_plural":"retaxations"},"usage_notes":{"explanation":"'Retaxation' generally refers to the act of taxing something that has already been subject to taxation in some form. This can occur in various contexts, such as when income is taxed at the corporate level and then again when distributed to individuals as dividends. It is often a point of contention in tax policy debates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The retaxation was very effect on the economy.","correct":"✓ The retaxation had a significant effect on the economy.","note":"'Effect' is a noun, so it should be used with an article and a verb like 'had'. 'Affect' is the verb. Also, 'significant' is a better adjective than 'very effect'."},{"incorrect":"✗ Retaxation is when you tax something one time.","correct":"✓ Retaxation is when you tax something again that has already been taxed.","note":"Retaxation implies taxing something *again*, not just once."}],"priority":"★★☆"},"related_words":{"derivatives":["re-tax (verb)"],"phrases":["double taxation (二重課税)","taxation (課税)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Retaxation' is a relatively uncommon term that refers to the act of taxing something again, typically income or assets that have already been taxed in some form. Understanding this term requires a good grasp of tax policy and economic concepts. It is often used in discussions about tax reform and the fairness of the tax system."},"example_sentences":[{"sentence":"The government is considering the retaxation of certain investment vehicles.","translation":"政府は特定の投資手段への再課税を検討している。","type":"general","meaning_category":"再課税"},{"sentence":"Critics argue that retaxation discourages savings and investment.","translation":"批判者たちは、再課税が貯蓄と投資を阻害すると主張している。","type":"general","meaning_category":"再課税"}]}