{"word":"ineligibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"資格がない状態で、不適格な状態で","english_definition":"In a way that does not meet the necessary requirements; in a disqualified manner.","examples":[{"sentence":"He was ineligibly registered to vote because he lived outside the district.","translation":"彼は地区外に住んでいたため、投票資格がない状態で登録されていた。"},{"sentence":"The application was ineligibly submitted without the required documents.","translation":"申請書は必要な書類が添付されていなかったため、不適格な状態で提出された。"},{"sentence":"She competed ineligibly because she had used performance-enhancing drugs.","translation":"彼女はパフォーマンス向上薬を使用していたため、競技資格がない状態で出場した。"}],"collocations":["ineligibly registered","ineligibly submitted","ineligibly compete"],"synonyms":["disqualifiedly","unqualifiedly","unacceptably","improperly"],"antonyms":["eligibly","qualifiedly","acceptably","properly"]}],"etymology":{"value":"Derived from 'ineligible' (not qualified) + '-ly' (forming an adverb). 'Ineligible' comes from 'in-' (not) + 'eligible' (qualified).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈɛlɪdʒɪbli/","syllables":"in-el-i-gi-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Ineligibly' describes the manner in which someone or something fails to meet the required standards or qualifications. It emphasizes the state of being disqualified or not meeting the criteria. It is often used in formal contexts such as legal, administrative, or competitive situations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was ineligibly for the competition.","correct":"✓ He was ineligible for the competition. / ✓ He competed ineligibly.","note":"'Ineligible' is an adjective, describing the person. 'Ineligibly' is an adverb, describing how the person competed."},{"incorrect":"✗ The document was ineligibly.","correct":"✓ The document was submitted ineligibly.","note":"'Ineligibly' needs a verb to modify, describing how something was done."}],"priority":"★★☆"},"related_words":{"derivatives":["ineligible (adjective)","eligibility (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ineligibly' means 'in a way that does not qualify' or 'in a manner that is not permitted because of not meeting the necessary conditions'. It's used to describe actions or situations where someone or something is not allowed or qualified due to specific rules or requirements. This word is relatively formal and not commonly used in everyday conversation. You'll find it more often in legal, administrative, or competitive contexts where eligibility is a key factor."},"example_sentences":[{"sentence":"The team was penalized because they had ineligibly fielded a player who was over the age limit.","translation":"そのチームは年齢制限を超えた選手を資格がない状態で出場させたため、ペナルティを受けた。","type":"general","meaning_category":"disqualified"},{"sentence":"She was ineligibly appointed to the board due to a conflict of interest.","translation":"彼女は利益相反のため、理事に不適格な状態で任命された。","type":"general","meaning_category":"disqualified"},{"sentence":"The funds were spent ineligibly, violating the grant's terms and conditions.","translation":"資金は助成金の条件に違反して、不適格な状態で支出された。","type":"general","meaning_category":"disqualified"}]}