{"word":"Gastraeadae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A taxonomic family within the order Hemiptera (true bugs).","english_definition":"A family of true bugs, belonging to the order Hemiptera. They are commonly known as spittlebugs or froghoppers.","examples":[{"sentence":"The Gastraeadae family includes many species of spittlebugs.","translation":"Gastraeadae科には、多くのアワフキムシの種が含まれています。"}],"collocations":["spittlebug","froghopper","Hemiptera","insect","taxonomy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Gastraeadae is derived from the genus name Gastraea.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɡæstriˈeɪdəˌiː/","syllables":"Gas-trae-a-dae"},"inflection":{"noun_plural":"Gastraeadaes"},"usage_notes":{"explanation":"Gastraeadae is a scientific term used in biology to classify a specific family of insects. It is most commonly encountered in scientific literature or discussions related to entomology and taxonomy.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Gastraea"],"related_terms":["Hemiptera","Aphrophoridae","Cercopidae"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Gastraeadae\" is a highly specialized scientific term used within the field of entomology and taxonomy. It is unlikely to be encountered outside of academic or research contexts dealing specifically with the classification of insects. Understanding requires familiarity with biological nomenclature and taxonomic hierarchies."},"example_sentences":[{"sentence":"Studies on the phylogeny of Gastraeadae have revealed complex evolutionary relationships within the group.","translation":"Gastraeadaeの系統発生に関する研究は、グループ内の複雑な進化的関係を明らかにしました。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"The nymphs of Gastraeadae are known for creating a frothy spittle mass for protection.","translation":"Gastraeadaeの幼虫は、保護のために泡状の唾液塊を作ることが知られています。","type":"biological","meaning_category":"characteristics"}]}