{"word":"proteinase","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プロテイナーゼ、タンパク質分解酵素","english_definition":"An enzyme that catalyzes the hydrolysis of proteins into smaller peptides or amino acids.","examples":[{"sentence":"Proteinases are essential for various biological processes, including digestion and immune response.","translation":"プロテイナーゼは、消化や免疫応答を含む様々な生物学的プロセスに不可欠です。"},{"sentence":"Some bacteria produce proteinases to break down proteins in their environment.","translation":"一部の細菌は、環境中のタンパク質を分解するためにプロテイナーゼを産生します。"},{"sentence":"Proteinase inhibitors are used in some medications to block the activity of specific proteinases.","translation":"プロテイナーゼ阻害剤は、特定のプロテイナーゼの活性を阻害するために一部の医薬品で使用されます。"}],"collocations":["proteinase activity (プロテイナーゼ活性)","proteinase inhibitor (プロテイナーゼ阻害剤)","serine proteinase (セリンプロテイナーゼ)","aspartic proteinase (アスパラギン酸プロテイナーゼ)","metalloproteinase (メタロプロテイナーゼ)","cysteine proteinase (システインプロテイナーゼ)","digestive proteinase (消化プロテイナーゼ)"],"synonyms":["protease","peptidase","protein hydrolase"],"antonyms":[],"related_terms":["protein","peptide","amino acid","enzyme","hydrolysis","digestion","immune response","substrate","active site","catalysis"]}],"etymology":{"value":"Derived from 'protein' + '-ase' (suffix denoting an enzyme).","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊtiɪneɪz/","syllables":"pro-te-in-ase"},"inflection":{"noun_plural":"proteinases"},"usage_notes":{"explanation":"'Proteinase' is a general term for enzymes that break down proteins. It's often used interchangeably with 'protease' and 'peptidase'. The specific type of proteinase is often indicated by a prefix (e.g., serine proteinase, metalloproteinase).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Proteinase is a type of protein.","correct":"✓ Proteinase is a type of enzyme.","note":"Proteinase is an enzyme that breaks down proteins, not a type of protein itself."},{"incorrect":"✗ Proteinases only work inside the body.","correct":"✓ Proteinases can work both inside and outside the body.","note":"While proteinases are important for internal processes like digestion, they can also be produced by organisms to break down proteins in their environment."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proteinase' is a technical term used in biology, biochemistry, and medicine to refer to enzymes that catalyze the breakdown of proteins. It's typically encountered in scientific literature and discussions related to digestion, immune function, and enzyme mechanisms. Understanding the role of proteinases requires a basic knowledge of protein structure and enzyme activity."},"example_sentences":[{"sentence":"The researchers studied the activity of a specific proteinase in cancer cells.","translation":"研究者らは、癌細胞における特定のプロテイナーゼの活性を研究しました。","type":"scientific","meaning_category":"enzyme activity"},{"sentence":"Digestive proteinases break down proteins in food into smaller peptides and amino acids.","translation":"消化プロテイナーゼは、食物中のタンパク質をより小さなペプチドとアミノ酸に分解します。","type":"biological","meaning_category":"digestion"},{"sentence":"Some viruses use proteinases to process their own proteins during replication.","translation":"一部のウイルスは、複製中に自身のタンパク質を処理するためにプロテイナーゼを使用します。","type":"virological","meaning_category":"viral replication"}]}