{"word":"anti-statism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"反国家主義：国家の権力や介入に反対する政治的立場。","english_definition":"Opposition to state intervention into personal, social, and economic affairs.","examples":[{"sentence":"Anti-statism is a core tenet of anarchism.","translation":"反国家主義はアナーキズムの中核的な教義です。"},{"sentence":"Some libertarians advocate anti-statism to maximize individual freedom.","translation":"一部のリバタリアンは、個人の自由を最大化するために反国家主義を提唱しています。"},{"sentence":"The anti-statism movement seeks to reduce government control over people's lives.","translation":"反国家主義運動は、人々の生活に対する政府の支配を減らすことを目指しています。"}],"collocations":["advocate anti-statism (反国家主義を提唱する)","movement of anti-statism (反国家主義運動)","principle of anti-statism (反国家主義の原則)"],"synonyms":["anarchism","libertarianism","minimal statism"],"antonyms":["statism","collectivism","authoritarianism"]}],"etymology":{"value":"\"Anti-\" (反対) + \"statism\" (国家主義)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈsteɪtɪzəm/","syllables":"an-ti-stat-ism"},"inflection":{"notes":"This is a noun and does not have different inflections."},"usage_notes":{"explanation":"Anti-statism is a political philosophy that opposes the concentration of power in a central state. It encompasses a range of views, from advocating for minimal state intervention to the complete abolition of the state, as in anarchism. It often emphasizes individual liberty, free markets, and voluntary association.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a anti-statism.","correct":"He is an anti-statist.","note":"'Anti-statism' is a noun referring to the ideology. 'Anti-statist' is an adjective or noun referring to a person who holds anti-statist beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["anti-statist (adjective, noun)"],"related_concepts":["anarcho-capitalism","minarchism","voluntaryism"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in political science and philosophy contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Anti-statism' is a complex political term referring to opposition to state intervention. It's commonly used in political science, philosophy, and discussions about individual liberty and government power. Understanding this term requires familiarity with political ideologies such as anarchism and libertarianism."},"example_sentences":[{"sentence":"His political philosophy is rooted in **anti-statism**, advocating for minimal government intervention.","translation":"彼の政治哲学は反国家主義に根ざしており、政府の介入を最小限に抑えることを提唱しています。","type":"general"},{"sentence":"The rise of **anti-statism** can be attributed to growing distrust in government institutions.","translation":"反国家主義の台頭は、政府機関への不信感の高まりに起因すると考えられます。","type":"historical"},{"sentence":"**Anti-statism** often promotes the idea of free markets and individual responsibility.","translation":"反国家主義は、自由市場と個人の責任という考え方を促進することがよくあります。","type":"theoretical"}]}