{"word":"agonic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"苦悶の、死苦の、臨終の","english_definition":"Relating to or associated with agony, especially the agony of death; characterized by extreme suffering.","examples":[{"sentence":"The patient was in agonic pain.","translation":"患者は死苦にさいなまれていた。"},{"sentence":"The agonic phase of the illness was brief.","translation":"病気の臨終期は短かった。"}],"collocations":["agonic pain","agonic phase","agonic state"],"synonyms":["excruciating","agonizing","dying","terminal"],"antonyms":["painless","comfortable","living"]}],"etymology":{"value":"Derived from the Greek word \"agonia,\" meaning \"struggle, contest,\" particularly the struggle with death.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈɡɒnɪk/","syllables":"a-gon-ic"},"inflection":{"notes":"Adjective, comparative and superlative forms are possible (more agonic, most agonic) but rarely used."},"usage_notes":{"explanation":"\"Agonic\" is a relatively rare term, primarily used in medical or clinical contexts to describe the extreme suffering or the final stages of dying. It emphasizes the intense struggle and pain associated with death.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was agonic.","correct":"✓ The movie was agonizing.","note":"\"Agonic\" specifically relates to death or dying. For general suffering or torment, \"agonizing\" is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["agony (noun): extreme physical or mental suffering","agonize (verb): to struggle or suffer greatly"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Agonic' is a specialized term primarily encountered in medical or philosophical discussions concerning death, suffering, and the end of life. Its usage is infrequent in general conversation. Understanding requires familiarity with medical terminology and a nuanced grasp of suffering and mortality."},"example_sentences":[{"sentence":"The doctors worked to alleviate the patient's agonic symptoms.","translation":"医師たちは患者の死苦の症状を緩和しようと努めた。","type":"adjective","meaning_category":"苦悶の"},{"sentence":"The animal entered an agonic state after the accident.","translation":"その動物は事故後、臨終の状態に入った。","type":"adjective","meaning_category":"臨終の"}]}