{"word":"rhodopsin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ロドプシン (視紅: しこう)","english_definition":"A light-sensitive receptor protein involved in visual phototransduction. It is found in the rod cells of the retina and is a G protein-coupled receptor (GPCR).","examples":[{"sentence":"Rhodopsin is essential for vision in low light conditions.","translation":"ロドプシンは、暗い場所での視覚に不可欠である。"},{"sentence":"The bleaching of rhodopsin by light triggers a cascade of events leading to a nerve impulse.","translation":"光によるロドプシンの漂白は、神経インパルスにつながる一連のイベントを引き起こす。"}],"collocations":["rhodopsin molecule","rhodopsin bleaching","rhodopsin kinase","rhodopsin regeneration","rhodopsin mutation"],"synonyms":["visual purple"],"antonyms":[]},{"part_of_speech":"noun","definition":"(一般的に) 桿体細胞に含まれる光受容体タンパク質の総称","english_definition":"Any of a class of visual pigments found in the rod cells of the retina.","examples":[{"sentence":"Different species have rhodopsins that are sensitive to different wavelengths of light.","translation":"異なる種は、異なる波長の光に感受性を持つロドプシンを持っている。"}],"collocations":["vertebrate rhodopsin","invertebrate rhodopsin"],"synonyms":["photopigment"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ῥόδον (rhódon, \"rose\") + ὄψις (ópsis, \"sight\"), referring to its reddish-purple color.","priority":"★★☆"},"pronunciation":{"ipa":"/roʊˈdɒpsɪn/","syllables":"rho-dop-sin"},"inflection":{"noun_plural":"rhodopsins"},"usage_notes":{"explanation":"Rhodopsin is a light-sensitive pigment found in the rod cells of the retina, responsible for vision in low light conditions. It is a G protein-coupled receptor that undergoes a conformational change when it absorbs light, initiating a signaling cascade that leads to a nerve impulse. Rhodopsin is crucial for night vision and the perception of movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Rhodopsin is found in cone cells.","correct":"✓ Rhodopsin is found in rod cells.","note":"Rhodopsin is specifically located in rod cells, not cone cells. Cone cells contain different photopigments responsible for color vision. "},{"incorrect":"✗ Rhodopsin is responsible for color vision.","correct":"✓ Rhodopsin is responsible for vision in low light.","note":"Rhodopsin is primarily responsible for vision in low light conditions (night vision). Color vision is mediated by cone cells and their respective photopigments. "},{"incorrect":"✗ Rhodopsin is a type of vitamin.","correct":"✓ Rhodopsin is a protein.","note":"Rhodopsin is a protein, specifically a G protein-coupled receptor, not a vitamin."}],"priority":"★★☆"},"related_words":{"derivatives":["opsin","retinal","phototransduction","retina","rod cell","cone cell"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Rhodopsin is a specialized term in biology and biochemistry, specifically referring to the light-sensitive pigment in the rod cells of the retina. Understanding its function requires knowledge of cell biology, phototransduction, and the visual system. The term is typically encountered in advanced scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the effects of light exposure on rhodopsin levels in the retina.","translation":"その研究は、網膜内のロドプシンレベルに対する光曝露の影響を調査した。","type":"scientific","meaning_category":"scientific"},{"sentence":"Mutations in the rhodopsin gene can lead to various forms of retinal degeneration.","translation":"ロドプシン遺伝子の変異は、さまざまな形態の網膜変性につながる可能性がある。","type":"medical","meaning_category":"medical"},{"sentence":"Rhodopsin plays a critical role in the adaptation of the eye to darkness.","translation":"ロドプシンは、目が暗闇に順応する上で重要な役割を果たす。","type":"biological","meaning_category":"biological"}]}