{"word":"Hanifism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イスラム以前のアラビアにおける)一神教信仰、またはその信奉者","english_definition":"A monotheistic religious movement in pre-Islamic Arabia, or its adherents.","examples":[{"sentence":"Some scholars believe that Muhammad was influenced by Hanifism.","translation":"一部の学者は、ムハンマドがハニフ信仰の影響を受けたと考えている。"},{"sentence":"The Hanifs rejected idolatry and sought a purer form of worship.","translation":"ハニフたちは偶像崇拝を拒否し、より純粋な崇拝の形を求めた。"}],"collocations":["pre-Islamic Hanifism","the Hanif religion","a Hanif believer"],"synonyms":["monotheism","Abrahamic religion"],"antonyms":["polytheism","idolatry"]}],"etymology":{"value":"Derived from the Arabic word 'hanif' (حنيف), meaning 'revert' or 'inclined,' referring to those who turned away from idolatry towards a purer, monotheistic faith.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhænɪfɪzəm/","syllables":"ha-ni-fism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Hanifism' refers to a somewhat vague and debated religious phenomenon in pre-Islamic Arabia. It describes individuals or groups who, dissatisfied with the prevailing polytheism, sought a more monotheistic and ethical form of worship. The exact nature and extent of Hanifism are subjects of scholarly discussion, and its relationship to the later emergence of Islam is a complex issue.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hanifism is the same as Islam.","correct":"✓ Hanifism was a pre-Islamic monotheistic movement that may have influenced Islam.","note":"Hanifism predates Islam, although some scholars believe there may be connections or influences."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hanif (noun: a follower of Hanifism)"],"related_concepts":["Abrahamic religions","monotheism","pre-Islamic Arabia","paganism"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hanifism' is a specialized term used in the study of pre-Islamic Arabian religions. It refers to a group of monotheistic beliefs and practices that existed before the rise of Islam. Understanding this term requires familiarity with the historical and religious context of the Arabian Peninsula before the 7th century. It is not a commonly used word and is primarily found in academic or scholarly discussions. "},"example_sentences":[{"sentence":"Scholars debate the precise characteristics of pre-Islamic Hanifism.","translation":"学者たちはイスラム以前のハニフ信仰の正確な特徴について議論している。","type":"noun","meaning_category":"Religious movement"},{"sentence":"The Hanifs are believed to have rejected the idols worshipped at the Kaaba.","translation":"ハニフたちはカアバで崇拝されていた偶像を拒否したと考えられている。","type":"noun","meaning_category":"Religious movement"}]}