{"word":"nabobrynabobs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(humorous, rare) An extremely wealthy and ostentatious person, especially one who has made their fortune in a former colony.","english_definition":"(humorous, rare) A person of great wealth and prominence, especially one who has made a fortune in a colony and returned home to display it ostentatiously.","examples":[{"sentence":"The town was full of nabobrynabobs showing off their riches.","translation":"その町は、富をこれ見よがしに見せびらかす成金たちでいっぱいだった。"},{"sentence":"He became one of the nabobrynabobs after his successful business venture in the East.","translation":"彼は東洋でのビジネスの成功の後、成金の仲間入りをした。"}],"collocations":["a gathering of nabobrynabobs","the lifestyle of nabobrynabobs"],"synonyms":["nabob","nouveau riche","parvenu","plutocrat"],"antonyms":[]}],"etymology":{"value":"A humorous and extended form of \"nabob,\" which itself comes from the Urdu word \"nawab,\" referring to a provincial governor or wealthy person in India during the Mughal Empire. The reduplication and alteration to \"nabobrynabobs\" emphasizes the ostentatious and excessive nature of the wealth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌneɪboʊbrɪˈneɪbɒbz/","syllables":"na-bob-ry-na-bobs"},"inflection":{"noun_plural":"nabobrynabobs"},"usage_notes":{"explanation":"This word is rare and primarily used for humorous or satirical effect. It is a more elaborate and exaggerated version of \"nabob,\" highlighting the gaudiness and conspicuous consumption associated with newly acquired wealth, especially in the context of colonial fortunes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a nabobrynabobs of kindness.","correct":"✓ He was a nabobrynabobs showing off his wealth.","note":"The word specifically refers to wealth and ostentation, not general qualities like kindness."}],"priority":"★☆☆"},"related_words":{"derivatives":["nabob (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This word is highly uncommon and would likely only be encountered in specialized literature or humorous writing. Understanding requires familiarity with the term \"nabob\" and an appreciation for the humorous effect of reduplication and alteration. It implies a critical view of ostentatious wealth. "},"example_sentences":[{"sentence":"The party was attended by a collection of self-proclaimed nabobrynabobs.","translation":"そのパーティーには、自称成金趣味の人々が集まっていた。","type":"noun","meaning_category":"wealthy person"},{"sentence":"The novel satirized the excesses of the nabobrynabobs who had made fortunes in the colonies.","translation":"その小説は、植民地で財を成した成金たちの過剰な生活を風刺していた。","type":"noun","meaning_category":"wealthy person"}]}