{"word":"homoeoteleuton","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同尾音法、語尾反復","english_definition":"The occurrence of words with the same or similar endings in close proximity, especially in manuscripts, leading to errors of omission by scribes.","examples":[{"sentence":"The manuscript suffered from homoeoteleuton, with several lines missing due to the scribe's eye skipping from one similar ending to the next.","translation":"その写本は同尾音法の影響を受けており、筆記者の目が似たような語尾から次へと飛んでしまったために、いくつかの行が欠落していた。"}],"collocations":["manuscript homoeoteleuton","scribal homoeoteleuton","textual homoeoteleuton"],"synonyms":["end rhyme","terminal similarity"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ὁμοιοτέλευτον (homoiotéleuton), from ὁμοῖος (homoîos, “similar”) + τέλος (télos, “end”) + -τον (-ton, adjectival suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒmioʊtɪˈljuːtɒn/","syllables":"ho-me-o-te-leu-ton"},"inflection":{"noun_plural":"homoeoteleuta"},"usage_notes":{"explanation":"Homoeoteleuton is primarily a term used in textual criticism, especially when discussing ancient manuscripts. It refers to a specific type of scribal error where the scribe's eye jumps from one word ending to a similar word ending further down the text, causing them to omit the intervening text. This is more likely to occur when the manuscript is visually similar and lacks clear breaks between lines or sections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem was full of homoeoteleuton for stylistic effect.","correct":"✓ The poem was full of rhyme for stylistic effect.","note":"Homoeoteleuton is a scribal error, not a stylistic device. Rhyme is used for stylistic effect."}],"priority":"★☆☆"},"related_words":{"derivatives":["homoeo- (prefix meaning similar)","teleuton (suffix referring to the end)"],"phrasal_verbs":[],"related_terms":["haplography","dittography","textual criticism","scribal error"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Homoeoteleuton' is a highly specialized term primarily used within the academic field of textual criticism. It describes a specific type of error made by scribes when copying manuscripts, where similar word endings cause them to skip lines. Due to its niche usage, it is not commonly encountered outside of this context."},"example_sentences":[{"sentence":"The editor suspected homoeoteleuton when he noticed a sudden jump in the narrative, with similar endings in the surrounding lines.","translation":"編集者は、物語に突然の飛躍があり、周囲の行に同様の語尾があることに気づいたとき、同尾音法を疑った。","type":"noun","meaning_category":"scribal error"},{"sentence":"Careful collation of different manuscripts is necessary to identify and correct errors caused by homoeoteleuton.","translation":"同尾音法によって引き起こされたエラーを特定して修正するには、異なる写本を注意深く照合する必要がある。","type":"noun","meaning_category":"textual criticism"}]}