{"word":"Bodegón","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スペイン語)静物画、特に食べ物、飲み物、日用品などを描いたもの","english_definition":"(Spanish) a still life painting, typically depicting pantry items, such as victuals, game, and drink, often arranged on a simple tabletop, and also paintings with one or more figures, but significant still life elements, usually set in a kitchen or tavern.","examples":[{"sentence":"El bodegón español a menudo representa objetos humildes y cotidianos.","translation":"スペインのボデゴンは、質素で日常的な物を描くことが多いです。"},{"sentence":"Los bodegones de Zurbarán son famosos por su realismo.","translation":"スルバランのボデゴンは、その写実性で有名です。"}],"collocations":["bodegón español (スペインのボデゴン)","bodegón clásico (古典的なボデゴン)","pintar un bodegón (ボデゴンを描く)"],"synonyms":["naturaleza muerta (スペイン語で「静物」)","still life (英語で「静物」)"],"antonyms":[]}],"etymology":{"value":"スペイン語の「bodega」（酒蔵、食料品店）に由来する。元々は、酒蔵や食料品店に置かれているような物を描いた絵を指していた。","priority":"★★☆"},"pronunciation":{"ipa":"/bo̞.ð̞e̞ˈɣo̞n/","syllables":"bo-de-gón"},"inflection":{"noun_plural":"bodegones"},"usage_notes":{"explanation":"「**Bodegón**」は、スペイン語の美術用語で、特にスペインの静物画を指す場合に使われます。食べ物、飲み物、食器、花など、日常的な物を描いた絵画を指し、しばしば簡素なテーブルの上に配置された様子が描かれます。17世紀のスペイン美術で特に発展し、フアン・サンチェス・コターンやフランシスコ・デ・スルバランなどの画家が有名です。英語の「still life」とほぼ同義ですが、スペイン美術の文脈で使われることが多いです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ El bodegón es un retrato.","correct":"✓ El bodegón es una naturaleza muerta.","note":"ボデゴンは静物画であり、肖像画ではありません。"},{"incorrect":"✗ Bodegón solo se refiere a pinturas de frutas.","correct":"✓ Bodegón se refiere a pinturas de comida, bebida, objetos de cocina, etc.","note":"ボデゴンは果物だけでなく、食べ物、飲み物、台所用品など、様々な日常的な物を描いた絵画を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["bodega (酒蔵、食料品店)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 美術史やスペイン美術の文脈でのみ使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Bodegón**」は、スペイン語の美術用語で、静物画の一種を指します。特に、食べ物、飲み物、日用品などが描かれた絵画を指し、スペインの美術史において重要なジャンルです。英語の「still life」と似た意味ですが、スペイン美術の文脈でより頻繁に使用されます。美術史や絵画に興味がある人にとっては重要な単語ですが、日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"El Museo del Prado alberga una importante colección de bodegones españoles.","translation":"プラド美術館には、スペインのボデゴンの重要なコレクションがあります。","type":"noun","meaning_category":"静物画"},{"sentence":"Los bodegones de Luis Meléndez destacan por su representación realista de los alimentos.","translation":"ルイス・メレンデスのボデゴンは、食品の写実的な描写が際立っています。","type":"noun","meaning_category":"静物画"},{"sentence":"En la clase de pintura, aprendimos a crear un bodegón con frutas y verduras.","translation":"絵画の授業で、果物や野菜を使ったボデゴンを作ることを学びました。","type":"noun","meaning_category":"静物画"}]}