{"word":"Diogenean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ディオゲネス的な、犬儒学派の、禁欲的で世俗的な価値を軽蔑する","english_definition":"Relating to or characteristic of Diogenes or the Cynic school of philosophy; marked by cynicism, asceticism, and contempt for conventional values.","examples":[{"sentence":"His Diogenean lifestyle involved living in a barrel and rejecting societal norms.","translation":"彼のディオゲネス的な生活様式は、樽の中に住み、社会の規範を拒絶することを含んでいた。"},{"sentence":"The artist adopted a Diogenean attitude, criticizing the materialism of modern society.","translation":"その芸術家はディオゲネス的な態度を取り、現代社会の物質主義を批判した。"}],"collocations":["Diogenean lifestyle","Diogenean attitude","Diogenean philosophy"],"synonyms":["cynical","ascetic","austere","stoic","unconventional","nonconformist"],"antonyms":["conventional","materialistic","conformist","hedonistic"]}],"etymology":{"value":"Derived from the name of Diogenes of Sinope, a Greek philosopher and one of the founders of Cynicism.","priority":"★★★"},"pronunciation":{"ipa":"/daɪəˈdʒiːniən/","syllables":"Di-o-ge-ne-an"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'Diogenean' is used to describe a lifestyle or philosophy that is similar to that of Diogenes, characterized by a rejection of social norms, material possessions, and a focus on virtue and self-sufficiency. It often implies a critical or cynical view of society.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a Diogenes lifestyle.","correct":"✓ He lived a Diogenean lifestyle.","note":"The adjective form 'Diogenean' should be used to describe the lifestyle, not the philosopher's name."}],"priority":"★☆☆"},"related_words":{"derivatives":["Diogenes (noun)","Cynic (noun)","Cynicism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diogenean' is a sophisticated term used to describe something related to the ancient Greek philosopher Diogenes and his Cynic philosophy. It implies a rejection of societal norms and a focus on simple living and virtue. This term is not commonly used and is typically found in philosophical or historical contexts."},"example_sentences":[{"sentence":"The hermit's existence was a modern example of a Diogenean life.","translation":"その隠者の生活は、ディオゲネス的な生き方の現代的な例だった。","type":"adjective","meaning_category":"禁欲的で世俗的な価値を軽蔑する"},{"sentence":"His Diogenean critique of consumer culture resonated with many disillusioned young people.","translation":"彼の消費文化に対するディオゲネス的な批判は、多くの幻滅した若者の共感を呼んだ。","type":"adjective","meaning_category":"禁欲的で世俗的な価値を軽蔑する"}]}