{"word":"depenalization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非刑罰化、刑罰の廃止、犯罪としての扱いをやめること","english_definition":"the act of removing or reducing criminal penalties; the process of making something legal that was previously illegal or subject to criminal penalties.","examples":[{"sentence":"The depenalization of marijuana is a controversial issue in many countries.","translation":"マリファナの非刑罰化は多くの国で議論の的となっている問題です。"},{"sentence":"Advocates for depenalization argue that it would reduce the burden on the criminal justice system.","translation":"非刑罰化の支持者たちは、それが刑事司法制度への負担を軽減すると主張している。"},{"sentence":"The depenalization of certain minor offenses can help to free up resources for more serious crimes.","translation":"特定の軽微な犯罪の非刑罰化は、より重大な犯罪のために資源を解放するのに役立つ。"}],"collocations":["depenalization of marijuana (マリファナの非刑罰化)","depenalization of drug use (薬物使用の非刑罰化)","support depenalization (非刑罰化を支持する)","oppose depenalization (非刑罰化に反対する)"],"synonyms":["decriminalization","legalization","non-criminalization"],"antonyms":["criminalization","penalization"]},{"part_of_speech":"noun","definition":"(より広い意味で)罰則の軽減、罰則を軽くすること","english_definition":"the reduction or removal of penalties for an action or behavior, not necessarily limited to criminal penalties.","examples":[{"sentence":"The company announced the depenalization of late fees for library books.","translation":"その会社は図書館の本の延滞料金の罰則を軽減すると発表した。"},{"sentence":"Some schools are considering the depenalization of certain disciplinary infractions.","translation":"一部の学校では、特定の懲戒違反に対する罰則の軽減を検討している。"}],"collocations":["depenalization of late fees (延滞料金の罰則軽減)","depenalization of parking tickets (駐車違反切符の罰則軽減)"],"synonyms":["reduction of penalties","mitigation of punishment"],"antonyms":["increase of penalties","aggravation of punishment"]}],"etymology":{"value":"'Depenalization' is formed by adding the prefix 'de-' (meaning 'removal' or 'reversal') to 'penalization,' which itself comes from 'penal' (relating to punishment) + '-ization' (the process of making something).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌpiːnəlaɪˈzeɪʃən/","syllables":"de-pe-nal-i-za-tion"},"inflection":{"noun_plural":"depenalizations"},"usage_notes":{"explanation":"'Depenalization' specifically refers to the reduction or removal of penalties, often criminal penalties, for certain actions or behaviors. It is often used in the context of drug policy, but can also apply to other areas where penalties are imposed. It is distinct from 'legalization,' which involves making something entirely legal, whereas depenalization may simply reduce the severity of the penalties without fully legalizing the activity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The depenalization made the drug legal.","correct":"✓ The depenalization reduced the penalties for the drug. / ✓ The legalization made the drug legal.","note":"'Depenalization' does not necessarily make something legal; it only reduces or removes the penalties. 'Legalization' is the term for making something entirely legal."},{"incorrect":"✗ Depenalization is when you punish someone less.","correct":"✓ Depenalization is when you make the punishment less severe or remove it entirely.","note":"The definition should focus on the act of reducing or removing penalties, not on the act of punishing someone less."}],"priority":"★★☆"},"related_words":{"derivatives":["depenalize (verb)","penalization (noun)","penal (adjective)","penalty (noun)"],"phrases":["decriminalization (similar meaning, often used interchangeably)","legalization (making something fully legal)","harm reduction (strategies to minimize negative consequences)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Depenalization' is a formal term that refers to the process of reducing or removing criminal penalties for certain actions or behaviors. It's often used in discussions about drug policy, where some argue that certain drugs should be depenalized rather than criminalized. This means that possessing or using the drug would still be illegal, but the penalties would be less severe, such as a fine instead of jail time. The word is relatively uncommon and is mainly used in legal, political, and academic contexts."},"example_sentences":[{"sentence":"The government is considering the **depenalization** of minor drug offenses.","translation":"政府は軽微な薬物犯罪の非刑罰化を検討している。","type":"noun","meaning_category":"非刑罰化"},{"sentence":"The **depenalization** of parking violations has been proposed to reduce court congestion.","translation":"駐車違反の非刑罰化は、裁判所の混雑を緩和するために提案されている。","type":"noun","meaning_category":"罰則の軽減"},{"sentence":"The **depenalization** of marijuana could lead to significant tax revenue.","translation":"マリファナの非刑罰化は、多額の税収につながる可能性がある。","type":"noun","meaning_category":"非刑罰化"}]}