{"word":"nonconvergently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"収束せずに、非収束的に","english_definition":"In a manner that does not converge; in a way that diverges or fails to meet at a point.","examples":[{"sentence":"The series diverged nonconvergently, oscillating without approaching a limit.","translation":"その数列は非収束的に発散し、ある極限に近づくことなく振動した。"},{"sentence":"The iterative process behaved nonconvergently, making it unsuitable for solving the equation.","translation":"その反復プロセスは非収束的に振る舞い、その方程式を解くのには適していなかった。"}],"collocations":["diverge nonconvergently","behave nonconvergently","oscillate nonconvergently"],"synonyms":["divergently","non-uniformly","unboundedly"],"antonyms":["convergently","uniformly","boundedly"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'convergently'. 'Convergently' comes from 'convergent', which is derived from the verb 'converge', meaning 'to tend to meet at a point'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈvɜːrdʒəntli/","syllables":"non-con-ver-gent-ly"},"inflection":{"notes":"Adverbs do not typically inflect.","adverb_forms":{}},"usage_notes":{"explanation":"'Nonconvergently' is primarily used in technical contexts, especially in mathematics, physics, and computer science, to describe processes, series, or sequences that do not approach a specific limit or point. It indicates a lack of convergence, often implying divergence or oscillation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lines run nonconvergently, so they intersect.","correct":"✓ The lines run nonconvergently, so they do not intersect.","note":"Nonconvergent lines do not meet or intersect. If lines intersect, they are convergent at the point of intersection."},{"incorrect":"✗ The algorithm converged nonconvergently.","correct":"✓ The algorithm did not converge; it behaved nonconvergently.","note":"'Converged nonconvergently' is contradictory. Convergence and nonconvergence are mutually exclusive properties."}],"priority":"★★☆"},"related_words":{"derivatives":["nonconvergent (adjective)","convergence (noun)","divergence (noun)","converge (verb)"],"related_terms":["diverge","oscillate","asymptotic","limit","series","sequence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonconvergently' is a technical term used in mathematics, physics, and computer science to describe something that does not approach a limit or meet at a point. It is the opposite of 'convergently'. This term is typically encountered in advanced academic or technical texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The numerical method failed because the iterations behaved nonconvergently.","translation":"その数値解法は、反復計算が非収束的に振る舞ったため失敗した。","type":"adverb","meaning_category":"mathematics/numerical analysis"},{"sentence":"The light rays diverged nonconvergently after passing through the lens.","translation":"光線はレンズを通過した後、非収束的に発散した。","type":"adverb","meaning_category":"physics/optics"},{"sentence":"The algorithm oscillated nonconvergently, never settling on a stable solution.","translation":"そのアルゴリズムは非収束的に振動し、安定した解に落ち着くことはなかった。","type":"adverb","meaning_category":"computer science"}]}