{"word":"pride-fed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Nourished or sustained by pride.","english_definition":"Sustained or nourished by pride; deriving sustenance or satisfaction from pride.","examples":[{"sentence":"His actions were pride-fed, driven by a need to prove his superiority.","translation":"彼の行動はプライドによって養われており、自身の優位性を証明する必要性に駆り立てられていた。"},{"sentence":"The artist's ego was pride-fed, making constructive criticism difficult to accept.","translation":"その芸術家のエゴはプライドによって養われており、建設的な批判を受け入れることを困難にしていた。"}],"collocations":["pride-fed ego","pride-fed ambition","pride-fed arrogance"],"synonyms":["conceited","arrogant","haughty","self-satisfied"],"antonyms":["humble","modest","self-effacing"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'pride' and 'fed'. 'Pride' comes from Old English 'prīde,' denoting an excessive belief in one's own abilities. 'Fed' is the past participle of 'feed,' meaning to nourish or sustain. Thus, 'pride-fed' literally means nourished or sustained by pride.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪdˌfɛd/","syllables":"pride-fed"},"inflection":{"notes":"This is a compound adjective and does not have typical inflectional forms (comparative, superlative)."},"usage_notes":{"explanation":"'Pride-fed' is often used to describe someone whose ego, ambition, or actions are fueled by an excessive sense of self-importance or arrogance. It suggests that pride is not just a characteristic but a source of sustenance or motivation. The term carries a negative connotation, implying that this reliance on pride is detrimental or leads to undesirable behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was pride-feeding his ego.","correct":"✓ He had a pride-fed ego.","note":"'Pride-fed' is an adjective, not a verb. Use it to describe a noun, not as an action. "},{"incorrect":"✗ She was very pride-fed.","correct":"✓ Her ego was pride-fed.","note":"It is more common to use 'pride-fed' to describe a specific attribute (e.g., ego, ambition) rather than a person directly."}],"priority":"★★☆"},"related_words":{"derivatives":["pride (noun)","fed (verb)","self-pride (noun)","prideful (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pride-fed' is a relatively uncommon compound adjective used to describe something (usually an ego, ambition, or action) that is sustained or fueled by pride. The term implies a negative connotation, suggesting that this reliance on pride is excessive or detrimental. It is more frequently encountered in literary or analytical contexts rather than everyday conversation. Understanding the individual components ('pride' and 'fed') helps to grasp the overall meaning."},"example_sentences":[{"sentence":"His pride-fed arrogance alienated him from his colleagues.","translation":"彼のプライドに満ちた傲慢さは、彼を同僚から孤立させた。","type":"adjective","meaning_category":"negative characteristic"},{"sentence":"The dictator's power was pride-fed, built on a foundation of self-worship.","translation":"独裁者の権力はプライドによって養われており、自己崇拝の基盤の上に築かれていた。","type":"adjective","meaning_category":"power and arrogance"},{"sentence":"Her ambition, though admirable, was sometimes pride-fed and ruthless.","translation":"彼女の野心は称賛に値するものの、時にはプライドによって養われ、無慈悲だった。","type":"adjective","meaning_category":"ambition and ruthlessness"}]}