{"word":"hornotine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A hypothetical substance or chemical believed to cause or enhance sexual arousal.","english_definition":"(slang, humorous) A hypothetical substance or chemical believed to cause or enhance sexual arousal. Often used in fictional contexts.","examples":[{"sentence":"The mad scientist claimed to have invented hornotine.","translation":"そのマッドサイエンティストは、ホノチンを発明したと主張した。"},{"sentence":"The movie featured a plot revolving around the discovery of hornotine.","translation":"その映画は、ホノチンの発見をめぐるプロットを特徴としていた。"}],"collocations":["invent hornotine","discover hornotine","effects of hornotine"],"synonyms":["aphrodisiac","love potion","sexual stimulant"],"antonyms":[]}],"etymology":{"value":"A blend of \"hormone\" and \"erotic\", suggesting a substance that affects hormones related to sexual arousal. The term is often used humorously or in fictional contexts.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɔːrnətiːn/","syllables":"hor-no-tine"},"inflection":{"notes":"It is a noun, so it can be pluralized (hornotines), but it is rarely used in plural form."},"usage_notes":{"explanation":"\"Hornotine\" is primarily a slang term used humorously or in fictional settings to describe a substance believed to cause or enhance sexual arousal. It is not a real chemical or substance. The term is often used to satirize or parody scientific concepts related to sexuality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hornotine is a real drug.","correct":"✓ Hornotine is a fictional substance.","note":"Hornotine is not a real drug or chemical compound."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (primarily used in specific online communities or fictional contexts)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Hornotine\" is a slang term, primarily used in humorous or fictional contexts. It's a made-up word, combining \"hormone\" and \"erotic,\" to suggest a substance that enhances sexual arousal. It's not a real chemical, so you'll mainly encounter it in jokes, stories, or discussions about fictional substances.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The comedian joked about the side effects of hornotine.","translation":"コメディアンはホノチンの副作用について冗談を言った。","type":"noun","meaning_category":"hypothetical substance"},{"sentence":"In the science fiction novel, hornotine was the key to controlling the population.","translation":"そのSF小説では、ホノチンは人口を制御するための鍵だった。","type":"noun","meaning_category":"hypothetical substance"}]}