{"word":"Heliconiidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) チョウ目ドクチョウ科","english_definition":"(zoology) The family of butterflies containing the heliconians or longwings.","examples":[{"sentence":"The Heliconiidae are known for their bright colors and long lifespans.","translation":"ドクチョウ科は、鮮やかな色彩と長い寿命で知られています。"}],"collocations":["Heliconiidae butterfly","Heliconiidae larvae"],"synonyms":["longwings"],"antonyms":[]}],"etymology":{"value":"New Latin, from Heliconius + -idae (standard suffix to indicate a zoological family). Heliconius is a genus within this family, named after Mount Helicon, a mountain in Greece associated with the Muses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛlɪkəˈnaɪɪdiː/","syllables":"He-li-co-ni-i-dae"},"inflection":{"noun_plural":"Heliconiidae (same form for singular and plural)"},"usage_notes":{"explanation":"Heliconiidae is a scientific term used in zoology to refer to a specific family of butterflies. It's primarily used in scientific contexts or when discussing butterfly classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heliconiidae is a type of bird.","correct":"✓ Heliconiidae is a family of butterflies.","note":"Heliconiidae refers to butterflies, not birds."}],"priority":"★☆☆"},"related_words":{"derivatives":["Heliconiinae (subfamily)","Heliconius (genus)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Heliconiidae is a technical term used in biology, specifically zoology, to classify a family of butterflies known as heliconians or longwings. This term is typically encountered in scientific literature, academic discussions, or specialized contexts related to entomology. Understanding and using this term requires a high level of scientific literacy. The term is derived from the genus name Heliconius, which is itself named after Mount Helicon in Greek mythology, a mountain associated with the Muses."},"example_sentences":[{"sentence":"Research on Heliconiidae has provided valuable insights into mimicry and coevolution.","translation":"ドクチョウ科に関する研究は、擬態と共進化に関する貴重な洞察を提供してきました。","type":"scientific","meaning_category":"zoology"},{"sentence":"The distribution of Heliconiidae is primarily in the tropical and subtropical regions of the Americas.","translation":"ドクチョウ科の分布は、主にアメリカ大陸の熱帯および亜熱帯地域です。","type":"scientific","meaning_category":"zoology"}]}