{"word":"thickenable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"とろみをつけることができる、濃くすることができる","english_definition":"Capable of being thickened; able to have its consistency increased.","examples":[{"sentence":"This sauce is thickenable with cornstarch.","translation":"このソースはコーンスターチでとろみをつけることができます。"},{"sentence":"They used a thickenable liquid for the patient with dysphagia.","translation":"彼らは嚥下障害のある患者のために、とろみをつけることができる液体を使いました。"}],"collocations":["thickenable liquid (とろみをつけることができる液体)","thickenable sauce (とろみをつけることができるソース)"],"synonyms":["viscosifiable","congealable"],"antonyms":["thinable","liquefiable"]},{"part_of_speech":"noun","definition":"とろみ調整食品、増粘剤","english_definition":"A substance that can be added to a liquid to increase its viscosity.","examples":[{"sentence":"We need to buy some thickenables for my grandmother.","translation":"祖母のためにとろみ調整食品を買う必要があります。"},{"sentence":"The recipe calls for a small amount of thickenables.","translation":"レシピには少量の増粘剤が必要です。"}],"collocations":["commercial thickenables (市販のとろみ調整食品)","natural thickenables (天然の増粘剤)"],"synonyms":["thickening agent","thickener","viscosity modifier"],"antonyms":["thinning agent"]}],"etymology":{"value":"The word 'thickenable' is formed by adding the suffix '-able' to the verb 'thicken'. 'Thicken' comes from Middle English 'thikkenen', derived from 'thick'. The suffix '-able' indicates the capacity or ability to be acted upon.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɪkənəbəl/","syllables":"thick-en-a-ble"},"inflection":{"notes":"The adjective form has comparative and superlative forms (more thickenable, most thickenable), but these are rarely used. The noun form is typically used in the plural ('thickenables') when referring to multiple products or types of thickening agents."},"usage_notes":{"explanation":"'Thickenable' is most commonly used in the context of food preparation, especially in relation to sauces, soups, and beverages. It is also frequently used in the medical field, particularly when discussing dietary modifications for individuals with dysphagia (difficulty swallowing). In this context, 'thickenable liquids' are used to reduce the risk of aspiration. While primarily used as an adjective, 'thickenable' can also function as a noun referring to a thickening agent or a product designed for thickening liquids.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This juice is not thicken.","correct":"✓ This juice is not thickenABLE.","note":"'Thicken' is a verb, while 'thickenable' is an adjective describing something that *can* be thickened. The correct adjective form must be used."},{"incorrect":"✗ I need to buy some thicken for my soup.","correct":"✓ I need to buy some thickenABLEs for my soup.","note":"When referring to a thickening agent, the correct term is 'thickenable' (or 'thickener'). Using 'thicken' as a noun is incorrect. Also, it is typically used in plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["thicken (verb: to become or make something thicker)","thickener (noun: a substance used to thicken a liquid)","thickening (noun: the process of becoming or making something thicker; adjective: used for thickening)","thickness (noun: the measurement of how thick something is)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thickenable' is a specialized term primarily used in culinary and medical contexts. Understanding its meaning requires familiarity with the concept of viscosity and the process of increasing the consistency of liquids. The word's usage is often associated with specific dietary needs or cooking techniques, making it less common in general conversation. Therefore, a higher level of English proficiency is needed to fully grasp its meaning and appropriate usage."},"example_sentences":[{"sentence":"Is this milk **thickenable**?","translation":"このミルクはとろみをつけることができますか？","type":"adjective","meaning_category":"capable of being thickened"},{"sentence":"She added a **thickenable** to her coffee to help with her swallowing difficulties.","translation":"彼女は嚥下困難を緩和するために、コーヒーにとろみ調整食品を加えました。","type":"noun","meaning_category":"とろみ調整食品"},{"sentence":"The recipe suggests using a **thickenable** such as cornstarch or tapioca flour.","translation":"レシピでは、コーンスターチやタピオカ粉のような増粘剤の使用を勧めています。","type":"noun","meaning_category":"増粘剤"},{"sentence":"This product is designed to make liquids **thickenable** for people with dysphagia.","translation":"この製品は、嚥下障害のある人が液体にとろみをつけることができるように設計されています。","type":"adjective","meaning_category":"capable of being thickened"}]}