{"word":"heavy-tailed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(統計)裾が重い、ヘビーテイルの","english_definition":"(statistics) having a probability distribution with tails that are 'heavier' than those of the exponential distribution; that is, the tails are not exponentially bounded.","examples":[{"sentence":"The distribution of stock market returns is heavy-tailed.","translation":"株式市場のリターンの分布は裾が重い。"},{"sentence":"Heavy-tailed distributions are common in finance and insurance.","translation":"裾が重い分布は金融や保険でよく見られる。"}],"collocations":["heavy-tailed distribution (裾が重い分布)","heavy-tailed random variable (裾が重い確率変数)"],"synonyms":["leptokurtic"],"antonyms":["thin-tailed","light-tailed"],"related_terms":["power law","Pareto distribution","long-tailed"],"notes":"Heavy-tailed distributions have a higher probability of extreme values compared to normal distributions.","usage":"Used in statistics, probability theory, finance, and other fields to describe distributions with extreme outliers.","level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'heavy-tailed' refers to a statistical distribution where extreme values are more likely to occur than in a normal distribution. This concept is important in fields like finance, where understanding the risk of rare but significant events is crucial. Understanding heavy-tailed distributions requires some familiarity with statistical concepts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The insurance company uses heavy-tailed models to assess the risk of catastrophic events.","translation":"その保険会社は、壊滅的な出来事のリスクを評価するために、裾が重いモデルを使用しています。","type":"example","meaning_category":"Risk Assessment"},{"sentence":"Many network phenomena, such as the spread of viruses, exhibit heavy-tailed behavior.","translation":"ウイルスの拡散など、多くのネットワーク現象は、裾が重い挙動を示します。","type":"example","meaning_category":"Network Analysis"}]}],"etymology":{"value":"The term 'heavy-tailed' is derived from the visual appearance of the probability distribution's tails, which are 'heavier' or thicker than those of a normal or exponential distribution. This indicates a higher probability of observing extreme values.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌhɛvi ˈteɪld/","syllables":"hev-y-tailed"},"inflection":{"notes":"It is an adjective and does not inflect."}}