{"word":"Propagability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"伝播性、繁殖性、普及性","english_definition":"The quality of being propagable; the ability to be propagated, spread, or reproduced.","examples":[{"sentence":"The propagability of the virus is a major concern for public health officials.","translation":"そのウイルスの伝播性は公衆衛生当局にとって大きな懸念事項です。"},{"sentence":"The propagability of this plant species makes it an invasive threat to local ecosystems.","translation":"この植物種の繁殖性の高さは、地域の生態系にとって侵略的な脅威となっています。"},{"sentence":"The propagability of the new marketing campaign was assessed based on its potential reach.","translation":"新しいマーケティングキャンペーンの普及性は、その潜在的なリーチに基づいて評価されました。"}],"collocations":["high propagability","low propagability","assess propagability","increase propagability","limit propagability"],"synonyms":["transmissibility","reproducibility","spreadability","fertility","viability"],"antonyms":["sterility","infertility","containment","suppression"]}],"etymology":{"value":"Derived from 'propagable' (capable of being propagated) + '-ity' (suffix indicating a state or quality). 'Propagable' comes from 'propagate', which originates from the Latin 'propagare' (to spread, reproduce, extend).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɒpəɡəˈbɪlɪti/","syllables":"prop-a-ga-bil-i-ty"},"inflection":{"noun_plural":"Propagabilities"},"usage_notes":{"explanation":"'Propagability' refers to the degree to which something can be spread, reproduced, or disseminated. It is often used in scientific contexts, such as discussing the spread of diseases or the reproduction of plants. It can also be used in a more abstract sense, such as discussing the spread of ideas or marketing campaigns. The term emphasizes the inherent capacity or potential for something to be propagated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The propagability of the idea was very good.","correct":"✓ The propagability of the idea was high.","note":"Use adjectives like 'high' or 'low' to describe the degree of propagability, rather than adverbs like 'very' or 'good'."},{"incorrect":"✗ Propagability is important for marketing.","correct":"✓ Propagability is an important factor in marketing.","note":"Clarify the sentence to show that propagability is one of the important factors, not the only one."}],"priority":"★★☆"},"related_words":{"derivatives":["propagate (verb)","propagable (adjective)","propagation (noun)","propagator (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Propagability' is a relatively advanced term used to describe the capacity of something to be spread or reproduced. It's often found in scientific or technical contexts, such as biology (describing the spread of organisms) or marketing (describing the spread of ideas or products). Understanding this word involves recognizing its connection to the verb 'propagate' and the suffix '-ability', which denotes a quality or capability. Due to its specialized usage, it is less common in everyday conversation but important in specific fields."},"example_sentences":[{"sentence":"The high propagability of misinformation poses a significant challenge to maintaining informed public discourse.","translation":"誤情報の高い伝播性は、情報に基づいた公共の議論を維持する上で重大な課題となっています。","type":"noun","meaning_category":"普及性"},{"sentence":"Scientists are studying the factors that influence the propagability of this invasive species.","translation":"科学者たちは、この侵略的外来種の繁殖性に影響を与える要因を研究しています。","type":"noun","meaning_category":"繁殖性"},{"sentence":"The propagability of the disease was reduced through widespread vaccination efforts.","translation":"広範なワクチン接種の取り組みにより、その病気の伝播性が低下しました。","type":"noun","meaning_category":"伝播性"}]}