{"word":"drug-tolerant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"薬物耐性のある、薬剤耐性の","english_definition":"Able to withstand the effects of a drug, especially after continued use.","examples":[{"sentence":"The bacteria have become drug-tolerant, making the infection harder to treat.","translation":"そのバクテリアは薬剤耐性を持つようになり、感染症の治療がより困難になっている。"},{"sentence":"Some cancer cells are naturally drug-tolerant.","translation":"一部の癌細胞は、生まれつき薬剤耐性がある。"}],"collocations":["drug-tolerant bacteria (薬剤耐性菌)","drug-tolerant cancer cells (薬剤耐性癌細胞)","drug-tolerant strain (薬剤耐性株)"],"synonyms":["drug-resistant","pharmaco-tolerant"],"antonyms":["drug-sensitive"],"notes":"Drug-tolerant is often used to describe a state where the organism is not killed by the drug, but its growth is slowed or stopped. This is distinct from drug-resistance, where the organism continues to grow even in the presence of the drug."}],"etymology":{"value":"Formed from 'drug' + 'tolerant'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈdrʌɡ ˌtɒlərənt/","syllables":"drug-tol-er-ant"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Drug-tolerant' describes an organism or cell that can survive exposure to a drug at a certain concentration, even if it doesn't thrive. It's often used in the context of cancer or infectious diseases. It is important to distinguish from 'drug-resistant', where the organism can actively grow and multiply despite the presence of the drug.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The patient is drug-resistant, so we should use the same drug at a higher dose.","correct":"The patient is drug-tolerant, so we should consider alternative drugs or combination therapies.","note":"Drug-tolerant means the drug is not effective at killing the organism, so increasing the dose of the same drug may not be helpful."}],"priority":"☆☆☆"},"related_words":{"derivatives":["tolerance (名詞: 耐性)","drug tolerance (名詞: 薬物耐性)"],"related_terms":["drug-resistance (名詞: 薬物抵抗性)","drug-sensitive (形容詞: 薬物感受性の)"],"priority":"☆☆☆"},"level_frequency":{"priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Drug-tolerant' is a term used in medicine and biology to describe cells or organisms that can survive exposure to a drug without being killed, although their growth may be slowed. This is different from 'drug-resistant', where the cells can continue to grow and multiply even with the drug present. It is often used in discussions about cancer treatment and infectious diseases."},"example_sentences":[{"sentence":"The researchers are studying mechanisms of drug-tolerance in melanoma cells.","translation":"研究者たちは、メラノーマ細胞における薬剤耐性のメカニズムを研究している。","type":"adjective","meaning_category":"薬物耐性のある"},{"sentence":"Drug-tolerant persister cells can lead to relapse after antibiotic treatment.","translation":"薬剤耐性パーシスター細胞は、抗生物質治療後の再発につながる可能性がある。","type":"adjective","meaning_category":"薬物耐性のある"}]}