{"word":"airworthiest","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"最も耐空性のある","english_definition":"(superlative of airworthy) in the best possible condition for safe flight.","examples":[{"sentence":"This aircraft is the airworthiest in the fleet.","translation":"この航空機は、艦隊の中で最も耐空性があります。"}],"collocations":["airworthy aircraft","airworthy condition","maintain airworthy"],"synonyms":["safest to fly","flight-ready","certifiably safe"],"antonyms":["unsafe to fly","unfit for flight"]}],"etymology":{"value":"Formed from 'airworthy' (fit to fly) and the superlative suffix '-est'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈeəˌwɜːrðiɪst/","syllables":"air-wor-thi-est"},"inflection":{"adjective_forms":{"comparative":"more airworthy","superlative":"airworthiest"}},"usage_notes":{"explanation":"'Airworthiest' is the superlative form of 'airworthy', meaning it describes the aircraft or component in the best possible condition for safe flight. It implies a comparison among multiple aircraft or components, indicating that the one described is superior in terms of its ability to fly safely.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The airworthiest of the plane was checked.","correct":"✓ The airworthiness of the plane was checked.","note":"'Airworthiness' (noun) refers to the condition of being safe to fly, while 'airworthiest' (adjective) describes a specific item's condition relative to others."}],"priority":"N/A"},"related_words":{"derivatives":["airworthy","airworthiness"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Airworthiest' is a specialized term used in aviation to describe the aircraft or component that is in the absolute best condition for safe flight. It's the superlative form of 'airworthy', indicating a comparison and highlighting the superior condition of the item being described. This term is primarily encountered in technical documentation, aviation regulations, and maintenance reports related to aircraft. Understanding this term requires familiarity with aviation terminology and concepts related to aircraft safety and maintenance."},"example_sentences":[{"sentence":"After extensive maintenance, this vintage aircraft is now the airworthiest example in the museum's collection.","translation":"広範囲なメンテナンスの後、このヴィンテージ航空機は現在、博物館のコレクションの中で最も耐空性のある例です。","type":"adjective","meaning_category":"safest to fly"},{"sentence":"The mechanics worked tirelessly to ensure that each plane was as airworthiest as possible before the airshow.","translation":"整備士たちは、航空ショーの前に各飛行機が可能な限り最も耐空性のある状態になるように、たゆまぬ努力をしました。","type":"adjective","meaning_category":"safest to fly"}]}