{"word":"aquatinting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アクアチント（版画技法）","english_definition":"An intaglio printmaking technique, a variant of etching, for producing tonal effects by using acid to etch areas of tone directly into a metal plate. It also refers to a print made using this technique.","examples":[{"sentence":"Aquatinting allows artists to create subtle gradations of tone in their prints.","translation":"アクアチントは、アーティストが版画に微妙な色調のグラデーションを作り出すことを可能にする。"},{"sentence":"Goya's 'Los Caprichos' series is a famous example of aquatinting.","translation":"ゴヤの『ロス・カプリチョス』シリーズは、アクアチントの有名な例である。"}],"collocations":["aquatint etching","sugar-lift aquatint","resin aquatint"],"synonyms":["etching","intaglio","printmaking"],"antonyms":[]}],"etymology":{"value":"The term 'aquatint' comes from the resemblance of the prints to watercolours. The process was developed in France in the mid-18th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈækwətɪntɪŋ/","syllables":"a-qua-tint-ing"},"inflection":{"noun_plural":"aquatintings"},"usage_notes":{"explanation":"Aquatinting is a printmaking process that creates tonal effects rather than lines. It involves applying a porous ground (such as resin or sugar lift) to a metal plate, then etching the plate with acid. The acid bites around the particles of the ground, creating a textured surface that holds ink. The depth of the tone is controlled by varying the amount of time the plate is exposed to the acid.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an aquatinting painting.","correct":"✓ He made an aquatint.","note":"'Aquatinting' is the process, 'aquatint' is the print or the artwork itself."},{"incorrect":"✗ Aquatinting is a type of woodcut.","correct":"✓ Aquatinting is a type of etching.","note":"Aquatinting is a form of intaglio printmaking, specifically a variant of etching, not woodcut."}],"priority":"★★☆"},"related_words":{"derivatives":["aquatint (noun: アクアチント版画)","aquatinter (noun: アクアチント版画家)"],"phrasal_verbs":[],"related_techniques":["etching","engraving","mezzotint","drypoint"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Aquatinting is a specialized printmaking technique used to create tonal effects in intaglio prints. It involves etching a metal plate with acid through a porous ground, such as resin or sugar lift, to create a textured surface that holds ink. The depth of tone is controlled by varying the etching time. It is a complex process often used by experienced printmakers.","priority":"★★☆"},"example_sentences":[{"sentence":"She is learning the technique of aquatinting in her printmaking class.","translation":"彼女は版画の授業でアクアチントの技法を学んでいる。","type":"noun","meaning_category":"版画技法"},{"sentence":"The artist used aquatinting to create a soft, atmospheric effect in the landscape print.","translation":"そのアーティストはアクアチントを使って、風景版画に柔らかく、雰囲気のある効果を作り出した。","type":"noun","meaning_category":"版画技法"},{"sentence":"Aquatinting is often combined with other intaglio techniques, such as etching, to achieve a wider range of effects.","translation":"アクアチントは、より幅広い効果を得るために、エッチングなどの他の凹版技法と組み合わせて使用​​されることがよくある。","type":"noun","meaning_category":"版画技法"}]}