{"word":"pradhana","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(サーンキヤ学派における)根本原質、未分化の物質的根源","english_definition":"(In Samkhya philosophy) the primordial, undifferentiated substance or material principle from which the world evolves. It is the unmanifested root of all material existence.","examples":[{"sentence":"According to Samkhya, the universe arises from the interaction of pradhana and purusha.","translation":"サーンキヤ学派によれば、宇宙はプラダーナとプルシャの相互作用から生じる。"},{"sentence":"Pradhana is characterized by the three gunas: sattva, rajas, and tamas.","translation":"プラダーナは、サットヴァ、ラジャス、タマスの3つのグナによって特徴づけられる。"}],"collocations":["pradhana and purusha (プラダーナとプルシャ)","three gunas of pradhana (プラダーナの3つのグナ)"],"synonyms":["prakriti (プラクリティ)","avyakta (アヴャクタ)"],"antonyms":["purusha (プルシャ)"]}],"etymology":{"value":"Sanskrit: प्रधान (pradhāna) meaning 'chief, principal, primary, important; substance, matter, nature'.","priority":"★★★"},"pronunciation":{"ipa":"/pɾɐˈdʱɑːnɐ/","syllables":"pra-dhaa-na"},"inflection":{"notes":"Noun, no plural form typically used in English.","noun_plural":null},"usage_notes":{"explanation":"'Pradhana' is a technical term from Samkhya, one of the oldest schools of Indian philosophy. It refers to the fundamental material cause of the universe, distinct from 'purusha' (the conscious self or spirit). It's not a commonly used word outside the context of Indian philosophy or yoga studies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pradhana is a personal god in Hinduism.","correct":"✓ Pradhana is the unmanifested material principle in Samkhya philosophy.","note":"Pradhana is a concept, not a deity. It's a key element in Samkhya's cosmology."}],"priority":"★★☆"},"related_words":{"derivatives":["prakriti (プラクリティ)","purusha (プルシャ)","sattva (サットヴァ)","rajas (ラジャス)","tamas (タマス)","Samkhya (サーンキヤ)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - specialized philosophical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pradhana' is a highly specialized term from Indian philosophy, specifically the Samkhya school. Understanding it requires familiarity with Samkhya's dualistic metaphysics, particularly the distinction between material principle (pradhana) and consciousness (purusha). It's not encountered in general English usage.","priority":"★★☆"},"example_sentences":[{"sentence":"In Samkhya philosophy, pradhana is the source of all objective existence.","translation":"サーンキヤ哲学では、プラダーナはすべての客観的実在の源である。","type":"definition","meaning_category":"fundamental concept"},{"sentence":"The evolution of the universe is explained as the unfolding of the gunas within pradhana.","translation":"宇宙の進化は、プラダーナ内のグナの展開として説明される。","type":"explanation","meaning_category":"application"}]}