{"word":"unguards","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare, archaic) A state of being unguarded; lack of protection or caution.","english_definition":"(rare, archaic) The state of being unguarded; a lack of protection or caution.","examples":[{"sentence":"In moments of unguards, secrets are often revealed.","translation":"警戒を解いた瞬間、秘密はしばしば明らかになる。"},{"sentence":"The enemy took advantage of their unguards.","translation":"敵は彼らの警戒心の緩みを利用した。"}],"collocations":["moments of unguards","take advantage of unguards"],"synonyms":["vulnerability","defenselessness","unpreparedness","carelessness"],"antonyms":["vigilance","caution","preparedness","protection"]}],"etymology":{"value":"Formed from \"unguarded\" by analogy with \"regard\" and \"disregard\".","priority":"N/A"},"pronunciation":{"ipa":"ʌnˈɡɑːrdz","syllables":"un-guards"},"inflection":{"noun_plural":"N/A (uncommon, usually used in singular)"},"usage_notes":{"explanation":"\"Unguards\" is a rare and somewhat archaic noun. It refers to a state of being without guards, protection, or caution. It's not commonly used in modern English. The singular form, \"unguard,\" is even rarer.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unguards were standing at the gate.","correct":"✓ The guards were not present at the gate.","note":"\"Unguards\" is not a synonym for \"guards.\" It refers to a state of lacking protection, not the people providing protection."}],"priority":"★★☆"},"related_words":{"derivatives":["unguarded (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"\"Unguards\" is a rare and archaic term, indicating a sophisticated understanding of vocabulary. Its usage is limited to specific contexts, primarily in literature or historical discussions where a lack of caution or protection is emphasized. Due to its infrequent appearance, it is not typically encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"In their unguards, the soldiers were easily ambushed.","translation":"彼らは警戒を怠っていたため、容易に待ち伏せされた。","type":"noun","meaning_category":"lack of protection"},{"sentence":"The diplomat's unguards during the negotiation led to unfavorable concessions.","translation":"外交官が交渉中に警戒を怠ったため、不利な譲歩をすることになった。","type":"noun","meaning_category":"lack of caution"}]}