{"word":"procuresses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 女衒、売春斡旋業者（女性）","english_definition":"plural of procuress: a woman who procures prostitutes for others.","examples":[{"sentence":"The police arrested several procuresses operating in the city.","translation":"警察は市内で活動する複数の女衒を逮捕した。"}],"collocations":["operate as a procuress (女衒として活動する)"],"synonyms":["madams","pimps (gender neutral)","brothel keepers"],"antonyms":[],"notes":"The term carries strong negative connotations due to its association with exploitation and illegal activities."}],"etymology":{"value":"Derived from 'procuress,' which comes from the verb 'procure.' 'Procure' originates from the Latin 'procurare,' meaning 'to take care of, manage,' but evolved to mean 'obtain, acquire,' and in this context, 'to obtain women for prostitution.'","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈkjʊərɪsɪz/","syllables":"pro-cu-ress-es"},"inflection":{"noun_plural":"procuresses"},"usage_notes":{"explanation":"'Procuresses' is the plural form of 'procuress,' referring specifically to multiple women who engage in the act of procuring prostitutes for others. It is a formal term but carries a highly negative connotation due to its association with the exploitation of individuals. The term is typically used in legal or formal contexts when discussing such activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a procuresses.","correct":"✓ She is a procuress.","note":"'Procuresses' is the plural form. Use 'procuress' for a single individual."}],"priority":"★★★"},"related_words":{"derivatives":["procure (verb: to obtain something, especially with care or effort)","procurement (noun: the action of obtaining something)","procurer (noun: a person who procures, often in the context of prostitution - gender neutral)"],"synonyms":["pimp (gender-neutral term, though often associated with males)","madam (often refers to the female manager of a brothel)"],"antonyms":[]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'procuresses' is a formal and specific term referring to multiple women who procure prostitutes for others. This word is not commonly used in everyday language and is typically found in legal, academic, or historical contexts. The term carries strong negative connotations due to its association with exploitation and illegal activities. Understanding the term requires a strong vocabulary and awareness of its sensitive and often illegal context."},"example_sentences":[{"sentence":"The investigation revealed a network of procuresses involved in human trafficking.","translation":"捜査により、人身売買に関与する女衒のネットワークが明らかになった。","type":"noun","meaning_category":"売春斡旋業者（女性）"},{"sentence":"Several procuresses were arrested for running an illegal prostitution ring.","translation":"数人の女衒が、違法な売春組織を運営したとして逮捕された。","type":"noun","meaning_category":"売春斡旋業者（女性）"}]}