{"word":"non-European","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"非ヨーロッパの、ヨーロッパ的でない","english_definition":"Not of or relating to Europe or its people or cultures.","examples":[{"sentence":"The museum features art from non-European cultures.","translation":"その博物館は非ヨーロッパ文化の芸術を展示している。"},{"sentence":"Many non-European countries have experienced rapid economic growth.","translation":"多くの非ヨーロッパ諸国が急速な経済成長を経験している。"},{"sentence":"She is studying non-European languages at university.","translation":"彼女は大学で非ヨーロッパ言語を学んでいる。"}],"collocations":["non-European art (非ヨーロッパの芸術)","non-European countries (非ヨーロッパの国々)","non-European cultures (非ヨーロッパの文化)","non-European languages (非ヨーロッパの言語)","non-European traditions (非ヨーロッパの伝統)"],"synonyms":["non-Western","foreign","exotic"],"antonyms":["European"],"notes":"Often used in the context of art, culture, geography, and politics. Can sometimes carry unintended implications depending on the context, so consider alternatives if neutrality is important."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'European'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn jʊəˈriːpiən/","syllables":"non-Eu-ro-pe-an"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Non-European' is used to describe something that is not from or related to Europe. It's a broad term that encompasses a wide range of cultures, regions, and people. When using this term, it's important to be aware of the potential for overgeneralization or implying a sense of otherness. Consider whether a more specific term would be more appropriate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A non European person","correct":"✓ A non-European person","note":"Hyphen is needed between non and European."},{"incorrect":"✗ non-european countries","correct":"✓ non-European countries","note":"'European' should be capitalized as it refers to a proper noun (Europe)."}],"priority":"★★☆"},"related_words":{"derivatives":["non-","European","Europe"],"related_terms":["Western","Eastern","Asian","African","American","Oceanian","global","international"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in academic and journalistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Non-European' is a term used to describe anything that is not from or related to Europe. It's formed by adding 'non-' to 'European.' It's important to use this term carefully, as it can be very broad and might not always be the most accurate or respectful way to describe something. Consider if a more specific term would be better. For example, instead of saying 'non-European art,' you might say 'African art' or 'Asian art' if you know the specific region the art is from."},"example_sentences":[{"sentence":"The conference will focus on trade relations with non-European nations.","translation":"会議では、非ヨーロッパ諸国との貿易関係に焦点を当てる。","type":"general"},{"sentence":"She specializes in the study of non-European history.","translation":"彼女は非ヨーロッパ史の研究を専門としている。","type":"academic"},{"sentence":"The restaurant offers a variety of non-European dishes.","translation":"そのレストランでは、さまざまな非ヨーロッパ料理を提供している。","type":"cultural"}]}