{"word":"Hyphomycetales","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不完全菌類の一群。","english_definition":"An obsolete order of fungi in the class Deuteromycetes (Fungi Imperfecti), characterized by having no known sexual stage and producing asexual spores (conidia) on simple or branched conidiophores.","examples":[{"sentence":"Hyphomycetales used to be a major grouping in fungal taxonomy.","translation":"かつて、不完全菌類は菌類分類において主要なグループ分けでした。"}],"collocations":[],"synonyms":["Deuteromycetes","Fungi Imperfecti"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hyphe' (thread or hypha), 'myces' (fungus), and the suffix '-ales' (denoting an order in biological classification).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪfoʊmaɪsɪˈteɪliːz/","syllables":"Hy-pho-my-ce-ta-les"},"inflection":{"noun_plural":"Hyphomycetales"},"usage_notes":{"explanation":"Hyphomycetales is an obsolete taxonomic grouping, as modern molecular techniques have allowed many of these fungi to be reclassified into other fungal groups based on genetic relationships. The term is now primarily of historical interest.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Hyphomycete (noun: a fungus belonging to the Hyphomycetales)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in scientific or historical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hyphomycetales' is a highly specialized term used in mycology (the study of fungi). It refers to a historical classification of fungi that reproduce asexually. Due to advances in molecular biology, this classification is now obsolete and primarily encountered in older scientific literature. Understanding this term requires a strong background in biology and taxonomy."},"example_sentences":[{"sentence":"Many fungi previously classified as Hyphomycetales have now been assigned to the Ascomycota or Basidiomycota based on molecular data.","translation":"かつて不完全菌類に分類されていた多くの菌類は、分子データに基づいて現在では子嚢菌門または担子菌門に分類されています。","type":"scientific","meaning_category":"classification"},{"sentence":"Older texts on fungal identification often include descriptions of Hyphomycetales.","translation":"菌類同定に関する古い文献には、不完全菌類の説明が含まれていることがよくあります。","type":"historical","meaning_category":"historical context"}]}