{"word":"Tewart","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic) A variant spelling of Stewart, a Scottish surname and given name.","english_definition":"An archaic spelling of the surname Stewart, particularly referring to the Scottish royal house.","examples":[{"sentence":"The Tewart kings ruled Scotland for centuries.","translation":"テュアート家の王たちは何世紀にもわたってスコットランドを統治した。"},{"sentence":"He claimed descent from the Tewart line.","translation":"彼はテュアート家の血を引いていると主張した。"}],"collocations":["House of Tewart","Tewart kings"],"synonyms":["Stewart"],"antonyms":[]}],"etymology":{"value":"A historical spelling variation of the Scottish surname Stewart, derived from the office of 'steward'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtjuːərt/","syllables":"Tew-art"},"inflection":{"notes":"Proper noun, plural is Tewarts."},"usage_notes":{"explanation":"'Tewart' is an older, less common spelling of 'Stewart'. It is primarily of historical interest, particularly in reference to the Scottish royal family. The more common modern spelling is 'Stewart'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tewart of the company.","correct":"✓ He is a steward of the company.","note":"'Tewart' is a surname. For the occupation, use 'steward'."}],"priority":"★★☆"},"related_words":{"derivatives":["Stewart","Stuart"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tewart' is an archaic spelling of the surname 'Stewart', primarily associated with the Scottish royal family. It is rarely encountered in modern usage. Understanding this term is relevant for historical contexts related to Scotland.","priority":"★★☆"},"example_sentences":[{"sentence":"The old documents referred to the family as 'Tewart'.","translation":"古い文書では、その家族は「テュアート」と呼ばれていた。","type":"noun","meaning_category":"Surname"},{"sentence":"The Tewart dynasty played a significant role in Scottish history.","translation":"テュアート王朝はスコットランドの歴史において重要な役割を果たした。","type":"noun","meaning_category":"Historical reference"}]}