{"word":"quarreler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"口論好きな人、けんか腰の人、言い争う人","english_definition":"a person who frequently engages in quarrels or disputes; someone who is argumentative and prone to disagreeing.","examples":[{"sentence":"He's a natural quarreler; he always has to have the last word.","translation":"彼は生まれつきの口論好きで、いつも最後に言い返さないと気が済まない。"},{"sentence":"The meeting was unproductive because of the constant interruptions from a few quarrelers.","translation":"数人の口論好きな人たちが絶え間なく邪魔をするので、会議は非生産的だった。"},{"sentence":"She tried to avoid him because he was such a tiresome quarreler.","translation":"彼女は彼がとてもうんざりするような口論好きだったので、彼を避けるようにした。"}],"collocations":["habitual quarreler (常習的な口論好き)","petty quarreler (些細なことで口論する人)","argumentative quarreler (議論好きな口論好き)","avoid a quarreler (口論好きな人を避ける)","ignore a quarreler (口論好きな人を無視する)"],"synonyms":["arguer","disputant","contender","bickerer","wrangler","belligerent","contentious person","argumentative person"],"antonyms":["peacemaker","conciliator","harmonizer","mediator","pacifist"]}],"etymology":{"value":"The word 'quarreler' is formed by adding the suffix '-er' (denoting a person who does something) to the verb 'quarrel.' The verb 'quarrel' comes from the Old French 'quarel,' meaning 'cause for complaint, dispute,' which ultimately derives from Latin 'querela,' meaning 'complaint, grievance.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɒrələr/","syllables":"quar-rel-er"},"inflection":{"noun_plural":"quarrelers"},"usage_notes":{"explanation":"'Quarreler' refers to a person who has a tendency to argue or dispute frequently. It implies a disposition to disagree and engage in verbal conflicts. The term often carries a negative connotation, suggesting that the person is difficult to get along with or prone to creating conflict.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a big quarreler, always fighting with everyone.","correct":"He is a big arguer, always fighting with everyone.","note":"While 'quarreler' is correct, 'arguer' is a more commonly used and natural-sounding alternative in general conversation."},{"incorrect":"She is a quarreler, that's why nobody likes her.","correct":"She is argumentative, that's why nobody likes her.","note":"'Argumentative' is a more common and versatile adjective to describe someone who likes to argue."}],"priority":"★★☆"},"related_words":{"derivatives":["quarrel (noun: an angry argument or disagreement)","quarrelsome (adjective: tending to argue)","quarreling (present participle of quarrel, used as an adjective or noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'quarreler' is a relatively uncommon noun that describes someone who frequently engages in arguments or disputes. It is more formal than simply calling someone an 'arguer' and implies a habitual tendency to disagree and create conflict. This word is likely to appear in more sophisticated texts or discussions about interpersonal relationships and conflict resolution."},"example_sentences":[{"sentence":"The two politicians were known as constant quarrelers, always disagreeing on policy matters.","translation":"その二人の政治家は、政策問題でいつも意見が合わず、常に口論する人として知られていた。","type":"noun","meaning_category":"口論好きな人"},{"sentence":"The manager had to intervene to stop the quarrelers from disrupting the team meeting.","translation":"マネージャーは、口論好きな人たちがチーム会議を妨害するのを止めるために介入しなければならなかった。","type":"noun","meaning_category":"口論好きな人"},{"sentence":"It's best to avoid being around habitual quarrelers if you want to maintain a peaceful environment.","translation":"平和な環境を維持したいなら、常習的な口論好きな人の周りにいないのが一番だ。","type":"noun","meaning_category":"口論好きな人"}]}