{"word":"Taurini","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(古代) タウリニ族：古代ローマ時代に現在のイタリアのトリノ周辺に居住していたケルト・リグリア系の部族。","english_definition":"(historical) The Taurini were an ancient Celtic-Ligurian people who inhabited the area around modern-day Turin (Italy) during the Roman era.","examples":[{"sentence":"The Taurini were conquered by Hannibal during the Second Punic War.","translation":"タウリニ族は第二次ポエニ戦争中にハンニバルに征服された。"},{"sentence":"The city of Turin is believed to have originated as a settlement of the Taurini.","translation":"トリノ市は、タウリニ族の集落として始まったと考えられている。"}],"collocations":["Taurini tribe","Taurini settlement","Roman conquest of the Taurini"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'Taurini' is believed to be derived from the Celtic word 'taur' meaning 'bull'. This may have been a tribal totem or a reference to the region's agricultural activities.","priority":"★★☆"},"pronunciation":{"ipa":"/tɔˈraɪnaɪ/","syllables":"Tau-ri-ni"},"inflection":{"noun_plural":"N/A (Proper noun)"},"usage_notes":{"explanation":"'Taurini' refers specifically to this ancient tribe. It is primarily used in historical contexts when discussing the Roman period in what is now northern Italy. The term is not commonly used in modern English outside of historical or archaeological discussions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Augusta Taurinorum (Roman name for Turin)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Taurini' is a historical term referring to an ancient tribe. It is unlikely to be encountered outside of academic or specialized historical contexts. Understanding requires familiarity with Roman history and the geography of ancient Italy."},"example_sentences":[{"sentence":"Archaeological evidence suggests that the Taurini engaged in trade with neighboring tribes.","translation":"考古学的証拠は、タウリニ族が近隣の部族と交易を行っていたことを示唆している。","type":"noun","meaning_category":"historical tribe"},{"sentence":"The Romans established a colony in the territory of the Taurini, which later became the city of Turin.","translation":"ローマ人はタウリニ族の領土に植民地を建設し、それが後にトリノ市となった。","type":"noun","meaning_category":"historical tribe"}]}