{"word":"borborygmic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)腸のゴロゴロ鳴る音の、腹鳴の","english_definition":"relating to or characterized by rumbling or gurgling sounds in the intestines.","examples":[{"sentence":"The doctor listened to the patient's borborygmic sounds to assess their digestive health.","translation":"医師は患者の消化器系の健康状態を評価するために、患者の腹鳴音を聞いた。"},{"sentence":"His borborygmic stomach embarrassed him during the silent meeting.","translation":"静かな会議中、彼のお腹のゴロゴロ鳴る音が恥ずかしかった。"}],"collocations":["borborygmic sounds","borborygmic noises","borborygmic stomach"],"synonyms":["rumbling","gurgling","intestinal"],"antonyms":["silent","quiet"],"notes":"Often used in a medical context."}],"etymology":{"value":"Derived from the Greek word 'borborygmos' (βορβορυγμός), meaning 'rumbling of the bowels'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɔːrbəˈrɪɡmɪk/","syllables":"bor-bo-ryg-mic"},"inflection":{"notes":"Adjectives do not have plural forms in English."},"usage_notes":{"explanation":"'Borborygmic' is a relatively uncommon word, primarily used in medical or scientific contexts to describe the sounds produced by gas moving through the intestines. It is more formal than simply saying 'stomach rumbling'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The borborygmic dog barked loudly.","correct":"✓ The borborygmic sounds came from his stomach.","note":"'Borborygmic' specifically refers to intestinal sounds, not sounds made by other parts of the body or by animals."}],"priority":"★★☆"},"related_words":{"derivatives":["borborygmus (noun): the rumbling or gurgling noise produced by the movement of fluid and gas in the intestines."],"phrases":["have borborygmi"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Borborygmic' is a technical term primarily used in medical or scientific contexts to describe the rumbling sounds of the intestines. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding requires familiarity with medical terminology."},"example_sentences":[{"sentence":"The patient complained of frequent borborygmic noises after eating.","translation":"患者は食後、頻繁に腹鳴がすると訴えた。","type":"general","meaning_category":"medical"},{"sentence":"The doctor noted the presence of borborygmic sounds during the abdominal examination.","translation":"医師は腹部の診察中に腹鳴音が認められると記録した。","type":"medical","meaning_category":"medical"}]}