{"word":"idiorepulsive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人、特に作家について) 自身のアイデアやスタイルを嫌う、または過度に批判的な","english_definition":"(of a person, especially a writer) disliking or being excessively critical of one's own ideas or style.","examples":[{"sentence":"The idiorepulsive author constantly rewrote his manuscripts, never satisfied with his own work.","translation":"その自身のアイデアを嫌う作家は、自分の作品に決して満足せず、常に原稿を書き直していた。"},{"sentence":"Her idiorepulsive tendencies made it difficult for her to complete any project.","translation":"彼女の自己嫌悪的な傾向のせいで、どんなプロジェクトも完成させるのが難しかった。"}],"collocations":["idiorepulsive author","idiorepulsive tendencies","idiorepulsive nature"],"synonyms":["self-critical","self-deprecating","hypercritical","fastidious","perfectionist"],"antonyms":["self-confident","self-assured","complacent","content"],"notes":"This word is relatively rare and often used in literary or psychological contexts."}],"etymology":{"value":"Derived from 'idio-' (referring to oneself or one's own) and 'repulsive' (causing intense distaste or disgust).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪdiːoʊrɪˈpʌlsɪv/","syllables":"i-di-o-re-pul-sive"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Idiorepulsive' describes someone who has a strong aversion to their own creative output or personal style. It suggests a deep-seated dissatisfaction with one's own work, often leading to constant revision or creative block.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was idiorepulsive of other people's work.","correct":"✓ He was idiorepulsive about his own work.","note":"'Idiorepulsive' specifically refers to one's own ideas or style, not those of others."}],"priority":"★★☆"},"related_words":{"derivatives":["idiorepulsion (noun)"],"related_concepts":["self-criticism","perfectionism","creative block","imposter syndrome"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Idiorepulsive' is a rare and complex word used to describe a person who is highly critical and often disgusted by their own work or style. It is most often used in the context of writers or artists who struggle with self-doubt and perfectionism. Understanding the word requires a good vocabulary and an understanding of psychological concepts related to self-perception and creative process."},"example_sentences":[{"sentence":"The novelist's idiorepulsive nature led him to discard countless drafts.","translation":"その小説家の自己嫌悪的な性質が、彼に数え切れないほどの草稿を破棄させた。","type":"general"},{"sentence":"She recognized her idiorepulsive tendencies and sought therapy to overcome them.","translation":"彼女は自身の自己嫌悪的な傾向を認識し、それを克服するためにセラピーを受けた。","type":"general"}]}