{"word":"Horsyism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"馬好き、馬術熱、馬事趣味、馬術界特有の態度や行動","english_definition":"Devotion to horses, horsemanship, or the social life of horse racing and riding; attitudes and behaviors associated with those interests.","examples":[{"sentence":"His horsyism was evident in his constant talk about breeding and racing.","translation":"彼の馬好きは、繁殖や競馬について絶え間なく語ることから明らかだった。"},{"sentence":"She found the horsyism of the country club a bit overwhelming at first.","translation":"彼女は、カントリークラブの馬事趣味が最初は少し圧倒的だと感じた。"}],"collocations":["display horsyism","embrace horsyism","the horsyism of the elite"],"synonyms":["equestrianism","horsemanship","horse culture"],"antonyms":[],"notes":"Often used to describe a particular lifestyle or set of values associated with horse enthusiasts."}],"etymology":{"value":"Formed from 'horsy' (resembling or connected with horses) + '-ism' (denoting a belief, practice, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrsiɪzəm/","syllables":"hor-sy-ism"},"inflection":{"noun_plural":"Horsyisms"},"usage_notes":{"explanation":"'Horsyism' refers to a strong interest in horses and all things related to them. It can describe a hobby, a lifestyle, or even a set of social behaviors and attitudes common among those involved in horse riding, racing, or breeding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices horsyism every day by riding his bike.","correct":"✓ He practices horsemanship every day by riding his horse.","note":"'Horsyism' refers to activities related to horses, not bicycles."}],"priority":"★☆☆"},"related_words":{"derivatives":["horsy (adjective)","horseman (noun)","horsewoman (noun)","horsemanship (noun)"],"related_terms":["equestrian","equine","thoroughbred"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Horsyism' is a niche term that describes a strong interest in horses and the culture surrounding them. It's not commonly used in everyday conversation but might appear in contexts related to equestrian sports, horse breeding, or social circles centered around horses."},"example_sentences":[{"sentence":"The novel explores the themes of class and horsyism in British society.","translation":"その小説は、イギリス社会における階級と馬事趣味のテーマを探求している。","type":"noun","meaning_category":"馬好き・馬術熱"},{"sentence":"His dedication to polo and horse breeding exemplified his horsyism.","translation":"彼のポロと馬の繁殖への献身は、彼の馬好きを体現していた。","type":"noun","meaning_category":"馬好き・馬術熱"}]}