{"word":"autolaryngoscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己喉頭鏡（じここうとうきょう）: 自分で自分の喉頭を観察するために使用する医療機器。","english_definition":"A medical instrument used for self-examination of the larynx.","examples":[{"sentence":"The doctor demonstrated the use of an autolaryngoscope for patient self-monitoring.","translation":"医師は患者の自己モニタリングのために自己喉頭鏡の使用法を実演しました。"},{"sentence":"The autolaryngoscope allows for convenient at-home examination of the vocal cords.","translation":"自己喉頭鏡を使用すると、自宅で手軽に声帯の検査ができます。"}],"collocations":["use an autolaryngoscope (自己喉頭鏡を使用する)","examine with an autolaryngoscope (自己喉頭鏡で検査する)","self-examination with autolaryngoscope (自己喉頭鏡による自己検査)"],"synonyms":["laryngoscope (喉頭鏡)","endoscope (内視鏡)"],"antonyms":[]}],"etymology":{"value":"\"auto-\" (自己) + \"laryngo-\" (喉頭) + \"-scope\" (観察器具)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtoʊləˈrɪŋɡəskoʊp/","syllables":"au-to-la-ryn-go-scope"},"inflection":{"noun_plural":"autolaryngoscopes"},"usage_notes":{"explanation":"An autolaryngoscope is a specialized type of laryngoscope designed for self-examination. It enables individuals to visualize their own larynx, typically for monitoring vocal cord health or detecting abnormalities. This tool is often used under medical supervision or after proper training.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a otolaryngoscope to see my throat.","correct":"✓ I used an autolaryngoscope to see my throat.","note":"The correct term for self-examination of the larynx is 'autolaryngoscope,' not 'otolaryngoscope,' which refers to an instrument used by a specialist (otolaryngologist)."},{"incorrect":"✗ Autolaryngoscope is easy to use without any training.","correct":"✓ Autolaryngoscope should be used with proper training to avoid injury.","note":"Using an autolaryngoscope requires proper training to avoid causing damage to the larynx or surrounding tissues."}],"priority":"★★☆"},"related_words":{"derivatives":["autolaryngoscopy (自己喉頭鏡検査)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'autolaryngoscope' is a specialized medical term. It is used to describe a device that allows a person to examine their own larynx (voice box). This term is typically encountered in medical contexts or discussions related to ENT (Ear, Nose, and Throat) health. Understanding this term requires some familiarity with medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was instructed on how to use the autolaryngoscope to monitor their vocal cords at home.","translation":"患者は、自宅で声帯を監視するために自己喉頭鏡を使用する方法について指示を受けました。","type":"noun","meaning_category":"medical device"},{"sentence":"Regular use of the autolaryngoscope can help in the early detection of laryngeal abnormalities.","translation":"自己喉頭鏡の定期的な使用は、喉頭の異常の早期発見に役立ちます。","type":"noun","meaning_category":"medical device"}]}