{"word":"healthy-mindedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"健全な精神で、健全な考え方で、精神衛生に配慮して","english_definition":"In a manner that demonstrates a healthy mental attitude or concern for mental well-being.","examples":[{"sentence":"She approached the problem healthy-mindedly, focusing on solutions rather than dwelling on the negative.","translation":"彼女は健全な考え方で問題に取り組み、否定的なことにこだわるのではなく、解決策に焦点を当てました。"},{"sentence":"To cope with stress, he began to live healthy-mindedly, incorporating meditation and mindfulness into his daily routine.","translation":"ストレスに対処するために、彼は健全な精神で生活を始め、瞑想やマインドフルネスを日課に取り入れました。"},{"sentence":"The therapist encouraged her to think healthy-mindedly about her past experiences, reframing them in a positive light.","translation":"セラピストは彼女に、過去の経験について健全な考え方をするように促し、それを肯定的な視点から再構築しました。"}],"collocations":["approach a problem healthy-mindedly (健全な考え方で問題に取り組む)","live healthy-mindedly (健全な精神で生活する)","think healthy-mindedly (健全な考え方をする)"],"synonyms":["mentally healthily","with a sound mind","in a balanced way","with mental well-being in mind"],"antonyms":["unhealthily","in a mentally unhealthy way","with a negative mindset"]}],"etymology":{"value":"Derived from 'healthy-minded' (adjective), which combines 'healthy' and 'minded' to describe someone with a sound and balanced mental state. The '-ly' suffix transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛlθi ˈmaɪndɪdli/","syllables":"health-y-mind-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word is formed by adding '-ly' to the adjective 'healthy-minded'."},"usage_notes":{"explanation":"'Healthy-mindedly' is an adverb that describes the manner in which someone approaches a situation or conducts themselves, emphasizing a focus on mental well-being and a positive, balanced mindset. It suggests a deliberate effort to maintain a healthy mental state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He healthy-minded the situation.","correct":"✓ He approached the situation healthy-mindedly.","note":"'Healthy-mindedly' is an adverb and should be used to modify a verb, not as a verb itself. Use it to describe how an action is performed, not to replace the action."},{"incorrect":"✗ She is a healthy-mindedly person.","correct":"✓ She is a healthy-minded person.","note":"'Healthy-mindedly' is an adverb, while 'healthy-minded' is the correct adjective form to describe a person."}],"priority":"★★☆"},"related_words":{"derivatives":["healthy-minded (adjective)","healthy-mindedness (noun)"],"phrases":["mental health","well-being","mindfulness","positive thinking"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Healthy-mindedly' is an adverb that describes doing something with a focus on mental well-being and a positive mindset. It's not a common word, so it's more likely to be found in writing about psychology, self-help, or personal development. It means approaching a situation or task in a way that prioritizes mental health and balance, rather than dwelling on negative thoughts or emotions."},"example_sentences":[{"sentence":"She faced the challenge healthy-mindedly, focusing on what she could control and accepting what she couldn't.","translation":"彼女は健全な考え方で課題に立ち向かい、自分がコントロールできることに焦点を当て、できないことは受け入れました。","type":"adverb","meaning_category":"mental well-being"},{"sentence":"He practiced gratitude healthy-mindedly, appreciating the small joys in his life.","translation":"彼は健全な精神で感謝の気持ちを実践し、人生の小さな喜びを大切にしました。","type":"adverb","meaning_category":"positive mindset"},{"sentence":"They discussed their fears healthy-mindedly, creating a safe space for open and honest communication.","translation":"彼らは健全な考え方で自分たちの恐怖について話し合い、率直で正直なコミュニケーションのための安全な場を作りました。","type":"adverb","meaning_category":"open communication"}]}