{"word":"quasi-bronze","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"擬似青銅、青銅類似物","english_definition":"An alloy or material that resembles bronze in appearance but does not have the same composition.","examples":[{"sentence":"The statue was made of quasi-bronze to reduce costs.","translation":"その像はコストを削減するために擬似青銅で作られました。"},{"sentence":"This metal is a quasi-bronze, containing copper and other elements.","translation":"この金属は擬似青銅で、銅と他の元素を含んでいます。"}],"collocations":["quasi-bronze alloy","quasi-bronze finish","faux bronze"],"synonyms":["faux bronze","imitation bronze","bronze-like material"],"antonyms":[]},{"part_of_speech":"adjective","definition":"擬似青銅の、青銅に似た","english_definition":"Resembling bronze in appearance or properties, but not actually bronze.","examples":[{"sentence":"The quasi-bronze surface gave the sculpture an antique look.","translation":"擬似青銅の表面は彫刻にアンティークな外観を与えました。"},{"sentence":"They used a quasi-bronze coating on the furniture.","translation":"彼らは家具に擬似青銅のコーティングを使用しました。"}],"collocations":["quasi-bronze coating","quasi-bronze finish","quasi-bronze color"],"synonyms":["bronze-like","bronze-colored","faux bronze"],"antonyms":[]}],"etymology":{"value":"'Quasi-' comes from Latin, meaning 'as if' or 'resembling'. Combined with 'bronze', it indicates something that looks like bronze but isn't actually bronze.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ˈbrɒnz/","syllables":"quasi-bronze (4 syllables)"},"inflection":{"notes":"The term can function as both a noun and an adjective, so inflection is limited."},"usage_notes":{"explanation":"'Quasi-bronze' refers to materials that mimic the appearance of bronze, often used for cost reduction or specific properties. It's important to note that it doesn't have the exact composition or characteristics of true bronze.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The statue is made of bronze, it's actually quasi-bronze.","correct":"✓ The statue is not made of bronze; it's actually quasi-bronze.","note":"Clarify that it is NOT bronze, but resembles it."}],"priority":"★☆☆"},"related_words":{"derivatives":["quasi (prefix meaning resembling)","bronze"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quasi-bronze' is a technical term used to describe materials that look like bronze but aren't actually made of bronze. It's often used in manufacturing or art to refer to substitutes that are cheaper or have different properties than real bronze. You'll usually encounter this term in specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist used a quasi-bronze material for the sculpture to make it lighter.","translation":"アーティストは彫刻を軽くするために擬似青銅の素材を使用しました。","type":"noun","meaning_category":"material"},{"sentence":"The quasi-bronze finish gave the door handles a classic look.","translation":"擬似青銅の仕上げはドアハンドルにクラシックな外観を与えました。","type":"adjective","meaning_category":"finish"}]}