{"word":"anti-oncogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"抗腫瘍遺伝子の、腫瘍形成を抑制する","english_definition":"Relating to or having the property of suppressing tumor formation; pertaining to tumor suppressor genes.","examples":[{"sentence":"The anti-oncogenic effect of this compound is being studied.","translation":"この化合物の抗腫瘍遺伝子効果が研究されています。"},{"sentence":"Loss of anti-oncogenic function can lead to cancer development.","translation":"抗腫瘍遺伝子機能の喪失は、がんの発症につながる可能性があります。"}],"collocations":["anti-oncogenic effect","anti-oncogenic activity","anti-oncogenic gene","anti-oncogenic protein"],"synonyms":["tumor-suppressing","cancer-inhibiting"],"antonyms":["oncogenic","tumor-promoting"]}],"etymology":{"value":"Derived from 'anti-' (against), 'onco-' (tumor), and '-genic' (producing). Combination of prefixes and suffixes indicating opposition to tumor formation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌɒŋkəˈdʒɛnɪk/","syllables":"an-ti-on-co-gen-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, although comparative and superlative forms can be created (more anti-oncogenic, most anti-oncogenic)."},"usage_notes":{"explanation":"'Anti-oncogenic' is a term used in biology and medicine to describe substances, genes, or processes that counteract the formation of tumors. It is often used in the context of tumor suppressor genes, which normally prevent cells from growing and dividing uncontrollably.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The oncogenic gene had an anti-oncogenic effect.","correct":"✓ The tumor suppressor gene had an anti-oncogenic effect.","note":"Oncogenes promote tumor formation, while tumor suppressor genes (with anti-oncogenic effects) inhibit it. Using 'oncogenic' in this context is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["oncogene","oncogenesis","tumor suppressor gene"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anti-oncogenic' is a specialized term primarily used in the fields of oncology, genetics, and molecular biology. It describes the property of a substance or gene to suppress or prevent the formation of tumors. The term is most often encountered in scientific literature, research papers, and advanced medical discussions related to cancer prevention and treatment. A good understanding of basic genetics and cancer biology is helpful to understand this term.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers identified a novel gene with potent anti-oncogenic properties.","translation":"研究者らは、強力な抗腫瘍遺伝子特性を持つ新規遺伝子を特定しました。","type":"adjective","meaning_category":"tumor suppression"},{"sentence":"Enhancing the anti-oncogenic activity of certain proteins may offer a therapeutic strategy for cancer.","translation":"特定のタンパク質の抗腫瘍遺伝子活性を高めることは、がんの治療戦略を提供する可能性があります。","type":"adjective","meaning_category":"tumor suppression"}]}