{"word":"vasculitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血管炎","english_definition":"inflammation of blood vessels","examples":[{"sentence":"Vasculitis can affect blood vessels of any size, in any organ.","translation":"血管炎は、あらゆる臓器のあらゆるサイズの血管に影響を与える可能性があります。"},{"sentence":"Symptoms of vasculitis vary depending on the blood vessels and organs involved.","translation":"血管炎の症状は、関与する血管と臓器によって異なります。"},{"sentence":"Treatment for vasculitis often involves corticosteroids and other immunosuppressant medications.","translation":"血管炎の治療には、しばしばコルチコステロイドやその他の免疫抑制剤が用いられます。"}],"collocations":["primary vasculitis","secondary vasculitis","small vessel vasculitis","large vessel vasculitis","vasculitis symptoms","vasculitis treatment"],"synonyms":["angiitis","arteritis"],"antonyms":[]}],"etymology":{"value":"From 'vascul(ar)' (relating to blood vessels) + '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌvæskjʊˈlaɪtɪs/","syllables":"vas-cu-li-tis"},"inflection":{"noun_plural":"vasculitides (less common)"},"usage_notes":{"explanation":"Vasculitis refers to a group of disorders characterized by inflammation of blood vessels. The inflammation can cause the walls of the blood vessels to thicken, which reduces the width of the passageway through the vessel. If blood flow is restricted, it can result in organ and tissue damage. Vasculitis can be primary (the main illness) or secondary (resulting from another underlying disease).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ vasculitus","correct":"✓ vasculitis","note":"The correct spelling is 'vasculitis' with an 'i' after the 'l'."},{"incorrect":"✗ vasculitises","correct":"✓ vasculitis","note":"'Vasculitis' is typically used as an uncountable noun. While 'vasculitides' exists as a plural form, it is much less common."}],"priority":"★★☆"},"related_words":{"derivatives":["vasculitic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vasculitis' is a medical term referring to inflammation of blood vessels. Understanding this term requires some familiarity with medical terminology. The severity and symptoms of vasculitis can vary widely depending on the specific blood vessels affected and the underlying cause. Treatment often involves managing the inflammation and addressing any underlying conditions."},"example_sentences":[{"sentence":"The doctor suspected vasculitis based on the patient's symptoms and blood test results.","translation":"医師は、患者の症状と血液検査の結果に基づいて血管炎を疑いました。","type":"general","meaning_category":"diagnosis"},{"sentence":"Different types of vasculitis can affect different organs in the body.","translation":"さまざまな種類の血管炎が、体内のさまざまな臓器に影響を与える可能性があります。","type":"general","meaning_category":"types"},{"sentence":"Early diagnosis and treatment are crucial for managing vasculitis and preventing complications.","translation":"早期の診断と治療は、血管炎を管理し、合併症を防ぐために非常に重要です。","type":"general","meaning_category":"treatment"}]}