{"word":"Pseudoparasitism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"擬似寄生（ぎじきせい）：寄生生物ではないものが、寄生生物のように見えたり、寄生されたと誤認されたりする状態。","english_definition":"The condition of being falsely parasitized; the presence of nonparasitic organisms or objects that are mistaken for parasites.","examples":[{"sentence":"Pseudoparasitism can occur when pollen grains are mistaken for parasite eggs in a fecal sample.","translation":"擬似寄生は、糞便サンプル中の花粉粒が寄生虫の卵と間違われる場合に起こることがある。"},{"sentence":"The patient believed they were infected with parasites, but it was a case of pseudoparasitism caused by skin irritation.","translation":"患者は寄生虫に感染していると信じていたが、それは皮膚の炎症によって引き起こされた擬似寄生の場合だった。"}],"collocations":["diagnose pseudoparasitism (擬似寄生を診断する)","cause pseudoparasitism (擬似寄生を引き起こす)","differentiate from parasitism (寄生と区別する)"],"synonyms":["delusional parasitosis","parasitophobia","Ekbom syndrome"],"antonyms":[]}],"etymology":{"value":"\"Pseudo-\"（偽の）+ \"parasitism\"（寄生）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːdoʊˈpærəˌsɪtɪzəm","syllables":"pseu-do-par-a-si-tism"},"inflection":{"noun_plural":"pseudoparasitisms"},"usage_notes":{"explanation":"Pseudoparasitism refers to situations where non-parasitic materials are mistaken for parasites, or when individuals falsely believe they are infested with parasites despite medical evidence to the contrary. This can occur due to misidentification of objects in samples (e.g., pollen, fibers) or psychological conditions. It's important to differentiate pseudoparasitism from actual parasitic infections through proper diagnostic procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor confirmed pseudoparasitism with a blood test.","correct":"✓ The doctor ruled out parasitism and suspected pseudoparasitism after the blood test was negative.","note":"Pseudoparasitism is typically diagnosed by excluding actual parasitic infection, not by confirming its presence with a blood test. A negative blood test for parasites would support a diagnosis of pseudoparasitism."},{"incorrect":"✗ Pseudoparasitism is treated with antibiotics.","correct":"✓ Pseudoparasitism is often addressed with psychological support or by treating underlying skin conditions.","note":"Antibiotics are used to treat bacterial infections, not pseudoparasitism. Treatment for pseudoparasitism focuses on addressing the underlying cause, such as psychological distress or skin irritation."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoparasite (擬似寄生体)","parasitism (寄生)","parasite (寄生虫)"],"phrasal_verbs":[],"related_terms":["delusional parasitosis","Ekbom syndrome"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Pseudoparasitism\" is a specialized term primarily used in medical and veterinary contexts. It describes a situation where something is mistaken for a parasite, or when a person has a false belief that they are infested with parasites. This term is not commonly used in everyday language and requires a scientific or medical understanding to fully grasp its meaning."},"example_sentences":[{"sentence":"Microscopic examination revealed that the 'eggs' were actually plant material, confirming pseudoparasitism.","translation":"顕微鏡検査により、「卵」は実際には植物性物質であることが明らかになり、擬似寄生が確認された。","type":"noun","meaning_category":"擬似寄生"},{"sentence":"The veterinarian suspected pseudoparasitism when the animal showed symptoms of infestation but no parasites were found.","translation":"獣医は、動物が寄生症状を示しているにもかかわらず寄生虫が見つからなかった場合、擬似寄生を疑った。","type":"noun","meaning_category":"擬似寄生"}]}