{"word":"flat-visaged","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"平たい顔つきの、のっぺりとした顔の","english_definition":"having a face that is broad and without prominent features; having a flat face.","examples":[{"sentence":"The character was described as flat-visaged, with wide-set eyes.","translation":"その人物は、目が離れていて、のっぺりとした顔つきだと描写された。"},{"sentence":"Her flat-visaged expression gave little away about her true feelings.","translation":"彼女ののっぺりとした顔つきは、彼女の本当の気持ちをほとんど表していなかった。"}],"collocations":["flat-visaged people","flat-visaged expression","flat-visaged appearance"],"synonyms":["flat-faced","expressionless","inscrutable","blank-faced"],"antonyms":["expressive","sculpted","defined","chiseled"],"notes":"This term can sometimes be considered insensitive, depending on the context and intent."}],"etymology":{"value":"A compound word formed from 'flat' (meaning level or without depth) and 'visaged' (meaning having a face). 'Visaged' itself comes from the Old French 'visage,' meaning face.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌflætˈvɪzɪdʒd/","syllables":"flat-vi-saged"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can be used in comparative and superlative forms (more flat-visaged, most flat-visaged), though this is rare."},"usage_notes":{"explanation":"'Flat-visaged' is used to describe someone whose face lacks strong contours or prominent features. It is a relatively uncommon term and can be perceived as impolite or critical, so it should be used with caution. It is most often found in descriptive writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She had a flat-visaged personality.","correct":"✓ She had a flat-visaged appearance.","note":"'Flat-visaged' describes physical appearance, not personality."},{"incorrect":"✗ He is a flat-visaged landscape.","correct":"✓ N/A","note":"'Flat-visaged' only applies to people's faces, not landscapes or objects."}],"priority":"★☆☆"},"related_words":{"derivatives":["visage (noun: face)"],"phrases":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'flat-visaged' is a relatively uncommon and somewhat archaic term used to describe a face lacking prominent features. Due to its potential for being perceived as impolite, its usage is generally restricted to descriptive writing where precise physical characteristics are important. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The detective noted the suspect's flat-visaged appearance in his report.","translation":"刑事は報告書の中で、容疑者ののっぺりとした顔つきについて言及した。","type":"descriptive","meaning_category":"physical appearance"},{"sentence":"Despite her flat-visaged features, her eyes held a captivating intensity.","translation":"のっぺりとした顔立ちにもかかわらず、彼女の瞳には人を惹きつける強い輝きがあった。","type":"descriptive","meaning_category":"physical appearance"}]}