{"word":"hydrophoby","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"恐水病、狂犬病","english_definition":"An obsolete term for rabies, reflecting the symptom of difficulty in swallowing due to throat spasms, leading to a fear of water.","examples":[{"sentence":"Hydrophoby, also known as rabies, is a viral disease that affects the nervous system.","translation":"恐水病、別名狂犬病は、神経系に影響を与えるウイルス性の病気です。"},{"sentence":"Historically, hydrophoby was a terrifying disease with a high mortality rate.","translation":"歴史的に、恐水病は高い死亡率を伴う恐ろしい病気でした。"}],"collocations":["contract hydrophoby (恐水病に感染する)","symptoms of hydrophoby (恐水病の症状)","treatment for hydrophoby (恐水病の治療)"],"synonyms":["rabies","lyssa"],"antonyms":[]}],"etymology":{"value":"From Greek 'hydro' (water) + 'phobos' (fear), reflecting the symptom of fear of water in rabies patients.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdrəˈfoʊbi/","syllables":"hy-dro-pho-by"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Hydrophoby' is an older, less common term for rabies. The term reflects a characteristic symptom of the disease: difficulty swallowing, which leads to a fear of water. The modern and preferred term is 'rabies'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hydrophoby because he doesn't like swimming.","correct":"✓ He has rabies. / ✓ He is afraid of water.","note":"'Hydrophoby' refers specifically to rabies, not a general fear of water. If someone dislikes swimming, it's a different phobia or simply a preference."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrophobic (adjective: 疎水性の、水をはじく)","hydrophobe (noun: 疎水性物質)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - largely replaced by 'rabies'.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hydrophoby' is a historical term for rabies, a viral disease transmitted through the saliva of infected animals, typically through a bite. The term literally means 'fear of water' and refers to a prominent symptom of the disease: the extreme difficulty and pain experienced when swallowing, which makes the affected individual avoid water. While 'hydrophoby' is still occasionally used, the more common and medically accurate term is 'rabies'."},"example_sentences":[{"sentence":"The old medical texts described the symptoms of hydrophoby in detail.","translation":"古い医学書には、恐水病の症状が詳細に記述されていました。","type":"noun","meaning_category":"disease"},{"sentence":"The term hydrophoby is derived from the Greek words for water and fear.","translation":"恐水病という用語は、水と恐怖を意味するギリシャ語に由来しています。","type":"noun","meaning_category":"etymology"}]}