{"word":"paragglutination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(免疫学)傍凝集反応：抗体が存在下で、特定の粒子（例えば、細菌、赤血球）が凝集する現象。これは、真の抗原抗体反応とは異なり、他の要因（例えば、物理的、化学的条件の変化）によって引き起こされる非特異的な凝集である。","english_definition":"(immunology) A type of agglutination in which particles (e.g., bacteria, red blood cells) clump together in the presence of antibodies, but not due to a specific antigen-antibody reaction. This is a non-specific agglutination caused by other factors (e.g., changes in physical or chemical conditions).","examples":[{"sentence":"Paragglutination can lead to false-positive results in agglutination tests.","translation":"傍凝集反応は、凝集試験において偽陽性の結果をもたらす可能性がある。"},{"sentence":"The presence of certain salts can induce paragglutination in bacterial suspensions.","translation":"特定の塩の存在は、細菌懸濁液中で傍凝集反応を引き起こすことがある。"}],"collocations":["induce paragglutination (傍凝集反応を誘導する)","paragglutination test (傍凝集反応試験)","false-positive paragglutination (偽陽性の傍凝集反応)"],"synonyms":["non-specific agglutination","pseudoagglutination"],"antonyms":["true agglutination","specific agglutination"]}],"etymology":{"value":"接頭辞 para- (傍、類似の) + agglutination (凝集反応) に由来する。真の凝集反応に類似しているが、異なるメカニズムで起こることから名付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəɡluːtɪˈneɪʃən/","syllables":"par-a-glu-ti-na-tion"},"inflection":{"noun_plural":"paragglutinations"},"usage_notes":{"explanation":"Paragglutinationは、免疫学的な検査において、結果の解釈を複雑にする要因の一つである。真の抗原抗体反応による凝集と区別する必要があり、適切なコントロール試験や追加の検査を行うことで、誤った結果を避けることができる。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paragglutination was caused by a specific antibody.","correct":"✓ The paragglutination was caused by non-specific factors.","note":"Paragglutinationは非特異的な要因によって引き起こされるため、特定の抗体が原因であるという記述は誤りである。"},{"incorrect":"✗ Paragglutination is a reliable indicator of infection.","correct":"✓ Paragglutination is not a reliable indicator of infection.","note":"Paragglutinationは非特異的な反応であるため、感染の信頼できる指標とはならない。"}],"priority":"★★☆"},"related_words":{"derivatives":["agglutination (凝集反応)","autoagglutination (自己凝集反応)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**paragglutination**」は、免疫学で使われる専門用語で、特定の抗原と抗体の反応ではなく、他の要因によって粒子が凝集する現象を指します。これは、検査結果を誤って解釈する原因となるため、注意が必要です。例えば、ある種の細菌をテストする際に、特定の抗体がなくても凝集が起こることがあります。これは、塩分濃度の変化などが原因で起こるparagglutinationかもしれません。したがって、検査結果を正確に判断するには、paragglutinationと真の凝集反応を区別することが重要です。"},"example_sentences":[{"sentence":"The laboratory technician noted the presence of paragglutination in the sample.","translation":"検査技師は、サンプル中に傍凝集反応の存在を記録した。","type":"noun","meaning_category":"傍凝集反応"},{"sentence":"Distinguishing between true agglutination and paragglutination is crucial for accurate diagnosis.","translation":"真の凝集反応と傍凝集反応を区別することは、正確な診断のために非常に重要である。","type":"noun","meaning_category":"傍凝集反応"},{"sentence":"The researchers investigated the factors that can induce paragglutination in vitro.","translation":"研究者らは、in vitroで傍凝集反応を誘導する可能性のある要因を調査した。","type":"noun","meaning_category":"傍凝集反応"}]}