{"word":"toxigenicities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 毒素産生性、毒素原性","english_definition":"(plural form) The abilities or capacities of microorganisms to produce toxins.","examples":[{"sentence":"Studies on the toxigenicities of different strains of E. coli are crucial for food safety.","translation":"大腸菌の様々な菌株の毒素産生性に関する研究は、食品安全にとって非常に重要である。"},{"sentence":"The toxigenicities of fungi can vary greatly depending on environmental conditions.","translation":"菌類の毒素産生性は、環境条件によって大きく異なる可能性がある。"}],"collocations":["assess toxigenicities","compare toxigenicities","study toxigenicities","determine toxigenicities","measure toxigenicities","fungal toxigenicities","bacterial toxigenicities"],"synonyms":["virulence","pathogenicity","toxicity","poisonousness"],"antonyms":["non-toxigenicity","avirulence","non-pathogenicity"]},{"part_of_speech":"noun","definition":"(単数形:稀) 毒素産生性、毒素原性","english_definition":"(singular form, rare) The ability or capacity of a microorganism to produce toxins.","examples":[{"sentence":"The toxigenicity of the bacteria was confirmed through laboratory testing.","translation":"その細菌の毒素産生性は、実験室での検査を通じて確認された。"}],"collocations":["bacterial toxigenicity","fungal toxigenicity","high toxigenicity","low toxigenicity"],"synonyms":["virulence","pathogenicity","toxicity","poisonousness"],"antonyms":["non-toxigenicity","avirulence","non-pathogenicity"]}],"etymology":{"value":"Formed from 'toxigenic' (producing toxins) + '-ity' (suffix indicating a state or quality). 'Toxigenic' comes from 'toxin' (poison) + '-genic' (producing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒksɪdʒəˈnɪsɪtiz/","syllables":"tox-i-gen-i-ci-ties"},"inflection":{"noun_plural":"toxigenicities","noun_singular":"toxigenicity"},"usage_notes":{"explanation":"'Toxigenicities' refers to the inherent abilities of certain microorganisms (bacteria, fungi, etc.) to produce toxins. It's a technical term used primarily in microbiology, toxicology, and related fields. The singular form, 'toxigenicity,' is less common but refers to the same concept. The term is often used in the context of assessing the risk posed by certain microorganisms in food, water, or the environment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The toxigenicity are high.","correct":"✓ The toxigenicities are high.","note":"When referring to multiple strains or types of microorganisms, use the plural form, 'toxigenicities.' When referring to the general concept or the property of a single strain, use the singular form, 'toxigenicity'."},{"incorrect":"✗ Toxigenicity is a measure of how much toxin is present.","correct":"✓ Toxigenicity is a measure of the ability to produce toxins.","note":"'Toxigenicity' refers to the *ability* to produce toxins, not the amount of toxin present. The amount of toxin present would be referred to as toxin concentration or toxin levels."}],"priority":"★★☆"},"related_words":{"derivatives":["toxigenic (adjective: producing toxins)","toxin (noun: a poisonous substance produced by living cells or organisms)","toxicity (noun: the degree to which a substance is poisonous)","non-toxigenic (adjective: not producing toxins)"],"phrases":["toxigenic bacteria","toxigenic fungi","toxigenic strains","toxigenicity testing","toxigenicity assay"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a technical term used primarily in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxigenicities' is a technical term primarily used in scientific fields like microbiology and toxicology. It refers to the capacity or abilities of microorganisms to produce toxins. Understanding this term requires familiarity with basic concepts in biology and chemistry, particularly the nature of toxins and how they are produced by living organisms. The word is typically encountered in research papers, scientific reports, and specialized textbooks. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the toxigenicities of various Staphylococcus aureus isolates.","translation":"その研究では、様々な黄色ブドウ球菌分離株の毒素産生性を調査した。","type":"noun (plural)","meaning_category":"毒素産生性"},{"sentence":"Environmental factors can influence the toxigenicity of certain fungal species.","translation":"環境要因は、特定の菌類の毒素産生性に影響を与える可能性がある。","type":"noun (singular)","meaning_category":"毒素産生性"},{"sentence":"Comparative analyses of toxigenicities are essential for risk assessment.","translation":"毒素産生性の比較分析は、リスク評価に不可欠である。","type":"noun (plural)","meaning_category":"毒素産生性"}]}