{"word":"Antefuture","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文法) 未来完了時制、または未来完了時制で表現される出来事。","english_definition":"(grammar) The future perfect tense; or an event expressed in the future perfect tense.","examples":[{"sentence":"The antefuture is used to describe actions that will be completed before a specific time in the future.","translation":"未来完了は、未来の特定の時間より前に完了する行動を記述するために使用されます。"},{"sentence":"'By next year, I will have finished my degree' is an example of the antefuture.","translation":"「来年までに、私は学位を取得しているでしょう」は未来完了の例です。"}],"collocations":["future perfect","future perfect tense","will have + past participle"],"synonyms":["future perfect tense"],"antonyms":[]}],"etymology":{"value":"\"Ante-\" (before) + \"future\" (the time yet to come).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈfjuːtʃər/","syllables":"An-ti-fu-ture"},"inflection":{"noun_plural":"Antefutures"},"usage_notes":{"explanation":"The term \"antefuture\" is primarily used in grammatical discussions. It's a less common term than \"future perfect tense,\" but refers to the same grammatical concept. It emphasizes the 'before the future' aspect of the tense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I will antefuture go to the store.","correct":"✓ I will have gone to the store.","note":"'Antefuture' is a noun describing the tense, not a verb or auxiliary verb itself. You need to use the correct construction for the future perfect tense: 'will have + past participle'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'antefuture' is a technical grammatical term, less commonly used than 'future perfect tense'. Understanding it requires a solid grasp of grammatical terminology and tense structures. It's primarily encountered in advanced linguistic discussions or textbooks. The term emphasizes the completion of an action before a specific point in the future, which is the core function of the future perfect tense."},"example_sentences":[{"sentence":"The professor explained the use of the antefuture in complex sentence structures.","translation":"教授は複雑な文構造における未来完了の使い方を説明しました。","type":"noun","meaning_category":"grammatical term"},{"sentence":"Using the antefuture correctly can add precision to your writing when describing future events.","translation":"未来完了を正しく使うと、未来の出来事を記述する際に文章に正確さを加えることができます。","type":"noun","meaning_category":"grammatical term"}]}