{"word":"Albacora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ビンナガマグロ","english_definition":"A type of tuna (Thunnus alalunga) with long pectoral fins, also known as longfin tuna.","examples":[{"sentence":"Albacora tuna is prized for its light meat and mild flavor.","translation":"ビンナガマグロはその淡い身と穏やかな風味で珍重されています。"},{"sentence":"Canned albacora is a popular choice for tuna salad.","translation":"缶詰のビンナガマグロは、ツナサラダの一般的な選択肢です。"}],"collocations":["albacora tuna","canned albacora","albacora fishing"],"synonyms":["longfin tuna","Thunnus alalunga"],"antonyms":[]}],"etymology":{"value":"From Spanish or Portuguese, derived from Arabic 'al-bakūra' meaning 'the first fruits' or 'early ripening', referring to its early appearance in fishing seasons.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌælbəˈkɔːrə/","syllables":"al-ba-co-ra"},"inflection":{"noun_plural":"Albacoras"},"usage_notes":{"explanation":"'Albacora' specifically refers to the longfin tuna species (Thunnus alalunga). It's often used in culinary contexts, especially when discussing tuna dishes or canned tuna.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I caught a big tuna, it was an albacora.","correct":"✓ I caught a big tuna, it was an albacore.","note":"'Albacore' is the more common English spelling. 'Albacora' is used, but less frequently."}],"priority":"★★☆"},"related_words":{"derivatives":["albacore (more common English spelling)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Albacora' is a specific term for a type of tuna, primarily used in contexts related to fishing, seafood, or culinary discussions. It's not a common word in everyday conversation, but understanding it can be helpful when reading about these topics. The more common spelling is 'albacore'."},"example_sentences":[{"sentence":"The chef prepared a delicious albacora steak with a lemon-herb marinade.","translation":"シェフはレモンハーブマリネードを使った美味しいビンナガマグロのステーキを作りました。","type":"noun","meaning_category":"fish"},{"sentence":"Sustainable albacora fishing practices are essential for preserving the species.","translation":"持続可能なビンナガマグロ漁業は、種を保存するために不可欠です。","type":"noun","meaning_category":"fishing"}]}