{"word":"unforgivingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"容赦なく、厳しく、情け容赦なく","english_definition":"in a manner that shows no compassion or leniency; harshly or severely.","examples":[{"sentence":"The sun beat down unforgivingly on the desert landscape.","translation":"太陽が砂漠の風景に容赦なく照りつけた。"},{"sentence":"The critic unforgivingly attacked the actor's performance.","translation":"評論家は俳優の演技を情け容赦なく批判した。"},{"sentence":"The terrain was unforgivingly steep and rocky.","translation":"地形は容赦なく険しく、岩だらけだった。"}],"collocations":["unforgivingly harsh","unforgivingly critical","unforgivingly steep","unforgivingly cold","unforgivingly strict"],"synonyms":["harshly","severely","mercilessly","ruthlessly","cruelly","strictly","relentlessly","inexorably"],"antonyms":["compassionately","leniently","mercifully","forgivingly","kindly"]}],"etymology":{"value":"The word \"unforgivingly\" is formed by adding the suffix \"-ly\" to the adjective \"unforgiving.\" \"Unforgiving\" is derived from the verb \"forgive\" with the prefix \"un-\" indicating negation. Thus, \"unforgivingly\" means \"in a manner that does not forgive.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnfərˈɡɪvɪŋli/","syllables":"un-for-giv-ing-ly"},"inflection":{"notes":"As an adverb, \"unforgivingly\" does not have different forms."},"usage_notes":{"explanation":"\"Unforgivingly\" describes actions or conditions that are harsh, strict, or without mercy. It often implies a lack of compassion or leniency in a situation or towards someone. It can be used to describe both physical environments (e.g., unforgivingly hot desert) and human behavior (e.g., unforgivingly critical boss). It emphasizes the severity and lack of compromise in the described situation or action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He treated her unforgiving.","correct":"✓ He treated her unforgivingly.","note":"\"Unforgiving\" is an adjective, while \"unforgivingly\" is an adverb. Use \"unforgivingly\" to describe how someone or something acts or is treated."},{"incorrect":"✗ The weather was unforgiving, so we had a great time.","correct":"✓ The weather was unforgiving, so we had a difficult time.","note":"\"Unforgiving\" implies harshness or difficulty, so it's usually associated with negative experiences."}],"priority":"★★☆"},"related_words":{"derivatives":["unforgiving (adjective)","forgive (verb)","forgiveness (noun)"],"idioms_phrases":["None commonly used with 'unforgivingly'."],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adverb \"unforgivingly\" describes something done in a harsh or relentless manner, without any leniency or compassion. It's used to emphasize the severity of an action or situation. For example, \"The sun beat down unforgivingly\" means the sun was extremely hot and intense, offering no relief. This word is more common in formal writing and speech."},"example_sentences":[{"sentence":"The examination board graded the papers unforgivingly.","translation":"試験委員会は容赦なく論文を採点した。","type":"adverb","meaning_category":"厳しく"},{"sentence":"The desert sun shone down unforgivingly, making travel difficult.","translation":"砂漠の太陽が容赦なく照りつけ、移動を困難にした。","type":"adverb","meaning_category":"情け容赦なく"},{"sentence":"She spoke unforgivingly about his past mistakes.","translation":"彼女は彼の過去の過ちについて容赦なく語った。","type":"adverb","meaning_category":"厳しく"}]}