{"word":"cryptal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"隠された、秘密の、潜在的な","english_definition":"hidden; secret; latent.","examples":[{"sentence":"The cryptal meaning was only understood by a few.","translation":"その隠された意味は、ごくわずかな人しか理解できなかった。"},{"sentence":"Cryptal infections can remain dormant for years.","translation":"潜在的な感染症は何年も休眠状態のままでいる可能性がある。"}],"collocations":["cryptal meaning","cryptal infection","cryptal knowledge"],"synonyms":["hidden","secret","latent","occult","covert","arcane"],"antonyms":["obvious","overt","manifest","patent"]}],"etymology":{"value":"Derived from 'crypt', referring to something hidden or concealed, with the suffix '-al' indicating an adjective form.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪptəl/","syllables":"cryp-tal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more cryptal' and 'most cryptal', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Cryptal' is a relatively rare word, typically used in academic or specialized contexts to describe something that is hidden, secret, or not immediately apparent. It often implies a deeper, underlying meaning or condition that requires careful investigation to uncover.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cryptal was found in the basement.","correct":"✓ The crypt was found in the basement.","note":"'Cryptal' (adjective) should not be confused with 'crypt' (noun), which refers to an underground room or vault, often used for burial."}],"priority":"★☆☆"},"related_words":{"derivatives":["crypt (noun: a vault or underground chamber)","cryptic (adjective: mysterious or obscure)","cryptography (noun: the art of writing or solving codes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cryptal' is a rare and sophisticated word, primarily encountered in specialized or academic contexts. It describes something hidden or latent, requiring a high level of linguistic and contextual understanding to use correctly. Its usage suggests a nuanced and often scholarly approach to the subject matter."},"example_sentences":[{"sentence":"The detective searched for the cryptal clues hidden within the old manuscript.","translation":"探偵は古い原稿の中に隠された秘密の手がかりを探した。","type":"adjective","meaning_category":"隠された"},{"sentence":"The disease remained in a cryptal state, undetectable by standard tests.","translation":"その病気は潜在的な状態のままで、標準的な検査では検出できなかった。","type":"adjective","meaning_category":"潜在的な"},{"sentence":"Only those initiated into the secret society understood the cryptal significance of the symbol.","translation":"秘密結社に入会した者だけが、そのシンボルの隠された意義を理解していた。","type":"adjective","meaning_category":"秘密の"}]}