{"word":"unmethylated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"メチル化されていない","english_definition":"Not methylated; lacking a methyl group or groups where they would normally be present.","examples":[{"sentence":"The unmethylated cytosine residues were detected using bisulfite sequencing.","translation":"メチル化されていないシトシン残基は、亜硫酸水素塩シーケンスを用いて検出された。"},{"sentence":"Unmethylated DNA is often associated with active gene expression.","translation":"メチル化されていないDNAは、しばしば活発な遺伝子発現と関連付けられる。"}],"collocations":["unmethylated DNA","unmethylated cytosine","unmethylated promoter"],"synonyms":["non-methylated"],"antonyms":["methylated"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the word 'methylated'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈmɛθɪleɪtɪd/","syllables":"un-meth-yl-a-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"In the context of molecular biology and genetics, 'unmethylated' describes a molecule (typically DNA or RNA) that lacks a methyl group (CH3) at a specific location where it would normally be found. Methylation is a crucial epigenetic modification that can affect gene expression. Unmethylated regions are often associated with active or potentially active genes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The gene is unmethylated, so it will not be expressed.","correct":"The gene is unmethylated, so it is likely to be expressed.","note":"Unmethylated DNA is generally associated with gene expression, not silencing."}],"priority":"★★☆"},"related_words":{"derivatives":["methylation","methylated","methylate","demethylated"],"related_terms":["epigenetics","DNA methylation","cytosine","gene expression","bisulfite sequencing"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'unmethylated' is a technical term used in the fields of molecular biology, genetics, and biochemistry. Understanding this term requires knowledge of basic concepts in these fields, such as DNA methylation and epigenetics. It is not commonly used in everyday language. Therefore, it is considered to be at an advanced readability level."},"example_sentences":[{"sentence":"The researchers found that the promoter region of the gene was largely unmethylated in the tumor cells.","translation":"研究者らは、その遺伝子のプロモーター領域が腫瘍細胞において大部分がメチル化されていないことを発見した。","type":"scientific","meaning_category":"molecular biology"},{"sentence":"Analysis of unmethylated CpG islands can provide insights into gene regulation.","translation":"メチル化されていないCpGアイランドの分析は、遺伝子調節に関する洞察を提供することができる。","type":"scientific","meaning_category":"genetics"}]}