{"word":"overtutor","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過剰に教え込む、過保護に指導する","english_definition":"To tutor (someone) excessively, to the point where it becomes detrimental to the student's learning or development.","examples":[{"sentence":"The parents overtutored their child, leaving no room for independent learning.","translation":"親は子供を過剰に教え込み、自主学習の余地を全く残さなかった。"},{"sentence":"She felt overtutored and unable to think for herself.","translation":"彼女は過剰に教え込まれたと感じ、自分で考えることができなかった。"},{"sentence":"The school discourages overtutoring, believing it hinders creativity.","translation":"その学校は過剰な教え込みを推奨しておらず、創造性を阻害すると考えている。"}],"collocations":["overtutor a child (子供を過剰に教え込む)","overtutor in math (数学を過剰に教え込む)","overtutor for exams (試験のために過剰に教え込む)"],"synonyms":["overcoach","overinstruct","spoon-feed","helicopter parent"],"antonyms":["underteach","neglect","ignore"]},{"part_of_speech":"noun","definition":"過剰な指導、過保護な教育","english_definition":"The act or practice of tutoring excessively.","examples":[{"sentence":"Overtutoring can lead to burnout and a lack of motivation.","translation":"過剰な指導は、燃え尽き症候群やモチベーションの低下につながる可能性がある。"},{"sentence":"The debate over overtutoring is common among educators.","translation":"過剰な指導に関する議論は、教育者の間でよく見られる。"},{"sentence":"Many believe that overtutoring stifles a child's natural curiosity.","translation":"多くの人が、過剰な指導は子供の自然な好奇心を抑圧すると信じている。"}],"collocations":["the dangers of overtutoring (過剰な指導の危険性)","the effects of overtutoring (過剰な指導の影響)","avoid overtutoring (過剰な指導を避ける)"],"synonyms":["overcoaching","overinstruction"],"antonyms":["underteaching","neglect"]}],"etymology":{"value":"\"over-\" (過剰に) + \"tutor\" (教える)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈtjuːtər/","syllables":"o-ver-tu-tor"},"inflection":{"verb_forms":{"present_simple":["overtutor","overtutors"],"past_simple":"overtutored","past_participle":"overtutored","present_participle":"overtutoring"},"noun_plural":"overtutorings"},"usage_notes":{"explanation":"\"Overtutor\" refers to the act of providing excessive tutoring, often to the point where it becomes harmful to the student's learning process. It's often associated with parents or educators who are overly involved in a student's academic life, hindering their ability to learn independently and develop problem-solving skills.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She overtutors her student to make them perfect.","correct":"✓ She overtutors her student, trying to make them perfect.","note":"The word 'to' should be replaced with a comma and a present participle phrase to indicate purpose."},{"incorrect":"✗ Overtutoring is good for all students.","correct":"✓ Overtutoring is generally not considered beneficial for students.","note":"Overtutoring is generally seen as detrimental, so avoid presenting it as a universally positive practice."}],"priority":"★★☆"},"related_words":{"derivatives":["tutor (家庭教師)","tutoring (指導)","overparenting (過保護な子育て)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"overtutor\" describes the act of providing excessive tutoring, which can be harmful to a student's learning. It is often used in discussions about parenting styles and educational practices. The term implies that the tutoring is so intense or frequent that it prevents the student from developing independent learning skills and critical thinking abilities. Understanding this word requires a good grasp of the prefix \"over-\" and the concept of tutoring.","priority":"★★☆"},"example_sentences":[{"sentence":"The teacher warned against overtutoring, emphasizing the importance of self-discovery in learning.","translation":"教師は過剰な教え込みに警告し、学習における自己発見の重要性を強調した。","type":"verb","meaning_category":"過剰に教え込む"},{"sentence":"The negative effects of overtutoring can include anxiety and a lack of self-confidence.","translation":"過剰な指導の悪影響には、不安や自信の欠如などが含まれる可能性がある。","type":"noun","meaning_category":"過剰な指導"}]}