{"word":"gynandromorphism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"雌雄モザイク、雌雄型","english_definition":"The condition of having both male and female characteristics in different parts of the body.","examples":[{"sentence":"Gynandromorphism is observed in insects, crustaceans, and birds.","translation":"雌雄モザイクは昆虫、甲殻類、鳥類で観察されます。"},{"sentence":"The gynandromorphic butterfly had one side with male wing patterns and the other with female wing patterns.","translation":"その雌雄モザイクの蝶は、片方の翅が雄の模様で、もう片方が雌の模様でした。"}],"collocations":["bilateral gynandromorphism (左右型雌雄モザイク)","mosaic gynandromorphism (モザイク型雌雄モザイク)"],"synonyms":["sexual mosaic","sex mosaic"],"antonyms":[]}],"etymology":{"value":"From Greek γυνή (gynē, \"woman\") + ἀνήρ (anēr, \"man\") + δρόμος (dromos, \"course, running\") + μορφή (morphē, \"form\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒaɪˌnændroʊˈmɔːrfɪzəm/","syllables":"gy-nan-dro-mor-phism"},"inflection":{"noun_plural":"gynandromorphisms"},"usage_notes":{"explanation":"Gynandromorphism is a rare genetic condition where an organism exhibits both male and female characteristics. This is different from hermaphroditism, where an organism has both male and female reproductive organs. Gynandromorphs have distinct regions of male and female characteristics, often divided down the middle of the body (bilateral gynandromorphism) or in a mosaic pattern.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal was a hermaphrodite because it showed gynandromorphism.","correct":"✓ The animal showed gynandromorphism, which is different from being a hermaphrodite.","note":"Gynandromorphism is distinct from hermaphroditism. Gynandromorphs have distinct male and female parts, while hermaphrodites have both male and female reproductive organs."}],"priority":"★☆☆"},"related_words":{"derivatives":["gynandromorph (noun: 雌雄モザイク個体)"],"related_terms":["hermaphrodite (両性具有者)","intersex (間性)","chimera (キメラ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"gynandromorphism\" refers to a biological condition where an organism displays both male and female characteristics in distinct parts of its body. This phenomenon arises from genetic abnormalities during early development, leading to a mosaic of cells with different sex chromosomes. Unlike hermaphroditism, where an organism possesses both male and female reproductive organs, gynandromorphism results in a spatial separation of sexual characteristics. The term is primarily used in scientific contexts, particularly in genetics and developmental biology, to describe and study these unique organisms. Understanding this term requires a background in biological sciences.","priority":"★☆☆"},"example_sentences":[{"sentence":"The crab exhibited bilateral gynandromorphism, with one side appearing male and the other female.","translation":"そのカニは左右型雌雄モザイクを示し、片側が雄に見え、もう片側が雌に見えた。","type":"general","meaning_category":"general"},{"sentence":"Studies of gynandromorphism in Drosophila have provided insights into sex determination mechanisms.","translation":"ショウジョウバエにおける雌雄モザイクの研究は、性決定のメカニズムに関する洞察を提供してきた。","type":"scientific","meaning_category":"scientific"}]}