{"word":"commutuality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"相互性、互換性、共通性 (特に感情、利益、義務など)","english_definition":"The state or quality of being mutual or reciprocal; reciprocity; mutual exchange or action.","examples":[{"sentence":"The success of the project depended on the commutuality of effort from all team members.","translation":"プロジェクトの成功は、チームメンバー全員の努力の相互性に依存していた。"},{"sentence":"There was a strong sense of commutuality in their friendship, with each always ready to support the other.","translation":"彼らの友情には強い相互性があり、常にお互いを支え合う準備ができていた。"},{"sentence":"The commutuality of benefits in the trade agreement ensured a fair exchange between the two countries.","translation":"貿易協定における利益の相互性は、両国間の公正な交換を保証した。"}],"collocations":["commutuality of interest (利害の相互性)","commutuality of effort (努力の相互性)","commutuality of benefits (利益の相互性)","sense of commutuality (相互性の感覚)","lack of commutuality (相互性の欠如)"],"synonyms":["reciprocity","mutuality","interdependence","interrelation","exchange","correlation","correspondence","interrelationship"],"antonyms":["unilateralism","independence","autonomy","self-sufficiency","isolation"]},{"part_of_speech":"noun","definition":"(数学、論理学) 可換性","english_definition":"(Mathematics, Logic) The property of certain mathematical operations (such as addition and multiplication) that allows terms to be reordered without changing the result.","examples":[{"sentence":"Addition and multiplication possess the property of commutuality.","translation":"足し算と掛け算は可換性という性質を持つ。"},{"sentence":"The commutuality of the operation was essential for simplifying the equation.","translation":"その演算の可換性は、方程式を単純化するために不可欠だった。"}],"collocations":["commutuality property (可換性)","commutuality of addition (足し算の可換性)","commutuality of multiplication (掛け算の可換性)"],"synonyms":["commutativity"],"antonyms":["non-commutativity"]}],"etymology":{"value":"Derived from 'mutual' (Latin 'mutuus' - borrowed, reciprocal) with the prefix 'com-' (Latin 'cum' - with, together). Thus, 'commutuality' signifies 'together in mutuality' or 'shared reciprocity'.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˌmjuːtʃuˈæləti/","syllables":"com-mu-tu-al-i-ty"},"inflection":{"noun_plural":"commutualities"},"usage_notes":{"explanation":"'Commutuality' emphasizes the shared or reciprocal nature of a relationship, action, or benefit. It is often used in contexts where mutual understanding, support, or exchange is crucial. In mathematics and logic, it refers to the property of certain operations where the order of operands does not affect the result (commutativity).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The commutuality between the two companies was based on competition.","correct":"✓ The mutuality between the two companies was based on cooperation.","note":"'Commutuality' implies cooperation and shared benefits, not competition. Use 'mutuality' or 'reciprocity' to emphasize mutual exchange or benefit. If competition is involved, a different term is needed."},{"incorrect":"✗ The commutuality of the decision was questioned.","correct":"✓ The fairness of the decision was questioned.","note":"'Commutuality' refers to the reciprocal nature of a relationship or exchange, not the fairness or impartiality of a decision. Use 'fairness', 'impartiality', or 'equity' to describe the decision-making process."}],"priority":"★★☆"},"related_words":{"derivatives":["mutual","mutuality","commute","commutative","commutativity"],"related_concepts":["reciprocal altruism","game theory","social contract theory","commutative algebra"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Commutuality' is a relatively rare and formal term that refers to the quality of being mutual or reciprocal, emphasizing a shared relationship, action, or benefit. It is often used in academic or technical contexts. The term is most frequently encountered in discussions of social relationships, economics, or mathematics. It is important to distinguish it from 'mutuality', which is a more common synonym. In mathematics, it is closely related to the concept of 'commutativity', which describes operations where the order of operands does not affect the result."},"example_sentences":[{"sentence":"The success of the collaborative project hinged on the **commutuality** of respect and understanding among the participants.","translation":"共同プロジェクトの成功は、参加者間の尊敬と理解の相互性にかかっていた。","type":"noun","meaning_category":"相互性"},{"sentence":"In abstract algebra, the **commutuality** of certain operations is a fundamental concept.","translation":"抽象代数学では、特定の演算の可換性は基本的な概念である。","type":"noun","meaning_category":"可換性"},{"sentence":"A strong sense of **commutuality** fostered a supportive and productive work environment.","translation":"強い相互性の感覚が、支援的で生産的な職場環境を育んだ。","type":"noun","meaning_category":"相互性"},{"sentence":"The **commutuality** of interests between the two organizations led to a successful partnership.","translation":"2つの組織間の利害の相互性が、成功したパートナーシップにつながった。","type":"noun","meaning_category":"相互性"}]}