{"word":"house-husband","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"主夫、専業主夫","english_definition":"a man who stays at home and takes care of the house and family while his wife goes out to work; a stay-at-home dad.","examples":[{"sentence":"He is a house-husband and enjoys cooking and taking care of the children.","translation":"彼は主夫で、料理や子供の世話を楽しんでいます。"},{"sentence":"More and more men are becoming house-husbands as traditional gender roles evolve.","translation":"伝統的な性別の役割が進化するにつれて、主夫になる男性が増えています。"},{"sentence":"Being a house-husband is a challenging but rewarding job.","translation":"主夫であることは、大変ですがやりがいのある仕事です。"}],"collocations":["full-time house-husband (専業主夫)","stay-at-home house-husband (在宅主夫)","working wife and house-husband (共働き妻と主夫)"],"synonyms":["stay-at-home dad","homemaker (male)"],"antonyms":["working husband","career man"]}],"etymology":{"value":"'House' + 'husband'. The term reflects a reversal of traditional gender roles, where the husband traditionally was the breadwinner and the wife managed the household.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaʊsˌhʌzbənd/","syllables":"house-hus-band"},"inflection":{"noun_plural":"house-husbands"},"usage_notes":{"explanation":"The term 'house-husband' is used to describe a man who primarily manages the household and takes care of the family, while his partner (usually his wife) works outside the home. It is a relatively modern term that reflects changing societal norms and gender roles. It is often used interchangeably with 'stay-at-home dad,' although 'house-husband' specifically emphasizes the marital relationship.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a house husband, but he also works part-time.","correct":"✓ He is primarily a house-husband, but he also works part-time.","note":"The term 'house-husband' implies that the primary role is managing the household. If the man also works, it's important to clarify that his main role is still at home."},{"incorrect":"✗ She is a house-husband.","correct":"✓ He is a house-husband.","note":"'House-husband' refers specifically to a man. For a woman in a similar role, the term 'housewife' or 'stay-at-home mom' is used."}],"priority":"★★☆"},"related_words":{"derivatives":["housewife (主婦)","homemaker (主婦、家事をする人)","stay-at-home mom (専業主婦)","stay-at-home parent (専業主夫/婦)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'House-husband' is a compound noun that describes a man who takes on the traditional role of a housewife. It's used in discussions about gender roles, family dynamics, and modern lifestyles. The term is straightforward, but understanding its significance requires awareness of societal changes and evolving family structures. It is more common in discussions about social trends than in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"As a house-husband, he found fulfillment in raising his children.","translation":"主夫として、彼は子供たちを育てることに充実感を見出しました。","type":"noun","meaning_category":"role"},{"sentence":"The article explored the challenges and rewards of being a house-husband in a society that still often expects men to be the primary breadwinners.","translation":"その記事は、男性が主な稼ぎ手であることを期待することが多い社会で、主夫であることの課題と報酬を探求しました。","type":"noun","meaning_category":"social context"},{"sentence":"He decided to become a house-husband so his wife could pursue her career.","translation":"彼は妻がキャリアを追求できるように、主夫になることに決めました。","type":"noun","meaning_category":"lifestyle choice"}]}