{"word":"snack-addicted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"スナック菓子中毒の、間食中毒の","english_definition":"Habitually consuming excessive amounts of snack foods.","examples":[{"sentence":"He's become quite snack-addicted since he started working from home.","translation":"彼は在宅勤務になってから、すっかりスナック菓子中毒になってしまった。"},{"sentence":"The snack-addicted child always asks for chips and cookies.","translation":"その間食中毒の子供はいつもポテトチップスやクッキーをねだる。"}],"collocations":["snack-addicted child","snack-addicted lifestyle"],"synonyms":["junk-food junkie","snackaholic"],"antonyms":["healthy eater","health-conscious"],"notes":["This word is often used informally and can carry a slightly negative connotation."]}],"etymology":{"value":"Formed by combining 'snack' (a small amount of food eaten between meals) and 'addicted' (physically or psychologically dependent on a substance or activity).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsnæk əˈdɪktɪd/","syllables":"snack-ad-dict-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Snack-addicted' describes someone who has a strong craving for and frequently consumes snack foods, often to an unhealthy extent. It implies a dependency or habitual behavior.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is addict to snack.","correct":"✓ He is snack-addicted.","note":"'Snack-addicted' is an adjective, not a noun. Use it to describe the person, not as a direct replacement for 'addict'."}],"priority":"N/A"},"related_words":{"derivatives":["addict","addiction","snack"],"related_terms":["junk food","comfort food","processed food"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, not a standard dictionary word.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Snack-addicted' is a compound adjective describing someone who frequently eats snacks, often to an unhealthy degree. It combines the words 'snack' and 'addicted,' implying a strong craving or dependency on snack foods. The term is relatively informal and not as commonly used as 'addicted' on its own, but its meaning is easily understood from its components."},"example_sentences":[{"sentence":"The doctor warned him about the dangers of being snack-addicted.","translation":"医者は彼に、スナック菓子中毒であることの危険性について警告した。","type":"adjective","meaning_category":"スナック菓子中毒の"},{"sentence":"She realized she was snack-addicted when she couldn't go an hour without eating chips.","translation":"彼女は、ポテトチップスを食べずに1時間も過ごせないことに気づいたとき、自分が間食中毒だと自覚した。","type":"adjective","meaning_category":"間食中毒の"}]}