{"word":"Hydrophora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of long-legged flies in the family Dolichopodidae.","english_definition":"A genus of flies belonging to the family Dolichopodidae, known for their elongated legs and preference for moist habitats.","examples":[{"sentence":"Specimens of Hydrophora were collected near the riverbank.","translation":"Hydrophora属の標本が川岸近くで採集された。"},{"sentence":"The Hydrophora fly is characterized by its metallic green body.","translation":"Hydrophora属のハエは、金属的な緑色の体が特徴である。"}],"collocations":["Hydrophora species","Hydrophora habitat","Hydrophora identification"],"synonyms":["Dolichopodid fly","Long-legged fly"],"antonyms":[]}],"etymology":{"value":"The name Hydrophora is derived from Greek, combining 'hydro' (ὕδωρ) meaning water, and 'phora' (φορά) meaning bearing or carrying. This refers to the fly's affinity for aquatic or moist environments.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdrɒˈfɔːrə/","syllables":"Hy-dro-pho-ra"},"inflection":{"noun_plural":"Hydrophora (same as singular)"},"usage_notes":{"explanation":"Hydrophora is a scientific term used in entomology to classify a specific group of flies. When discussing these flies, it's important to use the correct scientific nomenclature to avoid ambiguity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Hydrophora on my window, it was very small.","correct":"✓ I saw a Hydrophora on my window; it was very small.","note":"Hydrophora refers to a genus, so using 'a Hydrophora' is technically correct, but it's more common to specify the species if known. If not, simply stating you saw a long-legged fly is more natural in casual conversation."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hydrophorinae (a subfamily within Dolichopodidae)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Scientific term, not commonly used in general conversation)","frequency_google_ngram":"Low frequency (scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hydrophora is a technical term from the field of entomology, specifically referring to a genus of long-legged flies. Understanding this term requires familiarity with scientific classification systems and entomological vocabulary. It is not typically encountered outside of scientific contexts.","requires_background":"Entomology, biological classification"},"example_sentences":[{"sentence":"The genus Hydrophora includes several species adapted to wetland environments.","translation":"Hydrophora属には、湿地環境に適応したいくつかの種が含まれている。","type":"noun","meaning_category":"Genus of flies"},{"sentence":"Researchers are studying the behavior of Hydrophora flies in relation to water quality.","translation":"研究者たちは、水質と関連したHydrophora属のハエの行動を研究している。","type":"noun","meaning_category":"Genus of flies"}]}