{"word":"propleural","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(昆虫学)前胸側板の、前胸側板に関する","english_definition":"Relating to the propleuron (the lateral part of the prothorax in insects).","examples":[{"sentence":"The propleural suture is a key feature for identifying certain insect species.","translation":"前胸側板縫合線は、特定の昆虫種を識別するための重要な特徴です。"},{"sentence":"Propleural bristles can vary in number and arrangement among different insect groups.","translation":"前胸側板剛毛の数と配置は、異なる昆虫群の間で異なる場合があります。"}],"collocations":["propleural suture","propleural bristles","propleural region"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'pro-' (meaning 'before' or 'in front of') + 'pleural' (relating to the pleuron, the lateral part of a segment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈplʊərəl/","syllables":"pro-pleu-ral"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are rare for this word)."},"usage_notes":{"explanation":"'Propleural' is a highly specialized term used almost exclusively in entomology (the study of insects). It refers specifically to the propleuron, which is a sclerite (hardened plate) found on the side of the prothorax (the first segment of the thorax) of an insect. The term is used in descriptions of insect anatomy and in taxonomic keys for identifying different species.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["propleuron (noun): the lateral part of the prothorax in insects."],"related_terms":["prothorax","pleuron","mesopleural","metapleural"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency (specialized term).","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Propleural' is a technical term used in entomology. Understanding its meaning requires knowledge of insect anatomy, specifically the segmentation of the thorax. It's unlikely to be encountered outside of scientific contexts related to insect morphology and taxonomy."},"example_sentences":[{"sentence":"The shape of the propleural sclerite is a diagnostic character for this genus.","translation":"前胸側板の硬板の形状は、この属の診断特性です。","type":"adjective","meaning_category":"insect anatomy"},{"sentence":"Detailed examination of the propleural region is necessary for accurate species identification.","translation":"正確な種同定のためには、前胸側板領域の詳細な検査が必要です。","type":"adjective","meaning_category":"insect anatomy"}]}