{"word":"enantiotropic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(物質が)ある特定の温度で可逆的に結晶構造を変化させる性質を持つ","english_definition":"(of a substance) capable of existing in two or more crystalline forms which are interconvertible at a definite transition temperature.","examples":[{"sentence":"Sulfur is an enantiotropic element, existing as rhombic sulfur below 95.5 °C and monoclinic sulfur above this temperature.","translation":"硫黄はエナンチオトロピーな元素であり、95.5℃以下では斜方硫黄、この温度以上では単斜硫黄として存在する。"}],"collocations":["enantiotropic transformation","enantiotropic substance","enantiotropic transition"],"synonyms":["polymorphic","allotropic"],"antonyms":["monotropic"]}],"etymology":{"value":"ギリシャ語の「enantios」（反対の）+「tropos」（変化、方向）に由来する。温度変化によって結晶形が可逆的に変化する性質を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌnæntiəˈtrɒpɪk/","syllables":"e-nan-ti-o-trop-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**enantiotropic**」は、主に化学や物理学の分野で使用される専門用語です。物質が特定の温度（転移温度）において、異なる結晶構造の間で可逆的に変化する性質を指します。この性質を持つ物質は、温度変化に応じて結晶形を変化させることができます。一般的には、日常会話で使用されることはほとんどありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The enantiotropic property is when a substance only has one crystal form.","correct":"✓ The enantiotropic property is when a substance can reversibly change between two or more crystal forms at a specific temperature.","note":"エナンチオトロピーは、物質が複数の結晶形を持ち、それらが可逆的に変化する性質を指します。単一の結晶形しか持たない場合は、エナンチオトロピーではありません。"},{"incorrect":"✗ Water is enantiotropic because it can be ice, liquid, or gas.","correct":"✓ Water is polymorphic because it can exist in different phases (solid, liquid, gas), but it is not enantiotropic in the strict sense because it doesn't refer to different crystal structures.","note":"水は固体、液体、気体という異なる相を持ちますが、エナンチオトロピーは結晶構造の変化に特化した用語です。水の相変化は、より一般的な多形現象（polymorphism）として説明されます。"}],"priority":"★★☆"},"related_words":{"derivatives":["enantiotropy (名詞: エナンチオトロピー)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**enantiotropic**」は、化学や物理学で使われる専門的な用語です。物質が特定の温度で、異なる結晶構造の間を可逆的に変化する性質を指します。例えば、ある物質が特定の温度以下ではAという結晶構造を持ち、その温度以上ではBという結晶構造を持つ場合、その物質はエナンチオトロピーであると言えます。日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"Tin exhibits enantiotropic behavior, transforming from gray tin to white tin at 13.2 °C.","translation":"スズはエナンチオトロピーな挙動を示し、13.2℃で灰スズから白スズに変化する。","type":"adjective","meaning_category":"結晶構造の変化"}]}