{"word":"Phlomis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キバナモウズイカ属 (シソ科の植物の属)","english_definition":"A genus of flowering plants in the family Lamiaceae (mint family).","examples":[{"sentence":"The garden featured several species of Phlomis.","translation":"その庭にはキバナモウズイカ属の植物が数種類植えられていた。"}],"collocations":[],"synonyms":["Jerusalem sage"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word 'phlomos' (φλόμος), which was used to refer to a plant believed to be mullein (Verbascum).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfloʊmɪs/","syllables":"Phlo-mis"},"inflection":{"noun_plural":"Phlomises"},"usage_notes":{"explanation":"'Phlomis' refers to a specific genus of plants. It's a botanical term, so it's primarily used in contexts related to gardening, botany, or plant identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a phlomis in my garden, it was very beautiful.","correct":"✓ I saw a Phlomis in my garden, it was very beautiful.","note":"'Phlomis' is a genus name and should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Lamiaceae (family)","Verbascum (mullein)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Phlomis' is a botanical term referring to a specific genus of plants in the mint family (Lamiaceae). It is primarily used in specialized contexts such as botany, horticulture, and gardening. Understanding this term requires a familiarity with plant classification and terminology. Its usage is infrequent in general conversation.","note":"This word is not commonly used. It is a scientific term."},"example_sentences":[{"sentence":"Phlomis russeliana, with its distinctive yellow flowers, is a popular choice for drought-tolerant gardens.","translation":"特徴的な黄色の花を持つPhlomis russelianaは、乾燥に強い庭に人気があります。","type":"noun","meaning_category":"plant species"},{"sentence":"The genus Phlomis is native to the Mediterranean region and parts of Asia.","translation":"キバナモウズイカ属は地中海地域とアジアの一部が原産です。","type":"noun","meaning_category":"plant genus"}]}