{"word":"Cirrocumulous","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"巻積雲（けんせきうん）","english_definition":"A cloud belonging to a class characterized by thin white patches, composed of very small elements, often merged, and arranged in a more or less regular pattern.","examples":[{"sentence":"The sky was filled with cirrocumulous clouds, resembling a mackerel sky.","translation":"空は巻積雲で覆われ、うろこ雲のようだった。"}],"collocations":["cirrocumulous cloud layer","patchy cirrocumulous","cirrocumulous formations"],"synonyms":["mackerel sky","sheet clouds"],"antonyms":[]}],"etymology":{"value":"From Latin 'cirrus' (a lock of hair, curl) + 'cumulus' (heap, pile), referring to the appearance of small, heaped or piled curls in the sky.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪroʊˈkjuːmjələs/","syllables":"cir-ro-cu-mu-lous"},"inflection":{"noun_plural":"cirrocumuli"},"usage_notes":{"explanation":"Cirrocumulous clouds are high-altitude clouds typically appearing above 6,000 meters (20,000 feet). They are composed of ice crystals and often indicate stable atmospheric conditions. The term is used in meteorology and cloud classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a cirrocumulus cloud yesterday.","correct":"✓ I saw cirrocumulous clouds yesterday.","note":"Since they usually appear in groups or layers, the plural form is more common, although singular is acceptable. "},{"incorrect":"✗ Cirrocumulous clouds are made of water droplets.","correct":"✓ Cirrocumulous clouds are made of ice crystals.","note":"At such high altitudes, the clouds are composed of ice crystals rather than water droplets."}],"priority":"★☆☆"},"related_words":{"derivatives":["cirrus","cumulus","altocumulus","stratocumulus"],"related_terms":["cloud types","meteorology","atmospheric science"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cirrocumulous' is a technical term used in meteorology to describe a specific type of high-altitude cloud. Understanding requires familiarity with basic cloud classification and some knowledge of atmospheric science. It is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The presence of cirrocumulous clouds often indicates an approaching weather change.","translation":"巻積雲の存在は、しばしば天候の変化が近づいていることを示す。","type":"descriptive","meaning_category":"meteorology"},{"sentence":"Photographers often appreciate the delicate patterns formed by cirrocumulous clouds at sunset.","translation":"写真家は、夕焼け時に巻積雲が作る繊細な模様をよく評価する。","type":"descriptive","meaning_category":"visual description"}]}