{"word":"anfitrione","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(男性)主催者、ホスト、もてなす人","english_definition":"(male) host, especially one who is generous and welcoming.","examples":[{"sentence":"El anfitrione nos recibió con una gran sonrisa.","translation":"The host greeted us with a big smile."},{"sentence":"Un buen anfitrione siempre se asegura de que sus invitados estén cómodos.","translation":"A good host always makes sure his guests are comfortable."}],"collocations":["ser un buen anfitrione (to be a good host)","anfitrione generoso (generous host)","anfitrione amable (kind host)"],"synonyms":["huésped (host)","dueño de casa (house owner)","recibidor (greeter)"],"antonyms":["invitado (guest)"]},{"part_of_speech":"noun","definition":"(男性)太っ腹な人、気前の良い人 (皮肉を込めて使われることもある)","english_definition":"(male) A generous person, especially one who provides lavish hospitality (sometimes used ironically).","examples":[{"sentence":"Se portó como un verdadero anfitrione, invitándonos a todo.","translation":"He acted like a true host, inviting us to everything."},{"sentence":"(ironic) ¡Mira al anfitrione, pagando todo con la tarjeta de crédito de su padre!","translation":"(ironic) Look at the generous host, paying for everything with his father's credit card!"}],"collocations":["hacer de anfitrione (to act as a host)","ser el anfitrione (to be the host)"],"synonyms":["generoso (generous)","dadivoso (giving)"],"antonyms":["tacaño (stingy)","avaro (miserly)"]}],"etymology":{"value":"From the Greek mythological figure Amphitryon (Ἀμφιτρύων), who generously hosted Zeus without knowing his true identity. The term came to be associated with generous hosts.","priority":"★★★"},"pronunciation":{"ipa":"/am.fiˈtɾjo.ne/","syllables":"am-fi-trio-ne"},"inflection":{"gender":"masculine","plural":"anfitriones"},"usage_notes":{"explanation":"The word \"anfitrione\" is primarily used in Spanish to refer to a male host. The feminine form is \"anfitriona\". It often implies a sense of generosity and hospitality, stemming from the mythological origin. While it can be used literally to describe someone hosting an event, it can also be used figuratively or even ironically to describe someone who is generous or pretends to be so.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"La anfitrione nos recibió.","correct":"La anfitriona nos recibió.","note":"The feminine form of the noun is 'anfitriona'."},{"incorrect":"Él es muy anfitriona.","correct":"Él es muy anfitrione.","note":"The masculine form must be used when referring to a male host."}],"priority":"★★☆"},"related_words":{"derivatives":["anfitrionear (to host)","anfitrionaje (hosting)"],"phrases":["hacer de anfitrione (to act as a host)"],"priority":"★★☆"},"level_frequency":{"level":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"anfitrione\" is a relatively sophisticated term for a host, particularly one who is generous and welcoming. It's not a word used in everyday casual conversation but is more common in formal settings or literature. The connection to the mythological figure Amphitryon adds a layer of cultural understanding to the word's meaning. Understanding the gendered nature of the word (masculine) and its feminine counterpart (anfitriona) is also important for correct usage."},"example_sentences":[{"sentence":"El **anfitrione** de la fiesta nos ofreció una copa de vino.","translation":"The host of the party offered us a glass of wine.","type":"noun","meaning_category":"host"},{"sentence":"Fue un **anfitrione** excepcional, siempre atento a las necesidades de sus invitados.","translation":"He was an exceptional host, always attentive to the needs of his guests.","type":"noun","meaning_category":"generous host"},{"sentence":"Como buen **anfitrione**, se encargó de que todos se sintieran cómodos.","translation":"As a good host, he made sure everyone felt comfortable.","type":"noun","meaning_category":"good host"}]}