{"word":"clingseed","priority":"low","meanings":[{"part_of_speech":"noun","definition":"A seed that clings to fur, clothing, etc., for dispersal; a bur.","english_definition":"A seed or fruit adapted to cling to fur, feathers, or clothing for dispersal, often having hooks or barbs; a bur.","examples":[{"sentence":"The dog was covered in clingseeds after running through the field.","translation":"犬は野原を走り回った後、ひっつき虫だらけになった。"},{"sentence":"Clingseeds are an effective method of seed dispersal for many plants.","translation":"ひっつき虫は多くの植物にとって効果的な種子散布方法である。"}],"collocations":["covered in clingseeds","clingseed dispersal","remove clingseeds"],"synonyms":["bur","sticktight","hitchhiker seed","beggarticks"],"antonyms":[]}],"etymology":{"value":"Formed from 'cling' (to adhere strongly) and 'seed' (a plant's unit of reproduction).","priority":"medium"},"pronunciation":{"ipa":"/ˈklɪŋsiːd/","syllables":"cling-seed"},"inflection":{"noun_plural":"clingseeds"},"usage_notes":{"explanation":"'Clingseed' is a descriptive term for seeds that have adaptations to attach to animals or clothing for dispersal. It is often used interchangeably with 'bur', although 'bur' can also refer to the seed-containing structure itself.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The plant produces clingseeds to attract insects.","correct":"The plant produces clingseeds for dispersal by animals.","note":"Clingseeds are for dispersal, not for attracting insects."}],"priority":"low"},"related_words":{"derivatives":["clingy (adjective: tending to cling)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"NA","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Clingseed' refers to a seed that sticks to things like fur or clothing. Think of plants that have seeds with little hooks or barbs. These seeds are designed to 'cling' so they can be carried to new places by animals or people. It's a relatively uncommon word, but useful for describing this specific method of seed dispersal."},"example_sentences":[{"sentence":"After our hike, we had to pick off dozens of clingseeds from our socks.","translation":"ハイキングの後、私たちは靴下から何十個ものひっつき虫を取り除かなければならなかった。","type":"noun","meaning_category":"seed"},{"sentence":"The plant relies on clingseeds to spread its seeds far and wide.","translation":"その植物は、種子を広範囲に広げるためにひっつき虫に頼っている。","type":"noun","meaning_category":"seed"}]}