{"word":"close-reefed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a sailing vessel) with sails reduced to the smallest possible area by reefing.","english_definition":"(of a sailing vessel) having the sails reduced to the smallest possible area by reefing, typically in response to strong winds.","examples":[{"sentence":"The close-reefed schooner battled against the gale.","translation":"縮帆されたスクーナーは、暴風と戦った。"},{"sentence":"We sailed close-reefed for three days straight.","translation":"私たちは3日間続けて縮帆航行をした。"}],"collocations":["sail close-reefed","close-reefed mainsail","close-reefed jib"],"synonyms":["reefed","shortened sail","reduced sail"],"antonyms":["full sail","unreefed"],"notes":"This term is specific to sailing and nautical contexts."}],"etymology":{"value":"The term 'close-reefed' comes from the nautical practice of 'reefing' sails, which means reducing their area. 'Close' in this context implies that the sails are reefed to the maximum extent possible.","priority":"N/A"},"pronunciation":{"ipa":"/ˌkloʊsˈriːft/","syllables":"close-reefed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Close-reefed' describes a sailing vessel operating with its sails reduced to the smallest size manageable. This is done to maintain control and prevent damage in strong winds. It's a common term in sailing literature and discussions.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["reef (noun, verb)","reefing (noun)"],"related_terms":["heaving to","running before the wind"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency, specific to nautical contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'close-reefed' is highly specialized and primarily used in the context of sailing. It describes a sailing vessel that has reduced its sail area to the minimum possible, usually due to strong winds. Understanding this term requires familiarity with sailing terminology and practices. It is unlikely to be encountered outside of nautical contexts or literature related to sailing."},"example_sentences":[{"sentence":"The small boat, close-reefed and battling the waves, looked incredibly vulnerable.","translation":"小さく縮帆され、波と戦う小さなボートは、信じられないほど脆弱に見えた。","type":"general","meaning_category":"description of a sailing vessel"},{"sentence":"Experienced sailors know when it's time to sail close-reefed to avoid capsizing.","translation":"経験豊富な船乗りは、転覆を避けるためにいつ縮帆航行すべきかを知っている。","type":"general","meaning_category":"sailing practice"}]}