{"word":"ungastric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not gastric; not related to the stomach.","english_definition":"Not related to the stomach.","examples":[{"sentence":"The patient had ungastric symptoms, indicating the problem was not in their stomach.","translation":"患者は非胃腸の症状を示しており、問題は胃にないことを示唆していた。"},{"sentence":"We need to rule out any ungastric causes before focusing on the stomach.","translation":"胃に焦点を当てる前に、非胃腸の原因を除外する必要があります。"}],"collocations":["ungastric symptoms","ungastric pain","ungastric causes"],"synonyms":["non-gastric","extra-gastric"],"antonyms":["gastric"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and 'gastric' (relating to the stomach).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈɡæstrɪk/","syllables":"un-gas-tric"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'ungastric'."},"usage_notes":{"explanation":"'Ungastric' is a relatively rare term used in medical or scientific contexts to specify that something is not related to the stomach. It is often used to differentiate between symptoms or conditions that might seem related to the stomach but are actually caused by other factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient's gastric problems were actually ungastric.","correct":"✓ The patient's symptoms, initially thought to be gastric, were actually ungastric in origin.","note":"This highlights that although the symptoms might appear to be gastric, their origin lies elsewhere."}],"priority":"★★☆"},"related_words":{"derivatives":["gastric","gastritis","gastrointestinal"],"related_terms":["abdominal","intestinal","esophageal"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ungastric' is a specialized term primarily used in medical contexts. It signifies that something is not related to the stomach. Due to its limited usage and technical nature, it is more commonly encountered in scientific literature or medical discussions."},"example_sentences":[{"sentence":"The doctors suspected an ungastric source of the abdominal pain.","translation":"医師たちは腹痛の胃以外の原因を疑った。","type":"general","meaning_category":"Not related to the stomach"},{"sentence":"Ungastric factors can sometimes mimic the symptoms of stomach disorders.","translation":"胃以外の要因が、時には胃の病気の症状を模倣することがある。","type":"medical","meaning_category":"Not related to the stomach"}]}