{"word":"parasitotropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"寄生性栄養の、寄生栄養性の","english_definition":"Obtaining nourishment as a parasite; exhibiting parasitotrophy.","examples":[{"sentence":"Parasitotropic organisms obtain nutrients from a host organism.","translation":"寄生性栄養生物は宿主生物から栄養を得る。"},{"sentence":"Some fungi are parasitotropic, deriving their energy from living plants or animals.","translation":"一部の菌類は寄生性栄養であり、生きている植物や動物からエネルギーを得る。"}],"collocations":["parasitotropic nutrition","parasitotropic fungi","parasitotropic bacteria"],"synonyms":["parasitic","heterotrophic","saprophytic (sometimes, depending on the source of nutrients)"],"antonyms":["autotrophic","phototrophic"]}],"etymology":{"value":"From 'parasite' + '-o-' (linking vowel) + '-tropic' (from Greek 'tropos' meaning 'turning, direction, manner'). Essentially, 'turning towards' or 'feeding on' a parasite.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌsaɪtəˈtrɒpɪk/","syllables":"par-a-si-to-trop-ic"},"inflection":{"notes":"Adjective; no specific inflections beyond comparative/superlative (more parasitotropic, most parasitotropic), though these are rarely used."},"usage_notes":{"explanation":"'Parasitotropic' describes organisms or processes that derive nutrition by parasitism. It's a relatively specialized term used in biology and related fields. It distinguishes a specific mode of heterotrophic nutrition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is parasitotropic because it grows tall.","correct":"✓ The plant is parasitotropic because it derives nutrients from another plant.","note":"Parasitotrophy refers to the method of obtaining nutrients, not simply the growth habit. It must involve deriving nutrients from another organism."}],"priority":"★☆☆"},"related_words":{"derivatives":["parasitotrophy (noun: the state of being parasitotropic)"],"related_terms":["parasite","trophic","heterotrophic","saprotrophic","autotrophic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'parasitotropic' is a technical term used in biology to describe organisms that obtain nutrients by living as parasites on other organisms. Understanding the word requires knowledge of the concepts of parasitism and heterotrophic nutrition. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The dodder plant is a classic example of a parasitotropic angiosperm.","translation":"ネナシカズラは寄生性栄養の被子植物の典型的な例である。","type":"general","meaning_category":"general"},{"sentence":"Some bacteria exhibit parasitotropic behavior, targeting specific host cells for nutrient acquisition.","translation":"一部の細菌は寄生性栄養行動を示し、栄養獲得のために特定の宿主細胞を標的とする。","type":"biology","meaning_category":"biology"}]}