{"word":"Un-platonically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"プラトニックではない方法で、恋愛感情や性的な意図を持って","english_definition":"In a manner that is not platonic; with romantic or sexual intentions.","examples":[{"sentence":"They were un-platonically involved, blurring the lines of friendship.","translation":"彼らはプラトニックではない関係にあり、友情の境界線を曖昧にしていた。"},{"sentence":"She looked at him un-platonically, her eyes conveying a deeper affection.","translation":"彼女は彼をプラトニックではない目で見て、その目はより深い愛情を伝えていた。"}],"collocations":["relate un-platonically","feel un-platonically","act un-platonically","think un-platonically"],"synonyms":["romantically","sexually","passionately","amorously"],"antonyms":["platonically"]}],"etymology":{"value":"「Un-」(否定の接頭辞) + 「platonically」(プラトニックに)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌn.pləˈtɒn.ɪ.kəl.i/","syllables":"Un-pla-ton-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Un-platonically\" is used to describe actions, feelings, or relationships that go beyond a purely friendly and non-sexual connection. It implies a romantic or sexual element is present. It is the opposite of \"platonically,\" which describes a relationship based on friendship and intellectual connection without romantic or sexual feelings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They are un-platonically friends.","correct":"✓ They are more than just friends. / ✓ Their relationship is un-platonic.","note":"\"Un-platonically\" is an adverb, so it modifies verbs, adjectives, or other adverbs, not nouns. Use a phrase like \"more than just friends\" or the adjective \"un-platonic\" to describe the relationship itself."}],"priority":"★★☆"},"related_words":{"derivatives":["unplatonic (adjective)"],"phrasal_verbs":[],"related_concepts":["platonic love","romantic love","sexual attraction","friendship","relationship"]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Un-platonically\" is an advanced term used to describe a relationship or interaction that is not purely friendly and lacks any romantic or sexual feelings. It implies that there are romantic or sexual undertones or intentions present. The word is formed by adding the prefix \"un-\" (meaning \"not\") to \"platonically,\" which itself refers to a relationship based on platonic love (i.e., love that is non-sexual and purely based on friendship and intellectual connection). This word is relatively rare and is typically used in discussions about relationships and interpersonal dynamics where the distinction between friendship and romantic or sexual interest is relevant."},"example_sentences":[{"sentence":"She smiled at him un-platonically, hinting at her romantic feelings.","translation":"彼女は彼にプラトニックではない笑みを浮かべ、彼女の恋愛感情をほのめかした。","type":"adverb","meaning_category":"romantic intention"},{"sentence":"Their interactions had become increasingly un-platonic, leading to awkwardness within their friend group.","translation":"彼らの交流はますますプラトニックではなくなり、友人グループ内で気まずさにつながった。","type":"adverb","meaning_category":"sexual intention"}]}