{"word":"Aguadilla","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アグアディヤ：プエルトリコの都市、および自治体。","english_definition":"A city and municipality in Puerto Rico, located in the northwestern tip of the island, bordering the Atlantic Ocean.","examples":[{"sentence":"Aguadilla is known for its beautiful beaches and surfing spots.","translation":"アグアディヤはその美しいビーチとサーフィンスポットで知られています。"},{"sentence":"Rafael Hernández Airport is located in Aguadilla.","translation":"ラファエル・エルナンデス空港はアグアディヤに位置しています。"}],"collocations":["Aguadilla beaches","Aguadilla airport","Visit Aguadilla"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Aguadilla' is derived from the Spanish word 'aguada,' meaning 'watering place' or 'source of water.' This refers to the area's historical importance as a source of fresh water for ships.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːɡwɑːˈdiːjɑː/","syllables":"A-gua-di-lla"},"inflection":{},"usage_notes":{"explanation":"Aguadilla is primarily used as a proper noun to refer to the city and municipality in Puerto Rico. It is often used in geographical contexts, travel guides, and news reports related to the region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to the Aguadilla.","correct":"✓ I am going to Aguadilla.","note":"Aguadilla is a proper noun and does not require the article 'the' unless referring to a specific feature like 'the beaches of Aguadilla.'"}],"priority":"★★☆"},"related_words":{"derivatives":["Aguadillan (adjective/noun: relating to Aguadilla)"],"phrases":["Ramey Air Force Base (historical significance in Aguadilla)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specific geographical or travel-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aguadilla' is a proper noun referring to a specific location, the city and municipality in Puerto Rico. Its usage is generally limited to contexts involving Puerto Rican geography, travel, or local news. Understanding its meaning requires familiarity with Puerto Rico's regions.","requires_context":true},"example_sentences":[{"sentence":"We spent our vacation in Aguadilla, enjoying the beaches and local culture.","translation":"私たちはアグアディヤで休暇を過ごし、ビーチと地元の文化を楽しみました。","type":"noun","meaning_category":"Location"},{"sentence":"The flight to Aguadilla was delayed due to bad weather.","translation":"悪天候のため、アグアディヤ行きの便が遅延しました。","type":"noun","meaning_category":"Travel"},{"sentence":"Aguadilla is a popular destination for surfers.","translation":"アグアディヤはサーファーに人気の目的地です。","type":"noun","meaning_category":"Tourism"}]}