{"word":"refined-legged","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having legs that are slender, elegant, and well-shaped; suggesting grace and sophistication.","english_definition":"Possessing legs that are slender, elegant, and well-shaped, often implying grace and sophistication.","examples":[{"sentence":"The dancer had refined-legged movements that captivated the audience.","translation":"そのダンサーは、観客を魅了する洗練された脚の動きをしていた。"},{"sentence":"The refined-legged horse pranced gracefully around the arena.","translation":"その洗練された脚の馬は、競技場を優雅に跳ね回った。"}],"collocations":["refined-legged dancer","refined-legged horse","refined-legged movements"],"synonyms":["slender-legged","elegant-legged","graceful-legged","shapely-legged"],"antonyms":["clumsy-legged","thick-legged","ungainly-legged"]}],"etymology":{"value":"Combination of 'refined' (meaning elegant, cultured, or improved) and 'legged' (having legs). The term suggests that the legs in question possess qualities of elegance and sophistication.","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈfaɪnd ˈlɛɡɪd/","syllables":"re-fined-leg-ged"},"inflection":{},"usage_notes":{"explanation":"The term 'refined-legged' is descriptive and often used in contexts where physical appearance and grace are emphasized, such as describing dancers, horses, or other figures where the legs contribute significantly to overall elegance. It is not a commonly used term, but its meaning is readily understood due to the combination of familiar words.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["refined","legged"],"related_terms":["well-formed","elegant","graceful"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'refined-legged' is a compound adjective that combines the concepts of refinement and leg structure. It is not a common term and would likely be encountered in descriptive or literary contexts where precise and evocative language is used. Understanding the term requires a good vocabulary and the ability to interpret nuanced descriptions."},"example_sentences":[{"sentence":"The artist painted a portrait of a refined-legged woman in a flowing gown.","translation":"その芸術家は、流れるようなガウンを着た、洗練された脚の女性の肖像画を描いた。","type":"adjective","meaning_category":"elegant appearance"},{"sentence":"The refined-legged foal wobbled slightly as it took its first steps.","translation":"その洗練された脚の子馬は、最初の一歩を踏み出すとき、わずかにぐらついた。","type":"adjective","meaning_category":"graceful structure"}]}