{"word":"unfashionably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"時代遅れに、流行遅れに、ファッションセンスがないやり方で","english_definition":"in a way that is not fashionable or in keeping with current trends; in a manner lacking style or sophistication.","examples":[{"sentence":"She was unfashionably dressed in a long, outdated skirt.","translation":"彼女は時代遅れの長いスカートを着ていて、ファッションセンスがない格好だった。"},{"sentence":"The restaurant was unfashionably decorated, with heavy curtains and old-fashioned furniture.","translation":"そのレストランは、重いカーテンと古風な家具で、時代遅れな内装だった。"},{"sentence":"He arrived unfashionably late to the party.","translation":"彼はパーティーに流行遅れなほど遅れて到着した。"}],"collocations":["unfashionably dressed","unfashionably decorated","unfashionably late"],"synonyms":["outmodedly","antiquatedly","datedly","old-fashionedly","tackily","gaudily","unsophisticatedly"],"antonyms":["fashionably","stylishly","trendily","chicly","sophisticatedly"]}],"etymology":{"value":"\"Un-\" (否定の接頭辞) + \"fashionably\" (「流行に沿って」)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfæʃənəbli/","syllables":"un-fash-ion-a-bly"},"inflection":{"notes":"Adverb; no inflection"},"usage_notes":{"explanation":"\"Unfashionably\" describes actions or appearances that do not conform to current trends or styles. It implies a lack of awareness or concern for what is considered fashionable. It can also describe something that is so far behind current trends as to be considered humorous or awkward.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She dressed unfashionable.","correct":"She dressed unfashionably.","note":"\"Unfashionable\" is an adjective; the adverb form \"unfashionably\" is needed to modify the verb \"dressed\"."}],"priority":"★★☆"},"related_words":{"derivatives":["unfashionable (adjective)","fashionably (adverb)","fashion (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unfashionably\" is used to describe something done in a way that does not follow current trends or styles. It is the adverb form of the adjective \"unfashionable.\" It suggests a lack of awareness or interest in what is currently popular or stylish. The word is not commonly used in everyday conversation, but it appears in written texts to describe a specific aesthetic or behavior that deviates from the norm."},"example_sentences":[{"sentence":"The store's window display was unfashionably cluttered and disorganized.","translation":"その店のウィンドウディスプレイは時代遅れで、ごちゃごちゃしていて整理されていなかった。","type":"descriptive","meaning_category":"style"},{"sentence":"He unfashionably wore a fedora and a tweed suit to the club.","translation":"彼はクラブに時代遅れなフェドラ帽とツイードのスーツを着ていた。","type":"descriptive","meaning_category":"clothing"},{"sentence":"The website was unfashionably designed with outdated graphics and fonts.","translation":"そのウェブサイトは時代遅れのグラフィックとフォントで、流行遅れなデザインだった。","type":"descriptive","meaning_category":"design"}]}