{"word":"campoody","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A state of being relaxed, comfortable, and content, often associated with being in a pleasant or enjoyable environment.","english_definition":"(slang, humorous) A state of being relaxed, comfortable, and content, often associated with being in a pleasant or enjoyable environment.","examples":[{"sentence":"After a long day at work, I just want to be in my campoody.","translation":"仕事で一日中働いた後、ただリラックスして快適な状態になりたい。","note":"This usage implies a desire for a state of relaxation and comfort."},{"sentence":"This weekend, I'm planning a full campoody with books, blankets, and no responsibilities.","translation":"今週末は、本、毛布、責任のない、完全なリラックス状態を計画しています。","note":"This sentence describes a planned state of relaxation and enjoyment."}],"collocations":["in my campoody","full campoody","campoody mode"],"synonyms":["relaxation","comfort","contentment","chill","cozy"],"antonyms":["stress","anxiety","discomfort","unease"]}],"etymology":{"value":"Likely a playful or invented word, possibly combining \"camp\" (referring to a comfortable or temporary living space) and \"moody\" (referring to a state of mind or feeling). The exact origin is unclear, but it appears to be a relatively recent slang term.","priority":"Low"},"pronunciation":{"ipa":"/kæmˈpuːdi/","syllables":"cam-poo-dy"},"inflection":{"noun_plural":"campoodies"},"usage_notes":{"explanation":"\"Campoody\" is a slang term, often used humorously, to describe a state of relaxation, comfort, and contentment. It suggests a feeling of being at ease and enjoying one's surroundings. The word is not widely recognized and is more likely to be used in informal settings or among close friends.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"I'm feeling very campoody today.","correct":"I'm in my campoody today."}],"note":"The word is typically used as a noun referring to a state of being, rather than an adjective describing a feeling. Therefore, it's more common to say \"I'm in my campoody\" than \"I'm feeling campoody.\"","priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["chill","cozy","relaxed","comfortable","content"]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Very low frequency, likely a recent slang term with limited usage.","priority":"Low"},"readability_explanation":{"level":"Informal/Slang","text":"\"Campoody\" is a slang word that means feeling relaxed and comfortable, like you're in a cozy and pleasant environment. It's not a formal word and is usually used in a fun or joking way. Think of it as being in a state where you have no worries and can just enjoy yourself."},"example_sentences":[{"sentence":"I'm finally in my campoody after a stressful week.","translation":"ストレスの多い一週間の後、ついにリラックスして快適な状態になった。","type":"noun","meaning_category":"Relaxation and comfort"},{"sentence":"Let's create a campoody atmosphere with soft music and candles.","translation":"ソフトな音楽とキャンドルで、リラックスできる雰囲気を作りましょう。","type":"noun","meaning_category":"Creating a relaxing environment"}]}