{"word":"Moating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(城などを)堀で囲む、堀を設ける","english_definition":"To surround (a castle or other place) with a moat.","examples":[{"sentence":"The castle was moated to protect it from invaders.","translation":"その城は侵略者から守るために堀で囲まれていた。"},{"sentence":"They decided to moat the property for added security.","translation":"彼らはセキュリティを強化するためにその土地を堀で囲むことにした。"}],"collocations":["moat a castle","moat a property"],"synonyms":["ditch","entrench","fortify"],"antonyms":["unfortify","expose"]},{"part_of_speech":"verb","definition":"(比喩的に)孤立させる、隔離する","english_definition":"To isolate or separate (something or someone) as if by a moat.","examples":[{"sentence":"The company's high prices effectively moated it from the competition.","translation":"その会社の高い価格設定は、事実上、競争から会社を隔離した。"},{"sentence":"He felt moated off from the rest of the group due to his shyness.","translation":"彼は内気さのせいで、グループの他のメンバーから孤立しているように感じた。"}],"collocations":["moat a company","moat oneself"],"synonyms":["isolate","segregate","separate","insulate"],"antonyms":["integrate","connect","include"]}],"etymology":{"value":"Derived from 'moat,' which comes from the Old French 'mote' meaning 'mound' or 'earthwork,' referring to the artificial ditch filled with water around a castle or fortification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊtɪŋ/","syllables":"moat-ing"},"inflection":{"verb_forms":{"present_participle":"moating","past_simple":"moated","past_participle":"moated","present_simple":["moat","moats"]}},"usage_notes":{"explanation":"'Moating' is primarily used in two contexts: literally surrounding a structure with a moat for defense, and figuratively isolating something to protect it from external forces. The figurative use is common in business and economics, referring to creating barriers to entry for competitors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The king was moating by his guards.","correct":"✓ The king was protected by his guards.","note":"'Moating' refers to the act of creating or being surrounded by a moat, not simply being protected."},{"incorrect":"✗ The island is moating from the mainland.","correct":"✓ The island is separated from the mainland.","note":"'Moating' implies an intentional act of isolation, not a natural separation."}],"priority":"★★☆"},"related_words":{"derivatives":["moat (noun)","moated (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moating' is a relatively uncommon word, primarily used in historical or strategic contexts. It refers to the act of surrounding something with a moat, either literally for defensive purposes or figuratively to create a barrier against competition or outside influence. Understanding the context is essential to correctly interpret its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The medieval city was carefully moated to deter invaders.","translation":"中世の都市は侵略者を阻止するために注意深く堀で囲まれていた。","type":"verb","meaning_category":"Surrounding with a moat"},{"sentence":"The company's strong brand recognition effectively moats it against new competitors.","translation":"その会社の強力なブランド認知度は、新規参入企業に対して効果的に障壁を設けている。","type":"verb","meaning_category":"Figurative isolation"},{"sentence":"Moating the castle took several years and a considerable amount of labor.","translation":"その城を堀で囲むには数年とかなりの労働力が必要だった。","type":"verb","meaning_category":"Surrounding with a moat"},{"sentence":"He felt like he was moating himself off from the world by staying indoors all day.","translation":"彼は一日中屋内にいることで、世界から自分自身を隔離しているように感じた。","type":"verb","meaning_category":"Figurative isolation"}]}