{"word":"pragmatica","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"語用論（言語学の一分野）","english_definition":"The branch of linguistics dealing with language in use and the contexts in which it is used, including such matters as deixis, taking turns in conversation, implicature, and speech acts.","examples":[{"sentence":"Pragmatica è lo studio di come il contesto influenza l'interpretazione del significato.","translation":"Pragmatics is the study of how context influences the interpretation of meaning."}],"collocations":["analisi pragmatica (pragmatic analysis)","competenza pragmatica (pragmatic competence)"],"synonyms":["linguistica pragmatica"],"antonyms":[]}],"etymology":{"value":"Dal greco πραγματικός (pragmatikós) 'adatto all'azione, pratico', derivato di πρᾶγμα (prâgma) 'azione, affare'.","priority":"★★★"},"pronunciation":{"ipa":"/praɡˈmatika/","syllables":"pra-gma-ti-ca"},"inflection":{"notes":"Singular noun, feminine in languages that have grammatical gender."},"usage_notes":{"explanation":"Pragmatica studies how context contributes to meaning. It differs from semantics, which focuses on literal meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Semantica e pragmatica sono la stessa cosa.","correct":"Semantica e pragmatica sono due discipline linguistiche distinte.","note":"Semantics and pragmatics are distinct linguistic disciplines."}],"priority":"★★★"},"related_words":{"derivatives":["pragmatico (pragmatic)","pragmatismo (pragmatism)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pragmatica' refers to the study of how context affects the meaning of language. It's a term used in linguistics and philosophy of language.","priority":"★★★"},"example_sentences":[{"sentence":"La pragmatica si occupa di come interpretiamo le intenzioni comunicative degli altri.","translation":"Pragmatics deals with how we interpret the communicative intentions of others.","type":"definition","meaning_category":"definition"},{"sentence":"Un'analisi pragmatica del discorso rivela le dinamiche di potere tra i partecipanti.","translation":"A pragmatic analysis of discourse reveals the power dynamics between the participants.","type":"example","meaning_category":"example"}]}