{"word":"monkeyism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"猿真似、模倣、追従","english_definition":"The act or practice of imitating or mimicking, often without understanding; slavish imitation.","examples":[{"sentence":"His art was criticized as mere monkeyism, lacking originality.","translation":"彼の芸術は独創性がなく、単なる猿真似だと批判された。"},{"sentence":"The company's strategy was seen as monkeyism, simply copying their competitor's moves.","translation":"その会社の戦略は、競合他社の動きをただ真似るだけの猿真似だと見なされた。"}],"collocations":["mere monkeyism (単なる猿真似)","blind monkeyism (盲目的な猿真似)","cultural monkeyism (文化的な猿真似)"],"synonyms":["mimicry","imitation","aping","copying","parroting","emulation (sometimes, depending on context)"],"antonyms":["originality","innovation","creativity","invention"]},{"part_of_speech":"noun","definition":"(進化論における) 猿人段階説","english_definition":"(dated, often derogatory) The belief or theory that humans evolved directly from monkeys, often used in a dismissive or critical way towards evolutionary theory.","examples":[{"sentence":"The preacher denounced Darwin's theory as 'monkeyism'.","translation":"牧師はダーウィンの理論を「猿人段階説」として非難した。"},{"sentence":"The debate centered around the validity of evolutionary theory versus claims of 'monkeyism'.","translation":"議論は進化論の妥当性と「猿人段階説」の主張の正当性を中心に行われた。"}],"collocations":["Darwinian monkeyism (ダーウィンの猿人段階説)","evolutionary monkeyism (進化論的猿人段階説)"],"synonyms":["anthropomorphism (related concept, but different)"],"antonyms":[]}],"etymology":{"value":"\"Monkey\" + \"-ism\". The term likely arose from criticisms of evolutionary theory, particularly the idea that humans directly descended from monkeys, a simplification of Darwin's theory of evolution by natural selection. The broader sense of 'slavish imitation' likely developed from the perceived lack of intelligence or originality in monkeys' behavior.","priority":"★★★"},"pronunciation":{"ipa":"ˈmʌŋkiˌɪzəm","syllables":"mon-key-ism"},"inflection":{"noun_plural":"monkeyisms"},"usage_notes":{"explanation":"The term \"monkeyism\" has two primary meanings, one related to imitation and the other to a dated and often derogatory view of evolutionary theory. The \"imitation\" sense is more common today. When referring to evolution, the term is often used to ridicule or oversimplify the theory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The monkeyism of the design made it unique.","correct":"✓ The monkeyism of the design made it unoriginal.","note":"Monkeyism implies a lack of originality, so it cannot make something unique."}],"priority":"★★☆"},"related_words":{"derivatives":["monkey (noun)","-ism (suffix indicating a belief, practice, or characteristic)"],"phrases":["ape (verb, to imitate)","mimic (verb, to imitate)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare, specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"monkeyism\" is not commonly used. It refers to the act of imitating someone or something without understanding or originality. It can also refer to an outdated and often derogatory view of evolution, suggesting humans evolved directly from monkeys. The first meaning is more common in contemporary usage.","priority":"★★★"},"example_sentences":[{"sentence":"The new architectural style was dismissed as mere **monkeyism** of classical designs.","translation":"その新しい建築様式は、古典的なデザインの単なる猿真似だと一蹴された。","type":"noun","meaning_category":"Imitation"},{"sentence":"Critics accused the politician of **monkeyism**, simply echoing the views of his party leader.","translation":"批評家たちは、その政治家が党首の意見をただ繰り返すだけの猿真似だと非難した。","type":"noun","meaning_category":"Imitation"},{"sentence":"The old textbook presented a simplistic view of evolution, bordering on **monkeyism**.","translation":"その古い教科書は、進化論を単純化しすぎて、猿人段階説に近いものだった。","type":"noun","meaning_category":"Evolution (dated)"}]}