{"word":"Contrapositives","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(論理学)対偶","english_definition":"(logic) A proposition formed by negating both the subject and predicate of a given proposition and interchanging them.","examples":[{"sentence":"The contrapositive of 'If it is raining, then the ground is wet' is 'If the ground is not wet, then it is not raining.'","translation":"「もし雨が降っているなら、地面は濡れている」の対偶は「もし地面が濡れていないなら、雨は降っていない」です。"}],"collocations":["form the contrapositive","logical contrapositive"],"synonyms":["inverse","converse","implication"],"antonyms":[]}],"etymology":{"value":"'Contra-' (against) + 'positive' (asserting something). The term reflects the operation of reversing and negating a statement.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒntrəˈpɒzɪtɪvz/","syllables":"con-tra-po-si-tives"},"inflection":{"noun_plural":"contrapositives"},"usage_notes":{"explanation":"In logic, the contrapositive of a conditional statement 'If P, then Q' is 'If not Q, then not P.' The contrapositive is logically equivalent to the original statement; if the original statement is true, the contrapositive is also true, and vice versa. This is a fundamental concept in mathematical proofs and logical reasoning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contrapositive is the same as the converse.","correct":"✓ The contrapositive is not the same as the converse.","note":"The converse of 'If P, then Q' is 'If Q, then P,' which is different from the contrapositive. The contrapositive also involves negation."}],"priority":"★★☆"},"related_words":{"derivatives":["contrapositive (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contrapositives' refers to a concept in logic. It's related to conditional statements (if-then statements). The contrapositive is formed by reversing and negating the original statement. Understanding contrapositives is important for logical reasoning and proofs.","priority":"★★☆"},"example_sentences":[{"sentence":"Understanding contrapositives is crucial for constructing valid arguments.","translation":"対偶を理解することは、妥当な議論を構築するために非常に重要です。","type":"general","meaning_category":"logic"},{"sentence":"The contrapositive of a true statement is always true.","translation":"真である命題の対偶は常に真である。","type":"general","meaning_category":"logic"}]}