{"word":"writing-light","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A small, portable light used to illuminate written material, especially in low-light conditions.","english_definition":"A small, portable light designed to illuminate written material for reading or writing in dimly lit environments.","examples":[{"sentence":"She used a writing-light to read in bed without disturbing her husband.","translation":"彼女は夫の邪魔をせずにベッドで読書するために、ライティングライトを使った。"},{"sentence":"The student clipped a writing-light onto his textbook to study on the bus.","translation":"学生はバスの中で勉強するために、教科書にライティングライトをクリップで留めた。"}],"collocations":["portable writing-light","LED writing-light","clip-on writing-light","adjustable writing-light","battery-powered writing-light"],"synonyms":["book light","reading light","portable lamp"],"antonyms":["N/A"]}],"etymology":{"value":"Combination of \"writing\" (referring to written material) and \"light\" (referring to illumination).","priority":"N/A"},"pronunciation":{"ipa":"/ˈraɪtɪŋˌlaɪt/","syllables":"wri-ting-light"},"inflection":{"noun_plural":"writing-lights"},"usage_notes":{"explanation":"The term \"writing-light\" is generally used to describe a small, focused light source specifically designed for illuminating books, documents, or other written materials. These lights are often portable and feature adjustable brightness or positioning. They are commonly used in situations where ambient lighting is insufficient or when one wants to avoid disturbing others with a brighter light source.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a writing light for my computer.","correct":"✓ I need a desk lamp for my computer.","note":"A \"writing-light\" is specifically for illuminating written material, not a computer screen. A desk lamp is more appropriate for general computer use."}],"priority":"N/A"},"related_words":{"derivatives":["N/A"],"related_terms":["book light","reading lamp","desk lamp","task light"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'writing-light' refers to a small, portable light specifically designed to illuminate written material, such as books or documents. It is used in situations where the ambient light is low, allowing the user to read or write without straining their eyes or disturbing others. These lights are often adjustable and can be clipped onto books or positioned on desks. While not a very common term, it is easily understood in context."},"example_sentences":[{"sentence":"The traveler used a small writing-light to read his book on the overnight train.","translation":"旅行者は夜行列車の中で本を読むために、小型のライティングライトを使った。","type":"noun","meaning_category":"illumination"},{"sentence":"She attached a clip-on writing-light to her notebook to take notes during the lecture.","translation":"彼女は講義中にノートを取るために、クリップ式のライティングライトをノートに付けた。","type":"noun","meaning_category":"illumination"}]}