{"word":"withdrawingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"引っ込み思案に、内気そうに、引きこもるように","english_definition":"in a manner that shows a tendency to avoid contact or interaction with others; in a shy or reserved way; in a way that suggests a desire to retreat or isolate oneself.","examples":[{"sentence":"She smiled withdrawingly, not wanting to engage in conversation.","translation":"彼女は会話に加わりたくなかったので、控えめに微笑んだ。"},{"sentence":"He behaved withdrawingly at the party, staying in a corner by himself.","translation":"彼はパーティーで引っ込み思案に振る舞い、一人で隅にいた。"},{"sentence":"The child looked at the stranger withdrawingly, clutching his mother's hand.","translation":"その子は見知らぬ人を内気そうに見つめ、母親の手を握りしめた。"}],"collocations":["act withdrawingly","behave withdrawingly","look withdrawingly","smile withdrawingly"],"synonyms":["shyly","reservedly","timidly","retiringly","aloofly","distantly","secretively","quietly","uncommunicatively"],"antonyms":["outgoingly","sociably","extrovertedly","openly","communicatively","gregariously","affably","warmly","friendly"],"related_words":["withdraw (verb)","withdrawing (adjective)","withdrawal (noun)"]}],"etymology":{"value":"Derived from the adjective 'withdrawing,' which comes from the verb 'withdraw' (to pull back, retreat). The '-ly' suffix transforms it into an adverb, indicating the manner in which something is done.","priority":"★☆☆"},"pronunciation":{"ipa":"/wɪðˈdrɔːɪŋli/","syllables":"with-draw-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect; however, this word is formed by adding '-ly' to the adjective 'withdrawing'."},"usage_notes":{"explanation":"'Withdrawingly' describes the manner in which someone behaves when they are trying to avoid social interaction or are feeling shy or reserved. It implies a deliberate or instinctive pulling back from others. This adverb is not as common as its related adjective 'withdrawing,' but it provides a more direct way to describe the act of retreating or behaving in a shy manner.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"He withdrawingly took the money.","correct":"He took the money reluctantly.","note":"'Withdrawingly' describes a general demeanor or way of behaving, not a specific action like taking money. 'Reluctantly' is more appropriate in this context."},{"incorrect":"She spoke withdrawingly about her feelings.","correct":"She spoke hesitantly about her feelings.","note":"'Withdrawingly' describes a manner of avoiding interaction. 'Hesitantly' is more appropriate to describe difficulty in expressing feelings."}],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Withdrawingly' is an adverb that describes how someone behaves when they are shy, reserved, or trying to avoid social interaction. It is formed from the verb 'withdraw' and the suffix '-ly.' Because it is not a common word, it is more likely to be encountered in advanced texts or when describing nuanced behavior. It suggests a deliberate or instinctive pulling back from others, both physically and emotionally."},"example_sentences":[{"sentence":"Seeing the crowd, he stepped back withdrawingly.","translation":"群衆を見て、彼は内気そうに後ずさりした。","type":"adverb","meaning_category":"manner of behavior"},{"sentence":"She answered the question withdrawingly, avoiding eye contact.","translation":"彼女は目を合わせるのを避けながら、引っ込み思案に質問に答えた。","type":"adverb","meaning_category":"manner of communication"},{"sentence":"The animal moved withdrawingly into the shadows.","translation":"その動物は物陰に引きこもるように移動した。","type":"adverb","meaning_category":"manner of movement"}]}