{"word":"salt-added","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"塩が添加された、塩分が加えられた","english_definition":"having salt added; containing added salt.","examples":[{"sentence":"This product is salt-added, so be mindful of your sodium intake.","translation":"この製品は塩が添加されているので、ナトリウムの摂取量に注意してください。"},{"sentence":"I prefer the unsalted version of these chips because the salt-added ones are too salty.","translation":"私はこれらのチップスの無塩版の方が好きです。塩が添加されたものは塩辛すぎるからです。"}],"collocations":["salt-added butter","salt-added snacks","salt-added processed foods"],"synonyms":["salted","seasoned with salt"],"antonyms":["unsalted","no salt added","salt-free"]},{"part_of_speech":"noun","definition":"塩添加物","english_definition":"a substance that has had salt added to it.","examples":[{"sentence":"The label clearly states whether the product is a salt-added or salt-free item.","translation":"ラベルには、製品が塩添加物であるか無塩製品であるかが明確に記載されています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is a compound adjective formed by combining 'salt' (referring to sodium chloride) and 'added' (indicating that it has been included as an extra ingredient).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɔlt ˌædɪd/","syllables":"salt-ad-ded"},"inflection":{"notes":"This is a compound adjective, so it does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Salt-added' is typically used in the context of food products to indicate that salt (sodium chloride) has been intentionally added during the manufacturing or preparation process. This is important information for individuals monitoring their sodium intake for health reasons. It is often found on food labels.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a salt added product.","correct":"✓ This is a salt-added product.","note":"The hyphen is important to indicate that 'salt' and 'added' are working together as a single adjective modifying 'product'."},{"incorrect":"✗ More salt was add to the soup.","correct":"✓ More salt was added to the soup.","note":"'Added' is the past participle of 'add' and should be used in the passive voice construction."}],"priority":"★★☆"},"related_words":{"derivatives":["salt","add","added","salting"],"phrasal_verbs":["add salt to"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'salt-added' is used to describe food products to which salt has been intentionally added. It is important for people who are watching their sodium intake, as it indicates that the product contains more salt than it would naturally. This term is typically found on food labels and in nutritional information. Understanding the term helps consumers make informed choices about their diet.","priority":"★★★"},"example_sentences":[{"sentence":"Please check the label to see if it's a salt-added version or not.","translation":"ラベルを確認して、塩が添加されたバージョンかどうかを確認してください。","type":"adjective","meaning_category":"塩が添加された"},{"sentence":"Many processed foods are salt-added to enhance their flavor.","translation":"多くの加工食品は、風味を高めるために塩が添加されています。","type":"adjective","meaning_category":"塩分が加えられた"},{"sentence":"The doctor advised him to avoid salt-added snacks.","translation":"医師は彼に塩分が加えられたスナックを避けるようにアドバイスしました。","type":"adjective","meaning_category":"塩分が加えられた"}]}