{"word":"brassily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"厚かましく、ずうずうしく、下品に、派手に","english_definition":"In a brazen, bold, or impudent manner; in a way that is loud, showy, or vulgar.","examples":[{"sentence":"She laughed brassily, not caring who heard.","translation":"彼女は誰が聞いているかも気にせず、厚かましく笑った。"},{"sentence":"He spoke brassily about his accomplishments.","translation":"彼は自分の業績についてずうずうしく語った。"},{"sentence":"The singer belted out the song brassily.","translation":"歌手は下品なほど大声でその歌を歌った。"}],"collocations":["laugh brassily","speak brassily","act brassily","behave brassily"],"synonyms":["brazenly","boldly","impudently","shamelessly","audaciously","loudly","showily","vulgarity"],"antonyms":["timidly","modestly","humbly","shyly","quietly"]}],"etymology":{"value":"Derived from the adjective 'brassy,' which originally meant 'resembling brass' but later developed connotations of boldness, impudence, and vulgarity. The suffix '-ly' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbræsɪli/","syllables":"bras-si-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Brassily' describes actions or behaviors that are excessively bold, confident, and often lacking in refinement or good taste. It suggests a lack of subtlety and a willingness to be loud or showy, sometimes to the point of being offensive. The term carries a negative connotation, implying a lack of class or sophistication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She sang brassily, but the song was beautiful.","correct":"✓ She sang loudly, but the song was beautiful.","note":"'Brassily' implies a lack of refinement, so it doesn't fit well with something inherently beautiful. 'Loudly' is a more neutral description of volume."},{"incorrect":"✗ He apologized brassily for his mistake.","correct":"✓ He apologized insincerely for his mistake.","note":"'Brassily' suggests a lack of shame or embarrassment, which contradicts the act of apologizing. 'Insincerely' better captures the idea of a disingenuous apology."}],"priority":"★☆☆"},"related_words":{"derivatives":["brassy (adjective)","brass (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Brassily' is an advanced word that describes behavior that is bold, loud, and often vulgar. It implies a lack of subtlety and a willingness to be showy, sometimes in an offensive way. It is not a common word and is typically used in descriptive writing to convey a specific impression of someone's character or actions."},"example_sentences":[{"sentence":"The actress, known for her brassily confident performances, dominated the stage.","translation":"その女優は、厚かましく自信に満ちた演技で知られており、舞台を支配した。","type":"adverb","meaning_category":"厚かましい"},{"sentence":"He laughed brassily at the joke, drawing disapproving glances from the other guests.","translation":"彼はそのジョークに下品に笑い、他の客から非難の視線を浴びた。","type":"adverb","meaning_category":"下品な"},{"sentence":"She wore the bright red dress brassily, flaunting her figure.","translation":"彼女は明るい赤いドレスを派手に着こなし、自分の体型を誇示した。","type":"adverb","meaning_category":"派手な"}]}