{"word":"Pinax","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシャの)絵画板、奉納板","english_definition":"A painted panel of wood, terracotta, marble or other material, usually small, used in ancient Greece as a votive offering or as a decorative object.","examples":[{"sentence":"The votive pinakes found at Penteskoufi are an important source of information about Corinthian pottery.","translation":"ペンテスクーフィで発見された奉納ピナクスは、コリントスの陶器に関する重要な情報源です。"},{"sentence":"The pinax depicts a scene from daily life.","translation":"そのピナクスは日常生活の一場面を描いている。"}],"collocations":["votive pinax","Corinthian pinax","terracotta pinax"],"synonyms":["tablet","plaque","panel"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek πίναξ (pínax) meaning 'tablet, picture'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpaɪnæks/","syllables":"pi-nax"},"inflection":{"noun_plural":"pinakes (まれに pinaxes)"},"usage_notes":{"explanation":"'Pinax' is primarily used in the context of classical archaeology and art history when discussing ancient Greek artifacts. It refers specifically to a small, painted panel used for votive or decorative purposes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used a pinax for writing.","correct":"✓ She used a wax tablet for writing.","note":"A pinax was primarily for painting or decoration, not writing. Wax tablets were used for writing."}],"priority":"★☆☆"},"related_words":{"derivatives":["pinacotheca (絵画館)"],"related_terms":["tablet","plaque","stele"]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pinax' is a specialized term used in art history and archaeology, specifically referring to painted panels from ancient Greece. Understanding this term requires familiarity with classical art and culture. It's not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"Archaeologists discovered several well-preserved pinakes at the sanctuary.","translation":"考古学者は聖域で保存状態の良いピナクスをいくつか発見した。","type":"noun","meaning_category":"絵画板"},{"sentence":"The pinax provides valuable insights into ancient Greek religious practices.","translation":"そのピナクスは古代ギリシャの宗教的慣習に関する貴重な洞察を提供する。","type":"noun","meaning_category":"絵画板"}]}