{"word":"cavi-rilievi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(美術) カヴァレリーヴォ、浅浮き彫り","english_definition":"(art) A type of relief sculpture in which the figures are carved into a surface, rather than projecting from it; also known as sunken relief.","examples":[{"sentence":"The ancient Egyptians often used cavi-rilievi in their temple decorations.","translation":"古代エジプト人は、神殿の装飾にカヴァレリーヴォをよく使用した。"},{"sentence":"Cavi-rilievi are particularly effective in strong sunlight, as the shadows emphasize the design.","translation":"カヴァレリーヴォは、影がデザインを強調するため、強い日光の下で特に効果的である。"}],"collocations":["sunken relief","relief sculpture","Egyptian art","temple decoration"],"synonyms":["sunken relief","intaglio relief"],"antonyms":["alto-rilievo","bas-relief"]},{"part_of_speech":"noun","definition":"(一般) 凹彫","english_definition":"(general) A carving in which the design is sunk below the surface of the material.","examples":[{"sentence":"Cavi-rilievi is a technique that requires precision and skill.","translation":"カヴァレリーヴォは、正確さとスキルを必要とする技法である。"}],"collocations":["carving technique","sculpture","intaglio"],"synonyms":["intaglio","sunken carving"],"antonyms":["relief carving"]}],"etymology":{"value":"Italian, from 'cavo' (hollow) + 'rilievo' (relief).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːvi riˈljeɪvi/","syllables":"ca-vi-ri-lie-vi"},"inflection":{"notes":"Plural form of an Italian loanword, usually used as a plural in English as well."},"usage_notes":{"explanation":"'Cavi-rilievi' refers specifically to a sculptural technique where the design is carved *into* a flat surface, creating a 'sunken' relief. This is different from other types of relief sculpture where the design projects *out* from the background. It's most commonly associated with ancient Egyptian art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a bas-relief, which is a type of cavi-rilievi.","correct":"✓ I saw a cavi-rilievo, which is a type of relief sculpture.","note":"Bas-relief and cavi-rilievi are *different* types of relief sculpture. Bas-relief projects out; cavi-rilievi is sunken in."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized art term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cavi-rilievi' is a specialized term in art history and sculpture. It refers to a specific technique of relief carving where the design is recessed into the surface, unlike more common relief carvings where the design projects outwards. Understanding this term requires familiarity with art terminology."},"example_sentences":[{"sentence":"The pharaoh's cartouche was rendered in cavi-rilievi on the temple wall.","translation":"ファラオの紋章は、神殿の壁にカヴァレリーヴォで表現されていた。","type":"noun","meaning_category":"美術"},{"sentence":"Egyptian cavi-rilievi often depict scenes of daily life and religious rituals.","translation":"エジプトのカヴァレリーヴォは、日常生活や宗教儀式の場面を描写することが多い。","type":"noun","meaning_category":"美術"}]}