{"word":"Caspian","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"カスピ海","english_definition":"A large saltwater lake between Europe and Asia; the world's largest inland body of water.","examples":[{"sentence":"The Caspian Sea is rich in oil and natural gas resources.","translation":"カスピ海は石油と天然ガスの資源が豊富だ。"},{"sentence":"Sturgeon from the Caspian Sea are a source of high-quality caviar.","translation":"カスピ海のチョウザメは、高品質のキャビアの源である。"}],"collocations":["Caspian Sea","Caspian tiger (絶滅)","Caspian region","Caspian littoral"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"カスピ海の、カスピ海沿岸の","english_definition":"Relating to the Caspian Sea or the region around it.","examples":[{"sentence":"Caspian oil is transported via pipelines to various countries.","translation":"カスピ海の石油はパイプラインを通じて様々な国に輸送される。"},{"sentence":"The Caspian coast has a unique ecosystem.","translation":"カスピ海の沿岸には独特の生態系がある。"}],"collocations":["Caspian oil","Caspian coast","Caspian ecosystem"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Caspian\" is derived from the Caspi, an ancient people who lived southwest of the sea. The name is of uncertain origin, possibly related to an ancient Iranian language.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæspiən/","syllables":"Cas-pi-an"},"inflection":{},"usage_notes":{"explanation":"\"Caspian\" is most commonly used to refer to the Caspian Sea, the largest inland body of water in the world. It can also be used to describe things related to the sea or the region surrounding it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The caspian is a sea.","correct":"✓ The Caspian Sea is a sea.","note":"When referring to the Caspian Sea, it is important to include \"Sea\" as part of the name."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":[],"related_terms":["sea","lake","caviar","oil","sturgeon","Azerbaijan","Iran","Russia","Kazakhstan","Turkmenistan"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in geographical or scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"Caspian\" primarily refers to the Caspian Sea, a large saltwater lake located between Europe and Asia. It's often encountered in discussions about geography, natural resources (like oil and caviar), and the countries surrounding the sea (such as Azerbaijan, Iran, Russia, Kazakhstan, and Turkmenistan). While not a common word in everyday conversation, it's important to recognize in contexts related to these topics."},"example_sentences":[{"sentence":"The **Caspian** Sea is known for its unique biodiversity.","translation":"カスピ海はその独特な生物多様性で知られている。","type":"proper noun","meaning_category":"カスピ海"},{"sentence":"The **Caspian** region is strategically important due to its energy resources.","translation":"カスピ海地域は、そのエネルギー資源のために戦略的に重要である。","type":"adjective","meaning_category":"カスピ海の"}]}