{"word":"antemask","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)仮面劇において、本編の劇の前に演じられる、滑稽でグロテスクな幕間劇。","english_definition":"(historical) A grotesque or comical interlude performed before the main masque.","examples":[{"sentence":"The antemask provided a stark contrast to the elegance of the main masque.","translation":"アンテマスクは、本編のマスクの優雅さとは対照的なものでした。"},{"sentence":"The antemask often featured clowns and satirical characters.","translation":"アンテマスクには、道化師や風刺的なキャラクターがよく登場しました。"}],"collocations":["perform an antemask","antemask characters","antemask scene"],"synonyms":["burlesque","interlude","satire","comedy"],"antonyms":["masque (main performance)"]},{"part_of_speech":"noun","definition":"(比喩的に)より重要または深刻な出来事の前の、より軽く、気晴らし的な出来事。","english_definition":"(figuratively) A lighter, diverting event that precedes a more important or serious one.","examples":[{"sentence":"The opening act was just an antemask to the main event.","translation":"オープニングアクトは、メインイベントの前のアンテマスクに過ぎませんでした。"}],"collocations":["a political antemask","the antemask to the crisis"],"synonyms":["prelude","introduction","preparatory event"],"antonyms":["climax","main event"]}],"etymology":{"value":"'Ante-' (before) + 'mask' (shortened from 'masque'). The term reflects the position of this theatrical element before the main masque performance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæntiˌmæsk/","syllables":"an-te-mask"},"inflection":{"noun_plural":"antemasks"},"usage_notes":{"explanation":"An 'antemask' is a historical term referring to a specific type of theatrical performance popular in the 16th and 17th centuries. It's rarely used in modern contexts outside of historical discussions or literary analysis. Figuratively, it can describe a less significant event preceding a more important one, but this usage is uncommon.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antemask was the most important part of the show.","correct":"✓ The masque was the most important part of the show.","note":"The antemask was specifically designed as a prelude or contrast to the main masque, not the main attraction itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["masque","masquerade"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'antemask' is highly specialized and primarily encountered in the context of historical theatre studies. Understanding requires familiarity with the history of masques and courtly entertainment. Figurative usage is rare and assumes a high level of vocabulary and comprehension.","priority":"★☆☆"},"example_sentences":[{"sentence":"The court eagerly awaited the antemask, known for its chaotic and humorous scenes.","translation":"宮廷の人々は、混沌としたユーモラスな場面で知られるアンテマスクを心待ちにしていました。","type":"noun","meaning_category":"historical performance"},{"sentence":"The preliminary negotiations served as an antemask to the more serious discussions that would follow.","translation":"予備交渉は、その後に続くより深刻な議論へのアンテマスクとして機能しました。","type":"noun","meaning_category":"figurative prelude"}]}