{"word":"rich-ored","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"含有する鉱石が豊富な、鉱脈が豊かな","english_definition":"Containing a large amount of ore; having rich veins of ore.","examples":[{"sentence":"The mountain was known to be rich-ored, attracting many prospectors.","translation":"その山は鉱石が豊富であることで知られており、多くの探鉱者を引き寄せた。"},{"sentence":"They discovered a rich-ored vein of gold deep within the mine.","translation":"彼らは鉱山の奥深くに、金鉱脈が豊かな鉱脈を発見した。"}],"collocations":["rich-ored deposit","rich-ored vein","rich-ored mountain"],"synonyms":["ore-rich","mineral-rich","high-grade"],"antonyms":["poor-ored","low-grade"]}],"etymology":{"value":"\"rich\" + \"ore\" + \"-ed\". Combining the adjective \"rich\" describing abundance, the noun \"ore\" referring to rock containing valuable minerals, and the suffix \"-ed\" indicating possession or quality of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɪtʃˈɔːrd/","syllables":"rich-ored"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term \"rich-ored\" is typically used in the context of mining and geology to describe areas or deposits that contain a high concentration of valuable minerals. It is often used to indicate the economic viability of mining operations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is rich oared.","correct":"✓ The area is rich-ored.","note":"Avoid misspelling \"ored\" as \"oared.\""}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ore","vein","deposit","mining","mineral"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Rich-ored\" is a specialized term used in the context of geology and mining. It describes a location or deposit that contains a high concentration of valuable minerals within its ore. Understanding this term requires familiarity with basic geological concepts and mining vocabulary."},"example_sentences":[{"sentence":"The company invested heavily in exploring the rich-ored region.","translation":"その会社は、鉱石が豊富な地域を探査するために多額の投資を行った。","type":"adjective","meaning_category":"鉱石が豊富な"},{"sentence":"Geologists analyzed samples to determine if the rock was rich-ored enough for commercial extraction.","translation":"地質学者は、その岩石が商業的な採掘に十分なほど鉱石が豊富であるかどうかを判断するためにサンプルを分析した。","type":"adjective","meaning_category":"鉱石が豊富な"}]}