{"word":"stirpiculture","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人種改良、優生学的な育種","english_definition":"The selective breeding of human beings to improve the species.","examples":[{"sentence":"Stirpiculture aims to enhance desirable traits in future generations.","translation":"人種改良は、将来の世代における望ましい特性の向上を目指す。"},{"sentence":"The concept of stirpiculture has been associated with controversial eugenic practices.","translation":"人種改良の概念は、物議を醸す優生学的な慣行と関連付けられてきた。"}],"collocations":["practice stirpiculture","promote stirpiculture","eugenic stirpiculture"],"synonyms":["eugenics","selective breeding","race betterment"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'stirps' (meaning 'stock, race, family') and 'cultura' (meaning 'cultivation').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɜːrpɪˌkʌltʃər/","syllables":"stir-pi-cul-ture"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Stirpiculture is a term that refers to the selective breeding of humans to improve the species. It is closely associated with eugenics and has been used to promote controversial and often discriminatory practices. The term is not commonly used today due to its problematic history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Stirpiculture is the study of plant breeding.","correct":"✓ Stirpiculture is the selective breeding of humans.","note":"Stirpiculture specifically refers to human breeding, not plant breeding."}],"priority":"★★☆"},"related_words":{"derivatives":["stirpicultural (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Stirpiculture is a rare and complex term referring to the selective breeding of humans to improve the species. It is closely linked to the historically controversial field of eugenics. Due to its sensitive and problematic connotations, the term is not commonly used in modern discourse. Understanding its historical context is crucial when encountering this word."},"example_sentences":[{"sentence":"The ethical implications of stirpiculture are widely debated.","translation":"人種改良の倫理的な意味合いは広く議論されている。","type":"general","meaning_category":"definition"},{"sentence":"Historically, stirpiculture was proposed as a method to eliminate undesirable traits.","translation":"歴史的に、人種改良は望ましくない特性を排除する方法として提案された。","type":"historical context","meaning_category":"definition"}]}