{"word":"ladder-back","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"梯子状の背もたれを持つ椅子","english_definition":"A chair with a back consisting of horizontal slats resembling the rungs of a ladder.","examples":[{"sentence":"The dining room was furnished with a long table and six ladder-back chairs.","translation":"食堂には長いテーブルと6脚の梯子状の背もたれを持つ椅子が置かれていた。"},{"sentence":"She preferred the simple elegance of the ladder-back chair to the ornate designs of the Victorian era.","translation":"彼女はビクトリア朝時代の華美なデザインよりも、梯子状の背もたれを持つ椅子のシンプルな優雅さを好んだ。"}],"collocations":["ladder-back chair","antique ladder-back","wooden ladder-back"],"synonyms":["slat-back chair"],"antonyms":[]}],"etymology":{"value":"The term 'ladder-back' is descriptive, referring to the chair's back which resembles a ladder due to the horizontal slats.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlædərˌbæk/","syllables":"lad-der-back"},"inflection":{"noun_plural":"ladder-backs"},"usage_notes":{"explanation":"'Ladder-back' chairs are often associated with traditional or rustic styles. They can be made of various materials, but are commonly wooden. The term specifically refers to the design of the chair back.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sat on a ladder back.","correct":"✓ He sat on a ladder-back chair.","note":"It's more common to use 'ladder-back' as an adjective describing the chair, so specifying 'ladder-back chair' is clearer."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'ladder-back' refers to a specific style of chair. Understanding this term requires some familiarity with furniture styles. The word itself is descriptive, making it easier to remember once the design is visualized."},"example_sentences":[{"sentence":"The antique shop had a collection of beautifully crafted ladder-back chairs.","translation":"その骨董品店には、美しく作られた梯子状の背もたれを持つ椅子が集められていた。","type":"noun","meaning_category":"furniture"},{"sentence":"He refinished the old ladder-back chair to match the rest of the dining set.","translation":"彼はダイニングセットに合わせて、古い梯子状の背もたれを持つ椅子を再塗装した。","type":"noun","meaning_category":"furniture"}]}