{"word":"vibroscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"振動を見るための装置、振動計","english_definition":"An instrument for observing vibrations.","examples":[{"sentence":"The vibroscope is used to measure the frequency and amplitude of vibrations.","translation":"振動計は振動の周波数と振幅を測定するために使用されます。"},{"sentence":"Scientists used a vibroscope to study the vibrations of the bridge.","translation":"科学者たちは橋の振動を研究するために振動計を使用しました。"}],"collocations":["use a vibroscope","measure with a vibroscope","study vibrations with a vibroscope"],"synonyms":["vibration meter","oscilloscope","seismograph"],"antonyms":[]}],"etymology":{"value":"'Vibro-' (from 'vibration') + '-scope' (from Greek 'skopeō' meaning 'to see, examine').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaɪbrəˌskoʊp/","syllables":"vi-bro-scope"},"inflection":{"noun_plural":"vibroscopes"},"usage_notes":{"explanation":"A vibroscope is a specialized instrument used to visualize or measure vibrations. It's often employed in scientific and engineering contexts to analyze the characteristics of vibrating objects or systems. It can refer to different types of instruments, from simple devices for observing motion to more sophisticated electronic equipment for precise measurement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a vibroscope to listen to the vibrations.","correct":"✓ I used a vibroscope to observe the vibrations.","note":"A vibroscope is for *observing* (seeing) vibrations, not listening to them. A stethoscope might be used for listening."}],"priority":"★☆☆"},"related_words":{"derivatives":["vibroscopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'vibroscope' is a technical term primarily used in scientific or engineering contexts. It refers to a device used to observe or measure vibrations. Understanding the term requires familiarity with basic scientific vocabulary and concepts related to vibrations and measurement instruments."},"example_sentences":[{"sentence":"The engineer used a vibroscope to diagnose the source of the machine's excessive vibrations.","translation":"エンジニアは、機械の過剰な振動の原因を診断するために振動計を使用しました。","type":"general","meaning_category":"measurement"},{"sentence":"By analyzing the data from the vibroscope, they were able to improve the design of the structure.","translation":"振動計からのデータを分析することにより、彼らは構造の設計を改善することができました。","type":"research","meaning_category":"analysis"}]}