{"word":"Cornberry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A less common or potentially made-up term. It could refer to a type of berry, possibly related to corn or having similar characteristics. Without more context, the precise meaning is unclear.","english_definition":"A term that is not widely recognized. It may refer to a type of berry, possibly associated with corn or sharing similar traits. The exact meaning is ambiguous without additional context.","examples":[{"sentence":"I'm not familiar with cornberries; are they edible?","translation":"コーンベリーはよく知らないのですが、食べられるのですか？"},{"sentence":"The recipe called for cornberries, but I couldn't find them at the market.","translation":"レシピにはコーンベリーを使うように書いてありましたが、市場で見つけられませんでした。"}],"collocations":["cornberry jam","cornberry pie","wild cornberry"],"synonyms":["unknown berry","fictional fruit"],"antonyms":[]}],"etymology":{"value":"Likely a compound word combining \"corn\" and \"berry\". The \"corn\" part might refer to a similarity in appearance, growing location, or some other characteristic shared with corn.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkɔːrnˌbɛri/","syllables":"corn-ber-ry"},"inflection":{"noun_plural":"cornberries"},"usage_notes":{"explanation":"The term \"cornberry\" is not commonly used or recognized in standard English. It is possible that it is a regional term, a made-up word, or a misspelling of another word. If you encounter this word, it's important to consider the context to infer its intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a bag of cornberries at the grocery store.","correct":"✓ I bought a bag of cranberries at the grocery store.","note":"It is possible that \"cornberry\" is a misspelling or mishearing of \"cranberry\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["corn","berry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Very low frequency - likely not a standard word.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"cornberry\" is not a common term. It is likely a neologism or a regional term, and its meaning would depend heavily on context. Readers should be cautious and consider the possibility that it is a misspelling or a made-up word. Due to its rarity, it is not suitable for beginner or intermediate learners. Advanced learners should be aware of its ambiguity.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The artist used cornberry juice to create a unique purple dye.","translation":"その芸術家は、独特の紫色の染料を作るためにコーンベリーのジュースを使った。","type":"noun","meaning_category":"hypothetical berry"},{"sentence":"In the children's story, the cornberry grew only in the magical forest.","translation":"子供向けの話では、コーンベリーは魔法の森にしか生えていなかった。","type":"noun","meaning_category":"fictional berry"}]}