{"word":"misaventeur","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) An unfortunate or unsuccessful adventurer; one who experiences mishaps or failures in their adventures.","english_definition":"An unfortunate or unsuccessful adventurer; one who experiences mishaps or failures in their adventures.","examples":[{"sentence":"The aspiring treasure hunter proved to be more of a misaventeur, constantly getting lost and finding nothing of value.","translation":"その野心的なトレジャーハンターは、どちらかというと不運な冒険家であることが判明し、常に道に迷い、価値のあるものは何も見つけられなかった。"}],"collocations":["unlucky misaventeur","hapless misaventeur"],"synonyms":["unfortunate adventurer","hapless explorer"],"antonyms":["successful adventurer","fortunate explorer"]}],"etymology":{"value":"A blend of 'misadventure' and 'adventurer'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌmɪsædˈvɛntʃərər/","syllables":"mi-sa-ven-chu-ra-"},"inflection":{"noun_plural":"misaventeurs"},"usage_notes":{"explanation":"The word 'misaventeur' is a relatively rare and somewhat humorous term, used to describe someone who embarks on adventures but consistently encounters misfortune or fails to achieve their goals. It combines the sense of 'misadventure' (an unfortunate incident) with 'adventurer' (someone who seeks out exciting or risky experiences).","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"misadventure","correct":"misaventeur","note":"'Misadventure' refers to the event itself, while 'misaventeur' refers to the person experiencing the unfortunate events."}],"priority":"N/A"},"related_words":{"derivatives":["misadventure (noun: an unfortunate incident; a mishap)"],"related_terms":["adventurer","explorer","traveler"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'misaventeur' is a rare and somewhat jocular term, likely encountered only in advanced texts or specialized contexts. Understanding requires familiarity with both 'misadventure' and 'adventurer', and an ability to recognize blended words. Its usage is generally limited to descriptive or narrative contexts where the misfortune of an adventurer is being emphasized."},"example_sentences":[{"sentence":"Despite his grand ambitions, he was more of a misaventeur, always stumbling into trouble.","translation":"壮大な野望にもかかわらず、彼はどちらかというと不運な冒険家で、いつもトラブルに巻き込まれていた。","type":"noun","meaning_category":"unfortunate adventurer"},{"sentence":"The book tells the story of a lovable misaventeur whose expeditions always end in comical disaster.","translation":"その本は、遠征が常に喜劇的な災害に終わる、愛すべき不運な冒険家の物語を語っている。","type":"noun","meaning_category":"unfortunate adventurer"}],"japanese_translations":[{"translation":"不運な冒険家","explanation":"冒険において不運や失敗を経験する人を指す言葉。"},{"translation":"失敗続きの冒険者","explanation":"冒険に出るものの、常に不運に見舞われる人を指す、ややユーモラスな表現。"},{"translation":"ミサヴァンテュール","explanation":"英語の 'misaventeur' をカタカナ表記したもので、原語のニュアンスをそのまま伝えたい場合に用いる。"}]}