{"word":"all-land","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"陸地のみの、陸上専用の","english_definition":"Designed or suitable for use only on land.","examples":[{"sentence":"The company developed an all-land vehicle for agricultural purposes.","translation":"その会社は農業目的の陸上専用車両を開発した。"},{"sentence":"This is an all-land route, so we won't need a boat.","translation":"これは陸路のみのルートなので、ボートは必要ありません。"}],"collocations":["all-land vehicle","all-land route","all-land transport"],"synonyms":["land-based","terrestrial","ground-based"],"antonyms":["amphibious","aquatic","maritime"]}],"etymology":{"value":"Combination of \"all\" (entirely) and \"land\" (the part of the earth's surface that is not permanently covered by water).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔːlˌlænd/","syllables":"all-land"},"inflection":{"notes":"The word 'all-land' typically functions as an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"all-land\" is used to describe something that is exclusively designed for or limited to use on land, as opposed to something that can also be used in water or air. It emphasizes the terrestrial nature of the object or route.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The all land car is very fast.","correct":"✓ The all-land car is very fast.","note":"Hyphenate 'all-land' when used as a compound adjective before a noun."},{"incorrect":"✗ This vehicle can travel all land and water.","correct":"✓ This vehicle can travel on all land.","note":"'All-land' implies exclusivity to land, so it's incorrect to say it can travel 'all land and water'. Use 'on all land' to specify the area of travel."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["land","terrain","terrestrial","ground","shore","coast"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"all-land\" is relatively straightforward, meaning something that is exclusively designed for or used on land. It is usually used to differentiate something from its counterparts that can operate in multiple environments (e.g., land and water). The hyphenated form is important when used as a compound adjective.","priority":"★★★"},"example_sentences":[{"sentence":"The military tested the new all-land transport system.","translation":"軍は新しい陸上専用輸送システムをテストした。","type":"adjective","meaning_category":"陸上専用の"},{"sentence":"The proposed railway is an all-land route connecting the two cities.","translation":"提案された鉄道は、2つの都市を結ぶ陸路のみのルートです。","type":"adjective","meaning_category":"陸上のみの"}]}