{"word":"root-parasitism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"根寄生、根寄生植物","english_definition":"A parasitic relationship in which a plant obtains nutrients and water by attaching its roots to the roots of another plant.","examples":[{"sentence":"Some plants exhibit root-parasitism, relying on other plants for survival.","translation":"いくつかの植物は根寄生を示し、生存のために他の植物に頼っている。"},{"sentence":"Root-parasitism can significantly impact the host plant's growth and health.","translation":"根寄生は、宿主植物の成長と健康に大きな影響を与える可能性がある。"}],"collocations":["obligate root-parasitism","facultative root-parasitism","host plant","parasitic plant"],"synonyms":["root parasitism","parasitic roots","plant parasitism"],"antonyms":["autotrophy","photosynthesis"]}],"etymology":{"value":"The term is derived from 'root', referring to the underground part of a plant, and 'parasitism', indicating a relationship where one organism benefits at the expense of another.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːt ˌpærəˌsɪtɪzəm/","syllables":"root-par-a-si-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Root-parasitism is a specific type of parasitism found in the plant kingdom. Parasitic plants that exhibit root-parasitism have specialized structures called haustoria that penetrate the host plant's roots to extract water and nutrients. This can lead to reduced growth, nutrient deficiencies, and even death of the host plant. Root-parasitism can be obligate, meaning the parasitic plant cannot survive without a host, or facultative, meaning it can also survive independently.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is root-parasite.","correct":"✓ The plant is a root-parasite.","note":"'Root-parasite' is a noun, so it needs an article ('a' or 'an') when referring to a single instance."},{"incorrect":"✗ Root-parasitism only affects trees.","correct":"✓ Root-parasitism can affect various types of plants, including trees, shrubs, and herbs.","note":"Root-parasitism is not limited to trees and can affect a wide range of plant species."}],"priority":"★★☆"},"related_words":{"derivatives":["root-parasite (noun: a plant that exhibits root-parasitism)","parasitic (adjective: relating to parasitism)","parasite (noun: an organism that lives in or on another organism and benefits by deriving nutrients at the other's expense)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Root-parasitism' is a specialized term in botany that describes a particular type of parasitic relationship between plants. It is typically encountered in academic or scientific contexts when discussing plant ecology or pathology. Understanding this term requires a solid grasp of biological concepts such as parasitism, autotrophy, and plant anatomy. The word is relatively infrequent in general conversation and more common in scientific literature.","priority":"★☆☆"},"example_sentences":[{"sentence":"*Orobanche* species are known for their aggressive root-parasitism, causing significant crop damage.","translation":"ハマウツボ属の植物は、その攻撃的な根寄生で知られており、深刻な作物被害を引き起こしている。","type":"noun","meaning_category":"根寄生"},{"sentence":"The study investigated the mechanisms of nutrient transfer in plants exhibiting root-parasitism.","translation":"その研究では、根寄生を示す植物における栄養素の移動メカニズムを調査した。","type":"noun","meaning_category":"根寄生"},{"sentence":"Some farmers use specific herbicides to control root-parasitism in their fields.","translation":"一部の農家は、畑での根寄生を制御するために特定の除草剤を使用している。","type":"noun","meaning_category":"根寄生"}]}