{"word":"blusteriness","meanings":[{"part_of_speech":"noun","definition":"騒々しさ、荒々しさ、大げさな態度、ほら吹き","english_definition":"The state or quality of being blustery; boisterousness; loud, empty boasting or threats.","examples":[{"sentence":"The blusteriness of the wind made it difficult to walk.","translation":"風の荒々しさで歩くのが難しかった。"},{"sentence":"His blusteriness was just a cover for his insecurity.","translation":"彼のほら吹きは大げさな態度は、彼の不安を隠すためのものに過ぎなかった。"}],"synonyms":["boisterousness","turbulence","tempestuousness","bombast","braggadocio","swagger"],"antonyms":["calmness","serenity","quietness","modesty","humility"],"related_words":["bluster (verb/noun)","blustery (adjective)"]}],"etymology":{"value":"Derived from the word 'bluster', with the suffix '-iness' added to form a noun indicating the state or quality of being blustery.","notes":"'Bluster' itself has origins in Middle English, possibly from Middle Dutch or Low German words related to blowing or roaring."},"pronunciation":{"ipa":"/ˈblʌstərɪnəs/","syllables":"blus-ter-i-ness"},"inflection":{"noun_form":"uncountable"},"usage_notes":{"explanation":"'Blusteriness' describes either turbulent weather conditions or a person's loud, boastful, and often insincere behavior. It can refer to the physical intensity of wind and storms or the exaggerated and sometimes threatening mannerisms of an individual.","priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is not commonly used in everyday conversation or writing, but it may appear in descriptive or literary contexts."},"readability_explanation":{"level":"C1","text":"'Blusteriness' is a relatively uncommon word that describes the quality of being 'blustery'. It can refer to the turbulent nature of weather, like strong, gusty winds, or to someone's loud, boastful, and often insincere behavior. Because it's not a frequently used word, understanding the root word 'bluster' is helpful for comprehending its meaning."},"example_sentences":[{"sentence":"The **blusteriness** of the storm kept us indoors all day.","translation":"嵐の荒々しさで一日中屋内に閉じこもっていた。","type":"weather"},{"sentence":"His **blusteriness** at the meeting intimidated some of the newer employees.","translation":"会議での彼の騒々しい態度に、新入社員の中には怖気づく者もいた。","type":"behavior"}]}