{"word":"Peachberry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(架空の果物)桃とベリーを掛け合わせたような果物","english_definition":"A fictional fruit that is a hybrid of a peach and a berry.","examples":[{"sentence":"The recipe called for peachberries, but I couldn't find any, so I substituted with peaches and raspberries.","translation":"レシピにはピーチベリーが必要だったが、見つからなかったので、桃とラズベリーで代用した。"},{"sentence":"The peachberry tree in my backyard is finally bearing fruit this year.","translation":"裏庭のピーチベリーの木が、今年ついに実をつけた。"}],"collocations":["peachberry jam (ピーチベリージャム)","peachberry pie (ピーチベリーパイ)","peachberry tree (ピーチベリーの木)"],"synonyms":["fictional fruit","hybrid fruit"],"antonyms":[]},{"part_of_speech":"noun","definition":"(商標)特定の飲料または食品のフレーバー名","english_definition":"(Trademark) A flavor name for a specific beverage or food product.","examples":[{"sentence":"I love the refreshing taste of Peachberry Splash.","translation":"ピーチベリー・スプラッシュのさわやかな味が大好きだ。"},{"sentence":"Have you tried the new Peachberry yogurt? It's delicious!","translation":"新しいピーチベリーヨーグルトは試しましたか？とても美味しいですよ！"}],"collocations":["Peachberry Splash (ピーチベリー・スプラッシュ)","Peachberry yogurt (ピーチベリーヨーグルト)"],"synonyms":["flavor","flavoring"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'peach' and 'berry', suggesting a fruit that combines the characteristics of both.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpiːtʃˌbɛri/","syllables":"Peach-ber-ry"},"inflection":{"noun_plural":"Peachberries"},"usage_notes":{"explanation":"'Peachberry' is primarily used in fictional contexts or as a brand name for flavored products. It does not refer to a naturally occurring fruit. When used in fiction, it implies a fruit with the sweet, juicy qualities of a peach combined with the tartness or small size of a berry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some peachberries at the grocery store.","correct":"✓ I bought some peaches and berries at the grocery store.","note":"Unless you are in a fictional setting or the store specifically sells a product labeled 'Peachberry', you would typically buy peaches and berries separately."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a common word)","frequency_google_ngram":"Low frequency, primarily in fiction and product names.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Peachberry' is a compound word that combines 'peach' and 'berry'. It's generally understood to be a fictional fruit or a flavor name, rather than a real fruit you can find in nature. If you encounter this word, it's likely in a creative or commercial context."},"example_sentences":[{"sentence":"The children pretended to pick peachberries from the imaginary tree.","translation":"子供たちは想像上の木からピーチベリーを摘むふりをした。","type":"noun","meaning_category":"fictional fruit"},{"sentence":"The new soda has a refreshing peachberry flavor.","translation":"新しいソーダはさわやかなピーチベリー味だ。","type":"noun","meaning_category":"flavor name"}]}