{"word":"intumescing","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"発泡性の、膨張性の","english_definition":"causing to expand or swell when heated; foaming.","examples":[{"sentence":"Intumescing paints are used as a passive fire protection measure.","translation":"発泡性塗料は、受動的な防火対策として使用されます。"},{"sentence":"The intumescing agent creates a char layer that protects the underlying material.","translation":"発泡剤は、下にある材料を保護する炭化層を生成します。"}],"collocations":["intumescing paint","intumescing coating","intumescing fireproofing"],"synonyms":["expanding","swelling","foaming"],"antonyms":["contracting","shrinking"]}],"etymology":{"value":"From the Latin word 'intumescere', meaning 'to swell up'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪn.tjuˈmɛs.ɪŋ/","syllables":"in-tu-mes-cing"},"inflection":{"verb_forms":{"present_participle":"intumescing"}},"usage_notes":{"explanation":"'Intumescing' is typically used in technical contexts, especially related to fire protection and materials science. It describes materials that expand and form a protective layer when exposed to heat, providing insulation and preventing fire spread.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intumescing feeling of pride filled her heart.","correct":"✓ The swelling feeling of pride filled her heart.","note":"'Intumescing' is generally reserved for describing the physical expansion of materials due to heat. For emotional swelling, use 'swelling'."}],"priority":"★☆☆"},"related_words":{"derivatives":["intumescence (noun)","intumescent (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Intumescing' is a specialized term primarily used in technical and scientific contexts, particularly in the fields of fire protection and material science. It describes the property of a substance to swell and expand when exposed to heat, forming a protective layer. Due to its specific application, it is not commonly encountered in everyday language. Understanding this term requires familiarity with technical vocabulary related to chemistry, engineering, or construction."},"example_sentences":[{"sentence":"The **intumescing** sealant expands to fill gaps and prevent the spread of flames.","translation":"その発泡性シーラントは、隙間を埋めて炎の広がりを防ぐために膨張します。","type":"adjective","meaning_category":"発泡性の、膨張性の"},{"sentence":"This **intumescing** firestop material is designed to protect cable penetrations.","translation":"この発泡性耐火材は、ケーブル貫通部を保護するように設計されています。","type":"adjective","meaning_category":"発泡性の、膨張性の"}]}