{"word":"hokily","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ぎこちなく、わざとらしく、不自然に","english_definition":"In a contrived, artificial, or clumsy manner.","examples":[{"sentence":"The scene was staged hokily, with actors delivering their lines in an unnatural way.","translation":"その場面はぎこちなく演出され、俳優たちは不自然な言い方でセリフを言っていた。"},{"sentence":"He tried to act surprised, but he did it so hokily that everyone knew he was faking.","translation":"彼は驚いたふりをしようとしたが、あまりにもわざとらしかったので、誰もが彼が嘘をついているとわかった。"},{"sentence":"The dialogue in the movie felt hokily written and didn't flow naturally.","translation":"映画のセリフは不自然に書かれているように感じられ、自然な流れではなかった。"}],"collocations":["staged hokily","acted hokily","written hokily"],"synonyms":["awkwardly","contrivedly","artificially","unnaturally","clumsily"],"antonyms":["naturally","sincerely","authentically"]}],"etymology":{"value":"おそらく「hokum」に由来。「hokum」は、観客を喜ばせるために意図的に使用される、ばかげた、または感情的な表現を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊkɪli/","syllables":"ho-ki-ly"},"inflection":{"notes":"This is an adverb and does not inflect."},"usage_notes":{"explanation":"\"Hokily\" describes something done in a way that lacks genuineness or skill, often appearing forced or artificial. It's commonly used to critique performances, writing, or any situation where something feels contrived.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She smiled hokily at the camera.","correct":"✓ She smiled awkwardly at the camera.","note":"While \"hokily\" and \"awkwardly\" can sometimes be interchangeable, \"hokily\" often implies a deliberate attempt to create a certain effect, whereas \"awkwardly\" simply suggests a lack of grace or skill."}],"priority":"★☆☆"},"related_words":{"derivatives":["hokey (adjective)","hokum (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hokily\" is an adverb that describes something done in a contrived or artificial manner. It suggests a lack of genuineness and often implies an attempt to deceive or manipulate the audience. The word is relatively uncommon and typically used in more sophisticated or critical contexts."},"example_sentences":[{"sentence":"The actors delivered their lines hokily, making the scene feel unnatural.","translation":"俳優たちはセリフをぎこちなく言い、その場面を不自然に感じさせた。","type":"adverb","meaning_category":"不自然に"},{"sentence":"The plot twist was executed so hokily that it was obvious from the start.","translation":"プロットのどんでん返しは非常にわざとらしく実行されたため、最初から明らかだった。","type":"adverb","meaning_category":"わざとらしく"},{"sentence":"The special effects were done hokily, detracting from the overall quality of the film.","translation":"特殊効果は不自然に行われ、映画全体の質を損なっていた。","type":"adverb","meaning_category":"ぎこちなく"}]}