{"word":"vermiculose","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"虫食い状の、虫食い模様の","english_definition":"Having a surface that appears as if eaten by worms; marked with sinuous, wormlike tracks or patterns.","examples":[{"sentence":"The old wood was vermiculose, showing the paths of wood-boring insects.","translation":"その古い木材は虫食い状で、木を穿孔する昆虫の跡が見られた。"},{"sentence":"The pattern on the stone was vermiculose, resembling the trails of worms in mud.","translation":"石の模様は虫食い状で、泥の中のミミズの跡に似ていた。"}],"collocations":["vermiculose wood","vermiculose pattern","vermiculose surface"],"synonyms":["worm-eaten","eroded","corroded","pitted","honeycombed"],"antonyms":["smooth","unblemished","intact"]}],"etymology":{"value":"From Latin 'vermiculus' (little worm) + '-ose' (full of, abounding in). Refers to the worm-like appearance of the surface.","priority":"★★☆"},"pronunciation":{"ipa":"/vərˈmɪkjʊloʊs/","syllables":"ver-mic-u-lose"},"inflection":{"notes":"Adjective, no standard inflections beyond comparative/superlative (more vermiculose, most vermiculose), although these are rarely used."},"usage_notes":{"explanation":"'Vermiculose' is a descriptive term primarily used in geology, botany, and materials science to describe surfaces or patterns that resemble the tracks or damage caused by worms. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vermiculose was smooth.","correct":"✓ The surface was vermiculose.","note":"'Vermiculose' describes a surface condition, so it's incorrect to say the 'vermiculose' itself is smooth. The surface *with* the vermiculose pattern cannot be smooth."}],"priority":"★☆☆"},"related_words":{"derivatives":["vermiculation (noun: a worm-eaten appearance or pattern)","vermiculite (noun: a hydrated laminar mineral that expands when heated, sometimes exhibiting a vermiculose structure)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very rare, technical vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vermiculose' is a specialized term used to describe a surface that looks like it has been eaten or marked by worms. It's not a word you'd typically encounter in everyday conversation, but rather in technical or scientific contexts, such as geology or botany, when describing textures or patterns. Understanding the etymology (from 'vermiculus,' meaning 'little worm') helps to grasp its meaning.","example_sentences":[]},"example_sentences":[{"sentence":"The fossilized wood displayed a distinctly vermiculose texture, indicating extensive insect activity millions of years ago.","translation":"その化石化した木材は、顕著な虫食い状の質感を示しており、数百万年前の広範囲な昆虫活動を示唆していた。","type":"adjective","meaning_category":"虫食い状の"},{"sentence":"Under the microscope, the mineral's surface appeared vermiculose, with intricate patterns resembling tiny worm tracks.","translation":"顕微鏡下では、その鉱物の表面は虫食い状に見え、微細なミミズの跡のような複雑な模様があった。","type":"adjective","meaning_category":"虫食い模様の"}]}