{"word":"NSF","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(アメリカ) 全米科学財団 (National Science Foundation)","english_definition":"(US) National Science Foundation: an independent US government agency that supports fundamental research and education in all the non-medical fields of science and engineering.","examples":[{"sentence":"The research project was funded by the NSF.","translation":"その研究プロジェクトは全米科学財団から資金提供を受けた。"},{"sentence":"NSF grants are highly competitive.","translation":"全米科学財団の助成金は非常に競争率が高い。"}],"collocations":["NSF grant (全米科学財団の助成金)","NSF funding (全米科学財団からの資金提供)","NSF program (全米科学財団のプログラム)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"An acronym for National Science Foundation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛnˌɛsˈɛf/","syllables":"N-S-F"},"inflection":{"notes":"It's an acronym, so it doesn't inflect."},"usage_notes":{"explanation":"NSF is primarily known as the acronym for the National Science Foundation, a US government agency. It is generally used in contexts related to scientific research, funding, and education within the United States.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I received a NSF for my project.","correct":"✓ I received an NSF grant for my project.","note":"It's more common to refer to an 'NSF grant' or 'NSF funding' rather than just 'an NSF'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"acronyms":["NASA","NIH","DOE"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'NSF' stands for the National Science Foundation, which is a US government agency that supports science and engineering research. You'll usually see this term in articles or discussions about scientific funding, research projects, or educational programs in the United States. It's a specialized term, so you don't need to know it unless you're involved in those fields."},"example_sentences":[{"sentence":"The university received a large NSF grant to study climate change.","translation":"その大学は気候変動を研究するために、全米科学財団から多額の助成金を受けた。","type":"noun","meaning_category":"全米科学財団"},{"sentence":"NSF-funded research has led to many important scientific discoveries.","translation":"全米科学財団の資金提供を受けた研究は、多くの重要な科学的発見につながっている。","type":"adjective (implied)","meaning_category":"全米科学財団"}]}