{"word":"arithmetico-geometrical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"算術幾何的な","english_definition":"Relating to both arithmetic and geometry; specifically, relating to a series in which each term is the product of corresponding terms in an arithmetic and a geometric series.","examples":[{"sentence":"The arithmetico-geometrical mean is a concept used in numerical analysis.","translation":"算術幾何平均は、数値解析で使用される概念です。"},{"sentence":"He studied arithmetico-geometrical progressions in his advanced mathematics course.","translation":"彼は上級数学のコースで算術幾何数列を研究しました。"}],"collocations":["arithmetico-geometrical mean","arithmetico-geometrical progression"],"synonyms":["arithmetic-geometric"],"antonyms":[]}],"etymology":{"value":"Formed by combining \"arithmetical\" (from arithmetic) and \"geometrical\" (from geometry).","priority":"★★★"},"pronunciation":{"ipa":"/əˌrɪθmətɪkoʊˌdʒiːəˈmɛtrɪkəl/","syllables":"a-rith-me-ti-co-ge-o-met-ri-cal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is primarily used in mathematics to describe concepts or series that involve both arithmetic and geometric properties. It is relatively uncommon outside of specialized mathematical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arithmetico-geometrical is easy to understand.","correct":"✓ Arithmetico-geometrical series are complex.","note":"Arithmetico-geometrical is an adjective, not a noun. It must be used to describe something."}],"priority":"★★☆"},"related_words":{"derivatives":["arithmetic","geometric","arithmetico-geometric"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"This is a highly specialized term used in advanced mathematics. Understanding requires familiarity with both arithmetic and geometric sequences. It is unlikely to be encountered outside of academic or technical contexts."},"example_sentences":[{"sentence":"An arithmetico-geometrical sequence is formed by multiplying corresponding terms of an arithmetic sequence and a geometric sequence.","translation":"算術幾何数列は、等差数列と等比数列の対応する項を掛け合わせることによって形成されます。","type":"adjective","meaning_category":"mathematics"}]}