{"word":"undislodged","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"取り除かれていない、移動させられていない、元の場所にある","english_definition":"not dislodged; remaining in its original position or place.","examples":[{"sentence":"The stone remained undislodged despite the strong winds.","translation":"強い風にもかかわらず、その石は元の場所から動かなかった。"},{"sentence":"The old painting was undislodged from the wall, preserving its original placement.","translation":"その古い絵画は壁から取り外されず、元の配置が保たれた。"}],"collocations":["remain undislodged","stay undislodged"],"synonyms":["unmoved","unaffected","intact","fixed","secure"],"antonyms":["dislodged","removed","displaced","detached"]}],"etymology":{"value":"'Undislodged' is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'dislodged' of the verb 'dislodge'. 'Dislodge' comes from Old French 'deslogier' meaning 'to remove from lodgings', from 'des-' (away from) + 'logier' (to lodge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪsˈlɒdʒd/","syllables":"un-dis-lodged"},"inflection":{"notes":"This is an adjective, so it does not have typical verb inflections. It can be used in comparative and superlative forms (more undislodged, most undislodged), although this is rare."},"usage_notes":{"explanation":"'Undislodged' is a relatively uncommon word, typically used in formal or technical contexts to describe something that has not been moved or removed from its original position. It often implies a sense of stability or resistance to being moved. The word is most frequently encountered in descriptive writing, particularly when emphasizing the preservation of something in its original state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undislodged information was easily accessible.","correct":"✓ The unverified information was easily accessible.","note":"'Undislodged' refers to physical displacement, not the verification status of information. Use 'unverified' or 'unconfirmed' for information. "},{"incorrect":"✗ He felt undislodged from his routine.","correct":"✓ He felt disrupted from his routine.","note":"'Undislodged' typically refers to physical objects. For routines or habits, use 'disrupted' or 'disturbed' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["dislodge (verb: to remove or force out from a place or position)","dislodgement (noun: the act of dislodging)"],"antonyms":["dislodged (adjective: removed or forced out from a place or position)"],"related_concepts":["stability","preservation","original position","immobility"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'undislodged' is a relatively rare and formal term. It is best understood by those with an advanced vocabulary. It describes something that has not been moved or removed from its original position, implying stability and resistance to displacement. Understanding the root word 'dislodge' is helpful in grasping its meaning. Due to its infrequent use, it is typically encountered in specialized or descriptive contexts."},"example_sentences":[{"sentence":"The ancient artifact remained undislodged in its chamber for centuries.","translation":"その古代の工芸品は、何世紀にもわたってその部屋の中で元の場所から動かなかった。","type":"adjective","meaning_category":"remaining in place"},{"sentence":"Despite the earthquake, the heavy machinery remained undislodged.","translation":"地震にもかかわらず、その重機は元の場所から動かなかった。","type":"adjective","meaning_category":"not removed"},{"sentence":"The historical marker was undislodged, a testament to its solid construction.","translation":"その史跡標識は取り外されず、その堅牢な構造の証となった。","type":"adjective","meaning_category":"unaffected"}]}