{"word":"spayard","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(archaic) A castrated male deer; a stag that has been castrated.","english_definition":"An archaic term for a castrated male deer; a stag that has been castrated.","examples":[{"sentence":"The old hunting records mentioned a 'spayard' seen near the forest's edge.","translation":"古い狩猟記録には、森の端で見られた「去勢された雄鹿」について言及されていました。"}],"collocations":["hunting spayard","forest spayard"],"synonyms":["castrated stag","gelded stag"],"antonyms":["stag","buck"]}],"etymology":{"value":"Likely derived from 'spay,' referring to the removal of the ovaries in female animals, applied analogously to male deer.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspeɪ.ərd/","syllables":"spay-ard"},"inflection":{"noun_plural":"spayards"},"usage_notes":{"explanation":"'Spayard' is an archaic term, rarely used in modern English. It specifically refers to a male deer (stag) that has been castrated. The term is primarily found in historical texts related to hunting or animal husbandry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a spayard running in the field, it must be a female.","correct":"✓ I saw a deer running in the field.","note":"A 'spayard' is a castrated male deer, so it cannot be female. The term 'deer' is more appropriate in general contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["spay (verb: to neuter a female animal)"],"related_terms":["stag","buck","hind","doe"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very low frequency - Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Spayard' is an archaic and highly specialized term. Understanding requires familiarity with historical hunting practices and animal husbandry. It is unlikely to be encountered in contemporary English outside of academic or historical contexts."},"example_sentences":[{"sentence":"The hunter claimed to have tracked a particularly large spayard for several days.","translation":"そのハンターは、特に大きな去勢された雄鹿を数日間追跡したと主張しました。","type":"noun","meaning_category":"castrated male deer"}]}