{"word":"mono-lens","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"単焦点レンズ","english_definition":"A camera lens with a fixed focal length; a prime lens.","examples":[{"sentence":"He prefers using a mono-lens for portrait photography because of its sharpness and clarity.","translation":"彼は、そのシャープさと透明度から、ポートレート写真には単焦点レンズを使うことを好みます。"},{"sentence":"Mono-lenses are often faster and produce higher quality images than zoom lenses.","translation":"単焦点レンズは、ズームレンズよりも高速で、より高品質の画像を生成することがよくあります。"}],"collocations":["prime lens","fixed focal length lens","sharpness","clarity","portrait photography"],"synonyms":["prime lens","fixed lens"],"antonyms":["zoom lens","variable focal length lens"]},{"part_of_speech":"adjective","definition":"単焦点の","english_definition":"Relating to or using a single focal length.","examples":[{"sentence":"The mono-lens camera is popular among photography enthusiasts.","translation":"その単焦点レンズカメラは、写真愛好家の間で人気があります。"}],"collocations":["mono-lens camera","mono-lens system"],"synonyms":["single-focus","fixed-focus"],"antonyms":["zoom","variable-focus"]}],"etymology":{"value":"Combination of 'mono-' (single) and 'lens', indicating a single, fixed focal length.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒnəʊˌlɛnz/","syllables":"mo-no-lens"},"inflection":{"noun_plural":"mono-lenses"},"usage_notes":{"explanation":"'Mono-lens' is commonly used in the context of photography to refer to a lens with a fixed focal length, as opposed to a zoom lens. It is often preferred for its superior image quality and wider aperture, allowing for better low-light performance and shallower depth of field.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a mono lens to zoom in on the subject.","correct":"✓ I used a zoom lens to zoom in on the subject.","note":"A mono-lens has a fixed focal length and cannot zoom."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'mono-lens' is used in photography to describe a lens with a fixed focal length. This means it cannot zoom in or out like a zoom lens. Mono-lenses are often favored by professional photographers for their sharpness, clarity, and ability to produce images with a shallow depth of field. Understanding this term is useful for anyone interested in photography equipment and techniques."},"example_sentences":[{"sentence":"The photographer chose a 50mm mono-lens for its excellent low-light capabilities.","translation":"写真家は、優れた低照度性能のために50mmの単焦点レンズを選びました。","type":"noun","meaning_category":"単焦点レンズ"},{"sentence":"Using a mono-lens forces you to be more creative with your composition.","translation":"単焦点レンズを使うと、構図の工夫が求められ、より創造的になります。","type":"noun","meaning_category":"単焦点レンズ"}]}