{"word":"rhapsodist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"狂詩曲家、叙事詩朗誦家、熱狂的な語り手","english_definition":"A person who recites epic poems, especially one of a group of ancient Greek traveling reciters; a person who speaks or writes about something with great enthusiasm and emotion.","examples":[{"sentence":"In ancient Greece, rhapsodists traveled from town to town, reciting the works of Homer.","translation":"古代ギリシャでは、狂詩曲家は町から町へと旅をして、ホメロスの作品を朗誦した。"},{"sentence":"He became a rhapsodist for the benefits of exercise, extolling its virtues at every opportunity.","translation":"彼は運動の効能について熱狂的に語る人となり、あらゆる機会にその美徳を称賛した。"}],"collocations":["ancient rhapsodist","traveling rhapsodist","become a rhapsodist","a rhapsodist of/for something"],"synonyms":["reciter","bard","minstrel","storyteller","enthusiast","zealot","fanatic"],"antonyms":["critic","skeptic","detractor"]}],"etymology":{"value":"From the Greek word 'rhapsōidos,' meaning 'one who stitches songs together,' from 'rhaptein' (to stitch) and 'ōidē' (song, ode). Refers to the practice of ancient Greek performers who would piece together and recite epic poems.","priority":"★★★"},"pronunciation":{"ipa":"/ˈræpsədɪst/","syllables":"rhap-so-dist"},"inflection":{"noun_plural":"rhapsodists"},"usage_notes":{"explanation":"The term 'rhapsodist' has two main senses. Historically, it refers to the ancient Greek performers who recited epic poems, particularly those of Homer. In modern usage, it describes someone who speaks or writes about a particular subject with excessive enthusiasm and emotion, often in a rambling or extravagant manner. The term can sometimes carry a slightly negative connotation, suggesting that the person's enthusiasm is excessive or unfounded.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a rhapsody about the new policy.","correct":"✓ She was a rhapsodist about the new policy.","note":"'Rhapsody' is a noun referring to an enthusiastic expression of feeling, while 'rhapsodist' is a person who expresses such feelings. Use 'rhapsodist' to refer to the person."},{"incorrect":"✗ He was a rhapsodist of silence.","correct":"✓ He was a rhapsodist of nature.","note":"Rhapsodist is usually used to describe someone who is enthusiastic about something tangible or positive, such as nature, art, or a cause, rather than something abstract or negative like silence."}],"priority":"★☆☆"},"related_words":{"derivatives":["rhapsody (noun: an effusively enthusiastic or ecstatic expression of feeling)","rhapsodic (adjective: characterized by or of the nature of a rhapsody; extravagantly enthusiastic or rapturous)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. The word is not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rhapsodist' is a relatively uncommon word with two primary meanings. Historically, it refers to ancient Greek performers who recited epic poems. In modern usage, it describes someone who speaks or writes about a subject with great enthusiasm, often to an excessive degree. Understanding the historical context and the potential for a slightly negative connotation due to the excessive enthusiasm is key to using the word correctly."},"example_sentences":[{"sentence":"The rhapsodist captivated the audience with his dramatic recitation of the Iliad.","translation":"狂詩曲家はイリアスの劇的な朗誦で聴衆を魅了した。","type":"historical"},{"sentence":"He was a rhapsodist for classical music, always eager to share his passion with others.","translation":"彼はクラシック音楽の熱狂的な語り手で、常に自分の情熱を他の人と共有したがっていた。","type":"modern"}]}