{"word":"polyuria","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"多尿症","english_definition":"The excessive or abnormally large production or passage of urine (at least 2.5 liters per day in adults).","examples":[{"sentence":"Polyuria is a common symptom of diabetes mellitus.","translation":"多尿症は糖尿病の一般的な症状です。"},{"sentence":"The patient presented with polydipsia and polyuria.","translation":"その患者は多飲症と多尿症を呈した。"}],"collocations":["nocturnal polyuria (夜間多尿)","diabetes-induced polyuria (糖尿病誘発性多尿)"],"synonyms":["excessive urination","frequent urination"],"antonyms":["oliguria (乏尿)","anuria (無尿)"]},{"part_of_speech":"noun","definition":"多尿（状態）","english_definition":"The condition of producing abnormally large volumes of urine.","examples":[{"sentence":"The doctor suspected polyuria based on the patient's fluid intake and output.","translation":"医師は患者の水分摂取量と尿量に基づいて多尿を疑った。"}],"collocations":["cause of polyuria (多尿の原因)","diagnosis of polyuria (多尿の診断)"],"synonyms":["diuresis","increased urine output"],"antonyms":["decreased urine output"]}],"etymology":{"value":"From Greek 'poly-' (much, many) + 'ouron' (urine) + '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈjʊəriə/","syllables":"pol-y-u-ri-a"},"inflection":{"noun_plural":"polyurias"},"usage_notes":{"explanation":"'Polyuria' refers to the symptom of excessive urination, as well as the condition itself. It's important to differentiate it from 'frequency', which refers to the need to urinate often, but not necessarily in large volumes. Polyuria is often associated with conditions like diabetes, diabetes insipidus, and certain kidney disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has polyuria, so they must drink less water.","correct":"✓ The patient has polyuria, so we need to determine the underlying cause.","note":"Polyuria is a symptom, not a cause. Reducing water intake without addressing the underlying cause can be harmful."},{"incorrect":"✗ Polyuria is the same as urinary incontinence.","correct":"✓ Polyuria is excessive urination, while urinary incontinence is the involuntary leakage of urine.","note":"Polyuria is related to the volume of urine, while urinary incontinence is related to the control of urination."}],"priority":"★★☆"},"related_words":{"derivatives":["polyuric (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (medical terminology)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyuria' is a medical term that refers to the production of abnormally large volumes of urine. It's often a symptom of underlying medical conditions, such as diabetes. The word is formed from Greek roots, 'poly-' meaning 'much' or 'many,' and 'uria' referring to urine. It's important to distinguish it from other urinary symptoms like 'frequency' (urinating often) and 'incontinence' (involuntary leakage of urine)."},"example_sentences":[{"sentence":"Diabetes insipidus can lead to severe polyuria.","translation":"尿崩症は重度の多尿症を引き起こす可能性がある。","type":"medical","meaning_category":"多尿症"},{"sentence":"The patient's polyuria was a key factor in diagnosing their kidney problem.","translation":"患者の多尿は、腎臓の問題を診断する上で重要な要素だった。","type":"medical","meaning_category":"多尿（状態）"}]}