{"word":"unholiness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不敬虔、神聖さの欠如、邪悪さ","english_definition":"The state or quality of being unholy; lack of reverence or piety; wickedness.","examples":[{"sentence":"The unholiness of his actions shocked the community.","translation":"彼の行動の不敬虔さは地域社会に衝撃を与えた。"},{"sentence":"The temple was defiled by acts of unholiness.","translation":"その寺院は不敬な行為によって汚された。"},{"sentence":"He spoke of the unholiness of war.","translation":"彼は戦争の邪悪さについて語った。"}],"collocations":["act of unholiness (不敬な行為)","degree of unholiness (不敬虔の度合い)","essence of unholiness (邪悪さの本質)"],"synonyms":["impiety","wickedness","profanity","sacrilege","irreverence","evil","sinfulness"],"antonyms":["holiness","piety","reverence","godliness","sanctity"]}],"etymology":{"value":"\"Unholiness\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"holiness.\" \"Holiness\" itself comes from the Old English word \"hālig\" meaning \"holy\" or \"sacred.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhoʊlinəs/","syllables":"un-ho-li-ness"},"inflection":{"noun_plural":"unholinesses (rarely used)"},"usage_notes":{"explanation":"\"Unholiness\" refers to the absence of holiness or sacredness. It often implies a state of moral corruption or wickedness, particularly in a religious context. The term can describe actions, places, or even concepts that are considered profane or contrary to divine law.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unholiness is a problem in our society.","correct":"✓ Unholiness is a problem in our society.","note":"\"Unholiness\" is an uncountable noun, so it does not typically take the article \"the\" unless referring to a specific instance."},{"incorrect":"✗ He acted with unholy.","correct":"✓ He acted with unholiness.","note":"\"Unholiness\" is a noun, so it should be used to describe a state or quality, not to modify a verb. Use an adverb like \"unholily\" (though this is less common) or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["unholy (adjective: 不敬虔な、邪悪な)"],"phrases":["act of unholiness (不敬な行為)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and literary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unholiness\" is a relatively uncommon and abstract term. It is generally used in formal or religious contexts to describe a state or quality that is the opposite of holiness. This implies a lack of reverence, piety, or moral purity, often associated with wickedness or evil. Understanding the concept requires familiarity with religious or moral frameworks that define what is considered \"holy.\" Because of its abstract nature and infrequent use, it is more likely to be encountered in advanced texts or discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The priest condemned the unholiness of their rituals.","translation":"司祭は彼らの儀式の不敬虔さを非難した。","type":"noun","meaning_category":"lack of reverence"},{"sentence":"The city was known for its unholiness and corruption.","translation":"その都市は不敬虔さと堕落で知られていた。","type":"noun","meaning_category":"wickedness"},{"sentence":"He felt a deep sense of unholiness after betraying his friend.","translation":"彼は友人を裏切った後、深い不敬虔さを感じた。","type":"noun","meaning_category":"moral impurity"}]}