{"word":"Americanity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アメリカ人であること、アメリカらしさ、アメリカの国民性、アメリカの文化、アメリカの特性","english_definition":"The quality of being American; the characteristics, culture, or traits associated with the United States or its people.","examples":[{"sentence":"The author explored the concept of Americanity in his novel.","translation":"その作家は小説の中でアメリカらしさという概念を探求した。"},{"sentence":"Scholars often debate the defining features of Americanity.","translation":"学者たちはアメリカらしさを定義する特徴についてよく議論する。"},{"sentence":"The museum exhibit showcased various aspects of Americanity through art and artifacts.","translation":"その博物館の展示は、芸術と工芸品を通してアメリカらしさの様々な側面を紹介した。"}],"collocations":["essence of Americanity","aspects of Americanity","defining Americanity","preserve Americanity"],"synonyms":["Americanism","Americanness","national character","national identity"],"antonyms":["un-Americanity","foreignness"]}],"etymology":{"value":"Formed from \"American\" + \"-ity\" (a suffix used to form nouns expressing a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌmerɪkəˈnɪti/","syllables":"A-mer-i-ca-ni-ty"},"inflection":{"noun_plural":"Americanities (rarely used)"},"usage_notes":{"explanation":"\"Americanity\" is a relatively uncommon and somewhat academic term. It is used to discuss the abstract qualities and characteristics that define what it means to be American. It can refer to cultural values, historical experiences, social norms, and other elements that contribute to a sense of national identity. It is often used in scholarly or philosophical contexts when analyzing American culture or society.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Americanity is very strong in New York.","correct":"✓ The sense of Americanity is very strong in New York.","note":"\"Americanity\" is an abstract concept, so it's better to use phrases like \"sense of Americanity\" or \"aspects of Americanity\"."},{"incorrect":"✗ He showed a lot of Americanity during his visit.","correct":"✓ He showed a lot of American spirit during his visit. / ✓ He demonstrated many American values during his visit.","note":"For showing traits, it's more common to use \"American spirit,\" \"American values,\" or other similar phrases."}],"priority":"★★☆"},"related_words":{"derivatives":["American (adjective, noun)","Americanism (noun)","Americanize (verb)"],"phrases":["American dream","American spirit","American values"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare in general use)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Americanity\" is a complex and abstract term that refers to the qualities, characteristics, and culture associated with being American. It's not a commonly used word in everyday conversation but is more often found in academic or philosophical discussions about American identity and culture. Understanding this word requires a good grasp of abstract concepts and the ability to analyze cultural nuances."},"example_sentences":[{"sentence":"The study aimed to understand how globalization impacts Americanity.","translation":"その研究は、グローバル化がアメリカらしさにどのように影響を与えるかを理解することを目的としていた。","type":"noun","meaning_category":"American culture"},{"sentence":"Some argue that individualism is a core component of Americanity.","translation":"個人主義はアメリカらしさの中核的な要素であると主張する人もいる。","type":"noun","meaning_category":"American characteristics"},{"sentence":"The film explored the changing nature of Americanity in the 21st century.","translation":"その映画は、21世紀におけるアメリカらしさの変化する性質を探求した。","type":"noun","meaning_category":"American identity"}]}