{"word":"countermigration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"帰還移住、逆移住、再移住","english_definition":"The return of migrants to their region of origin.","examples":[{"sentence":"Countermigration is often driven by economic downturns in the host country.","translation":"帰還移住は、しばしば受け入れ国の景気後退によって引き起こされる。"},{"sentence":"The government is trying to encourage countermigration by offering incentives to returning citizens.","translation":"政府は帰国する市民にインセンティブを提供することで、帰還移住を奨励しようとしている。"},{"sentence":"Countermigration can have significant impacts on both the host and origin countries.","translation":"帰還移住は、受け入れ国と出身国の両方に大きな影響を与える可能性がある。"}],"collocations":["reverse migration","return migration","migration reversal","economic countermigration","voluntary countermigration","forced countermigration"],"synonyms":["return migration","reverse migration","repatriation"],"antonyms":["emigration","immigration","migration"],"notes":"Countermigration is a specific type of migration that involves the return of people to their original homes or regions after a period of migration to another location. It can be driven by various factors, including economic, social, and political reasons."}],"etymology":{"value":"The word is formed by adding the prefix 'counter-' (meaning 'opposite' or 'against') to 'migration'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkaʊntərmaɪˈɡreɪʃən/","syllables":"coun-ter-mi-gra-tion"},"inflection":{"noun_plural":"countermigrations"},"usage_notes":{"explanation":"Countermigration is a term used in demography, geography, and sociology to describe the phenomenon of people returning to their place of origin after having migrated elsewhere. It is often studied in the context of economic factors, such as job losses or retirement, but can also be influenced by social and political factors, such as family ties or changes in government policies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The countermigration was caused by immigration.","correct":"✓ The countermigration was caused by the failure of the initial immigration.","note":"Countermigration is a response to previous migration, not directly caused by immigration itself. It's important to clarify the relationship between the two."},{"incorrect":"✗ Countermigration only affects the origin country.","correct":"✓ Countermigration affects both the origin and host countries.","note":"Countermigration has impacts on both the country that migrants are leaving and the country they are returning to."}],"priority":"★★☆"},"related_words":{"derivatives":["countermigrant (noun)"],"phrasal_verbs":[],"related_terms":["migration","emigration","immigration","returnee","diaspora"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Countermigration' refers to the phenomenon of people returning to their original place of residence after having migrated elsewhere. This term is often used in academic and policy discussions related to population movement and its effects on both the areas people leave and the areas they return to. Understanding this term helps in analyzing complex migration patterns and their socio-economic consequences."},"example_sentences":[{"sentence":"The economic crisis led to significant **countermigration** from urban centers to rural areas.","translation":"経済危機により、都市部から農村部への大規模な帰還移住が発生した。","type":"noun","meaning_category":"帰還移住"},{"sentence":"Government policies aimed at regional development can encourage **countermigration**.","translation":"地域開発を目的とした政府の政策は、帰還移住を促進することができる。","type":"noun","meaning_category":"帰還移住"},{"sentence":"The study examined the social and economic factors influencing **countermigration** in the region.","translation":"その研究では、その地域における帰還移住に影響を与える社会的および経済的要因を調査した。","type":"noun","meaning_category":"帰還移住"}]}