{"word":"adstipulator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) (古代ローマ法において)債権者のために債務者から追加の約束を取り付ける人、副債権者","english_definition":"(law) (in ancient Roman law) a secondary creditor who obtains a supplementary promise from the debtor for the benefit of the primary creditor.","examples":[{"sentence":"The adstipulator ensured that the debtor was fully committed to fulfilling the obligations.","translation":"副債権者は、債務者が義務を完全に履行することを保証した。"},{"sentence":"In Roman law, the adstipulator provided an extra layer of security for the creditor.","translation":"ローマ法において、副債権者は債権者に追加の安全層を提供した。"}],"collocations":["act as adstipulator","appoint an adstipulator","the role of adstipulator"],"synonyms":["secondary creditor","co-creditor","guarantor"],"antonyms":["debtor","principal creditor"]}],"etymology":{"value":"Derived from Latin: ad- (to, towards) + stipulator (one who stipulates, promises formally).","priority":"★★☆"},"pronunciation":{"ipa":"ædˈstɪpjʊleɪtər","syllables":"ad-stip-u-la-tor"},"inflection":{"noun_plural":"adstipulators"},"usage_notes":{"explanation":"The term 'adstipulator' is specific to ancient Roman law and refers to a person who secures an additional promise from a debtor to the benefit of the primary creditor. This role provided an extra layer of assurance for the creditor. The term is rarely used in modern legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the adstipulator of the contract.","correct":"✓ He acted as the adstipulator in the contract.","note":"It's more accurate to say someone 'acted as' or 'served as' the adstipulator, rather than 'was' the adstipulator, as it describes a specific role or function within a legal context."}],"priority":"★☆☆"},"related_words":{"derivatives":["stipulate (verb): to demand or specify (a requirement), typically as part of a bargain or agreement.","stipulation (noun): a condition or requirement that is specified or demanded as part of an agreement."],"related_terms":["stipulatio (Latin noun): a formal promise or contract in Roman law."]},"level_frequency":{"CEFR":"N/A (specialized legal term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'adstipulator' is a highly specialized term from ancient Roman law. It refers to an individual who obtains a supplementary promise from a debtor to reinforce the primary obligation to the main creditor. This term is rarely encountered outside of historical legal studies. Understanding requires knowledge of Roman legal concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The adstipulator's presence ensured the debtor understood the seriousness of the agreement.","translation":"副債権者の存在は、債務者が契約の重大性を理解していることを保証した。","type":"noun","meaning_category":"legal role"},{"sentence":"In ancient Rome, the adstipulator played a vital role in securing financial transactions.","translation":"古代ローマでは、副債権者は金融取引を確保する上で重要な役割を果たした。","type":"noun","meaning_category":"historical context"}]}