{"word":"square-toedness","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being square-toed; adherence to conservative or traditional values and beliefs.","english_definition":"The quality or state of being square-toed; adherence to conservative or traditional values and beliefs.","examples":[{"sentence":"His square-toedness made him unpopular with the younger generation.","translation":"彼の保守的な考え方は、若い世代には不人気だった。"},{"sentence":"The square-toedness of the community was reflected in its strict social norms.","translation":"そのコミュニティの保守性は、厳格な社会規範に反映されていた。"}],"collocations":["exhibit square-toedness","a display of square-toedness"],"synonyms":["conservatism","conventionality","traditionalism","orthodoxy"],"antonyms":["progressivism","liberalism","unconventionality"]}],"etymology":{"value":"Derived from 'square-toed', referring to shoes with a square toe, often associated with older, more conservative styles. The suffix '-ness' is added to form a noun indicating a state or quality.","priority":"Medium"},"pronunciation":{"ipa":"/ˈskwɛərˌtoʊɪdnəs/","syllables":"square-toed-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Square-toedness' is often used to describe a person or community that is resistant to change and adheres strictly to traditional values. It can carry a slightly negative connotation, suggesting a lack of open-mindedness or adaptability.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The square-toedness of the building's architecture was impressive.","correct":"✓ The conservative design of the building's architecture was impressive.","note":"'Square-toedness' typically refers to attitudes or beliefs, not physical objects."}],"priority":"Low"},"related_words":{"derivatives":["square-toed (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Square-toedness' is a relatively uncommon word used to describe adherence to traditional or conservative values. It is often used in a critical or humorous way to suggest that someone is old-fashioned or resistant to change. The word is derived from the term 'square-toed,' which refers to shoes with a square toe, a style often associated with older generations. Understanding the historical and cultural context of the term is essential for comprehending its meaning."},"example_sentences":[{"sentence":"The professor's square-toedness was evident in his outdated teaching methods.","translation":"その教授の保守性は、時代遅れの教育方法に明らかだった。","type":"General","meaning_category":"Attitude"},{"sentence":"Despite his youth, he displayed a surprising degree of square-toedness in his views on social issues.","translation":"若いのにもかかわらず、彼は社会問題に対する見解において驚くほど保守的な考え方を示した。","type":"General","meaning_category":"Attitude"}]}