{"word":"Phacella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物)ハゼリソウ属","english_definition":"A genus of plants in the family Boraginaceae, commonly known as scorpionweeds or heliotrope.","examples":[{"sentence":"The meadow was filled with blooming Phacella flowers.","translation":"その牧草地は咲き誇るハゼリソウ属の花でいっぱいだった。"}],"collocations":["Phacella tanacetifolia (コンギクバレンギク)","Phacella flower","cultivate Phacella"],"synonyms":["scorpionweed","heliotrope"],"antonyms":[]}],"etymology":{"value":"New Latin, from Ancient Greek 'phakelos' (bundle), referring to the clustered arrangement of the flowers in some species.","priority":"★★☆"},"pronunciation":{"ipa":"/fəˈsɛlə/","syllables":"pha-cel-la"},"inflection":{"noun_plural":"Phacellas"},"usage_notes":{"explanation":"'Phacella' refers to a specific genus of plants. It is primarily used in botanical contexts or when discussing gardening and wildflowers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful phacella in my garden, it was a rose.","correct":"✓ I saw a beautiful flower in my garden, it was a phacella.","note":"Phacella is a specific type of flower, not a general term for all flowers."}],"priority":"★☆☆"},"related_words":{"derivatives":["Phacelia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Phacella' is a technical term used in botany and gardening to refer to a specific genus of plants known as scorpionweeds. It is unlikely to be encountered in everyday conversation and is primarily used in specialized contexts. Understanding its meaning requires some knowledge of plant taxonomy."},"example_sentences":[{"sentence":"The bee was attracted to the vibrant purple flowers of the Phacella.","translation":"ミツバチはハゼリソウ属の鮮やかな紫色の花に引き寄せられた。","type":"noun","meaning_category":"ハゼリソウ属"},{"sentence":"Phacella is often planted as a cover crop to improve soil health.","translation":"ハゼリソウ属は、土壌の健康を改善するための被覆作物としてよく植えられます。","type":"noun","meaning_category":"ハゼリソウ属"}]}