{"word":"autocamping","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オートキャンプ","english_definition":"Camping at a designated campsite where you can park your car next to your tent.","examples":[{"sentence":"We went autocamping in the mountains last weekend.","translation":"先週末、私たちは山でオートキャンプに行きました。"},{"sentence":"Autocamping is a convenient way to enjoy nature without having to carry all your gear.","translation":"オートキャンプは、すべての道具を運ぶ必要なく自然を楽しむ便利な方法です。"}],"collocations":["go autocamping","autocamping site","autocamping equipment"],"synonyms":["car camping"],"antonyms":["backpacking","wilderness camping"]}],"etymology":{"value":"A compound word combining 'auto' (referring to automobile) and 'camping'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔːtoʊˌkæmpɪŋ/","syllables":"au-to-camp-ing"},"inflection":{"noun_plural":"autocampings"},"usage_notes":{"explanation":"'Autocamping' specifically refers to camping at a site where you can drive your car directly to your campsite. This makes it easier to transport camping gear and often involves more amenities than traditional backpacking or wilderness camping. It is particularly popular among families and those who prefer a more comfortable camping experience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went camping, but it was not autocamping because I had to walk a mile to the site.","correct":"✓ I went camping, but it was not autocamping because I had to walk a mile to the site. That was more like backpacking.","note":"Autocamping requires direct vehicle access to the campsite. If you have to walk a significant distance, it's not considered autocamping."}],"priority":"★★☆"},"related_words":{"derivatives":["autocamper"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively low frequency, specific to camping contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Autocamping' is a type of camping where you can park your car right next to where you set up your tent. This makes it easier to bring lots of equipment and is good for people who want a comfortable camping experience. It's different from backpacking where you have to carry everything on your back.","priority":"★★★"},"example_sentences":[{"sentence":"The autocamping site had picnic tables and fire pits.","translation":"そのオートキャンプ場にはピクニックテーブルと焚き火台がありました。","type":"noun","meaning_category":"Camping"},{"sentence":"We prefer autocamping because it's easier with small children.","translation":"小さな子供がいるので、私たちはオートキャンプの方が好きです。","type":"noun","meaning_category":"Camping"},{"sentence":"Is this autocamping site pet-friendly?","translation":"このオートキャンプ場はペットフレンドリーですか？","type":"noun","meaning_category":"Camping"}]}