{"word":"mass-house","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(歴史的) カトリックのミサを行うための、目立たない、または秘密の場所。特に、カトリックが禁止されていた時代に用いられた。","english_definition":"(historical) An inconspicuous or secret place for Catholic Mass, especially during times when Catholicism was prohibited.","examples":[{"sentence":"During the Penal Laws, Irish Catholics often had to worship in mass-houses hidden in the countryside.","translation":"刑罰法時代、アイルランドのカトリック教徒はしばしば田舎に隠されたミサハウスで礼拝しなければならなかった。"},{"sentence":"The old barn was rumored to have served as a mass-house during the Reformation.","translation":"その古い納屋は、宗教改革の時代にミサハウスとして使われていたと噂されている。"}],"collocations":["hidden mass-house","secret mass-house","old mass-house"],"synonyms":["chapel","oratory","meeting place","place of worship"],"antonyms":[]}],"etymology":{"value":"\"Mass\" (ミサ) + \"house\" (家) の複合語。カトリックのミサを行うための場所を指す。特に、カトリックの信仰が公に認められていなかった時代に、秘密裏にミサを行うために使用された場所を指すことが多い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmæsˌhaʊs/","syllables":"mass-house"},"inflection":{"noun_plural":"mass-houses"},"usage_notes":{"explanation":"\"mass-house\" は歴史的な文脈で使用されることがほとんどで、カトリック教徒が迫害されていた時代に、秘密裏にミサを行うために使用された場所を指します。アイルランドやイングランドなどの国で、カトリックが禁止されていた時代によく見られました。現代では、カトリック教会は公に存在するため、この言葉はあまり使われません。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We go to the mass-house every Sunday.","correct":"✓ We go to church every Sunday.","note":"現代では、通常の教会に行く場合は \"church\" を使用します。\"mass-house\" は歴史的な文脈でのみ使用します。"},{"incorrect":"✗ The mass-house is a large, ornate building.","correct":"✓ The mass-house was often a small, hidden building.","note":"\"mass-house\" は通常、目立たない場所にあるため、大きな装飾的な建物ではありませんでした。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["penal laws","catholic emancipation","clandestine","persecution","roman catholic","mass"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史的な用語)","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**mass-house**」は、カトリック教徒が迫害されていた時代に、秘密裏にミサを行うために使用された場所を指す歴史的な用語です。この言葉は、カトリックが禁止されていた時代のアイルランドやイングランドなどでよく使われました。現代では、カトリック教会は公に存在するため、この言葉はほとんど使われません。この単語を理解するには、歴史的な背景知識が必要です。"},"example_sentences":[{"sentence":"The ruins of the old farm were said to contain a hidden mass-house where priests secretly celebrated Mass.","translation":"その古い農場の廃墟には、司祭が密かにミサを執り行った隠されたミサハウスがあったと言われている。","type":"noun","meaning_category":"歴史的な場所"},{"sentence":"During the 18th century, many Irish Catholics risked imprisonment to attend services in a mass-house.","translation":"18世紀の間、多くのアイルランドのカトリック教徒はミサハウスでの礼拝に参加するために投獄される危険を冒した。","type":"noun","meaning_category":"歴史的な場所"},{"sentence":"Local folklore spoke of a mass-house hidden in the woods, used during the time of religious persecution.","translation":"地元の伝承では、宗教的迫害の時代に使われた、森の中に隠されたミサハウスについて語られていた。","type":"noun","meaning_category":"歴史的な場所"}]}