{"word":"Slavicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スラヴ語からの借用語、またはスラヴ語の特徴が他の言語に現れたもの","english_definition":"A word or idiom borrowed from a Slavic language into another language; a feature characteristic of Slavic languages appearing in another language.","examples":[{"sentence":"The word 'robot' is a Slavicism, originating from the Czech word 'robota'.","translation":"「ロボット」という言葉はスラヴ語からの借用語であり、チェコ語の「robota」に由来する。"},{"sentence":"The perfective/imperfective aspect distinction in verbs, though not unique to Slavic languages, is a prominent Slavicism in languages that have borrowed it.","translation":"動詞の完了相/未完了相の区別は、スラヴ語に特有のものではないが、それを借用した言語においては顕著なスラヴ語の特徴である。"}],"collocations":["linguistic Slavicism","lexical Slavicism","grammatical Slavicism"],"synonyms":["Slavic borrowing","Slavic influence"],"antonyms":[]}],"etymology":{"value":"Formed from 'Slavic' + '-ism'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈslɑːvɪsɪzəm/","syllables":"Sla-vi-ci-sm"},"inflection":{"noun_plural":"Slavicisms"},"usage_notes":{"explanation":"'Slavicism' refers to linguistic elements (words, grammatical structures, etc.) that have originated in Slavic languages and found their way into other languages. It's used in linguistics to describe such borrowings or influences. The term can also refer to features that are characteristic of Slavic languages even when they appear in non-Slavic languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He speaks Slavicism fluently.","correct":"✓ He is familiar with Slavicisms.","note":"'Slavicism' is a noun referring to the linguistic element itself, not a language. You wouldn't 'speak' a Slavicism, but rather be familiar with or study Slavicisms."}],"priority":"★★☆"},"related_words":{"derivatives":["Slavic","Slav","Slavophile"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Slavicism' is a technical term used in linguistics. It refers to a word, phrase, or grammatical feature that comes from a Slavic language and is used in another language. Understanding this word requires familiarity with linguistic terminology and the concept of language borrowing."},"example_sentences":[{"sentence":"Many Polish loanwords in Ukrainian are considered Slavicisms.","translation":"ウクライナ語における多くのポーランド語からの借用語はスラヴ語からの借用語とみなされる。","type":"noun","meaning_category":"borrowed word"},{"sentence":"The influence of Russian on the languages of Central Asia has resulted in numerous Slavicisms in their vocabulary.","translation":"中央アジアの言語に対するロシア語の影響は、それらの語彙に多数のスラヴ語からの借用語をもたらした。","type":"noun","meaning_category":"influence"}]}