{"word":"laparosalpingectomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腹腔鏡下卵管切除術","english_definition":"Surgical removal of a fallopian tube (salpingectomy) performed using laparoscopy.","examples":[{"sentence":"Laparosalpingectomy is a common treatment for ectopic pregnancy.","translation":"腹腔鏡下卵管切除術は、異所性妊娠の一般的な治療法です。"},{"sentence":"She underwent a laparosalpingectomy to remove a damaged fallopian tube.","translation":"彼女は損傷した卵管を除去するために腹腔鏡下卵管切除術を受けた。"}],"collocations":["unilateral laparosalpingectomy (片側の腹腔鏡下卵管切除術)","bilateral laparosalpingectomy (両側の腹腔鏡下卵管切除術)"],"synonyms":["salpingectomy (卵管切除術)","laparoscopic salpingectomy (腹腔鏡下卵管切除術)"],"antonyms":[]}],"etymology":{"value":"The word is derived from the combination of 'laparo-' (referring to the abdomen), 'salpingo-' (referring to the fallopian tube), and '-ectomy' (surgical removal).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌlæpərəˌsælpɪŋˈɡektəmi/","syllables":"lap-a-ro-sal-ping-ec-to-my"},"inflection":{"noun_plural":"laparosalpingectomies"},"usage_notes":{"explanation":"Laparosalpingectomy is a minimally invasive surgical procedure used to remove a fallopian tube. It is often performed to treat ectopic pregnancies, infections, or other fallopian tube abnormalities. The procedure involves making small incisions in the abdomen and using a laparoscope (a thin, flexible tube with a camera) to visualize and remove the fallopian tube.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ laparosalpingectomy is a procedure to remove the uterus.","correct":"✓ Laparosalpingectomy is a procedure to remove a fallopian tube.","note":"Laparosalpingectomy removes the fallopian tube, not the uterus."}],"priority":"★☆☆"},"related_words":{"derivatives":["laparoscopy (腹腔鏡検査)","salpingectomy (卵管切除術)","oophorectomy (卵巣摘出術)","hysterectomy (子宮摘出術)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Laparosalpingectomy' is a highly specialized medical term referring to the surgical removal of a fallopian tube using a laparoscopic technique. This term is primarily encountered in medical contexts, such as surgical reports, medical textbooks, or discussions among healthcare professionals. Understanding this term requires a strong background in medical terminology and surgical procedures. Due to its specificity, it is not commonly used in general conversation or writing."},"example_sentences":[{"sentence":"The patient underwent a successful laparosalpingectomy to treat her ectopic pregnancy.","translation":"患者は異所性妊娠の治療のために、成功裡に腹腔鏡下卵管切除術を受けた。","type":"medical","meaning_category":"surgical procedure"}]}