{"word":"planetology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"惑星学、遊星学","english_definition":"the scientific study of planets, moons, and other celestial bodies in planetary systems.","examples":[{"sentence":"Planetology is a multidisciplinary field that combines geology, astronomy, and physics.","translation":"惑星学は、地質学、天文学、物理学を組み合わせた学際的な分野です。"},{"sentence":"Advances in space exploration have greatly contributed to the progress of planetology.","translation":"宇宙探査の進歩は、惑星学の発展に大きく貢献しています。"},{"sentence":"A planetologist studies the composition, structure, and evolution of planets.","translation":"惑星学者は、惑星の組成、構造、進化を研究します。"}],"collocations":["planetary science","space exploration","planetary geology","planetary atmosphere","planetary surface","planetary system"],"synonyms":["planetary science","astrogeology","exogeology"],"antonyms":[]}],"etymology":{"value":"'Planet'（惑星）と '-ology'（～学）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌplænɪˈtɒlədʒi/","syllables":"plan-et-ol-o-gy"},"inflection":{"noun_plural":"planetologies (まれに複数形で使われる)"},"usage_notes":{"explanation":"Planetology is a broad scientific field that encompasses the study of various aspects of planets, moons, asteroids, comets, and other celestial bodies. It involves understanding their formation, composition, structure, atmosphere, surface features, and geological processes. Planetology relies on data collected from telescopes, spacecraft missions, and laboratory experiments. It aims to provide insights into the origin and evolution of planetary systems, including our own solar system, and to search for potentially habitable environments beyond Earth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a planetologist doctor.","correct":"✓ He is a planetologist.","note":"'Planetologist' はすでに専門家を指す言葉なので、'doctor' を加える必要はありません。"},{"incorrect":"✗ Planetology is only about Earth-like planets.","correct":"✓ Planetology studies all kinds of planets, moons, and other celestial bodies.","note":"惑星学は地球型惑星だけでなく、あらゆる種類の惑星、衛星、その他の天体を研究対象とします。"}],"priority":"★★☆"},"related_words":{"derivatives":["planetologist (名詞: 惑星学者)","planetary (形容詞: 惑星の)","astrogeology (名詞: 宇宙地質学)","exogeology (名詞: 外惑星地質学)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Planetology' is a specialized term referring to the scientific study of planets, moons, and other celestial bodies. It is a multidisciplinary field that requires knowledge of astronomy, geology, physics, and chemistry. Understanding the term requires a scientific background and familiarity with space exploration and planetary science concepts. It is typically used in academic or research contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Mars rovers have provided valuable data for planetology research.","translation":"火星探査車は、惑星学の研究に貴重なデータを提供してきました。","type":"general","meaning_category":"惑星学の研究"},{"sentence":"Planetology helps us understand the formation of our solar system.","translation":"惑星学は、私たちの太陽系の形成を理解するのに役立ちます。","type":"general","meaning_category":"太陽系の形成"},{"sentence":"She is a leading expert in the field of planetology.","translation":"彼女は惑星学の分野における第一人者です。","type":"general","meaning_category":"惑星学の専門家"}]}