{"word":"Multiplexers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形の multiplexer) 多重化装置、マルチプレクサ","english_definition":"(plural of multiplexer) An electronic device that selects one of several input signals and forwards it to a single output line.","examples":[{"sentence":"Multiplexers are used in communication systems to transmit multiple signals over a single channel.","translation":"マルチプレクサは、通信システムにおいて、複数の信号を単一のチャネルで伝送するために使用されます。"},{"sentence":"The multiplexers in this circuit allow us to reduce the number of wires needed.","translation":"この回路のマルチプレクサにより、必要な配線の数を減らすことができます。"}],"collocations":["analog multiplexer","digital multiplexer","multiplexer circuit","multiplexer design","multiplexer application"],"synonyms":["MUX","data selector"],"antonyms":["demultiplexer","DEMUX"]},{"part_of_speech":"noun","definition":"(複数形の multiplexer) 複合映画館、シネマコンプレックス","english_definition":"(plural of multiplexer) A movie theater complex with multiple screens.","examples":[{"sentence":"We're going to the multiplexers tonight to see the new action movie.","translation":"今夜、新しいアクション映画を観に複合映画館に行きます。"},{"sentence":"The multiplexers offers a wide variety of films.","translation":"その複合映画館では、多種多様な映画が上映されています。"}],"collocations":["multiplexer cinema","multiplexer theater","multiplexer screen","go to the multiplexers"],"synonyms":["cinema complex","movie theater complex"],"antonyms":["single-screen cinema"]}],"etymology":{"value":"'Multiplexer' is a portmanteau of 'multiple' and 'plexer' (from 'complex'). It reflects the device's ability to handle multiple inputs and combine them into a single output.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌltɪˌplɛksərz/","syllables":"mul-ti-plex-ers"},"inflection":{"noun_plural":"multiplexers"},"usage_notes":{"explanation":"The word 'multiplexers' can refer to either electronic devices used in signal processing or movie theater complexes. The context usually makes the meaning clear. In electronics, it's often shortened to 'MUX'. When referring to cinemas, 'multiplex' is more common than 'multiplexers'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a multiplexer for my home theater, so I can watch different movies at the same time.","correct":"✓ I need a multi-zone receiver/amplifier for my home theater, so I can watch different movies in different rooms at the same time.","note":"Multiplexers do not allow for watching different movies at the same time. It is used to select one of several input signals and forwards it to a single output line. Multi-zone receivers/amplifiers are used for home theaters to watch different movies at the same time."}],"priority":"★★☆"},"related_words":{"derivatives":["multiplex (verb, adjective)","multiplexing (noun)","demultiplexer (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'multiplexers' has two primary meanings: one in electronics and one in entertainment. In electronics, it refers to a device that selects one of several input signals and outputs it to a single line. In the context of entertainment, it refers to a movie theater complex with multiple screens. Understanding the context is crucial to correctly interpret the meaning of the word. The electronics meaning is more technical, while the cinema meaning is more common in everyday conversation."},"example_sentences":[{"sentence":"The communication system uses multiplexers to efficiently transmit data.","translation":"その通信システムは、データを効率的に伝送するためにマルチプレクサを使用しています。","type":"noun","meaning_category":"多重化装置"},{"sentence":"We went to the multiplexers to see a movie last night.","translation":"昨夜、映画を観に複合映画館に行きました。","type":"noun","meaning_category":"複合映画館"}]}