{"word":"Arctico-Altaic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"北極アルタイ語族：かつて提唱された仮説上の語族で、ウラル語族、ユカギール語族、チュクチ・カムチャツカ語族、ニヴフ語、アイヌ語、朝鮮語、日本語、琉球語、アルタイ諸語（テュルク語族、モンゴル語族、ツングース語族）を含むとされた。現在では、この語族の存在は広く否定されている。","english_definition":"A hypothetical language family formerly proposed to include the Uralic, Yukaghir, Chukotko-Kamchatkan, Nivkh, Ainu, Korean, Japanese, Ryukyuan, and Altaic (Turkic, Mongolic, Tungusic) language families. The existence of this language family is now widely rejected.","examples":[{"sentence":"The Arctico-Altaic theory was once considered a possible explanation for the similarities between certain Eurasian languages.","translation":"かつて、北極アルタイ語族説は、ユーラシアのいくつかの言語間の類似性を説明する可能性のある理論と考えられていた。"},{"sentence":"Modern linguistic research has largely discredited the Arctico-Altaic hypothesis.","translation":"現代の言語学研究は、北極アルタイ語族仮説をほとんど否定している。"}],"collocations":["Arctico-Altaic hypothesis","Arctico-Altaic theory"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Arctico-\" (北極の) + \"Altaic\" (アルタイ語族) の合成語。これらの語族が地理的に関連しているという仮説に基づいている。","priority":"★☆☆"},"pronunciation":{"ipa":"ˌɑːrk.tɪ.koʊ.ælˈteɪ.ɪk","syllables":"Arc-ti-co-Al-tai-ic"},"inflection":{"notes":"名詞（語族の名前）として使われる。形容詞としても使われることがある（例：Arctico-Altaic languages）。"},"usage_notes":{"explanation":"\"Arctico-Altaic\" は、現代の言語学ではほとんど支持されていない仮説です。この語族の存在を主張する研究は、一般的に古い文献に見られます。現代の研究では、これらの言語間の類似性は、言語接触や借用によるものと考えられています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Arctico-Altaic is a proven language family.","correct":"✓ Arctico-Altaic is a discredited language family hypothesis.","note":"北極アルタイ語族は、証明された語族ではなく、むしろ否定された仮説である。"},{"incorrect":"✗ All linguists agree on the validity of Arctico-Altaic.","correct":"✓ Most linguists do not accept the Arctico-Altaic hypothesis.","note":"ほとんどの言語学者は、北極アルタイ語族仮説を受け入れていない。"}],"priority":"★★☆"},"related_words":{"derivatives":["Altaic (アルタイ語族)","Uralic (ウラル語族)"],"phrases":["language family","language isolate","linguistic reconstruction","comparative linguistics"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 言語学の専門分野でのみ使われる。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「Arctico-Altaic」は、言語学の専門用語であり、言語学を専門とする人以外には馴染みのない言葉です。この用語は、かつて提唱された仮説上の語族を指し、複数の異なる語族（ウラル語族、アルタイ語族など）が含まれるとされていました。現代の言語学では、この仮説は広く否定されており、この語族の存在は認められていません。この用語を理解するには、言語学の基礎知識、特に語族と歴史言語学に関する知識が必要です。"},"example_sentences":[{"sentence":"The **Arctico-Altaic** hypothesis suggests a common origin for languages spoken across vast areas of Eurasia.","translation":"北極アルタイ語族仮説は、ユーラシアの広大な地域で話されている言語の共通の起源を示唆している。","type":"noun","meaning_category":"語族"},{"sentence":"Despite some superficial similarities, the evidence for an **Arctico-Altaic** grouping remains unconvincing to most historical linguists.","translation":"いくつかの表面的な類似性にもかかわらず、北極アルタイ語族のグループ化の証拠は、ほとんどの歴史言語学者にとって説得力がないままである。","type":"noun","meaning_category":"語族"}]}