{"word":"indescribability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"言葉では言い表せないこと、筆舌に尽くしがたいこと","english_definition":"The quality of being beyond description; the state of being impossible to describe adequately.","examples":[{"sentence":"The indescribability of the sunset left her speechless.","translation":"その夕日の言葉では言い表せない美しさは、彼女を言葉を失わせた。"},{"sentence":"He struggled with the indescribability of his grief.","translation":"彼は、自分の悲しみを言葉で表現できないことに苦しんだ。"},{"sentence":"The indescribability of the experience made it all the more profound.","translation":"その経験が言葉では言い表せないものであったことが、それをさらに深遠なものにした。"}],"collocations":["sheer indescribability","utter indescribability","inherent indescribability"],"synonyms":["ineffability","unspeakableness","unutterableness","unexpressiveness"],"antonyms":["describability","definability","expressibility"]}],"etymology":{"value":"Formed from 'indescribable' (not able to be described) + '-ity' (a suffix forming nouns expressing a state or quality). 'Indescribable' is from 'in-' (not) + 'describable' (able to be described), which in turn comes from 'describe'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˌskraɪbəˈbɪləti/","syllables":"in-di-scri-ba-bil-i-ty"},"inflection":{"noun_plural":"indescribabilities (rarely used)"},"usage_notes":{"explanation":"'Indescribability' is a noun that refers to the quality or state of something being impossible or very difficult to describe adequately with words. It emphasizes the inadequacy of language to capture the essence of something, often due to its complexity, intensity, or uniqueness. It is a relatively uncommon word, typically used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The indescribability was amazing.","correct":"The indescribability of the view was amazing.","note":"'Indescribability' needs a subject to which it applies. It's better to specify what is indescribable."},{"incorrect":"He felt indescribability.","correct":"He felt the indescribability of the moment. / He felt something indescribable.","note":"'Indescribability' is a quality, not a feeling itself. It's better to say he felt the indescribability *of something* or that he felt something indescribable."}],"priority":"★★☆"},"related_words":{"derivatives":["indescribable (adjective)","describe (verb)","description (noun)"],"phrasal_verbs":[],"related_concepts":["ineffable","transcendent","sublime"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indescribability' is a complex noun that refers to the quality of something being impossible or extremely difficult to describe. It is used when words fail to capture the essence or nature of something, often due to its profoundness, complexity, or uniqueness. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or literary contexts where the inadequacy of language is being emphasized."},"example_sentences":[{"sentence":"The sheer indescribability of the aurora borealis left the tourists in awe.","translation":"オーロラの見事なまでの言葉では言い表せない美しさに、観光客たちは畏敬の念を抱いた。","type":"noun","meaning_category":"言葉では言い表せないこと"},{"sentence":"The poet attempted to capture the indescribability of love in his verses.","translation":"詩人は、愛の言葉では言い表せない性質を詩に表現しようと試みた。","type":"noun","meaning_category":"言葉では言い表せないこと"},{"sentence":"The witness struggled to convey the indescribability of the crime scene.","translation":"目撃者は、犯罪現場の言葉では言い表せない状況を伝えようと苦労した。","type":"noun","meaning_category":"言葉では言い表せないこと"}]}