{"word":"Solanum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ナス属","english_definition":"A large and diverse genus of flowering plants in the nightshade family, Solanaceae, that includes many familiar species such as potatoes, tomatoes, eggplants, and nightshades.","examples":[{"sentence":"The potato belongs to the genus Solanum.","translation":"ジャガイモはナス属に属する。"},{"sentence":"Many species of Solanum are cultivated for food.","translation":"多くのナス属の種が食用として栽培されている。"}],"collocations":["Solanum tuberosum (ジャガイモの学名)","Solanum lycopersicum (トマトの学名)","Solanum melongena (ナスの学名)"],"synonyms":["nightshade","Solanaceae"],"antonyms":[]}],"etymology":{"value":"New Latin, from Latin solanum, of uncertain origin. Possibly from sol, \"sun\", referring to the plant's need for sunlight, or from solamen, \"soothing\", referring to the plant's supposed medicinal properties.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈleɪnəm/","syllables":"So-la-num"},"inflection":{"noun_plural":"Solanums"},"usage_notes":{"explanation":"'Solanum' is a taxonomic rank, specifically a genus. It is used in scientific contexts, especially in botany, agriculture, and horticulture. When referring to a specific plant within the genus, the species name is added (e.g., Solanum tuberosum for potato).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted Solanum in my garden.","correct":"✓ I planted tomatoes (Solanum lycopersicum) in my garden.","note":"It's more common to refer to specific plants by their common names (e.g., tomatoes) rather than just the genus name unless in a scientific context."}],"priority":"★☆☆"},"related_words":{"derivatives":["Solanaceous (adjective: relating to or belonging to the family Solanaceae)","Solanaceae (noun: the nightshade family of plants)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (scientific contexts)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solanum' is a scientific term used to classify a genus of plants. It is primarily found in botanical and agricultural contexts. Understanding this term requires familiarity with scientific classification systems. When discussing specific plants from this genus in everyday conversation, it is more common to use their common names (e.g., potato, tomato)."},"example_sentences":[{"sentence":"Scientists are studying the genetic diversity within the genus Solanum.","translation":"科学者たちはナス属内の遺伝的多様性を研究している。","type":"noun","meaning_category":"ナス属 (genus)"},{"sentence":"Solanum species are found on most continents.","translation":"ナス属の種はほとんどの大陸で見られる。","type":"noun","meaning_category":"ナス属 (genus)"},{"sentence":"The alkaloids found in some Solanum plants can be toxic.","translation":"一部のナス属植物に含まれるアルカロイドは有毒である可能性がある。","type":"noun","meaning_category":"ナス属 (genus)"}]}