{"word":"enteroscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"小腸内視鏡","english_definition":"A type of endoscope specifically designed for examining the small intestine.","examples":[{"sentence":"The doctor used an enteroscope to examine the patient's small intestine.","translation":"医師は小腸内視鏡を使って患者の小腸を検査した。"},{"sentence":"Enteroscopy can help diagnose various small bowel diseases.","translation":"小腸内視鏡検査は、様々な小腸疾患の診断に役立つ。"}],"collocations":["double-balloon enteroscope","spiral enteroscope","video enteroscope","perform enteroscopy","enteroscope insertion"],"synonyms":["small bowel endoscope"],"antonyms":[]}],"etymology":{"value":"Derived from 'entero-' (referring to the intestines) + '-scope' (an instrument for viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛntərəˈskoʊp/","syllables":"en-ter-o-scope"},"inflection":{"noun_plural":"enteroscopes"},"usage_notes":{"explanation":"An enteroscope is a specialized endoscope used to visualize the small intestine, which is longer and more difficult to access than the colon or stomach. Different types of enteroscopes exist, such as double-balloon and spiral enteroscopes, to aid in navigation and visualization. The procedure performed using an enteroscope is called enteroscopy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a colonoscopy with an enteroscope.","correct":"✓ He had an enteroscopy.","note":"An enteroscope is used for enteroscopy (small intestine), while a colonoscope is used for colonoscopy (large intestine)."},{"incorrect":"✗ The enteroscope was used to see the stomach.","correct":"✓ The enteroscope was used to see the small intestine.","note":"An enteroscope is specifically designed for the small intestine, not the stomach."}],"priority":"★★☆"},"related_words":{"derivatives":["enteroscopy (noun: 小腸内視鏡検査)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'enteroscope' refers to a specialized medical instrument used to examine the small intestine. It is a technical term primarily used in medical contexts. Understanding this word requires familiarity with medical terminology and procedures. The related term 'enteroscopy' refers to the procedure itself.","priority":"★★☆"},"example_sentences":[{"sentence":"The gastroenterologist recommended an enteroscopy to investigate the cause of the patient's abdominal pain.","translation":"消化器内科医は、患者の腹痛の原因を調べるために小腸内視鏡検査を勧めた。","type":"general","meaning_category":"medical procedure"},{"sentence":"During the enteroscopy, the doctor identified and removed a small polyp.","translation":"小腸内視鏡検査中に、医師は小さなポリープを特定して切除した。","type":"medical","meaning_category":"medical procedure"},{"sentence":"The new double-balloon enteroscope allows for deeper penetration into the small bowel.","translation":"新しい二重バルーン式小腸内視鏡は、小腸へのより深い挿入を可能にする。","type":"technical","meaning_category":"medical instrument"}]}