{"word":"unfranked","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(手紙などが)切手が貼られていない、料金が支払われていない","english_definition":"(of a letter or other postal item) not having been stamped or had the postage paid.","examples":[{"sentence":"An unfranked letter was returned to the sender.","translation":"切手が貼られていない手紙は差出人に返送された。"},{"sentence":"The postal service charges a fee for unfranked mail.","translation":"郵便局は料金未納の郵便物に対して手数料を請求する。"}],"collocations":["unfranked mail","unfranked letter","unfranked envelope"],"synonyms":["unstamped","postage unpaid","without postage"],"antonyms":["franked","stamped","postage paid"]},{"part_of_speech":"adjective","definition":"(配当などが)税額控除の対象とならない","english_definition":"(of a dividend) not having had tax deducted at source.","examples":[{"sentence":"Unfranked dividends are taxed at the recipient's marginal rate.","translation":"税額控除の対象とならない配当は、受取人の限界税率で課税される。"},{"sentence":"The company paid unfranked dividends to its shareholders.","translation":"その会社は株主に税額控除の対象とならない配当を支払った。"}],"collocations":["unfranked dividend","unfranked income"],"synonyms":["non-franked","without tax credit"],"antonyms":["franked","with tax credit"]}],"etymology":{"value":"The word \"unfranked\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"franked.\" \"Franked\" itself comes from the verb \"frank,\" which historically meant to mark a letter or parcel to indicate that postage had been prepaid or that it was sent under a special privilege (such as by a member of parliament). The financial meaning related to dividends stems from the concept of \"franking credits\" which are tax credits attached to dividends.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfræŋkt/","syllables":"un-franked"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"The word \"unfranked\" has two primary meanings, one related to postage and the other to finance. In the context of postage, it describes mail that has not had the required postage paid, usually indicated by a stamp or other mark. In the context of finance, particularly in countries with dividend imputation systems (like Australia), it describes dividends that do not carry franking credits, meaning that the recipient cannot claim a tax deduction for the tax already paid by the company. The specific meaning depends on the context in which the word is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unfranked letter was delivered without any problem.","correct":"✓ The unfranked letter was returned to sender due to insufficient postage.","note":"Unfranked letters are typically not delivered because the postage hasn't been paid. They are usually returned to the sender or held until postage is paid."},{"incorrect":"✗ He preferred unfranked dividends because they were tax-free.","correct":"✓ He preferred franked dividends because they came with tax credits.","note":"Franked dividends are generally preferred because they come with tax credits, which can reduce the recipient's tax liability. Unfranked dividends are taxed at the recipient's marginal rate."}],"priority":"★★☆"},"related_words":{"derivatives":["unfrank (verb - to remove a franking mark or privilege)"],"phrasal_verbs":[],"related_concepts":["postage","stamp","dividend","franking credit","tax","taxation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unfranked\" is a relatively uncommon term, primarily used in specific contexts. In postal terms, it means that a letter or package doesn't have the necessary stamp or proof of postage payment. In financial contexts, particularly in countries with dividend imputation systems, it refers to dividends that haven't had tax already deducted, meaning the recipient will be responsible for paying the full tax amount. Understanding this word requires knowledge of postal procedures or financial systems, making it more suitable for advanced learners."},"example_sentences":[{"sentence":"The unfranked envelope was marked 'Return to Sender'.","translation":"切手が貼られていない封筒には「差出人に返送」と記載されていた。","type":"adjective","meaning_category":"Postage"},{"sentence":"The investor received both franked and unfranked dividends from different companies.","translation":"投資家は異なる会社から税額控除の対象となる配当と、税額控除の対象とならない配当の両方を受け取った。","type":"adjective","meaning_category":"Finance"}]}