{"word":"formism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 形式主義; 世界を、静的で不変の形式やカテゴリーの集合として捉える形而上学的視点。","english_definition":"(philosophy) The metaphysical view that the world is best understood as a collection of static, unchanging forms or categories.","examples":[{"sentence":"Formism emphasizes fixed categories and unchanging essences.","translation":"形式主義は、固定されたカテゴリーと不変の本質を強調する。"},{"sentence":"His philosophical approach is rooted in formism, seeking to define the essential nature of things.","translation":"彼の哲学的アプローチは形式主義に根ざしており、物事の本質的な性質を定義しようとしている。"}],"collocations":["philosophical formism","metaphysical formism","essential formism"],"synonyms":["essentialism","categorism","formalism"],"antonyms":["process philosophy","relativism","contextualism"]},{"part_of_speech":"noun","definition":"(心理学) 世界を、事前に定義された形式やカテゴリーを通して認識し解釈する傾向。","english_definition":"(psychology) The tendency to perceive and interpret the world through pre-defined forms or categories.","examples":[{"sentence":"Formism in psychology can lead to rigid thinking and resistance to new ideas.","translation":"心理学における形式主義は、硬直した思考や新しいアイデアへの抵抗につながる可能性がある。"},{"sentence":"The formistic approach to personality assessment relies on standardized questionnaires and fixed personality types.","translation":"性格評価への形式主義的なアプローチは、標準化されたアンケートと固定された性格タイプに依存している。"}],"collocations":["psychological formism","cognitive formism","perceptual formism"],"synonyms":["stereotyping","categorization","schematization"],"antonyms":["holistic thinking","integrative thinking","open-mindedness"]}],"etymology":{"value":"The term 'formism' is derived from 'form,' emphasizing the importance of fixed shapes, patterns, or categories in understanding reality. It is often used in contrast to other philosophical and psychological perspectives that emphasize process, change, or context.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrmɪzəm/","syllables":"for-mism"},"inflection":{"noun_plural":"formisms"},"usage_notes":{"explanation":"'Formism' is primarily used in philosophical and psychological contexts to describe a way of understanding the world through fixed categories and unchanging forms. It is often contrasted with perspectives that emphasize change, process, or context. In philosophy, it refers to a metaphysical view. In psychology, it describes a cognitive tendency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Formism is about creating new forms of art.","correct":"✓ Formism, in philosophy, is about understanding the world through existing forms.","note":"Formism is not about creating new forms but about understanding the world through existing, fixed forms."},{"incorrect":"✗ Formism is the same as formalism in art.","correct":"✓ Formism is a philosophical and psychological concept, while formalism is primarily an art-related concept.","note":"While related, formism is a broader philosophical and psychological concept, whereas formalism is more specifically related to art and literature."}],"priority":"★★☆"},"related_words":{"derivatives":["formistic (adjective)"],"phrases":["formistic approach","formistic thinking"],"related_concepts":["essentialism","formalism","categorization","stereotyping","process philosophy","contextualism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Formism' is a specialized term primarily used in philosophy and psychology. It describes the tendency to understand the world through fixed, unchanging categories or forms. This concept is often discussed in contrast to other perspectives that emphasize change, process, or context. Understanding 'formism' requires familiarity with philosophical and psychological discourse.","priority":"★★☆"},"example_sentences":[{"sentence":"The philosopher criticized the formism inherent in traditional metaphysics.","translation":"その哲学者は、伝統的な形而上学に内在する形式主義を批判した。","type":"noun","meaning_category":"philosophy"},{"sentence":"The psychologist argued that formism can limit our ability to adapt to new situations.","translation":"心理学者は、形式主義が新しい状況に適応する能力を制限する可能性があると主張した。","type":"noun","meaning_category":"psychology"},{"sentence":"A formistic approach to education may prioritize rote learning over critical thinking.","translation":"教育への形式主義的なアプローチは、批判的思考よりも丸暗記を優先する可能性がある。","type":"adjective","meaning_category":"general"}]}