{"word":"unpolarized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(光、電磁波などが)偏光していない、無偏光の","english_definition":"(of light, electromagnetic radiation, etc.) not polarized; having no preferential direction of oscillation.","examples":[{"sentence":"The light from the sun is generally unpolarized.","translation":"太陽からの光は一般的に偏光していません。"},{"sentence":"Unpolarized light sources are used in many applications.","translation":"無偏光光源は多くの用途で使用されています。"}],"collocations":["unpolarized light","unpolarized radiation","unpolarized beam"],"synonyms":["nonpolarized"],"antonyms":["polarized"]},{"part_of_speech":"adjective","definition":"(意見、態度などが)両極化していない、中立的な、公平な","english_definition":"(of opinions, attitudes, etc.) not divided into opposing extremes; neutral; unbiased.","examples":[{"sentence":"The discussion remained relatively unpolarized, with participants willing to consider different viewpoints.","translation":"議論は比較的両極化せず、参加者はさまざまな視点を検討する意思がありました。"},{"sentence":"The journalist aimed to present an unpolarized account of the events.","translation":"ジャーナリストは、出来事について偏りのない説明をすることを目標としました。"}],"collocations":["unpolarized debate","unpolarized discussion","unpolarized view"],"synonyms":["neutral","unbiased","impartial","objective","non-aligned"],"antonyms":["polarized","biased","partisan","subjective"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the word 'polarized'. 'Polarized' itself comes from 'polar', referring to poles or opposing extremes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈpoʊləraɪzd/","syllables":"un-po-lar-ized"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns and can have comparative and superlative forms (more unpolarized, most unpolarized), though these are less common."},"usage_notes":{"explanation":"'Unpolarized' has two main senses. In physics, it refers to light or other electromagnetic radiation that does not have a specific direction of oscillation. In a more general sense, it describes opinions or viewpoints that are not divided into opposing extremes. The second sense is often used in discussions of politics or social issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpolarized magnet.","correct":"✓ The unmagnetized object.","note":"'Unpolarized' is generally not used to describe magnets. 'Unmagnetized' is the correct term for an object that is not magnetized."}],"priority":"★★☆"},"related_words":{"derivatives":["unpolarizable"],"related_terms":["polarization","polarize","pole"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unpolarized' is relatively uncommon and is used in specialized contexts. It has two main meanings: one in physics, referring to light or other electromagnetic radiation that is not polarized, and another in a more general sense, referring to opinions or viewpoints that are not divided into opposing extremes. Understanding the context is important to correctly interpret the meaning of 'unpolarized'."},"example_sentences":[{"sentence":"The experiment required an unpolarized light source.","translation":"実験には無偏光光源が必要でした。","type":"adjective","meaning_category":"光、電磁波などが偏光していない"},{"sentence":"The moderator tried to keep the debate unpolarized.","translation":"司会者は討論が両極化しないように努めた。","type":"adjective","meaning_category":"意見、態度などが両極化していない"}]}