{"word":"itinerarian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"旅行者、巡回者","english_definition":"A traveler; one who travels from place to place.","examples":[{"sentence":"The itinerarian shared stories of his adventures around the world.","translation":"その旅行者は世界中の冒険の話を共有した。"},{"sentence":"Ancient itinerarians often relied on the hospitality of strangers.","translation":"古代の旅行者はしばしば見知らぬ人々の親切に頼っていた。"}],"collocations":["wandering itinerarian","seasoned itinerarian"],"synonyms":["traveler","wanderer","roamer","nomad","wayfarer"],"antonyms":["settler","resident"]},{"part_of_speech":"adjective","definition":"旅行の、巡回する、旅程の","english_definition":"Traveling from place to place; pertaining to a journey or itinerary.","examples":[{"sentence":"The itinerarian lifestyle suited his adventurous spirit.","translation":"旅行の生活様式は彼の冒険心に合っていた。"},{"sentence":"The itinerarian preacher visited many small towns.","translation":"巡回説教師は多くの小さな町を訪れた。"}],"collocations":["itinerarian lifestyle","itinerarian preacher"],"synonyms":["traveling","wandering","roaming","migratory","peripatetic"],"antonyms":["settled","stationary"]}],"etymology":{"value":"From the Latin word \"itinerarius,\" meaning \"relating to a journey,\" which in turn comes from \"iter,\" meaning \"journey\" or \"way.\"","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈtɪnəˌrɛəriən/","syllables":"i-tin-er-ar-i-an"},"inflection":{"noun_plural":"itinerarians","notes":"The word can function as both a noun and an adjective, with the noun form having a plural."},"usage_notes":{"explanation":"The word \"itinerarian\" is relatively uncommon in modern English. It is often used to describe someone who travels frequently or has a nomadic lifestyle. As an adjective, it describes something related to travel or a journey. It is more formal and less frequently used than \"traveler\" or \"traveling.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a itinerarian person.","correct":"✓ He is an itinerarian. / ✓ He is an itinerarian traveler.","note":"When used as a noun, \"itinerarian\" refers to a person, so adding \"person\" is redundant. If you want to emphasize they are a traveler, you can say \"itinerarian traveler.\""},{"incorrect":"✗ The itinerarian book described the route.","correct":"✓ The itinerary described the route.","note":"Do not confuse \"itinerarian\" with \"itinerary.\" An \"itinerary\" is a plan of a journey, while an \"itinerarian\" is a traveler."}],"priority":"★★☆"},"related_words":{"derivatives":["itinerary (noun: a detailed plan for a journey)","itinerate (verb: to travel from place to place)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"itinerarian\" is a relatively rare and formal term used to describe someone who travels from place to place, or something related to travel. It is less common than simpler alternatives like \"traveler\" or \"traveling.\" Understanding the word requires a good vocabulary and familiarity with less common words. It is more likely to be encountered in literature or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"The museum featured photographs from a 19th-century itinerarian photographer.","translation":"その博物館は19世紀の巡回写真家の写真を取り上げていた。","type":"noun","meaning_category":"旅行者"},{"sentence":"His itinerarian work took him to every corner of the country.","translation":"彼の巡回する仕事で彼は国の隅々まで行った。","type":"adjective","meaning_category":"旅行の"}]}