{"word":"sphingid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スズメガ（科）の蛾","english_definition":"A moth of the family Sphingidae, characterized by their large size, narrow wings, and ability to hover while feeding on nectar.","examples":[{"sentence":"The hummingbird clearwing is a type of sphingid moth.","translation":"ハチドリのような透明な翅を持つスズメガは、スズメガの一種です。"},{"sentence":"Sphingids are known for their strong flight and nocturnal habits.","translation":"スズメガは、その強い飛行能力と夜行性で知られています。"}],"collocations":["hummingbird sphingid","sphinx moth caterpillar","sphingid moth larvae"],"synonyms":["sphinx moth","hawk moth"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Sphingidae, which comes from the Greek word 'sphinx' referring to the Sphinx of Greek mythology, due to the caterpillar's posture resembling the Sphinx.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsfɪndʒɪd/","syllables":"sphin-gid"},"inflection":{"noun_plural":"sphingids"},"usage_notes":{"explanation":"'Sphingid' is used to refer to any moth belonging to the family Sphingidae. These moths are often large and powerful fliers, and many species are active at dusk or night. The caterpillars of some sphingid moths are known as hornworms because of a horn-like projection on their posterior end.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a sphingid caterpillar on my tomato plant, it was a butterfly.","correct":"✓ I saw a sphingid caterpillar on my tomato plant, it will become a moth.","note":"Sphingid caterpillars become moths, not butterflies."}],"priority":"★★☆"},"related_words":{"derivatives":["Sphingidae (family name)","hornworm (caterpillar of some sphingid moths)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sphingid' is a scientific term referring to moths in the family Sphingidae, also known as hawk moths or sphinx moths. These moths are known for their strong flying ability and nocturnal behavior. The term is typically used in scientific or specialized contexts related to entomology or wildlife. Understanding this term requires a background knowledge of insect classification.","priority":"★★☆"},"example_sentences":[{"sentence":"The sphingid moth hovered near the flower, sipping nectar with its long proboscis.","translation":"スズメガは長い口吻で蜜を吸いながら、花の近くをホバリングしていた。","type":"noun","meaning_category":"insect"},{"sentence":"Many sphingid caterpillars are agricultural pests, feeding on crops like tomatoes and tobacco.","translation":"多くのスズメガの幼虫は農業害虫であり、トマトやタバコなどの作物に食害を与える。","type":"noun","meaning_category":"insect"}]}