{"word":"Metatrophy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(biology) A nutritional process in which an organism obtains its energy and nutrients from dead organic matter, but also requires a living organism for some essential growth factor.","english_definition":"A nutritional process in which an organism obtains its energy and nutrients from dead organic matter, but also requires a living organism for some essential growth factor.","examples":[{"sentence":"Some fungi exhibit metatrophy, relying on both dead organic material and a living host for optimal growth.","translation":"いくつかの菌類はメタトロフィーを示し、最適な成長のために死んだ有機物と生きた宿主の両方に依存しています。"}],"collocations":[],"synonyms":["mixotrophy","parasitism","saprotrophy"],"antonyms":["autotrophy","phototrophy"]}],"etymology":{"value":"Derived from the Greek words 'meta' (meaning 'change' or 'beyond'), and 'trophy' (meaning 'nourishment' or 'food').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈtrɒfi/","syllables":"met-a-tro-phy"},"inflection":{"noun_plural":"metatrophies"},"usage_notes":{"explanation":"Metatrophy is a relatively uncommon term in biology, often used to describe organisms that have complex nutritional requirements, bridging the gap between saprotrophy (feeding on dead matter) and parasitism (feeding on living hosts).","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["metatrophic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Metatrophy' is a specialized biological term describing a specific nutritional strategy. Understanding requires familiarity with basic biological concepts like 'saprotrophy' and 'parasitism'. It's not commonly used outside of advanced biology contexts."},"example_sentences":[{"sentence":"The bacterium exhibits metatrophy by utilizing decaying plant matter and requiring a specific vitamin produced by a neighboring alga.","translation":"そのバクテリアは、腐敗した植物物質を利用し、隣接する藻類によって生成される特定のビタミンを必要とすることで、メタトロフィーを示す。","type":"general","meaning_category":"Nutritional process"}]}