{"word":"Molochs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"モレク（古代フェニキアの神）への生贄を捧げる儀式を支持する人々","english_definition":"plural form of Moloch, often used metaphorically to describe entities or systems that demand great sacrifice.","examples":[{"sentence":"The war became a Moloch, devouring the nation's youth and resources.","translation":"その戦争はモレクとなり、国家の若者と資源を食い尽くした。"},{"sentence":"Some critics see modern corporations as Molochs, prioritizing profit over human well-being.","translation":"現代の企業を、人間の幸福よりも利益を優先するモレクとみなす批評家もいる。"}],"collocations":["worship of Moloch","sacrifice to Moloch","modern Molochs"],"synonyms":["demons","idols","false gods"],"antonyms":[]}],"etymology":{"value":"Molochは、旧約聖書に登場する古代フェニキアの神であり、子供を生贄として捧げる儀式が行われていたとされる。この神の名前は、ヘブライ語のmlk（王）に由来すると考えられている。","priority":"★★☆"},"pronunciation":{"ipa":"ˈmoʊlɒks","syllables":"Mo-locks"},"inflection":{"noun_plural":"Molochs"},"usage_notes":{"explanation":"\"Moloch\"は、文字通りの神の名前として使われることはまれで、比喩的に、多大な犠牲を要求する無慈悲な力やシステムを指すことが多い。特に、全体主義国家、戦争、資本主義などを批判的に表現する際に用いられる。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Moloch is a kind god.","correct":"✓ Moloch is associated with child sacrifice and is not considered a kind god.","note":"Molochは生贄を求める神であり、慈悲深いとは考えられていません。"},{"incorrect":"✗ I saw a Moloch in the zoo.","correct":"✓ Moloch is a deity, not an animal, so you wouldn't see one in a zoo.","note":"Molochは神であり、動物ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Molochian (形容詞: モレクのような、残忍な)"],"phrases":["sacrifice to Moloch","worship of Moloch"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 文学、歴史、哲学などの分野で使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Molochs\"は、古代の神モレクに由来する言葉で、現代では比喩的に、大きな犠牲を要求する力やシステムを指すために使われます。この言葉は、高度な語彙力と文化的な背景知識を必要とするため、一般的には使用頻度が低く、文学や哲学などの分野でよく見られます。例えば、戦争や全体主義国家を批判的に表現する際に用いられることがあります。"},"example_sentences":[{"sentence":"The factory became a modern Moloch, demanding long hours and sacrificing the health of its workers.","translation":"その工場は現代のモレクとなり、長時間労働を要求し、労働者の健康を犠牲にした。","type":"noun","meaning_category":"metaphorical"},{"sentence":"Critics argued that the new economic policy was a Moloch, consuming small businesses and enriching only the wealthy.","translation":"批評家たちは、新しい経済政策はモレクであり、中小企業を食い尽くし、富裕層だけを豊かにすると主張した。","type":"noun","meaning_category":"metaphorical"},{"sentence":"The ancient texts described the rituals of sacrifice to Moloch, a deity demanding the lives of children.","translation":"古代の文献には、子供たちの命を要求する神、モレクへの生贄の儀式が記述されていた。","type":"noun","meaning_category":"historical"}]}