{"word":"gesture-controlled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ジェスチャー制御の、身振り操作の","english_definition":"(of a device or system) operated or controlled by gestures.","examples":[{"sentence":"This TV is gesture-controlled, so you can change channels with a wave of your hand.","translation":"このテレビはジェスチャー制御なので、手を振るだけでチャンネルを変えられます。"},{"sentence":"The new gaming system features a gesture-controlled interface.","translation":"その新しいゲームシステムはジェスチャー制御のインターフェースを搭載しています。"}],"collocations":["gesture-controlled device","gesture-controlled interface","gesture-controlled technology","gesture-controlled system"],"synonyms":["motion-controlled","hand-gesture recognition","non-contact control"],"antonyms":["manually-controlled","button-operated","remote-controlled"]},{"part_of_speech":"adjective","definition":"ジェスチャーで操作されるように設計された","english_definition":"Designed to be operated or controlled by gestures.","examples":[{"sentence":"The company is developing gesture-controlled applications for smartphones.","translation":"その会社はスマートフォン向けのジェスチャー制御アプリケーションを開発しています。"},{"sentence":"Gesture-controlled robots are becoming increasingly common in manufacturing.","translation":"ジェスチャー制御ロボットは製造業でますます一般的になっています。"}],"collocations":["gesture-controlled robot","gesture-controlled application","gesture-controlled drone"],"synonyms":["gesture-operated","gesture-enabled"],"antonyms":["voice-controlled","touch-controlled"]}],"etymology":{"value":"The term is a compound word formed by combining 'gesture' (a movement of part of the body to express an idea or meaning) and 'controlled' (having the power to direct or regulate something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒestʃər kənˈtroʊld/","syllables":"ges-ture-con-trolled"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'gesture-controlled' is used to describe devices or systems that respond to human gestures. These gestures are typically recognized by sensors or cameras, which then translate the movements into commands. This technology is often used to provide a hands-free or more intuitive user experience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The device is gesture control.","correct":"✓ The device is gesture-controlled.","note":"'Gesture control' is a noun phrase referring to the general concept, while 'gesture-controlled' is an adjective describing a specific device or system."},{"incorrect":"✗ The gesture control system is very sensitive for movements.","correct":"✓ The gesture-controlled system is very sensitive to movements.","note":"The correct preposition to use with 'sensitive' in this context is 'to', not 'for'."}],"priority":"★★☆"},"related_words":{"derivatives":["gesture (noun)","control (verb, noun)","controlled (adjective)"],"phrasal_verbs":[],"related_technologies":["motion sensing","computer vision","human-computer interaction (HCI)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Gesture-controlled' is a technical term used to describe devices or systems that can be operated using hand or body movements (gestures) instead of physical buttons or touchscreens. It's commonly found in discussions about new technologies, gaming, and user interfaces. The term implies that the device has sensors or cameras that can recognize and interpret these gestures as commands."},"example_sentences":[{"sentence":"The surgeon used a gesture-controlled interface to manipulate the robotic arms during the operation.","translation":"外科医は手術中にジェスチャー制御インターフェースを使用して、ロボットアームを操作しました。","type":"adjective","meaning_category":"ジェスチャー制御の"},{"sentence":"Gesture-controlled lighting systems can adjust the brightness based on simple hand movements.","translation":"ジェスチャー制御の照明システムは、簡単な手の動きに基づいて明るさを調整できます。","type":"adjective","meaning_category":"ジェスチャー制御の"},{"sentence":"The company is investing heavily in developing more sophisticated gesture-controlled technologies.","translation":"その会社は、より高度なジェスチャー制御技術の開発に多額の投資をしています。","type":"adjective","meaning_category":"ジェスチャー制御の"}]}