{"word":"cotenure","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同保有、共同占有","english_definition":"The holding of the same property or office by two or more persons jointly.","examples":[{"sentence":"The land was held in cotenure by the siblings after their parents' passing.","translation":"両親の死後、その土地は兄弟姉妹によって共同保有された。"},{"sentence":"The two professors shared a cotenure position at the university.","translation":"その2人の教授は大学で共同保有の地位を共有していた。"}],"collocations":["hold in cotenure","joint cotenure","establish cotenure"],"synonyms":["joint ownership","co-ownership","joint tenancy","tenancy in common"],"antonyms":["sole ownership","individual tenure"]}],"etymology":{"value":"'Co-' (together) + 'tenure' (the holding of an office or property).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈtɛnjər/","syllables":"co-ten-ure"},"inflection":{"noun_plural":"cotenures"},"usage_notes":{"explanation":"'Cotenure' refers to a situation where two or more individuals jointly hold a property or office. It's often used in legal and academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They have a cotenure agreement, so they each own half of the house.","correct":"✓ They have a cotenure agreement, so they jointly own the house.","note":"The correction emphasizes the joint nature of the ownership rather than implying a strict division of the property."},{"incorrect":"✗ The cotenure of the land was decided by the court.","correct":"✓ The cotenants of the land were decided by the court.","note":"'Cotenure' is the state of joint ownership, not the individuals who own it. The individuals are 'cotenants'."}],"priority":"★★☆"},"related_words":{"derivatives":["cotenant"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cotenure' is a formal term referring to joint ownership or holding of property or office. It is typically used in legal or academic discussions. Understanding the concept requires familiarity with property law or organizational structures."},"example_sentences":[{"sentence":"The siblings inherited the property in cotenure.","translation":"兄弟姉妹はその財産を共同保有で相続した。","type":"noun","meaning_category":"共同保有"},{"sentence":"The two scientists were granted cotenure of the research lab.","translation":"その2人の科学者は研究室の共同保有権を与えられた。","type":"noun","meaning_category":"共同占有"},{"sentence":"Establishing cotenure requires a detailed legal agreement.","translation":"共同保有を確立するには、詳細な法的合意が必要です。","type":"noun","meaning_category":"共同保有"}]}