{"word":"Vice-godhead","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神の代理、神の地位の代行者、神の権威の代行者","english_definition":"A person or entity acting as a substitute or representative of a god; a deputy or subordinate deity.","examples":[{"sentence":"The pharaoh was considered a vice-godhead on Earth, ruling with divine authority.","translation":"ファラオは、神の権威を持って統治する、地上における神の代理とみなされていた。"},{"sentence":"In some mythologies, certain demigods served as vice-godheads, carrying out the will of the higher gods.","translation":"いくつかの神話では、特定の半神が神の代理として、より高位の神々の意志を実行していた。"}],"collocations":["act as vice-godhead","divine vice-godhead","earthly vice-godhead"],"synonyms":["deputy deity","divine representative","god's proxy","substitute god","regent of the gods"],"antonyms":["godhead","supreme deity"]}],"etymology":{"value":"The term is a compound of 'vice-' (meaning 'in place of' or 'deputy') and 'godhead' (referring to the divine nature or status of a god). It signifies someone or something that holds a position or authority secondary to a god.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvaɪsˌɡɒdˌhɛd/","syllables":"Vice-god-head"},"inflection":{"noun_plural":"Vice-godheads"},"usage_notes":{"explanation":"'Vice-godhead' is a relatively rare term, primarily used in religious, mythological, or historical contexts to describe individuals or entities that act on behalf of a god or possess delegated divine authority. It emphasizes the subordinate role while still acknowledging a connection to the divine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the vice-godhead of all gods.","correct":"✓ He was a vice-godhead, representing the main god.","note":"A vice-godhead is a representative *of* a god, not of all gods. The article 'a' should be used because it's one specific representative."},{"incorrect":"✗ The vice-godhead had the same power as the godhead.","correct":"✓ The vice-godhead had power delegated by the godhead.","note":"A vice-godhead's power is always delegated and subordinate to the godhead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["demigod","proxy","regent","avatar","divine right","theocracy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'vice-godhead' is a complex and relatively rare term, primarily found in religious, mythological, or academic texts. It describes an individual or entity that acts as a representative or deputy of a god, holding delegated divine authority. Understanding requires familiarity with religious concepts and hierarchical structures of power. The prefix 'vice-' indicates a subordinate or acting role, while 'godhead' refers to the divine nature or status of a god. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The high priest was seen as a vice-godhead, interpreting the deity's will for the people.","translation":"大祭司は、神の意志を人々に伝える、神の代理と見なされていた。","type":"noun","meaning_category":"神の代理"},{"sentence":"Legends told of a powerful sorcerer who became a vice-godhead through a pact with ancient spirits.","translation":"古代の精霊との契約を通じて神の代理となった強力な魔法使いの伝説が語られた。","type":"noun","meaning_category":"神の権威の代行者"},{"sentence":"As the vice-godhead, she ensured that the kingdom remained in harmony with the celestial realm.","translation":"神の代理として、彼女は王国が天界と調和を保つように努めた。","type":"noun","meaning_category":"神の地位の代行者"}]}