{"word":"anagogics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(神学) 聖書解釈の四重の意味の一つで、永遠の救いという観点から解釈すること。","english_definition":"The spiritual interpretation of a word, statement or event, especially in the Bible, that detects allusions to the final destiny of humankind.","examples":[{"sentence":"Anagogics is the highest and most mystical level of interpretation.","translation":"アナゴジーは、解釈の最高かつ最も神秘的なレベルです。"},{"sentence":"Through anagogics, the earthly Jerusalem can be understood as a symbol of the heavenly city.","translation":"アナゴジーを通して、地上のエルサレムは天上の都市の象徴として理解できます。"}],"collocations":["anagogical interpretation","anagogical sense","level of anagogics"],"synonyms":["mystical interpretation","spiritual sense","allegorical interpretation (related)"],"antonyms":["literal interpretation","historical interpretation"],"notes":"One of the four senses of Scripture: literal, allegorical, moral (or tropological), and anagogical."}],"etymology":{"value":"Derived from the Greek word 'anagoge' (ἀναγωγή), meaning 'a leading up, ascent', from 'ana-' (up) + 'agein' (to lead).","priority":"★★★"},"pronunciation":{"ipa":"/ˌænəˈɡɒdʒɪks/","syllables":"a-na-go-gics"},"inflection":{"noun_plural":"N/A (usually used as a singular abstract noun)"},"usage_notes":{"explanation":"Anagogics is primarily used in theological and literary contexts, specifically when discussing the interpretation of religious texts. It represents the most spiritual and eschatological level of understanding, focusing on the ultimate destiny of humanity and the world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used anagogics to understand the scientific text.","correct":"✓ He used allegorical interpretation to understand the scientific text.","note":"Anagogics is specific to religious and theological texts, not scientific ones. Allegorical interpretation might be more appropriate for non-religious texts with symbolic meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["anagogical (adjective)"],"related_terms":["allegory","exegesis","hermeneutics","eschatology"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Anagogics' refers to a highly specialized concept within theology and literary criticism, specifically concerning the interpretation of texts to reveal their ultimate spiritual or eschatological meaning. It's not a term used in everyday conversation and requires a background in religious studies or literary theory to fully grasp its significance. It's one of the four traditional levels of interpreting scripture, focusing on the text's implications for eternal life and the final destiny of humanity."},"example_sentences":[{"sentence":"The sermon explored the anagogics of the Book of Revelation, connecting its imagery to the promise of eternal life.","translation":"説教はヨハネの黙示録のアナゴジーを掘り下げ、そのイメージを永遠の命の約束と結びつけました。","type":"noun","meaning_category":"theological interpretation"},{"sentence":"Medieval theologians often employed anagogics to find deeper meaning in biblical narratives.","translation":"中世の神学者は、聖書の物語に深い意味を見出すために、アナゴジーをよく用いました。","type":"noun","meaning_category":"theological interpretation"}]}