{"word":"Sporification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胞子形成、芽胞形成","english_definition":"The process of spore formation, especially in bacteria.","examples":[{"sentence":"Sporification allows certain bacteria to survive harsh environmental conditions.","translation":"胞子形成により、特定の細菌は過酷な環境条件を生き残ることができます。"},{"sentence":"The sporification process involves several stages of cellular differentiation.","translation":"胞子形成のプロセスには、細胞分化のいくつかの段階が含まれます。"}],"collocations":["initiate sporification","undergo sporification","bacterial sporification"],"synonyms":["spore formation","encystment"],"antonyms":["germination","vegetative growth"]}],"etymology":{"value":"Derived from 'spore' + '-ification' (a suffix indicating the process of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspɔːrɪfɪˈkeɪʃən/","syllables":"spo-ri-fi-ca-tion"},"inflection":{"noun_plural":"sporifications"},"usage_notes":{"explanation":"'Sporification' specifically refers to the process by which certain bacteria and other microorganisms form spores as a survival mechanism. It is a complex process involving genetic regulation and cellular changes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sporulation is the same as binary fission.","correct":"✓ Sporification leads to spore formation, while binary fission is a method of reproduction.","note":"Sporification is a survival mechanism, not a form of reproduction like binary fission."}],"priority":"★★☆"},"related_words":{"derivatives":["spore","spore-forming","sporulate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sporification' is a technical term used in microbiology and biology to describe the process by which certain bacteria form spores. This term is typically encountered in scientific literature and academic settings. Understanding this term requires a background in biology or microbiology."},"example_sentences":[{"sentence":"During nutrient deprivation, Bacillus subtilis initiates sporification.","translation":"栄養欠乏の間、枯草菌は胞子形成を開始します。","type":"scientific","meaning_category":"process"},{"sentence":"The bacterium's ability to undergo sporification contributes to its persistence in the environment.","translation":"その細菌の胞子形成能力は、環境中での持続性に貢献しています。","type":"scientific","meaning_category":"ability"}]}