{"word":"Relatinization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ラテン語化；ラテン語への回帰、またはラテン語の影響の復活","english_definition":"The process or result of making something more Latin in character or form; a return to Latin usage or influence.","examples":[{"sentence":"The relatinization of European vocabulary after the Renaissance enriched many languages.","translation":"ルネサンス以降のヨーロッパ語彙のラテン語化は、多くの言語を豊かにした。"},{"sentence":"The spelling reform aimed to reduce the relatinization of the native words.","translation":"その綴り字改革は、固有語のラテン語化を減らすことを目的としていた。"}],"collocations":["vocabulary relatinization","spelling relatinization","cultural relatinization"],"synonyms":["Latinization","Latin revival","Latin influence"],"antonyms":["delatinization"]}],"etymology":{"value":"Derived from \"relatinize,\" which combines the prefix \"re-\" (again) with \"latinize\" (to make Latin in character).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˌlætɪnaɪˈzeɪʃən/","syllables":"re-lat-in-i-za-tion"},"inflection":{"noun_plural":"Relatinizations"},"usage_notes":{"explanation":"\"Relatinization\" refers to the process where elements of Latin, such as vocabulary, grammar, or spelling, are reintroduced or become more prominent in a language or culture. This often occurs after periods where Latin influence had waned. It can also refer to the conscious effort to align a language more closely with Latin forms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relatinization was happened quickly.","correct":"✓ The relatinization happened quickly.","note":"\"Relatinization\" is a noun and does not require an auxiliary verb like \"was\" in this context."},{"incorrect":"✗ Relatinization is when you speak Latin.","correct":"✓ Relatinization is the process of making something more Latin-like.","note":"\"Relatinization\" is not simply speaking Latin, but rather the process of incorporating Latin elements into something else."}],"priority":"★★☆"},"related_words":{"derivatives":["relatinize (verb)","latinize (verb)","Latin (noun, adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Relatinization\" is a specialized term primarily used in linguistics, history, and cultural studies. It describes the process of a language or cultural element becoming more aligned with Latin characteristics, often after a period of divergence. Understanding this term requires familiarity with the historical influence of Latin on various languages and cultures."},"example_sentences":[{"sentence":"The **relatinization** of scientific terminology made it easier for scholars across Europe to communicate.","translation":"科学用語のラテン語化により、ヨーロッパ中の学者がコミュニケーションを取りやすくなった。","type":"noun","meaning_category":"ラテン語化"},{"sentence":"After the vernacular languages gained prominence, there was a conscious effort to prevent further **relatinization** of the grammar.","translation":"口語が優勢になった後、文法のさらなるラテン語化を防ぐための意識的な努力がなされた。","type":"noun","meaning_category":"ラテン語化"}]}