{"word":"nonmendicant","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"托鉢(たくはつ)をしない、物乞(ものご)いをしない","english_definition":"Not practicing mendicancy; not begging.","examples":[{"sentence":"The order was a nonmendicant one, relying on income from its properties.","translation":"その教団は非托鉢教団であり、所有する不動産からの収入に頼っていた。"},{"sentence":"Unlike the mendicant friars, the nonmendicant monks lived a more secluded life.","translation":"托鉢修道士とは異なり、非托鉢修道士はより隠遁的な生活を送っていた。"}],"collocations":["nonmendicant order (非托鉢教団)","nonmendicant monasticism (非托鉢修道制)"],"synonyms":["self-supporting","independent","non-begging"],"antonyms":["mendicant","begging"],"notes":"Often used in the context of religious orders or monasticism."}],"etymology":{"value":"\"non-\" (not) + \"mendicant\" (begging).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmɛndɪkənt/","syllables":"non-men-di-cant"},"inflection":{"notes":"Adjective; no inflectional forms."},"usage_notes":{"explanation":"\"Nonmendicant\" is primarily used in historical or religious contexts to describe orders or individuals who do not rely on begging for their livelihood. It is the opposite of \"mendicant,\" which describes those who do.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a nonmendicant person, always helping others.","correct":"✓ He was a generous person, always helping others.","note":"\"Nonmendicant\" specifically refers to not begging; it doesn't generally describe a helpful person."}],"priority":"★☆☆"},"related_words":{"derivatives":["mendicant (adjective, noun)","mendicancy (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonmendicant\" is a specialized term primarily used in historical or religious contexts. It describes someone or a group (often a religious order) that does not rely on begging for sustenance. Understanding this word requires familiarity with the concept of mendicancy (begging for a living), which is not a common practice in modern Western societies. Therefore, this word is more likely to be encountered in academic texts or discussions about religious history."},"example_sentences":[{"sentence":"The Benedictine order is a **nonmendicant** order, traditionally supported by land ownership and farming.","translation":"ベネディクト会は非托鉢教団であり、伝統的に土地所有と農業によって支えられている。","type":"adjective","meaning_category":"Not begging"},{"sentence":"The rise of **nonmendicant** monastic communities allowed for the development of extensive libraries and scriptoria.","translation":"非托鉢修道院共同体の台頭は、広大な図書館と写字室の発展を可能にした。","type":"adjective","meaning_category":"Not begging"}]}