{"word":"premillennialized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(受動態で)千年王国前再臨説の解釈が与えられた、千年王国前再臨説の立場から解釈された","english_definition":"(in passive voice) interpreted or understood from a premillennialist perspective; having been given a premillennialist interpretation.","examples":[{"sentence":"The scripture passage was premillennialized by some theologians.","translation":"その聖句は、一部の神学者によって千年王国前再臨説の立場から解釈された。"},{"sentence":"Certain prophecies are often premillennialized in evangelical circles.","translation":"特定の預言は、福音主義の界隈でしばしば千年王国前再臨説の解釈が与えられる。"}],"collocations":["be premillennialized"],"synonyms":["interpreted premillennially","understood premillennially"],"antonyms":["amillennialized","postmillennialized"]}],"etymology":{"value":"'premillennial' + '-ize' + '-ed'. 'Premillennial' refers to the belief that Christ will return before the millennium, a thousand-year period of peace and righteousness. '-ize' is a suffix that transforms a noun or adjective into a verb, meaning 'to make or become'. '-ed' indicates the past participle form.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌpriːmɪˈlɛniəlaɪzd/","syllables":"pre-mil-len-ni-al-ized"},"inflection":{"verb_forms":{"present_simple":["premillennialize","premillennializes"],"past_simple":"premillennialized","past_participle":"premillennialized","present_participle":"premillennializing"}},"usage_notes":{"explanation":"'Premillennialized' is a term primarily used in theological discussions, specifically within Christian eschatology. It describes the act of interpreting biblical prophecies and events through the lens of premillennialism, a belief that Jesus Christ will return to Earth before a literal thousand-year golden age (the millennium). This term is often used when discussing how different theological perspectives can lead to varying interpretations of scripture.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was premillennializing.","correct":"✓ The event was premillennialized.","note":"'Premillennializing' is the present participle and describes the *action* of interpreting something from a premillennial perspective. 'Premillennialized' is the past participle and describes something that *has been* interpreted from that perspective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["premillennialism (noun: 千年王国前再臨説)","premillennialist (noun: 千年王国前再臨説者, adjective: 千年王国前再臨説の)","millennium (noun: 千年王国)","eschatology (noun: 終末論)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (specialized theological term)","frequency_google_ngram":"Very low frequency - a specialized theological term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Premillennialized' is a highly specialized theological term used within Christian eschatology. It describes the act of interpreting biblical texts and prophecies through the framework of premillennialism. This perspective believes that Christ will return *before* a literal thousand-year period of peace and righteousness on Earth. The term is typically encountered in academic or theological contexts when discussing different interpretive approaches to scripture and end-times prophecies. Understanding requires familiarity with Christian theological concepts and eschatological viewpoints."},"example_sentences":[{"sentence":"The book of Revelation has been premillennialized by many evangelical scholars.","translation":"ヨハネの黙示録は、多くの福音派の学者によって千年王国前再臨説の立場から解釈されてきた。","type":"verb (past participle)","meaning_category":"解釈された"},{"sentence":"Whether the passage should be premillennialized is a matter of ongoing debate.","translation":"その箇所を千年王国前再臨説の立場から解釈すべきかどうかは、現在も議論が続いている問題である。","type":"verb (past participle in a question)","meaning_category":"解釈された"}]}