{"word":"Neapolitan","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ナポリの、ナポリ風の","english_definition":"relating to Naples (Napoli), Italy, or its people or culture.","examples":[{"sentence":"Neapolitan pizza is known for its simple, fresh ingredients.","translation":"ナポリ風ピザは、シンプルで新鮮な材料で知られています。"},{"sentence":"He spoke with a strong Neapolitan accent.","translation":"彼は強いナポリ訛りで話しました。"}],"collocations":["Neapolitan pizza","Neapolitan dialect","Neapolitan songs","Neapolitan cuisine"],"synonyms":["Naplesian"],"antonyms":[]},{"part_of_speech":"noun","definition":"ナポリ人、ナポリ語","english_definition":"a person from Naples; the dialect or language of Naples.","examples":[{"sentence":"The Neapolitans are known for their passion and hospitality.","translation":"ナポリの人々は情熱とホスピタリティで知られています。"},{"sentence":"Neapolitan is a distinct dialect of Italian.","translation":"ナポリ語はイタリア語の明確な方言です。"}],"collocations":["speak Neapolitan","learn Neapolitan"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ナポリタン (料理)","english_definition":"A tomato-based pasta dish, often with meat, popular in Japan.","examples":[{"sentence":"I ordered a Neapolitan at the cafe.","translation":"カフェでナポリタンを注文しました。"},{"sentence":"Neapolitan is a popular comfort food in Japan.","translation":"ナポリタンは日本で人気の家庭料理です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ナポリタン (アイスクリーム)","english_definition":"Neapolitan ice cream is a type of ice cream composed of blocks of vanilla, chocolate, and strawberry ice cream arranged side by side in the same container.","examples":[{"sentence":"She chose Neapolitan ice cream for dessert.","translation":"彼女はデザートにナポリタンアイスクリームを選びました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Naples (Italian: Napoli), a city in southern Italy.","priority":"★★★"},"pronunciation":{"ipa":"/niːəˈpɒlɪtən/","syllables":"Ne-a-pol-i-tan"},"inflection":{"noun_plural":"Neapolitans"},"usage_notes":{"explanation":"The word \"Neapolitan\" can refer to several things related to Naples, Italy. It can describe people, language, cuisine, or culture. It's important to note that in Japan, \"Neapolitan\" also refers to a specific pasta dish. Also, \"Neapolitan ice cream\" refers to a type of ice cream with vanilla, chocolate, and strawberry flavors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to try the napolitan pizza.","correct":"✓ I want to try the Neapolitan pizza.","note":"Make sure to capitalize 'Neapolitan' when referring to something from Naples."},{"incorrect":"✗ He is a napolitan.","correct":"✓ He is a Neapolitan.","note":"Capitalize 'Neapolitan' when referring to a person from Naples."}],"priority":"★★☆"},"related_words":{"derivatives":["Naples","Napoli"],"phrases":["Neapolitan Mastiff (a breed of dog)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but commonly used in specific contexts (e.g., food, travel).","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Neapolitan' means something that comes from or is related to Naples, a city in Italy. It can describe people, language, food, or other things. For example, Neapolitan pizza is a type of pizza made in the style of Naples. Also, in some countries, 'Neapolitan' can refer to a type of ice cream with vanilla, chocolate, and strawberry flavors. So, when you see 'Neapolitan,' think of Naples, Italy, or the specific things associated with it."},"example_sentences":[{"sentence":"We enjoyed authentic Neapolitan pizza during our trip to Italy.","translation":"イタリア旅行中に本格的なナポリ風ピザを楽しみました。","type":"adjective","meaning_category":"relating to Naples"},{"sentence":"She is a Neapolitan and proud of her heritage.","translation":"彼女はナポリ人で、自分の遺産を誇りに思っています。","type":"noun","meaning_category":"person from Naples"},{"sentence":"I love Neapolitan ice cream because it has all my favorite flavors.","translation":"ナポリタンアイスクリームは好きな味が全部入っているので大好きです。","type":"noun","meaning_category":"ice cream"},{"sentence":"He ordered a plate of Neapolitan pasta at the Japanese restaurant.","translation":"彼は日本のレストランでナポリタンパスタを注文しました。","type":"noun","meaning_category":"pasta dish"}]}