{"word":"urluch","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Mongolian mythology) a type of malevolent spirit or demon.","english_definition":"In Mongolian mythology, an urluch is a type of malevolent spirit or demon, often associated with causing harm or misfortune.","examples":[{"sentence":"The shaman performed a ritual to ward off the urluch.","translation":"シャーマンはウルルチを追い払うための儀式を行った。"},{"sentence":"Ancient Mongolians believed that urluchs were responsible for diseases and natural disasters.","translation":"古代モンゴル人は、ウルルチが病気や自然災害の原因であると信じていた。"}],"collocations":["ward off urluch","banish urluch","protect against urluch","urluch attack","urluch possession"],"synonyms":["demon","evil spirit","malevolent spirit"],"antonyms":["benevolent spirit","god","deity"]}],"etymology":{"value":"From Mongolian folklore and mythology. The exact etymology within Mongolian language may require further linguistic analysis.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈʊrlʊk/","syllables":"ur-luch"},"inflection":{"notes":"Plural form is likely 'urluchs', following standard English pluralization, but this is not definitively established in mythological texts."},"usage_notes":{"explanation":"The term 'urluch' is primarily used within the context of Mongolian mythology and folklore. It refers to a specific type of harmful spirit and is not commonly used in everyday language. Its usage is largely confined to discussions of Mongolian culture, religion, and mythology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was urluch.","correct":"✓ He was possessed by an urluch.","note":"'Urluch' is a noun referring to the spirit itself, not an adjective describing a person's state. Use constructions like 'possessed by an urluch' to describe someone influenced by the spirit."},{"incorrect":"✗ Urluchs are good spirits.","correct":"✓ Urluchs are evil spirits.","note":"Urluchs are inherently malevolent in Mongolian mythology."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["shamanism","Mongolian mythology","demonology","spirituality"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (specific cultural term)","frequency_google_ngram":"Very low frequency (specific to Mongolian folklore)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'urluch' is a highly specialized term from Mongolian mythology. Understanding its meaning requires familiarity with Mongolian folklore and religious beliefs. It is not part of general English vocabulary and would only be encountered in specific academic or cultural contexts. Therefore, readability is high due to the specialized nature of the term."},"example_sentences":[{"sentence":"The nomadic tribes feared the wrath of the urluch during the harsh winter months.","translation":"遊牧民の部族は、厳しい冬の間にウルルチの怒りを恐れていた。","type":"noun","meaning_category":"mythology"},{"sentence":"Stories were told around the campfire of heroes who battled and defeated the urluch.","translation":"キャンプファイヤーの周りでは、ウルルチと戦い打ち負かした英雄たちの物語が語られた。","type":"noun","meaning_category":"mythology"}]}