{"word":"protograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的または言語学)原型、原形、祖型、オリジナルモデル","english_definition":"An early or original form of something, from which later forms are derived; a prototype or original model. In linguistics, it refers to the earliest reconstructed form of a word or language.","examples":[{"sentence":"The ancient artifact is considered the protograph of modern tools.","translation":"その古代の工芸品は、現代の道具の原型と考えられている。"},{"sentence":"Linguists are trying to reconstruct the protograph of the Indo-European language family.","translation":"言語学者はインド・ヨーロッパ語族の祖語を再構築しようとしている。"}],"collocations":["protograph of a word","protograph of a language","protograph of a tool","protograph of an idea"],"synonyms":["prototype","archetype","original","ancestor","precursor"],"antonyms":["derivative","descendant","copy"]}],"etymology":{"value":"Derived from the Greek words 'protos' (meaning 'first') and 'grapho' (meaning 'I write').","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊtəˌɡræf/","syllables":"pro-to-graph"},"inflection":{"noun_plural":"protographs"},"usage_notes":{"explanation":"The term 'protograph' is used in historical and linguistic contexts to refer to the earliest known or reconstructed form of something. It emphasizes the idea of an original model or ancestor from which later versions evolved. In linguistics, it is specifically used to describe the reconstructed ancestor of a language or a word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a photograph of the protograph.","correct":"✓ This is a photograph of the prototype.","note":"'Protograph' refers to the original model itself, not a picture of it. Use 'prototype' if you mean the original model."}],"priority":"★★☆"},"related_words":{"derivatives":["prototype","archetype","graph","-graphy"],"related_terms":["proto-language","proto-form","proto-word"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protograph' is a specialized term, primarily used in academic contexts, particularly in history and linguistics. It refers to the earliest form or model of something, from which later versions are derived. Understanding this term requires a grasp of historical and linguistic concepts, making it suitable for advanced learners."},"example_sentences":[{"sentence":"This ancient sculpture is believed to be the protograph of later artistic styles.","translation":"この古代の彫刻は、後の芸術様式の原型であると考えられている。","type":"noun","meaning_category":"original model"},{"sentence":"Reconstructing the protograph of the language is a complex task.","translation":"その言語の祖語を再構築することは複雑な作業である。","type":"noun","meaning_category":"linguistics"}]}