{"word":"comptometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コンプトメーター（加算器の一種）","english_definition":"a key-driven mechanical calculator.","examples":[{"sentence":"She used a comptometer to calculate the payroll.","translation":"彼女は給与計算をするためにコンプトメーターを使った。"},{"sentence":"The comptometer was a common office machine before the advent of electronic calculators.","translation":"コンプトメーターは、電子計算機が登場する前の一般的な事務機器だった。"}],"collocations":["operate a comptometer","use a comptometer","mechanical comptometer"],"synonyms":["adding machine","calculator","mechanical calculator"],"antonyms":[]}],"etymology":{"value":"Derived from 'compute' + '-o-' (connecting vowel) + '-meter' (measuring device).","priority":"★★☆"},"pronunciation":{"ipa":"/kɒmpˈtɒmɪtər/","syllables":"comp-tom-e-ter"},"inflection":{"noun_plural":"comptometers"},"usage_notes":{"explanation":"A comptometer is a specific type of mechanical calculator where each column of digits has its own set of keys. Unlike other calculators where you enter numbers sequentially, on a comptometer, you press multiple keys simultaneously to add numbers. It was widely used in business offices for accounting and bookkeeping before electronic calculators became prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a computer to add the numbers.","correct":"✓ I used a comptometer to add the numbers.","note":"A 'computer' is a general-purpose electronic device, while a 'comptometer' is a specific type of mechanical calculator. Use 'comptometer' only when referring to the mechanical device."}],"priority":"★☆☆"},"related_words":{"derivatives":["comptometrist (noun: a person who operates a comptometer)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare in modern usage)","frequency_google_ngram":"Very low frequency - mostly historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'comptometer' refers to a specific type of key-driven mechanical calculator, primarily used in the late 19th and early to mid-20th centuries. Understanding this term requires familiarity with historical office equipment and calculating devices. It is not commonly used in contemporary language unless discussing historical technology or accounting practices."},"example_sentences":[{"sentence":"The operator skillfully used the comptometer to process invoices quickly.","translation":"オペレーターは熟練した手つきでコンプトメーターを使い、迅速に請求書を処理した。","type":"noun","meaning_category":"加算器"},{"sentence":"Before computers, the comptometer was essential for complex calculations in accounting.","translation":"コンピューターが登場する前は、コンプトメーターは会計における複雑な計算に不可欠だった。","type":"noun","meaning_category":"加算器"}]}