{"word":"benefactor-supported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(組織、プロジェクトなどが) 恩人・後援者によって支援されている","english_definition":"Supported or funded by a benefactor or benefactors.","examples":[{"sentence":"The museum is benefactor-supported, relying on donations from wealthy individuals.","translation":"その美術館は恩人からの寄付に頼っており、恩人によって支援されています。"},{"sentence":"The research project is benefactor-supported, allowing scientists to pursue innovative ideas.","translation":"その研究プロジェクトは恩人によって支援されており、科学者たちは革新的なアイデアを追求することができます。"}],"collocations":["benefactor-supported organization","benefactor-supported project","benefactor-supported institution","benefactor-supported program"],"synonyms":["donor-funded","philanthropically-supported","charitably-funded","grant-aided"],"antonyms":["self-funded","government-funded","privately-owned","commercial"],"notes":"This term is often used to describe non-profit organizations, educational institutions, or research initiatives that rely on the generosity of individuals or foundations for their financial support."}],"etymology":{"value":"Combination of 'benefactor' (a person who gives money or other help to a person or cause) and 'supported' (maintained by providing money or other assistance).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛnɪˌfæktər səˈpɔːrtɪd/","syllables":"ben-e-fac-tor sup-port-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'benefactor-supported' indicates that the entity in question receives significant financial or other material assistance from benefactors. This support is often crucial for the entity's operation and sustainability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The project is benefactor support.","correct":"✓ The project is benefactor-supported.","note":"'Benefactor support' is a noun phrase. Use 'benefactor-supported' as an adjective to describe the project."}],"priority":"★★☆"},"related_words":{"derivatives":["benefactor","support","benefaction","beneficiary"],"related_terms":["philanthropy","donation","endowment","grant","sponsor"],"priority":"★★☆"},"level_frequency":{"notes":"The term 'benefactor-supported' is not a common word, but the individual words 'benefactor' and 'support' are frequently used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Benefactor-supported' is a compound adjective used to describe something that receives financial or other assistance from a benefactor. A benefactor is someone who gives money or help to a person or cause. The term is often used in the context of non-profit organizations, educational institutions, or research projects. Understanding the individual words 'benefactor' and 'supported' helps in comprehending the meaning of the compound word."},"example_sentences":[{"sentence":"The university's library is largely benefactor-supported, allowing it to maintain an extensive collection of books and resources.","translation":"その大学の図書館は主に恩人によって支援されており、広範な書籍や資料のコレクションを維持することができます。","type":"adjective","meaning_category":"支援されている"},{"sentence":"The local arts organization is benefactor-supported, providing free workshops and performances to the community.","translation":"地元の芸術団体は恩人によって支援されており、地域社会に無料のワークショップや公演を提供しています。","type":"adjective","meaning_category":"支援されている"}]}