{"word":"cholee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A close-fitting, cropped blouse or bodice worn with a sari or lehenga in South Asia, particularly in India.","english_definition":"A close-fitting short-sleeved blouse worn by women in India, typically with a sari or lehenga.","examples":[{"sentence":"She wore a beautiful silk sari with a matching cholee.","translation":"彼女は美しいシルクのサリーとそれに合うチョーリーを着ていた。"},{"sentence":"The cholee was intricately embroidered with gold thread.","translation":"そのチョーリーは金糸で精巧に刺繍されていた。"}],"collocations":["sari and cholee","embroidered cholee","silk cholee","designer cholee","wear a cholee"],"synonyms":["blouse","bodice"],"antonyms":[]}],"etymology":{"value":"Derived from the Hindi word 'cholī' (चोली), which refers to the same garment. The word has roots in Sanskrit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃoʊliː/","syllables":"cho-lee"},"inflection":{"noun_plural":"cholees"},"usage_notes":{"explanation":"The term 'cholee' is primarily used in the context of South Asian fashion and culture. It is an essential part of the traditional attire worn with saris and lehengas. The style and design of the cholee can vary greatly, ranging from simple and plain to highly embellished and ornate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a cholee with jeans.","correct":"✓ She wore a cholee with a sari.","note":"A cholee is traditionally worn with a sari or lehenga, not with Western clothing like jeans."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["sari","lehenga","ghagra choli","Indian fashion","South Asian clothing"],"priority":"★★★"},"level_frequency":{"CEFR":"Not applicable (cultural term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cholee' is a specialized term referring to a specific type of garment in South Asian fashion. Understanding its meaning requires familiarity with Indian clothing and culture. It is not a commonly used word outside of this context.","priority":"★★☆"},"example_sentences":[{"sentence":"The bride's red sari was complemented by a stunning gold cholee.","translation":"花嫁の赤いサリーは、見事な金のチョーリーによって引き立てられていた。","type":"noun","meaning_category":"clothing"},{"sentence":"She designed a modern cholee with a halter neck.","translation":"彼女はホルターネックのモダンなチョーリーをデザインした。","type":"noun","meaning_category":"clothing"},{"sentence":"The dancers wore colorful cholees and swirling skirts.","translation":"ダンサーたちはカラフルなチョーリーと渦巻くスカートを身に着けていた。","type":"noun","meaning_category":"clothing"}]}