{"word":"shunningly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"避けるように、無視するように、仲間はずれにするように","english_definition":"In a manner that avoids, ignores, or ostracizes someone or something.","examples":[{"sentence":"He was shunningly treated by his former friends after the scandal.","translation":"そのスキャンダルの後、彼はかつての友人たちから避けるように扱われた。"},{"sentence":"She looked at him shunningly, not wanting to acknowledge his presence.","translation":"彼女は彼の存在を認めたくないように、避けるような目で彼を見た。"},{"sentence":"The new policy was shunningly received by the employees, who felt it was unfair.","translation":"その新しい政策は、不公平だと感じた従業員たちから無視するように受け止められた。"}],"collocations":["treat shunningly","look at shunningly","receive shunningly"],"synonyms":["avoidingly","evasively","ostracizingly","rejectingly","disdainfully","coldly","distantly"],"antonyms":["acceptingly","welcomingly","warmly","embracingly","amiably"]}],"etymology":{"value":"Derived from the verb 'shun' (to persistently avoid, ignore, or reject someone or something) and the suffix '-ingly' (in a specified manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʌnɪŋli/","syllables":"shun-ning-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Shunningly' describes the manner in which someone or something is avoided or ostracized. It emphasizes the act of deliberately ignoring or rejecting. It's often used to describe social situations where someone is being excluded or treated with disdain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted shunningly towards the dog.","correct":"✓ She acted coldly towards the dog.","note":"'Shunningly' is typically used in the context of interpersonal relationships or social situations where deliberate exclusion is involved. While it could technically be used to describe treatment of an animal, 'coldly' or 'distantly' are more common and natural choices."},{"incorrect":"✗ The shunningly behavior of the group was obvious.","correct":"✓ The shunning behavior of the group was obvious.","note":"'Shunningly' is an adverb and modifies a verb. 'Shunning' can be used as an adjective to describe the behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["shun (verb)","shunning (noun/adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shunningly' is an adverb that describes an action done in a way that avoids or ignores someone or something, often indicating deliberate exclusion or rejection. It's not a common word, so it's more likely to be encountered in advanced texts dealing with social dynamics or interpersonal relationships where ostracism or avoidance is a key theme."},"example_sentences":[{"sentence":"The community treated him shunningly after he broke their traditions.","translation":"彼はコミュニティの伝統を破った後、コミュニティから避けるように扱われた。","type":"adverb","meaning_category":"avoiding"},{"sentence":"She responded shunningly to his attempts to apologize.","translation":"彼女は彼の謝罪の試みに、避けるように対応した。","type":"adverb","meaning_category":"ignoring"},{"sentence":"The proposal was shunningly dismissed by the board.","translation":"その提案は、役員会によって無視するように却下された。","type":"adverb","meaning_category":"rejecting"}]}