{"word":"impropriator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国国教会の)教会財産私有者、教会領横領者","english_definition":"A lay person or corporation that holds the rights to a benefice (church living) formerly belonging to a religious house.","examples":[{"sentence":"The impropriator received the tithes from the parish.","translation":"教会財産私有者は教区から十分の一税を受け取った。"},{"sentence":"The local college became the impropriator of the church lands.","translation":"地元の大学が教会領の教会財産私有者となった。"}],"collocations":["lay impropriator","corporate impropriator"],"synonyms":["lay rector","patron"],"antonyms":[]}],"etymology":{"value":"From Late Latin *impropriatus*, past participle of *impropriare* (\"to appropriate\"), from *in-* + *proprius* (\"one's own\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈproʊpriˌeɪtər/","syllables":"im-pro-pri-a-tor"},"inflection":{"noun_plural":"impropriators"},"usage_notes":{"explanation":"An *impropriator* is a person or corporation (often a college) that owns the rights to tithes (a tenth of agricultural produce or earnings formerly taken as a tax for the support of the church and clergy) or a benefice (an ecclesiastical living) that originally belonged to a monastery or other religious institution. This often occurred after the Dissolution of the Monasteries in England during the 16th century. The term is primarily used in the context of the Church of England.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an appropriator of church funds.","correct":"✓ He is an impropriator of the church.","note":"`Appropriator` generally refers to someone who takes something for their own use, while `impropriator` specifically refers to someone who holds the rights to a benefice or tithes formerly belonging to a religious house."}],"priority":"★☆☆"},"related_words":{"derivatives":["impropriate (verb)","impropriation (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *impropriator* is a highly specialized term primarily used in the context of the Church of England's history and structure. It refers to a layperson or corporation that holds the rights to a benefice or tithes that were originally owned by a religious institution, often as a result of the Dissolution of the Monasteries. Understanding this term requires familiarity with ecclesiastical history and terminology. It is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"As the impropriator, the university received the income from the parish lands.","translation":"教会財産私有者として、その大学は教区の土地からの収入を受け取った。","type":"noun","meaning_category":"教会財産私有者"},{"sentence":"The impropriator was responsible for appointing the curate to the parish.","translation":"教会財産私有者は教区の副牧師を任命する責任があった。","type":"noun","meaning_category":"教会財産私有者"}]}