{"word":"misprizer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古用法)軽蔑する人、見下す人","english_definition":"(archaic) One who undervalues or despises.","examples":[{"sentence":"He was known as a misprizer of talent, often overlooking skilled individuals.","translation":"彼は才能を軽蔑する人として知られており、熟練した個人を見過ごすことが多かった。"}],"collocations":["a misprizer of talent","a misprizer of virtue"],"synonyms":["despiser","undervaluer","scornful person"],"antonyms":["admirer","appreciator"]},{"part_of_speech":"noun","definition":"(古用法)犯罪を軽視する人、犯罪を隠蔽する人","english_definition":"(archaic) One who conceals or is privy to a crime, but does not participate in it.","examples":[{"sentence":"The misprizer of treason was punished less severely than the traitor himself.","translation":"反逆罪を隠蔽した者は、反逆者自身よりも軽い罰を受けた。"}],"collocations":["misprizer of treason","misprizer of felony"],"synonyms":["concealer","accessory (after the fact)"],"antonyms":["informant","whistleblower"]}],"etymology":{"value":"Derived from \"misprise,\" meaning to despise or undervalue.","priority":"★★☆"},"pronunciation":{"ipa":"/mɪsˈpraɪzər/","syllables":"mis-priz-er"},"inflection":{"noun_plural":"misprizers"},"usage_notes":{"explanation":"The term \"misprizer\" is archaic and rarely used in modern English. It primarily refers to someone who either despises or undervalues something, or someone who is aware of a crime but does not report it, effectively concealing it. The legal sense is particularly obsolete.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a misprizer of her own achievements.","correct":"✓ She was an undervaluer of her own achievements.","note":"In modern English, \"undervaluer\" is a more common and understandable substitute for \"misprizer\" in the context of undervaluing achievements."}],"priority":"★☆☆"},"related_words":{"derivatives":["misprise (verb, noun)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"misprizer\" is an archaic term with two primary meanings: one who despises or undervalues, or one who conceals a crime. Due to its rarity, it is not commonly understood in modern English. When referring to someone who despises or undervalues, more common terms like \"despiser\" or \"undervaluer\" are preferred. In a legal context, it refers to someone who knows about a crime but does not report it, a concept that is now typically described using other legal terms."},"example_sentences":[{"sentence":"The king considered him a misprizer of royal authority.","translation":"王は彼を王権を軽視する者と見なした。","type":"noun","meaning_category":"軽蔑する人"},{"sentence":"As a misprizer of treason, he faced serious legal consequences.","translation":"反逆罪を隠蔽した者として、彼は重大な法的結果に直面した。","type":"noun","meaning_category":"犯罪を隠蔽する人"}]}