{"word":"Talukdari","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド亜大陸の歴史)タルクダール制度、またはその制度下の土地所有権","english_definition":"(historical in the Indian subcontinent) a system of land tenure or the estate held under that system.","examples":[{"sentence":"The Talukdari system was prevalent in several parts of British India.","translation":"タルクダール制度は、イギリス領インドのいくつかの地域で普及していました。"},{"sentence":"Under the Talukdari system, Talukdars served as intermediaries between the government and the cultivators.","translation":"タルクダール制度の下では、タルクダールは政府と耕作者の間の仲介者として機能しました。"}],"collocations":["Talukdari system","Talukdari estate","Talukdari rights"],"synonyms":["Zamindari","Jagirdari"],"antonyms":[]}],"etymology":{"value":"Derived from the Persian/Arabic word 'taluka' meaning a subdivision of a district, combined with the Persian suffix '-dari' meaning 'holder' or 'possessor'. Thus, Talukdari refers to the holding or possession of a taluka.","priority":"★★☆"},"pronunciation":{"ipa":"/təˈlʌkdɑːri/","syllables":"ta-luk-da-ri"},"inflection":{"noun_plural":"Talukdaris"},"usage_notes":{"explanation":"'Talukdari' specifically refers to a historical land tenure system primarily found in parts of India, particularly during the Mughal and British periods.  It describes both the system and the land held under that system. The 'Talukdar' was a type of landlord or revenue collector.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Talukdari of the company.","correct":"✓ He was a Talukdar.","note":"'Talukdari' is the system or the estate, not the person. A person holding the estate is a 'Talukdar'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Talukdar (noun: the holder of a Talukdari estate)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Talukdari' is a specialized term relating to historical land ownership systems in India. Understanding requires knowledge of South Asian history and land tenure terminology. It is not commonly used outside of academic or historical contexts. The word refers to the system itself, and the land controlled under that system. The person who controls the land is called a 'Talukdar'."},"example_sentences":[{"sentence":"The abolition of the Talukdari system aimed to redistribute land to the landless.","translation":"タルクダール制度の廃止は、土地を持たない人々に土地を再分配することを目的としていました。","type":"noun","meaning_category":"land tenure system"},{"sentence":"Many disputes arose concerning Talukdari rights after independence.","translation":"独立後、タルクダール制度の権利をめぐる多くの紛争が発生しました。","type":"noun","meaning_category":"land ownership"}]}