{"word":"suberized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コルク化した、コルク質の","english_definition":"Having become impregnated with suberin; converted into corky tissue.","examples":[{"sentence":"The suberized cells of the cork oak protect it from water loss.","translation":"コルクガシのコルク化した細胞は、水分損失から木を守ります。"},{"sentence":"Suberized tissue is often found in the outer layers of plant organs.","translation":"コルク化した組織は、植物器官の外層によく見られます。"}],"collocations":["suberized cell walls","suberized tissue","suberized layer"],"synonyms":["corky","corklike"],"antonyms":["unsuberized"]}],"etymology":{"value":"From 'suberin' (a waxy substance present in corky tissues of plants) + '-ized' (suffix indicating a state or condition).","priority":"★★★"},"pronunciation":{"ipa":"ˈsuːbəraɪzd","syllables":"su-ber-ized"},"inflection":{"notes":"This is an adjective; it does not have plural forms."},"usage_notes":{"explanation":"'Suberized' describes plant tissues or cell walls that have become impregnated with suberin, a waxy substance. This process makes the tissue waterproof and resistant to decay, similar to cork. It's commonly used in botany and plant physiology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree was suberized with paint.","correct":"✓ The tree was covered with paint.","note":"'Suberized' specifically refers to the natural process of suberin deposition in plant tissues, not to being covered with a substance like paint."}],"priority":"★★☆"},"related_words":{"derivatives":["suberin","suberization"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Suberized' is a technical term used in botany to describe plant tissues that have undergone a process of becoming cork-like due to the deposition of suberin. Understanding this term requires a background in plant biology or a related field. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The root endodermis becomes suberized to control water uptake.","translation":"根の内皮は、水の吸収を制御するためにコルク化されます。","type":"adjective","meaning_category":"Botany"},{"sentence":"The wound was quickly suberized, preventing infection.","translation":"傷はすぐにコルク化され、感染を防ぎました。","type":"adjective","meaning_category":"Botany"}]}