{"word":"irresuscitably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"回復不能に、蘇生不能に","english_definition":"in a way that cannot be revived or brought back to life; beyond the possibility of resurrection or restoration.","examples":[{"sentence":"The patient was injured so severely that he was irresuscitably damaged.","translation":"患者は非常に重傷を負い、回復不能な状態だった。"},{"sentence":"The old tradition was lost so completely that it was irresuscitably gone.","translation":"その古い伝統は完全に失われ、蘇ることはなかった。"}],"collocations":["irresuscitably damaged","irresuscitably lost","irresuscitably destroyed"],"synonyms":["irreversibly","irretrievably","hopelessly","incurably","fatally"],"antonyms":["resuscitably","revivably","recoverably","restorably"]}],"etymology":{"value":"\"Ir-\" (not) + \"resuscitable\" (able to be revived) + \"-ly\" (adverbial suffix). \"Resuscitable\" is derived from \"resuscitate,\" which comes from Latin \"resuscitare\" (to raise up again, revive).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪrɪˈsʌsɪtəbli","syllables":"ir-re-sus-ci-ta-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Irresuscitably\" is a formal and relatively rare adverb. It describes a state or condition that is beyond recovery, revival, or restoration. It emphasizes the finality and irreversibility of the situation. It is often used in medical, philosophical, or abstract contexts to describe something that is permanently lost or damaged.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was irresuscitable.","correct":"✓ The situation was irresuscitably hopeless.","note":"\"Irresuscitably\" is an adverb, so it modifies verbs, adjectives, or other adverbs, not nouns. Use an adjective like \"hopeless\" or \"irreversible\" to describe the situation itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["irresuscitable (adjective)","resuscitate (verb)","resuscitation (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Irresuscitably\" is a highly formal and uncommon word. It means something cannot be brought back to life or restored. It's used to emphasize that a situation is completely and permanently beyond recovery. Because of its rarity and complexity, it's typically encountered in advanced academic or philosophical texts."},"example_sentences":[{"sentence":"The company's reputation was irresuscitably tarnished by the scandal.","translation":"その会社の名声は、スキャンダルによって回復不能なほど傷つけられた。","type":"adverb","meaning_category":"回復不能に"},{"sentence":"The ancient language was irresuscitably lost after the last native speaker died.","translation":"その古代言語は、最後のネイティブスピーカーが亡くなった後、回復不能なほど失われた。","type":"adverb","meaning_category":"蘇生不能に"}]}