{"word":"Arboret","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(植物学) 樹木園、植物園","english_definition":"A botanical garden containing living collections of trees and shrubs intended at least partly for scientific study.","examples":[{"sentence":"The arboret is home to a diverse collection of trees from around the world.","translation":"その樹木園には、世界中の多様な樹木が集められている。"},{"sentence":"Researchers use the arboret to study tree growth and adaptation.","translation":"研究者たちは、樹木の成長と適応を研究するためにその植物園を利用する。"}],"collocations":["visit an arboret","explore an arboret","arboret collection","arboret research","arboret staff"],"synonyms":["botanical garden","tree garden","dendrarium"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'arbor' meaning 'tree', with the suffix '-etum' indicating a place where something grows.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrbəˌrɛt/","syllables":"Ar-bo-ret"},"inflection":{"noun_plural":"Arborets"},"usage_notes":{"explanation":"An arboret is a specialized type of botanical garden that focuses primarily on trees and woody plants. It serves as a living laboratory for scientific study, conservation, and public education. Arborets often have curated collections, labeled specimens, and research programs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the arboretum to see the flowers.","correct":"✓ I went to the arboretum to see the trees.","note":"While an arboretum may have some flowers, its primary focus is on trees and shrubs. A general botanical garden is a better place to see a wide variety of flowers."},{"incorrect":"✗ An arboret is the same as a forest.","correct":"✓ An arboret is a cultivated collection of trees, unlike a natural forest.","note":"An arboret is a managed and curated collection, while a forest is a natural ecosystem."}],"priority":"★★☆"},"related_words":{"derivatives":["arboreal (adjective: relating to trees)","arboriculture (noun: the cultivation of trees and shrubs)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arboret' is a specialized term referring to a botanical garden dedicated to trees and shrubs. It's not a commonly used word in everyday conversation but is relevant in botanical and environmental contexts. Understanding the term requires some familiarity with scientific vocabulary."},"example_sentences":[{"sentence":"The city's arboret offers a peaceful escape from the urban environment.","translation":"その都市の樹木園は、都会の環境からの静かな逃避場所を提供する。","type":"general","meaning_category":"description"},{"sentence":"The arboret is used for educational programs about tree identification and conservation.","translation":"その植物園は、樹木の識別と保護に関する教育プログラムのために使用される。","type":"educational","meaning_category":"purpose"},{"sentence":"Many rare and endangered tree species are preserved in the arboret.","translation":"多くの希少で絶滅危惧種の樹木がその植物園で保護されている。","type":"conservation","meaning_category":"preservation"}]}