{"word":"dementieren","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(公式に)否定する、反論する、打ち消す","english_definition":"to deny (a statement or allegation); to contradict; to refute officially.","examples":[{"sentence":"Die Regierung dementierte die Gerüchte über eine bevorstehende Steuererhöhung.","translation":"政府は、差し迫った増税に関する噂を否定した。","english_translation":"The government denied the rumors about an imminent tax increase."},{"sentence":"Der Sprecher dementierte die Behauptungen in der Zeitung.","translation":"報道官は新聞の主張を否定した。","english_translation":"The spokesperson denied the allegations in the newspaper."},{"sentence":"Die Firma dementierte, in den Skandal verwickelt zu sein.","translation":"その会社は、スキャンダルに関与していることを否定した。","english_translation":"The company denied being involved in the scandal."}],"collocations":["Gerüchte dementieren (噂を否定する)","Behauptungen dementieren (主張を否定する)","Vorwürfe dementieren (非難を否定する)","offiziell dementieren (公式に否定する)"],"synonyms":["leugnen","bestreiten","widerlegen","zurückweisen","entkräften"],"antonyms":["bestätigen","bejahen","bekräftigen","zugeben","eingestehen"]}],"etymology":{"value":"Das Wort stammt vom lateinischen 'dementire', was 'verrückt machen' oder 'den Verstand nehmen' bedeutet. Es setzt sich zusammen aus 'de-' (weg-, ab-) und 'mentire' (lügen, täuschen). Die heutige Bedeutung entwickelte sich über die Vorstellung, dass eine Falschaussage den Zuhörer 'verrückt' macht oder in die Irre führt.","priority":"N/A"},"pronunciation":{"ipa":"/de.mɛnˈtiː.ʁən/","syllables":"de-men-tie-ren"},"inflection":{"verb_forms":{"present_simple":["dementiere","dementierst","dementiert","dementieren","dementiert","dementieren"],"past_simple":"dementierte","past_participle":"dementiert","present_participle":"dementierend"}},"usage_notes":{"explanation":"'Dementieren' wird verwendet, wenn eine offizielle oder formelle Aussage gemacht wird, um eine Behauptung, ein Gerücht oder eine Anschuldigung zu widerlegen. Es impliziert oft, dass die widerlegte Information potenziell schädlich oder rufschädigend ist. Es ist stärker als einfaches 'Leugnen' und wird häufig in politischen, wirtschaftlichen oder rechtlichen Kontexten verwendet.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Er hat die Wahrheit dementiert.","correct":"Er hat die Wahrheit geleugnet.","note":"'Dementieren' bezieht sich auf Aussagen oder Behauptungen, nicht auf die Wahrheit selbst. 'Leugnen' ist passender, um die Wahrheit zu verneinen."},{"incorrect":"Ich dementiere meine Gefühle für sie.","correct":"Ich leugne meine Gefühle für sie.","note":"'Dementieren' wird selten für persönliche Gefühle verwendet. 'Leugnen' ist hier die korrekte Wahl."}],"priority":"N/A"},"related_words":{"derivatives":["Dementi (名詞: 否定、反論、公式声明)","Dementierung (名詞: 否定の行為)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relativ selten, aber in Nachrichten und formellen Kontexten gebräuchlich.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Dementieren' bedeutet, eine Aussage, ein Gerücht oder eine Anschuldigung offiziell zu widerlegen oder zu bestreiten. Es wird oft in formellen Kontexten verwendet, wie z.B. in Nachrichtenberichten oder politischen Erklärungen. Es ist ein stärkeres Wort als 'leugnen' und impliziert, dass die widerlegte Information potenziell schädlich oder rufschädigend ist. Achten Sie darauf, es nicht mit 'leugnen' zu verwechseln, das eine allgemeinere Verneinung bedeutet."},"example_sentences":[{"sentence":"Der Präsident musste die Anschuldigungen der Korruption öffentlich dementieren.","translation":"大統領は汚職の告発を公に否定しなければならなかった。","type":"verb","meaning_category":"公式に否定する"},{"sentence":"Die Polizei dementierte Berichte über eine Festnahme.","translation":"警察は逮捕に関する報道を否定した。","type":"verb","meaning_category":"公式に否定する"},{"sentence":"Das Unternehmen gab ein Dementi heraus, um die Falschmeldungen zu korrigieren.","translation":"会社は誤った報道を訂正するために否定声明を発表した。","type":"noun (Dementi)","meaning_category":"否定声明"}]}