{"word":"Marasmius","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(菌類) ホウロクタケ属","english_definition":"A genus of fungi in the family Marasmiaceae, characterized by their small size, wiry stems, and ability to revive from a dried state.","examples":[{"sentence":"Several species of Marasmius are known to decompose leaf litter.","translation":"ホウロクタケ属のいくつかの種は、落ち葉を分解することが知られています。"},{"sentence":"Marasmius oreades, commonly known as the fairy ring mushroom, is a member of this genus.","translation":"一般的に妖精の輪キノコとして知られる Marasmius oreades は、この属の一種です。"}],"collocations":["Marasmius oreades (fairy ring mushroom)","Marasmius androsaceus (horsehair fungus)","Marasmius rotula (pinwheel mushroom)"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"Derived from the Greek word 'marasmos', meaning 'drying up', referring to the ability of these mushrooms to revive after drying.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈræzmiəs/","syllables":"ma-raz-mi-us"},"inflection":{"noun_plural":"Marasmii"},"usage_notes":{"explanation":"'Marasmius' refers to a specific genus of mushrooms. It is a technical term used in mycology (the study of fungi). When discussing mushrooms in general conversation, it's more common to use common names or broader classifications unless specifically identifying a species within this genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a Marasmius in my garden, it was delicious!","correct":"✓ I found a mushroom in my garden, and it was delicious!","note":"Unless you are certain of the species, it's better to simply say 'mushroom'. Many mushrooms are poisonous."}],"priority":"★☆☆"},"related_words":{"derivatives":["Marasmiaceae (family)","mycology (study of fungi)"],"phrasal_verbs":["none"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Marasmius' is a scientific term used in the field of mycology to refer to a specific genus of fungi. It is not commonly used in everyday language. Understanding this term requires knowledge of biological classification and fungal characteristics. The term's usage is primarily limited to scientific literature and discussions among mycologists."},"example_sentences":[{"sentence":"The mycologist identified the specimen as a Marasmius based on its microscopic features.","translation":"菌学者は、その標本を顕微鏡的な特徴に基づいてホウロクタケ属であると特定しました。","type":"noun","meaning_category":"菌類"},{"sentence":"Marasmius species are known for their ability to decompose organic matter in forests.","translation":"ホウロクタケ属の種は、森林で有機物を分解する能力があることで知られています。","type":"noun","meaning_category":"菌類"}]}