{"word":"Pseudomorphia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) 身体の醜形恐怖症；自分の身体に欠陥がある、または醜いと確信する精神疾患","english_definition":"(medicine) Body dysmorphic disorder; a mental illness in which a person is preoccupied with minor or imagined physical flaws.","examples":[{"sentence":"She suffered from Pseudomorphia and believed her nose was grotesquely large.","translation":"彼女は醜形恐怖症に苦しんでおり、自分の鼻がひどく大きいと信じていた。"},{"sentence":"Therapy can help individuals with Pseudomorphia to manage their anxiety and distorted perceptions.","translation":"セラピーは、醜形恐怖症を持つ人が不安や歪んだ認識を管理するのに役立つ。"}],"collocations":["body dysmorphic disorder","mental health","cognitive behavioral therapy"],"synonyms":["body dysmorphic disorder","BDD"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pseudo' (false) and 'morphē' (form), reflecting the distorted perception of one's physical form.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊˈmɔːrfiə","syllables":"pseu-do-mor-phi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Pseudomorphia' is a term sometimes used to describe Body Dysmorphic Disorder (BDD), a mental health condition characterized by obsessive focus on perceived flaws in appearance. While 'Body Dysmorphic Disorder' is the more commonly used and recognized term in modern medical and psychological contexts, 'Pseudomorphia' highlights the distorted or false perception of one's body image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pseudomorphia, so he's just vain.","correct":"✓ He has pseudomorphia, which causes him significant distress about his appearance.","note":"Pseudomorphia (BDD) is a serious mental health condition, not simply vanity. It causes significant distress and impairment in functioning."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudomorphic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudomorphia' is a specialized medical term referring to Body Dysmorphic Disorder (BDD). It describes a mental health condition where individuals are excessively concerned about perceived flaws in their physical appearance, leading to significant distress and functional impairment. This term is primarily used in medical and psychological contexts and is not commonly encountered in general conversation."},"example_sentences":[{"sentence":"His preoccupation with his appearance was so severe that doctors suspected he had Pseudomorphia.","translation":"彼の外見への執着があまりにもひどいため、医師たちは彼が醜形恐怖症を患っているのではないかと疑った。","type":"noun","meaning_category":"Medical Condition"},{"sentence":"Understanding Pseudomorphia is crucial for mental health professionals to provide appropriate treatment.","translation":"醜形恐怖症を理解することは、精神保健の専門家が適切な治療を提供する上で重要である。","type":"noun","meaning_category":"Medical Condition"}]}