{"word":"resp.","priority":"★☆☆","meanings":[{"part_of_speech":"abbreviation","definition":"それぞれ、各々 (respectively の略)","english_definition":"an abbreviation for 'respectively'.","examples":[{"sentence":"John and Mary won first and second prize, resp.","translation":"ジョンとメアリーはそれぞれ1位と2位を獲得した。"},{"sentence":"The areas are 5 and 10 square meters, resp.","translation":"それぞれの面積は5平方メートルと10平方メートルです。"}],"collocations":["used in lists or sequences to match items","often used in academic or technical writing"],"synonyms":["respectively"],"antonyms":[]}],"etymology":{"value":"Abbreviation of the word 'respectively'.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈspektɪvli/ (full word)","syllables":"re-spec-tive-ly (full word)"},"inflection":{"notes":"Abbreviation, so it does not inflect."},"usage_notes":{"explanation":"'resp.' is an abbreviation for 'respectively'. It is used to indicate that items in one list or sequence correspond to items in another list or sequence in the same order. It avoids ambiguity when matching items. It is most commonly found in formal writing, such as academic papers or technical reports.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ John, Mary, and Tom won first, second, resp.","correct":"✓ John, Mary, and Tom won first, second, and third prize, resp.","note":"The number of items in each list must match. In the incorrect example, there are three names but only two prizes explicitly listed before 'resp.'"},{"incorrect":"✗ The colors are red, blue, resp. to the flags.","correct":"✓ The colors are red and blue, resp., for the first and second flags.","note":"The order must be maintained. It should be clear which item corresponds to which."}],"priority":"★★☆"},"related_words":{"derivatives":["respectively","respect"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'resp.' is an abbreviation for 'respectively'. It's used in writing to show that things in one list match up with things in another list in the same order. You'll usually see it in more formal writing, like research papers or technical reports, to make things clear and avoid confusion. It's not something you'd use in everyday conversation. Make sure the number of things in each list matches up, and that the order is clear."},"example_sentences":[{"sentence":"The heights of the buildings are 10m and 20m, resp.","translation":"それぞれの建物の高さは10メートルと20メートルです。","type":"example","meaning_category":"respectively"},{"sentence":"The first and second terms are x and y, resp.","translation":"それぞれの第1項と第2項はxとyです。","type":"example","meaning_category":"respectively"}]}