{"word":"Ria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リアス式海岸、沈水海岸","english_definition":"A coastal inlet formed by the partial submergence of an unglaciated river valley.","examples":[{"sentence":"The coastline of Galicia, Spain, is characterized by numerous rias.","translation":"スペインのガリシア地方の海岸線は、多数のリアス式海岸によって特徴づけられる。"},{"sentence":"Rias are often deep and narrow, making them ideal for harbors.","translation":"リアス式海岸は多くの場合、深く狭く、港として理想的である。"}],"collocations":["ria coast","ria shoreline","Galician rias"],"synonyms":["drowned valley","inlet","fjord (sometimes used loosely, but fjords are glacially formed)"],"antonyms":[]}],"etymology":{"value":"The term 'ria' comes from the Galician word 'ría', which refers to a coastal inlet. It was first used in a geomorphological context by German geographer Ferdinand von Richthofen in the late 19th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˈriːə/","syllables":"Ree-uh"},"inflection":{"noun_plural":"rias"},"usage_notes":{"explanation":"A 'ria' is a specific type of coastal landform. It is important to distinguish it from a fjord, which is a similar inlet but formed by glacial erosion rather than river valley submergence. Rias are common in areas that were not glaciated during the last ice age.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A ria is formed by glaciers.","correct":"✓ A ria is formed by the submergence of a river valley.","note":"Rias are formed by the submergence of river valleys, while fjords are formed by glaciers."},{"incorrect":"✗ The ria was very wide and shallow.","correct":"✓ Rias are typically deep and narrow.","note":"While there can be variations, rias are generally deep and narrow."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["fjord","estuary","coastline","submergence","geomorphology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in geography and earth science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ria' is a specialized geographical term. It refers to a specific type of coastal inlet created when a river valley is flooded by rising sea levels or land subsidence. It's commonly used in geography, geology, and earth science. Understanding the distinction between a ria and a fjord (which is formed by glacial activity) is important for accurate usage. Because it is a technical term, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The **ria** provided a natural harbor for the small fishing village.","translation":"そのリアス式海岸は、小さな漁村に天然の港を提供した。","type":"noun","meaning_category":"沈水海岸"},{"sentence":"The geomorphology of the region is dominated by **rias** and steep cliffs.","translation":"その地域の地形は、リアス式海岸と切り立った崖が特徴的である。","type":"noun","meaning_category":"沈水海岸"}]}