{"word":"re-employment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再雇用、再就職","english_definition":"The act of employing someone again, especially after a period of unemployment or after retirement.","examples":[{"sentence":"The company offered re-employment to some of its retired workers.","translation":"その会社は退職した従業員の一部に再雇用の機会を提供した。"},{"sentence":"Re-employment rates for older workers have been increasing in recent years.","translation":"高齢者の再就職率は近年上昇している。"},{"sentence":"The government is implementing policies to promote re-employment among the unemployed.","translation":"政府は失業者に対する再就職を促進するための政策を実施している。"}],"collocations":["seek re-employment (再就職を求める)","offer re-employment (再雇用を提供する)","re-employment program (再雇用プログラム)","re-employment assistance (再就職支援)","re-employment rate (再就職率)"],"synonyms":["rehiring","recall","restaffing"],"antonyms":["unemployment","layoff","retirement"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'back') to the word 'employment'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːɪmˈplɔɪmənt/","syllables":"re-em-ploy-ment"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Re-employment' refers specifically to being employed again, often by the same company or in a similar field. It implies a return to work after a period of absence, whether due to job loss, retirement, or other reasons. It is often used in the context of government programs, company policies, or economic statistics related to getting people back into the workforce.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is looking for a new employment after retirement.","correct":"✓ He is looking for re-employment after retirement.","note":"'Re-employment' specifically indicates seeking employment again after a period of being out of work, such as retirement. 'New employment' simply means a new job."},{"incorrect":"✗ The re-employment is a good thing for the economy.","correct":"✓ Re-employment is a good thing for the economy.","note":"The term 're-employment' itself refers to the concept or process, so it doesn't usually require the article 'a'."}],"priority":"★★☆"},"related_words":{"derivatives":["re-employ (verb)","employee (noun)","employer (noun)","employment (noun)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, but common in business and economic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 're-employment' means to be employed again after a period of not being employed. This often happens after someone has retired or lost their job. It's a formal term often used in discussions about the economy, job statistics, and programs designed to help people find work again. It's not a word you'd use in everyday conversation, but it's important to understand in a professional context."},"example_sentences":[{"sentence":"The government is investing in programs to boost re-employment opportunities for veterans.","translation":"政府は退役軍人の再就職機会を増やすためのプログラムに投資している。","type":"noun","meaning_category":"再就職"},{"sentence":"Many companies are now offering re-employment contracts to retain experienced staff.","translation":"多くの企業が経験豊富なスタッフを維持するために、再雇用契約を提供している。","type":"noun","meaning_category":"再雇用"},{"sentence":"The re-employment rate for skilled workers is significantly higher than for unskilled workers.","translation":"熟練労働者の再就職率は、未熟練労働者よりも大幅に高い。","type":"noun","meaning_category":"再就職率"}]}