{"word":"user-story-ready","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(アジャイルソフトウェア開発において)ユーザーストーリーが、開発チームがスプリントで作業を開始するのに十分な詳細と明確さを持っている状態。","english_definition":"(In agile software development) the state of a user story when it has sufficient detail and clarity for the development team to begin working on it in a sprint.","examples":[{"sentence":"Before the sprint planning meeting, the product owner ensures that all user stories are user-story-ready.","translation":"スプリント計画ミーティングの前に、プロダクトオーナーはすべてのユーザーストーリーが開発準備完了状態であることを確認します。"},{"sentence":"A user story is considered user-story-ready when it has a clear acceptance criteria and a reasonable estimate.","translation":"ユーザーストーリーは、明確な受け入れ基準と妥当な見積もりがある場合に、開発準備完了とみなされます。"},{"sentence":"The team uses the INVEST criteria to determine if a user story is user-story-ready.","translation":"チームは、INVEST基準を使用して、ユーザーストーリーが開発準備完了状態であるかどうかを判断します。"}],"collocations":["definition of user-story-ready","criteria for user-story-ready","make a user story user-story-ready","is user-story-ready"],"synonyms":["ready for development","actionable","refined","groomed"],"antonyms":["not ready","unrefined","not actionable"]}],"etymology":{"value":"A compound term combining 'user story' (a short, simple description of a feature told from the perspective of the person who desires the new capability, usually a user or customer of the system) and 'ready' (prepared or available for immediate action or use).","priority":"N/A"},"pronunciation":{"ipa":"/ˈjuːzər ˈstɔːri ˈrɛdi/","syllables":"u-ser sto-ry rea-dy"},"inflection":{"notes":"This term is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'user-story-ready' is specific to agile software development methodologies, particularly Scrum and Kanban. It indicates that a user story has been sufficiently analyzed, discussed, and refined by the product owner and the development team to be included in a sprint or iteration. The 'definition of ready' is often defined by the team and includes criteria such as clear acceptance criteria, a reasonable estimate of effort, and agreement on the story's scope.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The user story is ready, let's start coding immediately without understanding the requirements.","correct":"The user story is user-story-ready, meaning we understand the requirements and have clear acceptance criteria before starting coding.","note":"Confusing 'ready' with 'user-story-ready'. 'User-story-ready' implies a specific set of criteria have been met, not just a general sense of preparedness."},{"incorrect":"We don't need to groom the user stories; they are already user-story-ready.","correct":"We need to groom the user stories to make them user-story-ready before the sprint planning meeting.","note":"Assuming user stories are automatically user-story-ready without proper grooming and refinement."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["user story","sprint","product backlog","definition of ready","INVEST criteria","acceptance criteria","grooming","refinement","agile","scrum","kanban"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specific to agile software development context.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'User-story-ready' is a term used in agile software development. It means a user story (a description of a feature from the user's point of view) is detailed enough for developers to start working on it. This includes having clear goals, acceptance criteria (how to know it's done), and a reasonable estimate of how much work it will take. It's important for efficient sprint planning and execution."},"example_sentences":[{"sentence":"The product owner worked with the team to ensure each user story was user-story-ready before the sprint started.","translation":"プロダクトオーナーは、スプリントが始まる前に、各ユーザーストーリーが開発準備完了状態であることを確認するためにチームと協力しました。","type":"adjective","meaning_category":"Agile development readiness"},{"sentence":"We need to refine the user stories further to make them user-story-ready for the next sprint.","translation":"次のスプリントに向けて、ユーザーストーリーをさらに改善して、開発準備完了状態にする必要があります。","type":"adjective","meaning_category":"Agile development readiness"},{"sentence":"The team decided to add a checklist to their process to ensure all user stories are user-story-ready.","translation":"チームは、すべてのユーザーストーリーが開発準備完了状態であることを確認するために、プロセスにチェックリストを追加することを決定しました。","type":"adjective","meaning_category":"Agile development readiness"}]}