{"word":"typhomalaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チフス性マラリア：チフスとマラリアの症状が重なって現れる病状。","english_definition":"A condition in which the symptoms of typhoid fever and malaria are combined.","examples":[{"sentence":"The patient presented with symptoms suggestive of typhomalaria, requiring careful differential diagnosis.","translation":"患者はチフス性マラリアを示唆する症状を呈し、慎重な鑑別診断が必要であった。"}],"collocations":["diagnose typhomalaria","treat typhomalaria","symptoms of typhomalaria"],"synonyms":["malarial fever with typhoid symptoms"],"antonyms":[]}],"etymology":{"value":"'typho-' (チフスに関連する) + 'malaria' (マラリア) の合成語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌtaɪfoʊməˈlɛəriə/","syllables":"ty-pho-ma-la-ri-a"},"inflection":{"noun_plural":"typhomalarias"},"usage_notes":{"explanation":"Typhomalaria is a rarely used term to describe the co-occurrence or symptomatic overlap of typhoid fever and malaria. Modern diagnostics allow for more precise identification of each disease, making the term less common in medical practice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected typhomalaria, but it was just a severe case of the flu.","correct":"✓ The doctor suspected typhomalaria, but it was determined to be typhoid fever.","note":"Typhomalaria refers to the combined symptoms of typhoid and malaria, not the flu."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学文献でのみ見られる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Typhomalaria' is a highly specialized medical term referring to the combined presentation of symptoms from both typhoid fever and malaria. Due to advancements in diagnostic medicine, this term is rarely used today as clinicians can usually differentiate and diagnose each illness separately. Understanding the term requires knowledge of both typhoid and malaria. It is primarily encountered in older medical literature or discussions of historical diagnostic challenges.","priority":"★☆☆"},"example_sentences":[{"sentence":"Historically, cases of fever were sometimes diagnosed as typhomalaria before accurate diagnostic tests were available.","translation":"歴史的には、正確な診断検査が利用可能になる前は、発熱の症例はチフス性マラリアと診断されることがあった。","type":"noun","meaning_category":"病状"}]}