{"word":"Investitures","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)叙任権闘争; 叙任式","english_definition":"(historical) The action or process of formally investing a person with honors or rank; specifically referring to the Investiture Controversy, a conflict in medieval Europe between church and state over the ability to appoint local church officials through investiture. Also refers to ceremonies where honors are formally conferred.","examples":[{"sentence":"The Investiture Controversy was a significant event in medieval European history.","translation":"叙任権闘争は中世ヨーロッパ史における重要な出来事でした。"},{"sentence":"The investitures were grand ceremonies, full of pomp and tradition.","translation":"叙任式は盛大で、華やかさと伝統に満ちた儀式でした。"}],"collocations":["Investiture Controversy","royal investiture","formal investiture"],"synonyms":["installation","induction","ordination","appointment","ceremony","bestowal"],"antonyms":["removal","dismissal","deposition"]}],"etymology":{"value":"From the word 'investiture,' derived from the medieval Latin 'investitura,' meaning 'the act of investing,' from 'investire,' meaning 'to clothe, invest,' from Latin 'in-' (in) + 'vestire' (to clothe), from 'vestis' (garment).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈvɛstɪtʃərz/","syllables":"in-ves-ti-tures"},"inflection":{"noun_plural":"Investitures"},"usage_notes":{"explanation":"'Investitures' most commonly refers to the Investiture Controversy, a major conflict in medieval Europe concerning the appointment of church officials. It can also refer to the formal ceremonies where honors or ranks are conferred upon individuals. The term is typically used in historical or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The investitures was a simple affair.","correct":"✓ The investitures were grand ceremonies.","note":"Since 'investitures' is plural, it requires a plural verb form ('were' instead of 'was')."},{"incorrect":"✗ He received investiture into the club.","correct":"✓ He received investiture in the club.","note":"The correct preposition is 'in' when referring to being formally invested in a group or organization."}],"priority":"★★☆"},"related_words":{"derivatives":["investiture (noun: the act of formally investing a person with honors or rank)","invest (verb: to endow, provide, or furnish someone or something with a particular quality or attribute)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Investitures\" is a formal and historical term. It refers to the act of formally conferring honors or rank, particularly in the context of the Investiture Controversy, a significant medieval European conflict. Understanding this term requires familiarity with historical and political contexts. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The historical significance of the Investitures cannot be overstated.","translation":"叙任権闘争の歴史的意義は過小評価できません。","type":"noun","meaning_category":"Historical Event"},{"sentence":"The royal investitures are steeped in tradition and ceremony.","translation":"王室の叙任式は伝統と儀式に彩られています。","type":"noun","meaning_category":"Ceremony"}]}