{"word":"Lanolated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ラノリンを添加された、ラノリン処理された","english_definition":"Treated or containing lanolin.","examples":[{"sentence":"Lanolated wool is soft and gentle on the skin.","translation":"ラノリン処理されたウールは柔らかく、肌に優しい。"},{"sentence":"She uses a lanolated cream to moisturize her dry hands.","translation":"彼女は乾燥した手を保湿するために、ラノリン添加のクリームを使っている。"}],"collocations":["lanolated wool","lanolated cream","lanolated soap"],"synonyms":["lanolin-enriched","lanolin-containing"],"antonyms":[]}],"etymology":{"value":"The word 'lanolated' is derived from 'lanolin' (a wax obtained from sheep's wool) and the suffix '-ated' (meaning 'having' or 'containing').","priority":"★★★"},"pronunciation":{"ipa":"ˈlænəˌleɪtɪd","syllables":"lan-o-lat-ed"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Lanolated' is used to describe products that have had lanolin added to them. Lanolin is a natural wax derived from sheep's wool, known for its moisturizing and emollient properties. Therefore, 'lanolated' products are often used to soothe and protect the skin.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I lanolated my skin.","correct":"✓ I used a lanolated cream on my skin.","note":"'Lanolated' is an adjective, not a verb. You can't 'lanolate' something. Instead, you use a 'lanolated' product."}],"priority":"★★☆"},"related_words":{"derivatives":["lanolin (noun: ウールから得られるワックス)","lanolinize (verb: ラノリン処理をする)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lanolated' is a specialized term primarily used in the context of skincare, textiles, and related industries. It indicates that a product has been treated with or contains lanolin, a natural wax derived from sheep's wool, known for its moisturizing and emollient properties. The word is not commonly used in everyday conversation but is more likely to appear in product descriptions, ingredient lists, or articles discussing skincare or textile manufacturing. Understanding the term requires some familiarity with the properties and uses of lanolin."},"example_sentences":[{"sentence":"The baby's skin is soothed by the lanolated diaper rash cream.","translation":"赤ちゃんの肌は、ラノリン添加のおむつかぶれクリームで癒やされる。","type":"adjective","meaning_category":"ラノリン添加された"},{"sentence":"This lanolated soap is excellent for people with sensitive skin.","translation":"このラノリン処理された石鹸は、敏感肌の人に最適だ。","type":"adjective","meaning_category":"ラノリン処理された"}]}