{"word":"unruliness","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"手に負えないこと、無法、統制のきかなさ、わがまま","english_definition":"the state or quality of being difficult to control, manage, or discipline; disorderliness; insubordination.","examples":[{"sentence":"The teacher struggled to manage the unruliness of the students.","translation":"先生は生徒たちの手に負えない状態をどうにかしようと苦労した。"},{"sentence":"The unruliness of the crowd led to several arrests.","translation":"群衆の無法状態がいくつかの逮捕につながった。"},{"sentence":"Her unruliness at the dinner table was embarrassing.","translation":"夕食の席での彼女のわがままな態度は恥ずかしかった。"}],"collocations":["student unruliness (生徒の手に負えなさ)","crowd unruliness (群衆の無法)","general unruliness (全体的な統制のきかなさ)"],"synonyms":["disobedience","insubordination","disorderliness","rebelliousness","intractability","waywardness","noncompliance"],"antonyms":["obedience","discipline","orderliness","compliance","submissiveness"]}],"etymology":{"value":"The word \"unruliness\" is derived from the adjective \"unruly,\" which is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"ruly.\" \"Ruly\" comes from \"rule,\" indicating something that follows or is subject to rules. Therefore, \"unruliness\" signifies the state of not being subject to rules or control.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈruːlinəs/","syllables":"un-ru-li-ness"},"inflection":{"noun_form":"unruliness"},"usage_notes":{"explanation":"\"Unruliness\" refers to a state or condition where there is a lack of control, discipline, or order. It often describes behavior that is defiant, disobedient, or difficult to manage. The term can be applied to individuals, groups, or even situations. It implies a resistance to authority or established norms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unruliness behavior of the children was exhausting.","correct":"✓ The unruly behavior of the children was exhausting.","note":"\"Unruliness\" is a noun describing a state or quality. \"Unruly\" is the adjective to describe the behavior itself. "},{"incorrect":"✗ He showed unruliness to his parents.","correct":"✓ He showed unruliness towards his parents.","note":"When indicating who or what the unruliness is directed towards, use \"towards\"."}],"priority":"★★☆"},"related_words":{"derivatives":["unruly (adjective: difficult to control or discipline)","rule (noun: a principle or instruction)"],"phrases":["a display of unruliness (手に負えない様子を見せる)","a history of unruliness (手に負えない過去)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unruliness\" is a more advanced term describing the state of being difficult to control or manage. It is often used in formal contexts to describe a lack of discipline or order, especially in groups or situations. Understanding this word requires a good grasp of abstract nouns and the ability to recognize formal language. It is not commonly used in everyday conversation. "},"example_sentences":[{"sentence":"The principal addressed the issue of unruliness in the school assembly.","translation":"校長は学校集会で校内の手に負えない問題について話した。","type":"noun","meaning_category":"手に負えないこと"},{"sentence":"The unruliness of the protesters made it difficult for the police to maintain order.","translation":"抗議者たちの無法状態は警察が秩序を維持することを困難にした。","type":"noun","meaning_category":"無法"},{"sentence":"His unruliness as a child often got him into trouble.","translation":"子供の頃の彼のわがままは、彼をしばしばトラブルに巻き込んだ。","type":"noun","meaning_category":"わがまま"}]}