{"word":"harlequinism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"道化師病、魚鱗癬様紅皮症","english_definition":"A severe congenital skin disease characterized by thick, plate-like scales that cover the entire body.","examples":[{"sentence":"Harlequinism is a rare and often fatal genetic disorder.","translation":"道化師病はまれで、しばしば致命的な遺伝性疾患です。"}],"collocations":["genetic disorder","skin disease"],"synonyms":["harlequin ichthyosis"],"antonyms":[]}],"etymology":{"value":"The term 'harlequinism' comes from the harlequin character in commedia dell'arte, known for their colorful, patterned costumes, which somewhat resemble the appearance of the skin in this condition.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɑːrlɪkwɪnɪzəm/","syllables":"har-le-quin-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Harlequinism, more accurately known as harlequin ichthyosis, is a very rare and severe genetic skin disorder. It is usually apparent at birth. The skin develops thick, plate-like scales separated by deep cracks. Due to the severity of the condition, it often leads to significant complications and a high mortality rate.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["harlequin (noun, adjective)","ichthyosis (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Harlequinism, or harlequin ichthyosis, is an extremely rare and severe genetic skin disorder that is usually apparent at birth. The condition is characterized by thick, plate-like scales covering the entire body, separated by deep fissures. Due to the rarity and severity of the condition, it is primarily discussed within medical contexts and is not commonly encountered in general conversation. The term derives from the harlequin character, due to the patterned appearance of the skin.","priority":"★★★"},"example_sentences":[{"sentence":"The infant was diagnosed with harlequinism shortly after birth.","translation":"その乳児は出生直後に道化師病と診断された。","type":"noun","meaning_category":"medical condition"}]}