{"word":"Delanos","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"(複数形) デラノ家の人々 (アメリカ合衆国の著名な一族)","english_definition":"(plural) Members of the Delano family (a prominent family in the United States).","examples":[{"sentence":"The Delanos were involved in shipping and trade.","translation":"デラノ家は海運と貿易に関わっていた。"},{"sentence":"Several Delanos have held prominent positions in American society.","translation":"数人のデラノ家の人々がアメリカ社会で重要な地位を占めてきた。"}],"collocations":["Delano family history","descendants of the Delanos"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Delano' is of French origin. The Delano family in America traces its roots back to Philippe de la Noye, a French Huguenot who arrived in Plymouth in the 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛlənoʊz/","syllables":"De-la-nos"},"inflection":{"notes":"Plural form of the family name 'Delano'"},"usage_notes":{"explanation":"'Delanos' refers specifically to multiple individuals who are members of the Delano family. The family is notable in American history, with connections to prominent figures such as President Franklin Delano Roosevelt. When referring to the family as a whole, it's more common to use 'the Delano family'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Delano.","correct":"✓ He is a member of the Delano family. / ✓ He is a Delano.","note":"While 'He is a Delano' is grammatically correct, it's more common to specify 'member of the Delano family' for clarity, especially if the context doesn't already establish that you're talking about the family."}],"priority":"★★☆"},"related_words":{"derivatives":["Delano (singular form of the family name)"],"related_families":["Roosevelt family (Franklin Delano Roosevelt was a prominent member, connecting the two families)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily in historical contexts related to the Delano family.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Delanos' is a proper noun referring to multiple members of the Delano family, a historically significant American family. Understanding its usage requires knowledge of American history and genealogy. It is typically encountered in historical texts or discussions about prominent American families. The singular form, 'Delano,' is the family name itself.","note":"This entry focuses on the plural form, assuming the user is looking for information about multiple members of the family, rather than a single individual or the family name in general."},"example_sentences":[{"sentence":"The **Delanos** made their fortune in the opium trade.","translation":"デラノ家はアヘン貿易で財を成した。","type":"proper noun","meaning_category":"family members"},{"sentence":"Several **Delanos** were involved in politics and public service.","translation":"数人のデラノ家の人々が政治や公共事業に関わっていた。","type":"proper noun","meaning_category":"family members"},{"sentence":"The history of the **Delanos** is intertwined with the history of the United States.","translation":"デラノ家の歴史はアメリカ合衆国の歴史と深く関わっている。","type":"proper noun","meaning_category":"family members"}]}