{"word":"night-riding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"夜間の乗馬、夜間走行","english_definition":"The act of riding or traveling at night.","examples":[{"sentence":"Night-riding can be dangerous due to poor visibility.","translation":"夜間走行は視界が悪いため危険なことがある。"},{"sentence":"The bandits were known for their night-riding activities.","translation":"その盗賊たちは夜間の襲撃行為で知られていた。"}],"collocations":["dangerous night-riding","moonlit night-riding"],"synonyms":["nocturnal riding","night travel"],"antonyms":["daytime riding","day travel"]},{"part_of_speech":"noun","definition":"(歴史的) 夜間の襲撃 (特にKKKなどの秘密結社による)","english_definition":"(Historical) A nocturnal raid, especially one carried out by a secret society such as the Ku Klux Klan.","examples":[{"sentence":"Night-riding was a common tactic used to intimidate African Americans.","translation":"夜間の襲撃は、アフリカ系アメリカ人を脅迫するために用いられた一般的な戦術だった。"},{"sentence":"The history of night-riding is a dark chapter in American history.","translation":"夜間の襲撃の歴史は、アメリカの歴史における暗い一章である。"}],"collocations":["KKK night-riding","violent night-riding"],"synonyms":["nocturnal raid","night raid"],"antonyms":[]}],"etymology":{"value":"'Night' + 'riding'. The term combines the element of darkness with the action of riding, often implying secrecy or danger.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnaɪtˌraɪdɪŋ/","syllables":"night-rid-ing"},"inflection":{"noun_plural":"night-ridings"},"usage_notes":{"explanation":"The term 'night-riding' can refer to the simple act of riding at night, but it often carries a historical connotation related to violent or intimidating activities carried out under the cover of darkness, particularly in the context of groups like the Ku Klux Klan.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He enjoyed night-riding at the beach.","correct":"✓ He enjoyed riding at night on the beach.","note":"While 'night-riding' is technically correct, it's less common in modern usage for casual riding. 'Riding at night' is more natural. To use 'night-riding' effectively, the context should imply a specific purpose or historical reference."}],"priority":"★★☆"},"related_words":{"derivatives":["nightrider"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'night-riding' is relatively uncommon in modern English, and when used, it often evokes a specific historical context related to acts of violence or intimidation carried out under the cover of darkness. Therefore, it is more likely to be encountered in advanced texts dealing with history, sociology, or related topics. In more general contexts, phrases like 'riding at night' or 'traveling at night' are more common.","priority":"★★☆"},"example_sentences":[{"sentence":"The old stories told of hooded figures engaged in night-riding.","translation":"古い物語は、フードを被った人物たちが夜間の襲撃を行っていたことを語っていた。","type":"noun","meaning_category":"(Historical) 夜間の襲撃"},{"sentence":"He preferred night-riding because the trails were less crowded.","translation":"彼は道が空いているので夜間の乗馬を好んだ。","type":"noun","meaning_category":"夜間の乗馬"}]}