{"word":"surrealists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シュルレアリスムの芸術家、作家、思想家","english_definition":"Artists, writers, and thinkers who adhere to the principles of Surrealism.","examples":[{"sentence":"The surrealists sought to liberate thought, language, and human experience from the oppressive boundaries of rationalism.","translation":"シュルレアリストたちは、思考、言語、そして人間の経験を合理主義の抑圧的な境界から解放しようと試みた。"},{"sentence":"Key surrealists include Salvador Dalí, René Magritte, and André Breton.","translation":"主要なシュルレアリストには、サルバドール・ダリ、ルネ・マグリット、アンドレ・ブルトンなどがいる。"}],"collocations":["famous surrealists","leading surrealists","influential surrealists","group of surrealists"],"synonyms":["dreamers","visionaries","avant-garde artists"],"antonyms":["realists","naturalists"]},{"part_of_speech":"adjective","definition":"シュルレアリスムの、シュルレアリストの","english_definition":"Relating to or characteristic of Surrealism or surrealists.","examples":[{"sentence":"The exhibition showcased surrealists paintings and sculptures.","translation":"その展覧会では、シュルレアリスムの絵画や彫刻が展示された。"},{"sentence":"The film had a surrealists quality, blending reality and fantasy.","translation":"その映画はシュルレアリスム的な質を持ち、現実とファンタジーを融合させていた。"}],"collocations":["surrealists art","surrealists film","surrealists literature","surrealists movement"],"synonyms":["dreamlike","bizarre","fantastic","unreal"],"antonyms":["realistic","naturalistic"]}],"etymology":{"value":"The term 'surrealist' is derived from 'Surrealism,' a cultural movement that began in the early 1920s, and is a combination of the French words 'sur' (meaning 'above' or 'beyond') and 'realism.' The movement aimed to resolve the previously contradictory conditions of dream and reality.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈriːəlɪsts/","syllables":"sur-re-al-ists"},"inflection":{"noun_plural":"surrealists"},"usage_notes":{"explanation":"'Surrealists' can refer to a group of people associated with the Surrealism movement or can be used adjectivally to describe something related to the movement. The term often implies a departure from conventional reality and an exploration of the subconscious mind.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a surealist.","correct":"✓ He is a surrealist.","note":"The correct spelling is 'surrealist,' not 'surealist.'"},{"incorrect":"✗ Surrealists are very realistic.","correct":"✓ Surrealists are not realistic.","note":"Surrealists are known for their departure from realism, so describing them as 'realistic' is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["Surrealism (noun: シュルレアリスム)","surreal (adjective: シュールな、非現実的な)","surreally (adverb: シュールに、非現実的に)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in art and literature contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'surrealists' refers to artists, writers, and thinkers associated with the Surrealism movement, which explores the realm of dreams and the subconscious. It is often used in discussions of art, literature, and philosophy. Understanding the term requires familiarity with the core concepts of Surrealism, such as automatism and the juxtaposition of unexpected elements. The word is more commonly encountered in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The gallery featured works by prominent surrealists such as Joan Miró.","translation":"そのギャラリーでは、ジョアン・ミロのような著名なシュルレアリストの作品が展示されていた。","type":"noun","meaning_category":"芸術家"},{"sentence":"Surrealists techniques often involve automatism and dream imagery.","translation":"シュルレアリストの技法には、しばしばオートマティスムや夢のイメージが含まれる。","type":"adjective","meaning_category":"シュルレアリスムの"}]}