{"word":"sokemanry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A form of land tenure in England, characterized by free socage and certain customary services owed to the lord of the manor.","english_definition":"A type of landholding in medieval England where tenants held land by socage tenure and owed customary services to the lord.","examples":[{"sentence":"The land was held in sokemanry, with the tenant owing rent and occasional labor to the manor.","translation":"その土地は自由保有農地として保有され、小作人は地代と時折の労働を荘園領主に提供していた。"},{"sentence":"Sokemanry was a common form of tenure in the Danelaw region of England.","translation":"自由保有農地は、イングランドのデーンロウ地域で一般的な保有形態であった。"}],"collocations":["hold land in sokemanry","socage tenure","customary services","manorial system"],"synonyms":["socage","free socage"],"antonyms":["villeinage","serfdom"]}],"etymology":{"value":"From Middle English *sokemanrie*, equivalent to *sokeman* + *-ry*. *Sokeman* is derived from Old English *sōcman*, from *sōc* (“jurisdiction, privilege, sake”) + *man* (“man”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsoʊkmənri/","syllables":"so-ke-man-ry"},"inflection":{"noun_plural":"sokemanries"},"usage_notes":{"explanation":"Sokemanry refers to a specific type of land tenure in medieval England, distinct from other forms such as villeinage (serfdom). Sokemen were free tenants who owed services to the lord but were not tied to the land in the same way as serfs. This form of tenure was particularly common in areas influenced by Danish law (the Danelaw).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a serf in sokemanry.","correct":"✓ He was a sokeman.","note":"Sokemen were free tenants, not serfs."}],"priority":"★☆☆"},"related_words":{"derivatives":["sokeman","socage"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'sokemanry' is highly specialized and primarily encountered in historical or legal texts concerning medieval English land tenure. Understanding this term requires familiarity with the manorial system and the various forms of landholding that existed during that period. It is not part of common modern English vocabulary."},"example_sentences":[{"sentence":"The Domesday Book recorded many instances of land held by sokemanry in Lincolnshire.","translation":"ドゥームズデイ・ブックには、リンカンシャーで自由保有農地として保有されている土地の多くの事例が記録されていた。","type":"noun","meaning_category":"land tenure"},{"sentence":"Unlike villeins, sokemen had greater freedom and could often sell or lease their land.","translation":"農奴とは異なり、自由保有農民はより大きな自由を持ち、しばしば土地を売却または賃貸することができた。","type":"noun","meaning_category":"land tenure"}]}