{"word":"ramparted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(城壁・防塁などで)防備された、囲まれた","english_definition":"Surrounded or fortified with a rampart or defensive barrier.","examples":[{"sentence":"The ramparted city stood as a testament to centuries of conflict.","translation":"城壁で防備された都市は、何世紀にもわたる紛争の証として立っていた。"},{"sentence":"The castle was ramparted against invaders.","translation":"その城は侵略者に対して城壁で防備されていた。"}],"collocations":["ramparted city","ramparted castle","heavily ramparted"],"synonyms":["fortified","walled","defended","barricaded"],"antonyms":["undefended","unprotected","exposed"]}],"etymology":{"value":"The word 'ramparted' comes from the noun 'rampart,' which refers to a defensive wall or embankment. 'Rampart' itself comes from the Old French 'remparer,' meaning 'to fortify,' which in turn comes from 're-' (again) and 'emparer' (to seize, take possession of). The suffix '-ed' is added to form the adjective, indicating the state of being equipped with a rampart.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræmpɑːrtɪd/","syllables":"ram-part-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as a verb. However, it can be used in comparative and superlative constructions with 'more' and 'most' (e.g., 'more ramparted')."},"usage_notes":{"explanation":"'Ramparted' is a relatively uncommon word, primarily used in historical or descriptive contexts to convey the idea of a place being strongly defended by walls or embankments. It often evokes a sense of history, siege, or protection. It is more formal than simply saying 'walled' or 'fortified.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ramparted building was easily accessible.","correct":"✓ The ramparted building was difficult to access.","note":"Ramparts are defensive structures, so a ramparted building would typically be difficult to access, not easily accessible."},{"incorrect":"✗ The ramparted forest provided shelter from the rain.","correct":"✓ The dense forest provided shelter from the rain.","note":"'Ramparted' refers to structures with ramparts, not natural features like forests. A dense forest might provide shelter, but it wouldn't be described as ramparted."}],"priority":"★★☆"},"related_words":{"derivatives":["rampart (noun: a defensive wall or embankment)","ramparting (noun: the act of fortifying with a rampart)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ramparted' is a relatively advanced term used to describe something that is fortified with a rampart, which is a defensive wall or embankment. This word is more likely to be encountered in historical texts, descriptions of castles or fortifications, or in literature with a strong sense of place and history. Due to its specific meaning and relatively low frequency, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The **ramparted** fortress had withstood many sieges over the centuries.","translation":"その城壁で防備された要塞は、何世紀にもわたって多くの包囲に耐えてきた。","type":"adjective","meaning_category":"防備された"},{"sentence":"From the **ramparted** heights, the soldiers could survey the surrounding landscape.","translation":"城壁で防備された高台から、兵士たちは周囲の景色を見渡すことができた。","type":"adjective","meaning_category":"防備された"}]}