{"word":"Crimper","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に美容) ウェーブを作る道具、クリンパー","english_definition":"A tool used to create crimped or wavy hair.","examples":[{"sentence":"She used a crimper to add texture to her hair.","translation":"彼女はクリンパーを使って髪にウェーブをつけた。"},{"sentence":"Crimpers were a popular hair styling tool in the 1980s.","translation":"クリンパーは1980年代に人気のヘアスタイリングツールだった。"}],"collocations":["hair crimper","ceramic crimper","crimper iron"],"synonyms":["waver","curling iron","styling tool"],"antonyms":[]},{"part_of_speech":"noun","definition":"(電気工事) 圧着工具、クリンパー","english_definition":"A tool used to crimp or compress a connector onto a wire or cable.","examples":[{"sentence":"He needed a crimper to attach the connector to the cable.","translation":"彼はケーブルにコネクタを取り付けるために圧着工具が必要だった。"},{"sentence":"Use the correct crimper for the type of connector you are using.","translation":"使用するコネクタの種類に合った圧着工具を使用してください。"}],"collocations":["wire crimper","cable crimper","RJ45 crimper"],"synonyms":["crimping tool","compression tool"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史) 水夫誘拐犯、船乗り誘拐犯","english_definition":"(historical) A person who entraps men into naval or military service, especially by trickery or coercion.","examples":[{"sentence":"Crimpers would often drug or kidnap unsuspecting men and sell them to ship captains.","translation":"水夫誘拐犯は、しばしば警戒心の薄い男性に薬を盛ったり誘拐したりして、船長に売り渡した。"},{"sentence":"The crimper operated near the docks, preying on sailors.","translation":"その水夫誘拐犯は、船乗りを狙って港の近くで活動していた。"}],"collocations":["sailor crimper","press gang"],"synonyms":["kidnapper","recruiter (deceptive)"],"antonyms":[]}],"etymology":{"value":"'Crimp' (to press into small folds or ridges) + '-er' (agent noun suffix). The historical sense relating to sailor kidnapping likely arose from the practice of 'crimping' or distorting the truth to lure men into service.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪmpər/","syllables":"crim-per"},"inflection":{"noun_plural":"crimpers"},"usage_notes":{"explanation":"The word \"crimper\" has multiple meanings depending on the context. In the beauty context, it refers to a hair styling tool. In electrical work, it refers to a tool used to attach connectors to wires. Historically, it referred to someone who kidnapped or coerced men into naval service.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a curler to crimp my hair.","correct":"✓ I used a crimper to crimp my hair.","note":"While both curlers and crimpers style hair, a crimper specifically creates a crimped or wavy texture, not curls."}],"priority":"★★☆"},"related_words":{"derivatives":["crimp (verb, noun)","crimped (adjective)","crimping (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"crimper\" has different meanings depending on the context. It can refer to a hair styling tool that creates waves, an electrical tool for connecting wires, or historically, someone who forced people into naval service. Understanding the context is crucial to interpreting the intended meaning. The electrical and historical meanings are less common in everyday conversation."},"example_sentences":[{"sentence":"She used a hair **crimper** to create a retro look.","translation":"彼女はヘアクリンパーを使ってレトロなルックを作った。","type":"noun","meaning_category":"hair styling tool"},{"sentence":"The electrician used a **crimper** to secure the wire to the terminal.","translation":"電気技師は圧着工具を使ってワイヤーを端子に固定した。","type":"noun","meaning_category":"electrical tool"},{"sentence":"The **crimper** lured unsuspecting sailors into a life at sea against their will.","translation":"水夫誘拐犯は警戒心の薄い船員を騙して、本意に反して船乗り生活に引き込んだ。","type":"noun","meaning_category":"historical"}]}