{"word":"unhurtfully","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"傷つけないように、痛みを伴わないように、無害に","english_definition":"in a way that does not cause harm or pain; without causing hurt feelings.","examples":[{"sentence":"She tried to phrase her criticism unhurtfully.","translation":"彼女は批判を傷つけないように表現しようとした。"},{"sentence":"He unhurtfully corrected her mistake.","translation":"彼は彼女の誤りを痛みを伴わないように訂正した。"},{"sentence":"The doctor explained the procedure unhurtfully to the child.","translation":"医者は子供に処置を傷つけないように説明した。"}],"collocations":["speak unhurtfully","correct unhurtfully","explain unhurtfully","act unhurtfully"],"synonyms":["gently","kindly","tactfully","sensitively","considerately","compassionately","charitably"],"antonyms":["hurtfully","cruelly","unkindly","insensitively","callously"]}],"etymology":{"value":"The word 'unhurtfully' is formed by adding the prefix 'un-' (meaning 'not'), the word 'hurtful' (meaning 'causing pain or harm'), and the suffix '-ly' (which turns an adjective into an adverb). So, it literally means 'not in a hurtful manner'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhɜːrtfəli/","syllables":"un-hurt-ful-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word has no comparative or superlative forms."},"usage_notes":{"explanation":"'Unhurtfully' is used to describe actions or manners that are intended to avoid causing emotional or physical pain. It emphasizes the intention and effort to be gentle, considerate, and kind in one's interactions. It is often used when delivering criticism or correcting mistakes, aiming to minimize any negative impact on the recipient.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He unhurtfully the situation.","correct":"✓ He handled the situation unhurtfully.","note":"'Unhurtfully' is an adverb and modifies verbs, adjectives, or other adverbs. It cannot be used as a verb itself. You need a verb like 'handle', 'speak', 'act', etc., for it to modify."},{"incorrect":"✗ She gave unhurtful advice.","correct":"✓ She gave advice unhurtfully. / ✓ She gave unhurtful advice.","note":"'Unhurtful' is the adjective form, meaning 'not causing harm'. If you want to describe the manner in which the advice was given, use the adverb 'unhurtfully'. If you want to describe the nature of the advice itself, use the adjective 'unhurtful'."}],"priority":"★★☆"},"related_words":{"derivatives":["unhurtful (adjective: not causing harm or pain)","hurtful (adjective: causing harm or pain)","hurt (verb: to cause pain or harm; noun: pain or harm)","hurtfully (adverb: in a way that causes harm or pain)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unhurtfully' is an adverb that describes doing something in a way that avoids causing pain or harm. It's used when you want to emphasize that someone is being careful and considerate in their actions, especially when dealing with sensitive situations or delivering criticism. It implies a conscious effort to be gentle and avoid hurting someone's feelings. It is not a common word, so it is most likely to be encountered in formal writing or speech."},"example_sentences":[{"sentence":"The teacher unhurtfully pointed out the student's errors on the essay.","translation":"先生は生徒のエッセイの誤りを傷つけないように指摘した。","type":"adverb","meaning_category":"without causing hurt feelings"},{"sentence":"She tried to explain her decision unhurtfully, hoping to avoid upsetting her friend.","translation":"彼女は友人を動揺させないように、傷つけないように自分の決断を説明しようとした。","type":"adverb","meaning_category":"in a way that does not cause harm"},{"sentence":"He unhurtfully declined the invitation, citing a prior engagement.","translation":"彼は先約があることを理由に、招待を傷つけないように断った。","type":"adverb","meaning_category":"without causing hurt feelings"}]}