{"word":"heteronormativity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"異性愛規範性：異性愛が社会における唯一の、または最も自然で正常な性的指向および関係性であるという信念体系。","english_definition":"The belief that heterosexuality is the only or most natural and normal sexual orientation and relationship.","examples":[{"sentence":"Heteronormativity is often reinforced through societal institutions and cultural norms.","translation":"異性愛規範性は、しばしば社会制度や文化的規範を通じて強化される。"},{"sentence":"Challenging heteronormativity is essential for creating a more inclusive society.","translation":"異性愛規範性に異議を唱えることは、より包括的な社会を創造するために不可欠である。"},{"sentence":"The film explores the impact of heteronormativity on LGBTQ+ individuals.","translation":"その映画は、異性愛規範性がLGBTQ+の人々に与える影響を探求している。"}],"collocations":["challenge heteronormativity (異性愛規範性に異議を唱える)","reinforce heteronormativity (異性愛規範性を強化する)","impact of heteronormativity (異性愛規範性の影響)","heteronormative assumptions (異性愛規範的な前提)","heteronormative society (異性愛規範的な社会)"],"synonyms":["compulsory heterosexuality"],"antonyms":["LGBTQ+ inclusivity","queer theory"],"related_terms":["cisnormativity","homophobia","transphobia","sexism","gender roles","sexual orientation","gender identity"]},{"part_of_speech":"noun","definition":"（より広義には）異性愛がデフォルトまたは優先されるという前提に基づく、社会構造、態度、および実践。","english_definition":"More broadly, the social structures, attitudes, and practices that assume heterosexuality as the default or preferred sexual orientation.","examples":[{"sentence":"Heteronormativity is evident in many aspects of everyday life, from advertising to legal frameworks.","translation":"異性愛規範性は、広告から法的枠組みまで、日常生活の多くの側面で明らかである。"},{"sentence":"The curriculum needs to be revised to address heteronormativity and promote diversity.","translation":"カリキュラムは、異性愛規範性に対処し、多様性を促進するために改訂する必要がある。"},{"sentence":"Many LGBTQ+ individuals face discrimination due to heteronormativity.","translation":"多くのLGBTQ+の人々は、異性愛規範性による差別に直面している。"}],"collocations":["address heteronormativity (異性愛規範性に対処する)","challenge heteronormativity (異性愛規範性に異議を唱える)","perpetuate heteronormativity (異性愛規範性を永続させる)","heteronormative culture (異性愛規範的な文化)","heteronormative bias (異性愛規範的な偏見)"],"synonyms":["heterosexism","heterocentricity"],"antonyms":["queer liberation","sexual diversity","gender equality"],"related_terms":["intersectionality","social justice","equality","inclusion"]}],"etymology":{"value":"\"Heteronormativity\" is derived from \"heterosexual\" (attraction to the opposite sex) and \"normativity\" (the state of being normal or conforming to norms). The term emerged in the late 20th century, particularly within queer theory and LGBTQ+ studies, to critique the assumption that heterosexuality is the default or superior sexual orientation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtərəˌnɔːrˈmætɪvɪti/","syllables":"het-er-o-nor-ma-tiv-i-ty"},"inflection":{"notes":"It is a noun and does not have plural forms in the traditional sense. It is generally used as a singular, abstract concept."},"usage_notes":{"explanation":"'Heteronormativity' is a critical term used in sociology, gender studies, and LGBTQ+ activism to describe the systemic privileging of heterosexuality. It encompasses not only the belief that heterosexuality is normal but also the ways in which social institutions, laws, and cultural representations reinforce this idea, often marginalizing or excluding non-heterosexual identities and relationships. It is important to understand that heteronormativity is not simply about individual prejudice but about the broader structures that perpetuate inequality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Heteronormativity is just about people being straight.","correct":"✓ Heteronormativity is a system of beliefs and practices that privileges heterosexuality and marginalizes other sexual orientations.","note":"Heteronormativity is not simply about being heterosexual; it's about the assumption that heterosexuality is the norm and the ways this assumption shapes society."},{"incorrect":"✗ Heteronormativity doesn't affect anyone.","correct":"✓ Heteronormativity can lead to discrimination, exclusion, and marginalization of LGBTQ+ individuals.","note":"Heteronormativity has significant impacts on LGBTQ+ individuals and their experiences."}],"priority":"★★☆"},"related_words":{"derivatives":["heteronormative (adjective)"],"related_terms":["cisgender","gender binary","homophobia","transphobia","queer theory","sexual orientation","gender identity","LGBTQ+","intersectionality"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and activist contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heteronormativity' is a complex term used to describe the assumption that heterosexuality is the normal or preferred sexual orientation. It's not just about individual beliefs but also about how society is structured to favor heterosexual relationships and identities. This can affect laws, social norms, and cultural representations. Understanding this term is important for discussing issues of LGBTQ+ rights and social justice.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel explores how heteronormativity shapes the protagonist's understanding of love and relationships.","translation":"その小説は、異性愛規範性が主人公の愛と人間関係の理解をどのように形作るかを探求している。","type":"noun","meaning_category":"belief system"},{"sentence":"Many LGBTQ+ activists work to dismantle heteronormativity in schools and workplaces.","translation":"多くのLGBTQ+活動家は、学校や職場における異性愛規範性を解体するために活動している。","type":"noun","meaning_category":"social structure"},{"sentence":"The study examines the ways in which heteronormativity is perpetuated in media representations of families.","translation":"その研究は、異性愛規範性が家族のメディア表現においてどのように永続化されているかを検証している。","type":"noun","meaning_category":"social structure"}]}