{"word":"waspishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"気難しさ、辛辣さ、短気さ、そっけなさ","english_definition":"The quality of being easily annoyed and quick to express irritation or anger; irritability; petulance; acrimony.","examples":[{"sentence":"Her waspishness made it difficult to work with her.","translation":"彼女の気難しさのせいで、彼女と働くのは難しかった。"},{"sentence":"He responded with a touch of waspishness.","translation":"彼は少し辛辣な口調で答えた。"},{"sentence":"The critic's waspishness was legendary.","translation":"その評論家の辛辣さは伝説的だった。"}],"collocations":["a tone of waspishness","a hint of waspishness","show waspishness","display waspishness"],"synonyms":["irascibility","petulance","acrimony","irritability","testiness","cantankerousness","choleric nature","bile","asperity","acerbity"],"antonyms":["amiability","affability","geniality","good humor","pleasantness","agreeableness","sweetness","kindness","friendliness"]}],"etymology":{"value":"\"Waspishness\" derives from \"waspish,\" which originated in the late 16th century. \"Waspish\" comes from \"wasp,\" referring to the stinging insect known for its irritable and aggressive behavior. The suffix \"-ish\" indicates a characteristic or resemblance. Thus, \"waspish\" describes someone resembling a wasp in temperament—easily provoked and quick to sting with words or actions. The addition of the suffix \"-ness\" transforms the adjective \"waspish\" into the noun \"waspishness,\" denoting the quality or state of being waspish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒspɪʃnəs/","syllables":"wos-pish-ness"},"inflection":{"noun_plural":"waspishnesses (rarely used)"},"usage_notes":{"explanation":"\"Waspishness\" describes a disposition characterized by sharp, often sarcastic or irritable remarks. It suggests a tendency to be easily provoked and to respond with stinging words. The term often implies a somewhat petty or mean-spirited form of irritability, rather than a deep-seated anger. It is generally used to describe a person's behavior or temperament, rather than a specific action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed waspishness at the party.","correct":"✓ He showed waspish behavior at the party. / ✓ He was waspish at the party.","note":"\"Waspishness\" is a quality or state of being, not an action in itself. It's more accurate to say someone *displays* or *shows* waspish *behavior*, or that they *are* waspish."},{"incorrect":"✗ The waspishness of the weather surprised us.","correct":"✓ The severity of the weather surprised us.","note":"\"Waspishness\" is generally reserved for describing human behavior or temperament, not inanimate objects or natural phenomena. Use other words like \"severity,\" \"harshness,\" or \"unpleasantness\" to describe weather."}],"priority":"★★★"},"related_words":{"derivatives":["waspish (adjective: easily annoyed; irritable)","waspishly (adverb: in an irritable manner)"],"phrases":["a touch of waspishness","a hint of waspishness"],"synonyms":["acrimony","asperity","bile","choler","crabbedness","crossness","exacerbation","gall","ill-humor","irascibility","irritability","peevishness","petulance","testiness","vituperation"],"antonyms":["affability","amiability","benevolence","composure","contentedness","equanimity","forbearance","gentleness","good humor","kindness","mildness","patience","placidity","sweetness","tenderness"]},"level_frequency":{"CEFR":"C2 (rarely used in general conversation)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Waspishness\" is a more advanced word that describes someone's tendency to be easily annoyed and express their irritation in a sharp or sarcastic way. It's not a common word, so you'll mostly find it in more formal writing or when people are trying to describe someone's personality in a very specific way. It's related to the word \"wasp,\" which is a stinging insect, so think of \"waspishness\" as a way of describing someone who has a stinging personality.","priority":"★★☆"},"example_sentences":[{"sentence":"The manager's waspishness created a tense atmosphere in the office.","translation":"マネージャーの気難しさがオフィスに緊張感を生み出した。","type":"noun","meaning_category":"気難しさ"},{"sentence":"Despite her waspishness, she was a brilliant scientist.","translation":"彼女の気難しさにもかかわらず、彼女は素晴らしい科学者だった。","type":"noun","meaning_category":"辛辣さ"},{"sentence":"His waspishness often drove away potential clients.","translation":"彼の短気さがしばしば潜在的な顧客を遠ざけた。","type":"noun","meaning_category":"短気さ"}]}