{"word":"dropline","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(釣り) 釣り糸の垂らし糸、胴付き仕掛け","english_definition":"A short line attached to a main fishing line, to which a hook or lure is attached.","examples":[{"sentence":"He used a dropline with several hooks to catch multiple fish at once.","translation":"彼は一度に複数の魚を釣るために、いくつかの針が付いた垂らし糸を使った。"},{"sentence":"The dropline allows the bait to be presented at a specific depth.","translation":"垂らし糸によって、餌を特定の深さに提示することができる。"}],"collocations":["fishing dropline","attach a dropline","adjust the dropline"],"synonyms":["leader","branch line","snood"],"antonyms":[]},{"part_of_speech":"noun","definition":"(航空) 空中投下索、物資投下索","english_definition":"A line used to drop supplies or equipment from an aircraft.","examples":[{"sentence":"The rescue team used a dropline to deliver food and water to the stranded hikers.","translation":"救助隊は立ち往生したハイカーに食料と水を届けるために、空中投下索を使用した。"},{"sentence":"The dropline ensured the supplies landed safely in the designated area.","translation":"投下索は物資が指定された場所に安全に着地することを保証した。"}],"collocations":["aerial dropline","supply dropline","emergency dropline"],"synonyms":["drop cable","release line"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'drop' and 'line', indicating a line used for dropping something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɒpˌlaɪn/","syllables":"drop-line"},"inflection":{"noun_plural":"droplines"},"usage_notes":{"explanation":"The term 'dropline' has two main uses: in fishing, it refers to a short line attached to the main fishing line, used to present bait or a lure. In aviation, it refers to a line used to drop supplies or equipment from an aircraft. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a mainline instead of a dropline.","correct":"✓ He used a mainline without a dropline.","note":"'Mainline' is the main fishing line, while a 'dropline' is attached to it. The mistake is using one instead of the other, rather than using the wrong word itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'dropline' is a technical term used in specific contexts such as fishing and aviation. It refers to a line used for dropping something, either bait in fishing or supplies from an aircraft. Understanding the specific context is important to correctly interpret the meaning. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The fisherman adjusted the **dropline** to ensure the bait was at the correct depth.","translation":"漁師は餌が適切な深さになるように、垂らし糸を調整した。","type":"noun","meaning_category":"Fishing"},{"sentence":"The pilot released the **dropline**, and the supplies floated down to the ground.","translation":"パイロットは投下索を放し、物資は地上に浮かび降りた。","type":"noun","meaning_category":"Aviation"}]}