{"word":"Graecophile","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ギリシャ文化愛好家、親ギリシャ主義者","english_definition":"A person who loves or admires Greece, the Greek people, or Greek culture.","examples":[{"sentence":"He was a true Graecophile, having studied ancient Greek literature for many years.","translation":"彼は真のギリシャ文化愛好家で、長年古代ギリシャ文学を研究していました。"},{"sentence":"The museum curator was known to be a Graecophile, evident in the extensive collection of Greek artifacts.","translation":"その博物館の学芸員はギリシャ文化愛好家として知られており、ギリシャの工芸品の広範なコレクションにそれが表れていました。"}],"collocations":["ardent Graecophile","dedicated Graecophile","lifelong Graecophile"],"synonyms":["Hellenophile","Greek enthusiast","admirer of Greek culture"],"antonyms":["Graecophobe","Hellenophobe","anti-Greek"],"notes":"Often used to describe someone with a deep appreciation for ancient Greek history, philosophy, art, and literature."},{"part_of_speech":"adjective","definition":"ギリシャ文化を愛好する、親ギリシャ的な","english_definition":"Characterized by love or admiration for Greece, the Greek people, or Greek culture.","examples":[{"sentence":"The architect's Graecophile designs were inspired by classical Greek temples.","translation":"その建築家の親ギリシャ的なデザインは、古典的なギリシャの神殿からインスピレーションを受けていました。"},{"sentence":"The Graecophile movement in the 19th century led to increased interest in Greek independence.","translation":"19世紀の親ギリシャ主義運動は、ギリシャの独立への関心を高めました。"}],"collocations":["Graecophile tendencies","Graecophile sentiments","Graecophile architecture"],"synonyms":["Hellenophilic","Greek-loving","pro-Greek"],"antonyms":["Graecophobic","Hellenophobic","anti-Greek"]}],"etymology":{"value":"From 'Graeco-' (combining form of 'Greek') + '-phile' (lover of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːkəˌfaɪl/","syllables":"Gree-co-phile"},"inflection":{"noun_plural":"Graecophiles"},"usage_notes":{"explanation":"'Graecophile' is used to describe someone with a strong affinity for Greek culture, often ancient Greek culture. It can refer to someone who studies Greek history, language, or philosophy, or simply someone who admires Greek art and architecture. The term can also be used to describe things that are inspired by or reminiscent of Greek culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Greekophile person.","correct":"✓ He is a Graecophile.","note":"'Graecophile' is already a noun referring to a person, so adding 'person' is redundant."},{"incorrect":"✗ She has Graecophile for Greek art.","correct":"✓ She is a Graecophile when it comes to Greek art. / ✓ She has a Graecophile appreciation for Greek art.","note":"'Graecophile' needs to be used as a noun or adjective, not a verb. Use appropriate prepositions and sentence structures."}],"priority":"★☆☆"},"related_words":{"derivatives":["Graecophilism (noun: love of Greek culture)"],"related_terms":["Hellenic (adjective: relating to Greece or Greek culture)","Hellenism (noun: the characteristics of Greek culture, especially classical Greek culture)","Hellenist (noun: a scholar of Greek language and culture)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Graecophile' is a relatively uncommon word used to describe someone who is fond of Greek culture, especially ancient Greek culture. It is more likely to be encountered in academic or literary contexts. Understanding the etymology ('Graeco-' + '-phile') helps to understand the meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"As a dedicated **Graecophile**, she visited Greece every year to study its ancient ruins.","translation":"熱心なギリシャ文化愛好家として、彼女は古代遺跡を研究するために毎年ギリシャを訪れました。","type":"noun","meaning_category":"ギリシャ文化愛好家"},{"sentence":"The university's classical studies department is filled with **Graecophiles**.","translation":"その大学の古典研究学科はギリシャ文化愛好家でいっぱいです。","type":"noun","meaning_category":"ギリシャ文化愛好家"},{"sentence":"The museum featured a collection of **Graecophile** art, inspired by ancient Greek sculptures.","translation":"その美術館は、古代ギリシャの彫刻に触発された親ギリシャ的な芸術作品のコレクションを展示していました。","type":"adjective","meaning_category":"ギリシャ文化を愛好する"}]}