{"word":"zebra-plant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(植物)アポロゴン（Aphelandra squarrosa）","english_definition":"A plant of the genus Aphelandra, especially Aphelandra squarrosa, having boldly patterned leaves with white or yellow veins.","examples":[{"sentence":"The zebra-plant is a popular houseplant because of its striking foliage.","translation":"アポロゴンはその印象的な葉のため、人気の観葉植物です。"},{"sentence":"She added a zebra-plant to her collection of tropical plants.","translation":"彼女は熱帯植物のコレクションにアポロゴンを加えました。"}],"collocations":["grow a zebra-plant","care for a zebra-plant","propagate a zebra-plant"],"synonyms":["Aphelandra squarrosa"],"antonyms":[]},{"part_of_speech":"noun","definition":"(植物)ハオルチア・トルンカータ (Haworthia truncata)","english_definition":"A succulent plant, Haworthia truncata, with distinctive, truncated leaves that resemble the stripes of a zebra.","examples":[{"sentence":"The collector prized the zebra-plant for its unique leaf structure.","translation":"収集家はその独特な葉の構造から、ハオルチア・トルンカータを珍重しました。"},{"sentence":"The zebra-plant is easy to care for and makes a great addition to any succulent collection.","translation":"ハオルチア・トルンカータは手入れが簡単で、多肉植物コレクションに最適です。"}],"collocations":["grow a zebra-plant","care for a zebra-plant","propagate a zebra-plant"],"synonyms":["Haworthia truncata"],"antonyms":[]}],"etymology":{"value":"The name \"zebra-plant\" comes from the distinctive striped patterns on the leaves of these plants, which resemble the stripes of a zebra.","priority":"★★★"},"pronunciation":{"ipa":"/ˈziːbrəˌplænt/","syllables":"ze-bra-plant"},"inflection":{"noun_plural":"zebra-plants"},"usage_notes":{"explanation":"The term \"zebra-plant\" can refer to two different plants: Aphelandra squarrosa and Haworthia truncata. Aphelandra squarrosa is more commonly known as the zebra-plant due to its prominent white or yellow veins on dark green leaves. Haworthia truncata is a succulent that is also sometimes called zebra-plant because of its striped appearance. When using the term, it's helpful to provide additional context to clarify which plant you are referring to.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I watered my zebra-plant every day and it died.","correct":"✓ I watered my zebra-plant every day and it died because it needs less water.","note":"Zebra-plants, especially Haworthia truncata, are succulents and do not need daily watering. Overwatering can lead to root rot and death."},{"incorrect":"✗ Zebra-plant is a type of animal.","correct":"✓ Zebra-plant is a type of plant.","note":"The zebra-plant is a plant, not an animal. Its name comes from the zebra-like stripes on its leaves."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_plants":["Aphelandra","Haworthia","succulent","houseplant"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"zebra-plant\" refers to plants with striped patterns reminiscent of a zebra. It commonly denotes Aphelandra squarrosa, a houseplant known for its striking white or yellow veins on dark green leaves. It can also refer to Haworthia truncata, a succulent with similar striped markings. When using the term, providing context is useful to clarify which plant is being discussed.","priority":"★★★"},"example_sentences":[{"sentence":"The **zebra-plant** added a touch of the exotic to the living room.","translation":"アポロゴンはリビングルームにエキゾチックな雰囲気を添えました。","type":"noun","meaning_category":"Aphelandra squarrosa"},{"sentence":"The **zebra-plant** is a low-maintenance succulent perfect for beginners.","translation":"ハオルチア・トルンカータは手入れが簡単な多肉植物で、初心者にも最適です。","type":"noun","meaning_category":"Haworthia truncata"},{"sentence":"She carefully repotted the **zebra-plant** into a larger container.","translation":"彼女はアポロゴンをより大きな鉢に丁寧に植え替えました。","type":"noun","meaning_category":"Aphelandra squarrosa"},{"sentence":"The **zebra-plant** thrives in bright, indirect sunlight.","translation":"アポロゴンは明るい間接光でよく育ちます。","type":"noun","meaning_category":"Aphelandra squarrosa"}]}