{"word":"Polynesians","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポリネシア人","english_definition":"A member of the indigenous people of Polynesia.","examples":[{"sentence":"The Polynesians are known for their seafaring skills.","translation":"ポリネシア人は航海術に長けていることで知られています。"},{"sentence":"Many Polynesians live on islands scattered across the Pacific Ocean.","translation":"多くのポリネシア人が太平洋に散らばる島々に住んでいます。"}],"collocations":["Polynesian culture","Polynesian language","Polynesian islands","indigenous Polynesians"],"synonyms":["Pacific Islanders"],"antonyms":[]}],"etymology":{"value":"From Polynesia + -an.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈniːʒənz/","syllables":"Pol-y-ne-sians"},"inflection":{"noun_plural":"Polynesians"},"usage_notes":{"explanation":"'Polynesians' refers to the people indigenous to Polynesia, a subregion of Oceania, comprising a large grouping of over 1,000 islands scattered over the central and southern Pacific Ocean. These include Samoa, Tonga, the Cook Islands, French Polynesia (Tahiti), Niue, Tokelau, Tuvalu, Wallis and Futuna, and Māori in New Zealand. The term can refer to the people collectively or to individual members of these groups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Polynesian are skilled navigators.","correct":"✓ Polynesians are skilled navigators.","note":"'Polynesian' (singular) needs an article or a plural form to refer to the people in general. 'Polynesians' (plural) is the correct form here."},{"incorrect":"✗ She is a Polynesian, she come from Hawaii.","correct":"✓ She is Polynesian; she comes from Hawaii.","note":"Hawaii is geographically and culturally part of Polynesia, but it is more accurate to say 'She is Polynesian' or 'She is Hawaiian' if specifying origin."}],"priority":"★★☆"},"related_words":{"derivatives":["Polynesia (noun)","Polynesian (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in texts about history, geography, and culture.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'Polynesians' refers to the people who originally come from Polynesia, a large group of islands in the Pacific Ocean. It's often used in discussions about history, culture, and geography. You might encounter this word when learning about the traditions, languages, and navigation skills of these island peoples. It's important to understand that 'Polynesians' is a general term, and there are many distinct cultures and languages within Polynesia."},"example_sentences":[{"sentence":"The **Polynesians** were skilled navigators who explored vast stretches of the Pacific Ocean.","translation":"ポリネシア人は、太平洋の広大な海域を探検した熟練した航海士でした。","type":"noun","meaning_category":"People"},{"sentence":"**Polynesians** have rich cultural traditions, including unique forms of dance and music.","translation":"ポリネシア人は、独特のダンスや音楽など、豊かな文化的な伝統を持っています。","type":"noun","meaning_category":"Culture"},{"sentence":"Many **Polynesians** maintain strong connections to their ancestral lands and customs.","translation":"多くのポリネシア人は、祖先の土地や習慣との強い繋がりを維持しています。","type":"noun","meaning_category":"People"}]}