{"word":"subcommanders","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 副司令官、下位の指揮官","english_definition":"(plural) officers who are subordinate to a commander; officers in a lower rank who command a smaller unit within a larger military organization.","examples":[{"sentence":"The general consulted with his subcommanders before making the final decision.","translation":"将軍は最終決定を下す前に、副司令官たちと協議した。"},{"sentence":"The subcommanders were responsible for executing the plan in their respective sectors.","translation":"副司令官たちはそれぞれの担当区域で計画を実行する責任を負っていた。"}],"collocations":["military subcommanders","naval subcommanders","army subcommanders"],"synonyms":["deputy commanders","junior commanders","second-in-commands"],"antonyms":["commanders","chiefs","leaders"]}],"etymology":{"value":"'sub-' (下位の) + 'commander' (指揮官)","priority":"★★★"},"pronunciation":{"ipa":"/sʌb.kəˈmæn.dərz/","syllables":"sub-co-man-ders"},"inflection":{"noun_plural":"subcommanders"},"usage_notes":{"explanation":"'Subcommanders' refers to multiple individuals who hold a command position but are subordinate to a higher-ranking commander. They typically lead smaller units or sections within a larger organization. The term is most commonly used in military contexts but can also be applied to other hierarchical organizations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subcommander was responsible for all the troops.","correct":"✓ The subcommander was responsible for the troops in his sector.","note":"A subcommander is responsible for a portion of the troops, not all of them. The commander is responsible for all the troops."}],"priority":"★★☆"},"related_words":{"derivatives":["subcommander (singular form)","command (verb/noun)","commander (noun)","subordinate (adjective/noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in military or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subcommanders' is a relatively uncommon term, mainly used in military or historical contexts. It refers to officers who are under the command of a higher-ranking officer. Understanding the prefix 'sub-' (meaning 'under' or 'below') helps in grasping the meaning of the word. It's essential to know that subcommanders have authority over a specific unit or area but are ultimately responsible to the main commander."},"example_sentences":[{"sentence":"The subcommanders received their orders directly from the general.","translation":"副司令官たちは将軍から直接命令を受けた。","type":"general"},{"sentence":"During the battle, the subcommanders coordinated their efforts to achieve a strategic advantage.","translation":"戦闘中、副司令官たちは戦略的優位性を得るために協力して行動した。","type":"military"}]}