{"word":"skulkingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"こそこそと、隠れるように、人目を避けて","english_definition":"In a skulking manner; moving stealthily or furtively, often with the intention of avoiding notice or detection.","examples":[{"sentence":"The cat skulkingly approached the bird feeder.","translation":"猫はこそこそと鳥の餌台に近づいた。"},{"sentence":"He skulkingly made his way through the crowd, hoping no one would recognize him.","translation":"彼は誰にも気づかれないようにと願いながら、人混みをこそこそと進んだ。"},{"sentence":"The thief skulkingly entered the building under the cover of darkness.","translation":"泥棒は暗闇に紛れてこそこそと建物に侵入した。"}],"collocations":["move skulkingly","approach skulkingly","enter skulkingly","leave skulkingly","behave skulkingly"],"synonyms":["stealthily","furtively","secretly","sneakily","covertly","surreptitiously","slyly","cautiously","evasively","gingerly"],"antonyms":["openly","boldly","bravely","courageously","honestly","directly","forthrightly","candidly","bluntly","unreservedly"]}],"etymology":{"value":"Derived from the verb 'skulk' (to move stealthily or furtively) and the suffix '-ingly' (indicating a manner or way of doing something). The verb 'skulk' likely comes from Old Norse 'skulkva' (to lurk).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskʌlkɪŋli/","syllables":"skulk-ing-ly"},"inflection":{"notes":"Adverb, so it does not inflect for number, gender, or case."},"usage_notes":{"explanation":"'Skulkingly' describes the manner in which an action is performed, specifically indicating that it is done in a secretive, furtive, or stealthy way, often to avoid detection or attention. It implies a sense of guilt, shame, or a desire to remain unnoticed. It's often used to describe movements or behaviors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He skulkingly behavior was suspicious.","correct":"✓ His skulking behavior was suspicious.","note":"'Skulkingly' is an adverb and modifies a verb. To describe the behavior itself, use 'skulking' as an adjective."},{"incorrect":"✗ The shadow moved skulkingly across the wall.","correct":"✓ The shadow moved stealthily across the wall.","note":"'Skulkingly' usually implies intent or agency. Shadows don't 'skulk' because they don't have intent. 'Stealthily' is a better fit here."}],"priority":"★☆☆"},"related_words":{"derivatives":["skulk (verb, noun)","skulker (noun)","skulking (adjective)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Skulkingly' is an advanced adverb that describes moving in a sneaky or secretive way, often to avoid being seen. It suggests a sense of shame, guilt, or a desire to remain unnoticed. It's not a common word, so you'll likely encounter it more in literature or detailed descriptions than in everyday conversation. Understanding 'skulk' as the base verb is helpful for grasping the meaning of 'skulkingly.'"},"example_sentences":[{"sentence":"The stray dog skulkingly searched for food scraps behind the restaurant.","translation":"野良犬はレストランの裏で、食べ残しをこそこそと探していた。","type":"adverb","meaning_category":"こそこそと"},{"sentence":"She skulkingly glanced over her shoulder, worried someone was following her.","translation":"彼女は誰かが自分をつけているのではないかと心配して、こそこそと肩越しに振り返った。","type":"adverb","meaning_category":"人目を避けて"},{"sentence":"The spy skulkingly slipped the message under the door.","translation":"スパイはこそこそとメッセージをドアの下に滑り込ませた。","type":"adverb","meaning_category":"隠れるように"}]}