{"word":"sex-integrated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"性別統合された、男女共同参画の","english_definition":"Designed or organized to include both sexes equally; promoting gender equality.","examples":[{"sentence":"The school adopted a sex-integrated curriculum to promote gender equality.","translation":"その学校は男女共同参画を推進するために、性別統合されたカリキュラムを採用した。"},{"sentence":"The organization aims to create a sex-integrated workplace where everyone has equal opportunities.","translation":"その組織は、誰もが平等な機会を持つ男女共同参画の職場を作ることを目指している。"}],"collocations":["sex-integrated curriculum (男女共同参画カリキュラム)","sex-integrated education (男女共同参画教育)","sex-integrated workplace (男女共同参画職場)","sex-integrated approach (男女共同参画アプローチ)"],"synonyms":["gender-integrated","gender-inclusive","coeducational"],"antonyms":["sex-segregated","gender-segregated"],"notes":"This term is often used in the context of education, workplaces, and social policies to describe systems or environments that are designed to include and treat both sexes equally."}],"etymology":{"value":"Combination of 'sex' (referring to biological sex) and 'integrated' (meaning combined or incorporating different elements).","priority":"N/A"},"pronunciation":{"ipa":"/ˈseksˌɪntɪˌɡreɪtɪd/","syllables":"sex-in-te-grat-ed"},"inflection":{},"usage_notes":{"explanation":"The term 'sex-integrated' emphasizes the inclusion and equal treatment of both sexes within a particular system or environment. It is often used to contrast with 'sex-segregated' systems, where males and females are separated. The term is closely related to 'gender-integrated,' which focuses more on social roles and identities.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["integration","sex","gender","gender equality","sex equality"],"related_terms":["coeducation","gender mainstreaming"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Sex-integrated' is a term used to describe systems or environments designed to include both sexes equally, promoting gender equality. It's often used in discussions about education, workplaces, and social policies. Understanding this term requires familiarity with concepts of gender equality and integration."},"example_sentences":[{"sentence":"The company implemented a sex-integrated training program to address gender bias.","translation":"その会社は、ジェンダーバイアスに対処するために、男女共同参画の研修プログラムを実施した。","type":"adjective","meaning_category":"男女共同参画の"},{"sentence":"A sex-integrated approach to healthcare considers the different needs of men and women.","translation":"医療における男女共同参画のアプローチは、男性と女性の異なるニーズを考慮する。","type":"adjective","meaning_category":"男女共同参画の"}]}