{"word":"diphtherotoxin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ジフテリア毒素","english_definition":"A toxic substance produced by Corynebacterium diphtheriae, the bacterium that causes diphtheria.","examples":[{"sentence":"Diphtherotoxin inhibits protein synthesis in eukaryotic cells.","translation":"ジフテリア毒素は真核細胞におけるタンパク質合成を阻害する。"},{"sentence":"The mechanism of action of diphtherotoxin involves ADP-ribosylation of elongation factor 2.","translation":"ジフテリア毒素の作用機序は、伸長因子2のADPリボシル化を伴う。"}],"collocations":["diphtherotoxin production","diphtherotoxin gene","diphtherotoxin fragment","diphtherotoxin-related"],"synonyms":["diphtheria toxin"],"antonyms":[]},{"part_of_speech":"noun","definition":"ジフテリア毒素（ワクチン製造用）","english_definition":"Diphtherotoxin used in the preparation of diphtheria toxoid for vaccination.","examples":[{"sentence":"The diphtherotoxin is treated with formaldehyde to produce diphtheria toxoid.","translation":"ジフテリア毒素は、ホルムアルデヒドで処理され、ジフテリアトキソイドを生成する。"},{"sentence":"Diphtheria toxoid, derived from diphtherotoxin, is a key component of the DTaP vaccine.","translation":"ジフテリア毒素由来のジフテリアトキソイドは、DTaPワクチンの重要な構成要素である。"}],"collocations":["diphtheria toxoid","DTaP vaccine","vaccine production","formaldehyde treatment"],"synonyms":["diphtheria toxoid precursor"],"antonyms":[]}],"etymology":{"value":"From 'diphtheria' (from Greek 'diphthera' meaning 'leather', referring to the membrane formed in the throat) + 'toxin' (from Greek 'toxikon' meaning 'poison').","priority":"★★☆"},"pronunciation":{"ipa":"/dɪfˈθɪə.roʊˌtɒk.sɪn/","syllables":"dif-thee-roh-tok-sin"},"inflection":{"noun_plural":"diphtherotoxins"},"usage_notes":{"explanation":"'Diphtherotoxin' refers specifically to the toxic protein produced by Corynebacterium diphtheriae. It's crucial in understanding the disease mechanism and in the production of the diphtheria vaccine. The term is primarily used in medical and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was injected with diphtherotoxin to prevent diphtheria.","correct":"✓ The patient was injected with diphtheria toxoid to prevent diphtheria.","note":"Diphtherotoxin itself is toxic. Diphtheria toxoid, which is a modified, non-toxic form of the toxin, is used in vaccines."}],"priority":"★★☆"},"related_words":{"derivatives":["diphtheria","toxin","toxoid","Corynebacterium diphtheriae"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diphtherotoxin' is a technical term primarily encountered in medical or scientific texts discussing diphtheria, microbiology, or vaccine development. Understanding its role in the disease process and vaccine production requires a background in biology or medicine. It is not a term commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the effects of diphtherotoxin on cell cultures.","translation":"その研究では、ジフテリア毒素が細胞培養に及ぼす影響を調査した。","type":"scientific research","meaning_category":"toxic substance"},{"sentence":"Diphtherotoxin's mechanism involves inhibiting protein synthesis.","translation":"ジフテリア毒素のメカニズムは、タンパク質合成の阻害を伴う。","type":"biochemistry","meaning_category":"toxic substance"},{"sentence":"Formaldehyde treatment inactivates diphtherotoxin to create diphtheria toxoid.","translation":"ホルムアルデヒド処理はジフテリア毒素を不活化し、ジフテリアトキソイドを生成する。","type":"vaccine production","meaning_category":"vaccine production"}]}