{"word":"Dipnoi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"肺魚類","english_definition":"A subclass or order of fish (Sarcopterygii) that have lungs and fleshy fins; lungfishes.","examples":[{"sentence":"The Dipnoi are a group of freshwater fish that can breathe air.","translation":"肺魚類は、空気呼吸ができる淡水魚のグループです。"},{"sentence":"Some Dipnoi can survive out of water for extended periods.","translation":"一部の肺魚類は、水から出て長期間生存できます。"}],"collocations":["lungfish","African lungfish","South American lungfish","Australian lungfish"],"synonyms":["lungfish"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek δίπνοος (dípnoos, “having two kinds of breath”), from δι- (di-, “twice”) + πνέω (pnéō, “breathe”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪp.nɔɪ/","syllables":"Dip-noi"},"inflection":{"noun_plural":"Dipnois or Dipnoi"},"usage_notes":{"explanation":"'Dipnoi' is a scientific term used to refer to lungfishes. It is not commonly used in everyday conversation. In scientific contexts, it is used to classify and discuss these fish based on their unique characteristics, such as their ability to breathe air and their fleshy fins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Dipnoi in the ocean.","correct":"✓ I saw a Dipnoi in the freshwater swamp.","note":"Dipnoi are freshwater fish, not saltwater fish."},{"incorrect":"✗ Dipnoi is a type of amphibian.","correct":"✓ Dipnoi is a type of fish.","note":"Dipnoi are fish, specifically lungfishes, and not amphibians."}],"priority":"★★☆"},"related_words":{"derivatives":["dipnoan (adjective/noun)"],"phrases":["Sarcopterygii"],"priority":"★★☆"},"level_frequency":{"level":"Scientific","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Dipnoi' is a scientific classification for lungfishes. It's primarily used in biology, zoology, and related fields. Understanding requires familiarity with biological classification systems and evolutionary biology. The word's etymology comes from Greek, reflecting the fish's dual breathing capability (both gills and lungs)."},"example_sentences":[{"sentence":"The evolutionary history of Dipnoi is crucial for understanding the transition of vertebrates from water to land.","translation":"肺魚類の進化の歴史は、脊椎動物が水から陸へ移行する過程を理解する上で重要です。","type":"general","meaning_category":"evolutionary biology"},{"sentence":"Researchers are studying the lung structure of Dipnoi to gain insights into the development of human lungs.","translation":"研究者たちは、ヒトの肺の発達に関する洞察を得るために、肺魚類の肺の構造を研究しています。","type":"scientific","meaning_category":"anatomy"},{"sentence":"The conservation status of several Dipnoi species is threatened due to habitat loss.","translation":"いくつかの肺魚類の種の保全状況は、生息地の喪失により脅かされています。","type":"conservation","meaning_category":"ecology"}]}