{"word":"lithontriptic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(薬などが) 結石を溶解する、砕石性の","english_definition":"Capable of dissolving or destroying calculi (stones) in the body, especially in the urinary tract or gallbladder.","examples":[{"sentence":"The doctor prescribed a lithontriptic medication to help dissolve the kidney stones.","translation":"医師は腎臓結石を溶解するために砕石性の薬を処方した。"},{"sentence":"Some herbal remedies are believed to have lithontriptic properties.","translation":"いくつかのハーブ療法は、砕石性の特性を持つと考えられている。"}],"collocations":["lithontriptic medication","lithontriptic properties","lithontriptic herb","lithontriptic effect"],"synonyms":["calculolytic","stone-dissolving"],"antonyms":["calculogenic (stone-forming)"]},{"part_of_speech":"noun","definition":"結石溶解剤、砕石剤","english_definition":"A medicine or agent that dissolves or destroys calculi in the body.","examples":[{"sentence":"The new lithontriptic proved effective in breaking down the bladder stones.","translation":"その新しい結石溶解剤は、膀胱結石を分解するのに効果的であることが証明された。"},{"sentence":"Lithontriptics are often used as an alternative to surgery for small kidney stones.","translation":"結石溶解剤は、小さな腎臓結石に対する手術の代替としてよく使用される。"}],"collocations":["use of lithontriptics","administer a lithontriptic","powerful lithontriptic"],"synonyms":["calculolytic agent","stone dissolver"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'lithos' (stone) + 'thryptein' (to crush) + '-ic' (pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪθənˈtrɪptɪk/","syllables":"li-thon-trip-tic"},"inflection":{"noun_plural":"lithontriptics"},"usage_notes":{"explanation":"The term 'lithontriptic' is primarily used in medical and pharmaceutical contexts. It refers to substances or treatments specifically designed to dissolve or break down mineral deposits (stones) in the body, particularly those found in the kidneys, bladder, or gallbladder. While the term is technically applicable to any stone-dissolving agent, it is most often associated with medications or herbal remedies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lithontriptic was used to prevent the formation of stones.","correct":"✓ The lithontriptic was used to dissolve existing stones.","note":"Lithontriptics are used to dissolve existing stones, not to prevent their formation. Agents that prevent stone formation are called 'calculopreventive' or similar terms."},{"incorrect":"✗ Lithontriptic is a type of surgery.","correct":"✓ Lithontriptic is a type of medication or treatment.","note":"Lithontriptic refers to a medical treatment or medication, not a surgical procedure."}],"priority":"★★☆"},"related_words":{"derivatives":["lithotripsy (a medical procedure using shock waves to break up stones)","lithotomy (surgical removal of a stone, especially from the bladder)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'lithontriptic' is a highly specialized term primarily encountered in medical contexts. It describes substances or treatments that have the ability to dissolve or break down mineral concretions, known as calculi or stones, within the body. These stones typically form in organs such as the kidneys, bladder, or gallbladder. Due to its technical nature, 'lithontriptic' is not commonly used in everyday language and is more likely to be found in medical journals, textbooks, or discussions among healthcare professionals."},"example_sentences":[{"sentence":"The urologist recommended a course of lithontriptic therapy.","translation":"泌尿器科医は、結石溶解療法を勧めた。","type":"adjective","meaning_category":"結石を溶解する"},{"sentence":"This herbal tea is rumored to be a natural lithontriptic.","translation":"このハーブティーは、天然の結石溶解剤であると噂されている。","type":"noun","meaning_category":"結石溶解剤"}]}