{"word":"context-independence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"文脈独立性：ある表現や情報が、それを取り巻く文脈に依存せずに理解できる性質。","english_definition":"The property of an expression or piece of information being understandable without reference to its surrounding context.","examples":[{"sentence":"The ideal of context-independence in programming allows for modular code that can be reused in different projects.","translation":"プログラミングにおける文脈独立性の理想は、異なるプロジェクトで再利用できるモジュール化されたコードを可能にする。"},{"sentence":"In formal logic, context-independence is crucial for ensuring that the meaning of statements remains consistent regardless of where they are used.","translation":"形式論理では、文脈独立性は、ステートメントの意味がどこで使用されても一貫性を保つために重要である。"},{"sentence":"While some argue for complete context-independence in certain fields, others believe that context always plays a role in interpretation.","translation":"特定の分野では完全な文脈独立性を主張する人もいるが、解釈においては常に文脈が役割を果たすと信じる人もいる。"}],"collocations":["achieve context-independence","ensure context-independence","maintain context-independence","promote context-independence","lack context-independence","rely on context-independence"],"synonyms":["context-free","self-contained","autonomous","independent","self-explanatory"],"antonyms":["context-dependent","context-sensitive","contextual","relative","dependent"]}],"etymology":{"value":"The term is formed by combining 'context' (the circumstances that form the setting for an event, statement, or idea) with 'independence' (the state of not being dependent on another for livelihood or subsistence).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒntekst ɪndɪˈpɛndəns/","syllables":"con-text in-de-pen-dence"},"inflection":{"notes":"This is a noun and does not have plural forms in the typical sense. It refers to a property or characteristic."},"usage_notes":{"explanation":"'Context-independence' refers to the degree to which something can be understood without needing additional information from its surrounding environment or situation. In fields like linguistics, computer science, and logic, it's often a desirable trait as it promotes clarity, reusability, and consistency. However, in other fields like literary analysis or social sciences, context is often considered crucial for a full understanding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The context-independence of the word depends on the sentence.","correct":"✓ The context-dependence of the word depends on the sentence.","note":"The mistake here is confusing context-independence with context-dependence. If the meaning relies on the sentence, it's context-dependent, not independent."},{"incorrect":"✗ Context-independence is always better than context-dependence.","correct":"✓ Whether context-independence or context-dependence is better depends on the specific application.","note":"This is a misconception. Context-independence is not universally superior. Its value depends on the specific field and goals. For example, in programming, it's often desirable, but in understanding human communication, context is essential."}],"priority":"★★☆"},"related_words":{"derivatives":["context-independent (adjective)","context (noun)","independence (noun)","independent (adjective)"],"phrasal_verbs":[],"related_concepts":["context-free grammar","modular programming","abstraction","encapsulation","information hiding","semantic analysis","pragmatics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - more common in academic or technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Context-independence' is a concept primarily used in technical and academic fields. It describes something that can be understood on its own, without needing extra information from its surroundings. Think of a well-designed computer program module that works the same way no matter where it's used. That module has a high degree of context-independence. It's the opposite of something that is 'context-dependent,' which needs surrounding information to be understood. This term is more common in formal writing and discussions about design, logic, or linguistics."},"example_sentences":[{"sentence":"The design of the API aimed for maximum context-independence, allowing developers to use it in a variety of applications without modification.","translation":"APIの設計は、最大限の文脈独立性を目指しており、開発者は修正なしにさまざまなアプリケーションで使用できる。","type":"noun","meaning_category":"general"},{"sentence":"Context-independence in mathematical axioms ensures that the theorems derived from them are universally valid.","translation":"数学の公理における文脈独立性は、それらから導き出される定理が普遍的に有効であることを保証する。","type":"noun","meaning_category":"mathematics"},{"sentence":"The debate over context-independence versus context-dependence is central to many discussions in the field of artificial intelligence.","translation":"文脈独立性と文脈依存性に関する議論は、人工知能の分野における多くの議論の中心である。","type":"noun","meaning_category":"artificial intelligence"}]}