{"word":"hydrochlorothiazide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロクロロチアジド（利尿薬の一種）","english_definition":"A diuretic drug used to treat high blood pressure and fluid retention.","examples":[{"sentence":"My doctor prescribed hydrochlorothiazide for my high blood pressure.","translation":"私の医者は高血圧のためにヒドロクロロチアジドを処方しました。"},{"sentence":"Hydrochlorothiazide helps to reduce swelling by removing excess water from the body.","translation":"ヒドロクロロチアジドは、体から余分な水分を取り除くことで腫れを軽減するのに役立ちます。"}],"collocations":["take hydrochlorothiazide","hydrochlorothiazide tablet","hydrochlorothiazide side effects","hydrochlorothiazide dosage"],"synonyms":["HCTZ","Esidrix","Microzide"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure, combining elements indicating its thiazide diuretic properties and the presence of chlorine.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˌklɔːroʊˈθaɪəzaɪd/","syllables":"hy-dro-chlo-ro-thi-a-zide"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hydrochlorothiazide is a commonly prescribed thiazide diuretic. It works by helping the kidneys eliminate excess salt and water from the body, which helps to lower blood pressure and reduce swelling. It is important to follow the doctor's instructions regarding dosage and potential side effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I stopped taking hydrochlorothiazide suddenly and felt great.","correct":"✓ I stopped taking hydrochlorothiazide suddenly and experienced withdrawal symptoms. / ✓ Always consult your doctor before stopping hydrochlorothiazide.","note":"Suddenly stopping hydrochlorothiazide can lead to rebound hypertension or other withdrawal symptoms. Always consult a healthcare professional before discontinuing the medication."}],"priority":"★☆☆"},"related_words":{"derivatives":["thiazide","diuretic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hydrochlorothiazide is a specific medication name, primarily encountered in medical contexts. Understanding its function as a diuretic and its use in treating hypertension requires a higher level of medical literacy. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pharmacist explained the potential side effects of hydrochlorothiazide.","translation":"薬剤師はヒドロクロロチアジドの潜在的な副作用について説明しました。","type":"noun","meaning_category":"medication"},{"sentence":"Patients taking hydrochlorothiazide should monitor their potassium levels.","translation":"ヒドロクロロチアジドを服用している患者は、カリウム値を監視する必要があります。","type":"noun","meaning_category":"medication"}]}