{"word":"cichlid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カワスズメ科の魚","english_definition":"a fish of the family Cichlidae, many species of which are brightly coloured and popular in aquariums.","examples":[{"sentence":"Cichlids are popular aquarium fish because of their bright colors and interesting behaviors.","translation":"カワスズメ科の魚は、鮮やかな色彩と面白い行動から、人気のある観賞魚です。"},{"sentence":"Lake Malawi is famous for its diverse population of cichlids.","translation":"マラウイ湖は、多様なカワスズメ科の魚が生息することで有名です。"}],"collocations":["African cichlid","dwarf cichlid","cichlid aquarium","cichlid species","cichlid fish"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"From New Latin Cichlidae, from Cichla, a genus name, possibly from Greek kichle, kichla (κιχλη, κιχλα) 'thrush' (perhaps alluding to the bird-like behaviour of some species).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪklɪd/","syllables":"cik-lid"},"inflection":{"noun_plural":"cichlids"},"usage_notes":{"explanation":"Cichlids are a diverse family of fish found mainly in tropical regions of Africa and South America. They are known for their vibrant colors, complex social behaviors, and parental care. Many species are popular in the aquarium trade.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a cichlids in my aquarium.","correct":"✓ I have cichlids in my aquarium.","note":"'Cichlids' is the plural form, so it's already plural. If you have only one, use 'a cichlid'."},{"incorrect":"✗ Cichlid are very aggressive.","correct":"✓ Cichlids are very aggressive.","note":"'Cichlids' is plural, so use the plural form of the verb 'are'."}],"priority":"★★☆"},"related_words":{"derivatives":["Cichlidae (family name)"],"phrases":["mouthbrooder (many cichlids are mouthbrooders)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'cichlid' is a specialized term used to refer to a specific family of fish. Understanding its meaning requires some knowledge of biology or aquarium keeping. While not a common word in everyday conversation, it is frequently used in contexts related to fishkeeping, zoology, and aquatic ecosystems."},"example_sentences":[{"sentence":"The pet store had a wide variety of **cichlids** for sale.","translation":"ペットショップには、様々なカワスズメ科の魚が販売されていました。","type":"noun","meaning_category":"fish"},{"sentence":"Some **cichlids** exhibit complex social hierarchies within their groups.","translation":"一部のカワスズメ科の魚は、群れの中で複雑な社会階層を示します。","type":"noun","meaning_category":"fish"},{"sentence":"Breeding **cichlids** can be challenging due to their specific water parameter requirements.","translation":"カワスズメ科の魚の繁殖は、特定の水質パラメータの要件があるため、難しい場合があります。","type":"noun","meaning_category":"fish"}]}