{"word":"Twice-decreed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having been officially ordered or decided on two separate occasions.","english_definition":"Officially ordered or decided on two separate occasions.","examples":[{"sentence":"The twice-decreed policy was met with resistance both times it was implemented.","translation":"二度決定された政策は、実施されるたびに抵抗に遭った。"},{"sentence":"Despite the twice-decreed law, violations continued to occur.","translation":"二度決定された法律にもかかわらず、違反は続いた。"}],"collocations":["twice-decreed policy","twice-decreed law","twice-decreed measure"],"synonyms":["re-decreed","doubly-decreed"],"antonyms":["un-decreed","never-decreed"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"decreed\" (meaning officially ordered or decided).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtwaɪs dɪˈkriːd/","syllables":"twice-de-creed"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"This word is used to emphasize that something has been officially ordered or decided upon on two separate occasions, often to highlight the persistence or importance of the decision. It can also imply that the decision was controversial or required repeated affirmation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice-decreed.","correct":"✓ The twice-decreed policy.","note":"The word 'twice-decreed' functions as an adjective and needs to be followed by a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["decree","decreed","twice"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Twice-decreed' is a relatively uncommon and formal term. It is used to describe something that has been officially ordered or decided on two separate occasions. Understanding requires knowledge of the root words 'twice' and 'decreed,' and an understanding of how they combine to modify a noun. Due to its formality and specific usage, it is more likely to be encountered in legal, political, or historical contexts."},"example_sentences":[{"sentence":"The twice-decreed regulations aimed to curb pollution from factories.","translation":"二度決定された規制は、工場からの汚染を抑制することを目的としていた。","type":"adjective","meaning_category":"officially ordered"},{"sentence":"The twice-decreed mandate was still ignored by many citizens.","translation":"二度決定された命令は、多くの市民によって依然として無視された。","type":"adjective","meaning_category":"officially decided"}]}