{"word":"indefensibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"擁護できないこと、弁解できないこと、正当化できないこと","english_definition":"The state of being indefensible; the inability to be defended or justified.","examples":[{"sentence":"The indefensibility of his actions became clear during the trial.","translation":"彼の行動の擁護不可能性は裁判中に明らかになった。"},{"sentence":"The government faced criticism over the indefensibility of its economic policies.","translation":"政府は、その経済政策の正当化できないことについて批判に直面した。"},{"sentence":"The indefensibility of the company's practices led to a public outcry.","translation":"その会社の慣行の弁解不可能性は、世論の猛反発につながった。"}],"collocations":["moral indefensibility (道徳的に擁護できないこと)","strategic indefensibility (戦略的に防御できないこと)","logical indefensibility (論理的に擁護できないこと)"],"synonyms":["unjustifiability","untenability","unsustainability","vulnerability","exposure"],"antonyms":["defensibility","justifiability","tenability","sustainability","invulnerability"]}],"etymology":{"value":"\"Indefensibility\" is derived from \"indefensible,\" which comes from the prefix \"in-\" (not) + \"defensible\" (capable of being defended). \"Defensible\" comes from \"defend\" + \"-able\" (capable of). \"Defend\" originates from the Latin \"defendere\" (to ward off, protect).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˌfɛnsɪˈbɪləti/","syllables":"in-di-fen-si-bil-i-ty (7 syllables)"},"inflection":{"noun_plural":"indefensibilities"},"usage_notes":{"explanation":"\"Indefensibility\" refers to the quality or state of something that cannot be defended, justified, or excused. It often implies a moral, ethical, or logical flaw that makes something impossible to support or maintain. It is often used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The indefensibility of the building was a problem.","correct":"✓ The vulnerability of the building was a problem.","note":"\"Indefensibility\" is typically used for abstract concepts, actions, or arguments, not physical structures. Use \"vulnerability\" or \"lack of defenses\" for buildings. "},{"incorrect":"✗ He showed indefensibility for his actions.","correct":"✓ He showed no defensiveness for his actions.","note":"\"Indefensibility\" is the state of being indefensible. If someone isn't trying to defend themselves, use \"non-defensiveness\" or \"lack of defensiveness.\""}],"priority":"★★☆"},"related_words":{"derivatives":["indefensible (adjective)","defend (verb)","defensibility (noun)","defensible (adjective)"],"phrasal_verbs":[],"related_concepts":["ethics","morality","logic","argumentation","justification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"indefensibility\" is a complex noun that describes the state of something being impossible to defend or justify. It is often used in formal or academic writing to discuss moral, ethical, or logical flaws. Because of its complexity and specific usage, it is considered an advanced vocabulary word. Understanding the root words \"defend\" and \"defensible\" can help in comprehending its meaning."},"example_sentences":[{"sentence":"The **indefensibility** of the dictator's regime was clear to the international community.","translation":"独裁者の政権の擁護不可能性は国際社会にとって明らかだった。","type":"noun","meaning_category":"擁護できないこと"},{"sentence":"The lawyer argued against the **indefensibility** of the evidence presented by the prosecution.","translation":"弁護士は、検察側が提出した証拠の弁解不可能性について反論した。","type":"noun","meaning_category":"弁解できないこと"},{"sentence":"The **indefensibility** of the company's environmental record led to significant financial penalties.","translation":"その会社の環境記録の正当化できないことが、多額の経済的制裁につながった。","type":"noun","meaning_category":"正当化できないこと"}]}