{"word":"long-timer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"長年勤めている人、古株、ベテラン","english_definition":"A person who has been in a place, job, or situation for a long time.","examples":[{"sentence":"He's a long-timer at this company; he's been here for over 20 years.","translation":"彼はこの会社の古株で、20年以上ここにいます。"},{"sentence":"She's a long-timer in the neighborhood; everyone knows her.","translation":"彼女はこの近所の古株で、誰もが彼女を知っています。"},{"sentence":"The long-timers at the factory have seen many changes over the years.","translation":"工場のベテランたちは長年にわたって多くの変化を見てきました。"}],"collocations":["company long-timer (会社の古株)","neighborhood long-timer (近所の古株)","prison long-timer (刑務所の長期収容者)"],"synonyms":["veteran","old-timer","senior","established member","lifer (slang, especially in prison context)"],"antonyms":["newcomer","rookie","freshman","short-timer"]},{"part_of_speech":"noun","definition":"(刑務所の)長期収容者","english_definition":"A person serving a long prison sentence.","examples":[{"sentence":"He's a long-timer in this prison, serving a life sentence.","translation":"彼はこの刑務所の長期収容者で、終身刑を受けています。"},{"sentence":"The long-timers have a different perspective on prison life than the new inmates.","translation":"長期収容者は、新入りの囚人とは異なる刑務所生活の視点を持っています。"}],"collocations":["prison long-timer"],"synonyms":["lifer","career criminal (often implies recidivism)"],"antonyms":["short-timer","new inmate"]}],"etymology":{"value":"Combination of \"long\" (referring to a long period of time) and \"timer\" (referring to someone who spends time in a particular place or activity).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɔŋˌtaɪmər/","syllables":"long-ti-mer"},"inflection":{"noun_plural":"long-timers"},"usage_notes":{"explanation":"The term \"long-timer\" generally implies experience and familiarity due to prolonged involvement. It can carry a positive connotation, suggesting expertise and stability, or a neutral connotation, simply indicating duration. In the context of prison, it specifically refers to inmates serving lengthy sentences and often carries a more negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a long time worker here.","correct":"He is a long-timer here. / He has worked here for a long time.","note":"\"Long-timer\" is a noun, not an adjective. Use it as a noun or rephrase the sentence."},{"incorrect":"She's a long timer resident of the city.","correct":"She's a long-timer resident in the city. / She's a long-time resident of the city.","note":"The correct preposition to use with \"resident\" is \"of\" or \"in\". Alternatively, \"long-time resident\" is a valid phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["long-time (adjective): having existed or continued for a long time (e.g., long-time friend)"],"phrasal_verbs":[],"related_terms":["old-timer","lifer","veteran"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Long-timer\" is a compound noun used to describe someone who has been in a particular place or situation for an extended period. It's generally easy to understand in context, but it's not as commonly used as synonyms like \"veteran\" or \"old-timer.\" Be mindful of the context, as it can sometimes refer to someone serving a long prison sentence, which carries a different connotation."},"example_sentences":[{"sentence":"As a long-timer in the company, she knew all the ins and outs of the business.","translation":"会社の古株として、彼女はビジネスのあらゆる内情を知っていました。","type":"noun","meaning_category":"長年勤めている人"},{"sentence":"The long-timers at the club welcomed the new members.","translation":"クラブのベテランたちは新メンバーを歓迎しました。","type":"noun","meaning_category":"長年勤めている人"},{"sentence":"He became a long-timer in the prison system after multiple convictions.","translation":"彼は複数の有罪判決の後、刑務所システムの長期収容者になりました。","type":"noun","meaning_category":"(刑務所の)長期収容者"}]}