{"word":"rattingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"in a ratting manner; resembling or characteristic of ratting.","english_definition":"In a manner resembling or characteristic of ratting; engaging in or suggestive of ratting activities.","examples":[{"sentence":"He spoke rattingly about his colleagues, undermining their efforts at every turn.","translation":"彼は同僚について、彼らの努力をあらゆる面で弱体化させるようなネズミのようなやり方で話した。"},{"sentence":"The politician behaved rattingly, betraying his party's principles for personal gain.","translation":"その政治家はネズミのように振る舞い、個人的な利益のために党の原則を裏切った。"}],"collocations":["behave rattingly","speak rattingly","act rattingly"],"synonyms":["treacherously","deceitfully","betrayingly","sneakily","underhandedly"],"antonyms":["loyally","honestly","openly","forthrightly"]}],"etymology":{"value":"Derived from the verb 'rat' (to betray or inform on someone) with the suffix '-ingly' to denote a manner or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrætɪŋli/","syllables":"rat-ting-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Rattingly' is a relatively uncommon adverb used to describe actions or behaviors that are reminiscent of 'ratting,' which involves betrayal, informing on others, or acting in a sneaky or underhanded manner. It is often used to express disapproval or condemnation of such behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He rattingly the information to the police.","correct":"✓ He ratted the information to the police.","note":"'Rattingly' is an adverb, not a verb. Use the verb 'rat' to describe the act of informing."},{"incorrect":"✗ The cat moved rattingly through the alley.","correct":"✓ The cat moved stealthily through the alley.","note":"While a rat might move stealthily, 'rattingly' implies betrayal or underhandedness, which is not applicable to a cat's movement."}],"priority":"★☆☆"},"related_words":{"derivatives":["rat (noun, verb)","ratty (adjective)","ratting (noun, gerund)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Rattingly' is an uncommon adverb that describes actions or behaviors characterized by betrayal, sneakiness, or informing on others. It is primarily used in formal or literary contexts to express strong disapproval of such behavior. Understanding the root verb 'rat' is essential for comprehending the meaning of 'rattingly.'"},"example_sentences":[{"sentence":"The spy acted rattingly, divulging classified information to the enemy.","translation":"そのスパイはネズミのように行動し、機密情報を敵に漏らした。","type":"adverb","meaning_category":"betrayingly"},{"sentence":"He spoke rattingly about his former allies, seeking to discredit them.","translation":"彼はかつての同盟者について、彼らの信用を失墜させようとネズミのように話した。","type":"adverb","meaning_category":"deceitfully"}]}