{"word":"seismometric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地震計の、地震測定の","english_definition":"Relating to the measurement of earthquakes or seismic activity.","examples":[{"sentence":"The seismometric data indicated a significant increase in activity.","translation":"その地震測定データは、活動の大幅な増加を示していた。"},{"sentence":"Seismometric instruments are essential for monitoring tectonic plate movements.","translation":"地震測定機器は、構造プレートの動きを監視するために不可欠である。"}],"collocations":["seismometric network","seismometric station","seismometric data","seismometric instrument"],"synonyms":["seismic","seismological"],"antonyms":[]}],"etymology":{"value":"Derived from 'seismometry,' which combines 'seismo-' (from Greek 'seismos' meaning earthquake) and '-metry' (measurement).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪzməˈmɛtrɪk/","syllables":"seis-mo-met-ric"},"inflection":{"notes":"Does not have plural forms or comparative/superlative degrees as it is an adjective."},"usage_notes":{"explanation":"'Seismometric' is primarily used in scientific and technical contexts when discussing the measurement and analysis of earthquakes. It is often used to describe instruments, data, or methods related to seismometry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ seismometrical","correct":"✓ seismometric","note":"'Seismometric' is the more commonly used and accepted term in modern scientific literature."}],"priority":"★★☆"},"related_words":{"derivatives":["seismometry (noun: the science or method of measuring earthquakes)","seismometer (noun: an instrument that measures earthquakes)","seismologist (noun: a scientist who studies earthquakes)","seismic (adjective: relating to earthquakes or other vibrations of the earth)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'seismometric' is a technical term used in the field of seismology. It refers to anything related to the measurement of earthquakes. Understanding this word requires familiarity with scientific vocabulary and concepts related to earth sciences."},"example_sentences":[{"sentence":"The seismometric readings were analyzed to determine the earthquake's epicenter.","translation":"地震計の測定値を分析して、地震の震源地を特定した。","type":"general","meaning_category":"measurement of earthquakes"},{"sentence":"The new seismometric array provides more accurate data than previous systems.","translation":"新しい地震計アレイは、以前のシステムよりも正確なデータを提供する。","type":"technical","meaning_category":"seismic activity"}]}