{"word":"techno-pessimist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"技術悲観主義者、技術に対して否定的な見方をする人","english_definition":"someone who believes that technology will have a negative impact on society","examples":[{"sentence":"Some people see him as a techno-pessimist because he often criticizes the overuse of smartphones.","translation":"スマートフォンを使いすぎだとよく批判するので、彼を技術悲観主義者と見る人もいる。"},{"sentence":"Techno-pessimists worry about the potential job losses due to automation.","translation":"技術悲観主義者は、自動化による潜在的な失業を心配している。"}],"collocations":["be a techno-pessimist","techno-pessimistic view","techno-pessimistic outlook"],"synonyms":["Luddite","critic of technology"],"antonyms":["techno-optimist","technophile","technology enthusiast"]},{"part_of_speech":"adjective","definition":"技術悲観的な、技術に対して否定的な見方をする","english_definition":"having a negative view of technology and its impact on society","examples":[{"sentence":"The article presents a techno-pessimistic view of artificial intelligence.","translation":"その記事は、人工知能に対する技術悲観的な見方を示している。"},{"sentence":"His techno-pessimistic outlook is not shared by everyone in the tech industry.","translation":"彼の技術悲観的な見方は、ハイテク業界のすべての人に共有されているわけではない。"}],"collocations":["techno-pessimistic about","techno-pessimistic predictions","techno-pessimistic arguments"],"synonyms":["negative about technology","skeptical of technology"],"antonyms":["techno-optimistic","pro-technology"]}],"etymology":{"value":"\"techno-\" (technology) + \"pessimist\" (someone who expects the worst)","priority":"★★★"},"pronunciation":{"ipa":"/ˌteknoʊˈpesɪmɪst/","syllables":"tech-no-pes-si-mist"},"inflection":{"noun_plural":"techno-pessimists","adjective_forms":{}},"usage_notes":{"explanation":"The term \"techno-pessimist\" is used to describe someone who is skeptical about the benefits of technology and believes it will have a negative impact on society. They often focus on the potential downsides of technological advancements, such as job displacement, privacy concerns, and the erosion of human connection. The opposite of a techno-pessimist is a techno-optimist, who believes that technology will solve many of the world's problems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a technology pessimist.","correct":"✓ He is a techno-pessimist.","note":"While \"technology pessimist\" is understandable, \"techno-pessimist\" is the more common and established term."}],"priority":"★★☆"},"related_words":{"derivatives":["techno-pessimism (noun)"],"related_terms":["technology","pessimism","automation","artificial intelligence","dystopia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions about AI and automation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"techno-pessimist\" is used to describe someone who has a negative view of technology and its impact on society. They are often concerned about the potential downsides of technological advancements, such as job losses, privacy issues, and the erosion of human connection. This term is often used in discussions about the future of technology and its role in shaping society."},"example_sentences":[{"sentence":"Many techno-pessimists believe that social media is contributing to increased social isolation.","translation":"多くの技術悲観主義者は、ソーシャルメディアが社会的孤立の増加に寄与していると考えている。","type":"noun","meaning_category":"技術に対して否定的な見方をする人"},{"sentence":"The author takes a techno-pessimistic approach to the topic of genetic engineering.","translation":"著者は遺伝子工学のテーマに技術悲観的なアプローチをとっている。","type":"adjective","meaning_category":"技術に対して否定的な見方をする"}]}