{"word":"turkeyfish","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fish of the scorpionfish family, Pterois, characterized by venomous spines and elaborate fins.","english_definition":"Any fish of the genus Pterois, characterized by venomous spines and elaborate fins.","examples":[{"sentence":"The turkeyfish is a beautiful but dangerous creature.","translation":"ミノカサゴは美しいけれど危険な生き物です。"},{"sentence":"Divers should be careful to avoid the venomous spines of the turkeyfish.","translation":"ダイバーはミノカサゴの有毒な棘を避けるように注意すべきです。"}],"collocations":["venomous turkeyfish","beautiful turkeyfish","avoid turkeyfish"],"synonyms":["lionfish","zebrafish","firefish"],"antonyms":[]}],"etymology":{"value":"Combination of 'turkey' (referring to the bird's fan-like tail) and 'fish'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrkiˌfɪʃ/","syllables":"tur-key-fish"},"inflection":{"noun_plural":"turkeyfishes"},"usage_notes":{"explanation":"'Turkeyfish' is a less common name for fish more commonly known as lionfish. They are known for their striking appearance and venomous spines.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["lionfish","scorpionfish","Pterois"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Turkeyfish' refers to a type of fish, specifically those in the genus Pterois, also known as lionfish. They are recognized by their distinctive appearance, including venomous spines and ornate fins. The term is not very common. Therefore, familiarity with marine life terminology is helpful for understanding.","note":"This explanation assumes a high level of English proficiency due to the specialized vocabulary."},"example_sentences":[{"sentence":"The vibrant colors of the turkeyfish make it popular in aquariums.","translation":"ミノカサゴの鮮やかな色彩は、水族館で人気があります。","type":"noun","meaning_category":"description"},{"sentence":"A sting from a turkeyfish can be extremely painful.","translation":"ミノカサゴの刺し傷は非常に痛みを伴うことがあります。","type":"noun","meaning_category":"danger"}]}