{"word":"urotoxic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"尿毒性の、尿毒症性の","english_definition":"toxic to the urinary system; relating to or caused by uremia (the presence of excessive amounts of urea and other nitrogenous waste products in the blood).","examples":[{"sentence":"The patient exhibited several urotoxic symptoms due to kidney failure.","translation":"患者は腎不全のため、いくつかの尿毒性症状を示した。"},{"sentence":"Urotoxic compounds can damage the renal tubules.","translation":"尿毒性化合物は腎尿細管を損傷する可能性がある。"}],"collocations":["urotoxic substance","urotoxic effects","urotoxic symptoms","urotoxic metabolites"],"synonyms":["nephrotoxic","uremic"],"antonyms":["non-toxic","non-uremic"]}],"etymology":{"value":"Derived from the combination of 'uro-' (referring to urine) and 'toxic' (poisonous).","priority":"★★★"},"pronunciation":{"ipa":"ˌjʊərəʊˈtɒksɪk","syllables":"u-ro-tox-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Urotoxic' describes substances or conditions that are poisonous or harmful specifically to the urinary system, often as a result of kidney dysfunction and the accumulation of waste products normally excreted in urine. It is often used in medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was urotoxic, so it helped the kidneys.","correct":"✓ The medicine was urotoxic, so it harmed the kidneys.","note":"Urotoxic substances are harmful, not helpful, to the kidneys."}],"priority":"★★☆"},"related_words":{"derivatives":["urotoxicity (noun): The state of being urotoxic.","uremia (noun): A toxic condition resulting from kidney failure in which urea and other waste products are retained in the blood."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Urotoxic' is a specialized term used in medicine and related fields to describe substances or conditions that are toxic to the urinary system. It is not commonly used in everyday language and would primarily be encountered in scientific literature or medical discussions. Understanding this term requires a knowledge of basic medical concepts related to kidney function and waste excretion."},"example_sentences":[{"sentence":"The accumulation of creatinine is one of the urotoxic effects of renal failure.","translation":"クレアチニンの蓄積は、腎不全の尿毒性効果の一つである。","type":"general","meaning_category":"toxicity"},{"sentence":"Certain medications can have urotoxic side effects.","translation":"特定の薬は尿毒性の副作用を引き起こす可能性がある。","type":"medical","meaning_category":"side effects"}]}