{"word":"carrot-heavy","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Containing a large proportion of carrots relative to other ingredients.","english_definition":"Characterized by a high proportion or significant presence of carrots in a dish or recipe.","examples":[{"sentence":"The soup was carrot-heavy, with only a few other vegetables detectable.","translation":"そのスープはニンジンが主体で、他の野菜はほとんど感じられなかった。"},{"sentence":"I found the cake a little carrot-heavy for my taste; I prefer a more balanced flavor.","translation":"そのケーキは私の好みには少しニンジンが多すぎた。もっとバランスの取れた風味が好きだ。"}],"collocations":["carrot-heavy soup","carrot-heavy cake","carrot-heavy stew","carrot-heavy recipe"],"synonyms":["carrot-rich","carrot-dominant"],"antonyms":["carrot-light","carrot-sparse"]}],"etymology":{"value":"A compound word formed by combining \"carrot\" and \"heavy,\" indicating a significant presence or proportion of carrots.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkærətˌhɛvi/","syllables":"car-rot-hea-vy"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term \"carrot-heavy\" is typically used to describe food items where the flavor or texture of carrots is particularly prominent due to their high proportion in the recipe. It can be used both positively and negatively, depending on whether the speaker enjoys a strong carrot flavor.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The dish was carrot heavy.","correct":"✓ The dish was carrot-heavy.","note":"The compound adjective is usually hyphenated."}],"priority":"N/A"},"related_words":{"derivatives":["N/A"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The word \"carrot-heavy\" is a compound adjective that describes something containing a large amount of carrots relative to other ingredients. It is generally understandable to those with a good vocabulary, but not a common word and may not be familiar to all English speakers."},"example_sentences":[{"sentence":"The baby food was carrot-heavy, which my child loved.","translation":"そのベビーフードはニンジンがたっぷり入っていて、うちの子はそれが大好きだった。","type":"adjective","meaning_category":"Proportion of carrots"},{"sentence":"The stew was too carrot-heavy for my liking, I prefer more meat.","translation":"そのシチューは私の好みにはニンジンが多すぎた。もっと肉が好きだ。","type":"adjective","meaning_category":"Proportion of carrots"}]}