{"word":"cantor","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教の)礼拝奏者、カントル","english_definition":"The chief singer of a synagogue, who leads the congregation in prayer.","examples":[{"sentence":"The cantor's voice filled the synagogue with beautiful melodies.","translation":"礼拝奏者の声が、美しい旋律でシナゴーグを満たした。"},{"sentence":"He has been the cantor of this synagogue for over 20 years.","translation":"彼は20年以上、このシナゴーグの礼拝奏者を務めている。"}],"collocations":["lead the service","chant prayers","recite blessings","synagogue cantor"],"synonyms":["hazzan","chazzan"],"antonyms":[]},{"part_of_speech":"noun","definition":"(キリスト教の)聖歌隊指揮者、カントル","english_definition":"The leader of a choir or a section of a choir, especially in a cathedral or large church.","examples":[{"sentence":"The cantor directed the choir with precision and passion.","translation":"聖歌隊指揮者は、正確さと情熱をもって聖歌隊を指揮した。"},{"sentence":"He was appointed as the cantor of the cathedral.","translation":"彼は大聖堂の聖歌隊指揮者に任命された。"}],"collocations":["direct the choir","lead the singing","church cantor","cathedral cantor"],"synonyms":["choirmaster","music director"],"antonyms":[]}],"etymology":{"value":"From Latin 'cantor' meaning 'singer,' from 'canere' meaning 'to sing.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæntər/","syllables":"can-tor"},"inflection":{"noun_plural":"cantors"},"usage_notes":{"explanation":"The term 'cantor' refers to a person who leads singing, typically in a religious context. In Judaism, the cantor (also known as a hazzan or chazzan) leads the congregation in prayer and chants liturgical music. In Christianity, especially in larger churches or cathedrals, the cantor leads the choir or a section of the choir. The specific duties and responsibilities can vary depending on the religious tradition and the particular institution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a canter in the synagogue.","correct":"✓ He is a cantor in the synagogue.","note":"'Cantor' is the correct spelling for the religious leader who sings or chants. 'Canter' refers to a horse's gait."}],"priority":"★★☆"},"related_words":{"derivatives":["cantorial (adjective: relating to a cantor or cantors)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cantor' is primarily used in religious contexts, specifically within Judaism and Christianity. It refers to a person who leads singing or chanting during religious services. The term is more common among those familiar with these religious traditions. Therefore, it is not typically part of everyday vocabulary. Understanding the word requires some familiarity with religious terminology and practices."},"example_sentences":[{"sentence":"The **cantor** chanted the ancient prayers in Hebrew.","translation":"礼拝奏者は古代の祈りをヘブライ語で詠唱した。","type":"noun","meaning_category":"ユダヤ教の礼拝奏者"},{"sentence":"The cathedral **cantor** led the choir in a powerful rendition of the anthem.","translation":"大聖堂の聖歌隊指揮者は、聖歌隊を率いて力強い賛歌を演奏した。","type":"noun","meaning_category":"キリスト教の聖歌隊指揮者"}]}