{"word":"long-arm","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"長腕ミシン","english_definition":"A type of sewing machine with a long arm, used for quilting large projects.","examples":[{"sentence":"She uses a long-arm quilting machine to create intricate designs on her quilts.","translation":"彼女は長腕キルティングミシンを使って、キルトに複雑なデザインを作ります。"}],"collocations":["long-arm quilting","long-arm machine","long-arm quilter"],"synonyms":["quilting machine"],"antonyms":[]},{"part_of_speech":"adjective","definition":"（法律・権力などが）広範囲に及ぶ、影響力のある","english_definition":"Having a wide reach or influence, especially in law enforcement or political power.","examples":[{"sentence":"The law has a long-arm statute, allowing the state to prosecute individuals outside its borders.","translation":"その法律には長腕法があり、州が国境の外にいる個人を起訴することを可能にしています。"},{"sentence":"The company's long-arm tactics intimidated its competitors.","translation":"その会社の広範囲に及ぶ戦術は、競合他社を脅かしました。"}],"collocations":["long-arm statute","long-arm jurisdiction","long-arm tactics"],"synonyms":["far-reaching","extensive","influential"],"antonyms":["limited","restricted"]}],"etymology":{"value":"Combination of 'long' and 'arm', referring to the extended reach of something, either physically (as in a sewing machine) or figuratively (as in legal jurisdiction).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɔŋ ˌɑːrm/","syllables":"long-arm"},"inflection":{"notes":"The plural form of the noun is 'long-arms'."},"usage_notes":{"explanation":"The term 'long-arm' has two main uses. As a noun, it refers to a specific type of sewing machine used for quilting large projects. As an adjective, it describes something that has a wide reach or influence, often in legal or political contexts. The adjective form often implies an aggressive or assertive reach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She used a long arm to sew the quilt.","correct":"✓ She used a long-arm machine to sew the quilt.","note":"When referring to the sewing machine, use 'long-arm machine' or 'long-arm quilting machine' rather than just 'long arm'."},{"incorrect":"✗ The long arm law helped them catch the criminal.","correct":"✓ The long-arm statute helped them catch the criminal.","note":"In a legal context, use 'long-arm statute' rather than 'long arm law'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["jurisdiction","statute","quilting","sewing machine"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"long-arm\" has two primary meanings. In the context of sewing and quilting, it refers to a specialized type of sewing machine designed for large projects. In legal and political contexts, it describes laws or tactics that have a broad reach or influence, often extending beyond normal boundaries. Understanding the context is crucial to interpreting the intended meaning."},"example_sentences":[{"sentence":"Many professional quilters prefer using a long-arm machine for its efficiency.","translation":"多くのプロのキルターは、その効率性から長腕ミシンを使うことを好みます。","type":"noun","meaning_category":"sewing machine"},{"sentence":"The state's long-arm statute allowed them to bring the lawsuit.","translation":"州の長腕法により、彼らは訴訟を起こすことができました。","type":"adjective","meaning_category":"legal"},{"sentence":"The company's long-arm marketing strategy reached customers worldwide.","translation":"その会社の広範囲に及ぶマーケティング戦略は、世界中の顧客に届きました。","type":"adjective","meaning_category":"influence"}]}