{"word":"archaeogeology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"考古地質学：考古学的な場所や人工物の研究に地質学的な手法や知識を応用する学問分野。遺跡の形成過程、古環境の復元、石器の材料分析などに用いられる。","english_definition":"The application of geological techniques and knowledge to archaeological studies. It involves the study of the geological context of archaeological sites and artifacts, including site formation processes, paleoenvironmental reconstruction, and sourcing of lithic materials.","examples":[{"sentence":"Archaeogeology helps us understand how ancient landscapes influenced human settlement patterns.","translation":"考古地質学は、古代の地形が人間の居住パターンにどのように影響を与えたかを理解するのに役立つ。"},{"sentence":"The archaeogeological analysis of the soil revealed evidence of past agricultural practices.","translation":"土壌の考古地質学的分析により、過去の農業活動の証拠が明らかになった。"},{"sentence":"Archaeogeologists study the sediments and rocks associated with archaeological sites.","translation":"考古地質学者は、遺跡に関連する堆積物や岩石を研究する。"}],"collocations":["archaeogeological analysis (考古地質学的分析)","archaeogeological survey (考古地質学的調査)","archaeogeological context (考古地質学的背景)","archaeogeological research (考古地質学的研究)"],"synonyms":["geoarchaeology","geological archaeology"],"antonyms":[]}],"etymology":{"value":"\"archaeo-\"（古代の、考古学の） + \"geology\"（地質学）の組み合わせ。考古学と地質学の学際的な性質を示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrkiːoʊdʒiˈɒlədʒi/","syllables":"ar-chae-o-ge-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Archaeogeology is an interdisciplinary field that combines the methods and knowledge of archaeology and geology. It is used to understand the relationship between past human activities and the natural environment. This includes studying the formation of archaeological sites, reconstructing past environments, and determining the sources of raw materials used by ancient people. The term is often used interchangeably with 'geoarchaeology', though some scholars may distinguish subtle differences in their focus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The archaeogeology studied the bones.","correct":"✓ The archaeogeologist studied the bones.","note":"Archaeogeology is the field of study; archaeogeologist is the person who studies it."},{"incorrect":"✗ Archaeogeology is only about rocks.","correct":"✓ Archaeogeology involves the study of rocks, sediments, soils, and other geological materials in relation to archaeological sites.","note":"While rocks are part of archaeogeology, the field encompasses a broader range of geological materials and processes."}],"priority":"★★☆"},"related_words":{"derivatives":["archaeogeologist (考古地質学者)","geoarchaeology (地理考古学、考古地理学)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Archaeogeology\" is a specialized term referring to the interdisciplinary study combining archaeology and geology. It's used to understand the geological context of archaeological sites, reconstruct past environments, and analyze the materials used by ancient people. This term is typically encountered in academic or professional contexts related to archaeology, geology, or environmental science."},"example_sentences":[{"sentence":"The archaeogeology of the region revealed a complex history of human occupation and environmental change.","translation":"その地域の考古地質学は、人間の居住と環境変化の複雑な歴史を明らかにした。","type":"noun","meaning_category":"学問分野"},{"sentence":"An archaeogeologist was brought in to analyze the soil samples from the ancient settlement.","translation":"古代の集落からの土壌サンプルを分析するために、考古地質学者が呼ばれた。","type":"related: archaeogeologist","meaning_category":"専門家"}]}