{"word":"vice-county","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に英国で用いられる)植物や動物の分布記録のために設けられた地理的な区分。","english_definition":"A geographical subdivision of Great Britain and Ireland, used for the purposes of biological recording, especially of plants and animals.","examples":[{"sentence":"The vice-county system provides a standardized framework for mapping biodiversity.","translation":"副郡制度は、生物多様性を地図化するための標準化された枠組みを提供する。"},{"sentence":"Botanists often record plant species according to their vice-county location.","translation":"植物学者は、植物種を副郡の場所に基づいて記録することが多い。"}],"collocations":["vice-county recorder","vice-county flora","vice-county boundary"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"The term 'vice-county' was introduced in 1852 by Hewett Cottrell Watson, who divided Great Britain into 112 such areas. Ireland was subsequently divided into 40 vice-counties. The 'vice-' prefix indicates that these are subdivisions of traditional counties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaɪsˌkaʊnti/","syllables":"vice-coun-ty"},"inflection":{"noun_plural":"vice-counties"},"usage_notes":{"explanation":"Vice-counties are primarily used in the fields of botany and zoology to provide a consistent and relatively small geographical unit for recording species distribution. This allows for more accurate mapping and monitoring of biodiversity than using traditional county boundaries, which can vary greatly in size and shape. The system is still in use today by many biological recording schemes in the UK and Ireland.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vice-county is a political division of the UK.","correct":"✓ The vice-county is a geographical division used for biological recording in the UK.","note":"Vice-counties are for biological recording, not political administration."}],"priority":"★☆☆"},"related_words":{"derivatives":["none"],"related_terms":["county","biodiversity","flora","fauna","biological recording"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vice-county' is a specialized term used in the context of biological recording, particularly in the UK and Ireland. It refers to a geographical subdivision created for the purpose of mapping and monitoring the distribution of plants and animals. Understanding this term requires familiarity with ecological surveying and regional geography. It is not commonly used outside of scientific or conservation contexts."},"example_sentences":[{"sentence":"The rare orchid was found in vice-county 37.","translation":"その珍しいランは副郡37で発見された。","type":"example","meaning_category":"location"},{"sentence":"Detailed vice-county maps are essential for ecological research.","translation":"詳細な副郡地図は、生態学研究に不可欠である。","type":"example","meaning_category":"research"}]}