{"word":"co-occurrence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共起、同時発生","english_definition":"The state or fact of two or more things occurring together, especially in a non-random way.","examples":[{"sentence":"The co-occurrence of these symptoms suggests a specific disease.","translation":"これらの症状の共起は、特定の疾患を示唆しています。"},{"sentence":"Analysis of word co-occurrence can reveal semantic relationships.","translation":"単語の共起分析は、意味的関係を明らかにすることができます。"},{"sentence":"The co-occurrence matrix shows how often different items appear together in a dataset.","translation":"共起行列は、異なるアイテムがデータセット内で一緒に現れる頻度を示します。"}],"collocations":["word co-occurrence (単語の共起)","co-occurrence matrix (共起行列)","co-occurrence network (共起ネットワーク)","symptom co-occurrence (症状の共起)","co-occurrence analysis (共起分析)","high co-occurrence (高い共起)","low co-occurrence (低い共起)"],"synonyms":["concurrence","correlation","association","simultaneous occurrence","joint occurrence"],"antonyms":["non-occurrence","absence"]},{"part_of_speech":"noun","definition":"(統計学、言語学など) 共起性","english_definition":"The property of occurring together, often used in statistical analysis, linguistics, and data mining.","examples":[{"sentence":"Co-occurrence is a key concept in text mining.","translation":"共起性はテキストマイニングにおける重要な概念です。"},{"sentence":"The co-occurrence of words can be used to build semantic networks.","translation":"単語の共起性を使用して、セマンティックネットワークを構築できます。"},{"sentence":"The algorithm identifies patterns based on the co-occurrence of events.","translation":"そのアルゴリズムは、イベントの共起性に基づいてパターンを識別します。"}],"collocations":["statistical co-occurrence (統計的な共起性)","linguistic co-occurrence (言語的な共起性)","data mining co-occurrence (データマイニングの共起性)","semantic co-occurrence (意味的な共起性)","pattern co-occurrence (パターンの共起性)"],"synonyms":["concurrence","correlation","association","simultaneity"],"antonyms":["independence","separation"]}],"etymology":{"value":"'Co-' (together) + 'occurrence' (the fact of something happening).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊ.əˈkʌrəns/","syllables":"co-oc-cur-rence"},"inflection":{"noun_plural":"co-occurrences"},"usage_notes":{"explanation":"'Co-occurrence' refers to the phenomenon of two or more things happening or being present together. It's often used in fields like statistics, linguistics, and data analysis to identify relationships and patterns. In linguistics, it can refer to words that frequently appear together, which can reveal semantic relationships. In statistics, it can be used to analyze the relationship between different variables. The term implies that the joint occurrence is not random and may indicate a meaningful connection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-occurance of these events is significant.","correct":"✓ The co-occurrence of these events is significant.","note":"Correct spelling is 'co-occurrence' with two 'r's."},{"incorrect":"✗ Co-occurrences are when two things happen.","correct":"✓ Co-occurrence is the phenomenon of two things happening together.","note":"'Co-occurrence' is a phenomenon or state, not an event or action."}],"priority":"★★☆"},"related_words":{"derivatives":["co-occur (verb)"],"phrases":["co-occurrence matrix","co-occurrence network","word co-occurrence"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Co-occurrence' is a noun that describes the situation when two or more things happen or are found together. It's often used in fields like linguistics (the study of language) and statistics. For example, in linguistics, we might talk about the co-occurrence of certain words, meaning those words are often used together. In statistics, it might refer to two events that tend to happen at the same time. It implies a relationship between the things that are co-occurring, suggesting it's not just a random coincidence."},"example_sentences":[{"sentence":"The **co-occurrence** of fever and cough is a common indicator of the flu.","translation":"発熱と咳の共起は、インフルエンザの一般的な指標です。","type":"noun","meaning_category":"simultaneous occurrence"},{"sentence":"We analyzed the **co-occurrence** of words in the text to understand the main themes.","translation":"テキスト内の単語の共起を分析して、主なテーマを理解しました。","type":"noun","meaning_category":"simultaneous occurrence"},{"sentence":"The **co-occurrence** matrix showed a strong relationship between the two variables.","translation":"共起行列は、2つの変数間に強い関係があることを示しました。","type":"noun","meaning_category":"simultaneous occurrence"}]}