{"word":"meter-candle-second","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物理) メートル燭光秒：光露光量のCGS単位系における単位。1秒間、1カンデラの光源から1メートルの距離にある面が受ける光の量。","english_definition":"(physics) A CGS unit of light exposure, equivalent to the amount of light received by a surface one meter away from a one candela source for one second.","examples":[{"sentence":"The photographic film required an exposure of 5 meter-candle-seconds.","translation":"その写真フィルムは5メートル燭光秒の露光量を必要とした。"}],"collocations":["light exposure","photographic film","CGS unit"],"synonyms":["lux second"],"antonyms":[]}],"etymology":{"value":"The term is derived from the units used in its definition: meter (unit of distance), candela (unit of luminous intensity), and second (unit of time).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmiːtərˌkændəlˌsekənd/","syllables":"me-ter-can-dle-sec-ond"},"inflection":{"noun_plural":"meter-candle-seconds"},"usage_notes":{"explanation":"The meter-candle-second is a unit of light exposure, specifically within the CGS (centimeter-gram-second) system of units. It represents the total amount of light energy received per unit area. While historically significant, it is less commonly used in modern scientific and engineering contexts, where the lux second (lx⋅s) is preferred.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The exposure was measured in meter-candles per second.","correct":"✓ The exposure was measured in meter-candle-seconds.","note":"The unit is meter-candle-seconds, not meter-candles per second. Meter-candles is a unit of illuminance (lux)."},{"incorrect":"✗ Use meter-candle-second to measure luminous intensity.","correct":"✓ Use candelas to measure luminous intensity.","note":"Meter-candle-second measures light exposure, while candelas measure luminous intensity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["lux second (lx⋅s)","lux (lx)","candela (cd)","lumen (lm)","illuminance","light exposure"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meter-candle-second' is a specialized unit in physics used to measure light exposure. It's part of the CGS unit system, representing the amount of light a surface receives from a one-candela source at a one-meter distance over one second. This term is rarely used in everyday contexts but may appear in technical or scientific literature related to photography, optics, or lighting design. Understanding its definition requires familiarity with units of luminous intensity (candela) and illuminance (lux)."},"example_sentences":[{"sentence":"The optimal exposure for the photograph was determined to be 2 meter-candle-seconds.","translation":"写真の最適な露光量は2メートル燭光秒と決定された。","type":"noun","meaning_category":"light exposure"},{"sentence":"Early photographic experiments often used meter-candle-seconds as a standard unit for measuring light.","translation":"初期の写真実験では、メートル燭光秒が光の測定の標準単位としてよく使用された。","type":"noun","meaning_category":"light measurement"}]}