{"word":"kinaesthetically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"運動感覚的に、体性感覚的に","english_definition":"In a way that relates to or involves a person's awareness of the position and movement of the parts of the body using sensory organs (proprioceptors) in muscles and joints.","examples":[{"sentence":"She learns best kinaesthetically, by doing and experiencing things.","translation":"彼女は、何かをしたり経験したりすることで、運動感覚的に最もよく学習する。"},{"sentence":"The dance was performed kinaesthetically, emphasizing the feeling of each movement.","translation":"そのダンスは、それぞれの動きの感覚を強調して、運動感覚的に行われた。"}],"collocations":["learn kinaesthetically (運動感覚的に学習する)","experience kinaesthetically (運動感覚的に経験する)","perform kinaesthetically (運動感覚的に実行する)","understand kinaesthetically (運動感覚的に理解する)"],"synonyms":["tactilely","haptically","physically","experientially"],"antonyms":["visually","auditorily","intellectually"]}],"etymology":{"value":"The word is derived from 'kinaesthetic' (also spelled 'kinesthetic'), which comes from the Greek words 'kinein' (to move) and 'aisthēsis' (perception). The adverbial form is created by adding the suffix '-ally'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkiːnɪsˈθetɪkli/","syllables":"ki-naes-thet-i-cal-ly"},"inflection":{"notes":"This is an adverb and does not have different inflections."},"usage_notes":{"explanation":"'Kinaesthetically' describes actions or processes that involve learning or understanding through physical movement and sensation. It is often used in educational contexts to describe a learning style where students learn best by doing, rather than by seeing or hearing. It can also be used in the context of dance, sports, or other physical activities to describe an emphasis on the feeling and experience of movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He learned the concept kinaesthetic.","correct":"✓ He learned the concept kinaesthetically.","note":"'Kinaesthetic' is an adjective, while 'kinaesthetically' is an adverb. Use the adverb to describe how something is done."},{"incorrect":"✗ She is a kinaesthetical learner.","correct":"✓ She is a kinaesthetic learner.","note":"Use the adjective 'kinaesthetic' to describe the type of learner."}],"priority":"★★☆"},"related_words":{"derivatives":["kinaesthetic (adjective: 運動感覚の)","kinaesthesia (noun: 運動感覚)","kinesthesia (noun: 運動感覚 - American spelling)"],"related_terms":["proprioception (noun: 固有受容)","haptic (adjective: 触覚の)","tactile (adjective: 触覚の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'kinaesthetically' refers to learning or experiencing something through physical movement and sensation. It is often used in the context of education to describe a learning style that emphasizes hands-on activities and physical experiences. It is a relatively uncommon word, so it is more likely to be encountered in academic or specialized contexts related to education, psychology, or physical therapy."},"example_sentences":[{"sentence":"The pottery class was taught kinaesthetically, allowing students to feel and shape the clay.","translation":"陶芸教室は運動感覚的に教えられ、生徒たちは粘土を感じて形作ることができた。","type":"adverb","meaning_category":"運動感覚的に"},{"sentence":"He remembered the dance steps kinaesthetically, relying on muscle memory.","translation":"彼は筋肉の記憶を頼りに、ダンスのステップを運動感覚的に思い出した。","type":"adverb","meaning_category":"運動感覚的に"},{"sentence":"The therapist helped the patient reconnect with their body kinaesthetically after the injury.","translation":"セラピストは、怪我の後、患者が運動感覚的に自分の体と再びつながるのを助けた。","type":"adverb","meaning_category":"運動感覚的に"}]}