{"word":"dactyliographic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"タイプライターで書かれた、タイプライターの","english_definition":"Relating to typewriting.","examples":[{"sentence":"The dactyliographic error was corrected before printing.","translation":"タイプライターで書かれた誤りは印刷前に修正された。"},{"sentence":"She submitted a dactyliographic manuscript to the publisher.","translation":"彼女はタイプライターで書かれた原稿を出版社に提出した。"}],"collocations":["dactyliographic error","dactyliographic manuscript"],"synonyms":["typewritten","typed"],"antonyms":["handwritten","manuscript"]}],"etymology":{"value":"From dactylio- +‎ -graphic. Dactylio- is derived from Ancient Greek δάκτυλος (dáktulos, “finger, toe”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdæktɪlɪoʊˈɡræfɪk/","syllables":"dac-ty-li-o-graph-ic"},"inflection":{"notes":"This word does not have common inflections beyond comparative/superlative, which are rare."},"usage_notes":{"explanation":"The word 'dactyliographic' is quite rare in modern English. It specifically refers to something produced by a typewriter. With the advent of computers and word processors, the term 'typewritten' is much more commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dactyliographic document was printed by a computer.","correct":"✓ The typewritten document was printed by a computer.","note":"'Dactyliographic' refers to something written with a typewriter, not printed by a computer."}],"priority":"★☆☆"},"related_words":{"derivatives":["dactylography (the study of fingerprints or the art of typewriting)"],"related_terms":["typewriter","typewritten","typed"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dactyliographic' is a rare and technical term that specifically describes something produced by a typewriter. It is not commonly used in modern English, having been largely replaced by 'typewritten' or 'typed'. Its use is typically limited to historical or technical contexts. Understanding the etymology can help in deciphering the meaning, but it is unlikely to be encountered in everyday language."},"example_sentences":[{"sentence":"The museum displayed a dactyliographic letter from the early 20th century.","translation":"博物館は20世紀初頭のタイプライターで書かれた手紙を展示していた。","type":"adjective","meaning_category":"Relating to typewriting"},{"sentence":"The forensic analysis included examining the dactyliographic characteristics of the ransom note.","translation":"法医学的分析には、身代金要求の手紙のタイプライターの特徴の調査が含まれていた。","type":"adjective","meaning_category":"Relating to typewriting"}]}