{"word":"Aaliis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of flowering plants in the rose family, commonly known as serviceberries or shadbushes.","english_definition":"A genus of shrubs or small trees in the rose family, native to North America, Europe, and Asia, known for their showy white flowers in spring and edible, berry-like fruit.","examples":[{"sentence":"The Aaliis trees were in full bloom, covering the hillside in white.","translation":"アアリイスの木々は満開で、丘の斜面を白で覆っていました。"},{"sentence":"The birds were feasting on the ripe Aaliis berries.","translation":"鳥たちは熟したアアリイスの果実をむさぼり食っていました。"}],"collocations":["Aaliis tree","Aaliis berries","Aaliis flowers","Aaliis species"],"synonyms":["Serviceberry","Shadbush","Amelanchier"],"antonyms":[]}],"etymology":{"value":"Derived from the old French name for the European species, 'amélanchier'.","priority":"★★☆"},"pronunciation":{"ipa":"/eɪˈeɪliːɪs/","syllables":"A-a-li-is"},"inflection":{"noun_plural":"Aaliises"},"usage_notes":{"explanation":"'Aaliis' is the scientific genus name, while 'serviceberry' or 'shadbush' are more common names. It's used in botanical contexts or when specifying the genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Aaliis in my garden, it was a rose.","correct":"✓ I saw an Aaliis in my garden, it was a serviceberry.","note":"Aaliis is a genus of serviceberries, not roses."}],"priority":"★☆☆"},"related_words":{"derivatives":["Aaliis japonica","Aaliis canadensis","Aaliis arborea"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aaliis' is a botanical term referring to a genus of plants, more commonly known as serviceberries or shadbushes. The term is primarily used in scientific or horticultural contexts. Understanding of this term implies familiarity with botanical nomenclature."},"example_sentences":[{"sentence":"The Aaliis canadensis is a popular ornamental tree.","translation":"カナダザイフリボクは人気の観賞用樹木です。","type":"noun","meaning_category":"Botanical"},{"sentence":"Propagation of Aaliis can be achieved through seeds or cuttings.","translation":"アアリイスの繁殖は種子または挿し木によって達成できます。","type":"noun","meaning_category":"Botanical"}]}