{"word":"usufructuary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"用益権者、使用収益権者","english_definition":"A person who has the right to enjoy the use and advantages of something belonging to another, without damaging or altering it in substance.","examples":[{"sentence":"The usufructuary was allowed to live in the house for the remainder of their life.","translation":"その用益権者は、残りの人生をその家で暮らすことを許可された。"},{"sentence":"As a usufructuary, she was entitled to the income from the farm.","translation":"用益権者として、彼女はその農場からの収入を得る権利があった。"}],"collocations":["become a usufructuary","rights of a usufructuary","the late usufructuary"],"synonyms":["beneficiary","tenant","leaseholder"],"antonyms":["owner","landlord"]},{"part_of_speech":"adjective","definition":"用益権の、使用収益権の","english_definition":"Relating to or having the nature of usufruct; pertaining to the right of enjoying the use and advantages of something belonging to another.","examples":[{"sentence":"The usufructuary rights were clearly defined in the contract.","translation":"その用益権は契約書で明確に定義されていた。"},{"sentence":"The usufructuary agreement outlined the responsibilities of both parties.","translation":"その用益権契約は、両当事者の責任を概説していた。"}],"collocations":["usufructuary rights","usufructuary agreement","usufructuary property"],"synonyms":["beneficial","possessory","tenurial"],"antonyms":["proprietary","owned"]}],"etymology":{"value":"From the Latin 'ususfructus', from 'usus' (use) + 'fructus' (enjoyment, fruit).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːzuːˈfrʌktʃəri/","syllables":"u-su-fruct-u-a-ry"},"inflection":{"noun_plural":"usufructuaries"},"usage_notes":{"explanation":"'Usufructuary' refers to someone who has the legal right to use and derive profit or benefit from property that belongs to another person, as long as the property is not damaged or altered. It can also describe things related to this right. This term is most often used in legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the usufructuary of the building, so he can sell it.","correct":"✓ He is the usufructuary of the building, so he can use it and collect rent, but he cannot sell it.","note":"A usufructuary can use and benefit from the property, but does not have the right to sell it. The ownership remains with someone else."}],"priority":"★★☆"},"related_words":{"derivatives":["usufruct (noun: the right to enjoy the use and advantages of something belonging to another)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'usufructuary' is a technical legal term. It refers to a person who has the right to use and enjoy the benefits of property that belongs to someone else, without owning the property itself. Understanding this word requires familiarity with legal and property concepts."},"example_sentences":[{"sentence":"The will designated her as the usufructuary of the estate.","translation":"遺言書は彼女をその財産の用益権者として指定した。","type":"noun","meaning_category":"用益権者"},{"sentence":"The usufructuary lease allowed him to farm the land for twenty years.","translation":"その用益権リースにより、彼は20年間その土地で農業をすることができた。","type":"adjective","meaning_category":"用益権の"}]}