{"word":"logicist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"論理主義者：数学を論理学に還元できると信じる人","english_definition":"A proponent of logicism; someone who believes that mathematics can be reduced to logic.","examples":[{"sentence":"As a logicist, Frege attempted to derive arithmetic from purely logical principles.","translation":"論理主義者として、フレーゲは算術を純粋に論理的な原理から導き出そうと試みた。"},{"sentence":"Russell and Whitehead were prominent logicists who co-authored Principia Mathematica.","translation":"ラッセルとホワイトヘッドは、プリンキピア・マテマティカを共著した著名な論理主義者だった。"}],"collocations":["famous logicist","prominent logicist","early logicist"],"synonyms":["logical positivist","mathematical logician"],"antonyms":["intuitionist","formalist"]}],"etymology":{"value":"'logic' + '-ist'.  From the belief that all of mathematics can be derived from logic.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɒdʒɪsɪst/","syllables":"lo-gi-cist"},"inflection":{"noun_plural":"logicists"},"usage_notes":{"explanation":"The term 'logicist' is primarily used in the context of philosophy of mathematics. It refers to those who adhere to the philosophical position of logicism, which asserts that mathematics is, in some significant sense, reducible to logic. This view was prominent in the late 19th and early 20th centuries, particularly with the work of Frege and Russell.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good logicist because he is very logical.","correct":"✓ He is a logicist because he believes mathematics can be derived from logic.","note":"Being logical is not sufficient to be a logicist. A logicist specifically believes in the reducibility of mathematics to logic."}],"priority":"★★☆"},"related_words":{"derivatives":["logicism (noun): The philosophical doctrine that mathematics is reducible to logic.","logic (noun): The study of reasoning.","logical (adjective): Consistent with the principles of logic."],"related_concepts":["philosophy of mathematics","foundations of mathematics","Principia Mathematica"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency. This is a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'logicist' refers to someone who believes in logicism, a philosophical idea that mathematics can be completely explained by logic. This is a term mainly used when discussing the philosophy of mathematics. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The debate between the logicist and the formalist schools of thought shaped the early 20th century philosophy of mathematics.","translation":"論理主義と形式主義の学派間の議論は、20世紀初頭の数学の哲学を形作った。","type":"noun","meaning_category":"philosophy of mathematics"},{"sentence":"Peano's axioms, though influential, were seen by the logicist Frege as insufficient for a complete foundation of arithmetic.","translation":"ペアノの公理は影響力があったものの、論理主義者のフレーゲからは、算術の完全な基礎としては不十分であると見なされた。","type":"noun","meaning_category":"philosophy of mathematics"}]}