{"word":"innuendoing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(遠回しな言い方や当てこすりによって)ほのめかす、当てこする","english_definition":"to make insinuations or suggestive remarks.","examples":[{"sentence":"He was innuendoing about her private life.","translation":"彼は彼女の私生活についてほのめかしていた。"},{"sentence":"Are you innuendoing that I'm lying?","translation":"私が嘘をついていると当てこすっているのですか？"}],"collocations":[],"synonyms":["imply","insinuate","suggest","hint","intimate"],"antonyms":["state directly","declare openly"]}],"etymology":{"value":"The word \"innuendo\" comes from the Latin word \"innuendo,\" which is the gerund of \"innuere,\" meaning \"to nod to, hint, or signify.\" The suffix \"-ing\" indicates the present participle form of the verb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnjuˈɛndoʊɪŋ/","syllables":"in-nu-en-do-ing"},"inflection":{"verb_forms":{"present_simple":["innuendoes"],"past_simple":"innuendoed","past_participle":"innuendoed","present_participle":"innuendoing"}},"usage_notes":{"explanation":"\"Innuendoing\" is the present participle form of the verb \"innuendo,\" which means to make an indirect or subtle suggestion about something, usually something negative or offensive. It often involves speaking in a way that hints at something without explicitly stating it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was innuendoing the truth.","correct":"✓ He was innuendoing about the truth.","note":"When using \"innuendo\" as a verb, it is often followed by \"about\" when referring to the subject of the insinuation."},{"incorrect":"✗ She innuendoed me that I was lazy.","correct":"✓ She innuendoed to me that I was lazy.","note":"When indicating to whom the innuendo is directed, use \"to\" before the person."}],"priority":"★☆☆"},"related_words":{"derivatives":["innuendo (noun): an indirect or subtle suggestion, typically a derogatory one.","innuendo (verb): to make insinuations or suggestive remarks."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"innuendoing\" is the present participle of \"innuendo,\" which means to make indirect and often derogatory suggestions. This word is relatively advanced and not commonly used in everyday conversation. It is more often found in literature, legal contexts, or formal discussions where subtle and suggestive communication is being analyzed. Understanding this word requires a good grasp of nuanced language and the ability to recognize indirect communication.","priority":"★☆☆"},"example_sentences":[{"sentence":"The politician was accused of innuendoing his opponent's lack of experience.","translation":"その政治家は、対立候補の経験不足をほのめかしていると非難された。","type":"verb","meaning_category":"ほのめかす"},{"sentence":"She was innuendoing about the reasons for his sudden departure.","translation":"彼女は彼の突然の出発の理由について当てこすっていた。","type":"verb","meaning_category":"当てこする"}]}