{"word":"nongangrenous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"壊疽（えそ）を起こしていない、非壊疽性の","english_definition":"Not affected by or relating to gangrene.","examples":[{"sentence":"The wound was determined to be nongangrenous.","translation":"その傷は壊疽性ではないと判断された。"},{"sentence":"A nongangrenous ulcer can still be a serious medical concern.","translation":"非壊疽性の潰瘍でも、依然として深刻な医学的懸念事項となりうる。"}],"collocations":["nongangrenous wound","nongangrenous ulcer","nongangrenous tissue"],"synonyms":["non-necrotic","viable","healthy"],"antonyms":["gangrenous","necrotic","infected"]}],"etymology":{"value":"\"Non-\" (否定) + \"gangrenous\" (壊疽性の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒŋˈɡæŋɡrənəs/","syllables":"non-gan-gre-nous"},"inflection":{"notes":"adjective; comparative and superlative forms are formed using 'more' and 'most' (e.g., more nongangrenous, most nongangrenous)"},"usage_notes":{"explanation":"\"Nongangrenous\" is a medical term used to describe a condition or tissue that does not exhibit gangrene. Gangrene is the death of body tissue due to a lack of blood supply or a serious bacterial infection. Therefore, \"nongangrenous\" indicates the absence of this condition. It is often used in medical reports and diagnoses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The foot was nongangrenous, so it needed amputation.","correct":"✓ The foot was gangrenous, so it needed amputation.","note":"Amputation is typically required when tissue is gangrenous (dead or dying), not when it is nongangrenous (healthy)."},{"incorrect":"✗ The wound is nongangrenous, meaning it's very dangerous.","correct":"✓ The wound is gangrenous, meaning it's very dangerous.","note":"A nongangrenous wound is generally less dangerous than a gangrenous one. Gangrene indicates severe tissue damage and potential systemic infection."}],"priority":"★★☆"},"related_words":{"derivatives":["gangrene (noun: 壊疽)","gangrenous (adjective: 壊疽性の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nongangrenous\" is a specialized medical term. It means that a part of the body is not affected by gangrene, which is the death of body tissue. If a doctor says a wound is \"nongangrenous,\" it means the tissue around the wound is still alive and not decaying due to lack of blood supply or infection. This term is mostly used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor confirmed that the ulcer was nongangrenous and could be treated with antibiotics.","translation":"医師は、その潰瘍が非壊疽性であり、抗生物質で治療できることを確認した。","type":"medical context","meaning_category":"absence of gangrene"},{"sentence":"Despite the injury, the tissue remained nongangrenous, indicating good blood flow.","translation":"怪我にもかかわらず、組織は非壊疽性のままであり、良好な血流を示していた。","type":"medical context","meaning_category":"absence of gangrene"}]}