{"word":"Termitidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シロアリ科","english_definition":"A family of termites, belonging to the order Blattodea, characterized by their highly social behavior and role as decomposers.","examples":[{"sentence":"Termitidae is one of the most diverse families within the termites.","translation":"シロアリ科は、シロアリの中で最も多様な科の一つです。"},{"sentence":"Many species of Termitidae are important in nutrient cycling in tropical ecosystems.","translation":"シロアリ科の多くの種は、熱帯生態系における栄養循環において重要です。"}],"collocations":["Termitidae nest (シロアリ科の巣)","Termitidae colony (シロアリ科のコロニー)","Termitidae species (シロアリ科の種)"],"synonyms":["termite family"],"antonyms":[]}],"etymology":{"value":"Derived from Termes (the genus name for termites) + -idae (a suffix used to denote a zoological family).","priority":"★★★"},"pronunciation":{"ipa":"/tɜːrˈmɪtɪdiː/","syllables":"Ter-mi-ti-dae"},"inflection":{"noun_plural":"Termitidae (same as singular)"},"usage_notes":{"explanation":"'Termitidae' refers specifically to the family of termites. When discussing a single species within this family, it's more appropriate to use the genus and species name (e.g., *Nasutitermes corniger*). The term is primarily used in scientific and academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Termitidae are an insect.","correct":"✓ Termitidae are a family of insects.","note":"'Termitidae' refers to a family, not a single insect. Therefore, use the plural form of the verb ('are')."},{"incorrect":"✗ Termitidae is only found in tropical regions.","correct":"✓ Termitidae are found in various regions, but are most diverse in tropical regions.","note":"While Termitidae are most diverse in the tropics, they can be found in other regions as well."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Isoptera (シロアリ目 - outdated taxonomic name)","Blattodea (ゴキブリ目 - modern taxonomic name including termites)","Termes (シロアリ属)","Nasutitermes (シロアリ属)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Termitidae' is a scientific term used in biology and ecology to refer to a specific family of termites. Understanding this term requires familiarity with biological classification systems. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Research on Termitidae provides insights into social insect behavior.","translation":"シロアリ科に関する研究は、社会性昆虫の行動に関する洞察を提供します。","type":"scientific context","meaning_category":"シロアリ科の研究"},{"sentence":"The diversity of Termitidae is highest in tropical rainforests.","translation":"シロアリ科の多様性は、熱帯雨林で最も高いです。","type":"ecological context","meaning_category":"シロアリ科の生態"}]}