{"word":"Nonmobility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不動性、移動不能、可動性の欠如","english_definition":"The state of being unable to move or be moved; lack of mobility.","examples":[{"sentence":"The patient's nonmobility after the surgery required extensive physical therapy.","translation":"手術後の患者の不動性のため、広範囲な理学療法が必要だった。"},{"sentence":"Nonmobility is a significant concern for elderly individuals living alone.","translation":"不動性は、一人暮らしの高齢者にとって重大な懸念事項である。"},{"sentence":"Prolonged nonmobility can lead to muscle atrophy and other health complications.","translation":"長期にわたる不動性は、筋肉の萎縮やその他の健康上の合併症を引き起こす可能性がある。"}],"collocations":["prolonged nonmobility (長期にわたる不動性)","patient nonmobility (患者の不動性)","cause nonmobility (不動性を引き起こす)","result in nonmobility (不動性をもたらす)"],"synonyms":["immobility","inactivity","sedentariness","motionlessness","stillness"],"antonyms":["mobility","movement","activity","motion","agility"]},{"part_of_speech":"adjective","definition":"移動性のない、不動の","english_definition":"Not able to be moved; lacking mobility.","examples":[{"sentence":"The nonmobility of the statue made it difficult to transport.","translation":"その像は移動性がなかったため、輸送が困難だった。"},{"sentence":"The nonmobility of the equipment was a major obstacle in the rescue operation.","translation":"その装置の移動性のなさが、救助活動における大きな障害となった。"}],"collocations":["nonmobility equipment (移動性のない装置)","nonmobility status (不動状態)"],"synonyms":["immobile","fixed","stationary","unmovable"],"antonyms":["mobile","movable","portable","transportable"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"mobility\" (移動性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnməˈbɪləti/","syllables":"non-mo-bil-i-ty"},"inflection":{"noun_plural":"nonmobilities"},"usage_notes":{"explanation":"\"Nonmobility\" refers to the state of being unable to move or be moved. It is often used in medical contexts to describe a patient's condition after surgery or due to illness. It can also refer to objects that are fixed in place and cannot be easily transported. The adjective form is less common but describes something that lacks mobility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-mobility of the patient was a concern.","correct":"✓ The nonmobility of the patient was a concern.","note":"While \"non-mobility\" with a hyphen is sometimes used, \"nonmobility\" (without the hyphen) is the more standard and preferred form."}],"priority":"★★☆"},"related_words":{"derivatives":["mobility","immobility"],"antonyms":["mobility"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonmobility\" is a relatively uncommon term that refers to the state of being unable to move. It's often used in medical or technical contexts. Understanding the prefix \"non-\" (meaning \"not\") and the word \"mobility\" (the ability to move) can help in understanding the meaning of \"nonmobility.\" It is more frequently used in formal writing or specialized fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient experienced complete nonmobility following the spinal injury.","translation":"患者は脊髄損傷後、完全な不動性を経験した。","type":"noun","meaning_category":"不動性"},{"sentence":"The nonmobility of the heavy machinery made it difficult to relocate the factory.","translation":"その重機の不動性により、工場の移転は困難になった。","type":"noun","meaning_category":"不動性"},{"sentence":"The doctor prescribed exercises to counteract the effects of prolonged nonmobility.","translation":"医師は、長期にわたる不動性の影響を打ち消すための運動を処方した。","type":"noun","meaning_category":"不動性"}]}