{"word":"Pan-Africanist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"汎アフリカ主義者","english_definition":"An advocate of Pan-Africanism, the belief that people of African descent, whether living in Africa or the diaspora, share not merely a common history, but a common destiny, and should be unified politically, economically, and socially.","examples":[{"sentence":"He was a dedicated Pan-Africanist who worked tirelessly to promote unity among African nations.","translation":"彼は献身的な汎アフリカ主義者であり、アフリカ諸国間の団結を促進するために精力的に活動した。"},{"sentence":"The conference brought together Pan-Africanists from around the world to discuss strategies for development.","translation":"その会議には、開発戦略を議論するために世界中から汎アフリカ主義者が集まった。"}],"collocations":["leading Pan-Africanist","prominent Pan-Africanist","dedicated Pan-Africanist","Pan-Africanist movement","Pan-Africanist ideology"],"synonyms":["African unity advocate","Pan-African advocate"],"antonyms":["separatist","nationalist"]},{"part_of_speech":"adjective","definition":"汎アフリカ主義の","english_definition":"Relating to or characteristic of Pan-Africanism.","examples":[{"sentence":"The organization promotes Pan-Africanist ideals and principles.","translation":"その組織は汎アフリカ主義の理想と原則を推進している。"},{"sentence":"The conference focused on Pan-Africanist solutions to the continent's challenges.","translation":"その会議は、大陸の課題に対する汎アフリカ主義的な解決策に焦点を当てた。"}],"collocations":["Pan-Africanist movement","Pan-Africanist ideology","Pan-Africanist principles","Pan-Africanist organization","Pan-Africanist conference"],"synonyms":["African unity","Pan-African"],"antonyms":["nationalist","regionalist"]}],"etymology":{"value":"The term combines \"Pan-\" (meaning all or whole) with \"Africanist\" (referring to Africa and its people). It reflects the belief in the unity of all people of African descent.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpæn æˈfrɪkənɪst/","syllables":"Pan-Af-ri-can-ist"},"inflection":{"noun_plural":"Pan-Africanists"},"usage_notes":{"explanation":"A \"Pan-Africanist\" is someone who believes in and promotes the idea of Pan-Africanism, which is the unification and solidarity of all people of African descent. The term can also be used as an adjective to describe ideas, movements, or organizations related to Pan-Africanism. It is often associated with movements for political and economic cooperation among African nations and the empowerment of African people worldwide.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Pan-African.","correct":"✓ He is a Pan-Africanist.","note":"The correct term for a person who supports Pan-Africanism is \"Pan-Africanist,\" not \"Pan-African.\""},{"incorrect":"✗ Pan-Africanism is only for Africans living in Africa.","correct":"✓ Pan-Africanism is for all people of African descent, including those in the diaspora.","note":"Pan-Africanism encompasses all people of African descent, regardless of where they live."}],"priority":"★★☆"},"related_words":{"derivatives":["Pan-Africanism (noun: the belief in the unity of all people of African descent)","Pan-African (adjective: relating to all of Africa or people of African descent)"],"phrases":["African diaspora","Black nationalism","continental unity"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pan-Africanist\" refers to someone who supports Pan-Africanism, the idea that all people of African descent share a common history and destiny and should work together. It's a term used in political and historical contexts, often in discussions about African unity, identity, and empowerment. The term is more specialized and less common in everyday conversation."},"example_sentences":[{"sentence":"Kwame Nkrumah was a prominent **Pan-Africanist** leader.","translation":"クワメ・エンクルマは著名な**汎アフリカ主義**の指導者だった。","type":"noun","meaning_category":"汎アフリカ主義者"},{"sentence":"The conference promoted a **Pan-Africanist** approach to economic development.","translation":"その会議は、経済発展に対する**汎アフリカ主義**的なアプローチを推進した。","type":"adjective","meaning_category":"汎アフリカ主義の"}]}