{"word":"conniving-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having eyes that suggest a tendency to scheme or plot in a deceitful or manipulative way.","english_definition":"Having eyes that give the impression of being scheming, deceitful, or manipulative.","examples":[{"sentence":"The villain in the movie had a conniving-eyed stare that made the audience uneasy.","translation":"映画の悪役は、観客を不安にさせるような、策略的な目をしていた。"},{"sentence":"With a conniving-eyed glance, he signaled his accomplice to begin the plan.","translation":"彼は策略的な目で合図を送り、共犯者に計画を開始させた。"},{"sentence":"She gave him a conniving-eyed look, hinting at the mischief she was about to cause.","translation":"彼女はいたずらをしようとしていることを暗示するように、彼に策略的な目を向けた。"}],"collocations":["conniving-eyed stare","conniving-eyed glance","conniving-eyed look","with a conniving-eyed expression"],"synonyms":["scheming-eyed","calculating-eyed","deceitful-eyed","manipulative-eyed","sly-eyed"],"antonyms":["innocent-eyed","naive-eyed","honest-eyed","trusting-eyed","sincere-eyed"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"conniving\" (implying scheming or plotting) with \"eyed\" (having eyes of a certain type). The word \"connive\" comes from the Latin \"connivere,\" meaning \"to shut the eyes (at something), dissemble, wink.\"","priority":"★★★"},"pronunciation":{"ipa":"/kəˈnaɪvɪŋ aɪd/","syllables":"con-niv-ing-eyed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The adjective \"conniving-eyed\" is used to describe someone whose eyes give the impression of being involved in secret or dishonest plans. It suggests a subtle but noticeable expression that hints at deceit or manipulation. This term is often used in literature or film to characterize villains or untrustworthy individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was conniving eyed.","correct":"✓ He was conniving-eyed.","note":"The hyphen is important to connect the two words into a single adjective modifying a noun."},{"incorrect":"✗ She had a conniving eye.","correct":"✓ She had conniving eyes. / ✓ She was conniving-eyed.","note":"The adjective \"conniving-eyed\" describes someone's general appearance or characteristic, so it's usually pluralized as \"eyes\" or used as a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["conniving (adjective, noun)","conniver (noun)"],"phrasal_verbs":[],"related_adjectives":["scheming","deceitful","manipulative","sly","crafty"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"conniving-eyed\" is a descriptive adjective used to portray a character or person whose eyes suggest a tendency towards scheming or deceit. It's a relatively uncommon term, often found in literature or descriptive writing to quickly convey a sense of untrustworthiness or slyness. Understanding the base word \"conniving\" is crucial to grasping the meaning of this compound adjective. It suggests a subtle, often unsettling, expression.","priority":"★★☆"},"example_sentences":[{"sentence":"The detective noticed the suspect's conniving-eyed expression and knew he was hiding something.","translation":"刑事は容疑者の策略的な表情に気づき、彼が何かを隠していることを知った。","type":"adjective","meaning_category":"deceptive appearance"},{"sentence":"Her conniving-eyed smile didn't fool anyone; everyone knew she was up to no good.","translation":"彼女の策略的な笑顔は誰をも騙せなかった。誰もが彼女が何か企んでいることを知っていた。","type":"adjective","meaning_category":"scheming intent"},{"sentence":"The conniving-eyed merchant tried to swindle the tourists with overpriced souvenirs.","translation":"その策略的な商人は、法外な値段の土産物で観光客を騙そうとした。","type":"adjective","meaning_category":"manipulative behavior"}]}