{"word":"non-ichthyic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"魚類に属さない、魚類でない","english_definition":"Not relating to or resembling fish; not belonging to the class Pisces (fish).","examples":[{"sentence":"Non-ichthyic vertebrates include mammals, birds, reptiles, and amphibians.","translation":"非魚類の脊椎動物には、哺乳類、鳥類、爬虫類、両生類が含まれる。"},{"sentence":"This study focuses on non-ichthyic aquatic life.","translation":"この研究は、非魚類の水中生物に焦点を当てている。"}],"collocations":["non-ichthyic vertebrate","non-ichthyic species","non-ichthyic aquatic life"],"synonyms":["non-piscine"],"antonyms":["ichthyic","piscine"]}],"etymology":{"value":"'Non-' (not) + 'ichthyic' (relating to fish). 'Ichthyic' comes from Greek 'ichthys' (fish).","priority":"medium"},"pronunciation":{"ipa":"/ˌnɒn ɪkˈθɪɪk/","syllables":"non-ich-thy-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"Primarily used in scientific or technical contexts, especially in biology, zoology, and ecology, to distinguish organisms that are not fish. It is often used when discussing broader categories of aquatic or vertebrate life.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-ichthyic fish were removed from the tank.","correct":"✓ The non-ichthyic organisms were removed from the tank.","note":"'Non-ichthyic fish' is a contradiction, as it means 'not fish fish'. Use 'non-ichthyic organisms' or specify the type of organism (e.g., 'non-ichthyic invertebrates')."}],"priority":"low"},"related_words":{"derivatives":["ichthyic (adjective: relating to fish)","ichthyology (noun: the study of fish)"],"related_terms":["pisces (noun: the taxonomic class of fish)","vertebrate (noun: an animal with a backbone)","invertebrate (noun: an animal without a backbone)"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Non-ichthyic' is a technical term used in biology and zoology to describe organisms that are not fish. It is formed by adding the prefix 'non-' to 'ichthyic,' which means 'relating to fish.' This term is primarily found in scientific papers, textbooks, and other academic materials related to the study of animal life, particularly when contrasting fish with other aquatic or vertebrate species."},"example_sentences":[{"sentence":"The research compared the respiratory systems of ichthyic and non-ichthyic animals.","translation":"その研究では、魚類と非魚類の動物の呼吸器系が比較された。","type":"general","meaning_category":"general"},{"sentence":"The biodiversity survey included both ichthyic and non-ichthyic species in the river.","translation":"その生物多様性調査には、川の魚類と非魚類の両方の種が含まれていた。","type":"general","meaning_category":"general"}]}