{"word":"Cheddites","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural) Supporters or members of the Cheddite movement, a British far-right political group active in the 1990s.","english_definition":"Plural form of Cheddite: Supporters or members of the Cheddite movement, a British far-right political group active in the 1990s.","examples":[{"sentence":"The Cheddites held a small rally in Bristol.","translation":"チェダイト派はブリストルで小規模な集会を開催した。"},{"sentence":"Few people remember the Cheddites today.","translation":"今日、チェダイト派を覚えている人はほとんどいない。"}],"collocations":["Cheddite movement","far-right Cheddites"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Cheddar', likely referencing Cheddar, Somerset, England, where the group may have originated or had a significant presence. The suffix '-ite' is commonly used to denote a follower or supporter of a particular person, idea, or movement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɛdaɪts/","syllables":"Ched-dites"},"inflection":{"noun_plural":"Cheddites"},"usage_notes":{"explanation":"'Cheddites' refers specifically to the members or supporters of a now largely defunct British far-right political group. It is a niche term with limited general use.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Cheddite (singular noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a historical and niche term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cheddites' is a highly specific and uncommon term relating to a particular historical political group. Understanding requires knowledge of British far-right political history. It is unlikely to be encountered outside of specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Cheddites' political views were widely condemned.","translation":"チェダイト派の政治的見解は広く非難された。","type":"noun","meaning_category":"Political Affiliation"},{"sentence":"Historians have documented the activities of the Cheddites in the 1990s.","translation":"歴史家たちは1990年代のチェダイト派の活動を記録している。","type":"noun","meaning_category":"Historical Reference"}]}