{"word":"crossability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"交雑性、交配可能性","english_definition":"The ability of two different species or varieties to be crossed to produce viable offspring.","examples":[{"sentence":"The crossability between these two plant species is very low.","translation":"これらの2つの植物種間の交雑性は非常に低い。"},{"sentence":"Understanding the crossability of different wheat varieties is important for breeding programs.","translation":"異なる小麦品種の交雑性を理解することは、育種プログラムにとって重要である。"}],"collocations":["high crossability","low crossability","interspecific crossability","intraspecific crossability"],"synonyms":["hybridizability","compatibility"],"antonyms":["incompatibility"]},{"part_of_speech":"noun","definition":"（道路などの）横断の容易さ、渡りやすさ","english_definition":"The ease with which something can be crossed or traversed.","examples":[{"sentence":"The crossability of the river was improved by the construction of a new bridge.","translation":"新しい橋の建設により、その川の渡りやすさが向上した。"},{"sentence":"The crossability of the mountain pass depends on the weather conditions.","translation":"その峠の渡りやすさは、気象条件に左右される。"}],"collocations":["road crossability","river crossability","terrain crossability"],"synonyms":["traversability","passability"],"antonyms":["impassability"]}],"etymology":{"value":"Formed from 'crossable' (able to be crossed) + '-ity' (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɒsəˈbɪləti/","syllables":"cross-a-bil-i-ty"},"inflection":{"noun_plural":"crossabilities"},"usage_notes":{"explanation":"'Crossability' is a technical term primarily used in genetics and breeding to describe the ability of different species or varieties to interbreed successfully. It can also refer, less commonly, to the ease of crossing a physical barrier like a road or river. The context usually makes the intended meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The crossability of the idea was questionable.","correct":"The feasibility of the idea was questionable.","note":"'Crossability' should not be used metaphorically to describe the transferability of ideas. Use 'feasibility' or 'transferability' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["crossable","cross","crossing"],"related_terms":["hybrid","species","variety","breeding","genetics","terrain","traverse"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crossability' is a relatively uncommon term, primarily used in scientific contexts, especially in genetics and plant or animal breeding. It refers to the degree to which two different species or varieties can be successfully interbred to produce viable offspring. Outside of these specific fields, the word is rarely used, and alternative terms like 'passability' or 'traversability' might be more appropriate when referring to the ease of crossing a physical barrier."},"example_sentences":[{"sentence":"High crossability between these two strains allows for efficient gene transfer.","translation":"これらの2つの系統間の高い交雑性により、効率的な遺伝子伝達が可能になる。","type":"noun","meaning_category":"交雑性"},{"sentence":"The researchers investigated the crossability of different rice cultivars.","translation":"研究者たちは、異なるイネ品種の交雑性を調査した。","type":"noun","meaning_category":"交雑性"},{"sentence":"The bridge improved the crossability of the valley for local residents.","translation":"その橋は、地元住民にとって谷の渡りやすさを向上させた。","type":"noun","meaning_category":"横断の容易さ"}]}