{"word":"Sociocracy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"社会統治、ソシオクラシー：参加型ガバナンスシステムの一種で、組織の意思決定権を、組織の目的達成に必要な活動を行うグループに分散させるもの。自己組織化と継続的改善を重視する。","english_definition":"A system of governance in which decision-making authority is distributed among self-organizing groups that perform activities necessary to achieve the organization's aims; emphasizes self-organization and continuous improvement.","examples":[{"sentence":"The company decided to implement Sociocracy to improve employee engagement and decision-making.","translation":"その会社は、従業員のエンゲージメントと意思決定を改善するために、ソシオクラシーを導入することを決定しました。"},{"sentence":"Sociocracy is based on the principles of consent, equivalence, and continuous improvement.","translation":"ソシオクラシーは、同意、同等性、継続的改善の原則に基づいています。"},{"sentence":"In a Sociocratic organization, decisions are made by consent, not by majority vote.","translation":"ソシオクラシー組織では、意思決定は多数決ではなく、同意によって行われます。"}],"collocations":["implement Sociocracy (ソシオクラシーを導入する)","practice Sociocracy (ソシオクラシーを実践する)","Sociocratic organization (ソシオクラシー組織)","Sociocratic principles (ソシオクラシーの原則)","Sociocratic governance (ソシオクラシーによる統治)"],"synonyms":["dynamic governance","holacracy","participatory governance","self-management"],"antonyms":["autocracy","hierarchy","dictatorship"]}],"etymology":{"value":"「socio-」(社会) + 「-cracy」(統治) から。社会全体のニーズを考慮した統治を意味する。オランダの電気技師、ジェラルド・エンデブルグによって20世紀後半に開発された。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊsiˈɒkrəsi/","syllables":"so-ci-oc-ra-cy"},"inflection":{"noun_plural":"Sociocracies"},"usage_notes":{"explanation":"「**Sociocracy**」は、組織運営における特定のモデルを指す専門用語です。一般的な会話で頻繁に使われる単語ではありませんが、組織論、経営学、社会学などの分野では重要な概念です。関連語として「Holacracy（ホラクラシー）」がありますが、ソシオクラシーの方がより歴史が長く、組織構造や意思決定プロセスにおいていくつかの違いがあります。ソシオクラシーは、組織の規模や種類に関わらず適用可能であり、企業だけでなく、学校、非営利団体、地域コミュニティなどでも導入されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sociocracy is a type of democracy where everyone votes on everything.","correct":"✓ Sociocracy is a system where decisions are made by consent within self-organizing circles.","note":"ソシオクラシーは、全員がすべての事項について投票する直接民主制とは異なります。自己組織化されたサークル内で同意に基づいて意思決定が行われます。"},{"incorrect":"✗ Sociocracy means there is no leadership in the organization.","correct":"✓ Sociocracy distributes leadership roles among different circles, but there is still leadership.","note":"ソシオクラシーはリーダーシップを否定するものではなく、組織内の異なるサークルにリーダーシップの役割を分散させるものです。"},{"incorrect":"✗ Sociocracy is the same as anarchy.","correct":"✓ Sociocracy is a structured system of governance with clear roles and responsibilities.","note":"ソシオクラシーは無秩序なアナーキーとは異なり、明確な役割と責任を持つ構造化された統治システムです。"}],"priority":"★★☆"},"related_words":{"derivatives":["Sociocratic (形容詞: ソシオクラシーの)","Sociocrat (名詞: ソシオクラシーを実践する人)"],"phrases":["consent decision-making (同意による意思決定)","double linking (二重リンク)","circle organization (サークル組織)","feedback loops (フィードバックループ)","self-organizing teams (自己組織化チーム)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Sociocracy**」は、組織がどのように運営されるかを決める方法の一つです。組織のメンバーがみんなで話し合って、同意できることを決めるやり方です。組織を小さなグループ（サークル）に分けて、それぞれのグループで決めることを決めます。そして、グループ同士がつながって、組織全体でうまくいくようにします。リーダーが一人で決めるのではなく、みんなで決めるので、メンバーがもっと参加できると感じるかもしれません。しかし、ソシオクラシーをうまくやるには、時間と努力が必要です。"},"example_sentences":[{"sentence":"The school adopted **Sociocracy** to give teachers more control over curriculum decisions.","translation":"その学校は、教師にカリキュラムの決定に対するより多くの権限を与えるために、ソシオクラシーを採用しました。","type":"noun","meaning_category":"社会統治システム"},{"sentence":"In a **Sociocratic** organization, every member has a voice and is heard.","translation":"ソシオクラシー組織では、すべてのメンバーが発言権を持ち、意見を聞いてもらえます。","type":"adjective (Sociocratic)","meaning_category":"ソシオクラシーの"},{"sentence":"The consultant helped the company transition to a **Sociocratic** model.","translation":"コンサルタントは、会社がソシオクラシーモデルに移行するのを支援しました。","type":"adjective (Sociocratic)","meaning_category":"ソシオクラシーの"},{"sentence":"**Sociocracy** emphasizes continuous improvement through feedback and adaptation.","translation":"ソシオクラシーは、フィードバックと適応を通じて継続的な改善を重視します。","type":"noun","meaning_category":"社会統治システム"}]}