{"word":"food-dependent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"食物依存性の、食物依存的な","english_definition":"Relying on food for a particular function or purpose; exhibiting a dependence on food.","examples":[{"sentence":"The bacteria in the gut are food-dependent, requiring specific nutrients to thrive.","translation":"腸内の細菌は食物依存性であり、繁殖するためには特定の栄養素を必要とする。"},{"sentence":"Some metabolic processes are food-dependent, meaning they only occur when certain foods are consumed.","translation":"一部の代謝プロセスは食物依存性であり、特定の食品が摂取された場合にのみ発生することを意味する。"},{"sentence":"The study investigated food-dependent insulin secretion in patients with type 2 diabetes.","translation":"その研究では、2型糖尿病患者における食物依存性インスリン分泌が調査された。"}],"collocations":["food-dependent insulin secretion","food-dependent growth","food-dependent behavior","food-dependent allergy"],"synonyms":["nutrient-dependent","diet-dependent","nutrition-related","food-related"],"antonyms":["food-independent","nutrient-independent","diet-independent"]}],"etymology":{"value":"The term is formed by combining \"food\" with \"dependent,\" indicating a reliance or dependence on food for a particular function or characteristic.","priority":"N/A"},"pronunciation":{"ipa":"/fuːd dɪˈpɛndənt/","syllables":"food-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms are 'more food-dependent' and 'most food-dependent', respectively."},"usage_notes":{"explanation":"The term \"food-dependent\" is used to describe processes, organisms, or conditions that rely on food for their function, growth, or regulation. It is commonly used in scientific and medical contexts to describe physiological or biological phenomena that are influenced by food intake.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is food-dependent on sunlight.","correct":"✓ The plant is dependent on sunlight for food.","note":"\"Food-dependent\" typically refers to a direct reliance on food itself, not on other factors for food production. In this case, \"dependent on sunlight for food\" is more accurate."},{"incorrect":"✗ He is very food-dependent.","correct":"✓ He is dependent on food.","note":"While grammatically correct, \"He is very food-dependent\" is less common. It's more typical to say \"He is dependent on food\" or \"He has a food dependency\"."}],"priority":"N/A"},"related_words":{"derivatives":["food dependency (食物依存)","food dependence (食物依存)"],"related_terms":["nutrient-dependent","diet-related","food allergy","food intolerance","food sensitivity"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"food-dependent\" is a technical term used in scientific and medical contexts to describe something that relies on food for a specific function or characteristic. It is not a common term in everyday language and requires a good understanding of scientific vocabulary to comprehend its meaning fully. It often appears in research papers and medical reports related to nutrition, metabolism, and related fields."},"example_sentences":[{"sentence":"The growth of certain gut bacteria is food-dependent.","translation":"特定の腸内細菌の成長は食物依存性である。","type":"adjective","meaning_category":"食物依存性の"},{"sentence":"Food-dependent exercise-induced anaphylaxis is a rare allergic reaction.","translation":"食物依存性運動誘発アナフィラキシーはまれなアレルギー反応である。","type":"adjective","meaning_category":"食物依存性の"},{"sentence":"The enzyme's activity is food-dependent, increasing after a meal.","translation":"その酵素の活性は食物依存性であり、食後に増加する。","type":"adjective","meaning_category":"食物依存性の"}]}