{"word":"usuriously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"高利で、法外な利息で","english_definition":"In a manner characterized by the practice of lending money at unreasonably high interest rates; in a way that involves usury.","examples":[{"sentence":"The loan was offered usuriously, preying on the desperation of the borrower.","translation":"そのローンは高利で提供され、借り手の絶望につけ込んだ。"},{"sentence":"He invested his money usuriously, earning a large profit from those in need.","translation":"彼は高利で金を投資し、困窮している人々から大きな利益を得た。"}],"collocations":["lend usuriously","invest usuriously","profit usuriously"],"synonyms":["extortionately","exorbitantly","oppressively","unconscionably"],"antonyms":["fairly","equitably","reasonably"]}],"etymology":{"value":"Derived from the adjective 'usurious', which comes from 'usury'. 'Usury' originates from the Latin word 'usura', meaning 'interest' (originally any kind of interest, but later specifically excessive interest). The suffix '-ly' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈʒʊəriəsli/","syllables":"u-su-ri-ous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Usuriously' describes an action or practice related to charging excessively high interest rates on loans. It implies an unethical or exploitative manner of lending. This adverb is relatively rare in modern usage, often replaced by more common terms like 'extortionately' or phrases like 'at usurious rates'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted usuriously toward his friends.","correct":"✓ He acted unfairly toward his friends.","note":"'Usuriously' specifically relates to lending money at high interest rates, not general unfair behavior."},{"incorrect":"✗ The company grew usuriously.","correct":"✓ The company grew rapidly.","note":"'Usuriously' does not describe general growth, but rather profit gained through usury."}],"priority":"★★☆"},"related_words":{"derivatives":["usury (noun): the practice of lending money at unreasonably high interest rates.","usurious (adjective): characterized by usury; involving unreasonably high interest rates."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'usuriously' is a formal and relatively uncommon adverb. It describes actions related to charging extremely high and often illegal interest rates on loans. Understanding this word requires familiarity with the concept of 'usury' and its negative connotations of exploitation and unfair financial practices. Because of its specialized meaning and low frequency, it is more likely to be encountered in legal, historical, or financial contexts."},"example_sentences":[{"sentence":"The lender operated usuriously, trapping vulnerable families in cycles of debt.","translation":"その貸し手は高利で営業し、脆弱な家族を借金のサイクルに陥れた。","type":"adverb","meaning_category":"high interest rates"},{"sentence":"The investment scheme, though promising high returns, operated usuriously.","translation":"その投資計画は、高いリターンを約束していたものの、高利で運営されていた。","type":"adverb","meaning_category":"high interest rates"}]}