{"word":"venesection","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"瀉血（しゃけつ）","english_definition":"The surgical removal of blood from a vein; bloodletting.","examples":[{"sentence":"Venesection was a common medical practice in the past.","translation":"瀉血は過去には一般的な医療行為だった。"},{"sentence":"The doctor recommended venesection to reduce the patient's fever.","translation":"医師は患者の熱を下げるために瀉血を勧めた。"}],"collocations":["therapeutic venesection (治療的瀉血)"],"synonyms":["bloodletting","phlebotomy"],"antonyms":["blood transfusion"]},{"part_of_speech":"noun","definition":"静脈切開","english_definition":"The incision of a vein.","examples":[{"sentence":"Venesection involves the venipuncture or incision of a vein.","translation":"瀉血は静脈穿刺または静脈切開を伴う。"}],"collocations":[],"synonyms":["phlebotomy","venotomy"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Old French, from late Latin venae sectio, from Latin vena ‘vein’ + sectio ‘cutting’ (from secare ‘to cut’).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌviːnɪˈsɛkʃən/","syllables":"ve-ne-sec-tion"},"inflection":{"noun_plural":"venesections"},"usage_notes":{"explanation":"Venesection is an archaic medical procedure involving the withdrawal of blood from a patient to treat or prevent illness. It is also known as bloodletting or phlebotomy, although phlebotomy is now more commonly used to describe the drawing of blood for diagnostic testing. Venesection was based on an ancient belief that blood contained harmful substances that needed to be removed to restore health.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a venesection done on his artery.","correct":"✓ He had a venesection done on his vein.","note":"Venesection is performed on a vein, not an artery."}],"priority":"★☆☆"},"related_words":{"derivatives":["venisector"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Venesection' is a technical term referring to the historical medical practice of bloodletting. It is rarely used in modern contexts except when discussing the history of medicine. Understanding the term requires knowledge of medical history and terminology."},"example_sentences":[{"sentence":"In medieval times, venesection was a common treatment for a variety of ailments.","translation":"中世では、瀉血はさまざまな病気の一般的な治療法だった。","type":"noun","meaning_category":"medical practice"},{"sentence":"The historical practice of venesection is now considered outdated and often harmful.","translation":"瀉血の歴史的慣習は、現在では時代遅れで有害であると考えられている。","type":"noun","meaning_category":"historical practice"}]}