{"word":"pre-emptor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"先買権者、優先取得権者","english_definition":"A person who has the right to purchase something before others are given the opportunity.","examples":[{"sentence":"As a pre-emptor, he had the first chance to buy the property.","translation":"先買権者として、彼はその不動産を最初に購入する機会を得た。"},{"sentence":"The shareholders with pre-emptive rights acted as pre-emptors in the stock offering.","translation":"先買権を持つ株主は、株式公開において優先取得権者として行動した。"}],"collocations":["right of pre-emption","pre-emptive right","potential pre-emptor"],"synonyms":["first purchaser","priority buyer"],"antonyms":["secondary buyer","subsequent purchaser"]}],"etymology":{"value":"Derived from 'pre-empt,' which comes from the Latin 'prae-' (before) + 'emere' (to buy).","priority":"★★★"},"pronunciation":{"ipa":"/priːˈɛmptər/","syllables":"pre-emp-tor"},"inflection":{"noun_plural":"pre-emptors"},"usage_notes":{"explanation":"The term 'pre-emptor' is primarily used in legal and business contexts to denote someone who holds a pre-emptive right. This right allows them to purchase an asset or property before it is offered to others. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pre-emptor because he always buys things first.","correct":"✓ He has a pre-emptive right, so he is a pre-emptor.","note":"'Pre-emptor' specifically refers to someone with a legal or contractual right to buy something first, not just someone who habitually buys things quickly."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-empt (verb)","pre-emption (noun)","pre-emptive (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Pre-emptor' is a specialized term primarily used in legal and financial contexts. It refers to an individual who possesses a pre-emptive right, allowing them to purchase something before it is offered to others. Understanding this term requires familiarity with legal and business terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The original tenant was the pre-emptor for the apartment's purchase.","translation":"元のテナントはそのアパートの購入に対する先買権者だった。","type":"noun","meaning_category":"先買権者"},{"sentence":"As a designated pre-emptor, she received a notification about the sale.","translation":"指定された優先取得権者として、彼女は売却に関する通知を受け取った。","type":"noun","meaning_category":"優先取得権者"}]}