{"word":"Anathem","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(架空の)数学者、哲学者、科学者が修道院のようなコミュニティに住み、理性的な探求に専念する世界を描いたニール・スティーヴンスンの同名小説","english_definition":"A novel by Neal Stephenson depicting a world where mathematicians, philosophers, and scientists live in monastic communities dedicated to rational inquiry.","examples":[{"sentence":"Have you read Anathem by Neal Stephenson?","translation":"ニール・スティーヴンスンの『Anathem』を読みましたか？"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The word is a neologism coined by Neal Stephenson for his novel. It is derived from the Greek word 'anathema', meaning 'something accursed', but in the context of the novel, it refers to a mathematical statement or concept that is so profound or dangerous that it must be kept separate from the outside world.","priority":"★★★"},"pronunciation":{"ipa":"/ˈænəθɛm/","syllables":"A-na-them"},"inflection":{"noun_plural":"Anathems"},"usage_notes":{"explanation":"'Anathem' is primarily used as a proper noun to refer to the book itself. It can also be used to describe concepts or ideas related to the book's themes, such as the importance of rational inquiry, the relationship between science and society, and the nature of reality.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Anathema (呪い、破門)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"Difficult","text":"'Anathem' is a science fiction novel with complex themes and vocabulary. Understanding the book requires familiarity with philosophy, mathematics, and science. The word 'Anathem' itself is a neologism, making it difficult for non-readers to understand."},"example_sentences":[{"sentence":"The book Anathem explores the nature of reality and the role of intellectuals in society.","translation":"小説『Anathem』は、現実の本質と社会における知識人の役割を探求している。","type":"noun","meaning_category":"book title"},{"sentence":"The concept of 'Anathem' in the book is a metaphor for the protection of knowledge.","translation":"小説における「Anathem」という概念は、知識の保護のメタファーである。","type":"noun","meaning_category":"concept"}]}