{"word":"undeservingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ふさわしくなく、値しないのに、不当に","english_definition":"in a way that is not deserved; without deserving something.","examples":[{"sentence":"He was undeservingly promoted.","translation":"彼はふさわしくないのに昇進した。"},{"sentence":"She was undeservingly criticized for something she didn't do.","translation":"彼女は身に覚えのないことで不当に批判された。"},{"sentence":"The team won undeservingly due to a referee error.","translation":"そのチームは審判の誤審により不当に勝利した。"}],"collocations":["undeservingly rewarded","undeservingly punished","undeservingly praised","undeservingly criticized"],"synonyms":["unjustly","unfairly","unrightfully","inappropriately","unwarrantedly"],"antonyms":["deservedly","justly","fairly","appropriately","rightfully"]}],"etymology":{"value":"undeserving + -ly","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈzɜːrvɪŋli/","syllables":"un-de-serv-ing-ly"},"inflection":{"notes":"adverb, no inflection"},"usage_notes":{"explanation":"'Undeservingly' is used to describe actions or situations where someone receives something (positive or negative) that they do not merit or deserve. It implies a sense of injustice or unfairness. It is often used to express that someone has been treated either better or worse than they should have been, based on their actions, qualities, or circumstances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was undeservingly of the award.","correct":"✓ He received the award undeservingly.","note":"'Undeservingly' is an adverb, so it modifies a verb, adjective, or another adverb. It does not follow a linking verb like 'was' to describe a subject. Instead, use it to modify the action of receiving something."},{"incorrect":"✗ She was undeserving criticized.","correct":"✓ She was undeservingly criticized.","note":"'Undeserving' is an adjective meaning 'not deserving'. 'Undeservingly' is the adverb form that modifies the verb 'criticized'."}],"priority":"★☆☆"},"related_words":{"derivatives":["undeserving (adjective): not deserving","deserve (verb): to merit, be worthy of","deservedly (adverb): in a deserved manner"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undeservingly' is an adverb that means something happened in a way that was not deserved. It's used to describe situations where someone gets something (good or bad) that they didn't earn or merit. Because it's a more complex word dealing with abstract concepts of fairness and desert, it's less common in everyday language and more often found in formal writing or discussions about justice and ethics."},"example_sentences":[{"sentence":"The company was undeservingly praised for its supposed environmental efforts, which were largely just public relations.","translation":"その会社は、その環境への取り組みとされていたものが、ほとんどが広報活動に過ぎなかったにもかかわらず、不当に称賛された。","type":"adverb","meaning_category":"unjustly praised"},{"sentence":"He won the lottery undeservingly, while others who needed the money more had no luck.","translation":"彼はお金をもっと必要としている人が運に見放される一方で、不当に宝くじに当たった。","type":"adverb","meaning_category":"unjustly fortunate"},{"sentence":"The actor was undeservingly nominated for an award, likely due to his family connections rather than his talent.","translation":"その俳優は、才能ではなく家族のコネのおかげで、不当に賞にノミネートされた。","type":"adverb","meaning_category":"unjustly recognized"}]}