{"word":"tractility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"延性、展性（特に金属の）","english_definition":"The property of a material that allows it to be drawn into a wire or elongated without breaking.","examples":[{"sentence":"Gold is known for its high tractility, allowing it to be drawn into very fine wires.","translation":"金は高い延性で知られており、非常に細いワイヤーに引き伸ばすことができます。"},{"sentence":"The tractility of copper makes it suitable for electrical wiring.","translation":"銅の延性により、電気配線に適しています。"}],"collocations":["high tractility","good tractility","exhibit tractility","measure tractility"],"synonyms":["ductility","malleability","extensibility","pliability"],"antonyms":["brittleness","rigidity","fragility"]}],"etymology":{"value":"Derived from the Latin word 'tractilis,' meaning 'that may be drawn out,' from 'trahere' (to draw, pull).","priority":"★★☆"},"pronunciation":{"ipa":"/trækˈtɪləti/","syllables":"trac-til-i-ty"},"inflection":{"noun_plural":"tractilities"},"usage_notes":{"explanation":"'Tractility' refers specifically to the ability of a material to be stretched into a wire without fracturing. It is often used in the context of metals. While similar to 'malleability' (the ability to be hammered or pressed into thin sheets), 'tractility' focuses on the ability to be drawn or stretched.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tractility of the ceramic made it easy to shape.","correct":"✓ The plasticity of the ceramic made it easy to shape.","note":"Ceramics are generally not known for tractility. 'Plasticity' is a more appropriate term for materials that can be molded. Tractility is usually associated with metals."},{"incorrect":"✗ The tractility of the metal caused it to shatter.","correct":"✓ The brittleness of the metal caused it to shatter.","note":"Tractility is the opposite of brittleness. A material with high tractility will not shatter easily."}],"priority":"★★☆"},"related_words":{"derivatives":["tractile (adjective: capable of being drawn out)"],"related_scientific_terms":["malleability","ductility","tensile strength","elasticity"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A technical term used in materials science and engineering.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tractility' is a specialized term used in materials science to describe a material's ability to be stretched into a wire without breaking. It is a key property for metals used in electrical wiring and other applications where materials need to withstand tensile forces. It's important to distinguish it from 'malleability,' which refers to the ability to be hammered into thin sheets.","priority":"★★☆"},"example_sentences":[{"sentence":"The high tractility of the alloy allowed it to be formed into intricate shapes.","translation":"合金の高い延性により、複雑な形状に成形することができました。","type":"general"},{"sentence":"Engineers consider the tractility of metals when designing cables and wires.","translation":"エンジニアは、ケーブルやワイヤーを設計する際に金属の延性を考慮します。","type":"technical"},{"sentence":"The experiment measured the tractility of the new composite material.","translation":"実験では、新しい複合材料の延性を測定しました。","type":"scientific"}]}