{"word":"hypoglycemia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"低血糖症","english_definition":"A condition in which the level of glucose (sugar) in the blood is lower than normal.","examples":[{"sentence":"Hypoglycemia can cause shakiness, dizziness, and confusion.","translation":"低血糖症は震え、めまい、混乱を引き起こす可能性があります。"},{"sentence":"People with diabetes need to be aware of the symptoms of hypoglycemia.","translation":"糖尿病患者は低血糖症の症状に注意する必要があります。"},{"sentence":"Eating regularly can help prevent hypoglycemia.","translation":"定期的に食事をすることで、低血糖症を予防できます。"}],"collocations":["severe hypoglycemia (重度の低血糖症)","reactive hypoglycemia (反応性低血糖症)","hypoglycemia symptoms (低血糖症の症状)","hypoglycemia treatment (低血糖症の治療)","experience hypoglycemia (低血糖症を経験する)","manage hypoglycemia (低血糖症を管理する)","prevent hypoglycemia (低血糖症を予防する)"],"synonyms":["low blood sugar","insulin shock (severe cases)"],"antonyms":["hyperglycemia (高血糖症)"],"related_conditions":["diabetes","insulinoma","adrenal insufficiency"]}],"etymology":{"value":"From the Greek words 'hypo' (under, below), 'glyc' (sweet, sugar), and 'emia' (blood condition). Literally, 'low sugar in the blood'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpoʊɡlaɪˈsiːmiə/","syllables":"hy·po·gly·ce·mi·a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypoglycemia is a medical condition characterized by abnormally low levels of glucose in the blood. It is often associated with diabetes, particularly in individuals taking insulin or certain oral medications. However, it can also occur in people without diabetes due to various factors, such as certain medical conditions, medications, or lifestyle factors. Symptoms can range from mild (e.g., shakiness, sweating, hunger) to severe (e.g., confusion, seizures, loss of consciousness). Prompt treatment, usually involving consuming a source of glucose, is essential to prevent serious complications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have hypoglycemia, so I eat a lot of sugar.","correct":"✓ I have hypoglycemia, so I need to have a source of sugar available in case my blood sugar gets too low.","note":"While people with hypoglycemia may need to consume sugar to raise their blood sugar levels during an episode, eating a lot of sugar regularly is not a recommended strategy for managing the condition. It's important to consult with a healthcare professional for appropriate management strategies."},{"incorrect":"✗ Hypoglycemia is the same as diabetes.","correct":"✓ Hypoglycemia is a condition of low blood sugar, while diabetes is a condition of high blood sugar.","note":"Hypoglycemia and diabetes are related but distinct conditions. Hypoglycemia is characterized by low blood sugar, while diabetes is characterized by high blood sugar. People with diabetes are at risk of both hypoglycemia (due to medication or other factors) and hyperglycemia (due to insufficient insulin or other factors)."}],"priority":"★★☆"},"related_words":{"derivatives":["hypoglycemic (adjective: relating to or suffering from hypoglycemia)"],"related_terms":["glucose","insulin","diabetes","hyperglycemia","blood sugar","glucometer","insulin shock"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypoglycemia' is a medical term referring to a condition where blood sugar levels are abnormally low. It's crucial for individuals with diabetes, those on specific medications, or those with particular health issues to understand this term. While it's not a common term in everyday conversation, it's frequently used in medical contexts, such as doctor's appointments, medical literature, and health-related discussions. Understanding the causes, symptoms, and treatments of hypoglycemia is essential for managing the condition effectively."},"example_sentences":[{"sentence":"She felt dizzy and weak, likely due to **hypoglycemia**.","translation":"彼女はめまいと脱力感を感じ、おそらく低血糖症が原因だった。","type":"noun","meaning_category":"medical condition"},{"sentence":"The doctor warned him about the risk of **hypoglycemia** if he skipped meals while taking insulin.","translation":"医師は、インスリン投与中に食事を抜くと低血糖症のリスクがあると警告した。","type":"noun","meaning_category":"medical condition"},{"sentence":"To treat the **hypoglycemia**, he quickly drank a glass of juice.","translation":"低血糖症を治療するために、彼はすぐにジュースを一杯飲んだ。","type":"noun","meaning_category":"medical condition"}]}