{"word":"teachy","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"教訓的な、説教臭い","english_definition":"Inclined to teach or lecture others, often in a way that is annoying or condescending; didactic.","examples":[{"sentence":"His teachy tone made it difficult to listen to his advice.","translation":"彼の説教臭い口調のせいで、彼の助言を聞き入れるのが難しかった。"},{"sentence":"The novel's teachy passages detracted from the overall story.","translation":"その小説の教訓的な箇所が、物語全体の魅力を損ねていた。"}],"collocations":["teachy tone","teachy attitude","teachy manner","teachy passages","teachy moments"],"synonyms":["didactic","preachy","moralizing","lecturing","pedantic","pontificating"],"antonyms":["unassuming","modest","humble","submissive","unopinionated"]}],"etymology":{"value":"Derived from the verb 'teach' with the addition of the suffix '-y'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtiːtʃi/","syllables":"teach-y"},"inflection":{"notes":"Comparative and superlative forms (more teachy, most teachy) are possible, but less common."},"usage_notes":{"explanation":"'Teachy' is generally used in a negative context to describe someone who is overly fond of giving advice or instructions, often in a way that is perceived as annoying or superior. It implies a condescending or patronizing attitude. The word is relatively informal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a teachy teacher.","correct":"✓ She is a didactic teacher.","note":"While 'teachy' can be used to describe a teacher, it often carries a negative connotation. 'Didactic' is a more neutral term for a teacher who focuses on instruction and conveying information."}],"priority":"★★☆"},"related_words":{"derivatives":["teach","teacher","teaching"],"related_terms":["didactic","pedantic","preachy"]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Teachy' is a relatively uncommon word used to describe someone who is overly inclined to teach or lecture others, often in a way that is annoying or condescending. It is typically used in informal contexts to express disapproval of someone's lecturing or moralizing behavior. The word implies that the person is being pedantic or preachy. It is important to note the negative connotation when using this word."},"example_sentences":[{"sentence":"I don't like it when he gets all teachy with me; I know what I'm doing.","translation":"彼が私に説教臭くなると嫌だ。私は自分が何をしているか分かっている。","type":"adjective","meaning_category":"説教臭い"},{"sentence":"The movie had some teachy scenes that felt forced and unnatural.","translation":"その映画には、わざとらしくて不自然な教訓的なシーンがいくつかあった。","type":"adjective","meaning_category":"教訓的な"}]}