{"word":"basilisk","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"バジリスク：伝説上の蛇、またはトカゲで、その視線や息で死をもたらすとされる。","english_definition":"A legendary reptile reputed to be king of serpents and said to be capable of causing death with a single glance.","examples":[{"sentence":"The basilisk is a mythical creature often depicted in fantasy literature.","translation":"バジリスクは、ファンタジー文学によく描かれる神話上の生き物です。"},{"sentence":"According to legend, the basilisk hatches from a rooster's egg incubated by a toad.","translation":"伝説によれば、バジリスクはヒキガエルが抱いた雄鶏の卵から孵化するとされています。"}],"collocations":["basilisk's gaze (バジリスクの視線)","basilisk venom (バジリスクの毒)","mythical basilisk (神話上のバジリスク)"],"synonyms":["cockatrice","serpent king"],"antonyms":[]},{"part_of_speech":"noun","definition":"バシリスク属：イグアナ科のトカゲの一種で、水面を走ることができる。","english_definition":"A lizard of the genus Basiliscus, in the family Iguanidae, that is known for its ability to run on water.","examples":[{"sentence":"The plumed basilisk is a colorful lizard found in Central and South America.","translation":"グリーンバシリスクは、中南米に生息するカラフルなトカゲです。"},{"sentence":"Basilisks are also known as Jesus Christ lizards because of their ability to run across water.","translation":"バシリスクは、水面を走る能力から、ジーザス・クライスト・リザードとしても知られています。"}],"collocations":["plumed basilisk (グリーンバシリスク)","Jesus Christ lizard (ジーザス・クライスト・リザード)","basilisk lizard (バシリスク)"],"synonyms":["Jesus Christ lizard"],"antonyms":[]}],"etymology":{"value":"古代ギリシャ語の「basiliskos」（小さな王）に由来し、ラテン語の「basiliscus」を経て英語に入った。プリニウスの博物誌に記述された、王冠のような模様を持つ蛇に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæzɪlɪsk/","syllables":"bas-i-lisk"},"inflection":{"noun_plural":"basilisks"},"usage_notes":{"explanation":"「**basilisk**」は、主に2つの意味で使用されます。1つ目は、伝説上の生物であり、その視線や息で死をもたらすとされる蛇またはトカゲです。ファンタジー作品などでよく登場します。2つ目は、イグアナ科のトカゲの一種で、特に水面を走る能力で知られています。このトカゲは「ジーザス・クライスト・リザード」とも呼ばれます。文脈によってどちらの意味で使用されているか判断する必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a basilisk running in the forest, it was so scary!","correct":"✓ I saw a snake in the forest, it was so scary!","note":"バジリスクは伝説上の生き物なので、実際に森で見かけることはありません。蛇を見間違えた可能性があります。"},{"incorrect":"✗ The basilisk is a type of bird.","correct":"✓ The basilisk is a type of lizard or serpent.","note":"バジリスクは鳥ではなく、トカゲまたは蛇の一種です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (伝説上の生物としての意味)、C1 (生物学的な意味)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**basilisk**」は、主に2つの意味を持つ単語です。1つは、伝説上の生物で、一目見ただけで人を殺す力を持つとされる蛇やトカゲを指します。ファンタジー小説やゲームに登場することがあります。もう1つは、実際に存在するトカゲの一種で、水面を走ることができることで知られています。このトカゲは「ジーザス・クライスト・リザード」とも呼ばれます。どちらの意味で使われているかは、文脈によって判断する必要があります。専門的な単語なので、日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"In the Harry Potter series, the basilisk is a deadly serpent controlled by Salazar Slytherin.","translation":"ハリー・ポッターシリーズでは、バジリスクはサラザール・スリザリンによって操られる致命的な蛇です。","type":"noun","meaning_category":"伝説上の生物"},{"sentence":"The basilisk lizard's ability to run on water is an amazing adaptation.","translation":"バジリスクのトカゲが水面を走る能力は、驚くべき適応です。","type":"noun","meaning_category":"トカゲ"}]}