{"word":"plottingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"陰謀を企てているように、策略的に","english_definition":"In a manner that suggests scheming or plotting; with a devious or manipulative intent.","examples":[{"sentence":"He smiled plottingly, hinting at a surprise he had planned.","translation":"彼は策略的に微笑み、計画していたサプライズを示唆した。"},{"sentence":"She looked at him plottingly, considering her next move in the game.","translation":"彼女は策略的に彼を見て、ゲームでの次の動きを考えていた。"},{"sentence":"The villain rubbed his hands plottingly, anticipating his triumph.","translation":"悪役は勝利を予想して、策略的に手をこすり合わせた。"}],"collocations":["smile plottingly","look plottingly","rub hands plottingly","speak plottingly"],"synonyms":["schemingly","deviously","conspiratorially","calculatingly","manipulatively","craftily","slyly"],"antonyms":["honestly","openly","candidly","sincerely","naively"]}],"etymology":{"value":"The word 'plottingly' is derived from the verb 'plot,' which means to plan something, especially something illegal or harmful. The suffix '-ing' turns it into a present participle or gerund, and '-ly' transforms it into an adverb, indicating the manner in which an action is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplɒtɪŋli/","syllables":"plot-ting-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Plottingly' is used to describe actions or behaviors that suggest someone is secretly planning something, often with negative or manipulative intentions. It implies a sense of deception, strategy, and hidden motives. The adverb is not commonly used in everyday conversation and is more frequently found in literature or descriptive writing to create a specific atmosphere or to characterize a person's behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He plottingly the garden.","correct":"✓ He planned plottingly.","note":"'Plottingly' is an adverb and should not be used as a verb. It modifies a verb, adjective, or another adverb to describe how an action is performed."},{"incorrect":"✗ She gave a plottingly look.","correct":"✓ She gave a plotting look. / ✓ She looked plottingly.","note":"'Plotting' can be used as an adjective to describe a noun (plotting look), or 'plottingly' can be used as an adverb to describe how someone looks (looked plottingly)."}],"priority":"★☆☆"},"related_words":{"derivatives":["plot (noun, verb)","plotter (noun)","plotting (adjective, noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'plottingly' is an adverb that describes an action done in a way that suggests someone is making secret plans, often for something bad or dishonest. It's not a common word and is usually found in more formal writing or when trying to create a specific image of someone who is scheming or manipulative. Because it's not frequently used, it's considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The spy smiled plottingly as he slipped the secret document into his pocket.","translation":"スパイは秘密文書をポケットに滑り込ませながら、策略的に微笑んだ。","type":"adverb","meaning_category":"陰謀を企てているように"},{"sentence":"She watched him plottingly, trying to guess his true intentions.","translation":"彼女は彼の本当の意図を推測しようと、策略的に彼を見つめた。","type":"adverb","meaning_category":"策略的に"},{"sentence":"The politician spoke plottingly, promising changes that he had no intention of making.","translation":"政治家は、実行するつもりもない変化を約束しながら、策略的に話した。","type":"adverb","meaning_category":"陰謀を企てているように"}]}