{"word":"USAUNCES","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Archaic spelling of USANCES. Plural form of USANCE, referring to customs, practices, or established ways of doing things, particularly in a specific place or community.","english_definition":"Archaic plural of USANCE, referring to customs or practices.","examples":[{"sentence":"The document detailed the usaunces of the local merchants.","translation":"その文書は地元の商人の慣習を詳述していた。"}],"collocations":[],"synonyms":["customs","practices","traditions","usages"],"antonyms":[]}],"etymology":{"value":"Derived from the archaic plural form of 'usance,' which itself comes from the Old French 'usage,' and ultimately from the Latin 'usus' (use).","priority":"N/A"},"pronunciation":{"ipa":"/ˈjuːzənsɪz/","syllables":"U-saun-ces"},"inflection":{"noun_plural":"USAUNCES is already a plural form."},"usage_notes":{"explanation":"The term 'usaunces' is rarely used in modern English. It is an archaic form of 'usances' and is primarily encountered in historical texts. It refers to established customs, practices, or ways of doing things, especially within a particular community or trade. The singular form 'usance' is also uncommon but may be encountered in historical or legal contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The usaunce were different.","correct":"The usaunces were different.","note":"Since 'usaunces' is already plural, the verb should agree with a plural subject."}],"priority":"N/A"},"related_words":{"derivatives":["usance","usage"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency in modern usage.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'usaunces' is highly archaic and not commonly used in modern English. Understanding it requires familiarity with historical texts and legal terminology. It is related to the more common word 'usage' but specifically refers to established customs or practices."},"example_sentences":[{"sentence":"Historical records often mention the peculiar usaunces of various guilds.","translation":"歴史的記録には、しばしば様々なギルドの独特な慣習が記述されている。","type":"noun","meaning_category":"customs"}]}