{"word":"dolomitize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ドロマイト化する、ドロマイトに変化させる","english_definition":"To convert (limestone or other calcium carbonate rocks) into dolomite by the introduction of magnesium.","examples":[{"sentence":"The limestone was dolomitized by magnesium-rich fluids.","translation":"その石灰岩は、マグネシウムに富む流体によってドロマイト化された。"},{"sentence":"The process of dolomitizing limestone can take millions of years.","translation":"石灰岩をドロマイト化するプロセスには、数百万年かかることがある。"}],"collocations":["dolomitize limestone (石灰岩をドロマイト化する)","dolomitize a rock (岩石をドロマイト化する)"],"synonyms":["magnesify","convert to dolomite"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vi","definition":"ドロマイト化する、ドロマイトに変化する","english_definition":"To become dolomite; to undergo dolomitization.","examples":[{"sentence":"The rock began to dolomitize as it was exposed to the magnesium-rich seawater.","translation":"その岩石は、マグネシウムに富む海水にさらされるにつれてドロマイト化し始めた。"},{"sentence":"Some limestones dolomitize more readily than others.","translation":"石灰岩の中には、他のものよりも容易にドロマイト化するものがある。"}],"collocations":["dolomitize readily (容易にドロマイト化する)","dolomitize slowly (ゆっくりとドロマイト化する)"],"synonyms":["undergo dolomitization","become dolomite"],"antonyms":[]}],"etymology":{"value":"From 'dolomite' (named after French mineralogist Déodat Gratet de Dolomieu) + '-ize' (suffix indicating a process or transformation).","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈlɑməˌtaɪz/","syllables":"do-lo-ma-tize"},"inflection":{"verb_forms":{"present_simple":["dolomitize","dolomitizes"],"past_simple":"dolomitized","past_participle":"dolomitized","present_participle":"dolomitizing"}},"usage_notes":{"explanation":"'Dolomitize' refers specifically to the geological process of converting calcium carbonate rocks, such as limestone, into dolomite, a calcium magnesium carbonate rock. This process typically involves the introduction of magnesium into the rock's mineral structure. The term is primarily used in geology and related earth sciences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geologist dolomitized the mountain.","correct":"✓ The geologist studied the dolomitization of the mountain.","note":"'Dolomitize' is a process, not an action that can be directly performed on a large geological feature like a mountain. The geologist studies the process, rather than performing it manually."},{"incorrect":"✗ The rock was dolomited.","correct":"✓ The rock was dolomitized.","note":"The correct past participle form is 'dolomitized', not 'dolomited'."}],"priority":"★★☆"},"related_words":{"derivatives":["dolomitization (noun: the process of becoming dolomite)","dolomitic (adjective: relating to or containing dolomite)","dolomite (noun: a calcium magnesium carbonate mineral)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dolomitize' is a specialized term used in geology to describe the process by which limestone or other calcium carbonate rocks are converted into dolomite through the introduction of magnesium. This term is typically encountered in advanced geological texts and discussions related to sedimentary rock formation and mineral alteration. Understanding the term requires familiarity with basic geological concepts and mineral composition.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient coral reefs were largely dolomitized during the Jurassic period.","translation":"古代のサンゴ礁は、ジュラ紀に大部分がドロマイト化された。","type":"verb (vi)","meaning_category":"ドロマイト化する"},{"sentence":"Fluid flow through the fractures helped to dolomitize the surrounding rock.","translation":"断層を通る流体の流れは、周囲の岩石をドロマイト化するのに役立った。","type":"verb (vt)","meaning_category":"ドロマイト化する"}]}