{"word":"dichroscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"二色鏡","english_definition":"An optical instrument used to observe pleochroism in gemstones or other anisotropic materials. It consists of a calcite rhomboid that produces double refraction, allowing the observer to view two images of the material under examination, each polarized in a perpendicular direction. The difference in color or absorption of these two images indicates the presence and strength of pleochroism.","examples":[{"sentence":"The gemologist used a dichroscope to identify the gemstone.","translation":"宝石学者は二色鏡を使って宝石を鑑定した。"},{"sentence":"By observing the colors through the dichroscope, he could determine the stone's pleochroism.","translation":"二色鏡を通して色を観察することで、彼はその石の多色性を判断できた。"}],"collocations":["use a dichroscope","observe with a dichroscope","examine with a dichroscope","gem dichroscope","calcite dichroscope"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'dichro-' (meaning 'two-colored') + '-scope' (instrument for viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaɪkroʊskoʊp/","syllables":"di-chro-scope"},"inflection":{"noun_plural":"dichroscopes"},"usage_notes":{"explanation":"A dichroscope is primarily used in gemology to identify gemstones by observing their pleochroism, which is the property of a substance exhibiting different colors when viewed from different directions. The instrument splits a ray of light into two rays vibrating in perpendicular planes. These rays then pass through the gemstone, and the observer sees two images side-by-side, each corresponding to one of the polarized rays. If the gemstone is pleochroic, the two images will show different colors or shades. If the gemstone is not pleochroic, the two images will appear identical.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the dichroscope to see the color of the gem.","correct":"✓ I used the dichroscope to see the pleochroism of the gem.","note":"A dichroscope doesn't just show the color; it shows the different colors (pleochroism) exhibited by the gem when viewed from different angles. The instrument is used to observe pleochroism, not just color. Pleochroism is the phenomenon of showing different colors in different directions."}],"priority":"★☆☆"},"related_words":{"derivatives":["dichroism (noun: the property of exhibiting different colors in different directions)","pleochroism (noun: the property of exhibiting different colors in different directions, a more general term)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **dichroscope** is a specialized tool used by gemologists to identify gemstones. It works by showing how a gem's color changes when viewed from different angles, a property known as pleochroism. If you look through a dichroscope at a gem, you'll see two images side-by-side. If the gem is pleochroic, these images will have different colors. This helps experts figure out what kind of gem it is. It's not something you'd use every day, but it's important for people who study or sell gems."},"example_sentences":[{"sentence":"The jeweler used a **dichroscope** to confirm the authenticity of the tourmaline.","translation":"宝石商はトルマリンの真正性を確認するために二色鏡を使った。","type":"noun","meaning_category":"instrument"},{"sentence":"Through the **dichroscope**, the alexandrite showed a distinct color change from green to red.","translation":"二色鏡を通して、アレキサンドライトは緑から赤への明確な色の変化を示した。","type":"noun","meaning_category":"observation"}]}