{"word":"stannic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"スズの、スズを含む","english_definition":"Of or containing tin, especially in its higher valence state.","examples":[{"sentence":"Stannic chloride is used in various industrial processes.","translation":"塩化スズは様々な工業プロセスで使用されます。"},{"sentence":"The stannic oxide coating protects the metal from corrosion.","translation":"酸化スズのコーティングは金属を腐食から保護します。"}],"collocations":["stannic chloride","stannic oxide"],"synonyms":["tin","tin-containing"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'stannum' meaning tin, plus the suffix '-ic' indicating a higher valence state.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstænɪk/","syllables":"stan-nic"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Stannic' typically refers to tin in its +4 oxidation state. This is in contrast to 'stannous', which refers to tin in its +2 oxidation state. The terms are often used in chemistry to distinguish between different compounds of tin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stannous acid is more corrosive than stannic.","correct":"✓ The stannic acid is more corrosive than stannous.","note":"Stannic compounds generally refer to tin in the +4 oxidation state, while stannous refers to the +2 state. Using the wrong term can change the meaning significantly."}],"priority":"★★☆"},"related_words":{"derivatives":["stannous","stannate","tin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stannic' is a technical term primarily used in chemistry and materials science. It refers specifically to compounds containing tin in its higher oxidation state (+4). Understanding this term requires a background in chemistry, particularly knowledge of oxidation states and chemical nomenclature. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The properties of stannic oxide make it suitable for use as a transparent conductive oxide.","translation":"酸化スズの特性により、透明導電性酸化物としての使用に適しています。","type":"adjective","meaning_category":"スズの、スズを含む"},{"sentence":"Stannic chloride is a Lewis acid catalyst.","translation":"塩化スズはルイス酸触媒です。","type":"adjective","meaning_category":"スズの、スズを含む"}]}