{"word":"phoroscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(眼科)屈折検査器、フォロプター","english_definition":"An instrument used during an eye examination to determine an individual's refractive error and optimal lens correction.","examples":[{"sentence":"The optometrist used a phoroscope to determine my prescription.","translation":"検眼医は私の処方を決定するためにフォロプターを使用しました。"},{"sentence":"The patient looked through the phoroscope while the doctor adjusted the lenses.","translation":"医師がレンズを調整している間、患者はフォロプターを覗き込んだ。"}],"collocations":["perform refraction with a phoroscope (フォロプターで屈折検査を行う)","adjust the lenses on a phoroscope (フォロプターのレンズを調整する)","look through a phoroscope (フォロプターを覗く)"],"synonyms":["refractor","optometer","lensometer"],"antonyms":[]}],"etymology":{"value":"The word \"phoroscope\" is derived from the Greek words \"phoro-\" (meaning \"bearing\" or \"carrying\") and \"-scope\" (meaning \"instrument for viewing\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrəˌskoʊp/","syllables":"pho-ro-scope"},"inflection":{"noun_plural":"phoroscopes"},"usage_notes":{"explanation":"A phoroscope, also known as a refractor or optometer, is a common tool used by optometrists and ophthalmologists during eye exams. It contains a variety of lenses that can be adjusted to measure a patient's refractive error (nearsightedness, farsightedness, astigmatism) and determine the best lens correction for clear vision.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the phoroscope to see the stars.","correct":"✓ I used a telescope to see the stars.","note":"A phoroscope is for eye exams, not for viewing distant objects like stars. A telescope is used for that purpose."}],"priority":"★☆☆"},"related_words":{"derivatives":["phorometry (名詞: 屈折検査)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"phoroscope\" is a specialized term used in the field of optometry and ophthalmology. It refers to the instrument used to determine a patient's refractive error during an eye exam. Understanding this term requires some familiarity with eye care and medical terminology."},"example_sentences":[{"sentence":"The doctor used the **phoroscope** to determine the best lens prescription for my vision.","translation":"医師は私の視力に最適なレンズ処方を決定するためにフォロプターを使用しました。","type":"noun","meaning_category":"instrument"},{"sentence":"The patient placed their chin on the rest and looked through the **phoroscope**.","translation":"患者は顎を台に置き、フォロプターを覗き込んだ。","type":"noun","meaning_category":"instrument"}]}