{"word":"amphibiontic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"両生生活の、水陸両生の","english_definition":"Living both on land and in water; amphibious.","examples":[{"sentence":"Amphibiontic creatures are fascinating due to their dual lifestyles.","translation":"両生生活をする生き物は、その二重の生活様式のために魅力的です。"},{"sentence":"The amphibiontic nature of frogs allows them to thrive in diverse environments.","translation":"カエルの両生生活的な性質は、彼らが多様な環境で繁栄することを可能にします。"}],"collocations":["amphibiontic animal","amphibiontic lifestyle","amphibiontic species"],"synonyms":["amphibious","aquatic","terrestrial"],"antonyms":["exclusively aquatic","exclusively terrestrial"]}],"etymology":{"value":"From the Greek word 'amphibios' (living a double life), combined with '-ontic' (relating to being).","priority":"★★☆"},"pronunciation":{"ipa":"/æmˌfɪbiˈɒntɪk/","syllables":"am-phib-i-on-tic"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"The term 'amphibiontic' is primarily used in scientific contexts to describe organisms that can live both in water and on land. It is often used interchangeably with 'amphibious,' though 'amphibious' is more common in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The amphibiontic car was able to drive underwater.","correct":"✓ The amphibious car was able to drive underwater.","note":"While 'amphibiontic' and 'amphibious' are similar, 'amphibious' is more commonly used to describe vehicles or equipment that can operate on both land and water."}],"priority":"★★☆"},"related_words":{"derivatives":["amphibian (noun: an amphibiontic animal)","amphibiously (adverb)"],"related_terms":["amphibious","aquatic","terrestrial"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'amphibiontic' is a technical term primarily used in biological and ecological contexts to describe organisms capable of living both on land and in water. While similar to 'amphibious,' it is less commonly used in everyday language. Understanding this term requires a familiarity with scientific vocabulary related to animal habitats and life cycles."},"example_sentences":[{"sentence":"Certain species of newts exhibit an amphibiontic behavior, spending part of their lives in aquatic environments and part on land.","translation":"ある種のイモリは両生生活的な行動を示し、生涯の一部を水生環境で、一部を陸上で過ごします。","type":"adjective","meaning_category":"Living both on land and in water"},{"sentence":"The amphibiontic adaptations of frogs include specialized skin for absorbing water and lungs for breathing air.","translation":"カエルの両生生活への適応には、水を吸収するための特殊な皮膚と、空気を呼吸するための肺が含まれます。","type":"adjective","meaning_category":"Living both on land and in water"}]}