{"word":"hyperchromatism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理学)過染色性、色素過多症","english_definition":"(pathology) excessive pigmentation or staining; an abnormal increase in the chromatin content of a cell.","examples":[{"sentence":"Hyperchromatism in cells can be indicative of malignancy.","translation":"細胞の過染色性は悪性腫瘍の兆候である可能性がある。"},{"sentence":"The pathologist noted hyperchromatism in the tissue sample.","translation":"病理医は組織サンプルにおける過染色性を指摘した。"}],"collocations":["cellular hyperchromatism (細胞性過染色性)","nuclear hyperchromatism (核過染色性)","tissue hyperchromatism (組織過染色性)"],"synonyms":["hyperchromia","overstaining"],"antonyms":["hypochromatism"],"related_terms":["chromatin","pigmentation","staining","malignancy","histology","pathology"]}],"etymology":{"value":"Derived from the Greek words 'hyper' (over, above) + 'chroma' (color) + '-ism' (condition, process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈkroʊmətɪzəm/","syllables":"hy·per·chro·ma·tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyperchromatism refers to the condition where cells or tissues exhibit excessive staining or pigmentation, often due to an increase in chromatin content. It is a significant finding in pathology, particularly in the diagnosis of cancer, as malignant cells often display hyperchromatism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The doctor diagnosed hyperchromatism as a simple infection.","correct":"The doctor considered hyperchromatism as a possible sign of malignancy.","note":"Hyperchromatism is usually associated with more serious conditions like cancer, not simple infections."}],"priority":"★☆☆"},"related_words":{"derivatives":["hyperchromatic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hyperchromatism' is a highly specialized term used in the fields of pathology and histology. It describes the condition where cells or tissues show an abnormal increase in staining or pigmentation, often due to increased chromatin content. This is a key diagnostic feature in identifying malignant cells. Understanding this term requires advanced knowledge of cell biology and medical terminology."},"example_sentences":[{"sentence":"The presence of hyperchromatism in the cervical cells raised concerns about potential dysplasia.","translation":"子宮頸部細胞における過染色性の存在は、潜在的な異形成についての懸念を引き起こした。","type":"general","meaning_category":"pathology"},{"sentence":"Nuclear hyperchromatism is a common characteristic of cancerous cells under microscopic examination.","translation":"核過染色性は、顕微鏡検査下の癌細胞の一般的な特徴である。","type":"technical","meaning_category":"pathology"}]}