{"word":"Underbuilding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"建物の基礎や構造を意図的に弱くすること。","english_definition":"The act of deliberately constructing a building with a weak foundation or structure.","examples":[{"sentence":"The investigation revealed widespread underbuilding in the construction project, leading to safety concerns.","translation":"調査の結果、その建設プロジェクトにおいて広範囲な手抜き工事が明らかになり、安全上の懸念につながった。"}],"collocations":["construction underbuilding","structural underbuilding"],"synonyms":["shoddy construction","faulty construction","substandard construction"],"antonyms":["sound construction","proper construction"]},{"part_of_speech":"noun","definition":"必要とされるよりも少ない建物を建設すること。","english_definition":"The act of building fewer buildings than are needed or planned for a particular area or purpose.","examples":[{"sentence":"The city's underbuilding of affordable housing has contributed to the current housing crisis.","translation":"その都市における手頃な価格の住宅の建設不足が、現在の住宅危機の一因となっている。"}],"collocations":["housing underbuilding","infrastructure underbuilding"],"synonyms":["insufficient building","inadequate construction"],"antonyms":["overbuilding","excessive construction"]}],"etymology":{"value":"The word \"underbuilding\" is formed by combining the prefix \"under-\" (meaning below, less than, or insufficient) with the word \"building.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈbɪldɪŋ/","syllables":"un-der-build-ing"},"inflection":{"noun_plural":"Underbuildings"},"usage_notes":{"explanation":"The term \"underbuilding\" can refer to either the poor quality of construction or the insufficient quantity of construction. The specific meaning depends on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underbuilding was obvious because the house looked very nice.","correct":"✓ The underbuilding was obvious because the house was collapsing.","note":"Underbuilding implies a problem with the construction, not a positive attribute."}],"priority":"★★☆"},"related_words":{"derivatives":["underbuilt (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underbuilding' refers to constructing a building with poor quality materials or techniques, or to not building enough structures to meet demand. It's a term used in construction, urban planning, and economics."},"example_sentences":[{"sentence":"The engineer discovered significant underbuilding in the bridge's support structure.","translation":"エンジニアは橋の支持構造に重大な手抜き工事があることを発見した。","type":"noun","meaning_category":"shoddy construction"},{"sentence":"Critics argue that the city's underbuilding of public transportation is hindering economic growth.","translation":"批評家たちは、その都市における公共交通機関の建設不足が経済成長を妨げていると主張している。","type":"noun","meaning_category":"insufficient building"}]}