{"word":"curtailedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"短縮されて、削減されて、切り詰められて","english_definition":"In a curtailed manner; shortened, reduced, or abridged.","examples":[{"sentence":"The speech was delivered curtailedly due to time constraints.","translation":"時間の制約のため、スピーチは短縮して行われた。"},{"sentence":"The project was funded curtailedly, leading to fewer resources.","translation":"プロジェクトへの資金提供が削減されたため、利用できる資源が少なくなった。"}],"collocations":["delivered curtailedly","funded curtailedly","executed curtailedly"],"synonyms":["briefly","abridgedly","condensedly","shortly","concisely"],"antonyms":["extensively","fully","completely","thoroughly"]}],"etymology":{"value":"Formed from the adjective 'curtailed' and the suffix '-ly'. 'Curtailed' comes from the verb 'curtail,' which originates from Middle English 'curteilen,' meaning 'to cut short,' ultimately derived from Latin 'curtus' meaning 'shortened.'","priority":"★★☆"},"pronunciation":{"ipa":"/kərˈteɪlɪdli/","syllables":"cur-tail-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Curtailedly' is an adverb that describes how something is done in a shortened or reduced manner. It is not a commonly used word, and its usage is generally limited to formal or technical contexts. It emphasizes that something has been deliberately made shorter or smaller than it would otherwise be.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The meeting was curtailedly of time.","correct":"✓ The meeting was curtailed due to lack of time.","note":"'Curtailedly' describes the manner in which something is done, not the reason for it. Use 'curtailed' as an adjective or rephrase the sentence to indicate the reason directly."},{"incorrect":"✗ He curtailedly spoke.","correct":"✓ He spoke curtailedly.","note":"The adverb 'curtailedly' should be placed directly before the verb it modifies to clearly indicate that the action was performed in a curtailed manner."}],"priority":"★☆☆"},"related_words":{"derivatives":["curtail (verb): to reduce in extent or quantity; impose a restriction on.","curtailment (noun): the act of curtailing; reduction.","curtailed (adjective): reduced or limited; cut short."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency - This word is rarely used in common speech or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Curtailedly' is an advanced adverb that means 'in a shortened or reduced manner.' It's not a common word, so you'll mostly find it in formal writing or technical discussions where precise language is important. If something is done 'curtailedly,' it means it was done in a way that was deliberately made shorter or smaller than usual. It's derived from the verb 'curtail,' which means to reduce or limit something."},"example_sentences":[{"sentence":"The budget was applied curtailedly to the project.","translation":"予算はプロジェクトに削減して適用された。","type":"adverb","meaning_category":"短縮されて"},{"sentence":"Due to the speaker's illness, the lecture was presented curtailedly.","translation":"講演者の病気のため、講義は短縮して発表された。","type":"adverb","meaning_category":"削減されて"}]}