{"word":"Ophthalmoplegia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"眼筋麻痺","english_definition":"Paralysis or weakness of the eye muscles.","examples":[{"sentence":"Ophthalmoplegia can result from various neurological conditions.","translation":"眼筋麻痺は様々な神経学的疾患から生じることがある。"},{"sentence":"Progressive external ophthalmoplegia is a rare mitochondrial disorder.","translation":"進行性外眼筋麻痺はまれなミトコンドリア病である。"}],"collocations":["external ophthalmoplegia","internal ophthalmoplegia","progressive external ophthalmoplegia"],"synonyms":["eye muscle paralysis"],"antonyms":[]}],"etymology":{"value":"From Greek ophthalmo- (eye) + plegia (paralysis).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒfθælməˈpliːdʒɪə/","syllables":"oph-thal-mo-ple-gi-a"},"inflection":{"noun_plural":"ophthalmoplegias"},"usage_notes":{"explanation":"Ophthalmoplegia refers to the paralysis or weakness affecting one or more of the extraocular muscles responsible for eye movement or the intraocular muscles responsible for pupillary constriction and accommodation. It can manifest in various forms, including external ophthalmoplegia (affecting muscles outside the eyeball), internal ophthalmoplegia (affecting muscles inside the eyeball), and total ophthalmoplegia (affecting all eye muscles). The condition can result from a wide range of causes, including neurological disorders, infections, trauma, and mitochondrial diseases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Opthalmoplegia is when your eyes move too much.","correct":"✓ Ophthalmoplegia is when your eye muscles are weak or paralyzed, limiting eye movement.","note":"Ophthalmoplegia is characterized by limited or absent eye movement, not excessive movement."}],"priority":"★★☆"},"related_words":{"derivatives":["ophthalmoplegic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ophthalmoplegia' is a medical term referring to paralysis or weakness of the eye muscles, leading to impaired eye movement. It is not a commonly used word outside of medical contexts. Understanding this term requires knowledge of medical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient presented with ophthalmoplegia and double vision.","translation":"患者は眼筋麻痺と複視を呈した。","type":"general","meaning_category":"symptom"},{"sentence":"Diagnosis of ophthalmoplegia requires a thorough neurological examination.","translation":"眼筋麻痺の診断には、徹底的な神経学的検査が必要である。","type":"diagnosis","meaning_category":"medical procedure"}]}