{"word":"enlightenedly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"啓発的に、開明的に、賢明に","english_definition":"In an enlightened manner; showing or having a rational, modern, and well-informed outlook.","examples":[{"sentence":"The company enlightenedly adopted a more sustainable business model.","translation":"その会社は啓発的に、より持続可能なビジネスモデルを採用した。"},{"sentence":"She enlightenedly supported policies that promoted equality and social justice.","translation":"彼女は開明的に、平等と社会正義を促進する政策を支持した。"},{"sentence":"He enlightenedly approached the problem with a willingness to consider all perspectives.","translation":"彼は賢明に、すべての視点を考慮する意欲を持って問題に取り組んだ。"}],"collocations":["act enlightenedly","decide enlightenedly","support enlightenedly","approach enlightenedly"],"synonyms":["wisely","intelligently","rationally","progressively","liberally","open-mindedly","humanely"],"antonyms":["ignorantly","narrow-mindedly","prejudicially","irrationally"]}],"etymology":{"value":"Derived from 'enlightened' + '-ly'. 'Enlightened' comes from the verb 'enlighten,' meaning to give someone greater knowledge and understanding about a subject or situation.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈlaɪtəndli/","syllables":"en-light-en-ed-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Enlightenedly' describes actions or decisions that are made with a clear understanding, rationality, and often a progressive or liberal viewpoint. It suggests an approach that is well-informed and considers the broader implications of a situation. The word is often used to praise actions that are seen as wise and forward-thinking.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted enlightenedly, but his actions were actually quite selfish.","correct":"✓ He claimed to act enlightenedly, but his actions were actually quite selfish.","note":"'Enlightenedly' implies genuine wisdom and understanding. If the actions are selfish, it contradicts the meaning of the word. It's better to say someone 'claimed' to act enlightenedly in such cases."},{"incorrect":"✗ The decision was enlightenedly, so everyone agreed.","correct":"✓ The decision was enlightened, so everyone agreed.","note":"'Enlightenedly' is an adverb, modifying a verb. To describe the decision itself, use the adjective 'enlightened' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["enlighten (verb)","enlightened (adjective)","enlightenment (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Enlightenedly' is an adverb that describes doing something in a way that shows you have a good understanding of things and are fair and reasonable. It's often used to describe decisions or actions that are wise, well-informed, and consider the needs of others. This word isn't used very often in everyday conversation, but you might find it in more formal writing or discussions about important social or political issues."},"example_sentences":[{"sentence":"The government enlightenedly reformed the education system to better serve the needs of all students.","translation":"政府は啓発的に、すべての生徒のニーズにより良く応えるために教育制度を改革した。","type":"general","meaning_category":"開明的に"},{"sentence":"She enlightenedly chose to invest in renewable energy sources.","translation":"彼女は賢明に、再生可能エネルギー源への投資を選んだ。","type":"general","meaning_category":"賢明に"},{"sentence":"The company enlightenedly implemented policies to promote diversity and inclusion.","translation":"その会社は啓発的に、多様性と包括性を促進するためのポリシーを実施した。","type":"business","meaning_category":"啓発的に"}]}