{"word":"publicity-minded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宣伝好きな、広報に関心のある、宣伝効果を意識した","english_definition":"having an awareness of and a desire for publicity; behaving in a way that is intended to attract public attention.","examples":[{"sentence":"The company is taking a more publicity-minded approach to marketing.","translation":"その会社は、マーケティングにおいて、より宣伝効果を意識したアプローチを取っている。"},{"sentence":"He is a publicity-minded politician who knows how to get his name in the news.","translation":"彼は、自分の名前をニュースに出す方法を知っている、宣伝好きな政治家だ。"},{"sentence":"The event was organized by a publicity-minded team.","translation":"そのイベントは、広報に関心のあるチームによって企画された。"}],"collocations":["publicity-minded approach","publicity-minded campaign","publicity-minded individual","publicity-minded strategy"],"synonyms":["image-conscious","promotion-oriented","media-savvy","attention-seeking"],"antonyms":["unassuming","low-profile","self-effacing","private"],"notes":["Often used to describe individuals, companies, or organizations that actively seek media coverage and public attention."]}],"etymology":{"value":"Combination of 'publicity' (the state of being known to the public) and 'minded' (having a specified disposition or attitude).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌpʌbˈlɪsɪti ˈmaɪndɪd/","syllables":"pub-lic-i-ty-mind-ed"},"inflection":{"notes":"Does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Publicity-minded' describes someone or something that is aware of the value of publicity and actively seeks it. It can sometimes carry a slightly negative connotation, suggesting that the person or organization is more interested in getting attention than in substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very publicity-mind.","correct":"✓ He is very publicity-minded.","note":"'Publicity-minded' is an adjective, so it needs the '-ed' ending."}],"priority":"☆☆☆"},"related_words":{"derivatives":["publicity (noun)","mind (noun)","minded (adjective suffix)"],"related_terms":["media attention","public relations","marketing","advertising"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a common word, but understandable in context.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'publicity-minded' is a compound adjective that describes someone or something focused on gaining public attention. It is not a very common word, so it is more likely to be encountered in formal writing or specialized contexts such as marketing or public relations. Understanding the individual components ('publicity' and 'minded') helps in deciphering its meaning."},"example_sentences":[{"sentence":"The politician's publicity-minded stunts often overshadowed his actual policies.","translation":"その政治家の宣伝目的のパフォーマンスは、しばしば彼の実際の政策を覆い隠した。","type":"general","meaning_category":"宣伝効果を意識した"},{"sentence":"The company adopted a publicity-minded approach to launch its new product.","translation":"その会社は新製品を発売するために、宣伝効果を意識したアプローチを採用した。","type":"general","meaning_category":"宣伝効果を意識した"},{"sentence":"She was a publicity-minded actress who always knew how to attract the cameras.","translation":"彼女は、常にカメラの注目を集める方法を知っている、宣伝好きな女優だった。","type":"general","meaning_category":"宣伝好きな"}]}