{"word":"Ladyism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性らしさの強調、女性特有の行動様式、女性らしさの模倣","english_definition":"The act, practice, or advocacy of behaving in a manner traditionally associated with women; the imitation or exaggeration of feminine traits.","examples":[{"sentence":"Her performance was criticized for its excessive ladyism, lacking authenticity.","translation":"彼女の演技は、過度な女性らしさの強調により、本物らしさが欠けていると批判された。"},{"sentence":"Some argue that 'ladyism' reinforces traditional gender roles and expectations.","translation":"『女性らしさの強調』は、伝統的なジェンダーの役割と期待を強化すると主張する人もいる。"},{"sentence":"The play explores the complexities of identity, including the performance of ladyism.","translation":"その劇は、女性らしさの演技を含め、アイデンティティの複雑さを探求している。"}],"collocations":["perform ladyism","excessive ladyism","critique of ladyism"],"synonyms":["femininity","femaleness","womanliness"],"antonyms":["masculinity","manliness"]}],"etymology":{"value":"'Lady' + '-ism' から派生。女性らしさや女性特有の行動様式を強調したり、模倣したりする行為や思想を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈleɪdiɪzəm/","syllables":"Lay-dee-i-zem"},"inflection":{"noun_plural":"Ladyisms"},"usage_notes":{"explanation":"'Ladyism' は、女性らしさを意識的に演じることや、女性特有の行動様式を強調することを指す言葉です。必ずしも肯定的な意味合いを持つとは限らず、過剰な女性らしさの強調が、かえってステレオタイプを強化するという批判的な意味合いで使われることもあります。ジェンダー論やフェミニズムの文脈で用いられることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed a lot of ladyism by helping others.","correct":"✓ She showed a lot of kindness and compassion by helping others.","note":"'Ladyism' は、単に親切な行為を指す言葉ではありません。女性らしさを強調する演技や行動様式を指します。"},{"incorrect":"✗ Ladyism is the same as feminism.","correct":"✓ Ladyism is a performance of femininity, while feminism is a movement for gender equality.","note":"'Ladyism' は女性らしさの演技であり、ジェンダー平等を求めるフェミニズムとは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["lady (名詞: 女性、淑女)","-ism (接尾辞: 主義、運動)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ladyism' は、女性らしさを意識的に演じることや、女性特有の行動様式を強調することを指す専門的な言葉です。ジェンダー論やフェミニズムの文脈で使われることが多く、過剰な女性らしさの強調がステレオタイプを強化するという批判的な意味合いで用いられることもあります。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The character's deliberate ladyism was a commentary on societal expectations of women.","translation":"そのキャラクターの意図的な女性らしさの演技は、女性に対する社会的な期待への批評だった。","type":"noun","meaning_category":"女性らしさの強調"},{"sentence":"Some critics argue that reality TV often promotes a narrow and stereotypical view of ladyism.","translation":"批評家の中には、リアリティ番組が狭くてステレオタイプな女性らしさの強調を助長していると主張する人もいる。","type":"noun","meaning_category":"女性特有の行動様式"},{"sentence":"The artist explored the concept of ladyism through her performance art, challenging traditional notions of femininity.","translation":"そのアーティストは、パフォーマンスアートを通して女性らしさの概念を探求し、伝統的な女性らしさの概念に挑戦した。","type":"noun","meaning_category":"女性らしさの模倣"}]}