{"word":"stomatologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"口腔科医、口腔外科医","english_definition":"a dentist specializing in the treatment of diseases of the mouth.","examples":[{"sentence":"The patient was referred to a stomatologist for further evaluation of the oral lesion.","translation":"患者は口腔病変のさらなる評価のために口腔科医に紹介された。"},{"sentence":"Stomatologists are trained to diagnose and treat a wide range of oral conditions.","translation":"口腔科医は、広範囲にわたる口腔疾患を診断し治療する訓練を受けている。"}],"collocations":["see a stomatologist","consult a stomatologist","refer to a stomatologist"],"synonyms":["oral surgeon","oral medicine specialist","dentist specializing in oral pathology"],"antonyms":[]}],"etymology":{"value":"The word \"stomatologist\" comes from the Greek words \"stoma\" (mouth) and \"-logy\" (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/stoʊməˈtɒlədʒɪst/","syllables":"sto-ma-tol-o-gist"},"inflection":{"noun_plural":"stomatologists"},"usage_notes":{"explanation":"The term \"stomatologist\" is more commonly used in some European countries and less so in North America, where \"oral medicine specialist\" or \"oral surgeon\" are preferred. It refers to a dentist who specializes in diseases and conditions of the mouth, including the soft and hard tissues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to see a dentist for my skin problem, a stomatologist.","correct":"✓ I need to see a dermatologist for my skin problem.","note":"A stomatologist treats mouth problems, while a dermatologist treats skin problems."}],"priority":"★☆☆"},"related_words":{"derivatives":["stomatology (noun: the study of the mouth and its diseases)","stomatic (adjective: relating to the mouth)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"stomatologist\" is a specialized term used to describe a dentist who focuses on the treatment of diseases affecting the mouth. It is not a commonly used word in everyday conversation, but it is important in medical contexts related to oral health. Understanding this term is useful for those in the medical field or those researching specific oral conditions."},"example_sentences":[{"sentence":"The stomatologist performed a biopsy to determine the nature of the oral ulcer.","translation":"口腔科医は、口腔潰瘍の性質を特定するために生検を実施した。","type":"general","meaning_category":"definition"},{"sentence":"Many patients with complex dental issues are referred to a stomatologist for specialized care.","translation":"複雑な歯科問題を抱える多くの患者は、専門的なケアのために口腔科医に紹介される。","type":"general","meaning_category":"definition"}]}