{"word":"aminobenzaldehyde","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アミノベンズアルデヒド","english_definition":"Any of several isomeric organic compounds with the formula C7H7NO, consisting of a benzene ring substituted with both an amino group (NH2) and an aldehyde group (CHO).","examples":[{"sentence":"Aminobenzaldehyde is used as an intermediate in the synthesis of various chemical compounds.","translation":"アミノベンズアルデヒドは、様々な化学化合物の合成における中間体として使用される。"}],"collocations":["o-aminobenzaldehyde","m-aminobenzaldehyde","p-aminobenzaldehyde"],"synonyms":["aminobenzenecarboxaldehyde"],"antonyms":[]}],"etymology":{"value":"From amino- + benzaldehyde.","priority":"★★★"},"pronunciation":{"ipa":"/əˌmiːnoʊˌbɛnzˈældɪˌhaɪd/","syllables":"a-mi-no-ben-zal-de-hyde"},"inflection":{"notes":"Plural: aminobenzaldehydes"},"usage_notes":{"explanation":"Aminobenzaldehyde refers to any of the three isomers where an amino group (NH2) and an aldehyde group (CHO) are attached to a benzene ring. The position of the amino group relative to the aldehyde group determines the specific isomer: ortho- (o-), meta- (m-), or para- (p-). These compounds are used in chemical synthesis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ amino benzaldehyde","correct":"✓ aminobenzaldehyde","note":"The correct spelling is a single word: aminobenzaldehyde."}],"priority":"★★★"},"related_words":{"derivatives":["amino","benzaldehyde","aldehyde"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Aminobenzaldehyde is a technical term in organic chemistry, referring to a benzene ring with both an amino and an aldehyde functional group. It is primarily encountered in scientific or technical contexts related to chemical synthesis and analysis. Understanding requires a background in organic chemistry nomenclature and isomerism."},"example_sentences":[{"sentence":"The reaction of o-aminobenzaldehyde with a ketone yields a quinoline derivative.","translation":"o-アミノベンズアルデヒドとケトンとの反応により、キノリン誘導体が生成される。","type":"noun","meaning_category":"chemical compound"},{"sentence":"p-Aminobenzaldehyde is a useful building block in the preparation of Schiff bases.","translation":"p-アミノベンズアルデヒドは、シッフ塩基の調製における有用な構成要素である。","type":"noun","meaning_category":"chemical compound"}]}