{"word":"reprover","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人を)叱責する人、非難する人、たしなめる人","english_definition":"a person who reproves, censures, or rebukes another.","examples":[{"sentence":"He acted as a reprover of their bad habits.","translation":"彼は彼らの悪い習慣をたしなめる役目を果たした。"},{"sentence":"She was known as a stern reprover of wrongdoing.","translation":"彼女は不正行為を厳しく非難する人として知られていた。"}],"collocations":["stern reprover","gentle reprover"],"synonyms":["critic","censor","rebuker","admonisher","chastiser"],"antonyms":["praiser","approver","commender"]}],"etymology":{"value":"'Reprover' is derived from the verb 'reprove,' which comes from the Old French 'reprover' meaning 'to blame, censure,' and ultimately from the Latin 'reprobare,' meaning 'to disapprove, condemn.' The suffix '-er' indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈpruːvər/","syllables":"re-prov-er"},"inflection":{"noun_plural":"reprovers"},"usage_notes":{"explanation":"'Reprover' is a relatively formal and uncommon word. It refers specifically to someone who finds fault with and corrects the behavior of others. The word carries a sense of moral or ethical correction. It is not typically used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a good reprover because he always agrees with everyone.","correct":"He is not a good reprover because he always agrees with everyone. A good reprover points out faults.","note":"A reprover is someone who points out faults, so agreeing with everyone is the opposite of what a reprover does."}],"priority":"★☆☆"},"related_words":{"derivatives":["reprove (verb)","reproof (noun)","reprovable (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reprover' is a formal term for someone who corrects or criticizes others, often with a moral or ethical purpose. It's not commonly used in everyday language. You're more likely to encounter it in literature, historical texts, or discussions of ethics and morality. It implies a deliberate act of pointing out faults or wrongdoings with the intention of improvement or correction."},"example_sentences":[{"sentence":"The old judge was known as a severe reprover of corruption in the city.","translation":"その老判事は、市内の汚職を厳しく非難する人として知られていた。","type":"noun","meaning_category":"critic"},{"sentence":"As a moral guide, he often played the role of reprover, pointing out their ethical failings.","translation":"道徳的な指導者として、彼はしばしば非難する人の役割を果たし、彼らの倫理的な欠点を指摘した。","type":"noun","meaning_category":"admonisher"}]}