{"word":"antimicrobial-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"抗菌剤感受性の、抗菌薬感受性の","english_definition":"Susceptible to the effects of antimicrobial agents; capable of being inhibited or killed by antimicrobial substances.","examples":[{"sentence":"The bacteria isolated from the patient were antimicrobial-sensitive, allowing for effective treatment with antibiotics.","translation":"患者から分離された細菌は抗菌剤感受性であり、抗生物質による効果的な治療が可能でした。"},{"sentence":"An antimicrobial-sensitive strain of E. coli was used in the experiment to test the efficacy of the new disinfectant.","translation":"新しい消毒剤の有効性をテストするために、抗菌剤感受性のE. coli株が実験で使用されました。"}],"collocations":["antimicrobial-sensitive bacteria (抗菌剤感受性菌)","antimicrobial-sensitive strain (抗菌剤感受性株)","highly antimicrobial-sensitive (高抗菌剤感受性)"],"synonyms":["susceptible","vulnerable","responsive"],"antonyms":["antimicrobial-resistant","resistant","insensitive"]}],"etymology":{"value":"Derived from 'antimicrobial' (against microbes) and 'sensitive' (easily affected).","priority":"★★☆"},"pronunciation":{"ipa":"ˌæntiˌmaɪˈkroʊbiəl ˈsɛnsətɪv","syllables":"an-ti-mi-cro-bi-al sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very antimicrobial-sensitive)."},"usage_notes":{"explanation":"'Antimicrobial-sensitive' describes microorganisms (like bacteria, fungi, viruses) that are effectively inhibited or killed by antimicrobial agents such as antibiotics, antifungals, or antivirals. It is often used in medical and scientific contexts to indicate that a particular infection or organism can be treated with specific antimicrobial drugs. The opposite of this term is 'antimicrobial-resistant', which describes organisms that are not affected by antimicrobial agents.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is sensitive to antimicrobial.","correct":"✓ The virus is antimicrobial-sensitive.","note":"The correct form is 'antimicrobial-sensitive' to indicate sensitivity to antimicrobials in general."},{"incorrect":"✗ The antimicrobial is sensitive.","correct":"✓ The bacteria are antimicrobial-sensitive.","note":"'Antimicrobial' refers to the agent itself, not the organism being affected. 'Antimicrobial-sensitive' describes the organism."}],"priority":"★★☆"},"related_words":{"derivatives":["antimicrobial (adjective, noun)","sensitivity (noun)","susceptibility (noun)","resistant (adjective)","resistance (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antimicrobial-sensitive' is a technical term used to describe microorganisms that are susceptible to being killed or inhibited by antimicrobial agents. This term is commonly found in medical and scientific texts when discussing the effectiveness of treatments against infections. Understanding this term is important for comprehending discussions about antibiotic resistance and treatment options.","priority":"★★☆"},"example_sentences":[{"sentence":"The lab results showed that the infection was caused by an antimicrobial-sensitive bacterium.","translation":"検査結果は、感染症が抗菌剤感受性細菌によって引き起こされたことを示した。","type":"adjective","meaning_category":"General"},{"sentence":"Due to the antimicrobial-sensitive nature of the pathogen, a common antibiotic was effective in treating the infection.","translation":"病原体の抗菌剤感受性の性質のため、一般的な抗生物質が感染症の治療に効果的でした。","type":"adjective","meaning_category":"Treatment"},{"sentence":"The researchers are studying the mechanisms by which some bacteria become less antimicrobial-sensitive over time.","translation":"研究者たちは、一部の細菌が時間の経過とともに抗菌剤感受性が低下するメカニズムを研究しています。","type":"adjective","meaning_category":"Resistance"}]}