{"word":"colpindach","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, possibly archaic) A type of short sword or dagger, possibly of Scottish origin.","english_definition":"A type of short sword or dagger, possibly of Scottish origin. The exact form and history are unclear.","examples":[{"sentence":"Historical texts mention the use of a colpindach in close combat.","translation":"歴史的な文献には、近接戦闘におけるcolpindachの使用が記載されている。"}],"collocations":["wield a colpindach","a Scottish colpindach"],"synonyms":["dirk","dagger","short sword"],"antonyms":[]}],"etymology":{"value":"Origin is uncertain. Possibly from Scottish Gaelic, but no definitive etymological source is available. The word appears in some historical texts relating to Scottish weaponry.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkɒlpɪndæk/","syllables":"col-pin-dach"},"inflection":{"noun_plural":"colpindachs"},"usage_notes":{"explanation":"The term 'colpindach' is relatively obscure and rarely used in modern English. Its meaning is primarily found in historical contexts related to Scottish arms and armor. Due to the lack of precise historical documentation, the exact characteristics of a colpindach remain somewhat speculative.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the colpindach to cut the rope.","correct":"✓ He used a knife to cut the rope.","note":"Unless specifically discussing historical weaponry, 'knife' or 'dagger' are more common and appropriate terms."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dirk","claymore","sgian-dubh"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - almost non-existent in modern usage.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'colpindach' is highly specialized and rarely encountered outside of historical texts concerning Scottish weaponry. Understanding its meaning requires familiarity with obsolete terms and historical contexts. It is not part of the standard English vocabulary.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The museum displayed a collection of historical weapons, including a rare colpindach.","translation":"博物館には、珍しいcolpindachを含む歴史的な武器のコレクションが展示されていた。","type":"noun","meaning_category":"weapon"},{"sentence":"Legends tell of Scottish warriors skilled in the use of the colpindach.","translation":"伝説によれば、colpindachの扱いに長けたスコットランドの戦士たちがいたという。","type":"noun","meaning_category":"weapon"}]}