{"word":"unkeeled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"竜骨のない、竜骨を持たない","english_definition":"Not having a keel; lacking a keel.","examples":[{"sentence":"An unkeeled boat is more prone to capsizing.","translation":"竜骨のないボートは転覆しやすい。"},{"sentence":"The unkeeled hull design makes it easier to maneuver in shallow water.","translation":"竜骨のない船体設計により、浅瀬での操縦が容易になる。"}],"collocations":["unkeeled boat","unkeeled hull","unkeeled vessel"],"synonyms":["flat-bottomed","keelless"],"antonyms":["keeled"]},{"part_of_speech":"adjective","definition":"(植物学) 竜骨弁（植物の花弁の一部）を持たない","english_definition":"(Botany) Lacking a keel; specifically, lacking a keel petal in a flower.","examples":[{"sentence":"This species is characterized by its unkeeled petals.","translation":"この種は竜骨弁のない花弁によって特徴づけられる。"}],"collocations":["unkeeled petals","unkeeled flower"],"synonyms":["keelless"],"antonyms":["keeled"]}],"etymology":{"value":"\"un-\" (not) + \"keeled\" (having a keel).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkiːld/","syllables":"un-keeled"},"inflection":{"notes":"Adjective, comparative and superlative forms are possible but rare (more unkeeled, most unkeeled)."},"usage_notes":{"explanation":"The term \"unkeeled\" primarily refers to boats or ships that do not have a keel, which is a structural element extending downwards from the hull to provide stability. In botany, it describes flowers lacking a keel petal. The term is relatively uncommon outside of nautical and botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unkeeled ship sailed very fast because of its keel.","correct":"✓ The unkeeled ship sailed erratically because it lacked a keel.","note":"An unkeeled ship does not have a keel, so it cannot sail fast *because* of a keel."}],"priority":"★☆☆"},"related_words":{"derivatives":["keel (noun)","keeled (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unkeeled' is a technical term, primarily used in nautical or botanical contexts. It means 'not having a keel'. A keel is a structural element on a boat or a part of a flower. Understanding this word requires some specialized knowledge of these fields."},"example_sentences":[{"sentence":"The small, unkeeled dinghy was easily tossed about by the waves.","translation":"小型の竜骨のないディンギーは波に簡単に翻弄された。","type":"adjective","meaning_category":"lacking a keel"},{"sentence":"Botanists noted the absence of a keel petal, describing the flower as unkeeled.","translation":"植物学者は竜骨弁がないことに気づき、その花を竜骨がないと表現した。","type":"adjective","meaning_category":"lacking a keel petal"}]}