{"word":"Unionist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"合同主義者、統一主義者","english_definition":"a person who supports political union, especially: a) a supporter of the Union during the American Civil War; b) (in Ireland) a supporter of the union of Ireland with Great Britain.","examples":[{"sentence":"He was a staunch Unionist, advocating for the continued unity of the country.","translation":"彼は断固たる合同主義者で、国の統一の継続を主張していた。"},{"sentence":"The Unionists in Northern Ireland traditionally opposed any separation from the United Kingdom.","translation":"北アイルランドの統一主義者は伝統的にイギリスからの分離に反対していた。"}],"collocations":["staunch Unionist","leading Unionist","Unionist party","Unionist government"],"synonyms":["integrationist","federalist","loyalist"],"antonyms":["separatist","nationalist"]},{"part_of_speech":"adjective","definition":"合同主義の、統一主義の","english_definition":"relating to or supporting political union.","examples":[{"sentence":"The Unionist policies aimed to strengthen ties between the regions.","translation":"合同主義的な政策は、地域間の結びつきを強化することを目的としていた。"},{"sentence":"Unionist sentiment remained strong in the province.","translation":"その州では合同主義的な感情が依然として強かった。"}],"collocations":["Unionist policies","Unionist sentiment","Unionist stance","Unionist vote"],"synonyms":["integrationist","federalist"],"antonyms":["separatist","nationalist"]}],"etymology":{"value":"'Union' + '-ist'. Refers to the support for a political union, often specifically the United States during the Civil War or the union of Ireland and Great Britain.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːniənɪst/","syllables":"U-ni-on-ist"},"inflection":{"noun_plural":"Unionists","adjective_forms":{}},"usage_notes":{"explanation":"'Unionist' is often used in specific historical and political contexts. In the context of the American Civil War, it refers to someone who supported the Union (the United States). In the context of Ireland, it refers to someone who supports the union of Ireland with Great Britain (or, more commonly now, Northern Ireland remaining part of the United Kingdom). The term can also be used more broadly to refer to anyone who supports political union in general.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a unionist for the workers.","correct":"✓ He is a trade unionist.","note":"'Unionist' refers to political union, not trade unions. For support of trade unions, use 'trade unionist'."},{"incorrect":"✗ The Unionist party wants to separate from the country.","correct":"✓ The Unionist party wants to remain part of the country.","note":"Unionist parties typically support maintaining a political union, not separating from it."}],"priority":"★★☆"},"related_words":{"derivatives":["Unionism"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, context-dependent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Unionist' is a political term with specific historical and regional connotations. It generally refers to someone who supports political union, but the specific meaning depends on the context. It's most commonly associated with the American Civil War (supporters of the Union) and Irish politics (supporters of the union with Great Britain/the United Kingdom). Understanding the historical and political context is crucial for interpreting the meaning of 'Unionist' correctly."},"example_sentences":[{"sentence":"The Southern Unionists opposed secession from the United States.","translation":"南部の合同主義者はアメリカ合衆国からの脱退に反対した。","type":"noun","meaning_category":"American Civil War"},{"sentence":"The Democratic Unionist Party is a major political force in Northern Ireland.","translation":"民主統一党は北アイルランドにおける主要な政治勢力である。","type":"noun","meaning_category":"Irish Politics"},{"sentence":"Unionist voters tend to favor closer ties with the UK.","translation":"合同主義の有権者は、英国とのより緊密な関係を好む傾向がある。","type":"adjective","meaning_category":"General"}]}