{"word":"gypsum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"石膏","english_definition":"a soft white or gray mineral consisting of hydrated calcium sulfate. It is used to make plaster of Paris and fertilizers, and in the building industry.","examples":[{"sentence":"Gypsum is used in the production of drywall.","translation":"石膏は石膏ボードの製造に使用されます。"},{"sentence":"The mine produces large quantities of gypsum.","translation":"その鉱山では大量の石膏を産出します。"},{"sentence":"Gypsum is a common ingredient in cement.","translation":"石膏はセメントの一般的な成分です。"}],"collocations":["gypsum board","gypsum plaster","gypsum deposit","gypsum mine"],"synonyms":["calcium sulfate dihydrate"],"antonyms":[]}],"etymology":{"value":"From Latin gypsum, from Ancient Greek γύψος (gúpsos, “chalk, gypsum”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɪpsəm/","syllables":"gyp-sum"},"inflection":{"noun_plural":"gypsums"},"usage_notes":{"explanation":"Gypsum is a mineral used in various industries, primarily construction and agriculture. It's the main component of plaster of Paris and drywall.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a gypsums for my wall.","correct":"✓ I need some gypsum for my wall.","note":"Gypsum is usually used as an uncountable noun, so it doesn't typically take a plural form unless referring to different types or deposits of gypsum."}],"priority":"★★☆"},"related_words":{"derivatives":["gypsiferous (adjective: containing gypsum)"],"phrasal_verbs":[],"related_terms":["plaster of Paris","drywall"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gypsum' is a technical term referring to a specific mineral used in construction and agriculture. Understanding its properties and uses requires some specialized knowledge. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The walls were constructed using gypsum board.","translation":"壁は石膏ボードを使用して建設されました。","type":"noun","meaning_category":"石膏"},{"sentence":"Farmers add gypsum to the soil to improve its structure.","translation":"農家は土壌構造を改善するために石膏を土に加えます。","type":"noun","meaning_category":"石膏"}]}