{"word":"archaisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"古語、古風な言い回し、時代遅れの言葉や表現","english_definition":"Words or expressions that are no longer in ordinary use; the use of such words or expressions.","examples":[{"sentence":"The novel is full of archaisms, which makes it difficult to read.","translation":"その小説は古語で溢れており、読むのが難しい。"},{"sentence":"Using archaisms can give your writing a historical feel.","translation":"古語を使うことで、あなたの文章に歴史的な雰囲気を与えることができる。"},{"sentence":"Some poets deliberately use archaisms to create a certain effect.","translation":"特定の効果を生み出すために、意図的に古語を使う詩人もいる。"}],"collocations":["literary archaisms (文学的な古語)","deliberate archaisms (意図的な古語)","avoid archaisms (古語を避ける)","use archaisms (古語を使う)"],"synonyms":["obsolete words","old-fashioned expressions","antiquated terms"],"antonyms":["neologisms","modern terms","contemporary language"]}],"etymology":{"value":"Derived from the Greek word 'archaios' meaning 'ancient'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrkeɪɪzəmz/","syllables":"ar-cha-is-ms"},"inflection":{"singular":"archaism"},"usage_notes":{"explanation":"\"Archaisms\" refers to words or phrases that were once commonly used but are now considered old-fashioned or obsolete. They are sometimes used intentionally in literature or historical writing to create a specific atmosphere or to mimic the language of a particular era. However, using too many archaisms can make writing difficult to understand for modern readers. Distinguish from neologisms, which are newly coined words.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used many archaism in his speech.","correct":"✓ He used many archaisms in his speech.","note":"The plural form 'archaisms' should be used when referring to multiple instances of archaic words or expressions."},{"incorrect":"✗ Archaism is good for modern writing.","correct":"✓ Using archaisms can add a historical flavor to writing, but should be used sparingly.","note":"While archaisms can be effective in certain contexts, they are generally not suitable for modern writing as they can make the text difficult to understand."}],"priority":"★★☆"},"related_words":{"derivatives":["archaic (adjective: 古風な、時代遅れの)","archaically (adverb: 古風に)"],"related_concepts":["historical linguistics (歴史言語学)","obsolete words (廃語)","etymology (語源学)"],"examples_of_archaisms":["thee (汝)","thou (汝)","hark (聞け)","ere (～の前に)","betwixt (～の間に)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Archaisms\" refers to words or phrases that are no longer commonly used in everyday language. Understanding this term requires a good vocabulary and familiarity with older forms of English. It's often encountered in literature, historical texts, or discussions about language evolution. Recognizing archaisms helps in comprehending older texts and appreciating the nuances of language change over time."},"example_sentences":[{"sentence":"Shakespeare's plays are filled with archaisms.","translation":"シェイクスピアの劇は古語で満たされている。","type":"noun","meaning_category":"古語"},{"sentence":"The author used archaisms to create a sense of authenticity in the historical novel.","translation":"作者は歴史小説に信憑性を与えるために古語を使った。","type":"noun","meaning_category":"古語"},{"sentence":"Many archaisms are derived from Latin or Greek.","translation":"多くの古語はラテン語またはギリシャ語に由来する。","type":"noun","meaning_category":"古語"}]}