{"word":"menagerist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"動物園経営者、動物取扱者、動物展示者","english_definition":"A person who owns or manages a menagerie; a keeper or exhibitor of wild animals.","examples":[{"sentence":"The menagerist carefully tended to the needs of his exotic animals.","translation":"動物園経営者は、彼の珍しい動物たちの世話を丁寧にした。"},{"sentence":"The traveling menagerist brought a taste of the wild to small towns.","translation":"巡回動物展示者は、小さな町に野生の味をもたらした。"}],"collocations":["traveling menagerist","circus menagerist","private menagerist"],"synonyms":["animal keeper","animal exhibitor","zoo owner","animal trainer"],"antonyms":[]}],"etymology":{"value":"Derived from 'menagerie', with the suffix '-ist' indicating a person associated with it. 'Menagerie' comes from French, ultimately from Italian 'maneggiare' (to handle, train horses), reflecting the historical association with trained animals.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnædʒərɪst/","syllables":"me-nag-er-ist"},"inflection":{"noun_plural":"menagerists"},"usage_notes":{"explanation":"'Menagerist' is a relatively uncommon word, primarily used in historical contexts or when specifically referring to someone who manages a private collection or small-scale exhibition of animals, rather than a modern zoo. The term emphasizes the personal involvement in the care and display of animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a menagerie.","correct":"✓ He is a menagerist.","note":"'Menagerie' is the collection of animals; 'menagerist' is the person who manages them."}],"priority":"★☆☆"},"related_words":{"derivatives":["menagerie"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'menagerist' is a niche term primarily encountered in historical or specialized contexts relating to animal exhibitions. It describes someone who manages or owns a menagerie, which is a collection of wild animals kept in captivity for exhibition. Because of its limited use, it is not part of common vocabulary. Understanding requires familiarity with the history of zoos and animal keeping.","priority":"★★☆"},"example_sentences":[{"sentence":"The old circus employed a dedicated menagerist to care for its lions and tigers.","translation":"その古いサーカスは、ライオンやトラの世話をする専門の動物園経営者を雇っていた。","type":"general","meaning_category":"動物園経営者"},{"sentence":"Traveling menagerists were a common sight in 19th-century Europe.","translation":"巡回動物展示者は、19世紀のヨーロッパではよく見られた光景だった。","type":"historical","meaning_category":"動物展示者"}]}