{"word":"Ideist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"観念論者、理想主義者","english_definition":"A proponent or adherent of ideism; one who emphasizes ideas or ideals.","examples":[{"sentence":"He was described as an ideist, always prioritizing abstract concepts over practical concerns.","translation":"彼は観念論者と評され、常に現実的な問題よりも抽象的な概念を優先していた。"}],"collocations":["philosophical ideist","religious ideist"],"synonyms":["idealist","theorist"],"antonyms":["materialist","realist"]},{"part_of_speech":"noun","definition":"(哲学)イデア論者","english_definition":"(Philosophy) One who believes in the existence and importance of ideas, especially as a basis for knowledge or reality.","examples":[{"sentence":"As an ideist, he argued that the physical world is merely a reflection of underlying ideas.","translation":"イデア論者として、彼は物理世界は根底にあるイデアの単なる反映に過ぎないと主張した。"}],"collocations":["Platonic ideist"],"synonyms":["Platonist"],"antonyms":["empiricist"]}],"etymology":{"value":"From 'idea' + '-ist'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈaɪdiːɪst/","syllables":"I-de-ist"},"inflection":{"noun_plural":"Ideists"},"usage_notes":{"explanation":"The term 'Ideist' is relatively uncommon. It generally refers to someone who gives primary importance to ideas, ideals, or concepts, often in a philosophical or theoretical context. It can also specifically refer to a believer in ideism, a philosophical doctrine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a big ideist about environmental protection.","correct":"✓ She is a strong advocate for environmental protection.","note":"'Ideist' is not commonly used to describe someone who is simply enthusiastic about an idea. Use 'advocate', 'supporter', or similar terms instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["ideism","idea","ideal","idealist","idealism"],"related_terms":["philosophy","theory","concept","abstraction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Ideist' is a relatively rare and specialized term, primarily used in philosophical or academic contexts. It refers to someone who adheres to or promotes ideism, the belief in the primary importance of ideas or ideals. Understanding requires familiarity with abstract philosophical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The conference featured several prominent ideists discussing the nature of reality.","translation":"その会議では、現実の本質について議論する著名な観念論者が数名参加した。","type":"noun","meaning_category":"観念論者"},{"sentence":"As an ideist, he believed that true progress comes from intellectual and moral development.","translation":"観念論者として、彼は真の進歩は知的、道徳的な発展から来ると信じていた。","type":"noun","meaning_category":"観念論者"}]}