{"word":"irreligion","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"無宗教、宗教への無関心、不信心、冒涜","english_definition":"lack of religious belief, indifference to religion, or hostility to religion.","examples":[{"sentence":"His irreligion was a source of conflict within his devout family.","translation":"彼の無宗教は、敬虔な家族の中で対立の原因となった。"},{"sentence":"The rise of irreligion in modern society is a complex phenomenon.","translation":"現代社会における無宗教の台頭は、複雑な現象である。"},{"sentence":"Some view irreligion as a sign of moral decay.","translation":"無宗教を道徳的退廃の兆候と見る人もいる。"}],"collocations":["growth of irreligion (無宗教の拡大)","spread of irreligion (無宗教の広がり)","rise of irreligion (無宗教の台頭)","secular irreligion (世俗的な無宗教)","militant irreligion (攻撃的な無宗教)"],"synonyms":["secularism","atheism","agnosticism","non-belief","unbelief","impiety","profanity"],"antonyms":["religion","faith","piety","devotion","reverence"]},{"part_of_speech":"noun","definition":"(古語)宗教に対する敵意、反宗教","english_definition":"(archaic) active hostility or opposition to religion.","examples":[{"sentence":"In past eras, irreligion was often met with severe punishment.","translation":"過去の時代には、反宗教はしばしば厳しい処罰を受けた。"}],"collocations":["combat irreligion (反宗教と戦う)","suppress irreligion (反宗教を抑圧する)"],"synonyms":["anti-religion","blasphemy","heresy"],"antonyms":["orthodoxy","religiousness"]}],"etymology":{"value":"\"Irreligion\" comes from the prefix \"ir-\" (meaning \"not\") combined with \"religion.\" The prefix \"ir-\" is a variant of \"in-\" used before \"r.\" Thus, \"irreligion\" literally means \"not religion.\" The word has been used in English since the 15th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪrɪˈlɪdʒən/","syllables":"ir-re-li-gion"},"inflection":{"noun_plural":null,"notes":"Irreligion is generally used as an uncountable noun, so it doesn't typically have a plural form."},"usage_notes":{"explanation":"\"Irreligion\" can refer to a simple lack of religious belief or practice, or it can denote a more active opposition to religion. The specific meaning often depends on the context. It is distinct from atheism (the disbelief in the existence of God) and agnosticism (the view that the existence or non-existence of God is unknowable), though it can encompass these positions. It's also different from \"non-religious,\" which is a more neutral term simply indicating the absence of religious affiliation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices irreligion every Sunday.","correct":"✓ He demonstrates irreligion through his actions. / ✓ He is irreligious.","note":"Irreligion is a state of being or a lack of belief, not something one \"practices.\" It's better to say someone \"demonstrates irreligion\" or is \"irreligious.\""},{"incorrect":"✗ Irreligion is a religion.","correct":"✓ Irreligion is the absence of religion.","note":"Irreligion is the opposite of religion; it's the lack of religious belief or affiliation."},{"incorrect":"✗ The irreligions are growing in popularity.","correct":"✓ Irreligion is growing in popularity.","note":"Irreligion is generally used as an uncountable noun and does not have a plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["irreligious (adjective: 無宗教の、不信心な)"],"phrases":["non-religious (形容詞: 無宗教の)","secular (形容詞: 世俗的な)","atheist (名詞: 無神論者)","agnostic (名詞: 不可知論者)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, more common in academic or philosophical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Irreligion\" is a relatively formal term referring to the absence of religious belief, indifference to religion, or even active hostility towards it. It's often used in discussions about societal trends, philosophy, or personal beliefs. The word implies more than just not being religious; it can suggest a conscious rejection or lack of concern for religious matters. It's important to distinguish it from related terms like \"atheism\" and \"agnosticism,\" which have more specific meanings. The word is not commonly used in everyday conversation.","example_sentences":[{"sentence":"The philosopher argued that irreligion is a natural consequence of scientific advancement.","translation":"その哲学者は、無宗教は科学の進歩の自然な結果であると主張した。","type":"general","meaning_category":"lack of religious belief"},{"sentence":"The survey revealed a growing trend of irreligion among young adults.","translation":"調査の結果、若い成人の間で無宗教の傾向が強まっていることが明らかになった。","type":"trend","meaning_category":"indifference to religion"},{"sentence":"His outspoken irreligion made him a controversial figure in the community.","translation":"彼の率直な無宗教は、彼を地域社会で物議を醸す人物にした。","type":"controversy","meaning_category":"hostility to religion"}]}}