{"word":"preoccupiedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"夢中で、没頭して、気を取られて","english_definition":"in a preoccupied manner; in a way that shows someone is thinking about something else and not paying attention to what is happening around them.","examples":[{"sentence":"She stared out the window, preoccupiedly tracing patterns on the glass.","translation":"彼女は窓の外を見つめ、夢中でガラスに模様を描いていた。"},{"sentence":"He nodded, preoccupiedly, barely listening to what I was saying.","translation":"彼はうなずいたが、上の空で、私が言っていることをほとんど聞いていなかった。"},{"sentence":"She answered the question preoccupiedly, her mind clearly elsewhere.","translation":"彼女は上の空で質問に答えた。彼女の心は明らかに別のところにあった。"}],"collocations":["stare preoccupiedly","nod preoccupiedly","answer preoccupiedly","think preoccupiedly"],"synonyms":["absentmindedly","distractedly","thoughtfully","engrossedly","intently","inattentively"],"antonyms":["attentively","mindfully","consciously","observantly"]}],"etymology":{"value":"Derived from the adjective 'preoccupied' (meaning absorbed in thought) by adding the suffix '-ly', which transforms adjectives into adverbs.","priority":"★★☆"},"pronunciation":{"ipa":"/priːˈɒkjʊpaɪdli/","syllables":"pre-oc-cu-pied-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Preoccupiedly' describes how an action is performed, indicating that the person is not fully present or attentive because their mind is focused on something else. It suggests a state of being lost in thought or concern. It is often used to describe someone who is physically present but mentally elsewhere.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was preoccupiedly with her work.","correct":"✓ She was preoccupied with her work. / ✓ She worked preoccupiedly.","note":"'Preoccupied' is an adjective describing the state of being, while 'preoccupiedly' is an adverb describing how an action is performed. The first sentence requires the adjective, while the second uses the adverb correctly."},{"incorrect":"✗ He looked preoccupiedly.","correct":"✓ He looked preoccupied.","note":"'Looked' is a linking verb, which typically takes an adjective to describe the subject's state. Use 'preoccupied' (adjective) rather than 'preoccupiedly' (adverb) in this case."}],"priority":"★★☆"},"related_words":{"derivatives":["preoccupied (adjective)","preoccupation (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preoccupiedly' describes an action done in a way that shows someone is lost in thought and not paying attention. It's formed from the adjective 'preoccupied' (meaning absorbed in thought) by adding '-ly'. Use it to describe how someone does something when their mind is elsewhere. For example, 'She stared out the window preoccupiedly' means she was staring while lost in her thoughts."},"example_sentences":[{"sentence":"He stared at the screen preoccupiedly, not noticing the person who entered the room.","translation":"彼は上の空で画面を見つめ、部屋に入ってきた人に気づかなかった。","type":"adverb","meaning_category":"inattentively"},{"sentence":"She tapped her pen on the desk preoccupiedly, trying to solve the problem.","translation":"彼女は問題を解決しようと、上の空でペンを机に叩きつけた。","type":"adverb","meaning_category":"thoughtfully"},{"sentence":"The professor paced the room preoccupiedly, muttering to himself.","translation":"教授は上の空で部屋を歩き回り、独り言をつぶやいていた。","type":"adverb","meaning_category":"absentmindedly"}]}