{"word":"Menticulture","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"心の耕作、精神修養、精神的な成長を促すための意識的な努力","english_definition":"The cultivation of the mind; the conscious effort to promote mental development and improvement.","examples":[{"sentence":"Menticulture involves actively seeking knowledge and challenging one's own beliefs.","translation":"メンティカルチャーは、積極的に知識を求め、自身の信念に挑戦することを含む。"},{"sentence":"Through menticulture, individuals can achieve greater self-awareness and personal growth.","translation":"メンティカルチャーを通じて、個人はより大きな自己認識と個人的な成長を達成することができる。"}],"collocations":["practice menticulture","engage in menticulture","principles of menticulture","benefits of menticulture"],"synonyms":["mental cultivation","mind training","intellectual development","self-improvement","personal growth"],"antonyms":["mental stagnation","intellectual decline"]},{"part_of_speech":"noun","definition":"（古用法）精神を鍛えるための体系的な方法論や哲学","english_definition":"(Archaic) A systematic methodology or philosophy for training the mind.","examples":[{"sentence":"Early proponents of menticulture believed in its potential to transform society.","translation":"メンティカルチャーの初期の提唱者たちは、それが社会を変革する可能性を秘めていると信じていた。"},{"sentence":"The book outlined the principles of menticulture, advocating for lifelong learning and critical thinking.","translation":"その本はメンティカルチャーの原則を概説し、生涯学習と批判的思考を提唱した。"}],"collocations":["principles of menticulture","philosophy of menticulture","teachings of menticulture","history of menticulture"],"synonyms":["mental philosophy","mind science","psychological training"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'mens' (mind) and 'cultura' (cultivation).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɛntaɪˌkʌltʃər","syllables":"men-ti-cul-ture"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Menticulture' is a relatively rare word, often used in philosophical or self-help contexts. It emphasizes the active and intentional process of improving one's mind through learning, reflection, and self-discipline. It is distinct from simply acquiring knowledge; it involves a deeper engagement with ideas and a commitment to personal growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Menticulture is just about memorizing facts.","correct":"✓ Menticulture is about actively developing one's mental faculties and understanding.","note":"Menticulture is not simply about memorization but about active mental development."}],"priority":"★★☆"},"related_words":{"derivatives":["mental","culture","cultivation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Menticulture' is a sophisticated term referring to the deliberate cultivation of one's mind. It involves actively seeking knowledge, critically evaluating information, and continuously striving for intellectual and personal growth. This term is not commonly used in everyday conversation but may appear in philosophical or self-help literature."},"example_sentences":[{"sentence":"The practice of menticulture can lead to increased creativity and problem-solving skills.","translation":"メンティカルチャーの実践は、創造性と問題解決能力の向上につながる可能性がある。","type":"noun","meaning_category":"心の耕作"},{"sentence":"Her approach to menticulture involved daily meditation and reflective journaling.","translation":"彼女のメンティカルチャーへのアプローチは、毎日の瞑想と内省的なジャーナリングを含んでいた。","type":"noun","meaning_category":"心の耕作"}]}