{"word":"desktop-biased","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"デスクトップ環境に偏った、デスクトップ環境を重視した","english_definition":"Designed or optimized primarily for use on desktop computers, often neglecting or underemphasizing mobile or other platforms.","examples":[{"sentence":"The website's design is desktop-biased, making it difficult to navigate on mobile devices.","translation":"そのウェブサイトのデザインはデスクトップ環境に偏っており、モバイルデバイスでのナビゲーションが困難になっている。"},{"sentence":"The software's user interface is desktop-biased and doesn't translate well to smaller screens.","translation":"そのソフトウェアのユーザーインターフェースはデスクトップ環境を重視しており、小さな画面にはうまく対応できない。"}],"collocations":["desktop-biased design","desktop-biased application","desktop-biased website","desktop-biased approach"],"synonyms":["desktop-centric","desktop-focused","desktop-oriented"],"antonyms":["mobile-first","mobile-friendly","responsive"],"notes":"This term often implies a negative connotation, suggesting that the design or development process has not adequately considered the needs of users on other platforms."}],"etymology":{"value":"Combination of 'desktop' (referring to desktop computers) and 'biased' (having a preference or inclination).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛskˌtɒp ˈbaɪəst/","syllables":"des-ktop-bi-ased"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Desktop-biased' is used to describe something that is primarily designed for or works best on a traditional desktop computer. This often means that it may not function well or be user-friendly on mobile devices or other platforms. It highlights a lack of consideration for cross-platform compatibility.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The application is desktop biased, so it works well on phones.","correct":"The application is desktop-biased, so it doesn't work well on phones.","note":"The word 'biased' implies a preference or leaning towards one platform, meaning it is *not* optimized for other platforms."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["desktop","biased","mobile-biased","platform-specific","responsive design"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Desktop-biased' is a term used to describe a design or application that is primarily made for desktop computers, often at the expense of usability on other devices like phones or tablets. It suggests that the developers prioritized the desktop experience and may not have adequately considered the needs of mobile users."},"example_sentences":[{"sentence":"The old website was very **desktop-biased**, leading to a poor user experience on smartphones.","translation":"その古いウェブサイトは非常にデスクトップ環境に偏っており、スマートフォンでのユーザーエクスペリエンスが低下していた。","type":"general","meaning_category":"design"},{"sentence":"Many legacy applications are **desktop-biased** and require significant rework to be mobile-friendly.","translation":"多くのレガシーアプリケーションはデスクトップ環境に偏っており、モバイルフレンドリーにするには大幅な手直しが必要である。","type":"technical","meaning_category":"software"}]}