{"word":"Dartman","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A fictional character or nickname.","english_definition":"This term is likely a fictional character name or a nickname, possibly associated with the game of darts or someone who moves quickly and precisely. Without more context, a precise definition is difficult.","examples":[{"sentence":"In the story, Dartman was the hero who always hit his target.","translation":"物語の中で、ダートマンは常に標的を射抜くヒーローだった。"},{"sentence":"They called him Dartman because he was so quick and accurate on the basketball court.","translation":"彼はバスケットボールコートで非常に素早く正確だったので、ダートマンと呼ばれていた。"}],"collocations":["the amazing Dartman","Dartman strikes again","be like Dartman"],"synonyms":["Marksman","Sharpshooter","Quickshot"],"antonyms":[]}],"etymology":{"value":"Likely a combination of 'dart' (a projectile or a quick movement) and 'man' (a person).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɑːrtmən/","syllables":"Dart-man"},"inflection":{"noun_plural":"Dartmen"},"usage_notes":{"explanation":"'Dartman' is not a standard English word. It is most likely a made-up name or nickname. Its meaning would depend heavily on the context in which it is used. If associated with darts, it would imply someone skilled at the game. If used more generally, it could refer to someone quick, agile, and precise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Dartman is a real superhero.","correct":"✓ The Dartman is a fictional superhero.","note":"Unless Dartman is a recognized character in a specific fictional universe, it's more accurate to describe them as fictional."}],"priority":"★☆☆"},"related_words":{"derivatives":["Dart (noun): a small pointed missile that is thrown in the game of darts; (verb): to move or run somewhere suddenly or rapidly."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism or fictional term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dartman' is not a common word and would likely be unfamiliar to most English speakers. Understanding its meaning requires inferring from the component words 'dart' and 'man,' and the context in which it is used. It is best understood as a fictional name or nickname implying skill, speed, and precision, possibly related to the game of darts."},"example_sentences":[{"sentence":"Everyone in the office called him Dartman because of his uncanny ability to meet every deadline.","translation":"オフィスのみんなは、彼がどんな締め切りにも必ず間に合わせる驚くべき能力を持っていたので、ダートマンと呼んでいた。","type":"noun","meaning_category":"Nickname"},{"sentence":"Dartman, the vigilante, patrolled the city streets, stopping crime with his incredible speed and accuracy.","translation":"自警団員のダートマンは、信じられないほどのスピードと正確さで犯罪を阻止しながら、街の通りをパトロールした。","type":"noun","meaning_category":"Fictional Character"}]}