{"word":"Kennebecker","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of potato known for its excellent flavor and versatility, often used for fries and baking.","english_definition":"A variety of potato prized for its flavor and suitability for various culinary uses, including french fries and baking.","examples":[{"sentence":"We used Kennebecker potatoes to make homemade french fries.","translation":"自家製フライドポテトを作るのにケネベッカー種のジャガイモを使いました。"},{"sentence":"Kennebeckers are known for their fluffy texture when baked.","translation":"ケネベッカーは焼くとホクホクした食感で知られています。"}],"collocations":["Kennebecker potatoes","Kennebecker fries","baking Kennebeckers"],"synonyms":["potato variety"],"antonyms":[]}],"etymology":{"value":"Named after the Kennebec River in Maine, USA, where it was developed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɛnɪˌbɛkər/","syllables":"Ken-ne-beck-er"},"inflection":{"noun_plural":"Kennebeckers"},"usage_notes":{"explanation":"'Kennebecker' is primarily used to refer to the specific variety of potato. It is not a general term for potatoes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some potatoes, they are Kennebeckers.","correct":"✓ I bought some Kennebecker potatoes.","note":"It's more common to say 'Kennebecker potatoes' rather than just 'Kennebeckers' when referring to them in general."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kennebecker' refers to a specific type of potato. It is a niche term, primarily used by those familiar with potato varieties or in culinary contexts where specific potato types are important. Understanding requires some background knowledge of agriculture or cooking."},"example_sentences":[{"sentence":"The chef recommended Kennebecker potatoes for their consistent texture.","translation":"シェフは、その一貫した食感からケネベッカー種のジャガイモを推奨しました。","type":"noun","meaning_category":"potato variety"},{"sentence":"For the best results, use Kennebeckers when making potato chips.","translation":"最高の出来にするには、ポテトチップスを作る際にケネベッカー種を使ってください。","type":"noun","meaning_category":"potato variety"}]}