{"word":"nondominance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非優性、非支配","english_definition":"The state or condition of not being dominant; the absence of dominance.","examples":[{"sentence":"The genetic study revealed nondominance of certain traits.","translation":"その遺伝子研究は、特定の形質の非優性を示した。"},{"sentence":"In social contexts, nondominance can be a strategy for conflict avoidance.","translation":"社会的な文脈では、非優性は対立回避のための戦略となり得る。"},{"sentence":"The principle of nondominance ensures equal opportunities for all members.","translation":"非優性の原則は、すべてのメンバーに平等な機会を保証する。"}],"collocations":["genetic nondominance (遺伝的非優性)","social nondominance (社会的非優性)","political nondominance (政治的非優性)","trait nondominance (形質の非優性)"],"synonyms":["subordination","inferiority","passivity","submissiveness"],"antonyms":["dominance","superiority","ascendancy","prepotency"]}],"etymology":{"value":"Derived from 'non-' (prefix meaning 'not') + 'dominance' (the state of being dominant).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈdɒmɪnəns/","syllables":"non-dom-i-nance"},"inflection":{"noun_plural":"nondominances"},"usage_notes":{"explanation":"'Nondominance' refers to the absence or lack of dominance, whether in a genetic, social, or political context. It is often used to describe situations where there is no clear hierarchy or where multiple factors influence outcomes. In genetics, it describes a situation where neither allele is dominant over the other, resulting in a blended phenotype. In social sciences, it can refer to the absence of hierarchical power structures or the choice to avoid asserting dominance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondominance of the team led to their victory.","correct":"✓ The lack of dominance in the team led to their victory.","note":"Nondominance implies the absence of a single dominant entity, not necessarily a positive attribute. A more accurate phrasing would be 'lack of dominance' or 'absence of hierarchy'."},{"incorrect":"✗ He showed nondominance behavior by yelling at his coworkers.","correct":"✓ He showed dominant behavior by yelling at his coworkers.","note":"Yelling at coworkers is an example of dominant behavior, not nondominant behavior. Nondominance would involve avoiding confrontation or asserting oneself."}],"priority":"★★☆"},"related_words":{"derivatives":["nondominant (adjective)"],"antonyms":["dominance","dominant"],"related_concepts":["codominance (共優性)","incomplete dominance (不完全優性)","recessiveness (劣性)","hierarchy (階層)","power dynamics (権力力学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondominance' is a relatively uncommon term that describes the absence of dominance. It is often used in technical or academic contexts, such as genetics or social sciences, to describe situations where there is no clear hierarchy or where multiple factors influence outcomes. Understanding the term requires a grasp of the concept of 'dominance' and the ability to recognize its absence. The word is formed by adding the prefix 'non-' to 'dominance', indicating negation or absence."},"example_sentences":[{"sentence":"The study focused on the effects of nondominance in political systems.","translation":"その研究は、政治システムにおける非優性の影響に焦点を当てた。","type":"general"},{"sentence":"Genetic nondominance can lead to a wide range of phenotypic expressions.","translation":"遺伝的非優性は、広範囲の表現型発現につながる可能性がある。","type":"scientific"},{"sentence":"The organization promotes a culture of nondominance to foster collaboration.","translation":"その組織は、協調を促進するために非優性の文化を推進している。","type":"organizational"}]}