{"word":"capronic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(有機化学)カプロン酸の、またはそれを含む","english_definition":"(organic chemistry) Pertaining to, or containing, caproic acid.","examples":[{"sentence":"Capronic acid is a fatty acid found in goat fat.","translation":"カプロン酸はヤギの脂肪に含まれる脂肪酸です。"},{"sentence":"The capronic ester has a distinct odor.","translation":"カプロン酸エステルは独特の臭いを持つ。"}],"collocations":["capronic acid","capronic ester"],"synonyms":["hexanoic"],"antonyms":[]}],"etymology":{"value":"From 'caproic' + '-nic'. 'Caproic' is derived from Latin 'caper' (goat), referring to the goaty odor of caproic acid.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈprɒnɪk/","syllables":"ca-pron-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than through comparative and superlative forms, which are uncommon for this word."},"usage_notes":{"explanation":"The term 'capronic' is primarily used in the context of organic chemistry to describe substances related to or derived from caproic acid (also known as hexanoic acid). It is not a commonly used word outside of scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food had a capronic taste.","correct":"✓ The food had a caproic taste.","note":"'Capronic' is used to describe the chemical nature, not the taste directly. 'Caproic' would be more appropriate if describing the taste associated with caproic acid."}],"priority":"★☆☆"},"related_words":{"derivatives":["caproic acid (カプロン酸)","caproate (カプロン酸塩)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'capronic' is a technical term used in organic chemistry. It refers to substances related to caproic acid, a fatty acid with a distinctive odor. Understanding this word requires familiarity with chemical nomenclature and contexts related to fatty acids and organic compounds. It is not typically encountered in general English usage.","priority":"★☆☆"},"example_sentences":[{"sentence":"The analysis revealed a significant amount of capronic compounds in the sample.","translation":"分析により、サンプル中にかなりの量のカプロン酸化合物が含まれていることが明らかになった。","type":"adjective","meaning_category":"有機化学"},{"sentence":"Capronic derivatives are often used in the production of fragrances.","translation":"カプロン酸誘導体は、香料の製造によく使用される。","type":"adjective","meaning_category":"有機化学"}]}