{"word":"recurringly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"繰り返し、反復して、再発して","english_definition":"in a way that recurs; repeatedly; happening or appearing again and again.","examples":[{"sentence":"The problem recurringly appeared despite our efforts to fix it.","translation":"その問題は、解決しようと努力したにもかかわらず、繰り返し発生した。"},{"sentence":"She dreamt recurringly about her childhood home.","translation":"彼女は子供時代の家を繰り返し夢に見た。"},{"sentence":"The theme of justice is recurringly present in his novels.","translation":"正義というテーマは、彼の小説に繰り返し現れている。"}],"collocations":["appear recurringly","happen recurringly","dream recurringly","occur recurringly","be present recurringly"],"synonyms":["repeatedly","frequently","periodically","cyclically","iteratively","persistently","constantly"],"antonyms":["infrequently","rarely","occasionally","sporadically","singularly"]}],"etymology":{"value":"The word is formed by adding the suffix '-ly' to the adjective 'recurring'. 'Recurring' comes from the verb 'recur', which originates from the Latin 'recurrere' (re- 'again' + currere 'to run'). Thus, 'recurringly' literally means 'in a running-back-again manner'.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈkɜːrɪŋli/","syllables":"re-cur-ring-ly"},"inflection":{"notes":"As an adverb, 'recurringly' does not have different forms for gender, number, or case."},"usage_notes":{"explanation":"'Recurringly' is used to describe actions, events, or phenomena that happen or appear repeatedly. It emphasizes the repeated nature of something. While similar to 'repeatedly' or 'frequently', 'recurringly' often implies a cyclical or patterned repetition, or a return after an absence. It is often used in more formal or technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pain was recurringly.","correct":"✓ The pain was recurring.","note":"'Recurringly' is an adverb and modifies a verb, adjective, or another adverb. 'Recurring' is an adjective and can modify a noun directly or be used after a linking verb like 'was'."},{"incorrect":"✗ He visited her recurringly every Tuesday.","correct":"✓ He visited her every Tuesday. / ✓ He visited her recurringly.","note":"Using 'recurringly' with a specific frequency (e.g., 'every Tuesday') can be redundant. Choose either the specific frequency or 'recurringly' to emphasize the repetition."}],"priority":"★★☆"},"related_words":{"derivatives":["recur (verb): to occur again, especially after an interruption or a period of absence.","recurrence (noun): the fact of occurring again.","recurring (adjective): occurring again periodically or repeatedly.","recurrent (adjective): happening often or repeatedly.","recursion (noun): the repeated application of a recursive procedure or definition.","recursive (adjective): characterized by recursion or a recursive procedure."],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in formal writing and specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Recurringly' means 'in a way that happens again and again'. It is used to describe things that repeat, often in a pattern. This word is more formal and less common than words like 'repeatedly' or 'frequently'. You might find it in books or articles that discuss patterns, problems that keep coming back, or memories that keep appearing in your mind. Because it's not a very common word, it's more likely to be used by advanced English speakers or writers."},"example_sentences":[{"sentence":"The symptoms of the disease appeared recurringly, making diagnosis difficult.","translation":"その病気の症状は繰り返し現れ、診断を困難にした。","type":"adverb","meaning_category":"反復して"},{"sentence":"The same themes are recurringly explored in the artist's later works.","translation":"同じテーマが、その芸術家の後の作品で繰り返し探求されている。","type":"adverb","meaning_category":"繰り返し"},{"sentence":"The software checks for updates recurringly to ensure the system is secure.","translation":"そのソフトウェアは、システムが安全であることを保証するために、繰り返しアップデートを確認する。","type":"adverb","meaning_category":"再発して"}]}