{"word":"short-jointed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(動物、特に馬について)管骨が短い","english_definition":"(of an animal, especially a horse) having short pasterns.","examples":[{"sentence":"The horse was rejected because it was short-jointed.","translation":"その馬は管骨が短いという理由で不合格になった。"},{"sentence":"A short-jointed horse is more prone to concussion.","translation":"管骨の短い馬は震盪を起こしやすい。"}],"collocations":["short-jointed horse"],"synonyms":["short-pasterned"],"antonyms":["long-jointed","long-pasterned"]}],"etymology":{"value":"'short' + 'jointed'. Refers to the short pastern bone in animals.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʃɔːrt ˈdʒɔɪntɪd/","syllables":"short-join-ted"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"Typically used in the context of animal husbandry, especially when describing horses. The length of the pastern (the area between the fetlock and the hoof) is an important characteristic affecting the animal's movement and susceptibility to injury.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The short-jointed man had trouble reaching the top shelf.","correct":"✓ The short-armed man had trouble reaching the top shelf.","note":"'Short-jointed' refers specifically to the pasterns of animals, not to human limbs. Use 'short-armed' or 'short-statured' to describe a person."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pastern","fetlock","cannon bone"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"The term 'short-jointed' is a specialized adjective primarily used in the context of animal anatomy, particularly in describing horses. It refers to the condition where an animal has short pasterns (the part of the leg between the fetlock and the hoof). Due to its niche usage, it is not commonly encountered in general language and is more likely to be found in texts related to veterinary science, horse breeding, or equestrian sports."},"example_sentences":[{"sentence":"The vet noted that the mare was slightly short-jointed.","translation":"獣医は、その牝馬の管骨がやや短いと指摘した。","type":"adjective","meaning_category":"animal anatomy"},{"sentence":"Short-jointedness can predispose a horse to certain types of lameness.","translation":"管骨が短いことは、馬を特定の種類の跛行になりやすくする可能性がある。","type":"adjective","meaning_category":"animal health"}]}