{"word":"braising","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(料理) ブレイズ、蒸し煮","english_definition":"A cooking method in which food is first browned in fat, then cooked slowly in a covered dish with a small amount of liquid.","examples":[{"sentence":"Braising is a great way to tenderize tough cuts of meat.","translation":"ブレイズは、硬い肉を柔らかくするのに最適な方法です。"},{"sentence":"She used braising to cook the short ribs.","translation":"彼女はブレイズでショートリブを調理しました。"}],"collocations":["beef braising","vegetable braising","slow braising"],"synonyms":["stewing","pot-roasting"],"antonyms":["grilling","frying"]},{"part_of_speech":"verb","definition":"(動詞 braise の現在分詞) ブレイズする、蒸し煮にする","english_definition":"Cooking food by browning it in fat and then simmering it slowly in a covered dish with a small amount of liquid.","examples":[{"sentence":"He is braising the chicken with vegetables.","translation":"彼は鶏肉を野菜と一緒に蒸し煮にしています。"},{"sentence":"She enjoys braising meats in the winter.","translation":"彼女は冬に肉を蒸し煮にするのが好きです。"}],"collocations":["braising beef","braising vegetables","braising in red wine"],"synonyms":["stewing","pot-roasting"],"antonyms":["grilling","frying"]}],"etymology":{"value":"From the French word \"braiser,\" which means \"to braise.\" The origin of \"braiser\" is uncertain, but it may be related to the word \"braise,\" meaning embers or hot coals, referring to the traditional method of cooking over embers.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbreɪzɪŋ/","syllables":"brais-ing"},"inflection":{"verb_forms":{"present_simple":["braise","braises"],"past_simple":"braised","past_participle":"braised","present_participle":"braising"}},"usage_notes":{"explanation":"'Braising' refers to a cooking technique that combines both dry and moist heat. Typically, the food is first seared or browned at a high temperature, and then finished in a covered pot with some liquid at a lower temperature. This method is particularly effective for tougher cuts of meat, as it helps to break down the connective tissues and make the meat more tender.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm boiling the meat for hours, is that braising?","correct":"✓ I'm braising the meat, first searing it and then simmering it in liquid.","note":"Braising involves browning the meat first, then simmering in liquid. Boiling is just simmering in liquid without the initial browning."},{"incorrect":"✗ Braising is the same as grilling.","correct":"✓ Braising is different from grilling; it uses both dry and moist heat.","note":"Braising uses both dry and moist heat, while grilling uses only dry heat."}],"priority":"★★☆"},"related_words":{"derivatives":["braise (verb)","braised (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Braising' is a cooking term that refers to a specific method of cooking food. It involves first searing or browning the food at a high temperature, and then cooking it slowly in a covered pot with a small amount of liquid. This method is often used for tougher cuts of meat to make them more tender. Understanding this term is useful for following recipes or discussing cooking techniques."},"example_sentences":[{"sentence":"She is **braising** the lamb shanks in red wine.","translation":"彼女はラムシャンクを赤ワインで蒸し煮にしている。","type":"verb","meaning_category":"蒸し煮にする"},{"sentence":"**Braising** is a good method for cooking tougher cuts of meat.","translation":"蒸し煮は、硬い肉を調理するのに適した方法です。","type":"noun","meaning_category":"蒸し煮"},{"sentence":"The **braising** liquid was rich and flavorful.","translation":"蒸し煮の液体は濃厚で風味豊かだった。","type":"adjective (implied)","meaning_category":"蒸し煮の"}]}