{"word":"conversancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"精通、熟知、知識、親交","english_definition":"Familiarity or acquaintance with a subject; knowledge; intimacy; close association.","examples":[{"sentence":"He has a great conversancy with modern literature.","translation":"彼は現代文学に非常に精通している。"},{"sentence":"Her conversancy with the local customs made her an excellent guide.","translation":"彼女は地元の習慣に精通していたので、素晴らしいガイドになった。"},{"sentence":"His conversancy with the latest technology is impressive.","translation":"彼の最新技術への精通ぶりは目覚ましい。"}],"collocations":["have conversancy with","demonstrate conversancy","show conversancy","conversancy in a subject","conversancy with a topic"],"synonyms":["familiarity","knowledge","intimacy","acquaintance","proficiency","expertise"],"antonyms":["ignorance","unfamiliarity","inexperience"]}],"etymology":{"value":"From 'conversant', which comes from the Latin word 'conversari', meaning 'to associate with, dwell with', which in turn comes from 'con-' (with) and 'versari' (to dwell, live, be occupied in).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈvɜːrsənsi/","syllables":"con-ver-san-cy"},"inflection":{"noun_plural":"conversancies (rarely used)"},"usage_notes":{"explanation":"'Conversancy' refers to a state of being well-acquainted with a particular subject or topic. It implies a level of knowledge and understanding that allows one to discuss it intelligently. It is a somewhat formal word and is not as commonly used as synonyms like 'familiarity' or 'knowledge'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good conversation with the topic.","correct":"✓ He has a good conversancy with the topic.","note":"'Conversancy' refers to familiarity or knowledge, not the act of conversing. Use 'conversancy with' to indicate familiarity with a subject."},{"incorrect":"✗ She is conversancy in French.","correct":"✓ She has conversancy in French. / ✓ She is conversant in French.","note":"'Conversancy' is a noun and requires a verb such as 'has'. Alternatively, use 'conversant' (adjective) with the verb 'to be'."}],"priority":"★★☆"},"related_words":{"derivatives":["conversant (adjective: familiar with; knowledgeable about)","converse (verb: to engage in conversation; noun: a conversation)","conversation (noun: a discussion between two or more people)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conversancy' is a formal noun that means a state of being familiar with or knowledgeable about a particular subject. It's not a commonly used word in everyday conversation, but it's useful for expressing a deep understanding or expertise in a specific area. For example, 'He demonstrated a high degree of conversancy with the intricacies of quantum physics.' This word is more often found in academic or technical writing."},"example_sentences":[{"sentence":"Her **conversancy** with ancient Greek literature was evident in her insightful analysis.","translation":"彼女の古代ギリシャ文学への精通ぶりは、彼女の洞察力に富んだ分析に明らかだった。","type":"noun","meaning_category":"精通"},{"sentence":"The consultant's **conversancy** in financial markets made him a valuable asset to the company.","translation":"コンサルタントの金融市場への精通ぶりは、彼を会社にとって貴重な財産にした。","type":"noun","meaning_category":"知識"},{"sentence":"A high level of **conversancy** with data privacy laws is essential for anyone working in the tech industry.","translation":"データプライバシー法への高いレベルの精通は、テクノロジー業界で働くすべての人にとって不可欠です。","type":"noun","meaning_category":"熟知"}]}