{"word":"Hogmace","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A common name for plants of the genus Typha, especially Typha latifolia, also known as cattails, bulrushes, or reedmace.","english_definition":"A common name for plants of the genus Typha, especially Typha latifolia.","examples":[{"sentence":"The hogmace swayed gently in the breeze along the marshy edge of the lake.","translation":"ガマの穂が湖の湿った縁に沿ってそよ風に優しく揺れた。"}],"collocations":["stands of hogmace","harvesting hogmace","hogmace pollen"],"synonyms":["cattail","bulrush","reedmace"],"antonyms":[]}],"etymology":{"value":"The term 'hogmace' likely combines 'hog' (referring to a coarse or wild quality) with 'mace' (referring to the club-like appearance of the seed head).","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɒɡmeɪs","syllables":"hog-mace"},"inflection":{"noun_plural":"hogmaces"},"usage_notes":{"explanation":"'Hogmace' is a less common name for cattails, especially in certain regions or older texts. The more common names are cattail, bulrush, or reedmace. It refers to the plant's characteristic brown, sausage-shaped seed head.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw many hogmaces growing in the desert.","correct":"✓ I saw many hogmaces growing near the lake.","note":"Hogmace (cattails) typically grow in wet environments like marshes, swamps, and along the edges of lakes and ponds, not in deserts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hogmace' is a relatively uncommon term for cattails, primarily used in specific regions or older texts. Understanding this term requires familiarity with botanical nomenclature and regional variations in plant names. While not essential for general English comprehension, it may be encountered in specialized contexts such as ecology, botany, or historical literature."},"example_sentences":[{"sentence":"The children enjoyed playing among the tall hogmace at the edge of the pond.","translation":"子供たちは池の端にある背の高いガマの間で遊ぶのを楽しんだ。","type":"noun","meaning_category":"plant name"},{"sentence":"The artist painted a serene landscape featuring hogmace in the foreground.","translation":"その画家は、前景にガマを描いた穏やかな風景を描いた。","type":"noun","meaning_category":"plant name"}]}