{"word":"Periastral","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"恒星に最も接近した軌道にある、またはそれに関連する","english_definition":"Relating to or being at the point in an orbit nearest to a star.","examples":[{"sentence":"The periastral distance of the exoplanet is crucial for determining its habitability.","translation":"その系外惑星の近日点距離は、居住可能性を判断する上で重要である。"},{"sentence":"The satellite reached its periastral point, allowing for high-resolution images of the star.","translation":"その衛星は近日点に到達し、恒星の高解像度画像を撮影することができた。"}],"collocations":["periastral distance","periastral passage","periastral velocity"],"synonyms":["closest approach","nearest point","stellar proximity"],"antonyms":["apoastral","apastron","farthest point"]}],"etymology":{"value":"Derived from the Greek words 'peri' (near) and 'astron' (star).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛriˈæstrəl/","syllables":"per-i-as-tral"},"inflection":{"notes":"This word is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Periastral' is used specifically in the context of orbits around stars, distinguishing it from 'perihelion' (orbit around the Sun) and 'perigee' (orbit around the Earth). It is commonly used in astrophysics and astronomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The periastral of the moon.","correct":"The perigee of the moon.","note":"'Periastral' is for orbits around stars; use 'perigee' for the moon's orbit around the Earth."},{"incorrect":"The planet's periastral was the farthest point from the star.","correct":"The planet's periastral was the closest point to the star.","note":"'Periastral' refers to the closest, not farthest, point in the orbit."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["perihelion","perigee","apastron","apoastral"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'periastral' is a technical term used in astronomy and astrophysics to describe the point in an orbit that is closest to a star. It is important to use this term correctly in the context of stellar orbits, distinguishing it from similar terms like 'perihelion' and 'perigee' that apply to orbits around the Sun and Earth, respectively."},"example_sentences":[{"sentence":"The spacecraft will perform its closest observations of the star during its periastral passage.","translation":"宇宙船は近日点通過中に、その恒星の最も近い観測を行う予定である。","type":"general","meaning_category":"astronomy"},{"sentence":"Calculating the periastral velocity is essential for understanding the dynamics of the binary star system.","translation":"近日点速度の計算は、連星系の力学を理解するために不可欠である。","type":"technical","meaning_category":"astrophysics"}]}