{"word":"humiliatingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"屈辱的に、恥ずかしい思いをさせるように","english_definition":"in a way that causes someone to feel ashamed and foolish; in a humiliating manner.","examples":[{"sentence":"He was humiliatingly defeated in the election.","translation":"彼は選挙で屈辱的な敗北を喫した。"},{"sentence":"She was humiliatingly ignored at the party.","translation":"彼女はパーティーで屈辱的に無視された。"},{"sentence":"The team lost humiliatingly to their rivals.","translation":"チームはライバルに屈辱的な負け方をした。"}],"collocations":["humiliatingly defeated","humiliatingly ignored","humiliatingly treated"],"synonyms":["shamefully","disgracefully","degrading","mortifyingly","embarrassingly"],"antonyms":["respectfully","proudly","honorably"]}],"etymology":{"value":"The word 'humiliatingly' is formed by adding the suffix '-ly' to the adjective 'humiliating'. 'Humiliating' comes from the verb 'humiliate', which originates from the Latin word 'humiliare', meaning 'to humble' or 'to lower'. 'Humilis' in Latin means 'low' or 'humble', related to 'humus' meaning 'earth' or 'ground'. Therefore, 'humiliatingly' describes an action or situation that lowers someone's pride or dignity, bringing them down to earth in a shameful way.","priority":"★★☆"},"pronunciation":{"ipa":"/hjuːˈmɪliˌeɪtɪŋli/","syllables":"hu-mil-i-at-ing-ly"},"inflection":{"notes":"Adverbs do not inflect. This is the adverbial form of the adjective 'humiliating'."},"usage_notes":{"explanation":"'Humiliatingly' is used to describe the manner in which something happens, emphasizing that it causes a feeling of shame or loss of dignity. It often describes defeats, failures, or situations where someone is treated poorly in public. The adverb adds emphasis to the level of embarrassment or shame involved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was humiliating at the interview.","correct":"✓ He was humiliated at the interview. / ✓ He behaved humiliatingly at the interview.","note":"'Humiliating' is an adjective describing something that causes humiliation. 'Humiliated' is a past participle adjective describing someone who feels humiliated. 'Humiliatingly' is an adverb describing how something is done. The correct form depends on the intended meaning."},{"incorrect":"✗ She felt humiliatingly.","correct":"✓ She felt humiliated.","note":"'Humiliatingly' describes an action, not a feeling. Use 'humiliated' to describe how someone feels."}],"priority":"★★☆"},"related_words":{"derivatives":["humiliate (verb): to make someone feel ashamed and foolish.","humiliating (adjective): causing someone to feel ashamed and foolish.","humiliation (noun): the act of making someone feel ashamed and foolish, or the state of being humiliated."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"humiliatingly\" is an adverb that describes an action or situation in a way that causes someone to feel deeply ashamed, embarrassed, or foolish. It suggests a significant loss of dignity or pride. This word is more complex and less common, typically found in contexts describing severe embarrassment or defeat. Understanding the root word \"humiliate\" and its related forms is helpful for grasping the meaning of \"humiliatingly.\""},"example_sentences":[{"sentence":"The team was **humiliatingly** defeated in the championship game, losing by a wide margin.","translation":"チームは選手権試合で大差で負け、屈辱的な敗北を喫した。","type":"adverb","meaning_category":"Defeat"},{"sentence":"She was **humiliatingly** asked to leave the meeting after her inappropriate comments.","translation":"彼女は不適切な発言の後、会議から屈辱的に退席を求められた。","type":"adverb","meaning_category":"Rejection"},{"sentence":"He was **humiliatingly** exposed as a fraud in front of his colleagues.","translation":"彼は同僚の前で詐欺師として屈辱的に暴露された。","type":"adverb","meaning_category":"Exposure"}]}