{"word":"scarlet-day","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史的) オックスフォード大学またはケンブリッジ大学において、博士号取得者が緋色のガウンを着用する日","english_definition":"(historical) A day at Oxford or Cambridge University when doctors wear scarlet gowns.","examples":[{"sentence":"The annual scarlet-day ceremony was a sight to behold, with academics adorned in their vibrant doctoral robes.","translation":"毎年恒例の緋色の日の式典は、学者たちが鮮やかな博士号のローブを身に着けている光景は一見の価値があった。"}],"collocations":["scarlet-day ceremony","annual scarlet-day"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Scarlet' refers to the color of the gowns worn by doctors, and 'day' refers to the specific occasion or day when these gowns are worn.","priority":"N/A"},"pronunciation":{"ipa":"/ˈskɑːrlətˌdeɪ/","syllables":"scar-let-day"},"inflection":{"noun_plural":"scarlet-days"},"usage_notes":{"explanation":"The term 'scarlet-day' is primarily historical and specific to the traditions of Oxford and Cambridge Universities. It refers to a ceremonial occasion where individuals who have earned a doctoral degree wear scarlet gowns, signifying their academic achievement. This term is not commonly used in modern contexts outside of discussions about the history and traditions of these universities.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["scarlet (adjective, noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'scarlet-day' refers to a historical tradition at Oxford and Cambridge Universities, where doctoral graduates wear scarlet gowns on a specific ceremonial day. Due to its historical and academic context, it is not commonly used in everyday language and is more likely to be encountered in literature or discussions related to the history of these universities."},"example_sentences":[{"sentence":"The old photographs depicted a vibrant scarlet-day procession at Oxford University in the early 20th century.","translation":"古い写真は、20世紀初頭のオックスフォード大学での鮮やかな緋色の日の行列を描いていた。","type":"noun","meaning_category":"ceremonial occasion"}]}