{"word":"GHQ","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"連合国軍最高司令部","english_definition":"General Headquarters; the supreme command of the Allied powers in occupied Japan after World War II.","examples":[{"sentence":"GHQ implemented numerous reforms in postwar Japan.","translation":"GHQは戦後の日本で数多くの改革を実施した。"},{"sentence":"The decisions made by GHQ had a lasting impact on Japanese society.","translation":"GHQによってなされた決定は、日本社会に永続的な影響を与えた。"}],"collocations":["GHQ directives","GHQ reforms","GHQ occupation","GHQ policies"],"synonyms":["Supreme Commander for the Allied Powers (SCAP)"],"antonyms":[]}],"etymology":{"value":"Abbreviation of General Headquarters.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiː eɪtʃ ˈkjuː/","syllables":"G-H-Q"},"inflection":{"noun_plural":"GHQs"},"usage_notes":{"explanation":"GHQ refers specifically to the headquarters of the Allied occupation forces in Japan after World War II. It's a historical term with significant political and social implications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Japanese government made all the decisions after the war.","correct":"✓ GHQ initially made many key decisions after the war.","note":"GHQ held considerable power in the early postwar years."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["SCAP","occupation","postwar Japan","Allied powers"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, mainly used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"GHQ is a term primarily used in historical discussions about the Allied occupation of Japan following World War II. Understanding its role is crucial for comprehending the significant political and social changes that occurred during that period. It is not a commonly used term in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The **GHQ** implemented land reform policies to redistribute wealth.","translation":"GHQは富を再分配するために農地改革政策を実施した。","type":"noun","meaning_category":"連合国軍最高司令部"},{"sentence":"Many Japanese remember the **GHQ** era as a time of both hardship and progress.","translation":"多くの日本人は、GHQ時代を苦難と進歩の時代として記憶している。","type":"noun","meaning_category":"連合国軍最高司令部"}]}