{"word":"barbecues","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"バーベキュー (複数形)","english_definition":"plural of barbecue: an outdoor meal or party where food is cooked on a grill; a grill used for cooking food outdoors.","examples":[{"sentence":"We're having barbecues every weekend this summer.","translation":"この夏は毎週末バーベキューをする予定です。"},{"sentence":"They sell barbecues of various sizes at the hardware store.","translation":"金物店では様々なサイズのバーベキューグリルを販売しています。"}],"collocations":["summer barbecues","backyard barbecues","family barbecues","attend barbecues","host barbecues"],"synonyms":["cookouts","grills","BBQs"],"antonyms":[]},{"part_of_speech":"verb","definition":"バーベキューをする (三人称単数現在)","english_definition":"third-person singular simple present indicative form of barbecue: to cook food on a grill, especially outdoors.","examples":[{"sentence":"He barbecues every Sunday, rain or shine.","translation":"彼は雨の日も晴れの日も毎週日曜日にバーベキューをします。"},{"sentence":"She barbecues chicken and vegetables for a healthy meal.","translation":"彼女は健康的な食事のために鶏肉と野菜をバーベキューします。"}],"collocations":["barbecues chicken","barbecues burgers","barbecues steaks","barbecues vegetables"],"synonyms":["grills","cooks out","BBQs"],"antonyms":[]}],"etymology":{"value":"Derived from the Spanish word 'barbacoa', which originally referred to a framework of sticks set upon posts. This framework was used by the Taino people of the Caribbean for raising meat above a fire for slow-cooking. The word evolved to refer to both the cooking method and the social event associated with it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːrbɪkjuːz/","syllables":"bar-bi-cues"},"inflection":{"noun_plural":"barbecues","verb_third_person_singular":"barbecues","verb_present_participle":"barbecuing","verb_past_simple":"barbecued","verb_past_participle":"barbecued"},"usage_notes":{"explanation":"'Barbecues' can refer to multiple instances of the event (noun) or the action of cooking on a barbecue (verb, third-person singular). It's commonly used to describe social gatherings centered around grilling food outdoors. The term is often shortened to 'BBQs'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We are going to a barbecue this weekend. Let's bring barbecues.","correct":"✓ We are going to a barbecue this weekend. Let's bring barbecue sauce.","note":"'Barbecues' as a plural noun refers to multiple barbecue events or grills, not barbecue sauce. If you're bringing something to a barbecue, it's more likely to be barbecue sauce or other food items."},{"incorrect":"✗ He barbecues very good.","correct":"✓ He barbecues very well.","note":"When using 'barbecues' as a verb, use the adverb 'well' to describe how he barbecues, not the adjective 'good'."}],"priority":"★★☆"},"related_words":{"derivatives":["barbecue (singular noun and verb)","barbecuing (gerund/present participle)","barbecued (past tense/past participle)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"A2","frequency_google_ngram":"Medium frequency","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"'Barbecues' is a common word that refers to outdoor cooking events. It's the plural form of 'barbecue'. You can use it to talk about having multiple barbecue parties or the grills themselves. When used as a verb, 'barbecues' is the third-person singular form, like 'He barbecues'. It's an easy word to understand in the context of summer gatherings and grilling food.","priority":"★★★"},"example_sentences":[{"sentence":"The family enjoys having barbecues in the summer.","translation":"家族は夏にバーベキューをするのを楽しんでいます。","type":"noun","meaning_category":"バーベキュー (複数形)"},{"sentence":"She barbecues salmon for a healthy and delicious meal.","translation":"彼女は健康でおいしい食事のために鮭をバーベキューします。","type":"verb","meaning_category":"バーベキューをする (三人称単数現在)"},{"sentence":"They bought new barbecues for their outdoor kitchen.","translation":"彼らは屋外キッチン用に新しいバーベキューグリルを買いました。","type":"noun","meaning_category":"バーベキュー (複数形)"}]}