{"word":"outdeviled","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)出し抜く、打ち負かす（特に悪知恵や策略において）","english_definition":"To surpass or outdo (someone) in wickedness, cunning, or devilry; to outsmart by using devious or evil means.","examples":[{"sentence":"He thought he was cunning, but she outdeviled him at every turn.","translation":"彼は自分がずる賢いと思っていたが、彼女はあらゆる場面で彼を出し抜いた。"},{"sentence":"The villain attempted to outdeviled the hero, but good ultimately prevailed.","translation":"悪役は主人公を出し抜こうと試みたが、最終的には善が勝利した。"}],"collocations":["outdeviled someone in a scheme","outdeviled someone with cunning","outdeviled someone at their own game"],"synonyms":["outsmart","outwit","outmaneuver","trick","deceive","surpass in cunning"],"antonyms":["be honest","be forthright","be straightforward"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（料理）デビルドエッグよりもさらにスパイシーにする、または複雑な味付けにする","english_definition":"To make (food, especially deviled eggs) even more spicy or elaborately seasoned than usual.","examples":[{"sentence":"She outdeviled the deviled eggs by adding a touch of habanero pepper.","translation":"彼女はハバネロペッパーを少し加えて、デビルドエッグをさらにスパイシーにした。"},{"sentence":"The chef outdeviled the dish with a complex blend of spices and herbs.","translation":"シェフは複雑なスパイスとハーブのブレンドで料理をさらに複雑な味付けにした。"}],"collocations":["outdeviled deviled eggs","outdeviled a dish with spices","outdeviled a recipe"],"synonyms":["enhance flavor","spice up","season intensely"],"antonyms":["tone down","milder seasoning"]}],"etymology":{"value":"The word 'outdeviled' is formed by combining the prefix 'out-' (meaning to surpass or exceed) with the verb 'deviled.' 'Deviled' itself refers to food that is prepared with hot or spicy seasonings, often associated with the devil due to the fiery nature of the spices. The term likely originated in the 18th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈdevɪld/","syllables":"out-dev-iled"},"inflection":{"verb_forms":{"present_simple":["outdevil","outdevils"],"past_simple":"outdeviled","past_participle":"outdeviled","present_participle":"outdeviling"}},"usage_notes":{"explanation":"The word 'outdeviled' is relatively rare and somewhat humorous. It is used to describe surpassing someone in cunning or wickedness, or to indicate that food has been made exceptionally spicy or elaborately seasoned. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outdeviled the situation by being nice.","correct":"✓ He outmaneuvered the situation by being cunning.","note":"'Outdeviled' implies using devious or cunning means, not being nice. Use 'outmaneuvered' or 'outsmarted' instead."},{"incorrect":"✗ She outdeviled the cake with too much sugar.","correct":"✓ She enhanced the cake with a complex frosting.","note":"When referring to food, 'outdeviled' implies adding spices or complex seasonings, not just sugar. Use 'enhanced' or 'improved' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["devil (noun, verb)","deviled (adjective)","devilry (noun)"],"phrases":["deviled eggs","speak of the devil"],"related_concepts":["Machiavellianism","cunning","wickedness","spicy food"]},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'outdeviled' is an uncommon and somewhat playful term. It means either to surpass someone in wickedness or cunning, or to make food (especially deviled eggs) exceptionally spicy or elaborately seasoned. Due to its rarity, it is more likely to be encountered in literature or specialized contexts rather than everyday conversation. Understanding the etymology helps in grasping its meaning, as it combines 'out-' with 'deviled,' which itself implies a fiery or cunning nature."},"example_sentences":[{"sentence":"The con artist outdeviled his victims with a series of elaborate scams.","translation":"その詐欺師は一連の巧妙な詐欺で被害者たちを出し抜いた。","type":"verb","meaning_category":"outsmart"},{"sentence":"My grandmother outdeviled her deviled eggs recipe by adding a secret blend of spices.","translation":"私の祖母は秘密のスパイスをブレンドして、デビルドエッグのレシピをさらにスパイシーにした。","type":"verb","meaning_category":"season intensely"}]}