{"word":"partible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"分割可能な、分けられる","english_definition":"capable of being divided or separated into parts.","examples":[{"sentence":"The inheritance was partible among the siblings.","translation":"相続財産は兄弟姉妹の間で分割可能だった。"},{"sentence":"Land is often considered a partible asset.","translation":"土地はしばしば分割可能な資産とみなされる。"}],"collocations":["partible inheritance (分割可能な相続財産)","partible asset (分割可能な資産)"],"synonyms":["divisible","separable","fragmentable"],"antonyms":["impartible","indivisible","inseparable"]}],"etymology":{"value":"Late Middle English: from late Latin partibilis, from Latin partiri ‘divide into parts’, from pars ‘a part’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrtɪbəl/","syllables":"par-ti-ble"},"inflection":{"notes":"Adjective, so it has comparative and superlative forms (more partible, most partible), though they are rarely used."},"usage_notes":{"explanation":"'Partible' is a relatively uncommon word that specifically describes something capable of being divided into parts. It's often used in legal or financial contexts when discussing assets or inheritances. The opposite of 'partible' is 'impartible' or 'indivisible'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The team's spirit was partible after the loss.","correct":"✓ The team's spirit was shattered after the loss.","note":"'Partible' refers to physical or conceptual division, not emotional states. Use words like 'shattered' or 'broken' for emotions."}],"priority":"★☆☆"},"related_words":{"derivatives":["partibility (noun: the quality of being partible)","partition (verb/noun: to divide into parts)","part (noun: a piece or element of a whole)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Partible' is a formal word meaning something can be divided. It's not used very often in everyday conversation. You'll mostly find it in legal or financial writing when talking about dividing property or assets. It's the opposite of 'indivisible', which means something cannot be divided."},"example_sentences":[{"sentence":"The kingdom was declared partible among the king's sons.","translation":"王国は王の息子たちの間で分割可能であると宣言された。","type":"adjective","meaning_category":"divisible"},{"sentence":"Whether the debt is partible under the law is a matter of legal interpretation.","translation":"その債務が法律の下で分割可能であるかどうかは、法律解釈の問題である。","type":"adjective","meaning_category":"divisible"}]}