{"word":"king-post","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(建築) キングポスト、大束","english_definition":"(architecture) A central vertical post in a truss, extending from the apex of the truss to the tie beam below.","examples":[{"sentence":"The king-post supports the center of the roof truss.","translation":"キングポストは屋根トラスの中央を支えます。"},{"sentence":"The design features a prominent king-post truss.","translation":"そのデザインは、目立つキングポストトラスを特徴としています。"}],"collocations":["king-post truss","central king-post","king-post roof","king-post construction"],"synonyms":["center post","principal post","hanging post"],"antonyms":[],"notes":"Often used in timber framing and roof construction."}],"etymology":{"value":"Derived from the 'king' referring to its central and principal role, and 'post' referring to its vertical structural element.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɪŋˌpoʊst/","syllables":"king-post"},"inflection":{"noun_plural":"king-posts"},"usage_notes":{"explanation":"A king-post is a critical component in a truss system, bearing significant load and transferring weight from the apex of the roof to the supporting tie beam. It is most commonly found in traditional timber-framed structures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The queen post is in the center.","correct":"✓ The king-post is in the center.","note":"Ensure you are using the correct terminology. A queen post is different from a king-post and located off-center in a truss."}],"priority":"★★☆"},"related_words":{"derivatives":["king post truss","queen-post (related but different structural element)","truss","tie beam"],"related_terms":["beam","rafter","strut","timber framing"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'King-post' is a technical term used in architecture and construction, specifically related to truss systems. Understanding requires familiarity with basic structural engineering concepts. It refers to a central vertical post that plays a key role in distributing weight in a roof truss. Not commonly used outside of technical contexts."},"example_sentences":[{"sentence":"The carpenter installed a sturdy king-post to support the roof.","translation":"大工は屋根を支えるために頑丈なキングポストを取り付けました。","type":"example","meaning_category":"structural support"},{"sentence":"The old barn featured a traditional king-post truss design.","translation":"その古い納屋は、伝統的なキングポストトラスのデザインを特徴としていました。","type":"example","meaning_category":"architectural design"}]}