{"word":"Plasmodium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プラスモジウム属（マラリア原虫）","english_definition":"A genus of parasitic protozoa, many of which are responsible for causing malaria in humans and other animals.","examples":[{"sentence":"Plasmodium falciparum is the most dangerous species of Plasmodium that causes malaria.","translation":"熱帯熱マラリア原虫（Plasmodium falciparum）は、マラリアを引き起こすプラスモジウム属の中で最も危険な種です。"},{"sentence":"The life cycle of Plasmodium involves both mosquitoes and vertebrate hosts.","translation":"プラスモジウムの生活環には、蚊と脊椎動物の宿主の両方が関与しています。"},{"sentence":"Microscopic examination of blood samples is used to detect Plasmodium parasites.","translation":"血液サンプルの顕微鏡検査は、プラスモジウム原虫を検出するために使用されます。"}],"collocations":["Plasmodium falciparum (熱帯熱マラリア原虫)","Plasmodium vivax (三日熱マラリア原虫)","Plasmodium malariae (四日熱マラリア原虫)","Plasmodium ovale (卵形マラリア原虫)","Plasmodium infection (プラスモジウム感染)","Plasmodium parasite (プラスモジウム原虫)","life cycle of Plasmodium (プラスモジウムの生活環)"],"synonyms":["malaria parasite"],"antonyms":[]},{"part_of_speech":"noun","definition":"粘菌の一形態（変形体）","english_definition":"A multinucleate mass of protoplasm characteristic of some stages in the life cycle of slime molds.","examples":[{"sentence":"The plasmodium of a slime mold creeps along the forest floor, engulfing bacteria and other organic matter.","translation":"粘菌の変形体は、森林の地面を這い回り、バクテリアや他の有機物を飲み込みます。"},{"sentence":"The plasmodium stage is a feeding stage in the slime mold life cycle.","translation":"変形体期は、粘菌の生活環における摂食期です。"},{"sentence":"The bright yellow plasmodium was easily visible against the dark soil.","translation":"鮮やかな黄色の変形体は、暗い土壌に対して容易に視認できました。"}],"collocations":["slime mold plasmodium (粘菌の変形体)","feeding plasmodium (摂食変形体)","multinucleate plasmodium (多核変形体)"],"synonyms":["syncytium","myxamoeba"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'plasma' (πλάσμα), meaning 'something molded or formed,' and '-odium,' a suffix used in biological classification.","priority":"★★☆"},"pronunciation":{"ipa":"/plæzˈmoʊdiəm/","syllables":"plaz-mo-di-um"},"inflection":{"noun_plural":"plasmodia or plasmodiums"},"usage_notes":{"explanation":"The term 'Plasmodium' primarily refers to a genus of parasitic protozoa that cause malaria. However, it can also refer to a specific stage in the life cycle of slime molds, which is a multinucleate mass of protoplasm. The context usually makes it clear which meaning is intended. In medical and veterinary contexts, it almost always refers to the malaria-causing parasite.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Plasmodium is a bacteria.","correct":"✓ Plasmodium is a protozoan parasite.","note":"Plasmodium is a eukaryotic protozoan parasite, not a bacterium. It has a complex cellular structure, unlike bacteria. "},{"incorrect":"✗ Plasmodium only infects humans.","correct":"✓ Plasmodium infects humans and other animals.","note":"While Plasmodium is well-known for causing malaria in humans, it also infects various other animals, including birds and reptiles, depending on the Plasmodium species."}],"priority":"★★☆"},"related_words":{"derivatives":["plasmodial (adjective: relating to or resembling a plasmodium)"],"phrasal_verbs":[],"related_terms":["malaria","protozoa","parasite","vector","mosquito","sporozoite","merozoite","trophozoite","gametocyte","schizont","myxomycete","slime mold"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plasmodium' is a technical term primarily used in biology, medicine, and veterinary science. It generally refers to a genus of parasitic protozoa responsible for causing malaria. Understanding this term requires knowledge of basic biology, particularly parasitology and microbiology. It is also used in mycology to describe a stage in the life cycle of slime molds. Because of its specialized usage, it is not commonly encountered in general English texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The diagnosis of malaria requires the identification of **Plasmodium** parasites in blood smears.","translation":"マラリアの診断には、血液塗抹標本中のプラスモジウム原虫の同定が必要です。","type":"noun","meaning_category":"マラリア原虫"},{"sentence":"The **Plasmodium** of the slime mold moved slowly across the decaying log.","translation":"粘菌の変形体は、腐った丸太の上をゆっくりと移動しました。","type":"noun","meaning_category":"粘菌の変形体"},{"sentence":"Researchers are working to develop new drugs to target different stages of the **Plasmodium** life cycle.","translation":"研究者たちは、プラスモジウムの生活環のさまざまな段階を標的とする新しい薬を開発するために取り組んでいます。","type":"noun","meaning_category":"マラリア原虫"},{"sentence":"The **plasmodial** slime mold exhibited chemotaxis towards a food source.","translation":"その変形菌は、食物源に向かって走化性を示した。","type":"adjective (plasmodial)","meaning_category":"変形体に関する"}]}