{"word":"moisturizer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"保湿剤、モイスチャライザー","english_definition":"a cream or lotion used to prevent the skin from becoming dry.","examples":[{"sentence":"She applies moisturizer every morning and evening.","translation":"彼女は毎朝晩、保湿剤を塗ります。"},{"sentence":"This moisturizer is suitable for sensitive skin.","translation":"この保湿剤は敏感肌に適しています。"},{"sentence":"Use a moisturizer with SPF to protect your skin from the sun.","translation":"日焼けから肌を守るために、SPF入りの保湿剤を使用してください。"}],"collocations":["apply moisturizer (保湿剤を塗る)","facial moisturizer (顔用保湿剤)","body moisturizer (体用保湿剤)","oil-free moisturizer (オイルフリーの保湿剤)","tinted moisturizer (色付き保湿剤)","daily moisturizer (毎日使う保湿剤)","night moisturizer (夜用保湿剤)"],"synonyms":["emollient","lotion","cream","hydrating cream"],"antonyms":["drying agent"],"related_terms":["hydration","dry skin","skin care","cosmetics","lotion","cream"]}],"etymology":{"value":"\"Moisturizer\" is derived from \"moisturize,\" which combines \"moist\" (from Old French \"moiste,\" meaning damp or humid) and the suffix \"-ize\" (indicating a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔɪstʃəraɪzər/","syllables":"mois-tur-iz-er"},"inflection":{"noun_plural":"moisturizers"},"usage_notes":{"explanation":"A moisturizer is a skincare product designed to hydrate and protect the skin by preventing water loss. It is typically applied to the face and body to keep the skin soft, supple, and healthy. Moisturizers come in various forms, including creams, lotions, gels, and serums, and are often formulated with ingredients like hyaluronic acid, glycerin, and oils to attract and retain moisture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a moisture for my skin.","correct":"✓ I need a moisturizer for my skin.","note":"\"Moisture\" is the level of wetness and is a noun, but \"moisturizer\" is the product that provides moisture and is also a noun. You need to use the correct noun. "},{"incorrect":"✗ He moisturized his face with a lotion.","correct":"✓ He applied lotion to his face. / ✓ He used lotion as a moisturizer on his face.","note":"\"Moisturize\" is a verb, so you need to use it correctly in a sentence. You can say \"He moisturized his face,\" or \"He applied moisturizer to his face.\" Alternatively, you can use \"lotion\" as the noun and say, \"He applied lotion to his face.\" "},{"incorrect":"✗ This cream is very moisture.","correct":"✓ This cream is very moisturizing. / ✓ This cream is very hydrating.","note":"\"Moisture\" is a noun, so you can't use it to describe the cream directly. Instead, use the adjective \"moisturizing\" or \"hydrating\" to describe the cream's effect."}],"priority":"★★☆"},"related_words":{"derivatives":["moisturize (verb)","moisturizing (adjective)"],"related_terms":["humectant","emollient","occlusive","hyaluronic acid","glycerin","ceramides","skin barrier","skin type","SPF (Sun Protection Factor)","dermatologist"]},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"moisturizer\" refers to a cream or lotion you put on your skin to keep it from getting dry. It's a common skincare product used by many people to keep their skin healthy and hydrated. You can find moisturizers in different forms, like creams, lotions, and gels, and they often contain ingredients that help your skin retain moisture."},"example_sentences":[{"sentence":"She uses a **moisturizer** every day to keep her skin hydrated.","translation":"彼女は毎日肌の潤いを保つために保湿剤を使っています。","type":"noun","meaning_category":"保湿剤"},{"sentence":"This **moisturizer** contains hyaluronic acid to help retain moisture.","translation":"この保湿剤には、水分を保持するのに役立つヒアルロン酸が含まれています。","type":"noun","meaning_category":"保湿剤"},{"sentence":"He prefers an oil-free **moisturizer** because he has oily skin.","translation":"彼は脂性肌なので、オイルフリーの保湿剤を好みます。","type":"noun","meaning_category":"保湿剤"}]}