{"word":"Concertedly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"協調して、協力して、一致団結して","english_definition":"in a concerted manner; in a way that is planned and done together for a shared purpose.","examples":[{"sentence":"The nations acted concertedly to address the environmental crisis.","translation":"各国は環境危機に対処するために協調して行動した。"},{"sentence":"They worked concertedly to improve the company's image.","translation":"彼らは会社のイメージを向上させるために協力して働いた。"},{"sentence":"The team members concertedly focused on achieving their common goal.","translation":"チームメンバーは共通の目標を達成するために一致団結して集中した。"}],"collocations":["act concertedly","work concertedly","move concertedly","address concertedly","focus concertedly"],"synonyms":["collaboratively","cooperatively","jointly","unitedly","harmoniously","in unison"],"antonyms":["independently","separately","individually","unilaterally"]}],"etymology":{"value":"\"Concertedly\" is derived from the adjective \"concerted,\" which comes from the Italian word \"concertare,\" meaning \"to bring into agreement.\" This is further derived from the Latin word \"consertare,\" meaning \"to join together, dispute, or contend.\" The adverbial form is created by adding the suffix \"-ly.\"","priority":"★★★"},"pronunciation":{"ipa":"/kənˈsɜːrtɪdli/","syllables":"con-cert-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Concertedly\" describes actions performed in a planned and coordinated way, often involving multiple parties working together towards a common objective. It emphasizes the unified effort and shared purpose behind the action. It is often used in formal contexts to describe coordinated efforts by governments, organizations, or groups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They acted concertedly, each doing their own thing.","correct":"✓ They acted concertedly, coordinating their efforts.","note":"\"Concertedly\" implies coordination and a shared purpose. Doing one's own thing contradicts this meaning."},{"incorrect":"✗ The team worked concerted.","correct":"✓ The team worked concertedly.","note":"\"Concerted\" is an adjective, while \"concertedly\" is the adverb. Use the adverb to modify the verb 'worked'."}],"priority":"★★☆"},"related_words":{"derivatives":["concerted (adjective): planned or accomplished together; combined; joint.","concert (noun): a musical performance; agreement in action, design, or plan.","concerting (verb, gerund or present participle): the act of planning or arranging something together."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, more common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"concertedly\" is a formal adverb that means in a planned and coordinated way, usually by multiple people or groups. It suggests a deliberate and unified effort towards a common goal. Because of its formality and specific meaning, it is less common in everyday conversation and more often found in formal writing and speeches."},"example_sentences":[{"sentence":"The international community must act concertedly to combat climate change.","translation":"国際社会は気候変動と闘うために協調して行動しなければならない。","type":"general","meaning_category":"協調して行動する"},{"sentence":"The shareholders worked concertedly to oust the CEO.","translation":"株主たちはCEOを追い出すために協力して働いた。","type":"business","meaning_category":"協力して働く"},{"sentence":"The activists demonstrated concertedly to raise awareness about the issue.","translation":"活動家たちはその問題に対する意識を高めるために一致団結してデモを行った。","type":"social","meaning_category":"一致団結して行動する"}]}