{"word":"land-bank","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(不動産) 土地銀行、土地保有事業体","english_definition":"An organization that acquires and manages vacant, abandoned, and tax-delinquent properties.","examples":[{"sentence":"The city established a land-bank to revitalize blighted neighborhoods.","translation":"市は荒廃した地域を活性化するために土地銀行を設立した。"},{"sentence":"The land-bank sells properties to developers who commit to building affordable housing.","translation":"土地銀行は、手頃な価格の住宅建設を約束する開発業者に物件を販売する。"}],"collocations":["establish a land-bank","operate a land-bank","land-bank property","land-bank initiative"],"synonyms":["property bank","real estate bank"],"antonyms":[]},{"part_of_speech":"verb","definition":"(不動産) 土地を土地銀行に預ける、または土地銀行を通じて管理する","english_definition":"To place land into a land bank; to manage land through a land bank.","examples":[{"sentence":"The city decided to land-bank several vacant lots for future development.","translation":"市は将来の開発のために、いくつかの空き地を土地銀行に預けることを決定した。"},{"sentence":"We are land-banking properties in anticipation of future growth.","translation":"私たちは将来の成長を見越して土地を土地銀行を通じて管理している。"}],"collocations":["land-bank a property","land-bank vacant lots"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term combines 'land' (referring to real property) and 'bank' (referring to an institution that manages assets). It suggests an organization that holds and manages land in a similar way that a financial bank manages money.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlændˌbæŋk/","syllables":"land-bank"},"inflection":{"noun_plural":"land-banks","verb_forms":{"present_simple":["land-bank","land-banks"],"past_simple":"land-banked","past_participle":"land-banked","present_participle":"land-banking"}},"usage_notes":{"explanation":"A 'land-bank' is typically a governmental or non-profit entity that focuses on acquiring, managing, and repurposing underutilized or abandoned properties. The primary goal is to return these properties to productive use, often for community development, affordable housing, or economic revitalization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The land bank is full of money.","correct":"✓ The land bank is full of properties.","note":"Land banks deal with land and properties, not money. They manage real estate assets, not financial assets."}],"priority":"★★☆"},"related_words":{"derivatives":["land banking (noun: the practice of using a land bank)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'land-bank' refers to a specialized organization that deals with acquiring and managing vacant or abandoned properties. It is often used in the context of urban planning, real estate development, and community revitalization. Understanding the term requires familiarity with concepts related to property management and urban development strategies."},"example_sentences":[{"sentence":"The land-bank aims to reduce blight by selling properties to responsible developers.","translation":"土地銀行は、責任ある開発業者に物件を販売することで、荒廃を減らすことを目指している。","type":"noun","meaning_category":"土地銀行"},{"sentence":"The city decided to land-bank the abandoned industrial site.","translation":"市は放棄された工業用地を土地銀行に預けることを決定した。","type":"verb","meaning_category":"土地銀行に預ける"}]}