{"word":"influential-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that exert influence or have a powerful effect on others.","english_definition":"Possessing eyes that have a strong effect on someone or something; having eyes that are perceived as persuasive, commanding, or charismatic.","examples":[{"sentence":"The politician was known for his influential-eyed gaze, which seemed to sway voters with ease.","translation":"その政治家は、有権者を容易に動揺させるかのように見える、影響力のある目つきで知られていた。"},{"sentence":"With an influential-eyed stare, she convinced the board to approve her proposal.","translation":"影響力のある目つきで、彼女は理事会を説得して彼女の提案を承認させた。"},{"sentence":"The model's influential-eyed look captivated audiences worldwide.","translation":"そのモデルの影響力のある目つきは世界中の観客を魅了した。"}],"collocations":["influential-eyed gaze","influential-eyed stare","influential-eyed look","with an influential-eyed expression"],"synonyms":["persuasive-eyed","commanding-eyed","charismatic-eyed","powerful-eyed","magnetic-eyed"],"antonyms":["unassuming-eyed","weak-eyed","powerless-eyed","ineffective-eyed"]}],"etymology":{"value":"Combination of 'influential' (having the power to affect something) and 'eyed' (having eyes of a specified kind).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnfluˈɛnʃəl aɪd/","syllables":"in-flu-en-tial-eyed"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'influential-eyed' is a descriptive adjective used to characterize someone whose eyes seem to possess a strong power to affect or persuade others. It suggests that the person's gaze is compelling, commanding, or charismatic. This term is often used in literature or descriptive writing to convey a character's impact or presence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was influential-eyed to the decision.","correct":"✓ He used his influential-eyed gaze to influence the decision.","note":"'Influential-eyed' describes the eyes themselves, not the action of influencing. It should be used to describe the quality of the eyes, not as a verb or adverb."},{"incorrect":"✗ She had an influential-eyed.","correct":"✓ She had an influential-eyed look.","note":"'Influential-eyed' is an adjective and needs to modify a noun, such as 'look', 'gaze', or 'stare'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["influential","persuasive","commanding","charismatic"]},"level_frequency":{"CEFR":"N/A (uncommon term)","frequency_google_ngram":"Low frequency (rarely used)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Influential-eyed' is a complex adjective used to describe eyes that seem to have a powerful, persuasive, or commanding effect on others. It combines the concept of influence with the physical attribute of having eyes. This term is not commonly used and is more likely to be found in descriptive or literary contexts. It requires a good understanding of both 'influence' and how physical features can be used to convey character traits."},"example_sentences":[{"sentence":"Her influential-eyed expression made it clear she was not to be trifled with.","translation":"彼女の影響力のある目つきは、彼女が軽んじられるべきではないことを明らかにした。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The leader's influential-eyed stare silenced the room.","translation":"その指導者の影響力のある凝視は部屋を静まり返らせた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"He was drawn to her influential-eyed beauty.","translation":"彼は彼女の影響力のある美しさに惹かれた。","type":"adjective","meaning_category":"descriptive"}]}