{"word":"unintelligently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不明瞭に、理解できないように、知性がないように","english_definition":"in an unintelligible manner; in a way that is difficult or impossible to understand; without intelligence or understanding.","examples":[{"sentence":"He mumbled unintelligently, making it impossible to understand his request.","translation":"彼は不明瞭にもごもご話し、彼の要求を理解することを不可能にした。"},{"sentence":"The instructions were written so unintelligently that no one could follow them.","translation":"指示は非常に不明瞭に書かれていたため、誰もそれに従うことができなかった。"},{"sentence":"She acted unintelligently, leading to a series of unfortunate events.","translation":"彼女は知性がないように行動し、一連の不幸な出来事につながった。"}],"collocations":["speak unintelligently (不明瞭に話す)","write unintelligently (不明瞭に書く)","act unintelligently (知性がないように行動する)"],"synonyms":["incoherently","inarticulately","obscurely","foolishly","stupidly"],"antonyms":["intelligently","clearly","coherently","articulately"]}],"etymology":{"value":"\"un-\" (否定) + \"intelligently\" (知的に)","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌnɪnˈtɛlɪdʒəntli","syllables":"un-in-tel-li-gent-ly"},"inflection":{"notes":"Adverbs do not inflect"},"usage_notes":{"explanation":"\"Unintelligently\" is the adverbial form of \"unintelligent,\" meaning lacking intelligence or understanding. It describes actions or speech that are difficult to comprehend or demonstrate a lack of intellect. It is often used to criticize or negatively evaluate someone's behavior or communication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke unintelligent.","correct":"✓ He spoke unintelligently.","note":"\"Unintelligent\" is an adjective, while \"unintelligently\" is an adverb. Adverbs are needed to modify verbs."},{"incorrect":"✗ The report was wrote unintelligently.","correct":"✓ The report was written unintelligently.","note":"Ensure the verb is in the correct form (past participle after \"was\")."}],"priority":"★★☆"},"related_words":{"derivatives":["unintelligent (adjective)","intelligence (noun)","intelligently (adverb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unintelligently\" means doing something in a way that shows a lack of intelligence or is difficult to understand. It's used to describe actions, speech, or writing that are not clear or well-thought-out. Because it's not a common word, it's more likely to appear in advanced texts or formal writing where precise and critical language is used."},"example_sentences":[{"sentence":"The witness answered the questions so unintelligently that the jury couldn't understand his testimony.","translation":"証人は質問に非常に不明瞭に答えたため、陪審員は彼の証言を理解できなかった。","type":"adverb","meaning_category":"不明瞭に"},{"sentence":"He argued his point unintelligently, failing to provide any supporting evidence.","translation":"彼は自分の主張を不明瞭に議論し、裏付けとなる証拠を何も提供できなかった。","type":"adverb","meaning_category":"知性がないように"},{"sentence":"The code was written so unintelligently that it was impossible to debug.","translation":"コードは非常に不明瞭に書かれていたため、デバッグすることが不可能だった。","type":"adverb","meaning_category":"理解できないように"}]}