{"word":"unfocusable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"焦点を合わせることができない、焦点が合わない","english_definition":"Not able to be brought into focus; lacking the ability to be focused on or to have focus applied to it.","examples":[{"sentence":"The button was unfocusable, preventing the user from interacting with it.","translation":"そのボタンは焦点を合わせることができず、ユーザーが操作することを妨げました。"},{"sentence":"The element was marked as 'unfocusable' in the code.","translation":"その要素はコード内で「unfocusable」とマークされていました。"}],"collocations":["unfocusable element","unfocusable control","unfocusable button"],"synonyms":["non-focusable","blurry","out of focus"],"antonyms":["focusable"],"related_terms":["focus","tabindex","accessibility"],"usage_notes":{"explanation":"'Unfocusable' is often used in the context of user interface (UI) design and web development to describe elements that cannot receive focus, typically via keyboard navigation (using the Tab key).  This is important for accessibility, as users who rely on keyboard navigation need to be able to access all interactive elements on a page.  An element might be made unfocusable intentionally (e.g., for purely decorative elements) or unintentionally (e.g., due to a coding error). The `tabindex` attribute in HTML is often used to control the focusability of elements.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unfocusable' means something cannot be brought into clear view or cannot be selected for attention. In computer interfaces, it often describes an element that a user cannot select using the keyboard (e.g., by pressing the Tab key). This is important for making websites and applications accessible to people who cannot use a mouse."}}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'focusable'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ʌnˈfoʊkəsəbəl/","syllables":"un-fo-cus-a-ble"},"inflection":{},"common_mistakes":{},"related_words":{"derivatives":["unfocusably"],"related_terms":["focus","focusable","tabindex","accessibility"]},"example_sentences":[{"sentence":"The disabled input field was intentionally made unfocusable.","translation":"無効化された入力フィールドは、意図的に焦点を合わせられないようにされました。","type":"adjective","meaning_category":"焦点を合わせることができない"},{"sentence":"Ensure that all interactive elements are focusable to maintain accessibility, and that purely decorative elements are unfocusable.","translation":"アクセシビリティを維持するために、すべてのインタラクティブな要素がフォーカス可能であり、純粋に装飾的な要素がフォーカス不可能であることを確認してください。","type":"adjective","meaning_category":"焦点を合わせることができない"}]}