{"word":"quasi-bankrupt","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"準倒産状態の、事実上倒産している","english_definition":"Being in a condition that is similar to bankruptcy but not formally declared as such.","examples":[{"sentence":"The company was in a quasi-bankrupt state due to heavy debts.","translation":"その会社は多額の負債のため、準倒産状態だった。"},{"sentence":"The country's economy is quasi-bankrupt after years of mismanagement.","translation":"その国の経済は長年の経営不振の後、事実上倒産している。"}],"collocations":["quasi-bankrupt company","quasi-bankrupt economy","in a quasi-bankrupt state"],"synonyms":["insolvent","near bankruptcy","financially distressed","on the verge of bankruptcy"],"antonyms":["solvent","financially stable","profitable"]}],"etymology":{"value":"The term combines \"quasi-\" (meaning resembling or having some, but not all, of the qualities of) with \"bankrupt\" (legally declared unable to pay debts).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ˈbæŋkrʌpt/","syllables":"quasi-bank-rupt"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"\"Quasi-bankrupt\" describes a situation where an entity (company, organization, or even a country) is experiencing severe financial difficulties, to the point where it is nearly bankrupt, but has not officially filed for bankruptcy. It implies a state of insolvency or near-insolvency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is quasi-bankrupt, so they are doing very well.","correct":"✓ The company is quasi-bankrupt, so they are struggling to survive.","note":"Quasi-bankrupt implies financial distress, not success."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb, prefix)"],"phrasal_verbs":[],"related_terms":["bankruptcy","insolvency","default","recession","financial crisis"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"quasi-bankrupt\" is used to describe a situation where a company or organization is in a state very close to bankruptcy but hasn't officially declared it. It's a more nuanced way of saying that the entity is facing severe financial difficulties. The prefix \"quasi-\" indicates that it's similar to but not exactly the same as bankruptcy. This term is more commonly used in financial and economic discussions."},"example_sentences":[{"sentence":"The airline was quasi-bankrupt before the government bailout.","translation":"その航空会社は政府の救済策の前に準倒産状態だった。","type":"adjective","meaning_category":"financial state"},{"sentence":"Many small businesses are quasi-bankrupt due to the economic downturn.","translation":"多くの中小企業は景気後退のため、事実上倒産している。","type":"adjective","meaning_category":"financial state"}]}