{"word":"cryptogamous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"隠花植物の、隠花植物に属する","english_definition":"(of a plant) reproducing by spores, without flowers or seeds; belonging to the Cryptogamia.","examples":[{"sentence":"Ferns are cryptogamous plants.","translation":"シダは隠花植物です。"},{"sentence":"Cryptogamous plants include algae, mosses, and ferns.","translation":"隠花植物には、藻類、コケ類、シダ類が含まれます。"}],"collocations":["cryptogamous plant","cryptogamous vegetation"],"synonyms":["spore-bearing","non-seed-bearing","flowerless"],"antonyms":["phanerogamous","seed-bearing","flowering"]}],"etymology":{"value":"Derived from the scientific term 'Cryptogamia,' coined from Greek 'krypto-' (hidden) + 'gamos' (marriage), referring to the hidden means of reproduction in these plants.","priority":"★★☆"},"pronunciation":{"ipa":"/krɪpˈtɒɡəməs/","syllables":"cryp-tog-a-mous"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"The term 'cryptogamous' is primarily used in botany to classify plants that reproduce via spores rather than seeds or flowers. It's a somewhat outdated term, as modern botanical classification relies more on evolutionary relationships and genetic data. However, it's still encountered in older texts and general discussions about plant life cycles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cryptogamous plants are always small.","correct":"✓ Cryptogamous plants can vary in size; some are small, like mosses, while others, like ferns, can be quite large.","note":"While many cryptogamous plants are small, size is not a defining characteristic."},{"incorrect":"✗ Cryptogamous plants are only found in wet environments.","correct":"✓ While many cryptogamous plants thrive in wet environments, some can also be found in drier conditions.","note":"Moisture is important for reproduction in many cryptogamous plants, but they are not exclusively found in wet environments."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cryptogamia (noun: the former taxonomic group of cryptogamous plants)"],"scientific_terms":["Thallophyta (a former division including algae and fungi)","Bryophyta (mosses, liverworts, and hornworts)","Pteridophyta (ferns and related plants)"],"priority":"★☆☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cryptogamous' is a technical term used in botany to describe plants that reproduce without flowers or seeds, using spores instead. These plants belong to a group formerly known as Cryptogamia, which included algae, mosses, ferns, and similar organisms. The term is less common in modern botany due to advancements in classification methods, but it may still be encountered in older scientific texts or general discussions about plant reproduction. Understanding the term requires some familiarity with basic botanical concepts."},"example_sentences":[{"sentence":"The damp forest floor was covered in a variety of cryptogamous species.","translation":"湿った森の地面は、さまざまな隠花植物種で覆われていました。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Early botanical classifications relied heavily on the distinction between cryptogamous and phanerogamous plants.","translation":"初期の植物分類は、隠花植物と顕花植物の区別に大きく依存していました。","type":"adjective","meaning_category":"historical context"}]}