{"word":"unhewed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(木材や石などが)切り出されていない、粗削りの、未加工の","english_definition":"(of timber or stone) not shaped or squared with an ax or other tool; in a natural or rough state.","examples":[{"sentence":"The cabin was built from unhewed logs.","translation":"その小屋は粗削りの丸太で建てられていた。"},{"sentence":"They used unhewed stones to build the wall.","translation":"彼らは未加工の石を使って壁を築いた。"}],"collocations":["unhewed logs","unhewed stones","unhewed timber"],"synonyms":["rough","natural","undressed","unprocessed","unshaped"],"antonyms":["hewed","dressed","shaped","processed"]}],"etymology":{"value":"\"Un-\" (not) + \"hewed\" (過去分詞 of \"hew\", to chop or cut with an ax).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhjuːd/","syllables":"un-hewed"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more unhewed, most unhewed) but not common."},"usage_notes":{"explanation":"\"Unhewed\" is typically used to describe raw materials like wood or stone that have not been worked or shaped by tools. It emphasizes the natural, untouched state of the material. It is a relatively uncommon word, often found in descriptions of rustic or primitive structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The statue was unhewed.","correct":"✓ The statue was made of unhewed stone.","note":"Statues are typically carved or sculpted, so describing a statue as \"unhewed\" is usually incorrect. Use \"unhewed\" to describe the raw material, not the finished product."}],"priority":"★☆☆"},"related_words":{"derivatives":["hew (verb: to chop or cut with an ax)","hewn (adjective: chopped or cut with an ax)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unhewed\" is a relatively rare and specialized term. It describes materials, typically wood or stone, that have not been shaped or cut using tools like an axe. Understanding this word requires familiarity with older methods of construction and woodworking. It is more likely to be encountered in historical texts or descriptions of rustic settings."},"example_sentences":[{"sentence":"The pioneers built their homes from unhewed timber, a testament to their resourcefulness.","translation":"開拓者たちは、その創意工夫の証として、粗削りの木材で家を建てた。","type":"adjective","meaning_category":"not shaped or squared"},{"sentence":"The ancient temple was constructed using massive, unhewed stones.","translation":"その古代寺院は、巨大な未加工の石を使って建設された。","type":"adjective","meaning_category":"not shaped or squared"}]}