{"word":"dietician","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"栄養士","english_definition":"an expert on diet and nutrition.","examples":[{"sentence":"The doctor referred her to a dietician for advice on managing her diabetes.","translation":"医師は彼女に糖尿病の管理についてのアドバイスを求めて栄養士を紹介した。"},{"sentence":"A registered dietician can help you create a healthy eating plan.","translation":"登録栄養士は、あなたが健康的な食事プランを作成するのを助けることができます。"}],"collocations":["registered dietician","consult a dietician","see a dietician","work as a dietician"],"synonyms":["nutritionist","dietary expert","food expert"],"antonyms":[]}],"etymology":{"value":"The word 'dietician' comes from 'diet' + '-ician'. 'Diet' is from the Greek 'diaita', meaning 'way of life' or 'regimen'. The suffix '-ician' denotes a person skilled in or concerned with the specified subject.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˈtɪʃən/","syllables":"di-e-ti-cian"},"inflection":{"noun_plural":"dieticians"},"usage_notes":{"explanation":"A 'dietician' is a healthcare professional who is an expert in food and nutrition. They often work in hospitals, clinics, or private practice, providing advice and guidance on diet-related matters. In many countries, the title 'dietician' is protected by law, meaning that only individuals who meet specific qualifications and are registered with a regulatory body can use the title. This ensures a certain level of competence and professionalism. The term 'nutritionist' is sometimes used interchangeably, but it is not always legally protected, and the qualifications of a nutritionist may vary.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to see a nutritionist, but I don't know if they are a dietician.","correct":"✓ I am going to see a nutritionist, but I don't know if they are a registered dietician.","note":"It's important to check if a nutritionist is also a registered dietician, as the qualifications and regulations can differ."},{"incorrect":"✗ Dieticians are only for people who want to lose weight.","correct":"✓ Dieticians can help with a wide range of health conditions, not just weight loss.","note":"Dieticians can provide advice on managing various health conditions, such as diabetes, heart disease, and food allergies."}],"priority":"★★☆"},"related_words":{"derivatives":["dietetics (名詞: 栄養学)","dietary (形容詞: 食事の、食餌の)","diet (名詞: 食事、食餌療法；動詞: 食事療法をする)","nutrition (名詞: 栄養)","nutritional (形容詞: 栄養の)","nutritionist (名詞: 栄養士)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'dietician' refers to a qualified expert in food and nutrition. They provide advice on what to eat to maintain health or manage specific medical conditions. It's important to note that while the term 'nutritionist' is also used, 'dietician' often implies a higher level of qualification and regulation, depending on the country. Understanding the role of a dietician is useful for discussing health and dietary needs."},"example_sentences":[{"sentence":"The **dietician** helped her create a meal plan that met her specific nutritional needs.","translation":"栄養士は、彼女が特定の栄養ニーズを満たす食事プランを作成するのを手伝った。","type":"noun","meaning_category":"専門家"},{"sentence":"It's best to consult a registered **dietician** for personalized dietary advice.","translation":"個別の食事に関するアドバイスを得るには、登録栄養士に相談するのが一番です。","type":"noun","meaning_category":"専門家"},{"sentence":"The hospital employs several **dieticians** to assist patients with their dietary requirements.","translation":"病院は、患者の食事要件を支援するために数人の栄養士を雇用している。","type":"noun","meaning_category":"専門家"}]}