{"word":"langca","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A traditional Vietnamese sweet soup made with green beans, tapioca pearls, and coconut milk.","english_definition":"A Vietnamese dessert soup featuring green beans, tapioca pearls, and coconut milk.","examples":[{"sentence":"I ordered a bowl of chè đậu xanh (langca) after my meal.","translation":"食事の後、チェー・ダウサイン（ランカ）を一杯注文しました。"},{"sentence":"Langca is a popular dessert during the summer months in Vietnam.","translation":"ランカはベトナムの夏の間に人気のあるデザートです。"}],"collocations":["chè đậu xanh langca","sweet langca soup","Vietnamese langca dessert"],"synonyms":["chè đậu xanh","green bean sweet soup"],"antonyms":[]}],"etymology":{"value":"The term 'langca' might be a regional or colloquial variation of 'chè đậu xanh' or refer to a specific preparation style. Further research is needed to determine its exact etymological origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/laŋ ka/","syllables":"lang-ca"},"inflection":{"noun_plural":"N/A (typically uncountable)"},"usage_notes":{"explanation":"'Langca' is likely a regional or less common name for 'chè đậu xanh,' a well-known Vietnamese dessert. When ordering or discussing this dish, 'chè đậu xanh' is the more widely recognized term. It's important to note that regional variations in Vietnamese cuisine are common, and 'langca' might be prevalent in specific areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I want a langca for dinner.","correct":"I want some chè đậu xanh for dessert.","note":"Langca is a dessert, not a main course. Also, 'chè đậu xanh' is the more common term."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_dishes":["chè (Vietnamese sweet soup)","chè chuối (banana sweet soup)","chè thái (mixed fruit sweet soup)"],"ingredients":["green beans","tapioca pearls","coconut milk","sugar"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (likely due to being a regional or less common term).","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Langca' refers to a specific type of Vietnamese dessert soup. It's made with green beans, tapioca pearls, and coconut milk. It's similar to 'chè đậu xanh,' which is a more common name for this dish. If you're in Vietnam, you might hear this term, but 'chè đậu xanh' is generally more widely understood."},"example_sentences":[{"sentence":"My grandmother makes the best langca in the village.","translation":"私の祖母は村で一番美味しいランカを作ります。","type":"noun","meaning_category":"Vietnamese dessert"},{"sentence":"Have you ever tried langca with pandan leaves?","translation":"パンダンリーフ入りのランカを食べたことがありますか？","type":"noun","meaning_category":"Vietnamese dessert"}]}