{"word":"evangelising","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive/transitive","definition":"福音を伝える、伝道する、熱心に擁護する","english_definition":"to try to convert people to a particular religion or belief; to advocate or promote something enthusiastically.","examples":[{"sentence":"He spent his life evangelising in remote parts of the world.","translation":"彼は人生を世界の僻地で伝道活動に費やした。"},{"sentence":"The company is evangelising the benefits of its new software.","translation":"その会社は新しいソフトウェアの利点を熱心に宣伝している。"},{"sentence":"She evangelises for healthy eating and regular exercise.","translation":"彼女は健康的な食事と定期的な運動を熱心に推奨している。"}],"collocations":["evangelise for a cause","evangelise about a product","evangelise to a community"],"synonyms":["preach","proselytize","convert","promote","advocate","champion"],"antonyms":["discourage","dissuade","oppose"]}],"etymology":{"value":"'Evangelise' derives from the Greek word 'euangelion', meaning 'good news' or 'gospel'. It entered English through ecclesiastical Latin 'evangelizare'. The suffix '-ise' (or '-ize') indicates the act of doing or becoming.","priority":"★★☆"},"pronunciation":{"ipa":"ɪˈvændʒəlaɪzɪŋ","syllables":"e-van-ge-lis-ing"},"inflection":{"verb_forms":{"present_simple":["evangelise","evangelises"],"past_simple":"evangelised","past_participle":"evangelised","present_participle":"evangelising"}},"usage_notes":{"explanation":"'Evangelising' refers to the act of spreading a religious gospel or promoting a particular belief system with zeal. It can be used in a religious context, specifically related to Christianity, or in a more general sense to describe enthusiastic advocacy for a product, idea, or cause. The term often implies a sense of mission or strong conviction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is evangelising about to God.","correct":"✓ He is evangelising about God.","note":"The preposition 'to' is unnecessary after 'evangelising about'."},{"incorrect":"✗ She evangelises the importance of education, but she doesn't study herself.","correct":"✓ She evangelises the importance of education, but she doesn't study herself.","note":"The sentence structure is correct, but the contrast might be more clearly expressed with 'although' or 'even though' instead of 'but'."}],"priority":"★☆☆"},"related_words":{"derivatives":["evangelist (noun: a person who seeks to convert others to the Christian faith)","evangelism (noun: the spreading of the Christian gospel by public preaching or personal witness)","evangelical (adjective: relating to or denoting a tradition within Protestant Christianity)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Evangelising' is a relatively advanced term that describes the act of spreading a religious belief or promoting a cause with great enthusiasm. It is often used in the context of Christianity but can also apply to the promotion of ideas or products. Understanding this word requires a grasp of abstract concepts and a familiarity with religious terminology."},"example_sentences":[{"sentence":"The missionary dedicated his life to evangelising the local population.","translation":"その宣教師は、地域住民への伝道活動に生涯を捧げた。","type":"verb","meaning_category":"spreading religious gospel"},{"sentence":"Tech companies often use 'evangelists' to promote their products to potential clients.","translation":"テクノロジー企業は、潜在的な顧客に製品を宣伝するために「エバンジェリスト」をよく使用する。","type":"verb","meaning_category":"promoting a product"},{"sentence":"She is passionate about evangelising the benefits of sustainable living.","translation":"彼女は持続可能な生活の利点を熱心に提唱している。","type":"verb","meaning_category":"advocating a cause"}]}