{"word":"coat-armour","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"紋章、紋章学","english_definition":"heraldic bearings or insignia; heraldry.","examples":[{"sentence":"The coat-armour of the family was displayed prominently in the hall.","translation":"その家族の紋章は広間にはっきりと飾られていた。"}],"collocations":["display coat-armour","family coat-armour"],"synonyms":["arms","heraldry","escutcheon"],"antonyms":[]}],"etymology":{"value":"The term 'coat-armour' originates from the practice of displaying heraldic symbols on a surcoat, which was a cloth garment worn over a suit of armor in the medieval period. This allowed knights to be identified on the battlefield.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkoʊt ˌɑːrmər/","syllables":"coat-ar-mour"},"inflection":{"noun_plural":"coat-armours"},"usage_notes":{"explanation":"'Coat-armour' is a somewhat archaic term, with 'coat of arms' being the more common and contemporary usage to describe heraldic bearings. It refers to the unique symbolic designs associated with a family, individual, or institution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore his coat-armour into battle.","correct":"✓ He wore his coat of arms into battle.","note":"While technically 'coat-armour' refers to the heraldic symbols, the garment itself would be referred to as a 'surcoat' or 'coat of arms' displaying the symbols."}],"priority":"★★☆"},"related_words":{"derivatives":["coat of arms (more common term for heraldic bearings)","heraldry (the system and study of coats of arms)","armorial (relating to coats of arms)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coat-armour' is an older term referring to what is more commonly known as a 'coat of arms.' It's a term primarily encountered in historical contexts or discussions of heraldry. Understanding the term requires familiarity with medieval history and the symbolism associated with heraldic designs.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient manuscript detailed the history of the family's coat-armour.","translation":"その古文書には、その家族の紋章の歴史が詳しく記されていた。","type":"noun","meaning_category":"紋章"},{"sentence":"Researching his family history, he discovered their impressive coat-armour.","translation":"彼は家族の歴史を調査し、彼らの印象的な紋章を発見した。","type":"noun","meaning_category":"紋章"}]}