{"word":"Overrealism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰なリアリズム、過度な現実主義","english_definition":"An exaggerated or excessive form of realism, often in art or literature, that emphasizes minute details to an extreme degree.","examples":[{"sentence":"The artist's overrealism made the painting appear almost photographic.","translation":"その画家の過剰なリアリズムは、絵画をほとんど写真のように見せた。"},{"sentence":"The novel was criticized for its overrealism, which made it difficult to read.","translation":"その小説は、過剰なリアリズムのために読みにくいと批判された。"}],"collocations":["artistic overrealism","literary overrealism"],"synonyms":["hyperrealism","photorealism","extreme realism"],"antonyms":["idealism","romanticism"]}],"etymology":{"value":"\"Over-\" (過剰な) + \"realism\" (現実主義)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈriːəlɪzəm/","syllables":"o-ver-re-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Overrealism\" is often used to describe art or literature that is so detailed and accurate that it becomes almost unbelievable or unsettling. It can also refer to a philosophical approach that places too much emphasis on the material world and ignores abstract concepts or ideals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie had too much realism, it was overrealism.","correct":"✓ The movie had so much realism, it bordered on overrealism.","note":"Overrealism is a specific term, not just 'too much realism.' It implies an extreme level of detail that becomes a stylistic choice."}],"priority":"★★☆"},"related_words":{"derivatives":["overrealistic (adjective)"],"related_terms":["realism","hyperrealism","photorealism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overrealism\" is a relatively uncommon term used in art criticism, literary analysis, and philosophical discussions. It refers to a style or approach that takes realism to an extreme, often focusing on minute details to an excessive degree. Understanding this term requires familiarity with the concept of realism itself and the ability to recognize when it is being exaggerated or taken too far."},"example_sentences":[{"sentence":"The sculptor's overrealism captured every pore and wrinkle on the subject's face.","translation":"その彫刻家の過剰なリアリズムは、被写体の顔のあらゆる毛穴としわを捉えた。","type":"noun","meaning_category":"artistic style"},{"sentence":"The author's overrealism in describing the slums made the book a difficult but important read.","translation":"スラム街を描写する際の著者の過剰なリアリズムは、その本を難解だが重要な読み物にした。","type":"noun","meaning_category":"literary style"}]}