{"word":"motivity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"行動性、運動性、活動性、意欲、動機づけ","english_definition":"The state or quality of being motile; the power of moving, or the tendency to move; the degree to which something is motile.","examples":[{"sentence":"The motivity of the bacteria was reduced by the antibiotic.","translation":"その抗生物質によってバクテリアの運動性が低下した。"},{"sentence":"The project aims to enhance the motivity of the workforce.","translation":"そのプロジェクトは労働者の意欲を高めることを目的としている。"},{"sentence":"His lack of motivity is a concern for his therapist.","translation":"彼の活動性の欠如はセラピストにとって懸念事項である。"}],"collocations":["lack of motivity (活動性の欠如)","enhance motivity (意欲を高める)","bacterial motivity (バクテリアの運動性)"],"synonyms":["motivation","drive","initiative","activity","mobility","propulsion"],"antonyms":["apathy","inactivity","immobility"]}],"etymology":{"value":"Derived from 'motile' (capable of motion) + '-ity' (a suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/moʊˈtɪvɪti/","syllables":"mo-tiv-i-ty"},"inflection":{"noun_plural":"motivities"},"usage_notes":{"explanation":"'Motivity' refers to the ability or tendency to move, either physically or metaphorically (as in motivation or drive). It is less common than 'motivation' but is used in scientific or technical contexts to describe the movement of organisms or cells. In psychological contexts, it can refer to a person's drive or initiative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The motivity of the idea was well-received.","correct":"✓ The motivation behind the idea was well-received.","note":"'Motivity' refers to the ability to move or be active, while 'motivation' refers to the reason or drive behind an action or idea. Use 'motivation' when referring to the driving force behind something."},{"incorrect":"✗ He showed great motivity in the project.","correct":"✓ He showed great motivation in the project. / ✓ He showed great initiative in the project.","note":"When referring to a person's enthusiasm or drive, 'motivation' or 'initiative' are more commonly used than 'motivity'."}],"priority":"★★☆"},"related_words":{"derivatives":["motile (adjective: capable of motion)","motivate (verb: to provide with a motive or reason for doing something)","motivation (noun: the reason or reasons one has for acting or behaving in a particular way)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Motivity' is a relatively uncommon word that describes the ability or tendency to move, either physically or in terms of drive and initiative. It's often used in scientific or technical contexts, such as describing the movement of bacteria or cells. In more general contexts, 'motivation' is usually a more appropriate and commonly used term. It's important to distinguish 'motivity' from 'motivation,' as they have different meanings and applications."},"example_sentences":[{"sentence":"The scientists studied the motivity of the cancer cells.","translation":"科学者たちは癌細胞の運動性を研究した。","type":"noun","meaning_category":"運動性"},{"sentence":"The therapist worked to improve the patient's motivity after the accident.","translation":"セラピストは事故後の患者の活動性を改善するために尽力した。","type":"noun","meaning_category":"活動性"},{"sentence":"A key factor in the project's success was the team's high level of motivity.","translation":"プロジェクト成功の鍵となる要因は、チームの高い意欲だった。","type":"noun","meaning_category":"意欲"}]}