{"word":"food-indifferent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"食べ物に無関心な、食に興味がない","english_definition":"Not particularly interested in or enthusiastic about food.","examples":[{"sentence":"My cat is quite food-indifferent; she only eats when she's truly hungry.","translation":"うちの猫は食べ物にかなり無頓着で、本当に空腹の時しか食べません。"},{"sentence":"He's a food-indifferent traveler, happy to eat whatever is available.","translation":"彼は食べ物に無頓着な旅行者で、手に入るものなら何でも喜んで食べます。"},{"sentence":"Unlike her sister, who is a gourmet, she is completely food-indifferent.","translation":"グルメな妹とは異なり、彼女は全く食べ物に無関心です。"}],"collocations":["be food-indifferent","become food-indifferent","remain food-indifferent"],"synonyms":["apathetic to food","uninterested in food","blasé about food","not picky about food","non-foodie"],"antonyms":["foodie","gourmet","food-obsessed","enthusiastic about food"]},{"part_of_speech":"adjective","definition":"(特に病気などで)食欲がない","english_definition":"Lacking appetite, especially due to illness or other medical condition.","examples":[{"sentence":"The chemotherapy made him food-indifferent.","translation":"化学療法で彼は食欲がなくなりました。"},{"sentence":"She became food-indifferent after contracting the virus.","translation":"彼女はそのウイルスに感染した後、食欲がなくなりました。"}],"collocations":["become food-indifferent (due to illness)","feel food-indifferent"],"synonyms":["lacking appetite","anorexic","without hunger","disinterested in eating"],"antonyms":["hungry","ravenous","famished"]}],"etymology":{"value":"Formed by combining 'food' with 'indifferent', indicating a lack of interest or concern regarding food.","priority":"★★☆"},"pronunciation":{"ipa":"/fuːd ɪnˈdɪfərənt/","syllables":"food-in-dif-fer-ent"},"inflection":{"notes":"Adjective, so it can be modified by adverbs (e.g., 'very food-indifferent') and used in comparative constructions (e.g., 'more food-indifferent')."},"usage_notes":{"explanation":"'Food-indifferent' describes a state of lacking interest or enthusiasm for food. It can refer to a general disinterest in culinary experiences or a temporary loss of appetite, often due to illness or stress. It is often used to contrast someone with a 'foodie' or someone who is very particular about what they eat.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is food indifferent.","correct":"✓ He is food-indifferent.","note":"The hyphen is important to connect the two words and create a compound adjective."},{"incorrect":"✗ She is indifferent to food, so she is food-indifferent to everything else.","correct":"✓ She is indifferent to food, but that doesn't mean she's indifferent to everything else.","note":"Being food-indifferent does not necessarily imply indifference to other aspects of life."}],"priority":"★★☆"},"related_words":{"derivatives":["indifference (noun)","indifferent (adjective)"],"phrases":["foodie","gourmet","picky eater"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Food-indifferent' is a compound adjective that means someone is not very interested in food. It's used to describe people who don't care much about what they eat, or who have lost their appetite. You might use this word to describe someone who eats the same thing every day without getting bored, or someone who doesn't get excited about trying new restaurants. It's more advanced than saying someone 'doesn't like food' because it implies a lack of interest rather than a dislike."},"example_sentences":[{"sentence":"The patient became food-indifferent after starting the new medication.","translation":"患者は新しい薬を飲み始めてから食欲がなくなった。","type":"adjective","meaning_category":"食欲がない"},{"sentence":"Despite being surrounded by delicious dishes, he remained food-indifferent.","translation":"美味しい料理に囲まれているにもかかわらず、彼は食べ物に無関心なままでした。","type":"adjective","meaning_category":"食べ物に無関心な"},{"sentence":"She's so food-indifferent that she often forgets to eat.","translation":"彼女は食べ物に無頓着なので、よく食べるのを忘れます。","type":"adjective","meaning_category":"食べ物に無関心な"}]}