{"word":"Swagmen","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(オーストラリア英語) スワッグマン、荷物を背負って旅をする人、放浪者","english_definition":"(Australian English) A swagman is an itinerant worker who travels on foot from farm to farm carrying his belongings in a swag (a bedroll).","examples":[{"sentence":"Swagmen were a common sight in the Australian outback during the late 19th and early 20th centuries.","translation":"スワッグマンは、19世紀後半から20世紀初頭にかけてのオーストラリアのアウトバックではよく見られる存在だった。"},{"sentence":"The swagman carried all his worldly possessions in his swag.","translation":"スワッグマンは、自分の持ち物をすべてスワッグに入れて運んでいた。"}],"collocations":["Waltzing Matilda (オーストラリアの有名な歌で、スワッグマンが登場する)","carrying a swag","outback Australia"],"synonyms":["tramp","hobo","vagabond","itinerant worker"],"antonyms":["settled worker","landowner"]}],"etymology":{"value":"「swag」は、14世紀頃のスカンジナビア語源の言葉で、元々は「ぶら下がる、揺れる」という意味があり、後に「盗品、戦利品」という意味になった。オーストラリア英語では、19世紀に「寝具や所持品をまとめたもの」を指すようになり、それを持って旅をする人を「swagman」と呼ぶようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswæɡmən/","syllables":"swag-men"},"inflection":{"noun_plural":"swagmen"},"usage_notes":{"explanation":"「**Swagmen**」は、特にオーストラリアの歴史や文化に関連する言葉です。現代ではあまり使われませんが、オーストラリアのフォークロアや文学作品に登場することがあります。スワッグマンは、オーストラリアの開拓時代における労働者の象徴であり、自立と自由を求める精神を表しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a swagman who owned a large farm.","correct":"✓ He was a swagman who traveled from farm to farm looking for work.","note":"スワッグマンは土地を所有する農家ではなく、農場から農場へと仕事を探して旅をする人です。"},{"incorrect":"✗ Swagmen are still common in Australia today.","correct":"✓ Swagmen were common in Australia in the past, but are rare today.","note":"スワッグマンは過去の存在であり、現代ではほとんど見られません。"}],"priority":"★★☆"},"related_words":{"derivatives":["swag (名詞: スワッグ、寝具や所持品をまとめたもの)","swagging (動名詞: スワッグを持って旅をすること)"],"idioms_phrases":["Waltzing Matilda (オーストラリアの有名な歌で、スワッグマンが登場する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 主にオーストラリアの文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Swagmen**」はオーストラリアの歴史的な文脈でのみ使われる特殊な単語です。これは、19世紀から20世紀初頭にかけて、オーストラリアのアウトバックを旅しながら農場から農場へと仕事を探し求めた放浪労働者を指します。彼らは自分の寝具や所持品を「swag」と呼ばれるロール状にして運びました。この単語は、オーストラリアのフォークロアや文学に登場し、特に有名な歌「Waltzing Matilda」に登場します。現代ではほとんど使われませんが、オーストラリアの歴史や文化を理解する上で重要な単語です。"},"example_sentences":[{"sentence":"The old photograph showed a group of **swagmen** gathered around a campfire.","translation":"その古い写真は、キャンプファイヤーの周りに集まったスワッグマンの一団を写していた。","type":"noun","meaning_category":"放浪者"},{"sentence":"Many songs and stories have been written about the life of the Australian **swagman**.","translation":"オーストラリアのスワッグマンの生活については、多くの歌や物語が書かれてきた。","type":"noun","meaning_category":"放浪者"},{"sentence":"The **swagmen** often relied on the generosity of farmers for food and shelter.","translation":"スワッグマンはしばしば、食料と住居を農家の寛大さに頼っていた。","type":"noun","meaning_category":"放浪者"}]}