{"word":"copaene","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"コパエン：セスキテルペン炭化水素の一種。多くの植物の精油に含まれ、香料や化学合成の中間体として利用される。","english_definition":"A sesquiterpene hydrocarbon found in the essential oils of many plants, used as a fragrance and as an intermediate in chemical synthesis.","examples":[{"sentence":"Copaene is a precursor in the biosynthesis of other sesquiterpenoids.","translation":"コパエンは他のセスキテルペノイドの生合成における前駆体である。"},{"sentence":"The aroma of this plant is due in part to the presence of copaene.","translation":"この植物の香りは、一部コパエンの存在によるものである。"}],"collocations":["alpha-copaene","beta-copaene","copaene synthase"],"synonyms":["sesquiterpene","hydrocarbon"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Copaifera*, a group of tropical trees that produce copaiba balsam, which contains copaene.","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˈpeɪn/","syllables":"co-paene"},"inflection":{"noun_plural":"copaenes"},"usage_notes":{"explanation":"Copaene is primarily used in scientific and technical contexts, specifically in chemistry, botany, and perfumery. It is not a common word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["copaiba (balsam)","sesquiterpenoid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Copaene' is a technical term used in chemistry and biology. It refers to a specific type of organic compound found in certain plants. It's not a word you'd typically encounter outside of scientific or technical discussions. Understanding requires knowledge of organic chemistry and plant biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The GC-MS analysis revealed a significant amount of copaene in the sample.","translation":"GC-MS分析により、サンプル中にかなりの量のコパエンが含まれていることが明らかになった。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Copaene production is influenced by environmental factors.","translation":"コパエンの生産は環境要因の影響を受ける。","type":"noun","meaning_category":"chemical compound"}]}