{"word":"foreking","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語) 先祖、祖先、先代の王","english_definition":"(archaic) An ancestor; a predecessor, especially a king.","examples":[{"sentence":"He claimed descent from a line of forekings.","translation":"彼は先祖代々の王の血筋を引いていると主張した。"},{"sentence":"The forekings of this land built great monuments.","translation":"この地の先代の王たちは偉大な記念碑を建てた。"}],"collocations":["royal foreking","ancient foreking","line of forekings"],"synonyms":["ancestor","predecessor","forebear","progenitor"],"antonyms":["descendant","successor"]}],"etymology":{"value":"Derived from Old English 'fore-' (before, preceding) + 'cyning' (king).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrˌkɪŋ/","syllables":"fore-king"},"inflection":{"noun_plural":"forekings"},"usage_notes":{"explanation":"\"Foreking\" is an archaic term, meaning a king who came before. It is rarely used in modern English, with \"predecessor\" or \"ancestor\" being more common alternatives. The word evokes a sense of history and lineage, often used in contexts relating to royalty or ancient times.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is the foreking of the company.","correct":"He is the predecessor of the company.","note":"\"Foreking\" is typically used for royal or ancestral figures, not in a business context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["forebear","forefather","king","predecessor"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Foreking\" is an archaic term rarely encountered in contemporary English. Its meaning is relatively straightforward, referring to a king who reigned before the current one or a king in one's ancestry. Understanding the word requires familiarity with older English vocabulary and historical contexts. Due to its infrequent usage, it is more likely to be found in literature or historical documents."},"example_sentences":[{"sentence":"The epic poem tells of the deeds of the forekings of old.","translation":"その叙事詩は、古の先代の王たちの業績を語っている。","type":"noun","meaning_category":"先祖、祖先、先代の王"},{"sentence":"Each foreking left his mark on the kingdom's history.","translation":"それぞれの先代の王は、王国の歴史に足跡を残した。","type":"noun","meaning_category":"先祖、祖先、先代の王"}]}