{"word":"gorgeous-haired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having gorgeous hair; possessing strikingly beautiful or attractive hair.","english_definition":"Describing someone with strikingly beautiful or attractive hair.","examples":[{"sentence":"She's a gorgeous-haired model gracing the cover of the magazine.","translation":"彼女はゴージャスな髪のモデルで、雑誌の表紙を飾っています。"},{"sentence":"He was immediately drawn to the gorgeous-haired woman across the room.","translation":"彼は部屋の向こう側にいるゴージャスな髪の女性にすぐに惹かれました。"},{"sentence":"The princess is always depicted as a gorgeous-haired beauty in the storybooks.","translation":"お姫様はいつも物語の中でゴージャスな髪の美女として描かれています。"}],"collocations":["gorgeous-haired woman","gorgeous-haired model","gorgeous-haired beauty","naturally gorgeous-haired"],"synonyms":["beautiful-haired","stunning-haired","lovely-haired","attractive-haired","magnificent-haired"],"antonyms":["plain-haired","unattractive-haired","ordinary-haired"]}],"etymology":{"value":"Combination of 'gorgeous' (extremely beautiful or attractive) and 'haired' (having hair of a specified kind).","priority":"N/A"},"pronunciation":{"ipa":"/ˈɡɔːrdʒəsˌhɛərd/","syllables":"gor-geous-haired"},"inflection":{"notes":"This is an adjective and does not inflect for number or gender."},"usage_notes":{"explanation":"'Gorgeous-haired' is a descriptive adjective typically used to emphasize the beauty and attractiveness of someone's hair. It's often used in fashion, beauty, and descriptive writing.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a gorgeous haired.","correct":"✓ She is gorgeous-haired.","note":"'Gorgeous-haired' functions as a single adjective modifying a noun. It should not be separated."}],"priority":"N/A"},"related_words":{"derivatives":["gorgeousness (noun: the state of being gorgeous)","hair (noun: filaments growing from the skin)"],"phrases":["gorgeous hair (beautiful and attractive hair)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. The term is descriptive but not commonly used in everyday conversation.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'gorgeous-haired' is a relatively advanced descriptive adjective. It combines the common adjective 'gorgeous' with the suffix '-haired' to create a specific descriptor for someone with beautiful hair. Understanding requires familiarity with both the base word and the way compound adjectives are formed in English."},"example_sentences":[{"sentence":"The magazine featured a spread on gorgeous-haired celebrities.","translation":"その雑誌はゴージャスな髪のセレブを特集していました。","type":"adjective","meaning_category":"descriptive"},{"sentence":"With her long, flowing locks, she was the most gorgeous-haired girl in the room.","translation":"彼女の長く流れる髪で、彼女は部屋で最もゴージャスな髪の女の子でした。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The shampoo commercial showcased a woman with incredibly gorgeous-haired.","translation":"シャンプーのコマーシャルでは、信じられないほどゴージャスな髪の女性が紹介されていました。","type":"adjective","meaning_category":"descriptive"}]}