{"word":"desocialization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱社会化、社会からの離脱、社会性の喪失","english_definition":"The process by which people give up old norms, values, attitudes, and behaviors. It can also refer to the removal of someone from a social environment or context.","examples":[{"sentence":"Prison is an example of a place where desocialization can occur.","translation":"刑務所は脱社会化が起こりうる場所の一例です。"},{"sentence":"The cult used various techniques to induce desocialization in new members.","translation":"そのカルトは、新しいメンバーに脱社会化を誘発するために様々なテクニックを使った。"},{"sentence":"Extreme isolation can lead to desocialization and mental health issues.","translation":"極端な孤立は脱社会化や精神衛生上の問題につながる可能性があります。"}],"collocations":["lead to desocialization (脱社会化につながる)","experience desocialization (脱社会化を経験する)","undergo desocialization (脱社会化を経験する)","desocialization process (脱社会化の過程)"],"synonyms":["isolation","alienation","withdrawal","social detachment"],"antonyms":["socialization","integration","assimilation","social engagement"]},{"part_of_speech":"noun","definition":"(社会学)再社会化の準備段階","english_definition":"(Sociology) The first part of a two-part process of resocialization, in which individuals are forced to abandon their old habits and norms in preparation for learning new ones.","examples":[{"sentence":"Desocialization is a necessary step before resocialization can be effective.","translation":"脱社会化は、再社会化が効果的になるための必要なステップです。"},{"sentence":"Military boot camp involves a period of intense desocialization.","translation":"軍隊の新兵訓練キャンプは、集中的な脱社会化の期間を含みます。"}],"collocations":["desocialization and resocialization (脱社会化と再社会化)","intense desocialization (集中的な脱社会化)"],"synonyms":["deconditioning","unlearning"],"antonyms":["conditioning","learning"]}],"etymology":{"value":"Formed from 'de-' (meaning removal or reversal) + 'socialization'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˌsoʊʃəlaɪˈzeɪʃən/","syllables":"de-so-ci-al-i-za-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Desocialization refers to the process of relinquishing established social roles, norms, and values. It can be a deliberate process, such as in the military or a cult, or an unintentional consequence of isolation or social withdrawal. In sociology, it's often seen as the first step in resocialization, where individuals are prepared to adopt new behaviors and beliefs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is desocialized.","correct":"✓ He has experienced desocialization. / ✓ He is undergoing desocialization.","note":"'Desocialized' is not commonly used as an adjective. Instead, describe the experience or process. Use 'has experienced desocialization' or 'is undergoing desocialization'."},{"incorrect":"✗ Desocialization is good for mental health.","correct":"✓ Desocialization can have negative effects on mental health.","note":"Desocialization is generally considered to have negative consequences, especially if involuntary or extreme."}],"priority":"★★☆"},"related_words":{"derivatives":["desocialize (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Desocialization' is a term used to describe the process where someone gives up their old ways of thinking, behaving, and believing. This can happen when someone is removed from their usual social environment, like when they go to prison or join a cult. It's often a first step before someone can be taught new ways of behaving, which is called 'resocialization'. It's not a common word, but it's important for understanding how people's behavior can change when they are in new situations."},"example_sentences":[{"sentence":"The astronaut experienced a degree of desocialization after spending a year in space.","translation":"その宇宙飛行士は、宇宙で1年間過ごした後、ある程度の脱社会化を経験した。","type":"noun","meaning_category":"社会からの離脱"},{"sentence":"Desocialization can make it difficult for individuals to reintegrate into society.","translation":"脱社会化は、個人が社会に再統合することを困難にする可能性がある。","type":"noun","meaning_category":"社会性の喪失"},{"sentence":"The military aims to achieve desocialization of recruits to create a cohesive unit.","translation":"軍隊は、結束力のある部隊を作るために、新兵の脱社会化を目指している。","type":"noun","meaning_category":"再社会化の準備"}]}