{"word":"petrifaction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"石化作用、石化、石化状態","english_definition":"The process of being turned into stone or a stony substance.","examples":[{"sentence":"The petrifaction of wood can create beautiful fossils.","translation":"木の石化作用は美しい化石を作り出すことがあります。"},{"sentence":"The archaeologist studied the petrifaction process of the ancient bones.","translation":"考古学者は古代の骨の石化過程を研究しました。"},{"sentence":"Complete petrifaction can take millions of years.","translation":"完全な石化には数百万年かかることがあります。"}],"collocations":["petrifaction process (石化過程)","complete petrifaction (完全な石化)","fossil petrifaction (化石の石化)"],"synonyms":["fossilization","lithification","calcification"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に) ぼう然自失、硬直、無気力","english_definition":"(figuratively) The state of being paralyzed with fear, astonishment, or other strong emotion; a state of inactivity or apathy.","examples":[{"sentence":"She stood in petrifaction as the car sped towards her.","translation":"車が彼女に向かって猛スピードで走ってくるのを見て、彼女はぼう然と立ち尽くした。"},{"sentence":"The news caused a state of petrifaction throughout the office.","translation":"そのニュースはオフィス全体に無気力状態を引き起こした。"},{"sentence":"He was in complete petrifaction after witnessing the accident.","translation":"彼はその事故を目撃した後、完全に硬直していた。"}],"collocations":["state of petrifaction (硬直状態)","complete petrifaction (完全な硬直)","stand in petrifaction (ぼう然と立ち尽くす)"],"synonyms":["paralysis","stupefaction","immobilization","apathy","torpor"],"antonyms":["animation","activity","liveliness"]}],"etymology":{"value":"Derived from the Latin words 'petra' (rock or stone) and 'facere' (to make).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛtrɪˈfækʃən/","syllables":"pe-tri-fac-tion","audio_url":null},"inflection":{"noun_plural":"petrifactions"},"usage_notes":{"explanation":"'Petrifaction' refers to the process by which organic material is converted into stone or a substance resembling stone. It can also describe a state of being paralyzed by strong emotion. The figurative sense is less common than the literal one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The petrifaction made the plant grow faster.","correct":"The petrifaction preserved the plant as a fossil.","note":"Petrifaction doesn't cause growth; it preserves organic material in a stone-like form."},{"incorrect":"He was petrified, so he was in petrifaction.","correct":"He was petrified, so he was in a state of petrifaction.","note":"'Petrifaction' is the state itself, not the feeling. Use 'state of petrifaction' to describe the condition."}],"priority":"★★☆"},"related_words":{"derivatives":["petrify (verb)","petrified (adjective)"],"related_terms":["fossil","mineralization","lithification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Petrifaction' is a relatively uncommon word that refers to the process of turning something into stone, or a state of being paralyzed by fear or shock. It is more frequently used in scientific or historical contexts when discussing fossils and geological processes. The figurative sense is less common but can appear in literature or descriptive writing. Understanding the word requires a good vocabulary and familiarity with scientific terminology."},"example_sentences":[{"sentence":"The museum displayed several examples of wood that had undergone complete petrifaction.","translation":"博物館には、完全に石化した木の標本がいくつか展示されていました。","type":"noun","meaning_category":"石化作用"},{"sentence":"The sight of the enormous spider left her in a state of complete petrifaction.","translation":"巨大なクモを見た彼女は、完全に硬直してしまった。","type":"noun","meaning_category":"硬直"},{"sentence":"The petrifaction process replaces the organic material with minerals.","translation":"石化作用は有機物を鉱物に置き換える。","type":"noun","meaning_category":"石化作用"},{"sentence":"The sudden appearance of the ghost caused petrifaction among the guests.","translation":"幽霊が突然現れたため、客たちはぼう然自失となった。","type":"noun","meaning_category":"硬直"}]}