{"word":"Herodianic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヘロデ朝の、ヘロデ王家の、ヘロデに関連する","english_definition":"Of or pertaining to Herod the Great or his dynasty.","examples":[{"sentence":"The Herodianic dynasty ruled Judea for several generations.","translation":"ヘロデ朝は数世代にわたってユダヤを支配した。"},{"sentence":"Herodianic architecture is characterized by its grand scale and Roman influence.","translation":"ヘロデ朝の建築は、その壮大な規模とローマの影響によって特徴づけられる。"}],"collocations":["Herodianic dynasty","Herodianic architecture","Herodianic period","Herodianic rulers"],"synonyms":["Herodian","Herodean"],"antonyms":[]},{"part_of_speech":"adjective","definition":"（歴史学で）ヘロデ党の、ヘロデ派の","english_definition":"(historical) Pertaining to the Herodians, a Jewish sect mentioned in the New Testament who supported Herod.","examples":[{"sentence":"The Gospels mention the Pharisees conspiring with the Herodianic party against Jesus.","translation":"福音書には、パリサイ人がイエスに敵対してヘロデ党と共謀したことが記されている。"}],"collocations":["Herodianic party","Herodianic sect"],"synonyms":["Herodian","Herodean"],"antonyms":[]}],"etymology":{"value":"From Herod (the name of several rulers of Judea in the New Testament) + -ianic (suffix indicating belonging or relation).","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˌroʊdiˈænɪk/","syllables":"He-ro-di-an-ic"},"inflection":{"notes":"Adjective, does not have plural forms."},"usage_notes":{"explanation":"The term \"Herodianic\" is primarily used in historical and archaeological contexts to describe things related to the reign of Herod the Great and his successors. It can refer to architectural styles, political events, or religious factions during that period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was built in a Herodian style.","correct":"✓ The building was built in the Herodianic style.","note":"While \"Herodian\" can sometimes be used, \"Herodianic\" is the more precise and common adjective form."},{"incorrect":"✗ He was a member of the Herodian.","correct":"✓ He was a member of the Herodianic party.","note":"When referring to the political faction, it's important to specify \"Herodianic party\" or \"Herodians\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["Herod (noun: the name of several rulers of Judea)","Herodian (adjective/noun: related to Herod or a member of the Herodian party)","Herodias (noun: a female member of the Herodian family)"],"phrases":["Herod's Temple","Herod Antipas","Herod Agrippa"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in academic and historical texts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Herodianic\" is a specialized term primarily encountered in historical, archaeological, or religious studies contexts. It refers to anything related to Herod the Great and his dynasty, who ruled Judea during the Roman period. Understanding the term requires familiarity with the history of this period and the figures involved. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The excavations revealed several artifacts from the Herodianic period.","translation":"発掘調査により、ヘロデ朝時代のいくつかの遺物が発見された。","type":"adjective","meaning_category":"ヘロデ朝の"},{"sentence":"The Herodianic dynasty played a significant role in the history of Judea.","translation":"ヘロデ朝はユダヤの歴史において重要な役割を果たした。","type":"adjective","meaning_category":"ヘロデ王家の"},{"sentence":"The Herodianic party was a political faction that supported the rule of Herod.","translation":"ヘロデ党はヘロデの支配を支持した政治派閥だった。","type":"adjective","meaning_category":"ヘロデ党の"}]}