{"word":"alite","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(セメント化学) エーライトの、珪酸三カルシウムの","english_definition":"(cement chemistry) Relating to alite, or tricalcium silicate.","examples":[{"sentence":"The alite content of the cement is a key factor in its early strength development.","translation":"セメント中のエーライト含有量は、初期強度発現の重要な要素です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(セメント化学) エーライト、珪酸三カルシウム","english_definition":"(cement chemistry) A form of tricalcium silicate, a major component of Portland cement.","examples":[{"sentence":"Alite is responsible for the early strength development in Portland cement.","translation":"エーライトは、ポルトランドセメントの初期強度発現を担っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the chemical composition of tricalcium silicate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælaɪt/","syllables":"a-lite"},"inflection":{"notes":"As a noun, the plural is 'alites'. As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Alite' is a technical term used in cement chemistry to refer to tricalcium silicate, a major component of Portland cement. It is crucial for the cement's early strength. It is not commonly used outside of this specific scientific context.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["belite","celite","ferrite"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Alite' is a highly specialized term used within the field of cement chemistry. Understanding its meaning requires knowledge of the chemical composition and hydration processes of Portland cement. It is not a word commonly encountered in general English usage."},"example_sentences":[{"sentence":"The hydration of alite releases a significant amount of heat.","translation":"エーライトの水和反応は、大量の熱を放出します。","type":"noun","meaning_category":"セメント化学"},{"sentence":"The alite phase in cement clinker is crucial for its performance.","translation":"セメントクリンカー中のエーライト相は、その性能にとって非常に重要です。","type":"noun","meaning_category":"セメント化学"}]}