{"word":"dialist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) ダイヤル電話の利用者、ダイヤル回線利用者","english_definition":"(rare) A user of a dial telephone; a subscriber to a dial-up telephone service.","examples":[{"sentence":"In the early days of telephony, dialists were considered more modern than those with operator-assisted service.","translation":"電話の初期の頃、ダイヤル式電話の利用者は交換手を介したサービス利用者よりも進んでいると考えられていた。"},{"sentence":"The number of dialists has decreased significantly with the advent of mobile phones.","translation":"携帯電話の出現により、ダイヤル回線利用者の数は大幅に減少した。"}],"collocations":["dialist account","dialist service","become a dialist"],"synonyms":["telephone subscriber","phone user"],"antonyms":[]}],"etymology":{"value":"\"Dial\" + \"-ist\".","priority":"★★★"},"pronunciation":{"ipa":"ˈdaɪəlɪst","syllables":"di-a-list"},"inflection":{"noun_plural":"dialists"},"usage_notes":{"explanation":"The term 'dialist' is rarely used in modern English, as most telephone systems are now automated. It was more common in the early to mid-20th century when dial telephones were replacing operator-assisted systems.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["dial (verb, noun)","dial-up (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'dialist' is an archaic term. It refers to someone who uses a telephone with a dial, as opposed to one that requires an operator to connect calls. This term is rarely encountered in contemporary English. Understanding it requires knowledge of the history of telephone technology."},"example_sentences":[{"sentence":"Early dialists enjoyed the convenience of making calls without operator assistance.","translation":"初期のダイヤル式電話の利用者は、交換手の助けなしに通話できる便利さを享受した。","type":"noun","meaning_category":"ダイヤル電話の利用者"},{"sentence":"The telephone company aimed to convert all subscribers to dialist service by the end of the decade.","translation":"電話会社は、10年の終わりまでにすべての加入者をダイヤル回線サービスに移行させることを目指した。","type":"noun","meaning_category":"ダイヤル回線利用者"}]}