{"word":"sinistrocular","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"左利きの、左目優位の","english_definition":"Having the left eye as the dominant eye.","examples":[{"sentence":"A sinistrocular person might find it easier to aim a camera using their left eye.","translation":"左目優位の人は、左目を使ってカメラの照準を合わせるのが容易だと感じるかもしれません。"},{"sentence":"Sinistrocularity can influence certain visual tasks.","translation":"左目優位は特定の視覚タスクに影響を与える可能性があります。"}],"collocations":["sinistrocular vision","sinistrocular dominance","sinistrocular individual"],"synonyms":["left-eye dominant"],"antonyms":["dextrocular","right-eye dominant"]}],"etymology":{"value":"From Latin 'sinister' (left) + 'oculus' (eye) + '-ar' (suffix indicating pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˌnɪs.trɒk.jʊˈlɑːr/","syllables":"si-nis-troc-yu-lar"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Sinistrocular' describes the condition where the left eye is the dominant eye, meaning it provides a slightly stronger or more accurate visual input to the brain. This is analogous to being left-handed but applies to vision. It's a relatively uncommon term, primarily used in optometry, ophthalmology, and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is sinistrocular, so he writes with his left hand.","correct":"✓ He is sinistrocular, meaning his left eye is dominant.","note":"Sinistrocularity refers to eye dominance, not handedness. Handedness is a separate trait."}],"priority":"★★☆"},"related_words":{"derivatives":["sinistrocularity (noun)"],"related_terms":["ocular dominance","dextrocular","monocular","binocular"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sinistrocular' is a technical term used to describe the condition where the left eye is the dominant eye. This means that when both eyes are open, the brain relies more on the visual information from the left eye. It is a specialized term primarily encountered in optometry, ophthalmology, and vision science contexts. Understanding this term requires some familiarity with visual perception and eye dominance concepts."},"example_sentences":[{"sentence":"The optometrist determined that the patient was sinistrocular after performing a series of vision tests.","translation":"検眼医は、一連の視力検査を行った後、患者が左目優位であると判断しました。","type":"general"},{"sentence":"Understanding sinistrocularity is important in certain sports that require precise aiming.","translation":"左目優位を理解することは、正確な照準を必要とする特定のスポーツにおいて重要です。","type":"application"}]}