{"word":"contragredience","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)反傾性：ある座標変換の下で、ある集合の要素が別の集合の要素と反対方向に変換される性質。","english_definition":"(Mathematics) The property of a set of elements transforming in the opposite way to another set of elements under a coordinate transformation.","examples":[{"sentence":"The contragredience of covariant and contravariant vectors is a fundamental concept in tensor analysis.","translation":"共変ベクトルと反変ベクトルの反傾性は、テンソル解析における基本的な概念です。"}],"collocations":["tensor contragredience","vector contragredience"],"synonyms":["opposite transformation","inverse transformation"],"antonyms":["cogredience"]}],"etymology":{"value":"Derived from the Latin words 'contra' (against) and 'gradiens' (stepping, going).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒntrəˈɡriːdiəns/","syllables":"con-tra-gre-di-ence"},"inflection":{"noun_plural":"contragrediences"},"usage_notes":{"explanation":"This term is highly specific to mathematics, particularly in the field of linear algebra and tensor analysis. It describes how certain mathematical objects, such as vectors, transform under a change of basis. Covariant and contravariant vectors exhibit this property.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contragredience of the two functions showed they were similar.","correct":"✓ The cogredience of the two functions showed they were similar.","note":"Contragredience implies opposite transformation, whereas cogredience implies similar transformation."}],"priority":"★★☆"},"related_words":{"derivatives":["contragredient (adjective)"],"related_terms":["tensor","covariant","contravariant","cogredience"]},"level_frequency":{"CEFR":"N/A (highly specialized term)","frequency_google_ngram":"Very low frequency - a highly specialized term used primarily in mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Contragredience' is a highly technical term used in advanced mathematics, specifically in linear algebra and tensor analysis. It describes the inverse relationship in how certain mathematical objects (like covariant and contravariant vectors) transform under a change of basis. Due to its specialized nature, it's not commonly encountered outside of these specific mathematical contexts."},"example_sentences":[{"sentence":"The **contragredience** between the row and column vectors ensures the invariance of the bilinear form.","translation":"行ベクトルと列ベクトルの間の反傾性は、双一次形式の不変性を保証します。","type":"noun","meaning_category":"mathematics"}]}