{"word":"Chrematist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"貨殖家、金儲け主義者","english_definition":"A person who is devoted to or skilled in the accumulation of wealth; one who believes that wealth is the most important thing in life.","examples":[{"sentence":"He was described as a chrematist, always looking for the next profitable venture.","translation":"彼は常に次の儲かる事業を探している貨殖家だと評された。"},{"sentence":"The philosopher criticized the chrematist's single-minded pursuit of money.","translation":"その哲学者は、金儲け主義者の金銭のみを追求する姿勢を批判した。"}],"collocations":["successful chrematist","wealthy chrematist","criticize a chrematist","the chrematist's philosophy"],"synonyms":["materialist","money-grubber","capitalist","financier","profiteer"],"antonyms":["philanthropist","altruist","humanitarian"]}],"etymology":{"value":"Derived from the Greek word 'chrematistikos', pertaining to wealth or property, which in turn comes from 'chrema', meaning 'money' or 'property'. Aristotle used the term to describe the pursuit of wealth for its own sake, as opposed to 'economics', which he saw as the management of a household or state for the common good.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkriːmətɪst/","syllables":"chre-ma-tist"},"inflection":{"noun_plural":"chrematists"},"usage_notes":{"explanation":"The term 'chrematist' is often used in a negative or critical way to describe someone whose primary focus is on accumulating wealth, often at the expense of other values. It is less commonly used than terms like 'materialist' or 'money-grubber'. The word carries a historical and philosophical connotation, often referencing Aristotle's distinction between economics and chrematistics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a chrematist because he is happy.","correct":"✓ He is a chrematist because he is focused on accumulating wealth.","note":"'Chrematist' refers to a focus on wealth accumulation, not simply being happy."},{"incorrect":"✗ Chrematist is a good thing.","correct":"✓ Being a chrematist is often viewed critically.","note":"The term often has negative connotations."}],"priority":"★☆☆"},"related_words":{"derivatives":["chrematistics (noun: the branch of economics dealing with the manipulation of property and wealth so as to generate profit)"],"phrases":["Aristotle's chrematistics"],"related_concepts":["economics","materialism","capitalism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'chrematist' is a rare and specialized term, primarily used in philosophical or economic discussions. It refers to someone who is excessively focused on accumulating wealth, often to the exclusion of other values. This term is not commonly encountered in everyday language and is more likely to appear in academic or theoretical contexts. Understanding the historical and philosophical background, particularly Aristotle's use of the term, is essential for proper interpretation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor lectured on the dangers of becoming a chrematist, prioritizing wealth over ethical considerations.","translation":"教授は、倫理的配慮よりも富を優先する貨殖家になることの危険性について講義した。","type":"noun","meaning_category":"貨殖家"},{"sentence":"Some argue that modern capitalism encourages chrematist behavior.","translation":"現代の資本主義は金儲け主義的な行動を助長すると主張する人もいる。","type":"noun","meaning_category":"金儲け主義者"},{"sentence":"He amassed a vast fortune, but many considered him a mere chrematist, lacking in true values.","translation":"彼は莫大な財産を築いたが、多くの人は彼を真の価値観に欠ける単なる金儲け主義者だと考えた。","type":"noun","meaning_category":"金儲け主義者"}]}