{"word":"murally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"壁画のように、壁画的に","english_definition":"In the manner of a mural; relating to or resembling a mural.","examples":[{"sentence":"The artist designed the space to be murally decorated, with images wrapping around the entire room.","translation":"アーティストは、部屋全体を包み込むイメージで、壁画的に装飾されるように空間をデザインしました。"},{"sentence":"The story was told murally, with each scene depicted as a large, vibrant image on the wall.","translation":"物語は壁画的に語られ、各シーンは壁の大きな鮮やかなイメージとして描かれました。"}],"collocations":["decorate murally","depict murally","tell murally"],"synonyms":["pictorially","graphically","visually"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'mural' (a painting or other work of art executed directly on a wall) with the addition of the suffix '-ly' to form an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmjʊrəli/","syllables":"mu-ral-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb 'murally' is used to describe something that is done in the style of or relating to a mural. It is not a commonly used word, but it is useful for describing artistic or decorative efforts that resemble murals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was mural.","correct":"✓ The building was decorated murally.","note":"'Mural' is an adjective or a noun, not an adverb. Use 'murally' to describe how something is decorated or depicted."}],"priority":"★★★"},"related_words":{"derivatives":["mural (noun, adjective)","muralist (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Rare word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Murally' is a relatively rare adverb that describes something done in the style of a mural. It is more likely to be encountered in specialized contexts related to art, architecture, or design. Understanding the base word 'mural' is essential for comprehending the meaning of 'murally.'"},"example_sentences":[{"sentence":"The artist's vision was to transform the blank walls murally, creating an immersive experience for viewers.","translation":"アーティストのビジョンは、空白の壁を壁画的に変え、視聴者に没入型の体験を生み出すことでした。","type":"adverb","meaning_category":"壁画のように"},{"sentence":"The history of the town was depicted murally across the walls of the community center.","translation":"町の歴史は、コミュニティセンターの壁一面に壁画的に描かれていました。","type":"adverb","meaning_category":"壁画のように"}]}