{"word":"pussley","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スベリヒユ（滑莧）","english_definition":"A fleshy-leaved plant of the genus Portulaca, especially Portulaca oleracea, eaten as a vegetable or salad.","examples":[{"sentence":"Pussley is considered a weed in many places, but it is also edible.","translation":"スベリヒユは多くの場所で雑草とみなされていますが、食用にもなります。"},{"sentence":"I added some fresh pussley to the salad for a tangy flavor.","translation":"サラダに新鮮なスベリヒユを加えて、ピリッとした風味を出しました。"}],"collocations":["eat pussley","grow pussley","add pussley to salad"],"synonyms":["purslane","verdolaga"],"antonyms":[]}],"etymology":{"value":"The word \"pussley\" is a corruption of \"pursley,\" which is an alteration of \"purslane.\" The ultimate origin is Latin portulaca.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌsli/","syllables":"puss-ley"},"inflection":{"noun_plural":"pussleys"},"usage_notes":{"explanation":"Pussley is a common name for purslane (Portulaca oleracea), a succulent plant that is often considered a weed. However, it is also edible and used in salads and other dishes. The name \"pussley\" is less common than \"purslane.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a pussley in my garden, so I sprayed it with weed killer.","correct":"✓ I saw pussley in my garden, so I sprayed it with weed killer.","note":"Pussley is a noncount noun, so it does not take the indefinite article 'a'."}],"priority":"★☆☆"},"related_words":{"derivatives":["purslane","Portulaca oleracea"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Pussley is a relatively uncommon term for purslane, a plant that is sometimes eaten as a vegetable. It's more likely to be encountered in older texts or specific regional dialects. Understanding the term requires some botanical or culinary knowledge."},"example_sentences":[{"sentence":"The farmer identified the weed as pussley.","translation":"農家はその雑草をスベリヒユだと特定した。","type":"noun","meaning_category":"スベリヒユ"},{"sentence":"Some people consider pussley a delicacy.","translation":"スベリヒユを珍味と考える人もいる。","type":"noun","meaning_category":"スベリヒユ"}]}