{"word":"degrowth","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脱成長：経済成長を追求するのではなく、意図的に経済規模を縮小し、環境負荷を減らし、社会的な公平性を高めることを目指す思想および運動","english_definition":"A planned reduction of energy and resource use to bring the economy into balance with the planet's ecological limits. It is a political, economic, and social movement based on ecological economics and anti-consumerism.","examples":[{"sentence":"Degrowth is not simply about reducing GDP; it's about fundamentally rethinking our relationship with the environment and each other.","translation":"脱成長は単にGDPを減らすことではありません。それは、環境や他者との関係を根本的に考え直すことです。"},{"sentence":"Proponents of degrowth advocate for policies such as shorter working hours, local food systems, and a universal basic income.","translation":"脱成長の支持者たちは、労働時間の短縮、地元の食料システム、ユニバーサル・ベーシックインカムなどの政策を提唱しています。"},{"sentence":"The degrowth movement challenges the conventional wisdom that economic growth is always desirable.","translation":"脱成長運動は、経済成長が常に望ましいという従来の考え方に異議を唱えています。"}],"collocations":["implement degrowth","promote degrowth","support degrowth","degrowth policies","degrowth economics","degrowth movement"],"synonyms":["economic contraction (特定の文脈では)","sustainable degrowth","post-growth economics","steady-state economics"],"antonyms":["economic growth","growth","expansion","development"]},{"part_of_speech":"adjective","definition":"脱成長の、脱成長に関する","english_definition":"Relating to or advocating for degrowth.","examples":[{"sentence":"The degrowth perspective offers a critical lens on current economic models.","translation":"脱成長の視点は、現在の経済モデルに対する批判的なレンズを提供します。"},{"sentence":"Degrowth strategies aim to reduce consumption and waste.","translation":"脱成長戦略は、消費と廃棄物を削減することを目指しています。"}],"collocations":["degrowth strategy","degrowth perspective","degrowth principles","degrowth transition"],"synonyms":["post-growth","anti-growth"],"antonyms":["pro-growth","growth-oriented"]}],"etymology":{"value":"The term \"degrowth\" is derived from the French word \"décroissance,\" which emerged in the early 2000s. It was popularized by thinkers like Serge Latouche, who advocated for a shift away from growth-based economic models.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˈɡroʊθ/","syllables":"de-growth"},"inflection":{"notes":"It's a noun and adjective, so inflection is limited to pluralization (though the concept is usually discussed in the singular)."},"usage_notes":{"explanation":"\"Degrowth\" is a complex concept that goes beyond simply shrinking the economy. It involves a fundamental restructuring of society to prioritize ecological sustainability, social justice, and well-being over endless economic expansion. It's often misunderstood as advocating for recession or austerity, but it's a planned and deliberate transition to a more sustainable way of life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Degrowth means everyone will be poor.","correct":"✓ Degrowth aims to improve well-being while reducing environmental impact, not necessarily making everyone poor.","note":"Degrowth is not about impoverishment, but about prioritizing well-being and sustainability over material wealth."},{"incorrect":"✗ Degrowth is the same as a recession.","correct":"✓ Degrowth is a planned reduction in economic activity, while a recession is an unplanned economic downturn.","note":"Degrowth is a deliberate strategy, while a recession is an unwanted economic event."}],"priority":"★★☆"},"related_words":{"derivatives":["degrow (verb - less common)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing in academic and activist contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"degrowth\" refers to a planned reduction of energy and resource use to bring the economy into balance with ecological limits. It is a complex concept that challenges the conventional focus on economic growth, advocating instead for a shift towards sustainability, social justice, and well-being. Understanding \"degrowth\" requires familiarity with ecological economics and critical perspectives on mainstream economic theory."},"example_sentences":[{"sentence":"The degrowth conference brought together scholars and activists from around the world.","translation":"脱成長会議には、世界中の学者や活動家が集まりました。","type":"noun","meaning_category":"脱成長（概念）"},{"sentence":"A degrowth economy would prioritize local production and consumption.","translation":"脱成長経済は、地元の生産と消費を優先するでしょう。","type":"adjective","meaning_category":"脱成長の"},{"sentence":"Critics of degrowth argue that it is unrealistic and would lead to widespread unemployment.","translation":"脱成長の批判者たちは、それが非現実的であり、広範な失業につながると主張しています。","type":"noun","meaning_category":"脱成長（概念）"},{"sentence":"Degrowth principles emphasize reducing our ecological footprint.","translation":"脱成長の原則は、私たちのエコロジカル・フットプリントを削減することを強調しています。","type":"adjective","meaning_category":"脱成長の"},{"sentence":"The degrowth movement is gaining traction as concerns about climate change intensify.","translation":"気候変動への懸念が高まるにつれて、脱成長運動は勢いを増しています。","type":"noun","meaning_category":"脱成長（運動）"}]}