{"word":"moonsif","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A South Asian (particularly Indian) title or designation for a judge or judicial officer, especially in lower courts during the British colonial period.","english_definition":"(historical) A South Asian (particularly Indian) title or designation for a judge or judicial officer, especially in lower courts during the British colonial period.","examples":[{"sentence":"The moonsif presided over the local civil court.","translation":"ムーンシフはその地方の民事裁判所を主宰した。"},{"sentence":"As a moonsif, he was responsible for resolving minor disputes within the district.","translation":"ムーンシフとして、彼は地区内の小さな紛争を解決する責任があった。"}],"collocations":["appointed as moonsif","office of moonsif","the moonsif's court","senior moonsif"],"synonyms":["judge","magistrate","judicial officer"],"antonyms":[]}],"etymology":{"value":"From Urdu مُنصِف (munsif), from Arabic مُنْصِف (munṣif), meaning 'equitable, just, impartial'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːnsɪf/","syllables":"moon-sif"},"inflection":{"noun_plural":"moonsifs"},"usage_notes":{"explanation":"The term 'moonsif' is primarily used in historical contexts when discussing the judicial systems of British India and other parts of South Asia. It refers to a specific type of judicial officer, typically in the lower ranks of the court system. The term is not commonly used in contemporary legal settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a moonsif in the Supreme Court.","correct":"✓ He was a moonsif in the district court during the British Raj.","note":"Moonsifs were typically lower-court judges, not associated with higher courts like the Supreme Court."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["munsiff court","British Raj","judicial system of India"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'moonsif' is a specialized term related to the historical judicial system of South Asia, particularly during the British colonial period. Understanding its meaning requires familiarity with the legal and administrative structures of that era. It is not a commonly used word in modern English, so it is more likely to be encountered in historical texts or academic discussions."},"example_sentences":[{"sentence":"The records of the case were reviewed by the moonsif before the final judgment.","translation":"最終判決の前に、事件の記録はムーンシフによって見直された。","type":"noun","meaning_category":"judge"},{"sentence":"The moonsif's decision was appealed to a higher court.","translation":"ムーンシフの決定は上級裁判所に上訴された。","type":"noun","meaning_category":"judge"}]}