{"word":"Taylorism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"テイラー主義、科学的管理法","english_definition":"A theory of management that analyzes and synthesizes workflows. Its main objective is improving economic efficiency, especially labor productivity. It was one of the earliest attempts to apply science to the engineering of processes and to management.","examples":[{"sentence":"Taylorism revolutionized manufacturing processes in the early 20th century.","translation":"テイラー主義は20世紀初頭の製造プロセスに革命をもたらした。"},{"sentence":"Some critics argue that Taylorism dehumanizes workers by treating them like machines.","translation":"テイラー主義は労働者を機械のように扱うことで人間性を奪うと批判する人もいる。"},{"sentence":"The principles of Taylorism are still used in some industries today.","translation":"テイラー主義の原則は今日でも一部の産業で使用されている。"}],"collocations":["scientific management","time-motion study","efficiency expert","assembly line"],"synonyms":["scientific management","efficiency movement"],"antonyms":["human relations movement","job enrichment","holistic management"]}],"etymology":{"value":"Named after Frederick Winslow Taylor (1856-1915), an American mechanical engineer who sought to improve industrial efficiency.","priority":"★★★"},"pronunciation":{"ipa":"/ˈteɪlərɪzəm/","syllables":"Tay-lor-ism"},"inflection":{"noun_plural":"Taylorisms (rarely used)"},"usage_notes":{"explanation":"Taylorism is a management philosophy that emphasizes efficiency and productivity through the scientific analysis of work processes. It involves breaking down tasks into smaller, more manageable components, and optimizing each component for maximum efficiency. While it has been credited with significant gains in productivity, it has also been criticized for its potential to dehumanize workers and create monotonous work environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Taylorism is about making workers happy.","correct":"✓ Taylorism is about increasing efficiency.","note":"Taylorism primarily focuses on efficiency and productivity, not necessarily worker happiness. Worker happiness is a secondary consideration, if at all."},{"incorrect":"✗ Taylorism is the same as socialism.","correct":"✓ Taylorism is a management theory focused on efficiency.","note":"Taylorism is a management theory, while socialism is an economic and political system. They are unrelated."}],"priority":"★★☆"},"related_words":{"derivatives":["Taylorist (noun/adjective)","Taylorize (verb)"],"related_concepts":["time-motion study","scientific management","industrial engineering","efficiency","productivity"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but common in discussions of management theory and industrial history.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Taylorism is a more advanced concept related to business and management. It describes a specific approach to organizing work that focuses on making it as efficient as possible. To understand Taylorism, you need to know about business and economic concepts. It's not something you'd typically encounter in everyday conversation, but it's important in the context of business studies and history."},"example_sentences":[{"sentence":"The company implemented Taylorism to streamline its production process.","translation":"その会社は生産プロセスを合理化するためにテイラー主義を導入した。","type":"general","meaning_category":"Implementation"},{"sentence":"Critics of Taylorism argue it can lead to worker burnout.","translation":"テイラー主義の批判者たちは、それが労働者の燃え尽き症候群につながる可能性があると主張する。","type":"criticism","meaning_category":"Criticism"},{"sentence":"Taylorism involves detailed time-motion studies to optimize each task.","translation":"テイラー主義は、各タスクを最適化するために詳細な時間動作研究を伴う。","type":"methodology","meaning_category":"Methodology"}]}