{"word":"glycerine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"グリセリン","english_definition":"A colorless, odorless, viscous liquid, sweet-tasting trihydric alcohol, C3H5(OH)3, obtained from fats and oils as a byproduct of saponification; used as a solvent, emollient, antifreeze, and humectant.","examples":[{"sentence":"Glycerine is used in many cosmetic products.","translation":"グリセリンは多くの化粧品に使用されている。"},{"sentence":"Glycerine can be used as a moisturizer.","translation":"グリセリンは保湿剤として使用できる。"}],"collocations":["crude glycerine","refined glycerine","vegetable glycerine","glycerine soap","glycerine suppository"],"synonyms":["glycerol","propanetriol","glycerin"],"antonyms":[]}],"etymology":{"value":"From French glycérine, coined by French chemist Michel Eugène Chevreul in 1811, from Greek γλυκερός (glykerós, “sweet”), referring to its taste.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡlɪsəˌriːn/","syllables":"gly-ce-rine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Glycerine' and 'glycerol' are often used interchangeably, although 'glycerol' is the more formal chemical name. 'Glycerin' is also a common spelling variant. Glycerine is widely used in pharmaceuticals, cosmetics, and food industries due to its moisturizing and solvent properties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I put glycerine on my skin and it became very dry.","correct":"✓ I put glycerine on my skin, and it felt moisturized.","note":"Glycerine is a humectant, meaning it attracts moisture. If used in very dry environments, it can theoretically draw moisture from the skin, but this is uncommon. It generally provides a moisturizing effect."}],"priority":"★★☆"},"related_words":{"derivatives":["glyceride","triglyceride"],"phrases":["nitroglycerine"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glycerine' is a chemical compound used in various applications, particularly in cosmetics and pharmaceuticals, for its moisturizing properties. Understanding its use requires some familiarity with chemistry and product formulations. It's not a commonly used word in everyday conversation, but is important in specific technical contexts."},"example_sentences":[{"sentence":"The chemist synthesized glycerine from vegetable oils.","translation":"化学者は植物油からグリセリンを合成した。","type":"technical","meaning_category":"chemical synthesis"},{"sentence":"Glycerine is a key ingredient in this hand lotion.","translation":"グリセリンはこのハンドローションの重要な成分です。","type":"cosmetic","meaning_category":"cosmetics"},{"sentence":"The cough syrup contains glycerine to soothe the throat.","translation":"この咳止めシロップには、喉を鎮めるためにグリセリンが含まれています。","type":"pharmaceutical","meaning_category":"pharmaceuticals"}]}