{"word":"plough-boy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"耕作少年、農耕少年、耕耘少年（主に歴史的な文脈で使用される、耕作に従事する若い男性）","english_definition":"A young boy who works in the fields, typically plowing; mainly used in historical contexts.","examples":[{"sentence":"The plough-boy whistled as he followed the oxen across the field.","translation":"耕作少年は、畑で牛を追いながら口笛を吹いた。"},{"sentence":"Many a plough-boy dreamed of a better life in the city.","translation":"多くの農耕少年が、都市でのより良い生活を夢見ていた。"}],"collocations":["a young plough-boy","a sturdy plough-boy","the life of a plough-boy"],"synonyms":["farm boy","field hand","agricultural worker (young)"],"antonyms":["landowner","gentleman"],"notes":"This term is somewhat archaic and not commonly used in modern English. It evokes a historical or literary image of rural life."}],"etymology":{"value":"The word is a compound of 'plough' (or 'plow' in American English), referring to the farming implement used to turn the soil, and 'boy', indicating a young male.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplaʊˌbɔɪ/","syllables":"plough-boy"},"inflection":{"noun_plural":"plough-boys"},"usage_notes":{"explanation":"The term 'plough-boy' specifically refers to a young male engaged in plowing fields, typically in a historical or rural setting. It is less common in modern usage, where more general terms like 'farm boy' or 'agricultural worker' might be preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plough-boy was using a tractor.","correct":"✓ The farm boy was using a tractor.","note":"'Plough-boy' implies a historical context where plows were typically pulled by animals, not tractors."}],"priority":"★☆☆"},"related_words":{"derivatives":["plough (noun/verb)","boy (noun)"],"related_terms":["farmhand","fieldworker","agricultural labourer"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (rarely used)","frequency_google_ngram":"Low frequency - primarily found in historical texts and literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'plough-boy' is not commonly used in modern English. It is typically encountered in historical literature or discussions of rural life from past eras. Understanding the term requires knowledge of traditional farming practices and the role of young laborers in agriculture.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist painted a scene of rural life, featuring a rosy-cheeked plough-boy.","translation":"画家は、バラ色の頬をした耕作少年をフィーチャーした田園生活の場面を描いた。","type":"noun","meaning_category":"農耕少年"},{"sentence":"Life was hard for the plough-boy, working long hours in the fields.","translation":"畑で長時間働く耕作少年にとって、生活は厳しかった。","type":"noun","meaning_category":"農耕少年"}]}