{"word":"tuberculariaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"結核菌に似た、または結核菌に関連する","english_definition":"Resembling or pertaining to the genus *Tuberculariacea* (now obsolete), or having similar characteristics to fungi of that type.","examples":[{"sentence":"The fungal growth exhibited a tuberculariaceous appearance.","translation":"その菌類の成長は結核菌に似た外観を示した。"}],"collocations":[],"synonyms":["tuberculate","fungal"],"antonyms":[]}],"etymology":{"value":"Derived from the obsolete fungal genus name *Tuberculariacea* + -ous (suffix indicating resemblance or pertaining to). The genus name itself comes from *Tuberculosis* (the disease) due to some superficial resemblance of the fungal structures to tubercles.","priority":"★★☆"},"pronunciation":{"ipa":"/t(j)uːˌbɜːrkjʊləˈreɪʃəs/","syllables":"tu-ber-cu-la-ri-a-ceous"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'tuberculariaceous' is highly specialized and primarily used in mycology (the study of fungi). It describes fungal structures or growth patterns that resemble those formerly classified under the genus *Tuberculariacea*. This genus is now considered obsolete, and the fungi previously classified within it have been reclassified into other genera. The term is rarely encountered outside of technical or historical mycological contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Tuberculariaceae (obsolete fungal genus)","tuberculate (having tubercles or wart-like projections)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized term)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Tuberculariaceous' is a highly technical term used in mycology to describe fungi with characteristics similar to those formerly classified under the genus *Tuberculariacea*. Due to its specialized nature and the obsolescence of the reference genus, the term is rarely encountered outside of expert mycological contexts. Understanding requires familiarity with fungal morphology and taxonomic history."},"example_sentences":[{"sentence":"Microscopic examination revealed a distinctly tuberculariaceous sporulation pattern.","translation":"顕微鏡検査により、明らかに結核菌に似た胞子形成パターンが明らかになった。","type":"adjective","meaning_category":"Resembling *Tuberculariacea* fungi"}]}