{"word":"Nagual","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(メソアメリカのシャーマニズムにおいて) 人間が変身できるとされる動物の精霊、またはその変身能力を持つ人間","english_definition":"(in Mesoamerican shamanism) a spirit that takes animal form, into which a person (usually a shaman) can transform themselves; also, a person believed to have the power to transform into an animal.","examples":[{"sentence":"The shaman was believed to be a powerful nagual, capable of turning into a jaguar.","translation":"そのシャーマンは、ジャガーに変身できる強力なナワルだと信じられていた。"},{"sentence":"According to local legends, the nagual protects the village from evil spirits.","translation":"地元の伝説によると、ナワルは悪霊から村を守っている。"}],"collocations":["become a nagual","powerful nagual","nagual spirit","transform into a nagual"],"synonyms":["spirit animal","totem","familiar"],"antonyms":[]}],"etymology":{"value":"ナワトル語の「nahualli」（隠された、隠蔽された、変装した）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/nɑːˈɡwɑːl/","syllables":"na-gual"},"inflection":{"noun_plural":"naguals"},"usage_notes":{"explanation":"「**Nagual**」は、主にメソアメリカの文化、特にナワトル語を話す人々（アステカなど）のシャーマニズムに関連する言葉です。動物の姿に変身できる精霊、またはそのような力を持つ人間を指します。ナワルは、個人またはコミュニティの守護霊として機能すると考えられています。この概念は、現代のニューエイジやスピリチュアリティの文脈でも使用されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a nagual of the forest.","correct":"✓ He is a nagual, capable of transforming into a jaguar.","note":"「nagual」は、場所や物を指すのではなく、変身能力を持つ人または動物の精霊を指します。"},{"incorrect":"✗ Nagual is a type of witchcraft.","correct":"✓ Nagualism is a type of shamanism or belief system.","note":"「nagual」は、シャーマニズムや信仰体系の一部であり、特定の種類の魔術ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["nahualism (ナワリズム、ナワルの信仰体系)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Nagual**」は、メソアメリカの文化におけるシャーマニズムに関連する専門用語であり、一般的にはあまり知られていません。この単語は、動物の姿に変身できる精霊、またはそのような力を持つ人間を指します。この概念は、アステカなどのナワトル語を話す人々にとって重要なものであり、現代のニューエイジやスピリチュアリティの文脈でも使用されることがあります。この単語を理解するには、メソアメリカの文化やシャーマニズムに関する知識が必要です。"},"example_sentences":[{"sentence":"The anthropologist studied the role of the nagual in the indigenous community.","translation":"人類学者は、先住民族のコミュニティにおけるナワルの役割を研究した。","type":"noun","meaning_category":"動物の精霊、変身能力を持つ人間"},{"sentence":"Some believe that the nagual can communicate with the spirit world.","translation":"ナワルは霊界と交信できると信じられている人もいる。","type":"noun","meaning_category":"動物の精霊、変身能力を持つ人間"}]}