{"word":"sterically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"立体的に、立体障害的に","english_definition":"In a manner relating to the spatial arrangement of atoms in a molecule and their effect on chemical reactions, especially with regard to steric hindrance.","examples":[{"sentence":"The reaction is sterically hindered by the bulky substituents.","translation":"その反応は、かさ高い置換基によって立体的に妨げられている。"},{"sentence":"Sterically demanding ligands are used to control the selectivity of the catalyst.","translation":"立体的に要求の厳しい配位子は、触媒の選択性を制御するために使用される。"}],"collocations":["sterically hindered","sterically demanding","sterically accessible"],"synonyms":["spatially","three-dimensionally"],"antonyms":[]}],"etymology":{"value":"Derived from 'steric', which relates to the spatial arrangement of atoms in a molecule, plus the suffix '-ally', indicating a manner or way. 'Steric' itself comes from the Greek word 'stereos', meaning solid or three-dimensional.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɛrɪkli/","syllables":"ster-i-cal-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Sterically' is an adverb used primarily in chemistry, especially organic and inorganic chemistry, to describe how the spatial arrangement of atoms or groups of atoms affects a chemical reaction or property. It often refers to steric hindrance, where bulky groups prevent reactions from occurring or slow them down. It can also describe the opposite effect, where a particular spatial arrangement facilitates a reaction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The molecule is steric.","correct":"✓ The molecule is sterically hindered.","note":"'Steric' is an adjective, but 'sterically' is the adverb. To describe that a molecule is affected by steric effects, use 'sterically hindered' or 'sterically crowded' rather than just 'steric'."}],"priority":"★☆☆"},"related_words":{"derivatives":["steric (adjective)","steric hindrance (noun)","stereochemistry (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sterically' is a technical term used in chemistry to describe how the spatial arrangement of atoms in a molecule affects its properties or reactions. It's often used to explain why some reactions are slow or don't happen at all due to steric hindrance, where bulky groups block the reaction site. This word is typically encountered in advanced chemistry texts and research papers."},"example_sentences":[{"sentence":"The bulky protecting group sterically blocks unwanted side reactions.","translation":"かさ高い保護基は、不要な副反応を立体的にブロックする。","type":"adverb","meaning_category":"spatial arrangement effect"},{"sentence":"The catalyst was designed to be sterically accessible to the substrate.","translation":"その触媒は、基質が立体的にアクセスしやすいように設計された。","type":"adverb","meaning_category":"spatial accessibility"}]}