{"word":"Condylarthrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(解剖学)顆状関節、楕円関節","english_definition":"(anatomy) A type of synovial joint where an ovoid articular surface, or condyle, is received into an elliptical cavity, permitting movement in two planes, allowing flexion, extension, adduction, abduction, and circumduction.","examples":[{"sentence":"The wrist joint is an example of a condylarthrosis, allowing for a wide range of motion.","translation":"手関節は顆状関節の一例であり、広範囲の運動を可能にする。"}],"collocations":["wrist joint (手関節)","radiocarpal joint (橈骨手根関節)","metacarpophalangeal joint (中手指節関節)"],"synonyms":["ellipsoidal joint","ovoid joint"],"antonyms":["ball and socket joint","hinge joint"]}],"etymology":{"value":"Derived from the Greek words 'kondylos' (knuckle, condyle) and 'arthron' (joint), combined with '-osis' (a condition or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒndɪlɑːrˈθroʊsɪs/","syllables":"con-dy-lar-thro-sis"},"inflection":{"noun_plural":"condylarthroses"},"usage_notes":{"explanation":"'Condylarthrosis' is a specific type of synovial joint characterized by an elliptical or ovoid shape that allows movement in two planes. It is less free-moving than a ball-and-socket joint but more flexible than a hinge joint.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The knee is a condylarthrosis joint.","correct":"✓ The knee is a hinge joint.","note":"The knee is a hinge joint, not a condylarthrosis. Condylarthroses are found in the wrist and knuckles."},{"incorrect":"✗ Condylarthrosis only allows for flexion and extension.","correct":"✓ Condylarthrosis allows for flexion, extension, abduction, adduction, and circumduction.","note":"Condylarthrosis joints permit movement in two planes, allowing for a wider range of motion than just flexion and extension."}],"priority":"★★☆"},"related_words":{"derivatives":["condyle (顆)","arthrology (関節学)","synovial joint (滑膜関節)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized anatomical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Condylarthrosis' is a technical term used in anatomy to describe a specific type of joint. It's not commonly used outside of medical or scientific contexts. Understanding this term requires knowledge of anatomical terminology and joint classifications."},"example_sentences":[{"sentence":"The radiocarpal joint, connecting the radius to the carpal bones, is a classic example of a **condylarthrosis**.","translation":"橈骨を手根骨に接続する橈骨手根関節は、顆状関節の典型的な例である。","type":"anatomical description","meaning_category":"definition"},{"sentence":"**Condylarthrosis** allows for movements such as bending the wrist forward (flexion), backward (extension), and side to side (abduction and adduction).","translation":"顆状関節は、手首を前方に曲げる（屈曲）、後方に伸ばす（伸展）、および左右に動かす（外転および内転）などの動きを可能にする。","type":"functional description","meaning_category":"function"}]}