{"word":"mannishnesses","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being mannish; the plural form indicates multiple instances or aspects of mannishness.","english_definition":"The quality of resembling or characteristic of a man; the plural form refers to multiple instances or aspects of this quality.","examples":[{"sentence":"Her mannishnesses were often criticized in that era.","translation":"彼女の男らしさは、その時代にはしばしば批判された。"},{"sentence":"The play explored various mannishnesses in its female characters.","translation":"その劇は、女性キャラクターにおけるさまざまな男らしさを探求した。"}],"collocations":["display mannishnesses","explore mannishnesses","criticize mannishnesses"],"synonyms":["masculinity","maleness","virility","manliness"],"antonyms":["femininity","womanliness"],"notes":"This word is relatively rare and often carries a negative connotation, particularly when applied to women."}],"etymology":{"value":"Derived from 'mannish' (resembling a man), with the suffix '-ness' added to form a noun indicating a state or quality, and then pluralized with '-es'.","priority":"Low"},"pronunciation":{"ipa":"/ˈmænɪʃnəsɪz/","syllables":"man-nish-ness-es"},"inflection":{"noun_plural":"mannishnesses"},"usage_notes":{"explanation":"'Mannishnesses' is the plural form of 'mannishness,' which describes qualities or characteristics considered typical of men, but applied to someone (often a woman) in a way that is seen as unusual or undesirable. The plural form suggests multiple instances or facets of these qualities.","priority":"Low"},"common_mistakes":{"examples":[{"incorrect":"✗ The mannishness are evident.","correct":"✓ The mannishnesses are evident.","note":"When referring to multiple instances or aspects, use the plural form 'mannishnesses'."}],"priority":"Low"},"related_words":{"derivatives":["mannish (adjective)","man (noun)","-ness (suffix)"],"priority":"Low"},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'mannishnesses' is a complex and rare term. It is used to describe multiple instances or aspects of qualities traditionally associated with men, especially when these qualities are observed in someone (often a woman) in a way that is considered atypical or undesirable. Due to its rarity and nuanced usage, it is more likely to be encountered in advanced literary or academic contexts."},"example_sentences":[{"sentence":"The author examined the mannishnesses present in the protagonist's behavior.","translation":"著者（作者）は、主人公の行動に見られる男らしさを検証した。","type":"General","meaning_category":"Quality of resembling a man"},{"sentence":"The societal disapproval of her mannishnesses led to her isolation.","translation":"彼女の男らしさに対する社会的な非難が、彼女の孤立につながった。","type":"General","meaning_category":"Quality of resembling a man"}]}