{"word":"preinjure","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"事前に怪我をさせる、怪我を負わせる前に（さらに）怪我をさせる","english_definition":"To injure beforehand; to injure (further) before an existing injury has healed.","examples":[{"sentence":"The athlete was preinjured during training, which affected their performance in the competition.","translation":"その選手はトレーニング中に事前に怪我をしていたため、競技でのパフォーマンスに影響が出た。"},{"sentence":"The doctor warned against preinjuring the already weakened muscle.","translation":"医師はすでに弱っている筋肉をさらに怪我させないように警告した。"}],"collocations":["preinjure a muscle","preinjure a ligament","preinjure an athlete"],"synonyms":["reinjure","aggravate","exacerbate"],"antonyms":["heal","recover","strengthen"]}],"etymology":{"value":"The word \"preinjure\" is formed by adding the prefix \"pre-\" (meaning before) to the word \"injure.\" It literally means to injure before or beforehand.","priority":"★★☆"},"pronunciation":{"ipa":"/priːˈɪndʒər/","syllables":"pre-in-jure"},"inflection":{"verb_forms":{"present_simple":["preinjure","preinjures"],"past_simple":"preinjured","past_participle":"preinjured","present_participle":"preinjuring"}},"usage_notes":{"explanation":"\"Preinjure\" is often used in sports and medical contexts to describe a situation where a person is injured before a competition or event, or where an existing injury is made worse before it has a chance to heal. It emphasizes the timing of the injury in relation to a subsequent event or condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He preinjured himself by accident.","correct":"✓ He injured himself by accident.","note":"If the injury is not related to a prior injury or event, simply use \"injure.\" \"Preinjure\" implies a specific context of injuring beforehand or further injuring an existing condition."}],"priority":"★☆☆"},"related_words":{"derivatives":["preinjury (noun: 事前の怪我)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Preinjure\" is a relatively uncommon word that means to injure someone or something before a specific event or before a previous injury has healed. It is often used in medical or sports contexts. The prefix \"pre-\" indicates that the injury occurs beforehand. It's important to distinguish it from simply \"injure,\" which means to cause harm or damage to someone or something."},"example_sentences":[{"sentence":"The therapist advised him to rest to avoid preinjuring his knee before the marathon.","translation":"セラピストは、マラソン前に膝をさらに怪我させないように、休むように彼にアドバイスした。","type":"verb","meaning_category":"事前に怪我をさせる"},{"sentence":"The study examined the factors that can lead to preinjuring athletes during training.","translation":"その研究は、トレーニング中に選手が事前に怪我をする原因となりうる要因を調査した。","type":"verb","meaning_category":"事前に怪我をさせる"}]}