{"word":"bush-fighter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゲリラ兵、森林地帯での戦闘員","english_definition":"A guerrilla fighter, especially one operating in a bush or forest environment.","examples":[{"sentence":"The bush-fighters emerged from the dense undergrowth, surprising the patrol.","translation":"ゲリラ兵たちは生い茂った下草から現れ、パトロール隊を驚かせた。"},{"sentence":"Local villagers often supported the bush-fighters with food and shelter.","translation":"地元の村人たちはしばしばゲリラ兵たちに食料と避難場所を提供した。"}],"collocations":["join the bush-fighters","bush-fighter tactics","anti-bush-fighter operations"],"synonyms":["guerrilla","insurgent","partisan","freedom fighter"],"antonyms":["regular soldier","conventional soldier","government soldier"]}],"etymology":{"value":"The term combines 'bush,' referring to a wild or uncultivated area, with 'fighter,' indicating someone engaged in combat. It suggests a fighter who operates in such an environment.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊʃˌfaɪtər/","syllables":"bush-fight-er"},"inflection":{"noun_plural":"bush-fighters"},"usage_notes":{"explanation":"The term 'bush-fighter' typically refers to irregular soldiers or guerrillas who are familiar with and operate in rural, often forested or bush-covered areas. It often implies a degree of local knowledge and adaptability to the environment. The term can sometimes carry connotations of being an unsophisticated or unconventional fighter, but also suggests resourcefulness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a bush fighter, so he lived in the city.","correct":"✓ He was a bush-fighter, so he lived in the bush.","note":"Bush-fighters typically operate in rural or forested areas, not urban environments."},{"incorrect":"✗ The bush-fighter used a tank to attack.","correct":"✓ The bush-fighter used guerilla tactics to attack.","note":"Bush-fighters typically rely on guerilla tactics, not heavy weaponry like tanks."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["guerrilla warfare","bush war","insurgency"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'bush-fighter' is relatively uncommon and specific, referring to a guerrilla fighter who operates in a rural, often forested or bush-covered environment. Understanding the term requires knowledge of military and political contexts, as well as an understanding of the connotations associated with guerrilla warfare. It is not typically used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The bush-fighters ambushed the convoy in the narrow mountain pass.","translation":"ゲリラ兵たちは狭い山道で車列を待ち伏せした。","type":"example","meaning_category":"Guerrilla warfare"},{"sentence":"Many bush-fighters were recruited from the local farming communities.","translation":"多くのゲリラ兵は地元の農村地域から徴兵された。","type":"example","meaning_category":"Recruitment"}]}