{"word":"nondegeneration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非退化性、退化しないこと","english_definition":"The state or quality of not degenerating; resistance to or absence of decline or deterioration.","examples":[{"sentence":"The nondegeneration of the tissue was a positive sign.","translation":"その組織の非退化性は良い兆候でした。"},{"sentence":"The treatment aimed to ensure the nondegeneration of the nerve cells.","translation":"その治療は、神経細胞の非退化性を確保することを目的としていました。"}],"collocations":["tissue nondegeneration","nerve cell nondegeneration"],"synonyms":["stability","preservation","maintenance","conservation","resistance to degradation"],"antonyms":["degeneration","deterioration","decline","degradation"]}],"etymology":{"value":"'non-' (否定接頭辞) + 'degeneration' (退化)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒndɪˌdʒɛnəˈreɪʃən/","syllables":"non-de-gen-er-a-tion"},"inflection":{"noun_plural":"nondegenerations"},"usage_notes":{"explanation":"'Nondegeneration' is primarily used in scientific and technical contexts, particularly in biology, medicine, and engineering, to describe the property of a system or substance that does not deteriorate or decline in quality or function over time. It is often used in contrast to 'degeneration,' which refers to the process of decline or deterioration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondegeneration was very good.","correct":"✓ The nondegeneration of the sample was very good.","note":"It's better to specify what is not degenerating. Use 'nondegeneration of X' rather than just 'nondegeneration' alone."}],"priority":"★★☆"},"related_words":{"derivatives":["nondegenerate (adjective)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondegeneration' is a technical term primarily used in scientific fields. It signifies the characteristic of something not declining or deteriorating. Understanding this term requires familiarity with scientific vocabulary and concepts related to stability and preservation. It's often used when discussing biological tissues, materials, or systems that maintain their quality or function over time.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the nondegeneration of articular cartilage in osteoarthritis patients.","translation":"その研究は、変形性関節症患者の関節軟骨の非退化性に焦点を当てていました。","type":"general","meaning_category":"非退化性"},{"sentence":"The material's nondegeneration under high temperatures makes it suitable for aerospace applications.","translation":"その材料の高温下での非退化性により、航空宇宙用途に適しています。","type":"technical","meaning_category":"非退化性"}]}