{"word":"eclecticism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"折衷主義、折衷主義的な傾向","english_definition":"the practice of deriving ideas, style, or taste from a broad and diverse range of sources.","examples":[{"sentence":"The building's architecture is an example of eclecticism, combining elements from different historical periods.","translation":"その建物の建築は、さまざまな歴史的時代の要素を組み合わせた折衷主義の例です。"},{"sentence":"Her musical taste demonstrates eclecticism, ranging from classical to hip-hop.","translation":"彼女の音楽の好みは、クラシックからヒップホップまで及ぶ折衷主義を示しています。"},{"sentence":"The philosopher's eclecticism allowed him to draw insights from various schools of thought.","translation":"その哲学者の折衷主義は、彼がさまざまな学派から洞察を引き出すことを可能にしました。"}],"collocations":["architectural eclecticism (建築における折衷主義)","philosophical eclecticism (哲学における折衷主義)","artistic eclecticism (芸術における折衷主義)","cultural eclecticism (文化における折衷主義)"],"synonyms":["assortment","diversity","variety","mixture","selection","hodgepodge"],"antonyms":["uniformity","homogeneity","orthodoxy","purity"]}],"etymology":{"value":"Derived from the Greek word 'eklektikos', meaning 'selective'. It comes from 'eklegein', meaning 'to pick out, select'.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈklektɪsɪzəm/","syllables":"e-clec-ti-cism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Eclecticism refers to the practice of choosing what seems best from a wide variety of sources or styles. It often implies a lack of strict adherence to any single system or doctrine, instead favoring a combination of elements from different traditions. In art, architecture, and philosophy, eclecticism can be seen as a way to create something new and unique by blending diverse influences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an eclectic person, so he follows only one style.","correct":"✓ He is an eclectic person, so he enjoys many different styles.","note":"Eclectic people enjoy a variety of styles, not just one."},{"incorrect":"✗ Eclecticism is the same as randomness.","correct":"✓ Eclecticism involves a deliberate selection of elements from different sources, not just randomness.","note":"Eclecticism involves a deliberate selection, not just randomness."}],"priority":"★★☆"},"related_words":{"derivatives":["eclectic (adjective: 折衷的な)","eclectically (adverb: 折衷的に)","eclecticist (noun: 折衷主義者)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eclecticism' refers to the practice of taking ideas, styles, or tastes from different sources and combining them. It's often used in discussions of art, architecture, philosophy, and culture. To understand it, think of someone who doesn't stick to one particular style but instead mixes and matches elements from various styles to create something new. It's a more advanced term, so you might encounter it in academic or specialized contexts."},"example_sentences":[{"sentence":"The restaurant's menu reflects an eclecticism of flavors from around the world.","translation":"そのレストランのメニューは、世界中の味の折衷主義を反映しています。","type":"noun","meaning_category":"general"},{"sentence":"Her approach to interior design is marked by eclecticism, blending modern and vintage pieces.","translation":"彼女のインテリアデザインへのアプローチは、モダンとヴィンテージの作品を融合させた折衷主義によって特徴づけられています。","type":"noun","meaning_category":"art/design"},{"sentence":"The professor's lectures demonstrated an eclecticism that drew from both Eastern and Western philosophical traditions.","translation":"その教授の講義は、東洋と西洋の哲学の伝統の両方から引き出された折衷主義を示しました。","type":"noun","meaning_category":"philosophy/academic"}]}