{"word":"Exodist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who participates in an exodus, especially a mass departure or emigration from a place.","english_definition":"A person who participates in an exodus, especially a mass departure or emigration from a place.","examples":[{"sentence":"The exodists sought refuge in neighboring countries.","translation":"エクソディストたちは近隣諸国に避難を求めた。"},{"sentence":"Many exodists were fleeing persecution and violence.","translation":"多くエクソディストたちは迫害と暴力から逃れていた。"}],"collocations":["mass exodist","political exodist","religious exodist"],"synonyms":["emigrant","refugee","migrant","displaced person"],"antonyms":["immigrant","settler"]}],"etymology":{"value":"Derived from 'exodus,' referring to a mass departure, with the suffix '-ist' denoting a person who participates in or advocates for something.","priority":"N/A"},"pronunciation":{"ipa":"ˈɛksədɪst","syllables":"ex-o-dist"},"inflection":{"noun_plural":"Exodists"},"usage_notes":{"explanation":"The term 'exodist' is primarily used to describe individuals involved in a large-scale departure, often due to political, economic, or environmental factors. It emphasizes the act of leaving rather than simply being a migrant.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The exodist immigrated to the new country.","correct":"✓ The exodist emigrated to the new country.","note":"'Exodist' implies emigration (leaving a place), not immigration (entering a place)."},{"incorrect":"✗ He is an exodist of the town.","correct":"✓ He is an exodist from the town.","note":"Use 'from' to indicate the place of origin."}],"priority":"N/A"},"related_words":{"derivatives":["exodus","exodic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Exodist' is a relatively uncommon word used to describe someone participating in an exodus, which is a large-scale departure of people from a place. It is often used in contexts involving refugees, mass migrations, or forced displacements. The word is formed by combining 'exodus' (a mass departure) with the suffix '-ist' (a person who does or is associated with something)."},"example_sentences":[{"sentence":"The war created a wave of exodists seeking safety across borders.","translation":"その戦争は国境を越えて安全を求めるエクソディストの波を生み出した。","type":"general","meaning_category":"mass departure"},{"sentence":"Environmental disasters can lead to communities becoming exodists, forced to abandon their homes.","translation":"環境災害は、コミュニティがエクソディストとなり、家を捨てることを余儀なくされる可能性がある。","type":"general","meaning_category":"mass departure"}]}