{"word":"automatism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自動症、無意識的行動、自動思考","english_definition":"behavior performed automatically without conscious thought or intention; a condition in which a person acts without self-awareness and is unable to control their movements or speech.","examples":[{"sentence":"The patient exhibited automatism during the seizure.","translation":"患者は発作中に自動症を示した。"},{"sentence":"Sleepwalking is a form of automatism.","translation":"夢遊病は自動症の一種である。"},{"sentence":"Some artists explore automatism as a method of creative expression.","translation":"一部の芸術家は、創造的な表現方法として自動主義を探求している。"}],"collocations":["exhibit automatism","a form of automatism","explore automatism","artistic automatism","motor automatism","mental automatism"],"synonyms":["involuntary action","unconscious behavior","automaticity","compulsion","somnambulism"],"antonyms":["conscious action","deliberate behavior","intentionality","volition"]},{"part_of_speech":"noun","definition":"(法律)心神喪失による無罪","english_definition":"(law) a legal defense claiming that the defendant's actions were involuntary due to a mental state, such as a seizure or sleepwalking, rendering them not criminally responsible.","examples":[{"sentence":"The lawyer argued automatism as a defense for his client.","translation":"弁護士は、依頼人の弁護として自動症を主張した。"},{"sentence":"The prosecution challenged the automatism defense, arguing the defendant was aware of their actions.","translation":"検察は、被告が自分の行動を認識していたと主張し、自動症の弁護に異議を唱えた。"}],"collocations":["automatism defense","non-insane automatism","insane automatism","successful automatism defense","challenge automatism"],"synonyms":["involuntary conduct","lack of mens rea","temporary insanity"],"antonyms":["mens rea","criminal intent","voluntary act"]}],"etymology":{"value":"Derived from 'automatic' + '-ism'. 'Automatic' comes from Greek 'automatos' meaning 'self-acting'. The suffix '-ism' denotes a condition, behavior, or doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtɒmətɪzəm/","syllables":"au-tom-a-ti-sm"},"inflection":{"noun_plural":"automatisms"},"usage_notes":{"explanation":"'Automatism' refers to actions performed without conscious control. In a medical context, it describes involuntary movements or behaviors, often associated with neurological conditions. In law, it serves as a defense, arguing that the defendant's actions were involuntary and therefore not criminal. In art, automatism is a technique where artists suppress conscious control to allow the subconscious mind to create art.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from automatism after drinking too much coffee.","correct":"✓ He exhibited signs of anxiety after drinking too much coffee.","note":"Automatism is typically associated with neurological conditions, seizures, or sleep disorders, not simply over-caffeination."},{"incorrect":"✗ The artist's work was full of automatism, making it very predictable.","correct":"✓ The artist's work was full of spontaneity, reflecting their exploration of automatism.","note":"Automatism in art aims to be spontaneous and unpredictable, reflecting the subconscious mind, not predictable."}],"priority":"★★☆"},"related_words":{"derivatives":["automatic","automaticity","automate"],"phrases":["motor automatism","mental automatism","artistic automatism","non-insane automatism","insane automatism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Automatism' is a technical term referring to involuntary actions or behaviors occurring without conscious intent. It is used in medical, legal, and artistic contexts. In medicine, it describes involuntary movements or behaviors linked to neurological conditions. In law, it's a defense arguing actions were involuntary. In art, it's a technique to create art from the subconscious. Understanding requires context-specific knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"During the complex partial seizure, the patient displayed oral automatism, such as lip-smacking.","translation":"複雑部分発作中、患者は唇をなめるなどの口腔自動症を示した。","type":"medical","meaning_category":"involuntary behavior"},{"sentence":"The defendant pleaded automatism, claiming he was sleepwalking during the alleged crime.","translation":"被告は、犯罪とされる行為中に夢遊病状態であったと主張し、自動症を訴えた。","type":"legal","meaning_category":"legal defense"},{"sentence":"Surrealist artists used automatism to tap into the unconscious mind and create spontaneous art.","translation":"シュルレアリスムの芸術家は、無意識に働きかけ、自発的な芸術を創造するために自動主義を用いた。","type":"artistic","meaning_category":"artistic technique"}]}