{"word":"doweral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Pertaining to or constituting dower.","english_definition":"Relating to the property a widow is entitled to from her deceased husband.","examples":[{"sentence":"The doweral rights of the widow were protected by law.","translation":"未亡人の寡婦財産権は法律で保護されていた。"}],"collocations":["doweral right","doweral property"],"synonyms":["dowry-related","marital property"],"antonyms":[]}],"etymology":{"value":"Derived from 'dower', referring to the portion of a deceased husband's estate allocated to his widow for her support.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊərəl/","syllables":"dow-er-al"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Doweral' specifically refers to matters or rights related to dower, which is the legal right of a widow to a portion of her deceased husband's property. It is a relatively uncommon term, mostly used in legal or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She received a doweral from her parents.","correct":"✓ She received a dowry from her parents.","note":"'Dower' relates to the widow's entitlement from her husband, while 'dowry' is property brought by a bride to her husband at marriage."}],"priority":"★★☆"},"related_words":{"derivatives":["dower (noun)","dowry (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Doweral' is a specialized term relating to the legal concept of dower, which is an archaic term for the portion of a deceased husband's estate allocated to his widow. This term is primarily encountered in legal or historical texts. Understanding requires familiarity with historical property laws and legal terminology."},"example_sentences":[{"sentence":"The agreement specified the doweral lands to be inherited by the widow.","translation":"その合意書は、未亡人が相続する寡婦財産地を明記していた。","type":"adjective","meaning_category":"Pertaining to dower"},{"sentence":"Doweral rights were a significant aspect of property law in the 19th century.","translation":"寡婦財産権は、19世紀の財産法における重要な側面であった。","type":"adjective","meaning_category":"Pertaining to dower"}]}