{"word":"asymptotic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"漸近線の、漸近的な","english_definition":"Approaching a given value or curve arbitrarily closely.","examples":[{"sentence":"The curve is asymptotic to the x-axis.","translation":"その曲線はx軸に漸近している。"},{"sentence":"Asymptotic behavior is often observed in mathematical models.","translation":"漸近的な振る舞いは、数理モデルでよく観察される。"}],"collocations":["asymptotic curve","asymptotic behavior","asymptotic analysis","asymptotic approximation","asymptotic expansion"],"synonyms":["approaching","tending","converging"],"antonyms":["diverging","oscillating","intersecting"]},{"part_of_speech":"adjective","definition":"（統計学で）サンプルサイズが無限大に近づくにつれて成り立つ","english_definition":"(Statistics) Holding true as the sample size becomes infinitely large.","examples":[{"sentence":"The estimator is asymptotically unbiased.","translation":"その推定量は漸近不偏である。"},{"sentence":"Asymptotic normality is a desirable property of estimators.","translation":"漸近正規性は、推定量にとって望ましい性質である。"}],"collocations":["asymptotic normality","asymptotic distribution","asymptotic efficiency","asymptotic variance"],"synonyms":["limiting","approximating"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'asymptotos', meaning 'not falling together'. This refers to lines that never meet, no matter how far they are extended. 'A-' means 'not' and 'symptotos' means 'falling together'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæsɪmˈtɒtɪk/","syllables":"as-ym-tot-ic"},"inflection":{"notes":"This word is primarily an adjective. There is no common verb or noun form directly derived from it, although 'asymptote' is the related noun."},"usage_notes":{"explanation":"The term 'asymptotic' is primarily used in mathematics, particularly in calculus, analysis, and geometry, to describe curves or functions that approach a certain value or another curve without ever actually reaching it. In statistics, it refers to properties that hold true as the sample size grows infinitely large. It's a concept that deals with limits and approximations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The function is always asymptotic.","correct":"✓ The function is asymptotic to the line y=0.","note":"'Asymptotic' requires specifying what the function is approaching. It's not simply a property a function possesses in isolation."},{"incorrect":"✗ The asymptote function.","correct":"✓ The asymptotic function.","note":"'Asymptote' is a noun (the line or value being approached), while 'asymptotic' is the adjective describing the behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["asymptote (noun): A line that a curve approaches but does not intersect.","asymptotically (adverb): In an asymptotic manner."],"related_concepts":["limit","convergence","divergence","approximation","infinity","calculus","analysis","statistics"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Highly specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'asymptotic' is a technical term primarily used in mathematics and statistics. It describes a situation where a curve or function approaches a value or another curve indefinitely closely but never actually reaches it. In statistics, it refers to properties that become true as the sample size grows infinitely large. Understanding this term requires a background in calculus, analysis, or statistics. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The function exhibits asymptotic growth, approaching a maximum value but never exceeding it.","translation":"その関数は漸近的な成長を示し、最大値に近づくが、それを超えることはない。","type":"adjective","meaning_category":"漸近的な"},{"sentence":"Asymptotic analysis helps us understand the behavior of algorithms with very large inputs.","translation":"漸近解析は、非常に大きな入力に対するアルゴリズムの振る舞いを理解するのに役立つ。","type":"adjective","meaning_category":"漸近的な"},{"sentence":"The estimator is asymptotically unbiased, meaning its bias approaches zero as the sample size increases.","translation":"その推定量は漸近不偏であり、サンプルサイズが増加するにつれてそのバイアスがゼロに近づくことを意味する。","type":"adjective","meaning_category":"（統計学で）サンプルサイズが無限大に近づくにつれて成り立つ"}]}