{"word":"Chromocollography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A color printing process using collagraphy techniques, where different colors are applied to different areas of a textured plate and then printed in a single pass.","english_definition":"A color printing process using collagraphy techniques, where different colors are applied to different areas of a textured plate and then printed in a single pass.","examples":[{"sentence":"Chromocollography allows for the creation of richly textured and multi-colored prints.","translation":"クロモコログラフィーは、豊かな質感と多色のプリントを作成できます。"}],"collocations":["create a chromocollograph","experiment with chromocollography","chromocollography print"],"synonyms":["color collagraphy","multi-color collagraphy"],"antonyms":[]}],"etymology":{"value":"Combination of \"chromo-\" (from Greek \"khroma\" meaning color), \"collo-\" (from Greek \"kolla\" meaning glue, referring to the collage-like nature of the plate), and \"-graphy\" (from Greek \"graphein\" meaning to write or draw).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkroʊmoʊkəˈlɒɡrəfi/","syllables":"chro-mo-col-log-ra-phy"},"inflection":{"noun_plural":"chromocollographies"},"usage_notes":{"explanation":"Chromocollography is a specialized printing technique that combines the principles of collagraphy (creating a printing plate from a collage of materials) with the application of multiple colors. It is often used by artists to produce unique and textured prints.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["collagraph","collagraphy","chromatic","monocollography"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized art term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Chromocollography is an advanced printing technique that uses textured plates to create colorful prints. It's a combination of collagraphy and color printing, allowing artists to produce unique and richly detailed artworks. This term is primarily used in artistic and printmaking contexts."},"example_sentences":[{"sentence":"The artist used chromocollography to create a series of abstract prints.","translation":"そのアーティストはクロモコログラフィーを使って一連の抽象的なプリントを作成しました。","type":"example","meaning_category":"artistic process"},{"sentence":"Chromocollography allows for a wide range of textures and colors in a single print.","translation":"クロモコログラフィーは、1つのプリントで幅広いテクスチャと色を表現できます。","type":"example","meaning_category":"technique characteristics"}]}