{"word":"resurrectible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"復活可能な、生き返らせることができる","english_definition":"Capable of being resurrected; able to be brought back to life or restored to a former state.","examples":[{"sentence":"The scientist believed that some extinct species might be resurrectible through advanced genetic engineering.","translation":"科学者は、高度な遺伝子工学によって、絶滅した種の中には復活可能なものもあるかもしれないと信じていた。"},{"sentence":"While the project faced many setbacks, its core idea remained resurrectible with sufficient funding and innovation.","translation":"プロジェクトは多くの挫折に直面したが、その中心的なアイデアは十分な資金と革新があれば復活可能であった。"}],"collocations":["resurrectible idea","resurrectible project","resurrectible species","resurrectible technology"],"synonyms":["revivable","restorable","recoverable","renewable"],"antonyms":["irrevocable","irreversible","unrecoverable","unrestorable"]}],"etymology":{"value":"The word is formed by combining 'resurrect' (to bring back to life) with the suffix '-ible' (capable of being). 'Resurrect' comes from Latin 'resurgere,' meaning 'to rise again.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛzəˈrɛktɪbəl/","syllables":"re-sur-rect-i-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more resurrectible' and 'most resurrectible,' respectively."},"usage_notes":{"explanation":"'Resurrectible' is a relatively rare word, primarily used in contexts where the possibility of bringing something back from a state of non-existence or failure is being discussed. It often appears in scientific, technological, or philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was resurrectable easily.","correct":"✓ The data was easily resurrectible.","note":"The adjective 'resurrectible' should be placed correctly to modify the noun. Using an adverb like 'easily' to modify the adjective is more appropriate."},{"incorrect":"✗ He is resurrectible after the accident.","correct":"✓ He might be resurrectible after the accident.","note":"The word implies a potential or capability, not a certainty. Adding 'might be' makes the sentence more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["resurrect (verb)","resurrection (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'resurrectible' is an advanced term indicating the capability of something to be brought back to life or restored. It is typically used in scientific, technological, or philosophical contexts when discussing the potential revival of extinct species, failed projects, or lost technologies. Understanding the root word 'resurrect' and the suffix '-ible' is key to grasping its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The old technology, though outdated, was considered resurrectible with modern upgrades.","translation":"その古い技術は時代遅れではあったが、現代的な改良を加えれば復活可能であると考えられていた。","type":"adjective","meaning_category":"capable of being restored"},{"sentence":"Some scientists speculate that certain extinct animals might be resurrectible using advanced cloning techniques.","translation":"一部の科学者は、高度なクローニング技術を用いれば、特定の絶滅動物が復活可能になるかもしれないと推測している。","type":"adjective","meaning_category":"able to be brought back to life"}]}