{"word":"primogenitary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"長子相続の、長子相続制の","english_definition":"relating to or denoting the principle of inheritance by the eldest son.","examples":[{"sentence":"The primogenitary system ensured that the family's wealth remained intact.","translation":"長子相続制は、家族の富が損なわれないようにした。"},{"sentence":"Primogenitary succession was the traditional method of passing on titles and estates.","translation":"長子相続による継承は、称号と財産を譲り渡す伝統的な方法だった。"}],"collocations":["primogenitary succession (長子相続)","primogenitary right (長子相続権)"],"synonyms":["hereditary","lineal","successional"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Old French primogeniture, from Latin primogenitura, from primogenitus ‘first-born’ (see primogeniture).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpraɪməˈdʒenɪteri/","syllables":"pri-mo-gen-i-ta-ry"},"inflection":{"notes":"This word does not have standard inflections beyond comparative/superlative, which are rarely used."},"usage_notes":{"explanation":"The term 'primogenitary' is primarily used in historical and legal contexts to describe systems or rights related to primogeniture, the practice of the eldest son inheriting the bulk or entirety of the family's estate and titles. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The primogenitary child was a daughter.","correct":"✓ Under primogeniture, the eldest son inherits, regardless of whether there are daughters.","note":"Primogeniture specifically refers to inheritance by the eldest *son*. If the eldest child is a daughter, different inheritance rules would apply (or the system would not be strictly primogeniture)."},{"incorrect":"✗ The primogenitary family was very wealthy.","correct":"✓ The family that practiced primogeniture was very wealthy.","note":"'Primogenitary' describes the *system* or *rights*, not the family itself. A family *practices* primogeniture."}],"priority":"★☆☆"},"related_words":{"derivatives":["primogeniture (長子相続)","primogenitor (始祖、先祖)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Primogenitary' is a formal and relatively rare term primarily encountered in discussions of history, law, and social structures. It specifically relates to the concept of primogeniture, the system where the eldest son inherits the family's estate. Understanding this term requires familiarity with historical inheritance practices and legal terminology."},"example_sentences":[{"sentence":"The feudal system often relied on primogenitary laws to maintain power within noble families.","translation":"封建制度は、貴族の家系内で権力を維持するために、しばしば長子相続の法律に依存していた。","type":"adjective","meaning_category":"長子相続制の"},{"sentence":"The primogenitary right ensured that the eldest son received the ancestral lands.","translation":"長子相続権は、長男が先祖伝来の土地を受け継ぐことを保証した。","type":"adjective","meaning_category":"長子相続の"}]}