{"word":"Daltonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"色覚異常の、特に赤緑色盲の","english_definition":"Relating to or characterized by color blindness, especially red-green color blindness.","examples":[{"sentence":"The test revealed that he was daltonic.","translation":"検査の結果、彼が色覚異常であることがわかった。"},{"sentence":"Daltonic individuals may have difficulty distinguishing between red and green.","translation":"色覚異常の人は、赤と緑の区別が難しいことがある。"}],"collocations":["daltonic vision","daltonic person","daltonic test"],"synonyms":["color-blind","color deficient"],"antonyms":["color-seeing","normal color vision"]},{"part_of_speech":"noun","definition":"色覚異常者、特に赤緑色盲者","english_definition":"A person who is color-blind, especially red-green color-blind.","examples":[{"sentence":"Daltonics often rely on other cues to identify objects.","translation":"色覚異常者は、物体を識別するために他の手がかりに頼ることが多い。"},{"sentence":"The study focused on the challenges faced by daltonics.","translation":"その研究は、色覚異常者が直面する課題に焦点を当てた。"}],"collocations":["a daltonic","daltonics in society"],"synonyms":["color-blind person"],"antonyms":["person with normal color vision"]}],"etymology":{"value":"Named after John Dalton, the English chemist and physicist who published the first scientific paper on color blindness in 1798, based on his own condition.","priority":"★★★"},"pronunciation":{"ipa":"/dɔːlˈtɒnɪk/","syllables":"Dal-ton-ic"},"inflection":{"noun_plural":"Daltonics"},"usage_notes":{"explanation":"The term \"Daltonic\" is directly related to John Dalton's study of color blindness. While \"color-blind\" is a more common and widely understood term, \"Daltonic\" specifically refers to the type of color blindness that Dalton himself experienced, primarily difficulty distinguishing between red and green.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a daltonism.","correct":"✓ He is daltonic.","note":"\"Daltonic\" is an adjective, not a noun for the condition itself. \"Daltonism\" is the noun for the condition, but \"color blindness\" is more common. To describe a person, use \"He is daltonic\" or \"He is color-blind.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Daltonism (色覚異常、特に赤緑色盲)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. More common in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Daltonic\" is a more specific and less commonly used term for color blindness, particularly red-green color blindness. It is derived from the name of John Dalton, who first described the condition scientifically. While \"color-blind\" is more widely understood, \"Daltonic\" may be encountered in scientific or historical contexts related to the study of color vision deficiency. Understanding the connection to John Dalton is key to grasping the term's origin and usage."},"example_sentences":[{"sentence":"As a daltonic, he struggled to differentiate between certain shades of red and green.","translation":"色覚異常者として、彼は特定の色合いの赤と緑を区別するのに苦労した。","type":"adjective","meaning_category":"色覚異常の"},{"sentence":"Many daltonics find workarounds to compensate for their color vision deficiency.","translation":"多くの色覚異常者は、色覚異常を補うための対策を見つけている。","type":"noun","meaning_category":"色覚異常者"}]}