{"word":"locally-controlled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"地方自治体が管理する、地域主導で管理される","english_definition":"Managed or governed by local authorities or community members, rather than by a central or national entity.","examples":[{"sentence":"The school is locally-controlled, allowing the community to tailor the curriculum to meet their specific needs.","translation":"その学校は地方自治体が管理しており、地域社会が特定のニーズに合わせてカリキュラムを調整できるようになっている。"},{"sentence":"Locally-controlled businesses are often more responsive to the needs of the community.","translation":"地域主導で管理される企業は、地域社会のニーズにより迅速に対応できることが多い。"},{"sentence":"The project aims to establish a locally-controlled water management system.","translation":"そのプロジェクトは、地域主導で管理される水管理システムを確立することを目的としている。"}],"collocations":["locally-controlled school (地方自治体が管理する学校)","locally-controlled business (地域主導で管理される企業)","locally-controlled government (地方自治政府)","locally-controlled resources (地域主導で管理される資源)"],"synonyms":["community-managed","decentralized","regional","municipal"],"antonyms":["centrally-controlled","nationally-controlled","federally-controlled","state-controlled"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'locally' (referring to a specific area or community) and 'controlled' (meaning having power or influence over something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈloʊkəli kənˈtroʊld/","syllables":"lo-cal-ly con-trolled"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Locally-controlled' emphasizes that decision-making power and management responsibilities reside within a specific geographic area or community, rather than being dictated by a larger, more distant authority. It often implies a greater degree of responsiveness to local needs and preferences.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The controlled is locally.","correct":"✓ The control is local. / ✓ It is locally controlled.","note":"'Locally' is an adverb, so it modifies the verb 'controlled'. The incorrect sentence uses the adjective form instead."}],"priority":"N/A"},"related_words":{"derivatives":["local (adjective, noun)","control (verb, noun)","decentralization (noun)","autonomy (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency. The term is relatively specialized.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Locally-controlled' is a compound adjective describing something managed by local authorities or community members. It suggests decentralization and community involvement. Understanding requires familiarity with concepts of local governance and autonomy."},"example_sentences":[{"sentence":"The success of the program hinges on its being locally-controlled and responsive to community needs.","translation":"そのプログラムの成功は、地域主導で管理され、地域社会のニーズに対応できるかどうかにかかっている。","type":"adjective","meaning_category":"地方自治体が管理する"},{"sentence":"The debate centers on whether healthcare should be locally-controlled or managed at the state level.","translation":"議論の中心は、医療を地方自治体が管理すべきか、州レベルで管理すべきかという点にある。","type":"adjective","meaning_category":"地域主導で管理される"}]}