{"word":"myocardium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"心筋","english_definition":"the muscular tissue of the heart. It forms the bulk of the heart wall and is responsible for the heart's pumping action.","examples":[{"sentence":"The myocardium is responsible for contracting and pumping blood throughout the body.","translation":"心筋は収縮して全身に血液を送り出す役割を担っています。"},{"sentence":"An electrocardiogram (ECG) can help detect damage to the myocardium.","translation":"心電図（ECG）は心筋の損傷を発見するのに役立ちます。"},{"sentence":"Myocardial infarction, or a heart attack, occurs when blood flow to the myocardium is blocked.","translation":"心筋梗塞、または心臓発作は、心筋への血流が遮断されたときに起こります。"}],"collocations":["myocardial infarction (心筋梗塞)","myocardial ischemia (心筋虚血)","myocardial damage (心筋損傷)","myocardial cells (心筋細胞)","left ventricular myocardium (左室心筋)","right ventricular myocardium (右室心筋)"],"synonyms":["cardiac muscle","heart muscle"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'myo-' meaning 'muscle', 'cardio-' meaning 'heart', and '-ium' a suffix indicating tissue.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪ.oʊˈkɑːr.di.əm/","syllables":"my-o-car-di-um"},"inflection":{"noun_plural":"myocardia (less common)"},"usage_notes":{"explanation":"'Myocardium' is a technical term used primarily in medical and scientific contexts. It refers specifically to the muscular layer of the heart. It is most often encountered in discussions of heart disease, cardiology, and related medical fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The myocardium is a bone in the heart.","correct":"✓ The myocardium is a muscle in the heart.","note":"The myocardium is muscle tissue, not bone."},{"incorrect":"✗ Myocardium is an infection of the heart.","correct":"✓ Myocarditis is an infection of the heart.","note":"Myocarditis is the infection; myocardium is the muscle itself."}],"priority":"★★☆"},"related_words":{"derivatives":["myocardial (adjective: relating to the myocardium)","myocarditis (noun: inflammation of the myocardium)","cardiomyopathy (noun: disease of the heart muscle)"],"phrases":["myocardial bridge (心筋ブリッジ)","stunned myocardium (気絶心筋)","hibernating myocardium (冬眠心筋)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Myocardium' is a highly specialized term used in medicine and biology. Understanding its meaning requires knowledge of basic anatomy and physiology, particularly the structure and function of the heart. The word itself is derived from Greek roots, reflecting its scientific origins. It is unlikely to be encountered in general conversation but is essential for those studying or working in healthcare.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor explained that the patient's chest pain was due to myocardial ischemia.","translation":"医師は、患者の胸痛は心筋虚血によるものだと説明しました。","type":"general","meaning_category":"medical"},{"sentence":"Research is focused on developing new therapies to protect the myocardium during a heart attack.","translation":"研究は、心臓発作中に心筋を保護するための新しい治療法の開発に焦点を当てています。","type":"research","meaning_category":"medical"},{"sentence":"An MRI scan revealed scarring in the left ventricular myocardium.","translation":"MRI検査で左室心筋の瘢痕が明らかになった。","type":"diagnosis","meaning_category":"medical"}]}