{"word":"amphipneustic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"両生呼吸の、両呼吸性の","english_definition":"Having both gills and lungs; breathing both by gills and lungs. Also, having both a spiracle at the front and one at the back of the body.","examples":[{"sentence":"The amphipneustic larva of some insects can breathe both in water and in air.","translation":"一部の昆虫の両生呼吸幼虫は、水中でも空気中でも呼吸できます。"},{"sentence":"Amphipneustic respiratory systems are found in certain aquatic organisms.","translation":"両生呼吸の呼吸器系は、特定の水生生物に見られます。"}],"collocations":["amphipneustic larva","amphipneustic respiratory system"],"synonyms":["branchiopulmonate"],"antonyms":[]}],"etymology":{"value":"From Greek ἀμφίπνευστος (amphípneustos), from ἀμφί (amphí, “on both sides”) + πνέω (pnéō, “I breathe”).","priority":"★★★"},"pronunciation":{"ipa":"ˌæmfɪˈnjuːstɪk","syllables":"am-phi-pneust-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'amphipneustic' is primarily used in zoology and entomology to describe organisms that possess both gills and lungs, or that have spiracles at both ends of their body. It is a relatively technical term.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["amphipneusta (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'amphipneustic' is a highly specialized term used in biology, particularly in zoology and entomology. It describes organisms capable of breathing through both gills and lungs, or those with spiracles at both ends of their body. Due to its technical nature, it is rarely encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The amphipneustic nature of the salamander allows it to survive in varying aquatic and terrestrial environments.","translation":"サンショウウオの両生呼吸の性質により、多様な水生および陸生環境で生き残ることができます。","type":"adjective","meaning_category":"両生呼吸の"},{"sentence":"Researchers studied the amphipneustic respiratory adaptations of certain insect larvae.","translation":"研究者たちは、特定の昆虫幼虫の両生呼吸の呼吸適応を研究しました。","type":"adjective","meaning_category":"両生呼吸の"}]}