{"word":"paragogically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"語尾添加的に、語尾音添加的に","english_definition":"In a paragogic manner; with the addition of a paragogue (a sound or letter added to the end of a word).","examples":[{"sentence":"The word was paragogically formed by adding a final 'e'.","translation":"その単語は、語尾に「e」を加えることによって語尾添加的に形成された。"}],"collocations":["paragogically formed","paragogically added"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'paragogic' (relating to paragogue) + '-ally'. 'Paragogue' originates from Late Latin 'paragoge', from Greek 'paragōgē' (a leading past, addition), from 'paragein' (to lead past, bring forward), from 'para-' (beside, beyond) + 'agein' (to lead).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəɡɒˈdʒɪkəli/","syllables":"par-a-go-gic-al-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The term 'paragogically' is primarily used in linguistics, specifically morphology, to describe the addition of a sound or letter at the end of a word. This addition, known as a paragogue, often serves grammatical or euphonic purposes. It is a relatively rare term, mainly encountered in academic or specialized linguistic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":["paragogue (noun): A sound or letter added to the end of a word without changing its meaning or grammatical function.","paragogic (adjective): Relating to or characterized by paragogue."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paragogically' is a highly specialized term used in linguistics. It describes the manner in which a paragogue (an extra sound or letter) is added to the end of a word. Due to its niche usage, it is rarely encountered outside of academic contexts related to language studies."},"example_sentences":[{"sentence":"Some dialects paragogically add a vowel to words ending in consonants.","translation":"いくつかの方言では、子音で終わる単語に語尾添加的に母音を加える。","type":"general","meaning_category":"語尾添加的に"}]}