{"word":"Euro-style","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヨーロッパ風の、ヨーロッパスタイルの","english_definition":"Relating to or characteristic of European styles, fashions, or designs.","examples":[{"sentence":"The restaurant has a Euro-style decor with minimalist furniture.","translation":"そのレストランは、ミニマリストの家具を使ったヨーロッパスタイルの内装です。"},{"sentence":"She prefers Euro-style clothing, which is often more tailored and sophisticated.","translation":"彼女はヨーロピアンスタイルの服を好みます。それはしばしばより仕立てが良く、洗練されています。"},{"sentence":"The new car features a Euro-style design with sleek lines and advanced technology.","translation":"その新型車は、滑らかなラインと高度な技術を備えたヨーロピアンスタイルのデザインが特徴です。"}],"collocations":["Euro-style decor","Euro-style clothing","Euro-style design","Euro-style architecture","Euro-style cafe"],"synonyms":["European-style","Continental-style"],"antonyms":["American-style","Asian-style"]}],"etymology":{"value":"A compound word combining \"Euro\" (short for European) and \"style\".","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌjʊərəʊˈstaɪl/","syllables":"Eu-ro-style"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Euro-style\" is used to describe something that resembles or is inspired by European trends, designs, or customs. It is often used in the context of fashion, design, architecture, and cuisine. The term suggests a certain level of sophistication, elegance, or modernity associated with European culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I like Euro style.","correct":"✓ I like Euro-style.","note":"The hyphen is important to connect \"Euro\" and \"style\" when used as a compound adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["Euro (European currency)","European","Style"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understood in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Euro-style\" is a compound adjective used to describe something that is characteristic of or inspired by European styles or designs. It is commonly used in contexts such as fashion, architecture, and interior design to denote a certain aesthetic associated with European culture."},"example_sentences":[{"sentence":"The apartment was decorated in a modern Euro-style.","translation":"そのアパートはモダンなヨーロピアンスタイルで装飾されていました。","type":"adjective","meaning_category":"ヨーロッパ風の"},{"sentence":"She admired the Euro-style cafes with their outdoor seating.","translation":"彼女は屋外席のあるヨーロピアンスタイルのカフェに感心しました。","type":"adjective","meaning_category":"ヨーロッパ風の"}]}