{"word":"Diabolize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"悪魔化する、悪者にする、中傷する","english_definition":"To represent or depict as diabolical or evil; to demonize.","examples":[{"sentence":"The media often diabolizes political opponents.","translation":"メディアはしばしば政敵を悪魔化する。"},{"sentence":"The propaganda diabolized the enemy soldiers, portraying them as monsters.","translation":"そのプロパガンダは敵兵を悪魔化し、彼らを怪物として描いた。"},{"sentence":"It's easy to diabolize someone you disagree with, but it's important to understand their perspective.","translation":"意見の合わない人を悪魔化するのは簡単ですが、相手の視点を理解することが重要です。"}],"collocations":["diabolize someone/something (～を悪魔化する)","diabolize an enemy (敵を悪魔化する)","diabolize a group (集団を悪魔化する)"],"synonyms":["demonize","vilify","malign","denigrate","defame","blacken"],"antonyms":["praise","exalt","glorify","deify"]}],"etymology":{"value":"\"Diabolize\" derives from \"diabolos\" (Greek for \"devil\" or \"slanderer\"), combined with the suffix \"-ize,\" which means \"to make\" or \"to treat as.\" Therefore, \"diabolize\" means to make something or someone appear like the devil or to treat them as evil.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈæbəlaɪz/","syllables":"di-a-bo-lize"},"inflection":{"verb_forms":{"present_simple":["diabolize","diabolizes"],"past_simple":"diabolized","past_participle":"diabolized","present_participle":"diabolizing"}},"usage_notes":{"explanation":"\"Diabolize\" is a verb that means to portray someone or something as evil or diabolical. It often involves exaggerating negative qualities and ignoring positive ones to create a negative image. This term is commonly used in political discourse, media criticism, and discussions about propaganda. It suggests a deliberate effort to make someone or something appear extremely wicked or malicious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to diabolize the situation.","correct":"✓ He tried to demonize the situation. / ✓ He tried to make the situation seem worse than it was.","note":"While \"diabolize\" can be used more broadly, it usually refers to portraying a person or group as evil. To describe making a situation seem worse, \"demonize\" or a more general phrase is more appropriate."},{"incorrect":"✗ The diabolized person was actually very kind.","correct":"✓ The demonized person was actually very kind.","note":"\"Demonized\" is a more common and widely understood term than \"diabolized\"."}],"priority":"★★☆"},"related_words":{"derivatives":["diabolical (adjective: 極悪な、悪魔のような)","diabolism (noun: 悪魔崇拝)","diabolically (adverb: 極悪に、悪魔のように)"],"synonyms":["demonize","vilify","malign","denigrate","defame","blacken"],"antonyms":["praise","exalt","glorify","deify"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Diabolize\" is a relatively advanced word that means to portray someone or something as evil or diabolical. It is often used in discussions about politics, media, and propaganda to describe the act of making someone appear extremely wicked. Because it is not a common word, it is important to understand its specific meaning and context to use it correctly. It is similar to \"demonize\" but may imply a more deliberate or exaggerated effort to create a negative image."},"example_sentences":[{"sentence":"The political campaign diabolized the candidate, focusing on his past mistakes.","translation":"その政治キャンペーンは候補者を悪魔化し、彼の過去の過ちに焦点を当てた。","type":"verb","meaning_category":"悪魔化する"},{"sentence":"The novel explores how easily people can be diabolized by society.","translation":"その小説は、人々がいかに簡単に社会によって悪魔化されるかを探求している。","type":"verb","meaning_category":"悪魔化する"},{"sentence":"The documentary aimed to show that the so-called 'villain' had been unfairly diabolized by the media.","translation":"そのドキュメンタリーは、いわゆる「悪役」がメディアによって不当に悪魔化されていたことを示すことを目的とした。","type":"verb","meaning_category":"悪魔化する"}]}