{"word":"impugnment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(公式な)非難、攻撃、異議申し立て","english_definition":"An act of impugning; a challenge or attack on someone's character or motives.","examples":[{"sentence":"The impugnment of his integrity was unfounded.","translation":"彼の誠実さに対する非難は根拠がなかった。"},{"sentence":"There was no impugnment of the witness's testimony.","translation":"証人の証言に対する異議申し立てはなかった。"}],"collocations":["impugnment of character","impugnment of motives","impugnment of integrity"],"synonyms":["challenge","attack","criticism","denunciation","accusation","reproach","censure","objection","dispute","questioning"],"antonyms":["defense","support","vindication","affirmation","endorsement","approval","praise"]}],"etymology":{"value":"Derived from the verb 'impugn', which comes from the Latin 'impugnare', meaning 'to attack'. 'Im-' means 'against' and 'pugnare' means 'to fight'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpjuːnmənt/","syllables":"im-pugn-ment"},"inflection":{"noun_plural":"impugnments"},"usage_notes":{"explanation":"'Impugnment' is a formal noun that refers to the act of challenging or attacking someone's character, motives, or integrity. It often implies a serious accusation or questioning of someone's honesty or reliability. The word is relatively rare in everyday conversation and is more commonly found in legal or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impugnment was very happy.","correct":"✓ The impugnment was very serious.","note":"'Impugnment' refers to a negative action, so it is not typically associated with positive adjectives like 'happy'."},{"incorrect":"✗ He made an impugnment to the cake.","correct":"✓ He made an impugnment of the decision.","note":"'Impugnment' is used in the context of challenging or attacking something, usually a decision, statement, or someone's character, not a physical object like a cake."}],"priority":"★★☆"},"related_words":{"derivatives":["impugn (verb): to dispute or challenge something.","impugnable (adjective): capable of being challenged or disputed."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Impugnment' is a formal and relatively rare word that refers to the act of challenging or attacking someone's character, motives, or integrity. It is often used in legal or formal contexts. Understanding this word requires a high level of vocabulary and comprehension skills."},"example_sentences":[{"sentence":"The politician faced constant impugnment of his financial dealings.","translation":"その政治家は、彼の金銭取引について絶え間ない非難に直面した。","type":"general","meaning_category":"accusation"},{"sentence":"The impugnment of the scientific study's methodology raised concerns about its validity.","translation":"その科学研究の方法論に対する異議申し立ては、その妥当性に関する懸念を引き起こした。","type":"technical","meaning_category":"objection"},{"sentence":"The lawyer presented a strong defense against the impugnment of her client's reputation.","translation":"弁護士は、依頼人の評判に対する非難に対して強力な弁護を行った。","type":"legal","meaning_category":"challenge"}]}