{"word":"Neutrophilous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"好中性の、中性を好む","english_definition":"Thriving in or preferring a neutral environment; growing best in a soil or other medium that is neither strongly acidic nor strongly alkaline.","examples":[{"sentence":"Neutrophilous plants grow well in soils with a pH around 7.","translation":"好中性植物は、pHが約7の土壌でよく育つ。"},{"sentence":"Some bacteria are neutrophilous, preferring a neutral pH for optimal growth.","translation":"一部の細菌は好中性であり、最適な成長のために中性のpHを好む。"}],"collocations":["neutrophilous plants","neutrophilous bacteria","neutrophilous conditions","neutrophilous environment"],"synonyms":["neutrophiles (noun)","neutrophilic"],"antonyms":["acidophilous","basiphilous","alkaliphilic"]},{"part_of_speech":"adjective","definition":"好中球性の、好中球に富む","english_definition":"Relating to or characterized by neutrophils (a type of white blood cell).","examples":[{"sentence":"A neutrophilous response indicates an increase in neutrophils, often due to infection.","translation":"好中球性の反応は、感染症などが原因で好中球が増加していることを示す。"}],"collocations":["neutrophilous response","neutrophilous inflammation"],"synonyms":["neutrophilic"],"antonyms":["eosinophilic","basophilic"]}],"etymology":{"value":"Derived from 'neutro-' (neutral) + '-philous' (loving, preferring).","priority":"★★☆"},"pronunciation":{"ipa":"/nuːˈtrɒfɪləs/","syllables":"nu-troph-i-lous"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"'Neutrophilous' describes organisms or conditions that favor a neutral environment, particularly in terms of pH. It can also relate to neutrophils, a type of white blood cell important in the immune system. The term is primarily used in scientific and technical contexts, such as botany, microbiology, and medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The soil is neutrophilous, so it's good for acid-loving plants.","correct":"✓ The soil is acidic, so it's good for acid-loving plants.","note":"Neutrophilous soils are not suitable for acid-loving plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["neutrophile (noun): An organism that thrives in a neutral environment.","neutrophilia (noun): An increase in the number of neutrophils in the blood.","neutrophil (noun): A type of white blood cell."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neutrophilous' is a technical term used in science, particularly in biology and medicine. It describes something that prefers or thrives in a neutral environment (neither acidic nor alkaline) or relates to neutrophils, a type of white blood cell. Because it's a specialized term, it's not commonly used in everyday language."},"example_sentences":[{"sentence":"The neutrophilous bacteria thrived in the culture medium with a neutral pH.","translation":"その好中性細菌は、中性のpHを持つ培養培地でよく育った。","type":"adjective","meaning_category":"好中性の"},{"sentence":"The wound showed a neutrophilous infiltrate, indicating a bacterial infection.","translation":"その傷は好中球性の浸潤を示しており、細菌感染症を示唆していた。","type":"adjective","meaning_category":"好中球性の"}]}