{"word":"phocomelia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"海豹肢症、アザラシ肢症：四肢が短縮または欠損している先天性疾患","english_definition":"A rare congenital deformity in which the limbs are extremely shortened or absent, so that the hands and feet arise close to the trunk; also called seal limbs.","examples":[{"sentence":"Phocomelia is a serious birth defect.","translation":"海豹肢症は深刻な先天性異常です。"},{"sentence":"The drug thalidomide was linked to cases of phocomelia.","translation":"サリドマイドという薬は、海豹肢症の症例と関連付けられました。"}],"collocations":["thalidomide phocomelia","congenital phocomelia"],"synonyms":["seal limbs","amelia","ectromelia"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「phoke (アザラシ)」+「melos (肢)」に由来する。アザラシのひれ状の肢に似ていることから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊkəˈmiːliə/","syllables":"pho-co-me-li-a"},"inflection":{"noun_plural":"phocomelias"},"usage_notes":{"explanation":"Phocomelia is a rare condition, most famously associated with the drug thalidomide, which was prescribed to pregnant women in the late 1950s and early 1960s. It is characterized by malformations of the limbs, ranging from shortening to complete absence.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ phocomelia is a infectious disease.","correct":"✓ phocomelia is a congenital condition.","note":"Phocomelia is a birth defect, not an infectious disease."}],"priority":"★☆☆"},"related_words":{"derivatives":["phocomelic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Phocomelia is a medical term referring to a rare congenital condition characterized by severe malformation of the limbs, resulting in shortened or absent long bones. It is most notably associated with the drug thalidomide, which caused a surge in cases when it was prescribed to pregnant women. Understanding this term requires a background in medical terminology and an awareness of its historical significance.","priority":"★☆☆"},"example_sentences":[{"sentence":"The child was born with phocomelia, affecting both arms and legs.","translation":"その子供は海豹肢症を持って生まれ、両腕と両脚に影響が出ていた。","type":"noun","meaning_category":"先天性疾患"},{"sentence":"Research into the causes of phocomelia continues to be important for preventing birth defects.","translation":"海豹肢症の原因に関する研究は、先天性異常の予防のために引き続き重要である。","type":"noun","meaning_category":"先天性疾患"}]}