{"word":"Anomodontia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異歯亜目：絶滅した単弓類のグループで、ペルム紀後期から三畳紀後期にかけて繁栄した。","english_definition":"An extinct group of therapsids (mammal-like reptiles) that flourished from the Late Permian to the Late Triassic periods. They are characterized by having reduced or absent teeth, replaced by a horny beak in many forms. They were herbivorous and are ancestors to the dicynodonts.","examples":[{"sentence":"Anomodontia were a diverse group of herbivores.","translation":"異歯亜目は多様な草食動物のグループでした。"},{"sentence":"Dicynodonts are a major group within Anomodontia.","translation":"ディキノドン類は異歯亜目の中の主要なグループです。"}],"collocations":["Anomodontia fossil","Anomodontia skull","Dicynodontia (a subgroup of Anomodontia)"],"synonyms":["Therapsida (broader group)","Dicynodontia (major subgroup)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'anomo' meaning 'irregular' or 'different' and 'odont' meaning 'tooth', referring to their characteristic dentition, which is different from other therapsids.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌnɒməˈdɒnʃiə/","syllables":"A-nom-o-don-ti-a"},"inflection":{"noun_plural":"Anomodontias (though rarely used)"},"usage_notes":{"explanation":"'Anomodontia' is a taxonomic term used in paleontology and evolutionary biology. It refers to a specific group of extinct therapsids. The term is most often encountered in scientific literature or discussions about the evolution of mammals and their ancestors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Anomodentia","correct":"✓ Anomodontia","note":"Correct spelling is crucial in scientific terms."}],"priority":"★★☆"},"related_words":{"derivatives":["anomodont (noun, referring to an individual member of Anomodontia)"],"phrases":["Therapsid","Synapsida","Dicynodont"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Anomodontia' is a technical term used in paleontology and evolutionary biology to classify a specific group of extinct therapsids. Understanding this term requires familiarity with the classification of extinct organisms and the evolutionary history of synapsids (mammals and their ancestors). It's typically encountered in academic or specialized contexts."},"example_sentences":[{"sentence":"The evolutionary relationships within Anomodontia are still being studied.","translation":"異歯亜目内の進化関係はまだ研究されています。","type":"general","meaning_category":"evolutionary biology"},{"sentence":"Fossils of Anomodontia have been found on multiple continents.","translation":"異歯亜目の化石は複数の大陸で発見されています。","type":"general","meaning_category":"paleontology"}]}