{"word":"Cerberean","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ケルベロスのような、地獄の番犬のような","english_definition":"Of or relating to Cerberus, the three-headed dog that guards the entrance to the underworld in Greek mythology; resembling Cerberus, especially in being vigilant, fierce, or menacing.","examples":[{"sentence":"The guards at the prison had a Cerberean vigilance.","translation":"刑務所の警備員はケルベロスのような警戒心を持っていた。"},{"sentence":"The Cerberean growl of the dog warned us to stay away.","translation":"その犬のケルベロスのような唸り声は、私たちに近づかないように警告した。"}],"collocations":["Cerberean vigilance (ケルベロスのような警戒心)","Cerberean growl (ケルベロスのような唸り声)","Cerberean guard (ケルベロスのような警備員)"],"synonyms":["watchful","vigilant","fierce","menacing","hellish","infernal"],"antonyms":["gentle","docile","friendly","approachable"]}],"etymology":{"value":"From Cerberus, the name of the three-headed dog guarding the entrance to Hades in Greek mythology, + -ean (suffix indicating relation or resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/sərˈbɪəriən/","syllables":"cer-ber-e-an"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms (more Cerberean, most Cerberean)."},"usage_notes":{"explanation":"'Cerberean' is a relatively rare word, typically used in literary or descriptive contexts to evoke the image of a fierce, vigilant, and often menacing guardian, similar to the mythological Cerberus. It is often used metaphorically to describe anything that is difficult to approach or overcome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cerberian flower was beautiful.","correct":"✓ The Cerberean guard was intimidating.","note":"'Cerberean' is typically used to describe something related to guarding or fierceness, not beauty or other unrelated qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cerberus (noun: the three-headed dog in Greek mythology)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cerberean' is a sophisticated word that requires knowledge of Greek mythology to fully understand its meaning. It is used to describe something that is fiercely protective or menacing, like the mythological dog Cerberus. Due to its specialized nature, it is more commonly found in literature or formal writing."},"example_sentences":[{"sentence":"The fortress was protected by a Cerberean array of defenses.","translation":"その要塞は、ケルベロスのような厳重な防御陣によって守られていた。","type":"adjective","meaning_category":"fierce and vigilant"},{"sentence":"His Cerberean attitude kept everyone at a distance.","translation":"彼のケルベロスのような態度は、誰もが近寄らないようにしていた。","type":"adjective","meaning_category":"menacing"},{"sentence":"The Cerberean task of guarding the treasure fell to the most trusted knight.","translation":"宝を守るというケルベロスのような任務は、最も信頼できる騎士に託された。","type":"adjective","meaning_category":"difficult and demanding"}]}