{"word":"Glutelin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"グルテリン (植物の種子に含まれる貯蔵タンパク質の一種)","english_definition":"A class of prolamin proteins found in the seeds of some cereals, such as rice and maize. They are a major storage protein.","examples":[{"sentence":"Glutelin is an important component of rice protein.","translation":"グルテリンは、米タンパク質の重要な成分です。"},{"sentence":"The glutelin content affects the nutritional value of the grain.","translation":"グルテリンの含有量は、穀物の栄養価に影響を与えます。"}],"collocations":["rice glutelin","maize glutelin","glutelin content","glutelin fraction"],"synonyms":["storage protein","seed protein"],"antonyms":[]}],"etymology":{"value":"Derived from 'gluten' (Latin for glue) + '-in' (a suffix used for proteins).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡluːtəlɪn/","syllables":"Gloo-te-lin"},"inflection":{"noun_plural":"Glutelins"},"usage_notes":{"explanation":"Glutelins are a type of storage protein found in the seeds of certain cereal grains, notably rice, maize (corn), and wheat (though wheat primarily contains gliadin and glutenin, which are related). They are characterized by their insolubility in neutral aqueous solutions but solubility in dilute acids or bases. Glutelin plays a crucial role in providing amino acids for the developing seedling during germination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Glutelin is a type of carbohydrate.","correct":"✓ Glutelin is a type of protein.","note":"Glutelin is a protein, not a carbohydrate."},{"incorrect":"✗ Glutelin is soluble in water.","correct":"✓ Glutelin is insoluble in neutral aqueous solutions.","note":"Glutelin is insoluble in neutral aqueous solutions, but soluble in dilute acids or bases."}],"priority":"★★☆"},"related_words":{"derivatives":["glutelins"],"related_terms":["gliadin","glutenin","prolamin","gluten","cereal","protein"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glutelin' is a technical term used in biochemistry and food science to refer to a specific type of storage protein found in certain cereal grains. Understanding the term requires familiarity with protein chemistry and plant biology. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The composition of glutelin in rice varies depending on the variety.","translation":"米のグルテリンの組成は、品種によって異なります。","type":"general","meaning_category":"composition"},{"sentence":"Extraction of glutelin requires specific chemical conditions.","translation":"グルテリンの抽出には、特定の化学的条件が必要です。","type":"technical","meaning_category":"extraction"},{"sentence":"Glutelin provides essential amino acids for seedling growth.","translation":"グルテリンは、苗の成長に必要な必須アミノ酸を提供します。","type":"biological","meaning_category":"function"}]}