{"word":"Arthrotrauma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"関節外傷、関節損傷","english_definition":"Trauma or injury to a joint.","examples":[{"sentence":"The patient presented with arthrotrauma following a fall.","translation":"患者は転倒後に関節外傷を呈した。"},{"sentence":"Arthrotrauma can lead to chronic joint pain and instability.","translation":"関節外傷は慢性的な関節痛や不安定さにつながる可能性がある。"}],"collocations":["post-traumatic arthrotrauma (外傷後の関節外傷)","acute arthrotrauma (急性の関節外傷)","chronic arthrotrauma (慢性の関節外傷)"],"synonyms":["joint injury","articular trauma","joint trauma"],"antonyms":[]}],"etymology":{"value":"'Arthro-' comes from the Greek 'arthron' meaning joint, and 'trauma' refers to a wound or injury. Therefore, arthrotrauma literally means 'joint injury'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrθroʊˈtrɔːmə/","syllables":"ar-thro-trau-ma"},"inflection":{"noun_plural":"arthrotraumas"},"usage_notes":{"explanation":"'Arthrotrauma' is a medical term referring specifically to physical trauma affecting a joint. It is often used in medical contexts, such as diagnoses, treatment plans, and research papers. It is distinct from general joint pain or arthritis, which may not be caused by a specific injury.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has arthrotrauma in their muscle.","correct":"✓ The patient has arthrotrauma in their knee.","note":"Arthrotrauma specifically refers to joint injuries, not muscle injuries."},{"incorrect":"✗ Arthrotrauma is the same as arthritis.","correct":"✓ Arthrotrauma is a joint injury, while arthritis is a degenerative joint condition.","note":"Arthrotrauma is caused by an injury, while arthritis is a disease process."}],"priority":"★★☆"},"related_words":{"derivatives":["arthroscopic (関節鏡の)","arthropathy (関節症)","arthralgia (関節痛)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arthrotrauma' is a specialized medical term referring to injury to a joint. Understanding this word requires familiarity with medical terminology related to anatomy and trauma. It is typically used in medical contexts, such as patient records, research papers, or clinical discussions. General English speakers are unlikely to encounter this word outside of medical settings."},"example_sentences":[{"sentence":"The MRI revealed significant arthrotrauma to the medial meniscus.","translation":"MRI検査で、内側半月板に重大な関節外傷が認められた。","type":"medical","meaning_category":"関節損傷"},{"sentence":"Treatment for arthrotrauma often involves physical therapy and pain management.","translation":"関節外傷の治療には、理学療法と疼痛管理がしばしば含まれる。","type":"medical","meaning_category":"関節損傷"}]}