{"word":"spirillotropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(薬理学)スピリル親和性の、スピリルに選択的に作用する","english_definition":"(pharmacology) having an affinity for or selectively acting on spirilla (spiral-shaped bacteria).","examples":[{"sentence":"Spirillotropic drugs are used to treat diseases caused by spirilla.","translation":"スピリル親和性薬は、スピリルによって引き起こされる疾患の治療に使用されます。"}],"collocations":["spirillotropic drug","spirillotropic agent","spirillotropic activity"],"synonyms":["antibacterial (against spirilla)"],"antonyms":[]}],"etymology":{"value":"Derived from 'spirillum' (a type of spiral-shaped bacteria) + '-tropic' (having an affinity for, turning towards).","priority":"★★★"},"pronunciation":{"ipa":"/ˌspaɪrɪləˈtrɒpɪk/","syllables":"spi-ril-lo-trop-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms (more spirillotropic, most spirillotropic) are possible, but rare."},"usage_notes":{"explanation":"'Spirillotropic' is a technical term primarily used in the fields of microbiology, pharmacology, and medicine. It describes substances, especially drugs, that have a specific attraction to or effect on spirilla. Spirilla are a type of bacteria characterized by their spiral or helical shape.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antibiotic is spirillotropic to all bacteria.","correct":"✓ The antibiotic is spirillotropic to spirilla.","note":"'Spirillotropic' specifically refers to an affinity for spirilla, not all bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["spirillum (noun: a spiral-shaped bacterium)","-tropic (suffix: turning, changing, having an affinity for)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency - a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'spirillotropic' is a highly specialized term used in microbiology and pharmacology. It describes substances that have a specific affinity for spirilla, which are spiral-shaped bacteria. Understanding this term requires a background in these scientific fields."},"example_sentences":[{"sentence":"The researchers are investigating new spirillotropic compounds to combat resistant strains of spirilla.","translation":"研究者たちは、スピリルの耐性菌株と闘うための新しいスピリル親和性化合物を研究しています。","type":"adjective","meaning_category":"スピリル親和性の"}]}