{"word":"trippingness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being tripping; the tendency to cause one to trip or stumble; or the characteristic of resembling a psychedelic experience.","english_definition":"The quality or state of being tripping, either in a literal sense (causing someone to stumble) or in a figurative sense (resembling a psychedelic experience).","examples":[{"sentence":"The trippingness of the uneven pavement made it difficult to walk.","translation":"その舗装されていない道のトリッピングネス（つまずきやすさ）は歩くのを困難にした。"},{"sentence":"The artwork's trippingness was enhanced by the flashing lights and distorted sounds.","translation":"そのアートワークのトリッピングネス（サイケデリックな体験を彷彿とさせる性質）は、点滅する光と歪んだ音によって強調された。"}],"collocations":["high trippingness","low trippingness","visual trippingness","physical trippingness"],"synonyms":["instability","unevenness","psychedelia","surreality"],"antonyms":["stability","evenness","sobriety","realism"]}],"etymology":{"value":"Derived from the word 'tripping' (present participle of 'trip'), with the addition of the suffix '-ness', which transforms adjectives into nouns indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪpɪŋnəs/","syllables":"trip-ping-ness"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Trippingness' is a relatively rare and informal word. It can refer to the literal quality of something that causes tripping, or, more often, to the quality of something that evokes a psychedelic or hallucinatory experience. The latter usage is often associated with art, music, or other forms of media.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trippingness of the movie was very scary.","correct":"✓ The trippiness of the movie was very scary.","note":"'Trippiness' is a more common and widely understood term than 'trippingness' when referring to psychedelic qualities."}],"priority":"★★☆"},"related_words":{"derivatives":["trip (verb, noun)","trippy (adjective)","trippiness (noun)","trippingly (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language learning resources)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Trippingness' is a niche word, not typically encountered in general English. Its meaning is relatively transparent for those familiar with the adjective 'trippy,' and the suffix '-ness.' Understanding requires a grasp of abstract noun formation and some familiarity with slang related to psychedelic experiences."},"example_sentences":[{"sentence":"The trippingness of the path made it unsuitable for elderly walkers.","translation":"その道のトリッピングネス（つまずきやすさ）は、高齢の歩行者には不向きだった。","type":"literal","meaning_category":"causing to stumble"},{"sentence":"The artist aimed to capture the trippingness of a fever dream in his painting.","translation":"そのアーティストは、熱にうなされた夢のトリッピングネス（サイケデリックな性質）を絵画に捉えることを目指した。","type":"figurative","meaning_category":"resembling psychedelic experience"}]}