{"word":"Anaerobism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"嫌気性、無気呼吸","english_definition":"Life or activity occurring in the absence of free oxygen.","examples":[{"sentence":"Anaerobism is common among many microorganisms.","translation":"嫌気性は多くの微生物の間で一般的です。"},{"sentence":"Some bacteria thrive in conditions of anaerobism.","translation":"いくつかの細菌は嫌気性の条件下で繁殖します。"}],"collocations":["obligate anaerobism (偏性嫌気性)","facultative anaerobism (通性嫌気性)"],"synonyms":["anaerobic metabolism","fermentation"],"antonyms":["aerobism"]},{"part_of_speech":"noun","definition":"(生理学)無酸素運動","english_definition":"(Physiology) Muscular activity that relies primarily on energy produced by anaerobic metabolism.","examples":[{"sentence":"Anaerobism is essential for short bursts of intense activity.","translation":"無酸素運動は短時間の激しい活動に不可欠です。"},{"sentence":"Weightlifting often involves periods of anaerobism.","translation":"ウェイトリフティングはしばしば無酸素運動を伴います。"}],"collocations":["anaerobic exercise (無酸素運動)","anaerobic threshold (無酸素性閾値)"],"synonyms":["anaerobic respiration"],"antonyms":["aerobic exercise"]}],"etymology":{"value":"From 'anaerobic' + '-ism'. 'Anaerobic' comes from 'an-' (without) + 'aer-' (air) + '-bios' (life) + '-ic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈroʊbɪzəm/","syllables":"an-a-ro-bism"},"inflection":{"notes":"Noun, uncountable in the general sense of a process or condition, but can be countable when referring to specific instances or types of anaerobic activity."},"usage_notes":{"explanation":"'Anaerobism' refers to the biological process of living or functioning without free oxygen. It is commonly used in microbiology to describe organisms that can survive and thrive in the absence of oxygen. In physiology, it refers to the metabolic processes that occur during intense physical activity when oxygen supply is limited.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant died due to anaerobism.","correct":"✓ The plant died due to anaerobic conditions.","note":"'Anaerobism' refers to the process or state, not the conditions themselves. Use 'anaerobic conditions' to describe the environment. "},{"incorrect":"✗ Anaerobism is good for cardiovascular health.","correct":"✓ Aerobic exercise is good for cardiovascular health.","note":"Anaerobism/anaerobic exercise is primarily for strength and power, while aerobic exercise is better for cardiovascular health."}],"priority":"★★☆"},"related_words":{"derivatives":["anaerobe (noun: an organism that can live without oxygen)","anaerobic (adjective: relating to or involving anaerobism)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaerobism' is a technical term used in biology and physiology to describe processes occurring without oxygen. In biology, it refers to the ability of organisms to live without oxygen. In physiology, it describes the metabolic processes used during high-intensity exercise when oxygen supply is limited. It is a relatively uncommon word, primarily used in scientific contexts."},"example_sentences":[{"sentence":"The fermentation process relies on anaerobism to produce various products.","translation":"発酵プロセスは、さまざまな製品を生産するために嫌気性に依存しています。","type":"general biology","meaning_category":"嫌気性"},{"sentence":"During intense exercise, the muscles resort to anaerobism for energy.","translation":"激しい運動中、筋肉はエネルギーを得るために無酸素運動に頼ります。","type":"physiology","meaning_category":"無酸素運動"}]}