{"word":"encake","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ケーキで覆う、ケーキのように飾る","english_definition":"To cover with or as if with cake; to decorate in the manner of a cake.","examples":[{"sentence":"The baker encaked the gingerbread house with frosting and candies.","translation":"パン職人はジンジャーブレッドハウスをフロスティングとキャンディーでケーキのように飾った。"},{"sentence":"The artist encaked the sculpture with layers of paint to create a textured effect.","translation":"アーティストは彫刻を何層もの絵の具でケーキのように覆い、質感のある効果を作り出した。"}],"collocations":["encake with frosting","encake with sugar","encake with decorations"],"synonyms":["cover","coat","decorate","adorn","smother"],"antonyms":["uncover","strip","bare"]}],"etymology":{"value":"'en-' (to put in or on) + 'cake' (a sweet baked food). Formed by analogy with other verbs using 'en-' to mean 'cover with'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɛnˈkeɪk/","syllables":"en-cake"},"inflection":{"verb_forms":{"present_simple":["encake","encakes"],"past_simple":"encaked","past_participle":"encaked","present_participle":"encaking"}},"usage_notes":{"explanation":"'Encake' is a relatively rare verb that means to cover something with a thick layer, or to decorate it in a way that resembles a cake. It is often used to describe the application of frosting, sugar, or other decorative elements. The word emphasizes the act of covering or decorating something elaborately.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The snow encaked the mountain with beauty.","correct":"✓ The snow covered the mountain with beauty.","note":"While 'encake' implies covering, it specifically suggests a cake-like or decorative covering. 'Cover' is more general. Use 'encake' when the covering is elaborate or decorative."},{"incorrect":"✗ She encaked the gift with wrapping paper.","correct":"✓ She wrapped the gift with wrapping paper.","note":"'Encake' is not typically used for simply wrapping something. It implies a thicker, more decorative application, like frosting on a cake."}],"priority":"★★☆"},"related_words":{"derivatives":["encaked (adjective: covered or decorated like a cake)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR resources)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Encake' is a rare and somewhat whimsical verb. It is most likely to be encountered in descriptive writing where the author wants to emphasize the act of covering something in a way that resembles decorating a cake. Due to its rarity, it is not suitable for general use and is best reserved for specific, creative contexts."},"example_sentences":[{"sentence":"The gingerbread house was encaked with colorful candies and icing.","translation":"そのジンジャーブレッドハウスは、カラフルなキャンディーとアイシングでケーキのように飾られていた。","type":"verb","meaning_category":"decorate"},{"sentence":"The old manuscript was encaked with dust and grime.","translation":"古い原稿は、ほこりや汚れでケーキのように覆われていた。","type":"verb","meaning_category":"cover"}]}