{"word":"periscopical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"潜望鏡の；潜望鏡のような","english_definition":"Of or relating to a periscope; resembling a periscope.","examples":[{"sentence":"The submarine had a periscopical view of the surface.","translation":"潜水艦は潜望鏡を通して水面を見た。"},{"sentence":"The building's design included a periscopical feature to allow light into the lower levels.","translation":"その建物の設計には、下の階に光を取り入れるための潜望鏡のような機能が含まれていた。"}],"collocations":["periscopical lens","periscopical sight"],"synonyms":["periscopic"],"antonyms":[]}],"etymology":{"value":"Derived from 'periscope' + '-ical'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛrɪˈskɒpɪkəl/","syllables":"per-i-scop-i-cal"},"inflection":{},"usage_notes":{"explanation":"'Periscopical' is an adjective directly related to the noun 'periscope'. It is used to describe something that pertains to or resembles a periscope, particularly in its function or viewing capabilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The periscopical was used to see above the water.","correct":"✓ The periscope was used to see above the water.","note":"'Periscopical' is an adjective, not a noun. Use 'periscope' as the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["periscope","periscopic"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'periscopical' is a technical adjective derived from 'periscope'. It is used to describe something related to or resembling a periscope. Due to its specialized nature, it is less commonly used in everyday language and more often found in technical or descriptive contexts."},"example_sentences":[{"sentence":"The device offered a periscopical view of the surroundings.","translation":"その装置は周囲の潜望鏡のような眺めを提供した。","type":"adjective","meaning_category":"潜望鏡の"},{"sentence":"The camera utilized a periscopical lens system.","translation":"そのカメラは潜望鏡式のレンズシステムを利用していた。","type":"adjective","meaning_category":"潜望鏡のような"}]}