{"word":"heteroplasty","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"異種移植、異所性移植","english_definition":"The grafting or transplanting of tissue from one species to another; also, the transplantation of tissue to an abnormal site.","examples":[{"sentence":"Heteroplasty is sometimes used in experimental surgery.","translation":"異種移植は実験外科で時々用いられる。"},{"sentence":"The success rate of heteroplasty is generally lower than that of autoplasty.","translation":"異種移植の成功率は一般的に自家移植よりも低い。"}],"collocations":["xenograft (異種移植片)"],"synonyms":["xenotransplantation","heterograft"],"antonyms":["autoplasty","homoplasty"]},{"part_of_speech":"noun","definition":"異形成","english_definition":"The surgical repair of defects with tissues from other species.","examples":[{"sentence":"Heteroplasty can be used to repair damaged cartilage.","translation":"異形成は損傷した軟骨の修復に用いられることがある。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek words 'hetero-' (different) and 'plassein' (to mold or form).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈplæsti/","syllables":"het-er-o-plas-ty"},"inflection":{"noun_plural":"heteroplasties"},"usage_notes":{"explanation":"'Heteroplasty' refers to two main concepts: transplanting tissue between different species (xenotransplantation) and transplanting tissue to an abnormal location within the same organism. It is a technical term primarily used in medical and biological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heteroplasty is the same as autograft.","correct":"✓ Heteroplasty involves tissue from a different species, while autograft uses tissue from the same individual.","note":"Heteroplasty uses tissues from different species, whereas autograft uses tissues from the same individual."}],"priority":"★★☆"},"related_words":{"derivatives":["heteroplastic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heteroplasty' is a highly specialized term primarily encountered in medical and biological contexts. It refers to the transplantation of tissue between different species or to an abnormal location. Understanding this term requires a strong foundation in biology and medicine."},"example_sentences":[{"sentence":"The ethical implications of heteroplasty are a subject of ongoing debate.","translation":"異種移植の倫理的な意味合いは、現在も議論の対象となっている。","type":"noun","meaning_category":"異種移植"},{"sentence":"Heteroplasty offers potential solutions for patients awaiting organ transplants.","translation":"異種移植は、臓器移植を待つ患者に潜在的な解決策を提供する。","type":"noun","meaning_category":"異種移植"}]}