{"word":"offendedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"気を悪くしたように、気分を害した様子で、立腹して","english_definition":"in a manner that shows resentment or displeasure, typically because of a perceived insult or slight.","examples":[{"sentence":"She turned away offendedly when he made the rude comment.","translation":"彼が失礼なコメントをしたとき、彼女は気を悪くして顔を背けた。"},{"sentence":"He replied offendedly, \"I would never do such a thing!\"","translation":"彼は立腹して「私はそんなこと絶対にしない！」と答えた。"},{"sentence":"The child stomped his foot offendedly after being told he couldn't have a cookie.","translation":"子供はクッキーをもらえないと言われた後、気分を害して足を踏み鳴らした。"}],"collocations":["look offendedly (気を悪そうに見る)","speak offendedly (気を悪そうに話す)","reply offendedly (気を悪そうに答える)","act offendedly (気を悪そうにする)"],"synonyms":["resentfully","displeasedly","indignantly","huffily","umbrageously"],"antonyms":["pleasedly","happily","graciously","amiably"]}],"etymology":{"value":"\"Offended\" + \"-ly\". The word \"offended\" comes from the verb \"offend,\" which originates from the Latin word \"offendere,\" meaning \"to strike against, displease, or irritate.\" The suffix \"-ly\" turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈfɛndɪdli/","syllables":"of-fend-ed-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Offendedly\" describes the manner in which someone expresses their feeling of being offended. It suggests a visible or audible display of displeasure or resentment. It's not simply feeling offended, but showing it through actions, words, or expressions. The adverb emphasizes the outward manifestation of the offense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt offendedly.","correct":"✓ She felt offended.","note":"\"Offended\" is the correct adjective to describe how someone feels. \"Offendedly\" describes how someone *acts* or *speaks* when they are offended."},{"incorrect":"✗ He apologized offendedly.","correct":"✓ He apologized resentfully.","note":"Apologizing \"offendedly\" doesn't make logical sense. One might apologize resentfully, implying they are forced to apologize but still harbor resentment."}],"priority":"★★☆"},"related_words":{"derivatives":["offend (verb)","offended (adjective)","offender (noun)","offense (noun)","offensive (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare usage)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Offendedly\" is an adverb that describes how someone acts when they are feeling offended. It means they are showing their displeasure or resentment in their behavior or speech. Because it is a more nuanced and less common word, it is considered a higher-level vocabulary word. It's important to understand that it describes the *manner* of expression, not the feeling itself (which would be described by the adjective \"offended\")."},"example_sentences":[{"sentence":"When she was criticized, she retorted offendedly that she had done her best.","translation":"彼女は批判されたとき、自分は最善を尽くしたと気を悪そうに言い返した。","type":"adverb","meaning_category":"showing displeasure"},{"sentence":"He slammed the door offendedly after their argument.","translation":"彼は口論の後、気を悪くしてドアを乱暴に閉めた。","type":"adverb","meaning_category":"showing resentment"},{"sentence":"She raised her eyebrows offendedly at his inappropriate joke.","translation":"彼女は彼の下品な冗談に気分を害した様子で眉をひそめた。","type":"adverb","meaning_category":"showing offense"}]}