{"word":"hardtails","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)ハードテイル：リアサスペンションのないマウンテンバイク。","english_definition":"(plural noun) Mountain bikes without rear suspension.","examples":[{"sentence":"Hardtails are often lighter and more efficient for climbing than full-suspension bikes.","translation":"ハードテイルは、フルサスペンションバイクよりも軽量で、登坂効率が高いことが多いです。"},{"sentence":"Many beginners start with hardtails because they are more affordable.","translation":"手頃な価格であるため、多くの初心者はハードテイルから始めます。"}],"collocations":["mountain bike hardtails","affordable hardtails","beginner hardtails"],"synonyms":["rigid mountain bikes"],"antonyms":["full-suspension bikes"],"related_terms":["suspension fork","frame","mountain biking","cross-country","trail riding"]}],"etymology":{"value":"'Hardtail' is a compound word formed from 'hard' (referring to the rigid rear of the bike) and 'tail' (referring to the rear section of the bike frame).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrdteɪlz/","syllables":"hard-tails"},"inflection":{"noun_plural":"hardtails"},"usage_notes":{"explanation":"'Hardtails' specifically refers to mountain bikes that lack rear suspension. They typically have a suspension fork in the front but the rear frame is rigid. This design makes them simpler, lighter, and often more affordable than full-suspension bikes. They are commonly used for cross-country riding and by beginners.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He rides a hardtail bike.","correct":"✓ He rides a hardtail.","note":"'Hardtail' can be used as a noun referring to the bike itself, so you don't always need to say 'hardtail bike'."},{"incorrect":"✗ Hardtails are more comfortable than full suspension bikes.","correct":"✓ Full suspension bikes are generally more comfortable than hardtails.","note":"While comfort is subjective, full suspension bikes are generally considered more comfortable due to the rear suspension absorbing bumps."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["full-suspension","frame","fork","mountain bike","downhill","cross-country","trail riding","suspension"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hardtails' are mountain bikes without rear suspension. They're simpler and often cheaper than bikes with suspension at both wheels, called full-suspension bikes. Because they're lighter and transfer power efficiently, hardtails are good for climbing and racing. However, they can be less comfortable on rough trails because they don't absorb bumps as well as full-suspension bikes. If you're new to mountain biking, a hardtail is often a good place to start."},"example_sentences":[{"sentence":"For cross-country racing, many riders prefer the efficiency of hardtails.","translation":"クロスカントリーレースでは、多くのライダーがハードテイルの効率性を好みます。","type":"general"},{"sentence":"The shop had a selection of hardtails in various price ranges.","translation":"店には様々な価格帯のハードテイルが揃っていました。","type":"shopping"},{"sentence":"He upgraded his hardtail with a new suspension fork.","translation":"彼は新しいサスペンションフォークでハードテイルをアップグレードしました。","type":"upgrading"}]}