{"word":"Ceruses","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of ceruse. Ceruse is a white pigment formerly used in paints and cosmetics, consisting of basic lead carbonate.","english_definition":"Plural of ceruse. Ceruse is a white pigment formerly used in paints and cosmetics, consisting of basic lead carbonate.","examples":[{"sentence":"The old master painters often used ceruses to achieve bright whites in their paintings.","translation":"昔の巨匠画家たちは、絵画で明るい白を出すために、しばしば白鉛（ceruses）を使用した。"}],"collocations":[],"synonyms":["white lead","flake white","C.I. Pigment White 1"],"antonyms":[]}],"etymology":{"value":"From Middle English ceruse, from Old French ceruse, from Latin cērussa (“white lead”), from Ancient Greek κηρός (kērós, “wax”), likely due to its waxy texture.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪərəsɪz/","syllables":"Ce-ru-ses"},"inflection":{"noun_plural":"Ceruses"},"usage_notes":{"explanation":"'Ceruses' refers to multiple instances or types of ceruse, a historical white pigment. Because of its toxicity, its use has largely been discontinued. It's mostly encountered in the context of art history or historical chemistry.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["ceruse (singular form)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ceruses' is a highly specialized term referring to the plural form of 'ceruse', an archaic term for white lead pigment. It is primarily encountered in contexts related to art history, chemistry, or toxicology due to the pigment's historical use and toxicity. Understanding requires familiarity with historical materials and art techniques."},"example_sentences":[{"sentence":"Analyses of the paintings revealed the presence of ceruses.","translation":"絵画の分析により、白鉛の存在が明らかになった。","type":"noun","meaning_category":"white pigment"}]}