{"word":"Tory-Irish","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A member of the Irish upper classes who supported the British Tory party.","english_definition":"A member of the Irish upper classes who supported the British Tory party.","examples":[{"sentence":"The Tory-Irish were often landowners who had close ties to the British aristocracy.","translation":"トーリー・アイリッシュはしばしば、イギリス貴族と密接な関係を持つ地主であった。"}],"collocations":["Irish Tory","Anglo-Irish","Landowners","British Aristocracy"],"synonyms":["Anglo-Irish Tory","Irish Conservative"],"antonyms":["Irish Nationalist","Irish Republican"]}],"etymology":{"value":"Combination of 'Tory' (referring to the British Conservative party) and 'Irish' (referring to people of Irish descent or origin).","priority":"N/A"},"pronunciation":{"ipa":"/ˌtɔːri ˈaɪrɪʃ/","syllables":"Tor-y-I-rish"},"inflection":{"noun_plural":"Tory-Irish"},"usage_notes":{"explanation":"The term 'Tory-Irish' is used to describe a specific group within Irish society, typically members of the Anglo-Irish aristocracy or upper classes, who aligned themselves politically with the British Tory party. This term reflects their dual identity and political allegiance during a period of significant political and social change in Ireland.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Using the term to describe all Irish people who supported Britain.","correct":"Using the term to describe the specific class of Anglo-Irish who were Tory supporters.","note":"The term is specific to a particular social class and political alignment."}],"priority":"N/A"},"related_words":{"derivatives":["Tory","Irish","Anglo-Irish"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Tory-Irish' refers to a specific historical and political context in Ireland. It describes members of the Irish upper classes, often of Anglo-Irish descent, who politically aligned with the British Tory (Conservative) party. Understanding this term requires knowledge of Irish history, particularly the dynamics between the Anglo-Irish aristocracy and British politics."},"example_sentences":[{"sentence":"Many of the Tory-Irish families had been granted land in Ireland during the Plantations.","translation":"トーリー・アイリッシュの家族の多くは、プランテーション時代にアイルランドで土地を与えられていた。","type":"noun","meaning_category":"Historical context"}]}