{"word":"Irish-influenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"アイルランドの影響を受けた、アイルランドの影響がみられる","english_definition":"Having characteristics or qualities that show the influence of Irish culture, traditions, or style.","examples":[{"sentence":"The music had an Irish-influenced melody.","translation":"その音楽はアイルランドの影響を受けたメロディーを持っていた。"},{"sentence":"The restaurant served Irish-influenced cuisine.","translation":"そのレストランはアイルランドの影響を受けた料理を提供していた。"},{"sentence":"The architecture of the building was Irish-influenced.","translation":"その建物の建築様式はアイルランドの影響を受けていた。"}],"collocations":["Irish-influenced music (アイルランドの影響を受けた音楽)","Irish-influenced cuisine (アイルランドの影響を受けた料理)","Irish-influenced design (アイルランドの影響を受けたデザイン)","Irish-influenced art (アイルランドの影響を受けた芸術)","Irish-influenced literature (アイルランドの影響を受けた文学)"],"synonyms":["Irish-inspired","Irish-flavored","Hibernian-influenced"],"antonyms":["uninfluenced by Irish culture","distinctly non-Irish"],"notes":"This term is used to describe something that has been modified or shaped by Irish culture without necessarily being purely Irish."}],"etymology":{"value":"Formed by combining \"Irish\" (referring to Ireland or its people) with \"influenced\" (affected or changed by someone or something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈaɪrɪʃ ˈɪnfluənst/","syllables":"I-rish in-flu-enced"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are less common with compound adjectives like this one. You would likely rephrase rather than use 'more Irish-influenced'."},"usage_notes":{"explanation":"This adjective is used to describe something that exhibits characteristics borrowed from or inspired by Irish culture. It implies that the subject is not purely Irish but has been modified or shaped by Irish elements. It can apply to various aspects of culture, such as music, food, art, and design.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The music was Irish, influenced.","correct":"✓ The music was Irish-influenced.","note":"The two words should be combined with a hyphen to form a single adjective."},{"incorrect":"✗ The restaurant serves Irish influence food.","correct":"✓ The restaurant serves Irish-influenced food.","note":"'Influence' should be 'influenced' to correctly function as part of the adjective."}],"priority":"N/A"},"related_words":{"derivatives":["influence (noun, verb)","Irish (adjective, noun)"],"related_concepts":["Irish culture","Irish tradition","cultural influence","cultural exchange"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a specific and descriptive term, not a common everyday word.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Irish-influenced' is used to describe something that shows the impact or effect of Irish culture, traditions, or styles. It suggests that while something may not be purely Irish, it has been modified or shaped by Irish elements. This term is more common in discussions of culture, art, or design where specific influences are being analyzed."},"example_sentences":[{"sentence":"The band played Irish-influenced folk music.","translation":"そのバンドはアイルランドの影響を受けたフォーク音楽を演奏した。","type":"general","meaning_category":"music"},{"sentence":"The chef created an Irish-influenced menu for St. Patrick's Day.","translation":"シェフは聖パトリックの日のためにアイルランドの影響を受けたメニューを作った。","type":"general","meaning_category":"cuisine"},{"sentence":"The artist's paintings had an Irish-influenced style, incorporating Celtic motifs.","translation":"そのアーティストの絵画は、ケルトのモチーフを取り入れたアイルランドの影響を受けたスタイルだった。","type":"general","meaning_category":"art"}]}