{"word":"rumores","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ラテン語)噂、風評、世間の評判","english_definition":"(Latin) rumors, gossip, public opinion","examples":[{"sentence":"Fama crescit eundo, viresque adquirit eundo; parva metu primo, mox sese attollit in auras, ingrediturque solo, et caput inter nubila condit. Illam Terra parens, ira inritata deorum, extremam, ut perhibent, Coeo Enceladoque sororem progenuit, pedibus celerem et pernicibus alis. Monstrum horrendum, ingens, cui quot sunt corpore plumae, tot vigiles oculi subter, mirabile dictu, tot linguae, totidem ora sonant, tot subrigit aures. Nocte volat caeli medio terraeque per umbram, stridens, nec dulci declinat lumina somno; luce sedet custos aut in summi culmine tecti, turribus aut altis, et magnas territat urbes, tam ficti pravique tenax quam nuntia veri. Haec tum multiplici populos sermone replebat gaudens et pariter facta atque infecta canebat: venisse Aenean, Troiano sanguine cretum, cui se pulchra viro dignetur iungere Dido; nunc hiemem inter se luxu, quam longa, fovere, regnorum immemores turpique cupidine captos. Haec dea foeda virum diffundit in ora. Protinus ad regem cursus detorquet Iarbas incenditque animum dictis atque aggerat iras. (Virgil, Aeneid, Book IV)","translation":"噂は歩むにつれて大きくなり、進むにつれて力を増す。最初は恐怖で小さかったが、やがて空中に舞い上がり、地面を歩き、頭を雲の中に隠す。伝えられるところによると、大地の母であるテラは、神々の怒りに駆り立てられ、コエウスとエンケラドゥスの妹として、足が速く、翼が素早いこの怪物（噂）を生み出した。恐ろしい怪物で、体にある羽の数だけ、下には見張りの目があり、驚くべきことに、舌も口も耳も同じ数だけある。夜には空と地の間の影の中を飛び回り、金切り声を上げ、甘い眠りに目を閉じない。昼には見張りとして、屋根の一番高いところに座り、高い塔の上に座り、大都市を脅かす。真実の伝達者であると同時に、偽りの歪んだ情報にも固執する。その時、この女神（噂）は喜びながら、人々に様々な噂を広め、事実と虚構を同じように歌い上げた。アイネイアスが到着したこと、トロイアの血を引く彼に、美しいディードーが夫として身を捧げようとしていること、そして今、彼らは王国を忘れ、恥ずべき欲望に囚われ、贅沢の中で冬を過ごしていることを。この醜い女神は、人々の口々に噂を広める。すぐにヤルバスは王の元へ駆けつけ、言葉で王の心を燃え上がらせ、怒りを募らせた。"}],"collocations":[],"synonyms":["fama","fabula","garrulitas","susurrus"],"antonyms":[]}],"etymology":{"value":"ラテン語の「rumor」の複数形。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈruːmores/","syllables":"ru-mo-res"},"inflection":{"notes":"名詞、複数形"},"usage_notes":{"explanation":"古典ラテン語で使われる単語であり、現代の英語や他のロマンス語の「rumor」の語源となっている。古典文学や歴史的な文脈でよく見られる。","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["rumor (英語)","rumeur (フランス語)","rumore (イタリア語、スペイン語)"]},"level_frequency":{},"readability_explanation":{},"example_sentences":[]}