{"word":"unproclaimed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"公言されていない、宣言されていない、自称の","english_definition":"not publicly or formally announced or declared; self-styled.","examples":[{"sentence":"He is the unproclaimed king of the neighborhood.","translation":"彼は近所の自称王だ。"},{"sentence":"The unproclaimed leader of the group made all the decisions.","translation":"グループの自称リーダーがすべての決定を下した。"},{"sentence":"The unproclaimed benefits of the product were numerous.","translation":"その製品の公言されていない利点は数多くあった。"},{"sentence":"Despite being unproclaimed, her influence was undeniable.","translation":"公言されていなかったにもかかわらず、彼女の影響力は否定できませんでした。"}],"collocations":["unproclaimed leader","unproclaimed benefits","unproclaimed king","unproclaimed title"],"synonyms":["undeclared","unannounced","unavowed","tacit","implicit","self-styled","self-proclaimed"],"antonyms":["proclaimed","declared","announced","avowed","explicit"]}],"etymology":{"value":"The word 'unproclaimed' is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'proclaimed' of the verb 'proclaim'. 'Proclaim' comes from Latin 'proclamare', meaning 'to cry out publicly, announce'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpɹəˈkleɪmd/","syllables":"un-pro-claimed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are 'more unproclaimed' and 'most unproclaimed', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Unproclaimed' typically describes something that is understood or assumed but has not been officially stated. It often carries a sense of informality or unofficial status. It can also imply that something is intentionally kept quiet or is not openly acknowledged. The term is frequently used with titles or roles to indicate that someone has assumed a position without formal recognition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unproclaimed news surprised everyone.","correct":"✓ The unannounced news surprised everyone.","note":"'Unproclaimed' refers to something not formally declared, not necessarily news. 'Unannounced' is more appropriate for news that wasn't made public beforehand."},{"incorrect":"✗ He unproclaimed his love for her.","correct":"✓ He did not proclaim his love for her.","note":"'Unproclaimed' is an adjective, not a verb. To express the action of not proclaiming, use 'did not proclaim' or 'didn't proclaim'."}],"priority":"★★☆"},"related_words":{"derivatives":["proclaim (verb)","proclamation (noun)","proclaimer (noun)"],"phrases":["self-proclaimed (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unproclaimed' is a relatively advanced term used to describe something that hasn't been officially announced or declared. It often implies a lack of formal recognition or an unofficial status. Understanding the base word 'proclaim' (to announce publicly) helps in grasping the meaning of 'unproclaimed'. It's not a common word in everyday conversation but appears in more formal writing or discussions."},"example_sentences":[{"sentence":"She was the unproclaimed queen of the office, always knowing the latest gossip.","translation":"彼女はオフィスの自称女王で、いつも最新のゴシップを知っていた。","type":"adjective","meaning_category":"self-styled"},{"sentence":"The unproclaimed benefits of the diet included increased energy levels.","translation":"そのダイエットの公言されていない利点には、エネルギーレベルの向上が含まれていた。","type":"adjective","meaning_category":"undeclared"},{"sentence":"Despite being the unproclaimed leader, he commanded respect from everyone.","translation":"自称リーダーであるにもかかわらず、彼は皆から尊敬を集めていた。","type":"adjective","meaning_category":"unannounced"}]}