{"word":"mosshead","priority":"低","meanings":[{"part_of_speech":"名詞 (スラング)","definition":"（主にアニメ・漫画のワンピースのゾロに対する侮蔑的な愛称）緑色の髪の毛を持つ人、または方向感覚が非常に悪い人に対する侮蔑的な愛称","english_definition":"(slang, derogatory, mainly referring to the character Zoro from One Piece) A derogatory nickname for someone with green hair, or someone with a very poor sense of direction.","examples":[{"sentence":"Hey, mosshead, are you lost again?","translation":"おい、モサヘッド、また迷子になったのか？"},{"sentence":"That mosshead couldn't find his way out of a paper bag.","translation":"あのモサヘッドは紙袋から出る道も見つけられないだろう。"}],"collocations":["lost mosshead (迷子のモサヘッド)"],"synonyms":["greenhead","marimo","lost cause"],"antonyms":[]}],"etymology":{"value":"「moss」（苔）と「head」（頭）の組み合わせ。ワンピースのキャラクターであるゾロの緑色の髪の毛を苔に見立てたことが由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒsˌhɛd/","syllables":"moss-head"},"inflection":{"notes":"複数形は mossheads"},"usage_notes":{"explanation":"「**mosshead**」は、主にアニメ・漫画『ワンピース』のキャラクターであるロロノア・ゾロに対する侮蔑的な愛称として使われるスラングです。ゾロの緑色の髪の毛を苔に見立てたもので、愛情を込めて、またはからかう意味合いで使われます。また、ゾロが極端に方向音痴であることから、方向感覚が非常に悪い人を指す言葉としても使われることがあります。一般的に、親しい間柄でのみ使われる言葉であり、フォーマルな場面や初対面の人に対して使うのは避けるべきです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a real mosshead, he is so intelligent.","correct":"✓ He is a real mosshead, he is always getting lost.","note":"「mosshead」は方向音痴や緑色の髪を指すスラングであり、知性を褒める文脈では不適切です。"},{"incorrect":"✗ My boss called me a mosshead at the meeting.","correct":"✓ (Context is important. If your boss is familiar with One Piece and using it jokingly, it might be acceptable, but generally inappropriate.)","note":"「mosshead」は親しい間柄で使われるスラングであり、職場などのフォーマルな場面で使うのは非常に失礼です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"該当なし (スラングのため)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特定のコミュニティ内でのみ使われるスラング。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**mosshead**」は、主にアニメ・漫画『ワンピース』のロロノア・ゾロというキャラクターを指すスラングです。ゾロの緑色の髪の毛を「苔（moss）」に見立てたもので、親しい間柄でからかうように使われます。また、ゾロが極端な方向音痴であることから、方向感覚が悪い人を指すこともあります。ただし、スラングであり、特定のコミュニティ内でのみ通じる言葉なので、使う場面には注意が必要です。フォーマルな場面や初対面の人には使わないようにしましょう。"},"example_sentences":[{"sentence":"Zoro is often called **mosshead** by his friends because of his green hair.","translation":"ゾロは緑色の髪の毛のせいで、友達からよくモサヘッドと呼ばれている。","type":"noun","meaning_category":"愛称"},{"sentence":"Don't ask him for directions, he's a total **mosshead**.","translation":"彼に道を聞かない方がいいよ、彼は完全にモサヘッドだから。","type":"noun","meaning_category":"方向音痴な人"}]}