{"word":"S-curve","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"S字曲線、Sカーブ","english_definition":"A type of curve or graph that depicts the growth of a variable (often in business or technology) over time, characterized by slow initial growth, followed by a period of rapid growth, and then a leveling off as the variable approaches a saturation point.","examples":[{"sentence":"The company's revenue followed an S-curve pattern, with rapid growth in the middle years.","translation":"その会社の収益はS字曲線パターンをたどり、中盤に急速な成長が見られた。"},{"sentence":"The adoption of the new technology is expected to follow an S-curve.","translation":"新しい技術の導入はS字曲線を描くと予想される。"},{"sentence":"The S-curve model is often used to predict the lifecycle of a product.","translation":"S字曲線モデルは、製品のライフサイクルを予測するためによく使用される。"}],"collocations":["S-curve pattern","S-curve model","technology S-curve","growth S-curve","product S-curve","adoption S-curve"],"synonyms":["sigmoid curve","logistic curve","growth curve"],"antonyms":["linear growth","exponential growth"]},{"part_of_speech":"noun","definition":"(道路の)S字カーブ","english_definition":"A section of road or track that curves sharply first in one direction and then immediately in the opposite direction, forming an 'S' shape.","examples":[{"sentence":"The road had a dangerous S-curve that required drivers to slow down.","translation":"その道路には危険なS字カーブがあり、運転手は減速する必要があった。"},{"sentence":"The race car navigated the S-curve with precision.","translation":"レーシングカーはS字カーブを正確に走行した。"},{"sentence":"There was an accident on the S-curve due to icy conditions.","translation":"路面凍結のため、S字カーブで事故が発生した。"}],"collocations":["dangerous S-curve","sharp S-curve","navigate an S-curve","S-curve accident"],"synonyms":["chicane","hairpin turn"],"antonyms":["straightaway"]}],"etymology":{"value":"The term 'S-curve' is derived from the shape of the curve itself, which resembles the letter 'S'. The concept is used in various fields, including business, technology, and project management, to describe a pattern of growth or progress that starts slowly, accelerates rapidly, and then plateaus.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛs kɜːrv/","syllables":"S-curve"},"inflection":{"notes":"Plural: S-curves"},"usage_notes":{"explanation":"The term \"S-curve\" has two primary meanings:\n\n1.  **Growth Pattern:** In business, technology, and project management, it refers to a graphical representation of growth or progress over time. This growth typically follows a pattern of slow initial progress, rapid acceleration, and eventual leveling off. It's used to model product lifecycles, technology adoption, and project timelines.\n2.  **Road Feature:** In the context of roads or tracks, it refers to a series of curves that resemble the letter 'S'. These curves often require drivers or racers to slow down and navigate carefully.\n\nThe context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's growth was a straight line, not a S-curve.","correct":"✓ The company's growth was a straight line, not an S-curve.","note":"When referring to the shape, use the article 'an' before 'S-curve' because 'S' is pronounced with a vowel sound at the beginning ('es')."},{"incorrect":"✗ The product lifecycle is a S curve.","correct":"✓ The product lifecycle follows an S-curve.","note":"It's more accurate to say that something 'follows an S-curve' or 'exhibits an S-curve pattern' rather than stating it *is* an S-curve. The S-curve is a model or representation, not the actual lifecycle itself."}],"priority":"★★☆"},"related_words":{"derivatives":["S-shaped","sigmoid","logistic"],"related_concepts":["product lifecycle","technology adoption lifecycle","project management","innovation diffusion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (Business/Technical contexts)","frequency_google_ngram":"Moderate frequency in business and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**S-curve**\" refers to a specific type of graph or path that resembles the letter 'S'. In business and technology, it describes a pattern of growth that starts slowly, accelerates rapidly, and then levels off. Think of it as the lifecycle of a product or the adoption rate of a new technology. Initially, there's slow progress, then a boom, and finally, saturation. In road design, an S-curve is a series of bends that form an 'S' shape, requiring careful navigation. The context usually indicates which meaning is intended. Understanding the S-curve concept is particularly useful in strategic planning and forecasting.","priority":"★★☆"},"example_sentences":[{"sentence":"The **S-curve** illustrates the stages of product development from introduction to maturity.","translation":"S字曲線は、製品開発の段階を導入から成熟まで示しています。","type":"noun","meaning_category":"Growth Pattern"},{"sentence":"Drivers must be cautious when approaching the **S-curve** on this mountain road.","translation":"運転手は、この山道のS字カーブに近づく際は注意が必要です。","type":"noun","meaning_category":"Road Feature"},{"sentence":"The company is trying to jump to a new **S-curve** by investing in innovative technologies.","translation":"その会社は革新的な技術に投資することで、新たなS字曲線に移行しようとしている。","type":"noun","meaning_category":"Growth Pattern"},{"sentence":"The race car skillfully maneuvered through the **S-curve** on the track.","translation":"レーシングカーはコース上のS字カーブを巧みに操縦した。","type":"noun","meaning_category":"Road Feature"}]}