{"word":"equiparation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)同等化、等置：二つ以上の事柄を同等とみなすこと、または同等の価値や重要性を与えること。","english_definition":"(philosophy) The act of considering two or more things as equal; the state of being equal; the attribution of equal value or importance.","examples":[{"sentence":"The equiparation of wealth and happiness is a common misconception.","translation":"富と幸福を同等とみなすのはよくある誤解です。"},{"sentence":"In this philosophical debate, the equiparation of mind and body is a central issue.","translation":"この哲学的議論において、心と体を同等とみなすことは中心的な問題です。"}],"collocations":["equiparation of A and B (AとBの同等化)","philosophical equiparation (哲学的同等化)"],"synonyms":["equivalence","equality","parity","equation"],"antonyms":["differentiation","distinction","inequality"]}],"etymology":{"value":"Late Latin *aequiparatio*, from Latin *aequipare* (to make equal), from *aequi-* (equal) + *parare* (to prepare, make ready).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌkwɪpəˈreɪʃən/","syllables":"e-qui-pa-ra-tion"},"inflection":{"noun_plural":"equiparations"},"usage_notes":{"explanation":"'Equiparation' is a relatively rare and formal term, primarily used in philosophical or academic contexts. It refers to the act of equating or considering things as equal, often in terms of value, importance, or status. It can also refer to the state of being equal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The equiparation of apples and oranges is not possible.","correct":"✓ The comparison of apples and oranges is not possible.","note":"'Equiparation' implies a deliberate act of equating, not simply a comparison. In this case, 'comparison' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["equiparate (verb): to make equal, to consider as equal"],"related_terms":["equation","equivalence","parity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Equiparation' is a sophisticated term primarily used in philosophical or academic discussions. It denotes the act of treating different concepts or entities as equivalent or of equal value. This term is not commonly encountered in everyday language and requires a strong understanding of abstract concepts. Therefore, it is suitable for advanced learners who are familiar with philosophical vocabulary."},"example_sentences":[{"sentence":"The author challenges the equiparation of historical events with contemporary issues.","translation":"著者（筆者）は、歴史的出来事と現代の問題を同等に扱うことに異議を唱えています。","type":"noun","meaning_category":"同等化"},{"sentence":"Such an equiparation would ignore the nuances of each situation.","translation":"そのような同等化は、それぞれの状況のニュアンスを無視することになります。","type":"noun","meaning_category":"同等化"}]}