{"word":"noncortically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"皮質を介さずに、皮質とは関係なく","english_definition":"Not involving the cortex; without the involvement of the cortex.","examples":[{"sentence":"The reflex arc functions noncortically.","translation":"その反射弓は皮質を介さずに機能する。"},{"sentence":"Some basic motor functions are controlled noncortically.","translation":"いくつかの基本的な運動機能は皮質とは関係なく制御される。"}],"collocations":["function noncortically","controlled noncortically"],"synonyms":["subcortically"],"antonyms":["cortically"]}],"etymology":{"value":"\"non-\" (否定) + \"cortical\" (皮質の) + \"-ly\" (副詞語尾)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈkɔːtɪkli/","syllables":"non-cor-ti-cal-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"\"Noncortically\" is used in medical and scientific contexts, particularly in neurology and physiology, to describe processes or functions that occur without the involvement of the cerebral cortex. The cerebral cortex is the outer layer of the brain responsible for higher-level cognitive functions. When something happens \"noncortically\", it means it's happening at a more basic, often reflexive, level.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brain works noncortically all the time.","correct":"✓ Some brain functions occur noncortically.","note":"The entire brain does not function noncortically all the time; higher-level cognitive functions require the cortex."}],"priority":"★★☆"},"related_words":{"derivatives":["noncortical (adjective)"],"related_terms":["cortex","cortical","subcortical","brainstem","spinal cord"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"noncortically\" is a technical term used in neuroscience and medicine. It describes processes that occur without the involvement of the cerebral cortex, the outer layer of the brain responsible for higher-level cognitive functions. This term is typically encountered in advanced scientific literature or discussions related to brain function and neurology. Understanding this word requires a solid foundation in biology and neuroscience."},"example_sentences":[{"sentence":"Breathing is primarily controlled by brainstem structures, operating noncortically.","translation":"呼吸は主に脳幹構造によって制御され、皮質を介さずに機能する。","type":"adverb","meaning_category":"Without cortical involvement"},{"sentence":"Primitive reflexes in infants are often mediated noncortically.","translation":"乳児の原始反射は、しばしば皮質を介さずに起こる。","type":"adverb","meaning_category":"Without cortical involvement"}]}