{"word":"unlearning","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(学習によって身についた知識・習慣・行動様式などを)意識的に捨てること、手放すこと、忘却すること","english_definition":"The process of discarding something learned, especially a habitual behavior or a widely accepted belief, to make way for new knowledge or understanding.","examples":[{"sentence":"Unlearning old prejudices is essential for building a more inclusive society.","translation":"古い偏見を捨てることは、より包容的な社会を築くために不可欠です。"},{"sentence":"The workshop focused on unlearning limiting beliefs about success.","translation":"そのワークショップは、成功に関する制限的な信念を捨てることに焦点を当てていました。"},{"sentence":"Unlearning outdated software skills can be challenging but necessary in today's rapidly changing tech industry.","translation":"時代遅れのソフトウェアスキルを捨てることは困難ですが、今日の急速に変化するテクノロジー業界では必要です。"},{"sentence":"The first step in recovery is often unlearning unhealthy coping mechanisms.","translation":"回復の第一歩は、しばしば不健康な対処メカニズムを捨てることです。"}],"collocations":["unlearning process (捨てるプロセス)","conscious unlearning (意識的な忘却)","active unlearning (積極的な忘却)","unlearning biases (偏見を捨てること)","unlearning habits (習慣を捨てること)","unlearning assumptions (前提を捨てること)"],"synonyms":["deconditioning","reprogramming","rethinking","reframing","re-evaluation","letting go","forgetting"],"antonyms":["learning","acquiring","memorizing","internalizing","adopting"]},{"part_of_speech":"verb","definition":"(unlearnの現在分詞)学習したことを捨てる、忘れる、意識的に手放す","english_definition":"Present participle of 'unlearn': to discard something learned, especially a habitual behavior or a widely accepted belief.","examples":[{"sentence":"She is unlearning the negative self-talk that has held her back for years.","translation":"彼女は何年も自分を妨げてきた否定的なセルフトークを捨てようとしている。"},{"sentence":"He found himself unlearning many of the management techniques he had previously considered effective.","translation":"彼は以前効果的だと考えていた多くの経営手法を捨てていることに気づいた。"},{"sentence":"The course encourages students to start unlearning their preconceived notions about art.","translation":"そのコースは、学生たちに芸術に関する先入観を捨てるように促しています。"},{"sentence":"We are constantly unlearning and relearning as we adapt to new information.","translation":"私たちは新しい情報に適応するにつれて、常に捨てたり、再学習したりしています。"}],"collocations":["unlearning and relearning (捨てて再学習すること)","actively unlearning (積極的に捨てること)","consciously unlearning (意識的に捨てること)"],"synonyms":["deconditioning","reprogramming","rethinking","reframing","re-evaluating","letting go of","disregarding"],"antonyms":["learning","acquiring","memorizing","internalizing","adopting"]}],"etymology":{"value":"Derived from 'un-' (prefix indicating reversal or negation) + 'learning' (present participle of 'learn'). The concept suggests reversing or undoing the process of learning.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlɜːrnɪŋ/","syllables":"un-learn-ing"},"inflection":{"noun_plural":"unlearnings (rarely used)"},"usage_notes":{"explanation":"'Unlearning' refers to the active process of discarding or modifying previously learned information, beliefs, or behaviors. It is often necessary when old knowledge becomes obsolete, inaccurate, or harmful. It is not simply forgetting, but rather a conscious effort to replace old patterns with new ones. It's often used in the context of personal growth, organizational change, and adapting to new technologies or social norms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm unlearning to ride a bike.","correct":"✓ I'm forgetting how to ride a bike. / ✓ I'm unlearning the bad habits I developed while riding a bike.","note":"'Unlearning' is not typically used to describe forgetting a skill like riding a bike. It's more appropriate for discarding beliefs, habits, or approaches. Use 'forgetting' for skills. If you're correcting bad habits related to the skill, then 'unlearning' is appropriate."},{"incorrect":"✗ Unlearning is easy.","correct":"✓ Unlearning can be challenging.","note":"While the concept of unlearning might seem simple, it often involves confronting deeply ingrained beliefs or habits, making it a difficult process."}],"priority":"★★☆"},"related_words":{"derivatives":["unlearn (verb)","learner (noun)","learning (noun)","relearn (verb)","relearning (noun)"],"idioms_phrases":["unlearn and relearn (捨てて再学習する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (conceptually advanced)","frequency_google_ngram":"Relatively infrequent, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unlearning' is a more abstract concept than 'learning'. It refers to the process of intentionally getting rid of old information, habits, or beliefs that are no longer useful or are even harmful. This often involves actively questioning what you already know and being willing to change your perspective. It's a key skill in a rapidly changing world where we need to adapt and update our knowledge constantly. It's not just about forgetting, but about actively replacing old ways of thinking with new ones."},"example_sentences":[{"sentence":"The company implemented a training program to help employees **unlearning** outdated practices.","translation":"会社は、従業員が時代遅れの慣行を捨てるのを支援するために、トレーニングプログラムを導入しました。","type":"noun","meaning_category":"捨てること"},{"sentence":"**Unlearning** deeply ingrained biases can be a lifelong journey.","translation":"深く根付いた偏見を捨てることは、生涯にわたる旅になる可能性があります。","type":"noun","meaning_category":"捨てること"},{"sentence":"She is **unlearning** the fear of failure that has always paralyzed her.","translation":"彼女はいつも自分を麻痺させてきた失敗への恐怖を捨てようとしています。","type":"verb (present participle)","meaning_category":"捨てること"},{"sentence":"The therapist helped him start **unlearning** his unhealthy coping mechanisms.","translation":"セラピストは、彼が不健康な対処メカニズムを捨て始めるのを助けました。","type":"verb (present participle)","meaning_category":"捨てること"},{"sentence":"Effective leadership requires **unlearning** traditional command-and-control approaches.","translation":"効果的なリーダーシップには、従来の指揮統制型アプローチを捨てることが求められます。","type":"noun","meaning_category":"捨てること"}]}