{"word":"nonjusticiable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)裁判に不適格な、司法判断を下すのに適さない","english_definition":"(of an issue or case) not appropriate for judicial determination; not capable of being decided by a court of law.","examples":[{"sentence":"The issue of whether a state of emergency should be declared is often considered nonjusticiable.","translation":"非常事態宣言を発令すべきかどうかという問題は、しばしば裁判に不適格とみなされる。"},{"sentence":"The court held that the question of foreign policy was nonjusticiable.","translation":"裁判所は、外交政策の問題は裁判に不適格であると判断した。"},{"sentence":"Some political questions are deemed nonjusticiable because they lack judicially discoverable and manageable standards.","translation":"一部の政治的な問題は、司法的に発見可能で管理可能な基準を欠いているため、裁判に不適格とみなされる。"}],"collocations":["nonjusticiable question","nonjusticiable issue","nonjusticiable dispute"],"synonyms":["non-litigable","unreviewable","unadjudicable"],"antonyms":["justiciable","litigable","reviewable","adjudicable"]}],"etymology":{"value":"\"Non-\" (not) + \"justiciable\" (capable of being decided by a court of law). \"Justiciable\" comes from \"justice.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌdʒʌˈstɪʃɪəbəl/","syllables":"non-jus-ti-cia-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"nonjusticiable\" is primarily used in legal contexts, specifically in constitutional law and administrative law. It refers to issues that courts will not hear because they are deemed to be more appropriately resolved by other branches of government (e.g., the executive or legislative branch) or because they lack clear legal standards for judicial review. The concept is related to the political question doctrine in the United States.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contract was nonjusticiable because it was poorly written.","correct":"✓ The contract was unenforceable because it was poorly written.","note":"While a poorly written contract might be unenforceable, \"nonjusticiable\" refers to the *type* of issue, not the quality of the document. Use \"unenforceable\" instead."},{"incorrect":"✗ The judge declared the defendant nonjusticiable.","correct":"✓ The judge declared the case nonjusticiable.","note":"\"Nonjusticiable\" describes the *case* or *issue*, not the person."}],"priority":"★★☆"},"related_words":{"derivatives":["justiciable","justiciability"],"phrasal_verbs":[],"related_legal_terms":["political question doctrine","standing","ripeness","mootness"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized legal vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonjusticiable\" is a specialized legal term. It means that a court will not hear a case because it believes another part of the government is better suited to handle it, or because there are no clear legal rules to guide the court's decision. This often applies to political matters or issues of national security. It's not a word you'd use in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The Supreme Court determined that the case was nonjusticiable due to the political question doctrine.","translation":"最高裁判所は、政治問題の法理により、その訴訟は裁判に不適格であると判断した。","type":"adjective","meaning_category":"legal"},{"sentence":"Whether the President has the authority to deploy troops without Congressional approval is a complex and often nonjusticiable question.","translation":"大統領が議会の承認なしに軍隊を派遣する権限があるかどうかは、複雑で、しばしば裁判に不適格な問題である。","type":"adjective","meaning_category":"legal"},{"sentence":"The court declined to rule on the matter, finding it to be a nonjusticiable controversy.","translation":"裁判所はその問題について判決を下すことを拒否し、裁判に不適格な論争であると判断した。","type":"adjective","meaning_category":"legal"}]}