{"word":"alcoholisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルコール化、アルコール処理、アルコール添加","english_definition":"The process of treating something with alcohol; the addition of alcohol to something.","examples":[{"sentence":"The alcoholisation of the wine fortified it and increased its shelf life.","translation":"ワインのアルコール化は、ワインを強化し、保存期間を延ばしました。"},{"sentence":"Alcoholisation is a common method for preserving biological specimens.","translation":"アルコール化は、生物学的標本を保存するための一般的な方法です。"},{"sentence":"The alcoholisation of the hand sanitizer killed the germs.","translation":"手指消毒剤のアルコール化は、細菌を殺しました。"}],"collocations":["alcoholisation of wine","alcoholisation of specimens","alcoholisation of hand sanitizer"],"synonyms":["alcoholization","alcoholic fermentation","fortification"],"antonyms":["de-alcoholisation","dealcoholization"]}],"etymology":{"value":"Formed from 'alcohol' + '-isation' (or '-ization' in American English).","priority":"★★☆"},"pronunciation":{"ipa":"ˌælkəhɒlɪˈzeɪʃən","syllables":"al-co-hol-i-sa-tion"},"inflection":{"noun_plural":"alcoholisations"},"usage_notes":{"explanation":"'Alcoholisation' refers to the process of treating something with alcohol, often to preserve it, fortify it, or disinfect it. It is more common in British English, while 'alcoholization' is the preferred spelling in American English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The alcoholisation was very quiet.","correct":"✓ The alcoholisation process was very effective.","note":"'Alcoholisation' refers to a process, not a state of being quiet."},{"incorrect":"✗ He used alcoholisation to clean the wound.","correct":"✓ He used alcohol to clean the wound.","note":"In general conversation, it's more common to say 'alcohol' rather than 'alcoholisation' when referring to the substance itself."}],"priority":"★★☆"},"related_words":{"derivatives":["alcohol","alcoholic","alcoholize","alcoholized"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alcoholisation' is a technical term referring to the process of treating something with alcohol. It is not a commonly used word in everyday conversation, but it may appear in scientific or technical contexts. The word is formed by combining 'alcohol' with the suffix '-isation', which indicates a process or action. Understanding the word requires familiarity with the properties of alcohol and its uses in preservation, fortification, or disinfection."},"example_sentences":[{"sentence":"The alcoholisation of the plant extracts helped to preserve their medicinal properties.","translation":"植物抽出物のアルコール化は、その薬効成分を保存するのに役立ちました。","type":"noun","meaning_category":"アルコール処理"},{"sentence":"The museum uses alcoholisation to protect its delicate artifacts from decay.","translation":"博物館は、デリケートな工芸品を腐敗から保護するためにアルコール化を使用しています。","type":"noun","meaning_category":"アルコール処理"},{"sentence":"Alcoholisation is a key step in the production of certain liqueurs.","translation":"アルコール化は、特定のリキュールの製造における重要なステップです。","type":"noun","meaning_category":"アルコール添加"}]}