{"word":"pseudobulb","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"偽鱗茎（ぎりんけい）：ラン科植物に見られる、養分と水分を貯蔵する肥大した茎","english_definition":"A storage organ found in many epiphytic and lithophytic orchids, formed from a thickened stem.","examples":[{"sentence":"The pseudobulb stores water and nutrients, allowing the orchid to survive dry periods.","translation":"偽鱗茎は水と栄養分を貯蔵し、ランが乾燥期を生き残るのを助ける。"},{"sentence":"The size and shape of the pseudobulb can vary greatly depending on the species of orchid.","translation":"偽鱗茎の大きさや形は、ランの種類によって大きく異なる。"}],"collocations":["orchid pseudobulb","store nutrients in pseudobulb","thickened pseudobulb"],"synonyms":["storage organ","thickened stem"],"antonyms":[]}],"etymology":{"value":"\"Pseudo-\" (偽の、似ている) + \"bulb\" (球根) から。ラン科植物の球根に似た肥大した茎を指す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈsuːdoʊbʌlb/","syllables":"pseu-do-bulb"},"inflection":{"noun_plural":"pseudobulbs"},"usage_notes":{"explanation":"Pseudobulbs are characteristic of many orchid species, particularly those that grow on trees (epiphytes) or rocks (lithophytes). They serve as a water and nutrient reservoir, enabling the plant to withstand periods of drought or nutrient scarcity. The size, shape, and number of pseudobulbs can vary significantly between different orchid species, and they are often used as a distinguishing feature for identification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pseudobulb is a root.","correct":"✓ The pseudobulb is a stem.","note":"Pseudobulbs are modified stems, not roots."},{"incorrect":"✗ All orchids have pseudobulbs.","correct":"✓ Not all orchids have pseudobulbs.","note":"While common, not all orchid species develop pseudobulbs."}],"priority":"★★☆"},"related_words":{"derivatives":["epiphyte","lithophyte","orchid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pseudobulb\" refers to a specialized plant structure found in orchids. It is a thickened stem that functions as a storage organ for water and nutrients, helping the plant survive in environments where these resources may be scarce. Understanding the term requires some botanical knowledge, as it is not commonly used outside of the context of orchid biology and horticulture."},"example_sentences":[{"sentence":"The Cattleya orchid is known for its prominent pseudobulbs.","translation":"カトレアは、顕著な偽鱗茎で知られている。","type":"noun","meaning_category":"植物学"},{"sentence":"The health of the pseudobulb is crucial for the orchid's overall vigor.","translation":"偽鱗茎の健康は、ラン全体の生育にとって重要である。","type":"noun","meaning_category":"植物学"}]}