{"word":"rheocrat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"雄弁家政治家、弁舌家支配者：弁舌の巧みさによって政治的影響力や権力を行使する人物。","english_definition":"A politician or leader who governs or exerts political influence primarily through rhetoric and oratory skills.","examples":[{"sentence":"The ancient Athenian democracy was often swayed by rheocrats who could captivate the assembly with their speeches.","translation":"古代アテネの民主主義は、しばしば弁舌によって議会を魅了できる雄弁家政治家によって左右された。"},{"sentence":"Critics accused the president of being a rheocrat, prioritizing persuasive speeches over concrete policy.","translation":"批評家たちは、大統領が具体的な政策よりも説得力のある演説を優先する雄弁家政治家だと非難した。"}],"collocations":["rise of a rheocrat","power of a rheocrat","dangers of rheocrats"],"synonyms":["orator","demagogue","rhetorician","speechmaker","politician"],"antonyms":["statesman","technocrat","bureaucrat"]}],"etymology":{"value":"Derived from the Greek words 'rhema' (ῥῆμα) meaning 'that which is spoken, word, saying' and 'kratos' (κράτος) meaning 'power, rule, strength'.","priority":"★★★"},"pronunciation":{"ipa":"ˈriːəˌkræt","syllables":"rhe-o-crat"},"inflection":{"noun_plural":"rheocrats"},"usage_notes":{"explanation":"The term 'rheocrat' is often used critically to suggest that a leader's power is based more on persuasive rhetoric than on sound judgment or effective policy. It implies a focus on style over substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rheocrat built many bridges.","correct":"✓ The rheocrat gave many compelling speeches.","note":"Rheocrats are known for their speaking skills, not necessarily for tangible achievements like building bridges."},{"incorrect":"✗ Rheocracy is a system of government based on logic.","correct":"✓ Rheocracy is a system of government based on rhetoric.","note":"Rheocracy emphasizes rhetoric, not logic."}],"priority":"★☆☆"},"related_words":{"derivatives":["rheocracy (n.) - government by orators","rhetoric (n.) - the art of effective or persuasive speaking or writing","rhetorical (adj.) - relating to rhetoric"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rheocrat' is a relatively uncommon word used to describe a leader whose power comes from their ability to persuade through speech. It is often used negatively, implying that the leader's policies may not be as strong as their words. Understanding the word requires familiarity with the concept of rhetoric and its potential influence on politics."},"example_sentences":[{"sentence":"The senator was known as a rheocrat, captivating audiences with his passionate speeches but often lacking in legislative achievements.","translation":"その上院議員は雄弁家政治家として知られており、情熱的な演説で聴衆を魅了したが、立法上の成果はしばしば不足していた。","type":"noun","meaning_category":"politician"},{"sentence":"Some fear that in the age of social media, rheocrats can rise to power more easily by manipulating public opinion through carefully crafted messages.","translation":"ソーシャルメディアの時代には、雄弁家政治家が慎重に作成されたメッセージを通じて世論を操作することにより、より簡単に権力を握る可能性があると懸念する人もいる。","type":"noun","meaning_category":"leader"}]}