{"word":"peptonization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ペプトン化、ペプトン化作用","english_definition":"The process of converting proteins into peptones, especially by enzymatic digestion.","examples":[{"sentence":"Peptonization is an important step in the digestion of proteins.","translation":"ペプトン化はタンパク質の消化における重要なステップです。"},{"sentence":"The peptonization of milk can be achieved by adding certain enzymes.","translation":"牛乳のペプトン化は、特定の酵素を加えることで達成できます。"}],"collocations":["enzymatic peptonization","milk peptonization"],"synonyms":["proteolysis","digestion","hydrolysis"],"antonyms":[]}],"etymology":{"value":"From 'peptone' (a product of protein digestion) + '-ization' (the process of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpep.tə.naɪˈzeɪ.ʃən/","syllables":"pep-to-ni-za-tion"},"inflection":{"noun_plural":"peptonizations"},"usage_notes":{"explanation":"'Peptonization' refers to the breakdown of proteins into smaller, water-soluble peptones. This process is crucial in digestion, making proteins easier to absorb. It can also be used industrially to modify proteins for various applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The peptonization is a type of protein synthesis.","correct":"✓ Peptonization is a type of protein degradation.","note":"Peptonization is a breakdown process, not a synthesis process."}],"priority":"★★☆"},"related_words":{"derivatives":["peptonize (verb)","peptone (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peptonization' is a technical term used in biochemistry and food science to describe the enzymatic breakdown of proteins into peptones. This term is not commonly used in everyday language. Understanding this term requires knowledge of protein digestion and enzymatic processes."},"example_sentences":[{"sentence":"The rate of peptonization was measured to assess the effectiveness of the enzyme.","translation":"酵素の有効性を評価するために、ペプトン化の速度を測定しました。","type":"noun","meaning_category":"ペプトン化作用"},{"sentence":"Peptonization makes the proteins more soluble and easier to digest.","translation":"ペプトン化により、タンパク質はより可溶性になり、消化しやすくなります。","type":"noun","meaning_category":"ペプトン化作用"}]}