{"word":"micropetrology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"微岩石学、顕微鏡岩石学","english_definition":"The branch of petrology that deals with the microscopic study of rocks and minerals, typically using a petrographic microscope.","examples":[{"sentence":"Micropetrology is essential for identifying the mineral composition and texture of fine-grained rocks.","translation":"微岩石学は、細粒岩の鉱物組成と組織を特定するために不可欠です。"},{"sentence":"The micropetrology analysis revealed the presence of rare minerals in the sample.","translation":"微岩石学的分析により、サンプル中に希少鉱物が存在することが明らかになった。"}],"collocations":["micropetrology analysis","micropetrology study","thin section micropetrology"],"synonyms":["petrographic microscopy","thin section petrography"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'mikros' (small), 'petra' (rock), and 'logos' (study).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊpɪˈtrɒlədʒi/","syllables":"mi-cro-pe-trol-o-gy"},"inflection":{"noun_plural":"micropetrologies"},"usage_notes":{"explanation":"Micropetrology involves preparing thin sections of rocks and minerals and examining them under a petrographic microscope. This allows for the identification of minerals, the determination of their optical properties, and the interpretation of the rock's formation history. It is a fundamental technique in geology and materials science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Macropetrology is the same as micropetrology.","correct":"✓ Macropetrology deals with the study of rocks at a larger scale, while micropetrology focuses on microscopic analysis.","note":"Macropetrology involves studying rocks at a macroscopic level, while micropetrology uses microscopic techniques."}],"priority":"★☆☆"},"related_words":{"derivatives":["petrology","petrography","microscopy","mineralogy"],"phrases":["thin section","petrographic microscope","optical mineralogy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Micropetrology is a specialized term used in geology to describe the study of rocks and minerals at a microscopic level. This involves using techniques like thin section analysis and petrographic microscopy to identify minerals and understand the formation history of rocks. It's a technical field that requires specialized knowledge. "},"example_sentences":[{"sentence":"The micropetrology report provided valuable insights into the rock's origin.","translation":"微岩石学レポートは、岩石の起源に関する貴重な洞察を提供した。","type":"general","meaning_category":"study of rocks"},{"sentence":"Detailed micropetrology is necessary for classifying metamorphic rocks accurately.","translation":"変成岩を正確に分類するには、詳細な微岩石学が必要です。","type":"specific","meaning_category":"classification of rocks"}]}