{"word":"emanative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"発散する、放出する、流れ出る、放射する","english_definition":"Having the quality of emanating; tending to emanate or flow out.","examples":[{"sentence":"The painting had an emanative quality, as if light was radiating from within.","translation":"その絵は、まるで内側から光が放射されているかのような、発散的な性質を持っていた。"},{"sentence":"His emanative energy filled the room, making everyone feel invigorated.","translation":"彼の発散的なエネルギーが部屋を満たし、皆を活気づけた。"},{"sentence":"The emanative power of the sun is essential for life on Earth.","translation":"太陽の発散的な力は、地球上の生命にとって不可欠である。"}],"collocations":["emanative power","emanative energy","emanative quality","emanative force"],"synonyms":["radiant","effluent","effusive","outflowing","emanating"],"antonyms":["receptive","absorbing","containing"]}],"etymology":{"value":"Derived from the verb 'emanate,' which comes from the Latin 'emanare,' meaning 'to flow out or forth.' The suffix '-ive' indicates a tendency or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛmənətɪv/","syllables":"e-man-a-tive"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"'Emanative' describes something that has the quality of emanating or flowing out. It is often used to describe abstract qualities such as energy, power, or influence, but can also be used to describe physical substances like light or radiation. The word emphasizes the act of something originating and spreading outward from a source.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emanative person was very kind.","correct":"✓ The emanating person was very kind.","note":"'Emanative' describes a quality, not a person. Use 'emanating' to describe a person who is actively emitting something (e.g., kindness, energy)."},{"incorrect":"✗ The emanative smell of flowers filled the air.","correct":"✓ The emanating smell of flowers filled the air.","note":"Use 'emanating' to describe the smell actively spreading. 'Emanative' is better used for describing the general quality of something that tends to emanate."}],"priority":"★★☆"},"related_words":{"derivatives":["emanate (verb: 発散する、放出する)","emanation (noun: 発散、放出、放射)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emanative' is a relatively uncommon word used to describe something that has the quality of emitting or radiating. It is often used in philosophical or scientific contexts to describe abstract qualities or forces that originate from a source and spread outward. Understanding the root verb 'emanate' is helpful in grasping the meaning of 'emanative.'"},"example_sentences":[{"sentence":"The guru's presence had an emanative effect on the disciples, filling them with peace.","translation":"その導師の存在は弟子たちに発散的な影響を与え、彼らを平和で満たした。","type":"adjective","meaning_category":"発散する"},{"sentence":"The emanative light from the lighthouse guided ships safely to shore.","translation":"灯台から発散される光は、船を安全に岸へと導いた。","type":"adjective","meaning_category":"放射する"},{"sentence":"The emanative warmth of her smile made everyone feel welcome.","translation":"彼女の笑顔から発散される温かさは、皆を歓迎している気持ちにさせた。","type":"adjective","meaning_category":"放出する"}]}