{"word":"pidginization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ピジン化：言語接触の結果、異なる言語の話者の間でコミュニケーションを円滑にするために、既存の言語の語彙や文法を簡略化・混合して作られる言語形成のプロセス。","english_definition":"The process of a language becoming a pidgin, typically involving simplification of grammar and vocabulary and mixing of elements from different languages to facilitate communication between speakers of different languages in contact situations.","examples":[{"sentence":"The pidginization of English in some regions has resulted in unique creole languages.","translation":"いくつかの地域における英語のピジン化は、独特なクレオール言語を生み出しました。"},{"sentence":"Pidginization often occurs in trade or colonial contexts.","translation":"ピジン化はしばしば貿易や植民地の状況で起こります。"}],"collocations":["language pidginization","process of pidginization","historical pidginization"],"synonyms":["pidgin formation","creolization (related, but distinct)"],"antonyms":["decreolization","standardization"]}],"etymology":{"value":"The term is derived from 'pidgin,' which itself has uncertain origins, possibly from a Chinese pronunciation of 'business' or a similar source. The suffix '-ization' denotes the process of becoming or forming into a pidgin.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɪdʒɪnɪˈzeɪʃən/","syllables":"pi-dgin-i-za-tion"},"inflection":{"noun_plural":"pidginizations"},"usage_notes":{"explanation":"'Pidginization' refers specifically to the *process* of a language becoming a pidgin. A pidgin is a simplified language that develops as a means of communication between two or more groups that do not have a language in common. It's important to distinguish pidginization from creolization, which is the process by which a pidgin language evolves into a more complex and stable language with native speakers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pidginization is a language.","correct":"✓ Pidginization is a process.","note":"Pidginization is a process, not a language itself. The *result* of pidginization is a pidgin language."},{"incorrect":"✗ Creolization is the same as pidginization.","correct":"✓ Creolization is a related but distinct process from pidginization.","note":"Creolization is the process where a pidgin becomes a native language with more complex grammar, while pidginization is the initial formation of the simplified pidgin."}],"priority":"★★☆"},"related_words":{"derivatives":["pidgin (noun)","pidginize (verb)"],"phrasal_verbs":[],"related_concepts":["creolization","language contact","lingua franca","substrate language","superstrate language"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Pidginization' describes how a language becomes a simplified form used for communication between groups speaking different languages. It involves reducing grammar and vocabulary, often mixing elements from the languages in contact. This process is common in trade or colonial settings where people need a basic way to understand each other. It's different from 'creolization,' where a pidgin evolves into a more complex language used as a native tongue."},"example_sentences":[{"sentence":"The rapid pidginization of the trade language made it easier for merchants from different countries to communicate.","translation":"貿易言語の急速なピジン化により、異なる国からの商人がコミュニケーションを取りやすくなりました。","type":"noun","meaning_category":"language formation"},{"sentence":"Scholars study the pidginization of various languages to understand the dynamics of language contact.","translation":"学者は、言語接触のダイナミクスを理解するために、さまざまな言語のピジン化を研究しています。","type":"noun","meaning_category":"language formation"}]}