{"word":"nonegotistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"利己的でない、自己中心的でない","english_definition":"Not egotistic; lacking excessive reference to oneself or one's own interests; unselfish.","examples":[{"sentence":"She is a nonegotistic person who always puts others first.","translation":"彼女は常に他人を優先する、利己的でない人だ。"},{"sentence":"His nonegotistic actions proved his genuine kindness.","translation":"彼の利己的でない行動は、彼の真の優しさを証明した。"},{"sentence":"The organization promotes nonegotistic behavior among its members.","translation":"その組織は、会員の間で利己的でない行動を推進している。"}],"collocations":["nonegotistic behavior","nonegotistic attitude","nonegotistic approach","nonegotistic leader","nonegotistic leader","nonegotistic service"],"synonyms":["altruistic","unselfish","selfless","generous","benevolent","philanthropic","magnanimous"],"antonyms":["egotistic","selfish","self-centered","narcissistic","egoistic"]}],"etymology":{"value":"\"non-\"（否定）+ \"egotistic\"（利己的な）","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌiːɡəˈtɪstɪk/","syllables":"non-e-go-tis-tic"},"inflection":{},"usage_notes":{"explanation":"\"Nonegotistic\" is the opposite of \"egotistic.\" It describes someone who does not excessively talk about themselves or think about their own importance. It implies a focus on others and a lack of self-centeredness. It is often used to describe someone who is humble, generous, and considerate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very nonegotistical person, so he always talks about himself.","correct":"✓ He is a very egotistical person, so he always talks about himself.","note":"Nonegotistic means the opposite of egotistical. Egotistical people talk about themselves a lot."},{"incorrect":"✗ She is nonegotistic, that's why she is always bragging.","correct":"✓ She is egotistic, that's why she is always bragging.","note":"Bragging is a sign of egotism, not a lack of it."}],"priority":"★★☆"},"related_words":{"derivatives":["nonegotistically (adverb)","nonegotism (noun)"],"antonyms":["egotism (noun)","egotistically (adverb)"],"synonyms":["altruism (noun)","selflessness (noun)"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. The word is not commonly used in everyday conversation, but it is understood in formal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"nonegotistic\" is a more formal and less common word than its opposite, \"egotistic\" or \"selfish.\" It describes someone who is not focused on themselves and their own importance, but rather thinks about the needs and feelings of others. It is a useful word to describe someone who is humble, generous, and unselfish."},"example_sentences":[{"sentence":"Her nonegotistic nature made her a beloved leader.","translation":"彼女の利己的でない性格は、彼女を愛されるリーダーにした。","type":"general","meaning_category":"general"},{"sentence":"The volunteer's nonegotistic dedication to the cause was inspiring.","translation":"ボランティアのその活動に対する利己的でない献身は、感動的だった。","type":"general","meaning_category":"general"},{"sentence":"He made a nonegotistic decision to step down for the good of the team.","translation":"彼はチームのために身を引くという利己的でない決断をした。","type":"general","meaning_category":"general"}]}