{"word":"proinjunction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 差し止め命令の支持、差し止め命令の推進","english_definition":"Support for or promotion of injunctions, especially in legal contexts.","examples":[{"sentence":"The organization's proinjunction stance was criticized by civil rights groups.","translation":"その団体の差し止め命令支持の姿勢は、公民権団体から批判された。"},{"sentence":"The lawyer argued for a proinjunction approach to protect the company's intellectual property.","translation":"弁護士は、会社の知的財産を保護するために、差し止め命令を推進するアプローチを主張した。"}],"collocations":["proinjunction stance","proinjunction approach","adopt a proinjunction position"],"synonyms":["injunction advocacy","injunction support"],"antonyms":["anti-injunction","injunction opposition"]}],"etymology":{"value":"\"pro-\" (支持、推進) + \"injunction\" (差し止め命令)","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊɪnˈdʒʌŋkʃən/","syllables":"pro-in-junc-tion"},"inflection":{"noun_plural":"proinjunctions"},"usage_notes":{"explanation":"\"Proinjunction\" is a relatively rare term, primarily used in legal or political contexts to describe a position that favors the use of injunctions as a remedy or tool. It often implies a belief that injunctions are an effective or necessary means of protecting rights or preventing harm.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proinjunction was filed in court.","correct":"✓ The motion for an injunction was filed in court.","note":"\"Proinjunction\" is not the injunction itself, but rather the support for it. Use \"injunction\" to refer to the court order."}],"priority":"★★☆"},"related_words":{"derivatives":["injunction","pro (prefix)"],"related_terms":["restraining order","court order","legal remedy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"proinjunction\" is highly specialized, primarily used within legal and political discourse. It signifies a position advocating for the use of injunctions, which are court orders that prohibit specific actions. Understanding this term requires familiarity with legal terminology and concepts. Its usage is infrequent outside of these specialized contexts."},"example_sentences":[{"sentence":"The senator's proinjunction policies were seen as a way to curb protests.","translation":"その上院議員の差し止め命令を支持する政策は、抗議活動を抑制する方法と見なされた。","type":"noun","meaning_category":"legal/political stance"},{"sentence":"The company adopted a proinjunction strategy to protect its patents.","translation":"その会社は、特許を保護するために差し止め命令を推進する戦略を採用した。","type":"noun","meaning_category":"legal strategy"}]}