{"word":"unsurlily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不機嫌そうに、無愛想に","english_definition":"in an unsurly manner; in a grumpy, rude, or unfriendly way.","examples":[{"sentence":"He answered unsurlily, barely looking up from his work.","translation":"彼は仕事からほとんど顔を上げずに、不機嫌そうに答えた。"},{"sentence":"She greeted the customers unsurlily, making them feel unwelcome.","translation":"彼女は無愛想に客を迎えたので、客は歓迎されていないように感じた。"}],"collocations":["speak unsurlily","answer unsurlily","greet unsurlily","behave unsurlily"],"synonyms":["grumpily","rudely","unpleasantly","churlishly","brusquely","curtly"],"antonyms":["amiably","pleasantly","cordially","genially","affably"]}],"etymology":{"value":"\"unsurlily\" is formed by adding the suffix \"-ly\" to the adjective \"unsurly.\" \"Unsurly\" is formed by adding the prefix \"un-\" (not) to \"surly.\" \"Surly\" comes from Middle English \"sirely,\" a shortened form of \"sirly,\" meaning \"lordly, arrogant.\" Over time, \"surly\" evolved to mean \"bad-tempered and unfriendly.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsɜːrlɪli/","syllables":"un-sur-li-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Unsurlily\" describes the manner in which someone does something, indicating a lack of friendliness or politeness. It is the opposite of acting in a cheerful or welcoming way. It is not a commonly used word, and its use can sometimes sound formal or slightly archaic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unsurlily.","correct":"✓ He behaved unsurlily. / ✓ He was surly.","note":"\"Unsurlily\" is an adverb and modifies a verb. To describe someone's state of being, use the adjective \"surly\" or \"unsurly\" (though \"unsurly\" is rare)."},{"incorrect":"✗ The weather was unsurlily.","correct":"✓ The weather was unpleasant.","note":"\"Unsurlily\" describes the manner of a person's actions, not the characteristics of a thing or situation. Use adjectives like \"unpleasant\" or \"stormy\" to describe weather."}],"priority":"★★☆"},"related_words":{"derivatives":["unsurly (adjective): not surly; amiable","surly (adjective): bad-tempered and unfriendly","surliness (noun): the state of being surly"],"antonyms":["amiably","pleasantly","cordially","genially","affably"],"related_phrases":["in a surly manner","with a surly attitude"]},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR resources)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unsurlily\" is a relatively uncommon adverb that means \"in a manner that is not surly.\" To understand this word, one must first know the meaning of \"surly,\" which describes someone who is bad-tempered, unfriendly, and rude. Therefore, \"unsurlily\" describes actions or behaviors that are the opposite of this, indicating politeness, friendliness, or a lack of grumpiness. Due to its relative rarity and the need to understand \"surly\" first, this word is best suited for advanced learners of English."},"example_sentences":[{"sentence":"The waiter, trying to avoid a complaint, served the demanding customer unsurlily.","translation":"苦情を避けるため、ウェイターは要求の多い客に不機嫌そうにならないように給仕した。","type":"adverb","meaning_category":"不機嫌そうに"},{"sentence":"Even when faced with criticism, she responded unsurlily, maintaining a professional demeanor.","translation":"批判に直面しても、彼女はプロとしての態度を保ち、無愛想にならないように答えた。","type":"adverb","meaning_category":"無愛想に"}]}