{"word":"switchgear","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"開閉装置、スイッチギヤ","english_definition":"A general term covering switching devices and their combination with associated control, instrumentation, metering, protective and regulating equipment, also assemblies of such devices and equipment with associated interconnections, accessories, enclosures and supporting structures; used in connection with generation, transmission, distribution and conversion of electric power.","examples":[{"sentence":"The substation's switchgear protects the electrical grid from overloads.","translation":"変電所の開閉装置は、電気系統を過負荷から保護します。"},{"sentence":"Modern switchgear incorporates advanced monitoring and control systems.","translation":"現代の開閉装置は、高度な監視および制御システムを組み込んでいます。"}],"collocations":["high-voltage switchgear (高電圧開閉装置)","low-voltage switchgear (低電圧開閉装置)","metal-clad switchgear (金属密閉形開閉装置)","gas-insulated switchgear (ガス絶縁開閉装置)","switchgear maintenance (開閉装置のメンテナンス)","switchgear protection (開閉装置の保護)"],"synonyms":["circuit breaker","switchboard","distribution board","control panel"],"antonyms":[]}],"etymology":{"value":"The term 'switchgear' is a compound word derived from 'switch' (a device for making or breaking an electrical circuit) and 'gear' (a set of equipment or apparatus for a particular task).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswɪtʃˌɡɪər/","syllables":"switch-gear"},"inflection":{"noun_plural":"switchgears (less common, usually used as a collective noun)"},"usage_notes":{"explanation":"'Switchgear' is a collective term referring to a comprehensive assembly of electrical switching and protection devices. It's not just a single switch but a complete system. It is used to de-energize equipment to allow work to be done and to clear faults downstream. The term is primarily used in electrical engineering contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The switchgear are faulty.","correct":"✓ The switchgear is faulty.","note":"'Switchgear' is generally treated as a singular collective noun, even though it refers to multiple components. Therefore, use a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["switch (noun, verb)","gear (noun)","switching (noun, adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1 (Technical vocabulary)","frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Switchgear' is a technical term used in electrical engineering. It refers to a complete assembly of electrical devices used for switching, protecting, and controlling electrical circuits. Think of it as a sophisticated control panel for electricity. It is typically encountered in industrial settings, power plants, and substations. Understanding this term requires some background knowledge in electrical systems."},"example_sentences":[{"sentence":"The new **switchgear** will improve the reliability of the power supply.","translation":"新しい開閉装置は、電力供給の信頼性を向上させます。","type":"noun","meaning_category":"開閉装置"},{"sentence":"Regular inspection of the **switchgear** is essential for safety.","translation":"開閉装置の定期的な検査は安全のために不可欠です。","type":"noun","meaning_category":"開閉装置"}]}