{"word":"Savonnerie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サヴォネリー織り、サヴォネリー工房","english_definition":"A type of pile carpet made in France from the early 17th century onwards, or the workshop where these carpets were made.","examples":[{"sentence":"The Savonnerie carpets were originally made for the Louvre and other royal residences.","translation":"サヴォネリーのカーペットはもともとルーブル美術館やその他の王室の住居のために作られました。"}],"collocations":["Savonnerie carpet","Savonnerie workshop","Savonnerie style"],"synonyms":["French carpet","pile carpet"],"antonyms":[]}],"etymology":{"value":"Named after the Savonnerie manufactory, which was originally a hospice that was converted into a carpet-making workshop in the early 17th century in France. The word 'savonnerie' itself means 'soap factory' in French, as the hospice was originally used to produce soap.","priority":"★★☆"},"pronunciation":{"ipa":"/sa.vɔ.nʁi/","syllables":"Sa-von-ne-rie"},"inflection":{"noun_plural":"Savonneries"},"usage_notes":{"explanation":"'Savonnerie' refers specifically to a type of luxurious, hand-knotted pile carpet produced in France, particularly during the 17th to 19th centuries. The term can also refer to the workshop where these carpets were made. It is often associated with opulence and French royalty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a savonnerie rug from IKEA.","correct":"✓ I bought a rug that looks like a Savonnerie carpet.","note":"True Savonnerie carpets are antique and very expensive. It's unlikely to find a genuine one at a mass-market retailer."}],"priority":"★★☆"},"related_words":{"derivatives":["Aubusson (another type of French carpet)","Gobelins (French tapestry manufacture)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Savonnerie' is a specialized term relating to a specific type of French carpet. Understanding requires knowledge of art history and decorative arts. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The palace was adorned with exquisite Savonnerie carpets.","translation":"宮殿は精巧なサヴォネリーのカーペットで飾られていました。","type":"noun","meaning_category":"carpet"},{"sentence":"The Savonnerie manufactory was renowned for its craftsmanship.","translation":"サヴォネリー工房はその職人技で有名でした。","type":"noun","meaning_category":"workshop"}]}