{"word":"world-resented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"世界から恨まれている、世界に嫌われている","english_definition":"Disliked or resented by the world; subject to global animosity or ill will.","examples":[{"sentence":"The dictator became world-resented for his brutal regime.","translation":"その独裁者は、彼の残虐な政権のために世界から恨まれるようになった。"},{"sentence":"The policy was so unpopular that it made the country world-resented.","translation":"その政策は非常に不評だったため、その国は世界に嫌われるようになった。"}],"collocations":["become world-resented","make someone world-resented"],"synonyms":["universally disliked","globally hated","widely resented","internationally scorned"],"antonyms":["world-renowned","globally admired","universally loved","well-regarded"],"notes":"This word is not commonly used and may be considered a neologism or ad-hoc compound. Its meaning is fairly transparent from its components."}],"etymology":{"value":"Compound of 'world' and 'resented'. 'World' refers to the entire planet and its inhabitants. 'Resented' is the past participle of 'resent', meaning to feel bitterness or indignation at (a circumstance, action, or person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːld rɪˈzɛntɪd/","syllables":"world-re-sent-ed"},"inflection":{"adjective_forms":{"comparative":"more world-resented","superlative":"most world-resented"}},"usage_notes":{"explanation":"'World-resented' is a descriptive adjective, used to characterize someone or something that is the object of widespread dislike or animosity on a global scale. It is a relatively uncommon term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a world-resented person because he is shy.","correct":"✓ He is a world-resented person because of his actions.","note":"World-resented implies a global dislike due to significant actions or policies, not personal traits like shyness."}],"priority":"★☆☆"},"related_words":{"derivatives":["resent (verb)","resentment (noun)","resentful (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (due to rarity)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'world-resented' is a complex and relatively rare adjective. It implies a global scale of dislike or resentment directed towards a person, entity, or policy. Understanding requires a grasp of the individual meanings of 'world' and 'resented', and the ability to synthesize them into a cohesive concept. Due to its infrequent usage, it is more likely to be encountered in advanced texts or discussions concerning international relations, politics, or history."},"example_sentences":[{"sentence":"The regime's human rights abuses made it world-resented.","translation":"その政権の人権侵害は、それを世界から恨まれる存在にした。","type":"general","meaning_category":"general"},{"sentence":"The company's unethical practices led to it becoming world-resented among consumers.","translation":"その会社の非倫理的な慣行は、消費者の間で世界的に嫌われる存在になることにつながった。","type":"business","meaning_category":"business"}]}