{"word":"saintless","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Lacking the qualities of a saint; not saintly.","english_definition":"Devoid of saintly qualities; not exhibiting the virtues or characteristics associated with saints.","examples":[{"sentence":"The novel portrayed a gritty, saintless world where morality was ambiguous.","translation":"その小説は、道徳があいまいな、ざらざらとした聖人のいない世界を描いていた。"},{"sentence":"He led a decidedly saintless life, filled with earthly pleasures and vices.","translation":"彼は明らかに聖人のいない人生を送り、現世の喜びと悪徳に満ちていた。"}],"collocations":["saintless life","saintless world","saintless behavior"],"synonyms":["unsaintly","immoral","wicked","sinful","unrighteous"],"antonyms":["saintly","virtuous","righteous","holy"]}],"etymology":{"value":"Formed by adding the suffix '-less' (meaning 'without') to the word 'saint'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈseɪntləs/","syllables":"saint-less"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparative/superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"'Saintless' is used to describe someone or something that does not possess the qualities or characteristics typically associated with saints, such as holiness, virtue, or righteousness. It often implies a lack of moral or spiritual goodness.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["saint (noun)","saintly (adjective)","saintliness (noun)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'saintless' is relatively uncommon and is used to describe something that lacks the qualities of a saint. It is formed by adding the suffix '-less' to the word 'saint', indicating the absence of saintly characteristics. It is typically used in literary or philosophical contexts to describe a world or character devoid of traditional moral virtues."},"example_sentences":[{"sentence":"The film depicted a dark and unforgiving world populated by flawed, saintless characters.","translation":"その映画は、欠陥のある聖人のいないキャラクターが住む、暗くて容赦のない世界を描いていた。","type":"adjective","meaning_category":"Lacking saintly qualities"},{"sentence":"In a society that idolizes perfection, it's refreshing to see stories about ordinary, saintless people.","translation":"完璧を偶像化する社会では、普通の聖人のいない人々についての物語を見るのは爽やかだ。","type":"adjective","meaning_category":"Not virtuous or holy"}]}