{"word":"elicitation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"引き出すこと、誘い出すこと、聞き出すこと (情報、反応、感情など)","english_definition":"the act of drawing out or evoking (information, a response, or a feeling) from someone.","examples":[{"sentence":"The detective used careful elicitation techniques to get the suspect to confess.","translation":"刑事は容疑者に自白させるために、注意深い聞き出しのテクニックを使った。"},{"sentence":"The therapist used elicitation to help the patient uncover repressed memories.","translation":"セラピストは患者が抑圧された記憶を明らかにするのを助けるために、引き出しを行った。"},{"sentence":"Effective elicitation is crucial for successful requirements gathering in software development.","translation":"効果的な引き出しは、ソフトウェア開発における要件収集の成功に不可欠である。"}],"collocations":["information elicitation (情報引き出し)","requirements elicitation (要件引き出し)","knowledge elicitation (知識引き出し)","emotional elicitation (感情引き出し)","elicitation technique (引き出しテクニック)","elicitation method (引き出し方法)"],"synonyms":["extraction","evocation","drawing out","obtaining","gathering","acquisition","discovery","uncovering"],"antonyms":["suppression","concealment","withholding"]},{"part_of_speech":"noun","definition":"(言語学) 発話誘発、発話引き出し (言語データ収集の方法)","english_definition":"(linguistics) a method of collecting language data by prompting a speaker to produce specific utterances.","examples":[{"sentence":"Elicitation tasks are often used in linguistic research to study specific grammatical structures.","translation":"発話誘発タスクは、特定の文法構造を研究するために、言語学の研究でよく用いられる。"},{"sentence":"The linguist used picture descriptions as an elicitation technique to gather data on verb usage.","translation":"言語学者は動詞の使用に関するデータを収集するために、絵の説明を発話誘発のテクニックとして用いた。"}],"collocations":["elicitation task (発話誘発タスク)","elicitation technique (発話誘発テクニック)","data elicitation (データ発話誘発)","linguistic elicitation (言語学的発話誘発)"],"synonyms":["prompting","inducing","provoking","stimulating"],"antonyms":[]}],"etymology":{"value":"Late 16th century: from Latin 'elicitare', from 'e-' (out of) + 'lacere' (entice).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɪsɪˈteɪʃən/","syllables":"e-lic-i-ta-tion"},"inflection":{"noun_plural":"elicitations"},"usage_notes":{"explanation":"\"Elicitation\" refers to the process of drawing out information, responses, or feelings from someone, often through careful questioning or prompting. It's commonly used in fields like law enforcement, therapy, and software development. In linguistics, it specifically refers to techniques used to gather language data by prompting speakers to produce certain types of utterances. The key is that the information is not simply given, but actively drawn out from the subject.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The elicitation was very explicit.","correct":"✓ The questions used for elicitation were very explicit.","note":"\"Elicitation\" is the process itself, not the content. The questions or techniques used can be explicit, but not the elicitation itself."},{"incorrect":"✗ He used force for elicitation.","correct":"✓ He used persuasion for elicitation.","note":"Elicitation typically involves persuasion, subtle questioning, or prompting, not force or coercion."}],"priority":"★★☆"},"related_words":{"derivatives":["elicit (verb)","elicitor (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Elicitation\" is a formal term that means to draw out or bring forth something, such as information or a response, from someone. It's often used in professional contexts like law enforcement, therapy, and software development. The word implies a careful and strategic approach to getting information, rather than simply asking a question. In linguistics, it refers to specific techniques used to gather language data. Because it's a more specialized term, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The intelligence agency relied on skilled **elicitation** to gather crucial information.","translation":"諜報機関は、重要な情報を収集するために、熟練した引き出しに頼った。","type":"noun","meaning_category":"情報引き出し"},{"sentence":"During the interview, the psychologist used **elicitation** techniques to explore the patient's past experiences.","translation":"面談中、心理学者は患者の過去の経験を探るために、引き出しのテクニックを用いた。","type":"noun","meaning_category":"感情引き出し"},{"sentence":"Successful requirements **elicitation** is essential for building software that meets the needs of the users.","translation":"成功する要件引き出しは、ユーザーのニーズを満たすソフトウェアを構築するために不可欠である。","type":"noun","meaning_category":"要件引き出し"},{"sentence":"The linguist employed various **elicitation** methods to study the acquisition of verb tenses in children.","translation":"言語学者は、子供の動詞時制の習得を研究するために、様々な発話誘発方法を用いた。","type":"noun","meaning_category":"発話誘発"}]}