{"word":"trust-diminishing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"信頼を低下させる、信頼を損なう","english_definition":"Having the effect of reducing or weakening trust.","examples":[{"sentence":"His actions were trust-diminishing, making it difficult to believe him in the future.","translation":"彼の行動は信頼を損なうものであり、今後彼を信じることは難しくなった。"},{"sentence":"The company's lack of transparency was a trust-diminishing factor for investors.","translation":"その企業の透明性の欠如は、投資家にとって信頼を低下させる要因となった。"},{"sentence":"Constant delays and broken promises are trust-diminishing behaviors.","translation":"度重なる遅延と破られた約束は、信頼を損なう行動である。"}],"collocations":["trust-diminishing behavior","trust-diminishing factor","trust-diminishing action","trust-diminishing effect"],"synonyms":["trust-eroding","confidence-reducing","faith-weakening","suspicion-inducing"],"antonyms":["trust-building","trust-enhancing","confidence-boosting","faith-strengthening"]}],"etymology":{"value":"Derived from the verb 'diminish' (to make or become less) and the noun 'trust' (firm belief in the reliability, truth, ability, or strength of someone or something). The combination describes something that causes trust to decrease.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrʌst dɪˈmɪnɪʃɪŋ/","syllables":"trust-di-min-ish-ing"},"inflection":{"adjective_forms":{"comparative":"more trust-diminishing","superlative":"most trust-diminishing"}},"usage_notes":{"explanation":"'Trust-diminishing' describes actions, behaviors, or factors that lead to a reduction in trust. It is often used in the context of relationships, business, or politics to describe something that damages the credibility or reliability of an individual or entity. The term implies a negative impact on the level of trust that exists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The trust diminishing actions.","correct":"✓ The trust-diminishing actions.","note":"'Trust-diminishing' is a compound adjective, so it should be hyphenated when used before a noun."},{"incorrect":"✗ His behavior was diminishing trust.","correct":"✓ His behavior was trust-diminishing.","note":"Using 'diminishing trust' as a verb phrase is grammatically correct but less descriptive than using the adjective 'trust-diminishing'."}],"priority":"★★☆"},"related_words":{"derivatives":["trust (noun)","diminish (verb)","trustworthy (adjective)","distrust (noun/verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in professional and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trust-diminishing' is a compound adjective used to describe something that reduces or weakens trust. It is often used in formal or professional contexts to describe actions or factors that negatively impact relationships or credibility. Understanding this term requires a good grasp of vocabulary related to trust and its erosion."},"example_sentences":[{"sentence":"Spreading misinformation online is a trust-diminishing activity.","translation":"オンラインで誤った情報を広めることは、信頼を損なう行為である。","type":"adjective","meaning_category":"信頼を低下させる"},{"sentence":"The politician's scandal had a trust-diminishing effect on his supporters.","translation":"政治家のスキャンダルは、彼の支持者に対する信頼を低下させる影響を与えた。","type":"adjective","meaning_category":"信頼を損なう"},{"sentence":"Lack of communication can be a trust-diminishing factor in any relationship.","translation":"コミュニケーション不足は、あらゆる関係において信頼を低下させる要因となり得る。","type":"adjective","meaning_category":"信頼を損なう"}]}