{"word":"diastrophically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"地殻変動的に、造山運動的に","english_definition":"in a manner relating to diastrophism, the process of deformation of the earth's crust, especially by folding and faulting.","examples":[{"sentence":"The mountains were formed diastrophically over millions of years.","translation":"その山々は、数百万年かけて地殻変動的に形成された。"},{"sentence":"The region is diastrophically active, leading to frequent earthquakes.","translation":"その地域は地殻変動的に活発で、頻繁に地震が発生する。"}],"collocations":["diastrophically active","diastrophically formed"],"synonyms":["tectonically","geologically"],"antonyms":[]}],"etymology":{"value":"diastrophic + -ally","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˌstrɑːfɪkli/","syllables":"di-a-stro-phi-cal-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Diastrophically' is an adverb that describes something happening in relation to diastrophism. Diastrophism refers to large-scale deformation of the Earth's crust, typically involving folding and faulting. Therefore, 'diastrophically' is used in geological contexts to describe processes or features formed by such forces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was damaged catastrophically.","correct":"✓ The building was damaged diastrophically due to the earthquake.","note":"'Catastrophically' refers to a sudden, disastrous event, while 'diastrophically' refers to gradual deformation of the Earth's crust. Use 'diastrophically' when referring to geological processes over long periods. If the damage is sudden and severe due to an earthquake, 'catastrophically' may be more appropriate, but specifying 'diastrophically due to the earthquake' clarifies the geological context."}],"priority":"★☆☆"},"related_words":{"derivatives":["diastrophism (noun)","diastrophic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'diastrophically' is a highly specialized term used in geology to describe processes related to the deformation of the Earth's crust. It is not commonly used outside of technical or academic contexts related to geology and earth sciences. Understanding requires knowledge of geological processes like folding and faulting."},"example_sentences":[{"sentence":"The area was uplifted diastrophically.","translation":"その地域は地殻変動的に隆起した。","type":"adverb","meaning_category":"地殻変動的に"},{"sentence":"The mountains are diastrophically young.","translation":"その山々は地殻変動的に若い。","type":"adverb","meaning_category":"地殻変動的に"}]}