{"word":"Cainitic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カイン（旧約聖書に登場する人物）に関連する、またはカインのような","english_definition":"Relating to or resembling Cain (a figure in the Old Testament).","examples":[{"sentence":"The poem explored the Cainitic themes of fratricide and divine judgment.","translation":"その詩は、兄弟殺しと神の裁きというカイン的なテーマを探求した。"},{"sentence":"His Cainitic rage led him to commit terrible acts.","translation":"彼のカイン的な怒りが、彼に恐ろしい行為を犯させた。"}],"collocations":["Cainitic rage","Cainitic themes","Cainitic guilt"],"synonyms":["fratricidal","murderous","wicked"],"antonyms":["benevolent","righteous","virtuous"]}],"etymology":{"value":"Derived from the name 'Cain' (Hebrew: קַיִן Qayin), the first son of Adam and Eve in the Bible, who murdered his brother Abel. The suffix '-itic' is used to form adjectives indicating relation or resemblance.","priority":"★★★"},"pronunciation":{"ipa":"/keɪˈnɪtɪk/","syllables":"ca-i-ni-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are rarely used with this word."},"usage_notes":{"explanation":"'Cainitic' is a relatively rare word, primarily used in literary or theological contexts to describe something reminiscent of Cain's actions or character, particularly his act of fratricide (killing one's brother) and the associated feelings of guilt and divine punishment. It often carries a negative connotation, suggesting wickedness or a propensity for violence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a cainitic personality, always happy and cheerful.","correct":"✓ He had a dark, cainitic side, prone to anger and resentment.","note":"'Cainitic' implies negative traits like anger, resentment, or a tendency towards violence, not positive traits like happiness or cheerfulness."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cain (noun): The biblical figure.","Cainism (noun): A doctrine or belief system associated with Cain."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cainitic' is a specialized term primarily encountered in literary or theological discussions. Understanding its meaning requires familiarity with the biblical story of Cain and Abel and the themes associated with Cain's actions, such as fratricide, guilt, and divine judgment. Due to its rarity and specific context, it is not considered part of general vocabulary. "},"example_sentences":[{"sentence":"The novel explored the Cainitic impulse towards violence within the family.","translation":"その小説は、家族内の暴力へのカイン的な衝動を探求した。","type":"adjective","meaning_category":"relating to Cain"},{"sentence":"Critics noted the Cainitic overtones in the protagonist's actions.","translation":"批評家たちは、主人公の行動におけるカイン的な含みを指摘した。","type":"adjective","meaning_category":"resembling Cain"}]}