{"word":"pestiferously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"有害に、疫病のように、迷惑をかけるように","english_definition":"In a manner that is harmfully or destructively influential, like a pestilence; annoyingly or troublesomely.","examples":[{"sentence":"The rumors spread pestiferously throughout the town, causing widespread panic.","translation":"その噂は町中に疫病のように広がり、広範囲なパニックを引き起こした。"},{"sentence":"He pestiferously insisted on interrupting every conversation.","translation":"彼はあらゆる会話に迷惑をかけるように割り込むことを主張した。"}],"collocations":["spread pestiferously","insist pestiferously","act pestiferously"],"synonyms":["noxiously","deleteriously","perniciously","annoyingly","troublesomely","irritatingly"],"antonyms":["beneficially","helpfully","advantageously"]}],"etymology":{"value":"From \"pestiferous\" (adjective meaning 'bearing disease; destructive') + \"-ly\" (adverbial suffix). \"Pestiferous\" comes from Latin \"pestifer\" (bringing pestilence), from \"pestis\" (plague) + \"-fer\" (bearing).","priority":"★★☆"},"pronunciation":{"ipa":"/pɛˈstɪfərəsli/","syllables":"pes-tif-er-ous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Pestiferously\" is a relatively rare and formal adverb. It describes actions or influences that are not just annoying but also harmful or destructive, often in a way that spreads widely like a disease. It's stronger than simply saying something is annoying; it implies a negative impact on a larger scale.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He smiled pestiferously.","correct":"✓ He smiled mischievously.","note":"\"Pestiferously\" implies harm or annoyance, not simply playful mischief. \"Mischievously\" would be more appropriate for a playful smile."},{"incorrect":"✗ The flowers grew pestiferously in the garden.","correct":"✓ The weeds grew pestiferously in the garden.","note":"\"Pestiferously\" suggests something unwanted and harmful. While flowers are generally desirable, weeds can be described as growing pestiferously because they harm the garden."}],"priority":"★☆☆"},"related_words":{"derivatives":["pestiferous (adjective)","pest (noun)","pestilence (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and formal vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Pestiferously\" is an advanced word meaning 'in a way that is harmful or annoying, like a pestilence'. It suggests a widespread and destructive negative influence. Due to its formality and rarity, it is not commonly used in everyday conversation or writing. Understanding its etymology (related to 'pestilence' and 'pest') can help in grasping its meaning."},"example_sentences":[{"sentence":"The propaganda spread pestiferously, poisoning the minds of the populace.","translation":"そのプロパガンダは有害に広がり、大衆の心を毒した。","type":"general","meaning_category":"harmfully"},{"sentence":"The mosquitoes buzzed pestiferously around our heads, ruining our picnic.","translation":"蚊が迷惑をかけるように私たちの頭の周りを飛び回り、ピクニックを台無しにした。","type":"general","meaning_category":"annoyingly"}]}