{"word":"Wrangel","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ヴラーンゲリ (姓)","english_definition":"A surname of German and Baltic German origin.","examples":[{"sentence":"Baron Wrangel was a prominent figure in the Russian Civil War.","translation":"ヴラーンゲリ男爵はロシア内戦の著名な人物でした。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"ヴラーンゲリ島 (ロシアの島)","english_definition":"An island in the Arctic Ocean, part of Russia.","examples":[{"sentence":"Wrangel Island is a UNESCO World Heritage Site.","translation":"ヴラーンゲリ島はユネスコ世界遺産です。"},{"sentence":"Polar bears are commonly found on Wrangel Island.","translation":"ホッキョクグマはヴラーンゲリ島でよく見られます。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"ヴラーンゲリ山脈 (アラスカの山脈)","english_definition":"A mountain range in Alaska, USA.","examples":[{"sentence":"Mount Wrangell is part of the Wrangell Mountains.","translation":"マウント・ランゲルはヴラーンゲリ山脈の一部です。"},{"sentence":"The Wrangell Mountains are known for their volcanic activity.","translation":"ヴラーンゲリ山脈は火山活動で知られています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname is of German origin. The island and mountain range are named after Ferdinand von Wrangel, a Baltic German explorer and Russian admiral.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræŋɡəl/","syllables":"Wran-gel"},"inflection":{},"usage_notes":{"explanation":"\"Wrangel\" is primarily a proper noun, referring to a surname, a Russian island, or a mountain range in Alaska. When referring to the island or mountain range, it's important to use the correct spelling and capitalization.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Wrangell-St. Elias National Park and Preserve (国立公園)"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"\"Wrangel\" is a proper noun with specific geographical and historical references. It's important to understand the context to determine whether it refers to the surname, the island, or the mountain range. Knowledge of Russian history and geography, as well as Alaskan geography, is helpful in understanding the usage of this word."},"example_sentences":[{"sentence":"The **Wrangel** family has a long history in the region.","translation":"ヴラーンゲリ家はこの地域に長い歴史を持っています。","type":"proper noun","meaning_category":"surname"},{"sentence":"**Wrangel** Island is an important habitat for migratory birds.","translation":"ヴラーンゲリ島は渡り鳥にとって重要な生息地です。","type":"proper noun","meaning_category":"island"},{"sentence":"The **Wrangell** Mountains offer stunning views.","translation":"ヴラーンゲリ山脈は素晴らしい景色を提供しています。","type":"proper noun","meaning_category":"mountain range"}]}