{"word":"infrastructure-dependent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"インフラに依存する、インフラ依存型の","english_definition":"Relying on infrastructure, such as roads, power grids, or internet connections, to function or operate.","examples":[{"sentence":"The success of the project is infrastructure-dependent; without reliable power, it will fail.","translation":"プロジェクトの成否はインフラに依存している。安定した電力供給がなければ失敗するだろう。"},{"sentence":"Many modern technologies are infrastructure-dependent, making them difficult to deploy in rural areas.","translation":"多くの現代技術はインフラ依存型であり、地方地域への導入を困難にしている。"},{"sentence":"The new app is infrastructure-dependent and requires a high-speed internet connection.","translation":"新しいアプリはインフラ依存型であり、高速インターネット接続を必要とする。"}],"collocations":["infrastructure-dependent technology (インフラ依存型技術)","infrastructure-dependent system (インフラ依存型システム)","infrastructure-dependent service (インフラ依存型サービス)","infrastructure-dependent economy (インフラ依存型経済)"],"synonyms":["reliant on infrastructure","dependent on utilities","resource-dependent"],"antonyms":["infrastructure-independent","self-sufficient","autonomous"]},{"part_of_speech":"adjective","definition":"（経済などが）社会基盤整備に左右される","english_definition":"(Of an economy, etc.) Subject to the availability and quality of infrastructure.","examples":[{"sentence":"The local economy is infrastructure-dependent, so improvements to roads and bridges are vital.","translation":"地方経済は社会基盤整備に左右されるため、道路や橋の改良が不可欠である。"},{"sentence":"The region's growth is infrastructure-dependent, requiring investment in transportation and communication networks.","translation":"その地域の成長は社会基盤整備に左右され、交通および通信ネットワークへの投資が必要である。"}],"collocations":["infrastructure-dependent growth (インフラ依存型成長)","infrastructure-dependent development (インフラ依存型開発)"],"synonyms":["contingent on infrastructure","reliant on public works"],"antonyms":["infrastructure-resilient","robust"]}],"etymology":{"value":"The term is formed by combining 'infrastructure' (the basic physical and organizational structures needed for a society or enterprise to operate) with 'dependent' (relying on someone or something for support or existence).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnfrəˈstrʌktʃər dɪˈpɛndənt/","syllables":"in-fra-struc-ture-de-pen-dent"},"inflection":{"notes":"This is an adjective and does not inflect for number or gender."},"usage_notes":{"explanation":"'Infrastructure-dependent' is commonly used to describe technologies, systems, or economies that heavily rely on the availability and quality of infrastructure such as power grids, transportation networks, communication systems, and water supplies. It highlights the vulnerability or limitations of something if the necessary infrastructure is not present or functional.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very depend on infrastructure.","correct":"✓ The city is very infrastructure-dependent.","note":"Use the adjective form 'infrastructure-dependent' instead of the phrase 'depend on infrastructure' when describing something that relies on infrastructure."},{"incorrect":"✗ The project is infrastructure dependence.","correct":"✓ The project is infrastructure-dependent.","note":"Use the adjective form 'infrastructure-dependent' instead of the noun form 'infrastructure dependence'."}],"priority":"★★☆"},"related_words":{"derivatives":["dependence (名詞: 依存)","dependent (形容詞: 依存している)","infrastructure (名詞: インフラ)"],"related_terms":["infrastructure (インフラ)","utility (公共設備)","network (ネットワーク)","grid (送電網)","connectivity (接続性)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Infrastructure-dependent' is a term used to describe something that needs infrastructure (like roads, electricity, or internet) to work. It's often used when talking about technology or economic development, especially in areas where infrastructure might not be reliable. If something is 'infrastructure-dependent,' it means it won't function properly without those basic systems in place."},"example_sentences":[{"sentence":"The new smart city project is highly infrastructure-dependent, requiring extensive sensor networks and data processing capabilities.","translation":"新しいスマートシティプロジェクトは高度にインフラ依存型であり、広範なセンサーネットワークとデータ処理能力を必要とする。","type":"adjective","meaning_category":"インフラに依存する"},{"sentence":"The region's economy is infrastructure-dependent, relying heavily on efficient transportation networks to move goods.","translation":"その地域の経済はインフラ依存型であり、商品の移動に効率的な輸送ネットワークを大きく依存している。","type":"adjective","meaning_category":"社会基盤整備に左右される"},{"sentence":"The development of renewable energy sources can reduce our reliance on infrastructure-dependent fossil fuels.","translation":"再生可能エネルギー源の開発は、インフラ依存型の化石燃料への依存を減らすことができる。","type":"adjective","meaning_category":"インフラに依存する"}]}