{"word":"Undecency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"下品、わいせつ、礼儀を欠くこと","english_definition":"Behavior, speech, or appearance that is morally offensive or lacking in propriety; indecency.","examples":[{"sentence":"The film was criticized for its scenes of undecency.","translation":"その映画は、わいせつなシーンがあるとして批判された。"},{"sentence":"He was arrested for public undecency.","translation":"彼は公然わいせつ罪で逮捕された。"},{"sentence":"The politician's speech was full of undecency and offensive remarks.","translation":"その政治家の演説は、下品で不快な発言に満ちていた。"}],"collocations":["public undecency (公然わいせつ)","act of undecency (わいせつ行為)","scenes of undecency (わいせつな場面)","gross undecency (著しいわいせつ)"],"synonyms":["impropriety","indecency","obscenity","vulgarity","lewdness","smut","pornography","offensiveness","tastelessness"],"antonyms":["decency","propriety","decorum","modesty","respectability","tastefulness"]}],"etymology":{"value":"\"Undecency\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"decency.\" \"Decency\" comes from the Latin word \"decens,\" the present participle of \"decere,\" meaning \"to be fitting or becoming.\" Therefore, \"undecency\" literally means \"not fitting\" or \"not becoming.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈdiːsənsi/","syllables":"un-de-cen-cy"},"inflection":{"noun_plural":"undecencies (rarely used)"},"usage_notes":{"explanation":"\"Undecency\" refers to behavior, speech, or appearance that violates accepted standards of morality, good taste, or propriety. It often involves sexual content but can also refer to other forms of offensive or inappropriate conduct. The term is often used in legal contexts, such as laws against public undecency or obscenity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed a great undecency in her manners.","correct":"✓ She showed great indecency in her manners.","note":"The correct term is \"indecency\", not \"undecency\", when referring to a lack of proper behavior or manners. While \"undecency\" is a valid word, it is less commonly used in this context."},{"incorrect":"✗ The undecency of the situation was shocking.","correct":"✓ The indecency of the situation was shocking.","note":"Similar to the previous example, \"indecency\" is the more common and appropriate term to use when describing the shocking or offensive nature of a situation."}],"priority":"★★☆"},"related_words":{"derivatives":["indecent (adjective)","decent (adjective)","decency (noun)"],"phrases":["act of public undecency","gross act of undecency"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Undecency\" is a formal term referring to behavior or content that is considered morally offensive or inappropriate according to societal standards. It's often used in legal or formal contexts to describe actions that violate public morality or decency laws. The word implies a violation of established norms of decorum and can encompass a range of behaviors, from lewd acts to offensive language. It's less commonly used in everyday conversation compared to words like \"indecency\" or \"obscenity.\""},"example_sentences":[{"sentence":"The play was criticized for its scenes of public **undecency**.","translation":"その劇は、公然わいせつな場面があるとして批判された。","type":"general","meaning_category":"General"},{"sentence":"The website was shut down due to its promotion of **undecency**.","translation":"そのウェブサイトは、わいせつな内容を宣伝していたため閉鎖された。","type":"general","meaning_category":"General"},{"sentence":"The law prohibits acts of **undecency** in public places.","translation":"その法律は、公共の場でのわいせつ行為を禁止している。","type":"legal","meaning_category":"Legal"}]}