{"word":"Critling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, humorous) A person who habitually criticizes, especially in a petty or carping manner.","english_definition":"A person who habitually criticizes, especially in a petty or carping manner.","examples":[{"sentence":"Don't be such a critling; try to find something positive to say.","translation":"そんなにケチケチ批判ばかりしないで、何か良いところを見つけようとしてみなさい。"},{"sentence":"The internet is full of critlings who love to tear down other people's work.","translation":"インターネットは、他人の作品をけなすのが好きな批判家でいっぱいだ。"}],"collocations":["petty critling","online critling"],"synonyms":["criticaster","carper","fault-finder","nitpicker","caviller"],"antonyms":["supporter","admirer","fan"]}],"etymology":{"value":"Likely a blend of 'critic' and '-ling' (a suffix denoting a diminutive or contemptible person or thing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪtlɪŋ/","syllables":"crit-ling"},"inflection":{"noun_plural":"critlings"},"usage_notes":{"explanation":"'Critling' is a relatively rare and often humorous or derogatory term. It suggests someone who offers criticism frequently and often in a trivial or annoying way. It's not a formal word and is more likely to be used in casual conversation or writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a critling person.","correct":"✓ He is a critling. / ✓ He is a critical person.","note":"'Critling' is a noun, referring to a person. To use it as an adjective is grammatically incorrect. Use 'critical' as the adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["critic","critical","criticize","criticism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Critling' is a rare and informal word, meaning someone who is overly critical, often in a petty or annoying way. Because of its rarity, it's not commonly used or understood, and might be considered humorous or derogatory. Its use suggests a high level of English proficiency and familiarity with less common vocabulary."},"example_sentences":[{"sentence":"The blog was overrun with critlings leaving negative comments on every post.","translation":"そのブログは、すべての投稿に否定的なコメントを残す批判家たちであふれかえっていた。","type":"noun","meaning_category":"critic"}]}