{"word":"eparchate","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(正教会などの)教区、主教管区","english_definition":"A diocese or territory under the ecclesiastical jurisdiction of a bishop in certain Eastern churches.","examples":[{"sentence":"The eparchate was responsible for several parishes in the region.","translation":"その教区は、その地域のいくつかの小教区を担当していた。"},{"sentence":"The bishop oversaw the administration of the entire eparchate.","translation":"司教はその教区全体の管理を監督した。"}],"collocations":["establish an eparchate","administer an eparchate","the eparchate of [city name]"],"synonyms":["diocese","bishopric","see"],"antonyms":[]}],"etymology":{"value":"From Late Latin *eparchia*, from Greek *eparkhia* (ἐπαρχία), meaning 'province', from *eparkhos* (ἔπαρχος) 'governor of a province', from *epi-* (ἐπί) 'over' + *arkhein* (ἄρχειν) 'to rule'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛpɑːrkeɪt/","syllables":"e-par-chate"},"inflection":{"noun_plural":"eparchates"},"usage_notes":{"explanation":"The term *eparchate* is primarily used in the context of Eastern Christian churches, such as the Eastern Orthodox and Eastern Catholic churches. It refers to a territorial unit similar to a diocese in the Western Christian tradition, but with its own specific administrative and canonical characteristics. The head of an eparchate is typically a bishop or eparch.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The eparchate is governed by a priest.","correct":"✓ The eparchate is governed by a bishop.","note":"An eparchate is headed by a bishop, not a priest."}],"priority":"★☆☆"},"related_words":{"derivatives":["eparch (noun): A bishop who heads an eparchate.","eparchial (adjective): Relating to an eparchate or eparch."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word *eparchate* is a specialized term primarily used within the context of Eastern Christian churches. It refers to a territorial division or diocese headed by a bishop. Understanding of this term requires familiarity with the organizational structure of these specific religious denominations. It is not commonly used in general English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The newly formed eparchate aimed to serve the growing Ukrainian Catholic community in the region.","translation":"新しく設立された教区は、その地域で成長しているウクライナカトリックコミュニティに奉仕することを目指していた。","type":"general","meaning_category":"教区"},{"sentence":"The synod of bishops discussed the challenges facing the various eparchates under their jurisdiction.","translation":"司教会議は、彼らの管轄下にある様々な教区が直面している課題について議論した。","type":"general","meaning_category":"教区"}]}