{"word":"Videotex","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ビデオテックス（電話回線を通じてテレビ画面に文字や画像を表示するシステム）","english_definition":"A system for displaying text and graphics on a television screen using a telephone line or other communication channel.","examples":[{"sentence":"Videotex was an early form of interactive information service.","translation":"ビデオテックスは、インタラクティブな情報サービスの初期の形態でした。"},{"sentence":"Although initially promising, Videotex was eventually superseded by the internet.","translation":"当初は有望でしたが、ビデオテックスはやがてインターネットに取って代わられました。"}],"collocations":["Videotex terminal","Videotex service","Interactive Videotex"],"synonyms":["Teletext","Viewdata"],"antonyms":[]}],"etymology":{"value":"Derived from 'video' (referring to the visual display) and 'text' (referring to the textual information).","priority":"★★☆"},"pronunciation":{"ipa":"ˈvɪdiːoʊˌtɛks","syllables":"Vi-de-o-tex"},"inflection":{"noun_plural":"Videotexes (rarely used)"},"usage_notes":{"explanation":"'Videotex' refers to a specific technology that was more prevalent in the 1970s and 1980s. It is largely obsolete now, having been replaced by the internet. It is important to differentiate it from general video or text technologies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I use videotex to browse the internet.","correct":"✓ I use the internet to browse the web.","note":"Videotex is not the same as the internet. The internet is a much broader and more advanced technology."}],"priority":"★☆☆"},"related_words":{"derivatives":["Teletext","Viewdata"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - largely obsolete technology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Videotex' is a technical term referring to an early system for displaying text and graphics on a screen using telephone lines. It's not commonly used today as the technology has been superseded by the internet. Understanding this term is useful primarily for historical or technical contexts related to the evolution of information technology."},"example_sentences":[{"sentence":"The museum had a display showcasing early Videotex systems.","translation":"博物館には、初期のビデオテックスシステムを紹介する展示がありました。","type":"noun","meaning_category":"System for displaying text and graphics"},{"sentence":"Many believed Videotex would revolutionize home computing.","translation":"多くの人が、ビデオテックスが家庭用コンピューティングに革命をもたらすと信じていました。","type":"noun","meaning_category":"System for displaying text and graphics"}]}