{"word":"unlightedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"光を当てずに、照らされずに、明るくせずに","english_definition":"In an unlighted manner; without light; not brightly.","examples":[{"sentence":"The room remained unlightedly dark, even after the candles were placed inside.","translation":"ろうそくが中に置かれた後でも、部屋は光を当てられずに暗いままだった。"},{"sentence":"He walked unlightedly through the forest, relying on his sense of direction.","translation":"彼は方向感覚を頼りに、光を当てずに森の中を歩いた。"}],"collocations":["walk unlightedly","remain unlightedly","pass unlightedly"],"synonyms":["darkly","dimly","obscurely","shadowily"],"antonyms":["brightly","lightly","illuminatedly"]}],"etymology":{"value":"\"un-\" (否定) + \"lighted\" (照らされた) + \"-ly\" (副詞化接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlaɪtɪdlɪ/","syllables":"un-light-ed-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Unlightedly\" is a relatively rare adverb that describes something done or existing without light or illumination. It emphasizes the absence of light. It's often used to describe a place or action that occurs in darkness or shadow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlightedly candle sat on the table.","correct":"✓ The unlighted candle sat on the table.","note":"\"Unlightedly\" is an adverb, so it modifies a verb or adjective. \"Unlighted\" is an adjective, so it modifies a noun. In this case, the candle is unlighted, not acting unlightedly."},{"incorrect":"✗ He spoke unlightedly about the subject.","correct":"✓ He spoke darkly about the subject.","note":"\"Unlightedly\" refers to the absence of light, not a lack of enthusiasm or cheerfulness. If you want to describe a somber or pessimistic tone, use \"darkly\" or another appropriate adverb."}],"priority":"★☆☆"},"related_words":{"derivatives":["unlighted (adjective)","lightedly (adverb)","light (noun, verb, adjective)"],"antonyms":["lightedly"]},"level_frequency":{"CEFR":"N/A (rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unlightedly\" is a rare and somewhat formal adverb. It means \"without light\" or \"in a way that is not illuminated.\" Because it is not a common word, it is best used in formal writing or when a specific emphasis on the absence of light is desired. More common synonyms like \"darkly\" or \"dimly\" are often preferred in everyday language."},"example_sentences":[{"sentence":"The path wound unlightedly through the ancient forest.","translation":"道は古代の森の中を光を当てられずに曲がりくねっていた。","type":"descriptive","meaning_category":"absence of light"},{"sentence":"The stage remained unlightedly as the actors prepared for the next scene.","translation":"俳優たちが次のシーンの準備をする間、舞台は光を当てられずにいた。","type":"descriptive","meaning_category":"absence of light"}]}