{"word":"Compassionate-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having or showing eyes that express compassion or sympathy.","english_definition":"Having eyes that express or show compassion; displaying empathy and understanding through one's eyes.","examples":[{"sentence":"The nurse was a compassionate-eyed woman who always knew how to comfort her patients.","translation":"その看護師は、患者を慰める方法を常に心得ている、思いやりのある目をした女性だった。"},{"sentence":"The compassionate-eyed social worker listened intently to the family's story.","translation":"思いやりのある目をしたソーシャルワーカーは、家族の話に熱心に耳を傾けた。"},{"sentence":"Even in silence, her compassionate-eyed gaze conveyed her deep concern.","translation":"沈黙の中でも、彼女の思いやりのある眼差しは、彼女の深い懸念を伝えた。"}],"collocations":["compassionate-eyed gaze","compassionate-eyed look","compassionate-eyed expression"],"synonyms":["empathetic-eyed","sympathetic-eyed","kind-eyed","caring-eyed","understanding-eyed"],"antonyms":["uncompassionate-eyed","cold-eyed","heartless-eyed","indifferent-eyed"]}],"etymology":{"value":"A compound word formed by combining 'compassionate' (feeling or showing sympathy and concern for others) and 'eyed' (having eyes of a specified kind).","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpæʃənət aɪd/","syllables":"com-pas-sion-ate-eyed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"The term 'compassionate-eyed' is used to describe someone whose eyes reflect a deep sense of empathy and understanding. It suggests that the person is capable of feeling and expressing compassion towards others. It is often used in literature or descriptive writing to convey a character's emotional state or personality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a compassionate eyed person.","correct":"✓ He was a compassionate-eyed person.","note":"The hyphen is important to connect 'compassionate' and 'eyed' to form a single adjective modifying 'person'."},{"incorrect":"✗ She looked at him compassionate-eye.","correct":"✓ She looked at him with compassionate eyes.","note":"'Compassionate-eyed' is an adjective, not an adverb. To describe how someone looks, use 'with compassionate eyes'."}],"priority":"★★☆"},"related_words":{"derivatives":["compassion (noun)","compassionately (adverb)"],"phrases":["look with compassion","show compassion","have a compassionate heart"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly found in general text, more often used in descriptive writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Compassionate-eyed' is a relatively advanced descriptive adjective used to vividly portray someone's character or emotional state. It implies a deep level of empathy and understanding that is visible in their eyes. Due to its specific and descriptive nature, it is more commonly found in literature or detailed character descriptions rather than everyday conversation."},"example_sentences":[{"sentence":"The doctor, a compassionate-eyed man, reassured the patient with a gentle smile.","translation":"その医者は、思いやりのある目をした男で、優しい笑顔で患者を安心させた。","type":"adjective","meaning_category":"showing compassion"},{"sentence":"Her compassionate-eyed portraits captured the essence of human kindness.","translation":"彼女の思いやりのある目をしたポートレートは、人間の優しさの本質を捉えていた。","type":"adjective","meaning_category":"expressing empathy"},{"sentence":"He offered a comforting hand to the weeping child, his compassionate-eyed gaze full of concern.","translation":"彼は泣いている子供に慰めの手を差し伸べ、思いやりのある眼差しは心配でいっぱいだった。","type":"adjective","meaning_category":"displaying sympathy"}]}