{"word":"Tarnisher","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person or thing that tarnishes.","english_definition":"A person or thing that causes something to become dull or discolored; someone or something that damages the reputation of something.","examples":[{"sentence":"He was a tarnisher of reputations, spreading rumors and lies.","translation":"彼は評判を傷つける人であり、噂や嘘を広めていた。"},{"sentence":"The scandal was a tarnisher of the company's image.","translation":"そのスキャンダルは会社のイメージを傷つけた。"}],"collocations":["reputation tarnisher","image tarnisher"],"synonyms":["defamer","slanderer","libeler","detractor","spoiler","blemisher"],"antonyms":["enhancer","beautifier","protector"]}],"etymology":{"value":"Derived from the verb 'tarnish', with the addition of the suffix '-er' to denote an agent or one who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrnɪʃər/","syllables":"tar-nish-er"},"inflection":{"noun_plural":"Tarnishers"},"usage_notes":{"explanation":"'Tarnisher' refers to someone or something that causes a loss of luster, either literally (making something dull) or figuratively (damaging a reputation). It is often used in contexts where someone's actions or a particular event negatively impacts the perception or value of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tarnisher was a good thing for the company.","correct":"✓ The tarnisher was a bad thing for the company.","note":"A 'tarnisher' is inherently negative, so it cannot be a 'good thing'."},{"incorrect":"✗ Use the tarnisher to clean the silver.","correct":"✓ Use the polish to clean the silver.","note":"A 'tarnisher' causes tarnishing, it doesn't remove it. Use a 'polish' or 'cleaner' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["tarnish (verb, noun)","tarnished (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tarnisher' is not commonly used. It refers to someone or something that damages the reputation or appearance of something else. It's more frequently used in formal or literary contexts."},"example_sentences":[{"sentence":"The journalist was known as a ruthless tarnisher of political careers.","translation":"そのジャーナリストは、政治家のキャリアを無慈悲に傷つける人として知られていた。","type":"noun","meaning_category":"person"},{"sentence":"The economic downturn acted as a tarnisher of the city's once-gleaming prosperity.","translation":"景気後退は、かつて輝いていた都市の繁栄を傷つけるものとして作用した。","type":"noun","meaning_category":"thing"}]}