{"word":"Othello","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オセロ (シェイクスピアの戯曲)","english_definition":"A tragedy by William Shakespeare, believed to have been written in approximately 1603.","examples":[{"sentence":"Othello is one of Shakespeare's most famous tragedies.","translation":"オセロはシェイクスピアの最も有名な悲劇の一つです。"},{"sentence":"The play Othello explores themes of jealousy and betrayal.","translation":"戯曲『オセロ』は、嫉妬と裏切りというテーマを探求しています。"}],"collocations":["play Othello","Shakespeare's Othello","Othello's jealousy"],"synonyms":["The Tragedy of Othello, the Moor of Venice"],"antonyms":[]},{"part_of_speech":"noun","definition":"オセロ (主人公)","english_definition":"The title character and protagonist of Shakespeare's play Othello. He is a Moorish general in the Venetian army.","examples":[{"sentence":"Othello is a tragic hero who is easily manipulated.","translation":"オセロは、簡単に操られてしまう悲劇の主人公です。"},{"sentence":"The character of Othello is complex and flawed.","translation":"オセロという人物は複雑で欠点があります。"}],"collocations":["character of Othello","Othello's character","Othello's downfall"],"synonyms":["The Moor of Venice"],"antonyms":[]},{"part_of_speech":"noun","definition":"オセロ (ゲーム)","english_definition":"A board game for two players, played on an 8x8 board with pieces that are black on one side and white on the other.","examples":[{"sentence":"Do you want to play a game of Othello?","translation":"オセロをしませんか？"},{"sentence":"Othello is a game of strategy and tactics.","translation":"オセロは戦略と戦術のゲームです。"}],"collocations":["play Othello","Othello board","Othello pieces"],"synonyms":["Reversi"],"antonyms":[]}],"etymology":{"value":"The name 'Othello' is likely derived from the name 'Otto'. Shakespeare may have chosen this name for its exotic and foreign sound, fitting the character's Moorish background.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈθɛloʊ/","syllables":"o-thel-lo"},"inflection":{"notes":"Othello is a proper noun and does not typically have plural forms."},"usage_notes":{"explanation":"'Othello' can refer to the Shakespearean play, the main character in the play, or the board game. The context usually makes it clear which meaning is intended. When referring to the play, it is often italicized or written as 'Othello'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw Othello on TV last night.","correct":"✓ I saw Othello on TV last night. (Italicized or quoted)","note":"When referring to the play, it's best to italicize the title or put it in quotes. This helps distinguish it from the character."},{"incorrect":"✗ Othello is a very easy game to win.","correct":"✓ Othello is a very easy game to learn.","note":"Othello is easy to learn but difficult to master, so 'easy to win' is not accurate."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"characters":["Desdemona","Iago","Cassio","Emilia","Roderigo"],"themes":["jealousy","betrayal","revenge","racism","manipulation"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in literary and cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Othello' is a word with multiple meanings. It can refer to a famous play by Shakespeare, the main character in that play, or a popular board game. When discussing literature or theater, 'Othello' likely refers to the play. When discussing games, it refers to the board game. The context will usually make the meaning clear. Understanding the themes of the play, such as jealousy and betrayal, can help in interpreting discussions about 'Othello' in a literary context."},"example_sentences":[{"sentence":"The Royal Shakespeare Company is performing **Othello** this summer.","translation":"ロイヤル・シェイクスピア・カンパニーは今年の夏に『オセロ』を上演します。","type":"noun","meaning_category":"Shakespeare's play"},{"sentence":"**Othello** was driven to madness by Iago's lies.","translation":"オセロはイアーゴの嘘によって狂気に駆り立てられました。","type":"noun","meaning_category":"Main character"},{"sentence":"She beat me at **Othello** three times in a row.","translation":"彼女はオセロで私に3連勝しました。","type":"noun","meaning_category":"Board game"}]}