{"word":"lipid-modified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脂質修飾された、脂質修飾を受けた","english_definition":"Having undergone lipid modification, a process where a lipid moiety is attached to a protein or other molecule.","examples":[{"sentence":"The protein is lipid-modified to facilitate its membrane association.","translation":"そのタンパク質は、膜結合を促進するために脂質修飾されています。"},{"sentence":"Lipid-modified proteins play crucial roles in cell signaling.","translation":"脂質修飾されたタンパク質は、細胞シグナル伝達において重要な役割を果たします。"},{"sentence":"Analysis of lipid-modified peptides is essential for understanding protein function.","translation":"脂質修飾されたペプチドの分析は、タンパク質の機能を理解するために不可欠です。"}],"collocations":["lipid-modified protein (脂質修飾タンパク質)","lipid-modified peptide (脂質修飾ペプチド)","lipid modification (脂質修飾)","N-terminal lipid-modified (N末端脂質修飾された)","C-terminal lipid-modified (C末端脂質修飾された)"],"synonyms":["lipidated","fatty acylated","prenylated","myristoylated","palmitoylated","glycosylphosphatidylinositol (GPI)-anchored"],"antonyms":[],"technical_domains":["biochemistry","cell biology","molecular biology"]}],"etymology":{"value":"Derived from the combination of 'lipid' (a type of fat molecule) and 'modified' (altered or changed). It describes a molecule, typically a protein, that has been altered by the addition of a lipid group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪpɪd ˈmɒdɪfaɪd/","syllables":"lip-id mod-i-fied"},"inflection":{"notes":"Does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Lipid-modified' is a descriptive term used in biochemistry and molecular biology to indicate that a molecule, usually a protein, has had a lipid group covalently attached to it. This modification often affects the protein's localization, stability, and interactions with other molecules, particularly in the context of cell membranes. The specific type of lipid modification (e.g., myristoylation, palmitoylation, prenylation, GPI-anchor addition) can influence the protein's function and behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lipid modified protein.","correct":"✓ The lipid-modified protein.","note":"The hyphen is important to show that 'lipid' is modifying 'modified', creating a single adjective."},{"incorrect":"✗ Lipid modified is when a protein changes.","correct":"✓ Lipid modification is when a protein changes.","note":"'Lipid modified' is an adjective describing the protein. 'Lipid modification' is the process itself."}],"priority":"★★☆"},"related_words":{"derivatives":["lipid modification (脂質修飾)","lipidation (脂質付加)","prenylation (プレニル化)","myristoylation (ミリストイル化)","palmitoylation (パルミトイル化)","GPI-anchor (GPIアンカー)"],"related_terms":["acylation (アシル化)","post-translational modification (翻訳後修飾)","membrane protein (膜タンパク質)","signal transduction (シグナル伝達)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lipid-modified' is a technical term primarily used in the fields of biochemistry, cell biology, and molecular biology. It describes a molecule, typically a protein, that has been altered by the covalent attachment of a lipid group. This modification can affect the protein's localization, stability, and interactions, especially in relation to cell membranes. Understanding this term requires familiarity with basic concepts in protein structure, lipid chemistry, and cell signaling."},"example_sentences":[{"sentence":"Glycosylphosphatidylinositol (GPI) anchors are a common type of lipid modification, thus the protein is considered **lipid-modified**.","translation":"グリコシルホスファチジルイノシトール（GPI）アンカーは一般的な脂質修飾の一種であり、したがってそのタンパク質は脂質修飾されていると見なされます。","type":"adjective","meaning_category":"脂質修飾された"},{"sentence":"The research focused on identifying novel **lipid-modified** proteins in cancer cells.","translation":"その研究は、癌細胞における新規な脂質修飾タンパク質の特定に焦点を当てていました。","type":"adjective","meaning_category":"脂質修飾された"},{"sentence":"**Lipid-modified** Ras proteins are crucial for activating downstream signaling pathways.","translation":"脂質修飾されたRasタンパク質は、下流のシグナル伝達経路を活性化するために重要です。","type":"adjective","meaning_category":"脂質修飾された"}]}