{"word":"Metacism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A defect in speech, consisting in the too frequent use, or the improper use, of the letter m.","english_definition":"A speech defect characterized by the excessive or incorrect use of the letter 'm'.","examples":[{"sentence":"The speaker's metacism made their words difficult to understand.","translation":"その話者のメタシズムは、彼らの言葉を理解しにくくした。"},{"sentence":"The child's speech therapist worked to correct the metacism.","translation":"その子供の言語療法士は、メタシズムを矯正するために尽力した。"}],"collocations":["speech defect","language disorder","articulation problem"],"synonyms":["stammer","lisp","speech impediment"],"antonyms":[]}],"etymology":{"value":"From Greek 'meta' (μετά) meaning 'with' or 'after', combined with a suffix indicating a condition or state related to the letter 'm'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛtəˌsɪzəm/","syllables":"met-a-cis-m"},"inflection":{"noun_plural":"metacisms"},"usage_notes":{"explanation":"Metacism is a relatively rare term referring to a specific speech defect involving the letter 'm'. It's more commonly encountered in linguistic or medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a metacism in his writing.","correct":"✓ He has a speech impediment.","note":"Metacism specifically refers to a speech defect, not a writing issue."},{"incorrect":"✗ Metacism is a type of mental illness.","correct":"✓ Metacism is a speech defect.","note":"Metacism is a speech-related issue, not a mental illness."}],"priority":"★★☆"},"related_words":{"derivatives":["metacist (noun: a person who exhibits metacism)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Metacism' is a highly specialized term primarily used in linguistics and speech pathology. It describes a specific speech defect related to the letter 'm'. Due to its limited usage, it's not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The linguist studied the patterns of metacism in the dialect.","translation":"言語学者は、その方言におけるメタシズムのパターンを研究した。","type":"noun","meaning_category":"speech defect"},{"sentence":"The doctor diagnosed the patient with a mild form of metacism.","translation":"医師は、患者を軽度のメタシズムと診断した。","type":"noun","meaning_category":"speech defect"}]}