{"word":"presurmised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(推測する) to surmise beforehand; to conjecture or suppose in advance.","english_definition":"To assume or suppose something to be true beforehand; to make a conjecture or hypothesis before having complete information.","examples":[{"sentence":"Based on the available evidence, we presurmised that the suspect had an accomplice.","translation":"入手可能な証拠に基づいて、容疑者には共犯者がいると推測した。"},{"sentence":"The detective presurmised the motive for the crime before interviewing the witnesses.","translation":"刑事は証人に聞き取り調査をする前に、犯罪の動機を推測した。"}],"collocations":["presurmise a motive","presurmise a conclusion","presurmise an outcome"],"synonyms":["presume","conjecture","hypothesize","speculate","anticipate","guess"],"antonyms":["know","prove","verify","confirm"]}],"etymology":{"value":"The word \"presurmise\" is formed by adding the prefix \"pre-\" (meaning before) to the word \"surmise\" (to guess or suppose).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːsərˈmaɪzd/","syllables":"pre-sur-mised"},"inflection":{"verb_forms":{"present_simple":["presurmise","presurmises"],"past_simple":"presurmised","past_participle":"presurmised","present_participle":"presurmising"}},"usage_notes":{"explanation":"\"Presurmise\" is a relatively uncommon word that means to guess or suppose something in advance, often based on limited information. It suggests a preliminary assumption or hypothesis. It's more formal than simply \"guess\" or \"assume.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I presurmised the answer after knowing the facts.","correct":"✓ I surmised the answer after knowing the facts.","note":"\"Presurmise\" implies guessing *before* knowing all the facts. If you know the facts, use \"surmise\" or \"conclude\"."},{"incorrect":"✗ She presurmised that he will come.","correct":"✓ She presurmised that he would come.","note":"When using \"presurmise\" in the past tense, the verb in the subordinate clause often changes to the conditional tense (would)."}],"priority":"★★☆"},"related_words":{"derivatives":["surmise","presurmisation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Presurmise' is a formal verb meaning to guess or suppose something before having all the information. It's not a common word and is used in academic or formal contexts when indicating a preliminary hypothesis or assumption based on limited evidence. It implies a degree of educated guessing or anticipation of an outcome or conclusion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scientists presurmised the existence of a new particle based on theoretical models.","translation":"科学者たちは理論モデルに基づいて、新しい粒子の存在を事前に推測した。","type":"verb","meaning_category":"推測する"},{"sentence":"Before the investigation began, the police presurmised that the crime was an inside job.","translation":"捜査が始まる前に、警察はその犯罪は内部犯行であると事前に推測した。","type":"verb","meaning_category":"推測する"}]}