{"word":"scraggedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"不格好に、粗末に、ぼろぼろに","english_definition":"In a scragged manner; roughly, untidily, or raggedly.","examples":[{"sentence":"The old man was dressed scraggedly, his clothes torn and dirty.","translation":"その老人はぼろぼろの服を着て、不格好な格好をしていた。"},{"sentence":"The garden was scraggedly overgrown with weeds.","translation":"庭は雑草がぼうぼうと生えて、粗末な状態だった。"}],"collocations":[],"synonyms":["raggedly","shabbily","untidily","roughly","poorly"],"antonyms":["neatly","smartly","tidily"]}],"etymology":{"value":"Derived from 'scragged', which is an adjective meaning 'thin, bony, or scraggy', combined with the adverbial suffix '-ly'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskræɡɪdli/","syllables":"scrag-ged-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Scraggedly' describes the manner in which something is done or appears, emphasizing a lack of neatness, tidiness, or care. It often implies a state of disrepair or neglect. It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["scragged (adjective)","scraggy (adjective)","scrag (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (This word is not commonly used.)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Scraggedly' is a relatively uncommon word used to describe something done or appearing in a rough, untidy, or neglected manner. It is derived from 'scragged' or 'scraggy', which describe something thin and bony or unkempt. Because of its rarity, it is more likely to be encountered in descriptive writing aiming for a specific effect rather than in everyday conversation."},"example_sentences":[{"sentence":"The scarecrow stood scraggedly in the field, its straw stuffing poking out.","translation":"かかしは麦わらが飛び出した状態で、畑に不格好に立っていた。","type":"adverb","meaning_category":"不格好に"},{"sentence":"The once-grand house now sat scraggedly on the hill, paint peeling and windows broken.","translation":"かつて壮大だった家は、今ではペンキが剥がれ、窓が割れた状態で丘の上に粗末に建っていた。","type":"adverb","meaning_category":"粗末に"},{"sentence":"The beggar was scraggedly dressed, his clothes hanging loosely on his thin frame.","translation":"その乞食はぼろぼろの服を着ており、その服は彼の痩せた体にだらしなくぶら下がっていた。","type":"adverb","meaning_category":"ぼろぼろに"}]}