{"word":"chastiser","meanings":[{"part_of_speech":"noun","definition":"A person who chastises; one who punishes or reprimands severely.","english_definition":"A person who inflicts punishment or severe criticism.","examples":[{"sentence":"The strict headmaster was known as a harsh chastiser of students who broke the rules.","translation":"厳格な校長は、規則を破った生徒を厳しく罰することで知られていた。"},{"sentence":"History remembers him as a chastiser of corruption, unafraid to confront powerful figures.","translation":"歴史は彼を、権力者と対峙することを恐れない、腐敗を厳しく罰する者として記憶している。"}],"synonyms":["disciplinarian","punisher","reprover","critic","corrector"],"antonyms":["praiser","lauder","supporter","advocate"],"related_words":["chastise","chastisement"],"notes":"Often implies a sense of moral or righteous indignation in the act of punishing or criticizing."}],"etymology":{"value":"Derived from the verb 'chastise,' which comes from Old French 'chastiier' meaning 'to punish, correct, discipline,' ultimately from Latin 'castigare' meaning 'to purify, correct.'","notes":"The etymology highlights the original sense of purification or correction through punishment."},"pronunciation":{"ipa":"ˈtʃæstaɪzər","syllables":"chas-ti-ser"},"inflection":{"noun_plural":"chastisers"},"level_frequency":{"frequency_google_ngram":"Low frequency - relatively uncommon word.","notes":"More common in historical or literary contexts than in contemporary usage."},"readability_explanation":{"level":"C1","text":"The word 'chastiser' is a relatively formal and uncommon term, typically used in contexts where someone is acting as a severe punisher or critic, often with a sense of moral justification. It implies a more intense or formalized role of punishment than simply 'critic' or 'punisher.'"},"example_sentences":[{"sentence":"The newspaper columnist became a well-known chastiser of political hypocrisy.","translation":"その新聞コラムニストは、政治的偽善を厳しく批判することで有名になった。","type":"general"},{"sentence":"In the novel, the protagonist becomes a self-appointed chastiser of the wicked.","translation":"小説の中で、主人公は自らを任命して悪人を罰する者となる。","type":"literary"},{"sentence":"He was seen as a chastiser of the company's wasteful spending habits.","translation":"彼は会社の無駄遣いを厳しく非難する人だと見られていた。","type":"business"}]}