{"word":"media-poor","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"情報弱者、メディアへのアクセスが限られている、またはメディアリテラシーが低い","english_definition":"Having limited access to media or lacking media literacy skills; often used to describe individuals or communities with restricted access to information and communication technologies.","examples":[{"sentence":"The digital divide leaves many rural communities media-poor, unable to access online resources.","translation":"デジタルデバイドにより、多くの地方コミュニティが情報弱者となり、オンラインリソースにアクセスできなくなっています。"},{"sentence":"Educational programs are needed to help media-poor populations develop critical thinking skills about online content.","translation":"情報弱者の人々がオンラインコンテンツについて批判的思考力を養うための教育プログラムが必要です。"},{"sentence":"Elderly people are often media-poor, struggling to navigate new technologies.","translation":"高齢者は新しい技術を使いこなすのに苦労することが多く、情報弱者になりがちです。"}],"collocations":["digital divide","media literacy","information access","online resources","critical thinking skills"],"synonyms":["informationally disadvantaged","digitally excluded","media-illiterate","information-poor"],"antonyms":["media-rich","information-rich","digitally included","media-literate"]}],"etymology":{"value":"A compound word formed by combining \"media\" (referring to various forms of communication) and \"poor\" (indicating a lack or deficiency). The term highlights the lack of access to or understanding of media resources.","priority":"N/A"},"pronunciation":{"ipa":"/ˈmiːdiə pʊər/","syllables":"me-di-a poor"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Media-poor\" describes a state of lacking access to media resources, or the skills to effectively use them. This can include a lack of internet access, limited access to traditional media like newspapers and television, or a lack of media literacy skills needed to critically evaluate information. The term is often used in discussions about the digital divide and social inequality.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The media-poor country has no television.","correct":"✓ The media-poor country has limited access to television and internet.","note":"\"Media-poor\" doesn't necessarily mean a complete absence of media, but rather limited access or understanding."},{"incorrect":"✗ He is media-poor because he is lazy.","correct":"✓ He is media-poor because he lacks access to technology and training.","note":"\"Media-poor\" is usually due to external factors like lack of access or education, not personal traits like laziness."}],"priority":"N/A"},"related_words":{"derivatives":["media poverty (名詞: 情報弱者の状態)"],"phrasal_verbs":[],"related_concepts":["digital divide","media literacy","information access","digital inclusion","social inequality"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing in use due to discussions about digital inequality.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"\"Media-poor\" is a term used to describe individuals or communities who lack access to or the skills to effectively use media resources. This can include a lack of internet access, limited access to traditional media, or a lack of media literacy skills. The term is often used in discussions about the digital divide and social inequality. Understanding this term requires a familiarity with concepts like media literacy and the digital divide."},"example_sentences":[{"sentence":"The organization aims to bridge the digital divide and empower media-poor communities.","translation":"その組織は、デジタルデバイドを解消し、情報弱者のコミュニティを支援することを目指しています。","type":"adjective","meaning_category":"情報弱者"},{"sentence":"Many schools in low-income areas struggle to provide adequate technology resources, leaving students media-poor.","translation":"低所得地域の多くの学校は、十分な技術リソースを提供することが困難であり、生徒たちは情報弱者のままになっています。","type":"adjective","meaning_category":"情報弱者"},{"sentence":"Addressing media poverty requires a multi-faceted approach, including infrastructure development and media literacy education.","translation":"情報弱者問題に対処するには、インフラ整備とメディアリテラシー教育を含む多角的なアプローチが必要です。","type":"adjective","meaning_category":"情報弱者"}]}