{"word":"preinstillation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)（手術、処置などの前に）あらかじめ液体などを注入すること","english_definition":"The act of instilling (introducing a liquid) beforehand, especially in a medical context before a procedure.","examples":[{"sentence":"Preinstillation of antibiotics can help prevent infection during surgery.","translation":"手術前に抗生物質をあらかじめ注入することで、感染予防に役立つことがあります。"},{"sentence":"Preinstillation of a lubricant can ease the insertion of a medical device.","translation":"医療機器の挿入を容易にするために、潤滑剤をあらかじめ注入することがあります。"}],"collocations":["antibiotic preinstillation","lubricant preinstillation"],"synonyms":["pre-injection","pre-application"],"antonyms":["postinstillation"]}],"etymology":{"value":"\"pre-\" (before) + \"instillation\" (the act of instilling). Instillation comes from Latin instillare, meaning to pour in drop by drop.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪnstɪˈleɪʃən/","syllables":"pre-in-stil-la-tion"},"inflection":{"noun_plural":"preinstallations"},"usage_notes":{"explanation":"\"Preinstillation\" is a technical term primarily used in medical contexts. It refers to the process of introducing a liquid substance into a body cavity or passage before a surgical procedure or other medical intervention. The purpose is often to prepare the area, prevent infection, or facilitate the procedure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preinstillation was done after the surgery.","correct":"✓ The preinstillation was done before the surgery.","note":"Preinstillation, by definition, happens before the procedure."}],"priority":"★★☆"},"related_words":{"derivatives":["instillation","pre-","install"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Preinstillation\" is a specialized medical term referring to the act of introducing a liquid substance before a procedure. It requires understanding of medical terminology and contexts. It is not commonly used outside of medical or scientific fields."},"example_sentences":[{"sentence":"The study evaluated the effectiveness of antibiotic preinstillation in reducing postoperative infections.","translation":"その研究では、術後の感染症を減らすための抗生物質の術前注入の有効性が評価されました。","type":"noun","meaning_category":"medical procedure"}]}