{"word":"Pararescue","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"空挺救難員、パラレスキュー隊員","english_definition":"A member of a military unit that specializes in rescuing downed pilots or other personnel in combat or hostile environments, often involving parachute jumps or other specialized techniques.","examples":[{"sentence":"The Pararescue team was deployed to rescue the injured soldiers.","translation":"パラレスキュー隊が負傷した兵士を救助するために派遣された。"},{"sentence":"Pararescue training is extremely rigorous and demanding.","translation":"パラレスキューの訓練は非常に厳しく、過酷である。"},{"sentence":"He is a highly decorated Pararescue jumper.","translation":"彼は数々の勲章を受けたパラレスキュー隊員だ。"}],"collocations":["Pararescue team","Pararescue training","Pararescue jumper","Air Force Pararescue","Navy Pararescue"],"synonyms":["PJ (Pararescue Jumper)"],"antonyms":[],"notes":"Pararescue is often abbreviated as PJ.","origin":"United States Air Force and other military branches."}],"etymology":{"value":"'Para-' is a prefix denoting parachute or parachuting. 'Rescue' refers to the act of saving someone from danger. Therefore, 'Pararescue' combines these elements to describe a unit specializing in rescue operations involving parachuting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærə.rɪˈskjuː/","syllables":"pa-ra-re-scue"},"inflection":{"noun_plural":"Pararescuemen (often used, though Pararescue teams is more common)"},"usage_notes":{"explanation":"'Pararescue' refers specifically to military personnel trained in air and sea rescue, combat medicine, and survival techniques. They are often deployed in dangerous and remote locations. The term is most commonly associated with the United States Air Force, but other military branches have similar units.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a para-rescue.","correct":"✓ He is a Pararescue member. / ✓ He is a Pararescue jumper.","note":"'Pararescue' is a noun referring to the unit or the role, not an adjective. You need to add 'member' or 'jumper' to describe a person. Also, the term is usually capitalized."},{"incorrect":"✗ They performed a para rescue.","correct":"✓ They performed a Pararescue operation. / ✓ They conducted a Pararescue mission.","note":"'Pararescue' describes the type of operation, so you need to add 'operation' or 'mission' to specify the action."}],"priority":"★★☆"},"related_words":{"derivatives":["Pararescueman","PJ (Pararescue Jumper)"],"phrases":["Combat Search and Rescue (CSAR)","Search and Rescue (SAR)"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency, primarily used in military and aviation contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pararescue' is a specialized term used in military contexts to describe highly trained personnel who perform rescue operations in combat or hostile environments. It requires understanding of military terminology and operations. The term is not commonly used in general conversation and is more likely to appear in news reports or documentaries about military activities."},"example_sentences":[{"sentence":"The Air Force **Pararescue** team is known for its bravery and skill.","translation":"空軍のパラレスキュー隊は、その勇敢さと技能で知られている。","type":"noun","meaning_category":"空挺救難隊"},{"sentence":"**Pararescue** training includes advanced medical techniques and survival skills.","translation":"パラレスキューの訓練には、高度な医療技術とサバイバルスキルが含まれている。","type":"noun","meaning_category":"空挺救難隊の訓練"},{"sentence":"The **Pararescuemen** jumped from the helicopter to reach the stranded hikers.","translation":"パラレスキュー隊員たちは、立ち往生したハイカーに到達するためにヘリコプターから飛び降りた。","type":"noun","meaning_category":"空挺救難隊員"}]}