{"word":"infranodal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)房室結節より下の部位の、またはそれに関する","english_definition":"(medicine) situated below or relating to the atrioventricular node.","examples":[{"sentence":"Infranodal block is a type of heart block occurring below the atrioventricular node.","translation":"房室結節下ブロックは、房室結節より下の部位で発生する心臓ブロックの一種です。"},{"sentence":"The infranodal conduction system is responsible for transmitting electrical impulses to the ventricles.","translation":"房室結節下の伝導系は、電気的インパルスを心室に伝達する役割を担っています。"}],"collocations":["infranodal block","infranodal conduction","infranodal pathway"],"synonyms":["infra-Hisian","below the AV node"],"antonyms":["supranodal"]},{"part_of_speech":"adjective","definition":"(解剖学)節の下の","english_definition":"(anatomy) below a node.","examples":[{"sentence":"The infranodal region of the lymph node was examined.","translation":"リンパ節の節下領域を調べました。"}],"collocations":[],"synonyms":["subnodal"],"antonyms":["supranodal"]}],"etymology":{"value":"\"infra-\" (below) + \"nodal\" (relating to a node).","priority":"★★★"},"pronunciation":{"ipa":"ˌɪnfrəˈnoʊdəl","syllables":"in-fra-no-dal"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term \"infranodal\" is primarily used in a medical context, specifically cardiology, to describe structures or conditions located below the atrioventricular (AV) node in the heart's electrical conduction system. It can also be used more generally in anatomy to describe something located below a node, such as a lymph node.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The infranodal is blocked.","correct":"✓ The infranodal conduction is blocked.","note":"\"Infranodal\" is an adjective and needs to modify a noun. Use it with a noun like \"conduction,\" \"block,\" or \"pathway.\""}],"priority":"★★☆"},"related_words":{"derivatives":["infra- (prefix meaning below)","nodal (adjective relating to a node)","node (noun: a point in a system where lines or pathways intersect or branch; in medicine, a mass of tissue, such as a lymph node)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (highly specialized medical vocabulary)","frequency_google_ngram":"Low frequency. Primarily found in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'infranodal' is a highly specialized term primarily used in the field of cardiology. It describes structures or conditions located below the atrioventricular (AV) node, which is a critical component of the heart's electrical conduction system. Understanding this term requires a strong background in medical terminology and cardiac physiology. It is not commonly used outside of professional medical contexts."},"example_sentences":[{"sentence":"An infranodal block can lead to a slower heart rate.","translation":"房室結節下ブロックは、心拍数の低下につながる可能性があります。","type":"medical","meaning_category":"below AV node"},{"sentence":"The surgeon carefully examined the infranodal region during the procedure.","translation":"外科医は手術中に房室結節下の領域を注意深く調べました。","type":"medical","meaning_category":"below AV node"}]}