{"word":"Resecretion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再分泌","english_definition":"The process of secreting again something that has already been secreted.","examples":[{"sentence":"Resecretion of hormones can occur under certain physiological conditions.","translation":"ホルモンの再分泌は、特定の生理的条件下で起こりうる。"},{"sentence":"The resecretion of the drug prolonged its effects.","translation":"その薬物の再分泌は、その効果を長引かせた。"}],"collocations":["hormone resecretion","drug resecretion"],"synonyms":["re-release","re-expulsion"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 're-' (again) and the noun 'secretion' (the process by which substances are produced and discharged from a cell, gland, or organ).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːsɪˈkriːʃən/","syllables":"re-se-cre-tion"},"inflection":{"noun_plural":"resecretions"},"usage_notes":{"explanation":"'Resecretion' is a term used primarily in biological and medical contexts to describe the process where a substance that has already been secreted (released) by a cell or gland is then secreted again. This can occur through various mechanisms and may have specific physiological or pharmacological implications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell resecreted the substance back into itself.","correct":"✓ The cell resecreted the substance into the surrounding environment.","note":"Resecretion typically implies releasing something again into the external environment, not back into the cell itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["resecrete (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resecretion' is a technical term primarily used in scientific or medical contexts. Understanding this word requires familiarity with basic biological processes, particularly the concept of secretion. It refers to the repeated release of a substance that has already been secreted once. Therefore, it is more likely to be encountered in advanced scientific literature or discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The kidney is involved in the resecretion of certain filtered substances back into the bloodstream.","translation":"腎臓は、濾過された特定の物質を血流中に再分泌する働きに関与している。","type":"general","meaning_category":"physiology"},{"sentence":"Resecretion of neurotransmitters can affect the duration of synaptic signaling.","translation":"神経伝達物質の再分泌は、シナプスシグナリングの持続時間に影響を与える可能性がある。","type":"general","meaning_category":"neuroscience"}]}