{"word":"judiciality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"公正さ、公平さ、裁判官としての適性","english_definition":"the quality of being judicial; impartiality; fairness; the qualities appropriate to a judge.","examples":[{"sentence":"The judiciality of the judge was never questioned.","translation":"その裁判官の公正さが疑われることは決してなかった。"},{"sentence":"Judiciality is essential for maintaining public trust in the legal system.","translation":"公正さは、法制度に対する国民の信頼を維持するために不可欠である。"}],"collocations":["exercise judiciality","demonstrate judiciality","lack judiciality"],"synonyms":["impartiality","fairness","objectivity","equity","justice","uprightness"],"antonyms":["partiality","bias","prejudice","unfairness","injustice"]}],"etymology":{"value":"\"Judicial\" + \"-ity\". From Latin \"judicialis\" (pertaining to a judge or court of law) + \"-ity\" (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒuːˌdɪʃiˈæləti/","syllables":"ju-di-ci-al-i-ty"},"inflection":{"noun_plural":"judicialities (rarely used)"},"usage_notes":{"explanation":"\"Judiciality\" refers to the qualities expected of a judge or someone in a similar position of authority, particularly fairness and impartiality. It is a relatively formal word and is not commonly used in everyday conversation. It is often used in legal or political contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The judiciality of the decision was questioned because it seemed too fast.","correct":"✓ The fairness/justification of the decision was questioned because it seemed too fast.","note":"While \"judiciality\" refers to the quality of being judicial, in this context, it's more appropriate to question the \"fairness\" or \"justification\" of the decision itself, rather than the inherent judiciality of it."}],"priority":"★☆☆"},"related_words":{"derivatives":["judicial (adjective)","judicious (adjective)","judge (noun/verb)","judgement (noun)"],"related_concepts":["jurisprudence","due process","rule of law","legal ethics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and formal vocabulary)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Judiciality\" is a formal term referring to the qualities of a judge, such as fairness and impartiality. It's not a common word in everyday conversation, but you might encounter it in legal or political contexts when discussing the behavior and characteristics expected of those in positions of legal authority. It emphasizes the importance of unbiased decision-making within the legal system."},"example_sentences":[{"sentence":"The committee sought members with proven judiciality and a commitment to fairness.","translation":"委員会は、証明された公正さと公平性へのコミットメントを持つメンバーを探した。","type":"general","meaning_category":"fairness"},{"sentence":"The judge's judiciality was tested during the controversial trial.","translation":"その裁判官の公正さは、物議を醸した裁判中に試された。","type":"legal","meaning_category":"impartiality"}]}