{"word":"nympholepsy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ニンフォレプシー：強い美的または精神的な憧れ、特に達成不可能なものに対する憧れ。また、若い女性に対する激しい欲望または妄想。","english_definition":"A strong aesthetic or spiritual yearning, especially for the unattainable. Also, an excessive or delusional sexual desire for a young woman.","examples":[{"sentence":"His poetry was often characterized by nympholepsy, a longing for an idealized, unattainable beauty.","translation":"彼の詩はしばしばニンフォレプシー、つまり理想化された、手の届かない美しさへの憧れによって特徴づけられた。"},{"sentence":"The old man's nympholepsy led him to make inappropriate advances toward the young women in his neighborhood.","translation":"その老人のニンフォレプシーは、彼を近所の若い女性たちに不適切な誘いをかけるように仕向けた。"}],"collocations":["artistic nympholepsy","spiritual nympholepsy","sexual nympholepsy"],"synonyms":["longing","yearning","craving","obsession","infatuation"],"antonyms":["apathy","indifference","disgust"]}],"etymology":{"value":"ギリシャ語の「νύμφη (nymphē)」（ニンフ、若い女性）と「λῆψις (lēpsis)」（発作、捕獲）に由来する。元々はニンフに取り憑かれた状態、つまりニンフに対する狂信的な憧れを意味していた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɪmfoʊˈlɛpsi/","syllables":"nym-pho-lep-sy"},"inflection":{"noun_plural":"nympholepsies"},"usage_notes":{"explanation":"「**nympholepsy**」は、主に文学や心理学の文脈で使用される、やや専門的な単語です。達成不可能な理想の美に対する憧れ、または若い女性に対する過度な性的欲望という、二つの関連する意味を持ちます。前者（美的・精神的な憧れ）は、ロマン主義文学や象徴主義文学において、理想化された女性像への憧憬として表現されることがあります。後者（性的欲望）は、精神医学的な意味合いを持ち、妄想的な症状として扱われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from nympholepsy, so he was very shy.","correct":"✓ He suffered from nympholepsy, so he was obsessed with a young actress.","note":"ニンフォレプシーは、内気さとは関係ありません。特定の対象（若い女性、理想化された美）への過度な執着を意味します。"},{"incorrect":"✗ Nympholepsy is a common disease.","correct":"✓ Nympholepsy is a rare psychological condition.","note":"ニンフォレプシーは一般的な病気ではありません。稀な心理状態を指します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["nympholeptic (形容詞: ニンフォレプシーの、ニンフォレプシーにかかった；名詞: ニンフォレプシーの人)"],"related_concepts":["ephebophilia (若い青年に対する性的嗜好)","objectophilia (物に対する性的嗜好)","pygmalionism (自分が創造した理想の人物に恋すること)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**nympholepsy**」は、文学や心理学の分野で使われる専門用語で、日常会話ではほとんど使われません。理想化された美、特に手の届かない若い女性に対する強い憧れや執着を意味します。この言葉は、ギリシャ神話のニンフ（妖精）に由来し、元々はニンフに取り憑かれた状態を指していました。文学作品では、主人公が理想の女性像を追い求める姿を描写する際に用いられることがあります。心理学の文脈では、異常な性的嗜好や妄想の一種として扱われることがあります。"},"example_sentences":[{"sentence":"The artist's nympholepsy was evident in his numerous paintings of ethereal young women.","translation":"その芸術家のニンフォレプシーは、彼の数多くの幽玄な若い女性の絵画に明らかだった。","type":"general","meaning_category":"美的憧憬"},{"sentence":"The psychiatrist diagnosed the patient with nympholepsy after he confessed to having obsessive thoughts about a teenage girl.","translation":"精神科医は、患者が10代の少女について強迫的な思考を持っていることを告白した後、彼をニンフォレプシーと診断した。","type":"general","meaning_category":"性的欲望"}]}