{"word":"polygraphy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ポリグラフ検査、嘘発見器検査","english_definition":"The use of a polygraph (lie detector) to record physiological variables such as blood pressure, heart rate, respiration, and skin conductivity while a person is asked a series of questions, in an attempt to detect deception.","examples":[{"sentence":"The suspect agreed to undergo polygraphy to prove his innocence.","translation":"容疑者は潔白を証明するためにポリグラフ検査を受けることに同意した。"},{"sentence":"The results of the polygraphy were inconclusive.","translation":"ポリグラフ検査の結果は決定的ではなかった。"}],"collocations":["polygraphy test","undergo polygraphy","polygraphy results"],"synonyms":["lie detection","lie detector test"],"antonyms":[]},{"part_of_speech":"noun","definition":"印刷術、印刷業","english_definition":"The art or process of printing.","examples":[{"sentence":"He studied polygraphy at the vocational school.","translation":"彼は職業訓練校で印刷術を学んだ。"},{"sentence":"Modern polygraphy uses advanced digital techniques.","translation":"現代の印刷術は高度なデジタル技術を使用している。"}],"collocations":["modern polygraphy","digital polygraphy"],"synonyms":["printing","printing technology","graphic arts"],"antonyms":[]}],"etymology":{"value":"From Greek *poly-* (many) + *-graphy* (writing, recording).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɪɡrəfi/","syllables":"po-ly-gra-phy"},"inflection":{"noun_plural":"polygraphies"},"usage_notes":{"explanation":"The term \"polygraphy\" has two main meanings:\n\n1.  **Lie Detection:** This is the more common meaning, referring to the use of a polygraph machine to detect lies. In this context, it is often used in criminal investigations or security screenings.\n2.  **Printing:** This meaning refers to the art or process of printing, especially in a technical or historical context. This usage is less common in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He took a polygraphy for the job application.","correct":"✓ He took a polygraph test for the job application.","note":"While \"polygraphy\" is the general term, \"polygraph test\" is more commonly used when referring to the specific test.  Using 'polygraphy' is not incorrect, but less common."}],"priority":"★★☆"},"related_words":{"derivatives":["polygraph (noun: 嘘発見器)","polygraphic (adjective: ポリグラフの、印刷の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"polygraphy\" is a technical term. It is most often used in the context of lie detection, referring to the use of a polygraph machine to record physiological responses. It can also refer to the art or process of printing, but this usage is less common. Understanding the context is important to determine the intended meaning."},"example_sentences":[{"sentence":"The FBI agent administered the polygraphy to the witness.","translation":"FBI捜査官は証人にポリグラフ検査を実施した。","type":"noun","meaning_category":"嘘発見器検査"},{"sentence":"The history of polygraphy is closely linked to the development of printing presses.","translation":"印刷術の歴史は印刷機の発展と密接に関連している。","type":"noun","meaning_category":"印刷術"}]}