{"word":"rollingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"回転しながら、転がりながら、滑らかに動いて","english_definition":"In a rolling manner; with a rolling motion; smoothly and continuously.","examples":[{"sentence":"The river flowed rollingly through the valley.","translation":"川は谷を滑らかに流れ下った。"},{"sentence":"The fog moved rollingly across the hills.","translation":"霧が丘を越えて、転がるように移動した。"},{"sentence":"The tumbleweeds drifted rollingly across the desert.","translation":"タンブルウィードは砂漠を転がりながら漂った。"}],"collocations":[],"synonyms":["smoothly","continuously","flowingly","glidingly","undulatingly"],"antonyms":["jerky","staccato","haltingly"]}],"etymology":{"value":"The word 'rollingly' is formed by adding the suffix '-ly' to the word 'rolling'. 'Rolling' is the present participle of the verb 'roll', which comes from Middle English 'rollen', from Old French 'roller', from Latin 'rotulare' (to turn like a wheel), from 'rotula' (small wheel), diminutive of 'rota' (wheel).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈroʊlɪŋli/","syllables":"ro-lling-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Rollingly' describes movement that is smooth, continuous, and often circular or undulating. It is not a commonly used word, and its use often adds a poetic or descriptive quality to the writing. It is most often used to describe the movement of natural phenomena like rivers, fog, or tumbleweeds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ball bounced rollingly down the stairs.","correct":"✓ The ball rolled down the stairs.","note":"'Rollingly' implies a smooth, continuous motion, whereas bouncing is a jerky, discontinuous motion. 'Rolled' is more appropriate here."},{"incorrect":"✗ She spoke rollingly.","correct":"✓ She spoke fluently.","note":"'Rollingly' describes physical motion, not speech. 'Fluently' would be a better choice to describe someone speaking smoothly."}],"priority":"★★☆"},"related_words":{"derivatives":["roll (verb, noun)","rolling (adjective, gerund)","roller (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (The word is not common enough to be included in CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rollingly' is an uncommon adverb that describes a smooth, continuous, and often circular or undulating movement. It is used to add a descriptive or poetic quality to writing, often in the context of natural phenomena. Because of its relative infrequency and somewhat specialized meaning, it is more likely to be encountered and understood by advanced English language learners."},"example_sentences":[{"sentence":"The clouds moved rollingly across the sky, creating beautiful patterns.","translation":"雲が空を回転するように動き、美しい模様を作り出した。","type":"adverb","meaning_category":"回転しながら"},{"sentence":"The landscape was characterized by rollingly hills and green valleys.","translation":"その風景は、なだらかに起伏する丘と緑の谷が特徴だった。","type":"adverb","meaning_category":"滑らかに動いて"},{"sentence":"The smoke billowed rollingly from the chimney.","translation":"煙が煙突から渦を巻くように立ち上った。","type":"adverb","meaning_category":"滑らかに動いて"}]}