{"word":"book-learned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"本から得た知識に頼る、実体験に乏しい、学問偏重の","english_definition":"having knowledge that has been obtained from books rather than from practical experience.","examples":[{"sentence":"He was a book-learned scholar, but lacked common sense.","translation":"彼は学問偏重の学者で、常識に欠けていた。"},{"sentence":"She criticized the politician as being too book-learned and out of touch with ordinary people.","translation":"彼女は、その政治家が学問偏重で、一般の人々と隔絶していると批判した。"},{"sentence":"The professor was book-learned, but he struggled to apply his knowledge to real-world problems.","translation":"その教授は博識だったが、知識を現実の問題に応用するのに苦労した。"}],"collocations":["book-learned scholar","book-learned professor","book-learned intellectual","book-learned expert","book-learned knowledge"],"synonyms":["pedantic","scholastic","academic","erudite","lettered"],"antonyms":["experienced","practical","pragmatic","hands-on","streetwise"],"notes":"Often used in a slightly negative way, suggesting that someone's knowledge is theoretical rather than useful."}],"etymology":{"value":"'book' + 'learned'. Formed by combining the noun 'book' with the past participle of the verb 'learn'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbʊkˌlɜːrnd/","syllables":"book-learn-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Book-learned' is used to describe someone whose knowledge comes primarily from books and academic study, rather than from practical experience or real-world application. It often carries a slightly negative connotation, implying that the person's knowledge may be impractical or disconnected from reality. The term is often used to contrast theoretical knowledge with practical skills or common sense.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very learned person, he is book-learned.","correct":"✓ He is a very learned person, but he is also book-learned.","note":"The first sentence implies that being learned is the same as being book-learned. It is better to show contrast."},{"incorrect":"✗ She is book-learned about cooking.","correct":"✓ She has book-learned knowledge about cooking.","note":"The word should be used to describe a person, not a topic."}],"priority":"★★☆"},"related_words":{"derivatives":["bookish","learned","scholar","pedant"],"related_terms":["ivory tower","armchair expert"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'book-learned' is a relatively uncommon term used to describe someone whose knowledge is primarily derived from books and academic study, often implying a lack of practical experience or common sense. It is more frequently encountered in formal writing or discussions about the nature of knowledge and expertise."},"example_sentences":[{"sentence":"The book-learned professor struggled to fix the leaky faucet.","translation":"その学問偏重の教授は、水漏れする蛇口を修理するのに苦労した。","type":"adjective","meaning_category":"学問偏重の"},{"sentence":"While he was book-learned in history, he had never traveled outside his home country.","translation":"彼は歴史については博識だったが、自分の国から外に出たことがなかった。","type":"adjective","meaning_category":"実体験に乏しい"},{"sentence":"The company needed someone with practical experience, not just a book-learned theorist.","translation":"会社が必要としていたのは、実務経験のある人材であり、単なる学問偏重の理論家ではなかった。","type":"adjective","meaning_category":"学問偏重の"}]}