{"word":"unannexable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"併合できない、編入できない","english_definition":"Not capable of being annexed; not able to be incorporated into another territory or domain.","examples":[{"sentence":"The remote island was considered unannexable due to its harsh environment and lack of resources.","translation":"その孤立した島は、厳しい環境と資源の欠如のため、併合不可能と見なされた。"},{"sentence":"Due to international treaties, the territory was deemed unannexable.","translation":"国際条約により、その地域は併合不可能と判断された。"}],"collocations":["unannexable territory","unannexable land","unannexable region"],"synonyms":["ineligible for annexation","non-annexable"],"antonyms":["annexable","incorporable"]}],"etymology":{"value":"\"un-\" (not) + \"annexable\" (capable of being annexed). \"Annexable\" comes from \"annex,\" which originates from Latin \"annexus,\" the past participle of \"annectere\" (to bind to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈnɛksəbəl/","syllables":"un-an-nex-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"The word \"unannexable\" is relatively rare and is primarily used in legal, political, and geographical contexts to describe territories or regions that cannot be annexed or incorporated into another entity, often due to legal, environmental, or political reasons. It implies a condition or characteristic that prevents annexation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was unannexable because it was too small.","correct":"✓ The country was unannexable because it was protected by international law.","note":"Size is not the primary reason for something being unannexable. More common reasons include international laws, treaties, or agreements that prevent annexation."}],"priority":"★★☆"},"related_words":{"derivatives":["annex (verb, noun)","annexation (noun)","annexable (adjective)"],"antonyms":["annexable"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unannexable' is a specialized term used in political science, international law, and geography. It describes something that cannot be annexed, meaning it cannot be added or incorporated into another territory or entity. Understanding this word requires familiarity with the concept of annexation and its associated legal and political implications."},"example_sentences":[{"sentence":"The United Nations declared the occupied territory unannexable under international law.","translation":"国連は、占領された地域を国際法の下で併合不可能であると宣言した。","type":"general","meaning_category":"legal/political"},{"sentence":"Due to its unique cultural heritage, the region was considered unannexable without causing significant international backlash.","translation":"その地域は独特の文化遺産のため、重大な国際的反発を引き起こすことなく併合することは不可能であると考えられた。","type":"general","meaning_category":"political/cultural"}]}