{"word":"Adiaphorist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)アディアフォラ主義者：宗教的論争において、信仰に不可欠ではないとされる事柄（アディアフォラ）について、特定の立場を主張しない人。","english_definition":"(historical) A person who believes in or advocates adiaphorism; one who holds that certain things are indifferent and not essential to faith.","examples":[{"sentence":"The Adiaphorists argued that certain ceremonies were not essential to salvation.","translation":"アディアフォラ主義者たちは、特定の儀式は救済に不可欠ではないと主張した。"}],"collocations":["adiaphoristic controversy","Philippist adiaphorism"],"synonyms":[],"antonyms":[],"notes":"Often used in the context of 16th-century religious controversies within Lutheranism."},{"part_of_speech":"adjective","definition":"アディアフォラ主義の、アディアフォラ主義者の","english_definition":"Relating to or characteristic of adiaphorism or Adiaphorists.","examples":[{"sentence":"The adiaphorist view was that these practices were matters of indifference.","translation":"アディアフォラ主義的な見解では、これらの慣習はどちらでも良い事柄であった。"}],"collocations":["adiaphorist theology","adiaphorist position"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'adiaphora' (things indifferent) + '-ist' (one who believes in or practices). 'Adiaphora' is from Greek 'ἀδιάφορα' (adiaphora), neuter plural of 'ἀδιάφορος' (adiaphoros) meaning 'indifferent, not differing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪdaɪəˈfɔːrɪst/","syllables":"A-di-a-pho-rist"},"inflection":{"noun_plural":"Adiaphorists"},"usage_notes":{"explanation":"The term 'Adiaphorist' and 'adiaphorism' are primarily used in historical contexts, especially when discussing the religious controversies of the 16th century. It refers to the belief that certain religious practices or doctrines are neither commanded nor forbidden in the Bible and are therefore matters of indifference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an adiaphorist in politics, not caring about any issues.","correct":"✓ He was indifferent to politics, not caring about any issues.","note":"'Adiaphorist' specifically relates to religious indifference, not general apathy."}],"priority":"★☆☆"},"related_words":{"derivatives":["adiaphorism (the belief in adiaphora)","adiaphora (things indifferent)"],"related_terms":["Philippists (a group of Adiaphorists)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Very low frequency - Primarily used in academic or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Adiaphorist' is a specialized term primarily encountered in the study of Reformation history and theology. It refers to individuals or groups who held that certain religious practices or beliefs were 'adiaphora,' that is, neither commanded nor forbidden by God and therefore matters of indifference or free choice. Understanding this term requires familiarity with the historical and theological context of the 16th century. The concept is nuanced and involves understanding the debates surrounding religious practices and doctrines during that period."},"example_sentences":[{"sentence":"The debate between the Gnesio-Lutherans and the Adiaphorists centered on whether to concede certain practices to the Catholics.","translation":"グネシオ・ルター派とアディアフォラ主義者の間の論争は、特定の慣習をカトリック教徒に譲歩すべきかどうかを中心に展開された。","type":"noun","meaning_category":"historical religious figure"},{"sentence":"The adiaphorist position allowed for flexibility in dealing with non-essential religious practices.","translation":"アディアフォラ主義の立場は、重要でない宗教的慣習に対処する際の柔軟性を可能にした。","type":"adjective","meaning_category":"relating to adiaphorism"}]}