{"word":"spiritualization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"精神化、霊化、精神主義化","english_definition":"The process of making something spiritual; the act of interpreting something in a spiritual sense.","examples":[{"sentence":"The spiritualization of nature was a key theme in Romantic poetry.","translation":"自然の精神化は、ロマン派詩の重要なテーマでした。"},{"sentence":"Some religious traditions emphasize the spiritualization of everyday life.","translation":"いくつかの宗教的伝統は、日常生活の精神化を強調しています。"},{"sentence":"The spiritualization of art can lead to profound aesthetic experiences.","translation":"芸術の精神化は、深遠な美的体験につながる可能性があります。"}],"collocations":["spiritualization of nature","spiritualization of art","spiritualization of everyday life"],"synonyms":["etherealization","sublimation","idealization"],"antonyms":["materialization","secularization"]},{"part_of_speech":"noun","definition":"(心理学) 昇華 (欲求不満などを社会的に許容される形に転換すること)","english_definition":"(Psychology) A defense mechanism in which unacceptable impulses or idealizations are transformed into socially acceptable behaviors or beliefs.","examples":[{"sentence":"Artistic creation can be seen as a form of spiritualization of aggressive impulses.","translation":"芸術的創造は、攻撃的な衝動の精神化の一形態と見なすことができます。"},{"sentence":"Spiritualization, in this context, is a way to cope with inner conflict.","translation":"この文脈における精神化は、内なる葛藤に対処する方法です。"}],"collocations":["spiritualization of impulses","defense mechanism"],"synonyms":["sublimation"],"antonyms":[]}],"etymology":{"value":"From 'spiritualize' + '-ation'. 'Spiritualize' is from 'spiritual' + '-ize'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌspɪrɪtʃuəlɪˈzeɪʃən/","syllables":"spi-ri-tu-al-i-za-tion"},"inflection":{"noun_plural":"spiritualizations"},"usage_notes":{"explanation":"'Spiritualization' refers to the process of making something more spiritual or interpreting it in a spiritual way. In psychology, it is a defense mechanism similar to sublimation, where unacceptable impulses are channeled into more acceptable behaviors or beliefs. The term is often used in discussions of art, religion, and psychology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spiritualization of the building was completed.","correct":"✓ The consecration of the building was completed.","note":"'Spiritualization' refers to a process of making something spiritual, not a physical transformation. 'Consecration' is more appropriate for dedicating a building for religious use."}],"priority":"★★☆"},"related_words":{"derivatives":["spiritualize","spiritual","spirituality"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Spiritualization' is a complex term that refers to the process of making something spiritual or interpreting it in a spiritual way. It can also refer to a psychological defense mechanism where unacceptable impulses are transformed into socially acceptable behaviors. This term is most often used in academic or philosophical contexts when discussing abstract concepts related to spirituality, art, or psychology. Understanding the context is crucial to interpreting the meaning accurately."},"example_sentences":[{"sentence":"The spiritualization of love in literature often involves transcending physical desire.","translation":"文学における愛の精神化は、しばしば肉体的な欲望を超越することを含みます。","type":"noun","meaning_category":"Making something spiritual"},{"sentence":"Through spiritualization, the individual finds meaning and purpose in suffering.","translation":"精神化を通して、個人は苦しみの中に意味と目的を見出します。","type":"noun","meaning_category":"Psychological defense mechanism"}]}