{"word":"veredicto","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"評決、判決","english_definition":"A formal decision or finding made by a jury regarding the questions or facts submitted to them during a trial. More generally, it can refer to any judgment or opinion reached after careful consideration.","examples":[{"sentence":"El jurado emitió un veredicto de culpable.","translation":"陪審員は有罪の評決を下した。"},{"sentence":"Esperamos el veredicto del juez.","translation":"私たちは裁判官の判決を待っています。"},{"sentence":"La crítica dio su veredicto sobre la película.","translation":"批評家はその映画についての評決を下した。"}],"collocations":["emitir un veredicto (評決を出す)","veredicto de culpabilidad (有罪判決)","veredicto de inocencia (無罪判決)","esperar el veredicto (判決を待つ)"],"synonyms":["fallo","sentencia","dictamen","juicio","opinión"],"antonyms":[]}],"etymology":{"value":"Del latín 'veredictum', compuesto de 'vere' (verdaderamente) y 'dictum' (dicho), significando literalmente 'dicho verdadero' o 'declaración de la verdad'.","priority":"★★☆"},"pronunciation":{"ipa":"/beɾeˈðikto/","syllables":"ve-re-dic-to"},"inflection":{"noun_forms":{"singular":"veredicto","plural":"veredictos"}},"usage_notes":{"explanation":"'Veredicto' se usa principalmente en contextos legales para referirse a la decisión formal de un jurado. Sin embargo, también puede usarse de manera más general para describir una opinión o juicio definitivo sobre algo. Es importante notar que, aunque 'veredicto' y 'sentencia' a menudo se usan indistintamente, 'sentencia' se refiere más específicamente a la pena impuesta por un juez después de un veredicto de culpabilidad.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El veredicto fue muy rápido que no entendimos.","correct":"El veredicto fue tan rápido que no entendimos.","note":"'Muy' se usa para modificar adjetivos y adverbios, mientras que 'tan' se usa en comparaciones o para indicar intensidad seguida de 'que'. En este caso, se necesita 'tan' para expresar la rapidez del veredicto como causa de la falta de entendimiento."},{"incorrect":"El jurado dio un veredicto en el caso.","correct":"El jurado emitió un veredicto en el caso.","note":"Aunque 'dar' puede usarse, 'emitir' es un verbo más formal y preciso para indicar que el jurado ha anunciado oficialmente su decisión."}],"priority":"★★☆"},"related_words":{"derivatives":["veredictal (relativo al veredicto)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderadamente frecuente.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Veredicto' es una palabra que se usa en contextos legales y formales. Se refiere a la decisión final de un jurado o, de manera más general, a un juicio u opinión definitiva sobre algo. Su uso requiere un entendimiento del contexto legal o formal en el que se aplica.","priority":"★☆☆"},"example_sentences":[{"sentence":"El veredicto del juicio fue transmitido en vivo por televisión.","translation":"The verdict of the trial was broadcast live on television.","type":"noun","meaning_category":"評決"},{"sentence":"Los abogados esperaban ansiosamente el veredicto final.","translation":"The lawyers anxiously awaited the final verdict.","type":"noun","meaning_category":"判決"},{"sentence":"La crítica de arte dio su veredicto sobre la exposición.","translation":"The art critic gave their verdict on the exhibition.","type":"noun","meaning_category":"評決 (opinión)"}]}