{"word":"steel-bow","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of crossbow made with a steel bow.","english_definition":"A crossbow that utilizes a bow made of steel, providing increased power and durability compared to those made of wood or composite materials.","examples":[{"sentence":"The museum displayed a collection of historical weapons, including a steel-bow from the 16th century.","translation":"博物館には、16世紀の鋼鉄製のクロスボウを含む歴史的な武器のコレクションが展示されていた。"},{"sentence":"Steel-bows were favored by professional soldiers due to their superior range and penetrating power.","translation":"鋼鉄製のクロスボウは、その優れた射程と貫通力から、プロの兵士に好まれた。"}],"collocations":["steel-bow crossbow","historical steel-bow","powerful steel-bow"],"synonyms":["crossbow","arbalest"],"antonyms":[]}],"etymology":{"value":"The term 'steel-bow' is a compound word derived from 'steel,' referring to the material of the bow, and 'bow,' the curved part of the weapon that propels the projectile.","priority":"N/A"},"pronunciation":{"ipa":"/ˈstiːlˌboʊ/","syllables":"steel-bow"},"inflection":{"noun_plural":"steel-bows"},"usage_notes":{"explanation":"The term 'steel-bow' specifically refers to a crossbow constructed with a bow made of steel. This distinguishes it from crossbows made of other materials like wood or composite materials. Steel provides greater strength and allows for a higher draw weight, resulting in increased power and range.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a steelbow for hunting.","correct":"✓ He used a steel-bow for hunting.","note":"The correct spelling includes a hyphen between 'steel' and 'bow'."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'steel-bow' is a specialized term related to historical weaponry. It refers to a crossbow that utilizes a bow made of steel. Understanding this term requires familiarity with historical arms and armor. Due to its specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The knight carried a steel-bow alongside his sword.","translation":"騎士は剣と一緒に鋼鉄製のクロスボウを携行していた。","type":"noun","meaning_category":"weapon"},{"sentence":"The steel-bow was more accurate than the wooden crossbow.","translation":"鋼鉄製のクロスボウは、木製のクロスボウよりも正確だった。","type":"noun","meaning_category":"weapon"}]}