{"word":"non-delegatable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"委任できない、移譲できない","english_definition":"Not able to be delegated or transferred to another person or entity.","examples":[{"sentence":"This responsibility is non-delegatable; it must be handled by the CEO personally.","translation":"この責任は委任できません。CEO自身が対応する必要があります。"},{"sentence":"Due to the sensitive nature of the information, the task was deemed non-delegatable.","translation":"情報の機密性の高さから、そのタスクは委任できないと判断されました。"}],"collocations":["non-delegatable duty","non-delegatable responsibility","non-delegatable task"],"synonyms":["non-transferable","non-assignable","inalienable"],"antonyms":["delegatable","transferable","assignable"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'delegatable,' which itself is derived from 'delegate' (to entrust a task or responsibility to another person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈdɛlɪɡeɪtəbəl/","syllables":"non-del-e-ga-ta-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Non-delegatable' is used to describe tasks, responsibilities, or duties that cannot be passed on to someone else. This is often due to legal requirements, the sensitive nature of the task, or the specific skills or authority required to complete it. It implies that the original holder of the responsibility must personally handle it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The task is non-delegate.","correct":"✓ The task is non-delegatable.","note":"The correct adjective form is 'non-delegatable,' not 'non-delegate.'"},{"incorrect":"✗ He delegated the non-delegatable task.","correct":"✓ He should not have delegated the non-delegatable task.","note":"By definition, a non-delegatable task cannot be delegated. This is a logical contradiction."}],"priority":"★★☆"},"related_words":{"derivatives":["delegate (verb, noun)","delegation (noun)","delegatable (adjective)"],"phrasal_verbs":[],"related_concepts":["responsibility","accountability","authority","management","governance"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency. Primarily used in legal, business, and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-delegatable' is a formal term primarily used in legal, business, and management contexts. It signifies that a particular duty, task, or responsibility cannot be transferred or assigned to another person or entity. This is often because the duty requires specific expertise, authority, or involves a high level of trust and accountability that cannot be delegated. Understanding this term is crucial in environments where clear assignment and accountability are paramount."},"example_sentences":[{"sentence":"The board determined that the approval of the annual budget was a non-delegatable function.","translation":"取締役会は、年間予算の承認は委任できない機能であると判断しました。","type":"adjective","meaning_category":"委任できない"},{"sentence":"Ensuring data security is a non-delegatable responsibility for the IT department.","translation":"データセキュリティの確保は、IT部門にとって委任できない責任です。","type":"adjective","meaning_category":"委譲できない"},{"sentence":"The CEO emphasized that certain strategic decisions were non-delegatable and required his direct involvement.","translation":"CEOは、特定の戦略的決定は委任できず、彼が直接関与する必要があると強調しました。","type":"adjective","meaning_category":"移譲できない"}]}