{"word":"cartilaginean","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"軟骨魚類の、軟骨質の","english_definition":"relating to or composed of cartilage; belonging or pertaining to the class Chondrichthyes (cartilaginous fishes).","examples":[{"sentence":"Cartilaginean fishes include sharks, rays, and skates.","translation":"軟骨魚類には、サメ、エイ、ガンギエイが含まれます。"},{"sentence":"The skeleton of a cartilaginean fish is made of cartilage, not bone.","translation":"軟骨魚類の骨格は、骨ではなく軟骨でできています。"}],"collocations":["cartilaginean fish","cartilaginean skeleton"],"synonyms":["chondral","cartilaginous"],"antonyms":["osseous","bony"]},{"part_of_speech":"noun","definition":"軟骨魚類","english_definition":"a fish of the class Chondrichthyes, having a skeleton composed mainly of cartilage.","examples":[{"sentence":"The cartilagineans are an ancient group of fishes.","translation":"軟骨魚類は古代の魚のグループです。"},{"sentence":"Cartilagineans lack swim bladders, which bony fish use for buoyancy.","translation":"軟骨魚類は、硬骨魚類が浮力のために使う浮き袋を持っていません。"}],"collocations":["a group of cartilagineans"],"synonyms":["chondrichthyan"],"antonyms":["bony fish"]}],"etymology":{"value":"From Latin cartilagineus, from cartilago (cartilage) + -eus (adjective suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrtɪˈlædʒɪniən/","syllables":"car-ti-lag-i-ne-an"},"inflection":{"noun_plural":"cartilagineans"},"usage_notes":{"explanation":"The term \"cartilaginean\" is primarily used in a biological or zoological context to describe organisms, specifically fish, whose skeletons are predominantly made of cartilage rather than bone. It can be used as both an adjective and a noun. As an adjective, it describes something related to or made of cartilage. As a noun, it refers to a member of the class Chondrichthyes (cartilaginous fishes).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ cartilaginous fish","correct":"✓ cartilaginean fish","note":"While \"cartilaginous fish\" is commonly used and understood, \"cartilaginean fish\" is the more precise and formal term when referring to the class Chondrichthyes."}],"priority":"★☆☆"},"related_words":{"derivatives":["cartilage","cartilaginous","Chondrichthyes"],"phrases":["cartilaginous fishes"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"cartilaginean\" is a technical term primarily used in the context of zoology and biology, specifically when discussing fish whose skeletons are made of cartilage rather than bone. It is less common in everyday language and more frequently encountered in scientific or educational materials related to marine biology or comparative anatomy. Understanding the term requires familiarity with basic biological concepts and vocabulary."},"example_sentences":[{"sentence":"The great white shark is a well-known example of a **cartilaginean** fish.","translation":"ホオジロザメは、よく知られた軟骨魚類の例です。","type":"adjective","meaning_category":"軟骨魚類の"},{"sentence":"**Cartilagineans** have evolved unique strategies for buoyancy control.","translation":"軟骨魚類は、浮力制御のための独自の戦略を進化させてきました。","type":"noun","meaning_category":"軟骨魚類"}]}