{"word":"Blachong","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of fermented shrimp paste condiment popular in Southeast Asian cuisine, particularly in Malaysia, Singapore, and Indonesia. It is typically made from ground shrimp or krill that is salted, fermented, and then either sun-dried or roasted.","english_definition":"A condiment made from fermented shrimp paste, commonly used in Southeast Asian cuisine.","examples":[{"sentence":"Blachong is often used as an ingredient in sambal or as a dipping sauce.","translation":"ブラチョンは、サンバルやつけダレの材料としてよく使用されます。"},{"sentence":"The distinctive smell of blachong can be quite strong.","translation":"ブラチョンの独特の匂いはかなり強いことがあります。"},{"sentence":"Some people find the taste of blachong to be an acquired taste.","translation":"ブラチョンの味は、慣れると美味しく感じる人もいます。"}],"collocations":["make blachong","eat blachong","smell of blachong","taste of blachong","blachong sambal"],"synonyms":["belacan","trassi","kapi","mắm tôm"],"antonyms":[]}],"etymology":{"value":"The etymology is uncertain, but it is believed to originate from Southeast Asia. The name varies across different regions and languages within Southeast Asia.","priority":"★☆☆"},"pronunciation":{"ipa":"/bləˈtʃɒŋ/","syllables":"bla-chong"},"inflection":{"noun_plural":"blachongs"},"usage_notes":{"explanation":"Blachong is a pungent and flavorful ingredient used in many Southeast Asian dishes. It is often used sparingly due to its strong taste and smell. It is an essential ingredient in many types of sambal, a chili-based condiment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I don't like the smell of blachong, it's too sweet.","correct":"✓ I don't like the smell of blachong, it's too pungent.","note":"Blachong has a pungent, strong, and savory smell, not a sweet smell."},{"incorrect":"✗ Blachong is a type of cheese.","correct":"✓ Blachong is a type of fermented shrimp paste.","note":"Blachong is made from fermented shrimp, not cheese."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["sambal belacan","nasi lemak","gado-gado"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Blachong is a specialized culinary term referring to a fermented shrimp paste used as a condiment in Southeast Asian cuisine. Understanding this term requires familiarity with Southeast Asian culinary traditions. It is typically encountered in discussions or recipes related to Malaysian, Singaporean, or Indonesian food. The word itself is not commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"She added a small amount of blachong to the curry for extra flavor.","translation":"彼女は風味を増すために、カレーに少量のブラチョンを加えました。","type":"noun","meaning_category":"condiment"},{"sentence":"The aroma of blachong filled the kitchen as she cooked.","translation":"彼女が料理をすると、ブラチョンの香りが台所に広がりました。","type":"noun","meaning_category":"condiment"},{"sentence":"Blachong is a key ingredient in many Malaysian dishes.","translation":"ブラチョンは多くのマレーシア料理の重要な材料です。","type":"noun","meaning_category":"condiment"}]}