{"word":"olfactometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"嗅覚測定法、嗅覚検査法","english_definition":"The process of objectively measuring the sense of smell.","examples":[{"sentence":"Olfactometry is used to assess a patient's ability to detect and identify odors.","translation":"嗅覚測定法は、患者の臭いを検出し識別する能力を評価するために使用されます。"},{"sentence":"The results of olfactometry can help diagnose olfactory dysfunction.","translation":"嗅覚測定法の結果は、嗅覚機能障害の診断に役立ちます。"}],"collocations":["dynamic olfactometry","static olfactometry","odor threshold measurement"],"synonyms":["smell testing","odor measurement"],"antonyms":[]}],"etymology":{"value":"The word \"olfactometry\" is derived from the Latin word \"olfactus\" (smell) and the Greek word \"metron\" (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒlfækˈtɒmətri/","syllables":"ol-fac-tom-e-try"},"inflection":{"noun_plural":"olfactometries"},"usage_notes":{"explanation":"Olfactometry is a quantitative method used to assess the sense of smell. It involves presenting controlled concentrations of odorants to a subject and measuring their ability to detect, recognize, or discriminate between odors. The technique is used in various fields, including medicine, environmental science, and food science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Olfactometry are used for measuring smells.","correct":"✓ Olfactometry is used for measuring smells.","note":"Olfactometry is a singular noun, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["olfactometer (noun): an instrument used in olfactometry to measure the sense of smell","olfactory (adjective): relating to the sense of smell","anosmia (noun): the loss of the sense of smell","hyposmia (noun): decreased ability to smell"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Olfactometry\" is a specialized term referring to the scientific measurement of the sense of smell. It's primarily used in medical, scientific, and technical contexts when discussing the assessment and diagnosis of olfactory function. Understanding the term requires familiarity with scientific vocabulary and concepts related to sensory perception and measurement techniques."},"example_sentences":[{"sentence":"Dynamic olfactometry is a common method for measuring odor concentrations in environmental samples.","translation":"動的嗅覚測定法は、環境サンプル中の臭気濃度を測定するための一般的な方法です。","type":"general","meaning_category":"measurement of odor concentrations"},{"sentence":"The patient underwent olfactometry to determine the extent of their olfactory dysfunction.","translation":"患者は嗅覚機能障害の程度を判断するために嗅覚測定法を受けた。","type":"medical","meaning_category":"diagnosis of olfactory dysfunction"}]}