{"word":"multifamily","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"複数の家族が居住する、集合住宅の","english_definition":"Designed for or including more than one family; relating to a building or complex containing separate housing units for multiple families.","examples":[{"sentence":"The developer specializes in multifamily housing projects.","translation":"その開発業者は集合住宅プロジェクトを専門としている。"},{"sentence":"Multifamily dwellings are becoming increasingly common in urban areas.","translation":"都市部では集合住宅がますます一般的になっている。"},{"sentence":"They invested in a multifamily property with several rental units.","translation":"彼らは複数の賃貸ユニットを持つ集合住宅に投資した。"}],"collocations":["multifamily housing","multifamily dwelling","multifamily property","multifamily complex","multifamily development"],"synonyms":["apartment","condominium","townhouse","duplex","plex"],"antonyms":["single-family"],"related_terms":["multi-unit","multi-dwelling"],"notes":"Often used in real estate and urban planning contexts."}],"etymology":{"value":"'Multi-' (many) + 'family' (a group of people related by blood or marriage).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmʌltiˈfæməli/","syllables":"mul-ti-fam-i-ly"},"inflection":{"notes":"This word is an adjective and does not inflect (no plural form)."},"usage_notes":{"explanation":"'Multifamily' refers to housing designed to accommodate more than one family. It is commonly used to describe apartment buildings, condominiums, and other types of multi-unit residential properties. The term is frequently used in the context of real estate, construction, and urban planning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ a multi family house","correct":"✓ a multifamily house","note":"The two words should be combined into one: multifamily."},{"incorrect":"✗ multifamily's houses","correct":"✓ multifamily houses","note":"'Multifamily' is an adjective describing the houses, not a possessive."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["single-family","townhouse","condominium","apartment complex","duplex","plex"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively less frequent, but common in specific contexts (real estate, urban planning).","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'multifamily' is used to describe buildings that have housing for more than one family. It is most often used when talking about real estate or city planning. If you see this word, think of apartment buildings or condos where many families live in separate units within the same building or complex."},"example_sentences":[{"sentence":"The city needs more affordable multifamily housing options.","translation":"市は、より手頃な価格の集合住宅の選択肢を必要としている。","type":"general","meaning_category":"Housing"},{"sentence":"The real estate company specializes in managing multifamily properties.","translation":"その不動産会社は、集合住宅の管理を専門としている。","type":"real estate","meaning_category":"Real Estate"},{"sentence":"The new multifamily development will add 200 units to the local housing market.","translation":"新しい集合住宅開発により、地域の住宅市場に200戸が追加される。","type":"development","meaning_category":"Development"}]}