{"word":"photobromide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ブロマイド写真","english_definition":"A bromide print photograph, especially of a celebrity.","examples":[{"sentence":"She collected photobromides of her favorite actors.","translation":"彼女はお気に入りの俳優のブロマイド写真を集めていた。"}],"collocations":["collect photobromides","celebrity photobromide"],"synonyms":["bromide print","photo","picture"],"antonyms":[]}],"etymology":{"value":"Combination of 'photo' (photograph) and 'bromide' (referring to the bromide printing process used in photography).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊtoʊˌbroʊmaɪd/","syllables":"pho-to-bro-mide"},"inflection":{"noun_plural":"photobromides"},"usage_notes":{"explanation":"'Photobromide' specifically refers to a type of photographic print, often associated with images of celebrities or popular figures. It emphasizes the printing process using bromide paper. The term is somewhat dated but still used in certain contexts, especially when discussing vintage or collectible photographs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a photobromide with my phone.","correct":"✓ I took a photo with my phone.","note":"'Photobromide' refers to a physical print, not a digital photograph taken with a phone."}],"priority":"★☆☆"},"related_words":{"derivatives":["photo","bromide","photograph","print"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Photobromide' is a specialized term referring to a specific type of photographic print made using the bromide process. It is most commonly used in the context of collecting or discussing vintage photographs, particularly those of celebrities. The term is not in common usage, and understanding it requires familiarity with historical photographic processes."},"example_sentences":[{"sentence":"The antique shop had a collection of vintage photobromides.","translation":"そのアンティークショップには、ヴィンテージのブロマイド写真のコレクションがあった。","type":"noun","meaning_category":"ブロマイド写真"},{"sentence":"She carefully preserved the photobromide of the famous actress.","translation":"彼女は有名な女優のブロマイド写真を丁寧に保存した。","type":"noun","meaning_category":"ブロマイド写真"}]}