{"word":"progoneate","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主に動物学で)生殖孔が体の前部にある","english_definition":"(chiefly zoology) Having the genital pore situated anteriorly on the body.","examples":[{"sentence":"Progoneate worms have their reproductive organs located near the head.","translation":"前生殖孔類の蠕虫は、生殖器官が頭部の近くに位置している。"}],"collocations":[],"synonyms":["anteriorly-pored","cephaloporous"],"antonyms":["opisthogoneate"]}],"etymology":{"value":"From the prefix 'pro-' (forward, in front) + 'gone' (referring to reproductive organs, from Greek 'gonos' meaning offspring, seed) + '-ate' (suffix indicating having or possessing).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈɡoʊniˌeɪt/","syllables":"pro-go-ne-ate"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative degrees (more progoneate, most progoneate)."},"usage_notes":{"explanation":"The term 'progoneate' is primarily used in zoology to classify animals based on the position of their genital pore. It is most commonly used when discussing flatworms (Platyhelminthes) and other invertebrate groups. The opposite of progoneate is 'opisthogoneate', which describes animals with a posteriorly located genital pore.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["progony (noun: the condition of being progoneate)"],"phrasal_verbs":[],"related_terms":["opisthogoneate (adjective: having the genital pore located posteriorly)","gonopore (noun: genital pore)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a technical term used primarily in zoology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Progoneate' is a highly specialized term used in zoology. Understanding it requires familiarity with anatomical terminology and the classification of animal reproductive systems. It is unlikely to be encountered outside of scientific contexts.","requires_background_knowledge":"Requires knowledge of zoology, animal anatomy, and reproductive systems."},"example_sentences":[{"sentence":"The turbellarian worm is classified as progoneate due to the anterior position of its gonopore.","translation":"その渦虫は、生殖孔が前方に位置するため、前生殖孔類に分類される。","type":"adjective","meaning_category":"Anatomical Classification"}]}