{"word":"unappeasably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"なだめられないほどに、満たしがたいほどに、飽くことなく","english_definition":"in a manner that cannot be appeased or satisfied; insatiably.","examples":[{"sentence":"The child cried unappeasably, despite all attempts to comfort him.","translation":"その子供は、慰めようとするあらゆる試みにもかかわらず、なだめられないほどに泣いた。"},{"sentence":"The tyrant's hunger for power grew unappeasably with each victory.","translation":"その暴君の権力欲は、勝利を重ねるごとに満たしがたいほどに増大した。"},{"sentence":"The crowd demanded justice unappeasably, refusing to accept any compromise.","translation":"群衆は、いかなる妥協も拒否し、飽くことなく正義を要求した。"}],"collocations":["cry unappeasably","demand unappeasably","grow unappeasably"],"synonyms":["insatiably","implacably","inexorably","relentlessly","unyieldingly"],"antonyms":["appeasably","placably","satisfiably"]}],"etymology":{"value":"\"Un-\" (not) + \"appeasably\" (in an appeasable manner). \"Appeasably\" comes from \"appease,\" meaning to pacify or satisfy, especially by acceding to demands.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈpiːzəbli/","syllables":"un-ap-peas-a-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Unappeasably\" describes actions or states that cannot be calmed, satisfied, or pacified. It emphasizes the intensity and persistence of a desire, demand, or emotion that resists any attempt to alleviate it. The term often implies a sense of frustration or futility in trying to meet the unappeasable need.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unappeasably happy.","correct":"✓ He was unreservedly happy.","note":"\"Unappeasably\" is generally used with negative emotions or desires that cannot be satisfied, not with positive emotions like happiness. Use \"unreservedly\" or \"completely\" instead."},{"incorrect":"✗ The unappeasably child.","correct":"✓ The unappeasable child.","note":"\"Unappeasably\" is an adverb and modifies verbs, adjectives, or other adverbs. The adjective form is \"unappeasable.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unappeasable (adjective)","appease (verb)","appeasement (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unappeasably\" is a formal and relatively rare adverb. It describes something that cannot be satisfied or calmed. You would typically encounter it in literature or formal writing when describing intense, persistent, and unyielding desires or emotions. Understanding the root word \"appease\" is helpful for grasping its meaning."},"example_sentences":[{"sentence":"The crowd roared unappeasably for an encore.","translation":"群衆はアンコールを飽くことなく叫んだ。","type":"adverb","meaning_category":"なだめられないほどに"},{"sentence":"His grief manifested unappeasably after the loss.","translation":"彼の悲しみは、その喪失後、満たしがたいほどに現れた。","type":"adverb","meaning_category":"満たしがたいほどに"},{"sentence":"The company's greed grew unappeasably, leading to unethical practices.","translation":"その会社の貪欲さは飽くことなく増大し、非倫理的な慣行につながった。","type":"adverb","meaning_category":"飽くことなく"}]}