{"word":"fructuary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"用益権者、果実収取権者","english_definition":"A person who has the right to enjoy the fruits or profits of something belonging to another, without impairing the substance.","examples":[{"sentence":"The widow was the fructuary of her late husband's estate.","translation":"その未亡人は亡き夫の財産の用益権者であった。"},{"sentence":"Under Roman law, the fructuary had a duty to maintain the property.","translation":"ローマ法の下では、用益権者は財産を維持する義務があった。"}],"collocations":["fructuary rights","fructuary interest","become a fructuary"],"synonyms":["usufructuary","life tenant","beneficiary"],"antonyms":["owner","proprietor"]},{"part_of_speech":"adjective","definition":"用益権の、果実収取権の","english_definition":"Of or pertaining to the right of enjoying the fruits or profits of something belonging to another.","examples":[{"sentence":"The fructuary agreement outlined the responsibilities of both parties.","translation":"用益権契約は両当事者の責任を概説した。"},{"sentence":"Fructuary laws protect the rights of the owner while allowing another to benefit.","translation":"用益権法は、他者が利益を得ることを許可しながら、所有者の権利を保護する。"}],"collocations":["fructuary agreement","fructuary law","fructuary estate"],"synonyms":["usufructuary","beneficial"],"antonyms":["proprietary"]}],"etymology":{"value":"From Latin 'fructuarius', from 'fructus' (fruit, enjoyment, profit), from 'frui' (to enjoy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrʌktʃuˌɛri/","syllables":"fruct-u-ar-y"},"inflection":{"noun_plural":"fructuaries","adjective_forms":{}},"usage_notes":{"explanation":"'Fructuary' is a relatively rare term, primarily used in legal contexts to describe someone who has the right to enjoy the benefits (fruits or profits) of property that belongs to another person, without diminishing the value of the property itself. It can also be used as an adjective to describe things related to this right.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a fructuary of the company.","correct":"✓ He was a beneficiary of the company's profits.","note":"'Fructuary' is typically used in the context of property or estates, not companies. Using 'beneficiary' is more appropriate in the latter case."}],"priority":"★☆☆"},"related_words":{"derivatives":["fruit","frugal","fruition"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'fructuary' is a specialized legal term referring to someone who has the right to enjoy the fruits or profits of something belonging to another, without damaging the property itself. It is not commonly used outside of legal or historical contexts. Understanding the word requires familiarity with legal concepts such as usufruct and property rights."},"example_sentences":[{"sentence":"As the fructuary, she was entitled to the income from the rental property.","translation":"用益権者として、彼女はその賃貸物件からの収入を得る権利があった。","type":"noun","meaning_category":"用益権者"},{"sentence":"The fructuary clause in the will ensured his access to the estate's earnings.","translation":"遺言の用益権条項は、彼が遺産の収益にアクセスできることを保証した。","type":"adjective","meaning_category":"用益権の"}]}