{"word":"calm-gazed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"穏やかな眼差しの、落ち着いた視線の","english_definition":"Having a calm and peaceful gaze or expression in the eyes.","examples":[{"sentence":"The monk had a calm-gazed expression that radiated serenity.","translation":"その僧侶は穏やかな眼差しで、静けさを放っていた。"},{"sentence":"Despite the chaos around her, she remained calm-gazed and focused.","translation":"周りが混乱しているにもかかわらず、彼女は落ち着いた視線を保ち、集中していた。"}],"collocations":["calm-gazed expression","calm-gazed and serene","calm-gazed and focused"],"synonyms":["peaceful-eyed","serene-eyed","tranquil-gazed","placid-gazed"],"antonyms":["anxious-gazed","worried-gazed","agitated-gazed","frenzied-gazed"]}],"etymology":{"value":"A compound adjective formed from 'calm' (meaning peaceful, tranquil) and 'gazed' (meaning having a particular way of looking).","priority":"★☆☆"},"pronunciation":{"ipa":"/kɑːm ɡeɪzd/","syllables":"calm-gazed (1 syllable, though pronounced as two)"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"'Calm-gazed' is a descriptive adjective, often used to depict a person's inner peace or composure, reflected in their eyes. It suggests a state of tranquility and lack of agitation. It is not a commonly used word, lending a somewhat poetic or literary quality to the description.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was calm-gazed at the situation.","correct":"✓ He was calm-gazed. / ✓ He had a calm-gazed expression.","note":"'Calm-gazed' describes a quality of the eyes or expression, not an action. Therefore, it's used to describe the person or their expression, not something they are doing 'at' a situation."}],"priority":"★☆☆"},"related_words":{"derivatives":["calmly (adverb)","calmness (noun)","gaze (verb, noun)"],"phrases":["calm demeanor","peaceful countenance"]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR materials)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Calm-gazed' is a relatively uncommon adjective used to describe someone who has a peaceful and composed look in their eyes. It is often used in literary or descriptive contexts to convey a sense of serenity or inner peace. Because it is not a common word, it may be more readily understood by advanced English speakers or those familiar with literary language."},"example_sentences":[{"sentence":"The guru's calm-gazed eyes seemed to penetrate the depths of her soul.","translation":"導師の穏やかな眼差しは、彼女の魂の奥底まで見抜いているようだった。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Even in the face of danger, the soldier remained calm-gazed, a testament to his training.","translation":"危険に直面しても、その兵士は落ち着いた視線を保ち、彼の訓練の証となっていた。","type":"adjective","meaning_category":"descriptive"}]}