{"word":"granitoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"花崗岩状の、花崗岩に似た","english_definition":"Resembling granite; having a granular, crystalline texture similar to that of granite.","examples":[{"sentence":"The mountain range is composed of granitoid rocks.","translation":"その山脈は花崗岩状の岩石で構成されている。"},{"sentence":"The countertop has a granitoid appearance.","translation":"そのカウンタートップは花崗岩のような外観をしている。"}],"collocations":["granitoid rock","granitoid texture","granitoid appearance"],"synonyms":["granitic","crystalline","granular"],"antonyms":[]},{"part_of_speech":"noun","definition":"花崗岩質の岩石","english_definition":"A coarse-grained, intrusive igneous rock similar to granite, but potentially with a wider range of mineral compositions.","examples":[{"sentence":"The geologist studied the granitoid samples collected from the site.","translation":"地質学者はその場所から収集された花崗岩質の岩石サンプルを調査した。"},{"sentence":"Granitoids are common in continental crust.","translation":"花崗岩質の岩石は大陸地殻によく見られる。"}],"collocations":["granitoid intrusion","granitoid pluton","granitoid composition"],"synonyms":["granite","diorite","tonalite","quartz diorite"],"antonyms":[]}],"etymology":{"value":"Derived from 'granite' (花崗岩) + '-oid' (～に似た、～状の).","priority":"★★★"},"pronunciation":{"ipa":"ˈɡrænɪtɔɪd","syllables":"gran-i-toid"},"inflection":{"noun_plural":"granitoids"},"usage_notes":{"explanation":"'Granitoid' is a broader term than 'granite'. It refers to a family of coarse-grained, intrusive igneous rocks that are similar to granite in appearance but may have different mineral compositions. While granite is a specific type of granitoid, the term 'granitoid' can encompass rocks like diorite, tonalite, and quartz diorite. It is often used when the precise classification of the rock is not yet determined or when referring to the group of rocks collectively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was made of granite, a type of granitoid.","correct":"✓ The building was made of granite. Granite is a type of granitoid.","note":"Granite is a specific type of granitoid, so the first sentence is redundant. The second sentence clarifies the relationship."}],"priority":"★★☆"},"related_words":{"derivatives":["granite","-oid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in geological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Granitoid' is a technical term used in geology to describe a group of coarse-grained, intrusive igneous rocks that resemble granite. It is a broader term than 'granite' itself, encompassing rocks with similar textures but potentially different mineral compositions. Understanding this term requires a background in geology or earth science. It is not commonly used in everyday language.","priority":"★★★"},"example_sentences":[{"sentence":"The Sierra Nevada batholith is largely composed of various granitoid rocks.","translation":"シエラネバダ山脈の岩株は、主に様々な花崗岩質の岩石で構成されている。","type":"noun","meaning_category":"岩石"},{"sentence":"The granitoid texture of the stone made it suitable for carving.","translation":"その石の花崗岩質の組織は、彫刻に適していた。","type":"adjective","meaning_category":"花崗岩状の"}]}