{"word":"Dasahara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ダシャハラ祭 (インドのヒンドゥー教の祭りで、女神ドゥルガーがマヒシャスラという悪魔を倒したことを祝う)","english_definition":"A major Hindu festival celebrated at the end of Navaratri every year. It marks the victory of Goddess Durga over the demon Mahishasura. It also commemorates Lord Rama's victory over Ravana.","examples":[{"sentence":"Dasahara is celebrated with great enthusiasm in India.","translation":"ダシャハラ祭はインドで非常に熱狂的に祝われます。"},{"sentence":"Effigies of Ravana are burned on Dasahara.","translation":"ダシャハラ祭では、ラーヴァナの像が燃やされます。"}],"collocations":["celebrate Dasahara","Dasahara festival","Dasahara procession"],"synonyms":["Vijayadashami","Dussehra"],"antonyms":[]}],"etymology":{"value":"Dasahara derives from the Sanskrit words 'dasha' meaning ten and 'hara' meaning defeat. It signifies the defeat of the ten-headed demon Ravana by Lord Rama.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʌsɑːˈhɑːrɑː/","syllables":"Da-sa-ha-ra"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"Dasahara, also known as Vijayadashami or Dussehra, is a significant Hindu festival symbolizing the victory of good over evil. It is celebrated on the tenth day of the Shukla Paksha in the month of Ashwin, according to the Hindu lunar calendar. The festival often includes processions, cultural performances, and the burning of effigies of Ravana, his son Meghnad, and brother Kumbhakarna.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dasahara is a Christian festival.","correct":"✓ Dasahara is a Hindu festival.","note":"Dasahara is a Hindu festival, not a Christian one."},{"incorrect":"✗ Dasahara celebrates the birth of Rama.","correct":"✓ Dasahara celebrates the victory of Rama over Ravana.","note":"Dasahara primarily celebrates the victory of Rama over Ravana and the triumph of good over evil."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Dasahara is a Hindu festival that celebrates the victory of good over evil. It's a time when people come together to remember the story of Lord Rama's triumph over Ravana. The festival is marked by burning effigies and participating in cultural events. Understanding this festival requires some knowledge of Hindu mythology and Indian culture."},"example_sentences":[{"sentence":"The city was decorated for the upcoming Dasahara celebrations.","translation":"街は近づくダシャハラ祭の祝いで飾られていました。","type":"noun","meaning_category":"festival"},{"sentence":"Families gathered to watch the burning of Ravana's effigy on Dasahara.","translation":"家族はダシャハラ祭でラーヴァナの像が燃やされるのを見るために集まりました。","type":"noun","meaning_category":"festival"}]}