{"word":"Contemporizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"現代化すること、現代風にすること、同時代化すること","english_definition":"The act of making something more modern or suitable for current times; bringing something into line with current tastes or trends.","examples":[{"sentence":"Contemporizing the curriculum is essential to keep students engaged.","translation":"カリキュラムを現代化することは、生徒たちの関心を維持するために不可欠です。"},{"sentence":"The museum is contemporizing its exhibits to attract a younger audience.","translation":"博物館は、若い観客を引きつけるために展示を現代風にしています。"},{"sentence":"He is contemporizing his business strategies to stay competitive.","translation":"彼は競争力を維持するために、ビジネス戦略を同時代化しています。"}],"collocations":["contemporizing art","contemporizing education","contemporizing design","contemporizing a brand","contemporizing a website"],"synonyms":["modernizing","updating","revamping","revising","adapting","refashioning"],"antonyms":["antiquating","archaizing","obsoleting"]}],"etymology":{"value":"Derived from 'contemporize,' which comes from 'contemporary' (existing or occurring at the same time) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈtɛmpəˌraɪzɪŋ/","syllables":"con-tem-po-riz-ing"},"inflection":{"verb_forms":{"present_simple":["contemporize","contemporizes"],"past_simple":"contemporized","past_participle":"contemporized","present_participle":"contemporizing"}},"usage_notes":{"explanation":"'Contemporizing' refers to the ongoing process of making something relevant to the present day. It often involves adapting or updating existing forms to appeal to current audiences or meet current needs. This term is frequently used in discussions about art, education, business, and technology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contemporizing was done quick.","correct":"✓ The contemporizing was done quickly.","note":"'Contemporizing' is a gerund or present participle acting as a noun in this context, so it's modified by an adverb ('quickly'), not an adjective ('quick')."},{"incorrect":"✗ He is contemporizing of the old building.","correct":"✓ He is contemporizing the old building.","note":"'Contemporize' is a transitive verb, so it takes a direct object without the preposition 'of'."}],"priority":"★★☆"},"related_words":{"derivatives":["contemporize (verb)","contemporary (adjective, noun)","contemporization (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contemporizing' is a less common term that implies a deliberate effort to make something more modern or relevant. It's often used in professional or academic contexts when discussing the adaptation of older systems or ideas to fit current trends or needs. The word suggests a proactive approach to updating and modernizing. Understanding the base word 'contemporary' is essential for grasping the meaning of 'contemporizing.'"},"example_sentences":[{"sentence":"The architect is contemporizing the design of the building while respecting its historical roots.","translation":"建築家は、建物の歴史的ルーツを尊重しながら、そのデザインを現代風にしています。","type":"verb (present participle)","meaning_category":"現代化する"},{"sentence":"Contemporizing the curriculum involves incorporating new technologies and teaching methods.","translation":"カリキュラムを現代化するには、新しいテクノロジーと教育方法を取り入れることが含まれます。","type":"verb (gerund)","meaning_category":"現代化すること"},{"sentence":"The company is focused on contemporizing its brand image to appeal to younger consumers.","translation":"同社は、若い消費者にアピールするために、ブランドイメージを現代風にすることに重点を置いています。","type":"verb (gerund)","meaning_category":"現代風にすること"}]}