{"word":"proteic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"変化しやすい、多様な、多形的な","english_definition":"readily assuming different shapes or forms; variable; versatile.","examples":[{"sentence":"His proteic talent allowed him to excel in various artistic disciplines.","translation":"彼の変化に富む才能は、彼が様々な芸術分野で秀でることを可能にした。"},{"sentence":"The company's proteic strategy enabled it to adapt quickly to changing market conditions.","translation":"その会社の多様な戦略は、市場の変化に迅速に適応することを可能にした。"}],"collocations":["proteic talent","proteic strategy","proteic nature","proteic skills"],"synonyms":["variable","versatile","mutable","changeable","adaptable","polymorphic"],"antonyms":["static","unchanging","uniform","immutable"]},{"part_of_speech":"adjective","definition":"タンパク質の、タンパク質性の","english_definition":"of or pertaining to protein.","examples":[{"sentence":"The proteic content of the food was analyzed in the laboratory.","translation":"その食品のタンパク質含有量は、研究所で分析された。"},{"sentence":"A proteic diet is essential for muscle growth.","translation":"タンパク質性の食事は筋肉の成長に不可欠である。"}],"collocations":["proteic content","proteic diet","proteic structure","proteic synthesis"],"synonyms":["proteinaceous","protein-based","protein-rich"],"antonyms":["carbohydrate-based","lipid-based"]}],"etymology":{"value":"Derived from the Greek word 'Proteus,' a sea god known for his ability to change shape at will. The suffix '-ic' indicates 'pertaining to' or 'having the nature of.'","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈtiːɪk/","syllables":"pro-te-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms (which are less common for 'proteic')."},"usage_notes":{"explanation":"The word 'proteic' has two main meanings. The first, and perhaps more common, refers to something that is highly variable or adaptable, like the mythical god Proteus. The second, more technical, meaning relates to protein. Context is crucial to understanding which meaning is intended. The 'variable' sense is often used metaphorically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proteic of the situation made it difficult to predict.","correct":"✓ The protean nature of the situation made it difficult to predict.","note":"While 'proteic' and 'protean' are related, 'protean' is more commonly used to describe something that readily changes shape or form. 'Proteic' is more often used in a technical, protein-related context."}],"priority":"★★☆"},"related_words":{"derivatives":["protean (adjective: tending or able to change frequently or easily)","protein (noun: any of a class of nitrogenous organic compounds that consist of large molecules composed of one or more long chains of amino acids and are an essential part of all living organisms, especially as structural components of body tissues such as muscle, hair, collagen, etc., and as enzymes and antibodies.)","protease (noun: an enzyme that breaks down proteins and peptides.)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare, technical or literary usage)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proteic' is a relatively uncommon word with two distinct meanings. One refers to the characteristic of being changeable or versatile, drawing from the mythological figure Proteus. The other relates to proteins. Due to its rarity and potential for ambiguity, it's important to use the word precisely and ensure the context clarifies the intended meaning. 'Protean' is a more common synonym for the 'changeable' sense."},"example_sentences":[{"sentence":"The artist's **proteic** style evolved dramatically over the years.","translation":"その芸術家の変化に富むスタイルは、長年にわたって劇的に進化した。","type":"adjective","meaning_category":"variable"},{"sentence":"A **proteic** supplement can help athletes recover after intense workouts.","translation":"タンパク質性のサプリメントは、アスリートが激しいトレーニングの後に回復するのを助けることができる。","type":"adjective","meaning_category":"protein"}]}