{"word":"hoaxers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"いたずらをする人たち、デマを流す人たち、人を騙す人たち","english_definition":"People who perpetrate hoaxes; those who deceive or trick others, often for amusement or gain.","examples":[{"sentence":"The internet is full of hoaxers spreading false information.","translation":"インターネットは、誤った情報を広めるいたずらをする人たちでいっぱいです。"},{"sentence":"The police are trying to identify the hoaxers who made the fake bomb threat.","translation":"警察は、偽の爆弾の脅迫をしたデマを流した人たちを特定しようとしています。"},{"sentence":"A group of college students became known as notorious hoaxers after successfully fooling the media.","translation":"ある大学生のグループは、メディアをうまく騙したことで、悪名高い人を騙す人たちとして知られるようになりました。"}],"collocations":["internet hoaxers (インターネットのデマを流す人たち)","media hoaxers (メディアを騙す人たち)","political hoaxers (政治的なデマを流す人たち)","online hoaxers (オンラインのデマを流す人たち)"],"synonyms":["deceivers","tricksters","imposters","frauds","cheaters","pranksters"],"antonyms":["truthful","honest","genuine","sincere"]}],"etymology":{"value":"The word \"hoaxer\" is derived from the noun \"hoax,\" which originated in the mid-19th century. The etymology of \"hoax\" itself is uncertain, but it may be a variant of \"hocus,\" as in \"hocus pocus,\" suggesting a conjuring trick or deception. The suffix \"-er\" is added to \"hoax\" to denote a person who performs or is associated with hoaxes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊksərz/","syllables":"hoax-ers"},"inflection":{"noun_plural":"hoaxers"},"usage_notes":{"explanation":"\"Hoaxers\" refers specifically to individuals who create and spread hoaxes. A hoax is a deliberate deception designed to trick the public or a specific group of people. The term often implies a level of planning and execution, distinguishing it from simple mistakes or misunderstandings. Hoaxers may be motivated by a desire for attention, financial gain, or simply the amusement of fooling others. The term carries a negative connotation, implying dishonesty and a disregard for the truth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hoaxers was arrested.","correct":"✓ The hoaxers were arrested.","note":"\"Hoaxers\" is a plural noun, so it requires a plural verb form (\"were\" instead of \"was\")."},{"incorrect":"✗ He is a hoaxers.","correct":"✓ He is a hoaxer.","note":"When referring to a single person, use the singular form \"hoaxer.\" The plural form \"hoaxers\" refers to multiple people."},{"incorrect":"✗ They played a hoaxers on the town.","correct":"✓ They played a hoax on the town.","note":"\"Hoaxers\" refers to the people who perpetrate the hoax, not the hoax itself. The correct term for the deceptive act is \"hoax.\""}],"priority":"★★☆"},"related_words":{"derivatives":["hoax (noun: a trick or deception)","hoax (verb: to deceive or trick)","hoaxing (noun: the act of deceiving or tricking)"],"related_terms":["prankster (someone who plays practical jokes)","scammer (someone who commits fraud)","con artist (someone who swindles people)","imposter (someone who pretends to be someone else)","fraudster (someone who engages in fraud)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hoaxers\" is a relatively uncommon term that refers to people who create and spread hoaxes. A hoax is a deliberate deception or trick, often intended to fool a large number of people. Understanding this word requires a good grasp of vocabulary related to deception and fraud. The term is more likely to be encountered in news articles, academic discussions, or legal contexts dealing with issues of misinformation, fraud, or public deception.","priority":"★☆☆"},"example_sentences":[{"sentence":"The online forum was quickly shut down after it was discovered that a group of hoaxers were spreading misinformation about the election.","translation":"そのオンラインフォーラムは、選挙に関する誤った情報を広めている人を騙す人たちのグループがいることが判明した後、すぐに閉鎖されました。","type":"noun","meaning_category":"deceivers"},{"sentence":"Investigative journalists worked to expose the hoaxers behind the elaborate scheme to defraud investors.","translation":"調査ジャーナリストは、投資家を騙すための手の込んだ計画の背後にいるデマを流す人たちを暴くために働きました。","type":"noun","meaning_category":"tricksters"},{"sentence":"The museum staff were embarrassed to discover that a renowned art collector was actually a team of skilled hoaxers.","translation":"美術館のスタッフは、有名な美術コレクターが実際には熟練した人を騙す人たちのチームだったことを発見して恥ずかしく思いました。","type":"noun","meaning_category":"imposters"}]}