{"word":"Etherialize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(文学、芸術)を非物質的なものにする、精神化する、理想化する","english_definition":"To make ethereal; to treat as something light, airy, or delicate; to refine into a more spiritual or idealized form.","examples":[{"sentence":"The artist etherialized the landscape in his painting, creating a dreamlike quality.","translation":"その画家は絵の中で風景を精神化し、夢のような質を作り出した。"},{"sentence":"She etherialized her memories of childhood, focusing only on the positive aspects.","translation":"彼女は子供時代の記憶を理想化し、肯定的な側面にのみ焦点を当てた。"},{"sentence":"The composer etherialized the folk melody into a delicate and haunting piece.","translation":"作曲家は民謡を精神化し、繊細で忘れがたい作品にした。"}],"collocations":["etherialize a memory (記憶を精神化する)","etherialize a landscape (風景を精神化する)","etherialize a person (人を理想化する)"],"synonyms":["spiritualize","idealize","sublimate","rarefy","transcend"],"antonyms":["materialize","solidify","concretize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(化学)エーテル化する","english_definition":"To convert into an ether; to combine with ether.","examples":[{"sentence":"The alcohol etherialized upon the addition of the catalyst.","translation":"アルコールは触媒を加えるとエーテル化した。"}],"collocations":["etherialize alcohol (アルコールをエーテル化する)"],"synonyms":["convert to ether"],"antonyms":[]}],"etymology":{"value":"From 'ether' (a rarefied substance formerly believed to fill the upper regions of space) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈθɪəriəlaɪz/","syllables":"e-the-re-al-ize"},"inflection":{"verb_forms":{"present_simple":["etherialize","etherializes"],"past_simple":"etherialized","past_participle":"etherialized","present_participle":"etherializing"}},"usage_notes":{"explanation":"'Etherialize' is a relatively uncommon word, primarily used in literary or artistic contexts to describe the process of making something more ethereal, spiritual, or idealized. It can also have a technical meaning in chemistry, referring to the conversion of a substance into an ether. The context usually makes the intended meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist tried to etherialize the water.","correct":"✓ The scientist tried to purify the water.","note":"'Etherialize' is not a general synonym for 'purify'. It specifically refers to making something ethereal or converting it into an ether."},{"incorrect":"✗ The ghost was etherialized by the light.","correct":"✓ The ghost was illuminated by the light.","note":"'Etherialize' is an active verb, implying a deliberate action to make something ethereal, not a passive state of being affected by light."}],"priority":"★★☆"},"related_words":{"derivatives":["etherialization (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Etherialize' is a sophisticated word primarily encountered in literary or artistic discussions. It signifies the transformation of something into a more refined, spiritual, or idealized form, often removing its material qualities. A secondary, technical meaning exists in chemistry, referring to the conversion of a substance into an ether. Due to its specialized usage, it is not commonly found in everyday language."},"example_sentences":[{"sentence":"The poet etherialized the pain of loss into a beautiful elegy.","translation":"詩人は喪失の痛みを精神化し、美しい挽歌に変えた。","type":"verb","meaning_category":"文学、芸術"},{"sentence":"The photographer etherialized the model's features with soft lighting and a blurred background.","translation":"写真家はソフトな照明とぼやけた背景でモデルの容姿を理想化した。","type":"verb","meaning_category":"文学、芸術"},{"sentence":"The chemist etherialized the solution to create a more volatile compound.","translation":"化学者は溶液をエーテル化し、より揮発性の高い化合物を作り出した。","type":"verb","meaning_category":"化学"}]}