{"word":"interferon","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インターフェロン（ウイルス感染に対する免疫反応に関わるタンパク質の一種）","english_definition":"A protein released by animal cells, usually in response to the entry of a virus, that has the property of inhibiting virus replication. It is used in the treatment of some viral infections and cancers.","examples":[{"sentence":"Interferon is used to treat hepatitis C.","translation":"インターフェロンはC型肝炎の治療に使われます。"},{"sentence":"The body produces interferon as a natural defense against viruses.","translation":"体はウイルスに対する自然な防御としてインターフェロンを生成します。"}],"collocations":["interferon therapy (インターフェロン療法)","interferon alpha (インターフェロンアルファ)","interferon beta (インターフェロンベータ)","recombinant interferon (遺伝子組み換えインターフェロン)"],"synonyms":["cytokine"],"antonyms":[]}],"etymology":{"value":"Derived from 'interfere' + '-on'. The term was coined to describe the substance's ability to interfere with viral replication.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈfɪərɒn/","syllables":"in-ter-fer-on"},"inflection":{"noun_plural":"interferons"},"usage_notes":{"explanation":"Interferons are a group of signaling proteins made and released by host cells in response to the presence of several viruses. In a typical scenario, a virus-infected cell will release interferons causing nearby cells to heighten their anti-viral defenses. Interferons also have immunomodulatory functions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ interferon are used to treat...","correct":"✓ interferon is used to treat...","note":"'Interferon' is usually treated as a non-count noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["interferonic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Interferon' is a technical term primarily used in the fields of medicine, biology, and immunology. Understanding its function requires a basic knowledge of cell biology and the immune system. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor prescribed interferon injections to boost her immune system.","translation":"医師は彼女の免疫システムを強化するためにインターフェロン注射を処方しました。","type":"general","meaning_category":"medical treatment"},{"sentence":"Research is ongoing to explore the potential of interferon in cancer therapy.","translation":"癌治療におけるインターフェロンの可能性を探る研究が進行中です。","type":"research","meaning_category":"medical research"}]}