{"word":"Loanings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 貸付金、貸付行為、貸与","english_definition":"(plural form) The act of lending something; something that is lent; loans.","examples":[{"sentence":"The bank's loanings increased significantly this quarter.","translation":"銀行の貸付金は今四半期に大幅に増加した。"},{"sentence":"The museum's loanings to other institutions are carefully documented.","translation":"博物館から他の機関への貸与は慎重に記録されている。"},{"sentence":"The library tracks its loanings to ensure books are returned on time.","translation":"図書館は貸出状況を追跡し、本が期限内に返却されるようにしている。"}],"collocations":["increase loanings (貸付を増やす)","track loanings (貸出を追跡する)","museum loanings (博物館の貸与品)","library loanings (図書館の貸出)"],"synonyms":["loans","lendings","credits","advances"],"antonyms":["borrowings","repayments"]}],"etymology":{"value":"Derived from the verb 'loan' (to lend) with the addition of the suffix '-ing' to form a noun, and then pluralized.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈloʊnɪŋz/","syllables":"Lo-an-ings"},"inflection":{"noun_plural":"Loanings"},"usage_notes":{"explanation":"'Loanings' is typically used in contexts where multiple instances of lending or the total amount of items or money lent are being discussed. It is less common than 'loans' but can be used to emphasize the activity or process of lending.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The loanings was approved.","correct":"✓ The loanings were approved.","note":"'Loanings' is a plural noun, so it requires a plural verb form ('were' instead of 'was')."},{"incorrect":"✗ He received a loanings from the bank.","correct":"✓ He received a loan from the bank.","note":"For a single instance of a loan, use 'loan' (singular). 'Loanings' refers to multiple loans or the general activity of lending."}],"priority":"★★☆"},"related_words":{"derivatives":["loan (noun, verb)","lending (noun, verb)","loaner (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Loanings' refers to multiple instances of lending or the total amount lent. It is used in formal contexts, such as finance or institutional lending. Understanding the plural form and its specific usage is important for advanced English comprehension."},"example_sentences":[{"sentence":"The company's financial report detailed its various loanings to small businesses.","translation":"会社の財務報告書には、中小企業へのさまざまな貸付の詳細が記載されていた。","type":"noun","meaning_category":"貸付金"},{"sentence":"The library's record of loanings showed a high demand for historical fiction.","translation":"図書館の貸出記録は、歴史小説の高い需要を示していた。","type":"noun","meaning_category":"貸出行為"},{"sentence":"The museum carefully manages its international loanings to ensure the safe return of artifacts.","translation":"博物館は、工芸品の安全な返却を保証するために、国際的な貸与を注意深く管理している。","type":"noun","meaning_category":"貸与"}]}