{"word":"unvisually","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"視覚的にではなく、視覚的でない方法で","english_definition":"In a way that is not visual; not using sight or appearance.","examples":[{"sentence":"The information was presented unvisually, relying on audio cues instead.","translation":"その情報は視覚的にではなく、代わりに音声による合図に頼って提示された。"},{"sentence":"The system operated unvisually, making it accessible to visually impaired users.","translation":"そのシステムは視覚的に操作されず、視覚障碍のあるユーザーがアクセスできるようになった。"}],"collocations":["presented unvisually","operated unvisually","designed unvisually"],"synonyms":["non-visually","inaesthetically","obscurely"],"antonyms":["visually","aesthetically","clearly"]},{"part_of_speech":"adverb","definition":"視覚的に魅力的でない方法で","english_definition":"In a manner that lacks visual appeal; without aesthetic quality.","examples":[{"sentence":"The website was designed unvisually, resulting in low user engagement.","translation":"そのウェブサイトは視覚的に魅力的でないように設計され、ユーザーエンゲージメントが低くなった。"},{"sentence":"The data was displayed unvisually, making it difficult to understand the trends.","translation":"そのデータは視覚的に魅力のない方法で表示され、傾向を理解することが困難になった。"}],"collocations":["designed unvisually","displayed unvisually","presented unvisually"],"synonyms":["unattractively","plainly","drably"],"antonyms":["attractively","beautifully","vividly"]}],"etymology":{"value":"\"un-\" (否定接頭辞) + \"visually\"","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈvɪʒuəli/","syllables":"un-vi-su-al-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Unvisually\" is used to describe something that is done or presented without relying on visual elements or in a way that lacks visual appeal. It is often used in the context of accessibility for visually impaired individuals or to critique the aesthetic quality of a design. The word is relatively uncommon, and its usage is often more descriptive or technical.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist created the painting unvisually.","correct":"✓ The artist created the painting non-visually.","note":"When referring to the process of creating something without sight, \"non-visually\" is more common and clearer than \"unvisually.\""},{"incorrect":"✗ The presentation was unvisually appealing.","correct":"✓ The presentation was visually unappealing.","note":"While \"unvisually\" can mean lacking visual appeal, \"visually unappealing\" is more common and direct."}],"priority":"★★★"},"related_words":{"derivatives":["visual","visually","nonvisual"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unvisually\" is a less common adverb that means \"not in a visual way\" or \"without visual appeal.\" It's used to describe methods or presentations that don't rely on sight or are aesthetically unpleasing. Because it's not a frequently used word, it's more appropriate for advanced English speakers and in contexts where precise language is needed to describe the absence of visual elements or aesthetic qualities."},"example_sentences":[{"sentence":"The museum exhibit was designed to be experienced unvisually, with tactile displays and audio descriptions.","translation":"その美術館の展示は、触覚的な展示と音声解説によって、視覚的に体験できないように設計された。","type":"adverb","meaning_category":"視覚的でない方法で"},{"sentence":"The report presented the data unvisually, using only text and tables.","translation":"その報告書は、テキストと表のみを使用して、データを視覚的に魅力のない方法で提示した。","type":"adverb","meaning_category":"視覚的に魅力的でない方法で"}]}