{"word":"pushballs","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Large, inflatable balls used in physical education or recreational activities, designed to be pushed or rolled rather than thrown or kicked.","english_definition":"Large inflatable balls designed for pushing and rolling, typically used in physical education or recreational activities.","examples":[{"sentence":"The children enjoyed pushing the pushballs around the gymnasium.","translation":"子供たちは体育館でプッシュボールを押し転がして楽しんだ。"},{"sentence":"Pushballs are a fun way to encourage teamwork and physical activity.","translation":"プッシュボールは、チームワークと身体活動を促進する楽しい方法です。"}],"collocations":["pushballs in gym class","playing with pushballs","large pushballs","inflatable pushballs"],"synonyms":["exercise balls","stability balls","gym balls"],"antonyms":[]}],"etymology":{"value":"Likely a compound word formed from 'push' (the action performed with the ball) and 'balls' (plural of 'ball'). The term likely originated within the physical education or recreational equipment industry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊʃˌbɔːlz/","syllables":"push-balls"},"inflection":{"noun_plural":"pushballs"},"usage_notes":{"explanation":"'Pushballs' are primarily used in group activities where the objective is to move the ball from one point to another by pushing it. They are often used in physical education classes to promote teamwork, coordination, and physical exertion in a fun and engaging way. Unlike smaller balls, pushballs are too large to be easily thrown or kicked, encouraging pushing and rolling movements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He kicked the pushball across the field.","correct":"✓ He pushed the pushball across the field.","note":"Pushballs are designed to be pushed, not kicked. Kicking them is not the intended use."},{"incorrect":"✗ The pushball was small enough to hold in one hand.","correct":"✓ The pushball was too large to hold in one hand.","note":"Pushballs are characteristically large."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_sports":["physical education","recreational games"],"related_equipment":["inflatable balls","exercise equipment"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Pushballs' are large, inflatable balls used for pushing and rolling, often in gym classes or for fun. They are too big to throw or kick easily. The word is straightforward, combining 'push' and 'balls' to describe their use.","priority":"★★☆"},"example_sentences":[{"sentence":"The instructor brought out the pushballs for a team-building exercise.","translation":"インストラクターはチームビルディングの練習のためにプッシュボールを持ってきた。","type":"example","meaning_category":"physical activity"},{"sentence":"We had to work together to move the pushballs to the other side of the court.","translation":"プッシュボールをコートの反対側に移動させるために協力する必要があった。","type":"example","meaning_category":"teamwork"},{"sentence":"The pushballs were brightly colored and made of durable material.","translation":"プッシュボールは鮮やかな色で、丈夫な素材でできていた。","type":"example","meaning_category":"description"}]}