{"word":"rush-fringed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"イグサの縁取りがされた、イグサのふちがある","english_definition":"Having a fringe or border of rushes (a type of tall, stiff plant that grows in wet soil).","examples":[{"sentence":"The pond was surrounded by a rush-fringed bank.","translation":"池はイグサの縁取りがされた土手に囲まれていた。"},{"sentence":"They sat by the rush-fringed stream, enjoying the peaceful scenery.","translation":"彼らはイグサのふちがある小川のそばに座り、穏やかな景色を楽しんだ。"}],"collocations":["rush-fringed pond","rush-fringed stream","rush-fringed meadow","rush-fringed bank"],"synonyms":["reed-bordered","grass-edged","sedge-lined"],"antonyms":[]}],"etymology":{"value":"The word is a compound adjective formed by combining 'rush' (referring to the plant) and 'fringed' (having a decorative border or edge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrʌʃ frɪndʒd/","syllables":"rush-fringed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but this is a past-participle adjective, so it describes something that has been 'fringed' with rushes."},"usage_notes":{"explanation":"This adjective is descriptive and evocative, often used in literary or poetic contexts to create a vivid image of a natural setting. It implies a border or edge that is not neatly defined but rather has the natural, somewhat wild appearance of rushes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rush fringed the lake.","correct":"✓ The lake was rush-fringed.","note":"'Rush-fringed' is an adjective, so it must modify a noun. It cannot be used as a verb."}],"priority":"☆☆☆"},"related_words":{"derivatives":["rush (noun)","fringe (noun/verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency - primarily found in descriptive literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Rush-fringed' is a descriptive adjective likely encountered in literature or nature writing. It combines the noun 'rush' (a type of plant) with the past participle 'fringed' to describe something that has a border or edge made of rushes. Understanding the individual components helps to decipher the meaning of the compound adjective. Its usage is relatively uncommon in everyday conversation."},"example_sentences":[{"sentence":"The artist painted a serene landscape featuring a rush-fringed lake.","translation":"その画家は、イグサの縁取りがされた湖のある穏やかな風景を描いた。","type":"adjective","meaning_category":"description"},{"sentence":"Dragonflies flitted among the rush-fringed edges of the marsh.","translation":"トンボがイグサのふちがある湿地の端をひらひらと飛び回った。","type":"adjective","meaning_category":"description"}]}