{"word":"antennular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"触角小肢の、小触角の","english_definition":"Relating to or possessing antennules (small antennae).","examples":[{"sentence":"The antennular flagella are used for sensing chemicals in the water.","translation":"触角小肢の鞭毛は、水中の化学物質を感知するために使われる。"},{"sentence":"Antennular structure varies greatly among different crustacean species.","translation":"触角小肢の構造は、さまざまな甲殻類の種類の間で大きく異なる。"}],"collocations":["antennular flagellum","antennular segment","antennular nerve"],"synonyms":["antennal","sensory"],"antonyms":[]}],"etymology":{"value":"From antenna + -ular.","priority":"★★★"},"pronunciation":{"ipa":"/ænˈtɛnjʊlər/","syllables":"an-ten-u-lar"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms (more antennular, most antennular), although these are rarely used."},"usage_notes":{"explanation":"'Antennular' is a relatively specialized term used primarily in the context of zoology, specifically when describing the anatomy of arthropods, particularly crustaceans. It refers to structures associated with the antennules, which are smaller, often sensory, appendages located near the main antennae.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The insect used its antennular to fly.","correct":"✓ The insect used its antennae to fly.","note":"Antennules are sensory organs, not used for flight. Insects use wings to fly."},{"incorrect":"✗ The antennular is the main sensory organ.","correct":"✓ The antenna is the main sensory organ.","note":"The antenna is generally the primary sensory organ; antennules are smaller and serve more specialized functions."}],"priority":"★★☆"},"related_words":{"derivatives":["antennule"],"phrasal_verbs":[],"related_terms":["antenna","appendage","crustacean","arthropod"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'antennular' is a technical term primarily used in zoology, specifically when discussing the anatomy of arthropods, especially crustaceans. It describes something related to or possessing antennules, which are small antennae. Due to its specialized nature, it is not commonly encountered outside of scientific or academic contexts related to these fields."},"example_sentences":[{"sentence":"The copepod uses its **antennular** appendages to detect vibrations in the water.","translation":"そのカイアシ類は、触角小肢を使って水中の振動を感知する。","type":"adjective","meaning_category":"触角小肢の"},{"sentence":"The **antennular** structure of the crab is adapted for chemoreception.","translation":"カニの触角小肢の構造は、化学受容に適応している。","type":"adjective","meaning_category":"触角小肢の"}]}