{"word":"recovery-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"回復に基づいた、リカバリー指向の","english_definition":"Based on or focused on the process of recovering from an illness, injury, addiction, or other problem.","examples":[{"sentence":"The hospital offers a recovery-based treatment program for patients with substance abuse issues.","translation":"その病院では、薬物乱用問題を抱える患者のために、回復に基づいた治療プログラムを提供しています。"},{"sentence":"Recovery-based mental health services emphasize patient empowerment and self-determination.","translation":"リカバリー指向のメンタルヘルスサービスは、患者のエンパワーメントと自己決定を重視しています。"},{"sentence":"The new approach to rehabilitation is recovery-based, focusing on helping individuals regain independence and improve their quality of life.","translation":"リハビリテーションへの新しいアプローチは、回復に基づいたもので、個人が自立を取り戻し、生活の質を向上させることを重視しています。"}],"collocations":["recovery-based treatment","recovery-based program","recovery-based approach","recovery-based services","recovery-based care","recovery-based model","recovery-based system","recovery-based practice"],"synonyms":["rehabilitation-focused","restoration-oriented","healing-centered","wellness-driven"],"antonyms":["illness-focused","problem-centered","deficit-based"]}],"etymology":{"value":"The term 'recovery-based' is formed by combining the noun 'recovery' (the process of regaining health or strength) with the suffix '-based' (meaning 'founded on' or 'using as a base'). It indicates that a particular approach, system, or model is centered around the principles and practices of recovery.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈkʌvəri beɪst/","syllables":"re-cov-er-y based"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Recovery-based' is commonly used in healthcare, social work, and related fields to describe approaches that prioritize the individual's journey toward wellness and self-management. It emphasizes hope, empowerment, and the belief that people can overcome significant challenges and live fulfilling lives. It is often contrasted with more traditional, deficit-based models that focus primarily on managing symptoms or problems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is based recovery.","correct":"✓ The program is recovery-based.","note":"The correct form is 'recovery-based' as a single adjective. Using 'based recovery' is grammatically incorrect."},{"incorrect":"✗ We need a recovery base approach.","correct":"✓ We need a recovery-based approach.","note":"'Recovery-based' is an adjective that modifies the noun 'approach.' Make sure to use the correct form."}],"priority":"★★☆"},"related_words":{"derivatives":["recovery (noun)","base (noun/verb)"],"related_terms":["person-centered","trauma-informed","strengths-based","wellness model","self-management","empowerment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in use within specific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'recovery-based' is a specialized adjective used in fields like healthcare and social work. It describes a system, approach, or program that is designed around the idea of helping people recover from problems like illness, addiction, or trauma. It focuses on the individual's strengths and goals, rather than just managing their symptoms. Understanding this term requires some familiarity with these fields and their specific vocabulary."},"example_sentences":[{"sentence":"The organization provides recovery-based housing for individuals transitioning out of homelessness.","translation":"その組織は、ホームレス状態から脱却する個人に、回復に基づいた住宅を提供しています。","type":"adjective","meaning_category":"Housing"},{"sentence":"The therapist uses a recovery-based approach to help clients overcome their eating disorders.","translation":"セラピストは、クライアントが摂食障害を克服するのを支援するために、回復に基づいたアプローチを使用しています。","type":"adjective","meaning_category":"Therapy"},{"sentence":"The hospital's recovery-based model of care emphasizes patient involvement in treatment planning.","translation":"病院の回復に基づいたケアモデルは、治療計画への患者の参加を重視しています。","type":"adjective","meaning_category":"Healthcare"}]}