{"word":"unregistrable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"登録できない、登録不可能な","english_definition":"Not capable of being registered; not eligible for registration.","examples":[{"sentence":"The domain name was unregistrable because it was already taken.","translation":"そのドメイン名は既に取得されていたため、登録できませんでした。"},{"sentence":"Due to the trademark laws, this name is unregistrable.","translation":"商標法により、この名前は登録できません。"}],"collocations":["unregistrable trademark (登録できない商標)","unregistrable domain name (登録できないドメイン名)","unregistrable design (登録できない意匠)"],"synonyms":["ineligible","non-registrable","disqualified","unacceptable"],"antonyms":["registrable","eligible","acceptable"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'registrable,' which itself is derived from 'register' + '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈrɛdʒɪstrəbəl/","syllables":"un-re-gis-tra-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms. However, 'unregistrable' is rarely used in comparative or superlative forms."},"usage_notes":{"explanation":"'Unregistrable' is typically used in legal or technical contexts, particularly concerning trademarks, domain names, patents, or other forms of intellectual property. It indicates that something does not meet the criteria for official registration, often due to pre-existing rights or legal restrictions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unregistrable car.","correct":"✓ The unregistered car.","note":"'Unregistrable' refers to the *ability* to be registered, while 'unregistered' means that it *has not* been registered. A car might be unregistered because the owner hasn't done it, but still be registrable. If it's too old to meet safety standards, it's unregistrable."}],"priority":"★★☆"},"related_words":{"derivatives":["register","registered","registration"],"antonyms":["registrable"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unregistrable' is a relatively uncommon word used in specific contexts, primarily legal and technical fields. It means something cannot be officially recorded or listed in a register. Understanding this word requires familiarity with the concept of registration and the 'un-' prefix indicating negation. It is more likely to be encountered in specialized documents or discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The proposed invention was deemed unregistrable due to prior art.","translation":"提案された発明は、先行技術のために登録できないと判断されました。","type":"adjective","meaning_category":"Unable to be registered"},{"sentence":"An unregistrable trademark can be easily copied by competitors.","translation":"登録できない商標は、競合他社によって簡単にコピーされる可能性があります。","type":"adjective","meaning_category":"Unable to be registered"},{"sentence":"The database flagged the name as unregistrable because it contained prohibited characters.","translation":"データベースは、禁止された文字が含まれているため、その名前を登録できないものとしてフラグを立てました。","type":"adjective","meaning_category":"Unable to be registered"}]}