{"word":"opioid-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オピオイドに関連する、オピオイドに関連した","english_definition":"Relating to or associated with opioids (a class of drugs that include prescription pain relievers and illegal drugs like heroin).","examples":[{"sentence":"The city is facing an opioid-related crisis.","translation":"その都市はオピオイドに関連する危機に直面している。"},{"sentence":"Opioid-related deaths have been increasing in recent years.","translation":"オピオイドに関連する死亡者数は近年増加している。"},{"sentence":"The hospital has implemented new protocols to address opioid-related overdoses.","translation":"その病院はオピオイド関連の過剰摂取に対処するための新しいプロトコルを導入した。"}],"collocations":["opioid-related overdose (オピオイド関連の過剰摂取)","opioid-related death (オピオイド関連の死亡)","opioid-related crisis (オピオイド関連の危機)","opioid-related addiction (オピオイド関連の中毒)","opioid-related treatment (オピオイド関連の治療)"],"synonyms":["narcotic-related"],"antonyms":[]}],"etymology":{"value":"'Opioid' (オピオイド) + '-related' (関連する)","priority":"★★★"},"pronunciation":{"ipa":"/ˈoʊpiɔɪd rɪˈleɪtɪd/","syllables":"o-pi-oid re-lat-ed"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Opioid-related' is used to describe things that are connected to or caused by the use of opioids. This term is often used in the context of public health, medicine, and law enforcement to discuss issues such as addiction, overdose, and crime. It is a relatively recent term that has become more common as opioid use and its associated problems have increased.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ opioid related","correct":"✓ opioid-related","note":"The hyphen is important to show that 'opioid' and 'related' are functioning as a single adjective modifying a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["opioid (名詞: オピオイド)","opioids (名詞: オピオイド類)"],"phrasal_verbs":[],"related_terms":["narcotic","analgesic","painkiller","addiction","overdose","heroin","fentanyl"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, but increasing due to current events.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'opioid-related' is used in discussions about the health and social problems caused by opioids, which are strong pain medications. It is used to describe deaths, illnesses, or other issues that are linked to the use of these drugs. Because it is a technical term related to medicine and public health, it is more common in formal writing and discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The study examined the impact of new policies on opioid-related hospitalizations.","translation":"その研究は、新しい政策がオピオイド関連の入院に与える影響を調査した。","type":"adjective","meaning_category":"related to opioids"},{"sentence":"Emergency services responded to a sharp increase in opioid-related calls.","translation":"救急サービスは、オピオイド関連の通報の急増に対応した。","type":"adjective","meaning_category":"related to opioids"},{"sentence":"The government is working to reduce opioid-related deaths through prevention and treatment programs.","translation":"政府は、予防と治療プログラムを通じてオピオイド関連の死亡者数を減らすために取り組んでいる。","type":"adjective","meaning_category":"related to opioids"}]}