{"word":"perfume-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"香水過敏症の、香料に敏感な","english_definition":"Having a sensitivity or allergy to perfumes or fragrances, often resulting in adverse reactions.","examples":[{"sentence":"Many people are perfume-sensitive and experience headaches or respiratory issues when exposed to strong scents.","translation":"多くの人が香水過敏症であり、強い香りにさらされると頭痛や呼吸器系の問題を起こします。"},{"sentence":"This workplace has a policy to be fragrance-free to accommodate perfume-sensitive employees.","translation":"この職場には、香水過敏症の従業員に対応するため、無香料にするという方針があります。"},{"sentence":"She is perfume-sensitive, so she avoids going to places where people wear strong fragrances.","translation":"彼女は香水過敏症なので、強い香水をつけている人がいる場所に行くのを避けています。"}],"collocations":["perfume-sensitive individual","perfume-sensitive employee","perfume-sensitive person","fragrance-free policy","scent-free environment"],"synonyms":["fragrance-sensitive","scent-sensitive","allergic to perfume","sensitive to fragrances"],"antonyms":["perfume-tolerant","fragrance-tolerant","insensitive to perfume","not allergic to fragrances"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'perfume' (a fragrant liquid) and 'sensitive' (easily affected or damaged).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈpɜːrfjuːmˌsɛnsətɪv/","syllables":"per-fume-sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative and superlative forms, which are less common with compound adjectives like this one."},"usage_notes":{"explanation":"'Perfume-sensitive' describes individuals who experience adverse reactions (such as headaches, skin irritation, or respiratory problems) when exposed to perfumes or other fragrances. It is often used in the context of workplace policies or public spaces to promote consideration for those with this sensitivity.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is sensitive for perfume.","correct":"✓ She is sensitive to perfume.","note":"The correct preposition to use with 'sensitive' in this context is 'to'."},{"incorrect":"✗ He has a perfume sensitivity.","correct":"✓ He is perfume-sensitive.","note":"While 'perfume sensitivity' can be used as a noun phrase, 'perfume-sensitive' is the more common and direct adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["sensitivity","perfume","fragrance","allergy","hypersensitivity"],"phrasal_verbs":[],"related_terms":["fragrance-free","scent-free","hypoallergenic"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to greater awareness of sensitivities and allergies.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'perfume-sensitive' is used to describe people who have a negative reaction to perfumes or fragrances. It's a compound adjective that combines 'perfume' and 'sensitive.' It's often used in discussions about creating inclusive and accessible environments, especially in workplaces and public spaces. Understanding this term helps in recognizing and accommodating the needs of individuals with this sensitivity."},"example_sentences":[{"sentence":"The doctor confirmed that she is perfume-sensitive and advised her to avoid scented products.","translation":"医師は彼女が香水過敏症であることを確認し、香りのある製品を避けるようにアドバイスしました。","type":"adjective","meaning_category":"sensitivity"},{"sentence":"The event organizers requested attendees to refrain from wearing strong perfumes to accommodate perfume-sensitive guests.","translation":"イベント主催者は、香水過敏症のゲストに対応するため、参加者に強い香水の使用を控えるよう要請しました。","type":"adjective","meaning_category":"accommodation"},{"sentence":"As a perfume-sensitive individual, she always carries unscented wipes to clean surfaces in public places.","translation":"香水過敏症の個人として、彼女は常に公共の場所で表面をきれいにするために無香料のウェットティッシュを持ち歩いています。","type":"adjective","meaning_category":"personal care"}]}