{"word":"Gastrolobium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of flowering plants in the family Fabaceae (pea family), native to Australia. Many species are toxic due to the presence of monofluoroacetate.","english_definition":"A genus of flowering plants in the family Fabaceae (pea family), native to Australia. Many species are toxic due to the presence of monofluoroacetate.","examples":[{"sentence":"Many species of Gastrolobium are poisonous to livestock.","translation":"Gastrolobium属の多くの種は家畜にとって有毒です。"}],"collocations":["Gastrolobium species","toxic Gastrolobium","Gastrolobium toxicity"],"synonyms":["poison pea","native poison plant"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gaster' (belly) and 'lobos' (lobe), referring to the inflated seed pods of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡæstroʊˈloʊbiəm/","syllables":"Gas-tro-lo-bi-um"},"inflection":{"noun_plural":"Gastrolobiums"},"usage_notes":{"explanation":"'Gastrolobium' is a botanical term, specifically referring to a genus of plants. It is most commonly used in scientific or agricultural contexts when discussing Australian flora or the dangers of poisonous plants to livestock.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Gastrolobium in my garden, it was very colorful.","correct":"✓ I saw a plant that looked like a Gastrolobium in my garden, it was very colorful.","note":"Unless you are certain of the plant's identification, it's better to say 'a plant that looked like a Gastrolobium' as accurate identification requires botanical expertise."}],"priority":"★★☆"},"related_words":{"derivatives":["fluoroacetate (the toxic compound found in many Gastrolobium species)","Fabaceae (the plant family to which Gastrolobium belongs)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (scientific/technical context)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gastrolobium' is a technical term used in botany and ecology. Understanding its meaning requires familiarity with plant taxonomy and the specific flora of Australia. The associated risks of toxicity to livestock also make it relevant in agricultural contexts. Its use is limited to specialized discussions. "},"example_sentences":[{"sentence":"Research is being conducted to understand the mechanisms of fluoroacetate resistance in animals that coexist with Gastrolobium.","translation":"Gastrolobiumと共存する動物におけるフルオロ酢酸耐性のメカニズムを理解するための研究が行われています。","type":"scientific","meaning_category":"botany"},{"sentence":"Farmers in Western Australia need to be aware of the presence of Gastrolobium on their land to prevent livestock poisoning.","translation":"西オーストラリアの農家は、家畜の中毒を防ぐために、自分の土地にGastrolobiumが存在することに注意する必要があります。","type":"agricultural","meaning_category":"agriculture"}]}