{"word":"tarso-metatarsus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥類の足に見られる、足根骨と中足骨が癒合した骨","english_definition":"A bone found in the lower leg of birds, formed by the fusion of some of the tarsal and metatarsal bones; it is unique to birds and some extinct dinosaurs.","examples":[{"sentence":"The tarso-metatarsus is a key feature in avian skeletal structure.","translation":"跗蹠骨は鳥類の骨格構造における重要な特徴である。"},{"sentence":"The length of the tarso-metatarsus can vary significantly between different bird species.","translation":"跗蹠骨の長さは、鳥の種類によって大きく異なることがある。"}],"collocations":["avian tarso-metatarsus","fossil tarso-metatarsus","length of tarso-metatarsus","structure of tarso-metatarsus"],"synonyms":["tarsometatarsal bone","shank bone"],"antonyms":[]}],"etymology":{"value":"Derived from 'tarso-' (referring to the tarsus or ankle) and 'metatarsus' (referring to the metatarsal bones of the foot), reflecting the fusion of these bones.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɑːrsoʊˌmɛtəˈtɑːrsəs/","syllables":"tar-so-me-ta-tar-sus"},"inflection":{"noun_plural":"tarso-metatarsi"},"usage_notes":{"explanation":"The term 'tarso-metatarsus' is primarily used in ornithology (the study of birds), paleontology, and comparative anatomy. It specifically refers to the single bone formed by the fusion of the distal tarsals and metatarsals in birds. This bone provides additional leverage for walking, running, and perching.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tarso-metatarsus is found in mammals.","correct":"✓ The tarso-metatarsus is found in birds.","note":"The tarso-metatarsus is unique to birds and some of their extinct dinosaur relatives, not mammals."},{"incorrect":"✗ The tarso-metatarsus is a muscle.","correct":"✓ The tarso-metatarsus is a bone.","note":"The tarso-metatarsus is a bone formed by the fusion of other bones, not a muscle."}],"priority":"★☆☆"},"related_words":{"derivatives":["tarsus","metatarsus","tarsometatarsal"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tarso-metatarsus' is a technical term used in the context of avian anatomy and paleontology. Understanding this term requires knowledge of skeletal structure and the specific adaptations found in birds. It refers to a fused bone in the lower leg of birds, which is a unique characteristic differentiating them from most other vertebrates. The word is built from the combination of 'tarsus' and 'metatarsus', indicating the bones involved in the fusion."},"example_sentences":[{"sentence":"The fossil record shows the development of the tarso-metatarsus in early avian species.","translation":"化石記録は、初期の鳥類における跗蹠骨の発達を示している。","type":"noun","meaning_category":"anatomy"},{"sentence":"The robust tarso-metatarsus of raptors allows them to grip prey with great force.","translation":"猛禽類の頑丈な跗蹠骨は、獲物を非常に強い力で掴むことを可能にする。","type":"noun","meaning_category":"anatomy"}]}