{"word":"gametogony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"配偶子生殖：一部の原生生物において、無性生殖によって生じた細胞（メロゾイトなど）が配偶子（生殖細胞）を形成する過程。","english_definition":"The process in some protozoans in which merozoites or similar cells produced by asexual reproduction develop into gametocytes (sexual cells).","examples":[{"sentence":"Gametogony is a crucial stage in the life cycle of Plasmodium, the parasite that causes malaria.","translation":"配偶子生殖は、マラリアを引き起こす寄生虫であるプラスモジウムの生活環において重要な段階である。"}],"collocations":["undergo gametogony","initiate gametogony","sexual reproduction via gametogony"],"synonyms":["sexual reproduction","gametogenesis"],"antonyms":["schizogony","merogony","asexual reproduction"]}],"etymology":{"value":"Derived from the Greek words 'gameto-' (referring to gametes or sexual cells) and '-gony' (referring to reproduction or generation).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡəˌmiːˈtɒɡəni/","syllables":"ga-me-tog-o-ny"},"inflection":{"noun_plural":"gametogonies"},"usage_notes":{"explanation":"Gametogony is a biological term specifically used in the context of certain protozoan parasites, such as Plasmodium. It describes the transition from asexual reproduction to sexual reproduction within the parasite's life cycle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Gametogony is a type of asexual reproduction.","correct":"✓ Gametogony is a type of sexual reproduction.","note":"Gametogony involves the production of gametes, which are involved in sexual reproduction."}],"priority":"★★☆"},"related_words":{"derivatives":["gametocyte","gamete","schizogony","sporogony"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gametogony' is a highly specialized term used in parasitology and protozoology to describe a specific type of sexual reproduction in certain parasites. Understanding this term requires a strong background in biology and life cycles of parasitic organisms. It is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Following schizogony in the mosquito, Plasmodium parasites undergo gametogony.","translation":"蚊の中での分裂生殖の後、プラスモジウム寄生虫は配偶子生殖を行う。","type":"scientific","meaning_category":"biological process"},{"sentence":"The initiation of gametogony is triggered by specific environmental cues within the host.","translation":"配偶子生殖の開始は、宿主内の特定の環境的合図によって引き起こされる。","type":"scientific","meaning_category":"biological process"}]}