{"word":"parallelisms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"平行、類似、類似点、並行性、並行処理","english_definition":"The state of being parallel or corresponding in some way; similarity; correspondence; the use of successive verbal constructions in poetry or prose which correspond in grammatical structure, sound, meter, meaning, etc.","examples":[{"sentence":"The parallelisms between the two stories are striking.","translation":"その二つの物語の間の類似点は際立っている。"},{"sentence":"The poet used parallelisms to create a sense of rhythm.","translation":"その詩人はリズム感を出すために並行表現を使った。"},{"sentence":"There are some interesting parallelisms in their political views.","translation":"彼らの政治的見解にはいくつかの興味深い類似点がある。"}],"collocations":["striking parallelisms (著しい類似点)","obvious parallelisms (明らかな類似点)","draw parallelisms (類似点を引き出す)","find parallelisms (類似点を見つける)","historical parallelisms (歴史的な類似点)","structural parallelisms (構造的な類似点)","linguistic parallelisms (言語的な類似点)"],"synonyms":["similarity","correspondence","analogy","resemblance","equivalence","alignment","correlation"],"antonyms":["divergence","disparity","contrast","difference","dissimilarity"]},{"part_of_speech":"noun","definition":"(修辞学における)対句法、並行法","english_definition":"(Rhetoric) The use of components in a sentence that are grammatically the same; or similar in their construction, sound, meaning, or meter.","examples":[{"sentence":"'Like father, like son' is a classic example of parallelism.","translation":"「この親にしてこの子あり」は対句法の典型的な例である。"},{"sentence":"He used parallelism to emphasize his points.","translation":"彼は自分の主張を強調するために並行法を使った。"},{"sentence":"Parallelism can make writing more persuasive and memorable.","translation":"並行法は文章をより説得力があり、記憶に残るものにすることができる。"}],"collocations":["rhetorical parallelism (修辞的な並行法)","grammatical parallelism (文法的な並行法)","semantic parallelism (意味的な並行法)","syntactic parallelism (統語的な並行法)","use parallelism (並行法を使う)","create parallelism (並行法を作る)","achieve parallelism (並行法を達成する)"],"synonyms":["balance","symmetry","correspondence","equivalence","antithesis","chiasmus"],"antonyms":["asymmetry","imbalance","disparity"]}],"etymology":{"value":"The word \"parallelism\" comes from the word \"parallel,\" which originates from the Greek word \"parallēlos,\" meaning \"side by side.\" The suffix \"-ism\" denotes a state, quality, or doctrine. Therefore, \"parallelism\" refers to the state of being parallel or the use of parallel structures.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpærəˌlɛlɪzəmz/","syllables":"par-al-lel-is-ms"},"inflection":{"noun_plural":"parallelisms"},"usage_notes":{"explanation":"\"Parallelism\" has two main uses: a general sense of similarity or correspondence, and a specific sense referring to a rhetorical device. In the general sense, it describes things that are alike or analogous. In rhetoric, it refers to the balanced arrangement of similar words, phrases, or clauses to create a rhythmic and memorable effect. The rhetorical use is common in literature, speeches, and persuasive writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The parallelism between the lines are obvious.","correct":"✓ The parallelism between the lines is obvious.","note":"The subject is \"parallelism,\" which is singular, so the verb should be \"is.\""},{"incorrect":"✗ He used parallelisms to emphasized his point.","correct":"✓ He used parallelisms to emphasize his point.","note":"The correct spelling of the verb is \"emphasize.\""},{"incorrect":"✗ The parallelisms is very interesting.","correct":"✓ The parallelisms are very interesting.","note":"Since \"parallelisms\" is plural, the verb should be \"are.\""}],"priority":"★★☆"},"related_words":{"derivatives":["parallel (adjective, noun, verb)","parallelize (verb)"],"phrases":["parallel structure","parallel processing","parallel computing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"parallelisms\" is used in two main contexts: generally, to describe similarities between things, and specifically in rhetoric to describe a literary device. Understanding the context is key to interpreting its meaning. In literary analysis, it refers to the balanced arrangement of words or phrases for emphasis. In general usage, it refers to similarities or correspondences between different things or ideas. It is more common in academic or literary discussions than in everyday conversation."},"example_sentences":[{"sentence":"The **parallelisms** between Shakespeare's plays and ancient Greek tragedies are often noted by scholars.","translation":"シェイクスピアの戯曲と古代ギリシャ悲劇の間の類似点は、学者によってしばしば指摘される。","type":"noun","meaning_category":"similarity"},{"sentence":"The speech was full of **parallelisms**, such as 'Ask not what your country can do for you – ask what you can do for your country.'","translation":"その演説は、「国があなたに何をしてくれるかを問うのではなく、あなたが国に何ができるかを問うてください」のような対句法で満たされていた。","type":"noun","meaning_category":"rhetorical device"},{"sentence":"We can draw **parallelisms** between the economic crises of the 1930s and the present day.","translation":"1930年代の経済危機と今日の間には類似点を引き出すことができる。","type":"noun","meaning_category":"similarity"},{"sentence":"The use of **parallelisms** in the poem creates a sense of balance and harmony.","translation":"その詩における並行法の使用は、バランスと調和の感覚を生み出す。","type":"noun","meaning_category":"rhetorical device"},{"sentence":"There are striking **parallelisms** in the development of different cultures.","translation":"異なる文化の発展には著しい類似点がある。","type":"noun","meaning_category":"similarity"}]}