{"word":"eversporting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"常にスポーツマンシップにのっとった、常に快活な、常に活動的な","english_definition":"Always exhibiting good sportsmanship; consistently cheerful and active.","examples":[{"sentence":"He was known for his eversporting attitude, win or lose.","translation":"彼は勝っても負けても、常にスポーツマンシップにのっとった態度で知られていた。"},{"sentence":"Despite his age, he maintained an eversporting spirit.","translation":"彼は年齢にもかかわらず、常に快活な精神を保っていた。"}],"collocations":["eversporting attitude","eversporting spirit"],"synonyms":["sporting","fair","cheerful","active","spirited"],"antonyms":["unsportsmanlike","gloomy","inactive"]}],"etymology":{"value":"\"Ever-\" (常に) + \"sporting\" (スポーツマンシップにのっとった、快活な) の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˈevərˌspɔːrtɪŋ/","syllables":"ev-er-sport-ing"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Eversporting\" はやや古風な表現で、現代英語ではあまり一般的ではありません。しかし、スポーツマンシップ、快活さ、活動性を強調する際に使用できます。より一般的な類義語としては、\"sporting,\" \"fair,\" \"cheerful,\" \"active,\" \"spirited\" などがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is eversporting in the game.","correct":"✓ He has an eversporting attitude in the game.","note":"\"Eversporting\" は、人の性質や態度を説明する形容詞としてより適切です。具体的な行動を説明する場合は、別の表現を使用してください。"},{"incorrect":"✗ She is eversporting to help others.","correct":"✓ She has an eversporting willingness to help others.","note":"\"Eversporting\" は、人の意欲や意図を説明する形容詞としてより適切です。具体的な行動を説明する場合は、別の表現を使用してください。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (一般的ではない語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"eversporting\" is a somewhat archaic term that combines \"ever-\" (meaning always) with \"sporting\" (meaning exhibiting good sportsmanship or being cheerful and active). It describes someone who consistently demonstrates fairness, good conduct, and a positive attitude, especially in competitive situations. While not commonly used in modern English, it conveys a sense of unwavering enthusiasm and ethical behavior. It's often used to describe a person's character or spirit rather than specific actions."},"example_sentences":[{"sentence":"The team captain was praised for his eversporting behavior, even after a tough loss.","translation":"チームのキャプテンは、厳しい敗北の後でも、常にスポーツマンシップにのっとった行動をしていたことで賞賛された。","type":"adjective","meaning_category":"スポーツマンシップにのっとった"},{"sentence":"Her eversporting nature made her a favorite among her peers.","translation":"彼女の常に快活な性格は、彼女を同僚の間で人気者にした。","type":"adjective","meaning_category":"快活な"}]}