{"word":"Perameloid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学) バンディクート目に属する","english_definition":"Relating to or belonging to the Peramelia order (bandicoots and bilbies).","examples":[{"sentence":"The perameloid species are native to Australia and New Guinea.","translation":"バンディクート目の種はオーストラリアとニューギニアに固有である。"}],"collocations":[],"synonyms":["bandicoot-like"],"antonyms":[]},{"part_of_speech":"noun","definition":"(動物学) バンディクート目の動物","english_definition":"Any animal belonging to the Peramelia order (bandicoots and bilbies).","examples":[{"sentence":"The perameloids are characterized by their pointed heads and strong claws.","translation":"バンディクート目の動物は、尖った頭と強い爪が特徴である。"}],"collocations":[],"synonyms":["bandicoot","bilby"],"antonyms":[]}],"etymology":{"value":"Derived from the taxonomic name Peramelia, which comes from the Greek 'pera' (pouch) and 'melos' (limb), referring to the pouch and slender limbs of these marsupials.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈræməˌlɔɪd/","syllables":"pe-ra-me-loid"},"inflection":{"noun_plural":"perameloids"},"usage_notes":{"explanation":"'Perameloid' is a term used in zoology to classify animals within the order Peramelia, which includes bandicoots and bilbies. It can be used as both an adjective and a noun. As an adjective, it describes characteristics related to this order. As a noun, it refers to any animal within this order.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Peramelia","Peramelemorphia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'perameloid' is a specialized term used in the field of zoology and is not commonly used in general conversation. It is primarily encountered in scientific literature or discussions related to Australian marsupials."},"example_sentences":[{"sentence":"The researchers studied the behavior of several perameloid species in their natural habitat.","translation":"研究者たちは、自然の生息地におけるいくつかのバンディクート目の種の行動を研究した。","type":"noun","meaning_category":"動物学"},{"sentence":"Perameloid marsupials play an important role in the ecosystem as insectivores and soil disturbers.","translation":"バンディクート目の有袋類は、昆虫食動物および土壌攪乱動物として生態系において重要な役割を果たしている。","type":"adjective","meaning_category":"動物学"}]}