{"word":"mediatingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"調停的に、仲介的に","english_definition":"In a mediating manner; acting as an intermediary or go-between.","examples":[{"sentence":"The organization worked mediatingly to resolve the conflict between the two parties.","translation":"その組織は、二当事者間の紛争を解決するために調停的に活動した。"},{"sentence":"She spoke mediatingly, trying to find common ground between their opposing viewpoints.","translation":"彼女は彼らの対立する見解の共通点を見つけようと、仲介的に話した。"}],"collocations":["act mediatingly","speak mediatingly","intervene mediatingly"],"synonyms":["intermediately","conciliatorily","arbitratively"],"antonyms":["directly","confrontationally"]}],"etymology":{"value":"Derived from the verb 'mediate' (to intervene between people in a dispute in order to bring about an agreement or reconciliation) with the addition of the suffix '-ing' to form the present participle or gerund, and then '-ly' to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmiːdiˌeɪtɪŋli/","syllables":"me-di-at-ing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Mediatingly' describes the manner in which an action is carried out. It implies a process of intervention aimed at resolving differences or facilitating agreement. It is often used in contexts involving conflict resolution, negotiation, or diplomacy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mediator acted mediate.","correct":"✓ The mediator acted mediatingly.","note":"'Mediate' is a verb or adjective, while 'mediatingly' is the adverb that describes how the action of mediating is performed."}],"priority":"★☆☆"},"related_words":{"derivatives":["mediate (verb)","mediating (adjective)","mediation (noun)","mediator (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mediatingly' is an adverb that describes acting as a mediator, or someone who helps resolve disputes. It is a formal word not commonly used in everyday conversation. Understanding the root word 'mediate' is helpful in understanding 'mediatingly'."},"example_sentences":[{"sentence":"The diplomat approached the negotiations mediatingly, seeking a solution that satisfied both sides.","translation":"外交官は交渉に調停的に取り組み、双方を満足させる解決策を模索した。","type":"general","meaning_category":"調停的に"},{"sentence":"The software platform functions mediatingly, connecting buyers and sellers in a seamless transaction.","translation":"そのソフトウェアプラットフォームは仲介的に機能し、買い手と売り手をシームレスな取引で結び付ける。","type":"technical","meaning_category":"仲介的に"}]}