{"word":"Whitmanize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To make something resemble the style or themes of Walt Whitman's poetry, especially by celebrating individualism, democracy, and the common person.","english_definition":"To imbue something with the characteristics of Walt Whitman's poetry, such as its celebration of individualism, democracy, and the common person.","examples":[{"sentence":"The artist sought to Whitmanize his paintings by depicting ordinary people in everyday settings.","translation":"その芸術家は、日常の場面で普通の人々を描写することで、自分の絵画をホイットマン風にしようと試みた。"},{"sentence":"The speech was Whitmanized with its emphasis on the importance of every citizen's voice.","translation":"その演説は、すべての市民の声の重要性を強調することで、ホイットマン風になった。"}],"collocations":["Whitmanize a poem","Whitmanize a speech","Whitmanize a painting","Whitmanize a text"],"synonyms":["Whitmanesque","democratize","individualize","popularize"],"antonyms":["formalize","restrict","conventionalize"]}],"etymology":{"value":"Derived from the name of the American poet Walt Whitman (1819-1892) + the suffix '-ize,' indicating the act of making something like or resembling Whitman's style or themes.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɪtmənaɪz","syllables":"Whit-man-ize"},"inflection":{"verb_forms":{"present_simple":["Whitmanize","Whitmanizes"],"past_simple":"Whitmanized","past_participle":"Whitmanized","present_participle":"Whitmanizing"}},"usage_notes":{"explanation":"'Whitmanize' is a relatively rare verb used to describe the act of infusing something with the qualities associated with Walt Whitman's poetry. These qualities typically include a focus on individualism, democracy, the common person, and a free-verse style. It is often used in literary or artistic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He Whitmanized the building with modern architecture.","correct":"✓ He Whitmanized the building with murals depicting everyday life.","note":"'Whitmanize' implies incorporating themes of individualism, democracy, or the common person, not just any modern style."}],"priority":"★☆☆"},"related_words":{"derivatives":["Whitmanesque (adjective: resembling Walt Whitman or his works)","Whitman (noun: Walt Whitman himself or his works)"],"phrases":["In the style of Walt Whitman","Inspired by Walt Whitman"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Whitmanize' is a specialized term primarily used in literary or artistic discussions. It refers to the act of making something similar to the style or themes found in Walt Whitman's poetry, such as celebrating individualism, democracy, and the common person. Due to its specific and somewhat academic usage, it is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The author tried to Whitmanize the novel by giving voice to marginalized characters.","translation":"その作家は、疎外された登場人物に声を与えることで、その小説をホイットマン風にしようとした。","type":"verb","meaning_category":"resembling Walt Whitman's style"},{"sentence":"The artist's goal was to Whitmanize the landscape paintings with scenes of urban life.","translation":"その芸術家の目標は、都市生活の場面を取り入れることで、風景画をホイットマン風にすることだった。","type":"verb","meaning_category":"resembling Walt Whitman's themes"}]}