{"word":"tariffite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A supporter of tariffs, especially protective tariffs.","english_definition":"A person who advocates or supports tariffs, particularly those designed to protect domestic industries from foreign competition.","examples":[{"sentence":"The tariffites argued that the new import duties would stimulate the national economy.","translation":"関税支持者たちは、新たな輸入関税が国内経済を刺激すると主張した。"},{"sentence":"The debate between free traders and tariffites was a central issue in the election.","translation":"自由貿易主義者と関税支持者との間の議論は、選挙における中心的な問題だった。"}],"collocations":["protectionist tariffite","strong tariffite","ardent tariffite"],"synonyms":["protectionist","tariff advocate","tariff supporter"],"antonyms":["free trader","globalist"]},{"part_of_speech":"adjective","definition":"Supporting tariffs, especially protective tariffs.","english_definition":"Advocating or supporting tariffs, particularly those designed to protect domestic industries from foreign competition.","examples":[{"sentence":"The senator is known for his tariffite stance on trade policy.","translation":"その上院議員は、貿易政策における関税支持の立場として知られている。"},{"sentence":"The tariffite policies of the government led to trade wars with other nations.","translation":"政府の関税支持政策は、他国との貿易戦争につながった。"}],"collocations":["tariffite policy","tariffite argument","tariffite measure"],"synonyms":["protectionist","tariff-supporting"],"antonyms":["free-trade","globalist"]}],"etymology":{"value":"Formed from \"tariff\" + \"-ite\" (a suffix used to form nouns and adjectives indicating an adherent or supporter of a particular doctrine, party, or belief).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtærɪfaɪt/","syllables":"tar-if-fite"},"inflection":{"noun_plural":"tariffites"},"usage_notes":{"explanation":"The term \"tariffite\" is primarily used in historical or political contexts when discussing trade policies and protectionism. It is often contrasted with \"free trader,\" who advocates for minimal or no tariffs. The term can be considered somewhat dated, but it remains useful in describing those who strongly support tariffs as a means of protecting domestic industries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tariffist.","correct":"✓ He is a tariffite.","note":"While \"tariffist\" might seem like a logical alternative, \"tariffite\" is the more established and widely used term."}],"priority":"★★☆"},"related_words":{"derivatives":["tariff","tariffication","protectionism"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"tariffite\" is a specialized term primarily used in discussions of economics, trade policy, and political history. Understanding its meaning requires familiarity with the concept of tariffs and protectionism. The word is not commonly used in everyday conversation and is more likely to appear in academic or specialized publications.","priority":"★★☆"},"example_sentences":[{"sentence":"As a dedicated tariffite, he believed in shielding domestic industries from foreign competition.","translation":"熱心な関税支持者として、彼は国内産業を外国の競争から守ることを信じていた。","type":"noun","meaning_category":"Supporter of tariffs"},{"sentence":"The newspaper published a tariffite editorial, advocating for higher import duties.","translation":"その新聞は、より高い輸入関税を提唱する関税支持の社説を掲載した。","type":"adjective","meaning_category":"Supporting tariffs"}]}