{"word":"arvicoline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ハタネズミ亜科（Arvicolinae）に属する、またはそれに関連する","english_definition":"Of or pertaining to the subfamily Arvicolinae (voles, lemmings, and muskrats).","examples":[{"sentence":"Arvicoline rodents are found in a variety of habitats.","translation":"ハタネズミ亜科の齧歯類は、様々な生息地で見られる。"},{"sentence":"The arvicoline dentition is characterized by rootless molars.","translation":"ハタネズミ亜科の歯列は、根のない臼歯によって特徴づけられる。"}],"collocations":["arvicoline rodent","arvicoline dentition","arvicoline habitat"],"synonyms":["vole-like","lemming-like"],"antonyms":[]}],"etymology":{"value":"Derived from the subfamily name Arvicolinae, which comes from the genus name Arvicola (water voles). Arvicola is a combination of Latin 'arvum' (field) and 'cola' (dweller), referring to the field-dwelling habits of these voles.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈvɪkəˌlaɪn/","syllables":"ar-vi-co-line"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'arvicoline' is primarily used in zoology and ecology to describe characteristics, species, or features associated with the Arvicolinae subfamily. This subfamily includes voles, lemmings, muskrats, and related rodents. It's often used in scientific contexts when discussing the evolutionary relationships, morphology, or ecological roles of these animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arvicoline is a type of bird.","correct":"✓ The arvicoline rodent is a type of mammal.","note":"Arvicolines are rodents (mammals), not birds."},{"incorrect":"✗ Arvicoline are only found in tropical regions.","correct":"✓ Arvicolines are found in a variety of climates, including temperate and arctic regions.","note":"Arvicolines are found in diverse climates, not just tropical regions."}],"priority":"★☆☆"},"related_words":{"derivatives":["Arvicolinae (subfamily)","Arvicola (genus)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arvicoline' is a technical term used in the fields of zoology and ecology. It describes anything related to the Arvicolinae subfamily of rodents, which includes voles, lemmings, and muskrats. The term is typically encountered in scientific literature or specialized discussions about these animals. Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The fossil record provides evidence of arvicoline evolution over millions of years.","translation":"化石記録は、数百万年にわたるハタネズミ亜科の進化の証拠を提供する。","type":"adjective","meaning_category":"pertaining to Arvicolinae"},{"sentence":"Arvicoline population dynamics are influenced by climate and food availability.","translation":"ハタネズミ亜科の個体数の動態は、気候と食料の入手可能性によって影響を受ける。","type":"adjective","meaning_category":"pertaining to Arvicolinae"}]}