{"word":"enucleated","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(眼球や腫瘍などを)摘出する、核を取り除く","english_definition":"to remove the kernel or nucleus from; to remove (the eyeball) surgically; to remove (a tumor or cyst) cleanly from its surrounding tissue.","examples":[{"sentence":"The surgeon enucleated the patient's eye due to severe trauma.","translation":"外科医は重度の外傷のため、患者の眼球を摘出した。"},{"sentence":"The technician carefully enucleated the cell's nucleus for research purposes.","translation":"技術者は研究目的のために、細胞の核を注意深く取り除いた。"},{"sentence":"The doctor decided to enucleate the benign tumor to prevent further complications.","translation":"医師は、さらなる合併症を防ぐために良性腫瘍を摘出することを決定した。"}],"collocations":["enucleate an eye (眼球を摘出する)","enucleate a tumor (腫瘍を摘出する)","enucleate a nucleus (核を取り除く)"],"synonyms":["excise","extract","remove","eviscerate","dissect"],"antonyms":["implant","insert","graft"]}],"etymology":{"value":"Derived from the Latin word \"enucleatus,\" the past participle of \"enucleare,\" meaning \"to remove the kernel or nut from.\" This comes from \"e-\" (out of) + \"nucleus\" (kernel, nut).","priority":"★★☆"},"pronunciation":{"ipa":"/iˈnukliˌeɪtɪd/","syllables":"e-nu-cle-a-ted"},"inflection":{"verb_forms":{"present_simple":["enucleate","enucleates"],"past_simple":"enucleated","past_participle":"enucleated","present_participle":"enucleating"}},"usage_notes":{"explanation":"\"Enucleated\" is a specialized term primarily used in medical and scientific contexts. It refers to the surgical removal of an entire structure, such as the eyeball, or the removal of the nucleus from a cell. The term implies a clean and complete removal, leaving the surrounding tissues intact as much as possible. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef enucleated the apple.","correct":"✓ The chef cored the apple.","note":"While technically \"enucleate\" could be used to describe removing the core of an apple, \"core\" is the more common and appropriate term. \"Enucleate\" is generally reserved for medical or scientific contexts."},{"incorrect":"✗ The dentist enucleated the tooth.","correct":"✓ The dentist extracted the tooth.","note":"For tooth removal, \"extract\" is the standard term, not \"enucleate.\""}],"priority":"★★☆"},"related_words":{"derivatives":["enucleation (noun: the act of enucleating)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"enucleated\" is a highly specialized term primarily used in medical and scientific fields. It describes the surgical removal of an organ or structure in its entirety, such as an eyeball or a tumor, or the removal of the nucleus from a cell. Due to its specific and technical nature, it is not commonly encountered in general English usage. Understanding requires a strong grasp of medical or biological terminology."},"example_sentences":[{"sentence":"The ophthalmologist carefully enucleated the damaged eye.","translation":"眼科医は損傷した眼球を注意深く摘出した。","type":"verb","meaning_category":"surgical removal of an eye"},{"sentence":"The biologist enucleated the cell to study its cytoplasmic components.","translation":"生物学者は細胞質成分を研究するために細胞から核を取り除いた。","type":"verb","meaning_category":"removal of a nucleus"},{"sentence":"Following the enucleation, the patient was fitted with a prosthetic eye.","translation":"摘出後、患者は義眼を装着した。","type":"noun (enucleation)","meaning_category":"surgical procedure"}]}