{"word":"Frenghi","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"(歴史的)ヨーロッパ人、特に中東やアジア地域から見たフランク人、または一般的に西ヨーロッパ人を指す言葉。軽蔑的な意味合いを含む場合もある。","english_definition":"(historical) A term used in the Middle East and Asia to refer to Europeans, particularly Franks, or Western Europeans in general. It can sometimes carry a derogatory connotation.","examples":[{"sentence":"In some historical texts, European crusaders are referred to as Frenghi.","translation":"いくつかの歴史的な文献では、ヨーロッパの十字軍兵士はFrenghiと呼ばれている。"},{"sentence":"The term Frenghi was often used by locals to describe European traders.","translation":"Frenghiという言葉は、しばしば地元民がヨーロッパの貿易商を指すのに使われた。"}],"collocations":["Frenghi traders (Frenghiの貿易商)","Frenghi ships (Frenghiの船)","call someone Frenghi (誰かをFrenghiと呼ぶ)"],"synonyms":["European","Frank","Westerner","foreigner"],"antonyms":["local","native"],"notes":"この言葉は、地域や時代によって意味合いが異なるため、使用する際には注意が必要である。"}],"etymology":{"value":"アラビア語の「al-Faranj」（フランク人）に由来する。フランク王国は中世ヨーロッパにおいて大きな勢力を持っていたため、アラブ世界ではヨーロッパ人を指す一般的な言葉として広まった。","priority":"中"},"pronunciation":{"ipa":"/ˈfreŋɡi/","syllables":"Freng-ghi"},"inflection":{"notes":"複数形はFrenghis"},"usage_notes":{"explanation":"Frenghiは、中東やアジアの歴史的な文脈でヨーロッパ人を指す言葉として使われてきた。現代ではあまり一般的ではないが、歴史的な文書や文学作品で見られることがある。軽蔑的な意味合いを含む場合もあるため、使用には注意が必要。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"Using Frenghi to refer to all Western people today.","correct":"Referring to Western people as Europeans or Westerners.","note":"Frenghiは現代では一般的ではなく、歴史的な文脈で使用されることが多い。"}],"priority":"低"},"related_words":{"derivatives":[],"related_terms":["Frank","European","Crusader"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'Frenghi' is a historical term primarily used in Middle Eastern and Asian contexts to refer to Europeans. It is not commonly used in modern English and may carry negative connotations depending on the context. Understanding its historical usage is important when encountering it in literature or historical texts."},"example_sentences":[{"sentence":"The old merchant spoke of the Frenghi who arrived by ship with strange goods.","translation":"その老いた商人は、奇妙な品物を持って船でやってきたFrenghiについて語った。","type":"historical","meaning_category":"ヨーロッパ人"},{"sentence":"Some locals viewed the Frenghi with suspicion due to their different customs.","translation":"一部の地元民は、その異なる習慣のためにFrenghiを疑いの目で見ていた。","type":"historical","meaning_category":"外国人"}]}