{"word":"green-tailed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"緑色の尾を持つ","english_definition":"Having a green tail.","examples":[{"sentence":"The green-tailed hummingbird is a beautiful bird.","translation":"緑色の尾を持つハチドリは美しい鳥です。"},{"sentence":"We saw a green-tailed comet streak across the sky.","translation":"緑色の尾を持つ彗星が空を横切るのを見ました。"}],"collocations":["green-tailed hummingbird","green-tailed comet"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Compound of 'green' and 'tailed'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɡriːnˈteɪld/","syllables":"green-tailed"},"inflection":{},"usage_notes":{"explanation":"This adjective is typically used to describe animals or objects with a tail that is predominantly green in color. It is often used in the context of describing birds, insects, or even celestial bodies.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["green (adjective)","tail (noun)"],"phrases":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The adjective \"green-tailed\" is a descriptive term used to specify that something has a tail that is green. It's straightforward in its meaning and composition, combining the color \"green\" with the attribute of having a \"tail.\" While not a common word, its meaning is easily understood from its component parts. It is more likely to be encountered in descriptive contexts, such as nature writing or scientific descriptions of animals or celestial events."},"example_sentences":[{"sentence":"The field guide described the bird as having a distinctive green-tailed appearance.","translation":"そのフィールドガイドは、その鳥が特徴的な緑色の尾を持つ外観をしていると説明していた。","type":"general","meaning_category":"description"},{"sentence":"The artist painted a fantastical creature with a long, flowing green-tailed appendage.","translation":"そのアーティストは、長くたなびく緑色の尾を持つ幻想的な生き物を描いた。","type":"creative","meaning_category":"description"}]}