{"word":"mamzer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ法)不倫または近親相姦によって生まれた子供","english_definition":"(in Jewish law) a child born of a forbidden union, such as adultery or incest.","examples":[{"sentence":"According to Jewish law, a mamzer faces certain restrictions.","translation":"ユダヤ法によれば、マムゼルはある種の制限に直面する。"},{"sentence":"The status of a mamzer can have implications for marriage.","translation":"マムゼルの地位は結婚に影響を与える可能性がある。"}],"collocations":["Jewish law regarding mamzerim (マムゼルに関するユダヤ法)","status of a mamzer (マムゼルの地位)"],"synonyms":["illegitimate child","bastard (古語、侮蔑的)"],"antonyms":["legitimate child"]},{"part_of_speech":"noun","definition":"(比喩的に)のけ者、仲間はずれ、社会的に受け入れられない人","english_definition":"(figuratively) an outcast; someone who is socially unacceptable.","examples":[{"sentence":"He felt like a mamzer in the community because of his controversial views.","translation":"彼は物議を醸す見解のために、コミュニティの中でマムゼルのように感じた。"}],"collocations":["feel like a mamzer (マムゼルのように感じる)"],"synonyms":["outcast","pariah","reject","persona non grata"],"antonyms":["accepted member","insider"]}],"etymology":{"value":"ヘブライ語 מַמְזֵר (mamzer)に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːmzər/","syllables":"mam-zer"},"inflection":{"noun_plural":"mamzerim (ヘブライ語複数形) / mamzers (英語複数形)"},"usage_notes":{"explanation":"「**mamzer**」は、ユダヤ法において、不倫や近親相姦など、禁じられた関係から生まれた子供を指す言葉です。この言葉は、単に「私生児」を意味するだけでなく、ユダヤ教の伝統的な社会規範において特別な法的・社会的な地位を持つ人を指します。比喩的には、コミュニティから疎外された人、のけ者、社会的に受け入れられない人を指すこともあります。この言葉の使用は、文脈によっては非常にデリケートであり、注意が必要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a mamzer because his parents weren't married.","correct":"✓ He is not necessarily a mamzer just because his parents weren't married; it depends on the specific circumstances of his birth according to Jewish law.","note":"単に両親が結婚していなかったというだけではマムゼルとはみなされません。ユダヤ法では、不倫や近親相姦などの特定の状況下で生まれた子供のみがマムゼルとされます。"},{"incorrect":"✗ The term mamzer is a neutral term for an illegitimate child.","correct":"✓ The term mamzer carries significant social and religious implications within Jewish tradition and is not a neutral term.","note":"「mamzer」は単なる「私生児」を指す言葉ではなく、ユダヤ教の伝統において特別な意味合いを持ちます。中立的な言葉ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - ユダヤ教関連の文脈以外ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**mamzer**」は、ユダヤ法に特有の用語であり、一般的な英語の語彙ではありません。この単語は、不倫や近親相姦など、禁じられた関係から生まれた子供を指します。ユダヤ教の法的・社会的な文脈において重要な意味を持ちますが、日常会話や一般的な文章で使用されることはほとんどありません。この単語を使用する際は、ユダヤ教の伝統に対する理解と配慮が必要です。比喩的に「のけ者」を意味することがありますが、この用法は一般的ではありません。"},"example_sentences":[{"sentence":"The legal ramifications of being labeled a mamzer are complex and vary depending on the specific interpretation of Jewish law.","translation":"マムゼルとみなされることによる法的影響は複雑であり、ユダヤ法の具体的な解釈によって異なります。","type":"noun","meaning_category":"(ユダヤ法)不倫または近親相姦によって生まれた子供"},{"sentence":"He felt like a mamzer, excluded from the social circles of his peers due to his family's reputation.","translation":"彼は家族の評判のせいで、同世代の社会的な輪から排除され、マムゼルのように感じた。","type":"noun","meaning_category":"(比喩的に)のけ者、仲間はずれ"}]}