{"word":"teratologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"催奇形性学者、奇形研究者","english_definition":"A scientist who studies teratology, the study of abnormalities of physiological development.","examples":[{"sentence":"The teratologist examined the effects of the drug on fetal development.","translation":"その催奇形性学者は、その薬物が胎児の発達に及ぼす影響を調べた。"},{"sentence":"Teratologists study the causes and mechanisms of birth defects.","translation":"催奇形性学者は、先天性欠損症の原因とメカニズムを研究する。"}],"collocations":["developmental teratologist","clinical teratologist"],"synonyms":["developmental biologist","embryologist"],"antonyms":[]}],"etymology":{"value":"The word \"teratologist\" comes from \"teratology\", which is derived from the Greek words \"teras\" (monster, marvel) and \"logia\" (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛrəˈtɒlədʒɪst/","syllables":"te-ra-tol-o-gist"},"inflection":{"noun_plural":"teratologists"},"usage_notes":{"explanation":"A teratologist is a specialized scientist who focuses on the study of birth defects and abnormal development. Their work often involves identifying environmental factors, genetic predispositions, and other causes that can lead to developmental abnormalities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dermatologist, specializing in birth defects.","correct":"✓ He is a teratologist, specializing in birth defects.","note":"Dermatologists are skin specialists, while teratologists study birth defects."}],"priority":"★★☆"},"related_words":{"derivatives":["teratology (noun: 催奇形性学)","teratogenic (adjective: 催奇形性の)","teratogenesis (noun: 催奇形性発生)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"teratologist\" refers to a highly specialized scientist who studies birth defects and developmental abnormalities. This word is not commonly used in everyday conversation and is primarily found in scientific or medical contexts. Understanding the term requires knowledge of advanced biological and medical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"As a teratologist, she investigates the impact of environmental toxins on embryonic development.","translation":"催奇形性学者として、彼女は環境毒素が胚の発達に与える影響を調査している。","type":"general","meaning_category":"催奇形性学者"},{"sentence":"The teratologist presented her findings on the genetic causes of cleft palate.","translation":"その催奇形性学者は、口唇口蓋裂の遺伝的原因に関する彼女の発見を発表した。","type":"research","meaning_category":"奇形研究者"}]}