{"word":"fluorogen","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"蛍光物質、蛍光色素","english_definition":"A fluorescent substance; a chemical compound that exhibits fluorescence.","examples":[{"sentence":"Fluorescein is a common fluorogen used in microscopy.","translation":"フルオレセインは、顕微鏡検査で一般的に使用される蛍光物質です。"},{"sentence":"The fluorogen binds to the protein, allowing it to be visualized.","translation":"蛍光物質はタンパク質に結合し、可視化を可能にします。"}],"collocations":["fluorogen-activating protein (FAP)","synthetic fluorogen","small molecule fluorogen"],"synonyms":["fluorophore","fluorescent dye","fluorescent marker"],"antonyms":[]}],"etymology":{"value":"Derived from 'fluoro-' (referring to fluorescence) and '-gen' (a suffix indicating something that produces or generates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflʊərədʒən/","syllables":"flu-o-ro-gen"},"inflection":{"noun_plural":"fluorogens"},"usage_notes":{"explanation":"A fluorogen is a substance that emits light upon excitation by electromagnetic radiation (e.g., UV light). It is often used as a label or marker in biological and chemical applications. The term is sometimes used interchangeably with 'fluorophore,' though 'fluorophore' typically refers to the part of a molecule responsible for fluorescence, while 'fluorogen' can refer to the entire fluorescent compound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fluorogen was used to measure temperature.","correct":"✓ A fluorescent thermometer was used to measure temperature.","note":"Fluorogens themselves are not thermometers. They are fluorescent substances that can be used in temperature-sensitive applications, but a complete system (e.g., a fluorescent thermometer) is required."},{"incorrect":"✗ Fluorogen is a type of light.","correct":"✓ Fluorogen emits light when excited.","note":"Fluorogens do not constitute light themselves; they emit light when excited by another light source."}],"priority":"★★☆"},"related_words":{"derivatives":["fluorogenic (adjective: producing fluorescence)","fluorimetry (noun: the measurement of fluorescence)","fluorochrome (noun: a fluorescent dye)"],"related_terms":["fluorescence","fluorophore","excitation","emission","spectroscopy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'fluorogen' is specialized vocabulary primarily used in scientific fields, particularly in chemistry and biology. It refers to a substance that exhibits fluorescence, meaning it emits light when exposed to electromagnetic radiation. Understanding this term requires a background in scientific concepts related to light, molecules, and chemical compounds. It is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers designed a novel fluorogen for live cell imaging.","translation":"研究者たちは、生細胞イメージングのための新しい蛍光物質を設計した。","type":"noun","meaning_category":"蛍光物質"},{"sentence":"The intensity of the fluorogen's emission is proportional to the concentration of the target molecule.","translation":"蛍光物質の発光強度は、標的分子の濃度に比例する。","type":"noun","meaning_category":"蛍光物質"},{"sentence":"This fluorogen is highly sensitive to changes in pH.","translation":"この蛍光物質はpHの変化に非常に敏感である。","type":"noun","meaning_category":"蛍光物質"}]}