{"word":"sex-influenced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"性影響を受ける、性によって影響される","english_definition":"(genetics) relating to a trait that is expressed differently in males and females, even though the gene is not located on a sex chromosome.","examples":[{"sentence":"Pattern baldness is a sex-influenced trait; it's dominant in males but recessive in females.","translation":"男性型脱毛症は性影響を受ける形質であり、男性では優性ですが、女性では劣性です。"},{"sentence":"The expression of this gene is sex-influenced, meaning its effect depends on the individual's sex.","translation":"この遺伝子の発現は性影響を受けており、その効果は個人の性別によって異なります。"}],"collocations":["sex-influenced trait","sex-influenced gene","sex-influenced expression"],"synonyms":["sex-limited","sex-linked","gender-specific"],"antonyms":[]}],"etymology":{"value":"The term combines 'sex' (referring to biological sex) and 'influenced' (meaning affected or determined by). It describes a trait whose expression is modified by the individual's sex.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛks ˌɪnfluənst/","syllables":"sex-in-flu-enced"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Sex-influenced' traits are autosomal traits (not on sex chromosomes) where the expression of the trait differs between males and females. This difference can be in the degree of expression or whether the trait is dominant or recessive. It's important to distinguish this from 'sex-linked' traits, which are located on sex chromosomes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a sex-linked trait, so it's sex-influenced.","correct":"✓ This is a sex-influenced trait, not a sex-linked one.","note":"Sex-influenced traits are autosomal, while sex-linked traits are on sex chromosomes. They are not the same thing."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sex-linked","autosomal","dominant","recessive","gene expression","phenotype"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sex-influenced' is a technical term used in genetics to describe traits that are expressed differently in males and females, even though the gene responsible for the trait is not located on a sex chromosome. The key point is that the sex of the individual influences how the gene is expressed. This is different from 'sex-linked' traits, which are located on sex chromosomes. Understanding this term requires a solid foundation in genetics.","priority":"★★★"},"example_sentences":[{"sentence":"The inheritance of horns in some breeds of sheep is a classic example of a sex-influenced trait.","translation":"一部の羊の品種における角の遺伝は、性影響を受ける形質の典型的な例です。","type":"example","meaning_category":"genetics"},{"sentence":"Although both parents may carry the gene, the sex-influenced trait might only manifest in their sons.","translation":"両親が遺伝子を持っていても、性影響を受ける形質は息子にのみ現れる可能性があります。","type":"example","meaning_category":"genetics"}]}