{"word":"Plessor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)打診板：打診法で胸部や腹部を叩くために使用される小さな板。","english_definition":"(medicine) A small plate used in percussion to be struck in order to examine a patient's chest or abdomen.","examples":[{"sentence":"The doctor used a plessor and a pleximeter to examine the patient's lungs.","translation":"医者は打診板と打診器を使って患者の肺を診察した。"}],"collocations":["use a plessor","apply a plessor","percussion with a plessor"],"synonyms":["percussion plate","tapping plate"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'plesso' (πλήσσω) meaning 'to strike'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplɛsər/","syllables":"Ples-sor"},"inflection":{"noun_plural":"Plessors"},"usage_notes":{"explanation":"A plessor is used in conjunction with a pleximeter (a finger or another flat surface placed on the patient's body) to perform percussion. The plessor is struck against the pleximeter to produce sounds that help the physician assess the condition of the underlying tissues or organs. This technique is less commonly used now due to the availability of modern imaging techniques.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a pressure to examine the patient.","correct":"✓ The doctor used a plessor to examine the patient.","note":"'Plessor' is the correct term for the instrument used in percussion, not 'pressure'."}],"priority":"★★☆"},"related_words":{"derivatives":["percussion","plexigraph","plexometer"],"related_medical_terms":["auscultation","palpation","diagnosis"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Plessor' is a highly specialized medical term referring to a specific instrument used in the now less common practice of percussion during physical examinations. Understanding this term requires a background in medical terminology and practices, making it suitable for advanced learners or professionals in the medical field."},"example_sentences":[{"sentence":"The physician gently tapped the plessor against the patient's chest.","translation":"医師は患者の胸に打診板を優しく叩いた。","type":"medical","meaning_category":"instrument"},{"sentence":"Using the plessor, the doctor listened for changes in resonance.","translation":"打診板を使って、医師は共鳴音の変化を聞き取った。","type":"medical","meaning_category":"examination technique"}]}