{"word":"semivitrification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半ガラス化","english_definition":"The process or state of becoming partially vitrified; partial conversion into glass.","examples":[{"sentence":"The semivitrification of the ceramic material improved its strength.","translation":"そのセラミック材料の半ガラス化は強度を向上させた。"}],"collocations":[],"synonyms":["partial vitrification"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'semi-' (meaning half or partially) and 'vitrification' (the process of converting something into glass or a glass-like substance).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmɪˌvɪtrɪfɪˈkeɪʃən/","syllables":"se-mi-vi-tri-fi-ca-tion"},"inflection":{"noun_plural":"semivitrifications"},"usage_notes":{"explanation":"'Semivitrification' is a technical term primarily used in materials science, ceramics, and related fields. It describes a process where a material is partially converted into a glassy state, without achieving full vitrification. This is often done to improve certain properties of the material, such as strength or impermeability.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["semivitrified (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Semivitrification' is a highly technical term used in specific scientific and industrial contexts, particularly in materials science and ceramics. It refers to a process where a material is partially converted into a glassy state. Understanding this term requires a background in these fields, as it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The degree of semivitrification affects the final density of the product.","translation":"半ガラス化の程度は、製品の最終的な密度に影響を与える。","type":"noun","meaning_category":"半ガラス化"},{"sentence":"Careful control of temperature is essential during semivitrification.","translation":"半ガラス化中には、温度の慎重な制御が不可欠である。","type":"noun","meaning_category":"半ガラス化"}]}