{"word":"noninflammableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不燃性、難燃性","english_definition":"The property of not being easily ignited and burned; resistance to burning.","examples":[{"sentence":"The noninflammableness of the material makes it suitable for use in fire-resistant clothing.","translation":"その材料の不燃性により、耐火服での使用に適しています。"},{"sentence":"Testing the noninflammableness of building materials is crucial for safety.","translation":"建築材料の不燃性を試験することは、安全上重要です。"}],"collocations":["material noninflammableness","test for noninflammableness"],"synonyms":["fire resistance","flame resistance","incombustibility","noncombustibility","fireproofness"],"antonyms":["inflammability","flammability","combustibility"]}],"etymology":{"value":"Derived from \"non-\" (not), \"inflammable\" (easily set on fire), and \"-ness\" (state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪnˈflæməb(ə)lnəs/","syllables":"non-in-flam-ma-ble-ness"},"inflection":{"noun_plural":"noninflammabilities (rare)"},"usage_notes":{"explanation":"\"Noninflammableness\" refers to the quality of a substance that prevents it from catching fire and burning easily. It is an important property in materials used in construction, clothing, and other applications where fire safety is a concern. The term is often used in technical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The noninflammableness is important for safety.","correct":"✓ Noninflammability is important for safety.","note":"While \"noninflammableness\" is correct, \"noninflammability\" is more commonly used."}],"priority":"★★☆"},"related_words":{"derivatives":["noninflammable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"noninflammableness\" is a technical term used to describe the property of a material that is not easily ignited or burned. It is a less common variant of \"noninflammability\" or \"incombustibility,\" which are more frequently used. This term is typically encountered in scientific, engineering, or safety-related contexts when discussing fire resistance. Understanding this word is important for comprehending technical specifications and safety standards related to fire protection."},"example_sentences":[{"sentence":"The regulation requires a high degree of noninflammableness for insulation materials.","translation":"その規制では、断熱材に高度な不燃性が求められています。","type":"general","meaning_category":"general"},{"sentence":"The laboratory tested the noninflammableness of the new fabric.","translation":"研究所は新しい生地の不燃性を試験しました。","type":"technical","meaning_category":"technical"}]}