{"word":"Contravener","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律用語) 違反者、違反行為者","english_definition":"A person who contravenes a law, regulation, or agreement.","examples":[{"sentence":"The contravener of the building code was fined.","translation":"建築基準法違反者は罰金を科せられた。"},{"sentence":"The company was identified as a contravener of environmental regulations.","translation":"その会社は環境規制の違反者として特定された。"}],"collocations":["identified contravener","alleged contravener","potential contravener"],"synonyms":["violator","offender","transgressor","infringer"],"antonyms":["law-abiding citizen","complier"]}],"etymology":{"value":"Derived from the verb 'contravene,' which comes from Latin 'contra' (against) + 'venire' (to come). Thus, a contravener is someone who 'comes against' or acts in opposition to a law or rule.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒntrəˌviːnər/","syllables":"Con-tra-ven-er"},"inflection":{"noun_plural":"Contraveners"},"usage_notes":{"explanation":"'Contravener' is a formal and somewhat uncommon term, primarily used in legal or official contexts. It specifically refers to someone who violates or acts contrary to a law, regulation, or agreement. It is often used when identifying or referring to someone who has been found to be in violation of a specific rule or law.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a contravener of good manners.","correct":"✓ He is a violator of good manners.","note":"'Contravener' is typically used for formal laws or regulations, not general social norms. 'Violator' is more appropriate for manners or customs."},{"incorrect":"✗ The contravener was ignorance of the law.","correct":"✓ The contravener was ignorant of the law.","note":"'Contravener' is a noun (the person). 'Ignorance' is a noun, but the sentence requires the adjective 'ignorant' to describe the person."}],"priority":"★★☆"},"related_words":{"derivatives":["Contravene (verb): to violate or go against a law or rule.","Contravention (noun): the act of contravening; a violation."],"related_legal_terms":["Infringement","Breach","Violation","Offense"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'contravener' is a formal term used in legal and official contexts to describe someone who violates a law, regulation, or agreement. It is not commonly used in everyday conversation. Understanding the meaning and usage of 'contravener' is important for comprehending legal documents and discussions related to law enforcement and regulatory compliance. It is derived from the verb 'contravene,' which means to violate or go against a rule or law.","priority":"★★☆"},"example_sentences":[{"sentence":"The court identified him as the primary contravener in the fraud case.","translation":"裁判所は彼を詐欺事件の主要な違反者として特定した。","type":"noun","meaning_category":"Violator of law"},{"sentence":"As a contravener of the contract, she was required to pay damages.","translation":"契約違反者として、彼女は損害賠償を支払う必要があった。","type":"noun","meaning_category":"Breacher of agreement"},{"sentence":"The environmental group labeled the factory a contravener of pollution standards.","translation":"環境保護団体は、その工場を汚染基準の違反者として非難した。","type":"noun","meaning_category":"Violator of regulations"}]}