{"word":"thermoset","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱硬化性樹脂","english_definition":"A polymer that irreversibly cures upon heating, forming a rigid, infusible material.","examples":[{"sentence":"Epoxy is a common thermoset used in adhesives.","translation":"エポキシは接着剤によく使われる熱硬化性樹脂です。"},{"sentence":"Thermosets are known for their high strength and resistance to heat.","translation":"熱硬化性樹脂は、その高い強度と耐熱性で知られています。"}],"collocations":["epoxy thermoset","polyester thermoset","thermoset polymer","thermoset resin"],"synonyms":["thermosetting polymer","thermosetting resin"],"antonyms":["thermoplastic"]},{"part_of_speech":"adjective","definition":"熱硬化性の","english_definition":"Relating to or made from a thermosetting polymer.","examples":[{"sentence":"Thermoset plastics are often used in high-temperature applications.","translation":"熱硬化性プラスチックは、高温環境での用途によく使用されます。"},{"sentence":"The thermoset material provides excellent dimensional stability.","translation":"その熱硬化性材料は、優れた寸法安定性を提供します。"}],"collocations":["thermoset plastic","thermoset composite","thermoset molding"],"synonyms":["thermosetting"],"antonyms":["thermoplastic"]}],"etymology":{"value":"The term \"thermoset\" is derived from \"thermo-\" (heat) and \"set\" (to become rigid). It describes the irreversible setting or curing process that occurs when the material is heated.","priority":"★★☆"},"pronunciation":{"ipa":"ˈθɜːrmoʊˌsɛt/","syllables":"ther-mo-set"},"inflection":{"notes":"The noun is countable. The adjective does not inflect."},"usage_notes":{"explanation":"Thermosets undergo a chemical change during curing, forming a cross-linked network structure. This makes them resistant to melting or softening upon reheating, unlike thermoplastics. They are commonly used in applications requiring high strength, heat resistance, and chemical resistance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thermosets can be remolded after heating.","correct":"✓ Thermosets cannot be remolded after heating.","note":"Thermosets undergo an irreversible chemical change upon heating, so they cannot be remolded."},{"incorrect":"✗ Thermoset is a type of metal.","correct":"✓ Thermoset is a type of polymer/plastic.","note":"Thermosets are polymers, not metals."}],"priority":"★★☆"},"related_words":{"derivatives":["thermosetting (adjective, noun)","cure (verb, noun)","polymer (noun)","resin (noun)","cross-linking (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Thermoset\" refers to a type of polymer that, once heated and formed, cannot be melted and reshaped. This is because the heating process causes irreversible chemical bonds to form, creating a rigid network. This property makes thermosets suitable for applications requiring high strength and heat resistance. Common examples include epoxy resins and vulcanized rubber. Understanding the distinction between thermosets and thermoplastics is crucial in materials science and engineering.","priority":"★★☆"},"example_sentences":[{"sentence":"The car part was made from a durable thermoset composite.","translation":"その自動車部品は、耐久性のある熱硬化性複合材料で作られていました。","type":"adjective","meaning_category":"material"},{"sentence":"The thermoset's resistance to high temperatures makes it ideal for engine components.","translation":"その熱硬化性樹脂の高温に対する耐性は、エンジン部品に最適です。","type":"noun","meaning_category":"material"},{"sentence":"The process of curing the thermoset involves cross-linking the polymer chains.","translation":"熱硬化性樹脂の硬化プロセスには、ポリマー鎖の架橋が含まれます。","type":"noun","meaning_category":"process"}]}