{"word":"reconfiscating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再没収する、再び没収する","english_definition":"To confiscate again; to take possession of something for a second or subsequent time, usually by authority.","examples":[{"sentence":"The customs officials were reconfiscating goods that had been previously seized but illegally returned.","translation":"税関職員は、以前に押収されたが違法に返還された商品を再没収していた。"},{"sentence":"After the prisoner attempted to smuggle contraband back into the jail, the guards were reconfiscating his personal items.","translation":"囚人が刑務所に密輸品を持ち込もうとした後、警備員は彼の所持品を再没収していた。"}],"collocations":["reconfiscate goods (商品を再没収する)","reconfiscate items (品物を再没収する)","reconfiscate property (財産を再没収する)"],"synonyms":["reseize","reclaim","retake","impound again"],"antonyms":["return","release","restore"]}],"etymology":{"value":"The word 'reconfiscating' is derived from the prefix 're-' (meaning again), combined with the verb 'confiscate' (to take or seize with authority).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkənˈfɪskeɪtɪŋ/","syllables":"re-con-fis-cat-ing"},"inflection":{"verb_forms":{"present_simple":["reconfiscate","reconfiscates"],"past_simple":"reconfiscated","past_participle":"reconfiscated","present_participle":"reconfiscating"}},"usage_notes":{"explanation":"'Reconfiscating' implies a prior act of confiscation followed by a return or release, and then another act of confiscation. It is often used in legal or authoritative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The police are reconfiscating because they found new evidence.","correct":"✓ The police are reconfiscating the evidence because it was illegally returned.","note":"'Reconfiscating' requires that the item was previously confiscated and then returned before being confiscated again."}],"priority":"★★☆"},"related_words":{"derivatives":["reconfiscate (verb)","reconfiscation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reconfiscating' is a relatively rare and complex term. It implies that something was initially taken away by authority, then returned, and is now being taken away again. It's mostly used in formal or legal contexts to describe the act of seizing something more than once. Understanding the prefix 're-' and the base word 'confiscate' is essential to grasp its meaning. "},"example_sentences":[{"sentence":"The government is reconfiscating land that was improperly returned to private owners after the revolution.","translation":"政府は革命後、不適切に個人の所有者に返還された土地を再没収している。","type":"verb","meaning_category":"再び没収する"},{"sentence":"The school principal was reconfiscating cell phones from students who had been warned repeatedly.","translation":"校長は繰り返し警告されていた生徒から携帯電話を再没収していた。","type":"verb","meaning_category":"再び没収する"}]}