{"word":"radiolocators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A system or device that determines the location of something by means of radio waves.","english_definition":"Systems or devices that determine the location of something by means of radio waves.","examples":[{"sentence":"The radiolocators pinpointed the location of the missing aircraft.","translation":"無線測位装置は、行方不明の航空機の位置を特定しました。"}],"collocations":["use radiolocators","pinpoint location with radiolocators"],"synonyms":["radio direction finder","RDF","radio finder"],"antonyms":[]}],"etymology":{"value":"Derived from 'radio' (referring to radio waves) and 'locator' (something that locates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdioʊloʊˈkeɪtərz/","syllables":"ra-di-o-lo-ca-tors"},"inflection":{"noun_plural":"radiolocators"},"usage_notes":{"explanation":"'Radiolocators' refers to a system or device that uses radio waves to determine the location of an object or person. It's often used in navigation, search and rescue, and military applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiolocator are used to track the vehicle.","correct":"✓ The radiolocators are used to track the vehicle.","note":"'Radiolocators' is a plural noun, so it requires a plural verb ('are')."},{"incorrect":"✗ Radiolocator is very precise.","correct":"✓ Radiolocators are very precise.","note":"Since we are referring to the system in general, the plural form is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["radiolocate (verb)","radiolocation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiolocators' is a technical term referring to systems or devices that use radio waves to find the location of something. It's not a common word in everyday conversation but is used in technical or specialized contexts such as aviation, maritime navigation, or military operations. Understanding this term requires familiarity with radio technology and location-finding techniques."},"example_sentences":[{"sentence":"The ship's radiolocators helped it navigate through dense fog.","translation":"船の無線測位装置は、濃い霧の中を航行するのに役立ちました。","type":"noun","meaning_category":"location determination"},{"sentence":"Search and rescue teams rely on radiolocators to find people lost in remote areas.","translation":"捜索救助隊は、遠隔地で行方不明になった人々を見つけるために無線測位装置に頼っています。","type":"noun","meaning_category":"search and rescue"}]}