{"word":"uncored","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"芯を取り除かれていない、または芯がない","english_definition":"Not having the core removed; lacking a core.","examples":[{"sentence":"The apple pie was made with uncored apples, giving it a slightly different texture.","translation":"そのアップルパイは芯を取り除いていないリンゴで作られていたので、少し違った食感になっていた。"},{"sentence":"An uncored sample can provide a more complete picture of the material's composition.","translation":"芯を抜いていないサンプルは、材料の組成のより完全な全体像を提供できる。"}],"collocations":["uncored apple","uncored sample"],"synonyms":["whole","intact"],"antonyms":["cored"],"notes":"Often used in the context of fruits, vegetables, or geological samples."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'cored' (having the core removed).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkɔːrd/","syllables":"un-cored"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more uncored, most uncored), although these are less common."},"usage_notes":{"explanation":"'Uncored' is primarily used to describe something that has not had its central part (the core) removed. This is most often used in reference to fruits like apples or pears, but can also apply to geological samples or other materials where a central core might typically be extracted.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncored apple tasted better than the cored one. (Implies all uncored apples taste better)","correct":"✓ This uncored apple tasted better than the cored one.","note":"When comparing specific items, use 'this' or another determiner to avoid generalizing."}],"priority":"★★☆"},"related_words":{"derivatives":["core","cored","coring"],"related_terms":["apple corer","geological core"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Uncored' is a relatively uncommon word, mainly used in specific contexts like cooking or geology. It simply means that the central part, or core, of something has not been removed. Understanding the meaning of 'core' is essential to understanding 'uncored'."},"example_sentences":[{"sentence":"The recipe calls for uncored pears, which adds a slightly bitter flavor.","translation":"そのレシピでは芯を取っていない梨を使うように指示されており、それが少し苦い風味を加える。","type":"general"},{"sentence":"The geologists analyzed the uncored sediment sample to determine its age.","translation":"地質学者たちは、その堆積物の芯を抜いていないサンプルを分析して、その年代を特定した。","type":"technical"}]}