{"word":"Megalopterous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(昆虫学) 広翅目の、脈翅亜目に属する","english_definition":"(entomology) Belonging or pertaining to the order Megaloptera (alderflies, dobsonflies, and fishflies).","examples":[{"sentence":"The megalopterous insects are characterized by their large, net-veined wings.","translation":"広翅目の昆虫は、大きく網状の翅脈を持つことで特徴付けられる。"},{"sentence":"Dobsonflies are a well-known example of megalopterous insects.","translation":"オオアゴキンクロハバチは、広翅目の昆虫のよく知られた例である。"}],"collocations":["megalopterous insect","megalopterous larvae"],"synonyms":["alderfly-like","dobsonfly-like"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek μέγας (mégas, \"large, great\") + πτερόν (pterón, \"wing\") + -ous.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛɡəˈlɒptərəs/","syllables":"meg-a-lop-ter-ous"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms."},"usage_notes":{"explanation":"The term \"megalopterous\" is primarily used in entomology to describe insects belonging to the order Megaloptera. It highlights the characteristic large wings of these insects. The term is not commonly used outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The megalopterous creature flew across the sky (when referring to a bird).","correct":"✓ The bird flew across the sky.","note":"Megalopterous refers specifically to insects of the order Megaloptera, not to any large winged creature."}],"priority":"★★☆"},"related_words":{"derivatives":["Megaloptera (noun: the order of insects including alderflies, dobsonflies, and fishflies)"],"related_terms":["Neuroptera (related order of insects)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"megalopterous\" is a technical term used in entomology, the study of insects. It describes insects that belong to the order Megaloptera, which includes alderflies, dobsonflies, and fishflies. These insects are characterized by their large, net-veined wings. Because it is a scientific term, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The scientist studied the megalopterous specimens collected from the river.","translation":"科学者は川から採取した広翅目の標本を研究した。","type":"general","meaning_category":"広翅目の"},{"sentence":"Megalopterous larvae are often aquatic predators.","translation":"広翅目の幼虫は、しばしば水生捕食者である。","type":"general","meaning_category":"広翅目の"}]}