{"word":"preemotionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"感情が起こる前に、感情的な状態になる前に","english_definition":"Before experiencing emotions; in a state prior to emotional involvement.","examples":[{"sentence":"Preemotionally, the situation seemed manageable, but once feelings surfaced, it became overwhelming.","translation":"感情が起こる前は、その状況は対処可能に見えたが、感情が表面化すると、手に負えなくなった。"},{"sentence":"He assessed the problem preemotionally, ensuring his judgment wasn't clouded by sentiment.","translation":"彼は感情に左右されないように、感情が起こる前に問題を評価した。"}],"collocations":["assess preemotionally","analyze preemotionally","react preemotionally"],"synonyms":["rationally","logically","objectively","dispassionately"],"antonyms":["emotionally","subjectively","passionately"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning 'before') to 'emotionally'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪˈmoʊʃənəli/","syllables":"pree-e-mo-shuh-nal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The term 'preemotionally' is used to describe a state or action taken before emotions come into play. It emphasizes objectivity and rationality in decision-making or assessment. It is not a commonly used word, so its usage should be clear from the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted preemotionally and regretted it later.","correct":"✓ He acted emotionally and regretted it later.","note":"Acting 'preemotionally' implies acting without emotion, which is different from acting 'emotionally' and regretting it. The mistake is in using the word to describe an action driven by emotion, which is the opposite of its intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["preemotional (adjective)","emotionally (adverb)","emotion (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Preemotionally' is a less common adverb that describes doing something before emotions affect your judgment. It suggests a focus on logic and reason, avoiding being swayed by feelings. It's often used in contexts where objectivity is important. "},"example_sentences":[{"sentence":"She approached the negotiation preemotionally to ensure a fair outcome.","translation":"彼女は公平な結果を確実にするために、感情的になる前に交渉に臨んだ。","type":"adverb","meaning_category":"Before emotions"},{"sentence":"The data was analyzed preemotionally to avoid bias in the results.","translation":"結果の偏りを避けるために、データは感情的になる前に分析された。","type":"adverb","meaning_category":"Without emotional influence"}]}