{"word":"claviature","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鍵盤楽器の鍵盤配列、鍵盤の総称","english_definition":"The keyboard of a musical instrument, especially an organ or harpsichord; the arrangement of keys on a keyboard instrument.","examples":[{"sentence":"The claviature of the organ was beautifully crafted.","translation":"そのオルガンの鍵盤配列は美しく作られていた。"},{"sentence":"He practiced diligently on the claviature.","translation":"彼は鍵盤楽器の練習に励んだ。"}],"collocations":["organ claviature","harpsichord claviature","practice on the claviature"],"synonyms":["keyboard","manual","keydesk"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'clavis' meaning 'key'. The term evolved in the context of keyboard instruments to refer to the arrangement or set of keys.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklæviətʃər/","syllables":"cla-vi-a-ture"},"inflection":{"noun_plural":"claviatures"},"usage_notes":{"explanation":"'Claviature' is a somewhat formal or technical term, primarily used in the context of keyboard instruments such as organs, harpsichords, and sometimes pianos. It refers not just to the individual keys, but to the entire arrangement or set of keys as a unit. It's less commonly used in everyday conversation compared to the more general term 'keyboard'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He played the claviature with a guitar pick.","correct":"✓ He played the keyboard with a guitar pick.","note":"'Claviature' refers to the entire keyboard arrangement, not the act of playing. Use 'keyboard' for the act of playing. "},{"incorrect":"✗ The claviature was digital.","correct":"✓ The keyboard was digital.","note":"Use 'keyboard' when referring to a digital instrument's keys."}],"priority":"★☆☆"},"related_words":{"derivatives":["clavichord (名詞: クラビコード)"],"phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'claviature' is a specialized term used primarily in the context of music, specifically referring to the keyboard arrangement of instruments like organs and harpsichords. It is less common in everyday language and more frequently encountered in formal or technical discussions about music. Understanding this term requires a familiarity with musical terminology and a higher level of vocabulary. "},"example_sentences":[{"sentence":"The organist skillfully navigated the complex claviature of the cathedral's grand instrument.","translation":"オルガニストは、大聖堂の壮大な楽器の複雑な鍵盤配列を巧みに操作した。","type":"noun","meaning_category":"鍵盤配列"},{"sentence":"The harpsichord's claviature had a lighter touch compared to the modern piano.","translation":"そのハープシコードの鍵盤配列は、現代のピアノに比べて軽いタッチだった。","type":"noun","meaning_category":"鍵盤の総称"}]}