{"word":"Whipper-in","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（狩猟で）猟犬の群れを統率する助手","english_definition":"an assistant to the huntsman in a hunt, responsible for keeping the hounds together and in order.","examples":[{"sentence":"The whipper-in rode ahead to scout the terrain.","translation":"ウィッパーインは地形を偵察するために先頭を走った。"},{"sentence":"The huntsman relied on the whipper-in to control the pack.","translation":"狩人は、猟犬の群れを制御するためにウィッパーインを頼りにした。"}],"collocations":["hunt","hounds","huntsman","pack","riding","fox hunting"],"synonyms":["dog handler","hunt assistant"],"antonyms":[]}],"etymology":{"value":"The term 'whipper-in' comes from the practice of using a whip to keep the hounds in line during a hunt.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪpər ɪn/","syllables":"whip-per-in"},"inflection":{"noun_plural":"whippers-in"},"usage_notes":{"explanation":"The term 'whipper-in' is primarily associated with traditional fox hunting and similar hunting activities where hounds are used to track and pursue game. The whipper-in's role is crucial in ensuring the hounds remain focused and do not stray from the hunt.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["whipping (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'whipper-in' is a specialized term related to fox hunting and is not commonly used in everyday language. It requires an understanding of hunting terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"As the fox darted into the woods, the whipper-in urged the hounds forward.","translation":"キツネが森に飛び込むと、ウィッパーインは猟犬に前進を促した。","type":"general","meaning_category":"Hunting"},{"sentence":"The whipper-in's skill was essential in maintaining the cohesion of the pack during the challenging hunt.","translation":"困難な狩猟の間、ウィッパーインのスキルは群れの結束を維持するために不可欠だった。","type":"general","meaning_category":"Hunting"}]}