{"word":"savacu","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Dominican Republic) A type of basket traditionally made from palm leaves, used for carrying goods or as a decorative item.","english_definition":"A traditional basket made from palm leaves in the Dominican Republic, used for carrying goods or as a decorative item.","examples":[{"sentence":"She carried the fruits in a savacu.","translation":"彼女はサバクの中に果物を入れて運んだ。"},{"sentence":"The savacu is a symbol of Dominican craftsmanship.","translation":"サバクはドミニカの職人技の象徴です。"}],"collocations":["carry in a savacu","Dominican savacu","palm leaf savacu"],"synonyms":["basket","canasta"],"antonyms":[]}],"etymology":{"value":"Likely derived from an indigenous Taino word. Taino was the language spoken by the native inhabitants of the Dominican Republic before European colonization.","priority":"★★☆"},"pronunciation":{"ipa":"/saˈβaku/","syllables":"sa-va-cu"},"inflection":{"noun_plural":"savacus"},"usage_notes":{"explanation":"The word 'savacu' is primarily used in the Dominican Republic and among those familiar with Dominican culture. It refers specifically to a type of basket made from palm leaves, often used in rural areas. It is not a widely known term outside of this context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a savacu made of plastic.","correct":"✓ I bought a basket made of plastic.","note":"Savacus are traditionally made from palm leaves, so using other materials would not be accurate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'savacu' is a specialized term related to Dominican culture. Understanding its meaning requires knowledge of specific cultural artifacts from the Dominican Republic. It is unlikely to be encountered in general English conversation or text.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artisan demonstrated how to weave a savacu.","translation":"職人はサバクの編み方を実演した。","type":"noun","meaning_category":"basket"},{"sentence":"Savacus are often sold as souvenirs in the Dominican Republic.","translation":"サバクはドミニカ共和国でよくお土産として売られている。","type":"noun","meaning_category":"basket"}]}