{"word":"peripateticate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare, humorous) to walk about; to travel from place to place, especially working or based in various places for relatively short periods.","english_definition":"(rare, humorous) To travel from place to place, especially working or based in various places for relatively short periods.","examples":[{"sentence":"He decided to peripateticate around Europe for a year after graduating.","translation":"彼は卒業後、一年間ヨーロッパをあちこち歩き回ることに決めた。"},{"sentence":"The professor peripateticated between several universities, lecturing at each for a semester.","translation":"その教授は数大学を巡回し、各大学で一学期間講義を行った。"}],"collocations":["peripateticate around","peripateticate between"],"synonyms":["wander","travel","roam","ramble","peregrinate"],"antonyms":["settle","remain","stay"]}],"etymology":{"value":"Formed from 'peripatetic' (walking about or traveling) + '-ate' (a verb-forming suffix). 'Peripatetic' itself comes from the Greek word 'peripatētikos', meaning 'walking about,' referring to Aristotle's habit of walking while teaching at the Lyceum in ancient Athens.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪpəˈtɛtɪkeɪt/","syllables":"per-i-pa-tet-i-cate"},"inflection":{"verb_forms":{"present_simple":["peripateticate","peripateticates"],"past_simple":"peripateticated","past_participle":"peripateticated","present_participle":"peripateticating"}},"usage_notes":{"explanation":"'Peripateticate' is a rare and somewhat humorous verb that means to travel from place to place, often for work or study, staying in each place for a relatively short time. It is derived from the adjective 'peripatetic,' which refers to Aristotle's practice of walking while teaching. The verb is not commonly used in modern English and may be considered jocular or archaic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He peripateticated a book.","correct":"✓ He peripateticated around the city.","note":"'Peripateticate' is an intransitive verb, meaning it does not take a direct object. It describes the act of moving around, not acting upon something."}],"priority":"★★☆"},"related_words":{"derivatives":["peripatetic (adjective, noun)","peripatetically (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Peripateticate' is a very rare and somewhat humorous verb that means to travel from place to place, especially for work or study, staying in each place for a relatively short time. It is derived from the adjective 'peripatetic,' which refers to Aristotle's practice of walking while teaching. Due to its rarity, it is not commonly used in modern English and may be considered jocular or archaic. It is more common to use phrases like 'travel around,' 'move between places,' or 'work in various locations' to convey the same meaning."},"example_sentences":[{"sentence":"The traveling salesman peripateticated through the countryside, selling his wares.","translation":"その旅回りのセールスマンは田舎を歩き回り、商品を売った。","type":"verb","meaning_category":"travel from place to place"},{"sentence":"As a consultant, she peripateticated between different offices each week.","translation":"コンサルタントとして、彼女は毎週異なるオフィスを巡回した。","type":"verb","meaning_category":"travel from place to place"}]}