{"word":"synecphonesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ギリシア語・ラテン語の韻律における)隣接する母音または二重母音の発音結合","english_definition":"The merging of two adjacent vowels or diphthongs into a single syllable, especially in Greek and Latin prosody.","examples":[{"sentence":"Synecphonesis can alter the scansion of a line of verse.","translation":"シネックフォネシスは詩行の韻律を変えることがある。"},{"sentence":"The word 'deinde' often undergoes synecphonesis in Latin poetry.","translation":"「deinde」という単語はラテン詩でしばしばシネックフォネシスを起こす。"}],"collocations":["occur in poetry","affect scansion"],"synonyms":["synizesis","crasis","elision"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek συνεκφώνησις (sunekphōnēsis), from συν- (sun-, “together”) + ἐκφώνησις (ekphōnēsis, “pronunciation”).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪnɛkfoʊˈniːsɪs/","syllables":"sy-nec-pho-ne-sis"},"inflection":{"noun_plural":"synecphoneses"},"usage_notes":{"explanation":"Synecphonesis is a technical term primarily used in the study of classical languages, particularly Greek and Latin. It refers to the merging of two vowel sounds into one syllable within a word, which can affect the rhythm and meter of poetry. This phenomenon is important for understanding the scansion (analysis of metrical structure) of classical verse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Synecphonesis is a type of metaphor.","correct":"✓ Synecphonesis is a phonetic phenomenon.","note":"Synecphonesis is related to pronunciation, not figurative language like metaphor."}],"priority":"★★☆"},"related_words":{"derivatives":["synecphonetic (adjective)"],"phrasal_verbs":[],"related_terms":["synizesis","crasis","elision"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized academic vocabulary)","frequency_google_ngram":"Very low frequency - a technical term used in linguistics and classical studies.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Synecphonesis' is a specialized term used in the study of classical languages like Greek and Latin. It describes a phonetic process where two vowels next to each other in a word are pronounced as one syllable. This affects how a line of poetry is scanned or analyzed for its rhythm. Understanding this term is important for those studying classical literature and linguistics.","example_sentences":[]}}