{"word":"keyboard-driven","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"キーボード操作を主体とする、キーボード操作に特化した","english_definition":"Primarily controlled or operated using a keyboard, rather than a mouse or other input device.","examples":[{"sentence":"This application is keyboard-driven, allowing users to perform most tasks without using a mouse.","translation":"このアプリケーションはキーボード操作を主体としており、ユーザーはマウスを使わずにほとんどのタスクを実行できます。"},{"sentence":"Many developers prefer keyboard-driven workflows for increased efficiency.","translation":"多くの開発者は、効率を高めるためにキーボード操作を主体とするワークフローを好みます。"},{"sentence":"A keyboard-driven interface can be more accessible for users with motor impairments.","translation":"キーボード操作を主体とするインターフェースは、運動機能に障害のあるユーザーにとってよりアクセスしやすい場合があります。"}],"collocations":["keyboard-driven application","keyboard-driven interface","keyboard-driven workflow","keyboard-driven navigation"],"synonyms":["keyboard-centric","keyboard-oriented"],"antonyms":["mouse-driven","GUI-based","touch-based"]}],"etymology":{"value":"The word is formed by combining 'keyboard' (the input device) with 'driven' (meaning controlled or operated by).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːbɔːrd ˌdrɪvn/","syllables":"key-board-dri-ven"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (e.g., plural, comparative)."},"usage_notes":{"explanation":"'Keyboard-driven' describes software, interfaces, or workflows that are designed to be primarily controlled using a keyboard. This often implies that the user can perform most or all actions using keyboard shortcuts and commands, rather than relying on a mouse or other pointing device. It is often associated with efficiency, accessibility, and power-user workflows.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is keyboard driven by the user.","correct":"✓ The software is keyboard-driven.","note":"'Keyboard-driven' is an adjective describing the software itself, not an action performed by the user."},{"incorrect":"✗ He is a keyboard driven person.","correct":"✓ He prefers keyboard-driven applications.","note":"The term typically describes software or interfaces, not people. You can say someone 'prefers keyboard-driven applications' or 'is proficient in keyboard-driven workflows'."}],"priority":"★★☆"},"related_words":{"derivatives":["keyboard (noun)","driven (adjective)"],"phrasal_verbs":[],"related_terms":["command-line interface (CLI)","keyboard shortcut","hotkey","accessibility","workflow","user interface (UI)","graphical user interface (GUI)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Keyboard-driven' is a compound adjective used to describe something that is primarily operated using a keyboard. It implies that the user can control the system or application effectively using keyboard shortcuts and commands, often without needing to use a mouse. This term is commonly used in technical discussions about software, user interfaces, and accessibility. Understanding this term requires familiarity with computing concepts and technical vocabulary."},"example_sentences":[{"sentence":"The Vim text editor is a classic example of a keyboard-driven application.","translation":"Vimテキストエディタは、キーボード操作を主体とするアプリケーションの典型的な例です。","type":"general","meaning_category":"Definition"},{"sentence":"We designed the new software to be keyboard-driven to improve productivity for our users.","translation":"ユーザーの生産性を向上させるために、新しいソフトウェアをキーボード操作を主体とするように設計しました。","type":"design","meaning_category":"Design"},{"sentence":"Keyboard-driven navigation is essential for users who cannot use a mouse.","translation":"キーボード操作を主体とするナビゲーションは、マウスを使用できないユーザーにとって不可欠です。","type":"accessibility","meaning_category":"Accessibility"}]}