{"word":"Crippleness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不自由、身体障害、手足の不自由な状態","english_definition":"The state or condition of being crippled; the condition of being disabled or having severely limited mobility, especially in the legs or feet.","examples":[{"sentence":"The crippleness made it difficult for him to climb stairs.","translation":"その不自由さのために、彼は階段を上るのが困難だった。"},{"sentence":"He overcame his crippleness through physical therapy.","translation":"彼は理学療法によって身体の不自由を克服した。"},{"sentence":"The disease caused crippleness in many of its victims.","translation":"その病気は多くの犠牲者に身体障害を引き起こした。"}],"collocations":["overcome crippleness","suffer from crippleness","cause crippleness"],"synonyms":["disability","lameness","immobility","infirmity","handicap"],"antonyms":["ability","mobility","health","fitness"]}],"etymology":{"value":"Derived from 'cripple' (Middle English), which comes from Old English 'crypel', meaning 'one who creeps'. The suffix '-ness' denotes a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪpəlˌnəs/","syllables":"crip-ple-ness"},"inflection":{"noun_plural":"cripplenesses (rarely used)"},"usage_notes":{"explanation":"'Crippleness' refers to the state of being severely disabled, often specifically referring to limitations in the legs or feet. The term can be considered outdated and potentially offensive in some contexts, as it emphasizes the disability rather than the person. More respectful terms like 'disability' or 'physical impairment' are often preferred.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a crippleness in his arm.","correct":"✓ He has a disability in his arm.","note":"While 'crippleness' generally refers to leg or foot disabilities, 'disability' is a more general term that can apply to any part of the body."},{"incorrect":"✗ The crippleness of the old man was sad.","correct":"✓ The disability of the old man was sad.","note":"Using 'disability' is generally more respectful and less stigmatizing than 'crippleness'."}],"priority":"★★☆"},"related_words":{"derivatives":["cripple (verb, noun)","crippled (adjective)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crippleness' is a noun that describes the state of being severely disabled, especially with limited mobility in the legs or feet. It is derived from the word 'cripple'. However, it's important to note that this term can be considered offensive or outdated in many contexts. More respectful and modern terms like 'disability' or 'physical impairment' are generally preferred to avoid stigmatizing individuals with disabilities. The term is not commonly used in everyday conversation or writing."},"example_sentences":[{"sentence":"The long-term effects of the illness included crippleness.","translation":"その病気の長期的な影響には、身体の不自由が含まれていた。","type":"general","meaning_category":"disability"},{"sentence":"The organization worked to improve the lives of those living with crippleness.","translation":"その組織は、身体の不自由を抱えて生きる人々の生活を改善するために活動した。","type":"general","meaning_category":"disability"},{"sentence":"Despite his crippleness, he led a full and active life.","translation":"彼は身体が不自由であるにもかかわらず、充実した活動的な生活を送った。","type":"general","meaning_category":"disability"}]}