{"word":"hysterogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)ヒステリーを引き起こす、ヒステリー性の発作を引き起こす","english_definition":"Capable of causing hysteria or hysterical attacks.","examples":[{"sentence":"The doctor suspected a hysterogenic zone on the patient's body.","translation":"医師は患者の体にヒステリー性の発作を引き起こす可能性のある部位があるのではないかと疑った。"},{"sentence":"Certain types of stress can be hysterogenic in predisposed individuals.","translation":"特定の種類のストレスは、素因のある人にヒステリーを引き起こす可能性がある。"}],"collocations":["hysterogenic zone","hysterogenic stimulus","hysterogenic effect"],"synonyms":["hysteria-inducing","hysteria-provoking"],"antonyms":["non-hysterogenic"]}],"etymology":{"value":"Derived from the Greek words 'hystera' (womb) and 'genesis' (origin, creation), reflecting the historical belief that hysteria originated in the womb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstəroʊˈdʒɛnɪk/","syllables":"his-ter-o-gen-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'hysterogenic' is primarily used in a medical context, often in historical or specialized discussions about hysteria and related conditions. It refers to something that can trigger hysterical symptoms or attacks. The term's usage has decreased as understanding of mental health has evolved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was hysterogenic for all viewers.","correct":"✓ The movie was disturbing for many viewers.","note":"'Hysterogenic' is a medical term and not generally used to describe common emotional reactions to media. 'Disturbing' or 'upsetting' would be more appropriate. "}],"priority":"★☆☆"},"related_words":{"derivatives":["hysteria","hysterical","hysterically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hysterogenic' is a highly specialized medical term rarely encountered outside of medical or historical texts. It describes something capable of inducing hysteria, a term itself less frequently used in modern medical practice. Understanding requires a strong grasp of medical terminology and historical context."},"example_sentences":[{"sentence":"The physician identified a specific touch as hysterogenic for the patient.","translation":"医師は特定の接触が患者にとってヒステリー性の発作を引き起こすことを特定した。","type":"adjective","meaning_category":"medical"},{"sentence":"Early theories of hysteria often focused on hysterogenic areas of the body.","translation":"ヒステリーに関する初期の理論は、しばしば体のヒステリーを引き起こす部位に焦点を当てていた。","type":"adjective","meaning_category":"historical medical"}]}