{"word":"protopyramid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピラミッドの原型、初期のピラミッド構造","english_definition":"An early form of pyramid, typically a stepped structure or a simple mound, preceding the true pyramid shape.","examples":[{"sentence":"The Step Pyramid of Djoser is considered a protopyramid, representing an important stage in pyramid development.","translation":"ジェセル王の階段ピラミッドは、ピラミッドの発展における重要な段階を示す、ピラミッドの原型とみなされています。"},{"sentence":"Archaeologists have discovered several protopyramids in various parts of the world.","translation":"考古学者たちは、世界の様々な場所でいくつかのピラミッドの原型を発見しました。"}],"collocations":["step protopyramid","early protopyramid","ancient protopyramid"],"synonyms":["stepped pyramid","mound pyramid","early pyramid"],"antonyms":["true pyramid","smooth-sided pyramid"]}],"etymology":{"value":"\"proto-\" (最初の、原型) + \"pyramid\" (ピラミッド)","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtoʊˈpɪrəmɪd/","syllables":"pro-to-pyr-a-mid"},"inflection":{"noun_plural":"protopyramids"},"usage_notes":{"explanation":"\"Protopyramid\" refers to early pyramid structures that are not true pyramids in the classical sense (i.e., smooth-sided pyramids). These structures often take the form of stepped pyramids or simple mounds. The term is primarily used in archaeology and Egyptology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The protopyramid is the same as a regular pyramid.","correct":"✓ The protopyramid is an early form of a pyramid, not the same as a regular pyramid.","note":"Protopyramids are distinct from regular, smooth-sided pyramids. They represent an earlier stage of development."}],"priority":"★★☆"},"related_words":{"derivatives":["protodynastic (形容詞:王朝以前の)"],"related_terms":["pyramid","step pyramid","mastaba","tumulus","ziggurat"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"protopyramid\" is a specialized term used in archaeology and Egyptology to describe early forms of pyramid structures that predate the classical, smooth-sided pyramids. Understanding this term requires some familiarity with architectural history and archaeological terminology."},"example_sentences":[{"sentence":"The archaeological site contains the remains of a large protopyramid.","translation":"その遺跡には、巨大なピラミッドの原型の残骸があります。","type":"noun","meaning_category":"ピラミッドの原型"},{"sentence":"Scholars debate the purpose and construction techniques of protopyramids.","translation":"学者たちは、ピラミッドの原型の目的と建設技術について議論しています。","type":"noun","meaning_category":"ピラミッドの原型"}]}