{"word":"hot-rolled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"熱間圧延された","english_definition":"(of metal) processed by hot rolling.","examples":[{"sentence":"Hot-rolled steel is cheaper than cold-rolled steel.","translation":"熱間圧延鋼は冷間圧延鋼よりも安価です。"},{"sentence":"The hot-rolled process allows for larger shapes to be formed.","translation":"熱間圧延プロセスにより、より大きな形状を成形できます。"}],"collocations":["hot-rolled steel","hot-rolled coil","hot-rolled plate"],"synonyms":["thermally processed","hot-formed"],"antonyms":["cold-rolled"]},{"part_of_speech":"verb","definition":"熱間圧延する (hot-roll の過去分詞)","english_definition":"past participle of hot-roll: to process (metal) by hot rolling.","examples":[{"sentence":"The steel was hot-rolled to the desired thickness.","translation":"鋼は希望の厚さに熱間圧延されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Hot' + 'rolled'. Refers to the process of rolling metal at a high temperature.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɒt ˈroʊld/","syllables":"hot-rolled"},"inflection":{"notes":"Inflexible. Adjective and past participle form."},"usage_notes":{"explanation":"'Hot-rolled' describes metal (typically steel) that has been rolled at a high temperature, above its recrystallization temperature. This makes the metal easier to form and results in a product with less precise dimensions and a rougher surface finish compared to cold-rolled metal. It is generally cheaper to produce than cold-rolled steel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ hot rolled steel is more stronger than cold rolled steel.","correct":"✓ hot-rolled steel is stronger than cold-rolled steel.","note":"'Stronger' is the correct comparative form of 'strong'."},{"incorrect":"✗ The hot rolled steel has a smooth surface.","correct":"✓ The hot-rolled steel has a rougher surface.","note":"Hot-rolled steel typically has a rougher surface finish compared to cold-rolled steel."}],"priority":"★★☆"},"related_words":{"derivatives":["hot-rolling (noun)","hot-roll (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hot-rolled' is a technical term used in metallurgy and manufacturing to describe metal that has been formed by passing it through rollers at a high temperature. The high temperature makes the metal more malleable, allowing for larger shapes to be created. However, the process results in less precise dimensions and a rougher surface finish compared to cold-rolled metal. The term is commonly encountered in engineering, construction, and manufacturing contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The engineers specified hot-rolled steel for the building's frame.","translation":"エンジニアは建物のフレームに熱間圧延鋼を指定しました。","type":"adjective","meaning_category":"Material Specification"},{"sentence":"The metal was hot-rolled before being cut into sheets.","translation":"金属はシートに切断される前に熱間圧延されました。","type":"verb (past participle)","meaning_category":"Manufacturing Process"}]}