{"word":"twice-trained","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"trained two times; having received training on two separate occasions or in two distinct areas.","english_definition":"Having undergone training on two separate occasions or in two different fields.","examples":[{"sentence":"The twice-trained athlete excelled in both swimming and running.","translation":"二度訓練を受けたその選手は、水泳とランニングの両方で優れた成績を収めた。"},{"sentence":"As a twice-trained engineer, she was proficient in both mechanical and electrical systems.","translation":"二度の訓練を受けたエンジニアとして、彼女は機械システムと電気システムの両方に精通していた。"},{"sentence":"The twice-trained dog could perform both search and rescue tasks.","translation":"二度の訓練を受けた犬は、捜索と救助の両方のタスクを実行できた。"}],"collocations":["twice-trained athlete","twice-trained professional","twice-trained specialist"],"synonyms":["double-trained","multiply-trained"],"antonyms":["untrained","single-trained"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"trained\" (having undergone training).","priority":"N/A"},"pronunciation":{"ipa":"/ˌtwaɪs ˈtreɪnd/","syllables":"twice-trained"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"The term \"twice-trained\" emphasizes that an individual or animal has received training on two separate occasions, or in two distinct areas of expertise. This often implies a higher level of skill or versatility compared to someone who has only been trained once or in a single area.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a twice training professional.","correct":"✓ He is a twice-trained professional.","note":"Use the past participle \"trained\" as an adjective."}],"priority":"N/A"},"related_words":{"derivatives":["training"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"twice-trained\" is relatively straightforward, indicating that someone has received training on two separate occasions or in two different areas. It is generally used in professional or technical contexts to highlight a person's enhanced skills or qualifications due to their additional training. The word is easily understood by native English speakers but may not be commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The twice-trained doctor specialized in both cardiology and oncology.","translation":"二度の訓練を受けた医師は、心臓病学と腫瘍学の両方を専門としていた。","type":"adjective","meaning_category":"Dual Expertise"},{"sentence":"The company preferred to hire twice-trained technicians who could handle multiple tasks.","translation":"会社は、複数のタスクを処理できる二度の訓練を受けた技術者を雇用することを好んだ。","type":"adjective","meaning_category":"Versatility"},{"sentence":"The twice-trained security guard was proficient in both surveillance and self-defense.","translation":"二度の訓練を受けた警備員は、監視と自己防衛の両方に精通していた。","type":"adjective","meaning_category":"Enhanced Skills"}]}