{"word":"laevorotation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"左旋性：偏光面を左に回転させる性質","english_definition":"The property of rotating the plane of polarization of light to the left (counterclockwise) as observed by someone facing the oncoming radiation.","examples":[{"sentence":"The laevorotation of the molecule was confirmed by polarimetry.","translation":"その分子の左旋性は、旋光度測定によって確認された。"}],"collocations":["exhibit laevorotation","measure laevorotation"],"synonyms":["levorotation","left-handed rotation"],"antonyms":["dextrorotation"]}],"etymology":{"value":"Derived from the Latin word 'laevus' meaning 'left' and 'rotation' referring to the turning or rotating of something.","priority":"★★☆"},"pronunciation":{"ipa":"ˌliːvəʊroʊˈteɪʃən/","syllables":"le-vo-ro-ta-tion"},"inflection":{"noun_plural":"laevorotations"},"usage_notes":{"explanation":"Laevorotation is a term used in chemistry and physics to describe the property of certain substances to rotate the plane of polarized light to the left (counterclockwise). This property is observed using a polarimeter. Substances exhibiting laevorotation are called laevorotatory or levorotatory. The term is often used interchangeably with 'levorotation'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solution has a laevorotatory effect to the right.","correct":"✓ The solution has a laevorotatory effect to the left.","note":"Laevorotatory substances rotate polarized light to the left, not the right."}],"priority":"★★☆"},"related_words":{"derivatives":["laevorotatory (adjective)","levorotatory (adjective)","levorotation (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Laevorotation' is a technical term used in chemistry and physics. It refers to the property of a substance to rotate the plane of polarized light counterclockwise. This is a concept typically encountered in advanced science courses. Understanding requires knowledge of polarized light and molecular chirality."},"example_sentences":[{"sentence":"The compound exhibits strong laevorotation.","translation":"その化合物は強い左旋性を示す。","type":"general","meaning_category":"general"},{"sentence":"The specific laevorotation of the sample was determined.","translation":"そのサンプルの比旋光度が決定された。","type":"technical","meaning_category":"technical"}]}