{"word":"Sylvaner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シルヴァーナー：白ワイン用ブドウ品種、およびそれから作られるワイン","english_definition":"A variety of white wine grape grown primarily in the Alsace region of France and in Germany, and the wine made from this grape.","examples":[{"sentence":"Sylvaner is often used to produce dry, aromatic white wines.","translation":"シルヴァーナーは、しばしば辛口で香り高い白ワインの製造に使用されます。"},{"sentence":"Alsace Sylvaner is known for its crisp acidity.","translation":"アルザスのシルヴァーナーは、そのキレのある酸味で知られています。"}],"collocations":["Alsace Sylvaner","German Sylvaner","dry Sylvaner","aromatic Sylvaner"],"synonyms":["Grüner Silvaner"],"antonyms":[]}],"etymology":{"value":"The name 'Sylvaner' is believed to be derived from the Latin word 'silva,' meaning 'forest' or 'wood.' This may refer to the grape's origins in Central Europe, which was historically heavily forested.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪlˈveɪnər/","syllables":"Sil-va-ner"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"Sylvaner is a white grape variety that is most commonly associated with the Alsace region of France and Germany. It typically produces dry, crisp white wines with subtle aromas of citrus, herbs, and minerals. While not as widely planted as other white grape varieties like Riesling or Chardonnay, Sylvaner can produce high-quality wines that are well-suited for pairing with food.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sylvaner are a red grape.","correct":"✓ Sylvaner is a white grape.","note":"Sylvaner is a white grape variety, not a red one."},{"incorrect":"✗ I prefer Sylvaner wines with sweet taste.","correct":"✓ I prefer Sylvaner wines with dry taste.","note":"Sylvaner wines are typically dry, not sweet."}],"priority":"★☆☆"},"related_words":{"derivatives":["Silvaner (German spelling)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Sylvaner is a term primarily used within the context of wine appreciation and viticulture. Understanding its usage requires familiarity with wine terminology and regional wine production, particularly in Alsace and Germany. The word is not commonly encountered in general conversation or literature.","priority":"★☆☆"},"example_sentences":[{"sentence":"We enjoyed a bottle of chilled Sylvaner with our seafood dinner.","translation":"シーフードディナーとともに、冷やしたシルヴァーナーのボトルを楽しみました。","type":"noun","meaning_category":"ワイン"},{"sentence":"The sommelier recommended a Sylvaner from Alsace to complement the dish.","translation":"ソムリエは、料理に合うようにアルザス産のシルヴァーナーを勧めました。","type":"noun","meaning_category":"ワイン"},{"sentence":"Sylvaner grapes are known for their high acidity and subtle flavors.","translation":"シルヴァーナーのブドウは、高い酸味と繊細な風味で知られています。","type":"noun","meaning_category":"ブドウ品種"}]}