{"word":"Coeltera","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Hypothetical) A large, habitable space colony or generation ship, conceived as a self-contained world.","english_definition":"A hypothetical, large, habitable space colony or generation ship, conceived as a self-contained world. Often envisioned as a rotating cylinder or sphere.","examples":[{"sentence":"The concept of a Coeltera is often explored in science fiction.","translation":"コエルテラという概念は、SFでよく探求されます。"},{"sentence":"Building a Coeltera would require immense technological advancements.","translation":"コエルテラを建設するには、莫大な技術的進歩が必要となるでしょう。"}],"collocations":["generation ship","space colony","rotating habitat","O'Neill cylinder","Stanford torus"],"synonyms":["space habitat","artificial world","worldship"],"antonyms":[]}],"etymology":{"value":"A neologism, likely combining 'coel-' (referring to the heavens or space) with elements suggesting 'terra' (Earth) or 'shelter'. The exact origin and etymological breakdown are not widely documented.","priority":"★☆☆"},"pronunciation":{"ipa":"/koʊlˈtɪərə/","syllables":"Coel-te-ra"},"inflection":{"noun_plural":"Coelteras"},"usage_notes":{"explanation":"'Coeltera' is a relatively rare term, primarily used within science fiction and speculative engineering contexts. It describes a very large-scale project, far beyond current technological capabilities. It is often used interchangeably with 'generation ship', although 'Coeltera' can also refer to a permanent space colony rather than a vessel for interstellar travel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coeltera was built last year.","correct":"✓ The concept of a coeltera is being studied.","note":"Since Coelteras are currently hypothetical, avoid stating they have been built. Focus on discussing the concept or potential construction."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["O'Neill cylinder","Stanford torus","Dyson sphere","generation ship","space colonization","terraforming"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (technical/rare)","frequency_google_ngram":"Very low frequency. Primarily found in science fiction and technical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coeltera' is a highly specialized term used in science fiction and advanced engineering contexts. Understanding requires familiarity with concepts of space colonization, generation ships, and large-scale artificial habitats. The term is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The novel depicted life aboard a Coeltera, generations into its journey.","translation":"その小説は、コエルテラでの生活を、その旅の何世代にもわたって描いていました。","type":"general","meaning_category":"Hypothetical Space Colony"},{"sentence":"Engineers are studying the feasibility of constructing a Coeltera using asteroid materials.","translation":"エンジニアたちは、小惑星の材料を使ってコエルテラを建設する可能性を研究しています。","type":"technical","meaning_category":"Hypothetical Space Colony"}]}