{"word":"Fuggier","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A member of the Fugger family, a prominent German banking and mercantile dynasty during the 15th and 16th centuries.","english_definition":"A member of the Fugger family, a prominent German banking and mercantile dynasty during the 15th and 16th centuries.","examples":[{"sentence":"Jakob Fugger was a famous Fuggier.","translation":"ヤコブ・フッガーは有名なフッガー家の一員でした。"},{"sentence":"The Fuggiers were known for their wealth and influence.","translation":"フッガー家の人々は、その富と影響力で知られていました。"}],"collocations":["Fugger family","Jakob Fugger","Anton Fugger"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the surname \"Fugger,\" which originated in the Swabia region of Germany. The etymology of the name itself is uncertain, but it may be related to the Middle High German word \"fucker,\" referring to a weaver or someone who works with textiles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʊɡər/","syllables":"Fug-gi-er"},"inflection":{"noun_plural":"Fuggiers"},"usage_notes":{"explanation":"The term \"Fuggier\" specifically refers to a member of the Fugger family. The Fuggers were a highly influential family in European history, known for their banking and trading activities. They played a significant role in financing the Habsburg emperors and other European rulers. The family's wealth and power made them one of the most important families in Europe during their time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Fugger's.","correct":"✓ He is a Fuggier.","note":"The correct term for a member of the Fugger family is 'Fuggier,' not 'Fugger's'."}],"priority":"★★☆"},"related_words":{"derivatives":["Fugger (surname)","Fuggerei (a social housing complex founded by the Fugger family in Augsburg, Germany)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (historical term)","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Fuggier\" is a historical term referring to a member of the Fugger family, a prominent banking and mercantile dynasty in 15th and 16th century Germany. Understanding this term requires knowledge of European history and the role of the Fugger family in it. The word is not commonly used in modern English outside of historical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Fuggier** family controlled much of the European economy during the Renaissance.","translation":"フッガー家はルネサンス期にヨーロッパ経済の多くを支配していました。","type":"noun","meaning_category":"Historical Figure"},{"sentence":"As a **Fuggier**, he had access to vast amounts of capital.","translation":"フッガー家の一員として、彼は莫大な資本を利用することができました。","type":"noun","meaning_category":"Historical Figure"}]}