{"word":"behaviorism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"行動主義","english_definition":"a theory of learning based on the idea that all behaviors are acquired through conditioning, and conditioning occurs through interaction with the environment.","examples":[{"sentence":"Behaviorism dominated psychology in the early 20th century.","translation":"行動主義は20世紀初頭の心理学を支配した。"},{"sentence":"Skinner was a leading figure in behaviorism.","translation":"スキナーは行動主義の主要な人物だった。"},{"sentence":"Behaviorism emphasizes observable behaviors rather than internal mental states.","translation":"行動主義は、内部の精神状態よりも観察可能な行動を重視する。"}],"collocations":["classical behaviorism","radical behaviorism","methodological behaviorism","cognitive behaviorism","behaviorism therapy"],"synonyms":["behavioral psychology","stimulus-response psychology"],"antonyms":["cognitive psychology","Gestalt psychology","psychoanalysis"]}],"etymology":{"value":"\"Behaviorism\" comes from the word \"behavior\", plus the suffix \"-ism\", which indicates a doctrine, principle, or theory.","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈheɪvjərɪzəm/","syllables":"be-hav-ior-ism"},"inflection":{"notes":"It's a noun, so it doesn't inflect."},"usage_notes":{"explanation":"Behaviorism is a school of thought in psychology that focuses on observable behaviors rather than internal mental processes. It suggests that behavior is learned through interactions with the environment, primarily through classical and operant conditioning. It was a dominant force in psychology for much of the 20th century, but has since been supplemented by cognitive and other perspectives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Behaviorism believe that thoughts are important.","correct":"✓ Behaviorism believes that thoughts are not the primary focus.","note":"Behaviorism focuses on observable behaviors, not thoughts or internal mental states."},{"incorrect":"✗ Behaviorism is only about animals.","correct":"✓ Behaviorism applies to both animals and humans.","note":"While animal studies were important in the development of behaviorism, it also applies to human behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["behavioral (adjective)","behaviorally (adverb)","behaviorist (noun)"],"phrases":["classical conditioning","operant conditioning","stimulus-response","reinforcement","punishment"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Behaviorism is a theoretical approach in psychology that emphasizes the role of environmental factors in shaping behavior. It posits that behavior is learned through conditioning processes, such as associating stimuli with responses or through reinforcement and punishment. This perspective contrasts with approaches that prioritize internal mental states or cognitive processes. The term is primarily used in academic and professional contexts related to psychology, education, and related fields.","priority":"★★☆"},"example_sentences":[{"sentence":"Early behaviorism rejected the study of consciousness.","translation":"初期の行動主義は意識の研究を拒否した。","type":"general","meaning_category":"definition"},{"sentence":"Cognitive behaviorism combines principles of behaviorism with cognitive psychology.","translation":"認知行動主義は、行動主義の原理と認知心理学を組み合わせたものである。","type":"general","meaning_category":"definition"},{"sentence":"Behaviorism has had a significant impact on educational practices.","translation":"行動主義は教育実践に大きな影響を与えてきた。","type":"general","meaning_category":"impact"}]}