{"word":"rifle-bird","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フウチョウ科の鳥 (主にオーストラリアとニューギニアに生息)","english_definition":"Any of several birds of the family Paradisaeidae, native to Australia and New Guinea, especially those of the genus Ptiloris, the males of which have iridescent plumage and perform elaborate courtship displays.","examples":[{"sentence":"The male rifle-bird displays his magnificent plumage to attract a mate.","translation":"オスのライフルバードは、メスを引きつけるために見事な羽毛を披露する。"},{"sentence":"Rifle-birds are known for their loud, distinctive calls.","translation":"ライフルバードは、大きく特徴的な鳴き声で知られている。"}],"collocations":["Victoria's riflebird","Paradise riflebird","courtship display of a rifle-bird","iridescent plumage of a rifle-bird"],"synonyms":["bird-of-paradise"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的) オーストラリアの植民地時代に、ライフル銃を持った志願兵","english_definition":"(historical) In colonial Australia, a volunteer soldier armed with a rifle.","examples":[{"sentence":"The rifle-birds were called upon to defend the colony.","translation":"ライフルバード隊は、植民地を守るために召集された。"}],"collocations":["colonial rifle-birds","volunteer rifle-birds"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"rifle-bird\" is believed to come from the resemblance of the male bird's call to the sound of a rifle being fired, or from the resemblance of the black plumage of some species to the uniform of riflemen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪfəl bɜːrd/","syllables":"ri-fle-bird"},"inflection":{"noun_plural":"rifle-birds"},"usage_notes":{"explanation":"The term \"rifle-bird\" primarily refers to birds of the family Paradisaeidae, specifically those in the genus *Ptiloris*. These birds are known for the elaborate courtship displays of the males, who use their iridescent plumage to attract females. The historical meaning refers to volunteer soldiers in colonial Australia, but this usage is now rare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ rifle bird","correct":"✓ rifle-bird","note":"The correct spelling includes a hyphen. "},{"incorrect":"✗ The rifle-bird is a type of parrot.","correct":"✓ The rifle-bird is a type of bird-of-paradise.","note":"Rifle-birds are related to birds-of-paradise, not parrots."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Victoria's riflebird (Ptiloris victoriae)","Paradise riflebird (Ptiloris paradiseus)","Magnificent riflebird (Ptiloris magnificus)","Albert's riflebird (Ptiloris alberti)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"rifle-bird\" primarily refers to a specific group of birds-of-paradise found in Australia and New Guinea. These birds are known for their striking appearance and elaborate courtship rituals. The term may also refer to a historical military unit in colonial Australia, but this usage is much less common. Understanding the context is key to interpreting the meaning of \"rifle-bird\" correctly."},"example_sentences":[{"sentence":"The male Victoria's rifle-bird is a sight to behold during its courtship display.","translation":"オスのビクトリアライフルバードは、求愛行動中に見る価値がある。","type":"noun","meaning_category":"Bird"},{"sentence":"The rifle-birds were instrumental in defending the early settlements.","translation":"ライフルバード隊は、初期の入植地を守る上で重要な役割を果たした。","type":"noun","meaning_category":"Historical military unit"}]}