{"word":"Cagot","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(歴史的な蔑称) カゴ、ピレネー山脈周辺地域に住んでいた、差別されていた集団の一員","english_definition":"(historical, derogatory) A member of a group of people, the Cagots, who were discriminated against and lived in the Pyrenees region of France and Spain.","examples":[{"sentence":"The Cagots were often forced to live in segregated communities.","translation":"カゴはしばしば隔離されたコミュニティに住むことを強制された。"},{"sentence":"Many theories exist about the origin of the Cagots, but none are definitively proven.","translation":"カゴの起源については多くの説が存在するが、決定的に証明されたものはない。"}],"collocations":["Cagot community","Cagot origin","Cagot discrimination"],"synonyms":["Pariah","Outcast","Untouchable"],"antonyms":[]}],"etymology":{"value":"語源は不明確。いくつかの説がある。一つは、「cagot」が「犬」を意味するガスコーニュ語の「ca gas」または「cani goth」に由来するという説。また、「goth」に関連付ける説もあるが、確証はない。","priority":"中"},"pronunciation":{"ipa":"/ˈkæɡɒt/","syllables":"Ca-got"},"inflection":{"notes":"複数形はCagots"},"usage_notes":{"explanation":"「Cagot」は、歴史的にピレネー山脈周辺地域（主にフランスとスペイン）に住んでいた集団を指す言葉であり、強い差別的な意味合いを持ちます。彼らは中世から近代にかけて、社会から疎外され、特定の職業に制限され、隔離された場所に住むことを強制されるなど、様々な差別を受けました。現代では、この言葉はほとんど使われず、歴史的な文脈でのみ言及されることが一般的です。使用する際には、その差別的な意味合いを十分に理解し、慎重に扱う必要があります。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Cagot, so he must be a bad person.","correct":"✓ The Cagots were historically subjected to discrimination.","note":"「Cagot」という言葉は、人を中傷するために使うべきではありません。歴史的な文脈で使用し、差別的な意味合いを理解することが重要です。"},{"incorrect":"✗ The Cagots still live in segregated communities today.","correct":"✓ The historical discrimination against the Cagots is a reminder of the importance of fighting prejudice.","note":"現代では、Cagotに対する差別は解消されつつあります。歴史的な事実を伝えることが重要です。"}],"priority":"中"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「Cagot」は、歴史的な文脈でのみ使用される非常に特殊な単語です。ピレネー山脈周辺地域に住んでいた、差別された集団を指し、強い否定的な意味合いを持ちます。現代ではほとんど使われず、差別や偏見の問題を議論する際に言及されることがあります。使用する際には、その歴史的背景と差別的な意味合いを十分に理解する必要があります。"},"example_sentences":[{"sentence":"The history of the Cagots is a tragic example of social exclusion.","translation":"カゴの歴史は、社会的排除の悲劇的な例である。","type":"noun","meaning_category":"歴史的な集団"},{"sentence":"Researching the Cagots provides insights into the roots of prejudice.","translation":"カゴの研究は、偏見の根源への洞察を提供する。","type":"noun","meaning_category":"歴史的な集団"}]}