{"word":"functionalist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"機能主義者（社会学、心理学、建築など）","english_definition":"A person who adheres to functionalism, a theory or doctrine that emphasizes the practical functions of things, especially in sociology, psychology, and architecture.","examples":[{"sentence":"As a functionalist, he believed that all aspects of society serve a purpose.","translation":"機能主義者として、彼は社会のあらゆる側面が目的を果たすと信じていた。"},{"sentence":"The functionalist architect designed buildings with a focus on utility and efficiency.","translation":"その機能主義の建築家は、実用性と効率に重点を置いて建物を設計した。"}],"collocations":["functionalist theory","functionalist perspective","functionalist approach","functionalist sociology","functionalist architecture"],"synonyms":["structural functionalist"],"antonyms":[]},{"part_of_speech":"adjective","definition":"機能主義の、機能主義的な","english_definition":"Relating to or characteristic of functionalism.","examples":[{"sentence":"The functionalist design of the building prioritized practicality over aesthetics.","translation":"その建物の機能主義的なデザインは、美学よりも実用性を優先した。"},{"sentence":"Functionalist explanations in sociology focus on the role of institutions in maintaining social order.","translation":"社会学における機能主義的な説明は、社会秩序を維持する上での制度の役割に焦点を当てる。"}],"collocations":["functionalist design","functionalist approach","functionalist perspective","functionalist explanation","functionalist analysis"],"synonyms":["utilitarian","practical","efficient"],"antonyms":["ornamental","decorative","dysfunctional"]}],"etymology":{"value":"\"Functional\" + \"-ist\". \"Functional\" comes from \"function,\" which originates from Latin \"fungi\" meaning \"to perform, execute.\" The suffix \"-ist\" indicates a person who believes in or practices something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌŋkʃənəlɪst/","syllables":"func-tion-al-ist"},"inflection":{"noun_plural":"functionalists"},"usage_notes":{"explanation":"The term \"functionalist\" is used across various disciplines, including sociology, psychology, and architecture. In sociology, it refers to someone who believes in functionalism, a theory that sees society as a system of interconnected parts working together to maintain stability. In psychology, it refers to a historical school of thought that focused on the mental processes and their adaptive functions. In architecture, it refers to a style that emphasizes practicality and utility over aesthetics. The adjective \"functionalist\" describes something that is related to or characteristic of functionalism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a functionist.","correct":"✓ He is a functionalist.","note":"The correct term is \"functionalist,\" not \"functionist.\""},{"incorrect":"✗ Functionalist architecture is always ugly.","correct":"✓ Functionalist architecture prioritizes utility over aesthetics, but it can still be beautiful.","note":"While functionalist architecture prioritizes utility, it doesn't necessarily mean it's always ugly. Aesthetics can still be considered, but practicality is the primary focus."}],"priority":"★★☆"},"related_words":{"derivatives":["functionalism","functionally"],"related_terms":["structuralism","conflict theory","symbolic interactionism","behaviorism","gestalt psychology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"functionalist\" is primarily used in academic contexts, particularly in sociology, psychology, and architecture. It refers to someone who adheres to the principles of functionalism, which emphasizes the practical functions of things and the interconnectedness of different parts of a system. Understanding this term requires familiarity with these academic disciplines and their theoretical frameworks. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The **functionalist** perspective in sociology views society as a complex system whose parts work together to promote solidarity and stability.","translation":"社会学における機能主義的視点は、社会を、その部分が連帯と安定を促進するために協力して働く複雑なシステムと見なす。","type":"adjective","meaning_category":"機能主義の"},{"sentence":"Many **functionalists** believe that social inequality is necessary for society to function efficiently.","translation":"多くの機能主義者は、社会的不平等は社会が効率的に機能するために必要であると信じている。","type":"noun","meaning_category":"機能主義者"},{"sentence":"The **functionalist** architect designed the school to maximize space and minimize costs.","translation":"その機能主義の建築家は、スペースを最大化し、コストを最小限に抑えるように学校を設計した。","type":"adjective","meaning_category":"機能主義の"}]}