{"word":"odograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"走行距離自動記録計、走行路程記録計","english_definition":"An instrument for automatically recording the distance and direction traveled by a vehicle.","examples":[{"sentence":"The odograph traced the route of the expedition.","translation":"その走行路程記録計は探検隊のルートを記録した。"},{"sentence":"Scientists used an odograph to map the terrain.","translation":"科学者たちは地形を地図化するために走行路程記録計を使用した。"}],"collocations":["use an odograph","trace a route with an odograph","calibrate an odograph"],"synonyms":["distance recorder","path recorder","route plotter"],"antonyms":[]}],"etymology":{"value":"From Greek ὁδός (hodos, \"way, path, road\") + -graph (denoting an instrument for recording).","priority":"★★☆"},"pronunciation":{"ipa":"ˈoʊdəˌɡræf","syllables":"o-do-graph"},"inflection":{"noun_plural":"odographs"},"usage_notes":{"explanation":"An odograph is a relatively specialized instrument, primarily used in surveying, mapping, and navigation. It automatically records the distance traveled and the direction of travel, typically producing a map or a record of the route. It is distinct from an odometer, which only measures distance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car's odograph showed 100 miles.","correct":"✓ The car's odometer showed 100 miles.","note":"An odometer measures the distance traveled by a vehicle. An odograph records both distance and direction, and is not typically found in standard vehicles."}],"priority":"★★☆"},"related_words":{"derivatives":["odography (the use of an odograph)"],"related_terms":["odometer (distance measuring device)","compass (direction finding device)","surveying equipment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'odograph' refers to a specialized instrument that automatically records the distance and direction a vehicle travels, creating a map or route record. It's a technical term mainly used in surveying, mapping, and navigation contexts. The key distinction is that it records both distance and direction, unlike a common odometer which only measures distance. Due to its specific application, it's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The surveyors relied on the odograph to accurately map the winding paths of the forest.","translation":"測量技師たちは、森林の曲がりくねった道を正確に地図化するために、走行路程記録計に頼った。","type":"noun","meaning_category":"route recording"},{"sentence":"Early odographs were mechanical devices, but modern versions often incorporate GPS technology.","translation":"初期の走行路程記録計は機械式の装置だったが、現代版ではGPS技術が組み込まれていることが多い。","type":"noun","meaning_category":"instrument"},{"sentence":"By analyzing the odograph's data, researchers could reconstruct the animal's migratory patterns.","translation":"走行路程記録計のデータを分析することで、研究者たちは動物の移動パターンを再構築することができた。","type":"noun","meaning_category":"data analysis"}]}