{"word":"unencysted","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"No longer enclosed in a cyst; freed from a cyst.","english_definition":"Having emerged from a cyst; no longer enclosed or encapsulated.","examples":[{"sentence":"The unencysted parasites are now free to move and infect other cells.","translation":"嚢から解放された寄生虫は、自由に移動して他の細胞に感染することができます。"},{"sentence":"After the treatment, the unencysted amoebae were observed in the sample.","translation":"治療後、嚢から解放されたアメーバがサンプル中に観察されました。"}],"collocations":["unencysted amoeba","unencysted parasite","unencysted form"],"synonyms":["free","liberated","released","excysted"],"antonyms":["encysted"],"related_words":["encystment","excystation","cyst"],"notes":"This term is primarily used in biology and medicine to describe the process where an organism or cell emerges from its protective cyst.","priority":"medium"}],"etymology":{"value":"Formed from the prefix 'un-' (not) and 'encysted' (enclosed in a cyst).","priority":"low"},"pronunciation":{"ipa":"/ˌʌnɪnˈsɪstɪd/","syllables":"un-en-cyst-ed"},"inflection":{"adjective_forms":{"comparative":"more unencysted","superlative":"most unencysted"}},"usage_notes":{"explanation":"'Unencysted' describes the state of an organism or cell after it has emerged from a cyst. Cysts are protective coverings that some organisms form to survive harsh conditions. The process of emerging from a cyst is called excystation.","priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'unencysted' is a technical term primarily used in biology and medicine. It describes the state of an organism or cell that has emerged from a cyst, which is a protective outer covering. Understanding this word requires familiarity with biological concepts related to cysts and their function. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers studied the behavior of the unencysted bacteria.","translation":"研究者たちは、嚢から解放された細菌の挙動を研究しました。","type":"scientific","meaning_category":"biology"},{"sentence":"Only the unencysted form of the parasite is capable of causing infection.","translation":"寄生虫の嚢から解放された形態のみが感染を引き起こす可能性があります。","type":"medical","meaning_category":"medicine"}]}