{"word":"Masoretic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"マソラ学の、マソラ本文の","english_definition":"Relating to or characteristic of the Masoretes or the Masoretic Text.","examples":[{"sentence":"Masoretic scholars meticulously preserved the Hebrew Bible.","translation":"マソラ学者は、ヘブライ語聖書を細心の注意を払って保存した。"},{"sentence":"The Masoretic Text is the standard version of the Hebrew Bible used today.","translation":"マソラ本文は、今日使用されているヘブライ語聖書の標準版である。"}],"collocations":["Masoretic Text","Masoretic scholars","Masoretic tradition"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Masoretes, the group of Jewish scholars who worked between the 7th and 10th centuries AD to standardize the text of the Hebrew Bible. The word 'Masoretic' comes from 'Masorah' (מָסוֹרָה), meaning 'tradition' in Hebrew.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmæsəˈrɛtɪk/","syllables":"Ma-so-ret-ic"},"inflection":{},"usage_notes":{"explanation":"'Masoretic' is primarily used in historical, religious, and academic contexts when discussing the Hebrew Bible. It refers specifically to the work and traditions of the Masoretes, who added vowel points, cantillation marks, and other notations to the consonantal text of the Hebrew Bible to ensure its accurate pronunciation and preservation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Masoretic is a book.","correct":"✓ The Masoretic Text is a version of the Hebrew Bible.","note":"'Masoretic' is an adjective; 'Masoretic Text' is the noun phrase referring to the standardized text."}],"priority":"★★☆"},"related_words":{"derivatives":["Masorete (noun): A member of the group of Jewish scholars known as the Masoretes.","Masorah (noun): The body of traditions and notations added to the Hebrew Bible by the Masoretes."],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Masoretic' is specialized and typically encountered in academic or religious contexts related to the Hebrew Bible. Understanding requires familiarity with the history of the Hebrew Bible's transmission and the role of the Masoretes in standardizing its text.","priority":"★★☆"},"example_sentences":[{"sentence":"The Dead Sea Scrolls provide a comparison to the Masoretic Text.","translation":"死海文書は、マソラ本文との比較を提供する。","type":"general","meaning_category":"General usage"},{"sentence":"The Masoretic vocalization helps in the correct pronunciation of Hebrew words.","translation":"マソラの発音記号は、ヘブライ語の正しい発音に役立つ。","type":"linguistic","meaning_category":"Linguistic context"}]}