{"word":"eternalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"永遠主義、永久主義：時間は過去、現在、未来のすべての時点が等しく現実であるとする哲学的立場。","english_definition":"(philosophy) The philosophical position that all points in time – past, present, and future – are equally real, as opposed to presentism (only the present is real) or the growing block theory (the past and present are real).","examples":[{"sentence":"Eternalism implies that the future is already determined, just as the past is.","translation":"永遠主義は、過去がすでに決定されているのと同じように、未来もすでに決定されていることを意味する。"},{"sentence":"The debate between eternalism and presentism is central to the philosophy of time.","translation":"永遠主義と現在主義の間の議論は、時間の哲学の中心である。"}],"collocations":["philosophy of time (時間の哲学)","presentism (現在主義)","block universe (ブロック宇宙)","spacetime (時空)","four-dimensionalism (四次元主義)"],"synonyms":["four-dimensionalism","block universe theory"],"antonyms":["presentism","growing block theory","possibilism"]},{"part_of_speech":"noun","definition":"（特定の文脈において）永遠の存在、永遠の価値を信じること。","english_definition":"Belief in eternal existence or values (in specific contexts).","examples":[{"sentence":"His art reflects an eternalism, seeking to capture timeless beauty.","translation":"彼の芸術は永遠の美しさを捉えようとする永遠主義を反映している。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Eternal\"（永遠の）+ \"-ism\"（主義）から派生。時間の哲学における特定の理論を指す言葉として使われるようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈtɜːrnəlɪzəm/","syllables":"e-ter-nal-ism"},"inflection":{"notes":"名詞なので複数形は\"eternalisms\"ですが、抽象的な概念を指す場合は通常単数形で使用されます。"},"usage_notes":{"explanation":"Eternalismは、時間の哲学における専門用語であり、日常会話ではほとんど使われません。哲学、物理学、特に時間に関する議論で現れることが多いです。Eternalismの概念は、時間の流れに対する私たちの直感的な理解とは異なるため、理解するのが難しい場合があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Eternalism is a religion.","correct":"✓ Eternalism is a philosophical theory about the nature of time.","note":"Eternalismは宗教ではなく、哲学的な理論です。"},{"incorrect":"✗ I believe in eternalism because I want to live forever.","correct":"✓ Eternalism doesn't necessarily imply personal immortality, but rather that all moments in time are equally real.","note":"Eternalismは個人の永遠の命を意味するものではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["eternal (形容詞: 永遠の)","eternally (副詞: 永遠に)"],"phrases":["block universe","spacetime","four-dimensionalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学、物理学などの専門分野に限られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Eternalism**」は、時間の哲学で使われる専門的な言葉で、時間の中のすべての瞬間（過去、現在、未来）が同じように現実であるという考え方を指します。これは、私たちが普段感じている「時間が流れる」という感覚とは少し違うかもしれません。この考え方では、未来はすでに決まっていて、過去と同じように存在していると考えます。哲学や物理学を深く学ぶときに目にする言葉です。"},"example_sentences":[{"sentence":"According to eternalism, the past, present, and future all exist simultaneously.","translation":"永遠主義によれば、過去、現在、未来はすべて同時に存在する。","type":"noun","meaning_category":"哲学的概念"},{"sentence":"Eternalism is often contrasted with presentism, which holds that only the present is real.","translation":"永遠主義は、現在のみが現実であると主張する現在主義と対比されることが多い。","type":"noun","meaning_category":"哲学的概念"},{"sentence":"The eternalist view of time has implications for our understanding of causality and free will.","translation":"時間の永遠主義的な見方は、因果関係と自由意志の理解に影響を与える。","type":"noun","meaning_category":"哲学的概念"}]}