{"word":"servomotor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サーボモーター","english_definition":"A rotary actuator or linear actuator that allows for precise control of angular or linear position, velocity and acceleration. It consists of a suitable motor coupled to a sensor for position feedback.","examples":[{"sentence":"The robot arm uses servomotors for precise movements.","translation":"そのロボットアームは、正確な動きのためにサーボモーターを使用しています。"},{"sentence":"Servomotors are commonly used in CNC machines.","translation":"サーボモーターは、CNC機械で一般的に使用されています。"},{"sentence":"The model airplane's control surfaces are operated by servomotors.","translation":"模型飛行機の操縦翼面は、サーボモーターによって操作されます。"}],"collocations":["precision servomotor","high-torque servomotor","DC servomotor","AC servomotor","brushless servomotor","servomotor control","servomotor driver"],"synonyms":["servo","rotary actuator","linear actuator"],"antonyms":[]}],"etymology":{"value":"The term \"servomotor\" is derived from \"servo\", which comes from the Latin word \"servus\" meaning \"slave\". It reflects the servomotor's function of following commands accurately.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrvoʊˈmoʊtər/","syllables":"ser-vo-mo-tor"},"inflection":{"noun_plural":"servomotors"},"usage_notes":{"explanation":"A servomotor is a closed-loop control system that uses feedback to precisely control the position, velocity, or acceleration of a motor. It typically includes a motor, a position sensor (such as an encoder or potentiometer), and a control circuit. Servomotors are used in a wide range of applications where precise motion control is required, such as robotics, CNC machines, and model airplanes. The term \"servo\" is often used interchangeably with \"servomotor\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The servo motor was broke.","correct":"✓ The servomotor was broken.","note":"\"Servomotor\" is one word. The past participle of \"break\" is \"broken\"."},{"incorrect":"✗ Use a servo to control the motor.","correct":"✓ Use a servomotor to control the motor.","note":"While \"servo\" is sometimes used as a short form, it's clearer to use \"servomotor\" when referring to the entire unit."}],"priority":"★★☆"},"related_words":{"derivatives":["servo (noun: short for servomotor, or a control system)","servomechanism (noun: a feedback control system)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A servomotor is a type of motor that allows for very precise control of movement. Unlike regular motors that just spin, servomotors can be told to move to a specific position and hold that position. They do this by using a feedback system: a sensor tells the motor's controller where the motor is, and the controller adjusts the motor's power to reach the desired position. Servomotors are used in applications where accuracy is important, such as in robots, CNC machines, and some types of automated equipment. They can control both the angle and speed of rotation, or even linear movement.","priority":"★★☆"},"example_sentences":[{"sentence":"The **servomotor** precisely positioned the robotic arm.","translation":"サーボモーターはロボットアームを正確に位置決めした。","type":"noun","meaning_category":"definition"},{"sentence":"A **servomotor** is essential for accurate control in robotics.","translation":"サーボモーターは、ロボット工学における正確な制御に不可欠です。","type":"noun","meaning_category":"application"},{"sentence":"The CNC machine uses a **servomotor** to move the cutting tool.","translation":"CNC機械は、サーボモーターを使用して切削工具を移動させます。","type":"noun","meaning_category":"example"}]}