{"word":"Gaetulian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ガエトゥリア人の、ガエトゥリアに関する","english_definition":"Relating to the Gaetuli, an ancient Berber people of North Africa.","examples":[{"sentence":"Gaetulian tribes were known for their horsemanship.","translation":"ガエトゥリア人の部族は、馬術で知られていた。"},{"sentence":"The Gaetulian culture influenced the Roman province of Mauretania.","translation":"ガエトゥリア文化は、ローマ帝国のマウレタニア属州に影響を与えた。"}],"collocations":["Gaetulian tribe","Gaetulian culture","Gaetulian cavalry"],"synonyms":["Berber","North African"],"antonyms":[]}],"etymology":{"value":"From Gaetulia, the ancient Roman name for the region inhabited by the Gaetuli people.","priority":"★★★"},"pronunciation":{"ipa":"/ɡiːˈtjuːliən/","syllables":"Gae-tu-li-an"},"inflection":{"notes":"Adjective form only. No plural or verb forms."},"usage_notes":{"explanation":"The term 'Gaetulian' is primarily used in historical and archaeological contexts when discussing the ancient Berber people of Gaetulia. It is not commonly used in modern language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Gaetulian from France.","correct":"✓ He is of Gaetulian descent.","note":"Gaetulia refers to an ancient region in North Africa, not a modern nationality. Use 'of Gaetulian descent' to indicate ancestry."}],"priority":"★★☆"},"related_words":{"derivatives":["Gaetuli (noun: the Gaetulian people)","Gaetulia (noun: the region inhabited by the Gaetuli)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Used primarily in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gaetulian' is a highly specialized term used in historical and archaeological contexts to refer to the ancient Gaetuli people of North Africa and their culture. It is unlikely to be encountered outside of academic or specialized historical texts. Understanding requires knowledge of ancient North African history and Roman provincial geography."},"example_sentences":[{"sentence":"The Roman army faced fierce resistance from the Gaetulian warriors.","translation":"ローマ軍は、ガエトゥリアの戦士からの激しい抵抗に直面した。","type":"adjective","meaning_category":"historical context"},{"sentence":"Archaeological findings suggest a unique Gaetulian artistic style.","translation":"考古学的な発見は、独特なガエトゥリアの芸術様式を示唆している。","type":"adjective","meaning_category":"archaeological context"}]}