{"word":"Maximite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of single-board computer based on the PIC32 microcontroller, designed for hobbyist electronics and programming.","english_definition":"A single-board computer based on the PIC32 microcontroller, popular in hobbyist electronics for its ease of use and BASIC interpreter.","examples":[{"sentence":"The Maximite is a great platform for learning BASIC programming.","translation":"MaximiteはBASICプログラミングを学ぶのに最適なプラットフォームです。"},{"sentence":"I built a simple robot controller using a Maximite.","translation":"Maximiteを使って簡単なロボットコントローラーを作りました。"}],"collocations":["Maximite computer","Maximite BASIC","PIC32 Maximite"],"synonyms":["PIC32 computer","single-board computer"],"antonyms":[]}],"etymology":{"value":"The name 'Maximite' is likely a portmanteau of 'maximum' and 'mite', suggesting a small but powerful computer.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmæksɪmaɪt","syllables":"Max-i-mite"},"inflection":{"noun_plural":"Maximites"},"usage_notes":{"explanation":"The Maximite is primarily used by hobbyists and educators for learning electronics and programming. It features a built-in BASIC interpreter, making it easy to write and run programs without the need for complex development tools.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a Maximite to control my home appliance by C++.","correct":"✓ I used a Maximite to control my home appliance by BASIC.","note":"Maximite primarily uses BASIC, not C++."}],"priority":"★★☆"},"related_words":{"derivatives":["Maximite BASIC"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Maximite' refers to a specific type of single-board computer often used in hobbyist electronics. Understanding this term requires familiarity with electronics and microcontroller concepts. It is a niche term, not commonly used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The Maximite is known for its simple BASIC programming environment.","translation":"MaximiteはそのシンプルなBASICプログラミング環境で知られています。","type":"noun","meaning_category":"Computer"},{"sentence":"Many hobbyists use the Maximite to build custom electronic projects.","translation":"多くのホビイストがMaximiteを使ってカスタム電子プロジェクトを構築しています。","type":"noun","meaning_category":"Computer"}]}