{"word":"non-clerical","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"事務的でない、事務職ではない","english_definition":"Not relating to or characteristic of clerical work or workers.","examples":[{"sentence":"The company is looking for non-clerical staff for its new factory.","translation":"その会社は新しい工場のために事務職ではないスタッフを探している。"},{"sentence":"He moved from a clerical to a non-clerical position within the organization.","translation":"彼は組織内で事務職から事務職ではないポジションに異動した。"},{"sentence":"The training program is designed for non-clerical employees.","translation":"その研修プログラムは事務職ではない従業員向けに設計されている。"}],"collocations":["non-clerical staff","non-clerical position","non-clerical duties","non-clerical work","non-clerical employees"],"synonyms":["non-administrative","non-office-based","operational","manual"],"antonyms":["clerical","administrative","office-based"]}],"etymology":{"value":"'Non-' (not) + 'clerical' (relating to office work).","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒn ˈklɛrɪkəl/","syllables":"non-cler-i-cal"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Non-clerical' is used to describe jobs, duties, or staff that are not primarily focused on office administration, record-keeping, or other typical clerical tasks. It often implies work that is more hands-on, technical, or field-based.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-clerical worker, so he knows how to type very well.","correct":"✓ He is a clerical worker, so he knows how to type very well.","note":"Typing is usually associated with clerical work. Non-clerical workers may not necessarily have strong typing skills."}],"priority":"N/A"},"related_words":{"derivatives":["clerical (adjective)","clerk (noun)"],"priority":"N/A"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The word 'non-clerical' is used to describe jobs or tasks that are not related to typical office work. It is the opposite of 'clerical,' which refers to administrative or office-based duties. This word is often used in job descriptions or when discussing different types of roles within an organization."},"example_sentences":[{"sentence":"The job description specified that applicants should have experience in non-clerical roles.","translation":"求人票には、応募者は事務職以外の職務経験が必要であると明記されていた。","type":"adjective","meaning_category":"事務的でない"},{"sentence":"Non-clerical employees are eligible for overtime pay.","translation":"事務職以外の従業員は残業手当の対象となる。","type":"adjective","meaning_category":"事務職ではない"},{"sentence":"The company provides separate training programs for clerical and non-clerical staff.","translation":"会社は事務職と事務職以外のスタッフのために別々の研修プログラムを提供している。","type":"adjective","meaning_category":"事務職ではない"}]}