{"word":"wheezingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ゼーゼー[ヒューヒュー]言いながら、喘鳴を立てて","english_definition":"In a manner characterized by wheezing; with a whistling or rattling sound in the chest, as a result of difficult breathing.","examples":[{"sentence":"The old man breathed wheezingly as he climbed the stairs.","translation":"その老人は階段を上る際に、ゼーゼーと息を切らせた。"},{"sentence":"She spoke wheezingly, struggling to get enough air.","translation":"彼女は息苦しそうに、ゼーゼー言いながら話した。"}],"collocations":["breathe wheezingly (ゼーゼー息をする)","speak wheezingly (ゼーゼー言いながら話す)"],"synonyms":["gaspingly","raspingly","hoarsely","breathlessly"],"antonyms":["silently","quietly"]}],"etymology":{"value":"Derived from the verb \"wheeze\" (to breathe with difficulty and with a whistling sound) and the suffix \"-ingly\" (indicating manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwiːzɪŋli/","syllables":"wheez-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Wheezingly' describes the manner in which someone breathes or speaks when they are wheezing. It emphasizes the audible and labored nature of the breathing. It is often associated with respiratory conditions such as asthma or bronchitis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He laughed wheezingly even though he was happy.","correct":"✓ He laughed heartily even though he was ill.","note":"Wheezing is usually associated with respiratory distress, not happiness. Use 'heartily' or another adverb to describe laughter when someone is happy, even if they are ill."}],"priority":"★★☆"},"related_words":{"derivatives":["wheeze (verb, noun)","wheezy (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'wheezingly' is not commonly used in everyday conversation. It is more often found in descriptive writing, particularly when describing a character's physical condition or a sound. Understanding the base word 'wheeze' is crucial to understanding 'wheezingly'."},"example_sentences":[{"sentence":"The patient coughed wheezingly, his chest rattling with each breath.","translation":"患者は咳をするたびに胸がゴロゴロと鳴り、ゼーゼーと咳き込んだ。","type":"descriptive","meaning_category":"manner of breathing"},{"sentence":"\"Help me,\" she whispered wheezingly, clutching her chest.","translation":"「助けて」と彼女は胸を押さえながら、ゼーゼー言いながら囁いた。","type":"dialogue","meaning_category":"manner of speaking"}]}