{"word":"unaffected-looking","meanings":[{"part_of_speech":"adjective","definition":"自然に見える、気取らない様子、飾らない外見","english_definition":"having a natural and genuine appearance; not artificial or pretentious.","examples":[{"sentence":"She had an unaffected-looking smile that made everyone feel at ease.","translation":"彼女の飾らない笑顔は、誰もが安心できるものだった。"},{"sentence":"Despite his wealth, he maintained an unaffected-looking demeanor.","translation":"彼は裕福にもかかわらず、気取らない態度を保っていた。"},{"sentence":"The actress was praised for her unaffected-looking performance.","translation":"その女優は、自然な演技で賞賛された。"}],"collocations":["unaffected-looking smile (飾らない笑顔)","unaffected-looking demeanor (気取らない態度)","unaffected-looking performance (自然な演技)","unaffected-looking style (飾らないスタイル)"],"synonyms":["natural-looking","genuine-looking","sincere-looking","unpretentious-looking","down-to-earth-looking","simple-looking"],"antonyms":["affected-looking","pretentious-looking","artificial-looking","contrived-looking","ostentatious-looking"],"notes":"This adjective describes someone or something that appears genuine and without affectation. It implies a lack of artificiality or pretension in appearance or behavior. It often carries a positive connotation, suggesting authenticity and sincerity."}],"etymology":{"value":"Combination of 'unaffected' (not artificial or pretended) and 'looking' (having a certain appearance).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnəˈfektɪd ˈlʊkɪŋ/","syllables":"un-af-fect-ed look-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Unaffected-looking' is used to describe the outward appearance of someone or something that seems genuine and without pretense. It emphasizes the natural and sincere quality of the appearance. It is often used to praise someone's humility or authenticity.","priority":"★★★"},"related_words":{"derivatives":["unaffectedness (名詞: 飾らないこと、自然さ)"],"related_adjectives":["unaffected","natural","genuine","sincere","unpretentious"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'unaffected-looking' describes someone who appears genuine and without pretense. It is used to convey a sense of naturalness and sincerity in their appearance. This term is less common and may require a higher level of English proficiency to understand and use correctly."},"example_sentences":[{"sentence":"The model's unaffected-looking beauty was a refreshing change from the heavily made-up faces in the magazine.","translation":"そのモデルの飾らない美しさは、雑誌の厚化粧の顔とは対照的で、新鮮だった。","type":"general"},{"sentence":"His unaffected-looking honesty made him a trustworthy leader.","translation":"彼の飾らない正直さは、彼を信頼できるリーダーにした。","type":"general"},{"sentence":"The film's success was due in part to the actors' unaffected-looking portrayals of everyday people.","translation":"その映画の成功は、俳優たちの飾らない演技にもよる。","type":"general"}]}