{"word":"allergy-causing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アレルギーを引き起こす、アレルギー性の","english_definition":"Capable of causing an allergic reaction.","examples":[{"sentence":"Pollen is a common allergy-causing substance.","translation":"花粉は一般的なアレルギー原因物質です。"},{"sentence":"This detergent is allergy-causing for some people with sensitive skin.","translation":"この洗剤は、敏感肌の人々にとってはアレルギーを引き起こす可能性があります。"},{"sentence":"We need to identify the allergy-causing ingredients in this food.","translation":"この食品に含まれるアレルギーを引き起こす可能性のある成分を特定する必要があります。"}],"collocations":["allergy-causing substance","allergy-causing ingredient","allergy-causing food","allergy-causing agent"],"synonyms":["allergenic","sensitizing"],"antonyms":["hypoallergenic","non-allergenic"]},{"part_of_speech":"noun","definition":"アレルギー原因物質","english_definition":"A substance that causes an allergic reaction. (Less common usage)","examples":[{"sentence":"Avoid allergy-causings if you have sensitive skin.","translation":"敏感肌の場合は、アレルギー原因物質を避けてください。"}],"collocations":[],"synonyms":["allergen"],"antonyms":[]}],"etymology":{"value":"The word is a compound adjective formed by combining \"allergy\" with the present participle of \"cause\" (causing). It describes something that has the property of causing an allergic reaction.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælərdʒiˌkɔːzɪŋ/","syllables":"al-ler-gy-caus-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns. However, it can be used in comparative and superlative constructions (e.g., more allergy-causing, most allergy-causing), although this is less common."},"usage_notes":{"explanation":"\"Allergy-causing\" is typically used to describe substances, materials, or environmental factors that can trigger an allergic reaction in susceptible individuals. It's commonly found in descriptions of food products, cosmetics, cleaning supplies, and other items that may come into contact with the skin or be ingested. The term is often used in labeling and advertising to inform consumers about potential allergens.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a allergy-causing.","correct":"✓ This is an allergy-causing substance. / ✓ This is allergy-causing.","note":"When used as an adjective, it modifies a noun (e.g., allergy-causing substance). When referring to the substance itself, use 'allergen' or specify 'allergy-causing substance'."},{"incorrect":"✗ The allergy-causing is pollen.","correct":"✓ The allergy-causing substance is pollen. / ✓ Pollen is an allergen.","note":"It's more common and precise to use 'allergen' or 'allergy-causing substance' when referring to the specific substance that causes the allergy."}],"priority":"★★☆"},"related_words":{"derivatives":["allergy","allergen","allergenic","hypoallergenic","non-allergenic","cause"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"allergy-causing\" is used to describe something that can trigger an allergic reaction. It's often found in contexts related to health, food, and product labeling. Understanding this term is important for people with allergies to identify and avoid substances that could cause a reaction. It's a compound adjective, meaning it combines two words to create a descriptive term.","priority":"★★★"},"example_sentences":[{"sentence":"The doctor suspects that dust mites are the allergy-causing factor in his patient's asthma.","translation":"医師は、ダニが患者の喘息のアレルギー原因因子であると疑っています。","type":"adjective","meaning_category":"causing allergy"},{"sentence":"Many people are unaware of the allergy-causing potential of certain cosmetics.","translation":"多くの人々は、特定の化粧品のアレルギーを引き起こす可能性に気づいていません。","type":"adjective","meaning_category":"causing allergy"},{"sentence":"The label clearly states that the product is free from common allergy-causing ingredients.","translation":"ラベルには、その製品が一般的なアレルギー原因成分を含まないと明記されています。","type":"adjective","meaning_category":"causing allergy"}]}