{"word":"hue-centric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"色相中心の、色相に重点を置いた","english_definition":"Focusing on or emphasizing hue, especially in color theory or image processing.","examples":[{"sentence":"The image editing software offers hue-centric adjustments for precise color correction.","translation":"その画像編集ソフトは、正確な色補正のために色相中心の調整機能を提供しています。"},{"sentence":"The artist's work is very hue-centric, with each color carefully chosen for its emotional impact.","translation":"そのアーティストの作品は非常に色相中心であり、それぞれの色が感情的な影響のために慎重に選ばれています。"}],"collocations":["hue-centric color palette (色相中心のカラーパレット)","hue-centric image processing (色相中心の画像処理)","hue-centric design (色相中心のデザイン)"],"synonyms":["color-focused","hue-based"],"antonyms":["value-centric","saturation-centric"]}],"etymology":{"value":"\"hue\"（色相）+ \"centric\"（中心の）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˈhjuːˌsɛn.trɪk/","syllables":"hue-cen-tric"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"hue-centric\"は、色相（色の種類）に特に重点を置くことを意味する形容詞です。画像処理、デザイン、色彩理論などの分野で使用されます。色相、彩度、明度のうち、色相を最も重要な要素として扱う場合に用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The design was very color-centric but not hue-centric.","correct":"✓ The design was very color-centric, focusing on the overall color scheme, but not specifically hue-centric, meaning it didn't prioritize individual hues.","note":"\"color-centric\"はより一般的な「色中心」を意味し、必ずしも色相に限定されません。\"hue-centric\"は色相に特化した意味を持ちます。"},{"incorrect":"✗ The hue-centric of the painting was blue.","correct":"✓ The hue-centric aspect of the painting was the dominance of blue.","note":"\"hue-centric\"は形容詞であり、名詞として使用する場合は、\"hue-centric aspect\"のように表現します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hue","saturation","value","color theory","color wheel","HSL","HSV","RGB"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hue-centric\" is a specialized adjective used to describe something that prioritizes or focuses on hue, which is the attribute of a color that gives it its name (e.g., red, blue, green). It is commonly used in contexts related to color theory, image processing, and design, where the specific hue of a color is considered particularly important. Understanding this term requires familiarity with basic color terminology."},"example_sentences":[{"sentence":"The artist employed a hue-centric approach to create a vibrant and harmonious composition.","translation":"そのアーティストは、鮮やかで調和のとれた構図を作り出すために、色相中心のアプローチを採用しました。","type":"adjective","meaning_category":"色相に重点を置いた"},{"sentence":"The software's hue-centric filters allow for precise color adjustments.","translation":"そのソフトウェアの色相中心のフィルターは、正確な色調整を可能にします。","type":"adjective","meaning_category":"色相に重点を置いた"}]}