{"word":"mustelinous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"イタチ科の、イタチのような","english_definition":"of or relating to the mustelids (the weasel family).","examples":[{"sentence":"The mustelinous odor was quite strong in the den.","translation":"その巣穴では、イタチのような臭いがかなり強かった。"},{"sentence":"The animal had a mustelinous body shape, long and slender.","translation":"その動物は、イタチのような体型で、細長かった。"}],"collocations":["mustelinous odor","mustelinous mammals","mustelinous characteristics"],"synonyms":["weasel-like","mustelid","ferret-like"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'mustela', meaning 'weasel', and the suffix '-inous', indicating resemblance or belonging to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌstɪˈliːnəs/","syllables":"mus-te-li-nous"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for 'mustelinous'."},"usage_notes":{"explanation":"'Mustelinous' is a relatively uncommon adjective used to describe something that is related to or resembles the mustelid family of mammals, which includes weasels, badgers, otters, and related species. It is most often used in scientific or descriptive contexts when discussing the characteristics or features of these animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mustelinous animal was a reptile.","correct":"✓ The mustelinous animal was a mammal.","note":"Mustelinous refers specifically to mammals of the weasel family, not reptiles or other types of animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["mustelid (noun: a mammal of the weasel family)","mustelidae (noun: the family of weasels, badgers, otters, and related species)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mustelinous' is a specialized term primarily used in zoology or contexts involving detailed descriptions of animal characteristics. Its use is limited to discussions about animals belonging to the mustelid family, making it a rare word in general conversation. Understanding requires familiarity with biological classifications and vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The zoologist identified the tracks as belonging to a mustelinous creature.","translation":"動物学者はその足跡をイタチ科の生き物のものだと特定した。","type":"adjective","meaning_category":"イタチ科の"},{"sentence":"The museum exhibit featured several mustelinous skulls.","translation":"博物館の展示では、いくつかのイタチ科の動物の頭蓋骨が展示されていた。","type":"adjective","meaning_category":"イタチのような"}]}