{"word":"accessors","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(プログラミング)アクセッサ：オブジェクトの内部データにアクセスするためのメソッド。通常、ゲッター（getter）とセッター（setter）のペアを指す。","english_definition":"(programming) Methods used to access the internal data of an object. Typically refers to a pair of getter and setter methods.","examples":[{"sentence":"In object-oriented programming, accessors are used to encapsulate data.","translation":"オブジェクト指向プログラミングでは、アクセッサはデータをカプセル化するために使用されます。"},{"sentence":"The getter method allows you to retrieve the value of a private variable.","translation":"ゲッターメソッドを使用すると、プライベート変数の値を取得できます。"},{"sentence":"The setter method allows you to modify the value of a private variable.","translation":"セッターメソッドを使用すると、プライベート変数の値を変更できます。"}],"collocations":["getter method (ゲッターメソッド)","setter method (セッターメソッド)","access private data (プライベートデータにアクセスする)","encapsulation (カプセル化)"],"synonyms":["getter","setter","property accessor"],"antonyms":["mutator"],"related_terms":["encapsulation","getter","setter","method","property","object-oriented programming"]}],"etymology":{"value":"The term \"accessor\" is derived from the word \"access,\" meaning to gain entry or to retrieve information. In programming, it refers to the methods that provide access to the internal state of an object.","priority":"★★☆"},"pronunciation":{"ipa":"/əkˈsɛsərz/","syllables":"ac-ces-sors"},"inflection":{"noun_plural":"accessors"},"usage_notes":{"explanation":"In object-oriented programming, accessors are methods that are used to get (getter) and set (setter) the values of an object's properties. They are often used to control access to private data members, enforcing encapsulation and data integrity. By using accessors, you can modify the internal implementation of a class without affecting the code that uses it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to access the variable directly instead of using accessors.","correct":"✓ I need to use accessors to access the variable instead of accessing it directly.","note":"Directly accessing variables can break encapsulation. Accessors provide a controlled way to interact with an object's internal state."}],"priority":"★★☆"},"related_words":{"derivatives":["access (verb, noun)","accessible (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'accessors' refers to methods in programming, specifically object-oriented programming, that are used to get and set the values of an object's properties. These are often used to control access to private data members, enforcing encapsulation and data integrity. The concept is more advanced and typically encountered in higher-level programming courses or professional software development."},"example_sentences":[{"sentence":"The class provides accessors for reading and writing the 'name' property.","translation":"このクラスは、'name'プロパティを読み書きするためのアクセッサを提供します。","type":"general","meaning_category":"プログラミング"},{"sentence":"Using accessors helps maintain the integrity of the object's state.","translation":"アクセッサを使用すると、オブジェクトの状態の整合性を維持するのに役立ちます。","type":"general","meaning_category":"プログラミング"}]}