{"word":"presurprisal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(情報理論)自己情報量、驚き度、意外性。ある事象が起こる確率の対数の負の値。確率が低いほどpresurprisalは高くなる。","english_definition":"(information theory) self-information; the negative logarithm of the probability of an event. The lower the probability, the higher the presurprisal.","examples":[{"sentence":"The presurprisal of observing a rare event is high.","translation":"稀な事象を観測することの自己情報量は高い。"},{"sentence":"The presurprisal is a measure of how unexpected an outcome is.","translation":"自己情報量は、結果がどれほど予想外であるかの尺度である。"}],"collocations":["high presurprisal (高い自己情報量)","low presurprisal (低い自己情報量)"],"synonyms":["self-information","information content","surprisal","negative log probability"],"antonyms":["none (direct antonym is not commonly used)"]}],"etymology":{"value":"'pre-' (前に) + 'surprisal' (驚き) から。事象が起こる前に、その事象がどれだけ驚きをもたらすかを定量的に示すという概念から。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpriːsərˈpraɪzəl/","syllables":"pre-sur-pris-al"},"inflection":{"noun_plural":"presurprisals"},"usage_notes":{"explanation":"'Presurprisal' は主に情報理論や統計学の分野で使用される専門用語です。日常会話ではほとんど使われません。事象の確率が低いほど、その事象が起こったときの「驚き」が大きいという概念を定量化するために用いられます。自己情報量とも呼ばれます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The presurprisal was very surprised.","correct":"✓ The presurprisal was high.","note":"'Presurprisal' は事象の特性であり、人ではありません。したがって、人が驚いたという文脈では使用できません。"},{"incorrect":"✗ The higher the probability, the higher the presurprisal.","correct":"✓ The higher the probability, the lower the presurprisal.","note":"確率と自己情報量は反比例の関係にあります。確率が高いほど、自己情報量は低くなります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["surprisal (驚き)","entropy (エントロピー)","information theory (情報理論)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Presurprisal' is a technical term used in information theory to quantify the unexpectedness of an event. It's calculated as the negative logarithm of the event's probability. A higher presurprisal value indicates a more surprising event, meaning it had a lower initial probability. This term is rarely used outside of specialized contexts like data science, machine learning, and advanced statistics. Understanding the concept requires familiarity with logarithmic scales and probability theory."},"example_sentences":[{"sentence":"The deep learning model assigned a high presurprisal value to the anomalous data point.","translation":"深層学習モデルは、異常なデータ点に高い自己情報量の値を割り当てた。","type":"noun","meaning_category":"自己情報量"},{"sentence":"Minimizing the presurprisal is a key objective in efficient coding schemes.","translation":"自己情報量を最小化することは、効率的な符号化方式における重要な目標である。","type":"noun","meaning_category":"自己情報量"}]}