{"word":"Odontophoran","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新世界アゴヒゲウズラ科の鳥類の総称","english_definition":"Any bird of the family Odontophoridae, the New World quail.","examples":[{"sentence":"The Odontophoran family includes many species of quail found in North and South America.","translation":"アゴヒゲウズラ科には、北米および南米で見られる多くのウズラの種が含まれています。"}],"collocations":["Odontophoran species","Odontophoran habitat","Odontophoran conservation"],"synonyms":["New World quail"],"antonyms":[]}],"etymology":{"value":"From the scientific family name Odontophoridae, derived from Greek roots 'odonto' (tooth) + 'phoros' (bearing), referring to the toothed appearance of the bill in some species.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˌdɒnˈtɒfərən/","syllables":"o-don-to-pho-ran"},"inflection":{"noun_plural":"Odontophorans"},"usage_notes":{"explanation":"'Odontophoran' is a relatively technical term used primarily in ornithology and related fields to refer to birds belonging to the family Odontophoridae. It is less commonly used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Odontophoran in my backyard, it was a chicken.","correct":"✓ I saw an Odontophoran in my backyard, it was a quail.","note":"Odontophorans are quails, not chickens."}],"priority":"★☆☆"},"related_words":{"derivatives":["Odontophoridae (family name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Odontophoran' is a technical term used in ornithology to refer to New World quails. It is not a common word and would primarily be encountered in scientific or specialized contexts. Understanding requires a familiarity with biological classification systems."},"example_sentences":[{"sentence":"Conservation efforts are crucial for many Odontophoran species facing habitat loss.","translation":"生息地の喪失に直面している多くのアゴヒゲウズラ科の種にとって、保全活動は非常に重要です。","type":"noun","meaning_category":"General"}]}