{"word":"euchromatic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(細胞生物学)ユークロマチンの、真性染色質の","english_definition":"(cytology) Relating to or consisting of euchromatin.","examples":[{"sentence":"Euchromatic regions of chromosomes are typically gene-rich and actively transcribed.","translation":"染色体のユークロマチン領域は、一般的に遺伝子に富み、活発に転写される。"}],"collocations":["euchromatic region","euchromatic state","euchromatic DNA"],"synonyms":["active chromatin","gene-rich chromatin"],"antonyms":["heterochromatic"]},{"part_of_speech":"adjective","definition":"(鉱物学)容易に着色される、よく染まる","english_definition":"(mineralogy) Easily stained or colored.","examples":[{"sentence":"The mineral is described as being euchromatic due to its ability to readily absorb dyes.","translation":"その鉱物は、染料を容易に吸収する能力があるため、ユークロマチックであると記述されている。"}],"collocations":["euchromatic mineral","euchromatic staining"],"synonyms":["easily stained","readily colored"],"antonyms":["achromatic"]}],"etymology":{"value":"From the Greek words 'eu-' (meaning 'good' or 'true') + 'chroma' (meaning 'color') + '-tic' (suffix indicating 'relating to'). Literally, 'well-colored' or 'easily colored'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːkroʊˈmætɪk/","syllables":"eu-chro-mat-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more euchromatic' and 'most euchromatic', respectively."},"usage_notes":{"explanation":"'Euchromatic' is primarily used in two scientific contexts: cytology (cell biology) and mineralogy. In cytology, it refers to a state of chromatin that is loosely packed, gene-rich, and actively transcribed. In mineralogy, it describes minerals that are easily stained or colored. The meaning is derived from the etymology, referring to something that is 'well-colored' or 'easily colored'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was euchromatic.","correct":"✓ The region of the chromosome was euchromatic.","note":"'Euchromatic' describes a region or state of chromatin, not the entire cell."}],"priority":"★☆☆"},"related_words":{"derivatives":["euchromatin (noun): a lightly packed form of chromatin that is rich in genes, and is often under active transcription.","heterochromatin (noun): a tightly packed form of DNA or condensed DNA, which comes in multiple varieties.","chromatin (noun): the material of which chromosomes are made, consisting of DNA and protein."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Euchromatic' is a technical term used in cell biology and mineralogy. It describes something that is easily stained or colored. In cell biology, it refers to a loosely packed form of chromatin (the material that makes up chromosomes) that is rich in genes and actively transcribed. This means that the genes in euchromatin are easily accessible and used to make proteins. In mineralogy, it simply means that a mineral readily takes up color or stain. Because it's a specialized term, it's not commonly used outside of these scientific fields."},"example_sentences":[{"sentence":"The euchromatic regions of the DNA are actively involved in gene expression.","translation":"DNAのユークロマチン領域は、遺伝子発現に活発に関与している。","type":"scientific","meaning_category":"Cell Biology"},{"sentence":"This mineral is highly euchromatic, making it easy to identify under a microscope.","translation":"この鉱物は非常にユークロマチックであり、顕微鏡下で容易に識別できる。","type":"scientific","meaning_category":"Mineralogy"}]}