{"word":"preassembling","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(部品などを)事前に組み立てること","english_definition":"The act of assembling components or parts in advance, before they are needed for the final product or construction.","examples":[{"sentence":"The factory is preassembling the car doors to speed up the production line.","translation":"その工場は、生産ラインをスピードアップするために、車のドアを事前に組み立てています。"},{"sentence":"Preassembling the furniture at the warehouse saved a lot of time during delivery.","translation":"倉庫で家具を事前に組み立てることで、配達時の時間を大幅に節約できました。"},{"sentence":"The construction crew preassembled the roof trusses off-site.","translation":"建設作業員は、屋根のトラスを現場外で事前に組み立てました。"}],"collocations":["preassembling components","preassembling parts","preassembling furniture","preassembling modules"],"synonyms":["partial assembly","advance assembly","prefabrication"],"antonyms":["disassembling","knock-down","flat-pack"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning 'before') to the word 'assembling'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːəˈsɛmblɪŋ/","syllables":"pre-as-sem-bling"},"inflection":{"verb_forms":{"present_simple":["preassembles"],"past_simple":"preassembled","past_participle":"preassembled","present_participle":"preassembling"}},"usage_notes":{"explanation":"'Preassembling' refers to the process of putting together parts or components before they are actually required in the main assembly or construction process. This is often done to save time, improve efficiency, or ensure quality control. It is commonly used in manufacturing, construction, and furniture industries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The preassembling was done by the robots.","correct":"✓ The preassembly was done by the robots.","note":"'Preassembling' is the verb form (present participle), while 'preassembly' is the noun form. Use the noun form when referring to the process itself as a subject."},{"incorrect":"✗ They are preassembling the parts before they arrive.","correct":"✓ They are preassembling the parts before they are delivered.","note":"'Arrive' refers to people, while 'delivered' is more appropriate for objects or goods."}],"priority":"★★☆"},"related_words":{"derivatives":["preassemble (verb)","preassembled (adjective)","preassembly (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'preassembling' is a relatively technical term, primarily used in manufacturing, construction, and related fields. It describes the act of putting parts together in advance to streamline the main assembly process. Understanding the prefix 'pre-' is helpful in grasping the meaning. It is not a common word in everyday conversation but is important in specific professional contexts."},"example_sentences":[{"sentence":"The company is **preassembling** electronic components to reduce production time.","translation":"その会社は、生産時間を短縮するために電子部品を事前に組み立てています。","type":"verb","meaning_category":"事前に組み立てる"},{"sentence":"The **preassembling** of the engine parts was completed before the main assembly began.","translation":"エンジン部品の事前組み立ては、本組み立てが始まる前に完了しました。","type":"noun (implied)","meaning_category":"事前組み立て"}]}