{"word":"segolate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学)セゴル型の、セゴル音韻構造を持つ","english_definition":"(linguistics) Having a vowel pattern of the type found in Hebrew segolate nouns, typically consisting of two short vowels separated by a consonant.","examples":[{"sentence":"Segolate nouns are common in Hebrew.","translation":"セゴル名詞はヘブライ語で一般的です。"},{"sentence":"The word 'melech' (king) is a segolate noun.","translation":"「melech」（王）という単語はセゴル名詞です。"}],"collocations":["segolate noun","segolate structure","segolate pattern"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Hebrew word סְגּוֹל (segol), which refers to a specific vowel point (a type of e vowel) in the Tiberian vocalization system. The term was coined by grammarians to describe nouns with a particular vowel pattern.","priority":"★★★"},"pronunciation":{"ipa":"ˈsɛɡəˌleɪt","syllables":"seg-o-late"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"The term \"segolate\" is primarily used in the context of Semitic languages, particularly Hebrew, to describe a specific type of noun formation. These nouns typically have a characteristic vowel pattern where two short vowels (often 'e' or 'a' sounds) are separated by a consonant. Understanding segolate nouns is important for analyzing the morphology and phonology of Hebrew.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is segolated.","correct":"✓ The word is a segolate.","note":"When referring to a noun belonging to the segolate class, use \"a segolate noun\" or \"a segolate word\" rather than using \"segolated\" as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["segol (noun: the vowel point itself)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized linguistic term)","frequency_google_ngram":"Very low frequency - specialized term used in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"segolate\" is a highly specialized term used within the field of linguistics, specifically when discussing the morphology and phonology of Semitic languages like Hebrew. It describes nouns that follow a particular vowel pattern, typically two short vowels separated by a consonant. Understanding this term requires a background in linguistics and familiarity with Hebrew grammar. It is not commonly used outside of academic or specialized contexts. "},"example_sentences":[{"sentence":"Many common Hebrew nouns, such as 'yeled' (child) and 'sefer' (book), are **segolate**.","translation":"「yeled」（子供）や「sefer」（本）など、多くの一般的なヘブライ語の名詞は**セゴル型**です。","type":"adjective","meaning_category":"linguistics"},{"sentence":"The **segolate** structure of the word influences its pronunciation.","translation":"その単語の**セゴル型**構造は、その発音に影響を与えます。","type":"adjective","meaning_category":"linguistics"}]}