{"word":"infarct","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"梗塞巣、梗塞部位","english_definition":"An area of tissue that undergoes necrosis as a result of obstruction of local blood supply.","examples":[{"sentence":"A myocardial infarct is commonly known as a heart attack.","translation":"心筋梗塞は一般的に心臓発作として知られています。"},{"sentence":"The CT scan showed a small infarct in the cerebellum.","translation":"CTスキャンは小脳に小さな梗塞巣を示しました。"}],"collocations":["myocardial infarct (心筋梗塞)","cerebral infarct (脳梗塞)","pulmonary infarct (肺梗塞)","renal infarct (腎梗塞)","infarct size (梗塞サイズ)","infarct volume (梗塞容積)","acute infarct (急性梗塞)","chronic infarct (慢性梗塞)"],"synonyms":["necrosis","ischemia","tissue death"],"antonyms":["reperfusion","angiogenesis"]},{"part_of_speech":"verb","definition":"梗塞を起こす","english_definition":"To undergo necrosis as a result of obstruction of local blood supply.","examples":[{"sentence":"The tissue began to infarct due to the lack of oxygen.","translation":"組織は酸素不足のため梗塞を起こし始めた。"}],"collocations":["infarct the tissue (組織を梗塞させる)"],"synonyms":["necrose","become ischemic"],"antonyms":["perfuse","revascularize"]}],"etymology":{"value":"From Latin 'infarctus', past participle of 'infarcire' meaning 'to stuff into', referring to the tissue being 'stuffed' with dead cells.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfɑːrkt/","syllables":"in-farct"},"inflection":{"noun_plural":"infarcts","verb_forms":{"present_simple":["infarct","infarcts"],"past_simple":"infarcted","past_participle":"infarcted","present_participle":"infarcting"}},"usage_notes":{"explanation":"'Infarct' refers to the localized area of dead tissue resulting from ischemia (lack of blood supply). It's commonly used in medical contexts, especially when discussing cardiovascular or neurological conditions. The noun form refers to the area of dead tissue, while the verb form describes the process of tissue undergoing necrosis due to lack of blood supply.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I had an infection in my heart, an infarct.","correct":"✓ The doctor said I had a blockage in my heart, leading to an infarct.","note":"An infarct is the result of a blockage, not an infection. It's the dead tissue caused by lack of blood supply. An infection is a separate process caused by pathogens."},{"incorrect":"✗ The infarct was treated with antibiotics.","correct":"✓ The infarct was treated with thrombolytics or angioplasty.","note":"Infarcts are not treated with antibiotics. Treatment focuses on restoring blood flow, often with thrombolytics (clot-dissolving drugs) or angioplasty (physical removal of the blockage)."}],"priority":"★★☆"},"related_words":{"derivatives":["infarction (noun: the process of forming an infarct)","infarcted (adjective: having undergone infarction)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Infarct' is a technical term used in medicine to describe an area of tissue that has died because it didn't get enough blood supply. This often happens because a blood vessel is blocked. You'll usually see this word used in medical reports or when doctors are talking about conditions like heart attacks (myocardial infarcts) or strokes (cerebral infarcts). It's important to remember that an infarct is the dead tissue itself, not the cause of the blockage.","priority":"★★☆"},"example_sentences":[{"sentence":"The autopsy revealed a large infarct in the left ventricle.","translation":"剖検で左心室に大きな梗塞巣が認められた。","type":"noun","meaning_category":"梗塞巣"},{"sentence":"Without prompt treatment, the affected limb will infarct.","translation":"迅速な治療がなければ、患肢は梗塞を起こすだろう。","type":"verb","meaning_category":"梗塞を起こす"},{"sentence":"The size of the infarct correlated with the severity of the stroke.","translation":"梗塞のサイズは脳卒中の重症度と相関していた。","type":"noun","meaning_category":"梗塞巣"},{"sentence":"The cardiologist explained the risk of further tissue infarcting.","translation":"心臓専門医は、さらなる組織梗塞のリスクについて説明した。","type":"verb","meaning_category":"梗塞を起こす"}]}