{"word":"hystero-epilepsy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒステロてんかん","english_definition":"A historical term referring to a condition that was thought to combine symptoms of hysteria and epilepsy. This term is now considered outdated and inaccurate.","examples":[{"sentence":"The doctor diagnosed her with hystero-epilepsy, a condition now understood as a form of psychogenic non-epileptic seizures.","translation":"医師は彼女をヒステロてんかんと診断したが、この病状は現在、心因性非てんかん性発作の一種として理解されている。"}],"collocations":[],"synonyms":["pseudoseizure","psychogenic non-epileptic seizures (PNES)"],"antonyms":[]}],"etymology":{"value":"The term combines 'hystero-' referring to hysteria (an outdated term for a mental disorder characterized by emotional excess) and 'epilepsy' (a neurological disorder characterized by seizures).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstəroʊˈɛpɪˌlɛpsi/","syllables":"his-te-ro-ep-i-lep-sy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"The term 'hystero-epilepsy' is outdated and no longer used in modern medical practice. It reflected a historical misunderstanding of conditions that mimic epilepsy but are psychological in origin. These conditions are now more accurately referred to as psychogenic non-epileptic seizures (PNES) or functional seizures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was treated with anti-epileptic drugs for her hystero-epilepsy.","correct":"✓ She was treated with therapy for her psychogenic non-epileptic seizures.","note":"Since hystero-epilepsy is now understood as a psychological condition, therapy is the more appropriate treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["hysteria","epilepsy","psychogenic","non-epileptic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - The term is outdated and rarely used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hystero-epilepsy' is an obsolete medical term that historically referred to a condition believed to combine features of hysteria and epilepsy. Its use is discouraged in contemporary medicine due to its inaccuracy and the stigma associated with the term 'hysteria.' The modern understanding favors terms like 'psychogenic non-epileptic seizures (PNES)' to describe events that resemble epileptic seizures but stem from psychological rather than neurological causes. Therefore, encountering this term is rare, primarily in historical medical contexts."},"example_sentences":[{"sentence":"The old medical textbook described the condition as hystero-epilepsy.","translation":"古い医学書では、その病状はヒステロてんかんとして記述されていた。","type":"noun","meaning_category":"historical term"},{"sentence":"Modern medical professionals now use the term psychogenic non-epileptic seizures instead of hystero-epilepsy.","translation":"現代の医療専門家は、ヒステロてんかんの代わりに心因性非てんかん性発作という用語を使用している。","type":"noun","meaning_category":"historical term"}]}