{"word":"process-orientation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プロセス指向、プロセス重視","english_definition":"An approach to management and organizational design that emphasizes the importance of business processes in achieving organizational goals and customer satisfaction. It focuses on understanding, documenting, improving, and managing processes rather than functional departments.","examples":[{"sentence":"The company adopted a process-orientation to improve efficiency and reduce costs.","translation":"その会社は効率を改善しコストを削減するためにプロセス指向を採用した。"},{"sentence":"Process-orientation requires a shift in mindset from functional silos to cross-functional collaboration.","translation":"プロセス指向は、機能別サイロから部門横断的なコラボレーションへの考え方の転換を必要とする。"},{"sentence":"Implementing process-orientation involves mapping out key business processes and identifying areas for improvement.","translation":"プロセス指向を実装するには、主要なビジネスプロセスをマッピングし、改善の余地がある領域を特定することが含まれる。"}],"collocations":["adopt a process-orientation (プロセス指向を採用する)","implement process-orientation (プロセス指向を実装する)","process-orientation framework (プロセス指向フレームワーク)","process-orientation approach (プロセス指向アプローチ)","high process-orientation (高いプロセス指向)","strong process-orientation (強いプロセス指向)"],"synonyms":["process management","business process management (BPM)","workflow management","process-centered approach"],"antonyms":["functional orientation","departmental orientation"]},{"part_of_speech":"adjective","definition":"プロセス指向の、プロセス重視の","english_definition":"Characterized by a focus on processes rather than functional departments or individual tasks.","examples":[{"sentence":"A process-oriented organization prioritizes the optimization of workflows.","translation":"プロセス指向の組織は、ワークフローの最適化を優先する。"},{"sentence":"Process-oriented training programs help employees understand how their work contributes to the overall process.","translation":"プロセス指向のトレーニングプログラムは、従業員が自分の仕事がプロセス全体にどのように貢献するかを理解するのに役立つ。"},{"sentence":"The company culture is highly process-oriented, with a strong emphasis on standardization and continuous improvement.","translation":"その会社の文化は高度にプロセス指向であり、標準化と継続的な改善が強く重視されている。"}],"collocations":["process-oriented approach (プロセス指向アプローチ)","process-oriented organization (プロセス指向組織)","process-oriented training (プロセス指向トレーニング)","process-oriented management (プロセス指向マネジメント)","process-oriented design (プロセス指向設計)"],"synonyms":["process-focused","process-driven","workflow-oriented"],"antonyms":["function-oriented","task-oriented"]}],"etymology":{"value":"The term is a compound of 'process' (a series of actions or steps taken in order to achieve a particular end) and 'orientation' (a person's basic attitude, beliefs, or feelings in relation to a particular subject or issue).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒses ˌɔːriənˈteɪʃən/","syllables":"proc-ess o-ri-en-ta-tion"},"inflection":{"notes":"As a noun, it is typically uncountable. The adjective form is 'process-oriented'."},"usage_notes":{"explanation":"'Process-orientation' emphasizes the importance of designing and managing business operations as a series of interconnected processes rather than as isolated tasks or functions. It involves mapping out these processes, identifying bottlenecks or inefficiencies, and implementing improvements to optimize performance and customer satisfaction. This approach often requires cross-functional collaboration and a focus on continuous improvement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company has a strong function-orientation, not process-orientation.","correct":"✓ The company has a strong functional orientation, not process-orientation.","note":"'Functional orientation' is the correct antonym to 'process-orientation' when describing an organizational structure focused on departments rather than processes."},{"incorrect":"✗ Process orientation is about individual tasks.","correct":"✓ Process orientation is about the entire workflow and how different tasks connect.","note":"Process orientation focuses on the entire process and how tasks connect, not just individual tasks."}],"priority":"★★☆"},"related_words":{"derivatives":["process (noun, verb)","orientation (noun)","process-oriented (adjective)","re-engineering (noun, verb)","workflow (noun)","business process (noun)","process improvement (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in business and management contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Process-orientation' is a term used in business and management to describe an approach that focuses on managing and improving business processes. Instead of organizing work around departments or individual tasks, a process-oriented approach looks at the entire workflow and how different parts of the organization contribute to a specific outcome. This often involves mapping out the steps in a process, identifying areas for improvement, and implementing changes to make the process more efficient and effective. It's a concept often discussed in the context of business process management (BPM) and organizational design."},"example_sentences":[{"sentence":"A process-orientation can lead to significant improvements in efficiency and customer satisfaction.","translation":"プロセス指向は、効率と顧客満足度の大幅な向上につながる可能性があります。","type":"noun","meaning_category":"プロセス指向"},{"sentence":"The company's process-oriented approach allowed them to streamline their operations and reduce costs.","translation":"同社のプロセス指向のアプローチにより、業務を合理化し、コストを削減することができました。","type":"adjective","meaning_category":"プロセス指向の"},{"sentence":"Implementing a process-orientation requires a commitment from all levels of the organization.","translation":"プロセス指向を実装するには、組織のすべてのレベルからのコミットメントが必要です。","type":"noun","meaning_category":"プロセス指向"},{"sentence":"The consultant recommended a more process-oriented approach to problem-solving.","translation":"コンサルタントは、問題解決に対するよりプロセス指向のアプローチを推奨しました。","type":"adjective","meaning_category":"プロセス指向の"}]}