{"word":"syncope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)失神、卒倒","english_definition":"temporary loss of consciousness caused by a fall in blood pressure.","examples":[{"sentence":"The patient experienced syncope after standing up too quickly.","translation":"患者は急に立ち上がった後、失神を経験した。"},{"sentence":"Syncope can be a symptom of various underlying medical conditions.","translation":"失神は、さまざまな基礎疾患の症状である可能性がある。"},{"sentence":"Vasovagal syncope is a common type of fainting spell.","translation":"血管迷走神経性失神は、一般的な失神の一種です。"}],"collocations":["vasovagal syncope (血管迷走神経性失神)","cardiac syncope (心臓性失神)","reflex syncope (反射性失神)","experience syncope (失神を経験する)","suffer from syncope (失神に苦しむ)"],"synonyms":["fainting","blackout","swoon","collapse","loss of consciousness"],"antonyms":["consciousness","awareness"]},{"part_of_speech":"noun","definition":"(言語学)語中音消失、シンコペーション","english_definition":"the omission of one or more sounds or letters from the middle of a word.","examples":[{"sentence":"'Ev'ry' is an example of syncope, where the 'e' in 'every' is omitted.","translation":"'Ev'ry'は、'every'の'e'が省略されたシンコペーションの例です。"},{"sentence":"Syncope is common in colloquial speech.","translation":"シンコペーションは口語でよく見られます。"},{"sentence":"The word 'bos'n' is a result of syncope from 'boatswain'.","translation":"'bos'n'という単語は、'boatswain'からのシンコペーションの結果です。"}],"collocations":["example of syncope (シンコペーションの例)","occur due to syncope (シンコペーションによって起こる)"],"synonyms":["elision","omission","contraction"],"antonyms":["epenthesis","addition"]}],"etymology":{"value":"From Late Latin *syncopa*, from Greek *synkopē* (συγκοπή) 'a cutting short, contraction of a syllable,' from *synkoptein* 'to strike together, cut up, cut short,' from *syn-* 'together' + *koptein* 'to strike.' The medical sense is from the notion of 'sudden cutting off' of consciousness. The linguistic sense refers to the 'cutting short' of a word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪŋkəpi/","syllables":"syn-co-pe"},"inflection":{"notes":"Plural: syncopes or syncopations (for the linguistic sense)."},"usage_notes":{"explanation":"The term \"syncope\" has two distinct meanings, one in medicine and one in linguistics. In medicine, it refers to a temporary loss of consciousness, often due to a drop in blood pressure. In linguistics, it refers to the omission of a sound or letter from the middle of a word. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a stroke and suffered from syncope.","correct":"✓ I fainted and suffered from syncope.","note":"Syncope is fainting, not a stroke. Strokes are more serious and involve brain damage."},{"incorrect":"✗ The syncope made the word longer.","correct":"✓ The syncope made the word shorter.","note":"Syncope in linguistics involves shortening a word, not lengthening it."}],"priority":"★★☆"},"related_words":{"derivatives":["syncopal (adjective: relating to or characterized by syncope)","syncopate (verb: to displace the beats or accents in (music or a rhythm) so that strong beats become weak and vice versa; to subject to syncope)","syncopation (noun: the displacement of beats or accents in music or a rhythm; the omission of sounds or letters from the middle of a word.)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"syncope\" is a technical term used in both medicine and linguistics. In a medical context, it refers to a temporary loss of consciousness, often described as fainting or passing out. In linguistics, it refers to the omission of a sound or letter from the middle of a word, a process that can change the pronunciation and sometimes the spelling of the word. Understanding which meaning is intended depends heavily on the context in which the word is used. For example, a doctor might discuss a patient's history of syncope, while a linguist might analyze instances of syncope in the evolution of a language.","priority":"★★☆"},"example_sentences":[{"sentence":"She experienced an episode of **syncope** while donating blood.","translation":"彼女は献血中に失神の発作を経験した。","type":"noun (medical)","meaning_category":"失神"},{"sentence":"**Syncope** is a common cause of falls in older adults.","translation":"失神は高齢者の転倒の一般的な原因です。","type":"noun (medical)","meaning_category":"失神"},{"sentence":"The **syncope** in 'cannot' to form 'can't' is a common example.","translation":"'cannot'が'can't'になる際のシンコペーションは一般的な例です。","type":"noun (linguistic)","meaning_category":"語中音消失"},{"sentence":"**Syncope** can alter the rhythm and flow of a word.","translation":"シンコペーションは単語のリズムと流れを変えることがあります。","type":"noun (linguistic)","meaning_category":"語中音消失"}]}