{"word":"pretervection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of passing by or going beyond; also, that which is passed by.","english_definition":"The act of passing by or beyond; also, that which is passed by.","examples":[{"sentence":"The pretervection of the moon across the sky was a beautiful sight.","translation":"月が空を通り過ぎる様子は美しい光景だった。"},{"sentence":"The pretervection of the topic during the conversation was noticeable.","translation":"会話中に話題がそらされたことは顕著だった。"}],"collocations":[],"synonyms":["passing by","overlooking","omission","neglect"],"antonyms":["attention","inclusion"],"notes":"This word is rare and somewhat archaic."}],"etymology":{"value":"From Latin praetervectio, from praetervehi (\"to carry past\"), from praeter (\"past, beyond\") + vehere (\"to carry\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːtərˈvɛkʃən/","syllables":"pre-ter-vec-tion"},"inflection":{"noun_plural":"pretervections"},"usage_notes":{"explanation":"'Pretervection' is a relatively rare and formal word. It describes the act of passing by something, either physically or metaphorically (such as an idea or topic). It can also refer to the thing that is passed by.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["pretervect (verb, rare)"],"related_terms":["praeterition (a similar but distinct term related to omission)"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pretervection' is a rare and formal word, not commonly used in modern English. It refers to the act of passing by or beyond something, or the thing that is passed by. Because of its rarity, it is unlikely to be encountered except in specialized or historical texts."},"example_sentences":[{"sentence":"The author noted the pretervection of crucial details in the historical account.","translation":"著者は、その歴史的記述において重要な詳細が省略されていることに気づいた。","type":"noun","meaning_category":"omission"},{"sentence":"The ship's pretervection of the island was swift.","translation":"その船が島を通り過ぎる様子は早かった。","type":"noun","meaning_category":"passing by"}]}