{"word":"mucivorous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"粘液を食べる、粘液食性の","english_definition":"Feeding on mucus.","examples":[{"sentence":"Some insects are mucivorous, obtaining nutrients from the mucus secreted by plants or animals.","translation":"昆虫の中には粘液食性のものがおり、植物や動物から分泌される粘液から栄養を得る。"},{"sentence":"The mucivorous habits of certain snails contribute to the cleanliness of aquatic environments.","translation":"特定のカタツムリの粘液食性の習性は、水生環境の清潔さに貢献している。"}],"collocations":["mucivorous insects","mucivorous snails","mucivorous diet","mucivorous feeding"],"synonyms":["mucophagic"],"antonyms":[]}],"etymology":{"value":"From Latin 'mucus' (slime, nasal discharge) + 'vorous' (eating, devouring).","priority":"★★☆"},"pronunciation":{"ipa":"/mjuːˈsɪvərəs/","syllables":"mu-civ-o-rous"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"'Mucivorous' is a relatively rare and specialized term used in biology and zoology to describe organisms that feed on mucus. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mucivorous animal ate grass.","correct":"✓ The mucivorous animal ate mucus.","note":"Mucivorous animals specifically eat mucus, not grass or other substances."}],"priority":"★☆☆"},"related_words":{"derivatives":["mucivore (noun: an animal that feeds on mucus)","mucophagy (noun: the practice of feeding on mucus)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mucivorous' is a technical term primarily used in scientific contexts, specifically in biology and zoology. It describes organisms that have a diet consisting of mucus. Due to its specialized nature, it is not commonly encountered in general reading or conversation. Understanding this word requires a strong vocabulary and familiarity with scientific terminology."},"example_sentences":[{"sentence":"The scientist studied the mucivorous feeding habits of the deep-sea snail.","translation":"科学者は深海カタツムリの粘液食性の食習慣を研究した。","type":"general","meaning_category":"feeding habits"},{"sentence":"Certain mites exhibit mucivorous behavior within beehives.","translation":"特定のダニは、ミツバチの巣箱内で粘液食性の行動を示す。","type":"behavior","meaning_category":"behavior"}]}