{"word":"redispersal","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再分散、再び分散すること","english_definition":"The act or process of dispersing again; the state of being dispersed again.","examples":[{"sentence":"The redispersal of the population after the disaster was a slow process.","translation":"災害後の人口の再分散は遅いプロセスでした。"},{"sentence":"The redispersal of the pigment particles is crucial for achieving a uniform color.","translation":"顔料粒子の再分散は、均一な色を実現するために重要です。"}],"collocations":["population redispersal","pigment redispersal","particle redispersal"],"synonyms":["re-scattering","re-distribution"],"antonyms":["agglomeration","aggregation","concentration"]}],"etymology":{"value":"Derived from \"disperse\" (to scatter) with the prefix \"re-\" (again).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːdɪˈspɜːrsəl/","syllables":"re-di-sper-sal"},"inflection":{"noun_plural":"redispersals"},"usage_notes":{"explanation":"\"Redispersal\" refers to the process of something that was previously dispersed coming back together and then being scattered again. It often implies a cycle of dispersal and re-concentration followed by another dispersal. It's commonly used in scientific and technical contexts, such as ecology (population redispersal) or materials science (particle redispersal).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The redispersal of the company's assets was a simple task.","correct":"✓ The redistribution of the company's assets was a simple task.","note":"\"Redispersal\" implies a cycle of dispersal and re-concentration, followed by another dispersal. If the assets are simply being distributed again, \"redistribution\" is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["redisperse (verb)","dispersal (noun)","disperse (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"redispersal\" is a relatively uncommon term, typically used in specialized contexts such as science, ecology, or materials engineering. It describes the process where something that has already been scattered or distributed is gathered again and then scattered once more. Understanding the prefix \"re-\" (again) and the root word \"dispersal\" (scattering) helps in grasping its meaning. It is not a word commonly encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The study examined the redispersal of seeds by wind after a period of aggregation.","translation":"その研究では、凝集期間後の風による種子の再分散を調査した。","type":"noun","meaning_category":"再分散 (seeds)"},{"sentence":"The redispersal of the refugees was managed by international aid organizations.","translation":"難民の再分散は、国際援助機関によって管理された。","type":"noun","meaning_category":"再分散 (refugees)"},{"sentence":"Effective redispersal of nanoparticles in the polymer matrix is essential for optimal material properties.","translation":"ポリマーマトリックス中のナノ粒子の効果的な再分散は、最適な材料特性に不可欠です。","type":"noun","meaning_category":"再分散 (nanoparticles)"}]}