{"word":"apoplexious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"脳卒中（発作）の、または脳卒中（発作）にかかりやすい","english_definition":"relating to or characteristic of apoplexy or stroke; prone to apoplexy or stroke.","examples":[{"sentence":"He had an apoplexious look on his face.","translation":"彼は卒中を起こしそうな顔つきだった。"},{"sentence":"The doctor warned him about his apoplexious condition.","translation":"医者は彼の卒中を起こしやすい状態について警告した。"}],"collocations":["apoplexious fit","apoplexious temperament","apoplexious condition"],"synonyms":["stroke-prone","cerebrovascular","stricken"],"antonyms":["healthy","vigorous"]}],"etymology":{"value":"Derived from 'apoplexy,' which comes from the Greek word 'apoplexia' meaning 'a striking away,' referring to the sudden loss of consciousness and motor function associated with stroke.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæpəˈplɛksiəs/","syllables":"a-po-plexi-ous"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Apoplexious' is a relatively uncommon term today, often replaced by more modern medical terminology related to stroke or cerebrovascular events. It can describe a person's physical state or appearance suggestive of an impending stroke, or a general predisposition to such events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was apoplexious with anger.","correct":"✓ He was furious with anger.","note":"While 'apoplexious' can describe a flushed or strained appearance, it primarily relates to stroke. 'Furious' or 'incensed' are better choices to describe extreme anger."}],"priority":"★☆☆"},"related_words":{"derivatives":["apoplexy (noun): 脳卒中、卒倒"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apoplexious' is a technical term related to the medical condition of apoplexy (stroke). It describes something that is characteristic of or related to a stroke, or someone who is prone to having a stroke. The word is not commonly used in everyday language and is more likely to appear in medical contexts or historical literature. Therefore, familiarity with medical terminology is needed to fully understand this word."},"example_sentences":[{"sentence":"His face turned red, and he looked almost apoplexious.","translation":"彼の顔は赤くなり、ほとんど卒中を起こしそうに見えた。","type":"adjective","meaning_category":"stroke-related appearance"},{"sentence":"The old man was warned to lower his blood pressure to avoid becoming apoplexious.","translation":"その老人は卒中にならないように血圧を下げるように警告された。","type":"adjective","meaning_category":"stroke-prone condition"}]}