{"word":"Domify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(transitive, computing) To convert (something) into a DOM (Document Object Model) representation.","english_definition":"To convert (something) into a DOM (Document Object Model) representation.","examples":[{"sentence":"The library domifies the JSON response for easier manipulation.","translation":"そのライブラリは、操作を容易にするためにJSONレスポンスをDOM表現に変換します。"}],"collocations":[],"synonyms":["serialize","parse"],"antonyms":["stringify"],"notes":"Often used in the context of web development and data processing.","related_terms":["DOM","Document Object Model","serialization","parsing"]}],"etymology":{"value":"A blend of 'DOM' (Document Object Model) and '-ify' (a suffix meaning 'to make or become').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɒmɪfaɪ/","syllables":"Dom-i-fy"},"inflection":{"verb_forms":{"present_simple":["Domify","Domifies"],"past_simple":"Domified","past_participle":"Domified","present_participle":"Domifying"}},"usage_notes":{"explanation":"'Domify' is a technical term primarily used in computer science, especially in web development. It refers to the process of converting data or a data structure into a Document Object Model (DOM) representation. The DOM is a programming interface for HTML and XML documents. It represents the page so that programs can change the document structure, style, and content. Domifying something allows it to be easily manipulated and accessed using DOM methods.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Domification"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Domify' is a specialized term used in web development and computer science. It involves converting data into a Document Object Model (DOM), which is a structured representation of HTML or XML documents. This allows for programmatic manipulation of the document's content and structure. Understanding this term requires familiarity with web development concepts and data structures."},"example_sentences":[{"sentence":"The server-side code domifies the XML data before sending it to the client.","translation":"サーバー側のコードは、XMLデータをクライアントに送信する前にDOM化します。","type":"verb","meaning_category":"computing"}]}