{"word":"indicial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学) 指数の、指標の","english_definition":"Relating to or expressed in indices or exponents; pertaining to an index or indicator.","examples":[{"sentence":"The indicial equation is used to find solutions to certain differential equations.","translation":"指標方程式は、特定の微分方程式の解を見つけるために使用される。"},{"sentence":"Indicial notation is a way of representing tensors using indices.","translation":"指標記法は、指標を使ってテンソルを表す方法である。"}],"collocations":["indicial equation","indicial notation","indicial tensor"],"synonyms":["exponential","indexed"],"antonyms":[]}],"etymology":{"value":"From index + -ial.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈdɪʃəl/","syllables":"in-di-cial"},"inflection":{},"usage_notes":{"explanation":"The term \"indicial\" is primarily used in mathematics and physics, particularly in the context of differential equations, tensor analysis, and related fields. It refers to something that involves indices (subscripts or superscripts) used to label components of a mathematical object or to indicate exponents.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["index","indices"],"related_terms":["tensor","exponent","subscript","superscript"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term \"indicial\" is highly specialized and primarily used within advanced mathematical and physics contexts. Understanding its meaning requires familiarity with concepts such as indices, exponents, tensors, and differential equations. It is unlikely to be encountered outside of these specific fields."},"example_sentences":[{"sentence":"The **indicial** roots of the differential equation determine the form of the solution.","translation":"その微分方程式の指標根は、解の形を決定する。","type":"example","meaning_category":"mathematics"},{"sentence":"**Indicial** notation simplifies the manipulation of tensor equations.","translation":"指標記法は、テンソル方程式の操作を簡略化する。","type":"example","meaning_category":"mathematics"}]}