{"word":"quadricotyledonous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"双子葉植物の、子葉が4枚ある","english_definition":"Having four cotyledons (seed leaves); belonging to the dicotyledons.","examples":[{"sentence":"Quadricotyledonous plants are a subset of dicotyledonous plants.","translation":"四子葉植物は、双子葉植物の一種です。"},{"sentence":"The quadricotyledonous nature of the seedling was evident upon examination.","translation":"その苗の子葉が4枚であることは、観察によって明らかになった。"}],"collocations":["quadricotyledonous plant","quadricotyledonous seedling"],"synonyms":["dicotyledonous","dicot"],"antonyms":["monocotyledonous"],"notes":"This term is primarily used in botany."}],"etymology":{"value":"From 'quadri-' (four) + 'cotyledon' (seed leaf) + '-ous' (having or possessing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɒdrɪˌkɒtɪˈliːdənəs/","syllables":"quad-ri-cot-y-le-don-ous"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"The term 'quadricotyledonous' describes plants that have four cotyledons, or seed leaves, within their seeds. While most dicotyledonous plants have two cotyledons, this term specifies a less common variation. It is primarily used in botanical contexts for precise classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is quadricotyledon.","correct":"✓ The plant is quadricotyledonous.","note":"'Quadricotyledon' is a noun referring to a plant with four cotyledons, while 'quadricotyledonous' is the adjective describing the plant."}],"priority":"★★☆"},"related_words":{"derivatives":["quadricotyledon (noun)","cotyledon (noun)","dicotyledonous (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in botanical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'quadricotyledonous' is a specialized botanical term used to describe plants with four cotyledons. It is not commonly used in everyday language and is mainly found in scientific or academic contexts related to botany and plant classification. Understanding this term requires familiarity with basic botanical concepts such as cotyledons and dicotyledonous plants."},"example_sentences":[{"sentence":"The botanist identified the species as quadricotyledonous.","translation":"植物学者はその種を四子葉植物であると特定した。","type":"general","meaning_category":"botany"},{"sentence":"The presence of four cotyledons confirmed its quadricotyledonous classification.","translation":"4枚の子葉の存在が、その植物が四子葉植物であるという分類を裏付けた。","type":"scientific","meaning_category":"botany"}]}