{"word":"uniauriculated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"片方の耳しかない、または片方の耳が特徴的な","english_definition":"Having only one auricle or ear; characterized by having one ear.","examples":[{"sentence":"The uniauriculated statue was a unique find.","translation":"片耳しかないその像は、他に類を見ない発見だった。"},{"sentence":"The experiment involved uniauriculated hearing tests.","translation":"その実験には、片耳聴覚検査が含まれていた。"}],"collocations":["uniauriculated statue","uniauriculated hearing test"],"synonyms":["one-eared","single-eared"],"antonyms":["biauriculated","two-eared"]}],"etymology":{"value":"Derived from the Latin words 'unus' (one), 'auris' (ear), and the suffix '-ated' (having).","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːniɔːˈrɪkjʊleɪtɪd/","syllables":"u-ni-au-ric-u-lat-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"This word is relatively rare and primarily used in technical or descriptive contexts, such as in biology, anatomy, or art history. It specifically refers to something or someone possessing only one ear or having a prominent characteristic related to a single ear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal was unauriculated because it was deaf.","correct":"✓ The animal was unauriculated because it was born with only one ear.","note":"Uniauriculated refers to the physical presence of only one ear, not deafness. Deafness can occur with both ears present."}],"priority":"★☆☆"},"related_words":{"derivatives":["auricle","auricular","biauriculated"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'uniauriculated' is a specialized adjective used to describe something having only one ear. It is not commonly encountered in everyday language and is more likely to appear in scientific, medical, or artistic contexts where precise anatomical descriptions are necessary. Understanding the etymology (Latin roots for 'one' and 'ear') can aid in comprehension.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a uniauriculated sculpture from ancient Greece.","translation":"博物館には古代ギリシャの片耳の彫刻が展示されていた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The study focused on the challenges faced by uniauriculated individuals in sound localization.","translation":"その研究は、片耳の人が音源定位において直面する課題に焦点を当てた。","type":"adjective","meaning_category":"Medical/Scientific"}]}