{"word":"patch-box","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(歴史的な)付けぼくろ入れ、化粧道具入れ","english_definition":"A small ornamental box, often made of precious materials, used to hold beauty patches (small pieces of silk or velvet) that were fashionable in the 17th and 18th centuries for applying to the face to conceal blemishes or enhance beauty.","examples":[{"sentence":"She carefully selected a patch from her patch-box to place near her lip.","translation":"彼女は唇の近くに置くために、パッチボックスから慎重にパッチを選んだ。"},{"sentence":"The antique patch-box was a valuable family heirloom.","translation":"そのアンティークのパッチボックスは貴重な家宝だった。"}],"collocations":["antique patch-box","silver patch-box","enamel patch-box","ornate patch-box"],"synonyms":["beauty patch container","cosmetic box","powder box (sometimes)"],"antonyms":[],"related_images":[]}],"etymology":{"value":"Derived from the combination of 'patch' (referring to the beauty patches themselves) and 'box' (the container for holding them).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpætʃˌbɒks/","syllables":"patch-box"},"inflection":{"noun_plural":"patch-boxes"},"usage_notes":{"explanation":"A patch-box is a specific type of small box designed to hold beauty patches, which were small pieces of fabric used as a cosmetic accessory in the 17th and 18th centuries. These boxes were often decorative and made from valuable materials, reflecting the status and wealth of their owners. The term is primarily used in historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She kept her jewelry in a patch-box.","correct":"✓ She kept her jewelry in a jewelry box.","note":"Patch-boxes were specifically for beauty patches, not general jewelry. Use 'jewelry box' for jewelry. "},{"incorrect":"✗ He found a modern patch-box at the store.","correct":"✓ He found an antique patch-box at the museum.","note":"Patch-boxes are historical items. They are not commonly found in modern stores. They are more likely to be found in antique shops or museums."}],"priority":"★★☆"},"related_words":{"derivatives":["patch (noun): a small piece of material used to mend or cover something.","box (noun): a container with a flat base and sides and a lid."],"related_items":["beauty patch (noun): a small piece of fabric used as a cosmetic accessory.","snuffbox (noun): a small ornamental box for holding snuff."],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Very rare word)","frequency_google_ngram":"Very low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'patch-box' refers to a specific historical item, a small ornamental box used to hold beauty patches during the 17th and 18th centuries. Understanding this term requires knowledge of historical cosmetic practices. The word is not commonly used in modern English. "},"example_sentences":[{"sentence":"The museum displayed a collection of ornate patch-boxes from the Georgian era.","translation":"博物館には、ジョージ王朝時代の華やかなパッチボックスのコレクションが展示されていた。","type":"noun","meaning_category":"historical cosmetic container"},{"sentence":"She admired the delicate craftsmanship of the antique patch-box.","translation":"彼女はアンティークのパッチボックスの繊細な職人技に感心した。","type":"noun","meaning_category":"historical cosmetic container"}]}