{"word":"Konkordanz","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(文献学) コンコルダンス、索引、索引簿","english_definition":"(philology) concordance, index","examples":[{"sentence":"Die Konkordanz der Lutherbibel ist ein wichtiges Hilfsmittel für Bibelstudien.","translation":"ルター聖書のコンコルダンスは、聖書研究のための重要な補助手段です。"},{"sentence":"Eine Konkordanz listet alle Vorkommnisse eines Wortes in einem Text auf.","translation":"コンコルダンスは、テキスト中のある単語のすべての出現箇所をリストアップします。"}],"collocations":["eine Konkordanz erstellen (コンコルダンスを作成する)","eine Konkordanz benutzen (コンコルダンスを使用する)","alphabetische Konkordanz (アルファベット順コンコルダンス)"],"synonyms":["Index","Register","Stichwortverzeichnis"],"antonyms":[]},{"part_of_speech":"noun","definition":"(言語学) 一致、調和、協和","english_definition":"(linguistics) agreement, harmony, concord","examples":[{"sentence":"Die Konkordanz zwischen Subjekt und Verb ist ein grundlegendes Prinzip der deutschen Grammatik.","translation":"主語と動詞の一致は、ドイツ語文法の基本的な原則です。"},{"sentence":"Es besteht Konkordanz zwischen den Meinungen der Experten.","translation":"専門家の意見の間には一致が見られます。"}],"collocations":["Konkordanz zwischen Subjekt und Verb (主語と動詞の一致)","Konkordanz der Meinungen (意見の一致)","grammatische Konkordanz (文法的一致)"],"synonyms":["Übereinstimmung","Einklang","Harmonie"],"antonyms":["Diskrepanz","Widerspruch"]},{"part_of_speech":"noun","definition":"(政治) 政教協約、コンコルダート","english_definition":"(politics) concordat","examples":[{"sentence":"Das Reichskonkordat von 1933 regelte die Beziehungen zwischen dem Deutschen Reich und dem Vatikan.","translation":"1933年のライヒスコンコルダートは、ドイツ帝国とバチカン間の関係を規制しました。"}],"collocations":["ein Konkordat abschließen (政教協約を締結する)","das Reichskonkordat (ライヒスコンコルダート)"],"synonyms":["Konkordat","Staatskirchenvertrag"],"antonyms":[]}],"etymology":{"value":"Lateinisch concordantia, von concordans, dem Partizip Präsens von concordare (übereinstimmen).","priority":"★★☆"},"pronunciation":{"ipa":"/kɔŋkɔrˈdant͡s/","syllables":"Kon-kor-danz"},"inflection":{"noun_gender":"feminine","noun_plural":"Konkordanzen"},"usage_notes":{"explanation":"Das Wort \"Konkordanz\" hat je nach Kontext unterschiedliche Bedeutungen. In der Philologie bezeichnet es ein alphabetisches Verzeichnis aller Stellen, an denen ein bestimmtes Wort in einem Text vorkommt. In der Linguistik bezieht es sich auf die Übereinstimmung zwischen grammatischen Elementen. Im politischen Kontext kann es sich auf einen Vertrag zwischen dem Staat und der Kirche beziehen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Die Konkordanz ist sehr ruhig.","correct":"Die Konkordanz ist sehr hilfreich.","note":"Verwechslung mit dem Wort \"Konkord\" (Eintracht, Harmonie). \"Konkordanz\" im Sinne von Index kann nicht ruhig sein, sondern höchstens hilfreich."}],"priority":"★★☆"},"related_words":{"derivatives":["konkordant (übereinstimmend)","Konkordat (政教協約)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Geringe Frequenz","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Konkordanz\" ist ein Fachbegriff, der in verschiedenen Disziplinen verwendet wird. Im Bereich der Literaturwissenschaft und Theologie bezeichnet er ein alphabetisches Verzeichnis aller Vorkommnisse eines bestimmten Wortes in einem Text, beispielsweise der Bibel. In der Linguistik bezieht sich \"Konkordanz\" auf die grammatische Übereinstimmung zwischen Satzteilen, wie beispielsweise Subjekt und Verb. Im politischen Kontext kann \"Konkordanz\" einen Vertrag zwischen Staat und Kirche bezeichnen. Aufgrund seiner fachspezifischen Verwendung und der unterschiedlichen Bedeutungen je nach Kontext ist das Wort eher dem fortgeschrittenen Sprachgebrauch zuzuordnen."},"example_sentences":[{"sentence":"Die Forscher erstellten eine Konkordanz aller Schlüsselwörter in den Dokumenten.","translation":"研究者たちは、文書中のすべてのキーワードのコンコルダンスを作成しました。","type":"noun","meaning_category":"文献学"},{"sentence":"Die Konkordanz zwischen den Zeugenaussagen war überraschend.","translation":"証言の一致は驚くべきものでした。","type":"noun","meaning_category":"言語学"},{"sentence":"Das Konkordat garantierte der Kirche bestimmte Rechte.","translation":"政教協約は教会に特定の権利を保証しました。","type":"noun","meaning_category":"政治"}]}