{"word":"decentred","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"中心から外れた、中心を失った、脱中心化された","english_definition":"Having moved away from the center; not having a clear center or focus; having been removed from a central position or authority.","examples":[{"sentence":"The city felt decentred after the earthquake.","translation":"地震の後、その都市は中心を失ったように感じられた。"},{"sentence":"Postmodern thought often presents a decentred view of the self.","translation":"ポストモダンの思想は、しばしば脱中心化された自己観を提示する。"},{"sentence":"The company's structure became decentred as it expanded globally.","translation":"会社がグローバルに拡大するにつれて、その組織構造は脱中心化された。"}],"collocations":["decentred self (脱中心化された自己)","decentred authority (分散された権力)","decentred structure (分散型構造)","decentred world (中心を失った世界)"],"synonyms":["uncentered","off-center","displaced","distributed","fragmented"],"antonyms":["centered","centralized","focused","unified"]},{"part_of_speech":"verb (past participle)","definition":"(decentreの過去分詞)中心から外す、脱中心化する","english_definition":"Past participle of 'decentre': to move away from the center; to remove from a central position or authority; to redistribute power or focus.","examples":[{"sentence":"Power was decentred from the capital to the regional offices.","translation":"権力は首都から地方事務所へと脱中心化された。"},{"sentence":"The curriculum was decentred to include more diverse perspectives.","translation":"カリキュラムは、より多様な視点を含めるために脱中心化された。"},{"sentence":"The project's focus was decentred after the initial findings.","translation":"プロジェクトの焦点は、初期の調査結果の後、中心から外された。"}],"collocations":["decentre power (権力を分散化する)","decentre authority (権威を分散化する)","decentre the focus (焦点を分散化する)"],"synonyms":["redistribute","disperse","scatter","diffuse"],"antonyms":["centralize","concentrate","focus"]}],"etymology":{"value":"'Decentre' is formed from the prefix 'de-' (meaning 'away from' or 'reversal') and 'centre'. It implies a movement away from a central point or authority. The past participle 'decentred' indicates a state of having been moved away from the center.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈsɛntəd/","syllables":"de-cen-tred"},"inflection":{"verb_forms":{"present_simple":["decentre","decentres"],"past_simple":"decentred","past_participle":"decentred","present_participle":"decentring"}},"usage_notes":{"explanation":"'Decentred' is often used in academic and theoretical contexts, particularly in postmodernism and critical theory, to describe the lack of a single, dominant center of meaning, power, or identity. It can also refer to the practical redistribution of power or resources away from a central authority. The term suggests a shift away from traditional hierarchical structures and a move towards more distributed or fragmented systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The organization was discentered.","correct":"✓ The organization was decentred.","note":"Use 'decentred' (with 'de-') to indicate a shift away from the center, not 'discentered' (which is less common and may imply something different)."},{"incorrect":"✗ The decentered building.","correct":"✓ The decentred building / ✓ The off-center building.","note":"While 'decentred' is acceptable, 'off-center' might be more common and easily understood in describing a physical object that is not symmetrical. In more abstract contexts, 'decentred' is preferred."}],"priority":"★★☆"},"related_words":{"derivatives":["decentre (verb)","decentration (noun)","decentralization (noun)","decentralize (verb)"],"synonyms":["non-central","peripheral","distributed"],"antonyms":["central","centric","centered"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and theoretical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Decentred' is a more advanced term often encountered in academic discussions, particularly in fields like sociology, philosophy, and literary criticism. It describes something that lacks a clear center or has had its central authority or focus removed or redistributed. For example, a 'decentred self' in postmodern thought refers to the idea that individual identity is not fixed or unified but rather fragmented and fluid. The word implies a shift away from traditional, hierarchical structures and a move towards more distributed or fragmented systems of power, meaning, or identity. Understanding this term requires familiarity with abstract concepts and theoretical frameworks.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel presents a **decentred** narrative, with multiple perspectives and no clear protagonist.","translation":"その小説は、複数の視点があり明確な主人公がいない、脱中心化された物語を提示する。","type":"adjective","meaning_category":"中心を失った"},{"sentence":"The company **decentred** its operations to better serve local markets.","translation":"会社は、地元の市場により良く対応するために、事業を脱中心化した。","type":"verb (past participle)","meaning_category":"脱中心化する"},{"sentence":"The concept of a **decentred** universe challenges traditional notions of order and hierarchy.","translation":"脱中心化された宇宙という概念は、秩序と階層の伝統的な概念に挑戦する。","type":"adjective","meaning_category":"中心を失った"},{"sentence":"The curriculum was **decentred** to include diverse voices and perspectives.","translation":"カリキュラムは、多様な声と視点を含めるために脱中心化された。","type":"verb (past participle)","meaning_category":"脱中心化する"}]}