{"word":"Post-pentecostal","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"ポスト・ペンテコステ運動の、またはそれに関連する","english_definition":"Relating to or denoting a movement that emerged after Pentecostalism, characterized by a focus on social justice, environmental concerns, and a more inclusive theology.","examples":[{"sentence":"The post-pentecostal church emphasized community outreach.","translation":"そのポスト・ペンテコステ運動の教会は、地域社会への働きかけを重視した。"},{"sentence":"Post-pentecostal theology often critiques traditional Pentecostal views on prosperity.","translation":"ポスト・ペンテコステ運動の神学は、しばしば伝統的なペンテコステ運動の繁栄に関する見解を批判する。"}],"collocations":["post-pentecostal theology","post-pentecostal church","post-pentecostal movement"],"synonyms":["neo-pentecostal","charismatic"],"antonyms":["traditional pentecostal","classical pentecostal"]},{"part_of_speech":"noun","definition":"ポスト・ペンテコステ運動の信者","english_definition":"A follower or adherent of the Post-pentecostal movement.","examples":[{"sentence":"Post-pentecostals often advocate for a more holistic approach to faith.","translation":"ポスト・ペンテコステ運動の信者は、信仰に対するより全体的なアプローチを提唱することが多い。"}],"collocations":["a group of Post-pentecostals"],"synonyms":["neo-pentecostal","charismatic"],"antonyms":["traditional pentecostal","classical pentecostal"]}],"etymology":{"value":"\"Post-\" (after) + \"Pentecostal\" (referring to Pentecostalism, a renewal movement within Protestant Christianity).","priority":"中"},"pronunciation":{"ipa":"/ˌpoʊstˌpɛntɪˈkɔstəl/","syllables":"post-pen-ti-cos-tal"},"inflection":{"notes":"Adjective forms: comparative (more post-pentecostal), superlative (most post-pentecostal). Noun form: Post-pentecostals (plural)"},"usage_notes":{"explanation":"\"Post-pentecostal\" refers to a diverse set of movements and theologies that have emerged from or in reaction to classical Pentecostalism. These movements often retain some Pentecostal characteristics (such as belief in spiritual gifts) but also incorporate new emphases, such as social justice, environmental stewardship, and a more critical engagement with culture. The term is relatively new and its usage can vary.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ Postpentecostal","correct":"✓ Post-pentecostal","note":"The word is usually hyphenated."}],"priority":"低"},"related_words":{"derivatives":["Pentecostalism","Neo-pentecostalism","Charismatic"],"phrasal_verbs":[],"priority":"中"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The term \"Post-pentecostal\" is a specialized term used within theological and religious studies contexts. It describes movements that have evolved from or reacted to Pentecostalism, often incorporating social justice concerns and a more inclusive theology. Understanding this term requires familiarity with Pentecostalism and broader trends in contemporary Christianity."},"example_sentences":[{"sentence":"The conference explored the evolving landscape of post-pentecostal spirituality.","translation":"その会議では、ポスト・ペンテコステ運動の精神性の進化する状況が探求された。","type":"adjective","meaning_category":"Relating to Post-pentecostalism"},{"sentence":"Many post-pentecostals are actively involved in environmental activism.","translation":"多くのポスト・ペンテコステ運動の信者は、環境保護活動に積極的に参加している。","type":"noun","meaning_category":"Follower of Post-pentecostalism"}]}