{"word":"Astigmatism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乱視","english_definition":"A common vision condition that causes blurred vision due to the irregular shape of the cornea or lens.","examples":[{"sentence":"Astigmatism can be corrected with glasses or contact lenses.","translation":"乱視は眼鏡やコンタクトレンズで矯正できます。"},{"sentence":"Many people have some degree of astigmatism.","translation":"多くの人が程度の差はあれど乱視を持っています。"},{"sentence":"The doctor diagnosed her with astigmatism during the eye exam.","translation":"医師は眼科検診で彼女が乱視であると診断しました。"}],"collocations":["have astigmatism (乱視である)","correct astigmatism (乱視を矯正する)","astigmatism correction (乱視矯正)","mild astigmatism (軽度の乱視)","severe astigmatism (重度の乱視)","astigmatism test (乱視検査)"],"synonyms":["blurred vision (ぼやけた視界)","irregular cornea (不正な角膜)"],"antonyms":["perfect vision (完全な視力)","normal vision (正常な視力)"]}],"etymology":{"value":"From Greek ἀ- (a-, \"without\") + στίγμα (stigma, \"mark, spot\") + -ισμός (-ismos, \"condition\"). Literally, \"condition without a point,\" referring to the inability of the eye to focus light to a single point.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈstɪɡmətɪzəm/","syllables":"a-stig-ma-tism"},"inflection":{"noun_plural":"astigmatisms"},"usage_notes":{"explanation":"\"Astigmatism\" refers to a refractive error in the eye where the cornea or lens is irregularly shaped, causing light to focus unevenly on the retina. This results in blurred or distorted vision at all distances. It is a common condition and is often present from birth. It can occur in combination with other refractive errors like nearsightedness (myopia) or farsightedness (hyperopia).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a astigmatism.","correct":"✓ I have astigmatism.","note":"\"Astigmatism\" is a noncount noun, so it does not typically take the indefinite article \"a\" unless you are referring to a specific type or instance of it. However, it is more common to say 'I have astigmatism' or 'I have mild astigmatism'."},{"incorrect":"✗ My astigmatism is very bad, I can't see nothing.","correct":"✓ My astigmatism is very bad, I can't see anything.","note":"Avoid double negatives. Use 'anything' instead of 'nothing' in a negative sentence."},{"incorrect":"✗ Astigmatism is when your eyes are blurry.","correct":"✓ Astigmatism is a condition that causes blurry vision.","note":"Provide a more precise definition. Astigmatism is a condition, not just the state of having blurry eyes."}],"priority":"★★☆"},"related_words":{"derivatives":["astigmatic (adjective: 乱視の)","astigmatically (adverb: 乱視的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Astigmatism\" is a medical term referring to a common vision problem caused by an irregularly shaped cornea or lens, which prevents light from focusing correctly on the retina. This results in blurred vision at any distance. It's often corrected with glasses, contact lenses, or refractive surgery. While the term itself is not frequently used in everyday conversation, understanding the concept is important for those experiencing vision problems or discussing eye health with a medical professional."},"example_sentences":[{"sentence":"The optometrist explained that I have a mild case of astigmatism.","translation":"検眼医は、私に軽度の乱視があると説明しました。","type":"general"},{"sentence":"Special contact lenses are designed to correct astigmatism.","translation":"特別なコンタクトレンズは乱視を矯正するように設計されています。","type":"treatment"},{"sentence":"Astigmatism can cause headaches and eye strain.","translation":"乱視は頭痛や眼精疲労を引き起こす可能性があります。","type":"symptoms"}]}