{"word":"unflamboyant","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"派手でない、華やかでない、控えめな","english_definition":"not flamboyant; not showy or ostentatious; restrained.","examples":[{"sentence":"She chose an unflamboyant dress for the occasion.","translation":"彼女はその機会のために派手でないドレスを選んだ。"},{"sentence":"The restaurant's decor was elegant but unflamboyant.","translation":"そのレストランの装飾は上品だが、華やかではなかった。"},{"sentence":"He led an unflamboyant life, dedicated to his work.","translation":"彼は仕事に専念し、控えめな生活を送った。"}],"collocations":["unflamboyant style","unflamboyant personality","unflamboyant design","unflamboyant approach"],"synonyms":["restrained","understated","modest","simple","unostentatious","unshowy","conservative"],"antonyms":["flamboyant","ostentatious","showy","extravagant","gaudy","flashy"]}],"etymology":{"value":"接頭辞 un-（～でない）+ flamboyant（華やかな、派手な）","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnflæmˈbɔɪənt/","syllables":"un-flam-boy-ant"},"inflection":{"adjective_forms":{"comparative":"more unflamboyant","superlative":"most unflamboyant"}},"usage_notes":{"explanation":"\"Unflamboyant\" describes something or someone lacking in flamboyance, meaning they are not showy, ostentatious, or attention-grabbing. It suggests a preference for simplicity, modesty, and restraint. It is often used to describe styles, personalities, or approaches that are understated and avoid unnecessary embellishment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unflamboyant with his money, spending it all quickly.","correct":"✓ He was not unflamboyant with his money, spending it all quickly.","note":"\"Unflamboyant\" means not showy or extravagant. If someone spends money quickly, they are likely being flamboyant, not unflamboyant. The sentence would need to be reworded to accurately reflect the meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["unflamboyantly (adverb)","flamboyant (adjective)","flamboyance (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unflamboyant\" is a relatively uncommon word that means \"not flamboyant.\" To understand it, you need to know what \"flamboyant\" means. \"Flamboyant\" describes something or someone that is showy, elaborate, and attention-grabbing. Therefore, \"unflamboyant\" describes the opposite: something or someone that is restrained, modest, and understated. This word is most likely to appear in formal writing or discussions about style, design, or personality.","example_sentences":[]},"example_sentences":[{"sentence":"The CEO's unflamboyant leadership style inspired trust among the employees.","translation":"そのCEOの派手でないリーダーシップスタイルは、従業員からの信頼を得た。","type":"adjective","meaning_category":"控えめな"},{"sentence":"Despite her wealth, she maintained an unflamboyant lifestyle.","translation":"彼女は富にもかかわらず、質素なライフスタイルを維持した。","type":"adjective","meaning_category":"派手でない"},{"sentence":"The architect chose an unflamboyant design for the new museum, focusing on functionality.","translation":"建築家は新しい美術館のために、機能性を重視した、華やかでないデザインを選んだ。","type":"adjective","meaning_category":"華やかでない"}]}