{"word":"subhemispherically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半球の下部で、または半球にわずかに及ばない程度に","english_definition":"In a manner relating to the lower part of a hemisphere, or to a degree that is slightly less than hemispherical.","examples":[{"sentence":"The light was distributed subhemispherically, illuminating the lower portion of the room.","translation":"光は半球の下部に分布し、部屋の下部を照らした。"},{"sentence":"The dome was constructed subhemispherically, providing a unique architectural feature.","translation":"ドームは半球にわずかに及ばない程度に構築され、独特の建築的特徴を提供した。"}],"collocations":["distributed subhemispherically","constructed subhemispherically"],"synonyms":["partially","incompletely","almost"],"antonyms":["hemispherically","completely"],"notes":"This word is relatively rare and technical, often used in scientific or architectural contexts."}],"etymology":{"value":"Derived from the prefix 'sub-' (meaning 'under' or 'less than'), combined with 'hemispherical' (relating to a hemisphere).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˌhɛmɪˈsfɛrɪkli/","syllables":"sub-hem-i-spher-i-cal-ly"},"inflection":{"notes":"As an adverb, it does not inflect."},"usage_notes":{"explanation":"The term 'subhemispherically' is used to describe something that is less than a full hemisphere or located in the lower part of a hemisphere. It is often found in technical or descriptive contexts where precise spatial relationships are important.","priority":"★★☆"},"related_words":{"derivatives":["subhemisphere (noun)","hemispherical (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'subhemispherically' is a technical term used to describe something that is less than a full hemisphere or located in the lower part of a hemisphere. It is rarely used in everyday language and is more common in scientific or architectural contexts. Understanding this word requires a strong vocabulary and familiarity with technical language."}}