{"word":"Estrich","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(建築) 塗り床、セルフレベリング材","english_definition":"(construction) A bound or unbound screed used as a level surface for flooring.","examples":[{"sentence":"The architect specified an anhydrite Estrich for its self-leveling properties.","translation":"建築家は、自己水平調整特性のために、無水石膏エストリッヒを指定しました。"}],"collocations":["anhydrite Estrich","cement Estrich","floating Estrich"],"synonyms":["screed","leveling compound"],"antonyms":[]}],"etymology":{"value":"From German Estrich, from Middle High German estrich, from Old High German estrih, from Late Latin astracum, from Latin astracus, from Ancient Greek ὄστρακον (óstrakon, “tile, potsherd”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛstʁɪç/","syllables":"Es-trich"},"inflection":{"noun_plural":"Estriche (German)"},"usage_notes":{"explanation":"'Estrich' is a technical term primarily used in construction and architecture, especially in German-speaking countries. It refers to a type of screed or leveling compound used to create a smooth, even surface on which to lay flooring. The term is not commonly used in everyday English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy some Estrich for my bathroom renovation at the local hardware store.","correct":"✓ I need to buy some self-leveling compound for my bathroom renovation at the local hardware store.","note":"In a general hardware store outside of German-speaking regions, 'self-leveling compound' or 'screed' would be more commonly understood."}],"priority":"★★★"},"related_words":{"derivatives":["Estrichleger (German: screed installer)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Estrich' is a specialized term used in construction and architecture, particularly in German-speaking contexts. It refers to a type of screed or leveling compound used to create a smooth, even surface for flooring. Due to its technical nature and limited usage outside specific professional fields, it is not a common term in general English. Understanding this term requires familiarity with construction terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The underfloor heating was installed before the cement Estrich was applied.","translation":"床暖房は、セメントエストリッヒを適用する前に設置されました。","type":"noun","meaning_category":"construction material"},{"sentence":"A thin layer of Estrich was used to level the uneven concrete floor.","translation":"薄い層のエストリッヒが、不均一なコンクリート床を水平にするために使用されました。","type":"noun","meaning_category":"construction material"}]}