{"word":"Metaphysicous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Rare) Relating to or characteristic of metaphysics.","english_definition":"(Rare) Relating to or characteristic of metaphysics.","examples":[{"sentence":"The author's writing style is often described as metaphysicous, delving into abstract concepts and philosophical inquiries.","translation":"その著者の文体は、抽象的な概念や哲学的な探求を掘り下げる、形而上学的であるとよく評される。"}],"collocations":["metaphysicous arguments","metaphysicous discussions","metaphysicous nature"],"synonyms":["metaphysical","abstract","philosophical","theoretical"],"antonyms":["physical","concrete","practical"]}],"etymology":{"value":"Derived from 'metaphysics' (the branch of philosophy dealing with the first principles of things, including abstract concepts such as being, knowing, substance, cause, identity, time, and space) with the suffix '-ous' (having the quality of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈfɪzɪkəs/","syllables":"met-a-phys-i-cous"},"inflection":{"adjective_forms":{"comparative":"more Metaphysicous","superlative":"most Metaphysicous"}},"usage_notes":{"explanation":"'Metaphysicous' is a relatively rare adjective used to describe something that is related to or characteristic of metaphysics. It suggests a focus on abstract, philosophical, or theoretical concepts rather than concrete or practical matters. The more common and widely accepted adjective is 'metaphysical'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metaphysicous properties of the object were easily observed.","correct":"✓ The metaphysical properties of the object were easily observed.","note":"Use 'metaphysical' instead of 'metaphysicous' as it is the more common and accepted term."}],"priority":"★★☆"},"related_words":{"derivatives":["metaphysics (noun)","metaphysician (noun)","metaphysical (adjective)","metaphysically (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adjective 'metaphysicous' is a rare and somewhat archaic term, meaning 'related to metaphysics'. It is seldom used in modern English; the more common and accepted form is 'metaphysical'. Its use suggests a high level of philosophical or academic discourse. Because of its rarity, it is best to use 'metaphysical' instead to ensure clarity and avoid sounding overly pretentious or obscure."},"example_sentences":[{"sentence":"His metaphysicous musings often left his audience perplexed.","translation":"彼の形而上学的な考察は、聴衆をしばしば困惑させた。","type":"adjective","meaning_category":"Relating to metaphysics"},{"sentence":"The novel explored metaphysicous themes of existence and reality.","translation":"その小説は、存在と現実という形而上学的なテーマを探求した。","type":"adjective","meaning_category":"Characteristic of metaphysics"}]}