{"word":"Departisanize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"超党派化する、党派色をなくす、政治的中立化する","english_definition":"To remove or reduce partisan influence or affiliation from something.","examples":[{"sentence":"The goal is to departisanize the election process to ensure fairness.","translation":"目標は、公平性を確保するために選挙プロセスを超党派化することです。"},{"sentence":"We need to departisanize education policy so that it benefits all students, regardless of political affiliation.","translation":"政治的所属に関係なく、すべての学生に利益をもたらすように、教育政策を超党派化する必要があります。"},{"sentence":"The committee was formed to departisanize the redistricting process.","translation":"委員会は、選挙区再編プロセスを超党派化するために設立されました。"}],"collocations":["departisanize the process","departisanize the policy","departisanize the committee"],"synonyms":["depoliticize","neutralize","non-partisan","unpoliticize"],"antonyms":["politicize","partisanize"]}],"etymology":{"value":"Formed by adding the prefix 'de-' (meaning 'remove' or 'reverse') to 'partisanize,' which means to make something partisan or affiliated with a particular political party.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈpɑːrtɪzənaɪz/","syllables":"de-par-ti-san-ize"},"inflection":{"verb_forms":{"present_simple":["departisanize","departisanizes"],"past_simple":"departisanized","past_participle":"departisanized","present_participle":"departisanizing"}},"usage_notes":{"explanation":"'Departisanize' is a verb that means to remove or reduce the influence of political parties or partisan viewpoints from something. It is often used in the context of government processes, policies, or institutions that are intended to be neutral and unbiased. The aim of departisanizing is to ensure fairness, objectivity, and equal treatment for all, regardless of political affiliation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The departisanized policy was very partisan.","correct":"✓ The departisanized policy aimed to be non-partisan.","note":"If a policy is departisanized, it should not be partisan. The goal is to remove partisan influence. "},{"incorrect":"✗ They are trying to partisanize the issue.","correct":"✓ They are trying to departisanize the issue.","note":"Make sure to use the correct prefix. 'Departisanize' means to remove partisan influence, while 'partisanize' means to make something partisan."}],"priority":"★★☆"},"related_words":{"derivatives":["departisanization (noun): The act or process of removing partisan influence.","nonpartisan (adjective): Not affiliated with or biased toward any particular political party."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Departisanize' is a relatively uncommon word that means to remove partisan influence from something, making it neutral or non-partisan. This word is often used in political or governmental contexts when discussing efforts to ensure fairness and objectivity. Understanding the prefix 'de-' (meaning 'remove' or 'reverse') and the word 'partisan' (meaning biased towards a political party) can help in understanding the meaning of 'departisanize.'"},"example_sentences":[{"sentence":"The commission was tasked with departisanizing the voting system.","translation":"委員会は、投票システムを超党派化する任務を負わされた。","type":"verb","meaning_category":"超党派化する"},{"sentence":"Departisanizing the judiciary is essential for maintaining public trust.","translation":"司法府を超党派化することは、国民の信頼を維持するために不可欠です。","type":"verb","meaning_category":"超党派化する"},{"sentence":"The newspaper called for efforts to departisanize the debate on climate change.","translation":"その新聞は、気候変動に関する議論を超党派化する努力を呼びかけた。","type":"verb","meaning_category":"超党派化する"}]}