{"word":"Penjauhan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act or process of distancing or separating something.","english_definition":"The act or process of making something more distant or separate.","examples":[{"sentence":"Penjauhan sosial adalah langkah penting untuk mencegah penyebaran penyakit.","translation":"Social distancing is an important step to prevent the spread of disease."},{"sentence":"Penjauhan diri dari masalah tidak akan menyelesaikannya.","translation":"Distancing yourself from problems will not solve them."}],"collocations":["Penjauhan sosial (social distancing)","Penjauhan diri (self-distancing)"],"synonyms":["Pemisahan","Pengasingan","Isolasi"],"antonyms":["Pendekatan","Penyatuan"]},{"part_of_speech":"noun","definition":"The state of being distant or remote.","english_definition":"The condition of being far away or remote.","examples":[{"sentence":"Penjauhan antara kedua negara itu semakin meningkat.","translation":"The distance between the two countries is increasing."},{"sentence":"Penjauhan emosional dapat merusak hubungan.","translation":"Emotional distance can damage relationships."}],"collocations":["Penjauhan emosional (emotional distance)","Penjauhan geografis (geographical distance)"],"synonyms":["Jarak","Keterpencilan","Kejauhan"],"antonyms":["Kedekatan","Keintiman"]}],"etymology":{"value":"Derived from the Indonesian word 'jauh' meaning 'far' or 'distant', with the prefix 'peN-' and suffix '-an' to form a noun indicating the process or state of distancing.","priority":"★★★"},"pronunciation":{"ipa":"/pənˈd͡ʒau̯han/","syllables":"pen-jau-han"},"inflection":{"noun_plural":"Penjauhan-penjauhan"},"usage_notes":{"explanation":"'Penjauhan' is used to describe both the action of distancing something and the resulting state of being distant. It can refer to physical distance, social distance, or emotional distance. The context usually clarifies which type of distancing is being discussed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya merasa penjauhan dari teman-teman saya.","correct":"Saya merasa jauh dari teman-teman saya.","note":"While 'penjauhan' can refer to emotional distance, in everyday conversation, 'jauh' (far) is more commonly used to express feeling distant from someone."}],"priority":"★★☆"},"related_words":{"derivatives":["Menjauh (to move away, to distance oneself)","Menjauhi (to avoid, to stay away from)","Jauh (far, distant)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but used in formal contexts and discussions about social issues.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Penjauhan' is a formal Indonesian word that describes the act or state of distancing. It is often used in discussions about social issues, relationships, or geographical distances. While the root word 'jauh' (far) is common, 'penjauhan' is less frequent in everyday conversation. Understanding the context is important to grasp the specific type of distancing being referred to."},"example_sentences":[{"sentence":"Pemerintah menerapkan kebijakan penjauhan fisik di tempat umum.","translation":"The government implemented a policy of physical distancing in public places.","type":"noun","meaning_category":"Act of distancing"},{"sentence":"Penjauhan emosional antara orang tua dan anak dapat menyebabkan masalah perilaku.","translation":"Emotional distance between parents and children can cause behavioral problems.","type":"noun","meaning_category":"State of being distant"}]}