{"word":"depictions","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"描写、表現、叙述、図示","english_definition":"representations or descriptions of someone or something.","examples":[{"sentence":"The depictions of war in the film were very realistic.","translation":"映画における戦争の描写は非常に現実的だった。"},{"sentence":"Her depictions of rural life are full of charm.","translation":"彼女の田舎暮らしの描写は魅力に満ちている。"},{"sentence":"The artist's depictions of the human form are highly stylized.","translation":"その芸術家による人体描写は非常に様式化されている。"}],"collocations":["realistic depictions","accurate depictions","vivid depictions","detailed depictions","artistic depictions","historical depictions","visual depictions","literary depictions"],"synonyms":["portrayals","representations","illustrations","descriptions","renderings","sketches","images","accounts"],"antonyms":["distortions","misrepresentations","caricatures"]}],"etymology":{"value":"The word 'depiction' comes from the Latin word 'depictio', which is derived from 'depingere' meaning 'to paint, portray, depict'. 'De-' means 'down' and 'pingere' means 'to paint'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈpɪkʃənz/","syllables":"de-pic-tions"},"inflection":{"noun_plural":"depictions"},"usage_notes":{"explanation":"'Depictions' refers to the plural form of 'depiction', which is a noun. It describes the act of representing something in a visual or descriptive form. It can refer to visual representations such as paintings, drawings, or photographs, as well as written or spoken descriptions. The term often implies a level of detail or artistry in the representation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The depiction were beautiful.","correct":"✓ The depictions were beautiful.","note":"'Depiction' is singular, so the verb should be 'was'. 'Depictions' is plural, so the verb should be 'were'."},{"incorrect":"✗ He made a depiction of the event. (when multiple depictions exist)","correct":"✓ He made several depictions of the event. / ✓ He created various depictions of the event.","note":"If there are multiple representations, use the plural form 'depictions' or specify a number."}],"priority":"★★☆"},"related_words":{"derivatives":["depict (verb): to represent or portray in a painting, drawing, sculpture, or verbal description.","depictive (adjective): serving to depict or describe.","depicted (adjective): represented in a picture or other artistic medium."],"related_concepts":["representation","portrayal","illustration","description","imagery","visualization","interpretation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and artistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'depictions' is a plural noun referring to representations or descriptions of something, often in a visual or artistic form. It is more commonly used in formal writing, academic contexts, or when discussing art, literature, or historical accounts. Understanding the word requires a good vocabulary and familiarity with abstract concepts of representation. It is less common in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum featured various depictions of ancient Roman life.","translation":"その博物館では、古代ローマの生活に関する様々な描写が展示されていた。","type":"noun","meaning_category":"representations"},{"sentence":"These depictions of poverty highlight the social inequalities of the time.","translation":"これらの貧困の描写は、当時の社会的不平等を浮き彫りにしている。","type":"noun","meaning_category":"descriptions"},{"sentence":"The artist is known for his realistic depictions of nature.","translation":"その芸術家は、自然の写実的な描写で知られている。","type":"noun","meaning_category":"portrayals"},{"sentence":"Historical depictions of the event often differ from eyewitness accounts.","translation":"その出来事の歴史的な描写は、しばしば目撃者の証言とは異なる。","type":"noun","meaning_category":"accounts"},{"sentence":"The book includes several vivid depictions of the battlefield.","translation":"その本には、戦場のいくつかの鮮やかな描写が含まれている。","type":"noun","meaning_category":"illustrations"}]}