{"word":"agogic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(音楽)アゴーギクの、演奏速度やリズムに微妙な変化を加えることに関する","english_definition":"Relating to agogics; pertaining to subtle variations in tempo and rhythm in musical performance.","examples":[{"sentence":"The pianist employed agogic accents to enhance the expressiveness of the piece.","translation":"ピアニストは、楽曲の表現力を高めるためにアゴーギク的なアクセントを用いた。"},{"sentence":"Agogic emphasis can create a sense of rubato without altering the notated tempo.","translation":"アゴーギク的な強調は、楽譜に記されたテンポを変えずに、ルバートのような感覚を生み出すことができる。"}],"collocations":["agogic accent","agogic stress","agogic emphasis","agogic variation"],"synonyms":["rhythmic","tempo-related","expressive","nuanced"],"antonyms":["metronomic","rigid","unyielding"]}],"etymology":{"value":"Derived from the Greek word 'agogos' meaning 'leading, drawing, attracting'. The term was introduced into music theory to describe the subtle 'leading' or 'drawing' of the tempo to enhance musical expression.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈɡɒdʒɪk/","syllables":"a-go-gic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Agogic' refers specifically to the subtle manipulations of tempo and rhythm in music performance. It is often contrasted with dynamic variations (changes in volume) and articulatory variations (changes in how notes are played). Agogic accents, for example, involve slightly lengthening a note to give it emphasis. The term is primarily used in music theory and analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The agogic movement of the dance was captivating.","correct":"✓ The rhythmic movement of the dance was captivating.","note":"'Agogic' is specific to music; for dance, use 'rhythmic' or other related terms."},{"incorrect":"✗ He played the piece with agogic precision.","correct":"✓ He played the piece with rhythmic precision.","note":"While agogic variations are intentional, 'precision' is usually associated with strict adherence to tempo, not deviations from it."}],"priority":"★★☆"},"related_words":{"derivatives":["agogics (noun: the study or practice of agogic variations in music)"],"related_terms":["rubato (a related technique involving flexible tempo)","tempo (the speed of the music)","rhythm (the pattern of sounds and silences in music)","dynamics (the loudness or softness of the music)","articulation (the manner in which notes are played)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized musical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Agogic' is a highly specialized term used in music theory and analysis to describe subtle variations in tempo and rhythm that contribute to musical expression. It is not commonly used outside of academic or professional musical contexts. Understanding the term requires a solid foundation in music theory and terminology."},"example_sentences":[{"sentence":"The conductor emphasized the importance of agogic accents in bringing out the drama of the symphony.","translation":"指揮者は、交響曲のドラマを引き出すために、アゴーギク的なアクセントの重要性を強調した。","type":"adjective","meaning_category":"musical performance"},{"sentence":"Agogic variations can be notated in a score using symbols such as fermatas or tenuto marks.","translation":"アゴーギク的な変化は、フェルマータやテヌート記号などの記号を用いて楽譜に記述することができる。","type":"adjective","meaning_category":"music theory"},{"sentence":"The performer's sensitive use of agogic phrasing made the melody sing.","translation":"演奏者の繊細なアゴーギク的フレージングが、メロディーを歌わせた。","type":"adjective","meaning_category":"musical interpretation"}]}