{"word":"autogyros","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オートジャイロ（複数形）","english_definition":"Plural form of autogyro: a type of rotorcraft that uses an unpowered rotor in autorotation to develop lift, and an engine-powered propeller to provide thrust.","examples":[{"sentence":"A few autogyros were visible at the airshow.","translation":"航空ショーでは数機のオートジャイロを見ることができた。"},{"sentence":"Autogyros are sometimes used for aerial surveillance.","translation":"オートジャイロは時々、空中監視に使用される。"}],"collocations":["fly autogyros","pilot autogyros","autogyro flight","autogyro design"],"synonyms":["gyroplane","gyrocopter"],"antonyms":[]}],"etymology":{"value":"The term \"autogyro\" is a trademarked name, derived from \"auto-\" (self) and \"gyro\" (rotating device). It was coined by the Spanish engineer Juan de la Cierva, who invented the first successful autogyro in the 1920s.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtoʊˈdʒaɪroʊz/","syllables":"au-to-gy-ros"},"inflection":{"noun_plural":"autogyros"},"usage_notes":{"explanation":"\"Autogyros\" is simply the plural form of \"autogyro.\" An autogyro is a type of aircraft that looks similar to a helicopter but operates differently. The rotor on top spins freely due to the airflow, providing lift, while a separate engine-powered propeller provides forward thrust. They are less common than helicopters and airplanes but are sometimes used for recreational flying, surveillance, and agricultural applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He saw one autogyroes at the airport.","correct":"✓ He saw one autogyro at the airport.","note":"\"Autogyroes\" is not a correct singular form. The singular form is \"autogyro.\""},{"incorrect":"✗ Autogyros are helicopter.","correct":"✓ Autogyros are a type of rotorcraft.","note":"Autogyros are similar to helicopters but are not helicopters. They are a type of rotorcraft, which is a broader category."}],"priority":"★★☆"},"related_words":{"derivatives":["autogyro (singular form)","rotorcraft","gyroplane","gyrocopter"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Autogyros\" refers to multiple aircraft of a specific type. An autogyro is a rotorcraft that uses an unpowered rotor for lift and a separate propeller for thrust. This term is technical and not commonly used in everyday conversation. Understanding this word indicates familiarity with aviation terminology."},"example_sentences":[{"sentence":"The museum had a display of vintage airplanes and autogyros.","translation":"博物館には、ヴィンテージの飛行機とオートジャイロの展示があった。","type":"noun","meaning_category":"aircraft"},{"sentence":"Modern autogyros are often equipped with advanced navigation systems.","translation":"現代のオートジャイロには、高度なナビゲーションシステムが搭載されていることが多い。","type":"noun","meaning_category":"aircraft"},{"sentence":"Autogyros offer a unique flying experience due to their autorotating rotor.","translation":"オートジャイロは、自動回転するローターのおかげで、ユニークな飛行体験を提供する。","type":"noun","meaning_category":"aircraft"},{"sentence":"The air force experimented with autogyros for reconnaissance purposes.","translation":"空軍は偵察目的でオートジャイロの実験を行った。","type":"noun","meaning_category":"aircraft"}]}