{"word":"telegnosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The supposed ability to acquire knowledge of facts and thoughts directly from another person's mind, without the use of ordinary sensory channels.","english_definition":"The supposed ability to know things about other people's minds or thoughts without using normal senses.","examples":[{"sentence":"Some people believe in telegnosis as a form of extrasensory perception.","translation":"超感覚的知覚の一形態としてテレグノーシスを信じる人もいます。"},{"sentence":"The experiment aimed to test the subject's telegnosis abilities.","translation":"その実験は、被験者のテレグノーシスの能力をテストすることを目的としていました。"}],"collocations":["extrasensory perception","psychic ability","mind reading","telepathy"],"synonyms":["clairvoyance","mind reading","telepathy"],"antonyms":[]}],"etymology":{"value":"From Greek τῆλε (têle, \"far off, at a distance\") + γνῶσις (gnôsis, \"knowledge\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛlɪɡˈnoʊsɪs/","syllables":"te-leg-no-sis"},"inflection":{"noun_plural":"telegnoses"},"usage_notes":{"explanation":"Telegnosis is a term used in parapsychology to describe the supposed ability to gain knowledge of another person's thoughts or experiences without using any of the five senses. It is often associated with other psychic abilities such as telepathy and clairvoyance. The term is not widely recognized in mainstream science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used telegnosis to read the book.","correct":"✓ She used telegnosis to know the contents of the book without reading it.","note":"Telegnosis is not a tool to read physical books, but rather a supposed ability to gain knowledge directly from another person's mind or from a remote source without using senses."}],"priority":"★☆☆"},"related_words":{"derivatives":["telegnostic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Telegnosis' is a specialized term from the field of parapsychology, referring to the purported ability to gain knowledge of another person's thoughts or experiences without using normal sensory channels. It is a relatively rare term and is not part of standard English vocabulary. Understanding its meaning requires familiarity with concepts related to extrasensory perception and psychic abilities."},"example_sentences":[{"sentence":"The parapsychologist studied claims of telegnosis in individuals reporting psychic experiences.","translation":"その超心理学者は、超能力体験を報告する個人のテレグノーシスの主張を研究しました。","type":"noun","meaning_category":"extrasensory perception"},{"sentence":"Skeptics argue that there is no scientific evidence to support the existence of telegnosis.","translation":"懐疑論者は、テレグノーシスの存在を裏付ける科学的証拠はないと主張しています。","type":"noun","meaning_category":"extrasensory perception"}]}