{"word":"unretiring","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"引退しない、退職しない","english_definition":"Not retiring; continuing to work or be active, especially after the usual age for retirement.","examples":[{"sentence":"He is an unretiring professor who continues to teach and research.","translation":"彼は引退しない教授で、教えたり研究したりし続けている。"},{"sentence":"The unretiring CEO led the company for over 50 years.","translation":"その引退しないCEOは50年以上会社を率いた。"}],"collocations":["unretiring nature","unretiring dedication","unretiring commitment"],"synonyms":["active","industrious","persistent","dedicated","committed"],"antonyms":["retired","inactive","idle","leisurely"]},{"part_of_speech":"adjective","definition":"控えめではない、目立つ、大胆な","english_definition":"Not retiring; not shy or modest; bold and conspicuous.","examples":[{"sentence":"She wore an unretiring dress that turned heads.","translation":"彼女は人目を引く大胆なドレスを着ていた。"},{"sentence":"His unretiring personality made him a natural leader.","translation":"彼の控えめではない性格は、彼を生まれながらのリーダーにした。"}],"collocations":["unretiring style","unretiring boldness","unretiring confidence"],"synonyms":["bold","conspicuous","prominent","assertive","confident"],"antonyms":["retiring","shy","modest","reserved"]}],"etymology":{"value":"Derived from the prefix 'un-' (not) and the adjective 'retiring'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.rɪˈtaɪə.rɪŋ/","syllables":"un-re-tir-ing"},"inflection":{"adjective_forms":{"comparative":"more unretiring","superlative":"most unretiring"}},"usage_notes":{"explanation":"The word \"unretiring\" has two main meanings. The first, and perhaps more common, meaning is related to someone who does not retire from their work or activities, especially beyond the typical age of retirement. The second meaning describes someone or something that is not shy or modest, but rather bold and conspicuous. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very unretiring person, he likes to stay at home.","correct":"✓ He is a very active person, he doesn't like to stay at home.","note":"If the intended meaning is someone who is active and doesn't like to stay at home, 'active' is a better word choice than 'unretiring', as 'unretiring' usually implies someone who continues to work or be active in their profession or field."}],"priority":"★★☆"},"related_words":{"derivatives":["unretiringly (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unretiring\" is relatively uncommon and has two distinct meanings. One meaning refers to someone who continues to work or be active, especially after the usual age for retirement. The other meaning describes someone or something that is bold and conspicuous, rather than shy or modest. Understanding the context is crucial to interpreting the intended meaning. Due to its relative rarity and nuanced meanings, this word is more likely to be encountered in advanced texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The unretiring professor published several new papers after his official retirement date.","translation":"その引退しない教授は、正式な退職日の後もいくつかの新しい論文を発表した。","type":"adjective","meaning_category":"引退しない"},{"sentence":"Her unretiring confidence made her a successful entrepreneur.","translation":"彼女の控えめではない自信が、彼女を成功した起業家にした。","type":"adjective","meaning_category":"控えめではない"}]}