{"word":"dynamiter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ダイナマイトを使用する人、ダイナマイトで爆破する人、爆弾魔","english_definition":"A person who uses dynamite, especially for criminal or terrorist purposes.","examples":[{"sentence":"The police suspected a dynamiter was responsible for the explosion.","translation":"警察は爆発の原因は爆弾魔だと疑った。"},{"sentence":"Dynamiters targeted government buildings during the unrest.","translation":"騒乱の間、爆弾魔たちは政府の建物を標的にした。"}],"collocations":["suspected dynamiter","alleged dynamiter","group of dynamiters"],"synonyms":["bomber","explosives expert","saboteur"],"antonyms":[]}],"etymology":{"value":"From 'dynamite' + '-er' (suffix indicating a person associated with something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdaɪnəˌmaɪtər/","syllables":"dy-na-mi-ter"},"inflection":{"noun_plural":"dynamiters"},"usage_notes":{"explanation":"'Dynamiter' refers specifically to someone who uses dynamite, often with malicious intent. It is less commonly used than 'bomber' in modern contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dynamiter and works in construction.","correct":"✓ He is a demolition expert and uses dynamite in construction.","note":"While 'dynamiter' technically means someone who uses dynamite, it often carries a negative connotation. For someone who uses dynamite professionally and legally, 'demolition expert' or similar terms are more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["dynamite","dynamitic"],"related_terms":["bomber","explosives","terrorism"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dynamiter' is a specialized term referring to someone who uses dynamite, typically in a criminal or destructive context. Due to its specific and often negative association, it is not a commonly used word, and understanding its meaning requires a relatively advanced vocabulary."},"example_sentences":[{"sentence":"The authorities were on high alert, fearing the dynamiter would strike again.","translation":"当局は、爆弾魔が再び襲撃することを恐れて警戒態勢を強めた。","type":"noun","meaning_category":"爆弾魔"},{"sentence":"Historical accounts describe dynamiters as key figures in certain labor movements.","translation":"歴史的記録は、爆弾魔を特定の労働運動における重要な人物として記述している。","type":"noun","meaning_category":"ダイナマイト使用者"}]}