{"word":"duplexed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"二重の、二重構造の、二重化された","english_definition":"Having two parts or aspects; double; made of two layers or components.","examples":[{"sentence":"The duplexed apartment offered ample space for the family.","translation":"その二重構造のアパートは家族にとって十分な広さだった。"},{"sentence":"The duplexed cable provided enhanced signal transmission.","translation":"その二重化されたケーブルは、信号伝送を強化した。"}],"collocations":["duplexed apartment","duplexed cable","duplexed system"],"synonyms":["double","dual","twofold","paired"],"antonyms":["single","simplex"]},{"part_of_speech":"verb (past participle)","definition":"(情報処理)二重化された、多重化された","english_definition":"(In information processing) Having been processed or transmitted using duplexing (a method of transmitting data in both directions simultaneously).","examples":[{"sentence":"The data was duplexed to ensure redundancy and prevent data loss.","translation":"データは冗長性を確保し、データ損失を防ぐために二重化された。"}],"collocations":["data was duplexed","system is duplexed"],"synonyms":["multiplexed"],"antonyms":["simplexed"]}],"etymology":{"value":"Derived from the verb 'duplex', which comes from the Latin 'duplex' meaning 'double' or 'twofold'. The '-ed' suffix indicates the past participle or adjective form.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈduːplɛkst/","syllables":"du-plexed"},"inflection":{"verb_forms":{"present_simple":["duplex"],"past_simple":"duplexed","past_participle":"duplexed","present_participle":"duplexing"}},"usage_notes":{"explanation":"'Duplexed' can function as an adjective describing something that is double or has two parts. In the context of information processing, it's often used as the past participle of the verb 'duplex' to describe data or systems that have been processed using duplexing techniques, meaning data can be transmitted in both directions simultaneously.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The duplexed house was very simplex.","correct":"✓ The duplexed house was very spacious.","note":"'Duplexed' implies a double structure, so it's contradictory to describe it as 'simplex' (single)."},{"incorrect":"✗ He duplexed the information. Now it is simplexed.","correct":"✓ He duplexed the information. Now it is redundant.","note":"Duplexing makes something double or redundant, not simplexed."}],"priority":"★★☆"},"related_words":{"derivatives":["duplex (noun, verb, adjective)","duplexing (noun, verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Duplexed' is a technical term that generally refers to something that is double or has two parts. It's often used in contexts such as housing (a duplexed apartment) or telecommunications (duplexed cable). In computing, it describes a system or data transmission method that allows simultaneous two-way communication. It's not a commonly used word in everyday conversation, so understanding its meaning is more relevant in specific technical or professional contexts."},"example_sentences":[{"sentence":"The duplexed printer could print on both sides of the paper automatically.","translation":"その二重化されたプリンターは、用紙の両面に自動的に印刷できた。","type":"adjective","meaning_category":"二重構造の"},{"sentence":"The communication system was designed to be fully duplexed.","translation":"その通信システムは、完全に二重化されるように設計された。","type":"adjective","meaning_category":"二重化された"},{"sentence":"The data stream was duplexed for efficient transmission.","translation":"データストリームは効率的な伝送のために二重化された。","type":"verb (past participle)","meaning_category":"二重化された"}]}