{"word":"volitionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"意志主義：心理学、哲学、神学において、意志または選択の力が人間の思考、行動、または宇宙の根本的な原理において中心的な役割を果たすという信念。","english_definition":"The doctrine that will or choice is a fundamental factor in the individual, in society, or in the universe. In psychology, philosophy, and theology, it is the belief that the power of will or choice plays a central role in human thought, action, or the fundamental principles of the universe.","examples":[{"sentence":"Volitionism in psychology emphasizes the role of conscious will in initiating and controlling behavior.","translation":"心理学における意志主義は、行動を開始し制御する上での意識的な意志の役割を強調する。"},{"sentence":"Some theological systems incorporate volitionism by suggesting that God's will is the ultimate cause of all events.","translation":"一部の神学体系は、神の意志がすべての出来事の究極の原因であると示唆することにより、意志主義を取り入れている。"}],"collocations":["psychological volitionism","theological volitionism","ethical volitionism"],"synonyms":["voluntarism","intentionalism","will theory"],"antonyms":["determinism","fatalism","mechanism"]}],"etymology":{"value":"\"Volition\" (意志) + \"-ism\" (主義) から構成される。 \"Volition\" はラテン語の \"volitio\" (意志、願望) に由来し、\"volo\" (私は望む) から派生。","priority":"★★★"},"pronunciation":{"ipa":"/voʊˈlɪʃənɪzəm/","syllables":"vo-li-tion-ism"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"Volitionism は、人間の行動や宇宙の出来事を理解する上で、意志の力を重視する様々な学問分野で使用される用語です。心理学では、意識的な意志が行動の開始と制御にどのように影響するかを研究する理論を指します。哲学では、意志の自由や道徳的責任に関する議論に関連します。神学では、神の意志が宇宙の創造と維持において果たす役割について考察する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Volitionism is the belief that everything is predetermined.","correct":"✓ Volitionism is the belief that will is a key factor, the opposite of determinism.","note":"Volitionism は、すべてが決定されているという信念（決定論）とは対照的に、意志の重要性を強調する。"},{"incorrect":"✗ Volitionism is only a psychological theory.","correct":"✓ Volitionism is a concept that appears in psychology, philosophy, and theology.","note":"Volitionism は心理学だけでなく、哲学や神学にも関連する概念である。"}],"priority":"★★☆"},"related_words":{"derivatives":["volitional (形容詞: 意志的な)","volition (名詞: 意志)","voluntarist (名詞: 意志主義者)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 学術的な文脈で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Volitionism\" is a complex term primarily used in academic discussions within psychology, philosophy, and theology. It refers to the belief that will or choice is a fundamental factor in understanding human behavior and the universe. This concept is often contrasted with determinism, which suggests that all events are predetermined. Due to its abstract nature and limited usage, it is considered an advanced vocabulary word.","priority":"★★☆"},"example_sentences":[{"sentence":"The debate between volitionism and determinism has been a central theme in philosophy for centuries.","translation":"意志主義と決定論の間の議論は、何世紀にもわたって哲学の中心的なテーマとなっている。","type":"general","meaning_category":"philosophical context"},{"sentence":"Early psychologists like Wilhelm Wundt explored volitionism in their studies of consciousness.","translation":"ヴィルヘルム・ヴントのような初期の心理学者は、意識の研究において意志主義を探求した。","type":"general","meaning_category":"psychological context"},{"sentence":"Critics of volitionism argue that it overestimates the degree to which humans have free will.","translation":"意志主義の批判者たちは、人間が持つ自由意志の程度を過大評価していると主張する。","type":"general","meaning_category":"critical perspective"}]}