{"word":"Leptynite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A metamorphic rock with a fine-grained, granoblastic texture, composed mainly of quartz and feldspar, and formed under high-grade metamorphic conditions.","english_definition":"A fine-grained metamorphic rock composed primarily of quartz and feldspar, exhibiting a granoblastic texture and formed under high-grade metamorphic conditions.","examples":[{"sentence":"The geological survey identified the rock sample as leptynite.","translation":"地質調査により、その岩石サンプルはレプティナイトであると特定されました。"},{"sentence":"Leptynite is often found in areas with intense regional metamorphism.","translation":"レプティナイトは、強い広域変成作用を受けた地域でよく見られます。"}],"collocations":["geological survey","metamorphic rock","granoblastic texture","quartz and feldspar"],"synonyms":["granulite","gneiss","metamorphic rock"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'leptos' (λεπτός) meaning 'fine' or 'thin' and 'lithos' (λίθος) meaning 'stone'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛptɪnaɪt/","syllables":"Lep-ty-nite"},"inflection":{"noun_plural":"Leptynites"},"usage_notes":{"explanation":"Leptynite is a relatively rare type of metamorphic rock. It is characterized by its fine-grained texture and its mineral composition, which is primarily quartz and feldspar. It is often associated with high-grade metamorphic terrains.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was leptynite because it was shiny.","correct":"✓ The rock was leptynite because of its mineral composition and texture.","note":"Leptynite is identified by its mineral composition (quartz and feldspar) and granoblastic texture, not just its appearance."}],"priority":"★☆☆"},"related_words":{"derivatives":["Leptite (related but distinct rock type)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Leptynite is a specialized geological term referring to a specific type of metamorphic rock. Understanding requires familiarity with metamorphic processes, mineral composition, and rock textures. It is primarily used within the field of geology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The thin section analysis confirmed the presence of granoblastic texture in the leptynite sample.","translation":"薄片分析により、レプティナイトのサンプルにグラノブラスト組織が存在することが確認された。","type":"noun","meaning_category":"geology"},{"sentence":"Leptynite formations can provide insights into the metamorphic history of a region.","translation":"レプティナイトの地層は、ある地域の変成の歴史に関する洞察を提供することができる。","type":"noun","meaning_category":"geology"}]}