{"word":"undermeal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A light repast or snack taken between meals.","english_definition":"A light repast or snack taken between meals.","examples":[{"sentence":"She enjoyed a small undermeal of fruit and cheese before dinner.","translation":"彼女は夕食前に、果物とチーズの軽いおやつを楽しんだ。"}],"synonyms":["snack","light meal","repast","bite","refreshment"],"antonyms":[]}],"etymology":{"value":"The word 'undermeal' is formed by combining 'under-' (meaning 'between' or 'during') and 'meal'. It literally refers to a meal taken between the regular meals.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʌndərˌmiːl/","syllables":"un-der-meal"},"inflection":{"noun_plural":"undermeals"},"usage_notes":{"explanation":"The term 'undermeal' is somewhat archaic and not commonly used in modern English. It refers specifically to a small meal or snack consumed between the main meals of the day. It is more formal than 'snack'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a large undermeal before lunch.","correct":"✓ I had a small undermeal before lunch.","note":"'Undermeal' implies a small snack, not a large meal."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. The word is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undermeal' is a relatively obscure word that refers to a snack or light meal eaten between main meals. It is not in common usage and is more likely to be encountered in older texts. Understanding this word requires a strong vocabulary and familiarity with less common English terms."},"example_sentences":[{"sentence":"In the old days, a small undermeal was common for laborers needing extra energy.","translation":"昔は、余分なエネルギーを必要とする労働者のために、軽いおやつが一般的だった。","type":"noun","meaning_category":"snack"},{"sentence":"The children were given an undermeal of bread and butter to tide them over until supper.","translation":"子供たちは夕食までのつなぎとして、パンとバターのおやつを与えられた。","type":"noun","meaning_category":"snack"}]}