{"word":"sulcalization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脳溝形成、脳溝の発達","english_definition":"The process of forming sulci (grooves or furrows) in the cerebral cortex of the brain.","examples":[{"sentence":"Sulcalization is a crucial process in brain development.","translation":"脳溝形成は脳の発達において重要な過程です。"},{"sentence":"Abnormal sulcalization can be associated with neurodevelopmental disorders.","translation":"異常な脳溝形成は神経発達障害と関連している可能性があります。"}],"collocations":["cortical sulcalization","abnormal sulcalization","delayed sulcalization"],"synonyms":["gyrification (related, but refers to the formation of gyri, the ridges)"],"antonyms":[]}],"etymology":{"value":"Derived from 'sulcus' (Latin for furrow or groove) + '-al' (relating to) + '-ization' (the process of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌlkələˈzeɪʃən/","syllables":"sul-ca-li-za-tion"},"inflection":{"noun_plural":"sulcalizations"},"usage_notes":{"explanation":"'Sulcalization' specifically refers to the formation and development of the sulci, which are the infoldings or grooves on the surface of the brain. It is a key process in increasing the surface area of the cerebral cortex without increasing the overall volume of the brain. This process is particularly important during fetal development and early infancy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brain's gyri are formed by sulcalization.","correct":"✓ The brain's sulci are formed by sulcalization.","note":"Sulcalization forms sulci (grooves), not gyri (ridges)."},{"incorrect":"✗ Sulcalization is the same as myelination.","correct":"✓ Sulcalization is the process of forming brain grooves.","note":"Sulcalization and myelination are distinct processes in brain development. Myelination involves the formation of myelin sheaths around nerve fibers."}],"priority":"★★☆"},"related_words":{"derivatives":["sulcus (noun: a groove or furrow, especially in the brain)","sulcal (adjective: relating to a sulcus)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sulcalization' is a specialized term used in neuroscience and related fields to describe the process by which grooves (sulci) form on the surface of the brain. This process is crucial for increasing the brain's surface area, which is important for cognitive function. The term is typically encountered in academic or research contexts related to brain development and neuroanatomy."},"example_sentences":[{"sentence":"The study investigated the relationship between genetic factors and the degree of cortical sulcalization.","translation":"その研究では、遺伝的要因と皮質の脳溝形成の程度との関係が調査された。","type":"scientific","meaning_category":"brain development"},{"sentence":"Reduced sulcalization has been observed in some individuals with autism spectrum disorder.","translation":"自閉症スペクトラム障害を持つ一部の人々において、脳溝形成の減少が観察されている。","type":"medical","meaning_category":"neurology"}]}