{"word":"confocal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"共焦点の","english_definition":"(of a microscope) using a pinhole to eliminate out-of-focus light, resulting in a sharper image of a single plane within a thick specimen.","examples":[{"sentence":"Confocal microscopy allows for high-resolution imaging of thick samples.","translation":"共焦点顕微鏡法は、厚い試料の高解像度イメージングを可能にする。"},{"sentence":"The confocal microscope is a powerful tool for biological research.","translation":"共焦点顕微鏡は、生物学研究のための強力なツールである。"}],"collocations":["confocal microscope","confocal microscopy","confocal imaging","confocal laser scanning microscopy (CLSM)"],"synonyms":["laser scanning confocal microscope (LSCM)"],"antonyms":[]}],"etymology":{"value":"The term \"confocal\" is derived from the combination of \"con-\" (meaning together or with) and \"focal\" (referring to the focal point). It describes the optical arrangement where the illuminating and detecting apertures are confocal, or share the same focal point.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒnˈfoʊkəl/","syllables":"con-fo-cal"},"inflection":{"notes":"It is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Confocal\" is primarily used in the context of microscopy. It refers to a specific type of microscope that uses a spatial pinhole to eliminate out-of-focus light, allowing for the acquisition of optical sections from thick specimens. This results in higher resolution and clearer images compared to traditional widefield microscopy. The term is often used in scientific and technical contexts, particularly in biology, medicine, and materials science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The image was confocal.","correct":"✓ The image was obtained using a confocal microscope.","note":"While technically correct, it's more common to say the *microscope* is confocal, or the *microscopy* technique is confocal. Saying the *image* is confocal is less precise."}],"priority":"★★☆"},"related_words":{"derivatives":["confocally (adverb)"],"phrasal_verbs":[],"related_terms":["microscopy","fluorescence microscopy","two-photon microscopy","optical sectioning","pinhole","objective lens"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"confocal\" is highly specialized and primarily used in scientific and technical fields, particularly in discussions of microscopy. It describes a specific technique used to obtain high-resolution images of thick samples by eliminating out-of-focus light. Understanding the term requires familiarity with basic microscopy principles. It is unlikely to be encountered in general conversation or non-technical texts."},"example_sentences":[{"sentence":"We used a **confocal** microscope to image the cells.","translation":"細胞をイメージングするために共焦点顕微鏡を使用した。","type":"adjective","meaning_category":"共焦点の"},{"sentence":"**Confocal** microscopy is essential for studying the structure of biofilms.","translation":"共焦点顕微鏡法は、バイオフィルムの構造を研究するために不可欠である。","type":"adjective","meaning_category":"共焦点の"},{"sentence":"The **confocal** images revealed the intricate details of the tissue.","translation":"共焦点画像は、組織の複雑な詳細を明らかにした。","type":"adjective","meaning_category":"共焦点の"}]}