{"word":"androgynized","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人や外見を)両性具有にする、中性的にする","english_definition":"To make someone or something androgynous; to cause to have characteristics of both sexes.","examples":[{"sentence":"The fashion industry has increasingly androgynized models to appeal to a wider audience.","translation":"ファッション業界は、より幅広い層にアピールするために、モデルをますます中性的にしている。"},{"sentence":"The artist androgynized the figure in the painting, blurring the lines between male and female.","translation":"そのアーティストは絵の中の人物を中性的にし、男性と女性の境界線を曖昧にした。"}],"collocations":["androgynize a model","androgynize a character","androgynize an appearance"],"synonyms":["neutralize","desex","effeminate","masculinize"],"antonyms":["gender","masculinize","feminize"]}],"etymology":{"value":"Formed from 'androgynous' (having both male and female characteristics) + '-ize' (a suffix indicating a process of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈdrɒdʒɪnaɪzd/","syllables":"an-drog-i-nized"},"inflection":{"verb_forms":{"present_simple":["androgynize","androgynizes"],"past_simple":"androgynized","past_participle":"androgynized","present_participle":"androgynizing"}},"usage_notes":{"explanation":"'Androgynized' refers to the act of making something or someone appear androgynous, meaning having both male and female characteristics. This can apply to appearance, style, or even character representation in art or media. It often involves blending or blurring traditional gender markers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The androgynized person was very masculine.","correct":"✓ The androgynized person had both masculine and feminine features.","note":"Androgyny implies a blend of both masculine and feminine traits, not just one. Therefore, saying someone is 'androgynized' and then describing them as solely masculine is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["androgyny (noun: the combination of masculine and feminine characteristics)","androgynous (adjective: having both male and female characteristics)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Androgynized' is a relatively advanced term that describes the process of making something or someone androgynous, meaning they exhibit both male and female characteristics. This term is often used in discussions about fashion, art, and gender representation. Understanding this word requires familiarity with the concept of androgyny itself.","priority":"★★☆"},"example_sentences":[{"sentence":"The singer's androgynized stage persona challenged traditional gender norms.","translation":"その歌手の中性的なステージ上のペルソナは、伝統的なジェンダー規範に挑戦した。","type":"verb","meaning_category":"中性的にする"},{"sentence":"The director androgynized the character to make them more relatable to a wider audience.","translation":"監督は、より幅広い観客に共感してもらうために、そのキャラクターを中性的にした。","type":"verb","meaning_category":"中性的にする"}]}