{"word":"berylline","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"緑柱石のような、緑柱石色の、淡い青緑色の","english_definition":"Of or resembling beryl, especially in color; pale bluish-green.","examples":[{"sentence":"The berylline waters of the lake shimmered in the sunlight.","translation":"湖の緑柱石色の水が太陽の光を受けてきらめいていた。"},{"sentence":"She wore a berylline dress that complemented her eyes.","translation":"彼女は自分の目を引き立てる淡い青緑色のドレスを着ていた。"}],"collocations":["berylline green","berylline eyes","berylline water"],"synonyms":["aquamarine","sea-green","glaucous","teal","cyan"],"antonyms":[]}],"etymology":{"value":"From French 'béryllin', from Latin 'beryllinus', from 'beryllus' (beryl), from Greek 'beryllos', of Oriental origin (possibly from Prakrit 'veruliya' or 'veluriya').","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɛrəlɪn/","syllables":"be-ryl-line"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more berylline' and 'most berylline'."},"usage_notes":{"explanation":"'Berylline' is primarily used to describe colors that resemble the mineral beryl, specifically a pale bluish-green. It can also be used more generally to describe things that are reminiscent of beryl in other ways, such as clarity or luster, but this is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal had a berylline strength.","correct":"✓ The metal had a high tensile strength.","note":"'Berylline' refers to color, not physical properties like strength."},{"incorrect":"✗ She painted the room beryl.","correct":"✓ She painted the room berylline.","note":"'Beryl' is the name of the mineral; 'berylline' is the adjective describing the color."}],"priority":"★★☆"},"related_words":{"derivatives":["beryl (noun: a mineral consisting of beryllium aluminum silicate in crystalline form, including emerald and aquamarine as gemstones)."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Berylline' is a relatively uncommon adjective used to describe something that is the color of beryl, which is a pale bluish-green mineral. It's more likely to be encountered in descriptive writing, particularly when discussing colors or gemstones. Because it's not a common word, it's more likely to be used by writers aiming for a specific, sophisticated tone."},"example_sentences":[{"sentence":"The hummingbird's feathers shimmered with a berylline iridescence.","translation":"ハチドリの羽は、緑柱石のような虹色にきらめいていた。","type":"adjective","meaning_category":"color"},{"sentence":"He gazed into her berylline eyes, lost in their depths.","translation":"彼は彼女の緑柱石色の瞳をじっと見つめ、その奥深さに心を奪われた。","type":"adjective","meaning_category":"color"},{"sentence":"The artist captured the berylline hue of the Caribbean Sea perfectly.","translation":"その画家は、カリブ海の緑柱石色の色合いを完璧に捉えた。","type":"adjective","meaning_category":"color"}]}