{"word":"Birlings","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A fictional type of footwear mentioned in the song 'Putting on the Style' by Lonnie Donegan. Their exact appearance and function are not described in the song, leaving it open to interpretation.","english_definition":"(plural only) A fictional type of footwear mentioned in the song 'Putting on the Style' by Lonnie Donegan. Their exact appearance and function are not described in the song, leaving it open to interpretation.","examples":[{"sentence":"'I'm gonna have a suit that really is the berries, With a great big stripe and padded shoulders, I'll look a treat walking down the street, Putting on the style, Putting on the style. I'll have a pair of boots and real Birlings, And a diamond ring, I'll be the king, Putting on the style, Putting on the style.'","translation":"「私は本当に最高のスーツを手に入れるつもりだ。大きなストライプとパッド入りの肩が付いたやつだ。通りを歩けば注目の的さ、お洒落をして、お洒落をして。ブーツと本物のバーリングスを手に入れて、ダイヤモンドの指輪も。俺は王様になるんだ、お洒落をして、お洒落をして。」"}],"collocations":["pair of birlings","real birlings"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Origin unknown, likely a made-up word for the song, possibly influenced by regional slang or dialect.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrlɪŋz/","syllables":"Bir-lings"},"inflection":{"noun_plural":"Birlings (always plural)"},"usage_notes":{"explanation":"'Birlings' is a nonce word (a word created for a single occasion) that gained some recognition due to the song. It doesn't have a standard definition and is primarily understood within the context of the song. The term evokes a sense of stylish and perhaps extravagant footwear.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (fictional word)","frequency_google_ngram":"Very low frequency (primarily associated with the song)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Birlings' is a highly specialized term, primarily understood within the context of Lonnie Donegan's song 'Putting on the Style.' Its meaning is not literal but suggestive, representing a type of stylish footwear. Understanding this term requires familiarity with the song's lyrics and its cultural context."},"example_sentences":[{"sentence":"He wanted a pair of real Birlings to complete his stylish outfit.","translation":"彼はお洒落な服装を完成させるために、本物のバーリングスを手に入れたかった。","type":"noun","meaning_category":"fictional footwear"}]}