{"word":"stopway","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"停止帯（滑走路に隣接する、航空機が緊急停止のために使用できる区域）","english_definition":"A defined rectangular area on the ground at the end of a runway in the direction of takeoff that is prepared as a suitable area in which an aircraft can be stopped in the case of an abandoned takeoff.","examples":[{"sentence":"The aircraft overran the runway and came to a stop in the stopway.","translation":"航空機は滑走路をオーバーランし、停止帯で停止した。"},{"sentence":"The stopway provides an additional margin of safety during takeoff.","translation":"停止帯は離陸時の安全性を高めるための追加的な余裕を提供する。"}],"collocations":["use the stopway","stopway length","stopway width","stopway surface"],"synonyms":["blast pad","overrun area"],"antonyms":[]}],"etymology":{"value":"'Stop' + 'way'. A 'way' for stopping.","priority":"★★★"},"pronunciation":{"ipa":"ˈstɒpˌweɪ","syllables":"stop-way"},"inflection":{"noun_plural":"stopways"},"usage_notes":{"explanation":"A stopway is specifically designed and prepared to handle the weight of an aircraft during an aborted takeoff. It is distinct from the runway and clearway, although it is located at the end of the runway.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The aircraft landed on the stopway.","correct":"✓ The aircraft came to a stop on the stopway after overrunning the runway.","note":"Stopways are not intended for landing. They are for stopping after an aborted takeoff or runway overrun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stopway' is a technical term used in aviation. It refers to a specific area designed for aircraft to stop safely during an aborted takeoff or runway overrun. Understanding this term requires familiarity with aviation terminology.","priority":"★★★"},"example_sentences":[{"sentence":"The pilot successfully used the stopway after experiencing engine failure during takeoff.","translation":"パイロットは離陸中にエンジン故障が発生した後、停止帯をうまく利用した。","type":"general","meaning_category":"Usage"},{"sentence":"The length of the stopway must meet regulatory requirements to ensure adequate safety margins.","translation":"停止帯の長さは、適切な安全マージンを確保するために規制要件を満たす必要がある。","type":"technical","meaning_category":"Regulations"}]}