{"word":"monogynic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"一妻性の、単雌性の","english_definition":"(of an insect colony) having only one queen; (of a mating system) characterized by one female mating with one male","examples":[{"sentence":"Monogynic ant colonies are less aggressive than polygynic ones.","translation":"一妻性の蟻のコロニーは、多妻性のものよりも攻撃性が低い。"},{"sentence":"The species exhibits a monogynic social structure.","translation":"その種は一妻性の社会構造を示す。"}],"collocations":["monogynic colony","monogynic species","monogynic social structure"],"synonyms":["single-queen","one-queen"],"antonyms":["polygynic"],"notes":"Primarily used in the context of social insects (especially ants) and sometimes in describing mating systems."}],"etymology":{"value":"From 'mono-' (single) + 'gyn-' (female) + '-ic' (suffix indicating characteristic of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnəˈdʒaɪnɪk/","syllables":"mo-no-gyn-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more monogynic' and 'most monogynic', respectively."},"usage_notes":{"explanation":"'Monogynic' specifically describes a social structure or mating system where there is only one functional queen or female reproductive partner. It is most often used in the context of describing ant colonies but can extend to other social insects or mating behaviors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monogynic family lived happily ever after.","correct":"✓ The monogamous couple lived happily ever after.","note":"'Monogynic' refers to insect colonies with a single queen, not human families. Use 'monogamous' for human relationships."}],"priority":"★★☆"},"related_words":{"derivatives":["monogyny (noun: the state of having only one queen or female)"],"related_terms":["polygyny (having multiple queens or female partners)","monandry (having one male partner)","monogamy (having one partner of either sex)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monogynic' is a specialized term primarily used in entomology (the study of insects) and evolutionary biology. It describes a social structure or mating system where a colony or group has only one queen or reproductive female. Understanding this term requires familiarity with scientific vocabulary related to social behavior and insect biology."},"example_sentences":[{"sentence":"The researchers studied the genetic diversity within the monogynic ant population.","translation":"研究者たちは、一妻性の蟻の個体群内の遺伝的多様性を研究した。","type":"scientific","meaning_category":"one queen"},{"sentence":"This species of wasp is known for its monogynic colonies.","translation":"このハチの種は、一妻性のコロニーで知られている。","type":"scientific","meaning_category":"one queen"}]}