{"word":"neuroendocrinology","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"神経内分泌学","english_definition":"The branch of physiology and medicine concerned with the interaction between the nervous system and the endocrine system.","examples":[{"sentence":"Neuroendocrinology studies the effects of hormones on brain function.","translation":"神経内分泌学は、ホルモンが脳機能に与える影響を研究する。"},{"sentence":"Research in neuroendocrinology has advanced our understanding of stress responses.","translation":"神経内分泌学の研究は、ストレス反応の理解を深めた。"}],"collocations":["neuroendocrinology research","neuroendocrinology studies","fields of neuroendocrinology"],"synonyms":["endocrine neuroscience"],"antonyms":[]}],"etymology":{"value":"Derived from 'neuro-' (relating to nerves), 'endocrine' (relating to the endocrine system), and '-ology' (the study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊəroʊˌɛndoʊkrɪˈnɒlədʒi/","syllables":"neu-ro-en-do-cri-nol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neuroendocrinology is a specialized field that examines the complex interactions between the nervous system and the endocrine system. It focuses on how hormones influence the brain and nervous system, and conversely, how the nervous system regulates hormone secretion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neuroendocrinology is about the nervous system only.","correct":"✓ Neuroendocrinology is about the interaction between the nervous and endocrine systems.","note":"Neuroendocrinology involves both nervous and endocrine systems, not just the nervous system."}],"priority":"★★☆"},"related_words":{"derivatives":["neuroendocrine (adjective)"],"phrases":["neuroendocrine system","neuroendocrine tumor"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neuroendocrinology is a scientific term used in the fields of medicine and biology. It refers to the study of how the nervous system and the endocrine system communicate with each other. This field is important for understanding how hormones affect the brain and body, and how the brain controls hormone release.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor specializes in neuroendocrinology and its effects on behavior.","translation":"その教授は神経内分泌学とそれが行動に与える影響を専門としている。","type":"general","meaning_category":"study of nervous and endocrine systems"},{"sentence":"Dysregulation of the neuroendocrine system can lead to various health problems.","translation":"神経内分泌系の調節不全は、さまざまな健康問題を引き起こす可能性がある。","type":"general","meaning_category":"study of nervous and endocrine systems"}]}