{"word":"anti-philosophical","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"反哲学的な、哲学に反対する、哲学を否定する","english_definition":"opposed to or rejecting philosophy; characterized by a lack of philosophical thought or principles.","examples":[{"sentence":"His views were considered anti-philosophical because he rejected abstract reasoning.","translation":"彼の見解は抽象的な推論を拒否したため、反哲学的であると見なされた。"},{"sentence":"The movement was anti-philosophical, emphasizing practical action over theoretical contemplation.","translation":"その運動は反哲学的であり、理論的な考察よりも実践的な行動を重視していた。"}],"collocations":["anti-philosophical stance","anti-philosophical argument","anti-philosophical attitude","anti-philosophical approach"],"synonyms":["non-philosophical","unphilosophical","pragmatic","materialistic","anti-intellectual"],"antonyms":["philosophical","intellectual","theoretical"],"notes":["Often used to describe viewpoints that prioritize practical concerns or empirical evidence over abstract reasoning or philosophical inquiry."]}],"etymology":{"value":"Formed from the prefix 'anti-' (meaning 'against') and 'philosophical'.","priority":"medium"},"pronunciation":{"ipa":"/ˌæntiˌfɪləˈsɒfɪkəl/","syllables":"an-ti-phi-lo-soph-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more anti-philosophical' and 'most anti-philosophical'."},"usage_notes":{"explanation":"The term 'anti-philosophical' is used to describe ideas, arguments, or attitudes that are fundamentally opposed to philosophical inquiry or principles. It often implies a rejection of abstract thought, critical reasoning, or the pursuit of fundamental truths. It can also describe a focus on practical or material concerns to the exclusion of philosophical considerations. The term can be pejorative, suggesting a lack of intellectual depth, or descriptive, indicating a preference for concrete action over abstract thought.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He was anti-philosophical with his decision.","correct":"His decision was anti-philosophical.","note":"'Anti-philosophical' describes the nature of something (like a decision), not a person's state."}],"priority":"low"},"related_words":{"derivatives":["anti-philosophy (noun)"],"related_terms":["philosophy","philosophical","non-philosophy"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'anti-philosophical' is relatively uncommon and typically used in academic or intellectual contexts. Understanding requires familiarity with philosophical concepts and the ability to recognize arguments that reject or oppose philosophical principles."},"example_sentences":[{"sentence":"The politician's focus on immediate results was seen as an anti-philosophical approach to governance.","translation":"その政治家の目先の成果に焦点を当てる姿勢は、統治に対する反哲学的なアプローチと見なされた。","type":"adjective","meaning_category":"opposed to philosophy"},{"sentence":"Many critics accused the author of being anti-philosophical due to his simplistic and unreflective writing style.","translation":"多くの批評家は、その作家の単純で思慮深くない文体から、彼を反哲学的であると非難した。","type":"adjective","meaning_category":"lacking philosophical thought"}]}