{"word":"pre-eligibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"事前資格、事前適格性、予備的な資格審査","english_definition":"The state of meeting the preliminary requirements or qualifications before being fully eligible for something.","examples":[{"sentence":"The company conducts a pre-eligibility check to ensure applicants meet the basic criteria.","translation":"会社は、応募者が基本的な基準を満たしていることを確認するために、事前資格確認を実施する。"},{"sentence":"Applicants must demonstrate pre-eligibility before submitting a full application.","translation":"応募者は、正式な申請書を提出する前に、事前資格があることを証明しなければならない。"},{"sentence":"The pre-eligibility requirements include a minimum GPA and standardized test scores.","translation":"事前資格要件には、最低GPAと標準化されたテストのスコアが含まれる。"}],"collocations":["pre-eligibility check (事前資格確認)","pre-eligibility requirements (事前資格要件)","demonstrate pre-eligibility (事前資格を証明する)","assess pre-eligibility (事前資格を評価する)","confirm pre-eligibility (事前資格を確認する)"],"synonyms":["prequalification","preliminary qualification","initial eligibility","basic eligibility","early qualification"],"antonyms":["full eligibility","final eligibility","complete qualification"]},{"part_of_speech":"adjective","definition":"事前資格のある、事前適格性の","english_definition":"Relating to or indicating a state of meeting preliminary requirements or qualifications.","examples":[{"sentence":"The pre-eligibility form must be completed before proceeding to the next step.","translation":"次のステップに進む前に、事前資格フォームを完了する必要があります。"},{"sentence":"Only pre-eligibility candidates will be invited for an interview.","translation":"事前資格のある候補者のみが面接に招待されます。"},{"sentence":"The pre-eligibility status is determined by the initial screening process.","translation":"事前資格ステータスは、初期スクリーニングプロセスによって決定されます。"}],"collocations":["pre-eligibility form (事前資格フォーム)","pre-eligibility status (事前資格ステータス)","pre-eligibility criteria (事前資格基準)","pre-eligibility assessment (事前資格評価)"],"synonyms":["prequalified","preliminarily eligible","initially qualified","basically eligible"],"antonyms":["fully eligible","finally eligible","completely qualified"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning before) to the word 'eligibility' (the state of being qualified).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˌelɪdʒɪˈbɪləti/","syllables":"pree-el-i-ji-BIL-i-tee"},"inflection":{"noun_plural":"pre-eligibilities"},"usage_notes":{"explanation":"'Pre-eligibility' refers to the condition of meeting the initial or basic requirements for something, before being considered fully qualified. It is often used in contexts such as job applications, grant applications, or program enrollment, where there are multiple stages of qualification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pre-eligibility for the job.","correct":"✓ He has pre-eligibility to apply for the job. / ✓ He meets the pre-eligibility requirements for the job.","note":"'Pre-eligibility' is a state or condition, not a direct qualification. You have pre-eligibility *to do something* or *meet the pre-eligibility requirements*."},{"incorrect":"✗ The pre-eligibility is enough to get the job.","correct":"✓ The pre-eligibility is not enough to get the job; full eligibility is required.","note":"'Pre-eligibility' is only the first step; full eligibility is usually required for final acceptance."}],"priority":"★★☆"},"related_words":{"derivatives":["eligible (adjective: having the right to do or obtain something; satisfying the appropriate conditions.)","eligibility (noun: the state of being eligible.)","ineligible (adjective: not having the right to do or obtain something; not satisfying the appropriate conditions.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pre-eligibility' is a more advanced vocabulary word, typically used in formal contexts such as applications, legal documents, or official guidelines. It signifies the initial stage of meeting basic requirements before full consideration. Understanding this term is important for navigating complex application processes or understanding detailed qualification criteria."},"example_sentences":[{"sentence":"The scholarship program requires students to meet certain pre-eligibility criteria before applying.","translation":"奨学金プログラムでは、学生は申請する前に特定の事前資格基準を満たす必要があります。","type":"noun","meaning_category":"事前資格"},{"sentence":"The pre-eligibility assessment will determine if you meet the minimum requirements for the loan.","translation":"事前資格評価により、ローンに必要な最低要件を満たしているかどうかが判断されます。","type":"noun","meaning_category":"事前資格"},{"sentence":"Candidates who pass the pre-eligibility screening will be invited to the next stage of the application process.","translation":"事前資格審査に合格した候補者は、申請プロセスの次の段階に招待されます。","type":"noun","meaning_category":"事前資格"}]}