{"word":"semidomestically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半家畜状態で、半栽培状態で","english_definition":"In a manner that is partially domesticated; in a state between wild and fully domesticated.","examples":[{"sentence":"The reindeer are raised semidomestically in this region, roaming freely but returning for feeding.","translation":"この地域では、トナカイは半家畜状態で飼育されており、自由に歩き回るものの、給餌のために戻ってきます。"},{"sentence":"Some crops are grown semidomestically, relying on natural propagation with some human intervention.","translation":"いくつかの作物は半栽培状態で栽培されており、ある程度人間の介入はあるものの、自然繁殖に頼っています。"}],"collocations":["raised semidomestically","grown semidomestically"],"synonyms":["partially domesticated","partially cultivated"],"antonyms":["wildly","undomesticated"]}],"etymology":{"value":"The word is formed by combining \"semi-\" (meaning partially or half) with \"domestically\" (referring to the home or domestic environment).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiːdəˈmɛstɪkli/","syllables":"se-mi-do-mes-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Semidomestically\" describes a state or manner where something is not fully domesticated but exists in a state between wild and domestic. This is often used in the context of animals or plants that are managed by humans but still retain some wild characteristics or behaviors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The animals are semidomestic.","correct":"✓ The animals are raised semidomestically.","note":"\"Semidomestic\" is an adjective, while \"semidomestically\" is an adverb. Use the adverb to describe how something is raised or grown."}],"priority":"★★☆"},"related_words":{"derivatives":["semidomestic (adjective)","domestically (adverb)","domesticate (verb)","domestication (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semidomestically' is a relatively rare and technical term. It is used to describe the way in which animals or plants are raised or grown in a manner that is partially domesticated, meaning they are managed by humans but still retain some wild characteristics. Understanding this word requires a good grasp of the meanings of 'semi-' and 'domestically' and the ability to combine them to understand the overall meaning."},"example_sentences":[{"sentence":"The yaks are managed semidomestically by the nomadic tribes.","translation":"ヤクは遊牧民によって半家畜状態で管理されています。","type":"example"},{"sentence":"These plants are grown semidomestically, requiring minimal human intervention.","translation":"これらの植物は半栽培状態で栽培されており、人間の介入は最小限で済みます。","type":"example"}]}