{"word":"chundari","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of tie-dye textile, traditionally from Gujarat, India, featuring intricate patterns created by tying small knots in the fabric before dyeing.","english_definition":"A tie-dye textile, typically from Gujarat, India, characterized by intricate patterns created by tying small knots in the fabric before dyeing.","examples":[{"sentence":"She wore a beautiful red chundari for the wedding.","translation":"彼女は結婚式に美しい赤いチュンダリを着ていた。"},{"sentence":"The chundari is known for its vibrant colors and detailed designs.","translation":"チュンダリは鮮やかな色と細部にこだわったデザインで知られている。"}],"collocations":["wear a chundari","red chundari","traditional chundari","tie-dye chundari"],"synonyms":["bandhani","tie-dye","odhni"],"antonyms":[]}],"etymology":{"value":"Derived from the Gujarati word 'chundari', which comes from 'chundana', meaning to tie.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃʊndəri/","syllables":"chun-da-ri"},"inflection":{"noun_plural":"chundaris"},"usage_notes":{"explanation":"'Chundari' specifically refers to the tie-dye textile from Gujarat, India. While it is a type of tie-dye, not all tie-dye is chundari. The term often implies a specific cultural and regional origin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a chundari kimono.","correct":"✓ She wore a chundari sari.","note":"Chundari is traditionally used as part of a sari or odhni, not a kimono."}],"priority":"★☆☆"},"related_words":{"derivatives":["bandhani (related tie-dye technique)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chundari' is a specialized term referring to a specific type of tie-dye textile from Gujarat, India. Understanding its cultural context is essential for proper usage. It is most commonly encountered in discussions of Indian textiles, fashion, or cultural traditions."},"example_sentences":[{"sentence":"The bride was adorned in a stunning chundari, embroidered with gold threads.","translation":"花嫁は金糸で刺繍された見事なチュンダリで飾られていた。","type":"noun","meaning_category":"textile"},{"sentence":"The museum exhibit featured a collection of antique chundaris, showcasing the evolution of the craft.","translation":"博物館の展示では、その工芸の進化を紹介するアンティークのチュンダリのコレクションが展示されていた。","type":"noun","meaning_category":"textile"}]}