{"word":"bilinigrin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A pigment found in the integument of certain insects, responsible for black coloration.","english_definition":"A black pigment found in the integument of some insects.","examples":[{"sentence":"Bilinigrin is a type of ommochrome.","translation":"ビリニグリンはオンモクロムの一種です。"},{"sentence":"The presence of bilinigrin contributes to the dark color of the insect's cuticle.","translation":"ビリニグリンの存在は、昆虫のクチクラの暗い色に寄与します。"}],"collocations":["bilinigrin pigment","insect bilinigrin","bilinigrin synthesis"],"synonyms":["ommochrome","melanin"],"antonyms":[]}],"etymology":{"value":"Derived from 'bili-' (referring to bile, due to early association with bile pigments) + 'nigrin' (from Latin 'niger' meaning black).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪlɪˈnɪɡrɪn/","syllables":"bi-li-ni-grin"},"inflection":{"noun_plural":"bilinigrins"},"usage_notes":{"explanation":"Bilinigrin is a specialized term in entomology and biochemistry, specifically referring to a black pigment found in insects. It is a type of ommochrome, a class of pigments derived from tryptophan. Its presence and concentration determine the degree of black coloration in the insect's exoskeleton or other tissues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Bilinigrin is a type of chlorophyll.","correct":"✓ Bilinigrin is a type of ommochrome.","note":"Bilinigrin is an ommochrome, not chlorophyll. Chlorophyll is a pigment found in plants, algae, and cyanobacteria, responsible for photosynthesis."}],"priority":"★☆☆"},"related_words":{"derivatives":["ommochrome","integument","pigment"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bilinigrin' is a highly specialized term used in entomology and biochemistry. It refers to a specific type of black pigment found in the integument (outer covering) of certain insects. Understanding this term requires knowledge of insect physiology and pigment chemistry. It is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers analyzed the composition of the insect's cuticle and identified bilinigrin as the primary pigment responsible for its black coloration.","translation":"研究者らは昆虫のクチクラの組成を分析し、その黒色の主な原因となる色素としてビリニグリンを特定しました。","type":"scientific","meaning_category":"pigment"},{"sentence":"Mutations affecting the synthesis of bilinigrin can lead to altered pigmentation patterns in insects.","translation":"ビリニグリンの合成に影響を与える突然変異は、昆虫の色素パターンを変える可能性があります。","type":"scientific","meaning_category":"pigment synthesis"}]}