{"word":"quasi-investigated","priority":"低","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"準調査された、部分的に調査された","english_definition":"Partially or superficially investigated; investigated in a manner resembling a formal investigation but lacking full rigor or authority.","examples":[{"sentence":"The incident was quasi-investigated by an internal committee, but no formal report was ever filed.","translation":"その事件は内部委員会によって準調査されたが、正式な報告書は提出されなかった。"},{"sentence":"The claims were quasi-investigated, but the lack of resources prevented a thorough inquiry.","translation":"その主張は準調査されたが、資源の不足により徹底的な調査は妨げられた。"}],"collocations":["quasi-investigated claims","quasi-investigated incident","quasi-investigated allegations"],"synonyms":["partially investigated","superficially investigated","informally investigated","preliminarily investigated"],"antonyms":["thoroughly investigated","fully investigated","formally investigated","comprehensively investigated"]}],"etymology":{"value":"The term combines \"quasi-\" (meaning resembling or having some, but not all, of the qualities of) with \"investigated\" (having been subjected to inquiry or examination).","priority":"低"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ɪnˈvɛstɪˌɡeɪtɪd/","syllables":"kway-zai in-ves-ti-gay-tid"},"inflection":{"verb_forms":{"present_simple":["quasi-investigate","quasi-investigates"],"past_simple":"quasi-investigated","past_participle":"quasi-investigated","present_participle":"quasi-investigating"}},"usage_notes":{"explanation":"The term \"quasi-investigated\" implies that some form of inquiry or examination took place, but it was not as thorough, formal, or authoritative as a full investigation. It suggests a preliminary or incomplete assessment.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The case was quasi-investigated, so we have all the facts.","correct":"The case was quasi-investigated, so we have some of the facts, but further investigation is needed.","note":"A quasi-investigation does not provide all the facts; it is incomplete."},{"incorrect":"The quasi-investigated report was accepted as definitive.","correct":"The preliminary report was accepted, pending a full investigation.","note":"A quasi-investigation should not be considered definitive."}],"priority":"低"},"related_words":{"derivatives":["quasi-investigation","investigate","investigation"],"related_terms":["preliminary investigation","internal review","fact-finding mission"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The term 'quasi-investigated' is a specialized term indicating a partial or incomplete investigation. It is used to describe situations where an inquiry was conducted but lacked the rigor or comprehensiveness of a full investigation. Understanding this term requires a high level of English proficiency.","note":"This term is not commonly used in everyday language and is more likely to appear in legal, academic, or professional contexts."},"example_sentences":[{"sentence":"The allegations were quasi-investigated by the company's HR department.","translation":"その申し立ては、会社の人事部によって準調査された。","type":"general","meaning_category":"準調査された"},{"sentence":"Due to time constraints, the matter was only quasi-investigated.","translation":"時間の制約のため、その件は準調査にとどまった。","type":"general","meaning_category":"準調査された"},{"sentence":"The quasi-investigated findings were not considered conclusive.","translation":"その準調査の結果は決定的とは見なされなかった。","type":"general","meaning_category":"準調査された"}]}