{"word":"Cystine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シスチン：2つのシステイン分子がジスルフィド結合で結合したアミノ酸。タンパク質構造において重要な役割を果たす。","english_definition":"An amino acid formed when two cysteine molecules are joined by a disulfide bond. It plays an important role in protein structure.","examples":[{"sentence":"Cystine is less soluble in water than cysteine.","translation":"シスチンはシステインよりも水に溶けにくい。"},{"sentence":"The disulfide bonds formed by cystine residues stabilize protein structure.","translation":"シスチン残基によって形成されるジスルフィド結合は、タンパク質構造を安定化させる。"}],"collocations":["cystine crystal","cystine stone","cystine residue","disulfide bond","amino acid"],"synonyms":["dicysteine","bis-cysteine"],"antonyms":[],"notes":"Cystine is a dimer of cysteine. It is formed by the oxidation of two cysteine molecules, creating a disulfide bond between them."}],"etymology":{"value":"Derived from 'cysteine' with the suffix '-ine' indicating an amino acid. Cysteine itself comes from the Greek word 'κύστις' (kystis) meaning 'bladder' or 'cyst', because it was first isolated from bladder stones.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪstiːn/","syllables":"Cys-tine"},"inflection":{"noun_plural":"cystines"},"usage_notes":{"explanation":"Cystine is primarily encountered in scientific or medical contexts, especially when discussing protein structure, amino acid composition, or certain metabolic disorders like cystinuria. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cystine is a vitamin.","correct":"✓ Cystine is an amino acid.","note":"Cystine is an amino acid, specifically a dimer of cysteine, not a vitamin."},{"incorrect":"✗ Cysteine and cystine are the same thing.","correct":"✓ Cysteine and cystine are related, but cystine is formed from two cysteine molecules.","note":"Cysteine is a single amino acid, while cystine is formed when two cysteine molecules bond together."}],"priority":"★★☆"},"related_words":{"derivatives":["cysteine","cystinuria"],"related_terms":["amino acid","protein","disulfide bond","oxidation","reduction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cystine' is a technical term used in biochemistry and medicine to describe a specific amino acid structure. It is formed when two molecules of 'cysteine' bond together. This term is typically encountered in advanced scientific texts or medical discussions related to protein structure or metabolic disorders. Understanding the difference between 'cysteine' and 'cystine' is crucial in these contexts."},"example_sentences":[{"sentence":"Patients with cystinuria have difficulty reabsorbing cystine in the kidneys.","translation":"シスチン尿症の患者は、腎臓でシスチンを再吸収するのが困難である。","type":"noun","meaning_category":"medical"},{"sentence":"The stability of the protein is enhanced by the presence of cystine bridges.","translation":"タンパク質の安定性は、シスチン架橋の存在によって高められる。","type":"noun","meaning_category":"biochemistry"}]}