{"word":"amber-blue","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"琥珀色と青色が混ざった色合い、またはそれら二つの色を特徴とするもの","english_definition":"Having a color that is a mixture of amber and blue, or characterized by both amber and blue colors.","examples":[{"sentence":"The artist used an amber-blue palette to capture the ethereal quality of the sunset.","translation":"そのアーティストは、夕焼けの幽玄な雰囲気を捉えるために、琥珀色と青色のパレットを使用した。"},{"sentence":"Her eyes were an unusual amber-blue, shifting in hue with the light.","translation":"彼女の瞳は珍しい琥珀色と青色が混ざった色で、光によって色合いが変化した。"}],"collocations":["amber-blue eyes (琥珀色と青色の瞳)","amber-blue sky (琥珀色と青色の空)","amber-blue light (琥珀色と青色の光)","amber-blue painting (琥珀色と青色の絵画)"],"synonyms":["amber and blue","amber-tinged blue","blue with amber highlights"],"antonyms":[],"notes":"This term is relatively rare and often used in descriptive writing or art criticism."}],"etymology":{"value":"A compound word formed by combining 'amber' (referring to the yellowish-brown color of fossilized resin) and 'blue' (referring to the color of the sky or sea).","priority":"★★★"},"pronunciation":{"ipa":"/ˈæmbər ˌbluː/","syllables":"am-ber-blue"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Amber-blue' is a descriptive term used to evoke a specific color combination, often found in natural settings (like sunsets or bodies of water) or artistic representations. It suggests a blend or juxtaposition of warm (amber) and cool (blue) tones.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was painted amber blue.","correct":"✓ The room was painted amber-blue.","note":"The hyphen is important to indicate that it is a compound adjective modifying 'room'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_colors":["amber","blue","teal","aquamarine","gold","bronze"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in everyday language. More prevalent in literature, art descriptions, and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amber-blue' is a relatively uncommon term used to describe a specific color combination. It is most often found in descriptive writing, particularly in literature or art criticism, where precise and evocative language is valued. Understanding the individual colors (amber and blue) is essential to grasping the meaning of the compound term. Due to its rarity, it's unlikely to be encountered in basic English conversation or texts."},"example_sentences":[{"sentence":"The ocean reflected the amber-blue hues of the twilight sky.","translation":"海は、夕暮れの空の琥珀色と青色が混ざった色合いを映し出していた。","type":"descriptive","meaning_category":"color description"},{"sentence":"The designer incorporated amber-blue accents into the modern interior.","translation":"デザイナーは、モダンなインテリアに琥珀色と青色のアクセントを取り入れた。","type":"descriptive","meaning_category":"design and art"}]}