{"word":"Gaekwar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガエクワール (インドのマラーター族の支配者の称号、特にバルoda藩王国の支配者)","english_definition":"A member of the Gaekwar dynasty, a Maratha clan of India; especially the rulers of Baroda State.","examples":[{"sentence":"The Gaekwar of Baroda was known for his wealth and patronage of the arts.","translation":"バローダのガエクワールは、その富と芸術の擁護で知られていた。"}],"collocations":["Gaekwar dynasty","Gaekwar of Baroda"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Marathi word ' गायकवाड ' (Gāyakavāḍa), which is believed to be a combination of ' गाय ' (gāy, meaning cow) and ' कवाड ' (kavāḍ, meaning gate or door). The name likely originated from a family associated with cattle or guarding a gate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡeɪkwɑːr/","syllables":"Gaik-war"},"inflection":{},"usage_notes":{"explanation":"'Gaekwar' is primarily a historical term referring to a specific Maratha dynasty and its rulers, particularly those of Baroda State (now Vadodara, Gujarat, India). It is not a commonly used word in modern English outside of historical contexts or discussions of Indian royalty.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Maratha","Baroda State","Vadodara","Indian royalty"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gaekwar' is a specialized term primarily encountered in historical texts or discussions related to Indian history, specifically concerning the Maratha dynasty and the princely state of Baroda. Its usage is limited to contexts where Indian royalty or historical governance is being discussed. Due to its specific and historical nature, it is not part of common English vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The British negotiated treaties with the Gaekwar to establish their influence in the region.","translation":"イギリスは、地域における影響力を確立するために、ガエクワールと条約を交渉した。","type":"noun","meaning_category":"historical reference"},{"sentence":"Maharaja Sayajirao III was one of the most progressive Gaekwars of Baroda.","translation":"マハラジャ・サヤジラオ3世は、バローダで最も進歩的なガエクワールの1人だった。","type":"noun","meaning_category":"historical reference"}]}