{"word":"Windball","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(トリニダード・トバゴで人気の)ウィンドボールクリケット","english_definition":"A form of cricket, popular in Trinidad and Tobago, played with a soft ball.","examples":[{"sentence":"We played Windball in the park every weekend.","translation":"私たちは毎週末公園でウィンドボールクリケットをしました。"},{"sentence":"Windball is a very popular sport in Trinidad and Tobago.","translation":"ウィンドボールクリケットはトリニダード・トバゴで非常に人気のあるスポーツです。"}],"collocations":["play Windball","Windball tournament","Windball cricket"],"synonyms":["softball cricket"],"antonyms":[]}],"etymology":{"value":"The name 'Windball' comes from the soft, light ball used in the game, which is more susceptible to wind than a traditional cricket ball.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈwɪndbɔːl/","syllables":"wind-ball"},"inflection":{"noun_plural":"Windballs"},"usage_notes":{"explanation":"Windball is a specific type of cricket played primarily in Trinidad and Tobago and other Caribbean islands. It is characterized by the use of a softer, lighter ball, making it more accessible and less dangerous than traditional cricket. The rules are often adapted to suit the available space and number of players.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to play wind ball.","correct":"✓ I'm going to play Windball.","note":"'Windball' is a proper noun and should be capitalized."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Windball' refers to a specific variant of cricket played with a soft ball, primarily in Trinidad and Tobago. Understanding this term requires some familiarity with cricket and Caribbean culture. It is not a widely used term outside of these contexts."},"example_sentences":[{"sentence":"The annual Windball tournament is a major event in the community.","translation":"年次ウィンドボールクリケット大会は地域社会の主要なイベントです。","type":"noun","meaning_category":"ウィンドボールクリケット"},{"sentence":"He is known for his powerful hitting in Windball.","translation":"彼はウィンドボールクリケットでの強力な打撃で知られています。","type":"noun","meaning_category":"ウィンドボールクリケット"}]}