{"word":"protozoans","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"原生動物","english_definition":"A group of single-celled eukaryotic organisms (protists), some of which are parasitic.","examples":[{"sentence":"Protozoans are found in a variety of habitats, including soil, water, and as parasites in other organisms.","translation":"原生動物は、土壌、水、他の生物の寄生体など、さまざまな生息地で見られます。"},{"sentence":"Some protozoans cause diseases in humans, such as malaria and giardiasis.","translation":"一部の原生動物は、マラリアやジアルジア症など、人間の病気を引き起こします。"}],"collocations":["parasitic protozoans","free-living protozoans","intestinal protozoans","protozoan infection","study of protozoans"],"synonyms":["protists","single-celled eukaryotes"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'protos' (first) and 'zoon' (animal), reflecting their early classification as animal-like organisms.","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtəˈzoʊənz/","syllables":"pro-to-zo-ans"},"inflection":{"noun_plural":"protozoans","noun_singular":"protozoan"},"usage_notes":{"explanation":"'Protozoans' refers to a diverse group of eukaryotic microorganisms. They are not a formal taxonomic group but are often studied together due to their shared characteristics as single-celled organisms with animal-like behaviors, such as motility and heterotrophic nutrition. Modern classification often places them within various groups of protists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Protozoans are bacteria.","correct":"✓ Protozoans are eukaryotes.","note":"Protozoans are eukaryotic organisms, meaning they have a nucleus and other complex cell structures, unlike bacteria, which are prokaryotic. Protozoans are more complex than bacteria."},{"incorrect":"✗ All protozoans are harmful.","correct":"✓ Some protozoans are harmful, but many are not.","note":"While some protozoans are parasitic and cause diseases, many are free-living and play important roles in ecosystems."}],"priority":"★★☆"},"related_words":{"derivatives":["protozoal (adjective)","protozoology (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protozoans' is a scientific term referring to a group of single-celled eukaryotic organisms. Understanding this term requires some background knowledge in biology, specifically the classification of microorganisms. The term is primarily used in scientific and educational contexts related to biology, microbiology, and parasitology. It is important to distinguish protozoans from other microorganisms like bacteria and viruses, as they have different cellular structures and mechanisms of action.","priority":"★★☆"},"example_sentences":[{"sentence":"The pond water contained a variety of protozoans.","translation":"池の水にはさまざまな原生動物が含まれていました。","type":"general","meaning_category":"general"},{"sentence":"Scientists are studying the role of protozoans in the soil ecosystem.","translation":"科学者たちは土壌生態系における原生動物の役割を研究しています。","type":"scientific","meaning_category":"scientific"},{"sentence":"Giardiasis is a disease caused by the protozoan Giardia lamblia.","translation":"ジアルジア症は、ジアルジア・ランブリアという原生動物によって引き起こされる病気です。","type":"medical","meaning_category":"medical"}]}