{"word":"banjuke","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, neologism) A person who is overly enthusiastic or obsessed with the anime series 'Bungo Stray Dogs'.","english_definition":"A portmanteau of 'Bungo Stray Dogs' and 'junkie', referring to someone with an extreme obsession with the series.","examples":[{"sentence":"Ever since she started watching Bungo Stray Dogs, she's become a total banjuke.","translation":"彼女は文豪ストレイドッグスを見始めてから、完全にバンジュケになってしまった。","usage_notes":"This term is often used negatively or humorously to describe someone's intense fandom."}],"collocations":["total banjuke","obsessed banjuke"],"synonyms":["BSD junkie","Bungo Stray Dogs fanatic"],"antonyms":["casual fan","non-fan"]}],"etymology":{"value":"A portmanteau of 'Bungo Stray Dogs' and 'junkie'.","priority":"high"},"pronunciation":{"ipa":"/ban.d͡ʑu.ke/","syllables":"ban-ju-ke"},"inflection":{"noun_plural":"banjukes"},"usage_notes":{"explanation":"The term 'banjuke' is a slang term primarily used online within anime fan communities. It's a blend of the series name 'Bungo Stray Dogs' and 'junkie', implying an addiction or extreme obsession. It can be considered derogatory or humorous depending on the context and the speaker's intent.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"He's just a banjuke; don't take him seriously.","correct":"He's just a hardcore fan; don't take him too seriously.","note":"Using 'hardcore fan' or 'dedicated fan' is a more neutral way to describe someone's enthusiasm."}],"priority":"medium"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["fanboy","fangirl","otaku","weeaboo"]},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in online anime communities.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'banjuke' requires familiarity with anime fandom culture and slang. It's not a widely recognized word outside of specific online communities dedicated to 'Bungo Stray Dogs'. Understanding the portmanteau and its implied meaning requires a high level of cultural and linguistic awareness."},"example_sentences":[{"sentence":"Some people call anyone who enjoys Bungo Stray Dogs a banjuke, but that's not fair.","translation":"文豪ストレイドッグスを楽しんでいる人を誰でもバンジュケと呼ぶ人もいるけど、それはフェアじゃない。","type":"noun","meaning_category":"slang"}]}