{"word":"anapnoic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"無呼吸の、呼吸停止の","english_definition":"Relating to or characterized by anapnea (temporary cessation of breathing).","examples":[{"sentence":"The patient was anapnoic after the overdose.","translation":"患者は過剰摂取後、無呼吸状態だった。"},{"sentence":"Anapnoic episodes can be a sign of a serious medical condition.","translation":"無呼吸発作は深刻な病気の兆候である可能性がある。"}],"collocations":["anapnoic episode","anapnoic state","become anapnoic"],"synonyms":["apneic","breathless"],"antonyms":["breathing","ventilating"]}],"etymology":{"value":"Derived from the Greek 'anapneo' meaning 'to recover breath' or 'to revive'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænæpˈnoʊɪk/","syllables":"a-nap-no-ic"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. Comparative and superlative forms are 'more anapnoic' and 'most anapnoic'."},"usage_notes":{"explanation":"'Anapnoic' is a medical term primarily used to describe a state or condition characterized by a temporary cessation of breathing. It is often used in clinical settings when discussing respiratory issues or the effects of certain medical conditions or treatments. It is more specific than simply saying 'not breathing,' as it implies a temporary state that may resolve or require intervention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was anapnea.","correct":"✓ The patient was anapnoic.","note":"'Anapnea' is a noun (the condition of breath cessation), while 'anapnoic' is the adjective describing the state."},{"incorrect":"✗ Anapnoic is the act of breathing.","correct":"✓ Anapnea is the cessation of breathing.","note":"Ensure the correct term is used to avoid confusion."}],"priority":"★☆☆"},"related_words":{"derivatives":["anapnea (noun: cessation of breathing)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency. A specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anapnoic' is a highly specialized medical term indicating a state of temporary cessation of breathing. Its usage is confined to medical or scientific contexts. Understanding requires familiarity with medical terminology related to respiration and physiology. It is not commonly used in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The infant became anapnoic during the sleep study, requiring immediate intervention.","translation":"その乳児は睡眠調査中に無呼吸状態になり、直ちに介入が必要となった。","type":"general","meaning_category":"medical"},{"sentence":"Certain medications can induce an anapnoic state as a side effect.","translation":"特定の薬は副作用として無呼吸状態を引き起こす可能性がある。","type":"medical","meaning_category":"medical"},{"sentence":"The paramedics reported the patient was briefly anapnoic at the scene of the accident.","translation":"救急隊員は、患者が事故現場で一時的に無呼吸状態だったと報告した。","type":"medical","meaning_category":"medical"}]}