{"word":"non-Sabbath-observing","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"安息日を守らない、安息日遵守でない","english_definition":"Not observing or adhering to the Sabbath; not practicing Sabbath observance.","examples":[{"sentence":"The restaurant caters to both Sabbath-observing and non-Sabbath-observing customers.","translation":"そのレストランは、安息日を守る顧客と守らない顧客の両方に対応している。"},{"sentence":"Many businesses are open on Saturdays, catering to a non-Sabbath-observing clientele.","translation":"多くの企業が土曜日に営業しており、安息日を守らない顧客層に対応している。"},{"sentence":"The community includes both Sabbath-observing and non-Sabbath-observing families.","translation":"そのコミュニティには、安息日を守る家族と守らない家族の両方が含まれている。"}],"collocations":["non-Sabbath-observing community","non-Sabbath-observing businesses","non-Sabbath-observing customers","non-Sabbath-observing lifestyle"],"synonyms":["secular","non-religious","non-observant"],"antonyms":["Sabbath-observing","Sabbath-keeping","observant"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'Sabbath-observing'. 'Sabbath-observing' refers to the practice of adhering to the religious rules and customs associated with the Sabbath, a day of rest and worship.","priority":"low"},"pronunciation":{"ipa":null,"syllables":"non-Sab-bath-ob-serv-ing"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"This term is typically used in contexts where the observance or non-observance of the Sabbath is relevant, such as in discussions of religious practices, business operations, or community demographics. It is a descriptive term, not usually judgmental.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non Sabbath observing person.","correct":"✓ He is a non-Sabbath-observing person.","note":"Hyphenation is important for clarity. Without the hyphens, it can be misinterpreted."},{"incorrect":"✗ non Sabbath observer","correct":"✓ non-Sabbath observer / non-Sabbath-observing person","note":"Using 'observer' alone might not fully convey the practice of Sabbath observance. 'Non-Sabbath-observing person' is clearer."}],"priority":"low"},"related_words":{"derivatives":["Sabbath","Sabbath-observing","observance"],"phrases":["Sabbath observance","keep the Sabbath","break the Sabbath"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is specific and not commonly used outside of relevant contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'non-Sabbath-observing' is relatively complex and specific, typically used in discussions about religious practices and adherence to the Sabbath. It is most likely encountered in texts discussing religious communities, business practices related to religious holidays, or sociological studies of religious observance. Understanding requires familiarity with the concept of the Sabbath and the practice of observing it.","priority":"low"},"example_sentences":[{"sentence":"The store remains open on Saturdays to accommodate its non-Sabbath-observing customers.","translation":"その店は、安息日を守らない顧客に対応するために土曜日も営業している。","type":"general","meaning_category":"general"},{"sentence":"The survey compared the lifestyles of Sabbath-observing and non-Sabbath-observing families.","translation":"その調査では、安息日を守る家族と守らない家族のライフスタイルを比較した。","type":"sociological","meaning_category":"sociological"},{"sentence":"The policy change affected both Sabbath-observing and non-Sabbath-observing employees.","translation":"その方針変更は、安息日を守る従業員と守らない従業員の両方に影響を与えた。","type":"business","meaning_category":"business"}]}