{"word":"nonaxiomatically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"公理的でない方法で、自明のこととして受け入れずに","english_definition":"in a manner that is not axiomatic; not based on or derived from axioms or self-evident truths.","examples":[{"sentence":"The theorem was derived nonaxiomatically, relying on empirical evidence rather than first principles.","translation":"その定理は公理的にではなく、第一原理よりも経験的証拠に頼って導き出された。"},{"sentence":"He approached the problem nonaxiomatically, questioning every assumption.","translation":"彼はすべての仮定に疑問を呈し、その問題に公理的でない方法で取り組んだ。"}],"collocations":["derived nonaxiomatically","approached nonaxiomatically","treated nonaxiomatically"],"synonyms":["empirically","inductively","experimentally"],"antonyms":["axiomatically","deductively","self-evidently"]}],"etymology":{"value":"\"non-\" (否定) + \"axiomatically\" (公理的に)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌæksiəˈmætɪkli/","syllables":"non-ax-i-o-mat-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Nonaxiomatically\" describes a method or approach that does not rely on axioms or self-evident truths. It suggests an approach based on observation, experimentation, or other forms of evidence rather than starting from established principles. It is often used in philosophical, mathematical, or scientific contexts where the validity of assumptions is questioned.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was proven nonaxiomatically.","correct":"✓ The data was analyzed nonaxiomatically.","note":"\"Proven\" typically implies a deductive, axiomatic approach. \"Analyzed\" is more appropriate for a nonaxiomatic approach."},{"incorrect":"✗ He nonaxiomatically believed in the theory.","correct":"✓ He approached the theory nonaxiomatically.","note":"\"Believe\" implies acceptance without proof. \"Approached\" is better when questioning assumptions."}],"priority":"★☆☆"},"related_words":{"derivatives":["axiom","axiomatic","axiomatically","nonaxiomatic"],"antonyms":["axiomatically"],"related_concepts":["empirical evidence","inductive reasoning","deductive reasoning","first principles"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonaxiomatically\" means not based on axioms, which are statements accepted as true without proof. This word is used in advanced discussions, particularly in philosophy, mathematics, and science, to describe methods that question fundamental assumptions and rely on evidence or observation instead of starting from self-evident truths. It's a sophisticated term indicating a critical and questioning approach to knowledge.","priority":"★☆☆"},"example_sentences":[{"sentence":"The model was developed nonaxiomatically, using data-driven methods to identify patterns.","translation":"そのモデルは、パターンを特定するためにデータ駆動型の手法を用いて、公理的でない方法で開発された。","type":"adverb","meaning_category":"公理的でない方法で"},{"sentence":"She argued nonaxiomatically for the existence of the phenomenon, presenting a range of empirical observations.","translation":"彼女は、一連の経験的観察を提示し、その現象の存在を公理的でない方法で主張した。","type":"adverb","meaning_category":"公理的でない方法で"}]}