{"word":"ascariasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"回虫症","english_definition":"an infection of the small intestine caused by Ascaris lumbricoides, a type of roundworm.","examples":[{"sentence":"Ascariasis is a common parasitic infection worldwide, especially in areas with poor sanitation.","translation":"回虫症は世界中でよく見られる寄生虫感染症であり、特に衛生状態の悪い地域で多いです。"},{"sentence":"Symptoms of ascariasis may include abdominal pain, nausea, and diarrhea.","translation":"回虫症の症状には、腹痛、吐き気、下痢などがあります。"}],"collocations":["treat ascariasis (回虫症を治療する)","diagnose ascariasis (回虫症を診断する)","prevent ascariasis (回虫症を予防する)","ascariasis infection (回虫症感染)","severe ascariasis (重度の回虫症)"],"synonyms":["roundworm infection","helminthiasis"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Ascaris' (from Greek 'askaris' meaning intestinal worm) + '-iasis' (denoting a disease or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæskəˈraɪəsɪs/","syllables":"as-ca-ri-a-sis"},"inflection":{"noun_plural":"ascariases (rare)"},"usage_notes":{"explanation":"Ascariasis is typically contracted by ingesting food or water contaminated with Ascaris eggs. It is more prevalent in areas with inadequate sanitation and hygiene practices. Diagnosis is usually made by identifying Ascaris eggs in a stool sample. Treatment typically involves medication to kill the worms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ascariasis is caused by a bacteria.","correct":"✓ Ascariasis is caused by a roundworm.","note":"Ascariasis is a parasitic infection caused by a roundworm, not a bacteria."},{"incorrect":"✗ Ascariasis is not treatable.","correct":"✓ Ascariasis is treatable with medication.","note":"Ascariasis is generally treatable with antihelminthic medications."}],"priority":"★★☆"},"related_words":{"derivatives":["Ascaris (回虫)","Ascaris lumbricoides (ブタ回虫)","antihelminthic (駆虫薬)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な医学用語)","frequency_google_ngram":"低頻度 (Low frequency) - 医学・獣医学分野の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ascariasis' is a medical term referring to an infection caused by a specific type of roundworm called *Ascaris lumbricoides*. This infection primarily affects the small intestine and is typically contracted through the ingestion of contaminated food or water. The term is mainly used in medical contexts and may not be commonly encountered in everyday language. Understanding this term is important in the fields of medicine, public health, and veterinary science, especially when discussing parasitic diseases.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor suspected ascariasis after the patient presented with abdominal pain and unexplained weight loss.","translation":"医師は、患者が腹痛と原因不明の体重減少を訴えた後、回虫症を疑った。","type":"general","meaning_category":"回虫症"},{"sentence":"Proper handwashing and sanitation practices are crucial for preventing the spread of ascariasis in communities.","translation":"適切な手洗いや衛生習慣は、地域社会における回虫症の蔓延を防ぐために非常に重要である。","type":"prevention","meaning_category":"回虫症"},{"sentence":"Treatment for ascariasis typically involves a single dose of medication to eliminate the parasitic worms.","translation":"回虫症の治療は通常、寄生虫を駆除するために単回投与の薬を服用する。","type":"treatment","meaning_category":"回虫症"}]}