{"word":"Protreptic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A discourse or writing that urges someone to embrace a particular way of life or set of beliefs, especially philosophy.","english_definition":"A discourse or writing that urges someone to embrace a particular way of life or set of beliefs, especially philosophy.","examples":[{"sentence":"Aristotle's Protrepticus is a famous example of this genre, encouraging the pursuit of philosophy.","translation":"アリストテレスの『プロトレプティコス』は、哲学の追求を促すこのジャンルの有名な例です。"}],"collocations":["philosophical protreptic","hortatory protreptic"],"synonyms":["exhortation","admonition","persuasion","encouragement"],"antonyms":["dissuasion","discouragement"]}],"etymology":{"value":"From Ancient Greek προτρεπτικός (protreptikós, “hortatory, inciting”), from προτρέπω (protrépō, “to urge forward, exhort”).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈtrɛptɪk/","syllables":"pro-trep-tic"},"inflection":{"noun_plural":"protreptics"},"usage_notes":{"explanation":"'Protreptic' is most often encountered in academic or philosophical contexts. It refers to a specific type of persuasive discourse, often aimed at convincing someone to adopt a philosophical lifestyle or belief system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a protreptic speech about the importance of eating vegetables.","correct":"✓ He gave a persuasive speech about the importance of eating vegetables.","note":"While a protreptic speech aims to persuade, it is usually reserved for encouraging the adoption of a philosophical or ethical way of life, not simply a healthy habit."}],"priority":"★★☆"},"related_words":{"derivatives":["protreptical (adjective)"],"related_terms":["hortatory","didactic","persuasive"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'protreptic' is highly specialized and rarely used outside of academic philosophical discussions. Understanding requires familiarity with classical rhetoric and philosophical traditions."},"example_sentences":[{"sentence":"The professor assigned us to read a protreptic by a Stoic philosopher.","translation":"教授は私たちにストア派哲学者のプロトレプティコスを読むように課題を出した。","type":"noun","meaning_category":"philosophical discourse"},{"sentence":"His lecture was a protreptic, urging students to consider the ethical implications of their career choices.","translation":"彼の講義はプロトレプティコスであり、学生たちにキャリア選択の倫理的意味を考慮するように促した。","type":"noun","meaning_category":"persuasive writing"}]}