{"word":"unsupportableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"耐えられないこと、支持できないこと、弁護できないこと","english_definition":"The state or quality of being unsupportable; the condition of being unable to be supported, defended, or endured.","examples":[{"sentence":"The unsupportableness of his argument was clear to everyone in the room.","translation":"彼の議論が支持できないことは、部屋にいた全員にとって明らかだった。"},{"sentence":"The unsupportableness of the living conditions led to widespread protests.","translation":"生活環境の耐え難さが広範囲にわたる抗議活動につながった。"},{"sentence":"The unsupportableness of the dictator's policies eventually led to his downfall.","translation":"独裁者の政策の弁護しがたさが、最終的に彼の失脚につながった。"}],"collocations":["the unsupportableness of a claim (主張の支持不可能性)","the unsupportableness of a situation (状況の耐え難さ)","the unsupportableness of an argument (議論の弁護不可能性)"],"synonyms":["intolerableness","unbearableness","indefensibility","unsustainability","untenability"],"antonyms":["supportableness","tolerableness","bearableness","defensibility","sustainability","tenability"]}],"etymology":{"value":"Derived from 'unsupportable' (not able to be supported, defended, or endured) with the addition of the suffix '-ness' which turns adjectives into nouns denoting a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnsəˈpɔːrtəbəlˌnəs/","syllables":"un-sup-port-a-ble-ness"},"inflection":{"noun_plural":"unsupportablenesses (rarely used)"},"usage_notes":{"explanation":"'Unsupportableness' is a relatively uncommon word, typically used in formal or academic contexts. It refers to the abstract quality of something being impossible to support, either physically, logically, or morally. It emphasizes the inherent inability to justify, defend, or endure something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsupportableness was high.","correct":"✓ The degree of unsupportableness was high.","note":"'Unsupportableness' is a quality or state, not a measurable quantity. Instead of saying 'The unsupportableness was high,' it's better to say 'The degree of unsupportableness was high' or 'The extent of its unsupportableness was clear.'"},{"incorrect":"✗ He showed unsupportableness.","correct":"✓ He showed an unsupportable attitude.","note":"'Unsupportableness' is a quality of something, not a behavior of a person. Instead, describe the person's attitude or behavior as 'unsupportable'."}],"priority":"★★☆"},"related_words":{"derivatives":["unsupportable (adjective)","supportable (adjective)","support (verb, noun)","supportiveness (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unsupportableness' is a complex and rare word. It is formed by adding the suffix '-ness' to the adjective 'unsupportable,' which means 'not able to be supported, defended, or endured.' Therefore, 'unsupportableness' refers to the state or quality of something being impossible to support, either physically, logically, or morally. This word is typically used in formal or academic writing to describe the inherent inability to justify or defend something. Due to its complexity and infrequent use, it is more suitable for advanced English learners."},"example_sentences":[{"sentence":"The sheer unsupportableness of the regime's actions led to international condemnation.","translation":"政権の行動の全く支持できない性質が、国際的な非難につながった。","type":"noun","meaning_category":"支持できないこと"},{"sentence":"The unsupportableness of the theory became evident as new evidence emerged.","translation":"新しい証拠が現れるにつれて、その理論の弁護しがたさが明らかになった。","type":"noun","meaning_category":"弁護できないこと"},{"sentence":"The unsupportableness of the situation forced them to seek a radical solution.","translation":"その状況の耐え難さが、彼らに根本的な解決策を模索させた。","type":"noun","meaning_category":"耐えられないこと"}]}