{"word":"Nightriding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)夜間に暴行や脅迫を行うこと、特にアイルランドにおける農民運動に関連して","english_definition":"(historical) A form of agrarian protest or violence, especially in Ireland, involving nocturnal raids and intimidation.","examples":[{"sentence":"Nightriding was a common tactic used by the Whiteboys to enforce their demands.","translation":"ナイトライディングは、ホワイトボーイズが要求を強制するために用いた一般的な戦術でした。"},{"sentence":"The authorities struggled to suppress nightriding and other forms of rural unrest.","translation":"当局は、ナイトライディングやその他の農村部の騒乱を鎮圧するのに苦労しました。"}],"collocations":["agrarian nightriding","rural nightriding","suppress nightriding","prevent nightriding"],"synonyms":["intimidation","coercion","vigilantism"],"antonyms":["peaceful protest","legal action"]},{"part_of_speech":"noun","definition":"夜間に乗馬、サイクリング、またはオートバイに乗ること","english_definition":"The activity of riding a horse, bicycle, or motorcycle at night.","examples":[{"sentence":"Nightriding can be dangerous due to poor visibility.","translation":"夜間の乗馬は、視界が悪いため危険な場合があります。"},{"sentence":"He enjoys nightriding through the quiet countryside.","translation":"彼は静かな田園地帯を夜間に乗馬するのを楽しんでいます。"}],"collocations":["horse nightriding","bicycle nightriding","motorcycle nightriding","enjoy nightriding","dangerous nightriding"],"synonyms":["night cycling","night horseback riding","night motorcycling"],"antonyms":["day riding"]}],"etymology":{"value":"\"Night\" + \"riding\". The historical sense likely arose from the clandestine nature of the activities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪtˌraɪdɪŋ/","syllables":"night-rid-ing"},"inflection":{"noun_plural":"Nightridings"},"usage_notes":{"explanation":"The term \"Nightriding\" has two main meanings. The first refers to a historical form of agrarian violence, particularly in Ireland. The second, more literal meaning, refers to riding a horse, bicycle, or motorcycle at night. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was arrested for nightriding his bike without lights.","correct":"✓ He was arrested for riding his bike at night without lights.","note":"While 'nightriding' is technically correct, it can sound archaic or suggest the historical meaning. Using \"riding his bike at night\" is clearer. "},{"incorrect":"✗ The nightriding was a peaceful demonstration.","correct":"✓ The nightriding was a violent act of intimidation.","note":"When referring to the historical meaning, emphasize the violent or intimidating nature of the activity."}],"priority":"★☆☆"},"related_words":{"derivatives":["nightrider (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Nightriding\" can be confusing due to its two distinct meanings. The historical meaning refers to violent agrarian protests in Ireland, while the more literal meaning refers to riding a horse, bicycle, or motorcycle at night. Understanding the context is crucial to interpreting the intended meaning. The historical sense is less common in modern usage. "},"example_sentences":[{"sentence":"The history books detailed the acts of nightriding that plagued the region.","translation":"歴史書には、その地域を苦しめたナイトライディングの行為が詳しく記されていた。","type":"noun","meaning_category":"Historical agrarian violence"},{"sentence":"Nightriding on a motorcycle requires extra caution.","translation":"オートバイでのナイトライディングは、特に注意が必要です。","type":"noun","meaning_category":"Riding at night"}]}