{"word":"Unzoning","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(都市計画) ゾーニングの廃止、用途地域指定の解除","english_definition":"The removal of zoning regulations in a specific area or city.","examples":[{"sentence":"Unzoning could lead to a mix of residential and commercial buildings in the same area.","translation":"ゾーニングの廃止は、同じ地域に住宅用建物と商業用建物が混在することにつながる可能性があります。"},{"sentence":"The city council is considering unzoning a portion of the downtown area to encourage redevelopment.","translation":"市議会は、再開発を促進するために、ダウンタウン地区の一部について用途地域指定の解除を検討しています。"}],"collocations":["urban unzoning","complete unzoning","partial unzoning"],"synonyms":["deregulation","zoning removal"],"antonyms":["zoning","urban planning"]},{"part_of_speech":"verb","definition":"(都市計画) ゾーニングを廃止する、用途地域指定を解除する","english_definition":"To remove zoning regulations from a specific area or city.","examples":[{"sentence":"The city unzoned the industrial area to allow for residential development.","translation":"市は住宅開発を許可するために工業地域の用途地域指定を解除しました。"},{"sentence":"They are proposing to unzone the area near the train station.","translation":"彼らは駅周辺地域の用途地域指定の解除を提案しています。"}],"collocations":["unzoning land","unzoning a district","unzoning for development"],"synonyms":["deregulate","remove zoning"],"antonyms":["zone","regulate"]}],"etymology":{"value":"The word 'unzoning' is formed by adding the prefix 'un-' (meaning 'not' or 'removal of') to the word 'zoning'. Zoning itself refers to the process of dividing land in a municipality into zones in which certain land uses are permitted or prohibited.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈzoʊnɪŋ/","syllables":"un-zon-ing"},"inflection":{"verb_forms":{"present_simple":["unzone","unzones"],"past_simple":"unzoned","past_participle":"unzoned","present_participle":"unzoning"}},"usage_notes":{"explanation":"'Unzoning' refers to the act of removing or eliminating zoning regulations within a specific area. Zoning regulations are rules set by local governments that dictate how land can be used, such as for residential, commercial, or industrial purposes. Unzoning can lead to a mix of different types of buildings and land uses within the same area, potentially promoting greater flexibility and diversity in urban development. However, it can also raise concerns about compatibility between different land uses and potential negative impacts on property values or quality of life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unzoning was happened suddenly.","correct":"✓ The unzoning happened suddenly.","note":"'Unzoning' is a noun, so it doesn't need the auxiliary verb 'was' in this context. The correct sentence structure is 'The unzoning happened suddenly.'"},{"incorrect":"✗ They are unzoning to the area.","correct":"✓ They are unzoning the area.","note":"When using 'unzoning' as a verb, it should be followed by the object (the area being unzoned) directly, without the preposition 'to.' The correct sentence is 'They are unzoning the area.'"}],"priority":"★★☆"},"related_words":{"derivatives":["zone","zoning","rezoning"],"phrases":["mixed-use development","urban sprawl","land use regulation"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unzoning' is a term used in urban planning and real estate. It refers to the process of removing or eliminating zoning regulations in a specific area. Zoning regulations are rules that determine how land can be used, such as for residential, commercial, or industrial purposes. When an area is unzoned, it means that these regulations are no longer in effect, potentially allowing for a mix of different types of buildings and land uses. This can have both positive and negative consequences, depending on the specific context and goals of the community. Understanding the concept of unzoning requires some knowledge of urban planning and land use regulation."},"example_sentences":[{"sentence":"The proposal to unzone the industrial district sparked a heated debate among residents.","translation":"工業地区の用途地域指定解除の提案は、住民の間で激しい議論を引き起こしました。","type":"general","meaning_category":"Urban Planning"},{"sentence":"Unzoning can lead to increased property values in some areas, but decreased values in others.","translation":"用途地域指定の解除は、一部の地域では不動産価値の上昇につながる可能性がありますが、他の地域では価値の低下につながる可能性があります。","type":"general","meaning_category":"Urban Planning"},{"sentence":"The city council voted to unzone the downtown area to encourage mixed-use development.","translation":"市議会は、複合用途開発を促進するために、ダウンタウン地区の用途地域指定を解除することを決定しました。","type":"general","meaning_category":"Urban Planning"}]}