{"word":"sparrow-billed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(鳥などが)スズメのような嘴(くちばし)を持つ","english_definition":"Having a bill resembling that of a sparrow.","examples":[{"sentence":"The sparrow-billed finch is a common sight in the area.","translation":"その地域では、スズメのような嘴をしたフィンチをよく見かける。"}],"collocations":["sparrow-billed finch (スズメのような嘴のフィンチ)"],"synonyms":["finch-billed"],"antonyms":[]}],"etymology":{"value":"'Sparrow' + 'billed'. A descriptive term combining the name of the sparrow with 'billed', indicating the shape of the beak.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspæroʊˌbɪld/","syllables":"spar-row-billed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'sparrow-billed' is primarily used in ornithology (the study of birds) to describe birds with beaks that are similar in shape and size to those of sparrows. It is a descriptive adjective, often used to classify or identify species.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sparrow-billed animal was eating seeds.","correct":"✓ The sparrow-billed bird was eating seeds.","note":"'Sparrow-billed' specifically refers to birds, so it should not be used to describe other animals."}],"priority":"★★☆"},"related_words":{"derivatives":["billed (adjective: having a bill of a specified kind)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sparrow-billed' is a specialized adjective used in ornithology to describe birds with beaks resembling those of sparrows. It is not a common term in everyday language and would primarily be encountered in scientific or descriptive contexts related to birds. Understanding requires familiarity with basic bird anatomy and vocabulary."},"example_sentences":[{"sentence":"The ornithologist identified the bird as sparrow-billed based on its beak shape.","translation":"鳥類学者は、その鳥の嘴の形からスズメのような嘴を持つと判断した。","type":"adjective","meaning_category":"description"}]}