{"word":"micropathologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A pathologist specializing in the study of diseases at the microscopic level, often focusing on tissue samples and cellular abnormalities.","english_definition":"A pathologist who specializes in the study of diseases at the microscopic level.","examples":[{"sentence":"The micropathologist examined the tissue sample under high magnification to identify the cancerous cells.","translation":"その微細病理学者は、癌細胞を特定するために高倍率で組織サンプルを調べた。"},{"sentence":"Micropathologists play a crucial role in diagnosing various diseases, including infections and tumors.","translation":"微細病理学者は、感染症や腫瘍を含む様々な疾患の診断において重要な役割を果たす。"}],"collocations":["examine tissue samples","diagnose diseases","identify cellular abnormalities","work in a laboratory","use microscopes"],"synonyms":["histopathologist","cellular pathologist"],"antonyms":[]}],"etymology":{"value":"The word is formed from 'micro-' (small, microscopic), 'patho-' (relating to disease), and '-logist' (one who studies).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊpəˈθɒlədʒɪst/","syllables":"mi-cro-pa-thol-o-gist"},"inflection":{"noun_plural":"micropathologists"},"usage_notes":{"explanation":"A micropathologist is a specialized type of pathologist who focuses on the microscopic examination of tissues and cells to diagnose diseases. This role is essential in identifying and understanding various medical conditions, including cancer, infections, and autoimmune disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The micro pathologist analyzed the blood sample.","correct":"✓ The micropathologist analyzed the tissue sample.","note":"Micropathologists primarily work with tissue samples, not blood samples, which are typically analyzed by hematologists or clinical pathologists."}],"priority":"★☆☆"},"related_words":{"derivatives":["micropathology (noun: the study of diseases at the microscopic level)","pathology (noun: the study of diseases)","histopathology (noun: the microscopic study of diseased tissues)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'micropathologist' is a specialized medical term. It refers to a pathologist who specializes in examining tissues and cells under a microscope to diagnose diseases. This term is typically used in medical and scientific contexts. Understanding requires knowledge of basic medical terminology."},"example_sentences":[{"sentence":"The senior **micropathologist** reviewed the complex case to confirm the diagnosis.","translation":"そのベテラン微細病理学者は診断を確定するために複雑な症例を再検討した。","type":"noun","meaning_category":"specialist"},{"sentence":"As a **micropathologist**, she spends hours each day analyzing slides under the microscope.","translation":"微細病理学者として、彼女は毎日何時間も顕微鏡でスライドを分析する。","type":"noun","meaning_category":"professional"}]}