{"word":"recodified","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再編成する、再コード化する、再体系化する","english_definition":"To codify again; to revise and rearrange (laws, rules, etc.) into a systematic code.","examples":[{"sentence":"The state legislature recodified its criminal laws.","translation":"州議会は刑法を再編成した。"},{"sentence":"The software was recodified to improve its efficiency.","translation":"ソフトウェアは効率を改善するために再コード化された。"}],"collocations":["recodify laws","recodify regulations","recodify software","recodify a system"],"synonyms":["reorganize","rearrange","recompile","revise","restructure"],"antonyms":["disorganize","derange"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(情報を)再符号化する、再暗号化する","english_definition":"To encode (information) again, possibly using a different system.","examples":[{"sentence":"The data was recodified using a more secure algorithm.","translation":"データはより安全なアルゴリズムを使用して再符号化された。"}],"collocations":["recodify data","recodify information","recodify a message"],"synonyms":["re-encode","re-encrypt"],"antonyms":["decode","decrypt"]}],"etymology":{"value":"\"re-\" (again) + \"codify\" (to arrange laws or rules into a systematic code).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈkɒdɪfaɪd/","syllables":"re-cod-i-fied"},"inflection":{"verb_forms":{"present_simple":["recodify","recodifies"],"past_simple":"recodified","past_participle":"recodified","present_participle":"recodifying"}},"usage_notes":{"explanation":"\"Recodify\" is a verb that means to codify something again. Codifying typically involves organizing laws, rules, or data into a systematic and structured format. When something is recodified, it means it has been previously codified, and now it is being revised, reorganized, or re-encoded. This might be done to update the information, improve its structure, or use a more efficient or secure system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The laws were recodified for simplicity, but they became more confused.","correct":"✓ The laws were recodified for simplicity, but they became more complex.","note":"Recodification aims to improve clarity and structure, so it's more likely to make things more complex (in a structured way) rather than confused."},{"incorrect":"✗ He recodified the data, but it was still unreadable.","correct":"✓ He re-encrypted the data, but it was still unreadable.","note":"If the data is unreadable, it might need re-encryption rather than recodification, which focuses on reorganization."}],"priority":"★★☆"},"related_words":{"derivatives":["recodification (noun): The act of recodifying.","code (noun): A system of laws or rules.","codify (verb): To arrange laws or rules into a systematic code."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"recodified\" is a technical term that means to revise and reorganize something that has already been codified, such as laws, regulations, or data. It implies a systematic restructuring or re-encoding to improve clarity, efficiency, or security. This term is typically used in legal, governmental, or technical contexts where formal systems are in place."},"example_sentences":[{"sentence":"The city council decided to recodify the zoning ordinances to promote sustainable development.","translation":"市議会は、持続可能な開発を促進するためにゾーニング条例を再編成することを決定した。","type":"verb","meaning_category":"再編成する"},{"sentence":"The software company recodified the encryption protocols to enhance data security.","translation":"ソフトウェア会社は、データセキュリティを強化するために暗号化プロトコルを再符号化した。","type":"verb","meaning_category":"再符号化する"}]}