{"word":"nidulariaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(菌類学において) スズカケタケ科に属する、またはスズカケタケ科に似た","english_definition":"(mycology) Belonging or pertaining to the Nidulariaceae, or resembling them.","examples":[{"sentence":"The nidulariaceous fungi are known for their bird's nest-like fruiting bodies.","translation":"スズカケタケ科の菌類は、鳥の巣のような子実体で知られています。"}],"collocations":["nidulariaceous fungi","nidulariaceous fruiting body"],"synonyms":["bird's nest fungi-like"],"antonyms":[]}],"etymology":{"value":"Derived from the family name 'Nidulariaceae' + '-ous' (suffix indicating belonging or resemblance). 'Nidulariaceae' comes from 'nidulus' (Latin for 'small nest') + '-aria' (suffix indicating a place or thing related to) + '-aceae' (standard suffix for plant families).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnaɪdjʊˌlɛəriˈeɪʃəs/","syllables":"ni-du-la-ri-a-ce-ous"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Nidulariaceous' is a specialized term used in mycology to describe fungi that belong to or resemble the family Nidulariaceae. These fungi are commonly known as bird's nest fungi because their fruiting bodies resemble tiny bird's nests containing egg-like structures called peridioles. The term is primarily used in scientific contexts and is not commonly encountered in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is nidulariaceous.","correct":"✓ The fungus is nidulariaceous.","note":"'Nidulariaceous' specifically refers to fungi, not plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["Nidulariaceae (noun: the bird's nest fungi family)","nidulus (noun: a small nest or nest-like structure)","peridiole (noun: the 'egg' in bird's nest fungi)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nidulariaceous' is a highly specialized term used in mycology, the study of fungi. It describes organisms that are part of, or similar to, the Nidulariaceae family, commonly known as bird's nest fungi. Understanding this term requires a background in biology or mycology. Due to its specialized nature, it is unlikely to be encountered outside of scientific contexts. The word is complex due to its length and multiple syllables, and the root words are derived from Latin, which may not be familiar to all readers."},"example_sentences":[{"sentence":"The mycologist identified the specimen as a nidulariaceous fungus based on its unique morphology.","translation":"菌学者は、その標本を独自の特徴からスズカケタケ科の菌類であると特定した。","type":"adjective","meaning_category":"(mycology) スズカケタケ科に属する、またはスズカケタケ科に似た"}]}