{"word":"cortisone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コルチゾン（副腎皮質ホルモンの一種で、炎症を抑える薬として使われる）","english_definition":"A steroid hormone produced by the adrenal cortex or made synthetically, used as an anti-inflammatory or immunosuppressant medication.","examples":[{"sentence":"The doctor prescribed cortisone for her arthritis.","translation":"医者は彼女の関節炎にコルチゾンを処方した。"},{"sentence":"Cortisone injections can provide temporary relief from pain.","translation":"コルチゾン注射は一時的に痛みを和らげることができる。"},{"sentence":"Long-term use of cortisone can have side effects.","translation":"コルチゾンの長期使用は副作用を引き起こす可能性がある。"}],"collocations":["cortisone cream (コルチゾンクリーム)","cortisone injection (コルチゾン注射)","cortisone side effects (コルチゾンの副作用)","prescribe cortisone (コルチゾンを処方する)","take cortisone (コルチゾンを服用する)"],"synonyms":["glucocorticoid","steroid","hydrocortisone"],"antonyms":[]}],"etymology":{"value":"Derived from 'cortex' (outer layer of an organ, specifically the adrenal gland) + '-one' (suffix denoting a ketone, a type of chemical compound) + '-isone' (variant of '-one').","priority":"★★★"},"pronunciation":{"ipa":"ˈkɔːrtɪzoʊn","syllables":"cor-ti-sone"},"inflection":{"noun_plural":"cortisones"},"usage_notes":{"explanation":"Cortisone is a type of corticosteroid, a class of steroid hormones. It is often used to reduce inflammation in various conditions such as arthritis, allergies, and skin problems. It can be administered topically (as a cream), orally (as a pill), or by injection. Long-term use can lead to side effects, so it's important to use it under medical supervision.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I took cortisone for my cold.","correct":"✓ I took decongestants for my cold. / ✓ I took cortisone for my inflammation.","note":"Cortisone is primarily used for inflammation, not for treating colds directly. Decongestants or other cold remedies are more appropriate for colds."},{"incorrect":"✗ Cortisone is a painkiller.","correct":"✓ Cortisone is an anti-inflammatory. / ✓ Cortisone can relieve pain by reducing inflammation.","note":"Cortisone reduces pain by reducing inflammation, but it's not a direct painkiller like acetaminophen or ibuprofen."}],"priority":"★★☆"},"related_words":{"derivatives":["corticosteroid (コルチコステロイド)","hydrocortisone (ヒドロコルチゾン)","prednisone (プレドニゾン)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cortisone' is a specialized term primarily used in medical contexts. It refers to a specific steroid hormone, often prescribed as an anti-inflammatory or immunosuppressant. Understanding its usage requires familiarity with medical terminology and concepts related to hormone function and treatment of inflammatory conditions. While not commonly used in everyday conversation, it is important in healthcare settings and medical literature."},"example_sentences":[{"sentence":"The doctor prescribed a **cortisone** cream to treat the eczema.","translation":"医者は湿疹を治療するためにコルチゾンクリームを処方した。","type":"noun","meaning_category":"medication"},{"sentence":"She received a **cortisone** injection in her knee to reduce the swelling.","translation":"彼女は腫れを抑えるために膝にコルチゾン注射を受けた。","type":"noun","meaning_category":"medication"},{"sentence":"The patient's symptoms improved after starting **cortisone** therapy.","translation":"患者の症状はコルチゾン療法を開始後、改善した。","type":"noun","meaning_category":"medication"}]}