{"word":"half-pike","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(体操・飛び込み) 半ひねり","english_definition":"(gymnastics, diving) A dive or gymnastic movement in which the body is bent at the waist with the legs straight, followed by a rotation of 180 degrees.","examples":[{"sentence":"She performed a beautiful half-pike on the balance beam.","translation":"彼女は平均台で美しい半ひねりを披露した。"},{"sentence":"The dive included a forward 2 1/2 somersault with a half-pike.","translation":"その飛び込みには、半ひねりを伴う前方2回半宙返りが含まれていた。"}],"collocations":["perform a half-pike","execute a half-pike","a difficult half-pike"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'half-pike' is derived from the 'pike' position in gymnastics and diving, where the body is bent at the hips with legs straight. The 'half' refers to the 180-degree rotation performed during the movement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæf ˈpaɪk/","syllables":"half-pike"},"inflection":{"noun_plural":"half-pikes"},"usage_notes":{"explanation":"A 'half-pike' is a specific type of gymnastic or diving maneuver. It's characterized by the body being bent at the waist (pike position) and a 180-degree rotation. The difficulty of the half-pike depends on the other elements combined with it, such as somersaults.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a pike-half.","correct":"✓ He did a half-pike.","note":"The correct term is 'half-pike,' not 'pike-half.'"},{"incorrect":"✗ She performed a full pike instead of a half-pike.","correct":"✓ She performed a pike instead of a half-pike.","note":"'Full pike' is not a standard term. It is simply referred to as a 'pike'."}],"priority":"★★☆"},"related_words":{"derivatives":["pike (noun: the body position in gymnastics or diving where the body is bent at the hips with legs straight)","somersault (noun: an acrobatic movement in which one turns head over heels in the air or on the ground and lands on one's feet)","dive (noun: the act of plunging into water, typically head first)","gymnastics (noun: a sport involving exercises intended to display strength and balance)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'half-pike' is a specialized term primarily used in the context of gymnastics and diving. It refers to a specific maneuver involving a pike position (body bent at the waist with straight legs) combined with a 180-degree rotation. Understanding this term requires familiarity with gymnastics or diving terminology. It is not commonly used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The gymnast flawlessly executed a double back somersault with a **half-pike**.","translation":"その体操選手は完璧に半ひねりを伴う2回後方宙返りをやってのけた。","type":"noun","meaning_category":"gymnastics"},{"sentence":"The diver scored high marks for her inward dive with a **half-pike**.","translation":"その飛び込み選手は、半ひねりを伴う内向き飛び込みで高得点を獲得した。","type":"noun","meaning_category":"diving"}]}