{"word":"non-self-healing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自己修復しない、自己治癒しない","english_definition":"Not capable of repairing or healing itself.","examples":[{"sentence":"The material is non-self-healing, so any damage requires manual repair.","translation":"その素材は自己修復しないため、損傷は手動で修理する必要があります。"},{"sentence":"Unlike some biological systems, this artificial structure is non-self-healing.","translation":"いくつかの生物学的システムとは異なり、この人工構造は自己治癒しません。"}],"collocations":["non-self-healing material","non-self-healing polymer","non-self-healing coating"],"synonyms":["non-repairing","non-regenerative"],"antonyms":["self-healing","self-repairing","regenerative"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the compound word 'self-healing'. 'Self-healing' refers to the ability of a material or system to repair damage to itself without external intervention.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn self ˈhiːlɪŋ/","syllables":"non-self-heal-ing"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-self-healing' is typically used to describe materials, systems, or structures that lack the inherent ability to repair damage or degradation automatically. It is often used in contrast to 'self-healing' materials, which are designed to autonomously repair damage. The term is common in materials science, engineering, and biology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non self healing car needed to be towed.","correct":"✓ The non-self-healing car needed to be towed.","note":"The hyphen is important for clarity. Without it, it can be confusing to read."}],"priority":"★★☆"},"related_words":{"derivatives":["self-healing","healing"],"related_terms":["repair","regeneration","damage","material science","engineering","biology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-self-healing' is a technical term used to describe something that cannot repair itself. It's the opposite of 'self-healing'. You'll usually find it in scientific or engineering contexts when talking about materials or systems that don't have the ability to fix damage automatically. For example, a 'non-self-healing' plastic would need to be manually repaired if it cracks, unlike a 'self-healing' plastic that could fix the crack on its own.","priority":"★★☆"},"example_sentences":[{"sentence":"This type of plastic is non-self-healing and will require replacement if damaged.","translation":"このタイプのプラスチックは自己修復性がないため、損傷した場合は交換が必要です。","type":"adjective","meaning_category":"Material property"},{"sentence":"The non-self-healing nature of the concrete led to rapid deterioration of the bridge.","translation":"そのコンクリートの自己修復性の欠如が、橋の急速な劣化につながりました。","type":"adjective","meaning_category":"Structural failure"}]}