{"word":"stearate","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ステアリン酸塩","english_definition":"A salt or ester of stearic acid.","examples":[{"sentence":"Magnesium stearate is commonly used as a lubricant in pharmaceutical manufacturing.","translation":"ステアリン酸マグネシウムは、医薬品製造において潤滑剤として一般的に使用される。"},{"sentence":"Zinc stearate is used as a release agent in the plastics industry.","translation":"ステアリン酸亜鉛は、プラスチック産業において剥離剤として使用される。"}],"collocations":["magnesium stearate","zinc stearate","calcium stearate","sodium stearate"],"synonyms":["octadecanoate"],"antonyms":[]}],"etymology":{"value":"From stearic acid + -ate (suffix indicating a salt or ester). Stearic acid is derived from the Greek word 'stear' meaning tallow or hard fat.","priority":"★★☆"},"pronunciation":{"ipa":"ˈstiːəreɪt","syllables":"stee-a-rate"},"inflection":{"noun_plural":"stearates"},"usage_notes":{"explanation":"Stearates are salts or esters of stearic acid, a saturated fatty acid. They are commonly used in various industries, including pharmaceuticals, cosmetics, plastics, and rubber, as lubricants, release agents, stabilizers, or thickeners. The specific properties and applications of a stearate depend on the cation (metal ion) or alkyl group attached to the stearate anion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ stearit","correct":"✓ stearate","note":"The correct spelling is 'stearate', not 'stearit'."}],"priority":"★★☆"},"related_words":{"derivatives":["stearic acid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stearate' refers to a chemical compound, specifically a salt or ester of stearic acid. Stearic acid is a saturated fatty acid commonly found in animal and vegetable fats. Stearates are used in various industrial applications due to their lubricating, stabilizing, and thickening properties. Understanding the term requires a basic knowledge of chemistry and the ability to comprehend technical contexts related to manufacturing and material science."},"example_sentences":[{"sentence":"The formulation contained a high percentage of magnesium **stearate**.","translation":"その製剤は高パーセントのステアリン酸マグネシウムを含んでいた。","type":"noun","meaning_category":"ステアリン酸塩"},{"sentence":"Calcium **stearate** is often added to plastics to improve their processing characteristics.","translation":"ステアリン酸カルシウムは、プラスチックの加工特性を改善するためにしばしば添加される。","type":"noun","meaning_category":"ステアリン酸塩"}]}