{"word":"xanthomatosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"黄色腫症（おうしょくしゅしょう）","english_definition":"A condition characterized by the presence of xanthomas (yellowish nodules or plaques consisting of lipid-laden histiocytes) in the skin and other tissues.","examples":[{"sentence":"Xanthomatosis can be associated with hyperlipidemia.","translation":"黄色腫症は高脂血症と関連していることがある。"},{"sentence":"Treatment for xanthomatosis often involves managing the underlying lipid disorder.","translation":"黄色腫症の治療は、しばしば基礎にある脂質異常症の管理を伴う。"}],"collocations":["xanthomatosis cerebrotendinea (脳腱黄色腫症)","eruptive xanthomatosis (発疹性黄色腫症)","tendon xanthomatosis (腱黄色腫症)"],"synonyms":["xanthoma","lipid deposition disease"],"antonyms":[]}],"etymology":{"value":"From 'xanthoma' (Greek 'xanthos' meaning yellow + '-oma' meaning tumor) + '-osis' (denoting a condition or disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzænθoʊməˈtoʊsɪs/","syllables":"zan-tho-ma-to-sis"},"inflection":{"noun_plural":"xanthomatoses"},"usage_notes":{"explanation":"Xanthomatosis refers to a condition where xanthomas are present in multiple locations throughout the body. It is often associated with underlying metabolic disorders, particularly those affecting lipid metabolism. Diagnosis typically involves clinical examination, lipid profile testing, and sometimes biopsy of the xanthomas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Xanthomatosis is a type of xanthoma.","correct":"✓ Xanthomatosis is a condition characterized by multiple xanthomas.","note":"Xanthoma is a single lesion, while xanthomatosis is a condition with multiple lesions."}],"priority":"★★☆"},"related_words":{"derivatives":["xanthoma (黄色腫)","xanthomatous (黄色腫性の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Xanthomatosis' is a highly specialized medical term referring to a condition characterized by multiple xanthomas. Understanding this term requires a strong background in biology and medicine, specifically knowledge of lipid metabolism and dermatology. It is not typically encountered outside of medical contexts."},"example_sentences":[{"sentence":"The patient presented with widespread xanthomatosis, indicating a severe lipid metabolism disorder.","translation":"患者は広範囲にわたる黄色腫症を呈しており、重度の脂質代謝異常を示唆していた。","type":"general","meaning_category":"general"},{"sentence":"Familial hypercholesterolemia is a common cause of xanthomatosis.","translation":"家族性高コレステロール血症は黄色腫症の一般的な原因である。","type":"cause","meaning_category":"cause"},{"sentence":"Treatment of xanthomatosis focuses on managing the underlying hyperlipidemia through diet and medication.","translation":"黄色腫症の治療は、食事療法と薬物療法による基礎にある高脂血症の管理に焦点を当てる。","type":"treatment","meaning_category":"treatment"}]}