{"word":"technology-addicted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"テクノロジー中毒の、技術依存症の","english_definition":"Habitually engrossed in or dependent on technology, especially digital technology such as computers, smartphones, and the internet.","examples":[{"sentence":"Many teenagers are technology-addicted and spend hours on social media.","translation":"多くのティーンエイジャーはテクノロジー中毒で、何時間もソーシャルメディアに費やしています。"},{"sentence":"He realized he was becoming technology-addicted when he couldn't go an hour without checking his phone.","translation":"彼は、1時間も携帯電話をチェックせずにいられなくなったとき、自分がテクノロジー中毒になりつつあることに気づきました。"},{"sentence":"The article discusses the negative effects of being technology-addicted on mental health.","translation":"その記事は、テクノロジー中毒が精神衛生に及ぼす悪影響について論じています。"}],"collocations":["technology-addicted youth (テクノロジー中毒の若者)","technology-addicted society (テクノロジー中毒の社会)","become technology-addicted (テクノロジー中毒になる)","being technology-addicted (テクノロジー中毒であること)"],"synonyms":["internet-addicted","screen-addicted","digitally dependent","online-obsessed","tech-obsessed"],"antonyms":["technology-averse","uninterested in technology","detached from technology","analog-oriented","offline"],"related_terms":["digital addiction","internet addiction","screen time","nomophobia","digital detox"]}],"etymology":{"value":"The term is a compound word formed by combining \"technology\" and \"addicted.\" It reflects the growing concern about excessive use of technology and its addictive qualities.","priority":"★★☆"},"pronunciation":{"ipa":"/tɛkˈnɒlədʒi əˈdɪktɪd/","syllables":"tek-nol-o-gy a-dik-tid"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Technology-addicted\" is used to describe individuals or groups who exhibit compulsive behavior related to technology use. It often implies a negative impact on their lives, such as neglecting responsibilities, social isolation, or mental health issues. The term is commonly used in discussions about the effects of technology on society and individual well-being.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is addicted to technology.","correct":"✓ He is technology-addicted.","note":"While \"addicted to technology\" is understandable, \"technology-addicted\" is a more concise and commonly used adjective. However, both are acceptable. "},{"incorrect":"✗ The technology-addicted is a growing problem.","correct":"✓ Technology addiction is a growing problem. / ✓ Technology-addicted behavior is a growing problem.","note":"\"Technology-addicted\" is an adjective and needs to modify a noun. To refer to the state of being addicted, use \"technology addiction\"."}],"priority":"★★☆"},"related_words":{"derivatives":["addiction","addicted","technology","technological"],"related_terms":["digital native","digital immigrant","digital literacy","internet addiction disorder","problematic internet use","digital detox"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent, becoming more common in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"technology-addicted\" is relatively straightforward, combining the common words \"technology\" and \"addicted.\" Understanding requires familiarity with the concept of addiction and the increasing prevalence of technology in modern life. It is often used in discussions about the negative impacts of excessive technology use.","priority":"★★★"},"example_sentences":[{"sentence":"The study found that technology-addicted students had lower academic performance.","translation":"その研究では、テクノロジー中毒の学生は学業成績が低いことがわかりました。","type":"adjective","meaning_category":"General"},{"sentence":"Parents are concerned about their children becoming technology-addicted at a young age.","translation":"親たちは、子供たちが幼い頃からテクノロジー中毒になることを懸念しています。","type":"adjective","meaning_category":"General"},{"sentence":"Therapy can help individuals overcome technology-addicted behaviors.","translation":"セラピーは、個人がテクノロジー中毒の行動を克服するのに役立ちます。","type":"adjective","meaning_category":"General"}]}