{"word":"nonsegregation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非分離、人種隔離の撤廃","english_definition":"The policy or practice of not segregating people, especially on the basis of race.","examples":[{"sentence":"The school board voted in favor of nonsegregation.","translation":"教育委員会は非分離に賛成票を投じた。"},{"sentence":"Nonsegregation is essential for a fair and just society.","translation":"非分離は公正で正義のある社会にとって不可欠である。"}],"collocations":["promote nonsegregation","achieve nonsegregation","enforce nonsegregation"],"synonyms":["integration","desegregation","inclusion"],"antonyms":["segregation","separation","discrimination"]}],"etymology":{"value":"\"non-\" (否定接頭辞) + \"segregation\" (分離、隔離)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌseɡrɪˈɡeɪʃən/","syllables":"non-seg-re-ga-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Nonsegregation\" is primarily used in the context of racial or ethnic integration, particularly in education and housing. It emphasizes the active dismantling of systems and practices that separate people based on race or other protected characteristics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonsegregation of water.","correct":"✓ The desegregation of water fountains.","note":"While 'nonsegregation' can technically apply to any form of separation, it's most commonly used in the context of race or ethnicity. If referring to something else, 'desegregation' or a more specific term might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsegregated (adjective)"],"related_terms":["desegregation","integration","segregation","affirmative action"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Nonsegregation' refers to the absence or removal of segregation, particularly racial segregation. It's a term often used in discussions about civil rights and social justice, emphasizing the importance of integrating different groups of people rather than keeping them separate. Understanding this term is crucial for comprehending historical and contemporary issues related to equality and discrimination."},"example_sentences":[{"sentence":"The Civil Rights Act of 1964 mandated nonsegregation in public accommodations.","translation":"1964年の公民権法は公共施設における非分離を義務付けた。","type":"general","meaning_category":"policy"},{"sentence":"The community actively worked towards nonsegregation by promoting diverse housing options.","translation":"地域社会は多様な住宅オプションを推進することで、非分離に向けて積極的に取り組んだ。","type":"general","meaning_category":"practice"}]}