{"word":"Lycopodium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒカゲノカズラ属","english_definition":"A genus of creeping or trailing evergreen plants, with branching stems and small, scale-like leaves, belonging to the clubmoss family (Lycopodiaceae). Also refers to the fine, yellow, odorless, and tasteless powder-like spores produced by these plants.","examples":[{"sentence":"Lycopodium spores are highly flammable and were once used in fireworks and as a dusting powder for pills.","translation":"ヒカゲノカズラの胞子は非常に可燃性があり、かつては花火や錠剤の粉末として使用されていました。"},{"sentence":"The genus Lycopodium includes various species found in diverse habitats worldwide.","translation":"ヒカゲノカズラ属には、世界中の多様な生息地で見られるさまざまな種が含まれています。"}],"collocations":["Lycopodium clavatum","Lycopodium powder","Lycopodium spores"],"synonyms":["clubmoss","ground pine"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'lykos' (wolf) and 'podion' (little foot), referring to the appearance of the plant's branching stems resembling a wolf's paw.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlaɪkəˈpoʊdiəm/","syllables":"Ly-co-po-di-um"},"inflection":{"noun_plural":"Lycopodiums (less common, usually used when referring to different species or types)"},"usage_notes":{"explanation":"'Lycopodium' can refer to the plant genus itself or to the powder made from its spores. The powder is notable for its historical uses in pyrotechnics, medicine, and even as a fingerprint powder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used Lycopodium as a fertilizer for my garden.","correct":"✓ I used fertilizer for my garden.","note":"Lycopodium is not typically used as a fertilizer. It has other specialized uses."},{"incorrect":"✗ Lycopodium is a type of moss.","correct":"✓ Lycopodium is a clubmoss.","note":"Lycopodium is a clubmoss, not a true moss, although it may superficially resemble one."}],"priority":"★★☆"},"related_words":{"derivatives":["Lycopodiaceae (clubmoss family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (Specialized term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lycopodium' is a technical term primarily encountered in botany, pharmacy, or historical contexts related to pyrotechnics or medicine. Understanding its meaning requires familiarity with plant taxonomy or specialized knowledge of historical uses of plant-derived substances."},"example_sentences":[{"sentence":"The pharmacist used Lycopodium powder to prevent pills from sticking together.","translation":"薬剤師は、錠剤がくっつかないようにヒカゲノカズラの粉末を使用しました。","type":"noun","meaning_category":"ヒカゲノカズラ属 (胞子)"},{"sentence":"Lycopodium clavatum is a common species of clubmoss found in many temperate regions.","translation":"ミドリヒカゲノカズラは、多くの温帯地域で見られる一般的なヒカゲノカズラ属の種です。","type":"noun","meaning_category":"ヒカゲノカズラ属 (植物)"}]}