{"word":"ambivert","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"両向性格者、内向性と外交性の両方の特徴を持つ人","english_definition":"a person whose personality has a balance of extrovert and introvert features.","examples":[{"sentence":"As an ambivert, she enjoys both socializing and spending time alone.","translation":"両向性格者として、彼女は社交と一人で過ごす時間の両方を楽しんでいます。"},{"sentence":"Ambiverts are often good at adapting to different social situations.","translation":"両向性格者は、さまざまな社交的な状況に適応するのが得意なことが多いです。"},{"sentence":"Understanding that I'm an ambivert helps me manage my energy levels.","translation":"自分が両向性格者だと理解することで、エネルギーレベルを管理するのに役立ちます。"}],"collocations":["balanced personality","social adaptability","situational awareness","energy management"],"synonyms":["extroverted introvert","introverted extrovert","middle-of-the-road personality"],"antonyms":["extrovert","introvert"]},{"part_of_speech":"adjective","definition":"両向性格の、内向性と外交性の両方の特徴を持つ","english_definition":"having a personality that has a balance of extrovert and introvert features.","examples":[{"sentence":"He has an ambivert personality, enjoying both parties and quiet evenings.","translation":"彼は両向性格で、パーティーと静かな夜の両方を楽しんでいます。"},{"sentence":"Her ambivert nature makes her a great team leader.","translation":"彼女の両向性格な性質が、彼女を素晴らしいチームリーダーにしています。"}],"collocations":["ambivert personality","ambivert nature","ambivert tendencies"],"synonyms":["balanced","adaptable","versatile"],"antonyms":["extroverted","introverted"]}],"etymology":{"value":"A blend of 'ambi-' (meaning 'both') and 'vert' (from 'extrovert' and 'introvert'). Coined in the 1920s.","priority":"★★★"},"pronunciation":{"ipa":"ˈæmbɪvɜːrt","syllables":"am-bi-vert"},"inflection":{"noun_plural":"ambiverts","adjective_forms":{}},"usage_notes":{"explanation":"'Ambivert' describes someone who exhibits qualities of both extroverts and introverts. Unlike pure extroverts who thrive on social interaction or pure introverts who prefer solitude, ambiverts can adjust their behavior depending on the situation. They are comfortable in social settings but also value their alone time. This term is commonly used in psychology and self-help contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She is an ambivert, so she is always outgoing.","correct":"She is an ambivert, so she can be both outgoing and reserved depending on the situation.","note":"Ambiverts are not always outgoing; their behavior varies with the situation."},{"incorrect":"Ambivert is the same as being shy.","correct":"Ambivert is not the same as being shy; it's about having a balance of extroverted and introverted traits.","note":"Shyness is a separate trait from being an ambivert."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["extrovert","introvert","personality","psychology","social skills","temperament"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency compared to 'extrovert' and 'introvert'.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'ambivert' describes a person who has a mix of both extroverted and introverted qualities. This means they can enjoy being social like extroverts, but they also appreciate and need time alone like introverts. The term is often used in discussions about personality types and understanding how people interact with the world around them. It's less common than the words 'extrovert' and 'introvert' but is still a useful term for describing people who don't fit neatly into either category."},"example_sentences":[{"sentence":"Many people find that they are actually ambiverts, not strictly introverts or extroverts.","translation":"多くの人が、自分が厳密な内向型や外向型ではなく、実際には両向性格者であることに気づきます。","type":"general","meaning_category":"general"},{"sentence":"The best salespeople are often ambiverts because they can both listen and persuade effectively.","translation":"最高のセールスパーソンは、しばしば両向性格者です。なぜなら、彼らは効果的に聞き、説得することができるからです。","type":"example","meaning_category":"example"},{"sentence":"As an ambivert, she knew when to take charge and when to let others lead.","translation":"両向性格者として、彼女はいつ主導権を握り、いつ他の人に任せるかを知っていました。","type":"example","meaning_category":"example"}]}