{"word":"Musar","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教)倫理運動、倫理文学、倫理的教え","english_definition":"(Judaism) A Jewish ethical, educational, and cultural movement that developed in 19th-century Lithuania, particularly among Orthodox Lithuanian Jews. It emphasizes personal character development, ethical conduct, and spiritual growth. Also refers to the ethical literature and teachings associated with this movement.","examples":[{"sentence":"The rabbi's sermon focused on Musar principles of humility and compassion.","translation":"ラビの説教は、謙虚さと慈悲というムサールの原則に焦点を当てていた。"},{"sentence":"He studies Musar texts daily to improve his character.","translation":"彼は自分の性格を改善するために、毎日ムサールの文献を研究している。"},{"sentence":"The Musar movement seeks to cultivate ethical awareness and action.","translation":"ムサール運動は、倫理的な意識と行動を育むことを目指している。"}],"collocations":["Musar movement","Musar literature","Musar principles","study Musar","practice Musar"],"synonyms":["Jewish ethics","ethical teachings","moral improvement"],"antonyms":[]}],"etymology":{"value":"From Hebrew מוּסָר (musár), meaning \"moral instruction, discipline, reproof, correction\".","priority":"★★★"},"pronunciation":{"ipa":"/muːˈsɑːr/","syllables":"mu-sar"},"inflection":{"notes":"Singular noun. No plural form typically used."},"usage_notes":{"explanation":"'Musar' refers to a specific ethical and spiritual movement within Judaism, primarily associated with Lithuanian Orthodox Judaism. It's not simply a general term for Jewish ethics, but rather a particular approach to character development and moral improvement. The term also encompasses the literature and teachings associated with this movement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Musar is a type of Jewish holiday.","correct":"✓ Musar is a Jewish ethical movement.","note":"Musar is not a holiday, but an ethical movement."},{"incorrect":"✗ He is a Musar.","correct":"✓ He studies Musar. / ✓ He is involved in the Musar movement.","note":"'Musar' is not used to refer to a person, but rather the movement or its teachings. To describe a person, say they 'study Musar' or are 'involved in the Musar movement'."}],"priority":"★★☆"},"related_words":{"derivatives":["Mussar (alternative spelling)","Mussarist (a follower of the Musar movement)"],"phrases":["middot (character traits)","tikkun olam (repairing the world)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used within Jewish studies and related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Musar' is a specialized term within Judaism referring to a specific ethical and spiritual movement that originated in 19th-century Lithuania. It focuses on personal character development and ethical conduct through study and practice. The term also refers to the literature associated with this movement. Understanding this term requires familiarity with Jewish religious and cultural contexts."},"example_sentences":[{"sentence":"The Musar Institute offers courses on ethical development.","translation":"ムサール研究所は、倫理的発達に関するコースを提供しています。","type":"noun","meaning_category":"ethical movement"},{"sentence":"He found solace in the wisdom of Musar teachings.","translation":"彼はムサールの教えの知恵に慰めを見出した。","type":"noun","meaning_category":"ethical teachings"},{"sentence":"Her commitment to Musar principles guided her actions.","translation":"ムサールの原則への彼女の献身は、彼女の行動を導いた。","type":"noun","meaning_category":"ethical principles"}]}