{"word":"chivalrously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"騎士道的に、勇敢に、礼儀正しく、紳士的に","english_definition":"in a chivalrous manner; with gallantry, courtesy, and honor.","examples":[{"sentence":"He chivalrously offered her his seat on the bus.","translation":"彼は騎士道的にバスの中で彼女に席を譲った。"},{"sentence":"The knight chivalrously defended the honor of his queen.","translation":"騎士は騎士道的に女王の名誉を守った。"},{"sentence":"He acted chivalrously, helping her with her luggage.","translation":"彼は紳士的に彼女の荷物を手伝い、騎士道的に行動した。"}],"collocations":["act chivalrously","behave chivalrously","treat someone chivalrously","offer assistance chivalrously"],"synonyms":["gallantly","courteously","nobly","honorably","graciously","respectfully","gentlemanly","heroically"],"antonyms":["discourteously","rudely","ungraciously","dishonorably","unmannerly"]}],"etymology":{"value":"\"Chivalrously\" is derived from \"chivalrous,\" which comes from the Old French word \"chevalerie,\" meaning \"knighthood\" or \"chivalry.\" This, in turn, comes from \"chevalier,\" meaning \"knight,\" and ultimately from the Latin word \"caballus,\" meaning \"horse.\" The suffix \"-ly\" transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪvəlrəsli/","syllables":"shiv-al-rous-ly"},"inflection":{"notes":"Adverb; does not inflect."},"usage_notes":{"explanation":"\"Chivalrously\" describes actions performed with the qualities associated with chivalry, such as courage, courtesy, loyalty, and respect, especially towards women or those in need. It implies a traditional, sometimes idealized, code of conduct. The term can occasionally be seen as old-fashioned or even sexist in modern contexts, depending on how it is used, as it may reinforce traditional gender roles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He chivalrously helped her, it was a chivalry action.","correct":"✓ He chivalrously helped her; it was a chivalrous action.","note":"\"Chivalrously\" is an adverb, modifying the verb \"helped.\" \"Chivalrous\" is an adjective, describing the noun \"action.\""},{"incorrect":"✗ He acted chivalrously, but some considered it patronizing.","correct":"✓ He acted chivalrously, but some considered it patronizing.","note":"While chivalrous behavior is generally positive, in some modern contexts, it can be perceived as condescending or patronizing, especially if it reinforces traditional gender roles."}],"priority":"★★☆"},"related_words":{"derivatives":["chivalrous (adjective)","chivalry (noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"chivalrously\" is an adverb describing an action done in a way that shows qualities associated with chivalry, such as being polite, kind, and honorable, especially towards women. It's not a very common word in everyday conversation but might be found in literature or historical contexts. Understanding the word requires knowing the concept of \"chivalry,\" which is a code of conduct associated with knights in the Middle Ages."},"example_sentences":[{"sentence":"The gentleman chivalrously assisted the elderly woman across the street.","translation":"その紳士は騎士道的に、年配の女性が通りを渡るのを手伝った。","type":"example","meaning_category":"courteous assistance"},{"sentence":"He chivalrously defended her reputation against the false accusations.","translation":"彼は騎士道的に、彼女の評判を誤った告発から守った。","type":"example","meaning_category":"honorable defense"},{"sentence":"She appreciated how he chivalrously opened the door for her.","translation":"彼女は彼が騎士道的にドアを開けてくれたことに感謝した。","type":"example","meaning_category":"polite gesture"}]}