{"word":"program-related","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"プログラムに関連する、プログラムに関する","english_definition":"relating to a program (especially a computer program) or programs in general.","examples":[{"sentence":"We offer program-related training courses.","translation":"プログラム関連の研修コースを提供しています。"},{"sentence":"The company is seeking candidates with program-related experience.","translation":"その会社はプログラム関連の経験を持つ候補者を求めています。"},{"sentence":"These are program-related expenses.","translation":"これらはプログラム関連の費用です。"}],"collocations":["program-related training","program-related experience","program-related costs","program-related activities","program-related issues","program-related tasks","program-related skills"],"synonyms":["software-related","application-related","computer-related","coding-related","IT-related"],"antonyms":["unrelated","irrelevant","extraneous"]},{"part_of_speech":"adjective","definition":"(特に慈善活動において)プログラムの目的達成を支援する","english_definition":"(especially in philanthropy) supporting the achievement of a program's objectives.","examples":[{"sentence":"The foundation provides program-related investments to non-profit organizations.","translation":"その財団は、非営利団体にプログラム関連投資を提供しています。"},{"sentence":"These program-related grants are designed to promote education.","translation":"これらのプログラム関連助成金は、教育を促進するように設計されています。"},{"sentence":"They are looking for program-related opportunities to expand their impact.","translation":"彼らは、自分たちの影響力を拡大するためのプログラム関連の機会を探しています。"}],"collocations":["program-related investment (PRI)","program-related grant","program-related mission","program-related purpose","program-related activities","program-related expenses"],"synonyms":["mission-related","purpose-driven","impact-focused","socially responsible","philanthropic"],"antonyms":["non-mission-related","non-profit-related"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"program\" (referring to a plan, schedule, or set of instructions, especially in computing) and \"related\" (meaning connected or associated). The specific philanthropic sense likely arose from the desire to distinguish investments and activities that directly support a charitable organization's mission from purely financial investments.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊɡræm rɪˈleɪtɪd/","syllables":"pro-gram ri-la-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The adjective \"program-related\" is used to describe something that is connected to or associated with a program. The meaning can vary depending on the context. In a general sense, it refers to anything pertaining to a plan, schedule, or set of activities, often in the context of computer programs or software. In the context of philanthropy, it specifically refers to investments or activities that are directly aligned with and support the mission or objectives of a non-profit organization or charitable program.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program related cost was too high.","correct":"✓ The program-related cost was too high.","note":"Hyphenation is important to clarify that \"program\" and \"related\" are functioning as a single adjective modifying \"cost.\""},{"incorrect":"✗ This is a program related investment, not a donation.","correct":"✓ This is a program-related investment, not a donation.","note":"Hyphenation is important to clarify that \"program\" and \"related\" are functioning as a single adjective modifying \"investment.\""}],"priority":"★★☆"},"related_words":{"derivatives":["programmatically (adverb)","programming (noun, verb)","programmer (noun)"],"related_terms":["project-related","activity-related","mission-driven","impact investing","social enterprise"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in specific contexts (e.g., IT, philanthropy).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"program-related\" is typically used in professional or technical contexts. It means \"connected to a program,\" where \"program\" can refer to a computer program, a planned set of activities, or a specific initiative. In the context of non-profit organizations, it often describes investments or activities that directly support the organization's mission. Understanding the context is crucial for interpreting the meaning correctly. The hyphen is important to show that \"program\" and \"related\" work together as a single adjective."},"example_sentences":[{"sentence":"The company offers a wide range of program-related services.","translation":"その会社は幅広いプログラム関連のサービスを提供しています。","type":"adjective","meaning_category":"プログラムに関する"},{"sentence":"Program-related investments are a key part of the foundation's strategy.","translation":"プログラム関連投資は、その財団の戦略の重要な部分です。","type":"adjective","meaning_category":"プログラムの目的達成を支援する"},{"sentence":"Please submit all program-related documentation by Friday.","translation":"すべてのプログラム関連書類を金曜日までに提出してください。","type":"adjective","meaning_category":"プログラムに関する"},{"sentence":"The university offers several program-related scholarships.","translation":"その大学はいくつかのプログラム関連の奨学金を提供しています。","type":"adjective","meaning_category":"プログラムに関する"}]}