{"word":"Intersexes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"間性 (かんせい): 男女の典型的な生物学的特徴を両方とも持っていたり、どちらの特徴もはっきり持っていなかったりする状態の人々。","english_definition":"Individuals born with any of several variations in sex characteristics including chromosomes, gonads, sex hormones, or genitals that do not fit typical definitions for male or female.","examples":[{"sentence":"Intersexes face unique challenges related to identity and healthcare.","translation":"間性の人々は、アイデンティティや医療に関連して特有の課題に直面しています。"},{"sentence":"The term 'intersexes' is used to describe a wide range of conditions.","translation":"「間性」という用語は、広範囲の状態を説明するために使用されます。"}],"collocations":["intersex condition","intersex rights","intersex awareness"],"synonyms":["Differences of sex development (DSD)"],"antonyms":[],"notes":"'Intersexes' is the plural form of 'intersex'. It is important to use respectful and accurate language when discussing intersex individuals."}],"etymology":{"value":"The term 'intersex' comes from the Latin 'inter' (between) and 'sexus' (sex), indicating a condition between the typical definitions of male and female.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪntərˌsɛksɪz/","syllables":"In-ter-sex-es"},"inflection":{"noun_plural":"Intersexes"},"usage_notes":{"explanation":"'Intersexes' is the plural form of 'intersex', referring to individuals born with sex characteristics that do not fit typical binary notions of male or female. It is crucial to use respectful language and avoid outdated or offensive terms. Many intersex individuals prefer identity-first language (e.g., 'intersex person' rather than 'person with intersex').","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intersex is a rare condition.","correct":"✓ Intersex is a rare condition. / ✓ Intersex variations are rare.","note":"'Intersex' is an adjective and a noun referring to a state or condition, not a person. Use 'intersex person' or 'intersex individual' to refer to a person. 'Intersexes' is the plural form, referring to multiple intersex individuals or conditions."},{"incorrect":"✗ He/She is an intersex.","correct":"✓ He/She is an intersex person.","note":"Avoid using 'intersex' as a standalone noun to refer to a person. Use 'intersex person' or 'intersex individual' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["intersex (adjective, noun)","intersexuality (noun)"],"related_terms":["DSD (Differences of Sex Development)","gender identity","sexual orientation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intersexes' refers to individuals born with sex characteristics that do not fit typical binary definitions of male or female. This term is often used in medical, sociological, and human rights contexts. Understanding and using this term respectfully is important in discussions about diversity and inclusion. It's crucial to remember that 'intersex' refers to a range of natural variations and not a disorder or disease."},"example_sentences":[{"sentence":"Many **intersexes** advocate for their rights to bodily autonomy and self-determination.","translation":"多くの間性の人々は、身体の自律性と自己決定の権利を主張しています。","type":"noun","meaning_category":"間性の人々"},{"sentence":"Research on **intersexes** helps to broaden our understanding of human biological diversity.","translation":"間性に関する研究は、人間の生物学的多様性に対する理解を深めるのに役立ちます。","type":"noun","meaning_category":"間性に関する研究"}]}