{"word":"well-banked","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a curve or track) having a steep slope on the inside edge to allow vehicles to maintain speed and stability while turning.","english_definition":"(of a curve or track) having a steep slope on the inside edge to allow vehicles to maintain speed and stability while turning.","examples":[{"sentence":"The speedway featured a well-banked oval track.","translation":"そのスピードウェイは、内側の縁が急な傾斜を持つ、よくバンクされた楕円形のトラックを特徴としていた。"},{"sentence":"The cyclists appreciated the well-banked turns on the velodrome.","translation":"自転車競技選手たちは、ベロドロームのよくバンクされたターンを高く評価した。"}],"collocations":["well-banked curve","well-banked track","well-banked turn"],"synonyms":["banked","sloped","inclined"],"antonyms":["flat","level"]}],"etymology":{"value":"The term 'well-banked' is a compound adjective formed by combining the adverb 'well' and the past participle 'banked'. 'Banked' refers to the slope or inclination of a curve or track, particularly in racing contexts. The addition of 'well' indicates that the banking is done effectively or to a high degree.","priority":"N/A"},"pronunciation":{"ipa":"/ˌwel ˈbæŋkt/","syllables":"well-banked"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Well-banked' is typically used to describe curves or tracks in racing venues (such as speedways, velodromes, or bobsled tracks) where the banking is significant enough to aid vehicles or participants in maintaining speed and stability. The term implies that the banking is properly designed and constructed for optimal performance.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The track was good-banked.","correct":"✓ The track was well-banked.","note":"The correct adverb to use is 'well,' not 'good,' to indicate a high degree of banking."}],"priority":"N/A"},"related_words":{"derivatives":["banking (noun: the degree of slope or inclination)"],"phrasal_verbs":[],"related_terms":["bank (verb: to slope or incline)","track","curve","speedway","velodrome"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized term primarily used in racing or engineering contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'well-banked' is a specialized term typically used in the context of racing or engineering. It describes a curve or track that has a significant slope on the inside edge, which helps vehicles or participants maintain speed and stability while turning. This term is more commonly encountered in technical discussions or descriptions of racing venues."},"example_sentences":[{"sentence":"The newly constructed racetrack boasted several well-banked turns.","translation":"新しく建設された競馬場は、いくつかのよくバンクされたターンを誇っていた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The well-banked curves allowed the bobsled to reach incredible speeds.","translation":"よくバンクされたカーブにより、ボブスレーは信じられないほどの速度に達することができた。","type":"adjective","meaning_category":"Descriptive"}]}