{"word":"Desmodontidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"吸血コウモリ科","english_definition":"A family of bats containing the vampire bats.","examples":[{"sentence":"Desmodontidae are only found in the Americas.","translation":"吸血コウモリ科はアメリカ大陸にのみ生息する。"},{"sentence":"The Desmodontidae family includes three species of vampire bats.","translation":"吸血コウモリ科には3種類の吸血コウモリが含まれる。"}],"collocations":[],"synonyms":["vampire bats"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Desmodus, combined with the suffix '-idae' which is used to denote a zoological family. Desmodus comes from the Greek words 'desmos' (bond, chain) and 'odous' (tooth), referring to the fused teeth of these bats.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛzmɒnˈtɪdɪ/","syllables":"Des-mo-don-ti-dae"},"inflection":{"noun_plural":"Desmodontids or Desmodontidae"},"usage_notes":{"explanation":"'Desmodontidae' is a scientific term used in zoology and biology to classify a specific family of bats. It is primarily used in academic or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Desmodus (genus)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Desmodontidae' is a technical term used in the scientific classification of animals, specifically referring to the family of vampire bats. It is not commonly used outside of scientific or academic contexts. Understanding this term requires knowledge of biological taxonomy.","priority":"★★☆"},"example_sentences":[{"sentence":"Research on the saliva of Desmodontidae has revealed unique anticoagulant properties.","translation":"吸血コウモリ科の唾液の研究により、独特の抗凝固特性が明らかになった。","type":"scientific","meaning_category":"classification"},{"sentence":"The evolutionary adaptations of Desmodontidae are a fascinating subject for biologists.","translation":"吸血コウモリ科の進化的適応は、生物学者にとって魅力的なテーマである。","type":"scientific","meaning_category":"evolution"}]}