{"word":"weight-influenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"体重によって影響を受ける、体重が影響を与える","english_definition":"Affected or influenced by weight; relating to the impact or effect of weight.","examples":[{"sentence":"The study examined weight-influenced health conditions such as diabetes and heart disease.","translation":"その研究では、糖尿病や心臓病など、体重が影響する健康状態を調査した。"},{"sentence":"The design of the bridge considered weight-influenced stress on the structure.","translation":"橋の設計では、重量が構造に与える影響を考慮した。"},{"sentence":"This is a weight-influenced decision; we need to consider the load capacity.","translation":"これは重量が影響する決定です。積載量を考慮する必要があります。"}],"collocations":["weight-influenced health","weight-influenced design","weight-influenced decision","weight-influenced stress","weight-influenced factor"],"synonyms":["weight-dependent","weight-related","weight-sensitive"],"antonyms":["weight-independent","weight-neutral"]}],"etymology":{"value":"A compound word formed by combining 'weight' (the measure of heaviness) and 'influenced' (affected by something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈweɪt ˌɪnfluənst/","syllables":"weight-in-flu-enced"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more weight-influenced, most weight-influenced)."},"usage_notes":{"explanation":"'Weight-influenced' is a descriptive term used to indicate that something is affected or determined by weight. It can refer to physical effects, health conditions, or decisions where weight is a significant factor. It is often used in technical or scientific contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The weight influenced the decision.","correct":"✓ The decision was weight-influenced.","note":"'Weight influenced' is a verb phrase, while 'weight-influenced' is an adjective. Use the hyphenated form to describe something that is affected by weight."}],"priority":"N/A"},"related_words":{"derivatives":["influence (noun, verb)","weight (noun)"],"phrasal_verbs":[],"related_terms":["weight-bearing","weight distribution","weight management"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly found in general conversation. More likely in technical or scientific writing.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Weight-influenced' is a technical term indicating that something is affected or determined by weight. It is typically used in scientific, engineering, or health-related contexts. Understanding the term requires knowledge of both 'weight' and 'influence' and how they combine to describe a specific relationship."},"example_sentences":[{"sentence":"The stability of the structure is highly weight-influenced.","translation":"構造の安定性は重量に大きく影響される。","type":"adjective","meaning_category":"affected by weight"},{"sentence":"We need to analyze the weight-influenced variables in the experiment.","translation":"実験における重量の影響を受ける変数を分析する必要がある。","type":"adjective","meaning_category":"affected by weight"},{"sentence":"The doctor discussed weight-influenced risk factors for cardiovascular disease.","translation":"医師は、心血管疾患の重量の影響を受ける危険因子について話し合った。","type":"adjective","meaning_category":"affected by weight"}]}