{"word":"paragonimiasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"肺吸虫症（はいきゅうちゅうしょう）","english_definition":"A parasitic disease caused by lung flukes of the genus Paragonimus.","examples":[{"sentence":"Paragonimiasis is acquired by eating raw or undercooked crustaceans.","translation":"肺吸虫症は、生または加熱不十分な甲殻類を食べることによって感染します。"},{"sentence":"Symptoms of paragonimiasis include cough, chest pain, and difficulty breathing.","translation":"肺吸虫症の症状には、咳、胸痛、呼吸困難などがあります。"}],"collocations":["pulmonary paragonimiasis (肺肺吸虫症)","cerebral paragonimiasis (脳肺吸虫症)","abdominal paragonimiasis (腹部肺吸虫症)"],"synonyms":["lung fluke infection","pulmonary distomiasis"],"antonyms":[]}],"etymology":{"value":"The word 'paragonimiasis' comes from the genus name of the lung fluke, 'Paragonimus', and the suffix '-iasis', which indicates a disease or condition.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpærəɡəˈnɪmaɪəsɪs/","syllables":"par-a-gon-i-mi-a-sis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Paragonimiasis is a foodborne parasitic infection. Diagnosis is typically made by identifying Paragonimus eggs in sputum or stool samples. Treatment usually involves medication such as praziquantel. Prevention focuses on properly cooking crustaceans before consumption.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Paragonimiasis is caused by a bacteria.","correct":"✓ Paragonimiasis is caused by a parasite.","note":"Paragonimiasis is caused by a parasitic worm (lung fluke), not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["Paragonimus (属名)","fluke (吸虫)","parasite (寄生虫)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Paragonimiasis is a relatively rare parasitic disease, primarily found in certain regions of the world where raw or undercooked crustaceans are consumed. Understanding the disease involves knowledge of parasitology, epidemiology, and clinical medicine. The term itself is complex and not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient was diagnosed with paragonimiasis after presenting with chronic cough and hemoptysis.","translation":"患者は慢性の咳と喀血を呈した後、肺吸虫症と診断されました。","type":"medical","meaning_category":"disease"},{"sentence":"Control measures for paragonimiasis include health education and improved sanitation.","translation":"肺吸虫症の対策には、健康教育と衛生状態の改善が含まれます。","type":"public health","meaning_category":"prevention"}]}