{"word":"quasi-willingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ほとんど自発的に、半ば自発的に、不承不承","english_definition":"In a manner that is somewhat willing; not entirely unwilling but not fully enthusiastic.","examples":[{"sentence":"He quasi-willingly agreed to help, knowing he couldn't refuse without causing trouble.","translation":"彼は面倒を起こさずに断ることができないとわかっていたので、ほとんど自発的に手伝うことに同意した。"},{"sentence":"She quasi-willingly participated in the activity, though she would have preferred to do something else.","translation":"彼女は他のことをしたいと思っていたが、ほとんど自発的にその活動に参加した。"}],"collocations":["agree quasi-willingly","participate quasi-willingly","accept quasi-willingly"],"synonyms":["reluctantly","halfheartedly","grudgingly","unenthusiastically","partially willingly"],"antonyms":["willingly","enthusiastically","readily","eagerly"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning resembling, seeming, partially) with \"willingly\" (meaning in a willing manner; voluntarily).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈwɪlɪŋli/","syllables":"quasi-wil-ling-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"\"Quasi-willingly\" describes an action done with some degree of willingness, but without full enthusiasm or a genuine desire. It implies a sense of obligation, pressure, or a lack of better options. The action is not forced, but it is also not freely chosen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He quasi willingly helped.","correct":"✓ He quasi-willingly helped.","note":"The hyphen is important to connect \"quasi-\" to \"willingly\" and create a single adverb. Without the hyphen, the sentence is grammatically incorrect."},{"incorrect":"✗ She acted quasi willingly.","correct":"✓ She acted quasi-willingly.","note":"\"Quasi-willingly\" is an adverb and should modify the verb directly, not the adjective \"willing.\""}],"priority":"★★☆"},"related_words":{"derivatives":["quasi- (prefix meaning resembling, seeming, partially)","willingly (adverb: in a willing manner; voluntarily)","willing (adjective: ready, eager, or prepared to do something)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"quasi-willingly\" is a relatively uncommon adverb that describes an action performed with some degree of willingness, but without full enthusiasm or genuine desire. It suggests a sense of obligation or a lack of better alternatives. The prefix \"quasi-\" indicates that the willingness is partial or resembling willingness, but not entirely genuine."},"example_sentences":[{"sentence":"The employee quasi-willingly accepted the extra workload, fearing repercussions if he refused.","translation":"その従業員は、拒否すれば報復があることを恐れて、ほとんど自発的に追加の仕事量を受け入れた。","type":"adverb","meaning_category":"不承不承"},{"sentence":"She quasi-willingly agreed to attend the party, even though she was tired.","translation":"彼女は疲れていたが、ほとんど自発的にパーティーに出席することに同意した。","type":"adverb","meaning_category":"半ば自発的に"}]}