{"word":"ellipsis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"省略、語句省略","english_definition":"The omission from speech or writing of a word or words that are superfluous or able to be understood from contextual clues.","examples":[{"sentence":"The phrase 'You understand' is an ellipsis of 'Do you understand?'","translation":"「You understand」という句は、「Do you understand?」の省略形です。"},{"sentence":"In the sentence 'Some people went to the beach; others to the mountains,' there is an ellipsis of 'went'.","translation":"「Some people went to the beach; others to the mountains」という文では、「went」が省略されています。"}],"collocations":["grammatical ellipsis","situational ellipsis","ellipsis mark","ellipsis points"],"synonyms":["omission","truncation","abbreviation","condensation"],"antonyms":["repetition","redundancy","tautology"]},{"part_of_speech":"noun","definition":"省略記号、三点リーダー (…)","english_definition":"A series of dots, usually three, indicating an omission of words or a pause.","examples":[{"sentence":"Use an ellipsis to show that some words have been left out of the quotation.","translation":"引用からいくつかの単語が省略されていることを示すには、省略記号を使用します。"},{"sentence":"The speaker paused, using an ellipsis to create suspense.","translation":"講演者は一時停止し、省略記号を使用してサスペンスを作り出しました。"},{"sentence":"The sentence ended with an ellipsis, suggesting that the thought was not complete.","translation":"文は省略記号で終わり、思考が完全ではないことを示唆していました。"}],"collocations":["three dots","dot-dot-dot","suspension points","ellipsis points","horizontal ellipsis","vertical ellipsis"],"synonyms":["suspension points","dot-dot-dot","three dots"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἔλλειψις (élleipsis, “a falling short, defect, omission”), from ἐλλείπω (elleípō, “I fall short, I leave out”).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɪpsɪs/","syllables":"el-lip-sis"},"inflection":{"noun_plural":"ellipses"},"usage_notes":{"explanation":"The term 'ellipsis' has two main meanings: the omission of words from a sentence, and the punctuation mark used to indicate such an omission. In the first sense, it refers to a grammatical structure where words are left out because they are either unnecessary or can be inferred from the context. In the second sense, it refers to the symbol '...' used to show that something has been omitted or that there is a pause or trailing off in speech or writing. The plural of 'ellipsis' is 'ellipses'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I use ellipse to show omission.","correct":"✓ I use an ellipsis to show omission.","note":"'Ellipsis' is a countable noun, so it needs an article ('a' or 'the') when referring to a single instance."},{"incorrect":"✗ The ellipses show that the sentence is complete.","correct":"✓ The ellipsis shows that the sentence is incomplete.","note":"Ellipses indicate that something is missing or incomplete, not that it is complete."},{"incorrect":"✗ The ellipse are used for omission.","correct":"✓ The ellipses are used for omission.","note":"When referring to multiple instances, use the plural form 'ellipses'."}],"priority":"★★☆"},"related_words":{"derivatives":["elliptical (adjective)","elliptically (adverb)"],"phrases":["suspension points","dot-dot-dot"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ellipsis' refers to the omission of words from a sentence that are understood from the context, or to the punctuation mark '...' used to indicate this omission or a pause. It's more common in formal writing and discussions about grammar. The plural is 'ellipses'. Understanding this term is helpful for analyzing complex texts and understanding writing conventions.","priority":"★★☆"},"example_sentences":[{"sentence":"The full sentence was, 'If you are ready, I am ready,' but I used an ellipsis and wrote, 'If you are..., I am ready.'","translation":"完全な文は「もしあなたが準備ができているなら、私も準備ができている」でしたが、省略記号を使って「もしあなたが…、私も準備ができている」と書きました。","type":"noun","meaning_category":"omission"},{"sentence":"The speaker trailed off with an ellipsis, leaving the audience to wonder what he meant.","translation":"講演者は省略記号で言葉を濁し、聴衆は何を意味するのか疑問に思いました。","type":"noun","meaning_category":"omission mark"},{"sentence":"Grammatical ellipsis is common in informal speech.","translation":"文法的な省略は、くだけた会話でよく見られます。","type":"noun","meaning_category":"omission"},{"sentence":"The use of ellipses can create a sense of mystery or incompleteness.","translation":"省略記号の使用は、神秘感や不完全さを生み出す可能性があります。","type":"noun","meaning_category":"omission mark"}]}