{"word":"Emmetropy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正視、正視眼","english_definition":"The state of having no refractive error in the eye; normal vision where parallel rays of light are focused sharply on the retina without accommodation.","examples":[{"sentence":"Emmetropy is the ideal refractive state of the eye.","translation":"正視は目の理想的な屈折状態です。"},{"sentence":"Individuals with emmetropy do not require corrective lenses.","translation":"正視眼の人は矯正レンズを必要としません。"}],"collocations":["achieve emmetropy","maintain emmetropy","emmetropic eye"],"synonyms":["normal vision","perfect vision","20/20 vision (informal)"],"antonyms":["myopia (近視)","hyperopia (遠視)","astigmatism (乱視)"]}],"etymology":{"value":"Derived from Greek 'emmetros' (well-measured, proportionate) + 'ops' (eye).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛməˈtroʊpi/","syllables":"em-me-tro-py"},"inflection":{"noun_plural":"emmetropies"},"usage_notes":{"explanation":"'Emmetropy' refers to the refractive state of the eye where parallel light rays are focused directly on the retina when the eye is at rest. It's the absence of refractive error, meaning no need for glasses or contact lenses to see clearly at a distance. It is often used in ophthalmology and optometry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has emmetropy, so he needs glasses.","correct":"✓ The patient has emmetropy, so he doesn't need glasses.","note":"Emmetropy means normal vision, so glasses are not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["emmetropic (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and optometry contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emmetropy' is a specialized term used in the fields of ophthalmology and optometry to describe the condition of having perfect vision without any refractive error. It's a technical term, so it's not commonly used in everyday conversation. It is important to understand this term in the context of eye health and vision correction.","priority":"★★☆"},"example_sentences":[{"sentence":"The goal of refractive surgery is often to achieve emmetropy.","translation":"屈折矯正手術の目標は、多くの場合、正視を達成することです。","type":"general","meaning_category":"normal vision"},{"sentence":"A person with emmetropy can see distant objects clearly.","translation":"正視眼の人は遠くの物体をはっきりと見ることができます。","type":"general","meaning_category":"normal vision"}]}