{"word":"boomorah","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（オーストラリア先住民の伝承における）超自然的な存在または精霊","english_definition":"In Australian Aboriginal mythology, a supernatural being or spirit, often associated with particular locations or natural phenomena.","examples":[{"sentence":"The elders warned us not to disturb the boomorah near the sacred waterhole.","translation":"長老たちは聖なる水場近くのブーモラを乱さないよう警告した"}],"notes":"主に特定のオーストラリア先住民コミュニティの伝承で用いられる特殊な用語"},{"part_of_speech":"noun","definition":"（比喩的に）不可解で神秘的な力や影響","english_definition":"(figuratively) an inexplicable and mysterious force or influence.","examples":[{"sentence":"There's a strange boomorah about this old house that makes people uneasy.","translation":"この古い家には人々を不安にさせる奇妙な神秘的な力がある"}],"notes":"比喩的用法は非常に稀"}],"etymology":{"value":"オーストラリア先住民言語（おそらくニューサウスウェールズ州のダルグ語または近隣言語）に由来すると考えられるが、正確な語源は不明。19世紀後半の民族誌記録に初出。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbuːmərɑː/","syllables":"boo-mo-rah"},"usage_notes":{"explanation":"「boomorah」は極めて特殊な文化固有の用語で、一般的な英語会話や文章ではほとんど使用されません。主に:\n1. オーストラリア先住民文化に関する学術的・人類学的文脈\n2. 特定の地域の伝承を扱う場合\n3. 比喩的に用いる場合は詩的または文学的な文脈\nに限定されます。使用にあたっては文化的文脈を正しく理解することが不可欠です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The boomorah made loud noises in the forest.","correct":"✓ The elders spoke of the boomorah that protects the forest.","note":"ブーモラは通常物理的な音を立てる存在として描写されない"}],"priority":"★☆☆"},"level_frequency":{"CEFR":"該当なし (専門用語)","frequency_google_ngram":"極めて低頻度 (Extremely low frequency - 0.0000001%以下)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「boomorah」は極めて特殊な文化人類学用語で、通常の英語学習ではまず遭遇しません。オーストラリア先住民文化に深く関わる専門家や、特定の地域の伝承を研究する学者など、非常に限られた文脈でしか使用されません。一般の英語話者でもこの単語を知っていることは稀です。"},"example_sentences":[{"sentence":"According to local legend, the **boomorah** inhabits the rocky outcrops near the river.","translation":"地元の伝説によれば、ブーモラは川近くの岩場に棲むという","type":"noun","meaning_category":"超自然的な存在"},{"sentence":"Anthropologists have recorded various interpretations of the **boomorah** concept among different clans.","translation":"人類学者たちは様々な氏族間におけるブーモラ概念の解釈を記録してきた","type":"noun","meaning_category":"文化的概念"}]}