{"word":"pectosinase","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ペクトシナーゼ（ペクチン質を分解する酵素）","english_definition":"An enzyme that breaks down pectin.","examples":[{"sentence":"Pectosinase is used in the food industry to clarify fruit juices.","translation":"ペクトシナーゼは、食品産業で果汁を清澄化するために使用されます。"},{"sentence":"The addition of pectosinase helps to reduce the cloudiness in wine.","translation":"ペクトシナーゼを加えることで、ワインの濁りを減らすことができます。"}],"collocations":["use pectosinase","add pectosinase","pectosinase activity"],"synonyms":["pectinase","pectic enzyme"],"antonyms":[]}],"etymology":{"value":"'Pectosin' + '-ase' (suffix indicating an enzyme). Pectosin refers to pectin, a structural heteropolysaccharide contained in the primary cell walls of terrestrial plants.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpektəˈsaɪneɪz/","syllables":"pec-to-si-nase"},"inflection":{"noun_plural":"pectosinasess"},"usage_notes":{"explanation":"Pectosinase is a type of pectinase, an enzyme that catalyzes the breakdown of pectin. It is widely used in the food and beverage industry, particularly in the production of fruit juices and wine, to clarify the liquid and improve its appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ pectosynase","correct":"✓ pectosinase","note":"Correct spelling is pectosinase."}],"priority":"★★★"},"related_words":{"derivatives":["pectin","pectinase"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Pectosinase is a technical term referring to an enzyme used to break down pectin, a substance found in plant cell walls. It's primarily encountered in contexts related to food science, winemaking, and fruit juice production. Understanding this term requires a background in biochemistry or food technology."},"example_sentences":[{"sentence":"The winemaker added pectosinase to the grape must to improve clarification.","translation":"ワイン醸造家は、清澄度を向上させるために、ブドウ果汁にペクトシナーゼを添加しました。","type":"general","meaning_category":"enzyme"},{"sentence":"Pectosinase treatment can increase the yield of juice from apples.","translation":"ペクトシナーゼ処理は、リンゴからの果汁の収量を増加させることができます。","type":"general","meaning_category":"enzyme"}]}