{"word":"pai-hua","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"白話 (báihuà): 中国語の口語、話し言葉に基づいて書かれた書き言葉。","english_definition":"(Chinese: 白話 (báihuà)) Vernacular Chinese; written language based on spoken language.","examples":[{"sentence":"這篇文章是用白話文寫的，很容易理解。","translation":"Zhè piān wénzhāng shì yòng báihuàwén xiě de, hěn róngyì lǐjiě. (This article is written in vernacular Chinese and is easy to understand.)"}],"collocations":["白話文 (báihuàwén): vernacular writing","使用白話 (shǐyòng báihuà): to use vernacular Chinese"],"synonyms":["口語 (kǒuyǔ): spoken language","大白話 (dàbáihuà): very plain language"],"antonyms":["文言文 (wényánwén): Classical Chinese"]}],"etymology":{"value":"白 (bái): white, plain, clear + 話 (huà): speech, language. Literally 'plain speech'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaɪˈhwɑː/","syllables":"pai-hua"},"inflection":{"notes":"Noun, no plural form."},"usage_notes":{"explanation":"'Pai-hua' refers to the standard written form of modern Chinese, which is based on the spoken language. It contrasts with Classical Chinese (wényánwén), which was the literary standard for thousands of years but is very different from modern spoken Chinese. Pai-hua is used in most modern writing, including novels, newspapers, and textbooks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"我說白話。","correct":"我說的是白話。","note":"While '我說白話' might be understood, it's more natural to say '我說的是白話' (What I speak is vernacular Chinese)."},{"incorrect":"他寫的書很白話。","correct":"他寫的書是用白話文寫的。","note":"It's more common to say '他寫的書是用白話文寫的' (The book he wrote is written in vernacular Chinese) rather than just '他寫的書很白話'"}],"priority":"★★☆"},"related_words":{"derivatives":["白話字 (báihuàzì): Pe̍h-ōe-jī (Romanization system for Hokkien)"],"phrases":["白話運動 (báihuà yùndòng): Vernacular Chinese Movement"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency in Chinese texts.","priority":"★☆☆"},"readability_explanation":{"level":"Advanced","text":"Understanding 'pai-hua' requires knowledge of Chinese language history and the distinction between written and spoken forms. It's a key concept in understanding modern Chinese literature and culture."},"example_sentences":[{"sentence":"這本小說是用白話寫的，所以讀起來很輕鬆。","translation":"Zhè běn xiǎoshuō shì yòng báihuà xiě de, suǒyǐ dú qǐlái hěn qīngsōng. (This novel is written in vernacular Chinese, so it's easy to read.)","type":"noun","meaning_category":"Vernacular Chinese"},{"sentence":"白話文的推廣是中國現代文學發展的重要一步。","translation":"Báihuàwén de tuīguǎng shì Zhōngguó xiàndài wénxué fāzhǎn de zhòngyào yī bù. (The promotion of vernacular Chinese was an important step in the development of modern Chinese literature.)","type":"noun","meaning_category":"Vernacular Chinese"}]}