{"word":"nation-focused","meanings":[{"part_of_speech":"adjective","definition":"国家に焦点を当てた、国家中心の","english_definition":"Focused primarily on the interests, needs, or identity of a particular nation.","examples":[{"sentence":"The politician's speech was very nation-focused, emphasizing domestic issues above all else.","translation":"その政治家の演説は非常に国家中心であり、何よりも国内問題を強調していた。"},{"sentence":"The company's nation-focused marketing strategy aims to appeal to local consumers.","translation":"その企業の国家中心のマーケティング戦略は、地元の消費者にアピールすることを目的としている。"},{"sentence":"The government adopted a more nation-focused approach to trade policy.","translation":"政府は貿易政策において、より国家中心のアプローチを採用した。"}],"collocations":["nation-focused policy","nation-focused strategy","nation-focused approach","nation-focused agenda","nation-focused campaign"],"synonyms":["nationalistic","patriotic","national-oriented","country-centric","homeland-focused"],"antonyms":["global-focused","international-oriented","cosmopolitan","multinational","universal"]}],"etymology":{"value":"Combination of 'nation' (a large body of people united by common descent, history, culture, or language, inhabiting a particular country or territory) and 'focused' (having one's attention or interest directed at something specific).","priority":"★★★"},"pronunciation":{"ipa":"/ˈneɪʃən ˈfoʊkəst/","syllables":"na-tion-fo-cused"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Nation-focused' describes something that prioritizes the interests, values, or identity of a specific nation. It can refer to policies, strategies, ideologies, or perspectives that place the nation at the center of consideration. It often implies a focus on domestic concerns and a prioritization of national interests over international cooperation or global issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The nation-focused is important for the country.","correct":"A nation-focused approach is important for the country.","note":"'Nation-focused' is an adjective and needs to modify a noun. Using it as a noun is grammatically incorrect."},{"incorrect":"The company is nation-focused on the world.","correct":"The company is nation-focused domestically.","note":"The term implies a focus on the internal affairs or interests of a nation, so using it with 'on the world' creates a contradictory meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["nationally-focused","nation-centrism","nationalism","patriotism"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Nation-focused' is a compound adjective used to describe something that is primarily concerned with the interests, needs, or identity of a particular nation. It suggests a prioritization of domestic issues and national interests. This term is commonly found in political, economic, and social contexts, often in discussions about policy, strategy, or ideology. Understanding this term requires familiarity with concepts of nationalism, patriotism, and the role of the nation-state in global affairs."},"example_sentences":[{"sentence":"The government's nation-focused economic plan aims to boost local industries.","translation":"政府の国家中心の経済計画は、地元の産業を活性化することを目的としている。","type":"example","meaning_category":"economic policy"},{"sentence":"The news channel provides nation-focused coverage of current events.","translation":"そのニュースチャンネルは、時事問題に関する国家中心の報道を提供している。","type":"example","meaning_category":"media coverage"},{"sentence":"The artist's work explores themes of national identity and nation-focused pride.","translation":"そのアーティストの作品は、国民的アイデンティティと国家中心の誇りをテーマにしている。","type":"example","meaning_category":"artistic expression"}]}