{"word":"restauro","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(イタリア語) レストレーション、修復、復元","english_definition":"(Italian) restoration, repair, reconstruction.  Often used in the context of art, architecture, and cultural heritage.","examples":[{"sentence":"Il restauro della facciata è stato completato.","translation":"ファサードの修復が完了しました。"},{"sentence":"Il restauro di questo dipinto è un'opera delicata.","translation":"この絵画の修復は繊細な作業です。"},{"sentence":"Il restauro conservativo mira a preservare l'autenticità dell'opera.","translation":"保存修復は作品の真正性を保つことを目指しています。"}],"collocations":["restauro conservativo (保存修復)","restauro architettonico (建築修復)","restauro di opere d'arte (美術品の修復)","intervento di restauro (修復作業)"],"synonyms":["riparazione (repair)","ristrutturazione (renovation)","recupero (recovery)","conservazione (conservation)"],"antonyms":["distruzione (destruction)","danneggiamento (damage)","alterazione (alteration)"]}],"etymology":{"value":"Derived from the Italian verb 'restaurare', which comes from the Latin 'restaurare' meaning 'to restore, rebuild, repair'.","priority":"★★☆"},"pronunciation":{"ipa":"/reˈstau̯ro/","syllables":"re-stau-ro"},"inflection":{"noun_plural":"restauri"},"usage_notes":{"explanation":"'Restauro' is an Italian term widely used in the field of art, architecture, and cultural heritage to describe the process of restoring or repairing damaged or deteriorated objects or buildings. It implies a careful and respectful approach to preserving the original character and value of the object. The term is often used internationally, even outside of Italian-speaking contexts, particularly when discussing specialized restoration techniques or philosophies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"*Il restauro è stato veloce.","correct":"✓ Il restauro è stato rapido.","note":"While 'veloce' (fast) can be used, 'rapido' (rapid) is more commonly used to describe the speed of a restoration process."},{"incorrect":"*Il restauro del muro.","correct":"✓ Il restauro del muro è stato costoso.","note":"Ensure the sentence is complete and provides context about the restoration."}],"priority":"★★☆"},"related_words":{"derivatives":["restaurare (verb: to restore)","restauratore (noun: restorer)","restauratrice (noun, feminine: restorer)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts related to art and architecture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Restauro' is a specialized term primarily used in the context of art, architecture, and cultural heritage. Understanding its meaning requires familiarity with these fields. The term implies a careful and respectful approach to preserving the original character and value of the object being restored. It is often used in international contexts when discussing specialized restoration techniques or philosophies."},"example_sentences":[{"sentence":"Il restauro della tela ha richiesto anni di lavoro.","translation":"The restoration of the canvas took years of work.","type":"noun","meaning_category":"restoration"},{"sentence":"L'intervento di restauro è stato eseguito da esperti del settore.","translation":"The restoration work was carried out by experts in the field.","type":"noun","meaning_category":"restoration"},{"sentence":"Il restauro ha riportato l'opera al suo antico splendore.","translation":"The restoration has returned the work to its former glory.","type":"noun","meaning_category":"restoration"}]}