{"word":"iconophilist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聖像愛好家、偶像崇拝者","english_definition":"A person who supports or is in favor of religious images or icons, especially during the Byzantine iconoclasm.","examples":[{"sentence":"The iconophilists strongly opposed the destruction of religious art.","translation":"聖像愛好家たちは宗教芸術の破壊に強く反対した。"}],"collocations":["Byzantine iconophilists","religious iconophilists"],"synonyms":["iconodule","image worshiper"],"antonyms":["iconoclast"]}],"etymology":{"value":"From 'icono-' (image) + '-philist' (lover).","priority":"★☆☆"},"pronunciation":{"ipa":"/aɪˈkɒnəfɪlɪst/","syllables":"i-co-no-phil-ist"},"inflection":{"noun_plural":"iconophilists"},"usage_notes":{"explanation":"The term 'iconophilist' is primarily used in historical contexts, specifically referring to those who defended the use of religious images during periods of iconoclasm, such as in the Byzantine Empire. It is less commonly used in contemporary language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an iconophilist of modern art.","correct":"✓ He is a lover of modern art.","note":"'Iconophilist' specifically relates to religious images, not general art appreciation."}],"priority":"★☆☆"},"related_words":{"derivatives":["iconophilia (noun: the love or veneration of icons)"],"related_terms":["iconoclasm (noun: the destruction of religious images)","iconodule (noun: a synonym for iconophilist)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Iconophilist' is a specialized term primarily used in historical or religious contexts to describe someone who supports the use of religious images, particularly during periods when such images were being destroyed or opposed. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The debate between iconoclasts and iconophilists shaped Byzantine art and theology.","translation":"聖像破壊者と聖像愛好家の間の議論は、ビザンチン美術と神学を形作った。","type":"noun","meaning_category":"supporter of religious images"},{"sentence":"The iconophilist monks meticulously preserved ancient icons.","translation":"聖像愛好家の修道士たちは、古代の聖像を細心の注意を払って保存した。","type":"noun","meaning_category":"preserver of icons"}]}