{"word":"Artificership","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The position or office of an artificer; the skill or work of an artificer.","english_definition":"The position or office of an artificer; the skill or work of an artificer.","examples":[{"sentence":"His artificership was highly valued by the guild.","translation":"彼の職人としての腕はギルドから高く評価された。"},{"sentence":"The artificership required a deep understanding of materials and techniques.","translation":"その職人技は、材料と技術の深い理解を必要とした。"}],"collocations":["hold an artificership","skilled artificership","master artificership"],"synonyms":["craftsmanship","artistry","skill","expertise"],"antonyms":["ineptitude","unskillfulness"]}],"etymology":{"value":"Derived from 'artificer' (a skilled craftsman or inventor) + '-ship' (a suffix denoting a state, condition, office, or skill).","priority":"★★★"},"pronunciation":{"ipa":"/ɑːrˈtɪfɪsərʃɪp/","syllables":"ar-tif-i-cer-ship"},"inflection":{"noun_plural":"artificerships"},"usage_notes":{"explanation":"'Artificership' is a relatively rare word, primarily used in formal contexts to describe either the role or the skill associated with being an artificer (a skilled craftsman). It emphasizes the expertise and position held by such an individual.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artificership of the building was modern.","correct":"✓ The architecture of the building was modern.","note":"'Artificership' refers to the skill or position of a craftsman, not the design or style of a building. Use 'architecture' instead."},{"incorrect":"✗ He showed great artificership in his painting.","correct":"✓ He showed great artistry in his painting.","note":"While 'artificership' can refer to skill, 'artistry' is more commonly used to describe skill in fine arts like painting."}],"priority":"★★☆"},"related_words":{"derivatives":["artificer","artifice","artificial"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare word)","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Artificership' is a high-level vocabulary word that is rarely used in everyday conversation. It refers to the position, office, or skill of an artificer, which is a skilled craftsman or inventor. Understanding this word requires a strong grasp of both vocabulary and historical context related to craftsmanship and skilled trades."},"example_sentences":[{"sentence":"The museum showcased examples of fine artificership from the Renaissance period.","translation":"博物館では、ルネサンス時代の優れた職人技の例が展示されていた。","type":"noun","meaning_category":"skill/work"},{"sentence":"He was awarded the artificership after years of dedicated service to the craft.","translation":"彼は長年の献身的な職人としての貢献により、職人の地位を授与された。","type":"noun","meaning_category":"position/office"}]}