{"word":"antiparallelogram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(幾何学)対辺が交差し、平行四辺形ではない四角形。","english_definition":"(geometry) A quadrilateral in which the sides cross each other and which is not a parallelogram.","examples":[{"sentence":"An antiparallelogram has two pairs of equal-length sides, but unlike a parallelogram, the equal sides are not opposite each other.","translation":"反平行四辺形は、長さが等しい2組の辺を持ちますが、平行四辺形とは異なり、等しい辺は互いに対向していません。"},{"sentence":"The self-intersecting nature of the antiparallelogram makes it distinct from convex quadrilaterals.","translation":"反平行四辺形の自己交差する性質は、凸四角形とは異なります。"}],"collocations":["cyclic antiparallelogram","crossed quadrilateral","self-intersecting quadrilateral"],"synonyms":["crossed quadrilateral"],"antonyms":["parallelogram","trapezoid","rectangle","square"],"related_terms":["quadrilateral","geometry","cyclic quadrilateral","isosceles trapezoid"]}],"etymology":{"value":"「anti-」（反対の）+「parallelogram」（平行四辺形）。平行四辺形に似ているが、平行ではない辺を持つことから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌpærəˈlɛləˌɡræm/","syllables":"an-ti-par-al-lel-o-gram"},"inflection":{"noun_plural":"antiparallelograms"},"usage_notes":{"explanation":"An antiparallelogram is a specific type of quadrilateral in Euclidean geometry. It is characterized by having two pairs of sides of equal length, but unlike a parallelogram, these equal sides are not opposite each other. Instead, the sides cross each other, making it a self-intersecting or crossed quadrilateral. A cyclic antiparallelogram is one that can be inscribed in a circle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ All quadrilaterals are antiparallelograms.","correct":"✓ Not all quadrilaterals are antiparallelograms. Antiparallelograms are a specific type of quadrilateral.","note":"Antiparallelograms are a specific type of quadrilateral, not a general term for all quadrilaterals."},{"incorrect":"✗ An antiparallelogram has parallel sides.","correct":"✓ An antiparallelogram does not have parallel sides. That's what distinguishes it from a parallelogram.","note":"The defining characteristic of an antiparallelogram is that it does *not* have parallel sides."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["quadrilateral","parallelogram","cyclic quadrilateral","isosceles trapezoid","geometry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'antiparallelogram' refers to a specific type of quadrilateral in geometry. It is defined by having two pairs of equal-length sides that cross each other, distinguishing it from parallelograms which have parallel sides. Understanding this term requires a background in geometry and familiarity with quadrilaterals. It's a term used in advanced mathematical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The mechanism used an antiparallelogram linkage to achieve a specific motion.","translation":"その機構は、特定の動きを実現するために反平行四辺形リンケージを使用した。","type":"technical","meaning_category":"geometry"},{"sentence":"Cyclic antiparallelograms can be inscribed in a circle, which leads to interesting geometric properties.","translation":"円に内接する反平行四辺形は、興味深い幾何学的特性につながる。","type":"technical","meaning_category":"geometry"},{"sentence":"Unlike a parallelogram, an antiparallelogram has sides that intersect each other.","translation":"平行四辺形とは異なり、反平行四辺形は辺が互いに交差する。","type":"definition","meaning_category":"geometry"}]}