{"word":"battailant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(heraldry) A term used to describe a beast or other creature depicted in a fighting posture, usually with its forepaws raised and ready to strike.","english_definition":"(heraldry) Describing a beast or other creature depicted in a fighting posture.","examples":[{"sentence":"The lion was depicted battailant, its claws bared and ready to strike.","translation":"そのライオンは戦いの姿勢で描かれており、爪をむき出しにして攻撃の準備をしていた。"}],"collocations":["lion battailant","eagle battailant"],"synonyms":["combatant","fighting","rampant (sometimes used loosely, but 'rampant' has a specific meaning of standing on one leg)"],"antonyms":["dormant","passant","couchant"]}],"etymology":{"value":"Derived from the Old French word 'bataille', meaning 'battle'.","priority":"★★☆"},"pronunciation":{"ipa":"/bæˈteɪlənt/","syllables":"bat-tai-lant"},"inflection":{"notes":"This is an adjective, so it can be used to describe a noun. It does not have plural forms."},"usage_notes":{"explanation":"'Battailant' is primarily used in heraldry, the art and science of designing and describing coats of arms and other armorial bearings. It specifically describes the posture of a creature, typically a beast, shown in a fighting stance. It is important to note that while it suggests a fighting posture, it does not necessarily imply aggression; it simply describes the animal's position. It is a relatively rare term outside of heraldic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The knight was battailant on the battlefield.","correct":"✓ The knight was fighting on the battlefield.","note":"'Battailant' describes the posture of a creature in heraldry, not a person in battle."},{"incorrect":"✗ The dragon was rampant and battailant.","correct":"✓ The dragon was battailant.","note":"'Rampant' and 'battailant' are distinct heraldic terms describing different postures. While a creature can be both, it's important to use the terms accurately. 'Rampant' means standing on its hind legs with one foreleg raised, while 'battailant' implies a fighting stance with forepaws raised."}],"priority":"★☆☆"},"related_words":{"derivatives":["battle (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in heraldry.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Battailant' is a specialized term primarily used within the field of heraldry. It describes the specific posture of a creature depicted on a coat of arms, indicating a fighting stance with raised forepaws. Due to its limited usage within a specific domain, it is considered an advanced term not commonly encountered in general English. Understanding this term requires familiarity with heraldic conventions and terminology."},"example_sentences":[{"sentence":"The crest featured a griffin battailant, symbolizing courage and vigilance.","translation":"紋章には、勇気と警戒心を象徴するグリフォンが戦いの姿勢で描かれていた。","type":"adjective","meaning_category":"heraldry"},{"sentence":"In heraldic terms, the bear was blazoned as 'a bear battailant sable'.","translation":"紋章学的には、その熊は「黒い熊が戦いの姿勢」と記述された。","type":"adjective","meaning_category":"heraldry"}]}