{"word":"preinflection","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of word formation in which affixes are attached to the beginning of a word to modify its meaning or grammatical function.","english_definition":"The process or result of adding a prefix to a word.","examples":[{"sentence":"The use of preinflection is common in many languages to indicate tense or number.","translation":"接頭辞の付加は、多くの言語で時制や数を表すためによく用いられます。"},{"sentence":"Preinflection can significantly alter the meaning of the base word.","translation":"接頭辞の付加は、基本語の意味を大きく変えることがあります。"}],"collocations":["use preinflection","apply preinflection","preinflection process","types of preinflection"],"synonyms":["prefixation","prefixing"],"antonyms":["suffixation","postinflection"]}],"etymology":{"value":"Formed by combining the prefix 'pre-' (meaning 'before') with 'inflection' (the modification of a word to express different grammatical categories).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪnˈflɛkʃən/","syllables":"pre-in-flec-tion"},"inflection":{"noun_plural":"preinflections"},"usage_notes":{"explanation":"The term 'preinflection' is often used in linguistics to describe the morphological process of adding prefixes to words. It's important to note that while prefixes can change the meaning or function of a word, they don't always indicate grammatical categories in the same way that inflections (suffixes) do. However, in some languages, prefixes can indeed mark grammatical features such as tense or number.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preinflection was added at the end of the word.","correct":"✓ The preinflection was added at the beginning of the word.","note":"Preinflections are added at the beginning of words, not the end."}],"priority":"★☆☆"},"related_words":{"derivatives":["preinflected (adjective)"],"related_terms":["prefix","inflection","suffix","morphology","affix"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preinflection' is a term used in linguistics to describe the process of adding prefixes to words to change their meaning or grammatical function. It's a more advanced concept related to morphology, the study of word formation. Understanding this term requires familiarity with linguistic terminology such as 'prefix,' 'inflection,' and 'affix.' While not commonly used in everyday language, it is important in the field of linguistics."},"example_sentences":[{"sentence":"Some languages rely heavily on preinflection to convey grammatical information.","translation":"いくつかの言語では、文法的な情報を伝えるために接頭辞の付加に大きく依存しています。","type":"noun","meaning_category":"Word formation"},{"sentence":"The preinflection 'un-' changes the meaning of 'happy' to 'unhappy'.","translation":"接頭辞 'un-' は 'happy' の意味を 'unhappy' に変えます。","type":"noun","meaning_category":"Word formation"}]}