{"word":"Biarchy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二頭政治、二人の支配者による統治","english_definition":"Government by two rulers or authorities.","examples":[{"sentence":"The ancient city was ruled by a biarchy of priests and nobles.","translation":"古代都市は、司祭と貴族による二頭政治によって統治されていた。"},{"sentence":"The company's leadership structure is a biarchy, with two co-CEOs.","translation":"その会社のリーダーシップ構造は二頭政治であり、2人の共同CEOがいる。"}],"collocations":["establish a biarchy","overthrow a biarchy","co-CEOs forming a biarchy"],"synonyms":["duarchy","diarchy"],"antonyms":["monarchy","oligarchy","anarchy"]}],"etymology":{"value":"From the Greek 'bi-' (two) + '-archy' (rule).","priority":"★★★"},"pronunciation":{"ipa":"ˈbaɪˌɑːrki","syllables":"bi-ar-chy"},"inflection":{"noun_plural":"biarchies"},"usage_notes":{"explanation":"'Biarchy' is a relatively uncommon term, typically used in political science or historical contexts to describe systems of government where power is shared equally between two individuals or groups. It's distinct from 'diarchy', although the terms are often used interchangeably.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was in a state of biarchy after the revolution, with no clear leader.","correct":"✓ The country was in a state of anarchy after the revolution, with no clear leader.","note":"'Biarchy' implies two leaders, whereas 'anarchy' implies no leaders or governing structure."},{"incorrect":"✗ The biarchy was very efficient because they always agreed.","correct":"✓ The biarchy was very efficient because they had complementary skills and a shared vision.","note":"A biarchy can be efficient, but not necessarily because they always agree. It is more about having complementary skills and a shared vision."}],"priority":"★☆☆"},"related_words":{"derivatives":["biarchic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biarchy' is a specialized term used in political science and history to describe a system of government with two rulers. Understanding this term requires familiarity with the Greek roots 'bi-' (two) and '-archy' (rule). It's less common than terms like 'monarchy' or 'oligarchy'. Context is crucial for understanding its usage.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Roman Republic, in its early stages, could be considered a form of biarchy with its two consuls.","translation":"初期のローマ共和国は、2人の執政官を持つ二頭政治の一形態と見なすことができる。","type":"example","meaning_category":"historical context"},{"sentence":"The company decided to implement a biarchy at the executive level to ensure balanced decision-making.","translation":"会社は、バランスの取れた意思決定を確実にするために、経営幹部レベルで二頭政治を実施することを決定した。","type":"example","meaning_category":"corporate structure"},{"sentence":"The success of the biarchy depended on the ability of the two leaders to cooperate effectively.","translation":"二頭政治の成功は、2人のリーダーが効果的に協力する能力にかかっていた。","type":"example","meaning_category":"general principle"}]}