{"word":"Francoist","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"フランコ体制の、フランコ支持の","english_definition":"Relating to or supporting Francisco Franco or his regime in Spain.","examples":[{"sentence":"The Francoist government suppressed political dissent.","translation":"フランコ体制下の政府は政治的な異議を抑圧した。"},{"sentence":"Francoist ideology emphasized nationalism and authoritarianism.","translation":"フランコ主義のイデオロギーは国家主義と権威主義を強調した。"}],"collocations":["Francoist Spain","Francoist policies","Francoist ideology"],"synonyms":["pro-Franco","Falangist","nationalist (in the context of the Spanish Civil War)"],"antonyms":["anti-Francoist","republican (in the context of the Spanish Civil War)"]},{"part_of_speech":"noun","definition":"フランコ支持者、フランコ体制の支持者","english_definition":"A supporter of Francisco Franco or his regime in Spain.","examples":[{"sentence":"Many Francoists remained in positions of power after Franco's death.","translation":"フランコの死後も、多くのフランコ支持者が権力の座にとどまった。"},{"sentence":"The Francoists celebrated the anniversary of their victory in the Spanish Civil War.","translation":"フランコ支持者たちはスペイン内戦での勝利の記念日を祝った。"}],"collocations":["staunch Francoist","former Francoist"],"synonyms":["supporter of Franco","Falangist","nationalist (supporter)"],"antonyms":["anti-Francoist","republican (supporter)"]}],"etymology":{"value":"From Francisco Franco, the Spanish dictator, + -ist (suffix indicating a supporter or adherent).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfræŋkɔɪst/","syllables":"Fran-co-ist"},"inflection":{"noun_plural":"Francoists"},"usage_notes":{"explanation":"The term \"Francoist\" refers specifically to those who supported Francisco Franco and his regime in Spain from 1936 to 1975. It is often used in historical contexts when discussing the Spanish Civil War and the subsequent dictatorship. The term can carry negative connotations, especially among those who opposed Franco's regime.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Francoist now, supporting the current government.","correct":"✓ He was a Francoist during Franco's rule.","note":"The term \"Francoist\" is specific to the era of Francisco Franco's rule. It would not be used to describe someone supporting a contemporary government unless that government is directly related to Franco's legacy."}],"priority":"★★☆"},"related_words":{"derivatives":["Francoism (the ideology and political system of Francisco Franco)"],"related_terms":["Falange (Spanish fascist political party)","Spanish Civil War","Francisco Franco","dictatorship","authoritarianism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Francoist\" is specific to the historical context of Spain under the rule of Francisco Franco. It is used to describe individuals, policies, or ideologies associated with his regime. Understanding the term requires knowledge of Spanish history, particularly the Spanish Civil War and the subsequent dictatorship. The term is most often encountered in academic or historical discussions.","priority":"★★★"},"example_sentences":[{"sentence":"The museum exhibit explored the impact of Francoist policies on Spanish society.","translation":"その博物館の展示は、フランコ体制の政策がスペイン社会に与えた影響を探求した。","type":"adjective","meaning_category":"Relating to Franco's regime"},{"sentence":"Many former Francoists transitioned into mainstream politics after the restoration of democracy.","translation":"民主主義の回復後、多くの元フランコ支持者が主流の政治に移行した。","type":"noun","meaning_category":"Supporter of Franco"}]}