{"word":"Ophiuchus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"へびつかい座","english_definition":"A constellation crossed by the sun in late November and early December, located between Scorpius and Sagittarius.","examples":[{"sentence":"Ophiuchus is not traditionally considered one of the twelve astrological signs.","translation":"へびつかい座は伝統的に12の占星術の星座の一つとはみなされていません。"},{"sentence":"The sun passes through Ophiuchus for a short period each year.","translation":"太陽は毎年短い期間、へびつかい座を通過します。"}],"collocations":["Ophiuchus constellation","the constellation Ophiuchus","sun in Ophiuchus"],"synonyms":["Serpentarius"],"antonyms":[]},{"part_of_speech":"noun","definition":"へびつかい座の人","english_definition":"A person born while the sun is in the constellation Ophiuchus, roughly between November 30 and December 17.","examples":[{"sentence":"Some astrologers include Ophiuchus as a thirteenth sign, affecting those born under it.","translation":"一部の占星術師は、へびつかい座を13番目の星座として含めており、その下に生まれた人々に影響を与えるとされています。"}],"collocations":["Ophiuchus sign","Ophiuchus astrology"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin Ophiūchus, from Ancient Greek Ὀφιοῦχος (Ophioukhos), from ὄφις (ophis, “snake, serpent”) + ἔχω (ekhō, “I have, I hold”). Literally 'serpent-bearer'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒfiˈjuːkəs/","syllables":"O-phi-u-chus"},"inflection":{"noun_plural":"Ophiuchi (rare)"},"usage_notes":{"explanation":"Ophiuchus is a constellation often discussed in relation to astrology. While not traditionally included in the twelve signs of the zodiac, some modern astrologers recognize it as a thirteenth sign. The name means 'serpent-bearer' in Greek, reflecting its depiction as a man holding a snake.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm an Ophiuchus.","correct":"✓ I was born under the sign of Ophiuchus. / ✓ I am an Ophiuchus person.","note":"It's more common to say you were born under the sign of Ophiuchus, or refer to yourself as an Ophiuchus person, rather than simply 'I'm an Ophiuchus'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ophiuchid (adjective, relating to Ophiuchus)"],"phrases":["Serpent Bearer"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ophiuchus' refers to a constellation, which is a group of stars forming a recognizable pattern in the night sky. It's also sometimes discussed in astrology as a potential thirteenth sign of the zodiac. The word itself comes from Greek, meaning 'serpent-bearer,' because the constellation is depicted as a man holding a snake. You'll typically encounter this term in discussions about astronomy or astrology."},"example_sentences":[{"sentence":"The astronomer pointed out the location of Ophiuchus in the night sky.","translation":"天文学者は夜空でへびつかい座の位置を指摘しました。","type":"noun","meaning_category":"constellation"},{"sentence":"Some believe that the inclusion of Ophiuchus changes their astrological sign.","translation":"へびつかい座を含めることで、自分の占星術の星座が変わると信じている人もいます。","type":"noun","meaning_category":"astrological sign"}]}