{"word":"Greece-loving","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ギリシャを愛する、ギリシャを好む","english_definition":"Having a strong affection for or interest in Greece, its culture, or its people.","examples":[{"sentence":"She is a Greece-loving tourist who visits the country every year.","translation":"彼女はギリシャを愛する観光客で、毎年その国を訪れます。"},{"sentence":"As a Greece-loving historian, he dedicated his life to studying ancient Greek civilization.","translation":"ギリシャを愛する歴史家として、彼は古代ギリシャ文明の研究に生涯を捧げました。"}],"collocations":["Greece-loving tourist","Greece-loving historian","Greece-loving community"],"synonyms":["Hellenophile","pro-Greece","Greece enthusiast"],"antonyms":["Greece-hating","anti-Greece"],"notes":"This word is a compound adjective formed by combining \"Greece\" and \"loving.\" It is used to describe someone who has a strong affinity for Greece."}],"etymology":{"value":"Formed by combining the noun 'Greece' with the present participle 'loving'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɡriːsˌlʌvɪŋ/","syllables":"Greece-lov-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'Greece-loving' is used to describe someone who has a strong affection for Greece, its culture, history, or people. It is often used to characterize tourists, historians, or members of a community who share a common interest in Greece.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_terms":["Hellenophile","Hellenic"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The word 'Greece-loving' is a compound adjective used to describe someone who has a strong affection for Greece. It is relatively straightforward to understand, but its usage is not very common, making it more suitable for intermediate to advanced learners."},"example_sentences":[{"sentence":"The Greece-loving couple decided to have their wedding on a beautiful Greek island.","translation":"そのギリシャを愛するカップルは、美しいギリシャの島で結婚式を挙げることに決めました。","type":"adjective","meaning_category":"Having affection for Greece"},{"sentence":"The museum features a collection of artifacts donated by a wealthy Greece-loving benefactor.","translation":"その博物館には、ギリシャを愛する裕福な後援者から寄贈された工芸品のコレクションが展示されています。","type":"adjective","meaning_category":"Having affection for Greece"}]}