{"word":"two-timer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二股をかける人、浮気者","english_definition":"a person who deceives a lover or spouse by secretly having a sexual relationship with someone else.","examples":[{"sentence":"He's a two-timer; he's seeing two women at the same time.","translation":"彼は二股をかけている。同時に二人の女性と付き合っているんだ。"},{"sentence":"She found out her husband was a two-timer and filed for divorce.","translation":"彼女は夫が浮気者だと知り、離婚を申請した。"},{"sentence":"Don't trust him; he's known to be a two-timer.","translation":"彼を信用するな。浮気者として知られているから。"}],"collocations":["be a two-timer","catch someone being a two-timer","a notorious two-timer"],"synonyms":["cheater","infidel","adulterer","philanderer","womanizer","player"],"antonyms":["loyal","faithful","monogamous"]}],"etymology":{"value":"The term likely arose from the idea of someone dividing their time and affection between two people, thus 'timing' two different relationships simultaneously. The exact origin is unclear, but it gained popularity in the early to mid-20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtuːˌtaɪmər/","syllables":"two-ti-mer"},"inflection":{"noun_plural":"two-timers"},"usage_notes":{"explanation":"'Two-timer' is a derogatory term used to describe someone who is unfaithful in a romantic relationship. It specifically implies that the person is actively involved with more than one partner at the same time, deceiving at least one of them. The term carries a strong negative connotation, suggesting dishonesty and betrayal. It is primarily used in the context of romantic or marital relationships.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a two time.","correct":"✓ He is a two-timer.","note":"The correct term is 'two-timer,' not 'two time.'"},{"incorrect":"✗ She two-timed her friend.","correct":"✓ She cheated on her friend's boyfriend.","note":"'Two-timer' refers to the person committing the infidelity, not the act itself. To describe the act, use 'cheat on' or 'be unfaithful to.'"}],"priority":"★★☆"},"related_words":{"derivatives":["two-timing (noun/adjective: the act of being a two-timer; characteristic of a two-timer)"],"phrasal_verbs":[],"idioms_phrases":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Two-timer' is a noun used to describe someone who is romantically unfaithful, meaning they have a secret relationship with someone other than their primary partner. It implies deception and betrayal. The term is relatively common in informal conversation and media, but less frequent in formal writing. It's important to note the negative connotation associated with this word."},"example_sentences":[{"sentence":"Everyone knew he was a **two-timer**, but she still fell for him.","translation":"彼は浮気者だと誰もが知っていたが、彼女はそれでも彼に惚れてしまった。","type":"noun","meaning_category":"浮気者"},{"sentence":"She couldn't believe her boyfriend was a **two-timer**.","translation":"彼女は彼氏が二股をかけているなんて信じられなかった。","type":"noun","meaning_category":"浮気者"},{"sentence":"Being a **two-timer** is never a good idea; it always leads to heartbreak.","translation":"二股をかけるのは決して良いことではない。必ず心の痛手につながる。","type":"noun","meaning_category":"浮気者"}]}