{"word":"Ionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)古代ギリシアのイオニア地方の文化・言語・芸術の特徴、またはそれらへの傾倒。","english_definition":"The characteristics of the culture, language, and art of ancient Ionia in Greece, or an adherence to them.","examples":[{"sentence":"Ionism influenced early Greek philosophy and science.","translation":"イオニア主義は初期のギリシア哲学と科学に影響を与えた。"},{"sentence":"The architectural style of the temple reflects Ionism.","translation":"その神殿の建築様式はイオニア主義を反映している。"}],"collocations":["influence of Ionism","elements of Ionism","characteristics of Ionism"],"synonyms":["Ionianism","Ionian culture","Ionian influence"],"antonyms":[]},{"part_of_speech":"noun","definition":"(言語学)古代ギリシア語のイオニア方言の特徴。","english_definition":"The characteristics of the Ionian dialect of ancient Greek.","examples":[{"sentence":"Ionism is evident in the writings of Herodotus.","translation":"ヘロドトスの著作にはイオニア主義が明らかである。"},{"sentence":"The text exhibits Ionism in its vocabulary and grammar.","translation":"そのテキストは語彙と文法においてイオニア主義を示している。"}],"collocations":["linguistic Ionism","features of Ionism","examples of Ionism"],"synonyms":["Ionian dialect","Ionian Greek"],"antonyms":[]}],"etymology":{"value":"Derived from \"Ionia,\" the ancient Greek region, with the suffix \"-ism\" denoting a characteristic, condition, or doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪəˌnɪzəm/","syllables":"I-o-nism"},"inflection":{"notes":"Noun, singular only."},"usage_notes":{"explanation":"\"Ionism\" refers to the cultural, linguistic, and artistic attributes associated with ancient Ionia, a region in Greece. It can also specifically denote features of the Ionian dialect of ancient Greek. The term is primarily used in historical, linguistic, and art historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced Ionism in his daily life.","correct":"✓ He studied Ionism in ancient history.","note":"\"Ionism\" is not a practice but a characteristic or study of Ionian culture."}],"priority":"★★☆"},"related_words":{"derivatives":["Ionian (adjective, noun)"],"phrases":["Ionian School of Philosophy","Ionian League"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ionism\" is a specialized term primarily used in the context of ancient Greek history, linguistics, and art history. It refers to the characteristics associated with the region of Ionia and its influence. Understanding requires familiarity with ancient Greek history and culture."},"example_sentences":[{"sentence":"The vase exhibits clear signs of Ionism in its design.","translation":"その花瓶のデザインにはイオニア主義の明確な兆候が見られる。","type":"noun","meaning_category":"文化・芸術の特徴"},{"sentence":"Scholars analyze texts for evidence of Ionism in the language.","translation":"学者たちは言語におけるイオニア主義の証拠を求めてテキストを分析する。","type":"noun","meaning_category":"言語の特徴"}]}