{"word":"tritely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"陳腐に、使い古されたように、ありきたりに","english_definition":"in a trite manner; in a way that is dull or stale because of overuse.","examples":[{"sentence":"He tritely remarked that all's fair in love and war.","translation":"彼は恋と戦争では手段を選ばないという陳腐なことを言った。"},{"sentence":"The story was tritely told, lacking any originality.","translation":"その物語は陳腐に語られ、独創性に欠けていた。"},{"sentence":"She tritely expressed her condolences, sounding insincere.","translation":"彼女はありきたりな弔いの言葉を述べ、不誠実に聞こえた。"}],"collocations":["speak tritely","write tritely","express tritely","remark tritely","state tritely","say tritely"],"synonyms":["banally","clichédly"," Hackneyed","stale","pedestrianly","unoriginally","commonplace"],"antonyms":["originally","freshly","creatively","imaginatively","unconventionally"]}],"etymology":{"value":"The word \"tritely\" is derived from \"trite,\" which comes from the Latin word \"tritus,\" the past participle of \"terere,\" meaning \"to rub, wear away.\" This etymology reflects the idea that something trite has been used so much that it has lost its freshness and impact.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtraɪtli/","syllables":"tri-te-ly"},"inflection":{"notes":"As an adverb, \"tritely\" does not have different inflections."},"usage_notes":{"explanation":"\"Tritely\" describes the manner in which something is expressed or done. It implies a lack of originality or freshness, often due to overuse or repetition. The term is typically used to criticize or negatively evaluate the way something is communicated or presented. It suggests that the expression or action is predictable, uninspired, and lacking in genuine thought or feeling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She tritely felt sad about the news.","correct":"✓ She tritely expressed her sadness about the news.","note":"\"Tritely\" describes how something is expressed, not the feeling itself. Use it with verbs of communication or expression, like \"expressed,\" \"said,\" or \"wrote.\""},{"incorrect":"✗ The tritely song was a hit.","correct":"✓ The trite song was a hit.","note":"\"Tritely\" is an adverb, so it modifies verbs, adverbs, or adjectives. To describe the song itself as unoriginal, use the adjective \"trite.\""}],"priority":"★★☆"},"related_words":{"derivatives":["trite (adjective:陳腐な、使い古された、ありきたりな)","triteness (noun:陳腐さ、使い古されたこと、ありきたりであること)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tritely\" means doing or saying something in a way that is boring and unoriginal because it has been said or done so many times before. It's used to describe how someone expresses themselves, implying a lack of creativity or sincerity. For example, if someone \"tritely\" offers condolences, it means they say something that sounds like a cliché and doesn't seem heartfelt. It's not a common word, so you'll mostly find it in more advanced or formal writing."},"example_sentences":[{"sentence":"The politician **tritely** repeated his well-worn promises.","translation":"政治家は使い古された公約を陳腐に繰り返した。","type":"adverb","meaning_category":"陳腐に繰り返す"},{"sentence":"She **tritely** described the sunset as 'beautiful,' offering no unique perspective.","translation":"彼女は夕焼けを『美しい』と陳腐に表現し、独自の視点を提供しなかった。","type":"adverb","meaning_category":"陳腐に表現する"},{"sentence":"The author **tritely** used the same plot devices in every novel.","translation":"その作家はどの小説でも同じプロットの仕掛けを陳腐に使った。","type":"adverb","meaning_category":"陳腐に使う"}]}