{"word":"undefiledly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"純粋に、汚されずに、けがれなく","english_definition":"In an undefiled manner; purely; without contamination or impurity.","examples":[{"sentence":"She lived undefiledly, untouched by the corruption around her.","translation":"彼女は周りの堕落に染まらず、純粋に生きた。"},{"sentence":"The ancient manuscript was preserved undefiledly for centuries.","translation":"その古代の写本は何世紀にもわたって汚されずに保存された。"}],"collocations":["live undefiledly","preserved undefiledly"],"synonyms":["purely","immaculately","spotlessly","untaintedly","unblemishedly"],"antonyms":["defiledly","impurely","taintedly","corruptedly"]}],"etymology":{"value":"'Undefiled' (not defiled) + '-ly' (adverbial suffix). 'Defile' comes from Old French 'defouler', meaning 'to trample on, pollute'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌndɪˈfaɪldli","syllables":"un-di-filed-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Undefiledly' is an adverb that describes an action or state performed or existing without being corrupted, polluted, or tainted. It emphasizes the purity and lack of any negative influence or contamination. It is a relatively rare word, often used in contexts that involve moral or spiritual purity, or the preservation of something in its original, pristine condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The water flowed undefiledly with pollution.","correct":"✓ The water flowed undefiledly, free from pollution.","note":"'Undefiledly' means without defilement. If something is polluted, it cannot be described as acting 'undefiledly'. Instead, describe the state of being free from pollution."}],"priority":"★☆☆"},"related_words":{"derivatives":["undefiled (adjective: not defiled, pure)","defile (verb: to pollute, taint, corrupt)","defilement (noun: the act of defiling or the state of being defiled)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undefiledly' is an advanced word that means 'in a pure and untainted manner'. It's used to describe something that is free from any kind of corruption, pollution, or impurity. Because it's not commonly used, it's more likely to appear in formal writing or when emphasizing the purity or integrity of something. It is formed by adding the suffix '-ly' to the adjective 'undefiled', which means 'not defiled' or 'pure'."},"example_sentences":[{"sentence":"The artist approached the canvas undefiledly, ready to create something truly original.","translation":"アーティストは、真に独創的なものを創造する準備をして、汚されずにキャンバスに向かった。","type":"adverb","meaning_category":"purely"},{"sentence":"The researcher analyzed the data undefiledly, ensuring no personal bias influenced the results.","translation":"研究者は、個人的な偏見が結果に影響を与えないように、データを汚されずに分析した。","type":"adverb","meaning_category":"without contamination"}]}