{"word":"nonpromulgation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律・規則などの)不公布、未公布","english_definition":"The act or state of not promulgating (a law, rule, or decree).","examples":[{"sentence":"The nonpromulgation of the new regulations caused confusion among the employees.","translation":"新しい規則が公布されなかったため、従業員の間で混乱が生じた。"},{"sentence":"The government's nonpromulgation of the report raised concerns about transparency.","translation":"政府が報告書を公布しなかったことは、透明性に対する懸念を引き起こした。"}],"collocations":["nonpromulgation of laws","nonpromulgation of regulations","nonpromulgation of a decree"],"synonyms":["suppression","withholding","non-disclosure","concealment"],"antonyms":["promulgation","publication","announcement","disclosure"]}],"etymology":{"value":"Derived from \"promulgation\" (the act of formally proclaiming or declaring a law or rule), with the addition of the prefix \"non-\" indicating negation or absence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnprɒməlˈɡeɪʃən/","syllables":"non-pro-mul-ga-tion"},"inflection":{"noun_plural":"nonpromulgations"},"usage_notes":{"explanation":"\"Nonpromulgation\" refers specifically to the failure to officially announce or publish a law, regulation, or decree. It implies a deliberate or unintentional withholding of information that is intended to be made public. This term is often used in legal or governmental contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonpromulgation was due to a lack of interest.","correct":"✓ The nonpromulgation was due to a lack of consensus.","note":"Nonpromulgation is usually due to specific reasons like lack of consensus, legal issues, or strategic decisions, not simply a lack of interest."}],"priority":"★☆☆"},"related_words":{"derivatives":["promulgate (verb): to promote or make widely known (an idea or cause).","promulgation (noun): the action of promulgating or making widely known.","non- (prefix): a prefix meaning \"not\" or \"absence of\"."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonpromulgation\" is a formal and technical term, primarily used in legal and governmental contexts. It describes the act of not officially announcing or publishing a law, regulation, or decree. Understanding this word requires familiarity with legal and administrative processes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The nonpromulgation of the environmental protection act drew criticism from activist groups.","translation":"環境保護法の不公布は、活動家グループからの批判を招いた。","type":"general","meaning_category":"General"},{"sentence":"The company cited legal concerns as the reason for the nonpromulgation of the safety guidelines.","translation":"会社は、安全ガイドラインの不公布の理由として法的懸念を挙げた。","type":"legal/corporate","meaning_category":"Legal/Corporate"}]}