{"word":"avell","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) A type of hazelnut.","english_definition":"A type of hazelnut, especially one from Avella in Italy.","examples":[{"sentence":"The recipe calls for avells, which are known for their rich flavor.","translation":"そのレシピではアヴェッルが指定されています。アヴェッルはその豊かな風味で知られています。"}],"collocations":["use avells","roast avells","Italian avells"],"synonyms":["hazelnut","filbert"],"antonyms":[]}],"etymology":{"value":"From the Latin 'avellana nux', meaning 'hazelnut from Avella'. Avella was an ancient town in Italy (now Avella, Campania) known for its hazelnuts.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈvɛl/","syllables":"a-vell"},"inflection":{"noun_plural":"avells"},"usage_notes":{"explanation":"'Avell' is a relatively rare term for a hazelnut, specifically referring to those originating from Avella, Italy. It is more commonly used in culinary contexts or when discussing specific varieties of hazelnuts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some avels at the store.","correct":"✓ I bought some avells at the store.","note":"The plural form 'avells' is generally used when referring to multiple hazelnuts."}],"priority":"★☆☆"},"related_words":{"derivatives":["avellana (Latin name)"],"related_terms":["hazel","nut","filbert"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Avell' is a specialized term, mostly encountered in culinary descriptions or historical texts related to Italian agriculture. It's not part of everyday vocabulary, so understanding requires some familiarity with food terminology or regional Italian products."},"example_sentences":[{"sentence":"The chef insisted on using only the finest avells in his hazelnut praline.","translation":"シェフは、ヘーゼルナッツプラリネに最高級のアヴェッルのみを使用することにこだわった。","type":"noun","meaning_category":"hazelnut"},{"sentence":"Historically, the region of Avella was renowned for the cultivation of avells.","translation":"歴史的に、アヴェッラの地域はアヴェッルの栽培で有名だった。","type":"noun","meaning_category":"hazelnut"}]}