{"word":"privately-resolved","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"解決済み、非公開解決済み、個人的に解決済み","english_definition":"Describes a situation, problem, or dispute that has been settled or resolved in a private or confidential manner, without public disclosure or intervention.","examples":[{"sentence":"The matter was privately-resolved between the parties involved.","translation":"その件は関係者間で非公開に解決されました。"},{"sentence":"They chose to keep the details of the privately-resolved agreement confidential.","translation":"彼らは個人的に解決された合意の詳細を秘密にすることを選びました。"},{"sentence":"The issue was privately-resolved to avoid further public scrutiny.","translation":"問題は、さらなる公の監視を避けるために、非公開で解決されました。"}],"collocations":["privately-resolved dispute","privately-resolved agreement","privately-resolved matter","privately-resolved issue","privately-resolved settlement"],"synonyms":["confidentially settled","secretly resolved","amicably settled","quietly resolved","discreetly resolved"],"antonyms":["publicly disclosed","publicly resolved","openly settled","publicly adjudicated"]}],"etymology":{"value":"Combination of 'privately' (in a private or confidential manner) and 'resolved' (having been settled or decided).","priority":"N/A"},"pronunciation":{"ipa":"/ˌpraɪvɪtli rɪˈzɒlvd/","syllables":"pri-vate-ly re-solved"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Privately-resolved' is used to indicate that a situation or conflict has been settled without involving public knowledge or formal processes like court proceedings. It emphasizes the confidentiality and discretion involved in reaching a resolution. The term is often used in legal, business, or personal contexts where privacy is important.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The problem was resolved privately.","correct":"The problem was privately-resolved.","note":"While 'The problem was resolved privately' is grammatically correct and conveys a similar meaning, 'privately-resolved' as a compound adjective emphasizes the state of being resolved in a private manner."}],"priority":"N/A"},"related_words":{"derivatives":["private","resolve","resolution"],"related_terms":["out-of-court settlement","confidential agreement","private arbitration","mediation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Privately-resolved' is a compound adjective indicating that a matter has been settled confidentially, without public disclosure or formal legal proceedings. It is often used in legal, business, or personal contexts where maintaining privacy is important. The term implies a deliberate choice to avoid publicity and resolve the issue discreetly."},"example_sentences":[{"sentence":"The company announced that the lawsuit had been privately-resolved, but provided no further details.","translation":"会社は、訴訟が非公開で解決されたことを発表しましたが、それ以上の詳細は提供しませんでした。","type":"adjective","meaning_category":"解決済み、非公開解決済み"},{"sentence":"The dispute between the neighbors was privately-resolved through mediation.","translation":"隣人同士の紛争は、調停を通じて非公開で解決されました。","type":"adjective","meaning_category":"解決済み、個人的に解決済み"},{"sentence":"The terms of the privately-resolved agreement remain confidential.","translation":"個人的に解決された合意の条件は機密のままです。","type":"adjective","meaning_category":"解決済み、非公開解決済み"}]}