{"word":"electrotropic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"電場によって影響を受ける、または電場に対する反応を示す","english_definition":"Exhibiting or relating to electrotropism; influenced by or responding to an electric field.","examples":[{"sentence":"The electrotropic behavior of certain crystals is well-documented.","translation":"特定の結晶の電場屈性挙動は十分に文書化されている。"},{"sentence":"Electrotropic effects can be observed in some liquid crystals.","translation":"電場屈性効果は、いくつかの液晶で見ることができる。"}],"collocations":["electrotropic effect","electrotropic behavior","electrotropic material","electrotropic response"],"synonyms":["electroresponsive","field-sensitive"],"antonyms":["electroinsensitive","field-insensitive"]}],"etymology":{"value":"'electro-' (電気) + '-tropic' (方向に向かう、影響を受ける)","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˈtrɑpɪk/","syllables":"e-lec-tro-trop-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級は通常 more electrotropic / most electrotropic となります。"},"usage_notes":{"explanation":"'Electrotropic' describes materials or organisms that exhibit electrotropism, which is the directional growth or movement in response to an electric field. This term is often used in the context of physics, chemistry, and biology to describe the behavior of crystals, liquid crystals, cells, or other substances when exposed to an electric field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed an electrotropic response to light.","correct":"✓ The plant showed a phototropic response to light.","note":"Electrotropism is a response to an electric field, not light. The response to light is phototropism."}],"priority":"★★☆"},"related_words":{"derivatives":["electrotropism (名詞: 電場屈性)"],"phrasal_verbs":[],"related_terms":["phototropic","geotropic","thigmotropic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Electrotropic' is a specialized term used in scientific contexts to describe the property of being influenced or directed by an electric field. Understanding this term requires knowledge of basic scientific concepts related to electricity and directional responses in materials or organisms. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers investigated the electrotropic properties of the novel polymer.","translation":"研究者たちはその新しいポリマーの電場屈性特性を調査した。","type":"general","meaning_category":"general"},{"sentence":"Electrotropic alignment of nanoparticles can be achieved by applying a strong electric field.","translation":"ナノ粒子の電場屈性整列は、強い電場を印加することによって達成できる。","type":"technical","meaning_category":"technical"}]}