{"word":"corviform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カラスのような形をした、カラス科の鳥に似た","english_definition":"Having the form or shape of a crow; resembling a bird of the family Corvidae.","examples":[{"sentence":"The corviform structure of the antenna helps the insect detect subtle movements in the air.","translation":"その触覚のカラスのような形状は、昆虫が空気中の微妙な動きを検出するのに役立つ。"},{"sentence":"The artist's sculpture had a distinct corviform quality, with sharp angles and a dark, glossy finish.","translation":"その芸術家の彫刻は、鋭い角度と暗くて光沢のある仕上げで、独特のカラスのような性質を持っていた。"}],"collocations":["corviform beak","corviform silhouette","corviform structure"],"synonyms":["crow-shaped","raven-like","corvine"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'corvus' (crow or raven) and 'formis' (shape or form).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɔːrvɪfɔːrm/","syllables":"cor-vi-form"},"inflection":{"notes":"Adjectives do not inflect in English, aside from comparative and superlative forms, which are rarely used with this word."},"usage_notes":{"explanation":"'Corviform' is a relatively uncommon word, primarily used in scientific or descriptive contexts where the shape or characteristics of something are being compared to those of crows or related birds. It is more frequently encountered in technical or specialized writing.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["corvid (noun: a bird of the family Corvidae)","corvine (adjective: relating to or resembling crows or ravens)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'corviform' is a technical term, not commonly used in everyday language. Its use is typically limited to scientific or highly descriptive contexts where a specific comparison to the shape or characteristics of crows or similar birds is necessary."},"example_sentences":[{"sentence":"The drone was designed with a corviform profile to minimize wind resistance.","translation":"そのドローンは、風の抵抗を最小限に抑えるために、カラスのような形状で設計された。","type":"adjective","meaning_category":"shape"},{"sentence":"The architectural detail featured a corviform gargoyle perched atop the building.","translation":"その建築のディテールは、建物の上に配置されたカラスのようなガーゴイルを特徴としていた。","type":"adjective","meaning_category":"resemblance"}]}