{"word":"Scheuchzeriaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) イヌイバラモ科の","english_definition":"(botany) Belonging or pertaining to the plant family Scheuchzeriaceae.","examples":[{"sentence":"Scheuchzeriaceous plants are typically found in boggy or marshy environments.","translation":"イヌイバラモ科の植物は通常、湿地や沼地の環境で見られる。"}],"collocations":["Scheuchzeriaceous plants","Scheuchzeriaceous habitat"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the family name 'Scheuchzeriaceae' + '-ous' (suffix indicating belonging or resemblance). The family is named after the Swiss naturalists Johann Jakob Scheuchzer and his brother Johann Gaspar Scheuchzer.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʃɔɪt͡sɜːriˈeɪʃəs/","syllables":"Scheuch-zer-i-a-ce-ous"},"inflection":{},"usage_notes":{"explanation":"This term is primarily used in botanical contexts to describe characteristics or classifications related to the plant family Scheuchzeriaceae.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Scheuchzeriaceae (noun): The plant family to which this adjective refers.","Scheuchzeria (noun): The genus within the Scheuchzeriaceae family."],"related_terms":["monocotyledon","aquatic plant","bog plant"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Scheuchzeriaceous' is a highly specialized botanical term. It is used by botanists and plant scientists to describe plants that belong to or are related to the plant family Scheuchzeriaceae. Due to its specific and technical nature, it is unlikely to be encountered outside of academic or professional contexts related to botany."},"example_sentences":[{"sentence":"The fossil pollen was identified as belonging to a Scheuchzeriaceous species, indicating a wetland environment in the past.","translation":"化石の花粉はイヌイバラモ科の種に属すると特定され、過去に湿地の環境があったことを示している。","type":"adjective","meaning_category":"イヌイバラモ科の"}]}