{"word":"annullably","priority":"low","meanings":[{"part_of_speech":"adverb","definition":"無効にできる形で、取り消し可能な状態で","english_definition":"In a manner that can be annulled; in a way that is voidable or capable of being invalidated.","examples":[{"sentence":"The contract was annullably formed due to a lack of proper consent.","translation":"その契約は適切な同意がなかったため、無効にできる形で成立した。"},{"sentence":"The decision was annullably made, pending further review.","translation":"その決定は、さらなる検討を保留して、無効にできる形で下された。"}],"collocations":["annullably formed","annullably made","annullably defective"],"synonyms":["voidably","revocably","invalidatable","rescindably"],"antonyms":["irrevocably","unalterably","unrepealably","permanently"]}],"etymology":{"value":"Derived from 'annullable' (capable of being annulled) with the addition of the adverbial suffix '-ly'. 'Annullable' comes from 'annul' (to declare void) + '-able' (capable of). 'Annul' comes from Old French 'anuller' and ultimately from Latin 'ad nullum' (to nothing).","priority":"low"},"pronunciation":{"ipa":"/əˈnʌləbli/","syllables":"an-nul-la-bly"},"inflection":{"notes":"Adverbs do not typically inflect, but this adverb is derived from an adjective."},"usage_notes":{"explanation":"'Annullably' is a relatively rare adverb used in legal or formal contexts to describe something that can be legally or officially declared void. It indicates the potential for something to be invalidated or cancelled.","priority":"low"},"common_mistakes":{"examples":[{"incorrect":"The agreement was annulled, so it was annullably.","correct":"The agreement was annulled because it was annullable.","note":"'Annullably' is an adverb, modifying a verb or adjective. 'Annullable' is an adjective describing the agreement."}],"priority":"low"},"related_words":{"derivatives":["annul (verb)","annulment (noun)","annullable (adjective)","annulling (adjective)"],"phrases":["capable of being annulled","subject to annulment"],"priority":"low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Annullably' is a highly specialized term primarily used in legal or formal contexts. It describes the manner in which something can be voided or invalidated. Understanding requires familiarity with legal terminology and concepts related to contracts, agreements, and decisions. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The election results were determined to be annullably flawed due to widespread irregularities.","translation":"その選挙結果は、広範囲にわたる不正行為により、無効にできるほど欠陥があると判断された。","type":"adverb","meaning_category":"voidable"},{"sentence":"The contract was entered into under duress, making it annullably binding.","translation":"その契約は強要の下で締結されたため、無効にできる拘束力を持つものとなった。","type":"adverb","meaning_category":"revocable"}]}