{"word":"faculty-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"教員に焦点を当てた、教員中心の","english_definition":"Designed or intended to primarily benefit or address the needs of faculty members.","examples":[{"sentence":"The university is implementing a new faculty-focused professional development program.","translation":"大学は、教員中心の新しい専門能力開発プログラムを導入しています。"},{"sentence":"This grant supports faculty-focused research initiatives.","translation":"この助成金は、教員中心の研究イニシアチブを支援します。"},{"sentence":"The center provides faculty-focused resources and support services.","translation":"センターは、教員中心のリソースとサポートサービスを提供しています。"}],"collocations":["faculty-focused program (教員中心のプログラム)","faculty-focused research (教員中心の研究)","faculty-focused development (教員中心の育成)","faculty-focused support (教員中心のサポート)"],"synonyms":["teacher-centered","professor-oriented"],"antonyms":["student-focused","learner-centered"]}],"etymology":{"value":"A compound word formed by combining 'faculty' (referring to the teaching staff of a university or college) and 'focused' (meaning having one's attention or interest directed at something specific).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfækəlti ˈfoʊkəst/","syllables":"fac-ul-ty-fo-cused"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Faculty-focused' is used to describe initiatives, programs, resources, or services that are specifically designed to meet the needs and interests of faculty members, typically in an academic setting. It emphasizes that the primary target audience is the teaching staff rather than students or other groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The student-focused program also included faculty-focused elements.","correct":"✓ The student-focused program also included elements beneficial to faculty.","note":"Avoid using 'faculty-focused' to describe elements that are merely beneficial to faculty within a student-focused program. Use it when the primary intention is to serve faculty."}],"priority":"★☆☆"},"related_words":{"derivatives":["faculty (noun)","focus (verb, noun)","focused (adjective)"],"related_terms":["student-focused","staff-focused","research-focused","teaching-focused"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic or educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Faculty-focused' is a specialized term primarily used in higher education contexts. It describes something specifically designed to benefit or target faculty members. Understanding requires familiarity with academic jargon and the distinction between faculty, staff, and students within an educational institution."},"example_sentences":[{"sentence":"The workshop provides faculty-focused training on innovative teaching methods.","translation":"このワークショップでは、革新的な教育方法に関する教員中心のトレーニングを提供しています。","type":"adjective","meaning_category":"教員中心の"},{"sentence":"The new policy is designed to be more faculty-focused, giving professors greater autonomy in curriculum design.","translation":"新しいポリシーは、教員中心になるように設計されており、教授にカリキュラム設計におけるより大きな自主性を提供します。","type":"adjective","meaning_category":"教員中心の"},{"sentence":"The university's strategic plan includes several faculty-focused initiatives aimed at improving research productivity.","translation":"大学の戦略計画には、研究生産性の向上を目的としたいくつかの教員中心のイニシアチブが含まれています。","type":"adjective","meaning_category":"教員中心の"}]}