{"word":"pleochromatic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"多色性の、多色鏡で見られる","english_definition":"Exhibiting pleochroism; showing different colors when viewed from different angles with polarized light.","examples":[{"sentence":"The mineral is pleochromatic, displaying different colors depending on the orientation of the light.","translation":"その鉱物は多色性を示し、光の向きによって異なる色を表示する。"}],"collocations":["pleochromatic mineral","pleochromatic halo"],"synonyms":["dichromatic","trichromatic"],"antonyms":["monochromatic"]}],"etymology":{"value":"From Greek πλέων (pleōn, “more”) + χρῶμα (khrōma, “color”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpliːoʊkrəˈmætɪk/","syllables":"ple-o-chro-mat-ic"},"inflection":{"notes":"Comparative: more pleochromatic, superlative: most pleochromatic"},"usage_notes":{"explanation":"Used primarily in mineralogy and optics to describe substances that show different colors depending on the angle of light passing through them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting is pleochromatic.","correct":"✓ The painting is polychromatic.","note":"Pleochromatic refers specifically to the property of certain minerals and crystals to show different colors with polarized light, whereas polychromatic refers to having many colors in general, often used to describe paintings or other artworks."}],"priority":"★★☆"},"related_words":{"derivatives":["pleochroism (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pleochromatic' is a technical term used in the fields of mineralogy and optics. It describes the property of certain materials, especially minerals, to exhibit different colors when viewed under polarized light from different angles. This term is not commonly used in everyday language and is typically encountered in scientific or technical contexts."},"example_sentences":[{"sentence":"The gemologist identified the stone as pleochromatic using a specialized microscope.","translation":"宝石学者は、特殊な顕微鏡を使ってその石が多色性であることを確認した。","type":"adjective","meaning_category":"多色性の"},{"sentence":"Analysis revealed that the crystal's pleochromatic properties were due to its unique chemical composition.","translation":"分析により、その結晶の多色性の特性は、そのユニークな化学組成によるものであることが明らかになった。","type":"adjective","meaning_category":"多色性の"}]}