{"word":"Gipsy","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ジプシー、ロマ (差別的な意味合いを含む場合がある)","english_definition":"(Often offensive) A member of a traditionally itinerant people who originated in northern India and now live chiefly in Europe and North America; a Romani person.","examples":[{"sentence":"The Gipsies were known for their nomadic lifestyle.","translation":"ジプシーは遊牧民的な生活様式で知られていた。"},{"sentence":"Some people consider the term 'Gipsy' to be offensive.","translation":"「ジプシー」という言葉を侮辱的だと考える人もいる。"}],"collocations":["Gipsy caravan","Gipsy music","Gipsy culture"],"synonyms":["Romani","Roma","Traveler"],"antonyms":[],"usage_notes":"The term 'Gipsy' is often considered offensive due to its historical association with discrimination and stereotypes. The preferred term is 'Romani' or 'Roma'."},{"part_of_speech":"adjective","definition":"ジプシーの、ロマの (差別的な意味合いを含む場合がある)","english_definition":"(Often offensive) Relating to or characteristic of Gipsies or their language or culture.","examples":[{"sentence":"Gipsy music is characterized by its passionate and lively melodies.","translation":"ジプシー音楽は情熱的で活発なメロディーが特徴である。"},{"sentence":"The Gipsy lifestyle is often romanticized in literature.","translation":"ジプシーのライフスタイルは文学でしばしばロマンチックに描かれる。"}],"collocations":["Gipsy lifestyle","Gipsy traditions","Gipsy language"],"synonyms":["Romani","Roma"],"antonyms":[]}],"etymology":{"value":"The word 'Gipsy' is derived from 'Egyptian,' reflecting the mistaken belief that the Romani people originated in Egypt.","priority":"中"},"pronunciation":{"ipa":"/ˈdʒɪpsi/","syllables":"Gip-sy"},"inflection":{"noun_plural":"Gipsies"},"usage_notes":{"explanation":"The term 'Gipsy' is often considered derogatory and offensive. It's based on a historical misconception about the origin of the Romani people. The preferred and more respectful terms are 'Romani' (for the people as a whole) and 'Roma' (for individual members). When referring to their language, 'Romani' is also the correct term. Be mindful of the potential negative connotations when using this word.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"It's okay to use the word 'Gipsy' without thinking about it.","correct":"It's better to use the term 'Romani' or 'Roma' to avoid causing offense.","note":"Using 'Gipsy' without awareness of its potential to offend is insensitive."}],"priority":"中"},"related_words":{"derivatives":["Gipsyish"],"related_terms":["Romani","Roma","Traveler","Itinerant"]},"level_frequency":{"frequency_google_ngram":"Low","CEFR":"Not applicable"},"readability_explanation":{"level":"C2","text":"The word 'Gipsy' is a sensitive term. While historically used to refer to the Romani people, it's now often considered offensive due to its association with negative stereotypes and discrimination. It's best to use the terms 'Romani' or 'Roma' instead to show respect. The term 'Traveler' can also be used in some contexts, but it's important to be aware of the specific group you're referring to, as it can also refer to other itinerant groups. Always prioritize respectful and accurate language when discussing any cultural or ethnic group."},"example_sentences":[{"sentence":"(Avoid) The Gipsies traveled across Europe in their caravans.","translation":"(避ける) ジプシーはキャラバンでヨーロッパ中を旅した。","type":"noun","meaning_category":"People (offensive)"},{"sentence":"(Preferred) The Romani people have a rich cultural heritage.","translation":"(推奨) ロマの人々は豊かな文化遺産を持っている。","type":"noun","meaning_category":"People (preferred)"},{"sentence":"(Avoid) Gipsy music is known for its passionate melodies.","translation":"(避ける) ジプシー音楽は情熱的なメロディーで知られている。","type":"adjective","meaning_category":"Culture (offensive)"},{"sentence":"(Preferred) Romani music is known for its passionate melodies.","translation":"(推奨) ロマ音楽は情熱的なメロディーで知られている。","type":"adjective","meaning_category":"Culture (preferred)"}]}