{"word":"transindividual","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"個を超えた、個体間的な、超個体的な","english_definition":"Extending beyond or transcending the individual; relating to or involving multiple individuals or a collective.","examples":[{"sentence":"The transindividual nature of culture shapes individual behavior.","translation":"文化の超個体的な性質が個人の行動を形作る。"},{"sentence":"Social movements are often driven by transindividual forces.","translation":"社会運動はしばしば超個体的な力によって推進される。"},{"sentence":"The concept of transindividual memory suggests that memories are not solely individual possessions.","translation":"超個体的な記憶の概念は、記憶が単に個人の所有物ではないことを示唆する。"}],"collocations":["transindividual memory","transindividual experience","transindividual identity","transindividual consciousness","transindividual perspective"],"synonyms":["collective","interindividual","social","communal","supraindividual"],"antonyms":["individual","personal","private"]},{"part_of_speech":"noun","definition":"個を超えた存在、超個体的なもの","english_definition":"Something that exists beyond or transcends the individual; a collective or shared entity.","examples":[{"sentence":"Language can be seen as a transindividual that shapes thought.","translation":"言語は思考を形作る超個体的なものと見なすことができる。"},{"sentence":"The internet has become a transindividual space for communication and collaboration.","translation":"インターネットはコミュニケーションとコラボレーションのための超個体的な空間になった。"}],"collocations":["the transindividual","a transindividual","transindividuals"],"synonyms":["collective","shared entity","social construct"],"antonyms":["individual","private entity"]}],"etymology":{"value":"Derived from the prefix 'trans-' (across, beyond) and 'individual'. It suggests something that goes beyond the boundaries of a single individual.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænsɪndɪˈvɪdʒuəl/","syllables":"trans-in-di-vi-du-al"},"inflection":{"noun_plural":"transindividuals"},"usage_notes":{"explanation":"The term 'transindividual' is often used in philosophy, sociology, and psychology to describe phenomena that cannot be fully understood by focusing solely on the individual. It emphasizes the interconnectedness and interdependence of individuals within a larger social or cultural context. It's often associated with theories that challenge individualistic perspectives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The individual is not important, only the transindividual matters.","correct":"✓ Both the individual and the transindividual are important and influence each other.","note":"It's important to avoid the extreme view that only the collective matters. The individual and the transindividual are often seen as mutually influencing each other."},{"incorrect":"✗ Transindividual means the same as international.","correct":"✓ Transindividual refers to something beyond the individual, while international refers to something between nations.","note":"'Transindividual' and 'international' have different meanings. 'Transindividual' relates to what goes beyond the individual, while 'international' relates to interactions between nations."}],"priority":"★★☆"},"related_words":{"derivatives":["transindividuality"],"related_concepts":["collective consciousness","social constructivism","systems theory","relational ontology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transindividual' is a complex term used in academic contexts, particularly in philosophy and social sciences. It refers to concepts or phenomena that extend beyond the individual, emphasizing the interconnectedness and shared aspects of human existence. Understanding this term requires familiarity with theoretical frameworks that challenge individualistic perspectives and focus on collective or relational aspects of reality. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The development of language is a **transindividual** process, shaped by collective use and transmission.","translation":"言語の発展は、集団的な使用と伝達によって形作られる、超個体的なプロセスである。","type":"adjective","meaning_category":"個を超えた"},{"sentence":"The **transindividual** is not simply the sum of individuals, but a new level of organization with its own properties.","translation":"超個体的なものは、単に個人の合計ではなく、独自の特性を持つ新しいレベルの組織である。","type":"noun","meaning_category":"個を超えた存在"},{"sentence":"Understanding **transindividual** dynamics is crucial for addressing complex social problems.","translation":"複雑な社会問題に対処するには、超個体的なダイナミクスを理解することが重要である。","type":"adjective","meaning_category":"個を超えた"}]}