{"word":"RFE","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Request for Evidence（証拠書類提出要求）の略","english_definition":"Abbreviation for \"Request for Evidence,\" a request from a government agency (often the USCIS in the United States) for additional documentation or information needed to process an application or petition.","examples":[{"sentence":"The USCIS issued an RFE for my green card application.","translation":"USCISは私のグリーンカード申請に対してRFEを発行しました。"},{"sentence":"I received an RFE asking for more financial documents.","translation":"追加の財務書類を求めるRFEを受け取りました。"},{"sentence":"Responding to an RFE promptly is crucial for a successful application.","translation":"RFEに迅速に対応することは、申請を成功させるために非常に重要です。"}],"collocations":["receive an RFE","respond to an RFE","USCIS RFE","RFE letter","RFE response"],"synonyms":["request for information","additional documentation request"],"antonyms":[]}],"etymology":{"value":"An acronym formed from the initial letters of the words \"Request for Evidence\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrˌɛfˈiː/","syllables":"R-F-E (ar-ef-ee)"},"inflection":{"notes":"Plural: RFEs"},"usage_notes":{"explanation":"An RFE is a formal request, typically from a government agency, asking an applicant to provide more evidence to support their claim. It is common in immigration processes but can occur in other bureaucratic contexts. The applicant must respond within a specified timeframe, or the application may be denied.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I got a RFE for my application.","correct":"✓ I received an RFE for my application.","note":"While \"got\" is understandable, \"received\" is more formal and commonly used in this context."},{"incorrect":"✗ The RFE ask me to send more documents.","correct":"✓ The RFE asks me to send more documents.","note":"The subject is singular (The RFE), so the verb should be \"asks\"."},{"incorrect":"✗ I am sending the respond to the RFE.","correct":"✓ I am sending the response to the RFE.","note":"\"Respond\" is a verb. The noun form is \"response\"."}],"priority":"★★☆"},"related_words":{"derivatives":["request","evidence","USCIS","petition","application"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (specific to legal/immigration contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"RFE\" stands for \"Request for Evidence.\" It's a term mainly used in legal and immigration contexts, especially in the United States. If you're applying for something like a visa or green card, the government agency (like USCIS) might send you an RFE. This means they need more documents or information from you to make a decision on your application. It's important to respond to an RFE quickly and completely to avoid delays or denial of your application."},"example_sentences":[{"sentence":"The lawyer advised her to gather all the necessary documents to respond to the RFE.","translation":"弁護士は彼女に、RFEに対応するために必要なすべての書類を集めるようにアドバイスしました。","type":"noun","meaning_category":"証拠書類提出要求"},{"sentence":"Ignoring the RFE could lead to the denial of your application.","translation":"RFEを無視すると、申請が却下される可能性があります。","type":"noun","meaning_category":"証拠書類提出要求"},{"sentence":"He carefully reviewed the RFE letter to understand what additional information was needed.","translation":"彼は、どのような追加情報が必要かを理解するために、RFEの手紙を注意深く見直しました。","type":"noun","meaning_category":"証拠書類提出要求"}]}