{"word":"jinxing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"縁起の悪いことを言う、不吉なことを言う、(幸運を)台無しにする","english_definition":"to bring bad luck to (someone or something)","examples":[{"sentence":"I didn't want to jinx it by talking about it.","translation":"それについて話して縁起を悪くしたくなかった。"},{"sentence":"Are you trying to jinx us?","translation":"私たちに不吉なことを言おうとしているの？"}],"collocations":["jinx something","jinx someone"],"synonyms":["curse","hex","put the evil eye on"],"antonyms":["bless","bring good luck"],"notes":"Often used in the context of sports or competitions, where people believe that talking about a positive outcome before it happens can cause it to fail."}],"etymology":{"value":"From the noun 'jinx,' which has uncertain origins. One theory suggests it comes from the bird 'jynx' (wryneck), which was used in witchcraft and divination.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɪŋksɪŋ/","syllables":"jinx-ing"},"inflection":{"verb_forms":{"present_simple":["jinx"],"past_simple":"jinxed","past_participle":"jinxed","present_participle":"jinxing"}},"usage_notes":{"explanation":"'Jinxing' refers to the act of speaking about something positive before it happens, which is believed to cause bad luck and prevent the positive outcome from occurring. It is often used in informal contexts and is associated with superstition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is jinxing for good luck.","correct":"✓ He is jinxing us.","note":"'Jinxing' usually takes a direct object (the person or thing being jinxed). It is not used to bring good luck."}],"priority":"★★☆"},"related_words":{"derivatives":["jinx (noun): a person or thing that brings bad luck","jinx (verb): to bring bad luck to someone or something"],"idioms_phrases":["none common"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Jinxing' means saying something that you believe will cause bad luck, especially if you talk about something good that might happen before it actually does. It's often used when people are superstitious and worried about tempting fate. For example, if a team is winning a game, someone might say, \"Don't talk about it, you'll jinx it!\""},"example_sentences":[{"sentence":"I didn't want to say anything about the project succeeding, in case I was jinxing it.","translation":"プロジェクトが成功することについて何か言いたくなかった、縁起を悪くするかもしれないから。","type":"verb","meaning_category":"縁起の悪いことを言う"},{"sentence":"Every time I mention how well my car is running, I feel like I'm jinxing it.","translation":"車がどれだけ調子よく走っているか言うたびに、縁起を悪くしているような気がする。","type":"verb","meaning_category":"縁起の悪いことを言う"}]}