{"word":"denationalization","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"国有化解除、民営化","english_definition":"The transfer of ownership of something from the government to private individuals or companies.","examples":[{"sentence":"The government is planning the denationalization of several major industries.","translation":"政府はいくつかの主要産業の民営化を計画している。"},{"sentence":"Denationalization can lead to increased efficiency and competition.","translation":"民営化は効率と競争の増加につながる可能性がある。"}],"collocations":["complete denationalization","partial denationalization","mass denationalization","accelerate denationalization","reverse denationalization"],"synonyms":["privatization","deregulation"],"antonyms":["nationalization","state control"]},{"part_of_speech":"noun","definition":"国籍剥奪","english_definition":"The act of depriving someone of their nationality.","examples":[{"sentence":"The denationalization of political dissidents is a violation of human rights.","translation":"政治的反体制派の国籍剥奪は人権侵害である。"},{"sentence":"International law prohibits the arbitrary denationalization of individuals.","translation":"国際法は個人の恣意的な国籍剥奪を禁じている。"}],"collocations":["arbitrary denationalization","mass denationalization","illegal denationalization"],"synonyms":["deprivation of nationality","loss of citizenship"],"antonyms":["naturalization","granting of citizenship"]}],"etymology":{"value":"Formed from the prefix 'de-' (meaning 'removal' or 'reversal'), 'nationalization' (the process of bringing something under national control), and the suffix '-ation' (indicating a process or state).","priority":"Medium"},"pronunciation":{"ipa":"/ˌdiːˌnæʃənəlɪˈzeɪʃən/","syllables":"de-na-tion-al-i-za-tion"},"inflection":{"noun_plural":"denationalizations"},"usage_notes":{"explanation":"'Denationalization' has two distinct meanings: the reversal of nationalization (privatization) and the deprivation of nationality. The context usually makes it clear which meaning is intended. In economics and politics, it typically refers to privatization. In legal and human rights contexts, it refers to the removal of citizenship.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The denationalization of the company made it more national.","correct":"The denationalization of the company made it less national.","note":"Denationalization means the opposite of nationalization, so it reduces state control."},{"incorrect":"Denationalization is the same as deportation.","correct":"Denationalization is not the same as deportation.","note":"Denationalization is the removal of citizenship, while deportation is the expulsion from a country."}],"priority":"Medium"},"related_words":{"derivatives":["denationalize (verb)","denationalized (adjective)"],"phrasal_verbs":[],"related_concepts":["privatization","nationalization","citizenship","nationality","human rights"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Denationalization' is a complex term with two primary meanings. In economics, it refers to the process of transferring ownership of state-owned assets to the private sector (privatization). In law and political science, it refers to the act of depriving a person of their citizenship. The context is crucial to understanding which meaning is intended. The word is relatively uncommon and typically encountered in advanced academic or professional discussions.","priority":"Medium"},"example_sentences":[{"sentence":"The government's denationalization policy has been controversial.","translation":"政府の民営化政策は物議を醸している。","type":"noun","meaning_category":"Privatization"},{"sentence":"The denationalization of the former political prisoner was widely condemned.","translation":"元政治囚の国籍剥奪は広く非難された。","type":"noun","meaning_category":"Deprivation of Nationality"}]}