{"word":"language-supportive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"言語をサポートする、言語学習を支援する、言語に配慮した","english_definition":"Designed or intended to support or facilitate language learning or the use of multiple languages.","examples":[{"sentence":"This school offers a language-supportive environment for immigrant children.","translation":"この学校は、移民の子供たちのために言語学習を支援する環境を提供しています。"},{"sentence":"The software includes language-supportive features such as multilingual spell-check and translation tools.","translation":"そのソフトウェアには、多言語スペルチェックや翻訳ツールなど、言語学習を支援する機能が含まれています。"},{"sentence":"We need to create language-supportive policies to ensure equal access to education.","translation":"教育への平等なアクセスを確保するために、言語に配慮した政策を策定する必要があります。"}],"collocations":["language-supportive environment","language-supportive features","language-supportive policies","language-supportive classroom","language-supportive curriculum","language-supportive approach","language-supportive strategies"],"synonyms":["language-friendly","linguistically sensitive","multilingual-friendly","language-enhancing","language-accommodating"],"antonyms":["language-restrictive","language-unfriendly","linguistically insensitive"]},{"part_of_speech":"adjective","definition":"（特に教育において）様々な言語的背景を持つ学習者を支援する","english_definition":"(Especially in education) supporting learners from diverse linguistic backgrounds.","examples":[{"sentence":"The teacher used language-supportive strategies to help the English language learners understand the lesson.","translation":"先生は、英語学習者が授業を理解できるように、言語学習を支援する戦略を用いました。"},{"sentence":"A language-supportive school provides resources and programs for students with different language needs.","translation":"言語をサポートする学校は、さまざまな言語ニーズを持つ生徒のためにリソースとプログラムを提供します。"}],"collocations":["language-supportive teaching","language-supportive education","language-supportive school","language-supportive teacher"],"synonyms":["inclusive","accessible","differentiated","equitable"],"antonyms":["exclusive","segregated"]}],"etymology":{"value":"The word is formed by combining \"language\" (referring to a system of communication), \"supportive\" (providing assistance or encouragement), and joining them with a hyphen to create a compound adjective.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈlæŋɡwɪdʒ səˈpɔːrtɪv/","syllables":"lan-guage-sup-por-tive"},"inflection":{"notes":"Adjective, does not have plural forms."},"usage_notes":{"explanation":"\"Language-supportive\" is commonly used in educational and technological contexts to describe systems, environments, or approaches that are designed to assist individuals in learning or using languages effectively. It emphasizes inclusivity and accessibility for people with diverse linguistic backgrounds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ language supportive","correct":"✓ language-supportive","note":"The term is usually hyphenated when used as a compound adjective before a noun."},{"incorrect":"✗ language supporting","correct":"✓ language-supportive","note":"The correct form is 'language-supportive,' not 'language supporting.'"}],"priority":"★☆☆"},"related_words":{"derivatives":["support (noun, verb)","supportive (adjective)","language (noun)"],"related_terms":["multilingual","bilingual","linguistics","language acquisition","language learning"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"language-supportive\" is a specialized adjective often used in educational and linguistic contexts. It describes something designed to help people learn or use languages effectively, especially those with diverse language backgrounds. Understanding this term requires familiarity with discussions about language learning and inclusivity in education.","priority":"★★☆"},"example_sentences":[{"sentence":"The new curriculum is designed to be language-supportive, catering to students from various linguistic backgrounds.","translation":"新しいカリキュラムは、さまざまな言語的背景を持つ生徒に対応できるように、言語をサポートするように設計されています。","type":"adjective","meaning_category":"言語学習を支援する"},{"sentence":"The library offers a range of language-supportive resources, including dictionaries, language learning software, and conversation groups.","translation":"図書館では、辞書、語学学習ソフトウェア、会話グループなど、言語学習を支援するさまざまなリソースを提供しています。","type":"adjective","meaning_category":"言語学習を支援する"},{"sentence":"Creating a language-supportive classroom involves using visual aids, simplified language, and collaborative activities.","translation":"言語をサポートする教室を作るには、視覚教材、簡略化された言語、共同作業を使用することが含まれます。","type":"adjective","meaning_category":"言語学習を支援する"}]}