{"word":"astrocyte","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"星状膠細胞（せいじょうこうさいぼう）","english_definition":"A star-shaped glial cell of the central nervous system.","examples":[{"sentence":"Astrocytes are the most abundant glial cells in the brain.","translation":"星状膠細胞は脳内で最も豊富なグリア細胞です。"},{"sentence":"Astrocytes play a crucial role in maintaining the blood-brain barrier.","translation":"星状膠細胞は血液脳関門の維持に重要な役割を果たします。"}],"collocations":["reactive astrocyte","astrocyte activation","astrocyte network","astrocyte function","astrocyte morphology"],"synonyms":["glial cell","neuroglia"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'astron' (ἄστρον) meaning 'star' and 'kytos' (κύτος) meaning 'cell', referring to their star-like shape.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæstroʊˌsaɪt/","syllables":"as-tro-cyte"},"inflection":{"noun_plural":"astrocytes"},"usage_notes":{"explanation":"Astrocytes are a type of glial cell, which are non-neuronal cells in the central nervous system (CNS). They are characterized by their star-like shape and are the most abundant glial cells in the brain. Astrocytes perform various functions, including maintaining the chemical environment of the CNS, providing structural support for neurons, and participating in the formation and maintenance of the blood-brain barrier.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrocytes are neurons.","correct":"✓ Astrocytes are glial cells.","note":"Astrocytes are not neurons; they are a type of glial cell that supports neurons."},{"incorrect":"✗ Astrocytes have axons.","correct":"✓ Astrocytes do not have axons.","note":"Astrocytes do not have axons like neurons do. They have processes that extend from the cell body."}],"priority":"★★☆"},"related_words":{"derivatives":["astrocytic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'astrocyte' is a specialized term primarily used in the fields of neuroscience, biology, and medicine. It refers to a specific type of cell in the central nervous system. Understanding this term requires a background in these scientific disciplines. The word itself is derived from Greek roots, reflecting its scientific origin. While not commonly used in everyday language, it is essential for those studying or working in related fields."},"example_sentences":[{"sentence":"The researchers investigated the role of astrocytes in neuroinflammation.","translation":"研究者たちは神経炎症における星状膠細胞の役割を調査した。","type":"scientific context","meaning_category":"星状膠細胞"},{"sentence":"Changes in astrocyte morphology can indicate neurological disorders.","translation":"星状膠細胞の形態の変化は神経疾患を示す可能性がある。","type":"medical context","meaning_category":"星状膠細胞"}]}