{"word":"synallactic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"相互的な、双務的な","english_definition":"Relating to or involving mutual obligations or agreements; reciprocal.","examples":[{"sentence":"A synallactic contract involves obligations on both sides.","translation":"双務契約は双方に義務を伴う。"}],"collocations":["synallactic contract","synallactic agreement"],"synonyms":["reciprocal","mutual","bilateral","interdependent"],"antonyms":["unilateral"]}],"etymology":{"value":"From the Greek word 'synallaktikos' (συναλλακτικός), meaning 'pertaining to exchange or transaction,' derived from 'synallasso' (συναλλάσσω), meaning 'to exchange, to transact with each other,' itself from 'syn-' (συν-) meaning 'together' and 'allasso' (ἀλλάσσω) meaning 'to change, to exchange.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪnəˈlæktɪk/","syllables":"syn-al-lac-tic"},"inflection":{"notes":"Comparative and superlative forms are possible but rare: more synallactic, most synallactic."},"usage_notes":{"explanation":"The term 'synallactic' is primarily used in legal and philosophical contexts to describe relationships or agreements where both parties have obligations to each other. It emphasizes the interdependence and reciprocity of the arrangement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relationship was synallactic because one person always gave more.","correct":"✓ The relationship was not synallactic because one person always gave more.","note":"A synallactic relationship requires mutual exchange and balanced obligations. If one party consistently gives more, it is not truly synallactic."}],"priority":"★☆☆"},"related_words":{"derivatives":["synallactically (adverb)"],"phrases":["Synallagmatic contract"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'synallactic' is a highly specialized term primarily used in legal and philosophical discussions. It describes situations, especially contracts or agreements, where both parties have reciprocal obligations. Understanding this word requires a strong grasp of abstract concepts and formal vocabulary. Due to its rarity and specific context, it is unlikely to be encountered outside of academic or professional settings.","priority":"★☆☆"},"example_sentences":[{"sentence":"The agreement was deemed synallactic, as both parties had enforceable obligations.","translation":"その合意は、両当事者が強制力のある義務を負っていたため、双務的であるとみなされた。","type":"adjective","meaning_category":"Mutual obligation"},{"sentence":"In a synallactic contract, the failure of one party to perform their obligations can excuse the other party's performance.","translation":"双務契約では、一方の当事者が義務を履行しない場合、他方の当事者の履行が免除されることがある。","type":"adjective","meaning_category":"Legal context"}]}