{"word":"unenjoined","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)禁止されていない、差し止められていない","english_definition":"not prohibited or restrained by an injunction.","examples":[{"sentence":"The activity remained unenjoined, despite concerns raised by local residents.","translation":"地元の住民から懸念が提起されたにもかかわらず、その活動は禁止されなかった。"},{"sentence":"The company continued its operations, as its actions were unenjoined by the court.","translation":"裁判所によってその活動が差し止められなかったため、会社は操業を継続した。"}],"collocations":["remain unenjoined","continue unenjoined","be unenjoined by the court"],"synonyms":["unrestrained","unprohibited","unhindered","unimpeded"],"antonyms":["enjoined","prohibited","restrained","forbidden"]}],"etymology":{"value":"\"Un-\" (not) + \"enjoined\" (past participle of \"enjoin\"). \"Enjoin\" comes from Old French \"enjoindre,\" from Latin \"injungere\" (to attach, impose), from \"in-\" (in, on) + \"jungere\" (to join).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪnˈdʒɔɪnd/","syllables":"un-en-joined"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Unenjoined\" is a relatively rare and formal word, primarily used in legal contexts. It describes actions or activities that have not been prohibited or restrained by a court order (injunction). It is the opposite of \"enjoined,\" which means to be ordered or prohibited from doing something by a court.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The happiness was unenjoined.","correct":"✓ The happiness was unconstrained.","note":"\"Unenjoined\" specifically refers to legal prohibitions. Use \"unconstrained\" or a similar word for general lack of restraint. "},{"incorrect":"✗ The party was unenjoined.","correct":"✓ The party was unhindered.","note":"Again, \"unenjoined\" is specific to legal injunctions. Use \"unhindered\" or \"unrestrained\" for other situations."}],"priority":"★★☆"},"related_words":{"derivatives":["enjoin (verb)","injunction (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unenjoined\" is a formal and legal term, meaning not prohibited or restrained by a court order (injunction). It is primarily used in legal and formal contexts. Due to its specific and technical meaning, it is not commonly used in everyday language. Understanding the term requires familiarity with legal concepts such as injunctions."},"example_sentences":[{"sentence":"The construction project proceeded, as it was unenjoined by any legal action.","translation":"建設プロジェクトは、法的措置によって差し止められなかったため、続行された。","type":"adjective","meaning_category":"not prohibited"},{"sentence":"Despite public outcry, the demonstration remained unenjoined by the authorities.","translation":"世論の抗議にもかかわらず、デモは当局によって禁止されなかった。","type":"adjective","meaning_category":"not prohibited"}]}