{"word":"vagabondism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"放浪癖、放浪生活、浮浪","english_definition":"The state or condition of being a vagabond; wandering from place to place without a fixed home or means of support.","examples":[{"sentence":"His vagabondism led him to travel across the country.","translation":"彼の放浪癖が彼を全国を旅させた。"},{"sentence":"Vagabondism is often associated with poverty and lack of opportunity.","translation":"放浪生活はしばしば貧困や機会の欠如と関連付けられる。"}],"collocations":["lead to vagabondism","associated with vagabondism","lifestyle of vagabondism"],"synonyms":["wandering","nomadism","roaming","trampdom","drifting"],"antonyms":["settled life","stability","domicile"]},{"part_of_speech":"noun","definition":"(法律)浮浪罪","english_definition":"(Law) The offense or condition of being a vagrant; homelessness and lack of regular employment.","examples":[{"sentence":"In some jurisdictions, vagabondism is still considered a crime.","translation":"いくつかの司法管轄区域では、浮浪罪は依然として犯罪とみなされている。"},{"sentence":"Laws against vagabondism have been criticized for targeting the homeless.","translation":"浮浪罪に対する法律は、ホームレスを標的にしているとして批判されている。"}],"collocations":["laws against vagabondism","crime of vagabondism","punishment for vagabondism"],"synonyms":["vagrancy","homelessness","loitering"],"antonyms":["employment","residence"]}],"etymology":{"value":"From 'vagabond' + '-ism'. 'Vagabond' comes from Late Latin 'vagabundus' (wandering), from 'vagari' (to wander).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæɡəbɒndɪzəm/","syllables":"vag-a-bon-dism"},"inflection":{"noun_plural":"vagabondisms (rarely used)"},"usage_notes":{"explanation":"'Vagabondism' refers to the state or practice of wandering without a permanent home or regular employment. It can describe a chosen lifestyle or a condition forced by circumstances like poverty. In legal contexts, it may refer to the offense of vagrancy, though laws against vagabondism are increasingly seen as discriminatory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He enjoyed vagabondism as a hobby.","correct":"He enjoyed vagabondism as a lifestyle.","note":"'Vagabondism' is a state or condition, not an activity like a hobby. It's better to say 'lifestyle' or 'way of life'."},{"incorrect":"Vagabondism is a good thing for society.","correct":"Vagabondism can be a complex social issue.","note":"'Vagabondism' is often associated with negative conditions such as poverty and homelessness, so it is not generally considered a 'good thing' for society."}],"priority":"★☆☆"},"related_words":{"derivatives":["vagabond (noun/adjective)","vagabondize (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vagabondism' is a relatively uncommon word that describes the state or practice of wandering without a fixed home or means of support. It often carries negative connotations, suggesting poverty or lack of social integration. The word is more likely to be encountered in historical or legal contexts than in everyday conversation."},"example_sentences":[{"sentence":"The romantic allure of vagabondism often clashes with the harsh realities of life on the road.","translation":"放浪生活のロマンチックな魅力は、しばしば路上生活の厳しい現実と衝突する。","type":"general","meaning_category":"放浪生活"},{"sentence":"The city struggled to address the issues arising from increased vagabondism in the downtown area.","translation":"市は、都心部における放浪生活の増加から生じる問題に対処するのに苦労した。","type":"general","meaning_category":"放浪生活"},{"sentence":"Historical laws against vagabondism aimed to control the movement of the poor and unemployed.","translation":"歴史的な浮浪罪に対する法律は、貧困層や失業者の移動を管理することを目的としていた。","type":"legal","meaning_category":"(法律)浮浪罪"}]}