{"word":"myotome","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"筋節、ミオトーム（体節由来の筋肉群）","english_definition":"a group of muscles innervated by a single spinal nerve root; also, the muscle-forming region of a somite in a developing embryo.","examples":[{"sentence":"The myotome is responsible for specific movements of the body.","translation":"筋節は体の特定の動きを担う。"},{"sentence":"Damage to a spinal nerve can affect the function of the corresponding myotome.","translation":"脊髄神経の損傷は、対応する筋節の機能に影響を与える可能性がある。"},{"sentence":"During embryonic development, the myotome differentiates into various skeletal muscles.","translation":"胚発生中、筋節はさまざまな骨格筋に分化する。"}],"collocations":["spinal nerve myotome","cervical myotome","lumbar myotome","myotome testing","assess myotome function"],"synonyms":["muscle group","segmental muscle","somitic muscle"],"antonyms":[]},{"part_of_speech":"noun","definition":"（魚類の）筋肉体節","english_definition":"one of the series of muscle segments along the trunk of fishes.","examples":[{"sentence":"The myotomes of a fish allow it to swim with powerful undulations.","translation":"魚の筋肉体節は、強力なうねりで泳ぐことを可能にする。"},{"sentence":"The arrangement of myotomes in fish contributes to their efficient locomotion.","translation":"魚の筋肉体節の配置は、効率的な移動に貢献する。"}],"collocations":["fish myotome","muscle segment","myotome arrangement"],"synonyms":["muscle segment","somite"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'myo-' meaning 'muscle' and '-tome' meaning 'segment' or 'cutting'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmaɪətoʊm","syllables":"my-o-tome"},"inflection":{"noun_plural":"myotomes"},"usage_notes":{"explanation":"A myotome refers to a group of muscles innervated by a single spinal nerve root. Assessing myotome function is part of a neurological examination to identify potential nerve damage. In embryology, it refers to the part of a somite that forms muscles. In fish anatomy, it refers to a muscle segment along the trunk.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dermatome controls muscle movement.","correct":"✓ The myotome controls muscle movement.","note":"A dermatome is an area of skin innervated by a single spinal nerve, while a myotome is a group of muscles innervated by a single spinal nerve."}],"priority":"★★☆"},"related_words":{"derivatives":["myomere","sclerotome","dermatome","somite"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'myotome' is a specialized anatomical term used in medicine, embryology, and zoology. It refers to a group of muscles innervated by a single spinal nerve root or the muscle-forming region of a somite. Understanding this term requires a background in anatomy or developmental biology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The L5 myotome is tested by assessing dorsiflexion of the foot.","translation":"L5筋節は足の背屈を評価することで検査される。","type":"noun","meaning_category":"筋節（脊髄神経支配領域）"},{"sentence":"The zebrafish myotome is a model for studying muscle development.","translation":"ゼブラフィッシュの筋節は筋肉発達を研究するためのモデルである。","type":"noun","meaning_category":"筋肉体節（魚類）"}]}