{"word":"in-office","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"現職の、在職中の","english_definition":"Currently holding a particular office or position.","examples":[{"sentence":"The in-office president is running for re-election.","translation":"現職の大統領が再選を目指して立候補している。"},{"sentence":"The in-office administration has faced several challenges.","translation":"現政権はいくつかの課題に直面している。"}],"collocations":["in-office president","in-office administration","in-office official"],"synonyms":["incumbent","sitting","present"],"antonyms":["former","out-of-office"]},{"part_of_speech":"adverb","definition":"オフィス内で、オフィス勤務で","english_definition":"Performed or occurring within an office setting; physically present in the office.","examples":[{"sentence":"The company is transitioning back to in-office work after a period of remote work.","translation":"その会社はリモートワーク期間を経て、オフィス勤務に戻りつつある。"},{"sentence":"In-office collaboration is essential for some teams.","translation":"オフィス内での共同作業は、一部のチームにとって不可欠だ。"}],"collocations":["in-office work","in-office collaboration","in-office meeting"],"synonyms":["on-site","at the office"],"antonyms":["remote","work-from-home"]}],"etymology":{"value":"Combination of 'in' (preposition indicating location) and 'office' (place of work or a position of authority). The adjective usage likely evolved from describing activities or individuals physically located 'in' the office.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪn ˈɔːfɪs/","syllables":"in-of-fice"},"inflection":{"notes":"Typically used as an adjective. The adverbial sense is often expressed with a hyphen (in-office)."},"usage_notes":{"explanation":"The term 'in-office' can have two primary meanings depending on the context. As an adjective, it describes someone currently holding a position of authority, often in government or business. As an adverb (often hyphenated), it refers to activities or work done within the physical office space, as opposed to remotely.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the in office manager.","correct":"✓ He is the in-office manager. / ✓ He is the manager in the office.","note":"When used to describe someone working at the office, it's better to use 'in-office' (with a hyphen) or rephrase the sentence. Without the hyphen, it might be interpreted as 'the manager who is currently holding the position'."},{"incorrect":"✗ The in office president made a statement.","correct":"✓ The in-office president made a statement.","note":"When referring to someone holding an official position, 'in-office' should be hyphenated to clearly indicate it's a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["office","officer","official","inoffice (archaic spelling variant)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but usage is increasing with discussions about remote vs. in-office work.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'In-office' is a compound term that can function as an adjective or adverb. As an adjective, it describes someone currently holding a position of authority (e.g., 'the in-office president'). As an adverb, it describes activities or work done within a physical office space (e.g., 'in-office collaboration'). Pay attention to the context to determine the intended meaning. The hyphenated form 'in-office' is often used when it functions as an adverb or a compound adjective modifying a noun."},"example_sentences":[{"sentence":"The **in-office** team is working on the new project.","translation":"オフィス勤務のチームが新しいプロジェクトに取り組んでいる。","type":"adjective","meaning_category":"オフィス内で"},{"sentence":"The **in-office** senator voted on the bill.","translation":"現職の上院議員がその法案に投票した。","type":"adjective","meaning_category":"現職の"},{"sentence":"Many companies are debating the benefits of **in-office** versus remote work.","translation":"多くの企業がオフィス勤務とリモートワークの利点を議論している。","type":"adjective","meaning_category":"オフィス内で"},{"sentence":"Our company has a hybrid model, with some days being **in-office** and others remote.","translation":"当社はハイブリッドモデルを採用しており、オフィス勤務の日もあればリモートの日もある。","type":"adjective","meaning_category":"オフィス内で"}]}