{"word":"right-sidedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"右側に、右側を向いて、右側から","english_definition":"In a manner that favors or is directed towards the right side; with the right side facing or oriented.","examples":[{"sentence":"The pattern was asymmetrically designed, with the heavier elements arranged right-sidedly.","translation":"そのパターンは非対称にデザインされており、より重い要素が右側に配置されていた。"},{"sentence":"He adjusted the mirror so that he could see right-sidedly down the street.","translation":"彼は通りを右側から見下ろせるように鏡を調整した。"}],"collocations":["arranged right-sidedly","oriented right-sidedly","facing right-sidedly"],"synonyms":["dextrally","to the right","on the right side"],"antonyms":["left-sidedly","sinistrally","to the left"]}],"etymology":{"value":"Formed from 'right-sided' (adjective) + '-ly' (adverbial suffix). The adjective 'right-sided' combines 'right' (referring to the right side) and 'sided' (having a side or sides).","priority":"★★★"},"pronunciation":{"ipa":"/ˈraɪtˌsaɪdɪdli/","syllables":"right-sid-ed-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Right-sidedly' indicates a direction, orientation, or arrangement that is predominantly or specifically towards the right side. It is often used in descriptive contexts where the asymmetry or lateral positioning is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car drove right-sidedly on the road.","correct":"✓ The car drove on the right side of the road.","note":"In countries where driving is on the right, it's more common to say 'drove on the right side' rather than using 'right-sidedly'. 'Right-sidedly' is more descriptive of arrangement or orientation than of general action. "},{"incorrect":"✗ He right-sidedly looked at the painting.","correct":"✓ He looked at the painting from the right side.","note":"'Right-sidedly' isn't typically used to describe the act of looking. Instead, specify that the viewing was 'from the right side'."}],"priority":"★★☆"},"related_words":{"derivatives":["right-sided (adjective)","sidedly (adverb - general term for being on a side)"],"phrasal_verbs":[],"related_concepts":["laterality","asymmetry","dexterity"]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Right-sidedly' is a relatively uncommon adverb used to describe something oriented or arranged towards the right side. It is most likely to be encountered in technical or descriptive contexts where precise spatial relationships are important. Understanding the meaning of 'right-sided' is essential to interpreting this word."},"example_sentences":[{"sentence":"The tumor was located right-sidedly within the patient's abdomen.","translation":"腫瘍は患者の腹部の右側に位置していた。","type":"adverb","meaning_category":"location"},{"sentence":"The artist intentionally composed the painting with the dominant figure positioned right-sidedly.","translation":"アーティストは意図的に絵画を構成し、主要な人物を右側に配置した。","type":"adverb","meaning_category":"arrangement"},{"sentence":"The plant's leaves grew right-sidedly, creating an unbalanced appearance.","translation":"その植物の葉は右側に偏って成長し、不均衡な外観を作り出した。","type":"adverb","meaning_category":"growth"}]}