{"word":"ligar-se","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"reflexive","definition":"Unir-se, conectar-se, juntar-se; estabelecer uma ligação ou conexão.","english_definition":"To unite, connect, join; to establish a link or connection.","examples":[{"sentence":"Os fios precisam ligar-se corretamente para o circuito funcionar.","translation":"The wires need to connect properly for the circuit to work."},{"sentence":"As empresas decidiram ligar-se para formar um consórcio.","translation":"The companies decided to unite to form a consortium."},{"sentence":"É importante ligar-se a pessoas que compartilham seus interesses.","translation":"It's important to connect with people who share your interests."}],"collocations":["ligar-se a (pessoas, ideias, causas)","ligar-se por (interesses, objetivos)","ligar-se para (formar algo)"],"synonyms":["conectar-se","unir-se","juntar-se","associar-se","vincular-se"],"antonyms":["desligar-se","separar-se","desconectar-se","dissociar-se"]},{"part_of_speech":"verb","transitivity":"reflexive","definition":"Interessar-se por algo ou alguém; sentir afinidade ou simpatia.","english_definition":"To become interested in something or someone; to feel affinity or sympathy.","examples":[{"sentence":"Eu comecei a ligar-me por história quando visitei o museu.","translation":"I started to become interested in history when I visited the museum."},{"sentence":"Ele não consegue ligar-se a nenhum dos personagens do livro.","translation":"He can't connect with any of the characters in the book."},{"sentence":"É difícil ligar-se a uma causa que você não entende.","translation":"It's difficult to become interested in a cause that you don't understand."}],"collocations":["ligar-se a (assunto, pessoa, causa)","ligar-se emocionalmente","começar a ligar-se"],"synonyms":["interessar-se","apegar-se","identificar-se","simpatizar","envolver-se"],"antonyms":["desinteressar-se","afastar-se","distanciar-se"]},{"part_of_speech":"verb","transitivity":"reflexive","definition":"(Informal) Envolver-se romanticamente ou sexualmente com alguém.","english_definition":"(Informal) To become romantically or sexually involved with someone.","examples":[{"sentence":"Eles começaram a ligar-se na festa e agora estão namorando.","translation":"They started hooking up at the party and now they are dating."},{"sentence":"Ela não quer ligar-se a ninguém sério agora.","translation":"She doesn't want to get involved with anyone serious right now."}],"collocations":["ligar-se com (alguém)","começar a ligar-se","ligar-se casualmente"],"synonyms":["envolver-se","enamorar-se","apaixonar-se","flertar","ficar"],"antonyms":["desligar-se","separar-se","afastar-se"]}],"etymology":{"value":"Derivado do verbo 'ligar' (do latim 'ligare', amarrar, unir) com o pronome reflexivo 'se'.","priority":"low"},"pronunciation":{"ipa":"/liˈɡaɾ.se/","syllables":"li-gar-se"},"inflection":{"forms":["ligo-me","ligas-te","liga-se","ligamo-nos","ligais-vos","ligam-se"]},"usage_notes":{"explanation":"'Ligar-se' é um verbo reflexivo com múltiplos significados, dependendo do contexto. Pode significar unir-se fisicamente, conectar-se emocionalmente ou envolver-se romanticamente. A escolha do significado correto depende da situação.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"Eu ligo a você.","correct":"Eu ligo-me a você.","note":"O uso reflexivo é obrigatório em muitos contextos."}],"priority":"low"},"related_words":{"derivatives":["ligação","ligado"],"phrases":["ligar os pontos","ligar para alguém"]},"level_frequency":{"level":"B1","frequency_google_ngram":"Medium","priority":"low"},"readability_explanation":{"level":"B1","text":"'Ligar-se' significa conectar-se, unir-se ou interessar-se por algo. É um verbo reflexivo, então usa-se com pronomes reflexivos (me, te, se, nos, vos, se). Pode ser usado para descrever conexões físicas, emocionais ou românticas. Preste atenção ao contexto para entender o significado correto."},"example_sentences":[{"sentence":"Os cientistas tentam ligar-se a outros pesquisadores para trocar ideias.","translation":"Scientists try to connect with other researchers to exchange ideas.","type":"verb","meaning_category":"Unir-se"},{"sentence":"Ela começou a ligar-se à causa ambiental depois de assistir ao documentário.","translation":"She started to become interested in the environmental cause after watching the documentary.","type":"verb","meaning_category":"Interessar-se"},{"sentence":"Eles se ligaram durante as férias e começaram a namorar.","translation":"They hooked up during the vacation and started dating.","type":"verb","meaning_category":"Envolver-se romanticamente"}]}