{"word":"Gangliitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"神経節炎（しんけいせつえん）: 神経節の炎症","english_definition":"Inflammation of a ganglion, especially a sensory ganglion.","examples":[{"sentence":"Gangliitis can cause severe pain and neurological symptoms.","translation":"神経節炎は、激しい痛みや神経症状を引き起こす可能性があります。"}],"collocations":["Herpes zoster gangliitis (帯状疱疹神経節炎)"],"synonyms":["ganglionitis"],"antonyms":[]}],"etymology":{"value":"From 'ganglion' (神経節) + '-itis' (炎症を示す接尾辞).","priority":"★★★"},"pronunciation":{"ipa":"ˌɡæŋɡliˈaɪtɪs","syllables":"gang-gli-i-tis"},"inflection":{"noun_plural":"gangliitides"},"usage_notes":{"explanation":"Gangliitis is a medical term referring to the inflammation of a ganglion, most commonly a sensory ganglion. It is often associated with viral infections, such as herpes zoster (shingles), where the varicella-zoster virus infects and inflames the dorsal root ganglia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ganglionitis is the same as a ganglion cyst.","correct":"✓ Gangliitis is inflammation of a ganglion, while a ganglion cyst is a fluid-filled sac.","note":"Gangliitis is an inflammatory condition, whereas a ganglion cyst is a benign, fluid-filled lump. They are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["ganglion (神経節)","ganglioneuroma (神経節神経腫)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gangliitis' is a specialized medical term referring to the inflammation of a nerve ganglion. It is primarily used in medical contexts and is not commonly encountered in general language. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The patient was diagnosed with herpes zoster gangliitis.","translation":"患者は帯状疱疹神経節炎と診断された。","type":"medical","meaning_category":"inflammation"},{"sentence":"Severe pain is a common symptom of gangliitis.","translation":"激しい痛みは神経節炎の一般的な症状です。","type":"medical","meaning_category":"symptom"}]}