{"word":"unsecularly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非世俗的に、宗教的に","english_definition":"In a nonsecular or religious manner.","examples":[{"sentence":"The organization's activities were conducted unsecularly, with a strong emphasis on religious principles.","translation":"その組織の活動は、宗教的原則を強く重視し、非世俗的に行われた。"},{"sentence":"The issue was approached unsecularly, focusing on moral and spiritual considerations rather than practical ones.","translation":"その問題は、実用的な考慮事項よりも道徳的および精神的な考慮事項に焦点を当て、非世俗的にアプローチされた。"}],"collocations":["act unsecularly","approach a problem unsecularly","govern unsecularly"],"synonyms":["religiously","spiritually","piously"],"antonyms":["secularly","worldly","materially"]}],"etymology":{"value":"\"un-\" (否定) + \"secularly\" (世俗的に)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsɛkjələrli/","syllables":"un-sec-u-lar-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"'Unsecularly' is the adverbial form of 'unsecular,' meaning not secular or related to religious matters. It describes actions, behaviors, or approaches that are influenced by or based on religious beliefs or principles, rather than secular or worldly considerations. It is relatively uncommon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The decision was made unsecularly by the government.","correct":"✓ The decision was made in an unsecular manner by the government.","note":"While 'unsecularly' is grammatically correct, using 'in an unsecular manner' may sound more natural to some speakers. It's a matter of style and preference. However, both are acceptable."}],"priority":"★☆☆"},"related_words":{"derivatives":["unsecular (adjective)","secularly (adverb)","secular (adjective)","secularism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unsecularly' is a relatively rare and complex word. It means 'in a way that is not secular' or 'in a religious way'. It is used to describe actions or decisions that are based on religious beliefs rather than worldly considerations. Because of its rarity and specific meaning, it is more likely to be encountered in academic or specialized contexts dealing with religion, politics, or social issues."},"example_sentences":[{"sentence":"The school was run unsecularly, with daily prayers and religious instruction.","translation":"その学校は、毎日の祈りと宗教的な指導が行われ、非世俗的に運営されていた。","type":"general","meaning_category":"religious manner"},{"sentence":"The debate was framed unsecularly, focusing on moral absolutes rather than pragmatic solutions.","translation":"その議論は、実用的な解決策よりも道徳的な絶対性に焦点を当て、非世俗的に組み立てられた。","type":"general","meaning_category":"religious manner"}]}