{"word":"non-apportionable","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"分割できない、割り当て不能な","english_definition":"Not capable of being apportioned or divided.","examples":[{"sentence":"The responsibility for the error was deemed non-apportionable; one person had to take full blame.","translation":"そのエラーの責任は分割できないと判断され、一人が全責任を負わなければならなかった。"},{"sentence":"The benefits of the project are non-apportionable; they will be enjoyed by the entire community.","translation":"プロジェクトの恩恵は割り当て不能であり、コミュニティ全体が享受することになる。"}],"collocations":["non-apportionable cost","non-apportionable responsibility","non-apportionable benefit"],"synonyms":["indivisible","inseparable","non-divisible","whole","entire"],"antonyms":["apportionable","divisible","separable","partial"]}],"etymology":{"value":"Formed from the prefix 'non-' (meaning 'not') and the adjective 'apportionable' (meaning 'capable of being apportioned').","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒn əˈpɔːrʃənəbəl/","syllables":"non-ap-por-tion-a-ble"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are not commonly used with 'non-apportionable'."},"usage_notes":{"explanation":"'Non-apportionable' is used to describe something that cannot be fairly or practically divided or allocated among different parties or categories. It often appears in legal, financial, or administrative contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The task was non-apportionable between the team members.","correct":"The task was non-apportionable; it had to be done by one person.","note":"'Non-apportionable' describes the nature of the task itself, not the act of dividing it. Use it to indicate that something inherently cannot be divided."}],"priority":"Low"},"related_words":{"derivatives":["apportionable (adjective)","apportion (verb)","apportionment (noun)"],"phrases":["joint and several liability (often implies non-apportionable responsibility)"],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Non-apportionable' is a formal term indicating that something cannot be divided or allocated proportionally. It is often used in legal or financial contexts to describe responsibilities, costs, or benefits that must be assigned as a whole rather than distributed among multiple parties. Understanding the term requires a strong vocabulary and familiarity with abstract concepts."},"example_sentences":[{"sentence":"The court ruled that the damages were non-apportionable, and the defendant was liable for the full amount.","translation":"裁判所は、損害賠償は分割できないと判断し、被告は全額の責任を負うことになった。","type":"adjective","meaning_category":"Legal"},{"sentence":"The public good derived from the park is largely non-apportionable, benefiting all residents equally.","translation":"公園から得られる公共の利益は大部分が割り当て不能であり、すべての住民に平等に利益をもたらす。","type":"adjective","meaning_category":"General"}]}