{"word":"Homovanillic acid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ホモバニリン酸：ドーパミン代謝の主要な最終産物。脳脊髄液、血漿、尿中に見られ、ドーパミン作動性ニューロンの活性の指標として使用される。","english_definition":"A major dopamine metabolite found in cerebrospinal fluid, plasma, and urine; it is used as a measure of dopaminergic neuronal activity.","examples":[{"sentence":"Elevated levels of homovanillic acid in the cerebrospinal fluid may indicate increased dopamine turnover.","translation":"脳脊髄液中のホモバニリン酸のレベル上昇は、ドーパミン代謝回転の増加を示す可能性がある。"}],"collocations":["HVA levels","cerebrospinal fluid HVA","plasma HVA","urinary HVA","dopamine metabolite"],"synonyms":["HVA","3-methoxy-4-hydroxyphenylacetic acid"],"antonyms":[]}],"etymology":{"value":"'homo-' (same, similar) + 'vanillic' (referring to vanillin, a related compound) + 'acid' (chemical compound with acidic properties).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊmoʊvəˈnɪlɪk ˈæsɪd/","syllables":"ho-mo-va-nil-lic a-cid"},"inflection":{"noun_plural":"homovanillic acids"},"usage_notes":{"explanation":"Homovanillic acid (HVA) is primarily used in medical and research contexts. It is a key indicator of dopamine metabolism and is measured in various bodily fluids to assess dopaminergic activity. Elevated or decreased levels can be associated with neurological and psychiatric conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The homovanillic is a dopamine.","correct":"✓ Homovanillic acid is a dopamine metabolite.","note":"Homovanillic acid is a metabolite (breakdown product) of dopamine, not dopamine itself."},{"incorrect":"✗ HVA is a vitamin.","correct":"✓ HVA is a dopamine metabolite.","note":"HVA is not a vitamin; it's a metabolite of dopamine."}],"priority":"★★☆"},"related_words":{"derivatives":["vanillin","dopamine","metabolite"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Homovanillic acid (HVA) is a complex biochemical term primarily encountered in advanced scientific and medical contexts. Understanding requires knowledge of neurochemistry and dopamine metabolism. It is not part of general vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"Measurement of homovanillic acid in urine can be used to monitor treatment response in certain neurological disorders.","translation":"尿中のホモバニリン酸の測定は、特定の神経疾患における治療反応をモニタリングするために使用できる。","type":"scientific","meaning_category":"dopamine metabolite"},{"sentence":"Researchers are investigating the relationship between homovanillic acid levels and cognitive function.","translation":"研究者たちは、ホモバニリン酸のレベルと認知機能の間の関係を調査している。","type":"scientific","meaning_category":"dopamine metabolite"}]}