{"word":"abneural","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"神経から離れた、神経とは反対方向の","english_definition":"Away from a nerve or nervous system; in a direction opposite to that of a nerve.","examples":[{"sentence":"The abneural side of the cell is not directly innervated.","translation":"その細胞の神経から離れた側は、直接神経支配されていません。"},{"sentence":"Abneural transport mechanisms are responsible for moving substances away from the neuron.","translation":"神経から離れる方向への輸送メカニズムは、ニューロンから物質を移動させる役割を担っています。"}],"collocations":["abneural direction","abneural transport","abneural side"],"synonyms":["contraneural","distal to nerve"],"antonyms":["neural","neurad","proximal to nerve"]}],"etymology":{"value":"Formed from 'ab-' (away from) + 'neural' (relating to a nerve).","priority":"★★★"},"pronunciation":{"ipa":"/æbˈnjʊərəl/","syllables":"ab-neu-ral"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which are uncommon for this word)."},"usage_notes":{"explanation":"'Abneural' is a technical term primarily used in biology and medicine to describe a location or direction relative to a nerve. It indicates a position or movement away from the nerve or nervous system. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The muscle is abneural to the bone.","correct":"✓ The muscle is distal to the nerve.","note":"'Abneural' specifically refers to a direction or position relative to a nerve, not to other anatomical structures. Use 'distal' or another appropriate term to describe the relationship to other structures."}],"priority":"★★☆"},"related_words":{"derivatives":["abneurally (adverb, away from a nerve)"],"related_terms":["neural","neurad","innervation","neuron"]},"level_frequency":{"frequency_google_ngram":"Very low frequency. A specialized term used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Abneural' is a highly specialized term used in the fields of biology and medicine. It describes something that is oriented away from a nerve or the nervous system. Due to its limited usage, it is not a word commonly encountered outside of scientific literature and discussions. Understanding requires familiarity with anatomical and neurological terminology."},"example_sentences":[{"sentence":"The drug's effect was observed on the abneural surface of the tissue.","translation":"その薬の効果は、組織の神経から離れた表面で観察されました。","type":"general","meaning_category":"descriptive"},{"sentence":"Nutrient transport occurs in an abneural direction within the cell.","translation":"栄養素の輸送は、細胞内で神経から離れる方向に行われます。","type":"scientific","meaning_category":"physiological"}]}