{"word":"benevolist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who advocates or practices benevolence; a philanthropist.","english_definition":"A person who advocates or practices benevolence; a philanthropist.","examples":[{"sentence":"The benevolist donated a large sum of money to the local charity.","translation":"その博愛主義者は地元の慈善団体に多額の寄付をした。"},{"sentence":"She was known as a benevolist for her tireless work in helping the poor.","translation":"彼女は貧しい人々を助けるためのたゆまぬ努力から、博愛主義者として知られていた。"}],"collocations":["local benevolist","tireless benevolist","wealthy benevolist"],"synonyms":["philanthropist","humanitarian","altruist","do-gooder"],"antonyms":["misanthrope","egoist"]}],"etymology":{"value":"From 'benevolent' + '-ist'.","priority":"★★★"},"pronunciation":{"ipa":"/bəˈnevələst/","syllables":"be-nev-o-list"},"inflection":{"noun_plural":"benevolists"},"usage_notes":{"explanation":"The term 'benevolist' emphasizes the active practice of benevolence, often involving charitable acts and a desire to improve the well-being of others. It is closely related to 'philanthropist' but can sometimes imply a broader commitment to general goodwill and kindness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a benevolist person.","correct":"✓ He is a benevolent person.","note":"'Benevolist' is a noun referring to a person, while 'benevolent' is an adjective describing the quality of being kind and charitable."}],"priority":"★★☆"},"related_words":{"derivatives":["benevolence","benevolent"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Benevolist' is a relatively uncommon term referring to someone who actively practices benevolence, often through philanthropy or charitable work. It's a more specific term than simply being 'kind' and implies a deliberate and consistent effort to improve the well-being of others. The word is derived from 'benevolent,' meaning well-meaning and kindly. Understanding the suffix '-ist' helps to identify it as a noun describing a person who adheres to or practices a particular belief or activity."},"example_sentences":[{"sentence":"The foundation was established by a group of local benevolists.","translation":"その財団は地元の博愛主義者たちによって設立された。","type":"noun","meaning_category":"博愛主義者"},{"sentence":"As a benevolist, she dedicated her life to helping those in need.","translation":"博愛主義者として、彼女は困窮している人々を助けることに人生を捧げた。","type":"noun","meaning_category":"博愛主義者"}]}