{"word":"pre-baked","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"予(あらかじ)め焼(や)かれた、下焼(したや)きされた","english_definition":"baked partially or completely in advance.","examples":[{"sentence":"I bought a pre-baked pizza crust to save time.","translation":"時間節約のために、下焼きされたピザ生地を買いました。"},{"sentence":"These croissants are pre-baked and only need to be warmed up.","translation":"これらのクロワッサンは下焼きされており、温めるだけで済みます。"}],"collocations":["pre-baked pizza crust (下焼きピザ生地)","pre-baked bread (下焼きパン)","pre-baked pie shell (下焼きパイ生地)"],"synonyms":["partially baked","par-baked"],"antonyms":["raw","unbaked"]}],"etymology":{"value":"The word \"pre-baked\" is formed by adding the prefix \"pre-\" (meaning before or in advance) to the word \"baked\" (past participle of \"bake,\" meaning to cook by dry heat, typically in an oven).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈbeɪkt/","syllables":"pree-baked"},"inflection":{"notes":"Since it's an adjective, it doesn't have plural forms. Comparative and superlative forms are possible (more pre-baked, most pre-baked) but not common."},"usage_notes":{"explanation":"\"Pre-baked\" describes food items that have been baked to some extent before being sold or used. This can range from a partial baking (par-baking) where the item needs further baking to be fully cooked, to being fully baked and only needing to be reheated. It is often used for convenience foods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I pre-baked the cake yesterday, so it's already bake.","correct":"✓ I pre-baked the cake yesterday, so it's already baked.","note":"The past participle form 'baked' should be used after 'is' to indicate that the cake has already undergone the baking process."}],"priority":"★★☆"},"related_words":{"derivatives":["prebake (verb: to bake something partially or completely in advance)","bake (verb: to cook by dry heat)","baker (noun: a person who bakes)","bakery (noun: a place where baking is done)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively low frequency, but commonly understood.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"pre-baked\" means that something has been baked a little bit before you buy it. For example, you can buy a \"pre-baked pizza crust\" which means the dough has already been baked a little, and you just need to add toppings and bake it again to finish it. It's a convenient way to cook faster.","priority":"★★★"},"example_sentences":[{"sentence":"The bakery sells pre-baked loaves of bread that you can finish at home.","translation":"そのパン屋では、家で仕上げることができる下焼きされたパンを売っています。","type":"adjective","meaning_category":"下焼きされた"},{"sentence":"Using a pre-baked crust saved me a lot of time when making the quiche.","translation":"下焼きされた生地を使うことで、キッシュを作る際に多くの時間を節約できました。","type":"adjective","meaning_category":"下焼きされた"}]}