{"word":"philander","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(既婚男性が)浮気する、女性と遊ぶ","english_definition":"(of a man) to readily or frequently enter into casual sexual relationships with women; to have affairs.","examples":[{"sentence":"He was known to philander with younger women.","translation":"彼は若い女性と浮気をすることで知られていた。"},{"sentence":"She suspected her husband of philandering.","translation":"彼女は夫が浮気をしているのではないかと疑った。"},{"sentence":"The novel tells the story of a man who philanders throughout his marriage.","translation":"その小説は、結婚生活を通して浮気を繰り返す男の物語を描いている。"}],"collocations":["philander with someone","philander around"],"synonyms":["womanize","have affairs","cheat","stray","flirt","dally"],"antonyms":["be faithful","remain loyal"]},{"part_of_speech":"noun","definition":"浮気者、女たらし","english_definition":"a man who readily or frequently enters into casual sexual relationships with women.","examples":[{"sentence":"He was a notorious philanderer.","translation":"彼は悪名高い浮気者だった。"},{"sentence":"She divorced her husband because he was a philanderer.","translation":"彼女は夫が浮気者だったため離婚した。"},{"sentence":"The play features a charming but irresponsible philanderer.","translation":"その劇は、魅力的だが無責任な浮気者を主人公にしている。"}],"collocations":["a notorious philanderer","a serial philanderer"],"synonyms":["womanizer","adulterer","flirt","rake","libertine"],"antonyms":["faithful partner"]}],"etymology":{"value":"From the Greek *philandros* (φιλάνδρος) meaning 'fond of men', 'loving mankind'. The meaning shifted over time to refer to a man who loves many women, especially in a frivolous or unfaithful way, influenced by a character named Philander in 18th-century plays and literature.","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈlændər/","syllables":"phi-lan-der"},"inflection":{"verb_forms":{"present_simple":["philander","philanders"],"past_simple":"philandered","past_participle":"philandered","present_participle":"philandering"},"noun_plural":"philanders"},"usage_notes":{"explanation":"The word \"philander\" typically refers to a man who engages in casual sexual relationships, especially when he is married or in a committed relationship. It often carries a negative connotation, implying irresponsibility and a lack of commitment. The noun form, \"philanderer,\" is used to describe such a man. While the term originally had a more neutral meaning related to loving mankind, its modern usage is almost exclusively associated with infidelity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She philandered with many men.","correct":"✓ He philandered with many women.","note":"The verb \"philander\" is typically used to describe the actions of a man, not a woman. While women can certainly be unfaithful, different terms are usually used to describe their behavior (e.g., \"have an affair\")."},{"incorrect":"✗ He is a philandering woman.","correct":"✓ He is a philanderer.","note":"The noun \"philanderer\" is specifically used to describe a man. To describe a woman who engages in similar behavior, terms like \"womanizer\" (though less common for women) or \"has affairs\" are used."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["adultery","infidelity","affair","womanizer"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"philander\" is a relatively uncommon and sophisticated term used to describe a man who frequently engages in casual sexual relationships, often implying infidelity. It is more formal and less commonly used in everyday conversation compared to words like \"cheat\" or \"have an affair.\" Understanding the term requires a good vocabulary and an awareness of its negative connotations. The noun form, \"philanderer,\" is used to describe such a man. This word is more likely to be encountered in literature, historical contexts, or discussions about relationships and morality.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician was accused of philandering during his time in office.","translation":"その政治家は在任中に浮気をしていたと告発された。","type":"verb","meaning_category":"浮気する"},{"sentence":"He earned a reputation as a philanderer after a series of affairs.","translation":"彼は一連の浮気の後、浮気者としての評判を得た。","type":"noun","meaning_category":"浮気者"},{"sentence":"The play satirizes the life of a wealthy philanderer.","translation":"その劇は、裕福な浮気者の生活を風刺している。","type":"noun","meaning_category":"浮気者"},{"sentence":"She left him because she couldn't tolerate his philandering ways.","translation":"彼女は彼の浮気癖に耐えられず彼と別れた。","type":"verb (gerund)","meaning_category":"浮気する"}]}