{"word":"monosemy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"単義性：ある単語や句がただ一つの意味しか持たない性質。","english_definition":"The property of a word or phrase having only one meaning.","examples":[{"sentence":"The term 'isotope' exhibits monosemy in scientific contexts.","translation":"『同位体』という用語は、科学的な文脈では単義性を示す。"},{"sentence":"Monosemy is often desirable in technical terminology to avoid ambiguity.","translation":"単義性は、曖昧さを避けるために、専門用語ではしばしば望ましい。"}],"collocations":["exhibit monosemy","achieve monosemy","lack monosemy","technical monosemy","lexical monosemy"],"synonyms":["unambiguity","univocality","singularity of meaning"],"antonyms":["polysemy","homonymy","ambiguity"]}],"etymology":{"value":"ギリシャ語の 'monos' (単一の) と 'sema' (意味、記号) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɒsɪmi/","syllables":"mo-no-se-my"},"inflection":{"noun_plural":"monosemies"},"usage_notes":{"explanation":"Monosemy is the opposite of polysemy (多義性) and homonymy (同音異義性). While polysemy refers to a word having multiple related meanings, and homonymy refers to words that sound alike but have different, unrelated meanings, monosemy means that a word has only one, clear meaning. This is often strived for in scientific and technical fields to ensure precision and avoid confusion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem was full of monosemy, making it very boring.","correct":"✓ The poem was full of polysemy, making it rich in interpretation.","note":"Poems often utilize polysemy to create layers of meaning, not monosemy."},{"incorrect":"✗ Monosemy is a good thing in everyday conversation.","correct":"✓ Clarity is a good thing in everyday conversation.","note":"While clarity is important, monosemy is not always necessary or desirable in everyday speech, as it can make language less expressive."}],"priority":"★★☆"},"related_words":{"derivatives":["monosemic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Monosemy' is a specialized term used in linguistics and semantics. It describes a situation where a word has only one meaning. This is often preferred in technical or scientific contexts to avoid confusion. Understanding this term requires a grasp of abstract concepts related to language and meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The goal of creating a controlled vocabulary is to enforce monosemy among its terms.","translation":"統制語彙を作成する目標は、その用語間で単義性を強制することである。","type":"general","meaning_category":"definition"},{"sentence":"In legal documents, monosemy is crucial to prevent misinterpretations.","translation":"法的文書では、誤解を防ぐために単義性が重要である。","type":"academic","meaning_category":"application"},{"sentence":"While monosemy simplifies communication, it can also limit the expressiveness of language.","translation":"単義性はコミュニケーションを単純化する一方で、言語の表現力を制限する可能性もある。","type":"theoretical","meaning_category":"implications"}]}