{"word":"respirometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"呼吸測定法、呼吸商測定法","english_definition":"The measurement of respiration rate.","examples":[{"sentence":"Respirometry is used to measure the oxygen consumption and carbon dioxide production of an organism.","translation":"呼吸測定法は、生物の酸素消費量と二酸化炭素生産量を測定するために使用されます。"},{"sentence":"The respirometry data indicated a significant increase in metabolic activity.","translation":"呼吸測定法のデータは、代謝活動の著しい増加を示していました。"}],"collocations":["measurements by respirometry","respirometry data","closed-system respirometry","open-flow respirometry"],"synonyms":["metabolic rate measurement","gas exchange measurement"],"antonyms":[]}],"etymology":{"value":"'Respiro-' refers to respiration, which comes from the Latin word 'respirare' meaning 'to breathe'. '-metry' refers to measurement, derived from the Greek word 'metron' meaning 'measure'. Therefore, respirometry literally means 'the measurement of breathing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛspɪˈrɒmɪtri/","syllables":"re-spi-rom-e-try"},"inflection":{"noun_plural":"respirometries"},"usage_notes":{"explanation":"Respirometry is a technique used in various scientific fields, including biology, physiology, and environmental science, to assess the metabolic activity of organisms or tissues. It involves measuring the rate of oxygen consumption and carbon dioxide production, which are key indicators of cellular respiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Respirometry are used to measure...","correct":"✓ Respirometry is used to measure...","note":"Respirometry is a singular noun referring to a method or technique, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["respirometer (noun: 呼吸測定器)"],"related_terms":["metabolism","respiration","oxygen consumption","carbon dioxide production"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Respirometry' is a specialized term primarily used in scientific contexts, specifically within fields like biology, physiology, and environmental science. It refers to the process of measuring respiration rates, often by quantifying oxygen consumption and carbon dioxide production. Understanding this term requires familiarity with basic biological concepts related to metabolism and gas exchange. Due to its technical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The researchers used **respirometry** to assess the impact of pollutants on aquatic organisms.","translation":"研究者らは、汚染物質が水生生物に与える影響を評価するために呼吸測定法を用いた。","type":"noun","meaning_category":"呼吸測定法"},{"sentence":"**Respirometry** allows for the determination of the respiratory quotient, which provides insights into the type of substrate being metabolized.","translation":"呼吸測定法により呼吸商を決定することができ、代謝されている基質の種類に関する洞察が得られる。","type":"noun","meaning_category":"呼吸測定法"}]}