{"word":"target-specific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"特定の標的に対して特異性を持つ、標的特異的な","english_definition":"Designed or acting to affect only a particular target or targets.","examples":[{"sentence":"This drug is target-specific, affecting only cancer cells.","translation":"この薬は標的特異的で、がん細胞のみに作用します。"},{"sentence":"Target-specific therapies are becoming increasingly important in modern medicine.","translation":"標的特異的な治療法は、現代医学においてますます重要になっています。"},{"sentence":"The antibody is target-specific and binds only to the desired antigen.","translation":"その抗体は標的特異的であり、目的の抗原にのみ結合します。"}],"collocations":["target-specific therapy","target-specific drug","target-specific antibody","target-specific delivery"],"synonyms":["selective","specific","targeted","directed"],"antonyms":["non-specific","broad-spectrum"]}],"etymology":{"value":"Combination of 'target' and 'specific'. 'Target' refers to the object or entity that is the aim of an action. 'Specific' means clearly defined or identified.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtɑːrɡɪt spəˈsɪfɪk/","syllables":"tar-get-spe-cif-ic"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Target-specific' is commonly used in scientific and medical contexts to describe treatments, drugs, or other interventions that are designed to affect only a particular target, such as a specific type of cell or molecule. It implies a high degree of precision and minimal off-target effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is target specific.","correct":"✓ The drug is target-specific.","note":"The hyphen is important to correctly form the compound adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["target","specificity","targeted therapy","precision medicine"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Target-specific' is a technical term primarily used in fields like medicine, biology, and engineering. It describes something that is designed to act only on a particular target, minimizing effects on other things. Understanding requires knowledge of the context in which it's used, such as drug development or disease treatment."},"example_sentences":[{"sentence":"Researchers are developing target-specific nanoparticles for drug delivery.","translation":"研究者たちは、薬物送達のための標的特異的なナノ粒子を開発しています。","type":"adjective","meaning_category":"Specificity"},{"sentence":"The target-specific nature of the treatment reduces side effects.","translation":"その治療法の標的特異的な性質は、副作用を軽減します。","type":"adjective","meaning_category":"Specificity"}]}