{"word":"cattleship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"家畜運搬船","english_definition":"A ship designed or adapted for carrying livestock, especially cattle.","examples":[{"sentence":"The cattleship was loaded with hundreds of heads of cattle for transport overseas.","translation":"その家畜運搬船には、海外輸送のために数百頭の牛が積み込まれていた。"},{"sentence":"Conditions on the cattleship were often harsh for both the animals and the crew.","translation":"家畜運搬船の環境は、動物にとっても乗組員にとっても過酷なことが多かった。"}],"collocations":["load a cattleship","cattleship conditions","cattleship transport"],"synonyms":["livestock carrier","stock ship"],"antonyms":[]}],"etymology":{"value":"The word 'cattleship' is a compound word formed from 'cattle' (domesticated bovine animals) and 'ship' (a large seagoing vessel). It reflects the ship's primary purpose of transporting cattle.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkætlʃɪp","syllables":"cat-tle-ship"},"inflection":{"noun_plural":"cattleships"},"usage_notes":{"explanation":"A 'cattleship' is a specialized type of ship designed to transport livestock, primarily cattle, over long distances, often across oceans. These ships are equipped with features to accommodate and care for the animals during transit, though historical accounts often describe harsh conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cattle ship was sailing.","correct":"✓ The cattleship was sailing.","note":"While 'cattle ship' might be understood, 'cattleship' is the more common and specific term for a ship designed for carrying cattle."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cattleship' refers to a specialized vessel designed for transporting livestock, particularly cattle, across bodies of water. Due to its specific application and historical context, it is not a commonly encountered word. Understanding the term requires knowledge of maritime transport and agricultural practices. The word is straightforward in construction, combining 'cattle' and 'ship,' but its usage is limited to contexts involving the shipping of livestock."},"example_sentences":[{"sentence":"The old **cattleship** was converted into a cargo vessel after livestock transport declined.","translation":"古い家畜運搬船は、家畜輸送が衰退した後、貨物船に改造された。","type":"noun","meaning_category":"家畜運搬船"},{"sentence":"Regulations for **cattleships** have improved over the years to ensure better animal welfare.","translation":"家畜運搬船に関する規制は、動物福祉を向上させるために年々改善されてきた。","type":"noun","meaning_category":"家畜運搬船"}]}