{"word":"Baillie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スコットランド) 市参事会員、行政委員","english_definition":"(Scotland) A member of a town council, corresponding to an alderman in England and Wales.","examples":[{"sentence":"He was elected as a Baillie to the local council.","translation":"彼は地方議会の行政委員として選出された。"},{"sentence":"The Baillie presided over the meeting.","translation":"行政委員が会議を主宰した。"}],"collocations":["elected Baillie","local Baillie","presiding Baillie"],"synonyms":["Councillor","Alderman"],"antonyms":[]}],"etymology":{"value":"From Scots, of uncertain origin, possibly from Old French baili (bailiff).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪli/","syllables":"Bail-lie"},"inflection":{"noun_plural":"Baillies"},"usage_notes":{"explanation":"'Baillie' is a term primarily used in Scotland to refer to a member of a town council or a magistrate. It is a specific term within the Scottish local government system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bailey of the court.","correct":"✓ He is a Baillie of the council.","note":"'Baillie' refers to a specific role in Scottish local government, not a general court official. 'Bailey' is a different word with different meanings."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Baillie' is a specialized term primarily used in Scotland, referring to a member of a town council. Due to its specific regional usage, it is not commonly encountered outside of contexts related to Scottish local government. Understanding requires familiarity with the Scottish political system."},"example_sentences":[{"sentence":"The newly appointed Baillie addressed the community concerns.","translation":"新しく任命された行政委員は、地域社会の懸念事項について演説した。","type":"noun","meaning_category":"市参事会員"},{"sentence":"As a Baillie, she was responsible for overseeing local services.","translation":"行政委員として、彼女は地方サービスの監督責任を負っていた。","type":"noun","meaning_category":"行政委員"}]}