{"word":"uncrossexaminable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反対尋問できない、反対尋問に適さない","english_definition":"Not able to be cross-examined; not suitable for cross-examination.","examples":[{"sentence":"The witness's statement was deemed uncrossexaminable because the witness had disappeared.","translation":"証人が失踪したため、証人の供述は反対尋問できないと判断された。"},{"sentence":"Due to the witness's mental state, their testimony was considered uncrossexaminable.","translation":"証人の精神状態により、証言は反対尋問に適さないと判断された。"}],"collocations":["uncrossexaminable evidence","uncrossexaminable testimony","deemed uncrossexaminable","considered uncrossexaminable"],"synonyms":["unquestionable","unexaminable","unchallengeable"],"antonyms":["crossexaminable","questionable","challengeable"]}],"etymology":{"value":"Derived from 'cross-examinable' with the prefix 'un-' indicating negation. 'Cross-examinable' comes from 'cross-examine,' a legal term referring to the examination of a witness who has already testified in order to check or discredit their testimony.","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌnˌkrɒsɪɡˈzæmɪnəbəl","syllables":"un-cross-ex-am-in-a-ble"},"inflection":{"notes":"Adjective: comparative and superlative forms are possible (more uncrossexaminable, most uncrossexaminable) but rarely used."},"usage_notes":{"explanation":"'Uncrossexaminable' is a legal term, primarily used in legal contexts. It describes evidence or testimony that cannot be subjected to cross-examination, typically because the witness is unavailable, incompetent, or the evidence is inadmissible. The term implies a lack of opportunity to challenge or verify the accuracy and reliability of the evidence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncrossexaminable witness was allowed to leave.","correct":"✓ The witness whose testimony was uncrossexaminable was allowed to leave.","note":"It's the testimony or evidence that is uncrossexaminable, not the witness themselves. The witness might be present, but their testimony cannot be cross-examined for some reason."},{"incorrect":"✗ The evidence was uncrossexaminable in court.","correct":"✓ The evidence was deemed uncrossexaminable in court.","note":"It is usually 'deemed' or 'considered' uncrossexaminable by a legal authority (e.g., a judge)."}],"priority":"★★☆"},"related_words":{"derivatives":["crossexamine","cross-examination"],"phrasal_verbs":[],"related_terms":["hearsay","admissible evidence","inadmissible evidence","testimony","witness","legal proceedings","courtroom","evidence law"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily a legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Uncrossexaminable' is a specialized legal term. It means that a piece of evidence or a witness's testimony cannot be challenged or questioned through cross-examination in a legal setting. This often occurs because the witness is unavailable, incompetent, or the evidence is deemed inadmissible for some legal reason. The term is primarily used by legal professionals and is rarely encountered in general conversation."},"example_sentences":[{"sentence":"The affidavit was ruled uncrossexaminable due to the affiant's death.","translation":"宣誓供述書は、宣誓者が死亡したため、反対尋問できないと判断された。","type":"adjective","meaning_category":"legal"},{"sentence":"Hearsay evidence is often considered uncrossexaminable and therefore inadmissible in court.","translation":"伝聞証拠は、反対尋問できないとみなされることが多く、そのため法廷では証拠として認められない。","type":"adjective","meaning_category":"legal"}]}