{"word":"Periodontium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"歯周組織","english_definition":"The tissue that surrounds and supports the teeth, including the gingiva (gums), periodontal ligament, cementum, and alveolar bone.","examples":[{"sentence":"The periodontium is essential for maintaining the stability of the teeth.","translation":"歯周組織は歯の安定性を維持するために不可欠です。"},{"sentence":"Periodontal disease affects the periodontium, leading to tooth loss if untreated.","translation":"歯周病は歯周組織に影響を与え、治療せずに放置すると歯を失う可能性があります。"}],"collocations":["healthy periodontium (健康な歯周組織)","diseased periodontium (病的な歯周組織)","periodontal ligament (歯根膜)","alveolar bone (歯槽骨)","gingiva (歯肉)","cementum (セメント質)"],"synonyms":["gum tissue","supporting tissues of the teeth"],"antonyms":[]},{"part_of_speech":"noun","definition":"(解剖学)歯周組織全体を指す言葉","english_definition":"(Anatomy) The specialized tissues that both surround and support the teeth, maintaining them in the maxillary and mandibular bones.","examples":[{"sentence":"Inflammation of the periodontium can lead to serious dental problems.","translation":"歯周組織の炎症は深刻な歯科的問題につながる可能性があります。"}],"collocations":["periodontal health (歯周組織の健康)","periodontal disease (歯周病)","periodontal treatment (歯周治療)"],"synonyms":["supporting structures of teeth","dental attachment apparatus"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'peri' (around) + 'odontos' (tooth) + '-ium' (a suffix denoting tissue).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrioʊˈdɒntiəm/","syllables":"per-i-o-don-ti-um"},"inflection":{"noun_plural":"periodontia"},"usage_notes":{"explanation":"The term 'periodontium' is primarily used in dentistry and related medical fields. It refers collectively to the structures that directly support and anchor the teeth within the jaw. Understanding the periodontium is crucial for diagnosing and treating periodontal diseases.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The periodontium is only the gums.","correct":"✓ The periodontium includes the gums, periodontal ligament, cementum, and alveolar bone.","note":"The periodontium is more than just the gums; it encompasses all the supporting tissues of the teeth."},{"incorrect":"✗ Periodontium disease.","correct":"✓ Periodontal disease.","note":"The correct term for gum disease is 'periodontal disease', not 'periodontium disease'."}],"priority":"★★☆"},"related_words":{"derivatives":["periodontal (adjective: relating to the periodontium)","periodontist (noun: a dentist specializing in the treatment of periodontal disease)","periodontitis (noun: inflammation of the periodontium)","peri-odontal (adjective: alternative spelling of periodontal)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary used in medical contexts)","frequency_google_ngram":"Low frequency - Primarily used in dental and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Periodontium' is a technical term used in dentistry to describe the tissues that support your teeth. It's like the foundation of a house, but for your teeth. It includes the gums (gingiva), the ligament that attaches the tooth to the bone (periodontal ligament), the bony socket (alveolar bone), and the outer layer of the tooth root (cementum). If you hear a dentist talking about the periodontium, they're referring to all these parts working together to keep your teeth healthy and stable. Problems with the periodontium, like inflammation or infection, can lead to gum disease and tooth loss."},"example_sentences":[{"sentence":"Maintaining a healthy periodontium is crucial for long-term dental health.","translation":"健康な歯周組織を維持することは、長期的な歯科の健康にとって非常に重要です。","type":"general","meaning_category":"General usage"},{"sentence":"The periodontium consists of four main components: gingiva, periodontal ligament, cementum, and alveolar bone.","translation":"歯周組織は、歯肉、歯根膜、セメント質、および歯槽骨の4つの主要な構成要素で構成されています。","type":"anatomy","meaning_category":"Anatomy"},{"sentence":"Periodontal disease can lead to the destruction of the periodontium.","translation":"歯周病は歯周組織の破壊につながる可能性があります。","type":"pathology","meaning_category":"Pathology"},{"sentence":"The periodontium provides support and protection for the teeth.","translation":"歯周組織は歯の支持と保護を提供します。","type":"function","meaning_category":"Function"}]}