{"word":"expunger","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)抹消する人、削除する人、記録抹消装置","english_definition":"A person or thing that expunges; specifically, a device for expunging records.","examples":[{"sentence":"The expunger was used to remove the criminal record from the system.","translation":"その抹消装置は、システムから犯罪記録を削除するために使用された。"},{"sentence":"The lawyer acted as an expunger, petitioning the court to seal his client's record.","translation":"弁護士は抹消者として行動し、クライアントの記録を封印するよう裁判所に請願した。"}],"collocations":["record expunger","criminal record expunger"],"synonyms":["eraser","deleter","remover"],"antonyms":["recorder","preserver"]}],"etymology":{"value":"From the verb 'expunge,' with the addition of the agent suffix '-er.'","priority":"★★★"},"pronunciation":{"ipa":"/ɪkˈspʌndʒər/","syllables":"ex-pung-er"},"inflection":{"noun_plural":"expungers"},"usage_notes":{"explanation":"The term 'expunger' is most commonly used in legal contexts to refer to someone or something that removes or erases a record, particularly a criminal record. It can refer to a person who is legally authorized to expunge records, or to a device or software used for that purpose.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The expunger painted over the graffiti.","correct":"✓ The cleaner painted over the graffiti.","note":"'Expunger' is typically used in the context of legal records, not physical graffiti. 'Cleaner' or 'painter' would be more appropriate in the latter context."}],"priority":"★☆☆"},"related_words":{"derivatives":["expunge (verb)","expungement (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'expunger' is a specialized term, primarily used in legal contexts. It refers to someone or something that removes or erases a record, often a criminal record. Understanding this term requires familiarity with legal procedures and terminology related to record sealing or expungement."},"example_sentences":[{"sentence":"The judge appointed an expunger to oversee the sealing of the juvenile records.","translation":"裁判官は、少年記録の封印を監督するために記録抹消者を任命した。","type":"noun","meaning_category":"Legal"},{"sentence":"The new software acts as an expunger, permanently deleting sensitive data.","translation":"新しいソフトウェアは記録抹消装置として機能し、機密データを完全に削除する。","type":"noun","meaning_category":"Technology"}]}