{"word":"plein-airist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"戸外[野外]風景画家、野外制作画家","english_definition":"An artist who paints outdoors.","examples":[{"sentence":"The plein-airist captured the vibrant colors of the sunset.","translation":"その戸外風景画家は、夕焼けの鮮やかな色彩を捉えた。"},{"sentence":"Many impressionists were plein-airists, seeking to depict the effects of natural light.","translation":"多くの印象派画家は、自然光の効果を描こうと努める野外制作画家だった。"}],"collocations":["become a plein-airist","famous plein-airist","group of plein-airists"],"synonyms":["landscape painter","outdoor painter"],"antonyms":["studio artist"]}],"etymology":{"value":"\"Plein air\" is a French expression meaning \"open air.\" The term \"plein-airist\" combines \"plein air\" with the suffix \"-ist,\" indicating someone who practices or is associated with the style of painting outdoors.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplɛnˈɛərɪst/","syllables":"plein-air-ist"},"inflection":{"noun_plural":"plein-airists"},"usage_notes":{"explanation":"The term \"plein-airist\" is specifically used to describe artists who create paintings outdoors, directly observing and capturing the natural light and atmosphere. It is often associated with Impressionism and other movements that emphasized direct observation of nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a plein-airist because he likes to paint.","correct":"✓ He is a plein-airist because he paints outdoors.","note":"Being a plein-airist specifically refers to painting outdoors, not just liking to paint in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["plein air (noun: open air; the practice of painting outdoors)"],"related_terms":["Impressionism","Barbizon school","landscape painting"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"plein-airist\" refers to an artist who practices painting outdoors, directly observing and capturing the natural light and atmosphere. This style of painting is often associated with Impressionism and other movements that emphasize direct observation of nature. The word itself is derived from the French term \"plein air,\" meaning \"open air.\" Understanding the term requires knowledge of art history and painting techniques.","priority":"★☆☆"},"example_sentences":[{"sentence":"The exhibition featured works by several contemporary plein-airists.","translation":"その展覧会では、数名の現代の野外制作画家による作品が展示されていた。","type":"general","meaning_category":"definition"},{"sentence":"As a plein-airist, she prefers to paint directly from nature rather than from photographs.","translation":"野外風景画家として、彼女は写真からではなく、自然から直接描くことを好む。","type":"general","meaning_category":"definition"}]}