{"word":"company-promoted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"会社が推進する、会社が後援する、会社が宣伝する","english_definition":"Supported, endorsed, or advertised by a company.","examples":[{"sentence":"The event was company-promoted to increase brand awareness.","translation":"そのイベントは、ブランド認知度を高めるために会社が推進した。"},{"sentence":"The company-promoted initiative aims to reduce carbon emissions.","translation":"その会社が後援するイニシアチブは、炭素排出量の削減を目的としている。"},{"sentence":"They attended a company-promoted seminar on leadership.","translation":"彼らは会社が宣伝するリーダーシップに関するセミナーに参加した。"}],"collocations":["company-promoted event","company-promoted initiative","company-promoted product","company-promoted campaign","company-promoted image"],"synonyms":["company-sponsored","company-endorsed","company-backed","organization-promoted"],"antonyms":["independently-promoted","grassroots-promoted"]}],"etymology":{"value":"Combination of 'company' and 'promoted', indicating that the promotion or support comes from a company.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌmpəni prəˈmoʊtɪd/","syllables":"com-pa-ny pro-mo-ted"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Company-promoted' is used to describe something that a company actively supports, advertises, or encourages. It implies that the company is investing resources and effort into promoting the particular thing, whether it's an event, product, or initiative.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The promoted company event was a success.","correct":"✓ The company-promoted event was a success.","note":"'Promoted company event' could be interpreted as an event where the company itself is being promoted, rather than the company promoting the event. Using 'company-promoted' clarifies the meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["promotion","promote","company"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, typically used in business or marketing contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Company-promoted' is a compound adjective used to describe something that is supported or advertised by a company. It's often used in business or marketing contexts to indicate that a company is actively involved in promoting something, such as an event, product, or initiative. The term implies that the company is investing resources and effort into the promotion. It is less common in everyday conversation and more likely to be found in professional or formal writing."},"example_sentences":[{"sentence":"The company-promoted software update includes several new features.","translation":"会社が推進するソフトウェアのアップデートには、いくつかの新機能が含まれています。","type":"adjective","meaning_category":"会社が推進する"},{"sentence":"The company-promoted health program aims to improve employee well-being.","translation":"会社が後援する健康プログラムは、従業員の幸福度向上を目的としています。","type":"adjective","meaning_category":"会社が後援する"},{"sentence":"The company-promoted advertising campaign was very effective.","translation":"会社が宣伝する広告キャンペーンは非常に効果的でした。","type":"adjective","meaning_category":"会社が宣伝する"}]}