{"word":"Junkerdom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ユンカー階級、ユンカー制度、ユンカーの領地、ユンカー的な性質","english_definition":"The Prussian landed aristocracy; the political and social system associated with them; the estate or territory of a Junker; Junker-like qualities.","examples":[{"sentence":"The decline of Junkerdom after World War I significantly altered the political landscape of Germany.","translation":"第一次世界大戦後のユンカー階級の衰退は、ドイツの政治情勢を大きく変えた。"},{"sentence":"His policies were aimed at dismantling Junkerdom and promoting social equality.","translation":"彼の政策は、ユンカー制度を解体し、社会の平等を促進することを目的としていた。"}],"collocations":["decline of Junkerdom","dismantling Junkerdom","legacy of Junkerdom","Prussian Junkerdom"],"synonyms":["aristocracy","landed gentry","nobility","Prussianism"],"antonyms":["democracy","egalitarianism","socialism"]}],"etymology":{"value":"From German 'Junkertum', from 'Junker' (young nobleman) + '-tum' (-dom). 'Junker' is from Middle High German 'juncherre' (young lord), from 'junc' (young) + 'herre' (lord).","priority":"★★★"},"pronunciation":{"ipa":"/ˈjʌŋkərdəm/","syllables":"Jun-ker-dom"},"inflection":{"noun_plural":"Junkerdoms"},"usage_notes":{"explanation":"'Junkerdom' refers specifically to the Prussian (later German) landed aristocracy and the social and political system they dominated. It often carries connotations of militarism, conservatism, and authoritarianism. The term is less frequently used today, but it remains relevant in historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He admired Junkerdom for its democratic values.","correct":"✓ He criticized Junkerdom for its authoritarian tendencies.","note":"Junkerdom is generally associated with authoritarianism and conservatism, not democratic values."}],"priority":"★☆☆"},"related_words":{"derivatives":["Junker (noun: a member of the Prussian landed aristocracy)","Junkers (plural of Junker)","Junkerish (adjective: characteristic of a Junker)"],"related_terms":["Prussianism","feudalism","aristocracy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Junkerdom' is a specialized term primarily used in historical contexts to describe the Prussian landed aristocracy and their associated social and political system. Understanding this term requires familiarity with German history and social structures. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The power of Junkerdom was deeply entrenched in the Prussian military and bureaucracy.","translation":"ユンカー階級の権力は、プロイセンの軍隊と官僚機構に深く根ざしていた。","type":"noun","meaning_category":"ユンカー階級"},{"sentence":"The reforms aimed to weaken the influence of Junkerdom in the government.","translation":"その改革は、政府におけるユンカー制度の影響力を弱めることを目的としていた。","type":"noun","meaning_category":"ユンカー制度"}]}