{"word":"ethnographer","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"民族誌学者、文化人類学者","english_definition":"a person who studies and describes the culture of a group of people.","examples":[{"sentence":"The ethnographer lived with the tribe for two years to study their customs.","translation":"その民族誌学者は、部族の習慣を研究するために2年間彼らと生活を共にした。"},{"sentence":"Ethnographers use participant observation as a key research method.","translation":"民族誌学者は、主要な研究方法として参与観察を用いる。"},{"sentence":"The ethnographer's report provided valuable insights into the community's social structure.","translation":"その民族誌学者の報告書は、コミュニティの社会構造に関する貴重な洞察を提供した。"}],"collocations":["study as an ethnographer","become an ethnographer","work as an ethnographer","leading ethnographer","fieldwork ethnographer","digital ethnographer","urban ethnographer"],"synonyms":["cultural anthropologist","anthropologist","social scientist","field researcher","observer","researcher"],"antonyms":[]}],"etymology":{"value":"The word \"ethnographer\" comes from the Greek words \"ethnos\" (nation, people) and \"grapho\" (to write, describe). It literally means \"one who writes about people or nations.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɛθˈnɒɡrəfər/","syllables":"eth-nog-ra-pher"},"inflection":{"noun_plural":"ethnographers"},"usage_notes":{"explanation":"An ethnographer is a type of researcher, typically in the fields of anthropology or sociology, who studies a particular culture or group of people. Ethnographers often immerse themselves in the culture they are studying, living among the people and participating in their daily lives in order to gain a deeper understanding of their beliefs, customs, and social structures. The goal of ethnography is to provide a detailed and holistic description of a culture from the perspective of its members.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a ethographer.","correct":"✓ She is an ethnographer.","note":"Since \"ethnographer\" begins with a vowel sound, the indefinite article \"an\" should be used instead of \"a.\""},{"incorrect":"✗ Ethnographers study animals.","correct":"✓ Ethnographers study human cultures.","note":"Ethnographers study human cultures, not animals. The study of animals is typically the domain of zoologists or ethologists."},{"incorrect":"✗ Ethnographer is a type of history.","correct":"✓ Ethnography is a type of social science research.","note":"Ethnography is a research method used in social sciences, not a type of history."}],"priority":"★★☆"},"related_words":{"derivatives":["ethnography (noun: the study and systematic description of human cultures)","ethnographic (adjective: relating to ethnography or ethnographers)","ethnocentrism (noun: the belief in the inherent superiority of one's own ethnic group or culture)","ethnohistory (noun: the study of cultures and ethnic groups from a historical point of view)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ethnographer\" refers to a person who does ethnography. Ethnography is a type of research where someone studies a group of people or a culture by living with them and observing their lives. Ethnographers try to understand how people in a culture see the world. This word is often used in social sciences like anthropology and sociology. It's important to know that ethnographers focus on understanding cultures from the inside, by being part of them.","priority":"★★☆"},"example_sentences":[{"sentence":"As an **ethnographer**, she spent years documenting the traditions of the indigenous community.","translation":"民族誌学者として、彼女は何年もかけて先住民族の伝統を記録した。","type":"noun","meaning_category":"person studying culture"},{"sentence":"The **ethnographer** used interviews and observations to gather data for her research.","translation":"その民族誌学者は、インタビューと観察を用いて研究のためのデータを収集した。","type":"noun","meaning_category":"person studying culture"},{"sentence":"His work as an **ethnographer** focused on the impact of globalization on local communities.","translation":"彼の民族誌学者としての研究は、グローバル化が地域社会に与える影響に焦点を当てていた。","type":"noun","meaning_category":"person studying culture"},{"sentence":"The **ethnographer**'s detailed notes provided valuable insights into the daily lives of the villagers.","translation":"その民族誌学者の詳細なメモは、村人たちの日常生活に関する貴重な洞察を提供した。","type":"noun","meaning_category":"person studying culture"}]}