{"word":"Algic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アルゴンキン語族","english_definition":"A family of Native American languages spoken in Canada and the United States, including Algonquin, Cree, Ojibwe, and others.","examples":[{"sentence":"The Algic language family is one of the most widespread in North America.","translation":"アルゴンキン語族は、北米で最も広範囲に分布している言語族の一つです。"}],"collocations":["Algic language family","Proto-Algic"],"synonyms":["Algonquian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"アルゴンキン語族の","english_definition":"Relating to or belonging to the Algic language family.","examples":[{"sentence":"Algic languages are characterized by their polysynthetic nature.","translation":"アルゴンキン語族の言語は、抱合的（複合的）な性質を持つことで特徴付けられます。"}],"collocations":["Algic languages","Algic grammar"],"synonyms":["Algonquian"],"antonyms":[]}],"etymology":{"value":"Derived from 'Algonquin', a major language within the family, combined with the suffix '-ic', indicating relationship or belonging.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈældʒɪk/","syllables":"Al-gic"},"inflection":{"notes":"It can be used as both a noun and an adjective. The plural form as a noun is 'Algics', though it's less common."},"usage_notes":{"explanation":"'Algic' is primarily used in linguistics to refer to the language family. While 'Algonquian' is often used interchangeably, some linguists prefer 'Algic' to refer to the broader family, which includes languages like Wiyot and Yurok that are distantly related to the core Algonquian languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He speaks Algic.","correct":"✓ He speaks an Algic language. / ✓ He speaks Algonquin.","note":"'Algic' refers to the language family, not a specific language. To refer to a specific language, use the name of that language (e.g., Algonquin, Cree)."},{"incorrect":"✗ Algic is a tribe.","correct":"✓ Algonquin is a tribe.","note":"'Algic' refers to the language family. Algonquin is a tribe and also a language."}],"priority":"★★☆"},"related_words":{"derivatives":["Algonquian","Algonquin","Proto-Algic"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in academic contexts related to linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Algic' is a technical term used in linguistics to classify a family of Native American languages. It is most commonly encountered in academic papers, linguistic studies, or discussions related to Native American languages. Understanding this term requires some familiarity with linguistic classification. It is not typically used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Linguists study the relationships between Algic languages.","translation":"言語学者はアルゴンキン語族の言語間の関係を研究しています。","type":"noun","meaning_category":"アルゴンキン語族"},{"sentence":"The Algic family includes a wide range of languages with varying degrees of mutual intelligibility.","translation":"アルゴンキン語族には、相互理解度が異なる幅広い言語が含まれています。","type":"adjective","meaning_category":"アルゴンキン語族の"}]}