{"word":"vicariateship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"代理職、代行職、代理司教の職","english_definition":"The office or position of a vicar or vicar apostolic; the district over which a vicar has jurisdiction.","examples":[{"sentence":"He was appointed to the vicariateship of the diocese.","translation":"彼はその教区の代理司教の職に任命された。"},{"sentence":"The vicariateship oversees several parishes in the region.","translation":"その代理司教区は、その地域のいくつかの小教区を監督している。"}],"collocations":["hold a vicariateship","appointed to a vicariateship"],"synonyms":["vicarship","apostolic vicariate"],"antonyms":[]}],"etymology":{"value":"From 'vicar' + '-ate' + '-ship'. 'Vicar' comes from Latin 'vicarius' meaning 'substitute'. '-ate' is a suffix denoting office or function. '-ship' is a suffix denoting office, dignity, or condition.","priority":"★★★"},"pronunciation":{"ipa":"/vɪˈkɛəriətˌʃɪp/","syllables":"vi-car-i-ate-ship"},"inflection":{"noun_plural":"vicariateships"},"usage_notes":{"explanation":"'Vicariateship' specifically refers to the office, position, or district under the jurisdiction of a vicar, especially a vicar apostolic in the Roman Catholic Church. It is a formal term related to religious administration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He held the vicariateship for many years, managing the church directly.","correct":"He held the vicariateship for many years, overseeing the region's parishes.","note":"A vicariateship involves oversight and administration of a district, not direct management of a single church."}],"priority":"★☆☆"},"related_words":{"derivatives":["vicar","vicarial","vicariate","vicar-general"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'vicariateship' is a highly specialized term primarily used in religious contexts, specifically within the Roman Catholic Church. It refers to the office or position of a vicar, especially a vicar apostolic, and the district they oversee. Due to its specific and limited usage, it is not commonly encountered in general English. Understanding requires familiarity with religious administrative structures."},"example_sentences":[{"sentence":"The responsibilities of the vicariateship included the confirmation of new members.","translation":"その代理司教の職の責任には、新しい信者の承認が含まれていた。","type":"general","meaning_category":"office/position"},{"sentence":"The boundaries of the vicariateship were clearly defined to avoid jurisdictional disputes.","translation":"管轄の紛争を避けるため、代理司教区の境界は明確に定義されていた。","type":"general","meaning_category":"district"}]}