{"word":"semigirder","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"片側ガーダー","english_definition":"A structural beam or girder that is only present on one side of a structure, or that only extends partially across a span.","examples":[{"sentence":"The bridge design incorporated semigirders to support the cantilevered walkway.","translation":"その橋の設計には、片持ち式の歩道を支えるために片側ガーダーが組み込まれていました。"},{"sentence":"Semigirders are often used in situations where space is limited on one side of the structure.","translation":"片側ガーダーは、構造物の一方の側のスペースが限られている状況でよく使用されます。"}],"collocations":["cantilever semigirder","steel semigirder","bridge semigirder"],"synonyms":["half-girder","partial girder"],"antonyms":[]}],"etymology":{"value":"'Semi-' (half) + 'girder' (a main horizontal support of a structure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛmiˌɡɜːrdər/","syllables":"se-mi-gir-der"},"inflection":{"noun_plural":"semigirders"},"usage_notes":{"explanation":"Semigirders are commonly used in bridge construction, particularly for cantilever bridges or in situations where there are constraints on the available space. They provide support to one side of a structure, while the other side may be supported by other means or left cantilevered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semigirder was completely spanning the bridge.","correct":"✓ The semigirder partially spanned the bridge.","note":"Semigirders, by definition, only partially span a structure."}],"priority":"★★☆"},"related_words":{"derivatives":["girder","beam","cantilever"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semigirder' is a technical term used in structural engineering. It refers to a type of beam or girder that only extends partially across a span or is only present on one side of a structure. Understanding this term requires some familiarity with structural engineering concepts."},"example_sentences":[{"sentence":"The semigirder provided essential support to the overhanging section of the building.","translation":"片側ガーダーは、建物の張り出し部分に不可欠な支持を提供しました。","type":"noun","meaning_category":"structural support"},{"sentence":"Engineers carefully calculated the load distribution on the semigirder.","translation":"エンジニアは、片側ガーダー上の荷重分布を慎重に計算しました。","type":"noun","meaning_category":"engineering design"}]}