{"word":"monogenetic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"単一遺伝子の、単一遺伝子性の","english_definition":"relating to or controlled by a single gene.","examples":[{"sentence":"Monogenetic diseases are caused by mutations in a single gene.","translation":"単一遺伝子疾患は、単一の遺伝子の変異によって引き起こされます。"},{"sentence":"The trait is monogenetic, meaning it's determined by one gene.","translation":"その形質は単一遺伝子性であり、つまり一つの遺伝子によって決定されます。"}],"collocations":["monogenetic disease","monogenetic trait","monogenetic inheritance"],"synonyms":["single-gene","unigenic"],"antonyms":["polygenetic","multigenic"]},{"part_of_speech":"adjective","definition":"単一起源の、単一発生の","english_definition":"having a single origin or source.","examples":[{"sentence":"Some theories propose a monogenetic origin for all languages.","translation":"いくつかの説は、すべての言語が単一起源であると提唱しています。"},{"sentence":"The volcanic field is considered monogenetic, with each volcano erupting only once.","translation":"その火山地帯は単一起源と考えられており、各火山は一度しか噴火しません。"}],"collocations":["monogenetic origin","monogenetic volcano","monogenetic field"],"synonyms":["single-origin","uni-origin"],"antonyms":["polygenetic","multi-origin"]}],"etymology":{"value":"From the Greek words 'monos' (single, alone) and 'genesis' (origin, birth).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnədʒəˈnetɪk/","syllables":"mo-no-ge-net-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms are 'more monogenetic' and 'most monogenetic', respectively, but these are rarely used."},"usage_notes":{"explanation":"The term 'monogenetic' is used in two main contexts: genetics and origin studies (such as language or geology). In genetics, it refers to traits or diseases controlled by a single gene. In origin studies, it indicates a single source or beginning. The context usually clarifies the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is monogenetic, so it's easy to treat.","correct":"✓ The disease is monogenetic, but treatment can still be complex.","note":"While monogenetic diseases are caused by a single gene, treatment isn't always simple. The relationship between the genetic cause and the ease of treatment isn't direct."},{"incorrect":"✗ Polygenetic is the opposite of monogenetic in all contexts.","correct":"✓ Polygenetic is the opposite of monogenetic in genetics, but not necessarily in origin studies.","note":"While 'polygenetic' is the direct opposite in genetics, the opposite of 'monogenetic' in terms of origin can be 'polygenetic' or 'multiple origin', depending on the specific field."}],"priority":"★★☆"},"related_words":{"derivatives":["monogenesis (noun: single origin or creation)"],"phrases":["monogenetic volcanic field"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Monogenetic' is a technical term primarily used in genetics and origin studies. In genetics, it describes traits or diseases caused by a single gene. In other fields, such as linguistics or geology, it refers to something having a single origin. The term is not commonly used in everyday language and is more likely to appear in scientific or academic contexts."},"example_sentences":[{"sentence":"Cystic fibrosis is a well-known example of a **monogenetic** disease.","translation":"嚢胞性線維症は、よく知られた単一遺伝子疾患の例です。","type":"adjective","meaning_category":"単一遺伝子の"},{"sentence":"Some linguists believe in a **monogenetic** origin for the Indo-European language family.","translation":"一部の言語学者は、インド・ヨーロッパ語族の単一起源を信じています。","type":"adjective","meaning_category":"単一起源の"}]}