{"word":"Hypervolume","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多目的最適化における、ある解集合が支配する空間の体積。パレートフロントの質を評価する指標の一つ。","english_definition":"In multi-objective optimization, the volume of space dominated by a set of solutions. A metric used to evaluate the quality of a Pareto front.","examples":[{"sentence":"The hypervolume indicator is used to compare the performance of different multi-objective optimization algorithms.","translation":"ハイパーボリューム指標は、異なる多目的最適化アルゴリズムの性能を比較するために使用されます。"},{"sentence":"A higher hypervolume value indicates a better Pareto front.","translation":"より高いハイパーボリューム値は、より良いパレートフロントを示します。"}],"collocations":["hypervolume indicator","calculate hypervolume","maximize hypervolume","Pareto front hypervolume"],"synonyms":["S-metric","hyperarea"],"antonyms":[]}],"etymology":{"value":"\"Hyper-\" (above, beyond) + \"volume\" (amount of space).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈhaɪpərˌvɒljuːm/","syllables":"hy-per-vol-ume"},"inflection":{"noun_plural":"hypervolumes"},"usage_notes":{"explanation":"Hypervolume is a concept primarily used in the field of multi-objective optimization. It quantifies the size of the objective space that is dominated by a set of solutions, providing a measure of both the convergence and diversity of the solution set. A larger hypervolume generally indicates a better set of solutions, as it implies that the solutions are both close to the true Pareto front and well-distributed across the objective space.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"Hypervolume is a technical term used in the context of multi-objective optimization. It represents the size of the space dominated by a set of solutions, providing a quantitative measure of the quality of the Pareto front. Understanding this term requires familiarity with concepts from optimization and set theory."},"example_sentences":[{"sentence":"The algorithm aims to maximize the hypervolume of the non-dominated solutions.","translation":"そのアルゴリズムは、非支配解のハイパーボリュームを最大化することを目指しています。","type":"technical","meaning_category":"多目的最適化"},{"sentence":"We compared the hypervolume values of different solution sets to evaluate their performance.","translation":"性能を評価するために、異なる解集合のハイパーボリューム値を比較しました。","type":"technical","meaning_category":"多目的最適化"}]}