{"word":"water-formed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水によって形成された、水成の","english_definition":"Formed or shaped by water; aqueous in origin.","examples":[{"sentence":"The valley is water-formed, carved out over millennia by the river.","translation":"その谷は水成であり、川によって何千年もの間かけて削り出された。","usage_notes":"Describes geological features or formations."},{"sentence":"These water-formed caves are a popular tourist attraction.","translation":"これらの水成洞窟は人気の観光名所です。","usage_notes":"Refers to caves created by water erosion."}],"collocations":["water-formed cave","water-formed valley","water-formed landscape","water-formed rock"],"synonyms":["aqueous","hydrogenic","water-created"],"antonyms":["wind-formed","ice-formed","fire-formed"]}],"etymology":{"value":"Compound word formed from 'water' and 'formed'.","notes":"Indicates origin or shaping process involving water."},"pronunciation":{"ipa":"/ˈwɔːtərˌfɔːrmd/","syllables":"wa-ter-formed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"Typically used in geological or geographical contexts to describe landforms or features created by the action of water, such as rivers, streams, or oceans. It can also be used more broadly to describe anything that has been shaped or influenced by water.","examples":["The Grand Canyon is a famous example of a water-formed landscape.","The smooth, rounded stones were water-formed over centuries."]},"common_mistakes":{"examples":[{"incorrect":"The water-formed plant grew near the river.","correct":"The aquatic plant grew near the river.","note":"Use 'aquatic' or 'water plant' when referring to plants that live in water, not 'water-formed'."}]},"related_words":{"derivatives":["water","form","formation"],"related_terms":["erosion","sedimentation","hydrology","aquatic"]},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency; primarily used in specialized or technical contexts."},"readability_explanation":{"level":"C1","text":"The term 'water-formed' is relatively uncommon and is typically encountered in scientific or geographical texts. It describes something that has been shaped or created by the action of water. Understanding this term requires a familiarity with geological processes and descriptive language."},"example_sentences":[{"sentence":"The unique rock formations are water-formed, sculpted by the relentless flow of the stream.","translation":"その独特な岩の形状は水成であり、絶え間ない流れの小川によって形作られた。","type":"adjective","meaning_category":"Formed by water"},{"sentence":"Scientists studied the water-formed terraces to understand the region's geological history.","translation":"科学者たちは、その地域の地質学的歴史を理解するために、水成の段丘を研究した。","type":"adjective","meaning_category":"Formed by water"}]}