{"word":"non-coagulating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"凝固しない、凝結しない","english_definition":"Not undergoing coagulation; remaining in a liquid state; not forming a clot or solid mass.","examples":[{"sentence":"The patient's blood was non-coagulating due to a medical condition.","translation":"患者の血液は、医学的な状態により凝固しなかった。"},{"sentence":"A non-coagulating agent was added to the solution.","translation":"溶液に非凝固剤が添加された。"}],"collocations":["non-coagulating blood","non-coagulating agent","non-coagulating fluid"],"synonyms":["uncoagulating","anti-coagulant","liquid"],"antonyms":["coagulating","clotting","solidifying"]},{"part_of_speech":"adjective","definition":"(比喩的に)まとまらない、団結しない","english_definition":"(Figuratively) Not forming a cohesive group or whole; lacking solidarity.","examples":[{"sentence":"The team's efforts were non-coagulating, resulting in a disjointed project.","translation":"チームの努力はまとまらず、ばらばらのプロジェクトになった。"}],"collocations":["non-coagulating efforts","non-coagulating ideas"],"synonyms":["disjointed","uncoordinated","fragmented"],"antonyms":["cohesive","unified","coordinated"]}],"etymology":{"value":"\"non-\" (否定) + \"coagulating\" (凝固する)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.kəʊˈæɡ.jʊˌleɪ.tɪŋ/","syllables":"non-co-ag-u-la-ting"},"inflection":{"notes":"Adjective, comparative and superlative forms are possible but not common (more non-coagulating, most non-coagulating)."},"usage_notes":{"explanation":"\"Non-coagulating\" is primarily used in scientific and medical contexts to describe substances, especially fluids like blood, that do not thicken or solidify. It can also be used metaphorically to describe a lack of cohesion or unity in a group or set of ideas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-coagulating blood was a good thing.","correct":"✓ The non-coagulating blood was a sign of a problem.","note":"Non-coagulating blood is generally indicative of a medical issue, not a positive condition."}],"priority":"★★★"},"related_words":{"derivatives":["coagulate (verb)","coagulation (noun)","coagulant (noun)","anticoagulant (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"non-coagulating\" is a technical term primarily used in scientific and medical contexts. It describes something that does not undergo the process of coagulation, meaning it does not thicken or solidify. This term is most commonly encountered in discussions of blood, proteins, or other fluids that have the potential to clot or solidify. Understanding this word requires a familiarity with basic scientific concepts related to chemistry and biology."},"example_sentences":[{"sentence":"The snake venom contained a non-coagulating toxin.","translation":"そのヘビの毒には、凝固しない毒素が含まれていた。","type":"adjective","meaning_category":"凝固しない"},{"sentence":"The research team studied the effects of the non-coagulating agent on the protein solution.","translation":"研究チームは、タンパク質溶液に対する非凝固剤の影響を調査した。","type":"adjective","meaning_category":"凝固しない"}]}