{"word":"laver","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"海苔（のり）","english_definition":"A type of edible seaweed, especially Porphyra species, used in various cuisines.","examples":[{"sentence":"Laver is a common ingredient in sushi.","translation":"海苔は寿司によく使われる材料です。"},{"sentence":"Welsh laver is traditionally made into laverbread.","translation":"ウェールズの海苔は伝統的にラバーブレッドに使われます。"}],"collocations":["dried laver","roasted laver","laver bread"],"synonyms":["seaweed","nori"],"antonyms":[]}],"etymology":{"value":"From Middle English 'laver', from Old French 'lovere', of obscure origin. Possibly related to Old Irish 'labar' (talkative, babbling), referring to the sound of waves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈleɪvər/","syllables":"la-ver"},"inflection":{"noun_plural":"lavers"},"usage_notes":{"explanation":"'Laver' refers specifically to edible seaweed, often of the genus *Porphyra*. It is a common ingredient in East Asian cuisine, particularly in Japan (where it is called 'nori') and Korea. In Wales, it is used to make a traditional dish called 'laverbread'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate laver with my soup, it was so salty!","correct":"✓ I ate seaweed with my soup, it was so salty!","note":"While 'laver' is a type of seaweed, using 'seaweed' is more general and widely understood. If you want to be specific, you can say 'laver'."},{"incorrect":"✗ I bought some laver to make sushi, but it was green.","correct":"✓ I bought some nori to make sushi, but it was green.","note":"For sushi, 'nori' is the more common term, especially when referring to the dried, dark green sheets."}],"priority":"★★☆"},"related_words":{"derivatives":["laverbread"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Laver' is a relatively uncommon word referring to a specific type of edible seaweed. It is most often encountered in contexts relating to Welsh cuisine (laverbread) or in more technical discussions of seaweed varieties. While 'seaweed' is a more general and widely understood term, 'laver' provides greater specificity when needed.","priority":"★★☆"},"example_sentences":[{"sentence":"The chef used fresh laver to make a flavorful broth.","translation":"シェフは新鮮な海苔を使って風味豊かなスープを作った。","type":"noun","meaning_category":"seaweed"},{"sentence":"Laverbread is a traditional Welsh dish made with laver and oats.","translation":"ラバーブレッドは海苔とオート麦で作られた伝統的なウェールズ料理です。","type":"noun","meaning_category":"seaweed"},{"sentence":"Dried laver is often used as a garnish for ramen.","translation":"乾燥海苔はラーメンの薬味としてよく使われます。","type":"noun","meaning_category":"seaweed"}]}