{"word":"Paestum","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"パエストゥム（イタリア南部の古代ギリシャ・ローマ遺跡）","english_definition":"Ancient Greek/Roman archaeological site in southern Italy, famous for its well-preserved Doric temples.","examples":[{"sentence":"Paestum is renowned for its three magnificent Greek temples.","translation":"パエストゥムは3つの壮大なギリシャ神殿で有名です。"},{"sentence":"We visited the ruins of Paestum during our trip to Campania.","translation":"カンパーニャ州旅行中にパエストゥムの遺跡を訪れました。"}],"historical_context":"Founded as Poseidonia by Greek colonists around 600 BCE, later conquered by the Lucanians and renamed Paestum by the Romans in 273 BCE. The site was abandoned in the Middle Ages and rediscovered in the 18th century.","cultural_significance":"Contains some of the best-preserved ancient Greek temples in the world, including the Temple of Hera (Basilica) and Temple of Neptune. The archaeological museum houses famous tomb paintings like the 'Diver's Tomb'."}],"pronunciation":{"ipa":"/ˈpɛstəm/","syllables":"Paes-tum","note":"イタリア語発音は「パエストゥム」に近い"},"etymology":{"value":"ラテン語「Paestum」から。元々ギリシャ語で「ポセイドニア（Poseidonia）」と呼ばれ、海神ポセイドンに捧げられた都市。ローマ時代に現在の名前に改称。","priority":"★☆☆"},"related_terms":[{"term":"Poseidonia","relation":"古代ギリシャ名"},{"term":"Doric order","relation":"パエストゥムの神殿建築様式"},{"term":"Campania","relation":"所在するイタリアの州"},{"term":"Temple of Hera","relation":"パエストゥムの主要遺跡"}],"visitor_information":{"location":"イタリア・カンパーニャ州サレルノ県、ナポリの南約85km","unesco_status":"1998年登録（チレントとディアノ渓谷国立公園およびパエストゥム遺跡群の一部として）","highlights":["ヘーラー神殿（通称バシリカ）","ネプチューン神殿","アテナ神殿","古代ローマのフォルム","パエストゥム考古学博物館"]},"level_frequency":{"CEFR":"B2-C1（専門的な文化/歴史用語）","frequency":"低頻度（専門分野以外ではあまり登場しない）"},"example_sentences":[{"sentence":"The Doric temples of Paestum are among the best-preserved in the Mediterranean world.","translation":"パエストゥムのドーリア式神殿は地中海世界で最も保存状態が良いものの一つです。"},{"sentence":"Paestum's archaeological museum displays remarkable Lucanian tomb paintings.","translation":"パエストゥム考古学博物館にはルカニア時代の驚くべき墓所壁画が展示されています。"}]}