{"query":"illbeing-related","description":"This query is ambiguous. Please clarify if you are looking for a definition of 'ill-being', a list of terms related to ill-being, or something else. I will assume you want a list of terms related to 'ill-being'.","related_terms":[{"term":"suffering","definition":"The state of undergoing pain, distress, or hardship."},{"term":"distress","definition":"Extreme anxiety, sorrow, or pain."},{"term":"misery","definition":"A state or condition of great wretchedness or unhappiness."},{"term":"unhappiness","definition":"The state of not being happy; sadness."},{"term":"discomfort","definition":"Slight pain or unease."},{"term":"malaise","definition":"A general feeling of discomfort, illness, or unease whose exact cause is difficult to identify."},{"term":"anguish","definition":"Severe mental or physical suffering."},{"term":"agony","definition":"Extreme physical or mental suffering."},{"term":"wretchedness","definition":"The state of being in a very unhappy or unfortunate state."},{"term":"adversity","definition":"Difficulties; misfortune."},{"term":"hardship","definition":"Severe suffering or privation."},{"term":"trauma","definition":"A deeply distressing or disturbing experience."},{"term":"stress","definition":"A state of mental or emotional strain or tension resulting from adverse or demanding circumstances."},{"term":"anxiety","definition":"A feeling of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome."},{"term":"depression","definition":"A mood disorder that causes a persistent feeling of sadness and loss of interest."},{"term":"grief","definition":"Intense sorrow, especially caused by someone's death."},{"term":"despair","definition":"The complete loss or absence of hope."},{"term":"hopelessness","definition":"The feeling or state of being without hope."},{"term":"pessimism","definition":"A tendency to see the worst aspect of things or believe that the worst will happen."},{"term":"alienation","definition":"The state or experience of being isolated from a group or an activity to which one should belong or in which one should be involved."},{"term":"loneliness","definition":"Sadness because one has no friends or company."},{"term":"isolation","definition":"The state of being alone or lonely."},{"term":"vulnerability","definition":"The quality or state of being exposed to the possibility of being attacked or harmed, either physically or emotionally."},{"term":"powerlessness","definition":"Lack of power; inability to influence or control events."}]}