{"word":"Twice-undone","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Undone twice; having been undone or unfastened two times.","english_definition":"Having been undone or unfastened two times.","examples":[{"sentence":"The knot was twice-undone, indicating someone had tampered with it.","translation":"その結び目は二度解かれており、誰かが手を加えたことを示していた。"},{"sentence":"The package arrived with the seals twice-undone, raising concerns about its contents.","translation":"その荷物は封印が二度解かれた状態で届き、中身に対する懸念が生じた。"}],"collocations":["twice-undone knot","twice-undone seal","twice-undone package"],"synonyms":["re-opened","double-unfastened"],"antonyms":["sealed","fastened","intact"]}],"etymology":{"value":"Combination of \"twice\" (two times) and \"undone\" (unfastened, reversed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwaɪs ʌnˈdʌn/","syllables":"twice-un-done"},"inflection":{"notes":"Adjective, does not inflect further."},"usage_notes":{"explanation":"The term \"twice-undone\" is a descriptive adjective indicating that something has been unfastened or reversed on two separate occasions. It suggests a possible deliberate action or tampering rather than a single accidental occurrence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice undone door was suspicious.","correct":"✓ The twice-undone lock was suspicious.","note":"The adjective \"twice-undone\" should logically apply to something that can be fastened or secured, like a knot, lock, or seal, rather than a door itself."}],"priority":"★★☆"},"related_words":{"derivatives":["undo (verb)","undone (adjective)","twice (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a relatively uncommon or specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Twice-undone\" is a relatively uncommon adjective that describes something that has been unfastened or reversed two times. It's used to imply that something has been deliberately tampered with or altered more than once. The word is formed by combining \"twice\" and \"undone\", making its meaning relatively straightforward to understand. However, its infrequent use makes it more suitable for advanced English speakers or specific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The investigator noted that the envelope was secured with a twice-undone clasp.","translation":"捜査官は、封筒が二度解かれた留め金で留められていることに気づいた。","type":"adjective","meaning_category":"Describing a tampered object"},{"sentence":"The rope showed signs of being twice-undone, which suggested someone had practiced tying and untying the knot.","translation":"そのロープは二度解かれた形跡があり、誰かが結び目を結んだり解いたりする練習をしたことを示唆していた。","type":"adjective","meaning_category":"Describing a manipulated item"}]}