{"word":"entrancedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"うっとりと、魅了されて、夢中で","english_definition":"in an entranced manner; as if in a trance; captivated; spellbound.","examples":[{"sentence":"She watched the ballet entrancedly, completely lost in the beauty of the performance.","translation":"彼女はバレエをうっとりと見つめ、そのパフォーマンスの美しさに完全に心を奪われた。"},{"sentence":"The children listened entrancedly to the storyteller's tale of faraway lands and magical creatures.","translation":"子供たちは、遠い国や魔法の生き物の物語を語る語り部の話に、夢中で耳を傾けた。"},{"sentence":"He stared entrancedly at the painting, noticing new details each time he looked.","translation":"彼は絵をうっとりと見つめ、見るたびに新しい細部に気づいた。"}],"collocations":["listen entrancedly","watch entrancedly","stare entrancedly","gaze entrancedly"],"synonyms":["fascinatedly","captivatedly","spellbound","mesmerized","raptly","absorbedly"],"antonyms":["uninterestedly","boredly","distractedly"]}],"etymology":{"value":"The word 'entrancedly' is formed by adding the suffix '-ly' to the adjective 'entranced'. 'Entranced' itself comes from the verb 'entrance', which means 'to fill with delight and wonder' or 'to put into a trance'. The verb 'entrance' derives from 'in-' (meaning 'into') and 'trance', which refers to a state of altered consciousness.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtrænstli/","syllables":"en-tranced-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Entrancedly' is used to describe an action performed while in a state of being entranced, which implies a feeling of great pleasure, wonder, and captivation. It suggests a loss of awareness of one's surroundings due to being completely absorbed in something. The word is relatively uncommon in everyday speech but is often found in literature and descriptive writing to convey a strong sense of fascination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She entrancedly watched the movie, it was very good.","correct":"✓ She watched the movie entrancedly; it was very good.","note":"When using 'entrancedly' to modify a verb, ensure that the sentence structure is correct. Avoid comma splices by using a semicolon or separating the sentences. Alternatively, you can rephrase the sentence to use 'entranced' as an adjective: 'She was entranced as she watched the movie.'"},{"incorrect":"✗ The audience was entrancedly.","correct":"✓ The audience was entranced.","note":"'Entrancedly' is an adverb and modifies verbs, not nouns. To describe the state of the audience, use the adjective 'entranced' or a similar adjective like 'fascinated' or 'captivated'."}],"priority":"★☆☆"},"related_words":{"derivatives":["entrance (verb, noun)","entranced (adjective)","entrancing (adjective)"],"phrases":["be entranced by","fall into a trance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Not commonly used in everyday conversation. More likely to be found in literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Entrancedly' is an adverb that describes doing something in a way that shows you are completely fascinated and captivated, almost as if you are in a trance. It's a more advanced word, so you'll typically find it in books or more formal writing rather than everyday conversations. It's used to emphasize a strong sense of wonder and absorption.","priority":"★★☆"},"example_sentences":[{"sentence":"The child gazed entrancedly at the colorful fish swimming in the aquarium.","translation":"子供は水族館で泳ぐカラフルな魚をうっとりと見つめた。","type":"adverb","meaning_category":"魅了されて"},{"sentence":"He listened entrancedly as she recounted her adventures in the Amazon rainforest.","translation":"彼女がアマゾンの熱帯雨林での冒険を語るのを、彼は夢中で聞いていた。","type":"adverb","meaning_category":"夢中で"},{"sentence":"She watched the fireworks entrancedly, her eyes wide with wonder.","translation":"彼女は花火をうっとりと見つめ、目を大きく見開いて驚嘆していた。","type":"adverb","meaning_category":"うっとりと"}]}