{"word":"ungravitational","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not subject to gravity; not influenced by gravity; counteracting gravity.","english_definition":"Not subject to, influenced by, or counteracting gravity.","examples":[{"sentence":"The scientist theorized about ungravitational forces that could propel spacecraft.","translation":"科学者は、宇宙船を推進できる反重力的な力について理論を立てた。"},{"sentence":"The artist created an ungravitational sculpture that seemed to float in the air.","translation":"芸術家は、空中に浮いているように見える反重力的な彫刻を制作した。"}],"collocations":["ungravitational field","ungravitational force","ungravitational effect","ungravitational propulsion"],"synonyms":["antigravitational","gravity-defying","weightless"],"antonyms":["gravitational"],"notes":"This word is relatively rare and often used in science fiction or theoretical contexts. It implies a state or force that opposes or negates the effects of gravity."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'gravitational'.","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnˌɡrævɪˈteɪʃənəl/","syllables":"un-grav-i-ta-tion-al"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It has comparative and superlative forms (more ungravitational, most ungravitational), but they are rarely used."},"usage_notes":{"explanation":"'Ungravitational' is used to describe something that is not affected by gravity or that actively opposes gravity. It is often found in discussions of theoretical physics, science fiction, or artistic concepts that challenge the natural laws of gravity.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The ungravitational apple fell from the tree.","correct":"The apple fell from the tree due to gravity.","note":"Apples are subject to gravity, so 'ungravitational' would be incorrect in this context."}],"priority":"low"},"related_words":{"derivatives":["ungravity (noun): The state of being without gravity or the absence of gravity.","gravitational (adjective): Relating to gravity."],"related_concepts":["antigravity","levitation","weightlessness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Ungravitational' is a complex term typically used in scientific or speculative contexts. It describes something not influenced by gravity. Understanding requires knowledge of 'gravity' and the negative prefix 'un-'. Usage is rare outside specialized discussions."},"example_sentences":[{"sentence":"The novel featured an ungravitational device that allowed people to fly.","translation":"その小説には、人々が飛ぶことを可能にする反重力装置が登場した。","type":"general","meaning_category":"science fiction"},{"sentence":"The architect designed an ungravitational structure that appeared to defy physics.","translation":"建築家は、物理学に逆らっているように見える反重力的な構造物を設計した。","type":"general","meaning_category":"design"},{"sentence":"Scientists are exploring the possibility of creating ungravitational fields for space travel.","translation":"科学者たちは、宇宙旅行のために反重力場を作り出す可能性を研究している。","type":"scientific","meaning_category":"research"}]}