{"word":"plumemaker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who makes plumes, especially decorative feathers for hats or other adornments.","english_definition":"A person who makes or deals in plumes, especially ornamental feathers.","examples":[{"sentence":"The plumemaker carefully selected the finest feathers for his creations.","translation":"羽根職人は、自分の作品のために最高の羽根を注意深く選んだ。"},{"sentence":"In the 18th century, plumemakers were in high demand due to the popularity of feathered hats.","translation":"18世紀には、羽根飾りのついた帽子の人気が高かったため、羽根職人の需要が高かった。"}],"collocations":["feather plumemaker","hat plumemaker","decorative plumemaker"],"synonyms":["featherer","plume dealer","feather artisan"],"antonyms":[]}],"etymology":{"value":"From 'plume' (a feather, especially a large or showy one used for decoration) + 'maker' (one who makes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpluːmˌmeɪkər/","syllables":"plume-ma-ker"},"inflection":{"noun_plural":"plumemakers"},"usage_notes":{"explanation":"The term 'plumemaker' is somewhat archaic, as the craft is less common today. It refers specifically to someone who creates decorative plumes from feathers, often for use in fashion or costume.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a plume maker.","correct":"✓ He is a plumemaker.","note":"'Plumemaker' is typically written as one word."}],"priority":"★☆☆"},"related_words":{"derivatives":["plume","plummage"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'plumemaker' is a specialized and relatively uncommon term, primarily used in historical contexts or when discussing specific crafts related to feather work. It requires an understanding of both 'plume' and the general concept of a 'maker' to fully grasp its meaning. Due to its limited use, it is not typically encountered in everyday language.","note":"This word is not commonly used and may require specialized knowledge to understand."},"example_sentences":[{"sentence":"The skilled **plumemaker** crafted exquisite feathered fans for the ladies of the court.","translation":"熟練した羽根職人は、宮廷の女性たちのために精巧な羽根扇子を作った。","type":"noun","meaning_category":"profession"},{"sentence":"Antique shops often feature the work of past **plumemakers**.","translation":"骨董品店では、過去の羽根職人の作品がよく展示されている。","type":"noun","meaning_category":"historical craft"}]}