{"word":"side-liner","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツ)試合に出場しない選手、補欠選手","english_definition":"A player who is not a regular member of a team and spends most of the time on the sidelines.","examples":[{"sentence":"He was a side-liner for most of the season, but he finally got a chance to play in the final game.","translation":"彼はシーズン中ほとんどサイドラインにいる選手だったが、最終戦でついにプレーする機会を得た。"},{"sentence":"The team needs to find a way to motivate its side-liners so they are ready when called upon.","translation":"チームは、サイドラインにいる選手たちが呼ばれたときに備えられるよう、彼らを鼓舞する方法を見つける必要がある。"}],"collocations":["on the sidelines","benchwarmer","reserve player"],"synonyms":["substitute","reserve","benchwarmer"],"antonyms":["starter","regular player"]},{"part_of_speech":"noun","definition":"傍観者、部外者、傍観する人","english_definition":"Someone who is not directly involved in an activity or situation; an observer.","examples":[{"sentence":"She didn't want to be a side-liner, so she joined the committee.","translation":"彼女は傍観者になりたくなかったので、委員会に参加した。"},{"sentence":"It's important to speak out against injustice, not just be a side-liner.","translation":"不正に対して声を上げることが重要であり、ただ傍観するだけではいけない。"}],"collocations":["sit on the sidelines","remain a side-liner"],"synonyms":["observer","spectator","onlooker"],"antonyms":["participant","insider","involved"]},{"part_of_speech":"noun","definition":"(比喩的に)重要でない人、影響力のない人","english_definition":"Someone who is not considered important or influential.","examples":[{"sentence":"He felt like a side-liner in the company, never getting the important projects.","translation":"彼は会社では重要でない存在のように感じており、重要なプロジェクトには決して参加できなかった。"},{"sentence":"She didn't want to be a side-liner in her own life, so she started making changes.","translation":"彼女は自分の人生において影響力のない存在になりたくなかったので、変化を起こし始めた。"}],"collocations":["feel like a side-liner","remain a side-liner"],"synonyms":["nonentity","nobody","outsider"],"antonyms":["influencer","key player","important person"]}],"etymology":{"value":"Compound word formed from \"side\" (referring to the sidelines of a sports field) and \"-liner\" (someone who occupies that position).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪdˌlaɪnər/","syllables":"side-lin-er"},"inflection":{"noun_plural":"side-liners"},"usage_notes":{"explanation":"The term \"side-liner\" can refer to someone who is literally on the sidelines of a sports game, or it can be used metaphorically to describe someone who is not actively participating or is not considered important. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good side-liner because he always cheers for the team.","correct":"✓ He is a good team player because he always cheers for the team.","note":"While a side-liner might cheer for the team, being a \"good side-liner\" doesn't have a specific positive connotation. \"Good team player\" is a more common and appropriate phrase."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sideline","benchwarmer","reserve"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"side-liner\" is generally understood to mean someone who is not actively participating or is on the periphery of an activity. It can be used in both literal and figurative contexts. Understanding the context is important to correctly interpret the meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The coach encouraged the side-liners to stay focused and be ready to play.","translation":"コーチはサイドラインにいる選手たちに、集中力を維持し、いつでもプレーできるように準備しておくよう励ました。","type":"noun","meaning_category":"スポーツ選手"},{"sentence":"She felt like a side-liner in the conversation, unable to contribute.","translation":"彼女は会話の中で傍観者のように感じ、貢献することができなかった。","type":"noun","meaning_category":"傍観者"},{"sentence":"He didn't want to remain a side-liner in the political process, so he decided to run for office.","translation":"彼は政治プロセスにおいて傍観者のままでいたくなかったので、立候補することを決意した。","type":"noun","meaning_category":"傍観者"}]}