{"word":"oophytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"胞子体（植物の生活環における、胞子を生成する二倍体の段階）の、またはそれに関する","english_definition":"Relating to or characteristic of the sporophyte (the diploid, spore-producing phase in the life cycle of a plant).","examples":[{"sentence":"The oophytic generation is dominant in vascular plants.","translation":"胞子体世代は維管束植物において優勢である。"}],"collocations":["oophytic generation","oophytic tissue"],"synonyms":["sporophytic"],"antonyms":["gametophytic"]}],"etymology":{"value":"Derived from the combination of 'oo-' (referring to egg or ovum, though indirectly related here) and '-phytic' (relating to plants), ultimately indicating the plant generation that produces spores.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊəˈfɪtɪk/","syllables":"o-o-phyt-ic"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Oophytic' is a botanical term primarily used in the context of plant life cycles, specifically referring to the sporophyte generation. It is most commonly encountered in academic or scientific literature related to botany, plant biology, or related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oophytic stage produces gametes.","correct":"✓ The oophytic stage produces spores.","note":"The oophytic (sporophyte) stage produces spores, while the gametophytic stage produces gametes."}],"priority":"★★☆"},"related_words":{"derivatives":["sporophyte","gametophyte"],"related_terms":["alternation of generations","plant life cycle"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in specialized botanical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oophytic' is a highly specialized term used in botany to describe the sporophyte generation of plants. Understanding this term requires familiarity with plant life cycles and the concept of alternation of generations. It is not commonly used outside of scientific or academic contexts related to plant biology."},"example_sentences":[{"sentence":"The development of the oophytic structures is crucial for the plant's reproductive success.","translation":"胞子体構造の発達は、植物の生殖の成功にとって重要である。","type":"general","meaning_category":"botany"},{"sentence":"In ferns, the oophytic phase is the dominant and visible part of the plant's life cycle.","translation":"シダ植物では、胞子体期が植物の生活環において優勢で目に見える部分である。","type":"specific","meaning_category":"botany"}]}