{"word":"Dardanelles","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ダーダネルス海峡","english_definition":"A narrow strait in northwestern Turkey connecting the Aegean Sea to the Sea of Marmara. It is a strategically important waterway.","examples":[{"sentence":"The Dardanelles strait has been a crucial waterway throughout history.","translation":"ダーダネルス海峡は歴史を通して重要な水路でした。"},{"sentence":"Control of the Dardanelles was a key objective during World War I.","translation":"第一次世界大戦中、ダーダネルス海峡の支配は重要な目標でした。"}],"collocations":["Dardanelles campaign","Dardanelles strait","control of the Dardanelles","navigate the Dardanelles"],"synonyms":["Hellespont (historical)"],"antonyms":[]}],"etymology":{"value":"From the ancient Greek 'Δαρδανέλλια' (Dardanéllia), named after Dardanus, a mythical son of Zeus and Electra, and founder of the city of Dardania.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɑːrdəˈnɛlz/","syllables":"Dar-da-nelles"},"inflection":{"notes":"Plural noun, usually used with 'the' (e.g., the Dardanelles)."},"usage_notes":{"explanation":"'Dardanelles' refers specifically to the geographic location of the strait in Turkey. It is a proper noun and is typically used with the definite article 'the'. Its historical and strategic significance often comes up in discussions of military history, particularly World War I.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He swam across Dardanelles.","correct":"✓ He swam across the Dardanelles.","note":"The definite article 'the' is generally used before 'Dardanelles' because it refers to a specific geographic location."},{"incorrect":"✗ Dardanelle is a city in Turkey.","correct":"✓ Dardanus was an ancient city near the Dardanelles. / ✓ Çanakkale is a city near the Dardanelles.","note":"'Dardanelles' refers to the strait, not a city. Dardania was an ancient region, and Çanakkale is a modern city nearby."}],"priority":"★★☆"},"related_words":{"derivatives":["Dardanian (adjective/noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly in historical or geographical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Dardanelles' is a proper noun referring to a specific geographic location, a strait in Turkey. Understanding its significance often requires knowledge of history, particularly its strategic importance in conflicts like World War I. The word is not commonly used in everyday conversation, but appears in historical texts, geographical discussions, and news reports about the region. Due to its specific context and historical relevance, it is considered a higher-level vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Allied forces launched a campaign in the Dardanelles during World War I.","translation":"連合軍は第一次世界大戦中にダーダネルス海峡で軍事作戦を開始した。","type":"noun","meaning_category":"Geographic Location"},{"sentence":"The Dardanelles connects the Aegean Sea with the Sea of Marmara.","translation":"ダーダネルス海峡はエーゲ海とマルマラ海を結んでいる。","type":"noun","meaning_category":"Geographic Location"},{"sentence":"The strategic importance of the Dardanelles has been recognized for centuries.","translation":"ダーダネルス海峡の戦略的重要は何世紀にもわたって認識されてきた。","type":"noun","meaning_category":"Geographic Location"}]}