{"word":"repurchaser","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再購入者、リピーター","english_definition":"A customer who buys a product or service again.","examples":[{"sentence":"The company is focusing on retaining its existing customer base of repurchasers.","translation":"その会社は、再購入者である既存の顧客基盤の維持に注力しています。"},{"sentence":"Loyalty programs are designed to encourage customers to become repurchasers.","translation":"ロイヤリティプログラムは、顧客が再購入者になることを奨励するように設計されています。"}],"collocations":["loyal repurchaser (忠実なリピーター)","frequent repurchaser (頻繁なリピーター)","potential repurchaser (潜在的なリピーター)"],"synonyms":["repeat customer","return customer","loyal customer","regular customer"],"antonyms":["one-time buyer","first-time buyer"]}],"etymology":{"value":"\"re-\" (再び) + \"purchaser\" (購入者)","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈpɜːrtʃəsər/","syllables":"re-pur-chas-er"},"inflection":{"noun_plural":"repurchasers"},"usage_notes":{"explanation":"\"Repurchaser\" specifically refers to a customer who has made repeat purchases of a product or service. It's a term often used in marketing and business contexts to identify and categorize customers based on their buying behavior. It emphasizes the act of buying *again*.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is trying to attract new repurchasers.","correct":"✓ The company is trying to attract new customers. / ✓ The company is trying to convert new customers into repurchasers.","note":"By definition, a \"repurchaser\" is someone who has already purchased something at least once. To attract *new* people, you would say \"new customers\". To turn new customers into repeat buyers, you would use the phrase \"convert new customers into repurchasers.\""}],"priority":"★★☆"},"related_words":{"derivatives":["repurchase (verb: 再購入する; noun: 再購入)","purchase (verb: 購入する; noun: 購入)","purchaser (noun: 購入者)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"比較的低い (Relatively low frequency) - ビジネス/マーケティング分野でより一般的。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Repurchaser\" is a term used in business to describe someone who buys something again from the same company or seller. It's more specific than just a \"customer\" because it implies that they have bought something before. Companies often focus on keeping their \"repurchasers\" happy because it's usually easier to sell to someone who has already bought from them than to find a completely new customer.","priority":"★★☆"},"example_sentences":[{"sentence":"Understanding the needs of our repurchasers is crucial for long-term success.","translation":"長期的な成功のためには、再購入者のニーズを理解することが重要です。","type":"general"},{"sentence":"We offered a special discount to our most loyal repurchasers.","translation":"最も忠実な再購入者には、特別な割引を提供しました。","type":"marketing"},{"sentence":"The repurchaser rate for our software is exceptionally high.","translation":"当社のソフトウェアの再購入率は非常に高いです。","type":"business"}]}