{"word":"anti-ballet","priority":"low","meanings":[{"part_of_speech":"noun","definition":"反バレエ、アンチバレエ","english_definition":"A form of dance or performance art that deliberately rejects or subverts the conventions and aesthetics of classical ballet.","examples":[{"sentence":"The choreographer's latest work was described as an anti-ballet, challenging traditional notions of beauty and grace.","translation":"その振付家の最新作は、美と優雅さの伝統的な概念に挑戦するアンチバレエと評された。"},{"sentence":"Anti-ballet often incorporates elements of modern dance, performance art, and political commentary.","translation":"アンチバレエは、しばしば現代舞踊、パフォーマンスアート、政治的解説の要素を取り入れている。"}],"collocations":["experimental dance","modern dance","performance art","avant-garde","subversive art"],"synonyms":["non-ballet","alternative dance","experimental ballet"],"antonyms":["classical ballet","traditional ballet"],"notes":"Anti-ballet is often characterized by its rejection of pointe work, tutus, and traditional ballet narratives. It may explore themes of social justice, identity, or personal experience."}],"etymology":{"value":"Formed from 'anti-' (against) + 'ballet'.","priority":"medium"},"pronunciation":{"ipa":"/ˌænti bæˈleɪ/","syllables":"an-ti-bal-lay"},"inflection":{"notes":"Plural: anti-ballets"},"usage_notes":{"explanation":"Anti-ballet is a term used to describe dance performances that intentionally deviate from the established norms of classical ballet. It's often associated with experimental and avant-garde approaches to movement and storytelling.","priority":"medium"},"related_words":{"related_terms":["modern dance","contemporary dance","performance art","experimental theatre"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'anti-ballet' refers to a type of dance that actively goes against the rules and expectations of traditional ballet. It's often used in discussions about experimental or avant-garde art forms. Understanding this term requires familiarity with both classical ballet and more contemporary art movements."},"example_sentences":[{"sentence":"The performance was a deliberate anti-ballet, challenging the audience's expectations of grace and beauty.","translation":"そのパフォーマンスは意図的なアンチバレエであり、観客の優雅さと美しさに対する期待に挑戦した。","type":"general","meaning_category":"definition"},{"sentence":"Critics praised the anti-ballet for its innovative choreography and powerful message.","translation":"批評家たちは、そのアンチバレエの革新的な振り付けと力強いメッセージを称賛した。","type":"general","meaning_category":"example"}]}