{"word":"outsallying","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(古風) (人)の才覚を上回る、(人)より機知に富む","english_definition":"(archaic) to surpass (someone) in wit or cleverness.","examples":[{"sentence":"He was known for his wit, but she managed to outsally him in the debate.","translation":"彼は機知に富んでいることで知られていたが、彼女は討論で彼を上回ることができた。"},{"sentence":"The younger generation often tries to outsally their elders in intellectual discussions.","translation":"若い世代は、知的な議論においてしばしば年長者よりも才覚で勝ろうとする。"}],"collocations":["outsally someone in a debate","outsally someone with wit","outsally someone in conversation"],"synonyms":["outwit","outsmart","surpass in wit","be more clever than"],"antonyms":["be outwitted","be less clever than"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(古風) (人)より機知に富んだ発言をする","english_definition":"(archaic) to make wittier or more clever remarks than (someone).","examples":[{"sentence":"They spent the evening outsallying each other with clever puns and anecdotes.","translation":"彼らはその晩、巧妙な駄洒落や逸話で互いに機知に富んだ発言を競い合った。"}],"collocations":["outsally each other","outsally in conversation"],"synonyms":["exchange witticisms","engage in witty repartee"],"antonyms":[]}],"etymology":{"value":"Derived from \"sally,\" meaning a witty or lively remark, combined with the prefix \"out-\" indicating surpassing or exceeding.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈsæliɪŋ/","syllables":"out-sal-ly-ing"},"inflection":{"verb_forms":{"present_simple":["outsallies"],"past_simple":"outsallied","past_participle":"outsallied","present_participle":"outsallying"}},"usage_notes":{"explanation":"\"Outsally\" is an archaic verb, meaning to surpass someone in wit or cleverness. It is rarely used in modern English. When used, it often implies a playful or competitive exchange of witty remarks. The term is more likely to be encountered in historical literature or in contexts attempting to evoke a sense of old-fashioned language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She outsallyed him in height.","correct":"✓ She outwitted him in the discussion.","note":"\"Outsally\" specifically refers to wit or cleverness, not physical attributes like height. Use \"outwit\" or a similar term for general superiority in intelligence. "},{"incorrect":"✗ The outsallying of the argument was quite amusing.","correct":"✓ The witty exchange in the argument was quite amusing.","note":"\"Outsallying\" is a verb, not a noun. To refer to the act of surpassing in wit, use a phrase like \"witty exchange\" or \"display of wit.\""}],"priority":"★★☆"},"related_words":{"derivatives":["sally (noun: a witty remark; verb: to rush forth suddenly)","outwit (verb: to be more clever than)","outsmart (verb: to be more intelligent than)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Outsally\" is a highly uncommon and archaic word, meaning to surpass someone in wit or cleverness. Due to its rarity, it is unlikely to be encountered outside of specialized or historical contexts. Understanding its meaning requires a strong grasp of vocabulary and an awareness of older English usage. It is not recommended for general use in modern English."},"example_sentences":[{"sentence":"In a battle of wits, she consistently managed to outsally her opponent.","translation":"知恵比べでは、彼女は一貫して対戦相手を上回ることができた。","type":"verb","meaning_category":"surpass in wit"},{"sentence":"The two comedians spent the evening outsallying each other with humorous anecdotes.","translation":"その二人のコメディアンは、ユーモラスな逸話で互いに機知に富んだ発言を競い合った。","type":"verb","meaning_category":"make wittier remarks"}]}