{"word":"hydroxyl","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロキシル基、水酸基 (-OH)","english_definition":"The chemical group -OH, consisting of one hydrogen atom and one oxygen atom.","examples":[{"sentence":"Ethanol contains a hydroxyl group.","translation":"エタノールはヒドロキシル基を含んでいる。"},{"sentence":"Hydroxyl radicals are important in atmospheric chemistry.","translation":"ヒドロキシルラジカルは大気化学において重要である。"}],"collocations":["hydroxyl group","hydroxyl radical"],"synonyms":["alcohol group","-OH group"],"antonyms":[]}],"etymology":{"value":"Derived from the elements hydrogen and oxygen, with '-yl' added to denote a chemical group.","priority":"★★★"},"pronunciation":{"ipa":"/haɪˈdrɒksɪl/","syllables":"hy·drox·yl"},"inflection":{"noun_plural":"hydroxyls"},"usage_notes":{"explanation":"In chemistry, a hydroxyl group is a functional group consisting of a hydrogen atom and an oxygen atom bonded together. It is commonly represented as -OH. When a hydroxyl group is bonded to a carbon atom in an organic compound, the compound is an alcohol. Hydroxyl radicals (•OH) are highly reactive species that play a significant role in atmospheric chemistry and other chemical processes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydroxyl is a element.","correct":"✓ Hydroxyl is a group.","note":"Hydroxyl is a chemical group, not an element."}],"priority":"★★☆"},"related_words":{"derivatives":["hydroxide","hydroxylation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hydroxyl' refers to a specific chemical functional group (-OH) that is fundamental in chemistry, particularly in organic chemistry and biochemistry. Understanding this term requires a background in basic chemical nomenclature and an understanding of functional groups. It's commonly encountered in discussions about alcohols, acids, and various chemical reactions. Therefore, it's more suited for advanced learners or those with a science background."},"example_sentences":[{"sentence":"The presence of a **hydroxyl** group makes the molecule polar.","translation":"ヒドロキシル基の存在が分子を極性にする。","type":"noun","meaning_category":"chemical group"},{"sentence":"**Hydroxyl** radicals are formed during the photolysis of ozone.","translation":"ヒドロキシルラジカルはオゾンの光分解中に生成される。","type":"noun","meaning_category":"chemical group"}]}