{"word":"Argia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(生物学) ハナダカトンボ属","english_definition":"(Zoology) A genus of damselflies in the family Coenagrionidae, commonly known as dancers.","examples":[{"sentence":"Argia is a diverse genus of damselflies found throughout the Americas.","translation":"ハナダカトンボ属は、アメリカ大陸全域で見られる多様なトンボの属です。"}],"collocations":["Argia species","Argia vivida","Argia sedula"],"synonyms":["dancer damselfly"],"antonyms":[]}],"etymology":{"value":"Named after Argia, a figure in Greek mythology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrdʒiə/","syllables":"Ar-gi-a"},"inflection":{"notes":"Plural: Argias"},"usage_notes":{"explanation":"Argia is a taxonomic term used in zoology, specifically referring to a genus within the damselfly family. It is most commonly encountered in scientific contexts or when discussing specific species within this genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Argia flying around my garden; it was very beautiful.","correct":"✓ I saw a damselfly flying around my garden; it was very beautiful.","note":"Unless you are certain it is an Argia, it is better to use the more general term 'damselfly'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Coenagrionidae (family)","damselfly"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Argia' is primarily used in scientific and academic contexts related to zoology and entomology. Understanding this term requires familiarity with biological classification systems. It is unlikely to be encountered in general conversation or non-scientific texts."},"example_sentences":[{"sentence":"Several species of Argia are endemic to specific regions of Central America.","translation":"ハナダカトンボ属のいくつかの種は、中央アメリカの特定の地域に固有です。","type":"noun","meaning_category":"Zoology"},{"sentence":"The males of many Argia species exhibit vibrant coloration.","translation":"多くのハナダカトンボ属の雄は、鮮やかな色彩を示します。","type":"noun","meaning_category":"Zoology"}]}