{"word":"pseudoenthusiastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"見せかけだけの熱意がある、偽の熱意を示す","english_definition":"exhibiting or characterized by insincere or artificial enthusiasm.","examples":[{"sentence":"His pseudoenthusiastic response made me suspicious.","translation":"彼の見せかけだけの熱意のある反応は私を疑わしくさせた。"},{"sentence":"She gave a pseudoenthusiastic speech, but no one was fooled.","translation":"彼女は見せかけだけの熱意のあるスピーチをしたが、誰も騙されなかった。"},{"sentence":"The sales team's pseudoenthusiastic attitude felt forced and unnatural.","translation":"営業チームの見せかけだけの熱意のある態度は、強制的で不自然に感じられた。"}],"collocations":["pseudoenthusiastic support","pseudoenthusiastic smile","pseudoenthusiastic applause"],"synonyms":["insincere","artificial","feigned","affected","contrived","false"],"antonyms":["sincere","genuine","authentic","heartfelt","real"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"enthusiastic\" (熱狂的な)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːdoʊɪnˌθuːziˈæstɪk/","syllables":"pseu-do-en-thu-si-as-tic"},"inflection":{},"usage_notes":{"explanation":"\"Pseudoenthusiastic\" describes behavior or expressions that appear enthusiastic on the surface but lack genuine feeling or conviction. It suggests an attempt to mimic enthusiasm for ulterior motives or to create a false impression. The term is often used in contexts where sincerity is valued, and the lack thereof is perceived negatively.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very pseudoenthusiastic about the project.","correct":"✓ He was pseudoenthusiastic about the project.","note":"\"Pseudoenthusiastic\" already implies a lack of genuineness, so adding intensifiers like \"very\" is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudoenthusiasm (noun)"],"related_terms":["enthusiastic","insincere","artificial","feigned"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pseudoenthusiastic\" is a relatively advanced term used to describe someone who displays enthusiasm that is not genuine or heartfelt. It combines \"pseudo-\" (meaning false or fake) with \"enthusiastic.\" This word is typically used in contexts where authenticity is important, and the insincerity is noticeable or criticized. Understanding the prefixes and root words can help in comprehending the meaning."},"example_sentences":[{"sentence":"The politician's pseudoenthusiastic endorsement of the policy was met with skepticism.","translation":"政治家の政策に対する見せかけだけの熱意のある支持は、懐疑的に受け止められた。","type":"adjective","meaning_category":"insincere enthusiasm"},{"sentence":"Despite her pseudoenthusiastic greeting, I could sense her underlying resentment.","translation":"彼女の見せかけだけの熱意のある挨拶にもかかわらず、私は彼女の根底にある恨みを感じ取ることができた。","type":"adjective","meaning_category":"artificial enthusiasm"},{"sentence":"The actor's pseudoenthusiastic performance failed to connect with the audience.","translation":"俳優の見せかけだけの熱意のある演技は、観客とのつながりを築けなかった。","type":"adjective","meaning_category":"feigned enthusiasm"}]}