{"word":"anti-horse-transport","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Opposed to the transportation of horses, especially over long distances or under conditions considered inhumane.","english_definition":"Expressing opposition to the transportation of horses, particularly when it involves long distances or conditions deemed inhumane.","examples":[{"sentence":"The anti-horse-transport activists protested outside the livestock auction.","translation":"反馬輸送活動家たちは家畜競売場の外で抗議活動を行った。"},{"sentence":"She is a vocal anti-horse-transport advocate, campaigning for stricter regulations.","translation":"彼女は声高な反馬輸送擁護者であり、より厳格な規制を求めて運動している。"}],"collocations":["anti-horse-transport activist","anti-horse-transport legislation","anti-horse-transport campaign","anti-horse-transport protest"],"synonyms":["opposed to horse transport","against horse transport"],"antonyms":["pro-horse-transport","in favor of horse transport"]}],"etymology":{"value":"Formed by combining the prefix 'anti-' (meaning against or opposed to) with the compound noun 'horse-transport' (referring to the transportation of horses).","priority":"Medium"},"pronunciation":{"ipa":"/ˌænti ˈhɔːrs ˌtrænzpɔːrt/","syllables":"an-ti-horse-trans-port"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'anti-horse-transport' is typically used in discussions and activism related to animal welfare, particularly concerning the ethical implications of transporting horses, often for slaughter or competition. It reflects a stance against practices perceived as cruel or harmful to horses.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ I am anti horse transport.","correct":"✓ I am anti-horse-transport.","note":"The compound adjective should be hyphenated for clarity."}],"priority":"Low"},"related_words":{"derivatives":["anti- (prefix)","horse","transport","animal welfare","animal rights"],"phrasal_verbs":[],"priority":"Low"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'anti-horse-transport' is a specialized term used in the context of animal welfare and ethical debates surrounding the transportation of horses. Understanding requires familiarity with the prefix 'anti-' and the concept of horse transportation. It is not a common term and would primarily be encountered in discussions or materials related to animal rights and welfare. "},"example_sentences":[{"sentence":"The group organized an anti-horse-transport demonstration to raise awareness.","translation":"そのグループは意識を高めるために反馬輸送デモを組織した。","type":"adjective","meaning_category":"Opposition to horse transportation"},{"sentence":"The proposed law aims to address anti-horse-transport concerns by setting stricter standards.","translation":"提案された法律は、より厳格な基準を設定することにより、反馬輸送の懸念に対処することを目的としている。","type":"adjective","meaning_category":"Opposition to horse transportation"}]}