{"word":"arguer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"議論する人、論争する人、口論する人","english_definition":"a person who argues or debates; someone who is fond of arguing.","examples":[{"sentence":"He's a skilled arguer, able to win most debates.","translation":"彼は熟練した議論家で、ほとんどの討論で勝つことができる。"},{"sentence":"She's a natural arguer, always ready to defend her point of view.","translation":"彼女は生まれつきの議論好きで、常に自分の意見を擁護する準備ができている。"},{"sentence":"Don't be such an arguer; sometimes it's better to just agree.","translation":"そんなに議論好きにならないで。時にはただ同意する方が良いこともある。"}],"collocations":["skilled arguer (熟練した議論家)","natural arguer (生まれつきの議論好き)","constant arguer (常に議論する人)","professional arguer (プロの議論家)"],"synonyms":["debater","contender","disputant","polemicist","quarrelsome person"],"antonyms":["conciliator","peacemaker","harmonizer"]}],"etymology":{"value":"'Arguer' is derived from the verb 'argue', which comes from the Latin word 'arguere', meaning 'to make clear, prove, assert'. The suffix '-er' is added to 'argue' to denote a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrɡjuːər/","syllables":"ar-gu-er"},"inflection":{"noun_plural":"arguers"},"usage_notes":{"explanation":"'Arguer' typically refers to someone who frequently engages in arguments or debates. The term can be neutral, describing someone who is simply good at arguing, or negative, suggesting someone who is overly fond of arguing and causing conflict. The context usually indicates the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good argument.","correct":"✓ He is a good arguer.","note":"'Argument' is a noun referring to the act of arguing, while 'arguer' is the noun referring to the person who argues."},{"incorrect":"✗ She is an argue.","correct":"✓ She is an arguer.","note":"'Argue' is a verb. The correct noun form for a person is 'arguer'."}],"priority":"★★☆"},"related_words":{"derivatives":["argue (verb: to give reasons or cite evidence in support of an idea, action, or theory, typically with the aim of persuading others to share one's view.)","argument (noun: a reason or set of reasons given with the aim of persuading others that an action or idea is right or wrong.)","argumentative (adjective: given to expressing divergent or opposite views.)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'arguer' is a noun that describes a person who often participates in arguments or debates. It is formed by adding the suffix '-er' to the verb 'argue'. The term can have both neutral and negative connotations, depending on the context. It is important to distinguish 'arguer' from 'argument', which refers to the discussion itself. While not a very common word, it is useful for describing someone who frequently engages in disputes.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician was known as a skilled **arguer** in parliamentary debates.","translation":"その政治家は、議会での討論における熟練した議論家として知られていた。","type":"noun","meaning_category":"議論する人"},{"sentence":"My brother is such an **arguer**; he always has to have the last word.","translation":"私の兄は本当に議論好きで、いつも最後に言い負かさなければ気が済まない。","type":"noun","meaning_category":"口論する人"},{"sentence":"The lawyer was a formidable **arguer** in the courtroom.","translation":"その弁護士は法廷では手ごわい議論家だった。","type":"noun","meaning_category":"議論する人"}]}