{"word":"anhinga","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アメリカ大陸、アフリカ、アジア、オーストラリアに生息する、細長い首を持つ水鳥の一種。ミズヒキドリ科に属する。","english_definition":"A slender, long-necked waterbird of the family Anhingidae, found in the Americas, Africa, Asia, and Australia.","examples":[{"sentence":"The anhinga swam underwater, its body submerged except for its long neck.","translation":"ミズヒキドリは水中で泳ぎ、長い首を除いて体は水中に沈んでいた。"},{"sentence":"Anhingas are also known as snakebirds because of their snake-like neck.","translation":"ミズヒキドリは、ヘビのような首を持つことから、snakebird（ヘビドリ）とも呼ばれている。"}],"collocations":["anhinga bird","snakebird","waterbird","freshwater habitat"],"synonyms":["snakebird","darter"],"antonyms":[]}],"etymology":{"value":"語源はブラジルのトゥピ語で「蛇の鳥」を意味する'áyinga'から。","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈhɪŋɡə/","syllables":"an-hin-ga"},"inflection":{"noun_plural":"anhingas"},"usage_notes":{"explanation":"Anhingas are known for their unique swimming style where they submerge their bodies and only their long, slender necks and heads are visible above the water, resembling a snake. They are often found in freshwater habitats such as lakes, rivers, and swamps. They spear fish with their sharp beaks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an anhinga's.","correct":"✓ I saw an anhinga.","note":"'Anhinga' is already a noun, so adding an apostrophe 's' to make it possessive is usually incorrect unless referring to something specifically belonging to that individual bird."}],"priority":"★★★"},"related_words":{"derivatives":["Anhingidae (ミズヒキドリ科)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'anhinga' refers to a specific type of bird, making it a niche term. Understanding requires familiarity with bird species and potentially ecological concepts related to wetland habitats. The etymology, stemming from a Brazilian indigenous language, adds a layer of cultural and linguistic awareness needed for full comprehension."},"example_sentences":[{"sentence":"The **anhinga** perched on a branch, drying its wings in the sun.","translation":"ミズヒキドリは枝にとまり、太陽の下で翼を乾かしていた。","type":"noun","meaning_category":"bird"},{"sentence":"We spotted an **anhinga** swimming gracefully through the swamp.","translation":"私たちはミズヒキドリが沼地を優雅に泳いでいるのを見つけた。","type":"noun","meaning_category":"bird"}]}