{"word":"courtship-and-matrimony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"求婚と結婚","english_definition":"the process or period of developing a romantic relationship, especially with a view to marriage; the state of being married.","examples":[{"sentence":"The novel explores the social conventions surrounding courtship-and-matrimony in Victorian England.","translation":"その小説は、ヴィクトリア朝イングランドにおける求婚と結婚を取り巻く社会的な慣習を探求している。"},{"sentence":"Her lectures covered various aspects of courtship-and-matrimony, from traditional customs to modern trends.","translation":"彼女の講義は、伝統的な慣習から現代の傾向まで、求婚と結婚のさまざまな側面を網羅していた。"}],"collocations":["aspects of courtship-and-matrimony","customs of courtship-and-matrimony","rituals of courtship-and-matrimony"],"synonyms":["dating and marriage","romance and marriage","engagement and marriage"],"antonyms":["divorce","separation"]}],"etymology":{"value":"A compound of 'courtship' (the process of seeking to win someone's affection and propose marriage) and 'matrimony' (the state of being married; marriage).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɔːrtʃɪp ænd ˈmætrɪmoʊni/","syllables":"court-ship and mat-ri-mo-ny"},"inflection":{"noun_plural":"courtships-and-matrimony (rare)"},"usage_notes":{"explanation":"This term is often used in formal or academic contexts when discussing the social, cultural, or historical aspects of relationships and marriage. It encompasses both the period before marriage (courtship) and the state of being married (matrimony).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book is about courtship or matrimony.","correct":"✓ The book is about courtship and matrimony.","note":"'Courtship-and-matrimony' is a combined concept, so it's usually used together rather than separately."}],"priority":"★★☆"},"related_words":{"derivatives":["courtship","matrimony","matrimonial"],"phrases":["marriage and family","love and marriage"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'courtship-and-matrimony' is a formal and somewhat archaic way of referring to the entire process of forming a romantic relationship leading to marriage, as well as the state of being married itself. It's not commonly used in everyday conversation but might appear in academic or literary contexts when discussing the history, sociology, or cultural aspects of marriage and relationships. The term emphasizes the traditional view of marriage as the ultimate goal of courtship."},"example_sentences":[{"sentence":"The course examines the historical changes in courtship-and-matrimony practices.","translation":"その講座では、求婚と結婚の慣習における歴史的な変化を検証する。","type":"general","meaning_category":"general"},{"sentence":"The novel provides a detailed depiction of courtship-and-matrimony in the 19th century.","translation":"その小説は、19世紀の求婚と結婚の詳細な描写を提供している。","type":"literary","meaning_category":"literary"},{"sentence":"Scholars often study courtship-and-matrimony to understand societal norms.","translation":"学者は社会規範を理解するために、求婚と結婚を研究することが多い。","type":"academic","meaning_category":"academic"}]}