{"word":"Godmaking","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The process or act of creating a god or gods.","english_definition":"The process or act of creating a god or gods, either literally or figuratively.","examples":[{"sentence":"The ancient Egyptians were known for their godmaking, creating a complex pantheon of deities.","translation":"古代エジプト人は、複雑な神々のパンテオンを創造する神作りで知られていました。"},{"sentence":"Some philosophers argue that humans are constantly engaged in godmaking, projecting their ideals onto abstract concepts.","translation":"一部の哲学者は、人間は常に神作りに従事しており、彼らの理想を抽象的な概念に投影していると主張しています。"}],"collocations":["engaged in godmaking","process of godmaking","act of godmaking"],"synonyms":["deification","idolization"," apotheosis","divinization"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'God' and 'making'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒdˌmeɪkɪŋ/","syllables":"God-mak-ing"},"inflection":{"noun_plural":"Godmakings"},"usage_notes":{"explanation":"'Godmaking' is a relatively rare term that refers to the creation or construction of gods, either in a literal, religious sense, or in a more figurative, philosophical sense. It can refer to the creation of deities in a polytheistic religion, or to the process of elevating individuals or concepts to a godlike status.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The godmaking was happen in the temple.","correct":"✓ The godmaking was happening in the temple.","note":"'Godmaking' is a noun, so it requires a verb to describe its action. Using the continuous tense 'was happening' is more appropriate to describe an ongoing process."}],"priority":"★★☆"},"related_words":{"derivatives":["godmaker"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Godmaking' refers to the act of creating or forming a god. This term is often used in philosophical or religious discussions to describe how societies or individuals develop their concepts of deities or elevate certain figures or ideas to a divine status. It implies a process of construction or attribution of divine qualities rather than the discovery of an existing god."},"example_sentences":[{"sentence":"The anthropologist studied the tribe's unique form of godmaking.","translation":"人類学者は、その部族の独特な神作り形態を研究しました。","type":"noun","meaning_category":"神作り"},{"sentence":"Is the act of assigning celebrity status a modern form of godmaking?","translation":"有名人の地位を与える行為は、現代の神作りの形なのでしょうか？","type":"noun","meaning_category":"神作り"},{"sentence":"Through art, humans have always been engaged in a form of godmaking.","translation":"芸術を通して、人間は常に神作りの形に従事してきました。","type":"noun","meaning_category":"神作り"}]}