{"word":"single-platform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一プラットフォームの、プラットフォームに依存しない","english_definition":"Designed to operate on only one specific platform; or, designed to operate independently of any specific platform.","examples":[{"sentence":"This application is designed as a single-platform solution for iOS.","translation":"このアプリケーションは、iOS用の単一プラットフォームソリューションとして設計されています。"},{"sentence":"The software aims to be single-platform, ensuring compatibility across various operating systems.","translation":"このソフトウェアは、さまざまなオペレーティングシステム間での互換性を保証するために、プラットフォームに依存しないことを目指しています。"}],"collocations":["single-platform application","single-platform game","single-platform development","single-platform support"],"synonyms":["platform-specific","cross-platform","platform-independent"],"antonyms":["cross-platform","multi-platform"]}],"etymology":{"value":"Combination of 'single' and 'platform,' indicating something related to or designed for one platform.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsɪŋɡəl ˈplætfɔːrm/","syllables":"sin-gle-plat-form"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"The term 'single-platform' can have two opposite meanings. In one sense, it means designed to work on only one specific operating system or hardware. In another sense, it can mean platform-independent, designed to work across multiple platforms. Context is crucial to understanding the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The website is single-platform, so it works on all devices.","correct":"The website is cross-platform, so it works on all devices.","note":"If something works on all devices, it is 'cross-platform' or 'multi-platform,' not 'single-platform' (in the platform-specific sense)."},{"incorrect":"This game is single-platform and available on both PC and Mac.","correct":"This game is cross-platform and available on both PC and Mac.","note":"The term 'single-platform' should not be used if the game is available on multiple platforms."}],"priority":"☆☆☆"},"related_words":{"derivatives":["platform","cross-platform","multi-platform"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Single-platform' is a technical term used to describe software or applications designed to run on one specific operating system or hardware environment. It can also, confusingly, mean the opposite: platform-independent software. Understanding the context is important to determine the intended meaning. It is more specialized than general vocabulary. "},"example_sentences":[{"sentence":"The company decided to focus on a single-platform strategy for their new mobile app.","translation":"その会社は、新しいモバイルアプリのために単一プラットフォーム戦略に焦点を当てることを決定しました。","type":"adjective","meaning_category":"platform-specific"},{"sentence":"The aim was to create a single-platform solution that could be used on any device.","translation":"目標は、どのデバイスでも使用できるプラットフォームに依存しないソリューションを作成することでした。","type":"adjective","meaning_category":"platform-independent"}]}