{"word":"inextensile","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"伸びない、拡張できない","english_definition":"not capable of being extended or stretched.","examples":[{"sentence":"The material used for the parachute was inextensile to prevent it from stretching too much during deployment.","translation":"パラシュートに使われた素材は、展開中に伸びすぎるのを防ぐために、伸びない素材でした。"},{"sentence":"An inextensile rope is essential for certain types of climbing activities.","translation":"伸びないロープは、特定の種類の登山活動に不可欠です。"}],"collocations":["inextensile fabric","inextensile material","inextensile rope"],"synonyms":["non-stretchable","unextendable","unexpandable","rigid"],"antonyms":["extensile","stretchable","expandable","elastic"]}],"etymology":{"value":"\"Inextensile\" is formed from the prefix \"in-\" (meaning \"not\") combined with \"extensile\" (capable of being extended).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnɪkˈstɛnsɪl/","syllables":"in-ex-ten-si-ble"},"inflection":{"adjective_forms":{"comparative":"more inextensile","superlative":"most inextensile"}},"usage_notes":{"explanation":"\"Inextensile\" is a technical term, often used in scientific or engineering contexts to describe materials or objects that do not stretch or expand under force. It is the opposite of \"extensile,\" which means capable of being stretched or extended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rubber band is inextensile.","correct":"✓ The rubber band is not inextensile. / The rubber band is extensile.","note":"Rubber bands are known for their stretchiness, so describing them as \"inextensile\" would be incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["inextensibility (noun): the quality of not being extensible","extensile (adjective): capable of being extended or stretched","extensibility (noun): the quality of being extensible"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"inextensile\" means something that cannot be stretched or extended. It's often used in technical fields like engineering or materials science to describe materials that maintain their shape and size under stress. If something is described as \"inextensile,\" it means it's rigid and doesn't stretch easily."},"example_sentences":[{"sentence":"The bridge's support cables were made of an inextensile alloy to ensure stability.","translation":"橋の支持ケーブルは、安定性を確保するために、伸びない合金で作られていました。","type":"adjective","meaning_category":"not capable of being extended"},{"sentence":"For precise measurements, it's important to use an inextensile measuring tape.","translation":"正確な測定のためには、伸びないメジャーを使用することが重要です。","type":"adjective","meaning_category":"not capable of being extended"}]}