{"word":"monochlorinated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"一塩素化された","english_definition":"Having undergone monochlorination; having had a single chlorine atom added to a molecule.","examples":[{"sentence":"The monochlorinated product was separated from the reaction mixture.","translation":"一塩素化された生成物は反応混合物から分離された。"},{"sentence":"Monochlorinated benzenes are important intermediates in chemical synthesis.","translation":"一塩素化されたベンゼン類は化学合成における重要な中間体である。"}],"collocations":["monochlorinated compound","monochlorinated benzene","monochlorinated product"],"synonyms":["chlorinated","substituted"],"antonyms":["unchlorinated","unsubstituted"]}],"etymology":{"value":"Formed from \"mono-\" (meaning one), \"chlorinated\" (having undergone chlorination, the addition of chlorine).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnəˈklɔːrɪneɪtɪd/","syllables":"mo-no-chlor-i-nat-ed"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"The term 'monochlorinated' is primarily used in chemistry to describe a molecule that has undergone a chemical reaction where a single chlorine atom has been added. It's often used in the context of organic chemistry when discussing reaction mechanisms and product formation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The substance is monochloride.","correct":"✓ The substance is monochlorinated.","note":"'Monochloride' refers to a compound containing one chloride ion, whereas 'monochlorinated' refers to a molecule that has had one chlorine atom added to it through a chemical reaction."}],"priority":"★★☆"},"related_words":{"derivatives":["monochlorination (noun): The process of adding a single chlorine atom to a molecule.","dichlorinated (adjective): Having two chlorine atoms added.","chlorinated (adjective): Having undergone chlorination; having chlorine atoms added."],"related_terms":["chlorine","chlorination","organic chemistry","substitution reaction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monochlorinated' is a technical term used in chemistry. It describes a molecule that has had one chlorine atom added to it. This term is most often found in scientific papers, textbooks, and other technical documents related to chemistry. Understanding this term requires a background in organic chemistry.","priority":"★★☆"},"example_sentences":[{"sentence":"The reaction yielded a mixture of monochlorinated and dichlorinated products.","translation":"その反応は、一塩素化された生成物と二塩素化された生成物の混合物をもたらした。","type":"adjective","meaning_category":"chemical description"},{"sentence":"The researchers studied the properties of various monochlorinated compounds.","translation":"研究者たちは、さまざまな一塩素化された化合物の特性を研究した。","type":"adjective","meaning_category":"chemical description"}]}