{"word":"Lego-literary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of a work or presentation) recreating or depicting literary works or concepts using Lego bricks and figures.","english_definition":"Describing something that recreates or represents literary works, characters, or concepts using Lego bricks and figures.","examples":[{"sentence":"The museum featured a Lego-literary exhibit, showcasing scenes from classic novels built entirely from Lego bricks.","translation":"その博物館では、レゴ文学展が開催され、古典小説の場面がすべてレゴブロックで再現されていました。"},{"sentence":"Her YouTube channel is dedicated to Lego-literary adaptations of famous poems.","translation":"彼女のYouTubeチャンネルは、有名な詩をレゴで文学的に翻案することに特化しています。"},{"sentence":"The school project required students to create a Lego-literary representation of their favorite book.","translation":"その学校のプロジェクトでは、生徒たちはお気に入りの本をレゴで文学的に表現することが求められました。"}],"collocations":["Lego-literary adaptation","Lego-literary exhibit","Lego-literary representation","Lego-literary recreation","Lego-literary version"],"synonyms":["Lego-based literary","brick-literary","Lego-themed literary"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'Lego' (the brand name of the plastic construction toys) and 'literary' (relating to literature).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɛɡoʊˌlɪtəˌrɛri/","syllables":"Le-go-li-te-ra-ry"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"The term 'Lego-literary' is used to describe creative works that combine the construction toy Lego with literary themes. This can involve recreating scenes from books, depicting characters, or even illustrating literary concepts using Lego bricks and minifigures. It's a niche but growing area of creative expression, often found in fan communities, educational settings, and art exhibits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a lego literary at the museum.","correct":"✓ I saw a Lego-literary exhibit at the museum.","note":"'Lego-literary' is an adjective, so it needs to modify a noun (e.g., exhibit, adaptation, representation)."},{"incorrect":"✗ The lego literary was very good.","correct":"✓ The Lego-literary adaptation was very good.","note":"Again, 'Lego-literary' is an adjective and needs a noun to modify."}],"priority":"★☆☆"},"related_words":{"derivatives":["Lego","literary","adaptation","recreation","representation"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (This is a niche term and not part of the CEFR vocabulary.)","frequency_google_ngram":"Low frequency (This is a relatively new and specific term.)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Lego-literary' is a specialized term used to describe the act of recreating or representing literary works or concepts using Lego bricks. Because it combines two familiar words in a novel way, understanding requires a certain level of vocabulary and cultural awareness. The term is most likely to be encountered in contexts related to art, education, or fan culture.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Lego-literary project brought Shakespeare to life for the students.","translation":"そのレゴ文学プロジェクトは、シェイクスピアを生徒たちのために生き生きと蘇らせました。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"She created a stunning Lego-literary version of 'Pride and Prejudice'.","translation":"彼女は『高慢と偏見』の素晴らしいレゴ文学版を作成しました。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The Lego-literary exhibit was a hit with both children and adults.","translation":"そのレゴ文学展は、子供にも大人にも大人気でした。","type":"adjective","meaning_category":"Descriptive"}]}