{"word":"non-wipable","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(コンピューター用語)消去できない、上書きできない","english_definition":"(computing) Not able to be wiped or erased; designed to prevent data from being erased or overwritten.","examples":[{"sentence":"The drive was designed with a non-wipable partition to store critical system files.","translation":"そのドライブは、重要なシステムファイルを保存するために、消去できないパーティションを備えて設計されました。"},{"sentence":"This memory chip is non-wipable, ensuring the data remains intact even after multiple attempts to erase it.","translation":"このメモリチップは消去不可能であり、複数回の消去試行後もデータが確実にそのまま残ります。"}],"collocations":["non-wipable partition","non-wipable memory","non-wipable storage"],"synonyms":["non-erasable","unerasable","permanent"],"antonyms":["wipable","erasable","rewritable"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'wipable'. 'Wipable' itself is derived from the verb 'to wipe', referring to the act of erasing or clearing data.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˈwaɪpəbəl/","syllables":"non-wip-a-ble"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"The term 'non-wipable' is primarily used in the context of computer science and data storage. It describes a feature or characteristic of a storage medium or memory that prevents data from being erased or overwritten. This is often implemented for security reasons or to ensure the integrity of critical system files.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The non-wipable data was accidentally deleted.","correct":"The non-wipable data could not be deleted.","note":"The term 'non-wipable' implies that the data cannot be deleted, so saying it was accidentally deleted is contradictory."}],"priority":"Medium"},"related_words":{"derivatives":["wipe (verb, noun)","wipable (adjective)","non-volatile memory"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'non-wipable' is a technical term primarily used in computer science and data security. It describes data or storage that is designed to be unerasable, often for security or system integrity purposes. Understanding this term requires familiarity with data storage concepts and security measures."},"example_sentences":[{"sentence":"The device features a **non-wipable** log that records all user activity.","translation":"このデバイスは、すべてのユーザーアクティビティを記録する消去不可能なログを備えています。","type":"adjective","meaning_category":"消去できない"},{"sentence":"The operating system resides on a **non-wipable** portion of the hard drive.","translation":"オペレーティングシステムは、ハードドライブの消去不可能な部分に存在します。","type":"adjective","meaning_category":"消去できない"}]}