{"word":"cholecystgastrostomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胆嚢胃吻合術（たんのういふんごうじゅつ）","english_definition":"A surgical procedure that creates an anastomosis (surgical connection) between the gallbladder and the stomach.","examples":[{"sentence":"Cholecystgastrostomy is rarely performed today due to the availability of safer and more effective procedures.","translation":"胆嚢胃吻合術は、より安全で効果的な手術方法が利用できるようになったため、今日ではめったに行われません。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words: 'cholecyst' (gallbladder), 'gastro' (stomach), and 'stomy' (surgical opening).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊləsɪstɡæˈstrɒstəmi/","syllables":"cho-le-cys-to-gas-tro-sto-my"},"inflection":{"noun_plural":"cholecystgastrostomies"},"usage_notes":{"explanation":"Cholecystgastrostomy is a surgical procedure that creates a direct connection between the gallbladder and the stomach. It was historically used to bypass obstructions in the distal biliary tract but is now rarely performed due to the risk of complications such as reflux and the availability of better surgical options like cholecystojejunostomy or more definitive procedures addressing the underlying cause of the obstruction.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["cholecyst (gallbladder)","gastrostomy (surgical opening into the stomach)","anastomosis (surgical connection)"],"related_procedures":["cholecystectomy (gallbladder removal)","cholecystojejunostomy (connection between gallbladder and jejunum)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Cholecystgastrostomy' is a highly technical medical term referring to a specific surgical procedure. Understanding this term requires knowledge of medical terminology related to the biliary system and surgical interventions. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The patient underwent cholecystgastrostomy to relieve the biliary obstruction.","translation":"患者は胆道閉塞を緩和するために胆嚢胃吻合術を受けた。","type":"medical","meaning_category":"surgical procedure"}]}