{"word":"periostracum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(貝殻などの)殻皮","english_definition":"The outermost organic layer of a mollusk shell.","examples":[{"sentence":"The periostracum protects the underlying shell layers from abrasion and dissolution.","translation":"殻皮は、下にある殻の層を摩耗や溶解から保護します。"},{"sentence":"In some species, the periostracum is thin and transparent, while in others it is thick and hairy.","translation":"種によっては、殻皮は薄くて透明ですが、厚くて毛深いものもあります。"}],"collocations":["outer periostracum","inner periostracum","periostracum layer","periostracum thickness"],"synonyms":["shell membrane","outer layer","cuticle"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'peri' (around, surrounding) + 'osteon' (bone) + 'stracum' (layer).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛriˈɒstrəkəm/","syllables":"per-i-os-tra-cum"},"inflection":{"noun_plural":"periostraca"},"usage_notes":{"explanation":"The periostracum is a thin, proteinaceous covering on the outside of many mollusk shells, as well as the shells of some other invertebrates. It is secreted by the mantle edge and serves to protect the underlying calcareous shell from erosion, dissolution, and boring organisms. It can vary in thickness, color, and texture depending on the species and environmental conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The periostracum is made of calcium carbonate.","correct":"✓ The periostracum is made of protein.","note":"The periostracum is an organic layer made of protein, whereas the main shell is made of calcium carbonate."}],"priority":"★★☆"},"related_words":{"derivatives":["periostracal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'periostracum' is a specialized term used in the fields of zoology, marine biology, and paleontology. It refers to the outermost organic layer of a mollusk shell, which serves a protective function. Understanding this term requires a background in biology or a related field. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The color of the periostracum can vary depending on the mollusk's diet.","translation":"殻皮の色は、軟体動物の食餌によって異なる場合があります。","type":"general","meaning_category":"description"},{"sentence":"Scientists study the periostracum to understand the environmental conditions in which the mollusk lived.","translation":"科学者たちは、軟体動物が生息していた環境条件を理解するために殻皮を研究します。","type":"scientific","meaning_category":"research"}]}