{"word":"poroscopic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(皮膚の)汗腺孔に関する、汗腺孔の","english_definition":"relating to the pores of the skin, especially those of the sweat glands.","examples":[{"sentence":"Poroscopic analysis of fingerprints can reveal unique identifying features.","translation":"指紋の汗腺孔分析は、固有の識別特徴を明らかにすることができる。"},{"sentence":"The poroscopic characteristics of the skin vary from person to person.","translation":"皮膚の汗腺孔の特徴は人によって異なる。"}],"collocations":["poroscopic detail","poroscopic examination","poroscopic features","poroscopic analysis"],"synonyms":["pore-related","dermatoscopic"],"antonyms":[]}],"etymology":{"value":"The word \"poroscopic\" is derived from the Greek words \"poros\" (pore) and \"skopein\" (to examine, view). It refers to the examination or viewing of pores, especially those of the skin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrəˈskɒpɪk/","syllables":"po-ro-scop-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, though comparative and superlative forms exist (more poroscopic, most poroscopic)."},"usage_notes":{"explanation":"\"Poroscopic\" is a technical term primarily used in the context of dermatology, forensic science, and related fields. It specifically refers to the study or characteristics of the pores of the skin, particularly sweat pores. It is often used in the analysis of fingerprints to identify unique features that can aid in identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poroscopic view showed the entire hand.","correct":"✓ The poroscopic view showed the pores in detail.","note":"\"Poroscopic\" relates specifically to pores, not the entire hand or general skin features."}],"priority":"★☆☆"},"related_words":{"derivatives":["poroscopy (名詞: 汗腺孔観察法)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語であるため、一般的なテキストにはほとんど現れません。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"poroscopic\" is highly specialized and primarily used in scientific or technical contexts, particularly in dermatology and forensic science. It refers specifically to the characteristics and examination of skin pores, especially sweat pores. Understanding this term requires a background in these fields, making it unsuitable for general language learning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The fingerprint examiner used poroscopic analysis to identify the suspect.","translation":"指紋鑑定人は、汗腺孔分析を用いて容疑者を特定した。","type":"general","meaning_category":"汗腺孔に関する"},{"sentence":"Poroscopic features are considered level 3 details in fingerprint analysis.","translation":"汗腺孔の特徴は、指紋分析におけるレベル3の詳細とみなされる。","type":"technical","meaning_category":"汗腺孔の"}]}