{"word":"pursiest","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Most like a purse; resembling a purse, especially in being puckered or wrinkled.","english_definition":"Resembling a purse, especially in being puckered or wrinkled; most like a purse.","examples":[{"sentence":"She had the pursiest little mouth, always drawn up tight.","translation":"彼女はいつもきつく引き締まった、まるで財布のような小さな口をしていた。"},{"sentence":"The old woman's face was the pursiest I had ever seen, with wrinkles gathered like a drawstring.","translation":"その老婆の顔は、私が今まで見た中で最も財布のようで、皺が巾着袋の紐のように集まっていた。"}],"collocations":["pursiest mouth","pursiest face","pursiest lips"],"synonyms":["puckered","wrinkled","gathered","contracted"],"antonyms":[]}],"etymology":{"value":"Formed from 'pursy' (resembling a purse) with the suffix '-est' to indicate the superlative degree. 'Pursy' itself comes from 'purse', referring to a small bag for carrying money.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrsiɪst/","syllables":"pur-si-est"},"inflection":{"adjective_forms":{"comparative":"more pursy","superlative":"pursiest"}},"usage_notes":{"explanation":"'Pursiest' is a superlative adjective used to describe something that most resembles a purse, particularly in its puckered or wrinkled appearance. It is often used to describe someone's mouth or face. This word is not commonly used and may be considered somewhat archaic or humorous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pursiest dog.","correct":"✓ The dog with the pursiest face.","note":"'Pursiest' typically describes a mouth or face, not an entire animal. Use it to describe a specific feature that resembles a purse."},{"incorrect":"✗ He was pursiest after winning the lottery.","correct":"✓ He was the happiest after winning the lottery.","note":"'Pursiest' describes physical appearance, not emotional state. Use 'happiest' or another appropriate adjective to describe emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["pursy (adjective: resembling a purse)","purse (noun: a small bag for carrying money)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare; not commonly found in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pursiest' is a rare and somewhat archaic word. It is used to describe something that most resembles a purse, usually in terms of being puckered or wrinkled. Due to its rarity, it is unlikely to be encountered in everyday language and is more likely to be found in older literature or descriptive writing. Understanding the root word 'purse' and the suffix '-iest' is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"Of all the villagers, Mrs. Higgins had the **pursiest** lips, always tightly closed as if guarding a secret.","translation":"村人の中で、ヒギンズ夫人は最も財布のような唇をしており、まるで秘密を守るかのようにいつも固く閉じていた。","type":"adjective","meaning_category":"resembling a purse"},{"sentence":"The old doll's face was the **pursiest** I had ever seen, its painted features cracking and gathering like the folds of an ancient coin purse.","translation":"その古い人形の顔は、私が今まで見た中で最も財布のようで、描かれた顔立ちはひび割れ、古代の小銭入れのひだのように集まっていた。","type":"adjective","meaning_category":"resembling a purse"}]}