{"word":"Ammonitish","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"アンモン人（古代イスラエル東方に居住していた民族）の、アンモン人に関する","english_definition":"Of or pertaining to the Ammonites, an ancient Semitic-speaking people who inhabited the region east of the Jordan River (present-day Jordan).","examples":[{"sentence":"The Bible mentions Ammonitish kings and their conflicts with Israel.","translation":"聖書にはアンモン人の王たちと彼らのイスラエルとの紛争について記述がある。"},{"sentence":"Archaeological excavations have uncovered Ammonitish settlements in the area.","translation":"考古学的発掘調査により、その地域でアンモン人の集落が発見された。"}],"collocations":["Ammonitish king","Ammonitish territory","Ammonitish language","Ammonitish artifacts"],"synonyms":["Ammonite","Ammonitic"],"antonyms":[]}],"etymology":{"value":"From \"Ammonite\" (referring to the people) + \"-ish\" (suffix indicating origin or relation). \"Ammonite\" itself comes from \"Ammon,\" the name of their ancestor and chief deity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæmənaɪtɪʃ/","syllables":"Am-mo-ni-tish"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"Ammonitish\" is primarily used in historical, archaeological, and religious contexts when discussing the ancient Ammonites. It is less common in everyday language. The term \"Ammonite\" is also used, often interchangeably, but \"Ammonitish\" specifically denotes something related to or characteristic of the Ammonites.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke Ammonitish fluently.","correct":"✓ He spoke the Ammonitish language fluently.","note":"While technically understandable, it's better to specify \"Ammonitish language\" rather than just \"Ammonitish\" when referring to the language itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Ammonite (noun, adjective: アンモン人、アンモン人の)","Ammon (noun: アンモン - アンモン人の祖先であり主神の名前)"],"phrases":["Children of Ammon (アンモンの子ら - 聖書におけるアンモン人の呼称)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized Vocabulary)","frequency_google_ngram":"Low frequency (低頻度) - Primarily found in historical or religious texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Ammonitish\" is a specialized term used in the context of ancient history, archaeology, and religious studies, specifically relating to the Ammonites, an ancient people mentioned in the Bible. It is not a commonly used word in modern English. Understanding its meaning requires knowledge of ancient Near Eastern history and biblical references.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed various Ammonitish pottery and tools.","translation":"博物館には様々なアンモン人の陶器や道具が展示されていた。","type":"adjective","meaning_category":"pertaining to the Ammonites"},{"sentence":"Scholars study Ammonitish inscriptions to learn more about their culture.","translation":"学者たちはアンモン人の文化についてより深く知るために、アンモン人の碑文を研究している。","type":"adjective","meaning_category":"pertaining to the Ammonites"}]}