{"word":"antigravitate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"反重力で浮揚する、重力に逆らう","english_definition":"To rise or float by means of antigravity; to counteract gravity.","examples":[{"sentence":"The experimental craft was designed to antigravitate.","translation":"その実験機は反重力で浮揚するように設計された。"},{"sentence":"The scientist theorized that certain materials could antigravitate under specific conditions.","translation":"科学者は、特定の条件下では特定の物質が反重力で浮揚する可能性があると理論づけた。"}],"collocations":["antigravitate upwards","begin to antigravitate"],"synonyms":["levitate","float","rise","defy gravity"],"antonyms":["gravitate","fall","descend"]},{"part_of_speech":"verb","transitivity":"vt","definition":"反重力によって～を浮揚させる、～の重力を打ち消す","english_definition":"To cause to rise or float by means of antigravity; to counteract the gravity of something.","examples":[{"sentence":"The device was meant to antigravitate heavy objects.","translation":"その装置は重い物体を反重力で浮揚させることを目的としていた。"},{"sentence":"They hoped to develop technology that could antigravitate entire buildings.","translation":"彼らは建物全体を反重力で浮揚させることができる技術の開発を望んでいた。"}],"collocations":["antigravitate a load","antigravitate a vehicle"],"synonyms":["levitate","suspend","lift","counteract gravity"],"antonyms":["weigh down","ground","anchor"]}],"etymology":{"value":"\"anti-\" (反対) + \"gravitate\" (重力に引かれる)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈɡrævɪteɪt/","syllables":"an-ti-grav-i-tate"},"inflection":{"verb_forms":{"present_simple":["antigravitate","antigravitates"],"past_simple":"antigravitated","past_participle":"antigravitated","present_participle":"antigravitating"}},"usage_notes":{"explanation":"\"Antigravitate\" is a relatively rare word, primarily used in science fiction or theoretical contexts. It describes the act of defying or counteracting gravity, either naturally or through technological means. It is often used when discussing hypothetical technologies or phenomena.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antigravitating car flew through the sky.","correct":"✓ The car, which was antigravitating, flew through the sky.","note":"While 'antigravitating' can act as an adjective, it is more commonly used as a verb. Therefore, it is better to use a relative clause or rephrase the sentence. "},{"incorrect":"✗ The object antigravitated because magic.","correct":"✓ The object antigravitated due to a mysterious force.","note":"Antigravitation usually implies a scientific or unexplained force, not magic."}],"priority":"★☆☆"},"related_words":{"derivatives":["antigravity (noun: 反重力)"],"related_terms":["gravitate (verb: 重力に引かれる)","levitation (noun: 空中浮揚)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Antigravitate\" is a highly specialized term, primarily encountered in science fiction or advanced scientific discussions. It describes the act of defying or counteracting gravity. Understanding this word requires familiarity with the concept of gravity and the prefix \"anti-\", which denotes opposition or reversal. Due to its rarity and specific context, it is not typically part of general vocabulary. "},"example_sentences":[{"sentence":"The inventor claimed his device could antigravitate any object, regardless of its mass.","translation":"発明者は、彼の装置は質量に関係なく、どんな物体でも反重力で浮揚させることができると主張した。","type":"verb (vt)","meaning_category":"反重力によって～を浮揚させる"},{"sentence":"As the energy field intensified, the small metal ball began to antigravitate.","translation":"エネルギー場が強まるにつれて、小さな金属球は反重力で浮揚し始めた。","type":"verb (vi)","meaning_category":"反重力で浮揚する"}]}