{"word":"coenacted","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律などを)共同で制定する、共同で制定して成立させる","english_definition":"to enact (a law, etc.) jointly or together.","examples":[{"sentence":"The bill was coenacted by both houses of the legislature.","translation":"その法案は議会の両院によって共同で制定された。"},{"sentence":"The two countries coenacted a treaty to promote trade.","translation":"その二国は貿易を促進するための条約を共同で制定した。"}],"collocations":["coenact a law","coenact legislation","coenact a treaty"],"synonyms":["jointly enact","collectively legislate","mutually establish"],"antonyms":["unilaterally enact","individually legislate"]}],"etymology":{"value":"The word \"coenacted\" is formed by combining the prefix \"co-\" (meaning \"together\" or \"jointly\") with the verb \"enact\" (meaning \"to make into law\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɪˈnæktɪd/","syllables":"co-e-nac-ted"},"inflection":{"verb_forms":{"present_simple":["coenact","coenacts"],"past_simple":"coenacted","past_participle":"coenacted","present_participle":"coenacting"}},"usage_notes":{"explanation":"\"Coenacted\" is a relatively rare word, primarily used in legal or political contexts to emphasize the joint or collaborative nature of enacting a law or regulation. It highlights that multiple parties or entities were involved in the legislative process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The law was coenacted by one person.","correct":"✓ The law was coenacted by multiple parties.","note":"\"Coenacted\" implies joint action, so it cannot be used when a single person or entity enacts something."}],"priority":"★☆☆"},"related_words":{"derivatives":["coenactment (noun)"],"related_terms":["enact","legislate","jointly","collaboratively"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"coenacted\" is a formal term used in legal and political contexts to describe the joint enactment of laws or regulations. It emphasizes the collaborative nature of the legislative process, where multiple parties or entities are involved in creating and passing legislation. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The environmental regulations were coenacted by the state and federal governments.","translation":"その環境規制は州政府と連邦政府によって共同で制定された。","type":"example"},{"sentence":"The new education policy was coenacted after extensive consultations with teachers and parents.","translation":"その新しい教育政策は、教師と保護者との広範な協議の後に共同で制定された。","type":"example"}]}