{"word":"pseudopionnotes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A collection of notes or writings falsely attributed to a particular author.","english_definition":"A collection of notes or writings falsely attributed to a particular author.","examples":[{"sentence":"The library contained several pseudopionnotes, making it difficult to ascertain the true author of the original works.","translation":"その図書館にはいくつかの偽の著作集があり、元の作品の真の作者を特定するのが困難になっていた。"}],"collocations":["collection of pseudopionnotes","historical pseudopionnotes"],"synonyms":["apocrypha","pseudepigrapha"],"antonyms":[]}],"etymology":{"value":"The word 'pseudopionnotes' is constructed from the Greek roots 'pseudo-' (false) + 'pionnotes' (a hypothetical collection of notes, derived from 'pion' meaning fat, rich, or abundant, and 'notes' referring to written records). The 'pion' element is speculative and might imply a rich or substantial collection, albeit falsely attributed.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈpaɪənˌnoʊts/","syllables":"pseu-do-pi-on-notes"},"inflection":{"noun_plural":"pseudopionnotes (same as singular)"},"usage_notes":{"explanation":"This word is extremely rare and not commonly found in general usage. It refers specifically to a collection of writings that are falsely attributed to a particular author, often to lend credibility or importance to the work.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a pseudopionnote about the war.","correct":"✓ He compiled a collection of pseudopionnotes about the war.","note":"The word refers to a collection, not a single writing. Use it to describe a set of falsely attributed notes."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or fake)","annotation (related to notes)","attribution (related to authorship)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare, not in CEFR vocabulary)","frequency_google_ngram":"Extremely rare (not found in common corpora)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudopionnotes' is a highly specialized and rare term, unlikely to be encountered outside of academic contexts related to literature, history, or archival studies. Its meaning is derived from its Greek roots, indicating a collection of notes falsely attributed to an author. Understanding this word requires a strong vocabulary and familiarity with academic discourse.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scholar meticulously examined the pseudopionnotes to uncover the true origins of the text.","translation":"その学者は、テキストの真の起源を明らかにするために、偽の著作集を綿密に調べた。","type":"noun","meaning_category":"collection of falsely attributed notes"}]}