{"word":"electromyography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"筋電図検査、筋電図法","english_definition":"a diagnostic procedure to assess the health of muscles and the nerve cells that control them (motor neurons).","examples":[{"sentence":"Electromyography is often used to diagnose neuromuscular disorders.","translation":"筋電図検査は、神経筋疾患の診断によく用いられます。"},{"sentence":"The doctor recommended electromyography to determine the cause of my muscle weakness.","translation":"医師は、私の筋力低下の原因を特定するために筋電図検査を勧めました。"}],"collocations":["needle electromyography (針筋電図検査)","surface electromyography (表面筋電図検査)","EMG (筋電図検査の略称)"],"synonyms":["EMG","muscle test","nerve conduction study (NCS) - often used in conjunction with EMG"],"antonyms":[]}],"etymology":{"value":"「electro-」（電気）+「myo-」（筋肉）+「-graphy」（記録）の組み合わせ。電気的な活動を筋肉で記録することを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊmaɪˈɒɡrəfi/","syllables":"e-lec-tro-my-og-ra-phy"},"inflection":{"noun_plural":"electromyographies"},"usage_notes":{"explanation":"Electromyography (EMG) is a diagnostic test that records the electrical activity of muscles. It is used to detect neuromuscular abnormalities. There are two main types: needle EMG, which involves inserting a needle electrode into the muscle, and surface EMG, which uses electrodes placed on the skin. EMG is often performed in conjunction with nerve conduction studies (NCS).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a electromyography done.","correct":"✓ I had an electromyography done.","note":"'Electromyography' starts with a vowel sound, so use the indefinite article 'an' instead of 'a'."},{"incorrect":"✗ Electromyography are used to diagnose muscle problems.","correct":"✓ Electromyography is used to diagnose muscle problems.","note":"'Electromyography' is a singular noun referring to a diagnostic procedure, so use the singular verb 'is'."}],"priority":"★★☆"},"related_words":{"derivatives":["electromyogram (筋電図)","electromyograph (筋電計)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学分野の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**electromyography**」は、筋肉とその筋肉をコントロールする神経細胞（運動ニューロン）の健康状態を評価するための診断手順です。この検査では、筋肉の電気的活動を記録します。通常、神経筋疾患の診断に使用されます。針筋電図検査と表面筋電図検査の2種類があります。医学や生理学の分野でよく使われる専門用語です。"},"example_sentences":[{"sentence":"The electromyography results showed evidence of nerve damage.","translation":"筋電図検査の結果は、神経損傷の証拠を示していました。","type":"noun","meaning_category":"筋電図検査"},{"sentence":"Electromyography can help differentiate between muscle and nerve disorders.","translation":"筋電図検査は、筋肉疾患と神経疾患の区別に役立ちます。","type":"noun","meaning_category":"筋電図検査"},{"sentence":"During the electromyography, the doctor inserted a thin needle into my muscle.","translation":"筋電図検査中、医師は私の筋肉に細い針を挿入しました。","type":"noun","meaning_category":"筋電図検査"}]}