{"word":"refrangent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"屈折性の、光線を屈折させる","english_definition":"Causing refraction; having the property of refracting light or other waves.","examples":[{"sentence":"The refrangent qualities of the prism separated the white light into a spectrum.","translation":"プリズムの屈折性によって、白色光がスペクトルに分離された。"},{"sentence":"Certain materials are more refrangent than others, affecting how light passes through them.","translation":"特定の材料は他の材料よりも屈折性が高く、光の透過に影響を与える。"}],"collocations":["refrangent material","refrangent surface","highly refrangent"],"synonyms":["refractive","refracting","dioptric"],"antonyms":["opaque","non-refractive"]}],"etymology":{"value":"From Latin 'refrangens', present participle of 'refrangere' meaning 'to break back, refract', from 're-' (back) + 'frangere' (to break).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfrændʒənt/","syllables":"re-fran-gent"},"inflection":{"notes":"Comparative: more refrangent; Superlative: most refrangent"},"usage_notes":{"explanation":"'Refrangent' is a technical term primarily used in physics and optics to describe materials or objects that have the ability to refract light. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refrangent sound of the bell echoed through the valley.","correct":"✓ The resonant sound of the bell echoed through the valley.","note":"'Refrangent' refers specifically to the bending of light, not sound. Use 'resonant' or another appropriate adjective for sound. "},{"incorrect":"✗ The refrangent painting shimmered in the sunlight.","correct":"✓ The refractive painting shimmered in the sunlight.","note":"While 'refrangent' is technically correct, 'refractive' is more commonly used. "},{"incorrect":"✗ The refrangent qualities made the water clear.","correct":"✓ The transparent qualities made the water clear.","note":"'Refrangent' describes how light bends, not how clear something is. Use 'transparent' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["refrangibility (noun): The property of being refrangible; the degree to which a substance can refract light.","refraction (noun): The bending of light or sound waves as they pass from one medium to another.","refract (verb): To deflect (light or sound) from a straight path.","refractive (adjective): Relating to or causing refraction."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a technical term not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Refrangent' is a specialized term used in physics and optics to describe the property of a material that causes light to bend (refract) as it passes through it. This word is not typically encountered in everyday conversation or general writing, and is more likely to appear in scientific or technical contexts. Understanding this term requires a familiarity with the principles of light and optics.","priority":"★★☆"},"example_sentences":[{"sentence":"The lens was designed with a highly refrangent material to focus the light precisely.","translation":"そのレンズは、光を正確に集光するために、高い屈折率を持つ材料で設計された。","type":"adjective","meaning_category":"屈折性の"},{"sentence":"The refrangent properties of the crystal allowed for the creation of a beautiful rainbow effect.","translation":"その結晶の屈折特性により、美しい虹の効果が生み出された。","type":"adjective","meaning_category":"屈折性の"},{"sentence":"Scientists studied the refrangent behavior of different liquids under varying pressures.","translation":"科学者たちは、さまざまな圧力下での異なる液体の屈折挙動を研究した。","type":"adjective","meaning_category":"屈折性の"}]}