{"word":"impairable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"損なうことができる、傷つけることができる、悪化させることができる","english_definition":"Capable of being impaired; susceptible to being damaged, weakened, or diminished.","examples":[{"sentence":"The antique vase was highly impairable due to its fragile nature.","translation":"そのアンティークの花瓶は、壊れやすいため非常に損なわれやすかった。"},{"sentence":"The child's developing immune system is easily impairable by exposure to certain toxins.","translation":"子供の発達中の免疫システムは、特定の毒素にさらされることで容易に損なわれる可能性がある。"},{"sentence":"While the contract seemed solid, some clauses were potentially impairable under specific legal challenges.","translation":"契約は堅固に見えたが、特定の法的異議申し立ての下では、いくつかの条項が損なわれる可能性があった。"}],"collocations":["easily impairable (容易に損なわれる)","potentially impairable (潜在的に損なわれる)","highly impairable (非常に損なわれる)"],"synonyms":["vulnerable","susceptible","liable","weak","fragile","sensitive"],"antonyms":["unimpairable","invulnerable","impervious","strong","robust","resilient"]}],"etymology":{"value":"The word 'impairable' is formed by adding the suffix '-able' to the verb 'impair'. 'Impair' comes from the Old French 'empeirer', meaning 'to make worse', which in turn comes from the Latin 'im-' (intensive prefix) + 'pejorare' (to make worse, from 'pejor' meaning worse).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpeərəbəl/","syllables":"im-pair-a-ble"},"inflection":{"notes":"Adjectives in English do not inflect for number or gender. Comparative and superlative forms are 'more impairable' and 'most impairable', respectively, although these are less common than using 'easily impairable' with adverbs like 'more' or 'less'."},"usage_notes":{"explanation":"'Impairable' is a relatively uncommon word, generally used in formal or technical contexts. It describes something that has the potential to be damaged or weakened. It is often used to describe abstract concepts like rights, contracts, or functions, as well as physical objects. The more common way to express this idea is to use phrases like 'susceptible to damage' or 'can be impaired'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impairable child was kept inside during the storm.","correct":"✓ The vulnerable child was kept inside during the storm.","note":"'Impairable' describes something that can be damaged, not a person who is already impaired. Use 'vulnerable' or 'susceptible' to describe a person who is easily harmed."},{"incorrect":"✗ The strength of the metal was impairable.","correct":"✓ The strength of the metal was capable of being impaired. / ✓ The strength of the metal could be impaired.","note":"It's more natural to say 'capable of being impaired' or 'could be impaired' than to use 'impairable' directly to describe a quality."}],"priority":"★★☆"},"related_words":{"derivatives":["impair (verb: to weaken or damage something)","impairment (noun: the state of being impaired; damage or weakness)","unimpairable (adjective: not capable of being impaired)"],"phrases":["Susceptible to impairment","Capable of being impaired"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impairable' is a formal and relatively uncommon adjective. It means 'capable of being damaged or weakened'. You're more likely to encounter phrases like 'susceptible to damage' or 'can be impaired' instead. This word is most often used in legal, technical, or highly descriptive contexts. Due to its infrequent use, it's more important to understand the meaning of 'impair' and 'impairment'. "},"example_sentences":[{"sentence":"The historical document was highly impairable by exposure to light and humidity.","translation":"その歴史的文書は、光や湿気にさらされることで非常に損なわれやすかった。","type":"adjective","meaning_category":"susceptible to damage"},{"sentence":"The software's security was impairable through a known vulnerability.","translation":"そのソフトウェアのセキュリティは、既知の脆弱性を通じて損なわれる可能性があった。","type":"adjective","meaning_category":"capable of being weakened"},{"sentence":"The structural integrity of the bridge was impairable by prolonged exposure to saltwater.","translation":"橋の構造的完全性は、海水に長期間さらされることで損なわれる可能性があった。","type":"adjective","meaning_category":"liable to be damaged"}]}