{"word":"Acaleph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"有櫛動物、または腔腸動物の遊泳性の動物","english_definition":"A free-swimming marine animal, such as a jellyfish or comb jelly.","examples":[{"sentence":"The beach was covered in acalephs after the storm.","translation":"嵐の後、海岸はたくさんの浮遊性腔腸動物で覆われていた。"},{"sentence":"Acalephs are an important part of the marine ecosystem.","translation":"有櫛動物は海洋生態系の重要な一部である。"}],"collocations":[],"synonyms":["jellyfish","comb jelly","medusa"],"antonyms":[]}],"etymology":{"value":"Derived from Ancient Greek ἀκαλήφη (akalḗphē), a name used by Aristotle for jellyfish and similar creatures.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈækəˌlɛf/","syllables":"a-ca-leph"},"inflection":{"noun_plural":"acalephs"},"usage_notes":{"explanation":"The term 'Acaleph' is somewhat archaic and not commonly used in modern scientific classification. It historically referred to jellyfish and related gelatinous marine animals, but these are now classified into more specific groups such as Cnidaria (jellyfish, corals, etc.) and Ctenophora (comb jellies).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Acaleph are invertebrates.","correct":"✓ Acalephs are invertebrates.","note":"'Acaleph' is a countable noun and requires pluralization when referring to multiple organisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["acalephan (adjective)"],"related_terms":["Cnidaria","Ctenophora","jellyfish","comb jelly"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acaleph' is a technical term, primarily used in historical or specialized contexts within marine biology. It is not a common word in everyday language. Understanding requires familiarity with scientific classification and marine ecosystems."},"example_sentences":[{"sentence":"Early marine biologists often grouped jellyfish and similar creatures under the term 'acaleph'.","translation":"初期の海洋生物学者は、クラゲや類似の生物を「浮遊性腔腸動物」という用語でまとめることが多かった。","type":"noun","meaning_category":"scientific classification"},{"sentence":"The diversity of acalephs in tropical waters is remarkable.","translation":"熱帯の海域における浮遊性腔腸動物の多様性は注目に値する。","type":"noun","meaning_category":"marine biology"}]}