{"word":"Medea","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メデイア：ギリシア神話のコルキスの王女。魔法使いであり、イアソンと結婚してアルゴナウタイの冒険を助けたが、後にイアソンに裏切られ、復讐のために自分の子供たちを殺害したとされる。","english_definition":"(Greek mythology) A sorceress, daughter of King Aeëtes of Colchis, who helped Jason and the Argonauts gain the Golden Fleece; when Jason abandoned her, she killed their children in revenge.","examples":[{"sentence":"The play Medea explores themes of betrayal and revenge.","translation":"戯曲『メデイア』は、裏切りと復讐というテーマを探求している。"},{"sentence":"Medea is a tragic figure in Greek mythology.","translation":"メデイアはギリシア神話における悲劇的な人物である。"}],"collocations":["Medea's revenge (メデイアの復讐)","the Medea complex (メデイア・コンプレックス：母親が子供を殺害する心理状態)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ギリシア語の Μήδεια (Mēdeia) に由来。意味は不明だが、「知恵」「策略」などに関連する可能性がある。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈdiːə/","syllables":"Me-de-a"},"inflection":{"notes":"固有名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**Medea**」は、主にギリシア神話に登場する人物の名前として使われます。彼女は魔法使いであり、イアソンと結婚してアルゴナウタイの冒険を助けましたが、後にイアソンに裏切られ、復讐のために自分の子供たちを殺害したという悲劇的な物語で知られています。この物語は、エウリピデスの戯曲『メデイア』をはじめ、多くの文学作品や芸術作品の題材となっています。心理学用語の「メデイア・コンプレックス」は、母親が子供を殺害する心理状態を指し、この神話に由来します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Medea was a hero.","correct":"✓ Medea was a tragic figure.","note":"Medeaは、物語の展開や彼女の行動から、一般的に「英雄」とは見なされません。悲劇的な人物として描かれることが多いです。"},{"incorrect":"✗ Medea is a comedy.","correct":"✓ Medea is a tragedy.","note":"エウリピデスの戯曲『メデイア』は、悲劇です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Medean (形容詞：メデイアの、メデイアに関する)"],"related_characters":["Jason (イアソン)","Aeëtes (アイエテス：メデイアの父)","Argonauts (アルゴナウタイ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (神話や文学に関する高度な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われませんが、文学、演劇、心理学などの分野では言及されることがあります。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Medea**」はギリシャ神話に登場する人物の名前で、エウリピデスの悲劇『メデイア』でよく知られています。彼女はコルキスの王女であり、魔法使いで、イアソンと結婚してアルゴナウタイの冒険を助けました。しかし、イアソンに裏切られた後、復讐のために自分の子供たちを殺害するという悲劇的な運命をたどります。この物語は、裏切り、復讐、母性といったテーマを探求しており、文学、演劇、心理学などの分野で頻繁に言及されます。一般的な会話ではあまり使われませんが、これらの分野に関心のある人にとっては重要な単語です。"},"example_sentences":[{"sentence":"Euripides' **Medea** is a powerful exploration of female rage.","translation":"エウリピデスの『メデイア』は、女性の怒りを力強く探求した作品である。","type":"noun","meaning_category":"ギリシア神話の人物"},{"sentence":"The actress gave a compelling performance as **Medea**.","translation":"その女優はメデイア役を説得力を持って演じた。","type":"noun","meaning_category":"ギリシア神話の人物"},{"sentence":"The **Medea** complex is a term used to describe a mother's infanticidal tendencies.","translation":"メデイア・コンプレックスは、母親が幼児殺害の傾向を示す状態を指す言葉である。","type":"noun","meaning_category":"心理学用語"}]}