{"word":"lubricants","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"潤滑剤","english_definition":"A substance, such as oil or grease, used to minimize friction between moving parts.","examples":[{"sentence":"The machine requires regular application of lubricants to prevent wear and tear.","translation":"その機械は、摩耗を防ぐために定期的な潤滑剤の塗布が必要です。"},{"sentence":"Synthetic lubricants offer superior performance in extreme temperatures.","translation":"合成潤滑剤は、極端な温度下で優れた性能を発揮します。"},{"sentence":"Different types of lubricants are used for various applications, such as engine oil for cars and grease for bearings.","translation":"さまざまな種類の潤滑剤が、自動車のエンジンオイルやベアリングのグリースなど、さまざまな用途に使用されます。"}],"collocations":["apply lubricants","synthetic lubricants","mineral oil lubricants","solid lubricants","grease lubricants"],"synonyms":["oil","grease","lube","lubricating oil","lubricating agent"],"antonyms":["abrasive","friction material"]}],"etymology":{"value":"From the verb 'lubricate,' which comes from the Latin word 'lubricare,' meaning 'to make slippery.'","priority":"★★★"},"pronunciation":{"ipa":"ˈluːbrɪkənts","syllables":"lu-bri-cants"},"inflection":{"noun_plural":"lubricants","noun_singular":"lubricant"},"usage_notes":{"explanation":"'Lubricants' is a plural noun referring to substances used to reduce friction. The singular form is 'lubricant.' These substances can be liquid (like oil), semi-solid (like grease), or even solid (like graphite). They are essential in machinery and engines to ensure smooth operation and prevent damage from friction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a lubricant for his dry skin.","correct":"✓ He used a moisturizer for his dry skin.","note":"While some lubricants can be used on skin, 'lubricant' typically refers to industrial or mechanical applications. Use 'moisturizer' or 'lotion' for skin. "},{"incorrect":"✗ The car engine needs lubricant.","correct":"✓ The car engine needs lubricant. / ✓ The car engine needs lubricants.","note":"'Lubricant' is the singular form. If referring to the general need for such substances, either the singular or plural is acceptable, but 'lubricants' is more common in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["lubricate (verb)","lubrication (noun)","lubricative (adjective)","lubricity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency but common in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Lubricants' refers to substances used to reduce friction between moving parts. It's a technical term commonly found in engineering, automotive, and manufacturing contexts. The word implies a function of making surfaces slippery to minimize wear and tear. Understanding this term is important for anyone working with machinery or engines.","priority":"★★☆"},"example_sentences":[{"sentence":"Regular maintenance includes checking and replenishing the lubricants in the machinery.","translation":"定期的なメンテナンスには、機械の潤滑剤の点検と補充が含まれます。","type":"noun","meaning_category":"潤滑剤"},{"sentence":"The use of high-quality lubricants can extend the lifespan of mechanical components.","translation":"高品質の潤滑剤を使用することで、機械部品の寿命を延ばすことができます。","type":"noun","meaning_category":"潤滑剤"},{"sentence":"Solid lubricants, such as graphite and molybdenum disulfide, are used in high-temperature applications.","translation":"グラファイトや二硫化モリブデンなどの固体潤滑剤は、高温の用途で使用されます。","type":"noun","meaning_category":"潤滑剤"}]}