{"word":"Silipan","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"Silipan is a barangay in the municipality of San Mariano, Isabela, Philippines.","english_definition":"Silipan is a barangay in the municipality of San Mariano, Isabela, Philippines. A barangay is the smallest administrative division in the Philippines.","examples":[{"sentence":"The residents of Silipan are primarily engaged in agriculture.","translation":"Silipanの住民は主に農業に従事しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Silipan' likely originates from a local term or characteristic of the area, but specific etymological details are not widely documented.","priority":"☆☆☆"},"pronunciation":{"ipa":"/sɪˈliːpɑːn/","syllables":"Si-li-pan"},"inflection":{},"usage_notes":{"explanation":"'Silipan' is primarily used as a geographical reference to the barangay in San Mariano, Isabela. It is not commonly used in general conversation outside of discussions related to that specific region.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["San Mariano (municipality)","Isabela (province)","barangay (administrative division)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, specific to the region.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Silipan' is a proper noun referring to a specific location in the Philippines. Understanding its meaning requires knowledge of Philippine geography and administrative divisions. It is not a word used in general English conversation.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The local government of San Mariano provides services to the residents of Silipan.","translation":"サン・マリアーノの地方政府は、Silipanの住民にサービスを提供しています。","type":"geographical reference","meaning_category":"location"},{"sentence":"Agricultural products from Silipan are sold in the nearby markets.","translation":"Silipanからの農産物は、近くの市場で販売されています。","type":"economic activity","meaning_category":"economy"}]}