{"word":"densitometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"濃度計、測色濃度計","english_definition":"An instrument for measuring the optical density or darkness of a material, especially photographic or printed material.","examples":[{"sentence":"The technician used a densitometer to check the film density.","translation":"技術者は濃度計を使ってフィルムの濃度をチェックした。"},{"sentence":"Densitometers are essential tools in the printing industry for quality control.","translation":"濃度計は印刷業界において品質管理に不可欠なツールです。"}],"collocations":["transmission densitometer (透過濃度計)","reflection densitometer (反射濃度計)","color densitometer (カラー濃度計)","measure density (濃度を測定する)","calibrate densitometer (濃度計を校正する)"],"synonyms":["density meter","reflectometer","colorimeter"],"antonyms":[]}],"etymology":{"value":"From 'density' + '-meter'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌdɛnsɪˈtɒmɪtər/","syllables":"den-si-tom-e-ter"},"inflection":{"noun_plural":"densitometers"},"usage_notes":{"explanation":"A densitometer is used to measure the degree to which a material absorbs or transmits light. It is commonly used in photography, printing, and medical imaging to ensure consistent and accurate results. There are two main types: transmission densitometers, which measure the light passing through a transparent material, and reflection densitometers, which measure the light reflected from a surface.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["densitometry (名詞: 濃度測定法)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"A densitometer is a specialized instrument used to measure the optical density of materials, particularly in fields like photography and printing. It determines how much light passes through or is reflected by a substance, providing a quantitative measure of its darkness or opacity. Understanding its function requires familiarity with technical concepts related to light and material properties."},"example_sentences":[{"sentence":"The print shop uses a densitometer daily to maintain color accuracy.","translation":"印刷所では、色の精度を維持するために毎日濃度計を使用しています。","type":"general","meaning_category":"measurement"},{"sentence":"The radiologist relied on the densitometer readings to assess bone density.","translation":"放射線科医は、骨密度を評価するために濃度計の測定値に頼っていました。","type":"medical","meaning_category":"medical imaging"}]}