{"word":"over-malted","meanings":[{"part_of_speech":"adjective","definition":"過度に麦芽化した、麦芽化しすぎた","english_definition":"Having undergone excessive or improper malting; containing too much malt.","examples":[{"sentence":"The beer had an off-flavor due to the over-malted barley.","translation":"そのビールは、麦芽化しすぎた大麦が原因で異臭がした。"},{"sentence":"An over-malted grain can lead to a cloyingly sweet taste in the final product.","translation":"麦芽化しすぎた穀物は、最終製品に甘ったるい味をもたらす可能性がある。"}],"collocations":["over-malted barley","over-malted grain","over-malted wort"],"synonyms":["excessively malted"],"antonyms":["under-malted"],"notes":"Typically used in the context of brewing or distilling."}],"etymology":{"value":"Formed by combining the prefix 'over-' (meaning 'excessively') with the adjective 'malted' (meaning 'having undergone the malting process').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈmɔːltɪd/","syllables":"o-ver-malt-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Over-malted' describes a situation where the malting process, crucial for converting grains into a form suitable for brewing or distilling, has been carried out to an excessive degree. This can result in undesirable flavors or characteristics in the final product.","priority":"★★★"},"related_words":{"derivatives":["malt","malting","malted"],"related_terms":["wort","mash","barley","grain"]},"level_frequency":{"priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'over-malted' is a technical term primarily used in the context of brewing and distilling. It describes a grain that has been malted to an excessive degree, which can negatively impact the flavor and quality of the final product. Understanding this term requires familiarity with the malting process itself."},"example_sentences":[{"sentence":"The brewer suspected the off-flavors were from using over-malted ingredients.","translation":"醸造者は、異臭が麦芽化しすぎた原料の使用によるものだと疑った。","type":"adjective","meaning_category":"過度に麦芽化した"},{"sentence":"Using over-malted grains can lead to a beer that is too sweet and lacks complexity.","translation":"麦芽化しすぎた穀物を使用すると、甘すぎて複雑さに欠けるビールになる可能性がある。","type":"adjective","meaning_category":"過度に麦芽化した"}]}