{"word":"Mercurialize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"水銀で処理する、水銀を塗る","english_definition":"To treat with mercury; to coat with mercury.","examples":[{"sentence":"The process of mercurializing felt hats involves treating the felt with mercuric nitrate.","translation":"フェルト帽を水銀処理する工程では、フェルトを硝酸水銀で処理する。"},{"sentence":"The alchemists attempted to mercurialize base metals in their quest to create gold.","translation":"錬金術師たちは、金を創造する探求の中で、卑金属を水銀処理しようと試みた。"}],"collocations":["mercurialize felt","mercurialize metal"],"synonyms":["amalgamate","coat with mercury","treat with mercury"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"(変化・変動を)激しくする、不安定にする","english_definition":"To render changeable or unstable; to subject to rapid changes.","examples":[{"sentence":"The stock market was mercurialized by the sudden announcement.","translation":"株式市場は突然の発表によって不安定になった。"},{"sentence":"The political climate has been mercurialized by recent events.","translation":"最近の出来事によって政治情勢が不安定になっている。"}],"collocations":["mercurialize a market","mercurialize a situation"],"synonyms":["destabilize","make volatile","make unstable"],"antonyms":["stabilize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(性格・気分などが)変わりやすい、気まぐれになる","english_definition":"To become changeable or volatile in character or mood.","examples":[{"sentence":"His mood began to mercurialize as the pressure increased.","translation":"プレッシャーが増すにつれて、彼の気分は変わりやすくなった。"},{"sentence":"The discussion mercurialized, shifting from topic to topic without clear direction.","translation":"議論は気まぐれになり、明確な方向性もなく話題から話題へと移り変わった。"}],"collocations":["mercurialize in mood","mercurialize in behavior"],"synonyms":["become volatile","become erratic","become capricious"],"antonyms":["become stable"]}],"etymology":{"value":"From 'mercury,' the element, and the suffix '-ize,' indicating a process or action. The term reflects mercury's properties of being liquid at room temperature and its historical association with alchemy and changeability.","priority":"★★☆"},"pronunciation":{"ipa":"/mərˈkjʊəriəˌlaɪz/","syllables":"mer-cu-ri-a-lize"},"inflection":{"verb_forms":{"present_simple":["mercurialize","mercurializes"],"past_simple":"mercurialized","past_participle":"mercurialized","present_participle":"mercurializing"}},"usage_notes":{"explanation":"'Mercurialize' is a relatively uncommon word with two primary meanings. The first relates to the literal treatment or coating with mercury, often in industrial or historical contexts. The second, more figurative meaning, describes making something changeable, unstable, or volatile, akin to the properties associated with the element mercury. It can also describe a person's mood or behavior becoming erratic or unpredictable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist tried to mercurialize his painting with silver.","correct":"✓ The artist tried to embellish his painting with silver.","note":"'Mercurialize' specifically refers to treatment with mercury, not other metals. 'Embellish' or 'adorn' would be more appropriate for silver. "},{"incorrect":"✗ The calm weather mercurialized suddenly into a storm.","correct":"✓ The calm weather turned suddenly into a storm.","note":"While 'mercurialize' can mean to become unstable, it's less common in this context. 'Turned' or 'changed' are more natural choices."}],"priority":"★★☆"},"related_words":{"derivatives":["mercurial (adjective: changeable, volatile, relating to mercury)","mercurialization (noun: the act of mercurializing or the state of being mercurialized)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mercurialize' is a rare and specialized word. Its usage typically appears in technical or historical contexts when referring to treating something with mercury. Figuratively, it describes making something unstable or volatile, similar to mercury's properties. Due to its rarity and specific meanings, it's unlikely to be encountered outside of advanced or specialized texts."},"example_sentences":[{"sentence":"The old process of mercurializing mirrors involved applying a thin layer of mercury to the glass.","translation":"昔の鏡を水銀処理する工程では、ガラスに薄い水銀の層を塗布する必要があった。","type":"verb (vt)","meaning_category":"水銀で処理する"},{"sentence":"The company's sudden change in strategy mercurialized the market, causing uncertainty among investors.","translation":"会社の方針の突然の変更は市場を不安定にし、投資家の間に不確実性を引き起こした。","type":"verb (vt)","meaning_category":"不安定にする"},{"sentence":"Her behavior began to mercurialize, making it difficult to predict her reactions.","translation":"彼女の行動は変わりやすくなり、彼女の反応を予測することが困難になった。","type":"verb (vi)","meaning_category":"変わりやすい"}]}