{"word":"resolicitation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再勧誘、再募集","english_definition":"The act of soliciting again; a repeated attempt to obtain something (such as funds or support) from someone.","examples":[{"sentence":"The company engaged in resolicitation after the initial fundraising campaign fell short of its goal.","translation":"会社は最初の資金調達キャンペーンが目標に届かなかったため、再勧誘を行った。"},{"sentence":"The politician's resolicitation of votes after the scandal was met with mixed reactions.","translation":"スキャンダルの後、政治家が再び票を求めたことは賛否両論の反応を引き起こした。"}],"collocations":["fundraising resolicitation (資金調達の再勧誘)","vote resolicitation (票の再勧誘)","customer resolicitation (顧客への再勧誘)"],"synonyms":["re-soliciting","re-application","repeated solicitation"],"antonyms":["initial solicitation","first request"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'anew') to 'solicitation'. 'Solicitation' itself comes from the Latin 'sollicitare,' meaning 'to disturb, agitate, or entice.' Thus, 'resolicitation' literally means 'to solicit again.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːsəˌlɪsɪˈteɪʃən/","syllables":"re-so-li-ci-ta-tion"},"inflection":{"noun_plural":"resolicitations"},"usage_notes":{"explanation":"'Resolicitation' refers to the act of asking or seeking something again, usually after an initial attempt has been made. It often implies a more persistent or strategic approach to obtaining a desired outcome, such as financial support, votes, or customer engagement. The term can sometimes carry a negative connotation if the repeated requests are perceived as intrusive or unwelcome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resolicitation was successful in getting the funds.","correct":"✓ The resolicitation was successful in obtaining the funds.","note":"While 'getting' is commonly used, 'obtaining' is more formal and appropriate in the context of solicitation."},{"incorrect":"✗ Resolicitation is a good strategy for new customers.","correct":"✓ Resolicitation is a good strategy for previous customers.","note":"Resolicitation typically involves re-engaging with individuals or entities who have been solicited before, not new customers."}],"priority":"★★☆"},"related_words":{"derivatives":["resolicit (verb: to solicit again)","solicitation (noun: the act of soliciting)","solicit (verb: to ask for or try to obtain something from someone)","solicitor (noun: a person who solicits)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resolicitation' is a relatively uncommon and formal term that refers to the act of asking or seeking something again, typically after a previous attempt. It is often used in contexts such as fundraising, political campaigns, or marketing, where repeated efforts are made to obtain support or engagement. Understanding the term requires a good grasp of the prefix 're-' and the base word 'solicitation.'"},"example_sentences":[{"sentence":"The non-profit organization conducted a resolicitation campaign to reach its year-end fundraising goals.","translation":"非営利団体は年末の資金調達目標を達成するために、再勧誘キャンペーンを実施した。","type":"noun","meaning_category":"再勧誘 (fundraising)"},{"sentence":"The sales team planned a resolicitation strategy to re-engage with inactive clients.","translation":"営業チームは休眠顧客との再エンゲージメントを図るため、再勧誘戦略を計画した。","type":"noun","meaning_category":"再勧誘 (sales)"},{"sentence":"After the initial survey, a resolicitation email was sent to those who had not yet responded.","translation":"最初のアンケートの後、まだ回答していない人に再勧誘メールが送信された。","type":"noun","meaning_category":"再勧誘 (survey)"}]}