{"word":"sublegislature","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下位立法府、下部立法機関","english_definition":"A legislative body that is subordinate to a larger or more powerful one.","examples":[{"sentence":"The county council acts as a sublegislature to the state legislature.","translation":"郡議会は州議会の下位立法府として機能する。"},{"sentence":"The city council is a sublegislature with limited powers.","translation":"市議会は権限が限られた下部立法機関である。"}],"collocations":["county sublegislature","city sublegislature","act as a sublegislature"],"synonyms":["local legislature","lower legislative body","subsidiary legislature"],"antonyms":["national legislature","federal legislature","parent legislature"]}],"etymology":{"value":"The word \"sublegislature\" is formed by combining the prefix \"sub-\" (meaning under, below, or subordinate) with the word \"legislature\".","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˈlɛdʒɪˌsleɪtʃər/","syllables":"sub-le-gis-la-ture"},"inflection":{"noun_plural":"sublegislatures"},"usage_notes":{"explanation":"The term \"sublegislature\" is used to describe a legislative body that operates under the authority and jurisdiction of a higher-level legislature. These sublegislatures typically have powers and responsibilities delegated to them by the parent legislature, and their actions are subject to review and oversight.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sublegislature passed a law that contradicted the state constitution.","correct":"✓ The sublegislature passed a law that was later overturned by the state legislature.","note":"Sublegislatures cannot pass laws that contradict the constitution or laws of the higher-level legislature. Such laws would be deemed invalid."}],"priority":"★★☆"},"related_words":{"derivatives":["sublegislation (noun)"],"related_terms":["legislature","legislation","ordinance","bylaw","council","assembly"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"sublegislature\" refers to a legislative body that is lower in authority than another, larger legislative body. Think of it as a smaller version of a parliament or congress, but with less power. It's not a common word, so you'll mostly find it in legal or political contexts when discussing different levels of government."},"example_sentences":[{"sentence":"The town's sublegislature is responsible for local zoning laws.","translation":"その町の地方議会は、地域のゾーニング法を担当している。","type":"general","meaning_category":"下位立法府"},{"sentence":"The sublegislature debated the proposed budget for the upcoming fiscal year.","translation":"下位立法府は、次会計年度の予算案について議論した。","type":"political","meaning_category":"下位立法府"}]}