{"word":"Alloxuric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"尿酸生成抑制性の","english_definition":"Relating to or promoting the reduction of uric acid in the body.","examples":[{"sentence":"An alloxuric drug is used to treat gout.","translation":"アロプリノール性の薬は痛風の治療に使われます。"}],"collocations":["alloxuric drug","alloxuric agent"],"synonyms":["uricostatic","hypouricemic"],"antonyms":["uricosuric"]}],"etymology":{"value":"Derived from 'alloxazine' (a chemical compound) + 'uric' (relating to uric acid).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæləˈʃʊərɪk/","syllables":"al-lo-xu-ric"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more alloxuric, most alloxuric."},"usage_notes":{"explanation":"'Alloxuric' refers to substances or medications that reduce the production of uric acid in the body. It is commonly used in the context of treating conditions like gout, where excessive uric acid levels lead to the formation of crystals in the joints.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was prescribed an alloxuric to increase uric acid excretion.","correct":"✓ The patient was prescribed an alloxuric to decrease uric acid production.","note":"Alloxurics reduce uric acid production, not increase its excretion."}],"priority":"★★☆"},"related_words":{"derivatives":["allopurinol (a common alloxuric drug)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Alloxuric' is a highly specialized term primarily encountered in medical or biochemical contexts. It describes substances that inhibit the production of uric acid, often used in treating gout. Due to its specific and technical nature, it is not part of common vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor prescribed an alloxuric medication to manage the patient's gout.","translation":"医師は患者の痛風を管理するためにアロプリノール性の薬を処方しました。","type":"adjective","meaning_category":"尿酸生成抑制性の"},{"sentence":"Alloxuric agents are effective in lowering serum uric acid levels.","translation":"アロプリノール性の薬剤は血清尿酸値を下げるのに効果的です。","type":"adjective","meaning_category":"尿酸生成抑制性の"}]}