{"word":"cay","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(カリブ海地域の)砂州、小島、岩礁","english_definition":"A small, low island composed of sand or coral; also spelled key.","examples":[{"sentence":"We spent the day relaxing on a beautiful cay in the Bahamas.","translation":"私たちはバハマの美しい砂州でリラックスして一日を過ごしました。"},{"sentence":"The cay was surrounded by crystal-clear turquoise water.","translation":"その小島は透き通ったターコイズブルーの海に囲まれていました."},{"sentence":"Many birds nest on the uninhabited cays.","translation":"多くの鳥が、無人の小島に巣を作ります。"}],"collocations":["coral cay","sand cay","uninhabited cay","tropical cay"],"synonyms":["key","islet","isle","reef"],"antonyms":["mainland","continent"]}],"etymology":{"value":"The word \"cay\" comes from the Spanish word \"cayo,\" which is derived from the Taíno word for small island.","priority":"★★☆"},"pronunciation":{"ipa":"/keɪ/","syllables":"cay"},"inflection":{"noun_plural":"cays"},"usage_notes":{"explanation":"The terms \"cay\" and \"key\" are often used interchangeably, especially in the Caribbean region and Florida. They refer to small, low islands, often formed of sand or coral. These islands are typically uninhabited or sparsely populated and can be popular tourist destinations for snorkeling, diving, and relaxation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We drove to the cay.","correct":"✓ We took a boat to the cay.","note":"Cays are islands, so you usually need a boat to get there."},{"incorrect":"✗ The cay was very large and mountainous.","correct":"✓ The cay was small and flat.","note":"Cays are typically small and low-lying."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"cay\" is a relatively uncommon word that refers to a small, low island made of sand or coral. It's most often used when discussing islands in the Caribbean. The word \"key\" is a synonym and is more commonly used. You'll likely only encounter this word in travel writing or geographical descriptions of specific regions.","priority":"★★☆"},"example_sentences":[{"sentence":"The boat docked at a small, sandy **cay**.","translation":"ボートは小さな砂の小島に停泊した。","type":"noun","meaning_category":"砂州、小島"},{"sentence":"We explored the coral reefs surrounding the **cay**.","translation":"私たちはその小島を囲む珊瑚礁を探検した。","type":"noun","meaning_category":"砂州、小島"},{"sentence":"The **cay** was a popular spot for snorkeling and diving.","translation":"その小島はシュノーケリングやダイビングに人気の場所だった。","type":"noun","meaning_category":"砂州、小島"}]}