{"word":"religify","priority":"Low","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"宗教的にする、宗教色を帯びさせる、宗教的な意味合いを付与する","english_definition":"To make religious; to imbue with religious qualities or significance.","examples":[{"sentence":"Some scholars argue that ancient myths were religified over time.","translation":"一部の学者は、古代の神話は時を経て宗教的な意味合いを帯びていったと主張している。"},{"sentence":"The artist sought to religify the everyday by depicting ordinary scenes with spiritual symbolism.","translation":"その芸術家は、日常の風景を精神的な象徴を用いて描くことで、日常に宗教的な意味合いを付与しようとした。"}],"collocations":["religify a tradition","religify a myth","religify an event","religify a concept"],"synonyms":["spiritualize","sanctify","consecrate","theologize"],"antonyms":["secularize","desecrate","profane"]}],"etymology":{"value":"From 'religion' + '-ify'.","priority":"Medium"},"pronunciation":{"ipa":"/rɪˈlɪdʒɪfaɪ/","syllables":"re-li-gi-fy"},"inflection":{"verb_forms":{"present_simple":["religify","religifies"],"past_simple":"religified","past_participle":"religified","present_participle":"religifying"}},"usage_notes":{"explanation":"The word 'religify' is not commonly used and may be considered a neologism. It generally implies the process of making something more religious or giving it a religious character that it previously lacked. It is often used in academic or theoretical contexts.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"He religified his house by decorating it with flowers.","correct":"He made his house more religious by adding religious symbols and icons."}],"priority":"Low","note":"It is more common to describe specific actions that make something religious rather than using the verb 'religify' directly in simple contexts."},"related_words":{"derivatives":["religification (noun)"],"related_terms":["religion","religious","spiritual"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"High"},"readability_explanation":{"level":"C2","text":"'Religify' is a relatively rare and formal term, primarily used in academic or theoretical discussions. It denotes the act of imbuing something with religious qualities, significance, or characteristics that it previously lacked. Due to its infrequent usage, it is more suitable for advanced learners and those engaged in specialized studies related to religion or cultural studies."},"example_sentences":[{"sentence":"The local community religified the ancient well by attributing miraculous healing properties to its water.","translation":"地元のコミュニティは、その古代の井戸の水に奇跡的な治癒力があると信じることで、宗教的な意味合いを付与した。","type":"verb","meaning_category":"宗教的にする"},{"sentence":"Some historians argue that political ideologies can be religified, taking on aspects of faith and ritual.","translation":"一部の歴史家は、政治的イデオロギーは宗教的な側面を帯び、信仰や儀式のような要素を取り入れることで、宗教化される可能性があると主張している。","type":"verb","meaning_category":"宗教的な意味合いを付与する"}]}