{"word":"Jewishness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ユダヤ人であること、ユダヤ教徒であること、ユダヤ的な性質、ユダヤ文化","english_definition":"The state or quality of being Jewish; Jewish identity; adherence to Jewish culture or religion.","examples":[{"sentence":"He explored his Jewishness through literature and history.","translation":"彼は文学と歴史を通して自身のユダヤ人としてのアイデンティティを探求した。"},{"sentence":"The film explores themes of Jewishness and assimilation.","translation":"その映画はユダヤ人であることと同化というテーマを探求している。"},{"sentence":"Her Jewishness was an important part of her identity.","translation":"彼女がユダヤ人であることは、彼女のアイデンティティの重要な部分だった。"},{"sentence":"The museum celebrates the diversity of Jewishness around the world.","translation":"その博物館は世界中のユダヤ人であることの多様性を称えている。"}],"collocations":["express one's Jewishness","explore one's Jewishness","celebrate Jewishness","a sense of Jewishness","aspects of Jewishness","dimensions of Jewishness","expressions of Jewishness","definitions of Jewishness"],"synonyms":["Jewish identity","Jewish heritage","Jewish culture","Jewish faith","Jewish tradition","Jewish background"],"antonyms":["Gentileness","non-Jewishness"]}],"etymology":{"value":"\"Jewish\" + \"-ness\".  \"Jewish\" comes from Old French \"juif\" (Jew), from Latin \"Iudaeus\" (Jewish), from Greek \"Ioudaios\", from Aramaic \"Yehudai\", from Hebrew \"Yehudi\" (of Judah).  The suffix \"-ness\" denotes a state, quality, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒuːɪʃnəs/","syllables":"Jew-ish-ness"},"inflection":{"noun_plural":"Jewishnesses (rarely used)"},"usage_notes":{"explanation":"\"Jewishness\" refers to the qualities, characteristics, or state of being Jewish. This can encompass religious observance, cultural traditions, ethnic identity, and a sense of belonging to the Jewish people. The term can be used in both a personal and a collective sense. It is important to be sensitive and respectful when discussing Jewishness, as it can be a deeply personal and complex aspect of identity. The term can sometimes be controversial, depending on the context and the speaker's intent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Jewishness is important to him.","correct":"✓ His Jewishness is important to him.","note":"\"Jewishness\" is an abstract noun, so it usually needs a possessive pronoun or article to specify whose Jewishness is being discussed."},{"incorrect":"✗ She has a strong Jewishness.","correct":"✓ She has a strong sense of Jewishness.","note":"It's more common to say \"a strong sense of Jewishness\" rather than \"a strong Jewishness\"."},{"incorrect":"✗ Jewishness is only about religion.","correct":"✓ Jewishness encompasses religion, culture, history, and identity.","note":"Jewishness is multifaceted and includes more than just religious practice."}],"priority":"★★☆"},"related_words":{"derivatives":["Jewish (adjective)","Jew (noun)","Judaism (noun)","anti-Jewishness (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but established.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Jewishness\" is a noun that describes the state of being Jewish. It includes a person's religion, culture, and sense of identity as a Jew. This word is often used when talking about what it means to be Jewish or how someone connects with their Jewish heritage. It's a more abstract term than simply saying someone is \"Jewish,\" because it refers to the qualities and experiences that make up that identity. The term can be sensitive, so it's important to use it respectfully and understand that it can mean different things to different people."},"example_sentences":[{"sentence":"The conference explored the diverse facets of contemporary **Jewishness**.","translation":"その会議では、現代のユダヤ人であることの多様な側面が探求された。","type":"general","meaning_category":"Jewish identity"},{"sentence":"Many young Jews are reconnecting with their **Jewishness** through cultural events.","translation":"多くの若いユダヤ人が、文化的なイベントを通して自身のユダヤ人としてのアイデンティティを再認識している。","type":"general","meaning_category":"Jewish identity"},{"sentence":"Her understanding of **Jewishness** deepened after visiting Israel.","translation":"イスラエルを訪問した後、彼女のユダヤ人であることへの理解が深まった。","type":"general","meaning_category":"Jewish identity"},{"sentence":"The book examines the complexities of **Jewishness** in the diaspora.","translation":"その本は、ディアスポラにおけるユダヤ人であることの複雑さを検証している。","type":"general","meaning_category":"Jewish identity"},{"sentence":"He struggled to reconcile his secular lifestyle with his **Jewishness**.","translation":"彼は世俗的なライフスタイルとユダヤ人であることの調和に苦労した。","type":"general","meaning_category":"Jewish identity"}]}