{"word":"Cowages","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A historical term referring to the wages paid to agricultural laborers, particularly in the context of medieval or early modern England. These wages were often paid in kind (goods or services) rather than in currency.","english_definition":"(plural only) Historical term for wages paid to agricultural laborers, often in kind.","examples":[{"sentence":"The cowages of the farm workers included a portion of the harvest and grazing rights for their animals.","translation":"その農場労働者の賃金は、収穫物の一部と家畜の放牧権を含んでいた。"}],"collocations":["paid in cowages","historical cowages","agricultural cowages"],"synonyms":["wages","payment","compensation","remuneration"],"antonyms":[]}],"etymology":{"value":"Derived from 'cow' (referring to payment in kind, often livestock or agricultural products) + 'wages'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkaʊɪdʒɪz/","syllables":"cow-ag-es"},"inflection":{"noun_plural":"Cowages (always plural)"},"usage_notes":{"explanation":"The term 'cowages' is primarily historical and rarely used in modern English. It is specific to the context of agricultural labor in past centuries, particularly in England.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["wage","wages"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily a historical term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Cowages' is a specialized historical term referring to in-kind wages paid to agricultural laborers. Its usage is limited to historical contexts, making it uncommon in modern English. Understanding requires familiarity with historical economic practices."},"example_sentences":[{"sentence":"In medieval England, farm laborers often received cowages in the form of grain and livestock.","translation":"中世イングランドでは、農場労働者は穀物や家畜の形で賃金を受け取ることが多かった。","type":"noun","meaning_category":"historical wages"}]}