{"word":"Paiche","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピラルクー (Arapaima gigas): 南米アマゾン川流域に生息する世界最大級の淡水魚","english_definition":"Arapaima gigas, also known as pirarucu, is a South American tropical freshwater fish. It is one of the largest freshwater fish in the world.","examples":[{"sentence":"The Paiche is a popular food fish in the Amazon region.","translation":"ピラルクーはアマゾン地域で人気の食用魚です。"},{"sentence":"Paiche can grow to over 3 meters in length.","translation":"ピラルクーは3メートル以上に成長することがあります。"}],"collocations":["Paiche fishing","Paiche farming","Paiche fillet"],"synonyms":["Pirarucu","Arapaima","Arapaima gigas"],"antonyms":[]}],"etymology":{"value":"The name 'paiche' is derived from the indigenous languages of the Amazon region. 'Pirarucu' is another common name, derived from the Tupi language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaɪtʃeɪ/","syllables":"pai-che"},"inflection":{"noun_plural":"Paiches"},"usage_notes":{"explanation":"'Paiche' and 'Pirarucu' are often used interchangeably to refer to the same species, Arapaima gigas. 'Paiche' might be more common in certain regions or contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a paiche fishes in the river.","correct":"✓ I saw paiche in the river. / ✓ I saw paiches in the river.","note":"'Paiche' can be used as a mass noun (uncountable) or a count noun (countable). When referring to multiple individuals, 'paiches' is acceptable."}],"priority":"★★☆"},"related_words":{"derivatives":["Arapaima (genus name)","Gigas (species name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paiche' is a specialized term referring to a specific species of fish found in the Amazon. Understanding this term requires knowledge of South American ecosystems and potentially fisheries or culinary contexts. It is not a common word in general English usage."},"example_sentences":[{"sentence":"The restaurant served grilled Paiche with local vegetables.","translation":"そのレストランでは、地元の野菜を添えたピラルクーのグリルが出された。","type":"noun","meaning_category":"Fish"},{"sentence":"Sustainable Paiche farming is becoming increasingly important in the Amazon.","translation":"持続可能なピラルクー養殖は、アマゾンでますます重要になっています。","type":"noun","meaning_category":"Fish Farming"}]}