{"word":"microbiologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微生物学者","english_definition":"A scientist who studies microorganisms, such as bacteria, viruses, fungi, and protozoa.","examples":[{"sentence":"The microbiologist studied the growth of bacteria in the petri dish.","translation":"その微生物学者はシャーレの中で細菌の成長を研究した。"},{"sentence":"Microbiologists play a crucial role in developing new antibiotics.","translation":"微生物学者は新しい抗生物質の開発において重要な役割を果たす。"},{"sentence":"She is a microbiologist specializing in virology.","translation":"彼女はウイルス学を専門とする微生物学者です。"}],"collocations":["clinical microbiologist (臨床微生物学者)","environmental microbiologist (環境微生物学者)","research microbiologist (研究微生物学者)","study microorganisms (微生物を研究する)","conduct experiments (実験を行う)","analyze samples (サンプルを分析する)"],"synonyms":["bacteriologist","virologist","immunologist","scientist"],"antonyms":[]}],"etymology":{"value":"The word \"microbiologist\" is formed from \"micro-\" (small), \"bio-\" (life), \"-logy\" (study of), and \"-ist\" (one who studies).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊbaɪˈɒlədʒɪst/","syllables":"mi-cro-bi-ol-o-gist"},"inflection":{"noun_plural":"microbiologists"},"usage_notes":{"explanation":"A microbiologist is a scientist who specializes in the study of microorganisms. This includes bacteria, viruses, fungi, protozoa, and other microscopic organisms. They may work in various fields, such as medicine, agriculture, environmental science, and biotechnology. Their work can involve research, development, and diagnostics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a microbiologist that studies plants.","correct":"✓ He is a microbiologist who studies microorganisms.","note":"Microbiologists study microorganisms, not plants (that's a botanist)."},{"incorrect":"✗ Microbiology is a microbiologist.","correct":"✓ Microbiology is the study of microorganisms.","note":"Microbiology is the field of study; a microbiologist is the person who studies it."}],"priority":"★★☆"},"related_words":{"derivatives":["microbiology (名詞: 微生物学)","microbial (形容詞: 微生物の)","microbe (名詞: 微生物)"],"phrasal_verbs":[],"related_fields":["virology (ウイルス学)","bacteriology (細菌学)","immunology (免疫学)","mycology (菌類学)","parasitology (寄生虫学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"microbiologist\" refers to a scientist specializing in the study of microorganisms. These organisms are too small to be seen with the naked eye and include bacteria, viruses, fungi, and protozoa. Microbiologists investigate the characteristics, functions, and roles of these microbes in various environments, including their impact on human health, agriculture, and the environment. This word is typically encountered in scientific or medical contexts."},"example_sentences":[{"sentence":"The **microbiologist** used a microscope to examine the bacteria.","translation":"その微生物学者は顕微鏡を使って細菌を調べた。","type":"noun","meaning_category":"general"},{"sentence":"As a **microbiologist**, she researches new ways to combat antibiotic-resistant bacteria.","translation":"微生物学者として、彼女は抗生物質耐性菌と戦うための新しい方法を研究している。","type":"noun","meaning_category":"research"},{"sentence":"The **microbiologist** identified the source of the food poisoning outbreak.","translation":"その微生物学者は食中毒発生源を特定した。","type":"noun","meaning_category":"medical"}]}