{"word":"ethnographically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"民族誌的に、民族誌学的に","english_definition":"In a manner relating to ethnography; using ethnographic methods or perspectives.","examples":[{"sentence":"The study was conducted ethnographically, with researchers immersing themselves in the community.","translation":"その研究は民族誌学的に行われ、研究者たちはコミュニティに没頭した。"},{"sentence":"She approached the topic ethnographically, focusing on the lived experiences of the participants.","translation":"彼女はそのトピックに民族誌学的に取り組み、参加者の生きた経験に焦点を当てた。"},{"sentence":"The data were analyzed ethnographically to understand the cultural context.","translation":"データは文化的な背景を理解するために民族誌学的に分析された。"}],"collocations":["study ethnographically","analyze ethnographically","approach ethnographically","research ethnographically","describe ethnographically"],"synonyms":["anthropologically","culturally","descriptively"],"antonyms":["theoretically","abstractly","speculatively"]}],"etymology":{"value":"ethnographic + -ally","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛθnəˈɡræfɪkli/","syllables":"eth-no-graph-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"'Ethnographically' describes how something is done, studied, or analyzed using the methods and principles of ethnography. This often involves direct observation, participation in the culture being studied, and detailed descriptive writing. It emphasizes understanding a culture from the perspective of its members.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The researcher ethnographically studied the theory.","correct":"✓ The researcher studied the culture ethnographically.","note":"Ethnography is about studying cultures, not theories. The adverb 'ethnographically' should be used with verbs that describe studying or representing cultures."}],"priority":"★★★"},"related_words":{"derivatives":["ethnography","ethnographic","ethnographer"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'ethnographically' is a technical term used in social sciences, particularly anthropology and sociology. It means 'in a way that relates to ethnography,' which is the study of cultures and peoples. To understand its meaning, you need to know what ethnography is. It is often used to describe research methods that involve immersing oneself in a culture to understand it from the inside."},"example_sentences":[{"sentence":"The village was studied ethnographically over a period of two years.","translation":"その村は2年間にわたって民族誌学的に研究された。","type":"general","meaning_category":"general"},{"sentence":"The researcher aimed to describe the rituals ethnographically.","translation":"研究者は儀式を民族誌学的に記述することを目指した。","type":"general","meaning_category":"general"},{"sentence":"The data was analyzed ethnographically to understand the social dynamics.","translation":"データは社会力学を理解するために民族誌学的に分析された。","type":"research","meaning_category":"research"}]}