{"word":"repulsively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"反発的に、嫌悪感を抱かせるように、ぞっとするほど","english_definition":"in a manner that causes intense disgust or aversion; in a way that is extremely unpleasant or offensive.","examples":[{"sentence":"The room smelled repulsively of stale cigarettes and cheap beer.","translation":"部屋はタバコの吸い殻と安物のビールのぞっとするような臭いがした。"},{"sentence":"He behaved repulsively towards the waiter, making rude and offensive comments.","translation":"彼はウェイターに対して反発的な態度を取り、無礼で不快なコメントをした。"},{"sentence":"The movie depicted violence so repulsively that many viewers walked out.","translation":"その映画は暴力を非常に嫌悪感を抱かせるように描写していたため、多くの観客が席を立った。"}],"collocations":["smell repulsively","behave repulsively","depict repulsively","repulsively ugly","repulsively offensive"],"synonyms":["disgustingly","horribly","offensively","revoltly","abominably","hideously","nauseatingly","odiously"],"antonyms":["attractively","pleasantly","agreeably","delightfully"]}],"etymology":{"value":"Derived from the adjective 'repulsive' with the addition of the suffix '-ly'. 'Repulsive' comes from the Latin 'repulsus', the past participle of 'repellere' meaning 'to drive back, reject'.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈpʌlsɪvli/","syllables":"re-pul-sive-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Repulsively' describes actions, qualities, or states that evoke strong feelings of disgust or aversion. It emphasizes the intensity of the unpleasantness. It is often used to describe smells, appearances, behaviors, or depictions of something that are extremely offensive or unpleasant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He looked repulsive.","correct":"✓ He looked repulsively ugly. / ✓ He looked repulsive.","note":"'Repulsive' is an adjective, so it describes a noun. 'Repulsively' is an adverb, so it describes a verb, adjective, or another adverb. If you want to describe how someone looks in a repulsive way, you can use 'repulsively ugly'. However, 'He looked repulsive' is grammatically correct. "},{"incorrect":"✗ The food tasted repulsive.","correct":"✓ The food tasted repulsively bad. / ✓ The food was repulsive.","note":"Similar to the previous example, to use 'repulsively', you need to modify an adjective or verb. 'The food tasted repulsively bad' is correct. However, 'The food was repulsive' is also grammatically correct and more common."}],"priority":"★★☆"},"related_words":{"derivatives":["repulsive (adjective: causing intense disgust; extremely unpleasant)","repulsiveness (noun: the quality of causing intense disgust)","repulse (verb: to drive back; to reject; to cause feelings of disgust)","repulsion (noun: a feeling of intense disgust or aversion)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'repulsively' is used to describe something that causes a strong feeling of disgust or aversion. It's an adverb, so it modifies verbs, adjectives, or other adverbs. It's not a very common word, and it's usually used in formal or descriptive writing to emphasize the intensity of something unpleasant. You might encounter it in literature or news articles describing something particularly offensive or disgusting."},"example_sentences":[{"sentence":"The garbage bin smelled **repulsively**, attracting flies and other insects.","translation":"ゴミ箱はぞっとするほど臭く、ハエや他の昆虫を引き寄せていた。","type":"adverb","meaning_category":"causing disgust"},{"sentence":"He spoke **repulsively** of his former friends, revealing a cruel and vindictive side.","translation":"彼は以前の友人について反発的に話し、残酷で執念深い一面を明らかにした。","type":"adverb","meaning_category":"offensive behavior"},{"sentence":"The painting depicted the scene so **repulsively** that I had to look away.","translation":"その絵はその場面を非常に嫌悪感を抱かせるように描写していたため、目をそらさなければならなかった。","type":"adverb","meaning_category":"depiction"}]}