{"word":"Epiph","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(造語)特定の文脈やコミュニティ内でのみ使用される名前、単語、または識別子。","english_definition":"(Neologism) A name, word, or identifier used only within a specific context or community.","examples":[{"sentence":"Within their online game, 'Epiph' was the name of a powerful artifact.","translation":"彼らのオンラインゲームでは、「Epiph」は強力なアーティファクトの名前でした。"},{"sentence":"The group members referred to their meeting place as 'Epiph', a term outsiders wouldn't understand.","translation":"グループのメンバーは、部外者には理解できない用語である「Epiph」を会議場所と呼んでいました。"}],"collocations":["use Epiph as a name","create an Epiph","the meaning of Epiph","unique Epiph"],"synonyms":["code name","identifier","term of art","jargon","slang"],"antonyms":["common name","standard term"]}],"etymology":{"value":"This appears to be a neologism, possibly derived from 'epiphany' (a sudden realization) or a shortened form of a longer word. Without further context, its precise origin is speculative.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɛpɪf/","syllables":"Ep-iph"},"inflection":{"notes":"Typically functions as a noun. Plural form would be 'Epiphs'."},"usage_notes":{"explanation":"'Epiph' is likely a made-up word used within a specific group or context. Its meaning is defined by that group, and it would not be found in standard dictionaries. Understanding its meaning requires knowledge of the context in which it's used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Everyone knows what 'Epiph' means.","correct":"✓ Only those in the group know what 'Epiph' means.","note":"Since it's a neologism, its meaning is not universally known."},{"incorrect":"✗ 'Epiph' is a formal term.","correct":"✓ 'Epiph' is an informal term used within a specific group.","note":"Neologisms are rarely formal."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["neologism","nonce word","slang","jargon","argot"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency - likely a neologism.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epiph' is a hypothetical neologism, meaning it's a newly coined word or expression. Its meaning is context-dependent and understood only within a specific group or community. Therefore, it's not found in standard dictionaries and requires specialized knowledge to comprehend. The term is used to illustrate how language can be created and used within closed groups. Understanding the concept of neologisms is crucial to grasp the meaning of 'Epiph'."},"example_sentences":[{"sentence":"The team used 'Epiph' to refer to their secret project, ensuring confidentiality.","translation":"チームは秘密プロジェクトを指すために「Epiph」を使用し、機密性を確保しました。","type":"noun","meaning_category":"Code name"},{"sentence":"If you're not part of the inner circle, you won't understand the significance of 'Epiph'.","translation":"もしあなたがインナーサークルの一員でなければ、「Epiph」の重要性は理解できないでしょう。","type":"noun","meaning_category":"Identifier"}]}