{"word":"dissolutely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"放蕩に、道楽に、堕落して","english_definition":"In a dissolute manner; licentiously; profligately.","examples":[{"sentence":"He lived dissolutely, squandering his inheritance on wine, women, and song.","translation":"彼は放蕩な生活を送り、遺産を酒と女と歌に浪費した。"},{"sentence":"The young nobleman behaved dissolutely, much to the dismay of his family.","translation":"その若い貴族は放蕩に振る舞い、家族を大いに失望させた。"}],"collocations":["live dissolutely","behave dissolutely","spend dissolutely"],"synonyms":["licentiously","profligately","debauchedly","wantonly","immorally"],"antonyms":["morally","virtuously","ascetically","temperately"]}],"etymology":{"value":"Derived from the adjective 'dissolute' with the addition of the adverbial suffix '-ly'. 'Dissolute' comes from Latin 'dissolutus', the past participle of 'dissolvere', meaning 'to loosen, dissolve, break up'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪsəluːtli/","syllables":"dis-so-lute-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Dissolutely' describes actions or behaviors that are characterized by a lack of restraint, especially in indulging in sensual pleasures. It implies a disregard for moral principles and a tendency towards excess. The term is often used to describe a lifestyle marked by extravagance, indulgence, and immorality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived dissolutely life.","correct":"✓ He lived a dissolute life.","note":"'Dissolute' is an adjective, so it modifies a noun. 'Dissolutely' is an adverb, so it modifies a verb. In this case, 'life' is a noun, so it needs the adjective 'dissolute'."},{"incorrect":"✗ She acted dissolutely towards her responsibilities.","correct":"✓ She acted irresponsibly towards her responsibilities.","note":"While 'dissolutely' implies a lack of restraint, it often refers to indulgence in pleasures. If you mean a general lack of responsibility, 'irresponsibly' is a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["dissolute (adjective): lacking restraint; immoral","dissoluteness (noun): the state of being dissolute","dissolution (noun): the act of dissolving; disintegration; termination"],"phrases":["lead a dissolute life"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dissolutely' is an advanced term used to describe actions done in a way that shows a lack of moral restraint, often involving excessive indulgence in pleasures. It suggests a lifestyle of extravagance and disregard for ethical behavior. It's not commonly used in everyday conversation, but you might encounter it in literature or historical contexts when describing someone's immoral or unrestrained behavior. It is important to understand the nuance of the word to use it correctly, as it carries a strong negative connotation."},"example_sentences":[{"sentence":"The prince spent his days dissolutely, gambling and drinking until dawn.","translation":"王子は日々を放蕩に過ごし、夜明けまでギャンブルと飲酒に明け暮れた。","type":"adverb","meaning_category":"放蕩に"},{"sentence":"The artist lived dissolutely in Paris, embracing a bohemian lifestyle.","translation":"その芸術家はパリで放蕩な生活を送り、ボヘミアンなライフスタイルを受け入れた。","type":"adverb","meaning_category":"道楽に"},{"sentence":"He squandered his fortune dissolutely, leaving him penniless and alone.","translation":"彼は財産を道楽に使い果たし、無一文で孤独になった。","type":"adverb","meaning_category":"堕落して"}]}