{"word":"pastophorion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代教会建築)聖具室、聖器保管室、または関連する付属室。教会堂の側壁に設けられた部屋で、聖職者の控え室や聖書、聖具などを保管する場所として使用された。","english_definition":"A chamber or room on either side of the apse in early Christian churches, used for storing vestments, sacred books, and other church necessities.","examples":[{"sentence":"The pastophorion held the sacred vessels used during the liturgy.","translation":"パストフォリオンには、典礼で使用される神聖な器が保管されていた。"},{"sentence":"The priest prepared for the service in the pastophorion.","translation":"司祭はパストフォリオンで礼拝の準備をした。"}],"collocations":["store sacred vessels in the pastophorion (パストフォリオンに神聖な器を保管する)","prepare for service in the pastophorion (パストフォリオンで礼拝の準備をする)"],"synonyms":["sacristy","vestry","diaconicon","prothesis"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の παστοφόριον (pastophorion) に由来し、これは πάστος (pastos, 寝室、聖所) + φορεῖν (phorein, 運ぶ、持つ) から構成される。つまり、「聖所を運ぶ場所」または「聖所を持つ場所」という意味合いを持つ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæstoʊˈfɔːriən/","syllables":"pas-to-pho-ri-on"},"inflection":{"noun_plural":"pastophoria"},"usage_notes":{"explanation":"「**pastophorion**」は、主に教会史や建築史の文脈で使用される専門用語です。現代の日常会話で使われることはほとんどありません。初期キリスト教の教会建築において、アプスの両側に設けられた部屋を指し、聖具や聖書などを保管する場所として機能しました。類似の機能を持つ部屋として、sacristy（聖具室）やvestry（聖衣室）がありますが、pastophorionは特に初期の教会建築に特有の用語です。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pastophorion was used as a dining hall.","correct":"✓ The pastophorion was used for storing sacred objects.","note":"パストフォリオンは聖具や聖書などを保管する場所であり、食堂として使われることはありません。"},{"incorrect":"✗ Pastophorion is a type of religious song.","correct":"✓ Pastophorion is a part of church architecture.","note":"パストフォリオンは教会建築の一部であり、宗教的な歌の種類ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["apse (アプス、後陣)","sacristy (聖具室)","vestry (聖衣室)","diaconicon (輔祭室)","prothesis (準備室)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 教会史や建築史の専門的な文脈でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**pastophorion**」は、初期キリスト教の教会建築における専門用語であり、一般的な語彙ではありません。この単語は、教会の後陣（アプス）の両側に位置する部屋を指し、聖職者が礼拝の準備をしたり、聖具や聖書などの教会に必要な物品を保管するために使用されました。教会史や建築史の研究において現れることがありますが、日常会話や一般的な文章で使用されることはほとんどありません。したがって、この単語を理解するためには、初期キリスト教建築に関する知識が必要です。"},"example_sentences":[{"sentence":"Archaeologists discovered a well-preserved pastophorion during the excavation of the ancient church.","translation":"考古学者は、古代教会の発掘中に保存状態の良いパストフォリオンを発見した。","type":"general","meaning_category":"定義"},{"sentence":"The bishop used the pastophorion as a private chapel before the main service.","translation":"司教は、本礼拝の前にパストフォリオンを私的な礼拝堂として使用した。","type":"general","meaning_category":"定義"}]}