{"word":"scantlinged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(建築) 小角材で造られた、小角材をあてがわれた","english_definition":"Constructed or fitted with scantlings (small pieces of lumber).","examples":[{"sentence":"The scantlinged roof provided a sturdy structure.","translation":"小角材で組まれた屋根は頑丈な構造を提供した。"},{"sentence":"A scantlinged partition divided the room.","translation":"小角材の仕切りが部屋を分割した。"}],"collocations":["scantlinged roof","scantlinged partition","scantlinged frame"],"synonyms":["timbered","framed","constructed with lumber"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'scantling', meaning a piece of lumber of small dimensions. The suffix '-ed' indicates that something is fitted or constructed with scantlings.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskæntlɪŋd/","syllables":"scant-linged"},"inflection":{"notes":"This is the past participle form used as an adjective."},"usage_notes":{"explanation":"'Scantlinged' is a relatively rare adjective used in architectural or construction contexts to describe something built or reinforced with scantlings. Scantlings are small pieces of lumber, so the term suggests a structure made with or supported by these smaller timbers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was scantlinged with bricks.","correct":"✓ The house was reinforced with scantlings.","note":"'Scantlinged' implies construction primarily using scantlings, not just reinforcement. If bricks are involved, use 'reinforced' or 'supported' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["scantling (noun): a piece of lumber of small dimensions"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scantlinged' is a specialized term primarily used in construction and architecture. It describes structures or components that are built or reinforced using scantlings, which are small pieces of lumber. Due to its specific context, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The old barn had a scantlinged frame, showing its age and craftsmanship.","translation":"その古い納屋は小角材で組まれた骨組みを持ち、その古さと職人技を示していた。","type":"adjective","meaning_category":"Construction"},{"sentence":"The interior walls were scantlinged, providing a solid base for the plaster.","translation":"内壁は小角材で造られており、漆喰のためのしっかりとした土台を提供していた。","type":"adjective","meaning_category":"Architecture"}]}