{"word":"FSLIC","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"連邦貯蓄貸付保険公社（Federal Savings and Loan Insurance Corporation）","english_definition":"Federal Savings and Loan Insurance Corporation: a former US government agency that insured deposits in savings and loan associations.","examples":[{"sentence":"The FSLIC was created in 1934 to insure deposits in savings and loan associations.","translation":"FSLICは、貯蓄貸付組合の預金を保険するために1934年に設立されました。"},{"sentence":"The FSLIC was abolished in 1989 due to the savings and loan crisis.","translation":"FSLICは、貯蓄貸付危機のため1989年に廃止されました。"}],"collocations":["FSLIC insured","FSLIC bailout"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym of Federal Savings and Loan Insurance Corporation.","priority":"高"},"pronunciation":{"ipa":"/ˈɛf.ˌɛs.əl.aɪˈsiː/","syllables":"EF-ES-EL-EYE-SEE"},"inflection":{},"usage_notes":{"explanation":"The FSLIC was a U.S. government agency that insured deposits in savings and loan associations (S&Ls) from 1934 to 1989. It was created in response to the banking crisis of the Great Depression. The FSLIC was abolished in 1989 as part of the Financial Institutions Reform, Recovery, and Enforcement Act (FIRREA) due to its insolvency resulting from the savings and loan crisis of the 1980s. Its functions were largely taken over by the Federal Deposit Insurance Corporation (FDIC).","priority":"中"},"common_mistakes":{},"related_words":{"derivatives":["FDIC (Federal Deposit Insurance Corporation)"],"related_terms":["Savings and Loan Association (S&L)","Savings and Loan Crisis","FIRREA (Financial Institutions Reform, Recovery, and Enforcement Act)"],"priority":"中"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"FSLIC is a historical term referring to a former US government agency. Understanding its role requires knowledge of the Savings and Loan Crisis of the 1980s and the subsequent reforms in the US financial system. It is not a commonly used term in everyday conversation, but may appear in historical or financial contexts."},"example_sentences":[{"sentence":"The failure of many savings and loan associations led to the collapse of the FSLIC.","translation":"多くの貯蓄貸付組合の破綻が、FSLICの崩壊につながりました。","type":"historical context","meaning_category":"歴史的背景"},{"sentence":"The FSLIC was replaced by the FDIC after the savings and loan crisis.","translation":"FSLICは、貯蓄貸付危機後にFDICに置き換えられました。","type":"historical context","meaning_category":"歴史的背景"}]}