{"word":"stalkingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"忍び寄るように、つきまとうように、ストーカーのように","english_definition":"In a manner that involves stealthy following or persistent unwanted attention.","examples":[{"sentence":"He followed her stalkingly through the dark streets.","translation":"彼は暗い通りを彼女につきまとうように後をつけた。"},{"sentence":"The paparazzi behaved stalkingly, invading the celebrity's privacy.","translation":"パパラッチはストーカーのように振る舞い、有名人のプライバシーを侵害した。"}],"collocations":["follow stalkingly","behave stalkingly"],"synonyms":["stealthily","furtively","secretly","creepily","obsessively"],"antonyms":["openly","candidly","directly"]}],"etymology":{"value":"The word 'stalkingly' is derived from the verb 'stalk,' which means to pursue or approach stealthily. The suffix '-ing' transforms it into a present participle or gerund form, and '-ly' turns it into an adverb indicating the manner in which the action is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɔːkɪŋli/","syllables":"stalk-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Stalkingly' describes an action done in the manner of stalking. It implies a secretive, often unwanted, and sometimes threatening pursuit. It is most often used to describe physical following, but can also be used to describe persistent and unwanted attention in other forms, such as through excessive messaging or monitoring someone's online activity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cat watched the bird stalkingly.","correct":"✓ The cat watched the bird intently.","note":"'Stalkingly' implies a deliberate act of following or harassing, which is not typically applicable to a cat's natural hunting behavior. 'Intently' or 'watchfully' would be more appropriate. "},{"incorrect":"✗ She walked stalkingly to the store.","correct":"✓ She walked cautiously to the store.","note":"Unless there is an element of secrecy or unwanted pursuit, 'stalkingly' is not the correct word to describe simply walking somewhere. 'Cautiously' or 'quietly' might be better choices, depending on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["stalk (verb, noun)","stalker (noun)","stalking (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stalkingly' is an adverb that describes an action performed in a stealthy, often unwanted, and sometimes threatening manner. It suggests a secretive pursuit or persistent attention that is unwelcome. Due to its specific and often negative connotation, it is not a commonly used word and is more likely to appear in contexts involving crime, harassment, or intense observation. Understanding the implications of unwanted pursuit and intrusion is key to comprehending its usage."},"example_sentences":[{"sentence":"The detective observed the suspect moving stalkingly through the crowd.","translation":"刑事は容疑者が群衆の中を忍び寄るように移動するのを目撃した。","type":"adverb","meaning_category":"忍び寄るように"},{"sentence":"He was accused of behaving stalkingly towards his ex-girlfriend.","translation":"彼は元恋人に対してストーカー行為をしたとして告発された。","type":"adverb","meaning_category":"つきまとうように"}]}