{"word":"devitrification","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱ガラス化、非晶質からの結晶化","english_definition":"The process of a substance losing its glassy, amorphous structure and becoming crystalline.","examples":[{"sentence":"Devitrification can occur in volcanic glass over time.","translation":"脱ガラス化は、時間の経過とともに火山ガラスで起こることがあります。"},{"sentence":"The devitrification of the glaze affected the appearance of the ceramic.","translation":"釉薬の脱ガラス化は、セラミックの外観に影響を与えました。"}],"collocations":["volcanic glass devitrification","glaze devitrification","surface devitrification"],"synonyms":["crystallization","recrystallization"],"antonyms":["vitrification"]}],"etymology":{"value":"Derived from 'de-' (removal, reversal) + 'vitr-' (from Latin 'vitrum' meaning 'glass') + '-ification' (the process of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌvɪtrɪfɪˈkeɪʃən/","syllables":"de-vit-ri-fi-ca-tion"},"inflection":{"noun_plural":"devitrifications"},"usage_notes":{"explanation":"Devitrification refers to the transformation of a non-crystalline (glassy or amorphous) substance into a crystalline state. This process typically involves the formation of crystal nuclei and their subsequent growth within the amorphous material. It is commonly observed in materials science, geology (especially in volcanic glasses), and in the production of certain ceramics and glasses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The devitrification made the glass more transparent.","correct":"✓ The devitrification made the glass less transparent/more opaque.","note":"Devitrification results in the formation of crystals, which typically makes the material less transparent."}],"priority":"★★☆"},"related_words":{"derivatives":["devitrify (verb)","vitreous (adjective)","vitrification (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Devitrification' is a technical term primarily used in geology and materials science. It describes the process where a glassy (amorphous) material transforms into a crystalline material. Understanding this term requires some background knowledge in these fields, as it's not commonly used in everyday language."},"example_sentences":[{"sentence":"The geologist studied the devitrification patterns in the obsidian sample.","translation":"地質学者は黒曜石のサンプルにおける脱ガラス化のパターンを研究しました。","type":"general","meaning_category":"脱ガラス化"},{"sentence":"High temperatures can accelerate the devitrification process in certain types of glass.","translation":"高温は特定の種類のガラスにおける脱ガラス化プロセスを加速させることがあります。","type":"technical","meaning_category":"脱ガラス化"}]}