{"word":"niacin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ナイアシン (ビタミンB3)","english_definition":"A water-soluble vitamin of the B complex, also known as vitamin B3, nicotinic acid, or nicotinamide, essential for energy metabolism and healthy nerve function.","examples":[{"sentence":"Niacin is important for converting food into energy.","translation":"ナイアシンは食物をエネルギーに変換するために重要です。"},{"sentence":"Some people take niacin supplements to lower their cholesterol.","translation":"コレステロールを下げるためにナイアシンサプリメントを摂取する人もいます。"},{"sentence":"A deficiency in niacin can lead to pellagra.","translation":"ナイアシン欠乏症はペラグラを引き起こす可能性があります。"}],"collocations":["niacin supplement","niacin deficiency","niacinamide","nicotinic acid","dietary niacin","niacin flush"],"synonyms":["vitamin B3","nicotinic acid","nicotinamide"],"antonyms":[]}],"etymology":{"value":"Derived from \"nicotinic acid + vitamin\". \"Nicotinic\" comes from \"nicotine\" because nicotinic acid was first obtained by oxidizing nicotine.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnaɪəsɪn/","syllables":"ni-a-cin"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Niacin is a generic term that refers to both nicotinic acid and nicotinamide. It is essential for human health and is found in many foods, including meat, poultry, fish, nuts, and grains. Niacin is often added to processed foods as a nutritional supplement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take too much niacin and I got a flush.","correct":"✓ I took too much niacin and I got a flush.","note":"Use the past tense 'took' because the action of taking the niacin happened in the past."},{"incorrect":"✗ Niacin is a vitamin C.","correct":"✓ Niacin is a vitamin B3.","note":"Niacin is a form of vitamin B3, not vitamin C."}],"priority":"★★★"},"related_words":{"derivatives":["niacinamide (noun): A form of niacin also known as nicotinamide.","nicotinic acid (noun): A form of niacin."],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Niacin' is a scientific term referring to Vitamin B3. It's important for converting food into energy and maintaining healthy nerve function. It is found in many foods and is sometimes taken as a supplement. A lack of niacin can cause a disease called pellagra. The term is generally used in discussions about nutrition, health, and dietary supplements."},"example_sentences":[{"sentence":"Foods rich in niacin include poultry, fish, and peanuts.","translation":"ナイアシンが豊富な食品には、鶏肉、魚、ピーナッツなどがあります。","type":"noun","meaning_category":"vitamin"},{"sentence":"The doctor recommended a niacin supplement to improve my cholesterol levels.","translation":"医師は私のコレステロール値を改善するためにナイアシンサプリメントを勧めました。","type":"noun","meaning_category":"vitamin"},{"sentence":"Niacin deficiency can cause skin problems and digestive issues.","translation":"ナイアシン欠乏症は、皮膚の問題や消化器系の問題を引き起こす可能性があります。","type":"noun","meaning_category":"vitamin"}]}