{"word":"ethnobotanic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"民族植物学の、民族植物学的な","english_definition":"Relating to ethnobotany; the study of the relationships between people and plants, especially the traditional knowledge and customs of a people concerning plants and their medical, religious, and other uses.","examples":[{"sentence":"The ethnobotanic garden showcases plants used by indigenous cultures.","translation":"その民族植物学庭園は、先住民族の文化によって利用される植物を紹介している。"},{"sentence":"Ethnobotanic research can help discover new medicinal compounds.","translation":"民族植物学的研究は、新しい薬用化合物の発見に役立つ可能性がある。"}],"collocations":["ethnobotanic garden","ethnobotanic research","ethnobotanic knowledge","ethnobotanic study","ethnobotanic survey"],"synonyms":["ethnobotanical"],"antonyms":[]}],"etymology":{"value":"The word \"ethnobotanic\" is derived from \"ethnobotany,\" which combines \"ethno-\" (referring to people or cultures) and \"botany\" (the scientific study of plants).","priority":"★★★"},"pronunciation":{"ipa":"ˌeθnoʊbəˈtænɪk","syllables":"eth-no-bo-tan-ic"},"inflection":{"notes":"Since it is an adjective, it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Ethnobotanic\" is primarily used as an adjective to describe things related to the field of ethnobotany. It emphasizes the connection between human cultures and plant life, particularly focusing on traditional knowledge and uses of plants.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an ethnobotanic.","correct":"✓ He is an ethnobotanist.","note":"\"Ethnobotanic\" is an adjective. The correct noun for a person who studies ethnobotany is \"ethnobotanist.\""}],"priority":"★★☆"},"related_words":{"derivatives":["ethnobotany (noun): The study of the relationships between people and plants.","ethnobotanist (noun): A person who studies ethnobotany."],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Specialized term used in academic and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ethnobotanic\" is a specialized term used in the context of botany and anthropology. It refers to anything related to the study of how different cultures use plants for medicinal, religious, or other purposes. Understanding this word requires some familiarity with scientific and anthropological concepts. It is more commonly encountered in academic or research settings.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum features an ethnobotanic exhibit on local plant uses.","translation":"その博物館は、地元の植物利用に関する民族植物学的展示を特集している。","type":"general","meaning_category":"General usage"},{"sentence":"Researchers conducted an ethnobotanic survey of the Amazon rainforest.","translation":"研究者たちは、アマゾンの熱帯雨林の民族植物学的調査を実施した。","type":"research","meaning_category":"Research context"}]}