{"word":"nonratable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"評価できない、格付けできない","english_definition":"Not able to be rated or assessed.","examples":[{"sentence":"The company's financial situation was so complex that it was deemed nonratable by credit agencies.","translation":"その会社の財政状況は非常に複雑だったため、信用格付け機関によって評価不能と判断されました。"},{"sentence":"Due to insufficient data, the new investment product was considered nonratable.","translation":"データ不足のため、その新しい投資商品は評価不能とみなされました。"}],"collocations":["nonratable asset","nonratable risk","deemed nonratable","considered nonratable"],"synonyms":["unassessable","unevaluable","unrankable","unclassifiable"],"antonyms":["ratable","assessable","evaluable","rankable"]}],"etymology":{"value":"'non-' (not) + 'ratable' (able to be rated).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈreɪtəbəl/","syllables":"non-rat-a-ble"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Nonratable' is typically used in financial or evaluative contexts to describe something that cannot be assigned a rating or grade due to a lack of information, complexity, or other factors. It indicates an inability to provide a standardized assessment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was nonratable because it was too beautiful.","correct":"✓ The painting was considered priceless and therefore difficult to value accurately.","note":"'Nonratable' usually refers to an inability to assign a rating due to lack of data or complexity, not subjective qualities like beauty."},{"incorrect":"✗ He was nonratable for the job.","correct":"✓ He was unqualified for the job.","note":"'Nonratable' is not typically used to describe a person's qualifications. Use 'unqualified' or 'ineligible' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["rate","rating","ratable"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonratable' is a specialized term primarily used in finance and assessment contexts. It signifies that something cannot be assigned a standard rating or evaluation due to various reasons, such as insufficient data or complexity. This term is less common in everyday language and more prevalent in professional or technical discussions. "},"example_sentences":[{"sentence":"The derivative was so complex that it was deemed **nonratable** by the rating agencies.","translation":"そのデリバティブは非常に複雑であったため、格付け機関によって評価不能と判断されました。","type":"adjective","meaning_category":"評価できない"},{"sentence":"Due to the lack of historical data, the new type of bond was considered **nonratable**.","translation":"過去のデータが不足しているため、その新しい種類の債券は評価不能とみなされました。","type":"adjective","meaning_category":"評価できない"}]}