{"word":"flexures","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 曲がり、屈曲、湾曲部","english_definition":"plural form of flexure: a bend or curve; the act of bending.","examples":[{"sentence":"The flexures in the pipe allowed it to fit around the corner.","translation":"パイプの曲がりによって、角に沿って取り付けることができた。"},{"sentence":"The engineer analyzed the stress on the flexures of the bridge.","translation":"技師は橋の湾曲部にかかる応力を分析した。"}],"collocations":["pipe flexures","bridge flexures","spinal flexures"],"synonyms":["bends","curves","crooks","inflections"],"antonyms":["straightness","rigidity"]},{"part_of_speech":"noun","definition":"(地質学) 単斜構造、撓曲","english_definition":"(geology) a bend in rock strata that is less abrupt than a fault.","examples":[{"sentence":"The flexures in the rock layers indicated past tectonic activity.","translation":"岩層の撓曲は過去の地殻変動を示していた。"}],"collocations":["geological flexures","rock flexures","strata flexures"],"synonyms":["monocline","bend","fold"]}],"etymology":{"value":"From the Latin 'flexura', meaning 'a bending, curve, winding', from 'flectere' meaning 'to bend'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɛkʃərz/","syllables":"flex-ures"},"inflection":{"noun_plural":"flexures"},"usage_notes":{"explanation":"'Flexures' is the plural form of 'flexure'. It refers to multiple bends, curves, or the act of bending. In geology, it specifically refers to monoclines or bends in rock strata. The word is relatively uncommon in everyday language but is used in technical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flexures was important for the design.","correct":"✓ The flexures were important for the design.","note":"'Flexures' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ He studied the flexure of the spine. (when referring to multiple bends)","correct":"✓ He studied the flexures of the spine.","note":"When referring to multiple bends or curves, the plural form 'flexures' should be used."}],"priority":"★★☆"},"related_words":{"derivatives":["flexure (singular noun: a bend or curve)","flexural (adjective: relating to bending)","flex (verb: to bend or tighten a muscle)","flexible (adjective: capable of bending easily)","inflection (noun: a bend or curve; a change in the form of a word)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flexures' is a technical term referring to multiple bends or curves, or geological formations called monoclines. It is not commonly used in everyday conversation and is more likely to appear in technical or scientific writing related to engineering, geology, or anatomy. Understanding the context is crucial to correctly interpret the meaning of 'flexures'.","priority":"★★☆"},"example_sentences":[{"sentence":"The design incorporated several flexures to improve the robot's maneuverability.","translation":"その設計には、ロボットの操作性を向上させるためにいくつかの屈曲が組み込まれていた。","type":"noun","meaning_category":"曲がり、屈曲"},{"sentence":"Geologists identified several flexures in the sedimentary layers of the canyon.","translation":"地質学者は、峡谷の堆積層にいくつかの撓曲を確認した。","type":"noun","meaning_category":"(地質学) 単斜構造、撓曲"}]}