{"word":"reanimator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"蘇生させる人、蘇生装置","english_definition":"A person or device that restores someone to life or consciousness; especially one that restores someone from apparent death.","examples":[{"sentence":"The doctor acted as a reanimator, bringing the patient back from the brink of death.","translation":"医師は蘇生者として行動し、患者を死の淵から救い戻した。"},{"sentence":"The reanimator device was used in the emergency room to revive the unconscious patient.","translation":"蘇生装置は、救急治療室で意識不明の患者を蘇生させるために使用された。"}],"collocations":["cardiac reanimator","portable reanimator","emergency reanimator"],"synonyms":["reviver","resuscitator"],"antonyms":["killer","destroyer"]},{"part_of_speech":"noun","definition":"(フィクション)死者を蘇らせる者、またはその装置","english_definition":"(In fiction) A person or device that brings the dead back to life, often with negative or horrific consequences.","examples":[{"sentence":"In the horror story, the mad scientist used a reanimator to create a monster.","translation":"そのホラー小説では、狂った科学者が蘇生装置を使って怪物を作り出した。"},{"sentence":"The film featured a reanimator that could bring corpses back to life, but they were never the same.","translation":"その映画には、死体を蘇らせることができる蘇生装置が登場したが、彼らは決して以前のようではなかった。"}],"collocations":["necromantic reanimator","experimental reanimator","unstable reanimator"],"synonyms":["necromancer","resurrectionist"],"antonyms":[]}],"etymology":{"value":"The word 'reanimator' is formed from the prefix 're-' (meaning again or anew) and the word 'animator' (one who gives life or spirit). It suggests the act of bringing life back to something that has lost it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈænɪmeɪtər/","syllables":"re-an-i-ma-tor"},"inflection":{"noun_plural":"reanimators"},"usage_notes":{"explanation":"The term 'reanimator' can refer to both a real-world medical device or professional involved in resuscitation, and a fictional character or device capable of bringing the dead back to life. The latter usage is often associated with science fiction and horror genres. In medical contexts, terms like 'resuscitator' or specific device names are more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reanimator reanimated the patient back to life.","correct":"✓ The reanimator reanimated the patient.","note":"The word 'reanimate' already implies bringing back to life, so adding 'back to life' is redundant."},{"incorrect":"✗ He used the reanimator for dead people.","correct":"✓ He used the reanimator on dead people.","note":"The correct preposition to use with 'reanimator' in this context is 'on'."}],"priority":"★★☆"},"related_words":{"derivatives":["reanimate (verb)","reanimation (noun)","animate (verb)","animation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized or fictional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reanimator' is relatively uncommon and is most often encountered in medical or science fiction contexts. It refers to someone or something that brings a person back to life or consciousness after apparent death. The term carries a somewhat specialized and technical connotation when used in a medical sense, and a fantastical or macabre connotation when used in a fictional sense. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The emergency team used a portable reanimator to try and revive the heart attack victim.","translation":"救急チームは、心臓発作の犠牲者を蘇生させようと、携帯型蘇生装置を使用した。","type":"noun","meaning_category":"Medical Device"},{"sentence":"Dr. Herbert West is a fictional reanimator from H.P. Lovecraft's stories.","translation":"ハーバート・ウェスト博士は、H.P.ラヴクラフトの物語に登場する架空の蘇生者である。","type":"noun","meaning_category":"Fictional Character"},{"sentence":"The success of the reanimator depended on the speed of its application after death.","translation":"蘇生装置の成功は、死後どれだけ早く使用されるかにかかっていた。","type":"noun","meaning_category":"Medical Device"},{"sentence":"The reanimator's experiments often had unforeseen and gruesome consequences.","translation":"蘇生者の実験は、しばしば予期せぬ恐ろしい結果をもたらした。","type":"noun","meaning_category":"Fictional Character"}]}