{"word":"osteometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"骨計測学、骨格計測","english_definition":"The scientific measurement and study of the size and shape of bones.","examples":[{"sentence":"Osteometry is used in physical anthropology to study human skeletal variation.","translation":"骨計測学は、身体人類学において、ヒトの骨格の多様性を研究するために用いられる。"},{"sentence":"Forensic osteometry can help determine the age, sex, and stature of an individual from skeletal remains.","translation":"法医骨計測学は、骨格遺骸から個人の年齢、性別、身長を特定するのに役立つ。"}],"collocations":["forensic osteometry (法医骨計測学)","comparative osteometry (比較骨計測学)","osteometry analysis (骨計測分析)","osteometry data (骨計測データ)"],"synonyms":["skeletal measurement","bone measurement","craniometry (頭蓋計測)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'osteon' (bone) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɒstiˈɒmɪtri","syllables":"os-te-om-e-try"},"inflection":{"noun_plural":"osteometries"},"usage_notes":{"explanation":"Osteometry is a specialized field within physical anthropology and forensic science that involves taking precise measurements of bones to analyze skeletal remains. It is used to study human evolution, population variation, and to identify individuals in forensic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Osteometry is the study of bone diseases.","correct":"✓ Osteometry is the measurement of bones.","note":"Osteometry is the measurement of bones, while the study of bone diseases is osteopathology."}],"priority":"★☆☆"},"related_words":{"derivatives":["osteometric (adjective: 骨計測の)","osteometrist (noun: 骨計測学者)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Osteometry is a technical term used in anthropology and forensic science. It refers to the measurement of bones to gather data about size and shape. This data can be used to study human evolution, identify individuals from skeletal remains, and understand population variation. It is a specialized field requiring precise techniques and knowledge of skeletal anatomy."},"example_sentences":[{"sentence":"The researchers used osteometry to analyze the skeletal remains found at the archaeological site.","translation":"研究者たちは、考古学的遺跡で発見された骨格遺骸を分析するために骨計測学を用いた。","type":"general","meaning_category":"General"},{"sentence":"Osteometry provides valuable information about the individual's biological profile.","translation":"骨計測学は、個人の生物学的プロファイルに関する貴重な情報を提供する。","type":"general","meaning_category":"General"}]}