{"word":"Standage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語) 立っていること、立位；（液体などの）静止、滞留","english_definition":"(archaic) The act or state of standing; a place for standing; a stagnant condition, especially of liquids.","examples":[{"sentence":"The standage of the water in the bucket led to mosquito breeding.","translation":"バケツの中の水の滞留が蚊の発生につながった。"},{"sentence":"He preferred a standage to sitting for long periods.","translation":"彼は長時間座るよりも立っていることを好んだ。"}],"collocations":["standage of water","in standage"],"synonyms":["standing","stagnation","stillness"],"antonyms":["motion","flow"]}],"etymology":{"value":"From Middle English standage, equivalent to stand + -age.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstændɪdʒ/","syllables":"stan-dage"},"inflection":{"noun_plural":"standages"},"usage_notes":{"explanation":"'Standage' is an archaic term, rarely used in modern English. It refers to the act of standing, a place for standing, or the stagnant condition of a liquid. It is more commonly encountered in historical texts or specialized contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The standage of the company is good.","correct":"✓ The standing of the company is good.","note":"Use 'standing' to refer to the reputation or status of a company, not 'standage'."}],"priority":"★★★"},"related_words":{"derivatives":["stand","standing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Standage' is an archaic word, meaning it is very old and not commonly used in modern English. It refers to the state of standing or, more often, to stagnant water. You are unlikely to encounter this word except in older texts or specialized contexts."},"example_sentences":[{"sentence":"The standage of the water created a breeding ground for algae.","translation":"水の滞留は藻類の繁殖地を作り出した。","type":"noun","meaning_category":"stagnation"},{"sentence":"He found a good standage on the hill to watch the battle.","translation":"彼は戦いを見るために丘の上に良い立ち位置を見つけた。","type":"noun","meaning_category":"standing"}]}