{"word":"hypomanic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"軽躁病の、軽躁的な","english_definition":"Relating to or characterized by hypomania.","examples":[{"sentence":"He displayed hypomanic symptoms such as increased energy and talkativeness.","translation":"彼は、エネルギーの増加や多弁などの軽躁病の症状を示した。"},{"sentence":"She was diagnosed with bipolar II disorder, characterized by episodes of depression and hypomanic periods.","translation":"彼女は、うつ病のエピソードと軽躁病の期間を特徴とする双極II型障害と診断された。"}],"collocations":["hypomanic episode","hypomanic symptoms","become hypomanic","feel hypomanic"],"synonyms":["elated","overexcited","manic (less severe)","elevated mood"],"antonyms":["depressed","lethargic","low-energy"]},{"part_of_speech":"noun","definition":"軽躁病の人","english_definition":"A person experiencing hypomania.","examples":[{"sentence":"The support group is for individuals with bipolar disorder, including those who are hypomanic or depressed.","translation":"その支援グループは、双極性障害を持つ個人、軽躁病またはうつ病の人々を対象としている。"}],"collocations":["a hypomanic individual","treat a hypomanic"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The word \"hypomanic\" is derived from the Greek words \"hypo-\" meaning \"under\" or \"less than,\" and \"manic,\" referring to mania. It describes a state that is less severe than full-blown mania.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈmænɪk/","syllables":"hy-po-man-ic"},"inflection":{"noun_plural":"hypomanics"},"usage_notes":{"explanation":"\"Hypomanic\" describes a state of elevated mood and increased energy that is less severe than mania. It is often associated with bipolar II disorder, where individuals experience periods of depression alternating with hypomanic episodes. While individuals in a hypomanic state may be more productive and creative, it can also lead to impulsivity, poor judgment, and irritability. It's important to distinguish hypomania from simply being happy or energetic, as it is a distinct clinical state.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's just hypomanic because he's excited about his vacation.","correct":"✓ He's just excited about his vacation.","note":"Excitement about a vacation is not necessarily hypomania. Hypomania is a clinical term for a specific mood state. Don't casually use the term to describe normal excitement."},{"incorrect":"✗ Hypomanic is a good thing; it means you're always happy.","correct":"✓ Hypomania can have some positive aspects, like increased energy, but it can also lead to negative consequences like impulsivity.","note":"While hypomania can sometimes lead to increased productivity and creativity, it is not always a positive state and can have negative consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["hypomania (noun)","manic (adjective, noun)","mania (noun)","bipolar (adjective, noun)","bipolar disorder (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hypomanic\" is a specialized term used in the field of psychology and psychiatry. It describes a state of mood that is elevated but less extreme than mania. It's often used in the context of bipolar disorder, specifically bipolar II disorder, where individuals experience alternating periods of depression and hypomania. Understanding this term requires familiarity with clinical psychology concepts. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"During her hypomanic episodes, she felt incredibly creative and productive.","translation":"彼女は軽躁病のエピソードの間、信じられないほど創造的で生産的だと感じた。","type":"adjective","meaning_category":"軽躁病の"},{"sentence":"The doctor monitored him for signs of becoming hypomanic.","translation":"医者は彼が軽躁病になる兆候がないか監視した。","type":"adjective","meaning_category":"軽躁病の"},{"sentence":"Hypomanic individuals may not recognize that their behavior is abnormal.","translation":"軽躁病の人は、自分の行動が異常であることに気づかないかもしれない。","type":"noun","meaning_category":"軽躁病の人"}]}