{"word":"idiotising","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)馬鹿にする、愚か者扱いする","english_definition":"To treat someone as an idiot; to make someone seem foolish or stupid.","examples":[{"sentence":"Stop idiotising me! I know what I'm doing.","translation":"馬鹿にするのはやめてくれ！何をしているか分かっている。"},{"sentence":"The article idiotised the readers by oversimplifying the complex issues.","translation":"その記事は複雑な問題を単純化しすぎて読者を馬鹿にした。"}],"collocations":["idiotise someone","idiotise the audience"],"synonyms":["patronize","condescend","demean","treat as stupid","talk down to"],"antonyms":["respect","value","appreciate","treat as intelligent"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(何かを)単純化しすぎる、愚劣化する","english_definition":"To oversimplify something to the point of making it seem foolish or stupid.","examples":[{"sentence":"The movie idiotised the historical events, making it inaccurate.","translation":"その映画は歴史的出来事を愚劣化し、不正確にした。"},{"sentence":"The politician was accused of idiotising the debate by focusing only on sound bites.","translation":"その政治家は短いフレーズだけに焦点を当てることで議論を愚劣化したと非難された。"}],"collocations":["idiotise a concept","idiotise an argument"],"synonyms":["oversimplify","dumb down","debase","degrade","make simplistic"],"antonyms":["complicate","elaborate","nuance","make complex"]}],"etymology":{"value":"Derived from 'idiotise', which comes from 'idiot', originating from the Greek 'idiōtēs' meaning 'private person, layman, ignorant person'. The suffix '-ise' (or '-ize' in American English) is used to form verbs indicating the act of making or treating something in a certain way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪdiətaɪzɪŋ/","syllables":"i-di-ot-is-ing"},"inflection":{"verb_forms":{"present_simple":["idiotises"],"past_simple":"idiotised","past_participle":"idiotised","present_participle":"idiotising"}},"usage_notes":{"explanation":"'Idiotising' is the present participle and gerund form of the verb 'idiotise'. It describes the action of treating someone or something as if they are an idiot, or oversimplifying complex matters to a ridiculous degree. It often carries a negative connotation, implying disrespect or intellectual dishonesty. The word is relatively uncommon and is more frequently found in critical or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was idiotising because he was angry.","correct":"✓ He was being patronizing because he was angry.","note":"'Idiotising' specifically implies treating someone as an idiot, not just general anger. 'Patronizing' is a more common and suitable word for general condescension."},{"incorrect":"✗ The plan was idiotising.","correct":"✓ The plan was idiotic. / ✓ The plan was idiotised.","note":"'Idiotising' is a verb form. To describe a plan as foolish, use 'idiotic' (adjective) or 'the plan was idiotised' (passive voice)."}],"priority":"★★☆"},"related_words":{"derivatives":["idiotise (verb)","idiot (noun)","idiotic (adjective)","idiotically (adverb)"],"phrases":["idiotise the debate","idiotise the audience"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Idiotising' is a relatively rare and sophisticated word. It means to treat someone or something as if they are an idiot, or to oversimplify something to a ridiculous degree. It is often used in academic or critical contexts to describe the act of dumbing down complex issues or patronizing an audience. Because of its specific and often negative connotation, it is important to use this word carefully and accurately. It is generally understood by highly proficient English speakers but may not be familiar to those with lower levels of English proficiency."},"example_sentences":[{"sentence":"The professor accused the journalist of idiotising the complex economic policies.","translation":"教授はジャーナリストが複雑な経済政策を愚劣化したと非難した。","type":"verb","meaning_category":"oversimplifying"},{"sentence":"He felt he was being idiotised by his colleagues during the meeting.","translation":"彼は会議中に同僚から馬鹿にされていると感じた。","type":"verb","meaning_category":"treating as stupid"},{"sentence":"The politician's speech was criticised for idiotising the electorate.","translation":"その政治家の演説は有権者を馬鹿にしていると批判された。","type":"verb","meaning_category":"treating as stupid"},{"sentence":"The documentary was accused of idiotising history to appeal to a wider audience.","translation":"そのドキュメンタリーはより多くの視聴者にアピールするために歴史を愚劣化したと非難された。","type":"verb","meaning_category":"oversimplifying"}]}