{"word":"deuterofibrinose","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生化学) デュテロフィブリノース：フィブリノーゲンがトロンビンによってフィブリンに変換される際に生成される中間生成物。","english_definition":"(biochemistry) Deuterofibrinose: An intermediate product formed during the conversion of fibrinogen to fibrin by thrombin.","examples":[{"sentence":"Deuterofibrinose is a soluble derivative of fibrinogen.","translation":"デュテロフィブリノースはフィブリノーゲンの可溶性誘導体です。"},{"sentence":"The formation of deuterofibrinose is a key step in blood clot formation.","translation":"デュテロフィブリノースの形成は、血栓形成の重要なステップです。"}],"collocations":["formation of deuterofibrinose (デュテロフィブリノースの形成)","soluble deuterofibrinose (可溶性デュテロフィブリノース)"],"synonyms":["fibrin monomer","fibrin derivative"],"antonyms":[]}],"etymology":{"value":"deuter(o)- (第二の、中間的な) + fibrin + -ose (糖類を示す接尾辞だが、ここではタンパク質の誘導体を示す)","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdjuːtərəʊfaɪˈbrɪnəʊs/","syllables":"du-te-ro-fi-bri-nose"},"inflection":{"noun_plural":"deuterofibrinoses"},"usage_notes":{"explanation":"Deuterofibrinose is a technical term used in biochemistry and hematology to describe a specific intermediate in the blood coagulation cascade. It is not a commonly used word outside of these specialized fields.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["fibrinogen","fibrin","thrombin"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Deuterofibrinose' is a highly specialized biochemical term. Understanding it requires a strong background in biochemistry and hematology. It refers to an intermediate product in the conversion of fibrinogen to fibrin during blood clot formation. Its usage is limited to scientific research and advanced medical contexts."},"example_sentences":[{"sentence":"The study investigated the role of deuterofibrinose in the early stages of coagulation.","translation":"その研究は、凝固の初期段階におけるデュテロフィブリノースの役割を調査した。","type":"noun","meaning_category":"生化学"},{"sentence":"Levels of deuterofibrinose can be used as a marker of thrombin activity.","translation":"デュテロフィブリノースのレベルは、トロンビン活性のマーカーとして使用できる。","type":"noun","meaning_category":"生化学"}]}