{"word":"upside-downness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"逆さまの状態、倒立","english_definition":"The state of being upside down.","examples":[{"sentence":"The upside-downness of the painting made it difficult to understand.","translation":"その絵が逆さまになっているため、理解するのが難しかった。"},{"sentence":"The children laughed at the upside-downness of the clown's hat.","translation":"子供たちはピエロの帽子の逆さまになっている様子を見て笑った。"}],"collocations":["experience upside-downness","the upside-downness of the world"],"synonyms":["inversion","reversal","topsy-turviness"],"antonyms":["right-side-upness","normality","order"]},{"part_of_speech":"noun","definition":"混乱、混乱状態","english_definition":"A state of chaos or disorder.","examples":[{"sentence":"The upside-downness of the situation left everyone feeling disoriented.","translation":"その状況の混乱により、誰もが混乱した。"},{"sentence":"The sudden change caused a great deal of upside-downness in the company.","translation":"突然の変更は会社に大きな混乱をもたらした。"}],"collocations":["political upside-downness","economic upside-downness"],"synonyms":["chaos","disorder","turmoil","confusion"],"antonyms":["order","structure","stability"]}],"etymology":{"value":"Derived from \"upside down\" (adverbial phrase indicating a reversed or inverted position) + the suffix \"-ness\" (forming a noun that denotes a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌpsaɪdˈdaʊnnəs/","syllables":"up-side-down-ness"},"inflection":{"noun_plural":"upside-downnesses"},"usage_notes":{"explanation":"\"Upside-downness\" is a noun that describes the state or quality of being upside down. It can refer literally to something being physically inverted, or figuratively to a state of chaos or disorder. The word is relatively uncommon, but it is useful for expressing the concept of inversion or disarray.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The upside-downness is making me dizzy.","correct":"✓ The upside-down position is making me dizzy.","note":"When referring to a specific object or person being upside down, it's more common to use \"upside-down position\" or \"being upside down.\" \"Upside-downness\" is better for describing the general state or quality of being inverted."}],"priority":"★☆☆"},"related_words":{"derivatives":["upside down (adverb, adjective)"],"phrasal_verbs":[],"synonyms":["inversion","reversal","topsy-turviness","chaos","disorder","confusion"],"antonyms":["order","normality","right-side-upness"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"upside-downness\" is a complex noun formed by combining the phrase \"upside down\" with the suffix \"-ness.\" It refers to the state or quality of being inverted or chaotic. Due to its complexity and infrequent use, it is considered a high-level vocabulary word. It is used to describe the general state of being inverted or chaotic, rather than a specific instance of something being upside down."},"example_sentences":[{"sentence":"The artist captured the upside-downness of the world through his distorted landscapes.","translation":"そのアーティストは、歪んだ風景を通して世界の混乱を描き出した。","type":"general","meaning_category":"chaos"},{"sentence":"The acrobat's act highlighted the incredible upside-downness of human flexibility.","translation":"その曲芸師の演技は、人間の柔軟性の信じられないほどの逆さまの状態を際立たせた。","type":"general","meaning_category":"inversion"}]}