{"word":"Tolsey","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A building or room used as a town hall or exchange, especially in some English market towns.","english_definition":"A building or room used as a town hall or exchange, especially in some English market towns.","examples":[{"sentence":"The Tolsey in Gloucester was a bustling center of trade and local government.","translation":"グロスターのトルシーは、貿易と地方自治体の賑やかな中心地でした。"},{"sentence":"Merchants gathered at the Tolsey to conduct business.","translation":"商人たちはビジネスを行うためにトルシーに集まりました。"}],"collocations":["Gloucester Tolsey","Old Tolsey"],"synonyms":["town hall","guildhall","exchange"],"antonyms":[]}],"etymology":{"value":"Origin uncertain, possibly from Old English toll-set, referring to a place where tolls were collected.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒlzi/","syllables":"Tol-sey"},"inflection":{"noun_plural":"Tolseys"},"usage_notes":{"explanation":"The term 'Tolsey' is primarily historical and regional, mainly associated with specific market towns in England. It refers to a building that served multiple purposes, including administrative functions, trade, and public gatherings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tolsey is a modern office building.","correct":"✓ The tolsey was a historical building used for town administration.","note":"'Tolsey' refers to a historical building, not a modern one."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Tolsey' is a historical term referring to a specific type of building in English market towns. It is not commonly used in modern English. Understanding its meaning requires knowledge of historical contexts and local history."},"example_sentences":[{"sentence":"The old Tolsey clock tower still stands as a landmark in the town square.","translation":"古いトルシーの時計塔は、今も町の広場のランドマークとして立っています。","type":"noun","meaning_category":"historical building"}]}