{"word":"nippily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"寒々と、肌寒く、ぴりっとするほど、きびきびと、てきぱきと","english_definition":"In a nippy manner; briskly; keenly; sharply; with a biting quality (referring to cold or manner).","examples":[{"sentence":"The wind blew nippily across the open field.","translation":"風が寒々と開けた野原を吹き抜けた。"},{"sentence":"She walked nippily to keep warm in the cold weather.","translation":"彼女は寒い天気の中、暖を取るためにきびきびと歩いた。"},{"sentence":"He responded nippily to the request, getting it done quickly.","translation":"彼はその要求にきびきびと対応し、素早く終わらせた。"}],"collocations":["nippily dressed","nippily cold","nippily efficient"],"synonyms":["briskly","sharply","keenly","chilly","coldly","efficiently","quickly"],"antonyms":["slowly","languidly","warmly"]}],"etymology":{"value":"Derived from the adjective 'nippy' (meaning chilly or brisk), with the addition of the suffix '-ly' to form an adverb. 'Nippy' itself likely originated from the verb 'nip,' suggesting a sharp or biting sensation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɪpɪli/","syllables":"nip-pi-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Nippily' is an adverb that describes something done in a 'nippy' manner. 'Nippy' can refer to cold weather that is sharp or biting, or to a person's manner that is brisk or efficient. Therefore, 'nippily' can describe actions done quickly and efficiently, or actions taken in response to cold weather. It is not a commonly used word, but it is descriptive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun shone nippily.","correct":"✓ The sun shone brightly.","note":"'Nippily' generally refers to cold or brisk actions, not to the sun's shining. Use 'brightly' or another appropriate adverb instead."},{"incorrect":"✗ He spoke nippily to her, showing his affection.","correct":"✓ He spoke kindly to her, showing his affection.","note":"'Nippily' implies a sharp or brisk manner, which is not usually associated with affection. Use 'kindly' or another appropriate adverb instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["nippy (adjective)","nip (verb, noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nippily' is an uncommon adverb that describes something done in a brisk, sharp, or chilly manner. It can refer to actions performed quickly and efficiently, or to the feeling of cold weather. Because it is not frequently used, it is more likely to be encountered in advanced texts or specialized contexts. Understanding its connection to the adjective 'nippy' (chilly or brisk) can help in deciphering its meaning."},"example_sentences":[{"sentence":"The workers moved nippily to complete the task before the deadline.","translation":"作業員たちは締め切り前に仕事を終えるためにきびきびと動いた。","type":"adverb","meaning_category":"briskly, efficiently"},{"sentence":"She pulled her coat tighter and walked nippily through the icy streets.","translation":"彼女はコートをきつく締め、凍てつく道をきびきびと歩いた。","type":"adverb","meaning_category":"coldly, briskly"}]}