{"word":"Biologism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"生物学主義：社会現象や文化現象を生物学的な要因で説明しようとする考え方。","english_definition":"The belief that biological factors are the primary determinants of social and cultural phenomena.","examples":[{"sentence":"Biologism can lead to oversimplified explanations of complex social issues.","translation":"生物学主義は、複雑な社会問題を単純化しすぎた説明につながる可能性がある。"},{"sentence":"Critics argue that biologism ignores the role of social and environmental factors.","translation":"批判者たちは、生物学主義が社会や環境的要因の役割を無視していると主張する。"}],"collocations":["social biologism (社会生物学主義)","genetic biologism (遺伝的生物学主義)"],"synonyms":["biological determinism","genetic determinism"],"antonyms":["environmentalism","social constructivism"]}],"etymology":{"value":"'biology'（生物学）+ '-ism'（主義）","priority":"★★★"},"pronunciation":{"ipa":"/baɪˈɒlədʒɪzəm/","syllables":"bi-o-lo-gi-sm"},"inflection":{"noun_plural":"Biologisms"},"usage_notes":{"explanation":"Biologism is often used critically to describe approaches that reduce complex social phenomena to simple biological causes. It is often associated with controversial ideas about race, gender, and social inequality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The biologism is a good way to understand society.","correct":"✓ Biologism is a controversial approach to understanding society.","note":"Biologism is often seen as a problematic or controversial approach, not necessarily a 'good' one. Using 'controversial' or 'oversimplified' is more appropriate in many contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["biologist","biological","biologically"],"related_terms":["social Darwinism","eugenics"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biologism' is a complex term used in social sciences and philosophy to critique approaches that overemphasize biological explanations for social and cultural phenomena. It is often associated with reductionist thinking. Understanding this term requires familiarity with sociological and philosophical debates.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician's views were criticized for their reliance on biologism to explain poverty.","translation":"その政治家の見解は、貧困を説明するために生物学主義に依存しているとして批判された。","type":"general","meaning_category":"general"},{"sentence":"The dangers of biologism lie in its potential to justify social inequalities as natural.","translation":"生物学主義の危険性は、社会的不平等を自然なものとして正当化する可能性にある。","type":"general","meaning_category":"general"}]}