{"word":"hoodful","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に比喩的に)フード一杯の量、フードにいっぱい入る量","english_definition":"As much as a hood will hold; a hood's capacity. Often used figuratively to indicate a large or abundant amount.","examples":[{"sentence":"The car was filled hoodful of groceries.","translation":"車はフードいっぱいの食料品で満たされていた。"},{"sentence":"He brought a hoodful of apples from the orchard.","translation":"彼は果樹園からフードいっぱいのリンゴを持ってきた。"},{"sentence":"(Figurative) The project requires a hoodful of dedication and hard work.","translation":"(比喩的に) そのプロジェクトにはフード一杯の献身と努力が必要だ。"}],"collocations":["a hoodful of something","filled a hoodful","carry a hoodful"],"synonyms":["capful","handful","armful","abundance","plenty"],"antonyms":["scant","few","little"]},{"part_of_speech":"adjective","definition":"フード一杯の、フードにいっぱい入る","english_definition":"Capable of filling a hood; describing a quantity that fills a hood.","examples":[{"sentence":"A hoodful of berries is all I could gather today.","translation":"今日集められたのは、フード一杯のベリーだけだった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'hood' (a covering for the head and neck) and '-ful' (meaning 'full of').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhʊdfʊl/","syllables":"hood-ful"},"inflection":{"noun_plural":"hoodfuls"},"usage_notes":{"explanation":"'Hoodful' is a relatively uncommon word, primarily used to describe a quantity that can fit inside a hood. It is often used figuratively to express a large amount, similar to 'handful' or 'armful.' The context usually makes it clear whether it's a literal or figurative usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave me a hoodful of advices.","correct":"✓ He gave me a hoodful of advice.","note":"'Advice' is an uncountable noun, so it doesn't take a plural form ('advices')."},{"incorrect":"✗ The car's hoodful was filled with water.","correct":"✓ The car's hood was filled with water.","note":"'Hoodful' refers to the amount that can fit in a hood, not the hood itself. In this case, you'd simply say 'The car's hood was filled with water.'"}],"priority":"★★☆"},"related_words":{"derivatives":["hood"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hoodful' is a relatively rare word that combines 'hood' (a head covering) and '-ful' (meaning 'full of'). It describes the amount that can fit inside a hood. It can be used literally, such as 'a hoodful of berries,' or figuratively to mean a large amount, like 'a hoodful of dedication.' Because of its rarity, it's more likely to be encountered in literature or specialized contexts rather than everyday conversation."},"example_sentences":[{"sentence":"She collected a hoodful of wildflowers in the meadow.","translation":"彼女は草原でフード一杯の野花を集めた。","type":"noun","meaning_category":"amount"},{"sentence":"The task requires a hoodful of patience.","translation":"その仕事にはフード一杯の忍耐が必要だ。","type":"noun","meaning_category":"figurative amount"}]}