{"word":"mbalolo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A traditional Zambian dish made from caterpillars.","english_definition":"A type of edible caterpillar that is a traditional food source in Zambia, often fried or boiled.","examples":[{"sentence":"Mbalolo is a popular delicacy in certain regions of Zambia.","translation":"ムバロロはザンビアの一部の地域で人気のある珍味です。"},{"sentence":"The villagers collect mbalolo during the rainy season.","translation":"村人たちは雨季にムバロロを収集します。"},{"sentence":"She prepared mbalolo with tomatoes and onions.","translation":"彼女はトマトと玉ねぎでムバロロを調理しました。"}],"collocations":["collect mbalolo","cook mbalolo","eat mbalolo","prepare mbalolo"],"synonyms":["caterpillar dish","edible insect"],"antonyms":[]}],"etymology":{"value":"Derived from a local Zambian language, referring specifically to the edible caterpillar species used in the dish.","priority":"★★☆"},"pronunciation":{"ipa":"/m̩.bɑˈloʊ.loʊ/","syllables":"m-ba-lo-lo"},"inflection":{"noun_plural":"mbalolos"},"usage_notes":{"explanation":"'Mbalolo' refers to both the caterpillar and the dish made from it. It is a culturally significant food, especially in rural areas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a mbaloloes.","correct":"✓ I ate mbalolo.","note":"'Mbalolo' can be used as a mass noun, but 'mbalolos' is also acceptable as a plural. However, 'a mbaloloes' is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to Zambian cuisine.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mbalolo' is a specialized term referring to a specific type of edible caterpillar dish in Zambian cuisine. Understanding requires familiarity with Zambian food culture. The word is not commonly used outside of contexts discussing Zambian food or entomophagy.","note":"Requires knowledge of Zambian culture and cuisine."},"example_sentences":[{"sentence":"During the rainy season, the market is filled with vendors selling fresh mbalolo.","translation":"雨季の間、市場は新鮮なムバロロを売る露店でいっぱいになります。","type":"noun","meaning_category":"Food"},{"sentence":"The taste of mbalolo is unique and considered a delicacy by many Zambians.","translation":"ムバロロの味は独特で、多くのザンビア人にとって珍味とされています。","type":"noun","meaning_category":"Food"},{"sentence":"Families often gather to collect mbalolo from the trees after the rains.","translation":"家族は雨の後、木からムバロロを集めるために集まることがよくあります。","type":"noun","meaning_category":"Food"}]}