{"word":"Noahic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ノアの、ノアに関する","english_definition":"Of or relating to Noah, a biblical figure, or to the Noahic flood.","examples":[{"sentence":"The Noahic covenant is a significant element in Judeo-Christian theology.","translation":"ノア契約は、ユダヤ・キリスト教神学における重要な要素です。"},{"sentence":"Noahic flood narratives are found in various cultures.","translation":"ノアの洪水物語は、様々な文化に見られます。"}],"collocations":["Noahic covenant","Noahic flood","Noahic laws"],"synonyms":["diluvian","antediluvian"],"antonyms":[]}],"etymology":{"value":"From the name Noah, a biblical figure, + -ic.","priority":"★★★"},"pronunciation":{"ipa":"/noʊˈeɪɪk/","syllables":"No-a-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'Noahic' is primarily used in religious or historical contexts, especially when discussing the biblical figure Noah, the Noahic flood, or the covenant God made with Noah after the flood. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Noah (noun): ノア","Noahide (noun): ノアの子孫、ノアの戒律を守る異邦人","Noahidism (noun): ノアの戒律"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Noahic' is a specialized term primarily encountered in religious or historical discussions related to the biblical figure Noah and the Noahic flood. Its usage is limited to contexts where these topics are directly relevant, making it less common in general vocabulary. Understanding the term requires familiarity with biblical narratives and theological concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Noahic laws are believed by some to apply to all of humanity.","translation":"ノアの戒律は、人類全体に適用されると信じられている人もいます。","type":"adjective","meaning_category":"ノアに関する"},{"sentence":"Scholars debate the historical accuracy of the Noahic flood.","translation":"学者たちは、ノアの洪水の歴史的正確性について議論しています。","type":"adjective","meaning_category":"ノアの"}]}