{"word":"allopath","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アロパシー医、現代医学医","english_definition":"A physician who practices allopathy or conventional medicine.","examples":[{"sentence":"The patient consulted an allopath for their illness.","translation":"患者は病気のためにアロパシー医に相談した。"}],"collocations":[],"synonyms":["conventional doctor","medical doctor","physician"],"antonyms":["homeopath"]},{"part_of_speech":"noun","definition":"アロパシーの信奉者","english_definition":"A person who believes in allopathy.","examples":[{"sentence":"As an allopath, she trusts in evidence-based treatments.","translation":"アロパシーの信奉者として、彼女はエビデンスに基づいた治療を信頼している。"}],"collocations":[],"synonyms":["conventional medicine supporter"],"antonyms":["homeopathy supporter"]}],"etymology":{"value":"From 'allo-' (other, different) + '-pathy' (suffering, disease). Coined in the early 19th century by Samuel Hahnemann to describe conventional medicine in contrast to homeopathy.","priority":"★★☆"},"pronunciation":{"ipa":"ˈæləˌpæθ","syllables":"al-lo-path"},"inflection":{"noun_plural":"allopaths"},"usage_notes":{"explanation":"The term 'allopath' was originally used by homeopaths to distinguish conventional medicine from homeopathy. It is sometimes considered derogatory by practitioners of conventional medicine, who prefer to be called 'medical doctors' or simply 'doctors'. The term is based on the principle of 'treating disease with remedies that produce effects different from those of the disease itself'.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["allopathic","allopathy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'allopath' is a specialized term primarily used in the context of contrasting conventional medicine with alternative medicine, particularly homeopathy. It's not commonly used in everyday language and is more likely to be encountered in discussions about medical systems or healthcare philosophies. Understanding its historical context and potential for being perceived as derogatory is important for appropriate usage."},"example_sentences":[{"sentence":"Many people prefer to consult an allopath for serious medical conditions.","translation":"多くの人々は深刻な病状の場合、アロパシー医に相談することを好む。","type":"noun","meaning_category":"現代医学医"},{"sentence":"The debate between allopaths and homeopaths continues in some circles.","translation":"アロパシー医とホメオパシー医の間の議論は一部の界隈で続いている。","type":"noun","meaning_category":"現代医学医"}]}