{"word":"Deists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"理神論者たち","english_definition":"Plural form of deist: Advocates of deism, the belief in the existence of a supreme being, specifically a creator who does not intervene in the universe.","examples":[{"sentence":"The Deists of the Enlightenment emphasized reason and natural law.","translation":"啓蒙時代の理神論者たちは、理性と自然法を重視した。"},{"sentence":"Many of the Founding Fathers of the United States were influenced by Deists.","translation":"アメリカ合衆国の建国の父たちの多くは、理神論者たちの影響を受けた。"}],"collocations":["Enlightenment Deists","American Deists","Influenced by Deists","Prominent Deists"],"synonyms":["rationalists","freethinkers","natural religionists"],"antonyms":["theists","dogmatists","fundamentalists"]}],"etymology":{"value":"Derived from 'deist', which comes from Latin 'deus' (god), reflecting the belief in a god, but one based on reason rather than religious dogma.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdiːɪsts/","syllables":"Dee-ists"},"inflection":{"noun_plural":"Deists"},"usage_notes":{"explanation":"'Deists' refers to a group of people who adhere to deism. Deism is a philosophical position that acknowledges the existence of a creator god, but rejects the need for organized religion, divine revelation, or supernatural intervention in the world. Deists typically believe that God created the universe and established natural laws, but does not interfere with its operation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the deist.","correct":"✓ He is one of the Deists.","note":"When referring to a group, use the plural form 'Deists'."},{"incorrect":"✗ Deists believe in a personal God who answers prayers.","correct":"✓ Deists believe in a creator God who does not intervene in the world.","note":"Deists generally reject the idea of a personal, interventionist God."}],"priority":"★★☆"},"related_words":{"derivatives":["Deist (singular noun)","Deism (noun: the belief system)","Deistic (adjective: relating to deism)"],"phrases":["Age of Deism","Deistic philosophy","Natural Religion"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in historical or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deists' is a term used to describe people who subscribe to deism, a philosophical belief system that posits the existence of a creator God who does not intervene in the universe. This term is most often encountered in discussions of the Enlightenment period, religious history, and philosophical debates about the nature of God and religion. Understanding the term requires familiarity with philosophical and religious concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The writings of the Deists influenced the development of secular thought.","translation":"理神論者たちの著作は、世俗的な思想の発展に影響を与えた。","type":"general","meaning_category":"Influence"},{"sentence":"Some historians argue that several of the Founding Fathers were actually Deists rather than orthodox Christians.","translation":"一部の歴史家は、建国の父たちの何人かは、正統なキリスト教徒というよりはむしろ理神論者だったと主張する。","type":"historical","meaning_category":"Historical context"},{"sentence":"Deists emphasized the importance of reason and individual conscience in matters of faith.","translation":"理神論者たちは、信仰の問題において理性と個人の良心の重要性を強調した。","type":"philosophical","meaning_category":"Philosophical belief"},{"sentence":"The Deists rejected the authority of organized religion and traditional dogma.","translation":"理神論者たちは、組織化された宗教と伝統的な教義の権威を拒否した。","type":"religious","meaning_category":"Religious rejection"}]}