{"word":"Toxinosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"中毒症、毒素症","english_definition":"A disease caused by the presence of toxins in the body.","examples":[{"sentence":"The patient was diagnosed with toxinosis after exhibiting symptoms of nausea and vomiting.","translation":"患者は吐き気と嘔吐の症状を示した後、中毒症と診断された。"},{"sentence":"Toxinosis can result from various sources, including bacterial infections and environmental pollutants.","translation":"中毒症は、細菌感染や環境汚染物質など、さまざまな原因から起こりうる。"}],"collocations":["bacterial toxinosis","environmental toxinosis","food-borne toxinosis"],"synonyms":["toxemia","poisoning","intoxication"],"antonyms":["antitoxin","detoxification"]}],"etymology":{"value":"From 'toxin' (poison) + '-osis' (denoting a diseased or abnormal condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒksɪˈnoʊsɪs/","syllables":"tox-i-no-sis"},"inflection":{"noun_plural":"toxinoses"},"usage_notes":{"explanation":"'Toxinosis' refers to a condition where toxins present in the body cause illness. It is a general term and can be specified based on the source of the toxins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed antibiotics to treat the toxinosis.","correct":"✓ The doctor prescribed antibiotics to treat the bacterial infection causing the toxinosis.","note":"Antibiotics treat bacterial infections, which may cause toxinosis. Toxinosis itself requires treatment focused on removing or neutralizing the toxins."}],"priority":"★☆☆"},"related_words":{"derivatives":["toxin","toxic","toxicology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxinosis' is a technical term used in medicine to describe a disease state caused by toxins in the body. It is not a common word in everyday language and is primarily used in medical or scientific contexts. Understanding this term requires knowledge of basic medical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"Chronic exposure to mold can lead to toxinosis.","translation":"慢性的なカビへの暴露は中毒症を引き起こす可能性がある。","type":"general","meaning_category":"cause"},{"sentence":"The vet suspected toxinosis in the dog due to its sudden illness.","translation":"獣医は犬が突然病気になったため、中毒症を疑った。","type":"veterinary","meaning_category":"diagnosis"},{"sentence":"Treatment for toxinosis often involves supportive care and toxin removal.","translation":"中毒症の治療は、多くの場合、支持療法と毒素の除去を伴う。","type":"treatment","meaning_category":"treatment"}]}