{"word":"Pindarics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ピンドロス風の詩、ピンドロス風の賛歌","english_definition":"odes in the style of the ancient Greek poet Pindar, characterized by elaborate and irregular meter, complex stanza structures, and lofty themes.","examples":[{"sentence":"The poet attempted to write Pindarics to celebrate the victory.","translation":"その詩人は勝利を祝うためにピンドロス風の詩を書こうと試みた。"},{"sentence":"His Pindarics were known for their complex structure and elevated language.","translation":"彼のピンドロス風の詩は、その複雑な構成と高尚な言葉遣いで知られていた。"}],"collocations":["write Pindarics","attempt Pindarics","study Pindarics","analyze Pindarics"],"synonyms":["ode","lyric poem","choral ode"],"antonyms":[]}],"etymology":{"value":"Named after Pindar (c. 518 – c. 438 BC), an ancient Greek lyric poet from Thebes, known for his celebratory odes written for athletic victors. The term 'Pindarics' refers to poems written in his style.","priority":"★★★"},"pronunciation":{"ipa":"/pɪnˈdærɪks/","syllables":"pin-dar-ics"},"inflection":{"noun_plural":"Pindarics"},"usage_notes":{"explanation":"'Pindarics' specifically refers to odes that follow the style and structure of Pindar's poems. These poems are typically characterized by their complex and irregular meter, elaborate stanzaic structure (often involving strophe, antistrophe, and epode), and elevated subject matter, often celebrating achievements or virtues. The term is primarily used in literary contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a Pindaric.","correct":"✓ He wrote a Pindaric ode. / ✓ He wrote in the Pindaric style.","note":"While 'Pindaric' can function as a noun, it often implies 'Pindaric ode' and is sometimes better used adjectivally to describe the style. "},{"incorrect":"✗ The poem was Pindaric in length.","correct":"✓ The poem was Pindaric in style.","note":"'Pindaric' refers to the style and structure, not simply the length of a poem."}],"priority":"★★☆"},"related_words":{"derivatives":["Pindaric (adjective: relating to Pindar or his style of poetry)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized literary term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pindarics' is a specialized literary term referring to odes written in the style of the ancient Greek poet Pindar. These poems are known for their complex structure, irregular meter, and elevated themes, often celebrating achievements or virtues. Understanding this term requires familiarity with classical literature and poetic forms."},"example_sentences":[{"sentence":"The collection included several ambitious Pindarics.","translation":"そのコレクションには、いくつかの意欲的なピンドロス風の詩が含まれていた。","type":"noun","meaning_category":"ピンドロス風の詩"},{"sentence":"The poet's Pindaric style was characterized by its soaring language and intricate structure.","translation":"その詩人のピンドロス風の文体は、その高揚した言葉遣いと複雑な構成によって特徴づけられていた。","type":"adjective (as it modifies style)","meaning_category":"ピンドロス風の"}]}