{"word":"Nematognathi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ナマズ目","english_definition":"An order of ray-finned fish also known as Siluriformes, characterized by prominent barbels, which resemble whiskers.","examples":[{"sentence":"The order Nematognathi includes a diverse array of catfish species found worldwide.","translation":"ナマズ目には、世界中で見られる多様なナマズ種が含まれています。"}],"collocations":["belong to the order Nematognathi","Nematognathi species","study of Nematognathi"],"synonyms":["Siluriformes","catfish order"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'nema' (thread), 'matos' (thread) and 'gnathos' (jaw), referring to the characteristic barbels around the mouth that resemble threads.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɛmətɒɡˈnæθaɪ/","syllables":"Ne-ma-to-gna-thi"},"inflection":{"notes":"Plural form is Nematognathi (same as singular)."},"usage_notes":{"explanation":"'Nematognathi' is a scientific term used in biology and ichthyology to classify a specific order of fish. It is often used in academic or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Nematognathi in the aquarium, it was very cute.","correct":"✓ I saw a catfish in the aquarium, it was very cute.","note":"In general conversation, it's better to use 'catfish' instead of 'Nematognathi' unless you're in a scientific context."}],"priority":"★☆☆"},"related_words":{"derivatives":["Siluriformes (synonym)","catfish (common name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Nematognathi' is a scientific classification used exclusively within the fields of zoology and ichthyology. Its usage is confined to formal academic papers, research, and specialized discussions among experts. Due to its highly technical nature and limited applicability outside of these specific domains, it is considered a term of advanced proficiency. Understanding requires familiarity with biological taxonomy.","priority":"★☆☆"},"example_sentences":[{"sentence":"Researchers are studying the evolutionary relationships within the Nematognathi.","translation":"研究者たちはナマズ目内の進化関係を研究しています。","type":"scientific","meaning_category":"classification"},{"sentence":"The defining characteristic of Nematognathi is the presence of barbels.","translation":"ナマズ目の決定的な特徴は、ひげの存在です。","type":"scientific","meaning_category":"characteristics"}]}