{"word":"oestrous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"発情期の、発情している","english_definition":"of or relating to oestrus; in heat.","examples":[{"sentence":"The cat was in an oestrous state.","translation":"その猫は発情期だった。"},{"sentence":"Oestrous behavior in dogs can be quite noticeable.","translation":"犬の発情期の行動は非常に目立つことがある。"}],"collocations":["oestrous cycle (発情周期)","oestrous behavior (発情期の行動)","oestrous female (発情期の雌)"],"synonyms":["in heat","rutting","estrous"],"antonyms":["anestrous"]}],"etymology":{"value":"Derived from 'oestrus,' which comes from the Greek word 'oistros' meaning 'gadfly' or 'sting,' metaphorically referring to the frenzy associated with sexual desire.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːstrəs/","syllables":"ees-trus"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible but rare (more oestrous, most oestrous)."},"usage_notes":{"explanation":"'Oestrous' is primarily used in biological or veterinary contexts to describe the reproductive state of female mammals. It's a technical term, less commonly used in everyday language. The spelling 'estrous' is also common, particularly in American English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The oestrous dog was friendly.","correct":"✓ The oestrous dog was receptive to mating.","note":"'Oestrous' describes a physiological state, not a personality trait. Focus on describing behaviors related to being in heat, rather than general characteristics."},{"incorrect":"✗ The oestrous cycle is the same in all mammals.","correct":"✓ The oestrous cycle varies in length among different mammal species.","note":"The specifics of the oestrous cycle (length, frequency) differ significantly between species. Avoid generalizations."}],"priority":"★★☆"},"related_words":{"derivatives":["oestrus (noun: 発情期)","estrus (noun: 発情期 - US spelling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oestrous' is a technical term used in biology and veterinary medicine to describe the period of sexual receptivity in female mammals, also known as being 'in heat.' It's not commonly used in everyday conversation. Understanding this word requires knowledge of reproductive biology. The term 'estrous' is an alternative spelling, more common in American English.","priority":"★★★"},"example_sentences":[{"sentence":"The vet confirmed the cow was in the early stages of her oestrous cycle.","translation":"獣医は、その牛が発情周期の初期段階にあることを確認した。","type":"adjective","meaning_category":"発情期"},{"sentence":"Oestrous females release pheromones to attract males.","translation":"発情期の雌は、雄を引き寄せるためにフェロモンを放出する。","type":"adjective","meaning_category":"発情期"},{"sentence":"Changes in hormone levels trigger oestrous behavior.","translation":"ホルモンレベルの変化が発情期の行動を引き起こす。","type":"adjective","meaning_category":"発情期"}]}