{"word":"unputtied","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"パテで固定されていない、パテが塗られていない","english_definition":"Not fixed or sealed with putty.","examples":[{"sentence":"The window pane was unputtied, making it vulnerable to drafts.","translation":"その窓ガラスはパテで固定されていなかったので、隙間風が入りやすかった。"},{"sentence":"An unputtied joint in the pipe caused a leak.","translation":"パイプのパテが塗られていない接合部から水漏れが発生した。"}],"collocations":["unputtied window","unputtied joint"],"synonyms":["unsealed","loose","unfixed"],"antonyms":["puttied","sealed","fixed"]}],"etymology":{"value":"The word \"unputtied\" is formed by adding the prefix \"un-\" (meaning 'not') to the word \"puttied,\" which itself is derived from the noun \"putty.\" Putty comes from the French word \"potée,\" which refers to a pot containing a mixture.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpʌtid/","syllables":"un-put-tied"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Unputtied\" is a relatively rare word, primarily used in technical or descriptive contexts where the absence of putty is significant. It often implies a lack of proper sealing or fixing, which can lead to problems such as leaks or instability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unputtied door was difficult to open.","correct":"✓ The unputtied window was drafty.","note":"\"Unputtied\" specifically refers to something that should be sealed or fixed with putty, such as glass panes in a window or joints in pipes. It doesn't apply to doors or other objects that aren't typically secured with putty."}],"priority":"★★☆"},"related_words":{"derivatives":["putty (noun): A soft, dough-like cement used to secure glass in window frames and for other sealing purposes.","puttied (adjective): Fixed or sealed with putty."],"related_terms":["caulk","sealant","grout"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - not typically found in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unputtied\" is a specialized term, primarily used in contexts related to construction, repair, or maintenance. Understanding its meaning requires familiarity with the noun \"putty\" and the function of the prefix \"un-\". Due to its limited usage, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The old greenhouse had several unputtied panes of glass.","translation":"その古い温室には、パテで固定されていないガラス板がいくつかあった。","type":"adjective","meaning_category":"Not fixed with putty"},{"sentence":"Because the pipe was unputtied, it leaked whenever the water pressure increased.","translation":"そのパイプはパテで固定されていなかったので、水圧が上がるといつも水漏れした。","type":"adjective","meaning_category":"Not sealed with putty"}]}