{"word":"semiprofaneness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"部分的な不敬、やや不敬なこと、軽度の冒涜","english_definition":"A mild or partial form of profanity; language that is somewhat offensive but not fully blasphemous or obscene.","examples":[{"sentence":"The comedian's routine contained some semiprofaneness that made a few audience members uncomfortable.","translation":"そのコメディアンのルーティンには、聴衆の何人かを不快にさせるような、やや不敬な表現が含まれていた。"},{"sentence":"The movie received a PG-13 rating due to instances of semiprofaneness.","translation":"その映画は、軽度の冒涜表現が含まれていたため、PG-13指定を受けた。"}],"collocations":["mild semiprofaneness","instances of semiprofaneness","use of semiprofaneness"],"synonyms":["mild profanity","light swearing","moderate obscenity"],"antonyms":["complete profanity","blasphemy","obscenity"]}],"etymology":{"value":"Formed by combining \"semi-\" (meaning partially or somewhat) with \"profaneness\" (meaning irreverence or blasphemy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmi.prəˈfeɪn.nəs/","syllables":"sem-i-pro-fane-ness"},"inflection":{"noun_plural":"semiprofanenesses"},"usage_notes":{"explanation":"\"Semiprofaneness\" refers to language that is considered mildly offensive or irreverent, but does not reach the level of full-blown obscenity or blasphemy. It often includes words or phrases that are considered impolite or inappropriate in formal settings, but are not as shocking or taboo as more extreme forms of swearing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semiprofaneness was completely acceptable.","correct":"✓ The mild semiprofaneness was somewhat acceptable.","note":"Semiprofaneness, by definition, is somewhat offensive. Saying it's 'completely acceptable' is contradictory. Use 'mild' to indicate a lesser degree of offensiveness, and 'somewhat acceptable' to reflect that some may still find it inappropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["semiprofane (adjective)"],"phrasal_verbs":[],"related_terms":["profane","profanity","blasphemy","obscenity","irreverence"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"semiprofaneness\" is a relatively uncommon term used to describe language that is mildly offensive or irreverent. It's not as strong as outright profanity or blasphemy, but it's still considered inappropriate in formal or polite settings. The prefix \"semi-\" indicates that it's a partial or lesser form of profanity. Understanding this word requires a good grasp of both the prefix \"semi-\" and the concept of profanity."},"example_sentences":[{"sentence":"The play's dialogue included a level of semiprofaneness that some audience members found unnecessary.","translation":"その劇の台詞には、一部の観客が不必要だと感じる程度の不敬な表現が含まれていた。","type":"general","meaning_category":"不敬"},{"sentence":"The rating board cited semiprofaneness as one reason for the movie's PG-13 classification.","translation":"レイティング委員会は、その映画がPG-13に分類された理由の一つとして、やや不敬な表現を挙げた。","type":"general","meaning_category":"不敬"}]}