{"word":"Sawny","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的) スコットランド人を指す侮蔑的な言葉、特に間抜けまたは愚か者として描かれる場合","english_definition":"(historical) A derogatory term for a Scottish person, especially when portrayed as a simpleton or fool.","examples":[{"sentence":"In old English plays, Sawny was a stock character representing a foolish Scotsman.","translation":"昔のイギリスの劇では、Sawnyは愚かなスコットランド人を表すお決まりのキャラクターでした。"},{"sentence":"The caricature of Sawny perpetuated negative stereotypes about Scottish people.","translation":"Sawnyの戯画は、スコットランド人に関する否定的な固定観念を永続させました。"}],"collocations":["stock character Sawny","caricature of Sawny","stereotype of Sawny"],"synonyms":["Jock (スコットランド人を指す非公式な言葉、ただし必ずしも侮蔑的ではない)","Scot (スコットランド人)"],"antonyms":[]}],"etymology":{"value":"「Alexander」のスコットランド語の愛称である「Sandy」に由来する。18世紀にイギリスの舞台でスコットランド人を風刺的に描く際に使われた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɔːni/","syllables":"Saw-ny"},"inflection":{"noun_plural":"Sawnies"},"usage_notes":{"explanation":"「Sawny」は、歴史的にスコットランド人を指す侮蔑的な言葉であり、特に舞台や文学で間抜けなキャラクターとして描かれる場合に用いられました。現代ではほとんど使われず、使用は非常に不快感を与える可能性があります。この言葉は、スコットランド人に対する否定的な固定観念を永続させる役割を果たしました。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Sawny because he lives in Scotland.","correct":"✓ He is Scottish.","note":"「Sawny」は侮蔑的な言葉なので、単にスコットランド人を指す場合は「Scottish」を使うべきです。"},{"incorrect":"✗ Sawny is a respectful term for Scottish people.","correct":"✓ Sawny is a derogatory term for Scottish people.","note":"「Sawny」は敬意を払う言葉ではなく、侮蔑的な言葉です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"idioms_phrases":[]},"level_frequency":{"CEFR":"N/A (非常にまれな言葉)","frequency_google_ngram":"非常に低い頻度 (Very low frequency) - 現代ではほとんど使われない歴史的な言葉。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Sawny**」は、現代英語ではほとんど使われない歴史的な言葉であり、スコットランド人を指す侮蔑的な意味合いを持ちます。この言葉は、過去のイギリスの舞台でスコットランド人を風刺的に描く際に用いられ、否定的な固定観念を永続させる役割を果たしました。現代では、この言葉の使用は非常に不快感を与える可能性があり、避けるべきです。歴史的な文脈を理解することは重要ですが、現代のコミュニケーションで使用することは適切ではありません。"},"example_sentences":[{"sentence":"The old play featured a character named Sawny, a stereotypical Scotsman.","translation":"その古い劇には、ステレオタイプなスコットランド人であるSawnyというキャラクターが登場しました。","type":"noun","meaning_category":"侮蔑的な言葉"},{"sentence":"The term Sawny is now considered offensive and should not be used.","translation":"Sawnyという言葉は現在では侮辱的であると考えられており、使用すべきではありません。","type":"noun","meaning_category":"侮蔑的な言葉"}]}