{"word":"misframes","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(他動詞)誤って枠にはめる、誤って表現する、誤解させるような枠組みで伝える","english_definition":"To frame or present something inaccurately or misleadingly; to represent something in a way that gives a false or distorted impression.","examples":[{"sentence":"The article misframes the issue, focusing on minor details while ignoring the main problem.","translation":"その記事は問題を誤って枠にはめており、主要な問題点を無視して些細な詳細に焦点を当てている。"},{"sentence":"The politician accused the media of misframing his words to make him look bad.","translation":"その政治家は、自分を悪く見せるためにメディアが自分の言葉を誤って表現していると非難した。"},{"sentence":"The debate was misframed from the start, focusing on personalities rather than policies.","translation":"その討論は最初から誤った枠組みで進められ、政策よりも人物に焦点が当てられた。"}],"collocations":["misframes the issue","misframes the debate","misframes the argument","misframes the problem","misframes the narrative"],"synonyms":["misrepresents","distorts","falsifies","twists","misinterprets","perverts"],"antonyms":["presents accurately","frames correctly","represents fairly"]}],"etymology":{"value":"\"Mis-\" (wrongly) + \"frame\" (to construct, create a structure)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsˈfreɪmz/","syllables":"mis-frames"},"inflection":{"verb_forms":{"present_simple":["misframes"],"past_simple":"misframed","past_participle":"misframed","present_participle":"misframing"}},"usage_notes":{"explanation":"'Misframes' is used to describe the act of presenting information or an issue in a way that is inaccurate, misleading, or distorts the truth. It often implies a deliberate attempt to manipulate perception or understanding. The term is commonly used in discussions of media, politics, and social issues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was misframed.","correct":"✓ The issue was misframed.","note":"'Misframed' is typically used for abstract concepts like issues, arguments, or debates, not physical objects like paintings. In the case of a painting, you would say it was framed incorrectly or poorly."},{"incorrect":"✗ He misframes always the situation.","correct":"✓ He always misframes the situation.","note":"Adverbs of frequency (like 'always') usually go before the main verb (like 'misframes')."}],"priority":"★★☆"},"related_words":{"derivatives":["misframe (verb - base form)","misframing (noun - the act of misframing)","framing (noun - the way something is presented)","reframing (verb - presenting something in a new way)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Misframes' is a relatively advanced term used to describe the act of presenting information in a distorted or misleading way. It is often used in academic or professional contexts when discussing media bias, political rhetoric, or the construction of narratives. The term suggests a deliberate manipulation of perception rather than a simple error. Understanding this word requires a good grasp of abstract concepts and critical thinking skills."},"example_sentences":[{"sentence":"The documentary misframes the historical events to support a particular political agenda.","translation":"そのドキュメンタリーは、特定の政治的議題を支持するために歴史的出来事を誤って表現している。","type":"verb","meaning_category":"misrepresentation"},{"sentence":"The journalist was criticized for misframing the interview, taking the politician's words out of context.","translation":"そのジャーナリストは、インタビューを誤って表現し、政治家の言葉を文脈から切り離して伝えたとして批判された。","type":"verb","meaning_category":"distortion"},{"sentence":"The company's marketing campaign misframes the product as environmentally friendly, despite its negative impact on the environment.","translation":"その企業のマーケティングキャンペーンは、環境への悪影響があるにもかかわらず、製品を環境に優しいものとして誤って表現している。","type":"verb","meaning_category":"false impression"}]}