{"word":"antisurplician","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Opposed to the wearing of surplices, especially in religious services.","english_definition":"Opposed to the wearing of surplices, especially in religious services.","examples":[{"sentence":"The antisurplician faction within the church argued for simpler vestments.","translation":"教会内の反サリープリス派閥は、より簡素な聖職者の衣装を主張した。"}],"synonyms":["anti-vestment","non-surplician"],"antonyms":["pro-surplice","surplician"]},{"part_of_speech":"noun","definition":"A person opposed to the wearing of surplices, especially in religious services.","english_definition":"A person opposed to the wearing of surplices, especially in religious services.","examples":[{"sentence":"He was known as an antisurplician and refused to wear the surplice during services.","translation":"彼は反サリープリス主義者として知られており、礼拝中にサリープリスを着用することを拒否した。"}],"synonyms":["anti-vestmentarian","non-surplician"],"antonyms":["pro-surplice advocate","surplician"]}],"etymology":{"value":"'Anti-' + 'surplice' + '-ian'. 'Surplice' refers to a loose-fitting white linen robe worn by clergy and others in religious ceremonies. The suffix '-ian' is used to form adjectives and nouns indicating association or belief.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiːsɜːrˈplɪʃən/","syllables":"an-ti-sur-pli-cian"},"inflection":{"noun_plural":"antisurplicians"},"usage_notes":{"explanation":"The term 'antisurplician' is primarily historical, referring to a position taken during debates within certain Christian denominations (particularly the Church of England) regarding liturgical practices and vestments. It is rarely used in contemporary contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["surplice","surplician"],"related_terms":["vestment","liturgy","ritualism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency. The term is highly specialized and rarely used outside historical or theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'antisurplician' is a highly specialized term related to historical religious debates, specifically concerning the use of surplices (a type of vestment) in church services. Understanding this word requires familiarity with ecclesiastical history and liturgical practices. It is unlikely to be encountered in general usage."},"example_sentences":[{"sentence":"The historical records detail the arguments between the surplician and **antisurplician** factions within the church.","translation":"歴史的記録は、教会内のサリープリス主義者と反サリープリス主義者の派閥間の議論を詳述している。","type":"adjective","meaning_category":"Opposed to surplices"},{"sentence":"As an **antisurplician**, he believed that elaborate vestments distracted from the true message of the Gospel.","translation":"反サリープリス主義者として、彼は手の込んだ聖職者の衣装が福音の真のメッセージから気をそらすと信じていた。","type":"noun","meaning_category":"Person opposed to surplices"}]}