{"word":"noctimania","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"夜間徘徊症、夜間せん妄","english_definition":"A condition characterized by a compulsion to be awake at night, often associated with sleepwalking or night terrors.","examples":[{"sentence":"The doctor diagnosed him with noctimania after observing his erratic behavior during the night.","translation":"医師は、彼の夜間の異常な行動を観察した後、彼を夜間徘徊症と診断した。"},{"sentence":"Noctimania can be a symptom of underlying psychological issues.","translation":"夜間徘徊症は、根底にある心理的な問題の症状である可能性がある。"}],"collocations":["suffer from noctimania","diagnose noctimania","treat noctimania","noctimania symptoms","severe noctimania","childhood noctimania"],"synonyms":["sleepwalking","somnambulism","night terrors","nocturnal delirium"],"antonyms":["insomnia","hypersomnia","daytime somnolence"]}],"etymology":{"value":"Derived from the Latin 'noctis' (of the night) and Greek 'mania' (madness, frenzy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒktɪˈmeɪniə/","syllables":"noc-ti-ma-ni-a"},"inflection":{"noun_plural":"noctimanias"},"usage_notes":{"explanation":"'Noctimania' is a relatively rare term, primarily used in medical or psychological contexts to describe a condition where an individual feels compelled to be awake and active during the night. It is often linked to other sleep disorders or underlying psychological issues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has noctimania, so he can't sleep at all.","correct":"✓ He has insomnia, so he can't sleep at all.","note":"Noctimania is not the same as insomnia. Insomnia is the inability to sleep, while noctimania is a compulsion to be awake at night, often with associated activities like sleepwalking."},{"incorrect":"✗ Noctimania is cured by sleeping pills.","correct":"✓ Noctimania is treated with therapy and addressing underlying conditions.","note":"Noctimania is typically addressed through therapy and by treating any underlying psychological or medical conditions, rather than solely relying on sleeping pills."}],"priority":"★★☆"},"related_words":{"derivatives":["nocturnal (adjective: active at night)","mania (noun: mental illness marked by periods of great excitement or euphoria, delusion, and overactivity)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Noctimania' is a specialized term primarily used in medical and psychological contexts. Understanding its meaning requires familiarity with medical terminology and an understanding of sleep disorders. The term describes a specific condition characterized by a compulsion to be awake at night, often linked to other underlying issues. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The patient's noctimania was characterized by frequent episodes of sleepwalking and confusion.","translation":"その患者の夜間徘徊症は、頻繁な夢遊病と混乱のエピソードによって特徴づけられた。","type":"noun","meaning_category":"medical condition"},{"sentence":"Therapy aims to address the underlying causes of her noctimania.","translation":"セラピーは、彼女の夜間徘徊症の根本的な原因に対処することを目的としている。","type":"noun","meaning_category":"medical condition"}]}