{"word":"Productionist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who believes that economic production is the key to societal progress and well-being.","english_definition":"Someone who advocates for or prioritizes increased production, often with the belief that it will solve economic or social problems.","examples":[{"sentence":"As a productionist, he argued that increasing manufacturing output would create more jobs and wealth.","translation":"生産至上主義者として、彼は製造業の生産量を増やすことが、より多くの雇用と富を生み出すと主張した。"},{"sentence":"The productionist approach to agriculture focuses on maximizing yields, sometimes at the expense of environmental sustainability.","translation":"農業における生産至上主義的なアプローチは、環境の持続可能性を犠牲にしてでも、収穫量を最大化することに焦点を当てている。"}],"collocations":["productionist policies","productionist ideology","productionist approach","productionist mindset"],"synonyms":["productivist","growth advocate","economic expansionist"],"antonyms":["conservationist","environmentalist","degrowth advocate"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of productionism.","english_definition":"Supporting or reflecting the belief that increased production is inherently beneficial.","examples":[{"sentence":"The government's productionist policies led to a surge in industrial output.","translation":"政府の生産至上主義的な政策は、工業生産の急増をもたらした。"},{"sentence":"Critics argued that the company's productionist attitude ignored the social and environmental costs of its operations.","translation":"批評家たちは、その会社の生産至上主義的な姿勢が、事業活動の社会的・環境的コストを無視していると主張した。"}],"collocations":["productionist economy","productionist society","productionist values"],"synonyms":["productivistic"],"antonyms":["sustainable","ecological"]}],"etymology":{"value":"Derived from \"production\" + \"-ist\" (a suffix indicating a believer in or advocate of something).","priority":"★★★"},"pronunciation":{"ipa":"/prəˈdʌkʃənɪst/","syllables":"pro-duc-tion-ist"},"inflection":{"noun_plural":"productionists"},"usage_notes":{"explanation":"The term \"productionist\" is often used critically to describe someone who prioritizes economic output above other considerations, such as environmental protection or social equity. It can also be used neutrally to describe someone who believes that increased production is a necessary condition for economic growth and development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a productionist of art.","correct":"✓ He is a producer of art.","note":"\"Productionist\" refers to someone who believes in the importance of economic production, not someone who produces art or other goods. Use \"producer\" in that context."}],"priority":"★☆☆"},"related_words":{"derivatives":["production","product","productivity","productivism"],"related_concepts":["economic growth","industrialization","capitalism","consumerism","sustainable development","environmentalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"productionist\" refers to someone who believes that increasing economic production is the most important thing for society. This word is often used in discussions about economics, environmentalism, and social policy. It's important to understand that the word can have a negative connotation, suggesting that the person prioritizes production over other important values.","priority":"★★☆"},"example_sentences":[{"sentence":"The candidate's productionist platform promised to create jobs by boosting manufacturing.","translation":"その候補者の生産至上主義的な政策綱領は、製造業を活性化することで雇用を創出すると約束した。","type":"noun","meaning_category":"Believer in economic production"},{"sentence":"The company's productionist approach to farming led to high yields but also depleted the soil.","translation":"その会社の農業における生産至上主義的なアプローチは、高い収穫量をもたらしたが、土壌を消耗させた。","type":"adjective","meaning_category":"Relating to productionism"}]}