{"word":"Liveryman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国)ロンドンのリヴァリー会社（職業組合）の正会員","english_definition":"A full member of a Livery Company of the City of London.","examples":[{"sentence":"He became a Liveryman of the Worshipful Company of Goldsmiths.","translation":"彼は金細工職人組合のリヴァリーマンになった。"},{"sentence":"Only Liverymen can vote in the election of the Lord Mayor of London.","translation":"ロンドン市長の選挙で投票できるのはリヴァリーマンだけだ。"}],"collocations":["become a Liveryman","Worshipful Company of [trade]"],"synonyms":["member of a guild","freeman of a company"],"antonyms":["apprentice","journeyman"]}],"etymology":{"value":"From 'livery' (the distinctive clothing worn by members of a guild) + 'man'. The term reflects the historical importance of the livery in identifying members of the trade guilds.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlɪvəriˌmæn","syllables":"Liv-er-y-man"},"inflection":{"noun_plural":"Liverymen"},"usage_notes":{"explanation":"A Liveryman is a member of one of the City of London's ancient trade guilds, known as Livery Companies. These companies historically regulated trades and crafts in London, and today they primarily focus on charitable activities, education, and preserving traditions. Becoming a Liveryman is a significant honor and often involves a formal ceremony. Only Liverymen have the right to vote in the election of the Lord Mayor of London.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a livery man.","correct":"✓ He is a Liveryman.","note":"The correct spelling is 'Liveryman' (capitalized) to denote a member of a Livery Company."}],"priority":"★☆☆"},"related_words":{"derivatives":["livery","livery company","guild","alderman"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Liveryman' is specific to the context of the City of London and its Livery Companies. Understanding requires knowledge of British history and civic governance. It's not a commonly used word outside of this specific context.","priority":"★☆☆"},"example_sentences":[{"sentence":"As a Liveryman, he was invited to the annual banquet.","translation":"リヴァリーマンとして、彼は年次晩餐会に招待された。","type":"noun","meaning_category":"Member of a Livery Company"},{"sentence":"The new Liveryman swore an oath to uphold the traditions of the Company.","translation":"新しいリヴァリーマンは、組合の伝統を守ることを誓った。","type":"noun","meaning_category":"Member of a Livery Company"}]}