{"word":"antijuridicidad","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Law) Illegality, unlawfulness, contrariness to law. In criminal law, it refers to the quality of an action that is contrary to the law and not justified by any legal defense.","english_definition":"(Law) The quality of being contrary to law; unlawfulness. In criminal law, it refers to an action that is contrary to the law and not justified by any legal defense.","examples":[{"sentence":"La antijuridicidad es un elemento esencial del delito.","translation":"Illegality is an essential element of a crime."},{"sentence":"Para que una conducta sea considerada delito, debe existir tipicidad y antijuridicidad.","translation":"For conduct to be considered a crime, there must be both typicality and illegality."}],"collocations":["elemento de antijuridicidad (element of illegality)","juicio de antijuridicidad (judgment of illegality)","exclusión de antijuridicidad (exclusion of illegality)"],"synonyms":["ilegalidad","ilicitud","contrariedad a derecho"],"antonyms":["juridicidad","legalidad","licitud"]}],"etymology":{"value":"From the prefix 'anti-' (against) + 'jurídico' (juridical, legal) + '-idad' (suffix denoting quality or condition).","priority":"N/A"},"pronunciation":{"ipa":"/an.ti.xu.ɾi.ði.θiˈðað/","syllables":"an-ti-ju-ri-di-ci-dad"},"inflection":{"noun_plural":"antijuridicidades"},"usage_notes":{"explanation":"'Antijuridicidad' is a legal term primarily used in criminal law to describe the quality of an action that is both defined as a crime (typicality) and not justified by any legal defense (such as self-defense or necessity). It is a key element in determining whether a crime has been committed.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"La acción es típica pero no tiene antijuridicidad.","correct":"La acción es típica pero no es antijurídica.","note":"While 'antijuridicidad' refers to the quality of being illegal, 'antijurídico/a' is the adjective form."}],"priority":"N/A"},"related_words":{"derivatives":["antijurídico (adjective: illegal, unlawful)"],"phrases":["causas de justificación (justifying causes, legal defenses)","legítima defensa (self-defense)","estado de necesidad (state of necessity)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in legal contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Antijuridicidad' is a technical legal term used in Spanish-speaking legal systems. It refers to the quality of an action that is contrary to law and lacks any legal justification. Understanding this term requires a solid background in legal theory, particularly criminal law. It is not a term commonly used outside of legal contexts."},"example_sentences":[{"sentence":"La **antijuridicidad** de la conducta se determina tras verificar la tipicidad.","translation":"The illegality of the conduct is determined after verifying the typicality.","type":"noun","meaning_category":"Illegality (Law)"},{"sentence":"La legítima defensa excluye la **antijuridicidad** del acto.","translation":"Self-defense excludes the illegality of the act.","type":"noun","meaning_category":"Illegality (Law)"}]}