{"word":"whigmaleerie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Scottish) A whimsical ornament or trinket; a fanciful notion or idea; a fantastic or grotesque object.","english_definition":"A whimsical ornament or trinket; a fanciful notion or idea; a fantastic or grotesque object.","examples":[{"sentence":"The shop was filled with whigmaleeries of all shapes and sizes.","translation":"その店はあらゆる形や大きさの奇抜な装飾品でいっぱいだった。"},{"sentence":"He had a whigmaleerie of an idea about building a house out of recycled materials.","translation":"彼はリサイクル素材で家を建てるという奇抜なアイデアを持っていた。"}],"collocations":["collection of whigmaleeries","odd whigmaleerie","strange whigmaleerie"],"synonyms":["trinket","bauble","curiosity","whimsy","fancy","notion","crotchet"],"antonyms":[]}],"etymology":{"value":"Originates from Scots. The etymology is uncertain, but it is thought to be a combination of 'whim' (a sudden desire or change of mind) and a fanciful extension.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhwɪɡməˈlɪəri/","syllables":"whig-ma-lee-rie"},"inflection":{"noun_plural":"whigmaleeries"},"usage_notes":{"explanation":"'Whigmaleerie' is a word primarily used in Scotland and is relatively rare. It refers to something that is whimsical, odd, or fanciful, often an ornament or idea. The word carries a sense of playful eccentricity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She decorated her house with simple and elegant whigmaleeries.","correct":"✓ She decorated her house with elaborate and whimsical whigmaleeries.","note":"'Whigmaleeries' implies something fanciful or odd, not simple or elegant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["whimsy","whimsical","fancy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Whigmaleerie' is a rare and specialized word, primarily used in Scotland. It describes something that is fanciful, odd, or whimsical, often an ornament or an idea. Due to its rarity and specific cultural context, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The attic was filled with old furniture and dusty whigmaleeries.","translation":"屋根裏部屋は古い家具と埃っぽい奇妙な装飾品でいっぱいだった。","type":"noun","meaning_category":"whimsical ornament"},{"sentence":"His latest invention was a complicated whigmaleerie that served no practical purpose.","translation":"彼の最新の発明は、実用的な目的を果たさない複雑な奇抜なものだった。","type":"noun","meaning_category":"fanciful object"}]}