{"word":"astrotheology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"星辰神学、占星神学：天文学的な知識と宗教的な信念を組み合わせた学問、または体系。星や星座が神話や宗教的教義にどのように関連付けられているかを研究する。","english_definition":"A field of study or system that combines astronomical knowledge with religious beliefs; the study of how stars and constellations are associated with mythology and religious doctrines.","examples":[{"sentence":"Astrotheology seeks to understand the religious significance of celestial events.","translation":"星辰神学は、天体の出来事の宗教的な意義を理解しようとします。"},{"sentence":"Some ancient cultures based their religious practices on astrotheology.","translation":"古代文化の中には、星辰神学に基づいて宗教的慣習を築いたものもあります。"}],"collocations":["ancient astrotheology","comparative astrotheology","developments in astrotheology"],"synonyms":["astromythology","religious astronomy"],"antonyms":[]}],"etymology":{"value":"'astro-' (星) + 'theology' (神学) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæstroʊθiˈɒlədʒi/","syllables":"as-tro-the-ol-o-gy"},"inflection":{"noun_plural":"astrotheologies"},"usage_notes":{"explanation":"Astrotheology is often associated with the study of ancient religions and mythologies, where celestial bodies played a significant role in religious beliefs and practices. It explores the connections between astronomical phenomena and religious narratives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrotheology is the same as astrology.","correct":"✓ Astrotheology is a study of the relationship between astronomy and religion, while astrology is a belief system that claims to predict events based on the positions of celestial bodies.","note":"Astrotheology is a scholarly study, whereas astrology is a pseudoscience."}],"priority":"★★☆"},"related_words":{"derivatives":["astrotheological (adjective)"],"related_terms":["astronomy","theology","mythology","astrology"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Astrotheology' is a specialized term, generally used in academic or scholarly contexts when discussing the intersection of astronomy and religious beliefs, particularly in ancient cultures or mythologies. It requires a solid understanding of both astronomy and theology to fully grasp its meaning."},"example_sentences":[{"sentence":"The professor lectured on the astrotheology of ancient Egypt.","translation":"教授は古代エジプトの星辰神学について講義しました。","type":"general","meaning_category":"study of astronomical knowledge and religious beliefs"},{"sentence":"The book explores the astrotheology evident in various indigenous cultures.","translation":"その本は、さまざまな先住民族文化に見られる星辰神学を探求しています。","type":"general","meaning_category":"study of astronomical knowledge and religious beliefs"}]}