{"word":"weighting","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"重み付け、加重","english_definition":"The process of assigning different weights to different elements or factors in a calculation or analysis to reflect their relative importance.","examples":[{"sentence":"The weighting of exam results was changed to give more importance to the final exam.","translation":"試験結果の重み付けが変更され、期末試験がより重要視されるようになった。"},{"sentence":"Different weighting factors were applied to each criterion in the decision-making process.","translation":"意思決定プロセスにおいて、各基準に異なる重み付け係数が適用された。"},{"sentence":"Statistical weighting is used to correct for biases in survey data.","translation":"統計的重み付けは、調査データの偏りを修正するために使用される。"}],"collocations":["apply weighting","assign weighting","statistical weighting","weighting factor","weighting scheme","weighting method"],"synonyms":["emphasis","importance","priority","bias","adjustment"],"antonyms":["equal weighting","uniform weighting"]},{"part_of_speech":"noun","definition":"(建築)荷重、重量","english_definition":"The load or weight applied to a structure or component.","examples":[{"sentence":"The weighting of the roof must be carefully calculated to ensure the building's stability.","translation":"建物の安定性を確保するために、屋根の荷重を慎重に計算する必要がある。"},{"sentence":"The bridge was designed to withstand heavy weighting from traffic.","translation":"その橋は、交通からの大きな荷重に耐えられるように設計された。"}],"collocations":["roof weighting","floor weighting","structural weighting","heavy weighting","light weighting"],"synonyms":["load","burden","pressure","stress"],"antonyms":["support","reinforcement"]}],"etymology":{"value":"The word \"weighting\" is derived from the verb \"to weight,\" which comes from the Old English word \"wæġan,\" meaning \"to weigh.\" The suffix \"-ing\" turns it into a noun referring to the act or process of assigning weights.","priority":"★★☆"},"pronunciation":{"ipa":"ˈweɪtɪŋ","syllables":"weigh-ting"},"inflection":{"noun_plural":"weightings"},"usage_notes":{"explanation":"The term \"weighting\" is used in various contexts, including statistics, finance, engineering, and decision-making. It refers to the process of giving different levels of importance to different factors or elements. In statistics, weighting is used to correct for biases in data. In finance, it can refer to the proportion of different assets in a portfolio. In engineering, it can refer to the load or stress on a structure. The specific meaning depends on the context in which it is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The weighting are different.","correct":"✓ The weightings are different.","note":"When referring to multiple instances of assigned weights, use the plural form \"weightings.\""},{"incorrect":"✗ We need to weighting the factors.","correct":"✓ We need to weight the factors.","note":"\"Weighting\" is a noun; the verb form is \"to weight.\""}],"priority":"★★☆"},"related_words":{"derivatives":["weight (noun, verb)","weighted (adjective)","weightless (adjective)","weighty (adjective)"],"related_concepts":["regression analysis","portfolio optimization","structural engineering","decision theory"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in specific contexts (e.g., statistics, finance).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"weighting\" is used to describe the process of giving different levels of importance to different things. Imagine you're baking a cake. You might give more \"weighting\" to the amount of flour than to the amount of salt because flour is more important for the cake's structure. In statistics, \"weighting\" is used to make sure that some data points count more than others, especially when some groups are underrepresented. It's a way to balance things out and get a more accurate result. In engineering, \"weighting\" can refer to the actual load or pressure on a structure. It's a technical term, so you'll usually find it in more advanced discussions or specialized fields."},"example_sentences":[{"sentence":"The company uses a complex weighting system to evaluate employee performance.","translation":"その会社は、従業員の業績を評価するために複雑な重み付けシステムを使用している。","type":"noun","meaning_category":"重み付け"},{"sentence":"The weighting of the concrete structure was carefully calculated to ensure its stability.","translation":"コンクリート構造の荷重は、その安定性を確保するために慎重に計算された。","type":"noun","meaning_category":"荷重"},{"sentence":"The survey data was adjusted using statistical weighting to reflect the demographics of the population.","translation":"調査データは、人口統計を反映するために統計的重み付けを使用して調整された。","type":"noun","meaning_category":"重み付け"},{"sentence":"The weighting factor for customer satisfaction is higher than that for cost reduction in this project.","translation":"このプロジェクトでは、顧客満足度の重み付け係数はコスト削減のそれよりも高い。","type":"noun","meaning_category":"重み付け"}]}