{"word":"time-rusty","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(比喩的に)時を経て古びた、時代遅れの、忘れ去られた","english_definition":"(figuratively) having become antiquated, outdated, or forgotten due to the passage of time.","examples":[{"sentence":"The old traditions had become time-rusty and were rarely practiced.","translation":"古い伝統は時を経て古びてしまい、ほとんど行われなくなった。"},{"sentence":"His knowledge of that subject was time-rusty, and he needed to refresh it.","translation":"彼のその主題に関する知識は時代遅れになっていたので、復習する必要があった。"},{"sentence":"The once-popular song sounded time-rusty on the modern radio.","translation":"かつて人気だったその歌は、現代のラジオでは時代遅れに聞こえた。"}],"collocations":["time-rusty knowledge (時代遅れの知識)","time-rusty skills (時代遅れのスキル)","time-rusty traditions (古びた伝統)","time-rusty memories (忘れ去られた記憶)","time-rusty technology (時代遅れの技術)"],"synonyms":["antiquated","outdated","obsolete","archaic","old-fashioned","forgotten","stale","decrepit"],"antonyms":["modern","current","up-to-date","contemporary","relevant","fresh","new"],"notes":["This word is often used metaphorically to describe things that have lost their relevance or usefulness over time, similar to how metal rusts and deteriorates."]}],"etymology":{"value":"A compound word formed by combining 'time' and 'rusty'. 'Time' refers to the passage of time, and 'rusty' describes something covered in rust, indicating deterioration and disuse.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaɪmˌrʌsti/","syllables":"time-rus-ty"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Time-rusty' is a descriptive adjective used to indicate that something has become outdated, deteriorated, or forgotten due to the effects of time. It often carries a negative connotation, suggesting that the thing in question is no longer useful or relevant. It is more commonly used in literary or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The time-rusty car was still running well.","correct":"✓ The old car was still running well.","note":"'Time-rusty' implies more than just age; it suggests obsolescence or irrelevance. If you simply mean the car is old, use 'old' instead."},{"incorrect":"✗ He felt time-rusty after his vacation.","correct":"✓ He felt out of practice after his vacation.","note":"'Time-rusty' is used for things, not people's feelings. Use 'out of practice' or 'unprepared' to describe a person's state after a break."}],"priority":"★★☆"},"related_words":{"derivatives":["rust (noun, verb)","rusty (adjective)"],"related_terms":["time-worn","age-old","out of date","past it","antiquated","obsolete"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists, more literary)","frequency_google_ngram":"Low frequency (relatively uncommon)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Time-rusty' is a more advanced and descriptive adjective that combines the concepts of time and rust to convey that something has become outdated, deteriorated, or forgotten due to the effects of time. It is not a common word in everyday conversation but is more often found in literary or descriptive writing. Understanding the meaning requires familiarity with the individual words 'time' and 'rusty' and the ability to interpret the metaphorical combination of these concepts."},"example_sentences":[{"sentence":"The library contained time-rusty books, their pages yellowed and brittle.","translation":"その図書館には、時を経て古びた本があり、ページは黄色くてもろくなっていた。","type":"descriptive","meaning_category":"古びた本"},{"sentence":"Her time-rusty knowledge of Latin made it difficult to translate the ancient text.","translation":"彼女の時代遅れのラテン語の知識では、古代のテキストを翻訳するのは難しかった。","type":"descriptive","meaning_category":"時代遅れの知識"},{"sentence":"The time-rusty machinery in the factory was replaced with modern equipment.","translation":"工場の時代遅れの機械は、最新の設備に交換された。","type":"descriptive","meaning_category":"時代遅れの機械"}]}