{"word":"drifty","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"漂流しやすい、漂流性の","english_definition":"Tending to drift; easily moved by wind or water; characterized by drifting.","examples":[{"sentence":"The snow was light and drifty, making driving difficult.","translation":"雪は軽くて吹きだまりやすく、運転を困難にした。"},{"sentence":"The boat felt drifty in the strong current.","translation":"ボートは強い流れの中で漂流しやすく感じた。"},{"sentence":"He has a drifty personality, never staying in one place for long.","translation":"彼は漂流しやすい性格で、一つの場所に長く留まることがない。"}],"collocations":["drifty snow (吹きだまりやすい雪)","drifty clouds (漂う雲)","drifty sand (漂う砂)","drifty boat (漂流しやすいボート)","drifty ice (漂流する氷)"],"synonyms":["floating","wandering","unstable","shifting","erratic","roaming"],"antonyms":["stable","fixed","anchored","settled"]},{"part_of_speech":"adjective","definition":"（人・考えなどが）定まらない、変わりやすい","english_definition":"Lacking a clear direction or purpose; unsettled.","examples":[{"sentence":"His ideas were drifty and lacked focus.","translation":"彼の考えは定まらず、焦点が欠けていた。"},{"sentence":"She felt drifty after graduating, unsure of what to do next.","translation":"彼女は卒業後、次に何をすべきか分からず、不安定な気持ちだった。"}],"collocations":["drifty ideas (定まらない考え)","drifty plans (定まらない計画)","drifty feeling (不安定な気持ち)","drifty thoughts (まとまらない考え)"],"synonyms":["unfocused","aimless","directionless","unsettled","vague","indecisive"],"antonyms":["focused","determined","decisive","purposeful"]}],"etymology":{"value":"\"Drifty\" is derived from the verb \"drift,\" which comes from Old English \"drīfan\" meaning \"to drive, push, or float.\" The suffix \"-y\" is added to form an adjective indicating a tendency or quality of drifting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɪfti/","syllables":"drift-y"},"inflection":{"notes":"Comparative and superlative forms (more drifty, most drifty) exist but are less common."},"usage_notes":{"explanation":"\"Drifty\" describes something that tends to drift, either physically (like snow or a boat) or metaphorically (like ideas or plans). It suggests a lack of stability, direction, or purpose. The word can also describe a person who moves from place to place without settling down.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drifty car crashed into the wall.","correct":"✓ The drifting car crashed into the wall.","note":"\"Drifting\" (present participle of \"drift\") is more commonly used to describe a car intentionally sliding sideways. \"Drifty\" is less appropriate in this context."},{"incorrect":"✗ He was drifty because he was sleepy.","correct":"✓ He was drowsy because he was sleepy.","note":"\"Drowsy\" is a better word to describe being sleepy or half-asleep. \"Drifty\" implies a lack of focus or direction, not necessarily sleepiness."}],"priority":"★★☆"},"related_words":{"derivatives":["drift (verb, noun)","drifter (noun)","adrift (adjective, adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Drifty\" is a descriptive adjective that suggests a tendency to drift or a lack of stability. It can be used to describe physical objects that are easily moved by wind or water, such as \"drifty snow\" or \"drifty clouds.\" It can also be used metaphorically to describe ideas, plans, or people that lack a clear direction or purpose. The word implies a sense of being unfocused or unsettled.","example_sentences":[{"sentence":"The **drifty** fog made it hard to see the road.","translation":"漂う霧で道が見えにくかった。","type":"adjective","meaning_category":"Physical"},{"sentence":"His **drifty** thoughts made it hard to concentrate on the task.","translation":"彼のまとまらない考えのせいで、仕事に集中するのが難しかった。","type":"adjective","meaning_category":"Metaphorical"},{"sentence":"She had a **drifty** feeling that she was not where she was supposed to be.","translation":"彼女は自分がいるべき場所にいないような、不安定な気持ちだった。","type":"adjective","meaning_category":"Emotional"}]}}