{"word":"Tatpurusha","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Sanskrit grammar) A type of compound word where the first member is subordinate to the second, functioning as an adjective or adverb. Often translated as 'dependent determinative compound'.","english_definition":"(Sanskrit grammar) A type of compound word in which the first member is syntactically subordinate to the second, functioning adjectivally or adverbially. Often translated as 'dependent determinative compound'.","examples":[{"sentence":"'Rajaputra' (king's son) is a Tatpurusha compound.","translation":"「Rajaputra」（王の息子）はタットプルシャ複合語です。"}],"collocations":["karma tatpurusha","shashthi tatpurusha"],"synonyms":["dependent determinative compound"],"antonyms":[]}],"etymology":{"value":"From Sanskrit तत्पुरुष (tatpuruṣa), literally \"that man,\" from तत् (tat, \"that\") + पुरुष (puruṣa, \"man\"). The name is traditionally explained as \"belonging to that man,\" referring to the relationship between the two parts of the compound.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtʌtpʊˈruːʃə/","syllables":"tat-pu-ru-sha"},"inflection":{},"usage_notes":{"explanation":"Tatpurusha compounds are a significant category in Sanskrit grammar, and understanding them is crucial for interpreting Sanskrit texts. They are characterized by the first member being in a case relation to the second member. The case ending of the first member is usually dropped in the compound.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Tatpurusha' is a technical term from Sanskrit grammar. It refers to a specific type of compound word where the first part modifies the second part, similar to how adjectives or adverbs function. Understanding this term is essential for those studying Sanskrit or related languages with similar grammatical structures."},"example_sentences":[{"sentence":"In the Tatpurusha compound 'devapuja', 'deva' (god) is the object of 'puja' (worship).","translation":"タットプルシャ複合語「devapuja」では、「deva」（神）は「puja」（崇拝）の対象です。","type":"example","meaning_category":"Grammar"},{"sentence":"The Tatpurusha rule in Sanskrit grammar helps analyze complex word formations.","translation":"サンスクリット文法におけるタットプルシャの規則は、複雑な単語の形成を分析するのに役立ちます。","type":"example","meaning_category":"Grammar"}]}