{"word":"Smintheus","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"スミンテウス：アポロンの異名の一つ。特に小アジアのトロアス地方で崇拝された。鼠（スミントス）を意味するギリシア語に由来し、鼠を司る神、または鼠から人々を守る神として崇められた。","english_definition":"Smintheus: An epithet of Apollo, particularly worshiped in the Troad region of Asia Minor. It comes from a Greek word meaning 'mouse' (smintos), and he was revered as a god associated with mice, either as a protector from them or a god of mice themselves.","examples":[{"sentence":"The temple of Apollo Smintheus was located near Chryse in the Troad.","translation":"アポロ・スミンテウスの神殿は、トロアスのクリュセの近くに位置していた。"},{"sentence":"Some scholars believe that Apollo Smintheus was originally a local deity who was later assimilated into the Olympian pantheon.","translation":"一部の学者は、アポロ・スミンテウスは元々、オリンポスの神々に同化された地方の神であったと考えている。"}],"collocations":["Apollo Smintheus","temple of Smintheus","cult of Smintheus"],"synonyms":["Apollo (as a general term)"],"antonyms":[]}],"etymology":{"value":"ギリシア語の 'σμίνθος' (smínthos) に由来し、'鼠' を意味する。この異名は、アポロンが鼠と関連付けられていたことに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/smɪnˈθiːəs/","syllables":"Smin-the-us"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"'Smintheus' は、アポロン神の特定の側面、特に鼠との関連を強調する場合に用いられます。神話や古代史の研究において現れる用語です。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Sminthean (形容詞: スミンテウスの)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い (Very low) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「スミンテウス」は、ギリシア神話のアポロン神の異名であり、特に古代トロアス地方で崇拝された鼠との関連を示す専門的な用語です。この単語は、神話、古代史、または古典文学の研究においてのみ使用される可能性が高く、一般的な語彙ではありません。この単語に出会う文脈を理解するには、ギリシア神話と古代宗教に関する深い知識が必要です。"},"example_sentences":[{"sentence":"The priest made offerings to Apollo Smintheus to protect the harvest from mice.","translation":"司祭は、収穫物を鼠から守るためにアポロ・スミンテウスに捧げ物をした。","type":"example","meaning_category":"神話における役割"},{"sentence":"Archaeologists have uncovered evidence of the cult of Apollo Smintheus in western Turkey.","translation":"考古学者は、トルコ西部でアポロ・スミンテウスの崇拝の証拠を発見した。","type":"example","meaning_category":"考古学的な証拠"}]}