{"word":"chemotherapy-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"化学療法感受性の、化学療法が有効な","english_definition":"(of a tumor or cancer cell) responsive to chemotherapy; likely to be killed or inhibited by chemotherapy drugs.","examples":[{"sentence":"The patient's cancer is chemotherapy-sensitive, so there is a good chance of remission.","translation":"その患者のがんは化学療法感受性なので、寛解の可能性が高いです。"},{"sentence":"Chemotherapy-sensitive tumors tend to have a better prognosis.","translation":"化学療法感受性の腫瘍は、予後が良い傾向があります。"}],"collocations":["chemotherapy-sensitive cancer","chemotherapy-sensitive tumor","highly chemotherapy-sensitive"],"synonyms":["chemosensitive","responsive to chemotherapy"],"antonyms":["chemotherapy-resistant","chemoresistant"]}],"etymology":{"value":"Formed by combining \"chemotherapy\" (treatment of disease with chemicals) and \"sensitive\" (responsive to stimuli).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkiːmoʊˈθɛrəpi ˈsɛnsətɪv/","syllables":"kee-moh-ther-uh-pee sen-suh-tiv"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"chemotherapy-sensitive\" is used in oncology to describe cancers that are likely to respond well to chemotherapy treatment. It indicates that the cancer cells are susceptible to the cytotoxic effects of chemotherapy drugs, leading to tumor shrinkage or eradication. This is a favorable characteristic, as it suggests a higher likelihood of successful treatment and improved patient outcomes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chemotherapy-sensitive patient.","correct":"✓ The patient with chemotherapy-sensitive cancer.","note":"It is more accurate to say 'the patient with chemotherapy-sensitive cancer' rather than implying the patient themselves are chemotherapy-sensitive."}],"priority":"★★☆"},"related_words":{"derivatives":["chemosensitivity (n.)"],"related_terms":["chemotherapy","chemoresistance","cancer","tumor","oncology"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'chemotherapy-sensitive' is a specialized medical term used to describe a tumor or cancer that responds well to chemotherapy treatment. It is commonly used in oncology and related medical fields. Understanding this term requires a basic understanding of cancer treatment and medical terminology."},"example_sentences":[{"sentence":"The biopsy revealed that the tumor was highly chemotherapy-sensitive.","translation":"生検の結果、腫瘍は化学療法に対する感受性が高いことが明らかになった。","type":"general","meaning_category":"general"},{"sentence":"Patients with chemotherapy-sensitive leukemia often achieve complete remission.","translation":"化学療法感受性の白血病患者は、完全寛解を達成することが多い。","type":"medical","meaning_category":"medical"}]}