{"word":"mausoleums","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"霊廟、墓廟（通常は壮大なもの）","english_definition":"A building, especially a large and stately one, housing a tomb or tombs.","examples":[{"sentence":"The city's historic cemetery is filled with elaborate mausoleums.","translation":"その都市の歴史的な墓地は、手の込んだ霊廟でいっぱいだ。"},{"sentence":"The emperor constructed a magnificent mausoleum to honor his deceased wife.","translation":"皇帝は亡くなった妻を称えるために、壮大な霊廟を建設した。"}],"collocations":["family mausoleum","grand mausoleum","ancient mausoleum","royal mausoleum"],"synonyms":["tomb","sepulcher","crypt","burial chamber","memorial"],"antonyms":[]}],"etymology":{"value":"The word \"mausoleum\" comes from the Mausoleum at Halicarnassus, a monumental tomb built for Mausolus, a satrap in the Persian Empire, and Artemisia II of Caria, his sister and wife, in Halicarnassus (present Bodrum, Turkey). It was one of the Seven Wonders of the Ancient World.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɔːsəˈliːəmz/","syllables":"mau-so-le-ums"},"inflection":{"noun_plural":"mausoleums"},"usage_notes":{"explanation":"\"Mausoleums\" are typically grand and imposing structures, often built for wealthy or important individuals or families. The term implies a more elaborate and permanent burial place than a simple grave. While any structure housing a tomb could technically be called a mausoleum, the word is usually reserved for buildings that are architecturally significant or historically noteworthy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mausoleum was very quietly.","correct":"✓ The mausoleum was very quiet.","note":"\"Quietly\" is an adverb, while \"quiet\" is an adjective. Mausoleums are quiet places, so the adjective is needed."},{"incorrect":"✗ He visited the mausoleum of his ancestors. It was very mausoleum.","correct":"✓ He visited the mausoleum of his ancestors. It was very impressive/grand/stately.","note":"\"Mausoleum\" is a noun, not an adjective. Use an appropriate adjective to describe the mausoleum."}],"priority":"★☆☆"},"related_words":{"derivatives":["mausolean (adjective: resembling a mausoleum, monumental)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"mausoleums\" refers to large and impressive tombs, often built for important people or families. It's not a common word in everyday conversation, but you might encounter it when reading about history, architecture, or famous cemeteries. The word comes from the Mausoleum at Halicarnassus, an ancient wonder of the world.","priority":"★☆☆"},"example_sentences":[{"sentence":"Many tourists visit the Taj Mahal, a famous mausoleum in India.","translation":"多くの観光客が、インドの有名な霊廟であるタージ・マハルを訪れる。","type":"general","meaning_category":"霊廟"},{"sentence":"The family's mausoleum was located on a hill overlooking the valley.","translation":"その家族の霊廟は、谷を見下ろす丘の上に位置していた。","type":"location","meaning_category":"霊廟"},{"sentence":"The mausoleums in the cemetery reflected the diverse architectural styles of the city's past.","translation":"墓地の霊廟は、その都市の過去の多様な建築様式を反映していた。","type":"architecture","meaning_category":"霊廟"}]}