{"word":"gollywog","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(現在では侮蔑的) ゴリウォーグ：黒い髪で、顔が黒く、大きな赤い唇をした人形。児童文学に登場し、現在は人種差別的であると広く認識されている。","english_definition":"(now offensive) a doll with black hair, a black face, and large red lips, formerly popular in children's literature, now widely considered racist.","examples":[{"sentence":"The gollywog was a popular character in children's books, but is now considered offensive.","translation":"ゴリウォーグは児童書で人気のあるキャラクターでしたが、現在では侮蔑的であると考えられています。"},{"sentence":"Many people find the image of a gollywog to be deeply offensive due to its racist connotations.","translation":"多くの人々は、ゴリウォーグのイメージが人種差別的な意味合いを持つため、非常に不快に感じています。"}],"collocations":["gollywog doll","gollywog image","gollywog badge"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"フローレンス・ケイト・アプトン（Florence Kate Upton）の児童書に登場するキャラクター名に由来。アプトンの母親が作った黒い人形がモデルで、その人形はラグドール（Raggedy Annのような人形）に似ていた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒliwɒɡ/","syllables":"gol-ly-wog"},"inflection":{"noun_plural":"gollywogs"},"usage_notes":{"explanation":"「**gollywog**」は、元々は児童文学に登場する人形のキャラクター名でしたが、その外見（黒い肌、赤い唇、縮れた黒髪）が、黒人に対するステレオタイプを助長するものとして、現在では人種差別的であると広く認識されています。そのため、この単語の使用は非常にデリケートであり、避けるべきです。歴史的な文脈で言及する場合でも、注意深く扱う必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He collected gollywogs because he liked dolls.","correct":"✓ He collected dolls. The gollywog doll is now considered a racist image.","note":"単に人形が好きであることを示す場合、「dolls」を使用し、「gollywog」という単語の使用は避けるべきです。どうしても言及する必要がある場合は、差別的な意味合いを持つことを明示する必要があります。"},{"incorrect":"✗ The gollywog is a cute character.","correct":"✓ The gollywog is considered a racist caricature.","note":"「cute」のような肯定的な形容詞を「gollywog」に使うことは不適切です。人種差別的なカリカチュアとみなされていることを理解する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (歴史的文脈でのみ)","frequency_google_ngram":"非常に低い (Very low frequency) - 現代英語ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**gollywog**」は、かつて児童文学に登場した人形の名前ですが、現在では人種差別的な意味合いを持つため、使用は強く避けられるべき単語です。この単語を使うことは、不快感や怒りを引き起こす可能性があります。歴史的な文脈で言及する場合でも、その人種差別的な背景を理解し、慎重に扱う必要があります。この単語の使用は、無知または人種差別的であると解釈される可能性があります。"},"example_sentences":[{"sentence":"The image of the **gollywog** is now widely recognized as a racist caricature.","translation":"ゴリウォーグのイメージは現在、人種差別的なカリカチュアとして広く認識されています。","type":"noun","meaning_category":"人種差別的な人形"},{"sentence":"(Historical context only) Some older books feature **gollywogs**, but these are now often censored or accompanied by disclaimers.","translation":"（歴史的な文脈でのみ）一部の古い本にはゴリウォーグが登場しますが、これらは現在、検閲されたり、免責事項が添えられたりすることがよくあります。","type":"noun","meaning_category":"歴史的な人形"}]}