{"word":"spoonies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"慢性疾患を持つ人々、または慢性疾患のためにエネルギーが限られている人々を指すスラング","english_definition":"A slang term for people with chronic illnesses, or those with limited energy due to chronic illness.","examples":[{"sentence":"Many spoonies find it difficult to maintain a full-time job.","translation":"多くのスプーニーズは、フルタイムの仕事を維持することが難しいと感じています。"},{"sentence":"The spoon theory is a helpful way to explain energy limitations to those who don't understand.","translation":"スプーン理論は、理解しない人にエネルギー制限を説明するのに役立つ方法です。"},{"sentence":"Online communities provide support for spoonies to share their experiences.","translation":"オンラインコミュニティは、スプーニーズが経験を共有するためのサポートを提供します。"}],"collocations":["spoon theory","chronic illness community","energy limitations","support group"],"synonyms":["chronically ill","disabled (in some contexts)"],"antonyms":["healthy","able-bodied"],"notes":"This term is often used within the chronic illness community as a way to identify and support each other. It comes from the \"spoon theory,\" which uses spoons as a metaphor for units of energy that a person has available each day."}],"etymology":{"value":"The term 'spoonies' originates from 'The Spoon Theory,' an essay written by Christine Miserandino in 2003 to explain what it feels like to have a chronic illness. She used spoons to represent the limited amount of energy a chronically ill person has each day.","priority":"★★★"},"pronunciation":{"ipa":"/ˈspuːniz/","syllables":"spoon-ies"},"inflection":{"noun_plural":"spoonies"},"usage_notes":{"explanation":"'Spoonies' is a term primarily used within the chronic illness community. It's a way for individuals with chronic illnesses to identify with each other and share experiences. The term is derived from 'The Spoon Theory,' which explains how people with chronic illnesses have to make conscious decisions about how they spend their limited energy each day. It is generally considered an in-group term and may not be widely understood outside of the community.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's just being spoonies.","correct":"✓ He's just being lazy.","note":"'Spoonies' refers to people with chronic illnesses, not simply laziness. It's important to use the term respectfully and accurately."},{"incorrect":"✗ Spoonies are always sick.","correct":"✓ Spoonies manage their chronic illnesses daily.","note":"'Spoonies' have chronic illnesses, but they are not always acutely sick. They manage their conditions daily."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["chronic illness","chronic fatigue","fibromyalgia","autoimmune disease","disability"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency, specific to online communities and health forums.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spoonies' is a slang term used within the chronic illness community to describe people who have chronic illnesses and limited energy. The term comes from 'The Spoon Theory,' which is a metaphor for how people with chronic illnesses have to carefully manage their energy levels each day. It's important to use this term respectfully and understand its origin before using it."},"example_sentences":[{"sentence":"As a spoonie, she has to plan her day carefully to conserve energy.","translation":"スプーニーとして、彼女はエネルギーを節約するために一日を慎重に計画する必要があります。","type":"noun","meaning_category":"chronic illness community"},{"sentence":"Many spoonies find support and understanding in online forums.","translation":"多くのスプーニーズは、オンラインフォーラムでサポートと理解を見つけています。","type":"noun","meaning_category":"chronic illness community"},{"sentence":"The spoon theory helps explain the challenges faced by spoonies to those without chronic illnesses.","translation":"スプーン理論は、慢性疾患のない人にスプーニーズが直面する課題を説明するのに役立ちます。","type":"noun","meaning_category":"chronic illness community"}]}