{"word":"collotypy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コロタイプ (ガラス板写真術)","english_definition":"A printing process using a glass plate with a light-sensitive gelatin coating to produce high-quality images with continuous tones.","examples":[{"sentence":"Collotypy was a popular method for reproducing photographs in books and magazines in the late 19th and early 20th centuries.","translation":"コロタイプは、19世紀後半から20世紀初頭にかけて、書籍や雑誌で写真を複製するための一般的な方法でした。"},{"sentence":"The museum displayed a collection of prints made using the collotypy process.","translation":"博物館では、コロタイプ技法を用いて制作された版画のコレクションが展示されていました。"}],"collocations":["collotype print","collotype process","produce a collotype","fine art collotypy"],"synonyms":["photogelatin printing","gelatin relief printing"],"antonyms":[]}],"etymology":{"value":"The word \"collotypy\" comes from the Greek words \"kolla\" (glue) and \"typos\" (impression).","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈlɒtəpi/","syllables":"col-lo-ty-py"},"inflection":{"noun_plural":"collotypies"},"usage_notes":{"explanation":"Collotypy is a historical printing process known for its ability to reproduce images with a wide range of tones and fine detail. It is a planographic process, meaning that the image is printed from a flat surface rather than from raised or recessed areas. The process is relatively complex and requires specialized equipment and expertise, making it less common today than other printing methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist used collotype to create the painting.","correct":"✓ The artist used collotypy to create the print.","note":"Collotypy is a printing process, not a painting technique."}],"priority":"★☆☆"},"related_words":{"derivatives":["collotype (noun: a print made using the collotypy process)"],"related_terms":["lithography","photogravure","offset printing"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Collotypy is a specialized term referring to a specific historical printing process. Understanding the term requires familiarity with printing techniques and art history. The process involves creating prints from a gelatin-coated glass plate, allowing for detailed and continuous-tone images. Due to its complexity and historical context, the term is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The rare book featured several exquisite examples of collotypy.","translation":"その希少本には、コロタイプの素晴らしい作例がいくつか掲載されていた。","type":"noun","meaning_category":"印刷技法"},{"sentence":"The artist chose collotypy for its ability to capture subtle tonal variations.","translation":"そのアーティストは、微妙な色調の変化を捉えることができるため、コロタイプを選んだ。","type":"noun","meaning_category":"印刷技法"}]}