{"word":"Sprogue","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, dated) A dialectal term for a pert, lively, or forward young woman or girl.","english_definition":"(rare, dated) A dialectal term for a pert, lively, or forward young woman or girl.","examples":[{"sentence":"She was a regular sprogue, always getting into mischief.","translation":"彼女はいつもいたずらばかりしている、本当に生意気な娘だった。"},{"sentence":"The sprogue answered back to her elders without a second thought.","translation":"そのおてんば娘は、年長者にもすぐに口答えをした。"}],"collocations":[],"synonyms":["minx","hussy","hoyden","tomboy"],"antonyms":[]}],"etymology":{"value":"Origin uncertain; possibly related to 'spry' or other words denoting liveliness. The term appears primarily in regional dialects of English.","priority":"★★☆"},"pronunciation":{"ipa":"/sproʊɡ/","syllables":"Sprogue"},"inflection":{"noun_plural":"Sprogues"},"usage_notes":{"explanation":"'Sprogue' is a rare and somewhat archaic term, primarily found in dialectal usage. It describes a young woman or girl who is considered lively, cheeky, or forward in her behavior. The term is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Sprogue' is a very uncommon and dated word, primarily found in regional dialects. It refers to a young woman or girl who is considered pert, lively, or forward. Due to its rarity, it is unlikely to be encountered in general English usage. Understanding this word is more relevant to those studying historical or regional dialects of English."},"example_sentences":[{"sentence":"The local villagers described her as a bit of a sprogue, always running around and causing trouble.","translation":"地元の村人たちは彼女のことを、いつも走り回って騒ぎを起こしている、少しおてんばな娘だと評した。","type":"noun","meaning_category":"pert young woman"}]}