{"word":"ascomycetous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"子嚢菌類の、子嚢菌に属する","english_definition":"Relating to or belonging to the Ascomycota (Ascomycetes), a phylum of fungi characterized by the production of spores in a sac-like ascus.","examples":[{"sentence":"Ascomycetous fungi are a diverse group found in various habitats.","translation":"子嚢菌類の菌類は多様なグループであり、様々な生息地で見られる。"},{"sentence":"The ascomycetous yeast is used in bread making.","translation":"その子嚢菌類の酵母はパン作りに使われる。"}],"collocations":["ascomycetous fungi","ascomycetous yeast","ascomycetous spores"],"synonyms":["ascogenous"],"antonyms":[]}],"etymology":{"value":"Derived from the class name Ascomycetes (now a phylum, Ascomycota), which comes from the Greek 'askos' meaning 'sac' or 'bag' (referring to the ascus) and 'mykes' meaning 'fungus'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæskəmaɪˈsiːtəs/","syllables":"as-co-my-ce-tous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Ascomycetous' is a technical term used in biology, specifically in mycology (the study of fungi). It describes organisms that belong to the phylum Ascomycota, which are characterized by forming spores within a sac-like structure called an ascus. This term is most often encountered in scientific literature or educational contexts related to fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ascomycetous is a type of fungi.","correct":"✓ Ascomycetous fungi are a type of fungi.","note":"'Ascomycetous' is an adjective, so it needs to modify a noun, such as 'fungi'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ascomycota (phylum name)","Ascomycete (noun, member of the phylum)","ascus (sac-like structure containing spores)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ascomycetous' is a scientific term referring to fungi that belong to the phylum Ascomycota. These fungi are characterized by producing spores in a sac-like structure called an ascus. The term is primarily used in scientific and academic contexts related to mycology. Understanding this term requires a background in biology or a related field."},"example_sentences":[{"sentence":"The study focused on various ascomycetous species found in the soil.","translation":"その研究は、土壌中に見られる様々な子嚢菌類の種に焦点を当てた。","type":"adjective","meaning_category":"子嚢菌類の"},{"sentence":"Penicillium is a well-known ascomycetous mold used to produce antibiotics.","translation":"ペニシリンは抗生物質を生産するために使用される有名な子嚢菌類のカビである。","type":"adjective","meaning_category":"子嚢菌類の"}]}