{"word":"extraequilibrium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非平衡状態、平衡状態からの逸脱","english_definition":"A state that is not in equilibrium; a deviation from a state of equilibrium.","examples":[{"sentence":"The system was driven into extraequilibrium by the sudden influx of energy.","translation":"そのシステムは、突然のエネルギー流入によって非平衡状態に陥った。"},{"sentence":"The study of extraequilibrium phenomena is crucial for understanding complex systems.","translation":"非平衡現象の研究は、複雑なシステムを理解するために非常に重要である。"}],"collocations":["extraequilibrium state","driven into extraequilibrium","study of extraequilibrium"],"synonyms":["nonequilibrium","disequilibrium"],"antonyms":["equilibrium"]},{"part_of_speech":"adjective","definition":"非平衡の、平衡状態から逸脱した","english_definition":"Relating to or characterized by a state that is not in equilibrium.","examples":[{"sentence":"The extraequilibrium conditions led to the formation of novel structures.","translation":"非平衡状態が、新しい構造の形成につながった。"},{"sentence":"Extraequilibrium processes are often associated with irreversible changes.","translation":"非平衡プロセスは、しばしば不可逆的な変化と関連付けられる。"}],"collocations":["extraequilibrium conditions","extraequilibrium processes"],"synonyms":["nonequilibrium"],"antonyms":["equilibrium"]}],"etymology":{"value":"\"extra-\" (beyond, outside) + \"equilibrium\" (a state of balance).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌekstrɪˌkwɪlɪˈbrɪəm/","syllables":"ex-tra-e-qui-li-bri-um"},"inflection":{"noun_plural":"extraequilibriums"},"usage_notes":{"explanation":"\"Extraequilibrium\" is a technical term primarily used in scientific contexts, such as physics, chemistry, and economics, to describe systems that are not in a state of balance or stability. It often implies a dynamic state where energy or matter is flowing, leading to changes in the system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is in extraequilibrium for a long time.","correct":"✓ The system was in extraequilibrium for a short time.","note":"Extraequilibrium is often a transient state. Using \"for a long time\" might be misleading unless the system is actively maintained out of equilibrium."}],"priority":"★☆☆"},"related_words":{"derivatives":["equilibrium","disequilibrium","nonequilibrium"],"related_concepts":["thermodynamics","statistical mechanics","irreversible processes"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Extraequilibrium\" is a highly specialized term used in advanced scientific fields. Understanding it requires familiarity with the concept of \"equilibrium\" and the prefix \"extra-\". It describes a state where a system is not balanced, often due to external forces or energy inputs. This term is rarely encountered outside of technical literature.","priority":"★☆☆"},"example_sentences":[{"sentence":"The chemical reaction proceeded under extraequilibrium conditions, leading to a higher yield.","translation":"その化学反応は非平衡条件下で進行し、収率が向上した。","type":"general","meaning_category":"scientific"},{"sentence":"The economic model assumes a constant return to extraequilibrium after a shock.","translation":"その経済モデルは、ショック後、常に非平衡状態から平衡状態に戻ると仮定している。","type":"economic","meaning_category":"economic"}]}