{"word":"fermage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(フランス語) 農地賃貸、農業経営委託","english_definition":"(French) A type of lease of land, especially agricultural land, in which the tenant pays a fixed rent in money or kind. It is a form of agricultural tenancy.","examples":[{"sentence":"Le fermage est un contrat par lequel un propriétaire loue une terre à un agriculteur en échange d'un loyer.","translation":"Fermage is a contract by which an owner rents land to a farmer in exchange for rent.","context":"Definition example."}],"collocations":["bail à fermage (農地賃貸契約)"],"synonyms":["location de terres agricoles (農地の賃貸)","bail rural (農村賃貸)"],"antonyms":["métayage (分益小作)"]},{"part_of_speech":"noun","definition":"(歴史) 中世・近世フランスにおける農地の賃借制度","english_definition":"(Historical) A system of land tenure in medieval and early modern France, where land was leased to tenants for a fixed rent.","examples":[{"sentence":"Sous l'Ancien Régime, le fermage était une forme courante d'exploitation agricole.","translation":"Under the Ancien Régime, fermage was a common form of agricultural exploitation.","context":"Historical context."}],"collocations":[],"synonyms":[],"antonyms":["servage (農奴制)"]}],"etymology":{"value":"フランス語の \"fermage\" は、\"ferme\" (農場) から派生し、中世ラテン語の \"firma\" (固定された支払い) に由来します。これは、賃借人が地主に固定された金額を支払うという契約の性質を反映しています。","priority":"★★★"},"pronunciation":{"ipa":"/fɛʁ.maʒ/","syllables":"fer-mage"},"inflection":{"noun_plural":"fermages"},"usage_notes":{"explanation":"\"Fermage\" は主にフランス語圏で使用される用語であり、特定の種類の農地賃貸契約を指します。英語では、状況に応じて \"agricultural lease\" や \"farm tenancy\" などのより一般的な用語が使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a fermage in England.","correct":"✓ I have a farm tenancy in England.","note":"\"Fermage\" はフランスの制度を指すため、英語圏ではより一般的な \"farm tenancy\" を使用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["fermier (農場経営者、小作人)","ferme (農場)"],"phrasal_verbs":[],"related_concepts":["bail rural (農村賃貸契約)","droit rural (農村法)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (専門用語)","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Fermage\" is a specialized term primarily used in French-speaking contexts to describe a specific type of agricultural land lease. It involves a fixed rent payment from the tenant to the landowner. Due to its specific cultural and legal context, it's not commonly used in general English. Understanding its historical and legal implications requires a higher level of language proficiency.","note":"Requires understanding of French agricultural practices and legal terminology."},"example_sentences":[{"sentence":"Le contrat de fermage précise les obligations du propriétaire et du fermier.","translation":"The fermage contract specifies the obligations of the owner and the farmer.","type":"general","meaning_category":"農地賃貸契約"},{"sentence":"Le fermage a permis le développement de l'agriculture dans certaines régions de France.","translation":"Fermage has allowed the development of agriculture in some regions of France.","type":"historical","meaning_category":"歴史的制度"}]}