{"word":"medication-tolerant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"薬物寛容性のある、薬物耐性のある","english_definition":"Describing a condition where an individual or organism can withstand the effects of a medication to a greater degree than normal, often requiring higher doses to achieve the desired therapeutic effect.","examples":[{"sentence":"The patient became medication-tolerant after prolonged use of the drug.","translation":"その患者は、薬物を長期使用した後、薬物寛容性になった。"},{"sentence":"Some bacteria are becoming medication-tolerant, making infections harder to treat.","translation":"一部の細菌は薬物耐性になりつつあり、感染症の治療がより困難になっている。"}],"collocations":["medication-tolerant bacteria (薬物耐性菌)","medication-tolerant cells (薬物耐性細胞)","become medication-tolerant (薬物寛容性になる)","develop medication-tolerance (薬物寛容性を発達させる)"],"synonyms":["drug-tolerant","drug-resistant","medication-resistant","tolerant to medication"],"antonyms":["medication-sensitive","drug-sensitive"],"related_medical_terms":["drug tolerance","medication tolerance","drug resistance","antibiotic resistance","antimicrobial resistance"]}],"etymology":{"value":"The term is formed by combining \"medication\" (a substance used for medical treatment) with \"tolerant\" (able to endure or withstand something, in this case, the effects of the medication).","priority":"N/A"},"pronunciation":{"ipa":"/ˌmɛdɪˈkeɪʃən ˈtɒlərənt/","syllables":"med-i-ca-tion tol-er-ant"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Medication-tolerant\" describes the state of an organism or individual that has developed a reduced response to a particular medication. This can occur due to various mechanisms, such as increased drug metabolism, altered drug targets, or activation of compensatory pathways. It is often a concern in the treatment of chronic conditions or infections, as it may necessitate higher doses or alternative medications. It is closely related to the concept of \"drug resistance,\" especially in the context of antimicrobial agents.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is medication-tolerance.","correct":"✓ The virus is medication-tolerant.","note":"\"Tolerance\" is a noun, while \"tolerant\" is the adjective form needed to describe the virus."},{"incorrect":"✗ He is medication-tolerated.","correct":"✓ He is medication-tolerant.","note":"\"Tolerated\" implies being allowed or permitted, which is not the intended meaning here."}],"priority":"N/A"},"related_words":{"derivatives":["medication tolerance (薬物寛容性)","medication resistance (薬物耐性)"],"phrases":["medication-tolerant strain (薬物耐性株)","medication-tolerant phenotype (薬物耐性表現型)"],"related_concepts":["pharmacokinetics","pharmacodynamics","adaptive resistance","acquired resistance","intrinsic resistance"]},"level_frequency":{"notes":"The term is primarily used in medical and scientific contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"\"Medication-tolerant\" is a term used in medicine and biology to describe when a person or organism doesn't respond as strongly to a medicine as they used to. This often means that a higher dose of the medicine is needed to get the same effect. It's important to understand this term when discussing treatments for long-term illnesses or infections, as it affects how doctors choose and adjust medications. It is related to, but subtly different from, the concept of drug resistance, which implies a complete lack of response."},"example_sentences":[{"sentence":"The cancer cells became medication-tolerant, requiring a change in chemotherapy regimen.","translation":"癌細胞は薬物寛容性になったため、化学療法のレジメンを変更する必要があった。","type":"adjective","meaning_category":"薬物寛容性のある"},{"sentence":"Due to her medication-tolerant condition, the doctor prescribed a higher dosage.","translation":"彼女の薬物寛容性の状態のため、医師はより高い投与量を処方した。","type":"adjective","meaning_category":"薬物寛容性のある"}]}