{"word":"carryovers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"繰越金、繰越品、残存物","english_definition":"Items or amounts carried over from one period to another; remnants or survivals.","examples":[{"sentence":"The carryovers from last year's budget were allocated to new projects.","translation":"昨年度の予算からの繰越金は、新しいプロジェクトに割り当てられました。"},{"sentence":"These old traditions are carryovers from a bygone era.","translation":"これらの古い伝統は、過ぎ去った時代からの残存物です。"},{"sentence":"We need to account for the inventory carryovers before placing new orders.","translation":"新しい注文を出す前に、在庫の繰越品を考慮する必要があります。"}],"collocations":["budget carryovers (予算繰越金)","inventory carryovers (在庫繰越品)","cultural carryovers (文化的残存物)","tax carryovers (税額繰越)"],"synonyms":["remnants","leftovers","residue","holdovers","survivals"],"antonyms":[],"notes":"Usually used in the plural form."}],"etymology":{"value":"Derived from the verb 'carry over,' meaning to transfer or continue something from one period, situation, or place to another.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæriˌoʊvərz/","syllables":"car-ry-o-vers"},"inflection":{"noun_plural":"carryovers"},"usage_notes":{"explanation":"'Carryovers' refers to items, amounts, or practices that are transferred or continued from one period or situation to another. It is commonly used in financial contexts to describe funds or budget allocations that are not fully used in one fiscal year and are therefore transferred to the next. It can also refer to physical items like inventory or cultural practices that persist over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The carryover was used for the project.","correct":"✓ The carryovers were used for the project.","note":"'Carryovers' is typically used in the plural form, even if referring to a single category of items."}],"priority":"★★☆"},"related_words":{"derivatives":["carryover (singular noun)","carry over (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., finance, accounting).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Carryovers' generally refers to items or amounts that are moved from one period to the next. This term is often used in business, finance, or accounting to describe funds or inventory that are not used in the current period and are transferred to the next. It can also be used more broadly to describe traditions or practices that continue from the past into the present. The term is usually used in the plural form."},"example_sentences":[{"sentence":"The company's tax carryovers helped reduce their tax burden this year.","translation":"その会社の税額繰越は、今年の税負担を軽減するのに役立ちました。","type":"noun","meaning_category":"Financial"},{"sentence":"Many of the local customs are carryovers from ancient rituals.","translation":"多くの地元の習慣は、古代の儀式からの残存物です。","type":"noun","meaning_category":"Cultural"},{"sentence":"The inventory carryovers need to be cleared out before the new season's products arrive.","translation":"新しいシーズンの製品が到着する前に、在庫の繰越品を処分する必要があります。","type":"noun","meaning_category":"Inventory"}]}