{"word":"lipopexia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脂肪吸引後の皮膚たるみ修正手術","english_definition":"A surgical procedure to correct skin laxity after liposuction.","examples":[{"sentence":"Lipopexia is often performed after significant weight loss following liposuction.","translation":"脂肪吸引後の大幅な体重減少後には、しばしばリポペキシアが行われます。"},{"sentence":"The surgeon recommended lipopexia to improve the contour of my abdomen after liposuction.","translation":"外科医は、脂肪吸引後の腹部の輪郭を改善するためにリポペキシアを勧めました。"}],"collocations":["abdominal lipopexia","thigh lipopexia","arm lipopexia"],"synonyms":["tummy tuck","panniculectomy","body lift"],"antonyms":[]}],"etymology":{"value":"The term 'lipopexia' is derived from the Greek words 'lipo-' (fat) and 'pexia' (fixation or suspension). It refers to the surgical fixation or suspension of tissue after fat removal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪpoʊˈpɛksiə/","syllables":"li-po-pex-i-a"},"inflection":{"noun_plural":"lipopexias"},"usage_notes":{"explanation":"Lipopexia is a surgical procedure specifically designed to address skin laxity that can occur after liposuction. It involves tightening and reshaping the skin to improve the overall contour of the treated area. It is not a substitute for liposuction but rather a complementary procedure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lipopexia is a weight loss procedure.","correct":"✓ Lipopexia is a skin tightening procedure after weight loss or liposuction.","note":"Lipopexia is not a weight-loss procedure itself but rather a skin-tightening procedure often performed after weight loss or liposuction."},{"incorrect":"✗ Lipopexia can remove fat.","correct":"✓ Lipopexia primarily addresses skin laxity, not fat removal.","note":"Lipopexia focuses on removing excess skin and tightening tissues, not on removing fat. Fat removal is achieved through liposuction."}],"priority":"★★☆"},"related_words":{"derivatives":["liposuction","excision"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Lipopexia is a specialized surgical term that refers to a procedure designed to correct skin laxity following liposuction. It involves the surgical removal of excess skin and the tightening of underlying tissues to improve the contour and appearance of the treated area. This procedure is typically considered when liposuction alone does not adequately address skin sagging. Understanding this term requires a familiarity with surgical procedures and medical terminology."},"example_sentences":[{"sentence":"Following her liposuction, she underwent lipopexia to remove the excess skin.","translation":"脂肪吸引後、彼女は余分な皮膚を取り除くためにリポペキシアを受けた。","type":"noun","meaning_category":"たるみ修正手術"},{"sentence":"Abdominal lipopexia can significantly improve the appearance of the stomach after massive weight loss.","translation":"腹部リポペキシアは、大幅な減量後の胃の外観を大幅に改善することができます。","type":"noun","meaning_category":"たるみ修正手術"}]}