{"word":"monophyletic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)単系統の","english_definition":"(of a group of organisms) descended from a common evolutionary ancestor or ancestral group, especially one not shared with any other group.","examples":[{"sentence":"A truly monophyletic group includes all known descendants of a single common ancestor.","translation":"真に単系統のグループは、単一の共通祖先の既知のすべての子孫を含む。"},{"sentence":"The reptile class is not monophyletic because it does not include birds.","translation":"爬虫類は鳥類を含まないため、単系統ではない。"}],"collocations":["monophyletic group","monophyletic taxon","monophyletic clade"],"synonyms":["holophyletic","clade"],"antonyms":["polyphyletic","paraphyletic"]},{"part_of_speech":"adjective","definition":"(系統学)単系統の、単一起源の","english_definition":"(cladistics) pertaining to a group of taxa that includes a common ancestor and all of its descendants.","examples":[{"sentence":"The goal of phylogenetic classification is to identify monophyletic groups.","translation":"系統分類の目標は、単系統群を特定することである。"}],"collocations":["monophyletic origin","monophyletic descent"],"synonyms":["single origin","common ancestry"],"antonyms":["multiple origins"]}],"etymology":{"value":"From Greek *monos* (single, alone) + *phylē* (tribe, clan) + *-etic* (suffix indicating relationship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnəfaɪˈlɛtɪk/","syllables":"mon-o-phy-let-ic"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms (more monophyletic, most monophyletic)."},"usage_notes":{"explanation":"In biology, especially in systematics and cladistics, 'monophyletic' is a crucial term. A monophyletic group (also known as a clade) is a group of organisms that includes a common ancestor and all of its descendants. This contrasts with paraphyletic groups (which include a common ancestor and some, but not all, of its descendants) and polyphyletic groups (which include organisms from multiple evolutionary lineages without a single common ancestor). The concept is fundamental to understanding evolutionary relationships and constructing accurate phylogenetic classifications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The group is monophyletic, but some members are not related.","correct":"✓ The group is monophyletic, meaning all members are related by common descent.","note":"Monophyly implies that all members of the group are related by descent from a single common ancestor. If some members are unrelated, the group is not monophyletic."},{"incorrect":"✗ A monophyletic group can exclude some descendants of the common ancestor.","correct":"✓ A monophyletic group must include all descendants of the common ancestor.","note":"By definition, a monophyletic group includes all descendants of the common ancestor. Excluding descendants makes the group paraphyletic."}],"priority":"★★☆"},"related_words":{"derivatives":["monophyly (noun): the condition of being monophyletic","monophyletically (adverb)"],"phrases":["clade (a monophyletic group)","phylogeny (the evolutionary history of a group of organisms)","systematics (the study of the diversity of organisms and their evolutionary relationships)","cladistics (a method of classifying organisms based on their evolutionary relationships)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monophyletic' is a specialized term used in biology, particularly in the fields of systematics and evolutionary biology. It describes a group of organisms that are all descended from a single common ancestor, and includes all of the descendants of that ancestor. Understanding this term is essential for comprehending phylogenetic trees and evolutionary relationships between different species. It is often contrasted with 'paraphyletic' and 'polyphyletic,' which describe groups that do not include all descendants of a single ancestor or that have multiple, unrelated ancestors, respectively. This word is primarily encountered in advanced scientific texts and discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The analysis confirmed that the family is a monophyletic group.","translation":"その分析により、その科が単系統群であることが確認された。","type":"general","meaning_category":"単系統の"},{"sentence":"Establishing whether a group is truly monophyletic requires extensive phylogenetic analysis.","translation":"あるグループが真に単系統であるかどうかを確立するには、広範な系統解析が必要である。","type":"general","meaning_category":"単系統の"},{"sentence":"The study aimed to reconstruct the phylogeny and identify monophyletic clades within the genus.","translation":"その研究は、系統を再構築し、その属内の単系統群を特定することを目的とした。","type":"general","meaning_category":"単系統の"}]}