{"word":"rock-paper-scissors","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"じゃんけん","english_definition":"A hand game, usually played between two people, in which each player simultaneously forms one of three shapes with an outstretched hand. These shapes are 'rock' (a closed fist), 'paper' (a flat hand), and 'scissors' (a fist with the index and middle fingers extended, forming a V).","examples":[{"sentence":"Let's play rock-paper-scissors to decide who goes first.","translation":"誰が最初に行くかじゃんけんで決めよう。"},{"sentence":"We played rock-paper-scissors for the last piece of pizza.","translation":"最後のピザをかけてじゃんけんをした。"}],"collocations":["play rock-paper-scissors","rock, paper, scissors, shoot","best of three rock-paper-scissors"],"synonyms":["janken (Japanese)","roshambo"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に) 運や偶然に左右される状況、不確実な状況","english_definition":"(figuratively) A situation or decision-making process that seems arbitrary or dependent on luck.","examples":[{"sentence":"The company's strategy felt like rock-paper-scissors, with no real plan.","translation":"その会社の戦略は、まるでじゃんけんのようで、実際の計画がなかった。"},{"sentence":"Choosing between these options is just rock-paper-scissors; there's no clear winner.","translation":"これらの選択肢から選ぶのは、ただのじゃんけんのようなもので、明確な勝者はいない。"}],"collocations":["feel like rock-paper-scissors","rock-paper-scissors decision"],"synonyms":["arbitrary choice","coin flip","random selection"],"antonyms":["calculated decision","strategic choice"]}],"etymology":{"value":"A direct translation of the Japanese game 'janken' (じゃんけん). The names of the hand gestures reflect the objects they represent. The game's popularity spread globally, leading to the English translation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɒkˌpeɪpərˈsɪzərz/","syllables":"rock-pa-per-sci-ssors"},"inflection":{"noun_plural":"rock-paper-scissors (usually used as a singular mass noun, even when referring to multiple games)"},"usage_notes":{"explanation":"'Rock-paper-scissors' is a common game used for making quick decisions or resolving minor disputes. It relies on chance, as each player's choice is made simultaneously and without knowledge of the other's choice. The game's rules are simple: rock crushes scissors, scissors cut paper, and paper covers rock. When used figuratively, it describes situations where the outcome is unpredictable and seemingly random.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ rock paper scissor","correct":"✓ rock-paper-scissors","note":"The correct name of the game is 'rock-paper-scissors', always pluralized with an 's' at the end of 'scissors'."},{"incorrect":"✗ I will play rock, paper, and scissors.","correct":"✓ I will play rock-paper-scissors.","note":"The game is referred to as a single unit, 'rock-paper-scissors', not as separate elements."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["janken","roshambo","hand game"],"priority":"★★★"},"level_frequency":{"CEFR":"A2","frequency_google_ngram":"Relatively frequent, especially in contexts related to games and decision-making.","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"'Rock-paper-scissors' is a simple hand game where two people make a shape with their hand: a rock (fist), paper (flat hand), or scissors (two fingers making a V shape). Rock beats scissors, scissors beat paper, and paper beats rock. It's often used to make a quick decision or choose who goes first in a game.","priority":"★★★"},"example_sentences":[{"sentence":"They used rock-paper-scissors to decide who would wash the dishes.","translation":"彼らは誰が皿を洗うかじゃんけんで決めた。","type":"noun","meaning_category":"game"},{"sentence":"The decision felt like rock-paper-scissors, with no logical basis.","translation":"その決定は論理的な根拠がなく、じゃんけんのようだった。","type":"noun","meaning_category":"figurative"}]}