{"word":"Limonin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リモニン：柑橘類に含まれる苦味成分の一種","english_definition":"A bitter, white, crystalline compound found in citrus fruits, especially in seeds and albedo.","examples":[{"sentence":"Limonin is responsible for the delayed bitterness in some citrus juices.","translation":"リモニンは、一部の柑橘ジュースにおける遅延性の苦味の原因である。"},{"sentence":"The concentration of limonin in citrus fruits varies depending on the variety and maturity.","translation":"柑橘類中のリモニンの濃度は、品種や成熟度によって異なる。"}],"collocations":["limonin content (リモニン含有量)","limonin bitterness (リモニンの苦味)","reduce limonin (リモニンを減らす)","extract limonin (リモニンを抽出する)"],"synonyms":["citrus bitter compound"],"antonyms":[]},{"part_of_speech":"noun","definition":"化学式 C26H30O8 で表される有機化合物","english_definition":"An organic compound with the chemical formula C26H30O8.","examples":[{"sentence":"Limonin is a member of the limonoid family of compounds.","translation":"リモニンは、リモノイド化合物群の一員である。"},{"sentence":"The molecular structure of limonin has been extensively studied.","translation":"リモニンの分子構造は、広範囲に研究されている。"}],"collocations":["limonoid","chemical structure","molecular formula"],"synonyms":["C26H30O8"],"antonyms":[]}],"etymology":{"value":"The term 'limonin' is derived from 'lemon' because it was first isolated from lemon seeds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪmənɪn/","syllables":"li-mo-nin"},"inflection":{"notes":"This word is a noun and does not have different inflections."},"usage_notes":{"explanation":"Limonin is a naturally occurring triterpenoid responsible for the characteristic bitter taste found in citrus fruits. While some people are more sensitive to its bitterness, others may not perceive it as strongly. The concentration of limonin varies among different citrus varieties and can change during fruit development and processing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Limonin is a vitamin.","correct":"✓ Limonin is a triterpenoid.","note":"Limonin is not a vitamin but a triterpenoid compound found in citrus fruits."},{"incorrect":"✗ Limonin makes citrus fruits sweet.","correct":"✓ Limonin makes citrus fruits bitter.","note":"Limonin contributes to the bitter taste, not the sweet taste, of citrus fruits."}],"priority":"★★☆"},"related_words":{"derivatives":["limonoid"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Limonin' is a specialized term related to the chemical composition of citrus fruits. It refers to a specific compound that contributes to the bitter taste in these fruits. Understanding this term requires some knowledge of chemistry and food science. It is not commonly used in everyday conversation but is more likely to appear in scientific or technical contexts related to food processing and analysis."},"example_sentences":[{"sentence":"The level of limonin in the orange juice affected its taste.","translation":"オレンジジュース中のリモニンのレベルがその味に影響を与えた。","type":"general","meaning_category":"bitter compound"},{"sentence":"Scientists are studying ways to reduce the limonin content in citrus products.","translation":"科学者たちは、柑橘製品中のリモニン含有量を減らす方法を研究している。","type":"scientific","meaning_category":"chemical compound"}]}