{"word":"goutily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"痛風持ちのように、痛風患者らしく","english_definition":"In a manner characteristic of gout; as a person with gout would act or move.","examples":[{"sentence":"He walked goutily, favoring his left foot.","translation":"彼は左足をかばうように、痛風持ちのような歩き方をした。"},{"sentence":"The old man sat goutily in his armchair, his leg propped up on a cushion.","translation":"その老人は肘掛け椅子に痛風持ちらしく座り、足をクッションの上に置いていた。"}],"collocations":["walk goutily","sit goutily","move goutily"],"synonyms":["stiffly","awkwardly","painfully"],"antonyms":["gracefully","easily","smoothly"]}],"etymology":{"value":"Derived from the adjective 'gouty' (affected by gout) and the suffix '-ly' (forming adverbs). 'Gouty' comes from the Middle English 'goute,' from Old French 'goute,' from Latin 'gutta' (a drop), referring to the belief that gout was caused by a drop of bad humor in the joints.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡaʊtɪli/","syllables":"gou-ti-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Goutily' describes a manner of movement or posture that suggests the stiffness, awkwardness, or pain associated with gout. It is not a common word, and its use is often descriptive and somewhat humorous or ironic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke goutily about his political views.","correct":"✓ He spoke passionately about his political views.","note":"'Goutily' refers to physical movement or posture, not to speech or opinions. Use a different adverb to describe the manner of speaking."}],"priority":"★☆☆"},"related_words":{"derivatives":["gout (noun: a disease characterized by inflammation of the joints)","gouty (adjective: affected by gout)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'goutily' is a rare and specialized term. It requires understanding of the medical condition 'gout' and the function of the '-ly' suffix to form adverbs. Because of its limited use and specific context, it is unlikely to be encountered except in advanced or specialized texts."},"example_sentences":[{"sentence":"The nobleman limped goutily across the ballroom, his face contorted in discomfort.","translation":"貴族は苦痛に顔を歪めながら、痛風持ちのように舞踏室をよろめきながら歩いた。","type":"adverb","meaning_category":"manner of movement"},{"sentence":"He sat goutily, carefully positioning his swollen foot on a stool.","translation":"彼は腫れた足をスツールの上に慎重に置きながら、痛風持ちのように座った。","type":"adverb","meaning_category":"posture"}]}