{"word":"marble-constant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Rare, archaic) As firm or unyielding as marble; unchanging, constant.","english_definition":"(Rare, archaic) As firm or unyielding as marble; unchanging, constant.","examples":[{"sentence":"Her heart was marble-constant, unmoved by his pleas.","translation":"彼女の心は、大理石のように固く、彼の懇願にも動かされなかった。"},{"sentence":"He sought a marble-constant truth in a world of shifting sands.","translation":"彼は、移り変わる砂の世界で、大理石のように変わらない真実を求めた。"}],"collocations":["marble-constant heart","marble-constant truth","marble-constant resolve"],"synonyms":["unyielding","inflexible","unwavering","steadfast","immutable","constant","firm","resolute"],"antonyms":["yielding","flexible","wavering","inconstant","mutable","changeable"],"notes":"This word is rare and archaic, primarily found in older literature."}],"etymology":{"value":"Derived from the combination of 'marble' (referring to the hard, unchanging nature of the stone) and 'constant' (meaning unchanging or steadfast).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːrbəl ˈkɒnstənt/","syllables":"mar-ble-con-stant"},"inflection":{"notes":"As an adjective, it can theoretically be used in comparative and superlative forms (more marble-constant, most marble-constant), but this is highly uncommon due to its archaic nature."},"usage_notes":{"explanation":"'Marble-constant' is a rarely used adjective that evokes the image of something as firm, unyielding, and unchanging as marble. It is typically found in literary contexts aiming to create a sense of permanence, strength, or inflexibility. Due to its archaic nature, it is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was marble-constant, changing every day.","correct":"✓ The data was inconsistent, changing every day.","note":"'Marble-constant' implies unchanging, so it cannot be used to describe something that changes frequently."}],"priority":"★☆☆"},"related_words":{"derivatives":["marble (noun)","constant (adjective, noun)"],"related_terms":["marble-hearted (similar concept, implying coldness or lack of emotion)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency; primarily found in older texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Marble-constant' is a highly literary and archaic term. Understanding requires familiarity with the symbolic association of marble with permanence and inflexibility, as well as a strong vocabulary. Its use is limited to specialized contexts, such as historical fiction or poetry aiming for a specific stylistic effect."},"example_sentences":[{"sentence":"Her marble-constant gaze betrayed no hint of her inner turmoil.","translation":"彼女の大理石のように変わらない視線は、内面の混乱を全く表していなかった。","type":"adjective","meaning_category":"unchanging"},{"sentence":"The philosopher sought a marble-constant principle to guide his life.","translation":"その哲学者は、人生を導く大理石のように変わらない原理を求めた。","type":"adjective","meaning_category":"steadfast"}]}