{"word":"incarnative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"肉体を持った、具体化された、化身の","english_definition":"Having the nature of incarnation; embodying or personifying something, especially a deity or spirit in human form.","examples":[{"sentence":"The painting is an incarnative representation of the goddess.","translation":"その絵は女神を肉体的に表現したものです。"},{"sentence":"His actions were incarnative of the company's values.","translation":"彼の行動は会社の価値観を具体的に表していました。"}],"collocations":["incarnative art","incarnative theology","incarnative power"],"synonyms":["embodied","personified","manifest","concrete","tangible"],"antonyms":["abstract","disembodied","immaterial"]}],"etymology":{"value":"From 'incarnate' + '-ive'. 'Incarnate' comes from Late Latin 'incarnatus', past participle of 'incarnare' ('to make flesh'), from 'in-' ('in') + 'caro, carnis' ('flesh').","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkɑːrnətɪv/","syllables":"in-car-na-tive"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Incarnative' describes something that embodies or represents an idea, spirit, or deity in a physical or tangible form. It is often used in religious or artistic contexts to describe representations of spiritual beings in human or physical forms. It can also be used more broadly to describe something that exemplifies abstract qualities or values in a concrete way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The incarnative idea was difficult to grasp.","correct":"✓ The incarnated idea was difficult to grasp.","note":"'Incarnative' describes the quality of embodying, while 'incarnated' refers to something already embodied. Use 'incarnated' when referring to an idea that has already been made concrete."}],"priority":"★★☆"},"related_words":{"derivatives":["incarnate (verb, adjective, noun)","incarnation (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Incarnative' is a relatively rare and sophisticated word, generally used in academic or specialized contexts, particularly in discussions of religion, philosophy, and art. It describes something that has the quality of embodying an abstract concept or spiritual entity in a physical form. The word implies a process of making something intangible into something tangible and real."},"example_sentences":[{"sentence":"The sculpture served as an incarnative symbol of hope for the community.","translation":"その彫刻は地域社会への希望を具体的に示す象徴として機能しました。","type":"general","meaning_category":"Embodiment"},{"sentence":"Her performance was an incarnative expression of the character's inner turmoil.","translation":"彼女の演技は、そのキャラクターの内面の葛藤を具体的に表現したものでした。","type":"artistic","meaning_category":"Representation"}]}