{"word":"bibliosoph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"本に関する知識や愛好に秀でた人、特に本の物理的な美しさや歴史的価値を重視する人","english_definition":"A lover of books, especially for their physical appearance or historical significance. A person with extensive knowledge about books.","examples":[{"sentence":"He was a true bibliosoph, spending hours examining the binding and paper quality of each volume.","translation":"彼は真のビブリオソフであり、各巻の装丁や紙質を調べるのに何時間も費やしていた。"},{"sentence":"The bibliosoph's collection included rare first editions and beautifully illustrated manuscripts.","translation":"そのビブリオソフのコレクションには、希少な初版本や美しくイラストが描かれた写本が含まれていた。"}],"collocations":["rare book bibliosoph","manuscript bibliosoph","avid bibliosoph","bibliosoph's collection"],"synonyms":["bibliophile","book lover","bookworm","bibliomaniac","book collector"],"antonyms":["bibliophobe","book hater","illiterate"]},{"part_of_speech":"noun","definition":"本の知識や知恵を愛する人","english_definition":"A lover of the wisdom and knowledge contained within books.","examples":[{"sentence":"As a bibliosoph, she valued the insights gained from reading more than the mere possession of books.","translation":"ビブリオソフとして、彼女は本の単なる所有よりも、読書から得られる洞察を重視していた。"}],"collocations":["intellectual bibliosoph","philosophical bibliosoph"],"synonyms":["lover of wisdom","seeker of knowledge"],"antonyms":["ignoramus","fool"]}],"etymology":{"value":"Derived from the Greek words 'biblio' (book) and 'sophia' (wisdom or knowledge).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɪbliəˈsɒf/","syllables":"bib-li-o-soph"},"inflection":{"noun_plural":"bibliosophs"},"usage_notes":{"explanation":"The term 'bibliosoph' is relatively rare compared to 'bibliophile.' While both terms refer to lovers of books, 'bibliosoph' often implies a deeper appreciation for the intellectual or aesthetic qualities of books, rather than just collecting them. It suggests a love of the wisdom found in books.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bibliosoph because he has many books.","correct":"✓ He is a bibliosoph because he appreciates the history and artistry of books.","note":"Having many books does not necessarily make someone a bibliosoph. The term implies a deeper appreciation for the qualities of books themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["bibliosophy (noun: the love of books and wisdom)"],"related_terms":["bibliophile","bibliography","bibliomania","bibliophobia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bibliosoph' is a rare and sophisticated term for someone who loves books, especially for their intellectual or aesthetic qualities. It implies a deep appreciation for the wisdom and knowledge found within books, as well as their physical beauty and historical significance. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The old professor was a true bibliosoph, always eager to discuss the philosophical implications of classic literature.","translation":"その老教授は真のビブリオソフであり、古典文学の哲学的意味についていつも熱心に議論していた。","type":"general","meaning_category":"lover of books and wisdom"},{"sentence":"As a bibliosoph, she curated her collection not just for rarity, but for the beauty of the typography and illustrations.","translation":"ビブリオソフとして、彼女は希少性だけでなく、活字の美しさやイラストの美しさにも注目してコレクションをキュレーションしていた。","type":"general","meaning_category":"lover of books' physical appearance"}]}