{"word":"Hyperconstitutionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"極めて憲法に則って、憲法上の原則を非常に厳格に遵守して","english_definition":"In a manner that is excessively or extremely constitutional; adhering to constitutional principles with extreme rigor.","examples":[{"sentence":"The law was interpreted hyperconstitutionally, leading to its rejection.","translation":"その法律は極めて憲法に則って解釈されたため、否決に至った。"}],"collocations":[],"synonyms":["overconstitutionally","ultraconstitutionally"],"antonyms":["unconstitutionally","constitutionally"],"notes":"This word is rare and often used in legal or political contexts to describe an extreme adherence to constitutional principles."}],"etymology":{"value":"Formed by adding the prefix 'hyper-' (meaning 'excessively' or 'extremely') to 'constitutionally'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌkɒnstɪˈtjuːʃənəli/","syllables":"hy-per-con-sti-tu-tion-al-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"'Hyperconstitutionally' is a relatively uncommon word used to describe actions, interpretations, or adherence to constitutional principles in an extreme or excessive manner. It often implies that the strict adherence to constitutionalism may be impractical or lead to unintended consequences.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["hyperconstitutional (adjective)"],"related_terms":["constitutional","constitutionality"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'hyperconstitutionally' is a highly specialized term, primarily used in legal and political discourse. It signifies an extreme or excessive adherence to constitutional principles, often implying that such strict adherence may lead to impractical or unintended outcomes. Due to its specialized nature and low frequency of use, it is typically encountered by those with advanced knowledge of law, political science, or related fields."},"example_sentences":[{"sentence":"The court's decision was criticized for interpreting the statute hyperconstitutionally.","translation":"裁判所の判決は、法律を極めて憲法に則って解釈したとして批判された。","type":"adverb","meaning_category":"憲法に則って"}]}