{"word":"Spitfrog","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional creature or character, often used in fantasy or science fiction settings. Its defining characteristic is the ability to spit or project some substance, such as venom, acid, or projectiles, from its mouth.","english_definition":"A fictional creature or character, often used in fantasy or science fiction settings. Its defining characteristic is the ability to spit or project some substance, such as venom, acid, or projectiles, from its mouth.","examples":[{"sentence":"The heroes were ambushed by a pack of Spitfrogs in the dark forest.","translation":"英雄たちは暗い森の中でスピットフロッグの群れに待ち伏せされた。"},{"sentence":"The Spitfrog's venomous spit can paralyze its prey instantly.","translation":"スピットフロッグの有毒な唾液は獲物を即座に麻痺させることができる。"},{"sentence":"Legend says the Spitfrog guards the entrance to the hidden cave.","translation":"伝説によると、スピットフロッグは隠された洞窟の入り口を守っている。"}],"collocations":["venomous spitfrog","giant spitfrog","baby spitfrog","spitfrog attack","spitfrog venom"],"synonyms":["venomspitter","acidspewer","projectile frog","spit toad","spitting amphibian"],"antonyms":[]}],"etymology":{"value":"A compound word combining 'spit,' referring to the act of ejecting something from the mouth, and 'frog,' indicating an amphibian. The name suggests a frog-like creature with the ability to spit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɪtfroɡ/","syllables":"spit-frog"},"inflection":{"noun_plural":"Spitfrogs"},"usage_notes":{"explanation":"'Spitfrog' is typically a made-up word for fantasy or science fiction contexts. It's used to describe a creature that has frog-like characteristics combined with the ability to spit some kind of substance. The exact nature of the spit (venom, acid, projectiles) can vary depending on the fictional setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a real spitfrog in the zoo!","correct":"✓ I read about a spitfrog in a fantasy novel.","note":"Spitfrogs are fictional creatures, not real animals. Therefore, you wouldn't see one in a real-world setting like a zoo."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_creatures":["poison dart frog","giant toad","salamander","basilisk"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (fictional word)","frequency_google_ngram":"Low (due to being a fictional term)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Spitfrog' is a fictional word, so its readability depends on the context in which it's used. In fantasy or science fiction literature, readers familiar with the genre will likely understand it as a creature with frog-like features and the ability to spit. The word is relatively easy to understand due to its straightforward combination of 'spit' and 'frog.'"},"example_sentences":[{"sentence":"The brave knight faced the fearsome Spitfrog, ready to defend the kingdom.","translation":"勇敢な騎士は、王国を守るために、恐ろしいスピットフロッグに立ち向かった。","type":"fictional context","meaning_category":"fantasy creature"},{"sentence":"The scientist discovered a new species of Spitfrog in the Amazon rainforest.","translation":"科学者はアマゾンの熱帯雨林でスピットフロッグの新種を発見した。","type":"fictional context","meaning_category":"science fiction creature"}]}