{"word":"portolan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な)海図、航海図 (特に中世から17世紀にかけて地中海やヨーロッパ沿岸で使用されたもの)","english_definition":"a nautical chart of the Middle Ages and Renaissance, used especially in the Mediterranean, characterized by lines radiating from compass points and showing coastlines and harbors.","examples":[{"sentence":"The portolan charts were essential tools for navigation in the Mediterranean Sea.","translation":"ポルトラーノ海図は、地中海での航海に不可欠な道具でした。"},{"sentence":"Many portolans are beautifully decorated with illustrations of ships and sea monsters.","translation":"多くのポルトラーノ海図は、船や海の怪物などのイラストで美しく装飾されています。"}],"collocations":["portolan chart","portolan atlas","medieval portolan"],"synonyms":["nautical chart","sea chart","navigation chart"],"antonyms":[]}],"etymology":{"value":"イタリア語の「portolano」に由来し、「港の案内書」または「水先案内人」を意味する。これは、ラテン語の「portus」（港）から派生した。初期のポルトラーノ海図は、主に港の位置と沿岸の形状を示すことに重点を置いていたため、この名前が付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːrtələn/","syllables":"por-to-lan"},"inflection":{"noun_plural":"portolans"},"usage_notes":{"explanation":"「**portolan**」は、歴史的な文脈でのみ使用される専門用語です。現代の海図とは異なり、ポルトラーノ海図は磁気方位と距離に基づいており、緯度と経度の正確な測定は含まれていませんでした。それらは、熟練した航海士によって沿岸航行のために使用され、地中海やヨーロッパ沿岸の航海に特に役立ちました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a portolan to find the latitude.","correct":"✓ He used a sextant to find the latitude. / ✓ He used a portolan to navigate along the coast.","note":"ポルトラーノ海図は緯度を正確に測定するために使用されませんでした。緯度を測定するには六分儀などの器具が使用されました。ポルトラーノ海図は沿岸航行に使われました。"},{"incorrect":"✗ Portolan maps are very accurate for global navigation.","correct":"✓ Portolan maps are accurate for coastal navigation in specific regions.","note":"ポルトラーノ海図は特定の地域、特に地中海の沿岸航行には正確でしたが、地球規模の航行には適していませんでした。"}],"priority":"★★☆"},"related_words":{"derivatives":["port (名詞: 港)","pilot (名詞: 水先案内人)"],"historical_terms":["compass rose (方位図)","rhumb line (航程線)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (歴史、航海史の専門分野)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**portolan**」という単語は、歴史的な航海図を指す専門用語であり、一般的には使用されません。特に中世からルネサンス期にかけて、地中海地域で使用された航海図を指します。これらの海図は、現代の地図とは異なり、沿岸の形状や港の位置を示すことに重点が置かれていました。歴史、地理、航海史などの文脈で登場する可能性があります。"},"example_sentences":[{"sentence":"The museum displayed a rare 14th-century portolan chart.","translation":"博物館は、14世紀の貴重なポルトラーノ海図を展示していた。","type":"noun","meaning_category":"海図"},{"sentence":"Portolan charts were crucial for Mediterranean trade routes.","translation":"ポルトラーノ海図は、地中海の貿易ルートにとって非常に重要だった。","type":"noun","meaning_category":"海図"},{"sentence":"The cartographer carefully drew the coastlines on the portolan.","translation":"地図製作者は、ポルトラーノ海図に沿岸線を注意深く描いた。","type":"noun","meaning_category":"海図"}]}