{"word":"alethiology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"真理学、真理論","english_definition":"The study of the nature of truth.","examples":[{"sentence":"Alethiology is a branch of philosophy concerned with the concept of truth.","translation":"真理学は真理の概念に関わる哲学の一分野である。"},{"sentence":"Different theories of truth are explored within alethiology.","translation":"真理学の中では、様々な真理の理論が探求される。"}],"collocations":["theory of truth","philosophical inquiry","epistemology"],"synonyms":["truth theory","philosophy of truth"],"antonyms":["fallacy","error"]}],"etymology":{"value":"From the Greek words ἀλήθεια (aletheia) meaning \"truth\" and -λογία (-logia) meaning \"study of\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌælɪˈθiːˈɒlədʒi/","syllables":"a-le-thi-o-lo-gy"},"inflection":{"noun_plural":"alethiologies"},"usage_notes":{"explanation":"Alethiology is a specialized term in philosophy, specifically within metaphysics and epistemology. It deals with questions such as: What is truth? How do we define truth? What makes a statement true? It's not a commonly used word outside of academic philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Alethiology is the study of alleles in genetics.","correct":"✓ Alethiology is the study of truth.","note":"Alethiology is related to truth, not genetics."}],"priority":"★★☆"},"related_words":{"derivatives":["alethic (adjective: relating to truth or modality)"],"related_terms":["epistemology (認識論)","metaphysics (形而上学)","logic (論理学)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in academic philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alethiology' is a highly specialized term used in philosophy. It refers to the study of truth itself, exploring different theories and concepts related to what makes something true. This term is rarely encountered outside of academic philosophical discussions. Understanding requires familiarity with philosophical terminology and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor lectured on various approaches to alethiology.","translation":"教授は真理学への様々なアプローチについて講義した。","type":"general","meaning_category":"真理学"},{"sentence":"One of the central questions in alethiology is whether truth is objective or subjective.","translation":"真理学における中心的な問いの一つは、真理が客観的か主観的かということである。","type":"philosophical","meaning_category":"真理学"}]}