{"word":"true-thought","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)真実の思考、真実を反映した思考、真理に基づいた考え","english_definition":"A thought that accurately reflects reality or aligns with truth; a thought based on truth or reality.","examples":[{"sentence":"The philosopher dedicated his life to the pursuit of true-thought.","translation":"その哲学者は真実の思考を追求することに生涯を捧げた。"},{"sentence":"Only through rigorous analysis can we arrive at true-thought.","translation":"厳密な分析を通してのみ、真実の思考に到達することができる。"},{"sentence":"His writings are filled with examples of true-thought and profound insight.","translation":"彼の著作は、真実の思考と深遠な洞察の例で満たされている。"}],"collocations":["pursuit of true-thought (真実の思考の追求)","arrive at true-thought (真実の思考に到達する)","based on true-thought (真実の思考に基づいた)","reflection of true-thought (真実の思考の反映)"],"synonyms":["truthful thought","veridical thought","accurate thought","valid thought","sound reasoning","correct thinking"],"antonyms":["false thought","misconception","delusion","fallacy","error","untruth"],"notes":"This term is often used in philosophical or academic contexts."}],"etymology":{"value":"A compound word formed by combining 'true' (representing accuracy and conformity to fact) and 'thought' (the process of thinking or the product of mental activity). The hyphenated form suggests a specific, unified concept.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtruː θɔːt/","syllables":"true-thought"},"inflection":{"noun_plural":"true-thoughts"},"usage_notes":{"explanation":"'True-thought' is a relatively uncommon term, primarily found in philosophical or academic discussions. It emphasizes the alignment of thought with objective reality or truth. It's often used to distinguish accurate and valid thinking from flawed or biased thought processes. The term implies a rigorous and careful approach to thinking, aiming to eliminate errors and misconceptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a true thought about the weather.","correct":"✓ He had a correct thought about the weather.","note":"In everyday contexts, 'correct thought' or 'accurate thought' is more common than 'true-thought' when referring to a simple factual matter. 'True-thought' is better suited for more profound or philosophical concepts."},{"incorrect":"✗ The true-thought is always easy to find.","correct":"✓ The truth is not always easy to find.","note":"'True-thought' refers to the *process* or *result* of thinking truthfully, not to truth itself. Use 'truth' when referring to the state of being in accordance with fact or reality."}],"priority":"★★☆"},"related_words":{"derivatives":["truth (真実)","thought (思考)","truthful (真実の)","thoughtful (思慮深い)"],"related_concepts":["epistemology (認識論)","logic (論理)","rationality (合理性)","critical thinking (批判的思考)","veracity (真実性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'True-thought' is a specialized term primarily used in philosophical or academic contexts. It refers to thinking that accurately reflects reality or aligns with truth. Understanding this term requires familiarity with abstract concepts related to epistemology (the study of knowledge) and critical thinking. It's not commonly used in everyday language, so encountering it usually indicates a discussion of complex or theoretical ideas."},"example_sentences":[{"sentence":"The goal of education should be to cultivate the capacity for true-thought in students.","translation":"教育の目標は、生徒の中に真実の思考を育む能力を培うことであるべきだ。","type":"noun","meaning_category":"真実の思考"},{"sentence":"Skepticism can be a valuable tool in the pursuit of true-thought, as it encourages us to question assumptions.","translation":"懐疑主義は、前提を疑うことを促すため、真実の思考を追求する上で貴重なツールとなりうる。","type":"noun","meaning_category":"真実の思考"},{"sentence":"The scientist's dedication to empirical evidence led him to true-thought about the nature of the universe.","translation":"科学者の経験的証拠への献身は、彼を宇宙の性質に関する真実の思考へと導いた。","type":"noun","meaning_category":"真実の思考"}]}