{"word":"hoariness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"白髪であること、白髪交じりであること、霜がかかっていること、古さ、由緒","english_definition":"The state of being hoary; grayness or whiteness especially with age; frostiness; antiquity.","examples":[{"sentence":"The hoariness of his beard gave him a distinguished look.","translation":"彼の髭の白髪交じりの様子は、彼に風格を与えた。"},{"sentence":"The hoariness of the ancient castle spoke of centuries of history.","translation":"その古代の城の古さは、何世紀にもわたる歴史を物語っていた。"},{"sentence":"The hoariness of the grass in the early morning was beautiful.","translation":"早朝の草に霜がかかっている様子は美しかった。"}],"collocations":["hoariness of age","hoariness of frost","hoariness of tradition"],"synonyms":["grayness","whiteness","frostiness","antiquity","venerability"],"antonyms":["youthfulness","newness","modernity"]}],"etymology":{"value":"From 'hoary' + '-ness'. 'Hoary' comes from Old English 'hār' meaning 'gray, old, venerable'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrinəs/","syllables":"hoar-i-ness"},"inflection":{"noun_plural":"hoarinesses"},"usage_notes":{"explanation":"'Hoariness' is a noun that describes the condition of being 'hoary'. 'Hoary' typically refers to being gray or white with age, like hair, or covered with frost. It can also refer to something very old and venerable. Therefore, 'hoariness' can describe the physical appearance of grayness or whiteness, the presence of frost, or the quality of being ancient and respected. It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The hoariness of the sun made it difficult to see.","correct":"The glare of the sun made it difficult to see.","note":"'Hoariness' refers to grayness, whiteness, frostiness, or antiquity, not brightness. Use 'glare' to describe the intense brightness of the sun."},{"incorrect":"He showed hoariness to his elders.","correct":"He showed respect to his elders.","note":"'Hoariness' is a physical or temporal quality, not a behavior. Use 'respect' to describe showing deference to elders."}],"priority":"★★☆"},"related_words":{"derivatives":["hoary (adjective)"],"phrasal_verbs":[],"related_nouns":["hoar (archaic term for frost)"],"related_adjectives":["gray","white","old","ancient","venerable"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hoariness' is a relatively uncommon and sophisticated word. It is best used in formal writing or speech when specifically referring to the state of being hoary, whether in terms of age-related grayness, frostiness, or antiquity. Due to its rarity, consider whether a more common synonym might be more appropriate for your audience."},"example_sentences":[{"sentence":"The **hoariness** of the mountains in winter was breathtaking.","translation":"冬の山々の白銀の様子は息をのむほど美しかった。","type":"noun","meaning_category":"frostiness"},{"sentence":"The **hoariness** of the manuscript suggested it was centuries old.","translation":"その原稿の古さは、それが何世紀も前のものだと示唆していた。","type":"noun","meaning_category":"antiquity"},{"sentence":"Despite the **hoariness** of his hair, he remained active and energetic.","translation":"髪の毛が白髪交じりであるにもかかわらず、彼は活動的でエネルギッシュなままであった。","type":"noun","meaning_category":"grayness"}]}