{"word":"trait-complex","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学)特性複合：複数の関連する性格特性が組み合わさって、特定の行動パターンや傾向を生み出すこと。","english_definition":"(psychology) A cluster of related personality traits that combine to produce a specific behavior pattern or tendency.","examples":[{"sentence":"The trait-complex of perfectionism often leads to high achievement but also to anxiety and burnout.","translation":"完璧主義の特性複合は、しばしば高い成果につながる一方で、不安や燃え尽き症候群にもつながる。"},{"sentence":"Understanding a person's trait-complexes can provide insights into their motivations and decision-making processes.","translation":"人の特性複合を理解することで、その人の動機や意思決定プロセスについての洞察が得られる。"}],"collocations":["perfectionism trait-complex (完璧主義の特性複合)","leadership trait-complex (リーダーシップの特性複合)","anxiety trait-complex (不安の特性複合)"],"synonyms":["personality profile","behavioral pattern","character cluster"],"antonyms":[]}],"etymology":{"value":"「trait」（特性）と「complex」（複合）の組み合わせ。性格心理学において、単一の特性だけでなく、複数の関連する特性が相互作用して行動に影響を与えるという概念を表すために作られた。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtreɪt ˌkɒmpleks/","syllables":"trait-com-plex"},"inflection":{"noun_plural":"trait-complexes"},"usage_notes":{"explanation":"「**trait-complex**」は、心理学、特に性格心理学の分野で使用される専門用語です。単一の性格特性（trait）だけでは説明できない、複雑な行動パターンや傾向を理解するために用いられます。例えば、外向性（extraversion）という特性だけでは、ある人がなぜ特定の状況でリーダーシップを発揮するのか、あるいは社交的な場面でどのように振る舞うのかを完全に説明することはできません。外向性に加えて、自信、共感性、コミュニケーション能力などの関連する特性が組み合わさることで、より包括的な理解が得られます。この複合的な特性の組み合わせが「trait-complex」です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a trait-complex of one trait.","correct":"✓ A trait-complex involves multiple traits.","note":"特性複合は、複数の特性の組み合わせを指すため、単一の特性で構成されることはありません。"},{"incorrect":"✗ The trait-complex is the same as a single trait.","correct":"✓ The trait-complex is a combination of multiple traits.","note":"特性複合は単一の特性とは異なり、複数の特性が相互作用して生じる行動パターンや傾向を説明する概念です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["trait (特性)","complex (複合)","personality (性格)","behavior (行動)"],"phrases":["Big Five personality traits (ビッグファイブ性格特性)","personality disorder (人格障害)","behavioral psychology (行動心理学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 心理学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**trait-complex**」は、心理学で使われる少し難しい言葉です。人の性格を理解するとき、一つの特徴（trait）だけを見るのではなく、いくつかの関連する特徴が組み合わさって、その人の行動や考え方に影響を与えていると考えます。この特徴の組み合わせを「trait-complex」と呼びます。例えば、ある人がとても几帳面だとします。これは「良心的」という性格特性ですが、それだけでなく、秩序を好む、計画性がある、責任感が強いといった他の特性も組み合わさっているかもしれません。これらの特性が合わさって、その人の行動パターンを形作っているのです。専門的な文脈で使われることが多い言葉です。"},"example_sentences":[{"sentence":"Researchers are studying the trait-complex associated with resilience in children.","translation":"研究者たちは、子供たちのレジリエンス（回復力）に関連する特性複合を研究している。","type":"noun","meaning_category":"心理学"},{"sentence":"The effectiveness of leadership depends on a complex interplay of personality traits, forming a leadership trait-complex.","translation":"リーダーシップの有効性は、性格特性の複雑な相互作用に依存しており、リーダーシップ特性複合を形成する。","type":"noun","meaning_category":"心理学"},{"sentence":"Understanding the trait-complex of creativity can help foster innovation in organizations.","translation":"創造性の特性複合を理解することは、組織におけるイノベーションを促進するのに役立つ。","type":"noun","meaning_category":"心理学"}]}