{"word":"Sphingosine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スフィンゴシン：長鎖アミノアルコールの一種で、スフィンゴ脂質の構成要素。細胞膜に存在し、細胞シグナル伝達に関与する。","english_definition":"A long-chain amino alcohol that is a key component of sphingolipids. It is found in cell membranes and is involved in cell signaling.","examples":[{"sentence":"Sphingosine is a lipid found in the cell membrane.","translation":"スフィンゴシンは細胞膜に見られる脂質です。"},{"sentence":"Sphingosine plays a role in cell signaling pathways.","translation":"スフィンゴシンは細胞シグナル伝達経路において役割を果たします。"}],"collocations":["sphingosine-1-phosphate (S1P)","sphingosine kinase","sphingosine metabolism"],"synonyms":["dihydrosphingosine"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「sphinx」（スフィンクス）に由来。ドイツの化学者ヨハン・ルートヴィヒ・ヴィルヘルム・テューディクムが、その構造の複雑さと謎めいた性質から名付けた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsfɪŋɡəˌsiːn/","syllables":"Sphin-go-sine"},"inflection":{"noun_plural":"Sphingosines"},"usage_notes":{"explanation":"Sphingosine is a complex lipid molecule that forms the backbone of sphingolipids, a class of lipids found in eukaryotic cell membranes. It is involved in various cellular processes, including cell signaling, apoptosis, and cell growth. Sphingosine can be phosphorylated to form sphingosine-1-phosphate (S1P), a potent signaling molecule with diverse biological activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sphingosine is a protein.","correct":"✓ Sphingosine is a lipid.","note":"Sphingosine is a type of lipid, not a protein."},{"incorrect":"✗ Sphingosine is only found in animal cells.","correct":"✓ Sphingosine is found in eukaryotic cells.","note":"Sphingosine and sphingolipids are found in eukaryotic cells, including animal, plant, and fungal cells."}],"priority":"★☆☆"},"related_words":{"derivatives":["sphingolipid","ceramide","sphingomyelin","sphingosine-1-phosphate"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 生化学、細胞生物学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Sphingosine is a complex biochemical term referring to a specific type of lipid molecule that is a key component of sphingolipids. Sphingolipids are found in the membranes of eukaryotic cells and play important roles in cell signaling and other cellular processes. Understanding sphingosine requires a background in biochemistry or cell biology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The enzyme sphingosine kinase phosphorylates sphingosine to form sphingosine-1-phosphate.","translation":"酵素スフィンゴシンキナーゼはスフィンゴシンをリン酸化してスフィンゴシン-1-リン酸を生成します。","type":"scientific","meaning_category":"biochemistry"},{"sentence":"Sphingosine levels are tightly regulated within the cell to maintain proper cellular function.","translation":"細胞機能の維持のために、スフィンゴシンのレベルは細胞内で厳密に調節されています。","type":"scientific","meaning_category":"cell biology"}]}