{"word":"Turkis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トルコ石 (ターコイズ)","english_definition":"An opaque, blue-to-green mineral that is a hydrated phosphate of copper and aluminum. It is valued as a gemstone.","examples":[{"sentence":"She wore a necklace made of Turkis.","translation":"彼女はトルコ石でできたネックレスを身に着けていた。"},{"sentence":"The ring featured a beautiful Turkis stone.","translation":"その指輪には美しいトルコ石がはめ込まれていた。"}],"collocations":["Turkis necklace","Turkis ring","Turkis stone","genuine Turkis","artificial Turkis"],"synonyms":["turquoise"],"antonyms":[]},{"part_of_speech":"adjective","definition":"トルコ石の色をした、ターコイズブルーの","english_definition":"Of a light bluish-green color, like that of the gemstone turquoise.","examples":[{"sentence":"The water was a clear Turkis blue.","translation":"水は澄んだターコイズブルーだった。"},{"sentence":"She painted the walls a Turkis color.","translation":"彼女は壁をターコイズ色に塗った。"}],"collocations":["Turkis blue","Turkis green","Turkis color"],"synonyms":["turquoise","turquoise blue","bluish-green"],"antonyms":[]}],"etymology":{"value":"The word \"Turkis\" comes from the Old French phrase \"pierre turquoise,\" meaning \"Turkish stone,\" as the mineral was originally brought to Europe through Turkey.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrkɪs/","syllables":"Tur-kis"},"inflection":{"notes":"The word \"Turkis\" can function as both a noun and an adjective. As a noun, it is typically uncountable, but can be countable when referring to individual stones. As an adjective, it does not inflect."},"usage_notes":{"explanation":"The term \"Turkis\" is an older or less common spelling of \"turquoise.\" While \"turquoise\" is the more widely accepted and used term in modern English, \"Turkis\" is still recognizable and understood, particularly in contexts referring to the gemstone or its color.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a turkis gemstone. (misspelling)","correct":"✓ I bought a turquoise gemstone.","note":"The correct spelling is \"turquoise,\" not \"turkis.\""},{"incorrect":"✗ The turkis are very expensive.","correct":"✓ Turquoise is very expensive.","note":"When referring to the gemstone in general, use the uncountable form \"turquoise.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Turquoise (more common spelling)"],"phrases":["Turquoise jewelry","Turquoise blue","Turquoise green"]},"level_frequency":{"CEFR":"B2 (due to specialized vocabulary related to gemstones and colors)","frequency_google_ngram":"Relatively low frequency compared to \"turquoise.\"","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Turkis\" is an alternative spelling of \"turquoise,\" which refers to a blue-green gemstone and the color associated with it. While \"turquoise\" is the more common spelling, understanding \"Turkis\" can be helpful when encountering older texts or specific contexts where this spelling is used. The word is generally used in discussions about jewelry, minerals, and color descriptions.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed ancient Turkis artifacts.","translation":"博物館は古代のトルコ石の工芸品を展示していた。","type":"noun","meaning_category":"gemstone"},{"sentence":"She wore a dress of Turkis silk.","translation":"彼女はトルコ石色のシルクのドレスを着ていた。","type":"adjective","meaning_category":"color"}]}