{"word":"monist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"一元論者","english_definition":"A person who believes in monism, the philosophical view that all is one, that there is only one ultimate substance or principle.","examples":[{"sentence":"As a monist, he believed that mind and matter were ultimately the same thing.","translation":"一元論者として、彼は精神と物質は究極的には同じものであると信じていた。"},{"sentence":"Many ancient philosophers were monists, seeking to find the single underlying reality.","translation":"多くの古代の哲学者は一元論者であり、唯一の根底にある現実を見つけようと努めていた。"}],"collocations":["philosophical monist","religious monist","dualist vs. monist"],"synonyms":["unitarist","holist"],"antonyms":["dualist","pluralist"]},{"part_of_speech":"adjective","definition":"一元論の","english_definition":"Relating to or characterized by monism.","examples":[{"sentence":"The monist perspective emphasizes the interconnectedness of all things.","translation":"一元論的な視点は、すべてのものの相互接続性を強調する。"},{"sentence":"Monist philosophies often seek to reconcile seemingly disparate elements into a unified whole.","translation":"一元論的な哲学は、しばしば一見異質な要素を統一された全体に調和させようとする。"}],"collocations":["monist philosophy","monist view","monist theory"],"synonyms":["unitary","holistic"],"antonyms":["dualistic","pluralistic"]}],"etymology":{"value":"From 'monism' + '-ist'. 'Monism' is from Greek 'monos' meaning 'single, alone'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒnɪst/","syllables":"mon-ist"},"inflection":{"noun_plural":"monists"},"usage_notes":{"explanation":"'Monist' refers to someone who adheres to the philosophical doctrine of monism. Monism posits that reality is ultimately composed of only one substance or principle. This contrasts with dualism, which asserts the existence of two fundamental and distinct substances (e.g., mind and matter), and pluralism, which posits multiple fundamental substances. The term is primarily used in philosophical and theological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a modernist.","correct":"✓ He is a monist.","note":"'Modernist' refers to someone associated with modernism, a cultural movement. 'Monist' refers to someone who believes in monism. These are distinct concepts."},{"incorrect":"✗ The theory is monopolist.","correct":"✓ The theory is monist.","note":"'Monopolist' refers to someone who controls a monopoly. 'Monist' refers to something related to monism."}],"priority":"★★☆"},"related_words":{"derivatives":["monism","monistic"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'monist' is a specialized term primarily used in philosophy and theology. It refers to someone who believes in monism, the idea that reality is ultimately one unified substance or principle. Understanding this term requires familiarity with philosophical concepts and abstract thought. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The philosopher was a staunch monist, arguing that all apparent diversity is ultimately illusory.","translation":"その哲学者は断固たる一元論者であり、すべての表面的な多様性は究極的には幻想であると主張した。","type":"noun","meaning_category":"一元論者"},{"sentence":"His monist worldview influenced his ethical beliefs, leading him to advocate for universal compassion.","translation":"彼の一元論的な世界観は彼の倫理的信念に影響を与え、普遍的な思いやりを提唱するようになった。","type":"adjective","meaning_category":"一元論の"}]}