{"word":"eudaimonist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"幸福主義者、至福主義者","english_definition":"One who adheres to eudaimonism, a system of ethics that bases morality on happiness or well-being.","examples":[{"sentence":"As a eudaimonist, she believed that the ultimate goal of life was to achieve eudaimonia.","translation":"幸福主義者として、彼女は人生の究極の目標はユーダイモニアを達成することだと信じていた。"},{"sentence":"Eudaimonists often debate the best way to cultivate virtues that lead to a fulfilling life.","translation":"幸福主義者は、充実した人生につながる徳を育む最良の方法についてしばしば議論する。"}],"collocations":["ethical eudaimonist","virtue eudaimonist"],"synonyms":["hedonist (快楽主義者 - ただし、幸福の定義が異なる)","humanist"],"antonyms":["nihilist","moral relativist"]},{"part_of_speech":"adjective","definition":"幸福主義の、至福主義の","english_definition":"Relating to or characteristic of eudaimonism.","examples":[{"sentence":"The eudaimonist philosophy emphasizes the importance of living a virtuous life.","translation":"幸福主義の哲学は、道徳的な生活を送ることの重要性を強調する。"},{"sentence":"Eudaimonist ethics differ from utilitarian ethics in their focus on individual flourishing.","translation":"幸福主義倫理は、個人の繁栄に焦点を当てる点で、功利主義倫理とは異なる。"}],"collocations":["eudaimonist ethics","eudaimonist philosophy"],"synonyms":["virtue-based","flourishing-oriented"],"antonyms":["utilitarian","deontological"]}],"etymology":{"value":"Derived from 'eudaimonia' (Greek εὐδαιμονία), meaning 'happiness' or 'flourishing,' combined with the suffix '-ist,' indicating a person who adheres to or believes in something.","priority":"★★★"},"pronunciation":{"ipa":"/juːˈdaɪməˌnɪst/","syllables":"eu-dai-mo-nist"},"inflection":{"noun_plural":"eudaimonists"},"usage_notes":{"explanation":"The term 'eudaimonist' refers to someone who subscribes to eudaimonism. Eudaimonism is a philosophical theory that defines the good life as one of 'eudaimonia,' often translated as 'happiness,' 'well-being,' or 'flourishing.' However, it's important to note that 'eudaimonia' is not simply a feeling of happiness but rather a state of living well and doing well, often associated with virtue and reason. A eudaimonist believes that ethical actions are those that contribute to this state of flourishing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a eudaimonist because he seeks pleasure.","correct":"✓ He is a eudaimonist because he seeks a life of virtue and meaning.","note":"Eudaimonism is not simply about seeking pleasure (which is more aligned with hedonism). It's about living a virtuous and meaningful life. Pleasure might be a byproduct, but it's not the primary goal."},{"incorrect":"✗ Eudaimonist is the same as utilitarian.","correct":"✓ Eudaimonism and utilitarianism are different ethical theories.","note":"Eudaimonism focuses on individual flourishing and virtue, while utilitarianism focuses on maximizing overall happiness or well-being for the greatest number of people."}],"priority":"★★☆"},"related_words":{"derivatives":["eudaimonia","eudaimonic","eudaimonism"],"related_concepts":["virtue ethics","Aristotelian ethics","flourishing","well-being"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eudaimonist' is a term used in philosophy, specifically in ethics. It refers to someone who believes in eudaimonism, which is a theory that says the most important thing in life is to live well and flourish. This isn't just about feeling happy; it's about living a life of virtue and purpose. The word is not commonly used outside of philosophical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The eudaimonist argued that true happiness comes from living a life of purpose and virtue.","translation":"その幸福主義者は、真の幸福は目的と徳のある生活を送ることから来ると主張した。","type":"noun","meaning_category":"幸福主義者"},{"sentence":"A eudaimonist approach to education would focus on developing students' character and moral reasoning.","translation":"教育への幸福主義的アプローチは、生徒の性格と道徳的推論能力を開発することに焦点を当てるだろう。","type":"adjective","meaning_category":"幸福主義の"}]}