{"word":"seven-formed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"七つの形を持つ、七つの部分から成る","english_definition":"having seven forms or parts.","examples":[{"sentence":"The ancient deity was described as seven-formed, each aspect representing a different element.","translation":"古代の神は七つの形を持つとされ、それぞれの側面が異なる要素を表していた。"},{"sentence":"The crystal structure was seven-formed, indicating a complex molecular arrangement.","translation":"その結晶構造は七つの部分から成り、複雑な分子配置を示していた。"}],"collocations":["seven-formed crystal","seven-formed deity","seven-formed pattern"],"synonyms":["heptamorphic","septiform"],"antonyms":["single-formed","uniform"]}],"etymology":{"value":"The word \"seven-formed\" is a compound adjective derived from the numeral \"seven\" and the past participle of the verb \"form.\" It directly describes something that has seven distinct shapes or components.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɛvənˌfɔrmd","syllables":"sev-en-formed"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for compound adjectives like \"seven-formed.\""},"usage_notes":{"explanation":"The adjective \"seven-formed\" is relatively rare and is typically used in technical or descriptive contexts where the specific number of forms or parts is relevant. It is more commonly found in specialized fields such as mythology, crystallography, or biology, where the number seven holds particular significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The seven-formed creature was form seven.","correct":"✓ The seven-formed creature had seven forms.","note":"The correct phrasing is to use \"had seven forms\" rather than \"was form seven\" to describe the creature's multiple forms."}],"priority":"★☆☆"},"related_words":{"derivatives":["sevenfold (adjective, adverb): seven times as great or numerous","form (noun, verb): shape, structure; to create, shape"],"compounds":["seven-sided","seven-membered"]},"level_frequency":{"CEFR":"N/A (not commonly found in general language learning contexts)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'seven-formed' is a niche adjective used to describe something with seven distinct forms or components. Due to its specificity, it's rarely encountered outside of specialized contexts such as mythology, crystallography, or advanced scientific descriptions. Understanding the term requires a grasp of compound adjective formation and a familiarity with contexts where numerical prefixes are used descriptively."},"example_sentences":[{"sentence":"The ancient text described a seven-formed dragon with a head for each element.","translation":"古代のテキストには、各要素の頭を持つ七つの形をしたドラゴンが記述されていた。","type":"general"},{"sentence":"The mineral exhibited a seven-formed crystalline structure under microscopic analysis.","translation":"その鉱物は、顕微鏡分析で七つの部分から成る結晶構造を示した。","type":"technical"}]}