{"word":"misericord","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（聖歌隊席の）折り畳み椅子の裏にある小さな棚状の座席、慈悲席","english_definition":"a small wooden bracket on the underside of a hinged seat in a choir stall, providing support for someone standing for long periods.","examples":[{"sentence":"The misericords in the cathedral are beautifully carved.","translation":"その大聖堂のミゼリコードは美しく彫刻されている。"},{"sentence":"Misericords were designed to offer a degree of comfort during long church services.","translation":"ミゼリコードは、長時間の教会礼拝中にいくらかの快適さを提供するように設計された。"}],"collocations":["carved misericord","choir stall misericord"],"synonyms":["mercy seat","tip-up seat support"],"antonyms":[]},{"part_of_speech":"noun","definition":"（歴史的な意味で）慈悲、憐れみ","english_definition":"(historical) mercy; compassion.","examples":[{"sentence":"In medieval times, the granting of a misericord could mean the difference between life and death.","translation":"中世において、ミゼリコードを与えることは生と死を分けることになり得た。"}],"collocations":["grant a misericord","show misericord"],"synonyms":["mercy","compassion","pity"],"antonyms":["cruelty","harshness"]}],"etymology":{"value":"Old French *misericorde* (pity, compassion), from Latin *misericordia* (pity, compassion), from *misericors* (compassionate), from *misereri* (to pity) + *cor* (heart).","priority":"★★☆"},"pronunciation":{"ipa":"/mɪˈzɛrɪkɔːrd/","syllables":"mi-ser-i-cord"},"inflection":{"noun_plural":"misericords"},"usage_notes":{"explanation":"The term 'misericord' primarily refers to the hinged seat support in choir stalls, designed to provide a small degree of rest for clergy during long periods of standing. It can also refer to the historical concept of mercy, although this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sat on the misericord.","correct":"✓ He leaned on the misericord.","note":"Misericords are not meant to be sat on directly, but rather leaned against for support while standing."}],"priority":"★☆☆"},"related_words":{"derivatives":["misericordia (Latin)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈（美術史、建築史、教会史など）でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"misericord\" is a relatively uncommon term, primarily encountered in the context of historical architecture and religious studies. It refers to a specific feature found in some church choir stalls: a small, projecting ledge on the underside of a hinged seat, designed to provide a degree of support for someone standing for extended periods. Understanding this term requires some familiarity with church architecture and historical practices. It can also refer to the historical concept of mercy or compassion, though this use is less common.","priority":"★☆☆"},"example_sentences":[{"sentence":"The guide pointed out the intricate carvings on the cathedral's misericords.","translation":"ガイドは大聖堂のミゼリコードの複雑な彫刻を指摘した。","type":"noun","meaning_category":"座席"},{"sentence":"Each misericord in the chapel tells a different story through its carvings.","translation":"礼拝堂の各ミゼリコードは、その彫刻を通して異なる物語を語っている。","type":"noun","meaning_category":"座席"},{"sentence":"The king showed misericord to the prisoners of war.","translation":"王は戦争捕虜に慈悲を示した。","type":"noun","meaning_category":"慈悲 (historical)"}]}