{"word":"haylage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乾草サイレージ、予乾牧草","english_definition":"Forage (such as grass or alfalfa) that has been cut and allowed to wilt, then stored without drying completely, and fermented in the absence of air.","examples":[{"sentence":"The farmer fed the cows haylage during the winter months.","translation":"農家は冬の間、牛に乾草サイレージを与えた。"},{"sentence":"Haylage is a popular feed for horses due to its high nutritional value.","translation":"乾草サイレージは栄養価が高いため、馬の飼料として人気がある。"}],"collocations":["feed haylage","make haylage","store haylage","high-quality haylage"],"synonyms":["silage","forage","preserved forage"],"antonyms":["hay","pasture"]}],"etymology":{"value":"A blend of 'hay' and 'silage'. The term reflects the fact that haylage is a type of silage made from forage that has been partially dried like hay before being ensiled.","priority":"★★★"},"pronunciation":{"ipa":"/ˈheɪlɪdʒ/","syllables":"hay-lage"},"inflection":{"noun_plural":"haylages"},"usage_notes":{"explanation":"Haylage is a type of animal feed made from grasses or other green forage crops that are cut and allowed to wilt (partially dry) before being stored in a silo or wrapped in plastic to ferment. This process preserves the feed and makes it available for use during times when fresh pasture is not available, such as winter. It has a higher moisture content than hay but less than silage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I fed the horses haylages.","correct":"✓ I fed the horses haylage.","note":"Haylage is often treated as an uncountable noun, especially in general contexts. While 'haylages' is technically the plural form, it's less commonly used unless referring to different types or batches of haylage."},{"incorrect":"✗ Haylage is just dried grass.","correct":"✓ Haylage is partially dried and fermented grass.","note":"Haylage is not simply dried grass like hay. It undergoes a fermentation process similar to silage, which helps preserve it and improve its nutritional value."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["silage","hay","forage","ensiling","fermentation"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Haylage is a specialized term in agriculture, specifically referring to a type of animal feed. It's a blend between hay and silage, where grasses or other forage crops are cut, partially dried (wilted), and then fermented in the absence of air. This process helps preserve the feed. The term is not commonly used outside of farming or animal husbandry contexts."},"example_sentences":[{"sentence":"The dairy farmer relies on haylage to provide consistent nutrition for his cows throughout the year.","translation":"その酪農家は、一年を通して牛に安定した栄養を供給するために、乾草サイレージに頼っている。","type":"noun","meaning_category":"animal feed"},{"sentence":"Proper ensiling techniques are crucial for producing high-quality haylage.","translation":"高品質の乾草サイレージを生産するには、適切なサイレージ調製技術が不可欠である。","type":"noun","meaning_category":"agricultural process"}]}