{"word":"Tithonus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ティートーノス：ギリシア神話に登場する人物。トロイアの王子で、曙の女神エオスの恋人。エオスがゼウスに頼んで不死の命を与えられたが、永遠の若さを願うのを忘れ、年老いて衰弱し、最後はコオロギになったとされる。","english_definition":"In Greek mythology, Tithonus was a Trojan prince beloved by Eos, goddess of the dawn. Eos asked Zeus to grant him immortality, but she forgot to ask for eternal youth, so he aged and withered, eventually turning into a cicada.","examples":[{"sentence":"The story of Tithonus is a cautionary tale about the importance of asking for both immortality and eternal youth.","translation":"ティートーノスの物語は、不死と永遠の若さの両方を願うことの重要性についての教訓的な物語である。"},{"sentence":"Tennyson's poem 'Tithonus' explores the tragedy of living forever in old age.","translation":"テニスンの詩『ティートーノス』は、老いたまま永遠に生きることの悲劇を探求している。"}],"collocations":["Tithonus myth (ティートーノスの神話)","Tithonus complex (ティートーノスコンプレックス：老化に対する恐怖や嫌悪感)","Tithonus-like (ティートーノスのような：不死だが老衰した)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ギリシア語の Τιθωνός (Tithōnós) に由来する。語源は不明。","priority":"★★☆"},"pronunciation":{"ipa":"/tɪˈθoʊnəs/","syllables":"Ti-tho-nus"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Tithonus**」は、主にギリシア神話に登場する人物の名前として使われます。彼の物語は、不死の命を得ても永遠の若さを得なければ、それは祝福ではなく呪いとなるという教訓を含んでいます。文学作品や芸術作品では、老いに対する恐怖や、不完全な不死の象徴として用いられることがあります。心理学の分野では、老化に対する過度な恐怖や嫌悪感を指す「Tithonus complex（ティートーノスコンプレックス）」という用語も存在します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tithonus was a god.","correct":"✓ Tithonus was a mortal prince.","note":"ティートーノスは神ではなく、人間の王子でした。"},{"incorrect":"✗ Eos asked for eternal life and youth for Tithonus.","correct":"✓ Eos asked for eternal life, but forgot to ask for eternal youth.","note":"エオスは永遠の命は願いましたが、永遠の若さを願うのを忘れてしまいました。"}],"priority":"★★☆"},"related_words":{"derivatives":["Tithonic (形容詞: ティートーノスのような)"],"related_characters":["Eos (エオス：曙の女神、ティートーノスの恋人)","Zeus (ゼウス：神々の王)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (神話や文学に精通している必要があるため)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではほとんど使われません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Tithonus**」は、ギリシア神話に登場する人物の名前であり、一般的にはあまり馴染みのない単語です。彼の物語は、不死の命と永遠の若さの関係について考察する際に引用されることがあります。文学作品や哲学的な議論で言及されることがありますが、日常会話で使われることはほとんどありません。神話や古典文学に興味がある人にとっては知っておくと良いでしょう。"},"example_sentences":[{"sentence":"The aged protagonist in the novel resembled **Tithonus**, cursed with immortality but devoid of youth.","translation":"小説の老いた主人公は、不死の呪いをかけられながらも若さを失ったティートーノスを彷彿とさせた。","type":"noun","meaning_category":"神話の人物"},{"sentence":"The artist depicted **Tithonus** as a frail, withered old man reaching for the dawn.","translation":"その芸術家は、ティートーノスを、夜明けに手を伸ばす、虚弱でしおれた老人として描いた。","type":"noun","meaning_category":"神話の人物"},{"sentence":"The poem reflects on the **Tithonus** myth, exploring the burden of eternal life without eternal youth.","translation":"その詩は、ティートーノスの神話を反映し、永遠の若さのない永遠の命の重荷を探求している。","type":"noun","meaning_category":"神話の人物"}]}