{"word":"sun-printed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of fabric or other materials) decorated with a design created by exposing areas to sunlight while others are covered, resulting in a print based on differential fading or color change.","english_definition":"decorated with a design created by exposing areas to sunlight while others are covered, resulting in a print based on differential fading or color change.","examples":[{"sentence":"She wore a sun-printed dress with floral patterns.","translation":"彼女は花柄の太陽プリントのドレスを着ていた。"},{"sentence":"The children made sun-printed artwork using leaves and paper.","translation":"子供たちは葉っぱと紙を使って太陽プリントのアート作品を作った。"}],"collocations":["sun-printed fabric","sun-printed design","sun-printed artwork","sun-printed pattern"],"synonyms":["sun-dyed","photo-printed","light-sensitive print"],"antonyms":["conventionally dyed","screen-printed"]}],"etymology":{"value":"A compound word formed from 'sun' (referring to sunlight) and 'printed' (referring to the process of creating a design on a surface). The term describes a specific printing technique that utilizes the sun's rays to create the design.","priority":"N/A"},"pronunciation":{"ipa":"ˈsʌnˌprɪntɪd","syllables":"sun-print-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Sun-printed' describes a technique where sunlight is used to create a design on fabric or paper. The process involves placing objects on the material and exposing it to the sun, causing the exposed areas to fade or change color while the covered areas remain darker, resulting in a print.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The fabric was sun print.","correct":"✓ The fabric was sun-printed.","note":"'Sun-printed' is the correct adjectival form. 'Sun print' can be used as a noun, but 'sun-printed' is preferred as an adjective."},{"incorrect":"✗ This is a sun print fabric.","correct":"✓ This is a sun-printed fabric.","note":"When using 'sun-printed' to describe a fabric, it should be used as a compound adjective before the noun."}],"priority":"N/A"},"related_words":{"derivatives":["sun-printing (noun: the process of creating sun-printed designs)"],"phrasal_verbs":[],"related_concepts":["cyanotype","solar printing","eco-printing"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a specialized term related to a specific printing technique.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Sun-printed' refers to a specific artistic or craft technique where sunlight is used to create a print on materials like fabric or paper. It involves placing objects on the material and exposing it to sunlight, resulting in a design based on the differential fading or color change. This term is mostly used in contexts related to arts, crafts, and textile design."},"example_sentences":[{"sentence":"The artist displayed several sun-printed canvases at the exhibition.","translation":"そのアーティストは展示会でいくつかの太陽プリントのキャンバスを展示した。","type":"adjective","meaning_category":"describing artwork"},{"sentence":"She learned how to make sun-printed scarves at the workshop.","translation":"彼女はワークショップで太陽プリントのスカーフの作り方を学んだ。","type":"adjective","meaning_category":"describing fabric"}]}