{"word":"frolicsomeness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"陽気さ、戯れ好き、ふざけ好き","english_definition":"The quality of being full of gaiety; playful behavior.","examples":[{"sentence":"The children's frolicsomeness filled the park with laughter.","translation":"子供たちの陽気さで公園は笑い声に満ち溢れた。"},{"sentence":"Her frolicsomeness was infectious, making everyone around her smile.","translation":"彼女の戯れ好きは伝染し、周りの人々を笑顔にした。"},{"sentence":"Despite his age, he retained a certain frolicsomeness.","translation":"彼は年齢にもかかわらず、ある種の陽気さを保っていた。"}],"collocations":["childlike frolicsomeness (子供のような陽気さ)","youthful frolicsomeness (若々しい陽気さ)","unrestrained frolicsomeness (抑制のない陽気さ)"],"synonyms":["playfulness","gaiety","merriment","joviality","lightheartedness","exuberance","vivacity"],"antonyms":["seriousness","solemnity","gravity","melancholy"]}],"etymology":{"value":"\"Frolic\" + \"-someness\". \"Frolic\" comes from the Dutch word \"vroolijk\" meaning merry or cheerful. The suffix \"-someness\" indicates a quality or state of being.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒlɪksəmnəs/","syllables":"frol-ic-some-ness"},"inflection":{"noun_plural":"frolicsomenesses (rarely used)"},"usage_notes":{"explanation":"\"Frolicsomeness\" describes a state or quality of being full of fun, play, and high spirits. It is often associated with children or animals, but can also describe adults who are behaving in a playful or lighthearted manner. It is a less common word than its root word, \"frolic,\" but it is useful for emphasizing the characteristic of being frolicsome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The frolicsomeness of the party.","correct":"✓ The frolicsomeness at the party.","note":"\"Frolicsomeness\" refers to a quality or state, so it's more natural to say \"frolicsomeness at the party\" rather than \"of the party\"."},{"incorrect":"✗ He showed frolicsomeness.","correct":"✓ He showed frolicsome behavior.","note":"\"Frolicsomeness\" is a noun. To describe the action, use \"frolicsome behavior\" or \"he behaved frolicsomely\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["frolic (verb, noun)","frolicsome (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Frolicsomeness\" is a relatively uncommon and advanced word that describes the quality of being playful, cheerful, and full of fun. It is a noun that refers to the general state or characteristic of being frolicsome. If you want to describe someone or something that is very playful and lighthearted, you can use this word. However, it's important to note that it is not frequently used in everyday conversation. A more common alternative is \"playfulness.\""},"example_sentences":[{"sentence":"The puppy's boundless frolicsomeness kept the children entertained for hours.","translation":"子犬の限りない陽気さが子供たちを何時間も楽しませた。","type":"noun","meaning_category":"陽気さ"},{"sentence":"There was a certain frolicsomeness in her eyes as she told the joke.","translation":"彼女が冗談を言うとき、その目にどこかふざけ好きの様子が見られた。","type":"noun","meaning_category":"戯れ好き"},{"sentence":"The frolicsomeness of the spring lambs was a welcome sight after the long winter.","translation":"長い冬の後、春の子羊たちの陽気さは歓迎すべき光景だった。","type":"noun","meaning_category":"陽気さ"}]}