{"word":"Cryoboly","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Geology, rare) The process of rock fracturing due to ice formation and expansion within pores and cracks.","english_definition":"The process of rock fracturing due to ice formation and expansion within pores and cracks.","examples":[{"sentence":"Cryoboly is a significant factor in shaping landscapes in cold climates.","translation":"氷晶破砕は、寒冷地の地形を形成する重要な要因です。"}],"collocations":["frost weathering","ice wedging","freeze-thaw weathering"],"synonyms":["frost weathering","ice wedging","freeze-thaw weathering"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'cryo-' (meaning 'cold' or 'ice') and 'bolē' (meaning 'a throw, beam, ray').","priority":"★★☆"},"pronunciation":{"ipa":"/kraɪˈɒbəli/","syllables":"Cry-o-bo-ly"},"inflection":{"noun_plural":"Cryobolies"},"usage_notes":{"explanation":"Cryoboly is a relatively rare term, more commonly referred to as frost weathering, ice wedging, or freeze-thaw weathering. It specifically describes the process of rock fracturing caused by the expansion of ice within the rock's structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Cryoboly is caused by chemical reactions.","correct":"Cryoboly is caused by the physical expansion of ice.","note":"Cryoboly is a physical weathering process, not a chemical one."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cryoclastic (adjective: relating to the breaking or shattering of rocks by frost action)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cryoboly' is a technical term used in geology to describe a specific type of physical weathering. It refers to the process where rocks are broken apart by the repeated freezing and thawing of water inside their cracks and pores. The expansion of ice creates pressure that eventually fractures the rock. This term is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The effects of cryoboly are evident in the talus slopes at the base of the mountain.","translation":"氷晶破砕の影響は、山の麓の崖錐斜面で明らかです。","type":"noun","meaning_category":"Geological process"},{"sentence":"Cryoboly contributes significantly to the erosion of exposed rock surfaces in alpine regions.","translation":"氷晶破砕は、高山地域の露出した岩石表面の浸食に大きく寄与しています。","type":"noun","meaning_category":"Geological process"}]}