{"word":"svastika","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"卍（まんじ）: 古代から使われる十字の腕が直角に曲がった図形。幸運や繁栄の象徴。ナチス・ドイツが逆向きの鉤十字をシンボルとして使用したため、ネガティブな意味合いを持つ場合もある。","english_definition":"An ancient symbol in the form of an equal-armed cross with each arm continued at a right angle, used (in clockwise form) as a symbol of good luck or well-being, and (in counterclockwise form) as a symbol of Nazi Germany.","examples":[{"sentence":"The swastika is an ancient religious symbol.","translation":"卍は古代の宗教的なシンボルです。"},{"sentence":"The Nazis adopted the swastika as their emblem.","translation":"ナチスは卍を彼らの紋章として採用しました。"},{"sentence":"The symbol has been used for thousands of years in various cultures, but it is now often associated with hate and racism due to its appropriation by the Nazi regime.","translation":"このシンボルは様々な文化で数千年もの間使われてきましたが、ナチス政権による流用のため、現在では憎悪と人種差別の象徴として関連付けられることが多いです。"}],"collocations":["ancient swastika (古代の卍)","nazi swastika (ナチスの卍)","religious swastika (宗教的な卍)","symbol of swastika (卍のシンボル)"],"synonyms":["hooked cross","fylfot","gammadion"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の「svastika」（स्वस्तिक）に由来し、「幸福をもたらすもの」「良い状態にある」という意味を持つ。「svasti」は「well-being（幸福、健康）」を意味し、「ka」は接尾辞。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswɒstɪkə/","syllables":"s-was-ti-ka"},"inflection":{"noun_plural":"svastikas"},"usage_notes":{"explanation":"「**svastika**」は、古代から様々な文化で使用されてきたシンボルですが、ナチス・ドイツが逆向きの鉤十字をシンボルとして使用したため、現代では非常にデリケートな意味合いを持つ単語です。使用する際には、文脈に十分注意し、誤解を招かないように配慮する必要があります。特に、ナチズムを擁護する意図がないことを明確にする必要があります。宗教的、歴史的な文脈で使用する場合は、その旨を明示することが重要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a swastika to show his support for peace.","correct":"✓ He wore a peace symbol to show his support for peace.","note":"卍はナチズムとの関連が強いため、平和の象徴としては不適切です。平和を支持する意図を示す場合は、平和のシンボルを使用するべきです。"},{"incorrect":"✗ The swastika is just a harmless symbol.","correct":"✓ The swastika is a complex symbol with a long history, but it is now often associated with hate and violence.","note":"卍は古代からの歴史を持つ複雑なシンボルですが、ナチズムとの関連により、現代では無害なシンボルとは言えません。"}],"priority":"★★☆"},"related_words":{"derivatives":["neo-nazi (ネオナチ)","fascism (ファシズム)","nazism (ナチズム)","anti-semitism (反ユダヤ主義)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われない。歴史、政治、宗教などの文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**svastika**」は、十字の形をしていて、それぞれの腕が直角に曲がっている古代のシンボルです。もともとは幸運や幸福を表す意味がありましたが、ナチス・ドイツがこのシンボルを使い始めたため、今では憎しみや差別を連想させることもあります。そのため、この言葉を使うときは、その歴史と意味をよく理解しておく必要があります。特に、ナチズムを支持する意味で使わないように注意しましょう。"},"example_sentences":[{"sentence":"The archaeologist discovered a swastika on an ancient artifact.","translation":"考古学者は古代の工芸品で卍を発見しました。","type":"noun","meaning_category":"古代のシンボル"},{"sentence":"The use of the swastika by the Nazi party has led to its association with hate speech.","translation":"ナチス党による卍の使用は、ヘイトスピーチとの関連につながりました。","type":"noun","meaning_category":"ナチスのシンボル"},{"sentence":"In some Eastern religions, the swastika is still used as a symbol of good fortune.","translation":"一部の東洋の宗教では、卍は今でも幸運のシンボルとして使用されています。","type":"noun","meaning_category":"宗教的なシンボル"}]}