{"word":"Gentoo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジェンツーペンギン","english_definition":"A penguin (Pygoscelis papua) of the Antarctic and sub-Antarctic regions, with a white stripe across its head.","examples":[{"sentence":"The Gentoo penguin is easily recognized by the broad white stripe extending like a bonnet across the top of its head.","translation":"ジェンツーペンギンは、頭のてっぺんにボンネットのように広がる白い縞模様で簡単に見分けられます。"}],"collocations":["Gentoo penguin colony","Gentoo chick","Gentoo habitat"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"Gentoo Linux","english_definition":"A Linux distribution known for its source-based package management system, Portage, and its high degree of customizability.","examples":[{"sentence":"Gentoo is a meta-distribution, meaning it provides the tools for users to build a system tailored to their specific needs.","translation":"Gentooはメタディストリビューションであり、ユーザーが特定のニーズに合わせてシステムを構築するためのツールを提供します。"},{"sentence":"Installing Gentoo can be a complex process, but it results in a highly optimized system.","translation":"Gentooのインストールは複雑なプロセスになることがありますが、高度に最適化されたシステムが完成します。"}],"collocations":["install Gentoo","Gentoo package manager","Gentoo Linux distribution"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name 'Gentoo' is uncertain. It may derive from the Portuguese 'gentio', meaning 'heathen' or 'non-Christian', which was applied to various groups, including some in India, and later transferred to the penguin. Another theory suggests a connection to the word 'turban' due to the white patch on the penguin's head resembling a head covering.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛntuː/","syllables":"Gen-too"},"inflection":{"noun_plural":"Gentoos"},"usage_notes":{"explanation":"'Gentoo' refers to two distinct entities: a species of penguin and a Linux distribution. When referring to the penguin, it is typically capitalized. When referring to the Linux distribution, it is also capitalized. Context is crucial to determine which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a gentoo penguin on the beach.","correct":"✓ I saw a Gentoo penguin on the beach.","note":"The penguin name should be capitalized."},{"incorrect":"✗ I installed gentoo on my computer.","correct":"✓ I installed Gentoo on my computer.","note":"The Linux distribution name should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":["Portage (Gentoo's package management system)","ebuild (Gentoo's package build description files)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Gentoo' has two primary meanings: a species of penguin and a Linux distribution. The term is relatively uncommon outside of specific contexts related to zoology or computer science. Understanding the context is essential to correctly interpret the intended meaning. The etymology of the word is uncertain, adding to its complexity."},"example_sentences":[{"sentence":"The **Gentoo** penguins waddled across the icy landscape.","translation":"ジェンツーペンギンは氷の風景の中をよたよたと歩いた。","type":"noun","meaning_category":"ジェンツーペンギン"},{"sentence":"He spent the weekend configuring his new **Gentoo** installation.","translation":"彼は週末を新しいGentooのインストール設定に費やした。","type":"noun","meaning_category":"Gentoo Linux"}]}