{"word":"MLR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(統計)重回帰 (分析) (Multiple Linear Regression)","english_definition":"(statistics) Multiple Linear Regression; a statistical technique that uses several explanatory variables to predict the outcome of a response variable.","examples":[{"sentence":"MLR is used to model the relationship between a dependent variable and two or more independent variables.","translation":"MLRは、従属変数と2つ以上の独立変数との関係をモデル化するために使用されます。"},{"sentence":"The MLR model showed a significant correlation between the variables.","translation":"MLRモデルは、変数間に有意な相関関係があることを示しました。"}],"collocations":["perform MLR","MLR analysis","MLR model","apply MLR","run an MLR"],"synonyms":["multiple regression","multivariate regression"],"antonyms":["simple linear regression"]}],"etymology":{"value":"An abbreviation for 'Multiple Linear Regression'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmˌɛlˈɑːr/","syllables":"EM-EL-AR"},"inflection":{"notes":"It's an acronym, so it doesn't inflect."},"usage_notes":{"explanation":"MLR is a statistical method used to model the relationship between a dependent variable and two or more independent variables. It is an extension of simple linear regression, which uses only one independent variable. MLR is commonly used in various fields such as economics, finance, and engineering to make predictions and understand the relationships between variables.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ MLR are a powerful tool.","correct":"✓ MLR is a powerful tool.","note":"MLR is treated as a singular entity, so use the singular form of the verb ('is')."},{"incorrect":"✗ Use MLR to find correlation.","correct":"✓ Use MLR to find correlations.","note":"When referring to multiple relationships, use the plural form of 'correlation'. However, the singular form is also acceptable depending on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["regression","linear regression","multiple regression analysis","independent variable","dependent variable"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"MLR stands for Multiple Linear Regression. It's a statistical method used to predict the value of one variable based on the values of two or more other variables. It's more complex than simple linear regression, which only uses one predictor variable. You'll typically encounter this term in statistics, data science, or research contexts."},"example_sentences":[{"sentence":"The researchers used MLR to analyze the factors affecting housing prices.","translation":"研究者たちは、住宅価格に影響を与える要因を分析するためにMLRを使用しました。","type":"example","meaning_category":"application"},{"sentence":"The MLR model accurately predicted customer behavior based on demographic data.","translation":"MLRモデルは、人口統計データに基づいて顧客の行動を正確に予測しました。","type":"example","meaning_category":"prediction"},{"sentence":"Before applying MLR, it's important to check for multicollinearity among the independent variables.","translation":"MLRを適用する前に、独立変数間の多重共線性を確認することが重要です。","type":"example","meaning_category":"consideration"}]}