{"word":"Kinbote","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional character in Vladimir Nabokov's novel *Pale Fire*.","english_definition":"A delusional narrator in Vladimir Nabokov's novel *Pale Fire*, Charles Kinbote is a scholar obsessed with the fictional kingdom of Zembla and its exiled king.","examples":[{"sentence":"Kinbote's elaborate commentary on Shade's poem reveals more about his own fantasies than about the poem itself.","translation":"キンボートによるシェイドの詩への手の込んだ注釈は、詩そのものよりも彼自身の空想について多くを明らかにしている。"}],"collocations":["delusional narrator","obsessed scholar","fictional kingdom of Zembla"],"synonyms":["Charles Kinbote"],"antonyms":[]}],"etymology":{"value":"A fictional name created by Vladimir Nabokov for his novel *Pale Fire*. The etymology is not explicitly stated, but the name suggests a combination of 'kin' (family, relation) and 'bote' (possibly related to 'boot' or 'burden'), hinting at themes of identity, exile, and fabricated connections.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈkɪnˌboʊt","syllables":"Kin-bote"},"inflection":{"notes":"Proper noun; does not inflect."},"usage_notes":{"explanation":"'Kinbote' is primarily used in the context of literary analysis and discussions of Nabokov's *Pale Fire*. The character is notable for his unreliable narration and complex psychological profile.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Pale Fire (novel title)","Zembla (fictional kingdom)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; primarily found in literary contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Kinbote' is highly specific to the context of Vladimir Nabokov's novel *Pale Fire*. Understanding requires familiarity with the novel's plot, characters, and themes, particularly the concept of the unreliable narrator. The name is not generally used outside of literary discussions. "},"example_sentences":[{"sentence":"Kinbote's interpretation of the poem is highly subjective and unreliable.","translation":"キンボートの詩の解釈は非常に主観的で信頼できない。","type":"literary analysis","meaning_category":"character analysis"},{"sentence":"The character of Kinbote is a masterclass in unreliable narration.","translation":"キンボートというキャラクターは、信頼できない語りの名作である。","type":"literary criticism","meaning_category":"literary technique"}]}