{"word":"molocker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Australia) A person who loiters or hangs around, often with no clear purpose or direction.","english_definition":"A person who loiters or hangs around, often with no clear purpose or direction.","examples":[{"sentence":"There were a few molockers hanging around the shopping centre.","translation":"ショッピングセンターの周りには、ぶらぶらしている人が何人かいた。"},{"sentence":"The police moved the molockers on from the park.","translation":"警察は公園からたむろしている人たちを追い払った。"}],"collocations":["hang around like a molocker","a group of molockers"],"synonyms":["loiterer","idler","lounger","vagrant"],"antonyms":["busy person","worker"]}],"etymology":{"value":"Likely a blend of 'malingerer' (someone who exaggerates or feigns illness to escape duty or work) and 'loiterer'. The term probably originated in Australian slang.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒləkər/","syllables":"mo-lock-er"},"inflection":{"noun_plural":"molockers"},"usage_notes":{"explanation":"'Molocker' is a relatively uncommon slang term, primarily used in Australia. It carries a slightly negative connotation, suggesting that the person is not only idle but also perhaps a nuisance or undesirable presence. It's important to be aware of the regional specificity and potential negative implications when using this word.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a hard molocker.","correct":"✓ He's a molocker.","note":"The term itself implies idleness, so adding 'hard' is redundant and doesn't make sense."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["bludger (Australian slang for someone who avoids work)","loafer"]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Very low frequency - primarily Australian slang.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Molocker' is a slang term primarily used in Australia. It refers to someone who loiters or hangs around without any particular purpose. The word is not commonly used outside of Australia, and even within Australia, it might not be universally understood. Its usage implies a slightly negative judgment about the person's idleness and lack of direction."},"example_sentences":[{"sentence":"The shop owner asked the molockers to move away from the entrance.","translation":"店のオーナーはたむろしている人たちに、入り口から離れるように頼んだ。","type":"noun","meaning_category":"Loiterer"},{"sentence":"Don't just stand there like a molocker; do something useful!","translation":"ただそこでぼんやり突っ立ってないで、何か役に立つことをしろ！","type":"noun","meaning_category":"Loiterer"}]}