{"word":"oleometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"油の比重計、油の品質を測定する器具","english_definition":"An instrument for determining the specific gravity of oils.","examples":[{"sentence":"The oleometer is used to test the purity of olive oil.","translation":"オレオメーターはオリーブオイルの純度をテストするために使用されます。"},{"sentence":"By using an oleometer, the quality of the oil can be quickly assessed.","translation":"オレオメーターを使用することで、油の品質を迅速に評価できます。"}],"collocations":["test with an oleometer (オレオメーターでテストする)","use an oleometer (オレオメーターを使用する)"],"synonyms":["oil hydrometer","elaiometer"],"antonyms":[]}],"etymology":{"value":"'oleo-' (oilを意味する接頭辞) + '-meter' (測定器を意味する接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊliˈɒmɪtər/","syllables":"o-le-o-me-ter"},"inflection":{"noun_plural":"oleometers"},"usage_notes":{"explanation":"An oleometer is a specific type of hydrometer designed for measuring the specific gravity or density of oils. It is often used in the context of testing the quality and purity of oils, especially olive oil.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a thermometer to measure the oil's density.","correct":"✓ I used an oleometer to measure the oil's density.","note":"A thermometer measures temperature, while an oleometer measures the specific gravity or density of oils."}],"priority":"★★☆"},"related_words":{"derivatives":["oleometry (名詞: 油の比重測定)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An oleometer is a specialized instrument used to measure the specific gravity of oils. It's a niche term primarily encountered in scientific or technical contexts related to oil production, quality control, or analysis. Understanding its function requires familiarity with basic scientific concepts like specific gravity and density. Due to its specialized nature, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The lab technician used the **oleometer** to determine the specific gravity of the new batch of sunflower oil.","translation":"実験技師は、新しいヒマワリ油のバッチの比重を測定するためにオレオメーターを使用しました。","type":"noun","meaning_category":"比重計"},{"sentence":"The **oleometer** reading indicated that the olive oil was of high quality.","translation":"オレオメーターの測定値は、オリーブオイルが高品質であることを示していました。","type":"noun","meaning_category":"比重計"}]}