{"word":"iambize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(詩を)弱強格（アイアンバス）に構成する、弱強格のリズムにする","english_definition":"To compose or arrange (verse) in iambs; to give an iambic rhythm to.","examples":[{"sentence":"The poet tried to iambize the prose passage to give it a more lyrical feel.","translation":"詩人は、散文の一節をより叙情的にするために、弱強格のリズムにしようとした。"},{"sentence":"He iambized the line to fit the meter of the poem.","translation":"彼は詩の韻律に合わせるために、その行を弱強格にした。"}],"collocations":["iambize a poem","iambize a line","iambize prose"],"synonyms":["scan","metrify","rhythmize"],"antonyms":[]}],"etymology":{"value":"From 'iamb' (a metrical foot consisting of one short (or unstressed) syllable followed by one long (or stressed) syllable) + '-ize' (a suffix used to form verbs indicating to make, treat, or subject to).","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈæmbaɪz/","syllables":"I-am-bize"},"inflection":{"verb_forms":{"present_simple":["iambize","iambizes"],"past_simple":"iambized","past_participle":"iambized","present_participle":"iambizing"}},"usage_notes":{"explanation":"'Iambize' is a relatively rare verb used in the context of poetry and literary analysis. It specifically refers to the act of structuring or modifying text to conform to an iambic meter, which is a common rhythmic pattern in English poetry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The music was iambized.","correct":"✓ The poem was iambized.","note":"'Iambize' is generally used in the context of poetry or verse, not music. While music can have rhythm, 'iambize' specifically refers to creating an iambic meter in verse."}],"priority":"★★☆"},"related_words":{"derivatives":["iamb (noun): a metrical foot consisting of one short (or unstressed) syllable followed by one long (or stressed) syllable","iambic (adjective): relating to or written in iambs","iambus (noun): another term for iamb"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'iambize' is a specialized term primarily used in literary analysis and poetry. It refers to the act of structuring or modifying text to conform to an iambic meter, a specific rhythmic pattern. Due to its niche usage, it is considered an advanced vocabulary word. Understanding requires familiarity with poetic meter and literary terminology."},"example_sentences":[{"sentence":"The student was asked to iambize a line of free verse as an exercise in poetic form.","translation":"学生は、詩の形式の練習として、自由詩の一行を弱強格にするように求められた。","type":"verb","meaning_category":"弱強格にする"},{"sentence":"By carefully choosing his words, he iambized the sentence to create a subtle rhythm.","translation":"彼は注意深く言葉を選ぶことで、文を弱強格にし、微妙なリズムを作り出した。","type":"verb","meaning_category":"弱強格にする"}]}