{"word":"Faradays","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ファラデー（人名）の複数形、またはファラデー定数の単位","english_definition":"Plural form of Faraday (referring to Michael Faraday or the unit of Faraday constant).","examples":[{"sentence":"The experiment was conducted by the Faradays in the lab.","translation":"その実験は、研究室の複数のファラデー氏によって行われた。"},{"sentence":"We need to calculate the charge using Faradays.","translation":"ファラデー定数を使って電荷を計算する必要がある。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the surname of Michael Faraday, a British scientist who contributed significantly to the fields of electromagnetism and electrochemistry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfærədeɪz/","syllables":"fa-ra-days"},"inflection":{"noun_plural":"Faradays"},"usage_notes":{"explanation":"'Faradays' can refer to multiple people named Faraday or, less commonly, to the unit of the Faraday constant when expressing multiple units. The context usually clarifies the meaning.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Faraday (noun: Michael Faraday, Faraday constant)","Faraday's law (noun: Faradayの法則)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Faradays' is a plural form referring either to multiple people with the surname Faraday or, less commonly, multiple units of the Faraday constant, a unit in electrochemistry. Its usage is highly specialized and typically found in scientific or historical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The contributions of the early Faradays shaped our understanding of electromagnetism.","translation":"初期のファラデー氏たちの貢献は、電磁気学に関する私たちの理解を形作った。","type":"noun","meaning_category":"複数形の人名"},{"sentence":"The calculation requires converting the charge into Faradays.","translation":"計算には、電荷をファラデー定数に変換する必要がある。","type":"noun","meaning_category":"複数形の単位"}]}