{"word":"Beirut","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ベイルート（レバノンの首都）","english_definition":"The capital city of Lebanon, located on the Mediterranean coast.","examples":[{"sentence":"Beirut is a major port city in the Middle East.","translation":"ベイルートは中東の主要な港湾都市です。"},{"sentence":"The history of Beirut is marked by periods of conflict and reconstruction.","translation":"ベイルートの歴史は、紛争と復興の時代によって特徴づけられています。"}],"collocations":["Beirut port","Downtown Beirut","Greater Beirut","Beirut explosion"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Beirut is derived from the Phoenician word 'Be'erot', meaning 'wells' or 'springs'. This reflects the city's historical importance as a source of fresh water.","priority":"★★☆"},"pronunciation":{"ipa":"/beɪˈruːt/","syllables":"Bay-root"},"inflection":{},"usage_notes":{"explanation":"Beirut is the capital and largest city of Lebanon. It has a long and complex history, having been inhabited for over 5,000 years. The city has experienced periods of prosperity as well as significant destruction, particularly during the Lebanese Civil War (1975-1990). Despite these challenges, Beirut remains a vital cultural and economic center in the region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Beirut is a country.","correct":"✓ Beirut is a city in Lebanon.","note":"Beirut is a city, not a country. Lebanon is the country."}],"priority":"★☆☆"},"related_words":{"derivatives":["Beiruti (adjective/noun: relating to Beirut or its people)"],"related_places":["Lebanon","Mediterranean Sea","Middle East"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Relatively frequent, especially in news and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Beirut' refers to the capital city of Lebanon. It's a place name, so you'll often see it in news reports or when people are talking about geography or history related to the Middle East. It's important to remember that Beirut is a city, not a country itself."},"example_sentences":[{"sentence":"Many historical buildings in Beirut were damaged during the war.","translation":"ベイルートの多くの歴史的建造物は、戦争中に被害を受けました。","type":"general","meaning_category":"city"},{"sentence":"The port of Beirut is crucial for trade in the region.","translation":"ベイルート港は、この地域の貿易にとって非常に重要です。","type":"general","meaning_category":"city"}]}