{"word":"puebloize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(rare) To convert (something) into a pueblo or pueblo-like structure; to cause (something) to resemble a pueblo.","english_definition":"(rare) To convert (something) into a pueblo or pueblo-like structure; to cause (something) to resemble a pueblo.","examples":[{"sentence":"The architect sought to puebloize the modern building, incorporating adobe-like materials and stepped designs.","translation":"建築家は、現代的な建物をプエブロ化しようとし、アドベのような素材と階段状のデザインを取り入れました。"},{"sentence":"The city planners considered puebloizing the new housing development to reflect the region's cultural heritage.","translation":"都市計画家たちは、地域の文化遺産を反映させるために、新しい住宅開発をプエブロ化することを検討しました。"}],"collocations":[],"synonyms":["pueblofy"],"antonyms":[]}],"etymology":{"value":"Derived from \"pueblo\" (a type of Native American settlement) + \"-ize\" (a suffix indicating to make or convert into).","priority":"★★☆"},"pronunciation":{"ipa":"ˈpwɛbloʊˌaɪz","syllables":"pweb-lo-ize"},"inflection":{"verb_forms":{"present_simple":["puebloize","puebloizes"],"past_simple":"puebloized","past_participle":"puebloized","present_participle":"puebloizing"}},"usage_notes":{"explanation":"The term \"puebloize\" is rare and not commonly used. It describes the act of making something resemble a pueblo, typically in architectural or design contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["puebloization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Puebloize\" is a rare term, primarily encountered in specialized architectural or anthropological contexts. Understanding requires familiarity with the concept of a \"pueblo\" (a traditional Native American settlement) and the suffix \"-ize\" (meaning to make or convert into). Its usage implies a deliberate effort to transform something to resemble or adopt characteristics of a pueblo. Due to its rarity, it is not part of standard English vocabulary and would likely require explanation for most audiences."},"example_sentences":[{"sentence":"The artist aimed to puebloize the urban landscape with murals depicting Native American motifs.","translation":"そのアーティストは、ネイティブアメリカンのモチーフを描いた壁画で、都市の景観をプエブロ化することを目指しました。","type":"verb","meaning_category":"To convert something into a pueblo-like structure."}]}