{"word":"solenoid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ソレノイド（コイル状の電線に電流を流すと磁場が発生し、その磁場を利用して可動鉄片を動かす装置）","english_definition":"A coil of wire, typically cylindrical, that acts as a magnet when an electric current passes through it. It is often used to convert electrical energy into mechanical work.","examples":[{"sentence":"The car's starter motor uses a solenoid to engage the engine.","translation":"車のスターターモーターは、ソレノイドを使ってエンジンを始動させる。"},{"sentence":"Solenoids are used in many industrial applications, such as controlling valves and switches.","translation":"ソレノイドは、バルブやスイッチの制御など、多くの産業用途で使用されている。"},{"sentence":"The door lock is activated by a solenoid.","translation":"ドアロックはソレノイドによって作動する。"}],"collocations":["solenoid valve (ソレノイドバルブ)","solenoid switch (ソレノイドスイッチ)","starter solenoid (スターターソレノイド)","linear solenoid (リニアソレノイド)","rotary solenoid (ロータリーソレノイド)"],"synonyms":["electromagnet","coil"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'solen' (pipe, channel) and 'eidos' (form, shape), referring to its cylindrical shape. Coined in 1823 by French physicist André-Marie Ampère.","priority":"★★★"},"pronunciation":{"ipa":"ˈsoʊlənɔɪd/","syllables":"so-le-noid"},"inflection":{"noun_plural":"solenoids"},"usage_notes":{"explanation":"A solenoid is essentially an electromagnet in the form of a coil. When current flows through the coil, it creates a magnetic field that pulls a movable iron core (plunger) into the coil. This linear motion can be used to operate valves, switches, or other mechanical devices. Solenoids are widely used in various applications due to their reliability, simplicity, and relatively low cost. They come in different types, such as linear solenoids (for straight-line motion) and rotary solenoids (for rotational motion).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solenoid is make of metal.","correct":"✓ The solenoid is made of metal.","note":"'Make' needs to be in the passive form 'made' when describing what something is constructed from."},{"incorrect":"✗ Solenoid are use to control valves.","correct":"✓ Solenoids are used to control valves.","note":"The subject 'solenoids' is plural, so the verb 'are' is needed. Also, 'use' should be in the passive form 'used'."}],"priority":"★★☆"},"related_words":{"derivatives":["solenoidal (adjective: relating to or having the characteristics of a solenoid)"],"phrasal_verbs":[],"related_concepts":["electromagnetism","magnetic field","coil","inductor","valve","switch","actuator"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **solenoid** is a type of electromagnet. Imagine a tightly wound coil of wire. When electricity flows through this wire, it creates a magnetic field, just like a regular magnet. This magnetic field can then be used to pull or push a metal rod (called a plunger) inside the coil. This movement can be used to operate things like valves in machines or switches in electrical circuits. Solenoids are useful because they can convert electrical energy into mechanical motion in a simple and reliable way. They are commonly found in cars, appliances, and industrial equipment.","priority":"★★★"},"example_sentences":[{"sentence":"The **solenoid** in the washing machine controls the water inlet valve.","translation":"洗濯機のソレノイドは、給水バルブを制御する。","type":"noun","meaning_category":"device"},{"sentence":"A faulty **solenoid** can prevent the car from starting.","translation":"故障したソレノイドは、車の始動を妨げる可能性がある。","type":"noun","meaning_category":"device"},{"sentence":"The **solenoid** valve opens and closes to regulate the flow of fluid.","translation":"ソレノイドバルブは、流体の流れを調整するために開閉する。","type":"noun","meaning_category":"device"}]}