{"word":"satirisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"風刺、諷刺化、皮肉","english_definition":"The act of satirizing; the use of humor, irony, exaggeration, or ridicule to expose and criticize people's stupidity or vices, particularly in the context of contemporary politics and other topical issues.","examples":[{"sentence":"The play was a biting satirisation of the political elite.","translation":"その劇は、政界エリートに対する痛烈な風刺だった。"},{"sentence":"His art is known for its satirisation of modern consumer culture.","translation":"彼の芸術は、現代の消費文化の風刺で知られている。"},{"sentence":"The film offers a clever satirisation of the education system.","translation":"その映画は、教育制度に対する巧妙な風刺を提供している。"}],"collocations":["biting satirisation (痛烈な風刺)","clever satirisation (巧妙な風刺)","gentle satirisation (穏やかな風刺)","political satirisation (政治風刺)","social satirisation (社会風刺)"],"synonyms":["satire","parody","lampoon","mockery","burlesque","caricature","irony","ridicule"],"antonyms":["serious treatment","respectful portrayal","eulogy","praise"]}],"etymology":{"value":"The noun 'satirisation' is derived from the verb 'satirise' (or 'satirize' in American English), which comes from 'satire'. 'Satire' originates from the Latin word 'satura', meaning 'a mixture' or 'a dish of mixed ingredients', which was used to describe a literary genre that mixed different styles and themes. Over time, it came to refer to works that used humor and ridicule to criticize societal flaws.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsætɪraɪˈzeɪʃən/","syllables":"sa-tir-i-sa-tion"},"inflection":{"noun_plural":"satisations"},"usage_notes":{"explanation":"'Satirisation' refers to the act or process of using satire. It is often used to describe a specific instance or example of satirical work. While 'satire' can refer to the genre or the overall work, 'satirisation' emphasizes the action of creating or performing satire. It often implies a deliberate and intentional effort to expose and critique something through humor and irony.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The satirisation was very satire.","correct":"✓ The satirisation was very satirical.","note":"'Satire' is a noun, while 'satirical' is an adjective. Use 'satirical' to describe something that is related to or characterized by satire."},{"incorrect":"✗ He made a satirisation of the president.","correct":"✓ He created a satirisation of the president. / ✓ He satirized the president.","note":"'Satirisation' is a noun that refers to the act of satirizing. Use a verb like 'create', 'offer', or 'perform' to describe the action of making a satirisation. Alternatively, use the verb 'satirize'."}],"priority":"★☆☆"},"related_words":{"derivatives":["satire (noun: 風刺)","satiric (adjective: 風刺的な)","satirical (adjective: 風刺的な)","satirist (noun: 風刺作家)","satirize (verb: 風刺する)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Satirisation' is a relatively complex term that refers to the act of using satire. It is most often encountered in academic or critical discussions of literature, art, and politics. Understanding the concept requires familiarity with the techniques and purposes of satire, such as the use of irony, humor, and exaggeration to critique societal issues. The word itself is less common than its related terms, such as 'satire' and 'satirical'.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist's latest exhibition is a sharp satirisation of celebrity culture.","translation":"そのアーティストの最新の展示会は、セレブリティ文化に対する鋭い風刺である。","type":"noun","meaning_category":"風刺"},{"sentence":"The novel's satirisation of bureaucratic incompetence was both funny and insightful.","translation":"その小説の官僚の無能さに対する風刺は、面白くもあり洞察力に富んでいた。","type":"noun","meaning_category":"風刺"},{"sentence":"The political cartoon offered a pointed satirisation of the government's policies.","translation":"その政治漫画は、政府の政策に対する痛烈な風刺を提供した。","type":"noun","meaning_category":"風刺"}]}