{"word":"contributories","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) (会社清算における)出資義務者、出資者","english_definition":"(law) persons liable to contribute to the assets of a company being wound up.","examples":[{"sentence":"The liquidator sought contributions from the contributories to pay off the company's debts.","translation":"清算管財人は、会社の負債を返済するために、出資義務者からの拠出を求めた。"}],"collocations":[],"synonyms":["shareholders","investors","members"],"antonyms":[]}],"etymology":{"value":"The word 'contributories' is derived from 'contributory,' which comes from the verb 'contribute.' 'Contribute' originates from the Latin word 'contribuere,' meaning 'to bring together, add, or contribute.'","priority":"★★★"},"pronunciation":{"ipa":"/kənˈtrɪbjʊtəriz/","syllables":"con-trib-u-to-ries"},"inflection":{"noun_plural":"contributories"},"usage_notes":{"explanation":"'Contributories' is a legal term primarily used in the context of company law, specifically during the winding-up or liquidation process. It refers to individuals or entities who have an obligation to contribute to the assets of a company to satisfy its debts. This typically includes shareholders who have not fully paid for their shares or former members who may have certain liabilities. The term is most often encountered in legal or financial documents related to insolvency proceedings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contributories are contributing to the charity.","correct":"✓ The contributors are contributing to the charity.","note":"'Contributories' refers specifically to those liable to contribute to a company being wound up, not general contributors. Use 'contributors' for general contributions. "},{"incorrect":"✗ The contributory was happy to give money.","correct":"✓ The contributor was happy to give money.","note":"'Contributory' (adjective) means 'contributing' or 'instrumental.' Use 'contributor' for someone who gives money."}],"priority":"★★★"},"related_words":{"derivatives":["contribute (verb)","contribution (noun)","contributory (adjective)","contributor (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'contributories' is a specialized legal term primarily used in the context of corporate insolvency. It refers to individuals or entities who are liable to contribute to the assets of a company that is being wound up, typically to cover outstanding debts. Understanding this term requires familiarity with company law and financial proceedings related to liquidation. It is not commonly used in everyday language and is primarily encountered in legal or financial documentation. The word is derived from 'contribute,' indicating the act of providing or giving something, but in this specific context, it implies a legal obligation rather than a voluntary action."},"example_sentences":[{"sentence":"The court identified several individuals as contributories to the insolvent company.","translation":"裁判所は、破産した会社に対する出資義務者として数人を特定した。","type":"noun","meaning_category":"出資義務者"},{"sentence":"The liquidator sent notices to all identified contributories, demanding payment of outstanding share capital.","translation":"清算管財人は、特定されたすべての出資義務者に通知を送り、未払いの株式資本の支払いを要求した。","type":"noun","meaning_category":"出資義務者"}]}