{"word":"wheeler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"車輪を作る人、車輪職人","english_definition":"A maker of wheels.","examples":[{"sentence":"The wheeler was skilled in crafting sturdy wheels for carts and carriages.","translation":"車輪職人は、荷車や馬車用の丈夫な車輪を作るのに熟練していた。"}],"synonyms":["wheelwright"],"antonyms":[]},{"part_of_speech":"noun","definition":"（蒸気船などの）舷側外輪の船、外輪船","english_definition":"A steamboat propelled by paddle wheels.","examples":[{"sentence":"The Mississippi was once crowded with wheelers carrying goods and passengers.","translation":"ミシシッピ川はかつて、商品や乗客を運ぶ外輪船で賑わっていた。"}],"synonyms":["paddle steamer","paddle wheeler"],"antonyms":[]},{"part_of_speech":"noun","definition":"（俗語）やり手、策士、実力者","english_definition":"(Slang) A person who is active and influential in business or politics; a go-getter.","examples":[{"sentence":"He's a real wheeler-dealer, always finding ways to make a profit.","translation":"彼は本当にやり手で、常に利益を上げる方法を見つけている。"},{"sentence":"She's a wheeler in the local political scene.","translation":"彼女は地元の政界の実力者だ。"}],"synonyms":["go-getter","hustler","operator","mover and shaker"],"antonyms":["underachiever"]},{"part_of_speech":"noun","definition":"（自転車競技などで）先頭を走る人、牽引役","english_definition":"(Cycling) A cyclist who takes the lead and sets the pace for a group.","examples":[{"sentence":"The wheeler maintained a strong pace, pushing the peloton forward.","translation":"牽引役は強いペースを維持し、集団を前進させた。"}],"synonyms":["pacemaker","lead rider"],"antonyms":[]}],"etymology":{"value":"From 'wheel' + '-er'. The 'wheel' part relates to the literal wheel, and the '-er' suffix denotes a person or thing associated with that wheel. The slang meaning likely evolved from the idea of someone who is always 'in motion' or 'driving' deals forward.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwiːlər/","syllables":"wheel-er"},"inflection":{"noun_plural":"wheelers"},"usage_notes":{"explanation":"The term 'wheeler' has evolved from its literal meaning of someone who makes wheels to include more figurative senses. The slang term 'wheeler-dealer' is particularly common, referring to someone who is shrewd and resourceful in business or politics, often with a hint of being unscrupulous. The cycling term is more straightforward, referring to the rider who leads the pack.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good wheeler of the car.","correct":"✓ He is a good driver.","note":"'Wheeler' doesn't directly refer to someone who drives a car. Use 'driver' instead."},{"incorrect":"✗ She is a wheeler in the garden.","correct":"✓ She is a gardener.","note":"'Wheeler' is not generally used to describe someone who works in a garden. Use 'gardener' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["wheel (noun, verb)","wheelwright (noun)","wheelbase (noun)","wheelchair (noun)","wheeler-dealer (noun)"],"idioms_phrases":["wheeler-dealer (a shrewd and often unscrupulous businessperson or politician)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (for 'wheeler-dealer'), C1 (for other meanings)","frequency_google_ngram":"Relatively low frequency, except for the compound 'wheeler-dealer'.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"wheeler\" has a few different meanings. It can refer to someone who makes wheels, but this is less common now. More often, you'll hear it in the phrase \"wheeler-dealer,\" which describes someone who is very active and often clever in business or politics, sometimes in a way that is not completely honest. It can also refer to the lead rider in a cycling race. The meaning depends on the context.","priority":"★★☆"},"example_sentences":[{"sentence":"The old wheeler still crafted wheels using traditional methods.","translation":"その年老いた車輪職人は、今でも伝統的な方法で車輪を作っていた。","type":"noun","meaning_category":"車輪職人"},{"sentence":"The riverboat wheeler churned its way up the Mississippi.","translation":"外輪船はミシシッピ川をかき分けながら上っていった。","type":"noun","meaning_category":"外輪船"},{"sentence":"He's known as a wheeler-dealer in the city's real estate market.","translation":"彼は街の不動産市場のやり手として知られている。","type":"noun","meaning_category":"やり手"},{"sentence":"The wheeler set a blistering pace, hoping to break away from the pack.","translation":"牽引役は集団から抜け出すことを期待して、猛烈なペースを設定した。","type":"noun","meaning_category":"牽引役"}]}