{"word":"reinquiry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再調査、再検討、再問い合わせ","english_definition":"A second or further inquiry; a renewed investigation or questioning.","examples":[{"sentence":"After the initial investigation yielded inconclusive results, a reinquiry was ordered.","translation":"最初の調査で決定的な結果が得られなかったため、再調査が命じられた。"},{"sentence":"The customer made a reinquiry about the status of their order.","translation":"顧客は注文状況について再問い合わせを行った。"},{"sentence":"Due to new evidence, the committee decided to conduct a reinquiry into the matter.","translation":"新たな証拠が出たため、委員会はその件について再検討を行うことを決定した。"}],"collocations":["conduct a reinquiry","order a reinquiry","make a reinquiry","launch a reinquiry"],"synonyms":["reinvestigation","second inquiry","follow-up inquiry","further inquiry","review","reexamination"],"antonyms":["initial inquiry","original inquiry","first inquiry"]}],"etymology":{"value":"'re-' (again) + 'inquiry' (an act of asking for information).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈkwaɪəri/","syllables":"re-in-qui-ry"},"inflection":{"noun_plural":"reinquiries"},"usage_notes":{"explanation":"'Reinquiry' refers to a second or subsequent inquiry, often conducted when the initial inquiry was insufficient or when new information arises. It implies a renewed or repeated investigation or questioning to gather more information or clarify previous findings. It is often used in formal or official contexts, such as legal, governmental, or business settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I made a reinquiry for the information.","correct":"✓ I made a reinquiry about the information.","note":"Use 'about' to specify the subject of the reinquiry."},{"incorrect":"✗ The reinquiry was conduct.","correct":"✓ The reinquiry was conducted.","note":"'Conduct' is a verb. Use the past participle 'conducted' in the passive voice."}],"priority":"★★☆"},"related_words":{"derivatives":["inquiry","inquire","re-inquire"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reinquiry' is a formal term that means to ask again or investigate further. It is used when the first attempt to get information or understand something was not enough. This word is more common in professional or official situations, like in law or business, when a more thorough investigation is needed. Because it's not used very often in everyday conversation, it's considered a more advanced word."},"example_sentences":[{"sentence":"The police decided to launch a reinquiry into the cold case.","translation":"警察はその未解決事件について再調査を開始することを決定した。","type":"noun","meaning_category":"再調査"},{"sentence":"The customer service representative suggested making a reinquiry if the issue was not resolved within 24 hours.","translation":"カスタマーサービスの担当者は、問題が24時間以内に解決しない場合は、再問い合わせをすることを提案した。","type":"noun","meaning_category":"再問い合わせ"},{"sentence":"A reinquiry into the company's financial practices was initiated following allegations of fraud.","translation":"不正の申し立てを受けて、会社の財務慣行に関する再検討が開始された。","type":"noun","meaning_category":"再検討"}]}