{"word":"screw-torn","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of an object or material) damaged or weakened due to screws being improperly installed, over-tightened, or stripped.","english_definition":"Describes something that has been damaged or weakened because screws have been incorrectly used, over-tightened, or have stripped the material they were holding.","examples":[{"sentence":"The old wooden chair was screw-torn and wobbly.","translation":"その古い木の椅子はネジがバカになっていて、ぐらぐらしていた。"},{"sentence":"The plastic casing of the device was screw-torn, making it difficult to reassemble.","translation":"その装置のプラスチック製の外装はネジ穴が潰れていて、組み立て直すのが難しかった。"}],"collocations":["screw-torn wood","screw-torn plastic","screw-torn hole","screw-torn threads"],"synonyms":["stripped","damaged","weakened","threadbare"],"antonyms":["intact","undamaged","sound","secure"]},{"part_of_speech":"adjective","definition":"(figurative) severely damaged or negatively affected, especially in a way that is difficult to repair or reverse.","english_definition":"Used figuratively to describe something severely damaged or negatively affected in a way that is difficult to repair or reverse.","examples":[{"sentence":"The company's reputation was screw-torn after the scandal.","translation":"その会社の名声はスキャンダルの後、ズタズタになった。"},{"sentence":"His confidence was screw-torn by the constant criticism.","translation":"彼の自信は絶え間ない批判によって打ち砕かれた。"}],"collocations":["screw-torn reputation","screw-torn confidence","screw-torn relationship"],"synonyms":["ruined","destroyed","shattered","devastated"],"antonyms":["restored","repaired","strengthened","improved"]}],"etymology":{"value":"A compound word formed by combining \"screw\" (referring to the fastening device) and \"torn\" (past participle of \"tear,\" indicating damage or separation). It describes a state where the material around a screw has been damaged, leading to a weakened or unstable connection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskruːˌtɔːrn/","syllables":"screw-torn"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term \"screw-torn\" is relatively uncommon but descriptive. It is most often used to describe physical objects, particularly those made of wood or plastic, where the screw threads have been damaged, preventing a secure fastening. Figuratively, it can describe something that has been severely damaged or negatively impacted, often in a way that is difficult to repair.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The screw was screw-torn.","correct":"✓ The hole was screw-torn.","note":"The screw itself is not 'screw-torn'; rather, the material *around* the screw is screw-torn. The screw might be stripped, but the surrounding material is torn."},{"incorrect":"✗ The relationship was screw-torned.","correct":"✓ The relationship was screw-torn.","note":"The past participle of 'tear' is 'torn', not 'torned'."}],"priority":"★★☆"},"related_words":{"derivatives":["screw (noun)","torn (adjective)","stripped (adjective)","threadbare (adjective)"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not a common term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Screw-torn\" is a compound adjective that describes something damaged or weakened because of issues with screws. This usually means the screws were either over-tightened, improperly installed, or the threads have been stripped, causing the material around the screw to be damaged. It can also be used metaphorically to describe something severely damaged in a way that is difficult to repair. Because it's a specific and relatively uncommon term, understanding requires a good vocabulary and the ability to infer meaning from the combination of \"screw\" and \"torn.\""},"example_sentences":[{"sentence":"The cabinet door was hanging loosely because the wood around the hinges was screw-torn.","translation":"キャビネットのドアは、蝶番周りの木材がネジ穴がバカになっていたため、緩くぶら下がっていた。","type":"adjective","meaning_category":"Physical Damage"},{"sentence":"After years of neglect, the antique desk was screw-torn and in need of restoration.","translation":"長年の放置の後、そのアンティークの机はネジ穴が潰れており、修復が必要だった。","type":"adjective","meaning_category":"Physical Damage"},{"sentence":"The constant accusations had left their friendship screw-torn and fragile.","translation":"絶え間ない非難は、彼らの友情をズタズタにし、壊れやすくした。","type":"adjective","meaning_category":"Figurative Damage"}]}