{"word":"semihumanized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に人間化された、半人間化された","english_definition":"Partially humanized; having some, but not all, human characteristics or qualities.","examples":[{"sentence":"The robot had a semihumanized face, with eyes that almost seemed to express emotion.","translation":"そのロボットは半人間化された顔をしており、目にはまるで感情を表現しているかのように見えた。"},{"sentence":"The creature was described as semihumanized, possessing both animalistic and human traits.","translation":"その生き物は半人間化されたものとして描写され、動物的な特徴と人間の特徴の両方を持ち合わせていた。"}],"collocations":["semihumanized robot","semihumanized creature","semihumanized appearance"],"synonyms":["partially human","anthropomorphic","humanoid","part-human"],"antonyms":["animalistic","nonhuman","inhuman"]},{"part_of_speech":"adjective","definition":"(医学) 半ヒト化された (抗体など)","english_definition":"(Medicine) Describes a monoclonal antibody or other protein that has been genetically engineered to replace some of its non-human components with human components, in order to reduce immunogenicity.","examples":[{"sentence":"The semihumanized antibody showed a significant reduction in immunogenicity compared to the original murine antibody.","translation":"その半ヒト化抗体は、元のマウス抗体と比較して免疫原性の有意な低下を示した。"},{"sentence":"Semi-humanized antibodies are often used in cancer therapy to target specific tumor cells.","translation":"半ヒト化抗体は、特定の腫瘍細胞を標的とするために、癌治療でよく使用される。"}],"collocations":["semihumanized antibody","semihumanized protein","semihumanized monoclonal antibody"],"synonyms":["chimeric antibody","humanized antibody"],"antonyms":["murine antibody","fully human antibody"]}],"etymology":{"value":"Formed by combining \"semi-\" (meaning 'partially' or 'half') with \"humanized\" (meaning 'made more human').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˈhjuːmənaɪzd/","syllables":"se-mi-hu-ma-nized"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"semihumanized\" is used in two main contexts: to describe beings or objects that possess some, but not all, human characteristics, and in medicine to describe antibodies or other proteins that have been genetically engineered to be more human-like. In the first context, it often appears in science fiction or fantasy. In the second context, it is a technical term used in immunology and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semihumanized robot was completely human.","correct":"✓ The semihumanized robot had some human features, but was not completely human.","note":"The prefix \"semi-\" indicates that something is only partially humanized, not fully human."}],"priority":"★☆☆"},"related_words":{"derivatives":["semihumanization (noun)","humanize (verb)","humanized (adjective)"],"related_terms":["anthropomorphism","humanoid","chimeric antibody","monoclonal antibody"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"semihumanized\" is a relatively uncommon term that is used to describe something that has been made partially human, or that possesses some but not all human characteristics. It is often used in science fiction or fantasy to describe creatures or robots that are not fully human, but have some human-like qualities. In medicine, it refers to antibodies or proteins that have been genetically engineered to be more human-like, in order to reduce the risk of an immune response. This term requires a good understanding of the prefix \"semi-\" and the word \"humanized.\""},"example_sentences":[{"sentence":"The artist created a series of semihumanized animal sculptures.","translation":"そのアーティストは、半人間化された動物の彫刻のシリーズを作成した。","type":"general","meaning_category":"partially humanized"},{"sentence":"The semihumanized antibody is designed to minimize immune response in patients.","translation":"その半ヒト化抗体は、患者の免疫応答を最小限に抑えるように設計されている。","type":"medical","meaning_category":"(medicine) partially humanized"}]}