{"word":"undimidiated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not diminished; not reduced in size, extent, or intensity.","english_definition":"Not having been made smaller, less, or weaker.","examples":[{"sentence":"The undimidiated sunlight streamed through the window.","translation":"弱まることのない太陽光が窓から差し込んだ。"},{"sentence":"His undimidiated enthusiasm inspired the team.","translation":"彼の衰えない熱意がチームを鼓舞した。"}],"collocations":["undimidiated sunlight","undimidiated enthusiasm","undimidiated strength"],"synonyms":["unreduced","unweakened","unabated","unfaded","unlessened"],"antonyms":["diminished","reduced","weakened","abated","faded"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) + 'dimidiated,' the past participle of 'dimidiate,' which means to divide into two equal parts or to reduce by half. Thus, 'undimidiated' literally means 'not divided in half' or 'not reduced.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈmɪdieɪtɪd/","syllables":"un-di-mid-i-a-ted"},"inflection":{"notes":"Adjectives do not typically inflect, except for comparative and superlative forms which are 'more undimidiated' and 'most undimidiated' respectively. However, these forms are rarely used."},"usage_notes":{"explanation":"'Undimidiated' is a relatively rare and formal word. It emphasizes that something has not been lessened or weakened in any way. It is often used to describe qualities or forces that remain at full strength or intensity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undimidiated cost of the project was too high.","correct":"✓ The unreduced cost of the project was too high.","note":"While 'undimidiated' can be used to describe something not reduced, 'unreduced' is more common in contexts involving costs or quantities."}],"priority":"★★☆"},"related_words":{"derivatives":["un- (prefix: not)","dimidiate (verb: to divide into two equal parts)","dimidiation (noun: the act of dividing into two equal parts)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undimidiated' is a sophisticated word indicating that something has not been reduced or lessened in any way. It is a formal term and not commonly used in everyday conversation. It is best suited for contexts where you want to emphasize the complete and sustained nature of something, such as 'undimidiated enthusiasm' or 'undimidiated light.'"},"example_sentences":[{"sentence":"The singer's undimidiated passion for music was evident in every performance.","translation":"その歌手の音楽への衰えを知らない情熱は、すべてのパフォーマンスに明らかだった。","type":"adjective","meaning_category":"Not diminished"},{"sentence":"Despite the challenges, his undimidiated resolve kept him going.","translation":"困難にもかかわらず、彼の揺るぎない決意が彼を突き動かした。","type":"adjective","meaning_category":"Not diminished"}]}