{"word":"Bolters","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形)ボルトで固定するもの、逃亡者、ふるいにかける人","english_definition":"(plural) those who fasten with bolts, those who flee or desert, or those who sift or screen.","examples":[{"sentence":"The construction crew used many bolters to secure the steel beams.","translation":"建設作業員は、鉄骨を固定するために多くのボルト締め具を使用した。"},{"sentence":"The army sought to capture the bolters who had deserted their posts.","translation":"軍は、持ち場を放棄した逃亡者を捕獲しようとした。"},{"sentence":"The mill employed bolters to refine the flour.","translation":"その工場では、小麦粉を精製するためにふるいにかける人が雇われていた。"}],"collocations":["steel bolters","army bolters","flour bolters"],"synonyms":["deserters","sifters","fasteners"],"antonyms":["loyalists","joiners","collectors"]}],"etymology":{"value":"Derived from the verb 'bolt,' which has multiple meanings including fastening, fleeing, and sifting.","priority":"N/A"},"pronunciation":{"ipa":"/ˈboʊltərz/","syllables":"bol-ters"},"inflection":{"noun_plural":"Bolters"},"usage_notes":{"explanation":"'Bolters' is the plural form of 'bolter,' which can refer to different things depending on the context. It can refer to people who use bolts to fasten things, people who desert or flee, or people who sift or screen materials.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["bolt","bolter"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"Advanced","text":"The word 'bolters' is a plural noun with multiple possible meanings depending on the context. It can refer to people who use bolts to fasten things, people who desert or flee, or people who sift or screen materials. Understanding the context is crucial to interpreting the correct meaning."},"example_sentences":[{"sentence":"The team of steelworkers used pneumatic bolters to assemble the bridge.","translation":"鉄鋼作業員のチームは、空気圧ボルト締め機を使用して橋を組み立てた。","type":"noun","meaning_category":"fasteners"},{"sentence":"The military police were tasked with apprehending the bolters.","translation":"憲兵隊は、脱走兵を逮捕する任務を負っていた。","type":"noun","meaning_category":"deserters"},{"sentence":"The old mill still uses traditional bolters to sift the flour.","translation":"その古い工場では、小麦粉をふるいにかけるために、依然として伝統的なふるい機を使用している。","type":"noun","meaning_category":"sifters"}]}