{"word":"Medicaid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メディケイド（米国における低所得者向けの医療扶助制度）","english_definition":"A joint federal and state program in the United States that provides health coverage to millions of Americans, including children, pregnant women, seniors, and people with disabilities. Medicaid is designed to help low-income individuals and families who cannot afford health insurance.","examples":[{"sentence":"Medicaid provides healthcare for millions of low-income Americans.","translation":"メディケイドは何百万人もの低所得のアメリカ人に医療を提供しています。"},{"sentence":"Eligibility for Medicaid varies by state.","translation":"メディケイドの資格要件は州によって異なります。"},{"sentence":"The expansion of Medicaid has been a key part of the Affordable Care Act.","translation":"メディケイドの拡大は、医療費負担適正化法（Affordable Care Act）の重要な部分となっています。"}],"collocations":["Medicaid expansion (メディケイドの拡大)","Medicaid eligibility (メディケイドの資格)","Medicaid coverage (メディケイドの保障)","Medicaid benefits (メディケイドの給付)","Medicaid recipients (メディケイド受給者)","Medicaid program (メディケイドプログラム)"],"synonyms":["government-sponsored healthcare","public health insurance","socialized medicine (批判的な文脈で使用される場合)"],"antonyms":["private health insurance"]}],"etymology":{"value":"The name 'Medicaid' is derived from 'medical' and 'aid,' reflecting its purpose of providing medical assistance to those in need. It was established in 1965 as part of the Social Security Amendments.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmɛdɪˌkeɪd/","syllables":"Me-di-caid"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Medicaid is a healthcare program in the United States specifically designed for low-income individuals and families. It is jointly funded by the federal government and individual states, and eligibility requirements and specific benefits can vary significantly from state to state. It's important to distinguish Medicaid from Medicare, which is a federal health insurance program primarily for people 65 and older, as well as certain younger people with disabilities or chronic conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has Medicare because he is poor.","correct":"✓ He has Medicaid because he is poor.","note":"Medicaid is for low-income individuals, while Medicare is primarily for the elderly and disabled."},{"incorrect":"✗ Medicaid is the same in every state.","correct":"✓ Medicaid eligibility and benefits vary by state.","note":"Each state has its own rules and regulations regarding Medicaid."}],"priority":"★★☆"},"related_words":{"derivatives":["Medicaid-eligible (メディケイドの資格がある)","Medicaid-funded (メディケイドによって資金提供された)"],"phrases":["Affordable Care Act (ACA)","Children's Health Insurance Program (CHIP)","Centers for Medicare & Medicaid Services (CMS)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively common, especially in discussions about healthcare policy in the United States.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Medicaid' is a term specific to the United States healthcare system. It refers to a government program that provides health insurance to people with low incomes. The program is complex, with different rules in each state, and is often discussed in the context of healthcare policy and access to care. Understanding the term requires familiarity with the US political and social landscape. It is often contrasted with 'Medicare,' which is a separate program for the elderly and disabled.","priority":"★★☆"},"example_sentences":[{"sentence":"Many families rely on Medicaid for their children's healthcare.","translation":"多くの家族が子供たちの医療のためにメディケイドに頼っています。","type":"general","meaning_category":"General Use"},{"sentence":"The state is considering changes to its Medicaid program.","translation":"州はメディケイドプログラムの変更を検討しています。","type":"policy","meaning_category":"Policy and Government"},{"sentence":"Medicaid expansion has helped reduce the number of uninsured people.","translation":"メディケイドの拡大は、無保険者の数を減らすのに役立っています。","type":"impact","meaning_category":"Impact and Effects"}]}