{"word":"phlebotomisation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"瀉血（しゃけつ）","english_definition":"The act or practice of opening a vein for letting blood as a therapeutic measure.","examples":[{"sentence":"Phlebotomisation was a common medical practice in the past.","translation":"瀉血は過去には一般的な医療行為だった。"},{"sentence":"The doctor recommended phlebotomisation to reduce the patient's blood pressure.","translation":"医師は患者の血圧を下げるために瀉血を勧めた。"}],"collocations":["therapeutic phlebotomisation","perform phlebotomisation","undergo phlebotomisation"],"synonyms":["bloodletting","venesection","blood drawing"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'phleps' (vein) and 'tome' (cutting). The term 'phlebotomy' originally referred to the surgical opening of a vein, and 'phlebotomisation' is the process or act of performing phlebotomy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌflɛbəˈtɒmɪˌzeɪʃən/","syllables":"phle-bot-o-mi-sa-tion"},"inflection":{"noun_plural":"phlebotomisations"},"usage_notes":{"explanation":"'Phlebotomisation' is a formal and somewhat archaic term for bloodletting. Today, the term 'phlebotomy' is more commonly used, especially in modern medical contexts, to refer to the process of drawing blood for diagnostic testing or therapeutic purposes. While 'phlebotomisation' specifically refers to the act of opening a vein to let blood, 'phlebotomy' can also encompass other methods of blood collection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He underwent phlebotomy last week.","correct":"✓ He underwent phlebotomisation last week. / ✓ He had phlebotomy done last week.","note":"'Phlebotomy' is the procedure itself, so you 'have phlebotomy done'. 'Phlebotomisation' is the act of performing the procedure, so you 'undergo phlebotomisation'."}],"priority":"★☆☆"},"related_words":{"derivatives":["phlebotomise (verb)","phlebotomist (noun)","phlebotomic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'phlebotomisation' is highly specialized and rarely used outside of historical or technical medical contexts. It refers specifically to the act of performing bloodletting, an outdated medical practice. Modern contexts typically use the term 'phlebotomy' to refer to blood drawing for diagnostic or therapeutic purposes. Due to its limited use and technical nature, understanding this term requires advanced vocabulary and familiarity with medical history."},"example_sentences":[{"sentence":"Historical accounts describe the widespread use of phlebotomisation to treat various ailments.","translation":"歴史的な記録は、さまざまな病気を治療するための瀉血の広範な使用について述べている。","type":"noun","meaning_category":"瀉血"},{"sentence":"The ancient practice of phlebotomisation involved making an incision in a vein to release blood.","translation":"瀉血の古代の慣習は、血液を放出するために静脈を切開することを含んでいた。","type":"noun","meaning_category":"瀉血"}]}