{"word":"Ketosis","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ケトーシス：体内の炭水化物が不足した際に、脂肪を分解してエネルギー源とする代謝状態。ケトン体が生成される。","english_definition":"A metabolic state characterized by elevated levels of ketone bodies in the blood or urine, occurring when the body primarily uses fat for energy instead of carbohydrates.","examples":[{"sentence":"Following a ketogenic diet can induce ketosis.","translation":"ケトジェニックダイエットをすることでケトーシスを誘導できる。"},{"sentence":"Ketosis can occur in individuals with uncontrolled diabetes.","translation":"ケトーシスは、コントロールされていない糖尿病患者に起こることがある。"},{"sentence":"Some athletes use ketosis to improve endurance performance.","translation":"持久力パフォーマンスを向上させるためにケトーシスを利用するアスリートもいる。"}],"collocations":["induce ketosis (ケトーシスを誘導する)","enter ketosis (ケトーシスに入る)","be in ketosis (ケトーシス状態である)","nutritional ketosis (栄養性ケトーシス)","diabetic ketosis (糖尿病性ケトーシス)"],"synonyms":["ketoacidosis (重度のケトーシス)","fat adaptation","metabolic ketogenesis"],"antonyms":["glycolysis (解糖系)","glucose metabolism (グルコース代謝)"]},{"part_of_speech":"noun","definition":"（獣医学）妊娠末期の羊や牛などに見られる代謝性疾患で、エネルギー需要を満たすために脂肪が過剰に分解され、ケトン体が蓄積する。","english_definition":"(Veterinary medicine) A metabolic disease occurring in late pregnancy in sheep and cattle, characterized by excessive fat breakdown to meet energy demands, leading to ketone body accumulation.","examples":[{"sentence":"Ketosis is a common problem in dairy cows after calving.","translation":"ケトーシスは、分娩後の乳牛によく見られる問題である。"},{"sentence":"Treatment for ketosis in sheep involves providing glucose and correcting electrolyte imbalances.","translation":"羊のケトーシスの治療には、グルコースの投与と電解質バランスの是正が含まれる。"}],"collocations":["ovine ketosis (羊のケトーシス)","bovine ketosis (牛のケトーシス)","pregnancy ketosis (妊娠ケトーシス)","postparturient ketosis (分娩後ケトーシス)"],"synonyms":["pregnancy toxemia (妊娠中毒症)","acetonemia"],"antonyms":[]}],"etymology":{"value":"「ketone（ケトン）」+ 「-osis（状態）」に由来する。ケトン体の過剰な状態を示す。","priority":"★★☆"},"pronunciation":{"ipa":"/kiˈtoʊsɪs/","syllables":"ke-to-sis"},"inflection":{"noun_plural":"ketoses"},"usage_notes":{"explanation":"「**Ketosis**」は、体内の主要なエネルギー源が炭水化物ではなく脂肪になった状態を指します。これは、ケトジェニックダイエット、断食、または糖尿病などの特定の病状によって引き起こされる可能性があります。ケトーシスの状態では、肝臓が脂肪をケトン体に分解し、これが脳や他の組織のエネルギー源となります。栄養性ケトーシスは一般に安全と考えられていますが、糖尿病性ケトーシスは深刻な医学的緊急事態です。獣医学の文脈では、妊娠中の動物（特に羊や牛）における代謝性疾患を指します。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am in ketosis because I ate a lot of ketones.","correct":"✓ I am in ketosis because I am following a ketogenic diet.","note":"ケトーシスはケトン体を摂取することによって起こるのではなく、炭水化物の摂取を制限し、脂肪を主なエネルギー源とすることによって起こります。"},{"incorrect":"✗ Ketosis is always a dangerous condition.","correct":"✓ Nutritional ketosis is generally safe, but diabetic ketoacidosis is dangerous.","note":"栄養性ケトーシスは通常安全ですが、糖尿病性ケトアシドーシスは危険な状態です。ケトーシスの種類によって危険度が異なります。"},{"incorrect":"✗ Ketosis is the same as ketoacidosis.","correct":"✓ Ketosis is a metabolic state, while ketoacidosis is a dangerous complication of diabetes.","note":"ケトーシスは代謝状態であり、ケトアシドーシスは糖尿病の合併症です。ケトアシドーシスは、ケトン体のレベルが非常に高く、血液が酸性になる状態を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["ketogenic (形容詞: ケトジェニックの)","ketone (名詞: ケトン)","ketoacidosis (名詞: ケトアシドーシス)","ketonemia (名詞: ケトン血症)","ketonuria (名詞: ケトン尿症)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 医学・栄養学分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Ketosis**（ケトーシス）」は、体がエネルギー源として主に脂肪を使用し、炭水化物の代わりにケトン体を生成する代謝状態を指します。この状態は、ケトジェニックダイエットや断食によって意図的に引き起こされることがありますが、コントロール不良の糖尿病など、特定の病状によっても発生する可能性があります。ケトーシスとケトアシドーシスは異なる概念であり、ケトアシドーシスはケトン体の危険な蓄積を伴う深刻な状態です。また、獣医学では、妊娠中の動物（特に羊や牛）に見られる特有の代謝性疾患を指すこともあります。この単語は、医学、栄養学、獣医学の分野で頻繁に使用されます。"},"example_sentences":[{"sentence":"The athlete aimed to achieve **ketosis** to improve their endurance.","translation":"そのアスリートは、持久力を向上させるためにケトーシス状態になることを目指した。","type":"noun","meaning_category":"代謝状態"},{"sentence":"**Ketosis** in dairy cows can lead to decreased milk production.","translation":"乳牛のケトーシスは、乳生産量の減少につながる可能性がある。","type":"noun","meaning_category":"獣医学的疾患"},{"sentence":"A ketogenic diet is designed to induce **ketosis**.","translation":"ケトジェニックダイエットは、ケトーシスを誘導するように設計されている。","type":"noun","meaning_category":"代謝状態"},{"sentence":"Symptoms of **ketosis** may include increased thirst and frequent urination.","translation":"ケトーシスの症状には、喉の渇きや頻尿などがある。","type":"noun","meaning_category":"代謝状態"},{"sentence":"Monitoring ketone levels is important when following a ketogenic diet to ensure safe **ketosis**.","translation":"安全なケトーシスを確保するために、ケトジェニックダイエット中はケトンレベルを監視することが重要である。","type":"noun","meaning_category":"代謝状態"}]}