{"word":"hydrofoil","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水中翼船、水中翼","english_definition":"a type of boat or ship that has wing-like structures (hydrofoils) under the hull that lift the vessel out of the water at high speeds, reducing drag and allowing for faster travel; also, one of the wing-like structures themselves.","examples":[{"sentence":"The hydrofoil skimmed across the water at high speed.","translation":"水中翼船は高速で水面を滑走した。"},{"sentence":"Hydrofoils are used to reduce the drag on the boat.","translation":"水中翼はボートの抵抗を減らすために使われる。"},{"sentence":"We took a hydrofoil to the island.","translation":"私たちは水中翼船で島へ行った。"}],"collocations":["hydrofoil boat","hydrofoil ferry","ride a hydrofoil","hydrofoil design","hydrofoil technology"],"synonyms":["foil boat","wing-in-ground-effect craft (WIG)"],"antonyms":[]}],"etymology":{"value":"The word \"hydrofoil\" is a combination of \"hydro-\" (from Greek \"ὕδωρ\" (hýdōr) meaning \"water\") and \"foil\" (referring to a wing-like structure).","priority":"★★★"},"pronunciation":{"ipa":"ˈhaɪdroʊfɔɪl","syllables":"hy·dro·foil"},"inflection":{"noun_plural":"hydrofoils"},"usage_notes":{"explanation":"A hydrofoil is a boat that uses wing-like structures called hydrofoils to lift the hull out of the water when it reaches a certain speed. This reduces drag, allowing the boat to travel much faster than conventional boats. Hydrofoils are often used for passenger ferries and military applications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hydrofile.","correct":"✓ I saw a hydrofoil.","note":"The correct spelling is \"hydrofoil,\" not \"hydrofile.\""}],"priority":"★★☆"},"related_words":{"derivatives":["hydrofoiling (noun: the activity of riding a hydrofoil)"],"related_terms":["hull","foil","boat","ship","maritime","aerodynamics","fluid dynamics"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hydrofoil\" refers to a specific type of watercraft that utilizes wing-like structures beneath its hull to lift itself out of the water at higher speeds. This design reduces drag, enabling faster travel. Understanding the term requires some familiarity with nautical and engineering concepts. It's not a commonly used word in everyday conversation, but it's relevant in contexts involving maritime technology and transportation.","priority":"★★★"},"example_sentences":[{"sentence":"The **hydrofoil** offered a smooth and rapid journey across the bay.","translation":"その水中翼船は湾を横切るスムーズで迅速な旅を提供した。","type":"noun","meaning_category":"水中翼船"},{"sentence":"The design of the **hydrofoil** reduces water resistance.","translation":"その水中翼の設計は水の抵抗を減らす。","type":"noun","meaning_category":"水中翼"},{"sentence":"The ferry was a modern **hydrofoil**, capable of high speeds.","translation":"そのフェリーは高速が出せる最新の水中翼船だった。","type":"noun","meaning_category":"水中翼船"}]}