{"word":"unfamously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"(皮肉を込めて) 有名でないように、知られていないように、悪名高くないように","english_definition":"(ironically) in a way that is not famous or well-known, or not notorious.","examples":[{"sentence":"Unfamously, the band broke up after only one album.","translation":"あまり知られていないことだが、そのバンドはアルバム一枚で解散した。"},{"sentence":"Unfamously, the small town is actually the birthplace of a major historical figure.","translation":"あまり知られていないことだが、その小さな町は実はある重要な歴史的人物ゆかりの地である。"},{"sentence":"The restaurant, unfamously located in a back alley, serves the best ramen in the city.","translation":"あまり知られていない裏通りにあるそのレストランは、市内最高のラーメンを提供している。"}],"collocations":["unfamously located","unfamously known","unfamously said"],"synonyms":["obscurely","inconspicuously","quietly","secretly","privately"],"antonyms":["famously","notoriously","prominently","widely","publicly"]}],"etymology":{"value":"\"un-\" (not) + \"famously\" (in a famous manner). Essentially, the opposite of \"famously\". Often used ironically.","priority":"★☆☆"},"pronunciation":{"ipa":"/ʌnˈfeɪməsli/","syllables":"un-fa-mous-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Unfamously\" is often used ironically to introduce a fact that is actually quite well-known or should be well-known, creating a humorous or sarcastic effect. It can also genuinely mean 'not famous' or 'not well-known', but this usage is less common. The tone is usually self-aware or tongue-in-cheek.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unfamously won the award.","correct":"✓ He famously won the award.","note":"Use \"famously\" when someone is well-known for achieving something. \"Unfamously\" implies the opposite."},{"incorrect":"✗ The unfamously building is very beautiful.","correct":"✓ The relatively unknown building is very beautiful.","note":"If you mean the building is not well-known, use \"relatively unknown\" or \"little-known\" instead of \"unfamously\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["unfamous (adjective)"],"phrases":["unfamously known for","unfamously located near"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unfamously\" means \"not famously.\" It's often used in a humorous or sarcastic way to introduce something that you might expect to be famous but isn't. For example, you might say, \"Unfamously, the band only released one album before breaking up,\" implying that the band's lack of fame is somewhat surprising or ironic. It is not a very common word."},"example_sentences":[{"sentence":"Unfamously, the author's first book was a complete failure.","translation":"あまり知られていないことだが、その作家の最初の本は完全に失敗だった。","type":"adverb","meaning_category":"not famous"},{"sentence":"The restaurant, unfamously tucked away on a side street, is a local favorite.","translation":"あまり知られていない脇道にひっそりと佇むそのレストランは、地元の人々に人気がある。","type":"adverb","meaning_category":"not well-known"},{"sentence":"Unfamously, the company's success was built on unethical practices.","translation":"あまり知られていないことだが、その会社の成功は非倫理的な慣行の上に築かれた。","type":"adverb","meaning_category":"ironic"}]}