{"word":"protocolist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"儀典官、式典係、プロトコル専門家","english_definition":"A person skilled in or concerned with matters of protocol, especially in diplomatic or governmental circles.","examples":[{"sentence":"The protocolist ensured that all dignitaries were seated in the correct order.","translation":"儀典官は、すべての高官が正しい順序で着席していることを確認した。"},{"sentence":"As a protocolist, she advises the government on diplomatic etiquette.","translation":"儀典官として、彼女は外交儀礼について政府に助言する。"},{"sentence":"The protocolist meticulously planned the state visit.","translation":"儀典官は、国賓訪問を綿密に計画した。"}],"collocations":["chief protocolist","senior protocolist","state protocolist","protocolist for the embassy","protocolist at the United Nations"],"synonyms":["ceremonialist","etiquette expert","master of ceremonies","diplomatic advisor","protocol officer"],"antonyms":[]}],"etymology":{"value":"The word \"protocolist\" is derived from \"protocol\" (a set of rules or procedures) with the suffix \"-ist\" (denoting a person who practices or is concerned with something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊtəkəlɪst/","syllables":"pro-to-col-ist"},"inflection":{"noun_plural":"protocolists"},"usage_notes":{"explanation":"A \"protocolist\" is someone who is an expert in or deals with protocol, which are the established rules and accepted behavior used in formal settings, especially in government, diplomacy, and international relations. They ensure that events and interactions follow the correct procedures and etiquette.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protocolist is responsible for the security of the event.","correct":"✓ The protocolist is responsible for the proper etiquette of the event.","note":"Protocolists focus on etiquette and procedures, not security. Security is handled by security personnel."},{"incorrect":"✗ Protocolist are not important in modern diplomacy.","correct":"✓ Protocolists are important in modern diplomacy.","note":"Protocolists play a crucial role in ensuring smooth and respectful interactions in diplomacy."}],"priority":"★★☆"},"related_words":{"derivatives":["protocol (noun)","protocolar (adjective)","protocolary (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"protocolist\" is a specialized term referring to an expert in protocol, which involves the rules of etiquette and procedure, particularly in diplomatic or governmental contexts. It is not a commonly used word in everyday conversation, but it is relevant in professional settings where formal procedures and etiquette are important. Understanding this term requires familiarity with the concept of protocol itself."},"example_sentences":[{"sentence":"The protocolist advised the ambassador on the correct forms of address.","translation":"儀典官は大使に正しい敬称について助言した。","type":"example","meaning_category":"General"},{"sentence":"The protocolist's attention to detail ensured a successful summit.","translation":"儀典官の細部への配慮が、サミットの成功を確実にした。","type":"example","meaning_category":"General"},{"sentence":"The new protocolist was quickly overwhelmed by the complexity of the role.","translation":"新しい儀典官は、すぐにその役割の複雑さに圧倒された。","type":"example","meaning_category":"General"}]}