{"word":"superfeudation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)再封建、二重封建：封建領主が、自らの領地をさらに下位の領主に封建すること。","english_definition":"(historical) The act of a feudal lord granting a fief to a sub-vassal, who then becomes a vassal of the original lord; the creation of a sub-fief.","examples":[{"sentence":"The practice of superfeudation led to a complex hierarchy of land ownership in medieval Europe.","translation":"再封建の慣習は、中世ヨーロッパにおける土地所有の複雑な階層構造につながった。"},{"sentence":"Superfeudation allowed powerful lords to extend their influence and control over larger territories.","translation":"再封建は、有力な領主がより広大な領土に対する影響力と支配力を拡大することを可能にした。"}],"collocations":["practice superfeudation","prevent superfeudation","result of superfeudation"],"synonyms":["subinfeudation"],"antonyms":[]}],"etymology":{"value":"\"Super-\" (above, beyond) + \"feudation\" (the granting of a fief). From Medieval Latin \"superfeudatio\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˌfjuːˈdeɪʃən/","syllables":"su-per-feu-da-tion"},"inflection":{"noun_plural":"superfeudations"},"usage_notes":{"explanation":"\"Superfeudation\" refers to the historical practice within feudal systems where a vassal, who has received land from a lord, then divides that land and grants portions of it to their own vassals, creating a sub-fiefdom. This process could be repeated, leading to a complex hierarchy of land ownership and obligations. It's primarily a historical term used in the context of feudalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The king practiced superfeudation directly to the peasants.","correct":"✓ The king's vassals practiced superfeudation to the peasants.","note":"Superfeudation is not typically practiced directly to the lowest class (peasants) but rather between lords and their vassals."}],"priority":"★☆☆"},"related_words":{"derivatives":["feudation","fief","vassal","subinfeudation","feudalism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Superfeudation\" is a specialized historical term relating to feudalism. It describes the practice where a feudal lord grants a portion of their land (a fief) to another person, who then becomes their vassal. This new vassal can, in turn, grant portions of their land to others, creating a chain of sub-vassals. Understanding this term requires a solid grasp of feudal systems and their hierarchical structure. It is not commonly used outside of historical contexts or academic discussions of feudalism."},"example_sentences":[{"sentence":"The statute aimed to limit superfeudation to prevent the fragmentation of land ownership.","translation":"その法令は、土地所有の細分化を防ぐために再封建を制限することを目的とした。","type":"general","meaning_category":"historical context"},{"sentence":"Through superfeudation, the king's direct control over the land diminished.","translation":"再封建を通じて、国王の土地に対する直接的な支配力は弱まった。","type":"general","meaning_category":"historical context"}]}