{"word":"father-long-legs","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(俗語) ザトウムシ","english_definition":"(common name) an arachnid of the order Opiliones, characterized by a small oval body and very long, thin legs; also known as a harvestman.","examples":[{"sentence":"I saw a father-long-legs crawling on the wall.","translation":"壁にザトウムシが這っているのを見ました。"},{"sentence":"Father-long-legs are often mistaken for spiders, but they are not true spiders.","translation":"ザトウムシはよくクモと間違われますが、本当のクモではありません。"}],"collocations":["harvestman","daddy longlegs","Opiliones"],"synonyms":["harvestman","daddy longlegs"],"antonyms":[]},{"part_of_speech":"noun","definition":"(米国) ユスリカ","english_definition":"(US) a crane fly, especially one with very long legs.","examples":[{"sentence":"The father-long-legs was flying around the porch light.","translation":"ユスリカが玄関の明かりの周りを飛んでいました。"}],"collocations":["crane fly"],"synonyms":["crane fly"],"antonyms":[]}],"etymology":{"value":"The origin of the name is uncertain, but it likely refers to the insect's (or arachnid's) extremely long and thin legs in proportion to its body. The 'father' part may be a playful or descriptive addition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɑːðərˌlɒŋˌlɛɡz/","syllables":"fa-ther-long-legs"},"inflection":{"noun_plural":"father-long-legs"},"usage_notes":{"explanation":"The term \"father-long-legs\" is ambiguous, as it refers to two different creatures: harvestmen (Opiliones) and crane flies (Tipulidae). In British English, it usually refers to harvestmen, which are arachnids but not spiders. In American English, it more commonly refers to crane flies, which are insects. Therefore, it's important to be aware of the regional differences in usage to avoid confusion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Father-long-legs are insects.","correct":"✓ Father-long-legs (harvestmen) are arachnids. / ✓ Father-long-legs (crane flies) are insects.","note":"It's important to specify whether you're referring to harvestmen (arachnids) or crane flies (insects) to avoid biological inaccuracies."},{"incorrect":"✗ Father-long-legs have venom.","correct":"✓ Harvestmen (father-long-legs) do not have venom.","note":"Harvestmen (father-long-legs) do not have venom glands and are harmless to humans. Crane flies also do not have venom."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的小さな頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Father-long-legs\" is a colloquial name for two different types of creatures: harvestmen (arachnids) and crane flies (insects). It is important to know which creature is being referred to, as the term is ambiguous. In British English, it usually refers to harvestmen, while in American English, it more commonly refers to crane flies. This term is not typically used in formal scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The child was fascinated by the father-long-legs crawling across the patio.","translation":"子供はパティオを這うザトウムシに魅了された。","type":"noun","meaning_category":"ザトウムシ (harvestman)"},{"sentence":"A father-long-legs flew into the room and bumped against the window.","translation":"ユスリカが部屋に飛び込んできて窓にぶつかった。","type":"noun","meaning_category":"ユスリカ (crane fly)"}]}