{"word":"low-residue","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(食品・食事などが)低残渣の","english_definition":"(of food or a diet) containing little undigested material that remains in the intestine after digestion.","examples":[{"sentence":"A low-residue diet is often prescribed before and after bowel surgery.","translation":"低残渣食は、腸の手術の前後によく処方されます。"},{"sentence":"White rice is a low-residue food, while brown rice is not.","translation":"白米は低残渣食品ですが、玄米はそうではありません。"}],"collocations":["low-residue diet","low-residue foods"],"synonyms":["low-fiber"],"antonyms":["high-residue","high-fiber"]}],"etymology":{"value":"The term 'low-residue' is derived from the fact that these foods leave a small amount of 'residue' (undigested material) in the digestive tract.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌloʊ ˈrɛzɪduː/","syllables":"low-res-i-due"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"A 'low-residue' diet is designed to reduce the amount of undigested material passing through the bowel. It is often prescribed for people with certain digestive disorders or those recovering from bowel surgery. The diet typically restricts high-fiber foods such as whole grains, raw fruits and vegetables, nuts, and seeds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm on a low-residue diet to lose weight.","correct":"✓ A low-residue diet is typically used for digestive issues, not weight loss.","note":"Low-residue diets are not primarily intended for weight loss. They are used for specific medical conditions."}],"priority":"★☆☆"},"related_words":{"derivatives":["residue (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'low-residue' refers to foods that are easily digested and leave very little undigested material in the intestines. This type of diet is often recommended for people with digestive problems, such as Crohn's disease or ulcerative colitis, or for those recovering from surgery on the digestive tract. It involves avoiding high-fiber foods like whole grains, nuts, seeds, and raw fruits and vegetables. The goal is to reduce bowel movements and give the digestive system a rest."},"example_sentences":[{"sentence":"After the colonoscopy, the doctor recommended a **low-residue** diet for a few days.","translation":"大腸内視鏡検査の後、医師は数日間、低残渣食を勧めました。","type":"adjective","meaning_category":"dietary"},{"sentence":"Patients with diverticulitis often benefit from a **low-residue** diet during flare-ups.","translation":"憩室炎の患者は、発作時に低残渣食が有効なことが多いです。","type":"adjective","meaning_category":"medical"}]}