{"word":"stipendiarian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"奨学金受給者、俸給生活者","english_definition":"A person who receives a stipend or salary.","examples":[{"sentence":"The college employs several stipendiarians to teach undergraduate courses.","translation":"その大学は学部課程を教えるために数人の俸給生活者を雇用している。"},{"sentence":"As a stipendiarian, he was able to focus on his research without financial worries.","translation":"奨学金受給者として、彼は経済的な心配をせずに研究に集中できた。"}],"collocations":["stipendiary magistrate"],"synonyms":["pensioner","beneficiary","scholarship holder","grant recipient"],"antonyms":["patron","benefactor"]},{"part_of_speech":"adjective","definition":"奨学金を受けている、俸給を受けている","english_definition":"Receiving or dependent on a stipend or salary.","examples":[{"sentence":"The stipendiarian clergy were often poorly paid.","translation":"俸給を受けている聖職者はしばしば薄給だった。"},{"sentence":"He held a stipendiarian position at the university.","translation":"彼は大学で俸給を受ける地位にあった。"}],"collocations":["stipendiary position","stipendiary clergy"],"synonyms":["salaried","compensated","subsidized","remunerated"],"antonyms":["voluntary","unpaid"]}],"etymology":{"value":"From Latin stipendium (tax, tribute, soldier's pay), from stips (small coin, alms) + pendere (to weigh out, pay).","priority":"★★☆"},"pronunciation":{"ipa":"/staɪˌpɛnˈdɪəriən/","syllables":"sty-pen-di-ar-i-an"},"inflection":{"noun_plural":"stipendiarians"},"usage_notes":{"explanation":"The term 'stipendiarian' is somewhat formal and less commonly used in modern English. It often implies a formal arrangement where someone receives regular payments for work or study. It is more frequently encountered in academic or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a stipendiarian of the company.","correct":"✓ He is an employee of the company.","note":"'Stipendiarian' implies receiving a stipend or grant, not just being an employee."}],"priority":"★☆☆"},"related_words":{"derivatives":["stipend (noun: a fixed regular payment, typically a salary or allowance)"],"related_terms":["stipendiary (adjective/noun: receiving or relating to a stipend)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'stipendiarian' is a relatively uncommon and formal term. It refers to someone who receives a stipend, which is a fixed, regular payment, often for students or clergy. Understanding this word requires a good grasp of formal vocabulary and contexts related to academia or historical roles.","priority":"★★☆"},"example_sentences":[{"sentence":"The stipendiarian researchers were able to dedicate their time fully to the project.","translation":"奨学金を受けている研究者たちは、プロジェクトに完全に時間を費やすことができた。","type":"noun","meaning_category":"奨学金受給者"},{"sentence":"He accepted a stipendiarian lectureship at the prestigious institution.","translation":"彼はその名門機関で俸給制の講師の職を引き受けた。","type":"adjective","meaning_category":"俸給を受けている"}]}