{"word":"transfusional","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"輸血の、輸血に関する","english_definition":"Relating to or involving transfusion, especially blood transfusion.","examples":[{"sentence":"Transfusional iron overload is a common complication in patients receiving chronic blood transfusions.","translation":"輸血による鉄過剰症は、慢性的に輸血を受けている患者によく見られる合併症です。"},{"sentence":"Transfusional support is crucial for patients with severe anemia.","translation":"輸血によるサポートは、重度の貧血患者にとって非常に重要です。"}],"collocations":["transfusional iron overload","transfusional support","transfusional reactions"],"synonyms":["blood transfusion-related"],"antonyms":[]}],"etymology":{"value":"From transfusion + -al.","priority":"☆☆☆"},"pronunciation":{"ipa":"/trænsˈfjuːʒənəl/","syllables":"trans-fu-sion-al"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'transfusional' is primarily used in medical contexts to describe conditions, procedures, or complications associated with blood transfusions. It is often used to specify that a particular issue is a direct result of, or related to, the transfusion process itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had a transfusional reaction to the surgery.","correct":"✓ The patient had a reaction to the blood transfusion during the surgery.","note":"'Transfusional' specifically relates to the transfusion itself, not the surgery. If the reaction is to the transfusion, 'transfusional reaction' is correct. If it's related to the surgery, specify 'reaction to the blood transfusion during the surgery'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["transfusion (noun)","transfuse (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'transfusional' is a technical term primarily used in medical contexts. Understanding its meaning requires familiarity with medical terminology and procedures related to blood transfusions. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient developed a serious transfusional reaction after receiving the blood.","translation":"患者は輸血を受けた後、重篤な輸血反応を起こしました。","type":"adjective","meaning_category":"輸血の"},{"sentence":"Careful monitoring is essential to prevent transfusional complications.","translation":"輸血による合併症を防ぐためには、注意深いモニタリングが不可欠です。","type":"adjective","meaning_category":"輸血の"}]}