{"word":"numerative","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"助数詞（じょすうし）","english_definition":"A word or symbol used to count nouns; a counter.","examples":[{"sentence":"In Japanese, different numeratives are used depending on the shape, size, and type of the object being counted.","translation":"日本語では、数えるものの形、大きさ、種類によって異なる助数詞が使われます。"},{"sentence":"'Mai' is a common numerative used for counting flat objects.","translation":"「枚」は、平らな物を数えるときによく使われる助数詞です。"}],"collocations":["use a numerative","different numeratives","Japanese numeratives"],"synonyms":["counter","classifier"],"antonyms":[]},{"part_of_speech":"adjective","definition":"数を示す、数に関する","english_definition":"Relating to or expressing a number or quantity.","examples":[{"sentence":"Numerative adjectives are used to indicate the quantity of a noun.","translation":"数形容詞は、名詞の数量を示すために使用されます。"},{"sentence":"The numerative system varies across different languages.","translation":"数詞体系は、言語によって異なります。"}],"collocations":["numerative adjective","numerative system"],"synonyms":["numerical","quantitative"],"antonyms":["qualitative"]}],"etymology":{"value":"From Latin 'numerare' (to count), related to 'numerus' (number) + '-ive'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnjuːmərətɪv/","syllables":"nu-mer-a-tive"},"inflection":{"noun_plural":"numeratives","adjective_forms":{}},"usage_notes":{"explanation":"In linguistics, 'numerative' refers to a word or morpheme that classifies nouns for counting purposes. It is particularly important in languages like Japanese, Chinese, and Korean, where you cannot simply say 'one book' but must use a specific counter depending on the type of object (e.g., 'one *volume* of book'). As an adjective, it describes something related to numbers or counting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the wrong numberative for the animal.","correct":"✓ He used the wrong numerative for the animal.","note":"The correct spelling is 'numerative', not 'numberative'."},{"incorrect":"✗ Numerative is not important in English.","correct":"✓ Numeratives are not as important in English as they are in languages like Japanese.","note":"While English has some classifiers (e.g., 'a piece of cake'), it doesn't rely on numeratives to the same extent as many East Asian languages."}],"priority":"★★☆"},"related_words":{"derivatives":["enumerate","numerical","number"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'numerative' is a technical term primarily used in linguistics to describe words or affixes that classify nouns for counting. It's most relevant when discussing languages with classifier systems, such as Japanese or Chinese. It's not a common word in everyday conversation, but understanding it is helpful for those studying language structure. As an adjective, it simply means 'relating to numbers', but this usage is less frequent than the noun form."},"example_sentences":[{"sentence":"The student struggled to learn the various Japanese numeratives.","translation":"学生は、さまざまな日本語の助数詞を学ぶのに苦労しました。","type":"noun","meaning_category":"助数詞"},{"sentence":"The numerative system in that language is quite complex.","translation":"その言語の数詞体系は非常に複雑です。","type":"adjective","meaning_category":"数に関する"}]}