{"word":"single-farm","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一農場の、単一農家による","english_definition":"Relating to or originating from a single farm.","examples":[{"sentence":"This coffee is a single-farm blend, ensuring a unique flavor profile.","translation":"このコーヒーは単一農園のブレンドで、独特の風味を保証します。"},{"sentence":"We source our produce from single-farm operations to support local farmers.","translation":"地元の農家を支援するため、単一農家から農産物を調達しています。"},{"sentence":"The cheese is made with milk from a single-farm dairy.","translation":"このチーズは、単一農場の酪農家からの牛乳で作られています。"}],"collocations":["single-farm coffee","single-farm dairy","single-farm operation","single-farm source","single-farm product"],"synonyms":["estate-grown","single-origin","small-farm","artisan"],"antonyms":["multi-farm","mass-produced","commercial"],"notes":"Often used in the context of specialty foods and beverages, emphasizing quality and traceability."}],"etymology":{"value":"Combination of 'single' and 'farm', indicating that the product or operation originates from one specific farm.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈfɑːrm/","syllables":"sin-gle-farm"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Single-farm' is commonly used in marketing to highlight the origin and quality of a product, suggesting a connection to a specific place and farming practice. It implies a more direct relationship between the producer and the consumer, often associated with sustainable or ethical farming practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The single farm is very big.","correct":"✓ The farm is a single entity.","note":"'Single-farm' is used to describe the origin or type of product, not the size of the farm itself. Use 'single' to describe the farm as a single entity. "},{"incorrect":"✗ This is a single farm product.","correct":"✓ This is a single-farm product.","note":"Hyphenate 'single-farm' when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["single-origin (similar concept, often used for coffee and chocolate)","farm-to-table (emphasizing direct sourcing from farms)","artisan (produced in a traditional or non-industrial way)"],"phrases":["farm-fresh","locally sourced","small-batch"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, specific to agricultural and food-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Single-farm' is a descriptive term used to indicate that a product comes from one particular farm, rather than being sourced from multiple farms or large-scale agricultural operations. It's often used to highlight the unique characteristics, quality, and traceability of the product, appealing to consumers who value knowing where their food comes from and supporting smaller, independent farms. You'll often see this term used in the context of coffee, dairy products, and other specialty foods."},"example_sentences":[{"sentence":"The olive oil is made from olives grown on a single-farm in Tuscany.","translation":"このオリーブオイルは、トスカーナの単一農場で栽培されたオリーブから作られています。","type":"adjective","meaning_category":"Origin"},{"sentence":"We visited a single-farm brewery that specializes in craft beers.","translation":"私たちは、クラフトビールを専門とする単一農場の醸造所を訪れました。","type":"adjective","meaning_category":"Type of operation"},{"sentence":"The restaurant prides itself on using single-farm ingredients whenever possible.","translation":"そのレストランは、可能な限り単一農場の食材を使用することを誇りに思っています。","type":"adjective","meaning_category":"Ingredients"}]}