{"word":"civically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"市民的に、市民として、公民として、市民の義務として","english_definition":"In a way that relates to civic matters or citizenship; in a manner befitting a citizen.","examples":[{"sentence":"We have a responsibility to be civically engaged.","translation":"私たちには市民として社会に関わる責任があります。"},{"sentence":"The project aims to improve the civically mindedness of young people.","translation":"そのプロジェクトは、若者の市民意識を高めることを目的としています。"},{"sentence":"He is civically active, volunteering his time to local causes.","translation":"彼は市民として積極的に活動しており、地元の活動に時間を費やしてボランティアをしています。"}],"collocations":["civically engaged","civically responsible","civically minded","civically active"],"synonyms":["publicly","socially","community-minded","patriotically"],"antonyms":["privately","personally","selfishly"]}],"etymology":{"value":"Derived from the adjective 'civic', which comes from the Latin word 'civicus', meaning 'relating to citizens'. The suffix '-ally' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪvɪkli/","syllables":"civ-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Civically' describes actions or behaviors that are related to the duties, rights, and responsibilities of citizens within a community or society. It often implies a sense of public duty, social responsibility, and engagement in community affairs. It is used to describe actions that contribute to the well-being of the community or promote civic values.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a civically person.","correct":"✓ He is a civic person. / ✓ He is civically engaged.","note":"'Civically' is an adverb and modifies verbs, adjectives, or other adverbs. 'Civic' is an adjective and modifies nouns. To describe someone who is involved in civic matters, use 'civic-minded' or 'civically engaged'."},{"incorrect":"✗ She participated civic in the meeting.","correct":"✓ She participated civically in the meeting.","note":"'Civically' modifies the verb 'participated'. Therefore, the adverb form is needed."}],"priority":"★★☆"},"related_words":{"derivatives":["civic (adjective)","civics (noun)","citizen (noun)","citizenship (noun)"],"phrases":["civic duty","civic responsibility","civic engagement","civic education"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'civically' is used to describe actions or behaviors that are related to the duties and responsibilities of citizens. It is often used in formal or academic contexts when discussing topics such as government, community involvement, and social responsibility. Because it is not a commonly used word, it is more likely to be encountered in written texts or formal speeches rather than everyday conversation."},"example_sentences":[{"sentence":"The organization aims to empower individuals to participate more civically in their communities.","translation":"その組織は、個人が地域社会に市民としてより積極的に参加できるようにすることを目指しています。","type":"adverb","meaning_category":"市民として"},{"sentence":"The company is committed to acting civically and ethically in all its business dealings.","translation":"同社は、すべての事業取引において、市民として倫理的に行動することに尽力しています。","type":"adverb","meaning_category":"市民の義務として"},{"sentence":"The school encourages students to become civically engaged through volunteer work and community service.","translation":"その学校は、ボランティア活動や地域奉仕を通じて、生徒が市民として社会に関わることを奨励しています。","type":"adverb","meaning_category":"市民として"}]}