{"word":"untypically-haired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having hair that is not typical or usual in some way.","english_definition":"Possessing hair that deviates from the norm or common expectation in terms of style, color, texture, or quantity.","examples":[{"sentence":"The character in the movie was described as untypically-haired, with bright purple locks that stood out in the crowd.","translation":"映画の登場人物は、群衆の中で目立つ明るい紫色の髪の毛を持つ、untypically-haired（普通ではない髪型）だと説明されていました。"},{"sentence":"Her untypically-haired appearance, featuring a shaved head on one side and long, flowing curls on the other, made her a striking figure.","translation":"片側を剃り上げ、もう片側を長く流れるカールにした彼女のuntypically-haired（普通ではない髪型）外見は、彼女を印象的な人物にしました。"}],"collocations":["untypically-haired individual","untypically-haired appearance","untypically-haired character","naturally untypically-haired","deliberately untypically-haired"],"synonyms":["unconventionally-haired","unusually-haired","distinctively-haired","eccentrically-haired","oddly-haired"],"antonyms":["typically-haired","conventionally-haired","ordinarily-haired","normally-haired","traditionally-haired"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'typically-haired', which itself is a combination of 'typically' (in a typical manner) and 'haired' (having hair).","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌnˈtɪpɪkli heərd/","syllables":"un-typ-i-cal-ly haired"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically expressed using 'more' and 'most' (e.g., 'more untypically-haired', 'most untypically-haired')."},"usage_notes":{"explanation":"This adjective is used to describe someone whose hair is notably different from what is considered standard or common. It can refer to a variety of unusual hair characteristics, including color, style, length, or texture. It's often used to emphasize the uniqueness or individuality of a person's appearance.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a untypically haired person.","correct":"✓ She is an untypically-haired person.","note":"Use 'an' before 'untypically' because it begins with a vowel sound."},{"incorrect":"✗ The untypically haired.","correct":"✓ The untypically-haired person.","note":"'untypically-haired' functions as an adjective and needs a noun to modify unless the context makes it clear who or what is being referred to."}],"priority":"N/A"},"related_words":{"derivatives":["untypically (adverb)","typically-haired (adjective)","haired (adjective)"],"related_terms":["unconventional","unusual","distinctive","eccentric","odd","unique","individualistic"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - likely a niche or descriptive term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'untypically-haired' is a descriptive adjective used to indicate that someone's hair is not conventional or ordinary. It's a relatively uncommon word and would likely be understood by those with a strong vocabulary or those familiar with descriptive language. The word is straightforward in its construction, combining the prefix 'un-' with 'typically-haired' to negate the typical nature of the hair. Understanding the individual components makes the word's meaning clear."},"example_sentences":[{"sentence":"The artist's model was known for her untypically-haired look, which included vibrant streaks of blue and green.","translation":"そのアーティストのモデルは、鮮やかな青と緑のストリークを含む、普通ではない髪型で知られていました。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"In the fantasy novel, the elves were often described as untypically-haired, with silver or gold strands interwoven into their braids.","translation":"ファンタジー小説では、エルフはしばしば、銀や金のストランドが編み込まれた、普通ではない髪型だと説明されていました。","type":"adjective","meaning_category":"Descriptive"}]}