{"word":"non-reductionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非還元主義：複雑な現象を、より単純な要素や原理に還元して説明しようとする試みに反対する立場。全体は部分の総和以上であり、複雑なシステムは、その構成要素だけでは理解できないという考え方。","english_definition":"The belief that not all phenomena can be explained in terms of simpler or more basic phenomena; the view that wholes are more than the sum of their parts.","examples":[{"sentence":"Non-reductionism argues that consciousness cannot be fully explained by the physical processes in the brain.","translation":"非還元主義は、意識は脳内の物理的プロセスだけでは完全に説明できないと主張する。"},{"sentence":"In biology, non-reductionism emphasizes the importance of emergent properties in complex systems.","translation":"生物学において、非還元主義は複雑なシステムにおける創発特性の重要性を強調する。"},{"sentence":"Critics of reductionism often advocate for a non-reductionist approach that considers the broader context.","translation":"還元主義の批判者は、より広い文脈を考慮する非還元主義的なアプローチを提唱することが多い。"}],"collocations":["argue for non-reductionism","non-reductionist approach","non-reductionist perspective","philosophical non-reductionism","scientific non-reductionism"],"synonyms":["holism","emergentism","anti-reductionism"],"antonyms":["reductionism","atomism","mechanism"]},{"part_of_speech":"adjective","definition":"非還元主義的な：非還元主義の立場をとる、またはそれに関連する。","english_definition":"Relating to or characterized by non-reductionism.","examples":[{"sentence":"A non-reductionist analysis of social phenomena considers the interactions between individuals and their environment.","translation":"社会現象の非還元主義的な分析は、個人と彼らの環境との間の相互作用を考慮する。"},{"sentence":"The author adopts a non-reductionist stance, arguing for the inherent complexity of human behavior.","translation":"著者は非還元主義的な立場をとり、人間の行動に内在する複雑さを主張する。"}],"collocations":["non-reductionist analysis","non-reductionist perspective","non-reductionist theory","non-reductionist explanation"],"synonyms":["holistic","emergentist"],"antonyms":["reductionist"]}],"etymology":{"value":"'non-' (否定の接頭辞) + 'reductionism' (還元主義)。還元主義に対する反対の立場を示すために作られた言葉。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒn.rɪˈdʌkʃənɪzəm/","syllables":"non-re-duc-tion-ism"},"inflection":{"noun_plural":"non-reductionisms"},"usage_notes":{"explanation":"'Non-reductionism' is often used in philosophical, scientific, and social science contexts. It's a reaction against the idea that complex systems can be fully understood by breaking them down into their simplest components. Instead, non-reductionists argue that the interactions and relationships between components create emergent properties that cannot be predicted or explained solely by studying the individual parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ non reductionism is a good way to understand everything.","correct":"✓ Non-reductionism is one perspective, but it's not universally applicable.","note":"Non-reductionism is a specific philosophical and scientific position, not a general solution to all problems."}],"priority":"★☆☆"},"related_words":{"derivatives":["non-reductionist (adjective, noun)"],"related_concepts":["holism","emergent properties","systems theory","complexity theory","reductionism","determinism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-reductionism' is a complex term used in philosophy and science. It means that some things can't be fully understood by just looking at their parts. Instead, you need to consider the whole system and how the parts interact. It's the opposite of 'reductionism,' which tries to explain everything in terms of simpler things. This term is usually found in advanced academic discussions."},"example_sentences":[{"sentence":"The theory of emergent properties is central to **non-reductionism**.","translation":"創発特性の理論は、非還元主義の中心である。","type":"noun","meaning_category":"非還元主義"},{"sentence":"A **non-reductionist** approach to medicine considers the patient's overall well-being, not just their symptoms.","translation":"医学への非還元主義的なアプローチは、患者の症状だけでなく、全体的な健康状態を考慮する。","type":"adjective","meaning_category":"非還元主義的な"}]}