{"word":"historicalness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"歴史性、歴史的な性質、歴史的な重要性","english_definition":"The quality of being historical; the degree to which something is historical or related to history.","examples":[{"sentence":"The historicalness of the artifact made it a valuable addition to the museum's collection.","translation":"その工芸品の歴史性が、博物館のコレクションにとって貴重な追加物となった。"},{"sentence":"The debate centered on the historicalness of the events described in the ancient text.","translation":"その議論は、古代文書に記述された出来事の歴史性を中心に展開された。"},{"sentence":"The historicalness of the building is protected by law.","translation":"その建物の歴史性は法律で保護されている。"}],"collocations":["assess the historicalness","emphasize the historicalness","preserve the historicalness","lack historicalness"],"synonyms":["historicity","historical quality","historical significance","antiquity","pastness"],"antonyms":["ahistoricity","unhistoricalness","modernity","presentness"]}],"etymology":{"value":"'Historical' + '-ness'. From the adjective 'historical' (relating to history) and the suffix '-ness' (denoting a state, condition, or quality).","priority":"★★★"},"pronunciation":{"ipa":"/hɪˈstɒrɪkəlnəs/","syllables":"his-tor-i-cal-ness"},"inflection":{"noun_plural":"historicalnesses (rarely used)"},"usage_notes":{"explanation":"'Historicalness' refers to the quality or degree to which something is historical. It is often used in academic or formal contexts when discussing the authenticity, significance, or nature of historical events, objects, or periods. It is less commonly used in everyday conversation. The related term 'historicity' is often used synonymously, but can also refer specifically to the question of whether something actually happened in the past.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The historicalness of the movie was questioned.","correct":"✓ The historical accuracy of the movie was questioned.","note":"'Historical accuracy' is often a more appropriate term when discussing how accurately a movie or other representation reflects historical events. 'Historicalness' is more about the general quality of being historical."},{"incorrect":"✗ The historicalness of the moment was palpable.","correct":"✓ The historical significance of the moment was palpable.","note":"'Historical significance' is often a better phrase when referring to the importance or impact of a historical event or moment."}],"priority":"★★☆"},"related_words":{"derivatives":["historical","history","historicity","historic"],"phrases":["historical significance","historical accuracy","historical context"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Historicalness' is a relatively uncommon noun that refers to the quality or state of being historical. It's often used in academic or formal discussions about history, authenticity, and the nature of historical events or objects. It's not typically used in everyday conversation. You're more likely to encounter related terms like 'historical significance' or 'historicity' in general discussions about history."},"example_sentences":[{"sentence":"The professor emphasized the historicalness of the document during the lecture.","translation":"教授は講義中にその文書の歴史性を強調した。","type":"general","meaning_category":"historical quality"},{"sentence":"The debate revolved around the historicalness of the legendary figure.","translation":"その議論は、伝説的な人物の歴史性をめぐって展開された。","type":"general","meaning_category":"historical nature"},{"sentence":"The museum sought to enhance the historicalness of its exhibits through interactive displays.","translation":"博物館は、インタラクティブな展示を通して、展示物の歴史性を高めようとした。","type":"general","meaning_category":"historical importance"}]}