{"word":"Scorious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"多孔質の、穴だらけの、溶岩滓のような","english_definition":"Resembling or containing scoria; full of holes and rough like scoria.","examples":[{"sentence":"The volcanic landscape was scorious and barren.","translation":"その火山性の風景は多孔質で不毛だった。"},{"sentence":"Scorious rocks are often found near volcanoes.","translation":"多孔質の岩石は火山付近でよく見られる。"}],"collocations":["scorious lava","scorious rock","scorious surface"],"synonyms":["vesicular","porous","frothy","pitted"],"antonyms":["dense","solid","compact"]}],"etymology":{"value":"Derived from 'scoria', with the suffix '-ous' indicating resemblance or composition. 'Scoria' comes from Greek 'skōria' meaning 'dross, refuse'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskɔːriəs/","syllables":"scor-i-ous"},"inflection":{"notes":"Adjective, comparative and superlative forms are more scorious, most scorious, though these are not commonly used."},"usage_notes":{"explanation":"'Scorious' is primarily a descriptive term in geology, used to describe rocks or surfaces that are full of holes and resemble scoria, a type of volcanic rock. It is not commonly used outside of scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scorious metal was very strong.","correct":"✓ The porous metal was not very strong.","note":"'Scorious' implies a rough, hole-filled texture, which usually means the material is not strong. Use 'porous' instead if you mean the material has holes but might still be strong."}],"priority":"★☆☆"},"related_words":{"derivatives":["scoria (noun)","scoriaceous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scorious' is a technical term primarily used in geology to describe rocks that are vesicular or full of holes, resembling scoria. It is not a common word in everyday language and is typically encountered in scientific or descriptive contexts related to volcanic landscapes or materials."},"example_sentences":[{"sentence":"The surface of the asteroid was scorious, indicating a history of volcanic activity.","translation":"その小惑星の表面は多孔質で、火山活動の歴史を示していた。","type":"adjective","meaning_category":"多孔質の"},{"sentence":"We collected several samples of scorious rock from the lava field.","translation":"私たちは溶岩原から多孔質の岩石のサンプルをいくつか採取した。","type":"adjective","meaning_category":"穴だらけの"}]}