{"word":"haemoglobic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヘモグロビンに関する、ヘモグロビン性の","english_definition":"Relating to or containing hemoglobin.","examples":[{"sentence":"The haemoglobic content of the blood was measured.","translation":"血液中のヘモグロビン含有量が測定された。"},{"sentence":"Haemoglobic disorders can affect oxygen transport.","translation":"ヘモグロビン性の疾患は酸素輸送に影響を与える可能性がある。"}],"collocations":["haemoglobic level","haemoglobic concentration","haemoglobic disorder"],"synonyms":["hemoglobinic"],"antonyms":[]}],"etymology":{"value":"Derived from 'hemoglobin' (or 'haemoglobin' in British English) with the addition of the suffix '-ic', indicating 'relating to' or 'containing'. 'Hemoglobin' itself comes from 'heme' (from Greek 'haima' meaning blood) and 'globin' (a type of protein).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈɡlɒbɪk/","syllables":"hee-mo-glob-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative forms (more haemoglobic, most haemoglobic)."},"usage_notes":{"explanation":"'Haemoglobic' is a relatively uncommon adjective, primarily used in medical and scientific contexts. It describes something that is related to or contains hemoglobin, the protein in red blood cells responsible for carrying oxygen. The spelling 'haemoglobic' is more common in British English, while 'hemoglobic' is more common in American English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The haemoglobic are important for oxygen transport.","correct":"✓ Haemoglobin is important for oxygen transport. / ✓ Haemoglobic molecules are important for oxygen transport.","note":"'Haemoglobic' is an adjective and needs to modify a noun. 'Haemoglobin' is the noun. Using 'haemoglobic' on its own is grammatically incorrect."},{"incorrect":"✗ The patient has high haemoglobic.","correct":"✓ The patient has a high haemoglobic level. / ✓ The patient has high haemoglobin.","note":"'Haemoglobic' needs to modify a noun such as 'level', 'concentration', or 'content'. Alternatively, use the noun 'haemoglobin' directly."}],"priority":"★★☆"},"related_words":{"derivatives":["haemoglobin (noun): the protein in red blood cells that carries oxygen.","haemoglobinopathy (noun): a disease involving abnormal haemoglobin structure or function."],"related_terms":["erythrocyte (red blood cell)","oxygenation (the process of adding oxygen)","anemia (a condition characterized by a deficiency of red blood cells or of hemoglobin in the blood)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency. Primarily found in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haemoglobic' is a technical term primarily encountered in medical or scientific texts related to hematology (the study of blood). It describes something related to hemoglobin, the oxygen-carrying protein in red blood cells. Understanding this word requires familiarity with basic biology and medical terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor ordered a test to check the patient's haemoglobic levels.","translation":"医師は患者のヘモグロビンレベルをチェックするために検査を指示した。","type":"general","meaning_category":"medical"},{"sentence":"Certain genetic conditions can lead to haemoglobic abnormalities.","translation":"特定の遺伝的条件はヘモグロビンの異常につながる可能性がある。","type":"general","meaning_category":"medical"},{"sentence":"The haemoglobic content of the sample was within the normal range.","translation":"サンプルのヘモグロビン含有量は正常範囲内であった。","type":"technical","meaning_category":"scientific"}]}