{"word":"Sciuridae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リス科","english_definition":"The taxonomic family of rodents that includes squirrels, chipmunks, marmots, prairie dogs, and related species.","examples":[{"sentence":"Squirrels, chipmunks, and marmots all belong to the family Sciuridae.","translation":"リス、シマリス、マーモットはすべてリス科に属する。"}],"collocations":["Sciuridae family","Sciuridae species"],"synonyms":["squirrel family"],"antonyms":[]}],"etymology":{"value":"From the genus name Sciurus, which comes from the Greek words 'skia' (shadow) and 'oura' (tail), referring to the squirrel's bushy tail providing shade.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈjʊərɪdiː/","syllables":"Sci-u-ri-dae"},"inflection":{"noun_plural":"Sciuridae (科を表す場合は複数形にしない)"},"usage_notes":{"explanation":"'Sciuridae' is a scientific term used in biology and zoology to classify a specific family of rodents. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["sciurid (noun, an animal belonging to the Sciuridae family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Sciuridae' is a scientific term used in the field of zoology. It refers to the family of animals that includes squirrels, chipmunks, marmots, and prairie dogs. This term is primarily found in scientific literature and is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The diversity within the Sciuridae family is remarkable, with species adapted to various environments.","translation":"リス科内の多様性は著しく、さまざまな環境に適応した種がいる。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the behavior of different Sciuridae species in urban environments.","translation":"研究者たちは都市環境におけるさまざまなリス科の種の行動を研究している。","type":"research","meaning_category":"research"}]}