{"word":"mangkat","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(Javanese, honorific) to pass away, to die (said of respected persons)","english_definition":"(Javanese, honorific) to die; to pass away (used respectfully, especially of elders, royalty, or other respected figures).","examples":[{"sentence":"Kabar duka datang dari keraton, Sri Sultan Hamengkubuwono X mangkat tadi malam.","translation":"Sad news came from the palace, Sri Sultan Hamengkubuwono X passed away last night.","type":"example"},{"sentence":"Semoga arwah beliau tenang di sisi Tuhan Yang Maha Esa, setelah mangkat dengan tenang.","translation":"May his soul rest in peace with God Almighty, after passing away peacefully.","type":"example"}],"collocations":["mangkat ke rahmatullah (to pass away into God's mercy)","wafat/meninggal/mati (more common terms for 'to die')"],"synonyms":["wafat (more formal, often Islamic context)","meninggal dunia (standard Indonesian for 'to pass away')","mati (common, neutral term for 'to die', can be considered impolite in some contexts)"],"antonyms":["lahir (to be born)","hidup (to live)"]}],"etymology":{"value":"Derived from Javanese language, reflecting the hierarchical structure and respect for elders and royalty. The word is specifically used to show respect when referring to the death of someone held in high esteem.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑŋ.kat/","syllables":"mang-kat"},"inflection":{"verb_forms":{"present_simple":"mangkat","past_simple":"mangkat","future_simple":"mangkat"},"notes":"The form 'mangkat' does not change with tense in Javanese/Indonesian. Context determines the timing."},"usage_notes":{"explanation":"'Mangkat' is a highly honorific term for 'to die' in Javanese and Indonesian. It's crucial to use it appropriately, primarily when speaking about or to those deserving of great respect, such as royalty, elders, religious figures, or other highly esteemed individuals. Using 'mati' or 'meninggal' in such contexts would be considered disrespectful. While 'meninggal dunia' is a more polite and widely accepted alternative to 'mati,' 'mangkat' carries a stronger sense of reverence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya mangkat ke pasar kemarin.","correct":"Saya pergi ke pasar kemarin.","note":"'Mangkat' should not be used to mean 'to go' in everyday contexts. Use 'pergi' instead."},{"incorrect":"Anjing itu mangkat kemarin.","correct":"Anjing itu mati kemarin.","note":"'Mangkat' is not used for animals. Use 'mati' instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["swargi (deceased, often used before a name)","almarhum/almarhumah (deceased - Islamic term, masculine/feminine)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specific to Javanese and Indonesian, not typically included in CEFR)","frequency_google_ngram":"Low frequency, primarily in formal or traditional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"Difficult","text":"'Mangkat' is a culturally specific term with a restricted usage. Understanding its meaning requires knowledge of Javanese cultural norms and linguistic etiquette. It's not a word typically encountered in everyday Indonesian conversation but is important for understanding formal announcements or literature related to Javanese royalty or respected figures."},"example_sentences":[{"sentence":"Raja Jawa itu telah mangkat.","translation":"The Javanese king has passed away.","type":"example","meaning_category":"Death (honorific)"},{"sentence":"Berita mangkatnya ulama besar itu menyebar dengan cepat.","translation":"The news of the passing of the great religious scholar spread quickly.","type":"example","meaning_category":"Death (honorific)"}]}