{"word":"Guelphic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史) ゲルフ党の、教皇派の","english_definition":"(historical) Of or pertaining to the Guelphs, a political faction in medieval Italy that supported the Pope against the Holy Roman Emperor.","examples":[{"sentence":"The Guelphic faction was prominent in Florence.","translation":"ゲルフ党はフィレンツェで有力だった。"},{"sentence":"Guelphic sympathies were widespread in the region.","translation":"その地域ではゲルフ党への同情が広まっていた。"}],"collocations":["Guelphic League","Guelphic sympathies","Guelphic faction"],"synonyms":["Papal","pro-Papal"],"antonyms":["Ghibelline","pro-Imperial"]},{"part_of_speech":"noun","definition":"(歴史) ゲルフ党員、教皇派","english_definition":"(historical) A member of the Guelphs, a political faction in medieval Italy that supported the Pope against the Holy Roman Emperor.","examples":[{"sentence":"He was a staunch Guelphic.","translation":"彼は断固としたゲルフ党員だった。"},{"sentence":"The Guelphs and Ghibellines were often in conflict.","translation":"ゲルフ党とギベリン党はしばしば対立していた。"}],"collocations":["staunch Guelphic","Guelphs and Ghibellines"],"synonyms":["Papalist","pro-Papal supporter"],"antonyms":["Ghibelline","pro-Imperial supporter"]}],"etymology":{"value":"From Italian Guelfo, from Middle High German Welf, the family name of the dukes of Bavaria, who were leaders of the pro-Papal party in Germany and Italy.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡwɛlfɪk/","syllables":"Guel-phic"},"inflection":{"notes":"The noun form 'Guelphic' is less common than the adjective. The plural of the noun is 'Guelphics'."},"usage_notes":{"explanation":"The term 'Guelphic' refers specifically to the historical political faction in medieval Italy that supported the Pope against the Holy Roman Emperor. It is often used in contrast to 'Ghibelline,' which refers to the opposing faction that supported the Emperor. The term is primarily used in historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Guelphic supporter of the king.","correct":"✓ He was a Guelphic supporter of the Pope.","note":"Guelphs supported the Pope, not the king (Emperor)."},{"incorrect":"✗ Guelphic art is characterized by its imperial style.","correct":"✓ Guelphic art is characterized by its religious themes.","note":"Guelphic art (if the term is used) would likely reflect religious, rather than imperial, themes."}],"priority":"★★☆"},"related_words":{"derivatives":["Guelph (noun: a member of the Guelphic faction)","Guelphism (noun: the principles or policies of the Guelphs)"],"phrases":["Guelphs and Ghibellines (the two opposing factions in medieval Italy)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Very low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Guelphic' is a specialized historical term referring to a political faction in medieval Italy that supported the Pope against the Holy Roman Emperor. Understanding this term requires knowledge of medieval European history and the complex political landscape of the time. It is typically encountered in academic or historical texts. The antonym 'Ghibelline' is similarly specialized.","priority":"★★☆"},"example_sentences":[{"sentence":"The city of Florence was a stronghold of Guelphic power.","translation":"フィレンツェ市はゲルフ党の勢力拠点だった。","type":"adjective","meaning_category":"pertaining to the Guelphs"},{"sentence":"Many prominent Florentine families were Guelphics.","translation":"多くの著名なフィレンツェの家族がゲルフ党員だった。","type":"noun","meaning_category":"a member of the Guelphs"},{"sentence":"The conflict between Guelphic and Ghibelline factions shaped the political landscape of medieval Italy.","translation":"ゲルフ党とギベリン党の対立は、中世イタリアの政治情勢を形作った。","type":"adjective","meaning_category":"relating to the Guelphs and Ghibellines"}]}