{"word":"coemployed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"共同雇用されている","english_definition":"Employed by two or more employers at the same time.","examples":[{"sentence":"The nurses were coemployed by the hospital and a private clinic.","translation":"看護師たちは病院と個人クリニックによって共同雇用されていた。"},{"sentence":"Many adjunct professors are coemployed at multiple universities to make a living.","translation":"多くの非常勤講師は生計を立てるために複数の大学で共同雇用されている。"}],"collocations":["coemployed nurses","coemployed professors","coemployed workers"],"synonyms":["jointly employed","shared employee"],"antonyms":["solely employed","independently employed"]}],"etymology":{"value":"The word is formed by adding the prefix 'co-' (meaning 'together' or 'jointly') to the word 'employed'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌkoʊɪmˈplɔɪd/","syllables":"co-em-ployed"},"inflection":{"notes":"This word primarily functions as an adjective. There are no other inflections."},"usage_notes":{"explanation":"'Coemployed' describes a situation where an individual has employment relationships with more than one employer simultaneously. This can occur in various contexts, such as temporary staffing agencies, shared service arrangements, or when an individual works part-time for multiple organizations. The term is often used in legal and HR contexts to clarify responsibilities and liabilities of each employer.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The company coemployed to reduce costs.","correct":"✓ The company coemployed workers to reduce costs.","note":"'Coemployed' is an adjective describing the workers, not a verb describing the company's action."}],"priority":"N/A"},"related_words":{"derivatives":["coemployment (noun): the state of being coemployed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Coemployed' is a relatively uncommon term used in specific contexts, particularly in legal and human resources discussions. It describes the state of a worker who has employment relationships with multiple employers at the same time. Understanding this term is important for professionals dealing with complex employment arrangements."},"example_sentences":[{"sentence":"The consultants were coemployed by the government and a private firm.","translation":"コンサルタントは政府と民間企業によって共同雇用されていた。","type":"adjective","meaning_category":"joint employment"},{"sentence":"Coemployed staff often have complex benefit arrangements.","translation":"共同雇用されているスタッフは、しばしば複雑な福利厚生の取り決めを持っている。","type":"adjective","meaning_category":"joint employment"}]}