{"word":"paritarista","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(Latin America) A person who supports or advocates for gender parity, especially in political representation.","english_definition":"A person who supports or advocates for gender parity, especially in political representation.","examples":[{"sentence":"La candidata se describe como paritarista y defensora de los derechos de las mujeres.","translation":"The candidate describes herself as a supporter of gender parity and a defender of women's rights."}],"collocations":["movimiento paritarista","políticas paritaristas"],"synonyms":["igualitarista","feminista"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(Latin America) Relating to or supporting gender parity, especially in political representation.","english_definition":"Relating to or supporting gender parity, especially in political representation.","examples":[{"sentence":"Se implementaron medidas paritaristas para asegurar la representación femenina en el congreso.","translation":"Gender parity measures were implemented to ensure female representation in congress."}],"collocations":["medidas paritaristas","ley paritarista"],"synonyms":["igualitario","feminista"],"antonyms":[]}],"etymology":{"value":"Derived from 'paridad' (parity) + '-ista' (supporter, advocate).","priority":"medium"},"pronunciation":{"ipa":"/pa.ɾi.taˈɾis.ta/","syllables":"pa-ri-ta-ris-ta"},"inflection":{"noun_gender":"masculine/feminine","noun_plural":"paritaristas","adjective_gender":"masculine/feminine","adjective_plural":"paritaristas"},"usage_notes":{"explanation":"The term 'paritarista' is commonly used in Latin American countries to refer to individuals or policies that promote gender parity, particularly in political contexts. It emphasizes the equal representation of men and women.","priority":"high"},"common_mistakes":[],"related_words":{"derivatives":["paridad (parity)"]},"level_frequency":{"level":"C1","frequency_google_ngram":"low","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'paritarista' is a specialized term related to gender equality and political representation. It is primarily used in Latin American contexts. Understanding the word requires knowledge of political and social issues related to gender parity."},"example_sentences":[{"sentence":"El debate se centró en las propuestas paritaristas para la reforma electoral.","translation":"The debate focused on gender parity proposals for electoral reform.","type":"adjective","meaning_category":"gender parity"},{"sentence":"Los grupos paritaristas exigen una mayor participación de las mujeres en la política.","translation":"Gender parity groups demand greater participation of women in politics.","type":"noun","meaning_category":"gender parity"}]}