{"word":"autochthonism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)ある言語が特定の地域で自然発生したという説、またはその言語を話す人々がその地域に元々住んでいたという説。","english_definition":"(linguistics) the belief or theory that a language originated in a particular region, or that the people who speak it are native to that region.","examples":[{"sentence":"The theory of autochthonism in Basque linguistics suggests that the Basque language developed in the Pyrenees region and has no relation to other known language families.","translation":"バスク語の言語学における土着起源説は、バスク語がピレネー地方で発達し、他の既知の語族とは関係がないことを示唆している。"},{"sentence":"Some scholars support autochthonism for the Indo-European languages, arguing that they originated in Europe rather than migrating from elsewhere.","translation":"一部の学者は、インド・ヨーロッパ語族の土着起源説を支持しており、インド・ヨーロッパ語族が他の地域から移動してきたのではなく、ヨーロッパで発生したと主張している。"}],"collocations":["linguistic autochthonism (言語的土着起源説)","autochthonous theory (土着起源説)"],"synonyms":["nativism (in linguistics)","indigenism (in linguistics)"],"antonyms":["migrationism (in linguistics)"]},{"part_of_speech":"noun","definition":"(政治学・社会学)ある人々が特定の地域に元々住んでいたという信念、またはその地域に対する特別な権利を持つという信念。","english_definition":"(politics, sociology) the belief that a people are native to a particular place and have a special right to it.","examples":[{"sentence":"Autochthonism can be used to justify claims of territorial sovereignty and cultural identity.","translation":"土着起源説は、領土主権と文化的アイデンティティの主張を正当化するために使用されることがある。"},{"sentence":"The rise of autochthonism in some political movements has led to discrimination against immigrants and minorities.","translation":"一部の政治運動における土着起源説の台頭は、移民や少数派に対する差別につながっている。"}],"collocations":["political autochthonism (政治的土着起源説)","cultural autochthonism (文化的土着起源説)"],"synonyms":["nativism (in politics/sociology)","indigenism (in politics/sociology)"],"antonyms":["cosmopolitanism","multiculturalism"]}],"etymology":{"value":"ギリシャ語の `autochthōn` (土地から生まれた、その土地固有の) に由来する。`auto-` (自己) + `chthōn` (土地、地球) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtɒkθənɪzəm/","syllables":"au-toch-tho-nism"},"inflection":{"noun_plural":"autochthonisms"},"usage_notes":{"explanation":"`Autochthonism` は、ある集団（言語を話す人々、民族など）が特定の地域に元々住んでいたという考え方を指す学術的な用語です。言語学では、言語が特定の地域で自然発生したという説を指し、政治学や社会学では、特定の地域に対する特別な権利を主張する根拠となることがあります。この用語は、移民や外部からの影響を排除しようとするナショナリズムや排他主義と関連付けられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The autochthonism of the language is prove.","correct":"✓ The autochthonism of the language is proven. / ✓ The autochthonic origin of the language is proven.","note":"`autochthonism` は名詞であり、動詞ではありません。受動態にする場合は `is proven` を使用するか、形容詞 `autochthonic` を使って `autochthonic origin` と表現します。"},{"incorrect":"✗ He believes in autochthonism, so he doesn't like foreigners.","correct":"✓ He believes in autochthonism, which can sometimes lead to negative views of foreigners.","note":"`autochthonism` は必ずしも外国人嫌悪を意味するわけではありませんが、特定の地域に対する特別な権利を主張する根拠となるため、排他的な思想につながる可能性もあります。より正確な表現を心がけましょう。"}],"priority":"★☆☆"},"related_words":{"derivatives":["autochthon (名詞: その土地固有の人、原住民)","autochthonous (形容詞: その土地固有の、自然発生の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 学術的な文脈で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**autochthonism**」は、ある言語や民族が特定の場所に元々住んでいたという考え方を表す専門用語です。言語学では、ある言語が他の地域から来たのではなく、その場所で自然に生まれたという説を指します。政治や社会の分野では、ある民族がその土地の「原住民」であり、特別な権利を持つという主張に使われることがあります。この言葉は、学術的な議論や、特定のグループのアイデンティティを主張する際に使われることが多いです。専門的な内容なので、文脈を理解することが大切です。"},"example_sentences":[{"sentence":"The **autochthonism** of the Ainu people in Hokkaido is a subject of ongoing debate.","translation":"北海道におけるアイヌ民族の土着起源説は、現在も議論の対象となっている。","type":"noun","meaning_category":"政治学・社会学"},{"sentence":"Some linguists propose **autochthonism** as an explanation for the unique characteristics of the Burushaski language.","translation":"一部の言語学者は、ブルシャスキー語の独自性を説明するために土着起源説を提唱している。","type":"noun","meaning_category":"言語学"}]}