{"word":"factiously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"党派的に、派閥的に、内紛的に","english_definition":"in a manner characterized by internal dissension, discord, or conflict; in a way that promotes or is based on factions.","examples":[{"sentence":"The committee was divided factiously, with each member supporting a different proposal.","translation":"委員会は党派的に分裂し、各メンバーが異なる提案を支持した。"},{"sentence":"The issue was debated factiously, leading to no resolution.","translation":"その問題は内紛的に議論され、解決には至らなかった。"},{"sentence":"The organization was factiously organized, which hindered its progress.","translation":"その組織は派閥的に組織され、その進歩を妨げた。"}],"collocations":["divided factiously","debated factiously","organized factiously"],"synonyms":["divisively","discordantly","contentiously","schismatically","factionally"],"antonyms":["harmoniously","unanimously","cooperatively","amicably"]}],"etymology":{"value":"Derived from 'factious,' which comes from 'faction.' 'Faction' originates from the Latin 'factio,' meaning 'a making, doing, a party, sect, or faction.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfækʃəsli/","syllables":"fac-tious-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Factiously' describes actions or situations marked by or resulting from factions, which are small, dissenting groups within a larger group. It implies a state of discord and internal conflict. It is often used to describe political or organizational environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted factiously because he was factual.","correct":"✓ He acted factiously because he supported a specific faction.","note":"'Factiously' relates to factions, not facts. It describes behavior driven by loyalty to a group, not adherence to truth. Replace 'factual' with a term related to group loyalty or division."},{"incorrect":"✗ The meeting ended factiously, with everyone agreeing.","correct":"✓ The meeting ended harmoniously, with everyone agreeing.","note":"'Factiously' implies disagreement and division. If everyone agrees, the meeting ends harmoniously, not factiously. Use an antonym like 'harmoniously' or 'unanimously'."}],"priority":"★★☆"},"related_words":{"derivatives":["faction (noun): a small, organized, dissenting group within a larger one, especially in politics.","factious (adjective): relating or belonging to a faction; characterized by internal dissension.","factional (adjective): relating to or characteristic of factions.","factionalism (noun): party strife and intrigue; the state of being factional."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This word is relatively rare in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Factiously' is an adverb that describes something done in a way that causes or shows disagreement and division within a group. It suggests that people are acting according to the interests of a particular faction or subgroup, rather than for the good of the whole. This word is not commonly used and is more often found in formal writing or discussions about politics or organizations."},"example_sentences":[{"sentence":"The council members argued factiously over the budget, each representing the interests of their district.","translation":"評議会のメンバーは予算について党派的に議論し、それぞれが自分の地区の利益を代表した。","type":"general","meaning_category":"divisively"},{"sentence":"The political party was factiously split between traditionalists and reformers.","translation":"その政党は伝統主義者と改革派の間で党派的に分裂した。","type":"political","meaning_category":"factionally"},{"sentence":"The debate was conducted factiously, with little regard for common ground.","translation":"その討論は党派的に行われ、共通の基盤はほとんど考慮されなかった。","type":"general","meaning_category":"discordantly"}]}