{"word":"psammoma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"砂腫（さしゅ）：脳や脊髄などの組織にできる、砂粒状のカルシウム沈着を伴う腫瘍。特に髄膜腫（ずいまくしゅ）に多く見られる。","english_definition":"A type of tumor characterized by the presence of psammoma bodies, which are round, microscopic calcifications. Commonly found in meningiomas and some other types of tumors.","examples":[{"sentence":"The brain scan revealed a psammoma in the meninges.","translation":"脳スキャンで髄膜に砂腫が見つかった。"},{"sentence":"Psammoma bodies are a characteristic feature of papillary thyroid carcinoma.","translation":"砂腫小体は乳頭甲状腺癌の特徴的な所見である。"}],"collocations":["psammoma body (砂腫小体)","meningeal psammoma (髄膜砂腫)"],"synonyms":["calcifying tumor"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「psammos」（砂）に由来し、腫瘍内のカルシウム沈着が砂粒のように見えることにちなむ。","priority":"★★☆"},"pronunciation":{"ipa":"/sæˈmoʊmə/","syllables":"psam-mo-ma"},"inflection":{"noun_plural":"psammomas"},"usage_notes":{"explanation":"「**psammoma**」は病理学的な用語であり、一般的には医学関係者以外には馴染みのない単語です。主に病理検査の報告書や医学論文などで使用されます。砂腫は腫瘍の種類を特定する上で重要な手がかりとなることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I have a psammoma, so I have cancer.","correct":"✓ The doctor said I have a psammoma, which suggests the possibility of a meningioma, but further tests are needed.","note":"砂腫が見つかったからといって、必ずしも癌であるとは限りません。砂腫は特定の種類の腫瘍（特に髄膜腫）によく見られる特徴ですが、確定診断には追加の検査が必要です。"},{"incorrect":"✗ Psammoma is a type of bacteria.","correct":"✓ Psammoma is a type of tumor characterized by calcifications.","note":"砂腫は細菌ではなく、カルシウム沈着を伴う腫瘍の一種です。"}],"priority":"★★☆"},"related_words":{"derivatives":["psammomatous (形容詞: 砂腫性の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学論文や専門書でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**psammoma**」は、主に医学分野で使用される専門用語であり、一般の人が日常的に使用する単語ではありません。この単語は、特定の腫瘍に見られる砂粒状のカルシウム沈着を指し、特に病理検査の結果や医学論文で言及されることが多いです。したがって、医学関係者や病理学の研究者以外には、ほとんど馴染みのない単語と言えるでしょう。"},"example_sentences":[{"sentence":"Microscopic examination of the tissue sample revealed numerous psammoma bodies.","translation":"組織標本の顕微鏡検査で、多数の砂腫小体が認められた。","type":"noun","meaning_category":"腫瘍"},{"sentence":"The presence of psammoma bodies helped to confirm the diagnosis of meningioma.","translation":"砂腫小体の存在が髄膜腫の診断を確定するのに役立った。","type":"noun","meaning_category":"腫瘍"}]}