{"word":"under-direction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"指示の下、指導の下","english_definition":"The state of being guided or supervised by someone.","examples":[{"sentence":"The project was completed successfully under the direction of the experienced manager.","translation":"そのプロジェクトは、経験豊富なマネージャーの指示の下で成功裏に完了しました。"},{"sentence":"All the students worked diligently under the direction of their teacher.","translation":"すべての生徒は、先生の指導の下で熱心に勉強しました。"}],"collocations":["under the direction of","work under direction","operate under direction"],"synonyms":["under supervision","under guidance","under control"],"antonyms":["independently","autonomously","without direction"]}],"etymology":{"value":"\"Under-\" (beneath, below) + \"direction\" (guidance, management). Indicates a state of being subject to someone's guidance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndər dɪˈrɛkʃən/","syllables":"un-der-di-rek-shun"},"inflection":{"noun_plural":"N/A (usually used as a singular concept)"},"usage_notes":{"explanation":"The term \"under-direction\" is commonly used to describe a situation where someone is working or operating according to the instructions or supervision of another person. It implies a hierarchical relationship where one person is providing guidance and the other is following it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was under direction of the team.","correct":"✓ The project was under the direction of the team.","note":"The definite article \"the\" is necessary before \"direction\" in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["direction","directional","director"],"phrases":["under the direction of","without direction"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Under-direction\" is a relatively formal term used to describe the state of being guided or supervised by someone. It's often used in professional or academic contexts to indicate that a task or project is being carried out according to specific instructions or under the supervision of a leader or expert. Understanding the term helps in comprehending hierarchical relationships and the execution of tasks within structured environments."},"example_sentences":[{"sentence":"The construction workers were operating under the direction of the site foreman.","translation":"建設作業員たちは、現場監督の指示の下で作業していました。","type":"noun","meaning_category":"Guidance"},{"sentence":"The research was conducted under the direction of the principal investigator.","translation":"その研究は、主任研究者の指示の下で実施されました。","type":"noun","meaning_category":"Supervision"}]}