{"word":"substrate-focused","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"基質に焦点を当てた、基質に着目した","english_definition":"Emphasizing or primarily concerned with the substrate, which can refer to a foundation, base material, or a substance acted upon by an enzyme or catalyst.","examples":[{"sentence":"The research is substrate-focused, examining the interaction between the enzyme and its target molecule.","translation":"その研究は基質に着目しており、酵素とその標的分子間の相互作用を調べている。"},{"sentence":"A substrate-focused approach is crucial for understanding the initial stages of biofilm formation.","translation":"基質に着目したアプローチは、バイオフィルム形成の初期段階を理解するために重要である。"}],"collocations":["substrate-focused research","substrate-focused approach","substrate-focused analysis","substrate-focused study"],"synonyms":["substrate-oriented","substrate-centered"],"antonyms":[]}],"etymology":{"value":"Combination of 'substrate' (from Latin 'substratus', meaning 'laid under') and 'focused' (past participle of 'focus', meaning 'to concentrate').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbstreɪt ˈfoʊkəst/","syllables":"sub-strate-fo-cused"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'substrate-focused' is often used in scientific or technical contexts, particularly in fields like biology, chemistry, and materials science. It indicates that the primary emphasis or investigation is directed towards the substrate, whether it's a chemical compound, a surface, or a foundation. The meaning can vary slightly depending on the specific field of study.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study was substrate focused.","correct":"✓ The study was substrate-focused.","note":"The hyphen is important to connect 'substrate' and 'focused' into a single adjective modifying the noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["substrate","focus","focused"],"related_terms":["enzyme","catalyst","biofilm","surface","foundation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - primarily used in specialized scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'substrate-focused' is a specialized term used in scientific and technical fields. Understanding it requires knowledge of the term 'substrate' within the relevant context (e.g., biology, chemistry, materials science). It indicates a concentration or emphasis on the substrate as the primary object of study or analysis."},"example_sentences":[{"sentence":"The paper presents a substrate-focused analysis of the catalytic reaction.","translation":"その論文は、触媒反応の基質に着目した分析を示している。","type":"adjective","meaning_category":"基質に着目した"},{"sentence":"A substrate-focused approach helped identify key factors influencing cell adhesion.","translation":"基質に着目したアプローチは、細胞接着に影響を与える重要な要因を特定するのに役立った。","type":"adjective","meaning_category":"基質に着目した"}]}