{"word":"cold-flow","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(材料の)クリープ現象、冷間流動","english_definition":"The slow plastic deformation of a solid material under sustained stress, even below its yield strength. This is more pronounced at elevated temperatures, but can occur at room temperature, particularly in polymers and soft metals.","examples":[{"sentence":"The engineer had to consider the cold-flow of the plastic components under constant pressure.","translation":"エンジニアは、一定の圧力下でのプラスチック部品の冷間流動を考慮する必要があった。"},{"sentence":"Cold-flow can cause seals to lose their effectiveness over time.","translation":"冷間流動は、時間の経過とともにシールの有効性を失わせる可能性がある。"},{"sentence":"The design was modified to minimize cold-flow in the high-stress areas.","translation":"設計は、高応力領域での冷間流動を最小限に抑えるように修正された。"}],"collocations":["exhibit cold-flow (冷間流動を示す)","minimize cold-flow (冷間流動を最小限に抑える)","cold-flow properties (冷間流動特性)","cold-flow behavior (冷間流動挙動)","cold-flow resistance (冷間流動抵抗)"],"synonyms":["creep","plastic deformation","viscoelastic deformation"],"antonyms":["elastic deformation","brittle fracture"]},{"part_of_speech":"verb","definition":"(材料が)冷間流動する","english_definition":"To undergo slow plastic deformation under sustained stress, even below its yield strength.","examples":[{"sentence":"The solder cold-flows over time, reducing the reliability of the joint.","translation":"はんだは時間の経過とともに冷間流動し、接合部の信頼性を低下させる。"},{"sentence":"The plastic gasket cold-flowed, resulting in a leak.","translation":"プラスチック製のガスケットが冷間流動し、漏れが発生した。"}],"collocations":["material cold-flows (材料が冷間流動する)","component cold-flows (部品が冷間流動する)"],"synonyms":["creep","plastically deform"],"antonyms":["elastically deform"]}],"etymology":{"value":"A compound word formed from 'cold' (referring to the material's temperature, though it can occur at room temperature) and 'flow' (referring to the material's slow, continuous deformation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊldˌfloʊ/","syllables":"cold-flow"},"inflection":{"verb_forms":{"present_simple":["cold-flow","cold-flows"],"past_simple":"cold-flowed","past_participle":"cold-flowed","present_participle":"cold-flowing"},"noun_plural":"cold-flows"},"usage_notes":{"explanation":"'Cold-flow' refers to the time-dependent plastic deformation of a solid material under stress. It is a critical consideration in engineering design, particularly when using polymers, soft metals, or materials subjected to sustained loads. The term is often used interchangeably with 'creep,' although 'creep' is more commonly associated with high-temperature deformation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal broke due to cold-flow.","correct":"✓ The metal deformed due to cold-flow.","note":"Cold-flow is a deformation process, not a fracture process. Materials undergoing cold-flow deform slowly over time, rather than breaking suddenly."},{"incorrect":"✗ Cold-flow only happens at very low temperatures.","correct":"✓ Cold-flow can happen at room temperature, especially in polymers.","note":"While temperature can influence cold-flow, it can occur at room temperature, especially in materials like polymers."}],"priority":"★★☆"},"related_words":{"derivatives":["cold-flowing (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in technical and engineering contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cold-flow' is a technical term used in materials science and engineering to describe the slow, permanent deformation of a solid material under stress. It's important to understand that this deformation occurs even when the stress is below the material's yield strength. While temperature can influence the rate of cold-flow, it can happen even at room temperature, particularly in materials like plastics. This phenomenon is crucial to consider when designing structures or components that will be subjected to sustained loads over long periods.","example_sentences":[]},"example_sentences":[{"sentence":"The **cold-flow** of the adhesive caused the joint to weaken over time.","translation":"接着剤の冷間流動により、時間の経過とともに接合部が弱くなった。","type":"noun","meaning_category":"クリープ現象"},{"sentence":"The plastic seal **cold-flows** under the pressure of the bolt.","translation":"ボルトの圧力により、プラスチック製のシールが冷間流動する。","type":"verb","meaning_category":"冷間流動する"}]}