{"word":"derogations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律、規則などからの)逸脱、免除、部分的な取り消し","english_definition":"exceptions or exemptions from laws, rules, or obligations; partial annulments or suspensions.","examples":[{"sentence":"The treaty allows for certain derogations in exceptional circumstances.","translation":"その条約は、例外的な状況下での特定の逸脱を認めている。"},{"sentence":"The company received derogations from environmental regulations.","translation":"その会社は環境規制からの免除を受けた。"},{"sentence":"Emergency derogations were granted to allow for the import of essential goods.","translation":"必需品の輸入を許可するために、緊急の免除が認められた。"}],"collocations":["grant a derogation (免除を認める)","apply for a derogation (免除を申請する)","temporary derogation (一時的な免除)","specific derogations (特定の免除)"],"synonyms":["exemption","exception","waiver","dispensation","exculpation"],"antonyms":["compliance","adherence","conformity","observance"]},{"part_of_speech":"noun","definition":"(権利、権威などの)侵害、軽視","english_definition":"acts of detracting or disparaging; diminutions of rights or authority.","examples":[{"sentence":"Such actions are a derogation of human rights.","translation":"そのような行為は人権の侵害である。"},{"sentence":"The policy was seen as a derogation of the president's authority.","translation":"その政策は大統領の権威の軽視と見なされた。"}],"collocations":["derogation of rights (権利の侵害)","derogation of authority (権威の軽視)"],"synonyms":["detraction","disparagement","belittlement","impairment","infringement"],"antonyms":["enhancement","strengthening","upholding","affirmation"]}],"etymology":{"value":"Late Middle English: from late Latin derogatio(n-), from Latin derogare ‘ask to repeal’, from de- ‘away, down’ + rogare ‘ask’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛrəˈɡeɪʃənz/","syllables":"de-ro-ga-tions"},"inflection":{"noun_plural":"derogations"},"usage_notes":{"explanation":"'Derogations' refers to specific instances where a rule or law is temporarily or partially suspended, or when an exception is made. It can also refer to actions that undermine or detract from someone's rights or authority. The context is crucial to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The derogation of the rule was applied to everyone.","correct":"✓ The derogation from the rule was applied to everyone.","note":"Use 'derogation from' to indicate an exception or exemption from a rule. 'Derogation of' usually refers to the undermining of something (like rights)."},{"incorrect":"✗ He received a derogation for his good work.","correct":"✓ He received a reward for his good work. / ✓ He received a derogation because of special circumstances.","note":"'Derogation' implies an exception due to specific conditions, not a reward for good work. Use 'reward' in the latter case."}],"priority":"★★☆"},"related_words":{"derivatives":["derogate (verb): to detract, disparage, deviate from a standard","derogatory (adjective): disparaging, belittling"],"phrases":["by way of derogation (～を軽視して、～を侵害して)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'derogations' is a formal term that refers to exceptions or exemptions from laws, rules, or obligations. It can also mean actions that undermine or detract from someone's rights or authority. This word is typically used in legal, political, or formal contexts. Understanding the context is important to determine the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The government introduced several derogations to the existing tax laws.","translation":"政府は既存の税法にいくつかの免除を導入した。","type":"noun","meaning_category":"逸脱、免除"},{"sentence":"These actions represent a serious derogation of international law.","translation":"これらの行為は国際法の重大な侵害を表している。","type":"noun","meaning_category":"侵害、軽視"},{"sentence":"The EU allows for temporary derogations from certain regulations in times of crisis.","translation":"EUは、危機時には特定の規制からのtemporary一時的な免除を認めている。","type":"noun","meaning_category":"逸脱、免除"},{"sentence":"The constant criticism was a derogation of his efforts.","translation":"絶え間ない批判は彼の努力の軽視だった。","type":"noun","meaning_category":"侵害、軽視"}]}