{"word":"natriuretic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ナトリウム利尿性の","english_definition":"Causing natriuresis, the excretion of an excessively large amount of sodium in the urine.","examples":[{"sentence":"Natriuretic peptides are released in response to increased blood volume.","translation":"ナトリウム利尿ペプチドは、血液量の増加に応じて放出されます。"}],"collocations":["natriuretic peptide","natriuretic effect"],"synonyms":["saluretic"],"antonyms":[]}],"etymology":{"value":"From 'natrium' (Latin for sodium) + 'uretic' (causing urination).","priority":"★★★"},"pronunciation":{"ipa":"/ˌneɪtrijʊˈrɛtɪk/","syllables":"na-tri-u-ret-ic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more natriuretic, most natriuretic."},"usage_notes":{"explanation":"'Natriuretic' specifically refers to the effect of causing sodium excretion in the urine. It is often used in the context of hormones or drugs that have this effect.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is diuretic, so it is natriuretic.","correct":"✓ The drug is diuretic and natriuretic.","note":"While natriuretic drugs are often diuretics, not all diuretics are natriuretic. Diuretics increase urine production, while natriuretics specifically increase sodium excretion."}],"priority":"★★☆"},"related_words":{"derivatives":["natriuresis (noun): the excretion of an excessively large amount of sodium in the urine"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Natriuretic' is a technical term used in medicine and physiology to describe substances or processes that promote the excretion of sodium in the urine. It's typically encountered in scientific or medical contexts. Understanding this term requires knowledge of basic physiology and medical terminology."},"example_sentences":[{"sentence":"Atrial natriuretic peptide (ANP) is a hormone secreted by the heart.","translation":"心房性ナトリウム利尿ペプチド（ANP）は、心臓から分泌されるホルモンです。","type":"adjective","meaning_category":"sodium excretion"},{"sentence":"The patient was prescribed a natriuretic medication to reduce fluid retention.","translation":"患者は体液貯留を減らすために、ナトリウム利尿薬を処方されました。","type":"adjective","meaning_category":"sodium excretion"}]}