{"word":"Stipulae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"托葉（たくよう）: 植物の葉の基部にある、通常は小さく葉状の構造物。","english_definition":"(botany) A small leafy appendage to a leaf, typically borne in pairs at the base of the leaf stalk.","examples":[{"sentence":"Stipulae can be persistent or deciduous.","translation":"托葉は宿存性または落葉性である。"},{"sentence":"The presence or absence of stipulae is an important characteristic for plant identification.","translation":"托葉の有無は、植物の識別において重要な特徴である。"}],"collocations":["deciduous stipulae (落葉性の托葉)","persistent stipulae (宿存性の托葉)","foliaceous stipulae (葉状の托葉)"],"synonyms":["leafy appendages"],"antonyms":[]}],"etymology":{"value":"ラテン語の 'stipula' (わら、茎) に由来する。葉柄の基部にある小さな構造物の形状から。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɪpjuleɪ/","syllables":"stip-u-lae"},"inflection":{"noun_plural":"stipules"},"usage_notes":{"explanation":"Stipulae are small, leaf-like or scale-like appendages located at the base of the petiole (leaf stalk) in some plants. They can vary greatly in size, shape, and function, and may be persistent (remaining throughout the life of the leaf) or deciduous (falling off early). The presence, absence, and characteristics of stipules are often used as diagnostic features in plant identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has no stipule.","correct":"✓ The plant has no stipules.","note":"Stipules usually occur in pairs, so the plural form is more common when referring to a plant's stipules in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["stipulate (動詞: 規定する、明記する)","stipulation (名詞: 規定、条項)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 植物学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stipulae' is a botanical term referring to small, leaf-like structures found at the base of a leaf's petiole (stalk) in certain plants. These appendages can vary significantly in their morphology and persistence, serving as diagnostic features in plant taxonomy. Their presence or absence, as well as their specific characteristics, are often used to differentiate between plant species. The term is primarily encountered in botanical contexts and may not be familiar to the general public."},"example_sentences":[{"sentence":"The rose plant is characterized by its prominent stipulae at the base of each leaf.","translation":"そのバラの植物は、各葉の基部にある顕著な托葉によって特徴づけられる。","type":"descriptive","meaning_category":"botany"},{"sentence":"In some species, the stipulae are modified into spines for protection.","translation":"いくつかの種では、托葉は保護のために棘に変化している。","type":"descriptive","meaning_category":"botany"}]}