{"word":"scrutinizability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"精査可能性、吟味可能性、詳細な調査や検討に耐えうる性質","english_definition":"The quality of being able to be scrutinized; the extent to which something can be thoroughly examined and investigated.","examples":[{"sentence":"The scrutinizability of the data was crucial for validating the research findings.","translation":"データの精査可能性は、研究結果を検証するために非常に重要だった。"},{"sentence":"Increased scrutinizability of government spending could lead to greater accountability.","translation":"政府支出の精査可能性を高めることで、説明責任が向上する可能性がある。"},{"sentence":"The scrutinizability of the algorithm's code is essential for ensuring its fairness and transparency.","translation":"アルゴリズムのコードの精査可能性は、その公平性と透明性を確保するために不可欠である。"}],"collocations":["enhance scrutinizability (精査可能性を高める)","ensure scrutinizability (精査可能性を確保する)","improve scrutinizability (精査可能性を改善する)","lack scrutinizability (精査可能性が欠如している)","high scrutinizability (高い精査可能性)","low scrutinizability (低い精査可能性)"],"synonyms":["examinability","inspectability","investigability","verifiability","transparency","accountability"],"antonyms":["opaqueness","obscurity","unaccountability","unverifiability"]}],"etymology":{"value":"Formed from 'scrutinize' (to examine closely and critically) + '-ability' (the quality of being able to do something). 'Scrutinize' comes from the Latin 'scrutinari,' meaning 'to search, examine.'","priority":"★★☆"},"pronunciation":{"ipa":"/skruːtɪnaɪzəˈbɪləti/","syllables":"scru-ti-ni-za-bil-i-ty"},"inflection":{"noun_plural":"scrutinibilities (rare)"},"usage_notes":{"explanation":"'Scrutinizability' refers to the degree to which something – such as data, a process, or an argument – can be subjected to detailed and critical examination. It is often used in contexts where transparency, accountability, and validation are important, such as scientific research, government oversight, and software development. The term emphasizes the potential for thorough investigation rather than simply the act of scrutinizing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scrutinizability are important.","correct":"✓ The scrutinizability is important.","note":"'Scrutinizability' is typically used as an uncountable noun, so it takes a singular verb."},{"incorrect":"✗ The document had no scrutinize.","correct":"✓ The document had no scrutinizability.","note":"'Scrutinize' is a verb. The noun form indicating the ability to be scrutinized is 'scrutinizability'."}],"priority":"★★☆"},"related_words":{"derivatives":["scrutinize (verb: 精査する、吟味する)","scrutinizing (adjective: 精査的な、吟味的な)","scrutiny (noun: 精査、吟味、調査)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency (Relatively rare word, primarily used in academic or technical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scrutinizability' is a relatively uncommon and complex term that describes how easily something can be carefully and critically examined. It's often used when discussing the transparency and accountability of processes, data, or arguments. If something has high scrutinizability, it means it's easy to investigate and verify its details. This word is more likely to appear in academic, technical, or formal writing."},"example_sentences":[{"sentence":"The scrutinizability of the financial records allowed auditors to detect discrepancies quickly.","translation":"財務記録の精査可能性のおかげで、監査人はすぐに矛盾を発見できた。","type":"noun","meaning_category":"精査可能性"},{"sentence":"To ensure public trust, the scrutinizability of the election process must be maintained.","translation":"国民の信頼を確保するためには、選挙プロセスの精査可能性を維持しなければならない。","type":"noun","meaning_category":"精査可能性"},{"sentence":"The researchers prioritized the scrutinizability of their methodology to ensure the reproducibility of their findings.","translation":"研究者たちは、研究結果の再現性を確保するために、自分たちの方法論の精査可能性を優先した。","type":"noun","meaning_category":"精査可能性"}]}