{"word":"Satan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サタン、悪魔、堕天使","english_definition":"the supreme spirit of evil; the Devil.","examples":[{"sentence":"Satan is often depicted as the adversary of God.","translation":"サタンはしばしば神の敵として描かれる。"},{"sentence":"Some believe that Satan is responsible for all the evil in the world.","translation":"サタンが世界のすべての悪の根源だと信じる人もいる。"}],"collocations":["worship Satan (サタンを崇拝する)","the power of Satan (サタンの力)","resist Satan (サタンに抵抗する)","tempted by Satan (サタンに誘惑される)"],"synonyms":["Devil","Lucifer","Beelzebub","Mephistopheles"],"antonyms":["God","Angel"],"notes":"Often capitalized. In Christianity, Judaism, and Islam, Satan is the personification of evil and the enemy of God."}],"etymology":{"value":"From Late Latin Sātăn, from Greek Satán, from Hebrew śāṭān (שָׂטָן) meaning 'adversary'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪtən/","syllables":"Sa-tan"},"inflection":{"noun_plural":"Satans"},"usage_notes":{"explanation":"'Satan' is primarily used in religious contexts, particularly in Christianity, Judaism, and Islam, to refer to the embodiment of evil and the opponent of God. It is often used figuratively to describe extreme wickedness or temptation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a satan.","correct":"✓ He is like Satan. / ✓ He is satanic.","note":"'Satan' is a proper noun referring to a specific entity. To describe someone as evil, use 'satanic' or a phrase like 'like Satan'."},{"incorrect":"✗ Satans power.","correct":"✓ Satan's power.","note":"To show possession, use the possessive form 'Satan's'."}],"priority":"★★☆"},"related_words":{"derivatives":["satanic (adjective: relating to or characteristic of Satan or devil worship)","satanism (noun: the worship of Satan)","satanist (noun: a person who worships Satan)"],"idioms_phrases":["the devil's advocate (a person who expresses a contentious opinion in order to provoke debate or test the strength of the opposing arguments)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency compared to more common words.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Satan' is a term primarily used in religious contexts to refer to the personification of evil. Understanding of the term often requires familiarity with religious narratives, particularly those of Christianity, Judaism, and Islam. The word is not commonly used in everyday conversation outside of discussions about religion or morality."},"example_sentences":[{"sentence":"The priest warned against the influence of Satan.","translation":"司祭はサタンの影響に警戒するように警告した。","type":"noun","meaning_category":"悪魔"},{"sentence":"Some believe that temptation comes from Satan.","translation":"誘惑はサタンから来ると信じる人もいる。","type":"noun","meaning_category":"悪魔"},{"sentence":"The film explored the themes of good versus evil, with Satan as a central figure.","translation":"その映画は善と悪のテーマを探求し、サタンが中心人物として登場した。","type":"noun","meaning_category":"悪魔"}]}