{"word":"clammily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"じめじめと、ねっとりと、冷たく湿って","english_definition":"In a clammy manner; unpleasantly damp, sticky, and often cold.","examples":[{"sentence":"His hands were shaking and he held mine clammily.","translation":"彼の両手は震えていて、私の手をじめじめと握った。"},{"sentence":"The air in the basement hung clammily around us.","translation":"地下室の空気は、じめじめと私たちの周りに漂っていた。"},{"sentence":"She woke up sweating clammily in the middle of the night.","translation":"彼女は真夜中に、冷たくじめじめとした汗をかいて目を覚ました。"}],"collocations":["sweat clammily","hold clammily","feel clammily"],"synonyms":["damply","stickily","moistly","sweatingly","wetly","slimily"],"antonyms":["dryly","aridly"]}],"etymology":{"value":"Derived from 'clammy', which comes from Middle English 'clamen' meaning 'to smear or stick'. The adverbial form 'clammily' is created by adding the suffix '-ly' to the adjective 'clammy'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklæməli/","syllables":"clam-mi-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Clammily' describes a sensation or condition that is unpleasantly damp, sticky, and often cold. It is typically used to describe skin, air, or objects that have this unpleasant texture. It often implies a feeling of discomfort or unease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bread felt clammily.","correct":"✓ The bread felt clammy.","note":"'Clammy' is the adjective to describe the state of the bread. 'Clammily' is an adverb and would be used to describe how something is done, not how something feels."},{"incorrect":"✗ He looked clammily because he was sick.","correct":"✓ He looked clammy because he was sick.","note":"'Clammy' is the correct adjective to describe his appearance. 'Clammily' is an adverb and would not be appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["clammy (adjective)","clamminess (noun)"],"phrasal_verbs":[],"related_adjectives":["damp","sticky","moist","sweaty","slimy"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Clammily' is an adverb that describes something done in a clammy way. 'Clammy' means unpleasantly damp, sticky, and often cold. Therefore, 'clammily' is used to describe actions or states that have this unpleasant damp and sticky quality. It is not a very common word, so it is more likely to be encountered in descriptive writing."},"example_sentences":[{"sentence":"She shook his hand clammily, her palms slick with sweat.","translation":"彼女は彼の汗ばんだ手のひらで、じめじめと彼の両手を握った。","type":"adverb","meaning_category":"unpleasantly damp, sticky, and often cold"},{"sentence":"The fog hung clammily in the air, making everything feel cold and damp.","translation":"霧がじめじめと空中に立ち込め、すべてが冷たく湿った感じになった。","type":"adverb","meaning_category":"unpleasantly damp, sticky, and often cold"},{"sentence":"He woke up clammily in the middle of the night, his pajamas soaked with sweat.","translation":"彼は真夜中に、寝間着が汗でびっしょり濡れて、じめじめとした状態で目を覚ました。","type":"adverb","meaning_category":"unpleasantly damp, sticky, and often cold"}]}