{"word":"histochemistry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"組織化学","english_definition":"The branch of science dealing with the identification of chemical components of tissues by means of stains, indicators, and microscopy.","examples":[{"sentence":"Histochemistry is used to study the distribution of enzymes in tissues.","translation":"組織化学は、組織内の酵素の分布を研究するために使用されます。"},{"sentence":"The histochemistry results revealed the presence of a specific protein in the tumor cells.","translation":"組織化学の結果は、腫瘍細胞における特定のタンパク質の存在を明らかにしました。"}],"collocations":["immunohistochemistry","enzyme histochemistry","histochemical analysis","histochemical staining"],"synonyms":["tissue chemistry","cytochemistry"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'histos' (tissue), 'chemeia' (chemistry), and '-logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstoʊˈkemɪstri/","syllables":"his-to-chem-is-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Histochemistry is a specialized field that combines histology (the study of tissues) and chemistry. It is used to visualize and identify specific chemical components within cells and tissues, often to understand their function or to diagnose diseases. Immunohistochemistry, a related technique, uses antibodies to detect specific proteins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying histo-chemistry.","correct":"✓ He is studying histochemistry.","note":"The word is written as one word, without a hyphen."}],"priority":"★★☆"},"related_words":{"derivatives":["histochemical","histochemically","immunohistochemistry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Histochemistry is a scientific term used in biology and medicine. It refers to the study of the chemical composition of tissues using special dyes and microscopic techniques. This method helps scientists and doctors identify specific substances in cells and tissues, which can be useful for diagnosing diseases or understanding how the body works at a microscopic level. It's a complex field, so it's mainly used by experts in these areas."},"example_sentences":[{"sentence":"The study utilized histochemistry to identify specific proteins within the muscle tissue.","translation":"その研究では、筋肉組織内の特定のタンパク質を特定するために組織化学を利用しました。","type":"general","meaning_category":"definition"},{"sentence":"Histochemistry plays a crucial role in the diagnosis of various cancers.","translation":"組織化学は、さまざまな癌の診断において重要な役割を果たしています。","type":"medical","meaning_category":"application"}]}