{"word":"platycephalic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"扁平頭の、短頭の","english_definition":"Having a skull that is flattened from top to bottom; having a cephalic index greater than 80.","examples":[{"sentence":"The anthropologist noted the platycephalic skull shape of the remains.","translation":"人類学者は、その遺骨の扁平頭の頭蓋骨の形状に注目した。"},{"sentence":"Platycephalic skulls are sometimes observed in certain populations.","translation":"扁平頭の頭蓋骨は、特定の集団で時々観察される。"}],"collocations":["platycephalic skull","platycephalic index"],"synonyms":["brachycephalic","flat-headed"],"antonyms":["dolichocephalic"],"notes":"This term is often used in anthropology and physical anthropology."}],"etymology":{"value":"From Greek πλατύς (platys) meaning 'flat, broad' and κεφαλή (kephalē) meaning 'head'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplætɪsɪˈfælɪk/","syllables":"plat-y-ce-phal-ic"},"inflection":{"notes":"Adjective, comparative and superlative forms are more platycephalic, most platycephalic."},"usage_notes":{"explanation":"'Platycephalic' refers to a specific skull shape characterized by a flattened top. It is a technical term used in scientific contexts, particularly in anthropology when describing and classifying human skeletal remains or studying variations in skull morphology across different populations. The cephalic index, which is the ratio of the maximum width of the head to its maximum length, is used to quantify this characteristic. A cephalic index greater than 80 typically indicates platycephaly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby's head is platycephalic, so we need a special helmet.","correct":"✓ The baby's head is showing signs of plagiocephaly, so we need a special helmet.","note":"Plagiocephaly is a more common term for head flattening in infants, while platycephalic is a general anthropological term."}],"priority":"★★☆"},"related_words":{"derivatives":["platycephaly (noun)"],"related_terms":["cephalic index","dolichocephalic","mesocephalic","brachycephalic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'platycephalic' is a technical term primarily used in the fields of anthropology and physical anthropology. It describes a skull shape that is flattened from top to bottom. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding this term requires a background in these scientific disciplines."},"example_sentences":[{"sentence":"The ancient skull exhibited a distinctly platycephalic morphology.","translation":"その古代の頭蓋骨は、明らかに扁平頭の形態を示していた。","type":"general","meaning_category":"扁平頭の"},{"sentence":"Measurements confirmed that the individual had a platycephalic head shape.","translation":"測定により、その個体が扁平頭の頭の形をしていることが確認された。","type":"scientific","meaning_category":"扁平頭の"}]}