{"word":"typika","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Eastern Orthodox Church) A service of the Divine Office celebrated when the Divine Liturgy cannot be; it consists mainly of psalms, hymns, and readings from the Scriptures.","english_definition":"A service in the Eastern Orthodox Church that is celebrated in place of the Divine Liturgy when the latter is not possible; it includes psalms, hymns, and Scriptural readings.","examples":[{"sentence":"The typika was celebrated in the small chapel because the priest was ill and unable to perform the Liturgy.","translation":"司祭が病気で聖体礼儀を執り行うことができなかったため、小さな礼拝堂で定型聖歌が執り行われました。"}],"collocations":["celebrate typika","attend typika","read typika"],"synonyms":["Office of the Typika"],"antonyms":["Divine Liturgy"]}],"etymology":{"value":"From Greek τὰ τυπικά (ta typiká), neuter plural of τυπικός (typikós, “according to type, typical”).","priority":"★★☆"},"pronunciation":{"ipa":"/tɪˈpiːkə/","syllables":"ty-pi-ka"},"inflection":{"noun_plural":"typikas"},"usage_notes":{"explanation":"The Typika service is a shortened form of the Divine Liturgy and is used when a priest is unavailable or when certain liturgical restrictions prevent the full Liturgy from being celebrated. It maintains the essential elements of prayer and Scripture reading.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the typikal service.","correct":"✓ I went to the typika service.","note":"The correct term is 'typika,' not 'typikal.'"}],"priority":"★★☆"},"related_words":{"derivatives":["typicon (a liturgical book containing directions for the services)"],"phrases":["Divine Liturgy","Eastern Orthodox Church","Divine Office"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used within Eastern Orthodox religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'typika' is specialized vocabulary related to the Eastern Orthodox Church. Understanding requires familiarity with Orthodox liturgical practices. It refers to a specific type of service celebrated in place of the Divine Liturgy under certain conditions."},"example_sentences":[{"sentence":"During Great Lent, the typika is often celebrated on weekdays when a full Divine Liturgy is not permitted.","translation":"大斎の期間中、聖体礼儀が許可されていない平日に定型聖歌が執り行われることが多いです。","type":"noun","meaning_category":"religious service"}]}