{"word":"Athanasianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アタナシウス主義、アタナシウス信条","english_definition":"The theological system associated with Athanasius, especially his defense of the Nicene Creed's doctrine of the Trinity. Also, the principles expressed in the Athanasian Creed.","examples":[{"sentence":"Athanasianism emphasizes the co-equality and co-eternity of the Father, Son, and Holy Spirit.","translation":"アタナシウス主義は、父、子、聖霊の同等性と共永遠性を強調する。"},{"sentence":"The Athanasian Creed is a summary of Athanasianism.","translation":"アタナシウス信条は、アタナシウス主義の要約である。"}],"collocations":["defend Athanasianism","embrace Athanasianism","Athanasian Creed"],"synonyms":["Trinitarianism","Nicene Christianity"],"antonyms":["Arianism","Unitarianism"]}],"etymology":{"value":"From the name of Athanasius of Alexandria (c. 296–373), a Church Father and defender of the doctrine of the Trinity, and the suffix -ism.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæθəˈneɪʒənɪzəm/","syllables":"A-tha-na-sian-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Athanasianism refers to the theological views associated with Athanasius, particularly his strong defense of the Nicene Creed's understanding of the Trinity. It also refers to the Athanasian Creed, a statement of Christian belief that emphasizes the equality of the three persons of the Trinity. It is often contrasted with Arianism, which denies the full divinity of Jesus Christ.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Athanasianism is about believing in one God.","correct":"✓ Athanasianism is about believing in one God in three persons: Father, Son, and Holy Spirit.","note":"Athanasianism affirms the Trinity, not simply monotheism. It's crucial to specify the belief in one God existing in three co-equal persons."}],"priority":"★★☆"},"related_words":{"derivatives":["Athanasian (adjective, noun)","Athanasius"],"phrases":["Athanasian Creed"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Athanasianism is a complex theological concept related to the Christian doctrine of the Trinity. It is associated with Athanasius, a 4th-century Church Father, and is embodied in the Athanasian Creed. Understanding this term requires familiarity with Christian theology, particularly the debates surrounding the nature of God and the relationship between the Father, Son, and Holy Spirit. It is a term primarily used in theological and historical contexts.","requires_background_knowledge":"Requires knowledge of Christian theology and history."},"example_sentences":[{"sentence":"The Athanasianism of the early church fathers shaped the development of Christian doctrine.","translation":"初期の教会父たちのアタナシウス主義は、キリスト教の教義の発展を形作った。","type":"general","meaning_category":"theological system"},{"sentence":"Many Western churches still recite the Athanasian Creed.","translation":"多くの西洋の教会は今でもアタナシウス信条を唱えている。","type":"specific","meaning_category":"Athanasian Creed"}]}