{"word":"razionalismo","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(filosofia) dottrina filosofica che considera la ragione come fonte primaria di conoscenza, indipendentemente dall'esperienza sensoriale.","english_definition":"(philosophy) the philosophical doctrine that regards reason as the primary source of knowledge, independent of sensory experience.","examples":[{"sentence":"Il razionalismo cartesiano ha influenzato profondamente la filosofia moderna.","translation":"Cartesian rationalism has profoundly influenced modern philosophy."},{"sentence":"Il razionalismo si contrappone all'empirismo, che valorizza l'esperienza sensoriale.","translation":"Rationalism is opposed to empiricism, which values sensory experience."}],"collocations":["razionalismo cartesiano","razionalismo critico","razionalismo illuministico"],"synonyms":["intellettualismo"],"antonyms":["empirismo","irrazionalismo"]},{"part_of_speech":"noun","definition":"(architettura) movimento architettonico del XX secolo caratterizzato da forme semplici, geometriche e funzionali, con un'enfasi sulla razionalità e l'efficienza.","english_definition":"(architecture) an architectural movement of the 20th century characterized by simple, geometric, and functional forms, with an emphasis on rationality and efficiency.","examples":[{"sentence":"Il razionalismo architettonico ha prodotto edifici funzionali e privi di ornamenti superflui.","translation":"Architectural rationalism has produced functional buildings devoid of superfluous ornamentation."},{"sentence":"Il razionalismo italiano degli anni '30 è un esempio di architettura moderna.","translation":"Italian rationalism of the 1930s is an example of modern architecture."}],"collocations":["architettura razionalista","razionalismo italiano","movimento razionalista"],"synonyms":["funzionalismo"],"antonyms":["eclettismo","organicismo"]}],"etymology":{"value":"Deriva dal latino 'ratio' (ragione).","priority":"★★★"},"pronunciation":{"ipa":"/rat.t͡sjo.naˈliːz.mo/","syllables":"ra-zio-na-li-smo"},"inflection":{"noun_plural":"razionalismi"},"usage_notes":{"explanation":"Il termine 'razionalismo' può riferirsi sia a una corrente filosofica che a un movimento architettonico. In filosofia, sottolinea l'importanza della ragione come fonte di conoscenza. In architettura, si manifesta attraverso la progettazione di edifici funzionali e geometrici.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Il razionalismo è l'opposto del sentimento.","correct":"Il razionalismo è l'opposto dell'irrazionalismo o dell'empirismo.","note":"Mentre il razionalismo enfatizza la ragione, il suo opposto filosofico più diretto è l'irrazionalismo (che nega la ragione) o l'empirismo (che enfatizza l'esperienza)."}],"priority":"★★☆"},"related_words":{"derivatives":["razionale","razionalmente","razionalizzare","razionalizzazione"],"related_concepts":["illuminismo","Cartesianismo","funzionalismo"],"priority":"★★☆"},"level_frequency":{"general_frequency":"Media","philosophical_frequency":"Alta","architectural_frequency":"Media","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Il termine 'razionalismo' si riferisce a una corrente di pensiero che valorizza la ragione come strumento principale per acquisire conoscenza. In filosofia, si contrappone all'empirismo, che invece privilegia l'esperienza sensoriale. In architettura, il razionalismo si traduce in edifici caratterizzati da linee semplici e funzionalità. La comprensione del termine richiede una certa familiarità con i concetti filosofici e architettonici."},"example_sentences":[{"sentence":"Il razionalismo di Spinoza si basa su un sistema deduttivo rigoroso.","translation":"Spinoza's rationalism is based on a rigorous deductive system.","type":"filosofia","meaning_category":"filosofia"},{"sentence":"La Casa del Fascio a Como è un esempio di razionalismo architettonico.","translation":"The Casa del Fascio in Como is an example of architectural rationalism.","type":"architettura","meaning_category":"architettura"},{"sentence":"Il razionalismo giuridico cerca di applicare principi logici al diritto.","translation":"Legal rationalism seeks to apply logical principles to law.","type":"altro","meaning_category":"altro"}]}