{"word":"cinter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fused or partly vitrified material used as a base in ceramics or metallurgy.","english_definition":"A material that has been fused or partially vitrified by heating but not to the point of liquefaction, used as a base in ceramics or metallurgy.","examples":[{"sentence":"The cinter is then ground into a fine powder.","translation":"次に、シンターは微粉末に粉砕されます。"},{"sentence":"Cinter is used to create lightweight aggregates.","translation":"シンターは軽量骨材を作るために使用されます。"}],"collocations":["iron ore cinter","ceramic cinter"],"synonyms":["sinter","frit"],"antonyms":[]}],"etymology":{"value":"Derived from 'sinter', with a spelling variation.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsɪntər/","syllables":"cin-ter"},"inflection":{"noun_plural":"cinters"},"usage_notes":{"explanation":"The term 'cinter' is sometimes used interchangeably with 'sinter', although 'sinter' is the more common spelling. It refers to a material formed by sintering, a process of compacting and forming a solid mass of material by heat or pressure without melting it to the point of liquefaction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cinter was melt.","correct":"✓ The cinter was sintered.","note":"Cinter is the result of sintering, not melting. Use 'sintered' to describe the process."}],"priority":"★☆☆"},"related_words":{"derivatives":["sintering"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cinter' is a technical term primarily used in the fields of ceramics and metallurgy. It refers to a material that has undergone sintering, a process where a powder or granular material is heated to a temperature below its melting point, causing the particles to adhere and form a solid mass. Understanding this term requires familiarity with materials science and industrial processes."},"example_sentences":[{"sentence":"The properties of the cinter are crucial for the final product's performance.","translation":"シンターの特性は、最終製品の性能にとって非常に重要です。","type":"noun","meaning_category":"material"},{"sentence":"The cintering process improves the strength and density of the material.","translation":"シンター処理は、材料の強度と密度を向上させます。","type":"noun","meaning_category":"material"}]}