{"word":"antitesi","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"対照、正反対、対立 (主に文学や哲学の用語)","english_definition":"a person or thing that is the direct opposite of someone or something else; a contrast or opposition between two things. (mainly used in literature and philosophy)","examples":[{"sentence":"L'amore e l'odio sono antitesi.","translation":"愛と憎しみは対照的である。(Love and hate are antitheses.)","example_context":"Describes the contrast between two emotions."},{"sentence":"La sua vita è l'antitesi della mia.","translation":"彼の人生は私の人生とは正反対だ。(His life is the antithesis of mine.)","example_context":"Describes the opposing nature of two lives."},{"sentence":"L'antitesi tra bene e male è un tema ricorrente nella letteratura.","translation":"善と悪の対立は文学における繰り返されるテーマである。(The antithesis between good and evil is a recurring theme in literature.)","example_context":"Shows the opposition between two concepts in literature."}],"collocations":["antitesi tra A e B (antithesis between A and B)","essere l'antitesi di (to be the antithesis of)","creare un'antitesi (to create an antithesis)","antitesi retorica (rhetorical antithesis)"],"synonyms":["contrasto","opposizione","contraddizione","inversione","opposto"],"antonyms":["sintesi","accordo","somiglianza","analogia","armonia"]},{"part_of_speech":"noun","definition":"(修辞学)対照法、逆説法","english_definition":"(rhetoric) a figure of speech in which an opposition or contrast of ideas is expressed by parallelism of words that are the opposites of each other.","examples":[{"sentence":"'Uno piccolo passo per un uomo, un grande balzo per l'umanità' è un esempio di antitesi.","translation":"'One small step for a man, one giant leap for mankind' is an example of antithesis.","example_context":"Illustrates the use of antithesis in a famous quote."},{"sentence":"L'oratore ha usato l'antitesi per rendere il suo discorso più efficace.","translation":"演説者は対照法を使って、彼のスピーチをより効果的にした。(The speaker used antithesis to make his speech more effective.)","example_context":"Shows the rhetorical use of antithesis in a speech."}],"collocations":["usare l'antitesi (to use antithesis)","antitesi retorica (rhetorical antithesis)","figura retorica dell'antitesi (rhetorical figure of antithesis)"],"synonyms":["chiasmo","ossimoro","paradosso"],"antonyms":[]}],"etymology":{"value":"Dal greco ἀντίθεσις (antíthesis), da ἀντί (antí, \"contro\") + θέσις (thésis, \"posizione\", \"affermazione\").","priority":"★★☆"},"pronunciation":{"ipa":"/anˈti.te.zi/","notes":"Accento sulla penultima sillaba (ti).","syllables":"an-ti-te-si"},"inflection":{"noun_forms":{"singular":"antitesi","plural":"antitesi (invariato)"}},"usage_notes":{"explanation":"'Antitesi' refers to a direct contrast or opposition. It's used in both general contexts to describe opposing things and specifically in rhetoric to describe a literary device. In rhetoric, it involves using parallel structure to highlight contrasting ideas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Ho usato la sintesi invece dell'antitesi.","correct":"Ho usato la sintesi invece dell'antitesi.","note":"Make sure to understand the difference between 'antitesi' (opposition) and 'sintesi' (synthesis)."},{"incorrect":"L'antitesi è la stessa cosa del paradosso.","correct":"L'antitesi è diversa dal paradosso.","note":"Antithesis and paradox are different literary devices. Antithesis presents a direct contrast, while a paradox presents a seemingly self-contradictory statement."}],"priority":"★★☆"},"related_words":{"derivatives":["antitetico (adjective: antithetical)"],"related_terms":["tesi (thesis)","sintesi (synthesis)","dialettica (dialectics)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, more common in academic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antitesi' is a term that is more commonly found in academic, philosophical, or literary discussions. It refers to a direct opposition or contrast between two things. It is also used as a rhetorical device where contrasting ideas are presented in a balanced or parallel structure. Understanding this term requires a good grasp of abstract concepts and rhetorical devices."},"example_sentences":[{"sentence":"La pace e la guerra sono spesso considerate antitesi.","translation":"Peace and war are often considered antitheses.","type":"general","meaning_category":"opposition"},{"sentence":"Il suo ottimismo è in completa antitesi con il mio pessimismo.","translation":"His optimism is in complete antithesis to my pessimism.","type":"general","meaning_category":"opposition"},{"sentence":"L'oratore ha utilizzato l'antitesi per enfatizzare il contrasto tra ricchezza e povertà.","translation":"The speaker used antithesis to emphasize the contrast between wealth and poverty.","type":"rhetorical","meaning_category":"rhetoric"},{"sentence":"'Chiedi non cosa il tuo paese può fare per te, ma cosa tu puoi fare per il tuo paese' è un esempio classico di antitesi.","translation":"'Ask not what your country can do for you, ask what you can do for your country' is a classic example of antithesis.","type":"rhetorical","meaning_category":"rhetoric"}]}