{"word":"homoeocrystalline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(鉱物学)均質結晶の、同質結晶の","english_definition":"(mineralogy) Consisting of crystals of the same kind throughout; of uniform crystalline structure.","examples":[{"sentence":"The rock sample was described as homoeocrystalline, indicating a uniform mineral composition.","translation":"その岩石サンプルは同質結晶であると記述され、均一な鉱物組成を示していた。"}],"collocations":["homoeocrystalline texture","homoeocrystalline rock"],"synonyms":["holocrystalline","euhedral","idiomorphic"],"antonyms":["heterocrystalline","hypocrystalline","amorphous"]}],"etymology":{"value":"Derived from the Greek words 'homoeo' (same, similar) and 'crystalline' (relating to crystals).","priority":"★★★"},"pronunciation":{"ipa":"ˌhoʊmioʊˈkrɪstəˌlaɪn","syllables":"ho-me-o-crys-tal-line"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"This term is primarily used in mineralogy and petrology to describe rocks or minerals that are entirely composed of crystals of the same type, indicating a uniform crystalline structure throughout the sample. It is often used in contrast to rocks with mixed crystalline and non-crystalline components.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The homoeocrystalline structure made the rock very brittle.","correct":"✓ The homoeocrystalline texture made the rock very brittle.","note":"'Homoeocrystalline' describes the uniformity of the crystalline structure, not necessarily the physical properties like brittleness. The texture might influence brittleness, but the term itself doesn't imply it."}],"priority":"★☆☆"},"related_words":{"derivatives":["homoeoblastesis","homoeomorphous","homoeotopy"],"related_terms":["holocrystalline","euhedral","idiomorphic","xenomorphic","panidiomorphic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized term in mineralogy.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Homoeocrystalline' is a technical term used in geology, specifically in the study of rocks and minerals. It describes a rock or mineral that is made up entirely of crystals of the same kind. This means that if you were to look at a sample of this material under a microscope, you would only see crystals, and those crystals would all be of the same type. This is important because it tells geologists about the conditions under which the rock or mineral formed. The term is not commonly used outside of specialized scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The thin section revealed a homoeocrystalline texture, indicative of slow cooling and crystallization.","translation":"薄片は、ゆっくりとした冷却と結晶化を示す、同質結晶の組織を明らかにした。","type":"scientific","meaning_category":"mineralogy"},{"sentence":"The geologist identified the rock as homoeocrystalline granite.","translation":"地質学者はその岩石を同質結晶の花崗岩であると特定した。","type":"scientific","meaning_category":"geology"}]}