{"word":"Zoogeology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"動物地質学：地質学的視点から動物の分布と化石を研究する学問","english_definition":"The study of the geographic distribution of animals and their fossils from a geological perspective.","examples":[{"sentence":"Zoogeology helps us understand how animal populations have changed over time due to geological events.","translation":"動物地質学は、地質学的イベントによって動物の個体数が時間とともにどのように変化してきたかを理解するのに役立ちます。"},{"sentence":"The professor specialized in zoogeology, focusing on the fossil records of mammals.","translation":"その教授は動物地質学を専門とし、哺乳類の化石記録に焦点を当てていました。"}],"collocations":["fossil record","animal distribution","geological events","paleontology","biogeography"],"synonyms":["paleozoology","animal paleontology"],"antonyms":[]}],"etymology":{"value":"'Zoo-' (動物) + 'geology' (地質学) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"ˌzoʊ.oʊ.dʒiˈɒlədʒi","syllables":"zo-o-ge-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Zoogeology is a specialized field that combines zoology and geology to study the distribution of animals in relation to geological features and events. It often involves the study of fossils to understand how animal populations have evolved and migrated over geological time scales.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["zoogeological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Zoogeology is a highly specialized term used in academic and scientific contexts. It combines knowledge of both zoology and geology, making it relevant for experts in these fields. The term is not commonly used in general conversation."},"example_sentences":[{"sentence":"Research in zoogeology has revealed important insights into the migration patterns of ancient mammals.","translation":"動物地質学の研究は、古代哺乳類の移動パターンに関する重要な洞察を明らかにしました。","type":"general","meaning_category":"study of animal distribution"},{"sentence":"The principles of zoogeology are applied to understand the impact of climate change on current animal habitats.","translation":"動物地質学の原理は、気候変動が現在の動物の生息地に与える影響を理解するために応用されています。","type":"application","meaning_category":"application of the field"}]}