{"word":"Costumery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"衣装、衣装類、衣装のコレクション","english_definition":"Costumes, especially those used in a theatrical production or for a particular occasion; the art or business of making or supplying costumes.","examples":[{"sentence":"The costumery for the play was elaborate and colorful.","translation":"その劇の衣装は凝っていてカラフルだった。"},{"sentence":"She has a large collection of historical costumery.","translation":"彼女は歴史的な衣装の大きなコレクションを持っている。"},{"sentence":"The shop specializes in theatrical costumery.","translation":"その店は演劇用の衣装を専門に扱っている。"}],"collocations":["theatrical costumery (演劇衣装)","historical costumery (歴史衣装)","wedding costumery (結婚式用衣装)"],"synonyms":["costumes","attire","garb","dress","clothing","outfits","wardrobe"],"antonyms":[]}],"etymology":{"value":"\"Costumery\" derives from \"costume,\" which comes from the Italian word \"costume\" meaning \"habit, fashion.\" The suffix \"-ery\" indicates a collection or type of something, or a place where something is made or sold. Therefore, \"costumery\" refers to a collection of costumes, or a business dealing with costumes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒstjuːməri/","syllables":"cos-tu-mer-y"},"inflection":{"noun_plural":"costumeries"},"usage_notes":{"explanation":"\"Costumery\" is a noun that refers to costumes in general, especially those used for theatrical productions, historical reenactments, or special events. It can also refer to the art or business of making or supplying costumes. The word often implies a focus on elaborate or specialized costumes. It is less commonly used than the word \"costumes\" itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The costumery was very comfort.","correct":"✓ The costumery was very comfortable.","note":"\"Comfort\" is a noun or verb, while \"comfortable\" is an adjective. When describing the quality of the costumery, use the adjective \"comfortable.\""},{"incorrect":"✗ He is a costumery designer.","correct":"✓ He is a costume designer.","note":"While \"costumery\" refers to the collection or business of costumes, the correct term for a designer of costumes is \"costume designer.\""}],"priority":"★★☆"},"related_words":{"derivatives":["costume (noun: 衣装)","costumer (noun: 衣装係、衣装デザイナー)","costumed (adjective: 衣装を着た)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Costumery\" is a relatively uncommon word that refers to a collection of costumes, especially those used in theatrical productions or historical reenactments. It can also refer to the business or art of making or supplying costumes. Because it is not a commonly used word, it is more likely to be encountered in specialized contexts such as theater, historical studies, or fashion. Understanding the word requires a good vocabulary and familiarity with related terms like \"costume\" and \"theatrical.\" The suffix \"-ery\" is used to indicate a collection or type of something, which can help in understanding the meaning of the word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The museum had an exhibit of elaborate historical costumery.","translation":"その博物館には、凝った歴史衣装の展示があった。","type":"noun","meaning_category":"衣装のコレクション"},{"sentence":"The costumery department worked tirelessly to create the outfits for the musical.","translation":"衣装部はミュージカルの衣装を作るために精力的に働いた。","type":"noun","meaning_category":"衣装類"},{"sentence":"Her passion for costumery led her to open a vintage clothing store.","translation":"彼女の衣装への情熱が、彼女にヴィンテージの服屋を開業させた。","type":"noun","meaning_category":"衣装のビジネス"}]}