{"word":"schistosome","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"住血吸虫","english_definition":"A parasitic flatworm of the genus Schistosoma, causing schistosomiasis.","examples":[{"sentence":"Schistosomiasis is caused by schistosomes.","translation":"住血吸虫症は住血吸虫によって引き起こされる。"},{"sentence":"Schistosome eggs are found in the feces or urine of infected individuals.","translation":"住血吸虫の卵は、感染者の糞便または尿中に見られる。"}],"collocations":["schistosome infection","schistosome egg","schistosome dermatitis"],"synonyms":["blood fluke"],"antonyms":[]}],"etymology":{"value":"From the Greek words σχιστός (schistos) meaning 'split' and σῶμα (soma) meaning 'body', referring to the split appearance of the male worm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskɪstəˌsoʊm/","syllables":"schis-to-some"},"inflection":{"noun_plural":"schistosomes"},"usage_notes":{"explanation":"Schistosomes are parasitic flatworms that cause the disease schistosomiasis, also known as bilharzia. The worms live in the blood vessels of humans and other mammals. Infection occurs when people come into contact with contaminated freshwater containing the larval form of the parasite.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ schistozome","correct":"✓ schistosome","note":"Common misspelling."}],"priority":"★☆☆"},"related_words":{"derivatives":["schistosomiasis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'schistosome' is a specialized term used in the fields of medicine, parasitology, and public health. It refers to a specific type of parasitic worm that causes a significant disease, schistosomiasis. Understanding this term requires a background in biology or medicine. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Control of schistosomiasis relies on reducing contact with freshwater sources where schistosomes are present.","translation":"住血吸虫症の制御は、住血吸虫が存在する淡水源との接触を減らすことに依存している。","type":"noun","meaning_category":"parasitic worm"},{"sentence":"The life cycle of the schistosome involves both a human host and a freshwater snail.","translation":"住血吸虫のライフサイクルには、ヒトの宿主と淡水巻貝の両方が関与している。","type":"noun","meaning_category":"parasitic worm"},{"sentence":"Diagnosis of schistosomiasis is typically made by detecting schistosome eggs in stool or urine samples.","translation":"住血吸虫症の診断は通常、糞便または尿サンプル中の住血吸虫卵の検出によって行われる。","type":"noun","meaning_category":"parasitic worm"}]}