{"word":"uncoachableness","priority":"low","meanings":[{"part_of_speech":"noun","definition":"指導を受け入れない性質、コーチングを受け付けないこと","english_definition":"The state or quality of being unwilling or unable to be taught or guided effectively; resistance to coaching or instruction.","examples":[{"sentence":"His uncoachableness was a major obstacle to his improvement as a player.","translation":"彼の指導を受け入れない性質は、選手としての成長における大きな障害だった。"},{"sentence":"The coach identified uncoachableness as a key issue within the team.","translation":"コーチは、チーム内の重要な問題として、指導を受け入れない性質を特定した。"}],"collocations":["display uncoachableness (指導を受け入れない態度を示す)","overcome uncoachableness (指導を受け入れない性質を克服する)","address uncoachableness (指導を受け入れない性質に対処する)"],"synonyms":["intractability","recalcitrance","obstinacy","stubbornness","resistance to instruction"],"antonyms":["coachability","teachability","receptiveness","openness to instruction"]}],"etymology":{"value":"The word is formed by adding the prefixes 'un-' (not) and '-ness' (state or quality of) to the word 'coachable' (capable of being coached).","priority":"medium"},"pronunciation":{"ipa":"ʌnˈkoʊtʃəbəlˌnɛs","syllables":"un-coach-a-ble-ness"},"inflection":{"noun_plural":"uncoachablenesses (rarely used)"},"usage_notes":{"explanation":"'Uncoachableness' refers to a person's unwillingness or inability to accept guidance, advice, or instruction from a coach or mentor. It often implies a resistance to change or a belief that one's own methods are superior. This trait can hinder personal growth and development, particularly in sports, professional settings, or educational environments.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"His uncoachableness made him a bad coach.","correct":"His lack of coaching ability made him a bad coach.","note":"'Uncoachableness' describes someone who doesn't accept coaching, not someone who is bad at coaching others."}],"priority":"medium"},"related_words":{"derivatives":["uncoachable (adjective)"],"antonyms":["coachableness","teachableness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"'Uncoachableness' is a complex term referring to the characteristic of being resistant to instruction or guidance, typically from a coach or mentor. It suggests a deep-seated unwillingness or inability to accept feedback or adapt one's approach, which can significantly impede progress in various fields. This term is not commonly used in everyday conversation but is more likely to appear in discussions related to sports, professional development, or education, where the ability to learn and adapt is crucial."},"example_sentences":[{"sentence":"The athlete's uncoachableness frustrated the coaching staff, hindering their ability to improve his performance.","translation":"その選手の指導を受け入れない性質はコーチングスタッフをイライラさせ、彼のパフォーマンスを向上させる能力を妨げた。","type":"general"},{"sentence":"The manager addressed the employee's uncoachableness by implementing a structured feedback system and offering personalized mentorship.","translation":"マネージャーは、構造化されたフィードバックシステムを導入し、個別化された指導を提供することで、従業員の指導を受け入れない性質に対処した。","type":"professional"}]}