{"word":"Cotype","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（生物学）共模式標本：原記載において指定された複数の標本のうち、ホロタイプ（正模式標本）が指定されていない場合に、そのうちの一つを指す。","english_definition":"(biology) A syntype; one of several specimens cited in the original description of a species when a holotype (the primary type specimen) was not designated.","examples":[{"sentence":"The cotype of this species is kept in the museum.","translation":"この種の共模式標本は博物館に保管されています。"},{"sentence":"Researchers examined the cotype to clarify the species' characteristics.","translation":"研究者たちは、その種の特徴を明らかにするために共模式標本を調べた。"}],"collocations":["designate a cotype","examine the cotype","cotype specimen","original cotype"],"synonyms":["syntype"],"antonyms":["holotype","paratype","neotype"]}],"etymology":{"value":"「co-」（共に）＋「type」（型、標本）からなる。","priority":"★★★"},"pronunciation":{"ipa":"ˈkoʊtaɪp","syllables":"co-type"},"inflection":{"noun_plural":"cotypes"},"usage_notes":{"explanation":"「**Cotype**」は生物学、特に分類学で使用される専門用語です。原記載時にホロタイプが指定されなかった場合に、タイプ標本として扱われる複数の標本の一つを指します。現在では、ホロタイプが指定されていない場合、レクトタイプ（lectotype, 選定模式標本）を指定することが推奨されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This is the cotype, so it's the most important specimen.","correct":"✓ This is the holotype, so it's the most important specimen.","note":"コタイプはホロタイプが指定されなかった場合にタイプ標本となるもので、ホロタイプが最も重要な標本です。"},{"incorrect":"✗ The cotype was collected after the holotype.","correct":"✓ The cotype was collected at the same time as other specimens used in the original description, since a holotype was not designated.","note":"コタイプはホロタイプが指定されなかった場合に、原記載で使用された複数の標本の一つです。ホロタイプが後に指定されることはありません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["holotype (正模式標本)","paratype (副模式標本)","lectotype (選定模式標本)","neotype (新模式標本)","syntype (合模式標本 = cotype)","type specimen (模式標本)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 生物学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Cotype (共模式標本)**」は、生物学、特に分類学で使用される専門用語です。ある生物種を新種として発表する際に、基準となる標本（タイプ標本）が必要となります。通常はホロタイプ（正模式標本）という一つの標本を指定しますが、初期の研究では複数の標本をタイプ標本として指定することがありました。この複数の標本の一つ一つがコタイプです。現在では、コタイプという用語はあまり使われず、代わりにレクトタイプ（選定模式標本）という、複数の標本の中から一つを選んでタイプ標本とする方法が一般的です。生物学の研究論文や専門書で目にすることがあります。"},"example_sentences":[{"sentence":"The original description of the species mentioned several cotype specimens.","translation":"その種の原記載では、複数の共模式標本が言及されていた。","type":"noun","meaning_category":"共模式標本"},{"sentence":"Researchers are studying the cotype to better understand the species' morphology.","translation":"研究者たちは、その種の形態をより良く理解するために共模式標本を研究している。","type":"noun","meaning_category":"共模式標本"}]}