{"word":"keyer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(アマチュア無線) 電鍵、キーヤー","english_definition":"An electronic device used in radio telegraphy (Morse code) to generate precisely timed dots and dashes, often with features like automatic spacing and memory.","examples":[{"sentence":"The experienced ham operator preferred a paddle keyer for its precise control.","translation":"熟練したアマチュア無線家は、正確な制御ができるパドルキーヤーを好んだ。"},{"sentence":"Modern keyers often include memory functions to store frequently used messages.","translation":"現代のキーヤーは、頻繁に使用されるメッセージを保存するためのメモリ機能を含むことが多い。"}],"collocations":["paddle keyer","electronic keyer","iambic keyer","memory keyer"],"synonyms":["electronic key","automatic keyer"],"antonyms":[],"notes":"Keyers are typically used in amateur radio (ham radio) to send Morse code more efficiently and accurately than with a traditional hand key."},{"part_of_speech":"noun","definition":"(映像編集) キーヤー","english_definition":"A device or software function used in video production to electronically remove a specific color (usually blue or green) from an image, allowing another image or video to be placed behind it.","examples":[{"sentence":"The weather reporter stood in front of a green screen, and the keyer replaced the green with a weather map.","translation":"天気予報士はグリーンスクリーンの前に立ち、キーヤーが緑色を天気図に置き換えた。"},{"sentence":"The keyer settings need to be adjusted to eliminate any artifacts around the edges of the subject.","translation":"被写体のエッジ周りの不要な部分を削除するために、キーヤーの設定を調整する必要がある。"}],"collocations":["chroma keyer","digital keyer","linear keyer"],"synonyms":["chroma key","keying device"],"antonyms":[],"notes":"Keyers are essential for creating special effects in television and film, allowing for the seamless integration of different video elements."}],"etymology":{"value":"The term 'keyer' is derived from 'key,' referring to the telegraph key or the process of keying (activating or controlling) a signal.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːər/","syllables":"key-er"},"inflection":{"noun_plural":"keyers"},"usage_notes":{"explanation":"The term 'keyer' has two distinct meanings depending on the context. In amateur radio, it refers to a device that aids in sending Morse code. In video production, it refers to a device or software function used for chroma keying (e.g., green screen effects).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a keyboard to send Morse code.","correct":"✓ He used a keyer to send Morse code.","note":"A keyboard is a general input device, while a keyer is specifically designed for generating Morse code signals."},{"incorrect":"✗ The chroma key was used to adjust the brightness.","correct":"✓ The keyer was used to remove the green screen.","note":"Chroma key is the technique, while the keyer is the device or function that performs the chroma keying."}],"priority":"★★☆"},"related_words":{"derivatives":["key (verb, to operate a keyer)","keying (noun, the process of using a keyer)"],"phrasal_verbs":[],"related_concepts":["Morse code","ham radio","chroma key","green screen","video editing","special effects"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical contexts)","frequency_google_ngram":"Low frequency (specific technical domains)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'keyer' is a technical term that requires some background knowledge to understand fully. It has two main meanings: one in the context of amateur radio, where it refers to a device for sending Morse code, and another in video production, where it refers to a device or function for chroma keying (removing a color background). Understanding which meaning is intended requires considering the context in which the word is used. The term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The ham radio enthusiast built his own electronic **keyer**.","translation":"そのアマチュア無線愛好家は、自作の電子キーヤーを製作した。","type":"noun","meaning_category":"Amateur Radio"},{"sentence":"The video editor used a **keyer** to composite the actor into the fantasy landscape.","translation":"ビデオ編集者はキーヤーを使って、俳優をファンタジーの風景に合成した。","type":"noun","meaning_category":"Video Editing"}]}