{"word":"axised","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(動詞 axis の過去形・過去分詞)軸を中心に置く、軸に沿って配置する","english_definition":"(past tense and past participle of the verb 'axis') to arrange or align something along an axis.","examples":[{"sentence":"The building was carefully axised to maximize sunlight.","translation":"その建物は、日光を最大限に活用できるように、慎重に軸を合わせて配置された。"},{"sentence":"The data was axised to show the correlation between the two variables.","translation":"そのデータは、2つの変数の相関関係を示すために軸を合わせて配置された。"}],"collocations":[],"synonyms":["aligned","centered","oriented"],"antonyms":["misaligned","uncentered","disoriented"]}],"etymology":{"value":"The word 'axised' is derived from the verb 'axis', which comes from the Latin word 'axis', meaning 'an axle, pivot, or axis of the earth or heavens'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæksɪst/ or /ˈæksɪzd/","syllables":"ax-ised or ax-isd"},"inflection":{"verb_forms":{"present_simple":["axis","axises"],"past_simple":"axised","past_participle":"axised","present_participle":"axising"}},"usage_notes":{"explanation":"'Axised' is the past tense and past participle of the verb 'axis'. It is used to describe something that has been aligned or oriented along an axis. This term is often found in technical or specialized contexts, such as architecture, data analysis, or engineering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The map was axised on the wall.","correct":"✓ The map was aligned on the wall.","note":"'Axised' implies a specific alignment along an axis, not just any placement. 'Aligned' is a more general term for placing something in a straight line or correct position."}],"priority":"★☆☆"},"related_words":{"derivatives":["axis (noun)","axial (adjective)","axially (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Axised' is a technical term used to describe the alignment or orientation of something along an axis. It is most commonly encountered in specialized fields such as engineering, architecture, or data analysis, where precise alignment is crucial. The term implies a deliberate and careful positioning to maximize a specific outcome or relationship. Due to its specialized nature, it is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The telescope was carefully axised to observe the distant galaxy.","translation":"その望遠鏡は、遠い銀河を観測するために慎重に軸を合わせた。","type":"verb","meaning_category":"軸を中心に置く"},{"sentence":"The data points were axised on the graph to reveal the trend.","translation":"そのデータ点は、傾向を明らかにするためにグラフ上で軸を合わせて配置された。","type":"verb","meaning_category":"軸に沿って配置する"}]}