{"word":"transnationalizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"多国籍化する、国境を越えて広がる、国際化する","english_definition":"To extend or operate across national boundaries; to become transnational.","examples":[{"sentence":"The company is transnationalizing its operations to increase profits.","translation":"その会社は利益を増やすために事業を多国籍化している。"},{"sentence":"Transnationalizing education requires adapting curricula to different cultures.","translation":"教育を国際化するには、カリキュラムを異なる文化に適応させる必要がある。"},{"sentence":"The internet is transnationalizing communication.","translation":"インターネットはコミュニケーションを国際化している。"}],"collocations":["transnationalizing business","transnationalizing education","transnationalizing culture","transnationalizing economy"],"synonyms":["globalizing","internationalizing","multinationalizing"],"antonyms":["nationalizing","localizing","domesticating"]}],"etymology":{"value":"The word is formed by combining \"transnational\" (across national boundaries) with the suffix \"-ize\" or \"-ise\" (to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/trænzˈnæʃənəˌlaɪzɪŋ/","syllables":"trans-na-tion-al-iz-ing"},"inflection":{"verb_forms":{"present_simple":["transnationalize","transnationalizes"],"past_simple":"transnationalized","past_participle":"transnationalized","present_participle":"transnationalizing"}},"usage_notes":{"explanation":"\"Transnationalizing\" refers to the process of something becoming transnational, meaning it extends or operates across national boundaries. This can apply to businesses, organizations, cultures, or even ideas. It often involves adapting to different cultural and legal environments. It is similar to \"globalizing\" and \"internationalizing,\" but \"transnationalizing\" emphasizes the crossing of national borders and the interconnectedness of different countries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transnationalizing company.","correct":"✓ The transnational company.","note":"\"Transnationalizing\" is a verb (present participle) describing an ongoing process. To describe a company that already operates across national borders, use the adjective \"transnational.\""},{"incorrect":"✗ Transnationalizing is good for all countries.","correct":"✓ Transnationalization is good for all countries.","note":"When referring to the general process or concept, use the noun \"transnationalization\" rather than the verb form \"transnationalizing.\""}],"priority":"★★☆"},"related_words":{"derivatives":["transnational (adjective)","transnationalism (noun)","transnationalization (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Transnationalizing\" is a complex term that describes the process of something extending or operating across national borders. It's often used in the context of business, politics, and culture. Understanding this word requires familiarity with the concept of transnationalism, which refers to the interconnectedness and interdependence of nations. The word is formed by adding the suffix \"-ize\" to \"transnational,\" indicating the act of making something transnational. It is a more specialized term than \"globalizing\" or \"internationalizing,\" and it emphasizes the crossing of national boundaries and the interconnectedness of different countries."},"example_sentences":[{"sentence":"The rapid transnationalizing of financial markets has created new challenges for regulators.","translation":"金融市場の急速な多国籍化は、規制当局に新たな課題を生み出している。","type":"verb (present participle)","meaning_category":"多国籍化する"},{"sentence":"We are studying the factors that are driving the transnationalizing of higher education.","translation":"私たちは高等教育の国際化を推進する要因を研究している。","type":"verb (present participle)","meaning_category":"国際化する"},{"sentence":"The transnationalizing of crime requires international cooperation to combat it effectively.","translation":"犯罪の国際化は、効果的に対処するために国際協力が必要となる。","type":"verb (present participle)","meaning_category":"国境を越えて広がる"}]}