{"word":"Vestals","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマの)ウェスタの巫女たち","english_definition":"(in ancient Rome) virgin priestesses of Vesta, goddess of the hearth.","examples":[{"sentence":"The Vestals were responsible for maintaining the sacred fire.","translation":"ウェスタの巫女たちは聖なる火を維持する責任を負っていた。"},{"sentence":"A Vestal who broke her vow of chastity was buried alive.","translation":"純潔の誓いを破ったウェスタの巫女は生き埋めにされた。"}],"collocations":["sacred fire","vow of chastity"],"synonyms":["Vestal Virgins"],"antonyms":[]}],"etymology":{"value":"From Latin Vestales, plural of Vestalis, pertaining to Vesta, the Roman goddess of the hearth.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɛstəlz/","syllables":"Ves-tals"},"inflection":{"noun_plural":"Vestals"},"usage_notes":{"explanation":"'Vestals' refers specifically to the group of priestesses dedicated to the Roman goddess Vesta. They were chosen as young girls and served for 30 years, during which time they had to remain virgins. Their main duty was to keep the sacred fire of Vesta burning, as it was believed to be linked to the safety and prosperity of Rome.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Vestal (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Vestals' is a specialized historical term referring to a specific group of priestesses in ancient Rome. Understanding requires knowledge of Roman history and religion. The concept is not commonly used in modern contexts outside of historical discussions or literature.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The duties of the Vestals were crucial to the well-being of Rome.","translation":"ウェスタの巫女たちの義務は、ローマの幸福にとって非常に重要だった。","type":"noun","meaning_category":"historical"},{"sentence":"The Vestals enjoyed a unique and privileged position in Roman society.","translation":"ウェスタの巫女たちは、ローマ社会において独特で特権的な地位を享受していた。","type":"noun","meaning_category":"historical"}]}