{"word":"resuscitator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人工呼吸器、蘇生器","english_definition":"An apparatus used to revive someone from apparent death or unconsciousness, typically by forcing oxygen into the lungs.","examples":[{"sentence":"The paramedics used a resuscitator to help the victim breathe.","translation":"救急隊員は、被害者の呼吸を助けるために蘇生器を使用した。"},{"sentence":"The hospital has a variety of resuscitators for different patient needs.","translation":"病院には、さまざまな患者のニーズに対応できる様々な蘇生器がある。"}],"collocations":["manual resuscitator","oxygen resuscitator","ambu bag resuscitator"],"synonyms":["ventilator","ambu bag","artificial respirator"],"antonyms":[]}],"etymology":{"value":"From 'resuscitate' + '-or'. 'Resuscitate' comes from Latin 're-' (again) + 'suscitare' (to raise up, revive).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈsʌsɪteɪtər/","syllables":"re-sus-ci-ta-tor"},"inflection":{"noun_plural":"resuscitators"},"usage_notes":{"explanation":"A 'resuscitator' is a device used to help someone breathe when they are unable to do so on their own. It is commonly used in emergency situations and in hospitals. The term often refers to a manual device, such as an Ambu bag, but can also refer to more complex mechanical ventilators.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the respirator to resuscitator the patient.","correct":"✓ He used the resuscitator to resuscitate the patient.","note":"'Resuscitator' is the noun (the device), while 'resuscitate' is the verb (the action of reviving someone)."},{"incorrect":"✗ The resuscitator is a medicine.","correct":"✓ The resuscitator is a medical device.","note":"A resuscitator is a piece of equipment, not a drug."}],"priority":"★★☆"},"related_words":{"derivatives":["resuscitate (verb): to revive someone from apparent death or unconsciousness.","resuscitation (noun): the action of resuscitating someone.","resuscitated (adjective): having been brought back to consciousness or life."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'resuscitator' is a specialized medical term. It is used to describe a device that helps someone breathe when they are unable to do so themselves. It is derived from the verb 'resuscitate,' which means to revive someone from apparent death. This word is most likely to be encountered in medical contexts or in discussions about emergency medical care."},"example_sentences":[{"sentence":"The emergency medical technician quickly deployed the **resuscitator** to assist the unconscious patient.","translation":"救急救命士は、意識不明の患者を助けるために、すぐに蘇生器を展開した。","type":"noun","meaning_category":"人工呼吸器"},{"sentence":"Proper training is essential for effectively using a manual **resuscitator**.","translation":"手動式蘇生器を効果的に使用するには、適切な訓練が不可欠です。","type":"noun","meaning_category":"蘇生器"},{"sentence":"The **resuscitator** delivered a steady flow of oxygen to the patient's lungs.","translation":"蘇生器は、患者の肺に安定した酸素の流れを送った。","type":"noun","meaning_category":"人工呼吸器"}]}