{"word":"guideword","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"見出し語、ガイドワード：辞書や索引などで、ページの上部や左右端に印刷され、そのページに含まれる最初の語と最後の語を示す語。これにより、目的の語がそのページにあるかどうかを素早く判断できる。","english_definition":"A word printed at the top of a page in a dictionary or other reference book to indicate the first or last item on that page.","examples":[{"sentence":"The guideword on the left page of the dictionary is 'apple', and the guideword on the right page is 'apricot'.","translation":"辞書の左ページのガイドワードは「apple」で、右ページのガイドワードは「apricot」です。"},{"sentence":"By checking the guidewords, I quickly found the page containing the word I was looking for.","translation":"ガイドワードを確認することで、探している単語が載っているページをすぐに見つけることができました。"}],"collocations":["dictionary guideword","index guideword","check the guidewords","find the guidewords"],"synonyms":["guide word","header word","running head"],"antonyms":[]}],"etymology":{"value":"The word 'guideword' is a compound of 'guide' and 'word', reflecting its function to guide the reader to the correct location in a reference work.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɡaɪd.wɜːrd/","syllables":"guide-word"},"inflection":{"noun_plural":"guidewords"},"usage_notes":{"explanation":"Guidewords are primarily used in printed dictionaries, encyclopedias, and indexes. They are less common in digital versions, where search functions provide more direct access to information. They are designed for quick visual scanning to locate a specific entry.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"The guideword was very guiding.","correct":"The guideword helped me find the entry quickly.","note":"Avoid using 'guiding' as an adjective to describe the guideword. Instead, focus on its function of helping the reader."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dictionary","index","entry","page","alphabetical order"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'guideword' is specific to reference materials like dictionaries and indexes. It refers to the word at the top of a page that indicates the range of entries found on that page. Understanding this term is helpful for efficiently using printed reference books."},"example_sentences":[{"sentence":"Always check the guidewords before searching through the entire page.","translation":"ページ全体を調べる前に、必ずガイドワードを確認してください。","type":"noun","meaning_category":"dictionary use"},{"sentence":"The index uses guidewords to help readers quickly locate the relevant section.","translation":"索引では、読者が関連するセクションを素早く見つけられるように、ガイドワードが使用されています。","type":"noun","meaning_category":"index use"}]}