{"word":"bothrenchyma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"星状細胞組織：植物の組織で、星状の細胞が互いに密接に絡み合って形成されるもの。特に、スイレン科の植物の葉柄や根に見られる。","english_definition":"A type of plant tissue consisting of star-shaped cells closely interwoven, found especially in the petioles and roots of plants in the family Nymphaeaceae (water lilies).","examples":[{"sentence":"The petioles of water lilies exhibit a characteristic bothrenchyma structure.","translation":"スイレンの葉柄は特徴的な星状細胞組織の構造を示す。"}],"collocations":["bothrenchyma tissue","Nymphaeaceae bothrenchyma"],"synonyms":["stellate parenchyma"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'bothros' (pit, hollow) and 'enchyma' (infused tissue), referring to the pitted or hollow appearance of the tissue due to the intercellular spaces between the star-shaped cells.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɒθˈrɛŋkɪmə/","syllables":"both-ren-chy-ma"},"inflection":{"noun_plural":"bothrenchymas / bothrenchymata"},"usage_notes":{"explanation":"Bothrenchyma is a specialized type of parenchyma tissue adapted for buoyancy and aeration in aquatic plants. The star-shaped cells create large intercellular spaces, facilitating gas exchange and reducing the density of the plant tissue.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["parenchyma","aerenchyma"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Bothrenchyma' is a highly specialized botanical term used to describe a specific type of plant tissue found in aquatic plants, particularly water lilies. Due to its highly technical nature, it is rarely encountered outside of specialized botanical contexts and scientific literature. Understanding requires familiarity with plant anatomy and terminology."},"example_sentences":[{"sentence":"The presence of bothrenchyma in water lily petioles aids in their flotation.","translation":"スイレンの葉柄における星状細胞組織の存在は、それらの浮遊を助ける。","type":"noun","meaning_category":"plant tissue"}]}