{"word":"spirit-froze","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(過去形)精神を凍らせる、魂を凍りつかせる","english_definition":"(past tense of spirit-freeze) To cause someone to be overcome with intense fear, shock, or emotional numbness.","examples":[{"sentence":"The horrifying sight spirit-froze her, leaving her unable to move or speak.","translation":"その恐ろしい光景は彼女の精神を凍らせ、動いたり話したりすることができなくなった。"},{"sentence":"He was spirit-froze by the sudden news of the accident.","translation":"彼は突然の事故の知らせに魂を凍りつかせられた。"}],"collocations":["spirit-froze with fear","spirit-froze by the sight","spirit-froze into silence"],"synonyms":["terrified","petrified","paralyzed","numbed","stupefied"],"antonyms":["animated","invigorated","inspired","emboldened"]}],"etymology":{"value":"A compound word formed from 'spirit' (referring to the mind, soul, or emotional state) and 'froze' (the past tense of 'freeze,' meaning to harden or become solid with cold). The combination suggests a state where one's emotional or mental state is metaphorically frozen or immobilized.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɪrɪtˌfroʊz/","syllables":"spi-rit-froze"},"inflection":{"verb_forms":{"present_simple":["spirit-freeze","spirit-freezes"],"past_simple":"spirit-froze","past_participle":"spirit-frozen","present_participle":"spirit-freezing"}},"usage_notes":{"explanation":"'Spirit-froze' is a vivid and figurative term used to describe a state of extreme emotional or psychological shock. It implies a temporary paralysis of one's mental and emotional faculties due to a traumatic or intensely frightening experience. The term is not commonly used in everyday conversation but can be found in literary or descriptive contexts to emphasize the profound impact of an event on someone's psyche.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spirit-froze feeling never left him.","correct":"✓ The spirit-freezing feeling never left him.","note":"When used as an adjective, the present participle 'spirit-freezing' is more appropriate to describe the ongoing quality of the feeling."},{"incorrect":"✗ She was spirit-froze of the ghost.","correct":"✓ She was spirit-froze by the ghost.","note":"The preposition 'by' is typically used to indicate the cause or agent of the spirit-freezing effect."}],"priority":"★★☆"},"related_words":{"derivatives":["spirit-freezing (adjective: 精神を凍らせるような)","spirit-frozen (adjective: 精神が凍りついた)"],"phrasal_verbs":[],"related_concepts":["trauma","shock","fear","paralysis","emotional numbness"]},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Low frequency - Not a common term; usage is primarily literary or descriptive.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spirit-froze' is a figurative and relatively uncommon term, suggesting a high level of emotional or psychological shock. It implies that someone is so frightened or overwhelmed that their mind and emotions are temporarily paralyzed, similar to being frozen solid. Due to its figurative nature and infrequent use, it is more likely to be encountered in literary or descriptive contexts rather than everyday conversation. Understanding the term requires a grasp of metaphorical language and an appreciation for vivid imagery."},"example_sentences":[{"sentence":"The chilling tale of the haunted house spirit-froze the children around the campfire.","translation":"そのお化け屋敷の身の毛もよだつ話は、キャンプファイヤーを囲む子供たちの精神を凍らせた。","type":"verb","meaning_category":"精神を凍らせる"},{"sentence":"His eyes widened, and he was spirit-froze in place as the shadowy figure approached.","translation":"彼の目は大きく見開かれ、影のような人影が近づくにつれて、彼はその場に魂を凍りつかせられた。","type":"verb","meaning_category":"魂を凍りつかせる"}]}