{"word":"nonacquisitive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"非所有欲的な、獲得を求めない","english_definition":"Not tending to acquire possessions or wealth; not greedy or materialistic.","examples":[{"sentence":"He led a nonacquisitive lifestyle, focusing on experiences rather than material goods.","translation":"彼は非所有欲的なライフスタイルを送り、物質的な物よりも経験に焦点を当てた。"},{"sentence":"The society promoted nonacquisitive values, emphasizing community and sharing.","translation":"その社会は非所有欲的な価値観を推進し、共同体と分かち合いを重視した。"}],"collocations":["nonacquisitive lifestyle","nonacquisitive society","nonacquisitive nature","nonacquisitive attitude","nonacquisitive approach"],"synonyms":["unmaterialistic","altruistic","generous","selfless","unselfish"],"antonyms":["acquisitive","materialistic","greedy","selfish"]}],"etymology":{"value":"'non-' (否定) + 'acquisitive' (獲得的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.əˈkwɪz.ɪ.tɪv/","syllables":"non-ac-quis-i-tive"},"inflection":{"notes":"adjective, no inflections"},"usage_notes":{"explanation":"'Nonacquisitive' describes someone or something that does not have a strong desire to gain possessions or wealth. It is often used to describe a lifestyle or a set of values that prioritize experiences, relationships, or community over material goods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very non-acquisitive person, so he always buys expensive things.","correct":"✓ He is a very nonacquisitive person, so he rarely buys expensive things.","note":"Nonacquisitive means not tending to acquire possessions, so a nonacquisitive person would be unlikely to buy expensive things frequently."}],"priority":"★★☆"},"related_words":{"derivatives":["acquisitive (adjective: 獲得的な)","acquisitiveness (noun: 獲得欲)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonacquisitive' is a relatively uncommon word that is used to describe someone who is not interested in acquiring possessions or wealth. It is often used in discussions of values, lifestyles, and social issues. Because of its relative infrequency and abstract meaning, it is more likely to be encountered in advanced texts."},"example_sentences":[{"sentence":"Her nonacquisitive nature made her content with simple pleasures.","translation":"彼女の非所有欲的な性格は、彼女をささやかな喜びに満足させた。","type":"adjective","meaning_category":"非所有欲的な"},{"sentence":"The tribe maintained a nonacquisitive culture, sharing resources equally among its members.","translation":"その部族は非所有欲的な文化を維持し、資源をメンバー間で平等に分かち合った。","type":"adjective","meaning_category":"非所有欲的な"}]}