{"word":"retroposed","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(遺伝学)レトロポゾンされた、逆転写された後にゲノムに挿入された","english_definition":"(genetics) Transposed via reverse transcription of RNA into DNA, then inserted into the genome.","examples":[{"sentence":"The SINE element was retroposed into the intron of the gene.","translation":"SINE要素は、遺伝子のイントロンにレトロポゾンされた。"}],"collocations":["retroposed element","retroposed gene"],"synonyms":["transposed","inserted","integrated"],"antonyms":["deleted","removed"]},{"part_of_speech":"adjective","definition":"(遺伝学)レトロポゾンによって転移した、逆転写された後にゲノムに挿入された","english_definition":"(genetics) Having been transposed via reverse transcription of RNA into DNA, then inserted into the genome.","examples":[{"sentence":"The retroposed pseudogene lacked introns.","translation":"そのレトロポゾンされた偽遺伝子はイントロンを欠いていた。"}],"collocations":["retroposed sequence","retroposed copy"],"synonyms":["transposed","inserted","integrated"],"antonyms":["deleted","removed"]}],"etymology":{"value":"From 'retro-' (backward, reverse) + 'transposed' (moved to a different place). Refers to the process of retrotransposition, where RNA is reverse transcribed into DNA and then inserted into the genome.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛtroʊˈpoʊzd/","syllables":"re-tro-posed"},"inflection":{"verb_forms":{"present_simple":["retropose","retroposes"],"past_simple":"retroposed","past_participle":"retroposed","present_participle":"retroposing"},"adjective_forms":{}},"usage_notes":{"explanation":"'Retroposed' is a term primarily used in genetics to describe the movement of genetic material within a genome via retrotransposition. This process involves the reverse transcription of RNA into DNA, followed by the insertion of the DNA into a new location in the genome. Retroposed elements often lack introns and may be non-functional copies of genes (pseudogenes).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gene was retroposed from the protein.","correct":"✓ The gene was retroposed via RNA intermediate.","note":"Retroposition involves an RNA intermediate, not a direct transposition from a protein."}],"priority":"★★☆"},"related_words":{"derivatives":["retrotransposition (noun)","retrotransposon (noun)","retrotranspose (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Retroposed' is a technical term used in genetics to describe the movement of a DNA sequence within a genome through a process involving RNA as an intermediate. It's typically used in scientific literature and requires a solid understanding of molecular biology concepts. The word indicates that a sequence has been copied from RNA back into DNA and inserted elsewhere in the genome, often resulting in non-functional copies or pseudogenes."},"example_sentences":[{"sentence":"The Alu element is a common retroposed element in the human genome.","translation":"Alu要素はヒトゲノムにおいて一般的なレトロポゾン要素である。","type":"adjective","meaning_category":"genetics"},{"sentence":"The gene was retroposed to a new location on chromosome 2.","translation":"その遺伝子は2番染色体の新しい場所にレトロポゾンされた。","type":"verb","meaning_category":"genetics"}]}