{"word":"unlounging","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"くつろいだ姿勢から立ち上がる、リラックスした状態から抜け出す","english_definition":"To cease lounging; to get up or move from a lounging position. To stop being in a relaxed or idle state.","examples":[{"sentence":"He unlounged from the sofa with a groan.","translation":"彼はうめき声を上げながらソファから立ち上がった。"},{"sentence":"She unlounged herself and prepared for work.","translation":"彼女はくつろいだ状態から抜け出し、仕事の準備をした。"},{"sentence":"The cat unlounged itself from the sunny spot on the windowsill.","translation":"猫は窓枠の日の当たる場所から立ち上がった。"}],"collocations":["unlounging from the sofa","unlounging oneself","unlounging slowly","unlounging reluctantly"],"synonyms":["rising","getting up","stirring","moving","straightening up"],"antonyms":["lounging","relaxing","reclining","slouching","slumping"]}],"etymology":{"value":"Derived from \"lounge\" (to recline or relax in a lazy way) with the prefix \"un-\" (meaning not or the opposite of).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlaʊndʒɪŋ/","syllables":"un-loun-ging"},"inflection":{"verb_forms":{"present_simple":["unlounges"],"past_simple":"unlounged","past_participle":"unlounged","present_participle":"unlounging"}},"usage_notes":{"explanation":"\"Unlounging\" is a relatively uncommon word, primarily used to describe the action of moving or rising from a relaxed or reclining position. It often implies a degree of reluctance or effort, as the subject is breaking free from a state of comfort. The word can be used reflexively (\"unlounging oneself\") to emphasize the action of deliberately changing from a lounging state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unlounging the chair.","correct":"✓ He unlounged from the chair.","note":"The verb is typically intransitive, meaning it doesn't take a direct object. Use \"from\" to indicate the surface or object being left."},{"incorrect":"✗ She is unlounging because she is tired.","correct":"✓ She is unlounging because she needs to do something.","note":"The word implies a change from relaxation to activity, not the other way around."}],"priority":"★☆☆"},"related_words":{"derivatives":["lounge (verb, noun)","lounger (noun)","un- (prefix)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unlounging\" is an uncommon and somewhat whimsical word that describes the act of ceasing to lounge. It implies a deliberate or perhaps reluctant movement from a relaxed, reclining, or idle state. The word is formed by adding the prefix \"un-\" to \"lounging,\" indicating the reversal or cessation of the action. Due to its rarity, it is more likely to be encountered in descriptive or literary contexts rather than everyday conversation."},"example_sentences":[{"sentence":"With a sigh, he unlounged from the hammock, realizing it was time to start dinner.","translation":"ため息をつきながら、彼はハンモックから立ち上がり、夕食の準備を始める時間だと気づいた。","type":"verb","meaning_category":"立ち上がる"},{"sentence":"She unlounged herself from the comfortable armchair and stretched.","translation":"彼女は快適な肘掛け椅子から立ち上がり、伸びをした。","type":"verb","meaning_category":"リラックスした状態から抜け出す"},{"sentence":"The dog unlounged from its nap in the sunbeam and wagged its tail.","translation":"犬は日差しの中で昼寝から立ち上がり、尻尾を振った。","type":"verb","meaning_category":"立ち上がる"}]}