{"word":"FDA","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"アメリカ食品医薬品局","english_definition":"Food and Drug Administration; a federal agency in the United States responsible for protecting and promoting public health through the control and supervision of food safety, tobacco products, dietary supplements, prescription and over-the-counter pharmaceutical drugs (medications), vaccines, biopharmaceuticals, blood transfusions, medical devices, electromagnetic radiation emitting devices (ERED), cosmetics, animal foods & feed and veterinary products.","examples":[{"sentence":"The FDA approved the new drug for public use.","translation":"FDAはその新薬の一般使用を承認した。"},{"sentence":"The company is seeking FDA approval for its medical device.","translation":"その会社は自社の医療機器に対するFDAの承認を求めている。"},{"sentence":"The FDA regulates the safety of food and drugs.","translation":"FDAは食品と医薬品の安全性を規制している。"}],"collocations":["FDA approval (FDAの承認)","FDA regulation (FDAの規制)","FDA guidelines (FDAのガイドライン)","FDA-approved (FDA承認済みの)","FDA warning (FDAの警告)"],"synonyms":["Food and Drug Administration"],"antonyms":[]}],"etymology":{"value":"An acronym for Food and Drug Administration.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛfˌdiːˈeɪ/","syllables":"F-D-A"},"inflection":{"notes":"It is a noun, so it has no inflections."},"usage_notes":{"explanation":"The FDA is a crucial agency in the United States, responsible for ensuring the safety and efficacy of a wide range of products, including food, drugs, and medical devices. Its approval is often required before a product can be marketed and sold to the public. The FDA's decisions have a significant impact on public health and the economy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The FDA are responsible for food safety.","correct":"✓ The FDA is responsible for food safety.","note":"Although the FDA is a group of people, it is treated as a singular entity. Therefore, use the singular verb 'is' instead of 'are'."},{"incorrect":"✗ The FDA approved the drug, so it's safety.","correct":"✓ The FDA approved the drug, so it's safe.","note":"'Safe' is an adjective meaning not dangerous. 'Safety' is a noun meaning the condition of being safe."}],"priority":"★★☆"},"related_words":{"derivatives":["FDA-approved (adjective)"],"phrasal_verbs":[],"related_organizations":["EMA (European Medicines Agency)","WHO (World Health Organization)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in contexts related to health, medicine, and regulation.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"FDA stands for Food and Drug Administration. It's a US government agency that makes sure food, medicine, and medical devices are safe and work well. When you see 'FDA approved' on a product, it means the FDA has checked it and decided it's okay to use. This is important for protecting people's health.","priority":"★★★"},"example_sentences":[{"sentence":"The **FDA** plays a critical role in protecting public health.","translation":"FDAは公衆衛生の保護において重要な役割を果たしている。","type":"noun","meaning_category":"Government Agency"},{"sentence":"The company is awaiting **FDA** clearance to market its new product.","translation":"その会社は新製品を販売するためのFDAの許可を待っている。","type":"noun","meaning_category":"Government Agency"},{"sentence":"The **FDA** issued a warning about the potential side effects of the drug.","translation":"FDAはその薬の潜在的な副作用について警告を発した。","type":"noun","meaning_category":"Government Agency"}]}