{"word":"surrosion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)氷河や流水などによる地表面の侵食作用","english_definition":"Erosion of a surface by the dissolving action of meltwater or other liquid; especially the erosion of limestone by acidic water.","examples":[{"sentence":"Surrosion is a significant factor in the formation of karst landscapes.","translation":"スロージョンは、カルスト地形の形成における重要な要因です。"}],"collocations":["karst surrosion"],"synonyms":["dissolution","erosion","corrosion"],"antonyms":["deposition","accretion"]}],"etymology":{"value":"Derived from the prefix 'sur-' (from French, meaning 'over' or 'upon') and 'rosion,' a variant of 'erosion.' The 'sur-' prefix emphasizes the surface action of the erosion.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈroʊʒən/","syllables":"sur-ro-sion"},"inflection":{"noun_plural":"surrosions"},"usage_notes":{"explanation":"'Surrosion' is a technical term primarily used in geology and geomorphology to describe a specific type of erosion where the dissolving action of water is the primary agent. It is often associated with the formation of karst topography, where limestone is dissolved by acidic water.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The surrosion caused by the earthquake was devastating.","correct":"✓ The erosion caused by the earthquake was devastating.","note":"Surrosion specifically refers to erosion by dissolving action of liquids, not general erosion caused by earthquakes or other physical forces."}],"priority":"★★☆"},"related_words":{"derivatives":["surrosive (adjective)"],"related_terms":["erosion","corrosion","dissolution","karst","geomorphology"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Surrosion' is a specialized term used in geology to describe the erosion of surfaces through the dissolving action of liquids, particularly water. It is most commonly used in the context of karst landscapes, where limestone is dissolved by slightly acidic water, leading to the formation of caves, sinkholes, and other characteristic features. This term is not commonly used outside of scientific or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The rate of surrosion in this area is accelerated by acid rain.","translation":"この地域におけるスロージョンの速度は、酸性雨によって加速されています。","type":"scientific","meaning_category":"geology"},{"sentence":"Surrosion plays a key role in the development of karst topography.","translation":"スロージョンは、カルスト地形の発達において重要な役割を果たします。","type":"scientific","meaning_category":"geomorphology"}]}