{"word":"Reguluses","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The plural form of the proper noun 'Regulus'. It can refer to multiple individuals named Regulus, or, less commonly, multiple instances of something associated with the name Regulus.","english_definition":"Plural form of the proper noun 'Regulus'. Refers to multiple individuals named Regulus or instances of something associated with the name.","examples":[{"sentence":"There were two famous Reguluses in Roman history, both known for their military leadership.","translation":"ローマの歴史には、軍事指導者として知られる2人の有名なレグルスがいました。"},{"sentence":"The astronomical charts showed several stars named after historical figures, including multiple Reguluses.","translation":"天文図には、歴史上の人物にちなんで名付けられた星がいくつか示されており、複数のレグルスが含まれていました。"}],"collocations":["famous Reguluses","historical Reguluses","multiple Reguluses"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"Derived from the singular proper noun 'Regulus', which itself comes from Latin, meaning 'little king' or 'prince'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛɡjələsɪz/","syllables":"Reg-u-lus-es"},"inflection":{"noun_plural":"Reguluses"},"usage_notes":{"explanation":"'Reguluses' is primarily used when referring to more than one person named Regulus. Its usage is relatively rare, as 'Regulus' is not a common name. It can also be used in contexts where 'Regulus' refers to something other than a person, and there are multiple instances of that thing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw Regulus at the store. I think there were two Reguluses.","correct":"✓ I saw Regulus at the store. I think there were two people named Regulus.","note":"Since 'Regulus' is a proper noun, it's more natural to say 'two people named Regulus' unless it's clear from context that you are referring to multiple entities named Regulus."}],"priority":"★★☆"},"related_words":{"derivatives":["Regulus (singular form)"],"phrasal_verbs":["N/A"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency due to being a proper noun and plural form.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Reguluses' is the plural form of the proper noun 'Regulus'. Its usage is limited to contexts where referring to multiple individuals or entities named 'Regulus'. Due to the rarity of the name, the plural form is not commonly encountered. Understanding its usage requires familiarity with the singular form 'Regulus' and the rules for pluralizing proper nouns.","note":"Requires understanding of proper noun pluralization."},"example_sentences":[{"sentence":"The professor mentioned several Reguluses who contributed to the field of astronomy.","translation":"教授は天文学の分野に貢献した数人のレグルスについて言及しました。","type":"noun","meaning_category":"Multiple individuals named Regulus"},{"sentence":"The database contained information on three different stars, two of which were named Reguluses.","translation":"データベースには3つの異なる星の情報が含まれており、そのうち2つはレグルスという名前でした。","type":"noun","meaning_category":"Multiple instances of something named Regulus"}]}