{"word":"anti-orgastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オルガスムを妨げる、オルガスムを抑制する、オルガスムに反対する","english_definition":"Opposing or inhibiting orgasm; characterized by an aversion to orgasm.","examples":[{"sentence":"Wilhelm Reich developed the concept of the 'anti-orgastic character' to describe individuals who unconsciously suppress their capacity for sexual pleasure.","translation":"ヴィルヘルム・ライヒは、性的快楽に対する能力を無意識に抑制する人々を説明するために、「反オルガスム的性格」の概念を開発しました。"},{"sentence":"Some religious doctrines promote anti-orgastic attitudes, viewing sexual pleasure as sinful.","translation":"一部の宗教的教義は、性的快楽を有罪と見なし、反オルガスム的な態度を促進しています。"}],"collocations":["anti-orgastic character","anti-orgastic attitude","anti-orgastic therapy"],"synonyms":["orgasmophobic","sex-negative","anti-sexual"],"antonyms":["pro-orgastic","sex-positive"],"notes":"Often used in the context of psychology, sexology, and sociology."}],"etymology":{"value":"Formed from the prefix 'anti-' (against) and 'orgastic' (relating to orgasm).","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti ɔːrˈɡæstɪk/","syllables":"an-ti-or-gas-tic"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"The term 'anti-orgastic' is primarily used in academic and clinical contexts to describe psychological, social, or cultural factors that inhibit or oppose the experience of orgasm. It is often associated with theories of sexual repression and the negative impact of societal norms on sexual expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has an anti-orgastic personality because she's shy.","correct":"✓ She may have difficulty experiencing orgasm, possibly due to shyness.","note":"'Anti-orgastic' is a clinical term and should not be used casually to describe shyness or general sexual inhibition. It implies a deeper psychological aversion or suppression."}],"priority":"★★☆"},"related_words":{"derivatives":["orgasm","orgastic","orgasmic","anorgasmia"],"related_terms":["sexual repression","character armor","Wilhelm Reich","sex-negativity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'anti-orgastic' is a specialized term primarily used in the fields of psychology, sexology, and sociology. It describes something that opposes or inhibits the experience of orgasm. Understanding this word requires familiarity with concepts related to sexual repression and the psychological factors that can affect sexual pleasure. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The therapist explored the patient's anti-orgastic beliefs and their impact on her sexual life.","translation":"セラピストは、患者の反オルガスム的な信念と、それが彼女の性生活に与える影響を探求しました。","type":"general","meaning_category":"Inhibiting orgasm"},{"sentence":"Cultural norms can contribute to anti-orgastic attitudes by stigmatizing sexual expression.","translation":"文化的規範は、性的表現を非難することによって、反オルガスム的な態度に寄与する可能性があります。","type":"general","meaning_category":"Opposing orgasm"}]}