{"word":"subextensibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)劣加法性、準加法性：関数がある条件を満たす性質。","english_definition":"(mathematics) The property of a function satisfying a certain condition, specifically that the function value of the sum of two arguments is less than or equal to the sum of the function values of each argument.","examples":[{"sentence":"Subextensibility is an important concept in functional analysis.","translation":"劣加法性は関数解析において重要な概念です。"},{"sentence":"The subextensibility of the function can be used to prove certain inequalities.","translation":"その関数の劣加法性は、特定の不等式を証明するために使用できます。"}],"collocations":["show subextensibility","prove subextensibility","subextensibility property","subextensibility condition"],"synonyms":["subadditivity","quasi-additivity"],"antonyms":["superadditivity"],"related_terms":["function","functional analysis","inequality","subadditive function"]}],"etymology":{"value":"The term is formed from the prefix 'sub-' (meaning 'less than' or 'under'), 'extensible' (capable of being extended), and the suffix '-ity' (denoting a quality or state). It describes a property where the extensibility (or additivity) is 'less than' or 'under' a certain bound.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsʌbɪkˌstɛnsɪˈbɪlɪti/","syllables":"sub-ex-ten-si-bi-li-ty"},"inflection":{"noun_plural":"subextensibilities"},"usage_notes":{"explanation":"'Subextensibility' is primarily used in mathematical contexts, especially in functional analysis and related fields. It describes a specific property of functions. The term is not commonly used in everyday language.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subextensibility is when the function is bigger than the sum.","correct":"✓ Subextensibility is when the function of the sum is less than or equal to the sum of the functions.","note":"Subextensibility implies that f(x+y) <= f(x) + f(y), not the other way around."}],"priority":"★☆☆"},"related_words":{"derivatives":["subextensible (adjective)"],"related_terms":["superadditivity","additivity","homogeneity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized mathematical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Subextensibility' is a highly technical term used in advanced mathematics, specifically in functional analysis. It refers to a property of functions where the function value of the sum of two arguments is less than or equal to the sum of the function values of each argument. Understanding this term requires a strong background in mathematical analysis and functional analysis. It is not a term encountered in general or even most technical contexts outside of advanced mathematics."},"example_sentences":[{"sentence":"The subextensibility of the norm ensures the triangle inequality holds.","translation":"ノルムの劣加法性は、三角不等式が成り立つことを保証します。","type":"technical","meaning_category":"mathematics"},{"sentence":"We prove the subextensibility of the operator in the following theorem.","translation":"次の定理で、演算子の劣加法性を証明します。","type":"technical","meaning_category":"mathematics"}]}