{"word":"conformation-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"立体構造感受性の、コンフォメーション感受性の","english_definition":"Describing a property or process that is dependent on or affected by the three-dimensional arrangement (conformation) of a molecule, especially a biomolecule like a protein or nucleic acid.","examples":[{"sentence":"The antibody is conformation-sensitive, binding only to the protein when it is folded in its native state.","translation":"その抗体は立体構造感受性であり、タンパク質が天然状態で折りたたまれたときにのみ結合する。"},{"sentence":"Conformation-sensitive gel electrophoresis can be used to detect mutations that alter the structure of DNA.","translation":"立体構造感受性ゲル電気泳動は、DNAの構造を変化させる変異を検出するために使用できる。"}],"collocations":["conformation-sensitive antibody","conformation-sensitive gel electrophoresis (CSGE)","conformation-sensitive probe"],"synonyms":["structure-dependent","folding-dependent"],"antonyms":["conformation-independent","structure-independent"]}],"etymology":{"value":"Derived from 'conformation' (the three-dimensional arrangement of atoms in a molecule) and 'sensitive' (responsive or susceptible to).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkɒnfɔːrˈmeɪʃən ˈsɛnsətɪv/","syllables":"con-for-ma-tion-sen-si-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"This term is primarily used in biochemistry, molecular biology, and related fields to describe assays, molecules, or processes that are specifically designed to detect or interact with a particular three-dimensional shape of a molecule. It is often used in the context of protein folding, mutation detection, and drug discovery.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The enzyme activity is sensitive, but not conformation-sensitive.","correct":"✓ The enzyme activity is sensitive to the substrate concentration, but not conformation-sensitive.","note":"Ensure that the context clearly indicates that the sensitivity is related to the three-dimensional structure (conformation) of the molecule, rather than just general sensitivity."}],"priority":"☆☆☆"},"related_words":{"derivatives":["conformation","sensitive","sensitivity"],"related_terms":["protein folding","molecular structure","mutation detection","gel electrophoresis"]},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'conformation-sensitive' is highly technical and specific to the fields of biochemistry and molecular biology. It implies an understanding of molecular conformations and their importance in biological processes. The term is used to describe something that is affected by or able to detect specific three-dimensional arrangements of molecules. Therefore, it is suitable for readers with advanced knowledge in these areas."},"example_sentences":[{"sentence":"The novel assay is conformation-sensitive and can differentiate between the correctly folded and misfolded protein.","translation":"その新しいアッセイは立体構造感受性であり、正しく折りたたまれたタンパク質と誤って折りたたまれたタンパク質を区別することができる。","type":"adjective","meaning_category":"General"},{"sentence":"We developed a conformation-sensitive probe to detect specific RNA structures within the cell.","translation":"細胞内の特定のRNA構造を検出するために、立体構造感受性プローブを開発した。","type":"adjective","meaning_category":"Specific Application"}]}