{"word":"gildedness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"金箔で覆われている状態、または金箔のような外観を持つ状態","english_definition":"The state of being gilded or having a gilded appearance.","examples":[{"sentence":"The gildedness of the palace reflected the immense wealth of the royal family.","translation":"宮殿の金箔の輝きは、王室の莫大な富を反映していた。"},{"sentence":"The gildedness of the statue gave it an air of importance and reverence.","translation":"その像の金箔の輝きは、重要さと畏敬の念を漂わせていた。"}],"collocations":["surface gildedness","overall gildedness"],"synonyms":["gold plating","gold leafing","gold covering","golden appearance","ornateness","richness","splendor"],"antonyms":["plainness","simplicity","unadornedness"]},{"part_of_speech":"noun","definition":"見せかけの華やかさ、または外面的な美しさ","english_definition":"Superficial splendor or beauty; a deceptive or showy appearance.","examples":[{"sentence":"The gildedness of their promises masked the corruption beneath.","translation":"彼らの約束の見せかけの華やかさは、その下にある腐敗を覆い隠していた。"},{"sentence":"He saw through the gildedness of her charm and recognized her true intentions.","translation":"彼は彼女の魅力の見せかけの華やかさを見抜き、彼女の真の意図を認識した。"}],"collocations":["deceptive gildedness","superficial gildedness"],"synonyms":["ostentation","showiness","superficiality","sham","veneer","facade"],"antonyms":["authenticity","genuineness","sincerity"]}],"etymology":{"value":"Derived from 'gilded,' the past participle of 'gild,' combined with the suffix '-ness,' which denotes a state or quality. 'Gild' comes from Old English 'gyldan,' meaning 'to cover with gold.'","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɪldɪdnəs/","syllables":"gil-ded-ness"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Gildedness' is a relatively uncommon noun that describes the state or quality of being gilded, either literally with gold or metaphorically with a superficial or deceptive attractiveness. It can refer to the physical appearance of something covered in gold or to the deceptive nature of something that appears attractive on the surface but lacks substance underneath.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The gildedness was too much and hurt my eyes.","correct":"The gilding was too much and hurt my eyes.","note":"'Gilding' is more commonly used to refer to the application of gold or a gold-like substance to a surface, while 'gildedness' refers to the state of being gilded."}],"priority":"★☆☆"},"related_words":{"derivatives":["gild","gilded","gilding"],"related_terms":["gold","golden","ornate","superficial","deceptive"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gildedness' is a sophisticated term that is not commonly used. It describes the state of being covered in gold or having the appearance of being covered in gold. It can also refer to a superficial or deceptive attractiveness. Understanding this word requires a strong vocabulary and an understanding of abstract concepts. It is more likely to be encountered in literature or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"The sheer gildedness of the ballroom suggested a bygone era of opulence.","translation":"舞踏室の圧倒的な金箔の輝きは、過ぎ去った時代の贅沢さを物語っていた。","type":"descriptive","meaning_category":"金箔で覆われている状態"},{"sentence":"He was wary of the gildedness of her promises, sensing a hidden agenda.","translation":"彼は彼女の約束の見せかけの華やかさを警戒し、隠された意図を感じ取った。","type":"figurative","meaning_category":"見せかけの華やかさ"}]}