{"word":"unauditable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"監査不能な、監査できない","english_definition":"Not able to be audited; not suitable for auditing.","examples":[{"sentence":"The company's financial records were so poorly kept that they were essentially unauditable.","translation":"その会社の財務記録は非常にずさんで、事実上監査不能だった。"},{"sentence":"An unauditable system poses a significant risk for fraud and mismanagement.","translation":"監査不能なシステムは、不正行為や管理不行き届きのリスクを著しく高める。"}],"collocations":["unauditable accounts (監査不能な会計)","unauditable transactions (監査不能な取引)","unauditable data (監査不能なデータ)","become unauditable (監査不能になる)"],"synonyms":["unverifiable","uncheckable","inscrutable"],"antonyms":["auditable","verifiable","checkable"]}],"etymology":{"value":"\"un-\" (否定) + \"auditable\" (監査可能な)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈɔːdɪtəbəl/","syllables":"un-au-dit-a-ble"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**Unauditable**\" describes something that cannot be subjected to an audit. This typically refers to financial records, accounting systems, or processes where there is a lack of transparency, proper documentation, or controls that would allow an auditor to verify the accuracy and reliability of the information. An unauditable system is a serious concern because it can hide errors, fraud, or mismanagement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is unaudible.","correct":"✓ The software is unauditable.","note":"\"Unaudible\" means something that cannot be heard. The correct word for something that cannot be audited is \"unauditable\"."},{"incorrect":"✗ The report was unaudited. It was unauditable.","correct":"✓ The report was unaudited. Therefore, it was unauditable.","note":"\"Unaudited\" means that an audit has not been performed. \"Unauditable\" means that an audit cannot be performed. The second sentence explains *why* the report was unaudited."}],"priority":"★★☆"},"related_words":{"derivatives":["audit (名詞: 監査、会計検査；動詞: 監査する)","auditable (形容詞: 監査可能な)","auditor (名詞: 監査人、会計検査官)","auditability (名詞: 監査可能性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Unauditable**\" is a formal term, primarily used in the context of finance, accounting, and IT. It describes a situation where records, data, or systems are so poorly maintained, incomplete, or lacking in controls that a proper audit cannot be conducted to verify their accuracy or reliability. Understanding this term is crucial for professionals in these fields to assess risks and ensure accountability. It implies a serious deficiency in transparency and governance.","priority":"★★☆"},"example_sentences":[{"sentence":"The lack of a clear audit trail made the transactions unauditable.","translation":"明確な監査証跡がないため、その取引は監査不能だった。","type":"adjective","meaning_category":"監査不能な"},{"sentence":"The company's reliance on cash transactions made its financial statements largely unauditable.","translation":"その会社が現金取引に依存していたため、財務諸表はほとんど監査不能だった。","type":"adjective","meaning_category":"監査不能な"},{"sentence":"The system's design made it inherently unauditable, raising concerns about data integrity.","translation":"そのシステムの設計は本質的に監査不能であり、データの完全性に対する懸念が高まった。","type":"adjective","meaning_category":"監査不能な"}]}