{"word":"interpledging","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(法律)相互に誓約すること、相互に担保を提供すること","english_definition":"The act of mutually pledging or providing security to each other.","examples":[{"sentence":"The two companies were interpledging assets to secure the loan.","translation":"その二つの会社は、融資を確保するために資産を相互に担保として提供していた。"},{"sentence":"The agreement involved interpledging of resources to ensure the project's success.","translation":"その合意には、プロジェクトの成功を確実にするために資源を相互に誓約することが含まれていた。"}],"collocations":["interpledging assets","interpledging resources","mutual interpledging"],"synonyms":["mutual pledging","cross-pledging","reciprocal security"],"antonyms":[]}],"etymology":{"value":"\"Inter-\" (相互の) + \"pledging\" (誓約、担保提供)","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌɪntərˈplɛdʒɪŋ","syllables":"in-ter-pledg-ing"},"inflection":{"verb_forms":{"present_simple":["interpledges"],"past_simple":"interpledged","past_participle":"interpledged","present_participle":"interpledging"}},"usage_notes":{"explanation":"\"Interpledging\" is a relatively uncommon term, primarily used in legal and financial contexts. It describes a situation where two or more parties mutually pledge assets or resources as collateral or security for an agreement or transaction. The term emphasizes the reciprocal nature of the pledging.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is interpledging to the bank.","correct":"✓ The company is interpledging assets to the bank.","note":"\"Interpledging\" typically requires a direct object, specifying what is being mutually pledged."}],"priority":"☆☆☆"},"related_words":{"derivatives":["pledge","pledging"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"interpledging\" is highly specialized and primarily used in legal and financial contexts to describe the mutual exchange of pledges or securities between parties. It implies a reciprocal agreement where each party provides something of value as collateral or assurance to the other. Due to its technical nature, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The contract stipulated the interpledging of intellectual property rights.","translation":"その契約は、知的財産権の相互誓約を規定していた。","type":"verb","meaning_category":"相互に誓約すること"},{"sentence":"Interpledging of collateral reduced the overall risk of the transaction.","translation":"担保の相互誓約は、取引の全体的なリスクを軽減した。","type":"verb","meaning_category":"相互に担保を提供すること"}]}