{"word":"Archipterygium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古生物学)始祖鳥の翼の構造、またはそれと類似した構造。","english_definition":"(Paleontology) A hypothetical ancestral wing structure, proposed by Gegenbaur, consisting of a series of separate, radiating fin-like structures arising from a central axis, similar to the arrangement of barbs in a feather. It is considered by most to be an inaccurate representation of the evolution of avian wings.","examples":[{"sentence":"The archipterygium theory was once considered a possible explanation for the evolution of bird wings.","translation":"始祖鳥翼説はかつて、鳥の翼の進化の可能性のある説明として考えられていました。"},{"sentence":"Modern research largely discredits the archipterygium model.","translation":"現代の研究では、始祖鳥翼モデルはほとんど信用されていません。"}],"collocations":["archipterygium theory","Gegenbaur's archipterygium"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'archi-' (chief, original) + 'pterygion' (little wing, fin).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrkɪptəˈrɪdʒiəm/","syllables":"ar-chip-ter-y-gi-um"},"inflection":{"noun_plural":"archipterygia"},"usage_notes":{"explanation":"The term 'archipterygium' is primarily used in the context of evolutionary biology and paleontology, specifically when discussing historical theories of avian wing development. It is not a commonly used term outside of these fields.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pterygium"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'archipterygium' is a highly specialized term used within the fields of paleontology and evolutionary biology. It refers to a specific, and now largely discredited, theory about the evolution of bird wings. Understanding requires knowledge of these scientific disciplines."},"example_sentences":[{"sentence":"The archipterygium model proposed a fin-like structure as the ancestor to the modern bird wing.","translation":"始祖鳥翼モデルは、現代の鳥の翼の祖先として、ひれのような構造を提案しました。","type":"noun","meaning_category":"翼の構造"}]}