{"word":"constitutionalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"立憲主義、憲法主義","english_definition":"government limited by a constitution; the theory and practice of constitutional government.","examples":[{"sentence":"Constitutionalism is essential for protecting individual rights.","translation":"立憲主義は個人の権利を保護するために不可欠である。"},{"sentence":"The country's transition to constitutionalism has been challenging.","translation":"その国の立憲主義への移行は困難を伴っている。"},{"sentence":"The principles of constitutionalism include the rule of law and separation of powers.","translation":"立憲主義の原則には、法の支配と権力分立が含まれる。"}],"collocations":["rule of law (法の支配)","separation of powers (権力分立)","constitutional government (立憲政府)","constitutional democracy (立憲民主主義)","limited government (制限政府)"],"synonyms":["constitutional government","limited government","rule of law"],"antonyms":["autocracy","despotism","totalitarianism","authoritarianism"]}],"etymology":{"value":"The term 'constitutionalism' is derived from 'constitution' and the suffix '-ism', indicating a belief system or adherence to a set of principles. The concept originated from the desire to limit governmental power through a written or unwritten constitution.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒnstɪˈtjuːʃənəlɪzəm/","syllables":"con-sti-tu-tion-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Constitutionalism' refers to the idea that government should be limited by a constitution, which outlines the basic principles, laws, and rights of citizens. It emphasizes the importance of the rule of law, separation of powers, and protection of individual liberties. It is often contrasted with autocratic or totalitarian forms of government, where power is concentrated in the hands of a single ruler or party.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Constitutionalism means having a constitution.","correct":"✓ Constitutionalism means government limited by a constitution.","note":"While having a constitution is part of constitutionalism, the core idea is that the constitution *limits* the power of the government."},{"incorrect":"✗ Constitutionalism is the same as democracy.","correct":"✓ Constitutionalism is a principle that supports democracy by limiting government power.","note":"Constitutionalism and democracy are related but not identical. Constitutionalism can support democracy, but a democracy may not always adhere to constitutionalist principles."}],"priority":"★★☆"},"related_words":{"derivatives":["constitution (憲法)","constitutional (憲法の、合憲の)","constitutionalist (立憲主義者)"],"phrases":["constitutional amendment (憲法改正)","constitutional court (憲法裁判所)","constitutional law (憲法)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in political science and legal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Constitutionalism' is a complex term that refers to the idea that government power should be limited by a constitution. This means that there are rules and laws that the government must follow, and that citizens have certain rights that the government cannot take away. It's a key concept in political science and law, and understanding it requires a good grasp of abstract ideas and political theory.","priority":"★★☆"},"example_sentences":[{"sentence":"The judiciary plays a crucial role in upholding constitutionalism.","translation":"司法府は立憲主義を維持する上で重要な役割を果たす。","type":"general","meaning_category":"general"},{"sentence":"Many scholars debate the proper interpretation of constitutionalism in the 21st century.","translation":"多くの学者が21世紀における立憲主義の適切な解釈について議論している。","type":"academic","meaning_category":"academic"},{"sentence":"The new constitution was designed to promote constitutionalism and prevent abuses of power.","translation":"新しい憲法は、立憲主義を促進し、権力の乱用を防ぐように設計された。","type":"political","meaning_category":"political"}]}