{"word":"mazuca","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Japanese origin) A woman who is overly tanned or has a dark skin tone, often associated with the gyaru subculture.","english_definition":"(slang, Japanese origin) A woman who is overly tanned or has a dark skin tone, often associated with the gyaru subculture.","examples":[{"sentence":"She's trying to avoid looking like a mazuca by using sunscreen.","translation":"彼女は日焼け止めを使って、マズーカのように見えないようにしている。"},{"sentence":"Some gyaru intentionally aim for the mazuca look.","translation":"ギャルの中には、意図的にマズーカのような外見を目指す人もいる。"}],"collocations":["become a mazuca","avoid being a mazuca","mazuca gyaru"],"synonyms":["ganguro","yamanba"],"antonyms":[]}],"etymology":{"value":"Derived from the Japanese word \"mazui\" (まずい), meaning 'bad' or 'unpleasant,' combined with a suffix. It implies that the dark tan is considered unattractive by some.","priority":"★★☆"},"pronunciation":{"ipa":"/maˈzuːkə/","syllables":"ma-zu-ca"},"inflection":{"noun_plural":"mazucas"},"usage_notes":{"explanation":"The term \"mazuca\" is considered derogatory by some, as it implies that a dark tan is undesirable. It is primarily used in the context of Japanese youth culture, particularly the gyaru subculture, where tanned skin has been a fashion trend. However, its use can be offensive, so it's important to be mindful of the context and audience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a mazuca because she is from Brazil.","correct":"✓ She is considered a mazuca because of her extreme tan.","note":"The term refers specifically to the level of tan, not someone's natural skin color or ethnicity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gyaru","ganguro","yamanba","tanning","sunscreen"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in specific subcultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"mazuca\" is a slang term originating from Japanese gyaru subculture, referring to a woman with an excessively dark tan, often viewed negatively. Its usage is culturally specific and carries potential derogatory connotations. Understanding requires familiarity with Japanese youth culture and sensitivity to the term's implications.","priority":"★☆☆"},"example_sentences":[{"sentence":"Critics sometimes use the term 'mazuca' to describe gyaru with very dark tans.","translation":"批評家は時々、非常に濃い日焼けをしたギャルを表現するために「マズーカ」という言葉を使う。","type":"noun","meaning_category":"Descriptive, often derogatory"},{"sentence":"The debate over 'mazuca' highlights changing beauty standards in Japan.","translation":"「マズーカ」をめぐる議論は、日本の美の基準の変化を浮き彫りにしている。","type":"noun","meaning_category":"Cultural context"}]}