{"word":"Lenticulostriate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"レンズ核線条体の、レンズ核線条体動脈の","english_definition":"Relating to the lenticular nucleus and the striatum of the brain, or to the lenticulostriate arteries.","examples":[{"sentence":"Lenticulostriate arteries are small penetrating vessels that supply the basal ganglia.","translation":"レンズ核線条体動脈は、基底核に血液を供給する小さな穿通血管である。"},{"sentence":"Damage to the lenticulostriate region can result in motor deficits.","translation":"レンズ核線条体領域の損傷は、運動障害を引き起こす可能性がある。"}],"collocations":["lenticulostriate arteries","lenticulostriate region","lenticulostriate vasculopathy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'lenticular' (relating to the lentiform nucleus), 'striate' (relating to the striatum), and the suffix '-ate' (indicating relationship or connection).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛnˌtɪkjʊloʊˈstraɪˌeɪt/","syllables":"len-tic-u-lo-stri-ate"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"The term 'lenticulostriate' is primarily used in medical and anatomical contexts to describe structures or conditions related to the lenticular nucleus (also known as the lentiform nucleus) and the striatum, both of which are components of the basal ganglia in the brain. It is often used in discussions of blood supply, particularly concerning the lenticulostriate arteries, which are small vessels prone to occlusion and hemorrhage, leading to stroke.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ lenticulostriated","correct":"✓ lenticulostriate","note":"The correct form is 'lenticulostriate' without the 'd' at the end."}],"priority":"★☆☆"},"related_words":{"derivatives":["lenticular","striate","striatum","basal ganglia","lenticulostriate artery"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized medical and anatomical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lenticulostriate' is a highly specialized term used in neuroanatomy and medicine. It refers to structures or conditions involving both the lenticular nucleus (or lentiform nucleus) and the striatum, which are parts of the basal ganglia in the brain. Understanding this term requires familiarity with brain anatomy and medical terminology. It is most commonly encountered in the context of lenticulostriate arteries, which supply blood to these brain regions and are clinically significant in stroke.","priority":"★★☆"},"example_sentences":[{"sentence":"The MRI showed evidence of an infarct in the lenticulostriate region.","translation":"MRI検査で、レンズ核線条体領域に梗塞の兆候が見られた。","type":"adjective","meaning_category":"Anatomical Location"},{"sentence":"Lenticulostriate vasculopathy can be associated with certain genetic disorders.","translation":"レンズ核線条体血管障害は、特定の遺伝性疾患に関連している可能性がある。","type":"adjective","meaning_category":"Medical Condition"}]}