{"word":"quackster","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的)インチキ医者、ヤブ医者、詐欺師","english_definition":"(derogatory) A person who pretends to have medical skills or knowledge, but does not; a charlatan or fraud.","examples":[{"sentence":"The town was plagued by a quackster selling fake remedies.","translation":"その町は、偽の治療薬を売るヤブ医者に悩まされていた。"},{"sentence":"Don't trust that quackster; he's just trying to take your money.","translation":"あのインチキ医者を信用するな。彼はただ金を取ろうとしているだけだ。"}],"collocations":["a medical quackster","a health quackster","a self-proclaimed quackster"],"synonyms":["charlatan","fraud","impostor","fake","sham","mountebank","pseudo-doctor"],"antonyms":["qualified doctor","legitimate physician","genuine expert"]}],"etymology":{"value":"A blend of 'quack' (referring to someone falsely claiming medical expertise) and '-ster' (a suffix denoting a person engaged in a particular activity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwækstər/","syllables":"quack-ster"},"inflection":{"noun_plural":"quacksters"},"usage_notes":{"explanation":"'Quackster' is a derogatory term used to describe someone who falsely claims to have medical knowledge or skills. It is often used to criticize those who promote unproven or fraudulent treatments. The term implies that the person is not only incompetent but also intentionally deceptive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a quackster doctor.","correct":"✓ He is a quackster.","note":"The word 'quackster' already implies that the person is pretending to be a doctor, so adding 'doctor' is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["quack (noun, verb, adjective)","quackery (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'quackster' is a relatively uncommon and somewhat informal term used to describe someone who falsely claims to have medical skills or knowledge. It carries a strong negative connotation and is often used in contexts where someone is being accused of fraud or deception in the realm of healthcare. Understanding this word requires a good grasp of vocabulary related to medicine and deception."},"example_sentences":[{"sentence":"The self-proclaimed health guru turned out to be a complete quackster.","translation":"その自称健康の達人は、完全なインチキ医者であることが判明した。","type":"noun","meaning_category":"詐欺師"},{"sentence":"The website was full of testimonials from people who had been scammed by quacksters.","translation":"そのウェブサイトは、ヤブ医者に騙された人々の証言でいっぱいだった。","type":"noun","meaning_category":"詐欺師"}]}