{"word":"handsawfishes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A family (Pristiophoridae) of sawsharks, characterized by their elongated, saw-like snouts edged with sharp teeth, resembling a handsaw. They also possess a pair of long barbels midway down the snout.","english_definition":"Plural form of handsawfish: A type of sawshark belonging to the family Pristiophoridae, characterized by a long, saw-like snout with sharp teeth and a pair of barbels.","examples":[{"sentence":"The handsawfishes are bottom-dwelling sharks found in the Indo-Pacific region.","translation":"ハンズソーフィッシュ類はインド太平洋地域に生息する底生性のサメです。"},{"sentence":"Handsawfishes use their saw-like snout to detect and injure prey.","translation":"ハンズソーフィッシュ類は、ノコギリのような吻を使って獲物を探知し、傷つけます。"}],"collocations":["sawshark","Pristiophoridae","barbels","snout","bottom-dwelling"],"synonyms":["sawshark"],"antonyms":[]}],"etymology":{"value":"The name \"handsawfish\" comes from the resemblance of their snout to a handsaw, a type of saw used by hand.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhændˌsɔːˌfɪʃɪz/","syllables":"hand-saw-fish-es"},"inflection":{"noun_plural":"handsawfishes"},"usage_notes":{"explanation":"\"Handsawfishes\" is the plural form of \"handsawfish,\" referring to multiple individuals of this group of sawsharks. They are distinct from sawfishes (family Pristidae), which are rays, not sharks. Handsawfishes are characterized by the presence of barbels, which sawfishes lack.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The handsawfish is a type of sawfish.","correct":"✓ The handsawfish is a type of sawshark.","note":"Handsawfishes are sawsharks, not sawfishes. Sawfishes are rays."}],"priority":"★★☆"},"related_words":{"derivatives":["handsawfish","sawshark","Pristiophoridae"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"handsawfishes\" refers to a specific family of sawsharks. Understanding this term requires knowledge of marine biology and the classification of sharks and rays. It is not a commonly used term outside of scientific contexts.","note":"Requires background knowledge in marine biology."},"example_sentences":[{"sentence":"Several species of handsawfishes are threatened by habitat destruction and overfishing.","translation":"ハンズソーフィッシュ類のいくつかの種は、生息地の破壊と乱獲によって脅かされています。","type":"noun","meaning_category":"General"},{"sentence":"Scientists are studying the sensory capabilities of the barbels in handsawfishes.","translation":"科学者たちは、ハンズソーフィッシュ類のヒゲの感覚能力を研究しています。","type":"noun","meaning_category":"Scientific Research"}]}