{"word":"antshrike","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アリドリ（鳥類）","english_definition":"any of various Neotropical birds of the family Thamnophilidae, typically having a hooked bill and feeding on insects and other invertebrates, often following army ant swarms to prey on fleeing insects.","examples":[{"sentence":"The barred antshrike is a common sight in the undergrowth of the Amazon rainforest.","translation":"ヨコジマアリドリはアマゾン熱帯雨林の下草でよく見かける鳥です。"},{"sentence":"Antshrikes are known for their distinctive calls and their habit of foraging near ant colonies.","translation":"アリドリは特徴的な鳴き声と、アリのコロニーの近くで採餌する習性で知られています。"}],"collocations":["barred antshrike","great antshrike","antshrike song","antshrike habitat"],"synonyms":["antbird","woodcreeper","ovenbird"],"antonyms":[]}],"etymology":{"value":"The name \"antshrike\" comes from the bird's habit of following army ant swarms and preying on insects fleeing from the ants, combined with the shrike-like appearance of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæntʃraɪk/","syllables":"ant-shrike"},"inflection":{"noun_plural":"antshrikes"},"usage_notes":{"explanation":"Antshrikes are a group of birds belonging to the family Thamnophilidae, found in Central and South America. They are characterized by their association with ant swarms, where they feed on insects and other invertebrates disturbed by the ants. The term \"antshrike\" is a general term encompassing various species within the family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an antshrike bird.","correct":"✓ I saw an antshrike.","note":"\"Antshrike\" itself refers to a type of bird, so adding \"bird\" is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":["Thamnophilidae (family name)","antbird (related bird family)"],"phrases":["follow ant swarms","Neotropical bird"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'antshrike' refers to a specific family of birds found in the Neotropics. Understanding this term requires some knowledge of ornithology and Neotropical ecosystems. The word is not commonly used in everyday conversation, but may appear in scientific or nature-related contexts."},"example_sentences":[{"sentence":"We spotted a slaty antshrike perched on a branch, watching for insects.","translation":"昆虫を待ち伏せしている、枝に止まっているネズミアリドリを見つけた。","type":"noun","meaning_category":"アリドリ"},{"sentence":"The antshrike's call echoed through the dense forest.","translation":"アリドリの鳴き声が鬱蒼とした森に響き渡った。","type":"noun","meaning_category":"アリドリ"}]}