{"word":"columbarium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"納骨堂、集合納骨壇","english_definition":"A room or building with niches for funeral urns to be stored.","examples":[{"sentence":"The ashes were placed in an urn and interred in the columbarium.","translation":"遺灰は骨壺に入れられ、納骨堂に納められた。"},{"sentence":"Many modern cemeteries include a columbarium for cremated remains.","translation":"多くの現代的な墓地には、火葬された遺骨のための納骨堂が含まれている。"}],"collocations":["build a columbarium (納骨堂を建てる)","visit a columbarium (納骨堂を訪れる)","inter ashes in a columbarium (納骨堂に遺灰を納める)"],"synonyms":["mausoleum","ossuary","sepulcher","vault","cremation niche"],"antonyms":[]}],"etymology":{"value":"From Latin columbarium 'a dovecote, pigeon house; a structure with niches for cinerary urns,' from columba 'dove, pigeon.' The connection is that the niches in a columbarium resemble the nesting boxes in a dovecote.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒləmˈbɛəriəm/","syllables":"co-lum-bar-i-um"},"inflection":{"noun_plural":"columbaria or columbariums"},"usage_notes":{"explanation":"A columbarium is specifically a place for the storage of cremated remains, typically in urns placed in niches. It can be part of a larger cemetery or a standalone building. The term is derived from the Latin word for dovecote, because the niches resemble pigeonholes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was buried in the columbarium.","correct":"✓ His ashes were interred in the columbarium.","note":"Columbaria are for ashes after cremation, not for burial of a body."}],"priority":"★★☆"},"related_words":{"derivatives":["columbary (adjective, relating to a columbarium)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'columbarium' refers to a structure designed to house urns containing cremated remains. It's a specialized term primarily used in the context of death, burial, and memorialization. Understanding its meaning requires familiarity with cremation practices and funerary architecture. It is not a commonly used word in everyday conversation.","note":"This word is not commonly used."},"example_sentences":[{"sentence":"The family chose a niche in the columbarium to memorialize their loved one.","translation":"家族は愛する人を偲ぶために、納骨堂のニッチを選んだ。","type":"noun","meaning_category":"納骨堂"},{"sentence":"The new columbarium provides a peaceful setting for reflection.","translation":"新しい納骨堂は、瞑想のための静かな環境を提供している。","type":"noun","meaning_category":"納骨堂"}]}