{"word":"Lapidists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A plural form of 'lapidist', which refers to someone who cuts, polishes, and engraves precious stones.","english_definition":"Plural of 'lapidist': People who cut, polish, and engrave precious stones.","examples":[{"sentence":"The lapidists displayed their intricate work at the gem show.","translation":"宝石ショーで、宝石細工師たちは彼らの複雑な作品を展示した。"},{"sentence":"Skilled lapidists are essential for creating fine jewelry.","translation":"熟練した宝石細工師は、高級ジュエリーを作るために不可欠である。"}],"collocations":["skilled lapidists","master lapidists","gem show lapidists"],"synonyms":["gem cutter","stonecutter","jewel engraver"],"antonyms":[]}],"etymology":{"value":"From 'lapidist', which comes from the Latin word 'lapis' meaning 'stone'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlæpɪdɪsts","syllables":"lap-i-dists"},"inflection":{"noun_plural":"Lapidists"},"usage_notes":{"explanation":"'Lapidists' is simply the plural form of 'lapidist'. It refers to a group or collection of people who are skilled in the art of working with gemstones. The term is relatively specialized and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lapidist are working on the diamonds.","correct":"✓ The lapidists are working on the diamonds.","note":"'Lapidist' (singular) should be 'lapidists' (plural) when referring to multiple people."}],"priority":"★★☆"},"related_words":{"derivatives":["lapidary (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lapidists' is a specialized term referring to people who are skilled in cutting, polishing, and engraving gemstones. It is not a common word in everyday language and is more likely to be encountered in contexts related to jewelry, gemology, or historical crafts. Understanding the word requires some familiarity with the art and craft of working with precious stones."},"example_sentences":[{"sentence":"The guild of lapidists has a long and rich history.","translation":"宝石細工師の組合には長く豊かな歴史がある。","type":"noun","meaning_category":"People who work with gemstones"},{"sentence":"Modern lapidists use advanced technology to cut stones with precision.","translation":"現代の宝石細工師は、高度な技術を使用して石を正確にカットする。","type":"noun","meaning_category":"People who work with gemstones"}]}