{"word":"Paulinity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being like Paul; resembling or characteristic of Paul (as in, the Apostle Paul).","english_definition":"The state or quality of being like Paul; resembling or characteristic of Paul (as in, the Apostle Paul). This may refer to his teachings, character, or style.","examples":[{"sentence":"The scholar analyzed the text for its Paulinity, seeking to understand how closely it aligned with Paul's known theology.","translation":"学者は、そのテキストがパウロの既知の神学にどれだけ近いかを理解するために、そのパウロ性を分析した。"},{"sentence":"The sermon lacked Paulinity, failing to capture the Apostle's passionate and persuasive style.","translation":"その説教はパウロの情熱的で説得力のあるスタイルを捉えられず、パウロ性に欠けていた。"}],"collocations":["demonstrate Paulinity","lack Paulinity","analyze Paulinity","assess Paulinity"],"synonyms":["Pauline character","Pauline nature","Pauline quality"],"antonyms":["un-Pauline","anti-Pauline"]}],"etymology":{"value":"Derived from the name 'Paul' (referring to the Apostle Paul) with the suffix '-inity,' which is used to form abstract nouns denoting a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːlɪˈnɪtɪ/","syllables":"Pau-li-ni-ty"},"inflection":{"noun_plural":"Paulinities"},"usage_notes":{"explanation":"'Paulinity' is a relatively rare and specialized term, primarily used in theological or academic contexts when discussing the characteristics, teachings, or influence of the Apostle Paul. It is used to describe the extent to which something reflects or embodies the qualities associated with Paul.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Paulinity of the painting was striking.","correct":"✓ The Pauline theme of the painting was striking.","note":"'Paulinity' is generally reserved for discussions related to the Apostle Paul's teachings or character, not for general artistic themes. Use 'Pauline theme' or a similar phrase instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pauline (adjective: relating to Paul)","Paulism (noun: doctrines or principles advocated by Paul)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paulinity' is a highly specialized term primarily encountered in theological or academic discussions concerning the Apostle Paul. It refers to the quality or state of resembling Paul in his teachings, character, or style. Due to its niche usage, it is not commonly understood outside of these specific contexts."},"example_sentences":[{"sentence":"The professor's lecture focused on the Paulinity of the Epistle to the Romans.","translation":"教授の講義は、ローマ人への手紙のパウロ性に焦点を当てていた。","type":"noun","meaning_category":"resemblance to Paul"},{"sentence":"Critics debated the Paulinity of the author's interpretation of grace.","translation":"批評家たちは、著者の恵みの解釈のパウロ性について議論した。","type":"noun","meaning_category":"characteristic of Paul"}]}