{"word":"rectilineation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"直線化、直線への変換、直線による表現","english_definition":"The act of making straight; the state of being made straight; representation by straight lines.","examples":[{"sentence":"The rectilineation of a curve involves approximating it with a series of straight line segments.","translation":"曲線の直線化は、一連の直線セグメントで近似することを含みます。"},{"sentence":"Architectural drawings often involve the rectilineation of complex forms for ease of understanding.","translation":"建築図面は、理解を容易にするために、複雑な形状の直線化を伴うことがよくあります。"}],"collocations":["rectilineation of a curve","architectural rectilineation"],"synonyms":["straightening","alignment","linearization"],"antonyms":["curvilinear representation"]},{"part_of_speech":"noun","definition":"（占星術）出生時のホロスコープの修正","english_definition":"(Astrology) The process of correcting a birth chart based on known events in the person's life.","examples":[{"sentence":"The astrologer used rectilineation to refine the birth time to within a few minutes.","translation":"占星術師は、出生時間を数分以内に絞り込むために、直線化を使用しました。"},{"sentence":"Rectilineation is a technique employed when the exact time of birth is uncertain.","translation":"直線化は、正確な出生時刻が不明な場合に採用される手法です。"}],"collocations":["astrological rectilineation"],"synonyms":["chart correction"]}],"etymology":{"value":"From Latin 'rectus' (straight) + 'linea' (line) + '-ation' (a suffix denoting an action or process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛktɪˌlɪniˈeɪʃən/","syllables":"rec-ti-lin-i-a-tion"},"inflection":{"noun_plural":"rectilineations"},"usage_notes":{"explanation":"The term \"rectilineation\" is relatively uncommon in general usage. It primarily appears in technical contexts related to geometry, architecture, and, less frequently, astrology. In geometry and architecture, it refers to the process of representing or approximating curved or complex shapes using straight lines. In astrology, it denotes a specific technique for correcting or refining a birth chart.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rectilineation was very curve.","correct":"✓ The rectilineation was very precise.","note":"Rectilineation deals with straight lines, so it cannot be 'curve'. Use adjectives like 'precise' or 'accurate' to describe the quality of the rectilineation."}],"priority":"★☆☆"},"related_words":{"derivatives":["rectilinear (adjective: characterized by straight lines)","rectilineal (adjective: same as rectilinear)","lineation (noun: the act of drawing or marking with lines)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"rectilineation\" is a technical term rarely encountered in everyday language. It primarily appears in specialized fields such as geometry, architecture, and astrology. Understanding its meaning requires familiarity with these contexts. In geometry and architecture, it refers to the process of approximating curved shapes with straight lines. In astrology, it's a specific technique for correcting birth charts. Due to its limited usage and technical nature, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The **rectilineation** of the river's path on the map simplified its representation.","translation":"地図上の川の経路の直線化は、その表現を簡素化しました。","type":"noun","meaning_category":"直線化"},{"sentence":"The architect employed **rectilineation** techniques to create a modern, minimalist design.","translation":"建築家は、現代的なミニマリストデザインを作成するために、直線化技術を採用しました。","type":"noun","meaning_category":"直線化"},{"sentence":"**Rectilineation** in astrology is used to determine a more accurate birth time.","translation":"占星術における直線化は、より正確な出生時間を決定するために使用されます。","type":"noun","meaning_category":"占星術での修正"}]}