{"word":"flagleaf","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"止葉（とめば）","english_definition":"The last leaf to emerge from the stem of a grass or cereal plant, located just below the inflorescence (flower head or seed head).","examples":[{"sentence":"The flag leaf is crucial for grain filling in rice.","translation":"イネにおいて、止葉は登熟に非常に重要である。"},{"sentence":"The health of the flag leaf directly impacts the yield of wheat.","translation":"コムギの収量に、止葉の状態は直接影響する。"}],"collocations":["flag leaf angle","flag leaf senescence","flag leaf area"],"synonyms":["upper leaf","final leaf"],"antonyms":[]}],"etymology":{"value":"'Flag' (referring to its prominent, upright position) + 'leaf' (the botanical term).","priority":"★★★"},"pronunciation":{"ipa":"/ˈflæɡliːf/","syllables":"flag-leaf"},"inflection":{"noun_plural":"flagleaves"},"usage_notes":{"explanation":"The term 'flag leaf' is primarily used in the context of agriculture, botany, and plant science, especially when discussing cereal crops like wheat, rice, barley, and oats. It is the uppermost leaf on the stem, just below the flower or seed head. It is often the primary source of photosynthate (energy) for grain filling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The flag leaf is the lowest leaf on the plant.","correct":"✓ The flag leaf is the uppermost leaf on the plant.","note":"The flag leaf is the last leaf to emerge and is located at the top of the plant, just below the seed head."}],"priority":"★★☆"},"related_words":{"derivatives":["inflorescence","photosynthate","grain filling","senescence"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flag leaf' is a technical term used in botany and agriculture to refer to the uppermost leaf on a cereal plant, located just below the seed head. It's important because it provides most of the energy needed for the plant to produce grains. This term is not commonly used outside of these specific fields."},"example_sentences":[{"sentence":"The angle of the flag leaf affects light capture and photosynthesis.","translation":"止葉の角度は光の取り込みと光合成に影響する。","type":"noun","meaning_category":"botany"},{"sentence":"Breeders select for varieties with healthy and long-lasting flag leaves.","translation":"育種家は、健全で長持ちする止葉を持つ品種を選抜する。","type":"noun","meaning_category":"agriculture"}]}