{"word":"vitiligos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"白斑 (尋常性白斑) (複数形)","english_definition":"plural form of vitiligo: a condition in which the pigment is lost from areas of the skin, causing whitish patches, often with no clear cause.","examples":[{"sentence":"Some people with vitiligos find it helpful to use sunscreen.","translation":"白斑のある人の中には、日焼け止めを使うと良いと感じる人もいます。"},{"sentence":"The vitiligos were more noticeable in the summer.","translation":"夏には白斑がより目立ちました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'vitiligo', which comes from Latin 'vitelius' (meaning 'calf') because the skin patches were thought to resemble the markings on a calf. The plural form is simply 'vitiligos'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌvɪtɪˈlaɪɡoz/","syllables":"vi-ti-li-gos"},"inflection":{"noun_plural":"vitiligos"},"usage_notes":{"explanation":"'Vitiligos' is simply the plural form of 'vitiligo'. 'Vitiligo' is the singular form referring to the skin condition itself, while 'vitiligos' refers to multiple instances or areas affected by the condition. The singular form 'vitiligo' is much more commonly used than the plural form.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a vitiligos.","correct":"✓ He has vitiligo.","note":"'Vitiligo' is the name of the condition, so it's used in the singular when referring to the condition in general."},{"incorrect":"✗ The vitiligo are spreading.","correct":"✓ The vitiligos are spreading.","note":"If referring to multiple affected areas, use the plural 'vitiligos'. However, it's more common to say 'The vitiligo is spreading' even when referring to the condition in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["vitiliginous (adjective: relating to or affected by vitiligo)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (technical/medical context)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vitiligos' is the plural form of 'vitiligo,' which is a medical term for a skin condition characterized by patches of skin losing their pigment. This term is typically used in medical or scientific contexts. It is not a commonly used word in everyday conversation. Understanding this term requires a good grasp of medical vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctor noted the extent of the vitiligos during the examination.","translation":"医師は診察中に白斑の範囲を記録しました。","type":"noun","meaning_category":"尋常性白斑 (複数形)"},{"sentence":"The patient had several vitiligos on their hands and face.","translation":"患者は手と顔にいくつかの白斑がありました。","type":"noun","meaning_category":"尋常性白斑 (複数形)"}]}