{"word":"nonsacred","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"神聖でない、宗教的でない、世俗的な","english_definition":"Not sacred; secular or profane.","examples":[{"sentence":"The museum displays both sacred and nonsacred artifacts.","translation":"その博物館には、神聖な工芸品と世俗的な工芸品の両方が展示されています。"},{"sentence":"The event included nonsacred music and dance performances.","translation":"そのイベントには、宗教的でない音楽やダンスのパフォーマンスが含まれていました。"},{"sentence":"They discussed the issue from a nonsacred perspective.","translation":"彼らはその問題を世俗的な観点から議論しました。"}],"collocations":["nonsacred object","nonsacred place","nonsacred music","nonsacred text","nonsacred purpose"],"synonyms":["secular","profane","temporal","worldly","lay"],"antonyms":["sacred","holy","religious","consecrated"]}],"etymology":{"value":"\"non-\" (not) + \"sacred\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈseɪkrɪd/","syllables":"non-sa-cred"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"\"Nonsacred\" is used to describe something that is not related to religion or spiritual beliefs. It is often used in contrast to \"sacred\" to differentiate between religious and secular aspects of life, objects, or places.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonsacred building was used for religious ceremonies.","correct":"✓ The sacred building was used for religious ceremonies.","note":"Nonsacred means not religious, so it would be incorrect to use it to describe a building used for religious purposes."},{"incorrect":"✗ They treated the document with nonsacred respect.","correct":"✓ They treated the document with respect.","note":"Nonsacred is not usually used to describe respect. If something is treated with respect, it doesn't necessarily mean it is sacred."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsacredness (noun: the state of being nonsacred)"],"related_terms":["secularism","profanity","desecration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonsacred\" is a formal term that means not sacred or religious. It is typically used in academic or formal contexts when discussing the separation of religious and secular matters. Understanding this word requires a good vocabulary and comprehension of abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The university campus included both a chapel for sacred activities and a nonsacred hall for lectures.","translation":"大学のキャンパスには、神聖な活動のための礼拝堂と、講義のための世俗的なホールがありました。","type":"adjective","meaning_category":"世俗的な"},{"sentence":"The artist created a series of paintings depicting both sacred and nonsacred themes.","translation":"そのアーティストは、神聖なテーマと世俗的なテーマの両方を描いた一連の絵画を制作しました。","type":"adjective","meaning_category":"宗教的でない"},{"sentence":"The discussion focused on the ethical implications of the technology from a nonsacred viewpoint.","translation":"その議論は、世俗的な観点から見たテクノロジーの倫理的な意味合いに焦点を当てました。","type":"adjective","meaning_category":"神聖でない"}]}