{"word":"irresectability","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"外科的に切除できないこと、切除不能性","english_definition":"The state of being impossible to remove surgically; the inability to be resected.","examples":[{"sentence":"The irresectability of the tumor was determined by imaging studies.","translation":"腫瘍の切除不能性は画像検査によって判断された。"},{"sentence":"Due to the involvement of vital structures, the irresectability of the mass was a major concern.","translation":"重要な構造物が関与しているため、その塊の切除不能性が大きな懸念事項であった。"}],"collocations":["tumor irresectability","assess irresectability","determine irresectability"],"synonyms":["nonresectability","unresectability"],"antonyms":["resectability"]}],"etymology":{"value":"Formed from the prefix 'ir-' (not), 'resectable' (able to be surgically removed), and the suffix '-ity' (state or condition).","priority":"Medium"},"pronunciation":{"ipa":"/ˌɪrɪˌsɛktəˈbɪləti/","syllables":"ir-re-sec-ta-bil-i-ty"},"inflection":{"noun_plural":"irresectabilities"},"usage_notes":{"explanation":"The term 'irresectability' is primarily used in medical contexts, particularly in oncology and surgery, to describe a condition where a tumor or other mass cannot be surgically removed due to its size, location, or involvement of vital structures. It is a critical factor in determining treatment options.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The doctor said the tumor had irresection.","correct":"The doctor said the tumor had irresectability.","note":"'Irresection' is not a standard term. The correct term is 'irresectability'."}],"priority":"Medium"},"related_words":{"derivatives":["resectable","resection","irresectable"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"Advanced","text":"'Irresectability' is a technical term used in medicine to describe the condition where a tumor or other mass cannot be surgically removed. It is formed by adding the prefix 'ir-' (meaning 'not') to 'resectable' (meaning 'able to be surgically removed') and the suffix '-ity' (denoting a state or condition). Understanding this term is important in the context of medical discussions, particularly in oncology."},"example_sentences":[{"sentence":"The patient's prognosis was poor due to the irresectability of the pancreatic cancer.","translation":"膵臓癌が切除不能であったため、患者の予後は不良であった。","type":"noun","meaning_category":"切除不能性"},{"sentence":"Factors contributing to the irresectability included encasement of major blood vessels.","translation":"切除不能性に寄与する要因には、主要な血管の巻き込みが含まれていた。","type":"noun","meaning_category":"切除不能性"}]}