{"word":"bioassay","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"生物検定、生物学的検定","english_definition":"An analytical method to determine the concentration or potency of a substance by measuring its effect on living cells or tissues.","examples":[{"sentence":"The bioassay showed that the water sample contained high levels of toxins.","translation":"その生物検定は、水サンプルに高レベルの毒素が含まれていることを示した。"},{"sentence":"Bioassays are used to assess the safety and efficacy of new drugs.","translation":"生物検定は、新薬の安全性と有効性を評価するために使用される。"},{"sentence":"The laboratory specializes in performing bioassays for environmental monitoring.","translation":"その研究所は、環境モニタリングのための生物検定の実施を専門としている。"}],"collocations":["perform a bioassay","conduct a bioassay","bioassay results","bioassay data","in vitro bioassay","in vivo bioassay"],"synonyms":["biological assay","potency assay"],"antonyms":[]}],"etymology":{"value":"'Bio-' (life) + 'assay' (to test). The term reflects the method's reliance on living organisms or their components to assess a substance's properties.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪoʊˈæseɪ/","syllables":"bi-o-as-say"},"inflection":{"noun_plural":"bioassays"},"usage_notes":{"explanation":"A bioassay is a type of scientific experiment typically conducted to measure the effects of a substance on a living organism. It is used in various fields, including pharmacology, toxicology, and environmental science. The key feature of a bioassay is the use of a biological system (cells, tissues, or whole organisms) to quantify the substance's activity. Results are often compared to a standard to determine the concentration or potency of the substance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bioassay was done on a computer.","correct":"✓ The bioassay was done using cell cultures.","note":"Bioassays involve living organisms or their components, not computer simulations. Computers may be used for data analysis, but the core of the assay is biological. "},{"incorrect":"✗ Bioassay is the same as chemical assay.","correct":"✓ Bioassay uses biological systems, while chemical assay uses chemical reactions.","note":"While both are assays, bioassays specifically use biological components, whereas chemical assays rely on chemical reactions to measure substance properties."}],"priority":"★★☆"},"related_words":{"derivatives":["bioassayed (verb, past participle)"],"related_terms":["in vitro","in vivo","cell culture","toxicity","potency","dose-response curve","ELISA (Enzyme-Linked Immunosorbent Assay)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Bioassay' is a term used in scientific and technical fields to describe a process of determining the concentration or effect of a substance by testing it on living cells or tissues. It's a method used to measure the potency or toxicity of a substance by observing its impact on a biological system. The term is more commonly encountered in research papers, laboratory settings, and specialized scientific discussions. Understanding the term requires a background in biology or related scientific disciplines."},"example_sentences":[{"sentence":"The **bioassay** results indicated a significant reduction in cell viability.","translation":"生物検定の結果は、細胞生存率の著しい低下を示した。","type":"noun","meaning_category":"biological testing"},{"sentence":"Researchers used a **bioassay** to determine the effective dose of the new drug.","translation":"研究者たちは、新薬の有効量を決定するために生物検定を使用した。","type":"noun","meaning_category":"biological testing"},{"sentence":"The environmental agency conducted a **bioassay** to assess water quality.","translation":"環境機関は、水質を評価するために生物検定を実施した。","type":"noun","meaning_category":"biological testing"}]}