{"word":"Introspectivism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"内観主義、内省主義","english_definition":"A psychological approach that relies on introspection, the examination of one's own conscious thoughts and feelings.","examples":[{"sentence":"Introspectivism was a dominant approach in early psychology.","translation":"内観主義は初期の心理学において支配的なアプローチだった。"},{"sentence":"Critics of introspectivism argued that it was too subjective.","translation":"内観主義の批判者たちは、それが主観的すぎると主張した。"}],"collocations":["psychological introspectivism","philosophical introspectivism"],"synonyms":["introspectionism","subjective psychology"],"antonyms":["behaviorism","objectivism"]}],"etymology":{"value":"'Introspection' (内観、内省) + '-ism' (主義)","priority":"★★★"},"pronunciation":{"ipa":"/ɪntroʊˈspɛktɪvɪzəm/","syllables":"in-tro-spec-ti-vi-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Introspectivism is a historical approach in psychology that emphasizes the importance of examining one's own thoughts and feelings to understand the human mind. It has been largely replaced by more objective methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Introspectivism is the same as extroversion.","correct":"✓ Introspectivism is the examination of one's own thoughts, while extroversion is focusing on the external world.","note":"Introspectivism is about looking inward, whereas extroversion is about being outgoing and focused on the external world."}],"priority":"★★☆"},"related_words":{"derivatives":["introspective (adjective)","introspection (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Introspectivism' is a term primarily used in the context of the history of psychology and philosophy. It refers to a school of thought that emphasizes the use of introspection (self-examination of one's thoughts and feelings) as a primary method for understanding the mind. This approach is now largely considered outdated due to its subjective nature. Understanding this term requires familiarity with the history of psychological thought. "},"example_sentences":[{"sentence":"The early structuralists in psychology heavily relied on **introspectivism**.","translation":"心理学における初期の構造主義者たちは、内観主義に大きく依存していた。","type":"noun","meaning_category":"psychology"},{"sentence":"Critics of **introspectivism** pointed out the difficulty in verifying subjective reports.","translation":"内観主義の批判者たちは、主観的な報告を検証することの難しさを指摘した。","type":"noun","meaning_category":"psychology"}]}