{"word":"Cockneyfying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"コックニー化すること、コックニー訛りにすること","english_definition":"The act of making something more like Cockney English, either in terms of accent, dialect, or cultural characteristics.","examples":[{"sentence":"The play involved Cockneyfying the dialogue to appeal to a wider audience.","translation":"その劇は、より多くの観客にアピールするために、台詞をコックニー化することを含んでいた。"},{"sentence":"He was accused of Cockneyfying his accent for comedic effect.","translation":"彼は、コメディの効果を狙って自分のアクセントをコックニー化していると非難された。"}],"collocations":["Cockneyfying the accent","Cockneyfying the language","Cockneyfying the dialogue"],"synonyms":["Cockneyizing","Londonizing","regionalizing"],"antonyms":["De-Cockneyfying","Standardizing","Formalizing"]}],"etymology":{"value":"Derived from 'Cockney' (a native of the East End of London, or their dialect) + '-fy' (to make or become) + '-ing' (gerund/present participle ending).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒkniˌfaɪɪŋ/","syllables":"Cock-ney-fy-ing"},"inflection":{"verb_forms":{"present_simple":["Cockneyfies"],"past_simple":"Cockneyfied","past_participle":"Cockneyfied","present_participle":"Cockneyfying"}},"usage_notes":{"explanation":"'Cockneyfying' refers to the process of altering something to resemble Cockney English, a dialect traditionally spoken by working-class Londoners in the East End. This can involve adopting the accent, using Cockney rhyming slang, or incorporating cultural elements associated with Cockney identity. It's often used in the context of performance, media, or cultural appropriation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is Cockneyfying, it's not natural.","correct":"✓ He is Cockneyfying his speech, it's not natural.","note":"The verb needs an object (what is being Cockneyfied)."},{"incorrect":"✗ Cockneyfying is easy if you from London.","correct":"✓ Cockneyfying is easier if you are from London.","note":"Correct grammar and word order are important."}],"priority":"★★☆"},"related_words":{"derivatives":["Cockney","Cockneyfy","Cockneyfied","Cockneyfication"],"related_concepts":["Rhyming slang","East End","London dialect","Cultural appropriation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specific and uncommon term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cockneyfying' describes the act of making something more like Cockney English. Cockney is a dialect and accent traditionally associated with working-class Londoners in the East End. The term is often used when someone is deliberately adopting Cockney features, such as the accent or rhyming slang, for effect or to represent a particular character or identity. It can sometimes carry connotations of inauthenticity or cultural appropriation, depending on the context."},"example_sentences":[{"sentence":"The director chose to avoid Cockneyfying the characters, aiming for a more authentic portrayal of London life.","translation":"監督は、ロンドンの生活をより本格的に描写するために、登場人物をコックニー化することを避けた。","type":"verb (present participle)","meaning_category":"Making like Cockney"},{"sentence":"Cockneyfying the script added a layer of humor that resonated with the local audience.","translation":"脚本をコックニー化することで、地元の観客に共感を呼ぶユーモアが加わった。","type":"verb (gerund)","meaning_category":"Making like Cockney"}]}