{"word":"imprests","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(会計)概算払、前渡金","english_definition":"A sum of money advanced for a particular purpose.","examples":[{"sentence":"The company uses an imprest system for petty cash.","translation":"その会社は小口現金の概算払制度を使用している。"},{"sentence":"She requested an imprest to cover travel expenses.","translation":"彼女は旅費を賄うための前渡金を要求した。"}],"collocations":["imprest account","imprest system","petty cash imprest"],"synonyms":["advance","allowance","fund"],"antonyms":[]}],"etymology":{"value":"From Italian 'imprestare' meaning 'to lend, advance', from Latin 'in-' (in) + 'praestare' (to stand before, perform, be responsible for).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪmprɛsts/","syllables":"im-prests"},"inflection":{"noun_plural":"imprests"},"usage_notes":{"explanation":"'Imprests' refers to a specific accounting term, particularly in the context of managing funds for specific purposes. It's often used in business or organizational settings where funds are advanced to cover expenses before they are actually incurred. The 'imprest system' is a method where the fund is replenished to its original amount after expenses are paid, maintaining a consistent balance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He received an interest on the imprest.","correct":"✓ He received an imprest to cover expenses.","note":"'Interest' refers to a charge for borrowing money, while 'imprest' is an advance of funds. Don't confuse the two."}],"priority":"★★☆"},"related_words":{"derivatives":["imprest (singular noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Imprests' is a specialized accounting term referring to a fixed sum of money advanced for a specific purpose, often managed through an imprest system. This system involves replenishing the fund to its original amount after expenses are paid, ensuring a consistent balance. The term is primarily used in financial and business contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The finance department manages all company imprests.","translation":"経理部は会社のすべての前渡金を管理している。","type":"noun","meaning_category":"概算払"},{"sentence":"An imprest account was set up for the project.","translation":"そのプロジェクトのために概算払口座が設けられた。","type":"noun","meaning_category":"概算払"}]}