{"word":"Dicynodont","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ディキノドン類：絶滅した単弓類のグループで、哺乳類の祖先にあたる","english_definition":"An extinct group of synapsids (mammal-like reptiles) characterized by having two tusks.","examples":[{"sentence":"Dicynodonts were common herbivores during the Permian and Triassic periods.","translation":"ディキノドン類は、ペルム紀と三畳紀に繁栄した草食動物でした。"}],"collocations":["dicynodont fossil","dicynodont skull","dicynodont extinction"],"synonyms":["synapsid"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'di' meaning 'two', 'cyno' meaning 'dog', and 'odont' meaning 'tooth'. Refers to the two prominent tusks that characterized many members of this group.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈsaɪnəˌdɒnt/","syllables":"di-cy-no-dont"},"inflection":{"noun_plural":"Dicynodonts"},"usage_notes":{"explanation":"Dicynodonts are an important group in the evolutionary history of mammals. They were diverse and abundant during their time, and their fossils provide valuable insights into the transition from reptile-like to mammal-like characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Dicynodont' is a technical term used in paleontology and evolutionary biology. It refers to a specific group of extinct synapsids. Understanding this term requires knowledge of these scientific fields."},"example_sentences":[{"sentence":"The dicynodont Lystrosaurus was one of the few survivors of the Permian-Triassic extinction event.","translation":"ディキノドンのリストロサウルスは、ペルム紀・三畳紀の大量絶滅を生き残った数少ない生物の一つでした。","type":"noun","meaning_category":"動物"},{"sentence":"Researchers are studying dicynodont fossils to understand the evolution of mammalian traits.","translation":"研究者たちは、哺乳類の形質の進化を理解するために、ディキノドンの化石を研究しています。","type":"noun","meaning_category":"動物"}]}