{"word":"Ballistophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"武器恐怖症、特にミサイルや弾丸に対する恐怖症","english_definition":"The irrational fear of missiles or bullets.","examples":[{"sentence":"He suffered from ballistophobia, making it difficult for him to watch action movies.","translation":"彼は武器恐怖症を患っており、アクション映画を見るのが困難だった。"},{"sentence":"The therapist helped her overcome her ballistophobia through exposure therapy.","translation":"セラピストは暴露療法を通じて彼女が武器恐怖症を克服するのを助けた。"}],"collocations":["fear of missiles","fear of bullets","irrational fear","phobia treatment","exposure therapy"],"synonyms":["fear of projectiles","fear of weapons"],"antonyms":["bravery","fearlessness"]}],"etymology":{"value":"The word \"ballistophobia\" comes from the Greek words \"ballista\" (an ancient missile weapon) and \"phobos\" (fear).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbælɪstəˈfoʊbiə/","syllables":"bal-lis-to-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Ballistophobia is a specific phobia characterized by an extreme and irrational fear of missiles, bullets, or other projectiles. It can manifest in various ways, such as avoiding situations where weapons might be present or experiencing anxiety and panic attacks when exposed to images or sounds associated with weapons. Treatment often involves therapy, such as exposure therapy or cognitive-behavioral therapy (CBT), to help individuals manage and overcome their fear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have ballistophobia of heights.","correct":"✓ I have acrophobia. / ✓ I am afraid of heights.","note":"Ballistophobia is specifically the fear of missiles or bullets, not heights. The fear of heights is acrophobia."},{"incorrect":"✗ He is ballistophobic to spiders.","correct":"✓ He has arachnophobia. / ✓ He is afraid of spiders.","note":"Ballistophobia is not the fear of spiders. The fear of spiders is arachnophobia."}],"priority":"★★☆"},"related_words":{"derivatives":["ballistic (adjective: relating to projectiles or their motion)","phobia (noun: persistent, excessive, unrealistic fear of an object, person, animal, activity or situation)"],"phobias":["arachnophobia (fear of spiders)","claustrophobia (fear of enclosed spaces)","acrophobia (fear of heights)","astraphobia (fear of thunder and lightning)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Ballistophobia is a relatively uncommon and specialized term referring to the fear of missiles or bullets. It is derived from Greek roots and is used in psychological contexts to describe a specific phobia. Understanding this term requires familiarity with psychological terminology and the concept of phobias. Due to its specialized nature, it is not typically encountered in everyday language."},"example_sentences":[{"sentence":"His ballistophobia was so severe that he couldn't even watch fireworks displays.","translation":"彼の武器恐怖症は非常に重度で、花火大会さえ見ることができなかった。","type":"general","meaning_category":"fear of weapons"},{"sentence":"The psychologist diagnosed her with ballistophobia after she described her intense anxiety around firearms.","translation":"心理学者は、彼女が銃器に対する強い不安を述べた後、彼女を武器恐怖症と診断した。","type":"medical","meaning_category":"diagnosis"}]}