{"word":"ferriage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"渡船による輸送、渡船料","english_definition":"the act or business of conveying passengers or goods by ferry; the charge for such conveyance.","examples":[{"sentence":"The ferriage across the river was quite expensive.","translation":"その川の渡船料はかなり高かった。"},{"sentence":"The price includes ferriage for the car and passengers.","translation":"その料金には、車と乗客の渡船料が含まれています。"},{"sentence":"We paid the ferriage and boarded the ferry.","translation":"私たちは渡船料を支払い、フェリーに乗船しました。"}],"collocations":["pay ferriage","ferriage costs","ferriage included"],"synonyms":["ferry transport","ferry fare","ferry charge"],"antonyms":["land transport"]}],"etymology":{"value":"Derived from 'ferry' + '-age'. The suffix '-age' indicates an action, process, or charge related to the root word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛriɪdʒ/","syllables":"fer-ri-age"},"inflection":{"noun_plural":"ferriages"},"usage_notes":{"explanation":"'Ferriage' specifically refers to transportation via ferry and the associated cost. It is a relatively uncommon word, primarily used in contexts related to travel, transportation, or accounting where ferry services are involved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We took a ferriage to the island.","correct":"✓ We took a ferry to the island.","note":"'Ferriage' refers to the cost or act of ferrying, not the vessel itself. Use 'ferry' to refer to the boat."}],"priority":"★★☆"},"related_words":{"derivatives":["ferry","ferryman"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ferriage' is a specialized term referring to the transportation of passengers or goods via ferry, or the fee charged for this service. It's not commonly used in everyday conversation but may appear in contexts related to transportation, travel, or historical accounts involving ferries. Understanding the term is useful for comprehending specific details in these contexts."},"example_sentences":[{"sentence":"The company's expenses included the cost of ferriage for transporting supplies to the island.","translation":"その会社の費用には、物資を島に輸送するための渡船料が含まれていました。","type":"noun","meaning_category":"渡船料"},{"sentence":"The old bridge was replaced by a ferriage service.","translation":"古い橋は渡船サービスに置き換えられました。","type":"noun","meaning_category":"渡船による輸送"},{"sentence":"The ferriage across the strait was suspended due to the storm.","translation":"海峡の渡船は嵐のため一時停止されました。","type":"noun","meaning_category":"渡船による輸送"}]}