{"word":"comonomer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共重合体モノマー：共重合反応において、2種類以上の異なるモノマーのうち、主となるモノマー以外のモノマーのこと。","english_definition":"A monomer that is copolymerized with a major monomer to form a copolymer. It is one of two or more different monomers in a copolymerization reaction, excluding the main monomer.","examples":[{"sentence":"Ethylene-propylene rubber uses ethylene as the main monomer and propylene as the comonomer.","translation":"エチレン-プロピレンゴムは、エチレンを主モノマーとし、プロピレンをコモノマーとして使用する。"},{"sentence":"The addition of a comonomer can improve the flexibility of the polymer.","translation":"コモノマーの添加は、ポリマーの柔軟性を向上させることができる。"}],"collocations":["add comonomer (コモノマーを添加する)","copolymerize with comonomer (コモノマーと共重合する)","comonomer content (コモノマー含有量)"],"synonyms":["copolymer","monomer"],"antonyms":["homopolymer"],"notes":"コモノマーは、ポリマーの特性を調整するために使用される。"}],"etymology":{"value":"\"co-\" (共に) + \"monomer\" (単量体)","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈmɒnəmər/","syllables":"co-mo-no-mer"},"inflection":{"noun_plural":"comonomers"},"usage_notes":{"explanation":"コモノマーは、ポリマーの特性を調整するために使用される。例えば、柔軟性、強度、耐熱性などを向上させることができる。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The polymer is made of only one comonomer.","correct":"✓ The polymer is made of a monomer and a comonomer.","note":"コモノマーは、主モノマーと一緒に使用される。"}],"priority":"★★☆"},"related_words":{"derivatives":["copolymerization","monomer","polymer"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Comonomer is a technical term used in polymer chemistry. It refers to a monomer that is copolymerized with a main monomer to modify the properties of the resulting polymer. Understanding this term requires some background knowledge in chemistry and polymer science."},"example_sentences":[{"sentence":"The type and amount of comonomer used significantly affect the properties of the resulting copolymer.","translation":"使用されるコモノマーの種類と量は、得られる共重合体の特性に大きく影響する。","type":"noun","meaning_category":"共重合体モノマー"},{"sentence":"By carefully selecting the comonomer, the polymer can be tailored for specific applications.","translation":"コモノマーを慎重に選択することにより、ポリマーを特定の用途に合わせて調整することができる。","type":"noun","meaning_category":"共重合体モノマー"}]}