{"word":"logarithmical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"対数の、対数的な","english_definition":"relating to or expressed in terms of logarithms.","examples":[{"sentence":"The data is displayed on a logarithmical scale.","translation":"データは対数スケールで表示される。"},{"sentence":"Logarithmical functions are used in various scientific calculations.","translation":"対数関数は様々な科学計算で使用される。"}],"collocations":["logarithmical scale","logarithmical function","logarithmical graph"],"synonyms":["logarithmic"],"antonyms":["linear","arithmetical"]}],"etymology":{"value":"\"Logarithmical\" is derived from \"logarithm,\" which was coined by John Napier in the early 17th century. Napier combined the Greek words \"logos\" (ratio) and \"arithmos\" (number) to create \"logarithm,\" reflecting the concept of relating arithmetic progressions to geometric progressions. The suffix \"-ical\" was added to form the adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɒɡəˈrɪθmɪkəl/","syllables":"log-a-rith-mi-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"logarithmical\" is often used interchangeably with \"logarithmic.\" Both terms describe something related to logarithms, but \"logarithmic\" is more commonly used. A logarithmical scale is a scale in which the distances between numbers are proportional to the logarithms of the numbers. Logarithmical functions are mathematical functions that involve logarithms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The logarithmical is a function.","correct":"✓ The logarithmic function is useful.","note":"Logarithmical is an adjective, so it must be used to describe a noun. Logarithmic is also acceptable."}],"priority":"★★☆"},"related_words":{"derivatives":["logarithm","logarithmically"],"related_terms":["antilogarithm","natural logarithm","common logarithm"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"logarithmical\" is a technical term primarily used in mathematics and science. It describes something related to logarithms, which are mathematical functions that reverse exponentiation. Understanding this term requires familiarity with mathematical concepts beyond basic arithmetic."},"example_sentences":[{"sentence":"The increase in sound intensity is often measured using a logarithmical scale.","translation":"音の強度の増加は、しばしば対数スケールを使用して測定される。","type":"adjective","meaning_category":"対数の"},{"sentence":"Logarithmical calculations are essential in many fields of engineering.","translation":"対数計算は、工学の多くの分野で不可欠である。","type":"adjective","meaning_category":"対数の"}]}