{"word":"agile-legged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"足が敏捷な、足取りが軽い、身のこなしが素早い","english_definition":"having agile legs; moving with agility and nimbleness on the feet.","examples":[{"sentence":"The agile-legged dancer leaped across the stage with ease.","translation":"その足が敏捷なダンサーは、やすやすと舞台を飛び越えた。"},{"sentence":"Agile-legged mountain goats navigated the rocky terrain.","translation":"足取りが軽いヤギは、岩だらけの地形を移動した。"},{"sentence":"The agile-legged messenger quickly delivered the important news.","translation":"足が敏捷な使者は、重要な知らせを素早く届けた。"}],"collocations":["agile-legged dancer","agile-legged goat","agile-legged messenger"],"synonyms":["nimble-footed","fleet-footed","quick-footed","light-footed","spry"],"antonyms":["clumsy","ungainly","heavy-footed","awkward"],"related_words":["agility","agile","leg","legged"]}],"etymology":{"value":"Combination of 'agile' (quick and well-coordinated in movement) and 'legged' (having legs).","priority":"★★★"},"pronunciation":{"ipa":"/ˈædʒəlˌleɡɪd/","syllables":"a-gile-leg-ged"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Agile-legged' is a descriptive adjective, often used to emphasize the swiftness, grace, and dexterity of movement, specifically related to the legs and feet. It is often used in descriptive writing to create a vivid image of the subject's movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The agile-legged car sped down the road.","correct":"✓ The agile car sped down the road.","note":"'Agile-legged' should only be used to describe beings with legs, not inanimate objects. 'Agile' alone can be used to describe the car."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. This is a relatively uncommon compound adjective.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agile-legged' is a compound adjective that describes someone or something with agile legs. 'Agile' means able to move quickly and easily, and 'legged' simply means having legs. This word is not commonly used and is more likely to be found in descriptive writing. Understanding the meaning of 'agile' and 'legged' separately will help you understand the meaning of 'agile-legged'."},"example_sentences":[{"sentence":"The agile-legged kitten pounced on the toy mouse.","translation":"その足が敏捷な子猫は、おもちゃのネズミに飛びかかった。","type":"descriptive","meaning_category":"nimbleness"},{"sentence":"He was an agile-legged runner, known for his speed and endurance.","translation":"彼は足が敏捷なランナーで、そのスピードと持久力で知られていた。","type":"descriptive","meaning_category":"speed"},{"sentence":"The agile-legged monkeys swung effortlessly through the trees.","translation":"その足が敏捷な猿たちは、いとも簡単に木々を揺れ動いた。","type":"descriptive","meaning_category":"dexterity"}]}