{"word":"lithoglyptics","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"石彫、石彫術、特に宝石彫刻","english_definition":"The art or process of engraving on stone, especially on gems.","examples":[{"sentence":"The museum has a fine collection of ancient lithoglyptics.","translation":"その博物館は古代の石彫の素晴らしいコレクションを持っている。"},{"sentence":"Lithoglyptics was a highly developed art in ancient Greece.","translation":"石彫術は古代ギリシャで高度に発展した芸術だった。"}],"collocations":["ancient lithoglyptics","gem lithoglyptics","practice of lithoglyptics"],"synonyms":["gem engraving","stone carving","glyptography"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'lithos' (stone) and 'glyptos' (carved).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪθəˈɡlɪptɪks/","syllables":"li-tho-glyp-tics"},"inflection":{"noun_plural":"lithoglyptic works"},"usage_notes":{"explanation":"Lithoglyptics refers specifically to the art of engraving on stone, with a particular emphasis on the carving of gemstones. It is often used in the context of historical or archaeological studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying lithoglyptic.","correct":"✓ He is studying lithoglyptics.","note":"Lithoglyptics is the name of the art or science itself. Lithoglyptic (without the 's') can be used as an adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["lithoglyphic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Lithoglyptics is a specialized term referring to the art of engraving on stones, particularly gemstones. It is a niche subject primarily encountered in art history, archaeology, and gemology contexts. Due to its specific application and infrequent usage, it is considered an advanced vocabulary term. Understanding requires familiarity with art historical terminology and potentially knowledge of ancient languages from which the term is derived."},"example_sentences":[{"sentence":"The intricate details of the Roman lithoglyptics reveal the skill of the ancient artisans.","translation":"ローマの石彫の複雑なディテールは、古代職人の技術を明らかにしている。","type":"noun","meaning_category":"石彫"},{"sentence":"Scholars study lithoglyptics to understand ancient cultures and their artistic techniques.","translation":"学者たちは、古代文化とその芸術的技法を理解するために石彫を研究する。","type":"noun","meaning_category":"石彫術"}]}