{"word":"Ethnarchies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A form of government in which the ruler is of the same ethnicity as the majority of the population.","english_definition":"A type of government or territory ruled by an ethnarch, typically one who governs people of their own ethnic group.","examples":[{"sentence":"The Hasmonean kingdom was one of the most well-known ancient ethnarchies.","translation":"ハスモン朝の王国は、古代の民族統治国家として最もよく知られているものの一つでした。"},{"sentence":"Ethnarchies often arise in regions with strong ethnic identities.","translation":"民族統治国家は、民族的アイデンティティが強い地域でよく発生します。"}],"collocations":["establish an ethnarchy","rule as an ethnarch","ancient ethnarchies","modern ethnarchies"],"synonyms":["ethnic state","tribal rule","national government"],"antonyms":["multicultural state","cosmopolitan government"]}],"etymology":{"value":"Derived from the Greek words 'ethnos' (nation, people) and 'archos' (ruler, leader).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛθnɑːrkiːz/","syllables":"eth-nar-chies"},"inflection":{"noun_plural":"Ethnarchies"},"usage_notes":{"explanation":"The term 'ethnarchy' is relatively rare in modern political discourse. It typically refers to historical or ancient forms of government where ethnic identity was a primary factor in governance. It is different from a nation-state, although there can be overlap.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ethnarchies are always democratic.","correct":"✓ Ethnarchies can be autocratic or democratic depending on the specific government structure.","note":"Ethnarchies can take various forms of government, not necessarily democratic."},{"incorrect":"✗ Ethnarchy refers to any country with a diverse population.","correct":"✓ Ethnarchy refers to a country ruled by someone of the same ethnicity as the majority of the population.","note":"Ethnarchy is not related to diversity, but rather to the ethnic identity of the ruler."}],"priority":"★★☆"},"related_words":{"derivatives":["Ethnarch (noun: the ruler of an ethnarchy)","Ethnarchic (adjective: relating to an ethnarchy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ethnarchies' is a specialized term used in political science and history to describe a specific type of government. It is not commonly used in everyday language. Understanding requires knowledge of political systems and historical contexts."},"example_sentences":[{"sentence":"Ancient texts describe several ethnarchies in the Near East.","translation":"古代の文献には、近東におけるいくつかの民族統治国家が記述されています。","type":"general","meaning_category":"historical context"},{"sentence":"The transition from tribal rule to a more centralized ethnarchy was a significant development.","translation":"部族支配からより中央集権的な民族統治国家への移行は、重要な発展でした。","type":"general","meaning_category":"political development"}]}