{"word":"Fantails","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)ファンテール（ハトの一種）","english_definition":"(plural form) A breed of domestic pigeon characterized by a fan-shaped tail.","examples":[{"sentence":"We saw some beautiful Fantails at the pigeon show.","translation":"その鳩の品評会で、美しいファンテールを何羽か見ました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形, ニュージーランド英語) ファンテール（鳥の一種、オウギビタキ属）","english_definition":"(plural form, New Zealand English) Any bird of the genus Rhipidura, especially the New Zealand fantail (Rhipidura fuliginosa).","examples":[{"sentence":"Fantails are common birds in New Zealand forests.","translation":"ファンテールはニュージーランドの森林でよく見られる鳥です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Fantail' is derived from the fan-like shape of the bird's tail.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfænteɪlz","syllables":"fan-tails"},"inflection":{"noun_plural":"Fantails"},"usage_notes":{"explanation":"'Fantails' refers to either a breed of domestic pigeon with a distinctive fan-shaped tail or, in New Zealand English, to birds of the genus *Rhipidura*, particularly the New Zealand fantail. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["fantail"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Fantails' refers to a specific type of bird. It can mean a breed of pigeon with a fan-shaped tail, or, in New Zealand, a small insectivorous bird. The meaning depends on the context, especially the location. If you're in New Zealand, it's more likely to refer to the native fantail bird.","priority":"★★☆"},"example_sentences":[{"sentence":"The pigeon fancier showed off his prize-winning Fantails.","translation":"その鳩愛好家は、受賞した自慢のファンテールを披露した。","type":"noun","meaning_category":"ハト"},{"sentence":"The Fantails flitted through the trees, catching insects.","translation":"ファンテールが木々の間をひらひらと飛び回り、昆虫を捕まえていた。","type":"noun","meaning_category":"ニュージーランドの鳥"}]}