{"word":"Gaullism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ド・ゴール主義、フランスの政治思想および運動","english_definition":"A French political ideology and movement associated with Charles de Gaulle, emphasizing national independence, strong executive power, and social conservatism.","examples":[{"sentence":"Gaullism has had a lasting impact on French politics.","translation":"ド・ゴール主義はフランス政治に永続的な影響を与えてきた。"},{"sentence":"The party's platform is rooted in Gaullism.","translation":"その党の綱領はド・ゴール主義に根ざしている。"}],"collocations":["political Gaullism","social Gaullism","neo-Gaullism"],"synonyms":["nationalism","conservatism","statism"],"antonyms":["federalism","internationalism","liberalism"]}],"etymology":{"value":"Named after Charles de Gaulle, the former President of France.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɔːlɪzəm/","syllables":"Gau-llism"},"inflection":{"noun_plural":"Gaullisms"},"usage_notes":{"explanation":"Gaullism is a complex political ideology that has evolved over time. It is often associated with a strong sense of French national identity and a desire for France to play a leading role in world affairs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Gaullist, so he supports European integration.","correct":"✓ He is a Gaullist, but he is wary of excessive European integration.","note":"Gaullism typically emphasizes national sovereignty, so Gaullists are often skeptical of supranational organizations like the EU."}],"priority":"★★☆"},"related_words":{"derivatives":["Gaullist (noun, adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Gaullism is a term used to describe a specific political ideology originating in France. Understanding it requires knowledge of French history and politics. It is not a commonly used term outside of political discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"Modern French conservatism is heavily influenced by Gaullism.","translation":"現代フランスの保守主義はド・ゴール主義から大きな影響を受けている。","type":"general","meaning_category":"Political ideology"},{"sentence":"The candidate presented himself as a modern Gaullist.","translation":"その候補者は自身を現代のド・ゴール主義者として売り出した。","type":"general","meaning_category":"Political ideology"}]}