{"word":"Pyrogenicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"発熱性、発熱物質の存在","english_definition":"The quality of being pyrogenic; the ability to produce fever. The presence of pyrogens.","examples":[{"sentence":"The pyrogenicity of the water sample was tested.","translation":"その水サンプルについて発熱性の試験が行われた。"},{"sentence":"Low pyrogenicity is a critical requirement for injectable drugs.","translation":"注射薬にとって、低い発熱性は非常に重要な要件である。"}],"collocations":["test for pyrogenicity","reduce pyrogenicity","eliminate pyrogenicity","pyrogenicity testing"],"synonyms":["fever-inducing property","pyrogenic activity"],"antonyms":[]}],"etymology":{"value":"From 'pyrogenic' (producing fever) + '-ity' (state or quality). 'Pyrogenic' comes from Greek 'pyro-' (fire, fever) + '-genic' (producing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪrəˌdʒɛnɪˈsɪti/","syllables":"py-ro-ge-ni-ci-ty"},"inflection":{"noun_plural":"pyrogenicities (rarely used)"},"usage_notes":{"explanation":"'Pyrogenicity' refers to the ability of a substance to cause a fever. It's a crucial concern in pharmaceuticals, medical devices, and water systems, especially those involving injections or contact with the bloodstream. Tests are conducted to ensure that products have low or no pyrogenicity to prevent adverse reactions in patients.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyrogenicity is high, so it's safe to inject.","correct":"✓ The pyrogenicity is high, so it's NOT safe to inject.","note":"High pyrogenicity means the substance is likely to cause fever and is therefore NOT safe for injection."},{"incorrect":"✗ We need to check the pyrogenic of the solution.","correct":"✓ We need to check the pyrogenicity of the solution.","note":"'Pyrogenicity' is the noun (the quality or state), while 'pyrogenic' is the adjective (causing fever)."}],"priority":"★★☆"},"related_words":{"derivatives":["pyrogenic (adjective: producing fever)","pyrogen (noun: a substance that produces fever)","endotoxin (noun: a type of pyrogen found in bacteria)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyrogenicity' is a technical term used in medicine and science. It refers to the ability of a substance to cause a fever. You'll often see this word when discussing the safety of injectable medications, medical devices, or water used in healthcare settings. It's important to understand that high pyrogenicity means a greater risk of causing fever, which is undesirable.","priority":"★★★"},"example_sentences":[{"sentence":"The pharmaceutical company carefully monitors the **pyrogenicity** of its products.","translation":"その製薬会社は自社製品の発熱性を注意深く監視している。","type":"general","meaning_category":"発熱性"},{"sentence":"The **pyrogenicity** testing confirmed the absence of harmful contaminants.","translation":"発熱性試験により、有害な汚染物質がないことが確認された。","type":"testing","meaning_category":"発熱性試験"},{"sentence":"Reducing the **pyrogenicity** of medical devices is essential for patient safety.","translation":"医療機器の発熱性を低減することは、患者の安全にとって不可欠である。","type":"safety","meaning_category":"安全性"}]}