{"word":"Sorra","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Irish English, informal) A small amount or degree; used in negative contexts to express a lack of something.","english_definition":"(Irish English, informal) Used in negative statements to emphasize the absence of something; not any; not at all.","examples":[{"sentence":"I haven't a sorra notion what you're talking about.","translation":"あなたが何を言っているのか全く分かりません。"},{"sentence":"He didn't give a sorra damn about what anyone thought.","translation":"彼は誰もがどう思おうと全く気にしなかった。"}],"collocations":["haven't a sorra notion","not give a sorra damn","not care a sorra","without a sorra"],"synonyms":["iota","whit","bit","scrap","shred","ounce","atom","mote","grain","particle"],"antonyms":["abundance","plenty","great deal","lot"]},{"part_of_speech":"interjection","definition":"(Irish English, archaic) An expression of mild annoyance, regret, or exasperation.","english_definition":"(Irish English, archaic) An exclamation expressing mild regret, annoyance, or frustration; similar to 'alas' or 'too bad'.","examples":[{"sentence":"Sorra, I forgot to bring my umbrella!","translation":"ああ、傘を持ってくるのを忘れてしまった！"},{"sentence":"Sorra on him for being so foolish.","translation":"彼があまりにも愚かだったのは残念だ。"}],"collocations":["Sorra on him","Sorra on them","Sorra for me"],"synonyms":["alas","too bad","pity","shame","unfortunately"],"antonyms":["fortunately","thankfully"]}],"etymology":{"value":"Derived from the Irish word 'searradh', meaning 'bad luck' or 'misfortune'. It evolved to express a lack of something, often used in negative phrases.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɔrə/","syllables":"Sor-ra"},"inflection":{"notes":"It does not inflect, as it is primarily used as a noun in set phrases or as an interjection."},"usage_notes":{"explanation":"'Sorra' is a term primarily found in Irish English, particularly in informal speech. It's used to emphasize the absence of something in negative statements, such as 'I haven't a sorra notion' (I have no idea). It can also be used as an interjection to express mild annoyance or regret, although this usage is less common today. The term is closely associated with Irish dialects and may not be widely understood outside of Ireland or by those unfamiliar with Irish English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a sorra of money.","correct":"✓ I haven't a sorra of money.","note":"'Sorra' is almost exclusively used in negative contexts to indicate a lack of something. Using it in a positive statement is incorrect."},{"incorrect":"✗ Sorra, what a beautiful day!","correct":"✓ Alas, what a beautiful day!","note":"As an interjection, 'sorra' expresses regret or annoyance, not positive surprise. Use 'alas' or another expression of regret instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["begorra","faith","indeed","to be sure"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (dialectal and not typically taught)","frequency_google_ngram":"Low frequency, primarily in Irish English texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sorra' is a dialectal term primarily found in Irish English. It is used in negative statements to emphasize the absence of something, or as an interjection to express mild annoyance or regret. Due to its dialectal nature, it is not typically encountered in standard English and may require familiarity with Irish English to understand its usage. It is most often found in literature or informal speech representing Irish dialects."},"example_sentences":[{"sentence":"He didn't care a sorra about the consequences.","translation":"彼は結果を全く気にしなかった。","type":"noun","meaning_category":"Lack of concern"},{"sentence":"Sorra take me if I ever do that again!","translation":"もし私がまたそれをしたら、罰が当たりますように！","type":"interjection","meaning_category":"Expression of regret"},{"sentence":"There wasn't a sorra thing he could do to help.","translation":"彼が助けるためにできることは何もなかった。","type":"noun","meaning_category":"Lack of ability"}]}