{"word":"COE","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にシンガポール) 自動車登録証","english_definition":"(chiefly Singapore) Certificate of Entitlement: a certificate issued by the Singaporean government that allows the holder to register, own, and use a vehicle in Singapore for a period of 10 years.","examples":[{"sentence":"The COE price has been increasing rapidly in recent months.","translation":"ここ数ヶ月でCOEの価格が急速に上昇している。"},{"sentence":"You need to bid for a COE if you want to buy a car in Singapore.","translation":"シンガポールで車を買いたいなら、COEを入札する必要がある。"}],"collocations":["COE price (COE価格)","COE bidding (COE入札)","renew COE (COEを更新する)","open COE (オープンCOE)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Abbreviation of Certificate of Entitlement, a term specific to Singapore's vehicle ownership regulations.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsiːˌoʊˈiː/","syllables":"C-O-E (three syllables)"},"inflection":{"notes":"Plural form: COEs"},"usage_notes":{"explanation":"COE is a term specific to Singapore. It refers to the Certificate of Entitlement, which is required to register, own, and use a vehicle in Singapore. The COE system is designed to control the number of vehicles on the road.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a car without COE.","correct":"✓ I bought a car but I need to get a COE.","note":"You cannot legally own and drive a car in Singapore without a COE."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["vehicle quota system","Singaporean transport policy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Singapore-specific term)","frequency_google_ngram":"Low frequency outside of Singapore.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"COE is a specialized term primarily used in Singapore. It stands for Certificate of Entitlement, which is a mandatory certificate required to own and operate a vehicle in Singapore for a period of 10 years. The COE system is a key part of Singapore's efforts to manage traffic congestion. Understanding COE requires familiarity with Singapore's unique vehicle ownership policies."},"example_sentences":[{"sentence":"The high cost of COE makes car ownership in Singapore very expensive.","translation":"COEのコストが高いため、シンガポールでの車の所有は非常に高価になる。","type":"noun","meaning_category":"自動車登録証"},{"sentence":"The government releases a limited number of COEs each month.","translation":"政府は毎月、限られた数のCOEを発行する。","type":"noun","meaning_category":"自動車登録証"},{"sentence":"Many Singaporeans complain about the fluctuating COE prices.","translation":"多くのシンガポール人は、変動するCOE価格について不満を述べている。","type":"noun","meaning_category":"自動車登録証"}]}