{"word":"homeopolar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単極の、同極の","english_definition":"Relating to or being a type of electric machine (such as a generator or motor) in which the active conductors move through a magnetic field of constant polarity, producing a direct current without commutation.","examples":[{"sentence":"A homeopolar generator produces direct current.","translation":"単極発電機は直流電流を生成する。"},{"sentence":"The homeopolar motor is a simple type of electric motor.","translation":"単極モーターは単純な種類の電気モーターである。"}],"collocations":["homeopolar generator","homeopolar motor"],"synonyms":["unipolar"],"antonyms":["heteropolar"]}],"etymology":{"value":"The term \"homeopolar\" combines \"homo-\" (meaning same or similar) with \"polar\" (referring to polarity), indicating a consistent or unchanging polarity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊmioʊˈpoʊlər/","syllables":"ho-me-o-po-lar"},"inflection":{"notes":"Adjective, no special inflections."},"usage_notes":{"explanation":"The term 'homeopolar' is primarily used in the context of electrical engineering and physics, specifically when describing machines that generate or utilize direct current through the movement of conductors in a constant magnetic field. These machines are relatively simple in design but have unique characteristics compared to other types of electrical machines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The homeopolar bear lives in the arctic.","correct":"✓ The polar bear lives in the arctic.","note":"'Homeopolar' refers to electrical machines, not animals. Use 'polar' for the bear."}],"priority":"★☆☆"},"related_words":{"derivatives":["homeopolar motor","homeopolar generator"],"related_terms":["Faraday disc","unipolar machine"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'homeopolar' is a technical term used in electrical engineering and physics. It describes a specific type of electric machine characterized by a constant polarity magnetic field. Understanding this term requires familiarity with basic concepts in electromagnetism and electrical machinery. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The design of the homeopolar generator allows for high current output at low voltage.","translation":"単極発電機の設計により、低電圧で高電流出力を実現できる。","type":"general","meaning_category":"Technical Description"},{"sentence":"Homeopolar motors are often used in applications requiring high torque at low speeds.","translation":"単極モーターは、低速で高トルクを必要とする用途でよく使用される。","type":"general","meaning_category":"Application"}]}