{"word":"pro-suburban","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"郊外を支持する、郊外推進の","english_definition":"Supporting or promoting suburban development and lifestyles.","examples":[{"sentence":"The candidate ran on a pro-suburban platform, promising to lower property taxes and improve local schools.","translation":"その候補者は、固定資産税の引き下げと地元の学校の改善を約束し、郊外を支持する政策を掲げて選挙活動を行った。"},{"sentence":"The debate over urban sprawl often pits pro-suburban advocates against those who favor denser urban development.","translation":"都市のスプロール化に関する議論では、郊外推進派と、より高密度な都市開発を支持する人々が対立することが多い。"}],"collocations":["pro-suburban policies","pro-suburban development","pro-suburban voters","pro-suburban lifestyle"],"synonyms":["suburban-friendly","suburban-oriented"],"antonyms":["anti-suburban","pro-urban","urban-focused"]}],"etymology":{"value":"The word is formed by combining the prefix 'pro-' (meaning 'in favor of' or 'supporting') with the adjective 'suburban' (relating to the suburbs).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊ.səˈbɜː.bən/","syllables":"pro-sub-ur-ban"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns, and can be used in comparative and superlative forms, though this is rare. For example: 'more pro-suburban' or 'most pro-suburban'."},"usage_notes":{"explanation":"'Pro-suburban' is used to describe policies, attitudes, or people that favor the development and maintenance of suburban areas. It often implies a preference for lower-density housing, car-dependent transportation, and a focus on single-family homes. It is often used in discussions about urban planning, transportation, and environmental policy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro suburban.","correct":"✓ He is a pro-suburban advocate.","note":"'Pro-suburban' is an adjective, so it needs to modify a noun. Use 'pro-suburban advocate' or 'pro-suburban supporter' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["suburban","suburb","suburbanization"],"related_terms":["urban sprawl","exurb","urban planning","smart growth","new urbanism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, used mainly in specific contexts related to urban planning and policy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-suburban' is a compound adjective used to describe something that supports or favors suburban development. It is often used in discussions about urban planning, housing, and transportation. Understanding this term requires familiarity with the concept of suburbs and the debates surrounding their growth and development. It is most often encountered in academic or policy-related contexts."},"example_sentences":[{"sentence":"The city council's decision to invest in new highways was seen as a pro-suburban move.","translation":"市議会が新しい高速道路への投資を決定したことは、郊外を支持する動きと見なされた。","type":"adjective","meaning_category":"Supporting suburban development"},{"sentence":"Pro-suburban policies often prioritize car ownership and single-family homes.","translation":"郊外推進政策は、しばしば自動車の所有と一戸建て住宅を優先する。","type":"adjective","meaning_category":"Promoting suburban lifestyles"}]}