{"word":"anaplasty","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"形成手術、再建手術","english_definition":"The surgical restoration or reconstruction of a missing or deformed part.","examples":[{"sentence":"The patient underwent anaplasty to reconstruct his ear after the accident.","translation":"患者は事故後、耳を再建するために形成手術を受けた。"},{"sentence":"Anaplasty is often used to correct congenital deformities.","translation":"形成手術は、先天的な変形の矯正によく用いられる。"}],"collocations":["ear anaplasty (耳の形成手術)","facial anaplasty (顔面の形成手術)","nasal anaplasty (鼻の形成手術)","breast anaplasty (乳房の形成手術)"],"synonyms":["reconstructive surgery","plastic surgery","restorative surgery"],"antonyms":[]}],"etymology":{"value":"The term 'anaplasty' comes from the Greek words 'ana-' meaning 'again' or 'upward,' and 'plassein' meaning 'to mold' or 'to form.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈænəˌplæsti/","syllables":"a-na-plas-ty"},"inflection":{"noun_plural":"anaplasties"},"usage_notes":{"explanation":"Anaplasty is a surgical procedure focused on reconstructing or restoring parts of the body that are missing or deformed due to injury, disease, or congenital conditions. It is a specialized area within plastic surgery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She had anaplasty done on her heart.","correct":"✓ She had heart surgery.","note":"Anaplasty is typically used for external body parts, not internal organs. Heart surgery is a more appropriate term for procedures on the heart."}],"priority":"★☆☆"},"related_words":{"derivatives":["anaplastic (adjective: relating to anaplasty or anaplasia)","plastic surgery (noun: broader field encompassing anaplasty)","reconstruction (noun: the act of rebuilding or restoring)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaplasty' is a specialized medical term referring to the surgical reconstruction of missing or deformed body parts. It's primarily used in medical contexts and is not commonly encountered in everyday language. Understanding the etymology (Greek roots 'ana-' meaning 'again' and 'plassein' meaning 'to mold') can aid in remembering the term's meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"Following the burn injury, he required extensive anaplasty to restore his facial features.","translation":"火傷の怪我の後、彼は顔の容貌を回復するために広範囲な形成手術を必要とした。","type":"general","meaning_category":"reconstruction"},{"sentence":"Breast anaplasty can significantly improve the quality of life for women who have undergone mastectomy.","translation":"乳房再建手術は、乳房切除術を受けた女性の生活の質を大幅に改善することができる。","type":"specific","meaning_category":"reconstruction"}]}