{"word":"Amalan","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Islam) Good deeds, acts of worship, or righteous actions performed by a Muslim to earn Allah's pleasure and blessings.","english_definition":"In Islam, 'Amalan' refers to good deeds, acts of worship, or righteous actions performed by a Muslim to earn Allah's pleasure and blessings. These actions can include prayer, charity, fasting, pilgrimage, and other acts of piety and moral conduct.","examples":[{"sentence":"Performing daily prayers is an important Amalan for Muslims.","translation":"毎日のお祈りをすることは、イスラム教徒にとって重要なアマルです。"},{"sentence":"Giving charity, or Zakat, is considered a significant Amalan in Islam.","translation":"慈善、またはザカートをすることは、イスラム教において重要なアマルと考えられています。"},{"sentence":"During Ramadan, Muslims increase their Amalan in hopes of greater rewards.","translation":"ラマダン期間中、イスラム教徒はより大きな報酬を期待してアマルを増やします。"}],"collocations":["perform Amalan","increase Amalan","righteous Amalan","good Amalan"],"synonyms":["good deeds","righteous actions","acts of worship","charity","prayer","fasting"],"antonyms":["sin","evil deeds","wrongdoing"]}],"etymology":{"value":"Derived from the Arabic word 'عمل' ('amal), which means 'action,' 'work,' or 'deed.'","priority":"N/A"},"pronunciation":{"ipa":"/ɑːˈmɑːlɑːn/","syllables":"A-ma-lan"},"inflection":{"noun_plural":"Amalat (Arabic plural)"},"usage_notes":{"explanation":"'Amalan' is a term used within the context of Islam to describe actions that are considered virtuous and pleasing to Allah. It encompasses both obligatory religious duties and voluntary acts of piety. The concept of Amalan is central to Islamic ethics and the pursuit of spiritual growth.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ Amalan is only about praying.","correct":"✓ Amalan includes prayer, charity, and other good deeds.","note":"Amalan encompasses a wide range of good deeds, not just prayer."},{"incorrect":"✗ Amalan guarantees entry to Paradise.","correct":"✓ Amalan is performed to seek Allah's pleasure and hope for Paradise.","note":"While Amalan is important, salvation is ultimately by Allah's grace."}],"priority":"N/A"},"related_words":{"derivatives":["Amal (Arabic: عمل) - action, work, deed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low (specific to religious context)","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Amalan' is a term used in Islamic religious contexts to refer to good deeds or acts of worship. Understanding this term requires familiarity with Islamic concepts and practices. It is not commonly used in general English. Examples include performing prayers, giving to charity, and other righteous actions. The term is often used in discussions about Islamic ethics and spirituality."},"example_sentences":[{"sentence":"Muslims believe that performing good Amalan leads to spiritual growth.","translation":"イスラム教徒は、良いアマルを行うことが精神的な成長につながると信じています。","type":"noun","meaning_category":"Good deeds"},{"sentence":"During the holy month, many Muslims focus on increasing their Amalan.","translation":"聖なる月には、多くイスラム教徒がアマルを増やすことに集中します。","type":"noun","meaning_category":"Acts of worship"},{"sentence":"The reward for sincere Amalan is believed to be great in the afterlife.","translation":"誠実なアマルに対する報酬は、来世で大きいと信じられています。","type":"noun","meaning_category":"Righteous actions"}]}