{"word":"compander","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コンパンダー（圧縮伸張器）","english_definition":"A device used to reduce the dynamic range of a signal by compressing it before transmission and expanding it upon reception.","examples":[{"sentence":"The compander reduced noise during transmission.","translation":"コンパンダーは伝送中のノイズを低減しました。"}],"collocations":["noise reduction","signal processing","audio engineering"],"synonyms":["compressor-expander"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'compressor' and 'expander'.","priority":"★★★"},"pronunciation":{"ipa":"/kəmˈpændər/","syllables":"com-pan-der"},"inflection":{"noun_plural":"companders"},"usage_notes":{"explanation":"A compander is primarily used in audio and telecommunications to improve the signal-to-noise ratio. It compresses the signal's dynamic range before transmission, making quieter sounds louder and louder sounds less loud. At the receiving end, the signal is expanded, restoring the original dynamic range while reducing noise introduced during transmission.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compander expanded the signal before transmission.","correct":"✓ The compander compressed the signal before transmission.","note":"Companders compress before transmission and expand upon reception."}],"priority":"★★☆"},"related_words":{"derivatives":["compression","expansion","compressor","expander"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'compander' is a technical term used in audio engineering and telecommunications. It refers to a device that compresses the dynamic range of a signal before transmission and expands it upon reception to improve the signal-to-noise ratio. Understanding requires knowledge of signal processing concepts."},"example_sentences":[{"sentence":"The wireless microphone system uses a compander to minimize background noise.","translation":"そのワイヤレスマイクシステムは、バックグラウンドノイズを最小限に抑えるためにコンパンダーを使用しています。","type":"noun","meaning_category":"device for dynamic range compression and expansion"}]}