{"word":"warray","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Australian Aboriginal English) A type of woomera or spear-thrower, typically used in northern Australia.","english_definition":"A type of woomera or spear-thrower, typically used in northern Australia.","examples":[{"sentence":"The hunter skillfully used his warray to launch the spear.","translation":"そのハンターは熟練した手つきでワレーを使って槍を放った。"}],"collocations":["use a warray","traditional warray"],"synonyms":["woomera","spear-thrower"],"antonyms":[]}],"etymology":{"value":"Likely derived from an Australian Aboriginal language, but the specific origin is difficult to pinpoint due to the diversity of languages and limited historical records.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwɒr.eɪ/","syllables":"wor-ray"},"inflection":{"noun_plural":"warrays"},"usage_notes":{"explanation":"'Warray' is a term primarily used in the context of Australian Aboriginal culture, specifically referring to a type of spear-thrower. It's important to use this term with respect and understanding of its cultural significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a woomera, also known as a boomerang.","correct":"✓ He used a warray, a type of woomera.","note":"A warray is a type of woomera, but not all woomeras are warrays. Boomerangs are different throwing tools entirely."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Warray' is a specialized term related to Australian Aboriginal culture. Understanding requires knowledge of traditional tools and cultural practices. It is unlikely to be encountered in general English usage.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The museum displayed an ancient warray, showcasing the ingenuity of Aboriginal craftsmanship.","translation":"博物館には古代のワレーが展示されており、アボリジニの職人技の創意工夫が示されていた。","type":"noun","meaning_category":"spear-thrower"}]}