{"word":"supraliminally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"意識できる閾値を超えて、意識的に知覚できる方法で","english_definition":"in a way that is above the threshold of conscious perception; in a way that can be consciously perceived.","examples":[{"sentence":"The message was presented supraliminally, so participants were aware of it.","translation":"そのメッセージは意識できる閾値を超えて提示されたので、参加者はそれに気づいていた。"},{"sentence":"Unlike subliminal advertising, supraliminally presented ads are consciously perceived.","translation":"サブリミナル広告とは異なり、意識閾を超えて提示された広告は意識的に知覚される。"}],"collocations":["present supraliminally","perceive supraliminally","process supraliminally"],"synonyms":["consciously","overtly","explicitly"],"antonyms":["subliminally"]},{"part_of_speech":"adverb","definition":"(心理学で)刺激が意識的に認識されるレベルを超えて","english_definition":"(in psychology) at a level above that at which a stimulus can be consciously recognised.","examples":[{"sentence":"Supraliminally presented stimuli are more likely to influence behavior through conscious processing.","translation":"意識閾を超えて提示された刺激は、意識的な処理を通じて行動に影響を与える可能性が高い。"}],"collocations":["supraliminally presented stimuli","supraliminally processed information"],"synonyms":["consciously","explicitly","overtly"],"antonyms":["subliminally"]}],"etymology":{"value":"\"supra-\" (above) + \"liminal\" (relating to a threshold) + \"-ly\" (adverbial suffix).  The word indicates something presented or perceived above the threshold of consciousness.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːprəˈlɪmɪnəli/","syllables":"su-pra-lim-i-nal-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Supraliminally\" is used to describe stimuli or information that is presented at a level strong enough to be consciously perceived. It is often used in contrast to \"subliminally,\" which refers to stimuli presented below the threshold of conscious awareness. In psychological research, the distinction is crucial for understanding how conscious and unconscious processing affect behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The image was shown supraliminally, so nobody noticed it.","correct":"✓ The image was shown supraliminally, so everyone noticed it.","note":"If something is presented supraliminally, it means it is consciously perceived, so people *will* notice it."},{"incorrect":"✗ Supraliminally messages are unconscious.","correct":"✓ Supraliminally messages are conscious.","note":"Supraliminal messages are by definition conscious, not unconscious."}],"priority":"★★☆"},"related_words":{"derivatives":["supraliminal (adjective)","liminal (adjective)","subliminal (adjective)","subliminally (adverb)"],"phrases":["threshold of consciousness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"supraliminally\" is a technical term primarily used in psychology and related fields. It describes the presentation or perception of stimuli at a level above the threshold of conscious awareness. Understanding this word requires familiarity with the concept of thresholds in perception and the distinction between conscious and unconscious processing. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Participants were asked to rate the images they viewed supraliminally.","translation":"参加者は、意識的に見た画像の評価を求められた。","type":"general","meaning_category":"conscious perception"},{"sentence":"The effectiveness of supraliminally presented persuasive messages was compared to that of subliminal messages.","translation":"意識閾を超えて提示された説得メッセージの効果は、サブリミナルメッセージの効果と比較された。","type":"psychology","meaning_category":"psychology"}]}