{"word":"letter-bound","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"手紙に縛られた、手紙に依存した、手紙に閉じ込められた","english_definition":"Relying on or restricted to communication by letters; feeling confined or limited by correspondence.","examples":[{"sentence":"In the age of instant messaging, their relationship remained letter-bound.","translation":"インスタントメッセージの時代になっても、彼らの関係は手紙に縛られたままだった。"},{"sentence":"She felt letter-bound, unable to express her true feelings in writing.","translation":"彼女は手紙に閉じ込められ、自分の本当の気持ちを文章で表現することができなかった。"},{"sentence":"The historical record is letter-bound, offering only a partial view of the past.","translation":"歴史的記録は手紙に依存しており、過去の一部分しか見せていない。"}],"collocations":["remain letter-bound","feel letter-bound","a letter-bound relationship","a letter-bound existence"],"synonyms":["epistolary","correspondence-dependent","confined to letters","dependent on written communication"],"antonyms":["digital","online","instant","immediate","communicative","facile","uninhibited"],"notes":["Often used to describe a situation where communication is limited or old-fashioned."]}],"etymology":{"value":"A compound word formed from 'letter' (a written or printed communication) and 'bound' (restricted or confined).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛtərˌbaʊnd/","syllables":"let-ter-bound"},"inflection":{"notes":"This word does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Letter-bound' describes a state of being limited or reliant on letters for communication, often implying a sense of restriction or confinement, especially in contrast to more modern forms of communication. It can also suggest a feeling of being unable to fully express oneself through written correspondence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The package was letter-bound.","correct":"✓ The package was bound for London.","note":"'Letter-bound' refers to communication, not physical objects. Use 'bound for' to indicate a destination."},{"incorrect":"✗ He was letter-bound to his work.","correct":"✓ He was dedicated to his work.","note":"'Letter-bound' is not a general synonym for 'dedicated' or 'committed'. It specifically relates to communication by letters."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["epistolary","correspondence","mail","written communication"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'letter-bound' is relatively uncommon and implies a reliance on traditional letter writing for communication, often suggesting limitations or a sense of being confined by this method, especially in contrast to modern, faster forms of communication. It is most likely to be encountered in literature or historical contexts where traditional forms of communication are emphasized."},"example_sentences":[{"sentence":"Their love affair was conducted through a series of passionate, yet ultimately letter-bound, exchanges.","translation":"彼らの恋愛は、情熱的でありながら、最終的には手紙に縛られたやり取りを通じて行われた。","type":"general","meaning_category":"手紙に依存した"},{"sentence":"She felt increasingly letter-bound, yearning for face-to-face conversations.","translation":"彼女はますます手紙に閉じ込められていると感じ、対面での会話を切望した。","type":"general","meaning_category":"手紙に閉じ込められた"},{"sentence":"The historian noted that the archives were largely letter-bound, providing a limited perspective on the events.","translation":"歴史家は、公文書館が主に手紙に依存しており、出来事に対する限定的な視点しか提供していないと指摘した。","type":"general","meaning_category":"手紙に依存した"}]}