{"word":"bogier","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉄道車両の)ボギー台車","english_definition":"A swiveling carriage under a railway car, having several wheels.","examples":[{"sentence":"The train's bogier allowed it to navigate the tight curves of the mountain railway.","translation":"列車のボギー台車のおかげで、山岳鉄道の急カーブを走行することができた。"}],"collocations":["railway bogier","train bogier"],"synonyms":["truck (railroad)","wheelset"],"antonyms":[]},{"part_of_speech":"noun","definition":"(鉱山)鉱車","english_definition":"A small wagon used in mines.","examples":[{"sentence":"The miner pushed the bogier full of coal out of the mine shaft.","translation":"鉱夫は石炭でいっぱいの鉱車を鉱山の坑道から押し出した。"}],"collocations":["mine bogier","coal bogier"],"synonyms":["mine cart","ore car"],"antonyms":[]}],"etymology":{"value":"From 'bogie', possibly from Bogie Iron Works in Scotland, where such carriages were first made.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈboʊɡiər/","syllables":"bo-gi-er"},"inflection":{"noun_plural":"bogiers"},"usage_notes":{"explanation":"The term 'bogier' is primarily used in technical contexts related to railways and mining. In railway terminology, it refers to the swiveling undercarriage that supports the train car and allows it to navigate curves more easily. In mining, it refers to a small wagon used to transport materials within the mine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bogier was used to fly the plane.","correct":"✓ The bogier is part of a train or mine car.","note":"'Bogier' is specific to railway cars and mine cars, not airplanes."}],"priority":"★☆☆"},"related_words":{"derivatives":["bogie","bogey (golf)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bogier' is a technical term used in specific industries, primarily railways and mining. It refers to the undercarriage of a train or a small wagon in a mine. Due to its specialized usage, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The new high-speed train features advanced bogier designs for improved stability.","translation":"新型高速鉄道は、安定性を向上させるための高度なボギー台車設計を特徴としている。","type":"noun","meaning_category":"railway"},{"sentence":"The mine bogier was filled with freshly extracted ore.","translation":"鉱山の鉱車は、採掘されたばかりの鉱石で満たされていた。","type":"noun","meaning_category":"mining"}]}