{"word":"self-embedding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己埋め込み（言語学、計算機科学）","english_definition":"(linguistics, computer science) The property of a structure (e.g., a sentence, a data structure) containing another instance of itself.","examples":[{"sentence":"Self-embedding in sentences can make them difficult to parse.","translation":"文における自己埋め込みは、文の解析を難しくすることがある。"},{"sentence":"The grammar allows for self-embedding, leading to potentially infinite recursion.","translation":"その文法は自己埋め込みを許容しており、潜在的に無限の再帰につながる。"}],"collocations":["self-embedding grammar","self-embedding sentence","degree of self-embedding","center-embedding"],"synonyms":["recursion","nesting"],"antonyms":[]},{"part_of_speech":"adjective","definition":"自己埋め込みの","english_definition":"(of a structure) containing an instance of itself.","examples":[{"sentence":"Self-embedding clauses can be challenging for language learners.","translation":"自己埋め込み節は、言語学習者にとって難しい場合がある。"},{"sentence":"The self-embedding nature of the data structure allows for efficient representation of hierarchical information.","translation":"そのデータ構造の自己埋め込み的な性質により、階層的な情報を効率的に表現できる。"}],"collocations":["self-embedding clause","self-embedding structure","self-embedding data","highly self-embedding"],"synonyms":["recursive","nested"],"antonyms":[]}],"etymology":{"value":"The term combines 'self-' (referring to the structure itself) with 'embedding' (the act of placing something within something else).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself ɪmˈbedɪŋ/","syllables":"self-em-bed-ding"},"inflection":{"noun_plural":"self-embeddings"},"usage_notes":{"explanation":"'Self-embedding' refers to a structure that contains another instance of the same type of structure within itself. This concept is prevalent in linguistics, particularly in the study of syntax, where sentences can contain clauses within clauses. It also appears in computer science, especially in the context of recursive data structures and algorithms. The degree of self-embedding can affect the complexity and understandability of the structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentence is self-embedded.","correct":"✓ The sentence is self-embedding.","note":"While 'self-embedded' might be understood, 'self-embedding' is the more common and grammatically correct adjective form. 'Self-embedded' could imply the process is complete, whereas 'self-embedding' describes the inherent property."}],"priority":"★★☆"},"related_words":{"derivatives":["embedding","embedded","self-reference","recursion"],"related_concepts":["context-free grammar","pushdown automaton","center embedding"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-embedding' is a technical term primarily used in linguistics and computer science. It describes a structure that contains another instance of the same type of structure within itself. In linguistics, it refers to sentences or clauses that are nested within each other, potentially leading to complex and difficult-to-parse constructions. In computer science, it relates to recursive data structures and algorithms. Understanding this term requires a background in these fields."},"example_sentences":[{"sentence":"The **self-embedding** nature of this grammar makes it difficult to create efficient parsers.","translation":"この文法の自己埋め込み的な性質は、効率的なパーサーの作成を困難にする。","type":"adjective","meaning_category":"自己埋め込みの"},{"sentence":"The **self-embedding** in the sentence made it hard to understand.","translation":"その文における自己埋め込みが、文の理解を困難にした。","type":"noun","meaning_category":"自己埋め込み"}]}