{"word":"Orneriness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"気難しさ、意地悪さ、頑固さ","english_definition":"The quality of being bad-tempered and combative; stubbornness.","examples":[{"sentence":"His orneriness made him difficult to work with.","translation":"彼の気難しさは彼を仕事で扱いにくくした。"},{"sentence":"She admired his orneriness, which she saw as a sign of independence.","translation":"彼女は彼の頑固さを、独立心の表れと見て称賛した。"},{"sentence":"The old man's orneriness was legendary in the town.","translation":"その老人の気難しさは町では伝説的だった。"}],"collocations":["display orneriness","show orneriness","inherent orneriness","general orneriness"],"synonyms":["irascibility","cantankerousness","crabbiness","stubbornness","obstinacy","contrariness","perversity"],"antonyms":["agreeableness","amiability","complaisance","docility","tractability"]}],"etymology":{"value":"The word \"orneriness\" is derived from \"ornery,\" which is a corruption of \"ordinary.\" In the 19th century, \"ornery\" came to mean \"mean, low, or contemptible.\" The suffix \"-ness\" was added to form the noun \"orneriness,\" referring to the quality of being ornery.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːrnəriːnəs/","syllables":"or-ner-i-ness"},"inflection":{"noun_plural":"ornerinesses (rarely used)"},"usage_notes":{"explanation":"\"Orneriness\" describes a disposition characterized by irritability, stubbornness, and a general unwillingness to cooperate. It often implies a deliberate choice to be difficult or unpleasant. While it can be viewed negatively, in some contexts, it might be seen as a sign of independence or strength of character.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed orneriness behavior.","correct":"✓ He showed ornery behavior. / ✓ He showed orneriness.","note":"\"Orneriness\" is a noun, so it doesn't directly modify another noun. Use \"ornery\" (the adjective) to describe behavior, or use \"orneriness\" as the subject itself."},{"incorrect":"✗ Her orneriness made her popular.","correct":"✓ Her orneriness made her unpopular.","note":"While orneriness can sometimes be admired, it generally makes someone less popular due to the negative aspects of being difficult and uncooperative."}],"priority":"★☆☆"},"related_words":{"derivatives":["ornery (adjective: bad-tempered, stubborn)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Orneriness\" is a relatively uncommon word that describes a specific type of negative personality trait. It implies a combination of bad temper, stubbornness, and a general unwillingness to be agreeable. Understanding this word requires a good vocabulary and an understanding of nuanced personality traits. It's not typically used in everyday conversation but may appear in literature or more formal discussions of character.","example_sentences":[]},"example_sentences":[{"sentence":"The cat's orneriness was evident in the way it swatted at anyone who came near.","translation":"その猫の気難しさは、近づく人を誰でも叩く様子に明らかだった。","type":"noun","meaning_category":"気難しさ"},{"sentence":"Despite his orneriness, he had a good heart.","translation":"彼の気難しさにもかかわらず、彼は優しい心を持っていた。","type":"noun","meaning_category":"頑固さ"},{"sentence":"Her orneriness often led to arguments with her coworkers.","translation":"彼女の意地悪さはしばしば同僚との口論につながった。","type":"noun","meaning_category":"意地悪さ"}]}