{"word":"reindorsement","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"裏書きの再実行、再裏書き","english_definition":"The act of endorsing again; a second or subsequent endorsement.","examples":[{"sentence":"The reindorsement of the check was required due to an error in the initial endorsement.","translation":"最初の裏書きに誤りがあったため、小切手の再裏書きが必要でした。"},{"sentence":"The bank requested a reindorsement to verify the authenticity of the signature.","translation":"銀行は署名の真正性を確認するために再裏書きを要求しました。"}],"collocations":["require reindorsement","request reindorsement","valid reindorsement"],"synonyms":["second endorsement","further endorsement"],"antonyms":["initial endorsement"]},{"part_of_speech":"noun","definition":"(比喩的に)再承認、再支持","english_definition":"A renewed or repeated expression of support or approval.","examples":[{"sentence":"The policy received reindorsement from the board of directors.","translation":"その政策は取締役会から再承認を受けた。"},{"sentence":"The candidate hoped for a reindorsement of his platform by the voters.","translation":"候補者は有権者による彼の政策綱領の再支持を望んだ。"}],"collocations":["receive reindorsement","seek reindorsement","gain reindorsement"],"synonyms":["reaffirmation","reapproval","resupport"],"antonyms":["disapproval","rejection"]}],"etymology":{"value":"Prefix 're-' (again) + 'indorsement' (variant of 'endorsement').","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌriːɪnˈdɔːrsmənt/","syllables":"re-in-dorse-ment"},"inflection":{"noun_plural":"reindorsements"},"usage_notes":{"explanation":"'Reindorsement' is relatively uncommon. It usually refers to the act of endorsing something again, either literally (like a check) or figuratively (like a policy or candidate). The figurative sense is more common in formal or business contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reindorsement was done by the machine.","correct":"✓ The re-endorsement was done by the machine.","note":"When referring to a literal endorsement, hyphenation can improve clarity, especially if the action was automated."},{"incorrect":"✗ He gave his reindorsement to the project, so it failed.","correct":"✓ He withdrew his endorsement from the project, so it failed.","note":"'Reindorsement' implies continued support. If something failed due to lack of support, the opposite action (withdrawal of endorsement) is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["reindorse (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reindorsement' is a formal term primarily used in legal or business contexts to describe the act of endorsing something again. It can refer to the physical act of signing a document a second time or to the act of publicly supporting something that one has previously supported. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The lawyer requested a reindorsement of the contract to clarify the terms.","translation":"弁護士は条項を明確にするために契約書の再裏書きを要求した。","type":"noun","meaning_category":"裏書きの再実行"},{"sentence":"The president's speech was seen as a reindorsement of his administration's policies.","translation":"大統領の演説は政権の政策の再支持と見なされた。","type":"noun","meaning_category":"再承認"}]}