{"word":"Coenodioecism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A breeding system in plants where a population consists of hermaphrodites and female individuals.","english_definition":"A plant breeding system in which some plants in a population are hermaphroditic (having both male and female reproductive organs) and others are exclusively female (having only female reproductive organs).","examples":[{"sentence":"Coenodioecism is a rare breeding system found in some plant species.","translation":"雌雄異株共存性は、一部の植物種に見られるまれな繁殖システムです。"},{"sentence":"The presence of both hermaphrodites and female individuals characterizes coenodioecism.","translation":"雌雄同体と雌個体の両方が存在することが、雌雄異株共存性の特徴です。"}],"collocations":["plant coenodioecism","evolution of coenodioecism","study of coenodioecism"],"synonyms":["gynodioecy (related, but refers to hermaphrodites and females within the same species)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'coeno-' meaning 'common' or 'shared', 'dioecism' referring to 'two houses' or separate sexes.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsiːnoʊdaɪˈiːsɪzəm/","syllables":"co-e-no-di-o-e-cism"},"inflection":{"noun_plural":"coenodioecisms"},"usage_notes":{"explanation":"Coenodioecism is a specific type of plant breeding system. It is relatively rare compared to other breeding systems like dioecy (separate male and female plants) or hermaphroditism (individual plants having both male and female reproductive organs). The key feature is the presence of both hermaphrodites and exclusively female plants within the same population.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Coenodioecism is the same as dioecy.","correct":"✓ Coenodioecism involves both hermaphrodites and female plants, while dioecy involves separate male and female plants.","note":"Coenodioecism and dioecy are different breeding systems. Dioecy involves separate male and female plants, while coenodioecism involves hermaphrodites and female plants."}],"priority":"★★☆"},"related_words":{"derivatives":["coenodioecious (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coenodioecism' is a highly specialized term in botany and evolutionary biology, referring to a specific plant breeding system. Understanding it requires familiarity with plant reproductive strategies and terminology. The word is rarely encountered outside of academic or research contexts. It describes a population containing both hermaphroditic and female individuals, a condition less common than dioecy (separate sexes) or monoecy (separate male and female flowers on the same plant)."},"example_sentences":[{"sentence":"The evolution of coenodioecism from hermaphroditism is a topic of ongoing research.","translation":"雌雄同体から雌雄異株共存性への進化は、現在も研究が進められているテーマです。","type":"general","meaning_category":"evolutionary biology"},{"sentence":"In coenodioecious species, the proportion of female individuals can influence the overall reproductive success of the population.","translation":"雌雄異株共存性の種では、雌個体の割合が個体群全体の繁殖成功に影響を与える可能性があります。","type":"general","meaning_category":"plant reproduction"}]}