{"word":"mystico-religious","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"神秘的宗教の、神秘主義的宗教の","english_definition":"Combining or relating to both mystical and religious aspects or beliefs.","examples":[{"sentence":"The text explores the mystico-religious dimensions of ancient rituals.","translation":"そのテキストは古代儀式の神秘的宗教的側面を探求している。"},{"sentence":"His art reflects a deep mystico-religious sensibility.","translation":"彼の芸術は深い神秘的宗教的感受性を反映している。"}],"collocations":["mystico-religious experience","mystico-religious tradition","mystico-religious philosophy","mystico-religious beliefs"],"synonyms":["spiritual","esoteric","devotional","sacred","transcendental"],"antonyms":["secular","profane","materialistic"]}],"etymology":{"value":"Combination of 'mystical' (relating to mysticism) and 'religious' (relating to religion).","priority":"★★★"},"pronunciation":{"ipa":"ˌmɪstɪkoʊ rɪˈlɪdʒəs/","syllables":"mys-ti-co-re-li-gious"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Mystico-religious' is used to describe something that blends elements of both mysticism and religion. Mysticism often involves direct, personal experiences of the divine or ultimate reality, while religion typically involves organized systems of belief, rituals, and moral codes. The term suggests a synthesis of these two aspects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mystico-religious is not important to me.","correct":"✓ Mystico-religious themes are not important to me.","note":"'Mystico-religious' is an adjective, so it needs to modify a noun. It cannot stand alone as a subject."}],"priority":"★★☆"},"related_words":{"derivatives":["mysticism","religion","mystical","religious"],"phrases":["religious mysticism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'mystico-religious' is a compound adjective used to describe something that combines mystical and religious elements. It is typically used in academic or specialized contexts when discussing spirituality, philosophy, or comparative religion. Understanding the individual meanings of 'mystical' and 'religious' is essential to grasp the combined meaning."},"example_sentences":[{"sentence":"The scholar specialized in the study of mystico-religious movements in the Middle Ages.","translation":"その学者は中世の神秘的宗教運動の研究を専門としていた。","type":"general"},{"sentence":"The poem is filled with mystico-religious imagery and symbolism.","translation":"その詩は神秘的宗教的イメージと象徴に満ちている。","type":"literature"}]}