{"word":"electroretinography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"網膜電図検査法","english_definition":"The diagnostic test that measures the electrical activity of the retina in response to a light stimulus.","examples":[{"sentence":"Electroretinography is used to diagnose various retinal diseases.","translation":"網膜電図検査法は、様々な網膜疾患の診断に用いられる。"}],"collocations":["perform electroretinography (網膜電図検査を行う)","ERG (網膜電図検査の略称)"],"synonyms":["ERG (abbreviation)"],"antonyms":[]}],"etymology":{"value":"'electro-' (電気) + 'retina' (網膜) + '-graphy' (記録法)","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˌrɛtɪnˈɒɡrəfi/","syllables":"e-lec-tro-re-ti-nog-ra-phy"},"inflection":{"noun_plural":"electroretinographies"},"usage_notes":{"explanation":"Electroretinography (ERG) is a diagnostic test used to assess the function of the retina. It measures the electrical responses of various retinal cells, including photoreceptors (rods and cones), bipolar cells, and ganglion cells, when stimulated by light. The test is valuable in diagnosing a wide range of retinal disorders, such as retinitis pigmentosa, congenital stationary night blindness, and other inherited or acquired retinal diseases. Different types of ERG exist, including full-field ERG (also known as Ganzfeld ERG), multifocal ERG, and pattern ERG, each providing specific information about retinal function.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ electroretinography are important.","correct":"✓ electroretinography is important.","note":"Electroretinography is a singular noun referring to a process or technique, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["electroretinogram (網膜電図)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Electroretinography is a specialized medical term referring to a diagnostic test that measures the electrical activity of the retina. It is primarily used by medical professionals, particularly ophthalmologists and optometrists, to assess retinal function and diagnose various retinal diseases. Understanding of this term requires a strong background in medical terminology and physiology."},"example_sentences":[{"sentence":"The doctor recommended electroretinography to evaluate the patient's vision loss.","translation":"医師は患者の視力低下を評価するために網膜電図検査法を推奨した。","type":"general","meaning_category":"medical"},{"sentence":"Electroretinography can help differentiate between various types of retinal dystrophies.","translation":"網膜電図検査法は、様々な種類の網膜ジストロフィーを区別するのに役立つ。","type":"general","meaning_category":"medical"}]}