{"word":"unexonerated","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(人または行為が)無罪とされなかった、潔白が証明されなかった","english_definition":"not having been cleared of blame or wrongdoing; not having been proven innocent.","examples":[{"sentence":"Despite the evidence, he remained unexonerated in the public's eye.","translation":"証拠にもかかわらず、彼は世間から無罪と見なされなかった。"},{"sentence":"The wrongly convicted man died unexonerated, a tragic end to his life.","translation":"不当に有罪判決を受けた男は、潔白を証明されないまま亡くなり、彼の人生は悲劇的な結末を迎えた。"},{"sentence":"The case remains open, and the individual is still unexonerated.","translation":"事件は未解決のままであり、その人物は依然として潔白が証明されていない。"}],"collocations":["remain unexonerated","die unexonerated","be unexonerated"],"synonyms":["unvindicated","uncleared","unabsolved","unacquitted"],"antonyms":["exonerated","vindicated","cleared","absolved","acquitted"]}],"etymology":{"value":"Prefix 'un-' (not) + 'exonerated,' the past participle of 'exonerate.' 'Exonerate' comes from Latin 'exonerare,' meaning 'to relieve of a burden,' from 'ex-' (out of, from) + 'onus' (burden).","priority":"Medium"},"pronunciation":{"ipa":"/ʌnɪɡˈzɒnəˌreɪtɪd/","syllables":"un-ex-on-er-at-ed"},"inflection":{"notes":"Adjective; no specific inflectional forms beyond comparative/superlative (less common: more unexonerated, most unexonerated)."},"usage_notes":{"explanation":"'Unexonerated' signifies that a person or entity has not been formally cleared of accusations or suspicions. It implies a lack of official or public acknowledgment of innocence, even if doubts about guilt exist. It is often used in legal or journalistic contexts when discussing wrongful convictions or unresolved cases.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He was unexonerated from the crime.","correct":"He remained unexonerated. / He was not exonerated from the crime.","note":"'Unexonerated' is a state of *not* being exonerated, rather than an action. Therefore, it often appears with verbs like 'remain' or in passive constructions where 'exonerated' is negated."},{"incorrect":"The unexonerated evidence suggested his guilt.","correct":"The unexonerated man was suspected because of the evidence.","note":"'Unexonerated' describes a person or entity, not evidence. Evidence can *lead* to someone being unexonerated, but is not itself unexonerated."}],"priority":"Low"},"related_words":{"derivatives":["exonerate (verb: to clear from blame)","exoneration (noun: the act of clearing from blame)"],"phrasal_verbs":[],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Unexonerated' is a relatively rare and formal word. It means that someone has not been proven innocent of a crime or wrongdoing. It's often used in legal or journalistic contexts to describe cases where someone is suspected or convicted, but there's doubt about their guilt, and they haven't been officially cleared. You'll likely encounter it in news reports or legal documents."},"example_sentences":[{"sentence":"The documentary highlighted several cases of unexonerated prisoners.","translation":"そのドキュメンタリーでは、潔白が証明されていない囚人の事例がいくつか紹介された。","type":"adjective","meaning_category":"無罪とされなかった"},{"sentence":"His reputation suffered, even though he was never formally charged, and he remained unexonerated in the eyes of many.","translation":"彼は正式に起訴されなかったにもかかわらず、評判は損なわれ、多くの人の目には潔白が証明されないままだった。","type":"adjective","meaning_category":"潔白が証明されなかった"}]}