{"word":"probingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"探るように、詮索するように、根掘り葉掘り","english_definition":"in a manner that explores or examines thoroughly; inquisitively or penetratingly.","examples":[{"sentence":"She looked at him probingly, trying to gauge his reaction.","translation":"彼女は彼の反応を測ろうと、探るように彼を見つめた。"},{"sentence":"The detective questioned the suspect probingly, searching for inconsistencies in his story.","translation":"刑事は容疑者の話を根掘り葉掘り尋問し、矛盾点を探した。"},{"sentence":"The scientist examined the data probingly, seeking to uncover any hidden patterns.","translation":"科学者は隠されたパターンを見つけようと、データを探るように調べた。"}],"collocations":["look probingly","question probingly","examine probingly","investigate probingly"],"synonyms":["inquisitively","penetratingly","searchingly","thoroughly","intently","closely","critically","analytically"],"antonyms":["superficially","cursorily","casually","perfunctorily"]}],"etymology":{"value":"Derived from the verb 'probe,' meaning to explore or examine something, especially with an instrument or tool. The suffix '-ingly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊbɪŋli/","syllables":"pro-bing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Probingly' describes an action done in a way that seeks to uncover information or understand something deeply. It implies a thorough and often intense examination. It is often used to describe the manner of questioning, looking, or examining something.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He probingly felt happy about the results.","correct":"✓ He felt happy about the results.","note":"'Probingly' should describe an action of investigation or examination, not a state of feeling."},{"incorrect":"✗ She probingly cleaned the room.","correct":"✓ She thoroughly cleaned the room.","note":"Use 'thoroughly' or 'carefully' instead of 'probingly' when describing cleaning or similar actions that require completeness but not necessarily investigation."}],"priority":"★★☆"},"related_words":{"derivatives":["probe (verb, noun)","probing (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Probingly' is an adverb that means to do something in a way that explores or examines it very carefully and thoroughly. It suggests a deep and intense investigation, often to uncover hidden information or understand something complex. This word is not commonly used in everyday conversation and is more often found in formal writing or specialized contexts."},"example_sentences":[{"sentence":"The journalist interviewed the politician probingly about the corruption allegations.","translation":"ジャーナリストは政治家に汚職疑惑について根掘り葉掘り質問した。","type":"example"},{"sentence":"The doctor looked at the X-ray probingly, searching for any signs of abnormality.","translation":"医師はX線写真を異常の兆候がないか探るように見た。","type":"example"},{"sentence":"The committee investigated the matter probingly to determine the cause of the accident.","translation":"委員会は事故の原因を究明するため、その件について徹底的に調査した。","type":"example"}]}