{"word":"musnud","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)ムスナド、王座、玉座 (特にインドのイスラム教支配者のもの)","english_definition":"(historical) a term used in India for an elevated place where a person of rank sat, especially the throne of a Muslim ruler.","examples":[{"sentence":"The king ascended the musnud to address his court.","translation":"王は廷臣に演説するためにムスナドに登った。"},{"sentence":"The musnud was richly decorated with jewels and gold.","translation":"そのムスナドは宝石と金で豪華に飾られていた。"}],"collocations":["ascend the musnud","sit on the musnud","royal musnud","decorated musnud"],"synonyms":["throne","seat of power","gaddi","raj gaddi"],"antonyms":["footstool","ground"],"notes":"Often associated with Mughal or other Islamic rulers in India."}],"etymology":{"value":"From Urdu and Persian 'masnad' (مسند), meaning 'supported, leaned upon, throne, cushion', derived from Arabic 'masnad' (مَسْنَد) meaning 'support, document, authority'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌsnəd/","syllables":"mus-nud"},"inflection":{"noun_plural":"musnuds"},"usage_notes":{"explanation":"'Musnud' is a historical term mainly used in the context of Indian history, particularly when referring to the seats of power of Muslim rulers. It is more specific than a general 'throne' and carries cultural and historical connotations related to the Mughal Empire and other Islamic dynasties in India.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sat on the chair, which was his musnud.","correct":"✓ He sat on the musnud.","note":"'Musnud' refers specifically to a throne-like seat of power, not just any chair."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["Mughal Empire","throne","gaddi","raj","durbar"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'musnud' is a specialized historical term primarily used in the context of the Mughal Empire and other Islamic rulers in India. It refers specifically to the throne or elevated seat of power used by these rulers. Due to its specific historical and cultural context, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The emperor's authority was symbolized by the magnificent musnud.","translation":"皇帝の権威は、壮大なムスナドによって象徴されていた。","type":"noun","meaning_category":"王座"},{"sentence":"Succession to the musnud was often a cause of conflict among the princes.","translation":"ムスナドの継承は、しばしば王子たちの間の紛争の原因となった。","type":"noun","meaning_category":"王座"}]}