{"word":"schema-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"スキーマ駆動の、スキーマに基づいて動作する","english_definition":"Relating to or characterized by a process or system that is driven or controlled by a schema, typically a data schema or XML schema.","examples":[{"sentence":"The application is schema-driven, meaning that its behavior is determined by the XML schema.","translation":"このアプリケーションはスキーマ駆動型であり、その動作はXMLスキーマによって決定されます。"},{"sentence":"A schema-driven approach ensures data consistency and validation.","translation":"スキーマ駆動のアプローチは、データの一貫性と検証を保証します。"},{"sentence":"Schema-driven development can improve code maintainability.","translation":"スキーマ駆動開発は、コードの保守性を向上させることができます。"}],"collocations":["schema-driven architecture","schema-driven design","schema-driven validation","schema-driven application","schema-driven development"],"synonyms":["schema-based","metadata-driven"],"antonyms":["code-driven","imperative"],"notes":["Often used in the context of software development, data management, and XML processing."]}],"etymology":{"value":"Combination of 'schema' (a structured framework or plan) and 'driven' (propelled or controlled by something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskiːmə ˌdrɪvən/","syllables":"sche-ma-dri-ven"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Schema-driven' describes a system or process where the structure, behavior, or validation is governed by a schema (a formal description of data structure). This approach promotes standardization, data integrity, and often simplifies development by separating data definition from application logic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is schema driven.","correct":"✓ The data is schema-validated. / ✓ The application is schema-driven.","note":"Data itself is not schema-driven; it is validated against a schema. The *application* or *process* is schema-driven."}],"priority":"★★☆"},"related_words":{"derivatives":["schema","driven"],"related_terms":["XML schema","data schema","schema validation","schema definition","metadata"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Schema-driven' is a technical term used in computer science and software engineering. It describes a system or application whose behavior and structure are controlled by a schema. A schema is a formal description of the structure of data. Understanding this term requires familiarity with concepts like data modeling, XML, and software architecture."},"example_sentences":[{"sentence":"The schema-driven approach allows for easy modification of the data structure without changing the application code.","translation":"スキーマ駆動のアプローチにより、アプリケーションコードを変更せずにデータ構造を簡単に変更できます。","type":"general","meaning_category":"General"},{"sentence":"The schema-driven validation ensures that only valid data is stored in the database.","translation":"スキーマ駆動の検証により、有効なデータのみがデータベースに保存されます。","type":"technical","meaning_category":"Data Validation"},{"sentence":"We adopted a schema-driven architecture to improve the maintainability of our system.","translation":"システムの保守性を向上させるために、スキーマ駆動アーキテクチャを採用しました。","type":"architectural","meaning_category":"Software Architecture"}]}