{"word":"floscule","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"小花、特にキク科植物の頭状花を構成する個々の小さな花","english_definition":"A small flower, especially one of the individual flowers forming the head of a composite plant such as a daisy.","examples":[{"sentence":"Each floscule in the sunflower head is a perfect, tiny flower.","translation":"ヒマワリの頭状花の中のそれぞれの小花は、完璧で小さな花です。"},{"sentence":"The disk florets, or floscules, are located in the center of the flower head.","translation":"筒状花、または小花は、頭状花の中心に位置しています。"}],"collocations":["disk floscule","ray floscule"],"synonyms":["floret","floweret"],"antonyms":[]}],"etymology":{"value":"ラテン語の *flosculus* (小さな花) から派生。*flos* (花) の指小辞。","priority":"★★☆"},"pronunciation":{"ipa":"ˈflɒskjuːl","syllables":"flos-cule"},"inflection":{"noun_plural":"floscules"},"usage_notes":{"explanation":"\"Floscule\" は、特にキク科植物（ヒマワリ、デイジーなど）の頭状花序を構成する個々の小さな花を指す専門用語です。一般的な会話ではあまり使われませんが、植物学や園芸学の分野では用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The floscule was very big and showy.","correct":"✓ The floscule was very small and delicate.","note":"Floscules are by definition small flowers. Describing them as big is contradictory."}],"priority":"★☆☆"},"related_words":{"derivatives":["floscular (形容詞: 小花の、小花状の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"floscule\" is a specialized botanical term. It refers to the small, individual flowers that make up the flower head of composite plants like daisies and sunflowers. This word is rarely used outside of botanical or horticultural contexts. Understanding this word requires a strong vocabulary and familiarity with botanical terminology."},"example_sentences":[{"sentence":"The intricate arrangement of floscules in the daisy creates a beautiful pattern.","translation":"ヒナギクの小花の複雑な配置は、美しい模様を作り出します。","type":"noun","meaning_category":"小花"},{"sentence":"Each tiny floscule contributes to the overall beauty of the composite flower.","translation":"それぞれの小さな小花が、複合花の全体的な美しさに貢献しています。","type":"noun","meaning_category":"小花"}]}