{"word":"beautydom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"美の世界、美の領域、美しさの支配","english_definition":"The realm or sphere of beauty; the state of being beautiful. Often used to refer to the world of beauty pageants, cosmetics, and fashion.","examples":[{"sentence":"She entered the world of beautydom at a young age, participating in local pageants.","translation":"彼女は若い頃から美の世界に入り、地元の美人コンテストに参加した。"},{"sentence":"The magazine explores the latest trends in beautydom.","translation":"その雑誌は美の世界の最新トレンドを探求している。"},{"sentence":"He found himself strangely drawn to the superficiality of beautydom.","translation":"彼は奇妙なことに美の世界の表面的な部分に惹かれていることに気づいた。"}],"collocations":["enter beautydom (美の世界に入る)","the world of beautydom (美の世界)","the superficiality of beautydom (美の世界の表面的な部分)"],"synonyms":["beauty","aesthetic realm","world of aesthetics"],"antonyms":["ugliness","hideousness"]}],"etymology":{"value":"'Beauty' + '-dom'. The suffix '-dom' is used to denote a state, condition, or dominion. Thus, 'beautydom' refers to the realm or state associated with beauty.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbjuːtiːdəm/","syllables":"beau-ty-dom"},"inflection":{"noun_plural":"beautydoms"},"usage_notes":{"explanation":"'Beautydom' is not a commonly used word, but it is understood to refer to the world or realm of beauty. It can be used in a neutral or critical way, depending on the context. It often implies a superficial or artificial aspect of beauty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a citizen of beautydom.","correct":"✓ She is involved in the world of beautydom.","note":"'Beautydom' refers to a realm or sphere, not a country or citizenship. Use phrases like 'involved in the world of beautydom' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["beauty (noun)","beautiful (adjective)"],"related_concepts":["beauty pageant","cosmetics industry","fashion industry","aesthetics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. The word is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Beautydom' is a relatively uncommon word, used to describe the realm or world of beauty, often with connotations of superficiality or artificiality. Understanding the suffix '-dom' as indicating a state or dominion helps in grasping the word's meaning. Due to its infrequent usage, it is more likely to be encountered in specialized contexts or literature exploring themes of beauty and appearance."},"example_sentences":[{"sentence":"The documentary explored the darker side of beautydom, revealing the pressures faced by contestants.","translation":"そのドキュメンタリーは美の世界の暗い側面を探求し、出場者が直面するプレッシャーを明らかにした。","type":"general usage","meaning_category":"美の世界"},{"sentence":"She dreamed of escaping her ordinary life and entering the glamorous world of beautydom.","translation":"彼女は平凡な生活から抜け出し、華やかな美の世界に入ることを夢見ていた。","type":"aspiration","meaning_category":"美の世界"},{"sentence":"The rise of social media has significantly reshaped the landscape of beautydom.","translation":"ソーシャルメディアの台頭は、美の世界の様相を大きく変えた。","type":"impact of social media","meaning_category":"美の世界"}]}