{"word":"classicisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"古典主義、古典主義的特徴、古典主義的表現","english_definition":"adherence to or imitation of ancient Greek or Roman principles in art, architecture, literature, etc.; a classical idiom, trait, or usage.","examples":[{"sentence":"The painting is filled with classicisms, such as the use of mythological figures and balanced composition.","translation":"その絵画は、神話の人物の使用や均衡の取れた構成など、古典主義的な特徴に満ち溢れている。"},{"sentence":"His writing style is marked by classicisms, reflecting his deep knowledge of ancient literature.","translation":"彼の文体は、古代文学への深い知識を反映して、古典主義的な表現が際立っている。"}],"collocations":["literary classicisms (文学的な古典主義)","artistic classicisms (芸術的な古典主義)","architectural classicisms (建築における古典主義)","rhetorical classicisms (修辞的な古典主義)"],"synonyms":["classicality","classicism","neoclassicism","archaism"],"antonyms":["romanticism","modernism","avant-gardism"]}],"etymology":{"value":"\"classicism\" は、\"classic\"（第一級の、古典的な）に由来し、さらにラテン語の \"classicus\"（最上級の市民、一流の作家）に遡る。接尾辞 \"-ism\" は、主義・傾向・特徴を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklæsɪsɪzəmz/","syllables":"clas-si-cis-ms"},"inflection":{"noun_plural":"classicisms"},"usage_notes":{"explanation":"\"classicisms\" は、古典古代（特に古代ギリシャ・ローマ）の芸術、文学、建築などの原則や様式を模倣または参照する傾向や特徴を指す。単数形の \"classicism\" は、より一般的な古典主義の概念を指すのに対し、複数形の \"classicisms\" は、特定の古典主義的な要素や表現の具体的な例を指すことが多い。例えば、特定の作品やスタイルに見られる古典的なモチーフ、比喩、形式などを指す際に用いられる。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The novel used many classicism.","correct":"✓ The novel used many classicisms.","note":"可算名詞として使用する場合、複数形の \"classicisms\" が正しい。単数形の \"classicism\" は、古典主義という概念全体を指す。"},{"incorrect":"✗ He is a classicisms artist.","correct":"✓ He is a classicist artist.","note":"古典主義の芸術家を指す場合は、\"classicist\" (古典主義者) を使用する。\"classicisms\" は名詞であり、形容詞としては使用できない。"}],"priority":"★★☆"},"related_words":{"derivatives":["classic (形容詞: 古典的な、第一級の; 名詞: 古典)","classical (形容詞: 古典的な、クラシックの)","classicist (名詞: 古典主義者)","classicize (動詞: 古典的にする)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Classicisms\" refers to the use of elements inspired by ancient Greek and Roman art, literature, and architecture. It's a term used to describe specific instances where these classical influences are evident. For example, a painting might feature mythological figures or a building might incorporate classical columns. The word is most often used in academic or specialized contexts when discussing art history, literary analysis, or architectural styles. It implies a conscious effort to emulate or reference the aesthetics and principles of classical antiquity."},"example_sentences":[{"sentence":"The architect incorporated several classicisms into the design of the new museum, including Doric columns and a pediment.","translation":"建築家は、ドーリア式の円柱やペディメントなど、いくつかの古典主義的な特徴を新しい美術館のデザインに取り入れた。","type":"noun","meaning_category":"古典主義的特徴"},{"sentence":"The author's use of rhetorical classicisms, such as anaphora and antithesis, added a layer of sophistication to the speech.","translation":"作者がアナフォラやアンチテーゼといった修辞的な古典主義的表現を用いたことで、スピーチに洗練された趣が加わった。","type":"noun","meaning_category":"古典主義的表現"},{"sentence":"The play is full of literary classicisms, such as references to Greek mythology and the use of iambic pentameter.","translation":"その劇は、ギリシャ神話への言及や弱強五歩格の使用など、文学的な古典主義に満ちている。","type":"noun","meaning_category":"古典主義的特徴"}]}