{"word":"satrapate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) サトラップの支配地、州","english_definition":"The province governed by a satrap.","examples":[{"sentence":"The Persian Empire was divided into satrapates.","translation":"ペルシャ帝国はサトラップの支配地に分割されていた。"}],"collocations":["govern a satrapate","administer a satrapate"],"synonyms":["province","governorate","region"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word 'satrapeia' (σατραπεία), which comes from the Old Persian word 'xšaçapāvan-' (protector of the province).","priority":"★★★"},"pronunciation":{"ipa":"ˈsætrəpeɪt","syllables":"sa-tra-pate"},"inflection":{"noun_plural":"satrapates"},"usage_notes":{"explanation":"The term 'satrapate' is primarily used in historical contexts, specifically when discussing ancient empires like the Achaemenid (Persian) Empire. It refers to the territory governed by a satrap, who was a provincial governor in these empires.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived in a satrap.","correct":"✓ He lived in a satrapate.","note":"'Satrapy' is sometimes used informally as a synonym, but 'satrapate' is the more precise term for the territory. 'Satrapy' can also refer to the office or position of a satrap."}],"priority":"★★☆"},"related_words":{"derivatives":["satrap (noun: A provincial governor in the ancient Persian Empire.)","satrapic (adjective: Relating to a satrap or satrapy.)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'satrapate' is a specialized term used in historical contexts, particularly when discussing ancient empires like the Persian Empire. It refers to the province or territory governed by a satrap, who was a high-ranking official. Due to its specific and historical usage, it is not commonly encountered in everyday language and is more likely to appear in academic or historical texts."},"example_sentences":[{"sentence":"The satrapate of Bactria was known for its fertile lands.","translation":"バクトリアのサトラップ領は肥沃な土地で知られていた。","type":"noun","meaning_category":"支配地"},{"sentence":"The satrap had considerable power within his satrapate.","translation":"サトラップは自身のサトラップ領内でかなりの権力を持っていた。","type":"noun","meaning_category":"支配地"}]}