{"word":"Masochists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"被虐性愛者、マゾヒスト","english_definition":"People who derive sexual gratification from their own pain or humiliation.","examples":[{"sentence":"Masochists may enjoy activities like being spanked or tied up.","translation":"被虐性愛者は、叩かれたり縛られたりするような行為を楽しむことがあります。"},{"sentence":"Some masochists engage in consensual BDSM activities.","translation":"一部の被虐性愛者は、合意に基づくボンデージ・規律・サディズム・マゾヒズム（BDSM）活動に従事します。"}],"collocations":["BDSM masochists","sexual masochists","consensual masochists"],"synonyms":["submissives","pain lovers"],"antonyms":["sadists"]},{"part_of_speech":"noun","definition":"苦痛や屈辱を好む人（性的でない意味で）","english_definition":"People who enjoy activities that appear to be painful or unpleasant.","examples":[{"sentence":"He must be a masochist to run a marathon in this heat.","translation":"この暑さの中でマラソンを走るなんて、彼は苦痛を好む人に違いない。"},{"sentence":"Only a masochist would volunteer for that job.","translation":"あの仕事に志願するなんて、苦痛を好む人だけだろう。"}],"collocations":["economic masochists","political masochists"],"synonyms":["self-flagellators","martyrs"],"antonyms":["hedonists"]}],"etymology":{"value":"The term comes from the name of Austrian author Leopold von Sacher-Masoch, whose novels described characters who enjoyed being dominated and experiencing pain.","priority":"★★★"},"pronunciation":{"ipa":"ˈmæsəkɪsts","syllables":"mas-o-chists"},"inflection":{"noun_plural":"Masochists"},"usage_notes":{"explanation":"The term 'masochist' is often used in a sexual context to describe individuals who derive pleasure from pain or humiliation. However, it can also be used in a non-sexual context to describe someone who seems to enjoy or seek out unpleasant experiences. It is important to use the term respectfully and avoid making assumptions about someone's sexual preferences or behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a masochist because he is always sad.","correct":"✓ He is a masochist because he enjoys being humiliated.","note":"Masochism involves deriving pleasure from pain or humiliation, not simply being sad."},{"incorrect":"✗ Masochists are always victims of abuse.","correct":"✓ Masochists may engage in consensual activities involving pain and humiliation.","note":"Masochism often involves consensual activities and should not be equated with abuse."}],"priority":"★★☆"},"related_words":{"derivatives":["masochism","masochistic"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'masochists' refers to individuals who derive pleasure, often sexual, from experiencing pain or humiliation. It can also be used more broadly to describe someone who seems to enjoy unpleasant or difficult experiences. The term originates from the writings of Leopold von Sacher-Masoch. It's important to use this word with sensitivity, as it can be associated with complex and potentially sensitive topics.","priority":"★★☆"},"example_sentences":[{"sentence":"Some **masochists** find pleasure in consensual pain during sexual activities.","translation":"一部の被虐性愛者は、性行為中の合意に基づく痛みの中に喜びを見出します。","type":"noun","meaning_category":"sexual gratification"},{"sentence":"Only a **masochist** would enjoy cleaning the entire house on a Sunday.","translation":"日曜日に家全体を掃除するのを楽しむのは、苦痛を好む人だけだろう。","type":"noun","meaning_category":"enjoying unpleasant activities"}]}