{"word":"coenamored","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having a strong liking or fondness for dining together; enjoying shared meals.","english_definition":"Having a strong liking or fondness for dining together; enjoying shared meals.","examples":[{"sentence":"They were a coenamored couple, always eager to share a meal and conversation.","translation":"彼らは食を共にすることを愛するカップルで、いつも食事と会話を分かち合うことを楽しみにしていた。"},{"sentence":"The coenamored friends planned weekly dinners to stay connected.","translation":"食を共にすることを愛する友人たちは、繋がりを保つために毎週の夕食を計画した。"}],"collocations":["coenamored couple","coenamored friends","coenamored group","coenamored gathering"],"synonyms":["convivial","gregarious","sociable","food-loving","epicurean"],"antonyms":["unsociable","reclusive","misanthropic"]}],"etymology":{"value":"A blend of \"coen-\" (from Greek \"koinos\" meaning \"common, shared\") and \"enamored\" (meaning \"filled with love or fondness\"). The term suggests a fondness for shared dining experiences.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsiːˈnæmərd/","syllables":"co-e-nam-ored"},"inflection":{"notes":"This is an adjective, so it can be used to describe nouns. Comparative and superlative forms (more coenamored, most coenamored) are possible but rare."},"usage_notes":{"explanation":"The word 'coenamored' is relatively rare and not widely recognized. It is used to describe individuals or groups who have a strong fondness for dining together and enjoying shared meals. It emphasizes the social and communal aspect of eating.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are coenamored each other.","correct":"✓ They are coenamored. / ✓ They are coenamored of dining together.","note":"'Coenamored' is an adjective, not a verb, so it doesn't take a direct object like 'each other'. Use it to describe the subject or with 'of' to specify what they are fond of."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a standard CEFR word)","frequency_google_ngram":"Very low frequency - a neologism or rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coenamored' is a niche word that combines the concept of shared experiences ('coen-') with a strong liking or fondness ('enamored'). It describes someone who greatly enjoys dining and sharing meals with others, emphasizing the social and communal aspects of eating. Due to its specialized nature, it is not a common word and is more likely to be encountered in specific contexts related to food culture or social dining. "},"example_sentences":[{"sentence":"The restaurant catered to coenamored groups seeking a communal dining experience.","translation":"そのレストランは、共同の食事体験を求める食を共にすることを愛するグループに対応していた。","type":"adjective","meaning_category":"Fond of dining together"},{"sentence":"Their coenamored nature made them perfect hosts for dinner parties.","translation":"彼らの食を共にすることを愛する性質が、彼らを夕食会の完璧なホストにした。","type":"adjective","meaning_category":"Enjoying shared meals"}]}