{"word":"perturbability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"動揺しやすさ、かき乱されやすさ、興奮しやすさ","english_definition":"The quality or state of being easily perturbed; susceptibility to being disturbed or agitated.","examples":[{"sentence":"His lack of perturbability made him an excellent negotiator.","translation":"彼の動じない性格は、彼を優れた交渉者にした。"},{"sentence":"The patient's high perturbability was a concern for the medical staff.","translation":"患者の動揺しやすさは、医療スタッフにとって懸念事項だった。"},{"sentence":"The system's perturbability was tested under various stress conditions.","translation":"そのシステムの動揺しやすさは、さまざまなストレス条件下でテストされた。"}],"collocations":["high perturbability (高い動揺しやすさ)","low perturbability (低い動揺しやすさ)","emotional perturbability (感情的な動揺しやすさ)","system perturbability (システムの動揺しやすさ)"],"synonyms":["excitability","sensitivity","susceptibility","volatility","irritability","agitation"],"antonyms":["imperturbability","composure","equanimity","calmness","serenity","aplomb"]}],"etymology":{"value":"From 'perturb' (to disturb greatly; make uneasy or anxious) + '-ability' (suffix indicating capacity or tendency).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌtɜːrbəˈbɪləti/","syllables":"per-tur-ba-bil-i-ty"},"inflection":{"noun_plural":"perturbabilities (rarely used)"},"usage_notes":{"explanation":"'Perturbability' refers to the degree to which something or someone is easily disturbed, agitated, or made anxious. It is often used in contexts related to emotional stability, system resilience, or psychological sensitivity. The term is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perturbability of the situation caused anxiety.","correct":"✓ The perturbing nature of the situation caused anxiety.","note":"'Perturbability' is a noun describing a quality, not an adjective. Use 'perturbing' as an adjective to describe something that causes disturbance."},{"incorrect":"✗ He showed great perturbability during the crisis.","correct":"✓ He showed great agitation during the crisis.","note":"While technically correct, 'perturbability' is less common than simpler synonyms like 'agitation' or 'anxiety' when describing a person's state."}],"priority":"★★☆"},"related_words":{"derivatives":["perturb (verb: to disturb greatly)","perturbed (adjective: anxious or unsettled)","perturbation (noun: anxiety; a deviation of a system)","imperturbable (adjective: not easily disturbed)","imperturbability (noun: the state of being imperturbable)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Perturbability' is a formal and uncommon term that describes how easily something can be disturbed or agitated. It's often used in technical or academic contexts when discussing the stability or sensitivity of systems or individuals. Because it's not a word you'd typically use in everyday conversation, it's considered advanced vocabulary."},"example_sentences":[{"sentence":"The robot's design aimed to minimize its environmental perturbability.","translation":"そのロボットの設計は、環境による動揺しやすさを最小限に抑えることを目的としていた。","type":"noun","meaning_category":"動揺しやすさ (system)"},{"sentence":"Her low perturbability allowed her to remain calm under pressure.","translation":"彼女の低い動揺しやすさのおかげで、プレッシャーの下でも冷静さを保つことができた。","type":"noun","meaning_category":"動揺しやすさ (person)"},{"sentence":"Researchers studied the perturbability of the ecosystem after the oil spill.","translation":"研究者たちは、原油流出後の生態系の動揺しやすさを調査した。","type":"noun","meaning_category":"動揺しやすさ (ecosystem)"}]}