{"word":"alienasi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Keterasingan; keadaan atau perasaan terasing dari orang lain, masyarakat, atau lingkungan.","english_definition":"The state or experience of being isolated from a group or an activity to which one should belong or in which one should be involved.","examples":[{"sentence":"Alienasi sosial dapat menyebabkan masalah kesehatan mental.","translation":"Social alienation can lead to mental health problems."},{"sentence":"Banyak pekerja pabrik merasakan alienasi karena pekerjaan mereka yang monoton.","translation":"Many factory workers feel alienation due to their monotonous work."},{"sentence":"Alienasi dari budaya sendiri dapat terjadi ketika seseorang tinggal di negara asing untuk waktu yang lama.","translation":"Alienation from one's own culture can occur when someone lives in a foreign country for a long time."}],"collocations":["alienasi sosial","merasakan alienasi","penyebab alienasi","mengatasi alienasi"],"synonyms":["keterasingan","pengasingan","isolasi","pemencilan"],"antonyms":["keakraban","keterlibatan","integrasi","persatuan"]}],"etymology":{"value":"Berasal dari kata 'alienate' yang berarti 'mengasingkan' atau 'membuat merasa asing'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌali.eˈna.si/","syllables":"a-li-e-na-si"},"inflection":{"notes":"Ini adalah kata benda (noun)."},"usage_notes":{"explanation":"Kata 'alienasi' sering digunakan dalam konteks sosiologi, psikologi, dan politik untuk menggambarkan perasaan terputus atau tidak terhubung dengan orang lain, masyarakat, pekerjaan, atau bahkan diri sendiri. Ini bisa menjadi pengalaman yang sangat negatif dan merusak.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Dia mengalami alienasi dari keluarganya karena dia pindah ke kota lain.","correct":"Dia mengalami alienasi dengan keluarganya karena dia pindah ke kota lain.","note":"Meskipun 'dari' dapat digunakan, 'dengan' lebih umum digunakan untuk menunjukkan hubungan antara seseorang dan sumber alienasi."}],"priority":"N/A"},"related_words":{"derivatives":["mengalienasi (verb: to alienate)","teralienasi (adjective: alienated)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"frequency_google_ngram":"Cukup sering digunakan dalam teks akademis dan berita.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"Kata 'alienasi' adalah kata yang relatif formal yang digunakan untuk menggambarkan perasaan terasing atau terputus dari sesuatu atau seseorang. Ini sering digunakan dalam diskusi tentang masyarakat, politik, dan psikologi. Memahami kata ini penting untuk memahami teks-teks yang membahas topik-topik ini."},"example_sentences":[{"sentence":"Perasaan alienasi dapat diatasi dengan mencari dukungan sosial.","translation":"Feelings of alienation can be overcome by seeking social support.","type":"noun","meaning_category":"Keterasingan"},{"sentence":"Kebijakan pemerintah dapat menyebabkan alienasi masyarakat jika tidak mempertimbangkan kebutuhan mereka.","translation":"Government policies can lead to public alienation if they do not consider their needs.","type":"noun","meaning_category":"Keterasingan"}]}