{"word":"serovar-restricted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"血清型限定性の、特定の血清型に限定された","english_definition":"Limited to or specific to a particular serovar. A serovar is a distinct variation within a species of bacteria or virus or among immune cells of different individuals. These microorganisms, viruses, or cells are classified together based on their surface antigens.","examples":[{"sentence":"The PCR assay is serovar-restricted, only detecting certain Salmonella serovars.","translation":"そのPCRアッセイは血清型限定性であり、特定のサルモネラ血清型のみを検出する。"},{"sentence":"Serovar-restricted antibodies were developed to target a specific strain of the virus.","translation":"特定のウイルス株を標的とするために、血清型限定性抗体が開発された。"}],"collocations":["serovar-restricted antibody","serovar-restricted PCR","serovar-restricted vaccine"],"synonyms":["serotype-specific","strain-specific"],"antonyms":["broad-spectrum","serovar-independent"]}],"etymology":{"value":"Derived from 'serovar' (serological variant) and 'restricted' (limited or confined).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɪəroʊˌvɑːr rɪˈstrɪktɪd/","syllables":"se-ro-var re-strict-ed"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'serovar-restricted' is commonly used in microbiology, immunology, and related fields to describe assays, antibodies, or vaccines that are effective against only a specific serovar of a pathogen. This specificity is due to the unique surface antigens present on that particular serovar.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The vaccine is serovar restricted to all strains.","correct":"✓ The vaccine is serovar-restricted to a single strain.","note":"'Serovar-restricted' implies specificity, so it cannot apply to 'all' strains. It should be used when referring to a limited number of serovars or a single serovar."}],"priority":"N/A"},"related_words":{"derivatives":["serovar","serotype","strain","antigen","specificity"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term used in scientific literature.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Serovar-restricted' is a technical term used in specialized fields like microbiology and immunology. It means that something, like a test or a treatment, only works for a specific type of bacteria or virus (called a serovar). Understanding this term requires knowledge of serology and microbial classification. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The diagnostic test is serovar-restricted, meaning it can only identify a few specific types of the bacteria.","translation":"その診断検査は血清型限定性であり、特定の種類の細菌しか識別できないことを意味する。","type":"adjective","meaning_category":"Specificity"},{"sentence":"A serovar-restricted vaccine may not offer protection against emerging variants of the pathogen.","translation":"血清型限定性ワクチンは、出現する病原体の変異株に対して防御を提供しない可能性がある。","type":"adjective","meaning_category":"Limitation"}]}