{"word":"gneissoid-granite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"片麻状花崗岩","english_definition":"A type of granite that has a gneiss-like texture, meaning it exhibits a banded or foliated structure due to the alignment of mineral grains.","examples":[{"sentence":"The mountain was composed of gneissoid-granite.","translation":"その山は片麻状花崗岩で構成されていた。"},{"sentence":"The geologist identified the rock sample as gneissoid-granite.","translation":"地質学者はその岩石サンプルを片麻状花崗岩と特定した。"}],"collocations":["gneissoid granite formation","gneissoid granite outcrop","gneissoid granite texture"],"synonyms":["banded granite","foliated granite"],"antonyms":[]}],"etymology":{"value":"The term is a combination of 'gneissoid' (resembling gneiss, a metamorphic rock with banded texture) and 'granite' (an igneous rock with visible grains).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪsɔɪd ˈɡrænɪt/","syllables":"gneiss-oid-gran-ite"},"inflection":{"noun_plural":"gneissoid-granites"},"usage_notes":{"explanation":"Gneissoid-granite is a specific type of granite that has undergone some degree of metamorphism or deformation, resulting in a banded or foliated appearance. This banding is caused by the alignment of minerals, typically feldspar, quartz, and mica.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was gneiss, not gneissoid-granite.","correct":"✓ The rock was gneissoid-granite, exhibiting both granitic and gneissic characteristics.","note":"Gneiss and gneissoid-granite are different. Gneiss is a metamorphic rock, while gneissoid-granite is a type of granite with a gneiss-like texture."}],"priority":"★☆☆"},"related_words":{"derivatives":["gneiss","granite","gneissose"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gneissoid-granite' is a technical term used in geology to describe a specific type of rock. It requires a background in geology to fully understand its meaning, as it combines characteristics of both granite (an igneous rock) and gneiss (a metamorphic rock). The term is not commonly used outside of geological contexts."},"example_sentences":[{"sentence":"The quarry extracted large blocks of gneissoid-granite for building materials.","translation":"その採石場は建築資材として片麻状花崗岩の大きな塊を採掘した。","type":"noun","meaning_category":"rock type"},{"sentence":"The gneissoid-granite in this region is known for its unique mineral composition.","translation":"この地域の片麻状花崗岩は、その独特な鉱物組成で知られている。","type":"noun","meaning_category":"geology"}]}