{"word":"Cutcherry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド)事務所、官庁、裁判所","english_definition":"(in India) an office, a court of justice, or a public building where official business is conducted.","examples":[{"sentence":"The cutcherry was bustling with activity as officials processed paperwork.","translation":"官庁は、職員が書類を処理するにつれて活気に満ちていた。"},{"sentence":"He had to appear at the cutcherry to resolve the land dispute.","translation":"彼は土地紛争を解決するために裁判所に出廷しなければならなかった。"}],"collocations":["appear at the cutcherry","visit the cutcherry","the local cutcherry"],"synonyms":["office","court","government building","public office"],"antonyms":[]},{"part_of_speech":"noun","definition":"(インド)事務所、官庁の長","english_definition":"(in India) the head of an office or public building.","examples":[{"sentence":"The cutcherry was responsible for overseeing the district's administrative affairs.","translation":"官庁の長は、地区の行政事務を監督する責任があった。"}],"collocations":["the cutcherry is responsible","the cutcherry oversees"],"synonyms":["head of office","administrator","chief officer"],"antonyms":[]}],"etymology":{"value":"From Hindi कचहरी (kacahrī) / Urdu کچہری (kacahrī), from Prakrit कच्चहरी (kacchaharī), from Sanskrit कक्षगृह (kakṣagṛha, “roomed house”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌtʃəri/","syllables":"cut-che-ry"},"inflection":{"noun_plural":"cutcherries"},"usage_notes":{"explanation":"'Cutcherry' is a term primarily used in the context of historical or present-day India and refers to a place where official or governmental business is conducted. It can refer to the building itself or the office/court located within. The term is less commonly used outside of South Asia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the cutcherry to buy groceries.","correct":"✓ I went to the market to buy groceries.","note":"'Cutcherry' is a government or administrative office, not a place for shopping."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cutcherry' is specialized vocabulary related to the administrative and legal systems of India. It is unlikely to be encountered in general English usage and would primarily be understood by those familiar with Indian history, culture, or legal systems."},"example_sentences":[{"sentence":"The villagers gathered outside the cutcherry, awaiting the magistrate's decision.","translation":"村人たちは治安判事の決定を待って、官庁の外に集まった。","type":"noun","meaning_category":"office/court"},{"sentence":"All land records are meticulously maintained at the district cutcherry.","translation":"すべての土地記録は、地区の官庁で綿密に維持されている。","type":"noun","meaning_category":"office/court"}]}