{"word":"presuffrage","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"参政権獲得以前の、選挙権付与以前の","english_definition":"Existing or occurring before the achievement or granting of suffrage (the right to vote).","examples":[{"sentence":"The presuffrage era was marked by significant activism for women's rights.","translation":"参政権獲得以前の時代は、女性の権利のための重要な活動によって特徴づけられていた。"},{"sentence":"Presuffrage literature often depicted the struggles faced by women seeking political representation.","translation":"選挙権獲得以前の文学は、政治的代表を求める女性たちが直面した苦闘を描写することが多かった。"}],"collocations":["presuffrage activism","presuffrage movement","presuffrage era","presuffrage literature","presuffrage society"],"synonyms":["pre-enfranchisement","pre-vote","pre-ballot"],"antonyms":["postsuffrage","post-enfranchisement"]},{"part_of_speech":"noun","definition":"参政権獲得以前の時代","english_definition":"The period before the right to vote was achieved or granted.","examples":[{"sentence":"The museum exhibit focused on the challenges of the presuffrage period.","translation":"その博物館の展示は、参政権獲得以前の時代の課題に焦点を当てていた。"},{"sentence":"Historians study the presuffrage to understand the origins of modern voting rights.","translation":"歴史家たちは、現代の投票権の起源を理解するために、参政権獲得以前の時代を研究する。"}],"collocations":["in the presuffrage","during the presuffrage","the history of the presuffrage"],"synonyms":["pre-enfranchisement era","pre-vote period","pre-ballot time"],"antonyms":["postsuffrage era","post-enfranchisement period"]}],"etymology":{"value":"The word \"presuffrage\" is formed by combining the prefix \"pre-\" (meaning before) with the noun \"suffrage\" (meaning the right to vote).","priority":"★☆☆"},"pronunciation":{"ipa":"/priˈsʌfrɪdʒ/","syllables":"pre-suf-frage"},"inflection":{"noun_plural":"presuffrages"},"usage_notes":{"explanation":"\"Presuffrage\" is primarily used in historical and political contexts to describe events, conditions, or movements that occurred before a particular group (most commonly women) gained the right to vote. It is often used to analyze the social, political, and cultural landscape of that time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The presuffrage was a time of peace.","correct":"✓ The presuffrage era was a time of struggle for voting rights.","note":"\"Presuffrage\" refers to the period before voting rights were achieved, not necessarily a peaceful time. The focus is on the lack of voting rights and the efforts to obtain them."},{"incorrect":"✗ She is a presuffrage activist.","correct":"✓ She was a presuffrage activist.","note":"Since suffrage has been achieved in most countries, it's more accurate to say someone *was* a presuffrage activist, referring to historical figures."}],"priority":"★☆☆"},"related_words":{"derivatives":["suffrage","suffragist","suffragette"],"related_terms":["enfranchisement","franchise","voting rights","women's rights","political activism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"presuffrage\" is a specialized term primarily used in historical and academic contexts. It refers to the period before a specific group of people (often women) obtained the right to vote. Understanding this word requires knowledge of the historical context of suffrage movements and the struggle for voting rights. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The presuffrage generation faced significant legal and social barriers.","translation":"参政権獲得以前の世代は、重大な法的および社会的障壁に直面した。","type":"adjective","meaning_category":"参政権獲得以前の"},{"sentence":"The presuffrage is a topic of ongoing research in women's history.","translation":"参政権獲得以前の時代は、女性史における継続的な研究テーマである。","type":"noun","meaning_category":"参政権獲得以前の時代"}]}