{"word":"Ibero-","priority":"☆☆☆","meanings":[{"part_of_speech":"prefix","definition":"イベリア半島 (Iberian Peninsula) の、イベリア人 (Iberians) の、またはイベリア半島とラテンアメリカ (Latin America) の両方に関連することを示す接頭辞","english_definition":"A prefix denoting something related to the Iberian Peninsula, the Iberians, or both the Iberian Peninsula and Latin America.","examples":[{"sentence":"Ibero-American studies focus on the history and culture of both Spain/Portugal and Latin America.","translation":"イベロアメリカ研究は、スペイン/ポルトガルとラテンアメリカ両方の歴史と文化に焦点を当てています。"},{"sentence":"The Ibero-Roman culture was a blend of Iberian and Roman traditions.","translation":"イベロ・ローマ文化は、イベリアとローマの伝統が融合したものでした。"}],"collocations":["Ibero-American (イベロアメリカの)","Ibero-Celtic (イベロ・ケルトの)","Ibero-Roman (イベロ・ローマの)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Iberia,' the ancient Greek name for the Iberian Peninsula, combined with a connecting vowel.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪˈbɪəroʊ/","syllables":"I-be-ro"},"inflection":{"notes":"Prefixes do not inflect."},"usage_notes":{"explanation":"The prefix `Ibero-` is used to indicate a connection to the Iberian Peninsula (Spain and Portugal) and, often, a relationship between the Iberian Peninsula and Latin America, due to their shared colonial history and cultural ties. It is commonly used in academic contexts, especially in area studies and linguistics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Ibero language is spoken in South America.","correct":"✓ Spanish and Portuguese, derived from Ibero-Romance languages, are spoken in South America.","note":"`Ibero` itself is not a language. Spanish and Portuguese are Ibero-Romance languages. Therefore, it's more accurate to specify the languages spoken. `Ibero-Romance` refers to the family of languages that originated in the Iberian Peninsula from Latin."}],"priority":"★★☆"},"related_words":{"derivatives":["Iberian (イベリアの、イベリア人)","Iberia (イベリア半島)"],"phrases":["Ibero-American Summit (イベロアメリカ首脳会議)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The prefix `Ibero-` is a specialized term primarily used in academic or historical contexts. It signifies a connection to the Iberian Peninsula (Spain and Portugal) or the relationship between the Iberian Peninsula and Latin America. Due to its specific usage, it is less common in everyday language and more prevalent in scholarly discussions concerning history, culture, and linguistics related to these regions."},"example_sentences":[{"sentence":"The **Ibero-American** Film Festival showcases movies from Spain, Portugal, and Latin American countries.","translation":"イベロアメリカ映画祭は、スペイン、ポルトガル、ラテンアメリカ諸国の映画を紹介しています。","type":"example","meaning_category":"イベロアメリカの"},{"sentence":"**Ibero-Celtic** languages were spoken in the Iberian Peninsula before the Roman conquest.","translation":"イベロ・ケルト語は、ローマの征服以前にイベリア半島で話されていました。","type":"example","meaning_category":"イベロ・ケルトの"},{"sentence":"The **Ibero-Roman** period left a lasting impact on the architecture of the region.","translation":"イベロ・ローマ時代は、その地域の建築に永続的な影響を与えました。","type":"example","meaning_category":"イベロ・ローマの"}]}