{"word":"Cainish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カインのような、兄弟殺しのような、嫉妬深い","english_definition":"Resembling Cain; fratricidal; jealous.","examples":[{"sentence":"His Cainish jealousy led him to betray his own brother.","translation":"彼のカインのような嫉妬は、彼自身の兄弟を裏切らせる結果となった。"},{"sentence":"The Cainish act shocked the entire community.","translation":"その兄弟殺しのような行為は、地域社会全体に衝撃を与えた。"}],"collocations":["Cainish jealousy","Cainish act","Cainish nature"],"synonyms":["fratricidal","murderous","jealous","envious"],"antonyms":["brotherly","benevolent","altruistic"]}],"etymology":{"value":"From Cain, the biblical figure who murdered his brother Abel, + -ish.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪnɪʃ/","syllables":"Cai-nish"},"inflection":{"notes":"Adjective, comparative and superlative forms are more Cainish, most Cainish, though usage is rare."},"usage_notes":{"explanation":"'Cainish' is a relatively rare adjective used to describe something or someone resembling Cain, particularly in terms of jealousy, fratricide, or a general evil nature. It is often used in literary or historical contexts to evoke the biblical story of Cain and Abel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a Kainish look in his eyes.","correct":"✓ He had a Cainish look in his eyes.","note":"Correct spelling is important as 'Kainish' is not a recognized word. The correct spelling reflects the origin from the name 'Cain'."}],"priority":"★★☆"},"related_words":{"derivatives":["Cain (noun: the biblical figure)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cainish' is a sophisticated and rare word, primarily used in literary or academic contexts. Understanding requires familiarity with the biblical story of Cain and Abel. Its use is limited to describing extreme jealousy or fratricidal tendencies. Due to its rarity and specific connotation, it's not typically used in everyday conversation."},"example_sentences":[{"sentence":"The play explored the Cainish impulses that can drive siblings apart.","translation":"その劇は、兄弟を引き裂く可能性のあるカインのような衝動を探求した。","type":"adjective","meaning_category":"jealous/fratricidal"},{"sentence":"His Cainish spirit poisoned the atmosphere of the meeting.","translation":"彼のカインのような精神が会議の雰囲気を害した。","type":"adjective","meaning_category":"evil/jealous"}]}