{"word":"tether-devil","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Fantasy, rare) A mischievous or malevolent creature that is bound to a specific location or object, often causing minor annoyances or disruptions.","english_definition":"(Fantasy, rare) A mischievous or malevolent creature that is bound to a specific location or object, often causing minor annoyances or disruptions.","examples":[{"sentence":"The old lighthouse was said to be haunted by a tether-devil, responsible for the constant flickering of the lamp.","translation":"その古い灯台には、灯りの絶え間ないちらつきの原因であるテザーデビルが棲みついていると言われていた。"},{"sentence":"Villagers blamed the tether-devil for the milk turning sour and the tools going missing.","translation":"村人たちは、牛乳が腐ったり道具がなくなったりするのはテザーデビルのせいだと考えた。"}],"collocations":["bound tether-devil","haunted by a tether-devil","blamed the tether-devil"],"synonyms":["imp","gremlin","hobgoblin","spirit","demon"],"antonyms":[]}],"etymology":{"value":"Likely a combination of 'tether' (a rope or chain used to restrain something) and 'devil' (an evil spirit). The 'tether' part suggests the creature is bound or restricted in some way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛðərˌdɛvəl/","syllables":"teth-er-dev-il"},"inflection":{"noun_plural":"tether-devils"},"usage_notes":{"explanation":"'Tether-devil' is a relatively rare term, primarily found in fantasy literature or role-playing games. It describes a type of supernatural creature that is not free to roam but is instead tied to a particular place or thing. This limitation often influences its behavior, resulting in localized mischief rather than widespread chaos. The term implies a sense of frustration and limited power on the part of the creature.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["tether (noun, verb)","devil (noun)","devilish (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism or rare fantasy term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tether-devil' is a niche term, primarily encountered in fantasy contexts. Understanding it requires familiarity with the concept of supernatural creatures and the implications of being 'tethered' or bound to a specific location. The word combines familiar elements ('tether' and 'devil') to create a specific image of a localized, mischievous entity."},"example_sentences":[{"sentence":"The wizard suspected a tether-devil was responsible for the magical disturbances in the ancient tower.","translation":"魔法使いは、古代の塔で起こる魔法の妨害はテザーデビルのせいではないかと疑った。","type":"noun","meaning_category":"mischievous creature"},{"sentence":"Legend had it that a vengeful tether-devil guarded the treasure hidden beneath the old oak tree.","translation":"伝説によると、復讐心に燃えるテザーデビルが、古い樫の木の下に隠された宝を守っているという。","type":"noun","meaning_category":"mischievous creature"}]}