{"word":"hagiographist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖人伝の著者、聖人伝研究家","english_definition":"A writer of hagiographies; a biographer of saints; one who studies or writes about the lives of saints.","examples":[{"sentence":"The hagiographist spent years researching the life of Saint Francis.","translation":"その聖人伝研究家は聖フランシスコの生涯を研究するのに何年も費やした。"},{"sentence":"Modern hagiographists often attempt to separate fact from legend in their biographies.","translation":"現代の聖人伝研究家は、伝記の中で事実と伝説を区別しようとすることが多い。"}],"collocations":["researching hagiographies","writing hagiographies","studying the lives of saints"],"synonyms":["biographer of saints","vita writer"],"antonyms":[]}],"etymology":{"value":"From hagiography (the writing of the lives of saints) + -ist (a suffix denoting a person who practices or is concerned with something). Hagiography comes from Greek hágios (ἅγιος) meaning 'holy, saint' + -graphy (writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌheɪɡiˈɒɡrəfɪst/","syllables":"ha-gi-og-ra-phist"},"inflection":{"noun_plural":"hagiographists"},"usage_notes":{"explanation":"A hagiographist is someone who writes or studies hagiographies, which are biographies of saints or venerated people. The term can sometimes be used critically to suggest that the biography is overly reverential or idealized, lacking critical analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hagiography.","correct":"✓ He is a hagiographist.","note":"'Hagiography' is the biography itself, while 'hagiographist' is the person who writes it."}],"priority":"★☆☆"},"related_words":{"derivatives":["hagiography","hagiographic","hagiographical"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hagiographist' is a specialized term used in academic or religious contexts. It refers to someone who writes or studies the lives of saints. Understanding this word requires familiarity with the concept of hagiography and a good vocabulary."},"example_sentences":[{"sentence":"The hagiographist meticulously documented every miracle attributed to the saint.","translation":"その聖人伝研究家は、聖人に帰せられるすべての奇跡を綿密に記録した。","type":"general","meaning_category":"聖人伝の著者"},{"sentence":"As a hagiographist, she aimed to present a balanced view of the saint's life, including both virtues and flaws.","translation":"聖人伝研究家として、彼女は聖人の生涯のバランスの取れた見方を示すことを目指し、美徳と欠陥の両方を含めた。","type":"general","meaning_category":"聖人伝の著者"}]}