{"word":"achlorhydria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無酸症（胃酸欠乏症）","english_definition":"The absence of hydrochloric acid in gastric secretions.","examples":[{"sentence":"Achlorhydria can be a symptom of certain medical conditions.","translation":"無酸症は、特定の病気の症状である可能性があります。"},{"sentence":"Long-term achlorhydria may lead to malabsorption of nutrients.","translation":"長期的な無酸症は、栄養素の吸収不良につながる可能性があります。"}],"collocations":["cause achlorhydria (無酸症を引き起こす)","treat achlorhydria (無酸症を治療する)","diagnose achlorhydria (無酸症を診断する)","achlorhydria symptoms (無酸症の症状)"],"synonyms":["hypochlorhydria (低酸症)"],"antonyms":[]}],"etymology":{"value":"'A-' (absence of) + 'chlor-' (referring to chlorine or hydrochloric acid) + 'hydr-' (referring to water) + '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪˌklɔːrˈhaɪdriə/","syllables":"a-chlor-hy-dri-a"},"inflection":{"noun_plural":"achlorhydrias"},"usage_notes":{"explanation":"Achlorhydria is a medical condition where the stomach does not produce hydrochloric acid. Hydrochloric acid is important for digestion and absorption of nutrients, as well as for killing bacteria in the stomach. Achlorhydria can be caused by various factors, including certain medications, autoimmune diseases, and chronic gastritis. It can lead to symptoms such as bloating, abdominal pain, and nutrient deficiencies. Diagnosis typically involves gastric acid testing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Achlorhydria is when there is too much acid in the stomach.","correct":"✓ Achlorhydria is when there is not enough acid in the stomach.","note":"Achlorhydria refers to the absence or deficiency of stomach acid, not an excess."}],"priority":"★★☆"},"related_words":{"derivatives":["achlorhydric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Achlorhydria is a technical medical term referring to the absence of hydrochloric acid in the stomach. Understanding this term requires a background in biology or medicine. The word is formed from Greek roots, indicating the absence of (a-) hydrochloric acid (chlorhydria). It is typically encountered in medical contexts when discussing digestive disorders or nutrient absorption issues."},"example_sentences":[{"sentence":"The patient was diagnosed with achlorhydria after a gastric analysis.","translation":"患者は胃液分析の結果、無酸症と診断されました。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Achlorhydria can impair the absorption of vitamin B12.","translation":"無酸症はビタミンB12の吸収を阻害する可能性があります。","type":"medical","meaning_category":"symptoms"}]}