{"word":"antoninianus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アントニニアヌス：古代ローマの銀貨。3世紀に発行され、デナリウス銀貨の代わりに使用された。","english_definition":"An antoninianus was a silver coin issued during the Roman Empire in the 3rd century AD. It was nominally valued at two denarii.","examples":[{"sentence":"The antoninianus was introduced by Caracalla in AD 215.","translation":"アントニニアヌスは、西暦215年にカラカラ帝によって導入されました。"},{"sentence":"Many antoninianus coins have been found in archaeological digs.","translation":"多くのアントニニアヌス硬貨が、考古学的発掘調査で発見されています。"}],"collocations":["mint antoninianus","collect antoninianus","rare antoninianus"],"synonyms":["argenteus","denarius"],"antonyms":[]}],"etymology":{"value":"The term \"antoninianus\" is derived from the name of the Roman Emperor Caracalla, whose full name was Marcus Aurelius Severus Antoninus.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntɒnɪˈnaɪənəs/","syllables":"an-to-ni-ni-a-nus"},"inflection":{"noun_plural":"antoniniani"},"usage_notes":{"explanation":"The antoninianus was introduced to replace the denarius as the standard Roman silver coin. However, it quickly suffered from debasement, with the silver content being reduced over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a antoninianus coin.","correct":"✓ I found an antoninianus coin.","note":"Since 'antoninianus' starts with a vowel sound, use 'an' instead of 'a' as the indefinite article."}],"priority":"☆☆☆"},"related_words":{"derivatives":["antoninianii (plural form)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'antoninianus' is a specialized term related to ancient Roman currency. It is unlikely to be encountered outside of historical or numismatic contexts. Understanding this term requires familiarity with Roman history and coinage systems."},"example_sentences":[{"sentence":"The museum displayed a collection of antoninianus coins from various Roman emperors.","translation":"博物館には、様々なローマ皇帝のアントニニアヌス硬貨のコレクションが展示されていました。","type":"noun","meaning_category":"coin"},{"sentence":"The value of an antoninianus fluctuated greatly due to the changing silver content.","translation":"アントニニアヌスの価値は、銀の含有量の変化によって大きく変動しました。","type":"noun","meaning_category":"coin"}]}