{"word":"Parabaptization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of rebaptizing.","english_definition":"The act of rebaptizing.","examples":[{"sentence":"Some radical reformers practiced parabaptization to signify their rejection of infant baptism.","translation":"一部の急進的な改革者は、幼児洗礼の拒否を示すために再洗礼（parabaptization）を行った。"}],"collocations":["practice parabaptization","advocate parabaptization"],"synonyms":["rebaptism"],"antonyms":[]}],"etymology":{"value":"From para- (beside, beyond) + baptize + -ation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpærəbæptɪˈzeɪʃən/","syllables":"par-a-bap-ti-za-tion"},"inflection":{"noun_plural":"parabaptizations"},"usage_notes":{"explanation":"'Parabaptization' is a historical term, primarily associated with the Anabaptist movement during the Reformation. It refers to the practice of rebaptizing individuals who had already been baptized, typically as infants, to signify a new commitment to faith based on adult understanding and consent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Parabaptization is a common practice in modern churches.","correct":"✓ Rebaptism is practiced in some churches, but parabaptization is a term primarily used in historical contexts.","note":"'Parabaptization' is not a widely used term in modern religious contexts; 'rebaptism' is more common."}],"priority":"★☆☆"},"related_words":{"derivatives":["parabaptist (noun/adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parabaptization' is a specialized historical term referring to the act of rebaptizing someone, particularly in the context of the Anabaptist movement during the Reformation. It signifies a rejection of previous baptism (often infant baptism) and a new commitment to faith based on adult understanding. This term is rarely used in contemporary contexts."},"example_sentences":[{"sentence":"The historical records mention instances of parabaptization among early Anabaptists.","translation":"歴史的記録には、初期の再洗礼派の間で再洗礼（parabaptization）の事例が記載されている。","type":"noun","meaning_category":"rebaptizing"}]}