{"word":"audit-requested","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"監査が要求された","english_definition":"Describes a situation where an audit has been formally requested or initiated.","examples":[{"sentence":"The project is marked as audit-requested, so we need to prepare the documentation.","translation":"プロジェクトは監査要求済みとしてマークされているので、ドキュメントを準備する必要があります。"},{"sentence":"All audit-requested files must be submitted by the end of the week.","translation":"監査が要求されたすべてのファイルは、週末までに提出する必要があります。"}],"collocations":["audit-requested project","audit-requested files","audit-requested documentation"],"synonyms":["under audit","subject to audit"],"antonyms":["not audited","audit-approved"]}],"etymology":{"value":"Combination of 'audit' (an official inspection of an organization's accounts) and 'requested' (having been asked for).","priority":"N/A"},"pronunciation":{"ipa":"/ˈɔːdɪt rɪˈkwɛstɪd/","syllables":"Au-dit re-quest-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. However, it can be part of a compound noun (e.g., audit-requested status)."},"usage_notes":{"explanation":"'Audit-requested' is a descriptive term often used in business, finance, and IT contexts to indicate that a formal audit process has been initiated for a specific item (e.g., a project, a file, a system). It implies that the item is now subject to scrutiny and review.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The request-audit file.","correct":"The audit-requested file.","note":"The correct order is 'audit-requested' as it describes the state of the file."}],"priority":"N/A"},"related_words":{"derivatives":["audit","requested","audit trail","audit log"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in professional contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Audit-requested' is a specialized term used in professional settings, particularly in finance, accounting, and IT. It indicates that a formal audit process has been initiated for a specific item. Understanding this term requires familiarity with audit procedures and business terminology."},"example_sentences":[{"sentence":"The server's status is now audit-requested, pending review of the security logs.","translation":"サーバーの状態は現在監査要求済みであり、セキュリティログのレビューを待っています。","type":"adjective","meaning_category":"監査が要求された"},{"sentence":"All audit-requested changes to the system must be documented.","translation":"システムに対する監査が要求されたすべての変更は文書化する必要があります。","type":"adjective","meaning_category":"監査が要求された"}]}