{"word":"carders","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) カード職人、梳き職人","english_definition":"Plural form of carder: a person who cards wool or other fibers.","examples":[{"sentence":"The carders prepared the wool for spinning.","translation":"梳き職人たちは紡績のために羊毛を準備した。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形, スラング) 不正なクレジットカード情報を使って詐欺を行う人々","english_definition":"(Slang, plural) People who commit fraud using stolen or unauthorized credit card information.","examples":[{"sentence":"The police arrested several carders involved in the online scam.","translation":"警察はオンライン詐欺に関与した数人のカード詐欺師を逮捕した。"}],"collocations":[],"synonyms":["fraudsters","scammers"],"antonyms":[]}],"etymology":{"value":"The word 'carder' comes from the verb 'to card,' which refers to the process of preparing fibers (like wool or cotton) for spinning by using a tool called a card. In the slang usage, 'carder' refers to someone who deals with credit cards, often in an illegal or fraudulent way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrdərz/","syllables":"car-ders"},"inflection":{"noun_plural":"carders"},"usage_notes":{"explanation":"The term 'carders' has two distinct meanings. The traditional meaning refers to people who work with fibers, preparing them for spinning. The more recent, slang usage refers to individuals involved in credit card fraud. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["card (noun, verb)","carding (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'carders' has two meanings, one historical and one modern slang. The historical meaning refers to people who prepared fibers for spinning, while the slang meaning refers to people involved in credit card fraud. Because of the two distinct meanings, it's important to understand the context in which the word is used. The slang meaning is relatively recent and may not be widely known."},"example_sentences":[{"sentence":"In the 18th century, carders were essential for the textile industry.","translation":"18世紀には、梳き職人は繊維産業に不可欠だった。","type":"noun","meaning_category":"カード職人"},{"sentence":"The online forum was known to be frequented by carders.","translation":"そのオンラインフォーラムはカード詐欺師が頻繁に出入りすることで知られていた。","type":"noun","meaning_category":"カード詐欺師"}]}