{"word":"populism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポピュリズム、大衆主義","english_definition":"a political approach that strives to appeal to ordinary people who feel that their concerns are disregarded by established elite groups.","examples":[{"sentence":"The rise of populism is a global phenomenon.","translation":"ポピュリズムの台頭は世界的な現象です。"},{"sentence":"Some critics argue that the government's policies are driven by populism rather than sound economic principles.","translation":"一部の批評家は、政府の政策は健全な経済原則よりもポピュリズムに動かされていると主張しています。"},{"sentence":"Populism often involves appealing to people's emotions and prejudices.","translation":"ポピュリズムはしばしば人々の感情や偏見に訴えかけることを伴います。"}],"collocations":["right-wing populism (右派ポピュリズム)","left-wing populism (左派ポピュリズム)","economic populism (経済ポピュリズム)","political populism (政治ポピュリズム)","the rise of populism (ポピュリズムの台頭)","populist movement (ポピュリズム運動)","populist leader (ポピュリストの指導者)","populist policies (ポピュリストの政策)"],"synonyms":["demagoguery","mob rule","popularism"],"antonyms":["elitism","authoritarianism","oligarchy"]},{"part_of_speech":"noun","definition":"(特に政治において)大衆迎合主義","english_definition":"support for the concerns of ordinary people","examples":[{"sentence":"The candidate's populism resonated with voters who felt left behind by globalization.","translation":"その候補者の大衆迎合主義は、グローバリゼーションに取り残されたと感じている有権者の心に響いた。"},{"sentence":"The party's platform was based on a mix of populism and traditional conservative values.","translation":"その党の綱領は、大衆迎合主義と伝統的な保守的価値観の組み合わせに基づいていた。"}],"collocations":["appeal to populism (ポピュリズムに訴える)","base on populism (ポピュリズムに基づく)"],"synonyms":["demagoguery","appeal to the masses"],"antonyms":["elitism","intellectualism"]}],"etymology":{"value":"From the Latin word 'populus', meaning 'people'. The suffix '-ism' denotes a doctrine, principle, or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɒpjʊlɪzəm/","syllables":"pop-u-lis-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Populism' is a complex and often contested term. It generally refers to political movements or ideologies that claim to represent the interests of 'the people' against those of an elite. However, the definition of 'the people' and the nature of their interests can vary widely. Populist movements can be found on both the left and right of the political spectrum, and they often share a distrust of established institutions and a tendency to simplify complex issues. The term can be used descriptively or pejoratively, depending on the speaker's perspective.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a populist, so he must be bad.","correct":"✓ His policies are populist, and some worry they are unsustainable.","note":"Populism is a political approach, not inherently good or bad. Evaluate policies, not just labels."},{"incorrect":"✗ Populism is only for uneducated people.","correct":"✓ Populism appeals to a wide range of people, including those who feel unheard.","note":"Populism can attract support across different demographics."}],"priority":"★★☆"},"related_words":{"derivatives":["populist (adjective, noun)","popular (adjective)","popularity (noun)"],"phrases":["populist movement","populist leader","populist policies"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderate","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Populism' is a complex political term often used in discussions of current events and political science. It refers to political movements that claim to represent the interests of ordinary people against elites. Understanding this word requires familiarity with abstract political concepts and the ability to analyze different perspectives on political issues. The term is often used in nuanced ways, so it's important to consider the context in which it appears."},"example_sentences":[{"sentence":"The candidate's populist message resonated with many voters.","translation":"その候補者のポピュリスト的なメッセージは多くの有権者の心に響いた。","type":"example","meaning_category":"general"},{"sentence":"Critics accused the government of engaging in populism to win votes.","translation":"批評家たちは、政府が票を獲得するためにポピュリズムに走っていると非難した。","type":"example","meaning_category":"criticism"},{"sentence":"The populist movement gained momentum in rural areas.","translation":"そのポピュリスト運動は地方で勢いを増した。","type":"example","meaning_category":"movement"}]}