{"word":"aceto-","priority":"★★☆","meanings":[{"part_of_speech":"prefix","definition":"アセト- (化学で、アセチル基または酢酸に関連することを示す接頭辞)","english_definition":"A prefix used in chemistry to indicate the presence of an acetyl group or a relationship to acetic acid.","examples":[{"sentence":"Acetoacetate is a beta-keto acid derived from acetoacetic acid.","translation":"アセト酢酸は、アセト酢酸から派生したβ-ケト酸です。"},{"sentence":"Aceto-CoA is an important intermediate in metabolism.","translation":"アセトCoAは、代謝における重要な中間体です。"}],"collocations":["acetoacetate (アセト酢酸)","acetoacetic acid (アセト酢酸)","aceto-CoA (アセトCoA)","acetoin (アセトイン)"],"synonyms":["acetyl-","acetic-"],"antonyms":[]}],"etymology":{"value":"Derived from 'acetum', the Latin word for vinegar, reflecting its association with acetic acid and acetyl groups.","priority":"★★★"},"pronunciation":{"ipa":"/əˈsiːtoʊ/","syllables":"a-ce-to"},"inflection":{"notes":"Prefixes do not inflect."},"usage_notes":{"explanation":"The prefix 'aceto-' is primarily used in chemical nomenclature to denote the presence of an acetyl group (CH3CO-) or a relationship to acetic acid (CH3COOH). It is commonly found in the names of organic compounds involved in metabolic processes and industrial chemistry. It indicates a chemical relationship rather than a physical property.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ aceto-aldehyde (incorrect)","correct":"✓ acetaldehyde","note":"While 'aceto-' relates to acetic acid, some compounds like acetaldehyde have established names that don't use the 'aceto-' prefix. Check the proper chemical nomenclature for each compound."}],"priority":"★★☆"},"related_words":{"derivatives":["acetate (酢酸塩)","acetic acid (酢酸)","acetone (アセトン)","acetyl (アセチル)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The prefix 'aceto-' is a specialized term predominantly used within the field of chemistry. It signifies a direct connection to acetic acid or the presence of an acetyl group within a chemical compound's structure. Due to its technical nature, understanding and usage are generally limited to those with a background in chemistry or related scientific disciplines.","priority":"★★☆"},"example_sentences":[{"sentence":"The enzyme catalyzes the formation of acetoacetyl-CoA.","translation":"その酵素はアセトアセチルCoAの形成を触媒する。","type":"chemical compound","meaning_category":"chemical nomenclature"},{"sentence":"Acetoacetate is a ketone body produced in the liver.","translation":"アセト酢酸は肝臓で生成されるケトン体である。","type":"chemical compound","meaning_category":"chemical nomenclature"}]}