{"word":"homogeneidade","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"均質性、同質性","english_definition":"the quality or state of being homogeneous; uniformity of composition or structure.","examples":[{"sentence":"A homogeneidade da amostra é essencial para resultados precisos.","translation":"サンプルの均質性は、正確な結果を得るために不可欠です。"},{"sentence":"A falta de homogeneidade na sociedade pode levar a conflitos.","translation":"社会の均質性の欠如は、紛争につながる可能性があります。"},{"sentence":"O produto apresenta alta homogeneidade, garantindo qualidade.","translation":"その製品は高い均質性を示し、品質を保証します。"}],"collocations":["homogeneidade cultural (文化的均質性)","homogeneidade social (社会的均質性)","homogeneidade da amostra (サンプル均質性)","alta homogeneidade (高い均質性)","baixa homogeneidade (低い均質性)"],"synonyms":["uniformidade","igualdade","padronização","consistência"],"antonyms":["heterogeneidade","diversidade","variação","desigualdade"]}],"etymology":{"value":"Derivado do adjetivo 'homogêneo', que vem do grego 'homogenēs' (ὁμογενής), composto por 'homos' (ὁμός) que significa 'mesmo' e 'genos' (γένος) que significa 'tipo, raça, origem'.","priority":"N/A"},"pronunciation":{"ipa":"/ɔmuʒeneidɐdʒi/","syllables":"ho-mo-ge-nei-da-de"},"inflection":{"noun_plural":"homogeneidades"},"usage_notes":{"explanation":"'Homogeneidade' refere-se à qualidade de ser homogêneo, ou seja, de ter uma composição ou estrutura uniforme em toda a sua extensão. É usado em diversos contextos, desde a ciência (para descrever amostras ou misturas) até as ciências sociais (para descrever sociedades ou culturas). A homogeneidade pode ser desejável em alguns casos (como em produtos industriais para garantir qualidade) e indesejável em outros (como em sociedades, onde a diversidade é frequentemente valorizada).","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"A homogeneidade é importante em todos os casos.","correct":"A homogeneidade é importante em alguns casos, mas a diversidade é valorizada em outros.","note":"É importante reconhecer que a homogeneidade nem sempre é desejável. Em contextos sociais e culturais, a diversidade é frequentemente vista como um valor positivo."}],"priority":"N/A"},"related_words":{"derivatives":["homogêneo (adjective: homogeneous)","homogeneamente (adverb: homogeneously)","homogeneizar (verb: to homogenize)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"N/A","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"'Homogeneidade' é um substantivo que descreve a qualidade de algo ser uniforme ou igual em toda a sua extensão. Pense em um copo de leite bem misturado: ele é homogêneo porque não se consegue ver as diferentes partes separadas. Em contextos mais amplos, pode se referir à uniformidade de características em um grupo ou sociedade."},"example_sentences":[{"sentence":"A homogeneidade da cor facilitou a identificação dos produtos.","translation":"色の均質性により、製品の識別が容易になりました。","type":"example","meaning_category":"uniformity"},{"sentence":"A homogeneidade cultural da ilha é resultado de séculos de isolamento.","translation":"島の文化的均質性は、何世紀にもわたる孤立の結果です。","type":"example","meaning_category":"uniformity in culture"},{"sentence":"A homogeneidade da mistura garante a eficácia do medicamento.","translation":"混合物の均質性は、薬の有効性を保証します。","type":"example","meaning_category":"uniformity in mixtures"}]}