{"word":"dysmeristic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Exhibiting or relating to an inability to recognize or distinguish body parts.","english_definition":"(rare) Exhibiting or relating to an inability to recognize or distinguish body parts.","examples":[{"sentence":"The patient presented with dysmeristic symptoms after the stroke, struggling to identify their own limbs.","translation":"脳卒中後、患者は自身の四肢を識別するのに苦労し、身体部位認識障害の症状を呈した。"}],"collocations":["dysmeristic symptoms","dysmeristic disorder"],"synonyms":["body schema disorder","somatoparaphrenia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek roots 'dys-' (bad, difficult) + 'meros' (part) + '-istic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˌmɛˈrɪstɪk/","syllables":"dys-me-ris-tic"},"inflection":{"notes":"Adjective, no standard inflections beyond comparative/superlative (more dysmeristic, most dysmeristic), though these are rarely used."},"usage_notes":{"explanation":"'Dysmeristic' is a relatively rare term in medical and psychological contexts, specifically used to describe conditions where an individual has difficulty recognizing or distinguishing parts of their own body or the bodies of others. It is often associated with neurological damage or certain psychological disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child was dysmeristic, so he couldn't read.","correct":"✓ The child had a reading disability, so he couldn't read.","note":"Dysmeristic relates to body part recognition, not general cognitive abilities like reading."}],"priority":"★☆☆"},"related_words":{"derivatives":["dysmerism (noun): The condition of being dysmeristic."],"phrasal_verbs":[],"related_medical_terms":["somatoparaphrenia","body schema","phantom limb syndrome"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dysmeristic' is a highly specialized term primarily encountered in medical or psychological literature. Understanding requires familiarity with medical terminology and a grasp of neurological disorders affecting body perception. Due to its rarity and specificity, it is not suitable for general use."},"example_sentences":[{"sentence":"The neurologist assessed the patient for dysmeristic tendencies following the traumatic brain injury.","translation":"神経科医は、外傷性脳損傷後の患者に身体部位認識障害の傾向がないか評価した。","type":"adjective","meaning_category":"inability to recognize body parts"},{"sentence":"Research into dysmeristic conditions may provide insights into how the brain constructs its body schema.","translation":"身体部位認識障害の研究は、脳がどのように身体図式を構築するかについての洞察を提供する可能性がある。","type":"adjective","meaning_category":"relating to the inability to recognize body parts"}]}