{"word":"Dauerstadium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","gender":"neuter","definition":"休眠期、耐久段階","english_definition":"(biology) a dormant or resistant stage in the life cycle of an organism, allowing it to survive unfavorable conditions.","examples":[{"sentence":"Das Bakterium bildet ein Dauerstadium, um die ungünstigen Bedingungen zu überleben.","translation":"The bacterium forms a dormant stage to survive the unfavorable conditions.","context":"Microbiology"},{"sentence":"Viele Pflanzen überleben den Winter als Dauerstadium in Form von Samen oder Zwiebeln.","translation":"Many plants survive the winter as a dormant stage in the form of seeds or bulbs.","context":"Botany"}],"collocations":["ein Dauerstadium bilden (to form a dormant stage)","im Dauerstadium überleben (to survive in a dormant stage)"],"synonyms":["Ruhestadium","Überdauerungsform"],"antonyms":[]}],"etymology":{"value":"Composed of 'Dauer' (duration, endurance) and 'Stadium' (stage).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊ̯ɐˌʃtaːdi̯ʊm/","syllables":"Dau-er-sta-di-um"},"inflection":{"singular":"das Dauerstadium","plural":"die Dauerstadien"},"usage_notes":{"explanation":"The term 'Dauerstadium' is primarily used in biology to describe a phase in the life cycle of an organism where it is inactive and highly resistant to environmental stressors. This allows the organism to survive periods of drought, extreme temperatures, or nutrient scarcity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Der Pflanze ist im Dauerstadium.","correct":"✓ Die Pflanze befindet sich im Dauerstadium.","note":"Use the verb 'sich befinden' (to be located, to be in a state) to describe that an organism is in the dormant stage."}],"priority":"★★☆"},"related_words":{"derivatives":["Dauer (duration)","Stadium (stage)"],"related_terms":["Ruhephase (resting phase)","Zyste (cyst)","Spore (spore)"]},"level_frequency":{"priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dauerstadium' is a technical term used in biology. It refers to a phase in an organism's life cycle where it becomes dormant and resistant to harsh conditions. Understanding this term requires knowledge of basic biological concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Das Dauerstadium ermöglicht es dem Organismus, lange Perioden ohne Wasser zu überstehen.","translation":"The dormant stage enables the organism to survive long periods without water.","type":"general","meaning_category":"survival"},{"sentence":"Die Sporen sind ein Beispiel für ein bakterielles Dauerstadium.","translation":"Spores are an example of a bacterial dormant stage.","type":"specific","meaning_category":"bacterial survival"}]}