{"word":"non-offender","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非犯罪者、犯罪歴のない人","english_definition":"A person who has not committed an offense or crime; a person with no criminal record.","examples":[{"sentence":"The program aims to rehabilitate offenders and prevent them from becoming repeat offenders, while also protecting non-offenders in the community.","translation":"そのプログラムは、犯罪者の更生と再犯防止を目指すと同時に、地域社会の非犯罪者を保護することを目的としています。"},{"sentence":"It is important to distinguish between offenders and non-offenders in the justice system.","translation":"司法制度においては、犯罪者と非犯罪者を区別することが重要です。"},{"sentence":"The vast majority of people are non-offenders and live law-abiding lives.","translation":"大多数の人は非犯罪者であり、法を遵守して生活しています。"}],"collocations":["first-time non-offender (初犯の非犯罪者)","protect non-offenders (非犯罪者を保護する)","distinguish between offenders and non-offenders (犯罪者と非犯罪者を区別する)","rehabilitate offenders and protect non-offenders (犯罪者を更生させ、非犯罪者を保護する)"],"synonyms":["law-abiding citizen","innocent person","upstanding citizen","non-criminal"],"antonyms":["offender","criminal","lawbreaker","perpetrator"]},{"part_of_speech":"adjective","definition":"犯罪を犯していない、犯罪歴のない","english_definition":"Not having committed an offense or crime; relating to people without a criminal record.","examples":[{"sentence":"The study focused on the experiences of non-offender family members of incarcerated individuals.","translation":"その研究は、収監されている人の非犯罪者である家族の経験に焦点を当てました。"},{"sentence":"Non-offender populations are often used as a control group in criminological research.","translation":"非犯罪者集団は、犯罪学研究において対照群としてよく使用されます。"},{"sentence":"The policy aims to support non-offender parents in maintaining contact with their children in prison.","translation":"その政策は、刑務所にいる子供たちとの連絡を維持する非犯罪者の親を支援することを目的としています。"}],"collocations":["non-offender family members (非犯罪者の家族)","non-offender population (非犯罪者集団)","non-offender parents (非犯罪者の親)"],"synonyms":["law-abiding","innocent","non-criminal"],"antonyms":["offending","criminal"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'offender'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn əˈfɛndər/","syllables":"non-of-fend-er"},"inflection":{"noun_plural":"non-offenders"},"usage_notes":{"explanation":"The term 'non-offender' is primarily used in legal, criminological, and sociological contexts to distinguish individuals who have not committed crimes from those who have. It is often used in discussions about crime prevention, rehabilitation, and the impact of crime on society. The term can also be used to describe family members or other individuals associated with offenders who themselves have not committed any crimes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non offender of the law.","correct":"✓ He is a non-offender.","note":"The phrase 'non-offender of the law' is redundant. 'Non-offender' already implies that the person has not broken the law."},{"incorrect":"✗ The non offender's rights should be protected.","correct":"✓ The non-offender's rights should be protected.","note":"The hyphen is important in 'non-offender' to clearly indicate that it is a single compound word."}],"priority":"★★☆"},"related_words":{"derivatives":["offender","offense","non-offending"],"related_terms":["victim","crime","justice system","rehabilitation","incarceration"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used primarily in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-offender' is a relatively formal term primarily used in legal and social science contexts. It refers to someone who has not committed a crime. The word is formed by adding the prefix 'non-' to 'offender', indicating the absence of criminal behavior. Understanding this term requires familiarity with legal and criminological vocabulary. It is typically encountered in academic articles, legal documents, and discussions about crime and justice.","priority":"★★☆"},"example_sentences":[{"sentence":"The study compared the psychological well-being of offenders and non-offenders.","translation":"その研究は、犯罪者と非犯罪者の心理的な幸福度を比較しました。","type":"noun","meaning_category":"Person with no criminal record"},{"sentence":"The program is designed to support non-offender families affected by incarceration.","translation":"そのプログラムは、収監によって影響を受けた非犯罪者の家族を支援するように設計されています。","type":"adjective","meaning_category":"Relating to people without a criminal record"},{"sentence":"It's crucial to protect the rights of non-offenders in the community.","translation":"地域社会において、非犯罪者の権利を保護することが重要です。","type":"noun","meaning_category":"Person with no criminal record"},{"sentence":"The research examined the social stigma faced by non-offender relatives of prisoners.","translation":"その研究は、囚人の非犯罪者の親族が直面する社会的偏見を調査しました。","type":"adjective","meaning_category":"Relating to people without a criminal record"}]}