{"word":"Howardite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉱物学) ハワード隕石：主に輝石と斜長石からなる、ダイオジェナイトとユークライトの中間的な特徴を持つ石質隕石","english_definition":"(Mineralogy) A stony meteorite, a member of the HED meteorite group, containing primarily pyroxene and plagioclase, and intermediate in composition between diogenites and eucrites.","examples":[{"sentence":"Howardites are brecciated meteorites, indicating a history of impacts and mixing on their parent body.","translation":"ハワード隕石は角礫状の隕石であり、母天体上での衝突と混合の歴史を示している。"},{"sentence":"Analysis of howardites provides insights into the composition and evolution of the asteroid Vesta.","translation":"ハワード隕石の分析は、小惑星ベスタの組成と進化に関する洞察を提供する。"}],"collocations":["HED meteorite group","diogenite","eucrite","brecciated meteorite","parent body","asteroid Vesta"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"1820年にイギリスの化学者エドワード・ハワード（Edward Howard）にちなんで名付けられた。ハワードは隕石の化学組成に関する初期の研究を行った。","priority":"★★☆"},"pronunciation":{"ipa":"ˈhaʊərdaɪt","syllables":"How-ard-ite"},"inflection":{"noun_plural":"Howardites"},"usage_notes":{"explanation":"ハワード隕石は、HED（ハワード隕石、ユークライト、ダイオジェナイト）隕石グループに属する一種の石質隕石です。これらの隕石は、小惑星ベスタに由来すると考えられています。ハワード隕石は、ダイオジェナイトとユークライトの破片が混合した角礫岩であり、母天体上での衝突と混合の歴史を示しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Howardite is a type of iron meteorite.","correct":"✓ Howardite is a type of stony meteorite.","note":"ハワード隕石は石質隕石であり、鉄隕石ではありません。"},{"incorrect":"✗ Howardites are found only on Mars.","correct":"✓ Howardites are believed to originate from the asteroid Vesta.","note":"ハワード隕石は小惑星ベスタに由来すると考えられています。"}],"priority":"★☆☆"},"related_words":{"derivatives":["HED meteorite","Eucrite","Diogenite"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Howardite**」は、鉱物学における専門用語であり、一般的な語彙ではありません。この単語は、主に輝石と斜長石から構成される特定の種類の石質隕石を指します。これらの隕石は、HED隕石グループに属し、小惑星ベスタに由来すると考えられています。ハワード隕石は角礫岩であり、母天体上での衝突と混合の歴史を示しています。この用語は、隕石や宇宙科学の研究分野で主に使用されます。"},"example_sentences":[{"sentence":"The howardite sample contained a variety of mineral fragments.","translation":"ハワード隕石のサンプルには、さまざまな鉱物破片が含まれていた。","type":"noun","meaning_category":"石質隕石"},{"sentence":"Scientists analyzed the howardite to determine its age and origin.","translation":"科学者たちは、ハワード隕石の年齢と起源を特定するために分析した。","type":"noun","meaning_category":"石質隕石"}]}