{"word":"Undocumentary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語) ドキュメンタリーのような体裁をとっているが、事実に基づかない、あるいは虚構の要素を多く含む作品","english_definition":"(neologism) A work that resembles a documentary in style but is not based on facts or contains many fictional elements.","examples":[{"sentence":"The film was marketed as a documentary, but it's more of an undocumentary, playing fast and loose with the truth.","translation":"その映画はドキュメンタリーとして宣伝されたが、真実をいい加減に扱っており、むしろアン・ドキュメンタリーに近い。"},{"sentence":"Some critics have called the mockumentary an undocumentary because it blurs the line between fact and fiction.","translation":"一部の批評家は、モキュメンタリーを事実と虚構の境界線を曖昧にするアン・ドキュメンタリーと呼んでいる。"}],"collocations":["mockumentary","pseudo-documentary","fictional documentary"],"synonyms":["mockumentary","pseudo-documentary","fake documentary"],"antonyms":["documentary","non-fiction film"]},{"part_of_speech":"adjective","definition":"(造語) ドキュメンタリーの形式を模倣しているが、事実に基づかない、あるいは虚構の要素を多く含む","english_definition":"(neologism) Imitating the style of a documentary but not based on facts or containing many fictional elements.","examples":[{"sentence":"The undocumentary style of the film made it difficult to distinguish between what was real and what was staged.","translation":"その映画のアン・ドキュメンタリー的なスタイルは、何が現実で何が演出されたものかを区別することを困難にした。"},{"sentence":"The director used an undocumentary approach to explore themes of identity and memory.","translation":"監督は、アイデンティティと記憶のテーマを探求するために、アン・ドキュメンタリー的なアプローチを用いた。"}],"collocations":["undocumentary style","undocumentary approach"],"synonyms":["pseudo-documentary","mock-documentary"],"antonyms":["documentary","non-fiction"]}],"etymology":{"value":"「un-」（否定の接頭辞）+ 「documentary」。ドキュメンタリーではない、あるいはドキュメンタリーの要素を意図的に歪曲・誇張した作品を指すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɒkjʊˈmɛntəri/","syllables":"un-doc-u-men-ta-ry"},"inflection":{"notes":"名詞と形容詞として使用される。複数形は\"undocumentaries\"。"},"usage_notes":{"explanation":"「Undocumentary」は比較的新しい言葉で、主に映画やテレビ番組などの映像作品を指して使われます。ドキュメンタリーの形式を模倣しながらも、事実に基づかない、あるいは虚構の要素を多く含む作品を指します。モキュメンタリー（mockumentary）や疑似ドキュメンタリー（pseudo-documentary）とほぼ同義ですが、「undocumentary」はより広い意味で、ドキュメンタリーの体裁を借りたフィクション作品全般を指すことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I watched an undocumentary about the moon landing, and it was all true.","correct":"✓ I watched a documentary about the moon landing, and it was all true.","note":"Undocumentaryは、事実に基づかない作品を指すため、真実であるとは言えません。"},{"incorrect":"✗ This is a real undocumentary, not a fake one.","correct":"✓ This is a real documentary, not a fake one.","note":"Undocumentaryは、本物のドキュメンタリーの反対を意味するため、\"real undocumentary\"という表現は矛盾しています。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["mockumentary","pseudo-documentary","documentary","fiction","non-fiction"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (造語のため)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undocumentary\" is a neologism, meaning it's a relatively new word. It describes a work, usually a film or television show, that looks like a documentary but isn't actually based on real facts or events. Instead, it uses fictional elements or exaggerations for comedic or satirical purposes. Think of it as the opposite of a documentary, which aims to present factual information. It is often used interchangeably with \"mockumentary\" or \"pseudo-documentary.\""},"example_sentences":[{"sentence":"The film, though presented as a serious investigation, was ultimately an undocumentary designed to provoke discussion.","translation":"その映画は、真剣な調査として提示されたものの、最終的には議論を喚起するために設計されたアン・ドキュメンタリーだった。","type":"noun","meaning_category":"作品"},{"sentence":"The undocumentary approach allowed the filmmakers to explore sensitive topics with greater creative freedom.","translation":"アン・ドキュメンタリー的なアプローチは、映画製作者がより大きな創造的自由を持ってデリケートなテーマを探求することを可能にした。","type":"adjective","meaning_category":"スタイル"}]}