{"word":"diffusionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"伝播主義、文化伝播説","english_definition":"A theory that the spread of cultural items occurs through the movement of people or ideas from one culture to another.","examples":[{"sentence":"Diffusionism explains the similarities between ancient civilizations by suggesting that ideas spread from a common source.","translation":"伝播主義は、古代文明間の類似性を、アイデアが共通の源から広まったことを示唆することによって説明する。"},{"sentence":"Critics of diffusionism argue that it underestimates the possibility of independent invention.","translation":"伝播主義の批判者たちは、それが独立した発明の可能性を過小評価していると主張する。"}],"collocations":["cultural diffusion","spread of ideas","independent invention","historical context"],"synonyms":["cultural transmission","cultural exchange"],"antonyms":["independent invention","parallel development"],"notes":"Diffusionism is often contrasted with theories of independent invention, which posit that similar cultural traits can arise in different places without contact."}],"etymology":{"value":"From 'diffusion' (the act of spreading out) + '-ism' (a doctrine or theory).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈfjuːʒənɪzəm/","syllables":"dif-fu-sion-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Diffusionism is a theoretical perspective in anthropology and sociology that emphasizes the spread of cultural traits, ideas, and technologies from one society to another. It suggests that cultures do not develop in isolation but rather borrow and adapt elements from other cultures through contact, trade, migration, or conquest. This theory was particularly influential in the late 19th and early 20th centuries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Diffusionism means every culture is unique.","correct":"Diffusionism explains how cultural traits spread from one culture to another.","note":"Diffusionism focuses on the spread of cultural elements, not the uniqueness of cultures."}],"priority":"★☆☆"},"related_words":{"derivatives":["diffusionist (noun, adjective)"],"related_terms":["cultural relativism","evolutionism","historical particularism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diffusionism' is a term used in social sciences, especially anthropology and sociology, to describe a theory about how cultures change. It suggests that many things we see in a culture, like tools, ideas, or customs, didn't necessarily start there. Instead, they spread from other cultures through contact and exchange. This theory is often discussed in academic settings when looking at how different societies have influenced each other over time."},"example_sentences":[{"sentence":"The **diffusionism** theory suggests that agriculture spread from the Middle East to Europe.","translation":"伝播主義の理論は、農業が中東からヨーロッパに広がったことを示唆している。","type":"noun","meaning_category":"cultural theory"},{"sentence":"Critics of **diffusionism** point to examples of similar technologies arising independently in different parts of the world.","translation":"伝播主義の批判者たちは、類似の技術が世界の異なる地域で独自に発生した例を指摘している。","type":"noun","meaning_category":"cultural theory"}]}