{"word":"Italo-Hispanic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"イタリアとスペインの文化、人々、言語、または歴史に関連する、あるいはそれらを組み合わせたもの","english_definition":"Relating to or combining Italian and Hispanic (Spanish and/or Latin American) cultures, peoples, languages, or history.","examples":[{"sentence":"The Italo-Hispanic community in Argentina is quite large.","translation":"アルゼンチンのイタリア系ヒスパニックコミュニティはかなり大きい。"},{"sentence":"Italo-Hispanic literature often explores themes of identity and migration.","translation":"イタリア系ヒスパニック文学は、アイデンティティと移住のテーマを探求することが多い。"},{"sentence":"The restaurant features Italo-Hispanic fusion cuisine.","translation":"そのレストランは、イタリア系ヒスパニックのフュージョン料理を特徴としている。"}],"collocations":["Italo-Hispanic culture","Italo-Hispanic community","Italo-Hispanic literature","Italo-Hispanic cuisine","Italo-Hispanic relations"],"synonyms":["Italian-Hispanic","Italian-Spanish"],"antonyms":[]}],"etymology":{"value":"「Italo-」はイタリアに関連することを示し、「Hispanic」はスペインまたはラテンアメリカに関連することを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪtæloʊ hɪˈspænɪk/","syllables":"I-ta-lo-His-pan-ic"},"inflection":{"notes":"形容詞なので、名詞の複数形や動詞の活用形はありません。比較級と最上級は more Italo-Hispanic, most Italo-Hispanic となります。"},"usage_notes":{"explanation":"「Italo-Hispanic」は、イタリアとスペインまたはラテンアメリカの文化、人々、言語、または歴史が組み合わさったもの、またはそれらに関連するものを示すために使用される複合語です。この用語は、特にラテンアメリカの国々におけるイタリア系移民の存在と、彼らが現地のヒスパニック文化に与えた影響を指す場合によく使用されます。また、両方の文化の要素を組み合わせた芸術、料理、文学などを説明するためにも使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Italo-hispanic is a language.","correct":"✓ Italo-Hispanic refers to a combination of Italian and Hispanic cultures.","note":"Italo-Hispanic は言語そのものを指すのではなく、文化や人々の組み合わせを指します。言語を指す場合は、イタリア語とスペイン語の混合語や、それぞれの言語の影響を受けた方言などを具体的に記述する必要があります。"},{"incorrect":"✗ Italo-hispanic only refers to people from Spain and Italy.","correct":"✓ Italo-Hispanic can also refer to people from Latin America with Italian heritage.","note":"「Hispanic」はスペインだけでなく、ラテンアメリカの国々も含むため、Italo-Hispanic はイタリアとラテンアメリカのつながりも指すことがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Italo- (接頭辞: イタリアに関連することを示す)","Hispanic (形容詞/名詞: スペインまたはラテンアメリカに関連する)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野や文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Italo-Hispanic」という言葉は、イタリアとヒスパニック（スペインまたはラテンアメリカ）の文化、人々、言語、歴史が組み合わさったもの、またはそれらに関連するものを示す専門用語です。この用語は、特にアルゼンチンやウルグアイなどのラテンアメリカの国々におけるイタリア系移民の存在と、彼らが現地の文化に与えた影響を指す場合によく使用されます。この単語を理解するには、「Italo-」がイタリアに関連し、「Hispanic」がスペインまたはラテンアメリカに関連することを知っておく必要があります。"},"example_sentences":[{"sentence":"Buenos Aires has a strong Italo-Hispanic heritage due to significant Italian immigration in the late 19th and early 20th centuries.","translation":"ブエノスアイレスは、19世紀後半から20世紀初頭にかけてのイタリアからの大規模な移民により、強いイタリア系ヒスパニックの遺産を持っている。","type":"adjective","meaning_category":"文化・歴史"},{"sentence":"Many Italo-Hispanic families in Uruguay still maintain Italian traditions alongside their Uruguayan customs.","translation":"ウルグアイの多くのイタリア系ヒスパニックの家族は、ウルグアイの習慣とともに、イタリアの伝統を今も維持している。","type":"adjective","meaning_category":"人々・コミュニティ"},{"sentence":"The conference explored the historical and cultural connections between Italy and the Hispanic world, focusing on Italo-Hispanic influences in art and music.","translation":"会議では、イタリアとヒスパニック世界の歴史的および文化的なつながりが探求され、芸術と音楽におけるイタリア系ヒスパニックの影響に焦点が当てられた。","type":"adjective","meaning_category":"文化・歴史"}]}