{"word":"Intitling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of creating a title or heading.","english_definition":"The act or process of creating or providing a title or heading for something, such as a document, article, or piece of artwork.","examples":[{"sentence":"The intitling of the document was the final step before submission.","translation":"書類の題名を付けることが、提出前の最後のステップでした。"},{"sentence":"The artist spent considerable time on the intitling of his new painting.","translation":"アーティストは、彼の新しい絵の題名を付けることにかなりの時間を費やしました。"}],"collocations":["document intitling","article intitling","artwork intitling"],"synonyms":["titling","heading","captioning"],"antonyms":["untitling","de-titling"]}],"etymology":{"value":"Derived from the verb 'intitle,' which means to give a title to. The prefix 'in-' here implies the action of putting a title on something.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtaɪtlɪŋ/","syllables":"in-ti-tling"},"inflection":{"noun_plural":"Intitlings"},"usage_notes":{"explanation":"'Intitling' is a relatively uncommon word, primarily used in formal or technical contexts where the act of creating a title is being specifically discussed. It is more frequently encountered in writing or discussions about writing, design, or information management.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intitling was done by the secretary.","correct":"✓ The titling was done by the secretary.","note":"'Titling' is a more common and widely understood term for the process of creating titles."},{"incorrect":"✗ The intitling of the book was very creative.","correct":"✓ The title of the book was very creative.","note":"When referring to the title itself, use 'title' rather than 'intitling'."}],"priority":"★★☆"},"related_words":{"derivatives":["intitle (verb)","title (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intitling' refers to the act of creating a title. It is a less common term than 'titling'. It is typically used in formal or technical contexts. Understanding this word requires a good grasp of vocabulary related to writing and document management."},"example_sentences":[{"sentence":"The meticulous intitling of each chapter enhanced the document's clarity.","translation":"各章の綿密な題名付けは、文書の明瞭さを高めました。","type":"noun","meaning_category":"Act of creating a title"},{"sentence":"Proper document management includes careful intitling to ensure easy retrieval.","translation":"適切な文書管理には、容易な検索を保証するための注意深い題名付けが含まれます。","type":"noun","meaning_category":"Act of creating a title"}]}