{"word":"naggingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"しつこく、うるさく、せがむように","english_definition":"in a persistently annoying or troublesome manner.","examples":[{"sentence":"The question kept naggingly coming back to her mind.","translation":"その疑問は彼女の心に何度も何度も、しつこく浮かんできた。"},{"sentence":"He felt naggingly uncomfortable about the situation.","translation":"彼はその状況について、何かしつこく不快な感じを抱いていた。"},{"sentence":"She naggingly reminded him to take out the trash.","translation":"彼女は彼にゴミ出しをするように、しつこく注意した。"}],"collocations":["naggingly persistent","naggingly present","naggingly recurring","naggingly bothersome","naggingly remind"],"synonyms":["persistently","annoyingly","troublesomely","irritatingly","incessantly","constantly","repeatedly"],"antonyms":["fleetingly","momentarily","transiently","briefly"]}],"etymology":{"value":"The word 'naggingly' is derived from the verb 'nag,' which means to annoy or irritate someone with persistent fault-finding or requests. The suffix '-ingly' is added to form an adverb, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnæɡɪŋli/","syllables":"nag-ging-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Naggingly' describes an action or feeling that is persistently annoying or troublesome. It often implies a sense of irritation or discomfort due to the repetitive or bothersome nature of something. It is used to emphasize the annoying or persistent quality of an action, thought, or feeling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt naggingly.","correct":"✓ She felt naggingly uncomfortable.","note":"'Naggingly' is an adverb and should be used to modify verbs, adjectives, or other adverbs, not stand alone as a predicate."},{"incorrect":"✗ He is naggingly.","correct":"✓ He is nagging.","note":"'Naggingly' is an adverb, not an adjective. Use 'nagging' as an adjective to describe someone who nags."}],"priority":"★★☆"},"related_words":{"derivatives":["nag (verb, noun)","nagger (noun)","nagging (adjective, noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Naggingly' is an adverb that describes something that is done in a way that is persistently annoying or troublesome. It's not a common word, so it's more likely to be found in advanced texts where the author wants to convey a sense of ongoing irritation or discomfort. It's formed by adding '-ingly' to the adjective 'nagging,' which comes from the verb 'nag' (to bother or annoy someone repeatedly)."},"example_sentences":[{"sentence":"The doubt persisted, naggingly reminding her of her past mistakes.","translation":"その疑念は消えず、過去の過ちをしつこく思い出させた。","type":"adverb","meaning_category":"しつこく"},{"sentence":"He felt naggingly aware that he had forgotten something important.","translation":"彼は何か重要なことを忘れているという感覚が、しつこくつきまとった。","type":"adverb","meaning_category":"うるさく"},{"sentence":"The pain throbbed naggingly in his injured knee.","translation":"痛みが彼の負傷した膝の中で、しつこくズキズキと疼いた。","type":"adverb","meaning_category":"せがむように"}]}