{"word":"emancipable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"解放されうる、自由になれる","english_definition":"Capable of being emancipated; able to be freed from legal, social, or political restraints.","examples":[{"sentence":"The enslaved people were emancipable under the new law.","translation":"その奴隷にされた人々は、新しい法律の下で解放されうる存在だった。"},{"sentence":"Whether these young adults are emancipable from their parents' control is a complex question.","translation":"これらの若い成人が親の支配から解放されうるかどうかは、複雑な問題である。"}],"collocations":["potentially emancipable","legally emancipable"],"synonyms":["liberatable","releasable","redeemable"],"antonyms":["inescapable","unredeemable","unliberatable"]}],"etymology":{"value":"From 'emancipate' (to free from restraint, control, or the power of another) + '-able' (capable of being). 'Emancipate' comes from Latin 'emancipare,' meaning to release a son from paternal authority.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmænsɪpəbəl/","syllables":"e-man-ci-pa-ble"},"inflection":{"notes":"Adjectives do not typically inflect, but can be modified by adverbs (e.g., 'easily emancipable')."},"usage_notes":{"explanation":"'Emancipable' is a relatively rare word, primarily used in legal, social, or political contexts to describe someone or something that has the potential to be freed from some form of control or restriction. It suggests a possibility or potential for emancipation, rather than a current state of freedom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emancipable child was already emancipated.","correct":"✓ The child was already emancipated.","note":"'Emancipable' describes the *potential* for emancipation. If someone *is* emancipated, use 'emancipated'."},{"incorrect":"✗ The emancipable situation was resolved.","correct":"✓ The situation that could lead to emancipation was resolved.","note":"'Emancipable' usually refers to people, not situations. Rephrase to clarify the potential for a person to be freed."}],"priority":"★★☆"},"related_words":{"derivatives":["emancipate (verb): to free from restraint or control","emancipation (noun): the act of freeing or the state of being freed","emancipated (adjective): freed from restraint or control"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emancipable' is a formal and uncommon word that means 'capable of being freed.' It is most often used in legal or sociological discussions about the possibility of someone being released from legal, social, or political constraints. Because it describes a potential state rather than a current one, it requires a nuanced understanding of the concept of emancipation."},"example_sentences":[{"sentence":"The court considered whether the minor was emancipable based on their ability to support themselves.","translation":"裁判所は、未成年者が自立できる能力に基づいて解放されうるかどうかを検討した。","type":"adjective","meaning_category":"capable of being freed"},{"sentence":"Despite the oppressive regime, many believed the political prisoners were ultimately emancipable.","translation":"抑圧的な体制にもかかわらず、多くの人々は政治犯が最終的には解放されうると信じていた。","type":"adjective","meaning_category":"capable of being freed"},{"sentence":"The question of whether animals are emancipable from human control raises complex ethical issues.","translation":"動物が人間の支配から解放されうるかという問題は、複雑な倫理的問題を提起する。","type":"adjective","meaning_category":"capable of being freed"}]}