{"word":"untransparentness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不透明さ、透明でないこと、不明瞭さ、分かりにくさ","english_definition":"The state or quality of being not transparent; lack of clarity or transparency.","examples":[{"sentence":"The untransparentness of the government's financial dealings raised concerns.","translation":"政府の金融取引の不透明さが懸念を引き起こした。"},{"sentence":"The untransparentness of the glass made it difficult to see through.","translation":"そのガラスの不透明さのせいで、向こう側が見えにくかった。"},{"sentence":"The untransparentness of the policy made it difficult for citizens to understand its implications.","translation":"その政策の不明瞭さのために、市民はその影響を理解するのが難しかった。"}],"collocations":["lack of transparentness","degree of untransparentness","unacceptable untransparentness"],"synonyms":["opacity","opaqueness","lack of clarity","ambiguity","obscurity","murkiness"],"antonyms":["transparency","clarity","lucidity","clearness"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"transparent\" + \"-ness\" (名詞を作る接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌntrænˈspærəntnəs/","syllables":"un-trans-par-ent-ness"},"inflection":{"noun_plural":"untransparentnesses (rarely used)"},"usage_notes":{"explanation":"\"Untransparentness\" is a relatively uncommon word, typically used in formal contexts to describe a lack of transparency, either literally (in terms of physical materials) or figuratively (in terms of information, processes, or systems). It often carries a negative connotation, suggesting that something is deliberately hidden or unclear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untransparentness of the water.","correct":"✓ The opacity of the water.","note":"In most contexts referring to physical materials, \"opacity\" is a more common and natural-sounding word than \"untransparentness.\""},{"incorrect":"✗ The untransparentness of the decision.","correct":"✓ The lack of transparency in the decision.","note":"When referring to abstract concepts like decisions or processes, \"lack of transparency\" is often preferred over \"untransparentness.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["untransparent (adjective)"],"phrases":["lack of transparency","absence of transparency"],"related_concepts":["opacity","transparency","clarity","ambiguity","obscurity"]},"level_frequency":{"CEFR":"C2 (very rare)","frequency_google_ngram":"Extremely Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"untransparentness\" is a formal and uncommon term that means the quality of not being transparent or clear. It's usually used in discussions about abstract things like government policies or business practices when there's a lack of openness or clarity. Because it's not a frequently used word, it's more likely to be found in academic or professional writing rather than everyday conversation. It's formed by adding the prefix \"un-\" (meaning \"not\") and the suffix \"-ness\" (which turns an adjective into a noun) to the word \"transparent.\""},"example_sentences":[{"sentence":"The auditor criticized the untransparentness of the company's accounting methods.","translation":"監査人は、その会社の会計方法の不透明さを批判した。","type":"general"},{"sentence":"The investigation focused on the untransparentness surrounding the contract negotiations.","translation":"調査は、契約交渉をめぐる不透明さに焦点を当てた。","type":"general"},{"sentence":"The journalist highlighted the untransparentness of the data collection process.","translation":"ジャーナリストは、データ収集プロセスの不透明さを強調した。","type":"general"}]}