{"word":"Patroclinic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Inheriting more traits from the father's side of the family than the mother's.","english_definition":"Relating to or exhibiting inheritance of characteristics primarily from the paternal side.","examples":[{"sentence":"The child's strong build and athletic ability are patroclinic, clearly inherited from his father's side of the family.","translation":"その子の強い体格と運動能力は父方からの遺伝であり、明らかに父親の家系から受け継がれている。"},{"sentence":"While she has her mother's eyes, her personality is decidedly patroclinic, mirroring her father's temperament.","translation":"彼女は母親の目を持っているが、性格は明らかに父方からの遺伝で、父親の気質を反映している。"}],"collocations":["patroclinic inheritance","patroclinic traits","patroclinic resemblance"],"synonyms":["paternally inherited","father-derived"],"antonyms":["matroclinic","maternally inherited"]}],"etymology":{"value":"Derived from the Greek words 'pater' (father) and 'klinein' (to lean or incline), indicating a leaning or inclination towards the paternal side in terms of inherited traits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpætroʊˈklɪnɪk/","syllables":"Pa-tro-clin-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Patroclinic' is used in genetics and biology to describe the inheritance patterns where offspring resemble the paternal side of the family more closely than the maternal side. It is often used in contrast to 'matroclinic,' which describes the opposite phenomenon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is patroclinic, so only males are affected.","correct":"✓ The disease is X-linked, so only males are affected.","note":"'Patroclinic' refers to inheritance of general traits, not specifically sex-linked conditions. Use 'X-linked' or 'Y-linked' for sex-specific inheritance."},{"incorrect":"✗ He is patroclinic because he supports his father's political views.","correct":"✓ He resembles his father greatly in his political views.","note":"'Patroclinic' refers to genetic inheritance, not alignment of opinions or behaviors."}],"priority":"★★☆"},"related_words":{"derivatives":["patrocliny (noun)"],"related_terms":["matroclinic","inheritance","genetics","paternal","maternal"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized vocabulary used in genetics and biology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Patroclinic' is a specialized term used in the field of genetics to describe when an offspring exhibits more traits inherited from the father's side of the family than the mother's side. It's not a commonly used word and is typically found in scientific or academic contexts. Understanding this term requires a background in biology or genetics. It is often contrasted with 'matroclinic,' which refers to the opposite phenomenon where offspring resemble the maternal side more closely."},"example_sentences":[{"sentence":"The researcher observed a patroclinic pattern of inheritance in the family, with the children displaying several physical characteristics similar to their father.","translation":"研究者は、その家族において父方からの遺伝パターンを観察し、子供たちは父親に似たいくつかの身体的特徴を示していた。","type":"general","meaning_category":"Inheritance"},{"sentence":"Due to patroclinic inheritance, the son inherited his father's predisposition to certain allergies.","translation":"父方からの遺伝により、息子は父親のアレルギーに対する素因を受け継いだ。","type":"medical","meaning_category":"Inheritance"},{"sentence":"The study aimed to identify the specific genes responsible for the patroclinic expression of these traits.","translation":"その研究は、これらの特徴の父方からの遺伝的発現に関与する特定の遺伝子を特定することを目的としていた。","type":"scientific","meaning_category":"Genetics"}]}