{"word":"proliferation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(急速な) 増加、拡散、増殖","english_definition":"a rapid increase in numbers; a large number of something.","examples":[{"sentence":"The proliferation of nuclear weapons is a serious threat to world peace.","translation":"核兵器の拡散は、世界の平和に対する深刻な脅威です。"},{"sentence":"We are concerned about the proliferation of misinformation online.","translation":"私たちは、オンラインでの誤情報の拡散を懸念しています。"},{"sentence":"The city has seen a proliferation of new restaurants in recent years.","translation":"近年、その都市では新しいレストランが急増しています。"},{"sentence":"The proliferation of mobile devices has changed the way people communicate.","translation":"モバイルデバイスの普及は、人々のコミュニケーション方法を変えました。"}],"collocations":["nuclear proliferation (核拡散)","weapon proliferation (兵器拡散)","proliferation of information (情報の拡散)","proliferation of technology (技術の普及)","prevent proliferation (拡散を防ぐ)","rapid proliferation (急速な拡散)"],"synonyms":["increase","spread","growth","expansion","buildup","multiplication","escalation"],"antonyms":["decrease","reduction","decline","contraction","curtailment"]}],"etymology":{"value":"Late Middle English: from French prolifération, from late Latin proliferatio(n-), from proliferare ‘bear offspring’ (see proliferate).","priority":"★★★"},"pronunciation":{"ipa":"/prəˌlɪfəˈreɪʃən/","syllables":"pro-lif-er-a-tion"},"inflection":{"noun_plural":"proliferations"},"usage_notes":{"explanation":"\"Proliferation\" refers to a rapid and often uncontrolled increase or spread of something. It is often used in the context of negative or concerning developments, such as the spread of weapons, diseases, or misinformation. While it can sometimes be used in a neutral sense to describe the growth of something positive, it often carries a connotation of being excessive or problematic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The proliferation of the company's profits was unexpected.","correct":"✓ The increase in the company's profits was unexpected.","note":"While \"proliferation\" can be used to describe growth, it's usually reserved for situations involving a rapid and potentially problematic increase. \"Increase\" is a more general term for growth."},{"incorrect":"✗ We need to stop the proliferate of nuclear weapons.","correct":"✓ We need to stop the proliferation of nuclear weapons.","note":"\"Proliferate\" is the verb form. The noun form, which is needed after \"the\", is \"proliferation\"."}],"priority":"★★☆"},"related_words":{"derivatives":["proliferate (verb: to increase rapidly in numbers; to multiply)","proliferative (adjective: tending to increase or spread rapidly)"],"phrasal_verbs":[],"related_concepts":["epidemiology (疫学 - 感染症の拡散の研究)","arms control (軍備管理 - 兵器拡散の抑制)","population growth (人口増加)","urban sprawl (都市のスプロール現象 - 都市の無秩序な拡大)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, but more common in formal and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"proliferation\" is a formal term that means a rapid and often excessive increase or spread of something. It's often used to describe the spread of things that are considered undesirable or dangerous, such as weapons or diseases. Because it's a more advanced word, it's more commonly found in academic or formal writing and speech.","priority":"★★☆"},"example_sentences":[{"sentence":"The **proliferation** of fake news is a major challenge for democracies.","translation":"フェイクニュースの拡散は、民主主義にとって大きな課題です。","type":"noun","meaning_category":"増加・拡散"},{"sentence":"Efforts to prevent nuclear **proliferation** are essential for global security.","translation":"核拡散を防ぐための努力は、世界の安全保障にとって不可欠です。","type":"noun","meaning_category":"増加・拡散"},{"sentence":"The **proliferation** of online shopping has transformed the retail industry.","translation":"オンラインショッピングの普及は、小売業界を変革しました。","type":"noun","meaning_category":"増加・拡散"},{"sentence":"The rapid **proliferation** of social media has both positive and negative consequences.","translation":"ソーシャルメディアの急速な普及は、プラスとマイナスの両方の結果をもたらしています。","type":"noun","meaning_category":"増加・拡散"}]}