{"word":"eluvial","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"溶脱した、洗い去られた、溶脱層の","english_definition":"pertaining to or resulting from eluvation; relating to the removal of soil material in solution (eluviation).","examples":[{"sentence":"The eluvial horizon is characterized by a loss of clay, iron, or aluminum.","translation":"溶脱層は、粘土、鉄、またはアルミニウムの損失によって特徴付けられる。"},{"sentence":"Eluvial deposits are often found above illuvial horizons.","translation":"溶脱堆積物は、しばしば集積層の上に発見される。"}],"collocations":["eluvial horizon","eluvial layer","eluvial deposit"],"synonyms":["leached","washed out","eluviated"],"antonyms":["illuvial"],"notes":["Used primarily in soil science and geology."]}],"etymology":{"value":"From Latin 'ex' (out of) + 'luere' (to wash), referring to the washing out of soil constituents.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈluːviəl/","syllables":"e-lu-vi-al"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'eluvial' is used in the context of soil formation and geology to describe the process and characteristics of soil layers where minerals and other materials have been leached or washed out by water. It's the opposite of 'illuvial', which describes the layer where those materials accumulate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The alluvial soil was eluvial.","correct":"The eluvial horizon was depleted of nutrients.","note":"'Eluvial' refers to the process of removal, not the deposition of material like 'alluvial'."}],"priority":"★☆☆"},"related_words":{"derivatives":["eluviation (noun): the process of removing soil material in solution.","eluvium (noun): material removed by eluviation."],"related_terms":["illuvial","leaching","soil horizon","pedogenesis"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized vocabulary used in soil science and geology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eluvial' is a technical term primarily used in soil science and geology. It describes the process where water removes minerals and other materials from the upper layers of soil, leaving behind a distinct layer known as the eluvial horizon. Understanding this term requires familiarity with soil formation processes."},"example_sentences":[{"sentence":"The sandy texture of the A horizon is due to eluvial processes.","translation":"A層の砂のような質感は、溶脱プロセスによるものである。","type":"adjective","meaning_category":"溶脱した"},{"sentence":"Analysis of the eluvial zone revealed a high concentration of quartz.","translation":"溶脱帯の分析により、石英の高濃度が明らかになった。","type":"adjective","meaning_category":"溶脱層の"}]}