{"word":"elocutive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"雄弁な、弁の立つ","english_definition":"Having or characterized by eloquence; expressing oneself readily, clearly, and effectively.","examples":[{"sentence":"She delivered an elocutive speech that captivated the audience.","translation":"彼女は聴衆を魅了する雄弁なスピーチを行った。"},{"sentence":"He was known for his elocutive style of writing.","translation":"彼はその弁の立つ文体で知られていた。"}],"collocations":["elocutive speaker","elocutive style","elocutive speech","elocutive presentation"],"synonyms":["eloquent","articulate","fluent","expressive","well-spoken","persuasive"],"antonyms":["inarticulate","hesitant","stammering","taciturn"]}],"etymology":{"value":"Derived from 'elocution', which comes from Latin 'ēloquentia' (eloquence), from 'ēloquēns' (speaking out), present participle of 'ēloquī' (to speak out).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɒkjətɪv/","syllables":"e-loc-u-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more elocutive' and 'most elocutive', respectively, although these are not commonly used."},"usage_notes":{"explanation":"'Elocutive' is typically used to describe someone or something that demonstrates a high degree of skill in speaking or writing. It emphasizes the clarity, fluency, and effectiveness of expression. While 'eloquent' is a more common synonym, 'elocutive' specifically relates to the art of elocution, which is the skill of clear and expressive speech, especially of distinct pronunciation and articulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The elocutive of the machine was impressive.","correct":"✓ The eloquence of the machine was impressive.","note":"'Elocutive' describes the quality of being eloquent, not a thing itself. Use 'eloquence' for the noun form."},{"incorrect":"✗ He was an elocutive person, so he didn't need to practice.","correct":"✓ He was an eloquent person, so he didn't need to practice.","note":"'Eloquent' is more commonly used to describe a person's general ability to speak well. 'Elocutive' is more specific to the skill of elocution."}],"priority":"★☆☆"},"related_words":{"derivatives":["elocution (名詞: 雄弁術、演説法)","elocutionist (名詞: 雄弁家、演説家)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Elocutive' is a relatively uncommon word used to describe something characterized by eloquence or skill in speaking. It is more specific than 'eloquent' as it relates directly to the art of elocution, emphasizing clear and effective expression. Due to its infrequent use, it is more likely to be encountered in formal or academic contexts."},"example_sentences":[{"sentence":"The professor's elocutive lectures were always well-attended.","translation":"その教授の雄弁な講義はいつもよく出席されていた。","type":"adjective","meaning_category":"雄弁な"},{"sentence":"Her elocutive performance won her first place in the competition.","translation":"彼女の弁の立つ演技は、コンテストで彼女に一位をもたらした。","type":"adjective","meaning_category":"弁の立つ"},{"sentence":"The elocutive quality of his writing made complex ideas accessible.","translation":"彼の文章の雄弁な質は、複雑なアイデアを理解しやすくした。","type":"adjective","meaning_category":"雄弁な"}]}