{"word":"brachymetropia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"眼軸長が短いために起こる屈折異常。遠視を引き起こす。","english_definition":"A refractive error in which the eyeball is abnormally short, leading to hyperopia (farsightedness).","examples":[{"sentence":"Brachymetropia is a common cause of hyperopia.","translation":"眼軸短縮症は遠視の一般的な原因です。"},{"sentence":"The patient was diagnosed with brachymetropia after an eye exam.","translation":"患者は眼科検査の結果、眼軸短縮症と診断されました。"}],"collocations":["axial brachymetropia","refractive brachymetropia"],"synonyms":["hyperopia","farsightedness"],"antonyms":["myopia","nearsightedness"]}],"etymology":{"value":"From 'brachy-' (short) + 'metr-' (measure) + '-opia' (vision condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbrækiːmɪˈtroʊpiə/","syllables":"bra-chy-me-tro-pi-a"},"inflection":{"noun_plural":"brachymetropias"},"usage_notes":{"explanation":"Brachymetropia is a medical term specifically used in ophthalmology to describe a condition where the eyeball is shorter than normal, causing light to focus behind the retina. This results in difficulty seeing near objects clearly, a condition known as hyperopia or farsightedness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Brachymetropia is when you can see things far away clearly.","correct":"✓ Brachymetropia is when you have trouble seeing things up close.","note":"Brachymetropia causes difficulty seeing near objects, not distant ones."}],"priority":"★★☆"},"related_words":{"derivatives":["brachy- (prefix: short)","metropia (refractive condition of the eye)","hyperopia (farsightedness)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency - a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Brachymetropia' is a technical term used by eye doctors (ophthalmologists) to describe a specific eye condition. It means that the eyeball is shorter than it should be, which makes it hard to see things that are close to you. This condition is also known as farsightedness or hyperopia. If you encounter this term, it's likely in a medical context related to eye health."},"example_sentences":[{"sentence":"The ophthalmologist explained that her blurred vision was due to brachymetropia.","translation":"眼科医は、彼女のぼやけた視界は眼軸短縮症によるものだと説明しました。","type":"medical condition","meaning_category":"eye condition"},{"sentence":"Corrective lenses are often prescribed to treat brachymetropia.","translation":"矯正レンズは、しばしば眼軸短縮症の治療のために処方されます。","type":"treatment","meaning_category":"eye condition"}]}