{"word":"Tembu","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A Sherpa ethnic group primarily residing in the Khumbu region of Nepal.","english_definition":"An endogamous clan within the Sherpa ethnic group, primarily residing in the Khumbu region of Nepal.","examples":[{"sentence":"The Tembu are known for their mountaineering skills.","translation":"テムブ族は登山技術で知られています。"},{"sentence":"Many famous Sherpa guides belong to the Tembu clan.","translation":"多くの有名なシェルパガイドがテムブ族に属しています。"}],"collocations":["Tembu Sherpa","Khumbu Tembu"],"synonyms":["Sherpa (more broadly)"],"antonyms":[]}],"etymology":{"value":"Derived from the Tibetan word 'Tem' meaning 'end' or 'final' and 'bu' which is a common suffix for names. It possibly refers to their location within the Khumbu region.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛmbuː/","syllables":"Tem-bu"},"inflection":{"notes":"Plural form is 'Tembu' or 'Tembus'"},"usage_notes":{"explanation":"'Tembu' specifically refers to a clan within the Sherpa community, particularly those from the Khumbu region. While all Tembu are Sherpa, not all Sherpa are Tembu. It's important to use the term accurately to avoid generalizations about the entire Sherpa population.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ All Sherpas are Tembu.","correct":"✓ Some Sherpas are Tembu.","note":"Tembu is a specific clan within the Sherpa ethnic group, not all Sherpas belong to this clan."}],"priority":"★★☆"},"related_words":{"derivatives":["Temba (related name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the Khumbu region and Sherpa culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tembu' is a specific term referring to a clan within the Sherpa ethnic group, primarily located in the Khumbu region of Nepal. Understanding this term requires knowledge of Sherpa culture and social structures. It's not a commonly used word outside of this context.","priority":"★★☆"},"example_sentences":[{"sentence":"Ang Rita Sherpa, a famous mountaineer, was a member of the Tembu clan.","translation":"有名な登山家であるアン・リタ・シェルパは、テムブ族の一員でした。","type":"noun","meaning_category":"ethnic group"},{"sentence":"The Tembu community plays a significant role in the tourism industry of the Khumbu region.","translation":"テムブ族のコミュニティは、クンブ地方の観光産業において重要な役割を果たしています。","type":"noun","meaning_category":"ethnic group"}]}