{"word":"iconographer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イコン画家、図像学者","english_definition":"A painter of icons; a specialist in the study of icons or religious images.","examples":[{"sentence":"The iconographer carefully applied gold leaf to the halo of the saint.","translation":"イコン画家は注意深く聖人の光輪に金箔を施した。"},{"sentence":"An expert iconographer was consulted to authenticate the ancient painting.","translation":"その古代絵画の鑑定のため、専門の図像学者が意見を求められた。"}],"collocations":["Byzantine iconographer","Russian iconographer","study of iconographers"],"synonyms":["icon painter","image scholar"],"antonyms":[]}],"etymology":{"value":"From 'icono-' (image) + '-grapher' (one who writes or depicts).","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈkɒnəɡrəfər/","syllables":"i-con-o-gra-pher"},"inflection":{"noun_plural":"iconographers"},"usage_notes":{"explanation":"An iconographer is someone who either paints icons (religious images, especially in the Eastern Christian tradition) or is a scholar who studies and interprets the meaning of icons and other religious imagery. The term is relatively specialized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an iconographer of modern art.","correct":"✓ He is an art historian specializing in modern art.","note":"'Iconographer' typically refers to someone who studies or creates religious icons, not modern art. Use 'art historian' or a more specific term for modern art specialists."}],"priority":"★☆☆"},"related_words":{"derivatives":["iconography (noun: the study or depiction of icons or religious images)","iconographic (adjective: relating to iconography)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'iconographer' is a specialized term referring to someone who either paints religious icons or is a scholar of religious imagery. It is not commonly used in everyday conversation. Understanding requires familiarity with art history or religious studies."},"example_sentences":[{"sentence":"The museum hired a renowned iconographer to restore the damaged Byzantine icons.","translation":"博物館は、損傷したビザンチン様式のイコンを修復するために、著名なイコン画家を雇いました。","type":"general","meaning_category":"イコン画家"},{"sentence":"As an iconographer, she dedicated her life to studying the symbolism in medieval religious art.","translation":"図像学者として、彼女は中世の宗教美術における象徴の研究に生涯を捧げました。","type":"general","meaning_category":"図像学者"}]}