{"word":"semiplume","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半綿羽（はんめんう）：軸があり、綿羽と正羽の中間の構造を持つ羽毛。保温性が高く、鳥類の体温維持に役立つ。","english_definition":"A type of feather that has a rachis (shaft) but lacks interlocking barbules, giving it a fluffy appearance. It provides insulation and fills out the contour of the bird's body.","examples":[{"sentence":"Semiplumes are found under the contour feathers of many bird species.","translation":"半綿羽は多くの鳥類の正羽の下に見られる。"},{"sentence":"The downy structure of semiplumes makes them excellent insulators.","translation":"半綿羽の綿毛のような構造は、優れた断熱材となる。"}],"collocations":["contour feathers and semiplumes (正羽と半綿羽)","insulating semiplumes (断熱性の半綿羽)","downy semiplumes (綿毛状の半綿羽)"],"synonyms":["down feather","plumule"],"antonyms":["contour feather","flight feather"]}],"etymology":{"value":"'Semi-' (半分) + 'plume' (羽毛) から構成される。綿羽と正羽の中間的な性質を持つことに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛmiˌpluːm/","syllables":"sem-i-plume"},"inflection":{"noun_plural":"semiplumes"},"usage_notes":{"explanation":"Semiplumes are a type of feather that provides insulation for birds. They are located between the down feathers and the contour feathers. Unlike down feathers, semiplumes have a rachis (central shaft), but unlike contour feathers, they lack the interlocking barbules that create a smooth, aerodynamic surface. This gives semiplumes a fluffy appearance and makes them excellent at trapping air and providing insulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Semiplume feathers are used for flight.","correct":"✓ Semiplume feathers are primarily for insulation, not flight.","note":"Semiplumes are primarily for insulation and filling out the body contour, not for flight. Flight feathers are contour feathers with interlocking barbules. "},{"incorrect":"✗ Semiplumes are the same as down feathers.","correct":"✓ Semiplumes are similar to down feathers but have a central rachis (shaft).","note":"While both are used for insulation, semiplumes have a central shaft (rachis), which down feathers lack."}],"priority":"★★☆"},"related_words":{"derivatives":["plumage (羽毛)","plumose (羽毛状の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な鳥類学の文脈で使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'semiplume' refers to a specific type of feather found on birds. These feathers are characterized by a central shaft (rachis) and fluffy barbules that do not interlock, providing excellent insulation. Unlike contour feathers used for flight, semiplumes primarily serve to trap air and maintain the bird's body temperature. Understanding the structure and function of semiplumes requires some knowledge of avian anatomy and physiology."},"example_sentences":[{"sentence":"The bird's body was covered in a layer of semiplumes, providing excellent insulation against the cold.","translation":"その鳥の体は半綿羽の層で覆われており、寒さに対して優れた断熱性を提供していた。","type":"noun","meaning_category":"羽毛の種類"},{"sentence":"Semiplumes are often used in bedding and clothing for their insulating properties.","translation":"半綿羽は、その断熱性から寝具や衣料品によく使用される。","type":"noun","meaning_category":"用途"}]}