{"word":"slurban","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に軽蔑的に) スプロール現象が起きた郊外地域、都市部から離れた住宅地で、都市的な便利さや活気が欠けている場所","english_definition":"(chiefly derogatory) A suburban area characterized by sprawl, typically lacking the amenities and vibrancy of urban areas.","examples":[{"sentence":"The new development was just another faceless slurban, indistinguishable from countless others.","translation":"その新しい開発地は、他の無数の場所と区別がつかない、また別の個性のないスラーバンに過ぎなかった。"},{"sentence":"He grew up in a slurban where everyone drove everywhere and there was nothing to do.","translation":"彼はどこへ行くにも車が必要で、何もすることがないスラーバンで育った。"}],"collocations":["suburban sprawl","urban blight","cookie-cutter houses","lack of community","car-dependent"],"synonyms":["suburban sprawl","bedroom community","exurb","edge city"],"antonyms":["urban center","city core","downtown area"]},{"part_of_speech":"adjective","definition":"スラーバンの、スプロール化した郊外の","english_definition":"Relating to or characteristic of a slurban.","examples":[{"sentence":"The slurban landscape was dominated by strip malls and parking lots.","translation":"スラーバンの景観は、ストリップモールと駐車場が支配的だった。"},{"sentence":"Slurban life can be isolating for those without a car.","translation":"スラーバンでの生活は、車がない人にとっては孤立しがちだ。"}],"collocations":["slurban development","slurban lifestyle","slurban landscape"],"synonyms":["suburban","sprawling","car-dependent"],"antonyms":["urban","metropolitan","compact"]}],"etymology":{"value":"\"Slurban\" is a portmanteau of \"slum\" and \"suburban,\" suggesting a negative view of suburban sprawl as being similar to a slum in its lack of amenities and community.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslɜːrbən/","syllables":"slur-ban"},"inflection":{"notes":"Regular noun and adjective inflection."},"usage_notes":{"explanation":"The term \"slurban\" is often used pejoratively to criticize the perceived monotony, lack of walkability, and social isolation of certain suburban areas. It implies that these areas lack the positive qualities of both urban and rural environments, combining the worst aspects of both.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The slurban is very crowded and has lots of public transport.","correct":"✓ The slurban is very spread out and lacks public transport.","note":"Slurbans are typically characterized by low density and a lack of public transportation, the opposite of crowded urban areas."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Low frequency - relatively uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Slurban\" is a relatively uncommon and somewhat informal term used to describe suburban areas that are considered to be sprawling, lacking in character, and overly dependent on cars. It carries a negative connotation, suggesting that these areas are undesirable places to live due to their lack of urban amenities and community. The term is often used in discussions about urban planning and the problems associated with suburban sprawl."},"example_sentences":[{"sentence":"Critics argue that slurbans contribute to environmental problems due to increased car use.","translation":"批評家たちは、スラーバンは自動車利用の増加により環境問題に寄与していると主張する。","type":"noun","meaning_category":"スプロール現象が起きた郊外地域"},{"sentence":"The slurban architecture was bland and uninspired.","translation":"スラーバンの建築は平凡で独創性に欠けていた。","type":"adjective","meaning_category":"スラーバンの"}]}