{"word":"bushmaster","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物)ブッシュマスター (中南米に生息する大型の毒ヘビ)","english_definition":"A large, venomous snake (Lachesis muta) found in Central and South America. It is the longest venomous snake in the Americas.","examples":[{"sentence":"The bushmaster is a nocturnal predator.","translation":"ブッシュマスターは夜行性の捕食者です。"},{"sentence":"Bushmasters are relatively rare and not often encountered.","translation":"ブッシュマスターは比較的珍しく、めったに出会うことはありません。"},{"sentence":"The bushmaster's venom is highly potent.","translation":"ブッシュマスターの毒は非常に強力です。"}],"collocations":["bushmaster snake","bushmaster venom","bushmaster habitat"],"synonyms":["Lachesis muta"],"antonyms":[]},{"part_of_speech":"noun","definition":"(銃器)ブッシュマスター (銃器メーカーまたはその製品)","english_definition":"A brand of firearms, especially rifles, manufactured by Bushmaster Firearms International.","examples":[{"sentence":"He owns a Bushmaster AR-15 rifle.","translation":"彼はブッシュマスターAR-15ライフルを所有しています。"},{"sentence":"The Bushmaster company produces a variety of firearms.","translation":"ブッシュマスター社は様々な銃器を製造しています。"},{"sentence":"Bushmaster rifles are popular among sport shooters.","translation":"ブッシュマスターのライフルはスポーツシューターに人気があります。"}],"collocations":["Bushmaster rifle","Bushmaster AR-15","Bushmaster firearm"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The snake's name likely comes from its habitat in the bush or forest and its master-like size and reputation. The firearms company likely adopted the name for its association with strength and ruggedness.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊʃˌmæstər/","syllables":"bush-mas-ter"},"inflection":{"noun_plural":"bushmasters"},"usage_notes":{"explanation":"The term \"bushmaster\" can refer to either a venomous snake or a brand of firearms. Context is crucial to understanding which meaning is intended. When referring to the snake, it is often specified as \"bushmaster snake\" to avoid ambiguity. When referring to the firearm, it is often used with the specific model name (e.g., Bushmaster AR-15).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a bushmaster in my backyard. (in North America)","correct":"✓ I saw a garter snake in my backyard.","note":"Bushmasters are native to Central and South America, so seeing one in North America (outside of a zoo or specialized facility) would be highly unlikely. A more common snake would be expected."},{"incorrect":"✗ Bushmaster is a type of pistol.","correct":"✓ Bushmaster is a type of rifle.","note":"Bushmaster is primarily known for manufacturing rifles, particularly AR-15 style rifles, not pistols."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["snake","rifle","firearm","venomous","AR-15"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical contexts)","frequency_google_ngram":"Relatively low frequency, more common in specific contexts (e.g., zoology, firearms).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"bushmaster\" has two distinct meanings: a venomous snake found in Central and South America, and a brand of firearms. Understanding the intended meaning requires careful attention to context. In zoological or herpetological contexts, it refers to the snake. In discussions about firearms, it typically refers to the Bushmaster Firearms International company or its products, particularly rifles. Due to its relatively low frequency and specialized usage, familiarity with the term is more common among those with specific interests in these areas."},"example_sentences":[{"sentence":"The zoologist carefully studied the bushmaster's behavior in its natural habitat.","translation":"動物学者は、自然の生息地におけるブッシュマスターの行動を注意深く研究しました。","type":"noun","meaning_category":"snake"},{"sentence":"The Bushmaster AR-15 is a popular choice for sport shooting.","translation":"ブッシュマスターAR-15は、スポーツ射撃に人気の選択肢です。","type":"noun","meaning_category":"firearm"},{"sentence":"Researchers are working on an antivenom for bushmaster bites.","translation":"研究者たちは、ブッシュマスターの咬傷に対する抗毒素を研究しています。","type":"noun","meaning_category":"snake"},{"sentence":"The gun store had a wide selection of Bushmaster rifles.","translation":"銃砲店には、ブッシュマスターのライフルが豊富に揃っていました。","type":"noun","meaning_category":"firearm"}]}