{"word":"Gongorist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文学) ゴンゴラ主義者：17世紀スペインの詩人ルイス・デ・ゴンゴラの文体を模倣する人。難解で技巧的な表現を好み、比喩や新語を多用する。","english_definition":"(literature) A follower of Gongorism, the elaborate and affected style of the 17th-century Spanish poet Luis de Góngora, characterized by obscurity, artificiality, and the use of complex metaphors and neologisms.","examples":[{"sentence":"The critic dismissed the poet as a mere Gongorist, lacking substance beneath the ornate language.","translation":"批評家は、その詩人を単なるゴンゴラ主義者だと切り捨て、華麗な言葉の裏に中身がないと評した。"},{"sentence":"While some admired his skill, others found the Gongorist's poetry impenetrable and pretentious.","translation":"彼の技巧を賞賛する人もいたが、ゴンゴラ主義者の詩は難解で気取っていると感じる人もいた。"}],"collocations":["Gongorist poetry (ゴンゴラ主義の詩)","Gongorist style (ゴンゴラ主義の文体)","a follower of Gongorism (ゴンゴラ主義の信奉者)"],"synonyms":["culteranist","euphuist","mannerist"],"antonyms":[]}],"etymology":{"value":"スペインの詩人ルイス・デ・ゴンゴラ（Luis de Góngora, 1561-1627）の名に由来する。ゴンゴラの文体は「ゴンゴラ主義」（Gongorism）と呼ばれ、その文体を模倣する人を指す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɒŋɡərɪst/","syllables":"Gon-gor-ist"},"inflection":{"noun_plural":"Gongorists"},"usage_notes":{"explanation":"「Gongorist」は、文学史において特定の文体を指す専門的な用語であり、日常会話ではほとんど使われません。ゴンゴラ主義は、バロック文学の一形態であり、高度な修辞技巧や複雑な構文を特徴とします。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Gongorist in his painting style.","correct":"✓ He was a mannerist in his painting style.","note":"「Gongorist」は主に文学における文体を指すため、絵画などの他の芸術分野には「mannerist」（マニエリスム）などの別の用語を使用する方が適切です。"},{"incorrect":"✗ The poem was simple and direct, a true Gongorist work.","correct":"✓ The poem was complex and ornate, a true Gongorist work.","note":"ゴンゴラ主義の作品は、複雑で技巧的であることが特徴です。単純で直接的な作品をゴンゴラ主義と呼ぶのは誤りです。"}],"priority":"★★☆"},"related_words":{"derivatives":["Gongorism (ゴンゴラ主義)","Gongoristic (ゴンゴラ主義的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (文学研究)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Gongorist**」は、17世紀のスペインの詩人ルイス・デ・ゴンゴラの文体を真似る人を指す、非常に専門的な文学用語です。ゴンゴラの文体（ゴンゴラ主義）は、難解で技巧的な表現、複雑な比喩、新語の使用を特徴とします。この単語は、文学研究や批評の文脈でのみ使用され、日常会話ではほとんど使われません。ゴンゴラ主義の詩は、その複雑さからしばしば難解であると見なされます。"},"example_sentences":[{"sentence":"The professor lectured on the characteristics of a **Gongorist** writer.","translation":"教授はゴンゴラ主義の作家の特徴について講義した。","type":"noun","meaning_category":"ゴンゴラ主義者"},{"sentence":"His early poems showed some **Gongorist** tendencies, but he later adopted a simpler style.","translation":"彼の初期の詩にはゴンゴラ主義的な傾向がいくつか見られたが、後に彼はよりシンプルな文体を採用した。","type":"adjective (implied)","meaning_category":"ゴンゴラ主義的な"}]}