{"word":"disimuladamente","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"隠して、ひそかに、それとなく、気づかれないように","english_definition":"covertly, secretly, surreptitiously, discreetly, stealthily, in a concealed or disguised manner; without showing one's true feelings or intentions.","examples":[{"sentence":"Observó disimuladamente a la persona que le interesaba.","translation":"He discreetly observed the person he was interested in.","note":"He watched the person he was interested in without making it obvious."},{"sentence":"Disimuladamente, sacó una foto con su teléfono.","translation":"She secretly took a photo with her phone.","note":"She took a picture with her phone without anyone noticing."},{"sentence":"Intentó disimuladamente averiguar qué había pasado.","translation":"He tried to subtly find out what had happened.","note":"He tried to discover what happened without being obvious or direct."}],"collocations":["actuar disimuladamente (to act discreetly)","observar disimuladamente (to observe discreetly)","esconder disimuladamente (to hide discreetly)"],"synonyms":["secretamente","ocultamente","subrepticiamente","sutilmente","discretamente","furtivamente","clandestinamente"],"antonyms":["abiertamente","claramente","evidentemente","públicamente"]}],"etymology":{"value":"Derived from the Spanish word 'disimulado' (dissimulated, concealed) and the adverbial suffix '-mente' (meaning 'in a manner'). The root verb 'disimular' comes from Latin 'dissimulare' (to conceal, dissemble).","priority":"N/A"},"pronunciation":{"ipa":"/di.si.mu.laˈða.men.te/","syllables":"di-si-mu-la-da-men-te"},"inflection":{"notes":"Adverbs in Spanish do not inflect. This adverb is formed by adding '-mente' to the feminine singular form of the adjective 'disimulado'."},"usage_notes":{"explanation":"'Disimuladamente' describes actions done in a way that avoids drawing attention or revealing one's true intentions. It implies a degree of cunning or strategy in concealing something. It is often used when someone wants to hide their feelings, actions, or the true nature of a situation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Él habló disimuladamente fuerte.","correct":"Él habló disimuladamente. / Él habló en voz baja.","note":"'Disimuladamente' describes the manner of the action, not the intensity. To describe speaking quietly, use 'en voz baja' or a similar phrase."},{"incorrect":"Ella es disimuladamente triste.","correct":"Ella está disimuladamente triste.","note":"'Disimuladamente' is an adverb and modifies verbs or adverbs, not adjectives. To describe someone who is secretly sad, you can say 'Ella está disimuladamente triste' (She is secretly sad) using the verb 'estar' (to be)."}],"priority":"N/A"},"related_words":{"derivatives":["disimular (verb: to dissimulate, to conceal)","disimulo (noun: dissimulation, concealment)","disimulado (adjective: dissimulated, concealed)"],"phrases":["a hurtadillas (secretly, stealthily - similar meaning)","en secreto (secretly)","a escondidas (secretly, in hiding)"],"priority":"N/A"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively infrequent, but understood by native speakers.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Disimuladamente' is an adverb that describes doing something in a way that is not easily noticed or that hides one's true intentions. It implies a deliberate effort to conceal something. It's more common in formal or literary contexts than in everyday conversation. Understanding this word requires a good grasp of Spanish vocabulary and an understanding of subtle nuances in meaning."},"example_sentences":[{"sentence":"Se acercó disimuladamente para escuchar la conversación.","translation":"He approached discreetly to listen to the conversation.","type":"action","meaning_category":"concealed action"},{"sentence":"Ella disimuladamente revisó su teléfono mientras él hablaba.","translation":"She subtly checked her phone while he was talking.","type":"action","meaning_category":"subtle action"},{"sentence":"El espía actuó disimuladamente para no ser descubierto.","translation":"The spy acted stealthily to avoid being discovered.","type":"action","meaning_category":"stealth"}]}