{"word":"priesthoods","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"司祭職、聖職、祭司の地位","english_definition":"The office or position of a priest; the body of priests.","examples":[{"sentence":"The ancient priesthoods held considerable power in their societies.","translation":"古代の司祭職は、その社会でかなりの力を持っていました。"},{"sentence":"He dedicated his life to one of the priesthoods.","translation":"彼は生涯を司祭職の一つに捧げました。"}],"collocations":["enter the priesthood (聖職に就く)","holy priesthood (神聖な祭司職)"],"synonyms":["clergy","ministry","sacerdotalism"],"antonyms":["laity"]}],"etymology":{"value":"'Priesthood' is derived from 'priest' (Old English 'prēost', from Late Latin 'presbyter', meaning 'elder') + '-hood' (a suffix denoting state, condition, or quality). It refers to the office, dignity, or character of a priest, or the body of priests.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpriːsthʊdz/","syllables":"pries-thoods"},"inflection":{"noun_plural":"priesthoods"},"usage_notes":{"explanation":"'Priesthood' refers to the office, position, or body of priests. It can refer to a specific religious order or the general concept of priestly authority and function. It is often used in a religious context to describe the role and responsibilities of religious leaders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a member of priesthood.","correct":"✓ He is a member of the priesthood.","note":"'Priesthood' usually refers to the office or body collectively, so it's often used with 'the'."},{"incorrect":"✗ She wants to be a priesthood.","correct":"✓ She wants to enter the priesthood.","note":"'Priesthood' is a state or office, not a person. One enters or joins the priesthood, or becomes a priest."}],"priority":"★★☆"},"related_words":{"derivatives":["priest (noun: 司祭)","priestly (adjective: 司祭の、祭司の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Priesthood' is a term that refers to the position, office, or body of priests within a religious context. It describes the authority, role, and responsibilities associated with being a priest. The word is often used in discussions about religion, religious leadership, and religious traditions. It is less common in everyday conversation and more frequently found in academic or religious texts."},"example_sentences":[{"sentence":"The responsibilities of the priesthood are outlined in the religious texts.","translation":"司祭職の責任は、宗教文書に概説されています。","type":"noun","meaning_category":"司祭職の責任"},{"sentence":"He dedicated his life to the service of the priesthood.","translation":"彼は生涯を司祭職への奉仕に捧げました。","type":"noun","meaning_category":"司祭職への奉仕"},{"sentence":"Different religions have different structures and roles within their priesthoods.","translation":"異なる宗教は、それぞれの司祭職の中で異なる構造と役割を持っています。","type":"noun","meaning_category":"司祭職の構造と役割"}]}