{"word":"canalization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 発生チャネル化、運河化：遺伝的変異や環境的変動にもかかわらず、生物の発生が特定の表現型に向かう傾向。","english_definition":"(biology) The tendency of a developing organism to stay on a particular developmental trajectory, despite genetic or environmental variability.","examples":[{"sentence":"Canalization ensures that development proceeds normally even when conditions are not ideal.","translation":"チャネル化は、条件が理想的でなくても発生が正常に進むことを保証する。"},{"sentence":"Waddington's experiments demonstrated the concept of canalization in Drosophila.","translation":"ワディントンの実験は、ショウジョウバエにおけるチャネル化の概念を実証した。"}],"collocations":["developmental canalization","genetic canalization","environmental canalization"],"synonyms":["robustness","stability","buffering"],"antonyms":["plasticity","sensitivity"]},{"part_of_speech":"noun","definition":"(社会科学・都市計画) 運河化、水路化：河川や水路を人工的な運河に変えること。","english_definition":"(social sciences, urban planning) The process of converting a river or waterway into an artificial canal.","examples":[{"sentence":"The canalization of the river improved navigation but also altered the ecosystem.","translation":"その川の運河化は航行を改善したが、生態系も変化させた。"},{"sentence":"Urban canalization projects often aim to control flooding and improve water management.","translation":"都市の運河化プロジェクトは、しばしば洪水を制御し、水管理を改善することを目的とする。"}],"collocations":["river canalization","urban canalization","waterway canalization"],"synonyms":["channelization","regulation","straightening"],"antonyms":["restoration","naturalization"]},{"part_of_speech":"noun","definition":"(心理学) 運河化：欲求や衝動が特定の行動や対象に向かうこと。","english_definition":"(psychology) The process by which needs or impulses become directed into specific behaviors or objects.","examples":[{"sentence":"Early experiences can influence the canalization of a child's interests.","translation":"幼少期の経験は、子供の興味の運河化に影響を与える可能性がある。"},{"sentence":"The therapist aimed to help the patient understand the canalization of their aggressive impulses.","translation":"セラピストは、患者が攻撃的な衝動の運河化を理解するのを助けることを目指した。"}],"collocations":["impulse canalization","drive canalization","interest canalization"],"synonyms":["direction","focus","channeling"],"antonyms":["diffusion","dispersion"]}],"etymology":{"value":"From 'canal' + '-ization'. 'Canal' comes from Latin 'canalis', meaning 'channel'. The suffix '-ization' denotes a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkænələˈzeɪʃən/","syllables":"ca-nal-i-za-tion"},"inflection":{"noun_plural":"canalizations"},"usage_notes":{"explanation":"'Canalization' has distinct meanings in biology, urban planning, and psychology. In biology, it refers to the robustness of development. In urban planning, it describes the artificial modification of waterways. In psychology, it refers to the channeling of impulses. The context is crucial for understanding the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The canalization of the city led to more green spaces.","correct":"✓ The canalization of the river led to less natural habitat.","note":"Canalization in urban planning typically reduces natural habitats along rivers, not increases green spaces. Green spaces are more related to park development or urban forestry."},{"incorrect":"✗ The canalization of genes caused the mutation.","correct":"✓ The lack of canalization allowed the mutation to have a greater effect.","note":"Canalization reduces the effect of mutations. Lack of canalization would allow mutations to have a greater effect on phenotype."}],"priority":"★★☆"},"related_words":{"derivatives":["canalize","canalised","canalizing"],"related_terms":["Waddington's landscape","epigenetics","urban planning","psychodynamics"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Canalization' is a technical term used in biology, urban planning, and psychology. In biology, it describes how development follows a specific path despite genetic or environmental changes. In urban planning, it refers to converting rivers into canals. In psychology, it means directing impulses into certain behaviors. Understanding the context is key to knowing which meaning is intended."},"example_sentences":[{"sentence":"The **canalization** of the riverfront area made it more accessible to tourists.","translation":"川沿い地域の運河化は観光客にとってよりアクセスしやすくした。","type":"noun","meaning_category":"Urban Planning"},{"sentence":"**Canalization** in development ensures similar phenotypes despite genetic variation.","translation":"発生におけるチャネル化は、遺伝的変異にもかかわらず同様の表現型を保証する。","type":"noun","meaning_category":"Biology"},{"sentence":"The therapist explored the **canalization** of the patient's anger into passive-aggressive behavior.","translation":"セラピストは、患者の怒りが受動攻撃的な行動に運河化されることを探求した。","type":"noun","meaning_category":"Psychology"}]}