{"word":"cowpox","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"牛痘（ぎゅうとう）","english_definition":"a mild infectious disease of cows, caused by a virus, that causes lesions on the teats and udders. It can be transmitted to humans, causing a localized skin infection.","examples":[{"sentence":"Cowpox was historically important because inoculation with cowpox virus provided immunity against smallpox.","translation":"牛痘は、牛痘ウイルスを接種することで天然痘に対する免疫が得られるため、歴史的に重要でした。"},{"sentence":"The milkmaid had contracted cowpox from the cows she milked.","translation":"その牛乳搾りの女性は、搾乳していた牛から牛痘に感染した。"}],"collocations":["contract cowpox","cowpox virus","cowpox vaccination","eradication of smallpox through cowpox"],"synonyms":["vaccinia","vaccination (historical context)"],"antonyms":[]}],"etymology":{"value":"'Cow' + 'pox'. The name reflects the disease's origin in cows and its similarity to smallpox in terms of lesion formation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkaʊpɒks/","syllables":"cow-pox"},"inflection":{"noun_plural":"cowpoxes (less common, usually used as a mass noun)"},"usage_notes":{"explanation":"Cowpox is a viral disease primarily affecting cows, but it can also infect humans. Historically, it is significant because exposure to cowpox provides immunity to smallpox, leading to the development of the smallpox vaccine. The term is often used in historical contexts related to the eradication of smallpox.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He got cowpox from a mosquito bite.","correct":"✓ He got cowpox from contact with infected cows.","note":"Cowpox is transmitted through direct contact with infected animals, not insect bites."},{"incorrect":"✗ Cowpox is as deadly as smallpox.","correct":"✓ Cowpox is much milder than smallpox.","note":"Cowpox is a milder disease, and historically, it was used to inoculate against the more dangerous smallpox."}],"priority":"★★☆"},"related_words":{"derivatives":["vaccine","vaccination","vaccinia"],"phrasal_verbs":[],"related_diseases":["smallpox","monkeypox"],"related_people":["Edward Jenner (developed the smallpox vaccine using cowpox)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary, mainly in historical or medical contexts)","frequency_google_ngram":"Low frequency - Primarily used in medical or historical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cowpox' refers to a viral disease that mainly affects cows, causing sores on their skin. It's important historically because it was used to develop the smallpox vaccine. This vaccine worked because cowpox is a milder disease, and getting it made people immune to the much more dangerous smallpox. You'll mostly come across this term when reading about the history of medicine or virology."},"example_sentences":[{"sentence":"In the 18th century, Edward Jenner discovered that inoculation with cowpox could prevent smallpox.","translation":"18世紀に、エドワード・ジェンナーは牛痘の接種が天然痘を予防できることを発見しました。","type":"noun","meaning_category":"disease"},{"sentence":"The milkmaid's hands were covered in lesions from cowpox.","translation":"その牛乳搾りの女性の手は牛痘による病変で覆われていた。","type":"noun","meaning_category":"disease"}]}