{"word":"homochiral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)単一キラリティーの、ホモキラルの","english_definition":"(chemistry) having only one chirality. A sample of a chemical compound is homochiral if all the molecules have the same chirality (handedness).","examples":[{"sentence":"Life as we know it depends on homochiral molecules.","translation":"私たちが知っている生命は、ホモキラルな分子に依存しています。"},{"sentence":"The synthesis of homochiral compounds is a major challenge in organic chemistry.","translation":"ホモキラル化合物の合成は、有機化学における主要な課題です。"}],"collocations":["homochiral compound","homochiral synthesis","homochiral catalyst"],"synonyms":["enantiopure","chirally pure"],"antonyms":["racemic","heterochiral"]}],"etymology":{"value":"The word \"homochiral\" is formed from the Greek prefix \"homo-\" meaning \"same\" and \"chiral\" referring to chirality (handedness).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊmoʊˈkaɪrəl/","syllables":"ho-mo-chi-ral"},"inflection":{"notes":"Does not inflect"},"usage_notes":{"explanation":"In chemistry, a substance is homochiral if all its molecules are of the same chirality. This is important in pharmaceuticals, as different enantiomers can have different effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The homochirality substance.","correct":"✓ The homochiral substance.","note":"Homochiral is an adjective, so it should be placed before the noun it modifies."}],"priority":"★★☆"},"related_words":{"derivatives":["homochirality (noun)"],"related_terms":["chirality","enantiomer","racemate","stereochemistry"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'homochiral' is a technical term used in chemistry, particularly in the field of stereochemistry. It describes a substance where all molecules have the same 'handedness' or chirality. This concept is crucial in understanding how molecules interact in biological systems and in the development of pharmaceuticals. The term is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The researchers developed a novel method for the homochiral synthesis of amino acids.","translation":"研究者たちは、アミノ酸のホモキラル合成のための新しい方法を開発しました。","type":"scientific","meaning_category":"chemistry"},{"sentence":"The homochiral nature of sugars in DNA is essential for its structure and function.","translation":"DNA中の糖のホモキラルな性質は、その構造と機能に不可欠です。","type":"scientific","meaning_category":"biochemistry"}]}