{"word":"Fabergé","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ファベルジェ (ロシアの宝石商、およびその工房で製作された装飾品)","english_definition":"A Russian jewelry firm, founded in 1842, and the name of the jewellery and other decorative objects created by the firm.","examples":[{"sentence":"The Fabergé eggs are famous for their intricate designs and precious materials.","translation":"ファベルジェの卵は、その複雑なデザインと貴重な素材で有名です。"},{"sentence":"The museum has a collection of Fabergé objects.","translation":"その美術館にはファベルジェのコレクションがあります。"}],"collocations":["Fabergé egg","Fabergé collection","Fabergé jewelry"],"synonyms":["jeweler","goldsmith","artisan"],"antonyms":[]}],"etymology":{"value":"Gustav Fabergé (1814-1894), a Baltic German goldsmith, founded the company in Saint Petersburg, Russia. The name is a French spelling of the family name.","priority":"★★★"},"pronunciation":{"ipa":"/ˌfæbərˈʒeɪ/","syllables":"Fa-ber-zhay"},"inflection":{"noun_plural":"Fabergés"},"usage_notes":{"explanation":"Fabergé is primarily known for the exquisite and ornate jeweled eggs made for the Russian Tsars. These eggs are considered masterpieces of craftsmanship and are highly valuable. The term can refer to the company itself, the founder, or the objects produced by the company.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Faberge eggs are beautiful.","correct":"✓ Fabergé eggs are beautiful.","note":"The correct spelling includes the acute accent over the 'e' at the end of the name."}],"priority":"★★☆"},"related_words":{"derivatives":["Fabergé egg (ファベルジェの卵)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but well-known in art and history contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Fabergé' refers to a specific historical and artistic context, namely the Russian jewelry firm and its creations, particularly the jeweled eggs. Understanding requires some familiarity with Russian history and art history. The word is not commonly used in everyday conversation but is recognized in cultural and historical discussions."},"example_sentences":[{"sentence":"The Virginia Museum of Fine Arts has a notable collection of **Fabergé**.","translation":"バージニア美術館には、注目すべきファベルジェのコレクションがあります。","type":"noun","meaning_category":"ロシアの宝石商とその作品"},{"sentence":"The **Fabergé** eggs are symbols of opulence and craftsmanship.","translation":"ファベルジェの卵は、贅沢さと職人技の象徴です。","type":"noun","meaning_category":"ロシアの宝石商とその作品"}]}