{"word":"allantois","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"尿膜","english_definition":"a sac-like vascular membrane present in reptiles, birds, and mammals during development, which in mammals functions in respiration and excretion and is associated with the umbilical cord.","examples":[{"sentence":"The allantois is an extraembryonic membrane of birds, reptiles, and mammals.","translation":"尿膜は鳥類、爬虫類、哺乳類の胚体外膜である。"},{"sentence":"The allantois helps in the exchange of gases and liquid waste.","translation":"尿膜は気体と液体の老廃物の交換を助ける。"}],"collocations":["allantoic fluid","allantoic membrane","yolk sac and allantois"],"synonyms":["fetal membrane","extraembryonic membrane"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word ἀλλᾶς (allās), meaning 'sausage', and -οειδής (-oeidēs), meaning 'resembling'. This refers to its shape in early development.","priority":"★★★"},"pronunciation":{"ipa":"/əˈlænˌtɔɪs/","syllables":"a-lan-tois"},"inflection":{"noun_plural":"allantoises"},"usage_notes":{"explanation":"The allantois is a key structure in the development of amniotes (reptiles, birds, and mammals). Its primary functions include waste storage and gas exchange. In mammals, it contributes to the formation of the umbilical cord.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The allantois is part of the placenta in birds.","correct":"✓ The allantois is an extraembryonic membrane in birds.","note":"The allantois is a separate structure from the placenta, though it interacts with it in some species."}],"priority":"★★☆"},"related_words":{"derivatives":["allantoic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'allantois' is a technical term used in embryology and developmental biology. It refers to a specific extraembryonic membrane found in amniotes. Understanding its function requires knowledge of basic embryological processes.","priority":"★★☆"},"example_sentences":[{"sentence":"The size of the allantois increases rapidly during chick embryo development.","translation":"ニワトリの胚発生中、尿膜のサイズは急速に増加する。","type":"scientific","meaning_category":"development"},{"sentence":"Malformations of the allantois can lead to developmental abnormalities.","translation":"尿膜の奇形は、発達異常を引き起こす可能性がある。","type":"medical","meaning_category":"pathology"}]}