{"word":"radarman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(軍事) レーダー手、レーダー担当者","english_definition":"A person who operates radar equipment, especially in the military.","examples":[{"sentence":"The radarman detected an unidentified aircraft approaching the coast.","translation":"レーダー手は、海岸に接近する未確認航空機を探知した。"},{"sentence":"The radarman's skill was crucial to the success of the mission.","translation":"レーダー手の技能は、任務の成功に不可欠だった。"}],"collocations":["naval radarman (海軍レーダー手)","air force radarman (空軍レーダー手)","experienced radarman (熟練したレーダー手)"],"synonyms":["radar operator","radar technician"],"antonyms":[]}],"etymology":{"value":"\"radar\" + \"man\".  Radar is an acronym for \"radio detection and ranging\".","priority":"★★☆"},"pronunciation":{"ipa":"ˈreɪdərmæn","syllables":"ra-dar-man"},"inflection":{"noun_plural":"radarmen"},"usage_notes":{"explanation":"The term \"radarman\" is most commonly used in military contexts to refer to personnel specifically trained and responsible for operating radar systems. It is less common in civilian contexts, where terms like \"radar operator\" or \"radar technician\" are more frequently used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The radarman detected a ship on the radar screen. He was a woman. He is a radarwoman.","correct":"✓ The radar operator detected a ship on the radar screen. She is a radar operator.","note":"While \"radarman\" is traditionally used, gender-neutral terms like \"radar operator\" are increasingly preferred."}],"priority":"★★☆"},"related_words":{"derivatives":["radar (noun): A system for detecting the presence, direction, distance, and speed of aircraft, ships, and other objects, by sending out pulses of radio waves which are reflected off the object.","radarscope (noun): The display screen of a radar set.","radar station (noun): A location equipped with radar equipment."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'radarman' is a specialized term, primarily used in military contexts. Understanding requires knowledge of radar technology and military roles. While the word itself is straightforward, its usage is limited to specific professional or historical settings."},"example_sentences":[{"sentence":"The **radarman** diligently monitored the skies for any signs of enemy aircraft.","translation":"レーダー手は、敵機の兆候がないか、空を注意深く監視した。","type":"noun","meaning_category":"military personnel"},{"sentence":"As a skilled **radarman**, he could distinguish between different types of aircraft on the radar screen.","translation":"熟練したレーダー手として、彼はレーダースクリーン上で異なる種類の航空機を区別することができた。","type":"noun","meaning_category":"skilled operator"}]}