{"word":"couchancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 土地に対する占有権の主張、特に家畜が土地に寝起きすることによって生じるもの","english_definition":"(law) The act or condition of lying down or being lodged; specifically, the fact of cattle being levant and couchant on land, giving rise to a claim of right of common.","examples":[{"sentence":"The farmer asserted his right of common based on the couchancy of his cattle on the land.","translation":"農夫は、彼の家畜がその土地に寝起きしていることに基づいて、入会権を主張した。"},{"sentence":"The legal dispute centered on whether the cattle's couchancy established a valid claim.","translation":"法的紛争は、家畜の寝起きが有効な権利の主張を確立するかどうかに焦点を当てていた。"}],"collocations":["levant and couchant","right of common","establish couchancy","prove couchancy"],"synonyms":["lodging","lying down","resting","dwelling"],"antonyms":["movement","activity","transience"]}],"etymology":{"value":"中英語の「couchant」（横たわっている）に由来し、古フランス語の「cochant」（横たわっている）から来ており、さらに遡るとラテン語の「cubare」（横たわる）に由来する。法律用語としての意味は、家畜が土地に横たわっている状態が、土地に対する権利の主張の根拠となることから。","priority":"★★☆"},"pronunciation":{"ipa":"ˈkaʊtʃənsi","syllables":"couch-an-cy"},"inflection":{"noun_plural":"couchancies"},"usage_notes":{"explanation":"「**couchancy**」は、主に法律用語として使用され、特に不動産法において、家畜が土地に寝起きしている状態を指し、それが土地に対する権利（入会権など）の主張の根拠となることを意味します。現代英語では非常に専門的な用語であり、日常会話ではほとんど使用されません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The couchancy of the building was evident.","correct":"✓ The occupancy of the building was evident.","note":"「couchancy」は家畜の寝起きにのみ使用され、建物の占有には使用されません。建物の占有には「occupancy」を使用します。"},{"incorrect":"✗ The couchancy of the animals was a sign of their happiness.","correct":"✓ The resting of the animals was a sign of their happiness.","note":"一般的な動物の休息を指す場合は「resting」を使用し、「couchancy」は法律的な文脈でのみ使用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["couchant (形容詞: 横たわっている、(紋章学で) 横たわった姿勢の)","couch (動詞: 横たえる、(比喩的に) 表現する；名詞: ソファ)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 法律文書以外ではほとんど見られない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**couchancy**」は、不動産法において、家畜が土地に寝起きしている状態を指し、それが土地に対する権利の主張の根拠となることを意味する専門用語です。この単語は、歴史的な文脈や法律文書でのみ見られることが多く、現代英語の日常会話ではほとんど使用されません。法律関係者や歴史研究者など、特定の専門分野の知識を持つ人にのみ理解される単語です。"},"example_sentences":[{"sentence":"The court examined the evidence of couchancy to determine the validity of the grazing rights.","translation":"裁判所は、放牧権の有効性を判断するために、寝起きに関する証拠を検討した。","type":"noun","meaning_category":"法律用語"},{"sentence":"The right of common was dependent on proving the long-standing couchancy of the livestock.","translation":"入会権は、家畜の長期にわたる寝起きを証明することにかかっていた。","type":"noun","meaning_category":"法律用語"}]}