{"word":"etuvee","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A small, decorative case or sheath, especially for needles, scissors, or other small items.","english_definition":"A small ornamental case for needles, scissors, or other small articles.","examples":[{"sentence":"She kept her embroidery scissors in a delicate silver etuvee.","translation":"彼女は繊細な銀のエテュベの中に刺繍ばさみを保管していました。"},{"sentence":"The antique etuvee contained a tiny ivory needle.","translation":"そのアンティークのエテュベには、小さな象牙の針が入っていました。"}],"collocations":["silver etuvee","ivory etuvee","needle etuvee","scissor etuvee"],"synonyms":["case","sheath","holder","container"],"antonyms":[]}],"etymology":{"value":"From French 'étui' meaning 'case'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛtuˈveɪ/","syllables":"e-tu-vay"},"inflection":{"noun_plural":"etuvees"},"usage_notes":{"explanation":"An 'etuvee' is typically a small, elegant container used to protect and store delicate items. It is often made of precious materials like silver or ivory and is considered a decorative object in itself.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["étui (French)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'etuvee' is a relatively rare and specialized term, primarily used in historical or decorative contexts. It refers to a small, ornamental case for holding delicate items like needles or scissors. Due to its limited usage, it is more likely to be encountered in literature or specialized collections rather than in everyday conversation."},"example_sentences":[{"sentence":"The museum displayed a collection of antique etuvees, each intricately designed.","translation":"博物館には、それぞれが複雑にデザインされたアンティークのエテュベのコレクションが展示されていました。","type":"noun","meaning_category":"case"},{"sentence":"She carefully placed her sewing needles back into the velvet-lined etuvee.","translation":"彼女はベルベットで裏打ちされたエテュベに丁寧に縫い針を戻しました。","type":"noun","meaning_category":"case"}]}