{"word":"Mosquish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Resembling or characteristic of a mosquito.","english_definition":"Having qualities similar to those of a mosquito, such as being annoying, buzzing, or related to mosquitoes.","examples":[{"sentence":"The high-pitched whine of the machinery had a mosquish quality to it.","translation":"その機械の高音のうなりは、蚊のような性質を持っていた。"},{"sentence":"The politician's speech was full of mosquish rhetoric, irritating and ultimately going nowhere.","translation":"その政治家の演説は蚊のようなレトリックに満ちており、イライラさせられ、結局どこにも行き着かなかった。"}],"collocations":["mosquish whine","mosquish sound","mosquish rhetoric"],"synonyms":["mosquito-like","irritating","annoying","buzzing"],"antonyms":["soothing","pleasant","quiet"]}],"etymology":{"value":"Derived from the word 'mosquito' with the addition of the suffix '-ish,' indicating a resemblance or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɒskwɪʃ/","syllables":"Mos-quish"},"inflection":{"adjective_forms":{"comparative":"more mosquish","superlative":"most mosquish"}},"usage_notes":{"explanation":"'Mosquish' is a descriptive adjective used to characterize something as resembling a mosquito in some way. This can refer to sounds, behaviors, or other attributes associated with mosquitoes, typically with negative connotations such as annoyance or irritation. It is not a commonly used word and is often employed in descriptive or figurative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mosquish bit my arm.","correct":"✓ The mosquito bit my arm.","note":"'Mosquish' is an adjective, not a noun. Use 'mosquito' as the noun referring to the insect."}],"priority":"★☆☆"},"related_words":{"derivatives":["mosquito (noun)","mosquitoey (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a commonly used word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mosquish' is an uncommon adjective that means 'resembling a mosquito.' It's used to describe something that has qualities similar to a mosquito, such as an irritating sound or annoying behavior. Because it's not a frequently used word, it's more likely to appear in descriptive or creative writing rather than everyday conversation."},"example_sentences":[{"sentence":"The old radio emitted a mosquish buzz that was hard to ignore.","translation":"その古いラジオは、無視するのが難しい蚊のようなブーンという音を出していた。","type":"adjective","meaning_category":"resembling a mosquito"},{"sentence":"His mosquish persistence in asking the same question over and over was starting to annoy everyone.","translation":"彼が同じ質問を何度も何度も執拗に繰り返す蚊のような粘り強さは、皆をイライラさせ始めていた。","type":"adjective","meaning_category":"characteristic of a mosquito"}]}