{"word":"unsententious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"説教じみていない、気取らない、簡潔な","english_definition":"not given to excessive moralizing; concise and straightforward.","examples":[{"sentence":"His writing style is admirably unsententious, avoiding grand pronouncements.","translation":"彼の文体は見事に気取らず、大げさな宣言を避けている。"},{"sentence":"The comedian's unsententious humor was a refreshing change.","translation":"そのコメディアンの簡潔なユーモアは、気分転換になった。"},{"sentence":"She offered unsententious advice, focusing on practical solutions.","translation":"彼女は説教じみたアドバイスではなく、実践的な解決策に焦点を当てた。"}],"collocations":["unsententious advice","unsententious style","unsententious humor"],"synonyms":["straightforward","concise","direct","unpretentious","unmoralizing","simple"],"antonyms":["sententious","moralizing","preachy","pompous","bombastic"]}],"etymology":{"value":"接頭辞 un- (否定) + sententious (説教じみた)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnsɛnˈtɛnʃəs/","syllables":"un-sen-ten-tious"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります (more unsententious, most unsententious)。"},"usage_notes":{"explanation":"\"Unsententious\" describes something or someone that avoids being overly moralistic, preachy, or full of pompous pronouncements. It suggests a style or approach that is straightforward, concise, and free from unnecessary moralizing or grandstanding. It's often used to praise writing, speech, or behavior that is refreshingly simple and direct.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a very sententious speech, it was unsententious.","correct":"✓ He gave a very sententious speech, it was not unsententious. / ✓ He gave a very direct speech, it was unsententious.","note":"混同を避けるため、`sententious` (説教じみた) と `unsententious` (説教じみていない) の意味を正しく理解することが重要です。"},{"incorrect":"✗ The unsententious man was very boring.","correct":"✓ The unsententious man was very direct.","note":"`unsententious` は必ずしも退屈を意味しません。むしろ、簡潔で直接的なスタイルを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["sententious (説教じみた、格言好きな)","sententiously (説教じみて)","sententiousness (説教好き、格言好き)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unsententious\" is a relatively uncommon word that means not given to moralizing or using high-sounding language. It is used to describe writing, speech, or people who are straightforward and avoid being preachy or pompous. Understanding this word requires a strong vocabulary and an ability to recognize subtle nuances in language. It is more likely to be encountered in advanced literary or academic contexts."},"example_sentences":[{"sentence":"The author's unsententious prose made the complex topic accessible to a wider audience.","translation":"その著者の気取らない文章のおかげで、複雑なテーマがより多くの読者に理解しやすくなった。","type":"adjective","meaning_category":"簡潔な"},{"sentence":"Her unsententious approach to leadership earned her the respect of her team.","translation":"彼女の説教じみたところのないリーダーシップのおかげで、チームからの尊敬を集めた。","type":"adjective","meaning_category":"気取らない"},{"sentence":"The film's unsententious message resonated with viewers seeking authenticity.","translation":"その映画の説教臭くないメッセージは、本物を求める視聴者の心に響いた。","type":"adjective","meaning_category":"説教じみていない"}]}