{"word":"underpromote","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を不当に低い地位に留める、昇進させない","english_definition":"To fail to promote (someone) to a position that is appropriate for their skills and experience; to keep someone at a lower level than they deserve.","examples":[{"sentence":"She felt that she was being underpromoted because of her gender.","translation":"彼女は、自分が女性であるために不当に低い地位に留められていると感じた。"},{"sentence":"The company was accused of underpromoting minority employees.","translation":"その会社は、少数派の従業員を昇進させないと非難された。"},{"sentence":"He claimed he was underpromoted despite his excellent performance.","translation":"彼は、優れた業績にもかかわらず、昇進させられなかったと主張した。"}],"collocations":["underpromote someone because of age (年齢を理由に昇進させない)","underpromote someone due to bias (偏見のために昇進させない)","underpromote someone despite qualifications (資格があるにもかかわらず昇進させない)"],"synonyms":["hold back","stunt","limit","restrict","demote (sometimes used loosely)"],"antonyms":["promote","advance","upgrade","elevate"]}],"etymology":{"value":"The word is formed by adding the prefix 'under-' (meaning 'below' or 'insufficiently') to the verb 'promote'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌndərpəˈmoʊt/","syllables":"un-der-pro-mote"},"inflection":{"verb_forms":{"present_simple":["underpromote","underpromotes"],"past_simple":"underpromoted","past_participle":"underpromoted","present_participle":"underpromoting"}},"usage_notes":{"explanation":"'Underpromote' implies a failure to recognize and reward someone's potential or achievements with a higher position. It often suggests unfairness or discrimination. It is typically used in a professional or organizational context.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The company underpromotes the importance of training.","correct":"✓ The company undervalues the importance of training.","note":"'Underpromote' refers to people, not things. To say that something is not given enough importance, use 'undervalue' or 'underestimate'."}],"priority":"N/A"},"related_words":{"derivatives":["underpromotion (noun): the act of underpromoting or the state of being underpromoted"],"antonyms":["overpromote (verb): to promote someone to a position that is too high for their skills and experience"]},"level_frequency":{"CEFR":"C2 (rare, specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Underpromote' is a relatively uncommon word that means to fail to give someone a higher position in a company or organization when they deserve it. It suggests that the person is being kept at a lower level than their skills and experience warrant. This word is typically used in discussions about workplace fairness and career development."},"example_sentences":[{"sentence":"Many women feel that they are consistently underpromoted in their careers.","translation":"多くの女性は、キャリアにおいて常に不当に低い地位に留められていると感じている。","type":"verb","meaning_category":"不当に低い地位に留める"},{"sentence":"The manager was accused of underpromoting talented employees.","translation":"そのマネージャーは、有能な従業員を昇進させないと非難された。","type":"verb","meaning_category":"昇進させない"},{"sentence":"His lack of promotion was seen as a sign that he was being underpromoted.","translation":"彼の昇進の遅れは、彼が不当に低い地位に留められている兆候と見なされた。","type":"verb","meaning_category":"昇進させない"}]}