{"word":"price-indexed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"物価連動の、物価スライド制の","english_definition":"Adjusted to reflect changes in the price level, usually to protect the real value of payments or assets from inflation.","examples":[{"sentence":"The government issued price-indexed bonds to protect investors from inflation.","translation":"政府は、投資家をインフレから守るために物価連動債を発行した。"},{"sentence":"The pension plan includes a price-indexed component to ensure retirees' purchasing power is maintained.","translation":"その年金制度には、退職者の購買力が維持されるように、物価連動の要素が含まれている。"}],"collocations":["price-indexed bond (物価連動債)","price-indexed annuity (物価連動年金)","price-indexed wages (物価連動賃金)","price-indexed contract (物価連動契約)"],"synonyms":["inflation-linked","cost-of-living adjusted"],"antonyms":["fixed-rate","nominal"],"related_terms":["indexation","inflation","deflation","real value","nominal value"]}],"etymology":{"value":"The term is formed by combining \"price\" with \"indexed,\" indicating that something is adjusted according to a price index (usually a measure of inflation).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpraɪsˌɪnˌdɛkst/","syllables":"price-in-dexed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Price-indexed\" describes something that is adjusted based on a price index, typically to maintain its real value in the face of inflation. This is commonly seen in financial instruments like bonds and annuities, as well as in contracts and wages. The purpose is to protect the holder from the erosion of purchasing power caused by rising prices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The salary is price-index.","correct":"✓ The salary is price-indexed.","note":"Remember to use the adjective form \"price-indexed\" rather than the noun \"price index.\""}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in economics, finance, and government contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Price-indexed\" is a term used in economics and finance to describe something that is adjusted to account for changes in prices, especially inflation. This adjustment helps maintain the real value of the item being indexed. It's often used with financial products like bonds or annuities to protect investors from losing purchasing power due to rising prices. The term is most commonly found in discussions about economics, finance, and government policy."},"example_sentences":[{"sentence":"The government offers **price-indexed** securities to protect savings from inflation.","translation":"政府は貯蓄をインフレから守るために物価連動証券を提供している。","type":"general","meaning_category":"general"},{"sentence":"The **price-indexed** lease agreement ensured that the rent would adjust with the consumer price index.","translation":"その物価連動の賃貸契約により、家賃は消費者物価指数に合わせて調整されることが保証された。","type":"contract","meaning_category":"contract"},{"sentence":"Many retirees prefer **price-indexed** annuities to maintain their living standards.","translation":"多くの退職者は生活水準を維持するために物価連動年金を好む。","type":"finance","meaning_category":"finance"}]}