{"word":"Oxbridge","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オックスフォード大学とケンブリッジ大学を合わせた名称","english_definition":"A portmanteau of Oxford and Cambridge, the two oldest and most prestigious universities in England.","examples":[{"sentence":"She applied to Oxbridge but was not accepted.","translation":"彼女はオックスブリッジに出願したが、合格しなかった。"},{"sentence":"Oxbridge graduates often go on to hold positions of power in British society.","translation":"オックスブリッジの卒業生は、しばしばイギリス社会で権力のある地位に就く。"},{"sentence":"The Oxbridge entrance exams are notoriously difficult.","translation":"オックスブリッジの入学試験は悪名高いほど難しい。"}],"collocations":["apply to Oxbridge (オックスブリッジに出願する)","Oxbridge graduate (オックスブリッジの卒業生)","Oxbridge entrance exam (オックスブリッジの入学試験)","Oxbridge interview (オックスブリッジの面接)","Oxbridge college (オックスブリッジのカレッジ)"],"synonyms":["None - it's a specific term"],"antonyms":["None - it's a specific term"]},{"part_of_speech":"adjective","definition":"オックスフォード大学とケンブリッジ大学に関連する、またはそれらの大学に特有の","english_definition":"Relating to or characteristic of Oxford and Cambridge universities.","examples":[{"sentence":"The Oxbridge tradition of tutorials is highly valued.","translation":"オックスブリッジの個別指導の伝統は高く評価されている。"},{"sentence":"He has an Oxbridge accent.","translation":"彼はオックスブリッジ訛りがある。"},{"sentence":"The Oxbridge rowing race is a famous annual event.","translation":"オックスブリッジのボートレースは有名な毎年恒例のイベントだ。"}],"collocations":["Oxbridge tradition (オックスブリッジの伝統)","Oxbridge accent (オックスブリッジ訛り)","Oxbridge rowing race (オックスブリッジのボートレース)","Oxbridge education (オックスブリッジの教育)","Oxbridge style (オックスブリッジのスタイル)"],"synonyms":["None - it's a specific term"],"antonyms":["None - it's a specific term"]}],"etymology":{"value":"A portmanteau word combining the names of the University of Oxford and the University of Cambridge, the two oldest and most prestigious universities in England. The term is used to refer to them collectively, often highlighting their shared characteristics and elite status.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɒksbrɪdʒ/","syllables":"Ox-bridge"},"inflection":{"noun_plural":"Oxbridges (rarely used)"},"usage_notes":{"explanation":"\"**Oxbridge**\" is a collective term used to refer to the University of Oxford and the University of Cambridge. It is often used to highlight the similarities between the two institutions, such as their collegiate structure, high academic standards, and historical prestige. The term can be used as a noun to refer to the universities themselves or as an adjective to describe something related to them. It is important to note that while the term is widely recognized, it can sometimes be seen as elitist or exclusionary, as it emphasizes the perceived superiority of these two universities over others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is studying at Oxbridge University.","correct":"✓ She is studying at Oxford or Cambridge. / ✓ She is studying at an Oxbridge university.","note":"\"Oxbridge\" itself refers to Oxford and Cambridge, so adding \"University\" is redundant. Use \"Oxford or Cambridge\" or \"an Oxbridge university\" instead."},{"incorrect":"✗ He went to a Oxbridge.","correct":"✓ He went to Oxbridge.","note":"When used as a noun to refer to the universities collectively, \"Oxbridge\" does not require an article (a/an/the)."}],"priority":"★★☆"},"related_words":{"derivatives":["Oxonian (オックスフォード大学の学生または卒業生)","Cantabrigian (ケンブリッジ大学の学生または卒業生)"],"idioms_phrases":["None - it's a specific term"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderate frequency - common in discussions about higher education in the UK.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**Oxbridge**\" refers to the Universities of Oxford and Cambridge, considered the two most prestigious universities in the UK. It's often used to describe things related to these universities, like their traditions or graduates. While it's a useful shorthand, keep in mind that using \"Oxbridge\" can sometimes sound a bit elitist, as it emphasizes the high status of these institutions compared to others. It's generally understood in the UK and in academic contexts internationally, but might not be familiar to everyone.","example_sentences":[{"sentence":"Many politicians in the UK are **Oxbridge** graduates.","translation":"イギリスの多くの政治家はオックスブリッジの卒業生だ。","type":"noun","meaning_category":"オックスフォード大学とケンブリッジ大学の総称"},{"sentence":"The **Oxbridge** tutorial system is known for its intensity.","translation":"オックスブリッジの個別指導制度はその厳しさで知られている。","type":"adjective","meaning_category":"オックスフォード大学とケンブリッジ大学に関連する"}]}}