{"word":"Rewardableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being worthy of reward.","english_definition":"The quality or state of deserving or being suitable for a reward.","examples":[{"sentence":"The rewardableness of his actions was clear to everyone.","translation":"彼の行動が報われるに値することは誰の目にも明らかだった。"},{"sentence":"The committee considered the rewardableness of each nominee's contributions.","translation":"委員会は、各候補者の貢献が報われるに値するかどうかを検討した。"}],"collocations":["assess rewardableness","determine rewardableness","evaluate rewardableness"],"synonyms":["deservingness","worthiness","merit","deservability"],"antonyms":["undeservingness","unworthiness"]}],"etymology":{"value":"Formed from 'rewardable' (capable of being rewarded) + '-ness' (a suffix denoting a state or quality).","priority":"☆☆☆"},"pronunciation":{"ipa":"/rɪˈwɔːrdəbəlnəs/","syllables":"re-ward-a-ble-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Rewardableness' is a relatively uncommon noun that refers to the degree to which something (typically an action, effort, or quality) merits a reward. It is often used in contexts where decisions are being made about who or what should be recognized or compensated.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rewardableness is high.","correct":"✓ The rewardableness of the project is high.","note":"It's better to specify what possesses the quality of rewardableness."}],"priority":"☆☆☆"},"related_words":{"derivatives":["rewardable (adjective)","reward (verb, noun)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Rewardableness' is a complex and rare word used to describe how much something deserves a reward. It's mostly used in formal or legal contexts when discussing whether someone's actions or contributions should be recognized or compensated. Because it's not a common word, it's best used when you specifically need to emphasize the quality of deserving a reward."},"example_sentences":[{"sentence":"The judge considered the rewardableness of the plaintiff's cooperation with the investigation.","translation":"裁判官は、原告の捜査協力が報われるに値するかどうかを検討した。","type":"noun","meaning_category":"worthiness of reward"},{"sentence":"The scholarship committee carefully assessed the rewardableness of each applicant's academic achievements and extracurricular activities.","translation":"奨学金委員会は、各申請者の学業成績と課外活動が報われるに値するかどうかを注意深く評価した。","type":"noun","meaning_category":"worthiness of reward"}]}