{"word":"barn-raised","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(主に家畜について)小屋で育てられた、屋内飼育の","english_definition":"(chiefly of livestock) raised indoors, typically in a barn.","examples":[{"sentence":"These are barn-raised chickens, not free-range.","translation":"これらは平飼いではなく、小屋で育てられた鶏です。"},{"sentence":"Barn-raised pigs often have different health issues than those raised outdoors.","translation":"小屋で育てられた豚は、屋外で育てられた豚とは異なる健康問題を抱えることが多いです。"}],"collocations":["barn-raised chicken","barn-raised pork","barn-raised beef"],"synonyms":["indoor-raised","confined"],"antonyms":["free-range","pasture-raised","grass-fed"]},{"part_of_speech":"adjective","definition":"(比喩的に、人について)世間知らずの、箱入り娘/息子の","english_definition":"(figuratively, of a person) sheltered, naive, or inexperienced, often due to being raised in a controlled or isolated environment.","examples":[{"sentence":"He has a barn-raised view of the world, never having experienced real hardship.","translation":"彼は本当の苦労を経験したことがないので、世間知らずな世界観を持っている。"},{"sentence":"She's a bit barn-raised, but she's eager to learn.","translation":"彼女は少し世間知らずだが、学ぶことに意欲的だ。"}],"collocations":["barn-raised kid","barn-raised perspective","barn-raised upbringing"],"synonyms":["sheltered","naive","inexperienced","innocent"],"antonyms":["streetwise","worldly","experienced","sophisticated"]}],"etymology":{"value":"The term directly relates to the practice of raising animals inside barns. The figurative sense extends from the idea of being protected and isolated within the confines of a barn.","priority":"Medium"},"pronunciation":{"ipa":"/ˈbɑːrnˌreɪzd/","syllables":"barn-raised"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term \"barn-raised\" is most commonly used in the context of agriculture to describe livestock that are raised indoors, typically in barns. This is often contrasted with \"free-range\" or \"pasture-raised\" animals, which have access to the outdoors. Figuratively, \"barn-raised\" can describe a person who is sheltered or naive, suggesting a lack of real-world experience due to a protected upbringing.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"He was barn-raised in the city.","correct":"He was sheltered growing up in the city.","note":"\"Barn-raised\" literally refers to being raised in a barn, so it's more appropriate to use \"sheltered\" or \"protected\" when describing someone raised in a city environment."},{"incorrect":"The barn-raised child was very independent.","correct":"The sheltered child was not very independent.","note":"The term \"barn-raised\" implies a lack of independence due to being overprotected, so it's contradictory to describe a barn-raised child as very independent."}],"priority":"Medium"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["free-range","pasture-raised","grass-fed","sheltered","naive","inexperienced"],"priority":"High"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"The term \"barn-raised\" has two main meanings. Literally, it refers to livestock raised inside a barn. Figuratively, it describes someone who is sheltered and inexperienced, often due to a protective upbringing. The figurative meaning requires a higher level of understanding as it relies on an implied comparison. The word is not very common, so it's more likely to be encountered in specific contexts related to agriculture or discussions about upbringing and experience."},"example_sentences":[{"sentence":"The label indicated that the eggs were from barn-raised hens.","translation":"そのラベルには、卵は小屋で育てられた鶏のものだと表示されていた。","type":"adjective","meaning_category":"家畜"},{"sentence":"Growing up in a small town, she had a somewhat barn-raised view of the world.","translation":"小さな町で育った彼女は、やや世間知らずな世界観を持っていた。","type":"adjective","meaning_category":"比喩的（人）"}]}