{"word":"exoterically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"平易に、公然と、表面的な方法で","english_definition":"In a manner that is easily understandable or publicly accessible; superficially.","examples":[{"sentence":"The subject was explained exoterically, without delving into the deeper complexities.","translation":"その主題は、より深い複雑さに立ち入ることなく、平易に説明された。"},{"sentence":"He presented the information exoterically, making it accessible to a wide audience.","translation":"彼はその情報を、幅広い聴衆が理解できるように、公然と発表した。"}],"collocations":["explain exoterically","present exoterically","understand exoterically"],"synonyms":["superficially","publicly","openly","plainly","accessibly"],"antonyms":["esoterically","obscurely","secretly","profoundly"]}],"etymology":{"value":"Derived from 'exoteric,' which comes from the Greek 'exōterikos,' meaning 'external, outward, public.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛksoʊˈtɛrɪkli/","syllables":"ex-o-ter-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Exoterically' describes something presented or understood in a way that is easily accessible to the general public, without requiring specialized knowledge. It is the opposite of 'esoterically,' which refers to knowledge that is intended for or likely to be understood by only a small number of people with a specialized knowledge or interest.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The data was analyzed exoterically, revealing hidden patterns.","correct":"The data was analyzed superficially, revealing obvious patterns.","note":"'Exoterically' implies a lack of depth, so it wouldn't reveal hidden patterns."}],"priority":"★★☆"},"related_words":{"derivatives":["exoteric (adjective)","exotericism (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Exoterically' is an advanced term used to describe information or explanations that are presented in a simple, accessible manner for a general audience, without delving into complex or specialized details. It is the opposite of 'esoterically,' which refers to information understood by a select few with specific knowledge. This word is rarely used in everyday conversation and is more common in academic or technical contexts."},"example_sentences":[{"sentence":"The guide explained the historical events exoterically, focusing on the main points.","translation":"ガイドは歴史的な出来事を平易に説明し、主要なポイントに焦点を当てた。","type":"adverb","meaning_category":"平易に"},{"sentence":"The company's mission statement was presented exoterically to appeal to a broad customer base.","translation":"その会社のミッションステートメントは、幅広い顧客層にアピールするために、公然と発表された。","type":"adverb","meaning_category":"公然と"}]}