{"word":"jawbreaking","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言葉が)発音しにくい、言いにくい","english_definition":"difficult to pronounce","examples":[{"sentence":"That word is a real jawbreaking tongue-twister.","translation":"その単語は本当に発音しにくい早口言葉だ。"},{"sentence":"The name of the Icelandic volcano was jawbreaking for many news reporters.","translation":"そのアイスランドの火山の名前は多くのニュースレポーターにとって発音困難だった。"}],"collocations":["jawbreaking word","jawbreaking name","jawbreaking tongue-twister"],"synonyms":["unpronounceable","tongue-twisting","difficult to articulate"],"antonyms":["easy to pronounce","articulate"]},{"part_of_speech":"adjective","definition":"(比喩的に)非常に長い、複雑な、理解しにくい","english_definition":"(figuratively) extremely long, complex, or difficult to understand","examples":[{"sentence":"The legal document was filled with jawbreaking clauses and conditions.","translation":"その法的文書は非常に長く複雑な条項で埋め尽くされていた。"},{"sentence":"The scientific theory was presented in a jawbreaking manner, making it hard to grasp.","translation":"その科学理論は非常に理解しにくい方法で提示され、把握するのが困難だった。"}],"collocations":["jawbreaking clauses","jawbreaking theory","jawbreaking explanation"],"synonyms":["complex","complicated","incomprehensible","lengthy"],"antonyms":["simple","straightforward","easy to understand"]}],"etymology":{"value":"The word 'jawbreaking' is a compound word formed from 'jaw' and 'breaking'. It literally suggests something so hard or difficult that it could break your jaw, but is used figuratively to describe words or concepts that are difficult to pronounce or understand.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɔːˌbreɪkɪŋ/","syllables":"jaw-break-ing"},"inflection":{"notes":"Since it's an adjective, it can be used in comparative and superlative forms, although they are not common: more jawbreaking, most jawbreaking."},"usage_notes":{"explanation":"'Jawbreaking' is primarily used to describe words or phrases that are difficult to pronounce due to their length, unusual sounds, or complex structure. Figuratively, it can also describe something that is very long, complex, or difficult to understand. The figurative use extends the idea of something being so challenging that it's like trying to 'break' your jaw to say or comprehend it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was jawbreaking.","correct":"✓ The food was hard to chew.","note":"'Jawbreaking' is not typically used to describe food that is hard to chew. It is mainly used for words or complex concepts."},{"incorrect":"✗ He gave a jawbreaking performance.","correct":"✓ He gave an outstanding performance.","note":"'Jawbreaking' is not usually used to describe a performance. Use adjectives like 'outstanding', 'amazing', or 'impressive' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["jawbreaker (noun: a hard candy that is difficult to break or chew)"],"phrases":["tongue-twister (noun: a sequence of words that is difficult to pronounce quickly and correctly)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jawbreaking' is a relatively uncommon word, primarily used to describe words or phrases that are difficult to pronounce. It can also be used figuratively to describe something complex or difficult to understand. Due to its specific usage and relatively low frequency, it is more likely to be encountered in advanced texts or specialized contexts."},"example_sentences":[{"sentence":"The new employee struggled with the jawbreaking technical terms.","translation":"その新入社員は発音しにくい専門用語に苦労した。","type":"adjective","meaning_category":"difficult to pronounce"},{"sentence":"The professor presented a jawbreaking explanation of quantum physics.","translation":"教授は非常に難解な量子物理学の説明をした。","type":"adjective","meaning_category":"difficult to understand"},{"sentence":"Many foreign visitors found the local dialect jawbreaking.","translation":"多くの外国人観光客はその地方の方言が発音しにくいと感じた。","type":"adjective","meaning_category":"difficult to pronounce"},{"sentence":"The contract was filled with jawbreaking legal jargon.","translation":"その契約書は非常に難解な法律用語で埋め尽くされていた。","type":"adjective","meaning_category":"difficult to understand"}]}