{"word":"recementation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再セメント処理、再石灰化","english_definition":"The process of cementing again; the act of applying cement a second time.","examples":[{"sentence":"The recementation of the crown was necessary after it came loose.","translation":"クラウンが緩んだ後、再セメント処理が必要になった。"},{"sentence":"Recementation can improve the stability of the structure.","translation":"再セメント処理は構造の安定性を向上させることができる。"}],"collocations":["recementation of a crown","recementation of a filling"],"synonyms":["reapplication of cement","re-fixation","re-bonding"],"antonyms":["decementation","removal of cement"]}],"etymology":{"value":"The word \"recementation\" is formed by adding the prefix \"re-\" (meaning again) to the word \"cementation\" (the process of cementing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːsiːmenˈteɪʃən/","syllables":"re-ce-men-ta-tion"},"inflection":{"noun_plural":"recementations"},"usage_notes":{"explanation":"\"Recementation\" is a technical term primarily used in dentistry and construction. In dentistry, it refers to the process of reattaching dental prosthetics (like crowns or bridges) using dental cement. In construction, it might refer to applying cement again to reinforce or repair a structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recementation was done by a amateur.","correct":"✓ The recementation was done by an amateur.","note":"\"Amateur\" begins with a vowel sound, so it requires the indefinite article \"an\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["cement","cementation","recement"],"related_terms":["dental cement","crown","bridge","filling"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"recementation\" is a specialized term primarily used in technical contexts such as dentistry and construction. It refers to the process of applying cement again to something, whether it's a dental crown or a structural element. Due to its specific usage, it's not commonly encountered in general English. Understanding its meaning requires familiarity with the base word \"cementation\" and the prefix \"re-\", indicating repetition."},"example_sentences":[{"sentence":"The dentist performed a recementation of the patient's loose crown.","translation":"歯科医は患者の緩んだクラウンの再セメント処理を行った。","type":"general","meaning_category":"Dentistry"},{"sentence":"The structural engineer recommended recementation of the foundation to prevent further deterioration.","translation":"構造エンジニアは、さらなる劣化を防ぐために基礎の再セメント処理を推奨した。","type":"technical","meaning_category":"Construction"}]}