{"word":"coadjacence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)コアジャセンス：ある代数構造における、二つの部分構造が互いに隣接している状態。特に、ある部分構造を拡大して得られる構造が、元の構造と一致する場合を指す。","english_definition":"(Mathematics) The state of two substructures in an algebraic structure being adjacent to each other, particularly when extending one substructure results in the original structure.","examples":[{"sentence":"The coadjacence of these two ideals implies a specific relationship within the ring.","translation":"これらの二つのイデアルのコアジャセンスは、環内の特定の関係を示唆している。"},{"sentence":"In the lattice of subgroups, coadjacence indicates that there are no subgroups between the two considered.","translation":"部分群の束において、コアジャセンスは、考慮されている二つの部分群の間に他の部分群が存在しないことを示す。"}],"collocations":["coadjacence of ideals (イデアルのコアジャセンス)","coadjacence in lattices (束におけるコアジャセンス)","algebraic coadjacence (代数的コアジャセンス)"],"synonyms":["adjacency","contiguity","juxtaposition","nearness"],"antonyms":["separation","disjunction","isolation"]}],"etymology":{"value":"Derived from 'adjacent' (Latin 'adjacens', present participle of 'adjacere' - to lie near) with the prefix 'co-' indicating 'together' or 'jointly'. The term is used to describe a specific type of adjacency in algebraic structures.","priority":"★★☆"},"pronunciation":{"ipa":"/koʊədˈdʒeɪsəns/","syllables":"co-ad-ja-cence"},"inflection":{"noun_plural":"coadjacences"},"usage_notes":{"explanation":"'Coadjacence' is a technical term primarily used in abstract algebra, particularly in the study of lattices, groups, and rings. It describes a specific type of 'adjacency' between substructures where there is no intermediate structure between them. The term is relatively rare outside of advanced mathematical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coadjacence of the buildings made it difficult to navigate.","correct":"✓ The proximity of the buildings made it difficult to navigate.","note":"'Coadjacence' has a specific mathematical meaning and should not be used as a general synonym for 'proximity' or 'adjacency' in non-mathematical contexts."}],"priority":"★★★"},"related_words":{"derivatives":["adjacent","adjacency"],"related_terms":["lattice","subgroup","ideal","ring","algebraic structure"]},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency - a highly specialized mathematical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Coadjacence' is a highly specialized mathematical term used in abstract algebra. It describes a specific relationship between substructures within an algebraic structure, indicating that there are no intermediate structures between them. Due to its technical nature, it is primarily encountered in advanced mathematical literature and discussions. Understanding requires familiarity with concepts from abstract algebra, such as lattices, groups, rings, and ideals."},"example_sentences":[{"sentence":"The coadjacence of the maximal ideal to the ring indicates that the quotient ring is a field.","translation":"極大イデアルの環へのコアジャセンスは、商環が体であることを示す。","type":"noun","meaning_category":"(数学)コアジャセンス"},{"sentence":"In the subgroup lattice of a finite group, coadjacence is a key concept for understanding the group's structure.","translation":"有限群の部分群束において、コアジャセンスは群の構造を理解するための重要な概念である。","type":"noun","meaning_category":"(数学)コアジャセンス"}]}