{"word":"corruptibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"堕落しやすさ、買収されやすさ、腐敗しやすさ","english_definition":"the state or quality of being susceptible to corruption, especially bribery or other forms of dishonesty.","examples":[{"sentence":"The corruptibility of the officials was a major concern.","translation":"その役人たちの堕落しやすさが大きな懸念事項だった。"},{"sentence":"The system was designed to minimize corruptibility.","translation":"そのシステムは、腐敗しやすさを最小限に抑えるように設計された。"},{"sentence":"He argued that human nature includes a degree of corruptibility.","translation":"彼は、人間の本性にはある程度の堕落しやすさが含まれていると主張した。"}],"collocations":["high corruptibility (高い腐敗しやすさ)","low corruptibility (低い腐敗しやすさ)","institutional corruptibility (制度的な腐敗しやすさ)","moral corruptibility (道徳的な堕落しやすさ)"],"synonyms":["susceptibility to corruption","liability to corruption","vulnerability to corruption","debasement","depravity"],"antonyms":["integrity","honesty","incorruptibility","probity","uprightness"]}],"etymology":{"value":"\"Corruptibility\" is derived from \"corruptible,\" which comes from the Latin word \"corruptibilis,\" meaning \"liable to be corrupted.\" This is further derived from \"corrumpere,\" meaning \"to destroy, spoil, corrupt.\" The suffix \"-ity\" is added to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˌrʌptəˈbɪləti/","syllables":"cor-rup-ti-bi-li-ty"},"inflection":{"noun_plural":"corruptibilities"},"usage_notes":{"explanation":"\"Corruptibility\" refers to the potential or tendency to become corrupt, particularly in the context of ethics, morals, or legal standards. It emphasizes the inherent weakness or vulnerability of a person, system, or institution to succumb to bribery, dishonesty, or other forms of unethical behavior. It is often discussed in relation to political systems, business practices, and individual character.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corruptibility is high in this country.","correct":"✓ The level of corruptibility is high in this country.","note":"While grammatically correct, it's better to specify what aspect of corruptibility is being discussed (e.g., level, rate)."},{"incorrect":"✗ He showed a great corruptibility.","correct":"✓ He showed a great degree of corruptibility.","note":"Use 'degree' or another quantifier to describe the extent of corruptibility."}],"priority":"★★☆"},"related_words":{"derivatives":["corrupt (verb, adjective)","corruption (noun)","corruptible (adjective)","incorruptible (adjective)","incorruptibility (noun)"],"related_concepts":["bribery","embezzlement","fraud","malfeasance","nepotism","cronyism","ethics","morality","integrity","accountability"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"corruptibility\" is a complex term referring to the quality of being easily corrupted or made dishonest, especially through bribery or other unethical means. It's often used in discussions about politics, business, and ethics to describe systems or individuals that are prone to corruption. Understanding this word requires a good grasp of abstract concepts and nuanced vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The study examined the corruptibility of the police force.","translation":"その研究は、警察の腐敗しやすさを調査した。","type":"general","meaning_category":"general"},{"sentence":"The new regulations aim to reduce the corruptibility of the financial system.","translation":"新しい規制は、金融システムの腐敗しやすさを軽減することを目的としている。","type":"system","meaning_category":"system"},{"sentence":"His corruptibility made him an easy target for manipulation.","translation":"彼の堕落しやすさが、彼を操縦の容易な標的にした。","type":"individual","meaning_category":"individual"}]}