{"word":"Lamiides","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A clade or subclass of eudicot flowering plants recognized in some versions of the APG IV system.","english_definition":"A taxonomic group of flowering plants, specifically a clade or subclass within the eudicots, recognized in some botanical classification systems.","examples":[{"sentence":"The Lamiides include many familiar plant families such as Lamiaceae and Solanaceae.","translation":"シソ類は、シソ科やナス科など、多くの馴染みのある植物科を含む。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the family name Lamiaceae (the mint family), which is a prominent and well-studied family within this group. The suffix '-ides' is commonly used in botanical nomenclature to denote a subclass.","priority":"N/A"},"pronunciation":{"ipa":"/ləˈmaɪɪdiːz/","syllables":"La-mi-i-des"},"inflection":{"noun_plural":"N/A"},"usage_notes":{"explanation":"The term \"Lamiides\" is primarily used in botanical and taxonomic contexts. It refers to a specific grouping of flowering plants based on genetic and morphological characteristics. This term might not be widely recognized outside of scientific circles.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Lamiales (order)","Lamiaceae (family)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Lamiides' is a technical term used in botany and plant taxonomy. Understanding this term requires familiarity with plant classification systems and the broader context of eudicot phylogeny. It is not a term commonly encountered in general English usage."},"example_sentences":[{"sentence":"Phylogenetic studies have helped refine the composition of the Lamiides clade.","translation":"系統発生学的研究は、シソ類のクレードの構成を洗練するのに役立っている。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"The Lamiides are characterized by specific chemical compounds and floral structures.","translation":"シソ類は、特定の化学化合物と花の構造によって特徴付けられる。","type":"scientific","meaning_category":"botany"}]}