{"word":"mammet","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人形、特に宗教儀式用の人形 (古語・方言)","english_definition":"a doll or puppet; especially one used in religious ceremonies (archaic/dialectal)","examples":[{"sentence":"The children played with their mammets in the churchyard.","translation":"子供たちは教会の庭で人形で遊んでいた。"}],"notes":"16-17世紀の英語でよく見られ、シェイクスピア作品にも登場する古語。現代ではほとんど使われない。","synonyms":["doll","puppet","effigy"],"antonyms":[]},{"part_of_speech":"noun","definition":"意志の弱い人、操りやすい人 (比喩的・軽蔑的)","english_definition":"a weak-willed person who is easily controlled (figurative/derogatory)","examples":[{"sentence":"He's but a mammet in the hands of his advisors.","translation":"彼は顧問たちの手の中では単なる操り人形にすぎない。"}],"notes":"主にシェイクスピア時代の比喩的用法。現代では極めて稀。","synonyms":["puppet","pushover","weakling"],"antonyms":["strong-willed person"]}],"etymology":{"value":"中英語「mawmet」から。これは「Mahomet」(ムハンマド)の変形で、イスラム教の偶像として誤解されたものから転じて「偶像」「人形」の意味に。最終的にはラテン語「Mahometus」、アラビア語「Muḥammad」に由来。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmæmɪt/","syllables":"mam-met"},"usage_notes":{"explanation":"現代英語ではほとんど使われない古語・廃語。主にシェイクスピア作品（『ロミオとジュリエット』『ヘンリー四世』など）や16-17世紀の文献で見られる歴史的語彙。宗教改革期にカトリックの聖像を批判する文脈で使われた。現代で使用すると時代錯誤的な印象を与える。","priority":"★☆☆"},"related_words":{"historical_variants":["maumet","mawmet"],"modern_equivalents":["doll","puppet","effigy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (古語)","frequency_google_ngram":"極めて低頻度 (Extremely low frequency) - 1800年以降ほとんど使用されていない","priority":"★☆☆"},"example_sentences":[{"sentence":"\"What, drawn, and talk of peace! I hate the word, As I hate hell, all Montagues, and thee: Have at thee, coward!\" [They fight] [Enter several of both houses, who join the fray; then enter Citizens with clubs.] \"Clubs, bills, and partisans! strike! beat them down! Down with the Capulets! down with the Montagues!\" [Enter CAPULET in his gown, and LADY CAPULET.] \"What noise is this? Give me my long sword, ho!\" [Enter old MONTAGUE and his Wife.] \"Thou villain Capulet!—Hold me not, let me go.\" \"Thou shalt not stir one foot to seek a foe.\" [Enter PRINCE with his Train.] \"Rebellious subjects, enemies to peace...\" - Shakespeare, Romeo and Juliet (Act 1, Scene 1)","translation":"「何だ、剣を抜いて平和などと！その言葉が大嫌いだ、地獄も、モンタギュー家も、お前も同様！かかってこい、臆病者！」[彼らは戦う] [両家の者が数人入ってきて乱闘に加わる；次に棍棒を持った市民が入ってくる] 「棍棒や槍だ！打て！打ち倒せ！キャピュレット家を倒せ！モンタギュー家を倒せ！」[ガウン姿のキャピュレットとレディ・キャピュレットが入る] 「この騒ぎは何だ？長剣をよこせ！」[老モンタギューとその妻が入る] 「このキャピュレットの悪党！―放せ、行かせろ」 「敵を求めて一歩も動かせはしない」[王子と供が入る] 「反抗的な臣民たちよ、平和の敵ども...」","note":"シェイクスピア作品での使用例（直接mammetは登場しないが、この時代の語彙として参考）"}]}