{"word":"pro-Elizabethan","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"エリザベス朝を支持する、エリザベス朝に好意的な","english_definition":"Favorable to or supportive of the Elizabethan era (the reign of Queen Elizabeth I of England).","examples":[{"sentence":"The historian's pro-Elizabethan bias was evident in his biography of the queen.","translation":"その歴史家の女王の伝記には、エリザベス朝を支持する偏りが見られた。"},{"sentence":"The play presented a pro-Elizabethan view of the period, glorifying its achievements.","translation":"その劇は、エリザベス朝の業績を賛美し、同時代を支持する視点を提示した。"}],"collocations":["pro-Elizabethan sentiment","pro-Elizabethan policies","pro-Elizabethan interpretation"],"synonyms":["Elizabethan sympathizer","Elizabethan supporter"],"antonyms":["anti-Elizabethan"],"notes":"Often used in historical or literary contexts to describe viewpoints or works that positively portray the Elizabethan era."}],"etymology":{"value":"Formed by combining the prefix 'pro-' (meaning 'in favor of') with 'Elizabethan' (referring to the era of Queen Elizabeth I).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊ ɪˌlɪzəˈbiːθən/","syllables":"pro-i-liz-a-bee-than"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'pro-Elizabethan' is used to describe someone or something that is in favor of the Elizabethan era, which was a period in English history during the reign of Queen Elizabeth I (1558-1603). It often implies a positive view of the era's politics, culture, or society.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Elizabethan","Elizabethan era"],"related_terms":["Tudor","Renaissance"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'pro-Elizabethan' is relatively specialized and is most likely to be encountered in academic or historical contexts. It describes a positive or supportive view of the Elizabethan era. Understanding requires knowledge of the Elizabethan period of English history."},"example_sentences":[{"sentence":"The scholar argued for a more nuanced understanding of the pro-Elizabethan propaganda of the time.","translation":"その学者は、当時のエリザベス朝を支持するプロパガンダについて、よりニュアンスのある理解を求めた。","type":"adjective","meaning_category":"エリザベス朝を支持する"}]}