{"word":"bitter-ender","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"最後まで抵抗する人、徹底抗戦主義者","english_definition":"a person who refuses to give up or compromise, especially when defeat is likely; one who fights to the bitter end.","examples":[{"sentence":"The general was a bitter-ender, determined to fight until the last man.","translation":"その将軍は徹底抗戦主義者で、最後の兵士が倒れるまで戦う決意をしていた。"},{"sentence":"Despite the overwhelming evidence against him, he remained a bitter-ender, denying all charges.","translation":"彼に対する圧倒的な証拠にもかかわらず、彼は徹底抗戦主義者であり続け、すべての告発を否認した。"}],"collocations":["a true bitter-ender","a political bitter-ender","a military bitter-ender"],"synonyms":["diehard","extremist","zealot","hardliner","uncompromising person"],"antonyms":["moderate","compromiser","appeaser","realist"]},{"part_of_speech":"noun","definition":"(主に歴史的な文脈で) アイルランド内戦で、条約に反対し最後まで戦ったIRAメンバー","english_definition":"(chiefly historical) a member of the IRA who opposed the Anglo-Irish Treaty and fought to the bitter end in the Irish Civil War.","examples":[{"sentence":"The bitter-enders refused to lay down their arms, even after the Free State government was established.","translation":"徹底抗戦主義者たちは、自由国政府が樹立された後も武器を置くことを拒否した。"},{"sentence":"Many bitter-enders were imprisoned or executed after the civil war.","translation":"多くのアイルランド内戦の徹底抗戦主義者たちは、内戦後に投獄または処刑された。"}],"collocations":["Irish bitter-enders","IRA bitter-enders"],"synonyms":["anti-treaty IRA member"],"antonyms":["pro-treaty IRA member"]}],"etymology":{"value":"「bitter end」という表現に由来。「bitter end」は、船のロープやケーブルの端を意味し、ロープがすべて繰り出されても最後まで抵抗するというイメージから、「最後まで」という意味になった。これに「-er」を付けて、「最後まで抵抗する人」という意味の「bitter-ender」が作られた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪtərˌɛndər/","syllables":"bit-ter-en-der"},"inflection":{"noun_plural":"bitter-enders"},"usage_notes":{"explanation":"「**bitter-ender**」は、主に政治的または軍事的な文脈で使用され、敗北が濃厚であるにもかかわらず、最後まで抵抗する人を指します。しばしば否定的な意味合いを持ち、頑固で非現実的な人物を指すことがあります。歴史的な文脈では、アイルランド内戦で条約に反対したIRAメンバーを指す特定の意味を持ちます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a bitter-ender in his personal relationships, always holding grudges.","correct":"✓ He was unforgiving in his personal relationships, always holding grudges.","note":"「bitter-ender」は、主に政治的または軍事的な文脈で使用されます。個人的な関係で恨みを持ち続ける人を指す場合は、「unforgiving」などの別の表現がより適切です。"},{"incorrect":"✗ The team was full of bitter-enders, leading to a quick victory.","correct":"✓ The team was full of determined players, leading to a quick victory.","note":"「bitter-ender」は、敗北が濃厚であるにもかかわらず抵抗する人を指すため、勝利につながる状況では不適切です。勝利につながる場合は、「determined players」などの別の表現がより適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["bitter end","diehard","last-ditch effort"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**bitter-ender**」は、特に政治や軍事の状況で、敗北がほぼ確実であるにもかかわらず、最後まであきらめない人、または妥協を拒否する人を指す言葉です。この言葉は、しばしば頑固で非現実的な態度を批判的に表現するために使われます。また、歴史的な文脈では、アイルランド内戦で条約に反対したIRAのメンバーを指すこともあります。日常会話ではあまり使われませんが、歴史や政治に関する議論で出てくることがあります。"},"example_sentences":[{"sentence":"The senator was labeled a bitter-ender for his staunch opposition to the compromise bill.","translation":"その上院議員は、妥協案に対する断固たる反対のために、徹底抗戦主義者というレッテルを貼られた。","type":"noun","meaning_category":"最後まで抵抗する人"},{"sentence":"The bitter-enders of the rebellion refused to surrender, even when surrounded by enemy forces.","translation":"反乱の徹底抗戦主義者たちは、敵軍に包囲されても降伏を拒否した。","type":"noun","meaning_category":"最後まで抵抗する人"},{"sentence":"He admired the bitter-enders for their unwavering commitment to their cause, even if it was a lost one.","translation":"彼は、たとえそれが敗北した原因であっても、彼らの揺るぎない献身を称賛した。","type":"noun","meaning_category":"最後まで抵抗する人"}]}