{"word":"stomach-qualmed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Having a queasy or uneasy feeling in the stomach; nauseated.","english_definition":"(rare) Experiencing nausea or a feeling of unease in the stomach.","examples":[{"sentence":"After eating the spoiled fish, he felt stomach-qualmed and had to lie down.","translation":"腐った魚を食べた後、彼は胃がむかむかして横にならなければならなかった。"},{"sentence":"The rollercoaster ride left her stomach-qualmed for hours.","translation":"ジェットコースターに乗った後、彼女は数時間胃がむかむかした。"}],"collocations":["feel stomach-qualmed","become stomach-qualmed","stomach-qualmed and dizzy"],"synonyms":["nauseated","queasy","sick to one's stomach","uneasy","gastroenteritic"],"antonyms":["well","healthy","fine","unaffected"]},{"part_of_speech":"adjective","definition":"(rare, figurative) Feeling disgust or moral unease.","english_definition":"(rare, figurative) Experiencing disgust or moral discomfort.","examples":[{"sentence":"He felt stomach-qualmed by the politician's blatant lies.","translation":"彼は政治家の露骨な嘘に吐き気を催した。"},{"sentence":"She was stomach-qualmed by the corruption she witnessed.","translation":"彼女は目撃した汚職に嫌悪感を抱いた。"}],"collocations":["stomach-qualmed by","feel stomach-qualmed","morally stomach-qualmed"],"synonyms":["disgusted","repulsed","sickened","appalled","revolted"],"antonyms":["pleased","satisfied","content","approving"]}],"etymology":{"value":"A compound word formed from \"stomach\" (the organ) and \"qualmed\" (past participle of \"qualm,\" meaning a feeling of unease or nausea). The word suggests that the feeling of unease or nausea originates in the stomach.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstʌməkˌkwɔːlmd/","syllables":"stom-ach-qualmed"},"inflection":{"notes":"This is an adjective, so it does not inflect for tense or number. It can be used in comparative and superlative forms (more stomach-qualmed, most stomach-qualmed), although such usage is rare."},"usage_notes":{"explanation":"The word \"stomach-qualmed\" is relatively rare and not commonly used in modern English. It is more likely to be found in older literature or in specific contexts where a strong emphasis on physical or moral unease is desired. The figurative use, referring to moral disgust, is even less common than the literal sense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was stomach-qualmed about the news.","correct":"✓ He felt stomach-qualmed by the news.","note":"It's more common to use \"feel stomach-qualmed by\" to express the cause of the nausea or unease."},{"incorrect":"✗ She is stomach-qualmed.","correct":"✓ She feels stomach-qualmed.","note":"Using \"feel\" emphasizes the sensation of nausea or unease."}],"priority":"★☆☆"},"related_words":{"derivatives":["qualm (noun: a feeling of unease or doubt)","qualmish (adjective: slightly nauseated or uneasy)"],"phrases":["sick to one's stomach","have butterflies in one's stomach"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - The word is rarely used in contemporary English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Stomach-qualmed\" is a rare and somewhat archaic word. It combines \"stomach\" with \"qualmed,\" indicating a feeling of nausea or unease originating in the stomach. It can also be used figuratively to describe a feeling of disgust or moral unease. Due to its rarity, it is not commonly encountered in everyday language and is more likely to be found in older literature or specialized contexts."},"example_sentences":[{"sentence":"The smell of rotten eggs left her feeling stomach-qualmed.","translation":"腐った卵の匂いで、彼女は吐き気を催した。","type":"adjective","meaning_category":"nauseated"},{"sentence":"He was stomach-qualmed by the sight of the battlefield.","translation":"彼は戦場の光景に嫌悪感を抱いた。","type":"adjective","meaning_category":"disgusted"}]}