{"word":"Extortionateness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"法外なこと、不当な高額さ、過度の要求","english_definition":"The state or quality of being extortionate; excessive or unreasonable expensiveness or demanding.","examples":[{"sentence":"The extortionateness of the prices at the resort made it difficult to enjoy the vacation.","translation":"リゾート地の法外な価格のせいで、休暇を楽しむのが難しくなった。"},{"sentence":"The extortionateness of the ransom demanded by the kidnappers shocked the family.","translation":"誘拐犯が要求した法外な身代金は家族を震撼させた。"},{"sentence":"Consumers complained about the extortionateness of the fees charged by the bank.","translation":"消費者は銀行が請求する法外な手数料について不満を述べた。"}],"collocations":["price extortionateness","fee extortionateness","ransom extortionateness"],"synonyms":["excessiveness","unreasonableness","exorbitance","outrageousness","profiteering","overpricing"],"antonyms":["reasonableness","fairness","moderation","affordability"]}],"etymology":{"value":"Derived from 'extortionate,' which comes from 'extortion.' 'Extortion' originates from the Latin word 'extortus,' the past participle of 'extorquere,' meaning 'to wrest away, to obtain by force or threats.' The suffix '-ness' is added to 'extortionate' to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌstɔːrʃənətˈnɛs/","syllables":"ex-tor-tion-ate-ness"},"inflection":{"noun_plural":"(uncountable noun, no plural form)"},"usage_notes":{"explanation":"'Extortionateness' is a noun that refers to the degree to which something is excessively expensive or demanding, often implying an unfair or unjustifiable nature. It is typically used in contexts where prices, fees, or demands are considered unreasonably high.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The extortionateness was obvious. The price was very high.","correct":"✓ The extortionateness of the price was obvious.","note":"It's better to specify what is extortionate, e.g., 'the extortionateness of the price,' rather than using 'extortionateness' alone as a subject."},{"incorrect":"✗ She showed extortionateness when asking for money.","correct":"✓ She showed extortionate behavior when asking for money.","note":"'Extortionateness' is a state or quality, not an action. 'Extortionate behavior' is more appropriate to describe someone's actions."}],"priority":"★★☆"},"related_words":{"derivatives":["extortion (noun): The practice of obtaining something, especially money, through force or threats.","extortionate (adjective): (of a price) excessively high.","extortionately (adverb): In an extortionate manner."],"related_terms":["blackmail","racketeering","bribery","coercion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Extortionateness' is a relatively rare and complex word used to describe the degree to which something is excessively expensive or demanding, often in an unfair or unjustifiable way. It is typically used in formal contexts to discuss issues of overpricing, unreasonable fees, or excessive demands. Understanding this word requires a strong vocabulary and the ability to recognize abstract nouns. "},"example_sentences":[{"sentence":"The **extortionateness** of the hospital bills left the patient in severe debt.","translation":"病院の請求書の法外な高さは、患者を深刻な借金状態に陥れた。","type":"noun","meaning_category":"法外なこと"},{"sentence":"The **extortionateness** of the parking fees downtown discourages shoppers from visiting.","translation":"ダウンタウンの駐車料金の法外な高さは、買い物客が訪れるのをためらわせる。","type":"noun","meaning_category":"不当な高額さ"},{"sentence":"The **extortionateness** of the loan's interest rate was considered predatory lending.","translation":"ローンの金利の法外な高さは、略奪的な貸付とみなされた。","type":"noun","meaning_category":"過度の要求"}]}