{"word":"land-rat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"陸にいるネズミ、特に船乗りが軽蔑的に使う言葉","english_definition":"a rat that lives on land, especially a term of contempt used by sailors.","examples":[{"sentence":"The old sailor called the city dwellers land-rats, implying they were ignorant of the sea.","translation":"その老船乗りは都会の住民を陸ネズミと呼び、彼らが海を知らないことをほのめかした。"},{"sentence":"He preferred the company of his shipmates to the land-rats he encountered in port.","translation":"彼は港で出会う陸ネズミよりも船仲間の仲間を好んだ。"}],"collocations":["call someone a land-rat (誰かを陸ネズミと呼ぶ)","despise land-rats (陸ネズミを軽蔑する)"],"synonyms":["landsman","lubber","city dweller (軽蔑的な意味で)"],"antonyms":["seaman","sailor","mariner"]},{"part_of_speech":"noun","definition":"陸上生活に慣れた人、特に船乗りが軽蔑的に使う言葉","english_definition":"a person accustomed to life on land, especially when regarded with contempt by sailors.","examples":[{"sentence":"As a seasoned sailor, he viewed anyone who hadn't sailed the seas as a land-rat.","translation":"熟練した船乗りとして、彼は海を航海したことのない人を陸ネズミと見なした。"},{"sentence":"The experienced captain scoffed at the land-rats who complained about the mildest of storms.","translation":"経験豊富な船長は、ごく穏やかな嵐について文句を言う陸ネズミをあざ笑った。"}],"collocations":["treat someone like a land-rat (誰かを陸ネズミのように扱う)","refer to someone as a land-rat (誰かを陸ネズミと呼ぶ)"],"synonyms":["landsman","landlubber","greenhorn (軽蔑的な意味で)"],"antonyms":["seaman","sailor","mariner"]}],"etymology":{"value":"'Land'（陸）と 'rat'（ネズミ）の複合語。船乗りが陸上生活者、特に船や海に不慣れな人を軽蔑的に呼ぶ言葉として使われた。ネズミは不潔で嫌われる存在であることから、陸上生活者を軽蔑する意味合いが込められている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlændˌræt/","syllables":"land-rat"},"inflection":{"noun_plural":"land-rats"},"usage_notes":{"explanation":"「**land-rat**」は、主に船乗りが陸上生活者を軽蔑的に呼ぶ言葉です。文字通りには「陸にいるネズミ」を意味しますが、比喩的には「海を知らない人」「船乗りではない人」を指し、軽蔑や嘲笑のニュアンスを含みます。現代ではあまり使われない古風な表現ですが、海洋文学や歴史的な文脈では見かけることがあります。類似の言葉に「landlubber (陸(おか)っぺき)」があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a land-rat because he liked animals.","correct":"✓ He was called a land-rat because he had never been to sea.","note":"「land-rat」は動物好きであることを意味しません。船乗りが海を知らない陸上生活者を軽蔑的に呼ぶ言葉です。"},{"incorrect":"✗ The land-rat was very clean and tidy.","correct":"✓ The land-rat was clumsy and awkward on the ship.","note":"「land-rat」は、船乗りから見て、船上での生活に不慣れでぎこちない人を指すことがあります。清潔さとは直接関係ありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"idioms_phrases":["landlubber (陸(おか)っぺき)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 古風な表現で、現代英語ではあまり一般的ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**land-rat**」は、船乗りが陸上生活者を軽蔑的に呼ぶ古風な言葉です。文字通りの意味は「陸にいるネズミ」ですが、比喩的には「海を知らない人」「船乗りではない人」を指し、軽蔑や嘲笑のニュアンスを含みます。現代ではあまり使われませんが、海洋文学や歴史的な文脈では見かけることがあります。類似の言葉に「landlubber」があります。この単語は、海洋文化における船乗りと陸上生活者の間の対立や偏見を反映しています。"},"example_sentences":[{"sentence":"The salty old captain scoffed at the **land-rats** who couldn't stomach the rocking of the ship.","translation":"塩辛い老船長は、船の揺れに耐えられない陸ネズミたちをあざ笑った。","type":"noun","meaning_category":"陸上生活者 (軽蔑的な意味で)"},{"sentence":"He felt like a **land-rat** when he first stepped aboard the creaking vessel.","translation":"彼は、軋む船に初めて足を踏み入れたとき、まるで陸ネズミのように感じた。","type":"noun","meaning_category":"陸上生活者 (軽蔑的な意味で)"}]}