{"word":"alamiqui","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Philippines) A type of civet cat, specifically the Asian palm civet (Paradoxurus hermaphroditus).","english_definition":"A local name in the Philippines for the Asian palm civet (Paradoxurus hermaphroditus).","examples":[{"sentence":"The alamiqui is known for its role in producing civet coffee.","translation":"アラミキは、ジャコウネココーヒーの生産における役割で知られています。"}],"collocations":["civet coffee","Asian palm civet"],"synonyms":["Asian palm civet","musang (in other regions)"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language. The exact origin requires further linguistic research.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɑːləˈmiːki/","syllables":"a-la-mi-qui"},"inflection":{"noun_plural":"alamiquies"},"usage_notes":{"explanation":"'Alamiqui' is a regional term used in the Philippines, particularly in areas where the Asian palm civet is found. It's important to note that while 'alamiqui' refers to the animal itself, it's often associated with the production of civet coffee, where the civets eat coffee cherries, and the partially digested beans are collected for processing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Alamiqui are found only in Africa.","correct":"✓ Alamiqui are found in the Philippines and other parts of Asia.","note":"Alamiqui (Asian palm civets) are native to Asia, not Africa."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in the Philippines and among those familiar with civet coffee.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alamiqui' is a specialized term referring to the Asian palm civet, primarily used in the Philippines. Understanding this term requires familiarity with the local fauna of the Philippines or knowledge of civet coffee production. It is not a commonly used word outside of these contexts."},"example_sentences":[{"sentence":"The locals call the civet cat an 'alamiqui'.","translation":"地元の人々は、そのジャコウネコを「アラミキ」と呼んでいます。","type":"noun","meaning_category":"animal name"},{"sentence":"The 'alamiqui' plays a role in the production of a special kind of coffee.","translation":"「アラミキ」は、特別な種類のコーヒーの生産に役割を果たしています。","type":"noun","meaning_category":"animal related to coffee production"}]}