{"word":"jugal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"頬骨の、頬骨の近くの","english_definition":"relating to the cheekbone or zygomatic bone.","examples":[{"sentence":"The jugal bone is also known as the zygomatic bone.","translation":"頬骨は頬骨としても知られています。"},{"sentence":"The jugal arch is formed by the zygomatic process of the temporal bone and the temporal process of the jugal bone.","translation":"頬骨弓は、側頭骨の頬骨突起と頬骨の側頭突起によって形成されます。"}],"collocations":["jugal bone","jugal arch","jugal region"],"synonyms":["zygomatic"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'jugum', meaning 'yoke' or 'connection', referring to the bone's function in connecting facial structures.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒuːɡəl/","syllables":"ju-gal"},"inflection":{"notes":"The word 'jugal' is primarily used as an adjective. It doesn't typically have different inflections."},"usage_notes":{"explanation":"'Jugal' is a term primarily used in anatomy and zoology to describe structures related to the cheekbone. It is most commonly encountered in scientific or medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jugal is a muscle in the face.","correct":"✓ The jugal bone is a bone in the face.","note":"'Jugal' refers to a bone, not a muscle."}],"priority":"★★☆"},"related_words":{"derivatives":["jugale (noun, a point on the zygomatic arch)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'jugal' is a technical adjective primarily used in the fields of anatomy and zoology to describe structures related to the cheekbone or zygomatic bone. Due to its specialized usage, it is not commonly encountered in general English. Understanding its meaning is crucial in contexts involving discussions of skeletal anatomy, particularly in vertebrate animals."},"example_sentences":[{"sentence":"The size and shape of the jugal bone can vary significantly between different species of mammals.","translation":"頬骨の大きさや形状は、哺乳動物の種によって大きく異なる場合があります。","type":"adjective","meaning_category":"Anatomical Description"},{"sentence":"Researchers studied the jugal arch to understand the biomechanics of biting in rodents.","translation":"研究者たちは、げっ歯類の咬合の生体力学を理解するために頬骨弓を研究しました。","type":"adjective","meaning_category":"Anatomical Research"}]}