{"word":"sclerotitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"強膜炎","english_definition":"Inflammation of the sclera (the white part of the eye).","examples":[{"sentence":"Sclerotitis can cause severe eye pain and vision problems.","translation":"強膜炎は、激しい目の痛みや視力障害を引き起こす可能性があります。"},{"sentence":"Treatment for sclerotitis typically involves corticosteroids or other immunosuppressant medications.","translation":"強膜炎の治療には通常、コルチコステロイドまたは他の免疫抑制剤が用いられます。"}],"collocations":["anterior sclerotitis (前部強膜炎)","necrotizing sclerotitis (壊死性強膜炎)","posterior sclerotitis (後部強膜炎)"],"synonyms":["episcleritis (類義語だが、強膜炎よりも軽度な炎症)"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「sclero-」(硬い) + 「-itis」(炎症) に由来。目の強膜の炎症を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsklɪəroʊˈtaɪtɪs/","syllables":"scle-ro-ti-tis"},"inflection":{"noun_plural":"scleritides (まれ)"},"usage_notes":{"explanation":"Sclerotitis is a relatively rare but serious inflammatory condition affecting the sclera. It is often associated with systemic autoimmune diseases such as rheumatoid arthritis or lupus. The condition can lead to vision loss if left untreated. There are different types of sclerotitis, including anterior, posterior, and necrotizing forms, each with varying degrees of severity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ scleritis","correct":"✓ sclerotitis","note":"While 'scleritis' is sometimes used, 'sclerotitis' is the more precise and commonly accepted term for inflammation of the sclera. Scleritis is an older term that is still sometimes used, but sclerotitis is preferred in medical literature."}],"priority":"★★☆"},"related_words":{"derivatives":["sclera (強膜)","episcleritis (上強膜炎)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**sclerotitis**」は、目の白い部分である強膜の炎症を指す医学用語です。自己免疫疾患などの全身性疾患と関連していることが多く、放置すると視力喪失につながる可能性があります。前部、後部、壊死性など、さまざまな種類があり、それぞれ重症度が異なります。この用語は医学的な文脈でのみ使用され、一般の会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The patient presented with severe eye pain and redness, which was later diagnosed as **sclerotitis**.","translation":"患者は激しい目の痛みと充血を訴え、後に強膜炎と診断されました。","type":"general"},{"sentence":"Necrotizing **sclerotitis** is the most severe form of the disease and can lead to significant vision loss.","translation":"壊死性強膜炎は、この疾患の最も重篤な形態であり、重大な視力喪失につながる可能性があります。","type":"specific"}]}