{"word":"Destructivism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"破壊主義、破壊的行動","english_definition":"The theory or practice of deliberately destructive actions, often for political purposes.","examples":[{"sentence":"The group was accused of destructivism after vandalizing public property.","translation":"そのグループは公共物を破壊した後、破壊主義であると非難された。"},{"sentence":"Some critics see modern art as a form of destructivism, rejecting traditional values.","translation":"一部の批評家は、現代アートを伝統的な価値観を拒否する破壊主義の一形態と見なしている。"}],"collocations":["political destructivism","social destructivism","artistic destructivism"],"synonyms":["vandalism","sabotage","nihilism","iconoclasm"],"antonyms":["constructivism","creation","preservation"]}],"etymology":{"value":"'Destructivism' is derived from 'destruct' (to destroy) and '-ism' (a doctrine, theory, or practice).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈstrʌktɪˌvɪzəm/","syllables":"de-struc-ti-vi-sm"},"inflection":{"noun_plural":"Destructivisms"},"usage_notes":{"explanation":"'Destructivism' refers to the deliberate destruction or vandalism, often with a political or ideological motivation. It is often used to describe actions that aim to disrupt or dismantle existing social structures or norms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed destructivism by cleaning his room.","correct":"✓ He showed destructiveness by cleaning his room.","note":"Destructivism is a philosophy or practice of destruction, not just any destructive act. Destructiveness is the tendency to destroy."},{"incorrect":"✗ The destructivism of the building was shocking.","correct":"✓ The destruction of the building was shocking.","note":"Destructivism refers to the ideology, while destruction refers to the act of destroying something."}],"priority":"★★☆"},"related_words":{"derivatives":["destructive (adjective: causing destruction)","destruct (verb: to destroy)","destruction (noun: the act of destroying)","destructivist (noun: a person who practices destructivism)"],"phrases":["destructive behavior","destructive tendencies"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Destructivism' is a complex term that refers to a philosophy or practice involving deliberate destruction, often for political or ideological reasons. It is not simply about random acts of destruction but rather a systematic approach to dismantling existing structures or norms. The term is often used in academic or political discussions and requires a sophisticated understanding of social and political concepts."},"example_sentences":[{"sentence":"The rise of political extremism has led to an increase in acts of destructivism.","translation":"政治的過激主義の台頭は、破壊主義的行為の増加につながっている。","type":"general"},{"sentence":"The artist's work was criticized for its perceived destructivism towards traditional art forms.","translation":"そのアーティストの作品は、伝統的な芸術形式に対する破壊主義と見なされ、批判された。","type":"art"},{"sentence":"Some argue that certain forms of protest can be seen as a type of destructivism.","translation":"一部の人は、特定の抗議活動は破壊主義の一種と見なすことができると主張している。","type":"politics"}]}