{"word":"Phyllostomine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A member of the Phyllostominae subfamily of bats.","english_definition":"A bat belonging to the Phyllostominae subfamily, characterized by their leaf-shaped nose and diverse feeding habits.","examples":[{"sentence":"The phyllostomine bats are found throughout the Americas.","translation":"ヘラコウモリ亜科のコウモリはアメリカ大陸全域で見られます。"},{"sentence":"Different species of phyllostomine bats have adapted to various diets, including fruits, insects, and even blood.","translation":"ヘラコウモリ亜科のコウモリの異なる種は、果物、昆虫、そして血液を含む様々な食餌に適応しています。"}],"collocations":["phyllostomine bat","phyllostomine species","phyllostomine diversity"],"synonyms":["leaf-nosed bat"],"antonyms":[]}],"etymology":{"value":"Derived from the scientific name of the subfamily, Phyllostominae, which is based on the Greek words 'phyllon' (leaf) and 'stoma' (mouth), referring to the leaf-like structure on their noses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪloʊˈstɒmɪn/","syllables":"phyl-lo-sto-mine"},"inflection":{"noun_plural":"Phyllostomines"},"usage_notes":{"explanation":"'Phyllostomine' typically refers to any bat within the Phyllostominae subfamily. These bats are known for their specialized noseleaf, which aids in echolocation. The term is most often used in scientific or zoological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phyllostomine is a type of bird.","correct":"✓ The phyllostomine is a type of bat.","note":"Phyllostomines are bats, not birds."},{"incorrect":"✗ Phyllostomine bats only eat blood.","correct":"✓ Phyllostomine bats have diverse diets, including fruits, insects, and blood.","note":"While some phyllostomines are vampire bats, the subfamily includes species with varied diets."}],"priority":"★★☆"},"related_words":{"derivatives":["Phyllostomidae (family)","Phyllostominae (subfamily)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'phyllostomine' is a specialized term used in zoology and related fields to refer to bats belonging to the Phyllostominae subfamily. Understanding this term requires familiarity with biological classification systems and bat anatomy. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The study focused on the echolocation abilities of phyllostomine bats.","translation":"その研究はヘラコウモリ亜科のコウモリの反響定位能力に焦点を当てました。","type":"noun","meaning_category":"general"},{"sentence":"Phyllostomine bats play a crucial role in seed dispersal in tropical ecosystems.","translation":"ヘラコウモリ亜科のコウモリは熱帯生態系における種子散布において重要な役割を果たしています。","type":"noun","meaning_category":"ecological role"}]}