{"word":"Saturability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"飽和性：ある物質またはシステムが、それ以上何かを吸収、保持、または反応することができない状態。","english_definition":"The property of being saturable; the state of being able to be saturated; the condition in which no more of something can be absorbed, dissolved, or reacted with.","examples":[{"sentence":"The saturability of the enzyme active site limits the rate of the reaction.","translation":"酵素活性部位の飽和性が、反応速度を制限する。"},{"sentence":"The saturability of the market for this product is a concern for investors.","translation":"この製品の市場の飽和性は、投資家にとって懸念事項である。"}],"collocations":["enzyme saturability","market saturability","binding saturability"],"synonyms":["saturation","capacity","limit","ceiling"],"antonyms":["unsaturation","capacity","limitless"]}],"etymology":{"value":"The word \"saturability\" is derived from \"saturable,\" which comes from \"saturate.\" \"Saturate\" originates from the Latin word \"saturare,\" meaning \"to fill full, glut, drench.\" The suffix \"-ability\" indicates the capacity or capability of being saturated.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsætʃərəˈbɪləti/","syllables":"sa-tur-a-bil-i-ty"},"inflection":{"noun_plural":"saturabilities"},"usage_notes":{"explanation":"\"Saturability\" is a technical term often used in scientific and economic contexts. In chemistry and biology, it describes the point at which a substance can no longer absorb or react with any more of another substance. In economics, it refers to the point where a market can no longer absorb more of a product or service.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The saturability is very high.","correct":"✓ The saturation level is very high.","note":"While \"saturability\" refers to the property of being saturable, \"saturation level\" is often used to describe the degree to which something is saturated at a given point."}],"priority":"★★☆"},"related_words":{"derivatives":["saturate (verb)","saturated (adjective)","saturation (noun)","saturable (adjective)"],"related_scientific_terms":["Michaelis-Menten kinetics","enzyme kinetics","binding affinity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Saturability\" is a technical term primarily used in scientific or economic fields. It describes the capacity of something to become saturated, meaning it can't absorb, dissolve, or react with any more of a substance. Understanding this term requires familiarity with the context in which it's used, such as chemistry, biology, or economics. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The saturability of the receptor binding sites determines the maximum drug effect.","translation":"受容体結合部位の飽和性が、薬物の最大効果を決定する。","type":"scientific","meaning_category":"capacity"},{"sentence":"Due to the market's saturability, the company is exploring new regions for expansion.","translation":"市場の飽和性のため、会社は拡大のために新しい地域を模索している。","type":"economic","meaning_category":"capacity"}]}