{"word":"Deming","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"デミング、アメリカの統計学者、経営学者","english_definition":"William Edwards Deming (1900-1993), an American statistician, professor, author, lecturer, and consultant. Known for his work in Japan after World War II, particularly his promotion of quality control and management.","examples":[{"sentence":"Deming's 14 points for management are still relevant today.","translation":"デミングの経営のための14か条は今日でも依然として重要である。"},{"sentence":"The Deming Prize is awarded to companies that demonstrate excellence in quality management.","translation":"デミング賞は、品質管理において卓越性を示す企業に授与される。"}],"collocations":["Deming's 14 points (デミングの14か条)","Deming Prize (デミング賞)","Deming cycle (デミングサイクル, PDCAサイクル)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after William Edwards Deming.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛmɪŋ/","syllables":"Dem-ing"},"inflection":{},"usage_notes":{"explanation":"'Deming' typically refers to William Edwards Deming, a key figure in the development of quality management practices, particularly in post-World War II Japan. His name is associated with specific concepts and awards in the field of management and quality control.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Deming Prize (デミング賞)","Deming cycle (PDCAサイクル)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'Deming' usually refers to William Edwards Deming, a very important person in the field of quality management. You'll often see it in discussions about business and manufacturing, especially when talking about how to improve processes and make things better. It's a term mainly used in professional contexts."},"example_sentences":[{"sentence":"The company implemented **Deming's** principles to improve efficiency.","translation":"その会社は効率を改善するためにデミングの原則を導入した。","type":"proper noun","meaning_category":"person"},{"sentence":"The **Deming** Prize is a prestigious award for quality management.","translation":"デミング賞は品質管理における権威ある賞である。","type":"proper noun","meaning_category":"award"}]}