{"word":"bluepoint","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"青写真、設計図","english_definition":"A type of print, typically white lines on a blue background, used for copying technical drawings, architectural plans, and similar documents.","examples":[{"sentence":"The architect spread out the bluepoint of the new building.","translation":"建築家は新しい建物の青写真を広げた。"},{"sentence":"We need to make several copies of this bluepoint.","translation":"この青写真を数部コピーする必要がある。"}],"collocations":["architectural bluepoint","engineering bluepoint"],"synonyms":["blueprint","plan","technical drawing","design"],"antonyms":[]},{"part_of_speech":"noun","definition":"(料理) ある種のチーズ","english_definition":"A type of cheese, often blue cheese.","examples":[{"sentence":"He ordered a bluepoint cheese and crackers.","translation":"彼はブルーポイントチーズとクラッカーを注文した。"}],"collocations":[],"synonyms":["blue cheese"],"antonyms":[]}],"etymology":{"value":"The term 'bluepoint' comes from the photographic printing process that created white lines on a blue background.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbluː.pɔɪnt/","syllables":"blue-point"},"inflection":{"noun_plural":"bluepoints"},"usage_notes":{"explanation":"The term 'bluepoint' is somewhat archaic, as it has largely been replaced by more modern printing methods. However, it is still used to refer to technical drawings and plans, especially in contexts where historical accuracy is important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a bluepoint of the new software.","correct":"✓ I need a blueprint of the new software.","note":"In the context of software, 'blueprint' is more commonly used than 'bluepoint'."}],"priority":"★☆☆"},"related_words":{"derivatives":["blueprint (more common synonym)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bluepoint' is a term primarily used in technical fields to describe a specific type of print used for architectural and engineering drawings. While 'blueprint' is a more common and widely understood term, 'bluepoint' specifically refers to the older printing process resulting in white lines on a blue background. Its usage is becoming less frequent due to advancements in printing technology."},"example_sentences":[{"sentence":"The engineers consulted the bluepoint to ensure accurate measurements.","translation":"エンジニアは正確な寸法を確保するために青写真を参照した。","type":"noun","meaning_category":"設計図"},{"sentence":"The old bluepoint was fragile and needed careful handling.","translation":"古い青写真は壊れやすく、慎重な取り扱いが必要だった。","type":"noun","meaning_category":"設計図"}]}