{"word":"unmaternal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"母親らしくない、母性愛に欠ける","english_definition":"not exhibiting or possessing qualities typically associated with a mother; lacking in maternal instincts or behavior.","examples":[{"sentence":"Her unmaternal attitude towards her children was shocking.","translation":"彼女の子供たちに対する母親らしくない態度は衝撃的だった。"},{"sentence":"Some critics considered her character in the play to be cold and unmaternal.","translation":"一部の批評家は、劇中の彼女の性格を冷たく、母性愛に欠けていると見なした。"},{"sentence":"His upbringing was marked by an unmaternal caregiver.","translation":"彼の育成は、母親らしくない介護者によって特徴づけられた。"}],"collocations":["unmaternal behavior","unmaternal attitude","unmaternal feelings","unmaternal instinct"],"synonyms":["unmotherly","unfeeling","cold","distant","neglectful"],"antonyms":["maternal","motherly","caring","nurturing","loving"]}],"etymology":{"value":"'Un-' (not) + 'maternal' (relating to a mother).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnməˈtɜːrnl/","syllables":"un-ma-ter-nal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more unmaternal' and 'most unmaternal'."},"usage_notes":{"explanation":"'Unmaternal' describes a person, usually a woman, who does not display the expected or typical characteristics of a mother. This can include a lack of warmth, care, or protectiveness towards children. It's often used in a critical or judgmental way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted very unmaternal with her friends.","correct":"✓ She acted very unmaternally with her friends.","note":"'Unmaternal' is an adjective, so it should describe a noun (usually a person or their behavior). To describe how someone acted, use the adverb 'unmaternally'."},{"incorrect":"✗ The unmaternal woman adopted a child.","correct":"✓ The woman, despite being unmaternal, adopted a child.","note":"'Unmaternal' suggests a lack of motherly qualities. If the woman adopted a child, it implies a desire to care for someone, which might contradict the 'unmaternal' description. It's better to acknowledge the lack of maternal qualities but highlight the adoption as a separate action."}],"priority":"★★☆"},"related_words":{"derivatives":["unmaternally (adverb)"],"phrasal_verbs":[],"related_terms":["maternal","paternal","motherly","fatherly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmaternal' is a relatively uncommon word used to describe someone, typically a woman, who lacks the qualities or behaviors expected of a mother. It implies a deviation from societal expectations of maternal care and affection. The word carries a negative connotation and is often used in contexts where someone is being criticized for their lack of motherly instincts. Understanding the word involves recognizing its judgmental undertones and its connection to cultural expectations of motherhood."},"example_sentences":[{"sentence":"Her cold and distant demeanor was often described as unmaternal.","translation":"彼女の冷たくてよそよそしい態度は、しばしば母親らしくないと評された。","type":"adjective","meaning_category":"Lack of motherly qualities"},{"sentence":"The novel explores the consequences of an unmaternal upbringing.","translation":"その小説は、母性愛に欠ける育成の結果を探求している。","type":"adjective","meaning_category":"Lack of motherly qualities"},{"sentence":"Despite her success in business, she was criticized for being an unmaternal figure.","translation":"ビジネスで成功したにもかかわらず、彼女は母親らしくないと批判された。","type":"adjective","meaning_category":"Lack of motherly qualities"}]}