{"word":"tear-forced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a smile, laugh, etc.) produced with difficulty, as if forced through tears; strained, unnatural.","english_definition":"Produced with difficulty, as if forced through tears; strained, unnatural.","examples":[{"sentence":"A tear-forced smile appeared on her face as she tried to reassure him.","translation":"彼を安心させようとしたとき、彼女の顔に涙をこらえたような笑顔が浮かんだ。"},{"sentence":"His tear-forced laugh sounded hollow and unconvincing.","translation":"彼の涙をこらえたような笑い声は空虚で説得力がなかった。"}],"collocations":["tear-forced smile","tear-forced laugh","tear-forced expression"],"synonyms":["strained","unnatural","forced","hollow","insincere","labored"],"antonyms":["genuine","heartfelt","sincere","natural","authentic"]}],"etymology":{"value":"Compound word formed from 'tear' (referring to tears) and 'forced' (past participle of 'force', meaning compelled or strained). The combination suggests something produced with difficulty, as if pushing through tears.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərˌfɔːrst/","syllables":"tear-forced"},"inflection":{"notes":"Adjective, does not have comparative or superlative forms."},"usage_notes":{"explanation":"The adjective 'tear-forced' describes something (usually a smile, laugh, or expression) that appears strained or unnatural because it is produced with difficulty, as if the person is trying to hold back tears. It implies a sense of sadness or emotional distress underlying the outward expression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She gave a tear-forced cry.","correct":"✓ She gave a tearful cry.","note":"'Tear-forced' typically describes smiles, laughs, or expressions, not cries. A 'tearful cry' is a more appropriate description for a cry filled with tears."},{"incorrect":"✗ The actor's performance was tear-forced.","correct":"✓ The actor's performance was forced.","note":"While an actor might portray a 'tear-forced' smile or laugh, describing the entire performance as 'tear-forced' is less common. 'Forced' alone is often sufficient to convey the unnatural or strained quality of the performance."}],"priority":"★★☆"},"related_words":{"derivatives":["tearful (adjective: filled with tears, sad)","forced (adjective: strained, unnatural)"],"phrases":["through tears (adverbial phrase: while crying or with tears in one's eyes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively rare word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'tear-forced' is a relatively uncommon and descriptive adjective, best suited for advanced English learners. It describes a smile, laugh, or expression that appears strained and unnatural, as if the person is trying to hold back tears. Understanding the word requires a good grasp of figurative language and the ability to infer meaning from context. It is more likely to be encountered in literature or descriptive writing than in everyday conversation."},"example_sentences":[{"sentence":"Despite the bad news, he managed a tear-forced smile for his daughter.","translation":"悪い知らせにもかかわらず、彼は娘のために涙をこらえたような笑顔を見せた。","type":"adjective","meaning_category":"strained smile"},{"sentence":"Her tear-forced laugh did little to hide her true feelings.","translation":"彼女の涙をこらえたような笑い声は、彼女の本当の気持ちをほとんど隠すことができなかった。","type":"adjective","meaning_category":"strained laugh"},{"sentence":"The photograph captured a tear-forced expression on the refugee's face.","translation":"その写真は、難民の顔に涙をこらえたような表情をとらえていた。","type":"adjective","meaning_category":"strained expression"}]}