{"word":"nonvisibly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"目に見えないように、不可視的に","english_definition":"In a manner that is not visible; invisibly.","examples":[{"sentence":"The security system operated nonvisibly, monitoring the premises without being seen.","translation":"そのセキュリティシステムは、目に見えないように作動し、監視されることなく構内を監視していた。"},{"sentence":"The dye was added nonvisibly to the solution, only becoming apparent under UV light.","translation":"その染料は溶液に目に見えないように加えられ、紫外線下でのみ明らかになった。"}],"collocations":["operate nonvisibly","add nonvisibly","apply nonvisibly","work nonvisibly"],"synonyms":["invisibly","imperceptibly","unnoticeably","obscurely"],"antonyms":["visibly","perceptibly","noticeably","obviously"]}],"etymology":{"value":"\"non-\" (否定) + \"visibly\" (目に見えるように)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈvɪzɪbli/","syllables":"non-vis-i-bly"},"inflection":{"notes":"Adverb, so no plural or conjugation."},"usage_notes":{"explanation":"\"Nonvisibly\" is used to describe actions or processes that occur without being seen. It often implies a deliberate effort to conceal or hide something. It is less common than \"invisibly\" but provides a more precise description when the lack of visibility is a key characteristic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The magic happened nonvisibly for the audience.","correct":"✓ The magic happened invisibly for the audience.","note":"\"Invisibly\" is more commonly used in general contexts. \"Nonvisibly\" is better when emphasizing the manner of not being seen, often due to a specific design or intention."}],"priority":"★★☆"},"related_words":{"derivatives":["nonvisible (adjective)","visibility (noun)","visible (adjective)","visibly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonvisibly\" is a relatively uncommon adverb that means \"in a way that is not visible.\" It's formed by adding the prefix \"non-\" (meaning \"not\") to the adverb \"visibly.\" This word is typically used in technical or descriptive contexts where it's important to emphasize the lack of visibility of something. Because it is not a common word, it is more appropriate for advanced English speakers and writers."},"example_sentences":[{"sentence":"The software collected data nonvisibly in the background.","translation":"そのソフトウェアはバックグラウンドで目に見えないようにデータを収集した。","type":"general","meaning_category":"manner"},{"sentence":"The security features were implemented nonvisibly to avoid alerting potential intruders.","translation":"セキュリティ機能は、侵入者に警戒されないように、目に見えないように実装された。","type":"technical","meaning_category":"manner"}]}