{"word":"banago","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Philippines) A type of fish, specifically the gray mullet.","english_definition":"A species of fish, the gray mullet, found in the Philippines.","examples":[{"sentence":"We had grilled banago for dinner last night.","translation":"昨夜の夕食はバナゴのグリルでした。"},{"sentence":"Banago is a popular fish in Filipino cuisine.","translation":"バナゴはフィリピン料理で人気の魚です。"}],"collocations":["grilled banago","fresh banago","banago recipe"],"synonyms":["gray mullet","mullet"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language. Further research is needed to determine the exact origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/bɐˈnɑːɡoʊ/","syllables":"ba-na-go"},"inflection":{"notes":"Noun, plural form is 'banagos' (less common)."},"usage_notes":{"explanation":"'Banago' is primarily used in the Philippines to refer to the gray mullet fish. It is a culinary term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a banago swimming in the ocean near Japan.","correct":"✓ I saw a gray mullet swimming in the ocean near Japan.","note":"While gray mullet exist outside the Philippines, 'banago' specifically refers to the fish within the context of Philippine cuisine and language."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside the Philippines.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Banago' is a specific term for gray mullet used primarily in the Philippines. It is not a widely known word outside of that region. Understanding this word requires knowledge of Philippine cuisine or ichthyology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The market had a fresh catch of banago this morning.","translation":"今朝、市場にはバナゴの新鮮な水揚げがありました。","type":"noun","meaning_category":"fish"},{"sentence":"My grandmother's recipe for stuffed banago is delicious.","translation":"祖母のバナゴの詰め物料理のレシピはとても美味しいです。","type":"noun","meaning_category":"fish"}]}