{"word":"plebiscite-based","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"国民投票に基づく、住民投票に基づく","english_definition":"Based on or derived from a plebiscite (a vote by the entire electorate of a country or district on a specific issue).","examples":[{"sentence":"The government's legitimacy was plebiscite-based, following the overwhelming support in the national vote.","translation":"政府の正当性は、国民投票での圧倒的な支持を受けた国民投票に基づいていた。"},{"sentence":"The proposed changes to the constitution are intended to be plebiscite-based, ensuring public approval.","translation":"憲法改正案は、国民の承認を確実にするために、国民投票に基づくものとする予定である。"}],"collocations":["plebiscite-based decision","plebiscite-based legitimacy","plebiscite-based policy"],"synonyms":["referendum-based","vote-based","ballot-based"],"antonyms":["dictatorial","imposed","unilateral"]}],"etymology":{"value":"Combination of 'plebiscite' (from Latin 'plebiscitum', meaning 'decree of the common people') and 'based' (meaning having a foundation or support).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplebɪsaɪt ˈbeɪst/","syllables":"pleb-i-site-based"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Plebiscite-based' describes something that is founded on or gets its authority from a plebiscite. A plebiscite is a direct vote by eligible voters on a specific question or proposal. This term is often used in political or legal contexts to emphasize that a decision or policy has popular support.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plebiscite-based was successful.","correct":"✓ The plebiscite-based decision was successful.","note":"'Plebiscite-based' is an adjective and needs to modify a noun. It cannot stand alone as the subject of a sentence."},{"incorrect":"✗ The decision was plebiscite.","correct":"✓ The decision was plebiscite-based.","note":"'Plebiscite' is a noun. To use it as an adjective describing the origin of something, use 'plebiscite-based'."}],"priority":"★☆☆"},"related_words":{"derivatives":["plebiscite","based"],"phrasal_verbs":[],"related_terms":["referendum","election","vote","ballot","popular vote"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plebiscite-based' is a compound adjective indicating that something is founded on or derived from a plebiscite, which is a direct vote by the entire electorate on a specific issue. This term is typically used in political and legal contexts to describe decisions, policies, or legitimacy that originate from popular approval through a plebiscite. Understanding the term requires familiarity with the concept of a plebiscite and its role in democratic processes."},"example_sentences":[{"sentence":"The new law is plebiscite-based, reflecting the will of the people.","translation":"新しい法律は国民投票に基づいており、国民の意思を反映している。","type":"adjective","meaning_category":"国民投票に基づく"},{"sentence":"The government claimed its legitimacy was plebiscite-based after the controversial vote.","translation":"政府は物議を醸した投票の後、その正当性が国民投票に基づいていると主張した。","type":"adjective","meaning_category":"国民投票に基づく"}]}