{"word":"nonrateably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"比例的にではなく、均等に評価または分配されない方法で","english_definition":"In a manner that is not proportional; in a way that is not evenly assessed or distributed.","examples":[{"sentence":"The costs were allocated nonrateably among the departments, based on their specific needs.","translation":"コストは、各部門の特定のニーズに基づいて、比例的にではなく部門間で割り当てられました。"},{"sentence":"The tax burden falls nonrateably on different income groups.","translation":"税負担は、所得層によって比例的にではなく異なります。"}],"collocations":["allocate nonrateably","distribute nonrateably","burden falls nonrateably"],"synonyms":["disproportionately","unevenly","inequitably"],"antonyms":["rateably","proportionately","equitably"]}],"etymology":{"value":"'non-' (否定) + 'rateably' (比例的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈreɪtəbli/","syllables":"non-rate-a-bly"},"inflection":{"notes":"This is an adverb and does not inflect."},"usage_notes":{"explanation":"The word 'nonrateably' describes actions or distributions that are not based on a proportional or even assessment. It implies an uneven or disproportionate allocation based on specific criteria or needs rather than a uniform rate. It is often used in financial, economic, or statistical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The funds were distributed nonrateably, making sure everyone got the same amount.","correct":"✓ The funds were distributed nonrateably, ensuring that those with greater need received more.","note":"'Nonrateably' implies an uneven distribution, so it contradicts the idea of everyone receiving the same amount. The corrected sentence reflects a distribution based on need rather than equality."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonrateable (adjective)"],"related_terms":["rateable","proportionate","disproportionate"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonrateably' is a technical term indicating that something is not distributed or assessed proportionally. It is primarily used in formal contexts such as finance, economics, or statistics to describe uneven allocations based on specific criteria rather than uniform rates. Understanding this term requires a strong grasp of proportional reasoning and formal vocabulary."},"example_sentences":[{"sentence":"The grant money was distributed nonrateably to the schools, prioritizing those with the highest percentage of low-income students.","translation":"助成金は、低所得の生徒の割合が最も高い学校を優先して、比例的にではなく学校に分配されました。","type":"adverb","meaning_category":"disproportionate distribution"},{"sentence":"The risks associated with the project were nonrateably shared among the partners, reflecting their varying levels of involvement and expertise.","translation":"プロジェクトに関連するリスクは、パートナーの関与と専門知識のレベルに応じて、比例的にではなくパートナー間で共有されました。","type":"adverb","meaning_category":"uneven sharing"}]}