{"word":"protoarchitect","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who designs or plans buildings or structures in a rudimentary or early stage of architectural development; someone who precedes the formal establishment of architecture as a profession.","english_definition":"A person who designs or plans buildings or structures in a rudimentary or early stage of architectural development; someone who precedes the formal establishment of architecture as a profession.","examples":[{"sentence":"Imhotep, the Egyptian high priest, is often considered a protoarchitect for his design of the Step Pyramid of Djoser.","translation":"エジプトの神官であったイムホテプは、ジェゼル王の階段ピラミッドの設計者として、しばしば原始建築家とみなされる。"},{"sentence":"Before the formalization of architectural roles, master builders served as protoarchitects, combining design and construction expertise.","translation":"建築家の役割が形式化される前は、親方棟梁が設計と建設の専門知識を兼ね備えた原始建築家として機能していた。"}],"collocations":["early protoarchitect","historical protoarchitect","influential protoarchitect"],"synonyms":["master builder","early designer","pre-architectural planner"],"antonyms":["modern architect","contemporary architect","licensed architect"]}],"etymology":{"value":"The word is a combination of \"proto-\" (Greek for \"first\" or \"original\") and \"architect\" (from Greek \"arkhitekton,\" meaning \"master builder\"). It describes someone who performed the role of an architect before the profession was formally defined or established.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtoʊˈɑːrkɪtekt/","syllables":"pro-to-ar-chi-tect"},"inflection":{"noun_plural":"protoarchitects"},"usage_notes":{"explanation":"The term \"protoarchitect\" is used to describe individuals who designed buildings or structures in ancient times or before the formal establishment of architecture as a recognized profession. These individuals often combined the roles of designer, engineer, and builder. The term is not commonly used in everyday conversation but is more frequently found in historical or academic contexts when discussing the history of architecture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a proto-architect of the company's new software.","correct":"✓ He is a pioneer of the company's new software.","note":"The term 'protoarchitect' is specific to the field of architecture and should not be used metaphorically in other contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["protoarchitecture (noun): The early or rudimentary stages of architectural development."],"related_terms":["architect","architecture","builder","engineer","master builder"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in academic or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"protoarchitect\" refers to someone who designed buildings or structures before architecture became a formal profession. Think of individuals in ancient civilizations who planned and oversaw the construction of temples, pyramids, or other significant structures. They were essentially architects before the title and profession were officially recognized. This term is mainly used in historical or academic discussions about the origins of architecture."},"example_sentences":[{"sentence":"The pyramids of Egypt were designed by protoarchitects who combined engineering and artistic skills.","translation":"エジプトのピラミッドは、エンジニアリングと芸術的スキルを兼ね備えた原始建築家によって設計されました。","type":"noun","meaning_category":"historical design"},{"sentence":"Early protoarchitects often relied on intuition and experience rather than formal training.","translation":"初期の原始建築家は、正式な訓練ではなく、直感と経験に頼ることが多かった。","type":"noun","meaning_category":"early architectural roles"}]}