{"word":"campaigners","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"運動家、キャンペーン参加者、提唱者","english_definition":"people who actively promote or strive for a particular cause or objective, typically in a political or social sphere.","examples":[{"sentence":"Environmental campaigners are protesting against the new highway.","translation":"環境保護運動家たちは新しい高速道路に抗議している。"},{"sentence":"Animal rights campaigners are calling for an end to factory farming.","translation":"動物愛護運動家たちは工場畜産の廃止を求めている。"},{"sentence":"The group of campaigners organized a rally to raise awareness about the issue.","translation":"その運動家グループは、問題に対する意識を高めるために集会を企画した。"}],"collocations":["political campaigners (政治運動家)","environmental campaigners (環境運動家)","animal rights campaigners (動物愛護運動家)","health campaigners (健康運動家)","campaigners for social justice (社会正義のための運動家)","lead campaigners (主要な運動家)"],"synonyms":["activists","advocates","promoters","supporters","crusaders","proponents","fighters","champions"],"antonyms":["opponents","detractors","critics"]}],"etymology":{"value":"The word 'campaigner' is derived from 'campaign,' which originally referred to a military operation in the field. The suffix '-er' is added to denote a person involved in or associated with a campaign. The meaning has broadened to include any organized effort to achieve a specific goal, especially in a political or social context.","priority":"★★☆"},"pronunciation":{"ipa":"/kæmˈpeɪnərz/","syllables":"cam-paign-ers"},"inflection":{"noun_plural":"campaigners"},"usage_notes":{"explanation":"'Campaigners' refers to individuals who are actively involved in promoting or advocating for a specific cause, often with the aim of influencing public opinion or policy. They typically engage in organized activities such as protests, rallies, lobbying, and public awareness campaigns. The term is often used in the context of political, social, or environmental issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The campaigner is campaign for the new law.","correct":"✓ The campaigner is campaigning for the new law.","note":"'Campaign' as a verb requires the '-ing' form to indicate continuous action in the present tense. Alternatively, 'The campaigner is advocating for the new law' is also correct."},{"incorrect":"✗ Campaigners is important for social change.","correct":"✓ Campaigners are important for social change.","note":"'Campaigners' is a plural noun and requires a plural verb ('are')."},{"incorrect":"✗ He is a good campaign.","correct":"✓ He is a good campaigner.","note":"'Campaign' is a noun referring to the organized effort, while 'campaigner' refers to the person involved in the effort."}],"priority":"★★☆"},"related_words":{"derivatives":["campaign (noun, verb)","campaigning (noun, adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in news and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'campaigners' refers to people who actively work to promote a cause, often political or social. It implies organized and sustained effort to achieve a specific goal. The word is commonly used in news reports and discussions about activism and social change. Understanding the word requires familiarity with the concept of campaigns and activism."},"example_sentences":[{"sentence":"The **campaigners** marched through the city center to protest the government's policies.","translation":"運動家たちは政府の政策に抗議するため、市内中心部をデモ行進した。","type":"noun","meaning_category":"運動家"},{"sentence":"A group of dedicated **campaigners** worked tirelessly to raise awareness about climate change.","translation":"献身的な運動家グループが、気候変動に対する意識を高めるために精力的に活動した。","type":"noun","meaning_category":"運動家"},{"sentence":"The **campaigners** are calling for stricter regulations on pollution.","translation":"運動家たちは、汚染に対するより厳しい規制を求めている。","type":"noun","meaning_category":"運動家"}]}