{"word":"Turkophobe","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トルコ嫌悪者、反トルコ主義者","english_definition":"A person who has a fear of or hatred toward Turks, Turkish culture, or Turkey.","examples":[{"sentence":"He was labeled a Turkophobe after making disparaging remarks about Turkish history.","translation":"彼はトルコの歴史について軽蔑的な発言をした後、トルコ嫌悪者というレッテルを貼られた。"},{"sentence":"The article accused the politician of being a Turkophobe due to his stance on Turkish immigration.","translation":"その記事は、政治家のトルコ移民に対する姿勢から、彼をトルコ嫌悪者だと非難した。"}],"collocations":["anti-Turkish sentiment","Turkish discrimination","xenophobia"],"synonyms":["anti-Turk","Turkophobist"],"antonyms":["Turkophile"]},{"part_of_speech":"adjective","definition":"トルコ嫌悪の、反トルコ主義の","english_definition":"Having a fear of or hatred toward Turks, Turkish culture, or Turkey.","examples":[{"sentence":"The Turkophobic comments sparked outrage on social media.","translation":"そのトルコ嫌悪的なコメントは、ソーシャルメディアで怒りを引き起こした。"},{"sentence":"Some historians argue that certain policies were motivated by Turkophobic sentiments.","translation":"一部の歴史家は、特定の政策がトルコ嫌悪的な感情によって動機づけられたと主張している。"}],"collocations":["Turkophobic rhetoric","Turkophobic attacks","Turkophobic propaganda"],"synonyms":["anti-Turkish"],"antonyms":["Turkophilic"]}],"etymology":{"value":"Derived from \"Turko-\" (referring to Turks or Turkey) and \"-phobe\" (from Greek \"phobos\" meaning fear).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrkəfoʊb/","syllables":"Tur-ko-phobe"},"inflection":{"noun_plural":"Turkophobes","adjective_forms":{}},"usage_notes":{"explanation":"The term \"Turkophobe\" and \"Turkophobia\" are used to describe the fear, hatred, or prejudice against Turks, Turkish culture, or Turkey. It is important to use this term carefully and accurately, as it can be a sensitive topic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Turkophobe because he doesn't like kebab.","correct":"✓ He dislikes kebab, but that doesn't make him a Turkophobe.","note":"Disliking Turkish food does not automatically make someone a Turkophobe. Turkophobia implies a deeper prejudice or hatred toward Turks and Turkish culture."}],"priority":"★★☆"},"related_words":{"derivatives":["Turkophobia (noun: fear or hatred of Turks)"],"phrases":["anti-Turkish sentiment","xenophobia"],"related_terms":["Islamophobia","xenophobia","racism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Turkophobe\" refers to someone who dislikes or hates Turks, Turkish culture, or Turkey. It's a term used to describe prejudice or animosity toward Turkish people and their culture. This word is not commonly used in everyday conversation and is more often found in discussions about prejudice, discrimination, or historical analysis."},"example_sentences":[{"sentence":"The organization condemned the Turkophobic remarks made by the public figure.","translation":"その組織は、著名人が行ったトルコ嫌悪的な発言を非難した。","type":"adjective","meaning_category":"トルコ嫌悪の"},{"sentence":"He was accused of being a Turkophobe due to his controversial statements about Turkish politics.","translation":"彼はトルコの政治に関する物議を醸す発言のために、トルコ嫌悪者だと非難された。","type":"noun","meaning_category":"トルコ嫌悪者"}]}