{"word":"flashforwards","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物語における)フラッシュフォワード、未来の場面の挿入","english_definition":"Scenes in a movie, television show, novel, etc., that take the story forward in time from the present.","examples":[{"sentence":"The novel uses flashforwards to hint at the protagonist's eventual fate.","translation":"その小説は、主人公の最終的な運命をほのめかすためにフラッシュフォワードを使用している。"},{"sentence":"The TV series is known for its use of both flashbacks and flashforwards.","translation":"そのテレビシリーズは、フラッシュバックとフラッシュフォワードの両方を使用することで知られている。"}],"collocations":["use flashforwards","include flashforwards","a series of flashforwards"],"synonyms":["future scenes","prolepsis"],"antonyms":["flashbacks"]},{"part_of_speech":"noun","definition":"(まれ)未来の出来事の短い、鮮明なイメージ","english_definition":"A brief, vivid mental image of a future event.","examples":[{"sentence":"He experienced flashforwards of the accident before it happened.","translation":"彼は事故が起こる前に、その事故のフラッシュフォワードを経験した。"}],"collocations":["experience flashforwards","have flashforwards","sudden flashforwards"],"synonyms":["premonitions","visions of the future","precognitive visions"],"antonyms":[]}],"etymology":{"value":"The word is formed by analogy with \"flashback.\" It combines \"flash,\" suggesting a brief, sudden glimpse, with \"forward,\" indicating movement ahead in time.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflæʃˌfɔrwərdz/","syllables":"flash-for-wards"},"inflection":{"noun_plural":"flashforwards"},"usage_notes":{"explanation":"\"Flashforwards\" are primarily used in narrative contexts to disrupt the chronological order of a story, offering glimpses into the future. This technique can create suspense, foreshadow events, or provide insight into a character's motivations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was full of flashbackforwards.","correct":"✓ The movie was full of flashbacks and flashforwards.","note":"\"Flashbackforwards\" is not a standard term. Use \"flashbacks and flashforwards\" to refer to both techniques."}],"priority":"★☆☆"},"related_words":{"derivatives":["flashforward (singular noun)","flashback"],"related_terms":["foreshadowing","prolepsis","nonlinear narrative"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in discussions of narrative techniques.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"flashforwards\" refers to a narrative technique where scenes from the future are inserted into the present timeline of a story. This is often used in literature, film, and television to create suspense or provide insight into future events. The concept is analogous to \"flashbacks,\" which show scenes from the past. Understanding this term requires familiarity with narrative structures and literary devices."},"example_sentences":[{"sentence":"The author used **flashforwards** to create a sense of unease in the reader.","translation":"作者は読者に不安感を与えるためにフラッシュフォワードを使用した。","type":"noun","meaning_category":"Narrative technique"},{"sentence":"The character kept having **flashforwards** of a car crash.","translation":"そのキャラクターは車の衝突事故のフラッシュフォワードを繰り返し見ていた。","type":"noun","meaning_category":"Mental image"}]}