{"word":"downburst","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ダウンバースト（積乱雲から発生する強い下降気流で、地表に衝突して四方八方に広がる現象）","english_definition":"A localized column of sinking air within a thunderstorm, usually less than 2.5 miles in diameter, that leads to an outward burst of damaging winds at the surface.","examples":[{"sentence":"The downburst caused significant damage to the trees in the area.","translation":"ダウンバーストはその地域の木々に大きな被害をもたらした。"},{"sentence":"Meteorologists are tracking the storm system for potential downburst activity.","translation":"気象学者は、ダウンバーストが発生する可能性のある嵐のシステムを追跡している。"},{"sentence":"The airport experienced a sudden downburst, causing flight delays.","translation":"空港では突然のダウンバーストが発生し、フライトの遅延を引き起こした。"}],"collocations":["microburst","macroburst","wet downburst","dry downburst","downburst wind","downburst damage"],"synonyms":["wind shear","microburst","macroburst"],"antonyms":["updraft","thermal","rising air"],"related_words":["thunderstorm","wind","gust","meteorology","atmosphere","convection"],"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency"},"usage_notes":{"explanation":"A downburst is a severe weather phenomenon characterized by a localized column of rapidly descending air within a thunderstorm. When this air hits the surface, it spreads out horizontally, causing strong, damaging winds. Downbursts are classified as either microbursts (smaller area, shorter duration) or macrobursts (larger area, longer duration). They can be either wet (accompanied by heavy rain) or dry (with little or no precipitation).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The downpour caused a downburst.","correct":"The downburst caused a downpour. / The downburst was accompanied by a downpour.","note":"A downburst is a phenomenon of strong winds, while a downpour is heavy rain. They can occur together, but one doesn't cause the other directly."},{"incorrect":"Downbursts are always visible.","correct":"Downbursts are not always visible.","note":"Downbursts are often invisible, making them difficult to predict and detect. The effects, such as wind damage, are usually the first indication."}],"priority":"★★☆"},"etymology":{"value":"The term 'downburst' was coined by meteorologist Dr. Tetsuya Theodore Fujita in the 1970s to describe localized, strong downdrafts in thunderstorms. It combines 'down' (referring to the downward motion of air) and 'burst' (referring to the sudden outward spread of air at the surface).","priority":"★★☆"},"pronunciation":{"ipa":"ˈdaʊnˌbɜːrst","syllables":"down-burst"},"inflection":{"notes":"Plural form: downbursts"},"example_sentences":[{"sentence":"The sudden **downburst** flipped over several small planes at the airfield.","translation":"突然のダウンバーストにより、飛行場の小型飛行機が数機ひっくり返った。","type":"noun","meaning_category":"気象現象"},{"sentence":"The damage from the **downburst** was initially mistaken for tornado damage.","translation":"ダウンバーストによる被害は、当初竜巻による被害と間違えられた。","type":"noun","meaning_category":"気象現象"},{"sentence":"The weather service issued a warning for possible **downburst** activity in the region.","translation":"気象当局は、その地域でダウンバーストが発生する可能性があるとして警報を発令した。","type":"noun","meaning_category":"気象現象"}]}],"related_words":{"derivatives":[],"phrasal_verbs":[]}}