{"word":"Actinography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"光線写真法、光線記録法","english_definition":"A photographic process for recording the intensity of radiation, especially ultraviolet radiation.","examples":[{"sentence":"Actinography was used to measure the amount of sunlight in different locations.","translation":"光線写真法は、さまざまな場所での日光の量を測定するために使用されました。"},{"sentence":"The actinography results showed a high level of ultraviolet radiation.","translation":"光線記録法の結果は、高レベルの紫外線放射を示しました。"}],"collocations":["ultraviolet actinography","solar actinography"],"synonyms":["radiometry","photometry"],"antonyms":[]}],"etymology":{"value":"Derived from 'actino-' (combining form of 'aktis' meaning ray) + '-graphy' (process of recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæktɪˈnɒɡrəfi/","syllables":"Ac-ti-nog-ra-phy"},"inflection":{"noun_plural":"actinographies"},"usage_notes":{"explanation":"Actinography is a scientific technique primarily used in the fields of meteorology, climatology, and photochemistry. It involves the use of specialized photographic materials to quantify the intensity of specific types of radiation, particularly ultraviolet (UV) light. The term is relatively specialized and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Actinography is used to record sound waves.","correct":"✓ Actinography is used to record light intensity.","note":"Actinography specifically measures light intensity, not sound waves. Sound recording is phonography or audio recording."},{"incorrect":"✗ Actinography is a type of telescope.","correct":"✓ Actinography is a photographic process.","note":"Actinography is a photographic process, not a type of telescope."}],"priority":"★☆☆"},"related_words":{"derivatives":["actinogram","actinograph"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Actinography is a highly specialized term used in scientific contexts, particularly in fields like meteorology and photochemistry. It refers to the process of measuring and recording the intensity of radiation, especially ultraviolet radiation, using photographic methods. Due to its technical nature, it is not commonly encountered outside of scientific literature and discussions. Understanding requires familiarity with scientific terminology and concepts related to radiation measurement. "},"example_sentences":[{"sentence":"The study employed actinography to assess UV radiation levels at different altitudes.","translation":"その研究では、異なる高度での紫外線放射レベルを評価するために光線写真法を採用しました。","type":"general","meaning_category":"measurement of radiation"},{"sentence":"Early actinography techniques relied on chemical reactions induced by light.","translation":"初期の光線記録法技術は、光によって誘発される化学反応に依存していました。","type":"historical","meaning_category":"historical context"}]}