{"word":"eye-charmed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare, archaic) captivated or fascinated by the eyes; bewitched by a gaze.","english_definition":"(rare, archaic) Captivated or fascinated by someone's eyes; bewitched or enchanted by a gaze. Often implies a sense of being under a spell or strongly attracted.","examples":[{"sentence":"The knight stood, eye-charmed by the sorceress's emerald gaze.","translation":"騎士は、魔法使いの翠玉のまなざしに魅せられ、立ち尽くした。"},{"sentence":"He remained eye-charmed, unable to look away from her mesmerizing eyes.","translation":"彼は魅惑的な彼女の瞳から目を離すことができず、魅了されたままだった。"}],"collocations":["eye-charmed by","eye-charmed gaze","eye-charmed expression"],"synonyms":["captivated","fascinated","bewitched","enchanted","mesmerized","spellbound"],"antonyms":["uninterested","repulsed","disgusted","indifferent"]}],"etymology":{"value":"Likely a compound word formed from 'eye' and 'charmed'. 'Charmed' implies being under a spell or strongly attracted, and when combined with 'eye', it suggests that the attraction or spell is initiated or focused through the eyes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪˌtʃɑːrmd/","syllables":"eye-charmed"},"inflection":{"notes":"This word is primarily used as an adjective and does not typically have other inflections."},"usage_notes":{"explanation":"'Eye-charmed' is a rare and somewhat archaic term, primarily found in literature or poetry aiming for a heightened, romantic, or fantastical tone. It describes a state of being deeply captivated or bewitched by someone's eyes, suggesting a powerful and almost magical attraction. It is not commonly used in modern, everyday English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was eye-charmed of the movie.","correct":"✓ He was eye-charmed by her beauty.","note":"'Eye-charmed' typically refers to being captivated by someone's eyes or gaze, not by inanimate objects or general concepts. It is usually followed by 'by' and the object of attraction (e.g., 'by her eyes')."},{"incorrect":"✗ She eye-charmed him.","correct":"✓ He was eye-charmed by her.","note":"'Eye-charmed' is generally used as an adjective to describe the state of being captivated, rather than as a verb to describe the act of captivating. The correct usage is to say someone 'was eye-charmed' rather than 'eye-charmed' someone else."}],"priority":"★☆☆"},"related_words":{"derivatives":["charm (noun, verb)","charming (adjective)","enchant (verb)","enchanted (adjective)","bewitch (verb)","bewitched (adjective)"],"idioms_phrases":["None directly related, but similar concepts exist in phrases like 'love at first sight' or 'under someone's spell'."],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - This term is very rare and not commonly found in modern texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eye-charmed' is a highly literary and archaic term, rarely encountered in contemporary English. Its meaning is relatively straightforward, combining the concepts of 'eye' and 'charmed' to suggest being captivated or bewitched by someone's gaze. However, its infrequent usage and somewhat old-fashioned tone make it more suitable for advanced readers familiar with classical literature or poetry. Understanding its connotations requires a grasp of the nuances of 'charm' and its association with enchantment or magic."},"example_sentences":[{"sentence":"The young poet was eye-charmed by the muse's ethereal beauty.","translation":"若い詩人は、ミューズのこの世のものとは思えない美しさに魅了された。","type":"adjective","meaning_category":"captivated"},{"sentence":"Lost in the forest, he became eye-charmed by the strange, glowing eyes of the creature.","translation":"森の中で迷子になった彼は、その生き物の奇妙で光る瞳に魅せられた。","type":"adjective","meaning_category":"bewitched"},{"sentence":"She found herself eye-charmed by his intense and unwavering gaze.","translation":"彼女は彼の強烈で揺るぎない視線に、自分が魅了されていることに気づいた。","type":"adjective","meaning_category":"fascinated"}]}