{"word":"Withdrawment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"引き出し、撤回、取り下げ、離脱、禁断症状","english_definition":"The act of taking something away or back; the process of ceasing to take an addictive drug; the symptoms caused by ceasing to take an addictive drug.","examples":[{"sentence":"The bank teller processed my withdrawal.","translation":"銀行の窓口係は私の引き出し処理をした。"},{"sentence":"The company announced the withdrawal of its product from the market.","translation":"会社は市場からの製品の撤回を発表した。"},{"sentence":"He experienced severe withdrawal symptoms when he stopped taking the medication.","translation":"彼は薬の服用を止めたときに重度の禁断症状を経験した。"},{"sentence":"The country's withdrawal from the treaty caused international concern.","translation":"その国の条約からの離脱は国際的な懸念を引き起こした。"}],"collocations":["bank withdrawal (銀行からの引き出し)","cash withdrawal (現金の引き出し)","product withdrawal (製品の撤回)","treaty withdrawal (条約からの離脱)","drug withdrawal (薬物からの離脱)","withdrawal symptoms (禁断症状)"],"synonyms":["removal","extraction","retraction","revocation","departure","retreat","abstinence"],"antonyms":["deposit","addition","insertion","submission","accession","continuation"]}],"etymology":{"value":"The word \"withdrawal\" is derived from \"withdraw,\" which comes from Middle English \"withdrawen,\" meaning \"to draw back or away.\" It is composed of \"with-\" (meaning \"back\" or \"away\") and \"draw\" (meaning \"to pull or move\").","priority":"★★☆"},"pronunciation":{"ipa":"/wɪðˈdrɔːmənt/","syllables":"with-draw-ment"},"inflection":{"noun_plural":"withdrawments"},"usage_notes":{"explanation":"\"Withdrawal\" is a noun that can refer to several different actions or states. It commonly refers to the act of taking money out of a bank account. It can also refer to the act of removing or retracting something, such as a product from the market or a statement. In the context of addiction, \"withdrawal\" refers to the process of stopping the use of a substance and the associated symptoms. It can also describe the act of a country or organization leaving a group or treaty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a withdraw from the ATM.","correct":"✓ He made a withdrawal from the ATM.","note":"\"Withdraw\" is the verb, while \"withdrawal\" is the noun. Make sure to use the correct form depending on the context."},{"incorrect":"✗ The withdraw symptoms were unbearable.","correct":"✓ The withdrawal symptoms were unbearable.","note":"Again, use the noun form \"withdrawal\" when referring to the symptoms."}],"priority":"★★☆"},"related_words":{"derivatives":["withdraw (verb)","withdrawing (adjective)"],"phrasal_verbs":["withdraw from (verb phrase: to remove oneself from something)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (finance, medicine, politics).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"withdrawal\" has multiple meanings, making it a somewhat complex term. In finance, it refers to taking money out of an account. In a broader sense, it means retracting or removing something, like a statement or a product. Medically, it describes the process and symptoms of stopping an addictive substance. The specific meaning is usually clear from the context, but understanding the different uses is important for comprehension.","priority":"★☆☆"},"example_sentences":[{"sentence":"She made a large cash withdrawal from her savings account.","translation":"彼女は貯蓄口座から多額の現金を引き出した。","type":"noun","meaning_category":"引き出し (finance)"},{"sentence":"The politician announced the withdrawal of his controversial statement.","translation":"政治家は物議を醸した発言の撤回を発表した。","type":"noun","meaning_category":"撤回 (retraction)"},{"sentence":"He suffered from severe withdrawal symptoms after quitting alcohol.","translation":"彼はアルコールをやめた後、重度の禁断症状に苦しんだ。","type":"noun","meaning_category":"禁断症状 (medicine)"},{"sentence":"The country's withdrawal from the international agreement surprised many.","translation":"その国の国際協定からの離脱は多くの人を驚かせた。","type":"noun","meaning_category":"離脱 (politics)"}]}