{"word":"citators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)判例引用索引、法律文献引用索引","english_definition":"A tool used in legal research to track the history and treatment of a case or statute by other cases and legal materials.","examples":[{"sentence":"Use citators to ensure that the case you are relying on is still good law.","translation":"依拠している判例が有効であることを確認するために、判例引用索引を使用してください。"},{"sentence":"Citators can help you find cases that have interpreted a particular statute.","translation":"法律文献引用索引は、特定の法律を解釈した判例を見つけるのに役立ちます。"}],"collocations":["legal citator","online citator","case citator","statute citator"],"synonyms":["legal index","case tracker","Shepard's Citations","KeyCite"],"antonyms":[]}],"etymology":{"value":"Derived from 'cite,' indicating a tool that helps track citations of legal cases and statutes.","priority":"★★★"},"pronunciation":{"ipa":"ˈsaɪteɪtərz","syllables":"ci-ta-tors"},"inflection":{"noun_plural":"citators"},"usage_notes":{"explanation":"Citators are essential tools for legal research, providing information on the subsequent history of a case or statute. They show whether a case has been affirmed, reversed, overruled, or otherwise affected by later decisions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a citation to find the case.","correct":"✓ I used a citator to find the case.","note":"A 'citation' is the reference to a legal source, while a 'citator' is the tool used to track the history of that source."}],"priority":"★★☆"},"related_words":{"derivatives":["cite","citation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Citators' are specialized legal tools that track how cases and statutes have been treated in subsequent legal decisions. They are essential for legal professionals to ensure the validity and precedential value of legal authorities.","example_sentences":[]},"example_sentences":[{"sentence":"Legal researchers rely on **citators** to verify the current status of case law.","translation":"法律研究者は、判例の現在の状況を確認するために判例引用索引に頼っています。","type":"noun","meaning_category":"legal research tool"}]}