{"word":"thermopolypneic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(獣医学)体温調節のために呼吸数が増加している状態。特に、犬などの動物が体温を下げるために行う速く浅い呼吸を指す。","english_definition":"(veterinary medicine) Exhibiting thermopolypnea; characterized by an increased respiratory rate as a mechanism for thermoregulation, particularly the rapid, shallow breathing seen in animals like dogs to dissipate heat.","examples":[{"sentence":"The dog became thermopolypneic after running in the hot sun.","translation":"その犬は暑い日差しの中で走った後、体温調節のために呼吸が速くなった。"},{"sentence":"Thermopolypneic respiration is a common sign of overheating in canines.","translation":"体温調節のための多呼吸は、犬がオーバーヒートしている一般的な兆候である。"}],"collocations":["thermopolypneic respiration","thermopolypneic response","become thermopolypneic"],"synonyms":["panting","tachypneic (related, but more general term for rapid breathing)"],"antonyms":["bradypneic (abnormally slow breathing)","normal respiration"]},{"part_of_speech":"adjective","definition":"(一般)体温調節のために呼吸数が増加している状態。","english_definition":"(general) Exhibiting an increased respiratory rate as a mechanism for thermoregulation.","examples":[{"sentence":"During exercise, the athlete became thermopolypneic to maintain a stable body temperature.","translation":"運動中、アスリートは体温を安定させるために呼吸数が増加した。"}],"collocations":["thermopolypneic respiration","thermopolypneic response"],"synonyms":["hyperpneic (related, but refers to increased depth and rate of breathing)"],"antonyms":["hypopneic (abnormally shallow breathing)","normal respiration"]}],"etymology":{"value":"Derived from the Greek words 'thermo-' (heat), 'poly-' (many, much), and 'pneo' (to breathe).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɜːrmoʊˌpɒlɪpˈniːɪk/","syllables":"ther-mo-pol-yp-ne-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Thermopolypneic' is a technical term primarily used in veterinary medicine and physiology to describe the specific type of rapid, shallow breathing employed by some animals, particularly dogs, to cool themselves down. It's less commonly used in general contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog was thermopolypneic because it was scared.","correct":"✓ The dog was panting because it was scared. / ✓ The dog was thermopolypneic because it was overheated.","note":"Thermopolypnea is specifically related to thermoregulation, not general anxiety or fear. Panting can be a symptom of both, but 'thermopolypneic' should only be used when heat dissipation is the primary cause."}],"priority":"★☆☆"},"related_words":{"derivatives":["thermopolypnea (noun: the condition of being thermopolypneic)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Technical/Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Thermopolypneic' is a highly specialized term used in veterinary medicine and physiology. It describes the state of an animal exhibiting rapid, shallow breathing as a means of regulating its body temperature. This is most commonly observed in dogs. Due to its technical nature, it is not part of everyday vocabulary."},"example_sentences":[{"sentence":"The veterinarian noted that the dog was thermopolypneic and recommended immediate cooling measures.","translation":"獣医は、その犬が体温調節のために呼吸数が増加している状態であることに気づき、直ちに冷却措置を講じるよう勧めた。","type":"adjective","meaning_category":"体温調節のための呼吸数増加"},{"sentence":"Measuring the thermopolypneic rate can help assess the severity of heatstroke in animals.","translation":"体温調節のための呼吸数増加率を測定することで、動物の熱中症の重症度を評価するのに役立つ。","type":"adjective","meaning_category":"体温調節のための呼吸数増加"}]}