{"word":"preeligibly","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"In a manner that meets the requirements or conditions necessary to be considered eligible beforehand.","english_definition":"In a way that fulfills the necessary prerequisites or conditions for eligibility in advance.","examples":[{"sentence":"The candidates were preeligibly screened to ensure they met the basic qualifications before the formal application process.","translation":"候補者は、正式な応募手続きの前に、基本的な資格を満たしていることを確認するために、事前に適格性が審査されました。"},{"sentence":"The software automatically checks if the data is preeligibly formatted before processing it.","translation":"ソフトウェアは、データを処理する前に、データが事前に適格な形式でフォーマットされているかどうかを自動的にチェックします。"}],"collocations":["preeligibly screened","preeligibly formatted","preeligibly assessed"],"synonyms":["qualifyingly","preliminarily","conditionally"],"antonyms":["ineligibly","disqualifyingly"]}],"etymology":{"value":"Formed by adding the suffix '-ly' to the adjective 'preeligible,' which itself is derived from 'pre-' (before) and 'eligible' (qualified).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpriːˈɛlɪdʒɪbli/","syllables":"pree-el-i-gi-bly"},"inflection":{"notes":"Adverbs do not typically inflect. This word maintains the same form."},"usage_notes":{"explanation":"'Preeligibly' is used to describe actions or processes that ensure eligibility is met before a subsequent step or formal evaluation. It emphasizes the proactive nature of verifying qualifications or conditions. This word is relatively uncommon and mostly found in formal or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The application was preeligibly, so it was accepted.","correct":"✓ The application was preeligible, so it was accepted.","note":"'Preeligibly' is an adverb and should modify a verb or adjective, not stand alone as a predicate adjective. Use 'preeligible' as the adjective in this context."},{"incorrect":"✗ He preeligibly the requirements.","correct":"✓ He preeligibly met the requirements.","note":"The adverb 'preeligibly' should modify a verb that describes how the requirements were met, not the verb 'to be' itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["preeligible (adjective)","eligibly (adverb)","eligibility (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preeligibly' is a relatively rare adverb. It describes something done in a manner that meets the requirements for eligibility in advance. It's often used in formal or technical contexts where verifying qualifications beforehand is important. Understanding the base words 'pre-' (before) and 'eligible' (qualified) helps in grasping its meaning."},"example_sentences":[{"sentence":"The data was preeligibly validated to ensure compliance with the required standards.","translation":"データは、必要な基準への準拠を保証するために、事前に適格性が検証されました。","type":"adverb","meaning_category":"Qualifying in advance"},{"sentence":"The documents were preeligibly reviewed to expedite the approval process.","translation":"承認プロセスを迅速化するために、書類は事前に適格性が確認されました。","type":"adverb","meaning_category":"Meeting conditions beforehand"}]}