{"word":"insurrectionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"武装蜂起主義、反乱主義","english_definition":"A political theory or practice advocating or promoting insurrection or rebellion against an established civil authority or government.","examples":[{"sentence":"Insurrectionism is a dangerous ideology that can lead to violence and instability.","translation":"武装蜂起主義は、暴力と不安定につながる危険なイデオロギーです。"},{"sentence":"The group's rhetoric was characterized by insurrectionism and calls for revolution.","translation":"そのグループのレトリックは、武装蜂起主義と革命の呼びかけによって特徴づけられていました。"}],"collocations":["armed insurrectionism","revolutionary insurrectionism","promote insurrectionism","advocate insurrectionism"],"synonyms":["rebellion","revolution","uprising","sedition","mutiny"],"antonyms":["pacifism","submission","obedience","conformity"]}],"etymology":{"value":"'Insurrection' + '-ism'. 'Insurrection' comes from Latin 'insurrectio', from 'insurgere' meaning 'to rise up, rebel'. The '-ism' suffix denotes a doctrine, principle, or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnsəˈrɛkʃənɪzəm/","syllables":"in-sur-rec-tion-ism"},"inflection":{"noun_plural":"insurrectionisms (rarely used)"},"usage_notes":{"explanation":"Insurrectionism is a political ideology that advocates for the use of armed rebellion or insurrection to overthrow an established government or authority. It is often associated with radical or extremist groups and is considered a serious threat to social order and stability. The term is typically used in political science, history, and legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supported insurrection, but not insurrectionism.","correct":"✓ He supported insurrection, which is a form of insurrectionism.","note":"Insurrection is the act of rebelling, while insurrectionism is the ideology or advocacy of such acts. They are closely related, but insurrectionism is the broader concept."}],"priority":"★★☆"},"related_words":{"derivatives":["insurrectionist (noun/adjective: a person who advocates or participates in insurrection)","insurrectionary (adjective: relating to or characteristic of insurrection)"],"phrasal_verbs":[],"related_concepts":["anarchism","terrorism","political violence","coup d'état","revolution"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Insurrectionism' is a complex term referring to the political belief that armed rebellion is a valid or necessary way to change a government. It's not a common word, and you'll usually find it in discussions about politics, history, or law, especially when talking about groups that want to overthrow the government by force. It's important to understand that it's a specific ideology, not just any act of rebellion."},"example_sentences":[{"sentence":"The government accused the opposition party of promoting insurrectionism.","translation":"政府は野党が武装蜂起主義を推進していると非難した。","type":"general","meaning_category":"political ideology"},{"sentence":"Historians debate the role of insurrectionism in the French Revolution.","translation":"歴史家たちはフランス革命における武装蜂起主義の役割について議論している。","type":"historical","meaning_category":"historical context"},{"sentence":"The manifesto outlined a clear strategy for insurrectionism.","translation":"そのマニフェストは、武装蜂起主義のための明確な戦略を概説した。","type":"political","meaning_category":"political strategy"}]}