{"word":"angle-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"角度依存性のある、角度によって変化する","english_definition":"Varying or depending on the angle of observation or incidence.","examples":[{"sentence":"The color of the material is angle-dependent, appearing different from various viewpoints.","translation":"その材料の色は角度依存性があり、様々な視点から見ると異なって見える。"},{"sentence":"The reflectivity of the surface is angle-dependent, affecting the performance of the sensor.","translation":"表面の反射率は角度依存性があり、センサーの性能に影響を与える。"}],"collocations":["angle-dependent scattering (角度依存性散乱)","angle-dependent emission (角度依存性放射)","angle-dependent reflectance (角度依存性反射率)"],"synonyms":["angle-sensitive","direction-dependent"],"antonyms":["angle-independent"],"related_terms":["viewing angle","incidence angle","scattering angle"]}],"etymology":{"value":"Derived from the combination of 'angle' and 'dependent', indicating a relationship where a property or characteristic is contingent upon the angle.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈæŋɡəl dɪˈpɛndənt/","syllables":"an-gle-de-pen-dent"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Angle-dependent' describes a property or phenomenon that changes its characteristics based on the angle from which it is observed or measured. It is commonly used in physics, optics, materials science, and computer graphics.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The result is angle-depend.","correct":"The result is angle-dependent.","note":"'Angle-dependent' is an adjective and should end with '-ent'."}],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical or scientific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Angle-dependent' is a technical term used to describe something whose properties change depending on the angle from which it is viewed or measured. It is commonly used in scientific and engineering fields, such as optics, physics, and materials science. Understanding this term requires familiarity with scientific concepts and terminology."},"example_sentences":[{"sentence":"The intensity of the reflected light is angle-dependent.","translation":"反射光の強度は角度依存性がある。","type":"general","meaning_category":"general"},{"sentence":"The performance of the solar panel is affected by the angle-dependent incidence of sunlight.","translation":"太陽光パネルの性能は、太陽光の角度依存性の入射によって影響を受ける。","type":"technical","meaning_category":"technical"}]}