{"word":"Pantisocracy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パンティスクラシー：平等社会主義。特に、1794年にサミュエル・テイラー・コウルリッジとロバート・サウジーがアメリカ合衆国で創設しようとした理想的な共同体社会主義。","english_definition":"A form of utopian social organization in which all are equal and rule together; specifically, a scheme conceived in 1794 by Samuel Taylor Coleridge and Robert Southey for an ideal community in the United States based on common ownership and democratic principles.","examples":[{"sentence":"The young poets dreamed of establishing a Pantisocracy on the banks of the Susquehanna River.","translation":"若い詩人たちは、サスケハナ川のほとりにパンティスクラシーを設立することを夢見ていた。"},{"sentence":"Pantisocracy, though never realized, influenced the development of socialist thought.","translation":"パンティスクラシーは実現することはなかったが、社会主義思想の発展に影響を与えた。"}],"collocations":["establish a Pantisocracy","found a Pantisocracy","Pantisocratic ideals","Pantisocratic community"],"synonyms":["utopian socialism","communalism","egalitarianism"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「pan-」（すべて）、「isos」（平等）、「-kratia」（支配）から構成される。文字通りには「すべての人が平等に支配する」という意味。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæntɪˈsɒkrəsi/","syllables":"pan-ti-soc-ra-cy"},"inflection":{"noun_plural":"Pantisocracies"},"usage_notes":{"explanation":"「**Pantisocracy**」は非常に特殊な用語であり、一般的に使われることはありません。主に文学や歴史の文脈で、特にサミュエル・テイラー・コウルリッジとロバート・サウジーに関連して言及されます。現代英語では、より一般的な「utopian socialism」や「communalism」といった言葉が類似の概念を表すために用いられます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He advocated for pantisocracy in all aspects of life.","correct":"✓ He advocated for egalitarianism in all aspects of life.","note":"Pantisocracyは特定の歴史的文脈を持つため、一般的な平等主義を指す場合は「egalitarianism」がより適切です。"},{"incorrect":"✗ The pantisocracy was a great success.","correct":"✓ The utopian community was a great success.","note":"Pantisocracyは実際に成功した例がないため、成功例を述べる場合は、より一般的な「utopian community」を使用するか、特定の成功例を挙げることが適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Pantisocrat (名詞: パンティスクラシーの支持者)","Pantisocratic (形容詞: パンティスクラシーの)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Pantisocracy**」は、サミュエル・テイラー・コウルリッジとロバート・サウジーによって提唱された、18世紀の理想的な共同体社会主義の概念を指す専門用語です。この単語は、ギリシャ語の語源に由来し、「すべての人が平等に支配する」という意味を持ちます。現代英語ではほとんど使用されず、文学、歴史、政治思想などの分野で言及されることがあります。この単語を理解するには、18世紀のロマン主義と社会思想の文脈を知ることが重要です。"},"example_sentences":[{"sentence":"The concept of Pantisocracy, though short-lived, represents an early experiment in utopian communal living.","translation":"パンティスクラシーの概念は短命であったが、ユートピア的な共同生活における初期の実験を代表する。","type":"noun","meaning_category":"平等社会主義"},{"sentence":"Coleridge's Pantisocratic ideals were influenced by the French Revolution and a desire for social reform.","translation":"コールリッジのパンティスクラシーの理想は、フランス革命と社会改革への願望に影響を受けていた。","type":"adjective (Pantisocratic)","meaning_category":"平等社会主義の"}]}