{"word":"coronavirus-esque","meanings":[{"part_of_speech":"adjective","definition":"コロナウイルスのような、コロナウイルスを連想させる、コロナウイルスに特徴的な","english_definition":"Resembling or characteristic of the coronavirus or the circumstances surrounding the coronavirus pandemic.","examples":[{"sentence":"The deserted streets had a coronavirus-esque feel to them.","translation":"人けのない通りは、コロナウイルスを連想させる雰囲気だった。"},{"sentence":"The new regulations are coronavirus-esque in their restrictiveness.","translation":"新しい規制は、その制限の厳しさにおいて、コロナウイルス的だ。"},{"sentence":"The event had a coronavirus-esque atmosphere, with everyone wearing masks and social distancing.","translation":"イベントは、全員がマスクを着用し、ソーシャルディスタンスをとるという、コロナウイルスを連想させる雰囲気だった。"}],"collocations":["coronavirus-esque atmosphere","coronavirus-esque restrictions","coronavirus-esque measures","coronavirus-esque protocols"],"synonyms":["pandemic-like","COVID-like","reminiscent of coronavirus","evoking the coronavirus pandemic"],"antonyms":[],"related_words":["coronavirus","pandemic","COVID-19","lockdown","social distancing","mask mandate"]}],"etymology":{"value":"The word is formed by adding the suffix '-esque' to 'coronavirus'. The suffix '-esque' means 'resembling' or 'characteristic of'. Therefore, 'coronavirus-esque' means 'resembling or characteristic of the coronavirus'.","priority":"★★★"},"pronunciation":{"ipa":"/kəˌroʊnəˈvaɪrəsˌɛsk/","syllables":"co-ro-na-vi-rus-esque"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Coronavirus-esque' is a relatively new word that emerged during the coronavirus pandemic. It is used to describe things that are similar to or reminiscent of the coronavirus or the circumstances surrounding the pandemic, such as lockdowns, social distancing, and mask mandates. It is often used to convey a sense of unease or dystopia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The movie had a very coronavirus.","correct":"The movie had a very coronavirus-esque feel.","note":"'Coronavirus-esque' is an adjective and should be used to modify a noun."},{"incorrect":"The situation is very coronavirus.","correct":"The situation is very coronavirus-esque.","note":"'Coronavirus-esque' is an adjective, not a noun."}],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the pandemic era.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'coronavirus-esque' is a relatively recent formation used to describe something that resembles or is characteristic of the coronavirus pandemic. It is formed by adding the suffix '-esque' to 'coronavirus,' which means 'in the style of' or 'resembling.' Thus, 'coronavirus-esque' describes something that evokes the atmosphere, conditions, or characteristics associated with the coronavirus pandemic, such as social distancing, lockdowns, or mask-wearing. It is typically used in more sophisticated or descriptive contexts to quickly convey a set of associations related to the pandemic.","priority":"★★★"},"example_sentences":[{"sentence":"The empty streets at night gave the city a coronavirus-esque feeling.","translation":"夜の空っぽの通りは、街にコロナウイルスを連想させる雰囲気を与えた。","type":"adjective","meaning_category":"resembling the coronavirus pandemic"},{"sentence":"The new regulations, with their strict limitations, felt very coronavirus-esque.","translation":"その厳しい制限のある新しい規制は、非常にコロナウイルス的だと感じられた。","type":"adjective","meaning_category":"characteristic of the coronavirus pandemic"},{"sentence":"The conference, held entirely online, had a coronavirus-esque vibe.","translation":"完全にオンラインで開催された会議は、コロナウイルスを連想させる雰囲気だった。","type":"adjective","meaning_category":"evoking the coronavirus pandemic"}]}