{"word":"neif","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A female serf in medieval England.","english_definition":"A female serf in medieval England.","examples":[{"sentence":"The neif was bound to the land and subject to her lord's will.","translation":"ニエフは土地に縛られ、領主の意志に従属していた。"}],"collocations":["villein and neif","hold in neif","a neif's services"],"synonyms":["female serf","bondswoman"],"antonyms":["freewoman","lady"]}],"etymology":{"value":"From Anglo-Norman neif, from Old French naif (“native, natural, inborn; serf”), feminine of naif, from Latin nātīvus (“native, natural”), from nātus, past participle of nāscor (“I am born”).","priority":"★★☆"},"pronunciation":{"ipa":"/niːf/","syllables":"neif"},"inflection":{"noun_plural":"neives"},"usage_notes":{"explanation":"The term 'neif' specifically refers to a female serf in medieval England, distinguishing her from a villein, who could be male or female. The term is rarely used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She was a neif and therefore had many rights.","correct":"She was a neif and therefore had very few rights.","note":"Neifs, as serfs, had very limited rights."}],"priority":"★☆☆"},"related_words":{"derivatives":["naif","native","serf","villein"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'neif' is a historical term referring to a female serf in medieval England. It is not commonly used in modern English and is primarily encountered in historical texts or academic discussions of feudalism. Understanding its meaning requires knowledge of medieval social structures."},"example_sentences":[{"sentence":"The neif's life was one of hard labor and limited freedom.","translation":"ニエフの生活は、重労働と限られた自由の日々だった。","type":"noun","meaning_category":"female serf"},{"sentence":"The lord held the woman in neif, meaning she was bound to his land.","translation":"領主は女性をニエフとして所有しており、それは彼女が彼の土地に縛られていることを意味した。","type":"noun","meaning_category":"female serf"}]}