{"word":"traditorship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"背教者の地位、裏切り者の立場","english_definition":"The state or position of being a traditor (one who surrendered sacred books or betrayed fellow Christians during the Roman persecutions). More broadly, the act or state of betrayal.","examples":[{"sentence":"His traditorship was viewed as a grave sin by the early church.","translation":"彼の背教行為は、初期の教会によって重大な罪とみなされた。"},{"sentence":"The historical debate centers on whether certain bishops were guilty of traditorship.","translation":"歴史的な議論は、特定の司教が背教行為を犯したかどうかを中心に展開されている。"}],"collocations":["accused of traditorship (背教の罪で告発された)","guilty of traditorship (背教の罪を犯した)","historical traditorship (歴史的な背教)"],"synonyms":["apostasy","betrayal","treachery","defection","heresy"],"antonyms":["loyalty","faithfulness","devotion","allegiance"]}],"etymology":{"value":"Derived from 'traditor,' which comes from the Latin 'tradere' (to hand over, deliver, betray). 'Traditor' specifically referred to Christians who handed over sacred texts or betrayed other Christians to Roman authorities during persecutions. The suffix '-ship' denotes a state, condition, or office.","priority":"★★☆"},"pronunciation":{"ipa":"/trəˈdɪtərʃɪp/","syllables":"tra-di-tor-ship"},"inflection":{"noun_plural":"traditorships"},"usage_notes":{"explanation":"'Traditorship' is a relatively rare term, primarily used in historical or theological contexts to describe the actions of individuals who betrayed their faith or fellow believers, particularly during periods of persecution. It carries a strong negative connotation, emphasizing the gravity of the betrayal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great traditorship to his country.","correct":"✓ He showed great treachery to his country.","note":"While 'traditorship' implies betrayal, it's strongly associated with religious or sacred contexts. For general betrayal of one's country, 'treachery' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["traditor (noun: a betrayer, specifically one who handed over sacred texts)","tradition (related through the Latin root 'tradere', but with a different sense of handing down or transmitting)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Traditorship' is a highly specialized term primarily encountered in historical or theological discussions concerning the early Christian Church. It refers to the act or state of betraying one's faith, specifically by handing over sacred texts or fellow believers to persecuting authorities. Due to its limited usage and specific historical context, it is considered advanced vocabulary."},"example_sentences":[{"sentence":"The bishop faced accusations of traditorship for complying with the emperor's demands.","translation":"その司教は、皇帝の要求に応じたことで背教の罪で告発された。","type":"noun","meaning_category":"背教者の地位"},{"sentence":"Historians debate the extent of traditorship among early Christian leaders.","translation":"歴史家たちは、初期キリスト教指導者たちの間の背教行為の程度について議論している。","type":"noun","meaning_category":"裏切り者の立場"}]}