{"word":"electrophotography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"電子写真法、静電写真法","english_definition":"A photographic process in which an image is formed by electrostatic means.","examples":[{"sentence":"Electrophotography is commonly used in laser printers and photocopiers.","translation":"電子写真法は、レーザープリンターやコピー機で一般的に使用されています。"}],"collocations":["laser electrophotography","color electrophotography"],"synonyms":["xerography","photocopying"],"antonyms":[]}],"etymology":{"value":"'Electro-' (electricity) + 'photography' (recording images with light). It describes a process where electricity and light are used to create an image.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊfəˈtɒɡrəfi/","syllables":"e-lec-tro-pho-tog-ra-phy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Electrophotography is a technical term primarily used in the context of printing and image reproduction. It refers to a process where an electrostatic latent image is formed on a photoconductive surface, developed with toner, and then transferred to paper or another medium.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ electrophotography is used to take photos directly.","correct":"✓ electrophotography is used to create copies of images.","note":"Electrophotography is not used for taking original photos but for creating copies or prints."}],"priority":"★★☆"},"related_words":{"derivatives":["electrophotographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Electrophotography is a technical term related to image reproduction. It's a process where an electrostatic latent image is formed on a photoconductive surface, developed with toner, and transferred to a medium like paper. This term is mainly used in technical contexts related to printing and photocopying.","priority":"★★☆"},"example_sentences":[{"sentence":"The printer uses electrophotography to produce high-quality documents.","translation":"そのプリンターは、高品質のドキュメントを作成するために電子写真法を使用しています。","type":"general","meaning_category":"image reproduction"},{"sentence":"Advances in electrophotography have led to faster and more efficient printing technologies.","translation":"電子写真法の進歩により、より高速で効率的な印刷技術が実現しました。","type":"technical","meaning_category":"technological advancement"}]}