{"word":"pericystic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膀胱周囲の、嚢胞周囲の","english_definition":"Located or occurring around a cyst or the bladder.","examples":[{"sentence":"The pericystic inflammation was evident on the MRI.","translation":"MRIで嚢胞周囲の炎症が明らかだった。"},{"sentence":"Pericystic fibrosis can complicate surgical removal.","translation":"嚢胞周囲の線維症は外科的切除を複雑にする可能性がある。"}],"collocations":["pericystic inflammation","pericystic fibrosis","pericystic edema"],"synonyms":["paracystic","circumcystic"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'peri-' (around) and 'cystic' (relating to a cyst or bladder).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛrɪˈsɪstɪk/","syllables":"per-i-cyst-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are more pericystic, most pericystic, or less pericystic, least pericystic, but these are rarely used."},"usage_notes":{"explanation":"'Pericystic' is a relatively specialized term used in medical contexts, particularly in radiology and surgery, to describe the location of a finding or procedure in relation to a cyst or the bladder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cyst was pericystic to the kidney.","correct":"✓ The cyst was pericystic to the bladder. / ✓ The cyst was located near the kidney.","note":"Ensure the context relates to a cyst or bladder. If referring to another organ, use 'near' or 'adjacent to' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["peri- (prefix meaning around)","cyst (a sac containing liquid or semi-solid material)","cystic (relating to a cyst or bladder)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pericystic' is a highly specialized medical term. Understanding requires knowledge of medical terminology, specifically the prefixes and root words related to anatomical locations and structures. It is primarily used in professional medical communication. "},"example_sentences":[{"sentence":"The surgeon carefully dissected the pericystic adhesions.","translation":"外科医は嚢胞周囲の癒着を慎重に剥離した。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Pericystic changes can indicate the presence of an underlying malignancy.","translation":"嚢胞周囲の変化は、基礎にある悪性腫瘍の存在を示す可能性がある。","type":"radiology","meaning_category":"diagnostic imaging"}]}