{"word":"intranetwork","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(情報技術) 複数のネットワークが相互接続されたもの。特に、組織内の複数のローカルエリアネットワーク (LAN) が相互接続されて形成されるネットワークを指すことが多い。","english_definition":"(Information Technology) A network consisting of multiple interconnected networks, especially a network formed by interconnecting several local area networks (LANs) within an organization.","examples":[{"sentence":"The company's intranetwork allows employees in different offices to share files and resources.","translation":"会社のイントラネットワークにより、異なるオフィスにいる従業員がファイルやリソースを共有できます。"},{"sentence":"Our intranetwork is secured with firewalls to prevent unauthorized access from the outside.","translation":"当社のイントラネットワークは、外部からの不正アクセスを防ぐためにファイアウォールで保護されています。"}],"collocations":["build an intranetwork (イントラネットワークを構築する)","secure an intranetwork (イントラネットワークを保護する)","connect to the intranetwork (イントラネットワークに接続する)","access the intranetwork (イントラネットワークにアクセスする)"],"synonyms":["internetwork","internal network"],"antonyms":["internet","extranet"]}],"etymology":{"value":"「intra-」(内部) + 「network」(ネットワーク) の組み合わせ。組織「内部」の複数のネットワークが接続されたものを指す。","priority":"★☆☆"},"pronunciation":{"ipa":"ˌɪntrəˈnɛtwɜːrk","syllables":"in-tra-net-work"},"inflection":{"noun_plural":"intranetworks"},"usage_notes":{"explanation":"「**intranetwork**」は、組織内の複数のネットワークが接続されたものを指す技術用語です。インターネットとは異なり、通常は組織内部でのみアクセス可能です。イントラネットワークは、ファイル共有、プリンター共有、内部ウェブサイトへのアクセスなど、組織内のコミュニケーションとコラボレーションを促進するために使用されます。セキュリティ上の理由から、ファイアウォールなどのセキュリティ対策が施されていることが一般的です。より一般的には、類似の概念を指す「internetwork」という用語が使われることが多いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intranetwork is accessible to anyone on the internet.","correct":"✓ The intranetwork is only accessible to employees within the company.","note":"イントラネットワークは通常、組織内部のユーザーのみがアクセスできます。インターネット上の誰でもアクセスできるわけではありません。"},{"incorrect":"✗ Intranetwork and internet are the same thing.","correct":"✓ Intranetwork is a private network within an organization, while the internet is a global public network.","note":"イントラネットワークとインターネットは異なります。イントラネットワークは組織内部のプライベートネットワークであり、インターネットはグローバルなパブリックネットワークです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["intranet (イントラネット: 組織内部向けのウェブサイトや情報システム)","network (ネットワーク: 相互接続されたデバイスの集合体)","internetwork (インターネットワーク: 複数のネットワークが相互接続されたもの)"],"related_terms":["LAN (ローカルエリアネットワーク)","WAN (ワイドエリアネットワーク)","VPN (バーチャルプライベートネットワーク)","firewall (ファイアウォール)","router (ルーター)","switch (スイッチ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (技術的な文脈で使われる)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**intranetwork**」は、複数のネットワークが組み合わさってできた、組織内のネットワークを指す専門用語です。たとえば、会社にあるいくつかのLAN（ローカルエリアネットワーク）をつなげたものがイントラネットワークです。これは、インターネットとは違って、その組織の中だけで使うことができます。イントラネットワークを使うと、会社の中でファイルを共有したり、情報をやり取りしたりするのが簡単になります。セキュリティのために、外部からアクセスできないように保護されていることが多いです。"},"example_sentences":[{"sentence":"The new intranetwork has significantly improved communication within the department.","translation":"新しいイントラネットワークは、部門内のコミュニケーションを大幅に改善しました。","type":"general","meaning_category":"組織内のネットワーク"},{"sentence":"Access to the intranetwork requires a valid username and password.","translation":"イントラネットワークへのアクセスには、有効なユーザー名とパスワードが必要です。","type":"security","meaning_category":"組織内のネットワーク"},{"sentence":"The IT team is responsible for maintaining the company's intranetwork.","translation":"ITチームは、会社のイントラネットワークの維持管理を担当しています。","type":"management","meaning_category":"組織内のネットワーク"}]}