{"word":"cataractal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"白内障の、白内障性の","english_definition":"Relating to or affected by a cataract or cataracts.","examples":[{"sentence":"The patient presented with cataractal changes in both eyes.","translation":"患者は両眼に白内障性の変化を呈した。"},{"sentence":"Cataractal surgery is a common procedure to restore vision.","translation":"白内障手術は視力を回復させる一般的な処置である。"}],"collocations":["cataractal changes","cataractal surgery","cataractal lens"],"synonyms":["lenticular","opacified"],"antonyms":["clear","transparent"]}],"etymology":{"value":"Derived from 'cataract' + '-al'. 'Cataract' comes from the Latin 'cataracta' meaning 'waterfall' (referring to the clouding of the lens resembling a waterfall), and '-al' is a suffix denoting 'relating to'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkætəˈræktəl/","syllables":"cat-a-rac-tal"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Cataractal' is a specific adjective used in medical contexts to describe conditions, symptoms, or procedures related to cataracts. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The view was cataractal.","correct":"✓ The view was obscured by a cataract.","note":"'Cataractal' describes something related to a cataract, not a general lack of clarity. Use it to describe changes or symptoms related to the eye condition, not the quality of a view. Cataracts cause vision to be blurry, but 'cataractal' doesn't describe the view itself."}],"priority":"★★☆"},"related_words":{"derivatives":["cataract (noun: 白内障)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in medical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cataractal' is a specialized medical term. It is used to describe something related to or affected by a cataract, which is a clouding of the lens in the eye. This word is not commonly used in general conversation and is more likely to be found in medical literature or when discussing ophthalmological conditions. Understanding the root word 'cataract' is essential to grasp the meaning of 'cataractal'."},"example_sentences":[{"sentence":"The doctor noted cataractal progression during the eye exam.","translation":"医師は眼科検査中に白内障の進行を指摘した。","type":"adjective","meaning_category":"白内障の"},{"sentence":"The patient's cataractal vision improved significantly after surgery.","translation":"患者の白内障性の視力は手術後、著しく改善した。","type":"adjective","meaning_category":"白内障の"}]}