{"word":"chance-won","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Won by chance or luck, rather than skill or effort.","english_definition":"Acquired or achieved through luck or random occurrence, rather than through deliberate effort or skill.","examples":[{"sentence":"The lottery prize was a chance-won fortune.","translation":"その宝くじの賞金は、偶然によって得られた幸運な富だった。"},{"sentence":"His chance-won victory surprised everyone.","translation":"彼の偶然による勝利は皆を驚かせた。"},{"sentence":"She admitted that her success was largely chance-won.","translation":"彼女は自分の成功が主に偶然によるものだと認めた。"}],"collocations":["chance-won prize","chance-won victory","chance-won fortune","chance-won game"],"synonyms":["lucky","fortuitous","accidental","random","unearned"],"antonyms":["earned","deserved","merited","skillful","calculated"]}],"etymology":{"value":"Combination of 'chance' (referring to luck or random occurrence) and 'won' (past participle of 'win', meaning to gain victory or acquire something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃæns wʌn/","syllables":"chance-won"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Chance-won' is used to describe something acquired or achieved primarily through luck or random circumstances, rather than through skill, effort, or merit. It often implies that the achievement was unexpected or undeserved in some way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He chance-won the game because he's a good player.","correct":"✓ He chance-won the game, but it wasn't because he's a good player.","note":"The term 'chance-won' implies that skill was not the primary factor in the victory."}],"priority":"★★☆"},"related_words":{"derivatives":["chance (noun)","win (verb)","winner (noun)"],"phrases":["by chance","lucky win","fluke victory"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chance-won' is a relatively uncommon adjective used to describe something that was obtained or achieved primarily through luck or random chance, rather than through skill or effort. It implies that the outcome was not predictable or deserved based on the individual's abilities or actions. It is often used in contexts where the outcome is surprising or unexpected."},"example_sentences":[{"sentence":"The company's success was largely chance-won due to a sudden shift in market demand.","translation":"その会社の成功は、市場の需要の突然の変化により、主に偶然によるものだった。","type":"adjective","meaning_category":"Luck-based success"},{"sentence":"He admitted that his scholarship was chance-won, as he barely met the minimum requirements.","translation":"彼は自分の奨学金が、最低限の要件を辛うじて満たしていたため、偶然によるものだと認めた。","type":"adjective","meaning_category":"Accidental achievement"},{"sentence":"The small business owner attributed their unexpected profits to a chance-won opportunity.","translation":"その中小企業のオーナーは、予期せぬ利益を偶然得られた機会によるものだと考えた。","type":"adjective","meaning_category":"Fortuitous gain"}]}