{"word":"underhistory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史学)歴史の表舞台には現れない、社会の底辺に生きる人々の歴史、または公的な記録には残らない、隠された歴史","english_definition":"(History) The history of ordinary people, especially those marginalized or ignored by mainstream historical narratives; a hidden or unofficial history.","examples":[{"sentence":"The book explores the underhistory of the city, focusing on the lives of its working-class residents.","translation":"その本は、都市のアンダーヒストリーを探求し、労働者階級の住民の生活に焦点を当てています。"},{"sentence":"Historians are now paying more attention to the underhistory of social movements, examining the contributions of grassroots activists.","translation":"歴史家たちは現在、社会運動のアンダーヒストリーに、より注意を払い、草の根活動家の貢献を調べています。"},{"sentence":"The underhistory of this building reveals a complex story of immigration and displacement.","translation":"この建物のアンダーヒストリーは、移民と強制移住の複雑な物語を明らかにします。"}],"collocations":["explore the underhistory","uncover the underhistory","reveal the underhistory","the underhistory of a city","the underhistory of a movement","the underhistory of a building"],"synonyms":["subaltern history","people's history","history from below","unofficial history","hidden history","oral history"],"antonyms":["official history","mainstream history","conventional history","traditional history"]},{"part_of_speech":"noun","definition":"(比喩)表面的な出来事の背後にある、隠された、またはあまり知られていない事実や出来事","english_definition":"(Figurative) The hidden or less well-known facts and events behind a more visible or public situation.","examples":[{"sentence":"The underhistory of the company's success involves a series of ethical compromises.","translation":"その会社の成功のアンダーヒストリーには、一連の倫理的な妥協が含まれています。"},{"sentence":"To understand the present political climate, one must examine its underhistory of economic inequality.","translation":"現在の政治情勢を理解するには、経済的不平等のアンダーヒストリーを調べる必要があります。"},{"sentence":"The underhistory of this scientific discovery is filled with rivalries and personal conflicts.","translation":"この科学的発見のアンダーヒストリーは、ライバル関係と個人的な対立に満ちています。"}],"collocations":["the underhistory of a success","the underhistory of a conflict","the underhistory of a discovery","examine the underhistory","understand the underhistory","reveal the underhistory"],"synonyms":["hidden story","backstory","underlying narrative","secret history","unspoken truth","subtext"],"antonyms":["surface story","public narrative","official account","well-known facts"]}],"etymology":{"value":"\"Under-\" (下、下位) + \"history\" (歴史) の組み合わせ。歴史の表舞台に現れない、または公式記録に残らない人々の歴史や出来事を指すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈhɪstəri/","syllables":"un-der-his-to-ry"},"inflection":{"noun_plural":"underhistories"},"usage_notes":{"explanation":"\"Underhistory\" は、歴史学において、従来の歴史叙述から排除された人々の経験や出来事に焦点を当てる概念を指します。これは、社会の周縁に生きる人々、マイノリティ、労働者階級などの歴史を含みます。また、公的な記録には残らない、口頭伝承や個人的な記録を通じて伝えられる歴史も含まれます。比喩的には、表面的な出来事の背後にある、隠された事実や出来事を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underhistory is very important for understand the history.","correct":"✓ The underhistory is very important for understanding the history.","note":"\"Understand\" は動名詞または不定詞として使用する必要があります。"},{"incorrect":"✗ The underhistory of the building are fascinating.","correct":"✓ The underhistory of the building is fascinating.","note":"\"Underhistory\" は単数形なので、動詞も単数形を使用します。"},{"incorrect":"✗ He study underhistory in university.","correct":"✓ He studies underhistory at university.","note":"三人称単数現在形を使用し、場所を示す前置詞は \"at\" を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["microhistory","social history","oral history","subaltern studies","history from below"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Underhistory\" は、歴史学の専門用語で、一般的にはあまり使われません。この単語は、公式の歴史記録には残らない、社会の底辺に生きる人々の歴史や、隠された出来事を指します。例えば、ある都市の労働者階級の生活や、社会運動における草の根活動家の貢献などが、\"underhistory\" の対象となります。比喩的には、表面的な出来事の背後にある、あまり知られていない事実や出来事を指すこともあります。"},"example_sentences":[{"sentence":"The museum exhibit aimed to present the underhistory of the textile industry, highlighting the lives of the women who worked in the factories.","translation":"その博物館の展示は、繊維産業のアンダーヒストリーを紹介し、工場で働いていた女性たちの生活に焦点を当てることを目的としていました。","type":"noun","meaning_category":"歴史学"},{"sentence":"The author sought to uncover the underhistory of the conflict, revealing the long-standing grievances of the marginalized community.","translation":"著者は、紛争のアンダーヒストリーを明らかにし、疎外されたコミュニティの長年の不満を明らかにしようとしました。","type":"noun","meaning_category":"歴史学"},{"sentence":"The documentary explored the underhistory of the civil rights movement, focusing on the contributions of local activists and community organizers.","translation":"そのドキュメンタリーは、公民権運動のアンダーヒストリーを探求し、地元の活動家やコミュニティオーガナイザーの貢献に焦点を当てました。","type":"noun","meaning_category":"歴史学"},{"sentence":"The politician's carefully crafted image concealed an underhistory of corruption and scandal.","translation":"その政治家の注意深く作り上げられたイメージは、汚職とスキャンダルのアンダーヒストリーを隠していました。","type":"noun","meaning_category":"比喩"},{"sentence":"To truly understand the company's success, one must delve into its underhistory of innovation and risk-taking.","translation":"その会社の成功を真に理解するには、革新とリスクテイクのアンダーヒストリーを掘り下げる必要があります。","type":"noun","meaning_category":"比喩"}]}