{"word":"half-madly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半ば狂ったように、ほとんど狂ったように","english_definition":"In a way that is partly or almost mad; in a frenzied or irrational manner.","examples":[{"sentence":"She laughed half-madly at the absurdity of the situation.","translation":"彼女はその状況のばかばかしさに半ば狂ったように笑った。"},{"sentence":"He worked half-madly to finish the project on time.","translation":"彼は時間通りにプロジェクトを終わらせるためにほとんど狂ったように働いた。"}],"collocations":["laugh half-madly","work half-madly","stare half-madly"],"synonyms":["frantically","dementedly","irrationaly","crazily","wildly"],"antonyms":["calmly","rationally","sanely","methodically"]}],"etymology":{"value":"The word is formed by combining 'half' (meaning partly or almost) with 'madly' (meaning in a mad or frenzied manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhæfˈmædli/","syllables":"half-mad-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Half-madly' describes an action or behavior that is performed in a way that suggests a state of near-madness or extreme frenzy. It implies a loss of control or rationality, but not to the full extent of actual madness. The term is relatively uncommon and often used in literary or descriptive contexts to emphasize the intensity or irrationality of an action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted half madly.","correct":"✓ He acted half-madly.","note":"The correct form is 'half-madly,' a single adverb, not 'half mad' used separately."},{"incorrect":"✗ She was half-madly, but she managed to control herself.","correct":"✓ She was half-madly, but she managed to regain control.","note":"The phrase describes the *manner* of an action, not a state of being. So, it modifies a verb, not a subject."}],"priority":"★★☆"},"related_words":{"derivatives":["half-mad (adjective)"],"phrases":["driven half-madly","working half-madly"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Uncommon, used in descriptive or literary contexts)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Half-madly' is an adverb describing an action done in a way that suggests the person is almost mad or acting very irrationally. It's not a common word and is usually found in writing to add emphasis to how someone is behaving. For example, if someone is laughing 'half-madly,' it means they are laughing in a way that seems almost crazy or out of control."},"example_sentences":[{"sentence":"He searched for his lost keys half-madly, tearing through the house.","translation":"彼は家をめちゃくちゃにしながら、失くした鍵を半ば狂ったように探した。","type":"adverb","meaning_category":"frenzied search"},{"sentence":"She clung to the railing half-madly as the ship rocked violently.","translation":"船が激しく揺れる中、彼女は手すりに半ば狂ったようにしがみついた。","type":"adverb","meaning_category":"desperate clinging"},{"sentence":"The artist painted half-madly, driven by an inner vision.","translation":"その芸術家は内なるビジョンに駆り立てられ、ほとんど狂ったように絵を描いた。","type":"adverb","meaning_category":"frenzied painting"}]}