{"word":"Muvule","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hardwood tree species native to Africa, scientifically known as *Milicia excelsa*.","english_definition":"A species of hardwood tree native to tropical Africa, valued for its durable timber.","examples":[{"sentence":"Muvule wood is often used in furniture making due to its strength and resistance to termites.","translation":"ムヴレ材はその強度とシロアリへの耐性から、家具製造によく使用されます。"},{"sentence":"The Muvule tree can grow to a considerable size, providing shade and habitat for various animals.","translation":"ムヴレの木はかなりの大きさに成長し、日陰を提供し、様々な動物の生息地となります。"}],"collocations":["Muvule timber","Muvule wood","Muvule tree","Muvule furniture"],"synonyms":["African teak","Iroko (often used loosely, though Iroko can refer to a related but distinct species)"],"antonyms":[]}],"etymology":{"value":"The name 'Muvule' is derived from local African languages where the tree is indigenous.","priority":"★★☆"},"pronunciation":{"ipa":"/muˈvuːleɪ/","syllables":"mu-vu-le"},"inflection":{"notes":"Noun, plural form is often 'Muvule' or 'Muvule trees' depending on context."},"usage_notes":{"explanation":"'Muvule' refers specifically to the *Milicia excelsa* tree or its timber. It's often used in contexts related to woodworking, forestry, and African ecology. The term might not be widely recognized outside of these specialized areas or outside of Africa.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a table made of oak, but it was labeled Muvule.","correct":"✓ I bought a table made of Muvule wood.","note":"Ensure correct identification of the wood type. Muvule is distinct from oak or other common hardwoods."}],"priority":"★☆☆"},"related_words":{"derivatives":["None commonly used"],"phrasal_verbs":[],"related_species":["Milicia regia (a closely related species)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in specialized contexts related to African forestry and woodworking.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Muvule' is a specialized term referring to a specific species of hardwood tree found in Africa. Understanding its usage requires familiarity with forestry, woodworking, or African ecology. It is not a commonly used word in general English.","requires_knowledge_of":["African forestry","Woodworking","Botany"]},"example_sentences":[{"sentence":"The craftsman preferred working with Muvule because of its durability.","translation":"その職人は、耐久性があるため、ムヴレ材での作業を好んだ。","type":"noun","meaning_category":"Wood Type"},{"sentence":"Sustainable harvesting of Muvule is crucial for preserving African forests.","translation":"アフリカの森林を保護するためには、ムヴレの持続可能な収穫が不可欠である。","type":"noun","meaning_category":"Ecology"},{"sentence":"Muvule is often used as a substitute for teak due to its similar properties.","translation":"ムヴレは、その類似した特性から、チークの代替としてよく使用される。","type":"noun","meaning_category":"Woodworking"}]}