{"word":"angiogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"血管新生の、血管形成の","english_definition":"Relating to or promoting angiogenesis (the formation of new blood vessels).","examples":[{"sentence":"Angiogenic factors stimulate the growth of new blood vessels.","translation":"血管新生因子は新しい血管の成長を刺激する。"},{"sentence":"The tumor was found to be highly angiogenic.","translation":"その腫瘍は血管新生が非常に活発であることがわかった。"},{"sentence":"Angiogenic inhibitors can be used to treat certain diseases.","translation":"血管新生阻害剤は、特定の疾患の治療に使用できる。"}],"collocations":["angiogenic factor","angiogenic inhibitor","angiogenic activity","highly angiogenic","anti-angiogenic"],"synonyms":["vasculogenic","neovascular"],"antonyms":["anti-angiogenic"],"related_terms":["angiogenesis","blood vessel","vascular","tumor","growth factor"]}],"etymology":{"value":"From 'angio-' (referring to blood vessels) + '-genic' (producing or generating).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændʒiəˈdʒɛnɪk/","syllables":"an-gi-o-gen-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Angiogenic' is a technical term primarily used in medical and biological contexts. It describes substances or processes that encourage the formation of new blood vessels. This is crucial in development and wound healing but can also contribute to diseases like cancer, where tumors need new blood vessels to grow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The angiogenic is important for wound healing.","correct":"The angiogenic factor is important for wound healing.","note":"'Angiogenic' is an adjective and needs to be used with a noun, such as 'factor,' 'process,' or 'substance'."}],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Angiogenic' is a specialized term primarily encountered in medical and biological contexts. Understanding its meaning requires familiarity with the process of angiogenesis (new blood vessel formation) and its role in various physiological and pathological conditions. This term is not typically used in everyday language."},"example_sentences":[{"sentence":"The researchers studied the angiogenic properties of the drug.","translation":"研究者たちはその薬の血管新生特性を研究した。","type":"general","meaning_category":"血管新生の"},{"sentence":"Blocking angiogenic pathways is a key strategy in cancer therapy.","translation":"血管新生経路を遮断することは、癌治療における重要な戦略である。","type":"medical","meaning_category":"血管形成の"},{"sentence":"Certain growth factors have strong angiogenic effects.","translation":"特定の成長因子は強い血管新生効果を持つ。","type":"scientific","meaning_category":"血管新生の"}]}