{"word":"non-experts","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"専門家ではない人々、素人","english_definition":"People who do not have specialized knowledge or skills in a particular area; laypersons.","examples":[{"sentence":"This guide is written for non-experts in the field of computer science.","translation":"このガイドは、コンピュータ科学の分野の専門家ではない人々のために書かれています。"},{"sentence":"We need to explain the issue in a way that non-experts can understand.","translation":"専門家ではない人々が理解できるように、問題を説明する必要があります。"},{"sentence":"The committee included both experts and non-experts to ensure a balanced perspective.","translation":"委員会には、バランスの取れた視点を確保するために、専門家と専門家ではない人々が含まれていました。"}],"collocations":["for non-experts","among non-experts","experts and non-experts","aimed at non-experts"],"synonyms":["laypersons","amateurs","general public","non-specialists","outsiders"],"antonyms":["experts","specialists","professionals"],"related_terms":["expertise","layman's terms","technical jargon"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'experts'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒn ˈekspɜːrts/","syllables":"non-ex-perts"},"inflection":{"noun_plural":"non-experts"},"usage_notes":{"explanation":"'Non-experts' refers to individuals who lack specialized knowledge or training in a specific field. The term is often used in contrast to 'experts' to highlight the difference in understanding or skill level. It is important to use clear and accessible language when communicating with non-experts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ non expert","correct":"✓ non-expert","note":"The term is usually hyphenated, especially when used as an adjective before a noun (e.g., non-expert opinion). When used as a noun, 'non-experts' is acceptable."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in technical or specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'non-experts' is generally understood, but its usage is more common in formal or technical contexts when distinguishing between those with and without specialized knowledge. When writing for a general audience, consider using simpler terms like 'people without specialized knowledge' or 'those unfamiliar with the topic.'"},"example_sentences":[{"sentence":"The presentation was designed to be accessible to non-experts.","translation":"プレゼンテーションは、専門家ではない人々にも理解できるように設計されました。","type":"general"},{"sentence":"We need to gather feedback from both experts and non-experts.","translation":"専門家と専門家ではない両方からフィードバックを集める必要があります。","type":"comparison"},{"sentence":"The article explains the complex topic in layman's terms for non-experts.","translation":"この記事では、複雑なトピックを専門家ではない人々のためにわかりやすく説明しています。","type":"explanation"}]}