{"word":"geocline","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)地層急傾斜部、地層の急斜面","english_definition":"A zone of steeply dipping strata connecting regions of gently dipping strata.","examples":[{"sentence":"The geocline was formed by tectonic activity.","translation":"その地層急傾斜部は、地殻変動によって形成された。"},{"sentence":"Mapping the geocline is crucial for understanding the region's geological history.","translation":"その地層急傾斜部を地図にすることは、その地域の地質学的歴史を理解するために重要である。"}],"collocations":["geocline formation","geocline mapping","steep geocline","regional geocline"],"synonyms":["monocline","flexure"],"antonyms":["homocline"]},{"part_of_speech":"noun","definition":"(生態学)地理的勾配、環境勾配","english_definition":"A geographic gradient in environmental factors, such as temperature, salinity, or altitude, that influences the genetic or phenotypic variation of a species.","examples":[{"sentence":"The species exhibits clinal variation along the geocline of altitude.","translation":"その種は、高度の地理的勾配に沿ってクライン的な変異を示す。"},{"sentence":"The geocline influences the distribution of different ecotypes.","translation":"その地理的勾配は、異なる生態型の分布に影響を与える。"}],"collocations":["environmental geocline","altitudinal geocline","temperature geocline","species geocline"],"synonyms":["ecocline","environmental gradient"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'geo' (earth) and 'cline' (slope).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒiːoʊˌklaɪn/","syllables":"ge-o-cline"},"inflection":{"noun_plural":"geoclines"},"usage_notes":{"explanation":"'Geocline' has two main meanings, one in geology and one in ecology. In geology, it refers to a zone of steeply dipping rock layers. In ecology, it refers to a gradual change in environmental conditions over a geographical area. Context is important to determine the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geocline is a type of climate.","correct":"✓ The geocline is a geological or ecological feature.","note":"A geocline is not a type of climate but a geological formation or an environmental gradient."}],"priority":"★☆☆"},"related_words":{"derivatives":["clinal","cline","geography","geology","ecocline"],"related_terms":["monocline","anticline","syncline","gradient","ecotype","variation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'geocline' is a specialized term used in geology and ecology. In geology, it refers to a steeply dipping section of rock layers connecting areas with gentler slopes. In ecology, it describes a gradual change in environmental conditions across a geographical area. Understanding the context is essential to determine the correct meaning. This term is typically encountered in advanced scientific texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The sedimentary layers folded to create a prominent geocline.","translation":"堆積層が褶曲して顕著な地層急傾斜部を形成した。","type":"noun","meaning_category":"geology"},{"sentence":"The plant species showed a gradual change in leaf size along the altitudinal geocline.","translation":"その植物種は、高度の地理的勾配に沿って葉の大きさに緩やかな変化を示した。","type":"noun","meaning_category":"ecology"}]}