{"word":"C-mitosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コルヒチン処理された細胞における有糸分裂。紡錘糸の形成が阻害され、染色体が細胞中央に凝集する。","english_definition":"Mitosis in a cell treated with colchicine, where spindle formation is inhibited and chromosomes are aggregated at the cell's center.","examples":[{"sentence":"C-mitosis is used in karyotyping to visualize individual chromosomes.","translation":"C-分裂は、個々の染色体を可視化するために核型分析で使用されます。"}],"collocations":["colchicine","karyotyping","spindle fibers","chromosome condensation"],"synonyms":["colchicine-arrested mitosis","arrested metaphase"],"antonyms":["normal mitosis","anaphase","telophase"]}],"etymology":{"value":"The term 'C-mitosis' refers to Colchicine-mitosis, because it is induced by the chemical colchicine.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsiːmaɪˈtoʊsɪs/","syllables":"C-mi-to-sis"},"inflection":{"noun_plural":"C-mitoses"},"usage_notes":{"explanation":"C-mitosis is a specific type of mitosis that occurs when a cell is treated with colchicine or other spindle poisons. These substances disrupt the formation of the mitotic spindle, preventing the chromosomes from separating properly during cell division. This results in chromosomes that are highly condensed and scattered throughout the cell, making them easier to visualize and count. C-mitosis is often used in karyotyping, a technique used to analyze the chromosome composition of a cell.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ C mitosis is a normal part of cell division.","correct":"✓ C-mitosis is an abnormal process induced by chemicals.","note":"C-mitosis is not a normal part of cell division; it is an induced state caused by specific chemicals like colchicine."}],"priority":"★★☆"},"related_words":{"derivatives":["colchicine","mitotic arrest","karyotype"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'C-mitosis' refers to a specific type of cell division where the process is disrupted by a chemical called colchicine. This disruption prevents the normal separation of chromosomes, causing them to condense and clump together. This process is useful in scientific research, particularly in karyotyping, where chromosomes are analyzed. The term is technical and primarily used in advanced biology and genetics contexts."},"example_sentences":[{"sentence":"The researcher used colchicine to induce C-mitosis in the cell culture.","translation":"研究者は、細胞培養においてC-分裂を誘導するためにコルヒチンを使用した。","type":"scientific","meaning_category":"cell biology"},{"sentence":"C-mitosis allows for easier visualization of chromosomes during karyotyping.","translation":"C-分裂により、核型分析中の染色体の可視化が容易になる。","type":"scientific","meaning_category":"genetics"}]}