{"word":"niobium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ニオブ (原子番号41の金属元素)","english_definition":"A metallic chemical element with the symbol Nb and atomic number 41. It is a ductile, gray, crystalline transition metal.","examples":[{"sentence":"Niobium is used in alloys and superconductors.","translation":"ニオブは合金や超伝導体に使用される。"},{"sentence":"Niobium is often found in the minerals pyrochlore and columbite.","translation":"ニオブはしばしばパイロクロアやコルンブ石などの鉱物中に見られる。"}],"collocations":["niobium alloy","niobium oxide","niobium wire"],"synonyms":["columbium (historical name)"],"antonyms":[]}],"etymology":{"value":"Named after Niobe, a figure in Greek mythology, the daughter of Tantalus. This is because niobium is often found in minerals alongside tantalum.","priority":"★★☆"},"pronunciation":{"ipa":"/naɪˈoʊbiəm/","syllables":"ni-o-bi-um"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Niobium is a relatively rare, soft, ductile, and gray transition metal. It has various applications, including in the production of high-strength steel alloys, superconductors, and jewelry. It is also biocompatible, making it useful in medical implants. Historically, niobium was also known as columbium (symbol Cb), especially in the United States, but niobium is the internationally recognized name.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Niobium is a very reactive metal like sodium.","correct":"✓ Niobium is a relatively unreactive metal.","note":"Niobium is not highly reactive. It forms a protective oxide layer that makes it resistant to corrosion."}],"priority":"★☆☆"},"related_words":{"derivatives":["niobic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Niobium is a technical term referring to a specific chemical element. Understanding its properties and applications requires knowledge of chemistry and materials science. The word is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The superconducting magnet was made using a **niobium**-titanium alloy.","translation":"超伝導磁石はニオブチタン合金を用いて作られた。","type":"noun","meaning_category":"element"},{"sentence":"**Niobium** is added to steel to increase its strength.","translation":"ニオブは鋼の強度を増加させるために添加される。","type":"noun","meaning_category":"element"}]}