{"word":"mohalim","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Korean: 모하림) A member of the Royal Library's research department during the Joseon Dynasty in Korea. They were selected from those who passed the higher civil service examination and were considered promising scholars.","english_definition":"A member of the Royal Library's research department during the Joseon Dynasty in Korea. They were selected from those who passed the higher civil service examination and were considered promising scholars.","examples":[{"sentence":"The mohalim were tasked with advising the king on matters of state and conducting research on various topics.","translation":"모하림들은 국정 문제에 대해 왕에게 조언하고 다양한 주제에 대한 연구를 수행하는 임무를 맡았습니다. (The mohalim were tasked with advising the king on matters of state and conducting research on various topics.)"}],"collocations":["Joseon Dynasty","Royal Library","civil service examination","scholar"],"synonyms":["scholar","researcher","official"],"antonyms":[]}],"etymology":{"value":"Derived from the Korean word 'mohalim' (모하림), referring to the specific position within the Joseon Dynasty's government.","priority":"★★★"},"pronunciation":{"ipa":"/mo.ɦa.ɾim/","syllables":"mo-ha-rim"},"inflection":{},"usage_notes":{"explanation":"'Mohalim' is a specific historical term and is primarily used in the context of Korean history, particularly when discussing the Joseon Dynasty. It is not a commonly used word outside of this context.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Mohalim' is a specialized term related to Korean history and is unlikely to be encountered by non-specialists. Understanding requires knowledge of the Joseon Dynasty and its administrative structure."},"example_sentences":[{"sentence":"The king often consulted with the mohalim on matters of policy.","translation":"왕은 종종 정책 문제에 대해 모하림들과 상의했습니다. (The king often consulted with the mohalim on matters of policy.)","type":"noun","meaning_category":"Historical Title"}]}