{"word":"Burnets","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ワレモコウ属の植物（複数形）","english_definition":"plural of burnet: any plant of the genus Sanguisorba.","examples":[{"sentence":"Burnets are often used in salads and herbal remedies.","translation":"ワレモコウ属の植物は、サラダや薬草療法によく使われます。"}],"collocations":["salad burnet","greater burnet","lesser burnet"],"synonyms":["Sanguisorba"],"antonyms":[]}],"etymology":{"value":"The name \"burnet\" comes from the Middle English brunet, meaning \"brownish,\" referring to the dark color of the flower heads of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrnɪts/","syllables":"Bur-nets"},"inflection":{"noun_plural":"Burnets"},"usage_notes":{"explanation":"\"Burnets\" refers to multiple plants of the genus Sanguisorba. The most common species are Salad Burnet (Sanguisorba minor) and Great Burnet (Sanguisorba officinalis). Salad Burnet has a cucumber-like flavor and is used in salads and other culinary dishes. Great Burnet is used medicinally.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a burnets in the field.","correct":"✓ I saw some burnets in the field. / ✓ I saw a burnet in the field.","note":"\"Burnets\" is plural. Use \"some burnets\" or, if referring to a single plant, \"a burnet.\""}],"priority":"★★☆"},"related_words":{"derivatives":["burnet (singular form)","Sanguisorba (genus name)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Burnets\" refers to plants of the genus Sanguisorba. It's a relatively uncommon word, mostly encountered in botanical or gardening contexts. Understanding requires some familiarity with plant taxonomy.","priority":"★★★"},"example_sentences":[{"sentence":"The meadow was filled with various wildflowers, including burnets.","translation":"牧草地は、ワレモコウ属の植物を含む様々な野花でいっぱいでした。","type":"noun","meaning_category":"plants"},{"sentence":"She added fresh burnets to the salad for a unique flavor.","translation":"彼女は独特の風味のために、新鮮なワレモコウ属の植物をサラダに加えました。","type":"noun","meaning_category":"plants"},{"sentence":"Traditional medicine uses burnets for their astringent properties.","translation":"伝統医学では、ワレモコウ属の植物を収斂特性のために使用します。","type":"noun","meaning_category":"plants"}]}