{"word":"Hakluyt","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ハクルート（人名）。主に16世紀から17世紀のイングランドの地理学者、歴史家、聖職者の家系を指す。特にリチャード・ハクルート（Richard Hakluyt the younger, 1552年頃 - 1616年11月23日）が著名で、航海記録を収集・編纂し、イギリスの海外進出を奨励した。","english_definition":"A surname, referring to a family of English geographers, historians, and clergymen, primarily from the 16th and 17th centuries. Most notably, Richard Hakluyt the younger (c. 1552 – November 23, 1616) was a prominent figure who collected and compiled accounts of voyages and encouraged English overseas exploration.","examples":[{"sentence":"Richard Hakluyt's writings were instrumental in promoting English colonization.","translation":"リチャード・ハクルートの著作は、イギリスの植民地化を促進する上で重要な役割を果たした。"},{"sentence":"Hakluyt's 'Principal Navigations' is a valuable historical resource.","translation":"ハクルートの『航海記』は貴重な歴史的資料である。"}],"collocations":["Richard Hakluyt","Hakluyt Society (ハクルート協会)","Principal Navigations (航海記)"],"synonyms":["Richard Hakluyt the younger"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"ハクルート協会（Hakluyt Society）。航海記録や地理学関連の文献を出版する学術団体。","english_definition":"The Hakluyt Society is a text publication society that publishes scholarly editions of primary records of voyages and travels, and other geographical material.","examples":[{"sentence":"The Hakluyt Society has published numerous volumes of historical travel accounts.","translation":"ハクルート協会は、歴史的な旅行記の多くの巻を出版している。"}],"collocations":["Hakluyt Society publications","Hakluyt Society journal"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"姓であり、起源は不明。","priority":"低"},"pronunciation":{"ipa":"/ˈhækluːt/","syllables":"Hak-luyt"},"inflection":{"notes":"固有名詞のため、複数形や活用形は通常存在しない。"},"usage_notes":{"explanation":"「Hakluyt」は、主に歴史的な文脈で使用される名前です。リチャード・ハクルート（Richard Hakluyt）は、イギリスの海外進出を奨励したことで知られており、彼の著作は歴史研究において重要な資料となっています。また、ハクルート協会（Hakluyt Society）は、航海記録や地理学関連の文献を出版する学術団体として知られています。","priority":"中"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_names":["Richard Hakluyt"],"related_places":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C1","text":"「Hakluyt」という単語は、歴史、特にイギリスの探検史や地理学に関心のある読者にとって馴染み深いものです。リチャード・ハクルートは、イギリスの海外進出を奨励した人物として知られており、彼の著作は一次資料として重要です。また、ハクルート協会は、歴史的な航海記録を出版する学術団体として、専門的な文脈で言及されることがあります。この単語は、一般的な日常会話ではほとんど使用されませんが、歴史や地理学の研究においては重要なキーワードとなります。"},"example_sentences":[{"sentence":"Richard Hakluyt collected accounts of voyages to the New World.","translation":"リチャード・ハクルートは、新世界への航海の記録を収集した。","type":"noun","meaning_category":"人名"},{"sentence":"The Hakluyt Society publishes historical travel narratives.","translation":"ハクルート協会は、歴史的な旅行記を出版している。","type":"proper noun","meaning_category":"団体名"}]}