{"word":"Pseudo-aryan","priority":"低","meanings":[{"part_of_speech":"名詞/形容詞","definition":"疑似アーリア人、または疑似アーリア的な。アーリア人種という概念を歪曲または誤用する人または考え方を指す軽蔑的な用語。","english_definition":"A derogatory term referring to a person or idea that distorts or misuses the concept of the Aryan race. It often implies a superficial or false association with Aryanism, typically used to criticize ideologies or individuals promoting racial superiority or exclusion based on a flawed understanding of history and anthropology.","examples":[{"sentence":"The historian criticized the group's claims as pseudo-aryan nonsense.","translation":"歴史家は、そのグループの主張を疑似アーリア的なナンセンスとして批判した。"},{"sentence":"The politician's rhetoric was seen by many as promoting pseudo-aryan ideals.","translation":"その政治家のレトリックは、多くの人によって疑似アーリア的な理想を推進するものと見なされた。"}],"collocations":["pseudo-aryan ideology","pseudo-aryan rhetoric","pseudo-aryan claims","pseudo-aryan theories"],"synonyms":["false aryan","wannabe aryan","aryan pretender"],"antonyms":["anti-aryan","non-aryan"],"notes":"この用語は非常に侮辱的であり、注意して使用する必要がある。歴史的、政治的な文脈で使用されることが多い。"}],"etymology":{"value":"\"Pseudo-\"（偽の、似非の）と \"Aryan\"（アーリア人）の組み合わせ。アーリア人種という誤った概念に基づき、それを模倣または歪曲するものを指す。","priority":"中"},"pronunciation":{"ipa":"/ˌsjuːdoʊ ˈɛəriən/","syllables":"pseu-do-ar-i-an"},"inflection":{"notes":"名詞または形容詞として使用される。複数形は \"Pseudo-aryans\"。"},"usage_notes":{"explanation":"「Pseudo-aryan」は、アーリア人種という概念を不正確または悪意を持って使用する人や考え方を指す、非常に否定的な意味合いを持つ用語です。この用語は、優越性や排他性を主張するために歴史や人類学を歪曲するイデオロギーや個人を批判する際に用いられます。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"He is a pseudo-aryan, so we should respect him.","correct":"He promotes pseudo-aryan ideas, which is harmful.","note":"疑似アーリア的な考え方を支持することは、批判されるべきであり、尊敬に値することではない。"},{"incorrect":"Pseudo-aryan is a good thing.","correct":"Pseudo-aryan ideology is dangerous and based on misinformation.","note":"疑似アーリア的なイデオロギーは危険であり、誤った情報に基づいている。"}],"priority":"高"},"related_words":{"derivatives":["pseudo (偽の、似非の)","aryan (アーリア人)","aryanism (アーリア主義)"],"related_terms":["racism (人種差別)","white supremacy (白人至上主義)","nationalism (国家主義)","fascism (ファシズム)"]},"level_frequency":{"frequency_google_ngram":"低","CEFR":"C2"},"readability_explanation":{"level":"C2","text":"\"Pseudo-aryan\" is a highly specialized and critical term used to describe ideologies or individuals who falsely or misleadingly adopt or promote concepts related to the Aryan race, often in the context of racial superiority or exclusion. The term is inherently negative and is used to critique and condemn such beliefs. Understanding requires a strong grasp of historical and political contexts, particularly those related to racism, nationalism, and fascism."},"example_sentences":[{"sentence":"The scholar debunked the pseudo-aryan theories promoted by the extremist group.","translation":"学者は、過激派グループによって推進された疑似アーリア的な理論を論破した。","type":"general"},{"sentence":"The film satirized the pseudo-aryan obsession with racial purity.","translation":"その映画は、人種の純粋性に対する疑似アーリア的な執着を風刺した。","type":"general"}]}