{"word":"childridden","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に軽蔑的に)子供に悩まされている、子供でいっぱいの","english_definition":"(chiefly derogatory) Overrun or plagued by children; full of children.","examples":[{"sentence":"The park was childridden on a Saturday afternoon.","translation":"土曜日の午後、公園は子供でいっぱいだった。"},{"sentence":"I avoid that restaurant; it's always childridden.","translation":"私はあのレストランを避けている。いつも子供でいっぱいだから。"}],"collocations":["childridden park","childridden restaurant","childridden playground"],"synonyms":["full of children","overrun with children","plagued by children"],"antonyms":["child-free","adult-oriented"]}],"etymology":{"value":"'Child' + 'ridden'. 'Ridden' is the past participle of 'ride', used here in the sense of being dominated or plagued by something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃaɪldˌrɪdən/","syllables":"child-rid-den"},"inflection":{"notes":"This word does not have different forms for gender or number, as it is an adjective."},"usage_notes":{"explanation":"The word 'childridden' is typically used in a negative or critical way to describe a place or situation that is overwhelmed by the presence of children. It often implies that the children are causing a disturbance or are otherwise undesirable in that context. It's not a commonly used word and can be considered offensive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The childridden is very noisy.","correct":"✓ The childridden park is very noisy.","note":"'Childridden' is an adjective, so it needs to modify a noun. It cannot be used as a noun itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Childridden' is a relatively uncommon and somewhat negative term, suggesting a place is overrun with children, often to an undesirable extent. Due to its infrequent use and potential for negative connotation, it is more suitable for advanced learners who understand its nuanced meaning and can use it appropriately."},"example_sentences":[{"sentence":"The once peaceful library became childridden during the summer holidays.","translation":"かつて静かだった図書館は、夏休み期間中に子供でいっぱいになった。","type":"adjective","meaning_category":"子供でいっぱいの"},{"sentence":"Some parents complain about the childridden atmosphere of family resorts.","translation":"家族向けリゾートの子供でいっぱいの雰囲気に不満を抱く親もいる。","type":"adjective","meaning_category":"子供に悩まされている"}]}