{"word":"proletariatism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プロレタリアート主義、無産階級主義","english_definition":"The principles or ideology associated with the proletariat or working class; advocacy of the proletariat's interests.","examples":[{"sentence":"His writings were heavily influenced by proletariatism.","translation":"彼の著作はプロレタリアート主義の影響を強く受けていた。"},{"sentence":"The political party's platform was based on proletariatism.","translation":"その政党の綱領はプロレタリアート主義に基づいていた。"}],"collocations":["political proletariatism","economic proletariatism","revolutionary proletariatism"],"synonyms":["working-class ideology","socialism","communism","Marxism"],"antonyms":["bourgeoisieism","capitalism","conservatism"]},{"part_of_speech":"noun","definition":"プロレタリアートの性質、プロレタリアートの状態","english_definition":"The condition or characteristics associated with being a member of the proletariat.","examples":[{"sentence":"The novel depicted the harsh realities of proletariatism in the industrial age.","translation":"その小説は産業時代におけるプロレタリアートの過酷な現実を描写していた。"},{"sentence":"Poverty and lack of opportunity are often features of proletariatism.","translation":"貧困と機会の欠如は、しばしばプロレタリアートの性質である。"}],"collocations":["economic proletariatism","social proletariatism","cultural proletariatism"],"synonyms":["working-class condition","poverty","deprivation"],"antonyms":["affluence","privilege","wealth"]}],"etymology":{"value":"Formed from 'proletariat' (the working class) + '-ism' (a suffix denoting a principle, ideology, or condition). 'Proletariat' comes from the Latin 'proletarius,' meaning a citizen of the lowest class who served the state not with property but with offspring.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊləˈtɛəriəˌtɪzəm/","syllables":"pro-le-tar-i-at-ism"},"inflection":{"noun_plural":"proletariatisms (rarely used)"},"usage_notes":{"explanation":"'Proletariatism' refers to the ideology or principles that champion the interests of the proletariat (working class). It can also refer to the state or condition of being part of the proletariat, highlighting the socio-economic realities and challenges faced by this class. The term is often associated with socialist and communist thought.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He advocated proletariat.","correct":"✓ He advocated proletariatism.","note":"'Proletariat' refers to the working class itself, while 'proletariatism' refers to the ideology or principles associated with that class."},{"incorrect":"✗ Proletariatism is a person.","correct":"✓ Proletariatism is an ideology.","note":"'Proletariatism' is not a person but a set of beliefs or a condition."}],"priority":"★★☆"},"related_words":{"derivatives":["proletariat","proletarian","proletarianize"],"phrases":["dictatorship of the proletariat"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proletariatism' is a complex term that refers to the ideology or principles that support the interests and perspectives of the working class (the proletariat). It can also describe the conditions and characteristics associated with being part of the proletariat, such as poverty, lack of power, and economic exploitation. This term is often used in discussions of socialism, communism, and class struggle. Understanding 'proletariatism' requires a grasp of political theory and socio-economic concepts."},"example_sentences":[{"sentence":"The artist's work often depicted the struggles and hardships of proletariatism in the city.","translation":"その芸術家の作品は、都市におけるプロレタリアートの苦闘と苦難をしばしば描いていた。","type":"noun","meaning_category":"Proletariat's condition"},{"sentence":"The political movement was founded on the principles of proletariatism, advocating for workers' rights and equality.","translation":"その政治運動はプロレタリアート主義の原則に基づいて設立され、労働者の権利と平等を提唱していた。","type":"noun","meaning_category":"Ideology"}]}