{"word":"epizoochorous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"動物付着散布の、動物の体表に付着して種子が散布される","english_definition":"(of a plant) having seeds that are dispersed by being carried on the outside of animals.","examples":[{"sentence":"The plant is epizoochorous, relying on animals to spread its seeds.","translation":"その植物は動物付着散布であり、動物が種子を広めるのに頼っている。"}],"collocations":["epizoochorous plant","epizoochorous seed dispersal"],"synonyms":["ectozoochorous"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'epi-' (upon), 'zoon' (animal), and 'choros' (spreading, dispersal).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪzuːˈɒkərəs/","syllables":"ep-i-zoo-cho-rous"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more epizoochorous, most epizoochorous."},"usage_notes":{"explanation":"Epizoochory is a specific type of seed dispersal where seeds are transported externally on animals, as opposed to endozoochory where seeds are ingested. Plants that use this method often have seeds with hooks, barbs, or sticky substances to aid in attachment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The plant is epizoochoric.","correct":"The plant is epizoochorous.","note":"The correct form of the adjective is 'epizoochorous,' not 'epizoochoric'."}],"priority":"★★☆"},"related_words":{"derivatives":["epizoochory (noun: the dispersal of seeds by external carriage on animals)","endozoochory (noun: the dispersal of seeds by ingestion by animals)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency. This is a specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epizoochorous' is a technical term used in botany and ecology to describe a specific method of seed dispersal. It refers to plants whose seeds are adapted to be carried externally on animals. Understanding this term requires familiarity with biological concepts and vocabulary. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"Burrs are a common example of epizoochorous seeds, clinging to animal fur for dispersal.","translation":"オナモミは、動物の毛皮に付着して散布される動物付着散布の種子の一般的な例です。","type":"adjective","meaning_category":"seed dispersal"}]}