{"word":"faux-na","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング) 非黒人の黒人文化への傾倒者、特に黒人のように振る舞おうとする白人","english_definition":"(slang, derogatory) A non-Black person, especially a white person, who is perceived as appropriating or imitating Black culture or mannerisms.","examples":[{"sentence":"Some people consider him a faux-na because of his exaggerated use of African American Vernacular English.","translation":"彼がアフリカ系アメリカ人バーナキュラー英語を大げさに使うので、彼をフォウナだと考える人もいる。"},{"sentence":"She was accused of being a faux-na after posting a video of herself dancing to hip-hop music.","translation":"彼女はヒップホップ音楽に合わせて踊る動画を投稿した後、フォウナだと非難された。"}],"collocations":["accused of being a faux-na","labeled as a faux-na","faux-na behavior"],"synonyms":["wannabe","culture vulture","appropriator"],"antonyms":[]}],"etymology":{"value":"「faux」はフランス語で「偽の」を意味し、「-na」は「nigga」のスラング的な短縮形に由来する。この用語は、黒人文化を真に理解または尊重せずに模倣する人を軽蔑的に指すために作られた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊnɑː/","syllables":"faux-na (2 syllables)"},"inflection":{"notes":"複数形は faux-nas"},"usage_notes":{"explanation":"「**faux-na**」は非常に軽蔑的な用語であり、使用は避けるべきです。文化の盗用や無神経さを示唆するため、人を侮辱する可能性があります。この用語は、黒人文化に対する理解や尊重が欠けていると見なされる非黒人を指すために使用されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She's just being appreciative, not a faux-na.","correct":"✓ She's just being appreciative, not appropriating.","note":"「faux-na」という言葉を使う代わりに、文化の盗用について議論する方が適切です。"},{"incorrect":"✗ He's a faux-na because he likes hip-hop.","correct":"✓ He's appropriating Black culture because he's imitating the style without understanding the history.","note":"単に文化を楽しむことと、文化を盗用することは異なります。文化の盗用は、歴史的背景を理解せずに文化の要素を模倣することです。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (スラング)","frequency_google_ngram":"低頻度 (Low frequency) - スラング用語のため、一般的なテキストではあまり使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**faux-na**」は、黒人文化を模倣または盗用していると見なされる非黒人を指す、非常に軽蔑的なスラング用語です。この用語は侮辱的であり、使用は避けるべきです。この用語は、文化の盗用や文化に対する無神経さといった、より広範な問題について議論する際に使用されることがあります。この単語は、その意味と影響を理解した上で慎重に使用する必要があります。"},"example_sentences":[{"sentence":"The internet erupted in debate after a celebrity was called out for being a **faux-na**.","translation":"ある有名人がフォウナだと非難された後、インターネット上では議論が勃発した。","type":"noun","meaning_category":"文化の盗用"},{"sentence":"It's important to understand the difference between cultural appreciation and being a **faux-na**.","translation":"文化を理解することと、フォウナであることの違いを理解することが重要だ。","type":"noun","meaning_category":"文化の盗用"}]}