{"word":"Khesari","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物)ケサリ、ラティルス・サティヴス (Lathyrus sativus): マメ科の植物で、食用になる種子を持つ。乾燥に強く、貧しい土壌でも育つため、特に旱魃地帯で重要な作物となる。ただし、多量に摂取すると神経毒性を持つ可能性がある。","english_definition":"(botany) Khesari, also known as grass pea (Lathyrus sativus), is a legume grown for human food and animal feed, especially in areas subject to drought and famine. It is a drought-resistant crop that can grow in poor soils. However, it contains a neurotoxin and excessive consumption can cause lathyrism.","examples":[{"sentence":"Khesari is an important crop in many drought-prone regions of India.","translation":"ケサリはインドの多くの旱魃地帯で重要な作物です。"},{"sentence":"Due to its drought resistance, farmers often rely on khesari during dry seasons.","translation":"乾燥に強いため、農家は乾季にケサリに頼ることがよくあります。"},{"sentence":"Excessive consumption of khesari can lead to a neurological condition called lathyrism.","translation":"ケサリの過剰摂取は、ラチリズムと呼ばれる神経疾患を引き起こす可能性があります。"}],"collocations":["grow khesari (ケサリを栽培する)","cultivate khesari (ケサリを栽培する)","khesari dal (ケサリのダール)","khesari cultivation (ケサリの栽培)","khesari farming (ケサリの農業)","lathyrus sativus (ラティルス・サティヴス、ケサリの学名)"],"synonyms":["grass pea","chickling vetch","Indian pea","white vetch"],"antonyms":[]}],"etymology":{"value":"ケサリ (Khesari) という名前は、インド亜大陸の様々な地域で使用されている現地の言葉に由来します。植物学名である Lathyrus sativus は、ラテン語に由来します。","priority":"★★☆"},"pronunciation":{"ipa":"/kʰeːˈsɑːri/","syllables":"Khe-sa-ri"},"inflection":{"notes":"名詞なので、複数形は通常ありません。"},"usage_notes":{"explanation":"「**Khesari**」は、主に農業、植物学、栄養学の文脈で使用される専門用語です。一般的には、特定の地域（特にインド亜大陸）の農業や食文化に詳しい人でない限り、日常会話で使われることはほとんどありません。ケサリの消費に関連する健康上のリスクについても言及されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I eat khesari every day for protein.","correct":"✓ While khesari is a source of protein, excessive consumption can be harmful.","note":"ケサリはタンパク質の供給源ですが、過剰摂取は有害となる可能性があるため、毎日食べることは推奨されません。"},{"incorrect":"✗ Khesari is a type of rice.","correct":"✓ Khesari is a type of legume (or pulse).","note":"ケサリは米ではなく、マメ科の植物です。"}],"priority":"★★☆"},"related_words":{"derivatives":["lathyrism (ラチリズム: ケサリの過剰摂取によって引き起こされる神経疾患)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Khesari**」は、植物学、農業、栄養学などの専門分野で使われる単語で、一般の人が日常的に使うことはほとんどありません。この単語は、マメ科の植物であるラティルス・サティヴス（Lathyrus sativus）を指し、特に乾燥地帯で栽培される作物として知られています。ただし、過剰に摂取すると神経毒性を持つ可能性があるため、注意が必要です。専門的な文脈以外では、ほとんど使われない単語です。"},"example_sentences":[{"sentence":"The government is promoting the cultivation of drought-resistant crops like khesari.","translation":"政府はケサリのような干ばつに強い作物の栽培を推進しています。","type":"noun","meaning_category":"植物"},{"sentence":"Studies are being conducted to reduce the neurotoxin content in khesari.","translation":"ケサリに含まれる神経毒の量を減らすための研究が行われています。","type":"noun","meaning_category":"植物"},{"sentence":"Khesari dal is a common dish in some rural areas.","translation":"ケサリのダールは、一部の農村地域で一般的な料理です。","type":"noun","meaning_category":"食品"}]}