{"word":"tracheaectasy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"気管拡張（症）","english_definition":"dilation of the trachea","examples":[],"collocations":[],"synonyms":["tracheomalacia","tracheomegaly"],"antonyms":[],"notes":"This term is relatively rare in modern medical usage. Tracheomalacia or tracheomegaly are more commonly used to describe abnormal dilation of the trachea."}],"etymology":{"value":"From 'trachea' (気管) + '-ectasy' (拡張). The suffix '-ectasy' indicates dilation or expansion of a structure.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtreɪkiːˈɛktəsi/","syllables":"tra-che-a-ec-ta-sy"},"inflection":{"noun_plural":"tracheaectasies"},"usage_notes":{"explanation":"'Tracheaectasy' is a medical term that refers to the dilation or widening of the trachea. However, it is less frequently used than other terms such as 'tracheomalacia' (softening of the trachea) or 'tracheomegaly' (abnormal enlargement of the trachea). When encountering this term, it's important to understand that it describes a condition where the trachea is abnormally wide.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was diagnosed with tracheaectasy due to a bacterial infection.","correct":"✓ The patient was diagnosed with tracheomalacia due to a bacterial infection.","note":"While infection might contribute to tracheal issues, 'tracheomalacia' (softening) is a more common diagnosis in such cases."}],"priority":"★★☆"},"related_words":{"derivatives":["trachea (気管)","ectasy (拡張)","tracheomalacia (気管軟化症)","tracheomegaly (気管巨大症)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (医学専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学文献でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tracheaectasy' is a highly specialized medical term indicating the dilation of the trachea. Due to its infrequent use in general contexts, it is primarily encountered in medical literature or discussions among healthcare professionals. Understanding its meaning requires familiarity with medical terminology, particularly related to respiratory conditions. It is less common than related terms like 'tracheomalacia' or 'tracheomegaly,' which are more frequently used to describe tracheal abnormalities.","priority":"★★☆"},"example_sentences":[{"sentence":"The diagnosis of tracheaectasy was confirmed through bronchoscopy.","translation":"気管支鏡検査により、気管拡張症の診断が確定した。","type":"medical diagnosis","meaning_category":"気管拡張（症）"}]}