{"word":"superstruct","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（既存の構造の上に）さらに構造を構築する、上部構造を構築する","english_definition":"To build or construct something on top of an existing structure; to add a superstructure.","examples":[{"sentence":"They planned to superstruct a new office building on top of the existing parking garage.","translation":"彼らは既存の駐車場の上に新しいオフィスビルを建設することを計画した。"},{"sentence":"The artist superstructed intricate designs onto the basic form of the sculpture.","translation":"その芸術家は彫刻の基本的な形の上に複雑なデザインを構築した。"}],"collocations":["superstruct a building","superstruct a design","superstruct a layer"],"synonyms":["build upon","overlay","overbuild","add to","construct on"],"antonyms":["dismantle","demolish","remove"]},{"part_of_speech":"noun","definition":"上部構造、上層構造、既存の構造の上に構築されたもの","english_definition":"A structure built on top of something else; an addition or overlay to an existing structure.","examples":[{"sentence":"The ship's superstruct was damaged in the storm.","translation":"その船の上部構造は嵐で損傷を受けた。"},{"sentence":"The new regulations added a complex superstruct to the existing legal framework.","translation":"新しい規制は既存の法的枠組みに複雑な上層構造を追加した。"}],"collocations":["ship's superstruct","building's superstruct","complex superstruct"],"synonyms":["superstructure","overlay","addition","extension"],"antonyms":["foundation","base","infrastructure"]}],"etymology":{"value":"\"Super-\" (above, beyond) + \"struct\" (to build, from \"structure\"). Indicates building something on top of or in addition to an existing structure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈstrʌkt/","syllables":"su-per-struct"},"inflection":{"verb_forms":{"present_simple":["superstruct","superstructs"],"past_simple":"superstructed","past_participle":"superstructed","present_participle":"superstructing"},"noun_plural":"superstructs"},"usage_notes":{"explanation":"\"Superstruct\" is often used in technical or architectural contexts to describe the addition of a new structure on top of an existing one. It can also be used metaphorically to describe adding layers or complexities to existing systems or frameworks. The noun form refers to the added structure itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The architect superstructured the building from the ground up.","correct":"✓ The architect constructed the building from the ground up. / ✓ The architect superstructed a new floor on the building.","note":"\"Superstruct\" implies building on an existing structure, not building the entire structure from the ground. Use \"construct\" for the latter. "},{"incorrect":"✗ The superstruct was builded on the old foundation.","correct":"✓ The superstruct was built on the old foundation.","note":"The past participle of \"build\" is \"built\", not \"builded\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["superstructure (noun: a structure built on top of something else)","structure (noun: the arrangement of parts in a complex entity; verb: to construct or organize)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (technical contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"superstruct\" is a relatively uncommon term, primarily used in technical or specialized contexts such as architecture, engineering, or complex system design. It refers to the act of building or adding a structure on top of an existing one, or the structure that results from such an addition. Understanding the prefix \"super-\" (above, beyond) and the root \"struct\" (to build) can help in grasping its meaning. It is not typically encountered in everyday conversation or general writing."},"example_sentences":[{"sentence":"The engineers decided to superstruct a new deck onto the bridge to increase its capacity.","translation":"技術者たちは橋の容量を増やすために、新しい甲板を橋の上に建設することに決めた。","type":"verb","meaning_category":"構築する"},{"sentence":"The ship's superstruct housed the navigation and communication equipment.","translation":"その船の上部構造には航海および通信機器が収容されていた。","type":"noun","meaning_category":"上部構造"},{"sentence":"The company superstructed a new management layer on top of the existing organizational structure.","translation":"会社は既存の組織構造の上に新しい経営層を構築した。","type":"verb (metaphorical)","meaning_category":"構築する (比喩的)"}]}