{"word":"Mahayanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"大乗仏教","english_definition":"One of the two major traditions of Buddhism, now practiced in a variety of forms especially in China, Tibet, Japan, Korea, and Vietnam.","examples":[{"sentence":"Mahayanism emphasizes the path of the bodhisattva, aiming for the liberation of all beings.","translation":"大乗仏教は、すべての存在の解放を目指す菩薩の道を重視します。"},{"sentence":"Zen Buddhism is a school of Mahayanism.","translation":"禅仏教は大乗仏教の一派です。"}],"collocations":["Mahayana Buddhism","Mahayana sutras","practice Mahayanism","schools of Mahayanism"],"synonyms":["Mahayana Buddhism"],"antonyms":["Hinayanism","Theravada Buddhism"]}],"etymology":{"value":"From Sanskrit *mahāyāna* (महायान), literally 'great vehicle'.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈhɑːjɑːnɪzəm/","syllables":"Ma-ha-ya-ni-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Mahayanism is one of the two main branches of Buddhism, the other being Theravada Buddhism. Mahayanism encompasses a wide range of philosophical and religious traditions. It emphasizes the bodhisattva ideal, which is the aspiration to attain Buddhahood not only for oneself but for the sake of all sentient beings. Key concepts include emptiness (sunyata), Buddha-nature, and skillful means (upaya).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Mahayanism is a person.","correct":"✓ Mahayanism is a religion.","note":"Mahayanism refers to a branch of Buddhism, not an individual."},{"incorrect":"✗ Mahayanism is only practiced in India.","correct":"✓ Mahayanism is practiced in China, Japan, Korea, and other countries.","note":"While originating in India, Mahayanism spread to and is primarily practiced in East Asia."}],"priority":"★★☆"},"related_words":{"derivatives":["Mahayana (adjective, noun)","bodhisattva","Buddha","sutra","Zen","Tibetan Buddhism"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily used in academic or religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mahayanism' is a term used in religious studies and philosophy to refer to one of the major branches of Buddhism. It is more complex than basic vocabulary and requires some familiarity with Buddhist concepts. The term is primarily encountered in academic texts, discussions on religion, or when studying Eastern philosophies. Understanding requires grasping concepts like 'bodhisattva' and 'emptiness (sunyata)'."},"example_sentences":[{"sentence":"The spread of Mahayanism significantly influenced the art and culture of East Asia.","translation":"大乗仏教の広がりは、東アジアの芸術と文化に大きな影響を与えました。","type":"noun","meaning_category":"Religious tradition"},{"sentence":"Many Mahayanism schools emphasize meditation and mindfulness practices.","translation":"多くの大乗仏教の宗派は、瞑想とマインドフルネスの実践を重視しています。","type":"noun","meaning_category":"Religious tradition"}]}