{"word":"curbstoner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国で使われる軽蔑的な言葉) 資格のない、または訓練を受けていない不動産業者、特に路上で取引をする人","english_definition":"(primarily US, derogatory) an unqualified or untrained real estate agent, especially one who conducts business on the street.","examples":[{"sentence":"The local real estate board is trying to crack down on curbstoners who operate without a license.","translation":"地元の不動産協会は、無免許で営業する路上不動産業者を取り締まろうとしている。"},{"sentence":"Curbstoners often prey on unsuspecting buyers, offering deals that are too good to be true.","translation":"路上不動産業者はしばしば、疑うことを知らない買い手を食い物にし、あまりにも良い話を持ちかける。"}],"collocations":["unlicensed curbstoner","illegal curbstoner","curbstoner activity"],"synonyms":["unlicensed agent","unqualified realtor"],"antonyms":["licensed agent","qualified realtor"]},{"part_of_speech":"noun","definition":"(自動車) 路上で自動車を売る人","english_definition":"A person who sells cars on the street.","examples":[{"sentence":"The curbstoner had a row of used cars parked along the street.","translation":"路上販売者は、通り沿いに中古車を並べていた。"}],"collocations":["used car curbstoner"],"synonyms":["street car seller"],"antonyms":[]}],"etymology":{"value":"Curbstone（縁石）+ -er（人を示す接尾辞）。文字通りには「縁石で商売をする人」を意味する。不動産業界で使われる場合は、正規のオフィスを持たず、路上で取引を行う無資格業者を指す。自動車販売の場合も同様に、路上で車を販売する人を指す。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkɜːrbstoʊnər/","syllables":"curb-ston-er"},"inflection":{"noun_plural":"curbstoners"},"usage_notes":{"explanation":"「curbstoner」は、主に米国で使われる軽蔑的な言葉で、正規の資格や訓練を受けていない不動産業者や自動車販売業者を指します。これらの業者は、路上やその他の非公式な場所でビジネスを行うことが多く、しばしば消費者を騙す行為に関与しています。不動産業界では、無免許で不動産取引を行う者を指し、自動車販売では、路上で中古車を販売する者を指します。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a curbstoner because he lives near the curb.","correct":"✓ He is a curbstoner because he sells cars on the street without a license.","note":"Curbstonerは縁石の近くに住んでいる人を指すのではなく、路上で無許可で商売をする人を指します。"},{"incorrect":"✗ Curbstoners are always reliable real estate agents.","correct":"✓ Curbstoners are often unreliable real estate agents because they lack proper training and licensing.","note":"Curbstonersは資格や訓練を受けていないため、信頼できないことが多いです。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["curbstoning (名詞: 路上での無許可営業)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**curbstoner**」は、あまり一般的ではない単語で、特に不動産や自動車販売の分野で使われます。これは、正規の免許や資格を持たずに、路上や非公式な場所でビジネスを行う人を指す軽蔑的な言葉です。不動産業界では、無許可で不動産取引を行う者を指し、自動車販売では、路上で中古車を販売する者を指します。この単語は、しばしば不正な行為や信頼性の欠如と関連付けられています。"},"example_sentences":[{"sentence":"The police are trying to shut down the illegal **curbstoner** operation on Main Street.","translation":"警察はメインストリートでの違法な路上販売業者の取り締まりを試みている。","type":"noun","meaning_category":"無許可営業者"},{"sentence":"Be careful when buying a car from a **curbstoner**; they may not disclose all the vehicle's problems.","translation":"路上販売業者から車を買うときは注意してください。車両のすべての問題を明らかにしていない可能性があります。","type":"noun","meaning_category":"無許可営業者"}]}