{"word":"desisters","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"Individuals who once identified as transgender or gender non-conforming but no longer do so.","english_definition":"Individuals who previously identified as transgender or gender non-conforming but have since ceased to identify that way.","examples":[{"sentence":"Some researchers study desisters to understand the complexities of gender identity.","translation":"一部の研究者は、性自認の複雑さを理解するために、ディシスターを研究しています。"},{"sentence":"The experiences of desisters are diverse and should be approached with sensitivity.","translation":"ディシスターの経験は多様であり、慎重にアプローチする必要があります。"}],"collocations":["study of desisters","experiences of desisters","support for desisters"],"synonyms":["retransitioners","detransitioners"],"antonyms":["transgender individuals","transitioners"]}],"etymology":{"value":"Derived from 'desist,' meaning to cease or abstain from doing something, combined with the suffix '-er' to denote a person who desists.","priority":"Medium"},"pronunciation":{"ipa":"/dɪˈzɪstərz/","syllables":"de-sis-ters"},"inflection":{"noun_plural":"desisters","noun_singular":"desister"},"usage_notes":{"explanation":"The term 'desisters' is often used in discussions about transgender identity and detransitioning. It is important to use this term respectfully and avoid generalizations about their experiences.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"Using 'desister' interchangeably with 'detransitioner' without understanding the nuances.","correct":"Recognizing that 'desister' refers specifically to those who no longer identify as transgender, while 'detransitioner' refers to those who have undergone medical or surgical interventions and subsequently reversed them."}],"priority":"Medium"},"related_words":{"derivatives":["desist","detransition","retransition"],"related_terms":["transgender","gender identity","gender dysphoria","detransitioner","retransitioner"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'desisters' is a relatively specialized term used within discussions of gender identity, transgender experiences, and detransitioning. It refers to individuals who once identified as transgender but no longer do so. Understanding this term requires familiarity with broader concepts related to gender identity and the complexities of personal identity development."},"example_sentences":[{"sentence":"The study focused on the lived experiences of **desisters** and their reasons for no longer identifying as transgender.","translation":"その研究は、ディシスターの生きた経験と、彼らがトランスジェンダーとして自己認識しなくなった理由に焦点を当てました。","type":"noun","meaning_category":"Individuals who no longer identify as transgender"},{"sentence":"Support groups are available for **desisters** who may face unique challenges.","translation":"独自の課題に直面する可能性のあるディシスターのためのサポートグループがあります。","type":"noun","meaning_category":"Individuals who no longer identify as transgender"}]}