{"word":"gentleman-farmer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"趣味で農業をする富裕な人、地主農家","english_definition":"a wealthy person who farms as a hobby or for pleasure rather than as a primary source of income.","examples":[{"sentence":"He inherited a large estate and became a gentleman-farmer, raising prize-winning cattle.","translation":"彼は広大な地所を相続し、趣味で農業をする富裕な人となり、品評会で賞を獲得する牛を育てた。"},{"sentence":"The area is populated by gentleman-farmers who enjoy the rural lifestyle.","translation":"その地域は、田舎暮らしを楽しむ地主農家が多く住んでいる。"}],"collocations":["hobby farmer","landed gentry","country squire"],"synonyms":["amateur farmer","hobbyist farmer"],"antonyms":["tenant farmer","peasant farmer","commercial farmer"]},{"part_of_speech":"noun","definition":"（歴史的に）自作農だが、労働を軽視する傾向のある人","english_definition":"(historical) a farmer who owns his own land but tends to disdain manual labor.","examples":[{"sentence":"In the 18th century, many gentleman-farmers relied on hired labor to manage their farms.","translation":"18世紀には、多くの地主農家が農場を管理するために雇われた労働者に頼っていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"「gentleman」と「farmer」の複合語。元々は、収入のために農業をする必要のない、十分な財産を持つ人を指した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒentlmən ˈfɑːrmər/","syllables":"gen-tle-man-far-mer"},"inflection":{"noun_plural":"gentleman-farmers"},"usage_notes":{"explanation":"「gentleman-farmer」は、農業を主な収入源とするのではなく、趣味や楽しみとして農業を行う人を指します。しばしば、相続や他の事業で得た財産を持つ富裕層を指します。歴史的な意味合いとしては、自作農でありながら労働を軽視する傾向のある人を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a gentleman farmer, so he needs to work hard every day.","correct":"✓ He is a gentleman-farmer, so he hires people to do the hard labor.","note":"gentleman-farmer は、趣味で農業をする人なので、必ずしも毎日ハードな労働をするわけではありません。"},{"incorrect":"✗ She is a lady-farmer.","correct":"✓ She is a gentleman-farmer.","note":"性別に関わらず、gentleman-farmerという言葉が使われます。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["landowner","estate owner","squire","landed gentry"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gentleman-farmer\" refers to a person who engages in farming not as a primary occupation or source of income, but as a hobby or for personal enjoyment. This individual typically possesses substantial wealth or comes from a privileged background, allowing them to pursue farming without the financial pressures faced by commercial farmers. The term often carries historical connotations, evoking images of landowners managing estates in a leisurely manner. Understanding the term requires recognizing the distinction between farming as a profession and farming as a pastime for the affluent.","priority":"★★☆"},"example_sentences":[{"sentence":"The gentleman-farmer spent his weekends tending to his vineyards and orchards.","translation":"その地主農家は週末にブドウ園と果樹園の手入れをして過ごした。","type":"example","meaning_category":"趣味で農業をする富裕な人"},{"sentence":"Many gentleman-farmers are passionate about sustainable agriculture and organic farming practices.","translation":"多くの地主農家は、持続可能な農業と有機農法の実践に情熱を注いでいる。","type":"example","meaning_category":"趣味で農業をする富裕な人"}]}