{"word":"unintimately","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"親密でなく、打ち解けずに、個人的な関係なしに","english_definition":"In a manner that is not intimate; without close personal knowledge or familiarity.","examples":[{"sentence":"They worked together for years, but always interacted unintimately.","translation":"彼らは何年も一緒に働いたが、常に親密な関係なしに交流した。"},{"sentence":"The subject was discussed academically, but unintimately, without personal anecdotes.","translation":"その話題は学術的に議論されたが、個人的な逸話なしに、打ち解けずに議論された。"}],"collocations":["interact unintimately","discuss unintimately","know someone unintimately"],"synonyms":["formally","distantly","reservedly","aloofly","coldly"],"antonyms":["intimately","closely","familiarly","warmly","personally"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'intimately'. 'Intimately' comes from 'intimate', which is derived from the Latin 'intimus' (innermost).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈɪntɪmətli/","syllables":"un-in-ti-mate-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unintimately' describes actions or interactions that lack closeness, personal connection, or familiarity. It suggests a formal or distant relationship. It is the opposite of 'intimately'. Use this word to describe how people interact or how subjects are discussed when a personal or close connection is absent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She unintimately knew the details of the project.","correct":"✓ She knew the details of the project unintimately. / ✓ She did not intimately know the details of the project.","note":"'Unintimately' is an adverb, so it modifies verbs, adjectives, or other adverbs, not nouns. The sentence should be restructured to properly use the adverb or rephrased to use 'not intimately'."}],"priority":"★☆☆"},"related_words":{"derivatives":["unintimate (adjective: not intimate)","intimate (adjective: closely acquainted; adverb: in an intimate manner)","intimacy (noun: close familiarity or affection)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unintimately' is an advanced word that describes doing something without personal closeness or familiarity. It's used to show a lack of deep connection or understanding. For example, if you 'discuss a topic unintimately,' you talk about it in a formal or detached way, without sharing personal feelings or experiences. This word is not commonly used, so it's important to understand its meaning clearly before using it in writing or conversation."},"example_sentences":[{"sentence":"The colleagues worked together for years but always related to each other **unintimately**, maintaining a strictly professional distance.","translation":"同僚たちは何年も一緒に働いたが、常に親密な関係を築くことなく、厳格な職業上の距離を保った。","type":"adverb","meaning_category":"親密でなく"},{"sentence":"The historical events were analyzed **unintimately**, focusing on broad trends rather than individual experiences.","translation":"歴史的出来事は、個人の経験よりも広範な傾向に焦点を当てて、打ち解けずに分析された。","type":"adverb","meaning_category":"個人的な関係なしに"}]}