{"word":"zooculture","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"動物園の文化、動物園における動物の飼育・展示方法や、動物園が社会に与える影響などに関する文化的な側面","english_definition":"The culture of zoos, including the ways animals are kept and displayed, and the cultural impact of zoos on society.","examples":[{"sentence":"The study of zooculture examines the ethical considerations of keeping animals in captivity.","translation":"動物園文化の研究は、動物を飼育下で飼うことの倫理的考察を検証する。"},{"sentence":"Changes in zooculture reflect evolving attitudes towards animal welfare.","translation":"動物園文化の変化は、動物福祉に対する意識の変化を反映している。"},{"sentence":"Modern zooculture emphasizes conservation and education.","translation":"現代の動物園文化は、保全と教育を重視している。"}],"collocations":["study of zooculture (動物園文化の研究)","modern zooculture (現代の動物園文化)","ethical zooculture (倫理的な動物園文化)","historical zooculture (歴史的な動物園文化)"],"synonyms":["zoo culture","zoo studies"],"antonyms":[]}],"etymology":{"value":"\"zoo\"（動物園）と \"culture\"（文化）の合成語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzuː.oʊˌkʌltʃər/","syllables":"zoo-o-cul-ture"},"inflection":{"noun_plural":"zoocultures"},"usage_notes":{"explanation":"\"Zooculture\" は比較的新しい学術用語で、動物園を単なる娯楽施設としてではなく、文化的な場所として捉え、その歴史、動物の扱い方、社会における役割などを研究する際に用いられます。動物園の展示方法、動物福祉、教育プログラム、保全活動など、多岐にわたる側面が含まれます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The zooculture is very interesting. (単数として使う場合、具体的な動物園文化を指す場合に限る)","correct":"✓ Zooculture is a fascinating field of study. (学問分野として使う場合)","note":"\"zooculture\" を学問分野として一般的に言及する場合は不可算名詞として扱うことが多い。特定の動物園の文化を指す場合は可算名詞として扱う。"},{"incorrect":"✗ Zooculture is about how to take care of animals. (より広い概念を含む)","correct":"✓ Zooculture encompasses the ethical, social, and historical aspects of zoos.","note":"動物の飼育方法だけでなく、倫理的、社会的、歴史的側面を含む概念であることを明確にする。"}],"priority":"★★☆"},"related_words":{"derivatives":["zoocultural (形容詞: 動物園文化の)"],"related_terms":["zoo","animal welfare","conservation","captivity","exhibit","education","ethics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な学術用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Zooculture\" is a specialized term used in academic contexts to describe the cultural aspects of zoos. It involves examining how zoos represent animals, their impact on society, and the ethical considerations surrounding keeping animals in captivity. This term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor's lecture focused on the history of zooculture and its impact on public perception of animals.","translation":"教授の講義は、動物園文化の歴史と、それが動物に対する大衆の認識に与えた影響に焦点を当てていた。","type":"noun","meaning_category":"動物園の文化"},{"sentence":"A critical analysis of zooculture reveals the evolving role of zoos in conservation efforts.","translation":"動物園文化の批判的分析は、保全活動における動物園の進化する役割を明らかにする。","type":"noun","meaning_category":"動物園の文化"},{"sentence":"The museum exhibit explored the changing trends in zooculture over the past century.","translation":"博物館の展示では、過去1世紀にわたる動物園文化の変化する傾向を探求した。","type":"noun","meaning_category":"動物園の文化"}]}