{"word":"device-dependent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"デバイスに依存する、機器依存の","english_definition":"Relating to or determined by the characteristics of a particular device, especially a computer or electronic device.","examples":[{"sentence":"The color rendering of this image is device-dependent.","translation":"この画像の色再現はデバイスに依存します。"},{"sentence":"Device-dependent software needs to be adapted for each specific type of hardware.","translation":"デバイス依存のソフトウェアは、特定のハードウェアの種類ごとに適合させる必要があります。"},{"sentence":"The output of the sensor is device-dependent and requires calibration.","translation":"センサーの出力はデバイスに依存しており、校正が必要です。"}],"collocations":["device-dependent color","device-dependent driver","device-dependent code","device-dependent software"],"synonyms":["hardware-specific","platform-specific","non-portable"],"antonyms":["device-independent","portable","platform-independent"]}],"etymology":{"value":"The term is formed by combining 'device' (referring to a piece of equipment or mechanism designed to serve a special purpose) with 'dependent' (meaning relying on or determined by something else). It indicates that the functionality or characteristics are contingent on the specific device being used.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvaɪs dɪˈpɛndənt/","syllables":"de-vice de-pen-dent"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Device-dependent' is commonly used in the context of computer hardware, software, and digital imaging. It describes systems or components whose behavior or output varies depending on the specific device they are used with. This is often contrasted with 'device-independent' systems, which are designed to function consistently across different devices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is device dependent, so it will work on all computers.","correct":"✓ The program is device-dependent, so it will only work on certain computers.","note":"Device-dependent means it relies on the specific characteristics of a device, so it won't work on all computers."},{"incorrect":"✗ This is a device-independent driver, so it needs specific drivers.","correct":"✓ This is a device-dependent driver, so it needs specific drivers.","note":"Device-independent drivers do not need specific drivers for each device."}],"priority":"★★☆"},"related_words":{"derivatives":["device","dependent","dependency"],"related_terms":["device-independent","hardware","software","driver","platform"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Device-dependent' is a technical term used to describe something that relies on the specific characteristics of a particular device. This term is often used in computing and engineering contexts. It means that the behavior or performance will change depending on the specific hardware or software being used. It's the opposite of 'device-independent,' which means something works the same way across different devices."},"example_sentences":[{"sentence":"The printer's color output is device-dependent and varies between models.","translation":"プリンターのカラー出力はデバイスに依存しており、モデルによって異なります。","type":"adjective","meaning_category":"機器依存"},{"sentence":"This software library contains device-dependent code for various operating systems.","translation":"このソフトウェアライブラリには、さまざまなオペレーティングシステム用のデバイス依存のコードが含まれています。","type":"adjective","meaning_category":"機器依存"},{"sentence":"Device-dependent calibration is necessary to ensure accurate sensor readings.","translation":"正確なセンサーの読み取りを保証するには、デバイス依存の校正が必要です。","type":"adjective","meaning_category":"機器依存"}]}