{"word":"Coleus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コリウス：シソ科コリウス属の植物の総称。鮮やかな色彩の葉が特徴的な観葉植物。","english_definition":"A genus of flowering plants in the family Lamiaceae (mint family), often cultivated for their brightly colored foliage.","examples":[{"sentence":"Coleus plants are popular for adding color to gardens and containers.","translation":"コリウスは、庭やコンテナに彩りを添えるために人気があります。"},{"sentence":"The leaves of coleus come in a wide variety of colors and patterns.","translation":"コリウスの葉は、さまざまな色と模様があります。"}],"collocations":["coleus plant","coleus leaves","grow coleus","propagate coleus"],"synonyms":["painted nettle","Solenoestemon"],"antonyms":[]},{"part_of_speech":"noun","definition":"コリウス属の植物の一種。","english_definition":"A specific plant belonging to the genus Coleus.","examples":[{"sentence":"This coleus has particularly vibrant red and green leaves.","translation":"このコリウスは特に鮮やかな赤と緑の葉を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'koleos', meaning 'sheath', referring to the fused stamens in the flower of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊliəs/","syllables":"Co-le-us"},"inflection":{"noun_plural":"Coleuses"},"usage_notes":{"explanation":"'Coleus' can refer to the entire genus of plants or a specific plant within that genus. The context usually makes it clear which meaning is intended. They are popular ornamental plants due to their ease of propagation and wide variety of leaf colors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have many coleus in my garden.","correct":"✓ I have many coleuses in my garden.","note":"When referring to multiple plants, use the plural form 'coleuses'."},{"incorrect":"✗ Coleus are a plant that is easy to grow.","correct":"✓ Coleus is a plant that is easy to grow.","note":"When referring to the genus as a whole, use the singular form 'Coleus' as the subject of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["coleone (a chemical compound found in some Coleus species)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Coleus' is a botanical term referring to a genus of plants known for their colorful foliage. While not a common word in everyday conversation, it is frequently used in gardening and horticultural contexts. Understanding the term requires some familiarity with botany or gardening. The word's etymology is from Greek, which is typical of many botanical terms."},"example_sentences":[{"sentence":"The vibrant colors of the **coleus** added a tropical feel to the garden.","translation":"コリウスの鮮やかな色が庭にトロピカルな雰囲気を与えました。","type":"noun","meaning_category":"植物の総称"},{"sentence":"She propagated new **coleus** plants from stem cuttings.","translation":"彼女は茎の挿し木から新しいコリウスを増やしました。","type":"noun","meaning_category":"植物の総称"},{"sentence":"This particular **coleus** has striking magenta and lime green leaves.","translation":"この特定のコリウスは、印象的なマゼンタとライムグリーンの葉を持っています。","type":"noun","meaning_category":"植物の一種"}]}