{"word":"Whiskeytown","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ウィスキータウン：アメリカ合衆国カリフォルニア州北部に存在したゴーストタウン。現在はシャスタ湖に水没。","english_definition":"Whiskeytown: A ghost town formerly located in Northern California, USA, now submerged under Shasta Lake.","examples":[{"sentence":"Whiskeytown was a mining town during the California Gold Rush.","translation":"ウィスキータウンはカリフォルニアのゴールドラッシュ時代に鉱山の町でした。"},{"sentence":"The area where Whiskeytown once stood is now part of the Whiskeytown-Shasta-Trinity National Recreation Area.","translation":"かつてウィスキータウンがあった場所は、現在はウィスキータウン・シャスタ・トリニティ国立レクリエーション地域の一部となっています。"}],"collocations":["Whiskeytown-Shasta-Trinity National Recreation Area (ウィスキータウン・シャスタ・トリニティ国立レクリエーション地域)","Shasta Lake (シャスタ湖)","California Gold Rush (カリフォルニアのゴールドラッシュ)"],"synonyms":["None"],"antonyms":["None"]},{"part_of_speech":"proper noun","definition":"ウィスキータウン：アメリカ合衆国のオルタナカントリーバンド。","english_definition":"Whiskeytown: An American alternative country band.","examples":[{"sentence":"Whiskeytown was fronted by singer-songwriter Ryan Adams.","translation":"ウィスキータウンは、シンガーソングライターのライアン・アダムスが率いていました。"},{"sentence":"Whiskeytown released three studio albums before disbanding.","translation":"ウィスキータウンは解散するまでに3枚のスタジオアルバムをリリースしました。"}],"collocations":["Ryan Adams (ライアン・アダムス)","alternative country (オルタナカントリー)","band (バンド)","album (アルバム)"],"synonyms":["None"],"antonyms":["None"]}],"etymology":{"value":"町の名前の由来は諸説あり、一つは、初期の入植者がインディアンとウィスキーを交換したことから名付けられたという説。バンド名は、この町名に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪskiˌtaʊn/","syllables":"Whis-key-town"},"inflection":{"notes":"固有名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**Whiskeytown**」は、カリフォルニア州のゴーストタウンの名前と、その名前を由来とするバンドの名前の両方を指します。文脈によってどちらの意味で使われているか判断する必要があります。ゴーストタウンとしてのウィスキータウンは、シャスタ湖の建設によって水没した歴史的な場所であり、現在は国立レクリエーション地域の一部となっています。バンドとしてのウィスキータウンは、1990年代後半から2000年代初頭にかけて活動したオルタナカントリーバンドで、ライアン・アダムスが中心メンバーでした。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to visit Whiskeytown next week for the music festival.","correct":"✓ I'm going to visit the Whiskeytown-Shasta-Trinity National Recreation Area next week.","note":"音楽フェスティバルはウィスキータウンという町ではなく、国立レクリエーション地域で行われることが多いです。"},{"incorrect":"✗ Whiskeytown is still a thriving town in California.","correct":"✓ Whiskeytown is a ghost town in California, now submerged under Shasta Lake.","note":"ウィスキータウンは現在は水没したゴーストタウンです。"}],"priority":"★★☆"},"related_words":{"derivatives":["None"],"phrasal_verbs":["None"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"比較的中頻度 (Moderately frequent) - 特に音楽ファンやカリフォルニアの歴史に関心のある人にとっては知られている。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「**Whiskeytown**」は、アメリカ合衆国カリフォルニア州にあったゴーストタウンの名前、およびその名前に由来するオルタナカントリーバンドの名前です。ゴーストタウンとしてのウィスキータウンは、シャスタ湖の建設によって水没し、現在はウィスキータウン・シャスタ・トリニティ国立レクリエーション地域の一部となっています。バンドとしてのウィスキータウンは、ライアン・アダムスが率いる人気のあるバンドでした。どちらの意味で使われているかは文脈によって判断する必要があります。"},"example_sentences":[{"sentence":"We visited the site of old **Whiskeytown** during our trip to Shasta Lake.","translation":"シャスタ湖への旅行中に、私たちは古いウィスキータウンの跡地を訪れました。","type":"proper noun","meaning_category":"ゴーストタウン"},{"sentence":"**Whiskeytown's** album 'Strangers Almanac' is considered a classic of the alternative country genre.","translation":"ウィスキータウンのアルバム「ストレンジャーズ・アルマナック」は、オルタナカントリーのジャンルの古典とみなされています。","type":"proper noun","meaning_category":"バンド"}]}