{"word":"myrmecophile","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"好蟻性生物、アリを好む生物","english_definition":"An organism that lives in association with ants, often benefiting from the relationship.","examples":[{"sentence":"The beetle is a myrmecophile, living in ant nests and feeding on ant larvae.","translation":"その甲虫は好蟻性生物で、アリの巣に住み、アリの幼虫を食べている。"},{"sentence":"Many species of aphids are myrmecophiles, providing honeydew to ants in exchange for protection.","translation":"アブラムシの多くの種は好蟻性生物で、保護の代わりにアリに甘露を提供している。"}],"collocations":["obligate myrmecophile (絶対好蟻性生物)","facultative myrmecophile (条件的好蟻性生物)","myrmecophilous plant (好蟻性植物)"],"synonyms":["ant-loving organism"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'myrmex' (ant) and 'philos' (loving).","priority":"★★★"},"pronunciation":{"ipa":"/mɜːrˈmɛkəfaɪl/","syllables":"myr-me-co-phile"},"inflection":{"noun_plural":"myrmecophiles"},"usage_notes":{"explanation":"Myrmecophiles can have various types of relationships with ants, ranging from mutualism (both benefit) to parasitism (only the myrmecophile benefits). The term is commonly used in entomology and ecology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The myrmecophile was afraid of the ants.","correct":"✓ The myrmecophile benefited from its relationship with the ants.","note":"Myrmecophiles are not afraid of ants; they have a relationship with them, often beneficial."}],"priority":"★☆☆"},"related_words":{"derivatives":["myrmecophily (noun: the association of an organism with ants)","myrmecophilous (adjective: ant-loving, associated with ants)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'myrmecophile' is a specialized term used in biology, specifically in entomology and ecology. It refers to an organism that lives in association with ants. Understanding this word requires knowledge of biological relationships and ecological interactions. The word is not commonly used in everyday language."},"example_sentences":[{"sentence":"This plant is a myrmecophile, relying on ants to disperse its seeds.","translation":"この植物は好蟻性植物で、種子の散布をアリに頼っている。","type":"noun","meaning_category":"好蟻性生物"},{"sentence":"The larvae of this butterfly are myrmecophiles, living within ant colonies.","translation":"この蝶の幼虫は好蟻性生物で、アリのコロニーの中に住んでいる。","type":"noun","meaning_category":"好蟻性生物"}]}