{"word":"orthodoxally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"正統的に、伝統的に、慣習的に","english_definition":"In an orthodox manner; according to established or traditional rules, principles, or beliefs.","examples":[{"sentence":"The problem was approached orthodoxally, following the established procedures.","translation":"その問題は、確立された手順に従い、正統的に対処された。"},{"sentence":"The church is orthodoxally structured, adhering to the ancient traditions.","translation":"その教会は、古代の伝統を遵守し、正統的に構成されている。"},{"sentence":"The dish was prepared orthodoxally, using only the traditional ingredients and methods.","translation":"その料理は、伝統的な材料と方法のみを使用し、正統的に調理された。"}],"collocations":["orthodoxally structured","orthodoxally prepared","orthodoxally approached"],"synonyms":["traditionally","conventionally","formally","strictly","dogmatically","customarily"],"antonyms":["unconventionally","untraditionally","heterodoxly","innovatively","unorthodoxy"]}],"etymology":{"value":"The word \"orthodoxally\" is derived from \"orthodox,\" which comes from the Greek words \"orthos\" (straight, correct) and \"doxa\" (opinion, belief). The suffix \"-ally\" turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθəˈdɒksəli/","syllables":"or-tho-dox-al-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb \"orthodoxally\" describes actions or processes that adhere strictly to established or traditional rules, beliefs, or practices. It implies a commitment to maintaining the status quo and avoiding deviation from accepted norms. It is often used in contexts involving religion, culture, or methodology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was orthodoxally, it followed all the rules of the period.","correct":"✓ The painting was done orthodoxally; it followed all the rules of the period.","note":"The adverb 'orthodoxally' should modify the verb 'done' or 'painted' to correctly describe how the action was performed."},{"incorrect":"✗ He orthodoxally believes in the power of prayer.","correct":"✓ He believes orthodoxally in the power of prayer. / ✓ He has orthodox beliefs about the power of prayer.","note":"The adverb should modify the verb 'believes' to describe the manner of belief, or the adjective 'orthodox' should be used to describe the beliefs themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["orthodox (adjective)","orthodoxy (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'orthodoxally' is an adverb that means 'in an orthodox manner.' This means doing something according to traditional or established rules and beliefs. It is more commonly used in formal or academic contexts. Understanding this word requires a good grasp of the root word 'orthodox,' which means conforming to what is traditionally accepted as right or true.","priority":"★★☆"},"example_sentences":[{"sentence":"The research was conducted orthodoxally, adhering strictly to the scientific method.","translation":"その研究は、科学的方法に厳密に従い、正統的に実施された。","type":"adverb","meaning_category":"traditionally"},{"sentence":"The traditional ceremony was performed orthodoxally, preserving every detail.","translation":"伝統的な儀式は、細部まで保存され、正統的に行われた。","type":"adverb","meaning_category":"conventionally"},{"sentence":"The company orthodoxally follows the financial regulations.","translation":"その会社は財務規制を正統的に遵守している。","type":"adverb","meaning_category":"strictly"}]}