{"word":"screen-addicted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"画面中毒の、スクリーン中毒の","english_definition":"Habitually spending excessive time looking at screens, such as those of televisions, computers, smartphones, or tablets.","examples":[{"sentence":"My son is screen-addicted and spends all his free time playing video games.","translation":"私の息子は画面中毒で、自由時間のすべてをビデオゲームに費やしています。"},{"sentence":"Many teenagers are screen-addicted and struggle to balance screen time with other activities.","translation":"多くのティーンエイジャーはスクリーン中毒で、スクリーン時間と他の活動とのバランスを取るのに苦労しています。"},{"sentence":"The doctor warned that excessive screen time could lead to children becoming screen-addicted.","translation":"医師は、過度のスクリーン時間は子供たちが画面中毒になる可能性があると警告しました。"}],"collocations":["become screen-addicted (画面中毒になる)","screen-addicted child (画面中毒の子供)","screen-addicted teenager (画面中毒のティーンエイジャー)","screen-addicted generation (画面中毒の世代)","screen-addicted behavior (画面中毒の行動)"],"synonyms":["addicted to screens","hooked on screens","obsessed with screens","dependent on screens","digitally addicted"],"antonyms":["screen-free","uninterested in screens","not addicted to screens","having a healthy screen time balance"]},{"part_of_speech":"adjective","definition":"（比喩的に）画面に過度に依存している、画面中心の","english_definition":"(Figuratively) Overly reliant on screens or digital devices for entertainment, information, or social interaction.","examples":[{"sentence":"Our society is becoming increasingly screen-addicted, with people spending more time online than engaging in real-world interactions.","translation":"私たちの社会はますます画面中毒になっており、人々は現実世界での交流よりもオンラインで過ごす時間が増えています。"},{"sentence":"The screen-addicted culture has led to a decline in face-to-face communication skills.","translation":"画面中毒の文化は、対面コミュニケーション能力の低下につながっています。"}],"collocations":["screen-addicted society (画面中毒の社会)","screen-addicted culture (画面中毒の文化)"],"synonyms":["digitally dependent","technology-reliant","screen-obsessed"],"antonyms":["analog","offline","real-world"]}],"etymology":{"value":"The term is a compound word formed by combining \"screen\" (referring to the display of electronic devices) and \"addicted\" (meaning compulsively dependent on something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskriːn əˈdɪktɪd/","syllables":"screen-ad-dic-ted"},"inflection":{"notes":"This is an adjective and does not have different forms for inflection."},"usage_notes":{"explanation":"\"**screen-addicted**\" is typically used to describe individuals or societies that spend an excessive amount of time using electronic devices with screens, such as smartphones, tablets, computers, and televisions. It often implies a negative impact on physical health, mental well-being, social interactions, and overall lifestyle. The term can be used in both a literal and a figurative sense.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is screen addict.","correct":"✓ He is screen-addicted.","note":"\"Screen-addicted\" is an adjective, so it should be used to describe someone. \"Screen addict\" can be used as a noun, but \"screen-addicted\" is more common as an adjective. Alternatively, \"He is addicted to screens\" is also correct."},{"incorrect":"✗ She has a screen-addict life.","correct":"✓ She has a screen-addicted life.","note":"The adjective \"screen-addicted\" should be used to describe the noun \"life.\""}],"priority":"★★☆"},"related_words":{"derivatives":["screen addiction (名詞: 画面中毒)","screen time (名詞: スクリーン時間)"],"related_terms":["digital addiction","internet addiction","gaming addiction","social media addiction","technology addiction"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to the rise of digital devices.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"**screen-addicted**\" is used to describe someone who spends too much time looking at screens, like those on phones, computers, or TVs. It's often used when this behavior is seen as a problem, affecting their health, relationships, or other activities. It's a compound word that combines \"screen\" and \"addicted,\" so understanding those two words helps to understand the meaning of the whole term."},"example_sentences":[{"sentence":"The therapist specializes in helping **screen-addicted** teenagers overcome their dependence on technology.","translation":"そのセラピストは、画面中毒のティーンエイジャーがテクノロジーへの依存を克服するのを専門としています。","type":"adjective","meaning_category":"Habitually spending excessive time looking at screens"},{"sentence":"The study examined the effects of **screen-addicted** behavior on children's cognitive development.","translation":"その研究は、画面中毒の行動が子供の認知発達に与える影響を調査しました。","type":"adjective","meaning_category":"Habitually spending excessive time looking at screens"},{"sentence":"Parents are concerned about the **screen-addicted** culture and its impact on their children.","translation":"親たちは、画面中毒の文化とその子供たちへの影響を懸念しています。","type":"adjective","meaning_category":"(Figuratively) Overly reliant on screens or digital devices"}]}