{"word":"Eurasian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ユーラシア人：ヨーロッパ人とアジア人の混血の人、またはユーラシア大陸の出身者","english_definition":"A person of mixed European and Asian descent; or a native or inhabitant of Eurasia.","examples":[{"sentence":"She identifies as Eurasian, with a British father and a Chinese mother.","translation":"彼女はイギリス人の父親と中国人の母親を持つユーラシア人であると認識しています。"},{"sentence":"The Eurasian landmass is the largest on Earth.","translation":"ユーラシア大陸は地球上で最も大きい陸塊です。"}],"collocations":["mixed Eurasian","full Eurasian","Eurasian culture","Eurasian continent","Eurasian landmass"],"synonyms":["mixed-race","bi-racial"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ユーラシアの、ユーラシア人の、ヨーロッパ人とアジア人の混血の","english_definition":"Relating to Eurasia or its people; of mixed European and Asian descent.","examples":[{"sentence":"Eurasian culture is a blend of Eastern and Western traditions.","translation":"ユーラシアの文化は東洋と西洋の伝統が混ざり合っています。"},{"sentence":"The Eurasian population in Singapore has a unique history.","translation":"シンガポールのユーラシア人の人口は独特の歴史を持っています。"}],"collocations":["Eurasian culture","Eurasian history","Eurasian languages","Eurasian identity"],"synonyms":["mixed-race","bi-racial"],"antonyms":[]}],"etymology":{"value":"\"Eurasia\" (ヨーロッパとアジアを合わせた大陸名) + \"-an\" (形容詞・名詞を作る接尾辞)","priority":"★★★"},"pronunciation":{"ipa":"/jʊˈreɪʒən/","syllables":"Eu-ra-sian"},"inflection":{"noun_plural":"Eurasians"},"usage_notes":{"explanation":"The term \"Eurasian\" can refer to a person of mixed European and Asian ancestry, or to anything related to the continent of Eurasia. It's important to be sensitive when using this term, as some individuals may prefer to identify with a specific ethnicity or nationality rather than a broader label.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a European and Asian.","correct":"✓ She is Eurasian.","note":"\"Eurasian\" is a specific term for someone of mixed European and Asian descent."},{"incorrect":"✗ Eurasian is a country.","correct":"✓ Eurasia is a continent. / ✓ Eurasian refers to people or things related to Eurasia.","note":"Eurasia is a continent, not a country. Eurasian describes something related to Eurasia or its people."}],"priority":"★★☆"},"related_words":{"derivatives":["Eurasia"],"phrasal_verbs":[],"related_terms":["Asian","European","mixed-race","bi-racial"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Eurasian\" is used to describe people who have both European and Asian ancestors. It can also refer to things related to the continent of Eurasia, which is the combined landmass of Europe and Asia. The term is not as common as \"Asian\" or \"European,\" but it's important to understand its meaning when you encounter it. Be mindful that some people may have strong feelings about how they are identified, so it's always best to be respectful and use the terms they prefer."},"example_sentences":[{"sentence":"The Eurasian girl had striking features, a blend of her mother's Korean heritage and her father's Irish roots.","translation":"そのユーラシア人の少女は、母親の韓国の血筋と父親のアイルランドのルーツが混ざり合った、印象的な顔立ちをしていた。","type":"noun","meaning_category":"Person of mixed European and Asian descent"},{"sentence":"The Eurasian steppe has been a historical crossroads for many cultures and civilizations.","translation":"ユーラシアのステップ地帯は、歴史的に多くの文化や文明の交差点となってきた。","type":"adjective","meaning_category":"Relating to Eurasia"}]}