{"word":"hydrobiologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水生生物学者、水生生物学研究者","english_definition":"A scientist who studies hydrobiology, the biology of aquatic ecosystems.","examples":[{"sentence":"The hydrobiologist studied the effects of pollution on the river's ecosystem.","translation":"その水生生物学者は、汚染が川の生態系に与える影響を研究した。"},{"sentence":"Hydrobiologists often work in the field, collecting samples from lakes and streams.","translation":"水生生物学者は、湖や小川からサンプルを収集するために、しばしば野外で活動する。"},{"sentence":"She is a leading hydrobiologist, known for her research on freshwater invertebrates.","translation":"彼女は淡水無脊椎動物の研究で知られる、著名な水生生物学者である。"}],"collocations":["study hydrobiology","research aquatic ecosystems","collect samples","analyze water quality","assess environmental impact"],"synonyms":["aquatic biologist","limnologist (freshwater)","marine biologist (saltwater)"],"antonyms":[]}],"etymology":{"value":"The word \"hydrobiologist\" is formed from \"hydro-\" (from Greek ὕδωρ hýdōr 'water'), \"biology\" (from Greek βίος bios 'life' + -λογία -logia 'study of'), and the suffix \"-ist\" (denoting a person who studies or is an expert in a particular field).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊbaɪˈɒlədʒɪst/","syllables":"hy-dro-bi-ol-o-gist"},"inflection":{"noun_plural":"hydrobiologists"},"usage_notes":{"explanation":"A hydrobiologist is a scientist specializing in the study of life and biological processes in aquatic environments. This includes freshwater (rivers, lakes, ponds) and saltwater (oceans, estuaries, coral reefs) ecosystems. Their work can involve studying the interactions between aquatic organisms, the impact of pollution on aquatic life, and the conservation of aquatic habitats.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hydrobiology.","correct":"✓ He is a hydrobiologist.","note":"\"Hydrobiology\" is the field of study, while \"hydrobiologist\" is the person who studies it. Use the correct noun form."},{"incorrect":"✗ Hydrobiologists study only marine life.","correct":"✓ Hydrobiologists study both freshwater and marine life.","note":"Hydrobiologists study all aquatic ecosystems, including both freshwater and marine environments."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrobiology (noun: the study of aquatic ecosystems)","hydrobiological (adjective: relating to hydrobiology)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hydrobiologist\" refers to a specialized scientist who investigates the biology of aquatic environments. This involves studying the organisms that live in water, their interactions with each other, and the impact of environmental factors on these ecosystems. Understanding this term requires familiarity with scientific vocabulary and concepts related to biology and ecology."},"example_sentences":[{"sentence":"The **hydrobiologist** used advanced techniques to analyze the DNA of the microorganisms in the lake.","translation":"その水生生物学者は、湖にいる微生物のDNAを分析するために高度な技術を使用した。","type":"general","meaning_category":"general"},{"sentence":"As a **hydrobiologist**, she is dedicated to protecting endangered aquatic species.","translation":"水生生物学者として、彼女は絶滅危惧種の水生生物の保護に尽力している。","type":"career","meaning_category":"career"},{"sentence":"The **hydrobiologist's** research provided critical data for the river restoration project.","translation":"その水生生物学者の研究は、川の再生プロジェクトに不可欠なデータを提供した。","type":"research","meaning_category":"research"}]}