{"word":"Impositions","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)押しつけ、無理強い、課税、負担","english_definition":"plural form of imposition: the action of imposing something; something imposed, such as a tax or burden.","examples":[{"sentence":"The government's new regulations were seen as impositions on small businesses.","translation":"政府の新しい規制は中小企業への押しつけだと見なされた。"},{"sentence":"The impositions of the occupation forces were deeply resented by the local population.","translation":"占領軍による無理強いは地元住民から深く恨まれた。"},{"sentence":"The new impositions on imported goods are designed to protect domestic industries.","translation":"輸入品に対する新たな課税は国内産業を保護するために設計されている。"},{"sentence":"The constant demands on her time were becoming unbearable impositions.","translation":"彼女の時間に対する絶え間ない要求は耐え難い負担になりつつあった。"}],"collocations":["tax impositions (税の賦課)","regulatory impositions (規制の押しつけ)","financial impositions (経済的負担)","undue impositions (過度の負担)"],"synonyms":["burdens","obligations","demands","levies","taxes","encroachments","infringements"],"antonyms":["freedoms","liberations","exemptions","reliefs"]}],"etymology":{"value":"The word \"imposition\" comes from the Latin word \"imponere,\" which means \"to lay on, put on, inflict.\" It is formed from \"in-\" (upon) and \"ponere\" (to put, place). The plural form, \"impositions,\" refers to multiple instances of imposing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪmpəˈzɪʃənz/","syllables":"im-po-si-tionz"},"inflection":{"noun_plural":"impositions"},"usage_notes":{"explanation":"\"Impositions\" refers to multiple instances of something being imposed, such as taxes, rules, or burdens. It often carries a negative connotation, suggesting that these things are unwelcome or unfair. The term can be used in various contexts, including politics, economics, and personal relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The imposition were unfair.","correct":"✓ The impositions were unfair.","note":"Since \"impositions\" is plural, the verb should also be plural (were)."},{"incorrect":"✗ He felt the imposition on his freedom.","correct":"✓ He felt the impositions on his freedom.","note":"When referring to multiple instances or types of restrictions, use the plural form \"impositions.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["impose (verb)","imposing (adjective)","impositional (adjective)"],"phrasal_verbs":[],"related_nouns":["imposer"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"impositions\" is a formal term referring to multiple instances of imposing something, such as taxes, rules, or burdens. It often carries a negative connotation, suggesting that these things are unwelcome or unfair. This word is more commonly used in academic, legal, or political contexts. Understanding the root word \"impose\" is helpful in grasping the meaning of \"impositions.\""},"example_sentences":[{"sentence":"The new tax impositions sparked widespread protests.","translation":"新たな税の賦課は広範囲にわたる抗議を引き起こした。","type":"noun (plural)","meaning_category":"課税・負担"},{"sentence":"The constant impositions on their time made it difficult to complete the project.","translation":"彼らの時間に対する絶え間ない押しつけが、プロジェクトの完了を困難にした。","type":"noun (plural)","meaning_category":"押しつけ・無理強い"},{"sentence":"The regulatory impositions were designed to protect the environment.","translation":"規制の押しつけは環境を保護するために設計された。","type":"noun (plural)","meaning_category":"押しつけ・無理強い"},{"sentence":"The impositions of the occupying army were harsh and unforgiving.","translation":"占領軍による無理強いは厳しく、容赦がなかった。","type":"noun (plural)","meaning_category":"押しつけ・無理強い"}]}