{"word":"Heathkit","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ヒースキット：かつて存在したアメリカ合衆国の電子機器メーカー、および同社が販売していた組み立てキット製品。","english_definition":"A brand of electronic kits and products formerly sold by the Heath Company.","examples":[{"sentence":"Many hobbyists in the 1960s and 1970s built their own ham radios and stereo equipment from Heathkits.","translation":"1960年代から1970年代にかけて、多くのアマチュアはヒースキットを使って独自のハムラジオやステレオ機器を組み立てました。"},{"sentence":"Heathkit products were known for their detailed manuals and educational value.","translation":"ヒースキット製品は、詳細なマニュアルと教育的価値で知られていました。"}],"collocations":["Heathkit amplifier","Heathkit multimeter","build a Heathkit"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Heathkit' comes from the Heath Company, which was originally an aircraft parts supplier. After World War II, they transitioned to selling surplus parts and then electronic kits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhiːθˌkɪt/","syllables":"Heath-kit"},"inflection":{"noun_plural":"Heathkits"},"usage_notes":{"explanation":"'Heathkit' refers specifically to the products of the Heath Company, which were kits that customers assembled themselves. The company is no longer in its original form, but the name is still recognized by electronics enthusiasts.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_companies":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in historical contexts related to electronics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heathkit' is a specialized term related to a specific brand of electronic kits. Understanding requires familiarity with electronics history and hobbyist culture. It is not a common word in general conversation.","priority":"N/A"},"example_sentences":[{"sentence":"My grandfather built a Heathkit shortwave radio in the 1970s.","translation":"私の祖父は1970年代にヒースキットの短波ラジオを組み立てました。","type":"noun","meaning_category":"product"},{"sentence":"The Heathkit manuals were famous for their clarity and thoroughness.","translation":"ヒースキットのマニュアルは、その明瞭さと徹底さで有名でした。","type":"noun","meaning_category":"product"}]}