{"word":"shifty-gazed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人について)落ち着きなく視線をそらす、目を泳がせる、疑わしい、信用できない","english_definition":"(of a person) having eyes that dart around nervously, suggesting dishonesty or untrustworthiness.","examples":[{"sentence":"The shifty-gazed man avoided eye contact.","translation":"その目を泳がせる男は、目を合わせるのを避けた。"},{"sentence":"I didn't trust him; he seemed shifty-gazed and evasive.","translation":"私は彼を信用しなかった。彼は目を泳がせ、ごまかしているように見えたからだ。"},{"sentence":"The witness described the suspect as shifty-gazed and fidgety.","translation":"目撃者は、容疑者を落ち着きなく視線をそらし、そわそわしていると説明した。"}],"collocations":["shifty-gazed and nervous (目を泳がせ、神経質そうな)","shifty-gazed and evasive (目を泳がせ、ごまかしがちな)","shifty-gazed expression (落ち着きなく視線をそらす表情)"],"synonyms":["evasive","furtive","untrustworthy","suspicious","shifty-eyed","dodgy"],"antonyms":["trustworthy","honest","forthright","direct","steady-gazed"],"notes":["Often used to describe someone who is trying to hide something or is not being truthful.","The term implies a lack of confidence and possible guilt."]}],"etymology":{"value":"Combination of 'shifty' (deceptive, evasive) and 'gazed' (having a particular look). The term suggests that the person's gaze is not steady or direct, indicating a lack of trustworthiness.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈʃɪfti ɡeɪzd/","syllables":"shif-ty-gazed"},"inflection":{"notes":"Adjective, does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Shifty-gazed' is used to describe someone whose eyes move around a lot, often because they are nervous, dishonest, or trying to hide something. It's a descriptive term that conveys a sense of unease or suspicion about the person being described.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was shifty-gazed at the wall.","correct":"✓ He was shifty-gazed.","note":"The adjective describes the person, not their action towards something. Avoid adding a prepositional phrase indicating a direction."},{"incorrect":"✗ The shifty-gazed.","correct":"✓ The shifty-gazed man/person.","note":"The term requires a noun to describe. It cannot stand alone as a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["shifty (adjective: deceptive, evasive)","gaze (noun: a fixed look; verb: to look steadily and intently)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Shifty-gazed' is a relatively uncommon and descriptive adjective used to describe someone whose eyes move around nervously, suggesting they are being dishonest or untrustworthy. It is more likely to be found in literature or detailed descriptions rather than everyday conversation. The term implies a lack of confidence and possible guilt."},"example_sentences":[{"sentence":"The detective noticed the suspect's shifty-gazed demeanor during the interrogation.","translation":"刑事は尋問中、容疑者の落ち着きなく視線をそらす様子に気づいた。","type":"descriptive","meaning_category":"suspicious"},{"sentence":"Her shifty-gazed expression made it clear she was hiding something.","translation":"彼女の落ち着きなく視線をそらす表情は、何かを隠していることを明らかにした。","type":"descriptive","meaning_category":"untrustworthy"}]}