{"word":"income-assessed","meanings":[{"part_of_speech":"adjective","definition":"所得に応じて査定される、所得に基づいて評価される","english_definition":"Having a value or amount determined based on an individual's or entity's income.","examples":[{"sentence":"The tuition fees are income-assessed, meaning families with higher incomes pay more.","translation":"授業料は所得に応じて査定され、つまり所得の高い家庭ほど多く支払うことになります。"},{"sentence":"The government offers income-assessed loans to students.","translation":"政府は学生に所得に応じて査定されるローンを提供しています。"}],"collocations":["income-assessed rent (所得に応じて査定される家賃)","income-assessed fees (所得に応じて査定される料金)","income-assessed loan (所得に応じて査定されるローン)","income-assessed contribution (所得に応じて査定される寄付金)"],"synonyms":["means-tested","income-related","income-based"],"antonyms":["flat-rate","fixed-rate","universal"],"related_words":["income (所得)","assessment (査定)","means-testing (資産調査)"]}],"etymology":{"value":"'Income' (所得) + 'assessed' (査定された) の組み合わせ。所得に基づいて評価額が決定されることを意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪnkʌm əˈsɛst/","syllables":"in-come-as-sessed"},"usage_notes":{"explanation":"'Income-assessed' は、特定の給付、料金、または税金が、個人のまたは団体の所得に基づいて計算または決定されることを指します。これは、より公平なシステムを構築し、経済的に余裕のある人がより多くを負担できるようにするために使用されます。","priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'income-assessed' is used to describe systems where the amount someone pays for something (like tuition or rent) or the amount they receive (like a loan) is based on their income. This ensures that those with higher incomes contribute more, while those with lower incomes pay less or receive more support. It's a term often encountered in discussions about social welfare, education, and housing policies."},"example_sentences":[{"sentence":"The childcare subsidy is income-assessed to ensure that it reaches those who need it most.","translation":"保育補助金は、最も必要としている人に確実に届くように、所得に応じて査定されます。","type":"general","meaning_category":"general"},{"sentence":"The university's financial aid program includes income-assessed grants and scholarships.","translation":"大学の財政援助プログラムには、所得に応じて査定される助成金と奨学金が含まれています。","type":"education","meaning_category":"education"}]}