{"word":"Varietally","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"Relating to a single variety of grape or other plant.","english_definition":"In terms of a specific variety of plant, especially grapes.","examples":[{"sentence":"The wine was varietally labeled as Cabernet Sauvignon.","translation":"そのワインは、品種名としてカベルネ・ソーヴィニヨンと表示されていた。"},{"sentence":"This vineyard is varietally diverse, with several different grape types.","translation":"このブドウ園は品種が多様で、いくつかの異なるブドウ種が存在する。"}],"collocations":["varietally pure","varietally correct","varietally distinct","varietally labeled"],"synonyms":["by variety","by cultivar","by type"],"antonyms":[]}],"etymology":{"value":"Derived from 'varietal,' which comes from 'variety.'","priority":"N/A"},"pronunciation":{"ipa":"/ˌveəriˈaɪtəli/","syllables":"Var-i-e-tal-ly"},"inflection":{},"usage_notes":{"explanation":"'Varietally' is primarily used in the context of wine and other agricultural products to describe something related to the specific variety of the plant. It emphasizes that the characteristic or quality being described is linked to the unique attributes of that particular variety.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The wine tasted varietally.","correct":"✓ The wine tasted like the varietal.","note":"'Varietally' is an adverb, so it should modify a verb. If you want to describe the taste, it's better to say 'tasted like the varietal' or use an adjective."}],"priority":"N/A"},"related_words":{"derivatives":["varietal","variety"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Varietally' is a specialized term primarily used in the context of wine and agriculture. It describes something related to the specific variety of a plant, especially grapes. Understanding this term requires familiarity with wine terminology and agricultural practices."},"example_sentences":[{"sentence":"The grapes were varietally sorted to ensure only the best fruit was used.","translation":"最高の果実だけを使用するために、ブドウは品種ごとに選別された。","type":"adverb","meaning_category":"Relating to a single variety"}]}