{"word":"Ametaboly","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不変態","english_definition":"A type of insect development in which the young are similar in form to the adults, except for size and sexual maturity, and there is no metamorphosis.","examples":[{"sentence":"Silverfish exhibit ametaboly, with nymphs resembling miniature adults.","translation":"シミは不変態を示し、幼虫は小型の成虫に似ています。"}],"collocations":["ametabolous insect","ametabolous development"],"synonyms":["direct development","no metamorphosis"],"antonyms":["metamorphosis","hemimetaboly","holometaboly"]}],"etymology":{"value":"From the Greek 'a-' (not), 'metabole' (change), and '-y' (state or condition), referring to the absence of significant metamorphosis.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪˌmɛtəˈboʊli/","syllables":"A-me-ta-bo-ly"},"inflection":{"noun_plural":"Ametabolies"},"usage_notes":{"explanation":"Ametaboly is a term used in entomology to describe a specific type of insect development. It is characterized by the absence of a true metamorphosis, where the young (nymphs) gradually grow and molt, eventually reaching adult size and sexual maturity without undergoing drastic changes in body form.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ametaboly is when insects have a pupal stage.","correct":"✓ Ametaboly is when insects do not have a pupal stage.","note":"Ametaboly is characterized by the absence of a pupal stage, unlike holometabolous insects."}],"priority":"★★☆"},"related_words":{"derivatives":["ametabolous (adjective)"],"related_terms":["Hemimetaboly","Holometaboly","Metamorphosis","Insect development"],"priority":"★★★"},"level_frequency":{"level":"Specialized (Entomology)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"Advanced","text":"'Ametaboly' is a technical term used in the field of entomology to describe a type of insect development where there is no significant metamorphosis. The young insects, called nymphs, resemble smaller versions of the adults and gradually grow through molting. This term is typically encountered in scientific literature related to insect biology and development."},"example_sentences":[{"sentence":"The primitive insect orders, such as Thysanura (silverfish), exhibit **ametaboly**.","translation":"シミなどの原始的な昆虫目は、不変態を示します。","type":"scientific","meaning_category":"insect development"},{"sentence":"In **ametaboly**, the nymphs and adults occupy similar ecological niches.","translation":"不変態では、幼虫と成虫は同様の生態的ニッチを占めます。","type":"ecological","meaning_category":"insect ecology"}]}