{"word":"Sinicization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中国化、漢化","english_definition":"The process whereby non-Chinese societies come under the influence of Chinese culture, particularly in language, cultural practices, and ethnic identity.","examples":[{"sentence":"The Sinicization of Japan began centuries ago.","translation":"日本の中国化は何世紀も前に始まった。"},{"sentence":"There are debates about the extent of Sinicization in Southeast Asia.","translation":"東南アジアにおける中国化の程度については議論がある。"},{"sentence":"The government's policies are aimed at the Sinicization of ethnic minorities.","translation":"政府の政策は、少数民族の中国化を目的としている。"}],"collocations":["cultural Sinicization (文化的な中国化)","political Sinicization (政治的な中国化)","forced Sinicization (強制的な中国化)","gradual Sinicization (段階的な中国化)"],"synonyms":["Chinafication","Chinese assimilation","cultural assimilation"],"antonyms":["De-Sinicization","Westernization","Acculturation"]},{"part_of_speech":"noun","definition":"（言語学）中国語化","english_definition":"The linguistic process by which words, phrases, or grammatical structures from other languages are adapted to conform to the patterns of the Chinese language.","examples":[{"sentence":"The Sinicization of loanwords is a common phenomenon.","translation":"外来語の中国語化は一般的な現象だ。"},{"sentence":"Many English terms have undergone Sinicization in modern Chinese.","translation":"多くの英語の用語が現代中国語で中国語化されている。"}],"collocations":["linguistic Sinicization (言語的な中国語化)","Sinicization of loanwords (外来語の中国語化)"],"synonyms":["Chinese adaptation","linguistic assimilation"],"antonyms":["Foreignization"]}],"etymology":{"value":"The term 'Sinicization' is derived from 'Sinic,' meaning 'Chinese,' and the suffix '-ization,' which denotes a process or state of becoming.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪnɪsaɪˈzeɪʃən/","syllables":"Si-ni-ci-za-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Sinicization refers to the process by which non-Chinese societies or elements are influenced by or assimilated into Chinese culture. This can manifest in various forms, including language, customs, social structures, and political systems. The term can also describe the adaptation of foreign linguistic elements into Chinese. It is often used in historical and political contexts, sometimes carrying connotations of cultural dominance or assimilation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is Sinicizing rapidly to America.","correct":"✓ The country is rapidly Westernizing.","note":"Sinicization refers specifically to the influence of Chinese culture. For American influence, use 'Westernizing' or 'Americanizing'."},{"incorrect":"✗ Sinicization is always a positive thing.","correct":"✓ The effects of Sinicization are complex and can be both positive and negative.","note":"Whether Sinicization is positive or negative depends on the context and perspective. It can be seen as cultural enrichment or as cultural imperialism."}],"priority":"★★☆"},"related_words":{"derivatives":["Sinicize (verb)","Sinic (adjective)","Sinified (adjective)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Sinicization' describes the process of something becoming more Chinese in character or culture. It's often used in discussions about history, culture, and politics, especially when talking about how Chinese culture has influenced other countries or groups of people. It can also refer to how words from other languages are changed to fit into the Chinese language. Because it's often used in academic or formal writing, it's considered a more advanced word."},"example_sentences":[{"sentence":"The architecture of the city shows clear signs of Sinicization.","translation":"その都市の建築は、中国化の明らかな兆候を示している。","type":"noun","meaning_category":"Cultural Influence"},{"sentence":"Some scholars argue that the adoption of Confucianism led to the Sinicization of Korean society.","translation":"一部の学者は、儒教の採用が韓国社会の中国化につながったと主張している。","type":"noun","meaning_category":"Historical Process"},{"sentence":"The Sinicization of foreign brands often involves adapting their names to sound more appealing to Chinese consumers.","translation":"外国ブランドの中国語化には、中国の消費者にアピールするように名前を適応させることがよく含まれる。","type":"noun","meaning_category":"Linguistic Adaptation"},{"sentence":"The government denies claims of forced Sinicization of the Uyghur population.","translation":"政府は、ウイグル族に対する強制的な中国化の主張を否定している。","type":"noun","meaning_category":"Political Context"}],"japanese_reading":"しなちゅうごくか、かんか"}