{"word":"hypoplasia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"低形成、形成不全","english_definition":"Underdevelopment or incomplete development of a tissue or organ.","examples":[{"sentence":"Renal hypoplasia can lead to kidney failure.","translation":"腎低形成は腎不全につながる可能性がある。"},{"sentence":"Enamel hypoplasia affects the appearance of teeth.","translation":"エナメル質形成不全は歯の外観に影響を与える。"},{"sentence":"Cerebellar hypoplasia is a condition where the cerebellum is smaller than normal.","translation":"小脳低形成は、小脳が正常よりも小さい状態である。"}],"collocations":["renal hypoplasia (腎低形成)","enamel hypoplasia (エナメル質形成不全)","cerebellar hypoplasia (小脳低形成)","pulmonary hypoplasia (肺低形成)","optic nerve hypoplasia (視神経低形成)"],"synonyms":["underdevelopment","atrophy (in some contexts, though atrophy implies wasting away of a previously normal tissue)","maldevelopment","dysplasia (though dysplasia implies abnormal cell growth, not necessarily underdevelopment)"],"antonyms":["hyperplasia (過形成)","hypertrophy (肥大)","aplasia (無形成)"]}],"etymology":{"value":"From Greek ὑπο- (hypo-) meaning 'under, below' + πλάσις (plasis) meaning 'formation'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈpleɪziə/","syllables":"hy-po-pla-si-a"},"inflection":{"noun_plural":"hypoplasias"},"usage_notes":{"explanation":"Hypoplasia refers to the incomplete or underdeveloped state of a tissue or organ, meaning it didn't reach its normal size or form during development. It's important to distinguish it from 'aplasia,' where the organ or tissue fails to develop at all, and from 'atrophy,' where a fully developed organ or tissue shrinks. The term is commonly used in medical contexts to describe congenital conditions or developmental abnormalities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said he had hyperplasia, meaning his organ was underdeveloped.","correct":"✓ The doctor said he had hypoplasia, meaning his organ was underdeveloped.","note":"Hypoplasia means underdevelopment; hyperplasia means overdevelopment."},{"incorrect":"✗ Hypoplasia is the same as atrophy.","correct":"✓ Hypoplasia is underdevelopment, while atrophy is the wasting away of a previously normal tissue.","note":"Hypoplasia is a developmental issue, while atrophy is a degenerative one."}],"priority":"★★☆"},"related_words":{"derivatives":["hypoplastic (adjective)"],"phrasal_verbs":[],"related_terms":["aplasia (無形成)","atrophy (萎縮)","hyperplasia (過形成)","hypertrophy (肥大)","dysplasia (異形成)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (medical/scientific contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypoplasia' is a medical term referring to the underdevelopment or incomplete development of a tissue or organ. It's used to describe conditions where an organ or tissue is smaller or less developed than it should be. This term is typically encountered in medical or scientific contexts and is not commonly used in everyday language. Understanding this term requires a basic knowledge of medical terminology. It is distinct from 'hyperplasia,' which refers to the overdevelopment of a tissue or organ, and 'aplasia,' which refers to the complete absence of development."},"example_sentences":[{"sentence":"The patient was diagnosed with pulmonary hypoplasia, affecting their breathing capacity.","translation":"患者は肺低形成と診断され、呼吸能力に影響が出ていた。","type":"medical","meaning_category":"underdevelopment"},{"sentence":"Optic nerve hypoplasia can lead to visual impairment.","translation":"視神経低形成は視覚障害を引き起こす可能性がある。","type":"medical","meaning_category":"underdevelopment"},{"sentence":"Enamel hypoplasia can make teeth more susceptible to decay.","translation":"エナメル質形成不全は歯を虫歯になりやすくする可能性がある。","type":"medical","meaning_category":"underdevelopment"}]}