{"word":"Rootages","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) The roots of a plant or tree, especially when considered collectively.","english_definition":"Roots, especially those of a plant or tree, considered collectively.","examples":[{"sentence":"The old oak tree had strong rootages that anchored it firmly in the ground.","translation":"その古い樫の木は、地面にしっかりと根を張る強い根を持っていた。"},{"sentence":"The rootages of the mangrove trees help to prevent coastal erosion.","translation":"マングローブの木の根は、海岸浸食を防ぐのに役立つ。"}],"collocations":["strong rootages","extensive rootages","deep rootages","tree rootages","plant rootages"],"synonyms":["roots","root system","radices (technical)"],"antonyms":[]}],"etymology":{"value":"Derived from 'root' + '-age', indicating a collection or mass of roots. The suffix '-age' is used to form nouns denoting a collection, mass, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːtɪdʒɪz/","syllables":"roo-ti-gez"},"inflection":{"noun_plural":"Rootages"},"usage_notes":{"explanation":"'Rootages' is a relatively uncommon word. It is used to refer to the entire root system of a plant or tree, emphasizing the collective nature of the roots. While 'roots' is more commonly used, 'rootages' can add a sense of completeness or thoroughness to the description.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rootage was damaged by the storm.","correct":"✓ The rootages were damaged by the storm. / ✓ The root system was damaged by the storm.","note":"Since 'rootages' refers to a collection of roots, it is often used in the plural form. If referring to the system as a whole, 'root system' is a more common and natural choice."}],"priority":"★★☆"},"related_words":{"derivatives":["root","rooted","rootless","root system"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rootages' is a relatively rare and sophisticated term for the roots of a plant or tree, considered as a collective mass. It is not commonly used in everyday language and is more likely to be found in botanical or scientific contexts. The word emphasizes the entirety of the root system, suggesting a complex and interconnected network. Because of its rarity, it is more appropriate for advanced learners and specialized contexts."},"example_sentences":[{"sentence":"The ancient tree's rootages spread far and wide beneath the forest floor.","translation":"その古代の木の根は、森の地面の下に広く広がっていた。","type":"noun","meaning_category":"roots (collective)"},{"sentence":"Erosion exposed the intricate rootages of the coastal plants.","translation":"浸食により、沿岸植物の複雑な根が露出した。","type":"noun","meaning_category":"roots (collective)"}]}