{"word":"nonextraditable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人が、または犯罪が)引き渡し不能な、引き渡しに応じられない","english_definition":"(of a person or crime) not subject to extradition; not able to be extradited.","examples":[{"sentence":"The suspect is a citizen of a country that has a treaty with us, but his crime is considered a political offense and therefore nonextraditable.","translation":"容疑者は我が国と条約を結んでいる国の国民だが、彼の犯罪は政治犯とみなされるため、引き渡し不能である。"},{"sentence":"Some countries refuse to extradite individuals for crimes that carry the death penalty, making those offenses nonextraditable in those cases.","translation":"死刑が適用される犯罪に対して、個人の引き渡しを拒否する国もあり、そのような場合、それらの犯罪は引き渡し不能となる。"}],"collocations":["nonextraditable offense","nonextraditable crime","declare nonextraditable","deem nonextraditable","consider nonextraditable"],"synonyms":["not extraditable","immune to extradition","protected from extradition"],"antonyms":["extraditable","subject to extradition"]},{"part_of_speech":"noun","definition":"引き渡し不能な人、引き渡しに応じられない人","english_definition":"a person who is not subject to extradition.","examples":[{"sentence":"He became a nonextraditable after claiming political asylum.","translation":"彼は政治亡命を申請した後、引き渡し不能者となった。"},{"sentence":"The lawyer argued that his client was a nonextraditable due to the nature of the charges against him.","translation":"弁護士は、依頼人に対する罪状の性質から、依頼人は引き渡し不能者であると主張した。"}],"collocations":["become a nonextraditable","declare someone a nonextraditable","treat as a nonextraditable"],"synonyms":["person immune to extradition","protected individual"],"antonyms":["extraditable person"]}],"etymology":{"value":"\"non-\" (否定) + \"extraditable\" (引き渡し可能な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪkˈstrædɪtəbəl/","syllables":"non-ex-tra-di-ta-ble"},"inflection":{"adjective_forms":{"comparative":"more nonextraditable","superlative":"most nonextraditable"},"noun_plural":"nonextraditables"},"usage_notes":{"explanation":"\"Nonextraditable\" is primarily used in legal and political contexts. It describes a person or crime that is not subject to extradition, meaning the person cannot be handed over to another country for trial or punishment. This can be due to various reasons, such as the nature of the crime being considered political, the absence of an extradition treaty, or the potential for human rights violations in the requesting country.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The crime was non-extradition.","correct":"✓ The crime was nonextraditable.","note":"The correct adjective form is \"nonextraditable,\" not \"non-extradition.\""},{"incorrect":"✗ He is a non-extradite.","correct":"✓ He is a nonextraditable.","note":"The correct noun form is \"nonextraditable,\" not \"non-extradite.\""}],"priority":"★★☆"},"related_words":{"derivatives":["extradition (名詞: 引き渡し)","extradite (動詞: 引き渡す)","extraditable (形容詞: 引き渡し可能な)"],"phrases":["extradition treaty","political offense","asylum","rule of specialty"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonextraditable\" is a complex legal term. It is formed by adding the prefix \"non-\" to \"extraditable,\" which means \"able to be extradited.\" Extradition is the legal process by which one country hands over a person to another country for trial or punishment. Therefore, \"nonextraditable\" means not subject to this process, usually due to legal or political reasons. This term is typically encountered in legal documents, international relations discussions, and news reports about criminal cases involving multiple countries."},"example_sentences":[{"sentence":"The suspect sought refuge in a country where his alleged crimes were considered political offenses and therefore **nonextraditable**.","translation":"容疑者は、彼の申し立てられた犯罪が政治犯とみなされ、したがって引き渡し不能となる国に避難を求めた。","type":"adjective","meaning_category":"引き渡し不能な"},{"sentence":"The lawyer argued that his client was a **nonextraditable** based on the principle of double jeopardy.","translation":"弁護士は、二重処罰の禁止の原則に基づき、彼の依頼人は引き渡し不能者であると主張した。","type":"noun","meaning_category":"引き渡し不能な人"}]}