{"word":"orthotics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"整形外科装具、矯正具","english_definition":"A medical specialty concerned with the design, manufacture, and application of orthoses. Also refers to the orthoses themselves.","examples":[{"sentence":"The doctor prescribed orthotics to correct my flat feet.","translation":"医者は私の扁平足を矯正するために整形外科装具を処方した。"},{"sentence":"Custom-made orthotics can provide better support and alignment than over-the-counter inserts.","translation":"カスタムメイドの整形外科装具は、市販のインソールよりも優れたサポートとアライメントを提供できる。"}],"collocations":["custom orthotics (カスタム整形外科装具)","foot orthotics (足部整形外科装具)","spinal orthotics (脊椎整形外科装具)","ankle-foot orthotics (足関節足部装具)","prescribe orthotics (整形外科装具を処方する)","wear orthotics (整形外科装具を着用する)"],"synonyms":["orthoses","braces","supports","corrective devices"],"antonyms":[]},{"part_of_speech":"noun","definition":"整形外科装具学","english_definition":"The science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, adjusting and/or dispensing orthoses for the correction of neuromuscular skeletal abnormalities.","examples":[{"sentence":"She is studying orthotics at the university.","translation":"彼女は大学で整形外科装具学を学んでいる。"},{"sentence":"The field of orthotics is constantly evolving with new materials and technologies.","translation":"整形外科装具学の分野は、新しい材料と技術によって常に進化している。"}],"collocations":["study orthotics (整形外科装具学を学ぶ)","practice orthotics (整形外科装具学を実践する)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'orthos' meaning straight, correct, or upright, combined with '-tics' relating to or characteristic of a specified subject or activity.","priority":"★★★"},"pronunciation":{"ipa":"/ɔːrˈθɒtɪks/","syllables":"or-thot-ics"},"inflection":{"noun_plural":"orthotics (usually treated as plural, even when referring to a single item)"},"usage_notes":{"explanation":"'Orthotics' can refer to the medical specialty, the field of study, or the devices themselves. When referring to a single device, it is still commonly referred to in the plural form ('a pair of orthotics' or simply 'orthotics'). The singular form 'orthotic' is less common but still acceptable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need an orthotic for my foot.","correct":"✓ I need orthotics for my foot.","note":"While 'orthotic' as a singular noun is acceptable, 'orthotics' is more commonly used, even when referring to a single device."},{"incorrect":"✗ Orthotics are only for foot problems.","correct":"✓ Orthotics can be used for various musculoskeletal problems, not just foot problems.","note":"Orthotics are used for various parts of the body, including the spine, ankles, and knees, not just the feet."}],"priority":"★★☆"},"related_words":{"derivatives":["orthotic (adjective, less commonly used singular noun)","orthotist (noun: a professional who designs and fits orthotics)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'orthotics' refers to the medical field focused on designing and applying orthoses (devices that support or correct musculoskeletal problems). It can also refer to the devices themselves. While 'orthotic' can be used as a singular noun or adjective, 'orthotics' is more commonly used, even when referring to a single item. This term is primarily used in medical contexts and may not be familiar to the general public. Understanding the difference between 'orthotics' (the field or the devices) and 'orthotist' (the professional) is important for clear communication.","priority":"★★☆"},"example_sentences":[{"sentence":"She consulted an orthotist to get custom-made **orthotics**.","translation":"彼女はカスタムメイドの整形外科装具を入手するために、整形外科装具士に相談した。","type":"noun","meaning_category":"整形外科装具"},{"sentence":"The podiatrist recommended **orthotics** to alleviate my plantar fasciitis.","translation":"足病医は私の足底筋膜炎を緩和するために整形外科装具を勧めた。","type":"noun","meaning_category":"整形外科装具"},{"sentence":"The university offers a degree program in **orthotics** and prosthetics.","translation":"その大学は整形外科装具学と義肢学の学位プログラムを提供している。","type":"noun","meaning_category":"整形外科装具学"}]}