{"word":"uninflectedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不変化性、屈折しないこと","english_definition":"The state or quality of being uninflected; the absence of inflection.","examples":[{"sentence":"The uninflectedness of certain words in English can sometimes make it difficult to determine their grammatical function without context.","translation":"英語における特定の語の不変化性は、文脈なしにそれらの文法的な機能を判断することを時に困難にする可能性がある。"}],"collocations":["lack of inflection","absence of inflection","grammatical uninflectedness"],"synonyms":["invariability","non-inflection","indeclinability"],"antonyms":["inflectedness","variability","declinability"]}],"etymology":{"value":"Formed from \"un-\" (prefix meaning 'not'), \"inflected\" (past participle of \"inflect,\" meaning 'to change the form of a word'), and \"-ness\" (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪnˈflektɪdnəs/","syllables":"un-in-flect-ed-ness"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"\"Uninflectedness\" refers to the property of a word or language where words do not change their form to indicate grammatical functions such as tense, number, gender, or case. Languages with high uninflectedness rely more on word order and auxiliary words to convey grammatical relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uninflectedness are a feature of the language.","correct":"✓ The uninflectedness is a feature of the language.","note":"\"Uninflectedness\" is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["uninflected (adjective)","inflection (noun)","inflect (verb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'uninflectedness' is a technical term primarily used in linguistics. It describes the characteristic of a language or specific words within a language that do not change form to indicate grammatical functions like tense, number, or case. This term is not typically used in everyday conversation and is more common in academic or specialized contexts related to language studies."},"example_sentences":[{"sentence":"The increasing uninflectedness of English has led to a greater reliance on syntax.","translation":"英語の不変化性の高まりは、構文へのより大きな依存につながっている。","type":"general","meaning_category":"general"},{"sentence":"Chinese is known for its high degree of uninflectedness compared to Indo-European languages.","translation":"中国語は、インド・ヨーロッパ語族と比較して、不変化性が高いことで知られている。","type":"comparative","meaning_category":"comparative"}]}