{"word":"aligners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歯科矯正) アライナー、マウスピース矯正","english_definition":"(orthodontics) Clear, removable trays used as an alternative to traditional braces to straighten teeth.","examples":[{"sentence":"She's using aligners to straighten her teeth instead of braces.","translation":"彼女は歯並びを矯正するために、従来のブレースの代わりにアライナーを使っています。"},{"sentence":"The orthodontist recommended aligners for my mild case of crooked teeth.","translation":"歯科矯正医は、私の軽度の歯並びの悪さにはアライナーを勧めました。"},{"sentence":"Aligners are virtually invisible, making them a popular choice for adults.","translation":"アライナーはほとんど目立たないため、大人に人気の選択肢となっています。"}],"collocations":["clear aligners","invisible aligners","orthodontic aligners","wear aligners","aligner treatment","aligner therapy"],"synonyms":["clear braces","invisible braces","orthodontic trays"],"antonyms":["traditional braces","metal braces","fixed braces"]},{"part_of_speech":"noun","definition":"(一般) 位置合わせするもの、調整器","english_definition":"A device or tool used to align or adjust something.","examples":[{"sentence":"The mechanic used an aligner to ensure the wheels were properly aligned.","translation":"整備士は、ホイールが適切に位置合わせされるようにアライナーを使用しました。"},{"sentence":"This tool serves as an aligner for the two pieces of wood, ensuring a perfect fit.","translation":"このツールは、2つの木材の位置を合わせるためのアライナーとして機能し、完璧なフィットを保証します。"}],"collocations":["wheel aligner","shaft aligner","laser aligner","alignment tool","positioning device"],"synonyms":["alignment tool","positioning device","adjuster"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'align,' meaning to bring into a line or proper relationship. The suffix '-er' denotes an agent or device that performs the action.","priority":"N/A"},"pronunciation":{"ipa":"/əˈlaɪnərz/","syllables":"a-lign-ers"},"inflection":{"noun_plural":"aligners"},"usage_notes":{"explanation":"The term 'aligners' most commonly refers to clear, removable orthodontic devices used to straighten teeth. However, it can also refer to any tool or device used for alignment purposes in various fields. Context is crucial to understanding the intended meaning. When discussing dental treatments, 'aligners' almost always refers to clear aligners.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm wearing aligner.","correct":"✓ I'm wearing aligners.","note":"Aligners are typically worn in sets or series, so the plural form is generally used. Even if you are referring to wearing them in general, the plural is preferred."},{"incorrect":"✗ The dentist gave me a aligners.","correct":"✓ The dentist gave me aligners.","note":"Since 'aligners' is plural, the indefinite article 'a' is not used."},{"incorrect":"✗ I cleaned my aligner with toothpaste.","correct":"✓ I cleaned my aligners with a toothbrush and special cleaning solution.","note":"While you might clean each aligner individually, you are still referring to the set of aligners. Also, toothpaste is not recommended for cleaning aligners as it can scratch them."}],"priority":"★★☆"},"related_words":{"derivatives":["align (verb)","alignment (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (in the context of orthodontics)","frequency_google_ngram":"Relatively low, but increasing due to the popularity of clear aligner treatments.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Aligners' is a term primarily used in the context of orthodontics, referring to clear, removable devices used to straighten teeth as an alternative to traditional braces. While the word itself is not highly complex, understanding its specific meaning requires some familiarity with dental procedures. Outside of orthodontics, 'aligner' can refer to any tool or device used for aligning objects, but this usage is less common. Therefore, the readability level is considered B2 due to the specific context required for accurate understanding."},"example_sentences":[{"sentence":"My dentist recommended Invisalign **aligners** to fix my overbite.","translation":"私の歯科医は、出っ歯を治すためにインビザラインのアライナーを勧めました。","type":"noun","meaning_category":"orthodontics"},{"sentence":"The factory uses laser **aligners** to ensure the precision of the assembled parts.","translation":"その工場では、組み立てられた部品の精度を保証するためにレーザーアライナーを使用しています。","type":"noun","meaning_category":"general"}]}