{"word":"unturbaned","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ターバンを巻いていない、ターバンを着けていない","english_definition":"Not wearing a turban.","examples":[{"sentence":"He appeared before the court unturbaned, which was considered disrespectful.","translation":"彼はターバンを着けずに法廷に現れたが、それは無礼だとみなされた。"},{"sentence":"The Sikh soldier was rarely seen unturbaned in public.","translation":"そのシーク教徒の兵士が公の場でターバンを着けていない姿を見られることは稀だった。"}],"collocations":["unturbaned head","unturbaned appearance"],"synonyms":["bareheaded","uncovered"],"antonyms":["turbaned","covered"],"notes":"Typically used in contexts where wearing a turban is expected or culturally significant."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'turbaned'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈtɜːrbənd/","syllables":"un-tur-baned"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"The word 'unturbaned' is primarily descriptive, indicating the absence of a turban. It often carries cultural or religious significance, particularly in communities where turban-wearing is a customary or mandated practice. The term can sometimes imply a deviation from expected norms or traditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt unturbaned without his hat.","correct":"✓ He felt bareheaded without his hat.","note":"'Unturbaned' specifically refers to the absence of a turban, not just any head covering. Use 'bareheaded' for the general absence of a hat."}],"priority":"★★☆"},"related_words":{"derivatives":["turban (noun)","turbaned (adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'unturbaned' is relatively uncommon and is used in specific cultural or historical contexts where the wearing of turbans is significant. Understanding the word requires familiarity with the cultural importance of turbans in certain communities, particularly among Sikhs and some Muslim groups. The word is formed by adding the prefix 'un-' to 'turbaned,' indicating the absence of a turban."},"example_sentences":[{"sentence":"The photograph showed the guru unturbaned, a rare sight for his followers.","translation":"その写真は、彼の信者にとっては珍しい光景である、ターバンを着けていない導師の姿を写していた。","type":"descriptive"},{"sentence":"To appear unturbaned at the ceremony would be considered a grave insult.","translation":"式典にターバンを着けずに現れることは、重大な侮辱とみなされるだろう。","type":"contextual"}]}