{"word":"short-celled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(細胞が)短い細胞から成る、短い細胞を持つ","english_definition":"Consisting of or having short cells. This term is primarily used in biological or botanical contexts to describe the structure of tissues or organisms at a cellular level.","examples":[{"sentence":"The short-celled cambium produces smaller xylem and phloem elements.","translation":"短い細胞から成る形成層は、より小さな木部および師部要素を生成する。"},{"sentence":"The leaf epidermis is characterized by short-celled structures.","translation":"葉の表皮は、短い細胞構造によって特徴づけられる。"}],"collocations":["short-celled cambium","short-celled epidermis","short-celled structure"],"synonyms":["small-celled","microcellular"],"antonyms":["long-celled","large-celled"]}],"etymology":{"value":"The term is formed by combining \"short\" and \"celled,\" indicating that the cells are short in length.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʃɔːrtˈsɛld/","syllables":"short-celled"},"inflection":{"notes":"This is an adjective, so it can be used to describe nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Short-celled\" is a descriptive term used in scientific contexts, particularly in biology and botany, to describe tissues or organisms where the cells are notably shorter in length compared to others. It is often used to characterize specific types of cells or tissues within an organism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tissue was short cell.","correct":"✓ The tissue was short-celled.","note":"It is important to use the correct adjectival form \"short-celled\" rather than the noun form \"short cell\"."}],"priority":"★★☆"},"related_words":{"derivatives":["cell","cellular"],"related_terms":["long-celled","parenchyma","sclerenchyma"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"short-celled\" is a technical term used in biological sciences, specifically in botany and cellular biology. It describes tissues or structures composed of cells that are relatively short in length. Understanding this term requires familiarity with basic biological concepts such as cell structure and tissue types. It is typically found in scientific articles, textbooks, and research papers related to these fields."},"example_sentences":[{"sentence":"The short-celled nature of the xylem vessels allows for efficient water transport.","translation":"木部導管の短い細胞構造は、効率的な水輸送を可能にする。","type":"general","meaning_category":"cell structure"},{"sentence":"Short-celled variants of the algae were observed under stress conditions.","translation":"藻類の短い細胞変異体は、ストレス条件下で観察された。","type":"specific","meaning_category":"biological context"}]}