{"word":"Rahu","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ラーフ：インド占星術における月の昇交点（白道と黄道の交点の一つ）。また、それを神格化したもの。不吉な星とされる。","english_definition":"Rahu: In Hindu astrology, the ascending lunar node (one of the points where the Moon's orbit crosses the ecliptic). Also, the deification of this point. Considered an inauspicious planet.","examples":[{"sentence":"In Vedic astrology, Rahu is considered a shadow planet that can bring about sudden and unexpected events.","translation":"ヴェーダ占星術では、ラーフは影の惑星とみなされ、突然の予期せぬ出来事をもたらすとされる。"},{"sentence":"Many Hindus perform rituals to appease Rahu and mitigate its negative effects.","translation":"多くのヒンドゥー教徒は、ラーフを鎮め、その悪影響を軽減するための儀式を行う。"}],"collocations":["Rahu Dasha (ラーフのダシャー：惑星の影響を受ける期間)","Shadow planet (影の惑星)","Ascending lunar node (月の昇交点)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"サンスクリット語の 'Rāhu' (राहु) に由来し、意味は「捕らえる者」または「妨げる者」。神話では、ラーフは不死の甘露アムリタを盗み飲もうとしたアスラ（悪魔）であり、ヴィシュヌ神によって首を切られた。しかし、既にアムリタを飲んでいたため、頭部は不死となり、惑星として天空に留まることになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɑːhuː/","syllables":"Ra-hu"},"inflection":{"notes":"可算名詞"},"usage_notes":{"explanation":"'Rahu' は主にインド占星術（ジョーティッシュ）の文脈で使用される専門用語です。一般の英語話者には馴染みが薄い単語ですが、占星術に関心のある人々には知られています。文脈によっては、'North Node' (北交点) と呼ばれることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw Rahu in the sky last night.","correct":"✓ Rahu is a mathematical point, not a physical planet, so it cannot be seen.","note":"ラーフは実際の天体ではなく、数学的な点であるため、肉眼で見ることはできません。"},{"incorrect":"✗ Rahu is a good planet.","correct":"✓ In traditional Hindu astrology, Rahu is generally considered an inauspicious planet.","note":"ラーフは伝統的に不吉な星とされています。"}],"priority":"★★☆"},"related_words":{"derivatives":["Rāhukāla (ラーフカーラ：不吉な時間帯)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 占星術関連の文脈でのみ使用される傾向があります。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rahu' is a term specific to Hindu astrology and mythology, referring to the ascending lunar node and its deification. Understanding requires familiarity with Vedic cosmology and astrological concepts. It is not a word commonly encountered in general English usage. Context is essential for comprehension.","note":"This term is highly specialized and requires background knowledge in Hindu astrology."},"example_sentences":[{"sentence":"According to her birth chart, Rahu is strongly positioned in the tenth house.","translation":"彼女の出生図によると、ラーフは第10室に強く位置している。","type":"noun","meaning_category":"astrology"},{"sentence":"Some astrologers believe that Rahu's influence can cause confusion and illusion.","translation":"ラーフの影響は混乱と幻想を引き起こすと信じる占星術師もいる。","type":"noun","meaning_category":"astrology"},{"sentence":"The period of Rahu Dasha is often associated with challenges and transformations.","translation":"ラーフのダシャーの期間は、しばしば困難と変容に関連付けられる。","type":"noun","meaning_category":"astrology"}]}