{"word":"pseudotributary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地理学) 擬似支流：本流に直接合流せず、他の支流に合流する小川や水路。","english_definition":"(geography) A small stream or channel that does not flow directly into the main river, but instead joins another tributary.","examples":[{"sentence":"The small stream was a pseudotributary, joining the larger creek before it reached the main river.","translation":"その小川は擬似支流で、本流に到達する前に大きな小川に合流していた。"}],"collocations":["river system","drainage basin","tributary junction"],"synonyms":["distributary","anabranch"],"antonyms":["mainstream","trunk stream"]}],"etymology":{"value":"The word 'pseudotributary' is formed by combining 'pseudo-' (meaning false or resembling) with 'tributary' (a stream that flows into a larger stream or other body of water).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːdoʊˈtrɪbjʊˌteri/","syllables":"pseu-do-trib-u-tar-y"},"inflection":{"noun_plural":"pseudotributaries"},"usage_notes":{"explanation":"A pseudotributary is a stream that appears to be a tributary of a main river but instead flows into another tributary before reaching the main channel. This term is used in geography and hydrology to describe specific drainage patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The river was a pseudotributary of the lake.","correct":"✓ The stream was a pseudotributary of the river.","note":"'Pseudotributary' refers to a stream joining another tributary, not a main river flowing into a lake."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or resembling)","tributary (a stream that flows into a larger stream or other body of water)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudotributary' is a specialized term in geography and hydrology, referring to a stream that flows into another tributary rather than directly into the main river. It is not commonly used outside of academic or technical contexts. Understanding this term requires knowledge of river systems and drainage patterns."},"example_sentences":[{"sentence":"The hydrologist identified several pseudotributaries in the upper reaches of the watershed.","translation":"水文学者は、分水界の上流でいくつかの擬似支流を特定した。","type":"noun","meaning_category":"geography"}]}