{"word":"expansometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"膨張計","english_definition":"An instrument for measuring the expansion of a substance, especially a solid, caused by heating.","examples":[{"sentence":"The expansometer is used to determine the coefficient of thermal expansion of the metal.","translation":"膨張計は、金属の熱膨張係数を決定するために使用されます。"},{"sentence":"Different types of expansometers exist, each designed for specific materials and temperature ranges.","translation":"さまざまな種類の膨張計が存在し、それぞれ特定の材料と温度範囲向けに設計されています。"}],"collocations":["thermal expansometer","optical expansometer","push-rod expansometer","measure expansion","coefficient of expansion"],"synonyms":["dilatometer"],"antonyms":[]}],"etymology":{"value":"From 'expansion' + '-o-' + '-meter'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌspænsˈɒmɪtər/","syllables":"ex-pan-som-e-ter"},"inflection":{"noun_plural":"expansometers"},"usage_notes":{"explanation":"An expansometer is a scientific instrument used to measure the linear thermal expansion of a material as a function of temperature. It is commonly used in materials science, engineering, and physics to characterize the thermal behavior of solids, liquids, and gases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The expansometer measure temperature.","correct":"✓ The expansometer measures expansion.","note":"Expansometers measure the expansion of a substance, not the temperature directly. Temperature is the independent variable that causes the expansion."},{"incorrect":"✗ Use the expansometer to measure length.","correct":"✓ Use the expansometer to measure the change in length due to thermal expansion.","note":"Expansometers measure the change in length due to thermal expansion, not the absolute length of an object."}],"priority":"★☆☆"},"related_words":{"derivatives":["expansion","meter","thermal expansion","dilatation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'expansometer' is a technical term primarily used in scientific and engineering contexts. Understanding requires knowledge of thermal expansion and measurement principles. The word itself is derived from 'expansion' and '-meter', indicating its function as a measuring device for expansion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The engineer used an expansometer to accurately measure the thermal expansion of the bridge's steel beams.","translation":"エンジニアは、橋の鋼鉄製の梁の熱膨張を正確に測定するために膨張計を使用しました。","type":"general","meaning_category":"measurement"},{"sentence":"The laboratory's high-precision expansometer allowed for detailed analysis of the material's behavior under varying temperatures.","translation":"研究所の高精度膨張計により、さまざまな温度下での材料の挙動の詳細な分析が可能になりました。","type":"technical","meaning_category":"analysis"},{"sentence":"The data from the expansometer was crucial in determining the optimal materials for the spacecraft's construction.","translation":"膨張計からのデータは、宇宙船の構造に最適な材料を決定する上で重要でした。","type":"application","meaning_category":"application"}]}