{"word":"angiogenesis-inhibiting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"血管新生阻害性の","english_definition":"Having the property of inhibiting or preventing angiogenesis (the formation of new blood vessels).","examples":[{"sentence":"The drug is angiogenesis-inhibiting, which helps to prevent the tumor from growing.","translation":"その薬は血管新生阻害性であり、腫瘍の成長を防ぐのに役立ちます。"},{"sentence":"Angiogenesis-inhibiting therapies are used in the treatment of certain cancers.","translation":"血管新生阻害療法は、特定のがんの治療に用いられています。"}],"collocations":["angiogenesis-inhibiting drug","angiogenesis-inhibiting therapy","angiogenesis-inhibiting agent"],"synonyms":["anti-angiogenic"],"antonyms":["angiogenic"],"notes":"Typically used in the context of cancer treatment and other diseases where blood vessel growth is undesirable."}],"etymology":{"value":"Formed by combining 'angiogenesis' (the formation of new blood vessels) with 'inhibiting' (preventing or slowing down).","priority":"★★★"},"pronunciation":{"ipa":"/ˌændʒioʊˈdʒɛnɪsɪs ɪnˈhɪbɪtɪŋ/","syllables":"an-gi-o-gen-e-sis in-hib-it-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'angiogenesis-inhibiting' describes substances or treatments that prevent or slow down the growth of new blood vessels. This is important in treating conditions like cancer, where tumors need new blood vessels to grow and spread.","priority":"★★★"},"related_words":{"derivatives":["angiogenesis","inhibit","inhibitor"],"related_terms":["anti-VEGF therapy","tumor angiogenesis"],"priority":"★★★"},"level_frequency":{"priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Angiogenesis-inhibiting' is a technical term used in medicine and biology. It refers to something that stops new blood vessels from forming. This is often important in treating diseases like cancer, where stopping blood vessel growth can prevent tumors from getting bigger. Because it's a specialized term, it's not commonly used outside of scientific or medical contexts."},"example_sentences":[{"sentence":"The research focused on developing angiogenesis-inhibiting compounds.","translation":"その研究は、血管新生阻害化合物の開発に焦点を当てていた。","type":"general","meaning_category":"general"},{"sentence":"An angiogenesis-inhibiting diet may help to slow the progression of some cancers.","translation":"血管新生阻害食は、一部のがんの進行を遅らせるのに役立つ可能性がある。","type":"medical","meaning_category":"medical"}]}