{"word":"stay-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"滞在型、長期滞在志向の","english_definition":"Focused on or designed for longer stays or residency; emphasizing the experience and amenities associated with an extended visit.","examples":[{"sentence":"The hotel is becoming more stay-oriented by adding kitchenettes to the rooms.","translation":"そのホテルは、部屋に簡易キッチンを追加することで、より滞在型になっている。"},{"sentence":"We are developing stay-oriented programs to attract guests who want to immerse themselves in the local culture.","translation":"地元の文化に浸りたいゲストを引き付けるために、滞在型プログラムを開発しています。"},{"sentence":"This neighborhood has a stay-oriented vibe, with many long-term rental options available.","translation":"この地域は長期滞在志向の雰囲気があり、多くの長期賃貸オプションが利用可能です。"}],"collocations":["stay-oriented hotel","stay-oriented program","stay-oriented tourism","stay-oriented apartment","stay-oriented amenities"],"synonyms":["extended-stay","long-term","residential","immersion-focused"],"antonyms":["transient","short-term","temporary"]},{"part_of_speech":"adjective","definition":"特定の場所に留まることを重視する","english_definition":"Emphasizing or prioritizing remaining in a particular place or situation.","examples":[{"sentence":"Her career goals are stay-oriented; she wants to build her life in this city.","translation":"彼女のキャリア目標は、特定の場所に留まることを重視しており、この街で人生を築きたいと考えています。"},{"sentence":"The company's policy is not stay-oriented, as they encourage employees to relocate for better opportunities.","translation":"会社のポリシーは、特定の場所に留まることを重視しておらず、従業員により良い機会のために転勤することを奨励しています。"}],"collocations":["stay-oriented career","stay-oriented lifestyle","stay-oriented policy"],"synonyms":["location-focused","rooted","settled","localized"],"antonyms":["mobile","relocatable","transient"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"stay\" (referring to remaining in a place or situation) and \"oriented\" (meaning directed or focused towards).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsteɪˌɔːriɛn.tɪd/","syllables":"stay-o-ri-en-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are not commonly used for compound adjectives like this)."},"usage_notes":{"explanation":"\"Stay-oriented\" is a relatively modern term, often used in the context of tourism, hospitality, and urban planning. It describes something that is designed or intended to cater to people who are staying in a place for an extended period, rather than just passing through. It can also describe a mindset or approach that prioritizes remaining in a particular location.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stay-oriented of the hotel is excellent.","correct":"✓ The stay-oriented amenities of the hotel are excellent.","note":"\"Stay-oriented\" is an adjective and should be used to describe a noun. It cannot stand alone as a noun."}],"priority":"N/A"},"related_words":{"derivatives":["orientation (名詞: 方向性、志向性)"],"phrasal_verbs":[],"related_terms":["extended stay","long-term rental","serviced apartment"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. The term is relatively new and specific.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"stay-oriented\" is a compound adjective that describes something designed for or focused on longer stays or residency. It suggests an emphasis on the experience and amenities associated with an extended visit, rather than a brief or transient one. The term is often used in the context of hotels, tourism, and urban planning to describe services, programs, or environments that cater to individuals or groups who plan to remain in a particular location for a significant period. It can also describe a personal preference or goal to remain in a specific location long-term."},"example_sentences":[{"sentence":"The new apartment complex is designed to be stay-oriented, offering furnished units and flexible lease terms.","translation":"その新しいアパート複合施設は、家具付きのユニットと柔軟なリース条件を提供し、滞在型になるように設計されています。","type":"adjective","meaning_category":"滞在型"},{"sentence":"The city council is promoting stay-oriented tourism to boost the local economy.","translation":"市議会は、地域経済を活性化するために、滞在型観光を推進しています。","type":"adjective","meaning_category":"滞在型"},{"sentence":"She has a stay-oriented mindset and prefers to invest in local businesses.","translation":"彼女は特定の場所に留まることを重視する考え方を持っており、地元の企業に投資することを好みます。","type":"adjective","meaning_category":"特定の場所に留まることを重視する"}]}