{"word":"heteronomous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"他律的な、外部の法則に従う","english_definition":"subject to external law or control; not self-governing.","examples":[{"sentence":"The child's behavior was heteronomous, dictated by the rules of the school.","translation":"その子供の行動は他律的で、学校の規則によって指示されていた。"},{"sentence":"Kant contrasted heteronomous morality with autonomous morality.","translation":"カントは他律的な道徳と自律的な道徳を対比させた。"}],"collocations":["heteronomous morality","heteronomous will","heteronomous system"],"synonyms":["dependent","subordinate","subject","controlled","externally regulated"],"antonyms":["autonomous","independent","self-governing","self-determined"]},{"part_of_speech":"adjective","definition":"（道徳哲学において）外部からの動機や強制によって決定される","english_definition":"(in moral philosophy) determined by motives or influences outside the self.","examples":[{"sentence":"A heteronomous action is one that is done because of an external reward or punishment.","translation":"他律的な行動とは、外部からの報酬や罰によって行われる行動のことである。"}],"collocations":["heteronomous action","heteronomous principle","heteronomous ethics"],"synonyms":["externally motivated","other-directed","dependent on external factors"],"antonyms":["autonomously motivated","self-directed","internally driven"]}],"etymology":{"value":"Derived from the Greek words 'heteros' (ἕτερος) meaning 'other' or 'different' and 'nomos' (νόμος) meaning 'law'. Thus, 'heteronomous' literally means 'subject to a different or external law'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtəˈrɒnəməs/","syllables":"het-er-on-o-mous"},"inflection":{"notes":"The word 'heteronomous' is an adjective, so it has comparative and superlative forms, though they are not commonly used: more heteronomous, most heteronomous."},"usage_notes":{"explanation":"'Heteronomous' is often used in philosophical and ethical contexts, particularly in discussions of morality and autonomy. It describes a state where one's actions or decisions are governed by external forces, laws, or influences, rather than by one's own free will or reason. The term is frequently contrasted with 'autonomous,' which describes self-governance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heteronomous system was very efficient because it was self-governing.","correct":"✓ The autonomous system was very efficient because it was self-governing.","note":"'Heteronomous' and 'autonomous' are antonyms. A self-governing system would be autonomous, not heteronomous."}],"priority":"★★☆"},"related_words":{"derivatives":["heteronomy (noun): the condition of being subject to external law or control"],"phrasal_verbs":[],"related_concepts":["autonomy","ethics","moral philosophy","Kant's moral philosophy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'heteronomous' is a technical term primarily used in philosophy, particularly in ethics and moral philosophy. It describes a state of being governed by external forces or laws, as opposed to being self-governed (autonomous). Understanding this word requires familiarity with abstract philosophical concepts. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The government imposed a heteronomous regime on the occupied territory.","translation":"政府は占領地域に他律的な政権を押し付けた。","type":"adjective","meaning_category":"外部の法則に従う"},{"sentence":"According to Kant, heteronomous actions lack moral worth because they are not performed out of a sense of duty.","translation":"カントによれば、他律的な行動は義務感から行われるものではないため、道徳的価値がない。","type":"adjective","meaning_category":"外部からの動機によって決定される"}]}