{"word":"Misyoking","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang) A person who tries too hard to be popular or liked; someone who is overly eager to please.","english_definition":"A person who is overly eager to please or gain popularity, often to the point of being seen as insincere or trying too hard.","examples":[{"sentence":"He's such a misyoking; he always agrees with whatever the boss says.","translation":"彼は本当に人気取りに必死だ。いつも上司の言うことに同意している。"},{"sentence":"Don't be a misyoking; just be yourself and people will like you for who you are.","translation":"人気取りをするな。ありのままの自分でいれば、人々はあなたのことを好きになるだろう。"}],"collocations":["stop being a misyoking","classic misyoking behavior"],"synonyms":["try-hard","brown-noser","sycophant","kiss-up","people-pleaser"],"antonyms":["authentic","genuine","sincere"]}],"etymology":{"value":"Likely a blend of 'misery' and 'joking,' suggesting someone whose attempts at humor or friendliness are pathetic or insincere.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌmɪsiˈjoʊkɪŋ/","syllables":"Mi-sy-o-king"},"inflection":{"noun_plural":"misyokings"},"usage_notes":{"explanation":"'Misyoking' is a slang term, often used derisively, to describe someone who is perceived as trying too hard to be liked or popular. The term implies a lack of authenticity and suggests that the person's behavior is motivated by a desire for approval rather than genuine connection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She's very misyoking with her friends.","correct":"✓ She's being very misyoking with her friends.","note":"'Misyoking' often describes a state of being or a pattern of behavior, so using a continuous tense ('being misyoking') is more appropriate."},{"incorrect":"✗ He's a misyoking person.","correct":"✓ He's a misyoking.","note":"While you can say someone *is* misyoking, the term itself functions as a noun referring to the person. Adding 'person' is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Misyoking' is a slang term used to describe someone who is perceived as trying too hard to gain popularity or approval. The term carries a negative connotation, suggesting that the person's behavior is insincere and motivated by a desire to please others rather than genuine connection. It's often used to criticize someone for being overly eager to fit in or gain favor."},"example_sentences":[{"sentence":"His constant compliments and agreement with everything the manager said made him look like a total misyoking.","translation":"彼が常に上司に褒め言葉を言い、何でも同意するので、まるで人気取りに必死に見えた。","type":"noun","meaning_category":"person trying too hard to be liked"},{"sentence":"She accused him of being a misyoking when he started volunteering for every task just to impress the boss.","translation":"彼女は、彼が上司に印象付けるためだけにすべての仕事にボランティアで参加し始めたとき、彼を人気取りだと非難した。","type":"noun","meaning_category":"person trying too hard to be liked"}]}