{"word":"Sisterliness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"姉妹愛、姉妹のような親愛の情、女性同士の連帯感","english_definition":"The quality of being like a sister; affection, support, and understanding between women.","examples":[{"sentence":"The sisterliness between the women in the group was evident.","translation":"そのグループの女性たちの間の姉妹愛は明らかだった。"},{"sentence":"She showed great sisterliness towards her colleagues.","translation":"彼女は同僚たちに素晴らしい姉妹愛を示した。"},{"sentence":"The project aims to promote sisterliness among women in different countries.","translation":"そのプロジェクトは、異なる国の女性たちの間の姉妹愛を促進することを目指している。"}],"collocations":["show sisterliness","promote sisterliness","feel sisterliness","sisterliness and solidarity"],"synonyms":["female solidarity","camaraderie","fellowship","comradeship","fraternity (in a female context)","mutual support","affection","tenderness","kindness"],"antonyms":["rivalry","competition","enmity","discord","antagonism"]}],"etymology":{"value":"Derived from 'sisterly' (adjective meaning 'like a sister'), with the addition of the suffix '-ness' to form a noun denoting the quality or state of being sisterly.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɪstərliːnəs/","syllables":"Sis-ter-li-ness"},"inflection":{"noun_plural":"(uncountable noun, no plural form)"},"usage_notes":{"explanation":"'Sisterliness' refers to the positive qualities associated with the relationship between sisters, such as caring, support, and understanding. It is often used to describe the bond between women who are not necessarily related by blood but share a strong sense of connection and mutual support. The term emphasizes the emotional and social aspects of female relationships, highlighting empathy, cooperation, and shared experiences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has a strong sisterliness with her brother.","correct":"✓ She has a strong sibling bond with her brother.","note":"'Sisterliness' specifically refers to relationships between women. For relationships between siblings of different genders, use 'sibling bond' or similar terms."},{"incorrect":"✗ The sisterliness of the group was very competition.","correct":"✓ The sisterliness of the group was evident despite some competition.","note":"'Sisterliness' and 'competition' are generally antonyms. While competition may exist, it doesn't define sisterliness. If competition exists, it should be presented as something that the sisterliness overcomes or exists alongside."}],"priority":"★★☆"},"related_words":{"derivatives":["sisterly (adjective)","sister (noun)"],"phrasal_verbs":[],"related_concepts":["feminism","women's rights","female empowerment","solidarity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (uncommon, used in specific contexts related to feminism or social studies)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sisterliness' is a relatively uncommon term that describes the qualities associated with the relationship between sisters, such as affection, support, and understanding. It is often used in contexts related to feminism, women's rights, or social studies to emphasize the importance of solidarity and mutual support among women. Due to its specific and somewhat abstract meaning, it is more likely to be encountered in advanced texts or discussions about social issues."},"example_sentences":[{"sentence":"The conference aimed to foster a sense of sisterliness among female entrepreneurs.","translation":"その会議は、女性起業家の間に姉妹愛を育むことを目指していた。","type":"noun","meaning_category":"姉妹愛"},{"sentence":"Her sisterliness towards the new employee made her feel welcome.","translation":"彼女の新しい従業員に対する姉妹愛は、彼女を歓迎されていると感じさせた。","type":"noun","meaning_category":"姉妹のような親愛の情"},{"sentence":"The documentary explored the theme of sisterliness in the face of adversity.","translation":"そのドキュメンタリーは、逆境に直面したときの姉妹愛というテーマを探求した。","type":"noun","meaning_category":"女性同士の連帯感"},{"sentence":"The organization promotes sisterliness by providing resources and support for women in need.","translation":"その組織は、困窮している女性に資源とサポートを提供することで、姉妹愛を促進している。","type":"noun","meaning_category":"女性同士の連帯感"},{"sentence":"Despite their differences, a strong sense of sisterliness bound the women together.","translation":"違いはあったものの、強い姉妹愛が女性たちを結びつけていた。","type":"noun","meaning_category":"姉妹愛"}]}