{"word":"xerophily","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乾燥を好む性質、乾燥地への適応性","english_definition":"The ability to survive in a dry environment or under drought conditions.","examples":[{"sentence":"Xerophily is a common trait in desert plants.","translation":"乾燥を好む性質は、砂漠の植物によく見られる特徴です。"},{"sentence":"The xerophily of cacti allows them to thrive in arid climates.","translation":"サボテンの乾燥を好む性質により、乾燥した気候でも生育できます。"}],"collocations":["plant xerophily","adaptation through xerophily"],"synonyms":["drought tolerance","desiccation tolerance","arid adaptation"],"antonyms":["hydrophily","hygrophily"]}],"etymology":{"value":"From 'xero-' (Greek for 'dry') + '-phily' (Greek for 'love of').","priority":"★★☆"},"pronunciation":{"ipa":"/zɪˈrɒfɪli/","syllables":"ze-roph-i-ly"},"inflection":{"noun_plural":"xerophilies"},"usage_notes":{"explanation":"'Xerophily' refers to the adaptation of an organism, especially plants, to survive in environments with limited water availability. It encompasses various physiological and morphological adaptations that allow the organism to conserve water and tolerate dehydration.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The xerophily is only found in animals.","correct":"✓ Xerophily is most commonly associated with plants, but some animals also exhibit drought-resistant adaptations.","note":"While primarily associated with plants, some animals also display adaptations to dry environments."},{"incorrect":"✗ Xerophily means requiring a lot of water.","correct":"✓ Xerophily means thriving in dry conditions with little water.","note":"Xerophily is the opposite of needing a lot of water; it's about surviving with very little."}],"priority":"★★☆"},"related_words":{"derivatives":["xerophile (noun: a xerophilic organism)","xerophytic (adjective: adapted to dry conditions)","xerophyte (noun: a plant adapted to dry conditions)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Xerophily' is a specialized term primarily used in botany and ecology to describe the adaptations of organisms, especially plants, to survive in arid or drought-prone environments. Understanding this term requires familiarity with scientific vocabulary related to plant physiology and environmental science. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The **xerophily** of succulents enables them to store water efficiently.","translation":"多肉植物の乾燥を好む性質により、効率的に水を貯えることができます。","type":"noun","meaning_category":"adaptation to dry environments"},{"sentence":"Studying **xerophily** helps us understand how plants can survive climate change.","translation":"乾燥を好む性質を研究することは、植物が気候変動にどのように耐えられるかを理解するのに役立ちます。","type":"noun","meaning_category":"adaptation to dry environments"}]}