{"word":"Tongking","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"トンキン（ベトナムの北部地域、旧フランス領インドシナの一部）","english_definition":"An obsolete term for the northernmost part of Vietnam, formerly a French protectorate within French Indochina. Now part of modern Vietnam.","examples":[{"sentence":"Tongking was a French protectorate.","translation":"トンキンはフランスの保護領でした。"},{"sentence":"The Gulf of Tongking is located off the coast of northern Vietnam.","translation":"トンキン湾はベトナム北部の沿岸に位置しています。"}],"collocations":["Gulf of Tongking","Tonkin"],"synonyms":["Northern Vietnam"],"antonyms":[]}],"etymology":{"value":"Derived from Đàng Ngoài, a Vietnamese term meaning 'Outer Region'. It was used by Europeans to refer to the area controlled by the Trịnh lords.","priority":"★★☆"},"pronunciation":{"ipa":"/tɒŋˈkɪn/","syllables":"Tong-kin"},"inflection":{},"usage_notes":{"explanation":"The term \"Tongking\" is now largely obsolete and has been replaced by \"Northern Vietnam\" or simply \"Vietnam\". It is primarily encountered in historical contexts or geographical references related to the French colonial period.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (primarily in historical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Tongking\" is primarily used in historical or geographical contexts related to the French colonial period in Vietnam. It is not commonly used in modern English, and its meaning may not be immediately apparent to those unfamiliar with the history of Southeast Asia. Understanding its historical significance is key to interpreting its usage.","priority":"★★★"},"example_sentences":[{"sentence":"The French established a protectorate over Tongking in the late 19th century.","translation":"フランスは19世紀後半にトンキンを保護領とした。","type":"historical context","meaning_category":"historical region"},{"sentence":"The Gulf of Tongking Resolution played a significant role in the escalation of the Vietnam War.","translation":"トンキン湾決議はベトナム戦争の激化に重要な役割を果たした。","type":"historical context","meaning_category":"historical event"}]}