{"word":"meristem","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(植物)分裂組織","english_definition":"a region of plant tissue, found chiefly at the growing tips of roots and shoots and in the cambium, consisting of actively dividing cells forming new tissue.","examples":[{"sentence":"The apical meristem is responsible for the plant's primary growth.","translation":"頂端分裂組織は植物の一次成長を担っている。"},{"sentence":"Lateral meristems contribute to the plant's increase in girth.","translation":"側生分裂組織は植物の太さの増加に寄与する。"},{"sentence":"Meristem culture is used for plant propagation and virus elimination.","translation":"分裂組織培養は植物の繁殖やウイルスの除去に用いられる。"}],"collocations":["apical meristem (頂端分裂組織)","lateral meristem (側生分裂組織)","vascular cambium (維管束形成層)","cork cambium (コルク形成層)","intercalary meristem (介在分裂組織)","meristem culture (分裂組織培養)"],"synonyms":["embryonic tissue","growing point","proliferative tissue"],"antonyms":["differentiated tissue","mature tissue"]}],"etymology":{"value":"Derived from the Greek word 'meristos' meaning 'divisible', from 'merizein' meaning 'to divide'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmerɪstem","syllables":"mer-i-stem"},"inflection":{"noun_plural":"meristems"},"usage_notes":{"explanation":"Meristems are plant tissues containing undifferentiated cells capable of cell division. They are responsible for plant growth and development. There are different types of meristems, each with a specific function. Apical meristems are found at the tips of roots and shoots and are responsible for primary growth (increase in length). Lateral meristems, such as the vascular cambium and cork cambium, are responsible for secondary growth (increase in girth). Intercalary meristems are found in grasses and other monocots and allow for regrowth after grazing or mowing. Meristem culture is a technique used to propagate plants and eliminate viruses by culturing the meristematic tissue in vitro.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The meristem is a type of differentiated cell.","correct":"The meristem is a type of undifferentiated cell.","note":"Meristems are composed of undifferentiated cells, not differentiated cells."},{"incorrect":"Meristems are only found in the leaves of plants.","correct":"Meristems are found in various locations, including the tips of roots and shoots.","note":"Meristems are found in various locations, not just the leaves."}],"priority":"★★☆"},"related_words":{"derivatives":["meristematic (adjective)","meristematically (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meristem' refers to a specific type of plant tissue that contains cells capable of dividing and creating new cells. It's a technical term used in botany and plant biology to describe the areas of a plant where growth occurs. Understanding this term is essential for comprehending how plants develop and regenerate. The word is not commonly used outside of scientific contexts.","example_sentences":[]},"example_sentences":[{"sentence":"The plant's height increased due to cell division in the apical **meristem**.","translation":"植物の高さは、頂端**分裂組織**における細胞分裂によって増加した。","type":"noun","meaning_category":"植物組織"},{"sentence":"The vascular cambium, a type of lateral **meristem**, produces new xylem and phloem.","translation":"維管束形成層は、側生**分裂組織**の一種であり、新しい木部と師部を作り出す。","type":"noun","meaning_category":"植物組織"},{"sentence":"**Meristem** culture is an important technique for producing virus-free plants.","translation":"**分裂組織**培養は、ウイルスフリーの植物を生産するための重要な技術である。","type":"noun","meaning_category":"植物組織"}]}