{"word":"dipteran","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"双翅目（そうし目）の昆虫","english_definition":"An insect of the order Diptera (flies, mosquitoes, gnats, etc.), characterized by having two wings.","examples":[{"sentence":"Flies are dipterans.","translation":"ハエは双翅目の昆虫です。"},{"sentence":"Mosquitoes are annoying dipterans.","translation":"蚊は迷惑な双翅目の昆虫です。"}],"collocations":["dipteran insect","dipteran species"],"synonyms":["fly","mosquito","gnat","midge"],"antonyms":[]}],"etymology":{"value":"From the scientific order name Diptera, derived from Greek 'di-' (two) + 'pteron' (wing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪptərən/","syllables":"dip-ter-an"},"inflection":{"noun_plural":"dipterans"},"usage_notes":{"explanation":"'Dipteran' is a scientific term used to refer to any insect belonging to the order Diptera, which includes flies, mosquitoes, gnats, and midges. It is more commonly used in scientific or technical contexts rather than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A dipteran has four wings.","correct":"✓ A dipteran has two wings.","note":"Dipterans are characterized by having only two wings; the hind wings are reduced to halteres (balancing organs)."},{"incorrect":"✗ Dipterans are all harmful.","correct":"✓ Some dipterans are harmful, while others are beneficial.","note":"While some dipterans, like mosquitoes, are pests, others play important roles in pollination or decomposition."}],"priority":"★★☆"},"related_words":{"derivatives":["Diptera (noun: the order of insects to which dipterans belong)"],"phrases":["true flies"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dipteran' is a technical term used in entomology (the study of insects) to describe insects belonging to the order Diptera. These insects are characterized by having only two wings, a key feature that distinguishes them from other insect orders like Hymenoptera (bees, ants, wasps) which have four wings. The term is typically encountered in scientific literature, educational contexts, or discussions related to insect biology and classification."},"example_sentences":[{"sentence":"The study focused on the diversity of dipteran species in the Amazon rainforest.","translation":"その研究は、アマゾン熱帯雨林における双翅目昆虫の種の多様性に焦点を当てていました。","type":"noun","meaning_category":"双翅目昆虫"},{"sentence":"Dipteran larvae play a crucial role in aquatic ecosystems.","translation":"双翅目の幼虫は、水生生態系において重要な役割を果たしています。","type":"noun","meaning_category":"双翅目昆虫"}]}