{"word":"Bemidji","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ベミジー：アメリカ合衆国ミネソタ州北部の都市。","english_definition":"A city in northern Minnesota, United States. It is the county seat of Beltrami County, located on the shores of Lake Bemidji.","examples":[{"sentence":"Bemidji is known as the 'First City on the Mississippi'.","translation":"ベミジーは「ミシシッピ川最初の都市」として知られています。"},{"sentence":"I'm planning a trip to Bemidji next summer.","translation":"来年の夏にベミジーへ旅行する予定です。"}],"collocations":["Lake Bemidji","Bemidji State University","Paul Bunyan and Babe the Blue Ox statues"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Bemidji' is derived from the Ojibwe word 'Bemiji-gaamaag', meaning 'lake with cross waters'. This refers to the Mississippi River, which crosses Lake Bemidji.","priority":"★★☆"},"pronunciation":{"ipa":"/bəˈmɪdʒi/","syllables":"Be-mid-ji"},"inflection":{},"usage_notes":{"explanation":"Bemidji is a city in northern Minnesota, known for its logging history and outdoor recreational opportunities. It is a popular tourist destination, particularly for those interested in fishing, boating, and other water activities on Lake Bemidji. The city is also home to Bemidji State University.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Minnesota","Beltrami County","Mississippi River"],"related_people":["Paul Bunyan"]},"level_frequency":{},"readability_explanation":{"level":"Unknown","text":"Bemidji is a proper noun, specifically the name of a city. Understanding its meaning requires geographical knowledge of the United States, particularly Minnesota. The etymology is related to the Ojibwe language, which adds another layer of cultural understanding."},"example_sentences":[{"sentence":"We visited the Paul Bunyan statue in Bemidji.","translation":"ベミジーにあるポール・バニヤンの像を見に行きました。","type":"noun","meaning_category":"city"},{"sentence":"Bemidji is a popular destination for summer vacations.","translation":"ベミジーは夏の休暇に人気の場所です。","type":"noun","meaning_category":"city"}]}