{"word":"scullogue","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who performs menial tasks, especially in a kitchen; a kitchen drudge.","english_definition":"A kitchen servant; a drudge.","examples":[{"sentence":"The scullogue toiled away in the kitchen, scrubbing pots and pans.","translation":"その厨房の下働きは、鍋やフライパンを磨きながら台所で苦労して働いた。"},{"sentence":"She felt like a scullogue, always cleaning up after everyone else.","translation":"彼女はいつも他の人の後片付けばかりしている下働きのようだと思った。"}],"collocations":["kitchen scullogue","scullogue's work"],"synonyms":["drudge","kitchen servant","menial worker","underling"],"antonyms":["master","supervisor","manager"]}],"etymology":{"value":"Likely derived from the Irish word 'scológ', meaning a farmer's servant or a farm laborer. The term may have entered English through Irish English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskʌləɡ/","syllables":"scul-logue"},"inflection":{"noun_plural":"scullogues"},"usage_notes":{"explanation":"The term 'scullogue' is somewhat archaic and not commonly used in modern English. It specifically refers to someone performing the most basic and unpleasant tasks, often in a kitchen setting. It carries a connotation of low status and hard work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a scullogue in the office.","correct":"✓ He was a junior clerk in the office.","note":"'Scullogue' specifically refers to kitchen or domestic work, not office work."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (extremely rare)","frequency_google_ngram":"Very low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scullogue' is an archaic term, rarely used in modern English, referring to a kitchen servant or drudge performing menial tasks. Understanding this word requires familiarity with historical domestic roles and a broad vocabulary. It's unlikely to be encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The poor scullogue was covered in soot after a long day cleaning the chimney.","translation":"かわいそうな下働きは、長い一日煙突掃除をした後、すすだらけになった。","type":"noun","meaning_category":"kitchen servant"},{"sentence":"In the old castle, the scullogue was responsible for keeping the kitchen fires burning.","translation":"古い城では、下働きは台所の火を絶やさないようにする責任があった。","type":"noun","meaning_category":"kitchen servant"}]}