{"word":"unpenuriously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"惜しみなく、気前よく、けちけちせずに","english_definition":"in a manner that is not stingy or frugal; generously; lavishly.","examples":[{"sentence":"She unpenuriously donated a large sum of money to the charity.","translation":"彼女は惜しみなく多額の寄付をその慈善団体に行った。"},{"sentence":"The host unpenuriously provided food and drinks for all the guests.","translation":"ホストはすべてのゲストに惜しみなく食べ物と飲み物を提供した。"}],"collocations":["donate unpenuriously","provide unpenuriously","spend unpenuriously"],"synonyms":["generously","lavishly","liberally","bountifully","munificently"],"antonyms":["penuriously","stingily","frugally","miserly"]}],"etymology":{"value":"接頭辞 un-（否定）+ penuriously（けちけちと）","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnpəˈnjʊəriəsli/","syllables":"un-pe-nu-ri-ous-ly"},"inflection":{"notes":"adverb, no comparative or superlative forms"},"usage_notes":{"explanation":"'Unpenuriously' is the adverbial form of 'unpenurious,' meaning not stingy or frugal. It describes actions done in a generous or lavish manner, without holding back or being miserly. It is not a commonly used word, and its use often implies a deliberate contrast to a situation where one might expect stinginess or frugality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived unpenuriously, so he was always broke.","correct":"✓ He lived penuriously, so he was able to save money.","note":"Living 'unpenuriously' means spending generously, which would likely lead to being broke. Living 'penuriously' means living frugally and saving money."},{"incorrect":"✗ She unpenuriously lacked resources.","correct":"✓ She generously shared her limited resources.","note":"'Unpenuriously' describes how something is done, not a lack of something. It is used to describe actions, not states of being."}],"priority":"★☆☆"},"related_words":{"derivatives":["unpenurious (adjective)","penuriously (adverb)","penurious (adjective)","penury (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unpenuriously' is a relatively rare and sophisticated term. It means 'in a way that is not stingy or frugal,' essentially describing generosity or lavishness. Because it is formed by negating 'penuriously' (which itself is not a common word), understanding its meaning requires familiarity with more advanced vocabulary. It is unlikely to be encountered in everyday conversation or writing, and is more likely to appear in formal or literary contexts."},"example_sentences":[{"sentence":"The philanthropist unpenuriously funded numerous scholarships for underprivileged students.","translation":"その慈善家は、恵まれない学生のために数多くの奨学金を惜しみなく資金援助した。","type":"adverb","meaning_category":"generously"},{"sentence":"During the holiday season, the company unpenuriously distributed bonuses to all its employees.","translation":"ホリデーシーズン中、その会社は全従業員に惜しみなくボーナスを支給した。","type":"adverb","meaning_category":"lavishly"},{"sentence":"Unlike his frugal brother, he lived unpenuriously, enjoying the finer things in life.","translation":"倹約家の兄とは異なり、彼は惜しみなく暮らし、人生のより良いものを楽しんだ。","type":"adverb","meaning_category":"generously"}]}