{"word":"explantation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)摘出、除去 (特にインプラントや移植片)","english_definition":"(medicine) the removal of an organ, tissue, or implant from the body.","examples":[{"sentence":"The patient underwent explantation of the breast implants due to complications.","translation":"患者は合併症のため、豊胸インプラントの摘出手術を受けた。"},{"sentence":"Explantation of the infected hardware was necessary to resolve the infection.","translation":"感染を解消するため、感染した器具の摘出が必要だった。"}],"collocations":["breast implant explantation","hardware explantation","device explantation"],"synonyms":["removal","extraction","resection"],"antonyms":["implantation","insertion"]},{"part_of_speech":"noun","definition":"(植物学)組織培養における植物組織の切り出し","english_definition":"(botany) the process of excising plant tissue for tissue culture.","examples":[{"sentence":"Explantation of the leaf tissue was the first step in the micropropagation process.","translation":"葉組織の切り出しは、マイクロプロパゲーション（植物の組織培養による増殖）プロセスの最初のステップだった。"},{"sentence":"The explantation technique used affected the success rate of callus formation.","translation":"使用された切り出し技術が、カルス（植物の未分化細胞塊）形成の成功率に影響を与えた。"}],"collocations":["tissue explantation","leaf explantation","root explantation"],"synonyms":["excision","isolation"],"antonyms":["implantation"]}],"etymology":{"value":"From 'ex-' (out of) + 'plantation' (planting).  Implies taking something that was planted (or implanted) out.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksplænˈteɪʃən/","syllables":"ex-plan-ta-tion"},"inflection":{"noun_plural":"explantations"},"usage_notes":{"explanation":"The term 'explantation' is primarily used in medical and botanical contexts. In medicine, it refers to the removal of a device or tissue from the body. In botany, it refers to the removal of plant tissue for culture.  The medical usage is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed an explanation of the implant.","correct":"✓ The doctor performed an explantation of the implant.","note":"Do not confuse 'explantation' (removal) with 'explanation' (clarification)."}],"priority":"★★☆"},"related_words":{"derivatives":["explant (noun/verb)"],"related_terms":["implantation","transplantation","tissue culture","micropropagation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Explantation' is a technical term primarily used in medical and botanical fields. It refers to the removal of something that has been implanted or transplanted (in medicine) or the excision of plant tissue for culture (in botany). Due to its specialized usage, it is not a common word in general conversation."},"example_sentences":[{"sentence":"Following the infection, explantation of the prosthetic joint was unavoidable.","translation":"感染後、人工関節の摘出は避けられなかった。","type":"noun","meaning_category":"Medical removal"},{"sentence":"The explantation was performed under sterile conditions to prevent further contamination.","translation":"さらなる汚染を防ぐため、摘出手術は無菌状態で行われた。","type":"noun","meaning_category":"Medical removal"},{"sentence":"Successful explantation of the meristem tissue is crucial for virus-free plant propagation.","translation":"メリステム組織（植物の成長点組織）の切り出しの成功は、ウイルスフリーの植物増殖に不可欠である。","type":"noun","meaning_category":"Botanical excision"},{"sentence":"The scientist optimized the explantation protocol to improve callus induction.","translation":"科学者はカルス誘導を改善するために、切り出しプロトコルを最適化した。","type":"noun","meaning_category":"Botanical excision"}]}