{"word":"buff-tipped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a buff-colored tip or tips.","english_definition":"Describing something that has a tip or tips that are buff-colored (a pale yellowish-tan color).","examples":[{"sentence":"The buff-tipped moth is named for the color of its wing tips.","translation":"ウスキドクガは、その翼の先端の色にちなんで名付けられました。"},{"sentence":"These mushrooms are easily identified by their distinctive buff-tipped stems.","translation":"これらのキノコは、特徴的な黄褐色の先端を持つ茎によって容易に識別できます。"}],"collocations":["buff-tipped moth","buff-tipped stem","buff-tipped wings"],"synonyms":["cream-tipped","tan-tipped","yellowish-tipped"],"antonyms":[]}],"etymology":{"value":"The word is a compound of \"buff\" (referring to the pale yellowish-tan color) and \"tipped\" (meaning having a tip of a certain color).","priority":"N/A"},"pronunciation":{"ipa":"/ˌbʌfˈtɪpt/","syllables":"buff-tipped"},"inflection":{},"usage_notes":{"explanation":"This term is primarily descriptive, used in biology (especially entomology and mycology) to describe species with buff-colored tips. It is not a commonly used word outside of these specific contexts.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["tip","buff"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term \"buff-tipped\" is quite specialized and is primarily used in scientific or descriptive contexts, particularly in biology when describing the coloration of insects, fungi, or other organisms. It assumes familiarity with the term \"buff\" as a color descriptor. Due to its niche usage, it's not typically encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The rare fungus was identified by its buff-tipped cap.","translation":"その珍しい菌類は、黄褐色の先端を持つ傘によって識別されました。","type":"descriptive","meaning_category":"coloration"},{"sentence":"Look for the buff-tipped antennae to identify this species of beetle.","translation":"この種の甲虫を識別するには、黄褐色の先端を持つ触角を探してください。","type":"descriptive","meaning_category":"identification"}]}