{"word":"rocaille","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ロカイユ（ロココ美術の装飾様式）","english_definition":"(architecture, decoration) A style of elaborate ornamentation, especially in architecture and decorative art, that originated in France in the early 18th century; a feature or element of this style.","examples":[{"sentence":"The palace was decorated in the rocaille style.","translation":"その宮殿はロカイユ様式で装飾されていた。"},{"sentence":"The rocaille detailing on the mirror was exquisite.","translation":"その鏡のロカイユのディテールは精巧だった。"}],"collocations":["rocaille style","rocaille decoration","rocaille ornament"],"synonyms":["rococo","shellwork","ornamentation"],"antonyms":["minimalism","simplicity"]}],"etymology":{"value":"From French rocaille, from Italian roccaglia, from roccia (“rock”). Literally, 'rock-work'.","priority":"★★★"},"pronunciation":{"ipa":"/rɒˈkaɪ/","syllables":"ro-caille"},"inflection":{"noun_plural":"rocailles"},"usage_notes":{"explanation":"'Rocaille' refers to a specific style of ornamentation prominent in Rococo art and architecture. It is characterized by elaborate, asymmetrical designs featuring curves, scrolls, shells, and other natural forms. The term is most often used in the context of art history or interior design.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rocaille was very modern.","correct":"✓ The design was inspired by rocaille.","note":"Rocaille is a historical style, so describing it as 'modern' is contradictory. It's more appropriate to say something is 'inspired by' or 'reminiscent of' rocaille."}],"priority":"★★☆"},"related_words":{"derivatives":["rococo"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rocaille' is a specialized term primarily used in art history and design contexts to describe a specific style of ornamentation within the Rococo movement. Understanding its meaning requires familiarity with art historical terminology. It is not a word commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The rocaille motifs in the ballroom created a sense of opulence.","translation":"舞踏室のロカイユのモチーフは、豪華さを醸し出していた。","type":"noun","meaning_category":"ロココ美術の装飾様式"},{"sentence":"The museum showcased a collection of rocaille furniture.","translation":"博物館ではロカイユ様式の家具のコレクションが展示されていた。","type":"noun","meaning_category":"ロココ美術の装飾様式"}]}