{"word":"Sarcogyps","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The scientific name for the Indian Vulture, now reclassified as Gyps indicus.","english_definition":"A former genus of Old World vultures, now considered synonymous with the genus Gyps; specifically, the Indian Vulture.","examples":[{"sentence":"Sarcogyps calvus was the former scientific name for the Indian Vulture.","translation":"Sarcogyps calvusは、かつてインドハゲワシの学名でした。"}],"synonyms":["Gyps indicus","Indian Vulture"],"antonyms":[]}],"etymology":{"value":"From 'sarco-' (flesh) + 'gyps' (vulture).","priority":"★★★"},"pronunciation":{"ipa":"/sɑːrˈkɒdʒɪps/","syllables":"Sar-co-gyps"},"inflection":{"noun_plural":"Sarcogyps"},"usage_notes":{"explanation":"This term is primarily used in ornithological or zoological contexts, particularly when discussing the historical classification of vultures. It's less common now that the species has been reclassified under the genus Gyps.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Sarcogyps flying over the field, it was huge!","correct":"✓ I saw an Indian Vulture (Gyps indicus) flying over the field, it was huge!","note":"Use the current scientific name (Gyps indicus) or the common name (Indian Vulture) for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["Sarcogyps calvus (former species name)"],"related_species":["Gyps (genus)","Gyps indicus (Indian Vulture)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sarcogyps' is a highly specialized term used in the context of zoological taxonomy, specifically related to the historical classification of the Indian Vulture. Understanding requires familiarity with scientific nomenclature and the principles of taxonomic revision. Its use is largely confined to scientific publications and discussions among experts in ornithology or related fields."},"example_sentences":[{"sentence":"The genus Sarcogyps was revised to Gyps based on phylogenetic analysis.","translation":"系統解析に基づいて、Sarcogyps属はGyps属に改訂されました。","type":"noun","meaning_category":"scientific classification"},{"sentence":"Older ornithological texts may refer to the Indian Vulture as Sarcogyps calvus.","translation":"古い鳥類学の文献では、インドハゲワシがSarcogyps calvusとして言及されている場合があります。","type":"noun","meaning_category":"historical reference"}]}