{"word":"De-calvinize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To remove Calvinistic influences or characteristics from something.","english_definition":"To remove or reverse the influence of Calvinism.","examples":[{"sentence":"The university sought to de-calvinize its curriculum by introducing more diverse perspectives.","translation":"大学は、より多様な視点を取り入れることで、カリキュラムからカルヴァン主義の影響を取り除こうとした。"},{"sentence":"The artist aimed to de-calvinize the traditional aesthetic by incorporating elements of sensuality and pleasure.","translation":"その芸術家は、官能性や快楽の要素を取り入れることで、伝統的な美学からカルヴァン主義の影響を取り除くことを目指した。"}],"collocations":["de-calvinize society","de-calvinize education","de-calvinize culture"],"synonyms":["secularize","liberalize","modernize"],"antonyms":["calvinize","indoctrinate","conservatize"]}],"etymology":{"value":"Formed by adding the prefix 'de-' (meaning 'removal' or 'reversal') to 'Calvinize,' which means to bring under the influence of Calvinism.","priority":"★★★"},"pronunciation":{"ipa":"/diːˈkælvɪnaɪz/","syllables":"De-cal-vin-ize"},"inflection":{"verb_forms":{"present_simple":["de-calvinize","de-calvinizes"],"past_simple":"de-calvinized","past_participle":"de-calvinized","present_participle":"de-calvinizing"}},"usage_notes":{"explanation":"'De-calvinize' is used to describe the process of removing or lessening the impact of Calvinistic beliefs, values, or practices from a particular context, such as education, culture, or society. It often implies a shift towards more secular, liberal, or modern perspectives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was de-calvinized of its strict laws.","correct":"✓ The city de-calvinized its strict laws.","note":"The verb 'de-calvinize' is typically transitive, meaning it takes a direct object. The preposition 'of' is unnecessary and grammatically incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["decalvinization (noun)"],"related_terms":["Calvinism","Calvinist","secularization","liberalization"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is relatively uncommon and specific to discussions about the influence of Calvinism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'De-calvinize' is a specialized term used in academic or cultural discussions to describe the process of removing or reversing the influence of Calvinism. It suggests a deliberate effort to move away from traditional Calvinistic values or practices towards a more secular or liberal approach. This term is not commonly used in everyday conversation and requires an understanding of Calvinism to fully grasp its meaning."},"example_sentences":[{"sentence":"The government implemented policies to de-calvinize the legal system.","translation":"政府は、法制度からカルヴァン主義の影響を取り除くための政策を実施した。","type":"verb","meaning_category":"Removal of Calvinistic influence"},{"sentence":"The art movement sought to de-calvinize the perception of beauty.","translation":"その芸術運動は、美の認識からカルヴァン主義の影響を取り除くことを目指した。","type":"verb","meaning_category":"Reversing Calvinistic values"}]}