{"word":"reunitive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"再び結合させる、再統合する、和解させる","english_definition":"Tending to reunite; promoting reunion or reconciliation.","examples":[{"sentence":"The church played a reunitive role in the community after the disaster.","translation":"その教会は災害後、地域社会において再統合の役割を果たした。"},{"sentence":"Reunitive efforts are needed to bridge the gap between the two factions.","translation":"二つの派閥間の溝を埋めるためには、和解の努力が必要である。"}],"collocations":["reunitive force","reunitive power","reunitive effect"],"synonyms":["reconciliatory","unifying","integrative","restorative"],"antonyms":["divisive","separative","alienating"]}],"etymology":{"value":"From 'reunite' + '-ive'. 'Reunite' is from 're-' (again) + 'unite' (to join).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈjuːnɪtɪv/","syllables":"re-u-ni-tive"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms (more reunitive, most reunitive)."},"usage_notes":{"explanation":"'Reunitive' is primarily used to describe actions, forces, or qualities that aim to bring things or people back together, often after a period of separation or conflict. It emphasizes the act of restoring unity or harmony.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reunitive of the family was a joyous occasion.","correct":"✓ The reunion of the family was a joyous occasion.","note":"'Reunitive' is an adjective; the noun form for the act of reuniting is 'reunion'."}],"priority":"★☆☆"},"related_words":{"derivatives":["reunite (verb)","reunion (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reunitive' is a relatively uncommon word used in formal contexts to describe something that has the quality of bringing things back together. It's often used in discussions about social issues, politics, or personal relationships where the goal is to restore harmony or unity. Because it's not a frequently used word, it's more likely to be encountered in academic or specialized writing."},"example_sentences":[{"sentence":"The leader's speech had a reunitive effect, bringing together people from different backgrounds.","translation":"その指導者の演説は、異なる背景を持つ人々を結びつけ、再統合の効果をもたらした。","type":"adjective","meaning_category":"reconciling"},{"sentence":"The organization's reunitive mission is to help families separated by war.","translation":"その組織の再統合の使命は、戦争によって引き裂かれた家族を支援することである。","type":"adjective","meaning_category":"unifying"}]}