{"word":"geopositioning","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"地理位置特定、地理位置情報取得","english_definition":"The process of determining the geographic location of an object or device.","examples":[{"sentence":"Geopositioning is used in navigation apps to provide directions.","translation":"地理位置特定は、道案内を提供するためにナビゲーションアプリで使用されます。"},{"sentence":"The accuracy of geopositioning depends on the technology used.","translation":"地理位置特定の精度は、使用される技術に依存します。"},{"sentence":"Geopositioning data can be used for location-based advertising.","translation":"地理位置情報データは、位置情報に基づいた広告に使用できます。"}],"collocations":["geopositioning data","geopositioning system","geopositioning technology","accurate geopositioning","real-time geopositioning"],"synonyms":["location tracking","location finding","positioning","geolocation"],"antonyms":[]}],"etymology":{"value":"The term is formed by combining \"geo-\" (referring to the Earth) with \"positioning\" (the act of determining a position).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiːoʊpəˈzɪʃənɪŋ/","syllables":"ge-o-po-si-tion-ing"},"inflection":{"notes":"This is a noun, so it does not inflect."},"usage_notes":{"explanation":"Geopositioning refers to the process of finding the geographical location of something, like a phone, a vehicle, or even a person. It's a broad term that includes various technologies and methods used to determine these locations. The accuracy of geopositioning can vary depending on the technology used, such as GPS, Wi-Fi, or cellular triangulation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The geopositioning is very accuracy.","correct":"✓ The geopositioning is very accurate.","note":"\"Accuracy\" is a noun, while \"accurate\" is an adjective. Geopositioning can be accurate, but it doesn't have accuracy. "},{"incorrect":"✗ Geopositioning is only used for GPS.","correct":"✓ Geopositioning can use GPS, but also other technologies like Wi-Fi and cellular triangulation.","note":"GPS is a common method for geopositioning, but it's not the only one. Other technologies can also be used, especially indoors where GPS signals may be weak."}],"priority":"★★☆"},"related_words":{"derivatives":["geoposition (verb): to determine the geographic location of something.","geopositional (adjective): relating to geopositioning."],"related_terms":["GPS (Global Positioning System)","geolocation","GNSS (Global Navigation Satellite System)","location-based services (LBS)","triangulation","Wi-Fi positioning"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to the growth of location-based services.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Geopositioning' is a technical term that refers to the process of finding the exact location of something on Earth. This is done using technologies like GPS, Wi-Fi, or cell towers. It's used in many applications, such as navigation apps, location-based advertising, and emergency services. The accuracy of geopositioning can vary depending on the technology used. It's a more formal and precise term than simply saying 'finding a location'."},"example_sentences":[{"sentence":"The car's geopositioning system allowed rescuers to quickly find the accident site.","translation":"その車の地理位置特定システムのおかげで、救助隊は事故現場を迅速に見つけることができた。","type":"noun","meaning_category":"location determination"},{"sentence":"The company uses geopositioning data to target ads to customers in specific areas.","translation":"その会社は、特定の地域の顧客に広告をターゲティングするために地理位置情報データを使用している。","type":"noun","meaning_category":"data usage"},{"sentence":"Improved geopositioning technology has made drone deliveries more reliable.","translation":"改良された地理位置特定技術により、ドローン配達の信頼性が向上した。","type":"noun","meaning_category":"technology improvement"}]}