{"word":"restorability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"復元可能性、修復可能性","english_definition":"The quality or state of being restorable; the ability to be restored to a former condition or place.","examples":[{"sentence":"The restorability of the artifact was a key factor in the decision to purchase it.","translation":"その工芸品の復元可能性が、購入の決定における重要な要素でした。"},{"sentence":"Engineers assessed the restorability of the damaged bridge before beginning repairs.","translation":"技術者たちは修理を開始する前に、損傷した橋の修復可能性を評価しました。"}],"collocations":["assess restorability","evaluate restorability","high restorability","limited restorability"],"synonyms":["recoverability","repairability","reparability","reinstatement","reconstruction"],"antonyms":["irreparability","irrecoverability","unrestorability"]}],"etymology":{"value":"Formed from 'restorable' (capable of being restored) + '-ity' (suffix denoting a state or quality). 'Restorable' comes from 'restore' + '-able'. 'Restore' originates from Latin 'restaurare' (to rebuild, repair).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˌstɔːrəˈbɪləti/","syllables":"re-stor-a-bil-i-ty"},"inflection":{"noun_plural":"restorabilities"},"usage_notes":{"explanation":"'Restorability' refers to the degree to which something can be brought back to its original or former condition. It is often used in technical contexts, such as engineering, conservation, and data recovery. It implies a potential for recovery or repair, even if the process is complex or challenging.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The restorability was very good.","correct":"The restorability of the painting was very good.","note":"It's better to specify what the restorability is referring to, especially if it's not clear from the context."}],"priority":"★☆☆"},"related_words":{"derivatives":["restore (verb)","restoration (noun)","restorable (adjective)","unrestorable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Restorability' is a relatively uncommon and technical term. It describes the extent to which something can be returned to its original state or a previous condition. This word is typically used in specialized fields such as art conservation, engineering, or environmental science, where the ability to repair or recover something is important. Understanding this word requires a good grasp of abstract nouns and technical vocabulary."},"example_sentences":[{"sentence":"The high restorability of the old film made it possible to create a pristine digital version.","translation":"その古いフィルムの高い復元可能性のおかげで、元の状態に近いデジタル版を作成することができました。","type":"noun","meaning_category":"復元可能性"},{"sentence":"The restorability of the coral reefs is threatened by climate change and pollution.","translation":"サンゴ礁の修復可能性は、気候変動と汚染によって脅かされています。","type":"noun","meaning_category":"修復可能性"}]}