{"word":"porphyrogenitism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"帝王紫生主義：支配者の正当性を、支配者の家系が支配者として生まれたこと、特に帝王紫の部屋（産室）で生まれたことに由来するとする政治理論","english_definition":"The political theory that legitimizes a ruler's authority based on their birth into a ruling family, especially birth in the purple chamber (the imperial birthing room).","examples":[{"sentence":"Porphyrogenitism was a key element in the Byzantine Empire's succession practices.","translation":"帝王紫生主義は、ビザンツ帝国の継承慣行における重要な要素でした。"},{"sentence":"The concept of porphyrogenitism aimed to prevent power struggles by emphasizing birthright.","translation":"帝王紫生主義の概念は、生得権を強調することで権力闘争を防ぐことを目的としていました。"}],"collocations":["byzantine porphyrogenitism","legitimacy through porphyrogenitism","imperial succession and porphyrogenitism"],"synonyms":["birthright legitimacy","hereditary rule","dynastic succession"],"antonyms":["elective monarchy","meritocracy"]}],"etymology":{"value":"Derived from the Greek word 'porphyrogennetos' (πορφυρογέννητος), meaning 'born in the purple'. This refers to the purple chamber in the Byzantine palace where legitimate heirs to the throne were born.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɔːrfɪroʊˈdʒɛnɪtɪzəm/","syllables":"por-phy-ro-gen-i-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Porphyrogenitism is a specific historical concept primarily associated with the Byzantine Empire. It was used to distinguish between emperors born during the reign of their predecessor (and thus with a stronger claim to the throne) and those who became emperor through other means, such as military coup or marriage. The term emphasizes the importance of legitimate birth within the ruling dynasty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Porphyrogenitism is a type of government.","correct":"✓ Porphyrogenitism is a political theory about legitimacy.","note":"Porphyrogenitism is not a form of government itself, but a theory justifying a particular method of succession."}],"priority":"★★☆"},"related_words":{"derivatives":["porphyrogennetos (adjective: born in the purple)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency - a specialized historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Porphyrogenitism' is a specialized term related to Byzantine history and political theory. It refers to the concept that a ruler's legitimacy is enhanced by being born into the ruling family while their parent is already the emperor. This term is rarely used outside of academic contexts dealing with Byzantine history, political science, or related fields. Understanding this term requires knowledge of Byzantine imperial practices and succession dynamics."},"example_sentences":[{"sentence":"The emperor emphasized his porphyrogenitism to solidify his claim to the throne.","translation":"皇帝は、王位に対する自身の主張を固めるために、帝王紫生主義を強調しました。","type":"noun","meaning_category":"political theory"},{"sentence":"Historians study porphyrogenitism to understand Byzantine succession practices.","translation":"歴史家は、ビザンツ帝国の継承慣行を理解するために帝王紫生主義を研究します。","type":"noun","meaning_category":"historical concept"}]}