{"word":"mungrel","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"雑種犬、混血犬","english_definition":"A dog of mixed breed; a mongrel.","examples":[{"sentence":"The shelter was full of mungrels looking for homes.","translation":"そのシェルターは、家を探している雑種犬でいっぱいだった。"},{"sentence":"He adopted a scruffy mungrel from the streets.","translation":"彼は道端でみすぼらしい雑種犬を拾って飼った。"}],"collocations":["stray mungrel","mutt","mixed-breed dog"],"synonyms":["mongrel","mutt","cur"],"antonyms":["purebred","pedigree"],"notes":"Often used with a slightly negative connotation, implying inferiority compared to purebred dogs."},{"part_of_speech":"noun","definition":"（軽蔑的に）雑種、混血、混成物","english_definition":"(Derogatory) Anything of mixed origin or composition.","examples":[{"sentence":"The project was a mungrel of different ideas and approaches.","translation":"そのプロジェクトは、さまざまなアイデアやアプローチが混ざり合ったものだった。"},{"sentence":"He called the architecture a mungrel of styles.","translation":"彼はその建築様式を、さまざまな様式が混ざり合ったものだと呼んだ。"}],"collocations":["a mungrel of styles","a mungrel of ideas"],"synonyms":["mixture","hodgepodge","medley"],"antonyms":["pure","homogeneous"],"notes":"Used metaphorically to describe something that is not pure or of a single origin."}],"etymology":{"value":"Likely a variant of 'mongrel,' with a possible influence from dialectal pronunciations. The term 'mongrel' itself is of uncertain origin, possibly related to 'mingle' or 'among.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌŋɡrəl/","syllables":"mung-rel"},"inflection":{"noun_plural":"mungrels"},"usage_notes":{"explanation":"'Mungrel' is a less common variant of 'mongrel.' While both terms refer to dogs of mixed breed, 'mungrel' may carry a slightly stronger negative connotation in some contexts. It can also be used metaphorically to describe anything of mixed or impure origin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The mungrel was very expensive because it was a purebred.","correct":"The mungrel was adopted from a local shelter.","note":"Mungrels are, by definition, not purebred. The sentence should reflect the common origin of mungrels from shelters or as strays."}],"priority":"★☆☆"},"related_words":{"derivatives":["mungrelize (verb - to make into a mungrel)"],"phrases":["a bitza (bits of this and bits of that - Australian slang for a mongrel)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"None (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mungrel' is a relatively uncommon and somewhat derogatory term for a dog of mixed breed. It can also be used metaphorically to describe something of mixed or impure origin. Due to its potential negative connotations and infrequent usage, it's important to use this word carefully and be aware of its implications."},"example_sentences":[{"sentence":"The little mungrel wagged its tail excitedly.","translation":"その小さな雑種犬は興奮してしっぽを振った。","type":"noun","meaning_category":"雑種犬"},{"sentence":"The design was a mungrel of modern and classical elements.","translation":"そのデザインは、現代的な要素と古典的な要素が混ざり合ったものだった。","type":"noun","meaning_category":"混成物"}]}