{"word":"azygospore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"接合胞子（せつごうほうし）: 不完全な接合によって形成される厚壁の休眠胞子。特に、接合菌類に見られる。","english_definition":"A thick-walled resting spore of certain algae and fungi, typically formed by the fusion of two similar gametangia.","examples":[{"sentence":"The zygospore develops into an azygospore under unfavorable conditions.","translation":"その接合胞子は、不利な条件下で接合胞子へと発達する。"}],"collocations":["form an azygospore","develop into an azygospore"],"synonyms":["resting spore","hypnospore"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「a-」（否定）+「zygos」（結合、軛）+「spora」（種子、胞子）に由来する。つまり、「結合していない胞子」という意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪzaɪɡəˈspɔːr/","syllables":"a-zy-go-spore"},"inflection":{"noun_plural":"azygospores"},"usage_notes":{"explanation":"Azygospores are asexual resting spores formed without typical conjugation or fusion of gametes. They are often produced under unfavorable environmental conditions to ensure survival. They are found in some algae and fungi, particularly in the Zygomycota.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The azygospore is a type of gamete.","correct":"✓ The azygospore is a type of spore.","note":"Azygospores are spores, not gametes. They are formed asexually, not through the fusion of gametes."}],"priority":"★☆☆"},"related_words":{"derivatives":["azygous (形容詞: 対になっていない、単一の)","zygomycete (名詞: 接合菌類)","zygospore (名詞: 接合胞子)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An azygospore is a specialized type of spore formed asexually, meaning without the fusion of gametes (sex cells). It's a resting spore, which means it's designed to survive harsh conditions and germinate when conditions become more favorable. This term is primarily used in the context of mycology (the study of fungi) and phycology (the study of algae), so it's considered a technical term.","priority":"★☆☆"},"example_sentences":[{"sentence":"When nutrients are scarce, some fungi produce azygospore to survive.","translation":"栄養が乏しいとき、一部の菌類は生存のために接合胞子を生成する。","type":"noun","meaning_category":"接合胞子"}]}