{"word":"Hermetist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘルメス主義者、ヘルメス思想の研究者・実践者","english_definition":"A follower or practitioner of Hermeticism.","examples":[{"sentence":"The Hermetists of the Renaissance were deeply interested in alchemy and astrology.","translation":"ルネサンス期のヘルメス主義者たちは、錬金術と占星術に深い関心を寄せていた。"},{"sentence":"Some modern Hermetists focus on the philosophical aspects of the tradition.","translation":"現代のヘルメス主義者の中には、この伝統の哲学的側面に焦点を当てる者もいる。"}],"collocations":["Renaissance Hermetist (ルネサンス期のヘルメス主義者)","modern Hermetist (現代のヘルメス主義者)","follow Hermetic principles (ヘルメス主義の原則に従う)","study Hermetic texts (ヘルメス文書を研究する)"],"synonyms":["Hermetic philosopher","follower of Hermeticism","practitioner of Hermeticism"],"antonyms":["skeptic","materialist","atheist"]},{"part_of_speech":"adjective","definition":"ヘルメス主義の、ヘルメス思想の","english_definition":"Relating to Hermeticism or Hermetic philosophy.","examples":[{"sentence":"Hermetist writings often blend philosophy, religion, and magic.","translation":"ヘルメス主義の著作は、しばしば哲学、宗教、魔法を融合させている。"},{"sentence":"The Hermetist tradition has influenced various esoteric movements.","translation":"ヘルメス主義の伝統は、様々な秘教運動に影響を与えてきた。"}],"collocations":["Hermetist philosophy (ヘルメス主義哲学)","Hermetist teachings (ヘルメス主義の教え)","Hermetist texts (ヘルメス文書)","Hermetist principles (ヘルメス主義の原則)"],"synonyms":["Hermetic","esoteric","occult","mystical"],"antonyms":["scientific","rational","materialistic"]}],"etymology":{"value":"The term \"Hermetist\" derives from \"Hermes Trismegistus,\" a legendary figure believed to be a synthesis of the Greek god Hermes and the Egyptian god Thoth. Hermeticism, the philosophical and religious tradition associated with Hermes Trismegistus, is the source of the term.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɜːrmətɪst/","syllables":"Her-me-tist"},"inflection":{"noun_plural":"Hermetists"},"usage_notes":{"explanation":"The term \"Hermetist\" refers to someone who adheres to or studies Hermeticism, a philosophical and religious tradition based on writings attributed to Hermes Trismegistus. Hermeticism encompasses a wide range of beliefs and practices, including alchemy, astrology, magic, and philosophy. Hermetists often seek to understand the relationship between the microcosm (humanity) and the macrocosm (the universe) and to achieve spiritual enlightenment through knowledge and self-transformation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hermetic.","correct":"✓ He is a Hermetist. / ✓ He is a Hermetic philosopher.","note":"\"Hermetic\" is an adjective, while \"Hermetist\" is the noun referring to a person. Using \"hermetic\" as a noun is grammatically incorrect. You can use \"hermetic philosopher\" instead."},{"incorrect":"✗ Hermetists believe in science.","correct":"✓ Hermetists believe in spiritual transformation.","note":"While some Hermetists may appreciate scientific knowledge, the core of Hermeticism lies in spiritual and philosophical pursuits, not scientific inquiry. This is a generalization, and individual Hermetists may have varying views."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hermetic (adjective: relating to Hermes Trismegistus or Hermeticism)","Hermeticism (noun: the philosophical and religious tradition associated with Hermes Trismegistus)","Hermetically (adverb: in a hermetic manner; tightly sealed)"],"phrases":["Hermetic Order of the Golden Dawn (ヘルメス学黄金の夜明け団)","Emerald Tablet (エメラルド板)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Hermetist\" is a specialized term referring to followers or practitioners of Hermeticism, a complex philosophical and religious tradition. Understanding this word requires familiarity with the history of Hermeticism, its key figures like Hermes Trismegistus, and its core concepts, such as the interconnectedness of the microcosm and macrocosm. The word is primarily encountered in academic or esoteric contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **Hermetist** believed that the universe was governed by a set of knowable principles.","translation":"そのヘルメス主義者は、宇宙は知りうる一連の原則によって支配されていると信じていた。","type":"noun","meaning_category":"ヘルメス主義者"},{"sentence":"Many **Hermetist** scholars study the Corpus Hermeticum.","translation":"多くのヘルメス主義の研究者は、ヘルメス全書を研究している。","type":"noun","meaning_category":"ヘルメス主義者"},{"sentence":"The **Hermetist** tradition emphasizes the importance of inner transformation.","translation":"ヘルメス主義の伝統は、内面の変容の重要性を強調している。","type":"adjective","meaning_category":"ヘルメス主義の"},{"sentence":"Alchemy is a key component of **Hermetist** philosophy.","translation":"錬金術は、ヘルメス主義哲学の重要な要素である。","type":"adjective","meaning_category":"ヘルメス主義の"}]}