{"word":"self-flagellation","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"自己鞭撻、自虐行為、自己批判","english_definition":"The act of hitting oneself with a whip or other instrument as a form of religious discipline or punishment; excessive criticism of oneself.","examples":[{"sentence":"Some religious sects practice self-flagellation as a form of penance.","translation":"一部の宗教宗派は、苦行の一形態として自己鞭撻を行う。"},{"sentence":"After failing the exam, he engaged in a period of intense self-flagellation.","translation":"試験に失敗した後、彼は激しい自己批判の期間に入った。"},{"sentence":"The author's self-flagellation in the preface was almost comical.","translation":"序文における著者の自己批判は、ほとんど喜劇的だった。"}],"collocations":["engage in self-flagellation (自己鞭撻を行う)","a form of self-flagellation (自己鞭撻の一形態)","religious self-flagellation (宗教的な自己鞭撻)","emotional self-flagellation (感情的な自己鞭撻)"],"synonyms":["self-mortification","self-punishment","penance","remorse","self-reproach","self-criticism"],"antonyms":["self-praise","self-congratulation","self-satisfaction","complacency"]},{"part_of_speech":"noun","definition":"（比喩的に）過度な自己批判、自己嫌悪","english_definition":"(Figuratively) Excessive or unnecessary self-criticism or self-hatred.","examples":[{"sentence":"There's no need for such self-flagellation; everyone makes mistakes.","translation":"そんなに自己嫌悪になる必要はありません。誰でも間違いを犯します。"},{"sentence":"Her constant self-flagellation was exhausting to witness.","translation":"彼女の絶え間ない自己批判を見るのは疲れた。"},{"sentence":"The team's coach discouraged self-flagellation after the loss, urging them to focus on improvement.","translation":"チームのコーチは、敗北後の自己批判を思いとどまらせ、改善に焦点を当てるよう促した。"}],"collocations":["unnecessary self-flagellation (不必要な自己鞭撻)","constant self-flagellation (絶え間ない自己鞭撻)","avoid self-flagellation (自己鞭撻を避ける)"],"synonyms":["self-condemnation","self-recrimination","self-torment","self-abasement","self-deprecation"],"antonyms":["self-acceptance","self-forgiveness","self-compassion"]}],"etymology":{"value":"'Self-' + 'flagellation'. Flagellation comes from the Latin 'flagellare', meaning 'to whip'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˌflædʒəˈleɪʃən/","syllables":"self-flag-el-la-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Self-flagellation' can refer literally to the act of whipping oneself, especially in a religious context. More commonly, it refers figuratively to excessive and often unwarranted self-criticism. The figurative sense is often used to describe someone who is overly harsh on themselves, dwelling on their mistakes and shortcomings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is doing self flagellation.","correct":"He is engaging in self-flagellation.","note":"The verb 'engage in' is often used with 'self-flagellation' to describe the act of self-criticism."},{"incorrect":"She needs to stop her self-flagellation.","correct":"She needs to stop her self-flagellating.","note":"'Self-flagellating' can be used as an adjective to describe someone who is engaging in self-flagellation."}],"priority":"★★☆"},"related_words":{"derivatives":["flagellate (verb, to whip)","flagellant (noun, someone who whips themselves or others)","self-flagellating (adjective, describing someone who engages in self-flagellation)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, but understood in educated contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-flagellation' is a term that can be understood on two levels. Literally, it refers to the act of whipping oneself, often as a religious practice. Figuratively, it describes the act of excessively criticizing oneself, often to the point of self-torment. The figurative meaning is more commonly encountered in modern usage. Understanding the etymology ('self-' + 'flagellation', from Latin 'flagellare' meaning 'to whip') helps to grasp both the literal and figurative senses. The term is typically used in more formal or literary contexts."},"example_sentences":[{"sentence":"The monk practiced daily self-flagellation as an act of devotion.","translation":"その修道士は献身の行為として、毎日の自己鞭撻を実践した。","type":"noun","meaning_category":"Religious practice"},{"sentence":"After the disastrous presentation, he was lost in self-flagellation, replaying every mistake in his mind.","translation":"悲惨なプレゼンテーションの後、彼は自己嫌悪に陥り、心の中で全ての過ちを繰り返していた。","type":"noun","meaning_category":"Figurative self-criticism"},{"sentence":"It's important to learn from your mistakes without resorting to self-flagellation.","translation":"自己嫌悪に陥ることなく、間違いから学ぶことが重要だ。","type":"noun","meaning_category":"Figurative self-criticism"},{"sentence":"Her self-flagellation over the missed deadline was unproductive and exhausting.","translation":"締め切りに間に合わなかったことに対する彼女の自己批判は、非生産的で疲弊するものだった。","type":"noun","meaning_category":"Figurative self-criticism"}]}