{"word":"grasshopperdom","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(通常軽蔑的に) 視野が狭く、近視眼的で、日和見主義的な状態や性質。特に、長期的な計画や戦略を立てず、目の前の利益だけを追求するような態度。","english_definition":"(Usually derogatory) The state or quality of being narrow-minded, short-sighted, and opportunistic, especially characterized by a lack of long-term planning or strategy, and a focus solely on immediate gains.","examples":[{"sentence":"The company's leadership was criticized for its grasshopperdom, focusing only on quarterly profits and ignoring long-term sustainability.","translation":"その会社のリーダーシップは、四半期ごとの利益だけを重視し、長期的な持続可能性を無視する、その近視眼的な姿勢を批判された。"},{"sentence":"His political career was marked by grasshopperdom, switching allegiances whenever it suited his personal ambitions.","translation":"彼の政治家としてのキャリアは、自分の個人的な野心に都合の良いときにいつでも忠誠を切り替える、その日和見主義的な姿勢によって特徴づけられた。"}],"collocations":["exhibit grasshopperdom (日和見主義的な態度を示す)","criticize for grasshopperdom (日和見主義的な態度を批判する)","avoid grasshopperdom (日和見主義的な態度を避ける)","grasshopperdom mentality (日和見主義的な考え方)","grasshopperdom approach (日和見主義的なアプローチ)"],"synonyms":["opportunism","short-sightedness","myopia","expediency","lack of vision","self-interest","pragmatism (sometimes, depending on context)"],"antonyms":["visionary","long-term planning","strategic thinking","altruism","foresight","principled","idealism"]},{"part_of_speech":"noun","definition":"イナゴの王国、イナゴの世界、イナゴの社会。","english_definition":"The realm, world, or society of grasshoppers.","examples":[{"sentence":"The children imagined themselves transported to grasshopperdom, where they could communicate with the insects.","translation":"子供たちは、自分がイナゴの世界に運ばれ、昆虫とコミュニケーションできると想像した。"},{"sentence":"The entomologist studied the complex social structures within grasshopperdom.","translation":"その昆虫学者は、イナゴの世界における複雑な社会構造を研究した。"}],"collocations":["enter grasshopperdom (イナゴの世界に入る)","study grasshopperdom (イナゴの世界を研究する)","life in grasshopperdom (イナゴの世界での生活)"],"synonyms":["grasshopper society","grasshopper realm","grasshopper world"],"antonyms":[]}],"etymology":{"value":"\"grasshopper\" + \"-dom\".  The suffix \"-dom\" typically denotes a state, condition, or realm. The metaphorical sense likely derives from the grasshopper's perceived tendency to live for the moment, without planning for the future (as famously depicted in Aesop's fable \"The Ant and the Grasshopper\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡræsˌhɒpərˈdɒm/","syllables":"grass-hop-per-dom"},"inflection":{"noun_plural":"grasshopperdoms"},"usage_notes":{"explanation":"The term \"grasshopperdom\" is relatively rare and often used in a critical or satirical context. It implies a lack of foresight and a focus on immediate gratification, often at the expense of long-term goals or ethical considerations. The metaphorical use is likely influenced by the fable of the ant and the grasshopper, where the grasshopper enjoys the present while neglecting preparations for the future. When used literally, it refers to the world or society of grasshoppers, but this usage is far less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's grasshopperdom led to innovative solutions.","correct":"✓ The company's grasshopperdom led to short-term profits but long-term problems.","note":"While opportunism can sometimes lead to innovation, \"grasshopperdom\" usually carries a negative connotation, implying a lack of sustainability or ethical considerations. It's more accurate to use it to describe situations where short-term gains come at a cost. "},{"incorrect":"✗ He admired the grasshopperdom of the politician.","correct":"✓ He criticized the grasshopperdom of the politician.","note":"\"Grasshopperdom\" is rarely used in a positive sense. It's more common to criticize someone for exhibiting this quality."}],"priority":"★★☆"},"related_words":{"derivatives":["grasshopper","-dom (suffix)"],"idioms_phrases":["ant and the grasshopper (fable)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Grasshopperdom\" is a rare and somewhat sophisticated term, often used in business or political contexts to criticize a focus on short-term gains at the expense of long-term strategy or ethical considerations. The term draws on the fable of the ant and the grasshopper, where the grasshopper represents a lack of foresight. Understanding the term requires familiarity with this fable and an understanding of the suffix \"-dom,\" which denotes a state or realm. The word is unlikely to be encountered in everyday conversation and is more likely to appear in analytical or critical writing."},"example_sentences":[{"sentence":"The CEO's grasshopperdom was evident in his decision to cut research and development funding to boost short-term profits.","translation":"CEOの近視眼的な姿勢は、短期的な利益を上げるために研究開発費を削減するという彼の決定に明らかだった。","type":"noun","meaning_category":"(軽蔑的に) 視野が狭く、近視眼的で、日和見主義的な状態や性質"},{"sentence":"The environmental group warned against the grasshopperdom of the logging industry, which was rapidly depleting forests for quick profits.","translation":"環境保護団体は、迅速な利益のために森林を急速に枯渇させている林業の日和見主義的な姿勢に対して警告を発した。","type":"noun","meaning_category":"(軽蔑的に) 視野が狭く、近視眼的で、日和見主義的な状態や性質"},{"sentence":"The children's story transported them to a fantastical grasshopperdom, where they learned about the importance of community.","translation":"子供たちの物語は、彼らを幻想的なイナゴの世界に運び込み、そこで彼らはコミュニティの重要性について学んだ。","type":"noun","meaning_category":"イナゴの王国、イナゴの世界、イナゴの社会"}]}