{"word":"hectography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘクトグラフ、謄写版","english_definition":"A printing process that uses a gelatin surface to transfer an image, typically used for producing a small number of copies.","examples":[{"sentence":"The teacher used hectography to make copies of the test for the class.","translation":"先生はクラスのためにテストのコピーを謄写版で作った。"},{"sentence":"Hectography was a popular method of duplication before the widespread use of photocopiers.","translation":"謄写版は、コピー機が広く使われるようになる前は、一般的な複写方法だった。"}],"collocations":["spirit hectograph","gelatin hectograph"],"synonyms":["duplicator","mimeograph","spirit duplicator"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hektos' meaning 'hundred' and 'grapho' meaning 'to write'. This refers to the ability to produce a relatively large number of copies (originally thought to be around a hundred).","priority":"★★☆"},"pronunciation":{"ipa":"/hɛkˈtɒɡrəfi/","syllables":"hec-tog-ra-phy"},"inflection":{"noun_plural":"hectographies"},"usage_notes":{"explanation":"Hectography is an obsolete printing process. It was commonly used in schools and offices for creating limited numbers of copies before more modern technologies like photocopying became prevalent. The term is rarely used today except in historical contexts or among enthusiasts of vintage technology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a hectograph to photocopy the document.","correct":"✓ I used a photocopier to photocopy the document.","note":"Hectography is a specific type of printing process, not photocopying. Use 'photocopier' for modern photocopying. If you are using hectography, use it to duplicate, not photocopy."}],"priority":"★☆☆"},"related_words":{"derivatives":["hectograph (verb): to reproduce using hectography","hectographic (adjective): relating to hectography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - an obsolete term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hectography' refers to an obsolete printing process. It is unlikely to be encountered in everyday contexts and is primarily relevant in discussions of historical printing methods or vintage technology. Understanding the term requires familiarity with the history of office technology and printing processes."},"example_sentences":[{"sentence":"The old school records were reproduced using **hectography**.","translation":"古い学校の記録は謄写版を使って複製された。","type":"noun","meaning_category":"printing process"},{"sentence":"Before photocopiers, **hectography** was a common way to duplicate documents.","translation":"コピー機が登場する前は、謄写版が文書を複製する一般的な方法だった。","type":"noun","meaning_category":"printing process"}]}