{"word":"Spillages","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) こぼれたもの、漏出物、液体の散乱","english_definition":"(plural) Amounts of liquid that have been spilled; the act or an instance of spilling.","examples":[{"sentence":"Clean up all spillages immediately to prevent accidents.","translation":"事故を防ぐために、こぼれたものはすぐにすべて清掃してください。"},{"sentence":"The report detailed the spillages from the oil tanker.","translation":"報告書は、石油タンカーからの漏出物を詳細に記述した。"},{"sentence":"We need to improve our procedures to minimize spillages.","translation":"漏出を最小限に抑えるために、手順を改善する必要があります。"}],"collocations":["oil spillages (石油の漏出)","chemical spillages (化学物質の漏出)","accidental spillages (偶発的な漏出)","minor spillages (軽微な漏出)","major spillages (重大な漏出)"],"synonyms":["spills","leaks","overflows","effusions"],"antonyms":[],"related_forms":["spillage (単数形)"],"notes":"'Spillages' is the plural form of 'spillage'. It refers to multiple instances or amounts of spilled liquid."}],"etymology":{"value":"Derived from 'spill' (to allow or cause to flow over the edge of a container) with the suffix '-age' (denoting an action, process, or result).","priority":"★★☆"},"pronunciation":{"ipa":"ˈspɪlɪdʒɪz","syllables":"spil-lage-s"},"inflection":{"noun_plural":"spillages"},"usage_notes":{"explanation":"'Spillages' is used to refer to multiple instances or quantities of spilled liquid. It is often used in contexts related to safety, environmental protection, and accident prevention. It is a countable noun, unlike 'spillage' which can sometimes be used as an uncountable noun.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spillage were cleaned up.","correct":"✓ The spillages were cleaned up.","note":"When referring to multiple instances, use the plural form 'spillages' with a plural verb."},{"incorrect":"✗ There was many spillage.","correct":"✓ There were many spillages.","note":"Use 'spillages' as the plural form when referring to multiple instances or amounts."}],"priority":"★★☆"},"related_words":{"derivatives":["spill (verb, noun)","spiller (noun)"],"related_terms":["leakage","discharge","effluent","contamination"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Spillages' refers to multiple instances where liquids have been accidentally released or overflowed. It is commonly used in contexts where preventing and managing such incidents are important, such as in industrial settings or when discussing environmental issues. Understanding this term is useful for comprehending reports, safety guidelines, and discussions related to liquid management and accident prevention."},"example_sentences":[{"sentence":"The company has invested in new equipment to prevent chemical spillages.","translation":"その会社は、化学物質の漏出を防ぐために新しい設備に投資した。","type":"general","meaning_category":"Prevention"},{"sentence":"The environmental agency is investigating recent oil spillages in the area.","translation":"環境庁は、地域での最近の石油漏出を調査している。","type":"environmental","meaning_category":"Investigation"},{"sentence":"Proper training can help reduce the number of spillages in the laboratory.","translation":"適切な訓練は、実験室での漏出の数を減らすのに役立つ。","type":"safety","meaning_category":"Safety"}]}