{"word":"superindictment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 追加起訴、追加の起訴状","english_definition":"A second indictment issued while a prior indictment is pending, usually containing the same charges but with some modifications or additions.","examples":[{"sentence":"The prosecutor sought a superindictment to add more charges to the case.","translation":"検察官は、事件にさらに罪状を追加するために、追加起訴を求めた。"},{"sentence":"The defense argued that the superindictment was unnecessary and prejudicial.","translation":"弁護側は、追加起訴は不必要であり、偏見を招くと主張した。"}],"collocations":["seek a superindictment","file a superindictment","challenge a superindictment","dismiss a superindictment"],"synonyms":["additional indictment","superseding indictment"],"antonyms":[]}],"etymology":{"value":"'super-' (上に、超えて) + 'indictment' (起訴) から構成される。既存の起訴状に追加または取って代わる起訴状であることを意味する。","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːpərɪnˈdaɪtmənt","syllables":"su-per-in-dict-ment"},"inflection":{"noun_plural":"superindictments"},"usage_notes":{"explanation":"A superindictment is used when the prosecution wants to modify or add to the charges in an existing indictment without having to start the entire process over. It is often used to correct errors, add new evidence, or include additional charges that have come to light since the original indictment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The superindictment was used to drop all charges.","correct":"✓ The superindictment was used to add more charges.","note":"A superindictment typically adds or modifies charges, not drops them entirely. Dropping all charges would usually involve a dismissal."}],"priority":"★★☆"},"related_words":{"derivatives":["indict","indictment"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'superindictment' is a legal term, rarely used outside of legal contexts. It refers to a second indictment issued while a prior indictment is still active, usually to add or modify charges. Understanding this term requires familiarity with legal procedures and terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The government obtained a superindictment against the defendant, adding charges of conspiracy.","translation":"政府は被告に対する追加起訴を獲得し、共謀の罪状を追加した。","type":"noun","meaning_category":"追加起訴"},{"sentence":"The judge allowed the superindictment to proceed, finding that it did not prejudice the defendant's rights.","translation":"裁判官は、追加起訴が被告の権利を侵害しないと判断し、手続きを進めることを許可した。","type":"noun","meaning_category":"追加起訴"}]}