{"word":"Percid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スズキ目スズキ亜目スズキ科に属する魚の総称","english_definition":"A fish of the family Percidae, order Perciformes.","examples":[{"sentence":"The walleye is a popular Percid fish for anglers.","translation":"ウォールアイは釣り人にとって人気のあるスズキ目の魚です。"}],"collocations":["Percid fish","Percid family"],"synonyms":["perch","darter","pikeperch","walleye"],"antonyms":[]}],"etymology":{"value":"From Percidae, the family name, which is derived from Perca, the genus name for perch.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɜːrsɪd/","syllables":"Per-cid"},"inflection":{"noun_plural":"Percids"},"usage_notes":{"explanation":"'Percid' is a term used in ichthyology (the study of fish) to refer to any member of the Percidae family. This family includes many well-known freshwater fish species, such as perch, walleye, and darters.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Percidae in the lake.","correct":"✓ I saw a Percid in the lake.","note":"'Percidae' is the family name, while 'Percid' is the noun referring to a member of that family."}],"priority":"★★☆"},"related_words":{"derivatives":["Percidae (family)","Perca (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Percid' is a scientific term used to classify fish belonging to the Percidae family. It is not commonly used in everyday language but is relevant in the context of zoology, ichthyology, or fishing. Understanding this term requires some familiarity with biological classification systems."},"example_sentences":[{"sentence":"Many lakes in North America are populated with various Percid species.","translation":"北米の多くの湖には、さまざまなスズキ目の魚が生息しています。","type":"noun","meaning_category":"fish"},{"sentence":"Scientists are studying the impact of climate change on Percid populations.","translation":"科学者たちは、気候変動がスズキ目の魚の個体数に与える影響を研究しています。","type":"noun","meaning_category":"fish"}]}