{"word":"overpoeticize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(過度に)詩的に表現する、美化しすぎる","english_definition":"To make something seem more poetic or beautiful than it really is; to excessively romanticize or idealize.","examples":[{"sentence":"He tends to overpoeticize his experiences, making them sound more dramatic than they actually were.","translation":"彼は自分の経験を過度に詩的に表現する傾向があり、実際よりもドラマチックに聞こえるようにする。"},{"sentence":"The film overpoeticizes poverty, presenting it in a way that ignores the harsh realities.","translation":"その映画は貧困を美化しすぎており、厳しい現実を無視した形で提示している。"}],"collocations":["overpoeticize life (人生を美化しすぎる)","overpoeticize nature (自然を美化しすぎる)","overpoeticize suffering (苦しみを美化しすぎる)"],"synonyms":["romanticize","idealize","sentimentalize","beautify","glorify"],"antonyms":["understate","downplay","deglamorize","realistically portray"],"notes":"Often used in a critical context to suggest that something is being presented in an unrealistic or overly sentimental way."}],"etymology":{"value":"Formed by combining the prefix 'over-' (meaning 'excessively') with the verb 'poeticize' (to make poetic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərpoʊˈɛtɪsaɪz/","syllables":"o-ver-po-et-i-cize"},"inflection":{"verb_forms":{"present_simple":["overpoeticize","overpoeticizes"],"past_simple":"overpoeticized","past_participle":"overpoeticized","present_participle":"overpoeticizing"}},"usage_notes":{"explanation":"'Overpoeticize' implies a level of exaggeration or distortion in the way something is described, often to the point where it becomes unrealistic or misleading. It is commonly used to criticize artistic or literary works, as well as personal accounts or descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She overpoeticized about her cat.","correct":"✓ She overpoeticized the cat. / ✓ She overpoeticized her feelings about the cat.","note":"'Overpoeticize' is a transitive verb, so it needs a direct object. You overpoeticize *something*, not *about* something."}],"priority":"★★☆"},"related_words":{"derivatives":["poeticize (verb: 詩的にする)","poetic (adjective: 詩的な)","poetry (noun: 詩)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overpoeticize' is a relatively uncommon word that means to describe something in an excessively poetic or romantic way, often to the point of distorting reality. It's used to critique someone's tendency to make things sound more beautiful or dramatic than they actually are. You'll typically encounter this word in discussions about literature, art, or rhetoric where the speaker is analyzing the use of language and its effect on the audience."},"example_sentences":[{"sentence":"Critics accused the author of overpoeticizing the war, failing to capture its true horror.","translation":"批評家たちは、著者が戦争を美化しすぎて、その真の恐怖を捉えられていないと非難した。","type":"general","meaning_category":"美化しすぎる"},{"sentence":"Don't overpoeticize your memories; remember them as they truly were, both good and bad.","translation":"思い出を美化しすぎないでください。良いことも悪いことも含めて、ありのままに思い出してください。","type":"general","meaning_category":"美化しすぎる"},{"sentence":"The artist overpoeticized the landscape, creating an unrealistic and idealized image of the countryside.","translation":"その芸術家は風景を美化しすぎて、非現実的で理想化された田園地帯のイメージを作り出した。","type":"general","meaning_category":"美化しすぎる"}]}