{"word":"unmarriageability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"結婚不適格性、結婚できない状態、結婚の可能性がないこと","english_definition":"The state of being unsuitable for marriage; the condition of being unlikely to be married.","examples":[{"sentence":"Her unmarriageability stemmed from her unconventional views.","translation":"彼女の結婚不適格性は、彼女の型破りな考え方に起因していた。"},{"sentence":"The character's unmarriageability is a central theme in the novel.","translation":"その登場人物の結婚不適格性は、小説の中心的なテーマである。"},{"sentence":"Economic factors can contribute to a person's unmarriageability.","translation":"経済的要因が、人の結婚不適格性に寄与することがある。"}],"collocations":["perceived unmarriageability (認識された結婚不適格性)","social unmarriageability (社会的な結婚不適格性)","economic unmarriageability (経済的な結婚不適格性)"],"synonyms":["ineligibility for marriage","unsuitability for marriage","lack of marriage prospects","unattractiveness as a spouse"],"antonyms":["marriageability","eligibility for marriage","suitability for marriage","attractiveness as a spouse"]}],"etymology":{"value":"\"un-\" (否定) + \"marriageability\" (結婚適格性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnmærɪdʒəˈbɪləti/","syllables":"un-mar-ri-age-a-bil-i-ty"},"inflection":{"noun_plural":"unmarriageabilities (rare)"},"usage_notes":{"explanation":"\"Unmarriageability\" is a relatively uncommon word that refers to the state or condition of being considered unsuitable for marriage. It often implies social, economic, or personal factors that make a person less likely to be chosen as a spouse. The term can be subjective and culturally dependent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Her unmarriageability was because of she was poor.","correct":"✓ Her unmarriageability was because she was poor.","note":"The phrase 'because of' should be followed by a noun or noun phrase, not a clause starting with 'she was'. Alternatively, you can use 'because' followed by a clause."},{"incorrect":"✗ The unmarriageability is a problem for many women.","correct":"✓ Unmarriageability is a problem for many women.","note":"The definite article 'the' is unnecessary here as we are referring to the general concept of unmarriageability."}],"priority":"★☆☆"},"related_words":{"derivatives":["unmarriageable (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unmarriageability\" is a complex and uncommon term. It describes the state of being considered unsuitable for marriage, often due to social, economic, or personal reasons. Understanding this word requires a high level of English proficiency, as it is not frequently used in everyday conversation and is more likely to appear in academic or literary contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Her perceived unmarriageability was a source of great anxiety for her family.","translation":"彼女の認識された結婚不適格性は、家族にとって大きな不安の種だった。","type":"general","meaning_category":"結婚不適格性"},{"sentence":"The novel explores the theme of female unmarriageability in a patriarchal society.","translation":"その小説は、家父長制社会における女性の結婚不適格性というテーマを探求している。","type":"literary","meaning_category":"結婚不適格性"},{"sentence":"Social stigma can contribute to a person's unmarriageability, regardless of their personal qualities.","translation":"社会的な偏見は、個人の資質に関係なく、人の結婚不適格性に寄与する可能性がある。","type":"social commentary","meaning_category":"結婚不適格性"}]}