{"word":"hectorship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or condition of being a hector; bullying behavior.","english_definition":"The state or condition of being a hector; bullying behavior.","examples":[{"sentence":"The hectorship displayed by the older students was unacceptable.","translation":"年長の生徒たちによるいじめ行為は容認できませんでした。"}],"collocations":[],"synonyms":["bullying","intimidation","domineering","coercion"],"antonyms":["submission","meekness","gentleness"]}],"etymology":{"value":"Derived from the word 'hector', referring to a bully, which in turn comes from the name of the Trojan hero Hector, known for his bravery but sometimes portrayed as overbearing.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhektərʃɪp","syllables":"hek-tor-ship"},"inflection":{"noun_plural":"hectorships"},"usage_notes":{"explanation":"'Hectorship' is a relatively uncommon word. It describes the act or state of behaving like a 'hector,' which is someone who bullies or intimidates others. The term is typically used to describe a pattern of such behavior rather than a single incident.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He engaged in hectorship towards his friends.","correct":"✓ He engaged in hectoring behavior towards his friends.","note":"'Hectoring' (adjective or gerund) is more commonly used to describe the act of bullying than 'hectorship' (noun)."},{"incorrect":"✗ The hectorship was a result of his anger.","correct":"✓ The bullying was a result of his anger.","note":"In many contexts, 'bullying' is a more common and easily understood synonym for 'hectorship'."}],"priority":"★★☆"},"related_words":{"derivatives":["hector (noun, verb)","hectoring (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hectorship' is a rare and sophisticated term used to describe the act of bullying or behaving like a bully. It is less common than the word 'bullying' itself. Understanding the word requires familiarity with the term 'hector,' which refers to a person who intimidates or bullies others. Due to its rarity, it's more likely to be encountered in academic or formal writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The report condemned the hectorship prevalent in the workplace.","translation":"その報告書は、職場に蔓延するいじめ行為を非難した。","type":"noun","meaning_category":"bullying behavior"},{"sentence":"His hectorship made the other employees feel uncomfortable and intimidated.","translation":"彼のいじめ行為は、他の従業員を不快にさせ、脅迫感を与えた。","type":"noun","meaning_category":"bullying behavior"}]}