{"word":"relaxed-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having a relaxed expression in the eyes; appearing calm and at ease.","english_definition":"Describing someone whose eyes reflect a state of relaxation, calmness, or lack of tension.","examples":[{"sentence":"The guru had a relaxed-eyed expression, suggesting inner peace.","translation":"その導師は、内なる平和を示唆する、リラックスした目つきをしていた。"},{"sentence":"Even after the stressful meeting, she remained relaxed-eyed and composed.","translation":"ストレスの多い会議の後でも、彼女はリラックスした目つきを保ち、落ち着いていた。"},{"sentence":"The relaxed-eyed cat dozed in the sunbeam.","translation":"リラックスした目つきの猫が、日の光の中でうたた寝をしていた。"}],"collocations":["relaxed-eyed gaze","relaxed-eyed smile","relaxed-eyed expression","relaxed-eyed and calm"],"synonyms":["calm-eyed","peaceful-eyed","serene-eyed","placid-eyed","easygoing-eyed"],"antonyms":["tense-eyed","anxious-eyed","stressed-eyed","worried-eyed"]}],"etymology":{"value":"A compound adjective formed by combining \"relaxed\" (describing a state of ease and lack of tension) with \"eyed\" (having eyes of a certain kind). The construction implies that the relaxation is visible in the eyes.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈlækst aɪd/","syllables":"re-laxed-eyed"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"\"Relaxed-eyed\" is a descriptive adjective, often used to convey a sense of tranquility, composure, or inner peace. It suggests that the person or animal being described is free from stress or anxiety, and this is reflected in their eyes. The term is relatively uncommon but can be effective in creating a vivid image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was relaxed eyed after his vacation.","correct":"✓ He was relaxed-eyed after his vacation.","note":"The hyphen is important to indicate that \"relaxed\" and \"eyed\" are combined to form a single adjective modifying the subject."},{"incorrect":"✗ She had a relaxed eyes look.","correct":"✓ She had a relaxed-eyed look.","note":"Using the compound adjective \"relaxed-eyed\" correctly modifies the noun \"look.\""}],"priority":"★★☆"},"related_words":{"derivatives":["relaxed (adjective)","eyed (combining form)"],"phrasal_verbs":[],"related_adjectives":["calm","peaceful","serene","placid"],"related_nouns":["relaxation","calmness","peace","serenity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"relaxed-eyed\" is a compound adjective used to describe someone whose eyes reflect a state of calmness or relaxation. It is not a common term, so it is more likely to be encountered in descriptive writing where the author is trying to create a specific image or convey a particular mood. Understanding the meaning of the individual words (\"relaxed\" and \"eyed\") helps in deciphering the meaning of the compound adjective. It suggests a lack of tension or stress, visible through the eyes."},"example_sentences":[{"sentence":"The monk's relaxed-eyed gaze conveyed a sense of deep meditation.","translation":"その僧侶のリラックスした目つきは、深い瞑想の感覚を伝えていた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"After a week at the spa, she returned with a relaxed-eyed smile.","translation":"スパで一週間過ごした後、彼女はリラックスした目つきの笑顔で戻ってきた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The portrait captured the relaxed-eyed wisdom of the elderly statesman.","translation":"その肖像画は、年老いた政治家のリラックスした目つきの知恵を捉えていた。","type":"adjective","meaning_category":"Descriptive"}]}