{"word":"bodyhood","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"肉体を持つこと、身体性、肉体的な存在","english_definition":"The state or condition of having a physical body; embodiment; physicality.","examples":[{"sentence":"The concept of bodyhood explores the lived experience of having a body.","translation":"bodyhoodの概念は、身体を持つという生きた経験を探求する。"},{"sentence":"Her work examines the relationship between bodyhood and identity.","translation":"彼女の作品は、身体性とアイデンティティの関係を考察する。"},{"sentence":"The artist sought to capture the essence of bodyhood in his sculptures.","translation":"その芸術家は彫刻で身体性の本質を捉えようとした。"}],"collocations":["experience of bodyhood (身体性の経験)","concept of bodyhood (身体性の概念)","essence of bodyhood (身体性の本質)","study of bodyhood (身体性の研究)"],"synonyms":["embodiment","physicality","corporeality","materiality","incarnation"],"antonyms":["disembodiment","immateriality","spirituality"]},{"part_of_speech":"noun","definition":"（集合的に）身体、肉体","english_definition":"A body or group of bodies.","examples":[{"sentence":"The bodyhood of the dancers moved in perfect synchronicity.","translation":"ダンサーたちの身体は完璧なシンクロで動いた。"},{"sentence":"The bodyhood of the crowd pressed forward.","translation":"群衆の身体が前に押し寄せた。"}],"collocations":[],"synonyms":["bodies","physical forms"],"antonyms":[]}],"etymology":{"value":"'Body' + '-hood' (状態や性質を表す接尾辞).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒdihʊd/","syllables":"bod-y-hood"},"inflection":{"noun_plural":"bodyhoods"},"usage_notes":{"explanation":"'Bodyhood' is a relatively uncommon term, often used in academic or philosophical contexts to refer to the experience of having and living in a physical body. It emphasizes the lived, felt experience of embodiment rather than simply the objective fact of having a body. It is often used in discussions of identity, gender, disability studies, and phenomenology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bodyhood was injured in the accident.","correct":"✓ The body was injured in the accident.","note":"'Bodyhood' refers to the state of having a body, not the body itself. Use 'body' to refer to the physical form. "},{"incorrect":"✗ Bodyhood is not important, only the mind matters.","correct":"✓ The body is not important, only the mind matters. / ✓ The mind is more important than bodyhood.","note":"When contrasting the physical body with the mind, use 'body' or contrast 'mind' with the concept of 'bodyhood'."}],"priority":"★★☆"},"related_words":{"derivatives":["body (noun)","embodiment (noun)","disembodiment (noun)"],"phrases":["body politic (政治組織、国家)","body image (身体イメージ)","body language (ボディーランゲージ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bodyhood' is a specialized term, primarily used in academic writing, particularly in fields like philosophy, sociology, and gender studies. It refers to the subjective experience of having a body and how this experience shapes one's identity and perception of the world. The word is not commonly used in everyday conversation. Understanding its meaning requires familiarity with abstract concepts related to embodiment and physicality."},"example_sentences":[{"sentence":"Feminist theory often examines the social construction of bodyhood and its impact on women's lives.","translation":"フェミニスト理論はしばしば、身体性の社会的構築とそれが女性の生活に与える影響を考察する。","type":"noun","meaning_category":"肉体を持つこと、身体性"},{"sentence":"The philosopher argued that understanding bodyhood is essential for understanding human consciousness.","translation":"その哲学者は、人間の意識を理解するためには身体性を理解することが不可欠だと主張した。","type":"noun","meaning_category":"肉体を持つこと、身体性"},{"sentence":"Virtual reality seeks to simulate the sensation of bodyhood in a digital environment.","translation":"バーチャルリアリティは、デジタル環境で身体性の感覚をシミュレートしようとする。","type":"noun","meaning_category":"肉体を持つこと、身体性"}]}