{"word":"splenectopy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脾臓異所症、脾臓転位","english_definition":"A rare condition in which the spleen is located in an abnormal location within the body.","examples":[{"sentence":"Splenectopy can be difficult to diagnose due to its rarity and varied presentation.","translation":"脾臓異所症は、そのまれさと多様な症状のために診断が難しいことがある。"},{"sentence":"The patient was diagnosed with splenectopy after imaging revealed the spleen in the pelvic region.","translation":"画像検査で脾臓が骨盤領域にあることが判明し、患者は脾臓異所症と診断された。"}],"collocations":["congenital splenectopy","wandering spleen","pelvic splenectopy","thoracic splenectopy"],"synonyms":["wandering spleen","ectopic spleen"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'splen' (spleen), 'ek' (out of), and 'topos' (place).","priority":"★★☆"},"pronunciation":{"ipa":"/splɪˈnɛktəpi/","syllables":"sple-nec-to-py"},"inflection":{"noun_plural":"splenectopies"},"usage_notes":{"explanation":"Splenectopy, also known as wandering spleen or ectopic spleen, is a condition where the spleen is not in its normal position in the upper left quadrant of the abdomen. It can be found in the pelvis, thorax, or other unusual locations. This condition can lead to complications such as splenic torsion or infarction. Diagnosis typically involves imaging studies like CT scans or ultrasounds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected splenectomy instead of splenectopy.","correct":"✓ The doctor suspected splenectopy.","note":"Splenectomy is the surgical removal of the spleen, while splenectopy is the abnormal location of the spleen. These are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["splenectomy (surgical removal of the spleen)","spleen (organ affected in splenectopy)","ectopic (located in an abnormal place)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Splenectopy' is a highly specialized medical term referring to the abnormal location of the spleen. Understanding this term requires a strong background in medical terminology and anatomy. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Pelvic splenectopy can mimic other pelvic masses, leading to diagnostic challenges.","translation":"骨盤内脾臓異所症は他の骨盤内腫瘤に類似することがあり、診断上の課題となる。","type":"medical condition","meaning_category":"abnormal spleen location"},{"sentence":"Surgical intervention may be necessary to correct splenectopy and prevent complications.","translation":"脾臓異所症を矯正し、合併症を防ぐためには外科的介入が必要となる場合がある。","type":"medical intervention","meaning_category":"treatment of abnormal spleen location"}]}