{"word":"iconophile","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖像崇拝者、偶像擁護者","english_definition":"A person who supports the use of religious images or icons, especially in the Byzantine Church.","examples":[{"sentence":"The iconophiles argued that icons were a legitimate aid to worship.","translation":"聖像擁護者たちは、聖像は礼拝を助ける正当な手段であると主張した。"},{"sentence":"During the Iconoclastic Controversy, iconophiles faced persecution.","translation":"聖像破壊論争の間、聖像擁護者たちは迫害に直面した。"}],"collocations":["iconophile clergy","iconophile art","iconophile theology"],"synonyms":["image worshipper","iconodulist"],"antonyms":["iconoclast","image breaker"]},{"part_of_speech":"adjective","definition":"聖像崇拝の、偶像擁護の","english_definition":"Supporting or relating to the use or veneration of religious images or icons.","examples":[{"sentence":"The iconophile position was eventually adopted by the Church.","translation":"聖像擁護の立場は最終的に教会によって採用された。"},{"sentence":"Iconophile arguments emphasized the symbolic value of icons.","translation":"聖像擁護の議論は、聖像の象徴的な価値を強調した。"}],"collocations":["iconophile view","iconophile stance","iconophile tradition"],"synonyms":["image-venerating","iconodulic"],"antonyms":["iconoclastic","image-breaking"]}],"etymology":{"value":"From Greek 'eikōn' (image, icon) + 'philos' (loving). Literally, 'lover of images'.","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈkɒnəfaɪl/","syllables":"i-con-o-phile"},"inflection":{"noun_plural":"iconophiles"},"usage_notes":{"explanation":"The term 'iconophile' is primarily used in historical contexts, specifically referring to the Byzantine Iconoclastic Controversy (8th and 9th centuries). It describes those who defended the use of religious images (icons) against the iconoclasts, who sought to destroy them. While the term can be used more broadly to describe someone who appreciates or defends images, it is most strongly associated with this historical debate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an iconophile of modern art.","correct":"✓ He is a lover of modern art.","note":"While technically correct, 'iconophile' is rarely used to describe someone who simply likes art. Use 'art lover' or a similar term instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["iconophilia (noun: love or veneration of icons)"],"phrasal_verbs":[],"related_concepts":["iconoclasm (the destruction of religious images)","icon (a religious image)","veneration (respect or reverence)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Iconophile' is a specialized term primarily used in the context of Byzantine history and religious studies. It refers to someone who supports the use of religious images (icons) for veneration. The word is derived from Greek roots, meaning 'lover of images.' Understanding this term requires familiarity with the historical and theological debates surrounding the use of icons in Christianity. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The iconophile monks defended their sacred images against the emperor's decree.","translation":"聖像擁護派の修道士たちは、皇帝の命令に対して自分たちの神聖な像を守った。","type":"noun","meaning_category":"聖像崇拝者"},{"sentence":"The iconophile party eventually triumphed in the Byzantine court.","translation":"聖像擁護派は最終的にビザンツ帝国の宮廷で勝利を収めた。","type":"adjective","meaning_category":"聖像崇拝の"}]}