{"word":"butyrates","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"酪酸塩（酪酸のエステルまたは塩）","english_definition":"Plural form of butyrate: an ester or salt of butyric acid.","examples":[{"sentence":"Butyrates are produced in the colon by bacterial fermentation of dietary fiber.","translation":"酪酸塩は、食物繊維の細菌発酵によって結腸内で生成されます。"}],"collocations":["sodium butyrate","butyrate production","butyrate supplementation"],"synonyms":["butanoates"],"antonyms":[]}],"etymology":{"value":"From butyric acid + -ate (suffix indicating a salt or ester). Butyric acid is derived from Latin 'butyrum' meaning butter, as it was first discovered in rancid butter.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbjuːtɪreɪts/","syllables":"bu-ty-rates"},"inflection":{"noun_plural":"butyrates"},"usage_notes":{"explanation":"Butyrates are short-chain fatty acids (SCFAs) produced by the gut microbiota during the fermentation of dietary fibers. They serve as a primary energy source for colonocytes (cells lining the colon) and play a crucial role in maintaining gut health, reducing inflammation, and potentially preventing colorectal cancer. Butyrate supplementation is sometimes used to treat certain gastrointestinal disorders.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["butyrate (singular noun)","butyric acid","butyric"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Butyrates' refers to salts or esters of butyric acid, which are produced in the colon through bacterial fermentation of dietary fiber. These compounds are important for gut health, serving as an energy source for colon cells and potentially reducing inflammation. This term is generally used in scientific or medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the effects of butyrates on gut inflammation.","translation":"その研究では、酪酸塩が腸の炎症に及ぼす影響を調査しました。","type":"noun","meaning_category":"酪酸塩"},{"sentence":"Increasing dietary fiber intake can promote the production of butyrates in the colon.","translation":"食物繊維の摂取量を増やすと、結腸での酪酸塩の生成を促進できます。","type":"noun","meaning_category":"酪酸塩"}]}