{"word":"locomotiveness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"運動性、移動性、運動能力","english_definition":"The ability or tendency to move from place to place; the state or quality of being locomotive.","examples":[{"sentence":"The locomotiveness of animals is essential for their survival.","translation":"動物の運動性は生存に不可欠である。"},{"sentence":"Technological advancements have increased the locomotiveness of modern society.","translation":"技術の進歩は現代社会の移動性を高めた。"},{"sentence":"The locomotiveness of the robot was tested on various terrains.","translation":"ロボットの運動能力は様々な地形において試験された。"}],"collocations":["high locomotiveness (高い運動性)","low locomotiveness (低い運動性)","increase locomotiveness (運動性を高める)","test locomotiveness (運動性を試験する)"],"synonyms":["motility","mobility","ambulation","movement","locomotion"],"antonyms":["immobility","sedentariness","stationariness"]}],"etymology":{"value":"The word \"locomotiveness\" is derived from \"locomotive\" (adjective) + \"-ness\" (suffix indicating a state or quality). \"Locomotive\" comes from Latin \"locus\" (place) + \"motus\" (moved), meaning 'moving from a place'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌloʊkəˈmoʊtɪvnəs/","syllables":"lo-co-mo-tive-ness"},"inflection":{"noun_plural":"locomotivenesses (rarely used)"},"usage_notes":{"explanation":"\"Locomotiveness\" refers to the general ability or tendency to move from one place to another. It's often used in scientific or technical contexts to describe the movement capabilities of animals, machines, or systems. It emphasizes the quality or state of being able to move, rather than a specific instance of movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The locomotiveness of the car was very fast.","correct":"✓ The speed of the car was very high. / ✓ The car has high locomotiveness.","note":"\"Locomotiveness\" refers to the ability or quality of moving, not the speed. Use \"speed\" or rephrase to describe how fast something moves."},{"incorrect":"✗ The locomotiveness is important for transportation.","correct":"✓ Locomotion is important for transportation.","note":"\"Locomotion\" is more commonly used than \"locomotiveness\" to refer to the general process or means of moving."}],"priority":"★★☆"},"related_words":{"derivatives":["locomotive (noun, adjective)","locomote (verb)","locomotion (noun)","motility (noun)","mobility (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Locomotiveness\" is a relatively uncommon and technical term that refers to the ability or tendency to move from place to place. It's often used in scientific or engineering contexts to describe the movement capabilities of animals, machines, or systems. It's a more abstract concept than simply \"movement\" or \"locomotion,\" emphasizing the quality or state of being able to move. Because of its specialized usage, it's more likely to be encountered in academic or technical texts than in everyday conversation."},"example_sentences":[{"sentence":"The study examined the locomotiveness of different species of insects.","translation":"その研究では、様々な種類の昆虫の運動性が調査された。","type":"general","meaning_category":"運動性"},{"sentence":"The robot's locomotiveness was enhanced by the new wheel design.","translation":"ロボットの運動性は新しい車輪の設計によって強化された。","type":"technical","meaning_category":"運動能力"},{"sentence":"The locomotiveness of early humans allowed them to migrate across continents.","translation":"初期の人類の運動性は、彼らが大陸を移動することを可能にした。","type":"historical","meaning_category":"移動性"}]}