{"word":"Pulahanism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(フィリピンの)プルハネス運動","english_definition":"A religious and socio-political movement in the Philippines, primarily in the Visayas region, characterized by its members' wearing of red garments and belief in supernatural powers.","examples":[{"sentence":"Pulahanism emerged in the late 19th century as a reaction to Spanish colonial rule and later American occupation.","translation":"プルハネス運動は、19世紀後半にスペインの植民地支配、そして後のアメリカ占領への反発として起こった。"},{"sentence":"The Pulahan members believed that their red garments would protect them from harm.","translation":"プルハネスのメンバーは、赤い衣服が危害から身を守ると信じていた。"}],"collocations":["Pulahan leader","Pulahan revolt","Visayan Pulahan","religious movement","socio-political movement"],"synonyms":["Dios-Dios","colorum"],"antonyms":[]},{"part_of_speech":"noun","definition":"(フィリピンの)プルハネスの信奉","english_definition":"The beliefs and practices associated with the Pulahan movement.","examples":[{"sentence":"Pulahanism involved a syncretic blend of folk Catholicism and indigenous beliefs.","translation":"プルハネス運動は、民俗カトリックと土着の信仰の融合を伴っていた。"},{"sentence":"The practice of Pulahanism varied from region to region.","translation":"プルハネスの慣習は地域によって異なっていた。"}],"collocations":["religious practice","folk beliefs","syncretic religion"],"synonyms":["Pulahan beliefs","Pulahan practices"],"antonyms":[]}],"etymology":{"value":"From 'pulá,' the Visayan word for 'red,' referring to the red garments worn by the members.","priority":"中"},"pronunciation":{"ipa":"/puˈlɑːhənɪzəm/","syllables":"pu-la-ha-ni-zem"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Pulahanism' refers to both the movement itself and the set of beliefs associated with it. It is a specific historical and cultural phenomenon in the Philippines, particularly in the Visayas region.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Pulahanism is a political party.","correct":"Pulahanism was a religious and socio-political movement.","note":"Pulahanism was more than just a political party; it had strong religious and cultural elements."}],"priority":"中"},"related_words":{"derivatives":["Pulahan (noun: a member of the Pulahan movement)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"'Pulahanism' is a specialized term related to Philippine history and culture. Understanding it requires knowledge of the Visayas region and the socio-political context of the late 19th and early 20th centuries. The term is rarely used outside of academic or historical discussions.","priority":"中"},"example_sentences":[{"sentence":"The study focused on the impact of Pulahanism on the local communities.","translation":"その研究は、プルハネス運動が地域社会に与えた影響に焦点を当てていた。","type":"noun","meaning_category":"Movement"},{"sentence":"Pulahanism combined elements of folk religion and resistance against colonial powers.","translation":"プルハネス運動は、民俗宗教の要素と植民地権力への抵抗を組み合わせたものだった。","type":"noun","meaning_category":"Beliefs"}]}