{"word":"diapsidan","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"双弓類の","english_definition":"Relating to or belonging to the diapsida, a group of amniote tetrapods that developed two holes (temporal fenestra) in each side of their skulls about 300 million years ago during the late Carboniferous and early Permian periods.","examples":[{"sentence":"Diapsidan reptiles include dinosaurs, lizards, snakes, and birds.","translation":"双弓類の爬虫類には、恐竜、トカゲ、ヘビ、鳥類が含まれます。"}],"collocations":[],"synonyms":[],"antonyms":["anapsidan","synapsidan"]},{"part_of_speech":"noun","definition":"双弓類","english_definition":"An animal of the diapsid group.","examples":[{"sentence":"The diapsid skull structure is a key feature in the classification of reptiles and birds.","translation":"双弓類の頭蓋骨構造は、爬虫類と鳥類の分類における重要な特徴です。"}],"collocations":[],"synonyms":[],"antonyms":["anapsid","synapsid"]}],"etymology":{"value":"From the Greek words 'di' (two), 'apsis' (arch, loop), and '-ida' (plural suffix). Refers to the two temporal fenestrae (openings) behind each eye socket in the skull.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈæpsɪdən/","syllables":"di-ap-si-dan"},"inflection":{"noun_plural":"diapsidans"},"usage_notes":{"explanation":"'Diapsidan' is a technical term used in zoology and paleontology to classify a group of amniotes based on their skull structure. It is most often encountered in scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["diapsida (noun: the group of diapsid animals)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - a specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Diapsidan' is a highly specialized term primarily used within the fields of zoology and paleontology. Understanding this word requires familiarity with the classification of amniotes and their skull structures. It is unlikely to be encountered outside of scientific literature or academic discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The evolutionary success of diapsidan reptiles is partly attributed to their skull structure.","translation":"双弓類の爬虫類の進化的な成功は、部分的に彼らの頭蓋骨構造に起因しています。","type":"adjective","meaning_category":"Classification"},{"sentence":"Birds are considered to be highly derived diapsids.","translation":"鳥類は高度に進化した双弓類と考えられています。","type":"noun","meaning_category":"Classification"}]}