{"word":"shippable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"発送可能な、出荷可能な","english_definition":"Suitable or able to be shipped; able to be sent by mail or other carrier.","examples":[{"sentence":"This item is shippable to most countries.","translation":"この商品はほとんどの国に発送可能です。"},{"sentence":"Make sure the product is properly packaged to be shippable.","translation":"製品が発送可能となるように、適切に梱包されていることを確認してください。"},{"sentence":"The shippable weight of the package is 5 kilograms.","translation":"その荷物の発送可能な重量は5キログラムです。"}],"collocations":["shippable item","shippable product","shippable weight","shippable condition","shippable quantity"],"synonyms":["mailable","transportable","deliverable","portable"],"antonyms":["unshippable","non-shippable","undeliverable"]}],"etymology":{"value":"The word 'shippable' is formed by adding the suffix '-able' to the verb 'ship'. 'Ship' comes from the Old English word 'scip', meaning a boat or vessel. The suffix '-able' means 'capable of' or 'suitable for'. Thus, 'shippable' literally means 'capable of being shipped'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪpəbəl/","syllables":"ship-pa-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., easily shippable, readily shippable) and can appear in comparative and superlative forms in some contexts (e.g., more shippable, most shippable), though these are less common."},"usage_notes":{"explanation":"'Shippable' is commonly used in e-commerce, logistics, and retail to describe items that can be sent to customers via a shipping service. It often implies that the item meets certain size, weight, and packaging requirements. It is a practical term used to determine whether a product can be sold and delivered effectively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The shippable is ready.","correct":"✓ The shippable item is ready. / ✓ The shipment is ready.","note":"'Shippable' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect. Instead, use 'shippable item' or 'shipment'."},{"incorrect":"✗ This service is not shippable.","correct":"✓ This service is not available for shipping.","note":"'Shippable' typically refers to physical items, not services. To describe a service that cannot be shipped, use alternative phrasing."}],"priority":"★★☆"},"related_words":{"derivatives":["ship (verb, noun)","shipping (noun, adjective)","shipment (noun)","unshippable (adjective)"],"related_terms":["freight","logistics","delivery","transportation","carrier","mailable"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively low frequency but common in specific contexts (e-commerce, logistics).","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Shippable' means something can be sent to you by mail or a delivery service. You'll often see this word when you're shopping online. If a product is 'shippable,' it means the store can send it to your address. If it's 'unshippable,' it might be too big, too heavy, or have other restrictions that prevent it from being mailed. It's a useful word to know when buying things online or sending packages."},"example_sentences":[{"sentence":"Ensure that all hazardous materials are clearly labeled to be considered **shippable**.","translation":"すべての危険物が発送可能とみなされるためには、明確にラベル表示されていることを確認してください。","type":"adjective","meaning_category":"発送可能な"},{"sentence":"The furniture was too large to be **shippable** via standard postal services.","translation":"その家具は大きすぎて、通常の郵便サービスで発送することはできませんでした。","type":"adjective","meaning_category":"発送可能な"},{"sentence":"Check the website to see if the product is **shippable** to your location.","translation":"その製品があなたの場所に発送可能かどうかウェブサイトで確認してください。","type":"adjective","meaning_category":"発送可能な"}]}