{"word":"Catholic-sympathetic","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"カトリックに好意的な、カトリックに同情的な","english_definition":"Having or showing sympathy or favor toward Catholicism or Catholics.","examples":[{"sentence":"The historian described the author as Catholic-sympathetic, noting the positive portrayal of religious figures in his novels.","translation":"歴史家は、その作家をカトリックに好意的であると評し、彼の小説における宗教的人物描写が肯定的なものである点を指摘した。"},{"sentence":"The political commentator observed a Catholic-sympathetic bias in the journalist's reporting on the Vatican.","translation":"その政治評論家は、ジャーナリストのバチカンに関する報道にカトリックに同情的な偏りがあると指摘した。"}],"collocations":["Catholic-sympathetic views","Catholic-sympathetic policies","Catholic-sympathetic reporting"],"synonyms":["pro-Catholic","Catholic-leaning","Catholic-friendly"],"antonyms":["anti-Catholic","Catholic-hostile","Catholic-opposed"]}],"etymology":{"value":"A compound word formed by combining 'Catholic' (referring to the Roman Catholic Church) and 'sympathetic' (expressing or feeling sympathy or compassion).","priority":"Medium"},"pronunciation":{"ipa":"/ˌkæθəlɪk sɪmpəˈθɛtɪk/","syllables":"Ca-thol-ic Sym-pa-thet-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very Catholic-sympathetic)."},"usage_notes":{"explanation":"'Catholic-sympathetic' is used to describe someone or something that displays a positive or supportive attitude toward Catholicism. It suggests an affinity or understanding of Catholic beliefs, practices, or institutions. It is often used in political, historical, or religious contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a Catholic sympathetic person.","correct":"He is a Catholic-sympathetic person.","note":"The hyphen is important to connect the two words and create a compound adjective modifying 'person'."}],"priority":"Low"},"related_words":{"derivatives":["sympathetic","Catholicism","sympathy"],"related_terms":["pro-Christian","religious","ecumenical"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Catholic-sympathetic' is a specialized term used in discussions about religion, politics, or history. It describes a viewpoint or attitude that is favorably inclined toward Catholicism. Understanding this term requires familiarity with religious and political discourse."},"example_sentences":[{"sentence":"The article presented a Catholic-sympathetic perspective on the history of the papacy.","translation":"その記事は、教皇の歴史についてカトリックに好意的な視点を示した。","type":"General","meaning_category":"Perspective"},{"sentence":"The politician's Catholic-sympathetic stance earned him support from religious voters.","translation":"その政治家のカトリックに同情的な姿勢は、宗教的な有権者からの支持を得た。","type":"Political","meaning_category":"Political Stance"}]}