{"word":"antinegroism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反黒人主義、黒人差別反対","english_definition":"Opposition to racism against Black people; the belief that Black people should not be discriminated against.","examples":[{"sentence":"Antinegroism is essential for creating a just society.","translation":"反黒人主義は公正な社会を創造するために不可欠です。"},{"sentence":"The organization promotes antinegroism through education and advocacy.","translation":"その組織は教育と擁護を通じて反黒人主義を推進しています。"}],"collocations":["promote antinegroism","support antinegroism","fight for antinegroism"],"synonyms":["anti-racism","racial equality","racial justice"],"antonyms":["racism","negrophobia","anti-blackness"]}],"etymology":{"value":"Formed with the prefix 'anti-' (against) + 'negroism' (beliefs, practices, etc., associated with or supporting Black people).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈniːɡroʊɪzəm/","syllables":"an-ti-ne-gro-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Antinegroism' is a term that is less commonly used than 'anti-racism' but specifically refers to opposition to racism directed at Black people. It emphasizes the importance of fighting against the unique forms of discrimination and prejudice that Black individuals and communities face.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is antinegroism.","correct":"✓ He supports antinegroism.","note":"'Antinegroism' is a noun, so it needs a verb to express support or belief in it."}],"priority":"★★☆"},"related_words":{"derivatives":["anti-racist","negrophilia"],"related_terms":["black lives matter","civil rights movement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antinegroism' is a specialized term used to describe opposition to anti-black racism. It is important to understand that this term is related to broader concepts of anti-racism but focuses specifically on the experiences and struggles of Black people. The term is not commonly used in everyday conversation but may appear in academic or activist contexts."},"example_sentences":[{"sentence":"The professor's research focuses on the history of antinegroism in the United States.","translation":"その教授の研究は、アメリカ合衆国における反黒人主義の歴史に焦点を当てています。","type":"noun","meaning_category":"黒人差別反対"},{"sentence":"Many activists are dedicated to the cause of antinegroism and racial equality.","translation":"多くのアクティビストが、反黒人主義と人種的平等の理念に献身しています。","type":"noun","meaning_category":"黒人差別反対"}]}