{"word":"Lencan","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Of or relating to the Lenca people or their language.","english_definition":"Relating to the Lenca people, their culture, or their language.","examples":[{"sentence":"Lencan pottery is highly valued for its intricate designs.","translation":"レンカ族の陶器は、その複雑なデザインで高く評価されています。"},{"sentence":"She is studying the Lencan language to better understand the culture.","translation":"彼女は文化をより良く理解するために、レンカ語を研究しています。"}],"collocations":["Lencan pottery","Lencan language","Lencan culture","Lencan people"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"A member of the indigenous people of southwestern Honduras and eastern El Salvador.","english_definition":"A member of an indigenous people of southwestern Honduras and eastern El Salvador.","examples":[{"sentence":"The Lencan have a rich history and cultural heritage.","translation":"レンカ族は豊かな歴史と文化遺産を持っています。"},{"sentence":"Many Lencan still practice traditional farming methods.","translation":"多くのレンカ族は今でも伝統的な農法を実践しています。"}],"collocations":["Lencan people","Lencan community","Lencan traditions"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"The extinct language of the Lenca people.","english_definition":"The extinct language formerly spoken by the Lenca people.","examples":[{"sentence":"Efforts are being made to reconstruct the Lencan language.","translation":"レンカ語を再構築する試みがなされています。"},{"sentence":"Very little documentation of the Lencan language remains.","translation":"レンカ語の文書はほとんど残っていません。"}],"collocations":["Lencan language","Lencan grammar","Lencan vocabulary"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of the indigenous people inhabiting parts of Honduras and El Salvador. The origin of the name 'Lenca' itself is uncertain.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛŋkən/","syllables":"Len-can"},"inflection":{"notes":"The word 'Lencan' does not typically inflect, except for pluralizing the noun form (Lencans)."},"usage_notes":{"explanation":"'Lencan' is used to refer to the indigenous people, their language, and cultural aspects associated with them. It's important to use the term respectfully and accurately, especially when discussing their history and current situation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Lenca is a tribe in Honduras.","correct":"✓ The Lenca are a people in Honduras.","note":"'Lenca' as a noun referring to the people is plural, so it takes a plural verb."},{"incorrect":"✗ Lencan's language is very interesting.","correct":"✓ The Lencan language is very interesting.","note":"When referring to the language itself, use 'the Lencan language' rather than possessive form."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lencan' is a term primarily used in academic or anthropological contexts when discussing the indigenous people of southwestern Honduras and eastern El Salvador. It refers to the people, their language, and their culture. Due to its specificity, it is not a commonly encountered word.","priority":"★★☆"},"example_sentences":[{"sentence":"Archaeological sites provide insights into ancient Lencan civilization.","translation":"遺跡は古代レンカ文明への洞察を提供します。","type":"adjective","meaning_category":"Relating to the Lenca people"},{"sentence":"The Lencan fought to preserve their traditions.","translation":"レンカ族は自分たちの伝統を守るために戦いました。","type":"noun","meaning_category":"A member of the indigenous people"},{"sentence":"Lencan is considered an extinct language.","translation":"レンカ語は絶滅した言語と考えられています。","type":"noun","meaning_category":"The extinct language"}]}