{"word":"bisexual-discriminatory","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"バイセクシュアル（両性愛者）に対して差別的な、偏見を持つ","english_definition":"Exhibiting prejudice, bias, or discrimination against bisexual individuals.","examples":[{"sentence":"The company's policies were seen as bisexual-discriminatory, as they didn't offer the same benefits to same-sex couples as they did to heterosexual couples.","translation":"その会社のポリシーは、異性愛者のカップルに提供するのと同じ福利厚生を同性カップルに提供していなかったため、バイセクシュアル差別的であると見なされました。"},{"sentence":"The politician's remarks were criticized for being bisexual-discriminatory and insensitive.","translation":"その政治家の発言は、バイセクシュアル差別的で配慮に欠けると批判されました。"},{"sentence":"It is important to challenge bisexual-discriminatory attitudes and stereotypes in society.","translation":"社会におけるバイセクシュアル差別的な態度や固定観念に異議を唱えることが重要です。"}],"collocations":["bisexual-discriminatory policies","bisexual-discriminatory attitudes","bisexual-discriminatory remarks","bisexual-discriminatory behavior"],"synonyms":["biphobic","prejudiced against bisexuals","biased against bisexuals"],"antonyms":["inclusive","equitable","fair","non-discriminatory"],"related_terms":["bisexual","discrimination","biphobia"]}],"etymology":{"value":"Formed by combining 'bisexual' with 'discriminatory'. 'Bisexual' refers to a person who is sexually attracted to both men and women. 'Discriminatory' means showing prejudice or unfair treatment.","priority":"low"},"pronunciation":{"ipa":"/ˌbaɪˈsɛkʃuəl dɪˈskrɪmɪnətɔːri/","syllables":"bi-sex-u-al dis-crim-i-na-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative forms (e.g., more bisexual-discriminatory, most bisexual-discriminatory)."},"usage_notes":{"explanation":"This term is used to describe actions, policies, attitudes, or statements that unfairly target or disadvantage bisexual individuals. It is important to use this term accurately to identify and address instances of bias against bisexual people.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The law is bisexual-discriminatory because it treats all people equally.","correct":"The law is bisexual-discriminatory because it does not provide equal protections to bisexual individuals.","note":"Discrimination implies unequal treatment, not equal treatment. The law must disadvantage bisexual people in some way to be considered bisexual-discriminatory."}],"priority":"low"},"related_words":{"derivatives":["discrimination","discriminatory","bisexual","biphobia"],"related_terms":["homophobic","transphobic","sexist","racist"]},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is specialized and not commonly used in general conversation.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'bisexual-discriminatory' is a complex term used to describe actions, policies, or attitudes that unfairly target or disadvantage bisexual individuals. It's important to understand that this term refers to specific instances of bias or prejudice directed towards bisexual people, and it should be used accurately to identify and address such issues. Understanding the term requires knowledge of both 'bisexual' and 'discrimination'. "},"example_sentences":[{"sentence":"The study revealed bisexual-discriminatory hiring practices within the tech industry.","translation":"その研究は、テクノロジー業界におけるバイセクシュアル差別的な採用慣行を明らかにした。","type":"adjective","meaning_category":"discrimination"},{"sentence":"Many bisexual individuals experience bisexual-discriminatory microaggressions in their daily lives.","translation":"多くのバイセクシュアルの個人は、日常生活でバイセクシュアル差別的なマイクロアグレッションを経験する。","type":"adjective","meaning_category":"discrimination"},{"sentence":"The organization is working to combat bisexual-discriminatory stereotypes in the media.","translation":"その組織は、メディアにおけるバイセクシュアル差別的な固定観念と闘うために活動している。","type":"adjective","meaning_category":"discrimination"}]}