{"word":"Microlepidopterous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"微小鱗翅目の、微小蛾の","english_definition":"Belonging or pertaining to the Microlepidoptera.","examples":[{"sentence":"The microlepidopterous fauna of the region is diverse.","translation":"その地域の微小鱗翅目（微小蛾）の動物相は多様である。"}],"collocations":[],"synonyms":["microlepidopteran"],"antonyms":[]}],"etymology":{"value":"From 'Microlepidoptera' (the taxonomic group name) + '-ous' (adjective suffix). 'Micro-' refers to the small size, 'lepidoptera' refers to the order of insects with scales on their wings (butterflies and moths).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˌlɛpɪˈdɒptərəs/","syllables":"mi-cro-le-pi-dop-ter-ous"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Microlepidopterous' is a technical term used in entomology (the study of insects) to describe something related to or belonging to the Microlepidoptera. These are a group of moths that are generally small in size. The term is not commonly used outside of scientific or specialist contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["Microlepidoptera (noun: the taxonomic group of small moths)","Lepidoptera (noun: the order of insects including butterflies and moths)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Microlepidopterous' is a highly specialized term used in the field of entomology. It refers to characteristics or attributes associated with the Microlepidoptera, a group of moths characterized by their small size. Due to its technical nature, this word is rarely encountered outside of scientific literature or discussions among specialists in the field."},"example_sentences":[{"sentence":"The scientist studied the microlepidopterous specimens under a microscope.","translation":"科学者は顕微鏡で微小鱗翅目の標本を研究した。","type":"adjective","meaning_category":"微小鱗翅目の"}]}