{"word":"profiteering","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"暴利をむさぼること、買い占め、売り惜しみ","english_definition":"the act of making or seeking to make an excessive or unfair profit, especially during a shortage or emergency.","examples":[{"sentence":"The government is cracking down on profiteering during the pandemic.","translation":"政府はパンデミック中の暴利行為を取り締まっている。"},{"sentence":"Profiteering in essential goods is morally wrong.","translation":"生活必需品で暴利をむさぼることは道徳的に間違っている。"},{"sentence":"The company was accused of profiteering from the disaster.","translation":"その会社は災害を利用して暴利を得ていると非難された。"}],"collocations":["price gouging","war profiteering","disaster profiteering","pandemic profiteering","engage in profiteering","accuse of profiteering"],"synonyms":["price gouging","exploitation","opportunism","speculation","racketeering"],"antonyms":["fair pricing","reasonable profit","altruism","charity"]},{"part_of_speech":"verb","definition":"暴利をむさぼる","english_definition":"to make or seek to make an excessive or unfair profit, especially during a shortage or emergency.","examples":[{"sentence":"Some businesses were accused of profiteering during the crisis.","translation":"危機の間、一部の企業は暴利をむさぼっていると非難された。"},{"sentence":"It's unethical to profiteer from people's misfortune.","translation":"人々の不幸から暴利をむさぼることは非倫理的だ。"}],"collocations":["profiteer from a disaster","profiteer from a war","profiteer from a pandemic","profiteer from a shortage"],"synonyms":["exploit","gouge","capitalize","take advantage","fleece"],"antonyms":["offer fair prices","act ethically","help others","donate"]}],"etymology":{"value":"'Profiteering' is derived from 'profit' (noun), combined with the suffix '-eer', which denotes a person who is engaged in a particular activity. The term specifically implies seeking excessive or unfair profits, especially in situations of scarcity or emergency.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɒfɪˈtɪərɪŋ/","syllables":"pro-fit-eer-ing"},"inflection":{"noun_plural":"profiteerings","verb_forms":{"present_simple":["profiteer","profiteers"],"past_simple":"profiteered","past_participle":"profiteered","present_participle":"profiteering"}},"usage_notes":{"explanation":"'Profiteering' typically refers to situations where businesses or individuals take advantage of a crisis, shortage, or emergency to excessively raise prices or accumulate goods for resale at inflated prices. It carries a strong negative connotation, implying unethical and exploitative behavior. The term is often used in discussions of ethics, economics, and law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is profiting, so it's profiteering.","correct":"✓ The company is making a large and unfair profit, which is profiteering.","note":"'Profiting' simply means making a profit, while 'profiteering' implies making an excessive or unfair profit, often by exploiting a crisis or shortage."},{"incorrect":"✗ Profiteering is a good business strategy.","correct":"✓ Profiteering is an unethical business practice.","note":"'Profiteering' is generally considered unethical and is often illegal, especially during emergencies."}],"priority":"★★☆"},"related_words":{"derivatives":["profiteer (noun: a person who engages in profiteering)","profiteer (verb: to engage in profiteering)","profit (noun: financial gain)","profit (verb: to gain financially)","profitable (adjective: yielding a profit)"],"phrases":["war profiteering (profiteering during wartime)","disaster profiteering (profiteering during a disaster)","price gouging (charging excessively high prices)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but usage spikes during periods of crisis or war.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Profiteering' is a term used to describe the act of making an unfair or excessive profit, particularly during times of crisis or shortage. It suggests that someone is taking advantage of a difficult situation to enrich themselves in an unethical manner. This word is often used in discussions about business ethics, economics, and social responsibility. It's important to understand that 'profiteering' is different from simply making a profit; it specifically implies exploitation and unfairness."},"example_sentences":[{"sentence":"The company faced public backlash for alleged pandemic profiteering.","translation":"その会社は、パンデミックを利用して暴利を得ていると非難され、世間からの反発に直面した。","type":"noun","meaning_category":"暴利をむさぼること"},{"sentence":"It's illegal to profiteer from essential goods during a state of emergency.","translation":"非常事態宣言下で生活必需品から暴利をむさぼることは違法だ。","type":"verb","meaning_category":"暴利をむさぼる"},{"sentence":"Critics accused the pharmaceutical industry of profiteering by inflating drug prices.","translation":"批評家たちは、製薬業界が薬価をつり上げて暴利をむさぼっていると非難した。","type":"verb","meaning_category":"暴利をむさぼる"}]}