{"word":"Neurofibromatosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"神経線維腫症（しんけいせんいしゅしょう）: 神経、皮膚、骨に腫瘍ができる遺伝性疾患群","english_definition":"A group of genetic disorders that cause tumors to form on nerves, skin, and bones.","examples":[{"sentence":"Neurofibromatosis is a genetic disorder that can cause a variety of symptoms.","translation":"神経線維腫症は、さまざまな症状を引き起こす可能性のある遺伝性疾患です。"},{"sentence":"There are different types of neurofibromatosis, each with its own characteristics.","translation":"神経線維腫症にはいくつかの種類があり、それぞれに独自の特徴があります。"}],"collocations":["neurofibromatosis type 1 (NF1): 1型神経線維腫症","neurofibromatosis type 2 (NF2): 2型神経線維腫症","schwannomatosis: シュワン細胞腫症","genetic disorder: 遺伝性疾患","tumor formation: 腫瘍形成"],"synonyms":["NF1","NF2","schwannomatosis"],"antonyms":[]}],"etymology":{"value":"「neuro-」（神経）+ 「fibro-」（線維）+ 「-oma」（腫瘍）+ 「-tosis」（状態）の組み合わせ。神経組織に線維性の腫瘍が形成される状態を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊəroʊˌfaɪbroʊmɑːˈtoʊsɪs/","syllables":"neu-ro-fi-bro-ma-to-sis"},"inflection":{"noun_plural":"Neurofibromatoses (まれに)"},"usage_notes":{"explanation":"Neurofibromatosis (NF) is a set of genetic disorders characterized by the growth of tumors along nerves in the body. The most common types are NF1 and NF2. NF1 is characterized by skin changes (such as café-au-lait spots) and tumors on the skin and in the nervous system. NF2 primarily affects the auditory nerves, leading to hearing loss and balance problems. Schwannomatosis is another related disorder. Diagnosis is often based on clinical criteria and genetic testing. Treatment focuses on managing symptoms and complications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Neurofibromatosis is contagious.","correct":"✓ Neurofibromatosis is a genetic disorder.","note":"Neurofibromatosis is not contagious; it is a genetic disorder. It is passed down through families. "},{"incorrect":"✗ Neurofibromatosis only affects the skin.","correct":"✓ Neurofibromatosis can affect the skin, nerves, and other parts of the body.","note":"While skin changes are common, neurofibromatosis can affect various parts of the body, including the nervous system and bones."}],"priority":"★★☆"},"related_words":{"derivatives":["neurofibroma (神経線維腫)","café-au-lait spots (カフェオレ斑)","genetic testing (遺伝子検査)","tumor suppressor gene (腫瘍抑制遺伝子)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学・専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Neurofibromatosis**」は医学用語で、神経に沿って腫瘍ができる遺伝性の病気を指します。主な種類として1型（NF1）と2型（NF2）があり、それぞれ症状が異なります。NF1では皮膚にカフェオレ斑が現れたり、神経系に腫瘍ができたりします。NF2は主に聴神経に影響を与え、聴力低下や平衡感覚の問題を引き起こします。診断には臨床的な基準と遺伝子検査が用いられ、治療は症状の管理が中心となります。専門的な内容なので、一般的にはあまり使われません。"},"example_sentences":[{"sentence":"The patient was diagnosed with neurofibromatosis after genetic testing.","translation":"患者は遺伝子検査の結果、神経線維腫症と診断された。","type":"general","meaning_category":"診断"},{"sentence":"One of the symptoms of neurofibromatosis type 1 is the presence of café-au-lait spots.","translation":"1型神経線維腫症の症状の一つは、カフェオレ斑の存在である。","type":"symptom","meaning_category":"症状"},{"sentence":"Treatment for neurofibromatosis focuses on managing the symptoms and preventing complications.","translation":"神経線維腫症の治療は、症状の管理と合併症の予防に重点を置いている。","type":"treatment","meaning_category":"治療"}]}