{"word":"Potemkin","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ポチョムキン (人名: グリゴリー・アレクサンドロヴィチ・ポチョムキン。ロシア帝国の政治家、軍人、貴族。エカチェリーナ2世の寵臣。)","english_definition":"Grigory Aleksandrovich Potemkin (1739-1791), a Russian military leader, statesman, nobleman and favourite of Catherine the Great.","examples":[{"sentence":"Potemkin was a powerful figure in the Russian court.","translation":"ポチョムキンはロシアの宮廷で権力者だった。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ポチョムキンの (形容詞: 見せかけだけの、うわべだけの。特に、ポチョムキン村に由来する。)","english_definition":"(attributive) for show only; designed to impress (especially in reference to Potemkin villages).","examples":[{"sentence":"The new housing development turned out to be a Potemkin village; the buildings were only facades.","translation":"その新しい住宅開発地は見せかけだけのものだと判明した。建物はただの張りぼてだった。"},{"sentence":"The company's success was just a Potemkin facade, hiding deep financial problems.","translation":"その会社の成功はただの見せかけで、深刻な財政問題を隠していた。"}],"collocations":["Potemkin village (ポチョムキン村、見せかけだけのもの)","Potemkin facade (ポチョムキンの張りぼて、見せかけだけの外観)"],"synonyms":["sham","illusory","superficial","ostentatious","facade"],"antonyms":["genuine","authentic","real"]}],"etymology":{"value":"グリゴリー・アレクサンドロヴィチ・ポチョムキンに由来。1787年にエカチェリーナ2世がクリミアを視察した際、ポチョムキンが皇帝一行を欺くために、急ごしらえの村を作って繁栄しているように見せかけたという伝説に基づく。","priority":"★★★"},"pronunciation":{"ipa":"/pəˈtɛmkɪn/","syllables":"Po-tem-kin"},"inflection":{"notes":"固有名詞（人名）としては変化なし。形容詞としては比較変化なし。"},"usage_notes":{"explanation":"「**Potemkin**」は、人名としてはロシア帝国の政治家・軍人であるグリゴリー・アレクサンドロヴィチ・ポチョムキンを指します。形容詞としては、ポチョムキンがエカチェリーナ2世の視察のために作ったとされる「ポチョムキン村」の逸話に由来し、「見せかけだけの」「うわべだけの」という意味で使われます。特に、実際には存在しない、または問題を隠蔽するために作られた外観を指すことが多いです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Potemkin was very real and successful.","correct":"✓ The Potemkin village was very real and successful.","note":"形容詞「Potemkin」は「見せかけの」という意味なので、「real (本物)」とは矛盾します。もし本物であることを強調したい場合は、「The village was very real and successful.」のように表現します。"},{"incorrect":"✗ He built a Potemkin to impress his boss.","correct":"✓ He built a Potemkin village to impress his boss.","note":"「Potemkin」だけでは意味が通じにくいので、「Potemkin village」のように具体的な名詞を伴って使うのが一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Potemkin village (ポチョムキン村、見せかけだけのもの)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (歴史的文脈や政治的文脈で使われることがある)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 一般的な会話ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Potemkin**」は、ロシアの歴史的な人物の名前であり、特に「ポチョムキン村」という言葉で知られています。これは、エカチェリーナ2世が旅行した際に、グリゴリー・ポチョムキンが見せかけの村を作って皇帝を欺いたという話に由来します。そのため、「**Potemkin**」という言葉は、「見せかけだけの」「うわべだけの」という意味で使われます。例えば、実際には問題を抱えているのに、成功しているように見せかける企業や組織を指して使われることがあります。歴史的な背景を知っておくと、この言葉の意味を理解しやすくなります。"},"example_sentences":[{"sentence":"The government's economic reforms were criticized as being nothing more than a **Potemkin** facade.","translation":"政府の経済改革は見せかけに過ぎないと批判された。","type":"adjective","meaning_category":"見せかけの"},{"sentence":"The company presented a **Potemkin** image of success to attract investors.","translation":"その会社は投資家を引きつけるために、成功しているかのような見せかけのイメージを提示した。","type":"adjective","meaning_category":"見せかけの"},{"sentence":"The **Potemkin** villages were allegedly built to impress Catherine the Great during her visit to Crimea.","translation":"ポチョムキン村は、エカチェリーナ2世がクリミアを訪問した際に彼女を感心させるために建てられたと言われている。","type":"noun (Potemkin villages)","meaning_category":"ポチョムキン村"}]}