{"word":"Ootype","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"卵型形成腺、卵殻腺","english_definition":"A part of the female reproductive system of certain flatworms and mollusks that forms the egg capsule or shell.","examples":[{"sentence":"The ootype is responsible for encapsulating the fertilized eggs.","translation":"卵型形成腺は受精卵をカプセル化する役割を担っています。"}],"collocations":["form the egg capsule","secrete shell material"],"synonyms":["shell gland","egg capsule forming gland"],"antonyms":[]}],"etymology":{"value":"From 'oo-' (egg) + type.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈoʊ.əˌtaɪp/","syllables":"o-o-type"},"inflection":{"noun_plural":"ootypes"},"usage_notes":{"explanation":"The ootype is a specialized organ found in certain invertebrates, primarily flatworms (Platyhelminthes) and some mollusks. Its main function is to encapsulate the fertilized eggs with a protective shell or capsule before they are laid. The ootype secretes the materials that form this capsule, ensuring the developing embryos are protected from the environment.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ootype is part of the male reproductive system.","correct":"✓ The ootype is part of the female reproductive system.","note":"The ootype is exclusively found in females."}],"priority":"☆☆☆"},"related_words":{"derivatives":["ootypic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'ootype' refers to a specific anatomical structure in certain invertebrates. It is a specialized gland in the female reproductive system responsible for forming the egg capsule. This term is primarily used in the context of zoology, specifically when discussing the reproductive biology of flatworms and mollusks. Understanding this term requires a background in biology or zoology."},"example_sentences":[{"sentence":"The histology of the ootype revealed complex secretory cells.","translation":"卵型形成腺の組織学は、複雑な分泌細胞を明らかにしました。","type":"scientific","meaning_category":"anatomy"},{"sentence":"The ootype plays a crucial role in the reproductive success of planarians.","translation":"卵型形成腺はプラナリアの繁殖成功に重要な役割を果たしています。","type":"zoology","meaning_category":"function"}]}