{"word":"Lutherism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ルター主義、ルター派","english_definition":"The religious doctrine that Martin Luther developed; it denied papal power and absolutist rule.","examples":[{"sentence":"Lutherism spread rapidly throughout Germany and Scandinavia.","translation":"ルター主義はドイツとスカンジナビアに急速に広まった。"},{"sentence":"The core tenets of Lutherism are justification by faith alone and the authority of Scripture.","translation":"ルター主義の中核となる教義は、信仰のみによる義認と聖書の権威である。"}],"collocations":["spread of Lutherism","tenets of Lutherism","practice Lutherism"],"synonyms":["Lutheranism","Lutheran theology"],"antonyms":[]},{"part_of_speech":"noun","definition":"ルター主義者","english_definition":"The body of religious doctrines preached and taught by Martin Luther and his followers.","examples":[{"sentence":"He was raised in a family that practiced Lutherism.","translation":"彼はルター主義を実践する家庭で育った。"},{"sentence":"Lutherism emphasizes the importance of individual faith and the grace of God.","translation":"ルター主義は、個人の信仰と神の恵みの重要性を強調する。"}],"collocations":["practice of Lutherism","beliefs of Lutherism"],"synonyms":["Lutheranism","Lutheran faith"],"antonyms":[]}],"etymology":{"value":"Named after Martin Luther, the 16th-century German theologian and religious reformer. The suffix '-ism' denotes a doctrine, principle, or distinctive practice.","priority":"★★★"},"pronunciation":{"ipa":"/ˈluːθərɪzəm/","syllables":"Lu-ther-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Lutherism' refers specifically to the theological doctrines and religious practices associated with Martin Luther and the Lutheran churches. It is often used interchangeably with 'Lutheranism,' although 'Lutheranism' can also refer more broadly to the cultural and social aspects of Lutheran communities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a follower of Lutherism faith.","correct":"✓ He is a follower of the Lutheran faith.","note":"While 'Lutherism' refers to the doctrine, 'Lutheran' is the adjective form used to describe the faith or church. Using 'Lutheran faith' is more common than 'Lutherism faith'."}],"priority":"★★☆"},"related_words":{"derivatives":["Lutheran (adjective, noun)","Lutheranism (noun)","Luther (proper noun)"],"phrases":["Five solas","Justification by faith alone","Sola scriptura"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in historical or theological contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Lutherism' is a term primarily used in historical and theological contexts to refer to the religious doctrines and practices developed by Martin Luther. Understanding this term requires familiarity with the Reformation and Christian theology. It is not commonly used in everyday conversation but is important for those studying religious history or theology."},"example_sentences":[{"sentence":"The Augsburg Confession is a key document in the history of Lutherism.","translation":"アウクスブルク信仰告白は、ルター主義の歴史における重要な文書である。","type":"noun","meaning_category":"Doctrine"},{"sentence":"Lutherism emphasizes the priesthood of all believers.","translation":"ルター主義は、すべての信徒の祭司職を強調する。","type":"noun","meaning_category":"Doctrine"},{"sentence":"Many churches in Scandinavia still adhere to Lutherism.","translation":"スカンジナビアの多くの教会は、今でもルター主義を遵守している。","type":"noun","meaning_category":"Practice"}]}