{"word":"hollow-cheeked","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"頬がこけた、頬がやつれた","english_definition":"having cheeks that are deeply sunken, often suggesting illness, hunger, or fatigue.","examples":[{"sentence":"The famine victims were hollow-cheeked and gaunt.","translation":"飢饉の犠牲者たちは頬がこけ、やつれていた。"},{"sentence":"After his illness, he looked hollow-cheeked and weak.","translation":"病の後、彼は頬がこけ、弱々しく見えた。"},{"sentence":"The actor's dramatic weight loss left him looking hollow-cheeked.","translation":"その俳優の劇的な減量は、彼の頬をこけさせやつれて見せた。"}],"collocations":["hollow-cheeked and gaunt (頬がこけやつれている)","hollow-cheeked and pale (頬がこけ青白い)","hollow-cheeked appearance (頬がこけた様子)"],"synonyms":["sunken-cheeked","gaunt","emaciated","thin-faced","drawn"],"antonyms":["plump-cheeked","chubby-cheeked","full-cheeked","rosy-cheeked"],"notes":"Often used to describe someone who is ill, malnourished, or has experienced hardship."}],"etymology":{"value":"A compound adjective formed from 'hollow' (empty inside) and 'cheeked' (having cheeks). The term describes the physical appearance of having sunken or concave cheeks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒləʊ tʃiːkt/","syllables":"hol-low-cheeked"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Hollow-cheeked' is a descriptive adjective that specifically refers to the appearance of sunken cheeks. This is often associated with negative conditions such as illness, starvation, or extreme fatigue, but it can also be a natural facial feature in some individuals. It is a more specific term than simply 'thin' or 'pale' as it focuses on the cheek area.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was hollow-cheeked because he exercised a lot.","correct":"✓ He was thin because he exercised a lot.","note":"While exercise can lead to weight loss, 'hollow-cheeked' typically implies a more severe level of thinness often associated with illness or malnutrition, not just general fitness."},{"incorrect":"✗ The baby was hollow-cheeked and healthy.","correct":"✓ The baby was plump-cheeked and healthy.","note":"'Hollow-cheeked' is generally not associated with health, especially in babies. Plump cheeks are usually considered a sign of good health in infants."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["gaunt","emaciated","sunken","pale","thin","wan"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hollow-cheeked' is a descriptive adjective used to describe someone whose cheeks are deeply sunken. It often implies that the person is ill, malnourished, or extremely tired. It is not a common term in everyday conversation, but it is often found in literature or descriptive writing to create a vivid image of someone's physical condition."},"example_sentences":[{"sentence":"The old man's hollow-cheeked face told a story of hardship and resilience.","translation":"その老人の頬がこけた顔は、苦難と回復力の物語を物語っていた。","type":"descriptive","meaning_category":"appearance"},{"sentence":"The refugees arrived at the camp, many of them hollow-cheeked and weak from hunger.","translation":"難民たちはキャンプに到着したが、その多くは飢えで頬がこけ弱っていた。","type":"descriptive","meaning_category":"condition"},{"sentence":"Despite her success, she remained hollow-cheeked, a reminder of her difficult past.","translation":"成功にもかかわらず、彼女は頬がこけたままで、困難な過去を思い出させた。","type":"descriptive","meaning_category":"appearance"}]}