{"word":"ground-ash","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アメリカハナミズキ","english_definition":"Any of several trees or shrubs, especially the flowering dogwood (Cornus florida).","examples":[{"sentence":"The ground-ash is a beautiful tree with showy white bracts.","translation":"アメリカハナミズキは、見栄えのする白い苞を持つ美しい木です。"}],"collocations":["flowering ground-ash","American ground-ash"],"synonyms":["flowering dogwood","Cornus florida"],"antonyms":[]}],"etymology":{"value":"The name 'ground-ash' likely refers to the appearance of the tree's wood, which may resemble that of ash trees, and its relatively low growth habit compared to other trees.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡraʊnd æʃ/","syllables":"ground-ash"},"inflection":{"noun_plural":"ground-ashes"},"usage_notes":{"explanation":"'Ground-ash' is a somewhat archaic or regional name, and the term 'flowering dogwood' or its scientific name 'Cornus florida' is more commonly used in modern botanical contexts. It is important to note that while the name suggests a relationship to ash trees (genus Fraxinus), flowering dogwood belongs to the Cornus genus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a ground-ash tree with red berries.","correct":"✓ I saw a flowering dogwood tree with red berries.","note":"While ground-ash can have red berries, using the more common name 'flowering dogwood' is clearer."}],"priority":"★★☆"},"related_words":{"derivatives":["dogwood"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ground-ash' is a less common name for the flowering dogwood (Cornus florida). It's primarily used in specific regions or older texts. Understanding this term requires some familiarity with botanical nomenclature. If you encounter 'ground-ash,' it's generally best to clarify that it refers to the flowering dogwood for broader comprehension."},"example_sentences":[{"sentence":"The early settlers used the bark of the ground-ash for medicinal purposes.","translation":"初期の入植者たちは、アメリカハナミズキの樹皮を薬用として使用しました。","type":"noun","meaning_category":"アメリカハナミズキ"},{"sentence":"The ground-ash blooms in early spring, adding beauty to the forest.","translation":"アメリカハナミズキは早春に開花し、森に美しさを添えます。","type":"noun","meaning_category":"アメリカハナミズキ"}]}