{"word":"repropitiation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(神に対する)宥和(ゆうわ)、なだめ、贖罪(しょくざい)","english_definition":"the act of appeasing or making propitiatory; the act of regaining or trying to regain the favor or goodwill of someone. Specifically, in theology, the act of appeasing God or averting wrath through sacrifice or atonement.","examples":[{"sentence":"The ritual was intended as a repropitiation to the angry gods.","translation":"その儀式は、怒れる神々を宥めるためのものだった。"},{"sentence":"Christ's death is seen as a repropitiation for the sins of humanity.","translation":"キリストの死は、人類の罪に対する贖罪と見なされている。"}],"collocations":["make repropitiation","offer repropitiation","divine repropitiation"],"synonyms":["atonement","expiation","propitiation","appeasement","conciliation","reconciliation"],"antonyms":["wrath","divine anger"]}],"etymology":{"value":"Formed from \"re-\" (again) + \"propitiation\". \"Propitiation\" itself comes from Latin \"propitiare\" (to appease), from \"propitius\" (favorable, gracious). Thus, \"repropitiation\" implies a renewed or repeated act of appeasement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːprəˌpɪʃiˈeɪʃən/","syllables":"re-pro-pi-ti-a-tion"},"inflection":{"noun_plural":"repropitiations"},"usage_notes":{"explanation":"\"Repropitiation\" is a relatively rare and formal term, primarily used in theological or philosophical contexts. It refers to the act of appeasing a deity or someone in a position of power, often after an offense has been committed. It suggests a renewed effort to regain favor. While similar to \"propitiation,\" the \"re-\" prefix emphasizes the repeated or renewed nature of the act.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company offered a repropitiation for the product recall.","correct":"✓ The company offered compensation for the product recall.","note":"In secular contexts, \"compensation\" or \"restitution\" are more common and appropriate than \"repropitiation.\""},{"incorrect":"✗ Repropitiation is a key concept in modern business ethics.","correct":"✓ Atonement or making amends is a key concept in modern business ethics.","note":"While the idea of making amends is relevant, the specific term \"repropitiation\" is rarely used outside of religious or theological discussions."}],"priority":"★☆☆"},"related_words":{"derivatives":["repropitiate (verb)","propitiation (noun)","propitiatory (adjective)","propitiate (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Repropitiation\" is a highly specialized term primarily found in religious or theological texts. It signifies the act of appeasing a deity or powerful figure, especially after an offense, implying a renewed effort to regain favor. Due to its rarity and specific context, it is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The ancient tribe performed a ritual of repropitiation to appease the volcano god after the eruption.","translation":"古代部族は、噴火後、火山の神を鎮めるために宥和の儀式を行った。","type":"general"},{"sentence":"Some theologians view Christ's sacrifice not only as propitiation but also as repropitiation, renewing God's covenant with humanity.","translation":"一部の神学者は、キリストの犠牲を宥和だけでなく、神と人類の契約を新たにする宥和と見なしている。","type":"theological"}]}