{"word":"lachrymist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"涙もろい人、感傷的な人","english_definition":"a person who sheds tears easily; a sentimental person.","examples":[{"sentence":"She was such a lachrymist that she cried at every sad movie.","translation":"彼女はとても涙もろい人だったので、悲しい映画を観るたびに泣いた。"},{"sentence":"He's a bit of a lachrymist, always getting emotional during touching stories.","translation":"彼は少し感傷的なところがあり、感動的な話を聞くといつも感情的になる。"}],"collocations":["a sentimental lachrymist","an emotional lachrymist"],"synonyms":["crybaby","sentimentalist","weeper"],"antonyms":["stoic","unemotional person"]}],"etymology":{"value":"From Latin *lacrima* (tear) + *-ist* (denoting a person who does or is associated with something).","priority":"★★★"},"pronunciation":{"ipa":"ˈlækrɪmɪst","syllables":"lac-hry-mist"},"inflection":{"noun_plural":"lachrymists"},"usage_notes":{"explanation":"The word *lachrymist* is not commonly used in modern English. It is a more formal and somewhat archaic term for someone who is prone to crying or expressing sentimentality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She is a lachrymist because she is always angry.","correct":"She is a lachrymist because she is easily moved to tears.","note":"Lachrymose refers to someone who cries easily due to sadness or sentimentality, not anger."}],"priority":"★★☆"},"related_words":{"derivatives":["lachrymal","lachrymose"],"related_forms":["lacrimal (relating to tears)","lacrimation (the flow of tears)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lachrymist' is a relatively uncommon and sophisticated term. It describes someone who is prone to crying or easily moved to tears, often due to sentimentality. Understanding this word requires a good grasp of vocabulary related to emotions and Latin roots. It's not a word you'd typically encounter in everyday conversation, but rather in literature or more formal writing."},"example_sentences":[{"sentence":"The old novel featured a character who was a notorious lachrymist, weeping at the slightest provocation.","translation":"その古い小説には、わずかなことで泣き出すことで有名な涙もろい人物が登場した。","type":"noun","meaning_category":"涙もろい人"},{"sentence":"He was labeled a lachrymist by his friends because of his tendency to get emotional during movies.","translation":"彼は映画を見ているときに感情的になりやすいことから、友人たちから涙もろい人だとレッテルを貼られた。","type":"noun","meaning_category":"感傷的な人"}]}