{"word":"overobediently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に忠実に、言われたこと以上に忠実に","english_definition":"In an excessively obedient manner; to an extent that exceeds what is required or expected in terms of obedience.","examples":[{"sentence":"The robot followed its programming overobediently, even when it was clear the situation required independent judgment.","translation":"そのロボットは、状況が独自の判断を必要としていることが明らかになった時でさえ、プログラミングに過度に忠実に従った。"},{"sentence":"The student, wanting to impress the teacher, completed the assignment overobediently, adding far more detail than necessary.","translation":"その生徒は、先生に良い印象を与えたいと思い、課題を言われたこと以上に忠実にこなし、必要以上に多くの詳細を追加した。"}],"collocations":["follow instructions overobediently","act overobediently","respond overobediently","complete tasks overobediently"],"synonyms":["excessively obediently","slavishly obediently","submissively","docilely","obsequiously"],"antonyms":["disobediently","insubordinately","rebelliously","independently","autonomously"]}],"etymology":{"value":"Derived from \"overobedient\" (excessively obedient) + \"-ly\" (adverbial suffix).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌoʊvər.əˈbiːdiəntli/","syllables":"o-ver-o-be-di-ent-ly"},"inflection":{"notes":"Adverbs do not typically inflect.","adverb_forms":{}},"usage_notes":{"explanation":"\"Overobediently\" describes an action performed with an excessive degree of obedience, often implying a lack of independent thought or judgment. It is used to critique or describe behavior that is not merely compliant but goes beyond what is reasonable or expected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was overobediently, which made him unpopular.","correct":"✓ His overobedience made him unpopular. / ✓ He acted overobediently, which made him unpopular.","note":"\"Overobediently\" is an adverb and should modify a verb. To describe a state of being, use a noun like \"overobedience\" or rephrase the sentence to use the adverb correctly."}],"priority":"★☆☆"},"related_words":{"derivatives":["overobedient (adjective)","overobedience (noun)","obediently (adverb)","obedience (noun)"],"antonyms":["disobedience (noun)","insubordination (noun)","rebellion (noun)"],"related_terms":["servilely","subserviently","unquestioningly"]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"overobediently\" is a complex adverb that describes an action performed with excessive obedience. It implies a level of compliance that goes beyond what is reasonable or expected, often suggesting a lack of independent thought or judgment. Due to its complexity and specific meaning, it is more likely to be encountered in advanced texts or discussions. Understanding the root words \"over-\" (excessive) and \"obedient\" (compliant) is helpful in deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The dog sat overobediently, trembling slightly as it waited for the next command.","translation":"犬は、次の命令を待ちながら、少し震えながら、過度に忠実に座っていた。","type":"general","meaning_category":"excessive obedience"},{"sentence":"The new employee, eager to please, followed the instructions overobediently, even when they seemed inefficient.","translation":"その新入社員は、喜ばせようと熱心に、指示が非効率的に思える時でさえ、指示に過度に忠実に従った。","type":"general","meaning_category":"excessive obedience"}]}