{"word":"keratogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"角質形成性の、角化を引き起こす","english_definition":"Causing or stimulating the production of keratin or keratinization.","examples":[{"sentence":"Certain chemicals are known to be keratogenic.","translation":"特定の化学物質は角質形成性であることが知られています。"},{"sentence":"The keratogenic effect of the drug was observed in clinical trials.","translation":"その薬の角質形成効果は臨床試験で観察されました。"}],"collocations":["keratogenic agent","keratogenic effect","keratogenic substance"],"synonyms":["keratinizing","cornifying"],"antonyms":["keratolytic"],"notes":"Often used in the context of dermatology and toxicology."}],"etymology":{"value":"From 'kerato-' (referring to keratin or horny tissue) + '-genic' (producing or causing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkerətoʊˈdʒɛnɪk/","syllables":"ke-ra-to-gen-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Keratogenic' describes substances or conditions that promote the formation of keratin, a protein that is a key component of skin, hair, and nails. It is often used in scientific and medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cream is keratolytic, so it's keratogenic.","correct":"✓ The cream is keratolytic, so it reduces keratin.","note":"Keratolytic agents break down keratin, while keratogenic agents promote its formation. They have opposite effects."}],"priority":"★★☆"},"related_words":{"derivatives":["keratogenesis (角質形成)","keratin (角質)","keratinocyte (角質細胞)"],"related_terms":["keratosis (角化症)","keratoderma (角化症)","keratoconjunctivitis (角膜結膜炎)"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Keratogenic' is a specialized term primarily used in dermatology, biology, and related fields. It refers to something that causes or stimulates the production of keratin, a fibrous protein that forms the main structural constituent of hair, nails, and the outer layer of skin. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The study investigated the keratogenic potential of various cosmetic ingredients.","translation":"その研究では、さまざまな化粧品成分の角質形成能が調査された。","type":"scientific"},{"sentence":"Excessive exposure to UV radiation can have a keratogenic effect on the skin.","translation":"紫外線への過度の暴露は、皮膚に角質形成効果をもたらす可能性がある。","type":"medical"}]}