{"word":"Phrasiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being phrased in a manner that is excessively elaborate, artificial, or insincere; a tendency to use clichés or empty expressions.","english_definition":"The quality of using many phrases, especially in a way that is elaborate, artificial, or insincere.","examples":[{"sentence":"The speech suffered from excessive phrasiness, making it difficult to understand the speaker's true message.","translation":"そのスピーチは過度な婉曲表現に苦しみ、話者の真のメッセージを理解することを困難にした。"},{"sentence":"The writer's phrasiness detracted from the emotional impact of the story.","translation":"その作家の婉曲表現は、物語の感情的なインパクトを損なった。"},{"sentence":"Avoid phrasiness in your writing by using clear and direct language.","translation":"明確で直接的な言葉を使うことによって、文章における婉曲表現を避けなさい。"}],"collocations":["avoid phrasiness","excessive phrasiness","literary phrasiness"],"synonyms":["verbosity","circumlocution","grandiloquence","pomposity","artificiality","insincerity","clichéd language"],"antonyms":["conciseness","directness","sincerity","authenticity"]}],"etymology":{"value":"Derived from 'phrase' (a group of words forming a conceptual unit) + '-iness' (a suffix denoting a quality or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfreɪzinəs/","syllables":"phra-si-ness"},"inflection":{"noun_plural":"phrasinesses (rare)"},"usage_notes":{"explanation":"'Phrasiness' describes writing or speech that relies too heavily on elaborate or insincere phrasing, often using clichés or roundabout expressions instead of direct and genuine language. It is generally considered a negative quality, as it can obscure meaning and make communication less effective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phrasiness of the song was beautiful.","correct":"✓ The phrasing of the song was beautiful.","note":"'Phrasiness' is generally negative, suggesting artificiality. If you mean the way something is expressed is beautiful, use 'phrasing' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["phrase","phraseology","phrasing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phrasiness' is a term used to describe writing or speech that is overly elaborate, artificial, or insincere, often relying on clichés or roundabout expressions. It's a relatively uncommon word, but useful for critiquing styles that lack directness and authenticity."},"example_sentences":[{"sentence":"The politician's speech was full of empty promises and phrasiness.","translation":"その政治家の演説は、空虚な約束と婉曲表現に満ちていた。","type":"noun","meaning_category":"Elaborate and insincere phrasing"},{"sentence":"To improve your writing, try to eliminate any unnecessary phrasiness.","translation":"文章を改善するには、不要な婉曲表現をすべて排除するようにしてください。","type":"noun","meaning_category":"Elaborate and insincere phrasing"}]}