{"word":"Turanism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"チュルク語族、モンゴル語族、ツングース語族、フィン・ウゴル語族などの諸民族の間の文化的・政治的団結を提唱する思想・運動。","english_definition":"A pan-nationalist political and cultural movement that espouses the idea of the cultural and political unity of the Turkic, Mongolic, Tungusic, Finnic, and other related peoples.","examples":[{"sentence":"Turanism sought to create a shared identity among diverse Eurasian groups.","translation":"トゥーラニズムは、多様なユーラシアのグループ間の共通のアイデンティティを創造しようとした。"},{"sentence":"The ideology of Turanism has influenced political movements in several countries.","translation":"トゥーラニズムのイデオロギーは、いくつかの国の政治運動に影響を与えている。"}],"collocations":["Pan-Turanism","Turanist ideology","Turanist movement"],"synonyms":["Pan-Nationalism","Pan-Turkism","Eurasianism"],"antonyms":[]}],"etymology":{"value":"「Turan」という言葉は、ペルシアの叙事詩『シャーナーメ』に登場する地域名に由来し、イランの北東に位置する遊牧民の土地を指す。19世紀に、この言葉が言語学的・文化的な関連性を持つ民族グループを指すために使われるようになった。","priority":"中"},"pronunciation":{"ipa":"/ˈtʊərənɪzəm/","syllables":"Tu-ran-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Turanismは、学術的な議論の対象であると同時に、政治的な意味合いも持つ概念です。一部の支持者は、文化交流や協力の促進を目指していますが、他の人々は、排他的なナショナリズムや政治的な統合を主張しています。","priority":"中"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":["Turanian","Turanist"],"related_concepts":["Pan-Turkism","Finnougric studies","Altaic languages"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"Turanism is a complex concept related to pan-nationalist movements and linguistic theories. Understanding it requires familiarity with Eurasian history, cultural studies, and political ideologies. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The conference explored the historical roots of Turanism.","translation":"会議では、トゥーラニズムの歴史的ルーツが探求された。","type":"general","meaning_category":"definition"},{"sentence":"Some scholars view Turanism as a form of cultural essentialism.","translation":"一部の学者は、トゥーラニズムを文化本質主義の一形態と見なしている。","type":"academic","meaning_category":"critique"}]}