{"word":"deglamorization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脱美化、美化の除去、魅力を取り除くこと","english_definition":"The act or process of removing glamour or romantic appeal from something, making it seem ordinary or unappealing.","examples":[{"sentence":"The deglamorization of smoking has led to a decrease in smokers.","translation":"喫煙の脱美化は喫煙者の減少につながった。"},{"sentence":"The film aimed for a deglamorization of war, showing its brutal realities.","translation":"その映画は戦争の脱美化を目指し、その残酷な現実を描いた。"},{"sentence":"The deglamorization of fast food is important for promoting healthier eating habits.","translation":"ファストフードの脱美化は、より健康的な食習慣を促進するために重要である。"}],"collocations":["deglamorization of smoking (喫煙の脱美化)","deglamorization of war (戦争の脱美化)","deglamorization of violence (暴力の脱美化)","deglamorization campaign (脱美化キャンペーン)"],"synonyms":["desanctification","demystification","debunking","disenchantment","de-romanticization"],"antonyms":["glamorization","romanticization","beautification","idealization"]}],"etymology":{"value":"'Deglamorization' is formed by adding the prefix 'de-' (meaning 'removal' or 'reversal') to 'glamorization,' which itself comes from 'glamour.' 'Glamour' originally referred to a magic spell or enchantment, derived from 'grammar' (in the sense of occult learning). Over time, it came to mean an attractive or exciting quality that makes something seem special. Thus, 'deglamorization' means the removal of this attractive or exciting quality.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌɡlæməraɪˈzeɪʃən/","syllables":"de-glam-or-i-za-tion"},"inflection":{"noun_plural":"deglamorizations"},"usage_notes":{"explanation":"'Deglamorization' is often used in contexts where something that was previously seen as attractive or desirable is now being presented in a more realistic or negative light. This can be done to discourage certain behaviors (like smoking or drug use) or to provide a more accurate portrayal of a subject (like war or poverty). The term implies a deliberate effort to counteract a previously glamorized image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The glamorization of the movie was a success.","correct":"✓ The deglamorization of the movie was a success.","note":"Make sure to use 'deglamorization' when you mean to remove the glamour, not to add it. The former implies taking away the appeal, while the latter implies adding it. Check your intent carefully."},{"incorrect":"✗ The deglamorization is happening slow.","correct":"✓ The deglamorization is happening slowly.","note":"'Slow' is an adjective, while 'slowly' is an adverb. Since you are describing how the deglamorization is happening, you need to use the adverb 'slowly.'"}],"priority":"★★☆"},"related_words":{"derivatives":["deglamorize (verb)","glamorize (verb)","glamorization (noun)","glamorous (adjective)","glamour (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deglamorization' is a complex term that involves understanding the concept of 'glamour' and the process of removing it. It is often used in discussions about media representation, social issues, and public health campaigns. To fully grasp the meaning, one needs to understand that it's about making something less appealing or attractive, often to counteract a previously idealized image. It's a relatively uncommon word, so familiarity with more common synonyms like 'demystification' or 'debunking' can be helpful.","priority":"★★☆"},"example_sentences":[{"sentence":"The documentary aimed at the **deglamorization** of gang life.","translation":"そのドキュメンタリーはギャングの生活の脱美化を目指した。","type":"noun","meaning_category":"脱美化"},{"sentence":"A successful **deglamorization** campaign can reduce the appeal of harmful behaviors.","translation":"成功した脱美化キャンペーンは有害な行動の魅力を減らすことができる。","type":"noun","meaning_category":"脱美化"},{"sentence":"The **deglamorization** of the fashion industry's unrealistic beauty standards is a growing movement.","translation":"ファッション業界の非現実的な美の基準の脱美化は、高まりつつある動きである。","type":"noun","meaning_category":"脱美化"}]}