{"word":"Hyper-Calvinistic","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"超カルヴァン主義的な","english_definition":"Relating to or characteristic of Hyper-Calvinism, a theological system that emphasizes God's sovereignty to the exclusion of human responsibility in salvation.","examples":[{"sentence":"The church was known for its Hyper-Calvinistic views.","translation":"その教会は超カルヴァン主義的な見解で知られていた。"},{"sentence":"He criticized the Hyper-Calvinistic approach to evangelism.","translation":"彼は伝道に対する超カルヴァン主義的なアプローチを批判した。"}],"collocations":["Hyper-Calvinistic theology","Hyper-Calvinistic doctrine","Hyper-Calvinistic beliefs"],"synonyms":["extreme Calvinistic","radical Calvinistic"],"antonyms":["moderate Calvinistic","evangelical","Arminian"]}],"etymology":{"value":"Formed by combining \"hyper-\" (meaning \"beyond\" or \"excessive\") with \"Calvinistic,\" referring to the theological system of John Calvin.","priority":"中"},"pronunciation":{"ipa":"/ˌhaɪpərˌkælvɪˈnɪstɪk/","syllables":"Hy-per-Cal-vin-is-tic"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"\"Hyper-Calvinistic\" describes views that take Calvinistic doctrines, especially predestination and God's sovereignty, to an extreme. This often involves rejecting the idea that Christians should universally offer the gospel or that God has a general love for all humanity. It's a term often used critically by those who hold more moderate Calvinistic or Arminian views.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hyper-calvinistic.","correct":"✓ He is a hyper-Calvinist.","note":"Hyper-Calvinistic is an adjective, while Hyper-Calvinist is a noun referring to a person holding such views."}],"priority":"中"},"related_words":{"derivatives":["Hyper-Calvinism (noun)","Hyper-Calvinist (noun)"],"phrases":["Five Points of Calvinism","Predestination","Total Depravity","Unconditional Election","Limited Atonement","Irresistible Grace","Perseverance of the Saints"],"priority":"中"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The term \"Hyper-Calvinistic\" is a technical term used in theological discussions. It refers to an extreme form of Calvinism, which emphasizes God's sovereignty and predestination to such an extent that it diminishes the role of human responsibility in salvation. Understanding this term requires familiarity with Calvinistic theology. It is not commonly used outside of theological contexts."},"example_sentences":[{"sentence":"The professor argued that the theologian's views were excessively Hyper-Calvinistic.","translation":"教授は、その神学者の見解は過度に超カルヴァン主義的だと主張した。","type":"adjective","meaning_category":"theological view"},{"sentence":"Some critics accuse the church of promoting a Hyper-Calvinistic understanding of grace.","translation":"一部の批評家は、その教会が恵みについての超カルヴァン主義的な理解を推進していると非難している。","type":"adjective","meaning_category":"religious doctrine"}]}