{"word":"unpelted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not pelted; not attacked with missiles or stones; not having been subjected to a barrage.","english_definition":"Not having been attacked with missiles or stones; not subjected to a barrage.","examples":[{"sentence":"The unpelted fruit remained on the tree, untouched by the children's game.","translation":"子供たちの遊びで攻撃されなかった果物は、木に残ったままでした。"},{"sentence":"The statue stood unpelted by the protesters, a silent observer of the scene.","translation":"像は抗議者たちから攻撃されることなく立ち続け、静かにその場を観察していた。"}],"collocations":["unpelted fruit","unpelted statue","unpelted surface"],"synonyms":["unattacked","unharmed","untouched"],"antonyms":["pelted","attacked","barraged"]}],"etymology":{"value":"Formed from the prefix 'un-' (meaning 'not') and the past participle 'pelted' of the verb 'pelt'. The verb 'pelt' comes from Middle English, likely from a Germanic source, meaning to strike or throw things at.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɛltɪd/","syllables":"un-pelt-ed"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Unpelted' is a relatively rare word, primarily used to describe something that has avoided being struck or attacked by thrown objects. It often implies a contrast with other items or surfaces that have been pelted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpelted animal ran away.","correct":"✓ The unpelted animal remained hidden.","note":"'Unpelted' refers to something that hasn't been struck by thrown objects, not necessarily that it has run away. A more fitting sentence would describe the animal remaining untouched or hidden. "},{"incorrect":"✗ The unpelted rain fell softly.","correct":"✓ The rain fell softly.","note":"Rain cannot be unpelted. The word describes something that avoids being struck by projectiles. The original sentence is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unpelted' is a niche term, likely not encountered in everyday language. Understanding it requires familiarity with the verb 'pelt' (to strike or attack with missiles) and the negative prefix 'un-'. Its usage is primarily descriptive, indicating something has avoided being struck by thrown objects. Due to its rarity and specific context, it's considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The unpelted side of the building remained clean, in stark contrast to the graffiti-covered walls nearby.","translation":"攻撃されなかった建物の側面はきれいに保たれており、近くの落書きで覆われた壁とは対照的でした。","type":"adjective","meaning_category":"Not attacked"},{"sentence":"Despite the snowball fight raging around it, the snowman stood unpelted, a testament to its strategic placement.","translation":"周りで雪合戦が繰り広げられているにもかかわらず、雪だるまは攻撃されることなく立っており、その戦略的な配置を証明していました。","type":"adjective","meaning_category":"Not attacked"}]}