{"word":"dronte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ドードー鳥（絶滅した鳥）","english_definition":"An extinct flightless bird that was endemic to the island of Mauritius.","examples":[{"sentence":"The dronte, also known as the dodo, was a large, flightless bird.","translation":"ドードー鳥としても知られるドロンテは、大型の飛べない鳥でした。"},{"sentence":"The extinction of the dronte is often used as a symbol of human impact on the environment.","translation":"ドロンテの絶滅は、しばしば人間が環境に与える影響の象徴として使われます。"}],"collocations":["extinct dronte","Mauritius dronte"],"synonyms":["dodo"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'dronte' is uncertain. It may be related to the Dutch word 'dronte' meaning 'swollen,' referring to the bird's plump appearance. Alternatively, it could be derived from 'dwaes' meaning 'foolish' or 'stupid,' referring to the bird's perceived lack of intelligence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɒnti/","syllables":"dron-te"},"inflection":{"noun_plural":"drontes"},"usage_notes":{"explanation":"'Dronte' is a less common term for the dodo bird. 'Dodo' is the more widely recognized and used name. When referring to this extinct bird, using 'dodo' is generally preferred for clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dronte at the zoo.","correct":"✓ The dronte is extinct, so you could not see one at the zoo.","note":"Drontes are extinct, so you cannot see them at a zoo."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dronte' is a less common synonym for 'dodo.' It refers to an extinct flightless bird from Mauritius. Understanding this word requires a relatively high level of vocabulary. It is important to note that 'dodo' is the more commonly used term."},"example_sentences":[{"sentence":"The last known dronte died in the 17th century.","translation":"最後に知られているドロンテは17世紀に死にました。","type":"noun","meaning_category":"ドードー鳥"},{"sentence":"The dronte was unable to adapt to the changes brought by human colonization.","translation":"ドロンテは、人間の植民地化によってもたらされた変化に適応できませんでした。","type":"noun","meaning_category":"ドードー鳥"}]}