{"word":"carotenemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カロテン血症","english_definition":"A medical condition characterized by excess beta-carotene in the blood and the presence of yellow-orange skin discoloration, especially noticeable on the palms and soles.","examples":[{"sentence":"The infant developed carotenemia from eating too many pureed carrots.","translation":"その乳児は、ピューレにしたニンジンを食べ過ぎたため、カロテン血症を発症した。"},{"sentence":"Carotenemia is usually harmless and resolves with dietary changes.","translation":"カロテン血症は通常無害であり、食事の変更で解消される。"}],"collocations":["develop carotenemia","cause carotenemia","dietary carotenemia","idiopathic carotenemia"],"synonyms":["hypercarotenemia"],"antonyms":[]}],"etymology":{"value":"From 'carotene' (a pigment found in carrots and other vegetables) + '-emia' (a suffix denoting a condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkærətiˈniːmiə/","syllables":"ca-rot-e-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Carotenemia is typically caused by consuming large amounts of foods rich in beta-carotene, such as carrots, sweet potatoes, and squash. It is more common in infants and young children because they often eat pureed vegetables. The condition is generally benign and does not require treatment other than dietary modification to reduce beta-carotene intake. It should be differentiated from jaundice, which also causes yellowing of the skin but is associated with liver problems and elevated bilirubin levels.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Carotenemia is a disease of the liver.","correct":"✓ Carotenemia is a condition caused by high levels of beta-carotene in the blood.","note":"Carotenemia is not a liver disease; it's related to high beta-carotene levels. Jaundice is associated with liver issues."},{"incorrect":"✗ Carotenemia requires immediate medical treatment.","correct":"✓ Carotenemia usually resolves on its own with dietary changes.","note":"In most cases, carotenemia is harmless and resolves with dietary adjustments."}],"priority":"★★☆"},"related_words":{"derivatives":["carotene","carotenoid","hypercarotenemia"],"related_medical_terms":["jaundice","hypervitaminosis"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carotenemia' is a medical term that refers to a condition where there's too much beta-carotene in your blood. Beta-carotene is a pigment found in foods like carrots, and it can turn your skin a yellow-orange color, especially on your palms and soles. It's usually not harmful and happens when you eat a lot of these foods. The main thing is to tell it apart from jaundice, which is a sign of liver problems."},"example_sentences":[{"sentence":"Excessive consumption of carrots can lead to carotenemia, characterized by yellowing of the skin.","translation":"ニンジンの過剰摂取は、皮膚の黄染を特徴とするカロテン血症を引き起こす可能性があります。","type":"general","meaning_category":"cause"},{"sentence":"In infants, carotenemia is often observed due to the introduction of pureed vegetables rich in beta-carotene.","translation":"乳児では、ベータカロテンが豊富なピューレ状の野菜の導入により、カロテン血症がしばしば観察されます。","type":"infants","meaning_category":"occurrence"},{"sentence":"The doctor reassured the parents that the child's carotenemia was not serious and would resolve with a modified diet.","translation":"医師は、子供のカロテン血症は深刻ではなく、食事療法を変更すれば解消されると両親に伝えました。","type":"medical advice","meaning_category":"treatment"}]}