{"word":"Pro-Flemish","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"親フラマン的な、フラマン主義を支持する","english_definition":"Supporting or promoting Flemish interests, culture, or language; favoring Flemish nationalism.","examples":[{"sentence":"The political party has a strong Pro-Flemish stance.","translation":"その政党は強い親フラマン的な立場をとっている。"},{"sentence":"He is known for his Pro-Flemish views on language policy.","translation":"彼は言語政策に関する親フラマン的な見解で知られている。"},{"sentence":"The Pro-Flemish movement seeks greater autonomy for Flanders.","translation":"親フラマン運動はフランドル地方のより大きな自治を求めている。"}],"collocations":["Pro-Flemish party (親フラマン政党)","Pro-Flemish sentiment (親フラマン感情)","Pro-Flemish policy (親フラマン政策)","Pro-Flemish activist (親フラマン活動家)"],"synonyms":["Flemish nationalist","Flemish-leaning","Flemish-sympathizing"],"antonyms":["Anti-Flemish","Belgicist"],"notes":"Often used in the context of Belgian politics and culture, where there are tensions between the Flemish and Walloon communities."}],"etymology":{"value":"Combination of 'pro-' (supporting) and 'Flemish' (relating to Flanders, its people, or their language).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊ ˈflɛmɪʃ/","syllables":"Pro-Flem-ish"},"inflection":{"notes":"Not applicable, as it's an adjective."},"usage_notes":{"explanation":"'Pro-Flemish' describes someone or something that supports the interests, culture, and language of the Flemish people, primarily in Belgium. It often implies a desire for greater autonomy or independence for Flanders. The term is most commonly used in political and cultural contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-flemish speaker.","correct":"✓ He is a Pro-Flemish advocate.","note":"'Pro-Flemish' is an adjective, not a noun. Use it to describe a person's views or affiliations, not the person themselves. A 'pro-Flemish speaker' doesn't make sense; use 'pro-Flemish advocate' or 'supporter' instead."},{"incorrect":"✗ The party is pro flemish.","correct":"✓ The party is Pro-Flemish.","note":"Capitalize 'Pro-Flemish' as it refers to a specific political or cultural leaning. Also, ensure correct hyphenation."}],"priority":"★★☆"},"related_words":{"derivatives":["Flemish (フラマン語、フランドル人)","Flanders (フランドル地方)","Flemish nationalism (フラマン民族主義)"],"phrases":["Flemish Movement (フラマン運動)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, used in specific contexts related to Belgian politics and culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Pro-Flemish' is used in the context of Belgian politics and culture to describe support for the Flemish community and their interests. It implies a leaning towards Flemish nationalism and a desire for greater autonomy for Flanders. Understanding this term requires knowledge of the historical and political dynamics between the Flemish and Walloon communities in Belgium."},"example_sentences":[{"sentence":"The newspaper is known for its Pro-Flemish editorials.","translation":"その新聞は親フラマン的な社説で知られている。","type":"general"},{"sentence":"The Pro-Flemish candidate won a significant number of votes in the election.","translation":"その親フラマン候補者は選挙でかなりの票を獲得した。","type":"political"},{"sentence":"The organization promotes Pro-Flemish cultural events.","translation":"その組織は親フラマン的な文化イベントを推進している。","type":"cultural"}]}