{"word":"tow-net","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"曳き網、トロール網","english_definition":"A conical net towed behind a boat or ship, used to collect plankton or other small organisms from the water.","examples":[{"sentence":"The marine biologists deployed a tow-net to sample the plankton population.","translation":"海洋生物学者は、プランクトンの個体数を調査するために曳き網を展開した。"},{"sentence":"Tow-net samples revealed a high concentration of microplastics in the area.","translation":"曳き網のサンプルから、その地域には高濃度のマイクロプラスチックが存在することが明らかになった。"}],"collocations":["deploy a tow-net (曳き網を展開する)","tow-net sample (曳き網サンプル)","plankton tow-net (プランクトン曳き網)","fine-mesh tow-net (目の細かい曳き網)"],"synonyms":["plankton net","trawl net","dragnet"],"antonyms":[],"notes":"Tow-nets are often used in oceanographic research to study the distribution and abundance of small organisms."}],"etymology":{"value":"The term 'tow-net' is a compound word formed from 'tow,' meaning to drag or pull something behind, and 'net,' referring to the mesh used to catch organisms.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtoʊˌnɛt/","syllables":"tow-net"},"inflection":{"noun_plural":"tow-nets"},"usage_notes":{"explanation":"A tow-net is a specialized type of net designed to be towed through the water, typically behind a boat or ship. It is commonly used in marine biology and oceanography to collect samples of plankton, small fish larvae, and other small organisms. The mesh size of the net can be varied depending on the target organisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tow net was used to catch big fish.","correct":"✓ The tow-net is used to catch plankton and other small organisms.","note":"Tow-nets are designed for small organisms, not large fish."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["plankton","zooplankton","phytoplankton","marine biology","oceanography","trawling"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Tow-net' is a specialized term used in marine biology and oceanography. It refers to a net that is dragged behind a boat to collect small organisms like plankton. Understanding this term requires some familiarity with scientific vocabulary related to marine ecosystems and research methods."},"example_sentences":[{"sentence":"Scientists use a **tow-net** to collect plankton samples for analysis.","translation":"科学者たちは、分析のためにプランクトンのサンプルを収集するために曳き網を使用する。","type":"noun","meaning_category":"曳き網"},{"sentence":"The **tow-net** was deployed at various depths to capture a representative sample of the water column.","translation":"曳き網は、水柱の代表的なサンプルを採取するために、さまざまな深度で展開された。","type":"noun","meaning_category":"曳き網"}]}