{"word":"gluconeogenetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"糖新生の、糖新生性の","english_definition":"Relating to or promoting gluconeogenesis (the formation of glucose from non-carbohydrate sources).","examples":[{"sentence":"Gluconeogenetic enzymes are active in the liver.","translation":"糖新生酵素は肝臓で活性化される。"},{"sentence":"The gluconeogenetic pathway is essential for maintaining blood glucose levels during fasting.","translation":"糖新生経路は、絶食中の血糖値を維持するために不可欠である。"}],"collocations":["gluconeogenetic pathway","gluconeogenetic enzyme","gluconeogenetic substrate"],"synonyms":["glucose-forming","glycogenic"],"antonyms":["glycolytic"]}],"etymology":{"value":"Derived from 'gluconeogenesis' (glucose + neo- + genesis, meaning 'new formation of glucose') with the suffix '-etic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡluːkoʊˌniːoʊdʒəˈnɛtɪk/","syllables":"glu-co-ne-o-ge-net-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Gluconeogenetic' is a technical term primarily used in biochemistry and physiology to describe processes, enzymes, or substrates involved in gluconeogenesis. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The muscle is gluconeogenetic.","correct":"✓ The liver is gluconeogenetic.","note":"Gluconeogenesis primarily occurs in the liver and, to a lesser extent, in the kidneys. Muscles do not typically perform gluconeogenesis."},{"incorrect":"✗ The gluconeogenetic process creates glycogen.","correct":"✓ The gluconeogenetic process creates glucose.","note":"Gluconeogenesis creates glucose, not glycogen. Glycogen is created through glycogenesis."}],"priority":"★★☆"},"related_words":{"derivatives":["gluconeogenesis (noun: the formation of glucose from non-carbohydrate sources)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A specialized term used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gluconeogenetic' is highly specialized and technical, primarily used in the fields of biochemistry and physiology. Understanding requires a strong background in biology and chemistry, specifically related to metabolic pathways and glucose regulation. It describes anything related to the process of gluconeogenesis, which is the synthesis of glucose from non-carbohydrate precursors. Due to its specialized nature, it is unlikely to be encountered outside of scientific literature or advanced biology courses."},"example_sentences":[{"sentence":"The liver plays a crucial role in maintaining blood glucose levels through **gluconeogenetic** processes.","translation":"肝臓は糖新生プロセスを通じて血糖値を維持する上で重要な役割を果たす。","type":"adjective","meaning_category":"Relating to gluconeogenesis"},{"sentence":"Certain hormones stimulate **gluconeogenetic** enzyme activity.","translation":"特定のホルモンは糖新生酵素の活性を刺激する。","type":"adjective","meaning_category":"Relating to gluconeogenesis"}]}