{"word":"Connaraceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Of or pertaining to the Connaraceae family of plants.","english_definition":"Belonging or relating to the plant family Connaraceae.","examples":[{"sentence":"The Connaraceous plants are mostly found in tropical regions.","translation":"Connaraceous植物は主に熱帯地域で見られます。"}],"collocations":["Connaraceous plant","Connaraceous species","Connaraceous family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the family name 'Connaraceae' + '-ous' (suffix indicating belonging or resemblance). The family name 'Connaraceae' comes from the genus 'Connarus'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒnəˈreɪʃəs/","syllables":"Con-na-ra-ce-ous"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative forms (more Connaraceous, most Connaraceous)."},"usage_notes":{"explanation":"The adjective 'Connaraceous' is primarily used in botanical contexts to describe plants, characteristics, or studies related to the Connaraceae family. It is a relatively uncommon word, mainly used within the scientific community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree is a Connaraceae.","correct":"✓ The tree is a Connaraceous plant. / ✓ The tree belongs to the Connaraceae family.","note":"'Connaraceae' is a noun (the family name), while 'Connaraceous' is an adjective. Use the adjective to describe something related to the family, or use the noun to refer to the family itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Connaraceae (noun: the plant family)","Connarus (noun: a genus within the Connaraceae family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Connaraceous' is a highly specialized term used in botany and related fields. Understanding requires familiarity with plant classification and the ability to recognize scientific terminology. It is unlikely to be encountered outside of academic or professional contexts related to plant science."},"example_sentences":[{"sentence":"Several Connaraceous species exhibit unique medicinal properties.","translation":"いくつかのConnaraceous種は独特の薬効を示します。","type":"adjective","meaning_category":"Botanical Description"},{"sentence":"The study focused on the distribution of Connaraceous plants in Southeast Asia.","translation":"その研究は東南アジアにおけるConnaraceous植物の分布に焦点を当てました。","type":"adjective","meaning_category":"Botanical Research"}]}