{"word":"phosphomolybdic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リンモリブデン酸の、リンモリブデン酸を含む","english_definition":"Relating to or containing phosphorus, molybdenum, and oxygen; specifically, relating to phosphomolybdic acid or its salts.","examples":[{"sentence":"Phosphomolybdic acid is used as a reagent in analytical chemistry.","translation":"リンモリブデン酸は分析化学において試薬として用いられる。"},{"sentence":"The phosphomolybdic stain is used to visualize lipids on thin-layer chromatography plates.","translation":"リンモリブデン酸染色液は薄層クロマトグラフィープレート上の脂質を可視化するために用いられる。"}],"collocations":["phosphomolybdic acid","phosphomolybdic stain"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'phospho-' (referring to phosphorus), 'molybd-' (referring to molybdenum), and '-ic' (a suffix used in chemical nomenclature to denote an acid or related compound).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɒsfoʊməˈlɪbdɪk/","syllables":"phos-pho-mo-lyb-dic"},"inflection":{},"usage_notes":{"explanation":"'Phosphomolybdic' is primarily used in chemistry to describe compounds or substances containing phosphorus and molybdenum, often in the context of phosphomolybdic acid (H3PMo12O40) or its derivatives. It is commonly encountered in analytical chemistry, staining techniques, and catalysis.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["phosphomolybdic acid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'phosphomolybdic' is highly specialized and primarily used within the field of chemistry. Understanding requires familiarity with chemical nomenclature and the properties of phosphorus and molybdenum compounds. It is unlikely to be encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The reaction was catalyzed using a phosphomolybdic heteropolyacid.","translation":"その反応はリンモリブデン酸ヘテロポリ酸を用いて触媒された。","type":"adjective","meaning_category":"chemical"},{"sentence":"Phosphomolybdic acid solution is used for the detection of alkaloids.","translation":"リンモリブデン酸溶液はアルカロイドの検出に用いられる。","type":"adjective","meaning_category":"chemical"}]}