{"word":"enterocele","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)小腸瘤","english_definition":"A herniation of the pouch of Douglas (rectouterine pouch) containing loops of small bowel, typically occurring in women.","examples":[{"sentence":"The patient was diagnosed with an enterocele after experiencing pelvic pressure.","translation":"患者は骨盤の圧迫感を訴えた後、小腸瘤と診断された。"},{"sentence":"Surgery may be required to repair a large enterocele.","translation":"大きな小腸瘤を修復するには手術が必要となる場合がある。"}],"collocations":["repair an enterocele","diagnose an enterocele","symptoms of enterocele"],"synonyms":["vaginal hernia","pelvic hernia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'enteron' (intestine) and 'kele' (hernia, tumor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛntərəˌsiːl/","syllables":"en-ter-o-cele"},"inflection":{"noun_plural":"enteroceles"},"usage_notes":{"explanation":"An enterocele is a specific type of pelvic hernia where the small intestine protrudes into the vaginal space. It's more common in women who have had multiple pregnancies or who have undergone pelvic surgery. Diagnosis often involves a pelvic exam and imaging studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with enterocele.","correct":"✓ She was diagnosed with enterocele.","note":"Enteroceles primarily occur in women due to their anatomical structure."},{"incorrect":"✗ Enterocele is a disease of the stomach.","correct":"✓ Enterocele is a type of pelvic hernia involving the small intestine.","note":"An enterocele involves the small intestine, not the stomach."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_medical_terms":["cystocele","rectocele","pelvic organ prolapse"],"priority":"★★☆"},"level_frequency":{"frequency_medical_texts":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Enterocele' is a medical term referring to a specific type of hernia involving the small intestine protruding into the vaginal area. It is primarily relevant in a medical context, particularly in gynecology. Understanding this term requires familiarity with medical terminology related to anatomy and pelvic conditions."},"example_sentences":[{"sentence":"The gynecologist explained the enterocele repair procedure to the patient.","translation":"婦人科医は患者に小腸瘤修復手術について説明した。","type":"medical","meaning_category":"小腸瘤"},{"sentence":"Pelvic floor exercises can sometimes help manage the symptoms of a mild enterocele.","translation":"骨盤底筋運動は、軽度の小腸瘤の症状を管理するのに役立つことがある。","type":"medical","meaning_category":"小腸瘤"}]}