{"word":"idol-rejecting","meanings":[{"part_of_speech":"adjective","definition":"偶像を拒否する、偶像崇拝を拒否する","english_definition":"Rejecting or opposing idols or idolatry; non-idolatrous.","examples":[{"sentence":"The idol-rejecting stance of early Christians often led to conflict with Roman authorities.","translation":"初期キリスト教徒の偶像を拒否する姿勢は、しばしばローマ当局との対立につながった。"},{"sentence":"Some religions are strictly idol-rejecting, forbidding any representation of deities.","translation":"いくつかの宗教は厳格に偶像を拒否しており、神々のいかなる表現も禁じている。"}],"collocations":["idol-rejecting religion","idol-rejecting culture","idol-rejecting belief"],"synonyms":["anti-idolatry","iconoclastic","non-idolatrous"],"antonyms":["idol-worshiping","idolatrous"],"related_words":["idolatry","iconoclasm","iconoclast","idol","worship"]}],"etymology":{"value":"Derived from the noun 'idol' (an image or representation of a god used as an object of worship) and the verb 'reject' (to refuse to accept or consider something).","priority":"2"},"pronunciation":{"ipa":"/ˈaɪdəl rɪˈdʒɛktɪŋ/","syllables":"I-dol-re-ject-ing"},"usage_notes":{"explanation":"The term 'idol-rejecting' is often used in religious contexts to describe beliefs or practices that oppose the use of idols in worship. It can also be used more broadly to describe a rejection of any form of excessive admiration or devotion.","priority":"3"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'idol-rejecting' is a relatively uncommon term, often used in discussions of religion, philosophy, or cultural criticism. It describes a stance against the use of idols or any form of excessive veneration. Understanding the term requires familiarity with the concept of idolatry and the act of rejecting or opposing something."},"example_sentences":[{"sentence":"The group's idol-rejecting philosophy led them to destroy religious statues.","translation":"そのグループの偶像を拒否する哲学は、彼らを宗教的な像の破壊へと導いた。","type":"adjective","meaning_category":"Rejecting idols"},{"sentence":"His idol-rejecting views were unpopular in the community.","translation":"彼の偶像を拒否する見解は、地域社会では不人気だった。","type":"adjective","meaning_category":"Opposing idolatry"}]}