{"word":"glossemic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"グロッセミックの、グロッセム学の","english_definition":"Relating to glossematics, a theory of language developed by Louis Hjelmslev.","examples":[{"sentence":"The glossemic analysis revealed the fundamental units of the text.","translation":"グロッセム分析によって、テキストの基本的な単位が明らかになった。"},{"sentence":"Glossemic theory emphasizes the formal structure of language.","translation":"グロッセム理論は、言語の形式的な構造を強調する。"}],"collocations":["glossemic analysis","glossemic theory"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'glosseme' (the fundamental unit of language in glossematics) + '-ic' (forming adjectives).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡlɒˈsiːmɪk/","syllables":"glos-se-mic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Glossemic' is a term primarily used in linguistics, specifically in the context of glossematics, a theory developed by Louis Hjelmslev. It refers to anything related to this theory, such as analyses, methods, or concepts. It is not a commonly used word outside of academic linguistic discussions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["glosseme","glossematics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glossemic' is a highly specialized term used within the field of linguistics, specifically related to glossematics. It's unlikely to be encountered outside of academic texts or discussions on linguistic theory. Understanding requires familiarity with the concepts of glossematics and structural linguistics."},"example_sentences":[{"sentence":"The researcher applied a glossemic approach to the study of ancient texts.","translation":"研究者は古代テキストの研究にグロッセム的なアプローチを適用した。","type":"adjective","meaning_category":"グロッセム学の"},{"sentence":"Glossemic principles were used to deconstruct the narrative structure.","translation":"グロッセムの原則が、物語の構造を解体するために使用された。","type":"adjective","meaning_category":"グロッセム学の"}]}