{"word":"non-flight-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"飛行に関連しない、飛行以外の","english_definition":"Not related to or associated with flight.","examples":[{"sentence":"The airline also offers non-flight-related services such as hotel bookings.","translation":"その航空会社は、ホテル予約など、飛行に関連しないサービスも提供しています。"},{"sentence":"The company's revenue comes from both flight-related and non-flight-related activities.","translation":"その会社の収入は、飛行関連の活動と飛行に関連しない活動の両方から得ています。"}],"collocations":["non-flight-related activities","non-flight-related services","non-flight-related expenses","non-flight-related income"],"synonyms":["unrelated to flight","non-aviation","non-flying"],"antonyms":["flight-related","aviation-related"],"notes":"Typically used in the context of airlines, airports, or aviation industries to differentiate between activities or services directly involving flying and those that do not."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the phrase 'flight-related'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn ˈflaɪt rɪˌleɪtɪd/","syllables":"non-flight-re-lat-ed"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"The term 'non-flight-related' is used to categorize activities, services, expenses, or income that are not directly associated with the operation of aircraft or the act of flying. This distinction is important in business contexts, particularly in the aviation industry, for financial reporting, strategic planning, and operational analysis. It helps to separate revenue streams and cost centers related to flying from those that are not.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ non flight related","correct":"✓ non-flight-related","note":"It is important to hyphenate the phrase for clarity and to indicate that 'non-' modifies the entire phrase 'flight-related'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["flight-related"],"related_terms":["aviation","airport","airline","flight operation","ground services"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-flight-related' is a compound adjective used in specialized contexts, primarily within the aviation industry. It signifies activities, services, or expenses that are not directly associated with the act of flying or the operation of aircraft. This term is used for categorization and differentiation in financial reports, strategic planning, and operational analysis within the aviation sector. Understanding this term requires familiarity with the business and operational aspects of the aviation industry."},"example_sentences":[{"sentence":"The airport earns a significant portion of its revenue from non-flight-related sources such as parking and retail.","translation":"空港は、駐車場や小売などの飛行に関連しない収入源から、かなりの割合の収入を得ています。","type":"adjective","meaning_category":"飛行に関連しない収入源"},{"sentence":"The company is focusing on expanding its non-flight-related business to diversify its income streams.","translation":"その会社は、収入源を多様化するために、飛行に関連しない事業の拡大に注力しています。","type":"adjective","meaning_category":"飛行に関連しない事業"}]}