{"word":"gourdiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being gourdy; resembling a gourd in shape or appearance; inflated or swollen.","english_definition":"The state or quality of being gourdy; resembling a gourd in shape or appearance; inflated or swollen.","examples":[{"sentence":"The gourdiness of the old man's belly was quite pronounced.","translation":"その老人の腹の瓢箪のような膨らみは非常に顕著だった。"},{"sentence":"The description highlighted the gourdiness of the character's physique.","translation":"その描写は、キャラクターの体格の瓢箪のような特徴を強調していた。"}],"collocations":["abdominal gourdiness","facial gourdiness"],"synonyms":["roundness","corpulence","swelling","inflation"],"antonyms":["thinness","leanness","gauntness"]}],"etymology":{"value":"Derived from 'gourdy,' which comes from 'gourd,' referring to a fruit of the Cucurbitaceae family, known for its round or bulbous shape. The suffix '-iness' denotes a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɔːrdinəs/","syllables":"gourd-i-ness"},"inflection":{"noun_plural":"gourdinesses"},"usage_notes":{"explanation":"'Gourdiness' is a relatively rare word used to describe something that resembles a gourd, typically in shape or appearance. It often implies a round or bulbous form, and can sometimes carry a negative connotation when describing a person's physique, suggesting obesity or excessive swelling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gourdiness of his argument made it unconvincing.","correct":"✓ The weakness of his argument made it unconvincing.","note":"'Gourdiness' refers to physical shape, not the quality of an argument. Use 'weakness' or 'flimsiness' instead."},{"incorrect":"✗ She admired the gourdiness of the sculpture.","correct":"✓ She admired the roundness of the sculpture.","note":"While 'gourdiness' could technically be used, 'roundness' or 'curvature' is more common and natural when describing the shape of a sculpture."}],"priority":"★☆☆"},"related_words":{"derivatives":["gourd (noun)","gourdy (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gourdiness' is a specialized term rarely encountered in everyday language. Its usage is primarily descriptive, referring to the quality of resembling a gourd, often implying a round or swollen shape. Understanding this word requires a strong vocabulary and familiarity with descriptive language. It is more likely to be found in literary or technical contexts where precise physical descriptions are necessary."},"example_sentences":[{"sentence":"The artist captured the peculiar gourdiness of the squash in his still life.","translation":"そのアーティストは、静物画の中でカボチャの独特な瓢箪のような形を捉えた。","type":"noun","meaning_category":"resemblance to a gourd"},{"sentence":"The doctor noted the abnormal gourdiness of the patient's abdomen during the examination.","translation":"医師は診察中に患者の腹部の異常な瓢箪のような膨らみに気づいた。","type":"noun","meaning_category":"swelling"}]}