{"word":"disorderlinesses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無秩序状態（の複数形）","english_definition":"plural of disorderliness: the state of being untidy or disruptive; lack of order or organization.","examples":[{"sentence":"The police were called to deal with the disorderlinesses at the protest.","translation":"警察は抗議活動における無秩序状態に対処するために呼ばれた。"},{"sentence":"The teacher tried to address the various disorderlinesses in the classroom.","translation":"先生は教室内の様々な無秩序状態に対処しようとした。"}],"collocations":["address disorderlinesses","deal with disorderlinesses","various disorderlinesses"],"synonyms":["untidiness","chaos","disarray","confusion","turbulence"],"antonyms":["orderliness","tidiness","organization","discipline"]}],"etymology":{"value":"Formed from 'disorderly' + '-ness' (forming a noun of state or quality) + '-es' (plural suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈɔːrdərlinəsɪz/","syllables":"dis-or-der-li-ness-es"},"inflection":{"noun_plural":"disorderlinesses"},"usage_notes":{"explanation":"'Disorderliness' is a noun referring to a lack of order or tidiness. The plural form, 'disorderlinesses,' is rarely used and typically refers to multiple instances or types of disorderliness. It is not a common word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disorderlinesses was a problem.","correct":"✓ The disorderliness was a problem.","note":"'Disorderliness' is usually used as an uncountable noun, so the singular form is more common. If referring to multiple instances, ensure subject-verb agreement."},{"incorrect":"✗ There were many disorderliness in the room.","correct":"✓ There was much disorderliness in the room. / ✓ There were many instances of disorderliness in the room.","note":"Again, 'disorderliness' is usually uncountable. To express multiple instances, rephrase or use the plural form carefully."}],"priority":"★★☆"},"related_words":{"derivatives":["disorderly (adjective)","disorder (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disorderlinesses' is the plural form of 'disorderliness,' which itself is a noun describing a state of untidiness, disruption, or lack of order. The plural form is rarely used, as 'disorderliness' is generally treated as an uncountable noun. Its usage suggests multiple distinct instances or types of disorderliness. Due to its uncommon nature, it is more likely to be encountered in formal or legal contexts."},"example_sentences":[{"sentence":"The report detailed several disorderlinesses that contributed to the factory's inefficiency.","translation":"報告書は、工場の非効率につながったいくつかの無秩序状態を詳述した。","type":"noun","meaning_category":"無秩序状態（複数形）"},{"sentence":"The various disorderlinesses in the filing system made it difficult to locate important documents.","translation":"ファイルシステムの様々な無秩序状態により、重要な書類を見つけるのが困難になった。","type":"noun","meaning_category":"無秩序状態（複数形）"}]}