{"word":"proselytism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"改宗活動、勧誘、宗旨替えの奨励","english_definition":"the act of attempting to convert people to another religion, belief, or cause; the practice of inducing someone to convert to one's own faith.","examples":[{"sentence":"The missionary engaged in proselytism throughout the region.","translation":"その宣教師は地域全体で改宗活動を行った。"},{"sentence":"Some view door-to-door evangelism as a form of aggressive proselytism.","translation":"戸別訪問による伝道活動を、攻撃的な改宗活動の一形態と見なす人もいる。"},{"sentence":"The organization's proselytism efforts have been met with both support and resistance.","translation":"その団体の改宗活動は、支持と抵抗の両方に直面している。"}],"collocations":["religious proselytism (宗教的な改宗活動)","aggressive proselytism (攻撃的な改宗活動)","active proselytism (活発な改宗活動)","engage in proselytism (改宗活動を行う)","proselytism efforts (改宗活動の努力)","proselytism activities (改宗活動)"],"synonyms":["evangelism","conversion","missionizing","propagandizing","recruitment"],"antonyms":["tolerance","acceptance","respect for other beliefs","religious freedom"]},{"part_of_speech":"noun","definition":"（主義・主張などの）勧誘、支持獲得活動","english_definition":"the advocacy of a cause or doctrine with the aim of converting others.","examples":[{"sentence":"The political party engaged in proselytism to gain new members.","translation":"その政党は、新しい党員を獲得するために勧誘活動を行った。"},{"sentence":"Her proselytism for environmental protection inspired many to take action.","translation":"彼女の環境保護に対する勧誘活動は、多くの人々に行動を起こすきっかけを与えた。"},{"sentence":"The company's proselytism for its new product was very effective.","translation":"その会社の新製品に対する勧誘活動は非常に効果的だった。"}],"collocations":["political proselytism (政治的な勧誘活動)","ideological proselytism (イデオロギー的な勧誘活動)","proselytism for a cause (主義・主張の勧誘)","proselytism for a product (製品の勧誘)"],"synonyms":["promotion","advocacy","campaigning","persuasion","lobbying"],"antonyms":["opposition","resistance","discouragement"]}],"etymology":{"value":"Derived from the Greek word \"proselytos,\" meaning \"a newcomer\" or \"convert.\" It entered English in the early 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒsəlɪtɪzəm/","syllables":"pro-se-ly-tism"},"inflection":{"noun_plural":null,"notes":"Uncountable noun"},"usage_notes":{"explanation":"\"Proselytism\" generally carries a negative connotation when it implies aggressive or coercive conversion tactics. In contexts where conversion is voluntary and respectful, terms like \"evangelism\" or \"missionary work\" might be preferred. The term can also be used in non-religious contexts to describe the active promotion of a cause or belief.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doing proselyte.","correct":"✓ He is engaged in proselytism.","note":"\"Proselyte\" is the person who has converted, not the act of converting. The correct term for the activity is \"proselytism.\""},{"incorrect":"✗ The proselytism was very force.","correct":"✓ The proselytism was very forceful.","note":"\"Force\" is a noun, while \"forceful\" is the adjective that describes the nature of the proselytism."}],"priority":"★★☆"},"related_words":{"derivatives":["proselyte (noun: 改宗者、宗旨替えをした人)","proselytize (verb: 改宗させる、宗旨替えを勧める)","proselytizer (noun: 改宗活動家、勧誘者)"],"idioms_phrases":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Proselytism\" refers to the act of trying to persuade someone to change their religion, beliefs, or way of thinking. It often involves actively promoting one's own views and attempting to convert others. This word is typically used in discussions about religion, politics, or social issues, and it can sometimes have negative connotations, especially if the methods used are seen as forceful or manipulative. It's a more formal and less common word than \"conversion\" or \"evangelism.\""},"example_sentences":[{"sentence":"The government restricts religious proselytism to protect individual freedom of belief.","translation":"政府は、個人の信仰の自由を保護するために、宗教的な改宗活動を制限している。","type":"noun","meaning_category":"改宗活動"},{"sentence":"She faced criticism for her aggressive proselytism of veganism.","translation":"彼女は、ビーガニズムの攻撃的な勧誘活動で批判に直面した。","type":"noun","meaning_category":"勧誘活動"},{"sentence":"The organization's proselytism efforts focused on young people.","translation":"その組織の改宗活動は若者に焦点を当てていた。","type":"noun","meaning_category":"改宗活動"}]}