{"word":"Parsiism","meanings":[{"part_of_speech":"noun","definition":"The monotheistic religion of the Parsis, based on the teachings of Zoroaster; Zoroastrianism.","english_definition":"The monotheistic religion of the Parsis, based on the teachings of Zoroaster; Zoroastrianism.","examples":[{"sentence":"Parsiism emphasizes the importance of good thoughts, good words, and good deeds.","translation":"パールシー教は、良い考え、良い言葉、良い行いの重要性を強調しています。"},{"sentence":"The tenets of Parsiism are believed to have influenced other major religions.","translation":"パールシー教の教義は、他の主要な宗教に影響を与えたと考えられています。"}],"synonyms":["Zoroastrianism","Mazdaism"],"antonyms":[],"related_terms":["Parsi","Zoroaster","Avesta"]}],"etymology":{"value":"Derived from 'Parsi,' referring to the Persian people who migrated to India to preserve their religious identity, combined with the suffix '-ism,' denoting a system of beliefs or doctrines.","translation":"「パールシー」に由来し、宗教的アイデンティティを維持するためにインドに移住したペルシア人を指し、接尾辞「-ism」は信念または教義の体系を意味します。","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɑːrsiɪzəm/","syllables":"Par-si-ism"},"usage_notes":{"explanation":"\"Parsiism\" is often used interchangeably with \"Zoroastrianism,\" though the former specifically refers to the practice of Zoroastrianism by the Parsi community in India. It is important to note the historical and cultural context when using this term.","translation":"「パールシー教」は「ゾロアスター教」と互換的に使用されることが多いですが、前者は特にインドのパールシーコミュニティによるゾロアスター教の実践を指します。この用語を使用する際は、歴史的および文化的背景に注意することが重要です。","priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Parsiism\" is a term referring to the Zoroastrian religion as practiced by the Parsi community, primarily in India. Understanding this term requires knowledge of religious history and cultural contexts. It is less commonly used than \"Zoroastrianism.\"","translation":"「パールシー教」は、主にインドのパールシーコミュニティによって実践されているゾロアスター教を指す用語です。この用語を理解するには、宗教史と文化的背景の知識が必要です。「ゾロアスター教」よりも使用頻度は低いです。"},"example_sentences":[{"sentence":"The survival of Parsiism in India is a testament to the community's resilience.","translation":"インドにおけるパールシー教の存続は、コミュニティの回復力の証です。","type":"general","meaning_category":"religious practice"},{"sentence":"Scholars study Parsiism to understand its unique contributions to religious thought.","translation":"学者は、宗教思想への独自の貢献を理解するためにパールシー教を研究しています。","type":"academic","meaning_category":"religious studies"}]}