{"word":"epifolliculitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"表在性毛包炎（ひょうざいせいもうほうえん）","english_definition":"A superficial bacterial infection of the hair follicles.","examples":[{"sentence":"Epifolliculitis is a common skin condition.","translation":"表在性毛包炎は一般的な皮膚疾患です。"},{"sentence":"The patient was diagnosed with epifolliculitis after presenting with small, itchy bumps on their skin.","translation":"患者は、皮膚に小さくかゆみを伴う隆起が現れた後、表在性毛包炎と診断されました。"}],"collocations":["treat epifolliculitis","diagnose epifolliculitis","superficial epifolliculitis","bacterial epifolliculitis"],"synonyms":["folliculitis","superficial folliculitis"],"antonyms":[]}],"etymology":{"value":"The term 'epifolliculitis' is derived from the Greek prefix 'epi-' meaning 'upon' or 'on', combined with 'folliculitis', which refers to inflammation of the hair follicles.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪfəlɪˈkjʊlaɪtɪs/","syllables":"e-pi-fol-li-cu-li-tis"},"inflection":{"noun_plural":"epifolliculitides"},"usage_notes":{"explanation":"Epifolliculitis is a mild form of folliculitis that affects the upper part of the hair follicle. It is often caused by bacterial infection, particularly Staphylococcus aureus. The condition is characterized by small, superficial pustules or papules around hair follicles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have epifolliculitis on my face, so I use moisturizer.","correct":"✓ I have epifolliculitis on my face, so I use an antibacterial wash.","note":"Moisturizer is not the primary treatment for epifolliculitis, which typically requires antibacterial washes or topical antibiotics."}],"priority":"★★☆"},"related_words":{"derivatives":["folliculitis","pustule","papule","Staphylococcus aureus"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epifolliculitis' is a medical term referring to a superficial infection of hair follicles, typically caused by bacteria. It presents as small, often itchy or pus-filled bumps on the skin around hair follicles. Treatment usually involves antibacterial washes or topical antibiotics. It's a specific type of folliculitis, affecting only the upper portion of the hair follicle.","priority":"★★☆"},"example_sentences":[{"sentence":"Topical antibiotics are often used to treat epifolliculitis.","translation":"局所抗生物質は、表在性毛包炎の治療によく使用されます。","type":"general","meaning_category":"treatment"},{"sentence":"Poor hygiene can contribute to the development of epifolliculitis.","translation":"不衛生な状態は、表在性毛包炎の発症に寄与する可能性があります。","type":"cause","meaning_category":"cause"},{"sentence":"The dermatologist diagnosed the patient with a mild case of epifolliculitis.","translation":"皮膚科医は、患者を軽度の表在性毛包炎と診断しました。","type":"diagnosis","meaning_category":"diagnosis"}]}