{"word":"ejuration","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(正式な)放棄、誓って捨てること、棄権","english_definition":"The act of renouncing upon oath; a solemn renunciation.","examples":[{"sentence":"His ejuration of allegiance to the former regime was a necessary step for his new position.","translation":"彼の旧体制への忠誠の放棄は、彼の新しい地位にとって必要なステップだった。"},{"sentence":"The ejuration of heresy was demanded by the church.","translation":"異端の放棄は教会によって要求された。"}],"collocations":["ejuration of allegiance","ejuration of heresy"],"synonyms":["renunciation","abjuration","recantation","disavowal","repudiation"],"antonyms":["affirmation","avowal","endorsement","ratification"]}],"etymology":{"value":"From Latin 'ejuratio', from 'ejurare' (to renounce upon oath), from 'e-' (out) + 'jurare' (to swear).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛdʒəˈreɪʃən/","syllables":"e-ju-ra-tion"},"inflection":{"noun_plural":"ejurations"},"usage_notes":{"explanation":"'Ejuration' is a formal term, primarily used in legal or historical contexts, to describe the act of solemnly renouncing or rejecting something, often under oath. It is stronger than a simple denial and implies a formal and binding rejection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an ejuration to his friend.","correct":"✓ He made an ejuration of his former beliefs.","note":"'Ejuration' requires an object that is being renounced, such as a belief, allegiance, or claim."}],"priority":"★☆☆"},"related_words":{"derivatives":["ejure (verb)","ejuratory (adjective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ejuration' is a formal and uncommon term that refers to the act of solemnly renouncing something, often under oath. It is primarily used in legal, historical, or religious contexts. Due to its specialized usage, it is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The prisoner's ejuration of his former criminal affiliations was met with skepticism by the authorities.","translation":"囚人の以前の犯罪組織との関係の放棄は、当局から懐疑的に見られた。"},{"sentence":"The treaty required the ejuration of all claims to the disputed territory.","translation":"その条約は、紛争地域に対するすべての権利の放棄を要求した。"}]}