{"word":"chochos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Ecuador, colloquial) lupin beans; a traditional Ecuadorian snack.","english_definition":"(Ecuador, colloquial) Lupin beans, which are large, flat, yellowish seeds, often served pickled or brined as a snack.","examples":[{"sentence":"En Ecuador, es común comer chochos con ají.","translation":"In Ecuador, it is common to eat lupin beans with chili sauce."},{"sentence":"Los chochos son una buena fuente de proteína vegetal.","translation":"Lupin beans are a good source of plant-based protein."}],"collocations":["vender chochos (to sell lupin beans)","comer chochos (to eat lupin beans)","ají de chochos (lupin bean chili sauce)"],"synonyms":["lupinos","tarwi"],"antonyms":[]}],"etymology":{"value":"From Quechua chuqushu.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃotʃos/","syllables":"cho-chos"},"inflection":{"noun_plural":"chochos","notes":"Plural form is the same as the singular."},"usage_notes":{"explanation":"\"Chochos\" refers specifically to lupin beans in Ecuador. Outside of Ecuador, the term \"lupin beans\" or the scientific name \"Lupinus mutabilis\" would be more commonly used. They are typically prepared by boiling and then soaking in water for several days to remove bitter alkaloids. They are then often served pickled or with a spicy sauce.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I want to buy some chocho for my salad.","correct":"I want to buy some lupin beans for my salad.","note":"Outside of Ecuador, 'lupin beans' is the more common term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_foods":["ají (chili sauce)","ceviche (seafood dish, sometimes served with chochos)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of Ecuador","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Chochos\" is a regional term for lupin beans, primarily used in Ecuador. Understanding this word requires some cultural context, as it is not widely known in other English-speaking regions. When discussing this food outside of Ecuador, it is best to use the more general term \"lupin beans\" to ensure clarity."},"example_sentences":[{"sentence":"Chochos are a popular street food in Ecuador.","translation":"チョチョスはエクアドルで人気のストリートフードです。","type":"noun","meaning_category":"food"},{"sentence":"She added chochos to her ceviche for extra protein.","translation":"彼女はセビチェにチョチョスを加えて、タンパク質を増やしました。","type":"noun","meaning_category":"food"}]}