{"word":"waspiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"辛辣さ、気難しさ、怒りっぽさ、蜂のような性質","english_definition":"The quality of being waspish; irritability, snappishness, or a tendency to be easily angered.","examples":[{"sentence":"Her waspiness made it difficult to work with her.","translation":"彼女の辛辣さが、彼女との協力を困難にした。"},{"sentence":"The critic's waspiness was well-known in the literary world.","translation":"その批評家の気難しさは、文学界ではよく知られていた。"},{"sentence":"There was a certain waspiness in his tone that made me uncomfortable.","translation":"彼の口調には、私を不快にさせるある種の怒りっぽさがあった。"}],"collocations":["display waspiness (辛辣さを見せる)","respond with waspiness (辛辣に応じる)","a tone of waspiness (辛辣な口調)"],"synonyms":["irritability","snappishness","petulance","acrimony","acerbity","irascibility"],"antonyms":["amiability","geniality","pleasantness","good nature"],"notes":"Often used to describe a person's temperament or behavior."}],"etymology":{"value":"Derived from 'waspish,' which comes from 'wasp,' referring to the insect known for its stinging ability and aggressive behavior. The suffix '-ness' turns the adjective into a noun, denoting the state or quality of being waspish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒspɪnəs/","syllables":"was-pi-ness"},"inflection":{"noun_plural":"waspinesses (rarely used)"},"usage_notes":{"explanation":"'Waspiness' is a relatively uncommon word used to describe someone's tendency to be irritable, easily angered, or to speak in a sharp, stinging manner. It implies a personality trait characterized by a quick temper and a tendency to express displeasure or criticism readily. It is more often used in descriptive writing or character analysis than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The waspiness of the nest was dangerous.","correct":"✓ The wasps in the nest were dangerous.","note":"'Waspiness' refers to a quality or characteristic, not a physical object or location. Use 'wasps' to refer to the insects themselves."},{"incorrect":"✗ He showed waspiness towards the project.","correct":"✓ He showed waspishness towards the project.","note":"While both 'waspiness' and 'waspishness' exist, 'waspishness' is the more commonly accepted and used form of the noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["wasp (名詞: スズメバチ)","waspish (形容詞: 辛辣な、気難しい、怒りっぽい)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Waspiness' is a sophisticated word used to describe a person's irritable or snappish behavior. It's not commonly used in everyday conversation but may appear in literature or formal writing to characterize someone with a sharp temper or a tendency to make cutting remarks. Understanding this word can help in comprehending nuanced character portrayals."},"example_sentences":[{"sentence":"The manager's waspiness created a tense atmosphere in the office.","translation":"マネージャーの辛辣さが、オフィスに緊張感を生み出した。","type":"noun","meaning_category":"辛辣さ"},{"sentence":"Despite her accomplishments, her waspiness often overshadowed her positive qualities.","translation":"彼女の業績にもかかわらず、彼女の気難しさはしばしば彼女の肯定的な資質を覆い隠した。","type":"noun","meaning_category":"気難しさ"},{"sentence":"The author captured the character's waspiness through sharp dialogue and cynical observations.","translation":"作者は、辛辣な対話と皮肉な観察を通して、そのキャラクターの怒りっぽさを捉えた。","type":"noun","meaning_category":"怒りっぽさ"}]}