{"word":"trade-focused","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"貿易に焦点を当てた、貿易を重視した","english_definition":"emphasizing or prioritizing trade activities, policies, or relationships.","examples":[{"sentence":"The government adopted a trade-focused economic policy.","translation":"政府は貿易重視の経済政策を採用した。"},{"sentence":"The conference is designed for trade-focused businesses.","translation":"その会議は貿易を重視する企業向けに設計されています。"},{"sentence":"They are developing a more trade-focused approach to international relations.","translation":"彼らは国際関係に対して、より貿易を重視したアプローチを開発している。"}],"collocations":["trade-focused policy","trade-focused business","trade-focused approach","trade-focused strategy","trade-focused education"],"synonyms":["trade-oriented","commerce-focused","export-driven","import-driven"],"antonyms":["domestic-focused","inward-looking","protectionist"]}],"etymology":{"value":"\"trade\" + \"focused\". \"Trade\" refers to the activity of buying, selling, or exchanging goods or services. \"Focused\" means having one's attention or interest directed at something specific.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtreɪdˌfoʊkəst/","syllables":"trade-fo-cused"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Trade-focused\" is used to describe something that gives special attention or importance to trade. It suggests a priority is given to activities, policies, or strategies related to the exchange of goods and services, often internationally.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ trade focus","correct":"✓ trade-focused","note":"It's generally used as a compound adjective, so it should be hyphenated."}],"priority":"★☆☆"},"related_words":{"derivatives":["trade","focus","focused"],"related_terms":["international trade","free trade","trade agreement","trade policy"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Trade-focused\" is a compound adjective that describes something that prioritizes or emphasizes trade. It's commonly used in discussions about economics, business, and international relations. Understanding the individual words \"trade\" and \"focused\" helps in comprehending the meaning of the compound word."},"example_sentences":[{"sentence":"The country's trade-focused development strategy led to rapid economic growth.","translation":"その国の貿易重視の開発戦略は、急速な経済成長につながった。","type":"adjective","meaning_category":"貿易を重視した"},{"sentence":"The university offers a trade-focused curriculum for students interested in international business.","translation":"その大学は、国際ビジネスに興味のある学生のために、貿易を重視したカリキュラムを提供している。","type":"adjective","meaning_category":"貿易に焦点を当てた"}]}