{"word":"Proportionateness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"釣り合いが取れていること、均衡、比例性","english_definition":"The state or quality of being proportionate; the correct or desirable relationship in size, quantity, or degree between things.","examples":[{"sentence":"The judge considered the proportionateness of the sentence to the crime.","translation":"裁判官は、犯罪に対する刑罰の均衡を考慮した。"},{"sentence":"The architect emphasized the proportionateness of the building's design.","translation":"建築家は、建物の設計における比例性を強調した。"},{"sentence":"The principle of proportionateness is essential in international law.","translation":"比例性の原則は、国際法において不可欠である。"}],"collocations":["principle of proportionateness (比例性の原則)","assess proportionateness (比例性を評価する)","ensure proportionateness (比例性を確保する)","lack of proportionateness (比例性の欠如)"],"synonyms":["balance","equilibrium","symmetry","harmony","correspondence","equivalence"],"antonyms":["disproportion","imbalance","inequity","asymmetry"]}],"etymology":{"value":"Derived from 'proportionate' (adjective), which comes from the Latin 'proportio' meaning 'relative size' or 'ratio'. The suffix '-ness' is added to form the noun, indicating the state or quality of being proportionate.","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈpɔːrʃənətnəs/","syllables":"pro-por-tion-ate-ness"},"inflection":{"noun_plural":"Proportionateness (uncountable noun, so it doesn't typically have a plural form)"},"usage_notes":{"explanation":"'Proportionateness' refers to the appropriate or balanced relationship between different elements. It is often used in legal, ethical, and design contexts to ensure fairness, justice, and aesthetic harmony. In law, it is a key principle that requires actions to be appropriate and not excessive in relation to the desired outcome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proportionateness of the colors was off.","correct":"✓ The proportions of the colors were off.","note":"'Proportionateness' refers to the quality of being proportionate, whereas 'proportions' refers to the relative sizes or amounts of different elements. In this context, 'proportions' is more appropriate."},{"incorrect":"✗ The action lacked proportionateness.","correct":"✓ The action was disproportionate.","note":"While 'lack of proportionateness' is grammatically correct, it is often more concise and direct to say 'the action was disproportionate'."}],"priority":"★★☆"},"related_words":{"derivatives":["proportionate (adjective)","proportion (noun)","disproportionate (adjective)","disproportionately (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proportionateness' is a formal noun referring to the quality of being in proportion. It is frequently used in legal, ethical, and formal contexts to describe the balance or appropriateness of an action or measure in relation to its intended goal. Understanding this term requires a strong grasp of abstract concepts and formal language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The court examined the **proportionateness** of the government's response to the crisis.","translation":"裁判所は、危機に対する政府の対応の均衡を検証した。","type":"general","meaning_category":"均衡"},{"sentence":"The **proportionateness** of the punishment was questioned by human rights organizations.","translation":"処罰の比例性は、人権団体によって疑問視された。","type":"legal","meaning_category":"比例性"},{"sentence":"Achieving **proportionateness** in design requires careful consideration of all elements.","translation":"デザインにおける比例性を達成するには、すべての要素を慎重に考慮する必要がある。","type":"design","meaning_category":"釣り合い"}]}