{"word":"Crataeis","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(Greek mythology) A nymph, daughter of Hecate.","english_definition":"In Greek mythology, Crataeis was a nymph and daughter of the goddess Hecate. She is sometimes associated with sorcery and magic.","examples":[{"sentence":"Crataeis was known for her knowledge of herbs and potions.","translation":"クラタエイスはハーブと薬の知識で知られていた。"},{"sentence":"Some accounts say Crataeis was the mother of Scylla.","translation":"いくつかの記述では、クラタエイスはスキュラの母であると言われている。"}],"collocations":["daughter of Hecate","nymph of magic","mother of Scylla (in some accounts)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Crataeis (Κραταιίς) comes from the Greek word 'kratos' (κράτος), meaning 'strength' or 'power'. This likely refers to the power associated with her mother, Hecate, and her own magical abilities.","priority":"★★☆"},"pronunciation":{"ipa":"/krəˈteɪɪs/","syllables":"Cra-tae-is"},"inflection":{},"usage_notes":{"explanation":"Crataeis is a relatively obscure figure in Greek mythology, primarily known through her connection to Hecate. She is not a major character in any well-known myths, but appears in various accounts and genealogies related to Hecate and other mythological figures.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Hecate (mother)","Scylla (possible daughter)"],"related_figures":["Hecate","Scylla"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily found in academic texts on Greek mythology.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The name Crataeis is encountered in texts discussing Greek mythology, specifically those detailing lesser-known nymphs and figures associated with Hecate. Understanding requires familiarity with Greek mythological genealogies and minor characters.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient texts mention Crataeis as a skilled sorceress.","translation":"古代文書には、クラタエイスは熟練した魔女として記載されている。","type":"mythological reference","meaning_category":"mythology"},{"sentence":"Crataeis' lineage is often traced back to Hecate, the goddess of magic.","translation":"クラタエイスの血統はしばしば、魔術の女神ヘカテーに遡る。","type":"mythological reference","meaning_category":"mythology"}]}