{"word":"ring-dyke","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"環状岩脈、リングダイク","english_definition":"A roughly circular or arcuate dike, typically formed by the subsidence of a central block during caldera formation or other volcanic processes.","examples":[{"sentence":"The classic example of a ring-dyke is found in the Ardnamurchan peninsula in Scotland.","translation":"環状岩脈の典型的な例は、スコットランドのアルドナムルカン半島で見られます。"},{"sentence":"Ring-dykes are often associated with cone-sheets and other intrusive features.","translation":"環状岩脈は、コーンシートやその他の貫入地形と関連していることが多いです。"},{"sentence":"The formation of a ring-dyke involves complex interactions between magma and the surrounding rock.","translation":"環状岩脈の形成には、マグマと周囲の岩石との複雑な相互作用が伴います。"}],"collocations":["ring-dyke complex","ring-dyke intrusion","ring-dyke formation","caldera ring-dyke"],"synonyms":["circular dike","arcuate dike"],"antonyms":[]}],"etymology":{"value":"The term 'ring-dyke' is derived from its shape, resembling a ring, and 'dyke' (or dike), which refers to a sheet-like body of igneous rock that cuts across rock layering.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrɪŋˌdaɪk/","syllables":"ring-dyke"},"inflection":{"noun_plural":"ring-dykes"},"usage_notes":{"explanation":"Ring-dykes are geological features associated with volcanism and plutonism. They are typically formed when magma intrudes into a circular or arcuate fracture, often caused by the collapse of a volcanic caldera. The term is primarily used in geology and related earth sciences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ring-dyke was made of sedimentary rock.","correct":"✓ The ring-dyke was made of igneous rock.","note":"Ring-dykes are formed from the intrusion of magma, which cools to form igneous rock."},{"incorrect":"✗ Ring-dykes are surface features.","correct":"✓ Ring-dykes are subsurface intrusions.","note":"Ring-dykes are formed underground and may be exposed by erosion over time."}],"priority":"★☆☆"},"related_words":{"derivatives":["dyke","cone-sheet","caldera","intrusion","magma","volcanism","plutonism"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ring-dyke' is a technical term used in geology to describe a specific type of igneous intrusion. It refers to a roughly circular or arc-shaped dike that forms when magma rises through a ring-shaped fracture, often associated with caldera collapse. Understanding this term requires a background in geology or earth science. It is not commonly used outside of these fields."},"example_sentences":[{"sentence":"The eroded remains of the ancient volcano revealed a prominent **ring-dyke**.","translation":"古代火山の浸食された残骸は、顕著な環状岩脈を明らかにしました。","type":"noun","meaning_category":"geology"},{"sentence":"Mapping the **ring-dyke** complex helped geologists understand the area's volcanic history.","translation":"環状岩脈複合体の地図作成は、地質学者がその地域の火山活動の歴史を理解するのに役立ちました。","type":"noun","meaning_category":"geology"},{"sentence":"The **ring-dyke** structure indicates a period of significant volcanic activity in the region.","translation":"環状岩脈の構造は、その地域における重要な火山活動の時期を示しています。","type":"noun","meaning_category":"geology"}]}