{"word":"route-dependent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"経路依存の、ルートに依存する","english_definition":"Varying according to the route taken; contingent on the specific path or course followed.","examples":[{"sentence":"The delivery time is route-dependent, as traffic conditions vary on different roads.","translation":"配達時間は経路依存であり、道路によって交通状況が異なります。"},{"sentence":"The cost of the trip is route-dependent; some routes have tolls, while others are free.","translation":"旅行の費用はルートに依存します。有料道路のルートもあれば、無料のルートもあります。"},{"sentence":"The success of the algorithm is route-dependent, performing better on some paths than others.","translation":"アルゴリズムの成功は経路依存であり、一部のパスでは他のパスよりも優れたパフォーマンスを発揮します。"}],"collocations":["route-dependent delivery time (経路依存の配達時間)","route-dependent cost (経路依存のコスト)","route-dependent algorithm performance (経路依存のアルゴリズム性能)","route-dependent traffic (経路依存の交通)"],"synonyms":["path-dependent","trajectory-dependent","course-dependent"],"antonyms":["route-independent","path-independent","trajectory-independent"]}],"etymology":{"value":"Derived from the combination of 'route' and 'dependent', indicating that something is contingent on the specific route taken.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːt dɪˈpɛndənt/","syllables":"route-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Route-dependent' is used to describe situations where the outcome, cost, or performance is affected by the specific route or path taken. It is commonly used in logistics, transportation, and computer science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The result was route dependent.","correct":"✓ The result was route-dependent.","note":"Hyphenate 'route' and 'dependent' when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Route-dependent' is a technical term used to describe situations where the outcome or performance is contingent on the specific route or path taken. It is commonly used in fields such as logistics, transportation, and computer science. The term implies that different routes will lead to different results. Understanding this term requires a good grasp of technical vocabulary and the ability to comprehend complex relationships."},"example_sentences":[{"sentence":"The efficiency of the delivery system is highly route-dependent.","translation":"その配送システムの効率は、経路に大きく依存します。","type":"general","meaning_category":"general"},{"sentence":"The accuracy of the GPS navigation is route-dependent, especially in urban canyons.","translation":"GPSナビゲーションの精度は、特に都市部の峡谷では、経路に依存します。","type":"technical","meaning_category":"technical"}]}