{"word":"loving-gazed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"愛情のこもった眼差しを送る、愛情深く見つめる","english_definition":"Looking at someone or something with love and affection.","examples":[{"sentence":"She was loving-gazed at her newborn baby.","translation":"彼女は生まれたばかりの赤ちゃんを愛情深く見つめていた。"},{"sentence":"The couple exchanged loving-gazed glances across the table.","translation":"そのカップルはテーブル越しに愛情のこもった眼差しを交わした。"}],"collocations":["loving-gazed at","loving-gazed glance","loving-gazed eyes"],"synonyms":["affectionate","adoring","fond","tender"],"antonyms":["hateful","disgusted","indifferent"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'loving' (expressing love) and 'gazed' (past participle of 'gaze', meaning to look steadily and intently).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈlʌvɪŋ ˌɡeɪzd/","syllables":"luv-ing-gazed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Loving-gazed' is a descriptive adjective that emphasizes the intensity and affection in someone's gaze. It is often used to describe the way someone looks at a loved one, a pet, or something they deeply cherish. The term is relatively uncommon, but it effectively conveys a sense of warmth and tenderness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He loving-gazed to her.","correct":"✓ He loving-gazed at her.","note":"The preposition 'at' is necessary when using 'loving-gazed' to describe looking at someone or something."},{"incorrect":"✗ She had a loving gaze.","correct":"✓ She had a loving-gazed look.","note":"'Loving gaze' is more common, but 'loving-gazed' is used to describe the action of gazing, not the quality of the gaze."}],"priority":"★☆☆"},"related_words":{"derivatives":["loving (adjective, noun)","gaze (verb, noun)"],"phrases":["look of love","affectionate glance","adoring eyes"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'loving-gazed' is a relatively uncommon adjective used to describe a look filled with love and affection. It is formed by combining 'loving' and 'gazed,' indicating a steady and affectionate look. This term is best suited for advanced English speakers who wish to add nuance to their descriptions of emotional expressions. It is most effective in literary or descriptive contexts where the writer aims to convey a strong sense of tenderness and affection."},"example_sentences":[{"sentence":"The mother was loving-gazed at her sleeping child, a smile playing on her lips.","translation":"母親は眠っている子供を愛情深く見つめ、微笑みを浮かべていた。","type":"adjective","meaning_category":"affectionate look"},{"sentence":"With a loving-gazed expression, he watched his dog chase after the ball.","translation":"愛情のこもった眼差しで、彼は犬がボールを追いかけるのを見ていた。","type":"adjective","meaning_category":"adoring look"}]}