{"word":"Cabbalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To interpret or explain according to the Kabbalah; to invest with a mystical meaning.","english_definition":"To interpret or explain something according to the Kabbalah, or to invest something with a mystical meaning related to the Kabbalah.","examples":[{"sentence":"The author attempts to cabbalize historical events, finding hidden meanings in their occurrence.","translation":"著者（作者）は、歴史的出来事をカバラ的に解釈しようとし、その発生に隠された意味を見出そうと試みています。"},{"sentence":"Some scholars cabbalize the text, revealing layers of symbolic significance.","translation":"一部の学者はテキストをカバラ的に解釈し、象徴的な意味の層を明らかにします。"}],"collocations":["cabbalize a text","cabbalize an event","cabbalize a concept"],"synonyms":["mystify","interpret mystically","ascribe mystical meaning"],"antonyms":["demystify","explain literally"],"notes":"Often used in academic or literary contexts."}],"etymology":{"value":"Derived from \"Kabbalah\" (also spelled \"Cabala\"), a mystical Jewish tradition, plus the suffix \"-ize,\" indicating the act of making or treating something in a certain way.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkæbəlaɪz","syllables":"Cab-ba-lize"},"inflection":{"verb_forms":{"present_simple":["cabbalize","cabbalizes"],"past_simple":"cabbalized","past_participle":"cabbalized","present_participle":"cabbalizing"}},"usage_notes":{"explanation":"The term \"cabbalize\" is relatively rare and specific. It refers to the practice of interpreting or understanding something through the lens of Kabbalah, a Jewish mystical tradition. This often involves finding hidden or symbolic meanings within texts, events, or concepts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to cabbalize the scientific theory.","correct":"✓ He tried to interpret the scientific theory mystically.","note":"\"Cabbalize\" is specifically related to Kabbalah. Using \"interpret mystically\" is more appropriate for general mystical interpretations."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cabbala (Kabbalah)","Cabbalist (Kabbalist)","Cabbalistic (Cabbalistic)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"cabbalize\" is a specialized term related to the Kabbalah, a mystical Jewish tradition. It means to interpret something according to the principles of the Kabbalah, often involving finding hidden or symbolic meanings. This word is rarely used outside of academic or specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Scholars often cabbalize ancient texts to uncover deeper spiritual insights.","translation":"学者は、より深い精神的な洞察を明らかにするために、古代のテキストをカバラ的に解釈することがよくあります。","type":"verb","meaning_category":"Interpret mystically"},{"sentence":"Some artists cabbalize their work, embedding secret symbols within their creations.","translation":"一部のアーティストは作品をカバラ的に解釈し、作品の中に秘密のシンボルを埋め込んでいます。","type":"verb","meaning_category":"Invest with mystical meaning"}]}