{"word":"wobblingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ぐらぐらと、よろよろと、不安定に","english_definition":"in a wobbly manner; unsteadily; in a way that shakes or moves from side to side.","examples":[{"sentence":"The table stood wobblingly on its uneven legs.","translation":"そのテーブルは脚が不揃いでぐらぐらと立っていた。"},{"sentence":"She walked wobblingly after spinning around several times.","translation":"彼女は何度も回った後、よろよろと歩いた。"},{"sentence":"The tower of blocks was built wobblingly, threatening to fall at any moment.","translation":"積み木はぐらぐらと積み上げられ、今にも崩れそうだった。"}],"collocations":["walk wobblingly","stand wobblingly","sit wobblingly"],"synonyms":["unsteadily","shakily","precariously","rickety","totteringly"],"antonyms":["steadily","firmly","stably"]}],"etymology":{"value":"Derived from the verb 'wobble' by adding the suffix '-ingly'. 'Wobble' itself is of uncertain origin, possibly related to Low German or Dutch words meaning 'to move to and fro'. The suffix '-ingly' transforms the verb into an adverb, indicating the manner in which the action is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒbəlɪŋli/","syllables":"wob-bling-ly"},"inflection":{"notes":"As an adverb, 'wobblingly' does not have different forms for tense or number. It modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"'Wobblingly' describes an action performed in an unsteady or shaky manner. It suggests a lack of balance or stability. The word is often used to depict movement that is irregular or uncontrolled. It can be used both literally, to describe physical movement, and figuratively, to describe something unstable or uncertain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby wobblingly walked.","correct":"✓ The baby walked wobblingly.","note":"Adverbs typically come after the verb they modify, especially adverbs of manner like 'wobblingly'."},{"incorrect":"✗ The tower was wobblingly.","correct":"✓ The tower was wobbly.","note":"'Wobblingly' is an adverb and modifies verbs. To describe the state of the tower, use the adjective 'wobbly' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["wobble (verb, noun)","wobbly (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Word not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wobblingly' is an adverb that means 'in a wobbly manner'. It describes something that is moving or standing in an unsteady way, as if it might fall. Because it's a more descriptive and less common word, it's typically found in more advanced texts."},"example_sentences":[{"sentence":"The old fence leaned wobblingly in the wind.","translation":"古い柵は風の中でぐらぐらと傾いていた。","type":"adverb","meaning_category":"unsteadily"},{"sentence":"The child's voice cracked wobblingly as she tried to sing.","translation":"子供の声は歌おうとしたとき、不安定に震えた。","type":"adverb","meaning_category":"shakily"},{"sentence":"He balanced the stack of books wobblingly on his head.","translation":"彼は頭の上にぐらぐらと本の束をバランスを取って乗せた。","type":"adverb","meaning_category":"precariously"}]}