{"word":"pyodermic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膿皮症の、化膿性皮膚炎の","english_definition":"Relating to or affected by pyoderma (a skin disease characterized by the presence of pus).","examples":[{"sentence":"The patient was diagnosed with a pyodermic infection.","translation":"患者は膿皮症感染症と診断された。"},{"sentence":"Pyodermic lesions can be painful and require medical treatment.","translation":"膿皮症病変は痛みを伴うことがあり、医学的治療が必要となる。"}],"collocations":["pyodermic infection","pyodermic lesion","pyodermic disease"],"synonyms":["purulent","suppurative","infected"],"antonyms":["healthy","uninfected"]}],"etymology":{"value":"From the Greek words 'pyo-' (relating to pus) and 'derma' (skin), combined with the suffix '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpaɪ.oʊˈdɜːrmɪk/","syllables":"py-o-der-mic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Pyodermic' is used in medical contexts to describe conditions, infections, or lesions associated with pyoderma, a bacterial skin infection that results in pus-filled lesions. It is important to use this term accurately in medical documentation and communication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was pyodermic, so it was clean.","correct":"✓ The wound was pyodermic, indicating a bacterial infection.","note":"Pyodermic wounds are characterized by the presence of pus, which indicates an infection, not cleanliness."}],"priority":"★★☆"},"related_words":{"derivatives":["pyoderma (noun: a bacterial skin infection characterized by pus-filled lesions)"],"phrasal_verbs":[],"related_medical_terms":["impetigo","folliculitis","cellulitis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pyodermic' is a specialized medical term used to describe conditions related to pyoderma, a bacterial skin infection involving pus. It is typically encountered in medical or veterinary contexts. Understanding this term requires knowledge of medical terminology related to skin infections and pathology."},"example_sentences":[{"sentence":"The veterinarian prescribed antibiotics for the dog's pyodermic condition.","translation":"獣医は犬の膿皮症に対して抗生物質を処方した。","type":"general","meaning_category":"medical"},{"sentence":"Chronic pyodermic infections can lead to scarring if left untreated.","translation":"慢性的な膿皮症感染症は、治療せずに放置すると瘢痕につながる可能性がある。","type":"general","meaning_category":"medical"}]}