{"word":"anthropomorphical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"擬人化された、擬人観的な","english_definition":"Attributing human characteristics or behavior to a god, animal, or object.","examples":[{"sentence":"The movie features anthropomorphical animals that talk and behave like humans.","translation":"その映画には、人間のように話し、行動する擬人化された動物が登場する。"},{"sentence":"Some people find it easier to understand complex systems through anthropomorphical analogies.","translation":"擬人観的なアナロジーを通して複雑なシステムを理解する方が簡単だと感じる人もいる。"},{"sentence":"The ancient Greeks often depicted their gods with anthropomorphical traits.","translation":"古代ギリシャ人はしばしば彼らの神々を擬人観的な特徴で描いた。"}],"collocations":["anthropomorphical representation (擬人化表現)","anthropomorphical character (擬人化されたキャラクター)","anthropomorphical analogy (擬人観的なアナロジー)","anthropomorphical thinking (擬人観的な思考)"],"synonyms":["personified","humanized","anthropomorphic"],"antonyms":["nonhuman","abstract","impersonal"]}],"etymology":{"value":"From 'anthropomorphic' + '-al'. 'Anthropomorphic' is from Greek 'anthropos' (human) + 'morphe' (form).","priority":"★★☆"},"pronunciation":{"ipa":"ˌænθrəpəmɔːrˈfɪkəl","syllables":"an-thro-po-mor-phi-cal"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, although they are not commonly used: more anthropomorphical, most anthropomorphical."},"usage_notes":{"explanation":"'Anthropomorphical' is an adjective that describes something that has been given human qualities, even though it is not human. It's closely related to 'anthropomorphic', and the two terms are often used interchangeably. However, 'anthropomorphical' sometimes implies a more deliberate or systematic attribution of human characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anthropomorphical is interesting.","correct":"✓ Anthropomorphism is interesting.","note":"'Anthropomorphical' is an adjective, so it needs to modify a noun. 'Anthropomorphism' is the noun referring to the concept itself."},{"incorrect":"✗ He used anthropomorphical to explain the concept.","correct":"✓ He used anthropomorphism to explain the concept.","note":"'Anthropomorphical' is an adjective, not a noun. The noun form, 'anthropomorphism', should be used to refer to the practice of attributing human qualities."}],"priority":"★★☆"},"related_words":{"derivatives":["anthropomorphism (noun: 擬人化、擬人観)","anthropomorphize (verb: 擬人化する)","anthropomorphic (adjective: 擬人化の、擬人観的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'anthropomorphical' is a relatively advanced term used to describe something that is given human characteristics, even though it is not human. It is often used in discussions of literature, art, and philosophy, where the attribution of human qualities to non-human entities is a common theme. The related term 'anthropomorphism' is more frequently used as the noun form of this concept."},"example_sentences":[{"sentence":"The children's book featured an anthropomorphical bear who wore clothes and went to school.","translation":"その子供向けの本には、服を着て学校に通う擬人化されたクマが登場した。","type":"adjective","meaning_category":"擬人化された"},{"sentence":"The artist created an anthropomorphical representation of the tree, giving it a face and arms.","translation":"そのアーティストは、木に顔と腕を与え、擬人化された表現を作り出した。","type":"adjective","meaning_category":"擬人化された"},{"sentence":"The writer explored the anthropomorphical aspects of animals in folklore.","translation":"その作家は、民話における動物の擬人観的な側面を探求した。","type":"adjective","meaning_category":"擬人観的な"}]}