{"word":"tear-owned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Literally) Owned by tears; (Figuratively) Characterized by sadness, grief, or suffering.","english_definition":"(Literally) Possessed or controlled by tears; (Figuratively) Marked by or indicative of deep sorrow, grief, or hardship.","examples":[{"sentence":"The old photograph seemed tear-owned, its colors faded by the weight of memories and sorrow.","translation":"その古い写真は涙に支配されているようで、思い出と悲しみの重みで色が褪せていた。"},{"sentence":"The abandoned house had a tear-owned quality, as if the walls themselves wept for the family that had once lived there.","translation":"その廃屋は涙に支配されたような雰囲気があり、まるで壁自体がかつてそこに住んでいた家族のために泣いているかのようだった。"},{"sentence":"Her tear-owned voice trembled as she recounted the tragic events.","translation":"彼女の涙に濡れた声は、悲劇的な出来事を語るにつれて震えた。"}],"collocations":["tear-owned memories","tear-owned voice","tear-owned face","tear-owned eyes","tear-owned quality","tear-owned land","tear-owned world","tear-owned heart"],"synonyms":["sorrowful","grief-stricken","heartbroken","mournful","sad","anguished","distressed","wretched"],"antonyms":["joyful","happy","cheerful","content","blissful","elated","ecstatic"]},{"part_of_speech":"adjective","definition":"(Rare, less common usage) Possessing something obtained through tears or suffering.","english_definition":"(Rare, less common usage) Having ownership of something acquired or maintained through great sadness, loss, or hardship.","examples":[{"sentence":"The small plot of land was tear-owned, bought with the meager earnings saved after years of hardship and loss.","translation":"その小さな土地は涙で手に入れたもので、長年の苦難と喪失の後に貯めたわずかな収入で購入された。"},{"sentence":"The company, though successful, was tear-owned, built on the sacrifices and relentless effort of its founder.","translation":"その会社は成功したが、創設者の犠牲と絶え間ない努力の上に築かれた、涙の結晶だった。"}],"collocations":["tear-owned land","tear-owned success","tear-owned wealth","tear-owned achievement","tear-owned victory"],"synonyms":["hard-earned","painfully acquired","dearly bought","sacrifice-owned"],"antonyms":["easily acquired","effortlessly obtained","freely given","inherited"]}],"etymology":{"value":"A compound adjective formed by combining \"tear\" (referring to tears of sorrow) with \"owned\" (possessed or controlled by). The term suggests something is either characterized by or possessed as a result of sadness or grief.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərˌoʊnd/","syllables":"tear-owned"},"inflection":{"notes":"Adjective; comparative and superlative forms (more tear-owned, most tear-owned) are possible but less common."},"usage_notes":{"explanation":"\"Tear-owned\" is a relatively uncommon and evocative adjective. It is primarily used figuratively to describe something that is deeply affected by or associated with sadness, sorrow, or suffering. It can also, less frequently, describe something that has been obtained or maintained through great hardship and emotional cost. The term carries a strong emotional weight and is often used in literary or poetic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tear-owned house was brightly painted.","correct":"✓ The tear-owned house was dilapidated and overgrown.","note":"The adjective \"tear-owned\" implies sadness and neglect, so it is more fitting to describe something in a state of disrepair or sorrow, rather than something cheerful or well-maintained."},{"incorrect":"✗ He was tear-owned by his emotions.","correct":"✓ He was overwhelmed by his emotions.","note":"While \"tear-owned\" can describe a state influenced by sadness, it doesn't directly describe a person being controlled by emotions. \"Overwhelmed,\" \"consumed,\" or \"gripped\" are more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["tearless","tearful","teary","tear-stained","tear-jerker"],"phrases":["bathed in tears","drenched in sorrow","a sea of tears","valley of tears"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Uncommon, likely C2 or beyond if encountered)","frequency_google_ngram":"Very low frequency - a neologism or uncommon compound adjective.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tear-owned\" is a complex and figurative adjective, not commonly found in everyday language. Understanding it requires grasping the metaphorical connection between tears (representing sorrow) and ownership (possession or control). The word is most likely to appear in literary contexts where emotional depth and evocative imagery are prioritized. Its meaning is derived from the combination of \"tear\" and \"owned,\" implying something is either characterized by deep sadness or possessed as a result of great suffering.","example_sentences":null},"example_sentences":[{"sentence":"The tear-owned melody of the violin filled the concert hall with a palpable sense of loss.","translation":"バイオリンの涙に濡れた旋律が、コンサートホールを明白な喪失感で満たした。","type":"adjective","meaning_category":"Characterized by sadness"},{"sentence":"The family's tear-owned resilience allowed them to rebuild their lives after the devastating fire.","translation":"家族の涙で培われた回復力によって、彼らは壊滅的な火災の後、生活を再建することができた。","type":"adjective","meaning_category":"Resulting from suffering"},{"sentence":"The artist's tear-owned paintings captured the raw emotion of grief and despair.","translation":"その芸術家の涙に濡れた絵画は、悲しみと絶望の生々しい感情を捉えていた。","type":"adjective","meaning_category":"Characterized by sadness"}]}