{"word":"opioid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オピオイド (麻薬性鎮痛剤): モルヒネなどのオピウム由来の物質、またはそれらと類似の作用を持つ合成物質の総称。鎮痛作用や陶酔感をもたらす。","english_definition":"A class of drugs that includes the illegal drug heroin, as well as prescription pain relievers such as oxycodone, hydrocodone, codeine, morphine, fentanyl and others. Opioids are chemically related and interact with opioid receptors on nerve cells in the body and brain. Opioid pain relievers are generally safe when taken for a short time and as prescribed by a doctor, but because they produce euphoria in addition to pain relief, opioids can be misused. Regular use — even as prescribed by a doctor — can lead to dependence and, when misuse occurs, opioid pain relievers can lead to addiction, overdose incidents and deaths.","examples":[{"sentence":"Opioids are often prescribed for severe pain after surgery.","translation":"オピオイドは手術後の激しい痛みを和らげるために処方されることが多い。"},{"sentence":"The opioid crisis is a major public health concern in many countries.","translation":"オピオイド危機は多くの国で深刻な公衆衛生上の問題となっている。"},{"sentence":"Long-term use of opioids can lead to addiction.","translation":"オピオイドの長期使用は依存症につながる可能性がある。"}],"collocations":["opioid addiction (オピオイド依存症)","opioid crisis (オピオイド危機)","opioid pain relievers (オピオイド鎮痛剤)","prescription opioids (処方オピオイド)","opioid overdose (オピオイド過剰摂取)","synthetic opioids (合成オピオイド)"],"synonyms":["narcotic analgesic","opiate","painkiller (specific types)"],"antonyms":["non-opioid analgesic","NSAID (nonsteroidal anti-inflammatory drug)"]},{"part_of_speech":"adjective","definition":"オピオイドの、オピオイドに関する","english_definition":"Relating to or resembling opioids.","examples":[{"sentence":"Opioid receptors are found throughout the brain and body.","translation":"オピオイド受容体は脳と体全体に存在する。"},{"sentence":"Opioid-induced constipation is a common side effect.","translation":"オピオイド誘発性便秘は一般的な副作用である。"}],"collocations":["opioid receptor (オピオイド受容体)","opioid-induced (オピオイド誘発性の)","opioid-related (オピオイド関連の)"],"synonyms":["opiaceous","narcotic"],"antonyms":["non-opioid"]}],"etymology":{"value":"「オピオイド」という言葉は、アヘン (opium) に似た物質を指すために作られた。'Opium' はギリシャ語の 'opion' (ケシの汁) に由来し、'-oid' は「～に似た」という意味の接尾辞。つまり、opioid は文字通り「アヘンに似たもの」を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈoʊpiɔɪd","syllables":"o-pi-oid"},"inflection":{"noun_plural":"opioids"},"usage_notes":{"explanation":"「**opioid**」は、医療において強力な鎮痛剤として使用される一方で、依存性や過剰摂取のリスクがあるため、注意が必要な物質群を指します。処方箋に基づいて使用される場合でも、長期的な使用は依存症につながる可能性があるため、医師の指示に従うことが重要です。また、フェンタニルなどの合成オピオイドは、非常に強力であり、過剰摂取による死亡事故が多発しているため、社会的な問題となっています。医療関係者や政策立案者は、オピオイドの適切な使用と依存症対策に取り組んでいます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Opiates and opioids are the same thing.","correct":"✓ Opioids are a broader class of drugs that includes opiates (naturally derived) and synthetic or semi-synthetic drugs.","note":"Opiatesはアヘンから自然に抽出される物質（モルヒネ、コデインなど）を指し、Opioidsはそれらを含む、合成または半合成の類似物質のより広いカテゴリーを指します。"},{"incorrect":"✗ Opioids are always illegal.","correct":"✓ Opioids can be legally prescribed for pain relief, but they can also be obtained and used illegally.","note":"オピオイドは、医師の処方箋があれば合法的に使用できますが、違法に入手して使用されることもあります。"},{"incorrect":"✗ You can't become addicted to opioids if you take them as prescribed.","correct":"✓ Even when taken as prescribed, opioids can lead to dependence and addiction, especially with long-term use.","note":"処方された通りに服用していても、特に長期的な使用では、オピオイド依存症になる可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["opiates (名詞: アヘン剤、オピエート)","opioidergic (形容詞: オピオイド作動性の)"],"phrases":["opioid agonist (オピオイド作動薬)","opioid antagonist (オピオイド拮抗薬)","naloxone (ナロキソン: オピオイド過剰摂取の解毒剤)","medication-assisted treatment (MAT) (薬物補助療法)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1 (専門的な文脈で使用される)","frequency_google_ngram":"中頻度 (Moderate frequency) - 医学、薬学、社会問題に関する文脈でよく見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**opioid**」は、モルヒネやフェンタニルなど、痛みを和らげるために使われる薬のグループを指す専門的な言葉です。これらの薬は、脳や体の神経細胞にあるオピオイド受容体と呼ばれる場所に作用します。医師の処方箋があれば合法的に使用できますが、依存性が高く、過剰摂取すると命に関わるため、注意が必要です。社会問題となっているオピオイド危機は、これらの薬の不適切な使用が原因で発生しています。医療や社会問題に関するニュース記事などでよく見かける言葉です。"},"example_sentences":[{"sentence":"The doctor prescribed an **opioid** for her chronic back pain.","translation":"医師は彼女の慢性的な腰痛のためにオピオイドを処方した。","type":"noun","meaning_category":"麻薬性鎮痛剤"},{"sentence":"The **opioid** crisis has led to increased awareness of addiction risks.","translation":"オピオイド危機は、依存症のリスクに対する意識を高めることにつながった。","type":"noun","meaning_category":"麻薬性鎮痛剤"},{"sentence":"**Opioid** receptors are found throughout the central nervous system.","translation":"オピオイド受容体は中枢神経系全体に存在する。","type":"adjective","meaning_category":"オピオイドの"},{"sentence":"Naloxone is an **opioid** antagonist that can reverse an overdose.","translation":"ナロキソンはオピオイド拮抗薬であり、過剰摂取を逆転させることができる。","type":"adjective","meaning_category":"オピオイドの"},{"sentence":"The government is working to combat the **opioid** epidemic.","translation":"政府はオピオイドの蔓延と闘うために取り組んでいる。","type":"noun","meaning_category":"麻薬性鎮痛剤"}]}