{"word":"non-designative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学) 指示的でない、指示機能を持たない","english_definition":"(linguistics) Not serving to designate or refer to a specific object, person, or entity.","examples":[{"sentence":"Exclamations like 'Ouch!' are non-designative; they express feeling rather than referring to something.","translation":"「痛っ！」のような感嘆詞は指示的ではありません。何かを指すのではなく、感情を表現します。"},{"sentence":"Function words, such as prepositions and conjunctions, are often considered non-designative.","translation":"前置詞や接続詞のような機能語は、しばしば非指示的であると考えられます。"}],"collocations":["non-designative expression","non-designative function","non-designative word"],"synonyms":["non-referential","non-denotative"],"antonyms":["designative","referential","denotative"]}],"etymology":{"value":"'Non-' (not) + 'designative' (serving to designate).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈdɛzɪɡnətɪv/","syllables":"non-des-ig-na-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (though these are not common for 'non-designative')."},"usage_notes":{"explanation":"The term 'non-designative' is primarily used in linguistics and philosophy of language to describe words or expressions that do not directly refer to objects, people, or entities in the world. Instead, they may serve other functions, such as expressing emotions, indicating grammatical relationships, or contributing to the overall structure of a sentence without pointing to a specific referent.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was non-designative, so I didn't understand it.","correct":"✓ The painting was abstract, so I didn't understand it.","note":"'Non-designative' is a linguistic term; use 'abstract' or similar terms when describing art. "},{"incorrect":"✗ Nouns are always designative.","correct":"✓ Most nouns are designative, but some, like abstract nouns, may have less direct reference.","note":"While many nouns are designative, abstract nouns (e.g., 'love', 'justice') may not refer to concrete entities."}],"priority":"☆☆☆"},"related_words":{"derivatives":["designate","designation"],"related_terms":["reference","denotation","connotation","linguistics","semantics","philosophy of language"]},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Non-designative' is a technical term used in linguistics and philosophy to describe elements of language that do not primarily function to refer to specific things in the world. Instead, these elements might express emotions, serve grammatical purposes, or contribute to the structure of language in other ways. This term is not commonly used outside of these specialized fields."},"example_sentences":[{"sentence":"Interjections are a clear example of a non-designative element in language.","translation":"間投詞は、言語における非指示的な要素の明確な例です。","type":"adjective","meaning_category":"Not serving to designate"},{"sentence":"A purely structural word in a sentence can be considered non-designative because it doesn't refer to a specific object.","translation":"文中の純粋に構造的な単語は、特定の対象を指さないため、非指示的であると見なすことができます。","type":"adjective","meaning_category":"Not serving to designate"}]}