{"word":"post-structuralism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポスト構造主義：構造主義の限界を乗り越えようとする、20世紀後半に現れた思想潮流。言語、文化、社会における意味の固定性や普遍性を否定し、意味の流動性、文脈依存性、権力との関係を強調する。","english_definition":"A late 20th-century movement in continental philosophy and literary criticism that departs from structuralism by insisting on the instability of meaning and the importance of context and power relations in the interpretation of texts and cultural phenomena.","examples":[{"sentence":"Post-structuralism challenges the idea that there is a single, objective truth.","translation":"ポスト構造主義は、単一の客観的な真実があるという考えに異議を唱える。"},{"sentence":"Key figures in post-structuralism include Jacques Derrida and Michel Foucault.","translation":"ポスト構造主義の主要な人物には、ジャック・デリダとミシェル・フーコーが含まれる。"},{"sentence":"Post-structuralism emphasizes the role of language in shaping our understanding of the world.","translation":"ポスト構造主義は、世界に対する私たちの理解を形成する言語の役割を強調する。"}],"collocations":["deconstruction (脱構築)","discourse analysis (言説分析)","power relations (権力関係)","subjectivity (主観性)","language games (言語ゲーム)","binary oppositions (二項対立)","logocentrism (ロゴス中心主義)"],"synonyms":["deconstructionism"],"antonyms":["structuralism"]},{"part_of_speech":"noun","definition":"ポスト構造主義的な考え方や理論","english_definition":"The body of thought and theory associated with post-structuralism.","examples":[{"sentence":"Her analysis of the novel was heavily influenced by post-structuralism.","translation":"彼女の小説の分析は、ポスト構造主義の影響を強く受けていた。"},{"sentence":"Post-structuralism has had a significant impact on literary criticism and cultural studies.","translation":"ポスト構造主義は、文芸批評と文化研究に大きな影響を与えてきた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"「post-」は「～の後」を意味する接頭辞。「structuralism」（構造主義）に付加され、構造主義の後に現れた、あるいは構造主義を批判・発展させた思想であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpoʊstˈstrʌktʃərəlɪzəm/","syllables":"post-struc-tur-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"ポスト構造主義は、構造主義の考え方を受け継ぎつつも、その限界を指摘し、乗り越えようとする思想です。構造主義が言語や文化の背後にある普遍的な構造を明らかにしようとするのに対し、ポスト構造主義は、意味は固定されたものではなく、文脈や解釈によって変化し、常に流動的であると考えます。また、権力関係が意味の形成に深く関わっていることを強調します。ジャック・デリダの「脱構築」やミシェル・フーコーの「言説分析」などが代表的な理論です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Post-structuralism believes in objective truth.","correct":"✓ Post-structuralism challenges the idea of objective truth.","note":"ポスト構造主義は客観的な真実の存在を否定します。"},{"incorrect":"✗ Post-structuralism is the same as structuralism.","correct":"✓ Post-structuralism is a response to and critique of structuralism.","note":"ポスト構造主義は構造主義を批判的に発展させたものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["post-structuralist (形容詞/名詞)"],"phrases":["deconstruction","discourse analysis","power relations","subjectivity","binary oppositions","logocentrism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な分野で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**post-structuralism**」は、哲学や文学、社会科学などの分野で使われる専門的な言葉です。構造主義という考え方から発展したもので、意味は一つに決まらず、文脈や解釈によって変わると考えます。また、権力関係が意味の形成に影響を与えることも重視します。ジャック・デリダやミシェル・フーコーといった哲学者の名前と合わせて覚えておくと理解が深まります。"},"example_sentences":[{"sentence":"Post-structuralism questions the stability of meaning in texts.","translation":"ポスト構造主義は、テキストにおける意味の安定性を疑問視する。","type":"noun","meaning_category":"思想潮流"},{"sentence":"Her dissertation explored the influence of post-structuralism on contemporary art.","translation":"彼女の論文は、現代アートに対するポスト構造主義の影響を探求した。","type":"noun","meaning_category":"考え方や理論"}]}