{"word":"unvolatilised","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)揮発しない、蒸発しない","english_definition":"Not volatilized; not converted into a vapor or gas.","examples":[{"sentence":"The unvolatilised residue remained in the flask.","translation":"揮発しなかった残留物はフラスコに残った。"},{"sentence":"Unvolatilised compounds can be analyzed using different techniques.","translation":"揮発しない化合物は、異なる手法を用いて分析できる。"}],"collocations":["unvolatilised residue","unvolatilised compound"],"synonyms":["non-volatile","nonvolatile"],"antonyms":["volatile","volatilised"]}],"etymology":{"value":"Derived from 'volatilise' (or 'volatilize' in American English) by adding the prefix 'un-'. 'Volatilise' comes from 'volatile', which originates from the Latin word 'volatilis', meaning 'able to fly' or 'flying'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnvɒləˈtaɪzd/","syllables":"un-vo-la-til-ised"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more unvolatilised, most unvolatilised), although this is rare."},"usage_notes":{"explanation":"'Unvolatilised' is primarily used in scientific and technical contexts, especially in chemistry, physics, and engineering. It describes substances or components that do not readily evaporate or turn into a gaseous state under specific conditions. It is the opposite of 'volatilised' or 'volatile'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unvolatilised liquid quickly disappeared.","correct":"✓ The volatile liquid quickly disappeared.","note":"If a liquid quickly disappears, it is likely volatile, not unvolatilised."}],"priority":"★☆☆"},"related_words":{"derivatives":["volatilise (verb): to convert into a vapor","volatilisation (noun): the process of converting into a vapor","volatile (adjective): easily evaporated at normal temperatures"],"prefix":"un- (not)","suffix":"-ised (past participle, adjective forming suffix)"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unvolatilised' is a technical term, primarily used in scientific contexts. It means 'not converted into a vapor or gas'. Understanding this word requires knowledge of the root word 'volatile' and the negative prefix 'un-'. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The experiment aimed to separate the volatile components from the unvolatilised ones.","translation":"その実験は、揮発性成分と不揮発性成分を分離することを目的としていた。","type":"adjective","meaning_category":"chemistry"},{"sentence":"The unvolatilised material was collected for further analysis.","translation":"揮発しなかった物質は、さらなる分析のために収集された。","type":"adjective","meaning_category":"chemistry"}]}