{"word":"nonzodiacal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"黄道帯に属さない、黄道星座以外の","english_definition":"Not belonging to or related to the zodiac.","examples":[{"sentence":"The constellation Orion is a nonzodiacal constellation.","translation":"オリオン座は黄道星座ではありません。"},{"sentence":"Nonzodiacal signs are sometimes considered in astrological interpretations.","translation":"黄道帯以外の星座は、占星術の解釈で考慮されることがあります。"}],"collocations":["nonzodiacal constellation","nonzodiacal sign"],"synonyms":["extrazodiacal"],"antonyms":["zodiacal"]}],"etymology":{"value":"\"non-\" (否定) + \"zodiacal\" (黄道帯の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnzəˈdaɪəkəl/","syllables":"non-zo-di-a-cal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Nonzodiacal\" is used to describe something that is not part of the zodiac, which is the belt of constellations through which the sun, moon, and planets appear to travel in the sky. In astrology, the zodiacal constellations are of primary importance, but nonzodiacal constellations may also be considered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun is always in a nonzodiacal sign.","correct":"✓ The sun is never in a nonzodiacal sign.","note":"The sun always passes through a zodiacal sign during the year."}],"priority":"★☆☆"},"related_words":{"derivatives":["zodiac","zodiacal"],"phrases":["nonzodiacal light"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonzodiacal\" is a technical term primarily used in astronomy and astrology. It refers to celestial objects or regions that are not part of the zodiac, which is the band of constellations through which the sun, moon, and planets appear to move. Because it's a specialized term, it's not commonly used in everyday language."},"example_sentences":[{"sentence":"Ancient astronomers also studied nonzodiacal constellations for navigation.","translation":"古代の天文学者は、航海のために黄道星座以外の星座も研究しました。","type":"general","meaning_category":"astronomy"},{"sentence":"Some astrologers incorporate nonzodiacal asteroids into their chart readings.","translation":"一部の占星術師は、占星図の解釈に黄道帯以外の小惑星を取り入れています。","type":"general","meaning_category":"astrology"}]}