{"word":"dewans","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(India) plural of dewan; chief minister or high official in some princely states of India.","english_definition":"Plural form of 'dewan'. In historical contexts, particularly in India, a dewan was a chief minister, prime minister, or a high-ranking official, especially in princely states or under the Mughal empire.","examples":[{"sentence":"The dewans of Travancore were known for their administrative skills.","translation":"トラヴァンコールのdewans（大臣たち）は、その行政手腕で知られていた。"}],"collocations":["Travancore dewans","appointing dewans","influential dewans"],"synonyms":["minister","administrator","official","statesman"],"antonyms":[]}],"etymology":{"value":"Derived from the singular form 'dewan', which comes from Persian 'dīwān' (دیوان), meaning a list, register, account book, or a court of justice. The term evolved to denote a high official or minister.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈwɑːnz/","syllables":"di-wahnz"},"inflection":{"noun_plural":"dewans"},"usage_notes":{"explanation":"'Dewans' is the plural form of 'dewan'. 'Dewan' is a historical term, primarily used in the context of India, to refer to a chief minister or a high-ranking administrative official, especially in princely states or during the Mughal period. It is not commonly used in contemporary English outside of historical or South Asian contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dewan were responsible for the finances.","correct":"✓ The dewans were responsible for the finances.","note":"When referring to multiple dewans, use the plural form 'dewans' and ensure the verb agrees in number (were instead of was)."},{"incorrect":"✗ He was one of the dewan.","correct":"✓ He was one of the dewans.","note":"When referring to one among many dewans, use the plural form 'dewans' after 'one of'."}],"priority":"★★☆"},"related_words":{"derivatives":["dewan (singular form)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of historical or South Asian contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dewans' is a plural noun referring to multiple high-ranking officials or ministers, primarily in the historical context of princely states in India. Understanding its usage requires familiarity with South Asian history and administrative structures. It is not a commonly used word in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The British often negotiated with the dewans of various princely states.","translation":"イギリスはしばしば様々な藩王国のdewans（大臣たち）と交渉した。","type":"noun","meaning_category":"high officials"},{"sentence":"Many reforms were initiated by the dewans to modernize the administration.","translation":"行政を近代化するために、多くの改革がdewans（大臣たち）によって開始された。","type":"noun","meaning_category":"chief ministers"}]}