{"word":"pseudoaristocratically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"貴族めいた様子を装って、見せかけの貴族的に","english_definition":"In a manner that imitates or pretends to be aristocratic.","examples":[{"sentence":"The nouveau riche family behaved pseudoaristocratically, adopting affected manners and extravagant displays of wealth.","translation":"その成金一家は、気取った態度や贅沢な富の誇示など、貴族めいた様子を装って振る舞った。"}],"collocations":["behave pseudoaristocratically","live pseudoaristocratically","dress pseudoaristocratically"],"synonyms":["affectedly","pretentiously","ostentatiously","snobbishly"],"antonyms":["genuinely","authentically","unpretentiously"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"aristocratic\" (貴族的な) + \"-ally\" (〜的に) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːdoʊərɪˌstɑːkrætɪkli","syllables":"pseu-do-a-ris-to-crat-i-cal-ly"},"inflection":{"notes":"This word is an adverb and does not inflect."},"usage_notes":{"explanation":"This word describes behavior or actions that imitate or pretend to be aristocratic, often in a superficial or exaggerated way. It is used to criticize or mock those who try to appear more noble or upper-class than they actually are.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived very pseudoaristocratically life.","correct":"✓ He lived a pseudoaristocratic life.","note":"\"pseudoaristocratically\" is an adverb and modifies verbs, adverbs, or adjectives, not nouns. To modify the noun \"life\", use the adjective \"pseudoaristocratic\"."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoaristocracy (noun): 見せかけの貴族階級、貴族もどき","pseudoaristocratic (adjective): 貴族めいた、見せかけの貴族的な"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudoaristocratically\" is a complex and rare adverb used to describe behavior that imitates or pretends to be aristocratic. It's formed by combining the prefix \"pseudo-\" (meaning false or imitation) with \"aristocratically\" (in a manner characteristic of the aristocracy). This word is typically found in advanced texts or discussions about social class, pretension, or satire. Understanding the components of the word is helpful for deciphering its meaning. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The social climber acted pseudoaristocratically at the gala, attempting to impress the other guests with her affected accent and expensive attire.","translation":"その成り上がり者は、ガラで気取ったアクセントと高価な服装で他の客に印象を与えようとし、貴族めいた様子を装って振る舞った。","type":"adverb","meaning_category":"貴族めいた様子を装って"}]}