{"word":"prepatent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(病気などが)症状が現れる前の、潜伏期の","english_definition":"(of a disease or infection) existing in the body before symptoms are apparent.","examples":[{"sentence":"The prepatent period of malaria can vary from a few days to several weeks.","translation":"マラリアの潜伏期間は数日から数週間まで様々である。"},{"sentence":"During the prepatent phase, the parasite is developing but not yet detectable.","translation":"潜伏期の間、寄生虫は発達しているが、まだ検出できない。"}],"collocations":["prepatent period","prepatent phase","prepatent infection"],"synonyms":["latent","incubationary","subclinical"],"antonyms":["patent","clinical"]}],"etymology":{"value":"\"pre-\" (before) + \"patent\" (evident, obvious).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈpeɪtənt/","syllables":"pre-pa-tent"},"inflection":{"notes":"Comparative and superlative forms are not typically used for this adjective."},"usage_notes":{"explanation":"\"Prepatent\" is a term primarily used in medical and veterinary contexts to describe the period of time between infection with a parasite or pathogen and the appearance of detectable signs or symptoms of the disease. It is often used in discussions of infectious diseases and parasitology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is prepatent, so we should treat it.","correct":"✓ The disease is in its prepatent phase, so we should monitor for any changes.","note":"The prepatent phase is the period before the disease is detectable. Treatment decisions depend on the specific disease and context."}],"priority":"★☆☆"},"related_words":{"derivatives":["patent (adjective: obvious, evident; noun: a grant conferring a right, title, or privilege)","latency (noun: the state of being latent)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Prepatent\" is a specialized term used primarily in medical and veterinary fields. It describes the period of time before a disease or infection becomes detectable through standard diagnostic methods or before symptoms become apparent. Understanding this term requires familiarity with medical terminology and concepts related to disease progression. It is not commonly used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The goal of early detection is to identify infections during the prepatent stage.","translation":"早期発見の目的は、潜伏期に感染を特定することである。","type":"adjective","meaning_category":"medical"},{"sentence":"The prepatent period varies depending on the type of parasite.","translation":"潜伏期間は寄生虫の種類によって異なる。","type":"adjective","meaning_category":"medical"}]}