{"word":"inclusivism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"包容主義、包括主義","english_definition":"The doctrine or belief that one's own religion is the preferred path to God, but that other religions may also provide valid (though perhaps less complete) paths or insights.","examples":[{"sentence":"Inclusivism acknowledges the possibility of salvation for those outside the explicit Christian faith.","translation":"包容主義は、明示的なキリスト教信仰の外にいる人々の救いの可能性を認める。"},{"sentence":"Critics argue that inclusivism can be a subtle form of religious imperialism.","translation":"批判者たちは、包容主義は宗教的帝国主義の巧妙な形態となり得ると主張する。"}],"collocations":["religious inclusivism","theological inclusivism","Christian inclusivism"],"synonyms":["religious pluralism (一部)","broad-mindedness","tolerance"],"antonyms":["exclusivism","particularism","fundamentalism","sectarianism"]},{"part_of_speech":"noun","definition":"(一般的に)包括的なアプローチ、包含主義","english_definition":"(Generally) An approach that emphasizes inclusion and broad participation.","examples":[{"sentence":"The organization adopted an inclusivism that welcomed members from diverse backgrounds.","translation":"その組織は、多様な背景を持つメンバーを歓迎する包括的なアプローチを採用した。"}],"collocations":["social inclusivism","political inclusivism"],"synonyms":["comprehensiveness","integration","openness"],"antonyms":["exclusivity","segregation","discrimination"]}],"etymology":{"value":"'Inclusivism' is derived from 'inclusive' (including or covering all the stated possibilities, etc.) + '-ism' (denoting a doctrine, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkluːzɪvɪzəm/","syllables":"in-clu-siv-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Inclusivism' primarily refers to a theological position, particularly within Christianity, concerning the salvation of non-Christians. It posits that while Christianity may be the fullest or preferred path to God, individuals of other faiths can still be saved through Christ's sacrifice, even if they are unaware of it. Outside of theology, 'inclusivism' can describe any approach that values broad inclusion and participation, such as in social or political contexts. It is often contrasted with 'exclusivism,' which asserts that only those within a specific group (e.g., a particular religion) can achieve salvation or membership.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Inclusivism means all religions are the same.","correct":"✓ Inclusivism means that other religions may contain elements of truth or pathways to salvation, even if one's own religion is considered the most complete.","note":"Inclusivism doesn't equate all religions; it suggests other religions might have partial validity or lead to salvation, though perhaps less directly."}],"priority":"★★☆"},"related_words":{"derivatives":["inclusive","inclusively","inclusiveness"],"related_terms":["exclusivism","pluralism","universalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inclusivism' is a term primarily used in religious studies and theology. It describes the belief that while one particular religion may be considered the truest or best path, other religions may also contain elements of truth and offer ways to connect with the divine. It's different from 'exclusivism,' which says only one religion is true, and 'pluralism,' which suggests all religions are equally valid. Outside of religion, 'inclusivism' can refer to any approach that emphasizes including many different people or ideas."},"example_sentences":[{"sentence":"The conference aimed for inclusivism, inviting speakers from various disciplines.","translation":"その会議は包括主義を目指し、様々な分野からの講演者を招いた。","type":"noun","meaning_category":"一般的に包括的なアプローチ"},{"sentence":"Some theologians advocate for inclusivism as a way to bridge interfaith divides.","translation":"一部の神学者は、宗教間の隔たりを埋める方法として包容主義を提唱している。","type":"noun","meaning_category":"包容主義"}]}