{"word":"artful-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having or characterized by artful eyes; having eyes that suggest cleverness, cunning, or a talent for deception.","english_definition":"Possessing eyes that are skilled at conveying a sense of cleverness, cunning, or deceptiveness.","examples":[{"sentence":"The con artist had an artful-eyed gaze that made people trust him despite their better judgment.","translation":"その詐欺師は、ずる賢さを示す目つきをしており、人々はそうすべきでないと分かっていても彼を信用してしまった。"},{"sentence":"With an artful-eyed glance, she convinced him to change his mind.","translation":"彼女は、人を欺くような目つきで、彼に考えを変えさせた。"},{"sentence":"The novelist described the character as artful-eyed, hinting at their manipulative nature.","translation":"小説家はその登場人物をartful-eyedと描写し、彼らの人を操る性質をほのめかした。"}],"collocations":["artful-eyed gaze","artful-eyed glance","artful-eyed expression","artful-eyed look"],"synonyms":["cunning-eyed","sly-eyed","wily-eyed","deceptive-eyed","scheming-eyed","crafty-eyed"],"antonyms":["naive-eyed","innocent-eyed","honest-eyed","sincere-eyed","trusting-eyed"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'artful' (skillful and clever, especially in a cunning way) and 'eyed' (having eyes of a specified kind). The combination suggests that the eyes themselves possess or convey the quality of being artful.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrtfəl aɪd/","syllables":"art-ful-eyed"},"inflection":{"notes":"Adjectives do not typically inflect in English, so there are no different forms for number or gender."},"usage_notes":{"explanation":"'Artful-eyed' is a descriptive adjective used to characterize someone whose eyes suggest a certain level of cunning, cleverness, or deceptiveness. It implies that the person's eyes are not merely observing but are actively involved in conveying a sense of craftiness or manipulation. The term is often used in literature or descriptive writing to add depth to a character's portrayal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was artful-eyes.","correct":"✓ He was artful-eyed.","note":"The correct form is 'artful-eyed,' not 'artful-eyes.' It's a compound adjective, not a noun."},{"incorrect":"✗ She gave an artfully eyed look.","correct":"✓ She gave an artful-eyed look.","note":"'Artful-eyed' is an adjective describing the 'look,' so it should be used as such, not as an adverb modifying 'eyed.'"}],"priority":"★★☆"},"related_words":{"derivatives":["artful (adjective: skillful and clever, especially in a cunning way)","artfully (adverb: in a skillful and clever way, especially in a cunning way)"],"phrases":["look of artfulness","glance of cunning","deceptive gaze"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is not commonly used in everyday conversation but may appear in literature or descriptive writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Artful-eyed' is a relatively uncommon adjective that combines 'artful' (meaning clever or cunning) with 'eyed' (referring to the eyes). It's used to describe someone whose eyes convey a sense of craftiness or deceptiveness. Because it's not a frequently used term, it's more likely to be found in descriptive or literary contexts where the author is aiming to create a specific impression of a character's nature or intentions."},"example_sentences":[{"sentence":"The spy had an artful-eyed expression that betrayed nothing.","translation":"そのスパイは何も悟られない、ずる賢そうな目つきをしていた。","type":"adjective","meaning_category":"cunning"},{"sentence":"With an artful-eyed smile, she secured the deal.","translation":"彼女は、人を操るような笑顔で、取引をまとめた。","type":"adjective","meaning_category":"deceptive"},{"sentence":"The portrait captured the politician's artful-eyed nature perfectly.","translation":"その肖像画は、政治家のずる賢い本質を完璧に捉えていた。","type":"adjective","meaning_category":"cunning"}]}