{"word":"lithology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"岩相学、岩石組織学","english_definition":"The description of rocks, especially in hand specimen and in outcrop, based on such characteristics as color, mineralogic composition, and grain size.","examples":[{"sentence":"The lithology of the sandstone was analyzed to determine its origin.","translation":"その砂岩の岩相を分析して、その起源を特定した。"},{"sentence":"Detailed lithological descriptions are essential for accurate geological mapping.","translation":"正確な地質図作成には、詳細な岩相記述が不可欠である。"},{"sentence":"The borehole's lithology revealed alternating layers of shale and limestone.","translation":"そのボーリング孔の岩相は、頁岩と石灰岩が交互に重なっていることを明らかにした。"}],"collocations":["lithological description","lithological unit","lithological characteristics","lithological correlation","lithological analysis"],"synonyms":["petrography","petrology","rock description"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'lithos' (stone) and '-logia' (study of).","priority":"★★★"},"pronunciation":{"ipa":"/lɪˈθɒlədʒi/","syllables":"li-thol-o-gy"},"inflection":{"noun_plural":"lithologies"},"usage_notes":{"explanation":"Lithology focuses on the physical and visible characteristics of rocks, which can be observed without the use of advanced chemical analysis. It is often used in field geology and preliminary assessments before more detailed petrological studies are conducted. It is a fundamental aspect of stratigraphy and sedimentology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lithology was determine by chemical composition only.","correct":"✓ The lithology was determined by visual characteristics and mineral composition.","note":"Lithology involves visual and physical characteristics, not solely chemical composition."},{"incorrect":"✗ Lithology is the same as geochemistry.","correct":"✓ Lithology is the description of physical rock characteristics, while geochemistry studies the chemical composition of rocks.","note":"Lithology differs from geochemistry, which focuses on the chemical properties of rocks."}],"priority":"★★☆"},"related_words":{"derivatives":["lithological (adjective)"],"phrasal_verbs":[],"related_terms":["petrology","sedimentology","stratigraphy","geology"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Lithology' refers to describing rocks based on their observable characteristics like color, texture, and mineral composition. It's a term commonly used in geology to understand and classify different types of rocks found in the field. It's important for creating geological maps and understanding the Earth's structure."},"example_sentences":[{"sentence":"The geologist examined the lithology of the rock samples.","translation":"地質学者は岩石サンプルの岩相を調べた。","type":"general","meaning_category":"岩石の記述"},{"sentence":"Lithology helps in correlating rock layers across different locations.","translation":"岩相は、異なる場所の岩石層の相関関係を把握するのに役立つ。","type":"application","meaning_category":"地層の関連付け"},{"sentence":"The report included a detailed lithological analysis of the core samples.","translation":"報告書には、コアサンプルの詳細な岩相分析が含まれていた。","type":"analysis","meaning_category":"岩相分析"}]}