{"word":"soucars","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"plural of soucar (a type of Indian moneylender or banker)","english_definition":"plural form of soucar, referring to multiple Indian moneylenders or bankers.","examples":[{"sentence":"The village was heavily indebted to the soucars.","translation":"その村は、高利貸したちから多額の借金をしていた。"},{"sentence":"Many farmers relied on soucars for loans to buy seeds.","translation":"多くの農民が、種を買うための融資を高利貸しに頼っていた。"}],"collocations":["village soucars","local soucars","powerful soucars"],"synonyms":["moneylenders","bankers","usurers"],"antonyms":[]}],"etymology":{"value":"Derived from the Hindi word 'sahukar' (साहूकार), meaning a banker or moneylender.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaʊkɑːrz/","syllables":"sou-cars"},"inflection":{"noun_plural":"soucars"},"usage_notes":{"explanation":"The term 'soucar' is primarily used in historical or cultural contexts related to India. It refers to individuals or entities engaged in lending money, often at high interest rates. The term can carry negative connotations due to the potential for exploitation of borrowers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a soucars.","correct":"✓ He is a soucar.","note":"'Soucars' is the plural form; use 'soucar' for a single individual."}],"priority":"★☆☆"},"related_words":{"derivatives":["sahukar (singular form)","sahukari (the practice of moneylending)"]},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily in texts about Indian history or economics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'soucars' is a relatively uncommon term, primarily encountered in literature or academic texts that discuss the economic history of India. It refers to a class of moneylenders, often operating in rural areas, who provided loans to farmers and other individuals. Understanding the term requires some familiarity with Indian social and economic structures."},"example_sentences":[{"sentence":"The farmers were at the mercy of the local soucars, who charged exorbitant interest rates.","translation":"農民たちは、法外な金利を請求する地元の高利貸しのなすがままだった。","type":"noun","meaning_category":"moneylenders"},{"sentence":"Historical accounts often depict soucars as both essential and exploitative figures in the rural economy.","translation":"歴史的な記録では、高利貸しは農村経済において不可欠でありながら搾取的な存在として描かれることが多い。","type":"noun","meaning_category":"moneylenders"}]}