{"word":"refugeeship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"難民船","english_definition":"A ship used to transport refugees.","examples":[{"sentence":"The refugeeship was overcrowded and lacked basic supplies.","translation":"その難民船は過密状態で、基本的な物資が不足していた。"},{"sentence":"Many people died during the voyage on the refugeeship.","translation":"多くの人々が難民船での航海中に亡くなった。"}],"collocations":["board a refugeeship (難民船に乗り込む)","life on a refugeeship (難民船での生活)","sink a refugeeship (難民船を沈没させる)"],"synonyms":["transport ship for refugees","evacuation ship"],"antonyms":[]}],"etymology":{"value":"'refugee'（難民）+ '-ship'（船）","priority":"★★★"},"pronunciation":{"ipa":"/ˌrefjuˈdʒiːʃɪp/","syllables":"re-fu-gee-ship"},"inflection":{"noun_plural":"refugeeships"},"usage_notes":{"explanation":"'Refugeeship' refers specifically to a vessel used for transporting refugees, often under difficult or dangerous conditions. It highlights the plight of refugees seeking safety and the means by which they attempt to escape persecution or conflict.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The refugeeship was a luxury liner.","correct":"✓ The refugeeship was a crowded, basic vessel.","note":"Refugeeships are typically not luxurious; they are often overcrowded and lack amenities."}],"priority":"★★☆"},"related_words":{"derivatives":["refugee","ship"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'refugeeship' is a compound noun that refers to a ship used for transporting refugees. It is a relatively uncommon word, but its meaning is straightforward: it combines the concept of 'refugee' (a person who has been forced to leave their country in order to escape war, persecution, or natural disaster) with 'ship' (a large boat for transporting people or goods by sea). Understanding the word requires knowledge of both component words and the context in which it is used, typically involving humanitarian crises and forced migration."},"example_sentences":[{"sentence":"The refugeeship approached the harbor, carrying hundreds of displaced people.","translation":"その難民船は何百人もの避難民を乗せて港に近づいた。","type":"noun","meaning_category":"transportation"},{"sentence":"Stories of hardship and resilience emerged from those who survived the journey on the refugeeship.","translation":"その難民船での旅を生き延びた人々から、苦難と不屈の物語が生まれた。","type":"noun","meaning_category":"experience"}]}