{"word":"supersistent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学)超越的実在の、上位に存在する","english_definition":"Existing above or beyond something; transcendent in existence. (Often used in philosophical contexts).","examples":[{"sentence":"The philosopher argued for a supersistent reality beyond the material world.","translation":"その哲学者は、物質世界を超越した上位に存在する現実を主張した。"},{"sentence":"Some theological perspectives posit a supersistent God, existing outside of time and space.","translation":"いくつかの神学的視点では、時間と空間の外に存在する、超越的な神を想定している。"}],"collocations":["supersistent being","supersistent reality","supersistent cause"],"synonyms":["transcendent","superior","overarching","pre-existent"],"antonyms":["immanent","inferior","subordinate","nonexistent"]}],"etymology":{"value":"Formed from 'super-' (above, beyond) and 'existent' (existing). The term combines the idea of existing with the concept of being above or beyond the ordinary realm of existence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈsɪstənt/","syllables":"su-per-sis-tent"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which are rare for this word)."},"usage_notes":{"explanation":"'Supersistent' is primarily a philosophical term, often used in metaphysics and theology. It describes something that exists in a higher or more fundamental way than ordinary things. It implies a hierarchical view of existence, where some entities are more real or more foundational than others. The term is not common in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supersistent building was very tall.","correct":"✓ The towering building was very tall.","note":"'Supersistent' is not typically used to describe physical height. Use 'towering' or 'imposing' instead."},{"incorrect":"✗ He had a supersistent feeling of happiness.","correct":"✓ He had an overwhelming feeling of happiness.","note":"'Supersistent' is not used to describe the intensity of feelings. Use 'overwhelming' or 'profound' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["supersistence (noun): The state of being supersistent. "],"related_concepts":["transcendence","metaphysics","ontology","theology"]},"level_frequency":{"CEFR":"C2 (Very rare, philosophical contexts only)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Supersistent' is a highly specialized term primarily found in philosophical and theological discussions. It describes a form of existence that is above or beyond ordinary existence, often implying a higher level of reality or being. Due to its abstract and technical nature, it is not commonly used and requires a strong understanding of philosophical concepts to use correctly."},"example_sentences":[{"sentence":"The concept of a supersistent intellect is central to some schools of Neoplatonism.","translation":"超越的な知性の概念は、新プラトン主義のいくつかの学派の中心である。","type":"adjective","meaning_category":"philosophical"},{"sentence":"Scholars debate the nature of the supersistent realm and its relationship to the physical universe.","translation":"学者たちは、超越的な領域の性質と、それが物理的な宇宙との関係について議論している。","type":"adjective","meaning_category":"philosophical"}]}