{"word":"Larine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学)ラリン：特定の化学構造を持つ有機化合物群の総称、またはその一種の具体的な化合物名。","english_definition":"(Organic Chemistry) Larine: A general term for a group of organic compounds with a specific chemical structure, or the name of a specific compound of that type.","examples":[{"sentence":"Larine compounds are being studied for their potential pharmaceutical applications.","translation":"ラリン化合物は、その潜在的な医薬品としての応用について研究されています。"},{"sentence":"The synthesis of Larine derivatives is a challenging area of research.","translation":"ラリン誘導体の合成は、研究の難しい分野です。"}],"collocations":["Larine derivative (ラリン誘導体)","Larine synthesis (ラリン合成)","Larine compound (ラリン化合物)"],"synonyms":["Chemical compound","Organic molecule"],"antonyms":[]}],"etymology":{"value":"主に化学分野で使用される用語であり、特定の起源や語源を持たないことが多い。化合物が発見または合成された際に、研究者によって命名される。","priority":"★★★"},"pronunciation":{"ipa":"/ˈlærɪn/","syllables":"La-rine"},"inflection":{},"usage_notes":{"explanation":"「**Larine**」は、特定の化学構造を持つ有機化合物を指す専門用語です。一般的には、特定の化学構造を持つ一群の化合物を指す総称として使用されるか、そのグループに属する特定の化合物の名前として使用されます。化学、薬学、生物学などの分野で、研究や論文などで用いられます。一般の会話で使われることは稀です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Larine is a type of metal.","correct":"✓ Larine is a type of organic compound.","note":"ラリンは有機化合物であり、金属ではありません。"},{"incorrect":"✗ Larine is commonly used as a household cleaner.","correct":"✓ Larine is primarily used in research and pharmaceutical applications.","note":"ラリンは主に研究や医薬品用途で使用され、家庭用洗剤としては一般的ではありません。"}],"priority":"★★★"},"related_words":{"derivatives":["Larinic acid (ラリン酸)","Larinol (ラリノール)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門分野)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 化学分野の専門用語。","priority":"★★★"},"readability_explanation":{"level":"C1","text":"「**Larine**」は、化学の専門用語であり、特定の化学構造を持つ有機化合物のグループ、またはそのグループに属する特定の化合物を指します。この用語は、化学、薬学、生物学などの分野の研究論文や専門的な議論で使用されます。一般の人が日常会話で使用することはほとんどありません。Larineに関する情報を理解するには、有機化学の基本的な知識が必要です。"},"example_sentences":[{"sentence":"The researchers are investigating the properties of a novel Larine compound.","translation":"研究者たちは、新しいラリン化合物の特性を調査しています。","type":"noun","meaning_category":"化学化合物"},{"sentence":"Larine derivatives have shown promise in inhibiting cancer cell growth.","translation":"ラリン誘導体は、癌細胞の成長を抑制する可能性を示しています。","type":"noun","meaning_category":"化学化合物"}]}