{"word":"Danite","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史的に)ダンの部族の一員","english_definition":"A member of the Tribe of Dan, one of the twelve tribes of Israel.","examples":[{"sentence":"The Danites were known for their skill in seafaring.","translation":"ダンの部族は航海術に長けていることで知られていた。"},{"sentence":"Some Danites migrated north and established a new territory.","translation":"ダンの部族の中には北へ移住し、新たな領土を築いた者もいた。"}],"collocations":["Tribe of Dan","Danite territory"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的に)モルモン教の秘密結社の一員","english_definition":"A member of a secret society of Mormons in the early days of the Latter-Day Saint movement, also known as the Avenging Angels.","examples":[{"sentence":"The Danites were accused of violence and intimidation.","translation":"ダナイトは暴力と脅迫で告発された。"},{"sentence":"The existence and activities of the Danites remain a controversial topic in Mormon history.","translation":"ダナイトの存在と活動は、モルモン教の歴史において依然として議論の的となっている。"}],"collocations":["Avenging Angels"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Dan (Hebrew: דָּן‎), the name of one of the sons of Jacob in the Bible, and the suffix -ite, indicating membership of a group or tribe.","priority":"★★★"},"pronunciation":{"ipa":"ˈdeɪnaɪt","syllables":"Da-nite"},"inflection":{"noun_plural":"Danites"},"usage_notes":{"explanation":"The term \"Danite\" refers to two distinct groups: one from the biblical Tribe of Dan, and another from a controversial group in early Mormon history. Context is crucial to understanding which group is being referred to.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Dan (ダンの部族)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word \"Danite\" is a relatively uncommon term that requires some historical knowledge to understand fully. It refers to either a member of the ancient Tribe of Dan from the Bible or to a member of a controversial secret society in early Mormon history. The context in which the word is used is essential for determining its intended meaning."},"example_sentences":[{"sentence":"Biblical scholars study the history of the Danites and their role in ancient Israel.","translation":"聖書学者は、ダンの部族の歴史と古代イスラエルにおける彼らの役割を研究している。","type":"noun","meaning_category":"Tribe of Dan"},{"sentence":"The alleged actions of the Danites in the 19th century continue to be debated by historians.","translation":"19世紀のダナイトの申し立てられた行動は、歴史家によって議論され続けている。","type":"noun","meaning_category":"Mormon secret society"}]}