{"word":"dislip","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, technical) A brief involuntary movement of the lips, often associated with neurological conditions or certain medications.","english_definition":"A brief, involuntary movement of the lips, sometimes associated with neurological conditions or side effects of medications.","examples":[{"sentence":"The patient exhibited dislips during the neurological examination.","translation":"患者は神経学的検査中に口唇ジスキネジアを示した。"},{"sentence":"Dislips can be a symptom of tardive dyskinesia.","translation":"口唇ジスキネジアは遅発性ジスキネジアの症状の一つとなりうる。"}],"collocations":["exhibit dislips","observe dislips","dislips associated with tardive dyskinesia"],"synonyms":["lip twitch","lip tremor","oral dyskinesia"],"antonyms":[]}],"etymology":{"value":"A combination of 'dis-' (prefix indicating abnormality or disorder) and 'lip'. The term is relatively recent and primarily used in medical or technical contexts.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɪslɪp/","syllables":"dis-lip"},"inflection":{"noun_plural":"dislips"},"usage_notes":{"explanation":"'Dislip' is a relatively rare and technical term, primarily used in medical or neurological contexts to describe involuntary movements of the lips. It is often associated with conditions like tardive dyskinesia or other movement disorders. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a dislip after eating spicy food.","correct":"✓ He had a lip twitch after eating spicy food.","note":"'Dislip' is a specific technical term. A general lip twitch is better described as a 'lip twitch' or 'lip tremor'."}],"priority":"★☆☆"},"related_words":{"derivatives":["dyskinesia (related to abnormal involuntary movements)","tardive dyskinesia (a specific condition associated with dislips)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (very technical and rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dislip' is a highly technical term used in medical contexts, specifically neurology. It refers to involuntary movements of the lips, often associated with neurological conditions or medication side effects. Due to its specialized usage, it is not commonly encountered outside of medical literature or professional discussions. Understanding requires a background in medicine or related fields."},"example_sentences":[{"sentence":"The neurologist noted the presence of dislips during the examination.","translation":"神経科医は診察中に口唇ジスキネジアの存在を指摘した。","type":"noun","meaning_category":"involuntary lip movement"},{"sentence":"Treatment for tardive dyskinesia may help reduce the occurrence of dislips.","translation":"遅発性ジスキネジアの治療は、口唇ジスキネジアの発生を減らすのに役立つかもしれない。","type":"noun","meaning_category":"involuntary lip movement"}]}