{"word":"unmeddled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"干渉されていない、邪魔されていない、手出しされていない","english_definition":"not interfered with; not tampered with; left in its original state.","examples":[{"sentence":"The ancient artifact remained unmeddled in the tomb for centuries.","translation":"その古代の遺物は数世紀もの間、墓の中で干渉されずに残っていた。"},{"sentence":"The recipe was perfect as it was, so I left it unmeddled.","translation":"そのレシピは完璧だったので、手出しせずにそのままにした。"},{"sentence":"The document was found unmeddled, suggesting no one had read it.","translation":"その文書は手出しされていない状態で見つかり、誰も読んでいないことを示唆していた。"}],"collocations":["unmeddled with","left unmeddled","found unmeddled"],"synonyms":["untouched","undisturbed","unaltered","intact","pristine","unaffected","unmolested"],"antonyms":["meddled","interfered","tampered","altered","affected","molested"]}],"etymology":{"value":"Derived from 'meddle' (to interfere in or busy oneself unduly with something that is not one's concern) with the prefix 'un-' (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmɛdld/","syllables":"un-med-dled"},"inflection":{"notes":"This is the past participle of the verb 'meddle' used as an adjective. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unmeddled' describes something that has been left alone and not subjected to unwanted or unnecessary interference. It often implies that the original state or condition is preferable or important to maintain. It is a relatively uncommon word, often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmeddled child played quietly.","correct":"✓ The unmeddled toy lay on the floor.","note":"'Unmeddled' describes objects or situations, not usually people. Use 'unruly' or 'well-behaved' to describe a child's behavior."},{"incorrect":"✗ He unmeddled the situation.","correct":"✓ He left the situation unmeddled.","note":"'Unmeddled' is an adjective, not a verb. Use 'leave unmeddled' to express the action of not interfering."}],"priority":"★☆☆"},"related_words":{"derivatives":["meddle (verb)","meddler (noun)","meddlesome (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmeddled' is a relatively rare and formal word that means something has not been interfered with or altered. It's often used to describe situations where maintaining the original condition is important. Because it's not a common word, it's more likely to be encountered in advanced reading or formal writing."},"example_sentences":[{"sentence":"The original manuscript was carefully preserved, remaining unmeddled by later editors.","translation":"原本は注意深く保存され、後の編集者によって干渉されることはなかった。","type":"adjective","meaning_category":"干渉されていない"},{"sentence":"The crime scene was left unmeddled until the investigators arrived.","translation":"捜査官が到着するまで、犯罪現場は手出しされずに残された。","type":"adjective","meaning_category":"邪魔されていない"},{"sentence":"The old family traditions remained unmeddled, passed down through generations.","translation":"古い家族の伝統はそのままに、世代を超えて受け継がれていった。","type":"adjective","meaning_category":"手出しされていない"}]}