{"word":"Graywall","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にリンゴの)果肉が灰色に変色する生理障害","english_definition":"A physiological disorder, primarily of apples, characterized by a grayish discoloration of the flesh.","examples":[{"sentence":"Graywall can significantly reduce the marketability of apples.","translation":"灰壁症はリンゴの市場性を著しく低下させる可能性がある。"},{"sentence":"Certain apple varieties are more susceptible to graywall than others.","translation":"特定のリンゴ品種は、他の品種よりも灰壁症にかかりやすい。"}],"collocations":["graywall in apples","graywall susceptibility","graywall resistance"],"synonyms":["internal breakdown","flesh browning"],"antonyms":[]}],"etymology":{"value":"The term 'graywall' is descriptive, referring to the gray color observed in the cell walls of affected fruit tissue.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡreɪwɔːl/","syllables":"Gray-wall"},"inflection":{"noun_plural":"Graywalls"},"usage_notes":{"explanation":"Graywall is a postharvest physiological disorder that affects the quality and appearance of apples. It's not caused by a pathogen but is related to environmental factors, mineral imbalances, and storage conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The disease is caused by a fungus.","correct":"Graywall is a physiological disorder, not a disease caused by a pathogen.","note":"Graywall is not caused by a fungus or bacteria but by physiological factors."}],"priority":"★★★"},"related_words":{"derivatives":["None"],"phrasal_verbs":["None"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C1","text":"Graywall is a specialized term used in agriculture, specifically concerning apple cultivation and storage. It refers to a non-pathogenic physiological disorder that causes the flesh of apples to turn gray, reducing their commercial value. Understanding this term requires some background knowledge in fruit physiology and postharvest handling.","priority":"★★★"},"example_sentences":[{"sentence":"Proper storage conditions can help minimize the incidence of graywall in apples.","translation":"適切な保管条件は、リンゴの灰壁症の発生を最小限に抑えるのに役立ちます。","type":"noun","meaning_category":"physiological disorder"},{"sentence":"Calcium sprays during the growing season may reduce the risk of graywall.","translation":"生育期中のカルシウム散布は、灰壁症のリスクを軽減する可能性があります。","type":"noun","meaning_category":"physiological disorder"}]}