{"word":"Departee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"出発する人、離任者、退職者","english_definition":"A person who is departing or leaving a place, especially a job or position.","examples":[{"sentence":"The company held a farewell party for the departees.","translation":"会社は退職者のために送別会を開いた。"},{"sentence":"The departees were wished well by their colleagues.","translation":"出発する人たちは同僚から幸運を祈られた。"},{"sentence":"Each departee received a gift as a token of appreciation.","translation":"退職者一人一人に感謝の印として贈り物が贈られた。"}],"collocations":["former departee","upcoming departees","recent departees","group of departees","departing employee","departing staff"],"synonyms":["leaver","emigrant","migrant","retiree","resigner"],"antonyms":["arrival","entrant","newcomer","joiner"]}],"etymology":{"value":"The word \"departee\" is formed by adding the suffix \"-ee\" to the verb \"depart.\" The suffix \"-ee\" is commonly used to indicate the person who is the recipient or object of the action described by the verb. Thus, a \"departee\" is someone who is departing.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˌpɑːrˈtiː/","syllables":"de-par-tee"},"inflection":{"noun_plural":"departees"},"usage_notes":{"explanation":"The term \"departee\" is relatively formal and is often used in professional or official contexts. It specifically refers to someone who is leaving a place or organization, often permanently. It is less commonly used in everyday conversation. The term is often used in contexts where there is a formal process or ceremony associated with the departure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The departuer was given a gift.","correct":"✓ The departEE was given a gift.","note":"\"Departuer\" is not a standard word. The correct term is \"departee,\" which uses the suffix '-ee' to denote the person who is departing."},{"incorrect":"✗ All the departeds were thanked.","correct":"✓ All the departEEs were thanked.","note":"\"Departed\" is usually used as an adjective (e.g., \"the departed souls\") or refers to someone who has died. The correct noun for someone who is leaving is \"departee.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["depart (verb)","departure (noun)"],"phrasal_verbs":[],"related_nouns":["exit","leaving","retirement","resignation","migration","emigration"],"related_adjectives":["departing","leaving","retiring"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Departee' is a relatively uncommon and formal word. It refers to someone who is leaving a place, organization, or job. It's generally used in professional or official contexts rather than everyday conversation. Understanding this word helps in comprehending formal documents or announcements related to departures. It is not a word typically encountered in basic English learning materials."},"example_sentences":[{"sentence":"The company president gave a speech honoring the departees.","translation":"会社社長は、退職者を称えるスピーチを行った。","type":"noun","meaning_category":"離任者"},{"sentence":"Security protocols were updated to manage the access of departees.","translation":"退職者のアクセスを管理するために、セキュリティプロトコルが更新された。","type":"noun","meaning_category":"退職者"},{"sentence":"A special gift was prepared for each departee as a token of gratitude.","translation":"感謝の印として、退職者一人一人に特別な贈り物が用意された。","type":"noun","meaning_category":"退職者"},{"sentence":"The HR department processed the paperwork for the departees.","translation":"人事部は退職者のための事務処理を行った。","type":"noun","meaning_category":"退職者"},{"sentence":"The departees expressed their gratitude to the team.","translation":"退職者たちはチームへの感謝の意を表明した。","type":"noun","meaning_category":"離任者"}]}