{"word":"Metapher","priority":"★★☆","meanings":[{"part_of_speech":"noun","gender":"feminine","definition":"隠喩、メタファー","english_definition":"a figure of speech in which a word or phrase is applied to an object or action to which it is not literally applicable.","examples":[{"sentence":"Die Metapher 'Zeit ist Geld' verdeutlicht, wie wertvoll Zeit sein kann.","translation":"「時は金なり」というメタファーは、時間がどれほど貴重であるかを明確に示しています。"},{"sentence":"In seinen Gedichten verwendet er viele Metaphern.","translation":"彼の詩には多くのメタファーが使われています。"}],"collocations":["eine Metapher verwenden (メタファーを使う)","eine bildhafte Metapher (イメージ豊かなメタファー)","eine treffende Metapher (的確なメタファー)"],"synonyms":["Bildersprache","Vergleich","Allegorie"],"antonyms":["direkte Rede","wörtliche Bedeutung"]},{"part_of_speech":"noun","gender":"feminine","definition":"比喩表現","english_definition":"a word or phrase used in an imaginative way to describe something else, in order to show that the two things are similar.","examples":[{"sentence":"Die Metapher ist ein wichtiges Stilmittel in der Literatur.","translation":"メタファーは文学における重要な文体表現です。"}],"collocations":["literarische Metapher (文学的なメタファー)","sprachliche Metapher (言語的なメタファー)"],"synonyms":["bildlicher Ausdruck","rhetorische Figur"],"antonyms":["wörtliche Rede"]}],"etymology":{"value":"Das Wort stammt aus dem Griechischen μεταφορά (metaphorá), was „Übertragung“ oder „Übertragung im übertragenen Sinne“ bedeutet. Es setzt sich zusammen aus μετά (metá) „über, nach, mit“ und φορός (phorós) „tragend“, von φέρω (phérō) „tragen“.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmetaˈfeːɐ̯/","syllables":"Me-ta-pher"},"inflection":{"singular":"die Metapher","plural":"die Metaphern"},"usage_notes":{"explanation":"Die Metapher ist ein rhetorisches Stilmittel, bei dem ein Wort oder eine Wortgruppe nicht in ihrer eigentlichen Bedeutung verwendet wird, sondern in einer übertragenen, um eine Ähnlichkeit oder Analogie zwischen zwei unterschiedlichen Dingen oder Sachverhalten herzustellen. Sie dient dazu, etwas anschaulicher, lebendiger oder eindringlicher darzustellen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Der Vergleich ist eine Metapher.","correct":"Eine Metapher ist eine Art von Vergleich.","note":"Ein Vergleich ist eine ähnliche, aber unterschiedliche rhetorische Figur. Ein Vergleich stellt eine explizite Ähnlichkeit her (z.B. „Er ist stark wie ein Bär“), während eine Metapher eine implizite Ähnlichkeit herstellt (z.B. „Er ist ein Bär“)."},{"incorrect":"Ich benutze immer wörtliche Sprache, keine Metaphern.","correct":"Ich benutze immer direkte Sprache, keine Metaphern.","note":"„Wörtliche Sprache“ ist zwar verständlich, aber „direkte Sprache“ ist die üblichere Formulierung im Deutschen, um das Gegenteil von Metaphern zu beschreiben."}],"priority":"★★☆"},"related_words":{"derivatives":["metaphorisch (adjective: metaphorisch, bildlich)"],"related_terms":["Vergleich (noun: Vergleich, Simile)","Symbol (noun: Symbol)","Allegorie (noun: Allegorie)","Rhetorik (noun: Rhetorik)","Stilmittel (noun: Stilmittel)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Mittlere Häufigkeit","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Das Wort „Metapher“ bezeichnet ein sprachliches Stilmittel, bei dem ein Ausdruck nicht in seiner eigentlichen Bedeutung, sondern in einer übertragenen verwendet wird. Ziel ist es, eine bildhafte Vorstellung zu erzeugen oder eine Ähnlichkeit zwischen zwei Dingen hervorzuheben. Um den Text besser zu verstehen, sollte man sich fragen, welche Gemeinsamkeiten zwischen dem eigentlichen und dem übertragenen Sinn bestehen.","priority":"★★☆"},"example_sentences":[{"sentence":"Die Liebe ist eine Rose.","translation":"Liebe ist eine Rose. (Love is a rose.)","type":"example","meaning_category":"Beispiel für eine Metapher"},{"sentence":"Er kämpfte wie ein Löwe.","translation":"Er kämpfte wie ein Löwe. (He fought like a lion.)","type":"example","meaning_category":"Beispiel für eine Metapher"},{"sentence":"Die Zeit ist ein Dieb.","translation":"Die Zeit ist ein Dieb. (Time is a thief.)","type":"example","meaning_category":"Beispiel für eine Metapher"}]}