{"word":"Taxaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イチイ科","english_definition":"The yew family of conifers, characterized by fleshy arils surrounding their seeds rather than cones.","examples":[{"sentence":"Taxaceae includes the genera Taxus (yews), Torreya, and Amentotaxus.","translation":"イチイ科には、イチイ属（Taxus）、カヤ属（Torreya）、ヒメバラモミ属（Amentotaxus）が含まれます。"}],"collocations":["Taxaceae family","Taxaceae species","Taxus baccata (European yew)"],"synonyms":["yew family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Taxus' (yew) + '-aceae' (a standard suffix used to denote a plant family).","priority":"★★☆"},"pronunciation":{"ipa":"/tækˈseɪsiːˌaɪ/","syllables":"Tax-a-ce-ae"},"inflection":{"notes":"Plural: Taxaceaes or Taxaceae (as it is a family name, it is often used as singular even when referring to multiple species)"},"usage_notes":{"explanation":"Taxaceae is a relatively small family of coniferous plants, notable for lacking true cones. Instead, their seeds are partially or entirely enclosed in a fleshy structure called an aril. The most well-known genus is Taxus (yews), which are often poisonous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Taxaceae are a tree.","correct":"✓ Taxaceae is a family of trees.","note":"Taxaceae refers to the entire family, not a single tree. Use 'Taxaceae is' when referring to the family as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["Taxus (yew genus)","Torreya (torreya genus)","Amentotaxus (catkin yew genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in botanical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Taxaceae' is a botanical term referring to the yew family. Understanding this term requires familiarity with plant taxonomy and scientific nomenclature. It is typically encountered in academic or specialized texts related to botany, forestry, or horticulture. The key characteristic of plants in the Taxaceae family is that they have seeds surrounded by a fleshy aril instead of a typical cone structure found in most conifers."},"example_sentences":[{"sentence":"The distribution of Taxaceae species is concentrated in the Northern Hemisphere.","translation":"イチイ科の種の分布は北半球に集中しています。","type":"general","meaning_category":"Distribution"},{"sentence":"Taxaceae plants are often used in ornamental gardening.","translation":"イチイ科の植物は、観賞用庭園でよく使用されます。","type":"horticulture","meaning_category":"Usage"},{"sentence":"The chemical compounds found in Taxaceae have been studied for their medicinal properties.","translation":"イチイ科に見られる化合物は、その薬効について研究されてきました。","type":"scientific","meaning_category":"Research"}]}