{"word":"lipid-responsive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脂質応答性の、脂質に反応する","english_definition":"Capable of responding to lipids or changes in lipid concentrations.","examples":[{"sentence":"The researchers identified a novel lipid-responsive transcription factor.","translation":"研究者らは、新規の脂質応答性転写因子を同定した。"},{"sentence":"This cell line is highly lipid-responsive, making it a good model for studying lipid metabolism.","translation":"この細胞株は脂質応答性が高く、脂質代謝の研究に適したモデルとなる。"}],"collocations":["lipid-responsive gene (脂質応答性遺伝子)","lipid-responsive element (脂質応答性エレメント)","lipid-responsive transcription factor (脂質応答性転写因子)"],"synonyms":["lipid-sensitive"],"antonyms":["lipid-insensitive"]},{"part_of_speech":"adjective","definition":"(文脈によっては)脂質によって調節される","english_definition":"(In some contexts) Regulated or modulated by lipids.","examples":[{"sentence":"The expression of this protein is lipid-responsive.","translation":"このタンパク質の遺伝子発現は脂質によって調節される。"}],"collocations":["lipid-responsive expression (脂質応答性発現)"],"synonyms":["lipid-regulated"],"antonyms":["lipid-unregulated"]}],"etymology":{"value":"Formed by combining \"lipid\" (脂質) with \"responsive\" (反応性の).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɪpɪd rɪˈspɒnsɪv/","syllables":"lip-id re-spon-sive"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (which are rare for compound adjectives like this)."},"usage_notes":{"explanation":"\"Lipid-responsive\" describes something that changes its behavior or activity in response to the presence or concentration of lipids. It is commonly used in biology and biochemistry to describe genes, proteins, cells, or pathways that are affected by lipids. The precise meaning can vary depending on the context; it can refer to direct binding of lipids or indirect effects through signaling pathways.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lipid-responsive was found in the liver.","correct":"✓ A lipid-responsive protein was found in the liver.","note":"\"Lipid-responsive\" is an adjective and needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["lipid (脂質)","responsive (反応性の)","responsiveness (反応性)"],"related_terms":["lipid metabolism (脂質代謝)","lipid signaling (脂質シグナル伝達)","lipidomics (脂質オミクス)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Lipid-responsive\" is a technical term used in biology and biochemistry. It describes something that reacts to lipids, which are fats and oils found in living things. For example, a \"lipid-responsive gene\" is a gene whose activity changes when lipids are present. This term is usually found in scientific research papers and textbooks.","priority":"★★★"},"example_sentences":[{"sentence":"The researchers are studying lipid-responsive genes in the context of obesity.","translation":"研究者らは、肥満の文脈で脂質応答性遺伝子を研究している。","type":"adjective","meaning_category":"脂質に反応する"},{"sentence":"The lipid-responsive element in the promoter region regulates gene expression.","translation":"プロモーター領域の脂質応答性エレメントは、遺伝子発現を調節する。","type":"adjective","meaning_category":"脂質に反応する"}]}