{"word":"prefederal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"連邦成立前の、連邦制移行前の","english_definition":"Existing before the establishment of a federation or federal system of government.","examples":[{"sentence":"The prefederal period of American history was marked by significant political and economic instability.","translation":"アメリカ史の連邦成立前の時代は、著しい政治的・経済的不安定によって特徴づけられた。"},{"sentence":"Scholars study prefederal constitutions to understand the origins of American federalism.","translation":"学者たちは、アメリカ連邦主義の起源を理解するために、連邦成立前の憲法を研究する。"},{"sentence":"The prefederal economy relied heavily on agriculture and trade.","translation":"連邦成立前の経済は、農業と貿易に大きく依存していた。"}],"collocations":["prefederal era","prefederal government","prefederal constitution","prefederal society","prefederal period"],"synonyms":["pre-federal","pre-union","pre-constitutional"],"antonyms":["federal","postfederal","post-federal"]},{"part_of_speech":"adjective","definition":"（特にアメリカ史において）合衆国憲法制定以前の","english_definition":"Relating to the period before the adoption of the United States Constitution.","examples":[{"sentence":"The prefederal debates over states' rights continue to influence American politics today.","translation":"州の権利に関する合衆国憲法制定以前の議論は、今日のアメリカ政治に影響を与え続けている。"},{"sentence":"Many of the Founding Fathers were active participants in the prefederal conventions.","translation":"多くの建国の父たちは、合衆国憲法制定以前の会議に積極的に参加していた。"},{"sentence":"The prefederal Articles of Confederation proved to be inadequate for governing the new nation.","translation":"合衆国憲法制定以前の連合規約は、新しい国家を統治するには不十分であることが判明した。"}],"collocations":["prefederal America","prefederal period","prefederal conventions","prefederal era"],"synonyms":["pre-constitutional","pre-ratification"],"antonyms":["federal","constitutional"]}],"etymology":{"value":"\"pre-\" (before) + \"federal\" (relating to a federation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈfɛdərəl/","syllables":"pre-fed-er-al"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term \"prefederal\" is most commonly used in the context of American history to describe the period before the adoption of the United States Constitution in 1788 and the establishment of a federal system of government. It can also be used more generally to refer to any period before the formation of a federation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pre-federal government was very strong.","correct":"✓ The prefederal government was weak.","note":"The prefederal government under the Articles of Confederation was intentionally designed to be weak, with limited powers. A common misconception is that it was strong."},{"incorrect":"✗ Prefederal refers to the time after the Constitution.","correct":"✓ Prefederal refers to the time before the Constitution.","note":"The prefix \"pre-\" indicates \"before,\" so prefederal always refers to the period preceding the federal period."}],"priority":"★★☆"},"related_words":{"derivatives":["federal","federalist","federalism","confederation"],"phrases":["Articles of Confederation","Constitutional Convention","Founding Fathers"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"prefederal\" is a specialized term primarily used in historical and political contexts. It specifically refers to the time period or conditions existing before the establishment of a federal system, most notably before the United States Constitution was adopted. Understanding this term requires knowledge of historical and political concepts related to federalism and constitutional history. Its use is infrequent outside of academic or specialized discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **prefederal** states retained significant autonomy under the Articles of Confederation.","translation":"連邦成立前の各州は、連合規約の下で大きな自治権を保持していた。","type":"adjective","meaning_category":"連邦成立前の"},{"sentence":"**Prefederal** economic policies were often inconsistent and ineffective.","translation":"連邦成立前の経済政策は、しばしば一貫性がなく、効果的ではなかった。","type":"adjective","meaning_category":"連邦成立前の"},{"sentence":"Historians study **prefederal** documents to understand the motivations of the Founding Fathers.","translation":"歴史家たちは、建国の父たちの動機を理解するために、連邦成立前の文書を研究する。","type":"adjective","meaning_category":"連邦成立前の"}]}