{"word":"Undeclinableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being undeclinable; the property of a word that does not change its form to indicate grammatical functions or relationships.","english_definition":"The state or quality of being undeclinable.","examples":[{"sentence":"The undeclinableness of adverbs in English simplifies grammar in some ways.","translation":"英語における副詞の不変化性は、ある意味で文法を単純化する。"}],"collocations":["grammatical undeclinableness","linguistic undeclinableness"],"synonyms":["invariability","uninflectedness","non-declension"],"antonyms":["declinability","inflection","variability"]}],"etymology":{"value":"Formed from 'undeclinable' (not capable of being declined) + '-ness' (suffix denoting state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndɪˈklaɪnəbəlnəs/","syllables":"un-de-cli-na-ble-ness"},"inflection":{"noun_plural":"undeclinablenesses"},"usage_notes":{"explanation":"'Undeclinableness' is primarily used in linguistic contexts to describe words that do not inflect (change form) to indicate grammatical features like number, gender, case, or tense. It's a property often associated with adverbs, prepositions, and conjunctions in languages like English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The undeclinableness makes the sentence confusing.","correct":"✓ The lack of declension makes the sentence potentially ambiguous.","note":"While 'undeclinableness' is technically correct, it's often clearer to refer to 'lack of declension' or 'absence of inflection' to avoid jargon. The example highlights how a word's inflexibility might lead to ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":["undeclinable (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily a technical term in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undeclinableness' is a technical term used in linguistics. It refers to the characteristic of words that do not change their form to indicate grammatical relationships (such as case, gender, number, or tense). This term is rarely used outside of academic or specialized discussions about language. A more common way to express the same idea is to say that a word is 'uninflected' or 'does not decline.'"},"example_sentences":[{"sentence":"The undeclinableness of the word 'however' makes it easy to use in various sentence structures.","translation":"「however」という語の不変化性は、さまざまな文構造で使用するのを容易にする。","type":"general","meaning_category":"linguistics"},{"sentence":"One of the challenges in learning English is understanding the impact of undeclinableness on sentence meaning.","translation":"英語学習における課題の一つは、不変化性が文の意味に与える影響を理解することである。","type":"general","meaning_category":"linguistics"}]}