{"word":"Amphoricity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)照応の一種で、テクストや会話の中で、ある名詞句が先行する名詞句を指し示すこと。ただし、先行詞が明示的に示されておらず、聞き手や読み手が文脈や知識から推測する必要がある場合を指す。","english_definition":"(Linguistics) A type of anaphora where a noun phrase refers back to a preceding noun phrase in a text or conversation, but the antecedent is not explicitly stated and must be inferred by the listener or reader from context or shared knowledge.","examples":[{"sentence":"The speaker used amphoricity by referring to 'the problem' without having explicitly mentioned it before, assuming the audience knew what they were talking about.","translation":"話し手は、聴衆が何について話しているのかを知っていると仮定して、以前に明示的に言及していなかった「その問題」に言及することで、照応を使用した。"},{"sentence":"Amphoricity can create ambiguity if the context is not clear enough for the audience to identify the intended referent.","translation":"文脈が十分に明確でなく、聴衆が意図された指示対象を特定できない場合、照応は曖昧さを生み出す可能性がある。"}],"collocations":["use amphoricity","create amphoricity","resolve amphoricity","amphoric reference"],"synonyms":["anaphora (loosely)","exophora (related concept)","presupposition"],"antonyms":["explicit reference","direct reference","non-anaphoric reference"]}],"etymology":{"value":"The term 'amphoricity' is derived from 'amphora,' a type of ancient Greek or Roman jar. The connection is metaphorical: just as an amphora contains something, an amphoric expression 'contains' a reference that needs to be unpacked or inferred from the context.","priority":"☆☆☆"},"pronunciation":{"ipa":"/æmfəˈrɪsɪti/","syllables":"am-pho-ri-ci-ty"},"inflection":{"noun_plural":"amphoricities"},"usage_notes":{"explanation":"Amphoricity is a specific type of anaphora. While anaphora generally refers to any reference back to a previously mentioned entity, amphoricity involves an implicit or unstated antecedent. The listener or reader must use their background knowledge, the immediate context, and inferential skills to understand what the amphoric expression is referring to. This contrasts with explicit anaphora, where the antecedent is clearly identified.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"Using anaphora when the antecedent is clearly stated is an example of amphoricity.","correct":"Using anaphora when the antecedent is clearly stated is NOT an example of amphoricity. Amphoricity requires an unstated antecedent.","note":"Amphoricity specifically involves an unstated antecedent, unlike general anaphora with explicit antecedents."}],"priority":"☆☆☆"},"related_words":{"derivatives":["amphoric (adjective)"],"related_terms":["anaphora","cataphora","exophora","endophora","reference","antecedent","referent"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (specialized linguistic term)","frequency_google_ngram":"Very low frequency (specialized term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Amphoricity' is a specialized term in linguistics referring to a type of anaphora where a noun phrase refers back to something previously mentioned, but the original mention is not explicit. Instead, the listener or reader must infer what is being referred to from the context or shared knowledge. It's like the speaker or writer assumes the audience already knows what they're talking about, even though they haven't directly said it yet. This concept is typically discussed in advanced linguistics courses."},"example_sentences":[{"sentence":"The politician's speech relied heavily on amphoricity, assuming the audience was familiar with the details of the ongoing negotiations.","translation":"政治家の演説は、聴衆が進行中の交渉の詳細をよく知っていることを前提として、照応に大きく依存していた。","type":"general","meaning_category":"照応"},{"sentence":"The use of amphoricity in the novel added a layer of complexity, requiring readers to actively engage with the text to understand the implicit references.","translation":"小説における照応の使用は複雑さを加え、読者が暗黙の参照を理解するために積極的にテキストに関与する必要があった。","type":"literary analysis","meaning_category":"照応"}]}