{"word":"Ustilagineous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"黒穂病菌に侵された、または黒穂病菌に似た","english_definition":"Affected by or resembling the smut fungi (Ustilaginaceae).","examples":[{"sentence":"The ustilagineous corn was easily identifiable by its black, powdery spores.","translation":"黒穂病菌に侵されたトウモロコシは、黒くて粉状の胞子によって容易に識別できた。"}],"collocations":["ustilagineous disease","ustilagineous spores"],"synonyms":["smutty","fungal"],"antonyms":["healthy","unaffected"]}],"etymology":{"value":"New Latin Ustilagineus, from Ustilago (the genus of smut fungi) + -eous.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌstɪləˈdʒɪniəs/","syllables":"us-ti-la-gin-e-ous"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this adjective."},"usage_notes":{"explanation":"This term is primarily used in botany and mycology to describe plants or plant parts that are infected with smut fungi or to describe characteristics resembling those fungi. It is a relatively technical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ustilagineous sky was dark and gloomy.","correct":"✓ The overcast sky was dark and gloomy.","note":"'Ustilagineous' refers specifically to smut fungi infections, not general darkness or gloominess."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ustilago (genus of smut fungi)","Ustilaginaceae (family of smut fungi)"],"related_terms":["smut (disease)","fungus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'ustilagineous' is highly specialized and rare, primarily used in scientific contexts related to botany and mycology. It describes something affected by or resembling smut fungi. Due to its limited use, it is unlikely to be encountered outside of technical literature. Understanding requires familiarity with fungal diseases of plants."},"example_sentences":[{"sentence":"The farmer identified the ustilagineous growth on his wheat crop.","translation":"農家は小麦畑の黒穂病菌の発生を確認した。","type":"adjective","meaning_category":"黒穂病菌に侵された"},{"sentence":"Microscopic examination revealed the ustilagineous nature of the spores.","translation":"顕微鏡検査により、胞子が黒穂病菌に由来するものであることが明らかになった。","type":"adjective","meaning_category":"黒穂病菌に似た"}]}