{"word":"non-buying","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not purchasing; related to or characterized by a lack of purchasing.","english_definition":"Relating to or characterized by a lack of purchasing activity; not buying.","examples":[{"sentence":"The company is concerned about the non-buying trend among young adults.","translation":"会社は若年層の購買意欲の低下傾向を懸念している。"},{"sentence":"The non-buying customers cited high prices as the main reason for their decision.","translation":"購入しなかった顧客は、主な理由として価格の高さを挙げた。"},{"sentence":"The survey analyzed the attitudes of non-buying consumers.","translation":"調査では、購入に至らなかった消費者の態度を分析した。"}],"collocations":["non-buying customer","non-buying decision","non-buying behavior","non-buying intention","non-buying trend"],"synonyms":["non-purchasing","unbuying","abstaining from purchase"],"antonyms":["buying","purchasing"],"related_terms":["buyer","consumer","purchase","sales","marketing"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'buying'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn ˈbaɪɪŋ/","syllables":"non-buy-ing"},"inflection":{"notes":"Adjective; does not inflect (no comparative or superlative forms)."},"usage_notes":{"explanation":"'Non-buying' is primarily used in business, marketing, and economics contexts to describe situations or individuals who are not making purchases. It is often used in market research to understand why potential customers are not buying a product or service.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The non buying is a problem.","correct":"The non-buying is a problem. / The lack of buying is a problem.","note":"'Non-buying' is an adjective, so it needs to modify a noun or be part of a phrase. 'The non-buying' is grammatically incorrect without a noun following it. Better to rephrase."}],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in specialized contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Non-buying' is a relatively uncommon term, mostly used in business and marketing. It describes a situation where people are not buying something. It's a straightforward term, but its use is limited to specific professional contexts."},"example_sentences":[{"sentence":"The retailer conducted a survey to understand the reasons for non-buying among potential customers.","translation":"小売業者は、潜在的な顧客の購入に至らない理由を理解するために調査を実施した。","type":"general","meaning_category":"Lack of purchasing"},{"sentence":"The marketing campaign aimed to address the concerns of non-buying consumers.","translation":"そのマーケティングキャンペーンは、購入に至らない消費者の懸念に対処することを目的とした。","type":"marketing","meaning_category":"Lack of purchasing"},{"sentence":"Economic downturns often lead to increased non-buying behavior.","translation":"景気後退は、しばしば購買意欲の低下につながる。","type":"economics","meaning_category":"Lack of purchasing"}]}