{"word":"Undivested","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not divested; not having been deprived or stripped of something.","english_definition":"Not having been deprived or stripped of something, such as rights, possessions, or qualities.","examples":[{"sentence":"The company remained undivested of its assets despite the legal challenges.","translation":"その会社は、法的異議申し立てにもかかわらず、資産を剥奪されずに残った。"},{"sentence":"He felt undivested of his responsibilities, even after the new manager arrived.","translation":"彼は、新しいマネージャーが到着した後も、自分の責任を剥奪されていないと感じた。"},{"sentence":"The land remained undivested of its natural resources.","translation":"その土地は天然資源を剥奪されずに残った。"}],"collocations":["undivested of assets","undivested of rights","undivested of responsibilities","remain undivested","feel undivested"],"synonyms":["retained","possessed","unstripped","unburdened","unrelinquished"],"antonyms":["divested","stripped","deprived","relinquished","burdened"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'divested' of the verb 'divest'. 'Divest' comes from the Latin 'dis-' (apart, away) + 'vestire' (to clothe), originally meaning to unclothe or strip, and later to deprive or rid of something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈvɛstɪd/","syllables":"un-di-vest-ed"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more undivested' and 'most undivested', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Undivested' is the opposite of 'divested,' meaning that something has not been taken away, stripped, or deprived. It is often used in legal, financial, or abstract contexts to indicate that someone or something retains possession or control of something. The term implies a state of retention or preservation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undivested company was very poor.","correct":"✓ The unprosperous company was very poor.","note":"'Undivested' refers to the state of not being deprived of something, not a general state of poverty or lack of prosperity. Use a more appropriate adjective like 'unprosperous' or 'poor' in such contexts."},{"incorrect":"✗ He was undivested in his new role.","correct":"✓ He was invested in his new role.","note":"'Undivested' means not having been stripped of something, while 'invested' means to be involved or committed. The correct word to use in the context of being involved in a role is 'invested'."}],"priority":"★☆☆"},"related_words":{"derivatives":["divest (verb)","divestment (noun)","divestiture (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare; typically found in specialized or formal contexts)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undivested' is a relatively uncommon word that means 'not having been deprived or stripped of something.' It is the opposite of 'divested.' You'll typically encounter it in formal or specialized contexts, such as legal or financial documents, where the retention of rights, possessions, or qualities is being emphasized. Because it's not a common word, it's important to understand the meaning of 'divest' first, which means to deprive or strip something away.","example_sentences":[]},"example_sentences":[{"sentence":"The heir remained undivested of his inheritance despite the family dispute.","translation":"相続人は、家族間の紛争にもかかわらず、相続財産を剥奪されずに残った。","type":"adjective","meaning_category":"Not deprived of inheritance"},{"sentence":"The nation was undivested of its sovereignty.","translation":"その国は主権を剥奪されなかった。","type":"adjective","meaning_category":"Not deprived of sovereignty"},{"sentence":"The artist felt undivested of creative control over his work.","translation":"そのアーティストは、自分の作品に対する創造的なコントロールを奪われていないと感じた。","type":"adjective","meaning_category":"Retaining control"}]}