{"word":"crackability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"割れやすさ、ひび割れ性、亀裂の入りやすさ","english_definition":"The degree to which something is easily cracked or susceptible to cracking.","examples":[{"sentence":"The crackability of the ice was tested before they drove across the lake.","translation":"彼らは湖を車で渡る前に、氷の割れやすさをテストした。"},{"sentence":"The material's crackability is a major concern for its use in construction.","translation":"その材料の亀裂の入りやすさは、建設での使用において大きな懸念事項である。"},{"sentence":"The crackability of different types of concrete was compared in the study.","translation":"その研究では、異なる種類のコンクリートの割れやすさが比較された。"}],"collocations":["high crackability (高い割れやすさ)","low crackability (低い割れやすさ)","assess crackability (割れやすさを評価する)","measure crackability (割れやすさを測定する)","material crackability (材料の割れやすさ)"],"synonyms":["brittleness","fragility","fracturability","susceptibility to cracking","vulnerability to cracking"],"antonyms":["durability","strength","resistance to cracking","toughness","stability"]}],"etymology":{"value":"Derived from 'crackable,' which is formed from 'crack' (to break or split) and '-able' (capable of being). The suffix '-ity' is added to 'crackable' to form a noun indicating the quality or state of being crackable.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrækəˈbɪləti/","syllables":"crack-a-bil-i-ty"},"inflection":{"noun_plural":"crackabilities (rarely used)"},"usage_notes":{"explanation":"'Crackability' refers to the property of a material that describes how easily it can form cracks or fractures. It is often used in engineering, materials science, and construction to assess the suitability of materials for specific applications. The term is relatively technical and less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crackability of the solution was tested.","correct":"✓ The stability of the solution was tested.","note":"'Crackability' is typically used for solid materials, not liquids. For liquids, stability or other properties would be more appropriate. "},{"incorrect":"✗ The crackability of the idea was discussed.","correct":"✓ The feasibility of the idea was discussed.","note":"'Crackability' is a physical property, not an abstract concept. Use 'feasibility' or 'viability' for ideas or plans."}],"priority":"★★☆"},"related_words":{"derivatives":["crack (verb, noun)","crackable (adjective)","cracked (adjective)","cracking (noun, adjective)"],"related_terms":["fracture toughness","stress corrosion cracking","fatigue cracking","material properties","mechanical properties"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crackability' is a technical term used to describe how easily a material can crack or develop fractures. It's often used in fields like engineering and materials science. The word is formed by combining 'crack,' which means to break or split, with the suffix '-ability,' which indicates the capacity or tendency to do something. Therefore, 'crackability' refers to the quality of being crackable. It's not a common word in everyday conversations, but it's important in technical contexts where material properties are being discussed."},"example_sentences":[{"sentence":"The high crackability of this ceramic makes it unsuitable for structural applications.","translation":"このセラミックの高い割れやすさは、構造用途には不向きである。","type":"general","meaning_category":"割れやすさ"},{"sentence":"Engineers are working to reduce the crackability of the new alloy.","translation":"エンジニアたちは、新しい合金の割れやすさを減らすために取り組んでいる。","type":"technical","meaning_category":"割れやすさ"},{"sentence":"The crackability of the coating was tested under various environmental conditions.","translation":"コーティングの割れやすさは、さまざまな環境条件下でテストされた。","type":"technical","meaning_category":"割れやすさ"}]}