{"word":"enophthalmic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"眼球陥入の、眼球後退の","english_definition":"Relating to or characterized by enophthalmos (abnormal recession of the eyeball into the orbit).","examples":[{"sentence":"The patient presented with enophthalmic features following the trauma.","translation":"その患者は外傷後、眼球陥入の特徴を示した。"}],"collocations":[],"synonyms":["sunken-eyed","recessed-eyed"],"antonyms":["exophthalmic","proptotic"]}],"etymology":{"value":"From the Greek words 'en-' (meaning 'in' or 'within') + 'ophthalmos' (meaning 'eye') + '-ic' (adjective suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛnɒfˈθælmɪk/","syllables":"en-oph-thal-mic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more enophthalmic, most enophthalmic) but rarely used."},"usage_notes":{"explanation":"'Enophthalmic' is a specialized term primarily used in medical contexts, specifically ophthalmology and related fields. It describes a condition or feature associated with enophthalmos, the posterior displacement of the eyeball within the orbit. It is often used to describe the appearance of the eye in medical reports or discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The enophthalmic patient was happy.","correct":"✓ The patient with enophthalmos was happy.","note":"'Enophthalmic' is an adjective describing a feature, not a state of being. It's more accurate to say a patient 'has enophthalmos' or 'shows enophthalmic features' rather than describing the patient as 'enophthalmic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["enophthalmos (noun: 眼球陥入)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency - primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Enophthalmic' is a highly specialized medical term. It's used by doctors and other medical professionals to describe something related to enophthalmos, which is when the eyeball sinks back into the eye socket. Because it's a technical term, it's not commonly used in everyday language."},"example_sentences":[{"sentence":"The CT scan revealed enophthalmic changes in the left orbit.","translation":"CTスキャンにより、左眼窩に眼球陥入の変化が認められた。","type":"adjective","meaning_category":"眼球陥入の"},{"sentence":"Enophthalmic appearance can be a sign of certain medical conditions.","translation":"眼球陥入の外観は、特定の病状の兆候である可能性がある。","type":"adjective","meaning_category":"眼球後退の"}]}