{"word":"bioblastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(岩石学)生物組織の構造を持つ、または生物組織によって形成された","english_definition":"(petrology) Having a fabric resulting from the growth of crystals in a metamorphic rock due to the action of living organisms or organic matter.","examples":[{"sentence":"The bioblastic texture of the rock indicates the presence of significant organic activity during its formation.","translation":"その岩石の生物組織構造は、その形成中に重要な有機活動が存在したことを示している。"}],"collocations":["bioblastic texture","bioblastic rock"],"synonyms":["crystalloblastic","metamorphic"],"antonyms":["igneous","sedimentary"]}],"etymology":{"value":"\"bio-\" (life) + \"-blastic\" (related to formation or structure)","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪoʊˈblæstɪk/","syllables":"bi-o-blas-tic"},"inflection":{"notes":"Does not inflect"},"usage_notes":{"explanation":"The term 'bioblastic' is primarily used in petrology and geology to describe the texture of metamorphic rocks where the growth of crystals has been influenced by biological activity or the presence of organic matter. It is a relatively specialized term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was bioblastic because it contained fossils.","correct":"✓ The rock exhibited a bioblastic texture due to organic matter influencing crystal growth during metamorphism.","note":"Bioblastic refers to the texture resulting from crystal growth influenced by organic activity, not simply the presence of fossils."}],"priority":"★★☆"},"related_words":{"derivatives":["blastesis","idioblastic","xenoblastic"],"related_terms":["metamorphism","petrology","texture (of rocks)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bioblastic' is a highly specialized term used in geology, specifically within the study of metamorphic rocks. It describes a particular texture where the growth of crystals has been influenced by biological activity or organic matter. Understanding this term requires a background in petrology and metamorphic processes. It is not commonly used outside of these specific scientific contexts."},"example_sentences":[{"sentence":"The presence of graphite in the schist contributed to its unique bioblastic texture.","translation":"片岩中のグラファイトの存在は、その独特な生物組織構造に貢献した。","type":"technical","meaning_category":"geology"},{"sentence":"Detailed microscopic analysis revealed the bioblastic features of the gneiss.","translation":"詳細な顕微鏡分析により、片麻岩の生物組織的特徴が明らかになった。","type":"technical","meaning_category":"geology"}]}