{"word":"contribution-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"拠出金に基づく、貢献度に基づく","english_definition":"Determined or calculated based on the amount or level of contributions made.","examples":[{"sentence":"The pension scheme is contribution-based, meaning the amount you receive depends on how much you contributed during your working life.","translation":"その年金制度は拠出金に基づくもので、受け取る金額は現役時代にどれだけ拠出したかによって決まります。"},{"sentence":"The voting power within the organization is contribution-based, giving more influence to members who have contributed more time and resources.","translation":"組織内の議決権は貢献度に基づいており、より多くの時間と資源を貢献したメンバーにより大きな影響力が与えられます。"}],"collocations":["contribution-based pension","contribution-based system","contribution-based assessment","contribution-based funding"],"synonyms":["contribution-related","contribution-dependent"],"antonyms":["non-contribution-based","tax-funded","government-funded"]}],"etymology":{"value":"The term is formed by combining 'contribution' (an act of giving or supplying something) with 'based' (having a foundation or support). It signifies that something is founded or determined by the amount or nature of contributions.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkɒntrɪˈbjuːʃənˌbeɪst/","syllables":"con-tri-bu-tion-based"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Contribution-based' is typically used to describe systems or schemes where the benefits or entitlements are directly linked to the amount of contributions made by an individual or entity. It is commonly found in discussions about pension schemes, funding models, and organizational structures.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The salary is contribution based.","correct":"✓ The salary is contribution-based.","note":"It's important to include the hyphen to correctly form the compound adjective."},{"incorrect":"✗ The system is based from contribution.","correct":"✓ The system is contribution-based. / ✓ The system is based on contributions.","note":"The correct preposition to use with 'based' is 'on', or use the adjective 'contribution-based'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["contribution","base","based on"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'contribution-based' is a compound adjective used in specialized contexts such as finance, economics, and organizational management. It describes systems or schemes where benefits or entitlements are directly proportional to the amount of contributions made. Understanding this term requires familiarity with abstract concepts related to funding and resource allocation."},"example_sentences":[{"sentence":"The unemployment benefits are contribution-based; those who have paid more into the system receive higher payments.","translation":"失業給付は拠出金に基づくもので、より多くを制度に支払った人がより高い給付金を受け取ります。","type":"adjective","meaning_category":"拠出金に基づく"},{"sentence":"The research project's funding is contribution-based, relying on donations from various organizations and individuals.","translation":"その研究プロジェクトの資金は貢献度に基づいており、さまざまな組織や個人からの寄付に依存しています。","type":"adjective","meaning_category":"貢献度に基づく"}]}