{"word":"devilized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"悪魔化された、悪魔のように扱われた、中傷された","english_definition":"Having been portrayed as evil or wicked; demonized; vilified.","examples":[{"sentence":"The politician was devilized by the opposing party during the campaign.","translation":"その政治家は選挙戦中、対立政党によって悪魔のように中傷された。"},{"sentence":"In many historical accounts, women accused of witchcraft were devilized and persecuted.","translation":"多くの歴史的記録において、魔女として告発された女性たちは悪魔化され、迫害された。"},{"sentence":"The media devilized the company after the environmental scandal.","translation":"メディアは環境スキャンダルの後、その会社を悪魔のように扱った。"}],"collocations":["devilized by the media","devilized in the press","devilized character","devilized image"],"synonyms":["demonized","vilified","slandered","malign","denigrated"],"antonyms":["praised","lauded","honored","glorified"]},{"part_of_speech":"adjective","definition":"悪魔化された、悪魔のように扱われた","english_definition":"Portrayed or regarded as evil or wicked.","examples":[{"sentence":"The devilized image of the enemy was used to justify the war.","translation":"敵の悪魔化されたイメージは、戦争を正当化するために利用された。"},{"sentence":"The play explores the devilized figure of the tyrant.","translation":"その劇は、暴君の悪魔化された姿を探求している。"}],"collocations":["devilized figure","devilized enemy","devilized portrayal"],"synonyms":["demonized","vilified","wicked","evil"],"antonyms":["angelic","virtuous","saintly"]}],"etymology":{"value":"The word 'devilized' is derived from the verb 'devilize,' which is formed by adding the suffix '-ize' (to make, to treat as) to the noun 'devil.' The 'devil' comes from Old English 'dēofol,' from Late Latin 'diabolus,' from Greek 'diabolos' (slanderer, accuser), from diaballein (to slander), from dia- (across, through) + ballein (to throw).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdevəˌlaɪzd/","syllables":"dev-il-ized"},"inflection":{"verb_forms":{"present_simple":["devilize","devilizes"],"past_simple":"devilized","past_participle":"devilized","present_participle":"devilizing"}},"usage_notes":{"explanation":"'Devilized' is primarily used to describe someone or something that has been portrayed or treated as evil, wicked, or demonic. It often implies a deliberate effort to create a negative image or to demonize a person, group, or idea, often for political or social purposes. It can also describe a character or figure in literature, film, or other media that is depicted as evil. The term carries a strong negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The devilized person was actually very kind.","correct":"✓ The demonized person was actually very kind.","note":"While 'devilized' and 'demonized' are similar, 'demonized' is more commonly used in contemporary English. 'Devilized' can sound slightly archaic or less natural in some contexts."},{"incorrect":"✗ They devilized the situation by adding more problems.","correct":"✓ They worsened the situation by adding more problems.","note":"'Devilized' specifically refers to portraying something as evil, not simply making it worse. Use a more general term like 'worsened' if you mean to describe making a situation worse without necessarily implying evil."}],"priority":"★☆☆"},"related_words":{"derivatives":["devilize (verb: to portray as evil)","devilization (noun: the act of portraying as evil)","devil (noun: an evil spirit; a wicked person)","devilish (adjective: like a devil; wicked)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'devilized' is a relatively uncommon term that implies a deliberate act of portraying someone or something as evil or wicked. It's often used in contexts where there is a conscious effort to demonize a person, group, or idea, often for political or social reasons. Understanding the word requires a grasp of the concept of demonization and the nuances of language used to describe moral judgments. It's more likely to be encountered in academic or analytical writing rather than everyday conversation."},"example_sentences":[{"sentence":"The regime devilized political dissidents to justify their imprisonment.","translation":"政権は政治的反体制派を悪魔化し、彼らの投獄を正当化した。","type":"verb (past participle)","meaning_category":"悪魔化された"},{"sentence":"The devilized portrayal of the enemy fueled public support for the war.","translation":"敵の悪魔化された描写は、戦争に対する国民の支持を煽った。","type":"adjective","meaning_category":"悪魔化された"},{"sentence":"The media often devilizes individuals involved in high-profile scandals.","translation":"メディアはしばしば、注目度の高いスキャンダルに関与した個人を悪魔化する。","type":"verb (present simple)","meaning_category":"悪魔化する"}]}