{"word":"ictus-responsive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(医学)脳卒中（ictus）に対して反応性がある、または反応を示すこと","english_definition":"(Medicine) Exhibiting or characterized by responsiveness to ictus (stroke). This term is often used in the context of medical interventions or diagnostic assessments where the patient's reaction to a stroke event is evaluated.","examples":[{"sentence":"The patient was ictus-responsive, showing signs of awareness and motor function after the initial event.","translation":"患者は脳卒中に対して反応性があり、初期のイベント後、意識と運動機能の兆候を示した。"},{"sentence":"Neurological assessments confirmed that the individual was ictus-responsive, indicating potential for rehabilitation.","translation":"神経学的評価により、その個人が脳卒中に対して反応性があることが確認され、リハビリテーションの可能性が示唆された。"}],"collocations":["ictus-responsive patient","ictus-responsive behavior","ictus-responsive treatment","assess ictus-responsiveness","evaluate ictus-responsiveness"],"synonyms":["responsive to stroke","stroke-reactive","stroke-responsive","reacting to ictus"],"antonyms":["ictus-unresponsive","non-responsive to stroke","stroke-unreactive"]}],"etymology":{"value":"The term is formed by combining 'ictus' (Latin for 'stroke' or 'blow') with 'responsive' (indicating the ability to react or respond).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪktəs rɪˈspɒnsɪv/","syllables":"ic-tus re-spon-sive"},"inflection":{"notes":"Adjectives do not typically inflect in English, but comparative and superlative forms can be created with 'more' and 'most' or '-er' and '-est' (though less common in this case)."},"usage_notes":{"explanation":"'Ictus-responsive' is a specialized medical term. It describes a patient's condition following a stroke, where they exhibit some level of awareness, motor function, or reaction to stimuli. This term is important in assessing the prognosis and planning rehabilitation strategies. It is primarily used by medical professionals in clinical settings and research.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was ictus, so he was responsive.","correct":"✓ The patient was ictus-responsive, showing signs of awareness.","note":"'Ictus' refers to the stroke event itself, while 'ictus-responsive' describes the patient's state of reaction to that event."},{"incorrect":"✗ The treatment made him ictus.","correct":"✓ The treatment improved his ictus-responsiveness.","note":"The treatment aims to improve responsiveness, not cause the ictus itself."}],"priority":"★★☆"},"related_words":{"derivatives":["ictus (noun: stroke, seizure)","responsiveness (noun: the quality of reacting quickly and positively)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Highly specialized medical terminology)","frequency_google_ngram":"Very low frequency - Specific to medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'ictus-responsive' is highly specialized and primarily used in medical contexts, specifically neurology and stroke care. It describes a patient's condition after experiencing a stroke (ictus), where they show some level of reaction or response to stimuli, indicating preserved neurological function. This term is not commonly used outside of medical settings. Understanding requires knowledge of medical terminology and stroke pathophysiology."},"example_sentences":[{"sentence":"Early intervention is critical for patients who are ictus-responsive to maximize recovery potential.","translation":"回復の可能性を最大化するためには、脳卒中に対して反応性のある患者に対する早期介入が重要である。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"The degree of ictus-responsiveness was a key factor in determining the patient's eligibility for thrombolytic therapy.","translation":"脳卒中に対する反応性の程度は、患者が血栓溶解療法を受ける資格があるかどうかを判断する上で重要な要素であった。","type":"adjective","meaning_category":"Medical Assessment"}]}