{"word":"perspicacia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"洞察力、明敏さ、鋭敏さ、見抜く力","english_definition":"the quality of having a ready insight into and understanding of things.","examples":[{"sentence":"Su perspicacia para los negocios le permitió construir un imperio.","translation":"彼のビジネスに対する洞察力のおかげで、彼は帝国を築き上げることができました。"},{"sentence":"La perspicacia de la detective resolvió el caso rápidamente.","translation":"その刑事の鋭敏さによって、事件は迅速に解決されました。"},{"sentence":"Necesitamos a alguien con perspicacia para analizar estos datos.","translation":"このデータを分析するためには、洞察力のある人が必要です。"}],"collocations":["tener perspicacia (洞察力を持つ)","mostrar perspicacia (洞察力を示す)","perspicacia para los negocios (ビジネスに対する洞察力)","perspicacia política (政治的洞察力)"],"synonyms":["agudeza","astucia","inteligencia","sagacidad","perspicuidad","penetración","discernimiento","clarividencia"],"antonyms":["torpeza","estupidez","insensatez","necedad"]}],"etymology":{"value":"Del latín 'perspicacia', derivado de 'perspicax' (de vista aguda, perspicaz), a su vez de 'perspicere' (mirar a través de, examinar cuidadosamente), compuesto de 'per-' (a través de) y 'spicere' (mirar).","priority":"★★☆"},"pronunciation":{"ipa":"/peɾspiˈkaθja/ (Spain), /peɾspiˈkasja/ (Latin America)","syllables":"pers-pi-ca-cia"},"inflection":{"noun_gender":"feminine","noun_plural":"perspicacias"},"usage_notes":{"explanation":"'Perspicacia' se refiere a la capacidad de comprender situaciones complejas o sutiles de manera rápida y precisa. Implica una inteligencia aguda y la habilidad de ver más allá de lo evidente. Es una cualidad muy valorada en líderes, analistas, investigadores y cualquier persona que necesite tomar decisiones informadas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Su perspicacia es muy alto.","correct":"✓ Su perspicacia es muy alta.","note":"'Perspicacia' es un sustantivo femenino, por lo que el adjetivo debe concordar en género. Se dice 'alta' en lugar de 'alto'."},{"incorrect":"✗ Él tiene mucho perspicacia.","correct":"✓ Él tiene mucha perspicacia.","note":"'Perspicacia' es un sustantivo femenino, por lo que el adjetivo 'mucho' debe concordar en género y convertirse en 'mucha'."}],"priority":"★★☆"},"related_words":{"derivatives":["perspicaz (adjective: perspicacious, insightful)","perspicazmente (adverb: perspicaciously, insightfully)"],"phrases":["con perspicacia (with perspicacity, insightfully)"],"priority":"★★☆"},"level_frequency":{"level":"C1-C2","frequency_corpus":"Relatively infrequent in general conversation, more common in formal writing and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perspicacia' is a more formal and abstract term for the ability to understand things quickly and deeply. It suggests a sharp intelligence and the capacity to see beyond the surface of a situation. It's not a word you'd typically use in everyday conversation, but it's useful in more formal or academic contexts when you want to emphasize someone's insightful nature.","priority":"★★☆"},"example_sentences":[{"sentence":"La perspicacia del analista financiero predijo la crisis económica.","translation":"The financial analyst's perspicacity predicted the economic crisis.","type":"general","meaning_category":"insight"},{"sentence":"Su perspicacia para entender las motivaciones humanas la convirtió en una excelente mediadora.","translation":"Her perspicacity in understanding human motivations made her an excellent mediator.","type":"general","meaning_category":"understanding"},{"sentence":"La perspicacia con la que abordó el problema sorprendió a todos.","translation":"The perspicacity with which she approached the problem surprised everyone.","type":"general","meaning_category":"approach"}]}