{"word":"undermatch","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)過小評価する、(期待される能力より)低いレベルで競争させる","english_definition":"To place or compete someone in a level lower than their ability or expected level. To underestimate someone's potential or ability.","examples":[{"sentence":"The coach decided to undermatch the star player in the first round to build their confidence.","translation":"コーチは、自信を持たせるために、スター選手を最初のラウンドで過小評価することにした。"},{"sentence":"She felt she was being undermatched in her current role and sought a more challenging position.","translation":"彼女は現在の役割で過小評価されていると感じ、より挑戦的な地位を求めた。"}],"collocations":["undermatch a player","undermatch a team","undermatch someone's skills"],"synonyms":["underestimate","underrate","misjudge","devalue"],"antonyms":["overmatch","overestimate","overrate"]},{"part_of_speech":"noun","definition":"(人やチームの)過小評価、能力以下のレベルでの競争","english_definition":"The act of placing or competing someone in a level lower than their ability. A situation where someone or a team is underestimated.","examples":[{"sentence":"The game was considered an undermatch, as one team was significantly stronger than the other.","translation":"一方のチームが他方よりも著しく強かったため、その試合は過小評価された。"},{"sentence":"The coach's decision to create an undermatch led to an easy victory.","translation":"過小評価を生み出すというコーチの決定は、容易な勝利につながった。"}],"collocations":["a clear undermatch","a significant undermatch","create an undermatch"],"synonyms":["mismatch","imbalance","inequality"],"antonyms":["fair match","even match","equal competition"]}],"etymology":{"value":"The word 'undermatch' is formed by combining the prefix 'under-' (meaning below or less than) with the word 'match' (referring to a competition or pairing).","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌndərˈmætʃ/","syllables":"un-der-match"},"inflection":{"verb_forms":{"present_simple":["undermatch","undermatches"],"past_simple":"undermatched","past_participle":"undermatched","present_participle":"undermatching"},"noun_plural":"undermatchs/undermatches"},"usage_notes":{"explanation":"'Undermatch' is often used in the context of sports, games, or competitive situations to describe a situation where one participant is significantly weaker or less skilled than the other. It can also refer to the act of intentionally placing someone in a competition where they are likely to win easily.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The team was undermatch by the coach.","correct":"The team was undermatched by the coach.","note":"Ensure correct use of the past participle form 'undermatched' when used in passive voice."}],"priority":"N/A"},"related_words":{"derivatives":["undermatched (adjective)","undermatching (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Undermatch' describes a situation where someone is placed in a competition or role that is below their skill level, often leading to an easy victory or lack of challenge. It's commonly used in sports or business contexts to describe a strategic decision to create an advantage by ensuring a weaker opponent or task."},"example_sentences":[{"sentence":"The boxer was accused of undermatched his opponent to improve his record.","translation":"そのボクサーは、記録を向上させるために相手を過小評価したと非難された。","type":"verb","meaning_category":"過小評価する"},{"sentence":"The tournament organizers were criticized for creating an undermatch in the final round.","translation":"トーナメント主催者は、決勝ラウンドで過小評価を生み出したとして批判された。","type":"noun","meaning_category":"過小評価"}]}