{"word":"nonbeauties","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"複数の美しくないもの、または美しくない人々。","english_definition":"plural of nonbeauty: things or people that are not beautiful.","examples":[{"sentence":"The exhibition featured both beauties and nonbeauties, highlighting the subjective nature of aesthetics.","translation":"その展覧会では、美人とそうでない人の両方が展示され、美学の主観的な性質が強調された。"},{"sentence":"She preferred to photograph nonbeauties, finding their unique features more interesting.","translation":"彼女は美しくない人々を撮影することを好み、彼らのユニークな特徴がより面白いと感じた。"}],"collocations":["a collection of nonbeauties","photographing nonbeauties"],"synonyms":["plain individuals","unattractive things"],"antonyms":["beauties"],"notes":"This word is often used to contrast with the conventional idea of beauty.","priority":"★☆☆"}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'beauties'.","priority":"★★☆"},"pronunciation":{"ipa":"/nɒnˈbjuːtiz/","syllables":"non-beau-ties"},"inflection":{"noun_plural":"nonbeauties"},"usage_notes":{"explanation":"'Nonbeauties' is a plural noun used to describe things or people that are considered lacking in conventional beauty. It is often used in discussions about aesthetics, art, and societal standards of beauty. The term can sometimes be seen as derogatory, so it should be used with caution and sensitivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a nonbeauty.","correct":"✓ She is a nonbeauty, or She is not a beauty.","note":"'Nonbeauty' is less common as a singular noun. It's more natural to say 'not a beauty' or use another descriptive term."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonbeauty (singular form)","beauty (antonym)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonbeauties' is a relatively uncommon term used to describe things or people that are not considered conventionally beautiful. It is often used in contrast to the word 'beauties'. Due to its potential to be perceived as negative or insensitive, it is important to use this word carefully and consider the context in which it is used."},"example_sentences":[{"sentence":"The artist often depicted nonbeauties in his paintings, challenging traditional standards of beauty.","translation":"そのアーティストは、伝統的な美の基準に挑戦し、絵画の中でしばしば美しくないものを描いた。","type":"general","meaning_category":"lacking conventional beauty"},{"sentence":"The fashion magazine featured models of all shapes and sizes, including those who might be considered nonbeauties.","translation":"そのファッション雑誌は、あらゆる体型やサイズのモデルを特集し、美しくないと見なされる可能性のあるモデルも含まれていた。","type":"general","meaning_category":"lacking conventional beauty"}]}