{"word":"Reinfections","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再感染 (複数形)","english_definition":"plural form of reinfection: instances of being infected again with the same disease after recovery.","examples":[{"sentence":"The study focused on the rates of reinfections among vaccinated individuals.","translation":"その研究は、ワクチン接種を受けた人々の再感染率に焦点を当てた。"},{"sentence":"With the emergence of new variants, we are seeing more cases of reinfections.","translation":"新たな変異株の出現により、再感染の症例が増えている。"}],"collocations":["rates of reinfections","cases of reinfections","risk of reinfections","study on reinfections"],"synonyms":["recurrent infections","repeated infections"],"antonyms":["primary infections","first-time infections"]}],"etymology":{"value":"'Re-' (again) + 'infections' (plural of infection). Indicates multiple instances of being infected again.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːɪnˈfɛkʃənz/","syllables":"re-in-fec-tions"},"inflection":{"noun_plural":"Reinfections"},"usage_notes":{"explanation":"'Reinfections' specifically refers to multiple instances of getting infected with the same disease after having recovered from it previously. It's commonly used in the context of infectious diseases, epidemiology, and public health. It implies that immunity from a previous infection is not fully protective or has waned over time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reinfection is increasing.","correct":"✓ Reinfections are increasing.","note":"Since it describes multiple instances, the plural form 'reinfections' is generally used when discussing the phenomenon in general. If referring to a single instance, use 'a reinfection' or 'the reinfection' in a specific context."},{"incorrect":"✗ He had a reinfection of the flu last year.","correct":"✓ He had a reinfection with the flu last year.","note":"The correct preposition to use with 'reinfection' when specifying the disease is 'with' (e.g., reinfection with the flu)."}],"priority":"★★☆"},"related_words":{"derivatives":["reinfect (verb)","reinfected (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing due to recent pandemics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Reinfections' is a plural noun referring to multiple instances of being infected with the same disease again after recovery. This term is commonly used in medical and epidemiological contexts when discussing the recurrence of infections, especially in the context of waning immunity or new variants of a disease. Understanding this term requires a good grasp of medical terminology and the concept of infectious diseases.","priority":"★★☆"},"example_sentences":[{"sentence":"Scientists are studying the factors that contribute to reinfections with COVID-19.","translation":"科学者たちは、COVID-19の再感染に寄与する要因を研究している。","type":"noun","meaning_category":"再感染"},{"sentence":"The high rate of reinfections is a concern for public health officials.","translation":"再感染率の高さは、公衆衛生当局にとって懸念事項である。","type":"noun","meaning_category":"再感染"},{"sentence":"Some individuals experience more severe symptoms during reinfections compared to their initial infection.","translation":"最初の感染と比較して、再感染時に、より重篤な症状を経験する人もいる。","type":"noun","meaning_category":"再感染"}]}