{"word":"Priapisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"持続勃起症","english_definition":"A prolonged erection of the penis, usually without sexual stimulation.","examples":[{"sentence":"He was rushed to the hospital due to priapisms.","translation":"彼は持続勃起症のため、病院に緊急搬送された。"},{"sentence":"Priapisms can be a side effect of certain medications.","translation":"持続勃起症は特定の薬の副作用である可能性がある。"}],"collocations":["develop priapisms (持続勃起症を発症する)","treat priapisms (持続勃起症を治療する)","ischemic priapisms (虚血性持続勃起症)","non-ischemic priapisms (非虚血性持続勃起症)"],"synonyms":["persistent erection","prolonged erection"],"antonyms":[]}],"etymology":{"value":"From Priapus, the Greek god of fertility and male sexuality, known for his permanent, exaggerated erection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪ.ə.pɪ.zəmz/","syllables":"Pri-a-piz-ms"},"inflection":{"noun_plural":"priapisms"},"usage_notes":{"explanation":"\"Priapisms\" refers to a medical condition characterized by a persistent and often painful erection of the penis that is not associated with sexual arousal. It requires prompt medical attention to prevent potential long-term damage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has priapism.","correct":"✓ He has priapisms.","note":"Although often used as a singular condition, the term is technically plural. However, using the singular 'priapism' is becoming more common in general usage."}],"priority":"★★☆"},"related_words":{"derivatives":["priapic (adjective: relating to or resembling Priapus or his attributes, especially a prominent phallus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Priapisms\" is a medical term referring to a prolonged and often painful erection not associated with sexual stimulation. This condition requires immediate medical attention to avoid potential complications. The term is derived from Priapus, the Greek god of fertility, who was depicted with a permanent erection."},"example_sentences":[{"sentence":"The doctor explained the risks associated with untreated priapisms.","translation":"医師は、治療せずに放置された持続勃起症に伴うリスクについて説明した。","type":"medical","meaning_category":"medical condition"},{"sentence":"Certain medications can increase the likelihood of developing priapisms.","translation":"特定の薬は、持続勃起症を発症する可能性を高めることがある。","type":"medical","meaning_category":"medical condition"}]}