{"word":"filiety","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"親子関係、特に息子としての関係","english_definition":"The condition or fact of being a son or daughter; sonship or daughterhood.","examples":[{"sentence":"The painting depicted the filiety between the king and his heir.","translation":"その絵は王と後継者との間の親子関係を描いていた。"},{"sentence":"The poem explored themes of filiety and inheritance.","translation":"その詩は親子関係と相続というテーマを探求していた。"}],"collocations":["divine filiety (神の子であること)","human filiety (人間の親子関係)"],"synonyms":["sonship","daughterhood","parentage","kinship","lineage"],"antonyms":["parentage","fatherhood","motherhood"]}],"etymology":{"value":"Late Latin *filietas*, from Latin *filius* (son) or *filia* (daughter) + *-etas* (abstract noun suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈlaɪɪti/","syllables":"fi-li-e-ty"},"inflection":{"noun_plural":"filieties"},"usage_notes":{"explanation":"'Filiety' is a relatively rare and formal word that refers to the state of being someone's child, especially their son. It is often used in theological or philosophical contexts to describe the relationship between God and humanity, or within families to emphasize the roles and responsibilities of children.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great filiety towards his friends.","correct":"✓ He showed great loyalty towards his friends.","note":"'Filiety' refers specifically to the parent-child relationship, not general loyalty or friendship."},{"incorrect":"✗ The filiety of the building was impressive.","correct":"✓ The design of the building was impressive.","note":"'Filiety' does not refer to the design or structure of something."}],"priority":"★★☆"},"related_words":{"derivatives":["filial (形容詞: 親子関係の、子供らしい)","affiliation (名詞: 所属、提携)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Filiety' is a rare and formal word, primarily used in academic or theological contexts. It describes the state of being a son or daughter. Due to its limited usage, it is not commonly encountered in everyday language. Understanding its meaning requires a strong vocabulary and familiarity with formal or specialized texts."},"example_sentences":[{"sentence":"The concept of divine filiety is central to Christian theology.","translation":"神の子であるという概念はキリスト教神学の中心である。","type":"noun","meaning_category":"親子関係 (神学)"},{"sentence":"The novel explores the complexities of filiety in a dysfunctional family.","translation":"その小説は機能不全家族における親子関係の複雑さを探求している。","type":"noun","meaning_category":"親子関係 (文学)"},{"sentence":"The legal document established the filiety of the adopted child.","translation":"その法的文書は養子の親子関係を確立した。","type":"noun","meaning_category":"親子関係 (法律)"}]}