{"word":"after-cooking","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"調理後","english_definition":"The process or state of food continuing to cook even after it has been removed from the heat source.","examples":[{"sentence":"The after-cooking of the roast allowed it to reach the perfect internal temperature.","translation":"ローストの余熱調理により、完璧な内部温度に達することができました。"},{"sentence":"Be careful not to overcook the pasta; the after-cooking will continue to soften it.","translation":"パスタを茹ですぎないように注意してください。余熱調理でさらに柔らかくなります。"}],"collocations":["after-cooking effect","residual cooking","carryover cooking"],"synonyms":["residual cooking","carryover cooking"],"antonyms":["immediate cooling"]}],"etymology":{"value":"Derived from the combination of 'after' (following in time or order) and 'cooking' (the process of preparing food by applying heat).","priority":"N/A"},"pronunciation":{"ipa":"/ˈæftərˌkʊkɪŋ/","syllables":"af-ter-cook-ing"},"inflection":{"notes":"This is a noun, so it does not inflect like a verb."},"usage_notes":{"explanation":"After-cooking refers to the phenomenon where food continues to cook internally even after being removed from a heat source, due to the residual heat within the food. This is especially important to consider when cooking large pieces of meat or dense foods.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The food is still cooking after you cook it.","correct":"The food is undergoing after-cooking.","note":"Use the term 'after-cooking' to specifically refer to the process, rather than a general description of cooking."}]},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["cooking","heat","residual heat","carryover cooking"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'after-cooking' describes the process where food continues to cook internally after being removed from the heat source due to residual heat. This is a common concept in cooking, especially with larger items like roasts, and understanding it helps prevent overcooking."},"example_sentences":[{"sentence":"The chef relies on after-cooking to ensure the steak is perfectly medium-rare.","translation":"シェフは、ステーキが完璧なミディアムレアになるように、余熱調理を利用しています。","type":"noun","meaning_category":"調理後"}]}