{"word":"Arsenicize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ヒ素で処理する、ヒ素を混ぜる、ヒ素を添加する","english_definition":"To treat or impregnate with arsenic; to combine or mix with arsenic.","examples":[{"sentence":"The wood was arsenicized to prevent insect infestation.","translation":"その木材は、虫害を防ぐためにヒ素で処理された。"},{"sentence":"The solution was arsenicized to make it more effective as a pesticide.","translation":"その溶液は、殺虫剤としての効果を高めるためにヒ素が添加された。"}],"collocations":["arsenicize wood (木材をヒ素処理する)","arsenicize a solution (溶液にヒ素を添加する)"],"synonyms":["impregnate with arsenic","treat with arsenic","arsenicate"],"antonyms":["decontaminate","purify"]}],"etymology":{"value":"\"Arsenic\" + \"-ize\".  From the noun \"arsenic\", referring to the chemical element, combined with the suffix \"-ize\", indicating the process of treating something with arsenic.","priority":"★★★"},"pronunciation":{"ipa":"/ɑːrˈsɛnɪsaɪz/","syllables":"ar-sen-i-cize"},"inflection":{"verb_forms":{"present_simple":["arsenicize","arsenicizes"],"past_simple":"arsenicized","past_participle":"arsenicized","present_participle":"arsenicizing"}},"usage_notes":{"explanation":"\"Arsenicize\" refers to the process of treating something with arsenic, usually to preserve it or make it toxic to pests. It's a technical term, not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The farmer arsenicized the crops with fertilizer.","correct":"✓ The farmer treated the crops with arsenic.","note":"Arsenic is not a fertilizer; it's a pesticide or preservative. Using \"arsenicize\" implies the use of arsenic specifically, not a general fertilizer. If a fertilizer is used, say \"fertilized the crops with fertilizer\" or \"treated the crops with fertilizer\"."}],"priority":"★★☆"},"related_words":{"derivatives":["arsenic (noun): ヒ素","arsenical (adjective): ヒ素の、ヒ素を含む","arsenylation (noun): ヒ素化"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"arsenicize\" is a technical term referring to the process of treating something with arsenic. It is not commonly used in everyday language and is more likely to be encountered in scientific or historical contexts related to preservation, pest control, or toxicology. Understanding the word requires knowledge of the chemical element arsenic and the suffix \"-ize\", which indicates a process or action."},"example_sentences":[{"sentence":"They decided to arsenicize the museum artifacts to protect them from insects.","translation":"彼らは博物館の展示品を虫から守るためにヒ素処理することに決めた。","type":"verb","meaning_category":"ヒ素で処理する"},{"sentence":"The water was arsenicized as a method of poisoning.","translation":"その水は毒殺の手段としてヒ素が添加された。","type":"verb","meaning_category":"ヒ素を添加する"}]}