{"word":"dextrose","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ブドウ糖、グルコース","english_definition":"A simple sugar (monosaccharide) that is an important energy source in living organisms and is a component of many carbohydrates. It is also known as glucose.","examples":[{"sentence":"Dextrose is a type of sugar found in many plants.","translation":"ブドウ糖は多くの植物に含まれる糖の一種です。"},{"sentence":"Athletes often consume dextrose for a quick energy boost.","translation":"アスリートはしばしば、素早いエネルギー補給のためにブドウ糖を摂取します。"},{"sentence":"Dextrose is used in intravenous solutions to provide nutrition.","translation":"ブドウ糖は、栄養を供給するために静脈内輸液に使用されます。"}],"collocations":["dextrose solution (ブドウ糖溶液)","dextrose monohydrate (ブドウ糖一水和物)","intravenous dextrose (静脈内ブドウ糖)","dextrose injection (ブドウ糖注射)"],"synonyms":["glucose","corn sugar"],"antonyms":["fructose","sucrose","lactose"]}],"etymology":{"value":"From 'dextro-' (referring to the right-handed stereoisomer) + '-ose' (suffix for sugars). The name refers to the fact that dextrose rotates plane-polarized light to the right.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛkstroʊs/","syllables":"dex-trose"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dextrose is the name for glucose when it is derived from starch. It is a simple sugar, a monosaccharide, and is easily absorbed by the body. It is commonly used in food production, medicine, and sports nutrition. While 'dextrose' and 'glucose' are often used interchangeably, 'dextrose' specifically refers to glucose derived from starch.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dextrose is a complex carbohydrate.","correct":"✓ Dextrose is a simple sugar.","note":"Dextrose is a monosaccharide, which is a simple sugar, not a complex carbohydrate."},{"incorrect":"✗ Dextrose is only found in animals.","correct":"✓ Dextrose is found in many plants.","note":"Dextrose is a product of photosynthesis and is found in plants, as well as being important in animal metabolism."}],"priority":"★★☆"},"related_words":{"derivatives":["dextrorotatory (adjective: dextrorotatory)","dextrin (noun: デキストリン)","dextrose equivalent (noun: デキストロース当量)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dextrose' is a technical term primarily used in scientific, medical, and food-related contexts. It refers to glucose derived from starch and is a simple sugar easily metabolized by the body. While often used interchangeably with 'glucose', 'dextrose' specifies the source. Understanding its role in energy metabolism and its presence in various products requires a higher level of scientific literacy."},"example_sentences":[{"sentence":"The doctor prescribed a dextrose solution for the dehydrated patient.","translation":"医師は脱水症状の患者にブドウ糖溶液を処方しました。","type":"noun","meaning_category":"ブドウ糖 (医療)"},{"sentence":"Many processed foods contain dextrose as a sweetener.","translation":"多くの加工食品には、甘味料としてブドウ糖が含まれています。","type":"noun","meaning_category":"ブドウ糖 (食品)"},{"sentence":"Some athletes use dextrose supplements to replenish glycogen stores after exercise.","translation":"運動後、グリコーゲン貯蔵量を補充するためにブドウ糖サプリメントを使用するアスリートもいます。","type":"noun","meaning_category":"ブドウ糖 (スポーツ)"}]}