{"word":"Saviorship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"救世主の地位、救世主であること","english_definition":"The state or condition of being a savior; the position or role of a savior.","examples":[{"sentence":"He rejected the saviorship that was thrust upon him.","translation":"彼は押し付けられた救世主の地位を拒否した。"},{"sentence":"The organization sought saviorship in the community by providing essential services.","translation":"その組織は、不可欠なサービスを提供することで、地域社会における救世主の役割を求めた。"}],"collocations":["accept saviorship","reject saviorship","seek saviorship","claim saviorship","assume saviorship"],"synonyms":["deliverance","redemption","rescue","salvation"],"antonyms":["condemnation","destruction","ruin"]}],"etymology":{"value":"Formed from 'savior' (one who saves) + '-ship' (a suffix denoting state, condition, or office).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪvjərʃɪp/","syllables":"sa-vior-ship"},"inflection":{"noun_plural":"Saviorships (rarely used, usually in abstract or theoretical contexts)"},"usage_notes":{"explanation":"'Saviorship' refers to the abstract concept or the state of being a savior. It is less commonly used than 'savior' or 'salvation.' It often implies a formal or recognized role of a savior, or a claim to that role.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He performed saviorship to the people.","correct":"✓ He provided salvation to the people. / ✓ He acted as a savior to the people.","note":"'Saviorship' is a state or condition, not an action. Use 'salvation' or 'acted as a savior' to describe the act of saving."},{"incorrect":"✗ The saviorship of the country depended on him.","correct":"✓ The salvation of the country depended on him.","note":"'Salvation' is more commonly used to refer to the act of saving a country or people."}],"priority":"★★☆"},"related_words":{"derivatives":["savior","salvation","save"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'saviorship' is a relatively rare and abstract term. It refers to the state or condition of being a savior, which is someone who saves or rescues others from danger or harm. The word is typically used in formal or religious contexts and may not be familiar to all English speakers. Understanding the base word 'savior' is essential for comprehending 'saviorship'."},"example_sentences":[{"sentence":"The politician's rhetoric hinted at a desire for saviorship, promising to solve all the nation's problems.","translation":"その政治家のレトリックは、国のすべての問題を解決することを約束し、救世主になりたいという願望を示唆していた。","type":"noun","meaning_category":"救世主の地位"},{"sentence":"The community questioned the legitimacy of the organization's self-proclaimed saviorship.","translation":"地域社会は、その組織が自称する救世主の地位の正当性に疑問を呈した。","type":"noun","meaning_category":"救世主であること"}]}