{"word":"calced","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(obsolete) past tense of calk; to stop or fill seams or crevices to make watertight or airtight.","english_definition":"(archaic) simple past tense and past participle of calk. To make (a vessel) tight against leakage by driving oakum into the seams of planks; to fill (a seam or crevice) with oakum or other material to prevent leakage of air or water.","examples":[{"sentence":"The ship was calced to prevent leaks.","translation":"船は水漏れを防ぐために継ぎ目を埋められた。"}],"collocations":[],"synonyms":["calked"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'calk', which comes from Middle English 'calken', from Old French 'chauker' (to tread), from Latin 'calcare' (to tread), from 'calx' (limestone, chalk). The connection is through the use of chalk or similar material to fill seams.","priority":"★☆☆"},"pronunciation":{"ipa":"/kɔːkt/","syllables":"calced (1 syllable)"},"inflection":{"verb_forms":{}},"usage_notes":{"explanation":"'Calced' is an archaic form, primarily found in historical texts related to shipbuilding or construction. The modern and more common form is 'calked'.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":["calk","calking"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - archaic term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Calced' is an archaic term, meaning it is rarely used in modern English. It is the past tense and past participle of 'calk', which refers to the process of sealing seams, especially in wooden ships, to make them watertight. Due to its rarity, it would be encountered primarily in older texts or specialized contexts related to maritime history or traditional construction techniques."},"example_sentences":[{"sentence":"The hull of the old ship had been carefully calced to withstand the harsh seas.","translation":"その古い船の船体は、荒れた海に耐えられるように注意深く継ぎ目を埋められていた。","type":"verb","meaning_category":"sealing seams"}]}