{"candidates":[{"content":{"parts":[{"text":"{\n  \"word\": \"creari\",\n  \"priority\": \"Low\",\n  \"meanings\": [\n    {\n      \"part_of_speech\": \"verb\",\n      \"transitivity\": \"vt\",\n      \"definition\": \"(ラテン語) 創造する、作り出す、生み出す\",\n      \"english_definition\": \"(Latin) to create, make, produce, bring forth\",\n      \"examples\": [\n        {\n          \"sentence\": \"Deus mundum creavit.\",\n          \"translation\": \"神は世界を創造した。\",\n          \"note\": \"This is a classic example of the verb in use.\"\n        },\n        {\n          \"sentence\": \"Poeta carmina creavit.\",\n          \"translation\": \"詩人は歌を創造した。\",\n          \"note\": \"Illustrates artistic creation.\"\n        }\n      ],\n      \"collocations\": [\n        \"mundum creare (世界を創造する)\",\n        \"legem creare (法律を制定する)\",\n        \"exercitum creare (軍隊を創設する)\",\n        \"opiniones creare (意見を作り出す)\"\n      ],\n      \"synonyms\": [\n        \"facere (to make)\",\n        \"efficere (to bring about)\",\n        \"gignere (to beget, give birth to)\",\n        \"condere (to found, establish)\"\n      ],\n      \"antonyms\": [\n        \"destruere (to destroy)\",\n        \"dissolvere (to dissolve)\",\n        \"tollere (to abolish)\"\n      ]\n    }\n  ],\n  \"etymology\": {\n    \"value\": \"From Proto-Italic *kreāō, from Proto-Indo-European *ḱerh₂- ('to grow'). Cognates include English 'create', Greek 'κραίνω' (kraínō, 'to accomplish'), and Sanskrit 'कृणोति' (kṛṇoti, 'makes').\",\n    \"priority\": \"High\"\n  },\n  \"pronunciation\": {\n    \"classical_latin\": \"/ˈkre.a.riː/\",\n    \"ecclesiastical_latin\": \"/ˈkre.a.ri/\",\n    \"syllables\": \"cre-a-ri\"\n  },\n  \"inflection\": {\n    \"forms\": {\n      \"infinitive\": \"creare\",\n      \"present_indicative\": \"creo, creas, creat, creamus, creatis, creant\",\n      \"imperfect_indicative\": \"creabam, creabas, creabat, creabamus, creabatis, creabant\",\n      \"future_indicative\": \"creabo, creabis, creabit, creabimus, creabitis, creabunt\",\n      \"perfect_indicative\": \"creavi, creavisti, creavit, creavimus, creavistis, creaverunt\",\n      \"pluperfect_indicative\": \"creaveram, creaveras, creaverat, creaveramus, creaveratis, creaverant\",\n      \"future_perfect_indicative\": \"creavero, creaveris, creaverit, creaverimus, creaveritis, creaverint\",\n      \"present_subjunctive\": \"creem, crees, creet, creemus, creetis, creent\",\n      \"imperfect_subjunctive\": \"crearem, creares, crearet, crearemus, crearetis, crearent\",\n      \"perfect_subjunctive\": \"creaverim, creaveris, creaverit, creaverimus, creaveritis, creaverint\",\n      \"pluperfect_subjunctive\": \"creavissem, creavisses, creavisset, creavissemus, creavissetis, creavissent\",\n      \"imperative\": \"crea, create\",\n      \"present_participle\": \"creans\",\n      \"future_participle\": \"creaturus\",\n      \"gerund\": \"creandum\",\n      \"supine\": \"creatum\"\n    }\n  },\n  \"usage_notes\": {\n    \"explanation\": \"\\\"Creare\\\" is a fundamental Latin verb with a broad range of applications, from divine creation to artistic and legal creation. It signifies bringing something into existence that did not exist before. The verb is highly versatile and appears in numerous contexts throughout Latin literature.\",\n    \"priority\": \"Medium\"\n  },\n  \"common_mistakes\": {\n    \"examples\": [\n      {\n        \"incorrect\": \"creare est facilis\",\n        \"correct\": \"creare facile est\",\n        \"note\": \"Adjectives must agree in gender, number, and case. 'Facile' is the neuter form agreeing with the infinitive 'creare' used as a noun.\"\n      }\n    ],\n    \"priority\": \"Low\"\n  },\n  \"related_words\": {\n    \"derivatives\": [\n      \"creatio (creation)\",\n      \"creator (creator)\",\n      \"creatura (creature)\",\n      \"procreare (to procreate)\"\n    ]\n  },\n  \"level_frequency\": {\n    \"level\": \"Intermediate\",\n    \"frequency_comment\": \"Common in classical and ecclesiastical Latin texts.\"\n  },\n  \"readability_explanation\": {\n    \"level\": \"Intermediate\",\n    \"text\": \"\\\"Creare\\\" is a core Latin verb meaning 'to create'. It is used in various contexts, including religious, philosophical, and artistic domains. Understanding its conjugation and usage is crucial for reading Latin texts.\"\n  },\n  \"example_sentences\": [\n    {\n      \"sentence\": \"Mens agitat molem et magno se corpore miscet. Inde hominum pecudumque genus, uitaeque uolantum et quae marmoreo fert monstra sub aequore pontus. Igneus est ollis uigor et caelestis origo seminibus, quantum non noxia corpora tardant terrenique hebetant artus moribundaque membra. Hinc metuunt cupiunt dolent gaudent, nec auras dispiciunt clausae tenebris et carcere caeco. Quin etiam, cum supremus uita dies reliquit, non omnis moritur, uitamque relinquere cessat, sed uolat ad superos, propriamque reuisit in stellas sedem. Nec tempore ullo creditur esse noua, sed renouata modo est. Nec, priusquam incipiat animari corpora cuique, ulla fuit. Sed cum adoleuit iamque uigescit, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima. Quae cum corpore iuncta est, tum demum incipit esse anima."}],"role":"model"},"finishReason":"MAX_TOKENS","citationMetadata":{"citationSources":[{"startIndex":4015,"endIndex":4299,"uri":"https://www.docsity.com/it/eneide-libro-vi-testo-latino-traduzione/9878783/"}]},"avgLogprobs":-0.030941114538844558}],"usageMetadata":{"promptTokenCount":8404,"candidatesTokenCount":8173,"totalTokenCount":16577,"promptTokensDetails":[{"modality":"TEXT","tokenCount":8404}],"candidatesTokensDetails":[{"modality":"TEXT","tokenCount":8173}]},"modelVersion":"gemini-2.0-flash","responseId":"xJU_aLnVO5bK7dcPgtWmkQY"}