{"word":"unlopped","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of trees, branches, etc.) not having been pruned or trimmed.","english_definition":"Not having had branches or shoots cut off; not pruned.","examples":[{"sentence":"The unlopped branches of the tree reached across the garden.","translation":"その木の剪定されていない枝は庭を横切って伸びていた。"},{"sentence":"An unlopped hedge can quickly become overgrown.","translation":"剪定されていない生垣はすぐに生い茂ってしまう可能性がある。"}],"collocations":["unlopped branches","unlopped tree","unlopped hedge"],"synonyms":["untrimmed","unpruned","untended","overgrown"],"antonyms":["lopped","trimmed","pruned","tended"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning 'not') to the past participle \"lopped\".","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈlɒpt/","syllables":"un-lopped"},"inflection":{"notes":"This is an adjective, so it does not have plural forms. Comparative and superlative forms are formed using 'more' and 'most' respectively (e.g., more unlopped, most unlopped)."},"usage_notes":{"explanation":"'Unlopped' is a relatively uncommon word, typically used in contexts related to gardening, forestry, or landscaping to describe plants that have not been subjected to pruning or trimming. It often implies a state of being overgrown or untidy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlopped tree was very lopped.","correct":"✓ The unlopped tree was very overgrown.","note":"'Unlopped' and 'lopped' are antonyms; something cannot be both at the same time. If a tree is 'very lopped,' it means it has been heavily pruned."}],"priority":"★☆☆"},"related_words":{"derivatives":["lop (verb): to cut off branches or twigs from a tree or bush.","lopper (noun): a tool used for lopping branches."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (too rare to be included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unlopped' is a niche word, primarily used in horticultural or forestry contexts. Understanding requires familiarity with the base word 'lop' (to prune or trim), and the function of the prefix 'un-' (to negate). It is unlikely to be encountered by non-native speakers outside of specialized reading materials.","priority":"★★☆"},"example_sentences":[{"sentence":"The unlopped rose bushes were wild and sprawling.","translation":"剪定されていないバラの茂みは、野生で広がり放題だった。","type":"adjective","meaning_category":"not pruned"},{"sentence":"He preferred the natural look of the unlopped willow tree.","translation":"彼は剪定されていない柳の木の自然な外観を好んだ。","type":"adjective","meaning_category":"not trimmed"}]}