{"word":"semiparasite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"半寄生植物","english_definition":"A plant that obtains some of its nutrients from another living plant (the host) but also photosynthesizes.","examples":[{"sentence":"Mistletoe is a well-known example of a semiparasite.","translation":"ヤドリギは半寄生植物のよく知られた例です。"},{"sentence":"Semiparasites can harm their host plants by extracting water and nutrients.","translation":"半寄生植物は、水や栄養分を奪うことによって宿主植物に害を及ぼすことがあります。"}],"collocations":["obligate semiparasite","facultative semiparasite","host plant","photosynthesis"],"synonyms":["hemiparasite"],"antonyms":["holoparasite","autotroph"]},{"part_of_speech":"adjective","definition":"半寄生の","english_definition":"Of or relating to a semiparasite; partially parasitic.","examples":[{"sentence":"Semiparasitic plants have green leaves and can perform photosynthesis.","translation":"半寄生植物は緑色の葉を持ち、光合成を行うことができます。"},{"sentence":"The semiparasitic nature of mistletoe allows it to survive on other trees.","translation":"ヤドリギの半寄生的な性質により、他の木の上で生き残ることができます。"}],"collocations":["semiparasitic plant","semiparasitic relationship","semiparasitic behavior"],"synonyms":["hemiparasitic"],"antonyms":["holoparasitic","autotrophic"]}],"etymology":{"value":"Derived from 'semi-' (meaning 'half' or 'partially') and 'parasite', indicating that the organism is only partially parasitic, as it can also produce its own food through photosynthesis.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˈpærəsaɪt/","syllables":"se-mi-par-a-site"},"inflection":{"noun_plural":"semiparasites","adjective_forms":{}},"usage_notes":{"explanation":"A semiparasite is a plant that is parasitic under natural conditions but also is photosynthetic to some extent. This contrasts with holoparasites, which are fully parasitic and do not perform photosynthesis. Semiparasites typically obtain water and mineral nutrients from their host plant but can produce their own carbohydrates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Semiparasites are completely dependent on their host.","correct":"✓ Semiparasites are partially dependent on their host.","note":"Semiparasites are not completely dependent on their host because they can also photosynthesize."},{"incorrect":"✗ Semiparasites don't photosynthesize.","correct":"✓ Semiparasites do photosynthesize.","note":"Semiparasites are characterized by their ability to photosynthesize, unlike holoparasites."}],"priority":"★★☆"},"related_words":{"derivatives":["semiparasitic (adjective)"],"phrases":["photosynthesis","parasitism","host plant"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'semiparasite' is a technical term used in botany and ecology. It refers to plants that are partially parasitic, meaning they derive some nutrients from a host plant but also perform photosynthesis to produce their own food. Understanding this term requires knowledge of basic biological concepts like parasitism and photosynthesis. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The **semiparasite** plant was attached to the branch of the oak tree.","translation":"その半寄生植物は、オークの木の枝に取り付いていた。","type":"noun","meaning_category":"半寄生植物"},{"sentence":"**Semiparasitic** plants can be identified by their green leaves and attachment to a host.","translation":"半寄生植物は、緑色の葉を持ち、宿主に付着していることで識別できます。","type":"adjective","meaning_category":"半寄生の"}]}