{"word":"Thucydidean","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"トゥキディデス的な、トゥキディデスの歴史観に特有の","english_definition":"Relating to or characteristic of the historian Thucydides or his style of history writing, especially emphasizing realism, attention to detail, and analysis of power politics.","examples":[{"sentence":"The professor gave a Thucydidean analysis of the Peloponnesian War.","translation":"教授はペロポネソス戦争についてトゥキディデス的な分析を行った。"},{"sentence":"His foreign policy approach was described as Thucydidean, focusing on strategic advantage and national interest.","translation":"彼の外交政策のアプローチは、戦略的優位と国益に焦点を当てた、トゥキディデス的であると評された。"},{"sentence":"The author's Thucydidean realism made the novel a compelling portrayal of political conflict.","translation":"作者のトゥキディデス的なリアリズムは、その小説を政治的対立の説得力のある描写にした。"}],"collocations":["Thucydidean realism (トゥキディデス的リアリズム)","Thucydidean analysis (トゥキディデス的分析)","Thucydidean approach (トゥキディデス的アプローチ)","Thucydidean history (トゥキディデス的歴史)"],"synonyms":["realistic","analytical","historical","political","strategic"],"antonyms":["idealistic","romantic","superficial"]},{"part_of_speech":"noun","definition":"トゥキディデスの信奉者、トゥキディデスの歴史観を支持する人","english_definition":"A follower of or believer in the historical and political perspectives of Thucydides.","examples":[{"sentence":"He is a Thucydidean who believes that power dynamics are the primary driver of international relations.","translation":"彼は、権力力学が国際関係の主な原動力であると信じるトゥキディデス主義者だ。"},{"sentence":"The Thucydideans in the department often clashed with those who favored more theoretical approaches.","translation":"学科のトゥキディデス主義者たちは、より理論的なアプローチを好む人々としばしば衝突した。"}],"collocations":["a modern Thucydidean (現代のトゥキディデス主義者)"],"synonyms":["realist","analyst","historian","political scientist"],"antonyms":["idealist","romantic"]}],"etymology":{"value":"Derived from the name of Thucydides (c. 460–c. 400 BC), the ancient Greek historian and author of the History of the Peloponnesian War. The suffix '-ean' is used to form adjectives and nouns relating to a person or place.","priority":"★★★"},"pronunciation":{"ipa":"/ˌθjuːsɪˈdaɪdiən/","syllables":"Thu-cy-di-de-an"},"inflection":{"notes":"Adjective and noun forms exist. The noun is typically used to refer to a person who studies or admires Thucydides' work."},"usage_notes":{"explanation":"'Thucydidean' is used to describe something that is characteristic of Thucydides' approach to history, which emphasizes a realistic and detailed analysis of political and military events, focusing on the role of power and human nature. It often implies a detached, objective, and somewhat pessimistic view of human affairs. The term is often used in political science, international relations, and historical studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie had a very Thucydides feel to it.","correct":"✓ The movie had a very Thucydidean feel to it.","note":"The correct adjective form is 'Thucydidean'."},{"incorrect":"✗ He was a Thucydides.","correct":"✓ He was a Thucydidean.","note":"The correct noun form is 'Thucydidean'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Thucydides (proper noun: トゥキディデス)","Thucydideanism (noun: トゥキディデス主義)"],"phrases":["Thucydides Trap (トゥキディデスの罠)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and scholarly contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thucydidean' is a specialized term primarily used in academic and intellectual discussions, particularly in the fields of history, political science, and international relations. It describes something related to the historical and analytical methods of the ancient Greek historian Thucydides, known for his realistic and detailed account of the Peloponnesian War. Understanding this term requires familiarity with Thucydides' work and his emphasis on power politics, human nature, and strategic analysis. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The diplomat's speech reflected a Thucydidean understanding of international power dynamics.","translation":"外交官の演説は、国際的な権力力学に対するトゥキディデス的な理解を反映していた。","type":"adjective","meaning_category":"relating to Thucydides"},{"sentence":"As a Thucydidean, she believed that states are primarily motivated by self-interest.","translation":"トゥキディデス主義者として、彼女は国家は主に自己利益によって動機づけられると信じていた。","type":"noun","meaning_category":"follower of Thucydides"}]}