{"word":"Yeomaness","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(歴史的) ヨーマンの妻、または女性のヨーマン","english_definition":"(historical) A female yeoman; the wife of a yeoman.","examples":[{"sentence":"The yeomaness managed the farm while her husband was away.","translation":"ヨーマンの妻は、夫が不在の間、農場を管理していた。"},{"sentence":"She was a proud yeomaness, skilled in the ways of the countryside.","translation":"彼女は田舎の暮らしに精通した、誇り高き女性ヨーマンだった。"}],"collocations":["a hardworking yeomaness","a skilled yeomaness","proud yeomaness"],"synonyms":["yeoman's wife"],"antonyms":[]}],"etymology":{"value":"The word is formed by adding the feminine suffix '-ess' to 'yeoman'.","priority":"Medium"},"pronunciation":{"ipa":"/ˈjoʊmənəs/","syllables":"yo-man-ess"},"inflection":{"noun_plural":"yeomanesses"},"usage_notes":{"explanation":"The term 'yeomaness' is primarily historical and refers to a female yeoman or the wife of a yeoman. A yeoman was a free man owning his own farm, especially in the Middle Ages and early modern period in England. The term is rarely used in modern English.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"She was a yeomaness in the army.","correct":"She was a female yeoman in the army.","note":"While 'yeoman' can refer to a rank in the navy, 'yeomaness' is specifically related to the historical agricultural context."}],"priority":"Low"},"related_words":{"derivatives":["yeoman","yeomanry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'yeomaness' is a rare, historical term. Understanding requires knowledge of the social structure of medieval and early modern England, specifically the role of a 'yeoman' (a free man owning his own farm). The suffix '-ess' indicates the feminine form. Due to its limited usage, it is unlikely to be encountered outside of historical contexts or specialized literature."},"example_sentences":[{"sentence":"The historical records mention several yeomanesses who were skilled farmers.","translation":"歴史的な記録には、熟練した農家であった数人の女性ヨーマンが記録されている。","type":"noun","meaning_category":"historical"},{"sentence":"As a yeomaness, she was respected in her community for her hard work and dedication.","translation":"女性ヨーマンとして、彼女は勤勉さと献身さで地域社会で尊敬されていた。","type":"noun","meaning_category":"historical"}]}