{"word":"upo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング) フィリピン大学 (University of the Philippines) の学生または卒業生","english_definition":"(slang) A student or alumnus of the University of the Philippines.","examples":[{"sentence":"He's an UPO, so he's probably really smart.","translation":"彼はUPOだから、たぶんすごく頭がいいだろう。"},{"sentence":"Many UPOs go on to become leaders in their fields.","translation":"多くのUPOがそれぞれの分野でリーダーになる。"}],"collocations":["proud UPO","UPO pride","UPO student","UPO graduate"],"synonyms":["Isko (male)","Iska (female)"],"antonyms":[]}],"etymology":{"value":"'UPO' is derived from the acronym 'UP' for the University of the Philippines, with the addition of 'O' to create a slang term.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈuːpoʊ/","syllables":"U-po"},"inflection":{"noun_plural":"UPOs"},"usage_notes":{"explanation":"'UPO' is a slang term primarily used within the Philippines to refer to students and alumni of the University of the Philippines system. It is often used with a sense of pride and camaraderie. The terms 'Isko' (male) and 'Iska' (female) are also used, derived from 'iskolar', meaning 'scholar'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to UPO next year.","correct":"✓ I am going to UP next year.","note":"Use 'UP' when referring to the University of the Philippines itself, not 'UPO'."},{"incorrect":"✗ She is a very intelligent UPO student.","correct":"✓ She is a very intelligent UP student. / ✓ She is a very intelligent UPO.","note":"'UPO' already implies being a student or alumnus, so it's redundant to say 'UPO student'."}],"priority":"★☆☆"},"related_words":{"derivatives":["UP (University of the Philippines)","Isko","Iska"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the Philippines.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'UPO' is a slang term specific to the Philippines, referring to students or alumni of the University of the Philippines (UP). It's not commonly used or understood outside of the Philippines. The term carries a sense of pride and identity within the UP community. It's important to use 'UP' when referring to the university itself, and 'UPO' when referring to a person associated with the university."},"example_sentences":[{"sentence":"As a proud UPO, he always supports the university's initiatives.","translation":"誇り高きUPOとして、彼は常に大学の取り組みを支援している。","type":"noun","meaning_category":"student/alumnus"},{"sentence":"Many successful professionals in the Philippines are UPOs.","translation":"フィリピンの多くの成功した専門家はUPOである。","type":"noun","meaning_category":"student/alumnus"}]}