{"word":"zoogony","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"動物発生論、動物の起源に関する理論","english_definition":"The study or theory of the origin of animals.","examples":[{"sentence":"Zoogony is a branch of biology that explores the evolutionary history of animals.","translation":"動物発生論は、動物の進化の歴史を探求する生物学の一分野です。"},{"sentence":"Early theories of zoogony often intertwined with mythology and religious beliefs.","translation":"初期の動物発生論の理論は、しばしば神話や宗教的信念と絡み合っていました。"}],"collocations":["theory of zoogony","study of zoogony","evolutionary zoogony"],"synonyms":["animal origin theory","animal evolution study"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words \"zoion\" (ζῷον) meaning \"animal\" and \"gonos\" (γόνος) meaning \"birth\" or \"origin\".","priority":"★★☆"},"pronunciation":{"ipa":"/zoʊˈɒɡəni/","syllables":"zo-og-o-ny"},"inflection":{"noun_plural":"zoogonies"},"usage_notes":{"explanation":"Zoogony is a relatively uncommon term primarily used in the context of evolutionary biology and the history of science. It refers specifically to the study and theories surrounding the origins and evolutionary development of animals. It is often encountered in discussions of early scientific thought and the development of evolutionary theory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Zoogony is the study of animal behavior.","correct":"✓ Zoogony is the study of the origin of animals.","note":"Zoogony specifically concerns the origin and evolution of animals, not their behavior. Animal behavior is studied in ethology."},{"incorrect":"✗ Zoogony is the same as zoology.","correct":"✓ Zoogony is a branch related to the origin of animals, while zoology is the broader study of animals.","note":"Zoology is the general study of animals, while zoogony is a specific area focused on their origin and evolution."}],"priority":"★☆☆"},"related_words":{"derivatives":["zoogenic (adjective: produced by animals)","zoogenous (adjective: originating from animals)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Zoogony is a specialized term primarily used in evolutionary biology and the history of science. Understanding the term requires familiarity with basic Greek root words and a general understanding of evolutionary concepts. It is not commonly used in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor lectured on the various theories of zoogony proposed throughout history.","translation":"教授は、歴史を通じて提唱されたさまざまな動物発生論の理論について講義しました。","type":"general"},{"sentence":"Modern zoogony relies heavily on genetic and paleontological evidence.","translation":"現代の動物発生論は、遺伝学的および古生物学的証拠に大きく依存しています。","type":"scientific"}]}