{"word":"unipara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"初産婦、単産婦","english_definition":"A woman who has given birth to only one child or is pregnant for the first time.","examples":[{"sentence":"The doctor explained the risks to the unipara during her first pregnancy.","translation":"医師は初産婦である彼女に最初の妊娠中のリスクを説明した。"},{"sentence":"Many hospitals offer special classes for uniparas to prepare them for childbirth.","translation":"多くの病院が、初産婦が出産に備えるための特別なクラスを提供している。"}],"collocations":["first-time mother","primipara","single birth"],"synonyms":["primipara"],"antonyms":["multipara"],"notes":"Often used in medical contexts.","field_of_study":["Obstetrics","Gynecology"]}],"etymology":{"value":"From Latin 'uni-' (one) + 'parere' (to give birth).","priority":"★★★"},"pronunciation":{"ipa":"/juːˈnɪpərə/","syllables":"u-ni-pa-ra"},"inflection":{"noun_plural":"uniparas"},"usage_notes":{"explanation":"'Unipara' refers specifically to a woman who is either pregnant for the first time or has only given birth once. It is a term commonly used in medical settings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a unipara, so she has many children.","correct":"✓ She is a unipara, so she has only one child or is pregnant for the first time.","note":"Unipara means having only one child or being pregnant for the first time, not having many children."}],"priority":"★★☆"},"related_words":{"derivatives":["uniparous (adjective)"],"related_terms":["primigravida","multipara","nullipara"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unipara' is a medical term referring to a woman who is pregnant for the first time or has given birth only once. It is not commonly used in everyday conversation but is important in obstetrics and gynecology. Understanding this term is crucial in medical settings to accurately describe a patient's obstetric history."},"example_sentences":[{"sentence":"The unipara was closely monitored throughout her labor.","translation":"その初産婦は陣痛の間、厳重に経過観察された。","type":"medical","meaning_category":"Obstetrics"},{"sentence":"The risks associated with first pregnancies are often discussed with uniparas.","translation":"初産婦には、最初の妊娠に伴うリスクがよく話し合われる。","type":"medical","meaning_category":"Gynecology"}]}