{"word":"Tammany","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"タマニー・ホール：19世紀から20世紀初頭にかけてニューヨーク市で大きな影響力を持った民主党の政治組織。汚職や縁故主義で悪名高い。","english_definition":"Tammany Hall: A Democratic political organization in New York City that wielded considerable political influence from the 19th century into the early 20th century. It was known for its corruption and patronage.","examples":[{"sentence":"Tammany Hall controlled New York City politics for decades.","translation":"タマニー・ホールは何十年にもわたってニューヨーク市の政治を支配した。"},{"sentence":"The power of Tammany Hall eventually declined due to reforms and scandals.","translation":"タマニー・ホールの力は、最終的には改革とスキャンダルによって衰退した。"}],"collocations":["Tammany Hall machine (タマニー・ホールの政治機構)","Tammany boss (タマニー・ホールのボス)","Tammany politics (タマニーの政治)"],"synonyms":["political machine","political organization"],"antonyms":[]}],"etymology":{"value":"アメリカ独立戦争時の軍人、政治家であったウィリアム・タム（William Tamm、またはタマニー Tammany）に由来する。彼はネイティブ・アメリカンのデラウェア族の酋長タマニーを理想化して名付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtæməni/","syllables":"Tam-ma-ny"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Tammany**」は、特にアメリカ史、政治学、社会学の文脈で使われる語です。単に「タマニー」という場合、通常はタマニー・ホールを指します。タマニー・ホールは、アイルランド系移民の支持を基盤とし、ニューヨーク市の政治を牛耳り、その影響力は州や国の政治にも及ぶことがありました。しかし、その政治手法はしばしば批判の対象となり、汚職の代名詞として使われることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a member of Tammany's club.","correct":"✓ He was a member of Tammany Hall.","note":"「タマニー」という組織全体を指す場合は、「Tammany Hall」と表記するのが一般的です。"},{"incorrect":"✗ Tammany is a very good political organization.","correct":"✓ Tammany was a powerful, but often corrupt, political organization.","note":"タマニー・ホールは権力を持っていたものの、その政治手法は汚職や縁故主義で批判されることが多かったため、単純に「良い政治組織」とは言えません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (歴史、政治学の専門用語)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の歴史的文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Tammany**」は、アメリカの歴史、特にニューヨーク市の政治史を理解する上で重要な単語です。これは、19世紀から20世紀初頭にかけてニューヨーク市で大きな影響力を持った「タマニー・ホール」という政治組織を指します。タマニー・ホールは民主党の政治機構であり、アイルランド系移民の支持を基盤に、政治的な支配を確立しました。しかし、その政治手法は汚職や縁故主義で批判されることも多く、政治腐敗の象徴としても知られています。この単語は、アメリカの政治史や社会問題を議論する際に登場することがあります。"},"example_sentences":[{"sentence":"The Tweed Ring was a notorious group of corrupt officials associated with **Tammany Hall**.","translation":"ツイード環は、タマニー・ホールに関連する悪名高い汚職官僚グループだった。","type":"noun","meaning_category":"政治組織"},{"sentence":"Many immigrants relied on **Tammany** for jobs and assistance.","translation":"多くの移民は仕事や援助をタマニーに頼っていた。","type":"noun","meaning_category":"政治組織"},{"sentence":"The reformers sought to dismantle the power of **Tammany Hall**.","translation":"改革者たちはタマニー・ホールの力を解体しようとした。","type":"noun","meaning_category":"政治組織"}]}