{"word":"launderer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"洗濯業者、洗濯屋、クリーニング業者","english_definition":"A person or business that washes and irons clothes and other textiles, especially as a commercial service.","examples":[{"sentence":"The launderer returned the shirts neatly pressed.","translation":"洗濯業者はシャツをきちんとアイロンをかけて返却した。"},{"sentence":"She took her delicate garments to a professional launderer.","translation":"彼女はデリケートな衣類をプロの洗濯業者に持っていった。"},{"sentence":"In the past, launderers often worked in small, family-run businesses.","translation":"昔は、洗濯業者は小規模な家族経営の店で働くことが多かった。"}],"collocations":["professional launderer","commercial launderer","local launderer","family launderer"],"synonyms":["cleaner","dry cleaner","washerwoman","washerman","laundress"],"antonyms":[],"related_words":["laundry","laundromat","laundering"]}],"etymology":{"value":"From Middle English 'lavender,' 'lavander,' from Old French 'lavandier,' from Late Latin 'lavandarius,' from Latin 'lavanda' (things to be washed), from 'lavare' (to wash). The '-er' suffix denotes a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɔːndərər/","syllables":"laun-der-er"},"inflection":{"noun_plural":"launderers"},"usage_notes":{"explanation":"The term 'launderer' specifically refers to someone who washes and irons clothes, often as a profession. It can also refer to a business providing such services. While 'cleaner' and 'dry cleaner' are often used interchangeably, 'launderer' typically implies washing with water rather than dry cleaning solvents. The term is less common in modern usage, with 'cleaner' or 'laundry service' being more prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She is a launder.","correct":"She is a launderer.","note":"'Launder' is a verb (to wash), while 'launderer' is the noun (a person who launders)."},{"incorrect":"I took my clothes to the laundryer.","correct":"I took my clothes to the launderer.","note":"The correct term for the person or business is 'launderer,' not 'laundryer.'"}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency - The term is becoming less common in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Launderer' is a noun that refers to a person or business that washes and irons clothes as a service. It is a less common term than 'cleaner' or 'laundry service' in modern English. The word is derived from the verb 'to launder,' which means to wash clothes. Understanding this word helps in recognizing older texts or specific contexts where the traditional role of washing clothes is emphasized.","priority":"★★☆"},"example_sentences":[{"sentence":"The old-fashioned launderer used a washboard and tub.","translation":"昔ながらの洗濯業者は洗濯板と桶を使っていた。","type":"noun","meaning_category":"洗濯業者"},{"sentence":"The hotel employed a skilled launderer to care for the linens.","translation":"そのホテルはリネンの手入れをする熟練した洗濯業者を雇っていた。","type":"noun","meaning_category":"洗濯業者"},{"sentence":"Before washing machines, the launderer played a vital role in society.","translation":"洗濯機が登場する前は、洗濯業者は社会において重要な役割を果たしていた。","type":"noun","meaning_category":"洗濯業者"}]}