{"word":"equivalente","priority":"★★☆","meanings":[{"part_of_speech":"adjetivo","definition":"Que tiene el mismo valor, cantidad, significado o efecto que otra cosa.","english_definition":"Having the same value, quantity, meaning, or effect as something else.","examples":[{"sentence":"Un euro es equivalente a aproximadamente 1.10 dólares.","translation":"One euro is equivalent to approximately 1.10 dollars.","example_translation":"1ユーロは約1.10ドルに相当します。"},{"sentence":"Las dos palabras son equivalentes en este contexto.","translation":"The two words are equivalent in this context.","example_translation":"この文脈では、その2つの単語は同義です。"},{"sentence":"Recibió una compensación equivalente a un año de salario.","translation":"He received compensation equivalent to one year's salary.","example_translation":"彼は1年分の給与に相当する補償を受けました。"}],"collocations":["ser equivalente a","equivalente de","en equivalente a"],"synonyms":["igual","análogo","semejante","parecido","idéntico","homólogo"],"antonyms":["diferente","desigual","divergente"]},{"part_of_speech":"sustantivo","definition":"Cosa que tiene el mismo valor, cantidad, significado o efecto que otra.","english_definition":"Something that has the same value, quantity, meaning, or effect as something else.","examples":[{"sentence":"No hay un equivalente exacto para esta palabra en inglés.","translation":"There is no exact equivalent for this word in English.","example_translation":"この単語に完全に相当する英語の単語はありません。"},{"sentence":"Este producto es un equivalente más barato del original.","translation":"This product is a cheaper equivalent of the original.","example_translation":"この製品は、オリジナル製品の安価な代替品です。"}],"collocations":["el equivalente de","un equivalente más barato"],"synonyms":["sustituto","alternativa","reemplazo"],"antonyms":["original"]}],"etymology":{"value":"Del latín 'aequivalens, -entis', participio presente de 'aequivalere' (tener el mismo valor), compuesto de 'aequus' (igual) y 'valere' (valer).","priority":"★★☆"},"pronunciation":{"ipa":"/ekiβaˈlente/","syllables":"e-qui-va-len-te"},"inflection":{"gender":"masculine","number":"singular/plural"},"usage_notes":{"explanation":"'Equivalente' se usa para indicar que dos o más cosas tienen el mismo valor, función o significado. Puede referirse a cantidades, conceptos, palabras, etc. En matemáticas y ciencias, se utiliza para expresar igualdad de valor o función. En el lenguaje cotidiano, se usa para indicar similitud o correspondencia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"La respuesta es equivalente a la pregunta.","correct":"La respuesta es equivalente a la pregunta. (Correcto, pero podría ser más preciso) / La respuesta corresponde a la pregunta.","note":"'Equivalente' implica igualdad de valor o efecto. 'Corresponde' indica una relación o correspondencia. Dependiendo del contexto, 'corresponde' puede ser más adecuado."},{"incorrect":"El equivalente de este libro es muy caro.","correct":"El equivalente de este libro es muy caro. (Correcto, pero podría ser más específico) / Un libro equivalente a este es muy caro.","note":"Es mejor especificar qué tipo de equivalente se está hablando (por ejemplo, 'un libro equivalente', 'una versión digital equivalente')."}],"priority":"★★☆"},"related_words":{"derivatives":["equivalencia","equivaler"],"related_terms":["análogo","homólogo","isomorfo"]},"level_frequency":{"level":"B2","frequency_google_ngram":"Moderadamente frecuente"},"readability_explanation":{"level":"B2","text":"La palabra 'equivalente' se usa para describir algo que tiene el mismo valor, significado o efecto que otra cosa. Es una palabra relativamente común en contextos académicos, técnicos y cotidianos. Su uso implica un nivel de comprensión del lenguaje que corresponde al nivel B2."},"example_sentences":[{"sentence":"La energía cinética es equivalente a la mitad de la masa por la velocidad al cuadrado.","translation":"Kinetic energy is equivalent to one-half of the mass times the square of the velocity.","example_translation":"運動エネルギーは、質量の半分に速度の2乗を掛けたものに相当します。","type":"adjective","meaning_category":"valor/cantidad"},{"sentence":"En muchos casos, el amor y el cariño son equivalentes.","translation":"In many cases, love and affection are equivalent.","example_translation":"多くの場合、愛と愛情は同義です。","type":"adjective","meaning_category":"significado"},{"sentence":"Un tratamiento con medicamentos puede ser equivalente a la cirugía en algunos casos.","translation":"Medical treatment may be equivalent to surgery in some cases.","example_translation":"薬物療法は、場合によっては手術と同等の効果があることがあります。","type":"adjective","meaning_category":"efecto"},{"sentence":"Este programa ofrece un equivalente a un título universitario.","translation":"This program offers an equivalent to a university degree.","example_translation":"このプログラムは、大学の学位に相当するものを提供します。","type":"noun","meaning_category":"cosa con el mismo valor"}]}