{"word":"chastity-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"純潔に関連する、貞操に関連する","english_definition":"Relating to or concerning chastity; pertaining to the state or practice of refraining from sexual activity, especially outside of marriage, or of remaining celibate.","examples":[{"sentence":"The discussion focused on chastity-related issues in modern society.","translation":"議論は現代社会における純潔に関連する問題に焦点を当てた。"},{"sentence":"She advocates for chastity-related education in schools.","translation":"彼女は学校での貞操に関連する教育を提唱している。"}],"collocations":["chastity-related education","chastity-related discussions","chastity-related topics","chastity-related vows"],"synonyms":["abstinence-related","celibacy-related","purity-related","virtue-related"],"antonyms":["sexuality-related","promiscuity-related"]}],"etymology":{"value":"The term is a compound adjective formed by combining the noun 'chastity' with the suffix '-related'. 'Chastity' comes from the Latin 'castitas', meaning purity or moral cleanness. The suffix '-related' indicates that something is connected or associated with the preceding noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃæstɪti rɪˌleɪtɪd/","syllables":"chas-ti-ty ri-la-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The adjective 'chastity-related' is used to describe something that is associated with or pertains to the concept of chastity. It is often used in discussions about sexual morality, education, and societal values. The term can be used in both positive and negative contexts, depending on the speaker's viewpoint on chastity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chastity-related is important.","correct":"✓ Chastity-related issues are important.","note":"'Chastity-related' is an adjective and needs to modify a noun. It cannot stand alone as a subject or object."},{"incorrect":"✗ chastityrelated","correct":"✓ chastity-related","note":"The correct spelling includes a hyphen between 'chastity' and 'related'."}],"priority":"★★☆"},"related_words":{"derivatives":["chastity (noun)","related (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'chastity-related' is a relatively advanced term used in discussions about morality, sexuality, and social issues. It is not commonly used in everyday conversation but is more likely to appear in academic or formal contexts."},"example_sentences":[{"sentence":"The organization promotes chastity-related programs for teenagers.","translation":"その組織は10代の若者向けの貞操に関連するプログラムを推進している。","type":"general","meaning_category":"general"},{"sentence":"There is ongoing debate about the role of chastity-related teachings in sex education.","translation":"性教育における貞操に関連する教えの役割については、現在も議論が続いている。","type":"general","meaning_category":"general"}]}