{"word":"matter-dominated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(宇宙論で)物質がエネルギー密度において優勢な状態","english_definition":"(cosmology) describing an era or universe in which the energy density is dominated by non-relativistic matter (baryonic or dark matter) rather than radiation or dark energy.","examples":[{"sentence":"The universe transitioned to a matter-dominated era after the radiation-dominated era.","translation":"宇宙は放射優勢時代から物質優勢時代へと移行した。"},{"sentence":"Structure formation in the universe occurred primarily during the matter-dominated epoch.","translation":"宇宙における構造形成は、主に物質優勢時代に起こった。"}],"collocations":["matter-dominated era","matter-dominated universe","transition to matter-domination"],"synonyms":["non-relativistic matter dominant","cold dark matter dominant"],"antonyms":["radiation-dominated","dark energy-dominated"]},{"part_of_speech":"adjective","definition":"(一般的に)物質によって支配されている、影響を受けている","english_definition":"generally, dominated or influenced by matter or material considerations.","examples":[{"sentence":"His decisions were often matter-dominated, focusing on practical benefits rather than ethical concerns.","translation":"彼の決定はしばしば物質に支配されており、倫理的な懸念よりも実用的な利益に焦点を当てていた。"}],"collocations":["matter-dominated decision-making","matter-dominated thinking"],"synonyms":["materialistic","pragmatic"],"antonyms":["idealistic","spiritual"]}],"etymology":{"value":"Composed of 'matter' (物質) and 'dominated' (支配された), indicating a state where matter is the dominant component.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmætərˌdɑːmɪneɪtɪd/","syllables":"mat-ter-dom-i-nat-ed"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Matter-dominated' is primarily used in cosmology to describe a specific phase in the evolution of the universe where non-relativistic matter is the main contributor to the energy density. Outside of cosmology, it can be used more generally to describe situations where material considerations are the most important factor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The early universe was matter-dominated.","correct":"✓ The early universe was radiation-dominated.","note":"The very early universe was radiation-dominated, not matter-dominated."}],"priority":"★★★"},"related_words":{"derivatives":["matter","dominate","domination"],"related_terms":["radiation-dominated","dark energy-dominated","Lambda-CDM model"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Matter-dominated' is a term primarily used in cosmology to describe a specific epoch in the universe's evolution. It means that the energy density of the universe was primarily composed of non-relativistic matter, such as baryonic matter (protons, neutrons) and dark matter, rather than radiation or dark energy. This term is typically encountered in advanced physics or astronomy contexts. Outside of cosmology, it can describe a situation where material considerations are the most important factor."},"example_sentences":[{"sentence":"During the matter-dominated era, galaxies and other large-scale structures began to form.","translation":"物質優勢時代には、銀河やその他の大規模構造が形成され始めた。","type":"adjective","meaning_category":"Cosmology"},{"sentence":"A matter-dominated approach to politics often neglects social and ethical considerations.","translation":"政治への物質至上主義的なアプローチは、しばしば社会的および倫理的配慮を無視する。","type":"adjective","meaning_category":"General"}]}