{"word":"peonage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"年季奉公、債務奴隷制","english_definition":"the practice of holding persons to servitude or labor to work off a debt or obligation.","examples":[{"sentence":"Peonage was outlawed in the United States in 1867, but it persisted in some areas for many years.","translation":"年季奉公は1867年に米国で違法とされたが、一部の地域では長年にわたって存続した。"},{"sentence":"The system of peonage trapped many poor farmers in a cycle of debt and forced labor.","translation":"年季奉公の制度は、多くの貧しい農民を借金と強制労働のサイクルに閉じ込めた。"}],"collocations":["debt peonage","abolish peonage","end peonage","system of peonage"],"synonyms":["debt bondage","indentured servitude","forced labor","slavery"],"antonyms":["freedom","liberty","emancipation"]}],"etymology":{"value":"From Spanish *peonaje*, from *peón* meaning 'day laborer, foot soldier', from Medieval Latin *pedōnem*, accusative of *pedō* meaning 'one who goes on foot', from Latin *pes* meaning 'foot'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpiːənɪdʒ/","syllables":"pe-o-nage"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Peonage is a system of involuntary servitude where a person is forced to work to pay off a debt. While outlawed, forms of it have persisted throughout history. It is often associated with exploitation and abuse.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was in peonage for his crimes.","correct":"He was imprisoned for his crimes.","note":"Peonage is related to debt, not necessarily a crime. Imprisonment is a more appropriate term for punishment of crimes."}],"priority":"★★☆"},"related_words":{"derivatives":["peon (noun): a day laborer or unskilled worker (often used disparagingly)."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'peonage' refers to a specific form of forced labor where someone is made to work to pay off a debt. It's a historical term, but it's still important to understand when discussing labor exploitation. It's not a common word in everyday conversation, but you might encounter it in history books or articles about human rights.","priority":"★★☆"},"example_sentences":[{"sentence":"The investigation revealed widespread peonage on the plantation.","translation":"調査により、その農園で広範囲にわたる年季奉公が行われていることが明らかになった。","type":"noun","meaning_category":"債務奴隷制"},{"sentence":"The government took steps to eradicate peonage and protect vulnerable workers.","translation":"政府は年季奉公を根絶し、脆弱な労働者を保護するための措置を講じた。","type":"noun","meaning_category":"債務奴隷制"}]}