{"word":"Nonprosecution","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不起訴、訴追しないこと","english_definition":"The act or decision of not prosecuting someone for a crime, even when there is sufficient evidence to do so.","examples":[{"sentence":"The prosecutor agreed to nonprosecution in exchange for the witness's cooperation.","translation":"検察官は、証人の協力を得る代わりに不起訴に合意した。"},{"sentence":"The company reached a nonprosecution agreement with the Department of Justice.","translation":"その会社は司法省と訴追しないことで合意に達した。"},{"sentence":"Nonprosecution is sometimes offered to first-time offenders.","translation":"不起訴は、時に初犯者に提供される。"}],"collocations":["nonprosecution agreement","enter into nonprosecution","offer nonprosecution"],"synonyms":["amnesty","immunity","clemency","reprieve"],"antonyms":["prosecution","indictment","conviction"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'prosecution'. 'Prosecution' comes from the Latin 'prosequi', meaning 'to pursue'. Therefore, 'nonprosecution' literally means 'not to pursue' a legal case.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌprɒsɪˈkjuːʃən/","syllables":"non-pros-e-cu-tion"},"inflection":{"noun_plural":"Nonprosecutions"},"usage_notes":{"explanation":"'Nonprosecution' refers to the deliberate decision by a prosecuting authority not to pursue criminal charges against an individual or entity, despite having enough evidence and legal grounds to do so. This decision can be influenced by various factors, such as the severity of the offense, the offender's cooperation, the impact on the victim, and the public interest. A 'nonprosecution agreement' (NPA) is a formal agreement between the prosecutor and the accused, where the accused agrees to certain conditions (e.g., paying a fine, admitting wrongdoing, implementing compliance measures) in exchange for the prosecutor's promise not to pursue criminal charges.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-prosecution was happened because of lack of evidence.","correct":"✓ The nonprosecution occurred because of a lack of evidence.","note":"'Nonprosecution' is the decision itself, not an event that 'happens'. It 'occurs' or is 'decided'. Also, avoid hyphenating 'nonprosecution' unless it's part of a compound adjective before a noun."},{"incorrect":"✗ He received a non-prosecution for his crime.","correct":"✓ He was granted nonprosecution for his crime. / ✓ He entered into a nonprosecution agreement.","note":"One doesn't 'receive' nonprosecution directly. It's 'granted' by the prosecutor, or one 'enters into an agreement' for nonprosecution."},{"incorrect":"✗ The non prosecution agreement was very beneficial for him.","correct":"✓ The nonprosecution agreement was very beneficial for him.","note":"Incorrect spacing in 'non prosecution'. It should be 'nonprosecution' as one word."}],"priority":"★★☆"},"related_words":{"derivatives":["prosecute (verb)","prosecution (noun)","prosecutor (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonprosecution' is a legal term referring to the decision not to prosecute someone for a crime, even with sufficient evidence. It's often part of a formal agreement called a 'nonprosecution agreement' (NPA), where the accused meets certain conditions to avoid charges. Understanding this term requires familiarity with legal concepts and vocabulary related to the criminal justice system. It's more common in legal and academic contexts than in everyday conversation."},"example_sentences":[{"sentence":"The company avoided criminal charges by entering into a **nonprosecution** agreement with the government.","translation":"その会社は政府との不起訴合意を締結することで刑事告発を免れた。","type":"noun","meaning_category":"legal"},{"sentence":"The **nonprosecution** of the suspect raised concerns among the victim's family.","translation":"容疑者の不起訴は、被害者の家族の間で懸念を引き起こした。","type":"noun","meaning_category":"legal"},{"sentence":"The prosecutor considered the defendant's cooperation when deciding on **nonprosecution**.","translation":"検察官は不起訴を決定する際に、被告の協力を考慮した。","type":"noun","meaning_category":"legal"}]}