{"word":"disablingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"無力にするように、障害となるように","english_definition":"In a way that causes someone to be unable to do something; in a way that causes a disability.","examples":[{"sentence":"The illness affected her disablingly, making it impossible for her to work.","translation":"その病気は彼女を無力にするように影響し、働くことを不可能にした。"},{"sentence":"The accident injured him disablingly, leaving him unable to walk without assistance.","translation":"その事故は彼に障害となるような怪我を負わせ、介助なしでは歩けなくした。"}],"collocations":["affect disablingly","injure disablingly","impact disablingly"],"synonyms":["incapacitatingly","debilitatingly","cripplingly"],"antonyms":["enablingly","empowering"],"notes":"This adverb describes the manner in which something causes a disability or prevents someone from doing something."}],"etymology":{"value":"Derived from the adjective 'disabling' with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈseɪblɪŋli/","syllables":"di-sa-bling-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Disablingly' describes how something affects someone in a way that causes them to be unable to perform certain actions or functions. It emphasizes the limiting or incapacitating effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was disablingly injured.","correct":"✓ He was disablingly injured by the accident.","note":"The adverb 'disablingly' should modify the verb describing how the injury occurred, not the state of being injured itself. It's better to specify the cause of the injury. "},{"incorrect":"✗ The disablingly person.","correct":"✓ The disabled person.","note":"'Disablingly' is an adverb, not an adjective. Use 'disabled' as an adjective to describe a person with a disability."}],"priority":"★★☆"},"related_words":{"derivatives":["disable (verb)","disabled (adjective)","disability (noun)","enablingly (antonym)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'disablingly' is used to describe something that makes it difficult or impossible for someone to do something, often due to a disability or injury. It's an adverb that describes how an action affects someone's ability to function. It is not a commonly used word, so it is more likely to be encountered in formal or technical contexts."},"example_sentences":[{"sentence":"The pain affected her disablingly, preventing her from concentrating on her work.","translation":"その痛みは彼女に障害となるように影響し、仕事に集中することを妨げた。","type":"adverb","meaning_category":"無力にするように"},{"sentence":"He was disablingly injured in the car accident and required extensive rehabilitation.","translation":"彼はその自動車事故で障害となるような怪我を負い、広範囲なリハビリを必要とした。","type":"adverb","meaning_category":"無力にするように"}]}