{"word":"tourneyer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A participant in a tournament, especially a medieval jousting tournament.","english_definition":"A person who participates in a tournament, especially a medieval jousting tournament.","examples":[{"sentence":"The brave tourneyer rode into the arena, ready to face his opponent.","translation":"勇敢な試合参加者は、対戦相手と向き合う準備をしてアリーナに乗り込んだ。"},{"sentence":"Many a tourneyer sought fame and fortune through their skill at arms.","translation":"多くの試合参加者は、武器の腕前を通じて名声と富を求めた。"}],"collocations":["jousting tourneyer","skilled tourneyer","brave tourneyer"],"synonyms":["jouster","knight","combatant","contestant"],"antonyms":[]}],"etymology":{"value":"Derived from 'tourney' (a medieval sporting contest in which knights fought) + '-er' (a suffix denoting a person associated with something).","priority":"★★★"},"pronunciation":{"ipa":"ˈtʊrniər","syllables":"tour-ney-er"},"inflection":{"noun_plural":"tourneyers"},"usage_notes":{"explanation":"The term 'tourneyer' specifically refers to someone who takes part in a tourney, which is often associated with medieval jousting contests. It is not commonly used in modern English outside of historical contexts or fantasy literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a tourneyer of tennis.","correct":"He is a tennis player.","note":"'Tourneyer' is generally reserved for participants in medieval-style tournaments, not modern sports."}],"priority":"★★☆"},"related_words":{"derivatives":["tourney","tournament"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tourneyer' is a specialized term, primarily used in historical or fantasy contexts to describe a participant in a medieval tournament. Its usage is rare in contemporary English. Understanding the term requires familiarity with the historical context of tournaments and jousting."},"example_sentences":[{"sentence":"The young tourneyer displayed great skill in the joust.","translation":"若い試合参加者は馬上槍試合で素晴らしい腕前を披露した。","type":"noun","meaning_category":"participant"},{"sentence":"Each tourneyer hoped to win the favor of the queen.","translation":"各試合参加者は女王の寵愛を得ることを願っていた。","type":"noun","meaning_category":"participant"}]}