{"word":"open-timbered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"木骨構造の、木組みの見える","english_definition":"(of a building) having a timber frame with the spaces between the timbers filled with plaster, brick, or other material, leaving the timbers exposed on the outside.","examples":[{"sentence":"The house was open-timbered with wattle and daub infill.","translation":"その家は木骨構造で、骨組みの間は編み枝塗り壁で埋められていた。"},{"sentence":"They restored the open-timbered facade of the historic building.","translation":"彼らは歴史的建造物の木組みが見える外観を修復した。"}],"collocations":["open-timbered house","open-timbered facade","open-timbered construction"],"synonyms":["timber-framed","half-timbered"],"antonyms":["brick","stone"],"notes":"Often used to describe Tudor or medieval buildings."}],"etymology":{"value":"Combination of 'open' and 'timbered', referring to the exposed timber framework of a building.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊpənˈtɪmbərd/","syllables":"o-pen-tim-bered"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'open-timbered' specifically describes a type of construction where the wooden frame of a building is visible on the exterior. This is different from buildings where the timber frame is covered by other materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was open-timbered with stone walls.","correct":"✓ The house had stone walls.","note":"Open-timbered refers to the timber frame itself, not the walls. The spaces between the timbers might be filled with stone, brick, or plaster."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["timber frame","wattle and daub","half-timbered","Tudor architecture","medieval architecture"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"open-timbered\" is a specialized architectural term used to describe buildings where the wooden frame is visible on the exterior. Understanding this term requires familiarity with architectural styles and construction techniques, particularly those of Tudor or medieval buildings. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The charm of the old village lay in its quaint, open-timbered cottages.","translation":"その古い村の魅力は、趣のある木骨構造のコテージにあった。","type":"example","meaning_category":"General"},{"sentence":"The museum features a well-preserved example of an open-timbered barn.","translation":"その博物館には、保存状態の良い木骨構造の納屋の例が展示されている。","type":"example","meaning_category":"Architecture"}]}