{"word":"bistred","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(まれ)ビストルで染められた、またはビストルのような色の","english_definition":"(rare) stained with bistre; of a color like bistre.","examples":[{"sentence":"The old drawing was bistred with age.","translation":"その古い絵は、年を経てビストルの色に染まっていた。"},{"sentence":"The room had a bistred appearance due to the dim lighting.","translation":"部屋は薄暗い照明のせいで、ビストルのような色合いに見えた。"}],"collocations":[],"synonyms":["browned","darkened","sepia-toned"],"antonyms":["bleached","lightened"]}],"etymology":{"value":"Derived from 'bistre', a brown pigment extracted from soot, combined with the suffix '-ed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪstrəd/","syllables":"bis-tred"},"inflection":{"notes":"Adjective, no comparative or superlative forms typically used."},"usage_notes":{"explanation":"'Bistred' is a relatively rare adjective used to describe something that is stained with bistre or has a similar brownish color. It is often used in the context of old drawings or paintings.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["bistre (noun: a brown pigment extracted from soot)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Bistred' is a rare and specialized word. Understanding requires knowledge of 'bistre', a specific type of brown pigment. It is primarily encountered in descriptive writing about art or historical artifacts. Due to its rarity, it is unlikely to be encountered outside of specialized contexts."},"example_sentences":[{"sentence":"The antique map had a beautifully bistred hue, giving it an air of authenticity.","translation":"その古地図は美しくビストルの色合いを帯びており、本物らしさを醸し出していた。","type":"adjective","meaning_category":"Color/Appearance"},{"sentence":"Time had bistred the pages of the ancient manuscript.","translation":"時が経ち、古代の写本のページはビストルの色に染まっていた。","type":"adjective","meaning_category":"Color/Appearance"}]}