{"word":"papolatry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"教皇崇拝、ローマ教皇に対する過度の崇拝","english_definition":"Excessive veneration of the Pope.","examples":[{"sentence":"Some critics accuse certain Catholics of papolatry.","translation":"一部の批評家は、特定のカトリック教徒が教皇崇拝に陥っていると非難する。"},{"sentence":"The speaker warned against the dangers of papolatry, emphasizing the importance of focusing on Christ.","translation":"講演者は教皇崇拝の危険性について警告し、キリストに焦点を当てることの重要性を強調した。"}],"collocations":["border on papolatry (教皇崇拝に近い)","accused of papolatry (教皇崇拝で非難される)","dangers of papolatry (教皇崇拝の危険性)"],"synonyms":["pope worship","excessive veneration of the Pope","ultra-papism"],"antonyms":["anti-papism","criticism of the Pope","disrespect for the Pope"],"notes":"Often used in a critical or satirical way."}],"etymology":{"value":"From 'papo-' (combining form of 'pope') + '-latry' (suffix denoting worship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæˈpɒlətri/","syllables":"pa-po-la-try"},"inflection":{"noun_plural":"papolatries"},"usage_notes":{"explanation":"'Papolatry' is a term used, often pejoratively, to describe what the speaker perceives as an excessive or inappropriate level of reverence for the Pope. It suggests that the Pope is being treated with a level of adoration that should be reserved for God. The term is most frequently used by those critical of the Catholic Church or certain trends within it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices papolatry every day by praying to the Pope.","correct":"✓ He is accused of papolatry because of his unwavering support for the Pope's policies.","note":"Papolatry is not about simply praying, but about excessive veneration. The sentence should reflect this nuance."}],"priority":"★☆☆"},"related_words":{"derivatives":["papolater (noun: one who practices papolatry)"],"related_terms":["papal (adjective: relating to the Pope)","papism (noun: the doctrines, system, and practices of the papacy)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'papolatry' is a relatively rare and specialized term, primarily used in discussions about the Catholic Church. It carries a critical connotation, suggesting that someone is excessively reverent towards the Pope, potentially to an inappropriate degree. Understanding the term requires familiarity with religious terminology and the nuances of inter-faith or intra-faith debates. It is not typically encountered in general conversation or writing."},"example_sentences":[{"sentence":"The theologian argued that uncritical acceptance of papal authority could lead to **papolatry**.","translation":"その神学者は、教皇の権威を無批判に受け入れることは教皇崇拝につながる可能性があると主張した。","type":"noun","meaning_category":"教皇崇拝"},{"sentence":"Critics sometimes accuse devout Catholics of **papolatry**, suggesting they prioritize the Pope's teachings over scripture.","translation":"批評家は時々、敬虔なカトリック教徒を教皇崇拝で非難し、彼らが聖書よりも教皇の教えを優先していると示唆する。","type":"noun","meaning_category":"教皇崇拝"}]}