{"word":"trilingually","priority":"★★★","meanings":[{"part_of_speech":"adverb","definition":"3つの言語で、3ヶ国語を話して","english_definition":"in or using three languages; able to speak three languages fluently.","examples":[{"sentence":"She is trilingually proficient in English, French, and Spanish.","translation":"彼女は英語、フランス語、スペイン語の3ヶ国語に堪能です。"},{"sentence":"The company requires its employees to be trilingually competent.","translation":"その会社は従業員に3ヶ国語の能力を求めています。"},{"sentence":"He grew up trilingually, speaking Mandarin, Cantonese, and English.","translation":"彼は北京語、広東語、英語を話す3ヶ国語環境で育ちました。"}],"collocations":["speak trilingually","trilingually proficient","trilingually competent","grow up trilingually","educate trilingually"],"synonyms":["in three languages","speaking three languages","fluently in three languages"],"antonyms":["monolingually","bilingually","multilingually"]}],"etymology":{"value":"The word 'trilingually' is formed by combining 'trilingual' (able to speak three languages) with the suffix '-ly', which turns an adjective into an adverb. 'Trilingual' itself comes from 'tri-' (meaning three) + 'lingual' (relating to language).","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈlɪŋɡwəli/","syllables":"tri-lin-gua-lly"},"inflection":{"notes":"Since 'trilingually' is an adverb, it does not have different inflections like nouns or verbs. It simply modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"'Trilingually' describes the manner in which something is done using three languages. It is often used to describe a person's ability to speak, write, or understand three languages fluently. It can also describe educational programs or environments that involve the use of three languages. The word emphasizes the specific use or competence in three languages, distinguishing it from bilingualism (two languages) and multilingualism (more than three languages).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She speaks trilingual.","correct":"✓ She speaks trilingually.","note":"'Trilingual' is an adjective, so it describes a noun (e.g., 'She is trilingual'). 'Trilingually' is an adverb, so it modifies a verb (e.g., 'She speaks trilingually')."},{"incorrect":"✗ He is trilingually in English, French, and German.","correct":"✓ He is trilingual in English, French, and German. / ✓ He speaks trilingually in English, French, and German.","note":"The adjective 'trilingual' is used to describe someone who knows three languages. The adverb 'trilingually' is used to describe how someone speaks or communicates."}],"priority":"★★☆"},"related_words":{"derivatives":["trilingual (adjective, noun)","trilingualism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trilingually' is an adverb that means 'in three languages.' It describes how someone communicates or operates using three different languages. For example, if someone is 'trilingually proficient,' it means they have a high level of skill in using three languages. This word is less common than 'bilingual' or 'multilingual' and is typically used in contexts where the specific ability to use three languages is relevant."},"example_sentences":[{"sentence":"The documents were translated trilingually to ensure accessibility.","translation":"アクセシビリティを確保するため、文書は3ヶ国語に翻訳されました。","type":"adverb","meaning_category":"in three languages"},{"sentence":"The school offers a trilingually immersive program.","translation":"その学校は3ヶ国語イマージョンプログラムを提供しています。","type":"adverb","meaning_category":"using three languages"},{"sentence":"She presented the research findings trilingually at the conference.","translation":"彼女は会議で研究結果を3ヶ国語で発表しました。","type":"adverb","meaning_category":"speaking three languages"}]}