{"word":"photo-driven","meanings":[{"part_of_speech":"adjective","definition":"写真によって推進される、写真が重要な役割を果たす、写真に重点を置いた","english_definition":"Driven or heavily influenced by photography; where photographs play a key role.","examples":[{"sentence":"The website is very photo-driven, with large images dominating the homepage.","translation":"そのウェブサイトは写真が非常に重視されており、大きな画像がホームページを占めています。"},{"sentence":"She's building a photo-driven marketing campaign to promote her new product.","translation":"彼女は新製品を宣伝するために、写真主導のマーケティングキャンペーンを構築しています。"},{"sentence":"The success of the blog is due to its photo-driven content, which attracts a large audience.","translation":"そのブログの成功は、写真主導のコンテンツによるもので、多くの読者を引きつけています。"}],"collocations":["photo-driven website","photo-driven marketing","photo-driven content","photo-driven social media","photo-driven approach"],"synonyms":["image-centric","visually oriented","photography-focused","picture-based"],"antonyms":["text-heavy","content-driven","text-based"]},{"part_of_speech":"adjective","definition":"写真撮影に熱心な、写真に夢中な","english_definition":"Enthusiastic about or obsessed with taking photographs.","examples":[{"sentence":"He's a very photo-driven tourist, always snapping pictures of everything he sees.","translation":"彼は写真撮影に熱心な観光客で、いつも目にするものすべてを写真に撮っています。"},{"sentence":"My dad is quite photo-driven on vacation; he never misses a chance to take a picture.","translation":"私の父は休暇中はかなり写真に夢中で、写真を撮る機会を逃しません。"}],"collocations":["photo-driven tourist","photo-driven photographer","photo-driven hobbyist"],"synonyms":["photo-happy","photography enthusiast","camera-happy"],"antonyms":["not interested in photography","unenthusiastic about photography"]}],"etymology":{"value":"The word \"photo-driven\" is a compound word formed by combining \"photo\" (referring to photography) and \"driven\" (meaning propelled, motivated, or influenced).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊtoʊˌdrɪvən/","syllables":"pho-to-dri-ven"},"inflection":{"notes":"Since it's an adjective, it doesn't have different forms for tense or number. It can be used in comparative and superlative forms (more photo-driven, most photo-driven), but this is less common."},"usage_notes":{"explanation":"The term \"photo-driven\" typically describes something that is heavily reliant on or significantly influenced by photography. It can refer to websites, marketing campaigns, or even individuals who are very enthusiastic about taking photos. The core idea is that images play a central and motivating role. It is often used to describe a strategy or approach where visual content is prioritized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car is photo-driven.","correct":"✓ The car is self-driven.","note":"'Photo-driven' is typically used in contexts related to content, marketing, or personal enthusiasm for photography, not for literal driving. Use 'self-driven' or 'autonomous' for vehicles."},{"incorrect":"✗ He's a photo-driven.","correct":"✓ He's a photo-driven person. / ✓ He's photo-happy.","note":"'Photo-driven' is an adjective and needs to modify a noun. Alternatively, you can use 'photo-happy' as a synonym."}],"priority":"★★☆"},"related_words":{"derivatives":["photo (noun)","driven (adjective)","photography (noun)","photographer (noun)","photo-happy (adjective)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing with the rise of visual content marketing.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Photo-driven' is a compound adjective describing something that is heavily influenced by or reliant on photography. It suggests that images are central to the subject being described. It's often used in the context of websites, marketing, or individuals who are passionate about photography. The word is relatively modern and its usage is growing with the increasing importance of visual content.","priority":"★★☆"},"example_sentences":[{"sentence":"The Instagram account is completely photo-driven, with stunning images of landscapes.","translation":"そのインスタグラムのアカウントは完全に写真主導で、素晴らしい風景写真が掲載されています。","type":"adjective","meaning_category":"写真に重点を置いた"},{"sentence":"Our marketing strategy is photo-driven, focusing on high-quality visuals to attract customers.","translation":"当社のマーケティング戦略は写真主導で、高品質のビジュアルでお客様を引きつけることに重点を置いています。","type":"adjective","meaning_category":"写真が重要な役割を果たす"},{"sentence":"He's a photo-driven traveler, always capturing the beauty of the places he visits.","translation":"彼は写真に夢中な旅行者で、いつも訪れる場所の美しさを写真に収めています。","type":"adjective","meaning_category":"写真撮影に熱心な"}]}