{"word":"parfocalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(顕微鏡などの光学機器を)対物レンズを交換してもピントが合うように調整する","english_definition":"To adjust (an optical instrument, such as a microscope) so that an object remains in focus when the objective lens is changed.","examples":[{"sentence":"The microscope was parfocalized so that I could quickly switch between objectives without having to refocus significantly.","translation":"顕微鏡は、対物レンズを交換しても大幅な再調整なしに素早く切り替えられるように、パフォーカライズされた。"}],"collocations":["parfocalize a microscope","parfocalize an optical system"],"synonyms":["align","calibrate","adjust","focus"],"antonyms":["misalign","defocus"]}],"etymology":{"value":"The term 'parfocalize' is derived from 'parfocal', which combines the prefix 'par-' (meaning 'equal' or 'similar') with 'focal' (relating to the focal point). The suffix '-ize' turns it into a verb, indicating the action of making something parfocal.","priority":"★★★"},"pronunciation":{"ipa":"/pɑːrˈfoʊkəlaɪz/","syllables":"par-fo-cal-ize"},"inflection":{"verb_forms":{"present_simple":["parfocalize","parfocalizes"],"past_simple":"parfocalized","past_participle":"parfocalized","present_participle":"parfocalizing"}},"usage_notes":{"explanation":"'Parfocalize' is a technical term primarily used in the context of microscopy and other optical instruments. It refers to the process of adjusting the instrument so that different objective lenses maintain the same focal plane. This allows the user to switch between lenses with minimal refocusing, saving time and improving workflow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The microscope is parfocal.","correct":"✓ The microscope is parfocalized.","note":"'Parfocal' is an adjective describing the state of being parfocal, while 'parfocalized' is the past participle or adjective describing that the action has been performed. To say the microscope *is* in the state of being adjusted, use 'parfocalized'."},{"incorrect":"✗ I need to parfocal the object.","correct":"✓ I need to parfocalize the microscope.","note":"The microscope or optical system is parfocalized, not the object being viewed."}],"priority":"★★☆"},"related_words":{"derivatives":["parfocal (adjective)","parfocality (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parfocalize' is a specialized term primarily encountered in the context of microscopy and optical instruments. It describes the process of adjusting an instrument so that the image remains in focus when switching between different objective lenses. This adjustment minimizes the need for significant refocusing, improving efficiency. Understanding this term is essential for those working with microscopes and similar equipment.","priority":"★★☆"},"example_sentences":[{"sentence":"Before using the microscope, it's important to parfocalize it according to the manufacturer's instructions.","translation":"顕微鏡を使用する前に、メーカーの指示に従ってパフォーカライズすることが重要です。","type":"verb","meaning_category":"adjusting optical instruments"},{"sentence":"Once the microscope is properly parfocalized, switching between objectives is quick and easy.","translation":"顕微鏡が適切にパフォーカライズされると、対物レンズの切り替えが迅速かつ簡単になります。","type":"verb","meaning_category":"adjusting optical instruments"}]}