{"word":"fertile-flowered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Bearing fertile flowers; having flowers capable of producing fruit or seeds.","english_definition":"Having flowers that are capable of producing fruit or seeds; bearing fertile flowers.","examples":[{"sentence":"The fertile-flowered plants were carefully pollinated to ensure a bountiful harvest.","translation":"豊作を確実にするため、受精能力のある花を持つ植物は慎重に受粉されました。"},{"sentence":"A fertile-flowered variety is preferred for commercial cultivation.","translation":"商業栽培には、受精能力のある花を持つ品種が好まれます。"}],"collocations":["fertile-flowered plant","fertile-flowered variety","fertile-flowered species"],"synonyms":["fruitful-flowered","seed-bearing-flowered"],"antonyms":["sterile-flowered","infertile-flowered"]}],"etymology":{"value":"Combination of 'fertile' (capable of producing offspring or vegetation) and 'flowered' (having flowers).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfɜːrtaɪl ˈflaʊərd/","syllables":"fer-tile-flow-ered"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"This term is mainly used in botanical descriptions to specify that the flowers of a plant are capable of producing fruit and seeds after pollination. It distinguishes these plants from those with sterile flowers that do not produce seeds.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The plant is fertile-flowered because it has many flowers.","correct":"The plant is fertile-flowered because its flowers produce seeds.","note":"Having many flowers does not necessarily mean they are fertile. The key is their ability to produce seeds or fruit."}],"priority":"N/A"},"related_words":{"derivatives":["fertility","flower","flowering"],"related_terms":["fertile","flower","pollination","seed","fruit"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized botanical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Fertile-flowered' is a technical term used in botany. It describes plants that have flowers capable of producing fruit or seeds. This is important in agriculture and horticulture to ensure successful reproduction and yield. The term is relatively uncommon in everyday language and is more likely to be encountered in scientific or specialized contexts."},"example_sentences":[{"sentence":"The botanist identified the species as fertile-flowered based on the presence of developing seed pods.","translation":"植物学者は、発達中の種子のさやの存在に基づいて、その種を受精能力のある花を持つ種として特定しました。","type":"adjective","meaning_category":"botany"},{"sentence":"Only the fertile-flowered individuals were selected for propagation.","translation":"繁殖には、受精能力のある花を持つ個体のみが選ばれました。","type":"adjective","meaning_category":"horticulture"}]}