{"word":"undangerousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"安全であること、危険でないこと","english_definition":"the state or quality of not being dangerous; safety.","examples":[{"sentence":"The undangerousness of the path made it suitable for children.","translation":"その道の安全さから、子供たちに適していました。"},{"sentence":"The report highlighted the undangerousness of the chemical when used properly.","translation":"その報告書は、化学物質が適切に使用された場合の安全性を強調しました。"}],"collocations":["relative undangerousness","inherent undangerousness"],"synonyms":["safety","harmlessness","security"],"antonyms":["dangerousness","peril","hazard"]}],"etymology":{"value":"\"un-\" (否定) + \"dangerousness\" (危険であること)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈdeɪndʒərəsnəs/","syllables":"un-dan-ger-ous-ness"},"inflection":{"noun_plural":"undangerousnesses (rare)"},"usage_notes":{"explanation":"\"Undangerousness\" is a relatively uncommon word, primarily used in formal or technical contexts when emphasizing the lack of danger or risk. It is often used in contrast to situations or substances that are typically considered dangerous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undangerousness of the situation was obvious to everyone. (grammatically correct, but less common)","correct":"✓ The safety of the situation was obvious to everyone.","note":"\"Safety\" is generally preferred over \"undangerousness\" in most contexts due to its simplicity and common usage."}],"priority":"★★☆"},"related_words":{"derivatives":["undangerous (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"undangerousness\" is a formal and infrequent term used to describe the state of being safe or not dangerous. It is typically encountered in technical or formal writing where the absence of danger needs specific emphasis. Due to its complexity and infrequent use, it is more appropriate for advanced learners.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study confirmed the undangerousness of the new vaccine.","translation":"その研究は、新しいワクチンの安全性を確認しました。","type":"noun","meaning_category":"safety"},{"sentence":"The undangerousness of the procedure was a key factor in its approval.","translation":"その手順の安全性が、承認の重要な要素でした。","type":"noun","meaning_category":"safety"}]}