{"word":"stathmos","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Greek: σταθμός) station, stop","english_definition":"(Greek: σταθμός) A station or stop, especially for public transportation.","examples":[{"sentence":"Ο σταθμός του μετρό είναι κοντά στο σπίτι μου. (O stathmós tou metró eínai kontá sto spíti mou.)","translation":"The metro station is near my house.","language":"Greek"},{"sentence":"Πρέπει να κατέβουμε στον επόμενο σταθμό. (Prépei na katévoume ston epómeno stathmó.)","translation":"We need to get off at the next station.","language":"Greek"}],"collocations":["σταθμός λεωφορείου (stathmós leofóreíou) - bus station","σιδηροδρομικός σταθμός (sidirodromikós stathmós) - train station","κεντρικός σταθμός (kentrikós stathmós) - central station"],"synonyms":["τερματικός σταθμός (termatikós stathmós) - terminal station","στάση (stási) - stop"],"antonyms":[]},{"part_of_speech":"noun","definition":"(Greek: σταθμός) broadcasting station","english_definition":"(Greek: σταθμός) A broadcasting station (radio or television).","examples":[{"sentence":"Ακούω μουσική από τον αγαπημένο μου ραδιοφωνικό σταθμό. (Akoúo mousikí apó ton agapiméno mou radiofonikó stathmó.)","translation":"I listen to music from my favorite radio station.","language":"Greek"},{"sentence":"Ποιος είναι ο αγαπημένος σου τηλεοπτικός σταθμός; (Poios eínai o agapiménos sou tileoptikós stathmós?)","translation":"What is your favorite television station?","language":"Greek"}],"collocations":["ραδιοφωνικός σταθμός (radiofonikós stathmós) - radio station","τηλεοπτικός σταθμός (tileoptikós stathmós) - television station","κρατικός σταθμός (kratikós stathmós) - state-owned station","ιδιωτικός σταθμός (idiotikós stathmós) - private station"],"synonyms":["κανάλι (kanáli) - channel"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word σταθμός (stathmós), meaning 'a standing place, a post, a station'. Derived from the verb ἵστημι (hístēmi), meaning 'to stand, to set up'.","priority":"★★☆"},"pronunciation":{"ipa":"/staθˈmos/","syllables":"stath-mos"},"inflection":{"noun_gender":"masculine","noun_number":"singular","declension":"(Greek nouns decline according to case, gender, and number.  The nominative singular form is σταθμός.  Other forms would be σταθμού (genitive), σταθμώ (dative), σταθμόν (accusative), etc.)"},"usage_notes":{"explanation":"The word 'σταθμός' is commonly used in modern Greek to refer to stations for various modes of transportation (trains, buses, metro) and also to broadcasting stations. The specific meaning is usually clear from the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Έχω ένα σταθμό. (Écho éna stathmó.) - Intended meaning: I have a station.","correct":"✓ Περιμένω στο σταθμό. (Periméno sto stathmó.) - I am waiting at the station.","note":"The sentence 'Έχω ένα σταθμό' is grammatically correct but sounds odd unless you own a station. It's more common to use 'στο σταθμό' (at the station) when referring to being at a station."}],"priority":"★★☆"},"related_words":{"derivatives":["σταθμεύω (stathmévo) - to park (related to the idea of a fixed location)","σταθερός (statherós) - stable, steady (related to the idea of standing firm)"],"phrases":["στον σταθμό (ston stathmó) - at the station","από τον σταθμό (apó ton stathmó) - from the station"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Moderately frequent in Greek texts.","priority":"★☆☆"},"readability_explanation":{"level":"Intermediate","text":"'Σταθμός' is a common word in Greek, used in everyday contexts related to transportation and media. Understanding its different meanings is important for comprehending spoken and written Greek. The grammatical declension of Greek nouns can be challenging for learners, so paying attention to the case endings is essential."},"example_sentences":[{"sentence":"Περίμενα το τρένο στον σιδηροδρομικό σταθμό. (Perímena to tréno ston sidirodromikó stathmó.)","translation":"I was waiting for the train at the train station.","type":"transportation","meaning_category":"station"},{"sentence":"Ο ραδιοφωνικός σταθμός έπαιζε την αγαπημένη μου μουσική. (O radiofonikós stathmós épaze tin agapiméni mou mousikí.)","translation":"The radio station was playing my favorite music.","type":"media","meaning_category":"broadcasting station"}]}