{"word":"sensibilitous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"感受性の強い、感じやすい","english_definition":"Having or characterized by a fine or excessive sensibility.","examples":[{"sentence":"She is a very sensibilitous person, easily moved by art and music.","translation":"彼女は非常に感受性の強い人で、芸術や音楽にすぐに感動します。"},{"sentence":"He was too sensibilitous to endure the harsh criticism.","translation":"彼は感受性が強すぎて、厳しい批判に耐えられなかった。"}],"collocations":["sensibilitous to criticism","sensibilitous to art","sensibilitous to music","sensibilitous nature"],"synonyms":["sensitive","susceptible","responsive","impressionable","emotional"],"antonyms":["insensitive","unresponsive","callous","impassive"]}],"etymology":{"value":"'Sensibility' + '-ous'. 'Sensibility' comes from Latin 'sensibilis' (perceptible, capable of feeling), from 'sentire' (to feel).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛnsɪˈbɪlɪtəs/","syllables":"sen-si-bil-i-tous"},"inflection":{"notes":"Comparative: more sensibilitous, superlative: most sensibilitous"},"usage_notes":{"explanation":"'Sensibilitous' is a less common synonym of 'sensitive,' often implying a heightened or excessive degree of emotional or aesthetic sensitivity. It can sometimes suggest a vulnerability to being easily affected or hurt by external stimuli or criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very sensibilitous about the weather.","correct":"✓ He is very sensitive about the weather.","note":"'Sensitive' is more commonly used to describe being affected by weather conditions."},{"incorrect":"✗ The machine is sensibilitous to temperature changes.","correct":"✓ The machine is sensitive to temperature changes.","note":"For technical or scientific contexts, 'sensitive' is generally preferred."}],"priority":"★★☆"},"related_words":{"derivatives":["sensibility (noun): the ability to appreciate and respond to complex emotional or aesthetic influences; sensitivity.","sensitively (adverb): in a sensitive manner.","sensitiveness (noun): the quality of being sensitive."],"related_terms":["sensitive","sensory","sentient"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sensibilitous' is a formal and relatively uncommon adjective that describes a state of heightened sensitivity, often in an emotional or aesthetic context. It suggests a capacity to be deeply moved or affected by subtle nuances. The word is less frequently used than its synonym 'sensitive,' and its usage often implies a more pronounced or refined degree of responsiveness. Understanding its meaning requires a strong vocabulary and an appreciation for nuanced language. "},"example_sentences":[{"sentence":"Her sensibilitous nature made her a gifted artist, able to capture the subtlest emotions in her paintings.","translation":"彼女の感受性の強い性質が、彼女を才能ある芸術家とし、絵画の中で最も繊細な感情を捉えることを可能にした。","type":"general","meaning_category":"Having strong sensitivities"},{"sentence":"The critic described the poet as having a uniquely sensibilitous approach to language.","translation":"評論家は、その詩人が言語に対して他に類を見ないほど感受性の強いアプローチを持っていると評した。","type":"literary","meaning_category":"Having strong sensitivities"},{"sentence":"Because he was so sensibilitous to the needs of others, he was well-loved in his community.","translation":"彼は他者のニーズに非常に敏感であったため、地域社会で深く愛されていた。","type":"social","meaning_category":"Having strong sensitivities"}]}