{"word":"Toxotes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テッポウウオ属","english_definition":"A genus of ray-finned fishes in the family Toxotidae, known as archerfishes because of their ability to shoot water droplets at insects and other small animals to knock them into the water.","examples":[{"sentence":"The Toxotes jaculatrix is a well-known species of archerfish.","translation":"Toxotes jaculatrixは、よく知られたテッポウウオの一種です。"}],"collocations":["Toxotes jaculatrix","Toxotes chatareus","archerfish behavior","archerfish habitat"],"synonyms":["archerfish"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word 'toxotes' (τοξότης) meaning 'archer'. This refers to the fish's ability to shoot water like an archer shoots arrows.","priority":"★★☆"},"pronunciation":{"ipa":"/tɒkˈsoʊtiːz/","syllables":"Tox-o-tes"},"inflection":{"noun_plural":"Toxotes (same as singular)"},"usage_notes":{"explanation":"'Toxotes' is a scientific term used to refer to the genus of archerfishes. When referring to one specific fish, it is more common to use the species name (e.g., Toxotes jaculatrix). In general conversation, the term 'archerfish' is more commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Toxote in the aquarium.","correct":"✓ I saw a Toxotes in the aquarium. / ✓ I saw an archerfish in the aquarium.","note":"'Toxotes' is the genus name. While technically correct, it's more common to use 'archerfish' in general conversation. If you know the specific species, use that (e.g., 'Toxotes jaculatrix')."},{"incorrect":"✗ The Toxotes are very intelligent fish. They can be train.","correct":"✓ The Toxotes are very intelligent fish. They can be trained.","note":"'Toxotes' is plural in form, but the verb should still agree with the plural noun. Also, 'train' should be 'trained' in the passive voice."}],"priority":"★☆☆"},"related_words":{"derivatives":["Toxotidae (family)","archerfish"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Scientific term)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxotes' is a scientific term referring to a genus of fish. It's primarily used in biological or zoological contexts. Understanding this term requires familiarity with scientific nomenclature. In more general contexts, 'archerfish' is the preferred term. The etymology is helpful for understanding the name's origin and connection to the fish's behavior."},"example_sentences":[{"sentence":"Scientists are studying the hunting behavior of Toxotes microlepis.","translation":"科学者たちはToxotes microlepisの狩猟行動を研究しています。","type":"noun","meaning_category":"Genus of fish"},{"sentence":"The aquarium features several species of Toxotes, including the banded archerfish.","translation":"その水族館には、シマテッポウウオを含む、テッポウウオ属のいくつかの種が展示されています。","type":"noun","meaning_category":"Genus of fish"}]}