{"word":"racemation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)総状花序（そうじょうかじょ）の形成。または、総状花序に似た形状を持つこと。","english_definition":"(botany) The formation of racemes; arrangement in racemes; resemblance to a raceme.","examples":[{"sentence":"Racemation is a common type of inflorescence in flowering plants.","translation":"総状花序の形成は、顕花植物において一般的な花序のタイプです。"},{"sentence":"The plant exhibits racemation in its flowering pattern.","translation":"その植物は、開花パターンにおいて総状花序を示します。"}],"collocations":["exhibit racemation","observe racemation","racemation process"],"synonyms":["racemose inflorescence","racemous arrangement"],"antonyms":[]}],"etymology":{"value":"Derived from 'raceme' (総状花序) + '-ation' (名詞を形成する接尾辞). 'Raceme' comes from Latin 'racemus' (bunch of grapes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪsɪˈmeɪʃən/","syllables":"ra-ce-ma-tion"},"inflection":{"noun_plural":"racemations"},"usage_notes":{"explanation":"'Racemation' is primarily a botanical term referring to the arrangement of flowers in a raceme, where individual flowers are attached to the main stem by short stalks. It can also describe the process of forming such an arrangement. It is not a commonly used word outside of botanical contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The racemation of the leaves was striking.","correct":"✓ The arrangement of the leaves was striking.","note":"'Racemation' specifically refers to the arrangement of flowers, not leaves."}],"priority":"★☆☆"},"related_words":{"derivatives":["raceme","racemose"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Racemation' is a highly specialized botanical term. It describes the arrangement of flowers in a raceme, which is a type of inflorescence where flowers are attached to a central stem by short stalks. This term is rarely used outside of advanced botanical studies. Understanding requires familiarity with botanical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study focused on the racemation patterns of various plant species.","translation":"その研究は、さまざまな植物種の総状花序のパターンに焦点を当てていた。","type":"noun","meaning_category":"総状花序の形成"},{"sentence":"Observe the racemation in the flowering of this plant.","translation":"この植物の開花における総状花序を観察してください。","type":"noun","meaning_category":"総状花序の形成"}]}