{"word":"kicksy-wicksy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語, 軽蔑的に)妻、恋人","english_definition":"(archaic, derogatory) A wife or lover.","examples":[{"sentence":"He called his wife his little kicksy-wicksy.","translation":"彼は妻のことを、軽蔑的に「可愛いコケティッシュな女」と呼んだ。"}],"collocations":[],"synonyms":["wife","lover","wench (古語, 軽蔑的)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(古語)コケティッシュな、気まぐれな","english_definition":"(archaic) Coquettish; wanton.","examples":[{"sentence":"She had a kicksy-wicksy manner about her.","translation":"彼女はコケティッシュな態度をしていた。"}],"collocations":[],"synonyms":["coquettish","wanton","fickle"],"antonyms":[]}],"etymology":{"value":"16世紀後半に初めて確認された言葉。由来ははっきりしないが、「kick」という言葉の持つ軽快さや活発さ、そして「wicked」という言葉の持ついたずらっぽさや奔放さを組み合わせたものと考えられる。妻や恋人に対する軽蔑的なニュアンスは、当時、女性の自立や奔放な振る舞いに対する男性側の警戒感や不快感の表れであったと考えられる。シェイクスピアの作品にも登場する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɪksi ˈwɪksi/","syllables":"kick-sy-wick-sy"},"inflection":{"notes":"複数形は kicksy-wicksies"},"usage_notes":{"explanation":"「**kicksy-wicksy**」は、現代英語ではほとんど使われない古語です。名詞としては、妻や恋人を軽蔑的に指す言葉として使われ、女性を軽薄で気まぐれな存在として捉えるニュアンスを含みます。形容詞としては、「コケティッシュな」「気まぐれな」という意味で使われますが、やはり古風な表現です。現代では、文学作品や歴史的な文脈以外ではほとんど見られません。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrases":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな語彙)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**kicksy-wicksy**」は現代英語ではほとんど使われない古語であり、文学作品や歴史的な文脈でのみ見られる非常に特殊な語彙です。そのため、英語学習者にとって習得必須の単語ではありません。シェイクスピアなどの古典文学を読む際に、その意味を知っておくと理解の助けになる程度です。"},"example_sentences":[{"sentence":"(Shakespeare, Henry IV, Part 1) Away, you trifler! Love! I love thee not, I care not for thee, Kate: this is no world / To play with mammets and to tilt with lips: / We must have bloody noses and crack'd crowns, / And pass them current too. Gods, and great men, / Think shame to have their poor o'er-blown exampled / By such a minion; and they chide themselves / For being so fond, to lend the model of their sight / To so dilated a subject. Then, I love thee not so much as my own self, / That is, I will not love thee: and yet I know not how to hate thee. / And yet I do not kill thee. This is my sum: / I do not love thee, Kate. I do not love thee. If I do, may I never be trusted with a sword again. / Away, you **kicksy wicksy**!","translation":"(シェイクスピア、ヘンリー四世 第1部) あっちへ行け、道楽者！愛だと？ 私はお前を愛していない、お前のことなど気にもかけない、ケイト。ここは人形遊びや唇で戯れる場所ではない。血まみれの鼻やひび割れた王冠が必要なのだ。神々や偉人たちは、そのようなお気に入りの者に自分たちの貧弱な例を見られることを恥じている。だから、私はお前を自分自身ほど愛していない。つまり、私はお前を愛さないだろう。それでも、どうやってお前を憎めばいいのかわからない。それでも、私はお前を殺さない。これが私の結論だ。私はお前を愛していない、ケイト。もし愛しているなら、二度と剣を託されることがないように。あっちへ行け、コケティッシュな女！","type":"noun","meaning_category":"妻、恋人 (軽蔑的に)"}]}