{"word":"nondisjunctional","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学) 不分離の、不分離性の","english_definition":"Relating to or resulting from nondisjunction, the failure of homologous chromosomes or sister chromatids to separate properly during cell division.","examples":[{"sentence":"The nondisjunctional event led to an aneuploid gamete.","translation":"その不分離事象は異数性の配偶子をもたらした。"},{"sentence":"Nondisjunctional errors can occur during meiosis I or meiosis II.","translation":"不分離のエラーは、減数分裂Iまたは減数分裂IIの間に発生する可能性がある。"}],"collocations":["nondisjunctional event","nondisjunctional error","nondisjunctional chromosome","nondisjunctional gamete"],"synonyms":["aneuploidy-causing","chromosome segregation error"],"antonyms":["disjunctional","normal segregation"]},{"part_of_speech":"noun","definition":"(生物学) 不分離染色体","english_definition":"A chromosome or cell resulting from nondisjunction.","examples":[{"sentence":"The presence of a nondisjunctional in the karyotype indicated a genetic abnormality.","translation":"核型における不分離染色体の存在は、遺伝的異常を示していた。"}],"collocations":["a nondisjunctional in karyotype"],"synonyms":["aneuploid chromosome"],"antonyms":[]}],"etymology":{"value":"Derived from 'nondisjunction' (the failure of homologous chromosomes or sister chromatids to separate properly during cell division) + '-al' (suffix indicating relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒndɪsˈdʒʌŋkʃənəl/","syllables":"non-dis-junc-tion-al"},"inflection":{"notes":"Adjective: Comparative and superlative forms are not commonly used. Noun: Plural form is 'nondisjunctionals'."},"usage_notes":{"explanation":"'Nondisjunctional' is a term used in genetics and biology to describe events or chromosomes that result from the failure of chromosomes to separate properly during cell division (meiosis or mitosis). This can lead to gametes (sex cells) or somatic cells with an abnormal number of chromosomes, a condition known as aneuploidy. Common examples of aneuploidy in humans include Down syndrome (trisomy 21) and Turner syndrome (monosomy X).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was nondisjunction.","correct":"✓ The cell was nondisjunctional.","note":"'Nondisjunction' is a noun referring to the event itself, while 'nondisjunctional' is an adjective describing something related to or resulting from nondisjunction."},{"incorrect":"✗ Nondisjunctional can cause Down syndrome.","correct":"✓ Nondisjunction can cause Down syndrome. / ✓ Nondisjunctional events can cause Down syndrome.","note":"'Nondisjunction' (the event) causes genetic disorders. 'Nondisjunctional events' (events related to nondisjunction) can also be a subject."}],"priority":"★★☆"},"related_words":{"derivatives":["nondisjunction (noun)","disjunction (noun)","aneuploidy (noun)","trisomy (noun)","monosomy (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized term used in genetics and biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondisjunctional' is a technical term used in genetics to describe something related to 'nondisjunction.' Nondisjunction is when chromosomes don't separate correctly during cell division, leading to cells with too many or too few chromosomes. So, a 'nondisjunctional' event or chromosome is one that results from this faulty separation. This term is mainly found in scientific contexts when discussing genetic disorders or chromosomal abnormalities."},"example_sentences":[{"sentence":"The scientist studied the nondisjunctional chromosomes under the microscope.","translation":"科学者は顕微鏡下で不分離染色体を研究した。","type":"adjective","meaning_category":"不分離の"},{"sentence":"Nondisjunctional events are a primary cause of aneuploidy in humans.","translation":"不分離事象は、ヒトにおける異数性の主な原因である。","type":"adjective","meaning_category":"不分離性の"},{"sentence":"The karyotype revealed several nondisjunctionals, indicating a significant genetic imbalance.","translation":"核型分析により、いくつかの不分離染色体が明らかになり、重大な遺伝的アンバランスを示していた。","type":"noun","meaning_category":"不分離染色体"}]}