{"word":"Upstander","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(傍観者ではなく)不正や差別に対して立ち上がる人、擁護者、支援者","english_definition":"A person who speaks or acts in support of an individual or cause, particularly someone who intervenes on behalf of a person being attacked or bullied.","examples":[{"sentence":"She was an upstander, always defending those who were being bullied.","translation":"彼女は常にいじめられている人を擁護する、まさにアップスタンダーだった。"},{"sentence":"We need more upstanders in our community to combat injustice.","translation":"不正に対抗するために、私たちのコミュニティにはより多くのアップスタンダーが必要です。"},{"sentence":"The organization encourages young people to be upstanders, not bystanders.","translation":"その組織は若者たちに、傍観者ではなくアップスタンダーになるよう奨励しています。"}],"collocations":["be an upstander","become an upstander","encourage upstanders","support upstanders","upstander behavior","upstander intervention"],"synonyms":["advocate","ally","supporter","defender","champion","humanitarian","activist","intervener"],"antonyms":["bystander","bully","oppressor","persecutor","attacker"]}],"etymology":{"value":"The term 'upstander' is a relatively recent coinage, likely derived from the idea of 'standing up' against injustice. It contrasts with the term 'bystander,' which describes someone who witnesses wrongdoing but does not intervene. The term gained prominence through educational programs and social justice movements aimed at promoting active intervention against bullying and discrimination.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʌpstændər/","syllables":"up-stand-er"},"inflection":{"noun_plural":"upstanders"},"usage_notes":{"explanation":"'Upstander' is a term used to describe someone who takes action to help others, especially when they are being mistreated or facing injustice. It emphasizes the importance of active intervention rather than passive observation. The term is often used in the context of anti-bullying campaigns, diversity and inclusion initiatives, and social justice movements. It highlights the responsibility of individuals to challenge harmful behavior and support those who are vulnerable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an upstander of the law.","correct":"✓ He is an advocate for the law. / ✓ He is a supporter of the law.","note":"'Upstander' is typically used in situations involving interpersonal conflict, bullying, or discrimination, not in the context of legal systems. Use 'advocate' or 'supporter' when referring to laws or policies."},{"incorrect":"✗ She upstanded against the bully.","correct":"✓ She stood up against the bully. / ✓ She acted as an upstander against the bully.","note":"'Upstander' is primarily used as a noun, not a verb. Use the phrasal verb 'stand up against' or rephrase the sentence to use 'upstander' as a noun."},{"incorrect":"✗ The upstander saved the day.","correct":"✓ The upstander intervened and helped the person being bullied.","note":"While an upstander's actions may be heroic, the term emphasizes intervention and support rather than a dramatic rescue. Focus on the specific actions taken by the upstander."}],"priority":"★★☆"},"related_words":{"derivatives":["upstand (verb - rare, archaic: to stand up)"],"phrasal_verbs":["stand up for (to support or defend someone or something)","stand up to (to confront or resist someone or something)"],"related_concepts":["bystander effect","moral courage","social responsibility","ethical behavior","active citizenship","allyship","anti-bullying","diversity and inclusion"]},"level_frequency":{"CEFR":"C1-C2 (The word is not commonly used in everyday conversation but is more likely to appear in academic or social justice contexts.)","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to social justice movements.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Upstander' is a term that describes someone who actively intervenes to help others who are being mistreated or facing injustice. It's a relatively new word that's often used in discussions about bullying, discrimination, and social responsibility. An upstander is the opposite of a 'bystander,' who witnesses wrongdoing but does not take action. The term emphasizes the importance of taking a stand and supporting those who are vulnerable. It's commonly used in educational and activist contexts to promote ethical behavior and social change."},"example_sentences":[{"sentence":"The teacher praised the student for being an **upstander** and stopping the fight.","translation":"先生はその生徒がアップスタンダーとして喧嘩を止めたことを褒めた。","type":"noun","meaning_category":"擁護者"},{"sentence":"We need to teach children to be **upstanders**, not bystanders, when they see someone being bullied.","translation":"誰かがいじめられているのを見たら、傍観者ではなくアップスタンダーになるように子供たちに教える必要があります。","type":"noun","meaning_category":"支援者"},{"sentence":"The **upstander** risked their own safety to help the victim of the attack.","translation":"そのアップスタンダーは、攻撃の被害者を助けるために自分の安全を危険にさらした。","type":"noun","meaning_category":"擁護者"},{"sentence":"The organization provides training to help people become effective **upstanders** in their communities.","translation":"その組織は、人々が地域社会で効果的なアップスタンダーになるのを支援するためのトレーニングを提供しています。","type":"noun","meaning_category":"支援者"}]}