{"word":"multiplicands","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"被乗数（ひじょうすう）：掛け算において、掛けられる数。","english_definition":"The number that is multiplied by another number (the multiplier) in a multiplication operation.","examples":[{"sentence":"In the equation 3 x 4 = 12, 3 is the multiplier and 4 is the multiplicand.","translation":"3 x 4 = 12 という式では、3は乗数、4は被乗数です。"},{"sentence":"The multiplicand is the number of items in each group.","translation":"被乗数は各グループの項目の数です。"}],"collocations":["multiplicand and multiplier (被乗数と乗数)","calculate the product of the multiplicand (被乗数の積を計算する)"],"synonyms":["factor (因数)"],"antonyms":["multiplier (乗数)","product (積)","quotient (商)","divisor (除数)","dividend (被除数)"],"related_terms":["multiplication (掛け算)","multiplier (乗数)","product (積)"]}],"etymology":{"value":"Late Middle English: from Latin multiplicandus, gerundive of multiplicare ‘multiply’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltɪplɪˈkændz/","syllables":"mul-ti-pli-cands"},"inflection":{"noun_plural":"multiplicands"},"usage_notes":{"explanation":"'Multiplicand' refers specifically to the number being multiplied. It is often contrasted with the 'multiplier,' which is the number by which the multiplicand is multiplied. The result of the multiplication is called the 'product.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The multiplier is the number being multiplied.","correct":"The multiplicand is the number being multiplied.","note":"It's important to distinguish between the multiplicand (the number being multiplied) and the multiplier (the number doing the multiplying)."},{"incorrect":"The multiplicand is the answer to the multiplication problem.","correct":"The product is the answer to the multiplication problem.","note":"The answer to a multiplication problem is called the product, not the multiplicand."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["multiplication (掛け算)","multiplier (乗数)","product (積)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'multiplicand' is a technical term used in mathematics to describe the number being multiplied in a multiplication operation. It is typically encountered in educational contexts when learning about arithmetic or in more advanced mathematical discussions. Understanding this term is essential for precise communication in mathematical contexts."},"example_sentences":[{"sentence":"In the expression 7 × 5, the number 5 is the multiplicand.","translation":"7 × 5 という式では、5は被乗数です。","type":"noun","meaning_category":"被乗数"},{"sentence":"To find the total, we multiply the number of groups (multiplier) by the number of items in each group (multiplicand).","translation":"合計を求めるには、グループの数（乗数）に各グループの項目の数（被乗数）を掛けます。","type":"noun","meaning_category":"被乗数"},{"sentence":"The student correctly identified the multiplicand in the given equation.","translation":"学生は与えられた方程式で被乗数を正しく識別しました。","type":"noun","meaning_category":"被乗数"}]}