{"word":"ardebs","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"plural of ardeb","english_definition":"plural form of ardeb, a unit of capacity used in Egypt and some other Middle Eastern countries, primarily for grains.","examples":[{"sentence":"The farmer harvested several ardebs of wheat this season.","translation":"農家は今シーズン、数アルデブの小麦を収穫した。"},{"sentence":"Prices are quoted per ardeb for the major grains.","translation":"主要な穀物の価格はアルデブあたりで提示される。"}],"collocations":["measure in ardebs","number of ardebs","sell by the ardeb"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Arabic word 'ʾirdabb' (إردب), a measure of capacity.","priority":"Medium"},"pronunciation":{"ipa":"/ˈɑːrdɛbz/","syllables":"ar-debs"},"inflection":{"noun_plural":"ardebs"},"usage_notes":{"explanation":"An 'ardeb' is a traditional unit of measurement, specifically for dry goods like grains, used in Egypt and some other parts of the Middle East. The exact volume can vary slightly depending on the region and the commodity being measured, but it is generally around 198 liters or 5.6 U.S. bushels.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"I need to buy one ardebs of rice.","correct":"I need to buy one ardeb of rice.","note":"Ardebs is the plural form; use 'ardeb' for a single unit."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_units":["kantar","feddan"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Ardebs' is a relatively obscure term referring to a unit of dry volume measurement, primarily used historically and in some contemporary agricultural contexts in Egypt and the Middle East. Understanding this term requires familiarity with historical measurement systems and regional agricultural practices. It is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The ancient texts mention taxes collected in ardebs of barley.","translation":"古代の文献には、オオムギのアルデブで徴収された税金について言及されている。","type":"noun","meaning_category":"unit of measurement"},{"sentence":"Farmers in the region still sometimes trade in ardebs rather than metric tons.","translation":"その地域の農家は、いまだにメートルトンではなくアルデブで取引することがある。","type":"noun","meaning_category":"unit of measurement"}]}