{"word":"Camus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カミュ (フランスの作家、哲学者)","english_definition":"Albert Camus (1913-1960), a French philosopher, author, and journalist. His views contributed to the rise of absurdism.","examples":[{"sentence":"Camus is known for his novels 'The Stranger' and 'The Plague'.","translation":"カミュは、彼の小説『異邦人』と『ペスト』で知られています。"},{"sentence":"Camus's philosophy explores the absurdity of human existence.","translation":"カミュの哲学は、人間の存在の不条理を探求しています。"}],"collocations":["Albert Camus","Camus's philosophy","Camus's works","Camus's novels"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Albert Camus, the French author and philosopher.","priority":"★★★"},"pronunciation":{"ipa":"/kæˈmuː/","syllables":"Ca-mus"},"inflection":{},"usage_notes":{"explanation":"'Camus' refers specifically to Albert Camus, a significant figure in 20th-century literature and philosophy. It is typically used in discussions of existentialism, absurdism, and post-war French literature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I read a book by Camus yesterday. It was very quiet.","correct":"✓ I read a book by Camus yesterday. It was very thought-provoking.","note":"'Camus' refers to the author, not a state of being. Therefore, it wouldn't be described as 'quiet'."}],"priority":"★★☆"},"related_words":{"derivatives":["Camusian (adjective: relating to Camus or his philosophy)","Absurdism (related philosophical movement)","Existentialism (related philosophical movement)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent outside academic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Camus' is a proper noun referring to a specific person, Albert Camus. Understanding its meaning requires knowledge of 20th-century philosophy and literature. It is typically encountered in academic or literary discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The themes of alienation and absurdity are central to Camus's work.","translation":"疎外と不条理のテーマは、カミュの作品の中心です。","type":"general","meaning_category":"author"},{"sentence":"Many students study Camus in their philosophy courses.","translation":"多くの学生が哲学の授業でカミュについて学びます。","type":"general","meaning_category":"author"}]}