{"word":"nonconversationally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"会話的でない方法で、会話をしないように、打ち解けない様子で","english_definition":"in a manner that is not conversational; in a way that avoids or lacks the qualities of a conversation.","examples":[{"sentence":"He responded nonconversationally, offering only brief, factual answers.","translation":"彼は会話をしないように、簡潔で事実に基づいた答えだけを返した。"},{"sentence":"The report was written nonconversationally, using formal language and avoiding personal anecdotes.","translation":"その報告書は、形式的な言葉遣いを使い、個人的な逸話を避けて、会話的でない書き方で書かれていた。"},{"sentence":"She stared out the window nonconversationally, lost in her own thoughts.","translation":"彼女は自分の考えにふけり、会話をする様子もなく窓の外を眺めていた。"}],"collocations":["speak nonconversationally","write nonconversationally","behave nonconversationally"],"synonyms":["formally","reservedly","taciturnly","distantly","aloofly"],"antonyms":["conversationally","informally","engagingly","affably","sociably"]}],"etymology":{"value":"「non-」（否定）+ 「conversationally」（会話的に）","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkɒnvərˈseɪʃənəli/","syllables":"non-con-ver-sa-tion-al-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"**nonconversationally**\" describes an action or behavior that lacks the characteristics of a typical conversation. This often implies a lack of engagement, formality, or a deliberate avoidance of casual or personal topics. It can also describe writing or speaking styles that are formal and impersonal. The word is relatively uncommon and often used in more formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very nonconversation.","correct":"✓ He acted very nonconversationally.","note":"\"nonconversation\" is not a standard word. The adverb form \"nonconversationally\" is needed to modify the verb \"acted\"."},{"incorrect":"✗ She was nonconversation.","correct":"✓ She was being nonconversationally. / ✓ She was nonconversational.","note":"\"nonconversationally\" is an adverb and modifies a verb. To describe someone's state, you can use \"nonconversational\" (adjective) or use the adverb with a verb like \"being\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonconversational (adjective)"],"antonyms":["conversationally"],"related_terms":["conversation","conversational"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**nonconversationally**\" describes something done in a way that is not like a normal conversation. It means someone is not being chatty or friendly. This word is not used very often. You might see it in books or articles when someone is talking about how people communicate, especially when they are not communicating in a relaxed or friendly way. It's the opposite of talking in a \"conversational\" way."},"example_sentences":[{"sentence":"The witness testified nonconversationally, sticking strictly to the facts.","translation":"証人は事実のみを厳守し、会話をする様子もなく証言した。","type":"adverb","meaning_category":"manner of speaking"},{"sentence":"The robot responded nonconversationally to the user's query.","translation":"ロボットはユーザーの質問に対して、会話をする様子もなく応答した。","type":"adverb","meaning_category":"manner of responding"},{"sentence":"The document was formatted nonconversationally, with a rigid structure and formal tone.","translation":"その文書は、厳格な構造と形式的な口調で、会話的でない形式で作成されていた。","type":"adverb","meaning_category":"style of writing"}]}