{"word":"non-splinter-proof","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(特にガラスなどが)耐破片性のない、破片が飛び散る可能性がある","english_definition":"Not designed to prevent splintering or shattering into small pieces; lacking the property of being splinter-proof.","examples":[{"sentence":"The old windows were non-splinter-proof and posed a safety hazard.","translation":"その古い窓は耐破片性がなく、安全上の危険をもたらした。"},{"sentence":"Unlike modern safety glass, this type of glass is non-splinter-proof.","translation":"現代の安全ガラスとは異なり、このタイプのガラスは耐破片性がない。"}],"collocations":["non-splinter-proof glass","non-splinter-proof material"],"synonyms":["splintering","shatterable","fragile"],"antonyms":["splinter-proof","shatterproof","safety glass"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the adjective 'splinter-proof'. 'Splinter-proof' itself is a compound word combining 'splinter' (a small, thin, sharp piece of wood, glass, etc., broken off from a larger piece) and 'proof' (resistant to or protected against).","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn ˈsplɪntər pruːf/","syllables":"non-splin-ter-proof"},"inflection":{"notes":"Adjectives do not typically inflect in English, although they can be modified by adverbs (e.g., 'very non-splinter-proof')."},"usage_notes":{"explanation":"'Non-splinter-proof' describes materials, most commonly glass, that do not have the property of resisting splintering or shattering. This term is often used in contrast to 'splinter-proof' or 'shatterproof' materials, which are designed to minimize the risk of sharp fragments being dispersed upon impact or breakage. It is often used in discussions of safety standards and materials science.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The car's windshield was non splinter proof.","correct":"The car's windshield was non-splinter-proof.","note":"Hyphenation is important for clarity. Without the hyphen, it can be misread."}],"priority":"low"},"related_words":{"derivatives":["non-","splinter","splinter-proof","proof"],"phrasal_verbs":[],"related_terms":["shatterproof","safety glass","tempered glass","laminated glass"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'non-splinter-proof' is relatively technical and specific, usually appearing in contexts related to safety, materials science, or engineering. It's used to describe the absence of a particular safety feature in materials, particularly glass. Understanding this term requires familiarity with the concept of 'splinter-proof' materials and the safety considerations surrounding them."},"example_sentences":[{"sentence":"The antique mirror was beautiful but unfortunately made of non-splinter-proof glass.","translation":"そのアンティークの鏡は美しかったが、残念ながら耐破片性のないガラスでできていた。","type":"adjective","meaning_category":"Material Property"},{"sentence":"The use of non-splinter-proof windows in vehicles is now considered a serious safety flaw.","translation":"車両に耐破片性のない窓を使用することは、現在、深刻な安全上の欠陥と見なされている。","type":"adjective","meaning_category":"Safety Standards"}]}