{"word":"Abnegators","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Divergentシリーズにおける)自己否定を信条とするグループのメンバー","english_definition":"Members of the Abnegation faction in the Divergent series, who value selflessness.","examples":[{"sentence":"The Abnegators are known for their selfless acts.","translation":"アブネゲーターは、その無私の行為で知られています。"},{"sentence":"In the Divergent series, the Abnegators prioritize the needs of others above their own.","translation":"ダイバージェントシリーズでは、アブネゲーターは自分のニーズよりも他者のニーズを優先します。"}],"collocations":["Abnegator faction","Divergent series","selfless acts"],"synonyms":["selfless","altruistic"],"antonyms":["selfish","self-centered"]}],"etymology":{"value":"The word 'Abnegator' is derived from 'abnegate,' which means to renounce or reject something desired or valuable. In the context of the Divergent series, it signifies those who renounce their own desires for the sake of others.","priority":"★★☆"},"pronunciation":{"ipa":"ˈæbnɪɡeɪtərz","syllables":"Ab-ne-ga-tors"},"inflection":{"noun_plural":"Abnegators"},"usage_notes":{"explanation":"The term 'Abnegators' is specific to the fictional world of the Divergent series by Veronica Roth. It refers to members of the Abnegation faction, one of the five factions that divide society. The Abnegation faction values selflessness and service to others, and its members often hold positions of leadership and provide aid to the factionless.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an abnegator of responsibility.","correct":"✓ He abnegates responsibility.","note":"'Abnegator' specifically refers to the faction members in Divergent. For general self-denial, use 'abnegate' as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Abnegation (noun: 自己否定、放棄)","abnegate (verb: 放棄する、拒否する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (specific to the Divergent series)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Abnegators' are a specific group of people from the Divergent series. They are known for putting others' needs before their own. The word is not commonly used outside of discussions about the book series.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Abnegators** provided food and shelter to the factionless.","translation":"アブネゲーターは、派閥を持たない人々に食料と住居を提供しました。","type":"noun","meaning_category":"グループのメンバー"},{"sentence":"As **Abnegators**, they were raised to suppress their own desires.","translation":"アブネゲーターとして、彼らは自分自身の欲求を抑えるように育てられました。","type":"noun","meaning_category":"グループのメンバー"}]}