{"word":"Finno-Ugric","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"フィン・ウゴル語族の、フィン・ウゴル語派の","english_definition":"Relating to or denoting the family of languages spoken in northeastern Europe and parts of northern Asia, including Finnish, Hungarian, and Estonian.","examples":[{"sentence":"Finno-Ugric languages are spoken by millions of people.","translation":"フィン・ウゴル語族の言語は何百万人もの人々によって話されています。"},{"sentence":"The Finno-Ugric peoples have a rich cultural heritage.","translation":"フィン・ウゴル語族の人々は豊かな文化遺産を持っています。"}],"collocations":["Finno-Ugric languages","Finno-Ugric peoples","Finno-Ugric studies"],"synonyms":["Ugric","Finnic"],"antonyms":[]},{"part_of_speech":"noun","definition":"フィン・ウゴル語族、フィン・ウゴル語派","english_definition":"The Finno-Ugric family of languages.","examples":[{"sentence":"Finno-Ugric is a branch of the Uralic language family.","translation":"フィン・ウゴル語族はウラル語族の一つの分派です。"},{"sentence":"The study of Finno-Ugric is a complex field.","translation":"フィン・ウゴル語族の研究は複雑な分野です。"}],"collocations":["Uralic","Finnic","Ugric"],"synonyms":["Finno-Ugrian languages"],"antonyms":[]}],"etymology":{"value":"'Finno-' refers to the Finnic languages, and 'Ugric' refers to the Ugric languages (Hungarian, etc.). The term combines these to denote the broader language family.","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɪnoʊˈuːɡrɪk/","syllables":"Fin-no-U-gric"},"inflection":{"notes":"It can be used as both an adjective and a noun, so there are no specific inflections to note."},"usage_notes":{"explanation":"'Finno-Ugric' is primarily used in linguistic contexts to refer to a specific branch of the Uralic language family. It's important to use it when specifically discussing languages like Finnish, Estonian, Hungarian, and related languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Finno-Ugric is a country.","correct":"✓ Finno-Ugric is a language family.","note":"Finno-Ugric refers to a language family, not a country or ethnicity."},{"incorrect":"✗ Finnish is a Slavic language, like Russian.","correct":"✓ Finnish is a Finno-Ugric language, not a Slavic language.","note":"Finnish belongs to the Finno-Ugric family, while Russian belongs to the Slavic family."}],"priority":"★★☆"},"related_words":{"derivatives":["Finno-Ugrian (alternative term)","Uralic (broader language family)","Finnic (branch of Finno-Ugric)","Ugric (branch of Finno-Ugric)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Finno-Ugric' is a specialized term used in linguistics to refer to a specific family of languages. It is not commonly used outside of academic or specialized contexts. Understanding its meaning requires knowledge of language families and linguistic classifications."},"example_sentences":[{"sentence":"The origins of the Hungarian language can be traced back to the Finno-Ugric language family.","translation":"ハンガリー語の起源はフィン・ウゴル語族に遡ることができます。","type":"adjective","meaning_category":"Language Family"},{"sentence":"Linguists study the relationships between the various Finno-Ugric languages.","translation":"言語学者は様々なフィン・ウゴル語族の言語間の関係を研究しています。","type":"noun","meaning_category":"Language Family"}]}