{"word":"hydrography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"水路学、水誌学","english_definition":"the science that measures and describes the physical features of bodies of water and the adjacent coastal areas, with particular reference to their use for navigation","examples":[{"sentence":"Hydrography is essential for safe navigation in coastal waters.","translation":"水路学は沿岸水域での安全な航行に不可欠である。"},{"sentence":"The hydrography of the Amazon River is complex and constantly changing.","translation":"アマゾン川の水路学は複雑で常に変化している。"},{"sentence":"Hydrographic surveys are used to create nautical charts.","translation":"水路測量は航海図を作成するために使用される。"}],"collocations":["hydrographic survey","hydrographic chart","hydrographic data","hydrographic office"],"synonyms":["bathymetry","marine surveying","ocean mapping"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water) and 'graphy' (writing or description).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈdrɒɡrəfi/","syllables":"hy-dro-gra-phy"},"inflection":{"noun_plural":"hydrographies (rarely used)"},"usage_notes":{"explanation":"Hydrography focuses on mapping and charting navigable waters, including oceans, seas, rivers, and lakes. It involves measuring water depth, mapping coastlines, identifying navigational hazards, and studying tides and currents. It is distinct from hydrology, which is the study of water in general, including its properties, distribution, and circulation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydrology is the same as hydrography.","correct":"✓ Hydrography focuses on navigable waters, while hydrology is the broader study of water.","note":"Hydrology and hydrography are related but distinct fields. Hydrology is the broader science of water, while hydrography specifically deals with mapping and charting navigable bodies of water."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrographic (adjective)","hydrographer (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hydrography is a specialized term related to the scientific study and mapping of bodies of water, particularly for navigation purposes. It is a field that requires technical knowledge and is not commonly used in everyday conversation. Understanding this term requires familiarity with scientific and geographic concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The hydrography of the region is crucial for understanding its flood risk.","translation":"その地域の水路学は、洪水リスクを理解するために重要である。","type":"general","meaning_category":"general"},{"sentence":"The hydrographic survey revealed a previously unknown underwater mountain.","translation":"水路測量により、以前は知られていなかった海中の山が明らかになった。","type":"survey","meaning_category":"survey"},{"sentence":"The hydrographic office publishes updated nautical charts regularly.","translation":"水路部は定期的に更新された航海図を発行している。","type":"office","meaning_category":"office"}]}