{"word":"dielectrical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"誘電性の、絶縁性の","english_definition":"Relating to dielectrics; having the property of electrical insulation and the ability to store energy when subjected to an electric field.","examples":[{"sentence":"The dielectrical properties of the material are crucial for its use in capacitors.","translation":"その材料の誘電特性は、コンデンサでの使用にとって重要である。"},{"sentence":"Dielectrical breakdown can occur if the electric field is too strong.","translation":"電場が強すぎると、絶縁破壊が起こることがある。"}],"collocations":["dielectrical constant","dielectrical strength","dielectrical material","dielectrical properties","dielectrical breakdown"],"synonyms":["insulating","nonconducting","non-conductive"],"antonyms":["conductive","conducting"],"notes":"Often used in the context of physics, electrical engineering, and materials science."}],"etymology":{"value":"Formed from the prefix 'di-' (meaning 'two' or 'across') + 'electric' + '-al'. The 'di-' refers to the ability of the material to sustain an electric field across it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪɪlɛkˈtrɪkəl/","syllables":"di-e-lec-tri-cal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Dielectrical' is an adjective used to describe materials that are electrical insulators and can be polarized by an applied electric field. These materials are used in capacitors and other electronic components to store electrical energy. The term is often used interchangeably with 'dielectric', although 'dielectric' can also be a noun referring to the material itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dielectrical is used in the capacitor.","correct":"✓ The dielectric material is used in the capacitor.","note":"'Dielectrical' is an adjective, so it must modify a noun. 'Dielectric' can be used as a noun to refer to the material itself."}],"priority":"★★☆"},"related_words":{"derivatives":["dielectric (noun, adjective)","dielectrically (adverb)"],"related_terms":["polarization","capacitance","electric field","insulator"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency; technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dielectrical' is a technical term primarily used in physics and electrical engineering. It describes the properties of a material that is an electrical insulator but can be polarized by an electric field. Understanding this term requires a background in these fields."},"example_sentences":[{"sentence":"The **dielectrical** material was carefully chosen to optimize the capacitor's performance.","translation":"コンデンサの性能を最適化するために、誘電材料は慎重に選択された。","type":"adjective","meaning_category":"誘電性の"},{"sentence":"Testing the **dielectrical** strength of the insulator is essential for safety.","translation":"絶縁体の絶縁耐力をテストすることは、安全のために不可欠である。","type":"adjective","meaning_category":"絶縁性の"}]}