{"word":"Pokeberry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アメリカヤマゴボウ","english_definition":"A tall herbaceous plant with dark purple berries, native to North America.","examples":[{"sentence":"Pokeberry is known for its vibrant purple berries.","translation":"アメリカヤマゴボウは、鮮やかな紫色の果実で知られています。"},{"sentence":"Some parts of the pokeberry plant are poisonous.","translation":"アメリカヤマゴボウの一部の部位には毒性があります。"}],"collocations":["pokeberry juice","pokeberry stain","pokeberry root","pokeberry extract"],"synonyms":["inkberry","pigeon berry","American nightshade"],"antonyms":[]}],"etymology":{"value":"Derived from 'poke', an old English word for bag or pouch (referring to the shape of the berries), and 'berry'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpoʊkˌbɛri/","syllables":"poke-ber-ry"},"inflection":{"noun_plural":"pokeberries"},"usage_notes":{"explanation":"Pokeberry is primarily known as the name of a plant species. It's important to note that while the berries have been used historically for dyes and some medicinal purposes, they are toxic and should not be ingested without proper knowledge and preparation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a handful of pokeberries and felt fine.","correct":"✓ Eating pokeberries can be dangerous due to their toxicity.","note":"Pokeberries are poisonous, so eating them is not recommended."},{"incorrect":"✗ Pokeberry is a type of blueberry.","correct":"✓ Pokeberry is a distinct plant species with dark purple berries, not related to blueberries.","note":"Pokeberries and blueberries are different plants."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Pokeberry is a relatively uncommon term, primarily used in botanical or gardening contexts. Understanding requires familiarity with plant names and potentially some knowledge of botany or herbalism, as pokeberry is known for both its use as a dye and its toxicity. The term is not typically encountered in everyday conversation. "},"example_sentences":[{"sentence":"The artist used pokeberry juice to create a natural purple dye.","translation":"そのアーティストは、アメリカヤマゴボウの果汁を使って天然の紫色の染料を作りました。","type":"noun","meaning_category":"plant"},{"sentence":"Children should be warned not to eat pokeberries due to their poisonous nature.","translation":"子供たちは、アメリカヤマゴボウの有毒な性質のために、その果実を食べないように警告されるべきです。","type":"noun","meaning_category":"plant"}]}