{"word":"Consularity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"領事の職務、領事の地位、領事館の管轄区域","english_definition":"The office, position, or functions of a consul; the district over which a consul's jurisdiction extends.","examples":[{"sentence":"The consularity is responsible for assisting citizens abroad.","translation":"領事館は海外にいる市民を支援する責任があります。"},{"sentence":"He held the consularity in Marseille for several years.","translation":"彼はマルセイユで数年間領事の職を務めた。"},{"sentence":"The consularity's jurisdiction covers the southern region of the country.","translation":"領事館の管轄区域は国の南部地域をカバーしています。"}],"collocations":["hold a consularity (領事の職務を保持する)","the French consularity (フランス領事館)","the consularity's jurisdiction (領事館の管轄区域)"],"synonyms":["consulship","consulate"],"antonyms":[]}],"etymology":{"value":"'Consularity' is derived from 'consul,' which comes from the Latin 'consul,' a chief magistrate of ancient Rome. The suffix '-arity' is added to denote a state, quality, or condition related to the consul.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒnsjʊˈlærɪti/","syllables":"con-su-la-ri-ty"},"inflection":{"noun_plural":"consularities"},"usage_notes":{"explanation":"'Consularity' refers to the position, duties, or area of authority of a consul. It's less commonly used than 'consulate,' which refers to the building or office of a consul. 'Consularity' emphasizes the role and responsibilities of the consul more than the physical location.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the consularity to get a visa.","correct":"✓ I visited the consulate to get a visa.","note":"Use 'consulate' to refer to the building. 'Consularity' refers to the office or functions of a consul."}],"priority":"★☆☆"},"related_words":{"derivatives":["consul (noun: 領事)","consular (adjective: 領事の)","consulate (noun: 領事館)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Consularity' is a formal term referring to the office, position, or functions of a consul. It is less commonly used than 'consulate,' which refers to the building where a consul works. Understanding this term is useful in contexts involving international relations, diplomacy, and consular services. It emphasizes the role and responsibilities of the consul.","priority":"★★☆"},"example_sentences":[{"sentence":"The responsibilities of the consularity include assisting citizens in distress.","translation":"領事の職務には、困窮している市民を支援することが含まれます。","type":"general","meaning_category":"職務"},{"sentence":"The extent of the consularity's influence varied depending on the country.","translation":"領事の権限の範囲は国によって異なっていた。","type":"general","meaning_category":"権限"},{"sentence":"He was appointed to the consularity in a major European city.","translation":"彼はヨーロッパの主要都市の領事に任命された。","type":"general","meaning_category":"地位"}]}