{"word":"broguish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アイルランド訛りの、またはアイルランド訛りのような","english_definition":"having or suggesting a brogue; Irish in manner or speech.","examples":[{"sentence":"He spoke with a broguish accent that was difficult to understand.","translation":"彼は理解するのが難しいアイルランド訛りで話した。"},{"sentence":"The character in the play had a broguish charm.","translation":"劇中のキャラクターはアイルランド訛りの魅力を持っていた。"}],"collocations":["broguish accent","broguish charm","broguish manner"],"synonyms":["Irish-accented","brogued","Irish"],"antonyms":["unaccented","non-Irish"]},{"part_of_speech":"adjective","definition":"ブローグシューズの、またはブローグシューズのような","english_definition":"relating to or resembling brogue shoes.","examples":[{"sentence":"He wore broguish shoes with his suit.","translation":"彼はスーツにブローグシューズを履いていた。"}],"collocations":["broguish shoes","broguish style"],"synonyms":["brogue-like"],"antonyms":[]}],"etymology":{"value":"'brogue' + '-ish'. 'Brogue' refers to a strong Irish accent or a type of sturdy shoe, both originating from Ireland.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbroʊɡɪʃ/","syllables":"bro-guish"},"inflection":{"adjective_forms":{"comparative":"more broguish","superlative":"most broguish"}},"usage_notes":{"explanation":"The adjective 'broguish' is used to describe something that is characteristic of or resembles a 'brogue'. A 'brogue' can refer either to a strong Irish accent or to a style of sturdy leather shoe with decorative perforations. Therefore, 'broguish' can describe either speech or mannerisms that are reminiscent of Irish culture, or footwear that is similar in style to brogue shoes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a broguish on his shoe.","correct":"✓ He had a brogue on his shoe.","note":"'broguish' is an adjective, while 'brogue' is a noun. The correct usage would be 'He had a brogue on his shoe' (referring to the decorative perforations) or 'He wore brogue shoes'."},{"incorrect":"✗ She spoke broguish.","correct":"✓ She spoke with a broguish accent.","note":"To describe someone speaking with an Irish accent, it's more accurate to say 'She spoke with a broguish accent' rather than just 'She spoke broguish'."}],"priority":"★★☆"},"related_words":{"derivatives":["brogue (noun)"],"phrasal_verbs":[],"related_terms":["Irish","brogues"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'broguish' is relatively uncommon and is used to describe something that has the qualities of a 'brogue'. A 'brogue' can refer to either a strong Irish accent or a type of shoe. Therefore, 'broguish' can describe something that sounds or seems Irish, or something that looks like brogue shoes. Because the word is not frequently used, it is more likely to be encountered in literature or specialized contexts related to Irish culture or fashion."},"example_sentences":[{"sentence":"The actor adopted a broguish tone for his portrayal of the Irish character.","translation":"俳優はアイルランドのキャラクターを演じるためにアイルランド訛りの口調を取り入れた。","type":"adjective","meaning_category":"Irish accent"},{"sentence":"He paired his tweed suit with broguish boots.","translation":"彼はツイードのスーツにブローグ風のブーツを合わせた。","type":"adjective","meaning_category":"brogue shoes"}]}