{"word":"allogene","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)異種の、異系の","english_definition":"(medicine) genetically dissimilar, but obtained from the same species.","examples":[{"sentence":"Allogeneic bone marrow transplantation can be used to treat leukemia.","translation":"同種異系骨髄移植は白血病の治療に用いることができる。"},{"sentence":"The allogeneic graft was rejected by the recipient's immune system.","translation":"同種異系移植片はレシピエントの免疫系によって拒絶された。"}],"collocations":["allogeneic bone marrow transplantation","allogeneic graft","allogeneic cells"],"synonyms":["heterologous","xenogeneic"],"antonyms":["autologous","syngeneic"]}],"etymology":{"value":"Derived from the Greek words 'allos' (other) and 'genos' (kind, race).","priority":"★★★"},"pronunciation":{"ipa":"/ˈæləˌdʒiːn/","syllables":"al-lo-gene"},"inflection":{"notes":"The word 'allogene' is primarily used as an adjective. The related noun form is 'allograft' or 'allogeneic transplant'."},"usage_notes":{"explanation":"'Allogene' refers to something that is genetically different but comes from the same species. It is commonly used in the context of transplants and transfusions, where the donor and recipient are not genetically identical but are of the same species. The term highlights the genetic disparity that can lead to immune reactions such as graft-versus-host disease (GVHD).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient received an autogeneic transplant from a sibling.","correct":"✓ The patient received an allogeneic transplant from a sibling.","note":"Autogeneic transplants use the patient's own cells, while allogeneic transplants use cells from a genetically different individual of the same species."},{"incorrect":"✗ Allogeneic transplants do not require immunosuppressants.","correct":"✓ Allogeneic transplants typically require immunosuppressants.","note":"Because allogeneic transplants involve genetically different tissue, immunosuppressants are usually necessary to prevent rejection."}],"priority":"★★☆"},"related_words":{"derivatives":["allograft (noun: a tissue graft from a genetically different individual of the same species)","allogeneic (adjective: relating to or involving genetically dissimilar individuals of the same species)","alloantibody (noun: an antibody produced against an alloantigen)","alloantigen (noun: an antigen that occurs in some, but not all, individuals of a species and that is capable of inducing an immune response in individuals lacking it)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'allogene' is a specialized medical term used to describe genetically different material from the same species, often in the context of transplantation. Understanding this term requires a background in biology or medicine, particularly in immunology and genetics. It is typically encountered in scientific literature or medical settings.","priority":"★★☆"},"example_sentences":[{"sentence":"The success of the allogeneic transplant depends on the degree of HLA matching between the donor and recipient.","translation":"同種異系移植の成功は、ドナーとレシピエントのHLA適合度合いに依存する。","type":"adjective","meaning_category":"異種の"},{"sentence":"Allogeneic hematopoietic stem cell transplantation is a curative option for many hematologic malignancies.","translation":"同種異系造血幹細胞移植は、多くの血液悪性腫瘍に対する根治療法である。","type":"adjective","meaning_category":"異系の"},{"sentence":"The use of allogeneic cells in regenerative medicine faces challenges related to immune rejection.","translation":"再生医療における同種異系細胞の使用は、免疫拒絶反応に関連する課題に直面している。","type":"adjective","meaning_category":"異種の"}]}