{"word":"prepunch","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(金属板などに)あらかじめ穴をあける","english_definition":"To punch a hole in (something, especially a metal sheet) in advance of another operation.","examples":[{"sentence":"The metal sheets were prepunched before being sent to the assembly line.","translation":"金属板は組立ラインに送られる前にあらかじめ穴あけされていた。"}],"collocations":[],"synonyms":["pre-drill"],"antonyms":[]},{"part_of_speech":"noun","definition":"あらかじめ穴をあけること、またはあらかじめ穴があけられたもの","english_definition":"The act of prepunching, or something that has been prepunched.","examples":[{"sentence":"The prepunch ensured accurate alignment during assembly.","translation":"あらかじめ穴をあけることで、組み立て中の正確な位置合わせが保証された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"prefix 'pre-' (before) + 'punch' (to create a hole).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈpʌntʃ/","syllables":"pre-punch"},"inflection":{"verb_forms":{"present_simple":["prepunch","prepunches"],"past_simple":"prepunched","past_participle":"prepunched","present_participle":"prepunching"},"noun_plural":"prepunches"},"usage_notes":{"explanation":"'Prepunch' is primarily used in manufacturing and engineering contexts, specifically when referring to the process of creating holes in materials (often metal) as a preliminary step before further processing or assembly. It ensures accuracy and efficiency in subsequent operations.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["prepunched (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Prepunch' is a technical term used in manufacturing and engineering. It refers to the act of creating a hole in a material before another process takes place. This is often done to ensure accurate alignment or to facilitate further operations. Understanding this term requires some familiarity with manufacturing processes."},"example_sentences":[{"sentence":"The factory uses a machine to prepunch holes in the steel beams.","translation":"その工場では、鋼鉄製の梁にあらかじめ穴をあける機械を使用しています。","type":"verb","meaning_category":"穴あけ"},{"sentence":"The prepunch allowed for easier bolt insertion during construction.","translation":"あらかじめ穴をあけることで、建設中のボルトの挿入が容易になりました。","type":"noun","meaning_category":"穴あけ"}]}