{"word":"English-inspired","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"英語に触発された、英語の影響を受けた","english_definition":"Inspired by or influenced by English language, culture, or style.","examples":[{"sentence":"The restaurant's menu features English-inspired dishes.","translation":"そのレストランのメニューは、英語に触発された料理が特徴です。"},{"sentence":"Her fashion sense is very English-inspired.","translation":"彼女のファッションセンスは、非常に英語の影響を受けています。"},{"sentence":"The architecture of the building has an English-inspired design.","translation":"その建物の建築は、英語に触発されたデザインを持っています。"}],"collocations":["English-inspired cuisine","English-inspired design","English-inspired style","English-inspired garden"],"synonyms":["influenced by English","English-influenced","English-style","English-themed"],"antonyms":["uninfluenced by English","non-English","original"],"notes":"Typically used to describe something that is not strictly English but draws heavily from English sources."}],"etymology":{"value":"A compound word formed by combining \"English\" (referring to the language, culture, or people of England) and \"inspired\" (meaning influenced or stimulated).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪŋɡlɪʃ ɪnˈspaɪərd/","syllables":"Eng-lish in-spired"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms with 'more' and 'most' or by adding '-er' and '-est' where applicable."},"usage_notes":{"explanation":"\"English-inspired\" is used to describe things that take ideas, styles, or characteristics from English culture but are not necessarily purely English themselves. It suggests a creative influence rather than a direct copy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The music is very inspire English.","correct":"✓ The music is very English-inspired.","note":"The correct form is \"English-inspired,\" not \"inspire English.\""}],"priority":"★★☆"},"related_words":{"derivatives":["inspiration (noun)","inspired (adjective)","English (adjective, noun)"],"related_terms":["Anglophile","Anglicized","British-inspired"]},"level_frequency":{"frequency_google_ngram":"Low frequency - more common in specific contexts like design, cuisine, or fashion.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"English-inspired\" is used to describe something that has taken influence from English culture, style, or language. It is often used in contexts such as design, fashion, and cuisine to indicate that something is reminiscent of English aesthetics or traditions without being strictly English itself. The word is relatively straightforward but requires an understanding of the concept of cultural influence."},"example_sentences":[{"sentence":"The garden features an English-inspired rose garden.","translation":"その庭園には、英語に触発されたバラ園があります。","type":"example","meaning_category":"design"},{"sentence":"The chef created an English-inspired afternoon tea menu.","translation":"シェフは、英語に触発されたアフタヌーンティーのメニューを作りました。","type":"example","meaning_category":"cuisine"},{"sentence":"Her home decor is English-inspired, with floral patterns and antique furniture.","translation":"彼女の家の内装は英語の影響を受けており、花柄とアンティーク家具が特徴です。","type":"example","meaning_category":"style"}]}