{"word":"Come-all-ye","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(アイルランドおよびスコットランドのフォークソング) 特定の形式を持つバラード。通常は「Come all ye」で始まり、特定の出来事、場所、または職業について語る。","english_definition":"(in Irish and Scottish folk music) a ballad with a specific form, typically beginning with the phrase 'Come all ye' and relating an event, place, or occupation.","examples":[{"sentence":"The band played a rousing come-all-ye about the life of a fisherman.","translation":"そのバンドは漁師の人生について、心を揺さぶるカムオールイェを演奏した。"},{"sentence":"Many traditional Irish songs are come-all-yes that tell stories of rebellion and hardship.","translation":"多くのアイルランドの伝統的な歌は、反乱や苦難の物語を語るカムオールイェである。"}],"collocations":["sing a come-all-ye","traditional come-all-ye","Irish come-all-ye","Scottish come-all-ye"],"synonyms":["ballad","folk song","narrative song"],"antonyms":[]}],"etymology":{"value":"「Come all ye」というフレーズで始まることから。これは、歌を聴くすべての人への呼びかけであり、注意を引き、物語を聞くように促す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkʌm ɔːl ˈjeɪ/","syllables":"Come-all-ye (4 syllables)"},"inflection":{"notes":"複数形は come-all-yes"},"usage_notes":{"explanation":"「**Come-all-ye**」は、アイルランドおよびスコットランドのフォーク音楽の文脈でのみ使用される特殊な用語です。特定の形式を持つバラードを指し、通常は「Come all ye」というフレーズで始まります。歌の内容は、特定の出来事、場所、職業など、多岐にわたります。この用語は、フォーク音楽の愛好家や、アイルランド・スコットランドの文化に詳しい人々の間で理解されています。一般的な会話ではほとんど使用されません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a come-all-ye about his dog.","correct":"✓ He wrote a song about his dog.","note":"Come-all-yeは特定の形式を持つフォークソングを指すため、一般的な歌について使うのは不適切です。"},{"incorrect":"✗ The come-all-ye was very upbeat and happy.","correct":"✓ The song was very upbeat and happy.","note":"Come-all-yeは歌の形式を指す言葉であり、歌自体の性質を説明するものではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_genres":["folk music","Irish folk music","Scottish folk music"],"related_terms":["ballad","folk song","sean-nós"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特定の文化圏でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Come-all-ye**」は、アイルランドやスコットランドのフォーク音楽に特有の用語であり、一般的な英語の語彙ではありません。この単語は、特定の形式を持つバラードを指し、「Come all ye」というフレーズで始まるのが特徴です。この種の歌は、特定の出来事、場所、職業などについて語ることが多く、伝統的な物語を伝える手段として重要です。そのため、フォーク音楽の研究者や愛好家、アイルランド・スコットランド文化に精通している人々にとってのみ馴染みのある言葉と言えるでしょう。"},"example_sentences":[{"sentence":"The singer launched into a traditional come-all-ye, captivating the audience with his storytelling.","translation":"歌手は伝統的なカムオールイェを歌い始め、その語り口で観客を魅了した。","type":"noun","meaning_category":"バラード"},{"sentence":"The album features several come-all-yes about the lives of coal miners.","translation":"そのアルバムには、炭鉱労働者の生活についてのカムオールイェがいくつか収録されている。","type":"noun","meaning_category":"バラード"}]}