{"word":"pseudoprosperously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"見せかけの繁栄の中で、偽りの繁栄の中で","english_definition":"In a manner that appears prosperous but is not genuinely so; in a falsely flourishing way.","examples":[{"sentence":"The company presented itself pseudoprosperously, masking its underlying financial troubles.","translation":"その会社は、根底にある財政難を隠して、見せかけの繁栄を装った。"},{"sentence":"The nation seemed pseudoprosperously wealthy due to unsustainable economic practices.","translation":"その国は、持続不可能な経済慣行のために、偽りの繁栄の中で豊かに見えた。"}],"collocations":["live pseudoprosperously","appear pseudoprosperously","behave pseudoprosperously","present oneself pseudoprosperously"],"synonyms":["ostensibly prosperously","seemingly flourishingly","falsely thrivingly","superficially successfully"],"antonyms":["genuinely prosperously","truly flourishingly","authentically successfully","really thrivingly"]}],"etymology":{"value":"The word is formed by combining 'pseudo-' (meaning false or fake), 'prosperous' (meaning successful or thriving), and '-ly' (an adverbial suffix). Thus, it describes something done in a way that falsely appears prosperous.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈprɒspərəsli/","syllables":"pseu-do-pros-per-ous-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Pseudoprosperously' is used to describe situations or actions that give the impression of prosperity but lack genuine, sustainable success. It often implies deception or unsustainable practices that create a false sense of well-being.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was pseudoprosperously because it had a lot of money.","correct":"✓ The country appeared pseudoprosperously because its wealth was based on debt.","note":"The correct usage implies that the prosperity is not genuine or sustainable. The revised sentence clarifies that the wealth is based on unsustainable debt, making the prosperity false."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo (prefix: false, fake)","prosperous (adjective: successful, thriving)","prosperity (noun: state of being successful and thriving)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pseudoprosperously' is a complex adverb used to describe a situation that appears prosperous but is not genuinely so. It is not commonly used and would typically appear in sophisticated writing or academic contexts. The word combines the prefix 'pseudo-' (false) with 'prosperously' (in a prosperous manner), indicating a deceptive or superficial appearance of success."},"example_sentences":[{"sentence":"The company advertised pseudoprosperously, attracting investors with fabricated success stories.","translation":"その会社は見せかけの繁栄を宣伝し、捏造された成功談で投資家を惹きつけた。","type":"adverb","meaning_category":"見せかけの繁栄の中で"},{"sentence":"The regime governed pseudoprosperously, ignoring the growing discontent among the populace.","translation":"その政権は見せかけの繁栄の中で統治を行い、増大する民衆の不満を無視した。","type":"adverb","meaning_category":"偽りの繁栄の中で"}]}