{"word":"Audacities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大胆さ、厚かましさ、無遠慮さ（audacityの複数形）","english_definition":"Plural form of audacity: Daring or willingness to take bold risks; impudence or presumptuousness.","examples":[{"sentence":"The audacities of the young rebels shocked the establishment.","translation":"若い反逆者たちの大胆不敵さは、体制を震撼させた。"},{"sentence":"He was known for the audacities in his art, pushing boundaries and challenging norms.","translation":"彼はその芸術における大胆さで知られており、境界線を押し広げ、規範に挑戦していた。"},{"sentence":"The audacities of her plan surprised even her closest allies.","translation":"彼女の計画の大胆さは、彼女の最も親しい同盟者さえも驚かせた。"}],"collocations":["sheer audacities","bold audacities","artistic audacities","political audacities"],"synonyms":["boldness","daring","nerve","temerity","impudence","cheek","effrontery","presumption"],"antonyms":["timidity","caution","hesitation","meekness","submissiveness"]}],"etymology":{"value":"'Audacities' is the plural form of 'audacity,' which comes from the Latin word 'audacia,' meaning 'boldness, daring, spirit, confidence.' This is derived from 'audax,' meaning 'bold, daring,' which ultimately comes from 'audere,' meaning 'to dare.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈdæsətiz/","syllables":"Au-dac-i-ties"},"inflection":{"noun_plural":"audacities"},"usage_notes":{"explanation":"'Audacities' is used to refer to multiple instances or examples of bold or impudent behavior. It emphasizes the repeated or varied nature of the daring or presumptuous actions. While 'audacity' can sometimes be used in a positive sense to describe admirable boldness, 'audacities' often carries a negative connotation, highlighting acts that are seen as overly daring, disrespectful, or even shocking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The audacitys of the plan were surprising.","correct":"✓ The audacities of the plan were surprising.","note":"'Audacities' is already the plural form, so it does not need an additional 's' to indicate plurality. The correct plural form of 'audacity' is 'audacities.'"},{"incorrect":"✗ He showed much audacities in his performance.","correct":"✓ He showed much audacity in his performance.","note":"When referring to the general quality of boldness or daring, use the singular form 'audacity' as an uncountable noun. 'Audacities' is used when referring to specific instances or examples of bold acts."}],"priority":"★☆☆"},"related_words":{"derivatives":["audacity (noun: boldness, daring)","audacious (adjective: bold, daring)","audaciously (adverb: in a bold or daring manner)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Audacities' is the plural form of 'audacity', which refers to bold or daring behavior, often in a way that is considered impudent or disrespectful. This word is used to describe multiple instances of such behavior. It is more advanced and less commonly used than its singular form, 'audacity'. Understanding the nuances of this word implies a sophisticated grasp of language and the ability to recognize subtle differences in meaning."},"example_sentences":[{"sentence":"The politician's audacities in disregarding public opinion were widely criticized.","translation":"その政治家の世論を無視する大胆さは、広く批判された。","type":"noun (plural)","meaning_category":"boldness/impudence"},{"sentence":"The artist's audacities challenged traditional artistic norms.","translation":"その芸術家の大胆さは、伝統的な芸術規範に挑戦した。","type":"noun (plural)","meaning_category":"boldness/daring"},{"sentence":"The audacities of the company's marketing campaign raised eyebrows.","translation":"その会社のマーケティングキャンペーンの大胆さは、眉をひそめさせた。","type":"noun (plural)","meaning_category":"impudence/presumption"}]}