{"word":"self-map","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"自己地図、自己認識マップ","english_definition":"A mental representation or cognitive map of one's own personality, values, beliefs, skills, experiences, and relationships; a comprehensive understanding of oneself.","examples":[{"sentence":"Creating a self-map can help you identify your strengths and weaknesses.","translation":"自己地図を作成することで、自分の長所と短所を特定するのに役立ちます。"},{"sentence":"Her self-map included her love for art, her dedication to her family, and her strong work ethic.","translation":"彼女の自己地図には、芸術への愛、家族への献身、そして強い労働倫理が含まれていました。"},{"sentence":"Through introspection and journaling, he began to develop a more detailed self-map.","translation":"内省と日記を通して、彼はより詳細な自己地図を作成し始めました。"}],"collocations":["create a self-map","develop a self-map","explore one's self-map","understand one's self-map","detailed self-map","comprehensive self-map"],"synonyms":["self-awareness","self-knowledge","self-understanding","self-concept","identity map","cognitive map of self"],"antonyms":["self-ignorance","lack of self-awareness"]},{"part_of_speech":"verb","definition":"自己を地図化する、自己認識を体系化する","english_definition":"To create or develop a mental representation or cognitive map of oneself; to systematically understand and organize one's own personality, values, beliefs, skills, experiences, and relationships.","examples":[{"sentence":"The workshop encouraged participants to self-map their career goals and personal values.","translation":"そのワークショップでは、参加者にキャリア目標と個人的な価値観を自己地図化することを奨励しました。"},{"sentence":"She used the personality test results to self-map her strengths and areas for improvement.","translation":"彼女は性格テストの結果を使って、自分の強みと改善すべき点を自己地図化しました。"},{"sentence":"By self-mapping his past experiences, he gained a clearer understanding of his current motivations.","translation":"過去の経験を自己地図化することで、彼は現在のモチベーションをより明確に理解することができました。"}],"collocations":["self-map one's goals","self-map one's values","self-map one's skills","self-map one's experiences","self-map one's personality"],"synonyms":["self-assess","self-analyze","self-reflect","introspect","map one's identity","chart one's self"],"antonyms":["ignore one's self","avoid self-reflection"]}],"etymology":{"value":"The term 'self-map' is a compound word combining 'self' (referring to oneself) and 'map' (a visual representation or cognitive framework). It suggests creating a mental map of one's inner world.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈselfˌmæp/","syllables":"self-map"},"inflection":{"noun_plural":"self-maps","verb_forms":{"present_simple":["self-map","self-maps"],"past_simple":"self-mapped","past_participle":"self-mapped","present_participle":"self-mapping"}},"usage_notes":{"explanation":"'Self-map' is a relatively new and uncommon term, primarily used in psychology, personal development, and self-help contexts. It emphasizes the active process of understanding and organizing one's internal characteristics and experiences. The term is often used metaphorically, suggesting a visual or structured representation of one's self-concept.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to self map my house.","correct":"✓ I need to create a self-map of my values and beliefs.","note":"'Self-map' refers to mapping one's internal attributes, not physical locations. Use it in the context of self-understanding."},{"incorrect":"✗ He is very self-mapped.","correct":"✓ He is very self-aware.","note":"'Self-mapped' is not a common adjective. Use 'self-aware' or 'self-knowledgeable' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["self-mapping (noun/adjective)"],"related_terms":["self-awareness","self-knowledge","self-concept","cognitive map","mind map","introspection","self-reflection","personal development","identity formation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning materials)","frequency_google_ngram":"Low frequency (Relatively uncommon term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-map' is a conceptual term that refers to creating a mental representation of oneself, including one's personality, values, and experiences. It involves a deep understanding of one's own identity and can be used as a tool for personal growth and self-discovery. The term is not commonly used in everyday conversation but is more prevalent in psychology and self-help literature."},"example_sentences":[{"sentence":"The therapist guided her through the process of creating a self-map to better understand her emotional triggers.","translation":"セラピストは、彼女の感情的な引き金をより良く理解するために、自己地図を作成するプロセスを指導しました。","type":"noun","meaning_category":"自己認識マップ"},{"sentence":"By self-mapping his skills and interests, he was able to choose a more fulfilling career path.","translation":"自分のスキルと興味を自己地図化することで、彼はより充実したキャリアパスを選ぶことができました。","type":"verb","meaning_category":"自己を地図化する"},{"sentence":"Her self-map revealed a strong need for creativity and connection with others.","translation":"彼女の自己地図は、創造性と他人とのつながりに対する強い欲求を明らかにしました。","type":"noun","meaning_category":"自己認識マップ"},{"sentence":"The exercise involved self-mapping our fears and anxieties to identify their root causes.","translation":"その演習では、恐怖と不安の根本原因を特定するために、それらを自己地図化することが含まれていました。","type":"verb","meaning_category":"自己を地図化する"}]}