{"word":"Superhumanness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超人的な性質、超人的な能力、人間を超越した状態","english_definition":"The state or quality of being superhuman; possessing abilities or qualities beyond those of ordinary humans.","examples":[{"sentence":"The superhero's superhumanness allowed him to fly and lift incredible weights.","translation":"そのスーパーヒーローの超人的な能力によって、彼は空を飛び、信じられないほどの重さを持ち上げることができた。"},{"sentence":"The concept of superhumanness has been explored in science fiction for decades.","translation":"超人的な概念は、何十年もの間、サイエンスフィクションで探求されてきた。"},{"sentence":"Achieving superhumanness through technology is a common theme in transhumanist thought.","translation":"テクノロジーを通じて超人的な能力を獲得することは、トランスヒューマニズム思想における共通のテーマである。"}],"collocations":["possess superhumanness","achieve superhumanness","demonstrate superhumanness","a sense of superhumanness","the pursuit of superhumanness"],"synonyms":["superhumanity","transcendence","divinity","superiority","exceptionalism"],"antonyms":["humanity","mortality","ordinariness","weakness","frailty"]}],"etymology":{"value":"The word 'superhumanness' is formed by combining 'super-' (meaning 'above' or 'beyond') with 'humanness' (the quality of being human).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈhjuːmənəs/","syllables":"su-per-hu-man-ness"},"inflection":{"noun_plural":"superhumannesses"},"usage_notes":{"explanation":"'Superhumanness' refers to the state of exceeding normal human capabilities, whether physically, mentally, or morally. It is often used in the context of fictional characters like superheroes or in philosophical discussions about the potential for humans to evolve or enhance themselves beyond their current limitations. The term can also imply a sense of detachment from or transcendence of typical human experiences and emotions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed superhumanness strength.","correct":"✓ He showed superhuman strength.","note":"'Superhumanness' is a noun referring to the state or quality, while 'superhuman' is an adjective describing something that possesses that quality. Use 'superhuman' to describe the strength itself. "},{"incorrect":"✗ The superhumanness of the hero saved the day.","correct":"✓ The superhuman abilities of the hero saved the day.","note":"While 'superhumanness' is grammatically correct, it can sound awkward. It's often more natural to use 'superhuman abilities' or 'superhuman powers' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["superhuman (adjective, noun)","human (adjective, noun)","humanness (noun)"],"related_concepts":["transhumanism","posthumanism","superhumanity","superpowers","evolution","artificial intelligence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superhumanness' is a relatively uncommon and abstract noun. It is typically encountered in philosophical, scientific, or fictional contexts that explore the potential for humans to exceed their natural limitations. Understanding this word requires a grasp of the prefix 'super-' and the concept of 'humanness,' as well as an ability to engage with theoretical or speculative ideas. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The novel explores the ethical implications of achieving superhumanness through genetic engineering.","translation":"その小説は、遺伝子工学を通じて超人的な能力を獲得することの倫理的な意味合いを探求している。","type":"general","meaning_category":"超人的な性質"},{"sentence":"Her dedication to helping others was seen as a form of moral superhumanness.","translation":"彼女の他人を助けることへの献身は、道徳的な超人的な行為の一形態と見なされた。","type":"general","meaning_category":"超人的な性質"},{"sentence":"The athlete's incredible speed and strength seemed to defy the limits of human capability, bordering on superhumanness.","translation":"そのアスリートの信じられないほどのスピードと力は、人間の能力の限界を覆すように見え、超人的な領域に近づいていた。","type":"general","meaning_category":"超人的な能力"}]}