{"word":"antichretic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律) 抵当権付きの、抵当権設定の","english_definition":"(law) Relating to or constituting an antichresis.","examples":[{"sentence":"The antichretic agreement specified that the creditor would receive the fruits of the land in lieu of interest.","translation":"その抵当権設定契約では、債権者は利息の代わりに土地の収穫物を受け取ることが明記されていた。"}],"collocations":["antichretic contract","antichretic pledge","antichretic security"],"synonyms":["mortgage-related","pledged","encumbered"],"antonyms":["unencumbered","free","unpledged"]}],"etymology":{"value":"Derived from the term 'antichresis,' which comes from Greek 'anti' (instead of) and 'chresis' (use, enjoyment), indicating the use of property's fruits instead of interest payments.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈkretɪk/","syllables":"an-ti-chre-tic"},"inflection":{"notes":"This word primarily functions as an adjective and does not have common inflections."},"usage_notes":{"explanation":"'Antichretic' is a legal term, specifically referring to an agreement where a debtor transfers possession of property to a creditor, allowing the creditor to use the property and collect its fruits or income in lieu of interest on the debt. This term is primarily used in legal contexts and is not commonly encountered in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an antichretic investment in the stock market.","correct":"✓ He entered into an antichretic agreement with the lender.","note":"'Antichretic' relates to a specific type of security agreement involving property use, not general investments."},{"incorrect":"✗ The antichretic feeling between them was palpable.","correct":"✗ The animosity between them was palpable.","note":"'Antichretic' is not related to feelings or emotions; it's a legal term."}],"priority":"★☆☆"},"related_words":{"derivatives":["antichresis (noun): The legal agreement itself where property is used in lieu of interest.)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Legal Term)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'antichretic' is a highly specialized legal term referring to a specific type of agreement where property is used in lieu of interest payments. It is not part of general vocabulary and is primarily used within legal discussions and documentation. Understanding requires knowledge of legal concepts related to debt, security, and property rights."},"example_sentences":[{"sentence":"The lawyer explained the terms of the antichretic mortgage to his client.","translation":"弁護士は、抵当権設定された住宅ローンの条件を顧客に説明した。","type":"adjective","meaning_category":"抵当権付きの"},{"sentence":"Under the antichretic arrangement, the landlord collected rent from the tenants instead of receiving interest payments.","translation":"抵当権設定契約に基づき、家主は利息の支払いを受ける代わりに、テナントから家賃を徴収した。","type":"adjective","meaning_category":"抵当権設定の"}]}