{"word":"antiprism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ねじれ角柱、反角柱","english_definition":"A polyhedron composed of two parallel identical polygons, connected by an alternating band of triangles.","examples":[{"sentence":"An antiprism has two congruent parallel faces that are polygons.","translation":"反角柱は、多角形である二つの合同な平行な面を持ちます。"},{"sentence":"The triangular antiprism is also known as an octahedron.","translation":"三角反角柱は、正八面体としても知られています。"}],"collocations":["triangular antiprism (三角反角柱)","square antiprism (四角反角柱)","pentagonal antiprism (五角反角柱)"],"synonyms":["polyhedron","polytope"],"antonyms":["prism"]},{"part_of_speech":"noun","definition":"(より一般的に) 2つの合同な平行な多角形底面と、それらを繋ぐ三角形の側面を持つ多面体","english_definition":"(More generally) A polyhedron with two congruent parallel polygonal bases connected by triangular faces.","examples":[{"sentence":"Antiprisms are a type of prismatoid.","translation":"反角柱は、柱体の一種です。"}],"collocations":["regular antiprism (正反角柱)","uniform antiprism (一様反角柱)"],"synonyms":["prismatoid"],"antonyms":[]}],"etymology":{"value":"'Anti-' (opposite) + 'prism.' The 'anti-' prefix refers to the twisted orientation of the triangular faces compared to a prism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæntɪˌprɪzəm/","syllables":"an-ti-pri-sm"},"inflection":{"noun_plural":"antiprisms"},"usage_notes":{"explanation":"An antiprism is a type of polyhedron characterized by two parallel and congruent polygonal bases connected by triangles. The triangles alternate in orientation, unlike prisms where the connecting faces are rectangles or parallelograms. Antiprisms are often described by the shape of their base, such as a triangular antiprism or a square antiprism. A regular antiprism has regular polygons as bases and equilateral triangles as connecting faces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Antiprism is a type of prism.","correct":"✓ Antiprism is related to prism, but the side faces are triangles.","note":"Antiprisms are related to prisms, but they are distinct geometric shapes. The key difference lies in the side faces: antiprisms have triangles, while prisms have rectangles or parallelograms."}],"priority":"★★☆"},"related_words":{"derivatives":["antiprismatic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'antiprism' refers to a specific type of three-dimensional geometric shape in mathematics. Understanding this term requires familiarity with basic geometric concepts such as polyhedra, polygons, and prisms. The defining characteristic of an antiprism is its two parallel and congruent polygonal bases connected by alternating triangles. It is a more advanced concept typically encountered in geometry or mathematics courses.","priority":"★★☆"},"example_sentences":[{"sentence":"The geometry student studied the properties of the square antiprism.","translation":"その幾何学の学生は、正四角反角柱の特性を研究しました。","type":"noun","meaning_category":"幾何学"},{"sentence":"The molecular structure resembled a hexagonal antiprism.","translation":"その分子構造は、六角反角柱に似ていました。","type":"noun","meaning_category":"科学"}]}