{"word":"tear-misty","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"涙でかすんだ、涙が目にいっぱいになった","english_definition":"Blurred or dimmed by tears; having eyes filled with tears.","examples":[{"sentence":"Her eyes were tear-misty as she watched the scene unfold.","translation":"彼女がその場面の展開を見守るうちに、目に涙があふれてかすんだ。"},{"sentence":"A tear-misty gaze reflected the sadness in her heart.","translation":"涙でかすんだ視線が、彼女の心の悲しみを映し出していた。"}],"collocations":["tear-misty eyes","tear-misty gaze","tear-misty vision"],"synonyms":["tearful","misty-eyed","lachrymose","weepy","sad-eyed"],"antonyms":["dry-eyed","clear-eyed","unemotional","stoic"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'tear' (referring to the liquid secreted from the eyes) and 'misty' (resembling mist, blurred, or dimmed). The combination suggests a state where tears cause a blurring or dimming effect on vision.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərˌmɪsti/","syllables":"tear-mis-ty"},"inflection":{"notes":"Adjective, does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Tear-misty' is a descriptive adjective used to convey a specific emotional state. It suggests that someone is on the verge of crying or has tears welling up in their eyes, causing their vision to be slightly blurred. It is often used in literature or descriptive writing to evoke empathy or convey sadness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tear-misty air made it hard to see.","correct":"✓ The misty air made it hard to see.","note":"'Tear-misty' refers specifically to eyes blurred by tears, not to the general atmosphere. Use 'misty' for atmospheric conditions."},{"incorrect":"✗ He was tear-misty after the run.","correct":"✓ He was sweaty after the run.","note":"'Tear-misty' is generally used to describe an emotional state, not a physical one. If someone is physically affected, use a more appropriate adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["tear (noun, verb)","misty (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively rare in general usage)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tear-misty' is a compound adjective that combines 'tear' and 'misty' to describe eyes that are blurred or dimmed by tears. It is typically used in descriptive writing to convey a strong sense of emotion, particularly sadness or sentimentality. The word is not commonly used in everyday conversation but is more often found in literature or poetry. Understanding the individual components ('tear' and 'misty') helps to grasp the overall meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Her tear-misty eyes met his, conveying a depth of emotion that words could not express.","translation":"涙でかすんだ彼女の瞳が彼と出会い、言葉では表現できないほどの深い感情を伝えた。","type":"adjective","meaning_category":"Emotional State"},{"sentence":"The old photograph showed a tear-misty face, a memory of a long-lost love.","translation":"古い写真には涙でかすんだ顔が写っており、それは遠い昔の愛の記憶だった。","type":"adjective","meaning_category":"Description"},{"sentence":"With a tear-misty smile, she waved goodbye.","translation":"涙でかすんだ笑顔で、彼女はさよならを言った。","type":"adjective","meaning_category":"Emotional Expression"}]}