{"word":"Salite","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A rare silicate mineral with the chemical formula (Ca,Na)(Mg,Fe,Al)Si₂O₆, belonging to the pyroxene group.","english_definition":"A rare silicate mineral with the chemical formula (Ca,Na)(Mg,Fe,Al)Si₂O₆, belonging to the pyroxene group.","examples":[{"sentence":"The salite crystal was found in a metamorphic rock formation.","translation":"そのサリ輝石の結晶は変成岩の地層から発見された。"},{"sentence":"Salite is characterized by its green to brownish-green color.","translation":"サリ輝石は緑色から茶色がかった緑色を特徴とする。"}],"collocations":["salite crystal","salite mineral","metamorphic salite"],"synonyms":["augite","diopside","hedenbergite"],"antonyms":[]}],"etymology":{"value":"Named after the Sala River in Ala, Piedmont, Italy, where it was first discovered.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsælaɪt/","syllables":"Sa-lite"},"inflection":{"notes":"It is a noun, so the plural form is 'salites'."},"usage_notes":{"explanation":"Salite is a relatively rare mineral, primarily of interest to mineralogists and geologists. It is a member of the pyroxene group and is chemically similar to augite, diopside, and hedenbergite. It is typically found in metamorphic and igneous rocks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Salite is a type of gemstone.","correct":"✓ Salite is a silicate mineral.","note":"Salite is a mineral, not typically considered a gemstone."}],"priority":"★☆☆"},"related_words":{"derivatives":["salitic (adjective: relating to or containing salite)"],"related_minerals":["augite","diopside","hedenbergite","pyroxene"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - A specialized term used in mineralogy and geology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Salite is a technical term used in the fields of mineralogy and geology to refer to a specific silicate mineral. It is not a commonly used word and is primarily encountered in scientific literature or specialized discussions related to mineral identification and classification. Understanding the term requires familiarity with basic mineralogical concepts and chemical formulas.","priority":"★☆☆"},"example_sentences":[{"sentence":"The chemical composition of the salite sample was analyzed using X-ray diffraction.","translation":"サリ輝石の試料の化学組成は、X線回折法を用いて分析された。","type":"scientific","meaning_category":"mineralogy"},{"sentence":"Salite is often found in association with other pyroxene minerals.","translation":"サリ輝石は、他の輝石鉱物と共に見られることが多い。","type":"geological","meaning_category":"mineralogy"}]}