{"word":"non-inquisitorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非尋問的な、質問攻めではない","english_definition":"Not characterized by or relating to an inquisitorial system; not involving aggressive questioning or interrogation.","examples":[{"sentence":"The interview was conducted in a non-inquisitorial manner, focusing on open-ended questions.","translation":"そのインタビューは非尋問的な方法で実施され、自由回答形式の質問に焦点が当てられた。"},{"sentence":"The judge adopted a non-inquisitorial approach, allowing both sides to present their cases without interruption.","translation":"裁判官は非尋問的なアプローチを採用し、両陣営が中断されることなくそれぞれの主張を提示することを許可した。"},{"sentence":"The therapist used a non-inquisitorial style to encourage the patient to share their feelings.","translation":"セラピストは非尋問的なスタイルを用いて、患者が自分の気持ちを共有するように促した。"}],"collocations":["non-inquisitorial approach","non-inquisitorial method","non-inquisitorial system","non-inquisitorial style","non-inquisitorial process","non-inquisitorial inquiry"],"synonyms":["non-interrogative","non-coercive","gentle","persuasive","open-ended","collaborative"],"antonyms":["inquisitorial","interrogative","coercive","aggressive","probing","intrusive"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'inquisitorial'. 'Inquisitorial' itself comes from 'inquisition', referring to a formal inquiry or investigation, often associated with aggressive questioning.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn ɪnˌkwɪzɪˈtɔːriəl/","syllables":"non-in-quis-i-to-ri-al"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-inquisitorial' describes a process or method that avoids aggressive or overly direct questioning. It emphasizes a more collaborative, open, and less confrontational approach to gathering information or conducting an inquiry. It is often used in contexts such as interviews, legal proceedings, and therapeutic settings where building trust and encouraging voluntary participation are important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process was very non-inquisitorial, it was like an interrogation.","correct":"✓ The process was very non-inquisitorial; it was more like a conversation.","note":"The first sentence is contradictory. If a process is non-inquisitorial, it cannot be like an interrogation, which is the opposite. A non-inquisitorial process is gentle and collaborative."},{"incorrect":"✗ The non-inquisitorial police were very aggressive.","correct":"✓ The police adopted a non-inquisitorial approach, which was less aggressive.","note":"It's the *approach* or *method* that is non-inquisitorial, not the police themselves. The second sentence is better because it describes the police using a less aggressive approach."}],"priority":"★★☆"},"related_words":{"derivatives":["inquisitorial (adjective)","inquisition (noun)","inquisitor (noun)"],"phrases":["non-inquisitorial justice system","non-inquisitorial legal system"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-inquisitorial' is a formal term, primarily used in legal, academic, or professional contexts. It describes an approach that avoids aggressive or overly direct questioning. Understanding this word requires familiarity with the concept of 'inquisition' and the prefix 'non-'. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The mediation process was designed to be non-inquisitorial, encouraging open communication between the parties.","translation":"調停プロセスは非尋問的になるように設計されており、当事者間のオープンなコミュニケーションを促進している。","type":"adjective","meaning_category":"非尋問的な"},{"sentence":"The investigation adopted a non-inquisitorial approach to gather information without intimidating witnesses.","translation":"その調査は、証人を脅迫することなく情報を収集するために、非尋問的なアプローチを採用した。","type":"adjective","meaning_category":"非尋問的な"},{"sentence":"The company implemented a non-inquisitorial feedback system to encourage employees to share their concerns openly.","translation":"会社は、従業員が懸念事項をオープンに共有できるように、非尋問的なフィードバックシステムを導入した。","type":"adjective","meaning_category":"非尋問的な"}]}