{"word":"nonsuggestion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"示唆しないこと、提案しないこと、暗示しないこと","english_definition":"The act of not suggesting something; the absence of suggestion.","examples":[{"sentence":"The therapist practiced nonsuggestion, allowing the patient to arrive at their own conclusions.","translation":"セラピストは非示唆を実践し、患者が自分で結論に達することを許容した。"},{"sentence":"The article was careful in its nonsuggestion of any particular solution to the problem.","translation":"その記事は、問題に対する特定の解決策を一切示唆しないように注意していた。"}],"collocations":["practice nonsuggestion (非示唆を実践する)","careful nonsuggestion (慎重な非示唆)"],"synonyms":["abstention from suggestion","avoidance of implication"],"antonyms":["suggestion","implication","hint"]}],"etymology":{"value":"\"non-\" (否定) + \"suggestion\" (示唆、提案)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnsəˈdʒestʃən/","syllables":"non-suh-ges-chun"},"inflection":{"noun_plural":"nonsuggestions"},"usage_notes":{"explanation":"\"Nonsuggestion\" refers to the deliberate avoidance of making suggestions or providing hints, often in contexts where it's important for someone to reach their own conclusions or make their own choices. It is the opposite of suggestion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used nonsuggestion to trick her.","correct":"✓ He used deception to trick her.","note":"Nonsuggestion is about avoiding suggestion, not actively tricking someone. Use \"deception\" or a similar word for trickery."}],"priority":"★☆☆"},"related_words":{"derivatives":["suggest","suggestion","suggestive"],"antonyms":["suggestion","hint","implication"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonsuggestion\" is a formal term indicating the act of deliberately avoiding making suggestions or hints. It's often used in therapeutic or analytical contexts where impartiality is crucial. The word itself is formed by adding the prefix \"non-\" to \"suggestion,\" making its meaning relatively straightforward, but its usage is typically found in more sophisticated discussions."},"example_sentences":[{"sentence":"The interviewer maintained a policy of nonsuggestion to avoid influencing the candidate's responses.","translation":"面接官は、候補者の回答に影響を与えないように、非示唆の方針を維持した。","type":"noun","meaning_category":"avoidance of suggestion"},{"sentence":"The teacher's nonsuggestion allowed the students to explore the topic freely.","translation":"教師の非示唆により、生徒たちは自由にトピックを探求することができた。","type":"noun","meaning_category":"absence of suggestion"}]}