{"word":"Sargos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に地中海で見られる) スパルスの魚の一種","english_definition":"A type of seabream fish (Diplodus sargus) found mainly in the Mediterranean Sea.","examples":[{"sentence":"We caught a sargos while fishing near the coast.","translation":"海岸近くで釣りをしているときにサルゴスを捕まえた。"},{"sentence":"Sargos is a popular fish for grilling in Mediterranean cuisine.","translation":"サルゴスは地中海料理でグリルにする人気の魚です。"}],"collocations":["catch a sargos","grill sargos","sargos fishing","Mediterranean sargos"],"synonyms":["seabream","diplodus sargus"],"antonyms":[]}],"etymology":{"value":"The name 'sargos' likely originates from a Mediterranean language, possibly related to the Latin 'sargus' or a similar term used to describe this type of fish. The exact etymology is not definitively known, but it is associated with the region where the fish is commonly found.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsɑːrɡɒs/","syllables":"Sar-gos"},"inflection":{"noun_plural":"sargos (usually unchanged in plural)"},"usage_notes":{"explanation":"'Sargos' primarily refers to the fish species Diplodus sargus. It is a specific term and not commonly used outside of contexts related to Mediterranean fishing, cuisine, or marine biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a delicious sargos yesterday. (unclear)","correct":"✓ I ate a delicious sargos dish yesterday.","note":"It's better to specify that you ate a 'sargos dish' rather than just 'sargos' to make it clear you consumed the fish as food."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Diplodus (genus)","Diplodus annularis (Annular seabream)","Sparidae (family)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very specific term)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Sargos' is a specialized term referring to a specific type of fish, Diplodus sargus, found mainly in the Mediterranean Sea. Its usage is limited to contexts involving Mediterranean cuisine, fishing, or marine biology. Due to its specificity, it is not a common word and would primarily be encountered by those with a particular interest in these areas."},"example_sentences":[{"sentence":"The restaurant specializes in fresh sargos caught daily.","translation":"そのレストランは毎日捕れた新鮮なサルゴスを専門にしている。","type":"noun","meaning_category":"fish species"},{"sentence":"Fishermen often target sargos near rocky coastal areas.","translation":"漁師は岩の多い沿岸地域でサルゴスを狙うことが多い。","type":"noun","meaning_category":"fish species"}]}