{"word":"gammadion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"卍（まんじ）; 鉤十字（かぎじゅうじ）; 逆卍（ぎゃくまんじ）","english_definition":"A swastika or swastika-like figure.","examples":[{"sentence":"The gammadion is an ancient symbol found in many cultures.","translation":"卍は多くの文化で見られる古代のシンボルです。"},{"sentence":"Before its appropriation by the Nazi party, the gammadion was a symbol of good fortune.","translation":"ナチス党に利用される前、卍は幸運のシンボルでした。"}],"collocations":["ancient gammadion","cultural gammadion"],"synonyms":["swastika","fylfot","tetragammadion"],"antonyms":[]}],"etymology":{"value":"From Late Latin gammadion, from Ancient Greek γαμμάδιον (gammádion), diminutive of γάμμα (gámma, “gamma”), because it is formed from four capital gammas.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡæˈmeɪdiən/","syllables":"gam-ma-di-on"},"inflection":{"noun_plural":"gammadions"},"usage_notes":{"explanation":"The term \"gammadion\" is sometimes used to refer to swastika-like figures, especially in historical or archaeological contexts, to avoid the negative connotations associated with the swastika due to its use by the Nazi party. It's important to be sensitive to the context when using this term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a gammadion as a symbol of hate.","correct":"✓ He wore a swastika as a symbol of hate.","note":"In modern contexts, especially when referring to Nazi symbolism, \"swastika\" is the more appropriate and widely understood term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"gammadion\" is a relatively obscure term primarily used in historical or archaeological contexts to refer to a swastika-like symbol, often to avoid the negative connotations of the term \"swastika.\" It derives from the Greek letter gamma, as the symbol is composed of four gammas. Its use is highly specialized.","priority":"★★☆"},"example_sentences":[{"sentence":"Archaeologists discovered a gammadion on an ancient pottery shard.","translation":"考古学者は古代の陶器の破片に卍を発見しました。","type":"noun","meaning_category":"symbol"},{"sentence":"The gammadion was a common motif in pre-Christian European art.","translation":"卍はキリスト教以前のヨーロッパ美術で一般的なモチーフでした。","type":"noun","meaning_category":"motif"}]}