{"word":"nontruancy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非行の欠如、不登校でないこと","english_definition":"The state of not being truant; consistent attendance, especially at school.","examples":[{"sentence":"The school implemented a program to encourage nontruancy among its students.","translation":"学校は生徒の不登校を防ぐためのプログラムを実施した。"},{"sentence":"Nontruancy is a key factor in academic success.","translation":"不登校でないことは学業の成功における重要な要素である。"}],"collocations":["promote nontruancy","encourage nontruancy","increase nontruancy","nontruancy policy","nontruancy program"],"synonyms":["attendance","presence","regular attendance"],"antonyms":["truancy","absenteeism","skipping school"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'truancy'. 'Truancy' itself comes from 'truant', which has origins in Old French, meaning a beggar or vagabond.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈtruːənsi/","syllables":"non-tru-an-cy"},"inflection":{"noun_plural":"nontruancies (rarely used in plural form)"},"usage_notes":{"explanation":"'Nontruancy' is a relatively uncommon word, primarily used in educational or legal contexts. It emphasizes the positive aspect of consistent attendance rather than the negative aspect of skipping school. It is often used when discussing policies or programs designed to improve school attendance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nontruancy of the students were impressive.","correct":"✓ The nontruancy of the student was impressive.","note":"'Nontruancy' is generally treated as a singular, uncountable noun, referring to the general state of not being truant, so use a singular verb. However, 'nontruancies' can be used to refer to specific instances of not being truant, although this is rare."}],"priority":"★★☆"},"related_words":{"derivatives":["non-truant (adjective, describing someone who is not truant)"],"related_terms":["truant (noun, adjective)","truancy (noun)","attendance (noun)","absenteeism (noun)"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively rare word, more common in academic or policy discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nontruancy' is a formal term that means the opposite of 'truancy' (skipping school without permission). It is used in discussions about education policies and student attendance. It is not a commonly used word in everyday conversation. Understanding the prefix 'non-' and the word 'truancy' helps in understanding its meaning."},"example_sentences":[{"sentence":"The school's nontruancy initiative has significantly improved attendance rates.","translation":"学校の不登校対策イニシアチブは、出席率を大幅に改善した。","type":"general","meaning_category":"attendance improvement"},{"sentence":"Parents play a crucial role in fostering nontruancy among their children.","translation":"親は子供たちの不登校を防ぐ上で重要な役割を果たす。","type":"parental involvement","meaning_category":"parental responsibility"},{"sentence":"The study examined the factors that contribute to nontruancy in urban schools.","translation":"その研究は、都市部の学校における不登校の要因を調査した。","type":"academic study","meaning_category":"research"}]}