{"word":"mortices","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(木工)ほぞ穴 (mortise の複数形)","english_definition":"plural form of mortise: a hole cut in a piece of wood or other material to receive a tenon, tongue, or similar projection, so as to form a joint.","examples":[{"sentence":"The carpenter carefully cut the mortices to ensure a tight fit.","translation":"その大工は、ぴったり合うように注意深くほぞ穴を切った。"}],"collocations":["cut mortices","fit mortices","deep mortices","shallow mortices"],"synonyms":["holes","recesses","slots","sockets"],"antonyms":["tenons"]},{"part_of_speech":"verb","definition":"(木工)ほぞ穴を作る (mortise の三人称単数現在)","english_definition":"third-person singular simple present indicative form of mortise: to cut a mortise in (a piece of wood, etc.).","examples":[{"sentence":"He mortices the frame to prepare it for the panel.","translation":"彼はパネルを取り付けるためにフレームにほぞ穴を作る。"}],"collocations":["mortices a frame","mortices a joint"],"synonyms":["cuts","carves","makes"],"antonyms":["tenons"]}],"etymology":{"value":"Derived from Old French 'mortaise', meaning 'socket for a beam', which is of uncertain origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔːrtɪsɪz/","syllables":"mor-ti-ces"},"inflection":{"noun_plural":"mortices","verb_third_person_singular":"mortices"},"usage_notes":{"explanation":"'Mortices' is primarily used in woodworking contexts to refer to the holes that receive tenons to form strong joints. It's a technical term, less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used mortices instead of screws.","correct":"✓ He used mortise and tenon joints instead of screws.","note":"'Mortices' refers to the holes, not the entire joint. Use 'mortise and tenon joints' to describe the complete joint. "},{"incorrect":"✗ The mortices were too big for the wood.","correct":"✓ The mortises were too big for the tenons.","note":"The mortices are holes, so they can't be too big for the wood itself, but they can be too big for the tenons that are supposed to fit into them."}],"priority":"★★☆"},"related_words":{"derivatives":["mortise (noun, verb)","mortiser (noun: a machine for cutting mortises)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mortices' is a technical term specific to woodworking, referring to the holes cut to receive tenons in a mortise and tenon joint. Understanding this term requires familiarity with woodworking techniques and vocabulary. It is not commonly used outside of this context."},"example_sentences":[{"sentence":"The cabinet maker carefully crafted the mortices to ensure the stability of the structure.","translation":"その家具職人は構造の安定性を確保するために注意深くほぞ穴を作った。","type":"noun","meaning_category":"ほぞ穴"},{"sentence":"He mortices each piece of the frame with precision.","translation":"彼はフレームの各部分に正確にほぞ穴を作る。","type":"verb","meaning_category":"ほぞ穴を作る"}]}