{"word":"Quinisextine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(教会史において) 五位公会議および六位公会議の","english_definition":"Relating to the Quinisext Council, also known as the Council in Trullo.","examples":[{"sentence":"The Quinisextine canons addressed various disciplinary matters within the Church.","translation":"五位六位公会議の教会法は、教会内の様々な懲戒問題を取り扱った。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(教会史において) 五位公会議および六位公会議","english_definition":"The Quinisext Council, also known as the Council in Trullo, held in 692 AD in Constantinople.","examples":[{"sentence":"The Quinisextine Council was convened to address issues left unresolved by the Fifth and Sixth Ecumenical Councils.","translation":"五位六位公会議は、第五および第六全地公会議によって未解決のまま残された問題に対処するために開催された。"}],"collocations":[],"synonyms":["Council in Trullo"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'quinus' (fifth) and 'sextus' (sixth), referring to the fact that this council supplemented the Fifth and Sixth Ecumenical Councils.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɪnɪˈsɛkstaɪn/","syllables":"quin-i-sex-tine"},"inflection":{},"usage_notes":{"explanation":"The term 'Quinisextine' specifically refers to the council held in Trullo in 692 AD, which aimed to provide canons and disciplinary rules that the Fifth and Sixth Ecumenical Councils had not explicitly addressed. It is primarily used in historical and theological contexts when discussing the development of canon law in the Eastern Orthodox Church.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Quinisext Council","Council in Trullo"],"related_terms":["Canon law","Ecumenical council","Eastern Orthodox Church"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Quinisextine' is highly specialized and primarily used in the context of Church history and canon law. Understanding requires familiarity with the history of the Ecumenical Councils and the development of Christian doctrine and practice. It is unlikely to be encountered outside of academic or theological discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Quinisextine Council's decisions are still influential in Eastern Orthodox canon law.","translation":"五位六位公会議の決定は、東方正教会の教会法において今も影響力がある。","type":"adjective","meaning_category":"(教会史において) 五位公会議および六位公会議の"},{"sentence":"The canons of the Quinisextine Council addressed issues such as clerical marriage and liturgical practices.","translation":"五位六位公会議の教会法は、聖職者の結婚や典礼の慣習などの問題を取り扱った。","type":"noun","meaning_category":"(教会史において) 五位公会議および六位公会議"}]}