{"word":"abridgement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"要約、短縮、省略","english_definition":"A shortened version of a written or spoken work. The act of shortening something.","examples":[{"sentence":"This book is an abridgement of the original novel.","translation":"この本は原作小説の要約版です。"},{"sentence":"The abridgement of the report made it easier to understand.","translation":"報告書の要約により、理解しやすくなりました。"},{"sentence":"Due to time constraints, an abridgement of the speech was necessary.","translation":"時間的制約のため、スピーチの短縮が必要でした。"}],"collocations":["an abridgement of a book","an abridgement of a speech","a skillful abridgement","a faithful abridgement"],"synonyms":["summary","abstract","digest","condensation","shortening","truncation"],"antonyms":["expansion","extension","enlargement","elaboration"]}],"etymology":{"value":"Derived from the Middle English word 'abridgement,' which comes from the Old French 'abrigement.' Ultimately, it originates from the Latin word 'abbreviare,' meaning 'to shorten.'","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbrɪdʒmənt/","syllables":"a-bridg-ment"},"inflection":{"noun_plural":"abridgements"},"usage_notes":{"explanation":"'Abridgement' refers to a shortened version of a text or speech, retaining the essential points while omitting less important details. It can also refer to the act of shortening something. It's often used when a longer work needs to be made more concise for easier comprehension or due to time limitations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The abridgement was too abridged, and I couldn't understand it.","correct":"✓ The abridgement was too brief, and I couldn't understand it.","note":"Avoid using the word 'abridged' to describe the abridgement itself. Use synonyms like 'brief' or 'short' instead."},{"incorrect":"✗ I made an abridgement of my vacation photos.","correct":"✓ I made a selection of my vacation photos.","note":"'Abridgement' is typically used for written or spoken works, not for collections of images. Use 'selection' or 'compilation' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["abridge (verb)","abridged (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'abridgement' is a formal term that refers to a shortened version of a longer piece of writing or speech. It implies that the original work has been condensed while retaining the most important information. This word is more commonly used in academic or literary contexts rather than everyday conversation. It is important to distinguish it from simpler terms like 'summary' or 'short version,' as 'abridgement' often suggests a more careful and deliberate process of shortening the original work."},"example_sentences":[{"sentence":"The publisher released an abridgement of the classic novel for younger readers.","translation":"出版社は、若い読者向けに古典小説の要約版を発売しました。","type":"noun","meaning_category":"要約版"},{"sentence":"An abridgement of the conference proceedings was published online.","translation":"会議議事録の要約がオンラインで公開されました。","type":"noun","meaning_category":"要約"},{"sentence":"The editor made an abridgement of the manuscript to meet the word count.","translation":"編集者は、字数制限を満たすために原稿を短縮しました。","type":"noun","meaning_category":"短縮"}]}