{"word":"Coroplast","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"段ボールプラスチック、中空構造のポリプロピレンシート","english_definition":"A brand name for corrugated plastic; a lightweight but rigid plastic sheet with a fluted or corrugated structure, similar in appearance to cardboard.","examples":[{"sentence":"Coroplast is often used for making signs.","translation":"コ​​ロプラストは、看板を作るためによく使用されます。"},{"sentence":"I used Coroplast to build a lightweight enclosure.","translation":"軽量のエンクロージャーを構築するために、コ​​ロプラストを使用しました。"}],"collocations":["Coroplast sign","Coroplast sheet","build with Coroplast"],"synonyms":["corrugated plastic","fluted plastic sheet","twin-wall plastic sheet"],"antonyms":[]}],"etymology":{"value":"A trademarked name, likely a portmanteau of \"corrugated\" and \"plastic\".","priority":"★★★"},"pronunciation":{"ipa":"ˈkɔːrəˌplæst","syllables":"cor-o-plast"},"inflection":{"noun_plural":"Coroplasts"},"usage_notes":{"explanation":"\"Coroplast\" is a specific brand name, but it's often used generically to refer to any corrugated plastic sheet, similar to how \"Kleenex\" is used for facial tissues. It's known for being lightweight, waterproof, and durable, making it suitable for both indoor and outdoor applications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy some coroplasts for the project.","correct":"✓ I need to buy some Coroplast for the project.","note":"While \"Coroplasts\" is technically the plural, it's more common to say \"some Coroplast\" or \"Coroplast sheets\"."},{"incorrect":"✗ Coroplast is as strong as metal.","correct":"✓ Coroplast is strong for its weight.","note":"Coroplast is lightweight and relatively strong considering its weight, but it's not as strong as metal."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Coroplast\" is a specific type of plastic sheet that is lightweight and durable. It is often used for making signs and displays. The word itself is a brand name, but it is often used to refer to any similar type of corrugated plastic. Because it is a specialized term, it is not commonly used in everyday conversation, but it is useful to know if you work in fields like printing, signage, or construction."},"example_sentences":[{"sentence":"The political campaign used hundreds of Coroplast signs.","translation":"その政治キャンペーンは、数百枚のコ​​ロプラスト看板を使用しました。","type":"noun","meaning_category":"Material"},{"sentence":"He designed a custom enclosure using Coroplast sheets.","translation":"彼はコ​​ロプラストシートを使用してカスタムエンクロージャーを設計しました。","type":"noun","meaning_category":"Material"},{"sentence":"Coroplast is a popular choice for temporary outdoor signage.","translation":"コ​​ロプラストは、一時的な屋外看板として人気があります。","type":"noun","meaning_category":"Material"}]}