{"word":"translatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"翻訳の、翻訳に関する","english_definition":"Relating to or effecting translation.","examples":[{"sentence":"The translatory process involves more than just word-for-word substitution.","translation":"翻訳のプロセスは、単なる単語の置き換え以上のものを伴います。"},{"sentence":"Translatory research aims to bridge the gap between basic science and clinical practice.","translation":"橋渡し研究は、基礎科学と臨床診療の間のギャップを埋めることを目指しています。"}],"collocations":["translatory motion","translatory research","translatory process"],"synonyms":["translational","interpretive"],"antonyms":[]}],"etymology":{"value":"From the Latin 'translatorius', pertaining to translation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrænzləˌtɔːri/","syllables":"trans-la-to-ry"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Translatory' is often used in technical or academic contexts to describe processes or research that involve translation or the transfer of knowledge from one area to another. It is less common in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The translatory machine automatically translated the document.","correct":"✓ The translation machine automatically translated the document.","note":"'Translation' is more common than 'translatory' when referring to a machine or tool used for translating."}],"priority":"★☆☆"},"related_words":{"derivatives":["translate","translation","translator"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'translatory' is a relatively uncommon adjective that describes something related to translation. It is often used in academic or technical contexts, particularly in discussions of research or processes that involve transferring knowledge or information from one form or context to another. Because of its specialized use, it is more likely to be encountered in formal writing or scholarly discussions than in everyday conversation."},"example_sentences":[{"sentence":"The study focused on the translatory aspects of gene therapy.","translation":"その研究は、遺伝子治療の翻訳的側面に焦点を当てていた。","type":"adjective","meaning_category":"翻訳の、翻訳に関する"},{"sentence":"Effective translatory strategies are crucial for disseminating research findings.","translation":"効果的な翻訳戦略は、研究結果を普及させるために不可欠である。","type":"adjective","meaning_category":"翻訳の、翻訳に関する"}]}