{"word":"Grue","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にファンタジー作品で)人を食べる恐ろしい怪物","english_definition":"(chiefly in fantasy fiction) a terrifying monster that eats people.","examples":[{"sentence":"Beware the Grue, for it lurks in the darkness.","translation":"Grueに気をつけろ、それは暗闇に潜んでいる。"},{"sentence":"The adventurers were ambushed by a Grue in the underground cave.","translation":"冒険者たちは地下の洞窟でGrueに待ち伏せされた。"}],"collocations":["lurking Grue","hungry Grue","avoid the Grue"],"synonyms":["monster","beast","creature","goblin"],"antonyms":[]},{"part_of_speech":"noun","definition":"(哲学で)「緑色であると観測された、または、t時以前に観測された青色である」という述語","english_definition":"(in philosophy) a predicate that applies to all things examined before a certain time t just in case they are green but to other things just in case they are blue.","examples":[{"sentence":"The 'grue' paradox challenges our understanding of induction.","translation":"「grue」のパラドックスは、帰納に関する我々の理解に挑戦する。"},{"sentence":"'Grue' is a classic example used in discussions of confirmation theory.","translation":"「Grue」は、確証理論の議論で用いられる古典的な例である。"}],"collocations":["the grue paradox","grue predicate","grue theory"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Grue' as a monster originates from the 'Zork' series of interactive fiction computer games, where it is a deadly creature that dwells in dark places. The philosophical use of 'grue' was introduced by Nelson Goodman in his book 'Fact, Fiction, and Forecast' (1955) to illustrate the problem of induction.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡruː/","syllables":"grue"},"inflection":{},"usage_notes":{"explanation":"The word 'Grue' has two distinct meanings. In fantasy, particularly in the context of text-based adventure games like Zork, it refers to a fearsome monster inhabiting dark areas. Philosophically, 'grue' is a technical term coined by Nelson Goodman to explore the problem of induction and projectible predicates. When encountering this word, the context is crucial to understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He saw a grue car.","correct":"✓ He saw a green car.","note":"'Grue' is not a standard adjective for color in everyday language. Use 'green' instead."},{"incorrect":"✗ The grue is always happy.","correct":"✓ The Grue is always hungry.","note":"In fantasy, Grues are typically depicted as dangerous and hungry monsters, not happy creatures."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["induction","predicate","confirmation theory","Hempel's paradox"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency (outside of specific contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Grue' has two distinct and specialized usages. In fantasy literature, particularly related to the Zork series, it denotes a specific type of monster. In philosophy, it is a technical term used in discussions about induction and confirmation theory. Therefore, understanding the context is essential to correctly interpret the meaning of 'Grue.' It is not a commonly used word in general conversation."},"example_sentences":[{"sentence":"The brave knight ventured into the darkness, knowing the Grue might be lurking.","translation":"勇敢な騎士は、Grueが潜んでいるかもしれないと知りながら、暗闇に足を踏み入れた。","type":"noun","meaning_category":"monster"},{"sentence":"Goodman's 'grue' example highlights the challenges of predicting future events based on past observations.","translation":"グッドマンの「grue」の例は、過去の観察に基づいて将来の出来事を予測することの難しさを浮き彫りにする。","type":"noun","meaning_category":"philosophy"}]}