{"word":"ocellar","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"眼状の、眼状紋のある","english_definition":"Having or resembling ocelli (simple eyes or eye-like markings).","examples":[{"sentence":"The butterfly's wings were decorated with ocellar patterns.","translation":"その蝶の羽は眼状の模様で飾られていた。"},{"sentence":"The ocellar spots on the peacock's tail are used for display.","translation":"クジャクの尾にある眼状の斑点は、ディスプレイのために使われる。"}],"collocations":["ocellar spot","ocellar pattern","ocellar marking"],"synonyms":["eye-like","spotted","marked"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"ocellus,\" meaning \"little eye,\" which is a diminutive of \"oculus\" (eye).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒsɪlər/","syllables":"oc-el-lar"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term \"ocellar\" is primarily used in biology and zoology to describe markings or structures that resemble eyes. It is often found in the context of insect morphology or animal coloration, where eye-like spots serve various functions such as camouflage, mimicry, or display.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ocellar was beautiful.","correct":"✓ The ocellar pattern was beautiful.","note":"\"Ocellar\" is an adjective, so it needs to modify a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["ocellus (noun): a simple eye or eye-like marking"],"related_terms":["eye spot","eyespot"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ocellar\" is a technical term primarily used in scientific contexts, specifically in biology and zoology. It describes something that has or resembles ocelli, which are simple eyes or eye-like markings. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The moth displayed intricate ocellar markings on its wings.","translation":"その蛾は翅に複雑な眼状紋様を示していた。","type":"general","meaning_category":"eye-like markings"},{"sentence":"The ocellar arrangement is a key feature in identifying certain species of insects.","translation":"眼状の配置は、特定の昆虫の種類を識別する上で重要な特徴である。","type":"scientific","meaning_category":"biology"}]}