{"word":"sycophantism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"追従、へつらい、太鼓持ち行為","english_definition":"Obsequious flattery; servile behavior towards superiors, especially for personal gain.","examples":[{"sentence":"His sycophantism was obvious to everyone in the office.","translation":"彼の追従はオフィスにいる誰もが気づいていた。"},{"sentence":"Sycophantism is often seen as a negative trait in the workplace.","translation":"追従は職場ではしばしばネガティブな特徴と見なされる。"},{"sentence":"The politician surrounded himself with people known for their sycophantism.","translation":"その政治家は、追従することで知られる人々を自分の周りに集めた。"}],"collocations":["display sycophantism","engage in sycophantism","obvious sycophantism","crass sycophantism"],"synonyms":["flattery","obsequiousness","servility","adulation","fawning","toadyism"],"antonyms":["candor","honesty","frankness","sincerity","integrity"]}],"etymology":{"value":"Derived from 'sycophant,' which comes from the Greek word 'sykophantes,' originally meaning 'informer' or 'false accuser.' The meaning evolved to describe someone who seeks favor through flattery.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪkəfæntɪzəm/","syllables":"sy-co-phan-tism"},"inflection":{"noun_plural":"sycophantisms (rarely used)"},"usage_notes":{"explanation":"'Sycophantism' refers to the practice or behavior of being a sycophant. A sycophant is someone who tries to win favor from wealthy or influential people by flattering them. The term often carries a negative connotation, implying insincerity and a desire for personal gain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed sycophantism to get the job done.","correct":"✓ He used sycophancy to get the job done.","note":"'Sycophantism' is the general practice, while 'sycophancy' can be used more directly to describe the act of flattering. Both are acceptable, but 'sycophancy' might sound more natural in some contexts."},{"incorrect":"✗ Her sycophantism made her many friends.","correct":"✓ Her sycophantism made her few genuine friends.","note":"Sycophantism is generally seen as a negative quality, so it's unlikely to gain someone genuine friends. It might gain them acquaintances or people who want to use them, but not true friends."}],"priority":"★★☆"},"related_words":{"derivatives":["sycophant (noun: a person who acts obsequiously toward someone important in order to gain advantage.)","sycophantic (adjective: behaving or done in an obsequious way in order to gain advantage.)","sycophantically (adverb: in a sycophantic manner)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sycophantism' is a complex word that describes the behavior of someone who excessively flatters others, especially those in positions of power, in order to gain favor or advantage. It implies a lack of sincerity and a focus on personal gain. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or discussions about social dynamics and power structures."},"example_sentences":[{"sentence":"The manager quickly grew tired of the employee's constant sycophantism.","translation":"マネージャーはすぐに、その従業員の絶え間ない追従にうんざりした。","type":"general"},{"sentence":"Sycophantism can create a toxic work environment where genuine feedback is suppressed.","translation":"追従は、本物のフィードバックが抑制される有害な職場環境を生み出す可能性がある。","type":"general"},{"sentence":"The king was surrounded by courtiers whose sycophantism prevented him from seeing the truth.","translation":"王は、追従によって真実を見えなくされた廷臣たちに囲まれていた。","type":"historical"}]}