{"word":"totalitario","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"全体主義の","english_definition":"relating to a system of government that is centralized and dictatorial and requires complete subservience to the state.","examples":[{"sentence":"Un régimen totalitario.","translation":"全体主義体制。"},{"sentence":"El estado totalitario controla todos los aspectos de la vida.","translation":"全体主義国家は生活のあらゆる側面を管理する。"}],"collocations":["régimen totalitario (全体主義体制)","estado totalitario (全体主義国家)"],"synonyms":["autoritario","dictatorial","absolutista"],"antonyms":["democrático","liberal"]}],"etymology":{"value":"Del italiano 'totalitario', derivado de 'totalità' (全体性), influenciado por el concepto de 'totalitarismo' desarrollado en el contexto político italiano durante el ascenso del fascismo.","priority":"N/A"},"pronunciation":{"ipa":"/totalitaɾjo/","syllables":"to-ta-li-ta-rio"},"inflection":{"gender":"masculine","number":"singular/plural","notes":"Agrees in gender and number with the noun it modifies. Masculine singular: totalitario; Feminine singular: totalitaria; Masculine plural: totalitarios; Feminine plural: totalitarias."},"usage_notes":{"explanation":"'Totalitario' describes something related to or characteristic of totalitarianism, a political system where the state holds total authority over society and seeks to control all aspects of public and private life. It is often used to describe governments, ideologies, or practices that suppress individual freedoms and dissent.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El país es totalitario en su economía.","correct":"El país tiene una economía controlada por el estado, similar a un régimen totalitario.","note":"'Totalitario' refers to the political system, not directly to the economy. It's more accurate to say the economy is controlled by the state in a way that resembles a totalitarian regime."}],"priority":"N/A"},"related_words":{"derivatives":["totalitarismo (全体主義)"],"phrases":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but used in political and academic contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'totalitario' is used in political science and history to describe regimes that exercise absolute control over all aspects of life. Understanding this term requires knowledge of political ideologies and historical contexts. It's not a common word in everyday conversation.","priority":"N/A"},"example_sentences":[{"sentence":"La propaganda es una herramienta clave en un sistema totalitario.","translation":"宣伝は全体主義体制における重要な道具である。","type":"adjective","meaning_category":"relating to totalitarianism"},{"sentence":"Los gobiernos totalitarios reprimen la libertad de expresión.","translation":"全体主義政府は言論の自由を抑圧する。","type":"adjective","meaning_category":"characteristic of totalitarianism"}]}