{"word":"semiprotectorate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半保護国","english_definition":"A state that is nominally independent but is under the protection and partial control of a stronger state.","examples":[{"sentence":"The region became a semiprotectorate of the neighboring empire.","translation":"その地域は隣接する帝国の半保護国となった。"},{"sentence":"Historical examples of semiprotectorates include certain princely states under British rule in India.","translation":"歴史的な半保護国の例としては、イギリスのインド統治下にあったいくつかの藩王国が挙げられる。"}],"collocations":["establish a semiprotectorate","become a semiprotectorate","under the semiprotectorate"],"synonyms":["protectorate","dependency","satellite state"],"antonyms":["independent state","sovereign nation"]}],"etymology":{"value":"The term combines 'semi-' (meaning 'partially' or 'half') with 'protectorate,' indicating a state that is partially but not fully under the protection and control of another.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmi prəˈtɛktərət/","syllables":"se-mi-pro-tec-tor-ate"},"inflection":{"noun_plural":"semiprotectorates"},"usage_notes":{"explanation":"A 'semiprotectorate' is a state that retains some degree of internal autonomy but its foreign policy and defense are largely controlled by a more powerful nation. It differs from a full protectorate, where the protecting power has more extensive control over the internal affairs of the protected state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was a semi-protector.","correct":"✓ The country was a semiprotectorate.","note":"'Semiprotectorate' is the correct term for the state itself; 'semi-protector' is not typically used. "},{"incorrect":"✗ The semiprotectorate was completely independent.","correct":"✓ The semiprotectorate was nominally independent but under partial control.","note":"Semiprotectorates are, by definition, not fully independent."}],"priority":"★★☆"},"related_words":{"derivatives":["semi- (prefix meaning 'half' or 'partially')","protectorate (a state that is controlled and protected by another)"],"related_concepts":["sphere of influence","dependency","satellite state","puppet state"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This term is relatively rare, primarily used in historical or political science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semiprotectorate' refers to a country that is officially independent but is actually controlled and protected by a stronger country. This means the semiprotectorate has some freedom to manage its own affairs, but the stronger country makes decisions about its defense and foreign relations. This term is often used when discussing historical or political situations where a country's independence is limited by another power."},"example_sentences":[{"sentence":"The small island nation became a semiprotectorate to ensure its security against larger powers.","translation":"その小さな島国は、大国からの安全を確保するために半保護国となった。","type":"noun","meaning_category":"Political Status"},{"sentence":"Historians debate whether certain regions in colonial Africa were true protectorates or merely semiprotectorates.","translation":"歴史家たちは、植民地時代のアフリカの特定の地域が真の保護国であったのか、単なる半保護国であったのかについて議論している。","type":"noun","meaning_category":"Historical Context"}]}