{"word":"occupiable","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"居住可能な、占有可能な","english_definition":"Suitable or able to be occupied; fit for habitation or use.","examples":[{"sentence":"The building was deemed occupiable after the renovations.","translation":"改修後、その建物は居住可能と判断された。"},{"sentence":"Is this seat occupiable, or is someone sitting here?","translation":"この席は空いていますか、それとも誰か座っていますか？"},{"sentence":"The land is occupiable, but it needs some clearing before construction can begin.","translation":"その土地は占有可能ですが、建設を開始する前に多少の整地が必要です。"}],"collocations":["occupiable space","occupiable building","occupiable land","deemed occupiable","legally occupiable"],"synonyms":["habitable","inhabitable","livable","tenantable","usable","available"],"antonyms":["uninhabitable","unoccupiable","vacant","empty"]}],"etymology":{"value":"The word \"occupiable\" is formed from the verb \"occupy\" and the suffix \"-able,\" which indicates capability or suitability. \"Occupy\" comes from the Old French word \"occuper,\" which in turn comes from the Latin word \"occupare,\" meaning \"to seize, take possession of, hold.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒkjʊpaɪəbəl/","syllables":"oc-cu-pi-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., easily occupiable, readily occupiable) and can be used in comparative and superlative forms (more occupiable, most occupiable), though these are less common."},"usage_notes":{"explanation":"\"Occupiable\" generally refers to a space or structure that is in a condition suitable for someone to live in or use. It implies that the space is safe, functional, and meets basic requirements for habitation or use. The term is often used in real estate, construction, and legal contexts to describe whether a building or area is ready for occupancy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The occupiable of the house is very high.","correct":"✓ The occupancy of the house is very high.","note":"\"Occupiable\" is an adjective, while \"occupancy\" is a noun referring to the state of being occupied or the number of occupants."},{"incorrect":"✗ The house is occupy.","correct":"✓ The house is occupiable.","note":"\"Occupy\" is a verb, while \"occupiable\" is the adjective describing the state of being able to be occupied."}],"priority":"★★☆"},"related_words":{"derivatives":["occupy (verb)","occupancy (noun)","occupation (noun)","occupant (noun)","unoccupiable (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"occupiable\" means that a place is suitable or able to be lived in or used. It's often used in formal situations, like when talking about buildings or land. If a building is \"occupiable,\" it means people can live or work there safely and comfortably. It's not a very common word in everyday conversation, but you might hear it in real estate or construction contexts."},"example_sentences":[{"sentence":"The apartment was deemed **occupiable** after the repairs were completed.","translation":"修理完了後、そのアパートは居住可能と判断された。","type":"adjective","meaning_category":"居住可能な"},{"sentence":"The office space is **occupiable** from next Monday.","translation":"そのオフィススペースは来週の月曜日から占有可能です。","type":"adjective","meaning_category":"占有可能な"},{"sentence":"Despite the damage, the building was still considered **occupiable**.","translation":"損傷にもかかわらず、その建物は依然として占有可能と見なされた。","type":"adjective","meaning_category":"居住可能な"}]}