{"word":"integrity-compromising","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"誠実さを損なう、高潔さを危うくする","english_definition":"Threatening or undermining integrity; likely to cause a loss of honesty or moral principles.","examples":[{"sentence":"The journalist refused to publish the integrity-compromising information.","translation":"そのジャーナリストは、誠実さを損なう情報を公表することを拒否した。"},{"sentence":"He avoided any integrity-compromising situations.","translation":"彼は、高潔さを危うくするような状況を避けた。"},{"sentence":"The company implemented new policies to prevent integrity-compromising practices.","translation":"会社は、誠実さを損なう慣行を防ぐために新しい方針を実施した。"}],"collocations":["integrity-compromising behavior","integrity-compromising situation","integrity-compromising information","integrity-compromising action","integrity-compromising decision"],"synonyms":["corrupting","undermining","compromising","dishonest","unethical"],"antonyms":["integrity-preserving","ethical","honest","upright"]}],"etymology":{"value":"The word is formed by combining 'integrity' (the quality of being honest and having strong moral principles) with 'compromising' (tending to reveal or make vulnerable).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˌtɛɡrɪti ˈkɒmprəˌmaɪzɪŋ/","syllables":"in-teg-ri-ty-com-pro-mis-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are possible but less common (more integrity-compromising, most integrity-compromising)."},"usage_notes":{"explanation":"'Integrity-compromising' is typically used to describe actions, situations, or information that could lead to a person or organization acting in a way that is not honest or ethical. It suggests a threat to one's moral principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The integrity-compromising of the data was a serious issue.","correct":"✓ The compromise of the data's integrity was a serious issue.","note":"'Integrity-compromising' is an adjective, so it modifies a noun. The noun form 'compromise of integrity' is often more appropriate when describing the act of compromising integrity itself."}],"priority":"★★☆"},"related_words":{"derivatives":["integrity","compromise","compromising"],"phrasal_verbs":[],"related_adjectives":["compromising","uncompromising"],"related_nouns":["integrity","compromise"],"related_verbs":["compromise"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'integrity-compromising' is a complex adjective used to describe something that has the potential to damage or weaken someone's honesty and moral principles. It's often used in formal or professional contexts, such as discussions about ethics, journalism, or corporate governance. Because it combines two relatively abstract concepts, 'integrity' and 'compromising,' it requires a good understanding of both terms to fully grasp its meaning."},"example_sentences":[{"sentence":"The company's decision to accept the bribe was an integrity-compromising act.","translation":"その会社が賄賂を受け取るという決定は、誠実さを損なう行為だった。","type":"adjective","meaning_category":"compromising integrity"},{"sentence":"The leaked documents contained integrity-compromising information about the CEO.","translation":"リークされた文書には、CEOに関する誠実さを損なう情報が含まれていた。","type":"adjective","meaning_category":"compromising integrity"},{"sentence":"He refused to participate in any integrity-compromising activities.","translation":"彼は、いかなる誠実さを損なう活動にも参加することを拒否した。","type":"adjective","meaning_category":"compromising integrity"}]}