{"word":"squashily","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"押しつぶされたように、ぐしゃっと、柔らかくつぶれるように","english_definition":"In a squashy manner; in a way that is soft, yielding, and easily crushed.","examples":[{"sentence":"The cushion conformed squashily to the shape of the child's body.","translation":"クッションは、柔らかくつぶれるように子供の体の形に沿った。"},{"sentence":"She sat squashily on the old sofa, sinking into its depths.","translation":"彼女は古びたソファに柔らかく沈み込むように腰掛けた。"}],"collocations":["sit squashily","conform squashily","pack squashily"],"synonyms":["mushily","softly","yieldingly","compressibly"],"antonyms":["firmly","rigidly","stiffly"]}],"etymology":{"value":"Derived from the adjective 'squashy' (soft, yielding, easily crushed) with the addition of the adverbial suffix '-ly'. The word 'squashy' itself is related to the verb 'squash' (to crush or squeeze something with force).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɒʃɪli/","syllables":"squash-i-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Squashily' describes an action or state that involves something being easily compressed, yielding, or soft. It is often used to describe how something conforms to pressure or how someone sits or moves in a soft or yielding environment. It is relatively uncommon in formal writing or speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bread was squashily.","correct":"✓ The bread was squashy.","note":"'Squashily' is an adverb and modifies a verb, adjective, or another adverb. 'Squashy' is an adjective and describes a noun. In this case, the adjective 'squashy' is needed to describe the bread."},{"incorrect":"✗ He squashily the tomato.","correct":"✓ He squashed the tomato.","note":"'Squashily' is an adverb, not a verb. The verb 'squash' should be used to describe the action of crushing something."}],"priority":"★☆☆"},"related_words":{"derivatives":["squashy (adjective)","squash (verb, noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR materials)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Squashily' is an adverb that describes something done in a soft, yielding, and easily crushed manner. It is derived from the adjective 'squashy,' which means soft and easily crushed. This word is not commonly used and is more likely to be found in descriptive writing where the author wants to convey a sense of softness or compressibility. Understanding this word requires a good vocabulary and an ability to understand how adverbs modify verbs or adjectives to add detail to a description."},"example_sentences":[{"sentence":"The beanbag chair welcomed her squashily as she collapsed onto it.","translation":"彼女が倒れ込むと、ビーズクッションは柔らかく彼女を受け止めた。","type":"descriptive","meaning_category":"softly, yieldingly"},{"sentence":"The package was packed so squashily that the contents were likely damaged.","translation":"その荷物は柔らかく詰められていたので、中身は破損している可能性が高かった。","type":"descriptive","meaning_category":"compressibly"}]}