{"word":"frank-tenement","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of freehold property held by socage tenure, especially in the Middle Ages.","english_definition":"A type of freehold property held by socage tenure, especially in the Middle Ages.","examples":[{"sentence":"The frank-tenement was a common form of land ownership in medieval England.","translation":"フランク・テネメントは、中世イングランドにおいて一般的な土地所有形態でした。"}],"collocations":["hold a frank-tenement","possess a frank-tenement"],"synonyms":["freehold","socage"],"antonyms":["leasehold","villeinage"]}],"etymology":{"value":"From Middle English *franktenement*, from Anglo-Norman *frank tenement*, from Old French *franc tenement* (literally “free holding”), equivalent to *franc* (“free”) + *tenement* (“tenement”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfræŋkˈtɛnəmənt/","syllables":"frank-ten-e-ment"},"inflection":{"noun_plural":"frank-tenements"},"usage_notes":{"explanation":"A frank-tenement was a type of freehold estate, meaning the tenant had full ownership rights over the land as long as they fulfilled their socage obligations (usually monetary payments or services that were free and not tied to the lord's will). This contrasted with leasehold or villeinage, where the tenant had fewer rights and was more directly controlled by the lord. The term is primarily of historical interest.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["tenement","freehold","socage"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'frank-tenement' is a historical term related to land ownership in medieval England. It signifies a freehold property held by socage tenure, granting the tenant full ownership rights as long as they fulfilled their obligations. This concept is typically encountered in historical or legal contexts, making it relevant for advanced learners studying these fields."},"example_sentences":[{"sentence":"The records indicated that he held the land as a frank-tenement.","translation":"記録によると、彼はその土地をフランク・テネメントとして所有していた。","type":"noun","meaning_category":"property ownership"},{"sentence":"The rights associated with a frank-tenement were significantly greater than those of a villein.","translation":"フランク・テネメントに関連する権利は、農奴の権利よりも著しく大きかった。","type":"noun","meaning_category":"legal rights"}]}