{"word":"acneform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ニキビのような、ニキビ状の","english_definition":"Resembling acne; characterized by lesions similar to those of acne.","examples":[{"sentence":"The patient presented with an acneform rash on their face and chest.","translation":"患者は顔と胸にニキビのような発疹を呈した。"},{"sentence":"Certain medications can cause acneform eruptions as a side effect.","translation":"特定の薬は副作用としてニキビ状の発疹を引き起こす可能性がある。"}],"collocations":["acneform eruption","acneform rash","acneform lesion"],"synonyms":["acneiform","pustular","papulopustular"],"antonyms":[]}],"etymology":{"value":"'Acne' + '-form' (having the form of).","priority":"★★★"},"pronunciation":{"ipa":"/ˈækniˌfɔːrm/","syllables":"ac-ne-form"},"inflection":{"notes":"Since it is an adjective, it can be used in comparative and superlative forms, although this is rare: more acneform, most acneform."},"usage_notes":{"explanation":"'Acneform' is used to describe skin conditions that have the appearance of acne but may not be true acne. It is often used in medical contexts to describe rashes or eruptions caused by medications, chemicals, or other factors. The term helps differentiate these conditions from acne vulgaris, the common form of acne.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The acneform is on his face.","correct":"✓ He has an acneform rash on his face.","note":"'Acneform' is an adjective, not a noun. Therefore, it should be used to describe something, like a rash or eruption."}],"priority":"★★☆"},"related_words":{"derivatives":["acne (noun: ニキビ)","acneiform (adjective: ニキビのような、ニキビ状の - synonym)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acneform' is a specialized term primarily used in medical or dermatological contexts. It describes skin conditions that resemble acne but may have different causes or characteristics. Understanding this term requires a familiarity with medical terminology and the ability to distinguish between different types of skin eruptions."},"example_sentences":[{"sentence":"The dermatologist diagnosed the condition as an acneform drug eruption.","translation":"皮膚科医はその状態をニキビ状薬疹と診断した。","type":"general","meaning_category":"medical"},{"sentence":"The lesions were acneform, but a bacterial culture came back negative.","translation":"病変はニキビ状であったが、細菌培養の結果は陰性であった。","type":"general","meaning_category":"medical"}]}