{"word":"cycloidally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"サイクロイド状に","english_definition":"In a cycloidal manner; describing a path or motion resembling a cycloid curve.","examples":[{"sentence":"The particle moved cycloidally through the magnetic field.","translation":"その粒子は磁場の中をサイクロイド状に移動した。"},{"sentence":"The robot arm was programmed to move cycloidally to optimize the welding process.","translation":"ロボットアームは溶接プロセスを最適化するためにサイクロイド状に動くようにプログラムされた。"}],"collocations":["move cycloidally","oscillate cycloidally","rotate cycloidally"],"synonyms":["curvilinearly","spirally"],"antonyms":["linearly","rectilinearly"]}],"etymology":{"value":"Derived from the term 'cycloid', which refers to a specific type of curve. The adverb 'cycloidally' is formed by adding the suffix '-ally' to 'cycloidal', indicating manner or direction.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈklɔɪdəli/","syllables":"cy-cloi-dal-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Cycloidally' describes movement or arrangement along a cycloid curve. This term is primarily used in technical or scientific contexts, such as physics, engineering, and mathematics, to describe specific types of motion or paths.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car moved cyclically.","correct":"✓ The car moved cycloidally.","note":"'Cyclically' implies a repeating pattern, while 'cycloidally' specifies a particular type of curved path. Ensure the correct term is used based on the context of the motion."}],"priority":"★★☆"},"related_words":{"derivatives":["cycloid (noun: a curve traced by a point on the circumference of a circle rolling along a straight line)","cycloidal (adjective: relating to or resembling a cycloid)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cycloidally' is a highly specialized term primarily used in technical and scientific contexts, specifically in fields like physics, engineering, and mathematics, where precise descriptions of motion and curves are necessary. It describes movement or arrangement along a cycloid curve, which is a specific type of curve traced by a point on the circumference of a circle rolling along a straight line. Due to its niche usage, it is not commonly encountered in general English discourse."},"example_sentences":[{"sentence":"The pendulum's bob, when constrained, traces a path that approximates moving **cycloidally**.","translation":"拘束された振り子のボブは、サイクロイド状に動く経路を近似的にたどる。","type":"adverb","meaning_category":"サイクロイド状に"},{"sentence":"The gears were designed such that the contact point moved **cycloidally**, reducing wear and increasing efficiency.","translation":"ギアは、接触点がサイクロイド状に動くように設計されており、摩耗を減らし、効率を高めている。","type":"adverb","meaning_category":"サイクロイド状に"}]}