{"word":"provisioner","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"食料雑貨供給業者、食料品店主、輜重兵","english_definition":"a supplier of food and other stores; a person or company that provides supplies, especially food, for a journey, expedition, or military force.","examples":[{"sentence":"The expedition relied on the local provisioner for fresh supplies.","translation":"探検隊は新鮮な物資を地元の食料雑貨供給業者に頼っていた。"},{"sentence":"The army's provisioners were responsible for ensuring the troops had enough to eat.","translation":"軍の輜重兵は、兵士たちが十分な食料を確保する責任を負っていた。"},{"sentence":"He worked as a provisioner in the small town, selling everything from flour to canned goods.","translation":"彼は小さな町で食料品店主として働き、小麦粉から缶詰まであらゆるものを売っていた。"}],"collocations":["local provisioner","army provisioner","ship's provisioner","expedition provisioner"],"synonyms":["supplier","grocer","food supplier","caterer","storekeeper"],"antonyms":["consumer","customer"]},{"part_of_speech":"noun","definition":"(歴史的な用法)軍隊や船などに食料や物資を供給する契約者","english_definition":"(historical) a contractor who supplies food and provisions to an army, ship, or other large group.","examples":[{"sentence":"In the 18th century, the provisioner made a fortune supplying the British Navy.","translation":"18世紀には、食料供給業者は英国海軍に物資を供給して財を成した。"}],"collocations":["military provisioner","naval provisioner"],"synonyms":["contractor","supplier"],"antonyms":[]}],"etymology":{"value":"From the word 'provision' (to supply with food, drink, or other necessities) + '-er' (a suffix denoting a person or thing that performs a specified action or function). 'Provision' comes from the Latin 'providere,' meaning 'to foresee, attend to, provide.'","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈvɪʒənər/","syllables":"pro-vi-sion-er"},"inflection":{"noun_plural":"provisioners"},"usage_notes":{"explanation":"The term 'provisioner' is often used in historical contexts or when referring to large-scale supply operations, such as those for military expeditions or ships. In modern usage, terms like 'supplier,' 'food supplier,' or 'grocer' are more common for everyday food providers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a provisioner of cars.","correct":"✓ He is a supplier of cars.","note":"'Provisioner' specifically refers to suppliers of food and other essential supplies, not general goods like cars."}],"priority":"★☆☆"},"related_words":{"derivatives":["provision (noun: a supply of food and other things needed; verb: to supply with provisions)","provisions (noun: supplies of food and other things needed)"],"related_terms":["supplier","grocer","caterer","storekeeper","vendor","purveyor"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"provisioner\" refers to someone who supplies food and other necessary items, especially for large groups like armies or expeditions. It's not a very common word in everyday conversation; you're more likely to encounter it in historical contexts or when discussing logistics. Think of it as a specialized type of supplier, specifically for essential goods.","priority":"★★☆"},"example_sentences":[{"sentence":"The ship's provisioner ensured there was enough food for the long voyage.","translation":"船の食料供給業者は、長旅に十分な食料があることを確認した。","type":"noun","meaning_category":"食料雑貨供給業者"},{"sentence":"As a military provisioner, he was responsible for feeding thousands of soldiers.","translation":"軍の輜重兵として、彼は何千人もの兵士を養う責任を負っていた。","type":"noun","meaning_category":"食料雑貨供給業者"},{"sentence":"The small town relied on the local provisioner for its basic needs.","translation":"その小さな町は、生活必需品を地元の食料雑貨供給業者に頼っていた。","type":"noun","meaning_category":"食料雑貨供給業者"}]}