{"word":"falsifiably","priority":"★★★","meanings":[{"part_of_speech":"adverb","definition":"反証可能に、反証できる形で","english_definition":"in a way that is capable of being proven false; in a manner that allows for the possibility of being disproven.","examples":[{"sentence":"The hypothesis was formulated falsifiably, allowing scientists to test its validity.","translation":"その仮説は反証可能な形で立てられ、科学者たちはその妥当性を検証することができた。"},{"sentence":"He argued that a scientific theory must be falsifiably stated to be meaningful.","translation":"彼は、科学理論は意味を持つためには反証可能な形で述べられなければならないと主張した。"}],"collocations":["falsifiably stated","falsifiably tested","falsifiably demonstrated"],"synonyms":["testably","verifiably","refutably"],"antonyms":["unfalsifiably","untestably","irrefutably"]}],"etymology":{"value":"Derived from 'falsifiable' (capable of being proven false) + '-ly' (forming an adverb). 'Falsifiable' comes from 'falsify' (to prove false) + '-able' (capable of). 'Falsify' comes from Latin 'falsus' (false).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːlsɪˈfaɪəbli/","syllables":"fal-si-fi-a-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Falsifiably' describes how something is stated or tested in a way that it could potentially be proven wrong. It is often used in the context of scientific theories and hypotheses, emphasizing the importance of testability and the possibility of disproving a claim. The concept is central to the philosophy of science, particularly associated with Karl Popper's ideas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The statement was falsifiably true.","correct":"✓ The statement was falsifiable, but it turned out to be true.","note":"'Falsifiable' does not mean 'false.' It means capable of being proven false. A falsifiable statement can be either true or false; the key is that it can be tested."},{"incorrect":"✗ Falsifiably is a noun.","correct":"✓ Falsifiably is an adverb.","note":"'Falsifiably' is an adverb, modifying a verb, adjective, or another adverb. The related adjective is 'falsifiable'."}],"priority":"★★☆"},"related_words":{"derivatives":["falsifiable (adjective)","falsifiability (noun)","falsify (verb)","falsification (noun)"],"related_concepts":["Popperian falsification","scientific method","hypothesis testing"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Falsifiably' is an adverb that means 'in a way that something can be proven false.' It is most often used in discussions about science and philosophy. A statement or theory is said to be 'falsifiable' if there is a way to test it and potentially show that it is not true. For example, the statement 'All swans are white' is falsifiable because you could find a black swan, which would prove the statement wrong. The adverb 'falsifiably' describes how something is presented or tested to allow for this possibility of being disproven. It's a relatively advanced term, so you're more likely to encounter it in academic or technical contexts."},"example_sentences":[{"sentence":"The experiment was designed to test the hypothesis falsifiably.","translation":"その実験は、仮説を反証可能に検証するように設計された。","type":"general","meaning_category":"manner of testing"},{"sentence":"The theory should be stated falsifiably so that it can be rigorously tested.","translation":"その理論は厳密に検証できるように、反証可能な形で述べられるべきだ。","type":"academic","meaning_category":"manner of stating a theory"},{"sentence":"The claim was not presented falsifiably, making it difficult to evaluate its scientific merit.","translation":"その主張は反証可能な形で提示されていなかったため、その科学的な価値を評価することが困難だった。","type":"critical","meaning_category":"lack of testability"}]}