{"word":"unidiomatically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非慣用的に、慣用句を用いずに、自然でない言い方で","english_definition":"in a way that is not idiomatic; in a way that does not follow the natural or characteristic way of expressing something in a particular language.","examples":[{"sentence":"He translated the text literally, which resulted in it sounding unidiomatically.","translation":"彼はそのテキストを文字通りに翻訳したため、非慣用的な響きになってしまった。"},{"sentence":"The sentence is grammatically correct, but it's expressed unidiomatically.","translation":"その文は文法的には正しいが、非慣用的な表現がされている。"},{"sentence":"Because she was still learning the language, she often spoke unidiomatically.","translation":"彼女はまだ言語を学んでいたので、しばしば非慣用的な話し方をしていた。"}],"collocations":["speak unidiomatically","write unidiomatically","translate unidiomatically","express oneself unidiomatically"],"synonyms":["awkwardly","unnaturally","literally","stiffly","woodenly"],"antonyms":["idiomatically","naturally","fluently","eloquently"]}],"etymology":{"value":"The word 'unidiomatically' is formed by adding the prefix 'un-' (meaning 'not') and the suffix '-ally' (forming an adverb) to the word 'idiomatic'. 'Idiomatic' itself comes from 'idiom', which originates from the Greek word 'idioma' meaning 'a peculiarity of language'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪˌdɪəmæˈtɪkli/","syllables":"un-id-i-o-mat-i-cal-ly"},"inflection":{"notes":"As an adverb, 'unidiomatically' does not have different inflections."},"usage_notes":{"explanation":"'Unidiomatically' describes the manner in which something is expressed that deviates from the typical or natural way a native speaker would say it. It often implies a lack of fluency or a direct, literal translation that doesn't capture the nuances of the language. It is used to critique or describe language use that sounds awkward, unnatural, or foreign.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke very unidiomatic.","correct":"✓ He spoke very unidiomatically.","note":"'Unidiomatic' is an adjective, so it needs to be modified by an adverb such as 'very'. To describe how someone speaks, use the adverb 'unidiomatically'."},{"incorrect":"✗ The translation was unidiomatic, it was hard to understand.","correct":"✓ The translation was unidiomatic; therefore, it was hard to understand. / ✓ The translation was unidiomatic, making it hard to understand.","note":"'Unidiomatic' describes the quality of the translation. The second clause explains the consequence of this quality, so a semicolon or a conjunction is needed to connect the two clauses properly."}],"priority":"★★☆"},"related_words":{"derivatives":["unidiomatic (adjective)","idiomatically (adverb)","idiomatic (adjective)","idiom (noun)"],"related_concepts":["literal translation","figurative language","native speaker","fluency","linguistics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unidiomatically' is a complex adverb that describes something expressed in a way that doesn't sound natural or fluent in a particular language. This often happens when someone translates directly from another language without considering the nuances and common expressions used by native speakers. If a sentence is 'unidiomatically' written, it might be grammatically correct but still sound strange or awkward to a native speaker."},"example_sentences":[{"sentence":"The software generated text that read awkwardly and unidiomatically.","translation":"そのソフトウェアが生成したテキストはぎこちなく、非慣用的な表現になっていた。","type":"general","meaning_category":"manner of expression"},{"sentence":"He used a dictionary to translate each word, resulting in an unidiomatically phrased sentence.","translation":"彼は各単語を翻訳するために辞書を使った結果、非慣用的な言い回しの文になってしまった。","type":"translation","meaning_category":"translation"},{"sentence":"The student's essay, while grammatically sound, was written unidiomatically and lacked a natural flow.","translation":"その学生のエッセイは、文法的にはしっかりしていたが、非慣用的な書き方で自然な流れに欠けていた。","type":"writing","meaning_category":"writing"}]}