{"word":"nonintegrability","priority":"low","meanings":[{"part_of_speech":"noun","definition":"非積分性","english_definition":"The property of a system or equation that cannot be solved analytically or expressed in closed form.","examples":[{"sentence":"The nonintegrability of the three-body problem makes it difficult to predict the long-term behavior of celestial bodies.","translation":"三体問題の非積分性により、天体の長期的な挙動を予測することが困難になっています。"},{"sentence":"Understanding the nonintegrability of certain differential equations is crucial in many areas of physics.","translation":"特定の微分方程式の非積分性を理解することは、物理学の多くの分野で重要です。"}],"collocations":["demonstrate nonintegrability","prove nonintegrability","study nonintegrability","Hamiltonian nonintegrability"],"synonyms":["unsolvability","inability to integrate"],"antonyms":["integrability"],"related_terms":["integrable","integration","chaos theory","Hamiltonian system"]}],"etymology":{"value":"Derived from 'integrability' by adding the prefix 'non-' to indicate negation.","priority":"medium"},"pronunciation":{"ipa":"/ˌnɒnɪnˌteɡrəˈbɪləti/","syllables":"non-in-te-gra-bil-i-ty"},"inflection":{"noun_plural":"nonintegrabilities"},"usage_notes":{"explanation":"'Nonintegrability' is a technical term primarily used in mathematics, physics, and engineering to describe systems or equations for which no analytical solution exists. This often implies that numerical methods or approximations are necessary to understand the system's behavior.","priority":"high"},"level_frequency":{"frequency_google_ngram":"Rare","priority":"low"},"readability_explanation":{"level":"Advanced","text":"'Nonintegrability' is a term used in higher-level mathematics and physics. It means that a particular equation or system of equations cannot be solved using standard analytical methods, meaning there is no formula that can give you the answer directly. This often leads to the use of computer simulations or approximations to understand the behavior of the system."},"example_sentences":[{"sentence":"The **nonintegrability** of this system implies that its behavior is highly sensitive to initial conditions.","translation":"このシステムの非積分性は、その挙動が初期条件に非常に敏感であることを意味します。","type":"noun","meaning_category":"mathematics"},{"sentence":"Establishing the **nonintegrability** of a Hamiltonian system is a key step in demonstrating chaotic behavior.","translation":"ハミルトン系の非積分性を確立することは、カオス的な挙動を示す上で重要なステップです。","type":"noun","meaning_category":"physics"}]}