{"word":"Sulphonated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"スルホン化された","english_definition":"Having undergone sulphonation, a chemical process in which a sulfonic acid group (-SO3H) is introduced into a molecule.","examples":[{"sentence":"Sulphonated polymers are often used as ion-exchange resins.","translation":"スルホン化されたポリマーは、イオン交換樹脂としてよく使用されます。"},{"sentence":"The sulphonated oil is used as a wetting agent.","translation":"そのスルホン化された油は、湿潤剤として使用されます。"}],"collocations":["sulphonated oil","sulphonated polymer","sulphonated polystyrene"],"synonyms":["sulfonated"],"antonyms":["unsulphonated"]}],"etymology":{"value":"Derived from the verb 'sulphonate', which comes from 'sulfone' (a chemical compound containing a sulfonyl group) + '-ate' (a suffix indicating a chemical compound or a process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌlfəneɪtɪd/","syllables":"sul-pho-nat-ed"},"inflection":{"notes":"This is the past participle form of the verb 'sulphonate', used as an adjective."},"usage_notes":{"explanation":"'Sulphonated' describes a substance that has been treated with a sulphonating agent, resulting in the addition of a sulfonic acid group. This process often changes the properties of the substance, such as increasing its water solubility or reactivity. It is commonly used in the production of detergents, dyes, and ion-exchange resins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sulphonated is used in detergents.","correct":"✓ The sulphonated compound is used in detergents.","note":"'Sulphonated' is an adjective, so it needs to modify a noun. Using 'sulphonated' alone is grammatically incorrect. You need to specify what is sulphonated (e.g., sulphonated compound, sulphonated material)."},{"incorrect":"✗ The process sulphonated the material.","correct":"✓ The material was sulphonated.","note":"'Sulphonated' is the past participle used as an adjective. To use it as a verb, you would use 'sulphonate' (The process sulphonated the material)."}],"priority":"★★☆"},"related_words":{"derivatives":["sulphonate (verb, noun)","sulphonation (noun)","sulfonic acid (noun)","sulfone (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sulphonated' is a technical term used in chemistry to describe a compound that has undergone a specific chemical reaction called sulphonation. This reaction involves adding a sulfonic acid group (-SO3H) to a molecule. The term is typically encountered in scientific or technical contexts, such as in discussions of polymers, detergents, or dyes. Understanding the term requires a basic knowledge of organic chemistry.","priority":"★★☆"},"example_sentences":[{"sentence":"The **sulphonated** polystyrene beads were used as a catalyst in the reaction.","translation":"そのスルホン化されたポリスチレンビーズは、反応の触媒として使用されました。","type":"adjective","meaning_category":"化学"},{"sentence":"**Sulphonated** castor oil is a common ingredient in textile processing.","translation":"スルホン化されたヒマシ油は、繊維加工における一般的な成分です。","type":"adjective","meaning_category":"産業"}]}