{"word":"captance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(電気工学) 容量性リアクタンスの逆数。キャパシタンスとも呼ばれる。","english_definition":"(electrical engineering) The reciprocal of capacitive reactance; also known as capacitance.","examples":[{"sentence":"The captance of the capacitor was measured using an impedance analyzer.","translation":"コンデンサのキャプタンスはインピーダンスアナライザを用いて測定された。"}],"collocations":["measure captance","calculate captance","high captance","low captance"],"synonyms":["capacitance","susceptance"],"antonyms":[]}],"etymology":{"value":"Derived from 'capacity' or 'capacitance'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæptəns/","syllables":"cap-tance"},"inflection":{"noun_plural":"captances"},"usage_notes":{"explanation":"\"Captance\" is a term sometimes used interchangeably with \"capacitance,\" although \"capacitance\" is the more common and preferred term in modern electrical engineering. It refers to the ability of a capacitor to store electrical energy. In some contexts, it may also be related to susceptance, which is the imaginary part of admittance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The captance is measured in farads per meter.","correct":"✓ The capacitance is measured in farads.","note":"While captance and capacitance are related, capacitance is the more standard term and is measured in farads."}],"priority":"★★☆"},"related_words":{"derivatives":["capacitance","capacitor","capacitive","susceptance","reactance"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Captance\" is a technical term used in electrical engineering, specifically related to the properties of capacitors. It's closely related to \"capacitance\" and sometimes used synonymously, although \"capacitance\" is more common. Understanding this term requires a background in electrical engineering principles, particularly concerning reactance, admittance, and the behavior of capacitors in circuits."},"example_sentences":[{"sentence":"The engineer needed to calculate the captance to optimize the circuit design.","translation":"エンジニアは回路設計を最適化するためにキャプタンスを計算する必要があった。","type":"noun","meaning_category":"電気容量リアクタンスの逆数"},{"sentence":"Variations in captance can affect the performance of high-frequency circuits.","translation":"キャプタンスの変動は高周波回路の性能に影響を与える可能性がある。","type":"noun","meaning_category":"電気容量リアクタンスの逆数"}]}