{"word":"haematocele","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"陰嚢水腫、精索水腫","english_definition":"A collection of blood in the tunica vaginalis of the testis, or along the spermatic cord.","examples":[{"sentence":"The haematocele was caused by trauma to the scrotum.","translation":"その陰嚢水腫は陰嚢への外傷が原因だった。"},{"sentence":"Surgical intervention may be necessary to drain a large haematocele.","translation":"大きな陰嚢水腫を排出するには外科的介入が必要となる場合がある。"}],"collocations":["traumatic haematocele","chronic haematocele"],"synonyms":["hematocele"],"antonyms":[]}],"etymology":{"value":"From Greek 'haima' (blood) + 'kele' (tumor, hernia).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhiːmətəsiːl/","syllables":"hee-ma-to-cele"},"inflection":{"noun_plural":"haematoceles"},"usage_notes":{"explanation":"A haematocele is a specific medical condition involving the accumulation of blood, typically within the scrotum. It can result from injury, surgery, or other underlying medical issues. Diagnosis often involves physical examination and imaging studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had a hydrocele, which is the same as a haematocele.","correct":"✓ The patient had a haematocele, which is different from a hydrocele, which is fluid.","note":"A hydrocele involves fluid accumulation, whereas a haematocele involves blood."}],"priority":"★★☆"},"related_words":{"derivatives":["haematoma","hydrocele"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Haematocele' is a specialized medical term referring to a specific condition. Understanding requires a background in medical terminology or related fields. The word is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Physical examination revealed a tense, non-tender haematocele.","translation":"身体検査により、緊張性で圧痛のない陰嚢水腫が明らかになった。","type":"medical","meaning_category":"medical condition"},{"sentence":"Ultrasound confirmed the presence of a haematocele in the scrotum.","translation":"超音波検査で陰嚢内の陰嚢水腫の存在が確認された。","type":"medical","meaning_category":"medical condition"}]}