{"word":"Simplemindedly","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"単純に、単純な心で、考えなしに","english_definition":"In a simpleminded manner; in a way that shows a lack of intelligence or good judgment; naively.","examples":[{"sentence":"He simplemindedly believed everything she told him.","translation":"彼は彼女が言うことをすべて単純に信じてしまった。"},{"sentence":"She simplemindedly agreed to the deal without reading the fine print.","translation":"彼女は細則を読まずに、その取引に単純に同意してしまった。"}],"collocations":["believe simplemindedly","agree simplemindedly","act simplemindedly"],"synonyms":["naively","foolishly","unwisely","gullibly","credulously","artlessly","ingenuously"],"antonyms":["wisely","intelligently","astutely","shrewdly"]}],"etymology":{"value":"Derived from the adjective 'simpleminded' (having a simple or naive mind) + the suffix '-ly' (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪmpəlˈmaɪndɪdli/","syllables":"sim-ple-mind-ed-ly"},"inflection":{"notes":"Adverb - no inflection."},"usage_notes":{"explanation":"'Simplemindedly' describes an action or behavior done in a naive or unintelligent way. It suggests a lack of critical thinking or awareness of potential consequences. It is often used to criticize someone's actions as being foolish or unwise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted simplemindedly, but he is actually very smart.","correct":"✓ He acted naively, but he is actually very smart.","note":"'Simplemindedly' implies a genuine lack of intelligence or judgment, not just acting that way. If someone is acting in a naive way despite being intelligent, 'naively' or 'foolishly' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["simpleminded (adjective)","simplemindedness (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Simplemindedly' is an adverb that means doing something in a way that shows a lack of intelligence or good judgment. It's used to describe actions that are naive or foolish because the person didn't think carefully about the consequences. It's not a very common word, so you'll mostly find it in more formal writing or when someone wants to strongly criticize someone else's lack of thoughtfulness."},"example_sentences":[{"sentence":"The investor simplemindedly put all his money into a risky venture.","translation":"その投資家は単純にすべての資金を危険な事業に投入した。","type":"adverb","meaning_category":"考えなしに"},{"sentence":"She simplemindedly trusted the stranger's offer of help.","translation":"彼女は見知らぬ人の申し出を単純に信じた。","type":"adverb","meaning_category":"単純に"}]}