{"word":"Theophyllin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テオフィリン (気管支拡張薬、利尿薬)","english_definition":"A bronchodilator and diuretic drug used to treat respiratory diseases such as asthma and chronic obstructive pulmonary disease (COPD).","examples":[{"sentence":"The doctor prescribed Theophyllin to help with my asthma symptoms.","translation":"医師は私の喘息症状を緩和するためにテオフィリンを処方しました。"},{"sentence":"Theophyllin works by relaxing the muscles in the airways, making it easier to breathe.","translation":"テオフィリンは気道の筋肉を弛緩させることで、呼吸を楽にします。"}],"collocations":["prescribe Theophyllin","take Theophyllin","Theophyllin dosage","Theophyllin side effects","Theophyllin level"],"synonyms":["aminophylline","bronchodilator","xanthine derivative"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Thea* (tea plant) + *phyllo-* (leaf) + *-ine* (alkaloid suffix). It was originally isolated from tea leaves.","priority":"★★☆"},"pronunciation":{"ipa":"/θiˈɒfɪlɪn/","syllables":"the-o-phyl-lin"},"inflection":{"noun_plural":"Theophyllins"},"usage_notes":{"explanation":"Theophyllin is a medication primarily used to treat respiratory conditions. It is a xanthine derivative that acts as a bronchodilator, relaxing airway muscles and making breathing easier. It also has diuretic effects. Due to its narrow therapeutic window and potential for side effects, Theophyllin use has declined with the advent of newer, safer medications. Blood levels of Theophyllin need to be monitored to ensure appropriate dosing and avoid toxicity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take theophyllin for my headache.","correct":"✓ I take theophyllin for my asthma.","note":"Theophyllin is primarily used for respiratory conditions like asthma, not headaches."},{"incorrect":"✗ Theophyllin is safe for everyone.","correct":"✓ Theophyllin has potential side effects and requires monitoring.","note":"Theophyllin has a narrow therapeutic window and can cause side effects, so it's not safe for everyone and requires careful monitoring."}],"priority":"★★☆"},"related_words":{"derivatives":["aminophylline (a salt of Theophyllin)","caffeine (another xanthine derivative)","xanthine (the class of compounds to which Theophyllin belongs)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (technical/medical vocabulary)","frequency_google_ngram":"Low frequency (medical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Theophyllin is a specialized term primarily encountered in medical contexts. It refers to a specific medication used to treat respiratory conditions. Understanding its function requires knowledge of medical terminology and physiology. Therefore, it is considered a high-level vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"Theophyllin is often used to manage chronic asthma symptoms.","translation":"テオフィリンは慢性喘息の症状管理によく使用されます。","type":"general","meaning_category":"medical use"},{"sentence":"Monitoring Theophyllin levels in the blood is crucial to prevent toxicity.","translation":"テオフィリンの血中濃度を監視することは、毒性を防ぐために重要です。","type":"medical","meaning_category":"dosage and monitoring"},{"sentence":"Some patients experience side effects such as nausea and insomnia when taking Theophyllin.","translation":"テオフィリンを服用すると、吐き気や不眠症などの副作用を経験する患者もいます。","type":"medical","meaning_category":"side effects"}]}