{"word":"rockbound","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"岩に囲まれた、岩の多い海岸の","english_definition":"(of a coast) bounded by rocks; rocky.","examples":[{"sentence":"The rockbound coast of Maine is known for its rugged beauty.","translation":"メイン州の岩の多い海岸は、その険しい美しさで知られています。"},{"sentence":"They sought shelter in a rockbound cove.","translation":"彼らは岩に囲まれた入り江で避難場所を探しました。"}],"collocations":["rockbound coast","rockbound harbor","rockbound island"],"synonyms":["rocky","craggy","rugged","precipitous"],"antonyms":["sandy","smooth","sheltered"]}],"etymology":{"value":"'Rock' + 'bound'. Literally, 'bound by rocks'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒkbaʊnd/","syllables":"rock-bound"},"inflection":{"notes":"Adjective only. No comparative or superlative forms are commonly used."},"usage_notes":{"explanation":"'Rockbound' is primarily a descriptive adjective used to characterize coastlines or areas that are heavily bordered or composed of rocks. It often evokes a sense of ruggedness and inaccessibility. It's less commonly used in modern contexts outside of geographical descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rockbound city was bustling with activity.","correct":"✓ The rocky city was bustling with activity.","note":"'Rockbound' is typically used for coastlines or islands, not cities. 'Rocky' is more appropriate for a city with many rocks."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used in general language learning)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rockbound' is a relatively uncommon adjective that describes a coastline or area characterized by an abundance of rocks. It suggests a rugged and often inaccessible landscape. Due to its specificity, it is more likely to be encountered in literature, geographical descriptions, or specialized contexts related to coastal regions. Understanding the word requires a familiarity with the individual meanings of 'rock' and 'bound' and their combination to create a descriptive term."},"example_sentences":[{"sentence":"The small, rockbound island was difficult to reach by boat.","translation":"その小さな岩に囲まれた島へは、ボートで行くのが困難でした。","type":"adjective","meaning_category":"岩に囲まれた"},{"sentence":"The rockbound coast provided a natural defense against invaders.","translation":"岩の多い海岸は、侵略者に対する自然の防御を提供しました。","type":"adjective","meaning_category":"岩の多い海岸の"}]}