{"word":"geometricity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"幾何学的性質、幾何学的な特徴、幾何学的な構造","english_definition":"The quality or state of being geometric; the degree to which something exhibits geometric properties or structure.","examples":[{"sentence":"The geometricity of the design was striking.","translation":"そのデザインの幾何学的性質は際立っていた。"},{"sentence":"The artist emphasized the geometricity of the natural forms.","translation":"その芸術家は自然の形の幾何学的特徴を強調した。"},{"sentence":"The geometricity of the crystal structure is essential to its properties.","translation":"結晶構造の幾何学的構造はその特性にとって不可欠である。"}],"collocations":["high geometricity","low geometricity","enhance geometricity","geometricity of shape","geometricity of pattern"],"synonyms":["geometric quality","geometric form","geometric structure","geometric arrangement"],"antonyms":["irregularity","amorphicity","non-geometricity"]}],"etymology":{"value":"Derived from 'geometric' (relating to geometry) + '-ity' (a suffix used to form nouns expressing a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːəˌmɛˈtrɪsɪti/","syllables":"ge-o-met-ri-ci-ty"},"inflection":{"noun_plural":"geometricities"},"usage_notes":{"explanation":"'Geometricity' is a relatively uncommon term used to describe the extent to which something possesses geometric qualities. It is often used in technical or artistic contexts to emphasize the presence and importance of geometric shapes, patterns, or structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geometricity is very beautiful.","correct":"✓ The geometricity of the artwork is very beautiful.","note":"It's better to specify what possesses the geometricity, rather than using it as a general statement."},{"incorrect":"✗ The geometricity of the circle is perfect.","correct":"✓ The circle has perfect geometricity.","note":"It is more common to say that a shape 'has' geometricity."}],"priority":"★★☆"},"related_words":{"derivatives":["geometric","geometry","geometrically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Geometricity' is a technical term that describes the degree to which something exhibits geometric properties. It is used in specialized fields such as mathematics, art, and engineering to discuss the presence and characteristics of geometric shapes and structures. Understanding this term requires a strong vocabulary and familiarity with abstract concepts."},"example_sentences":[{"sentence":"The architect focused on the geometricity of the building's facade.","translation":"建築家は建物のファサードの幾何学的性質に焦点を当てた。","type":"noun","meaning_category":"幾何学的性質"},{"sentence":"The high geometricity of the design made it suitable for mass production.","translation":"そのデザインの高い幾何学的性質は、大量生産に適していた。","type":"noun","meaning_category":"幾何学的構造"},{"sentence":"The artist explored the relationship between geometricity and organic forms.","translation":"その芸術家は幾何学的性質と有機的な形との関係を探求した。","type":"noun","meaning_category":"幾何学的な特徴"}]}