{"word":"Blephariglottis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A former genus of North American orchids, now generally included in the genus Platanthera.","english_definition":"A taxonomic synonym for a group of North American orchids, now classified under the genus Platanthera. These orchids are characterized by fringed or deeply lobed petals.","examples":[{"sentence":"Blephariglottis ciliaris is now known as Platanthera ciliaris.","translation":"Blephariglottis ciliarisは、現在ではPlatanthera ciliarisとして知られています。"}],"collocations":[],"synonyms":["Platanthera (current genus)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'blepharis' (eyelash) and 'glotta' (tongue), referring to the fringed lip of the flower.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌblɛfərɪˈɡlɒtɪs/","syllables":"Ble-pha-ri-glot-tis"},"inflection":{"noun_plural":"Blephariglottis (or Blephariglottises)"},"usage_notes":{"explanation":"The term Blephariglottis is primarily of historical or taxonomic interest. It is no longer in common use as a current genus name, but may be encountered in older botanical texts or discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Blephariglottis in my garden, it was so rare!","correct":"✓ I saw a Platanthera in my garden, it was so rare!","note":"Use the current genus name, Platanthera, instead of the outdated Blephariglottis."}],"priority":"★★☆"},"related_words":{"derivatives":["Platanthera (current genus)","Platanthera ciliaris (formerly Blephariglottis ciliaris, Orange Fringed Orchid)","Platanthera blephariglottis (formerly Blephariglottis blephariglottis, White Fringed Orchid)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Very low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Blephariglottis' is a specialized botanical term referring to a former classification of orchids. Understanding its usage requires familiarity with plant taxonomy and the history of orchid classification. It is primarily encountered in scientific contexts. The current correct genus name is 'Platanthera' for these orchids."},"example_sentences":[{"sentence":"The former genus Blephariglottis included several species of fringed orchids.","translation":"かつてのBlephariglottis属には、縁毛のあるランのいくつかの種が含まれていました。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Botanists reclassified Blephariglottis blephariglottis as Platanthera blephariglottis.","translation":"植物学者はBlephariglottis blephariglottisをPlatanthera blephariglottisとして再分類しました。","type":"noun","meaning_category":"Taxonomy"}]}