{"word":"Yamun","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A river in northern India, the largest tributary of the Ganges.","english_definition":"A major river in Northern India, originating from the Yamunotri Glacier at a height of 6,387 metres (20,955 ft) on the southwestern slopes of Banderpooch peaks of the Lower Himalayas in Uttarakhand. It is the longest tributary of the Ganges (Ganga) in Northern India.","examples":[{"sentence":"The Taj Mahal is situated on the banks of the Yamun River.","translation":"タージ・マハルはヤムナー川のほとりに位置しています。"}],"collocations":["Yamun River","banks of the Yamun","Yamunotri Glacier"],"synonyms":["Jumna"],"antonyms":[]}],"etymology":{"value":"The name Yamun is derived from the Sanskrit word 'Yamuna'. In Hindu mythology, Yamuna is the daughter of Surya (the sun god) and twin sister of Yama (the god of death).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjʌmənə/","syllables":"Ya-mu-na"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"The Yamun is considered sacred in Hinduism. It plays a significant role in the agricultural and cultural landscape of northern India. Its water is used for irrigation and drinking, but it also faces significant pollution challenges.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":["Yamunotri (the source of the Yamun River)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but important in the context of Indian geography and culture.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Yamun' refers to a specific geographical feature, the Yamun River in India. Understanding this word requires some knowledge of Indian geography and culture. It is most likely to appear in contexts discussing India, its rivers, or related topics.","priority":"★★☆"},"example_sentences":[{"sentence":"The Yamun is heavily polluted in some areas.","translation":"ヤムナー川は一部地域でひどく汚染されている。","type":"proper noun","meaning_category":"River"},{"sentence":"Many cities depend on the Yamun for their water supply.","translation":"多くの都市がヤムナー川を水源として依存している。","type":"proper noun","meaning_category":"River"}]}