{"word":"Asexuals","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無性愛者たち","english_definition":"People who do not experience sexual attraction.","examples":[{"sentence":"Asexuals often feel excluded from mainstream LGBTQ+ discourse.","translation":"無性愛者は、しばしば主流のLGBTQ+の議論から除外されていると感じる。"},{"sentence":"Some asexuals still desire romantic relationships, while others do not.","translation":"無性愛者の中には、恋愛関係を望む人もいれば、そうでない人もいる。"}],"collocations":["asexual identity (無性愛のアイデンティティ)","asexual community (無性愛コミュニティ)","asexual spectrum (無性愛スペクトラム)"],"synonyms":["Ace (スラング)"],"antonyms":["sexuals"],"notes":"Asexualsは、性的欲求を経験しない人々を指す複数形の名詞です。無性愛は性的指向の一つであり、恋愛感情を持つかどうか、どのような性自認を持つかなど、個人差があります。","related_terms":["asexual","asexuality","demisexual","graysexual","aromantic"],"usage_examples":["Many asexuals find community and support online.","無性愛者の多くは、オンラインでコミュニティやサポートを見つける。"],"common_misconceptions":["Asexuality is not the same as celibacy or a lack of libido.","無性愛は禁欲や性欲の欠如とは異なる。"],"additional_information":"Asexuality is a sexual orientation characterized by a lack of sexual attraction to others. Asexuals may still experience romantic attraction, desire companionship, or engage in sexual activity for reasons other than sexual attraction (e.g., procreation, curiosity, or partner satisfaction). Asexuality exists on a spectrum, with some individuals identifying as demisexual (experiencing sexual attraction only after forming a close emotional bond) or graysexual (experiencing sexual attraction rarely or only under specific circumstances). The asexual community provides support and resources for individuals who identify as asexual and works to increase awareness and understanding of asexuality within society.","related_links":["https://www.asexuality.org/","https://www.thetrevorproject.org/resources/article/a-guide-to-understanding-asexuality/"]}],"etymology":{"value":"The term \"asexual\" comes from the prefix \"a-\" meaning \"without\" and \"sexual\" referring to sexuality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪˈsekʃuəlz/","syllables":"A-sex-u-als"},"inflection":{"noun_plural":"Asexuals"},"level_frequency":{"frequency_google_ngram":"Low Frequency","CEFR":"C2"},"readability_explanation":{"level":"C1","text":"The word 'Asexuals' refers to individuals who identify as asexual, meaning they do not experience sexual attraction. This term is commonly used in discussions about sexual orientation and LGBTQ+ identities. Understanding this word requires familiarity with concepts related to sexuality and identity."},"example_sentences":[{"sentence":"Asexuals are a diverse group with varying experiences and identities.","translation":"無性愛者は多様なグループであり、さまざまな経験とアイデンティティを持っています。"},{"sentence":"Many asexuals find support and community through online forums and organizations.","translation":"多くの無性愛者は、オンラインフォーラムや組織を通じてサポートとコミュニティを見つけます。"}]}