{"word":"Squinching","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"(目を)細める、しかめる","english_definition":"To squint slightly, often to express skepticism, amusement, or to see better in bright light.","examples":[{"sentence":"She was squinching her eyes in the bright sunlight.","translation":"彼女は明るい日差しの中で目を細めていた。"},{"sentence":"He was squinching his eyes as he tried to read the small print.","translation":"彼は小さな文字を読もうとして目をしかめていた。"},{"sentence":"She squinched her eyes at the joke, not sure if it was funny or offensive.","translation":"彼女はそのジョークが面白いのか失礼なのかわからず、目を細めた。"}],"collocations":["squinch up your eyes","squinch at something","squinch in the sun"],"synonyms":["squint","screw up eyes","narrow eyes"],"antonyms":["widen eyes","open eyes wide"]},{"part_of_speech":"noun","definition":"(目を細める)行為、表情","english_definition":"The act of squinching; a facial expression characterized by slightly narrowed eyes.","examples":[{"sentence":"The squinching of his eyes suggested that he didn't believe a word I said.","translation":"彼の目を細める表情は、私が言うことを一言も信じていないことを示唆していた。"},{"sentence":"She had a permanent squinching around her eyes from years of working outdoors.","translation":"彼女は長年屋外で働いていたため、目の周りに目を細める癖がついていた。"},{"sentence":"I noticed the slight squinching of her eyes when I mentioned his name.","translation":"彼の名前を口にしたとき、彼女がわずかに目を細めるのに気づいた。"}],"collocations":["a slight squinching","a knowing squinching","a permanent squinching"],"synonyms":["squint","narrowing of the eyes","facial expression"],"antonyms":["wide-eyed look"]}],"etymology":{"value":"Likely a variant of 'squint,' with influence from 'pinch' or 'squeeze.' The exact origin is uncertain, but it probably developed as an expressive alteration of 'squint' to emphasize the slightness or intent of the eye narrowing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɪntʃɪŋ/","syllables":"squinch-ing"},"inflection":{"verb_forms":{"present_simple":["squinch","squinches"],"past_simple":"squinched","past_participle":"squinched","present_participle":"squinching"},"noun_plural":"squinchings"},"usage_notes":{"explanation":"'Squinching' implies a slight and often intentional narrowing of the eyes. It can be used to express a variety of emotions, such as skepticism, amusement, or concentration. It is often used to describe the facial expression when someone is trying to see better in bright light. The word is relatively informal and expressive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was squinching because he was blind.","correct":"✓ He was squinting because he had poor vision.","note":"'Squinching' implies a deliberate or slight action, while 'squinting' can be a more general term for difficulty seeing. If someone has poor vision, 'squinting' is more appropriate."},{"incorrect":"✗ She was squinching her nose.","correct":"✓ She was wrinkling her nose.","note":"'Squinching' specifically refers to the eyes. To describe a similar action with the nose, use 'wrinkling' or 'scrunching'."}],"priority":"★★☆"},"related_words":{"derivatives":["squint (verb, noun)","squinty (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Squinching' describes a specific facial expression where someone narrows their eyes slightly. It's more nuanced than simply 'squinting' and often implies a deliberate action to see better, express skepticism, or amusement. The word isn't as common as 'squinting,' so it's more likely to be encountered in descriptive writing or informal conversation. Understanding the subtle difference between 'squinching' and 'squinting' can help you better interpret someone's facial expressions and intentions."},"example_sentences":[{"sentence":"The detective was squinching his eyes, trying to figure out if the suspect was lying.","translation":"刑事は容疑者が嘘をついているかどうかを見極めようと目を細めていた。","type":"verb","meaning_category":"expressing skepticism"},{"sentence":"She gave a slight squinching of her eyes, indicating that she understood the joke's hidden meaning.","translation":"彼女はわずかに目を細め、ジョークの隠された意味を理解していることを示した。","type":"noun","meaning_category":"facial expression"},{"sentence":"He was squinching against the glare of the setting sun.","translation":"彼は夕日のまぶしさに目を細めていた。","type":"verb","meaning_category":"seeing better in bright light"}]}