{"word":"graecizes","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ギリシャ風にする、ギリシャ語化する","english_definition":"To make something Greek in character or form; to express in Greek.","examples":[{"sentence":"The author graecizes the names of the characters in his novel.","translation":"その作家は小説の登場人物の名前をギリシャ風にしている。"},{"sentence":"The Roman Empire graecized much of its art and architecture.","translation":"ローマ帝国は芸術と建築の多くをギリシャ風にした。"}],"collocations":["graecize a name","graecize a word","graecize a custom"],"synonyms":["Hellenize","Grecize","Atticize"],"antonyms":["Romanize","Latinize"]}],"etymology":{"value":"From 'graecize', which comes from the Ancient Greek 'Graikos' (Γραικός), referring to the Greeks, and the suffix '-ize', indicating the act of making or conforming to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːsaɪzɪz/","syllables":"grae-ci-zes"},"inflection":{"verb_forms":{"present_simple":["graecizes"],"past_simple":"graecized","past_participle":"graecized","present_participle":"graecizing"}},"usage_notes":{"explanation":"'Graecize' means to make something conform to Greek characteristics, especially in language, culture, or style. It is relatively uncommon in modern usage.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He graecized the Roman architecture by adding arches.","correct":"✓ He graecized the Roman architecture by adding columns and pediments.","note":"Arches are more Roman than Greek; columns and pediments are more characteristic of Greek architecture."}],"priority":"★☆☆"},"related_words":{"derivatives":["graecism (ギリシャ語法、ギリシャ風の表現)","graecist (ギリシャ語学者)"],"related_terms":["Hellenic","Hellenistic","Greek"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Graecize' is a specialized term referring to the act of making something Greek in character or form. It is not commonly used in everyday language and is more likely to be encountered in academic or historical contexts. Understanding its meaning requires familiarity with Greek culture and history."},"example_sentences":[{"sentence":"The Renaissance artists often graecized their sculptures, drawing inspiration from classical Greek forms.","translation":"ルネサンスの芸術家たちは、古典的なギリシャの形からインスピレーションを得て、彫刻をギリシャ風にすることが多かった。","type":"verb","meaning_category":"ギリシャ風にする"},{"sentence":"Many English words are graecized forms of Latin words.","translation":"多くの英単語は、ラテン語の単語をギリシャ語化した形である。","type":"verb","meaning_category":"ギリシャ語化する"}]}