{"word":"unshale","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(地質学)頁岩を取り除く、頁岩を露出させる","english_definition":"To remove shale from, or expose shale in (a geological formation).","examples":[{"sentence":"The area was carefully unshaled to reveal the fossil bed.","translation":"その地域は化石層を露出させるために注意深く頁岩が取り除かれた。"},{"sentence":"The mining operation unshaled a large deposit of coal.","translation":"その採掘作業は大量の石炭鉱床の頁岩を取り除いた。"}],"collocations":["unshale a fossil bed","unshale a coal deposit"],"synonyms":["excavate","uncover","expose","reveal"],"antonyms":["cover","bury","conceal"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(比喩的に)隠されたものを明らかにする、本性を現す","english_definition":"(Figuratively) To reveal something hidden; to show one's true nature.","examples":[{"sentence":"The politician's carefully constructed image began to unshale under scrutiny.","translation":"その政治家の注意深く構築されたイメージは精査の下で本性を現し始めた。"},{"sentence":"As the pressure mounted, the company's true motives began to unshale.","translation":"プレッシャーが高まるにつれて、その会社の真の動機が明らかになり始めた。"}],"collocations":["unshale true motives","unshale a hidden agenda"],"synonyms":["reveal","unmask","expose","uncover"],"antonyms":["hide","conceal","mask"]}],"etymology":{"value":"Derived from the prefix 'un-' (meaning 'not' or 'reverse') and the noun 'shale' (a type of sedimentary rock). The verb likely originated in geological or mining contexts.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈʃeɪl/","syllables":"un-shale"},"inflection":{"verb_forms":{"present_simple":["unshale","unshales"],"past_simple":"unshaled","past_participle":"unshaled","present_participle":"unshaling"}},"usage_notes":{"explanation":"'Unshale' is a relatively rare word, primarily used in geological or mining contexts to describe the removal of shale rock. Figuratively, it can mean to reveal something that was previously hidden, similar to 'unmask' or 'uncover.' The figurative usage is even less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist unshaled his painting to the public.","correct":"✓ The artist unveiled his painting to the public.","note":"'Unshale' is typically used in a geological context or to describe the revealing of something negative. 'Unveil' is more appropriate for revealing art or something positive. "},{"incorrect":"✗ The truth will unshale itself.","correct":"✓ The truth will reveal itself.","note":"'Reveal' is a more common and natural choice for describing the truth becoming known."}],"priority":"★☆☆"},"related_words":{"derivatives":["shale","shaly"],"related_terms":["excavate","unearth","strip mining"]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning materials)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unshale' is a specialized term, primarily used in geology and mining. It refers to the process of removing shale rock to expose something beneath. Its figurative use is rare and implies the unveiling of something previously hidden, often with negative connotations. Due to its limited usage, it is not commonly encountered in general English. "},"example_sentences":[{"sentence":"The construction crew had to carefully unshale the hillside before building the foundation.","translation":"建設作業員は基礎を建設する前に、丘の中腹の頁岩を注意深く取り除く必要があった。","type":"verb (vt)","meaning_category":"地質学"},{"sentence":"The investigation began to unshale a complex web of corruption.","translation":"調査は複雑な汚職の網を明らかにし始めた。","type":"verb (vt)","meaning_category":"比喩的"}]}