{"word":"Iarovization","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(農業)春化処理：種子を低温にさらして、その後の開花を促進する農業技術。特に、ソ連のルイセンコによって提唱され、後に科学的根拠がないとして否定された。","english_definition":"(Agriculture) The practice of subjecting seeds to low temperatures in order to accelerate subsequent flowering. Particularly associated with Trofim Lysenko in the Soviet Union, and later discredited as unscientific.","examples":[{"sentence":"Iarovization was once widely practiced in Soviet agriculture.","translation":"春化処理はかつてソ連の農業で広く行われていた。"},{"sentence":"Lysenko's theories on iarovization were eventually proven false.","translation":"ルイセンコの春化処理に関する理論は、最終的に誤りであることが証明された。"}],"collocations":["practice iarovization","Lysenko's iarovization","theory of iarovization"],"synonyms":["vernalization"],"antonyms":[]}],"etymology":{"value":"Derived from Russian яровизация (yarovizatsiya), from ярово́й (yarovóy, “spring”), referring to spring crops.","priority":"Medium"},"pronunciation":{"ipa":"/ˌjɑːroʊvaɪˈzeɪʃən/","syllables":"I-a-ro-vi-za-tion"},"inflection":{"noun_plural":"iarovizations"},"usage_notes":{"explanation":"The term 'iarovization' is primarily historical, referring to a specific period and agricultural theory in the Soviet Union. It's closely linked to the controversial figure of Trofim Lysenko and his pseudoscientific ideas. While the general concept of vernalization (exposing seeds to cold) is valid, 'iarovization' often carries negative connotations due to its association with Lysenkoism.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ Iarovization is a modern agricultural technique.","correct":"✓ Vernalization is a modern agricultural technique.","note":"Use 'vernalization' for the general technique; 'iarovization' is specific to the historical Soviet context."}],"priority":"Low"},"related_words":{"derivatives":["yarovoi (Russian: spring crop)","Lysenkoism (ルイセンコ主義)","vernalization (春化処理)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Iarovization' is a highly specialized term primarily encountered in historical or scientific contexts related to Soviet agriculture and the theories of Trofim Lysenko. Understanding requires familiarity with the history of science and agriculture in the Soviet Union. Due to its specific and often controversial historical context, it's not a commonly used term."},"example_sentences":[{"sentence":"The experiment with iarovization failed to increase crop yields.","translation":"春化処理の実験は、作物の収穫量を増やすことに失敗した。","type":"noun","meaning_category":"agricultural technique"},{"sentence":"Many scientists criticized Lysenko's iarovization methods as unscientific.","translation":"多くの科学者は、ルイセンコの春化処理法を非科学的だと批判した。","type":"noun","meaning_category":"historical practice"}]}