{"word":"Traulism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of deliberately using offensive or controversial language or behavior to provoke a reaction or cause disruption, often online.","english_definition":"The act of deliberately using offensive or controversial language or behavior to provoke a reaction or cause disruption, often online.","examples":[{"sentence":"His online behavior was characterized by Traulism, constantly seeking to offend others.","translation":"彼のオンラインでの行動はトローリズムを特徴としており、常に他人を不快にさせようとしていた。"},{"sentence":"The forum moderators struggled to manage the Traulism exhibited by some users.","translation":"フォーラムのモデレーターは、一部のユーザーによって示されるトローリズムの管理に苦労した。"}],"collocations":["online Traulism","exhibit Traulism","practice Traulism"],"synonyms":["trolling","flaming","baiting","griefing"],"antonyms":["civility","respect","decorum"]}],"etymology":{"value":"A blend of 'troll' (in the online sense of provoking others) and 'autism', suggesting a perceived lack of social awareness or empathy in such behavior.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtrɔːlɪzəm","syllables":"Trau-lism"},"inflection":{"noun_plural":"Traulisms"},"usage_notes":{"explanation":"'Traulism' is a relatively new and somewhat controversial term. It is used to describe online behavior that is deliberately offensive or disruptive, and it implies that this behavior stems from a lack of social understanding or empathy, similar to some characteristics associated with autism. The term is often criticized for being insensitive and potentially offensive to individuals with autism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with Traulism.","correct":"✓ His behavior could be described as Traulism.","note":"'Traulism' is a description of behavior, not a medical diagnosis."},{"incorrect":"✗ Traulism is a symptom of autism.","correct":"✓ The term 'Traulism' is sometimes used to suggest a connection to a lack of social awareness, but it is not a recognized symptom of autism, and the term is often considered offensive.","note":"It is important to understand that 'Traulism' is not a symptom of autism, and using the term in this way is insensitive."}],"priority":"★★☆"},"related_words":{"derivatives":["Traul (noun: a person who engages in Traulism)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (rare and informal)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Traulism' is a neologism, a newly coined word, used to describe the act of deliberately being offensive or disruptive online. The term is formed by blending 'troll' and 'autism', implying a lack of social awareness. It is important to note that this term is controversial and can be offensive, particularly to those with autism. It is used to describe a behavior, not a medical condition."},"example_sentences":[{"sentence":"The comments section was filled with examples of Traulism, making it difficult to have a constructive discussion.","translation":"コメント欄はトローリズムの例で溢れており、建設的な議論をすることが困難だった。","type":"noun","meaning_category":"offensive online behavior"},{"sentence":"His constant attempts to provoke others online were a clear demonstration of Traulism.","translation":"彼のオンラインで他人を挑発しようとする絶え間ない試みは、トローリズムの明確なデモンストレーションだった。","type":"noun","meaning_category":"offensive online behavior"}]}