{"word":"Argonaut","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(ギリシア神話) アルゴ船の乗組員、アルゴナウタイ","english_definition":"(Greek mythology) One of the heroes who sailed with Jason on the ship Argo in search of the Golden Fleece.","examples":[{"sentence":"Jason was the leader of the Argonauts.","translation":"イアソンはアルゴナウタイのリーダーだった。"},{"sentence":"The Argonauts faced many challenges on their voyage.","translation":"アルゴナウタイは航海で多くの困難に直面した。"}],"collocations":["Jason and the Argonauts","the voyage of the Argonauts"],"synonyms":["hero","adventurer","sailor"],"antonyms":[]},{"part_of_speech":"noun","definition":"(動物) アオイガイ","english_definition":"A pelagic cephalopod mollusk of the genus Argonauta, characterized by the thin, papery shell secreted by the female.","examples":[{"sentence":"The female Argonaut creates a delicate shell to protect her eggs.","translation":"メスのアオイガイは、卵を保護するために繊細な殻を作る。"},{"sentence":"Argonauts are found in warm and tropical oceans.","translation":"アオイガイは温暖な熱帯の海で見られる。"}],"collocations":["paper nautilus","Argonaut shell"],"synonyms":["paper nautilus"],"antonyms":[]}],"etymology":{"value":"From Greek Ἀργοναύτης (Argonautēs), from Ἀργώ (Argṓ, “the ship Argo”) + ναύτης (naútēs, “sailor”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrɡənɔːt/","syllables":"Ar-go-naut"},"inflection":{"noun_plural":"Argonauts"},"usage_notes":{"explanation":"The term \"Argonaut\" has two primary meanings: one refers to the mythological heroes who sailed with Jason, and the other refers to a type of cephalopod mollusk. Context is crucial in determining which meaning is intended. When referring to the mythological figures, the term is often capitalized. When referring to the mollusk, it is typically not capitalized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Argonaut was a ship.","correct":"✓ The Argo was a ship.","note":"The Argonaut refers to a member of the crew, not the ship itself. The ship was called the Argo."}],"priority":"★★☆"},"related_words":{"derivatives":["Argonautic (adjective)"],"phrasal_verbs":[],"related_concepts":["Greek mythology","Golden Fleece","Cephalopod","Mollusk"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Argonaut\" has two distinct meanings, one from Greek mythology and one from marine biology. In mythology, it refers to the heroes who sailed with Jason on the Argo in search of the Golden Fleece. In zoology, it refers to a genus of cephalopod mollusks, particularly the paper nautilus. Understanding the context is key to interpreting the intended meaning. The mythological meaning is more common in literature and historical contexts, while the zoological meaning is more common in scientific or nature-related contexts."},"example_sentences":[{"sentence":"The legend of Jason and the **Argonauts** is a classic tale of adventure.","translation":"イアソンとアルゴナウタイの伝説は、冒険の古典的な物語である。","type":"noun","meaning_category":"Mythology"},{"sentence":"The female **Argonaut** is known for creating a delicate, papery shell.","translation":"メスのアオイガイは、繊細な紙のような殻を作ることが知られている。","type":"noun","meaning_category":"Zoology"},{"sentence":"The **Argonauts** faced many mythical creatures during their quest for the Golden Fleece.","translation":"アルゴナウタイは、金羊毛を求めて冒険する中で、多くの神話上の生き物に遭遇した。","type":"noun","meaning_category":"Mythology"},{"sentence":"Scientists are studying the unique reproductive strategies of the **Argonaut**.","translation":"科学者たちは、アオイガイの独特な繁殖戦略を研究している。","type":"noun","meaning_category":"Zoology"}]}