{"word":"Huntaway","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ニュージーランド原産の)ハンタウェイ犬","english_definition":"A breed of dog originating in New Zealand, used for sheep herding, known for its loud, barking voice to drive sheep.","examples":[{"sentence":"The farmer used a Huntaway to round up the sheep.","translation":"農夫はハンタウェイを使って羊を追い集めた。"},{"sentence":"Huntaways are intelligent and energetic working dogs.","translation":"ハンタウェイは知的でエネルギッシュな作業犬である。"}],"collocations":["sheep herding","working dog","New Zealand breed"],"synonyms":["New Zealand Huntaway"],"antonyms":[]}],"etymology":{"value":"The name 'Huntaway' comes from the dog's method of 'hunting' sheep away by barking.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhʌntəweɪ/","syllables":"Hun-ta-way"},"inflection":{"noun_plural":"Huntaways"},"usage_notes":{"explanation":"Huntaways are primarily working dogs and not typically kept as pets unless they have a job to do. They are known for their stamina and ability to work in tough conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Huntaway is a good dog for apartment living.","correct":"✓ The Huntaway needs a lot of space and exercise, making it unsuitable for apartment living.","note":"Huntaways are high-energy dogs that require a lot of space and exercise."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Huntaway' refers to a specific breed of dog from New Zealand. These dogs are primarily used for herding sheep and are known for their loud barking, which helps them move the sheep. Because it is a specialized term, it is not commonly used outside of contexts involving sheep farming or dog breeds. Understanding the term requires some familiarity with agricultural practices or dog breeds.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **Huntaway** barked loudly, driving the sheep towards the pen.","translation":"ハンタウェイは大きな声で吠え、羊を囲いの方へ追い立てた。","type":"noun","meaning_category":"dog breed"},{"sentence":"**Huntaways** are prized for their herding abilities in the rugged terrain of New Zealand.","translation":"ハンタウェイはニュージーランドの険しい地形での羊追い能力が高く評価されている。","type":"noun","meaning_category":"dog breed"}]}