{"word":"pedatrophy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小児消耗症、乳幼児の進行性栄養不良","english_definition":"Progressive malnutrition in infants and young children; infantile atrophy.","examples":[{"sentence":"Pedatrophy can lead to severe developmental delays.","translation":"小児消耗症は重度の発達遅延を引き起こす可能性があります。"},{"sentence":"Early diagnosis is crucial in managing pedatrophy.","translation":"小児消耗症の管理には早期診断が不可欠です。"}],"collocations":["severe pedatrophy (重度の小児消耗症)","infantile pedatrophy (乳幼児の小児消耗症)"],"synonyms":["infantile atrophy","marasmus","failure to thrive"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「paidos」（子供）+「atrophia」（萎縮）に由来。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpiːdəˈtrɒfi/","syllables":"pe-da-tro-phy"},"inflection":{"noun_plural":"pedatrophies"},"usage_notes":{"explanation":"Pedatrophy is a medical term that describes a severe form of malnutrition primarily affecting infants and young children. It is characterized by a progressive wasting away of tissues due to inadequate nutrient intake or absorption. This condition is relatively rare in developed countries but remains a significant concern in regions with limited access to nutritious food and adequate healthcare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child was diagnosed with atrophy.","correct":"✓ The child was diagnosed with pedatrophy.","note":"'Atrophy' is a general term for wasting away of tissues, while 'pedatrophy' specifically refers to this condition in infants and young children."}],"priority":"★★☆"},"related_words":{"derivatives":["atrophy (萎縮)","pediatrics (小児科)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pedatrophy' is a highly specialized medical term referring to severe malnutrition in infants and young children, leading to wasting of tissues. It is not commonly used in everyday language and is primarily encountered in medical contexts. Understanding this term requires a strong grasp of medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The infant presented with symptoms consistent with severe pedatrophy.","translation":"その乳児は重度の小児消耗症に一致する症状を呈した。","type":"medical","meaning_category":"小児消耗症"},{"sentence":"Nutritional intervention is essential in treating pedatrophy.","translation":"小児消耗症の治療には栄養介入が不可欠である。","type":"medical","meaning_category":"小児消耗症"}]}