{"word":"tabulator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"集計機、計算機","english_definition":"A machine for counting or calculating, especially one used for processing census data or other statistical information.","examples":[{"sentence":"The company used a tabulator to process the survey results.","translation":"その会社は調査結果を処理するために集計機を使用した。"},{"sentence":"Early tabulators were electromechanical.","translation":"初期の集計機は電気機械式だった。"}],"collocations":["electromechanical tabulator","census tabulator"],"synonyms":["calculator","computer","adding machine"],"antonyms":[]},{"part_of_speech":"noun","definition":"表作成者、表計算ソフト","english_definition":"A person or software that creates tables; a spreadsheet program.","examples":[{"sentence":"The tabulator helped organize the data into a clear table.","translation":"表作成者はデータを整理してわかりやすい表にした。"},{"sentence":"Excel is a popular tabulator.","translation":"エクセルは人気のある表計算ソフトです。"}],"collocations":["data tabulator","spreadsheet tabulator"],"synonyms":["spreadsheet","worksheet"],"antonyms":[]}],"etymology":{"value":"From 'tabulate' + '-or'. 'Tabulate' comes from Latin 'tabula' meaning 'tablet' or 'table'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtæbjuleɪtər","syllables":"tab-u-la-tor"},"inflection":{"noun_plural":"tabulators"},"usage_notes":{"explanation":"The term 'tabulator' historically referred to electromechanical machines used for data processing, particularly in census operations. Today, it more commonly refers to software or individuals involved in creating tables and spreadsheets. The context usually clarifies the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The tabulator is a person who counts.","correct":"The tabulator is a machine or software that counts and organizes data into tables.","note":"While a person can use a tabulator, the term primarily refers to the machine or software itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["tabulate","tabulation","table"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tabulator' is a term with two primary meanings: historically, it referred to a machine used for processing large datasets, such as census data. In modern usage, it can also refer to a person or software program that creates tables, often using spreadsheet software. The context is crucial for understanding which meaning is intended. The word is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"Herman Hollerith invented the electromechanical tabulator used in the 1890 census.","translation":"ハーマン・ホレリスは1890年の国勢調査で使用された電気機械式集計機を発明した。","type":"noun","meaning_category":"集計機"},{"sentence":"The accountant used a tabulator to analyze the company's financial data.","translation":"会計士は会社の財務データを分析するために集計機を使用した。","type":"noun","meaning_category":"集計機"},{"sentence":"She is a skilled tabulator and can create complex spreadsheets quickly.","translation":"彼女は熟練した表作成者であり、複雑なスプレッドシートを素早く作成できる。","type":"noun","meaning_category":"表作成者"},{"sentence":"The software functions as a powerful tabulator, allowing users to sort and filter data easily.","translation":"そのソフトウェアは強力な表計算ソフトとして機能し、ユーザーがデータを簡単に並べ替えたりフィルタリングしたりできる。","type":"noun","meaning_category":"表計算ソフト"}]}