{"word":"unsuperannuated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"年金生活に入っていない、退職していない","english_definition":"Not superannuated; not retired on a pension; still active or in service.","examples":[{"sentence":"He remained an unsuperannuated member of the faculty, continuing to teach and research well past the typical retirement age.","translation":"彼は年金生活に入らず、典型的な退職年齢を過ぎても教えたり研究したりし続け、教員として現役だった。"},{"sentence":"The company benefited from having several unsuperannuated employees with decades of experience.","translation":"その会社は、数十年の経験を持つ年金生活に入っていない従業員が数人いることの恩恵を受けた。"}],"collocations":["unsuperannuated employee","unsuperannuated member","remain unsuperannuated"],"synonyms":["active","employed","working","in service"],"antonyms":["superannuated","retired","pensioned","inactive"]}],"etymology":{"value":"\"Un-\" (not) + \"superannuated\" (retired on a pension or obsolete). \"Superannuated\" itself comes from Latin \"superannuatus,\" past participle of \"superannuare\" (to outlive one's year, to be too old), from \"super\" (above, beyond) + \"annus\" (year).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌsuːpərˈænjueɪtɪd/","syllables":"un-su-per-an-ju-a-ted"},"inflection":{"notes":"Adjective; no comparative or superlative forms typically used."},"usage_notes":{"explanation":"\"Unsuperannuated\" is a relatively uncommon word, primarily used in formal or technical contexts to describe someone who is eligible for retirement benefits but has not yet retired and remains actively employed. It emphasizes the contrast with those who have already retired and are receiving a pension.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsuperannuated car was still running smoothly.","correct":"✓ The car, though old, was still running smoothly.","note":"\"Unsuperannuated\" applies to people, not objects. Use other words to describe the condition of objects."},{"incorrect":"✗ She was unsuperannuated because she was too young to retire.","correct":"✓ She was not yet eligible for retirement.","note":"The term implies eligibility for retirement but a choice to remain working. If someone is simply too young, other phrasing is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["superannuate (verb: to retire on a pension or to make obsolete)","superannuation (noun: retirement pension or the act of retiring someone on a pension)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unsuperannuated\" is a formal and uncommon term. It is used to describe someone who is eligible for retirement (superannuation) but has not yet retired and is still actively working. This word is rarely encountered in everyday language and is more likely to appear in legal, financial, or human resources contexts. Understanding the root word \"superannuated\" is essential to grasping the meaning of \"unsuperannuated.\""},"example_sentences":[{"sentence":"The university retained many unsuperannuated professors to mentor younger faculty.","translation":"その大学は、若い教員の指導役として、年金生活に入っていない教授を多数雇用し続けた。","type":"adjective","meaning_category":"年金生活に入っていない"},{"sentence":"The unsuperannuated workforce brought a wealth of experience to the project.","translation":"年金生活に入っていない労働力は、プロジェクトに豊富な経験をもたらした。","type":"adjective","meaning_category":"退職していない"}]}