{"word":"guileless-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"無邪気な目をしている、無垢な目をしている、だまされやすそうな目をしている","english_definition":"having eyes that suggest innocence and lack of deception; appearing naive and easily deceived.","examples":[{"sentence":"The child had a guileless-eyed expression that melted my heart.","translation":"その子は無邪気な目をしていたので、私の心を溶かした。"},{"sentence":"He looked at her with a guileless-eyed gaze, making it hard to believe he was lying.","translation":"彼は彼女を無垢な目で見つめたので、彼が嘘をついているとは信じがたかった。"},{"sentence":"The con artist targeted guileless-eyed tourists, knowing they would be easy to trick.","translation":"詐欺師は、だまされやすそうな観光客をターゲットにした。彼らは騙しやすいと知っていたからだ。"}],"collocations":["guileless-eyed child","guileless-eyed gaze","guileless-eyed expression","look guileless-eyed","stare guileless-eyed"],"synonyms":["innocent-eyed","naive-eyed","ingenuous-eyed","artless-eyed","unworldly-eyed","open-eyed"],"antonyms":["cunning-eyed","wary-eyed","suspicious-eyed","knowing-eyed","deceptive-eyed","scheming-eyed"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'guileless' (without deceit or cunning) and 'eyed' (having eyes of a particular kind). The term suggests that the eyes themselves convey the quality of being without guile.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡaɪlləs aɪd/","syllables":"guile-less-eyed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Guileless-eyed' is a descriptive adjective used to characterize someone whose eyes convey a sense of innocence, naivety, and lack of deceit. It suggests that the person is straightforward, honest, and perhaps easily trusting. The term is often used to evoke a feeling of tenderness or vulnerability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was guileless eyed.","correct":"He was guileless-eyed.","note":"The compound adjective should be hyphenated."},{"incorrect":"She had a guileless eyes.","correct":"She had guileless-eyed look.","note":"'Guileless-eyed' is an adjective and should modify a noun, such as 'look', 'expression', or 'gaze'."}],"priority":"★★☆"},"related_words":{"derivatives":["guileless (adjective: without deceit)","guile (noun: deceit, cunning)","eyed (adjective suffix: having eyes of a particular kind)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (The term is relatively uncommon)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Guileless-eyed' is a compound adjective that describes someone whose eyes suggest innocence and a lack of deception. It is a more literary or descriptive term, implying that the person's eyes reveal their naive and trusting nature. This term is not commonly used in everyday conversation but is more likely to appear in literature or descriptive writing to create a specific impression of a character or person."},"example_sentences":[{"sentence":"The puppy's guileless-eyed stare begged for a treat.","translation":"子犬の無邪気な目は、おやつをねだっていた。","type":"descriptive","meaning_category":"innocent appearance"},{"sentence":"She approached the situation with a guileless-eyed optimism, unaware of the potential risks.","translation":"彼女は無垢な目で楽観的に状況に臨んだ。潜在的なリスクに気づかずに。","type":"descriptive","meaning_category":"naive outlook"},{"sentence":"Despite his age, he retained a guileless-eyed wonder at the world around him.","translation":"彼は年を重ねても、周りの世界に対する無邪気な驚きを持ち続けていた。","type":"descriptive","meaning_category":"innocent wonder"}]}