{"word":"habituation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"慣れ、習慣化、馴化","english_definition":"the process of becoming accustomed to a stimulus, resulting in a decreased response over time.","examples":[{"sentence":"The animals showed habituation to the presence of humans.","translation":"動物たちは人間の存在に慣れを示した。"},{"sentence":"Habituation can lead to a decrease in the effectiveness of a drug.","translation":"慣れは薬の効果の低下につながる可能性がある。"},{"sentence":"The study examined the habituation response in infants.","translation":"その研究は、乳児における慣れ反応を調べた。"}],"collocations":["sensory habituation (感覚慣れ)","auditory habituation (聴覚慣れ)","olfactory habituation (嗅覚慣れ)","visual habituation (視覚慣れ)","habituation training (慣れ訓練)","habituation paradigm (慣れパラダイム)"],"synonyms":["adaptation","desensitization","familiarization","adjustment","accustomization"],"antonyms":["sensitization","dishabituation"]},{"part_of_speech":"noun","definition":"（心理学）習慣化、慣れ","english_definition":"(psychology) a decrease in response to a stimulus after repeated presentations.","examples":[{"sentence":"Habituation is a basic form of learning.","translation":"慣れは学習の基本的な形態である。"},{"sentence":"Habituation allows organisms to ignore irrelevant stimuli.","translation":"慣れによって、生物は無関係な刺激を無視することができる。"}],"collocations":["stimulus habituation (刺激慣れ)","response habituation (反応慣れ)"],"synonyms":["learning","conditioning"],"antonyms":["sensitization"]}],"etymology":{"value":"Late 18th century: from French habituation, from habituer ‘accustom’, from habit ‘habit’.","priority":"★★☆"},"pronunciation":{"ipa":"/həˌbɪtʃuˈeɪʃən/","syllables":"ha-bit-u-a-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Habituation refers to the process where repeated exposure to a stimulus leads to a decrease in response. It's a fundamental learning mechanism that allows organisms to filter out irrelevant or harmless stimuli and focus on novel or important ones. In psychology and neuroscience, habituation is studied to understand basic learning processes and sensory processing. It differs from adaptation, which is a sensory-specific decrease in sensitivity, while habituation involves a more general decrease in response. Dishabituation is the recovery of a habituated response after a change in stimulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a habituation of smoking.","correct":"✓ He has a habit of smoking.","note":"Habituation refers to the process of getting used to something, not the habit itself. Use 'habit' to describe a regular behavior. "},{"incorrect":"✗ Habituation is the same as fatigue.","correct":"✓ Habituation is different from fatigue.","note":"Habituation is a learning process, while fatigue is a physiological state of reduced responsiveness due to prolonged activity."}],"priority":"★★☆"},"related_words":{"derivatives":["habituate (verb)","habituated (adjective)","habitual (adjective)","habit (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Habituation' is a relatively advanced term used to describe the process of becoming accustomed to a stimulus, leading to a reduced response over time. It's often used in psychology, neuroscience, and biology to explain how organisms learn to ignore irrelevant or harmless stimuli. Understanding this term requires some background knowledge in these fields. It's not a commonly used word in everyday conversation, but it's important for those studying related scientific disciplines."},"example_sentences":[{"sentence":"The constant noise eventually led to habituation, and she no longer noticed it.","translation":"絶え間ない騒音はやがて慣れにつながり、彼女はもはやそれに気づかなくなった。","type":"general","meaning_category":"慣れ"},{"sentence":"Researchers used a habituation paradigm to study infant attention.","translation":"研究者たちは、乳児の注意力を研究するために慣れパラダイムを使用した。","type":"psychology","meaning_category":"心理学"},{"sentence":"Habituation to the drug's effects can occur with prolonged use.","translation":"薬の効果への慣れは、長期使用で起こりうる。","type":"medical","meaning_category":"医学"}]}