{"word":"tourism-reliant","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"観光に依存している、観光業に頼っている","english_definition":"dependent on tourism as a major source of income or economic activity.","examples":[{"sentence":"The island is a tourism-reliant economy.","translation":"その島は観光業に依存した経済です。"},{"sentence":"Many tourism-reliant businesses suffered during the pandemic.","translation":"パンデミックの間、多くの観光業に依存した企業が苦しみました。"},{"sentence":"The government is trying to diversify the economy to reduce its reliance on tourism.","translation":"政府は観光への依存を減らすために経済の多様化を図っています。"}],"collocations":["tourism-reliant economy (観光依存経済)","tourism-reliant industry (観光依存産業)","tourism-reliant community (観光依存コミュニティ)","highly tourism-reliant (高度に観光依存)"],"synonyms":["tourism-dependent","tourism-based"],"antonyms":["diversified","self-sufficient","independent"],"related_words":["tourism","reliance","dependent"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'tourism' (the activity of traveling to a place for pleasure) and 'reliant' (dependent on something). The combination describes an entity (e.g., a region, an economy) that heavily depends on tourism for its financial well-being.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʊərɪzəm rɪˈlaɪənt/","syllables":"tour-ism re-li-ant"},"inflection":{"notes":"This is an adjective and does not have inflections like verbs or nouns."},"usage_notes":{"explanation":"'Tourism-reliant' is typically used to describe economies, regions, or businesses that depend heavily on income generated from tourism. It often carries a connotation of vulnerability, as these entities are susceptible to economic downturns or external shocks that affect travel, such as pandemics, natural disasters, or political instability. The term is often used in economic and geographical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very reliant of tourism.","correct":"✓ The city is very reliant on tourism.","note":"The correct preposition to use with 'reliant' is 'on'. It should be 'reliant on'."},{"incorrect":"✗ The tourism-rely economy.","correct":"✓ The tourism-reliant economy.","note":"The correct form is 'tourism-reliant', which is an adjective. 'Tourism-rely' is grammatically incorrect."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage due to global events affecting tourism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tourism-reliant' is used to describe a situation where a place or business heavily depends on tourism for its income. It's often used when discussing the economy of a region or country that gets a large portion of its money from tourists. It's a relatively straightforward term, but understanding it requires knowing what 'tourism' and 'reliant' mean individually. It's more common in economic or geographical discussions."},"example_sentences":[{"sentence":"The Caribbean islands are highly **tourism-reliant**.","translation":"カリブ海の島々は非常に観光に依存しています。","type":"adjective","meaning_category":"観光に依存している"},{"sentence":"The pandemic highlighted the risks of being a **tourism-reliant** economy.","translation":"パンデミックは、観光依存経済であることのリスクを浮き彫りにしました。","type":"adjective","meaning_category":"観光に依存している"},{"sentence":"The government is investing in new industries to reduce the region's **tourism-reliant** nature.","translation":"政府は、その地域の観光依存の性質を減らすために、新しい産業に投資しています。","type":"adjective","meaning_category":"観光に依存している"}]}