{"word":"Poisonbush","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A shrub or small tree of the genus *Dendrocnide* (formerly *Laportea*), native to Australia and Southeast Asia, known for its extremely painful stinging hairs.","english_definition":"A shrub or small tree of the genus *Dendrocnide*, native to Australia and Southeast Asia, known for its extremely painful stinging hairs.","examples":[{"sentence":"Avoid touching the poisonbush in the rainforest.","translation":"熱帯雨林では、ポイズンブッシュに触れないようにしてください。"},{"sentence":"The poisonbush's sting can cause severe pain for days.","translation":"ポイズンブッシュの刺傷は、数日間激しい痛みを引き起こす可能性があります。"}],"collocations":["touch poisonbush","avoid poisonbush","poisonbush sting"],"synonyms":["stinging tree","gympie-gympie"],"antonyms":[]}],"etymology":{"value":"Combination of \"poison\" and \"bush\", referring to the plant's poisonous stinging hairs and shrub-like growth habit.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɔɪzənˌbʊʃ/","syllables":"poi-son-bush"},"inflection":{"noun_plural":"Poisonbushes"},"usage_notes":{"explanation":"The term \"poisonbush\" generally refers to plants of the genus *Dendrocnide*, particularly those with potent stinging hairs that can cause intense pain. It's important to note that the common name can vary regionally, and the specific species referred to may differ depending on the location.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I accidentally brushed against a poisonbush and now I have a rash.","correct":"✓ I accidentally brushed against a poisonbush and now I have a severe stinging sensation.","note":"While a rash may develop, the immediate and primary effect is an intense stinging pain, not just a rash."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Dendrocnide","stinging hairs","toxin","irritant"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Poisonbush\" refers to a specific type of plant, typically found in Australia and Southeast Asia, known for its painful stinging hairs. It is not a common term in everyday conversation, but someone interested in botany, hiking, or survival skills in those regions might encounter it. The word is fairly self-explanatory, combining \"poison\" and \"bush\" to indicate a poisonous shrub.","priority":"★★☆"},"example_sentences":[{"sentence":"The hiker was warned to stay away from the poisonbush.","translation":"ハイカーはポイズンブッシュに近づかないように警告された。","type":"noun","meaning_category":"plant"},{"sentence":"The poisonbush is notorious for its painful sting.","translation":"ポイズンブッシュは、その痛みを伴う刺傷で悪名高い。","type":"noun","meaning_category":"plant"}]}