{"word":"brewer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ビール醸造業者、ビール醸造所経営者","english_definition":"A person or company that makes beer.","examples":[{"sentence":"He works as a brewer at a local brewery.","translation":"彼は地元のビール醸造所でビール醸造業者として働いています。"},{"sentence":"The brewers use traditional methods to produce their beer.","translation":"そのビール醸造業者は伝統的な方法でビールを製造しています。"},{"sentence":"The brewer is experimenting with new flavors.","translation":"そのビール醸造業者は新しい風味を試しています。"}],"collocations":["craft brewer (クラフトビール醸造業者)","microbrewer (小規模ビール醸造業者)","commercial brewer (商業ビール醸造業者)"],"synonyms":["ale maker","maltster","beer maker"],"antonyms":[]}],"etymology":{"value":"Middle English brewere, from Old English brēowere (“brewer”), equivalent to brew + -er.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbruːər/","syllables":"brew-er"},"inflection":{"noun_plural":"brewers"},"usage_notes":{"explanation":"A 'brewer' is someone who brews beer, often on a commercial scale. The term can refer to both the individual who physically makes the beer and the company or organization that produces it. In recent years, the term 'craft brewer' has become popular to describe smaller, independent brewers who focus on producing high-quality, flavorful beers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a brooder.","correct":"He is a brewer.","note":"'Brooder' means someone who worries or thinks deeply about something, whereas 'brewer' is someone who makes beer. They sound similar but have different meanings."}],"priority":"★★☆"},"related_words":{"derivatives":["brewery (ビール醸造所)","brewing (ビール醸造)","brew (ビールを醸造する、お茶などを入れる)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"brewer\" refers to a person or company that makes beer. It's a straightforward term, but its usage is often associated with discussions about the beer industry, craft breweries, and the brewing process. Understanding the term is useful for reading articles or participating in conversations about beer and related topics."},"example_sentences":[{"sentence":"The small town is known for its award-winning brewer.","translation":"その小さな町は、受賞歴のあるビール醸造業者で知られています。","type":"general","meaning_category":"person"},{"sentence":"The brewer uses hops grown on their own farm.","translation":"そのビール醸造業者は、自分たちの農場で栽培されたホップを使用しています。","type":"specific","meaning_category":"process"},{"sentence":"Many craft brewers are focused on sustainable practices.","translation":"多くのクラフトビール醸造業者は、持続可能な慣行に焦点を当てています。","type":"industry","meaning_category":"industry"}]}