{"word":"self-belittler","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己卑下する人、自分の価値を低く見積もる人","english_definition":"A person who habitually belittles themselves; someone who minimizes their own accomplishments, qualities, or worth.","examples":[{"sentence":"He's such a self-belittler; he never acknowledges his achievements.","translation":"彼は本当に自己卑下する人で、自分の功績を決して認めない。"},{"sentence":"As a self-belittler, she often downplays her talents.","translation":"自己卑下する人として、彼女は自分の才能をしばしば控えめに言う。"}],"collocations":["chronic self-belittler","serial self-belittler","reformed self-belittler"],"synonyms":["self-deprecator","self-minimizer","humble person (sometimes)","modest person (sometimes)"],"antonyms":["braggart","boaster","egotist","self-aggrandizer"]}],"etymology":{"value":"Compound word formed from \"self\" + \"belittler\". \"Self\" refers to the person, and \"belittler\" refers to someone who makes something seem unimportant or less significant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.bɪˈlɪt.lər/","syllables":"self-bi-lit-ler"},"inflection":{"noun_plural":"self-belittlers"},"usage_notes":{"explanation":"The term \"self-belittler\" describes someone who consistently diminishes their own importance, skills, or accomplishments. This behavior can stem from low self-esteem, a desire to appear humble, or a fear of appearing arrogant. While some humility can be seen as a positive trait, excessive self-belittling can be detrimental to a person's self-worth and confidence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a self-belittle.","correct":"✓ She is a self-belittler.","note":"\"Self-belittler\" is a noun, so it needs the \"-er\" suffix to indicate a person who performs the action of belittling themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["self-belittling (adjective)","belittle (verb)"],"phrases":["low self-esteem","imposter syndrome"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a commonly used word in general conversation or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"self-belittler\" is relatively straightforward in meaning, referring to someone who habitually downplays their own worth or accomplishments. However, its infrequent usage and the psychological concept it represents make it more suitable for advanced learners or those interested in psychology. Understanding the nuances of self-deprecation versus genuine humility is important for proper usage."},"example_sentences":[{"sentence":"Stop being such a self-belittler and acknowledge your hard work.","translation":"そんなに自己卑下しないで、自分の努力を認めなさい。","type":"general"},{"sentence":"The therapist helped her overcome her tendency to be a self-belittler.","translation":"セラピストは彼女が自己卑下する傾向を克服するのを助けた。","type":"clinical"}]}