{"word":"Arsphenamine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アルスフェナミン：かつて梅毒の治療に用いられた有機ヒ素化合物","english_definition":"An organoarsenic compound formerly used in the treatment of syphilis.","examples":[{"sentence":"Arsphenamine was one of the first effective treatments for syphilis.","translation":"アルスフェナミンは、かつて梅毒に対する最初の効果的な治療薬の一つでした。"}],"collocations":["arsphenamine treatment","arsphenamine injection"],"synonyms":["Salvarsan","Salvarsan 606","Ehrlich 606"],"antonyms":[]}],"etymology":{"value":"Ars(enic) + phen(yl) + amine. Paul Ehrlich's preparation 606.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrsˈfɛnəmiːn/","syllables":"ars-phen-a-mine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Arsphenamine, also known as Salvarsan or Ehrlich 606, is a synthetic arsenical drug that was used in the early 20th century to treat syphilis. It was the first modern chemotherapeutic agent, developed by Paul Ehrlich and his team in 1907. However, it has since been replaced by safer and more effective antibiotics like penicillin.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Arsphenamine is an antibiotic.","correct":"✓ Arsphenamine is an organoarsenic compound.","note":"Arsphenamine is not an antibiotic; it's an organoarsenic compound."}],"priority":"★★☆"},"related_words":{"derivatives":["neoarsphenamine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Arsphenamine is a historical term referring to a specific organoarsenic compound once used to treat syphilis. Due to its historical context and obsolescence in modern medicine, it is a term primarily encountered in medical history or specialized scientific literature. Understanding requires knowledge of organic chemistry and medical history."},"example_sentences":[{"sentence":"The introduction of arsphenamine revolutionized the treatment of syphilis in the early 1900s.","translation":"アルスフェナミンの導入は、1900年代初頭の梅毒治療に革命をもたらしました。","type":"noun","meaning_category":"treatment"},{"sentence":"Arsphenamine was later replaced by penicillin due to its toxicity and the latter's greater effectiveness.","translation":"アルスフェナミンは、その毒性とペニシリンのより高い有効性のため、後にペニシリンに取って代わられました。","type":"noun","meaning_category":"historical"}]}