{"word":"spousy","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"配偶者らしい、配偶者のような、夫婦間の","english_definition":"Relating to or characteristic of a spouse or marriage; exhibiting qualities of a spouse.","examples":[{"sentence":"They have a very spousy relationship, always looking out for each other.","translation":"彼らはとても夫婦らしい関係で、いつもお互いを気遣っている。"},{"sentence":"Her spousy advice was always helpful and supportive.","translation":"彼女の配偶者のようなアドバイスはいつも役に立ち、支えになった。"},{"sentence":"The atmosphere at the party was very spousy, with couples dancing closely.","translation":"パーティーの雰囲気はとても夫婦的で、カップルが寄り添って踊っていた。"}],"collocations":["spousy behavior","spousy relationship","spousy advice","spousy support","spousy duties"],"synonyms":["marital","conjugal","matrimonial","wedded","married"],"antonyms":["single","unmarried","divorced","platonic"]},{"part_of_speech":"adjective","definition":"過度に親密な、ベタベタした（夫婦のように）","english_definition":"Excessively or annoyingly affectionate or intimate, especially in public; cloyingly like a spouse.","examples":[{"sentence":"They were being too spousy in front of their friends, holding hands and kissing constantly.","translation":"彼らは友達の前でベタベタしすぎていて、常に手をつないだりキスをしたりしていた。"},{"sentence":"I found their spousy behavior at the restaurant quite irritating.","translation":"レストランでの彼らのベタベタした振る舞いはかなりイライラした。"},{"sentence":"Some people find public displays of affection to be spousy and inappropriate.","translation":"人によっては、公然とした愛情表現はベタベタしていて不適切だと感じる。"}],"collocations":["too spousy","overly spousy","spousy PDA (public display of affection)"],"synonyms":["cloying","saccharine","mawkish","sentimental","mushy"],"antonyms":["reserved","distant","aloof","unaffectionate"]}],"etymology":{"value":"Derived from 'spouse' (meaning husband or wife) with the addition of the suffix '-y' or '-ie', indicating a quality or characteristic of a spouse. The term likely emerged to describe behaviors or relationships reminiscent of a married couple.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspaʊzi/","syllables":"spou-sy"},"inflection":{"notes":"The word 'spousy' is primarily an adjective. It does not have typical verb or noun inflections."},"usage_notes":{"explanation":"'Spousy' is a relatively informal adjective that describes something as being characteristic of a spouse or marriage. It can have both positive and negative connotations. In a positive sense, it describes a close, supportive, and caring relationship reminiscent of a healthy marriage. In a negative sense, it describes behavior that is excessively affectionate or intimate, especially in public, and can be seen as annoying or cloying. The context usually determines the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They are very spousy to each other.","correct":"✓ They are very spousy with each other.","note":"While 'spousy' describes a relationship, it's more common to say 'They are very affectionate/intimate with each other' or 'They have a very spousy relationship.'"},{"incorrect":"✗ He is a spousy person.","correct":"✓ He is a supportive/caring person.","note":"'Spousy' typically describes behavior or a relationship, not a person's general character. Use more common adjectives like 'supportive' or 'caring' to describe a person's traits."}],"priority":"★★☆"},"related_words":{"derivatives":["spouse (noun: husband or wife)","spousally (adverb: in a manner characteristic of a spouse)"],"phrases":["spousy behavior","spousy relationship","spousy PDA (public display of affection)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Relatively low frequency (compared to 'spouse' or 'married'). The term is more common in informal contexts and discussions about relationships.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Spousy' is an informal adjective that describes something as being characteristic of a spouse or marriage. It can have both positive and negative connotations. In a positive sense, it describes a close, supportive, and caring relationship reminiscent of a healthy marriage. In a negative sense, it describes behavior that is excessively affectionate or intimate, especially in public, and can be seen as annoying or cloying. The context usually determines the intended meaning. Therefore, it's important to understand the context in which the word is used to correctly interpret its meaning. It is not a particularly common word, so it is more likely to be encountered in informal conversations or writing.","priority":"★★☆"},"example_sentences":[{"sentence":"Their **spousy** dynamic made everyone around them feel comfortable and loved.","translation":"彼らの夫婦のような関係は、周りの人々を心地よく、愛されていると感じさせた。","type":"adjective","meaning_category":"配偶者らしい（良い意味で）"},{"sentence":"The couple's **spousy** displays of affection in public were a bit much for some people.","translation":"そのカップルの公の場でのベタベタした愛情表現は、一部の人々には少し過剰だった。","type":"adjective","meaning_category":"ベタベタした（悪い意味で）"},{"sentence":"She offered **spousy** advice, drawing from her own experiences in a long-term relationship.","translation":"彼女は長期的な関係での自身の経験から、配偶者のようなアドバイスを提供した。","type":"adjective","meaning_category":"配偶者のような（アドバイス）"},{"sentence":"The **spousy** atmosphere at the family gathering was warm and welcoming.","translation":"家族の集まりでの夫婦的な雰囲気は暖かく、歓迎的だった。","type":"adjective","meaning_category":"夫婦間の"}]}