{"word":"Haussmannize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(都市)をオスマン化する、(都市)をオスマン男爵の都市計画に基づいて再開発する","english_definition":"To redevelop a city according to the principles of Georges-Eugène Haussmann's urban plan for Paris, typically involving wide boulevards, uniform building facades, and parks.","examples":[{"sentence":"The city council voted to Haussmannize the old quarter, hoping to improve traffic flow and sanitation.","translation":"市議会は、交通の流れと衛生状態を改善するために、旧市街をオスマン化することを決議した。"},{"sentence":"Critics argued that the plan to Haussmannize the neighborhood would destroy its unique character.","translation":"批評家たちは、その地区をオスマン化する計画は、その独特な個性を破壊すると主張した。"}],"collocations":["Haussmannize a city center","Haussmannize an old quarter","plans to Haussmannize","attempts to Haussmannize"],"synonyms":["urban renewal","redevelop","modernize","gentrify"],"antonyms":["preserve","conserve","maintain"]},{"part_of_speech":"verb","transitivity":"vi","definition":"オスマン化される、オスマン男爵の都市計画に基づいて再開発される","english_definition":"To undergo redevelopment according to the principles of Georges-Eugène Haussmann's urban plan for Paris.","examples":[{"sentence":"The neighborhood is being Haussmannized, with new apartments and shops replacing the old buildings.","translation":"その地域はオスマン化されており、古い建物に代わって新しいアパートや店舗が建設されている。"}],"collocations":["the area is being Haussmannized","the city is slowly Haussmannizing"],"synonyms":["undergo urban renewal","be redeveloped","be modernized"],"antonyms":["remain unchanged","stay as it is"]}],"etymology":{"value":"From Georges-Eugène Haussmann, the French city planner who directed the massive urban renewal of Paris in the mid-19th century, combined with the suffix '-ize' indicating to make or become.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɔːsmənaɪz/","syllables":"Haus-mann-ize"},"inflection":{"verb_forms":{"present_simple":["Haussmannize","Haussmannizes"],"past_simple":"Haussmannized","past_participle":"Haussmannized","present_participle":"Haussmannizing"}},"usage_notes":{"explanation":"'Haussmannize' refers specifically to urban redevelopment projects that emulate the style and principles of Haussmann's renovation of Paris. This often involves creating wide avenues, demolishing old structures, and constructing new buildings with uniform facades. The term can be used positively to describe improvements in urban planning and infrastructure, but it can also be used critically to refer to the destruction of historical character and the displacement of residents.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They are Haussmannizing the building.","correct":"✓ They are redeveloping the building.","note":"'Haussmannize' refers to large-scale urban projects, not individual buildings. Use 'redevelop' or 'renovate' for single buildings."},{"incorrect":"✗ The city was Haussmannized during the war.","correct":"✓ The city was rebuilt after the war.","note":"'Haussmannize' refers to a specific type of urban planning, not general reconstruction. Use 'rebuilt' or 'reconstructed' for post-war efforts."}],"priority":"★★☆"},"related_words":{"derivatives":["Haussmannization (noun)"],"phrases":["Haussmannian architecture","Haussmann's plan","urban planning","urban renewal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haussmannize' is a specialized term referring to urban redevelopment projects that mimic the style of Georges-Eugène Haussmann's renovation of Paris. It involves creating wide boulevards, uniform building facades, and parks. The term is often used in discussions of urban planning, architecture, and historical preservation. Understanding the historical context of Haussmann's work is essential for using this term correctly."},"example_sentences":[{"sentence":"The mayor proposed to Haussmannize the waterfront district to attract tourists.","translation":"市長は観光客を誘致するためにウォーターフロント地区をオスマン化することを提案した。","type":"verb","meaning_category":"urban redevelopment"},{"sentence":"Many European cities were Haussmannized in the 19th century.","translation":"多くのヨーロッパの都市は19世紀にオスマン化された。","type":"verb","meaning_category":"urban redevelopment"},{"sentence":"The Haussmannization of Paris transformed the city into a modern metropolis.","translation":"パリのオスマン化は、その都市を近代的な大都市に変貌させた。","type":"noun (Haussmannization)","meaning_category":"urban redevelopment"}]}