{"word":"nitroprussic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ニトロプルシドの、ニトロプルシド酸の","english_definition":"Relating to or containing the nitroprusside ion.","examples":[{"sentence":"The nitroprussic reaction is used to detect the presence of certain compounds.","translation":"ニトロプルシド反応は、特定の化合物の存在を検出するために使用されます。"}],"collocations":["nitroprussic acid","nitroprussic reaction"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'nitro' (referring to the presence of a nitro group), 'prussic' (relating to prussic acid, an old name for hydrogen cyanide), and the suffix '-ic' (denoting an adjective).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnaɪtroʊˈprʌsɪk/","syllables":"ni-tro-prus-sic"},"inflection":{},"usage_notes":{"explanation":"'Nitroprussic' is primarily used in scientific and chemical contexts to describe compounds or reactions involving the nitroprusside ion, which contains iron, cyanide, and a nitro group. It is most commonly encountered in discussions of analytical chemistry or pharmacology, particularly concerning sodium nitroprusside, a medication used to lower blood pressure.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["nitroprusside (noun)"],"related_terms":["sodium nitroprusside"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'nitroprussic' is highly technical and specialized, primarily encountered in advanced chemistry or pharmacology texts. Understanding requires familiarity with chemical nomenclature and concepts such as nitro groups and cyanide compounds. Due to its limited use, it is not part of general vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The solution turned blue in the presence of the thiol group, indicating a positive nitroprussic test.","translation":"チオール基の存在下で溶液が青色に変化し、ニトロプルシド試験が陽性であることを示した。","type":"general","meaning_category":"chemical test"},{"sentence":"Nitroprussic acid is a complex compound used in certain analytical procedures.","translation":"ニトロプルシド酸は、特定の分析手順で使用される複雑な化合物です。","type":"general","meaning_category":"chemical compound"}]}