{"word":"Xylenes","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キシレン (芳香族炭化水素の一種で、溶剤や化学原料として使用される)","english_definition":"Any of three isomeric dimethylbenzenes, used as solvents and in the production of various chemicals.","examples":[{"sentence":"Xylenes are used in the production of plastics and synthetic fibers.","translation":"キシレンはプラスチックや合成繊維の製造に使用されます。"},{"sentence":"Exposure to high concentrations of xylenes can be harmful.","translation":"高濃度のキシレンへの暴露は有害となる可能性があります。"}],"collocations":["mixed xylenes (混合キシレン)","xylene isomers (キシレン異性体)","xylene exposure (キシレン暴露)","xylene solvent (キシレン溶剤)"],"synonyms":["dimethylbenzene","xylol"],"antonyms":[]}],"etymology":{"value":"Derived from 'xylon' (Greek for wood) because it was first isolated from wood tar, and '-ene' (a suffix used in organic chemistry to denote unsaturated hydrocarbons).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzaɪliːnz/","syllables":"zy-lenes"},"inflection":{"noun_plural":"Xylenes"},"usage_notes":{"explanation":"'Xylenes' refers to a group of three isomeric aromatic hydrocarbons: ortho-xylene, meta-xylene, and para-xylene. They are primarily used as solvents and as raw materials in the production of plastics, synthetic fibers, and other chemicals. Due to their volatility and potential health hazards, proper handling and ventilation are essential when working with xylenes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Xylene are used as a solvent.","correct":"✓ Xylenes are used as a solvent.","note":"'Xylenes' is a plural noun referring to a mixture of isomers, so it takes a plural verb."},{"incorrect":"✗ Xylene is a dangerous chemical, so handle with care.","correct":"✓ Xylenes are dangerous chemicals, so handle with care.","note":"While you can refer to a specific xylene isomer in the singular, generally 'xylenes' refers to the mixture."}],"priority":"★★☆"},"related_words":{"derivatives":["xylene (singular form)","xylenol (related compound)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily found in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Xylenes' is a technical term referring to a group of aromatic hydrocarbons used as solvents and in chemical manufacturing. Understanding this term requires some background knowledge in chemistry, particularly organic chemistry. The word is primarily encountered in scientific literature, safety data sheets, and industrial contexts. Due to its technical nature, it is not commonly used in everyday conversations.","priority":"★☆☆"},"example_sentences":[{"sentence":"The laboratory uses mixed **xylenes** as a common solvent.","translation":"その研究室では、混合キシレンを一般的な溶剤として使用しています。","type":"noun","meaning_category":"solvent"},{"sentence":"**Xylenes** are produced from petroleum refining processes.","translation":"キシレンは石油精製プロセスから製造されます。","type":"noun","meaning_category":"chemical production"},{"sentence":"Workers must wear protective gear to minimize exposure to **xylenes**.","translation":"作業員はキシレンへの暴露を最小限に抑えるために保護具を着用する必要があります。","type":"noun","meaning_category":"safety"}]}