{"word":"Avars","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アヴァール人（6世紀から9世紀にかけて東ヨーロッパに存在した遊牧民族）","english_definition":"A nomadic people who arrived in Europe in the late 6th century CE and established an empire centered in the Carpathian Basin.","examples":[{"sentence":"The Avars were known for their skilled horsemanship and military prowess.","translation":"アヴァール人は、熟練した騎術と軍事力で知られていた。"},{"sentence":"The Avar Khaganate controlled a large territory in Central and Eastern Europe.","translation":"アヴァール可汗国は、中央および東ヨーロッパの広大な地域を支配していた。"},{"sentence":"The Avars eventually disappeared from historical records, likely assimilated by neighboring populations.","translation":"アヴァール人は最終的に歴史的記録から姿を消し、おそらく近隣の住民に同化された。"}],"collocations":["Avar Khaganate","Avar language","Avar culture","Avar settlements"],"synonyms":["None (unique ethnic group)"],"antonyms":["None (unique ethnic group)"]},{"part_of_speech":"noun","definition":"（複数形）アヴァール語（主にロシアのダゲスタン共和国で話されている北東コーカサス語族の言語）","english_definition":"The Avar language, a Northeast Caucasian language spoken primarily in Dagestan, Russia.","examples":[{"sentence":"Avar is one of the official languages of Dagestan.","translation":"アヴァール語は、ダゲスタンの公用語の一つである。"},{"sentence":"The Avar language has a complex phonological system.","translation":"アヴァール語は複雑な音韻体系を持っている。"},{"sentence":"Few people outside of Dagestan speak Avar.","translation":"ダゲスタン以外でアヴァール語を話す人はほとんどいない。"}],"collocations":["Avar language","Avar alphabet","Avar grammar","Speak Avar","Learn Avar"],"synonyms":["Avar language"],"antonyms":["None (unique language)"]}],"etymology":{"value":"The origin of the name 'Avar' is uncertain. Several theories exist, linking it to various Turkic or Central Asian groups. The name was used by Byzantine historians to refer to the nomadic group that arrived in Europe in the 6th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːvɑːrz/","syllables":"A-vars"},"inflection":{"noun_plural":"Avars"},"usage_notes":{"explanation":"The term 'Avars' can refer to either the historical nomadic people or the modern-day language spoken in Dagestan. Context is crucial to determine the intended meaning. When referring to the historical people, it is often used in the context of early medieval European history. When referring to the language, it is usually in the context of linguistics or the Caucasus region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Avars are a Slavic people.","correct":"✓ The Avars were a nomadic people of uncertain origin.","note":"The Avars were not Slavic; their origins are debated, but they were a nomadic group who arrived in Europe in the 6th century."},{"incorrect":"✗ Avar is a widely spoken European language.","correct":"✓ Avar is primarily spoken in Dagestan, Russia.","note":"Avar is a Northeast Caucasian language spoken mainly in Dagestan, not a widely spoken European language."}],"priority":"★★☆"},"related_words":{"derivatives":["Avaric (ISO 639-3 code for the Avar language)"],"phrases":["Avar Khaganate (the political entity ruled by the Avars)"],"priority":"★★☆"},"level_frequency":{"CEFR":"None (specialized vocabulary)","frequency_google_ngram":"Low frequency (historical and linguistic contexts)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Avars' refers to two distinct but related concepts: a historical nomadic people and a modern-day language. Understanding the context is essential to correctly interpret the meaning. The historical Avars were a significant force in early medieval Europe, while the Avar language is an important part of the linguistic landscape of the Caucasus. Due to its specialized nature, this term is more likely to be encountered in academic or historical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Avars** established a powerful khaganate in the Carpathian Basin.","translation":"アヴァール人はカルパティア盆地に強力な可汗国を築いた。","type":"noun (people)","meaning_category":"nomadic people"},{"sentence":"**Avar** is a Northeast Caucasian language with a complex grammatical structure.","translation":"アヴァール語は、複雑な文法構造を持つ北東コーカサス語族の言語である。","type":"noun (language)","meaning_category":"language"},{"sentence":"Archaeological findings provide insights into the culture of the **Avars**.","translation":"考古学的発見は、アヴァール人の文化への洞察を提供する。","type":"noun (people)","meaning_category":"nomadic people"},{"sentence":"Many **Avars** live in the mountainous regions of Dagestan.","translation":"多くのアヴァール人がダゲスタンの山岳地帯に住んでいる。","type":"noun (people, implied speakers of the language)","meaning_category":"people/language"}]}