{"word":"fastback","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(自動車の)ファストバック","english_definition":"A car body style characterized by a roofline that slopes continuously from the top of the roof to the rear deck in a smooth, unbroken curve.","examples":[{"sentence":"The Ford Mustang was available as a fastback.","translation":"フォード・マスタングにはファストバックのモデルがあった。"},{"sentence":"Many classic sports cars feature a fastback design.","translation":"多くのクラシックスポーツカーはファストバックデザインを採用している。"}],"collocations":["fastback design","fastback model","classic fastback"],"synonyms":["hatchback (類似するが、通常はより短いリアデッキを持つ)","liftback (類似するが、通常はリアウィンドウが一緒に開く)"],"antonyms":["notchback (リアウィンドウが垂直に近い)","sedan (独立したトランクを持つ)"],"related_terms":["coupe","sports car","automobile","car body style"]}],"etymology":{"value":"'Fast' (quick, sleek) + 'back' (referring to the rear of the car). The term describes the car's streamlined, sloping rear design.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfæstbæk/","syllables":"fast-back"},"inflection":{"noun_plural":"fastbacks"},"usage_notes":{"explanation":"A fastback is a car body style where the roof slopes continuously down to the rear of the car, creating a smooth, aerodynamic profile. It differs from a notchback, which has a more distinct separation between the roof and the trunk. The term is primarily used in the context of automotive design and car models.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He bought a fastback motorcycle.","correct":"✓ He bought a fastback car.","note":"Fastback refers to a car body style, not motorcycles."},{"incorrect":"✗ Is that a hatchback or a fastback? It's the same thing.","correct":"✓ Is that a hatchback or a fastback? They are similar, but a fastback has a smoother, longer slope.","note":"Hatchbacks and fastbacks are similar, but fastbacks typically have a longer, more gradual slope to the rear."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["aerodynamics","body style","automotive design"]},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, specific to automotive discussions.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'fastback' is specific to automotive terminology, describing a car body style with a continuous, sloping roofline to the rear. Understanding this term requires some familiarity with car design vocabulary. It's not a commonly used word outside of discussions about cars.","requires_context":"automotive"},"example_sentences":[{"sentence":"The 1967 Ford Mustang fastback is a highly sought-after classic car.","translation":"1967年式のフォード・マスタングのファストバックは、非常に人気のあるクラシックカーです。","type":"noun","meaning_category":"automotive design"},{"sentence":"The aerodynamic design of the fastback improves fuel efficiency.","translation":"ファストバックの空力設計は燃費を向上させます。","type":"noun","meaning_category":"automotive design"},{"sentence":"He restored a vintage fastback in his garage.","translation":"彼はガレージでヴィンテージのファストバックを修復しました。","type":"noun","meaning_category":"automotive design"}]}