{"word":"unrenunciatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not renunciatory; not involving or characterized by renunciation.","english_definition":"Not involving or characterized by renunciation; not giving up or rejecting something.","examples":[{"sentence":"His unrenunciatory stance on the issue showed his unwavering commitment.","translation":"その問題に対する彼の非放棄的な姿勢は、彼の揺るぎないコミットメントを示していた。"},{"sentence":"The unrenunciatory nature of her belief system meant she would never compromise her values.","translation":"彼女の信念体系の非放棄的な性質は、彼女が自分の価値観を決して妥協しないことを意味していた。"}],"collocations":["unrenunciatory stance","unrenunciatory nature","unrenunciatory commitment"],"synonyms":["non-renouncing","unwavering","steadfast","resolute","determined"],"antonyms":["renunciatory","yielding","compromising","wavering","vacillating"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'renunciatory'. 'Renunciatory' itself comes from 'renunciation', which is derived from the Latin 'renuntiare' (to renounce).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnriˈnʌnsiətɔːri/","syllables":"un-re-nun-ci-a-to-ry"},"inflection":{"adjective_forms":{"comparative":"more unrenunciatory","superlative":"most unrenunciatory"}},"usage_notes":{"explanation":"'Unrenunciatory' is a relatively rare word, primarily used in formal or academic contexts to describe something that does not involve giving up or rejecting a belief, position, or claim. It emphasizes a firm and unwavering stance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a renunciatory attitude, which was unrenunciatory.","correct":"✓ He showed an unrenunciatory attitude, which was commendable.","note":"The sentence initially uses 'renunciatory' and 'unrenunciatory' in a contradictory way. It's corrected to show a positive, unwavering attitude. Ensure the correct prefix is used to convey the intended meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["renounce (verb)","renunciation (noun)","renunciatory (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unrenunciatory' is a complex and rare word. It is used to describe something that does not involve renunciation, meaning the act of giving up or rejecting something. Understanding this word requires a strong vocabulary and the ability to recognize prefixes and suffixes. It is typically found in formal or academic writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The diplomat's unrenunciatory approach to the negotiations ultimately led to a stalemate.","translation":"外交官の交渉に対する非放棄的なアプローチは、最終的に行き詰まりにつながった。","type":"adjective","meaning_category":"Not involving renunciation"},{"sentence":"Her unrenunciatory defense of her principles earned her the respect of her colleagues.","translation":"彼女の原則に対する非放棄的な擁護は、同僚からの尊敬を得た。","type":"adjective","meaning_category":"Not giving up or rejecting"}]}