{"word":"subcase","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下位事例、小事例、副事例","english_definition":"A case that is a part of a larger case; a specific instance or example within a broader category.","examples":[{"sentence":"This particular incident is a subcase of the larger problem of data security breaches.","translation":"この特定の事件は、データセキュリティ侵害というより大きな問題の下位事例です。"},{"sentence":"We need to analyze each subcase individually to understand the overall trend.","translation":"全体的な傾向を理解するために、個々の下位事例を分析する必要があります。"},{"sentence":"The report details several subcases of fraud within the company.","translation":"その報告書は、社内における詐欺のいくつかの下位事例を詳述しています。"}],"collocations":["analyze subcases","identify subcases","specific subcase","different subcases","several subcases"],"synonyms":["instance","example","subset","subcategory","specific case"],"antonyms":["main case","overarching case","general case"]}],"etymology":{"value":"'sub-' (under, below) + 'case' (instance, situation). Indicates a case that falls under a larger, more general case.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌkeɪs/","syllables":"sub-case"},"inflection":{"noun_plural":"subcases"},"usage_notes":{"explanation":"'Subcase' is used to refer to a specific instance or example that is part of a broader category or general case. It is often used in analytical contexts, such as in legal, medical, or business analysis, where specific instances need to be examined in relation to a larger issue.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subcase is more important than the main case.","correct":"✓ The main case is generally more important than the subcase.","note":"A subcase is, by definition, part of a larger case, so it is unusual for it to be more important than the main case. The main case provides the overall context. "},{"incorrect":"✗ Each of the subcases are unique.","correct":"✓ Each of the subcases is unique.","note":"When using 'each of', the verb should be singular. 'Each of the subcases is unique' is grammatically correct."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["case study","example","instance","scenario","situation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subcase' refers to a specific instance or example that falls under a larger, more general category or 'case'. It's often used in analytical or technical contexts to break down complex issues into smaller, more manageable parts for examination. Understanding this term helps in comprehending detailed analyses and reports where specific instances are considered within a broader framework."},"example_sentences":[{"sentence":"The lawyer presented several subcases to support his argument.","translation":"弁護士は、彼の主張を裏付けるために、いくつかの下位事例を提示しました。","type":"noun","meaning_category":"下位事例"},{"sentence":"Each subcase of the disease presents unique symptoms.","translation":"その病気の各下位事例は、独特の症状を示します。","type":"noun","meaning_category":"下位事例"},{"sentence":"The analyst examined each subcase to identify patterns of fraud.","translation":"アナリストは、詐欺のパターンを特定するために、各下位事例を調べました。","type":"noun","meaning_category":"下位事例"}]}