{"word":"Teutonity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チュートン民族性、ドイツ民族性、ドイツ人気質","english_definition":"The characteristics, qualities, or culture associated with the Teutons or Germans.","examples":[{"sentence":"The author explored the concept of Teutonity in his historical analysis.","translation":"著者は歴史分析において、ドイツ民族性の概念を探求した。"},{"sentence":"The museum showcased various artifacts representing Teutonity.","translation":"博物館では、ドイツ民族性を表す様々な工芸品が展示されていた。"}],"collocations":["German Teutonity","national Teutonity","cultural Teutonity"],"synonyms":["Germanness","Germanism","German culture"],"antonyms":[]}],"etymology":{"value":"Formed from 'Teuton' (referring to a member of an ancient Germanic people or a German) and the suffix '-ity' (denoting a state, quality, or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtjuːˈtɒnɪti/","syllables":"Tew-ton-i-ty"},"inflection":{"noun_plural":"Teutonities (rarely used)"},"usage_notes":{"explanation":"'Teutonity' is a relatively rare and somewhat formal term used to describe the essence or qualities associated with being Teutonic or German. It can encompass cultural, ethnic, or national characteristics. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He expressed his Teutonity by speaking German.","correct":"✓ He expressed his Teutonity through his appreciation of German literature and music.","note":"Teutonity is not simply about speaking German, but encompasses a broader range of cultural and historical aspects."}],"priority":"★☆☆"},"related_words":{"derivatives":["Teuton (noun, adjective)","Teutonic (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Teutonity' is a relatively uncommon and abstract term. It requires an understanding of the historical and cultural context of the Teutons and Germans. It is more likely to be encountered in academic or historical texts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The essay examined the influence of Teutonity on European art.","translation":"そのエッセイは、ドイツ民族性がヨーロッパの芸術に与えた影響を検証した。","type":"general","meaning_category":"German ethnicity"},{"sentence":"The celebration aimed to promote a sense of Teutonity among the diaspora.","translation":"その祭典は、ディアスポラの間でドイツ民族性意識を高めることを目的としていた。","type":"general","meaning_category":"German ethnicity"}]}