{"word":"oversuperstitious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"迷信深すぎる、過度に迷信的な","english_definition":"Excessively superstitious; having too much belief in superstitions.","examples":[{"sentence":"He was considered oversuperstitious by his friends because he avoided walking under ladders and refused to start a journey on Friday the 13th.","translation":"彼はハシゴの下を歩くのを避けたり、13日の金曜日に旅行を始めるのを拒否したりするため、友人たちから迷信深すぎると見なされていた。"},{"sentence":"The old woman was oversuperstitious and believed that black cats brought bad luck.","translation":"その老女は迷信深すぎて、黒猫は不運をもたらすと信じていた。"},{"sentence":"Some cultures are seen as more oversuperstitious than others, with elaborate rituals to ward off evil spirits.","translation":"文化によっては、悪霊を追い払うための手の込んだ儀式があり、他の文化よりも迷信深いと見なされることがある。"}],"collocations":["be oversuperstitious about","consider someone oversuperstitious","oversuperstitious beliefs","oversuperstitious practices"],"synonyms":["excessively superstitious","extremely credulous","overly credulous"],"antonyms":["unsuspecting","skeptical","rational","unsuperstitious"]},{"part_of_speech":"adjective","definition":"迷信を過剰に信じる傾向がある","english_definition":"Inclined to believe in superstitions to an excessive degree.","examples":[{"sentence":"The character in the novel was portrayed as oversuperstitious, constantly seeking signs and omens in everyday events.","translation":"小説の登場人物は、日常生活の出来事の中に常に兆候や前兆を求める、迷信深すぎる人物として描かれていた。"},{"sentence":"The villagers were oversuperstitious and attributed every misfortune to the anger of the local deities.","translation":"村人たちは迷信深く、あらゆる不幸を地元の神々の怒りのせいだと考えた。"}],"collocations":["oversuperstitious nature","oversuperstitious tendencies","oversuperstitious person"],"synonyms":["excessively credulous","overly superstitious"],"antonyms":["pragmatic","logical","scientific"]}],"etymology":{"value":"\"over-\" (過剰) + \"superstitious\" (迷信的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˌsuːpərˈstɪʃəs/","syllables":"o-ver-su-per-sti-tious"},"inflection":{"adjective_forms":{"comparative":"more oversuperstitious","superlative":"most oversuperstitious"}},"usage_notes":{"explanation":"\"Oversuperstitious\" describes someone who believes in superstitions to an excessive degree. It implies that their beliefs are irrational and affect their behavior in a noticeable way. The word is often used to describe someone who takes superstitions too seriously, allowing them to influence their decisions and actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very superstition.","correct":"✓ He is very superstitious. / ✓ He is oversuperstitious.","note":"\"Superstition\" is a noun, while \"superstitious\" is an adjective. \"Oversuperstitious\" is also an adjective, indicating an excessive degree of being superstitious."},{"incorrect":"✗ She acted oversuperstitiously.","correct":"✓ She was oversuperstitious. / ✓ She acted in an oversuperstitious manner.","note":"\"Oversuperstitious\" is an adjective and should be used to describe a person or their state of being. To describe an action, use \"in an oversuperstitious manner\" or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["superstition (名詞: 迷信)","superstitiously (副詞: 迷信的に)"],"related_terms":["credulous (形容詞: だまされやすい)","gullible (形容詞: だまされやすい)","irrational (形容詞: 不合理な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"oversuperstitious\" is a relatively uncommon adjective used to describe someone who believes in superstitions to an excessive degree. It suggests that their beliefs are irrational and significantly influence their behavior. Understanding this word requires a good grasp of the base word \"superstitious\" and the prefix \"over-\", which indicates excessiveness. This word is more likely to appear in formal writing or discussions about cultural beliefs and behaviors."},"example_sentences":[{"sentence":"The villagers were dismissed as oversuperstitious by the more rational city dwellers.","translation":"村人たちは、より合理的な都市住民から迷信深すぎると一蹴された。","type":"general","meaning_category":"General usage"},{"sentence":"Her oversuperstitious nature led her to avoid certain numbers and colors.","translation":"彼女の迷信深すぎる性格のため、特定の数字や色を避けるようになった。","type":"characteristic","meaning_category":"Character trait"},{"sentence":"The film portrayed the characters as oversuperstitious, relying on charms and rituals to protect themselves from harm.","translation":"その映画は、登場人物たちが危害から身を守るために、お守りや儀式に頼る、迷信深すぎる人々として描かれていた。","type":"portrayal","meaning_category":"Portrayal in media"}]}