{"word":"vice-architect","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(組織・企業などの)副設計責任者、副アーキテクト","english_definition":"A person who is second in command or authority in architectural design, planning, or execution within an organization or company.","examples":[{"sentence":"As vice-architect, she oversaw the technical aspects of the project.","translation":"副設計責任者として、彼女はそのプロジェクトの技術面を監督しました。"},{"sentence":"The company promoted him to vice-architect after his successful contributions to several key projects.","translation":"いくつかの主要プロジェクトへの貢献が認められ、彼は副設計責任者に昇進しました。"}],"collocations":["vice-architect of engineering","vice-architect of solutions","associate vice-architect"],"synonyms":["deputy architect","assistant architect","associate architect"],"antonyms":["chief architect","lead architect","principal architect"]}],"etymology":{"value":"The term combines 'vice-' (meaning 'in place of' or 'deputy') with 'architect' (a person who designs buildings and advises in their construction).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvaɪs ˈɑːrkɪtekt/","syllables":"vice-ar-chi-tect"},"inflection":{"noun_plural":"vice-architects"},"usage_notes":{"explanation":"'Vice-architect' typically refers to a role that supports the chief or lead architect, often handling specific technical or managerial aspects of projects. The role's responsibilities can vary depending on the organization's structure and the scope of its projects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the vice architect of the building.","correct":"✓ He is a vice-architect of the building.","note":"The term 'vice-architect' is a job title and requires the indefinite article 'a' or 'an' when referring to a specific person holding that position."},{"incorrect":"✗ The vice-architect is responsible for all architectural decisions.","correct":"✓ The chief architect is responsible for all architectural decisions. The vice-architect supports the chief architect.","note":"The vice-architect typically assists or supports the chief architect but does not usually have the ultimate decision-making authority."}],"priority":"★★☆"},"related_words":{"derivatives":["architecture","architectural","architect"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'vice-architect' is a professional title indicating a supporting role to the chief architect within an organization. Understanding requires familiarity with professional hierarchies and architectural roles."},"example_sentences":[{"sentence":"The vice-architect presented the revised design plans to the client.","translation":"副設計責任者が修正された設計図を顧客に提示しました。","type":"example","meaning_category":"General"},{"sentence":"She worked closely with the chief architect as the vice-architect on the new museum project.","translation":"彼女は新しい美術館プロジェクトで副設計責任者として、主任設計者と緊密に連携しました。","type":"example","meaning_category":"General"}]}