{"word":"tritanope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"三色型色覚異常の一種で、青色と黄色の識別が困難な人","english_definition":"A person with tritanopia, a type of color blindness in which the individual has difficulty distinguishing between blue and yellow colors.","examples":[{"sentence":"My grandfather is a tritanope, so he has trouble choosing clothes with matching colors.","translation":"私の祖父はトリタノープなので、色の合う服を選ぶのが難しいです。"},{"sentence":"Tritanopes often confuse blue with green and yellow with violet.","translation":"トリタノープの人は、青を緑と、黄を紫と混同することがよくあります。"}],"collocations":["tritanope vision","tritanope color blindness","diagnosed tritanope"],"synonyms":["blue-yellow color blind","color blind (with blue-yellow deficiency)"],"antonyms":["normal color vision","trichromat"]},{"part_of_speech":"adjective","definition":"トリタノープの、青色と黄色の識別が困難な","english_definition":"Relating to or characteristic of tritanopia, a condition where blue and yellow colors are difficult to distinguish.","examples":[{"sentence":"The tritanope patient struggled with the color sorting test.","translation":"トリタノープの患者は、色の分類テストに苦労しました。"},{"sentence":"Tritanope vision is relatively rare compared to other forms of color blindness.","translation":"トリタノープの視覚は、他の種類の色覚異常と比較して比較的まれです。"}],"collocations":["tritanope vision","tritanope perception","tritanope filter"],"synonyms":["blue-yellow color blind","color deficient (blue-yellow)"],"antonyms":["color-normal","trichromatic"]}],"etymology":{"value":"The term 'tritanope' comes from the Greek words 'tritos' meaning 'third', 'an-' meaning 'without', and 'ops' meaning 'eye'. It refers to the third type of cone cell (S-cone) affected in color blindness, which is responsible for detecting blue light.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtraɪtənˌoʊp/","syllables":"tri-tan-ope"},"inflection":{"noun_plural":"tritanopes"},"usage_notes":{"explanation":"'Tritanope' refers specifically to individuals with tritanopia, a type of color blindness affecting blue-yellow perception. It is less common than protanopia (red color blindness) and deuteranopia (green color blindness). The term can be used as both a noun (referring to a person) and an adjective (describing the condition).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dichromat, specifically tritanope.","correct":"✓ He is a dichromat, specifically a tritanope.","note":"When using 'tritanope' as a noun, it should be preceded by an article ('a' or 'an')."},{"incorrect":"✗ Tritanope people are very common.","correct":"✓ Tritanopia is relatively rare. / ✓ Tritanopes are relatively rare.","note":"Tritanopia is a relatively rare condition, so avoid generalizations about its prevalence."}],"priority":"★★☆"},"related_words":{"derivatives":["tritanopia (n. the condition of being a tritanope)","tritanomalous (adj. having tritanomaly, a milder form of blue-yellow color vision deficiency)","dichromat (n. a person with dichromacy, a type of color blindness where one of the three basic color mechanisms is absent or malfunctioning)"],"related_medical_terms":["protanope (n. a person with red color blindness)","deuteranope (n. a person with green color blindness)","achromatopsia (n. complete color blindness)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tritanope' is a specialized term used in the field of ophthalmology and vision science to describe a person with a specific type of color blindness (tritanopia). Understanding this term requires knowledge of color vision and color vision deficiencies. It's not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist, a known **tritanope**, compensated for his colorblindness by using texture and form in his paintings.","translation":"そのアーティストはトリタノープとして知られており、絵画の中で色覚異常をテクスチャと形で補っていました。","type":"noun","meaning_category":"Person with blue-yellow color blindness"},{"sentence":"The **tritanope** filter helps people with blue-yellow color blindness to perceive colors more accurately.","translation":"トリタノープフィルターは、青-黄の色覚異常を持つ人々がより正確に色を認識するのに役立ちます。","type":"adjective","meaning_category":"Relating to blue-yellow color blindness"},{"sentence":"Because he is a **tritanope**, he has difficulty distinguishing between blue and green.","translation":"彼はトリタノープなので、青と緑の区別がつきにくいです。","type":"noun","meaning_category":"Person with blue-yellow color blindness"},{"sentence":"The study focused on the visual perception of **tritanopes** compared to individuals with normal color vision.","translation":"その研究は、トリタノープの視覚認識を、正常な色覚を持つ人々と比較することに焦点を当てました。","type":"noun","meaning_category":"People with blue-yellow color blindness"}]}