{"word":"sympodium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 偽軸(ぎじく): 主軸の成長が早く止まり、側軸が主軸の役割を引き継いで成長するタイプの軸。","english_definition":"(botany) A type of branching in plants where the main axis stops growing early and growth is continued by a series of lateral (side) branches, each of which in turn terminates its growth.","examples":[{"sentence":"Many orchids exhibit sympodial growth.","translation":"多くのランは仮軸成長を示す。"},{"sentence":"In a sympodium, the apparent main stem is actually a series of lateral branches.","translation":"仮軸において、外見上の主軸は実際には一連の側枝である。"}],"collocations":["sympodial growth","sympodial branching"],"synonyms":["false axis"],"antonyms":["monopodium"],"notes":"The term 'sympodium' is derived from the Greek words 'syn' (together) and 'podion' (little foot).","images":["url_to_sympodium_diagram_1.jpg","url_to_sympodium_diagram_2.png"]}],"etymology":{"value":"From the Greek words 'syn' (together) and 'podion' (little foot), referring to the lateral branches growing together to form a false axis.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪmˈpoʊdiəm/","syllables":"sym-po-di-um"},"inflection":{"noun_plural":"sympodia"},"usage_notes":{"explanation":"A sympodium is a growth pattern in plants where the main stem's growth is limited, and lateral branches take over as the primary growth axis. This contrasts with a monopodium, where the main stem continues to grow indefinitely.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree has a monopodium, so it must be a sympodium.","correct":"✓ The tree has a sympodium, not a monopodium.","note":"A plant cannot have both a monopodium and a sympodium for the same axis. They are contrasting growth patterns."}],"priority":"★☆☆"},"related_words":{"derivatives":["sympodial (adjective)"],"related_terms":["monopodium","dichotomous branching"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sympodium' refers to a specific type of branching pattern in plants. In this pattern, the main stem of the plant ceases to grow, and the growth is continued by lateral branches that take over as the primary axis. This is a more advanced botanical term, typically encountered in specialized texts or studies related to plant morphology. Understanding this term requires some background knowledge of plant anatomy and growth patterns."},"example_sentences":[{"sentence":"The rhizomes of many ferns exhibit sympodial growth, with each segment representing a lateral branch.","translation":"多くのシダの根茎は仮軸成長を示し、各セグメントは側枝を表している。","type":"scientific","meaning_category":"botany"},{"sentence":"In a sympodial cyme, the terminal flower develops first, inhibiting further growth of the main axis.","translation":"仮軸集散花序では、頂端の花が最初に発達し、主軸のそれ以上の成長を阻害する。","type":"scientific","meaning_category":"botany"}]}