{"word":"Sturmian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"シュトゥルム的な、シュトゥルム理論に関する","english_definition":"Relating to or characteristic of Sturm theory, a branch of mathematics dealing with the oscillation of solutions of linear differential equations.","examples":[{"sentence":"A Sturmian sequence is used to determine the number of real roots of a polynomial.","translation":"シュトゥルム列は、多項式の実数解の数を決定するために使用されます。"}],"collocations":["Sturmian sequence","Sturmian theory","Sturmian comparison theorem"],"synonyms":["oscillatory","mathematical","theoretical"],"antonyms":[]}],"etymology":{"value":"Named after Jacques Charles François Sturm, a French mathematician who developed Sturm theory.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstɜːrmiən/","syllables":"Stur-mi-an"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'Sturmian' is highly specialized and primarily used within the field of mathematics, specifically when discussing differential equations and root-finding algorithms. It is unlikely to be encountered in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather was very Sturmian today.","correct":"✓ The weather was stormy today.","note":"'Sturmian' is a mathematical term and should not be used to describe weather conditions. Use 'stormy' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["Sturm (noun: referring to Jacques Charles François Sturm or Sturm theory)","Sturm theory (noun: the mathematical theory itself)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sturmian' is a technical term used exclusively in advanced mathematics. Understanding its meaning requires familiarity with differential equations and root-finding methods. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Sturmian comparison theorem provides bounds on the eigenvalues of a differential operator.","translation":"シュトゥルムの比較定理は、微分演算子の固有値の境界を提供する。","type":"adjective","meaning_category":"mathematical"},{"sentence":"We applied a Sturmian sequence to isolate the real roots of the polynomial.","translation":"多項式の実数解を分離するために、シュトゥルム列を適用した。","type":"adjective","meaning_category":"mathematical"}]}