{"word":"meal-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"食事を中心とした、食事に重点を置いた","english_definition":"Focused on or structured around meals; prioritizing or emphasizing the importance of meals.","examples":[{"sentence":"The restaurant offers a meal-oriented dining experience, with a focus on fresh, local ingredients.","translation":"そのレストランは、新鮮な地元の食材に焦点を当てた、食事を中心としたダイニング体験を提供しています。"},{"sentence":"Their family life is very meal-oriented; they always eat dinner together at the table.","translation":"彼らの家族生活は非常に食事を中心としており、常に食卓で一緒に夕食をとります。"},{"sentence":"The tour package is meal-oriented, including breakfast, lunch, and dinner at specific times.","translation":"そのツアーパッケージは食事を中心としており、特定の時間に朝食、昼食、夕食が含まれています。"}],"collocations":["meal-oriented restaurant","meal-oriented family","meal-oriented tour","meal-oriented approach","meal-oriented culture"],"synonyms":["food-focused","dining-centric","cuisine-based","gastronomy-related"],"antonyms":["activity-oriented","event-oriented","entertainment-focused"]}],"etymology":{"value":"The word is a compound of 'meal' (food eaten at a specific time), 'oriented' (directed or focused), and '-ed' (past participle used as an adjective). It describes something that is directed or focused on meals.","priority":"N/A"},"pronunciation":{"ipa":"ˈmiːl ˌɔːriɛnˌtɪd","syllables":"meal-o-ri-en-ted"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative constructions with 'more' and 'most' or 'less' and 'least'"},"usage_notes":{"explanation":"'Meal-oriented' is used to describe something that is designed around or gives importance to meals. It can refer to a lifestyle, a business model, or a specific event. It emphasizes the role of meals as a central part of the experience.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is very meal-orientated.","correct":"✓ The company is very meal-oriented.","note":"'Oriented' is the correct form as it is the past participle used as an adjective. 'Orientated' is a less common variant."}],"priority":"N/A"},"related_words":{"derivatives":["orientation (noun): the act of orienting or the state of being oriented","orient (verb): to align or position something in relation to something else"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. It is a specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Meal-oriented' is a compound adjective used to describe something that is focused on or structured around meals. The term is relatively specific and not commonly used in everyday conversation. It is more likely to appear in descriptions of restaurants, travel packages, or lifestyles that prioritize meals."},"example_sentences":[{"sentence":"The cruise ship offers a meal-oriented experience with multiple dining options.","translation":"そのクルーズ船は、複数のダイニングオプションを備えた食事を中心とした体験を提供しています。","type":"adjective","meaning_category":"食事を中心とした"},{"sentence":"They have a meal-oriented approach to family gatherings, with everyone contributing to the meal preparation.","translation":"彼らは家族の集まりに食事を中心としたアプローチを取り、全員が食事の準備に貢献しています。","type":"adjective","meaning_category":"食事に重点を置いた"}]}