{"word":"Elora","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"エローラ：カナダ、オンタリオ州の村","english_definition":"A village in Ontario, Canada. Known for its scenic Elora Gorge and historic buildings.","examples":[{"sentence":"We visited Elora Gorge Conservation Area last summer.","translation":"私たちは昨年の夏にエローラ渓谷自然保護区を訪れました。"},{"sentence":"Elora is a popular tourist destination in Ontario.","translation":"エローラはオンタリオ州で人気の観光地です。"}],"collocations":["Elora Gorge","Elora Quarry","Elora Mill Hotel & Spa"],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"エローラ：インド、マハーラーシュトラ州の遺跡群","english_definition":"A UNESCO World Heritage Site in Maharashtra, India. Famous for its cave temples and monasteries representing Hinduism, Buddhism, and Jainism.","examples":[{"sentence":"The Elora Caves are a remarkable example of ancient Indian rock-cut architecture.","translation":"エローラの石窟寺院は、古代インドの岩窟建築の素晴らしい例です。"},{"sentence":"Visitors come from all over the world to see the Elora temples.","translation":"エローラの寺院を見るために、世界中から観光客が訪れます。"}],"collocations":["Elora Caves","Kailasa Temple (at Elora)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"エローラ：女性の名前","english_definition":"A female given name, possibly of invented origin.","examples":[{"sentence":"Elora is a beautiful and unique name.","translation":"エローラは美しくユニークな名前です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name 'Elora' is uncertain. For the Canadian village, it is believed to be named after a ship. For the Indian site, the etymology is less clear, but it is an ancient place name.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɔːrə/","syllables":"E-lo-ra"},"inflection":{},"usage_notes":{"explanation":"'Elora' refers to multiple locations and a given name. Context is crucial to understanding which 'Elora' is being referenced. The Canadian Elora is a village, while the Indian Elora is a significant historical site.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Elora, India for vacation in Canada.","correct":"✓ I'm going to Elora, India for vacation. / ✓ I'm going to Elora, Canada for vacation.","note":"Make sure to specify the correct location (India or Canada) when referring to Elora. Do not mix the locations."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_places":["Aurangabad (near Elora, India)","Fergus (near Elora, Canada)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency as a place name, more common as a given name.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Elora' is a proper noun that can refer to a village in Canada, a historical site in India, or a given name. Understanding the context is key to interpreting the meaning correctly. The Indian Elora, with its cave temples, is a UNESCO World Heritage Site and of significant historical importance. The Canadian Elora is known for its natural beauty. As a given name, it is relatively uncommon but considered beautiful.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Elora** Caves are a major tourist attraction in India.","translation":"エローラの石窟寺院はインドの主要な観光名所です。","type":"proper noun","meaning_category":"Location (India)"},{"sentence":"We enjoyed hiking through the **Elora** Gorge.","translation":"エローラ渓谷のハイキングを楽しみました。","type":"proper noun","meaning_category":"Location (Canada)"},{"sentence":"**Elora** is a unique and beautiful name for a girl.","translation":"エローラは女の子にとってユニークで美しい名前です。","type":"proper noun","meaning_category":"Given name"}]}