{"word":"horsehairs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"馬の毛（複数形）","english_definition":"Plural form of horsehair: the hair from the mane or tail of a horse, especially when used for stuffing furniture, making brushes, etc.","examples":[{"sentence":"The mattress was stuffed with horsehairs.","translation":"そのマットレスは馬の毛で詰められていた。"},{"sentence":"The bow of the violin is strung with horsehairs.","translation":"バイオリンの弓は馬の毛で張られている。"}],"collocations":["mattress stuffed with horsehairs","violin bow strung with horsehairs"],"synonyms":["horsehair"],"antonyms":[]}],"etymology":{"value":"'Horse' + 'hairs'. Derived from the individual strands of hair from a horse's mane or tail.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɔːrshɛərz/","syllables":"horse-hairs"},"inflection":{"noun_plural":"horsehairs"},"usage_notes":{"explanation":"'Horsehairs' is the plural form of 'horsehair,' referring to multiple strands or quantities of horsehair. It is typically used when discussing the material in a general sense or when referring to multiple individual hairs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chair is stuffed by horsehair.","correct":"✓ The chair is stuffed with horsehair.","note":"Use 'with' to indicate what something is filled with."},{"incorrect":"✗ I found a horsehairs on the floor.","correct":"✓ I found a horsehair on the floor.","note":"'Horsehair' is often used as a mass noun, but if referring to a single strand, use the singular form."}],"priority":"★★☆"},"related_words":{"derivatives":["horsehair"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Horsehairs' refers to the hair from a horse's mane or tail, typically used for stuffing or making certain products. It is a relatively uncommon term in modern English, primarily encountered in specific contexts such as upholstery or musical instruments. Understanding the term requires familiarity with historical materials and manufacturing processes."},"example_sentences":[{"sentence":"Antique furniture often contains horsehairs as a stuffing material.","translation":"アンティーク家具には、詰め物として馬の毛が含まれていることがよくあります。","type":"noun","meaning_category":"material"},{"sentence":"Microscopic examination revealed the presence of horsehairs in the textile sample.","translation":"顕微鏡検査により、繊維サンプルに馬の毛の存在が明らかになった。","type":"noun","meaning_category":"identification"}]}