{"word":"peroratory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"演説の結びの、結辞の","english_definition":"Of or relating to a peroration; concluding a speech or discourse.","examples":[{"sentence":"The peroratory remarks were intended to inspire the audience.","translation":"結びの言葉は聴衆を鼓舞することを意図していた。"},{"sentence":"He delivered a peroratory flourish that brought the crowd to its feet.","translation":"彼は聴衆を総立ちにさせるような、演説の結びの華麗な表現を披露した。"}],"collocations":["peroratory remarks","peroratory flourish","peroratory passage"],"synonyms":["concluding","final","summing up","closing"],"antonyms":["introductory","preliminary","opening"]}],"etymology":{"value":"Late Middle English: from Latin peroratorius, from perorat- ‘pleaded to the end’, from the verb perorare, from per- ‘thoroughly’ + orare ‘speak, plead’.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈrɔːtəri/","syllables":"pe-ro-ra-to-ry"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more peroratory, most peroratory), but they are rarely used."},"usage_notes":{"explanation":"'Peroratory' is primarily used in formal contexts to describe something related to the concluding part of a speech or discourse. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The peroratory was too long and boring.","correct":"✓ The peroration was too long and boring.","note":"'Peroratory' is an adjective, whereas 'peroration' is the noun referring to the concluding part of a speech."}],"priority":"★★☆"},"related_words":{"derivatives":["peroration (noun: 演説の結び、結辞)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'peroratory' is a formal and rare adjective used to describe something related to the concluding part of a speech or discourse. It is more commonly encountered in academic or literary contexts rather than everyday conversation. Understanding its meaning requires a strong vocabulary and familiarity with formal language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The speaker's peroratory statement left a lasting impression on the audience.","translation":"演説者の結びの言葉は聴衆に永続的な印象を与えた。","type":"adjective","meaning_category":"結びの、結辞の"},{"sentence":"The peroratory section of the argument summarized the main points effectively.","translation":"議論の結びの部分は、主要な点を効果的にまとめた。","type":"adjective","meaning_category":"結びの、結辞の"}]}