{"word":"Demolitionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"爆破解体業者、解体専門家","english_definition":"A person who specializes in demolishing buildings or other structures, often using explosives.","examples":[{"sentence":"The demolitionist carefully placed the charges to ensure the building collapsed safely.","translation":"爆破解体業者は、建物が安全に崩壊するように慎重に爆薬を設置した。"},{"sentence":"The company hired a demolitionist to remove the old bridge.","translation":"その会社は、古い橋を撤去するために解体専門家を雇った。"}],"collocations":["certified demolitionist","experienced demolitionist","hire a demolitionist","work as a demolitionist"],"synonyms":["demolisher","wrecker","explosives expert","blaster"],"antonyms":["builder","constructor"]},{"part_of_speech":"noun","definition":"(比喩的に)既存の制度や体制を破壊しようとする人","english_definition":"(Figurative) A person who seeks to destroy or dismantle established systems or institutions.","examples":[{"sentence":"He was seen as a demolitionist, challenging the traditional values of the company.","translation":"彼は会社の伝統的な価値観に挑戦する、既存の制度を破壊しようとする人物と見なされた。"},{"sentence":"The new CEO was labeled a demolitionist for his radical changes to the organization.","translation":"新しいCEOは、組織への抜本的な変更のために、体制を破壊しようとする人物だとレッテルを貼られた。"}],"collocations":["political demolitionist","social demolitionist","institutional demolitionist"],"synonyms":["iconoclast","rebel","revolutionary","disruptor"],"antonyms":["preservationist","conservator","defender"]}],"etymology":{"value":"The word \"demolitionist\" is derived from \"demolition,\" which comes from the Latin word \"demoliri,\" meaning \"to throw down, destroy.\" The suffix \"-ist\" denotes a person who practices or is skilled in something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛməˈlɪʃənɪst/","syllables":"de-mo-li-tion-ist"},"inflection":{"noun_plural":"demolitionists"},"usage_notes":{"explanation":"A \"demolitionist\" is primarily someone who professionally demolishes structures, often with explosives. Figuratively, it can refer to someone who aggressively challenges or dismantles existing systems or ideas. The term can carry a negative connotation when used figuratively, implying destructive intent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a demolition.","correct":"✓ He is a demolitionist.","note":"\"Demolition\" is the act of demolishing, while \"demolitionist\" is the person who performs the demolition."},{"incorrect":"✗ The demolitionist build the building.","correct":"✓ The demolitionist demolished the building.","note":"Demolitionists destroy buildings, they don't build them."}],"priority":"★★☆"},"related_words":{"derivatives":["demolish (verb)","demolition (noun)","demolishing (adjective)"],"related_occupations":["construction worker","engineer","architect","urban planner"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"demolitionist\" refers to someone who is skilled at demolishing buildings, often using explosives. It can also be used metaphorically to describe someone who aggressively challenges or dismantles established systems or ideas. This term is not commonly used in everyday conversation and is more likely to appear in professional or technical contexts, or in discussions about social or political change. Understanding the context is important to determine whether the term is being used literally or figuratively."},"example_sentences":[{"sentence":"The demolitionist prepared the site for the controlled implosion.","translation":"爆破解体業者は、制御された内向き爆発のために現場を準備した。","type":"literal","meaning_category":"professional demolition"},{"sentence":"Critics accused the politician of being a demolitionist, tearing down important social programs.","translation":"批評家たちは、その政治家が重要な社会プログラムを破壊する、体制を破壊しようとする人物だと非難した。","type":"figurative","meaning_category":"challenging systems"}]}