{"word":"nonvolatilizable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"不揮発性の、揮発させることができない","english_definition":"Not capable of being volatilized; not readily evaporating at normal temperatures.","examples":[{"sentence":"The nonvolatilizable residue remained after heating the sample.","translation":"サンプルを加熱した後、不揮発性の残留物が残った。"},{"sentence":"This compound is nonvolatilizable under typical laboratory conditions.","translation":"この化合物は、典型的な実験条件下では揮発させることができない。"}],"collocations":["nonvolatilizable compound (不揮発性化合物)","nonvolatilizable residue (不揮発性残留物)"],"synonyms":["nonvolatile","non-evaporative"],"antonyms":["volatilizable","volatile","evaporative"]}],"etymology":{"value":"\"non-\" (否定) + \"volatilizable\" (揮発させることができる)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.vəˈlætɪlaɪzəbəl/","syllables":"non-vo-lat-il-iz-a-ble"},"inflection":{"adjective_forms":{"comparative":"more nonvolatilizable","superlative":"most nonvolatilizable"}},"usage_notes":{"explanation":"\"Nonvolatilizable\" is primarily used in scientific and technical contexts, particularly in chemistry, physics, and engineering. It describes substances that do not easily evaporate or vaporize at normal temperatures and pressures. The term is often used to distinguish these substances from volatile compounds, which readily evaporate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The volatilizable substance is nonvolatilizable.","correct":"✓ The nonvolatilizable substance is not volatilizable.","note":"The sentence describes a contradiction. A volatilizable substance is, by definition, capable of being volatilized, so it cannot also be nonvolatilizable."},{"incorrect":"✗ Nonvolatilizable is the same as inert.","correct":"✓ Nonvolatilizable means it doesn't easily evaporate, while inert means it doesn't readily react chemically.","note":"Nonvolatilizable refers to the physical property of not easily evaporating, while inert refers to the chemical property of being unreactive."}],"priority":"★★☆"},"related_words":{"derivatives":["nonvolatility (名詞: 不揮発性)","volatilize (動詞: 揮発させる)","volatilization (名詞: 揮発)","volatile (形容詞: 揮発性の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonvolatilizable\" is a technical term used to describe substances that do not easily evaporate or turn into vapor at normal temperatures. It is the opposite of \"volatile.\" This word is mainly found in scientific or technical documents, especially in chemistry, physics, and engineering. If a substance is described as nonvolatilizable, it means it remains in a liquid or solid state under typical conditions.","priority":"★★☆"},"example_sentences":[{"sentence":"The experiment aimed to separate the volatile components from the nonvolatilizable ones.","translation":"その実験は、揮発性成分と不揮発性成分を分離することを目的としていた。","type":"adjective","meaning_category":"chemistry"},{"sentence":"The nonvolatilizable nature of the polymer makes it suitable for high-temperature applications.","translation":"そのポリマーの不揮発性により、高温用途に適している。","type":"adjective","meaning_category":"material science"},{"sentence":"The analyst focused on identifying the nonvolatilizable organic compounds in the sample.","translation":"分析者は、サンプル中の不揮発性有機化合物の特定に焦点を当てた。","type":"adjective","meaning_category":"analytical chemistry"}]}