{"word":"indecorousnesses","priority":"low","meanings":[{"part_of_speech":"noun","definition":"Indecorousnesses is the plural form of indecorousness, which refers to instances or examples of a lack of good taste or propriety; behavior or actions that violate accepted standards of decency or politeness.","english_definition":"Plural form of indecorousness: instances or examples of a lack of good taste or propriety.","examples":[{"sentence":"The report detailed various indecorousnesses displayed during the private party, including inappropriate attire and offensive language.","translation":"その報告書は、私的なパーティーで示された様々な無作法な事例を詳述しており、不適切な服装や攻撃的な言葉遣いが含まれていた。"},{"sentence":"She was shocked by the indecorousnesses she witnessed at the formal event, which included public displays of intoxication and disrespectful behavior towards the hosts.","translation":"彼女は、そのフォーマルなイベントで目撃した無作法な振る舞いに衝撃を受けた。それは、公然の酩酊や主催者に対する無礼な態度を含んでいた。"}],"collocations":["display indecorousnesses","witness indecorousnesses","report indecorousnesses"],"synonyms":["improprieties","indecencies","vulgarities","inappropriateness","unseemliness"],"antonyms":["proprieties","decorums","respectabilities","appropriateness","seemliness"]}],"etymology":{"value":"Derived from 'indecorousness,' which comes from 'indecorous' (lacking propriety) + '-ness' (state or quality). 'Indecorous' is formed from 'in-' (not) + 'decorous' (characterized by propriety and good taste), ultimately from Latin 'decorus' (suitable, becoming).","priority":"low"},"pronunciation":{"ipa":"/ˌɪn.dɪˈkɔːr.əs.nɪsɪz/","syllables":"in-di-cor-ous-ness-es"},"inflection":{"noun_plural":"indecorousnesses"},"usage_notes":{"explanation":"'Indecorousnesses' is a relatively rare word, used to refer to multiple instances of behavior or actions that are considered improper, vulgar, or lacking in good taste. It is more common to use the singular form, 'indecorousness,' or alternative terms like 'improprieties' or 'indecencies.'","priority":"low"},"common_mistakes":{"examples":[{"incorrect":"The indecorousnesses was shocking.","correct":"The indecorousnesses were shocking.","note":"Since 'indecorousnesses' is plural, the verb must also be plural ('were' instead of 'was')."},{"incorrect":"He displayed indecorousness at the party.","correct":"He displayed indecorousnesses at the party.","note":"If referring to multiple instances of improper behavior, the plural form 'indecorousnesses' is more appropriate."}],"priority":"low"},"related_words":{"derivatives":["indecorous (adjective)","indecorously (adverb)","decorous (adjective)","decorum (noun)"],"priority":"low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Indecorousnesses' is a highly sophisticated and infrequent term used to describe multiple instances of behavior lacking in propriety or good taste. Its use is typically confined to formal or literary contexts. Understanding its meaning requires a strong grasp of vocabulary related to etiquette, social norms, and abstract concepts of propriety."},"example_sentences":[{"sentence":"The historical documents detailed various indecorousnesses that occurred within the royal court during the reign of the controversial monarch.","translation":"その歴史的文書は、物議を醸した君主の治世中に王宮内で発生した様々な無作法な事例を詳述していた。","type":"noun","meaning_category":"instances of lacking propriety"},{"sentence":"The journalist meticulously documented the indecorousnesses exhibited by the celebrity during the awards ceremony, resulting in a scandal that dominated headlines for weeks.","translation":"そのジャーナリストは、授賞式でその有名人が見せた無作法な振る舞いを綿密に記録し、数週間にわたって見出しを飾るスキャンダルとなった。","type":"noun","meaning_category":"examples of violating social norms"}]}