{"word":"cowpoxes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"牛痘（ぎゅうとう）の複数形","english_definition":"plural of cowpox: a mild infectious disease of cattle, caused by a virus, that causes lesions on the teats and udders, and can be transmitted to humans, causing similar lesions, especially on the hands.","examples":[{"sentence":"The farmer's hands were covered in cowpoxes.","translation":"その農夫の手は牛痘で覆われていた。"},{"sentence":"Cowpoxes were once common in dairy herds.","translation":"牛痘はかつて乳牛の群れによく見られた。"}],"collocations":["contract cowpoxes (牛痘にかかる)","develop cowpoxes (牛痘を発症する)"],"synonyms":["vaccinia (related, but refers to the vaccine strain)"],"antonyms":[]}],"etymology":{"value":"'Cowpox' is derived from 'cow' and 'pox' (referring to a disease causing pustules). 'Cowpoxes' is simply the plural form.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkaʊpɒksɪz/","syllables":"cow-pox-es"},"inflection":{"noun_plural":"cowpoxes"},"usage_notes":{"explanation":"'Cowpoxes' is the plural form of 'cowpox,' which is a relatively rare disease today due to the success of vaccination. It is primarily of historical significance because the cowpox virus was used by Edward Jenner to develop the first smallpox vaccine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a cowpoxes on his hand.","correct":"✓ He has cowpox on his hand. / ✓ He has cowpox lesions on his hand.","note":"'Cowpox' is often used as an uncountable noun when referring to the disease in general. Use 'cowpox lesions' or 'cowpox sores' to refer to individual instances."}],"priority":"★★☆"},"related_words":{"derivatives":["cowpox (singular form)","vaccinia (related virus, vaccine strain)","smallpox (related, but much more severe disease)","vaccination (related to cowpox through Jenner's discovery)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cowpoxes' is the plural form of 'cowpox,' a term referring to a viral disease primarily affecting cattle, but transmissible to humans. Due to the success of smallpox vaccination (which used the cowpox virus), the term is now relatively rare, primarily encountered in historical or medical contexts. Understanding its significance requires knowledge of medical history, particularly Edward Jenner's work on vaccination."},"example_sentences":[{"sentence":"The old medical textbooks described the symptoms of cowpoxes in detail.","translation":"古い医学書には、牛痘の症状が詳細に記載されていた。","type":"noun","meaning_category":"disease"},{"sentence":"The spread of cowpoxes among dairy cattle was a concern for farmers.","translation":"乳牛の間での牛痘の蔓延は、農家にとって懸念事項だった。","type":"noun","meaning_category":"disease"}]}