{"word":"monocorporeal","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Having or consisting of a single body.","english_definition":"Having or consisting of a single body.","examples":[{"sentence":"The concept of a monocorporeal being is often explored in science fiction.","translation":"単一体の存在という概念は、しばしばサイエンスフィクションで探求される。"},{"sentence":"Philosophical discussions sometimes touch upon the nature of monocorporeal existence.","translation":"哲学的な議論は、単一体の存在の本質に触れることがある。"}],"collocations":["monocorporeal being","monocorporeal existence"],"synonyms":["unicorporeal","single-bodied"],"antonyms":["multicorporeal"],"notes":"This term is relatively rare and often used in philosophical or science fiction contexts."}],"etymology":{"value":"Derived from the combination of 'mono-' (meaning 'single' or 'one') and 'corporeal' (relating to the body).","priority":"medium"},"pronunciation":{"ipa":"/ˌmɒnəʊkɔːrˈpɔːriəl/","syllables":"mon-o-cor-po-re-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms (which are rare for this word)."},"usage_notes":{"explanation":"'Monocorporeal' is used to describe something that exists as a single, unified body, as opposed to something composed of multiple bodies or existing in a non-physical form. It is often encountered in discussions of identity, consciousness, and the nature of being.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The spirit was monocorporeal.","correct":"The entity was monocorporeal.","note":"'Monocorporeal' refers to a physical body, so it's more appropriate to use it with entities that can have a physical form."}],"priority":"low"},"related_words":{"derivatives":["monocorporeality (noun)"],"related_terms":["corporeal","mono-","multicorporeal"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term.","priority":"low"},"readability_explanation":{"level":"C2","text":"'Monocorporeal' is a technical term primarily used in philosophical or science fiction contexts to describe something that exists as a single, unified body. It is not commonly used in everyday language. Understanding this word requires familiarity with abstract concepts related to existence and physicality."},"example_sentences":[{"sentence":"The alien entity was described as a massive, monocorporeal organism.","translation":"その異星生命体は、巨大な単一体の有機体として記述された。","type":"general","meaning_category":"single body"},{"sentence":"The philosophical debate centered on whether consciousness requires a monocorporeal form.","translation":"その哲学的議論は、意識が単一体の形態を必要とするかどうかを中心に展開された。","type":"philosophical","meaning_category":"single body"}]}