{"word":"Pan-Americanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"汎アメリカ主義：南北アメリカ大陸の国々の政治的、経済的、社会的、文化的な協力と連帯を促進する運動またはイデオロギー。","english_definition":"A movement or ideology that seeks to promote political, economic, social, and cultural cooperation and solidarity among the countries of the Americas (North, Central, and South America, and the Caribbean).","examples":[{"sentence":"Pan-Americanism aims to foster mutual understanding and collaboration among the nations of the Western Hemisphere.","translation":"汎アメリカ主義は、西半球の国々の相互理解と協調を促進することを目指しています。"},{"sentence":"The Organization of American States (OAS) is a key institution in the pursuit of Pan-Americanism.","translation":"米州機構（OAS）は、汎アメリカ主義の追求における重要な機関です。"},{"sentence":"Historically, Pan-Americanism has been influenced by various political and economic interests.","translation":"歴史的に、汎アメリカ主義はさまざまな政治的および経済的利益の影響を受けてきました。"}],"collocations":["promote Pan-Americanism (汎アメリカ主義を促進する)","foster Pan-Americanism (汎アメリカ主義を育成する)","Organization of American States (OAS) (米州機構)","Pan-American conference (汎アメリカ会議)","Pan-American Highway (パンアメリカンハイウェイ)"],"synonyms":["Inter-Americanism","Hemispheric cooperation","American solidarity"],"antonyms":["Isolationism","Nationalism"]},{"part_of_speech":"noun","definition":"汎アメリカ主義の原則または政策。","english_definition":"The principles or policies of Pan-Americanism.","examples":[{"sentence":"The government's foreign policy is guided by the principles of Pan-Americanism.","translation":"政府の外交政策は、汎アメリカ主義の原則に導かれています。"},{"sentence":"Critics argue that some interpretations of Pan-Americanism have served the interests of dominant powers.","translation":"批評家たちは、汎アメリカ主義のいくつかの解釈が、支配的な勢力の利益に役立ってきたと主張しています。"}],"collocations":["principles of Pan-Americanism (汎アメリカ主義の原則)","policies of Pan-Americanism (汎アメリカ主義の政策)"],"synonyms":["Inter-American principles","Hemispheric policies"],"antonyms":["Anti-Pan-Americanism","Anti-Inter-Americanism"]}],"etymology":{"value":"'Pan-' (すべて) + 'American' (アメリカの) + '-ism' (主義)。アメリカ大陸全体の団結と協力を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæn əˈmɛrɪkənɪzəm/","syllables":"Pan-A-mer-i-can-ism"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"'Pan-Americanism' は、南北アメリカ大陸の国々の間の協力と連帯を促進するイデオロギーおよび運動を指します。この用語は、政治、経済、社会、文化など、さまざまな分野での協力を包含します。米州機構（OAS）などの組織は、汎アメリカ主義の目標を追求する上で重要な役割を果たしています。ただし、汎アメリカ主義の概念は、歴史的にさまざまな政治的および経済的利益の影響を受けてきたため、批判や議論の対象となることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pan-Americanism only refers to the United States.","correct":"✓ Pan-Americanism refers to all countries in the Americas.","note":"汎アメリカ主義は、アメリカ大陸全体の国々を対象とします。"},{"incorrect":"✗ Pan-Americanism is the same as American imperialism.","correct":"✓ Pan-Americanism is distinct from American imperialism, although it has sometimes been criticized for serving the interests of dominant powers.","note":"汎アメリカ主義は、アメリカ帝国主義とは異なりますが、支配的な勢力の利益に役立ってきたとして批判されることがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Pan-American (形容詞：汎アメリカの)","Pan-Americanist (名詞：汎アメリカ主義者)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的に低い頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pan-Americanism' は、南北アメリカ大陸の国々の間の政治的、経済的、社会的、文化的な協力を促進するイデオロギーまたは運動を指す専門用語です。この用語は、歴史的および政治的な文脈で使用されることが多く、米州機構（OAS）などの組織に関連付けられています。この用語を理解するには、アメリカ大陸の国々の間の関係と、これらの関係に影響を与えてきたさまざまな政治的および経済的利益についての知識が必要です。"},"example_sentences":[{"sentence":"The conference focused on strengthening Pan-Americanism through economic cooperation.","translation":"会議は、経済協力を通じて汎アメリカ主義を強化することに焦点を当てました。","type":"general","meaning_category":"協力促進"},{"sentence":"Some critics argue that Pan-Americanism has historically favored the interests of the United States.","translation":"一部の批評家は、汎アメリカ主義が歴史的に米国の利益を優先してきたと主張しています。","type":"critical","meaning_category":"批判"},{"sentence":"The Pan-American Highway is a symbol of connectivity and cooperation across the Americas.","translation":"パンアメリカンハイウェイは、アメリカ大陸全体の接続性と協力の象徴です。","type":"symbolic","meaning_category":"象徴"}]}