{"word":"Pelmanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神経衰弱 (カードゲーム)","english_definition":"A card game in which all of the cards are laid face down on a surface and two cards are flipped face up over each turn. The object of the game is to turn over pairs of matching cards.","examples":[{"sentence":"We played Pelmanism to pass the time on the rainy afternoon.","translation":"雨の日の午後、時間つぶしに神経衰弱をしました。"},{"sentence":"Pelmanism is a good game to improve memory skills.","translation":"神経衰弱は記憶力を高めるのに良いゲームです。"}],"collocations":["play Pelmanism","a game of Pelmanism"],"synonyms":["Concentration (game)","Memory (game)","Pairs (game)"],"antonyms":[]}],"etymology":{"value":"The name 'Pelmanism' comes from the Pelman Institute, a company that sold memory training courses in the early 20th century. They used the game as part of their memory training techniques, hence the association.","priority":"★★★"},"pronunciation":{"ipa":"ˈpɛlmənɪzəm","syllables":"Pel-ma-nism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Pelmanism' is a specific name for the card game also known as 'Concentration', 'Memory', or 'Pairs'. It is less commonly used than the other names, especially outside of the UK.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to play a Pelmanism with my friends.","correct":"✓ I'm going to play Pelmanism with my friends.","note":"'Pelmanism' is the name of the game itself, so it's not usually preceded by 'a' unless you're specifying a particular version or set of the game."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_games":["Concentration","Memory","Pairs"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pelmanism' is a specific term for a card game that's more commonly known as 'Memory' or 'Concentration'. It might be used in contexts where the history or origin of the game is being discussed, or in regions where the term is more prevalent. If you're simply referring to the game itself, 'Memory' or 'Concentration' are generally more widely understood."},"example_sentences":[{"sentence":"Do you know how to play Pelmanism?","translation":"神経衰弱のやり方を知っていますか？","type":"general","meaning_category":"gameplay"},{"sentence":"She is very good at Pelmanism because she has an excellent memory.","translation":"彼女は記憶力がとても良いので、神経衰弱がとても得意です。","type":"skill","meaning_category":"ability"}]}