{"word":"unresignedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"諦めずに、甘んじることなく、不承不承ながら","english_definition":"Without resignation; in a manner that does not accept or submit to something passively or without resistance.","examples":[{"sentence":"She faced the challenges unresignedly, determined to overcome them.","translation":"彼女は諦めずに課題に立ち向かい、乗り越えようと決意した。"},{"sentence":"He fought unresignedly for his beliefs, even when facing opposition.","translation":"彼は反対に直面しても、諦めずに自分の信念のために戦った。"},{"sentence":"The team played unresignedly until the final whistle, never giving up hope of victory.","translation":"チームは試合終了のホイッスルが鳴るまで諦めずにプレーし、勝利への希望を捨てなかった。"}],"collocations":["face challenges unresignedly","fight for beliefs unresignedly","play unresignedly"],"synonyms":["resolutely","determinedly","tenaciously","persistently","unyieldingly","adamantly","stubbornly","doggedly"],"antonyms":["resignedly","passively","acquiescently","submissively","yieldingly","compliantly"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"resignedly\". \"Resignedly\" is derived from \"resigned\" (accepting something unpleasant) + \"-ly\" (adverbial suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnrɪˈzaɪnɪdli/","syllables":"un-re-sign-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Unresignedly\" describes an action or state of being that is characterized by a lack of resignation. It implies a refusal to passively accept or submit to a difficult or unpleasant situation. It suggests a proactive and determined approach to overcoming challenges or fighting for one's beliefs. The word is relatively uncommon, but it can be useful in emphasizing the strength of someone's resolve.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She unresignedly accepted the award.","correct":"✓ She accepted the award unresignedly.","note":"The adverb 'unresignedly' should be used to describe the manner in which an action is performed, not to suggest that the action itself was not accepted. In this case, the sentence should be rephrased to indicate that the acceptance was done without resignation, perhaps with reluctance or a desire for something else."},{"incorrect":"✗ He felt unresignedly about the situation.","correct":"✓ He felt unresigned about the situation.","note":"'Unresignedly' is an adverb, so it modifies verbs, adverbs, or adjectives. To describe a feeling, use the adjective 'unresigned' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["unresigned (adjective)","resignedly (adverb)","resignation (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unresignedly' is an advanced adverb meaning 'without giving up' or 'without accepting something bad'. It's not a common word, so you'll mostly find it in formal writing. For example, 'She faced the challenge unresignedly' means she didn't give up when things got tough."},"example_sentences":[{"sentence":"The activists continued their protest unresignedly, despite the police presence.","translation":"活動家たちは警察の存在にもかかわらず、諦めずに抗議活動を続けた。","type":"adverb","meaning_category":"諦めずに"},{"sentence":"He fought unresignedly for his rights in court, refusing to accept injustice.","translation":"彼は不当な扱いを受け入れることを拒否し、裁判で諦めずに自分の権利のために戦った。","type":"adverb","meaning_category":"甘んじることなく"},{"sentence":"The team worked unresignedly through the night to meet the deadline.","translation":"チームは締め切りに間に合わせるため、夜通し諦めずに作業した。","type":"adverb","meaning_category":"不承不承ながら"}]}