{"word":"mutation-targeted","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"突然変異を標的とした、変異特異的な","english_definition":"Designed or intended to specifically target cells or processes affected by a particular genetic mutation.","examples":[{"sentence":"Mutation-targeted therapies offer a more precise approach to cancer treatment.","translation":"変異特異的な治療法は、より精密な癌治療へのアプローチを提供する。"},{"sentence":"The drug is mutation-targeted, meaning it only affects cells with the specific genetic alteration.","translation":"この薬は変異特異的であり、特定の遺伝子変異を持つ細胞にのみ影響を与えることを意味する。"}],"collocations":["mutation-targeted therapy","mutation-targeted drug","mutation-targeted approach","mutation-targeted treatment"],"synonyms":["mutation-specific","genetically targeted","personalized medicine"],"antonyms":["broad-spectrum","non-specific"],"notes":"This term is commonly used in the context of cancer research and personalized medicine, where treatments are tailored to the specific genetic mutations driving a patient's disease."}],"etymology":{"value":"Combination of 'mutation' (a change in the DNA sequence of a cell) and 'targeted' (directed at a specific object or purpose).","priority":"medium"},"pronunciation":{"ipa":"/ˌmjuːˈteɪʃən ˈtɑːrɡɪtɪd/","syllables":"mu-ta-tion-tar-get-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Mutation-targeted' describes interventions designed to act on cells or processes exhibiting particular mutations. This is a key concept in precision medicine.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The treatment is targeted to the disease, not the mutation.","correct":"The treatment is mutation-targeted.","note":"Ensure the targeting is specifically related to a mutation."}],"priority":"medium"},"related_words":{"derivatives":["target","mutation","personalized medicine","precision medicine"],"related_terms":["biomarker","gene therapy","oncogene","tumor suppressor gene"]},"level_frequency":{"frequency_google_ngram":"Low - Primarily used in scientific and medical contexts.","priority":"medium"},"readability_explanation":{"level":"C1","text":"'Mutation-targeted' is a technical term used in genetics and medicine, particularly in the context of cancer treatment. It describes therapies that are specifically designed to act on cells or processes that are affected by a particular genetic mutation. Understanding this term requires familiarity with basic concepts in genetics and molecular biology."},"example_sentences":[{"sentence":"The research focuses on developing mutation-targeted inhibitors for EGFR-mutated lung cancer.","translation":"この研究は、EGFR変異肺がんに対する変異特異的阻害剤の開発に焦点を当てている。","type":"general","meaning_category":"Medical research"},{"sentence":"Mutation-targeted diagnostics are essential for identifying patients who will benefit from specific therapies.","translation":"変異特異的な診断は、特定の治療から利益を得られる患者を特定するために不可欠である。","type":"general","meaning_category":"Diagnostics"}]}