{"word":"spending-heavy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"支出が多い、消費支出が多い","english_definition":"Characterized by a high level of spending or expenditure.","examples":[{"sentence":"The company is implementing cost-cutting measures to address its spending-heavy operations.","translation":"その会社は、支出の多い運営に対処するために、コスト削減策を実施しています。"},{"sentence":"The government's spending-heavy budget has raised concerns about the national debt.","translation":"政府の支出が多い予算は、国の債務に対する懸念を高めています。"},{"sentence":"The project was deemed spending-heavy and unsustainable in the long run.","translation":"そのプロジェクトは、支出が多く、長期的には持続不可能であると見なされました。"}],"collocations":["spending-heavy budget","spending-heavy operations","spending-heavy approach","spending-heavy policies"],"synonyms":["high-spending","lavish","extravagant","profligate"],"antonyms":["frugal","thrifty","economical","cost-effective","spending-light"]},{"part_of_speech":"adjective","definition":"(経済・産業などが)消費支出に大きく依存する","english_definition":"Relating to an economy, industry, or sector that relies heavily on consumer spending.","examples":[{"sentence":"The retail sector is a spending-heavy industry, particularly during the holiday season.","translation":"小売業は、特にホリデーシーズン中に消費支出に大きく依存する産業です。"},{"sentence":"The economy is becoming increasingly spending-heavy, with consumer demand driving growth.","translation":"経済は、消費者の需要が成長を牽引し、ますます消費支出に大きく依存するようになっています。"}],"collocations":["spending-heavy economy","spending-heavy sector","spending-heavy market"],"synonyms":["consumption-driven","demand-led"],"antonyms":["investment-driven","export-oriented"]}],"etymology":{"value":"Compound word formed by combining 'spending' (referring to the act of expending money) and 'heavy' (indicating a large amount or degree). The term implies a significant volume or intensity of spending.","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"spend-ing-heav-y"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"The term 'spending-heavy' is typically used to describe situations, entities, or policies characterized by a high level of expenditure. It can refer to a company's operational costs, a government's budget, or an economy's reliance on consumer spending. The term often carries a negative connotation, implying that the spending is excessive or unsustainable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is spending heavy.","correct":"✓ The company is spending heavily. / ✓ The company has a spending-heavy approach.","note":"'Spending-heavy' is an adjective, so it should be used to describe a noun. To describe the act of spending, use the adverb 'heavily'."},{"incorrect":"✗ The spending-heavy is a problem.","correct":"✓ Spending-heavy policies are a problem.","note":"'Spending-heavy' requires a noun to modify. It cannot stand alone as a subject."}],"priority":"★★☆"},"related_words":{"derivatives":["spending (noun, verb)","heavy (adjective, adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'spending-heavy' is a relatively specialized term used to describe a situation or entity characterized by a high level of expenditure. It is often used in economic or financial contexts to describe budgets, policies, or operations that involve significant spending. The term may carry a negative connotation, implying that the spending is excessive or unsustainable. Understanding this term requires a good grasp of vocabulary related to finance and economics."},"example_sentences":[{"sentence":"The firm's spending-heavy marketing campaign failed to generate the expected returns.","translation":"その会社の支出の多いマーケティングキャンペーンは、期待された収益を生み出すことができませんでした。","type":"adjective","meaning_category":"Expenditure"},{"sentence":"The government's spending-heavy approach to infrastructure development has been criticized by some economists.","translation":"インフラ開発に対する政府の支出が多いアプローチは、一部の経済学者によって批判されています。","type":"adjective","meaning_category":"Expenditure"},{"sentence":"The spending-heavy nature of the healthcare industry contributes to rising medical costs.","translation":"医療業界の支出が多い性質は、医療費の高騰に寄与しています。","type":"adjective","meaning_category":"Expenditure"}]}