{"word":"Cylindrarthrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Anatomy) A type of synovial joint that allows movement in one plane (uniaxial), where a cylindrical surface rotates within a ring formed of bone and ligament.","english_definition":"A type of synovial joint in which a cylindrical surface rotates within a ring formed of bone and ligament, allowing movement in one plane.","examples":[{"sentence":"The elbow joint is an example of a cylindrarthrosis, allowing flexion and extension.","translation":"肘関節は円柱関節の一例であり、屈曲と伸展を可能にする。"}],"collocations":["elbow joint","uniaxial joint","synovial joint","flexion and extension"],"synonyms":["hinge joint","ginglymus"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'cylindro-' (meaning cylinder) and 'arthrosis' (meaning joint).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪlɪnˌdɹɑːrˈθroʊsɪs/","syllables":"cy-lin-drar-thro-sis"},"inflection":{"noun_plural":"cylindrarthroses"},"usage_notes":{"explanation":"Cylindrarthrosis is a specific type of synovial joint characterized by a cylindrical shape that allows movement primarily in one plane, similar to a hinge. It's often used in anatomical descriptions and discussions of joint mechanics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The knee is a cylindrarthrosis.","correct":"✓ The knee is a modified hinge joint.","note":"While the knee is a hinge-like joint, it also allows some rotation, making it a modified hinge joint rather than a pure cylindrarthrosis."}],"priority":"★★☆"},"related_words":{"derivatives":["cylindrical (adjective)","arthrology (noun)","arthritic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized anatomical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cylindrarthrosis' is a highly specialized anatomical term referring to a type of joint that functions like a hinge, allowing movement in only one plane. Understanding this term requires advanced knowledge of anatomy and biomechanics. It is not commonly used outside of medical or scientific contexts."},"example_sentences":[{"sentence":"The radioulnar joint is a type of cylindrarthrosis that allows pronation and supination of the forearm.","translation":"橈尺関節は円柱関節の一種であり、前腕の回内と回外を可能にする。","type":"noun","meaning_category":"Anatomy"}]}