{"word":"theologoumenon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"神学的な意見、または聖書や教義に直接基づいていないが、神学的な議論や推測を通じて発展した物語や解釈。","english_definition":"A theological opinion or statement that is not directly derived from scripture or doctrine, but is developed through theological reasoning or speculation; a story or interpretation serving to illustrate a theological point.","examples":[{"sentence":"The story of the cross being made from the wood of the Tree of Knowledge is a theologoumenon.","translation":"十字架が知恵の木の木材で作られたという話は、神学的な意見（theologoumenon）です。"},{"sentence":"While not explicitly stated in the Bible, the idea that angels have specific ranks is often considered a theologoumenon.","translation":"聖書に明示的に述べられていませんが、天使には特定の階級があるという考えは、しばしば神学的な意見（theologoumenon）と見なされます。"}],"collocations":["develop a theologoumenon","discuss a theologoumenon","interpret a theologoumenon","a popular theologoumenon","a common theologoumenon"],"synonyms":["theological speculation","theological interpretation","theological opinion","doctrine","dogma"],"antonyms":["dogmatic teaching","scriptural truth","canonical doctrine"]},{"part_of_speech":"noun","definition":"（複数形：theologoumena）特定の神学的テーマを説明または例示するために使用される物語、伝説、または伝統。","english_definition":"(plural: theologoumena) A story, legend, or tradition used to explain or illustrate a particular theological theme.","examples":[{"sentence":"Many apocryphal stories function as theologoumena, providing insights into the beliefs of early Christians.","translation":"多くのアポクリファの物語は、初期のキリスト教徒の信念への洞察を提供する、神学的なテーマを説明するための物語（theologoumena）として機能します。"},{"sentence":"Theologoumena often fill in gaps or offer explanations where scripture is silent.","translation":"神学的なテーマを説明するための物語（Theologoumena）は、聖書が沈黙している箇所を埋めたり、説明を提供したりすることがよくあります。"}],"collocations":["apocryphal theologoumena","early Christian theologoumena","biblical theologoumena","interpret theologoumena","study theologoumena"],"synonyms":["legend","tradition","narrative","story","myth","allegory"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「θεολογούμενον (theologoumenon)」に由来し、「神学的に議論されたこと」または「神学的に考えられたこと」を意味する。動詞「θεολογέω (theologeō)」（神学を語る、神学的に考える）の受動分詞中性形。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθiːəˌlɒɡəˈmɛnɒn/","syllables":"the-o-lo-gou-me-non"},"inflection":{"noun_plural":"theologoumena"},"usage_notes":{"explanation":"「theologoumenon」は、聖書や確立された教義に直接基づいているわけではないものの、神学的な考察や議論を通じて発展したアイデアや物語を指す専門用語です。これは、特定の神学的ポイントを説明または例示するのに役立つ物語、伝説、または伝統である可能性があります。重要なのは、theologoumenonは必ずしも誤りであるとは限らず、神学的な理解を深めるための手段として機能するということです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Theologoumenon is a direct quote from the Bible.","correct":"✓ A theologoumenon is not a direct quote from the Bible but rather an interpretation or elaboration.","note":"Theologoumena are interpretations or elaborations, not direct quotes from scripture."},{"incorrect":"✗ Theologoumenon is always considered heretical.","correct":"✓ Theologoumenon is not necessarily heretical but is a theological opinion or speculation.","note":"Theologoumena are not inherently heretical; they are simply theological opinions or speculations that are not directly based on scripture."}],"priority":"★★☆"},"related_words":{"derivatives":["theology","theological","theologian"],"phrases":["theological interpretation","theological speculation"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「theologoumenon」は、神学の分野で使われる専門的な言葉で、聖書や教義に直接基づいているわけではないけれど、神学的な考えや議論から生まれた物語や解釈のことを指します。これは、神学的なテーマを説明したり、例え話として使われたりする物語や伝説のようなものです。この言葉を使うときは、それが聖書に直接書かれていることではなく、神学的な考察から生まれたものだということを理解しておく必要があります。"},"example_sentences":[{"sentence":"The idea of the Harrowing of Hell is considered by some to be a theologoumenon.","translation":"ハローイング・オブ・ヘル（キリストの冥府下り）の概念は、神学的な意見（theologoumenon）と見なす人もいます。","type":"noun","meaning_category":"神学的な意見"},{"sentence":"Many early church fathers used theologoumena to explain complex theological concepts to the laity.","translation":"初期の教父の多くは、複雑な神学概念を一般信徒に説明するために、神学的なテーマを説明するための物語（theologoumena）を使用しました。","type":"noun","meaning_category":"物語"}]}