{"word":"Elsinore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(デンマークの都市) ヘルシンゲル","english_definition":"A city in eastern Denmark, at the narrowest point of the Øresund strait between Denmark and Sweden. It is known in Danish as Helsingør.","examples":[{"sentence":"Elsinore is famous as the setting for Shakespeare's play Hamlet.","translation":"ヘルシンゲルは、シェイクスピアの戯曲『ハムレット』の舞台として有名です。"},{"sentence":"We visited Kronborg Castle in Elsinore.","translation":"私たちはヘルシンゲルにあるクロンボー城を訪れました。"}],"collocations":["Kronborg Castle in Elsinore","Hamlet in Elsinore"],"synonyms":["Helsingør (Danish name)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(カリフォルニア州の都市) エルシノア湖","english_definition":"A city in Riverside County, California, USA. It is known for Lake Elsinore, a large freshwater lake.","examples":[{"sentence":"Lake Elsinore is a popular spot for watersports.","translation":"エルシノア湖は、ウォータースポーツの人気スポットです。"},{"sentence":"We drove to Elsinore for the weekend.","translation":"週末にエルシノアまでドライブしました。"}],"collocations":["Lake Elsinore","City of Elsinore"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Elsinore is an English adaptation of the Danish name Helsingør. The origin of Helsingør is debated, but it likely combines 'hals' (neck, referring to the narrow strait) and 'ør' (sandbank). The California city was named after the Danish city.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛlsɪnɔːr/","syllables":"El-si-nore"},"inflection":{},"usage_notes":{"explanation":"'Elsinore' refers to two distinct locations: a city in Denmark (Helsingør) and a city in California. The Danish Elsinore is primarily known as the setting of Shakespeare's Hamlet and for Kronborg Castle. The Californian Elsinore is known for Lake Elsinore, a large lake used for recreation. When using the name, context is important to clarify which location is being referenced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Elsinore in Denmark to swim in the lake.","correct":"✓ I'm going to Elsinore in California to swim in the lake.","note":"It's important to specify which Elsinore you're referring to, especially when the context might be ambiguous."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_places":["Denmark","California","Helsingør","Lake Elsinore"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (depending on context and familiarity with Shakespeare)","frequency_google_ngram":"Relatively low frequency, but recognizable due to Shakespeare's Hamlet.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Elsinore' is a place name that can refer to either a city in Denmark or a city in California. The Danish city is more widely known due to its association with Shakespeare's 'Hamlet'. Therefore, when using the name 'Elsinore', it's helpful to provide context to avoid confusion about which location is being referenced. The word is not commonly used in everyday conversation unless discussing literature, travel, or geography.","priority":"★☆☆"},"example_sentences":[{"sentence":"Shakespeare's Hamlet is set in Elsinore, Denmark.","translation":"シェイクスピアのハムレットは、デンマークのヘルシンゲルを舞台にしています。","type":"location","meaning_category":"Denmark"},{"sentence":"Lake Elsinore is a popular destination for water sports enthusiasts in Southern California.","translation":"エルシノア湖は、南カリフォルニアのウォータースポーツ愛好家にとって人気の目的地です。","type":"location","meaning_category":"California"}]}