{"word":"Panlogism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 汎論理主義：世界や現実全体が論理的な構造を持つという哲学的な見解。ヘーゲル哲学において顕著。","english_definition":"(Philosophy) The philosophical view that the world or the entirety of reality has a logical structure; prominent in Hegelian philosophy.","examples":[{"sentence":"Hegel's philosophy is often characterized by panlogism, as he believed that the rational is real and the real is rational.","translation":"ヘーゲルの哲学は、理性が現実であり、現実が理性であると信じていたため、しばしば汎論理主義として特徴づけられる。"}],"collocations":["Hegelian panlogism","philosophical panlogism"],"synonyms":["Logical idealism","Rational idealism"],"antonyms":["Irrationalism","Empiricism"]}],"etymology":{"value":"'Pan-' (すべて) + 'logism' (論理、理性) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpænˌlɒdʒɪzəm/","syllables":"pan-lo-gi-sm"},"inflection":{"noun_plural":"panlogisms"},"usage_notes":{"explanation":"Panlogism is a philosophical term primarily associated with the philosophy of G.W.F. Hegel. It posits that the universe is fundamentally rational and that everything that exists can be understood through logical principles. This view suggests a deep interconnectedness between thought and being, where reality itself is structured according to logical laws.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Panlogism is the belief that everything is made of pans.","correct":"✓ Panlogism is the philosophical view that reality is fundamentally logical.","note":"Panlogism is a philosophical concept, not related to physical objects like 'pans'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Panlogical (adjective)"],"related_terms":["Hegelianism","Idealism","Rationalism","Dialectic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Panlogism' is a highly specialized philosophical term. It refers to the idea, especially in Hegel's philosophy, that the universe is fundamentally rational and logical. Understanding this term requires familiarity with philosophical concepts like idealism, rationalism, and Hegelian dialectics. It is not commonly used outside of philosophical discussions."},"example_sentences":[{"sentence":"The core tenet of Hegelianism is its commitment to panlogism, the belief that reason governs reality.","translation":"ヘーゲル主義の中核となる信条は、理性が現実を支配するという汎論理主義へのコミットメントである。","type":"general","meaning_category":"philosophical concept"},{"sentence":"Critics of panlogism argue that it neglects the role of contingency and irrationality in the world.","translation":"汎論理主義の批判者たちは、偶然性や非合理性が世界に果たす役割を無視していると主張する。","type":"general","meaning_category":"philosophical concept"}]}