{"word":"Gypsophila","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カスミソウ","english_definition":"A genus of flowering plants in the carnation family, Caryophyllaceae, native to Eurasia, Africa, Australia, and the Pacific Islands.","examples":[{"sentence":"She added some Gypsophila to the bouquet.","translation":"彼女は花束にカスミソウを加えました。"},{"sentence":"Gypsophila is often used as a filler flower in floral arrangements.","translation":"カスミソウは、フラワーアレンジメントの添え花としてよく使われます。"}],"collocations":["Gypsophila bouquet (カスミソウの花束)","Gypsophila paniculata (一般的なカスミソウの種類)","dried Gypsophila (ドライフラワーのカスミソウ)"],"synonyms":["baby's-breath"],"antonyms":[]}],"etymology":{"value":"New Latin, from Ancient Greek γύψος (gúpsos, \"gypsum\") + φίλος (phílos, \"loving\"), referring to the plant's preference for gypsum-rich soils.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒɪpˈsɒfɪlə/","syllables":"Gyp-soph-i-la"},"inflection":{"noun_plural":"Gypsophilas"},"usage_notes":{"explanation":"'Gypsophila' is the scientific name, but the common name 'baby's-breath' is more frequently used in everyday conversation. It is known for its delicate, small white or pink flowers and is a popular addition to bouquets and floral arrangements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Gypsophila are beautiful.","correct":"✓ Gypsophila is beautiful.","note":"Although referring to multiple flowers, 'Gypsophila' is treated as a singular noun when referring to the genus itself."},{"incorrect":"✗ I like gypsophila.","correct":"✓ I like gypsophila.","note":"The word is often misspelled, remember the 'p' after 'Gyp'."}],"priority":"★★☆"},"related_words":{"derivatives":["Gypsophilaceae (Caryophyllaceae family)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gypsophila' is a botanical term referring to a genus of flowering plants, commonly known as baby's-breath. It's primarily used in contexts related to gardening, floristry, or botany. While not a common word in everyday conversation, it's important to recognize in specialized fields. The term's etymology reflects the plant's affinity for gypsum-rich soils, a detail that may be of interest to those studying plant science or horticulture."},"example_sentences":[{"sentence":"The bride's bouquet was filled with white roses and delicate Gypsophila.","translation":"花嫁の花束は白いバラと繊細なカスミソウでいっぱいでした。","type":"noun","meaning_category":"flower"},{"sentence":"Grow Gypsophila in well-drained soil with plenty of sunlight.","translation":"日当たりの良い、水はけの良い土壌でカスミソウを育ててください。","type":"noun","meaning_category":"gardening"},{"sentence":"The florist suggested adding Gypsophila to create a softer look.","translation":"花屋は、より柔らかな印象にするためにカスミソウを加えることを提案しました。","type":"noun","meaning_category":"floristry"}]}