{"word":"fanwork","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ファン作品、二次創作 (既存の作品のファンが作成した小説、イラスト、映像、音楽など)","english_definition":"A work of fiction, art, music, etc., created by a fan of an existing work, and based on that work.","examples":[{"sentence":"Her fanwork of the series was very popular online.","translation":"彼女のそのシリーズのファン作品はオンラインでとても人気があった。"},{"sentence":"The convention featured many booths selling fanwork.","translation":"そのコンベンションでは多くのブースがファン作品を販売していた。"},{"sentence":"Some authors encourage fanwork based on their books.","translation":"自分の本に基づいたファン作品を奨励する作家もいる。"}],"collocations":["create fanwork (ファン作品を作る)","publish fanwork (ファン作品を公開する)","share fanwork (ファン作品を共有する)","fanwork community (ファン作品コミュニティ)","fanwork site (ファン作品サイト)"],"synonyms":["fan fiction","fan art","derivative work","fan creation"],"antonyms":["original work","canon"],"notes":"Often used to refer to fan fiction (fan-written stories) and fan art (fan-created visual art), but can encompass other forms of creative expression as well, such as fan films, fan music, and cosplay."}],"etymology":{"value":"A portmanteau of \"fan\" and \"work,\" indicating a work created by a fan.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfænwɜːrk/","syllables":"fan-work"},"inflection":{"noun_plural":"fanworks"},"usage_notes":{"explanation":"\"Fanwork\" is a broad term encompassing any creative work produced by fans based on existing media properties like books, movies, TV shows, video games, and comics. It is often non-commercial and shared within online communities. The legality of fanwork can be complex, depending on copyright laws and the original creator's stance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a fanwork from the original author.","correct":"✓ I bought a fanwork from a fan at the convention.","note":"Fanwork is created by fans, not the original author of the source material."},{"incorrect":"✗ This is official fanwork.","correct":"✓ This is fanwork.","note":"Fanwork is, by definition, unofficial. If it's official, it's simply a work related to the original property."}],"priority":"★★☆"},"related_words":{"derivatives":["fan","work","fan fiction","fan art","fandom","fanbase"],"phrasal_verbs":[],"related_terms":["canon","original work","derivative work","copyright","fair use"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"fanwork\" is a term used within fandom communities to describe creative works made by fans based on existing books, movies, games, or other media. It includes things like fan fiction (stories), fan art (drawings or paintings), and other creative projects. Because it's a specialized term, it's not commonly used outside of these communities. Understanding its meaning requires some familiarity with the concept of fandom and derivative works."},"example_sentences":[{"sentence":"The artist displayed her elaborate fanwork at the anime convention.","translation":"そのアーティストは、アニメコンベンションで手の込んだファン作品を展示した。","type":"noun","meaning_category":"ファン作品"},{"sentence":"Many websites host and archive fanwork for various fandoms.","translation":"多くのウェブサイトが、さまざまなファン層向けのファン作品をホストおよびアーカイブしている。","type":"noun","meaning_category":"ファン作品"},{"sentence":"The author appreciates the creativity and passion evident in the fanwork inspired by her novels.","translation":"その作家は、彼女の小説に触発されたファン作品に表れている創造性と情熱を高く評価している。","type":"noun","meaning_category":"ファン作品"}]}