{"word":"cornicle","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（アブラムシの）腹管","english_definition":"One of a pair of small, tube-like structures projecting dorsally from the posterior abdomen of most aphids; also called a siphunculus.","examples":[{"sentence":"The cornicles are used to secrete a defensive fluid.","translation":"腹管は防御液を分泌するために使われる。"},{"sentence":"The shape and size of the cornicles can be used to identify different species of aphids.","translation":"腹管の形と大きさは、アブラムシの異なる種を識別するために使用できる。"}],"collocations":["aphid cornicle","cornicle secretion","cornicle morphology"],"synonyms":["siphunculus"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'corniculum,' a diminutive of 'cornu,' meaning 'horn.' This refers to the horn-like shape of the structures.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrnɪkəl/","syllables":"cor-ni-cle"},"inflection":{"noun_plural":"cornicles"},"usage_notes":{"explanation":"Cornicles are a key identifying feature of aphids. They are typically paired structures located on the dorsal (upper) side of the aphid's abdomen. While their exact function is still debated, it is known that they can secrete a defensive fluid, often containing triglycerides, that can deter predators or even solidify to trap them. The morphology (shape and structure) of the cornicles is often used in taxonomic identification of different aphid species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cornacle is used for feeding.","correct":"✓ The cornicle is used for defense.","note":"While aphids feed through a stylet, the cornicles are primarily used for defense by secreting a protective fluid."}],"priority":"★☆☆"},"related_words":{"derivatives":["siphunculus (synonym)","aphid","insect"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - a technical term used in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cornicle' is a specialized zoological term referring specifically to a pair of dorsal, tube-like structures found on the abdomen of aphids (plant lice). These structures, also known as siphunculi, are primarily involved in defense, secreting a waxy fluid that can deter predators. Due to its highly specific usage within entomology, it is not a word commonly encountered outside of scientific or technical contexts related to insect biology or pest management. Understanding the term requires a background knowledge of insect anatomy.","priority":"★☆☆"},"example_sentences":[{"sentence":"The length of the **cornicle** is an important taxonomic characteristic for identifying aphid species.","translation":"腹管の長さは、アブラムシの種を識別するための重要な分類学的特徴である。","type":"noun","meaning_category":"anatomical feature"},{"sentence":"When threatened, the aphid secreted a droplet of fluid from its **cornicle**.","translation":"脅かされると、アブラムシは腹管から液滴を分泌した。","type":"noun","meaning_category":"defense mechanism"}]}