{"word":"Momuses","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural of Momus) Referring to multiple instances of Momus, the Greek god of mockery and censure, or to individuals embodying his characteristics.","english_definition":"The plural form of Momus, referring either to multiple representations or instances of the Greek god of mockery, or to individuals who are habitually critical or fault-finding.","examples":[{"sentence":"The play featured several Momuses, each satirizing different aspects of society.","translation":"その劇には数人のモムスが登場し、それぞれが社会の異なる側面を風刺していた。"},{"sentence":"Beware of the Momuses in the art world, who are quick to dismiss anything new or unconventional.","translation":"美術界のモムスには注意が必要です。彼らは新しいものや型破りなものをすぐに否定します。"}],"collocations":["a gathering of Momuses","the spirit of Momuses","modern Momuses"],"synonyms":["critics","cynics","satirists","fault-finders","scoffers"],"antonyms":["admirers","supporters","approvers","laudators"]},{"part_of_speech":"proper noun","definition":"(rare) A name used to refer to a group, organization, or collective embodying the spirit of criticism or satire.","english_definition":"(rare) A name used to denote a group, organization, or collective that embodies the spirit of criticism, satire, or fault-finding.","examples":[{"sentence":"The Momuses were known for their scathing reviews of the latest theatrical productions.","translation":"モムスは最新の演劇作品に対する痛烈な批評で知られていた。"}],"collocations":["The Society of Momuses","The Momuses Collective"],"synonyms":["The Critics","The Satirists"],"antonyms":["The Appreciators","The Lauders"]}],"etymology":{"value":"Derived from 'Momus,' the name of the Greek god of satire, mockery, and censure. The plural form 'Momuses' simply indicates multiple instances of this figure or concept.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊməsɪz/","syllables":"Mo-mus-es"},"inflection":{"noun_plural":"Momuses"},"usage_notes":{"explanation":"'Momuses' is not a commonly used word. It is primarily the plural form of 'Momus,' which itself is relatively rare outside of literary or classical contexts. When used, it typically refers to multiple individuals who are highly critical or satirical, or to multiple representations of the Greek god Momus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Momuses is a group of critics.","correct":"✓ The Momuses are a group of critics.","note":"Since 'Momuses' is a plural noun, it requires a plural verb form ('are' instead of 'is')."},{"incorrect":"✗ He acted like a Momuses.","correct":"✓ He acted like a Momus.","note":"When referring to a single individual, use the singular form 'Momus,' not the plural 'Momuses'."}],"priority":"★★☆"},"related_words":{"derivatives":["Momus (singular form)","Momian (adjective, relating to Momus or his characteristics)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Momuses' is a rare and specialized term, primarily encountered in literary or academic contexts when discussing satire, criticism, or classical mythology. Its usage assumes familiarity with the figure of Momus from Greek mythology and an understanding of the concept of satire and critical analysis. The word is unlikely to be encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The panel of judges seemed more like a gathering of Momuses than a group of appreciators.","translation":"審査員団は、感謝する人々の集まりというよりも、モムスの集まりのように見えた。","type":"noun","meaning_category":"critics"},{"sentence":"The Momuses of the literary world often clashed with the more experimental authors.","translation":"文学界のモムスは、より実験的な作家としばしば衝突した。","type":"noun","meaning_category":"satirists"},{"sentence":"The satirical magazine was staffed by a team of modern Momuses.","translation":"その風刺雑誌には、現代のモムスの一団がスタッフとして配置されていた。","type":"noun","meaning_category":"critics"}]}