{"word":"crenation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(細胞生物学) (特に赤血球の)縮み、縁がギザギザになること","english_definition":"The formation of abnormal notched or scalloped surfaces on cells, especially erythrocytes, due to shrinkage.","examples":[{"sentence":"Crenation of red blood cells can be caused by hypertonic solutions.","translation":"赤血球の縮みは、高張液によって引き起こされることがある。"}],"collocations":["erythrocyte crenation","red blood cell crenation"],"synonyms":["echinocytosis"],"antonyms":["swelling","lysis"]},{"part_of_speech":"noun","definition":"(建築) 鋸歯状の胸壁、銃眼付き胸壁","english_definition":"A series of indentations or embrasures along the top of a wall, typically a battlement.","examples":[{"sentence":"The castle wall was topped with crenation for defensive purposes.","translation":"城壁の上部は、防御のために鋸歯状の胸壁で覆われていた。"}],"collocations":["castle crenation","battlement crenation"],"synonyms":["battlement","embrasure","merlon","copen"],"antonyms":[]}],"etymology":{"value":"From Latin 'crena' (notch, indentation) + '-ation'.","priority":"★★☆"},"pronunciation":{"ipa":"/kriːˈneɪʃən/","syllables":"cre-na-tion"},"inflection":{"noun_plural":"crenations"},"usage_notes":{"explanation":"'Crenation' has two main meanings. In cell biology, it refers to the shrinking and notched appearance of cells, particularly red blood cells, when exposed to hypertonic solutions. In architecture, it describes the notched or indented pattern along the top of a wall, often seen in battlements of castles or fortifications. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crenation was caused by hypotonic solution.","correct":"✓ The crenation was caused by hypertonic solution.","note":"Crenation in cells is caused by hypertonic solutions (higher concentration of solutes outside the cell), not hypotonic solutions (lower concentration of solutes outside the cell)."},{"incorrect":"✗ The castle had a smooth wall instead of crenation.","correct":"✓ The castle had a smooth wall instead of a battlement.","note":"While 'crenation' refers to the notched pattern, 'battlement' refers to the entire structure with the crenations. Using 'battlement' is more natural in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["crenate (adjective: having rounded teeth or scalloped edge)","crenel (noun: a loophole in a battlement)","crenellation (noun: the act of providing with battlements)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'crenation' is a technical term used in two main fields: cell biology and architecture. In cell biology, it describes the process where a cell, especially a red blood cell, shrinks and develops a notched or scalloped surface due to being in a hypertonic environment. In architecture, it refers to the notched or indented pattern along the top of a wall, commonly seen in castle battlements. Understanding the context is crucial to correctly interpret the meaning of 'crenation'."},"example_sentences":[{"sentence":"The pathologist observed crenation in the blood sample under the microscope.","translation":"病理医は顕微鏡下で血液サンプルに縮みが見られることを観察した。","type":"noun","meaning_category":"Cell Biology"},{"sentence":"The crenation on the castle walls provided cover for the archers.","translation":"城壁の鋸歯状の胸壁は、射手に隠れる場所を提供した。","type":"noun","meaning_category":"Architecture"}]}