{"word":"icon-destroying","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"偶像破壊的な、既存の権威や伝統を打ち破る","english_definition":"Challenging or rejecting traditional beliefs, values, or practices; subversive.","examples":[{"sentence":"The band's music was icon-destroying, pushing the boundaries of genre and taste.","translation":"そのバンドの音楽は偶像破壊的で、ジャンルと趣味の境界線を押し広げた。"},{"sentence":"Her icon-destroying approach to management ruffled feathers, but ultimately led to innovation.","translation":"彼女の偶像破壊的な経営手法は反感を買ったが、最終的には革新につながった。"},{"sentence":"The artist is known for his icon-destroying works that challenge societal norms.","translation":"そのアーティストは、社会規範に挑戦する偶像破壊的な作品で知られている。"}],"collocations":["icon-destroying art","icon-destroying ideas","icon-destroying behavior","icon-destroying approach","icon-destroying figure"],"synonyms":["rebellious","subversive","radical","unconventional","revolutionary","heretical"],"antonyms":["conventional","traditional","orthodox","conservative"]}],"etymology":{"value":"The term is a combination of 'icon' (a representation of something sacred or revered, or a symbol) and 'destroying' (the act of ruining or obliterating). It describes something that attacks or undermines established symbols, beliefs, or institutions.","priority":"N/A"},"pronunciation":{"ipa":"/ˌaɪkɒn dɪˈstrɔɪɪŋ/","syllables":"i-con-de-stroy-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"'Icon-destroying' is typically used to describe something that actively challenges or subverts established norms, beliefs, or authorities. It often carries a connotation of being rebellious or unconventional. The term is more often used figuratively than literally, referring to the destruction of ideas or systems rather than physical icons.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The icon-destroying building was demolished.","correct":"✓ The iconic building was demolished.","note":"'Icon-destroying' refers to something that challenges icons, not a building that is an icon. Use 'iconic' to describe a building that is a widely recognized symbol."}],"priority":"N/A"},"related_words":{"derivatives":["iconoclast (noun: a person who attacks cherished beliefs or institutions)","iconoclasm (noun: the action of attacking cherished beliefs or institutions)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Icon-destroying' is a more advanced term used to describe something that challenges or rejects established norms, beliefs, or authorities. It's not a common word, but it's useful for describing art, ideas, or behaviors that are deliberately unconventional or rebellious. It implies a deliberate attempt to overturn or undermine what is traditionally accepted.","priority":"N/A"},"example_sentences":[{"sentence":"The comedian's icon-destroying jokes often pushed the audience's comfort levels.","translation":"そのコメディアンの偶像破壊的なジョークは、しばしば聴衆の快適レベルを押し上げた。","type":"adjective","meaning_category":"Challenging norms"},{"sentence":"The startup's icon-destroying business model disrupted the entire industry.","translation":"そのスタートアップ企業の偶像破壊的なビジネスモデルは、業界全体を混乱させた。","type":"adjective","meaning_category":"Rejecting tradition"}]}