{"word":"non-distributed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"分散されていない、非分散型の","english_definition":"Not distributed; not spread out or shared among multiple locations or entities.","examples":[{"sentence":"The application uses a non-distributed database, which is stored on a single server.","translation":"そのアプリケーションは、単一のサーバーに保存されている非分散型データベースを使用しています。"},{"sentence":"A non-distributed system can be simpler to manage than a distributed one.","translation":"非分散型システムは、分散型システムよりも管理が簡単な場合があります。"},{"sentence":"The company opted for a non-distributed workforce, requiring all employees to work in the same office.","translation":"会社は非分散型の労働力を選択し、すべての従業員が同じオフィスで働くことを義務付けました。"}],"collocations":["non-distributed database","non-distributed system","non-distributed architecture","non-distributed workforce"],"synonyms":["centralized","localized","undistributed","consolidated"],"antonyms":["distributed","decentralized","partitioned"],"notes":"Often used in the context of computing, systems, or resources."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'distributed'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn dɪˈstrɪbjʊtɪd/","syllables":"non-dis-trib-u-ted"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'non-distributed' is used to describe something that is not spread out or shared among multiple locations or entities. It is often used in contrast to 'distributed' systems, where resources or data are spread across multiple nodes or locations. A non-distributed system is typically centralized and managed from a single point.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is non distributed across the servers.","correct":"✓ The data is not distributed across the servers. / ✓ The data is stored in a non-distributed database.","note":"'Non-distributed' typically modifies a noun, such as 'database' or 'system'. Using 'non distributed' as a verb phrase is grammatically incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["distribution","distribute","distributed"],"related_terms":["centralized","localized","undistributed","consolidated"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Non-distributed' describes something that isn't spread across multiple locations or entities. It's the opposite of 'distributed' and is often used in technical contexts, like discussing computer systems or databases. If something is non-distributed, it's usually kept in one central place."},"example_sentences":[{"sentence":"The legacy system relies on a non-distributed file system, making access slower for remote users.","translation":"レガシーシステムは非分散型ファイルシステムに依存しているため、リモートユーザーのアクセスが遅くなります。","type":"adjective","meaning_category":"Not distributed"},{"sentence":"The company decided to maintain a non-distributed ledger for internal transactions.","translation":"会社は内部取引のために非分散型台帳を維持することにしました。","type":"adjective","meaning_category":"Not distributed"},{"sentence":"A non-distributed control system was chosen for its simplicity and ease of maintenance.","translation":"そのシンプルさとメンテナンスの容易さから、非分散型制御システムが選択されました。","type":"adjective","meaning_category":"Not distributed"}]}