{"word":"Pegasean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ペーガソス（ペガスス）の、ペーガソス（ペガスス）のような","english_definition":"Of or relating to Pegasus; resembling Pegasus, especially in being winged or soaring.","examples":[{"sentence":"The poet's imagination took a Pegasean flight.","translation":"詩人の想像力はペーガソスのように空高く舞い上がった。"},{"sentence":"The artwork depicted a Pegasean horse with magnificent wings.","translation":"そのアート作品は、壮大な翼を持つペーガソスのような馬を描いていた。"}],"collocations":["Pegasean flight","Pegasean steed","Pegasean inspiration"],"synonyms":["winged","soaring","lofty","inspired","poetic"],"antonyms":["earthbound","mundane","prosaic"]}],"etymology":{"value":"From Pegasus, the winged horse in Greek mythology, + -ean (suffix denoting relation or resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/pɛɡəˈsiːən/","syllables":"Pe-ga-se-an"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Pegasean' is a relatively rare word, primarily used in literary or artistic contexts to evoke the imagery of Pegasus, the winged horse from Greek mythology. It often suggests something that is soaring, inspired, or poetic. It's not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car had a Pegasean engine.","correct":"✓ The car had a powerful engine.","note":"'Pegasean' is not typically used to describe the power or speed of an engine; it's more related to imaginative or artistic qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pegasus (noun): The winged horse in Greek mythology."],"related_concepts":["Greek mythology","winged horse","inspiration","poetry","art"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pegasean' is a sophisticated word that is rarely used in common speech. It is most often found in literature, poetry, or discussions of mythology and art. Understanding the reference to Pegasus is essential to grasping the word's meaning. It implies a sense of soaring imagination or artistic inspiration. Due to its rarity and specialized context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The composer's music had a truly Pegasean quality, lifting the listener to ethereal heights.","translation":"作曲家の音楽は真にペーガソスのような性質を持ち、聴き手を天空の高さへと引き上げた。","type":"adjective","meaning_category":"Inspired/Soaring"},{"sentence":"The artist's vision was Pegasean, transforming ordinary landscapes into scenes of mythical beauty.","translation":"芸術家のビジョンはペーガソスのように高く、平凡な風景を神話的な美しさの場面へと変えた。","type":"adjective","meaning_category":"Imaginative/Artistic"}]}