{"word":"pre-enrollment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"事前登録、事前登録期間","english_definition":"The process of registering or enrolling in something (such as a course, program, or service) before the official or general enrollment period.","examples":[{"sentence":"Pre-enrollment for the summer program begins next week.","translation":"夏期プログラムの事前登録は来週から始まります。"},{"sentence":"Students are encouraged to take advantage of pre-enrollment to secure their preferred classes.","translation":"学生は、希望する授業を確保するために、事前登録を利用することが推奨されています。"},{"sentence":"The pre-enrollment system allows us to better plan for staffing and resources.","translation":"事前登録システムにより、人員配置とリソースの計画をより適切に立てることができます。"}],"collocations":["early pre-enrollment","online pre-enrollment","pre-enrollment period","pre-enrollment form","pre-enrollment process","pre-enrollment deadline"],"synonyms":["early registration","advance enrollment","priority registration"],"antonyms":["late enrollment","open enrollment","general enrollment"]}],"etymology":{"value":"The word is formed by combining the prefix 'pre-' (meaning 'before') with the noun 'enrollment' (the act of officially registering or joining).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪnˈroʊlmənt/","syllables":"pre-en-roll-ment"},"inflection":{"noun_plural":"pre-enrollments"},"usage_notes":{"explanation":"'Pre-enrollment' refers to the period or process before the regular enrollment period. It often provides advantages such as priority in selecting courses or programs. It is commonly used in academic settings (schools, universities), but can also apply to other contexts like healthcare, membership programs, or events.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I pre-enrolled to the class.","correct":"✓ I pre-enrolled in the class. / ✓ I completed pre-enrollment for the class.","note":"When using 'pre-enroll' as a verb, it's usually followed by 'in'. When referring to the process, use 'pre-enrollment' as a noun."},{"incorrect":"✗ The pre-enrollment are open.","correct":"✓ The pre-enrollment is open.","note":"'Pre-enrollment' is generally treated as a singular noun referring to the overall process or period, even though it involves multiple people enrolling."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-enroll (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (education, healthcare).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'pre-enrollment' is a compound word that is relatively straightforward to understand. It combines 'pre-' (meaning 'before') with 'enrollment' (the act of registering). It is most commonly used in academic or institutional contexts to describe the process of signing up for something in advance of the general public or a specific deadline. While not a highly frequent word, its meaning is easily grasped from its components."},"example_sentences":[{"sentence":"The university offers a pre-enrollment discount to students who register early.","translation":"大学は早期登録する学生に事前登録割引を提供しています。","type":"noun","meaning_category":"事前登録"},{"sentence":"Make sure to complete your pre-enrollment paperwork before the deadline.","translation":"締め切り前に必ず事前登録の書類を完了させてください。","type":"noun","meaning_category":"事前登録"},{"sentence":"Many popular courses fill up during the pre-enrollment period.","translation":"多くの人気のあるコースは事前登録期間中に埋まってしまいます。","type":"noun","meaning_category":"事前登録期間"}]}