{"word":"polyspermic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多精子の、多精受精の","english_definition":"Relating to or characterized by polyspermy (the fertilization of an egg by more than one sperm).","examples":[{"sentence":"The egg was polyspermic, resulting in abnormal development.","translation":"その卵子は多精受精しており、異常な発達を引き起こした。"},{"sentence":"Polyspermic fertilization is usually prevented by mechanisms in the egg.","translation":"多精受精は通常、卵子のメカニズムによって防止される。"}],"collocations":["polyspermic egg (多精受精卵)","polyspermic fertilization (多精受精)"],"synonyms":["multi-fertilized"],"antonyms":["monospermic"]},{"part_of_speech":"noun","definition":"多精子生物","english_definition":"An organism or cell that has undergone polyspermy.","examples":[{"sentence":"The polyspermic cell was not viable.","translation":"その多精子細胞は生存不可能だった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From poly- (many) + sperm + -ic (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈspɜːrmɪk/","syllables":"pol-y-sper-mic"},"inflection":{"notes":"Adjective: Comparative - more polyspermic, Superlative - most polyspermic. Noun: Plural - polyspermics"},"usage_notes":{"explanation":"'Polyspermic' refers to the condition or state of an egg being fertilized by more than one sperm. This is generally an abnormal condition in most animals, including humans, and mechanisms exist to prevent it. The term is primarily used in biological and medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sperm was polyspermic.","correct":"✓ The egg was polyspermic.","note":"'Polyspermic' describes the egg, not the sperm. The sperm count might be high, but 'polyspermic' refers to the egg's state after multiple sperm have entered."}],"priority":"★★☆"},"related_words":{"derivatives":["polyspermy (noun: 多精受精)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyspermic' is a technical term used in biology and medicine to describe an egg that has been fertilized by more than one sperm. This is typically an abnormal condition that can lead to developmental issues. The word is derived from 'poly-' (meaning many) and 'spermic' (relating to sperm). Its usage is largely confined to scientific discussions and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The researchers observed polyspermic fertilization in the in vitro experiment.","translation":"研究者たちは、試験管内実験で多精受精を観察した。","type":"adjective","meaning_category":"多精子の"},{"sentence":"The resulting zygote was considered polyspermic and therefore non-viable.","translation":"結果として生じた接合子は多精子であると見なされ、したがって生存不可能であった。","type":"adjective","meaning_category":"多精子の"}]}