{"word":"Circumcellion","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"（古代ローマ時代のアフリカ北部における）ドナトゥス派の過激な農民反乱者","english_definition":"A member of a fanatical, revolutionary sect of Donatist Christians in North Africa during the 4th and 5th centuries AD, who engaged in violence and acts of martyrdom.","examples":[{"sentence":"The Circumcellions were known for their violent attacks on Roman officials and Catholic clergy.","translation":"周旋士（キルクムケリオン）は、ローマの役人やカトリックの聖職者に対する暴力的な攻撃で知られていた。"}],"collocations":["Circumcellion uprising","Circumcellion violence","Donatist Circumcellions"],"synonyms":["Donatist rebel","religious fanatic"],"antonyms":[]}],"etymology":{"value":"ラテン語の *circum cellas vagantes*（小屋の周りをうろつく者たち）に由来する。これは彼らが農村部を放浪し、農民の小屋（cellae）の周りで活動していたことに由来する。","priority":"中"},"pronunciation":{"ipa":"/ˌsɜːrkəmˈsɛliən/","syllables":"cir-cum-cel-li-on"},"inflection":{"noun_plural":"Circumcellions"},"usage_notes":{"explanation":"Circumcellionsは、4世紀から5世紀にかけて北アフリカで活動したドナトゥス派の過激派の一員でした。彼らは、ドナトゥス派の教義を支持し、カトリック教会やローマ当局に対して暴力的な行動を取りました。彼らは殉教を求め、しばしば自殺行為に及んだり、他者に殺害を求めたりしました。彼らの行動は、当時の社会に大きな混乱をもたらしました。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The Circumcellion was a peaceful monk.","correct":"✓ The Circumcellion was a violent rebel.","note":"Circumcellionsは暴力的な反乱者であり、平和的な人物ではありませんでした。"},{"incorrect":"✗ Circumcellions were part of the Catholic Church.","correct":"✓ Circumcellions were part of the Donatist sect.","note":"Circumcellionsはカトリック教会ではなく、ドナトゥス派に属していました。"}],"priority":"低"},"related_words":{"derivatives":["Circumcellionic (形容詞: 周旋士（キルクムケリオン）の、周旋士（キルクムケリオン）に関する)"],"phrasal_verbs":[],"related_terms":["Donatism","Donatus Magnus","North Africa","Roman Empire","religious rebellion","martyrdom"]},"level_frequency":{"frequency_google_ngram":"非常に低い頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"The term 'Circumcellion' refers to a very specific historical group, making it unlikely to appear in general texts. Understanding requires knowledge of late Roman history, religious schisms, and the Donatist movement. Due to its specialized nature, it is primarily encountered in academic or historical contexts.","priority":"低"},"example_sentences":[{"sentence":"Historical accounts describe the Circumcellions as roaming the countryside and inciting violence.","translation":"歴史的な記録は、周旋士（キルクムケリオン）が田舎を歩き回り、暴力を扇動していたと記述している。"},{"sentence":"The Circumcellions' acts of martyrdom were seen as a way to achieve immediate salvation.","translation":"周旋士（キルクムケリオン）の殉教行為は、即座の救済を達成する方法と見なされていた。"},{"sentence":"The Roman authorities struggled to suppress the Circumcellion uprisings in North Africa.","translation":"ローマ当局は、北アフリカにおける周旋士（キルクムケリオン）の反乱を鎮圧するのに苦労した。"}]}