{"word":"metalogic","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メタ論理学：論理学の性質、構造、および使用法を研究する論理学の一分野","english_definition":"The branch of logic that studies the properties, structure, and uses of logic itself.","examples":[{"sentence":"Metalogic provides the framework for understanding the limits and capabilities of formal systems.","translation":"メタ論理学は、形式体系の限界と能力を理解するための枠組みを提供する。"},{"sentence":"Gödel's incompleteness theorems are central results in metalogic.","translation":"ゲーデルの不完全性定理は、メタ論理学における中心的な結果である。"}],"collocations":["study of metalogic","principles of metalogic","theorems in metalogic"],"synonyms":["proof theory","model theory","recursion theory"],"antonyms":[]}],"etymology":{"value":"接頭辞 'meta-' (～について) と 'logic' (論理学) の組み合わせ。論理学「について」の学問、つまり論理学自体の性質や構造を研究する分野であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈlɒdʒɪk/","syllables":"me-ta-lo-gic"},"inflection":{"noun_plural":"metalogics"},"usage_notes":{"explanation":"Metalogic is a branch of logic that investigates the properties and syntax of formal systems. It's used to establish the consistency, completeness, and decidability of logical systems. It is a more abstract and theoretical field than standard logic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Metalogic is the same as logic.","correct":"✓ Metalogic studies logic.","note":"Metalogic is not the same as logic; it is the study *of* logic."},{"incorrect":"✗ Metalogic is only useful for philosophers.","correct":"✓ Metalogic is useful for computer scientists, mathematicians, and philosophers.","note":"Metalogic has applications in various fields, including computer science and mathematics."}],"priority":"★★☆"},"related_words":{"derivatives":["metalogical (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Metalogic is a highly specialized field of study within logic that examines the properties and structure of logical systems themselves. It's a theoretical area that requires a strong understanding of formal logic and mathematical concepts. It is not typically encountered outside of advanced academic settings. Understanding metalogic requires familiarity with concepts like completeness, consistency, and decidability.","priority":"★★☆"},"example_sentences":[{"sentence":"The study of metalogic is essential for understanding the foundations of mathematics.","translation":"メタ論理学の研究は、数学の基礎を理解するために不可欠である。","type":"general","meaning_category":"study"},{"sentence":"Model theory is a key component of metalogic.","translation":"モデル理論は、メタ論理学の重要な構成要素である。","type":"specific","meaning_category":"component"},{"sentence":"Metalogic helps us understand the limitations of formal systems.","translation":"メタ論理学は、形式体系の限界を理解するのに役立つ。","type":"general","meaning_category":"understanding"}]}