{"word":"Hecklers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 聴衆からのヤジや妨害をする人たち","english_definition":"People who interrupt or harass speakers or performers with rude or challenging remarks.","examples":[{"sentence":"The comedian struggled to perform as the hecklers grew louder.","translation":"コメディアンは、ヤジが大きくなるにつれて、パフォーマンスに苦労した。"},{"sentence":"Security removed several hecklers from the political rally.","translation":"警備員は政治集会から数人のヤジを飛ばす人を排除した。"},{"sentence":"The speaker ignored the hecklers and continued with their presentation.","translation":"講演者はヤジを無視し、プレゼンテーションを続けた。"}],"collocations":["deal with hecklers","ignore hecklers","remove hecklers","silence hecklers"],"synonyms":["disruptors","interrupters","troublemakers","agitators","protesters"],"antonyms":["supporters","fans","admirers","followers"]}],"etymology":{"value":"The term 'heckler' comes from the textile industry, referring to a person who used a 'heckle' (a comb-like tool) to tease out flax or hemp fibers. Metaphorically, it came to mean someone who 'teases' or harasses a speaker with questions or comments.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛklərz/","syllables":"heck-lers"},"inflection":{"noun_plural":"Hecklers"},"usage_notes":{"explanation":"'Hecklers' refers specifically to individuals who intentionally disrupt public events, performances, or speeches with the aim of provoking a reaction or undermining the speaker. The term carries a negative connotation, implying disruptive and disrespectful behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hecklers was very loud.","correct":"✓ The hecklers were very loud.","note":"'Hecklers' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ He is a heckler and hecklers.","correct":"✓ He is one of the hecklers.","note":"When referring to someone as part of a group of hecklers, use 'one of the hecklers' rather than repeating the plural noun."}],"priority":"★★☆"},"related_words":{"derivatives":["heckle (verb: to interrupt or harass with rude remarks)","heckling (noun: the act of heckling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understood in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hecklers' are people who try to bother or upset speakers or performers by shouting rude things or asking difficult questions. This word is often used when talking about political events, comedy shows, or public speeches where someone might try to disrupt the event. It's important to remember that 'hecklers' are usually trying to cause trouble or get a reaction."},"example_sentences":[{"sentence":"The politician paused as the hecklers shouted their disapproval.","translation":"政治家は、ヤジが不満を叫ぶと一時停止した。","type":"noun","meaning_category":"disruptors"},{"sentence":"Despite the hecklers, the band played a great show.","translation":"ヤジにもかかわらず、バンドは素晴らしいショーを演奏した。","type":"noun","meaning_category":"disruptors"},{"sentence":"The moderator struggled to control the hecklers in the audience.","translation":"司会者は聴衆の中のヤジを制御するのに苦労した。","type":"noun","meaning_category":"disruptors"}]}