{"word":"Prelatism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聖職者支配主義、高位聖職者制度","english_definition":"Belief in or advocacy of government by prelates (high-ranking clergy).","examples":[{"sentence":"The Reformation challenged prelatism and advocated for a more egalitarian church structure.","translation":"宗教改革は聖職者支配主義に異議を唱え、より平等な教会構造を提唱した。"},{"sentence":"Historically, prelatism has been associated with hierarchical power structures within the church.","translation":"歴史的に、聖職者支配主義は教会内の階層的な権力構造と関連付けられてきた。"}],"collocations":["oppose prelatism","support prelatism","abolish prelatism"],"synonyms":["hierocracy","ecclesiocracy"],"antonyms":["congregationalism","lay governance"]}],"etymology":{"value":"From 'prelate' (a high-ranking member of the clergy) + '-ism' (a suffix denoting a belief, principle, or system).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɛlətɪzəm/","syllables":"prel-a-tism"},"inflection":{"noun_plural":"prelatisms"},"usage_notes":{"explanation":"'Prelatism' refers to the belief in or support for a system of church governance where high-ranking clergy (prelates) hold significant authority. It often implies a hierarchical structure with power concentrated at the top. The term can be used neutrally, but it often carries a critical connotation, particularly when discussing church reform or egalitarianism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prelatism was a person.","correct":"✓ Prelatism is a system.","note":"Prelatism is a system or belief, not a person."}],"priority":"★★☆"},"related_words":{"derivatives":["prelate","prelatical"],"related_terms":["episcopacy","papism"]},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized term in religious studies and history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prelatism' is a specialized term related to church governance. It describes a system where high-ranking clergy members, known as prelates, hold significant power and authority. This term is often used in discussions about church history, religious reform movements, and debates about hierarchical versus egalitarian church structures. Understanding this term requires familiarity with religious and historical contexts."},"example_sentences":[{"sentence":"The rise of prelatism in the medieval church led to widespread criticism and calls for reform.","translation":"中世教会における聖職者支配主義の台頭は、広範な批判と改革の要求につながった。","type":"general"},{"sentence":"Some argue that prelatism is necessary for maintaining order and tradition within the church.","translation":"聖職者支配主義は、教会内の秩序と伝統を維持するために必要であると主張する人もいる。","type":"argumentative"}]}