{"word":"thin-set","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)薄塗りモルタル、タイル接着用モルタル","english_definition":"A type of mortar used to adhere tiles to a substrate. It is applied in a thin layer.","examples":[{"sentence":"He used thin-set to install the ceramic tiles on the bathroom floor.","translation":"彼は浴室の床にセラミックタイルを設置するために薄塗りモルタルを使った。"},{"sentence":"Make sure to choose the right type of thin-set for the type of tile you are using.","translation":"使用するタイルの種類に適した薄塗りモルタルを選ぶようにしてください。"}],"collocations":["apply thin-set","mix thin-set","thin-set mortar","polymer-modified thin-set"],"synonyms":["mortar","tile adhesive","tile mortar","setting bed"],"antonyms":[]},{"part_of_speech":"adjective","definition":"薄塗りモルタルで設置された、薄塗りモルタル用の","english_definition":"Relating to or installed with thin-set mortar.","examples":[{"sentence":"The thin-set installation provides a strong bond between the tile and the subfloor.","translation":"薄塗りモルタルによる設置は、タイルと下地床の間に強力な接着を提供します。"},{"sentence":"This trowel is specifically designed for thin-set applications.","translation":"このコテは、薄塗りモルタルの用途のために特別に設計されています。"}],"collocations":["thin-set installation","thin-set application","thin-set trowel"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the fact that the mortar is applied in a thin layer compared to traditional mortar beds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɪnˌsɛt/","syllables":"thin-set"},"inflection":{"noun_plural":"thin-sets"},"usage_notes":{"explanation":"\"Thin-set\" is primarily used in the context of tile installation. It is a specific type of mortar designed to be applied in a thin layer, usually less than 3/16 inch thick. It provides a strong bond between the tile and the substrate (such as concrete, plywood, or cement board). Different types of thin-set are available for different types of tiles (e.g., ceramic, porcelain, stone) and different applications (e.g., floors, walls, wet areas).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used grout instead of thin-set to install the tiles.","correct":"✓ I used thin-set to install the tiles.","note":"Grout is used to fill the gaps between tiles, while thin-set is used to adhere the tiles to the substrate."},{"incorrect":"✗ You can use any type of thin-set for any type of tile.","correct":"✓ You need to choose the right type of thin-set for the type of tile you are using.","note":"Different types of thin-set are designed for different types of tiles and applications."}],"priority":"★★☆"},"related_words":{"derivatives":["thin-setting (gerund or present participle)"],"phrasal_verbs":[],"related_terms":["grout","tile","mortar","substrate","trowel","cement board","backer board"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized vocabulary related to construction.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Thin-set\" is a specialized term used in construction, specifically in tile installation. It refers to a type of mortar that is applied in a thin layer to adhere tiles to a substrate. Understanding this term requires some familiarity with construction processes and materials. The term is not commonly used outside of this specific context."},"example_sentences":[{"sentence":"Apply the thin-set evenly to the back of the tile.","translation":"タイルの裏側に薄塗りモルタルを均等に塗布してください。","type":"noun","meaning_category":"建築材料"},{"sentence":"A notched trowel helps to spread the thin-set to the correct thickness.","translation":"ノッチ付きコテは、薄塗りモルタルを適切な厚さに広げるのに役立ちます。","type":"noun","meaning_category":"建築材料"},{"sentence":"Make sure the surface is clean before applying the thin-set.","translation":"薄塗りモルタルを塗布する前に、表面がきれいであることを確認してください。","type":"noun","meaning_category":"建築材料"},{"sentence":"Polymer-modified thin-set is often used for porcelain tiles.","translation":"ポリマー変性薄塗りモルタルは、磁器タイルによく使用されます。","type":"noun","meaning_category":"建築材料"}]}