{"word":"Tenors","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テノール歌手たち、テノール声域の人々","english_definition":"plural of tenor: adult male singing voice between baritone and alto; a singer with such a voice; a musical instrument with a range similar to a tenor voice; a part in a musical composition written for a tenor voice or instrument.","examples":[{"sentence":"The choir was composed of sopranos, altos, tenors, and basses.","translation":"合唱団はソプラノ、アルト、テノール、バスで構成されていた。"},{"sentence":"The tenors sang their part with great passion.","translation":"テノール歌手たちは情熱的に自分たちのパートを歌った。"}],"collocations":["male tenors","operatic tenors","classical tenors","singing tenors"],"synonyms":["male singers","vocalists","soloists"],"antonyms":["sopranos","altos","basses"]}],"etymology":{"value":"From the word 'tenor', which comes from Middle English, from Old French 'tenor', from Latin 'tenor' ('a holding, uninterrupted course, manner, character'), from 'tenere' ('to hold, keep, maintain').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛnərz/","syllables":"Ten-ors"},"inflection":{"noun_plural":"Tenors"},"usage_notes":{"explanation":"'Tenors' is simply the plural form of 'tenor'. It refers to multiple singers with a tenor vocal range, or multiple instruments with a tenor range. It can also refer to the section of a choir or musical ensemble comprised of tenor singers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tenors was singing loudly.","correct":"✓ The tenors were singing loudly.","note":"Since 'tenors' is plural, use the plural form of the verb 'to be': 'were'."},{"incorrect":"✗ He is one of the tenor in the choir.","correct":"✓ He is one of the tenors in the choir.","note":"When referring to one person among multiple tenors, use the plural form 'tenors'."}],"priority":"★★☆"},"related_words":{"derivatives":["tenor","tenore","tenorist"],"phrases":["tenor clef","tenor saxophone","tenor banjo"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Tenors' is the plural form of 'tenor', referring to multiple male singers with a specific vocal range. Understanding this word requires some familiarity with musical terminology, specifically the different vocal ranges in choral music. The word is not commonly used in everyday conversation but is more likely to appear in contexts related to music, opera, or choral performances."},"example_sentences":[{"sentence":"The competition featured several promising young tenors.","translation":"そのコンクールには将来有望な若いテノール歌手が何人も出場した。","type":"noun","meaning_category":"plural of tenor"},{"sentence":"The tenors' harmonies filled the concert hall.","translation":"テノール歌手たちのハーモニーがコンサートホールに響き渡った。","type":"noun","meaning_category":"plural of tenor"},{"sentence":"The section of tenors in the choir was particularly strong.","translation":"合唱団のテノールパートは特に力強かった。","type":"noun","meaning_category":"plural of tenor"}]}