{"word":"abulia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"意欲欠如、無為症","english_definition":"A lack of motivation or ability to act or make decisions. It is a severe reduction in the ability to initiate and persist in goal-directed behavior.","examples":[{"sentence":"Abulia is a common symptom of frontal lobe damage.","translation":"意欲欠如は前頭葉損傷の一般的な症状です。"},{"sentence":"The patient exhibited abulia, showing little interest in daily activities.","translation":"患者は意欲欠如を示し、日常生活にほとんど関心を示さなかった。"}],"collocations":["exhibit abulia","suffer from abulia","severe abulia","mild abulia"],"synonyms":["apathy","lack of motivation","indecisiveness","inertia","listlessness"],"antonyms":["motivation","initiative","drive","determination"]}],"etymology":{"value":"From Greek ἀβουλία (aboulia), from ἀ- (a-, “not”) + βουλή (boulē, “will, counsel, deliberation”).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbuːliə/","syllables":"a-bu-li-a"},"inflection":{"noun_plural":"abulias"},"usage_notes":{"explanation":"Abulia is a neuropsychiatric syndrome characterized by a loss of motivation and a decrease in goal-directed behavior. It is often associated with damage to the frontal lobes of the brain. It is distinct from depression, although both conditions can involve a lack of motivation. In abulia, the lack of motivation is more profound and is not necessarily accompanied by sadness or hopelessness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was abulia about going to work.","correct":"✓ He exhibited abulia regarding going to work. / ✓ He had abulia regarding going to work.","note":"Abulia is a noun, not an adjective. Use phrases like 'exhibit abulia' or 'have abulia' to describe someone experiencing it."},{"incorrect":"✗ Abulia is just laziness.","correct":"✓ Abulia is a neurological condition that causes a lack of motivation, distinct from laziness.","note":"Abulia is a clinical condition with neurological underpinnings, unlike laziness, which is a behavioral trait."}],"priority":"★★☆"},"related_words":{"derivatives":["abulic (adjective)"],"related_medical_terms":["apathy","akinetic mutism","depression","frontal lobe syndrome"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Abulia' is a specialized term used in neurology and psychiatry to describe a severe lack of motivation and difficulty in initiating and carrying out goal-directed behaviors. It's important to understand that abulia is a clinical condition, often linked to specific brain damage or neurological disorders, and is distinct from simple laziness or lack of interest. The term is primarily used in medical and psychological contexts."},"example_sentences":[{"sentence":"The stroke left him with significant abulia, making it difficult for him to start any task.","translation":"脳卒中の後、彼は重度の意欲欠如に陥り、どんなタスクも始めるのが困難になった。","type":"general","meaning_category":"general"},{"sentence":"Abulia can be a debilitating symptom of Huntington's disease.","translation":"意欲欠如はハンチントン病の衰弱性の症状となりうる。","type":"medical","meaning_category":"medical"},{"sentence":"The psychiatrist noted the patient's abulia and recommended further neurological testing.","translation":"精神科医は患者の意欲欠如に注目し、さらなる神経学的検査を勧めた。","type":"medical","meaning_category":"medical"}]}