{"word":"fixage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)定着液、定着剤","english_definition":"A solution used in photography to make the image stable and insensitive to light.","examples":[{"sentence":"The photographer carefully poured the fixage over the developed film.","translation":"写真家は現像されたフィルムに注意深く定着液を注いだ。"},{"sentence":"Proper use of fixage is crucial for archival quality prints.","translation":"アーカイブ品質のプリントには、定着液の適切な使用が不可欠である。"}],"collocations":["acid fixage","rapid fixage","fixage bath","fresh fixage","used fixage"],"synonyms":["fixer","hypo","fixing solution","stabilizer"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'fix' (to make stable or permanent) and the suffix '-age' (denoting a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪksɪdʒ/","syllables":"fix-age"},"inflection":{"noun_plural":"fixages"},"usage_notes":{"explanation":"'Fixage' specifically refers to the chemical solution used in photographic processing to remove undeveloped silver halide crystals from the film or paper, thus making the image permanent and insensitive to further exposure to light. While 'fixer' is a more common term, 'fixage' is still used, particularly in technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used fixage to develop the film.","correct":"✓ I used developer to develop the film, then fixage to stabilize it.","note":"Fixage is used after the developer to stabilize the image, not to initially develop it."}],"priority":"★☆☆"},"related_words":{"derivatives":["fix (verb)","fixer (noun)","fixing (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fixage' is a technical term used in photography, specifically referring to the chemical solution that stabilizes the developed image. It's not commonly used in everyday language. Understanding its function requires familiarity with photographic processes.","priority":"★☆☆"},"example_sentences":[{"sentence":"The darkroom smelled strongly of fixage and other chemicals.","translation":"暗室は定着液や他の化学薬品の強い匂いがした。","type":"noun","meaning_category":"定着液"},{"sentence":"After the fixage, the negatives were washed and dried.","translation":"定着液処理後、ネガは洗浄され乾燥された。","type":"noun","meaning_category":"定着液"}]}