{"word":"indicans","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"インジカン (尿中に排泄されるインドールの硫酸エステル)","english_definition":"Salts of indoxyl sulfuric acid excreted in the urine.","examples":[{"sentence":"High levels of indicans in the urine may indicate intestinal bacterial overgrowth.","translation":"尿中のインジカン値が高い場合、腸内細菌の異常増殖を示唆する可能性があります。"}],"collocations":["indican test","urinary indicans","serum indicans"],"synonyms":["indoxyl sulfate","potassium indoxyl sulfate"],"antonyms":[]}],"etymology":{"value":"Derived from 'indigo' (a blue dye) and the suffix '-an' (indicating a derivative or related substance). Indican, upon hydrolysis, yields indoxyl, which can be oxidized to indigo.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪndɪˌkænz/","syllables":"in-di-cans"},"inflection":{"noun_plural":"indicans (already plural)"},"usage_notes":{"explanation":"'Indicans' refers specifically to a group of chemical compounds, notably indoxyl sulfate, found in urine. Its presence and concentration are used as a biomarker in certain medical tests. It's almost exclusively used in a scientific or medical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor measured indican.","correct":"✓ The doctor measured the level of indicans.","note":"'Indican' is a general term for a group of compounds. It's more accurate to refer to the level or concentration of 'indicans' rather than measuring 'indican' as a singular entity."}],"priority":"★★☆"},"related_words":{"derivatives":["indicanuria (名詞: インジカン尿症)","indoxyl (名詞: インドキシル)","indole (名詞: インドール)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Indicans' is a technical term primarily used in biochemistry and medicine. It refers to a group of compounds, specifically indoxyl sulfate salts, found in urine. High levels may indicate certain medical conditions, such as intestinal bacterial overgrowth. Understanding this term requires a background in biology or chemistry."},"example_sentences":[{"sentence":"The laboratory analysis revealed elevated levels of urinary indicans.","translation":"検査室での分析により、尿中のインジカン値の上昇が明らかになりました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"The patient's symptoms, combined with high serum indicans, suggested a diagnosis of small intestinal bacterial overgrowth (SIBO).","translation":"患者の症状と血清インジカン値の上昇から、小腸内細菌異常増殖症（SIBO）の診断が示唆されました。","type":"noun","meaning_category":"biomarker"}]}