{"word":"scrofula","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"瘰癧（るいれき）","english_definition":"A disease, especially affecting children, characterized by tuberculous inflammation of the lymphatic glands, especially in the neck.","examples":[{"sentence":"Scrofula was once a common disease, especially among children in poor living conditions.","translation":"瘰癧はかつて、特に劣悪な生活環境にある子供たちの間で一般的な病気だった。"},{"sentence":"The symptoms of scrofula include swollen lymph nodes in the neck.","translation":"瘰癧の症状には、首のリンパ節の腫れが含まれる。"}],"collocations":["cervical scrofula (頸部瘰癧)"],"synonyms":["tuberculous cervical lymphadenitis","king's evil (historical)"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from medieval Latin scrofulae, plural of scrofula, perhaps from scrofa ‘breeding sow’ (with reference to the animal's swollen neck).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskrɒfjʊlə/","syllables":"scrof-u-la"},"inflection":{"noun_plural":"scrofulas"},"usage_notes":{"explanation":"Scrofula is a historical term for tuberculous cervical lymphadenitis, a condition where the lymph nodes in the neck become infected with tuberculosis. While scrofula itself is not commonly used today in modern medicine, it's important to understand its historical significance. The term 'king's evil' was also used historically, reflecting the belief that the disease could be cured by the touch of a monarch.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has scrofula on his leg.","correct":"✓ He has scrofula in his neck.","note":"Scrofula specifically affects the lymph nodes, especially in the neck. If there's a similar condition on the leg, it's likely something else."}],"priority":"★☆☆"},"related_words":{"derivatives":["scrofulous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scrofula' is a historical medical term referring to tuberculosis infection of the lymph nodes, particularly in the neck. It is not commonly used in modern medical practice. Understanding this word is more relevant in a historical context or when reading older medical texts. The condition is now typically referred to as tuberculous cervical lymphadenitis.","priority":"★☆☆"},"example_sentences":[{"sentence":"Historically, treatment for scrofula often involved bloodletting.","translation":"歴史的に、瘰癧の治療にはしばしば瀉血が含まれていた。","type":"noun","meaning_category":"disease"},{"sentence":"The prevalence of scrofula decreased significantly with the advent of antibiotics.","translation":"抗生物質の出現により、瘰癧の有病率は大幅に低下した。","type":"noun","meaning_category":"disease"}]}