{"word":"up-and-under","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ラグビー)ハイパント、高く蹴り上げられたボール","english_definition":"(Rugby) A high, looping kick, typically used in rugby football to gain territory or put pressure on the opposition.","examples":[{"sentence":"He executed a perfect up-and-under, putting the defense under immense pressure.","translation":"彼は完璧なアップアンドアンダーを蹴り、ディフェンスに多大なプレッシャーをかけた。"},{"sentence":"The up-and-under is a key tactic for winning aerial battles in rugby.","translation":"アップアンドアンダーは、ラグビーで空中戦を制するための重要な戦術である。"}],"collocations":["kick an up-and-under","execute an up-and-under","a well-placed up-and-under"],"synonyms":["bomb (slang)","high ball","garryowen (Irish English)"],"antonyms":[]}],"etymology":{"value":"The term describes the trajectory of the ball: it goes 'up' high into the air and then comes 'under' as it descends, allowing players to chase and compete for possession.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌp ænd ˈʌndər/","syllables":"up-and-un-der"},"inflection":{"noun_plural":"up-and-unders"},"usage_notes":{"explanation":"The term 'up-and-under' is primarily used in rugby union and rugby league. It refers specifically to a tactical kick where the ball is kicked very high, giving the kicker's teammates time to chase and contest for the ball in the air. The success of an up-and-under depends on the height and placement of the kick, as well as the speed and agility of the chasing players.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He kicked a under-and-up.","correct":"✓ He kicked an up-and-under.","note":"The correct order is 'up-and-under'."},{"incorrect":"✗ The up and under was very low.","correct":"✓ The up-and-under was very low.","note":"It should be hyphenated."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_sports":["rugby union","rugby league"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (Relatively rare outside of rugby contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'up-and-under' is specific to rugby and describes a particular type of kick. Understanding its meaning requires familiarity with rugby terminology and tactics. It's a compound noun that refers to a high, arcing kick designed to give the kicking team time to chase and contest for possession. Its usage is limited to discussions about rugby football.","priority":"★★☆"},"example_sentences":[{"sentence":"The scrum-half launched an up-and-under towards the corner flag.","translation":"スクラムハーフはコーナーフラッグに向かってアップアンドアンダーを蹴り上げた。","type":"noun","meaning_category":"Rugby kick"},{"sentence":"Their winger is excellent at catching up-and-unders.","translation":"彼らのウィングはアップアンドアンダーをキャッチするのが非常に上手い。","type":"noun","meaning_category":"Rugby kick"},{"sentence":"A well-executed up-and-under can turn defense into attack in an instant.","translation":"うまく実行されたアップアンドアンダーは、瞬時にディフェンスを攻撃に変えることができる。","type":"noun","meaning_category":"Rugby kick"}]}