{"word":"bank-riding","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(自転車競技)バンク走行","english_definition":"A cycling technique involving riding on a banked track, typically in a velodrome.","examples":[{"sentence":"His bank-riding was impeccable, allowing him to maintain high speeds.","translation":"彼のバンク走行は完璧で、高速を維持することができた。"},{"sentence":"The cyclist practiced bank-riding to improve his cornering skills.","translation":"その自転車選手は、コーナリング技術を向上させるためにバンク走行を練習した。"}],"collocations":["improve bank-riding","practice bank-riding","velodrome bank-riding"],"synonyms":["track cycling","velodrome cycling"],"antonyms":[]}],"etymology":{"value":"Compound word formed from \"bank\" (referring to the banked surface of a velodrome track) and \"riding\" (the act of cycling).","priority":"★★☆"},"pronunciation":{"ipa":"ˈbæŋkˌraɪdɪŋ","syllables":"bank-ri-ding"},"inflection":{"noun_plural":"bank-ridings"},"usage_notes":{"explanation":"\"Bank-riding\" specifically refers to the technique and skill of cycling on a banked track, which is common in velodromes. It's a niche term primarily used within the context of cycling and sports.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was bank-riding on the street.","correct":"✓ He was cycling on the street.","note":"\"Bank-riding\" is specific to banked tracks, not general street cycling."}],"priority":"★★☆"},"related_words":{"derivatives":["banked track","velodrome","cycling","track cycling"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Bank-riding\" is a specialized term used in the context of cycling, specifically referring to the technique of riding on the banked curves of a velodrome track. It is not a commonly used word outside of this specific context. Understanding requires familiarity with cycling terminology and velodrome structures."},"example_sentences":[{"sentence":"The team focused on improving their bank-riding technique before the competition.","translation":"チームは競技会前にバンク走行技術の向上に焦点を当てた。","type":"noun","meaning_category":"バンク走行"},{"sentence":"Proper bank-riding allows cyclists to maintain momentum through the turns.","translation":"適切なバンク走行により、自転車選手はターンを通して勢いを維持できる。","type":"noun","meaning_category":"バンク走行"}]}