{"word":"professionally-oriented","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"専門志向の、職業志向の、実務志向の","english_definition":"Focused on or directed towards professional goals, skills, or development.","examples":[{"sentence":"The course is professionally-oriented, providing students with practical skills for the job market.","translation":"そのコースは専門志向で、学生に就職市場で役立つ実践的なスキルを提供します。"},{"sentence":"She chose a professionally-oriented degree program to enhance her career prospects.","translation":"彼女はキャリアの見通しを良くするために、職業志向の学位プログラムを選んだ。"},{"sentence":"The workshop is designed to be professionally-oriented, focusing on real-world applications.","translation":"そのワークショップは、実世界での応用を中心に、実務志向になるように設計されている。"}],"collocations":["professionally-oriented training (専門志向の研修)","professionally-oriented education (専門志向の教育)","professionally-oriented career (専門志向のキャリア)","professionally-oriented skills (専門志向のスキル)"],"synonyms":["career-focused","vocationally-focused","job-oriented","practical","applied"],"antonyms":["theoretical","academic","general","liberal arts"]},{"part_of_speech":"adjective","definition":"職業的な成功を重視する、専門家としての成長を重視する","english_definition":"Emphasizing or prioritizing professional success and development.","examples":[{"sentence":"He is a professionally-oriented individual, always seeking opportunities for advancement.","translation":"彼は職業的な成功を重視する人で、常に昇進の機会を探している。"},{"sentence":"The company culture is professionally-oriented, encouraging employees to pursue further education.","translation":"その会社の文化は専門家としての成長を重視しており、従業員がさらなる教育を追求することを奨励している。"}],"collocations":["professionally-oriented person (職業的な成功を重視する人)","professionally-oriented company culture (専門家としての成長を重視する企業文化)"],"synonyms":["ambitious","career-minded","driven","motivated","goal-oriented"],"antonyms":["unambitious","content","laid-back"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'professionally' (relating to a profession) and 'oriented' (directed or focused towards). The term indicates a focus or direction towards professional goals, skills, or development.","priority":"★★☆"},"pronunciation":{"ipa":"/prəˌfɛʃənəli ˈɔːrientɪd/","syllables":"pro-fes-sion-al-ly-o-ri-ent-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Professionally-oriented' is used to describe something that is designed or intended to prepare individuals for or enhance their success in a particular profession or career. It emphasizes practical skills, real-world applications, and career advancement. It can refer to educational programs, training courses, career paths, or even personal attitudes and values.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is profession oriented.","correct":"✓ The program is professionally-oriented.","note":"The correct form is 'professionally-oriented,' using the adverb 'professionally' to modify 'oriented.'"},{"incorrect":"✗ He is a professional oriented person.","correct":"✓ He is a professionally-oriented person.","note":"Again, use the adverb 'professionally' to correctly form the compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["professional (adjective, noun)","orientation (noun)","orient (verb)"],"related_terms":["career-oriented","work-related","job-specific","skill-based"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in professional and educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Professionally-oriented' means something is designed to help you succeed in a specific job or career. It focuses on practical skills and real-world applications. For example, a 'professionally-oriented course' is one that teaches you the skills you need to get a job in that field. It's more common in business or educational settings when talking about career development."},"example_sentences":[{"sentence":"The university offers a range of professionally-oriented courses in business and technology.","translation":"その大学は、ビジネスとテクノロジーにおけるさまざまな専門志向のコースを提供している。","type":"general","meaning_category":"専門志向の"},{"sentence":"She is looking for a more professionally-oriented role within the company.","translation":"彼女は社内でもっと職業的な成功を重視する役割を探している。","type":"general","meaning_category":"職業的な成功を重視する"},{"sentence":"The conference provides professionally-oriented workshops for educators.","translation":"その会議は、教育者向けの専門志向のワークショップを提供している。","type":"general","meaning_category":"専門志向の"}]}