{"word":"boily","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(釣り) ボイリー：鯉などの魚を釣るための、ゆでて乾燥させた球状の餌","english_definition":"(fishing) A boiled, hardened ball of dough used as bait, especially for carp.","examples":[{"sentence":"He caught a huge carp using a strawberry-flavored boily.","translation":"彼はイチゴ味のボイリーを使って巨大な鯉を釣り上げた。"},{"sentence":"Boilies are a popular choice for carp anglers.","translation":"ボイリーは鯉釣り師に人気の選択肢だ。"}],"collocations":["strawberry boily (イチゴ味のボイリー)","fish with boilies (ボイリーで魚を釣る)","carp boily (鯉用ボイリー)"],"synonyms":["bait","fishing bait","pellet"],"antonyms":[]}],"etymology":{"value":"Derived from 'boil' (ゆでる) because the bait is boiled during its preparation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɔɪli/","syllables":"boi-ly"},"inflection":{"noun_plural":"boilies"},"usage_notes":{"explanation":"'Boily' is a specialized term primarily used in the context of carp fishing. It refers to a specific type of bait that is made by boiling a mixture of ingredients and then allowing it to harden.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a boily to catch a bird.","correct":"✓ I used a boily to catch a carp.","note":"Boilies are specifically designed for catching fish, particularly carp, and are not suitable for catching birds."}],"priority":"★★☆"},"related_words":{"derivatives":["boil (verb: ゆでる)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (釣り関連の文脈でのみ使用されるため)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Boily' is a specialized term used almost exclusively in the context of carp fishing. Understanding its meaning requires familiarity with fishing terminology. It is unlikely to be encountered outside of this specific domain."},"example_sentences":[{"sentence":"The angler prepared his rod, attaching a brightly colored boily to the hook.","translation":"釣り人は竿の準備をし、明るい色のボイリーを針に取り付けた。","type":"noun","meaning_category":"釣り餌"},{"sentence":"Many serious carp fishermen make their own boilies to customize the flavor and ingredients.","translation":"多くの本格的な鯉釣り師は、味や材料をカスタマイズするために自分でボイリーを作る。","type":"noun","meaning_category":"釣り餌"}]}