{"word":"janapa","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Filipino skirt, often made from handwoven fabrics and worn by indigenous groups.","english_definition":"A type of traditional Filipino skirt, often made from handwoven fabrics and worn by indigenous groups, particularly in the northern regions of the Philippines.","examples":[{"sentence":"The museum displayed several beautiful janapa skirts, showcasing the intricate weaving techniques of the local tribes.","translation":"博物館には、地元の部族の複雑な織りの技術を紹介する、いくつかの美しいjanapaスカートが展示されていました。"},{"sentence":"During the cultural festival, the dancers wore colorful janapa skirts as part of their traditional attire.","translation":"文化祭の間、ダンサーは伝統的な衣装の一部として、カラフルなjanapaスカートを着用しました。"}],"collocations":["wear a janapa","handwoven janapa","traditional janapa","janapa skirt"],"synonyms":["tapis","lufid"],"antonyms":[]}],"etymology":{"value":"Likely derived from indigenous languages of the northern Philippines, where these skirts are traditionally worn. Further research is needed to pinpoint the exact origin and linguistic evolution.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒɑːnɑːpɑː/","syllables":"ja-na-pa"},"inflection":{"noun_plural":"janapas"},"usage_notes":{"explanation":"The term 'janapa' is specific to certain indigenous communities in the Philippines. It's important to use the term respectfully and accurately, acknowledging its cultural significance. When discussing Filipino traditional clothing, it's best to be specific about the region and ethnic group associated with the garment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She wore a janapa to the modern party.","correct":"She wore a janapa to the cultural event.","note":"Janapas are typically worn in traditional or cultural contexts, not modern, casual settings."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Filipino traditional clothing","indigenous textiles","handwoven fabrics","cultural attire","tapis","lufid"]},"level_frequency":{"CEFR":"N/A (Specific cultural term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'janapa' refers to a specific type of traditional Filipino skirt worn by indigenous groups. Understanding this term requires knowledge of Filipino culture and textiles. It is not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"The intricate designs on the janapa told stories of their ancestors and their connection to the land.","translation":"janapaの複雑なデザインは、彼らの祖先と土地とのつながりの物語を語っていました。","type":"noun","meaning_category":"Traditional Filipino skirt"},{"sentence":"Learning about the janapa helped me appreciate the rich cultural heritage of the Philippines.","translation":"janapaについて学ぶことは、フィリピンの豊かな文化遺産を理解するのに役立ちました。","type":"noun","meaning_category":"Traditional Filipino skirt"}]}