{"word":"caconym","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不適切な名前、不名誉な名前、悪名","english_definition":"A bad or unsuitable name; a name that is considered disreputable or inauspicious.","examples":[{"sentence":"'Bubba' might be considered a caconym for a lawyer.","translation":"「ブッバ」は弁護士にとって不適切な名前と考えられるかもしれません。"},{"sentence":"The term 'cancer' is a caconym because of the fear and negativity associated with the disease.","translation":"「癌」という言葉は、その病気に関連する恐怖と否定的な感情から、不名誉な名前と言えます。"}],"collocations":["use a caconym","avoid caconyms","a caconym for something"],"synonyms":["misnomer","inapt name","unsuitable name","dysonym"],"antonyms":["euonym","apt name","suitable name"],"notes":"Often used in discussions of language, naming conventions, and etymology."}],"etymology":{"value":"From Greek *kakos* (bad) + *onyma* (name).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkækənɪm","syllables":"ca-co-nym"},"inflection":{"noun_plural":"caconyms"},"usage_notes":{"explanation":"A caconym is a name that is considered to be inappropriate, unlucky, or offensive. It is the opposite of a euonym, which is a name that is considered to be appropriate and well-chosen. The term is primarily used in academic or linguistic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's caconym led to increased sales.","correct":"✓ The company's misnomer led to increased sales.","note":"Caconym refers to a name that is bad or unsuitable, not necessarily misleading. A misnomer is a wrong or inaccurate name or designation."}],"priority":"★☆☆"},"related_words":{"derivatives":["caconymous (adjective)","euonym (antonym)","onym (related term)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Caconym' is a rare and technical term, typically used in linguistic or etymological discussions. It refers to a name considered unsuitable or inauspicious. Due to its infrequent use, it is not commonly encountered outside of specialized contexts."},"example_sentences":[{"sentence":"The old woman believed that calling her child by a caconym would bring bad luck.","translation":"その老女は、子供を不名誉な名前で呼ぶと不運を招くと信じていた。","type":"general","meaning_category":"general"},{"sentence":" Linguists often analyze why certain names become caconyms over time.","translation":"言語学者は、特定の名前が時間の経過とともに不名誉な名前になる理由を分析することがよくあります。","type":"academic","meaning_category":"academic"}]}