{"word":"proterandrous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)雄性先熟の、雄ずい先熟の","english_definition":"(of a plant) having stamens that mature before the pistils, thus preventing self-fertilization; (of an animal) hermaphroditic but with male organs developing before female.","examples":[{"sentence":"Proterandrous flowers ensure cross-pollination.","translation":"雄性先熟の花は他家受粉を確実にする。"},{"sentence":"The proterandrous nature of the species promotes genetic diversity.","translation":"その種の雄性先熟の性質は遺伝的多様性を促進する。"}],"collocations":["proterandrous flower","proterandrous hermaphrodite"],"synonyms":["dichogamous","protandrous"],"antonyms":["protogynous"]},{"part_of_speech":"adjective","definition":"(動物が)雄性先熟の、雄性先熟的な雌雄同体の","english_definition":"(of an animal) hermaphroditic but with male organs developing before female.","examples":[{"sentence":"Some fish species are proterandrous hermaphrodites.","translation":"ある種の魚は雄性先熟の雌雄同体である。"},{"sentence":"The proterandrous sequential hermaphroditism allows for greater reproductive success.","translation":"雄性先熟の連続的雌雄同体は、より大きな繁殖成功を可能にする。"}],"collocations":["proterandrous fish","proterandrous sequential hermaphrodite"],"synonyms":["protandrous"],"antonyms":["protogynous"]}],"etymology":{"value":"Derived from the Greek words 'proteros' meaning 'earlier' and 'andros' meaning 'male'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtərˈændrəs/","syllables":"pro-ter-an-drous"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this adjective."},"usage_notes":{"explanation":"'Proterandrous' is a technical term used in botany and zoology to describe organisms that exhibit male-first development. In plants, this means the stamens (male parts) mature before the pistils (female parts), preventing self-pollination and promoting cross-pollination. In animals, it refers to hermaphroditic species where the male reproductive organs develop and function before the female organs. The term is relatively uncommon outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flower is proterogynous, meaning the stamens mature first.","correct":"✓ The flower is proterandrous, meaning the stamens mature first.","note":"Proterandrous means stamens mature first, while proterogynous means pistils mature first. It's important to use the correct term to describe the order of maturation."}],"priority":"★☆☆"},"related_words":{"derivatives":["proterandry (noun)"],"phrasal_verbs":[],"related_terms":["protogyny","dichogamy","hermaphrodite","sequential hermaphroditism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'proterandrous' is a specialized term primarily used in the fields of botany and zoology. It describes a specific biological phenomenon where the male reproductive organs of an organism mature before the female reproductive organs. Due to its technical nature, it is unlikely to be encountered outside of scientific literature or advanced biology courses. Understanding this word requires a solid foundation in biological terminology."},"example_sentences":[{"sentence":"The proterandrous nature of the lily family is well-documented.","translation":"ユリ科の雄性先熟の性質はよく記録されている。","type":"adjective","meaning_category":"botany"},{"sentence":"Proterandrous hermaphroditism is a common reproductive strategy in clownfish.","translation":"雄性先熟の雌雄同体は、クマノミにおける一般的な繁殖戦略である。","type":"adjective","meaning_category":"zoology"}]}