{"word":"impapase","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A combination of 'impatient' and 'paparazzi', referring to someone who is overly eager to take photos, especially in a way that is intrusive or annoying.","english_definition":"A portmanteau of 'impatient' and 'paparazzi', describing someone who is overly enthusiastic about taking photos, often in an intrusive or bothersome manner.","examples":[{"sentence":"My aunt was being such an impapase at the wedding, snapping photos of everyone without asking.","translation":"私の叔母は結婚式でまるでインパパラスみたいだった。誰にも許可を取らずにみんなの写真を撮りまくっていた。"},{"sentence":"He was acting like an impapase, constantly shoving his phone in people's faces to get a picture.","translation":"彼はまるでインパパラスのように振る舞っていた。写真を撮るために、常に人々の顔に携帯電話を突きつけていた。"}],"collocations":["act like an impapase","being an impapase","impapase behavior"],"synonyms":["overzealous photographer","intrusive photographer","annoying photographer"],"antonyms":["discreet photographer","unobtrusive photographer"]}],"etymology":{"value":"A blend of the words 'impatient' and 'paparazzi'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˌpæpəˈrɑːzi/","syllables":"im-pa-pa-ra-zi"},"inflection":{"noun_plural":"impapases"},"usage_notes":{"explanation":"'Impapase' is a relatively new, informal, and humorous word. It is used to describe someone who is overly eager and perhaps inconsiderate when taking photographs. It often implies that the person is being annoying or intrusive in their attempts to capture images.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was impapase because she was late.","correct":"✓ She was acting like an impapase, taking photos of everything.","note":"The word 'impapase' relates specifically to photography and being an intrusive photographer, not general impatience."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["paparazzi","photographer","impatient"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency (slang)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impapase' is a humorous slang term formed by combining 'impatient' and 'paparazzi.' It describes someone who is overly enthusiastic and intrusive when taking photos, often to the point of being annoying. Because it's a slang term, it's not commonly found in formal writing and is more often used in casual conversation or humorous contexts."},"example_sentences":[{"sentence":"He turned into a total impapase when he got his new camera.","translation":"彼は新しいカメラを手に入れたら、まるでインパパラスみたいになった。","type":"noun","meaning_category":"Overly eager photographer"},{"sentence":"The celebrity complained about the impapases constantly hounding her for photos.","translation":"その有名人は、写真のために絶えず彼女を追い回すインパパラスたちについて不満を述べた。","type":"noun","meaning_category":"Overly eager photographer"}]}