{"word":"crystallography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"結晶学","english_definition":"The branch of science that examines the arrangement and bonding of atoms in crystalline solids and the geometric structure of crystals.","examples":[{"sentence":"Crystallography is used to determine the structure of proteins.","translation":"結晶学はタンパク質の構造を決定するために用いられる。"},{"sentence":"X-ray crystallography is a powerful technique for studying crystal structures.","translation":"X線結晶学は結晶構造を研究するための強力な技術である。"},{"sentence":"The principles of crystallography are important in materials science.","translation":"結晶学の原理は材料科学において重要である。"}],"collocations":["X-ray crystallography (X線結晶学)","protein crystallography (タンパク質結晶学)","neutron crystallography (中性子結晶学)","electron crystallography (電子線結晶学)","crystal structure (結晶構造)","unit cell (単位格子)","diffraction pattern (回折パターン)"],"synonyms":["crystal science","crystal structure analysis"],"antonyms":[]}],"etymology":{"value":"From 'crystal' + '-o-' + '-graphy'. 'Crystal' comes from the Greek 'krystallos' meaning 'clear ice' or 'rock crystal'. '-graphy' comes from the Greek 'graphein' meaning 'to write' or 'to record'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪstəˈlɒɡrəfi/","syllables":"crys-tal-log-ra-phy"},"inflection":{"noun_plural":"crystallographies (rarely used)"},"usage_notes":{"explanation":"Crystallography is primarily used in chemistry, physics, materials science, and biology to understand the atomic and molecular structure of crystalline materials. It relies on techniques like X-ray diffraction to determine the arrangement of atoms within a crystal lattice. The term is generally used in a scientific or technical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Crystallography is a study of all solids.","correct":"✓ Crystallography is a study of crystalline solids.","note":"Crystallography specifically deals with crystalline solids, not all solids. Amorphous solids are not studied using crystallographic methods."},{"incorrect":"✗ Crystallography is easy to learn.","correct":"✓ Crystallography requires a strong background in mathematics and physics.","note":"While the basic concepts can be grasped relatively easily, advanced crystallography requires a deep understanding of mathematics, physics, and chemistry."}],"priority":"★★☆"},"related_words":{"derivatives":["crystallographer (結晶学者)","crystallographic (結晶学の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crystallography' is a specialized term referring to the scientific study of crystals and their atomic structure. It's a field that involves complex techniques like X-ray diffraction to determine how atoms are arranged within a crystal lattice. This term is typically encountered in scientific or technical contexts related to chemistry, physics, materials science, and biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The research team used crystallography to analyze the structure of the new alloy.","translation":"研究チームは、新しい合金の構造を分析するために結晶学を用いた。","type":"general","meaning_category":"scientific research"},{"sentence":"X-ray crystallography revealed the precise arrangement of atoms in the mineral.","translation":"X線結晶学は、その鉱物中の原子の正確な配置を明らかにした。","type":"specific technique","meaning_category":"scientific technique"},{"sentence":"Understanding crystallography is essential for designing new materials with specific properties.","translation":"結晶学を理解することは、特定の特性を持つ新しい材料を設計するために不可欠である。","type":"importance","meaning_category":"scientific importance"}]}