{"word":"jabberingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"早口でまくしたてるように、意味不明瞭にぺちゃくちゃと","english_definition":"in a rapid, indistinct, and often unintelligible manner; chattering rapidly and nonsensically.","examples":[{"sentence":"The children were talking jabberingly about their exciting day.","translation":"子供たちは興奮した一日について早口でまくしたてるように話していた。"},{"sentence":"He spoke jabberingly, making it difficult to understand what he was trying to say.","translation":"彼は早口でぺちゃくちゃと話したので、彼が何を言おうとしているのか理解するのが難しかった。"}],"collocations":["speak jabberingly","talk jabberingly","mutter jabberingly"],"synonyms":["chatteringly","garrulously","volubly","incoherently","unintelligibly"],"antonyms":["coherently","distinctly","clearly","intelligibly"]}],"etymology":{"value":"The word 'jabberingly' is derived from the verb 'jabber,' which means to talk rapidly and excitedly but with little sense. The suffix '-ingly' turns it into an adverb, describing the manner of speaking.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒæbərɪŋli/","syllables":"jab-ber-ing-ly"},"inflection":{"notes":"This word is an adverb and does not have different inflections."},"usage_notes":{"explanation":"'Jabberingly' describes speech that is rapid, excited, and difficult to understand. It often implies that the speaker is talking too quickly or is too excited to articulate clearly. It is used to describe the manner in which someone speaks, emphasizing the lack of clarity and coherence in their speech.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She jabberingly the words.","correct":"✓ She spoke jabberingly.","note":"'Jabberingly' is an adverb and modifies a verb, it should not be used as a verb itself."},{"incorrect":"✗ He was jabberingly.","correct":"✓ He was speaking jabberingly.","note":"'Jabberingly' needs a verb to modify, such as 'speaking' or 'talking'."}],"priority":"★★☆"},"related_words":{"derivatives":["jabber (verb/noun)","jabberer (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'jabberingly' is an adverb that describes the way someone speaks in a rapid, indistinct, and often unintelligible manner. It is not a common word and is typically used in more advanced or descriptive writing to convey a sense of hurried, nonsensical speech. Understanding this word requires a good grasp of vocabulary and context."},"example_sentences":[{"sentence":"The excited child explained the magic trick jabberingly.","translation":"興奮した子供は、その手品について早口でまくしたてるように説明した。","type":"adverb","meaning_category":"manner of speaking"},{"sentence":"He muttered jabberingly under his breath, too upset to form coherent sentences.","translation":"彼は動揺しすぎてまとまりのある文章を作ることができず、早口で不明瞭につぶやいた。","type":"adverb","meaning_category":"manner of speaking"}]}