{"word":"coolant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"冷却剤","english_definition":"a fluid used to reduce the operating temperature of an engine or other device.","examples":[{"sentence":"The car's engine overheated because it was low on coolant.","translation":"冷却剤が少なかったため、車のエンジンがオーバーヒートした。"},{"sentence":"Check the coolant level regularly to prevent engine damage.","translation":"エンジンの損傷を防ぐため、冷却剤のレベルを定期的に確認してください。"},{"sentence":"This coolant is designed to protect against corrosion and freezing.","translation":"この冷却剤は、腐食や凍結から保護するように設計されています。"}],"collocations":["engine coolant (エンジン冷却剤)","radiator coolant (ラジエーター冷却剤)","coolant level (冷却剤レベル)","coolant temperature (冷却剤温度)","coolant leak (冷却剤漏れ)","antifreeze coolant (不凍液冷却剤)"],"synonyms":["antifreeze","heat transfer fluid"],"antonyms":[],"related_terms":["radiator","engine","thermostat","water pump"]}],"etymology":{"value":"Derived from the verb 'cool' and the suffix '-ant', indicating a substance that causes cooling.","priority":"★★★"},"pronunciation":{"ipa":"ˈkuːlənt","syllables":"coo-lant"},"inflection":{"noun_plural":"coolants"},"usage_notes":{"explanation":"Coolant is a fluid, typically a mixture of water and antifreeze, used to regulate the temperature of an engine or other machinery. It prevents overheating and freezing, while also protecting against corrosion. Regular checks and maintenance of the coolant level are essential for proper functioning and longevity of the equipment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I added water instead of coolant, is that okay?","correct":"✓ Adding only water is not ideal, as it doesn't offer the same protection against freezing and corrosion as coolant.","note":"While water can cool an engine, it lacks the protective properties of coolant, such as antifreeze and corrosion inhibitors."},{"incorrect":"✗ Coolant is the same as windshield washer fluid.","correct":"✓ Coolant and windshield washer fluid are different fluids with different purposes.","note":"Coolant is for engine temperature regulation, while windshield washer fluid is for cleaning the windshield."}],"priority":"★★☆"},"related_words":{"derivatives":["cool (verb, adjective)","cooling (noun, adjective)"],"phrasal_verbs":[],"related_terms":["radiator","engine","water pump","thermostat","antifreeze"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Coolant' refers to a liquid used to prevent engines or machines from overheating. It's a mixture of water and antifreeze, protecting against freezing and corrosion. Regular checks are important to avoid damage. It's commonly discussed in automotive and engineering contexts."},"example_sentences":[{"sentence":"The mechanic recommended replacing the **coolant** every two years.","translation":"整備士は2年ごとに冷却剤を交換することを推奨した。","type":"noun","meaning_category":"冷却剤"},{"sentence":"A **coolant** leak can lead to serious engine damage.","translation":"冷却剤の漏れは、深刻なエンジンの損傷につながる可能性がある。","type":"noun","meaning_category":"冷却剤"},{"sentence":"The **coolant** temperature should be monitored to ensure optimal engine performance.","translation":"最適なエンジン性能を確保するために、冷却剤の温度を監視する必要がある。","type":"noun","meaning_category":"冷却剤"}]}