{"word":"emerize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(主に革製品を)エメリーで研磨する、起毛する","english_definition":"To abrade or finish (leather or other material) with an emery wheel or similar abrasive.","examples":[{"sentence":"The leather was emerized to give it a smooth, velvety finish.","translation":"その革は、滑らかでビロードのような仕上がりになるようにエメリーで研磨された。"},{"sentence":"Emerizing the surface helps to remove imperfections and prepare it for dyeing.","translation":"表面をエメリーで研磨することで、欠陥を取り除き、染色に備えるのに役立つ。"}],"collocations":["emerize leather","emerize the surface"],"synonyms":["abrade","buff","polish","finish"],"antonyms":[]}],"etymology":{"value":"Derived from 'emery,' a type of abrasive, with the suffix '-ize' indicating the process of treating something with emery.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeməraɪz/","syllables":"e-mer-ize"},"inflection":{"verb_forms":{"present_simple":["emerize","emerizes"],"past_simple":"emerized","past_participle":"emerized","present_participle":"emerizing"}},"usage_notes":{"explanation":"'Emerize' is a technical term primarily used in the context of leatherworking and manufacturing. It refers to the process of using an emery wheel or similar abrasive tool to smooth, buff, or finish a surface, most commonly leather. The process is used to create a uniform texture, remove imperfections, or prepare the material for further treatment, such as dyeing or coating.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to emerize my shoes with sandpaper.","correct":"✓ I need to emerize my shoes with an emery cloth.","note":"Emery is a specific type of abrasive, not just any abrasive like sandpaper. Using an emery cloth or wheel is more accurate."}],"priority":"★☆☆"},"related_words":{"derivatives":["emery","emery board"]},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emerize' is a specialized verb that describes the process of using an emery wheel or similar abrasive to treat a surface, especially leather. This term is not commonly used in everyday language and is primarily found in technical or manufacturing contexts related to leatherworking. Understanding the term requires familiarity with industrial processes and materials."},"example_sentences":[{"sentence":"The artisan carefully emerized the leather to achieve the desired texture.","translation":"職人は、望ましい質感を得るために、革を慎重にエメリーで研磨した。","type":"verb","meaning_category":"研磨する"},{"sentence":"After tanning, the leather is emerized to remove any remaining imperfections.","translation":"なめしの後、革に残った欠陥を取り除くためにエメリーで研磨される。","type":"verb","meaning_category":"研磨する"}]}