{"word":"hypostrophe","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(修辞学)倒置法、文末反復法：文や節の終わりで同じ単語や句を繰り返す修辞技法。","english_definition":"(rhetoric) The repetition of the same word or phrase at the end of successive clauses or sentences.","examples":[{"sentence":"Consider Lincoln's \"...and that government of the people, by the people, for the people, shall not perish from the earth.\" This is an example of hypostrophe.","translation":"リンカーンの「人民の人民による人民のための政治を地上から絶滅させてはならない」という言葉を考えてみてください。これは倒置法の例です。"},{"sentence":"Hypostrophe is often used for emphasis and emotional effect.","translation":"倒置法は、強調や感情的な効果のためにしばしば使用されます。"}],"collocations":["use hypostrophe","example of hypostrophe","rhetorical device"],"synonyms":["epistrophe","antistrophe"],"antonyms":["anaphora"]},{"part_of_speech":"noun","definition":"(文法)倒置、語順の転換：通常の語順を逆にする文法的な構造。","english_definition":"(grammar) Inversion of the normal order of words.","examples":[{"sentence":"\"Patience I lack\" is an example of hypostrophe.","translation":"「私は忍耐力がない」は倒置の例です。"},{"sentence":"Hypostrophe can be used for emphasis or to create a more formal tone.","translation":"倒置は、強調のため、またはよりフォーマルなトーンを作成するために使用できます。"}],"collocations":["grammatical hypostrophe","use hypostrophe","example of hypostrophe"],"synonyms":["inversion","anastrophe"],"antonyms":["normal word order"]}],"etymology":{"value":"ギリシャ語の ὑποστροφή (hypostrophḗ) から派生。これは ὑπό (hypó, 「下、下で」) + στροφή (strophḗ, 「回転、曲がり」) に由来する。文字通りには「下への回転」を意味し、文の終わりに戻るという概念を示唆する。","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈpɒstrəfi/","syllables":"hy-pos-tro-phe"},"inflection":{"noun_plural":"hypostrophes"},"usage_notes":{"explanation":"「**hypostrophe**」は、修辞学と文法で異なる意味を持つ単語です。\n\n1.  **修辞学 (Rhetoric)**: 文末反復法（または倒置法）を指し、連続する文や節の終わりに同じ単語や句を繰り返すことで、強調や感情的な効果を生み出します。これは、文頭で繰り返すアナフォラ（反復法）とは対照的です。\n\n2.  **文法 (Grammar)**: 倒置、つまり通常の語順を逆にする文法的な構造を指します。これは、文の特定の要素を強調したり、よりフォーマルなトーンを作り出すために使用されます。\n\nこの単語を使用する際は、文脈に応じてどちらの意味で使用されているかを明確にする必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem used anaphora instead of hypostrophe at the end of each line.","correct":"✓ The poem used hypostrophe instead of anaphora at the end of each line.","note":"Hypostropheは文末の繰り返し、anaphoraは文頭の繰り返しです。"},{"incorrect":"✗ Hypostrophe is when the subject comes before the verb.","correct":"✓ Hypostrophe is when the object or complement comes before the verb.","note":"倒置は、目的語や補語が動詞の前に来る場合を指します。主語が動詞の前に来るのは通常の語順です。"},{"incorrect":"✗ The author used a lot of hypostrophes to confuse the reader.","correct":"✓ The author used a lot of hypostrophes to create emphasis.","note":"Hypostropheは強調のために使用され、読者を混乱させるためではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["anaphora","epistrophe","antistrophe","inversion","rhetoric","grammar","syntax"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**hypostrophe**」は、主に文学や言語学の分野で使用される専門用語です。この単語は、文や節の終わりに同じ単語や句を繰り返す修辞技法、または通常の語順を逆にする文法的な構造を指します。日常会話ではほとんど使用されず、高度な文章分析や修辞学の研究において現れます。この単語を理解するには、修辞技法と文法の基本的な知識が必要です。"},"example_sentences":[{"sentence":"The politician's speech employed hypostrophe to create a memorable and impactful conclusion.","translation":"その政治家の演説は、記憶に残るインパクトのある結論を作るために倒置法を用いた。","type":"noun","meaning_category":"修辞学"},{"sentence":"The sentence \"Strong he was\" is an example of hypostrophe in grammatical structure.","translation":"「彼は強かった」という文は、文法構造における倒置の例である。","type":"noun","meaning_category":"文法"},{"sentence":"Hypostrophe can be a powerful tool for emphasizing key ideas in writing.","translation":"倒置法は、文章の重要なアイデアを強調するための強力なツールとなり得る。","type":"noun","meaning_category":"修辞学"}]}