{"word":"isocorybulbine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An alkaloid found in Corydalis species, known for its potential pharmacological activities.","english_definition":"An alkaloid found in Corydalis species, known for its potential pharmacological activities, such as analgesic and anti-inflammatory effects.","examples":[{"sentence":"Isocorybulbine is being studied for its effects on pain management.","translation":"イソコリブルビンは、疼痛管理への影響について研究されています。"}],"collocations":["study isocorybulbine","effects of isocorybulbine","synthesize isocorybulbine"],"synonyms":["alkaloid","Corydalis alkaloid"],"antonyms":[]}],"etymology":{"value":"Derived from 'iso-' (meaning 'same' or 'equal'), 'Corydalis' (the genus of plants from which it is extracted), and '-bulbine' (a common suffix for alkaloids).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsoʊˌkɔːriˈbʌlbiːn/","syllables":"i-so-co-ry-bul-bine"},"inflection":{"noun_plural":"isocorybulbines"},"usage_notes":{"explanation":"Isocorybulbine is primarily used in scientific research contexts when discussing the chemical compounds found in certain plants and their potential medical applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Isocorybulbine are used as a painkiller.","correct":"✓ Isocorybulbine is being studied for its potential as a painkiller.","note":"Isocorybulbine is a singular noun and is often the subject of research, so it pairs with singular verbs. Also, it's more accurate to say it's being studied rather than directly used as a painkiller."}],"priority":"★★☆"},"related_words":{"derivatives":["corydalis","alkaloid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Isocorybulbine is a technical term used in chemistry and pharmacology. It refers to a specific alkaloid compound found in plants of the Corydalis genus. Understanding this term requires a background in scientific vocabulary. Its usage is limited to specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers are investigating how isocorybulbine interacts with dopamine receptors.","translation":"研究者たちは、イソコリブルビンがドーパミン受容体とどのように相互作用するかを調査しています。","type":"noun","meaning_category":"alkaloid"},{"sentence":"The synthesis of isocorybulbine was achieved through a novel chemical pathway.","translation":"イソコリブルビンの合成は、新規な化学経路を通じて達成されました。","type":"noun","meaning_category":"alkaloid"}]}