{"word":"pharyngalgic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"咽頭痛の、咽頭痛を患っている","english_definition":"Relating to or suffering from pain in the pharynx; having a sore throat.","examples":[{"sentence":"The patient presented with pharyngalgic symptoms, including difficulty swallowing.","translation":"患者は嚥下困難を含む咽頭痛の症状を呈した。"},{"sentence":"A pharyngalgic condition can be caused by various factors, such as viral infections or allergies.","translation":"咽頭痛の状態は、ウイルス感染やアレルギーなど、さまざまな要因によって引き起こされる可能性がある。"}],"collocations":["pharyngalgic symptoms","pharyngalgic condition","acute pharyngalgic infection"],"synonyms":["sore-throated","pharyngitic","throat-aching"],"antonyms":["healthy-throated","non-pharyngalgic"]}],"etymology":{"value":"Derived from the combination of 'pharyng-' (referring to the pharynx) and '-algic' (referring to pain).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfærɪnˈdʒældʒɪk/","syllables":"pha-ryn-gal-gic"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative and superlative forms (more pharyngalgic, most pharyngalgic), though these are rarely used."},"usage_notes":{"explanation":"'Pharyngalgic' is a relatively uncommon medical term specifically describing pain originating in the pharynx, commonly known as the throat. It is more precise than simply saying 'sore throat,' as it directly relates the pain to the pharynx.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is pharyngalgic with a fever.","correct":"✓ The patient has pharyngalgic symptoms and a fever.","note":"'Pharyngalgic' describes the condition or symptoms, not the patient directly. It's better to say the patient *has* pharyngalgic symptoms."},{"incorrect":"✗ Pharyngalgic is a disease.","correct":"✓ Pharyngalgia is a symptom, not a disease.","note":"'Pharyngalgic' is an adjective describing the pain, while 'pharyngalgia' is the noun referring to the pain itself. It is a symptom, not a disease."}],"priority":"★★☆"},"related_words":{"derivatives":["pharyngalgia (noun: 咽頭痛)","pharynx (noun: 咽頭)","pharyngitis (noun: 咽頭炎)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pharyngalgic' is a medical term used to describe something related to pain in the pharynx (throat). It is a specific adjective used in medical contexts to describe symptoms or conditions involving throat pain. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor noted the patient's pharyngalgic complaints in the medical chart.","translation":"医師は患者の咽頭痛の訴えをカルテに記録した。","type":"adjective","meaning_category":"Medical symptom"},{"sentence":"The pharyngalgic discomfort made it difficult for her to eat solid foods.","translation":"咽頭痛の不快感で、彼女は固形物を食べることが困難になった。","type":"adjective","meaning_category":"Medical symptom"},{"sentence":"He was diagnosed with a pharyngalgic condition due to a bacterial infection.","translation":"彼は細菌感染による咽頭痛の状態と診断された。","type":"adjective","meaning_category":"Medical condition"}]}