{"word":"invitational","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"招待制の、招待によってのみ参加できる","english_definition":"Relating to an event or competition where participants are selected by invitation only.","examples":[{"sentence":"This is an invitational tournament, so you can't just sign up.","translation":"これは招待制のトーナメントなので、ただ申し込むことはできません。"},{"sentence":"The gallery held an invitational exhibition featuring local artists.","translation":"ギャラリーは地元のアーティストをフィーチャーした招待制の展覧会を開催しました。"},{"sentence":"We received an invitational letter to the conference.","translation":"私たちは会議への招待状を受け取りました。"}],"collocations":["invitational tournament (招待制のトーナメント)","invitational competition (招待制の競技会)","invitational event (招待制のイベント)","invitational exhibition (招待制の展覧会)","invitational letter (招待状)"],"synonyms":["by invitation only","exclusive","selective"],"antonyms":["open","public","unrestricted"]}],"etymology":{"value":"The word \"invitational\" is derived from the verb \"invite,\" which comes from the Latin word \"invitare,\" meaning \"to invite, entertain, treat.\" The suffix \"-ational\" is added to form an adjective indicating something related to or characterized by invitations.","priority":"★★★"},"pronunciation":{"ipa":"/ɪn.vɪˈteɪ.ʃən.əl/","syllables":"in-vi-TA-tion-al"},"inflection":{"notes":"This word is an adjective and does not have different inflections like verbs or nouns."},"usage_notes":{"explanation":"\"Invitational\" is used to describe events, competitions, or exhibitions where participation is restricted to those who have been specifically invited. It implies a level of exclusivity or selectivity, often based on skill, reputation, or other criteria.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The event is invitation.","correct":"The event is invitational.","note":"\"Invitation\" is a noun, while \"invitational\" is an adjective. Use the adjective to describe the event."},{"incorrect":"Only invitations are allowed.","correct":"Only invitees are allowed.","note":"If you mean only those who are invited are allowed, use 'invitees' (the people who are invited) rather than 'invitations' (the documents)."}],"priority":"★★☆"},"related_words":{"derivatives":["invite (verb)","invitation (noun)","invitee (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts like sports and art.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"invitational\" is used to describe events that are only open to people who have been specifically invited. It's often used in the context of sports tournaments, art exhibitions, or exclusive gatherings. The word implies a level of prestige or exclusivity, as not everyone can participate. It's a useful word to know when discussing events that are not open to the general public."},"example_sentences":[{"sentence":"The Masters is an invitational golf tournament.","translation":"マスターズは招待制のゴルフトーナメントです。","type":"example","meaning_category":"招待制のトーナメント"},{"sentence":"She received an invitational to the prestigious art show.","translation":"彼女は権威ある美術展への招待を受けました。","type":"example","meaning_category":"招待制の展覧会"},{"sentence":"The club hosts an annual invitational for its top members.","translation":"クラブは毎年、トップメンバーのための招待制のイベントを開催します。","type":"example","meaning_category":"招待制のイベント"}]}