{"word":"noctidial","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物などが)夜行性と昼行性の両方の性質を持つ","english_definition":"Active during both the day and the night; crepuscular.","examples":[{"sentence":"Some animals exhibit noctidial behavior, being active at various times depending on environmental conditions.","translation":"いくつかの動物は、環境条件に応じて様々な時間帯に活動するため、夜行性と昼行性の両方の性質を示す。"}],"collocations":["noctidial animals","noctidial behavior"],"synonyms":["crepuscular","diurnal","nocturnal"],"antonyms":[],"notes":"'Noctidial' is a relatively rare term. 'Crepuscular' is more commonly used to describe animals active at dawn and dusk."}],"etymology":{"value":"Combination of 'nocturnal' (relating to the night) and 'diurnal' (relating to the day).","priority":"★★☆"},"pronunciation":{"ipa":"/nɒkˈtɪdiəl/","syllables":"noc-tid-i-al"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'noctidial' is used to describe animals that do not fit neatly into either the 'nocturnal' (active at night) or 'diurnal' (active during the day) categories. These animals may adjust their activity patterns based on factors like temperature, food availability, or predator avoidance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The noctidial bird only comes out at night.","correct":"✓ The nocturnal bird only comes out at night.","note":"'Nocturnal' refers to animals that are only active at night. 'Noctidial' animals can be active both day and night."}],"priority":"★☆☆"},"related_words":{"derivatives":["nocturnal","diurnal","crepuscular"],"related_terms":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Noctidial' is a specialized term used in biology and zoology to describe animals active both during the day and night. It's less common than 'diurnal' (daytime) and 'nocturnal' (nighttime). Understanding this word requires a good vocabulary related to animal behavior and ecology."},"example_sentences":[{"sentence":"Owls are typically nocturnal, but some species can exhibit noctidial tendencies depending on their hunting needs.","translation":"フクロウは通常夜行性ですが、狩りの必要性に応じて夜行性と昼行性の両方の傾向を示す種もいます。","type":"general","meaning_category":"general"},{"sentence":"The lemur's activity pattern is described as noctidial, as it is observed foraging both during the day and at night.","translation":"そのキツネザルの活動パターンは、昼間と夜間の両方で採餌が観察されるため、夜行性と昼行性の両方の性質を持つと説明されています。","type":"general","meaning_category":"general"}]}