{"word":"Clubionid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A spider of the family Clubionidae; a sac spider.","english_definition":"Any spider belonging to the family Clubionidae, known for their sac-like webs and nocturnal habits.","examples":[{"sentence":"Clubionids are often found under rocks or in leaf litter.","translation":"フクログモ類は岩の下や落ち葉の中にいることが多いです。"},{"sentence":"The Clubionid spider is a nocturnal hunter.","translation":"フクログモは夜行性のハンターです。"}],"collocations":["sac spider","nocturnal hunter","leaf litter","under rocks"],"synonyms":["sac spider"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Clubiona' (coined by Pierre André Latreille in 1804) + '-id' (suffix indicating family membership in biological nomenclature).","priority":"☆☆☆"},"pronunciation":{"ipa":"/kluːˈbaɪənɪd/","syllables":"Clu-bi-o-nid"},"inflection":{"noun_plural":"Clubionids"},"usage_notes":{"explanation":"'Clubionid' refers specifically to spiders belonging to the family Clubionidae. They are characterized by constructing silken retreats or sacs, rather than elaborate webs, and are typically nocturnal hunters.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Clubionidae (family name)","Clubiona (genus name)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Clubionid' is a specialized zoological term used to refer to spiders belonging to the family Clubionidae. Understanding this term requires familiarity with biological classification systems. These spiders are often referred to as 'sac spiders' due to their habit of constructing silken sacs for shelter.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The researcher identified the spider as a Clubionid based on its eye arrangement and spinneret morphology.","translation":"研究者は、そのクモの目の配置と糸疣の形態に基づいてフクログモであると同定しました。","type":"noun","meaning_category":"spider"},{"sentence":"Several species of Clubionid spiders are known to exhibit aggressive behavior when disturbed.","translation":"フクログモ類のいくつかの種は、邪魔されると攻撃的な行動を示すことが知られています。","type":"noun","meaning_category":"spider"}]}