{"word":"Lymantriid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ドクガ科の蛾","english_definition":"A moth of the family Lymantriidae (formerly Liparidae). These moths are also known as tussock moths.","examples":[{"sentence":"The Lymantriid caterpillar was covered in urticating hairs.","translation":"そのドクガ科の毛虫は、じんましんを引き起こす毛で覆われていた。"},{"sentence":"Lymantriid moths are often considered pests due to their defoliating habits.","translation":"ドクガ科の蛾は、葉を食い荒らす習性から、しばしば害虫とみなされる。"}],"collocations":["Lymantriid caterpillar","Lymantriid moth","Lymantriid outbreak"],"synonyms":["tussock moth"],"antonyms":[]}],"etymology":{"value":"From the family name Lymantriidae, derived from the genus Lymantria. The genus name Lymantria comes from the Greek word 'lymantria' meaning 'destroyer'.","priority":"★★☆"},"pronunciation":{"ipa":"/laɪˈmæntriɪd/","syllables":"ly-man-tri-id"},"inflection":{"noun_plural":"Lymantriids"},"usage_notes":{"explanation":"'Lymantriid' refers specifically to moths belonging to the family Lymantriidae. These moths are known for their hairy caterpillars, which can sometimes cause skin irritation in humans. They are often considered pests due to their ability to defoliate trees.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lymantriid are eating all the leaves.","correct":"✓ The lymantriids are eating all the leaves.","note":"'Lymantriid' is a noun, and when referring to multiple moths, the plural form 'Lymantriids' should be used."}],"priority":"★☆☆"},"related_words":{"derivatives":["Lymantriidae (family name)","Lymantria (genus name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. This is a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lymantriid' is a scientific term used to refer to moths belonging to the family Lymantriidae, commonly known as tussock moths. This term is primarily used in entomology and related scientific fields. Due to its specialized nature, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The forest suffered significant defoliation due to a Lymantriid infestation.","translation":"その森林は、ドクガ科の蛾の大量発生により、深刻な落葉被害を受けた。","type":"noun","meaning_category":"ドクガ科の蛾"},{"sentence":"Researchers are studying the life cycle of the Lymantriid to develop effective control methods.","translation":"研究者たちは、効果的な防除方法を開発するために、ドクガ科の蛾のライフサイクルを研究している。","type":"noun","meaning_category":"ドクガ科の蛾"}]}