{"word":"theomaniac","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"神憑り者、神に憑かれたと信じている人、神への狂信者","english_definition":"A person who believes himself or herself to be a god, or to be divinely inspired or possessed.","examples":[{"sentence":"The theomaniac claimed to be the reincarnation of a deity.","translation":"その神憑り者は、自身が神の生まれ変わりだと主張した。"},{"sentence":"Doctors diagnosed him as a theomaniac after he insisted he was in direct communication with God.","translation":"彼が神と直接対話していると主張した後、医師たちは彼を神憑り者と診断した。"}],"collocations":["a self-proclaimed theomaniac","diagnosed as a theomaniac"],"synonyms":["religious fanatic","delusional messiah","god complex sufferer"],"antonyms":["atheist","agnostic","skeptic"]}],"etymology":{"value":"From the Greek words 'theos' (god) + 'mania' (madness, frenzy).","priority":"★★☆"},"pronunciation":{"ipa":"ˌθiːoʊˈmeɪniæk","syllables":"the-o-ma-ni-ac"},"inflection":{"noun_plural":"theomaniacs"},"usage_notes":{"explanation":"'Theomaniac' is a relatively rare term, often used in a clinical or psychological context to describe someone with delusions of grandeur related to religion or divinity. It is distinct from simple religious fervor or devoutness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was just a very religious person, not a theomaniac.","correct":"✓ He was just a very religious person, not a theomaniac.","note":"Theomaniac implies a delusion or mental disorder, not just strong religious belief."}],"priority":"★☆☆"},"related_words":{"derivatives":["theomania (noun: 神憑り、神への狂信)"],"related_terms":["megalomania","delusion","religious delusion"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'theomaniac' is a specialized term primarily used in psychological or psychiatric contexts. It refers to an individual who has delusions of being a god or having a special connection to the divine. Due to its clinical nature and infrequent use, it is not commonly encountered in everyday language. Understanding requires familiarity with psychological terminology and concepts related to delusions and mental disorders."},"example_sentences":[{"sentence":"The patient exhibited signs of theomania, claiming to be the chosen one.","translation":"その患者は神憑りの兆候を示し、自身が選ばれた者だと主張した。","type":"general","meaning_category":"神憑り者"},{"sentence":"The psychiatrist specialized in treating patients with theomania and other religious delusions.","translation":"その精神科医は、神憑りやその他の宗教的妄想を持つ患者の治療を専門としていた。","type":"medical","meaning_category":"神憑り者"}]}