{"word":"hyperbilirubinemia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"高ビリルビン血症","english_definition":"A condition in which there is too much bilirubin in the blood. When bilirubin levels are high, the skin and whites of the eyes may look yellow (jaundice).","examples":[{"sentence":"Neonatal hyperbilirubinemia is common in newborns.","translation":"新生児高ビリルビン血症は新生児によく見られます。"},{"sentence":"Hyperbilirubinemia can be caused by liver disease.","translation":"高ビリルビン血症は肝臓疾患によって引き起こされる可能性があります。"},{"sentence":"Treatment for hyperbilirubinemia may include phototherapy.","translation":"高ビリルビン血症の治療には光線療法が含まれる場合があります。"}],"collocations":["neonatal hyperbilirubinemia (新生児高ビリルビン血症)","conjugated hyperbilirubinemia (抱合型高ビリルビン血症)","unconjugated hyperbilirubinemia (非抱合型高ビリルビン血症)","severe hyperbilirubinemia (重症高ビリルビン血症)","treat hyperbilirubinemia (高ビリルビン血症を治療する)"],"synonyms":["jaundice (黄疸)","icterus (黄疸)"],"antonyms":[]}],"etymology":{"value":"The word 'hyperbilirubinemia' is derived from the Greek words 'hyper' (excessive), 'bilirubin' (bile pigment), and 'emia' (blood condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˌbɪlɪruːbɪˈniːmiə/","syllables":"hy-per-bil-i-ru-bi-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyperbilirubinemia is a medical term used to describe elevated levels of bilirubin in the blood. Bilirubin is a yellow pigment produced during the normal breakdown of red blood cells. It is typically processed by the liver and excreted in bile. When the liver is unable to process bilirubin effectively, or when there is an excessive breakdown of red blood cells, bilirubin levels in the blood can rise, leading to jaundice. Hyperbilirubinemia is common in newborns because their livers are not yet fully developed. In adults, it can be a sign of liver disease, bile duct obstruction, or other underlying medical conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hyperbilirubin.","correct":"✓ He has hyperbilirubinemia.","note":"Hyperbilirubinemia is the correct term for the condition of having high bilirubin levels in the blood. Hyperbilirubin is not a recognized medical term."},{"incorrect":"✗ Hyperbilirubinemia is a virus.","correct":"✓ Hyperbilirubinemia is a condition.","note":"Hyperbilirubinemia is a condition characterized by elevated bilirubin levels, not an infectious agent like a virus."}],"priority":"★★☆"},"related_words":{"derivatives":["bilirubin (ビリルビン)","jaundice (黄疸)","phototherapy (光線療法)","kernicterus (核黄疸)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Hyperbilirubinemia' is a medical term referring to an elevated level of bilirubin in the blood. Bilirubin is a yellow pigment created during the breakdown of red blood cells. This condition is often observed in newborns due to immature liver function, but can also occur in adults as a result of liver disease or other medical issues. If bilirubin levels are too high, it can lead to jaundice, characterized by yellowing of the skin and eyes. Treatment options, such as phototherapy, are available to manage this condition. Understanding this term is essential in medical contexts when discussing liver function and related disorders."},"example_sentences":[{"sentence":"The infant was diagnosed with hyperbilirubinemia and required phototherapy.","translation":"その乳児は高ビリルビン血症と診断され、光線療法が必要でした。","type":"medical","meaning_category":"高ビリルビン血症"},{"sentence":"Elevated levels of unconjugated bilirubin can lead to hyperbilirubinemia.","translation":"非抱合型ビリルビンのレベル上昇は高ビリルビン血症につながる可能性があります。","type":"medical","meaning_category":"高ビリルビン血症"},{"sentence":"Prompt treatment of hyperbilirubinemia is crucial to prevent neurological complications.","translation":"神経学的合併症を防ぐためには、高ビリルビン血症の迅速な治療が不可欠です。","type":"medical","meaning_category":"高ビリルビン血症"}]}