{"word":"fogydom","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A hypothetical or theoretical unit of measurement for stupidity or foolishness.","english_definition":"A unit of measurement, often jocular, for quantifying stupidity or foolishness.","examples":[{"sentence":"That decision registers a high fogydom reading.","translation":"その決定は高い愚かさの数値を示す。"},{"sentence":"The politician's statement was off the charts on the fogydom scale.","translation":"その政治家の発言は愚かさの尺度で測定不能だった。"}],"collocations":["high fogydom","low fogydom","fogydom scale","fogydom reading"],"synonyms":["stupidity unit","foolishness quotient"],"antonyms":["genius","wisdom"]}],"etymology":{"value":"Likely a humorous or invented term, possibly derived from 'foggy' (implying confusion) and '-dom' (suffix indicating a state or condition).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈfoʊɡiːdəm/","syllables":"fo-gy-dom"},"inflection":{"noun_plural":"fogydoms"},"usage_notes":{"explanation":"The term 'fogydom' is primarily used in informal or humorous contexts to exaggerate or criticize actions or statements perceived as foolish or unintelligent. It is not a recognized scientific or formal unit of measurement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fogydom of the situation was clear.","correct":"✓ The foolishness of the situation was clear.","note":"'Fogydom' is a made-up unit, so using it in a serious context might sound odd."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism or uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'fogydom' is not a standard English word and is likely to be encountered only in informal or humorous contexts. Understanding its meaning requires inferring it from the context or recognizing it as a playful neologism. It is used to describe a degree of foolishness or stupidity, often in an exaggerated way."},"example_sentences":[{"sentence":"The project's failure was a testament to the sheer fogydom of the planning.","translation":"プロジェクトの失敗は、計画の完全な愚かさの証だった。","type":"noun","meaning_category":"stupidity"},{"sentence":"On a scale of one to ten, his argument registered an eleven on the fogydom meter.","translation":"1から10のスケールで言うと、彼の議論は愚かさメーターで11を記録した。","type":"noun","meaning_category":"stupidity"}]}