{"word":"GEISCO","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Acronym) Government Employees Insurance Company (former name)","english_definition":"An acronym for Government Employees Insurance Company, a large American auto insurance company. This was the former name of the company, now known as GEICO.","examples":[{"sentence":"GEISCO was founded in 1936 to serve U.S. government employees and military personnel.","translation":"GEISCOは、米国政府職員と軍人を対象に1936年に設立されました。"},{"sentence":"The company changed its name from GEISCO to GEICO to better reflect its broader customer base.","translation":"同社は、より幅広い顧客層を反映させるため、GEISCOからGEICOに社名を変更しました。"}],"collocations":["GEISCO insurance","GEISCO policy","formerly GEISCO"],"synonyms":["GEICO"],"antonyms":[]}],"etymology":{"value":"An acronym formed from **G**overnment **E**mployees **I**nsurance **CO**mpany.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡaɪskoʊ/","syllables":"GI-SCO"},"inflection":{},"usage_notes":{"explanation":"GEISCO is an outdated name for GEICO (Government Employees Insurance Company). While the acronym GEISCO is technically correct, it is rarely used today. GEICO is the standard and recognized name. When referring to the company, it is always best to use GEICO, unless you are specifically discussing the company's history and its original name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a GEISCO insurance policy.","correct":"✓ I have a GEICO insurance policy.","note":"Use GEICO, the current name of the company."}],"priority":"★★★"},"related_words":{"derivatives":["GEICO"],"phrasal_verbs":[],"related_companies":[]},"level_frequency":{"frequency_google_ngram":"Low frequency (historical context only)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'GEISCO' is an acronym that refers to the former name of the insurance company now known as GEICO. It is primarily encountered in historical contexts or when discussing the company's origins. Since the company is now universally known as GEICO, using 'GEISCO' may cause confusion unless the context makes it clear that you are referring to the company's past. Therefore, it's more appropriate to use 'GEICO' in most situations."},"example_sentences":[{"sentence":"In the early days, GEISCO primarily served government employees.","translation":"初期の頃、GEISCOは主に政府職員を対象としていました。","type":"noun","meaning_category":"historical context"},{"sentence":"The transition from GEISCO to GEICO marked a significant shift in the company's marketing strategy.","translation":"GEISCOからGEICOへの移行は、同社のマーケティング戦略における重要な転換点となりました。","type":"noun","meaning_category":"historical context"}]}