{"word":"Precertification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医療)事前承認、事前認定：特定の医療サービスや治療を受ける前に、保険会社から必要な承認を得るプロセス","english_definition":"(Healthcare) The process of obtaining authorization from an insurance company before receiving certain medical services or treatments.","examples":[{"sentence":"The doctor's office handled the precertification process for the MRI.","translation":"医師のオフィスがMRIの事前承認手続きを行った。"},{"sentence":"Many insurance plans require precertification for expensive procedures.","translation":"多くの保険プランでは、高額な処置に対して事前承認が義務付けられている。"},{"sentence":"Without precertification, the insurance company may not cover the cost of the treatment.","translation":"事前承認がない場合、保険会社は治療費を負担しない可能性がある。"}],"collocations":["require precertification (事前承認を必要とする)","obtain precertification (事前承認を得る)","precertification process (事前承認プロセス)","precertification form (事前承認フォーム)","precertification number (事前承認番号)"],"synonyms":["prior authorization","preapproval","preauthorization"],"antonyms":["post-authorization"],"related_terms":["deductible","co-pay","insurance claim"]}],"etymology":{"value":"「pre-」（事前に）と「certification」（認定）の組み合わせ。医療保険業界で、費用のかかる医療サービスが本当に必要かどうかを事前に判断するために生まれた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːsɜːrtɪfɪˈkeɪʃən/","syllables":"pre-cer-ti-fi-ca-tion"},"inflection":{"noun_plural":"precertifications"},"usage_notes":{"explanation":"Precertification is a common requirement in many health insurance plans. It helps insurance companies manage costs and ensure that patients receive appropriate and necessary care. Patients should always check with their insurance provider to determine if precertification is needed for a particular service.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I don't need a prescription, just a precertification.","correct":"✓ I don't need a referral, just a precertification.","note":"Precertification is often confused with a prescription or referral, but it is a separate process involving insurance approval."},{"incorrect":"✗ The doctor can guarantee precertification.","correct":"✓ The doctor can assist with the precertification process, but approval is up to the insurance company.","note":"Doctors can help with the paperwork, but the final decision on precertification rests with the insurance company."}],"priority":"★★☆"},"related_words":{"derivatives":["precertify (verb)"],"related_terms":["authorization","verification","insurance coverage","medical necessity","utilization review"]},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency (医療保険業界で使われる専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Precertification' is a specialized term primarily used within the healthcare and insurance industries. It refers to the process of obtaining approval from an insurance company before receiving specific medical services or treatments. This process is often required for more expensive procedures to ensure medical necessity and cost management. Understanding this term is crucial for navigating healthcare coverage and avoiding unexpected out-of-pocket expenses."},"example_sentences":[{"sentence":"Before scheduling the surgery, make sure to obtain precertification from your insurance provider.","translation":"手術の予約をする前に、必ず保険会社から事前承認を得てください。","type":"general"},{"sentence":"The hospital's billing department can assist you with the precertification paperwork.","translation":"病院の請求部門が事前承認の書類手続きをお手伝いします。","type":"general"},{"sentence":"Failure to obtain precertification may result in denial of coverage.","translation":"事前承認を得られなかった場合、保険給付が拒否される可能性があります。","type":"general"}]}