{"word":"ureteroenteric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"尿管腸吻合の、尿管と腸の間の","english_definition":"Relating to or involving the surgical anastomosis (connection) of a ureter to the intestine.","examples":[{"sentence":"Ureteroenteric anastomosis is a surgical procedure used in urinary diversion.","translation":"尿管腸吻合は、尿路変更術で用いられる外科的手術です。"},{"sentence":"Complications of ureteroenteric anastomosis can include electrolyte imbalances.","translation":"尿管腸吻合の合併症には、電解質異常などが含まれます。"}],"collocations":["ureteroenteric anastomosis","ureteroenteric implantation","ureteroenteric diversion"],"synonyms":["ureterointestinal"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'uretero-' (referring to the ureter), 'enteric' (referring to the intestine), and '-ic' (adjectival suffix).","priority":"★★★"},"pronunciation":{"ipa":"/juˌriːtəroʊˌɛnˈtɛrɪk/","syllables":"u-re-ter-o-en-ter-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'ureteroenteric' is primarily used in medical contexts, specifically relating to surgical procedures where the ureters are connected to a segment of the intestine. This is typically done as a form of urinary diversion when the bladder is removed or non-functional.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ ureteroenterical","correct":"✓ ureteroenteric","note":"The correct suffix is '-ic', not '-ical'."}],"priority":"★★☆"},"related_words":{"derivatives":["ureter (noun): the tube that carries urine from the kidney to the bladder","intestine (noun): the part of the alimentary canal between the stomach and the anus","anastomosis (noun): a surgical connection between two structures"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ureteroenteric' is a highly specialized medical term. Understanding requires knowledge of anatomy (ureter, intestine) and surgical procedures (anastomosis). It is predominantly found in medical texts and discussions related to urology and surgical interventions for urinary diversion. General English speakers are unlikely to encounter this word.","priority":"★★★"},"example_sentences":[{"sentence":"The patient underwent a ureteroenteric anastomosis following bladder cancer surgery.","translation":"患者は膀胱癌手術後、尿管腸吻合術を受けた。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Ureteroenteric complications can be managed with careful monitoring of electrolyte levels.","translation":"尿管腸吻合の合併症は、電解質レベルの注意深いモニタリングによって管理できます。","type":"medical","meaning_category":"complications"}]}