{"word":"Rockbird","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー)伝説上の鳥、または巨大な鳥","english_definition":"(Fantasy) A mythical or gigantic bird, often depicted as being large and powerful enough to carry off large animals.","examples":[{"sentence":"The Rockbird is said to nest on inaccessible cliffs.","translation":"ロックバードは近づけない崖に巣を作ると言われている。"},{"sentence":"In some legends, the Rockbird is capable of carrying off elephants.","translation":"いくつかの伝説では、ロックバードは象を運び去ることができる。"}],"collocations":["Rockbird nest","Rockbird legend","Giant Rockbird"],"synonyms":["Roc","Giant Eagle","Thunderbird"],"antonyms":[]}],"etymology":{"value":"The term 'Rockbird' is often associated with the 'Roc' from Middle Eastern folklore, which itself may derive from accounts of real birds such as eagles or vultures. The 'Rock' part likely refers to the bird's nesting habits on cliffs and rocky areas.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒkˌbɜːrd/","syllables":"Rock-bird"},"inflection":{"noun_plural":"Rockbirds"},"usage_notes":{"explanation":"'Rockbird' is primarily used in fantasy literature, mythology, and fictional contexts. It is not a term used in ornithology to describe any real species of bird. The term evokes images of immense, powerful birds capable of extraordinary feats.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a rockbird in my backyard.","correct":"✓ I saw a hawk in my backyard.","note":"Rockbirds are mythical creatures and do not exist in reality. If you saw a bird in your backyard, it was likely a real bird species."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily found in fantasy literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Rockbird' is a term primarily encountered in fantasy and mythological contexts. It refers to a large, mythical bird, often depicted as being powerful enough to carry off large animals. Due to its specific usage in fiction, it is not a common term in everyday language."},"example_sentences":[{"sentence":"The hero battled the Rockbird to save the princess.","translation":"英雄は王女を救うためにロックバードと戦った。","type":"noun","meaning_category":"Mythical Bird"},{"sentence":"Illustrations of the Rockbird often show it with a massive wingspan.","translation":"ロックバードのイラストは、しばしば巨大な翼幅で描かれている。","type":"noun","meaning_category":"Mythical Bird"}]}