{"word":"non-partisanship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超党派、無党派性、公平性","english_definition":"The state of not being biased toward any particular political party or group; impartiality.","examples":[{"sentence":"The organization prides itself on its non-partisanship.","translation":"その組織は、超党派であることを誇りとしている。"},{"sentence":"The judge is known for his non-partisanship in legal matters.","translation":"その裁判官は、法的事項における公平性で知られている。"},{"sentence":"Maintaining non-partisanship is crucial for the integrity of the election process.","translation":"選挙プロセスの完全性を保つためには、無党派性を維持することが重要である。"}],"collocations":["maintain non-partisanship (無党派性を維持する)","ensure non-partisanship (無党派性を確保する)","demonstrate non-partisanship (無党派性を示す)","political non-partisanship (政治的無党派性)","strict non-partisanship (厳格な無党派性)"],"synonyms":["impartiality","neutrality","objectivity","fairness","independence"],"antonyms":["partisanship","bias","partiality","favoritism"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'partisanship,' which refers to support for a particular party or cause.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌpɑːrtɪˈzænʃɪp/","syllables":"non-par-ti-zan-ship"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Non-partisanship' refers to the quality of being neutral and unbiased, especially in political matters. It is often used to describe organizations, individuals, or processes that do not favor any particular political party or ideology. It's important in maintaining fairness and trust in systems like elections, legal proceedings, and public services.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of partisanship, so he's not non-partisanship.","correct":"✓ He showed a lot of partisanship, so he's not non-partisan.","note":"'Non-partisanship' is a noun (the state of being non-partisan), while 'non-partisan' is an adjective (describing someone or something that is without bias)."},{"incorrect":"✗ The non-partisanship organization.","correct":"✓ The non-partisan organization.","note":"Use the adjective 'non-partisan' to describe the organization."}],"priority":"★★☆"},"related_words":{"derivatives":["non-partisan (adjective: 超党派の、無党派の)","partisan (noun: 党派の支持者、形容詞: 党派的な)","partisanship (noun: 党派性)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in political and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Non-partisanship' is a formal term that describes the quality of being impartial and not favoring any particular political party. It's often used in discussions about politics, elections, and government. Understanding this term is important for comprehending discussions about fairness and objectivity in these contexts. It is the state of being 'non-partisan,' which is an adjective describing something or someone that is impartial."},"example_sentences":[{"sentence":"The commission aimed to provide a non-partisan assessment of the economic situation.","translation":"委員会は、経済状況に関する超党派的な評価を提供することを目指した。","type":"noun","meaning_category":"公平性"},{"sentence":"The report emphasized the importance of non-partisanship in the civil service.","translation":"その報告書は、公務員における無党派性の重要性を強調した。","type":"noun","meaning_category":"無党派性"},{"sentence":"To ensure fairness, the election observers maintained strict non-partisanship.","translation":"公平性を確保するため、選挙監視員は厳格な無党派性を維持した。","type":"noun","meaning_category":"公平性"}]}