{"word":"electric-start","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"電気始動式の","english_definition":"Having an electric starter motor for starting an engine.","examples":[{"sentence":"My new motorcycle has an electric-start, so it's very easy to turn on.","translation":"私の新しいバイクは電気始動式なので、とても簡単にエンジンをかけられます。"},{"sentence":"This lawnmower features both a pull-start and an electric-start option.","translation":"この芝刈り機は、プルスタートと電気始動式の両方のオプションを備えています。"}],"collocations":["electric-start engine","electric-start system","electric-start model"],"synonyms":["self-starting","push-button start"],"antonyms":["kick-start","manual start"]},{"part_of_speech":"noun","definition":"電気始動（装置）","english_definition":"A system for starting an engine using an electric motor.","examples":[{"sentence":"The convenience of an electric-start is worth the extra cost for many riders.","translation":"電気始動の便利さは、多くのライダーにとって追加費用を払う価値があります。"},{"sentence":"He upgraded his old motorcycle with an electric-start.","translation":"彼は古いバイクを電気始動にアップグレードしました。"}],"collocations":["install an electric-start","electric-start conversion","electric-start kit"],"synonyms":["electric starter","self-starter"],"antonyms":["kick starter","manual starter"]}],"etymology":{"value":"Combination of 'electric' and 'start', indicating a starting mechanism powered by electricity.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈlɛktrɪk stɑːrt/","syllables":"e-lec-tric start"},"inflection":{"notes":"The word 'electric-start' does not change form for pluralization or verb conjugation, as it functions primarily as an adjective or noun.","priority":"★★★"},"usage_notes":{"explanation":"'Electric-start' is commonly used to describe engines, vehicles, or equipment that can be started with the push of a button or the turn of a key, rather than requiring a manual pull-cord or kick-start.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The electric start is more easy than the kick start.","correct":"✓ The electric start is easier than the kick start.","note":"'Easy' is already an adjective, so it should be compared using its comparative form, 'easier'."},{"incorrect":"✗ The motorcycle have electric start.","correct":"✓ The motorcycle has electric start.","note":"The subject 'motorcycle' is singular, so the verb should be 'has' instead of 'have'."}],"priority":"★★★"},"related_words":{"derivatives":["electric","start","starter","motor"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"B2","text":"The term 'electric-start' is a compound word used to describe a feature in engines or vehicles. It indicates that the engine can be started using an electric motor, typically by pushing a button or turning a key, rather than requiring a manual method like a pull cord or kick-start. This term is commonly found in technical descriptions of motorcycles, cars, lawnmowers, and other engine-powered equipment. Understanding this term requires familiarity with basic mechanical concepts and vocabulary related to engines and vehicles."},"example_sentences":[{"sentence":"The new scooter comes standard with an electric-start for added convenience.","translation":"その新しいスクーターには、利便性を高めるために電気始動が標準装備されています。","type":"adjective","meaning_category":"Feature description"},{"sentence":"Replacing the old kick-start with an electric-start made the motorcycle much easier to use.","translation":"古いキックスタートを電気始動に交換したことで、バイクがはるかに使いやすくなりました。","type":"noun","meaning_category":"Upgrade"}]}