{"word":"Emotivism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"情動主義、感情主義：倫理的判断は事実を述べているのではなく、感情の表現であるという倫理学の理論。","english_definition":"The meta-ethical view that ethical sentences do not express propositions but emotional attitudes.","examples":[{"sentence":"Emotivism suggests that when we say 'Stealing is wrong,' we are merely expressing our disapproval of stealing.","translation":"情動主義は、「盗むことは悪い」と言うとき、私たちは単に盗むことへの不承認を表現しているに過ぎないことを示唆します。"},{"sentence":"According to emotivism, ethical statements are neither true nor false.","translation":"情動主義によれば、倫理的言明は真でも偽でもありません。"}],"collocations":["ethical emotivism","logical emotivism","expressive emotivism"],"synonyms":["expressivism","subjectivism (related)"],"antonyms":["cognitivism","moral realism","objectivism"]}],"etymology":{"value":"'Emotion'（感情）と '-ism'（主義）の組み合わせ。倫理的判断が感情に基づくと考える立場を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmoʊtɪˌvɪzəm/","syllables":"e-mo-ti-vi-sm"},"inflection":{"noun_plural":"Emotivisms"},"usage_notes":{"explanation":"Emotivism is a meta-ethical theory, meaning it's a theory about the nature of ethical judgments, rather than a theory about what is right or wrong. It contrasts with cognitivist theories, which hold that ethical statements express beliefs that can be true or false. Emotivists argue that ethical statements are more like expressions of feeling or attempts to persuade.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Emotivism is a system of morals.","correct":"✓ Emotivism is a theory about the meaning of moral statements.","note":"Emotivism doesn't provide a system of morals, but rather a theory about the meaning of moral statements."},{"incorrect":"✗ Emotivism proves that there are no moral facts.","correct":"✓ Emotivism argues that moral statements do not express facts.","note":"Emotivism is an argument about the nature of moral statements, not a proof about the existence or non-existence of moral facts."}],"priority":"★★☆"},"related_words":{"derivatives":["emotive","emotion","expressivism"],"related_terms":["meta-ethics","normative ethics","moral philosophy","ethical theory"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Emotivism is a philosophical idea about how we use words like 'good' and 'bad.' It says that when we say something is 'good,' we're not really saying a fact about it. Instead, we're just showing our feelings about it, like saying 'hooray!' or 'boo!' It's different from thinking that 'good' means something real that we can find out about. This idea is mostly talked about in philosophy classes."},"example_sentences":[{"sentence":"The speaker's emotivism was evident in his passionate defense of animal rights.","translation":"講演者の情動主義は、動物の権利に対する彼の情熱的な擁護に明らかでした。","type":"general","meaning_category":"general"},{"sentence":"Critics of emotivism argue that it reduces moral discourse to mere expressions of personal preference.","translation":"情動主義の批判者たちは、それが道徳的な議論を単なる個人的な好みの表現に矮小化すると主張しています。","type":"philosophical","meaning_category":"philosophical"}]}