{"word":"fidei-commissum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（ローマ法）遺言信託、財産管理委託","english_definition":"(Roman law) A testamentary trust; a disposition of property by will to a person (the fiduciary) with a request or direction that such person transfer it to a third person (the fideicommissary).","examples":[{"sentence":"The fidei-commissum was a common method of ensuring property remained within a family.","translation":"遺言信託は、財産が家族内に留まるようにするための一般的な方法でした。"},{"sentence":"Under the terms of the fidei-commissum, the fiduciary was obligated to transfer the land to the fideicommissary upon reaching a certain age.","translation":"遺言信託の条件に基づき、受託者は、受益者が一定の年齢に達した時点で土地を移転する義務がありました。"}],"collocations":["establish a fidei-commissum","inherit under a fidei-commissum","terminate a fidei-commissum"],"synonyms":["testamentary trust","trust","inheritance"],"antonyms":[]}],"etymology":{"value":"From Latin *fidei commissum*, from *fidei* (of faith, dative of *fides* 'faith') + *commissum* (something entrusted, neuter past participle of *committere* 'to entrust').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪdeɪ kəˈmɪsəm/","syllables":"fi-de-i-com-mis-sum"},"inflection":{"noun_plural":"fidei-commissa"},"usage_notes":{"explanation":"A *fidei-commissum* is a legal term, primarily used in Roman law and legal systems derived from it, referring to a form of trust created in a will. The testator leaves property to one person (the fiduciary) with the instruction that they pass it on to another person (the fideicommissary) at a later time. This was often used to circumvent legal restrictions or to provide for individuals who could not directly inherit property.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He created a fidei-commissum for his son's wife.","correct":"✓ He created a fidei-commissum for his son, with his son's wife as the fideicommissary.","note":"The fidei-commissum is the trust itself. The person who receives the property initially is the fiduciary, and the person who eventually receives it is the fideicommissary."}],"priority":"★☆☆"},"related_words":{"derivatives":["fiduciary","fideicommissary"],"phrases":["Roman law","testamentary trust","trust law"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語 (legal term).","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *fidei-commissum* refers to a specific legal construct within Roman law, representing a testamentary trust where property is bequeathed to a fiduciary who is then obligated to transfer it to a fideicommissary. This concept is highly specialized and primarily encountered in legal or historical contexts related to Roman or civil law traditions. Its usage is infrequent outside of these specific domains. Understanding requires familiarity with legal terminology and historical legal systems."},"example_sentences":[{"sentence":"The lawyer explained the intricacies of the fidei-commissum to the client.","translation":"弁護士は、遺言信託の複雑な詳細を依頼人に説明しました。","type":"general","meaning_category":"legal"},{"sentence":"The estate was managed according to the terms of the fidei-commissum.","translation":"遺産は、遺言信託の条件に従って管理されました。","type":"legal","meaning_category":"legal"},{"sentence":"The historical study examined the use of fidei-commissa in Roman society.","translation":"その歴史研究は、ローマ社会における遺言信託の使用を調査しました。","type":"historical","meaning_category":"historical"}]}