{"word":"Volapük","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヴォラプュク (人工言語)","english_definition":"Volapük (an artificial language)","examples":[{"sentence":"Volapük was one of the earliest international auxiliary languages.","translation":"ヴォラプュクは、最も初期の国際補助語の一つでした。"},{"sentence":"Few people speak Volapük today.","translation":"今日、ヴォラプュクを話す人はほとんどいません。"}],"collocations":["speak Volapük","learn Volapük","Volapük grammar","Volapük dictionary"],"synonyms":["artificial language","constructed language","international auxiliary language"],"antonyms":[]}],"etymology":{"value":"The name Volapük comes from the language itself: vol ('world') + pük ('language'). It was created in 1879 by Johann Martin Schleyer, a German Catholic priest, who claimed God told him to create an international language.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɒləpʊk/","syllables":"Vo-la-pük"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Volapük is an early example of a constructed international auxiliary language, predating Esperanto. It was intended to be easy to learn and use for international communication, but its complex grammar and vocabulary made it difficult to gain widespread adoption. Today, it is primarily of historical interest.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Volapukese.","correct":"✓ I speak Volapük.","note":"The correct term for the language is 'Volapük,' not 'Volapukese.'"},{"incorrect":"✗ Volapük is a very easy language to learn.","correct":"✓ Volapük was intended to be easy, but its complexity made it difficult to learn.","note":"While Volapük was designed to be easy, its actual complexity made it challenging for many learners."}],"priority":"★★☆"},"related_words":{"derivatives":["Volapükist (noun: a speaker or supporter of Volapük)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Volapük' is a specialized term referring to a specific constructed language. Understanding its historical context and purpose requires a higher level of reading comprehension.","priority":"★★☆"},"example_sentences":[{"sentence":"The Volapük movement gained some popularity in the late 19th century.","translation":"ヴォラプュク運動は19世紀後半にいくらか人気を博しました。","type":"noun","meaning_category":"人工言語"},{"sentence":"He is studying Volapük for a research project on constructed languages.","translation":"彼は構築言語に関する研究プロジェクトのためにヴォラプュクを学んでいます。","type":"noun","meaning_category":"人工言語"}]}