{"word":"largeheartedness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"寛大さ、心が広いこと、太っ腹","english_definition":"the quality of being generous, kind, and forgiving; magnanimity.","examples":[{"sentence":"Her largeheartedness was evident in her willingness to help anyone in need.","translation":"彼女の寛大さは、困っている人なら誰でも助けようとする意欲に明らかだった。"},{"sentence":"He showed great largeheartedness in forgiving his friend's betrayal.","translation":"彼は友人の裏切りを許す際に、非常に寛大な心を示した。"},{"sentence":"The charity is known for its largeheartedness in supporting various causes.","translation":"その慈善団体は、様々な活動を支援する寛大さで知られている。"}],"collocations":["show largeheartedness","demonstrate largeheartedness","act with largeheartedness","admire someone's largeheartedness","appreciate someone's largeheartedness"],"synonyms":["generosity","magnanimity","benevolence","kindness","compassion","altruism","charity","openhandedness"],"antonyms":["meanness","stinginess","selfishness","narrow-mindedness","illiberality","miserliness"]}],"etymology":{"value":"\"Largeheartedness\" is formed by combining \"largehearted\" (having a generous and kind nature) with the suffix \"-ness\" (denoting a state or quality). \"Largehearted\" itself is a compound word derived from \"large\" (big, generous) and \"heart\" (the seat of emotions and character).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɑːrdʒˈhɑːrtɪdnəs/","syllables":"large-heart-ed-ness"},"inflection":{"noun_plural":"largeheartednesses (rarely used)"},"usage_notes":{"explanation":"\"Largeheartedness\" is a relatively formal and less common word than its synonyms like \"generosity\" or \"kindness.\" It specifically emphasizes the emotional and moral quality of being generous and forgiving, suggesting a deep-seated character trait rather than a mere act of generosity. The word often implies a willingness to overlook faults and offer support or assistance to others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a person with largeheartedness.","correct":"✓ He is a person of largeheartedness. / ✓ He is a largehearted person.","note":"While both are grammatically correct, \"He is a largehearted person\" is more common and natural. \"He is a person of largeheartedness\" is more formal. Avoid using \"with\" in this context."},{"incorrect":"✗ Her largeheartedness is very good.","correct":"✓ Her largeheartedness is admirable. / ✓ Her largeheartedness is commendable.","note":"\"Good\" is too general. Use stronger adjectives like \"admirable\" or \"commendable\" to describe the quality of largeheartedness."}],"priority":"★☆☆"},"related_words":{"derivatives":["largehearted (adjective): having a generous and kind nature"],"phrasal_verbs":[],"related_concepts":["altruism","humanitarianism","philanthropy","charitable giving","forgiveness","empathy","compassionate love"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (uncommon, but understandable in context)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Largeheartedness\" is a formal word that means being generous, kind, and forgiving. It's not used very often in everyday conversation, but you might find it in books or articles about people who are very compassionate and helpful. It's a more emphatic way of describing someone as having a big heart. It suggests a deep-seated character trait of generosity and a willingness to overlook faults and offer support to others. It is related to concepts like altruism, humanitarianism, and philanthropy."},"example_sentences":[{"sentence":"The organization was praised for its largeheartedness in providing aid to the victims of the earthquake.","translation":"その組織は、地震の犠牲者への援助を提供する寛大さで称賛された。","type":"noun","meaning_category":"寛大さ"},{"sentence":"His largeheartedness extended even to those who had wronged him in the past.","translation":"彼の寛大さは、過去に彼を不当に扱った人々にも及んだ。","type":"noun","meaning_category":"寛大さ"},{"sentence":"She demonstrated remarkable largeheartedness by donating a significant portion of her wealth to charity.","translation":"彼女は自分の富のかなりの部分を慈善団体に寄付することで、注目すべき寛大さを示した。","type":"noun","meaning_category":"寛大さ"},{"sentence":"The community admired the mayor's largeheartedness in addressing the needs of the underprivileged.","translation":"地域社会は、恵まれない人々のニーズに取り組む市長の寛大さを称賛した。","type":"noun","meaning_category":"寛大さ"},{"sentence":"Largeheartedness is a virtue that can inspire positive change in the world.","translation":"寛大さは、世界に前向きな変化をもたらすことができる美徳である。","type":"noun","meaning_category":"寛大さ"}]}