{"word":"Ganoine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガノイン：古代魚の鱗に見られる、光沢のあるエナメル質の層","english_definition":"A shiny, enamel-like tissue found on the scales of some extinct and primitive fishes.","examples":[{"sentence":"The scales of the Polypteridae are covered with ganoine.","translation":"ポリプテルス科の魚の鱗はガノインで覆われている。"},{"sentence":"Ganoine is harder than bone and is thought to provide protection.","translation":"ガノインは骨よりも硬く、保護の役割を果たすと考えられている。"}],"collocations":["ganoine layer","ganoine scales"],"synonyms":["enameloid"],"antonyms":[]}],"etymology":{"value":"Derived from 'ganos' (Greek for brightness or sheen) + '-ine' (a suffix used in mineralogy and chemistry).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡæˌnɔɪn/","syllables":"Ga-no-ine"},"inflection":{"noun_plural":"Ganoines"},"usage_notes":{"explanation":"Ganoine is a specialized tissue found only in certain types of fish, primarily ancient or primitive species. It is not found in modern bony fishes. It is composed of enamel-like material and is harder than bone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scales are made of bone, not ganoine.","correct":"✓ The scales are covered in ganoine, which is different from bone.","note":"Ganoine is a distinct tissue, not a replacement for bone. It's a surface layer on scales."}],"priority":"★☆☆"},"related_words":{"derivatives":["ganoid (adjective/noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ganoine' is a highly specialized term in zoology and paleontology, referring to a specific type of enamel-like tissue found on the scales of certain ancient fish. Understanding this term requires a background in these scientific fields. It is not commonly used outside of these contexts."},"example_sentences":[{"sentence":"The fossil fish exhibited a well-preserved layer of ganoine on its scales.","translation":"その化石魚は、鱗に保存状態の良いガノインの層を示していた。","type":"noun","meaning_category":"tissue"},{"sentence":"The presence of ganoine is a characteristic feature of ganoid fishes.","translation":"ガノインの存在は、ガノイド魚類の特徴的な特徴である。","type":"noun","meaning_category":"tissue"}]}