{"word":"Phymatorhysin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A neurotoxin protein found in the venom of the jellyfish *Physalia physalis* (Portuguese man o' war).","english_definition":"A neurotoxic protein found in the venom of the jellyfish *Physalia physalis* (Portuguese man o' war).","examples":[{"sentence":"Phymatorhysin is responsible for the severe pain and systemic effects associated with Portuguese man o' war stings.","translation":"フィマトリシンは、カツオノエボシの刺傷に関連する激しい痛みと全身症状の原因である。"}],"collocations":["phymatorhysin injection","phymatorhysin toxicity","phymatorhysin venom"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from *Physalia* (the genus of the Portuguese man o' war) and *rhysin* (referring to its toxic properties).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪmətoʊˈraɪsɪn/","syllables":"Phy-ma-to-rhy-sin"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Phymatorhysin is a complex protein that acts as a potent neurotoxin. It is a key component of the venom of the Portuguese man o' war, contributing to the painful and sometimes dangerous effects of its sting. Research is ongoing to understand its mechanism of action and develop effective treatments for envenomation.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["physalia","toxin","neurotoxin","venom"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Phymatorhysin' is a highly specialized term in the field of toxicology and marine biology, specifically related to the venom of the Portuguese man o' war. It is unlikely to be encountered outside of scientific or medical contexts. Understanding requires advanced knowledge of protein structures, neurotoxins, and marine organisms."},"example_sentences":[{"sentence":"The researchers isolated phymatorhysin from the venom samples.","translation":"研究者たちは、毒液サンプルからフィマトリシンを分離した。","type":"scientific","meaning_category":"neurotoxin"},{"sentence":"Studies suggest that phymatorhysin disrupts neuronal signaling.","translation":"研究によると、フィマトリシンはニューロンシグナル伝達を阻害する。","type":"scientific","meaning_category":"neurotoxin"}]}