{"word":"pharmaco-tolerant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"薬物耐性のある、薬物寛容性のある","english_definition":"Exhibiting tolerance to a drug; requiring a higher dose of a drug to achieve the same effect.","examples":[{"sentence":"The patient became pharmaco-tolerant to the pain medication, requiring increasingly higher doses.","translation":"患者は鎮痛剤に対して薬物耐性を持つようになり、より高い投与量を必要とするようになった。"},{"sentence":"Long-term use of certain medications can lead to the development of pharmaco-tolerant states.","translation":"特定の薬物の長期使用は、薬物耐性の状態の発達につながる可能性がある。"}],"collocations":["develop pharmaco-tolerance","pharmaco-tolerant state","pharmaco-tolerant to opioids","pharmaco-tolerant to benzodiazepines"],"synonyms":["drug-tolerant","tolerant to medication"],"antonyms":["pharmaco-sensitive","drug-sensitive"]}],"etymology":{"value":"'Pharmaco-' is a combining form relating to drugs or medicine, derived from the Greek 'pharmakon' (drug, poison, spell). 'Tolerant' comes from the Latin 'tolerare' (to bear, endure). Therefore, 'pharmaco-tolerant' literally means 'bearing or enduring drugs'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrməkəʊˈtɒlərənt/","syllables":"phar-ma-co-tol-er-ant"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible (more pharmaco-tolerant, most pharmaco-tolerant), but less common."},"usage_notes":{"explanation":"'Pharmaco-tolerant' describes a state where an individual's response to a drug is reduced, requiring a higher dose to achieve the desired effect. This is different from drug resistance, which usually refers to microorganisms' ability to withstand the effects of a drug. 'Pharmaco-tolerance' typically develops over time with repeated exposure to a drug.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria are pharmaco-tolerant to the antibiotic.","correct":"✓ The bacteria are resistant to the antibiotic.","note":"Pharmaco-tolerance refers to a decreased response in an individual, while resistance refers to a microorganism's ability to withstand a drug."},{"incorrect":"✗ He is pharmaco-tolerant, so he needs to stop taking the medication.","correct":"✓ He is pharmaco-tolerant, so his dosage may need to be adjusted.","note":"Pharmaco-tolerance doesn't necessarily mean stopping the medication, but rather adjusting the dosage to maintain effectiveness."}],"priority":"★★☆"},"related_words":{"derivatives":["pharmaco-tolerance (noun)","pharmaco-kinetics","pharmaco-dynamics"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical Vocabulary)","frequency_google_ngram":"Low frequency (Specialized vocabulary)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pharmaco-tolerant' is a specialized term used in medicine and pharmacology. It describes a situation where a person's body becomes less responsive to a drug over time, requiring higher doses to achieve the same therapeutic effect. This term is commonly used when discussing pain management, addiction, and the long-term effects of certain medications. It's important to distinguish it from 'drug resistance,' which typically applies to microorganisms."},"example_sentences":[{"sentence":"The patient's increasing need for higher doses of morphine indicated that he was becoming pharmaco-tolerant.","translation":"患者のモルヒネの投与量が増加していることは、彼が薬物耐性を持つようになっていることを示していた。","type":"adjective","meaning_category":"薬物耐性"},{"sentence":"Understanding the mechanisms of pharmaco-tolerance is crucial for developing effective treatment strategies.","translation":"薬物耐性のメカニズムを理解することは、効果的な治療戦略を開発するために重要である。","type":"adjective","meaning_category":"薬物耐性"},{"sentence":"Pharmaco-tolerant individuals may experience withdrawal symptoms if they suddenly stop taking their medication.","translation":"薬物耐性のある人は、薬を急に止めると離脱症状を経験することがある。","type":"adjective","meaning_category":"薬物耐性"}]}