{"word":"Justiciability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"裁判可能性、司法審査適格性","english_definition":"The quality of being appropriate or suitable for judicial evaluation or resolution; the doctrine that excludes certain cases from judicial consideration because of their abstractness, hypothetical nature, or political character, or because they are brought by parties without standing to raise them.","examples":[{"sentence":"The court considered the justiciability of the claim before addressing its merits.","translation":"裁判所は、その主張のメリットを検討する前に、裁判可能性を検討した。"},{"sentence":"One of the key issues in the case was whether it presented a justiciable question.","translation":"この訴訟の重要な問題の一つは、それが裁判可能な問題であるかどうかだった。"},{"sentence":"The doctrine of justiciability ensures that courts do not overstep their constitutional role.","translation":"裁判可能性の原則は、裁判所が憲法上の役割を踏み越えないようにする。"}],"collocations":["standing and justiciability (当事者適格と裁判可能性)","issue of justiciability (裁判可能性の問題)","lack of justiciability (裁判可能性の欠如)","mootness and justiciability (陳腐化と裁判可能性)"],"synonyms":["suitability for adjudication","appropriateness for judicial review","fitness for judicial determination"],"antonyms":["non-justiciability","political question doctrine","lack of standing"]},{"part_of_speech":"noun","definition":"(法律) 司法判断の対象となりうる性質","english_definition":"The state or condition of being subject to legal judgment or judicial review.","examples":[{"sentence":"The justiciability of the dispute was challenged by the defendant.","translation":"紛争の司法判断可能性は被告によって異議が唱えられた。"},{"sentence":"The court determined the justiciability of the matter based on established legal principles.","translation":"裁判所は確立された法的原則に基づいて、その問題の司法判断可能性を判断した。"}],"collocations":["determine justiciability (裁判可能性を決定する)","challenge justiciability (裁判可能性に異議を唱える)","establish justiciability (裁判可能性を確立する)"],"synonyms":["adjudicability","reviewability"],"antonyms":["non-adjudicability","non-reviewability"]}],"etymology":{"value":"Derived from \"justiciable,\" which comes from the Latin \"justitia\" (justice) + \"-able\" (capable of). The suffix \"-ity\" transforms the adjective into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒʌˌstɪʃiəˈbɪləti/","syllables":"jus-ti-ci-a-bil-i-ty"},"inflection":{"noun_plural":"justiciabilities (rarely used)"},"usage_notes":{"explanation":"\"Justiciability\" is a legal term that refers to whether a court has the authority to hear a particular case. It involves various doctrines, including standing, ripeness, mootness, and the political question doctrine. A case must be justiciable for a court to exercise its jurisdiction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The justiciability was clear.","correct":"✓ The justiciability of the case was clear.","note":"It's better to specify what the justiciability refers to (e.g., \"the justiciability of the case\")."},{"incorrect":"✗ The judge decided the case had no justiciability.","correct":"✓ The judge decided the case lacked justiciability.","note":"Use \"lack of justiciability\" rather than \"no justiciability.\""}],"priority":"★★☆"},"related_words":{"derivatives":["justiciable (adjective)","non-justiciable (adjective)"],"phrases":["political question doctrine","standing","ripeness","mootness"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Justiciability\" is a complex legal term indicating whether a case is suitable for a court to hear and decide. It's not just about whether the court *can* hear the case, but whether it *should*, considering factors like whether the issue is concrete and not hypothetical, whether the person bringing the case has a real stake in the outcome, and whether the issue is more appropriately decided by another branch of government (like the legislature or executive). It's a high-level concept used primarily in legal contexts."},"example_sentences":[{"sentence":"The plaintiffs had to establish the justiciability of their claims before the court could proceed.","translation":"原告は、裁判所が手続きを進める前に、彼らの主張の裁判可能性を確立しなければならなかった。","type":"general","meaning_category":"suitability for judicial evaluation"},{"sentence":"The Supreme Court often grapples with questions of justiciability in cases involving foreign policy.","translation":"最高裁判所は、外交政策に関わる訴訟において、裁判可能性の問題にしばしば取り組む。","type":"legal","meaning_category":"judicial review"},{"sentence":"The issue of justiciability arose because the case involved a hypothetical injury.","translation":"その訴訟が仮想的な損害に関わるため、裁判可能性の問題が生じた。","type":"legal","meaning_category":"judicial determination"}]}