{"word":"assertive-looking","meanings":[{"part_of_speech":"adjective","definition":"自信があり、自己主張が強いように見える","english_definition":"appearing confident and forceful; conveying a sense of self-assurance and willingness to express one's opinions or needs.","examples":[{"sentence":"The CEO was an assertive-looking woman who commanded respect.","translation":"そのCEOは、尊敬を集める、自信があり自己主張が強いように見える女性だった。"},{"sentence":"He wanted to project an assertive-looking image during the negotiation.","translation":"彼は交渉中に、自信があり自己主張が強いように見えるイメージを打ち出したかった。"},{"sentence":"The assertive-looking candidate won the debate.","translation":"自信があり自己主張が強いように見える候補者が討論会で勝利した。"}],"collocations":["assertive-looking person","assertive-looking posture","assertive-looking expression","assertive-looking style"],"synonyms":["confident","self-assured","forceful","bold","dominant","self-assertive"],"antonyms":["meek-looking","submissive-looking","timid-looking","unassuming-looking","shy-looking"]},{"part_of_speech":"adjective","definition":"（外見が）積極的で断定的であるように見える","english_definition":"Having an appearance that suggests a proactive and decisive nature.","examples":[{"sentence":"The assertive-looking design of the building conveyed a sense of power and stability.","translation":"その建物の積極的で断定的であるように見えるデザインは、力強さと安定感を与えた。"},{"sentence":"The assertive-looking font made the advertisement stand out.","translation":"その積極的で断定的であるように見えるフォントは、広告を目立たせた。"}],"collocations":["assertive-looking design","assertive-looking font","assertive-looking presentation"],"synonyms":["bold","striking","prominent","emphatic"],"antonyms":["understated","subtle","restrained"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"assertive\" (expressing opinions or desires strongly and confidently) and \"looking\" (having a particular appearance).","priority":"★★★"},"pronunciation":{"ipa":"/əˈsɜːrtɪv ˈlʊkɪŋ/","syllables":"as-ser-tive-look-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, so there are no different forms for singular or plural. It can be used in comparative and superlative constructions (more assertive-looking, most assertive-looking), though this is less common."},"usage_notes":{"explanation":"\"Assertive-looking\" describes someone or something that gives the impression of being confident, self-assured, and not afraid to express themselves or take charge. It focuses on the visual impression rather than the actual behavior or personality. The term is often used to describe people, but can also be applied to designs, buildings, or other visual elements that convey a sense of strength and decisiveness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is assertive-looking, but actually very shy.","correct":"✓ He is assertive-looking, but actually very shy.","note":"The sentence is grammatically correct, but it highlights the difference between appearance and reality. \"Assertive-looking\" describes the appearance, not necessarily the actual personality. This is a valid usage."},{"incorrect":"✗ She has an assertive-looking personality.","correct":"✓ She has an assertive personality. / ✓ She has an assertive-looking appearance.","note":"\"Assertive-looking\" describes appearance, not personality. Use \"assertive\" for personality or \"assertive-looking appearance\" to describe how her personality manifests visually."}],"priority":"★★☆"},"related_words":{"derivatives":["assertively (adverb)","assertiveness (noun)"],"related_terms":["confident-looking","powerful-looking","strong-looking","commanding-looking"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (due to the combination of words and the nuanced meaning)","frequency_google_ngram":"Relatively low frequency, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"assertive-looking\" is used to describe someone or something that has an appearance of confidence and strength. It suggests that the person or object visually conveys a sense of self-assurance and a willingness to express their opinions or take charge. This term is more nuanced than simply saying someone is \"assertive,\" as it focuses specifically on the visual impression they create. It's often used to describe someone's demeanor or the design of something that is meant to project authority or confidence.","priority":"★★★"},"example_sentences":[{"sentence":"The lawyer had an assertive-looking demeanor that put the witness on edge.","translation":"その弁護士は、証人を緊張させる、自信があり自己主張が強いように見える態度をしていた。","type":"adjective","meaning_category":"自信があり自己主張が強いように見える"},{"sentence":"The company chose an assertive-looking logo to convey a sense of innovation and leadership.","translation":"その会社は、革新性とリーダーシップを伝えるために、積極的で断定的であるように見えるロゴを選んだ。","type":"adjective","meaning_category":"（外見が）積極的で断定的であるように見える"},{"sentence":"Despite his assertive-looking exterior, he was actually quite approachable.","translation":"彼の自信があり自己主張が強いように見える外見にもかかわらず、彼は実際にはとても親しみやすかった。","type":"adjective","meaning_category":"自信があり自己主張が強いように見える"},{"sentence":"The building's assertive-looking facade made it a landmark in the city.","translation":"その建物の積極的で断定的であるように見えるファサードは、都市のランドマークにした。","type":"adjective","meaning_category":"（外見が）積極的で断定的であるように見える"}]}