{"word":"Pangi","meanings":[{"part_of_speech":"noun","definition":"A type of Filipino soup made with taro leaves, meat (usually pork or fish), chili peppers, and coconut milk. It is a specialty dish from the Bicol region of the Philippines.","english_definition":"A Filipino dish, a type of soup originating from the Bicol region, consisting of meat, taro leaves, chili peppers, and coconut milk.","examples":[{"sentence":"We ordered Pangi at the Filipino restaurant.","translation":"フィリピン料理店でパンギを注文しました。"},{"sentence":"Pangi is known for its rich and spicy flavor.","translation":"パンギは濃厚でスパイシーな風味で知られています。"}],"collocations":["eat Pangi","order Pangi","cook Pangi","Bicol Pangi","authentic Pangi"],"synonyms":["Bicol Express (similar dish, but typically uses string beans)"],"antonyms":[],"notes":"The dish is named after the Pangi tree, whose leaves are used to wrap the ingredients before cooking. The leaves impart a unique flavor to the dish but can be toxic if not prepared correctly.","etymology":"The name 'Pangi' comes from the Pangi tree (Pangium edule), whose leaves are used in the dish.","related_words":["gabi (taro leaves)","sili (chili pepper)","ginataan (cooked in coconut milk)","Bicol cuisine"],"level_frequency":{"frequency_google_ngram":"Low frequency, specific to Filipino cuisine.","priority":"★☆☆"}}],"pronunciation":{"ipa":"/ˈpɑːŋi/","syllables":"Pan-gi"},"inflection":{},"usage_notes":{"explanation":"Pangi is a regional dish, so it is not as widely known as other Filipino dishes like adobo or sinigang. When discussing Filipino cuisine, mentioning Pangi can showcase knowledge of regional specialties. It's important to note the potential toxicity of the Pangi leaves if not prepared properly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to try Pangi with adobo sauce.","correct":"✓ I want to try Pangi.","note":"Pangi is already a complete dish with its own distinct sauce and flavor profile. It's not typically served with adobo sauce."}],"priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pangi' refers to a specific Filipino soup from the Bicol region. It contains ingredients like meat, taro leaves, chili peppers, and coconut milk. It's known for its unique flavor, which comes from the Pangi leaves used in its preparation. These leaves need to be prepared carefully because they can be toxic if not cooked correctly. When you see 'Pangi,' think of a flavorful and spicy Filipino soup with a unique regional origin.","priority":"★★☆"},"example_sentences":[{"sentence":"My grandmother makes the best Pangi in our family.","translation":"私の祖母は家族の中で一番美味しいパンギを作ります。","type":"example","meaning_category":"General usage"},{"sentence":"Many tourists visit Bicol to try authentic Pangi.","translation":"多くの観光客が本場のパンギを味わうためにビコルを訪れます。","type":"example","meaning_category":"Culinary tourism"}]}