{"word":"kunkur","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of impure limestone, often nodular, found in India. It is used in road construction and as a source of lime.","english_definition":"An impure, nodular form of limestone found in India, used in road construction and as a source of lime.","examples":[{"sentence":"The road was built using kunkur as a base material.","translation":"その道路は、路盤材としてkunkurを使用して建設されました。"},{"sentence":"Kunkur is often found in alluvial deposits.","translation":"Kunkurは、沖積堆積物によく見られます。"}],"collocations":["kunkur lime","kunkur road","kunkur deposit"],"synonyms":["nodular limestone","calcareous nodules"],"antonyms":[]}],"etymology":{"value":"Originates from the Hindi word 'kankar' or 'kunkar', which refers to the same type of nodular limestone.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌŋkər/","syllables":"kun-kur"},"inflection":{"noun_plural":"kunkurs"},"usage_notes":{"explanation":"'Kunkur' is a specific geological term primarily used in the context of Indian geography and construction. It refers to a particular type of impure limestone that is locally available and utilized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was made of concrete and kunkur.","correct":"✓ The building's foundation used kunkur as a base.","note":"Kunkur is typically used as a base or in road construction, not as a primary building material like concrete."}],"priority":"★☆☆"},"related_words":{"derivatives":["kankar (Hindi spelling variant)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in specific regional and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kunkur' is a specialized term used in geology and civil engineering, particularly in India. It refers to a specific type of impure limestone used in construction. Understanding this term requires familiarity with geological terminology and regional construction practices. It is not a commonly used word in general English.","note":"This term is highly specific and technical, not part of general vocabulary."},"example_sentences":[{"sentence":"The village roads were often surfaced with locally sourced kunkur.","translation":"村の道路は、地元で調達されたkunkurで舗装されることが多かった。","type":"noun","meaning_category":"material"},{"sentence":"Geological surveys identified significant kunkur deposits in the region.","translation":"地質調査により、その地域にかなりのkunkur堆積物が確認された。","type":"noun","meaning_category":"geology"}]}