{"word":"eelblenny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物)タウエガジ","english_definition":"A small, elongated fish of the family Stichaeidae, resembling an eel, typically found in shallow coastal waters.","examples":[{"sentence":"The eelblenny is a common inhabitant of tide pools.","translation":"タウエガジは潮だまりによく見られる生物です。"},{"sentence":"Eelblennies are known for their ability to hide in small crevices.","translation":"タウエガジは小さな隙間に隠れる能力で知られています。"}],"collocations":["tide pool eelblenny","juvenile eelblenny","common eelblenny"],"synonyms":["prickleback","gunnel"],"antonyms":[]}],"etymology":{"value":"A combination of 'eel' (referring to its elongated shape) and 'blenny' (referring to its taxonomic classification within the Blennioidei suborder).","priority":"★★☆"},"pronunciation":{"ipa":"ˈiːlˌblɛni","syllables":"eel-blen-ny"},"inflection":{"noun_plural":"eelblennies"},"usage_notes":{"explanation":"'Eelblenny' is a specific type of fish, so it's primarily used in contexts related to marine biology, zoology, or fishing. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a eelblenny at the aquarium.","correct":"✓ I saw an eelblenny at the aquarium.","note":"'Eelblenny' starts with a vowel sound, so the indefinite article 'an' should be used."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["snake blenny","rock gunnel","Arctic shanny"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'eelblenny' is a specialized term used primarily within the field of marine biology or among aquarium enthusiasts. Understanding and using this term effectively requires a higher level of English proficiency and familiarity with scientific vocabulary. The word itself is descriptive, combining 'eel' and 'blenny' to indicate a fish with eel-like characteristics that belongs to the blenny family."},"example_sentences":[{"sentence":"The diver spotted a colorful eelblenny darting among the rocks.","translation":"ダイバーは、岩の間を走り回るカラフルなタウエガジを見つけました。","type":"noun","meaning_category":"animal"},{"sentence":"Researchers are studying the feeding habits of eelblennies in the local estuary.","translation":"研究者たちは、地元の河口におけるタウエガジの食性を研究しています。","type":"noun","meaning_category":"animal"}]}