{"word":"pericentre","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(天文学)近日点、(一般的に)最も近い点","english_definition":"the point in the orbit of an object orbiting a body that is nearest to the body being orbited.","examples":[{"sentence":"The satellite reached its pericentre at 03:00 UTC.","translation":"その衛星はUTC午前3時に近日点に到達した。"},{"sentence":"The pericentre distance is a key parameter in determining the orbit's characteristics.","translation":"近日点距離は、軌道の特性を決定する重要なパラメータである。"}],"collocations":["pericentre distance (近日点距離)","reach pericentre (近日点に到達する)","at pericentre (近日点で)"],"synonyms":["periapsis"],"antonyms":["apocentre","apoapsis"]}],"etymology":{"value":"Derived from the Greek words 'peri' (near) and 'kentron' (center).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛrɪˈsɛntər/","syllables":"per-i-cen-tre"},"inflection":{"noun_plural":"pericentres"},"usage_notes":{"explanation":"'Pericentre' refers to the point in an orbit closest to the central body. It is a general term that can be used for any orbiting body. When the central body is the Sun, the term 'perihelion' is used. When the central body is the Earth, the term 'perigee' is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The satellite was at perigee, its closest point to the sun.","correct":"✓ The satellite was at perihelion, its closest point to the sun.","note":"'Perigee' is specifically used for orbits around the Earth, while 'perihelion' is used for orbits around the Sun."}],"priority":"★★☆"},"related_words":{"derivatives":["periapsis (general term for the point of closest approach in an orbit)","perihelion (the point in the orbit of an object orbiting the Sun that is nearest to the Sun)","perigee (the point in the orbit of an object orbiting the Earth that is nearest to the Earth)","apocentre (the point in the orbit of an object orbiting a body that is farthest from the body being orbited)","apoapsis (general term for the point of farthest approach in an orbit)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pericentre' is a technical term used in astronomy and orbital mechanics. It refers to the point in an orbit where an object is closest to the body it is orbiting. While 'periapsis' is a more general term, 'pericentre' is often used when the specific central body is not specified, or when discussing orbital mechanics in a general sense. Understanding this term requires a background in physics or astronomy."},"example_sentences":[{"sentence":"The spacecraft's velocity is highest at its **pericentre**.","translation":"宇宙船の速度は近日点で最も高くなる。","type":"general usage","meaning_category":"orbital mechanics"},{"sentence":"Precise calculations of the **pericentre** are crucial for mission planning.","translation":"近日点の正確な計算は、ミッション計画にとって非常に重要である。","type":"technical","meaning_category":"astronomy"}]}