{"word":"Dihydroergotamine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジヒドロエルゴタミン：片頭痛の治療に用いられる薬","english_definition":"A drug used to treat migraine headaches. It is a derivative of ergotamine.","examples":[{"sentence":"Dihydroergotamine is available as an injection, nasal spray, and oral tablet.","translation":"ジヒドロエルゴタミンは、注射、点鼻薬、経口錠剤として入手可能です。"},{"sentence":"The doctor prescribed dihydroergotamine for her severe migraines.","translation":"医師は彼女の重度の片頭痛に対してジヒドロエルゴタミンを処方した。"}],"collocations":["dihydroergotamine mesylate","dihydroergotamine nasal spray","intravenous dihydroergotamine"],"synonyms":["DHE","Migranal"],"antonyms":[]}],"etymology":{"value":"Derived from ergotamine, with the addition of two hydrogen atoms (dihydro-). Ergotamine is derived from ergot, a fungus that grows on rye.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌhaɪdroʊɜːrˈɡɒtəmiːn/","syllables":"di-hy-dro-er-got-a-mine"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Dihydroergotamine is primarily used for the acute treatment of migraine headaches, with or without aura. It is available in various formulations to suit different patient needs. It is important to use this medication under the guidance of a healthcare professional due to potential side effects and interactions with other medications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take dihydroergotamine every day to prevent migraines.","correct":"✓ Dihydroergotamine is typically used to treat acute migraines, not prevent them.","note":"Dihydroergotamine is generally used for acute treatment, not prophylaxis."},{"incorrect":"✗ Dihydroergotamine is safe for pregnant women.","correct":"✓ Dihydroergotamine is contraindicated in pregnancy.","note":"It is important to consult a healthcare professional regarding contraindications."}],"priority":"★★☆"},"related_words":{"derivatives":["ergotamine","ergot alkaloids"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dihydroergotamine is a specialized medication used to treat acute migraine headaches. It is derived from ergotamine and is available in various forms, such as injections and nasal sprays. Due to its potential side effects and interactions, it should only be used under medical supervision. It is not typically used for preventing migraines but rather for treating them when they occur."},"example_sentences":[{"sentence":"The patient was given an intravenous injection of **dihydroergotamine** to relieve her severe migraine.","translation":"患者は重度の片頭痛を緩和するためにジヒドロエルゴタミンの静脈注射を受けた。","type":"noun","meaning_category":"medication"},{"sentence":"**Dihydroergotamine** nasal spray can provide rapid relief from migraine symptoms.","translation":"ジヒドロエルゴタミン点鼻薬は、片頭痛の症状を迅速に緩和することができます。","type":"noun","meaning_category":"medication"}]}