{"word":"anthracometric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"人体計測学的な、人体の寸法測定に関する","english_definition":"Relating to the measurement of the human body, especially the skeleton.","examples":[{"sentence":"The study included anthracometric measurements of the participants.","translation":"その研究には、参加者の人体計測学的測定が含まれていました。"}],"collocations":["anthracometric data","anthracometric study","anthracometric analysis"],"synonyms":["anthropometric","somatometric"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'anthropos' (human) and 'metric' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"ˌænθrəkəˈmɛtrɪk","syllables":"an-thra-co-met-ric"},"inflection":{"notes":"This word does not have typical inflectional forms as it is primarily an adjective."},"usage_notes":{"explanation":"'Anthracometric' is a specialized term primarily used in fields like anthropology, medicine, and ergonomics to describe measurements related to the human body, particularly skeletal dimensions. It is often used interchangeably with 'anthropometric', though 'anthropometric' has a broader application to include measurements of soft tissues as well.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["anthracometry (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'anthracometric' is highly specialized and technical, primarily used within academic or professional contexts related to physical anthropology, medicine, or ergonomics. Due to its limited use, it is not commonly encountered in general English."},"example_sentences":[{"sentence":"The researchers used anthracometric techniques to analyze the skeletal remains.","translation":"研究者たちは、骨格の遺骸を分析するために人体計測学的な手法を用いました。","type":"general","meaning_category":"measurement"},{"sentence":"Anthracometric data can provide insights into population health and nutritional status.","translation":"人体計測学的なデータは、集団の健康状態や栄養状態に関する洞察を提供することができます。","type":"general","meaning_category":"data analysis"}]}