{"word":"Solidarist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A proponent of solidarism, a political ideology that emphasizes social solidarity and cooperation.","english_definition":"An advocate or supporter of solidarism, a political philosophy emphasizing social solidarity, cooperation, and the common good.","examples":[{"sentence":"The Solidarists believe in a society where everyone contributes to the well-being of all.","translation":"連帯主義者たちは、すべての人が全体の幸福に貢献する社会を信じている。"},{"sentence":"He identified himself as a Solidarist, advocating for policies that promote social cohesion.","translation":"彼は自身を連帯主義者であると表明し、社会の結束を促進する政策を提唱した。"}],"collocations":["Solidarist movement","Solidarist principles","Solidarist policies","become a Solidarist","a leading Solidarist"],"synonyms":["social reformer","communitarian","cooperator","mutualist"],"antonyms":["individualist","libertarian"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of solidarism.","english_definition":"Relating to or characteristic of solidarism; promoting social solidarity and cooperation.","examples":[{"sentence":"The government's Solidarist approach aimed to bridge the gap between the rich and the poor.","translation":"政府の連帯主義的なアプローチは、富める者と貧しい者の間のギャップを埋めることを目指していた。"},{"sentence":"Solidarist economic policies prioritize the needs of the community over individual profit.","translation":"連帯主義的な経済政策は、個人の利益よりもコミュニティのニーズを優先する。"}],"collocations":["Solidarist values","Solidarist philosophy","Solidarist economy","Solidarist state","Solidarist thought"],"synonyms":["communitarian","cooperative","mutualistic"],"antonyms":["individualistic","competitive"]}],"etymology":{"value":"Derived from 'solidarity' + '-ist'. 'Solidarity' comes from French 'solidarité', from 'solidaire' (joint, liable jointly), from Latin 'solidus' (solid). The '-ist' suffix denotes a person who adheres to or advocates a particular doctrine or principle.","priority":"★★☆"},"pronunciation":{"ipa":"/sɒˈlɪdərɪst/","syllables":"So-li-da-rist"},"inflection":{"noun_plural":"Solidarists"},"usage_notes":{"explanation":"'Solidarist' refers to someone who believes in or supports solidarism, a political and social philosophy that emphasizes cooperation, mutual responsibility, and the common good. It can also be used as an adjective to describe ideas, policies, or systems aligned with solidaristic principles. Solidarism seeks to find a middle ground between collectivism and individualism, promoting social cohesion through voluntary association and mutual aid.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a solidarist person, always helping others.","correct":"✓ He is a solidary person, always helping others. / ✓ He is a solidarist, always helping others.","note":"'Solidary' (meaning united or based on shared interests) is sometimes confused with 'solidarist'. 'Solidarist' specifically refers to someone who adheres to the ideology of solidarism. To describe a generally helpful person, 'solidary' or other terms like 'altruistic' may be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["solidarism","solidarity","solidary"],"related_concepts":["social justice","distributism","subsidiarity","social democracy","Christian democracy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. The term is relatively uncommon outside of academic or political discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solidarist' is a term primarily used in political science and sociology to describe someone who supports solidarism. Solidarism is a political ideology that seeks to balance individual rights with the collective good of society. It emphasizes cooperation, mutual responsibility, and social cohesion. The term is not commonly used in everyday conversation and is more likely to appear in academic or political contexts. Understanding the concept of solidarism is key to understanding the meaning of 'solidarist'."},"example_sentences":[{"sentence":"As a committed Solidarist, she dedicated her career to promoting policies that support working families.","translation":"献身的な連帯主義者として、彼女は労働者家族を支援する政策を推進することにキャリアを捧げた。","type":"noun","meaning_category":"proponent of solidarism"},{"sentence":"The Solidarist principles of mutual aid and cooperation guided their community development projects.","translation":"相互扶助と協力という連帯主義の原則が、彼らのコミュニティ開発プロジェクトを導いた。","type":"adjective","meaning_category":"relating to solidarism"}]}