{"word":"slammock","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"だらしない女、不器量な女、ずべ公","english_definition":"A slovenly, awkward, or ungainly woman or girl.","examples":[{"sentence":"She was a real slammock, always leaving her clothes all over the floor.","translation":"彼女は本当にだらしない女で、いつも服を床に散らかしっぱなしだった。"},{"sentence":"Don't be such a slammock; try to be a bit more presentable.","translation":"そんなずべ公みたいな格好をするな。もう少しきちんとしなさい。"}],"collocations":["a lazy slammock","an untidy slammock"],"synonyms":["sloven","slut","dowd","frump","hussy","trollop"],"antonyms":["dandy","fop (for male equivalent)"]},{"part_of_speech":"verb","definition":"だらしなく歩く、ぶかっこうに動く","english_definition":"To walk or move in a slovenly, awkward, or ungainly manner.","examples":[{"sentence":"She slammocked around the house in her pajamas all day.","translation":"彼女は一日中パジャマ姿でだらしなく家の中を歩き回っていた。"},{"sentence":"He slammocked through the mud, getting his boots covered.","translation":"彼は泥の中をぶかっこうに歩き、ブーツを泥だらけにした。"}],"collocations":["slammock around","slammock through"],"synonyms":["lounge","slob","slouch","lumber","galumph"],"antonyms":["glide","prance"]}],"etymology":{"value":"Origin uncertain. Possibly a blend of 'slam' (implying clumsy movement) and a derogatory suffix like '-ock'. Some suggest a connection to dialectal words for a loose or untidy garment.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslæmək/","syllables":"slam-mock"},"inflection":{"noun_plural":"slammocks","verb_forms":{"present_simple":["slammock","slammocks"],"past_simple":"slammocked","past_participle":"slammocked","present_participle":"slammocking"}},"usage_notes":{"explanation":"'Slammock' is a derogatory term, primarily used to describe a woman or girl who is considered untidy, clumsy, and lacking in grace or refinement. As a verb, it describes the act of moving in a similar manner. The word is relatively uncommon and may be considered offensive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is such a slammock.","correct":"✓ She is such a slammock.","note":"'Slammock' is typically used to describe females. A male equivalent might be 'slob' or 'lout'."},{"incorrect":"✗ She slammocked the door.","correct":"✓ She slammed the door.","note":"'Slammock' as a verb describes a way of moving, not a direct action on an object. 'Slam' would be the correct verb to describe forcefully closing a door."}],"priority":"★★☆"},"related_words":{"derivatives":["slammocky (adjective: resembling a slammock)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Slammock' is an uncommon and somewhat archaic word, primarily used in informal contexts to negatively describe a woman or girl who is considered slovenly, awkward, or ungainly. Its usage can be considered offensive. Understanding the word requires a good grasp of derogatory language and social context. As a verb, it describes moving in a clumsy, untidy manner. Due to its rarity and negative connotation, it's not typically encountered in standard English usage."},"example_sentences":[{"sentence":"The old woman shuffled down the street, looking like a complete slammock.","translation":"その老婆は、まるでだらしない女のように見えながら、通りをゆっくりと歩いていた。","type":"noun","meaning_category":"だらしない女"},{"sentence":"Stop slammocking around and try to be more graceful.","translation":"だらしなく歩き回るのはやめて、もっと優雅に振る舞いなさい。","type":"verb","meaning_category":"だらしなく歩く"},{"sentence":"She didn't care if people thought she was a slammock; she was comfortable.","translation":"彼女は、人が彼女をだらしない女だと思っても気にしなかった。彼女は快適だったのだ。","type":"noun","meaning_category":"だらしない女"},{"sentence":"He watched her slammock through the kitchen, spilling coffee as she went.","translation":"彼は彼女が台所をぶかっこうに歩き回り、コーヒーをこぼしながら行くのを見ていた。","type":"verb","meaning_category":"ぶかっこうに動く"}]}