{"word":"Pro-Chicagoan","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Supporting or favoring the city of Chicago, its people, or its culture.","english_definition":"Advocating for, supporting, or characteristic of the city of Chicago, its residents, or its culture.","examples":[{"sentence":"The mayor is known for his Pro-Chicagoan policies, which prioritize local businesses and residents.","translation":"市長は、地元の企業や住民を優先する親シカゴ政策で知られています。"},{"sentence":"The newspaper has a Pro-Chicagoan bias, often highlighting the city's achievements and downplaying its problems.","translation":"その新聞は親シカゴ的な偏向があり、しばしば市の業績を強調し、問題を軽視します。"},{"sentence":"As a Pro-Chicagoan organization, we aim to promote the city's unique cultural identity and foster a sense of community pride.","translation":"親シカゴ団体として、私たちは市のユニークな文化的アイデンティティを促進し、地域社会の一体感を育むことを目指しています。"}],"collocations":["Pro-Chicagoan policies","Pro-Chicagoan bias","Pro-Chicagoan organization","Pro-Chicagoan sentiment","Pro-Chicagoan attitude"],"synonyms":["Chicago-centric","Chicago-focused","Chicago-supportive","Chicago-minded"],"antonyms":["Anti-Chicagoan","Chicago-critical","Chicago-opposed"]}],"etymology":{"value":"Formed by combining the prefix \"pro-\" (meaning 'in favor of') with the noun \"Chicagoan\" (referring to a resident or native of Chicago).","priority":"N/A"},"pronunciation":{"ipa":"/ˌproʊ ʃɪˈkɑːɡoʊən/","syllables":"Pro-Chi-ca-go-an"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Pro-Chicagoan\" is used to describe someone or something that actively supports or favors Chicago. It often implies a positive attitude towards the city and its interests. It is relatively uncommon but readily understood.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very pro-Chicago.","correct":"✓ He is very Pro-Chicagoan.","note":"\"Pro-Chicago\" is not typically used as an adjective. Use \"Pro-Chicagoan\" instead."}],"priority":"N/A"},"related_words":{"derivatives":["Chicagoan (noun, adjective)","Pro- (prefix)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"Pro-Chicagoan\" is a relatively sophisticated term used to describe someone or something that is supportive of or advocates for the city of Chicago. It is formed by adding the prefix \"pro-\" to \"Chicagoan.\" Understanding requires familiarity with the prefix \"pro-\" and the term \"Chicagoan.\""},"example_sentences":[{"sentence":"The candidate ran on a Pro-Chicagoan platform, promising to bring jobs back to the city.","translation":"その候補者は、市に雇用を取り戻すことを約束し、親シカゴの政策を掲げて立候補しました。","type":"adjective","meaning_category":"Supporting Chicago"},{"sentence":"Her Pro-Chicagoan stance was evident in her passionate defense of the city's cultural institutions.","translation":"彼女の親シカゴの姿勢は、市の文化機関に対する熱心な擁護に明らかでした。","type":"adjective","meaning_category":"Advocating for Chicago"}]}