{"word":"despisal","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"軽蔑、侮蔑、見下し","english_definition":"the feeling or expression of contempt or disdain for someone or something.","examples":[{"sentence":"His despisal for those less fortunate was evident in his words.","translation":"彼の、恵まれない人々への軽蔑は、彼の言葉にはっきりと表れていた。"},{"sentence":"She couldn't hide her despisal of his cowardly actions.","translation":"彼女は彼の卑怯な行動への軽蔑を隠すことができなかった。"},{"sentence":"The critic's despisal of the novel was harsh and unwarranted.","translation":"評論家のその小説への軽蔑は、厳しく、正当な理由がなかった。"}],"collocations":["feel despisal (軽蔑を感じる)","show despisal (軽蔑を示す)","express despisal (軽蔑を表現する)","a look of despisal (軽蔑の眼差し)"],"synonyms":["contempt","scorn","disdain","disrespect","derision","loathing","aversion","antipathy"],"antonyms":["respect","admiration","esteem","regard","veneration","reverence"]}],"etymology":{"value":"'Despisal' is derived from the verb 'despise,' which comes from the Old French 'despisier' meaning 'to scorn, disdain,' ultimately from Latin 'de-' (down, away) + 'spicere' (to look at, view). The noun 'despisal' is formed by adding the suffix '-al,' indicating an action, process, or result.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈspaɪzəl/","syllables":"de-spi-sal"},"inflection":{"noun_plural":"despisals (rarely used)"},"usage_notes":{"explanation":"'Despisal' is a noun that denotes the feeling or act of despising. It is a relatively formal word and is less commonly used than its synonym 'contempt.' It usually implies a strong feeling of looking down on someone or something, considering them worthless or inferior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed despisal attitude towards them.","correct":"✓ He showed a despisal attitude towards them. / ✓ He showed a contemptuous attitude towards them.","note":"'Despisal' is a noun, not an adjective. To describe an attitude, use 'a despisal attitude' (though this is less common) or replace it with an adjective like 'contemptuous.'"},{"incorrect":"✗ Her despisal was directed to the poverty.","correct":"✓ Her despisal was directed at the poverty. / ✓ Her despisal was directed towards the poverty.","note":"When indicating the object of despisal, use the prepositions 'at' or 'towards.'"}],"priority":"★★☆"},"related_words":{"derivatives":["despise (verb: to regard with contempt or scorn)","despicable (adjective: deserving contempt; mean)","despised (adjective: regarded with contempt or scorn)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'despisal' is a formal noun indicating a strong feeling of contempt or disdain. It's less common than 'contempt' but carries a similar meaning of looking down on something or someone as worthless. It's used to describe the feeling or expression of this contempt. This word is generally encountered in more advanced texts or formal writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician's speech revealed his deep despisal for the working class.","translation":"その政治家の演説は、労働者階級への深い軽蔑を明らかにした。","type":"general","meaning_category":"軽蔑"},{"sentence":"She could sense the despisal in his voice when he spoke of their rivals.","translation":"彼女は彼がライバルのことを話すとき、彼の声に軽蔑を感じることができた。","type":"general","meaning_category":"軽蔑"},{"sentence":"His despisal of modern art was well-known in the art community.","translation":"彼の現代アートへの軽蔑は、アートコミュニティではよく知られていた。","type":"general","meaning_category":"軽蔑"}]}