{"word":"gyrostatics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジャイロ静力学：回転する物体の平衡状態の研究","english_definition":"The study of the equilibrium of rotating bodies.","examples":[{"sentence":"Gyrostatics is a branch of mechanics concerned with the equilibrium of gyroscopes and other rotating systems.","translation":"ジャイロ静力学は、ジャイロスコープやその他の回転系の平衡に関する力学の一分野です。"},{"sentence":"The principles of gyrostatics are used in the design of inertial navigation systems.","translation":"ジャイロ静力学の原理は、慣性航法システムの設計に用いられています。"}],"collocations":["gyrostatic equilibrium","gyrostatic stability","apply gyrostatics","principles of gyrostatics"],"synonyms":["statics of rotating bodies","equilibrium of gyroscopes"],"antonyms":[]}],"etymology":{"value":"Derived from 'gyro-' (referring to rotation) and 'statics' (the study of objects at rest or in equilibrium).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒaɪ.roʊˈstætɪks/","syllables":"gy-ro-stat-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Gyrostatics is a specialized field within classical mechanics that deals with the conditions under which rotating bodies, such as gyroscopes, remain in equilibrium. It contrasts with gyrodynamics, which studies the motion of rotating bodies under the influence of external forces. Gyrostatics is essential for understanding the behavior of systems like spinning tops, gyroscopic compasses, and stabilized platforms.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["gyrostatic (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Gyrostatics is a technical term used in physics and engineering. It refers to the study of how rotating objects, like gyroscopes, maintain their balance. It's a specialized topic, so you'll typically encounter it in advanced scientific or engineering contexts."},"example_sentences":[{"sentence":"The gyrostatics of the spinning top allows it to remain upright.","translation":"回転するコマのジャイロ静力学により、コマは直立した状態を保つことができます。","type":"general","meaning_category":"definition"},{"sentence":"Understanding gyrostatics is crucial for designing stable satellite platforms.","translation":"安定した衛星プラットフォームを設計するには、ジャイロ静力学の理解が不可欠です。","type":"applied","meaning_category":"application"}]}