{"word":"hyperexcitability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"過剰興奮性、過敏性","english_definition":"The state of being abnormally or excessively excitable or responsive to stimuli.","examples":[{"sentence":"The patient exhibited hyperexcitability and restlessness.","translation":"患者は過剰興奮性と落ち着きのなさを呈した。"},{"sentence":"Hyperexcitability of the nervous system can lead to seizures.","translation":"神経系の過剰興奮性は発作を引き起こす可能性がある。"},{"sentence":"Certain medications can cause hyperexcitability as a side effect.","translation":"特定の薬は副作用として過剰興奮性を引き起こす可能性がある。"}],"collocations":["nervous system hyperexcitability (神経系の過剰興奮性)","brain hyperexcitability (脳の過剰興奮性)","muscle hyperexcitability (筋肉の過剰興奮性)","drug-induced hyperexcitability (薬物誘発性の過剰興奮性)"],"synonyms":["overexcitability","hypersensitivity","irritability","nervousness","agitation"],"antonyms":["calmness","stability","quiescence","unresponsiveness"]},{"part_of_speech":"noun","definition":"(神経生理学)ニューロンまたは神経細胞の異常な興奮性","english_definition":"(Neurophysiology) An abnormal increase in the excitability of a neuron or nerve cell.","examples":[{"sentence":"Studies have shown that hyperexcitability of certain neurons contributes to chronic pain.","translation":"研究により、特定のニューロンの過剰興奮性が慢性的な痛みに寄与することが示されている。"},{"sentence":"The researchers investigated the mechanisms underlying hyperexcitability in epilepsy.","translation":"研究者らはてんかんにおける過剰興奮性の根底にあるメカニズムを調査した。"}],"collocations":["neuronal hyperexcitability (ニューロンの過剰興奮性)","cortical hyperexcitability (皮質の過剰興奮性)","synaptic hyperexcitability (シナプスの過剰興奮性)"],"synonyms":["neuronal overexcitability","excessive neuronal firing"],"antonyms":["neuronal inhibition"]}],"etymology":{"value":"\"hyper-\" (above, beyond, excessive) + \"excitability\" (the capacity to be excited or stimulated). The word is formed by combining the prefix indicating excess with the noun describing the ability to be excited.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərɪkˌsaɪtəˈbɪləti/","syllables":"hy-per-ex-cit-a-bil-i-ty"},"inflection":{"noun_plural":"hyperexcitabilities"},"usage_notes":{"explanation":"\"Hyperexcitability\" refers to a state of increased responsiveness to stimuli, often in the context of the nervous system or brain. It can manifest as restlessness, agitation, irritability, or even seizures. In neurophysiology, it specifically describes an abnormal increase in the excitability of neurons, which can contribute to various neurological disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a hyperexcitability.","correct":"✓ He exhibits hyperexcitability. / ✓ He has hyperexcitability.","note":"While both are grammatically correct, \"exhibits hyperexcitability\" is more formal and common in medical contexts. \"Has hyperexcitability\" is also acceptable but less formal."},{"incorrect":"✗ Hyperexcitability is a symptom of anxiety, but anxiety is not always hyperexcitability.","correct":"✓ Hyperexcitability can be a symptom of anxiety, but anxiety does not always cause hyperexcitability.","note":"Hyperexcitability can be a symptom of anxiety, but anxiety does not always cause hyperexcitability. The original sentence implies that anxiety can never be hyperexcitability, which is not accurate. The corrected sentence clarifies that anxiety doesn't always lead to hyperexcitability."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperexcitable (adjective: 過剰興奮性の、過敏な)","excitability (noun: 興奮性、敏感性)","excitation (noun: 興奮、刺激)"],"phrases":["hyperexcitability disorder","hyperexcitability syndrome"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hyperexcitability\" is a technical term primarily used in medical and scientific contexts, particularly in discussions related to neurology, physiology, and pharmacology. It describes a state of increased or excessive responsiveness to stimuli, often referring to the nervous system or brain. Understanding this term requires a background in these fields, as it is not commonly used in everyday language. The word is formed from \"hyper-\" meaning excessive, and \"excitability,\" referring to the capacity to be stimulated or excited.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study investigated the role of neuronal hyperexcitability in the development of epilepsy.","translation":"その研究では、てんかんの発症におけるニューロンの過剰興奮性の役割が調査された。","type":"scientific","meaning_category":"neurology"},{"sentence":"Drug-induced hyperexcitability can lead to adverse effects in some patients.","translation":"薬物誘発性の過剰興奮性は、一部の患者に副作用を引き起こす可能性がある。","type":"medical","meaning_category":"pharmacology"},{"sentence":"The child's hyperexcitability made it difficult for him to concentrate in school.","translation":"その子供の過剰興奮性は、学校で集中することを困難にさせた。","type":"general","meaning_category":"general"}]}