{"word":"right-legged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"右足の、右足が～な","english_definition":"Having a right leg, or having legs adapted for use primarily on the right side.","examples":[{"sentence":"The bird was observed hopping around, apparently right-legged.","translation":"その鳥は片足で飛び跳ねているのが観察され、どうやら右足で立っているようだった。"},{"sentence":"The dancer is right-legged, so she starts with her right foot.","translation":"そのダンサーは右足が利き足なので、右足から始める。"}],"collocations":["right-legged stance (右足立ち)","right-legged animal (右足の動物)"],"synonyms":[],"antonyms":[],"notes":"This term is not commonly used. Its meaning is usually clear from context. It can refer to physical characteristics or preference/dominance of the right leg."}],"etymology":{"value":"Formed from \"right\" (referring to the right side) + \"legged\" (having legs).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈraɪtˌleɡɪd/","syllables":"right-leg-ged"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative or superlative phrases (e.g., more right-legged)."},"usage_notes":{"explanation":"The term \"right-legged\" is not a standard or frequently used term in English. It is a descriptive adjective that means having a right leg or using the right leg predominantly. Its meaning is generally understood from context. It is more common to use phrases like \"using the right leg\" or \"right-leg dominant\" when describing preference or dominance.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["left-legged (左足の)"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"right-legged\" is a compound adjective that is easily understood through its component parts. It is not a common term, so it is unlikely to be encountered frequently. Its meaning is straightforward: having a right leg or characterized by the use of the right leg."},"example_sentences":[{"sentence":"The athlete seemed more comfortable in a right-legged stance during the competition.","translation":"その選手は、競技中、右足立ちの方がより快適そうだった。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The dog is right-legged; it always leads with its right paw.","translation":"その犬は右足が利き足で、いつも右の前足から歩き出す。","type":"adjective","meaning_category":"Descriptive"}]}