{"word":"fee-for-service","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"出来高払い、サービスごとの料金体系","english_definition":"A system of payment in which a healthcare provider is paid a fee for each individual service provided.","examples":[{"sentence":"The hospital operates on a fee-for-service basis.","translation":"その病院は出来高払いのシステムで運営されています。"},{"sentence":"Many doctors are moving away from fee-for-service models.","translation":"多くの医師が出来高払いのモデルから移行しています。"},{"sentence":"Fee-for-service can incentivize doctors to provide more services, even if they are not necessary.","translation":"出来高払いは、たとえ必要でなくても、より多くのサービスを提供するように医師を促す可能性があります。"}],"collocations":["operate on a fee-for-service basis","move away from fee-for-service","fee-for-service model","traditional fee-for-service system"],"synonyms":["itemized billing","service-based payment"],"antonyms":["capitation","bundled payment","value-based care"]},{"part_of_speech":"adjective","definition":"出来高払いの、サービスごとの料金体系の","english_definition":"Relating to or based on a system of payment in which a healthcare provider is paid a fee for each individual service provided.","examples":[{"sentence":"The fee-for-service system is often criticized for its potential to drive up healthcare costs.","translation":"出来高払い制度は、医療費を押し上げる可能性があるとしてしばしば批判されます。"},{"sentence":"Under a fee-for-service arrangement, doctors are paid for each visit, test, or procedure.","translation":"出来高払いの取り決めでは、医師は診察、検査、または処置ごとに報酬が支払われます。"}],"collocations":["fee-for-service healthcare","fee-for-service arrangement","fee-for-service insurance plan"],"synonyms":["service-based","itemized"],"antonyms":["capitated","bundled"]}],"etymology":{"value":"The term is self-explanatory: a 'fee' is charged 'for' each 'service' provided. It reflects a traditional model of healthcare payment where providers are compensated for the quantity of services they deliver.","priority":"★★☆"},"pronunciation":{"ipa":"ˌfiːfərˈsɜːrvɪs/","syllables":"fee-for-ser-vice"},"inflection":{"notes":"The term can function as both a noun and an adjective. As a noun, it is typically uncountable. As an adjective, it precedes the noun it modifies (e.g., fee-for-service system)."},"usage_notes":{"explanation":"'Fee-for-service' is a common term in healthcare economics and policy. It describes a payment model where providers are paid for each individual service they render. This contrasts with other payment models like capitation (where providers receive a fixed payment per patient, regardless of the number of services) and bundled payments (where providers receive a single payment for an episode of care). Fee-for-service is often criticized for incentivizing over-utilization of services, but it can also be seen as ensuring that providers are adequately compensated for their work.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ fee for services","correct":"✓ fee-for-service","note":"The correct term is hyphenated: 'fee-for-service'"},{"incorrect":"✗ The fee for service is good.","correct":"✓ The fee-for-service system is good.","note":"'Fee-for-service' typically refers to the system or model, not a single fee. Use 'fee-for-service system' or similar to be more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["capitation","bundled payment","value-based care","managed care","healthcare economics","reimbursement model"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in specialized contexts (healthcare, economics).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fee-for-service' is a term primarily used in the context of healthcare and economics. It refers to a payment system where healthcare providers are paid separately for each service they provide, such as a doctor's visit, a test, or a procedure. Understanding this term requires familiarity with healthcare payment models and economic principles. It's often discussed in relation to alternative payment models like capitation or bundled payments, and the potential incentives it creates for providers."},"example_sentences":[{"sentence":"The transition from a **fee-for-service** model to value-based care is a complex process.","translation":"出来高払いモデルから価値に基づく医療への移行は複雑なプロセスです。","type":"noun","meaning_category":"payment model"},{"sentence":"Many believe that the **fee-for-service** system contributes to rising healthcare costs.","translation":"多くの人が、出来高払い制度が医療費の高騰に寄与していると考えています。","type":"noun","meaning_category":"payment model"},{"sentence":"Under a **fee-for-service** plan, patients may have more freedom to choose their doctors.","translation":"出来高払いプランでは、患者は医師を選ぶ自由度が高い場合があります。","type":"adjective","meaning_category":"payment system"},{"sentence":"The hospital's revenue is primarily generated through **fee-for-service** billing.","translation":"病院の収益は主に出来高払い請求によって生み出されています。","type":"noun","meaning_category":"payment model"}]}