{"word":"security-sealed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"セキュリティシールされた、不正開封防止シールが施された","english_definition":"Protected with a security seal to prevent tampering or unauthorized access.","examples":[{"sentence":"The package arrived security-sealed, ensuring its contents were intact.","translation":"その小包はセキュリティシールされた状態で届き、中身が無事であることが保証された。"},{"sentence":"All evidence must be stored in security-sealed containers.","translation":"すべての証拠品は、セキュリティシールされた容器に保管されなければならない。"},{"sentence":"The security-sealed envelope indicated that it had not been opened since it was sent.","translation":"セキュリティシールされた封筒は、発送されてから開封されていないことを示していた。"}],"collocations":["security-sealed package","security-sealed container","security-sealed envelope","security-sealed bag","security-sealed box"],"synonyms":["tamper-evident","sealed for security","protected","secure"],"antonyms":["unsealed","tampered with","open","compromised"]}],"etymology":{"value":"Combination of 'security' (measures taken to protect something) and 'sealed' (closed or secured with a seal).","priority":"★★★"},"pronunciation":{"ipa":"/sɪˈkjʊərɪti ˈsiːld/","syllables":"se-cu-ri-ty sealed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Security-sealed' describes an item or container that has been closed with a special seal designed to show if it has been opened or tampered with. This is often used to ensure the integrity and authenticity of the contents. The term implies a level of protection against unauthorized access.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The security sealed was broken.","correct":"✓ The security seal was broken.","note":"'Security sealed' is an adjective describing the item. The 'security seal' is the noun referring to the actual seal itself."},{"incorrect":"✗ The package is security seal.","correct":"✓ The package is security-sealed.","note":"'Security-sealed' is an adjective, so it needs to be used correctly to describe the noun (package)."}],"priority":"★★☆"},"related_words":{"derivatives":["security seal (noun)","seal (noun/verb)","security (noun)"],"phrasal_verbs":[],"related_terms":["tamper-proof","tamper-resistant","tamper-evident packaging"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'security-sealed' is a compound adjective used to describe something that has been closed or secured with a special seal designed to show evidence of tampering. It's commonly used in contexts where it's important to ensure that something hasn't been opened or altered without authorization, such as with packages, containers, or envelopes. The term is relatively straightforward, but understanding its use requires some familiarity with security and packaging concepts."},"example_sentences":[{"sentence":"The medicine bottles are all security-sealed to prevent accidental poisoning.","translation":"その薬瓶はすべて、誤飲を防ぐためにセキュリティシールされています。","type":"adjective","meaning_category":"protected"},{"sentence":"Upon arrival, the evidence bag was found to be not security-sealed, raising concerns about potential contamination.","translation":"到着時、証拠品の袋はセキュリティシールされておらず、汚染の可能性についての懸念が高まった。","type":"adjective","meaning_category":"uncompromised"},{"sentence":"The company uses security-sealed shipping containers to transport valuable goods.","translation":"その会社は、貴重品を輸送するためにセキュリティシールされた輸送コンテナを使用している。","type":"adjective","meaning_category":"secure"}]}