{"word":"boobily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"間抜けな様子で、愚かしく","english_definition":"In a silly, foolish, or awkward manner.","examples":[{"sentence":"He smiled boobily at her, unsure of what to say.","translation":"彼は何を言うべきか分からず、間抜けな笑顔で彼女に微笑んだ。"},{"sentence":"She tripped and fell boobily in front of everyone.","translation":"彼女は皆の前で間抜けにつまずいて転んだ。"}],"collocations":["smile boobily","stare boobily","fall boobily"],"synonyms":["foolishly","awkwardly","clumsily","stupidly","silly","inanely"],"antonyms":["cleverly","intelligently","gracefully"]}],"etymology":{"value":"Derived from the adjective \"booby\" (a foolish or stupid person) with the addition of the suffix \"-ly\" to form an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbuːbɪli/","syllables":"boo-bi-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"\"Boobily\" describes an action performed in a way that appears foolish, silly, or awkward. It often implies a lack of intelligence or grace in the manner of the action. The word is not commonly used and can be considered somewhat informal or humorous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted boobily, but she was actually very smart.","correct":"✓ She acted foolishly, but she was actually very smart.","note":"While \"boobily\" implies foolishness, it's important to ensure it aligns with the context. If emphasizing intelligence, \"foolishly\" might be a better fit."}],"priority":"★☆☆"},"related_words":{"derivatives":["booby (noun: a foolish person)","boobish (adjective: foolish, stupid)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'boobily' is not commonly used and may not be familiar to many English speakers. It is derived from 'booby,' which means a foolish or stupid person. Therefore, 'boobily' means in a foolish or stupid manner. Due to its uncommon usage, it is more likely to be encountered in advanced reading materials or specialized contexts. It's important to consider the audience and context before using this word, as it may not be widely understood."},"example_sentences":[{"sentence":"He scratched his head boobily, trying to remember where he had parked the car.","translation":"彼はどこに車を駐車したか思い出そうとして、間抜けな様子で頭を掻いた。","type":"general","meaning_category":"間抜けな様子で"},{"sentence":"The clown stumbled boobily around the circus ring, making the children laugh.","translation":"ピエロはサーカスのリングで間抜けによろめき回り、子供たちを笑わせた。","type":"general","meaning_category":"愚かしく"}]}