{"word":"intraclass","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クラス内、級内","english_definition":"Existing or occurring within the same class or group.","examples":[{"sentence":"Intraclass correlation is used to assess the reliability of measurements made within the same group.","translation":"級内相関は、同じグループ内で行われた測定の信頼性を評価するために使用されます。"},{"sentence":"The study focused on the intraclass dynamics of the student population.","translation":"その研究は、学生集団のクラス内の力学に焦点を当てました。"}],"collocations":["intraclass correlation","intraclass variance","intraclass dynamics"],"synonyms":["within-class","in-group"],"antonyms":["interclass","between-class"]}],"etymology":{"value":"Formed from the prefix 'intra-' meaning 'within' and the noun 'class'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəˈklæs/","syllables":"in-tra-class"},"inflection":{},"usage_notes":{"explanation":"'Intraclass' is commonly used in statistics, education, and sociology to describe relationships or variations within a single class or group. It is often contrasted with 'interclass', which refers to relationships or variations between different classes or groups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The interclass correlation was high.","correct":"The intraclass correlation was high.","note":"'Interclass' refers to correlation between classes, while 'intraclass' refers to correlation within a class."}],"priority":"★★☆"},"related_words":{"derivatives":["intraclass correlation (ICC)"],"related_terms":["class","intra-","interclass"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'intraclass' is a technical term primarily used in academic and research contexts, particularly in statistics, education, and sociology. It describes phenomena occurring within a single class or group, as opposed to between different classes or groups. Understanding this term requires familiarity with research methodologies and statistical concepts such as correlation and variance."},"example_sentences":[{"sentence":"The researchers analyzed the intraclass variability in test scores.","translation":"研究者たちは、テストの点数のクラス内変動を分析しました。","type":"adjective","meaning_category":"クラス内"},{"sentence":"Intraclass peer relationships significantly impact student learning.","translation":"クラス内の仲間関係は、生徒の学習に大きな影響を与えます。","type":"adjective","meaning_category":"クラス内"}]}