{"word":"pawnshops","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"質屋","english_definition":"A shop where articles are left as security for money lent, and, if not redeemed within a stated time, become the property of the lender.","examples":[{"sentence":"He had to sell his watch to a pawnshop to get some money.","translation":"彼は金を得るために質屋に時計を売らなければならなかった。"},{"sentence":"Pawnshops often offer loans with high interest rates.","translation":"質屋はしばしば高金利で融資を行う。"}],"collocations":["run a pawnshop (質屋を経営する)","pawn something at a pawnshop (質屋に何かを質に入れる)"],"synonyms":["pawnbroker","hock shop"],"antonyms":[]}],"etymology":{"value":"The word \"pawnshop\" is derived from \"pawn,\" which comes from the Old French word \"pan,\" meaning a pledge or security. The \"shop\" part is simply the place where the pawning occurs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːnʃɒps/","syllables":"pawn-shops"},"inflection":{"noun_plural":"pawnshops"},"usage_notes":{"explanation":"\"Pawnshops\" are businesses that offer loans in exchange for valuable items as collateral. If the borrower repays the loan within a specified period, they can reclaim their item. If not, the pawnshop can sell the item to recoup the loan amount.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the pawnshop to buy some new clothes.","correct":"✓ I went to a clothing store to buy some new clothes.","note":"Pawnshops primarily deal in secondhand goods offered as collateral, not new clothing."},{"incorrect":"✗ Pawnshop is a good place to invest money.","correct":"✓ A pawnshop is a place to get a short-term loan.","note":"Pawnshops are not investment firms; they provide loans secured by personal property."}],"priority":"★★☆"},"related_words":{"derivatives":["pawn (verb, noun)","pawnbroker (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"pawnshops\" refers to stores that lend money in exchange for valuable items. If the loan isn't repaid, the store can sell the item. This concept is generally understood, but the specific vocabulary might be more common in certain contexts or regions."},"example_sentences":[{"sentence":"Many people visit pawnshops when they need quick cash.","translation":"多くの人がすぐに現金が必要なとき質屋を訪れる。","type":"general"},{"sentence":"The detective searched the pawnshops for the stolen jewelry.","translation":"刑事は盗まれた宝石を求めて質屋を捜索した。","type":"crime"},{"sentence":"He left his guitar at the pawnshop as collateral for a loan.","translation":"彼はギターを担保として質屋に預けた。","type":"finance"}]}