{"word":"unattributably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"帰属不明で、出所を特定できない形で","english_definition":"in a way that prevents the source or origin from being identified or assigned.","examples":[{"sentence":"The information was leaked unattributably to several news outlets.","translation":"その情報は、出所を特定できない形で複数の報道機関にリークされた。"},{"sentence":"He made the comments unattributably, requesting anonymity.","translation":"彼は匿名を要求し、発言の出所を特定できないようにした。"},{"sentence":"The study was funded unattributably through a series of shell corporations.","translation":"その研究は、一連のペーパーカンパニーを通じて出所を特定できない形で資金提供された。"}],"collocations":["leak unattributably","speak unattributably","funded unattributably","sourced unattributably"],"synonyms":["anonymously","confidentially","off the record","without attribution","unidentifiedly"],"antonyms":["attributably","identifiedly","openly","publicly"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') and the suffix '-ly' (forming an adverb) to the word 'attributable'. 'Attributable' itself comes from 'attribute', which originates from the Latin 'attribuere' meaning 'to assign' or 'to ascribe'. Therefore, 'unattributably' literally means 'not in a way that can be assigned or ascribed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈtrɪbjʊtəbli/","syllables":"un-at-trib-u-ta-bly"},"inflection":{"notes":"As an adverb, 'unattributably' does not have different inflections."},"usage_notes":{"explanation":"'Unattributably' is used to describe actions or statements where the source is deliberately concealed or cannot be determined. It often implies a desire to avoid responsibility or maintain secrecy. It is commonly used in journalism, politics, and academic research to describe information provided without revealing the source. The adverb form emphasizes the manner in which something is done, highlighting the lack of identifiable origin.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The information was unattributable.","correct":"✓ The information was leaked unattributably.","note":"'Unattributable' is an adjective meaning 'cannot be attributed', while 'unattributably' is an adverb describing how something is done. Use the adverb form to modify verbs like 'leaked', 'said', or 'funded'."},{"incorrect":"✗ He spoke unattributably on the record.","correct":"✓ He spoke unattributably off the record.","note":"'Unattributably' is often associated with 'off the record', meaning the information is not for public attribution. 'On the record' implies the opposite, where statements can be attributed to the speaker."}],"priority":"★★☆"},"related_words":{"derivatives":["attributable (adjective: able to be attributed)","attribute (verb: to regard something as being caused by someone or something; noun: a quality or feature regarded as a characteristic or inherent part of someone or something)","attribution (noun: the action of regarding something as being caused by a person or thing)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unattributably' is an advanced word that means something is done in a way that the source cannot be identified. It's often used when someone wants to keep their identity secret, like when leaking information to the press. Because it's a complex word with a specific meaning, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The official spoke unattributably to reporters about the ongoing negotiations.","translation":"その当局者は、進行中の交渉について、出所を特定できない形で記者団に語った。","type":"adverb","meaning_category":"anonymously"},{"sentence":"The funds were channeled unattributably through various offshore accounts.","translation":"その資金は、さまざまなオフショア口座を通じて、出所を特定できない形で送金された。","type":"adverb","meaning_category":"confidentially"},{"sentence":"The document was circulated unattributably, causing widespread speculation.","translation":"その文書は、出所を特定できない形で広まり、広範な憶測を引き起こした。","type":"adverb","meaning_category":"without attribution"}]}