{"word":"fibrosis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"線維症（せんいしょう）","english_definition":"The thickening and scarring of connective tissue, usually as a result of injury or disease.","examples":[{"sentence":"Pulmonary fibrosis is a chronic and progressive lung disease.","translation":"肺線維症は慢性的で進行性の肺疾患です。"},{"sentence":"Hepatic fibrosis can lead to cirrhosis of the liver.","translation":"肝線維症は肝硬変につながる可能性があります。"},{"sentence":"The doctor explained that the fibrosis was caused by inflammation.","translation":"医師は、線維症は炎症によって引き起こされたと説明しました。"}],"collocations":["pulmonary fibrosis (肺線維症)","hepatic fibrosis (肝線維症)","cystic fibrosis (嚢胞性線維症)","cardiac fibrosis (心臓線維症)","renal fibrosis (腎線維症)","idiopathic pulmonary fibrosis (特発性肺線維症)"],"synonyms":["scarring","induration","sclerosis","cicatrization"],"antonyms":["resolution","healing","regeneration"]}],"etymology":{"value":"Derived from the Latin word 'fibra' (fiber) and the suffix '-osis' (denoting a condition or process, often a disease).","priority":"★★★"},"pronunciation":{"ipa":"/faɪˈbroʊsɪs/","syllables":"fi-bro-sis"},"inflection":{"noun_plural":"fibroses (less common), fibrosis (more common)"},"usage_notes":{"explanation":"Fibrosis refers to the abnormal formation of fibrous connective tissue in an organ or tissue, typically as a reparative or reactive process. It is characterized by the excessive accumulation of extracellular matrix components, such as collagen, leading to scarring and impaired organ function. The term is often used in the context of chronic diseases affecting various organs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a fibroses in his lungs.","correct":"✓ He has fibrosis in his lungs.","note":"'Fibrosis' is usually used as an uncountable noun, so it doesn't take the indefinite article 'a' unless referring to a specific area of fibrosis. However, 'fibroses' can be used as a plural form, although it's less common."},{"incorrect":"✗ Fibrosis is caused by bacteria.","correct":"✓ Fibrosis can be caused by inflammation, injury, or certain diseases.","note":"Fibrosis is not directly caused by bacteria, but rather by the body's response to injury, inflammation, or certain diseases. Bacterial infections can sometimes lead to inflammation that contributes to fibrosis."}],"priority":"★★☆"},"related_words":{"derivatives":["fibrotic (adjective: 線維性の)","fibroblast (noun: 線維芽細胞)","fibrogenesis (noun: 線維形成)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fibrosis' is a technical term primarily used in medical contexts to describe the abnormal thickening and scarring of connective tissue in organs or tissues. It's essential to understand that fibrosis is a pathological process resulting from injury, inflammation, or disease, leading to impaired organ function. The term is commonly encountered in discussions related to chronic lung diseases, liver diseases, and other conditions involving tissue damage and repair. Understanding the underlying causes and mechanisms of fibrosis is crucial for developing effective treatments and therapies.","priority":"★★★"},"example_sentences":[{"sentence":"The biopsy confirmed the presence of fibrosis in the liver tissue.","translation":"生検により、肝臓組織に線維症の存在が確認されました。","type":"general","meaning_category":"線維症の存在"},{"sentence":"Treatment aims to slow the progression of pulmonary fibrosis.","translation":"治療は肺線維症の進行を遅らせることを目的としています。","type":"general","meaning_category":"線維症の治療"},{"sentence":"Genetic factors can increase the risk of developing cystic fibrosis.","translation":"遺伝的要因は嚢胞性線維症を発症するリスクを高める可能性があります。","type":"specific","meaning_category":"特定の種類の線維症"}]}