{"word":"eruginous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"銅錆色の、緑青色の","english_definition":"Of or pertaining to copper rust; greenish-blue like verdigris.","examples":[{"sentence":"The old copper roof had an eruginous patina.","translation":"古い銅の屋根は緑青色の緑青が付いていた。"},{"sentence":"The eruginous stains on the statue were evidence of its age.","translation":"像の緑青色の染みは、その古さの証拠だった。"}],"collocations":["eruginous patina","eruginous stains"],"synonyms":["verdigris","copper-rust colored","greenish-blue"],"antonyms":[]}],"etymology":{"value":"From Latin *aeruginosus*, from *aerugo* (verdigris, copper rust), from *aes* (copper, bronze).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈruːdʒɪnəs/","syllables":"e-ru-gi-nous"},"inflection":{"notes":"Comparative and superlative forms (more eruginous, most eruginous) exist but are rarely used."},"usage_notes":{"explanation":"'Eruginous' is a relatively rare and technical term used to describe something that has the color or appearance of verdigris, the greenish-blue patina that forms on copper or bronze due to oxidation. It's most often used in descriptive writing, particularly when discussing architecture, art, or chemistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sky was eruginous.","correct":"✓ The sky was blue.","note":"'Eruginous' specifically refers to the color of copper rust, not general blue or green shades. It would be incorrect to use it to describe the sky, unless the sky somehow resembled the color of verdigris."}],"priority":"★☆☆"},"related_words":{"derivatives":["aerugo (Latin: verdigris)","aeruginous (adjective: containing or resembling verdigris)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (very rare, technical vocabulary)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eruginous' is a highly specialized term rarely encountered outside of technical or descriptive contexts related to chemistry, art history, or architecture. Its meaning is directly tied to the appearance of verdigris, the patina that forms on copper and bronze. Due to its rarity and specific application, it is considered advanced vocabulary. Understanding requires familiarity with both the word's etymology and the visual concept of verdigris.","priority":"★☆☆"},"example_sentences":[{"sentence":"The fountain, once gleaming bronze, now bore an eruginous coating from years of exposure.","translation":"かつて輝いていた青銅の噴水は、長年の露出により緑青色の被膜を帯びていた。","type":"descriptive","meaning_category":"color/appearance"},{"sentence":"Chemists identified the substance as an eruginous compound formed by the oxidation of copper.","translation":"化学者たちはその物質を、銅の酸化によって形成された緑青色の化合物であると特定した。","type":"technical","meaning_category":"chemistry"}]}