{"word":"exosmose","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"外浸透、外滲（がいしんとう、がいしん）: 半透膜を通して、溶媒が濃度の低い溶液から濃度の高い溶液へ移動する現象のうち、特に溶媒が細胞などの内部から外部へ移動すること。","english_definition":"The diffusion of a solvent (usually water) outward through a semipermeable membrane from a region of lower solute concentration to a region of higher solute concentration, especially from the interior of a cell or other structure to the surrounding medium.","examples":[{"sentence":"Exosmose causes the cell to shrink as water leaves.","translation":"外浸透によって水が細胞から出ていくため、細胞は収縮する。"},{"sentence":"The exosmosis of water from the plant cells led to wilting.","translation":"植物細胞からの水の外浸透は、しおれにつながった。"}],"collocations":["cause exosmose","exosmose process","reverse exosmose"],"synonyms":["outward diffusion","efflux","outflow"],"antonyms":["endosmose","influx","inflow"]}],"etymology":{"value":"Derived from the Greek prefix 'exo-' (meaning 'outside') and 'osmose' (referring to osmosis).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeksɒzˈmoʊsɪs/","syllables":"ex-os-mo-sis"},"inflection":{"noun_plural":"exosmoses"},"usage_notes":{"explanation":"Exosmose is a specific type of osmosis where the solvent moves from inside a structure (like a cell) to the outside. It's important in biological contexts, particularly in understanding how cells maintain their turgor pressure and respond to different environments. The opposite process is endosmose, where the solvent moves into the cell.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Exosmosis is when water enters the cell.","correct":"✓ Exosmosis is when water exits the cell.","note":"Exosmosis involves the movement of water out of the cell, not into it. Endosmosis is the process where water enters the cell."}],"priority":"★★☆"},"related_words":{"derivatives":["exosmotic (adjective): relating to exosmosis"],"related_terms":["osmosis","endosmose","semipermeable membrane","diffusion","turgor pressure"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exosmose' is a scientific term describing the process where a solvent, usually water, moves out of a cell or system through a semipermeable membrane. This happens when the concentration of solutes (like salts or sugars) is higher outside the cell than inside. Understanding exosmosis is important in biology and related fields to explain how cells respond to changes in their environment. It's the opposite of 'endosmose,' where water moves into the cell."},"example_sentences":[{"sentence":"The high salt concentration outside the cell caused exosmose, leading to dehydration.","translation":"細胞外の高い塩濃度が外浸透を引き起こし、脱水につながった。","type":"scientific context","meaning_category":"cellular biology"},{"sentence":"During the experiment, we observed exosmose as the water moved from the potato cells into the saline solution.","translation":"実験中、ジャガイモの細胞から生理食塩水に水が移動する外浸透を観察した。","type":"experimental setting","meaning_category":"osmotic process"}]}