{"word":"Parleyer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"One who parleys; one who discusses terms with an enemy; a negotiator.","english_definition":"One who engages in a parley, especially with an enemy; a negotiator.","examples":[{"sentence":"The parleyer was sent to the enemy camp to discuss a truce.","translation":"停戦について話し合うため、交渉担当者が敵の陣営に派遣された。"},{"sentence":"He acted as the parleyer between the two warring factions.","translation":"彼は2つの交戦派閥間の交渉役を務めた。"}],"collocations":["chief parleyer","peace parleyer","sent as parleyer"],"synonyms":["negotiator","mediator","interlocutor","diplomat","envoy"],"antonyms":["combatant","fighter","aggressor"]}],"etymology":{"value":"From the verb \"parley\" + \"-er\" (suffix indicating a person who does something). \"Parley\" comes from French \"parler\" (to speak).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrleɪər/","syllables":"Par-ley-er"},"inflection":{"noun_plural":"Parleyers"},"usage_notes":{"explanation":"The term \"parleyer\" is relatively formal and less commonly used in modern English compared to synonyms like \"negotiator\" or \"mediator.\" It specifically implies a discussion or negotiation, often in the context of conflict or disagreement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parleyer attacked the enemy.","correct":"✓ The parleyer negotiated with the enemy.","note":"A parleyer's role is to negotiate, not to fight."},{"incorrect":"✗ She is a good parleyer because she shouts a lot.","correct":"✓ She is a good parleyer because she listens and communicates effectively.","note":"Effective parleying involves good communication and listening skills, not aggression."}],"priority":"★☆☆"},"related_words":{"derivatives":["parley (noun/verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'parleyer' is a relatively uncommon and formal term. It refers to someone who engages in discussions, especially with an enemy, to negotiate terms. Understanding its meaning requires a good vocabulary and familiarity with formal language. It is not a word typically encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The experienced diplomat was chosen as the chief **parleyer**.","translation":"経験豊富な外交官が主任交渉担当者に選ばれた。","type":"noun","meaning_category":"negotiator"},{"sentence":"The **parleyer** risked his life to cross the battlefield and deliver the message.","translation":"交渉担当者は戦場を横断してメッセージを届けるために命を危険にさらした。","type":"noun","meaning_category":"negotiator"},{"sentence":"Both sides agreed to send a **parleyer** to discuss the release of the prisoners.","translation":"双方は捕虜の解放について話し合うために交渉担当者を派遣することに合意した。","type":"noun","meaning_category":"negotiator"}]}