{"word":"nongas","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who is not considered a 'true' or 'real' gamer, often used to imply a lack of skill, knowledge, or dedication to gaming.","english_definition":"(slang, derogatory) A person who is not considered a 'true' or 'real' gamer, often used to imply a lack of skill, knowledge, or dedication to gaming.","examples":[{"sentence":"He's such a nongas, he doesn't even know what a hitbox is.","translation":"彼は本当にゲーマーじゃないな、当たり判定が何かさえ知らないんだから。"},{"sentence":"Don't listen to him, he's just a nongas trying to give advice.","translation":"彼の言うことを聞くな、彼はただのニワカがアドバイスしようとしてるだけだ。"}],"collocations":["casual nongas","tryhard nongas"],"synonyms":["casual","noob","newbie","scrub"],"antonyms":["pro","tryhard","gamer"],"notes":"This term is often used in a derogatory or gatekeeping manner within gaming communities. It can be considered offensive.","origin":"Likely derived from a combination of 'non-' (not) and 'gamer' (someone who plays games)."}],"etymology":{"value":"Likely a portmanteau of 'non-' (prefix meaning 'not') and 'gamer'.","priority":"Low"},"pronunciation":{"ipa":"/ˈnɒŋɡæs/","syllables":"non-gas"},"inflection":{"noun_plural":"nongases"},"usage_notes":{"explanation":"'Nongas' is a slang term used within gaming culture to describe someone who is perceived as not being a 'real' or dedicated gamer. The term is often used pejoratively, implying a lack of skill, knowledge, or commitment to gaming. It's important to note that using this term can be considered offensive and contributes to a culture of gatekeeping within gaming communities.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He's a nongas because he plays games every day.","correct":"He's a casual gamer because he plays games every day.","note":"The term 'nongas' is used to describe someone who is *not* a dedicated gamer, not someone who plays frequently."}],"priority":"Low"},"related_words":{"derivatives":[],"related_terms":["gamer","noob","scrub","casual gamer","tryhard"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency - slang term primarily used within specific online gaming communities.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'nongas' is slang, primarily used within online gaming communities. Understanding it requires familiarity with gaming culture and slang. It's used to describe someone who is not considered a 'true' gamer, often in a derogatory way. Due to its slang nature and potential for offense, it's not a word typically found in formal or general contexts."},"example_sentences":[{"sentence":"That guy is such a nongas, he doesn't even know the basic strategies.","translation":"あいつマジでゲーマーじゃないな、基本的な戦略さえ知らないんだから。","type":"example","meaning_category":"derogatory description"},{"sentence":"Stop being such a nongas and learn the game mechanics!","translation":"ニワカみたいなこと言うのやめて、ゲームの仕組みを学べよ！","type":"example","meaning_category":"derogatory command"}]}