{"word":"resorption","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学・生物学) 再吸収、吸収 (体内の組織や物質が再び体内に吸収されること)","english_definition":"(in medicine and biology) the process by which something that has been deposited in the body is absorbed into the body again.","examples":[{"sentence":"Bone resorption is a natural process, but excessive resorption can lead to osteoporosis.","translation":"骨吸収は自然なプロセスですが、過度の吸収は骨粗鬆症につながる可能性があります。"},{"sentence":"Root resorption can occur in teeth due to various factors.","translation":"歯根吸収は、さまざまな要因により歯に発生する可能性があります。"},{"sentence":"The resorption of the blood clot is a crucial step in wound healing.","translation":"血栓の再吸収は、創傷治癒における重要なステップです。"}],"collocations":["bone resorption (骨吸収)","root resorption (歯根吸収)","tooth resorption (歯の吸収)","tissue resorption (組織吸収)","drug resorption (薬物吸収)"],"synonyms":["absorption","assimilation","uptake","reuptake"],"antonyms":["deposition","ossification","excretion"]}],"etymology":{"value":"Derived from the prefix 're-' (again) and 'sorption,' which comes from the Latin word 'sorbere' meaning 'to suck in, absorb.' Thus, resorption literally means 'to absorb again.'","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈsɔːrpʃən/","syllables":"re-sorp-tion"},"inflection":{"noun_plural":"resorptions"},"usage_notes":{"explanation":"'Resorption' is a technical term primarily used in medical and biological contexts. It refers to the process where previously deposited material or tissue within the body is broken down and absorbed back into the system. This process can be normal and necessary for bodily functions, such as bone remodeling, or it can be pathological, leading to diseases like osteoporosis or tooth loss. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The body is resorbing the food.","correct":"✓ The body is absorbing the food.","note":"'Resorption' refers to the re-absorption of materials already deposited in the body, not the initial absorption of nutrients from food. Use 'absorption' for the latter."},{"incorrect":"✗ Resorption is the opposite of absorption.","correct":"✓ Resorption is a type of absorption, specifically re-absorption.","note":"Resorption is a specific type of absorption where something previously deposited is absorbed again. It's not the opposite of absorption, but a subset of it."}],"priority":"★☆☆"},"related_words":{"derivatives":["resorb (verb: to undergo resorption)","resorptive (adjective: relating to or causing resorption)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resorption' is a specialized term mainly used in medicine and biology. It describes the process where the body absorbs its own tissues or materials that were previously deposited. For example, bone resorption is when the body breaks down and reabsorbs bone tissue. This term is not commonly used in everyday language and is typically encountered in scientific or medical contexts."},"example_sentences":[{"sentence":"The doctor explained that the patient's bone density was decreasing due to increased bone **resorption**.","translation":"医師は、患者の骨密度が骨吸収の増加により低下していると説明しました。","type":"noun","meaning_category":"再吸収 (骨)"},{"sentence":"**Resorption** of the deciduous teeth roots allows the permanent teeth to erupt.","translation":"乳歯の歯根の吸収により、永久歯が生えてくることができます。","type":"noun","meaning_category":"再吸収 (歯)"},{"sentence":"Drug **resorption** in the small intestine is essential for its effectiveness.","translation":"小腸での薬物吸収は、その有効性にとって不可欠です。","type":"noun","meaning_category":"再吸収 (薬物)"}]}