{"word":"single-hung","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(窓が)片上げ下げ式の","english_definition":"(of a window) having one sash that slides vertically while the other remains fixed.","examples":[{"sentence":"We installed single-hung windows in the bedrooms.","translation":"寝室に片上げ下げ窓を取り付けました。"},{"sentence":"The old house had many single-hung windows.","translation":"その古い家には多くの片上げ下げ窓がありました。"}],"collocations":["single-hung window","single-hung sash"],"synonyms":["sash window (in some contexts)"],"antonyms":["double-hung"]},{"part_of_speech":"noun","definition":"片上げ下げ窓","english_definition":"a window having one sash that slides vertically while the other remains fixed.","examples":[{"sentence":"A single-hung is less expensive than a double-hung.","translation":"片上げ下げ窓は両上げ下げ窓よりも安価です。"}],"collocations":["replace a single-hung","install a single-hung"],"synonyms":["sash window (in some contexts)"],"antonyms":["double-hung"]}],"etymology":{"value":"The term 'single-hung' is descriptive, indicating that only one sash (the movable part of the window) is hung or slides, while the other remains stationary.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈhʌŋ/","syllables":"sin-gle-hung"},"inflection":{"notes":"It can function as both an adjective and a noun. The plural noun form is 'single-hungs'."},"usage_notes":{"explanation":"A 'single-hung' window is a type of window where only the bottom sash can slide upwards, while the top sash is fixed in place. This is in contrast to 'double-hung' windows, where both sashes can slide up and down. Single-hung windows are typically less expensive than double-hung windows.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The single hung window was very easy to open both sashes.","correct":"✓ The single-hung window was easy to open.","note":"Single-hung windows only have one operable sash, so it's incorrect to say both sashes open."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["double-hung","sash","sash window","window frame","casement window"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'single-hung' is a technical term related to window construction. Understanding this term requires familiarity with basic architectural terminology. It's primarily used in contexts related to home improvement, construction, or real estate. The opposite, 'double-hung,' is more common, but understanding 'single-hung' is helpful for differentiating window types."},"example_sentences":[{"sentence":"The contractor recommended replacing the old windows with energy-efficient single-hung models.","translation":"請負業者は、古い窓をエネルギー効率の良い片上げ下げモデルに交換することを推奨しました。","type":"adjective","meaning_category":"window type"},{"sentence":"He decided to install a new single-hung in the bathroom.","translation":"彼はお風呂場に新しい片上げ下げ窓を取り付けることにしました。","type":"noun","meaning_category":"window"},{"sentence":"Single-hung windows are a popular choice for their affordability.","translation":"片上げ下げ窓はその手頃な価格で人気があります。","type":"noun","meaning_category":"window type"}]}