{"word":"Sacerdotism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"司祭職至上主義、聖職者至上主義","english_definition":"Belief in the necessity of priests as mediators between God and humankind; the system or principles of sacerdotalism.","examples":[{"sentence":"Sacerdotism emphasizes the role of the priest in performing sacraments.","translation":"司祭職至上主義は、秘蹟を執行する司祭の役割を強調する。"},{"sentence":"Critics of Sacerdotism argue that it creates a hierarchical structure that is not supported by scripture.","translation":"司祭職至上主義の批判者たちは、聖書に支持されていない階層構造を作り出すと主張する。"}],"collocations":["high Sacerdotism","oppose Sacerdotism","reject Sacerdotism"],"synonyms":["priestcraft","hierocracy","clericalism"],"antonyms":["anti-clericalism","laicism"]}],"etymology":{"value":"Derived from 'sacerdos' (Latin for 'priest') + '-ism' (a suffix indicating a belief system or practice).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsæsərdoʊˌtɪzəm/","syllables":"sa-cer-do-tism"},"inflection":{"noun_plural":"Sacerdotisms"},"usage_notes":{"explanation":"'Sacerdotism' refers to the belief system that emphasizes the importance and necessity of a priesthood, often as mediators between God and people. It is often used critically to describe systems where priests have excessive power or influence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Sacerdotism as a hobby.","correct":"✓ He believes in Sacerdotism.","note":"Sacerdotism is a belief system, not a practice or hobby. You believe in it or adhere to it."},{"incorrect":"✗ Sacerdotism is when you are a priest.","correct":"✓ Sacerdotism is the belief in the necessity of priests as mediators.","note":"Sacerdotism is not simply being a priest, but the belief in the importance and necessity of the priesthood."}],"priority":"★☆☆"},"related_words":{"derivatives":["sacerdotal (adjective: relating to priests or the priesthood)","sacerdotally (adverb: in a sacerdotal manner)"],"phrasal_verbs":[],"related_concepts":["clericalism","theocracy","hierarchical church structure"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sacerdotism' is a specialized term related to religious studies and theology. It describes the belief system that emphasizes the necessity and importance of priests as mediators between God and humankind. It is not a commonly used word in everyday conversation and is more likely to be encountered in academic or theological contexts."},"example_sentences":[{"sentence":"The debate over Sacerdotism has been central to many theological discussions.","translation":"司祭職至上主義に関する議論は、多くの神学的議論の中心となってきた。","type":"general","meaning_category":"general"},{"sentence":"Some argue that Sacerdotism undermines the individual's direct relationship with God.","translation":"司祭職至上主義は、個人と神との直接的な関係を弱めると主張する人もいる。","type":"critical","meaning_category":"criticism"}]}