{"word":"heliogravure","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘリオグラビュール、日光写真凹版","english_definition":"A photomechanical intaglio printing process; a print produced by this process.","examples":[{"sentence":"The museum displayed several stunning examples of early heliogravure.","translation":"美術館には、初期のヘリオグラビュールの素晴らしい作例がいくつか展示されていた。"},{"sentence":"Heliogravure produces prints with rich tonal range and fine detail.","translation":"ヘリオグラビュールは、豊かな階調と細部の描写に優れた印刷物を生み出す。"}],"collocations":["fine art heliogravure","early heliogravure","hand-pulled heliogravure"],"synonyms":["photogravure","intaglio print"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek 'helios' (sun), 'graph' (writing or drawing), and 'gravure' (engraving). Literally, 'sun-engraving'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːlioʊɡrəˈvjuːr/","syllables":"he-li-o-gra-vure"},"inflection":{"noun_plural":"heliogravures"},"usage_notes":{"explanation":"Heliogravure is a specific type of photogravure, an intaglio printing process where an image is photographically transferred to a metal plate (usually copper) and then etched. The plate is then inked, and the ink is transferred to paper under high pressure, creating a print. It is known for its high quality and rich tonal range, making it popular for fine art and photographic reproductions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a heliograph.","correct":"✓ He made a heliogravure.","note":"A heliograph is a signaling device using mirrors, not a printing process."},{"incorrect":"✗ Heliogravure is a type of relief printing.","correct":"✓ Heliogravure is a type of intaglio printing.","note":"Heliogravure is an intaglio process, where the image is etched into the plate, unlike relief printing where the image is raised."}],"priority":"★★☆"},"related_words":{"derivatives":["photogravure","gravure","intaglio"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heliogravure' is a specialized term referring to a specific type of high-quality printing process. It's not commonly used in everyday conversation but is relevant in the context of fine art, photography, and printing history. Understanding the term requires familiarity with printing techniques and art history.","priority":"★★☆"},"example_sentences":[{"sentence":"The book featured exquisite heliogravure reproductions of the artist's paintings.","translation":"その本には、その画家の絵画の精巧なヘリオグラビュール複製が掲載されていた。","type":"noun","meaning_category":"printing process"},{"sentence":"Heliogravure was a popular method for reproducing photographs in the early 20th century.","translation":"ヘリオグラビュールは、20世紀初頭に写真を複製するための一般的な方法だった。","type":"noun","meaning_category":"historical use"}]}