{"word":"Onychosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"爪の病気、爪の異常","english_definition":"A disease or deformity of the nails.","examples":[{"sentence":"Onychosis can be caused by a variety of factors, including fungal infections and trauma.","translation":"爪の病気は、真菌感染症や外傷を含む様々な要因によって引き起こされる可能性があります。"},{"sentence":"Treatment for onychosis depends on the underlying cause.","translation":"爪の病気の治療は、根本的な原因によって異なります。"}],"collocations":["onychosis treatment","types of onychosis","onychosis symptoms"],"synonyms":["nail disease","nail disorder","nail abnormality"],"antonyms":[]}],"etymology":{"value":"From Greek 'onyx' (nail, claw) + '-osis' (denoting a process, condition, or state, usually abnormal or diseased).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnɪˈkoʊsɪs/","syllables":"on-y-cho-sis"},"inflection":{"noun_plural":"onychoses"},"usage_notes":{"explanation":"'Onychosis' is a general term referring to any non-inflammatory condition or disease of the nails. It is not a specific diagnosis but rather a category encompassing various nail disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have onychosis, it's a fungal infection.","correct":"✓ I have onychomycosis, which is a fungal infection of the nail. / ✓ I have onychosis, likely caused by a fungal infection.","note":"Onychosis is a general term. If the specific condition is a fungal infection, the more accurate term is 'onychomycosis'."},{"incorrect":"✗ Onychosis is contagious.","correct":"✓ Some types of onychosis, like onychomycosis, are contagious.","note":"Not all types of onychosis are contagious. Contagiousness depends on the specific underlying cause."}],"priority":"★★☆"},"related_words":{"derivatives":["onychomycosis (真菌による爪の感染症)","onycholysis (爪甲剥離症)","onychia (爪の炎症)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Onychosis' is a technical term used in medicine to describe any disease or abnormality of the nails. It's not a common word in everyday language, but it's important for healthcare professionals to understand. It's a broad term that encompasses various specific nail conditions, such as fungal infections or nail deformities.","priority":"★★☆"},"example_sentences":[{"sentence":"The dermatologist diagnosed the patient with onychosis and recommended further testing.","translation":"皮膚科医は患者を爪の病気と診断し、さらなる検査を推奨しました。","type":"general","meaning_category":"爪の病気"},{"sentence":"Different types of onychosis require different treatment approaches.","translation":"爪の病気の種類が異なれば、異なる治療アプローチが必要になります。","type":"general","meaning_category":"爪の病気"}]}