{"word":"hematophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血液恐怖症、血に対する強い恐怖または嫌悪感","english_definition":"An extreme or irrational fear of blood.","examples":[{"sentence":"She suffers from hematophobia and faints at the sight of blood.","translation":"彼女は血液恐怖症を患っており、血を見ると気を失います。"},{"sentence":"Hematophobia can make it difficult to seek medical treatment.","translation":"血液恐怖症は、医療を受けることを困難にする可能性があります。"}],"collocations":["severe hematophobia (重度の血液恐怖症)","overcome hematophobia (血液恐怖症を克服する)","suffer from hematophobia (血液恐怖症を患う)"],"synonyms":["hemophobia","blood phobia"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「haima」（血）+「phobos」（恐怖）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːmətəˈfoʊbiə/","syllables":"he-ma-to-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hematophobia is a specific phobia characterized by an intense and irrational fear of blood. It can manifest in various ways, including anxiety, panic attacks, fainting, and avoidance of situations where blood might be present. It is often treated with therapy, such as cognitive-behavioral therapy (CBT).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have hematophobia, so I'm scared of doctors.","correct":"✓ I have hematophobia, so I'm scared of blood. / ✓ Because I have hematophobia, I avoid doctors.","note":"Hematophobia is specifically the fear of blood, not necessarily doctors, although the fear of blood may lead to avoiding doctors."}],"priority":"★★☆"},"related_words":{"derivatives":["phobic (形容詞: 恐怖症の)","phobia (名詞: 恐怖症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hematophobia is a relatively uncommon term referring to the intense and irrational fear of blood. Understanding this term requires familiarity with medical terminology related to phobias. The impact of hematophobia on an individual's life can be significant, potentially leading to avoidance of medical care and other situations where blood might be present.","priority":"★★☆"},"example_sentences":[{"sentence":"His hematophobia made it impossible for him to work in the medical field.","translation":"彼の血液恐怖症のために、医療分野で働くことは不可能でした。","type":"general","meaning_category":"血液恐怖症"},{"sentence":"Cognitive-behavioral therapy can be effective in treating hematophobia.","translation":"認知行動療法は血液恐怖症の治療に効果的です。","type":"treatment","meaning_category":"血液恐怖症"},{"sentence":"Even a small cut can trigger a panic attack in someone with hematophobia.","translation":"血液恐怖症の人にとって、小さな切り傷でさえパニック発作を引き起こす可能性があります。","type":"symptoms","meaning_category":"血液恐怖症"}]}