{"word":"pearlstone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パーライト、真珠岩","english_definition":"A volcanic glass that has a relatively high water content. When heated to a suitable temperature, pearlstone expands greatly, producing a lightweight material used for insulation, horticulture, and other purposes.","examples":[{"sentence":"Pearlstone is often used as a soil amendment in gardening.","translation":"パーライトは園芸で土壌改良材としてよく使用されます。"},{"sentence":"The insulation in the walls is made from expanded pearlstone.","translation":"壁の断熱材は発泡パーライトで作られています。"}],"collocations":["expanded pearlstone","horticultural pearlstone","pearlstone insulation"],"synonyms":["perlite"],"antonyms":[]},{"part_of_speech":"noun","definition":"(地質学) 真珠岩","english_definition":"(Geology) A glassy volcanic rock, a form of obsidian, that contains small spherulites with a pearly luster.","examples":[{"sentence":"The sample was identified as pearlstone due to its characteristic pearly appearance.","translation":"そのサンプルは特徴的な真珠のような外観から真珠岩であると同定された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'pearl' (referring to its pearly luster) and 'stone'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɜːrlstoʊn/","syllables":"pearl-stone"},"inflection":{"noun_plural":"pearlstones"},"usage_notes":{"explanation":"'Pearlstone' refers to a type of volcanic glass. It is often used interchangeably with 'perlite', especially when referring to the expanded form used in horticulture and construction. In geology, 'pearlstone' specifically refers to the unexpanded rock with a pearly luster.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought pearlstone for my coffee.","correct":"✓ I bought pearlstone for my plants.","note":"Pearlstone is used in gardening, not for coffee. You might be thinking of coffee beans or a coffee filter."}],"priority":"★★☆"},"related_words":{"derivatives":["perlitic"],"phrasal_verbs":[],"related_terms":["obsidian","volcanic glass","perlite"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Pearlstone' is a technical term, primarily used in gardening, construction, and geology. It refers to a specific type of volcanic glass that expands when heated. Understanding its usage requires some familiarity with these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The gardener mixed pearlstone into the soil to improve drainage.","translation":"庭師は排水性を改善するためにパーライトを土に混ぜた。","type":"noun","meaning_category":"horticulture"},{"sentence":"The geologist identified the rock as pearlstone.","translation":"地質学者はその岩石を真珠岩であると特定した。","type":"noun","meaning_category":"geology"},{"sentence":"Expanded pearlstone is a lightweight and effective insulation material.","translation":"発泡パーライトは軽量で効果的な断熱材である。","type":"noun","meaning_category":"construction"}]}