{"word":"jaildom","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(BDSM) 監禁、拘束、刑務所プレイ","english_definition":"(BDSM) A form of BDSM involving imprisonment, restraint, or prison roleplay.","examples":[{"sentence":"Jaildom can involve various levels of restraint and roleplay.","translation":"刑務所プレイは様々なレベルの拘束とロールプレイを含むことがある。"},{"sentence":"Some practitioners of jaildom enjoy the power dynamics involved.","translation":"刑務所プレイの実践者の中には、そこに含まれる力の関係を楽しむ人もいる。"}],"collocations":["prison roleplay","bondage","restraint","BDSM","power exchange"],"synonyms":["imprisonment play","restraint play"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'jail' and 'domination', reflecting the themes of imprisonment and dominance/submission within the BDSM context.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒeɪldəm/","syllables":"jail-dom"},"inflection":{"noun_plural":"jaildoms"},"usage_notes":{"explanation":"'Jaildom' is a term used within the BDSM community to describe activities that involve imprisonment, restraint, and/or roleplay scenarios related to prisons or confinement. It often explores themes of power dynamics, control, and submission. Due to its specific and potentially sensitive nature, it is primarily used within relevant communities and discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was sentenced to jaildom for his crimes.","correct":"✓ He was sentenced to jail for his crimes.","note":"'Jaildom' refers to a BDSM practice, not actual imprisonment. Use 'jail' or 'prison' for legal sentences."},{"incorrect":"✗ She practices jaildom as a form of punishment.","correct":"✓ She practices jaildom as a consensual BDSM activity.","note":"Jaildom should always be consensual and not used as a form of non-consensual punishment."}],"priority":"★★☆"},"related_words":{"derivatives":["jail (noun: 刑務所, verb: 投獄する)","domination (noun: 支配)","submission (noun: 服従)","BDSM (noun: ボンデージ・ディシプリン・サディズム・マゾヒズム)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specific to BDSM terminology)","frequency_google_ngram":"Low frequency (Specific to BDSM contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Jaildom' is a specialized term within the BDSM community, referring to roleplay and activities centered around imprisonment, restraint, and power dynamics. Understanding this term requires familiarity with BDSM concepts and terminology. It is not a commonly used word outside of these specific contexts."},"example_sentences":[{"sentence":"Their jaildom scene involved handcuffs and a mock prison cell.","translation":"彼らの刑務所プレイのシーンには手錠と模擬刑務所の独房が含まれていた。","type":"noun","meaning_category":"BDSM practice"},{"sentence":"He explored his interest in jaildom through online communities.","translation":"彼はオンラインコミュニティを通して刑務所プレイへの興味を探求した。","type":"noun","meaning_category":"BDSM practice"}]}