{"word":"Disinvestiture","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)叙任権闘争において、聖職者の地位や権威を剥奪すること、または世俗の支配者が聖職者の叙任権を放棄すること。","english_definition":"(historical) The act of depriving someone of rank, authority, or property; specifically, in the Investiture Controversy, the act of depriving a cleric of his office or authority, or the renunciation by a secular ruler of the right to invest ecclesiastics.","examples":[{"sentence":"The disinvestiture of the bishop was a major blow to the church's power in the region.","translation":"その司教の地位剥奪は、その地域における教会の権力にとって大きな打撃であった。"},{"sentence":"The emperor's disinvestiture of his claim to appoint bishops marked a turning point in the conflict.","translation":"皇帝が司教を任命する権利を放棄したことは、紛争の転換点となった。"}],"collocations":["act of disinvestiture","papal disinvestiture","imperial disinvestiture"],"synonyms":["deprivation","divestment","removal","abdication","renunciation"],"antonyms":["investiture","appointment","installation"]}],"etymology":{"value":"From 'dis-' (a prefix meaning 'removal' or 'reversal') + 'investiture' (the act of formally conferring a right or title).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪnˈvɛstɪtʃər/","syllables":"dis-in-ves-ti-ture"},"inflection":{"noun_plural":"disinvestitures"},"usage_notes":{"explanation":"'Disinvestiture' is primarily used in historical contexts, particularly when discussing the Investiture Controversy, a significant conflict in medieval Europe between the Church and secular rulers over who had the authority to appoint church officials (bishops, abbots, etc.). It is less commonly used in modern contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's disinvestiture led to increased profits.","correct":"✓ The company's divestment led to increased profits.","note":"In modern financial contexts, 'divestment' is the more appropriate term for selling off assets or investments. 'Disinvestiture' is more specifically tied to historical or symbolic acts of removing authority or rank."}],"priority":"★☆☆"},"related_words":{"derivatives":["disinvest (verb): to deprive of rank or authority; to divest of property or investments","investiture (noun): the formal conferring of a right or title"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency. Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disinvestiture' is a specialized term primarily encountered in historical discussions, particularly those relating to the Investiture Controversy in medieval Europe. It refers to the act of depriving someone of rank or authority, or the renunciation of the right to confer such authority. Due to its specific historical context, it is not a commonly used word in modern English. Understanding requires familiarity with medieval history and ecclesiastical terms."},"example_sentences":[{"sentence":"The papal disinvestiture of the emperor was a bold move that challenged the established power structure.","translation":"教皇による皇帝の地位剥奪は、確立された権力構造に挑戦する大胆な行動であった。","type":"noun","meaning_category":"historical"},{"sentence":"The disinvestiture ceremony marked the end of the king's control over the church.","translation":"その地位剥奪の儀式は、教会に対する国王の支配の終わりを告げた。","type":"noun","meaning_category":"historical"}]}