{"word":"justificatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"正当化する、弁明する、正当化の性質を持つ","english_definition":"serving to justify or providing justification; offering or expressing justification.","examples":[{"sentence":"The document included justificatory arguments for the decision.","translation":"その文書には、決定を正当化するための議論が含まれていた。"},{"sentence":"He wrote a justificatory essay explaining his actions.","translation":"彼は自分の行動を説明する正当化のエッセイを書いた。"},{"sentence":"The report was justificatory in tone, defending the company's policies.","translation":"その報告書は、会社のポリシーを擁護する、正当化の口調だった。"}],"collocations":["justificatory arguments","justificatory reasons","justificatory essay","justificatory tone","justificatory evidence"],"synonyms":["defensive","exculpatory","apologetic","vindictive (in the sense of vindicating)","explanatory"],"antonyms":["condemnatory","accusatory","critical","reproachful"]}],"etymology":{"value":"Derived from 'justify' + '-ic' + '-atory'. 'Justify' comes from Latin 'justificare' (to make just), from 'justus' (just, right). The suffix '-atory' indicates a quality or function of serving to.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒʌˈstɪfɪkətɔːri/","syllables":"jus-tif-i-ca-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are less common for this word."},"usage_notes":{"explanation":"'Justificatory' is primarily used in formal or academic contexts to describe something that provides or attempts to provide justification. It often implies a need to defend or explain an action, decision, or belief. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The justificatory of his actions was clear.","correct":"✓ The justification of his actions was clear.","note":"'Justificatory' is an adjective, so it modifies a noun. 'Justification' is the noun form meaning the act of justifying or the reason for being justified."},{"incorrect":"✗ He gave a justify speech.","correct":"✓ He gave a justificatory speech.","note":"'Justify' is a verb, while 'justificatory' is the adjective. Make sure to use the correct part of speech."}],"priority":"★★☆"},"related_words":{"derivatives":["justify (verb)","justification (noun)","justificatively (adverb)","justificative (adjective - less common)"],"related_concepts":["ethics","moral philosophy","legal defense","rationalization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in academic or legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Justificatory' is a formal adjective that means something serves to justify or provides justification. It's often used in academic, legal, or philosophical contexts when discussing reasons or arguments that defend or explain an action, decision, or belief. Because of its specific and formal usage, it's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The politician offered a justificatory statement after the scandal broke.","translation":"その政治家はスキャンダルが発覚した後、正当化の声明を発表した。","type":"adjective","meaning_category":"正当化する"},{"sentence":"The book presents a justificatory account of the war.","translation":"その本は戦争の正当化の説明を提示している。","type":"adjective","meaning_category":"正当化する"},{"sentence":"The lawyer presented justificatory evidence to the court.","translation":"弁護士は裁判所に正当化の証拠を提出した。","type":"adjective","meaning_category":"正当化の性質を持つ"}]}