{"word":"nativize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(外国のものを)自国化する、土着化する、帰化させる","english_definition":"to adapt (something foreign) to local conditions or customs; to naturalize.","examples":[{"sentence":"The company nativized its marketing strategy to appeal to local consumers.","translation":"その会社は、地元の消費者にアピールするために、マーケティング戦略を自国化した。"},{"sentence":"The recipe was nativized with local ingredients.","translation":"そのレシピは地元の食材を使って土着化された。"},{"sentence":"They tried to nativize the foreign workers by teaching them the local language and customs.","translation":"彼らは外国人労働者に現地の言語や習慣を教えることで、帰化させようとした。"}],"collocations":["nativize a product (製品を自国化する)","nativize a strategy (戦略を自国化する)","nativize a recipe (レシピを土着化する)","nativize foreign workers (外国人労働者を帰化させる)"],"synonyms":["localize","indigenize","domesticate","naturalize","adapt","acclimatize"],"antonyms":["globalize","internationalize","exoticize","alienate"]},{"part_of_speech":"verb","transitivity":"vi","definition":"自国化する、土着化する、帰化する","english_definition":"to become adapted to local conditions or customs; to become naturalized.","examples":[{"sentence":"Over time, the imported plant nativized and became part of the local ecosystem.","translation":"時が経つにつれて、輸入された植物は自国化し、地元の生態系の一部となった。"},{"sentence":"The foreign concept slowly nativized within the community.","translation":"その外国の概念は、コミュニティ内でゆっくりと土着化した。"}],"collocations":["a plant nativizes (植物が自国化する)","a concept nativizes (概念が土着化する)"],"synonyms":["become localized","become indigenized","become domesticated","become naturalized","adapt","acclimatize"],"antonyms":["remain foreign","remain alien"]}],"etymology":{"value":"\"Native\" + \"-ize\".  From the word \"native\" meaning belonging to a particular place by birth or origin, combined with the suffix \"-ize\" which indicates to make or become.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪtɪvaɪz/","syllables":"na-tiv-ize"},"inflection":{"verb_forms":{"present_simple":["nativize","nativizes"],"past_simple":"nativized","past_participle":"nativized","present_participle":"nativizing"}},"usage_notes":{"explanation":"\"Nativize\" is used to describe the process of adapting something that is foreign or imported to fit the local culture, environment, or customs. It can apply to various subjects, including products, strategies, concepts, and even people. It suggests a deliberate effort to make something more familiar and acceptable within a specific local context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company nativized at the local market.","correct":"✓ The company nativized its products for the local market.","note":"\"Nativize\" is typically a transitive verb, requiring a direct object (what is being nativized)."},{"incorrect":"✗ They are nativizing to the country.","correct":"✓ They are becoming nativized to the country.","note":"When referring to people, it's more common to use \"become nativized\" or \"become naturalized\" to describe the process of adapting to a new country.  \"Nativize\" is more often used for things like products or strategies."}],"priority":"★★☆"},"related_words":{"derivatives":["nativization (名詞: 自国化、土着化、帰化)"],"synonyms":["localize","indigenize","domesticate","naturalize","adapt","acclimatize"],"antonyms":["globalize","internationalize","exoticize","alienate"],"related_concepts":["cultural appropriation","assimilation","acculturation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nativize\" means to change something that comes from another country or culture so that it fits better with the local culture. For example, a company might nativize its advertising by using local actors and settings. This word is not very common and is usually used in discussions about culture, business, or language. It is more formal and technical than words like \"adapt\" or \"localize.\""},"example_sentences":[{"sentence":"The restaurant nativized its menu by adding local dishes.","translation":"そのレストランは地元の料理を追加することで、メニューを自国化した。","type":"verb","meaning_category":"土着化する (メニュー)"},{"sentence":"The software company nativized its interface for the Japanese market.","translation":"そのソフトウェア会社は、日本の市場向けにインターフェースを自国化した。","type":"verb","meaning_category":"自国化する (インターフェース)"},{"sentence":"The immigrant family slowly nativized to their new country.","translation":"その移民家族はゆっくりと新しい国に帰化した。","type":"verb","meaning_category":"帰化する"}]}