{"word":"bodysurfing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボディーサーフィン","english_definition":"The art and sport of riding a wave without the use of a surfboard or other flotation device; the surfer uses their body and hands to glide along the face of the wave.","examples":[{"sentence":"Bodysurfing is a popular activity at this beach because of the consistent waves.","translation":"このビーチでは波が安定しているので、ボディーサーフィンが人気のアクティビティです。"},{"sentence":"He's been bodysurfing since he was a kid and is really good at it.","translation":"彼は子供の頃からボディーサーフィンをしていて、とても上手です。"}],"collocations":["go bodysurfing (ボディーサーフィンに行く)","bodysurfing fins (ボディーサーフィン用フィン)","bodysurfing handplane (ボディーサーフィン用ハンドプレーン)"],"synonyms":["wave riding (一般的な波乗り)"],"antonyms":["surfing (サーフィン)","paddleboarding (パドルボーディング)"],"related_sports":["swimming","surfing","snorkeling"]}],"etymology":{"value":"Combination of 'body' and 'surfing', indicating that the body itself is used to surf the wave.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒdiˌsɜːrfɪŋ/","syllables":"bod-y-surf-ing"},"inflection":{"noun_plural":"bodysurfings (rarely used in plural form)"},"usage_notes":{"explanation":"Bodysurfing involves swimming out to a wave, positioning oneself to catch it, and then using the body's natural buoyancy and movements, along with the hands for steering, to ride the wave back to shore. Some bodysurfers use swim fins for added propulsion and handplanes for increased lift and control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to body surf tomorrow.","correct":"✓ I'm going bodysurfing tomorrow.","note":"'Bodysurfing' is a single word that functions as a noun (activity) or gerund. 'Body surf' as two separate words is less common and can sound awkward."}],"priority":"★★☆"},"related_words":{"derivatives":["bodysurfer (noun: ボディーサーファー)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in coastal areas.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"Bodysurfing is a sport where you ride waves using only your body, without a surfboard. You swim out, catch a wave, and use your arms and legs to stay on the wave as it carries you to shore. Some people use special fins or handboards to help them go faster and have more control. It's a fun way to enjoy the ocean!"},"example_sentences":[{"sentence":"The waves were perfect for bodysurfing this morning.","translation":"今朝は波がボディーサーフィンに最適だった。","type":"general"},{"sentence":"She learned how to bodysurf from her father.","translation":"彼女は父親からボディーサーフィンを教わった。","type":"learning"},{"sentence":"He prefers bodysurfing to regular surfing because it feels more connected to the ocean.","translation":"彼はボディーサーフィンの方がサーフィンよりも海との一体感を感じられるので好きだ。","type":"preference"},{"sentence":"Bodysurfing can be dangerous if you're not careful about the currents.","translation":"ボディーサーフィンは、潮流に注意しないと危険な場合がある。","type":"safety"}]}