{"word":"polypidom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"群体性ヒドロ虫やコケムシなどの骨格または外被","english_definition":"The skeleton or outer covering of a colonial hydroid or bryozoan.","examples":[{"sentence":"The polypidom of many bryozoans is made of calcium carbonate.","translation":"多くのコケムシの群体骨格は炭酸カルシウムでできている。"},{"sentence":"The shape of the polypidom can be used to identify different species of hydroids.","translation":"群体骨格の形状は、さまざまな種類のヒドロ虫を識別するために使用できる。"}],"collocations":["bryozoan polypidom","hydroid polypidom","calcareous polypidom","chitinous polypidom"],"synonyms":["skeleton","exoskeleton","test","perisarc","zoarium"],"antonyms":[]}],"etymology":{"value":"Derived from 'polyp' (referring to the individual zooids) and '-idom' (a suffix indicating a structure or covering).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈpaɪdəm/","syllables":"pol-yp-i-dom"},"inflection":{"noun_plural":"polypidoms"},"usage_notes":{"explanation":"The term 'polypidom' is primarily used in marine biology and zoology to describe the structural support system of colonial organisms like bryozoans (also known as moss animals or sea mats) and hydroids. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polypidom is a single animal.","correct":"✓ The polypidom is the structure that supports a colony of animals.","note":"A polypidom is a structure housing a colony, not a single organism."}],"priority":"★★☆"},"related_words":{"derivatives":["polyp","zooid","bryozoan","hydroid","colony"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'polypidom' is a highly specialized zoological term, primarily encountered in scientific literature concerning marine invertebrates, particularly bryozoans and hydroids. Understanding requires familiarity with colonial organisms and their skeletal structures. Due to its limited usage, it is not part of general vocabulary.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The delicate, branching polypidom of the sea fern swayed gently in the current.","translation":"繊細で枝分かれしたウミシダの群体骨格は、潮流の中で穏やかに揺れた。","type":"scientific","meaning_category":"structure"},{"sentence":"Analysis of the polypidom's composition revealed high concentrations of trace metals.","translation":"群体骨格の組成分析により、高濃度の微量金属が検出された。","type":"scientific","meaning_category":"composition"}]}