{"word":"boyishly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"少年らしく、男の子っぽく","english_definition":"in a manner characteristic of a boy; in a way that is youthful, energetic, or innocent.","examples":[{"sentence":"He grinned boyishly, revealing a gap between his teeth.","translation":"彼は少年っぽくニッと笑い、歯の隙間を見せた。"},{"sentence":"She admired his boyishly charming manner.","translation":"彼女は彼の少年らしい魅力的な態度に感心した。"},{"sentence":"The actor played the role with boyishly enthusiastic energy.","translation":"その俳優は少年のような熱意あふれるエネルギーでその役を演じた。"}],"collocations":["boyishly charming","boyishly enthusiastic","boyishly grinning","boyishly innocent"],"synonyms":["youthfully","childishly","naively","innocently","energetically"],"antonyms":["maturely","sophisticatedly","adultly"]}],"etymology":{"value":"The word 'boyishly' is formed by adding the suffix '-ly' to the adjective 'boyish'. 'Boyish' itself comes from 'boy', which has Old English origins in the word 'bōia', meaning 'boy' or 'servant'. The suffix '-ish' indicates a quality or characteristic of something. Therefore, 'boyishly' describes something done in a manner resembling that of a boy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɔɪɪʃli/","syllables":"boy-ish-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Boyishly' describes actions or qualities that are typical of a young boy. This can include traits like enthusiasm, innocence, energy, or a certain type of charm. It's often used to describe men who retain youthful qualities into adulthood. The word can sometimes carry a slightly negative connotation if it suggests immaturity or lack of seriousness, but often it's used in a positive or neutral way to describe someone's demeanor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted boyish.","correct":"✓ He acted boyishly.","note":"'Boyish' is an adjective, so it describes a noun. 'Boyishly' is an adverb, so it describes a verb or action. To describe how someone acted, you need the adverb 'boyishly'."},{"incorrect":"✗ She dressed boyishly, with a long gown.","correct":"✓ She dressed boyishly, with jeans and a t-shirt.","note":"'Boyishly' implies clothing or behavior that is typical of boys. A long gown would be incongruous with a boyish style."}],"priority":"★★☆"},"related_words":{"derivatives":["boyish (adjective)","boy (noun)"],"phrasal_verbs":[],"related_adverbs":["youthfully","childishly"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'boyishly' is used to describe actions or qualities that are characteristic of a young boy. It is formed by adding '-ly' to the adjective 'boyish'. It is not a very common word, but it is useful for describing someone who has youthful or energetic qualities. It is important to use it appropriately, as it can sometimes imply immaturity."},"example_sentences":[{"sentence":"He scratched his head boyishly, trying to remember the answer.","translation":"彼は少年っぽく頭を掻きながら、答えを思い出そうとした。","type":"adverb","meaning_category":"manner"},{"sentence":"She smiled boyishly at the compliment, her cheeks flushing.","translation":"彼女は褒め言葉に少年っぽく微笑み、頬を赤らめた。","type":"adverb","meaning_category":"demeanor"},{"sentence":"The young actor played the role boyishly, bringing a sense of innocence to the character.","translation":"その若い俳優は少年っぽくその役を演じ、そのキャラクターに無邪気さをもたらした。","type":"adverb","meaning_category":"performance"}]}