{"word":"raw-head","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"（主にスコットランドとイングランド北部の方言）子供を怖がらせるために使われる、水に住む架空の怪物。","english_definition":"(chiefly Scottish and northern English dialect) a mythical water-dwelling monster used to frighten children.","examples":[{"sentence":"Be good, or the raw-head and bloody bones will get you!","translation":"いい子にしていないと、ローヘッド・アンド・ブラッディボーンズ（生首と血まみれの骨）が来るぞ！"},{"sentence":"Children were warned to stay away from the dark pools, lest the raw-head should catch them.","translation":"子供たちは、ローヘッドに捕まらないように、暗い水たまりに近づかないように警告された。"}],"collocations":["raw-head and bloody bones (生首と血まみれの骨。同様の子供を怖がらせる怪物)"],"synonyms":["bogeyman","boogeyman","monster","spirit"],"antonyms":[]}],"etymology":{"value":"「raw」（生の）と「head」（頭）の組み合わせ。おそらく、水から突き出た生首のようなイメージから来ている。","priority":"中"},"pronunciation":{"ipa":"/ˌrɔː ˈhɛd/","syllables":"raw-head"},"inflection":{"notes":"複数形は raw-heads"},"usage_notes":{"explanation":"「raw-head」は、主にスコットランドとイングランド北部の方言で使用される古い言葉で、子供を怖がらせるために使われる架空の怪物です。同様の怪物として「raw-head and bloody bones」という表現もあります。現代英語ではほとんど使われず、文学作品や特定の地域の方言に触れる場合にのみ見られることがあります。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a raw-head in the forest.","correct":"✓ I read about a raw-head in a book of Scottish folklore.","note":"「raw-head」は架空の怪物なので、実際に「見た」とは言いません。文献や物語の中で言及されることが多いです。"}],"priority":"低"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["bogeyman","boogeyman","bloody bones"],"priority":"中"},"level_frequency":{"CEFR":"該当なし（非常にまれな語彙）","frequency_google_ngram":"非常に低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"「raw-head」は、主にスコットランドとイングランド北部の方言に限定された、古く、ほとんど使われなくなった単語です。現代英語の一般的な語彙には含まれておらず、文学作品や特定の地域文化に触れる場合にのみ出会う可能性があります。この単語を理解するには、地域の方言や民間伝承に関する知識が必要です。"},"example_sentences":[{"sentence":"The old woman warned the children about the dangers of the loch, telling tales of the raw-head that lurked beneath the surface.","translation":"老婆は子供たちに湖の危険について警告し、水面下に潜むローヘッドの話をした。","type":"typical usage","meaning_category":"架空の怪物"},{"sentence":"In some versions of the folktale, the raw-head is described as a headless corpse that rises from the water to drag unsuspecting victims to their doom.","translation":"民話のいくつかのバージョンでは、ローヘッドは水から現れて不注意な犠牲者を破滅に引きずり込む、首なしの死体として描写されている。","type":"description","meaning_category":"架空の怪物"}]}