{"word":"pointingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"それとなく、当てつけるように、意味ありげに、露骨に","english_definition":"in a manner that clearly directs attention to someone or something, often in a way that expresses criticism or disapproval.","examples":[{"sentence":"She looked at him pointingly, as if to say he should be quiet.","translation":"彼女は彼に黙るべきだと言うかのように、当てつけるように彼を見た。"},{"sentence":"He ignored her question pointingly.","translation":"彼は彼女の質問をわざと無視した。"},{"sentence":"The teacher looked at the student pointingly when he started talking out of turn.","translation":"先生は生徒が勝手に話し始めたとき、当てつけるようにその生徒を見た。"}],"collocations":["look pointingly","ignore pointingly","stare pointingly","cough pointingly"],"synonyms":["deliberately","expressively","significantly","meaningfully","emphatically","obviously","intentionally","ostentatiously"],"antonyms":["vaguely","subtly","indirectly","unobtrusively"]}],"etymology":{"value":"The word \"pointingly\" is formed by adding the suffix \"-ly\" to the adjective \"pointing.\" \"Pointing\" comes from the verb \"point,\" which originates from the Old French word \"pointe,\" meaning \"sharp end, tip.\" The sense of directing attention comes from the idea of a sharp object directing focus.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɔɪntɪŋli/","syllables":"point-ing-ly"},"inflection":{"notes":"As an adverb, \"pointingly\" does not have different forms."},"usage_notes":{"explanation":"\"Pointingly\" describes an action done in a way that is very clear and direct, often to express a specific message or feeling, such as disapproval or criticism. It implies a deliberate and obvious action intended to draw attention. The action is not subtle; it's done in a way that makes the intention very clear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She pointingly smiled at him.","correct":"✓ She smiled at him pointingly.","note":"The adverb \"pointingly\" usually comes after the verb it modifies, especially when the verb is simple. However, placement can vary based on emphasis. \"She pointingly smiled\" is grammatically correct but less common than \"She smiled pointingly.\""},{"incorrect":"✗ He pointedly the mistake.","correct":"✓ He pointed out the mistake pointingly.","note":"\"Pointingly\" modifies how something is done, not the direct object. To use \"pointingly\" in this context, use the phrasal verb \"point out\" and modify it with the adverb."}],"priority":"★★☆"},"related_words":{"derivatives":["point (noun, verb)","pointing (adjective)","pointless (adjective)","pointer (noun)"],"phrases":["point out (verb)","get the point (idiom)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"pointingly\" means doing something in a very clear and direct way, often to show disapproval or to make a specific point. It suggests that the action is deliberate and intended to draw attention. It is not a common word, so it is more likely to be encountered in advanced texts or formal writing."},"example_sentences":[{"sentence":"The manager stared at the employee pointingly after he arrived late for the meeting.","translation":"部長は会議に遅刻した従業員を、当てつけるように見つめた。","type":"adverb","meaning_category":"露骨に"},{"sentence":"She sighed pointingly when he started talking about his ex-girlfriend again.","translation":"彼がまた元カノの話を始めたとき、彼女は当てつけるようにため息をついた。","type":"adverb","meaning_category":"当てつけるように"},{"sentence":"He placed the blame on her pointingly, leaving no room for doubt.","translation":"彼は疑いの余地がないほど、彼女に当てつけるように責任をなすりつけた。","type":"adverb","meaning_category":"意味ありげに"}]}