{"word":"metagenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学物質などが)変異原性の、突然変異を引き起こす","english_definition":"Capable of causing mutation; mutagenic.","examples":[{"sentence":"The study investigated the metagenic effects of the chemical compound.","translation":"その研究では、その化合物が持つ変異原性効果が調査された。"},{"sentence":"Metagenic substances should be handled with caution in the laboratory.","translation":"変異原性物質は実験室で注意して取り扱うべきである。"}],"collocations":["metagenic effect","metagenic potential","metagenic substance"],"synonyms":["mutagenic","mutation-inducing"],"antonyms":["non-mutagenic"]}],"etymology":{"value":"Derived from 'meta-' (meaning 'change' or 'transformation') and '-genic' (meaning 'producing' or 'causing').","priority":"★★☆"},"pronunciation":{"ipa":"ˌmetəˈdʒenɪk/","syllables":"me-ta-gen-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'metagenic' is primarily used in scientific and technical contexts, particularly in fields like genetics, toxicology, and environmental science. It describes substances or agents that can induce mutations in DNA. It's important to distinguish it from 'mutagenic', which is a more common and general term for mutation-causing agents. 'Metagenic' can sometimes imply a more complex or indirect mechanism of mutation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed a metagenic drug.","correct":"✓ The doctor prescribed a non-mutagenic drug.","note":"Metagenic drugs are generally avoided due to their potential to cause mutations. A non-mutagenic drug is more likely to be prescribed."},{"incorrect":"✗ Metagenic is a good thing for health.","correct":"✓ Metagenic substances can be harmful to health.","note":"Metagenic substances can cause mutations in DNA, which can lead to health problems such as cancer."}],"priority":"★★☆"},"related_words":{"derivatives":["mutagen (名詞: 変異原)","mutagenesis (名詞: 突然変異誘発)"],"related_terms":["carcinogenic (発がん性の)","teratogenic (催奇形の)","genotoxic (遺伝毒性の)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'metagenic' is a technical term used in scientific fields, particularly genetics and toxicology. It describes something that can cause mutations, which are changes in the DNA sequence. This term is not commonly used in everyday language and is more likely to be encountered in scientific research papers or textbooks. It is important to understand that metagenic substances can have potentially harmful effects on living organisms due to their ability to alter genetic material."},"example_sentences":[{"sentence":"Exposure to certain chemicals can have metagenic consequences.","translation":"特定の化学物質への暴露は変異原性の結果をもたらす可能性がある。","type":"general","meaning_category":"変異原性の"},{"sentence":"Researchers are studying the metagenic potential of nanoparticles.","translation":"研究者たちはナノ粒子の変異原性ポテンシャルを研究している。","type":"scientific","meaning_category":"変異原性の"}]}