{"word":"cost-push","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"(経済)コストプッシュ型の、費用プッシュ型の","english_definition":"(economics) relating to or denoting inflation caused by an increase in prices of inputs like labour and raw materials.","examples":[{"sentence":"Cost-push inflation is often associated with wage increases.","translation":"コストプッシュインフレはしばしば賃金上昇と関連付けられる。"},{"sentence":"The energy crisis led to cost-push pressures on the economy.","translation":"エネルギー危機は経済にコストプッシュ圧力をかけた。"}],"collocations":["cost-push inflation","cost-push pressure","cost-push factors"],"synonyms":["supply-side inflation"],"antonyms":["demand-pull"],"related_terms":["stagflation","inflation","supply shock"]}],"etymology":{"value":"The term 'cost-push' is derived from the idea that rising costs of production 'push' prices up.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒst pʊʃ/","syllables":"cost-push"},"inflection":{"notes":"It is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Cost-push' is used to describe a type of inflation that occurs when the overall price level rises due to increases in the cost of wages and raw materials. It is a supply-side phenomenon, as opposed to demand-pull inflation, which is driven by increased demand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The cost-push is rising.","correct":"Cost-push inflation is rising.","note":"'Cost-push' itself is not something that rises; it's a descriptive term for a type of inflation or pressure."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, used primarily in economics contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cost-push' is an economics term that describes a specific type of inflation. It's caused when the costs of things businesses need to make products (like wages and raw materials) go up. To understand it, you need to know basic economics concepts like inflation and supply-side economics. It's more complex than everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The government is trying to combat cost-push inflation through supply-side reforms.","translation":"政府はサプライサイド改革を通じてコストプッシュインフレに対抗しようとしている。","type":"adjective","meaning_category":"economic"},{"sentence":"Rising commodity prices have created cost-push pressures on manufacturers.","translation":"商品価格の上昇は製造業者にコストプッシュ圧力をかけている。","type":"adjective","meaning_category":"economic"}]}