{"word":"auto-centric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自動車中心の、自動車偏重の","english_definition":"Designed primarily for or dependent on automobiles; prioritizing the needs of cars over other forms of transportation or other considerations.","examples":[{"sentence":"The city's urban planning is very auto-centric, with wide roads and limited public transportation.","translation":"その都市の都市計画は非常に自動車中心で、広い道路と限られた公共交通機関があります。"},{"sentence":"An auto-centric society can lead to increased pollution and traffic congestion.","translation":"自動車中心の社会は、汚染と交通渋滞の増加につながる可能性があります。"},{"sentence":"Many suburban areas are auto-centric, requiring residents to drive everywhere.","translation":"多くの郊外地域は自動車中心であり、住民はどこへ行くにも車を運転する必要があります。"}],"collocations":["auto-centric urban planning","auto-centric development","auto-centric transportation system","auto-centric design"],"synonyms":["car-dependent","car-oriented"],"antonyms":["pedestrian-friendly","transit-oriented","eco-friendly","sustainable"],"related_terms":["urban sprawl","car culture","public transportation","walkability","bike-friendly"],"notes":"Often used critically to describe urban environments that prioritize cars over pedestrians, cyclists, and public transit."}],"etymology":{"value":"Combination of 'auto' (short for automobile) and 'centric' (having as the center).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊˈsɛntrɪk/","syllables":"au-to-cen-tric"},"inflection":{"notes":"Does not inflect (only exists as an adjective)."},"usage_notes":{"explanation":"'Auto-centric' is used to describe places, policies, or designs that are primarily focused on accommodating automobiles. It often implies a negative connotation, suggesting that other modes of transportation and the needs of pedestrians and cyclists are neglected.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The auto-centric is bad for the environment.","correct":"✓ Auto-centric development is bad for the environment.","note":"'Auto-centric' is an adjective and needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["auto-centrism (noun)"],"related_concepts":["transit-oriented development (TOD)","new urbanism","complete streets"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but increasing in usage in urban planning and environmental discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Auto-centric' describes something designed mainly for cars, often at the expense of other ways of getting around, like walking or biking. It's often used when talking about city planning and the environment, and it usually has a negative meaning, suggesting that we rely too much on cars."},"example_sentences":[{"sentence":"The city's reliance on highways makes it a highly **auto-centric** environment.","translation":"その都市の高速道路への依存は、それを非常に自動車中心の環境にしている。","type":"adjective","meaning_category":"General"},{"sentence":"Critics argue that **auto-centric** policies contribute to social inequality.","translation":"批評家たちは、自動車中心の政策が社会的不平等に貢献すると主張している。","type":"adjective","meaning_category":"Criticism"},{"sentence":"The new development aims to be less **auto-centric** by incorporating bike lanes and pedestrian walkways.","translation":"その新しい開発は、自転車レーンと歩行者用通路を組み込むことによって、自動車中心にならないようにすることを目指している。","type":"adjective","meaning_category":"Alternative Design"}]}