{"word":"milleporous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多孔質の、多数の孔がある","english_definition":"Having many pores or small openings; porous.","examples":[{"sentence":"The milleporous rock allowed water to seep through easily.","translation":"その多孔質の岩は、水が容易に浸透するのを許した。"},{"sentence":"Milleporous materials are often used in filtration systems.","translation":"多孔質の材料は、しばしば濾過システムで使用される。"}],"collocations":["milleporous rock","milleporous structure","milleporous material"],"synonyms":["porous","permeable","honeycombed","fenestrated"],"antonyms":["impermeable","nonporous","dense"]}],"etymology":{"value":"Derived from the genus name *Millepora* (fire coral) + *-ous*. The name *Millepora* comes from Latin *mille* meaning 'thousand' and *porus* meaning 'pore'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪlɪˈpɔːrəs/","syllables":"mil-le-po-rous"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms (more milleporous, most milleporous), though these are not commonly used."},"usage_notes":{"explanation":"The term \"milleporous\" is relatively uncommon and technical. It is most often used in scientific or technical contexts to describe materials or structures that possess a multitude of small pores or openings. It emphasizes the abundance of pores rather than just the presence of some porosity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The milleporous surface was solid and impermeable.","correct":"✓ The milleporous surface was porous and allowed liquid to pass through.","note":"Milleporous implies porosity, so it cannot be both milleporous and impermeable."}],"priority":"★★☆"},"related_words":{"derivatives":["millepore (名詞: イソギンチャクの一種)","porous (形容詞: 多孔質の)","pore (名詞: 気孔)"],"related_terms":["filtration","permeability","absorption","coral"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"milleporous\" is a technical term used to describe materials with numerous small pores. It is not commonly used in everyday language and is more likely to be found in scientific or technical contexts, such as geology, materials science, or biology. Understanding its meaning requires a relatively advanced vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The sponge had a milleporous structure that allowed it to efficiently filter water.","translation":"その海綿は、効率的に水を濾過できる多孔質の構造を持っていた。","type":"general","meaning_category":"多孔質の"},{"sentence":"The geologist examined the milleporous rock formation for signs of ancient marine life.","translation":"地質学者は、古代の海洋生物の兆候がないか多孔質の岩石層を調べた。","type":"technical","meaning_category":"多孔質の"}]}