{"word":"whole-curriculum","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"全人教育カリキュラム","english_definition":"An educational approach that focuses on the development of the whole person, including their intellectual, emotional, social, physical, artistic, creative, and spiritual potentials. It emphasizes holistic learning experiences and integrates various subjects and activities to foster well-rounded individuals.","examples":[{"sentence":"The school adopted a whole-curriculum approach to ensure students' comprehensive development.","translation":"学校は、生徒の包括的な発達を保証するために、全人教育カリキュラムのアプローチを採用しました。"},{"sentence":"The whole-curriculum includes not only academic subjects but also extracurricular activities and character education.","translation":"全人教育カリキュラムには、学術的な科目だけでなく、課外活動や人格教育も含まれています。"}],"collocations":["implement a whole-curriculum","develop a whole-curriculum","adopt a whole-curriculum","holistic education","well-rounded development"],"synonyms":["holistic curriculum","integrated curriculum","comprehensive curriculum"],"antonyms":["narrow curriculum","subject-based curriculum"]}],"etymology":{"value":"The term 'whole-curriculum' is a compound word combining 'whole,' indicating completeness and totality, with 'curriculum,' referring to the subjects and activities offered in an educational setting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊl kəˌrɪkjələm/","syllables":"whole-cur-ric-u-lum"},"inflection":{"noun_plural":"whole-curricula (less common)"},"usage_notes":{"explanation":"The term 'whole-curriculum' is often used in educational contexts to describe a broad and holistic approach to teaching and learning. It emphasizes the importance of addressing all aspects of a student's development, rather than focusing solely on academic achievement. This approach typically involves integrating various subjects and activities, promoting interdisciplinary learning, and fostering students' emotional, social, and ethical growth. It is often associated with progressive educational philosophies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The whole curriculum are important.","correct":"✓ The whole curriculum is important.","note":"'Curriculum' is a singular noun, even though it refers to a collection of subjects. The verb should agree with the singular form."},{"incorrect":"✗ They focus only on the whole curriculum, ignoring specific subjects.","correct":"✓ They focus on the whole curriculum, ensuring a balance with specific subjects.","note":"The whole-curriculum approach aims to integrate various subjects, not to ignore them. It's about a holistic view that includes specific subjects."}],"priority":"★★☆"},"related_words":{"derivatives":["whole child education","holistic education","integrated learning","experiential learning"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'whole-curriculum' refers to an educational strategy that aims to develop all aspects of a student's personality, including their intellectual, emotional, social, and physical capabilities. This approach emphasizes the interconnectedness of different subjects and activities, fostering a more comprehensive and meaningful learning experience. It contrasts with more traditional, subject-based curricula that focus primarily on academic knowledge. Understanding this term requires familiarity with educational theory and practice.","example_sentences":[]}}