{"word":"Mandeville","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"マンデビル：英語圏の姓、地名","english_definition":"A surname and place name of English origin.","examples":[{"sentence":"John Mandeville is a fictional author of a travel narrative.","translation":"ジョン・マンデビルは旅行記の架空の著者です。"},{"sentence":"Mandeville, Louisiana is a city located on the north shore of Lake Pontchartrain.","translation":"ルイジアナ州マンデビルは、ポンチャートレイン湖の北岸に位置する都市です。"}],"collocations":["Sir John Mandeville (サー・ジョン・マンデビル)","Mandeville, Louisiana (ルイジアナ州マンデビル)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Mandeville is of Norman origin, derived from a place name in Normandy, France. The place name itself likely comes from 'Magna Villa', meaning 'Great Estate' or 'Large Town' in Latin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmændɪvɪl/","syllables":"Man-de-ville"},"inflection":{},"usage_notes":{"explanation":"Mandeville is primarily known as a surname and a place name. As a surname, it's relatively uncommon. As a place name, it's most notable for Mandeville, Louisiana, a city in the United States. There are other places named Mandeville in different parts of the world, but they are generally smaller and less well-known. The name is often associated with historical figures or locations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to visit Mandeville on my vacation. (without specifying the location)","correct":"✓ I'm going to visit Mandeville, Louisiana on my vacation.","note":"When referring to a place named Mandeville, it's helpful to specify the location to avoid confusion, as there are multiple places with this name."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_places":["Mandeville, Louisiana (ルイジアナ州マンデビル)","Mandeville, Jamaica (ジャマイカ、マンデビル)"],"historical_figures":["Sir John Mandeville (サー・ジョン・マンデビル - 伝説的な旅行家)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 固有名詞のため、一般的な語彙に比べると頻度は低い。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「**Mandeville**」は主に人名（姓）または地名として使われます。最も一般的なのは、アメリカ合衆国ルイジアナ州にある都市の名前です。また、伝説的な旅行家である「サー・ジョン・マンデビル」の名前でも知られています。日常会話で頻繁に使われる単語ではありませんが、特定の文脈（歴史、地理など）では登場する可能性があります。発音は少し難しいかもしれませんが、音節に分けて練習すれば発音できます。"},"example_sentences":[{"sentence":"The town of **Mandeville**, Louisiana, is known for its beautiful lakefront.","translation":"ルイジアナ州のマンデビルの町は、美しい湖畔で知られています。","type":"proper noun","meaning_category":"地名"},{"sentence":"Some scholars believe that **Sir John Mandeville** was a fictional character.","translation":"一部の学者は、サー・ジョン・マンデビルは架空の人物だと考えています。","type":"proper noun","meaning_category":"人名"}]}