{"word":"detenant","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)占有者、保有者、賃借人","english_definition":"(law) A person who holds or possesses property, especially a tenant.","examples":[{"sentence":"The detenant was responsible for maintaining the property.","translation":"その占有者は、その不動産の維持管理に責任があった。"},{"sentence":"Under the terms of the agreement, the detenant had the right to sublet the premises.","translation":"契約条件に基づき、その賃借人はその建物を転貸する権利を有していた。"}],"collocations":["former detenant (以前の占有者)","current detenant (現在の占有者)","lawful detenant (合法的な占有者)","unlawful detenant (不法占有者)"],"synonyms":["occupant","holder","possessor","tenant","lessee"],"antonyms":["landlord","owner","lessor"]}],"etymology":{"value":"From Middle French detenant, present participle of detenir (“to detain, hold back”), from Latin detinere (“to hold back, keep back”), from de- (“from, away from”) + tenere (“to hold”).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈtiːnənt/","syllables":"de-te-nant"},"inflection":{"noun_plural":"detenants"},"usage_notes":{"explanation":"The term \"detenant\" is primarily used in legal contexts to describe someone who holds or possesses property, often as a tenant. It emphasizes the act of holding or possessing rather than ownership. It is more formal and less common than \"tenant\" or \"occupant.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The owner is the detenant of the property.","correct":"✓ The tenant is the detenant of the property.","note":"The owner is not the detenant; the tenant is. Detenant refers to someone who holds or possesses property but does not necessarily own it."}],"priority":"★★☆"},"related_words":{"derivatives":["detain (verb): to keep someone in official custody.","detention (noun): the act of detaining someone or the state of being detained.","detinue (noun): a common law action to recover wrongfully detained goods."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Detenant' is a formal legal term for someone who holds or possesses property, often a tenant. It's not commonly used in everyday language. You'll typically find it in legal documents or discussions related to property law. It's important to distinguish it from 'owner,' as a detenant holds the property but doesn't necessarily own it."},"example_sentences":[{"sentence":"The court ruled that the former detenant had no right to the property.","translation":"裁判所は、以前の占有者にはその財産に対する権利がないと判決を下した。","type":"noun","meaning_category":"占有者"},{"sentence":"As a detenant, you are responsible for paying rent on time.","translation":"占有者として、あなたは賃料を期日までに支払う責任があります。","type":"noun","meaning_category":"賃借人"}]}