{"word":"Temporalis","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"側頭筋","english_definition":"A broad, fan-shaped muscle on each side of the head that fills the temporal fossa, superior to the zygomatic arch, and covers much of the temporal bone. It is one of the muscles of mastication (chewing).","examples":[{"sentence":"The temporalis muscle is important for chewing.","translation":"側頭筋は咀嚼にとって重要です。"},{"sentence":"Pain in the temporalis muscle can be a sign of temporomandibular joint (TMJ) disorder.","translation":"側頭筋の痛みは顎関節症（TMJ）の兆候である可能性があります。"}],"collocations":["temporalis muscle","temporalis tendon","temporalis fossa"],"synonyms":["temporal muscle"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'temporalis,' meaning 'relating to the temples' or 'temporal.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛmpəˈreɪlɪs/","syllables":"tem-po-ra-lis"},"inflection":{"notes":"Plural: Temporales (though rarely used)"},"usage_notes":{"explanation":"In anatomical contexts, 'Temporalis' refers specifically to the temporalis muscle. It's crucial for understanding the anatomy of the head and neck, particularly in fields like dentistry, surgery, and physical therapy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The temporalis is a bone in the skull.","correct":"✓ The temporalis is a muscle on the side of the head.","note":"The temporalis is a muscle, not a bone. The temporal bone is the bone underlying the temporalis muscle."}],"priority":"★★☆"},"related_words":{"derivatives":["temporal (adjective: relating to time or the temples)","temporally (adverb: with regard to time or the temples)"],"related_terms":["masseter (muscle)","pterygoid (muscle)","mandible (bone)","zygomatic arch (bone)","temporal bone (bone)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency (specialized anatomical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Temporalis' is a specialized anatomical term referring to the temporalis muscle, a key muscle for chewing located on the side of the head. Understanding this term is important in medical and biological contexts, particularly when studying anatomy or related health issues. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The surgeon carefully dissected the temporalis muscle.","translation":"外科医は慎重に側頭筋を解剖した。","type":"medical","meaning_category":"anatomy"},{"sentence":"The patient reported tenderness in the area of the temporalis.","translation":"患者は側頭筋の領域に圧痛があると訴えた。","type":"medical","meaning_category":"symptom"},{"sentence":"Botox injections can be used to relax the temporalis muscle and relieve tension headaches.","translation":"ボトックス注射は側頭筋をリラックスさせ、緊張型頭痛を緩和するために使用できます。","type":"medical","meaning_category":"treatment"}]}