{"word":"out-college","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国) 大学の寄宿舎に住まない学生、通学生","english_definition":"(UK) A student of a college who does not reside in college; a non-resident student; a day student.","examples":[{"sentence":"As an out-college student, I had to commute every day.","translation":"通学生として、私は毎日通学しなければなりませんでした。"},{"sentence":"Out-college students often miss out on the social aspects of college life.","translation":"通学生は大学生活の社交的な側面を見逃すことが多いです。"}],"collocations":["out-college student","attend as an out-college"],"synonyms":["day student","non-resident student","commuter student"],"antonyms":["in-college student","resident student"]},{"part_of_speech":"adjective","definition":"(英国) 大学の寄宿舎に住まない学生の、通学生の","english_definition":"(UK) Relating to or characteristic of a student of a college who does not reside in college.","examples":[{"sentence":"Out-college life can be challenging due to the lack of on-campus resources.","translation":"キャンパス内のリソースが不足しているため、通学生活は困難な場合があります。"},{"sentence":"The out-college experience is different from that of resident students.","translation":"通学の経験は、寮生とは異なります。"}],"collocations":["out-college life","out-college experience"],"synonyms":["non-resident","commuting"],"antonyms":["resident"]}],"etymology":{"value":"'Out' (outside) + 'college' (referring to a college or university). The term indicates students who live outside the college premises.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaʊt ˈkɒlɪdʒ/","syllables":"out-col-lege"},"inflection":{"noun_plural":"out-colleges","adjective_forms":{}},"usage_notes":{"explanation":"The term 'out-college' is primarily used in the UK, particularly in older universities like Oxford and Cambridge, to distinguish between students who live in college-provided accommodation ('in-college' students) and those who live outside of it, often commuting from home or renting private accommodation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is out of college.","correct":"✓ He is an out-college student.","note":"'Out of college' typically means someone has graduated. Use 'out-college student' to specify a non-resident student."},{"incorrect":"✗ The out-college's experience.","correct":"✓ The out-college student's experience.","note":"'Out-college' needs to be followed by 'student' to indicate a person."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["in-college","commuter student","day student","resident student"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Out-college' is a term mainly used in British English, especially in the context of older universities like Oxford and Cambridge. It refers to students who do not live in the college's residential buildings but instead live off-campus, often commuting from home or renting nearby. Understanding this term requires familiarity with the specific structure and terminology of these universities."},"example_sentences":[{"sentence":"Many out-college students find it challenging to participate in late-night college events.","translation":"多くの通学生は、深夜の大学イベントに参加するのが難しいと感じています。","type":"noun","meaning_category":"通学生"},{"sentence":"The university provides support services specifically tailored to the needs of out-college students.","translation":"大学は、通学生のニーズに合わせて特別に調整されたサポートサービスを提供しています。","type":"adjective","meaning_category":"通学生の"}]}