{"word":"hypogene","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)地下深部で生成された、深成起源の","english_definition":"(geology) formed deep below the earth's surface; of deep-seated origin.","examples":[{"sentence":"Hypogene ore deposits are formed by ascending solutions from within the earth.","translation":"深成鉱床は、地球内部からの上昇溶液によって形成される。"},{"sentence":"The hypogene zone is characterized by high temperatures and pressures.","translation":"深成帯は、高温高圧を特徴とする。"}],"collocations":["hypogene ore deposit","hypogene zone","hypogene process"],"synonyms":["plutonic","endogenous","deep-seated"],"antonyms":["supergene","exogenous"]}],"etymology":{"value":"From the Greek words 'hypo' (under, below) and 'genes' (born, produced).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhaɪpədʒiːn/","syllables":"hy-po-gene"},"inflection":{"notes":"Does not inflect (only exists as an adjective)."},"usage_notes":{"explanation":"'Hypogene' is a technical term used in geology to describe processes or formations that originate deep within the Earth. It is often contrasted with 'supergene', which refers to processes occurring near the Earth's surface.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypogene rocks were found on the surface.","correct":"✓ The supergene rocks were found on the surface.","note":"Hypogene rocks are formed deep underground, so they are not typically found on the surface. Supergene rocks are formed near the surface."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypogenesis (noun): the formation of parts or tissues from elements normally not concerned in their production.","hypogeny (noun): development from below or within."],"related_terms":["endogenous","plutonic","supergene","exogenous"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypogene' is a specialized geological term rarely encountered outside of academic or professional contexts related to geology and mineralogy. Understanding requires familiarity with geological processes and terminology. It describes formations originating from deep within the Earth, distinguishing them from surface-level formations."},"example_sentences":[{"sentence":"The geologist studied the hypogene alteration of the rock samples.","translation":"地質学者は、岩石サンプルの深成変質を研究した。","type":"adjective","meaning_category":"地下深部で生成された"},{"sentence":"Hypogene mineralization is often associated with magmatic activity.","translation":"深成鉱化作用は、しばしばマグマ活動と関連している。","type":"adjective","meaning_category":"地下深部で生成された"}]}