{"word":"nonviolence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非暴力主義、非暴力","english_definition":"the use of peaceful means, not force, to bring about political or social change.","examples":[{"sentence":"Gandhi advocated nonviolence as a means of achieving independence.","translation":"ガンジーは独立を達成する手段として非暴力を提唱した。"},{"sentence":"The protesters practiced nonviolence even when faced with aggression.","translation":"抗議者たちは、攻撃に直面しても非暴力を貫いた。"},{"sentence":"Nonviolence is a powerful tool for social change.","translation":"非暴力は社会変革のための強力な手段である。"}],"collocations":["practice nonviolence (非暴力を実践する)","advocate nonviolence (非暴力を提唱する)","teach nonviolence (非暴力を教える)","principle of nonviolence (非暴力の原則)","philosophy of nonviolence (非暴力の哲学)"],"synonyms":["pacifism","peacefulness","non-aggression","passive resistance"],"antonyms":["violence","aggression","force","belligerence"]}],"etymology":{"value":"'Non-' (否定の接頭辞) + 'violence'.  The term gained prominence in the 20th century, particularly with the rise of Mahatma Gandhi's philosophy and practice of Satyagraha.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈvaɪələns/","syllables":"non-vi-o-lence"},"inflection":{"noun_plural":"nonviolences (まれに複数形で使われることがあるが、通常は不可算名詞)"},"usage_notes":{"explanation":"'Nonviolence' refers to a philosophy and strategy for social change that rejects the use of physical violence. It encompasses a range of actions, including peaceful protests, civil disobedience, and nonviolent resistance. It is often associated with figures like Mahatma Gandhi and Martin Luther King Jr.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He believed in non-violence.","correct":"✓ He believed in nonviolence.","note":"'Nonviolence' is typically written as one word. While 'non-violence' is sometimes seen, it is less common."},{"incorrect":"✗ Nonviolence is when you don't fight back, even if someone hits you.","correct":"✓ Nonviolence is a philosophy of achieving social or political change through peaceful means, even in the face of violence.","note":"While refusing to fight back is part of nonviolence, it's more than just passivity. It's an active approach to conflict resolution."}],"priority":"★★☆"},"related_words":{"derivatives":["nonviolent (adjective: 非暴力的な)","nonviolently (adverb: 非暴力的に)"],"phrasal_verbs":[],"related_concepts":["civil disobedience","passive resistance","pacifism","Satyagraha"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 特定の文脈（政治、社会運動など）で使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonviolence' is a more advanced term referring to the practice of achieving political or social goals through peaceful means, rejecting the use of physical force or aggression. It's often discussed in the context of social movements, political philosophy, and conflict resolution. Understanding this term requires familiarity with abstract concepts and historical examples like Gandhi's movement in India or the Civil Rights Movement in the United States."},"example_sentences":[{"sentence":"The civil rights movement in the United States was largely based on principles of **nonviolence**.","translation":"アメリカの公民権運動は、主に非暴力の原則に基づいていた。","type":"noun","meaning_category":"非暴力主義"},{"sentence":"The organization promotes **nonviolence** as the most effective way to resolve conflicts.","translation":"その組織は、紛争を解決する最も効果的な方法として非暴力を推進している。","type":"noun","meaning_category":"非暴力主義"},{"sentence":"They were committed to **nonviolence** even when provoked.","translation":"彼らは挑発されても非暴力を貫いた。","type":"noun","meaning_category":"非暴力主義"}]}