{"word":"middle-classism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中産階級主義、中流意識 (中産階級の価値観や視点を特権視し、他の階級を軽視または無視する傾向)","english_definition":"The belief that middle-class values and perspectives are superior to those of other social classes; prejudice or discrimination against people from lower or working-class backgrounds.","examples":[{"sentence":"The policy was criticized for its inherent middle-classism, as it failed to address the needs of low-income families.","translation":"その政策は、低所得世帯のニーズに対応できていないため、内在する中産階級主義として批判された。"},{"sentence":"Her comments reflected a certain middle-classism, suggesting that everyone has the same opportunities to succeed.","translation":"彼女のコメントは、誰もが成功する同じ機会を持っていることを示唆しており、ある種の中産階級主義を反映していた。"},{"sentence":"The novel explores the themes of class conflict and the subtle forms of middle-classism that permeate society.","translation":"その小説は、階級闘争と社会に浸透する中産階級主義の微妙な形態というテーマを探求している。"}],"collocations":["inherent middle-classism (内在する中産階級主義)","subtle middle-classism (微妙な中産階級主義)","institutional middle-classism (制度化された中産階級主義)","cultural middle-classism (文化的な中産階級主義)","middle-classist attitudes (中産階級主義的な態度)","middle-classist assumptions (中産階級主義的な前提)"],"synonyms":["classism","elitism","social prejudice","social bias","class bias"],"antonyms":["egalitarianism","social equality","class consciousness","anti-classism"]}],"etymology":{"value":"「middle-class」に、主義やイデオロギーを表す接尾辞「-ism」が付いたもの。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪdəlˈklæsɪzəm/","syllables":"mid-dle-class-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**middle-classism**」は、中産階級の価値観やライフスタイルが他の階級よりも優れていると考える傾向、またはそのような信念に基づく差別や偏見を指す言葉です。これは、社会政策、教育、文化、メディアなど、さまざまな分野で見られます。中産階級主義は、他の階級の人々が直面する困難や障壁を無視したり、過小評価したりする可能性があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed middle-classism by donating to charity.","correct":"✓ His donation to the charity, while well-intentioned, was seen as an example of middle-classism because it focused on issues relevant to the middle class.","note":"慈善団体への寄付自体は中産階級主義ではありません。寄付の対象や方法が中産階級の価値観を反映し、他の階級のニーズを無視する場合に中産階級主義と見なされることがあります。"},{"incorrect":"✗ Middle-classism is always intentional.","correct":"✓ Middle-classism can be unintentional, stemming from a lack of awareness or understanding of the experiences of people from different social classes.","note":"中産階級主義は意図的な場合もありますが、異なる社会階級の人々の経験に対する認識や理解の欠如から生じる無意識の偏見である場合もあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["middle-classist (形容詞: 中産階級主義的な; 名詞: 中産階級主義者)","classism (名詞: 階級主義)","elitism (名詞: エリート主義)"],"idioms_phrases":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**middle-classism**」は、中産階級の価値観や考え方が他の階級よりも優れていると考えることです。これは、他の階級の人々を差別したり、彼らの問題を無視したりすることにつながる可能性があります。例えば、ある政策が中産階級の人々には役立つかもしれないけれど、貧しい人々には役立たない場合、それは中産階級主義的な政策と言えるかもしれません。この言葉は、社会の不平等について議論するときに使われます。"},"example_sentences":[{"sentence":"The article criticized the film for its subtle middle-classism, portraying working-class characters as unsophisticated and uncultured.","translation":"その記事は、映画が労働者階級の登場人物を洗練されておらず、無教養であると描いている点を、微妙な中産階級主義として批判した。","type":"noun","meaning_category":"中産階級主義の例"},{"sentence":"Addressing middle-classism in education requires a conscious effort to create a more inclusive and equitable learning environment for all students.","translation":"教育における中産階級主義に対処するには、すべての生徒のために、より包括的で公平な学習環境を作り出すための意識的な努力が必要である。","type":"noun","meaning_category":"中産階級主義への対処"},{"sentence":"The politician's speech was accused of middle-classism because it focused solely on the concerns of homeowners and ignored the needs of renters.","translation":"その政治家の演説は、住宅所有者の懸念のみに焦点を当て、賃貸住宅居住者のニーズを無視したため、中産階級主義であると非難された。","type":"noun","meaning_category":"中産階級主義の例"}]}