{"word":"regenerance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再生力、回復力、復元力","english_definition":"The power or ability to regenerate; the quality of being regenerative.","examples":[{"sentence":"The regenerance of the forest after the fire was remarkable.","translation":"火事の後の森林の再生力は目覚ましかった。"},{"sentence":"The regenerance of the economy is crucial for the country's future.","translation":"国の将来にとって、経済の回復力は非常に重要だ。"},{"sentence":"The plant's regenerance allows it to quickly recover from damage.","translation":"その植物の再生力により、損傷から素早く回復できる。"}],"collocations":["economic regenerance (経済の回復力)","forest regenerance (森林の再生力)","natural regenerance (自然の再生力)"],"synonyms":["regeneration","renewal","recovery","revival","restoration","recuperation"],"antonyms":["degeneration","decay","deterioration"]}],"etymology":{"value":"\"Regenerance\" is derived from the word \"regenerate,\" with the suffix \"-ance\" added to form a noun. \"Regenerate\" comes from the Latin word \"regeneratus,\" the past participle of \"regenerare,\" meaning \"to bring forth again, reproduce, renew.\"","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈdʒɛnərəns/","syllables":"re-gen-er-ance"},"inflection":{"noun_plural":"regenerances (rarely used)"},"usage_notes":{"explanation":"\"Regenerance\" is a noun that describes the ability or power of something to regenerate, renew, or restore itself. It is often used in contexts related to natural processes, such as the regeneration of forests or ecosystems, but can also be applied to economic or social systems. The term emphasizes the capacity for renewal and recovery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The regenerance was regenerate.","correct":"✓ The regenerance was remarkable.","note":"\"Regenerance\" is a noun, while \"regenerate\" is a verb or adjective. Do not use them interchangeably."},{"incorrect":"✗ The regenerance of the city was regenerate by the new policies.","correct":"✓ The regeneration of the city was facilitated by the new policies. / ✓ The city was regenerated by the new policies.","note":"Use \"regeneration\" or the verb form \"regenerate\" when describing the process of something being regenerated."}],"priority":"★★☆"},"related_words":{"derivatives":["regenerate (verb, adjective)","regeneration (noun)","regenerative (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Regenerance\" is a relatively uncommon noun that refers to the ability or power to regenerate or renew. It is often used in scientific or technical contexts to describe the natural processes of recovery and restoration in ecosystems or biological systems. Understanding this word requires a strong vocabulary and familiarity with abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The soil's regenerance is essential for sustainable agriculture.","translation":"持続可能な農業には、土壌の再生力が不可欠だ。","type":"noun","meaning_category":"再生力"},{"sentence":"The city's economic regenerance depended on attracting new industries.","translation":"都市の経済回復力は、新しい産業を誘致することにかかっていた。","type":"noun","meaning_category":"回復力"},{"sentence":"The patient's remarkable regenerance surprised the doctors.","translation":"患者の驚くべき回復力は医師たちを驚かせた。","type":"noun","meaning_category":"復元力"}]}