{"word":"contrantiscion","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(archaic) An anti-climax; a descent from the sublime to the ridiculous.","english_definition":"(archaic) An anti-climax; a descent from the sublime to the ridiculous.","examples":[{"sentence":"The play suffered from a contrantiscion in the final act, ruining the dramatic tension.","translation":"その劇は最終幕でコントランティスシオンに陥り、劇的な緊張感を損なった。"}],"collocations":[],"synonyms":["anticlimax","bathos"],"antonyms":[],"notes":"This word is rare and considered archaic."}],"etymology":{"value":"A blend of 'contra-' (against) and 'antiscion' (a plant that thrives best when grafted to a plant of the opposite type). The original sense related to astrology, where the antiscion was a point in the zodiac opposite another. The literary sense then developed from this.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntrænˈtɪʃən/","syllables":"con-tran-tis-cion"},"inflection":{"noun_plural":"contrantiscions"},"usage_notes":{"explanation":"The word 'contrantiscion' is a rare, archaic term primarily used in literary criticism to describe a sudden shift in tone from serious or elevated to trivial or absurd. It is closely related to the concept of anticlimax or bathos, but carries a more specific connotation of a deliberate or stylistic descent.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["anticlimax","bathos"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Contrantiscion' is a highly specialized and rare term, primarily encountered in advanced literary analysis. It refers to a specific type of anticlimax where there is a deliberate descent from the sublime to the ridiculous, often used for satirical or humorous effect. Due to its rarity and specialized usage, it is unlikely to be encountered outside of academic contexts."},"example_sentences":[{"sentence":"The author employed a contrantiscion to mock the pretensions of the aristocracy.","translation":"作者は貴族階級の気取りを嘲笑するためにコントランティスシオンを用いた。","type":"noun","meaning_category":"Anticlimax"},{"sentence":"The speech began with soaring rhetoric but ended in a contrantiscion of silly jokes.","translation":"そのスピーチは高尚なレトリックで始まったが、最後はくだらないジョークというコントランティスシオンで終わった。","type":"noun","meaning_category":"Anticlimax"}]}