{"word":"spasmophilia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) 痙攣体質、痙攣素因","english_definition":"(medicine) A condition characterized by a predisposition to spasms or convulsions.","examples":[{"sentence":"Spasmophilia can be caused by a deficiency in calcium or magnesium.","translation":"痙攣体質はカルシウムやマグネシウムの欠乏によって引き起こされることがある。"},{"sentence":"The doctor diagnosed her with spasmophilia after several episodes of muscle spasms.","translation":"医師は数回にわたる筋肉の痙攣の後、彼女を痙攣体質と診断した。"}],"collocations":["calcium deficiency in spasmophilia (痙攣体質におけるカルシウム欠乏)","magnesium deficiency in spasmophilia (痙攣体質におけるマグネシウム欠乏)","diagnose spasmophilia (痙攣体質を診断する)","treat spasmophilia (痙攣体質を治療する)"],"synonyms":["tetany","convulsive diathesis"],"antonyms":[]}],"etymology":{"value":"From 'spasm' (sudden, involuntary muscle contraction) + '-o-' (connecting vowel) + 'philia' (affinity, love, tendency towards).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspæzməˈfɪliə/","syllables":"spasm-o-phil-i-a"},"inflection":{"noun_plural":"spasmophilias"},"usage_notes":{"explanation":"'Spasmophilia' is a medical term, not commonly used in everyday conversation. It refers to a condition where an individual has an increased susceptibility to spasms or convulsions, often due to electrolyte imbalances. It is more frequently encountered in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has spasmophilia because she likes spasms.","correct":"✓ She has spasmophilia, a medical condition causing muscle spasms.","note":"'Spasmophilia' is a medical condition, not a preference for spasms. The term 'philia' in this context denotes a tendency towards something, not necessarily a liking for it."}],"priority":"★★☆"},"related_words":{"derivatives":["spasmophilic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized medical term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Spasmophilia' is a highly specialized medical term referring to a predisposition to spasms or convulsions. It is not part of common vocabulary and is primarily used in medical contexts. Understanding the term requires knowledge of medical terminology and physiology."},"example_sentences":[{"sentence":"The patient's history revealed a family history of spasmophilia.","translation":"患者の病歴から、家族に痙攣体質の既往歴があることがわかった。","type":"medical context","meaning_category":"痙攣体質"},{"sentence":"Treatment for spasmophilia often involves correcting electrolyte imbalances.","translation":"痙攣体質の治療には、電解質の不均衡を是正することがしばしば含まれる。","type":"medical context","meaning_category":"痙攣体質"}]}