{"word":"sleave-silk","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"粗末な絹糸、屑繭から取った絹糸","english_definition":"Inferior or coarse silk, such as that reeled from the floss or broken parts of cocoons.","examples":[{"sentence":"The embroidery was done with sleave-silk.","translation":"その刺繍は粗末な絹糸で行われた。"},{"sentence":"Sleave-silk is less expensive than higher-quality silk.","translation":"屑繭から取った絹糸は、高品質の絹よりも安価である。"}],"collocations":["used in embroidery (刺繍に使われる)","less expensive silk (より安価な絹)"],"synonyms":["waste silk","floss silk"],"antonyms":["organzine","tram"],"notes":"Often used historically to describe a lower grade of silk used for less demanding purposes."}],"etymology":{"value":"From 'sleave' (the floss of silk) + 'silk'. 'Sleave' comes from Middle Dutch 'sleve' (a sleeve, a tangle of thread).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsliːvˌsɪlk/","syllables":"sleave-silk"},"inflection":{"noun_plural":"sleave-silks"},"usage_notes":{"explanation":"'Sleave-silk' refers specifically to the short, broken fibers of silk that are less refined than the long, continuous strands of higher-quality silk. It is often associated with historical textiles and crafts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a dress made of sleave-silk, it was very shiny.","correct":"✓ She wore a dress made of sleave-silk; it was less shiny than other silks.","note":"Sleave-silk is not known for its shine, unlike higher grades of silk."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sleave-silk' is a specialized term related to silk production and textiles. It refers to a specific type of silk made from the waste or broken parts of cocoons. Understanding this term requires knowledge of textile manufacturing and historical materials. It is not commonly used in modern contexts outside of specialized fields."},"example_sentences":[{"sentence":"The antique tapestry was woven with sleave-silk and wool.","translation":"そのアンティークのタペストリーは、屑繭から取った絹糸とウールで織られていた。","type":"noun","meaning_category":"type of silk"},{"sentence":"Sleave-silk was often used for practice embroidery due to its lower cost.","translation":"屑繭から取った絹糸は、低コストのため、刺繍の練習によく使われた。","type":"noun","meaning_category":"use of silk"}]}