{"word":"Augustinian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"アウグスティヌス会の、聖アウグスティヌスに由来する、聖アウグスティヌスの教えに関する","english_definition":"relating to Saint Augustine of Hippo or his doctrines; relating to the Augustinian religious orders.","examples":[{"sentence":"Augustinian theology emphasizes the role of grace in salvation.","translation":"アウグスティヌス神学は、救済における恵みの役割を強調する。"},{"sentence":"The Augustinian order is one of the oldest religious orders in the Catholic Church.","translation":"アウグスティヌス会は、カトリック教会で最も古い修道会の1つである。"}],"collocations":["Augustinian theology","Augustinian order","Augustinian monastery","Augustinian friar"],"synonyms":["Augustine","of Augustine","related to Augustine"],"antonyms":[]},{"part_of_speech":"noun","definition":"アウグスティヌス会員、聖アウグスティヌスの信奉者","english_definition":"a member of an Augustinian religious order; a follower of Saint Augustine of Hippo.","examples":[{"sentence":"The Augustinians run many schools and universities around the world.","translation":"アウグスティヌス会は世界中で多くの学校や大学を運営している。"},{"sentence":"He became an Augustinian after a profound spiritual experience.","translation":"彼は深い精神的な経験の後、アウグスティヌス会員になった。"}],"collocations":["Augustinian friar","Augustinian nun","member of the Augustinian order"],"synonyms":["Augustine","follower of Augustine"],"antonyms":[]}],"etymology":{"value":"From the name of Saint Augustine of Hippo (354–430), a Christian theologian and philosopher. The suffix '-ian' is added to form an adjective or noun indicating association or affiliation.","priority":"★★★"},"pronunciation":{"ipa":"/ɔːɡəˈstɪniən/","syllables":"Au-gus-tin-i-an"},"inflection":{"noun_plural":"Augustinians"},"usage_notes":{"explanation":"The term 'Augustinian' refers to anything related to Saint Augustine of Hippo, a prominent figure in Christian theology, or to the religious orders that follow his teachings. As an adjective, it describes doctrines, institutions, or ideas associated with Augustine. As a noun, it refers to members of the Augustinian religious orders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a member of the Augustinian church.","correct":"✓ He is a member of the Augustinian order.","note":"'Augustinian' refers to the religious order, not a specific church building. Use 'Augustinian order' or specify the name of the church."},{"incorrect":"✗ Augustinian philosophy is very simple.","correct":"✓ Augustinian philosophy is very complex.","note":"Augustinian philosophy is known for its depth and complexity, not its simplicity. This is a matter of factual accuracy."}],"priority":"★★☆"},"related_words":{"derivatives":["Augustine","Augustinianism","Augustinian Order"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Augustinian' is primarily used in religious and historical contexts, specifically relating to Saint Augustine of Hippo or the religious orders that follow his teachings. It is not a commonly used word in everyday conversation and is more likely to be encountered in academic or theological discussions. Understanding the historical and religious background is essential for proper usage.","example_sentences":[]}}