{"word":"Itonaman","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A member of an indigenous group native to Bolivia, also known as the Machoto or Machoto-Pariri.","english_definition":"A member of an indigenous people of Bolivia, also known as the Machoto or Machoto-Pariri.","examples":[{"sentence":"The Itonaman people have a rich cultural heritage.","translation":"イトナマン族は豊かな文化遺産を持っています。"}],"collocations":[],"synonyms":["Machoto","Machoto-Pariri"],"antonyms":[]},{"part_of_speech":"adjective","definition":"Relating to the Itonaman people or their language and culture.","english_definition":"Relating to the Itonaman people, their language, or their culture.","examples":[{"sentence":"Itonaman traditions are passed down through generations.","translation":"イトナマンの伝統は何世代にもわたって受け継がれています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"The Itonama language, spoken by the Itonaman people.","english_definition":"The Itonama language, spoken by the Itonaman people of Bolivia.","examples":[{"sentence":"The Itonaman language is endangered.","translation":"イトナマ語は絶滅の危機に瀕しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name 'Itonaman' is not definitively known, but it is the name by which this indigenous group is commonly referred to.","priority":"N/A"},"pronunciation":{"ipa":"ito̞na̠ma̠ɴ","syllables":"i-to-na-man"},"inflection":{"notes":"As a proper noun, 'Itonaman' typically does not have plural forms, unless referring to separate groups or entities. Adjective form does not inflect."},"usage_notes":{"explanation":"The term 'Itonaman' refers to both the people and their language. When referring to a single person, 'an Itonaman person' or 'a member of the Itonaman people' is more appropriate. The language is often referred to as 'Itonama'.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency due to the specificity of the term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'Itonaman' is a specific term referring to an indigenous group in Bolivia and their language. It is not commonly used outside of contexts related to anthropology, linguistics, or South American studies. Understanding its meaning requires knowledge of specific cultural and geographical contexts."},"example_sentences":[{"sentence":"Efforts are being made to preserve the Itonaman language.","translation":"イトナマ語を保存するための努力がなされています。","type":"noun","meaning_category":"Language"},{"sentence":"The Itonaman people live in the Beni Department of Bolivia.","translation":"イトナマン族はボリビアのベニ県に住んでいます。","type":"noun","meaning_category":"People"},{"sentence":"She is studying Itonaman culture as part of her research.","translation":"彼女は研究の一環としてイトナマンの文化を研究しています。","type":"adjective","meaning_category":"Culture"}]}