{"word":"Borneo","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボルネオ島","english_definition":"An island in Southeast Asia, politically divided between Indonesia, Malaysia, and Brunei.","examples":[{"sentence":"Borneo is known for its rainforests and diverse wildlife.","translation":"ボルネオ島は熱帯雨林と多様な野生生物で知られています。"}],"collocations":["island of Borneo","visit Borneo","Borneo rainforest"],"synonyms":["Kalimantan (Indonesian part)"],"antonyms":[]}],"etymology":{"value":"The origin of the name \"Borneo\" is uncertain, but it is believed to have come from \"Burni,\" a name used by the Sultanate of Brunei to refer to the island. European explorers later adopted and modified the name.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɔːrniːoʊ/","syllables":"Bor-ne-o"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Borneo is the third-largest island in the world and is shared by three countries: Indonesia (Kalimantan), Malaysia (Sabah and Sarawak), and Brunei. It's known for its unique biodiversity, including orangutans, proboscis monkeys, and various species of birds and plants.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Borneo is a country.","correct":"✓ Borneo is an island shared by three countries.","note":"Borneo is not a country; it is an island divided among Indonesia, Malaysia, and Brunei."}],"priority":"★★☆"},"related_words":{"derivatives":["Bornean (adjective, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Borneo' refers to a large island in Southeast Asia. It's important to know that Borneo isn't a country itself but is divided among three countries: Indonesia, Malaysia, and Brunei. The island is famous for its rainforests and unique wildlife, like orangutans. When you read about Borneo, it's often in the context of environmental conservation or the cultures of the indigenous people who live there."},"example_sentences":[{"sentence":"Many endangered species live in the rainforests of **Borneo**.","translation":"多くの絶滅危惧種がボルネオの熱帯雨林に生息しています。","type":"noun","meaning_category":"island"},{"sentence":"We are planning a trip to **Borneo** to see the orangutans.","translation":"オランウータンを見るためにボルネオへの旅行を計画しています。","type":"noun","meaning_category":"island"}]}