{"word":"niyoga","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"（古代インドの）ニヨーガ、子孫を得るための代理出産制度","english_definition":"An ancient Hindu practice where a childless widow or wife could bear children through a designated male relative (often the husband's brother) to continue the family lineage.","examples":[{"sentence":"Niyoga was practiced in ancient India to ensure progeny when a husband was unable to father children.","translation":"ニヨーガは古代インドで、夫が子を成せない場合に子孫を確保するために行われた。"},{"sentence":"The practice of niyoga is mentioned in the Mahabharata when Pandu's wives bore children through this custom.","translation":"ニヨーガの慣習は、パーンドゥの妻たちがこの慣習を通じて子供を産んだという『マハーバーラタ』の中で言及されている。"}],"collocations":["practice niyoga (ニヨーガを行う)","niyoga custom (ニヨーガの慣習)","niyoga tradition (ニヨーガの伝統)"],"synonyms":["levirate","proxy fatherhood","customary insemination"],"antonyms":[]},{"part_of_speech":"noun","definition":"（現代ヨガの）ニヨーガ（特定の流派・実践法）","english_definition":"A modern yoga practice or school (less common usage).","examples":[{"sentence":"Some contemporary yoga schools use the term niyoga to describe their specific approach to yogic practice.","translation":"現代のヨガ流派の中には、自らのヨガ実践法をニヨーガと呼ぶところもある。"}],"collocations":["niyoga practice (ニヨーガの実践)","niyoga school (ニヨーガの流派)"],"synonyms":["yoga practice","yogic method"],"antonyms":[]}],"etymology":{"value":"サンスクリット語「नियोग (niyoga)」に由来し、「任命、委託、指示」を意味する。接頭辞「ni-（下に、内に）」と語根「yuj（結びつける、従事させる）」から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈjoʊɡə/","syllables":"ni-yo-ga"},"inflection":{"noun_plural":"niyogas"},"usage_notes":{"explanation":"「**niyoga**」は主に2つの異なる文脈で使用されます：\n1. **古代インドの慣習**として：子孫を得るための代理出産制度を指し、宗教的・法的な背景を持つ歴史的概念です。現代ではほとんど実践されていませんが、ヒンドゥー教の聖典や叙事詩（『マハーバーラタ』など）で言及されています。\n2. **現代ヨガ**の文脈では、特定の流派や実践法を指すことがありますが、この用法は比較的稀です。\n古代の慣習としてのniyogaは、現代の倫理観から議論を呼ぶことがあるため、使用時には文化的・歴史的文脈を考慮する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Niyoga is a common practice in modern Hinduism.","correct":"✓ Niyoga was an ancient practice rarely followed today.","note":"ニヨーガは現代ではほとんど行われていない古代の慣習です。現在一般的なヒンドゥー教の実践と混同しないようにしましょう。"},{"incorrect":"✗ Niyoga means yoga for knees.","correct":"✓ Niyoga refers to an ancient procreation practice or a yoga school.","note":"語源的に「膝」とは無関係です。サンスクリット語の「yuj（結びつける）」に由来します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":["dharmic niyoga (宗教的に義務付けられたニヨーガ)","niyoga vidhi (ニヨーガの儀式)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文化/宗教用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈以外ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**niyoga**」は、古代インドの慣習または現代ヨガの流派を指す専門的な用語です。古代の文脈では、子孫を得るために夫の兄弟などが代理で父親となる慣行を指し、『マハーバーラタ』などの叙事詩に登場します。現代ヨガでは特定の実践法を指すこともありますが、この用法は稀です。文化的・宗教的に敏感な概念であるため、使用時には正確な文脈理解が必要です。"},"example_sentences":[{"sentence":"The epic describes how Queen Kunti invoked **niyoga** to bear children for her impotent husband.","translation":"叙事詩では、クンティー王妃が不能な夫のために子供を産むため、どのようにニヨーガを行ったかが描かれている。","type":"noun","meaning_category":"古代の慣習"},{"sentence":"Scholars debate whether **niyoga** was socially accepted or merely a literary device in the texts.","translation":"学者たちは、ニヨーガが社会的に容認されていたのか、それとも単なる文学的装置だったのか議論している。","type":"noun","meaning_category":"古代の慣習"},{"sentence":"This **niyoga** center teaches a unique blend of tantra and hatha yoga principles.","translation":"このニヨーガセンターでは、タントラとハタヨガの原理を独自に融合させた教えを伝えている。","type":"noun","meaning_category":"現代ヨガ"}]}