{"word":"Molochship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(SF) A type of spaceship or space station, often large and imposing, associated with a powerful or oppressive organization or government.","english_definition":"(Science Fiction) A type of spaceship or space station, often large and imposing, associated with a powerful or oppressive organization or government.","examples":[{"sentence":"The massive Molochship loomed over the planet, a symbol of the Empire's control.","translation":"巨大なモロクシップが惑星の上にそびえ立ち、帝国の支配の象徴となっていた。"}],"collocations":["massive Molochship","imperial Molochship"],"synonyms":["dreadnought","battleship","mothership"],"antonyms":[]}],"etymology":{"value":"The term combines 'Moloch,' a biblical name for a Canaanite god associated with child sacrifice, and 'ship.' The name suggests a vessel associated with a ruthless or destructive power.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmoʊlɒkˌʃɪp","syllables":"Mo-loch-ship"},"inflection":{"noun_plural":"Molochships"},"usage_notes":{"explanation":"'Molochship' is primarily used in science fiction, particularly in settings depicting dystopian or authoritarian regimes controlling vast interstellar empires. The term evokes a sense of dread and overwhelming power.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The molochship was small and friendly.","correct":"✓ The Molochship was a symbol of fear.","note":"Molochships are typically associated with fear and oppression, not friendliness."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - used almost exclusively in science fiction contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Molochship' is a specialized term primarily used in science fiction. Understanding its meaning requires familiarity with the biblical reference to Moloch and the conventions of science fiction world-building. The term is not commonly encountered outside of this specific genre. "},"example_sentences":[{"sentence":"The rebel fleet faced the might of the imperial Molochship.","translation":"反乱軍艦隊は帝国のモロクシップの力に立ち向かった。","type":"noun","meaning_category":"spaceship"},{"sentence":"The Molochship's arrival signaled the beginning of a new era of oppression.","translation":"モロクシップの到着は、新たな抑圧の時代の始まりを告げた。","type":"noun","meaning_category":"spaceship"}]}