{"word":"Congelifraction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"岩石の凍結破砕、氷食作用","english_definition":"The process of rock disintegration by the repeated freezing and thawing of water in cracks and crevices.","examples":[{"sentence":"Congelifraction is a significant factor in the formation of scree slopes in mountainous regions.","translation":"凍結破砕は、山岳地帯におけるガレ場斜面の形成における重要な要因である。"},{"sentence":"The effects of congelifraction are evident in the jagged peaks of the Alps.","translation":"アルプスのギザギザの山頂には、凍結破砕の影響が明らかに見られる。"}],"collocations":["freeze-thaw weathering","frost weathering","ice wedging"],"synonyms":["frost shattering","cryoclasty"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'congelare' (to freeze) + 'fractio' (a breaking).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒn.dʒəˌlɪ.fræk.ʃən/","syllables":"con-ge-li-frac-tion"},"inflection":{"noun_plural":"congelifractions"},"usage_notes":{"explanation":"Congelifraction is a specific type of physical weathering that occurs in cold climates where water repeatedly freezes and thaws. The expansion of water as it freezes exerts pressure on the surrounding rock, eventually causing it to fracture and break apart. This process is most effective in rocks with pre-existing cracks and joints.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Congelifraction only happens in the arctic.","correct":"✓ Congelifraction happens in any climate with freeze-thaw cycles.","note":"While more common in arctic and alpine environments, congelifraction can occur in any climate that experiences repeated freeze-thaw cycles. "},{"incorrect":"✗ Congelifraction is a chemical weathering process.","correct":"✓ Congelifraction is a physical weathering process.","note":"Congelifraction is a physical weathering process, not a chemical one. It involves the physical breaking apart of rocks, rather than chemical alteration."}],"priority":"★★☆"},"related_words":{"derivatives":["congelifract (adjective: relating to congelifraction)"],"phrasal_verbs":[],"related_terms":["weathering","erosion","freeze-thaw cycle","scree slope","talus slope","frost wedging"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Congelifraction' is a specialized term in geology and physical geography, referring to the breakdown of rocks due to repeated cycles of freezing and thawing. It's primarily encountered in academic contexts or technical discussions related to geomorphology, weathering processes, and cold-climate environments. Understanding this term requires familiarity with basic geological concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The process of **congelifraction** contributes significantly to the erosion of mountain peaks.","translation":"凍結破砕のプロセスは、山頂の浸食に大きく寄与する。","type":"general"},{"sentence":"Evidence of **congelifraction** can be seen in the accumulation of angular rock fragments at the base of cliffs.","translation":"崖の麓にある角張った岩石の破片の集積は、凍結破砕の証拠である。","type":"example"},{"sentence":"The rate of **congelifraction** is influenced by factors such as temperature fluctuations and the presence of moisture.","translation":"凍結破砕の速度は、気温の変動や水分の存在などの要因によって影響を受ける。","type":"scientific"}]}