{"word":"Anthologion","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ギリシア正教)聖歌集","english_definition":"(Eastern Orthodox Church) A liturgical book containing selected hymns from the Octoechos, Triodion, and Pentecostarion, used for the variable parts of Vespers, Matins, and other services.","examples":[{"sentence":"The priest chanted from the Anthologion.","translation":"司祭はアンソロギオンから聖歌を唱えた。"}],"collocations":[],"synonyms":["Menaion","Horologion","Octoechos","Triodion","Pentecostarion"],"antonyms":[]}],"etymology":{"value":"From the Greek word ἀνθολόγιον (anthologion), meaning \"collection of flowers\" or \"collection of choice pieces,\" from ἀνθολογία (anthologia), \"collection of flowers, anthology,\" from ἄνθος (anthos), \"flower\" + -λογία (-logia), \"collection.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænθəˈloʊdʒiən/","syllables":"An-thol-o-gi-on"},"inflection":{"noun_plural":"Anthologia (Greek plural form, rarely used in English)"},"usage_notes":{"explanation":"The Anthologion is a key liturgical text in the Eastern Orthodox tradition. It is a compilation of hymns used throughout the liturgical year, drawing from various other hymn books. It is distinct from fixed-cycle liturgical books like the Horologion and Menaion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read the Anthologion like a novel.","correct":"✓ I studied the Anthologion to understand the hymns.","note":"The Anthologion is a liturgical text, not a work of fiction. It is used in worship and studied for its theological and musical content."}],"priority":"★☆☆"},"related_words":{"derivatives":["anthology"],"related_terms":["liturgy","hymn","Orthodox Church","vespers","matins"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized religious vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Anthologion' is highly specialized, pertaining specifically to Eastern Orthodox liturgical practices. Understanding its usage requires familiarity with Orthodox Christian worship and hymnography. It is unlikely to be encountered outside of this context."},"example_sentences":[{"sentence":"The chanter carefully turned the pages of the heavily ornamented Anthologion.","translation":"詠唱者は、装飾がふんだんに施されたアンソロギオンのページを注意深くめくった。","type":"example","meaning_category":"liturgical text"},{"sentence":"Scholars analyze the poetic structure and theological themes within the hymns of the Anthologion.","translation":"学者たちは、アンソロギオンの聖歌の中にある詩的な構造と神学的なテーマを分析する。","type":"example","meaning_category":"scholarly study"}]}