{"word":"Heptarch","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"七王国時代 (七王国分立時代)","english_definition":"A system of government by seven rulers; specifically, the seven Anglo-Saxon kingdoms of England during the 6th-8th centuries.","examples":[{"sentence":"The Anglo-Saxon Heptarchy consisted of Northumbria, Mercia, East Anglia, Essex, Kent, Sussex, and Wessex.","translation":"アングロサクソン七王国時代は、ノーサンブリア、マーシア、イーストアングリア、エセックス、ケント、サセックス、ウェセックスで構成されていた。"}],"collocations":["Anglo-Saxon Heptarchy","Age of the Heptarchy"],"synonyms":["Seven Kingdoms"],"antonyms":[]}],"etymology":{"value":"From the Greek ἑπτά (heptá, \"seven\") + ἀρχή (arkhḗ, \"rule, realm\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛptɑːrk/","syllables":"Hep-tarch"},"inflection":{"noun_plural":"Heptarchies"},"usage_notes":{"explanation":"The term 'Heptarchy' is primarily used in historical contexts when discussing the early medieval period of England. It refers to the time when England was divided into seven major Anglo-Saxon kingdoms. While the term suggests equal power among the seven, in reality, some kingdoms were more dominant than others at different times.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Heptarchy was a monarchy.","correct":"✓ The Heptarchy was a period of multiple kingdoms.","note":"The Heptarchy refers to a period with multiple kingdoms, not a single monarchy."}],"priority":"★☆☆"},"related_words":{"derivatives":["heptarchic (adjective)"],"phrases":["Anglo-Saxon England","Early Medieval England"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Heptarch' is a specialized term used in the context of early English history. Understanding requires familiarity with the Anglo-Saxon period and the political structure of England during that time. It is not commonly used outside of historical discussions or academic contexts."},"example_sentences":[{"sentence":"The history of the Heptarchy is complex and often debated by scholars.","translation":"七王国時代の歴史は複雑であり、学者によってしばしば議論される。","type":"noun","meaning_category":"七王国時代"},{"sentence":"Each kingdom within the Anglo-Saxon Heptarchy had its own distinct culture and traditions.","translation":"アングロサクソン七王国時代の各王国は、独自の文化と伝統を持っていた。","type":"noun","meaning_category":"七王国時代"}]}