{"word":"Adultress","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"姦婦、不倫の罪を犯した女性","english_definition":"A woman who is married and has sexual relations with someone who is not her husband.","examples":[{"sentence":"She was branded an adultress and shunned by society.","translation":"彼女は姦婦の烙印を押され、社会からつまはじきにされた。"},{"sentence":"In some cultures, an adultress faces severe consequences.","translation":"一部の文化では、姦婦は厳しい結果に直面する。"}],"collocations":["commit adultery (姦淫を犯す)","accuse someone of being an adultress (誰かを姦婦だと非難する)"],"synonyms":["adulteress","unfaithful wife","cheater"],"antonyms":["faithful wife","loyal wife"]}],"etymology":{"value":"Derived from the Latin word \"adulter\", which means \"to defile, to commit adultery\".","priority":"★★☆"},"pronunciation":{"ipa":"/əˈdʌltrəs/","syllables":"a-dul-tress"},"inflection":{"noun_plural":"adultresses"},"usage_notes":{"explanation":"The term \"adultress\" is a formal and somewhat archaic term for a woman who commits adultery. It is less commonly used in modern English, with terms like \"cheater\" or \"unfaithful wife\" being more prevalent. The term carries a strong negative connotation, often implying moral condemnation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He called her an adulterer, but she is a woman.","correct":"✓ He called her an adultress, because she is a woman.","note":"\"Adulterer\" is the term for a man who commits adultery; \"adultress\" is the term for a woman."}],"priority":"★★☆"},"related_words":{"derivatives":["adultery (noun: 姦淫、不倫)","adulterous (adjective: 姦淫の、不倫の)","adulterer (noun: 姦夫、不倫の罪を犯した男性)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"adultress\" is a formal and less common term for a married woman who has sexual relations with someone other than her husband. It is often associated with legal or moral contexts and carries a strong negative connotation. Due to its infrequent use in modern conversation, it is generally encountered in literature, historical texts, or discussions of ethics and law. Understanding the term requires familiarity with formal vocabulary and an awareness of its historical and cultural implications."},"example_sentences":[{"sentence":"The novel explores the consequences faced by an adultress in Victorian society.","translation":"その小説は、ビクトリア朝社会における姦婦が直面する結果を探求している。","type":"noun","meaning_category":"姦婦"}]}