{"word":"auteciousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尊大さ、独善、独りよがり","english_definition":"The quality or state of being autecious; self-sufficiency, self-importance, or arrogance.","examples":[{"sentence":"His auteciousness made it difficult for him to accept advice from others.","translation":"彼の尊大な態度は、彼が他人からのアドバイスを受け入れるのを困難にした。"},{"sentence":"The auteciousness of the CEO was evident in his dismissive attitude towards his employees' concerns.","translation":"CEOの独善的な態度は、従業員の懸念に対する彼の無視するような態度に明らかだった。"}],"collocations":["display auteciousness (尊大さを示す)","perceive auteciousness (尊大さを感じる)","criticize auteciousness (尊大さを批判する)"],"synonyms":["arrogance","hubris","self-importance","conceit","pompousness","superciliousness"],"antonyms":["humility","modesty","meekness","submissiveness"]}],"etymology":{"value":"Derived from the word \"autecious,\" which is formed from the Greek \"autos\" (self) and \"echo\" (to have or hold). It implies a self-contained or self-sufficient quality, often associated with arrogance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtɪˈʃɛsnəs/","syllables":"au-te-cious-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Auteciousness\" is a relatively rare and formal word used to describe an excessive sense of self-importance or self-sufficiency. It suggests a belief in one's own abilities or opinions to the exclusion of others' perspectives. It is often used in critical contexts to denote a negative character trait.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed auteciousness by helping everyone.","correct":"✓ She showed generosity by helping everyone.","note":"Auteciousness implies arrogance, not helpfulness. Use a word like 'generosity' or 'kindness' to describe helping others."},{"incorrect":"✗ The auteciousness of the situation was overwhelming.","correct":"✓ The complexity of the situation was overwhelming.","note":"Auteciousness describes a personal trait, not a situation. Use a word like 'complexity' or 'difficulty' to describe a situation."}],"priority":"★★☆"},"related_words":{"derivatives":["autecious (adjective)","auteciously (adverb)"],"phrasal_verbs":null,"related_concepts":["egotism","narcissism","vanity","self-centeredness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Auteciousness\" is a rare and sophisticated word. It describes the quality of being excessively self-sufficient and arrogant, often to the point of disregarding the opinions and contributions of others. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or academic contexts. Understanding its meaning requires a strong vocabulary and an appreciation for nuanced language. It is often used to critically describe someone's behavior or attitude."},"example_sentences":[{"sentence":"The professor's auteciousness alienated many of his students.","translation":"その教授の尊大な態度は多くの学生を遠ざけた。","type":"general","meaning_category":"尊大さ"},{"sentence":"Her auteciousness was masked by a veneer of politeness.","translation":"彼女の尊大さは、丁寧さという見せかけで覆い隠されていた。","type":"general","meaning_category":"尊大さ"},{"sentence":"The company's auteciousness led them to ignore market trends, resulting in significant losses.","translation":"その会社の独善的な態度は、市場の動向を無視することにつながり、多大な損失をもたらした。","type":"general","meaning_category":"独善"}]}