{"word":"creeshed","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(onomatopoeia) To make a loud, harsh, grating sound, similar to a screech but often lower in pitch or more prolonged. This word is often used informally or playfully.","english_definition":"To make a loud, harsh, grating sound. Often an informal or onomatopoeic term.","examples":[{"sentence":"The old gate creeshed open, revealing a dark path.","translation":"古い門がギーッと音を立てて開き、暗い道が現れた。"},{"sentence":"As the car turned the corner, the tires creeshed loudly.","translation":"車が角を曲がるとき、タイヤが大きな音を立てた。"},{"sentence":"The rusty swing creeshed with every push.","translation":"錆びたブランコは押すたびにギーギーと音を立てた。"}],"collocations":["creeshed open","tires creeshed","swing creeshed"],"synonyms":["screech","grate","grind","scrape","squeal"],"antonyms":["silent","quiet"]}],"etymology":{"value":"Likely an onomatopoeic formation, imitating the sound it describes. It is similar to 'screech' but may imply a lower, rougher, or more drawn-out sound.","priority":"★★☆"},"pronunciation":{"ipa":"/kriːʃt/","syllables":"creeshed"},"inflection":{"verb_forms":{"present_simple":["creesh","creeshes"],"past_simple":"creeshed","past_participle":"creeshed","present_participle":"creeshing"}},"usage_notes":{"explanation":"'Creeshed' is an informal and onomatopoeic word, meaning it imitates the sound it describes. It typically refers to a loud, harsh, grating sound, often associated with metal or old objects. It is less common than 'screech' or 'grind' but can be used to add vividness to descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird creeshed in the sky.","correct":"✓ The bird screeched in the sky.","note":"Birds typically 'screech' or 'chirp,' not 'creesh.' 'Creesh' is usually reserved for mechanical or grating sounds."},{"incorrect":"✗ The music creeshed beautifully.","correct":"✓ The music soared beautifully.","note":"'Creesh' implies an unpleasant sound, so it would not be used to describe beautiful music."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning materials)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Creeshed' is a relatively uncommon, informal word used to describe a loud, harsh, grating sound. It is often used in descriptive writing to add a specific auditory image. Because it is not a standard vocabulary word, it is more likely to be encountered in literature or informal contexts. Understanding its meaning relies heavily on context and familiarity with onomatopoeia.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The brakes creeshed as the car came to a sudden stop.","translation":"車が急停止したとき、ブレーキがキーッと音を立てた。","type":"verb","meaning_category":"sound"},{"sentence":"The door creeshed open, revealing a dusty attic.","translation":"ドアがギーッと音を立てて開き、埃っぽい屋根裏部屋が現れた。","type":"verb","meaning_category":"sound"},{"sentence":"The old swing creeshed in the wind.","translation":"古いブランコが風の中でギーギーと音を立てた。","type":"verb","meaning_category":"sound"}]}