{"word":"Pyramidalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピラミッド構造主義：社会、組織、または思考がピラミッドのような階層構造を持つこと。頂点に少数の権力者または支配者が存在し、下層に向かって人数が増える構造。","english_definition":"A hierarchical system or structure resembling a pyramid, with a small number of individuals or entities at the top holding the most power or influence, and a larger number at the bottom.","examples":[{"sentence":"The company's management structure was characterized by pyramidalism, with decision-making concentrated at the executive level.","translation":"その会社の経営構造はピラミッド構造主義によって特徴づけられ、意思決定は経営幹部レベルに集中していた。"},{"sentence":"Critics argued that the political system suffered from pyramidalism, limiting the participation of ordinary citizens.","translation":"批評家たちは、その政治システムがピラミッド構造主義に苦しんでおり、一般市民の参加を制限していると主張した。"}],"collocations":["organizational pyramidalism","political pyramidalism","social pyramidalism"],"synonyms":["hierarchy","stratification","ranking","pecking order"],"antonyms":["egalitarianism","flat structure","decentralization"]}],"etymology":{"value":"\"Pyramidal\"（ピラミッド状の）+ \"-ism\"（主義、状態）から構成される。ピラミッドの形状が階層構造を象徴することから、この用語が生まれた。","priority":"★★☆"},"pronunciation":{"ipa":"/pɪˈræmɪdəlɪzəm/","syllables":"py-ram-i-dal-ism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"\"Pyramidalism\"は、社会科学、組織論、政治学などの分野で使用される専門用語です。権力や資源が頂点に集中し、下層に広がる構造を指します。批判的な文脈で使用されることが多く、不平等や非民主的な構造を指摘する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyramidalism of the organization made it very efficient.","correct":"✓ The hierarchical structure of the organization made it very efficient.","note":"\"Pyramidalism\"は、必ずしも効率性を意味するわけではありません。階層構造が効率的であるという文脈では、\"hierarchical structure\"を使用する方が適切です。"},{"incorrect":"✗ Pyramidalism is always a negative thing.","correct":"✓ Pyramidalism can lead to inequalities and limited participation.","note":"\"Pyramidalism\"は、必ずしも常に否定的なものではありませんが、不平等や参加の制限につながる可能性があることを指摘する方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["pyramidal (形容詞：ピラミッド状の)","pyramid (名詞：ピラミッド)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pyramidalism\"は、社会や組織の構造がピラミッドのように階層化されている状態を指す専門用語です。権力や資源が頂点に集中し、下層に向かって広がる構造を意味します。この単語は、社会科学や政治学などの分野で、不平等や非民主的な構造を批判的に議論する際に用いられます。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The ancient Egyptian society was characterized by strong pyramidalism, with the pharaoh at the apex.","translation":"古代エジプト社会は、ファラオを頂点とする強いピラミッド構造主義によって特徴づけられていた。","type":"general","meaning_category":"社会構造"},{"sentence":"The pyramidalism in the corporation led to a lack of communication between different levels of employees.","translation":"その企業におけるピラミッド構造主義は、従業員の異なるレベル間でのコミュニケーション不足につながった。","type":"general","meaning_category":"組織構造"}]}