{"word":"colunar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"柱状の、円柱形の","english_definition":"Resembling or pertaining to a column or columns; having the form of a column.","examples":[{"sentence":"The basalt formations were colunar in structure.","translation":"その玄武岩の地層は柱状構造をしていた。"},{"sentence":"The colunar cacti stood tall in the desert landscape.","translation":"その円柱形のサボテンは砂漠の風景の中で高くそびえ立っていた。"}],"collocations":["colunar basalt","colunar structure","colunar jointing"],"synonyms":["columnar","cylindrical","pillared"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'columna,' meaning column or pillar, with the suffix '-ar' indicating resemblance or pertaining to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒləˌnər/","syllables":"co-lu-nar"},"inflection":{"notes":"Comparative and superlative forms are 'more colunar' and 'most colunar,' respectively, although these are rarely used."},"usage_notes":{"explanation":"'Colunar' is primarily a descriptive term used in geology, botany, and architecture to describe objects or structures that resemble columns. It is often used interchangeably with 'columnar,' although 'columnar' is more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building had a colunar design, with many squares.","correct":"✓ The building had a colunar design, with many columns.","note":"'Colunar' describes something resembling columns, not squares. Use 'columns' instead of 'colunars' when referring to the structural elements themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["column (noun): A vertical structural member used to support loads.","columnar (adjective): Similar to colunar, but more commonly used.","colonnade (noun): A series of columns arranged in a line."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'colunar' is a relatively uncommon term, primarily used in specialized fields such as geology, botany, and architecture. It describes something that resembles or pertains to a column. Because of its specialized usage, it is more likely to be encountered in academic or technical contexts rather than in everyday conversation."},"example_sentences":[{"sentence":"The Giant's Causeway is famous for its naturally formed colunar basalt.","translation":"ジャイアンツ・コーズウェイは、自然に形成された柱状玄武岩で有名です。","type":"adjective","meaning_category":"柱状の"},{"sentence":"The colunar arrangement of cells is characteristic of certain plant tissues.","translation":"細胞の柱状配列は、特定の植物組織の特徴です。","type":"adjective","meaning_category":"柱状の"}]}