{"word":"monocondylian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単顆性の、単顆亜綱の","english_definition":"Having a single condyle (rounded projection at the end of a bone) for articulation, especially referring to the skull's articulation with the vertebral column; pertaining to the Monocondylia (an obsolete taxonomic group).","examples":[{"sentence":"Birds are monocondylian because their skull articulates with the vertebral column via a single occipital condyle.","translation":"鳥類は、単一の後頭顆を介して頭蓋骨が脊柱と関節するため、単顆性である。"},{"sentence":"The monocondylian condition is a characteristic feature of birds and reptiles.","translation":"単顆性の状態は、鳥類と爬虫類の特徴的な特徴である。"}],"collocations":["monocondylian skull","monocondylian articulation","monocondylian condition"],"synonyms":["single-condyled"],"antonyms":["dicondylian","polycondylian"]}],"etymology":{"value":"From 'mono-' (single) + 'condyle' (a rounded projection on a bone) + '-ian' (suffix indicating pertaining to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒn.ə.kɒnˈdɪ.li.ən/","syllables":"mo-no-con-dy-li-an"},"inflection":{"notes":"Comparative and superlative forms are possible but rare (more monocondylian, most monocondylian)."},"usage_notes":{"explanation":"The term 'monocondylian' is primarily used in zoology and comparative anatomy to describe the skull structure of certain vertebrates, particularly birds and reptiles. It refers to the presence of a single occipital condyle, which is a rounded projection on the occipital bone that articulates with the first vertebra (atlas). This is in contrast to dicondylian animals (such as mammals and amphibians) that have two occipital condyles. The term is less commonly used outside of technical scientific contexts. The obsolete taxonomic group 'Monocondylia' was based on this anatomical feature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monocondylian animal had two condyles.","correct":"✓ The monocondylian animal had one condyle.","note":"'Monocondylian' means having a single condyle, so it's contradictory to say it has two."},{"incorrect":"✗ Monocondylian refers to the number of legs.","correct":"✓ Monocondylian refers to the number of condyles in the skull's articulation with the vertebral column.","note":"'Monocondylian' specifically describes the skull's articulation with the vertebral column, not the number of legs."}],"priority":"★★☆"},"related_words":{"derivatives":["monocondyle (noun: a single condyle)"],"related_terms":["dicondylian (adjective: having two condyles)","condyle (noun: a rounded projection on a bone)","occipital condyle (noun: the condyle(s) on the occipital bone)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Very low frequency. A specialized term used primarily in zoology and comparative anatomy.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Monocondylian' is a technical term from zoology and comparative anatomy. It describes animals, primarily birds and reptiles, whose skulls connect to their spine with a single rounded projection called a condyle. This is different from mammals and amphibians, which have two condyles (dicondylian). You'll mainly find this word in scientific texts about animal anatomy and evolution."},"example_sentences":[{"sentence":"The **monocondylian** nature of the avian skull allows for greater head mobility.","translation":"鳥類の頭蓋骨の単顆性という性質は、頭部の可動性を高める。","type":"adjective","meaning_category":"anatomical description"},{"sentence":"Reptiles, like birds, exhibit a **monocondylian** articulation between the skull and the atlas.","translation":"爬虫類は鳥類と同様に、頭蓋骨と環椎の間に単顆性の関節を示す。","type":"adjective","meaning_category":"anatomical description"}]}