{"word":"frillers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)フリル、ひだ飾り","english_definition":"plural of friller: ornamental ruffles or pleats on clothing or other items.","examples":[{"sentence":"The dress had frillers around the neckline and cuffs.","translation":"そのドレスはネックラインと袖口にフリルがついていた。"},{"sentence":"She added frillers to the curtains to make them look more elegant.","translation":"彼女はカーテンにフリルを加えて、よりエレガントに見えるようにした。"}],"collocations":["lace frillers (レースのフリル)","dress frillers (ドレスのフリル)","curtain frillers (カーテンのフリル)"],"synonyms":["ruffles","flounces","furbelows","trimming","lace"],"antonyms":[]}],"etymology":{"value":"'Friller' is derived from 'frill,' which comes from Middle English 'frille,' meaning 'an edge or border of fabric gathered or pleated.' The suffix '-er' is added to denote something that produces or is associated with frills.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɪlərz/","syllables":"frill-ers"},"inflection":{"noun_plural":"frillers"},"usage_notes":{"explanation":"'Frillers' is the plural form of 'friller,' referring to multiple frills or a decorative trim consisting of frills. It is primarily used to describe ornamental additions to clothing, curtains, or other items. The term emphasizes the presence of several frills rather than a single one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The frillers was added to the dress.","correct":"✓ The frillers were added to the dress.","note":"'Frillers' is plural, so it takes a plural verb ('were')."},{"incorrect":"✗ She added a frillers to the shirt.","correct":"✓ She added frillers to the shirt.","note":"If adding more than one frill, use the plural form 'frillers.' If adding only one, use 'a frill'."}],"priority":"★★☆"},"related_words":{"derivatives":["frill (noun: a strip of gathered or pleated material used for trimming)","frilly (adjective: decorated with frills; excessively ornamental)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'frillers' is a relatively uncommon term, primarily used in contexts related to fashion, decoration, and sewing. It refers specifically to multiple frills, which are ornamental ruffles or pleats. Understanding this word requires familiarity with fashion terminology and decorative arts. It is more likely to be encountered in written texts or specialized conversations related to these fields."},"example_sentences":[{"sentence":"The Victorian gown was adorned with layers of delicate lace frillers.","translation":"そのビクトリア朝のガウンは、繊細なレースのフリルが何層にも重ねられて飾られていた。","type":"noun","meaning_category":"装飾"},{"sentence":"She sewed the frillers onto the edge of the pillowcase.","translation":"彼女はピローケースの端にフリルを縫い付けた。","type":"noun","meaning_category":"装飾"},{"sentence":"The frillers on her blouse gave it a feminine touch.","translation":"彼女のブラウスのフリルは、女性らしい雰囲気を添えていた。","type":"noun","meaning_category":"装飾"}]}