{"word":"rehabilitation-independent","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"リハビリテーションを必要としない、またはリハビリテーションなしで自立できる","english_definition":"describing a person or condition that does not require rehabilitation or is able to function independently without rehabilitation.","examples":[{"sentence":"The patient was rehabilitation-independent after the surgery and was discharged quickly.","translation":"手術後、患者はリハビリテーションを必要とせず、すぐに退院しました。"},{"sentence":"Despite the injury, he remained largely rehabilitation-independent.","translation":"怪我にもかかわらず、彼はほとんどリハビリテーションなしで自立した状態を維持しました。"}],"collocations":["rehabilitation-independent patient","rehabilitation-independent status","rehabilitation-independent living"],"synonyms":["self-sufficient","autonomous","independent","able-bodied"],"antonyms":["rehabilitation-dependent","dependent","disabled","incapacitated"],"notes":"This term is often used in medical contexts to describe a patient's functional ability after an illness or injury."}],"etymology":{"value":"Combination of 'rehabilitation' (the process of restoring someone to health or normal life through training and therapy), 'independent' (not relying on or needing another person for support), and a hyphen connecting them.","priority":"low"},"pronunciation":{},"inflection":{},"usage_notes":{"explanation":"The term 'rehabilitation-independent' indicates a level of functional recovery where the individual can manage daily activities without ongoing rehabilitative support. It's a positive outcome in medical and therapeutic settings.","priority":"medium"},"common_mistakes":{},"related_words":{"derivatives":["rehabilitation","independent","dependence","functional independence"],"related_terms":["activities of daily living (ADL)","instrumental activities of daily living (IADL)","functional capacity evaluation"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'rehabilitation-independent' is a specialized term used in medical and rehabilitation contexts. It describes a patient who has recovered sufficiently to perform daily activities without needing ongoing rehabilitation services. Understanding this term requires familiarity with medical and therapeutic terminology."},"example_sentences":[{"sentence":"The goal of the treatment was to make the patient rehabilitation-independent.","translation":"治療の目標は、患者をリハビリテーションなしで自立できるようにすることでした。","type":"general","meaning_category":"general"},{"sentence":"The assessment showed that she was rehabilitation-independent in most areas.","translation":"評価の結果、彼女はほとんどの分野でリハビリテーションなしで自立していることが示されました。","type":"medical","meaning_category":"medical"}]}