{"word":"neuronymy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)神経学的な意味関係。単語の意味が脳のどの領域で処理されるか、またはどのような神経活動パターンを引き起こすかという観点から、単語間の意味的な関係を研究する分野。","english_definition":"(linguistics) The study of semantic relationships between words based on how they are processed in the brain, or what neural activity patterns they evoke.","examples":[{"sentence":"Neuronymy seeks to map semantic relationships onto neural representations.","translation":"神経類義語研究は、意味的な関係を神経表現にマッピングしようと試みる。"},{"sentence":"Advances in neuroimaging techniques are enabling new insights into neuronymy.","translation":"神経イメージング技術の進歩は、神経類義語研究に新たな洞察を可能にしている。"}],"collocations":["study of neuronymy (神経類義語の研究)","neural representation (神経表現)","semantic relationship (意味的関係)","neuroimaging techniques (神経イメージング技術)"],"synonyms":["semantic neuroscience","neurosemantics"],"antonyms":[]}],"etymology":{"value":"\"neuro-\" (神経) + \"-onymy\" (名前に関する研究、ここでは意味関係の研究)","priority":"★★★"},"pronunciation":{"ipa":"/njʊˈrɒnɪmi/","syllables":"neu-ro-ny-my"},"inflection":{"noun_plural":"neuronymies"},"usage_notes":{"explanation":"Neuronymy is a relatively new field that combines linguistics and neuroscience to understand how the brain processes language and meaning. It explores how different words and concepts are represented in the brain and how these representations relate to each other. This field often utilizes neuroimaging techniques such as fMRI and EEG to study brain activity during language processing.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["neurosemantic (形容詞: 神経意味論的な)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Neuronymy is a highly specialized term in the field of linguistics and neuroscience, referring to the study of semantic relationships based on neural activity. It is unlikely to be encountered outside of academic or research contexts. Understanding this term requires familiarity with both linguistic semantics and neuroscientific concepts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The research explored the neuronymy of emotion words using fMRI.","translation":"その研究はfMRIを用いて感情語の神経類義語を調査した。","type":"general","meaning_category":"神経学的な意味関係"}]}