{"word":"stark-wood","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー)スターク家の領地にある森、またはその森の木材を指す造語","english_definition":"(Fantasy) A neologism referring to the woods in the Stark family's territory, or the wood from those trees.","examples":[{"sentence":"The walls of Winterfell were built with stark-wood, making them incredibly strong.","translation":"ウィンターフェルの壁はスタークウッドで建てられており、非常に強固だ。"},{"sentence":"He carved a direwolf sigil from a piece of stark-wood.","translation":"彼はスタークウッドの木片からダイアウルフの紋章を彫った。"}],"collocations":["Winterfell stark-wood","carved stark-wood","stark-wood walls"],"synonyms":["weirwood","ironwood","heartwood"],"antonyms":[]}],"etymology":{"value":"A compound word created by author George R.R. Martin for his 'A Song of Ice and Fire' series. 'Stark' refers to the family name, and 'wood' refers to the material.","priority":"★★☆"},"pronunciation":{"ipa":"/stɑːrk.wʊd/","syllables":"stark-wood"},"inflection":{"notes":"This is a noun, so it has a plural form, although it is rarely used: stark-woods."},"usage_notes":{"explanation":"'Stark-wood' is a fictional term, primarily used within the context of the 'A Song of Ice and Fire' universe (and the 'Game of Thrones' TV adaptation). It is not a standard English word.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a table made of stark-wood at IKEA.","correct":"✓ I bought a wooden table at IKEA.","note":"'Stark-wood' is not a real type of wood, so it cannot be purchased in real life."}],"priority":"★★☆"},"related_words":{"derivatives":["Stark (family name)","wood (general term for timber)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low (due to being a fictional term).","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'stark-wood' is highly specific to the 'A Song of Ice and Fire' universe and is not part of standard English vocabulary. Understanding requires familiarity with the source material. Usage outside of this context would likely be confusing.","note":"This term is very specific to a particular fictional universe."},"example_sentences":[{"sentence":"The ancient doors of the castle were made of heavy stark-wood.","translation":"城の古代の扉は重いスタークウッドで作られていた。","type":"noun","meaning_category":"fictional wood"},{"sentence":"A fire of stark-wood burned brightly in the hearth.","translation":"暖炉の中ではスタークウッドの火が明るく燃えていた。","type":"noun","meaning_category":"fictional wood"}]}