{"word":"nonarbitrarily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"恣意的でなく、根拠に基づいて、客観的に","english_definition":"In a way that is not based on random choice or personal whim, but rather on reason, principle, or evidence; objectively.","examples":[{"sentence":"The data was analyzed nonarbitrarily to ensure the results were valid.","translation":"結果の有効性を保証するために、データは恣意的にではなく分析された。"},{"sentence":"The selection criteria were applied nonarbitrarily to all candidates.","translation":"選考基準は、すべての候補者に恣意的にではなく適用された。"},{"sentence":"The decision was made nonarbitrarily, considering all available information.","translation":"その決定は、利用可能なすべての情報を考慮して、恣意的にではなく行われた。"}],"collocations":["decide nonarbitrarily","select nonarbitrarily","analyze nonarbitrarily","apply nonarbitrarily","determine nonarbitrarily"],"synonyms":["objectively","logically","rationally","consistently","fairly","justly","impartially"],"antonyms":["arbitrarily","randomly","subjectively","capriciously","whimsically"]}],"etymology":{"value":"「non-」(否定) + 「arbitrarily」(恣意的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌɑːrbɪˈtrɛrɪli/","syllables":"non-ar-bi-tra-ri-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Nonarbitrarily' means that something is done or decided based on objective reasons, principles, or evidence, rather than personal feelings or random choices. It emphasizes fairness, consistency, and a lack of bias. It is often used in formal or technical contexts to describe processes or decisions that are carefully considered and justified.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The software assigned the tasks nonarbitrarily, so some people got easier work.","correct":"✓ The software assigned the tasks arbitrarily, so some people got easier work.","note":"Make sure to use 'nonarbitrarily' when you mean the opposite of 'arbitrarily'. The incorrect sentence suggests the software assigned tasks based on a system, but some people still got easier work, which doesn't make sense. Using 'arbitrarily' makes the sentence logical."},{"incorrect":"✗ He nonarbitrarily chose the winner.","correct":"✓ He objectively chose the winner. / ✓ He nonarbitrarily selected the winner.","note":"'Nonarbitrarily chose' is grammatically correct, but 'objectively chose' sounds more natural and is a more common way to express the idea. If you want to use 'nonarbitrarily', consider pairing it with verbs like 'select', 'analyze', or 'apply' for a more natural usage."}],"priority":"★★☆"},"related_words":{"derivatives":["arbitrary (adjective)","arbitrarily (adverb)","arbitrariness (noun)"],"phrases":["non-arbitrary decision","non-arbitrary selection","non-arbitrary assignment"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonarbitrarily' is a formal and uncommon word meaning 'not based on random choice or personal whim.' It is used to describe decisions or actions that are based on reason, evidence, or established principles. Because it is a negation ('non-'), it can be tricky to understand and use correctly. It's best used in formal or technical writing when you want to emphasize the objectivity and fairness of a process or decision."},"example_sentences":[{"sentence":"The committee evaluated the proposals nonarbitrarily, using a standardized scoring system.","translation":"委員会は、標準化された採点システムを使用して、提案を恣意的にではなく評価した。","type":"general","meaning_category":"客観的に評価する"},{"sentence":"The algorithm was designed to assign resources nonarbitrarily, ensuring that each user received a fair share.","translation":"アルゴリズムは、各ユーザーが公平な分け前を受け取れるように、リソースを恣意的にではなく割り当てるように設計された。","type":"technical","meaning_category":"客観的に割り当てる"},{"sentence":"The judge ruled that the law must be applied nonarbitrarily to all citizens, regardless of their background.","translation":"裁判官は、法律はすべての市民に、その背景に関係なく、恣意的にではなく適用されなければならないと裁定した。","type":"legal","meaning_category":"客観的に適用する"}]}