{"word":"Parisianism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"パリ風、パリ趣味、パリらしさ、パリ特有の気風","english_definition":"The characteristics, qualities, or customs associated with Paris or Parisians.","examples":[{"sentence":"The Parisianism of the café was evident in its decor and ambiance.","translation":"そのカフェのパリ風な雰囲気は、内装と雰囲気に明らかだった。"},{"sentence":"She adopted a certain Parisianism in her style of dress.","translation":"彼女は服装のスタイルに、ある種のパリ風を取り入れた。"}],"collocations":["Embrace Parisianism","Exhibit Parisianism","Capture Parisianism"],"synonyms":["Parisian style","Parisian chic","Parisian flair","Parisian culture"],"antonyms":["Provincialism","Ruralism"]},{"part_of_speech":"noun","definition":"パリの言葉遣い、パリ方言","english_definition":"A word, phrase, or idiom peculiar to Paris or its inhabitants.","examples":[{"sentence":"The novel was filled with Parisianisms that were difficult for non-native speakers to understand.","translation":"その小説は、パリ特有の言葉遣いで満たされており、ネイティブスピーカー以外には理解が難しかった。"}],"collocations":["Use Parisianisms","Understand Parisianisms","Translate Parisianisms"],"synonyms":["Parisian idiom","Parisian expression","Parisian slang"],"antonyms":[]}],"etymology":{"value":"Formed from 'Parisian' (relating to Paris) + '-ism' (denoting a characteristic, principle, or usage).","priority":"★★★"},"pronunciation":{"ipa":"/pəˈriːziənɪzəm/","syllables":"Pa-ri-si-an-ism"},"inflection":{"noun_plural":"Parisianisms"},"usage_notes":{"explanation":"'Parisianism' refers to the qualities, customs, or characteristics associated with Paris and its inhabitants. It can also refer to a word or expression peculiar to Paris. The term often implies a certain sophistication, elegance, or cultural refinement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Parisianism is beautiful.","correct":"✓ The Parisianism of the city is beautiful.","note":"'Parisianism' is an abstract noun and needs context to be meaningful. Specifying what aspect of Parisianism is being discussed makes the sentence clearer."}],"priority":"★☆☆"},"related_words":{"derivatives":["Parisian (adjective, noun)"],"related_terms":["Frenchism","Gallicism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parisianism' is a relatively uncommon word that refers to the characteristics, qualities, or customs associated with Paris. It often implies a certain sophistication or cultural refinement. The word is more likely to be encountered in literary or academic contexts when discussing aspects of Parisian culture."},"example_sentences":[{"sentence":"The film director sought to capture the essence of Parisianism in his latest movie.","translation":"その映画監督は、最新作でパリらしさの本質を捉えようとした。","type":"general","meaning_category":"パリ風、パリ趣味"},{"sentence":"Her apartment was decorated with a deliberate Parisianism, featuring antique furniture and artwork.","translation":"彼女のアパートは、アンティーク家具や美術品を特徴とする、意図的なパリ風で装飾されていた。","type":"general","meaning_category":"パリ風、パリ趣味"},{"sentence":"The author sprinkled his dialogue with Parisianisms, adding authenticity to the characters' conversations.","translation":"著者は登場人物の会話に信憑性を加えるため、パリ特有の言い回しを散りばめた。","type":"linguistic","meaning_category":"パリの言葉遣い"}]}