{"word":"encorajar-se","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(ポルトガル語) 勇気づけられる、元気づけられる、励まされる (再帰動詞)","english_definition":"(Portuguese) to be encouraged, to be heartened, to be cheered up (reflexive verb).","examples":[{"sentence":"Ele precisava encorajar-se para enfrentar o desafio.","translation":"彼はその挑戦に立ち向かうために、自分を勇気づける必要があった。"},{"sentence":"Ela encorajou-se com as palavras de apoio dos amigos.","translation":"彼女は友人たちの励ましの言葉に元気づけられた。"}],"collocations":["encorajar-se a fazer algo (何かをするように自分を勇気づける)"],"synonyms":["animar-se","incentivar-se","motivar-se","fortalecer-se"],"antonyms":["desanimar-se","amedrontar-se"],"notes":"This is the reflexive form of the verb \"encorajar\" (to encourage). It implies that the subject is encouraging themselves."}],"etymology":{"value":"Derived from the verb \"encorajar\" (to encourage), which comes from \"coragem\" (courage) + the prefix \"en-\" (to put in/into). The reflexive pronoun \"-se\" indicates that the action is directed back to the subject.","priority":"N/A"},"pronunciation":{"ipa":"/ẽ.ko.ɾaˈʒaɾ.si/","syllables":"en-co-ra-jar-se"},"inflection":{"verb_forms":{"infinitive":"encorajar-se","gerund":"encorajando-se","past_participle":"encorajado"},"notes":"As a reflexive verb, it conjugates with reflexive pronouns (me, te, se, nos, vos, se) before the verb. For example: eu encorajo-me, tu encorajas-te, ele/ela/você encoraja-se, nós encorajamo-nos, vós encorajais-vos, eles/elas/vocês encorajam-se."},"usage_notes":{"explanation":"\"Encorajar-se\" is used when someone is actively trying to boost their own morale or confidence. It's a process of self-encouragement. The reflexive pronoun is essential for conveying this meaning.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Eu encorajo.","correct":"Eu encorajo-me.","note":"When you want to express that you are encouraging yourself, you need to use the reflexive pronoun. \"Eu encorajo\" means \"I encourage (someone else).\""}],"priority":"N/A"},"related_words":{"derivatives":["encorajamento (encouragement)","coragem (courage)","encorajador (encouraging)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"N/A","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"\"Encorajar-se\" is a reflexive verb in Portuguese that means to encourage oneself. It is formed by adding the reflexive pronoun \"-se\" to the infinitive of the verb \"encorajar\" (to encourage). This verb is used when the subject of the sentence is both the one performing the action and the one receiving the action. For example, \"Ele precisava encorajar-se\" means \"He needed to encourage himself.\""},"example_sentences":[{"sentence":"É importante encorajar-se nos momentos difíceis.","translation":"It's important to encourage yourself in difficult moments.","type":"verb","meaning_category":"Encouragement"}]}