{"word":"aesthete","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"耽美主義者、審美家","english_definition":"a person who is devoted to beauty and the arts.","examples":[{"sentence":"He was known as an aesthete, always seeking out the most beautiful things in life.","translation":"彼は耽美主義者として知られており、常に人生で最も美しいものを探し求めていた。"},{"sentence":"The aesthete decorated his home with carefully chosen art and antiques.","translation":"その審美家は、注意深く選ばれた美術品や骨董品で家を飾った。"},{"sentence":"She dismissed the critic as a mere aesthete, out of touch with reality.","translation":"彼女は評論家を現実と隔絶した単なる耽美主義者だと切り捨てた。"}],"collocations":["artistic aesthete","literary aesthete","pure aesthete","self-proclaimed aesthete","aspiring aesthete"],"synonyms":["connoisseur","art lover","aficionado","epicure","dilettante"],"antonyms":["philistine","boor","barbarian"]}],"etymology":{"value":"Derived from the Greek word \"aisthētēs\" (αἰσθητής), meaning \"one who perceives,\" from \"aisthanesthai\" (αἰσθάνεσθαι), meaning \"to perceive, feel, sense.\" The term entered English in the late 19th century, reflecting the aesthetic movement.","priority":"★★★"},"pronunciation":{"ipa":"/ˈiːsθiːt/","syllables":"aes-thete"},"inflection":{"noun_plural":"aesthetes"},"usage_notes":{"explanation":"An \"aesthete\" is someone who has a deep appreciation for beauty, especially in art and nature. They often cultivate refined tastes and may be seen as overly concerned with aesthetic values. The term can sometimes carry a slightly negative connotation, suggesting someone who is detached from practical concerns or overly focused on superficial beauty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a aesthetic.","correct":"✓ He is an aesthete.","note":"\"Aesthetic\" is an adjective or a noun referring to the principles of beauty, while \"aesthete\" is a noun referring to a person who appreciates beauty. Use the correct form based on the intended meaning."},{"incorrect":"✗ She is very aesthete.","correct":"✓ She is very aesthetic.","note":"To describe something as beautiful or pleasing to the senses, use the adjective \"aesthetic.\" \"Aesthete\" refers to a person."}],"priority":"★★☆"},"related_words":{"derivatives":["aesthetic (adjective, noun)","aesthetical (adjective)","aesthetically (adverb)","aestheticism (noun)"],"phrases":["aesthetic movement"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but used in literary and artistic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"aesthete\" refers to a person who has a deep sensitivity to the beauty of art and nature. They are often very interested in aesthetics, which is the study of beauty and taste. This word is not commonly used in everyday conversation but appears in discussions about art, literature, and philosophy. It implies a refined and cultivated appreciation for beauty, sometimes to the point of seeming detached from more practical concerns."},"example_sentences":[{"sentence":"The young man aspired to be an aesthete, immersing himself in art and literature.","translation":"その若者は耽美主義者になることを志し、芸術と文学に没頭した。","type":"noun","meaning_category":"person"},{"sentence":"The critic described the artist as an aesthete, praising his attention to detail and form.","translation":"評論家は、その芸術家を耽美主義者と評し、彼の細部と形式へのこだわりを称賛した。","type":"noun","meaning_category":"person"},{"sentence":"Although some considered him a shallow aesthete, he genuinely appreciated beauty in all its forms.","translation":"彼を浅薄な耽美主義者と見なす人もいたが、彼はあらゆる形の美を心から鑑賞していた。","type":"noun","meaning_category":"person"}]}