{"word":"unsumptuousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"質素さ、簡素さ、華美でないこと","english_definition":"The quality or state of being unsumptuous; lacking luxury or extravagance; plainness.","examples":[{"sentence":"The unsumptuousness of the room reflected the owner's humble lifestyle.","translation":"その部屋の質素さは、所有者の質素な生活様式を反映していた。"},{"sentence":"Despite their wealth, they chose to live with unsumptuousness.","translation":"彼らは裕福であるにもかかわらず、質素な生活を選んだ。"}],"collocations":["a life of unsumptuousness","the unsumptuousness of the decor"],"synonyms":["simplicity","plainness","modesty","austerity","lack of luxury"],"antonyms":["sumptuousness","luxury","extravagance","opulence"]},{"part_of_speech":"noun","definition":"（特に装飾や外観における）地味さ、飾り気のなさ","english_definition":"Lack of showiness or ostentation, especially in decoration or appearance.","examples":[{"sentence":"The unsumptuousness of her dress was a deliberate choice, contrasting with the lavish party.","translation":"彼女のドレスの地味さは意図的な選択であり、豪華なパーティーとは対照的だった。"},{"sentence":"He appreciated the unsumptuousness of the building's design.","translation":"彼はその建物のデザインの飾り気のなさを評価した。"}],"collocations":["the unsumptuousness of the design","the unsumptuousness of the attire"],"synonyms":["understatement","lack of ostentation","unpretentiousness","simplicity"],"antonyms":["ostentation","showiness","pretentiousness"]}],"etymology":{"value":"Derived from \"un-\" (not) + \"sumptuousness\" (the state of being sumptuous). \"Sumptuous\" comes from Old French \"sumptueux,\" from Latin \"sumptuosus,\" meaning costly or extravagant.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsʌmptʃuəsnəs/","syllables":"un-sump-tu-ous-ness"},"inflection":{"noun_plural":"unsumptuousnesses (rarely used)"},"usage_notes":{"explanation":"\"Unsumptuousness\" is a relatively rare and formal word. It describes the absence of luxury, extravagance, or showiness. It is often used to describe a lifestyle, decor, or design that is simple and unadorned.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsumptuousness was very good.","correct":"✓ The unsumptuousness was admirable.","note":"\"Unsumptuousness\" itself is not inherently good or bad; it is a descriptive term. Use a different adjective to express a positive or negative judgment about it."},{"incorrect":"✗ He lived in unsumptuousness.","correct":"✓ He lived with unsumptuousness.","note":"Use the preposition \"with\" to indicate that someone lives in a state of unsumptuousness."}],"priority":"★☆☆"},"related_words":{"derivatives":["unsumptuous (adjective)"],"antonyms":["sumptuousness","luxury","opulence","extravagance"],"related_concepts":["simplicity","minimalism","austerity","modesty"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unsumptuousness\" is a formal and uncommon word that describes the absence of luxury, extravagance, or ostentation. It implies a deliberate choice to avoid showiness or excess. Due to its rarity, it is primarily encountered in formal writing or discussions about aesthetics, lifestyle, or social commentary. Understanding the root words \"un-\" (not) and \"sumptuous\" (rich, luxurious) helps in deciphering its meaning. It's more common to use simpler alternatives like \"simplicity,\" \"plainness,\" or \"lack of luxury.\""},"example_sentences":[{"sentence":"The monastery's unsumptuousness was a testament to the monks' devotion to a life of poverty.","translation":"その修道院の質素さは、修道士たちの貧困生活への献身の証だった。","type":"general","meaning_category":"質素さ"},{"sentence":"The artist deliberately emphasized the unsumptuousness of the setting to highlight the subject's inner beauty.","translation":"アーティストは、被写体の内面の美しさを際立たせるために、意図的に背景の地味さを強調した。","type":"art/design","meaning_category":"地味さ"},{"sentence":"Her unsumptuousness in dress and manner was a stark contrast to the other guests at the gala.","translation":"彼女の服装と態度の質素さは、ガラに出席した他のゲストとは対照的だった。","type":"lifestyle","meaning_category":"質素さ"}]}