{"word":"prewhip","priority":"低","meanings":[{"part_of_speech":"verb","definition":"(主にスターウォーズのファンコミュニティ内で使われるスラング) (キャラクターや関係性について)過剰に期待したり、過度に興奮したり、誇張したりすること。","english_definition":"(Primarily a slang term used within the Star Wars fan community) To excessively anticipate, overhype, or exaggerate the potential of a character or relationship.","examples":[{"sentence":"Some fans tend to prewhip certain characters before they even appear on screen.","translation":"一部のファンは、特定のキャラクターが画面に登場する前から、そのキャラクターに過剰な期待を寄せがちです。"},{"sentence":"Let's try not to prewhip this new series too much; we don't want to be disappointed if it doesn't live up to the hype.","translation":"この新しいシリーズにあまり過剰な期待をしないようにしましょう。期待外れだった場合にがっかりしたくありませんから。"}],"collocations":["prewhip a character (キャラクターに過剰な期待を寄せる)","prewhip a relationship (関係性に過剰な期待を寄せる)","avoid prewhipping (過剰な期待を避ける)"],"synonyms":["overhype","overestimate","over-anticipate","exaggerate","inflate"],"antonyms":["underestimate","downplay","be realistic","manage expectations"]}],"etymology":{"value":"「pre-」(前もって)と「whip」(スターウォーズのファンコミュニティで使われるスラングで、特定のキャラクターや関係性に対する熱狂的な支持や期待を意味する)の組み合わせ。","priority":"低"},"pronunciation":{"ipa":"/ˈpriːwɪp/","syllables":"pree-whip"},"inflection":{"verb_forms":{"present_simple":["prewhip","prewhips"],"past_simple":"prewhipped","past_participle":"prewhipped","present_participle":"prewhipping"}},"usage_notes":{"explanation":"「**prewhip**」は、主にスターウォーズのファンコミュニティで使用されるスラングで、映画やテレビシリーズに登場するキャラクターや関係性に対して、公開前から過剰な期待を抱いたり、過度に宣伝したりすることを指します。この言葉は、期待が大きくなりすぎると、作品が実際に公開された際に失望につながる可能性があるという懸念を表すために使われます。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef prewhipped the cream for the dessert.","correct":"✓ The chef whipped the cream for the dessert.","note":"「prewhip」は、食品を泡立てるという意味では使用されません。この場合は、単に「whip」を使用します。"},{"incorrect":"✗ The company prewhipped their new product with a lot of advertising.","correct":"✓ The company hyped their new product with a lot of advertising.","note":"「prewhip」は、スターウォーズのファンコミュニティに特有のスラングであり、一般的なマーケティングや広告の文脈では「hype」などのより一般的な単語を使用します。"}],"priority":"低"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["whip (スターウォーズのファンコミュニティにおける熱狂的な支持や期待)","hype","overhype","fandom","fanbase"],"priority":"低"},"level_frequency":{"CEFR":"N/A (スラング、一般的ではない)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特定のコミュニティ内でのみ使用されるスラング。","priority":"低"},"readability_explanation":{"level":"C2","text":"「**prewhip**」は、スターウォーズのファンコミュニティで使われるスラングで、映画やドラマのキャラクターや関係性に対して、公開前から過剰な期待を抱いたり、過度に宣伝したりすることを意味します。この言葉は、期待が大きくなりすぎると、作品が実際に公開された際に失望につながる可能性があるという懸念を表すために使われます。一般的な単語ではないため、特定のコミュニティ以外では理解されない可能性があります。"},"example_sentences":[{"sentence":"The marketing team is trying to prewhip the audience for the new Star Wars movie.","translation":"マーケティングチームは、新しいスターウォーズ映画に向けて、観客に過剰な期待を抱かせようとしています。","type":"verb","meaning_category":"過剰な期待を抱かせる"},{"sentence":"I'm excited about the new series, but I'm trying not to prewhip it too much.","translation":"新しいシリーズにワクワクしていますが、過剰な期待をしないようにしています。","type":"verb","meaning_category":"過剰な期待を寄せる"},{"sentence":"The prewhipping of that character led to disappointment when they didn't live up to the hype.","translation":"そのキャラクターへの過剰な期待は、期待に応えられなかったときに失望につながりました。","type":"noun (gerund)","meaning_category":"過剰な期待を寄せること"}]}