{"word":"lexiphanes","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大言壮語家、衒学者、難解な言葉を使う人","english_definition":"A person who uses pretentious, obscure, or overly technical language; a pompous speaker or writer.","examples":[{"sentence":"The professor was accused of being a lexiphanes, as his lectures were filled with unnecessarily complex vocabulary.","translation":"その教授は、講義が不必要に複雑な語彙で満たされていたため、大言壮語家だと非難された。"},{"sentence":"Avoid being a lexiphanes in your writing; clarity is more important than showing off your vocabulary.","translation":"文章を書く際には、衒学者にならないようにしましょう。語彙をひけらかすよりも、明瞭さが重要です。"}],"collocations":["affected language","pompous speech","obscure vocabulary","pretentious writer"],"synonyms":["bombast","grandiloquence","sesquipedalianism","verbiage","rhetorician (pejorative)"],"antonyms":["plain speaker","clear writer","simple language","directness"]}],"etymology":{"value":"Derived from the name Lexiphanes, a character in Lucian's dialogue 'The Lexiphanes,' who was ridiculed for his affected and pretentious use of language. The name itself is likely a combination of 'lexis' (word, speech) and 'phainein' (to show, appear).","priority":"★★☆"},"pronunciation":{"ipa":"/lɛkˈsɪfəˌniːz/","syllables":"lex-i-pha-nes"},"inflection":{"noun_plural":"lexiphaneses"},"usage_notes":{"explanation":"The term 'lexiphanes' is primarily used to describe someone who uses language to impress or confuse rather than to communicate effectively. It often carries a negative connotation, suggesting that the person is more interested in showing off their knowledge than in being understood. The word is relatively rare in modern usage but can be found in literary or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a lexiphanes because he knew a lot of words.","correct":"✓ He was a lexiphanes because he used overly complicated words to sound intelligent.","note":"Knowing many words is not enough to be a lexiphanes; it's the pretentious and unnecessary use of complex language that defines the term."}],"priority":"★☆☆"},"related_words":{"derivatives":["lexiphanic (adjective: relating to or characteristic of a lexiphanes)","lexiphanism (noun: the practice of using pretentious language)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Very rare, primarily literary or academic contexts)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lexiphanes' is a highly specialized and uncommon word used to describe someone who uses language in a pretentious or overly complicated way, often to show off their knowledge rather than to communicate clearly. It is derived from a character in a Lucian dialogue. Due to its rarity and specific meaning, it is unlikely to be encountered outside of advanced literary or linguistic contexts."},"example_sentences":[{"sentence":"The critic described the author's style as lexiphanic, noting the excessive use of obscure terminology.","translation":"評論家は、その作家の文体を衒学的だと評し、難解な専門用語の過剰な使用を指摘した。","type":"general","meaning_category":"pretentious language"},{"sentence":"He was a true lexiphanes, deliberately using long and complicated words to impress his audience.","translation":"彼は真の大言壮語家であり、聴衆を感心させるために意図的に長く複雑な言葉を使った。","type":"general","meaning_category":"pretentious language"}]}