{"word":"herbous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"草のような、草本の、草の性質を持つ","english_definition":"Resembling or pertaining to herbs; having the characteristics of an herb.","examples":[{"sentence":"The wine had a distinctly herbous aroma.","translation":"そのワインは明らかに草のような香りを持っていた。"},{"sentence":"The plant's herbous stem was easily broken.","translation":"その植物の草のような茎は簡単に折れた。"},{"sentence":"The herbous notes in the dish complemented the meat perfectly.","translation":"その料理の草のような風味が肉と完璧に調和していた。"}],"collocations":["herbous aroma","herbous flavor","herbous scent","herbous plant","herbous stem"],"synonyms":["grassy","verdant","green","leafy","vegetal"],"antonyms":["woody","floral","fruity","spicy"]}],"etymology":{"value":"From Latin 'herba' (grass, herb) + '-ous' (suffix indicating possessing, full of, resembling).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɜːrbəs/","syllables":"her-bous"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more herbous' and 'most herbous', respectively, though less common than using 'more/most herbal' or rephrasing."},"usage_notes":{"explanation":"'Herbous' is often used to describe flavors, aromas, or textures that are reminiscent of fresh herbs or green plants. It is commonly used in the context of wine tasting, cooking, and botany. It is less common than the word 'herbal', but it provides a more specific description, emphasizing the grassy or plant-like qualities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The soup tasted very herbalous.","correct":"✓ The soup tasted very herbous. / ✓ The soup tasted very herbal.","note":"'Herbous' is the correct adjective form. 'Herbalous' is not a standard word."},{"incorrect":"✗ The herbous are growing in the garden.","correct":"✓ The herbs are growing in the garden.","note":"'Herbous' is an adjective and cannot be used as a noun. 'Herbs' is the correct plural noun to refer to multiple herb plants."}],"priority":"★★☆"},"related_words":{"derivatives":["herb (noun): A plant used for flavoring, food, medicine, or fragrance.","herbal (adjective): Relating to or made from herbs.","herbicide (noun): A substance used to kill unwanted plants.","herbivore (noun): An animal that feeds on plants."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Herbous' is a relatively uncommon adjective used to describe something that has the characteristics of herbs, particularly in terms of aroma, flavor, or texture. It's often used in specialized contexts like wine tasting or botany. Understanding the word requires familiarity with the word 'herb' and the suffix '-ous', which indicates resemblance or possession of a quality."},"example_sentences":[{"sentence":"The cheese had a slightly herbous flavor that I found very appealing.","translation":"そのチーズはわずかに草のような風味があり、とても魅力的だった。","type":"adjective","meaning_category":"草のような風味"},{"sentence":"The herbous scent of the garden filled the air.","translation":"庭の草のような香りが空気を満たした。","type":"adjective","meaning_category":"草のような香り"},{"sentence":"The chef added some herbous oil to the salad.","translation":"シェフはサラダに草のようなオイルを加えた。","type":"adjective","meaning_category":"草のようなオイル"}]}