{"word":"Spatulation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(薬学) スパチュラを用いて軟膏やクリームなどの半固形製剤を混合・練合する操作","english_definition":"The act of combining materials, especially pharmaceutical ingredients, into a homogeneous mixture by use of a spatula.","examples":[{"sentence":"Spatulation is a common technique used in compounding pharmacies.","translation":"スパチュレーションは、調剤薬局で一般的に使用される技術です。"},{"sentence":"The pharmacist used spatulation to ensure the ointment was uniformly mixed.","translation":"薬剤師はスパチュレーションを用いて、軟膏が均一に混合されていることを確認しました。"}],"collocations":["pharmaceutical spatulation","ointment spatulation","cream spatulation","compounding spatulation"],"synonyms":["mixing","compounding","trituration"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'spatula,' referring to the instrument used in the process, combined with the suffix '-ation,' indicating an action or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspætʃəˈleɪʃən/","syllables":"spat-u-la-tion"},"inflection":{"noun_plural":"spatulations"},"usage_notes":{"explanation":"Spatulation is primarily used in pharmaceutical compounding to create customized medications. This technique ensures that active ingredients are evenly distributed throughout the base, resulting in a consistent and effective product. It is particularly useful for ointments, creams, and pastes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spatulation was done by hand mixer.","correct":"✓ The spatulation was done using a spatula.","note":"Spatulation specifically refers to mixing with a spatula, not other tools like hand mixers."}],"priority":"★★☆"},"related_words":{"derivatives":["spatulate (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spatulation' refers to a specific mixing technique used in pharmacy, involving the use of a spatula to combine ingredients into a smooth, uniform mixture. It's a technical term primarily encountered in pharmaceutical or compounding contexts."},"example_sentences":[{"sentence":"The preparation of the cream involved careful spatulation of the active ingredient into the base.","translation":"クリームの調製には、有効成分をベースに丁寧にスパチュレーションすることが含まれていました。","type":"noun","meaning_category":"pharmaceutical compounding"},{"sentence":"Proper spatulation ensures the even distribution of medication within the ointment.","translation":"適切なスパチュレーションは、軟膏内の薬物の均一な分布を保証します。","type":"noun","meaning_category":"pharmaceutical compounding"}]}