{"word":"pumice","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"軽石","english_definition":"a very light and porous volcanic rock formed when a gas-rich froth of glassy lava solidifies rapidly.","examples":[{"sentence":"Pumice is often used in beauty products as an exfoliant.","translation":"軽石は、角質除去剤として美容製品によく使用されます。"},{"sentence":"The shores of the island were covered in pumice after the volcanic eruption.","translation":"その島の海岸は、火山噴火後、軽石で覆われていた。"},{"sentence":"Pumice is so light that it can float on water.","translation":"軽石は非常に軽いので、水に浮くことができます。"}],"collocations":["pumice stone","pumice powder","volcanic pumice","float on pumice"],"synonyms":["scoria","volcanic rock","lava rock"],"antonyms":[]}],"etymology":{"value":"The word \"pumice\" comes from the Latin word \"pumex,\" which originally meant \"foam.\" This refers to the foamy texture of the rock.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌmɪs/","syllables":"pum-ice"},"inflection":{"noun_plural":"pumices"},"usage_notes":{"explanation":"Pumice is a type of extrusive volcanic rock, produced when lava with a very high content of water and gases is discharged from a volcano. As the gas exits, it creates bubbles, resulting in a very porous, low-density material. It's commonly used as an abrasive in polishes, erasers, and cosmetic exfoliants.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a pumice to clean the sink.","correct":"✓ I used pumice to clean the sink.","note":"Pumice is an uncountable noun when referring to the substance in general. Use 'a piece of pumice' if referring to a specific piece."}],"priority":"★★☆"},"related_words":{"derivatives":["pumiceous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pumice\" refers to a specific type of volcanic rock characterized by its light weight and porous texture. It forms during explosive volcanic eruptions when gas-rich lava cools rapidly, trapping bubbles within the rock. Due to its abrasive properties, pumice finds applications in various industries, including cosmetics (as an exfoliant), construction (as a lightweight aggregate), and manufacturing (for polishing). Its unique composition and formation process make it a subject of interest in geology and materials science."},"example_sentences":[{"sentence":"The gardener used **pumice** to improve the drainage of the soil.","translation":"庭師は土壌の排水性を改善するために軽石を使用しました。","type":"noun","meaning_category":"material"},{"sentence":"She rubbed her heels with a **pumice stone** to remove dead skin.","translation":"彼女は死んだ皮膚を取り除くために軽石でかかとをこすりました。","type":"noun","meaning_category":"tool"},{"sentence":"The eruption resulted in a large deposit of **pumice** on the nearby slopes.","translation":"噴火により、近くの斜面に大量の軽石が堆積しました。","type":"noun","meaning_category":"geological formation"}]}