{"word":"supplementarity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"補完性、相補性","english_definition":"The condition of being supplementary; the quality of supplementing or being supplemented.","examples":[{"sentence":"The principle of supplementarity ensures that decisions are taken at the closest possible level to the citizen.","translation":"補完性の原則は、決定が市民に可能な限り近いレベルで行われることを保証します。"},{"sentence":"The supplementarity between the two approaches strengthens the overall analysis.","translation":"2つのアプローチ間の相補性が、全体的な分析を強化します。"}],"collocations":["principle of supplementarity","ensure supplementarity","strengthen supplementarity"],"synonyms":["complementarity","additionality","completeness"],"antonyms":["exclusivity","independence","separation"]}],"etymology":{"value":"Derived from the word 'supplementary', which comes from the Latin 'supplementarius', meaning 'serving to supply what is lacking'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌplɪmɛnˈtærɪti/","syllables":"sup-ple-men-tar-i-ty"},"inflection":{"noun_plural":"supplementarities"},"usage_notes":{"explanation":"'Supplementarity' refers to the state or quality of providing something extra to complete or enhance something else. It is often used in political science, economics, and international relations to describe a principle where a higher authority only performs tasks that cannot be effectively performed at a lower level. It emphasizes the importance of local or regional control while acknowledging the need for overarching support or intervention when necessary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supplementarity is important for the project.","correct":"✓ Supplementarity is important for the project.","note":"The word 'supplementarity' is a noun and does not require the article 'the' unless referring to a specific instance of supplementarity."}],"priority":"★☆☆"},"related_words":{"derivatives":["supplement (noun, verb)","supplementary (adjective)","supplemental (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'supplementarity' is a complex concept often used in academic and professional contexts, particularly in fields like political science and economics. It describes the idea that a higher level of authority should only take action if a lower level cannot effectively handle a task. Understanding this term requires familiarity with abstract concepts and formal language, making it more suitable for advanced learners."},"example_sentences":[{"sentence":"The EU operates on the principle of supplementarity, intervening only when member states cannot adequately address an issue.","translation":"EUは補完性の原則に基づいて運営されており、加盟国が問題を適切に処理できない場合にのみ介入します。","type":"general","meaning_category":"principle"},{"sentence":"There is a clear supplementarity between the roles of the national and local governments in providing social services.","translation":"社会サービスの提供において、国と地方自治体の役割の間には明確な相補性があります。","type":"general","meaning_category":"roles"}]}