{"word":"Schoolmasterishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"先生ぶること、教師のような態度、説教臭さ","english_definition":"The quality or state of being schoolmasterish; a tendency to act like a strict or pedantic schoolmaster, often involving lecturing or correcting others in a condescending manner.","examples":[{"sentence":"His schoolmasterishness made him unpopular with his colleagues.","translation":"彼の先生ぶった態度が、同僚からの反感を買った。"},{"sentence":"She disliked the schoolmasterishness of his lectures.","translation":"彼女は彼の講義の説教臭さが嫌いだった。"},{"sentence":"The article was marred by a tone of schoolmasterishness.","translation":"その記事は、先生ぶった口調によって損なわれていた。"}],"collocations":["display schoolmasterishness (先生ぶった態度を示す)","avoid schoolmasterishness (先生ぶった態度を避ける)","tone of schoolmasterishness (先生ぶった口調)"],"synonyms":["pedantry","didacticism","preachiness","dogmatism","condescension","patronizing attitude"],"antonyms":["humility","modesty","open-mindedness","teachableness"]},{"part_of_speech":"noun","definition":"先生気質、教師のような厳格さや几帳面さ","english_definition":"The characteristics associated with a schoolmaster, such as strictness, formality, and a focus on rules and correctness.","examples":[{"sentence":"The schoolmasterishness of the headmaster created a rigid environment.","translation":"校長の先生気質が、厳格な環境を作り出した。"},{"sentence":"He admired the schoolmasterishness with which she approached her work.","translation":"彼は彼女が仕事に取り組む際の先生気質のような厳格さに感心した。"}],"collocations":["strict schoolmasterishness (厳格な先生気質)","formal schoolmasterishness (形式的な先生気質)"],"synonyms":["strictness","formality","rigidity","discipline","orderliness"],"antonyms":["laxity","informality","flexibility","disorderliness"]}],"etymology":{"value":"Derived from \"schoolmaster\" (a male teacher) + \"-ish\" (having the characteristics of) + \"-ness\" (state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskuːlˈmæstərɪʃnəs/","syllables":"school-mas-ter-ish-ness"},"inflection":{"notes":"This is a noun, so it does not inflect for tense or number (though it is uncountable)."},"usage_notes":{"explanation":"\"Schoolmasterishness\" is a somewhat uncommon word used to describe someone who acts like a stereotypical schoolmaster, often in a negative way. It implies a tendency to lecture, correct, and generally behave in a condescending or overly strict manner. It can also refer to the qualities associated with a schoolmaster, such as formality and a focus on rules. The word often carries a negative connotation, suggesting that the person is being overly pedantic or authoritarian.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of schoolmasterish.","correct":"✓ He showed a lot of schoolmasterishness.","note":"\"Schoolmasterish\" is an adjective, while \"schoolmasterishness\" is the noun form. You need the noun form to describe the quality or state. "},{"incorrect":"✗ The schoolmasterishness was very happy.","correct":"✓ The schoolmasterishness was very annoying.","note":"\"Schoolmasterishness\" describes a negative trait, so it's usually associated with negative emotions or experiences."}],"priority":"★☆☆"},"related_words":{"derivatives":["schoolmaster (noun: a male teacher, especially in a private school)","schoolmasterly (adjective: resembling or befitting a schoolmaster)","schoolmarm (noun: a female teacher, especially in a rural school - often used with negative connotations)","schoolmarmish (adjective: resembling or befitting a schoolmarm - often used with negative connotations)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Schoolmasterishness\" is a complex word that combines the idea of a \"schoolmaster\" (a teacher, especially a male teacher in a private school) with the suffixes \"-ish\" (meaning 'having the characteristics of') and \"-ness\" (turning it into a noun representing a quality or state). Therefore, it describes the quality of acting like a stereotypical schoolmaster, often in a negative way. This can involve being overly strict, pedantic, or condescending. Because it's a relatively rare and nuanced word, it's more likely to be encountered in advanced texts or discussions about social behavior."},"example_sentences":[{"sentence":"The professor's **schoolmasterishness** alienated many of his students.","translation":"その教授の先生ぶった態度が、多くの学生を遠ざけた。","type":"noun","meaning_category":"先生ぶること"},{"sentence":"She tried to avoid any hint of **schoolmasterishness** when giving feedback.","translation":"彼女はフィードバックをする際に、先生ぶった態度にならないように努めた。","type":"noun","meaning_category":"先生ぶること"},{"sentence":"His **schoolmasterishness** was evident in his constant correcting of others' grammar.","translation":"彼の先生ぶった態度は、他人の文法を常に訂正することに明らかだった。","type":"noun","meaning_category":"先生ぶること"}]}