{"word":"Mythopoesy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"神話創作、神話形成","english_definition":"A genre of narrative in which new, original myths are created or existing myths are substantially revised or expanded.","examples":[{"sentence":"Tolkien's 'The Lord of the Rings' is a prime example of mythopoesy.","translation":"トールキンの『指輪物語』は神話創作の代表的な例です。"},{"sentence":"Mythopoesy often explores themes of good versus evil, creation, and the nature of humanity.","translation":"神話創作はしばしば善と悪、創造、そして人間性の本質といったテーマを探求します。"}],"collocations":["create mythopoesy","engage in mythopoesy","Tolkienian mythopoesy"],"synonyms":["myth-making","legendarium","fantasy world-building"],"antonyms":["deconstruction","realism","naturalism"]}],"etymology":{"value":"The word \"mythopoesy\" is derived from the Greek words \"mythos\" (μῦθος), meaning \"myth\" or \"story,\" and \"poiesis\" (ποίησις), meaning \"making\" or \"poetry.\" Thus, mythopoesy literally means \"myth-making.\" The term was popularized by J.R.R. Tolkien.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪθəˈpoʊəsi/","syllables":"my-tho-po-e-sy"},"inflection":{"noun_plural":"mythopoesies"},"usage_notes":{"explanation":"Mythopoesy is a literary genre and creative process where authors construct new mythologies or significantly rework existing ones. It is characterized by the creation of secondary worlds with their own histories, languages, and cosmologies. J.R.R. Tolkien and C.S. Lewis are prominent figures associated with this genre. It is distinct from simply retelling myths; mythopoesy involves original creation or substantial alteration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a mythopoesy book.","correct":"✓ He wrote a mythopoeic book.","note":"'Mythopoesy' is a noun. The adjective form is 'mythopoeic'."},{"incorrect":"✗ Mythopoesy is the study of myths.","correct":"✓ Mythopoesy is the creation of myths.","note":"Mythopoesy is the *creation* of myths, not the study of them. The study of myths is mythology."}],"priority":"★★☆"},"related_words":{"derivatives":["mythopoeic (adjective): relating to mythopoesy","mythopoeist (noun): a creator of mythopoesy"],"phrasal_verbs":[],"related_genres":["fantasy","science fiction","legend","folklore"],"related_terms":["legendarium","worldbuilding","cosmology","secondary world"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Mythopoesy\" is a complex term referring to the creation of new myths or the substantial reworking of existing ones, often involving the construction of entire fictional worlds with their own histories and cultures. It is a term primarily used in literary criticism and discussions of fantasy literature. Understanding this term requires familiarity with literary theory and the works of authors like Tolkien and Lewis.","example_sentences":[{"sentence":"His novel is a work of intricate mythopoesy, creating a rich and detailed world.","translation":"彼の小説は複雑な神話創作の作品であり、豊かで詳細な世界を創造しています。","type":"general"},{"sentence":"The author's mythopoesy draws heavily on Celtic and Norse mythology.","translation":"その作者の神話創作はケルトと北欧の神話に大きく影響を受けています。","type":"specific"},{"sentence":"Mythopoesy allows writers to explore fundamental questions about humanity and the universe.","translation":"神話創作は作家が人間と宇宙に関する根本的な疑問を探求することを可能にします。","type":"theoretical"}]}}