{"word":"hedonists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"快楽主義者 (複数形)","english_definition":"plural form of hedonist: people who believe that the pursuit of pleasure and sensual self-indulgence are the highest good.","examples":[{"sentence":"The party was full of hedonists, indulging in every imaginable pleasure.","translation":"パーティーは快楽主義者でいっぱいであり、想像できるあらゆる快楽にふけっていた。"},{"sentence":"Some critics described the wealthy elite as hedonists, detached from the struggles of ordinary people.","translation":"一部の批評家は、富裕層を、一般の人々の苦労からかけ離れた快楽主義者だと評した。"}],"collocations":["a group of hedonists","self-proclaimed hedonists","wealthy hedonists","intellectual hedonists"],"synonyms":["pleasure-seekers","sensualists","epicureans","debauchees","sybarites"],"antonyms":["ascetics","stoics","puritans"]}],"etymology":{"value":"The word 'hedonist' comes from the Greek word 'hēdonē', meaning 'pleasure'. The suffix '-ist' denotes a person who adheres to a particular belief or philosophy.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhiːdənɪsts","syllables":"hee-do-nists"},"inflection":{"noun_plural":"hedonists"},"usage_notes":{"explanation":"'Hedonists' refers to a group or collection of individuals who prioritize pleasure above all else. The term often carries a negative connotation, implying excessive indulgence and a lack of concern for moral or social responsibilities. However, some philosophical schools of thought embrace a more moderate form of hedonism, arguing that pleasure is a natural and healthy goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of hedonists.","correct":"✓ He is one of the hedonists. / ✓ He is a hedonist.","note":"When referring to a single person, use the singular form 'hedonist'. When referring to a group, use the plural form 'hedonists'."},{"incorrect":"✗ They lived hedonist lives.","correct":"✓ They lived hedonistic lives.","note":"'Hedonist' is a noun. To describe their lives, use the adjective 'hedonistic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["hedonism (noun: the pursuit of pleasure as the highest good)","hedonistic (adjective: characterized by the pursuit of pleasure)","hedonistically (adverb: in a hedonistic manner)"],"phrases":["hedonistic lifestyle","hedonistic tendencies"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hedonists' refers to people who believe that seeking pleasure and avoiding pain is the most important thing in life. It's often used in discussions about ethics, philosophy, and lifestyles. The word can have a negative connotation, suggesting that these people are selfish or irresponsible. It's not a common word in everyday conversation, but it's important to understand its meaning in academic or philosophical contexts."},"example_sentences":[{"sentence":"The ancient Romans were often portrayed as hedonists, indulging in lavish feasts and entertainment.","translation":"古代ローマ人は、贅沢な宴会や娯楽にふける快楽主義者として描かれることが多かった。","type":"noun","meaning_category":"快楽主義者"},{"sentence":"The group of hedonists spent their days lounging by the pool, sipping cocktails, and enjoying the sunshine.","translation":"その快楽主義者のグループは、プールサイドでくつろぎ、カクテルを飲み、日光浴をして日々を過ごした。","type":"noun","meaning_category":"快楽主義者"},{"sentence":"Critics accused the reality TV stars of being hedonists, promoting a shallow and materialistic lifestyle.","translation":"批評家たちは、リアリティ番組のスターたちを、浅薄で物質主義的なライフスタイルを推進する快楽主義者だと非難した。","type":"noun","meaning_category":"快楽主義者"}]}