{"word":"collinearly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"共線的に、一直線上に","english_definition":"in a collinear manner; in a way that points or objects lie on the same straight line.","examples":[{"sentence":"The three points are arranged collinearly.","translation":"その3点は共線的に配置されている。"},{"sentence":"We need to align the data points collinearly for accurate analysis.","translation":"正確な分析のために、データ点を共線的に整列させる必要がある。"}],"collocations":["arranged collinearly","aligned collinearly","positioned collinearly"],"synonyms":["linearly","in a straight line","on the same line"],"antonyms":["non-collinearly","not in a straight line"]}],"etymology":{"value":"The word 'collinearly' is derived from 'collinear', which comes from the prefix 'co-' (meaning 'together' or 'with') and 'linear' (meaning 'relating to a line'). The adverbial form is created by adding '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒlɪˈnɪərli/","syllables":"col-lin-e-ar-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Collinearly' describes the arrangement of points or objects that lie on the same straight line. It's primarily used in mathematics, geometry, and related fields to specify the spatial relationship between points. It emphasizes that the points are not scattered or randomly positioned but are precisely aligned along a single line.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vectors are collinearly, so they are parallel.","correct":"✓ The vectors are collinear, so they are parallel.","note":"'Collinear' is the adjective, and 'collinearly' is the adverb. Use the adjective to describe the state of being on the same line."},{"incorrect":"✗ The points are collinearly to each other.","correct":"✓ The points are arranged collinearly.","note":"'Collinearly' describes how something is arranged or aligned, not a direct relationship 'to' something else."}],"priority":"★★☆"},"related_words":{"derivatives":["collinear (adjective)","collinearity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Collinearly' is an advanced term primarily used in mathematics and geometry. It describes how points or objects are arranged when they lie on the same straight line. Understanding this word requires familiarity with geometric concepts. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The stars in the constellation appear collinearly from our perspective on Earth.","translation":"その星座の星は、地球からの視点では一直線上に並んで見える。","type":"adverb","meaning_category":"共線的に"},{"sentence":"The surveyor positioned the markers collinearly to ensure a straight boundary line.","translation":"測量技師は、境界線を直線にするために、標識を一直線上に配置した。","type":"adverb","meaning_category":"共線的に"}]}