{"word":"Chattertonian","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"(文学・芸術において)早熟の才能を持ちながら、若くして悲劇的な死を迎えた人物、特にトーマス・チャタートン（Thomas Chatterton）に似た、あるいは彼に影響を受けた","english_definition":"Resembling or characteristic of Thomas Chatterton, especially in being precociously talented but meeting a tragic early death; influenced by or reminiscent of the life and works of Thomas Chatterton.","examples":[{"sentence":"The poet's early promise and subsequent suicide gave him a Chattertonian aura.","translation":"その詩人の早熟な才能と後の自殺は、彼にチャタートンのような雰囲気を与えた。"},{"sentence":"Critics noted the Chattertonian themes of youthful genius and despair in his novel.","translation":"批評家たちは、彼の小説の中に、若き天才と絶望というチャタートン的なテーマが見られると指摘した。"}],"collocations":["Chattertonian genius (チャタートン的な天才)","Chattertonian tragedy (チャタートン的な悲劇)","Chattertonian figure (チャタートン的な人物)","Chattertonian poem (チャタートン的な詩)"],"synonyms":["precocious","tragic","doomed","romantic","Byronic"],"antonyms":["long-lived","successful","conventional"]},{"part_of_speech":"noun","definition":"トーマス・チャタートンのような早熟で悲劇的な運命をたどった人物","english_definition":"A person resembling Thomas Chatterton in being precocious and meeting a tragic fate.","examples":[{"sentence":"He became a Chattertonian figure in the art world, admired for his talent but ultimately self-destructive.","translation":"彼は美術界においてチャタートンのような人物となり、その才能は賞賛されたが、最終的には自己破壊的になった。"}],"collocations":[],"synonyms":["prodigy","genius","martyr"],"antonyms":[]}],"etymology":{"value":"Thomas Chatterton (1752-1770), an English poet who committed suicide at the age of 17, + -ian.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtʃætərˈtoʊniən/","syllables":"Chat-ter-to-ni-an"},"inflection":{"notes":"Adjective and noun forms exist."},"usage_notes":{"explanation":"The term \"Chattertonian\" is primarily used in literary and artistic contexts to describe individuals or works that evoke the themes of youthful genius, early promise, and tragic demise, reminiscent of the life and works of Thomas Chatterton. It often carries a sense of romanticism and doomed fate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Chatterton.","correct":"✓ He was a Chattertonian figure. / ✓ He had a Chattertonian quality.","note":"While \"Chattertonian\" can be used as a noun, it's more common to use it as an adjective to describe someone or something that resembles Chatterton. Using it as a direct substitute for \"Chatterton\" might be confusing."}],"priority":"★☆☆"},"related_words":{"derivatives":["Chatterton (proper noun)"],"related_terms":["Romanticism","Gothic literature","Byronic hero"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"非常に低い (Very low)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Chattertonian\" is a relatively rare and specialized term primarily used in literary analysis and art criticism. Understanding its meaning requires familiarity with the life and works of Thomas Chatterton and the themes of Romanticism and tragic genius. It is unlikely to be encountered in everyday conversation. "},"example_sentences":[{"sentence":"The novel's protagonist, a young artist consumed by his own brilliance, embodies a **Chattertonian** spirit.","translation":"その小説の主人公は、自身の才能に溺れた若い芸術家であり、チャタートン的な精神を体現している。","type":"adjective","meaning_category":"早熟の才能と悲劇的な死"},{"sentence":"His short life and intense creativity made him a **Chattertonian** figure, forever romanticized in literary history.","translation":"彼の短い生涯と強烈な創造性は、彼をチャタートンのような人物にし、文学史の中で永遠にロマンチックに語り継がれる。","type":"noun","meaning_category":"早熟で悲劇的な運命をたどった人物"}]}