{"word":"bodymaking","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"肉体改造、身体作り、ボディメイキング","english_definition":"The process of improving one's physical appearance through exercise, diet, and lifestyle changes.","examples":[{"sentence":"He's really into bodymaking these days, hitting the gym every day.","translation":"彼は最近ボディメイキングに夢中で、毎日ジムに通っています。"},{"sentence":"Bodymaking is not just about building muscle, it's also about improving overall health.","translation":"ボディメイキングは単に筋肉をつけるだけでなく、全体的な健康を改善することでもあります。"},{"sentence":"She achieved her ideal physique through consistent bodymaking efforts.","translation":"彼女は一貫したボディメイキングの努力によって理想的な体型を実現しました。"}],"collocations":["bodymaking diet (ボディメイキングのための食事)","bodymaking program (ボディメイキングのプログラム)","bodymaking supplements (ボディメイキングのサプリメント)","consistent bodymaking (継続的なボディメイキング)","intense bodymaking (集中的なボディメイキング)"],"synonyms":["bodybuilding","fitness training","muscle building","physical conditioning","strength training"],"antonyms":["None (generally doesn't have a direct antonym in this context)"]}],"etymology":{"value":"A compound word formed from 'body' and 'making,' indicating the act of 'making' or shaping the 'body.' It's a relatively modern term, gaining popularity with the rise of fitness culture.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒdiˌmeɪkɪŋ/","syllables":"bod-y-mak-ing"},"inflection":{"noun_plural":"bodymakings (rarely used)"},"usage_notes":{"explanation":"'Bodymaking' typically refers to a holistic approach to physical improvement, encompassing not only muscle development but also elements of diet, lifestyle, and overall well-being. It's often used in the context of achieving a specific aesthetic goal or improving physical fitness. While similar to 'bodybuilding,' 'bodymaking' can sometimes imply a broader focus beyond just muscle mass.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm doing bodymaking for lose weight.","correct":"✓ I'm doing bodymaking to lose weight.","note":"Use 'to lose weight' to express the purpose of bodymaking."},{"incorrect":"✗ Bodymaking is good for only muscles.","correct":"✓ Bodymaking is not only good for muscles, but also for overall health.","note":"Bodymaking involves more than just muscle development; it also affects overall health."}],"priority":"★★☆"},"related_words":{"derivatives":["bodybuilder","bodybuilding","fitness","muscle","diet","exercise"],"phrasal_verbs":["None (not typically used in phrasal verbs)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (relatively specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing with fitness culture.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bodymaking' is a term used to describe the process of improving one's physical appearance through exercise, diet, and lifestyle changes. It involves a comprehensive approach to fitness, often with the goal of achieving a specific aesthetic or health outcome. The term is more specialized than general fitness vocabulary and is commonly used in fitness communities and related media.","translation":"「ボディメイキング」とは、運動、食事、ライフスタイルの変化を通じて、自分の外見を改善するプロセスを指す言葉です。特定の美的目標や健康上の成果を達成することを目的とした、包括的なフィットネスへのアプローチを伴います。この用語は、一般的なフィットネス語彙よりも専門的であり、フィットネスコミュニティや関連メディアで一般的に使用されます。"},"example_sentences":[{"sentence":"Her dedication to bodymaking transformed her physique.","translation":"彼女のボディメイキングへの献身は彼女の体格を変えました。","type":"general","meaning_category":"physical transformation"},{"sentence":"Proper nutrition is essential for effective bodymaking.","translation":"適切な栄養は効果的なボディメイキングに不可欠です。","type":"general","meaning_category":"nutrition"},{"sentence":"The bodymaking program included both weightlifting and cardio exercises.","translation":"そのボディメイキングプログラムには、ウェイトリフティングと有酸素運動の両方が含まれていました。","type":"general","meaning_category":"exercise program"}]}