{"word":"copyrightable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"著作権で保護できる、著作権の対象となる","english_definition":"Eligible for copyright protection.","examples":[{"sentence":"The work must be original and creative to be copyrightable.","translation":"その作品は、著作権の対象となるためには、独創的で創造的でなければならない。"},{"sentence":"Not all content on the internet is copyrightable.","translation":"インターネット上のすべてのコンテンツが著作権で保護できるわけではない。"},{"sentence":"The software code is copyrightable, protecting it from unauthorized duplication.","translation":"そのソフトウェアコードは著作権で保護されており、不正な複製から保護されている。"}],"collocations":["copyrightable material","copyrightable work","copyrightable content","be copyrightable","become copyrightable","deem copyrightable"],"synonyms":["protectable by copyright","eligible for copyright","subject to copyright","copyright protected","copyright secured"],"antonyms":["uncopyrightable","public domain","unprotected","free to use","royalty-free"]},{"part_of_speech":"adjective","definition":"著作権を取得できる","english_definition":"Capable of being copyrighted.","examples":[{"sentence":"A simple list of facts is generally not considered copyrightable.","translation":"事実の単純なリストは、一般的に著作権を取得できるとは見なされない。"},{"sentence":"The design of the logo was deemed copyrightable by the court.","translation":"そのロゴのデザインは、裁判所によって著作権を取得できると判断された。"}],"collocations":["deem copyrightable","consider copyrightable","find copyrightable","determine copyrightable","prove copyrightable","establish copyrightable"],"synonyms":["patentable","trademarkable","legally protected","proprietary","exclusive"],"antonyms":["generic","nonexclusive","unrestricted","open-source","common property"]}],"etymology":{"value":"The word \"copyrightable\" is formed by combining the word \"copyright\" with the suffix \"-able,\" indicating the capability or eligibility of being copyrighted.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒpiˌraɪtəbəl/","syllables":"cop-y-right-a-ble"},"inflection":{"notes":"This word is an adjective and does not have different inflections besides comparative and superlative forms, though they are rarely used."},"usage_notes":{"explanation":"\"Copyrightable\" is used to describe works that meet the legal requirements for copyright protection. These works typically include original literary, dramatic, musical, and certain other intellectual works. The term is often used in legal and business contexts to determine whether a work can be legally protected from unauthorized use or reproduction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The idea is copyrightable, even though it's not written down.","correct":"✓ The expression of the idea is copyrightable, but the idea itself is not.","note":"Copyright protects the expression of an idea, not the idea itself. The tangible form of the work is what is copyrightable."},{"incorrect":"✗ Everything I create is automatically copyrightable and protected.","correct":"✓ Original works of authorship are automatically copyrightable, but registration provides additional benefits.","note":"While copyright protection is automatic upon creation, registering the copyright provides additional legal benefits, such as the ability to sue for infringement."},{"incorrect":"✗ If I change someone else's work, it becomes copyrightable by me.","correct":"✓ Derivative works can be copyrightable, but only to the extent of the new material added.","note":"A derivative work can be copyrightable, but only the new elements added by the author are protected, not the underlying copyrighted material."}],"priority":"★★☆"},"related_words":{"derivatives":["copyright (noun)","copyright (verb)","copyright (adjective)","copyrightability (noun)"],"phrasal_verbs":[],"related_legal_terms":["intellectual property","fair use","public domain","infringement","royalty","license","derivative work"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in legal and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"copyrightable\" is a specialized term primarily used in legal and business contexts. It refers to whether a particular work is eligible for copyright protection under the law. Understanding this term requires familiarity with intellectual property law and the criteria for copyright eligibility, such as originality and creativity. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel's plot and characters are highly original, making it clearly **copyrightable**.","translation":"その小説のプロットとキャラクターは非常に独創的であり、明らかに著作権で保護できる。","type":"adjective","meaning_category":"Eligible for copyright protection."},{"sentence":"The court determined that the software's unique algorithm was **copyrightable**.","translation":"裁判所は、そのソフトウェアの独自のアルゴリズムが著作権を取得できると判断した。","type":"adjective","meaning_category":"Capable of being copyrighted."},{"sentence":"To ensure protection, the company sought legal advice to confirm that their new product design was **copyrightable**.","translation":"保護を確実にするために、会社は新しい製品デザインが著作権で保護できることを確認するために法的助言を求めた。","type":"adjective","meaning_category":"Eligible for copyright protection."}]}