{"word":"Hattic","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハッティ語（古代アナトリアで使用されていた非インド・ヨーロッパ語族の言語）","english_definition":"An extinct non-Indo-European language spoken in Anatolia (modern-day Turkey) before the arrival of the Hittites.","examples":[{"sentence":"Hattic is not related to any other known language family.","translation":"ハッティ語は、他の既知の語族とは関連性がない。"},{"sentence":"Some Hattic words were incorporated into the Hittite language.","translation":"いくつかのハッティ語の単語は、ヒッタイト語に取り入れられた。"}],"collocations":["Hattic language","Hattic texts","Hattic influence"],"synonyms":["none"],"antonyms":["Hittite"]},{"part_of_speech":"adjective","definition":"ハッティ語の、ハッティ人の、ハッティ文化の","english_definition":"Relating to the Hattians, their language, or their culture.","examples":[{"sentence":"Hattic religious practices influenced Hittite religion.","translation":"ハッティ人の宗教的慣習は、ヒッタイトの宗教に影響を与えた。"},{"sentence":"Hattic art is characterized by its unique style.","translation":"ハッティの芸術は、その独特な様式によって特徴づけられる。"}],"collocations":["Hattic culture","Hattic art","Hattic religion"],"synonyms":["Hattian"],"antonyms":["Hittite"]}],"etymology":{"value":"Derived from 'Hatti,' the ancient name for the region in Anatolia where the Hattians lived.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhætɪk/","syllables":"Hat-tic"},"inflection":{"noun_plural":"none (language name)","adjective_forms":"none"},"usage_notes":{"explanation":"'Hattic' is primarily used in historical and linguistic contexts when discussing the ancient Hattian civilization and their unique language. It is important to distinguish it from 'Hittite,' which refers to a different people and language that later dominated the same region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Hittites spoke Hattic.","correct":"✓ The Hattians spoke Hattic.","note":"The Hattians were the original inhabitants who spoke Hattic, while the Hittites spoke Hittite."},{"incorrect":"✗ Hattic is a dialect of Hittite.","correct":"✓ Hattic is a separate language from Hittite.","note":"Hattic and Hittite are distinct languages, with Hattic being non-Indo-European and Hittite being Indo-European."}],"priority":"★★☆"},"related_words":{"derivatives":["Hattian (noun/adjective: relating to the Hattians)"],"phrasal_verbs":["none"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Hattic' is a specialized term used in the fields of archaeology, ancient history, and linguistics. Understanding its usage requires familiarity with the history of Anatolia and the ancient Near East. It refers to the language and culture of the Hattians, a pre-Hittite population in Anatolia. It is crucial to differentiate it from 'Hittite,' which refers to a later, Indo-European-speaking group that came to dominate the region. The term is primarily encountered in academic texts and discussions related to ancient Anatolian civilizations."},"example_sentences":[{"sentence":"The **Hattic** language is poorly understood due to the limited number of surviving texts.","translation":"ハッティ語は、現存するテキストの数が限られているため、ほとんど理解されていない。","type":"noun","meaning_category":"language"},{"sentence":"**Hattic** religious beliefs influenced the later Hittite pantheon.","translation":"ハッティの宗教的信念は、後のヒッタイトの神々に影響を与えた。","type":"adjective","meaning_category":"culture"},{"sentence":"Scholars are still working to decipher the remaining **Hattic** inscriptions.","translation":"学者たちは、残されたハッティ語の碑文を解読するために今も研究を続けている。","type":"adjective","meaning_category":"language"}]}