{"word":"paleopathological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"古病理学の、古病理学的な","english_definition":"Relating to the study of ancient diseases and injuries in human and animal remains.","examples":[{"sentence":"Paleopathological analysis of the skeletal remains revealed evidence of tuberculosis.","translation":"骨格遺体の古病理学的分析により、結核の証拠が明らかになった。"},{"sentence":"The paleopathological findings provided insights into the health conditions of past populations.","translation":"古病理学的な発見は、過去の集団の健康状態に関する洞察を提供した。"}],"collocations":["paleopathological analysis","paleopathological evidence","paleopathological study","paleopathological findings","paleopathological research"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"Derived from the combination of 'paleo-' (ancient), 'pathological' (relating to pathology), and '-al' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpeɪlioʊˌpæθəˈlɒdʒɪkəl/","syllables":"pa-le-o-pa-tho-lo-gi-cal"},"inflection":{"notes":"Adjective; no inflection."},"usage_notes":{"explanation":"'Paleopathological' is used to describe studies, analyses, or findings related to the field of paleopathology, which is the study of diseases and injuries in ancient human and animal remains. It is often used in the context of archeology, anthropology, and medical history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paleontological study revealed evidence of disease.","correct":"✓ The paleopathological study revealed evidence of disease.","note":"'Paleontological' refers to the study of prehistoric life forms, while 'paleopathological' refers to the study of ancient diseases. Ensure the correct term is used based on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["paleopathology (noun)"],"phrasal_verbs":["none"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'paleopathological' is a specialized term used in academic and research contexts, specifically within the fields of archeology, anthropology, and medical history. It describes anything related to the study of ancient diseases and injuries found in human and animal remains. Understanding this term requires familiarity with the root words 'paleo-' (ancient) and 'pathological' (related to disease)."},"example_sentences":[{"sentence":"The paleopathological examination of the mummy revealed signs of arthritis.","translation":"ミイラの古病理学的検査により、関節炎の兆候が明らかになった。","type":"general","meaning_category":"General"},{"sentence":"Paleopathological data can help reconstruct the living conditions of ancient civilizations.","translation":"古病理学的データは、古代文明の生活状況を再構築するのに役立つ。","type":"research","meaning_category":"Research"},{"sentence":"The paleopathological report detailed the types of injuries observed on the ancient skeletons.","translation":"古病理学的報告書は、古代の骨格に見られた怪我の種類を詳細に記述した。","type":"medical","meaning_category":"Medical"}]}