{"word":"first-mortgage","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"第一抵当（権）","english_definition":"A mortgage that has priority over all other mortgages on a property. In the event of a foreclosure, the first-mortgage holder is paid before any other mortgage holders.","examples":[{"sentence":"The bank holds the first-mortgage on our house.","translation":"銀行は私たちの家の第一抵当権を保有しています。"},{"sentence":"It's often easier to get approved for a first-mortgage than a second-mortgage.","translation":"第二抵当よりも第一抵当の承認を得る方が簡単なことが多いです。"}],"collocations":["hold a first-mortgage (第一抵当権を保有する)","apply for a first-mortgage (第一抵当を申し込む)","first-mortgage lender (第一抵当貸付業者)","first-mortgage rate (第一抵当金利)"],"synonyms":["primary mortgage","senior mortgage"],"antonyms":["second-mortgage","junior mortgage"]}],"etymology":{"value":"The term 'first-mortgage' is derived from the fact that it is the initial or primary mortgage taken out on a property, giving it the first claim on the property in case of default.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɜːrst ˈmɔːrɡɪdʒ/","syllables":"first-mor-gage"},"inflection":{"noun_plural":"first-mortgages"},"usage_notes":{"explanation":"A 'first-mortgage' is crucial in real estate finance. It signifies the lender who has the primary claim on a property. If the borrower defaults, the first-mortgage holder gets paid before any other lenders with mortgages on the same property. This reduces the lender's risk, typically resulting in more favorable interest rates and terms compared to second or subsequent mortgages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a first mortgage with the bank of America.","correct":"✓ I have a first-mortgage with Bank of America.","note":"It is more common to use the compound noun 'first-mortgage' as one word or hyphenated, rather than separating it into two words in this context."},{"incorrect":"✗ The first mortgage is more riskier than the second.","correct":"✓ The first-mortgage is less risky than the second.","note":"First mortgages are generally considered less risky for the lender compared to second mortgages because they have priority in repayment during foreclosure."}],"priority":"★★☆"},"related_words":{"derivatives":["mortgagee (抵当権者)","mortgagor (抵当権設定者)","mortgage-backed security (抵当担保債券)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specific to finance and real estate.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'first-mortgage' refers to the primary loan secured against a property. It's the initial mortgage taken out, granting the lender first claim on the property if the borrower fails to repay the loan. Understanding this term is essential in real estate transactions and financial planning, as it affects risk assessment and investment strategies. This term is most commonly used in financial and legal contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"We secured a first-mortgage with a low interest rate.","translation":"私たちは低金利の第一抵当を確保しました。","type":"noun","meaning_category":"Finance"},{"sentence":"The first-mortgage holder has priority in case of foreclosure.","translation":"差し押さえの場合、第一抵当権者が優先されます。","type":"noun","meaning_category":"Law"},{"sentence":"The couple used a first-mortgage to buy their dream home.","translation":"その夫婦は第一抵当を使って夢の家を購入しました。","type":"noun","meaning_category":"Real Estate"}]}