{"word":"unjolted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"衝撃を受けていない、揺さぶられていない","english_definition":"Not having been jolted; not having experienced a sudden, rough shaking or jarring movement.","examples":[{"sentence":"The camera, mounted with a sophisticated stabilization system, remained unjolted even on the rough terrain.","translation":"高度な安定化システムを備えたカメラは、荒れた地形でも衝撃を受けなかった。"},{"sentence":"The passengers, secured with advanced seatbelts, remained unjolted during the sudden stop.","translation":"高度なシートベルトで固定された乗客は、急停止の間も揺さぶられなかった。"}],"collocations":["remain unjolted","feel unjolted","largely unjolted"],"synonyms":["undisturbed","unshaken","stable","steady","smooth"],"antonyms":["jolted","shaken","disturbed","jarred"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'jolted' of the verb 'jolt'. 'Jolt' itself comes from Middle English, possibly related to the word 'joll', meaning to knock or bump.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈdʒoʊltɪd/","syllables":"un-jolt-ed"},"inflection":{"notes":"As an adjective derived from a past participle, 'unjolted' does not have separate inflections for gender or number. It can be modified by adverbs of degree (e.g., 'very unjolted')."},"usage_notes":{"explanation":"'Unjolted' is a relatively uncommon adjective, primarily used in descriptive contexts where the absence of a sudden, rough movement or shock is notable. It often implies a sense of stability, smoothness, or protection from disruptive forces. It is often used in technical or engineering contexts, or in figurative senses to describe emotional or psychological stability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unjolted experience was calming.","correct":"✓ The undisturbed experience was calming.","note":"'Unjolted' specifically refers to the absence of a physical jolt. If describing a generally calm experience, 'undisturbed' or 'peaceful' might be more appropriate."},{"incorrect":"✗ He was unjolted by the news.","correct":"✓ He was unshaken by the news.","note":"When referring to emotional or psychological impact, 'unjolted' is less common. 'Unshaken' or 'unfazed' are more frequently used to describe someone who is not emotionally disturbed by news or events."}],"priority":"★★☆"},"related_words":{"derivatives":["unjolting (adjective: not causing a jolt)"],"related_terms":["jolt (verb/noun: a sudden, rough movement)","jolting (adjective: causing a jolt)","shaken (adjective: disturbed or upset)","unfazed (adjective: not disturbed or disconcerted)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (The word is too rare to be included in CEFR levels)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unjolted' is a relatively rare and specialized word. It describes something that has not experienced a sudden, rough movement or shock. To understand it, you need to know the meaning of 'jolt' (a sudden, sharp, irregular movement) and the function of the prefix 'un-' (meaning 'not'). This word is most likely to appear in technical descriptions or in writing that emphasizes stability and smoothness."},"example_sentences":[{"sentence":"The delicate equipment arrived unjolted, thanks to the careful packaging.","translation":"慎重な梱包のおかげで、繊細な機器は衝撃を受けることなく到着した。","type":"adjective","meaning_category":"衝撃を受けていない"},{"sentence":"Despite the bumpy road, the camera remained remarkably unjolted.","translation":"でこぼこ道にもかかわらず、カメラは驚くほど衝撃を受けなかった。","type":"adjective","meaning_category":"揺さぶられていない"}]}