{"word":"interjectural","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"挿入句的な、間投詞的な","english_definition":"Relating to or having the nature of an interjection; inserted or thrown in between.","examples":[{"sentence":"The speaker's interjectural remarks added humor to the presentation.","translation":"講演者の挿入句的な発言は、プレゼンテーションにユーモアを添えた。"},{"sentence":"The text contained several interjectural phrases that disrupted the flow.","translation":"その文章には、流れを妨げるいくつかの間投詞的なフレーズが含まれていた。"}],"collocations":["interjectural phrase","interjectural remark","interjectural comment"],"synonyms":["parenthetical","inserted","interpolated","digressive"],"antonyms":["essential","integral","relevant"]}],"etymology":{"value":"From 'interjection' + '-al'. 'Interjection' comes from Latin 'interiectio', from 'intericere' meaning 'to throw between'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈdʒɛktʃərəl/","syllables":"in-ter-jec-tur-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative forms with 'more' and 'most', respectively (e.g., more interjectural, most interjectural)."},"usage_notes":{"explanation":"'Interjectural' describes something that is inserted abruptly into a conversation or text, often as a brief comment or exclamation. It is related to the grammatical term 'interjection', which refers to words or phrases used to express sudden emotion or reaction (e.g., 'Wow!', 'Oh dear!'). The term 'interjectural' is not commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interjectural part of the book was the most interesting.","correct":"✓ The interjected part of the book was the most interesting.","note":"'Interjectural' describes the *nature* of the insertion, not the inserted part itself. 'Interjected' is more appropriate to describe the section of the book that was inserted."}],"priority":"★★☆"},"related_words":{"derivatives":["interjection (noun): an exclamation","interject (verb): to interrupt with a comment or remark"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interjectural' is a relatively uncommon adjective that describes something related to or having the nature of an interjection. An interjection is a word or phrase used to express a sudden feeling or emotion. Therefore, 'interjectural' refers to something that is inserted or thrown in between other elements, often disrupting the flow or adding a brief comment. Because of its specialized meaning and low frequency, this word is typically encountered in advanced academic or literary contexts."},"example_sentences":[{"sentence":"The play was filled with interjectural asides that provided comic relief.","translation":"その劇は、コメディリリーフを提供する挿入句的な傍白で満たされていた。","type":"adjective","meaning_category":"挿入句的な"},{"sentence":"His interjectural comments during the lecture were often distracting to other students.","translation":"彼の講義中の間投詞的なコメントは、他の学生にとってしばしば気が散るものだった。","type":"adjective","meaning_category":"間投詞的な"}]}