{"word":"softhorn","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(園芸) 軟質挿し穂","english_definition":"A cutting taken from a plant when the new growth is still soft and pliable.","examples":[{"sentence":"Softhorn cuttings are often used for propagating herbaceous plants.","translation":"軟質挿し穂は、しばしば草本植物の繁殖に用いられる。"}],"collocations":["softhorn cutting","take a softhorn cutting"],"synonyms":["softwood cutting"],"antonyms":["hardwood cutting","semi-hardwood cutting"]},{"part_of_speech":"adjective","definition":"(園芸) 軟質挿し穂の","english_definition":"Relating to or consisting of soft, new plant growth suitable for cuttings.","examples":[{"sentence":"Softhorn growth is ideal for rooting quickly.","translation":"軟質挿し穂は、迅速な発根に最適である。"}],"collocations":["softhorn growth","softhorn material"],"synonyms":["herbaceous","tender"],"antonyms":["woody","hardwood"]}],"etymology":{"value":"Derived from 'soft' + 'horn', referring to the pliable nature of the new plant growth.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsɒftˌhɔːrn/","syllables":"soft-horn"},"inflection":{"noun_plural":"softhorns"},"usage_notes":{"explanation":"'Softhorn' is a term primarily used in horticulture to describe a specific type of plant cutting. It refers to the new, pliable growth of a plant that is ideal for propagation. It is important to distinguish it from other types of cuttings, such as hardwood and semi-hardwood cuttings, which are taken from more mature growth.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a softhorn cutting from the rose bush in the winter.","correct":"✓ I took a hardwood cutting from the rose bush in the winter.","note":"Softhorn cuttings are typically taken in the spring or early summer when the plant is actively growing, not in the winter."}],"priority":"★☆☆"},"related_words":{"derivatives":["softwood"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Softhorn' is a technical term used in gardening and horticulture. It describes a specific type of plant cutting taken from new, soft growth. Understanding this term requires some knowledge of plant propagation techniques."},"example_sentences":[{"sentence":"The gardener carefully selected a softhorn cutting from the geranium.","translation":"庭師はゼラニウムから丁寧に軟質挿し穂を選んだ。","type":"noun","meaning_category":"軟質挿し穂"},{"sentence":"Softhorn cuttings root best in a humid environment.","translation":"軟質挿し穂は湿度の高い環境で最もよく発根する。","type":"adjective","meaning_category":"軟質挿し穂の"}]}