{"word":"Listerise","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To treat with a Listeria-specific bacteriophage to reduce Listeria monocytogenes contamination, especially on food products.","english_definition":"To treat with a Listeria-specific bacteriophage to reduce Listeria monocytogenes contamination, especially on food products.","examples":[{"sentence":"The company plans to Listerise all of its ready-to-eat meat products to ensure consumer safety.","translation":"その会社は消費者の安全を確保するために、すべての調理済み食肉製品をリステリア菌特異的バクテリオファージで処理する予定です。"},{"sentence":"By using the Listerise process, the risk of listeriosis outbreaks can be significantly reduced.","translation":"リステリア菌特異的バクテリオファージ処理プロセスを使用することで、リステリア症のアウトブレイクのリスクを大幅に軽減できます。"}],"collocations":["Listerise food products","Listerise ready-to-eat meats","Listerise to reduce Listeria contamination"],"synonyms":["treat with bacteriophage","apply Listeria phage","phage-treat"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Listeria' (a type of bacteria) and the suffix '-ise' (to treat or affect in a specific way).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪstəraɪz/","syllables":"Lis-ter-ise"},"inflection":{"verb_forms":{"present_simple":["Listerise","Listerises"],"past_simple":"Listerised","past_participle":"Listerised","present_participle":"Listerising"}},"usage_notes":{"explanation":"'Listerise' is a relatively new term specifically used in the context of food safety and microbiology. It refers to the application of bacteriophages to reduce or eliminate Listeria monocytogenes, a harmful bacterium, from food products. This process is often used as an additional safety measure, particularly for ready-to-eat foods that are more susceptible to Listeria contamination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The farmer listerized the soil.","correct":"✓ The farmer treated the soil.","note":"'Listerise' is typically used in the context of food products, not soil."},{"incorrect":"✗ Listerizing is a method to increase bacteria.","correct":"✓ Listerising is a method to decrease bacteria.","note":"Listerising is used to reduce harmful bacteria, not increase them."}],"priority":"★★☆"},"related_words":{"derivatives":["Listerisation (noun: the process of listerising)","Listeria (noun: a genus of bacteria)","bacteriophage (noun: a virus that infects bacteria)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Listerise' is a specialized term primarily used in the food industry and microbiology. It refers to the process of treating food products with Listeria-specific bacteriophages to reduce the risk of Listeria monocytogenes contamination. Understanding this term requires familiarity with microbiology and food safety practices. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The company decided to Listerise its cheese products after a recent contamination scare.","translation":"その会社は最近の汚染の脅威の後、チーズ製品をリステリア菌特異的バクテリオファージで処理することを決定しました。","type":"verb (vt)","meaning_category":"Treatment with bacteriophage"},{"sentence":"Listerising is an effective method for preventing listeriosis.","translation":"リステリア菌特異的バクテリオファージ処理は、リステリア症を予防するための効果的な方法です。","type":"verb (vt)","meaning_category":"Treatment with bacteriophage"}]}