{"word":"unmysticise","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"神秘性を除く、神秘的なものを平易にする、わかりやすくする","english_definition":"to remove the mystery or mystique from something; to make something clear and understandable.","examples":[{"sentence":"The scientist attempted to unmysticise the complex theory for the general public.","translation":"科学者は一般の人々に向けて、その複雑な理論をわかりやすくしようと試みた。"},{"sentence":"The course aims to unmysticise the process of investing in the stock market.","translation":"その講座は株式市場への投資プロセスをわかりやすくすることを目的としている。"}],"collocations":["unmysticise a concept","unmysticise a process","unmysticise a theory"],"synonyms":["demystify","clarify","explain","simplify","elucidate","decipher"],"antonyms":["mystify","obfuscate","complicate","obscure"]}],"etymology":{"value":"\"un-\"（否定の接頭辞）+ \"mysticise\"（神秘化する）","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈmɪstɪsaɪz/","syllables":"un-mis-ti-size"},"inflection":{"verb_forms":{"present_simple":["unmysticise","unmysticises"],"past_simple":"unmysticised","past_participle":"unmysticised","present_participle":"unmysticising"}},"usage_notes":{"explanation":"\"Unmysticise\" means to take something that seems mysterious or difficult to understand and make it clear and simple. It is often used in contexts where someone is trying to explain a complex topic to a wider audience. It is the opposite of \"mystify,\" which means to make something mysterious or confusing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to unmysticise the problem, but he only made it more complicated.","correct":"✓ He tried to demystify the problem, but he only made it more complicated.","note":"\"Demystify\" is a more common and widely understood synonym for \"unmysticise\". While \"unmysticise\" is a valid word, \"demystify\" might be a better choice for clarity."}],"priority":"★☆☆"},"related_words":{"derivatives":["unmystified (形容詞: 神秘性が取り除かれた)","unmystifying (形容詞: 神秘性を取り除く)"],"antonyms":["mysticise (神秘化する)","mystification (神秘化)","mystical (神秘的な)","mystery (神秘)"],"related_concepts":["demystification (明確化、平易化)","simplification (単純化)","clarification (明確化)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈で使われることがある。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unmysticise\" is a relatively uncommon word that means to make something less mysterious or easier to understand. It is often used in academic or technical contexts when someone is trying to explain a complex topic in a simple way. If you want to use a more common word with a similar meaning, you could use \"demystify,\" \"clarify,\" or \"simplify.\" The word is formed by adding the prefix \"un-\" to \"mysticise,\" which means to make something mysterious or mystical."},"example_sentences":[{"sentence":"The author's goal was to unmysticise quantum physics for the average reader.","translation":"著者の目標は、量子物理学を平均的な読者にもわかりやすくすることだった。","type":"verb","meaning_category":"わかりやすくする"},{"sentence":"The lecture aimed to unmysticise the workings of the human brain.","translation":"その講義は、人間の脳の働きをわかりやすくすることを目的としていた。","type":"verb","meaning_category":"神秘性を除く"}]}