{"word":"self-fertilization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自家受精","english_definition":"The fertilization of plants and some invertebrate animals by their own pollen or sperm rather than that of another individual.","examples":[{"sentence":"Self-fertilization is common in some plant species when cross-pollination is not possible.","translation":"自家受精は、他家受粉が不可能な場合、一部の植物種で一般的です。"},{"sentence":"The advantage of self-fertilization is reproductive assurance, especially in isolated populations.","translation":"自家受精の利点は、特に孤立した集団における繁殖の確実性です。"},{"sentence":"Self-fertilization can lead to reduced genetic diversity.","translation":"自家受精は遺伝的多様性の低下につながる可能性があります。"}],"collocations":["obligate self-fertilization (義務的自家受精)","facultative self-fertilization (条件的自家受精)","avoid self-fertilization (自家受精を避ける)","promote self-fertilization (自家受精を促進する)","rate of self-fertilization (自家受精率)"],"synonyms":["autogamy"],"antonyms":["cross-fertilization","outcrossing"]}],"etymology":{"value":"Derived from 'self' + 'fertilization'. 'Self' refers to the organism itself, and 'fertilization' refers to the process of combining male and female gametes to form a zygote.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˌfɜːrtɪlaɪˈzeɪʃən/","syllables":"self-fer-ti-li-za-tion"},"inflection":{"noun_plural":"self-fertilizations"},"usage_notes":{"explanation":"'Self-fertilization' is a biological term primarily used in botany and zoology to describe a reproductive strategy where an organism fertilizes its own eggs with its own sperm or pollen. This is in contrast to cross-fertilization, where fertilization occurs between two different individuals. While it ensures reproduction, it often leads to reduced genetic diversity, which can have evolutionary consequences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Self-fertilization is when two plants fertilize each other.","correct":"Self-fertilization is when a plant fertilizes itself.","note":"Self-fertilization involves a single organism, not two. It is important to distinguish it from cross-fertilization."},{"incorrect":"Self-fertilization always leads to better genetic diversity.","correct":"Self-fertilization usually leads to reduced genetic diversity.","note":"Self-fertilization generally reduces genetic diversity because the offspring inherit genes from a single parent."}],"priority":"★★☆"},"related_words":{"derivatives":["self-fertilize (verb)","self-fertile (adjective)"],"phrases":["reproductive assurance","inbreeding depression","genetic bottleneck"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-fertilization' is a technical term used in biology to describe the process where an organism fertilizes its own eggs with its own sperm or pollen. This is a specialized concept often discussed in the context of plant and invertebrate animal reproduction. Understanding this term requires knowledge of basic reproductive biology and genetics. It is important to note that while self-fertilization can ensure reproduction, it often leads to reduced genetic diversity, which can have evolutionary consequences."},"example_sentences":[{"sentence":"Many flowering plants have evolved mechanisms to avoid self-fertilization.","translation":"多くの顕花植物は、自家受精を避けるためのメカニズムを進化させてきました。","type":"general","meaning_category":"avoidance of self-fertilization"},{"sentence":"In the absence of pollinators, some plant species resort to self-fertilization to ensure seed production.","translation":"送粉者がいない場合、一部の植物種は種子の生産を確実にするために自家受精に頼ります。","type":"general","meaning_category":"necessity of self-fertilization"},{"sentence":"Studies have shown that prolonged self-fertilization can result in inbreeding depression.","translation":"研究によると、長期にわたる自家受精は近交弱勢を引き起こす可能性があります。","type":"scientific","meaning_category":"consequences of self-fertilization"}]}