{"word":"squirarch","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A petty local ruler or squire, especially one who is pompous or self-important.","english_definition":"A petty local ruler or squire, especially one who is pompous or self-important.","examples":[{"sentence":"The squirarch held court in his manor, dispensing judgment on local disputes.","translation":"その地方の小領主は荘園で裁判を開き、地域の紛争について判決を下した。"},{"sentence":"He acted like a squirarch, even though his land was only a small farm.","translation":"彼の土地は小さな農場に過ぎないのに、まるで地方の小領主のように振る舞った。"}],"collocations":["local squirarch","petty squirarch","pompous squirarch"],"synonyms":["squire","local lord","petty ruler","tinpot dictator"],"antonyms":[]}],"etymology":{"value":"A blend of 'squire' and '-arch' (from words like 'monarch' or 'patriarch'), suggesting a small-scale or mock ruler.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwaɪərɑːrk/","syllables":"squir-arch"},"inflection":{"noun_plural":"squirarchs"},"usage_notes":{"explanation":"The term 'squirarch' is often used humorously or disparagingly to describe someone who acts like a ruler or authority figure in a small or insignificant domain. It implies a sense of inflated self-importance or pomposity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The squirarch's power extended throughout the kingdom.","correct":"✓ The squirarch's power extended throughout the village.","note":"'Squirarch' implies a limited area of influence, not an entire kingdom."},{"incorrect":"✗ He was a benevolent squirarch, loved by all his subjects.","correct":"✓ He was a pompous squirarch, disliked by many of the villagers.","note":"While a squirarch *could* be benevolent, the term often carries a negative connotation of pomposity or self-importance."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Squirarch' is a relatively rare and sophisticated word, typically used in literary or humorous contexts. Understanding requires familiarity with the concept of a 'squire' and the '-arch' suffix, which denotes rule or authority. The word is often employed to satirize or critique petty local rulers.","priority":"★★☆"},"example_sentences":[{"sentence":"The local councilman, a self-proclaimed environmentalist, became known as the 'green squirarch' for his draconian recycling policies.","translation":"地元の市議会議員は、自称環境保護論者で、過酷なリサイクル政策のために「緑の小領主」として知られるようになった。","type":"noun","meaning_category":"petty local ruler"},{"sentence":"Old Man Hemlock, with his sprawling garden and prize-winning pumpkins, reigned as the undisputed squirarch of the annual village harvest festival.","translation":"広大な庭と受賞歴のあるカボチャを持つ老ヘムロックは、毎年恒例の村の収穫祭の紛れもない小領主として君臨した。","type":"noun","meaning_category":"pompous local figure"}]}