{"word":"Geographism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地理学) 環境決定論、地理環境決定論","english_definition":"(Geography) Environmental determinism; the belief that the physical environment predisposes societies and states towards particular development trajectories.","examples":[{"sentence":"Geographism, although largely discredited today, was a prominent theory in early geographic thought.","translation":"地理環境決定論は、今日ではほとんど信用されていませんが、初期の地理学的思想においては著名な理論でした。"}],"collocations":["environmental geographism","deterministic geographism"],"synonyms":["environmental determinism"],"antonyms":["possibilism","cultural determinism"]},{"part_of_speech":"noun","definition":"(文学、芸術) 特定の場所や地域の描写に焦点を当てること","english_definition":"(Literature, Art) The focus on the description of specific places or regions.","examples":[{"sentence":"Her novel is characterized by geographism, with detailed descriptions of the rural landscape.","translation":"彼女の小説は、農村風景の詳細な描写という地理主義によって特徴づけられています。"}],"collocations":["literary geographism","artistic geographism"],"synonyms":["regionalism","localism"],"antonyms":["universalism","globalism"]}],"etymology":{"value":"The word \"geographism\" is derived from \"geography\" (from Greek \"geographia\", meaning \"description of the Earth\") with the suffix \"-ism\" indicating a doctrine, principle, or practice.","priority":"★★★"},"pronunciation":{"ipa":"/dʒiˈɒɡrəfɪzəm/","syllables":"ge-og-ra-phism"},"inflection":{"noun_plural":"Geographisms"},"usage_notes":{"explanation":"The term \"geographism\" is primarily used in two contexts: geography and literary/artistic criticism. In geography, it refers to environmental determinism, a largely outdated theory. In literary and artistic contexts, it describes a focus on specific places or regions in creative works.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geographism of the painting was very abstract.","correct":"✓ The regionalism of the painting was very abstract.","note":"In art criticism, use 'regionalism' or 'localism' instead of 'geographism' when referring to a general focus on a region, especially if the work is abstract."}],"priority":"★★☆"},"related_words":{"derivatives":["geographer","geographic","geographical","geographically"],"related_terms":["environmental determinism","possibilism","regionalism","localism"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Geographism' is a specialized term primarily used in academic contexts, particularly in geography and literary criticism. It refers to the belief that the physical environment determines societal development or the focus on specific places in art and literature. Due to its limited use and specific contexts, it is considered an advanced term."},"example_sentences":[{"sentence":"Early theories of geographism suggested that climate directly influenced the development of civilizations.","translation":"初期の地理環境決定論の理論では、気候が文明の発展に直接影響を与えると示唆されていました。","type":"noun","meaning_category":"地理学"},{"sentence":"The geographism in his writing creates a strong sense of place.","translation":"彼の文章における地理主義は、場所の強い感覚を生み出しています。","type":"noun","meaning_category":"文学"}]}