{"word":"nondiffusibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"拡散せずに、拡散しないように","english_definition":"In a manner that does not allow diffusion; in a way that prevents spreading or dissemination.","examples":[{"sentence":"The substance was treated nondiffusibly to prevent it from contaminating the surrounding area.","translation":"その物質は周囲の領域を汚染しないように、拡散しないように処理されました。"},{"sentence":"The information was stored nondiffusibly to maintain its security.","translation":"その情報はセキュリティを維持するために、拡散しないように保存されました。"}],"collocations":["treat nondiffusibly","store nondiffusibly"],"synonyms":["locally","containedly","restrictedly"],"antonyms":["diffusibly","widely","generally"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the adverb 'diffusibly'. 'Diffusibly' is derived from 'diffuse' (to spread or scatter widely) with the suffix '-ibly' (in a manner that is capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒndɪˈfjuːzɪbli/","syllables":"non-dif-fu-si-bly"},"inflection":{"notes":"As an adverb, 'nondiffusibly' does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Nondiffusibly' is a relatively rare adverb used to describe actions or processes that prevent or avoid diffusion. It is often used in scientific or technical contexts where controlling the spread of substances or information is important. The term emphasizes the lack of dispersion or dissemination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gas was nondiffusibly.","correct":"✓ The gas was contained nondiffusibly.","note":"'Nondiffusibly' is an adverb and needs to modify a verb or adjective. It cannot stand alone as a predicate adjective."},{"incorrect":"✗ The information was nondiffusible.","correct":"✓ The information was stored nondiffusibly.","note":"'Nondiffusible' is an adjective, while 'nondiffusibly' is an adverb. Use the correct form depending on whether you are modifying a noun (adjective) or a verb (adverb)."}],"priority":"★★☆"},"related_words":{"derivatives":["nondiffusion (noun): the state of not diffusing","nondiffusible (adjective): not capable of being diffused","diffusibly (adverb): in a manner that allows diffusion","diffuse (verb): to spread or scatter widely","diffusion (noun): the process of spreading widely"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nondiffusibly' is a technical term that describes something done in a way that prevents it from spreading out or dispersing. It's used in specialized contexts, such as chemistry or information security, where controlling the spread of substances or data is crucial. Because it's a niche term, it's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The sample was treated **nondiffusibly** to ensure accurate measurements.","translation":"正確な測定を保証するために、サンプルは拡散しないように処理されました。","type":"adverb","meaning_category":"preventing diffusion"},{"sentence":"The data was stored **nondiffusibly** to protect it from unauthorized access.","translation":"データは不正アクセスから保護するために、拡散しないように保存されました。","type":"adverb","meaning_category":"preventing dissemination"}]}