{"word":"rontgenoscopic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"レントゲン透視の、レントゲン透視的な","english_definition":"Relating to or using roentgenoscopy (fluoroscopy).","examples":[{"sentence":"The doctor performed a rontgenoscopic examination of the patient's chest.","translation":"医師は患者の胸部のレントゲン透視検査を行った。"},{"sentence":"Rontgenoscopic techniques allow for real-time imaging of internal organs.","translation":"レントゲン透視技術により、内臓のリアルタイムイメージングが可能になる。"}],"collocations":["rontgenoscopic examination","rontgenoscopic image","rontgenoscopic technique"],"synonyms":["fluoroscopic"],"antonyms":[]}],"etymology":{"value":"The word 'rontgenoscopic' is derived from 'roentgenoscopy,' which combines 'Roentgen' (after Wilhelm Roentgen, the discoverer of X-rays) with '-scopy' (denoting viewing or examination).","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɒntɡənəˈskɒpɪk/","syllables":"ront-gen-o-scop-ic"},"inflection":{"notes":"This word does not have common inflections beyond comparative/superlative forms (more rontgenoscopic, most rontgenoscopic), which are rarely used."},"usage_notes":{"explanation":"'Rontgenoscopic' is a technical term primarily used in medical contexts. It refers specifically to procedures or images obtained through fluoroscopy, a technique using X-rays to obtain real-time moving images of the internal structures of a patient. It is often used interchangeably with 'fluoroscopic,' although 'fluoroscopic' is more common in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rontgenoscopic was clear.","correct":"✓ The rontgenoscopic image was clear.","note":"'Rontgenoscopic' is an adjective, so it must modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ Rontgenoscopic is used instead of MRI.","correct":"✓ Rontgenoscopy is used instead of MRI in some cases.","note":"'Rontgenoscopic' is an adjective, while 'rontgenoscopy' is the noun referring to the procedure itself."}],"priority":"★★☆"},"related_words":{"derivatives":["roentgenoscopy (noun): the examination of the internal structures of opaque objects by means of X-rays.","Roentgen (noun): a unit of ionizing radiation.","radioscopic (adjective): relating to radioscopy, a more general term for imaging with radiation."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. It's a specialized term used primarily in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'rontgenoscopic' is highly specialized and primarily encountered in medical or technical contexts related to radiology. It describes something pertaining to roentgenoscopy, also known as fluoroscopy, which involves using X-rays to view real-time images of internal body structures. Due to its specific usage and technical nature, it is not commonly used in general conversation or writing. Understanding requires familiarity with medical imaging techniques."},"example_sentences":[{"sentence":"The surgeon used rontgenoscopic guidance to position the catheter.","translation":"外科医はカテーテルを配置するためにレントゲン透視ガイダンスを使用した。","type":"adjective","meaning_category":"medical imaging"},{"sentence":"Rontgenoscopic evaluation revealed a small foreign object in the patient's esophagus.","translation":"レントゲン透視評価により、患者の食道に小さな異物が認められた。","type":"adjective","meaning_category":"medical diagnosis"}]}