{"word":"eczematization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"湿疹化、湿疹様変化：皮膚が湿疹のような状態になること。既存の皮膚疾患（アトピー性皮膚炎、接触性皮膚炎など）が悪化し、紅斑、丘疹、水疱、痂皮、鱗屑などが現れる状態を指す。","english_definition":"The process or state of becoming eczematous; the development of eczema-like changes in the skin, often referring to the worsening of an existing skin condition (e.g., atopic dermatitis, contact dermatitis) with the appearance of erythema, papules, vesicles, crusts, and scales.","examples":[{"sentence":"Chronic scratching can lead to eczematization of the skin.","translation":"慢性の掻破は皮膚の湿疹化を引き起こす可能性がある。"},{"sentence":"The eczematization was particularly severe on her hands and wrists.","translation":"湿疹化は特に彼女の手と手首にひどく現れた。"},{"sentence":"Topical corticosteroids are often used to treat eczematization.","translation":"外用ステロイドはしばしば湿疹化の治療に使用される。"}],"collocations":["severe eczematization (重度の湿疹化)","localized eczematization (局所的な湿疹化)","secondary eczematization (二次的な湿疹化)","eczematization of the hands (手の湿疹化)","eczematization of the feet (足の湿疹化)"],"synonyms":["eczema","dermatitis","lichenification","skin inflammation"],"antonyms":["healthy skin","normal skin"],"notes":"Eczematization is a process, not a specific disease. It describes the appearance of the skin, regardless of the underlying cause."}],"etymology":{"value":"Formed from 'eczema' (from Greek 'ekzein' meaning 'to boil out') + '-atization' (a suffix indicating a process or state of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛkˈsɛmətɪˌzeɪʃən/","syllables":"ec-ze-ma-ti-za-tion"},"inflection":{"noun_plural":"eczematizations"},"usage_notes":{"explanation":"'Eczematization' refers to the process by which the skin develops the characteristic features of eczema. It is often used to describe the worsening of a pre-existing skin condition. It's important to note that eczematization is a descriptive term, not a diagnosis in itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Eczematization is a specific disease.","correct":"✓ Eczematization is a process or state of skin changes.","note":"Eczematization describes the appearance of the skin, not a specific disease entity."},{"incorrect":"✗ Use 'eczema' and 'eczematization' interchangeably.","correct":"✓ 'Eczema' refers to the disease, while 'eczematization' refers to the process of developing eczema-like changes.","note":"'Eczema' is the name of a disease, while 'eczematization' describes the changes occurring in the skin."}],"priority":"★★☆"},"related_words":{"derivatives":["eczema","eczematous","dermatitis","atopic dermatitis","contact dermatitis"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary used in medical contexts)","frequency_google_ngram":"Low frequency - Primarily used in medical and dermatological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eczematization' is a term used in dermatology to describe the process by which the skin develops the characteristics of eczema, such as redness, itching, and scaling. It often refers to the worsening of an existing skin condition. This term is primarily used by healthcare professionals and those with a strong understanding of medical terminology."},"example_sentences":[{"sentence":"The patient presented with severe eczematization of the lower legs.","translation":"患者は下腿に重度の湿疹化を呈した。","type":"medical context","meaning_category":"skin condition"},{"sentence":"The eczematization improved significantly after treatment with topical steroids.","translation":"外用ステロイドによる治療後、湿疹化は著しく改善した。","type":"medical context","meaning_category":"skin condition"},{"sentence":"Avoid scratching the affected area to prevent further eczematization.","translation":"さらなる湿疹化を防ぐために、患部を掻かないようにしてください。","type":"medical advice","meaning_category":"skin condition"}]}