{"word":"Latinism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ラテン語からの借用語、ラテン語的な表現、ラテン語の語法","english_definition":"A word or expression borrowed from Latin; a Latin idiom or construction.","examples":[{"sentence":"The text was filled with Latinisms, making it difficult to understand for those unfamiliar with the language.","translation":"その文章はラテン語からの借用語で溢れており、その言語に馴染みのない人にとっては理解するのが困難だった。"},{"sentence":"The author used a Latinism to add a touch of formality to his writing.","translation":"著者は文章に形式的な趣を加えるためにラテン語的な表現を用いた。"}],"collocations":["use a Latinism","avoid Latinisms","literary Latinism","legal Latinism"],"synonyms":["Latinate word","Latinate expression","classical allusion"],"antonyms":[]}],"etymology":{"value":"From Latin *Latinus* (Latin) + *-ism* (a suffix indicating a characteristic, manner, system, or usage).","priority":"★★★"},"pronunciation":{"ipa":"ˈlætɪnɪzəm","syllables":"Lat-in-ism"},"inflection":{"noun_plural":"Latinisms"},"usage_notes":{"explanation":"A \"Latinism\" refers to a word, phrase, or grammatical construction that has been borrowed from the Latin language into another language, such as English. These borrowings can add a sense of formality, erudition, or precision to writing or speech. However, excessive use of Latinisms can make a text appear stilted or difficult to understand for those not familiar with Latin. Latinisms are particularly common in academic, legal, and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The word 'etc.' is a Grecism.","correct":"The word 'etc.' is a Latinism.","note":"'Etc.' (et cetera) is a Latin abbreviation, not Greek."},{"incorrect":"Using too many Latinisms makes your writing more simple.","correct":"Using too many Latinisms makes your writing more complex.","note":"Latinisms often increase the complexity of a text."}],"priority":"★★☆"},"related_words":{"derivatives":["Latinate","Latinist","Latinize"],"phrases":["ad hoc","bona fide","status quo","quid pro quo","per se"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Latinism\" refers to a word, phrase, or grammatical structure taken from Latin and used in another language, like English. These words often give a formal or academic feel to writing. However, using too many Latinisms can make your writing sound complicated or pretentious. You'll often find Latinisms in legal, scientific, or scholarly writing.","priority":"★★☆"},"example_sentences":[{"sentence":"'Agenda' is a Latinism that has become common in English.","translation":"「アジェンダ」は英語で一般的になったラテン語からの借用語である。","type":"noun","meaning_category":"Borrowed word"},{"sentence":"The lawyer used several Latinisms during his closing arguments.","translation":"弁護士は最終弁論でいくつかのラテン語的な表現を使った。","type":"noun","meaning_category":"Latin expression"},{"sentence":"The scientific paper was filled with Latinisms to ensure precision.","translation":"その科学論文は正確さを期すためにラテン語の語法で満たされていた。","type":"noun","meaning_category":"Latin usage"}]}