{"word":"displaceable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"移動可能な、置き換え可能な、追放できる","english_definition":"Capable of being displaced; able to be moved from its place or position; able to be replaced or supplanted.","examples":[{"sentence":"The furniture in the room is easily displaceable.","translation":"部屋の家具は簡単に移動できる。"},{"sentence":"In some economic models, labor is considered a displaceable resource.","translation":"いくつかの経済モデルでは、労働力は置き換え可能な資源と見なされる。"},{"sentence":"The old system is displaceable by a more efficient one.","translation":"古いシステムは、より効率的なシステムによって置き換え可能である。"}],"collocations":["easily displaceable","readily displaceable","potentially displaceable","displaceable workforce"],"synonyms":["movable","removable","portable","replaceable","substitutable","expellable","ejectable"],"antonyms":["irreplaceable","immovable","fixed","permanent","non-displaceable"]}],"etymology":{"value":"The word 'displaceable' is formed by adding the suffix '-able' to the word 'displace'. 'Displace' comes from the Old French 'desplacer', meaning 'to remove from its place', which is derived from 'des-' (away, apart) and 'placer' (to place).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈspleɪsəbəl/","syllables":"di-spla-cea-ble"},"inflection":{"notes":"Adjective, no specific inflectional forms other than comparative and superlative (more displaceable, most displaceable)."},"usage_notes":{"explanation":"'Displaceable' indicates the potential or capability of something to be moved, replaced, or removed. It often refers to physical objects that can be moved from one location to another. It can also describe abstract concepts, such as resources or systems, that can be replaced by something else. The term can also imply the possibility of being forced out or expelled.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The displaceable of the workers caused unrest.","correct":"✓ The displacement of the workers caused unrest.","note":"'Displaceable' is an adjective describing the ability to be displaced. The noun form, 'displacement,' refers to the act of displacing or the state of being displaced."},{"incorrect":"✗ The water bottle was displaceable on the table.","correct":"✓ The water bottle was displaceable from the table. / ✓ The water bottle was displaceable on the table.","note":"While 'displaceable on' is grammatically correct, 'displaceable from' is more common to express the idea of moving something away from a surface. 'Displaceable on' implies that it can be moved around on the surface."}],"priority":"★★☆"},"related_words":{"derivatives":["displace (verb)","displacement (noun)","displacer (noun)"],"antonyms":["non-displaceable"],"related_concepts":["mobility","portability","replaceability","substitutability","redundancy"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'displaceable' is a relatively uncommon adjective that means 'capable of being moved or replaced'. It's often used in technical or formal contexts. For example, you might say that a worker is 'displaceable' if their job can be easily automated or outsourced. Understanding this word requires a good grasp of prefixes (dis-) and suffixes (-able)."},"example_sentences":[{"sentence":"The lightweight chairs are easily **displaceable**, allowing for flexible seating arrangements.","translation":"軽量の椅子は簡単に移動できるため、柔軟な座席配置が可能になる。","type":"adjective","meaning_category":"movable"},{"sentence":"Many factory workers fear that their jobs are **displaceable** by automation.","translation":"多くの工場労働者は、自分の仕事が自動化によって置き換えられることを恐れている。","type":"adjective","meaning_category":"replaceable"},{"sentence":"In a competitive market, companies with outdated technology are **displaceable** by more innovative firms.","translation":"競争の激しい市場では、時代遅れの技術を持つ企業は、より革新的な企業によって取って代わられる可能性がある。","type":"adjective","meaning_category":"supplantable"}]}