{"word":"prediabetes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"糖尿病予備軍、前糖尿病","english_definition":"A condition in which blood sugar levels are higher than normal, but not high enough to be classified as type 2 diabetes.","examples":[{"sentence":"My doctor told me I have prediabetes, so I need to change my diet.","translation":"医者に糖尿病予備軍だと言われたので、食生活を変える必要があります。"},{"sentence":"Prediabetes can often be reversed with lifestyle changes.","translation":"糖尿病予備軍は、多くの場合、生活習慣の改善で改善できます。"},{"sentence":"People with prediabetes are at higher risk of developing type 2 diabetes.","translation":"糖尿病予備軍の人は、2型糖尿病を発症するリスクが高くなります。"}],"collocations":["develop prediabetes (糖尿病予備軍になる)","diagnosed with prediabetes (糖尿病予備軍と診断される)","reverse prediabetes (糖尿病予備軍を改善する)","prediabetes screening (糖尿病予備軍のスクリーニング)","prediabetes diagnosis (糖尿病予備軍の診断)"],"synonyms":["impaired glucose tolerance","borderline diabetes"],"antonyms":["normal blood sugar","diabetes"],"medical_terms":["insulin resistance","glucose intolerance","HbA1c"]}],"etymology":{"value":"The term 'prediabetes' is formed by adding the prefix 'pre-' (meaning 'before') to the word 'diabetes', indicating a state before the onset of full-blown diabetes.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːdaɪəˈbiːtiːz/","syllables":"pre-di-a-be-tes"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Prediabetes' is a medical term used to describe a condition where blood sugar levels are higher than normal but not yet high enough to be diagnosed as type 2 diabetes. It is considered a warning sign that a person is at risk of developing diabetes. Lifestyle changes, such as diet and exercise, are often recommended to prevent the progression to diabetes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a pre-diabetes.","correct":"✓ I have prediabetes.","note":"'Prediabetes' is a noncount noun, so it does not take the indefinite article 'a'."},{"incorrect":"✗ Prediabetes is not serious, it's just a little high blood sugar.","correct":"✓ Prediabetes is a serious condition that can lead to diabetes if not managed.","note":"Prediabetes should be taken seriously as it increases the risk of developing type 2 diabetes and other health problems."}],"priority":"★★☆"},"related_words":{"derivatives":["prediabetic (adjective)"],"medical_terms":["diabetes mellitus","type 2 diabetes","insulin","glucose","blood sugar","hyperglycemia","hypoglycemia","A1C","fasting blood sugar"],"lifestyle_recommendations":["diet","exercise","weight loss","healthy eating","physical activity"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Prediabetes' is a medical term indicating that someone's blood sugar levels are higher than normal, but not yet high enough to be considered type 2 diabetes. It's a warning sign that they are at risk of developing diabetes in the future. Doctors often recommend lifestyle changes to manage prediabetes and prevent it from progressing to diabetes. This term is commonly used in medical contexts and health-related discussions."},"example_sentences":[{"sentence":"Early detection of prediabetes is crucial for preventing type 2 diabetes.","translation":"2型糖尿病を予防するためには、糖尿病予備軍の早期発見が不可欠です。","type":"general","meaning_category":"prevention"},{"sentence":"Losing weight and exercising regularly can help manage prediabetes.","translation":"減量と定期的な運動は、糖尿病予備軍の管理に役立ちます。","type":"lifestyle","meaning_category":"management"},{"sentence":"People with prediabetes should monitor their blood sugar levels regularly.","translation":"糖尿病予備軍の人は、定期的に血糖値をモニタリングする必要があります。","type":"medical","meaning_category":"monitoring"}]}