{"word":"Rabbies","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(plural of Rabbie) A familiar or affectionate term for a rabbit.","english_definition":"Plural form of Rabbie, a familiar or affectionate term for a rabbit.","examples":[{"sentence":"The children loved playing with the rabbies in the garden.","translation":"子供たちは庭でウサギたちと遊ぶのが大好きだった。"}],"collocations":[],"synonyms":["rabbits","bunnies"],"antonyms":[]},{"part_of_speech":"noun","definition":"(plural of Rabbie) A Scottish diminutive of the name Robert, often referring to Robert Burns.","english_definition":"Plural form of Rabbie, a Scottish diminutive of the name Robert, especially when referring to Robert Burns.","examples":[{"sentence":"The Rabbies were celebrated at the Burns supper.","translation":"バーンズ・サパーでは、ロバート・バーンズ（ロバートの愛称）たちが祝われた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Rabbie' is a Scottish diminutive of the name Robert, and also a familiar term for a rabbit.","priority":"Medium"},"pronunciation":{"ipa":"/ˈræbiz/","syllables":"Rab-bies"},"inflection":{"noun_plural":"Rabbies"},"usage_notes":{"explanation":"'Rabbies' is primarily the plural form of 'Rabbie.' 'Rabbie' itself has two main uses: as a familiar term for a rabbit and as a Scottish diminutive of the name Robert, particularly referring to Robert Burns. The context usually clarifies which meaning is intended.","priority":"Medium"},"common_mistakes":{"examples":[],"priority":"Low"},"related_words":{"derivatives":["Rabbie"],"phrasal_verbs":[],"priority":"Low"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"Advanced","text":"This word is relatively uncommon. Its meaning depends heavily on context. It can refer to multiple rabbits (as a plural of a pet name) or, in a Scottish context, to multiple people named Robert, especially when referring to Robert Burns."},"example_sentences":[{"sentence":"The little girl named all her pet rabbits 'Rabbies'.","translation":"その幼い女の子は、飼っているウサギ全てに「ラビーズ」という名前を付けた。","type":"noun","meaning_category":"plural of rabbit"},{"sentence":"The society honored the Rabbies with a special event.","translation":"その協会は、ロバート・バーンズ（ロバートの愛称）たちを特別なイベントで称えた。","type":"noun","meaning_category":"plural of Robert Burns"}]}