{"word":"paradromic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学、特にグラフ理論において)グラフの自己同型群が自明であること。つまり、グラフの構造を保つような自明でない変換が存在しないこと。","english_definition":"(mathematics, especially in graph theory) Describing a graph whose automorphism group is trivial, meaning that there are no non-trivial transformations that preserve the structure of the graph.","examples":[{"sentence":"The Petersen graph is not paradromic because it has non-trivial automorphisms.","translation":"ピーターセングラフは自明でない自己同型性を持つため、パラドロム的ではありません。"},{"sentence":"A complete graph with more than two vertices is never paradromic.","translation":"2つ以上の頂点を持つ完全グラフは決してパラドロム的ではありません。"}],"collocations":["paradromic graph","paradromic tree"],"synonyms":["asymmetric graph","rigid graph"],"antonyms":["symmetric graph"]}],"etymology":{"value":"ギリシャ語の 'para' (そばに、類似) + 'dromos' (走る、コース) に由来すると考えられる。グラフの構造が変化しない、つまり「同じコースを走る」ような自己同型性がないことを意味する。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpærəˈdrɒmɪk/","syllables":"par-a-drom-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級は通常 'more paradromic', 'most paradromic' となりますが、あまり一般的ではありません。"},"usage_notes":{"explanation":"'Paradromic' は、グラフ理論において、グラフの対称性の欠如を厳密に表現するために使用される専門用語です。グラフの自己同型群が自明である、つまりグラフの構造を変化させずに頂点を入れ替える方法がないことを意味します。この用語は、グラフの構造的特性を研究する際に重要となります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The graph is paradromic, so it has many symmetries.","correct":"✓ The graph is paradromic, so it has no symmetries (except the trivial one).","note":"パラドロム的グラフは対称性を持たない（自明な対称性以外）ことを意味します。"},{"incorrect":"✗ All graphs are paradromic.","correct":"✓ Not all graphs are paradromic; many graphs have non-trivial automorphisms.","note":"すべてのグラフがパラドロム的であるわけではありません。多くのグラフは自明でない自己同型性を持っています。"}],"priority":"★★☆"},"related_words":{"derivatives":["automorphism (自己同型)","graph theory (グラフ理論)","isomorphism (同型)","symmetry (対称性)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な数学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**paradromic**」は、グラフ理論という数学の分野で使われる専門用語です。グラフの「自己同型群」が「自明」である、つまりグラフの形を変えずに頂点を入れ替える方法が何もない状態を指します。これは、グラフが非常に非対称であることを意味します。この単語を理解するには、グラフ理論の基本的な知識（グラフ、頂点、自己同型など）が必要です。"},"example_sentences":[{"sentence":"Determining whether a graph is paradromic can be computationally challenging.","translation":"グラフがパラドロム的かどうかを判断することは、計算上難しい場合があります。","type":"adjective","meaning_category":"グラフ理論"},{"sentence":"The study of paradromic graphs is important in understanding graph rigidity.","translation":"パラドロム的グラフの研究は、グラフの剛性を理解する上で重要です。","type":"adjective","meaning_category":"グラフ理論"}]}