{"word":"undesiredly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"望まれない形で、意図せずに、不本意ながら","english_definition":"in an undesired manner; not wanted or wished for; unintentionally.","examples":[{"sentence":"The package arrived undesiredly, as I had already cancelled the order.","translation":"注文をすでにキャンセルしていたので、その荷物は望まれない形で届いた。"},{"sentence":"He became involved in the argument undesiredly.","translation":"彼は不本意ながらその議論に巻き込まれてしまった。"},{"sentence":"The information was leaked undesiredly due to a security breach.","translation":"セキュリティ侵害により、その情報は意図せずに漏洩してしまった。"}],"collocations":["arrive undesiredly","become involved undesiredly","leak undesiredly","happen undesiredly"],"synonyms":["unintentionally","inadvertently","unwillingly","unwantedly","unsolicitedly","unexpectedly"],"antonyms":["desiredly","intentionally","deliberately","willingly"]}],"etymology":{"value":"The word 'undesiredly' is formed by adding the suffix '-ly' to the adjective 'undesired'. 'Undesired' is created by adding the prefix 'un-' (meaning 'not') to the past participle 'desired' of the verb 'desire'. Thus, 'undesiredly' means 'in a manner that is not desired'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈzaɪərdli/","syllables":"un-de-sired-ly"},"inflection":{"notes":"As an adverb, 'undesiredly' does not have different forms."},"usage_notes":{"explanation":"'Undesiredly' is an adverb that describes an action or event happening in a way that is not wanted or wished for. It often implies a lack of control or intention. It is used to express that something occurred against one's will or preferences. It is relatively formal and not as commonly used as its synonyms like 'unintentionally' or 'unwantedly'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He undesiredly the situation.","correct":"✓ He undesiredly found himself in the situation.","note":"'Undesiredly' is an adverb and should modify a verb or adjective, not be used as a verb itself. The correct usage involves describing how something happened, not performing an action. "},{"incorrect":"✗ The result was undesiredly, but we have to accept it.","correct":"✓ The result was undesired, but we have to accept it. / ✓ The result was undesiredly, but we have to accept it.","note":"'Undesired' is an adjective that describes the result, while 'undesiredly' is an adverb that describes how the result happened. Depending on the intended meaning, either can be correct."}],"priority":"★★☆"},"related_words":{"derivatives":["undesired (adjective: not wanted or wished for)","desire (verb: to want something; noun: a strong feeling of wanting something)","desirable (adjective: wanted or wished for)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undesiredly' is an adverb that means 'in a way that is not wanted or wished for'. It's used to describe how something happens, implying that it was unintentional or against one's preferences. This word is relatively formal and less common in everyday conversation. You'll likely encounter it in written texts, especially when describing events or situations that occurred unexpectedly or against someone's will. "},"example_sentences":[{"sentence":"The error occurred undesiredly during the software update.","translation":"そのエラーはソフトウェアのアップデート中に意図せずに発生した。","type":"general","meaning_category":"unintentionally"},{"sentence":"She found herself in the spotlight undesiredly after her speech went viral.","translation":"彼女はスピーチが口コミで広まった後、不本意ながら注目を浴びることになった。","type":"general","meaning_category":"unwillingly"},{"sentence":"The package was delivered to the wrong address undesiredly.","translation":"その荷物は望まれない形で誤った住所に配達された。","type":"general","meaning_category":"unwantedly"}]}