{"word":"Neo-Realism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ネオリアリズム（国際政治学における現実主義の変種）","english_definition":"A theory of international relations that says power is the most important factor in international relations. It was developed by Kenneth Waltz in his 1979 book Theory of International Politics.","examples":[{"sentence":"Neo-Realism emphasizes the structure of the international system as the primary determinant of state behavior.","translation":"ネオリアリズムは、国家の行動を決定する主要因として国際システムの構造を重視する。"},{"sentence":"According to Neo-Realism, states are primarily concerned with their own security and survival.","translation":"ネオリアリズムによれば、国家は主に自国の安全と生存に関心を持っている。"},{"sentence":"Neo-Realism differs from classical realism in its emphasis on systemic factors rather than human nature.","translation":"ネオリアリズムは、古典的現実主義と異なり、人間の本性よりもシステム的な要因を重視する。"}],"collocations":["structural realism","offensive realism","defensive realism","balance of power","security dilemma"],"synonyms":["Structural Realism"],"antonyms":["Liberalism","Constructivism"],"notes":"Also known as structural realism."}],"etymology":{"value":"The term 'Neo-Realism' combines 'Neo-' (meaning new or revised) with 'Realism,' indicating a revised or updated version of classical political realism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊˈriːəlɪzəm/","syllables":"nee-oh-ree-al-i-zum"},"inflection":{"notes":"It is an uncountable noun."},"usage_notes":{"explanation":"Neo-Realism, also known as structural realism, is a theory in international relations that emphasizes the role of the international system's structure in shaping state behavior. It posits that states are rational actors primarily concerned with their own security and survival, and that the distribution of power in the international system is the most important factor in determining international outcomes. Unlike classical realism, which emphasizes human nature as a primary driver of state behavior, neo-realism focuses on systemic constraints and opportunities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-Realism believe that...","correct":"✓ Neo-Realism believes that...","note":"Neo-Realism is a singular noun, so it takes a singular verb."},{"incorrect":"✗ Neo-Realism is about human nature.","correct":"✓ Neo-Realism is about the structure of the international system.","note":"Neo-Realism focuses on the structure of the international system, not human nature."}],"priority":"★★☆"},"related_words":{"derivatives":["Neo-Realist (noun/adjective)"],"related_terms":["Realism","Classical Realism","Liberalism","Constructivism","International Relations Theory"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neo-Realism is a complex theory in international relations that focuses on how the structure of the international system shapes the behavior of states. It assumes states are rational actors seeking security and survival. This theory is primarily discussed in academic and policy-making contexts, requiring a solid understanding of political science and international relations concepts."},"example_sentences":[{"sentence":"Neo-Realism provides a framework for understanding the dynamics of power politics in the international arena.","translation":"ネオリアリズムは、国際舞台におけるパワーポリティクスの力学を理解するための枠組みを提供する。","type":"general"},{"sentence":"Critics of Neo-Realism argue that it neglects the role of domestic politics and non-state actors.","translation":"ネオリアリズムの批判者たちは、国内政治や非国家主体の役割を無視していると主張する。","type":"criticism"},{"sentence":"Neo-Realism suggests that states will balance against a rising hegemon to maintain stability in the international system.","translation":"ネオリアリズムは、国家は国際システムの安定を維持するために、台頭する覇権国に対抗すると示唆する。","type":"theory"}]}