{"word":"estudy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, nonstandard) A misspelling or informal term for \"e-study\", referring to online or electronic learning.","english_definition":"(rare, nonstandard) A misspelling or informal term for \"e-study\", referring to online or electronic learning.","examples":[{"sentence":"I'm doing an estudy course in web development.","translation":"ウェブ開発のe-studyコースを受講しています。"},{"sentence":"Estudy is becoming increasingly popular due to its convenience.","translation":"e-studyはその利便性からますます人気が高まっています。"}],"collocations":["estudy course","online estudy","estudy materials"],"synonyms":["e-learning","online learning","distance learning","electronic study"],"antonyms":["traditional learning","classroom learning"]}],"etymology":{"value":"A blend of \"electronic\" or \"e-\" (representing electronic media) and \"study\". It's a relatively new and informal term.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈiːˌstʌdi/","syllables":"e-stu-dy"},"inflection":{"noun_plural":"estudies"},"usage_notes":{"explanation":"\"Estudy\" is not a standard or widely recognized term. It's likely a misspelling or an informal abbreviation of \"e-study,\" which itself is a less common alternative to \"e-learning\" or \"online learning.\" Using the more established terms is generally recommended for clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I prefer estudy than going to school.","correct":"✓ I prefer e-learning to going to school. / ✓ I prefer studying online to going to school.","note":"Use the standard terms \"e-learning\" or \"online learning\" instead of \"estudy.\""}],"priority":"★★☆"},"related_words":{"derivatives":["e-learning","online study","distance education"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (non-standard term)","frequency_google_ngram":"Very low frequency - considered a misspelling or non-standard term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Estudy\" is a non-standard term, likely a misspelling or informal abbreviation for \"e-study.\" It refers to online or electronic learning. Because it's not widely recognized, it's best to use more common and established terms like \"e-learning\" or \"online learning\" to avoid confusion. Using \"estudy\" might make your writing or speech sound less professional or less clear. Therefore, it's advisable to stick to the standard terminology in most contexts."},"example_sentences":[{"sentence":"The university offers several options for online estudy.","translation":"その大学では、オンラインe-studyのオプションがいくつかあります。","type":"noun","meaning_category":"Online Learning"},{"sentence":"She found that estudy was a convenient way to balance work and education.","translation":"彼女は、e-studyが仕事と教育のバランスを取るための便利な方法であることに気づきました。","type":"noun","meaning_category":"Online Learning"}]}