{"word":"image-sparse","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a document, website, etc.) containing relatively few images.","english_definition":"Containing relatively few images; characterized by a lack of images.","examples":[{"sentence":"The website was image-sparse, focusing primarily on text-based content.","translation":"そのウェブサイトは画像が少なく、主にテキストベースのコンテンツに焦点を当てていた。"},{"sentence":"The report was intentionally image-sparse to reduce file size.","translation":"レポートはファイルサイズを小さくするために、意図的に画像が少なくされていた。"}],"collocations":["image-sparse website","image-sparse document","image-sparse design","image-sparse content"],"synonyms":["low-image","light on images","minimally illustrated"],"antonyms":["image-rich","image-heavy","densely illustrated"]},{"part_of_speech":"adjective","definition":"(of data) having few visual representations.","english_definition":"Having a limited number of visual representations or lacking detailed imagery.","examples":[{"sentence":"The dataset was image-sparse, making it difficult to train a robust visual recognition model.","translation":"そのデータセットは画像が少なく、堅牢な視覚認識モデルをトレーニングすることが困難だった。"}],"collocations":["image-sparse dataset","image-sparse information"],"synonyms":["visually limited","lacking imagery"],"antonyms":["visually rich","image-dense"]}],"etymology":{"value":"Formed by combining 'image' with 'sparse', indicating a low density or quantity of images.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɪmɪdʒˌspɑːrs/","syllables":"im-age-sparse"},"inflection":{"notes":"Does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Image-sparse' is used to describe something that has few images, either intentionally or unintentionally. It is often used in the context of web design, document creation, or data analysis where the visual component is limited.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The image-sparse are good for loading speed.","correct":"✓ Image-sparse designs are good for loading speed.","note":"'Image-sparse' is an adjective and needs a noun to modify."}],"priority":"N/A"},"related_words":{"derivatives":["sparse","image","imagery"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Image-sparse' is a compound adjective used to describe something that lacks a significant number of images. It's relatively uncommon but easily understood from its component parts. It is most often used in technical or design contexts."},"example_sentences":[{"sentence":"The presentation was deliberately image-sparse to keep the audience focused on the speaker's words.","translation":"プレゼンテーションは、聴衆を講演者の言葉に集中させるために、意図的に画像が少なくされていた。","type":"adjective","meaning_category":"containing few images"},{"sentence":"The image-sparse nature of the old website made it load very quickly, but it was visually unappealing.","translation":"古いウェブサイトは画像が少なかったため、非常に速く読み込めたが、視覚的には魅力的ではなかった。","type":"adjective","meaning_category":"containing few images"}]}