{"word":"study-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"研究に基づいた、調査に基づいた、学習に基づいた","english_definition":"Based on or derived from research, studies, or learning.","examples":[{"sentence":"The new treatment is study-based and has shown promising results.","translation":"その新しい治療法は研究に基づいており、有望な結果を示しています。"},{"sentence":"The curriculum is study-based, with a focus on practical application.","translation":"カリキュラムは学習に基づいており、実践的な応用を重視しています。"},{"sentence":"We need a study-based approach to solve this problem.","translation":"この問題を解決するためには、調査に基づいたアプローチが必要です。"}],"collocations":["study-based research (研究に基づいた研究)","study-based curriculum (学習に基づいたカリキュラム)","study-based approach (調査に基づいたアプローチ)","study-based evidence (研究に基づいた証拠)","study-based program (研究に基づいたプログラム)"],"synonyms":["research-based","evidence-based","learning-based","inquiry-based","investigation-based"],"antonyms":["theoretical","speculative","unsubstantiated"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"study\" (referring to research, learning, or investigation) and \"based\" (meaning founded or derived from). The hyphen connects the two words to create a single adjective describing something that is founded on or derived from studies.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstʌdiˌbeɪst/","syllables":"stud-y-based"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Study-based\" is used to describe something that is founded on or derived from research, studies, or learning. It emphasizes that the information, approach, or program is not based on speculation or theory, but rather on actual studies or research. The term is often used in academic, scientific, and educational contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is base on study.","correct":"✓ The program is study-based.","note":"The correct term is \"study-based,\" not \"base on study.\" It's an adjective, so it needs to be used as such."},{"incorrect":"✗ This is a study base approach.","correct":"✓ This is a study-based approach.","note":"The correct term is \"study-based approach.\" The hyphen is important to combine the two words into a single adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["study (noun, verb)","based (adjective)"],"phrases":["evidence-based practice","research-based evidence","learning-based assessment"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in academic and research contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"study-based\" is used in academic and professional contexts to describe something that is based on research or learning. It's important to understand that it means something is derived from actual studies rather than just theory or speculation. It's often used to emphasize the reliability and validity of something.","priority":"★★★"},"example_sentences":[{"sentence":"The new guidelines are study-based and reflect the latest research findings.","translation":"新しいガイドラインは研究に基づいており、最新の研究結果を反映しています。","type":"general","meaning_category":"Research-based"},{"sentence":"The course offers a study-based approach to language learning.","translation":"このコースは、言語学習への学習に基づいたアプローチを提供します。","type":"educational","meaning_category":"Learning-based"},{"sentence":"The policy is study-based and aims to address the root causes of poverty.","translation":"その政策は調査に基づいており、貧困の根本原因に対処することを目的としています。","type":"policy","meaning_category":"Investigation-based"}]}