{"word":"unpropagable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"繁殖できない、伝播できない、広めることができない","english_definition":"Not able to be propagated; incapable of being reproduced, transmitted, or spread.","examples":[{"sentence":"The disease was unpropagable under normal conditions.","translation":"その病気は通常の条件下では伝播不可能だった。"},{"sentence":"This rumor is unpropagable because it lacks any basis in truth.","translation":"この噂は真実に基づいた根拠を欠いているため、広めることができない。"},{"sentence":"The plant species is unpropagable through seeds.","translation":"その植物種は種子による繁殖が不可能である。"}],"collocations":["unpropagable disease (伝播不能な病気)","unpropagable rumor (広めることができない噂)","unpropagable species (繁殖不能な種)"],"synonyms":["non-propagating","unreproducible","untransmittable","non-disseminable"],"antonyms":["propagable","reproducible","transmittable","disseminable"]}],"etymology":{"value":"\"un-\" (否定接頭辞) + \"propagable\" (繁殖可能な、伝播可能な)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈprɒpəɡəbəl/","syllables":"un-prop-a-ga-ble"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**Unpropagable**\" is a relatively uncommon word that means something cannot be reproduced, transmitted, or spread. It is often used in scientific or technical contexts, such as discussing diseases, rumors, or plant species. The word implies a fundamental inability to be propagated, rather than a temporary or conditional one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The idea was unpropagable to the public.","correct":"✓ The idea was difficult to propagate to the public.","note":"\"Unpropagable\" describes an inherent quality of the thing itself, not the difficulty of propagating it. If the idea *could* be propagated, but with difficulty, use a phrase like \"difficult to propagate\"."},{"incorrect":"✗ The unpropagable material was safely contained.","correct":"✓ The non-propagating material was safely contained.","note":"\"Non-propagating\" is a more common and easily understood synonym for \"unpropagable.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["propagation (名詞: 繁殖、伝播、普及)","propagate (動詞: 繁殖させる、伝播させる、広める)","propagability (名詞: 繁殖性、伝播性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Unpropagable**\" is a formal and uncommon term. It describes something that cannot be reproduced, transmitted, or spread. It is most often found in scientific, medical, or technical writing. It is the opposite of \"propagable,\" which means capable of being propagated. Due to its low frequency, it is best to use it when precision is required and the audience is likely to understand the term. In many cases, simpler alternatives like \"non-propagating\" or \"unable to be spread\" may be preferable.","priority":"★☆☆"},"example_sentences":[{"sentence":"The virus was genetically modified to be unpropagable in humans.","translation":"そのウイルスは、人間において繁殖できないように遺伝子組み換えされた。","type":"adjective","meaning_category":"繁殖できない"},{"sentence":"The theory was considered unpropagable because it lacked empirical evidence.","translation":"その理論は、経験的な証拠を欠いていたため、広めることができないと考えられた。","type":"adjective","meaning_category":"伝播できない"},{"sentence":"Due to its unique genetic makeup, the plant is unpropagable through conventional methods.","translation":"その植物は、独自の遺伝子構成のため、従来の方法では繁殖できない。","type":"adjective","meaning_category":"繁殖できない"}]}