{"word":"Unadoption","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of reversing an adoption; the legal termination of an adoptive parent's rights and responsibilities.","english_definition":"The act of annulling or reversing an adoption, thereby terminating the legal relationship between the adoptive parents and the adopted child.","examples":[{"sentence":"The unadoption process is complex and emotionally challenging for all parties involved.","translation":"離縁の手続きは複雑で、関係者全員にとって感情的に困難です。"},{"sentence":"Unadoption is a rare occurrence, but it can happen under specific circumstances.","translation":"離縁はまれな出来事ですが、特定の状況下で起こり得ます。"},{"sentence":"The court considered the best interests of the child when deciding whether to grant the unadoption petition.","translation":"裁判所は、離縁の申し立てを認めるかどうかを判断する際に、子供の最善の利益を考慮しました。"}],"collocations":["file for unadoption (離縁を申し立てる)","grant an unadoption (離縁を認める)","unadoption petition (離縁の申し立て)","legal unadoption (法的な離縁)"],"synonyms":["reversal of adoption","termination of adoption","annulment of adoption","rescission of adoption"],"antonyms":["adoption"]},{"part_of_speech":"noun","definition":"The state of no longer being adopted.","english_definition":"The condition of having had an adoption legally reversed.","examples":[{"sentence":"After the unadoption, the child returned to the care of their biological family.","translation":"離縁後、子供は実の家族の世話に戻りました。"},{"sentence":"The unadoption left the child in a state of legal limbo.","translation":"離縁は子供を法的な宙ぶらりんの状態にしました。"}],"collocations":["state of unadoption","after unadoption"],"synonyms":["former adoptee status"],"antonyms":["adopted status"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not' or 'reversing') to the word 'adoption'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈdɒpʃən/","syllables":"un-a-dop-tion"},"inflection":{"noun_plural":"unadoptions"},"usage_notes":{"explanation":"'Unadoption' is a relatively rare term referring to the legal process of reversing an adoption. It is distinct from situations where adoptive parents relinquish custody without formally terminating the adoption (which might be termed 're-homing' or 'private fostering,' though these terms carry different connotations). Unadoption legally severs the ties between the adoptive parents and the child, restoring the child's original legal identity or placing them in a new legal situation. The term is most often used in legal or social work contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parents decided to unadopt their child because they didn't like him anymore.","correct":"✓ The parents sought unadoption due to unforeseen circumstances and the child's best interests.","note":"Unadoption is a serious legal process and is not typically undertaken lightly. It usually involves complex legal and emotional considerations, not simply disliking the child."},{"incorrect":"✗ Unadoption is the same as giving a child up for adoption.","correct":"✓ Unadoption reverses an existing adoption; giving a child up for adoption is the initial act of placing a child for adoption.","note":"Unadoption is the reverse of adoption. Giving a child up for adoption is the original act of placing the child with adoptive parents."}],"priority":"★★☆"},"related_words":{"derivatives":["unadopt (verb)"],"related_terms":["adoption","adoptive parents","biological parents","foster care","legal custody","ward of the state"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unadoption' is a specialized legal term referring to the reversal of an adoption. It signifies the termination of the legal relationship between adoptive parents and an adopted child, often involving complex legal proceedings and considerations of the child's best interests. This term is primarily used in legal and social work contexts and is not part of everyday vocabulary."},"example_sentences":[{"sentence":"The lawyer specialized in cases involving unadoption and parental rights.","translation":"その弁護士は、離縁と親権に関する事件を専門としていました。","type":"general","meaning_category":"legal"},{"sentence":"The unadoption proceedings were initiated due to the adoptive parents' inability to provide adequate care.","translation":"養親が適切なケアを提供できないため、離縁手続きが開始されました。","type":"general","meaning_category":"legal"},{"sentence":"The child experienced emotional distress following the unadoption.","translation":"子供は離縁後、精神的な苦痛を経験しました。","type":"general","meaning_category":"emotional"}]}