{"word":"Rock-eel","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of eel found in rocky coastal areas.","english_definition":"A common name for various species of eel that inhabit rocky coastal environments, often used to refer to species within the family Pholidae.","examples":[{"sentence":"The rock-eel hid amongst the seaweed-covered boulders.","translation":"岩のウナギは海藻で覆われた岩の間に隠れていました。"},{"sentence":"Fishermen often find rock-eels when angling near the shore.","translation":"漁師は海岸近くで釣りをするときによく岩のウナギを見つけます。"}],"collocations":["Coastal rock-eel","Catch rock-eel","Observe rock-eel"],"synonyms":["Gunnel","Pholid","Eel"],"antonyms":[]},{"part_of_speech":"noun","definition":"(Regional) An alternative name for certain types of blennies or similar fish found in rocky intertidal zones.","english_definition":"In some regions, the term may be loosely applied to small, elongated fish resembling eels that are found in rocky intertidal habitats, including some blennies.","examples":[{"sentence":"The children searched for rock-eels in the tide pools.","translation":"子供たちは潮だまりで岩のウナギを探しました。"},{"sentence":"That small fish is often mistaken for a rock-eel.","translation":"あの小さな魚はよく岩のウナギと間違えられます。"}],"collocations":["Tide pool rock-eel","Small rock-eel","Identify rock-eel"],"synonyms":["Blennies","Goby","Small fish"],"antonyms":[]}],"etymology":{"value":"The name 'Rock-eel' is descriptive, combining 'rock' (referring to the rocky habitat) and 'eel' (referring to the eel-like appearance of the fish).","priority":"N/A"},"pronunciation":{"ipa":"/ˈrɒkˌiːl/","syllables":"rock-eel"},"inflection":{"noun_plural":"Rock-eels"},"usage_notes":{"explanation":"The term 'Rock-eel' is a common name and can refer to different species depending on the region. It is most accurately used for certain types of eels in the family Pholidae, but may also be used for other small, eel-like fish found in rocky coastal areas.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock-eel is a type of snake.","correct":"✓ The rock-eel is a type of fish.","note":"Rock-eels are fish, not snakes."},{"incorrect":"✗ Rock-eels are only found in freshwater.","correct":"✓ Rock-eels are typically found in saltwater or brackish water.","note":"Rock-eels inhabit coastal marine environments."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Pholidae (family)","Gunnels"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"'Rock-eel' is a specialized term referring to a type of fish found in rocky coastal areas. It is not a common term in general English but is used in contexts related to marine biology, fishing, or coastal environments."},"example_sentences":[{"sentence":"The rock-eel is well-adapted to living in the intertidal zone.","translation":"岩のウナギは潮間帯での生活によく適応しています。","type":"noun","meaning_category":"General"},{"sentence":"We spotted a rock-eel darting between the rocks.","translation":"岩の間を走り抜ける岩のウナギを見つけました。","type":"noun","meaning_category":"Observation"},{"sentence":"Rock-eels are a common sight for divers exploring coastal reefs.","translation":"岩のウナギは沿岸のサンゴ礁を探索するダイバーにとってはよく見られる光景です。","type":"noun","meaning_category":"Habitat"}]}