{"word":"unstationed","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not stationed; not assigned to a particular post or station.","english_definition":"Not assigned to a particular place or position; not having a fixed station.","examples":[{"sentence":"The unstationed soldiers waited for their orders.","translation":"特定の場所に配属されていない兵士たちは命令を待っていた。"},{"sentence":"He remained unstationed for several weeks after returning from leave.","translation":"彼は休暇から戻ってから数週間、特定の場所に配属されないままだった。"}],"collocations":["unstationed personnel","unstationed troops","remain unstationed"],"synonyms":["unassigned","unposted","unplaced"],"antonyms":["stationed","assigned","posted"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'stationed'.","priority":"medium"},"pronunciation":{"ipa":"/ʌnˈsteɪʃənd/","syllables":"un-sta-tioned"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Unstationed' typically refers to people, especially military personnel or employees, who are temporarily without a specific assignment or location. It implies a state of being between assignments or waiting for a new posting.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The unstationed car was parked on the street.","correct":"The unattended car was parked on the street.","note":"'Unstationed' refers to people, not objects. Use 'unattended' for objects."}],"priority":"low"},"related_words":{"derivatives":["station (verb, noun)","stationed (adjective)","stationery (noun, unrelated etymology)"],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unstationed' is a relatively uncommon word, primarily used in formal contexts, especially military or organizational settings. It describes someone who is not currently assigned to a specific location or duty. Understanding its meaning requires a good grasp of vocabulary related to assignments and positions."},"example_sentences":[{"sentence":"The newly recruited officers were initially unstationed.","translation":"新しく採用された士官は、最初は特定の場所に配属されていなかった。","type":"adjective","meaning_category":"Not assigned"},{"sentence":"Due to budget cuts, many employees remained unstationed for an extended period.","translation":"予算削減のため、多くの従業員が長期間にわたり特定の場所に配属されないままだった。","type":"adjective","meaning_category":"Not assigned"}]}