{"word":"Unrulable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not able to be ruled or controlled; ungovernable.","english_definition":"Impossible to control, govern, or manage.","examples":[{"sentence":"The crowd became unrulable, and the police had to intervene.","translation":"群衆は手に負えなくなり、警察が介入しなければならなかった。"},{"sentence":"The unrulable nature of the territory made it difficult to establish any form of government.","translation":"その地域の手に負えない性質のために、いかなる形態の政府を樹立することも困難だった。"}],"collocations":["unrulable crowd","unrulable territory","unrulable behavior"],"synonyms":["ungovernable","uncontrollable","unmanageable","rebellious","insubordinate","defiant"],"antonyms":["rulable","controllable","manageable","governable"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) + 'rulable' (able to be ruled).","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈruːləbəl/","syllables":"un-ru-la-ble"},"inflection":{"adjective_forms":{"comparative":"more unrulable","superlative":"most unrulable"}},"usage_notes":{"explanation":"'Unrulable' describes something or someone that resists being governed or controlled. It often implies a state of chaos or extreme difficulty in maintaining order.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The unrulable country was finally ruled by a dictator.","correct":"✓ The ungovernable country was finally ruled by a dictator.","note":"While 'unrulable' is valid, 'ungovernable' is more commonly used to describe countries or territories that are difficult to govern."}],"priority":"N/A"},"related_words":{"derivatives":["unruly (adjective): disorderly and disruptive and not amenable to discipline or control.","rule (verb): exercise ultimate power or authority over (an area and its people).","rulable (adjective): able to be ruled or controlled."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'unrulable' is a relatively uncommon adjective used to describe something that cannot be controlled or governed. It is formed by adding the prefix 'un-' to 'rulable,' indicating the opposite of being able to be ruled. The term is often used in contexts where there is a significant challenge in maintaining order or authority."},"example_sentences":[{"sentence":"The prison population had become so large and violent that it was practically unrulable.","translation":"刑務所の人口が非常に多く、暴力的になったため、実質的に統治不可能になった。","type":"adjective","meaning_category":"ungovernable"},{"sentence":"The pirate ship was filled with an unrulable crew who were constantly fighting and causing trouble.","translation":"その海賊船は、常に喧嘩や騒ぎを起こしている手に負えない乗組員でいっぱいだった。","type":"adjective","meaning_category":"uncontrollable"}]}