{"word":"polystyrene","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポリスチレン（発泡スチロールを含む）","english_definition":"A synthetic polymer made from the monomer styrene. It exists as a solid or a foam.","examples":[{"sentence":"Polystyrene is used to make disposable cups.","translation":"ポリスチレンは使い捨てコップを作るのに使われる。"},{"sentence":"The package was filled with polystyrene foam to protect the contents.","translation":"荷物は中身を保護するために発泡スチロールで満たされていた。"}],"collocations":["polystyrene foam","expanded polystyrene (EPS)","high-impact polystyrene (HIPS)"],"synonyms":["styrofoam (trademarked name for expanded polystyrene)"],"antonyms":[]}],"etymology":{"value":"'Polystyrene' is derived from 'poly-' (meaning 'many') + 'styrene' (the monomer from which it is made) + '-ene' (indicating an unsaturated hydrocarbon). 'Styrene' itself is named after storax (Styrax), a tree resin from which it was originally obtained.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈstaɪriːn/","syllables":"pol-y-sty-rene"},"inflection":{"noun_plural":"polystyrenes"},"usage_notes":{"explanation":"Polystyrene is a versatile plastic used in various applications, including packaging, insulation, and disposable products. It can be rigid or foamed. Expanded polystyrene (EPS), commonly known as Styrofoam (a trademarked name), is a lightweight foam used for insulation and packaging. High-impact polystyrene (HIPS) is a more durable form used for products like appliance housings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a polystyrene for my coffee.","correct":"✓ I need a polystyrene cup for my coffee.","note":"'Polystyrene' refers to the material itself. To refer to an object made of polystyrene, specify the object (e.g., 'polystyrene cup')."},{"incorrect":"✗ Polystyrene is very environmental friendly.","correct":"✓ Polystyrene is not very environmentally friendly.","note":"Polystyrene is generally considered to be not environmentally friendly due to its slow degradation and potential for pollution."}],"priority":"★★☆"},"related_words":{"derivatives":["styrene","polymer","plastic","foam"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but common in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Polystyrene' refers to a type of plastic. It is used to make many products, like cups and packaging materials. A common form of polystyrene is expanded polystyrene, which is often called 'Styrofoam'. Polystyrene is not very good for the environment. You will usually see this word in science articles or when talking about recycling.","priority":"★★☆"},"example_sentences":[{"sentence":"The model airplane was made of lightweight polystyrene.","translation":"その模型飛行機は軽量なポリスチレン製だった。","type":"noun","meaning_category":"material"},{"sentence":"Please recycle your polystyrene packaging properly.","translation":"ポリスチレン製の梱包材は適切にリサイクルしてください。","type":"noun","meaning_category":"recycling"},{"sentence":"Expanded polystyrene provides excellent thermal insulation.","translation":"発泡ポリスチレンは優れた断熱性を提供する。","type":"noun","meaning_category":"properties"}]}