{"word":"naive-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"世間知らずな目をしている、無邪気な目をしている","english_definition":"Having eyes that express innocence, lack of experience, or a simple, trusting nature.","examples":[{"sentence":"The child had a naive-eyed wonder as they looked at the stars.","translation":"その子供は星を見て、世間知らずな目で驚嘆していた。"},{"sentence":"She approached the situation with a naive-eyed optimism, believing everything would work out.","translation":"彼女はすべてうまくいくと信じて、無邪気な楽観主義で状況に臨んだ。"},{"sentence":"The character was portrayed as naive-eyed, easily manipulated by others.","translation":"その登場人物は世間知らずな目をしていると描写され、他人に簡単に操られる。"}],"collocations":["naive-eyed look","naive-eyed gaze","with naive-eyed wonder","naive-eyed optimism"],"synonyms":["innocent-eyed","wide-eyed","trusting","unsuspecting","gullible","artless","ingenuous"],"antonyms":["cynical","worldly","experienced","jaded","skeptical","sophisticated"]},{"part_of_speech":"adjective","definition":"(比喩的に) 世間知らずな、単純な、経験不足な","english_definition":"(Figuratively) Exhibiting a lack of worldly knowledge or experience; simple and unsophisticated.","examples":[{"sentence":"The project was approached with a naive-eyed enthusiasm, overlooking potential challenges.","translation":"そのプロジェクトは世間知らずな熱意で進められ、潜在的な課題を見過ごしていた。"},{"sentence":"His naive-eyed approach to business led to several costly mistakes.","translation":"彼のビジネスに対する世間知らずなアプローチは、いくつかの高くつく間違いにつながった。"}],"collocations":["naive-eyed approach","naive-eyed enthusiasm","naive-eyed view"],"synonyms":["unsophisticated","inexperienced","unworldly","simple","artless","ingenuous"],"antonyms":["sophisticated","experienced","worldly","cynical","pragmatic"]}],"etymology":{"value":"A compound adjective formed by combining 'naive' (lacking experience or worldly knowledge) and 'eyed' (having eyes of a particular kind). The term suggests that the eyes reflect a state of innocence or lack of sophistication.","priority":"★★☆"},"pronunciation":{"ipa":"/naɪˈiːv aɪd/","syllables":"na-ive-eyed"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Naive-eyed' is typically used to describe someone whose eyes convey a sense of innocence, lack of experience, or a trusting nature. It can also be used figuratively to describe an approach or perspective that is similarly unsophisticated or lacking in worldly knowledge. The term often carries a slightly negative connotation, suggesting that the person or approach may be easily taken advantage of or is unrealistic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was naive-eyed about the dangers.","correct":"✓ He was naive about the dangers.","note":"While 'naive-eyed' describes the *appearance* of naivety, simply 'naive' describes the state of being naive. Use 'naive-eyed' when specifically referring to the look in someone's eyes."},{"incorrect":"✗ The naive-eyed plan was sure to succeed.","correct":"✓ The naive plan was sure to fail.","note":"'Naive-eyed' is best used to describe a person or their expression. To describe a plan, use 'naive' directly."}],"priority":"★★☆"},"related_words":{"derivatives":["naively","naivete","naiveness"],"phrases":["wide-eyed","innocent-eyed","gullible","easily fooled"]},"level_frequency":{"CEFR":"C2 (rare, but understandable)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Naive-eyed' is a descriptive adjective used to portray someone whose eyes suggest innocence, a lack of experience, or a trusting nature. It is not a common term, but its meaning is relatively straightforward to understand based on its component parts ('naive' and 'eyed'). It is often used in literature or descriptive writing to quickly convey a character's personality or state of mind. The term can sometimes carry a slightly negative connotation, implying that the person is easily deceived or lacks a realistic understanding of the world."},"example_sentences":[{"sentence":"She looked at him with a naive-eyed sincerity that disarmed his suspicions.","translation":"彼女は世間知らずな目で彼を見て、その誠実さが彼の疑念を解いた。","type":"adjective","meaning_category":"innocent appearance"},{"sentence":"Despite the warnings, he maintained a naive-eyed belief in the goodness of people.","translation":"警告にもかかわらず、彼は人々の善良さを世間知らずな目で信じ続けた。","type":"adjective","meaning_category":"trusting nature"},{"sentence":"The naive-eyed tourist was an easy target for scammers.","translation":"その世間知らずな観光客は詐欺師にとって格好の標的だった。","type":"adjective","meaning_category":"lack of experience"}]}