{"word":"Chokage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Internet slang) A feeling of being overwhelmed or suffocated by the cuteness, attractiveness, or appeal of something, often used in the context of anime, manga, or other forms of media. It's a portmanteau of 'choke' and 'image'.","english_definition":"A feeling of being overwhelmed or suffocated by the cuteness, attractiveness, or appeal of something, often used in the context of anime, manga, or other forms of media.","examples":[{"sentence":"That anime is so full of cute characters, I'm getting serious chokage!","translation":"あのアニメは可愛いキャラクターでいっぱいだから、マジでチョカゲがヤバい！"},{"sentence":"The sheer moe-ness of this manga is giving me chokage.","translation":"この漫画の萌え要素が強すぎて、チョカゲを感じる。"}],"collocations":["feel chokage","get chokage","experience chokage","intense chokage","serious chokage"],"synonyms":["overwhelmed","suffocated","smothered","flooded","bombarded"],"antonyms":["unaffected","unmoved","unimpressed"]}],"etymology":{"value":"A portmanteau of the words 'choke' (to suffocate) and 'image' (referring to a visual stimulus), suggesting a feeling of being overwhelmed to the point of being unable to breathe due to the intensity of the visual appeal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃoʊkɪdʒ/","syllables":"Cho-kage"},"inflection":{"noun_plural":"Chokages"},"usage_notes":{"explanation":"'Chokage' is primarily used in online communities and forums related to anime, manga, and similar interests. It is a relatively new slang term and may not be widely understood outside of these specific contexts. The term is often used humorously or hyperbolically to express a strong positive reaction to something considered cute or attractive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I chokaged when I saw the sunset.","correct":"✓ I felt chokage when I saw the sunset.","note":"'Chokage' is a noun, not a verb. You 'feel chokage' or 'get chokage', but you don't 'chokage' something."},{"incorrect":"✗ He's suffering from chokage because he's sad.","correct":"✓ He's feeling chokage because the anime is too cute.","note":"'Chokage' is specifically related to being overwhelmed by cuteness or attractiveness, not general sadness or distress."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_slang":["moe","kawaii","doki-doki","kyun"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Very low frequency (primarily used in online communities)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chokage' is a slang term primarily used within specific online communities related to anime, manga, and similar interests. Understanding the term requires familiarity with internet slang and the cultural context of these communities. It describes a feeling of being overwhelmed by the cuteness or attractiveness of something, often to a humorous or exaggerated degree. Due to its niche usage, it is not a term typically encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The overwhelming cuteness of the characters in that anime gave me intense chokage.","translation":"あのアニメのキャラクターの圧倒的な可愛さで、強烈なチョカゲを感じた。","type":"noun","meaning_category":"Feeling overwhelmed by cuteness"},{"sentence":"I'm experiencing serious chokage from all the adorable cat pictures online.","translation":"ネット上の可愛すぎる猫の写真のせいで、チョカゲがヤバい。","type":"noun","meaning_category":"Feeling overwhelmed by cuteness"},{"sentence":"The moe overload in this manga is giving me chokage.","translation":"この漫画の萌え要素過多で、チョカゲを感じる。","type":"noun","meaning_category":"Feeling overwhelmed by cuteness"}]}