{"word":"epigean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地上性の、地表生の","english_definition":"Living or growing above the surface of the earth.","examples":[{"sentence":"Epigean plants are those that grow above ground.","translation":"地上生植物とは、地上で育つ植物のことです。"},{"sentence":"Many insects are epigean, living in the leaf litter on the forest floor.","translation":"多くの昆虫は地上性で、森林の地面の落ち葉の中で生息しています。"}],"collocations":["epigean habitat","epigean fauna","epigean flora"],"synonyms":["terrestrial","surface-dwelling"],"antonyms":["hypogean","subterranean"]}],"etymology":{"value":"From Greek 'epi' (upon, above) + 'gaia' (earth, land).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˈdʒiːən/","syllables":"ep-i-ge-an"},"inflection":{"notes":"Comparative and superlative forms are 'more epigean' and 'most epigean', respectively, as it is not a gradable adjective in the traditional sense."},"usage_notes":{"explanation":"'Epigean' is primarily used in biological and ecological contexts to describe organisms or features associated with the surface of the earth. It is often contrasted with 'hypogean', which refers to things below the surface.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epigean building was very tall.","correct":"✓ The tall building stood on the earth.","note":"'Epigean' is generally not used to describe structures, but rather living organisms or natural features."}],"priority":"★★☆"},"related_words":{"derivatives":["epigeal (adjective): similar meaning to epigean, sometimes used interchangeably.","epigeic (adjective): living on the surface of the soil."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epigean' is a technical term used in biology and ecology to describe things that live or grow on the surface of the earth. It's not a common word in everyday language. You'll mostly find it in scientific articles or textbooks. It is the opposite of 'hypogean', which means living or growing underground."},"example_sentences":[{"sentence":"The study focused on the diversity of epigean arthropods in the rainforest.","translation":"その研究は、熱帯雨林における地上性節足動物の多様性に焦点を当てた。","type":"adjective","meaning_category":"地上性の"},{"sentence":"Epigean fungi play a crucial role in the decomposition of organic matter on the forest floor.","translation":"地上性の菌類は、森林の地面における有機物の分解において重要な役割を果たしている。","type":"adjective","meaning_category":"地表生の"}]}