{"word":"refractiveness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"屈折率、屈折性","english_definition":"The property of a material that determines the amount of refraction of light or other electromagnetic radiation passing through it; the refractive index.","examples":[{"sentence":"The refractiveness of diamond is very high, which is why it sparkles so much.","translation":"ダイヤモンドの屈折率は非常に高く、それが非常に輝く理由です。"},{"sentence":"Different materials have different refractiveness values.","translation":"異なる材料は異なる屈折率の値を持っています。"},{"sentence":"The refractiveness of the lens is carefully controlled to focus the light.","translation":"レンズの屈折率は、光を焦点を合わせるために慎重に制御されています。"}],"collocations":["high refractiveness","low refractiveness","measure refractiveness","refractiveness index","optical refractiveness"],"synonyms":["refractive index","refraction","dioptric power"],"antonyms":["transparency","transmission"]}],"etymology":{"value":"Derived from 'refractive', which comes from 'refract'. 'Refract' originates from the Latin 'refractus', the past participle of 'refringere', meaning 'to break back' or 'to bend back'. This refers to the bending of light as it passes from one medium to another.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfræktɪvnəs/","syllables":"re-frac-tive-ness"},"inflection":{"noun_plural":"refractivenesses (rarely used)"},"usage_notes":{"explanation":"'Refractiveness' is a technical term primarily used in physics, optics, and materials science. It refers specifically to the degree to which a substance bends light (or other electromagnetic radiation). The term is often used interchangeably with 'refractive index', although 'refractive index' is the more common and precise term. It is a scalar quantity, meaning it has magnitude but no direction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refractiveness is measured in meters.","correct":"✓ The refractiveness is measured as a dimensionless number (refractive index).","note":"Refractiveness, when expressed as the refractive index, is a dimensionless number. It's a ratio of the speed of light in a vacuum to its speed in the substance."},{"incorrect":"✗ High refractiveness means the material is very transparent.","correct":"✓ High refractiveness means the material bends light strongly.","note":"High refractiveness indicates that light is bent significantly as it passes through the material, not that the material is highly transparent. Transparency refers to how much light passes through without being absorbed or scattered."}],"priority":"★★☆"},"related_words":{"derivatives":["refract (verb)","refraction (noun)","refractive (adjective)","refractive index (noun)"],"related_terms":["optics","photonics"," Snell's law","lens","prism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refractiveness' is a technical term used in science, especially physics and optics. It describes how much a material bends light. A higher refractiveness means the light bends more. This word is usually found in scientific texts or discussions about lenses, prisms, and other optical devices. It is closely related to the term 'refractive index', which is the numerical value representing refractiveness."},"example_sentences":[{"sentence":"The high **refractiveness** of the crystal allows it to split light into its constituent colors.","translation":"その結晶の高い屈折率により、光を構成する色に分割することができます。","type":"noun","meaning_category":"屈折率"},{"sentence":"Scientists are studying the **refractiveness** of new materials for advanced lens designs.","translation":"科学者たちは、高度なレンズ設計のための新しい材料の屈折率を研究しています。","type":"noun","meaning_category":"屈折率"},{"sentence":"Changes in temperature can affect the **refractiveness** of certain liquids.","translation":"温度の変化は、特定の液体の屈折率に影響を与える可能性があります。","type":"noun","meaning_category":"屈折率"}]}