{"word":"speecher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ)演説者、話者","english_definition":"(rare) A person who makes a speech; a speaker.","examples":[{"sentence":"He was known as a powerful speecher, captivating audiences with his words.","translation":"彼は力強い演説者として知られ、その言葉で聴衆を魅了した。"},{"sentence":"The speecher addressed the crowd with passion and conviction.","translation":"演説者は情熱と信念をもって群衆に語りかけた。"}],"collocations":["powerful speecher","eloquent speecher","gifted speecher"],"synonyms":["speaker","orator","rhetorician","lecturer"],"antonyms":["listener","audience"]}],"etymology":{"value":"\"Speecher\" is derived from the word \"speech\" with the addition of the suffix \"-er,\" indicating a person who performs the action of speaking or giving a speech.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspiːtʃər/","syllables":"speech-er"},"inflection":{"noun_plural":"speechers"},"usage_notes":{"explanation":"The term \"speecher\" is not commonly used in modern English. The more standard and widely accepted term is \"speaker.\" \"Speecher\" might be encountered in older texts or in contexts where a more emphatic or archaic tone is desired. It specifically refers to someone who delivers speeches, often with skill or authority.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The speecher was very good at speak.","correct":"✓ The speecher was very good at speaking.","note":"The correct form after 'at' is the gerund (speaking), not the base form of the verb."},{"incorrect":"✗ He is a speecher in the conference.","correct":"✓ He is a speaker at the conference.","note":"\"Speaker\" is the more common and natural word choice."}],"priority":"★★☆"},"related_words":{"derivatives":["speech","speak","speaking"],"related_concepts":["oratory","rhetoric","public speaking"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Speecher\" is an uncommon and somewhat archaic term for a speaker. It is not part of everyday vocabulary and is more likely to be encountered in literary or historical contexts. The more common and preferred term is \"speaker.\""},"example_sentences":[{"sentence":"The old manuscript referred to him as a skilled speecher.","translation":"その古い原稿は彼を熟練した演説者として言及していた。","type":"noun","meaning_category":"演説者"},{"sentence":"In the historical account, the speecher rallied the troops before the battle.","translation":"歴史的記録では、演説者は戦闘前に軍隊を鼓舞した。","type":"noun","meaning_category":"演説者"}]}