{"word":"pulpers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A machine or device used to pulp something, especially in papermaking or food processing.","english_definition":"plural of pulper: A machine or device used to pulp something, especially in papermaking or food processing.","examples":[{"sentence":"The factory uses several pulpers to process the wood into paper pulp.","translation":"その工場では、木材を紙パルプに加工するために、複数のパルパーを使用しています。"},{"sentence":"Modern fruit pulpers can efficiently separate the pulp from the seeds and skin.","translation":"現代のフルーツパルパーは、果肉を種や皮から効率的に分離できます。"}],"collocations":["wood pulpers","fruit pulpers","industrial pulpers"],"synonyms":["pulping machine","macerator","grinder"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'pulp' (to reduce to a pulp) with the agent suffix '-er'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpʌlpərz/","syllables":"pul-pers"},"inflection":{"noun_plural":"pulpers"},"usage_notes":{"explanation":"'Pulpers' refers to multiple machines or devices designed to turn materials into pulp. This term is commonly used in the context of paper manufacturing, where wood is pulped to create paper, and in the food industry, where fruits and vegetables are pulped for various products.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["pulp","pulped","pulping"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"The word 'pulpers' is a technical term, mostly used in industrial or manufacturing contexts. It refers to machines that convert materials into pulp. Understanding the word requires knowledge of the process of pulping, which is common in paper and food production."},"example_sentences":[{"sentence":"The company invested in new pulpers to increase production capacity.","translation":"その会社は生産能力を増強するために、新しいパルパーに投資しました。","type":"noun","meaning_category":"Machines for pulping"},{"sentence":"Different types of pulpers are used for various materials, such as wood, fruits, and vegetables.","translation":"木材、果物、野菜など、さまざまな材料に対して異なる種類のパルパーが使用されます。","type":"noun","meaning_category":"Machines for pulping"}]}