{"word":"Heterogenesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異種生殖、自然発生説","english_definition":"The obsolete concept that living organisms can arise from nonliving matter. Also known as spontaneous generation.","examples":[{"sentence":"The theory of heterogenesis was disproven by Louis Pasteur's experiments.","translation":"異種生殖説は、ルイ・パスツールの実験によって反証された。"}],"collocations":["disprove heterogenesis","support heterogenesis"],"synonyms":["spontaneous generation","abiogenesis"],"antonyms":["biogenesis"]}],"etymology":{"value":"From the Greek words 'heteros' (ἕτερος) meaning 'other' or 'different' and 'genesis' (γένεσις) meaning 'origin' or 'creation'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈdʒɛnɪsɪs/","syllables":"het-er-o-gen-e-sis"},"inflection":{"noun_plural":"heterogeneses"},"usage_notes":{"explanation":"'Heterogenesis' is a largely obsolete term referring to the idea that life can arise from non-living matter. It is primarily used in historical contexts when discussing the development of scientific understanding about the origin of life. It's important to note that while 'abiogenesis' is sometimes used synonymously, it more accurately refers to the scientific hypothesis of life arising from simple organic compounds through natural processes, not from fully formed non-living matter.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heterogenesis is the same as evolution.","correct":"✓ Heterogenesis is an outdated theory about the origin of life, while evolution describes how life changes over time.","note":"Heterogenesis refers to the disproven idea of life arising from non-living matter, while evolution refers to the change in heritable characteristics of biological populations over successive generations."}],"priority":"★★☆"},"related_words":{"derivatives":["heterogenetic","heterogenic"],"related_terms":["abiogenesis","biogenesis","spontaneous generation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heterogenesis' is a scientific term referring to the outdated idea that living things can come from non-living things. It's mostly used when talking about the history of science and how we used to think about where life comes from. This idea has been proven wrong by modern science. The word itself comes from Greek roots, meaning 'different origin.'"},"example_sentences":[{"sentence":"The belief in heterogenesis persisted for centuries before being challenged by scientific experiments.","translation":"異種生殖の信念は、科学的な実験によって異議が唱えられるまで何世紀も続いた。","type":"general","meaning_category":"異種生殖説"},{"sentence":"Pasteur's experiments were crucial in disproving the theory of heterogenesis.","translation":"パスツールの実験は、異種生殖説を反証する上で非常に重要だった。","type":"historical","meaning_category":"異種生殖説"}]}