{"word":"preaffirmation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学)自己肯定感を高めるために、あらかじめ肯定的な自己暗示や宣言を行うこと。","english_definition":"The act of stating or affirming something positive about oneself in advance, typically to boost self-esteem or confidence. It is often used in psychology and self-help contexts.","examples":[{"sentence":"Practicing preaffirmation each morning helped her approach challenges with greater confidence.","translation":"毎朝、プレアファメーションを実践することで、彼女はより自信を持って課題に取り組むことができた。"},{"sentence":"He used preaffirmation techniques to overcome his fear of public speaking.","translation":"彼は人前で話すことへの恐怖を克服するために、プレアファメーションのテクニックを使った。"},{"sentence":"The therapist recommended preaffirmation as a way to combat negative self-talk.","translation":"セラピストは、ネガティブなセルフトークに対抗する方法として、プレアファメーションを勧めた。"}],"collocations":["practice preaffirmation (プレアファメーションを実践する)","use preaffirmation techniques (プレアファメーションのテクニックを使う)","daily preaffirmation (毎日のプレアファメーション)","positive preaffirmation (肯定的なプレアファメーション)"],"synonyms":["positive self-talk","self-affirmation","affirmation","positive affirmation"],"antonyms":["negative self-talk","self-criticism","negative affirmation"]}],"etymology":{"value":"「pre-」（前もって）+ 「affirmation」（肯定、断言）から構成される。肯定的なことを前もって宣言するという意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˌæfərˈmeɪʃən/","syllables":"pre-af-fir-ma-tion"},"inflection":{"noun_plural":"preaffirmations"},"usage_notes":{"explanation":"「**preaffirmation**」は、心理学や自己啓発の分野で使われる比較的新しい言葉です。自己肯定感を高めるために、目標達成や困難に立ち向かう前に、あらかじめ肯定的な自己暗示や宣言を行うことを指します。これは、潜在意識に働きかけ、自信を高め、行動を促す効果があるとされています。肯定的なセルフトークやアファメーションと似た概念ですが、「pre-」という接頭辞が示すように、行動やイベントの前に特に意識的に行う点が強調されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a preaffirmation for his exam after he finished it.","correct":"✓ He did a preaffirmation for his exam before he started it.","note":"プレアファメーションは試験が終わった後ではなく、始める前に行うべきです。"},{"incorrect":"✗ Preaffirmation is the same as positive thinking, so it's not very useful.","correct":"✓ Preaffirmation, as a structured form of positive self-talk, can be a useful tool for boosting confidence.","note":"プレアファメーションは、単なるポジティブ思考よりも構造化された自己暗示であり、自信を高めるための有効なツールとなり得ます。"},{"incorrect":"✗ Just doing preaffirmation will guarantee success.","correct":"✓ Preaffirmation can help boost confidence, but it needs to be combined with effort and preparation.","note":"プレアファメーションは自信を高めるのに役立ちますが、努力や準備と組み合わせる必要があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["preaffirmed (形容詞: あらかじめ肯定された)"],"phrasal_verbs":[],"related_concepts":["affirmation","self-affirmation","positive psychology","cognitive behavioral therapy (CBT)","self-esteem","self-confidence"]},"level_frequency":{"CEFR":"C2 (専門的な文脈で使用される)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**preaffirmation**」は、心理学や自己啓発で使われる言葉で、何かをする前に、自分のことを良い言葉で言い聞かせることです。例えば、テストを受ける前に「私はできる！」と心の中で言うことです。これは、自信を高めて、うまくいくように助けると考えられています。少し難しい言葉ですが、意味を理解しておくと、心理学の本や記事を読むときに役立ちます。"},"example_sentences":[{"sentence":"Before the presentation, she took a moment for **preaffirmation**, telling herself she was prepared and capable.","translation":"プレゼンテーションの前に、彼女は少し時間を取ってプレアファメーションを行い、自分は準備万端で有能だと自分に言い聞かせた。","type":"noun","meaning_category":"自己暗示"},{"sentence":"The coach encouraged the athletes to use **preaffirmation** techniques to improve their performance.","translation":"コーチは、選手たちのパフォーマンスを向上させるために、プレアファメーションのテクニックを使うように勧めた。","type":"noun","meaning_category":"自己暗示"},{"sentence":"Through consistent **preaffirmation**, he gradually overcame his anxiety and gained more self-assurance.","translation":"一貫したプレアファメーションを通じて、彼は徐々に不安を克服し、より自信を持つようになった。","type":"noun","meaning_category":"自己暗示"}]}