{"word":"anatexes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"plural of anatexis: the melting of pre-existing rock within the Earth to generate magma.","english_definition":"The plural form of anatexis, which refers to the melting of pre-existing rock within the Earth to generate magma.","examples":[{"sentence":"The formation of granitic magmas often involves anatexes of crustal rocks.","translation":"花崗岩質マグマの形成には、地殻岩のアナテクシスが関与することが多い。"},{"sentence":"Studies of anatexes help us understand the processes of crustal evolution.","translation":"アナテクシスの研究は、地殻進化の過程を理解するのに役立つ。"}],"collocations":["crustal anatexes","partial anatexes","magma generation by anatexes"],"synonyms":["melting","fusion","magmagenesis"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀνάτηξις (anátēxis, \"melting\"), from ἀνατήκω (anatḗkō, \"I melt\"), from ἀνά (aná, \"up\") + τήκω (tḗkō, \"I melt\").","priority":"★★☆"},"pronunciation":{"ipa":"/əˈnætɛksiːz/","syllables":"a-na-tex-es"},"inflection":{"noun_plural":"anatexes"},"usage_notes":{"explanation":"The term 'anatexes' is primarily used in geology and petrology to describe the process or instances of rock melting within the Earth's crust. It is often associated with the formation of granitic magmas and the evolution of continental crust.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ anatexis (plural)","correct":"✓ anatexes","note":"The plural of anatexis is anatexes."}],"priority":"★☆☆"},"related_words":{"derivatives":["anatectic (adjective: relating to or formed by anatexis)"],"phrasal_verbs":[],"related_terms":["magma","granite","partial melting","crustal evolution"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized geological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anatexes' is a highly specialized term used in geology, specifically in the study of petrology and crustal evolution. It refers to multiple instances of the process of anatexis, which is the melting of pre-existing rocks within the Earth's crust to form magma. Understanding this term requires a background in geological sciences."},"example_sentences":[{"sentence":"Different types of protoliths will yield different magma compositions upon undergoing anatexes.","translation":"異なる種類の原岩は、アナテクシスを受けると異なるマグマ組成を生み出す。","type":"noun","meaning_category":"geology"},{"sentence":"The study of anatexes provides insights into the thermal and compositional evolution of the Earth's crust.","translation":"アナテクシスの研究は、地球の地殻の熱的および組成的な進化に関する洞察を提供する。","type":"noun","meaning_category":"geology"}]}