{"word":"turboexciter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ターボ励磁機","english_definition":"A type of electrical generator used to provide excitation current to the main generator in a power plant. It is typically driven by a steam turbine.","examples":[{"sentence":"The turboexciter ensures a stable voltage output from the main generator.","translation":"ターボ励磁機は、主発電機からの安定した電圧出力を保証します。"},{"sentence":"The power plant uses a turboexciter to supply the field current to the main generator.","translation":"その発電所は、ターボ励磁機を使用して、主発電機に界磁電流を供給します。"}],"collocations":["turboexciter system","turboexciter control","turboexciter maintenance"],"synonyms":["exciter","generator","turbine-driven exciter"],"antonyms":[]}],"etymology":{"value":"'Turbo-' refers to the turbine drive, and 'exciter' refers to the electrical generator that provides the excitation current.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɜːrboʊɪkˌsaɪtər/","syllables":"tur-bo-ex-ci-ter"},"inflection":{"noun_plural":"turboexciters"},"usage_notes":{"explanation":"A turboexciter is a specialized generator used in power plants to supply the direct current needed to create a magnetic field in the main generator. This magnetic field is essential for the main generator to produce electricity.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["excitation","turbine","generator"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'turboexciter' is a technical term specific to the field of electrical power generation. It refers to a device that provides the excitation current to the main generator in a power plant. Understanding this term requires a background in electrical engineering or power plant operations."},"example_sentences":[{"sentence":"The efficiency of the turboexciter is crucial for the overall performance of the power plant.","translation":"ターボ励磁機の効率は、発電所全体の性能にとって非常に重要です。","type":"noun","meaning_category":"ターボ励磁機"},{"sentence":"Regular maintenance of the turboexciter helps prevent unexpected shutdowns.","translation":"ターボ励磁機の定期的なメンテナンスは、予期せぬ停止を防ぐのに役立ちます。","type":"noun","meaning_category":"ターボ励磁機"}]}