{"word":"quadrigeminum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"四丘体","english_definition":"A structure in the midbrain of vertebrates that is composed of four colliculi, two superior and two inferior, and is involved in auditory and visual reflexes.","examples":[{"sentence":"The superior colliculi of the quadrigeminum are involved in visual processing.","translation":"四丘体の上丘は視覚処理に関与している。"},{"sentence":"The inferior colliculi of the quadrigeminum play a role in auditory reflexes.","translation":"四丘体の下丘は聴覚反射において役割を果たす。"}],"collocations":["superior colliculus (上丘)","inferior colliculus (下丘)","midbrain (中脳)","visual reflex (視覚反射)","auditory reflex (聴覚反射)"],"synonyms":["tectum"],"antonyms":[]}],"etymology":{"value":"From Latin *quadri-* (four) + *geminus* (twin), referring to the four colliculi (two superior and two inferior).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɑːdrɪdʒəˈmɪnəm/","syllables":"qua-dri-ge-mi-num"},"inflection":{"noun_plural":"quadrigemina"},"usage_notes":{"explanation":"The term *quadrigeminum* is primarily used in neuroanatomy and neurophysiology. It refers to a specific structure in the midbrain that is essential for processing auditory and visual information and coordinating reflexes. The superior colliculi are involved in visual attention and eye movements, while the inferior colliculi are part of the auditory pathway.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ quadrigemina is a single structure.","correct":"✓ quadrigeminum is a single structure consisting of four colliculi.","note":"quadrigeminum is a singular noun referring to the entire structure, while quadrigemina is the plural form."},{"incorrect":"✗ The quadrigeminum is located in the forebrain.","correct":"✓ The quadrigeminum is located in the midbrain.","note":"The quadrigeminum is specifically located in the midbrain, not the forebrain or hindbrain."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["colliculus","superior colliculus","inferior colliculus","tectum","midbrain","brainstem"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *quadrigeminum* is highly specialized and primarily used in advanced studies of neuroanatomy and neurophysiology. Understanding requires familiarity with brain structures and their functions. The word's etymology and precise meaning are crucial for accurate usage in scientific contexts."},"example_sentences":[{"sentence":"Lesions in the quadrigeminum can affect visual and auditory reflexes.","translation":"四丘体の病変は視覚および聴覚反射に影響を与える可能性がある。","type":"scientific","meaning_category":"neuroanatomy"},{"sentence":"The quadrigeminum plays a critical role in orienting responses to sensory stimuli.","translation":"四丘体は感覚刺激に対する定位反応において重要な役割を果たす。","type":"scientific","meaning_category":"neurophysiology"}]}