{"word":"coincorporate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(企業などが)共同で設立する、合併して設立する","english_definition":"To incorporate jointly or together; to form a company or organization by combining with another or others.","examples":[{"sentence":"The two companies decided to coincorporate a new subsidiary to handle overseas operations.","translation":"その二つの会社は、海外事業を扱う新しい子会社を共同で設立することを決定した。"},{"sentence":"They plan to coincorporate their existing businesses into a single, more efficient entity.","translation":"彼らは既存の事業を合併して、より効率的な単一の組織を設立することを計画している。"}],"collocations":["coincorporate a subsidiary (子会社を共同設立する)","coincorporate businesses (事業を合併して設立する)","coincorporate assets (資産を共同で組み込む)"],"synonyms":["merge","consolidate","amalgamate","combine","integrate"],"antonyms":["separate","divide","dissolve"]}],"etymology":{"value":"The word \"coincorporate\" is formed by combining the prefix \"co-\" (meaning together, jointly) with the verb \"incorporate\" (meaning to form a corporation or company).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɪnˈkɔːrpəreɪt/","syllables":"co-in-cor-po-rate"},"inflection":{"verb_forms":{"present_simple":["coincorporate","coincorporates"],"past_simple":"coincorporated","past_participle":"coincorporated","present_participle":"coincorporating"}},"usage_notes":{"explanation":"\"Coincorporate\" is a relatively rare and formal term primarily used in business and legal contexts. It specifically refers to the act of forming a new corporation or organization through the joint effort or merger of two or more existing entities. It emphasizes the collaborative aspect of the incorporation process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They coincorporate the building.","correct":"✓ They coincorporate their businesses.","note":"\"Coincorporate\" typically applies to the formation of a business entity, not physical assets like buildings."},{"incorrect":"✗ The company is coincorporated.","correct":"✓ The company was coincorporated.","note":"Ensure the correct tense is used to indicate when the action of coincorporating took place."}],"priority":"★☆☆"},"related_words":{"derivatives":["coincorporation (名詞: 共同設立、合併設立)"],"phrasal_verbs":[],"related_terms":["incorporate","joint venture","merger","consolidation","affiliation","partnership"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的なビジネス・法律用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"coincorporate\" is a specialized term used in business and legal contexts. It describes the act of two or more entities jointly forming a new corporation or organization. This term is not commonly used in everyday language and is more likely to be encountered in formal documents or discussions related to corporate law and business strategy."},"example_sentences":[{"sentence":"The two tech startups decided to coincorporate their innovative technologies into a single, powerful platform.","translation":"その二つのテック系スタートアップ企業は、それぞれの革新的な技術を統合して、強力な単一のプラットフォームを共同で設立することに決めた。","type":"verb (vt)","meaning_category":"共同で設立する"},{"sentence":"By coincorporating their resources, the companies aimed to achieve greater market share and efficiency.","translation":"資源を共同で組み込むことで、その企業はより大きな市場シェアと効率性を達成することを目指した。","type":"verb (vt)","meaning_category":"合併して設立する"}]}