{"word":"vills","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic, plural of vill) villages, especially in historical or geographical contexts.","english_definition":"Plural form of 'vill,' referring to villages, especially in historical or geographical contexts. A 'vill' is an administrative unit, typically a village or a group of houses, in medieval England and other European countries.","examples":[{"sentence":"The Domesday Book recorded the number of vills in each shire.","translation":"ドゥームズデイ・ブックは各州の村の数を記録した。"},{"sentence":"Many of the vills along the river were destroyed during the war.","translation":"川沿いの多くの村は戦争中に破壊された。"}],"collocations":["rural vills","ancient vills","Domesday vills"],"synonyms":["villages","hamlets","settlements"],"antonyms":["cities","metropolises"]}],"etymology":{"value":"Derived from 'vill,' which comes from the Latin word 'villa,' originally referring to a country house or estate. In medieval times, it came to denote a rural settlement or village.","priority":"★★☆"},"pronunciation":{"ipa":"/vɪlz/","syllables":"vills"},"inflection":{"noun_plural":"vills"},"usage_notes":{"explanation":"'Vills' is primarily used in historical or geographical discussions, particularly when referring to medieval England or other parts of Europe where the 'vill' was a recognized administrative unit. It is not commonly used in modern, everyday English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vills are very big and modern.","correct":"✓ The villages are very big and modern.","note":"Use 'villages' instead of 'vills' in contemporary contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["vill (singular form)","villein (a feudal tenant, associated with a vill)","village"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'vills' is specialized and primarily used in historical or academic contexts, specifically when discussing medieval administrative divisions. It refers to villages, especially in historical records or geographical studies. Due to its limited usage, it is not part of common vocabulary. Understanding requires familiarity with historical terminology and contexts."},"example_sentences":[{"sentence":"The historian studied the distribution of vills in the region during the 14th century.","translation":"歴史家は14世紀の地域における村の分布を研究した。","type":"noun","meaning_category":"villages (historical context)"},{"sentence":"The survey identified several abandoned vills in the remote countryside.","translation":"調査により、遠隔地の田舎にいくつかの放棄された村が確認された。","type":"noun","meaning_category":"villages (historical context)"}]}