{"word":"Jackstones","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) おはじき (遊び)","english_definition":"A game played with a number of small objects (usually six) and a ball, in which the objects are tossed, caught, and manipulated in various ways. The small objects themselves are also called jackstones.","examples":[{"sentence":"The children were playing jackstones on the playground.","translation":"子供たちは運動場でおはじきをして遊んでいた。"},{"sentence":"She was very good at playing jackstones.","translation":"彼女はおはじきをするのがとても上手だった。"}],"collocations":["play jackstones","a game of jackstones"],"synonyms":["knucklebones","jacks"],"antonyms":[]},{"part_of_speech":"noun","definition":"(単数形: Jackstone) おはじき (道具)","english_definition":"One of the small, usually six-pointed metal or plastic pieces used in the game of jackstones.","examples":[{"sentence":"She picked up a jackstone and tossed it into the air.","translation":"彼女はおはじきを一つ拾い上げて空中に投げた。"},{"sentence":"The jackstone was made of metal.","translation":"そのおはじきは金属製だった。"}],"collocations":["a set of jackstones"],"synonyms":["jack"],"antonyms":[]}],"etymology":{"value":"The term \"jackstones\" is derived from the game originally being played with small stones. The \"jack\" part likely comes from a generic term for a small object or a common name.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒækˌstoʊnz/","syllables":"Jack-stones"},"inflection":{"noun_plural":"Jackstones (already plural in common usage, singular form is Jackstone)"},"usage_notes":{"explanation":"\"Jackstones\" refers to both the game and the individual pieces used in the game. The singular form, \"jackstone\", is used to refer to one of the pieces. The game is also known as \"jacks\" or \"knucklebones\" in some regions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to play jackstone.","correct":"✓ I want to play jackstones.","note":"Since it's a game played with multiple pieces, it's generally referred to in the plural form, even when talking about playing the game in general."},{"incorrect":"✗ She has a jackstones in her pocket.","correct":"✓ She has a jackstone in her pocket.","note":"If referring to a single piece, use the singular form 'jackstone'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_games":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Jackstones\" is a game played with small objects and a ball. The small objects themselves are also called jackstones. It's a traditional game, so it might not be as common in modern times. The singular form, \"jackstone,\" refers to one of the small objects used in the game. The game involves tossing, catching, and manipulating the objects in different ways."},"example_sentences":[{"sentence":"The girls sat on the porch, playing **jackstones**.","translation":"少女たちは玄関のポーチに座って、おはじきをして遊んでいた。","type":"noun","meaning_category":"game"},{"sentence":"She carefully arranged the **jackstones** on the ground before starting her turn.","translation":"彼女は自分の番を始める前に、地面におはじきを丁寧に並べた。","type":"noun","meaning_category":"game pieces"},{"sentence":"He found a single **jackstone** in the sandbox.","translation":"彼は砂場で一つのおはじきを見つけた。","type":"noun","meaning_category":"single game piece"}]}