{"word":"mourningly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"悲しげに、喪に服して、嘆き悲しんで","english_definition":"in a manner expressing grief or sorrow; in a way that shows mourning.","examples":[{"sentence":"She looked at the old photograph mourningly, tears welling up in her eyes.","translation":"彼女は悲しげに古い写真を見つめ、目に涙を浮かべた。"},{"sentence":"The dog howled mourningly after its owner left.","translation":"犬は飼い主が出かけた後、悲しげに遠吠えした。"},{"sentence":"The song played mourningly on the radio, a lament for lost love.","translation":"その歌はラジオで悲しげに流れ、失われた愛への哀歌だった。"}],"collocations":["look mourningly","speak mourningly","play mourningly","sing mourningly","cry mourningly","howl mourningly"],"synonyms":["sadly","sorrowfully","grief-strickenly","lamentingly","wistfully","plaintively"],"antonyms":["joyfully","happily","cheerfully","gleefully"]}],"etymology":{"value":"The word \"mourningly\" is derived from the word \"mourning\" which comes from the Old English word \"murnan\" meaning \"to grieve, mourn.\" The suffix \"-ly\" is added to form an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔːrnɪŋli/","syllables":"mourn-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms."},"usage_notes":{"explanation":"The adverb \"mourningly\" describes actions or states that are performed or experienced in a way that expresses deep sorrow or grief, often associated with the loss of someone or something. It suggests a visible or audible expression of sadness. It is often used to describe how someone looks, speaks, or behaves when they are grieving.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She mourning looked at the photo.","correct":"✓ She looked mourningly at the photo.","note":"The adverb 'mourningly' usually comes after the verb it modifies, or at the beginning of the sentence for emphasis."},{"incorrect":"✗ He was mourning.","correct":"✓ He was mourning the loss. / ✓ He acted mourningly.","note":"'Mourning' is a verb or a noun. 'Mourningly' is the adverb to describe the manner in which someone acts."}],"priority":"★☆☆"},"related_words":{"derivatives":["mourn (verb)","mourner (noun)","mournful (adjective)","mourning (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mourningly' is an adverb that describes something done in a way that shows deep sadness or grief, often related to the loss of someone. It's not a very common word, so it's more likely to be found in literature or more formal writing when the author wants to emphasize the sorrowful manner in which something is done or expressed. For example, 'She sighed mourningly as she remembered her childhood friend.'"},"example_sentences":[{"sentence":"The church bells tolled mourningly, signaling the passing of the beloved leader.","translation":"教会の鐘が悲しげに鳴り響き、敬愛された指導者の逝去を告げた。","type":"adverb","meaning_category":"Expressing grief"},{"sentence":"He shook his head mourningly, regretting his past mistakes.","translation":"彼は過去の過ちを後悔し、悲しげに首を横に振った。","type":"adverb","meaning_category":"Expressing regret"},{"sentence":"The wind whispered mourningly through the trees, as if lamenting the end of summer.","translation":"風が木々の間を悲しげに囁き、まるで夏の終わりを嘆いているかのようだった。","type":"adverb","meaning_category":"Evoking sadness"}]}