{"word":"pursership","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(船の)会計係の職、会計係の地位","english_definition":"The position or office of a purser on a ship.","examples":[{"sentence":"He applied for the pursership on the cruise liner.","translation":"彼はそのクルーズ客船の会計係の職に応募した。"},{"sentence":"The pursership was a responsible position, handling all the ship's finances.","translation":"会計係の地位は、船のすべての財政を管理する責任ある地位だった。"}],"collocations":["apply for a pursership","hold a pursership","the ship's pursership"],"synonyms":["ship's accountant","financial officer (on a ship)"],"antonyms":[]}],"etymology":{"value":"\"Purser\" + \"-ship\".  \"Purser\" comes from Middle English \"purser,\" from Old French \"borsier\" (purse-bearer), from Medieval Latin \"bursarius,\" from Late Latin \"bursa\" (purse). The suffix \"-ship\" denotes a state, condition, office, or function.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɜːrsərˌʃɪp","syllables":"pur-ser-ship"},"inflection":{"noun_plural":"purserships"},"usage_notes":{"explanation":"\"Pursership\" specifically refers to the job or rank of a purser, typically on a ship. A purser is responsible for handling money, accounts, and sometimes passenger-related matters. The term is not commonly used outside of maritime or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good pursership.","correct":"✓ He holds a pursership. / ✓ He has the pursership.","note":"The word refers to the position itself, not a quality. Use verbs like 'hold' or 'have' to describe someone occupying the position."}],"priority":"★★☆"},"related_words":{"derivatives":["purser"],"related_terms":["ship","maritime","finance","accounting"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pursership\" is a specialized term primarily used in maritime contexts. It refers to the position or office held by a purser on a ship, who is responsible for financial and administrative duties. Due to its specific usage and limited applicability outside of nautical or historical discussions, it is considered advanced vocabulary. Understanding the term requires familiarity with maritime professions and shipboard operations."},"example_sentences":[{"sentence":"The responsibilities of the pursership included managing the ship's payroll and passenger accounts.","translation":"会計係の責任には、船の給与計算と乗客の口座の管理が含まれていた。","type":"general","meaning_category":"職務内容"},{"sentence":"Gaining the pursership was a significant step in his naval career.","translation":"会計係の地位を得ることは、彼の海軍でのキャリアにおいて重要な一歩だった。","type":"career","meaning_category":"キャリア"}]}