{"word":"manufatto","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"人工物、加工品、製造品","english_definition":"An object made by a human being, typically one of cultural or historical interest.","examples":[{"sentence":"Il museo espone una vasta collezione di manufatti antichi.","translation":"The museum displays a vast collection of ancient artifacts."},{"sentence":"Questo manufatto è un esempio eccezionale dell'artigianato locale.","translation":"This artifact is an exceptional example of local craftsmanship."}],"collocations":["manufatto archeologico (archeological artifact)","manufatto artistico (artistic artifact)","manufatto culturale (cultural artifact)","manufatto storico (historical artifact)"],"synonyms":["artefatto","oggetto","prodotto","creazione"],"antonyms":["naturale","grezzo"]}],"etymology":{"value":"Dal latino 'manu factus', che significa 'fatto a mano'. Composto da 'manu' (con la mano) e 'factus' (fatto, participio passato di 'facere' - fare).","priority":"★★☆"},"pronunciation":{"ipa":"/manuˈfatto/","syllables":"ma-nu-fat-to"},"inflection":{"noun_plural":"manufatti"},"usage_notes":{"explanation":"'Manufatto' si riferisce a un oggetto creato dall'uomo, spesso con un significato culturale, storico o artistico. Si distingue dagli oggetti naturali per il fatto di essere il risultato di un processo di lavorazione o creazione umana. Il termine può essere utilizzato in vari contesti, dall'archeologia all'arte, all'industria.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ho trovato un manufatto nella foresta.","correct":"✓ Ho trovato un oggetto nella foresta.","note":"'Manufatto' implica una certa importanza culturale o storica. Se l'oggetto trovato nella foresta è semplice e senza particolare valore, è più appropriato usare 'oggetto'."},{"incorrect":"✗ La natura è piena di manufatti.","correct":"✓ La natura è piena di elementi naturali.","note":"'Manufatto' si riferisce a qualcosa creato dall'uomo, quindi non può essere usato per descrivere elementi naturali."}],"priority":"★★☆"},"related_words":{"derivatives":["manifattura (manufacture)","manufatturiero (manufacturing)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relativamente frequente in contesti specifici (arte, archeologia, storia).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Manufatto' è una parola di livello B2 che si riferisce a un oggetto creato dall'uomo, spesso con valore storico o culturale. È importante distinguere 'manufatto' da 'oggetto' in generale, poiché il primo implica una certa importanza o significato. Il termine è comunemente usato in contesti accademici, museali e artistici."},"example_sentences":[{"sentence":"Gli archeologi hanno scoperto numerosi manufatti durante gli scavi.","translation":"Archaeologists discovered numerous artifacts during the excavations.","type":"noun","meaning_category":"artificial object"},{"sentence":"Il restauro dei manufatti antichi richiede competenze specialistiche.","translation":"The restoration of ancient artifacts requires specialized skills.","type":"noun","meaning_category":"artificial object"},{"sentence":"Questo manufatto rappresenta un importante esempio dell'arte rinascimentale.","translation":"This artifact represents an important example of Renaissance art.","type":"noun","meaning_category":"artificial object"}]}