{"word":"nondescriptly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"特徴なく、判別しにくく、平凡に","english_definition":"in a way that lacks distinctive or interesting features or characteristics; in a manner that is ordinary and not easily described.","examples":[{"sentence":"The building was nondescriptly situated among other similar structures.","translation":"その建物は、他の似たような建物の中に特徴なく建っていた。"},{"sentence":"She dressed nondescriptly, hoping not to attract attention.","translation":"彼女は目立たないように、平凡な服装をした。"},{"sentence":"The suspect was described as nondescriptly dressed in a gray suit.","translation":"容疑者は灰色のスーツを着た、特徴のない服装だと説明された。"}],"collocations":["dress nondescriptly","appear nondescriptly","describe someone nondescriptly"],"synonyms":["ordinarily","unremarkably","plainly","banally","colorlessly","featurelessly","unimpressively"],"antonyms":["distinctively","remarkably","interestingly","strikingly","impressively"]}],"etymology":{"value":"The word is formed by adding the suffix '-ly' to the adjective 'nondescript'. 'Nondescript' itself comes from 'non-' (not) + 'descript' (described), meaning something that is difficult to describe because it lacks distinctive features.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒndɪˈskrɪptli/","syllables":"non-de-script-ly"},"inflection":{"notes":"As an adverb, 'nondescriptly' does not have different forms for gender or number."},"usage_notes":{"explanation":"'Nondescriptly' is used to describe actions or appearances that lack distinctive or memorable qualities. It suggests a lack of individuality or anything that would make something stand out. It is often used in descriptions where the subject blends in or is difficult to remember or identify.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted nondescript.","correct":"✓ He acted nondescriptly.","note":"'Nondescript' is an adjective, so it cannot be used to modify a verb directly. The adverb 'nondescriptly' is needed to describe how someone acts."},{"incorrect":"✗ The building was very nondescripted.","correct":"✓ The building was very nondescript.","note":"'Nondescript' is already an adjective, so adding '-ed' is incorrect. The adverb form is 'nondescriptly'."}],"priority":"★★☆"},"related_words":{"derivatives":["nondescript (adjective: lacking distinctive or interesting features)","nondescriptness (noun: the state of being nondescript)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nondescriptly' is an adverb used to describe something done in a way that lacks distinctive or interesting features. It is not a commonly used word and is more likely to appear in formal writing or detailed descriptions. Understanding the base adjective 'nondescript' is helpful for grasping the meaning of the adverb.","priority":"★★☆"},"example_sentences":[{"sentence":"The man walked nondescriptly through the crowd, trying not to draw attention to himself.","translation":"その男は人混みの中を、目立たないように歩いた。","type":"adverb","meaning_category":"lacking distinctive features"},{"sentence":"She decorated her office nondescriptly, with plain furniture and neutral colors.","translation":"彼女はオフィスを、飾り気のない家具とニュートラルカラーで、特徴なく飾った。","type":"adverb","meaning_category":"ordinarily"},{"sentence":"The suspect was described as nondescriptly dressed, making it difficult for witnesses to remember him.","translation":"容疑者は特徴のない服装をしていたと説明され、目撃者が彼を思い出すのを困難にした。","type":"adverb","meaning_category":"difficult to describe"}]}