{"word":"pseudoanachronistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"時代錯誤を装った、見せかけの時代錯誤的な","english_definition":"Appearing to be anachronistic (belonging to a period other than that being portrayed) but intentionally so, often for artistic or humorous effect.","examples":[{"sentence":"The film's pseudoanachronistic costumes added to its quirky charm.","translation":"その映画の時代錯誤を装った衣装が、その風変わりな魅力を増していた。"},{"sentence":"The author used pseudoanachronistic language to create a sense of historical distance while still being accessible to modern readers.","translation":"著者は、現代の読者にも理解しやすいように、歴史的な距離感を出しつつ、時代錯誤を装った言葉遣いを使用した。"}],"collocations":["pseudoanachronistic elements","pseudoanachronistic style","pseudoanachronistic details"],"synonyms":["deliberately anachronistic","intentionally anachronistic","self-consciously anachronistic"],"antonyms":["authentically historical","genuinely anachronistic"]}],"etymology":{"value":"Derived from \"pseudo-\" (meaning false or pretended) + \"anachronistic\" (pertaining to an anachronism, something out of its proper time).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊənəˌkrɒnɪstɪk/","syllables":"pseu-do-a-na-chron-is-tic"},"inflection":{},"usage_notes":{"explanation":"The term \"pseudoanachronistic\" describes something that appears to be anachronistic but is deliberately so. This is different from a genuine anachronism, which is an unintentional error. Pseudoanachronisms are often used in art, literature, and film to create a specific effect, such as humor, irony, or a sense of detachment from historical reality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was anachronistic, but it was pseudoanachronistic.","correct":"✓ The movie was pseudoanachronistic; the anachronisms were intentional.","note":"Anachronistic means unintentionally out of place in time. Pseudoanachronistic means intentionally so."}],"priority":"★★★"},"related_words":{"derivatives":["pseudoanachronism (noun)"],"related_terms":["anachronism","anachronistic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudoanachronistic\" is a complex term used to describe something that appears to be out of its proper time period but is intentionally so. It's often used in discussions of art, literature, and film to analyze the deliberate use of anachronisms for specific effects. Understanding this term requires a solid grasp of both \"pseudo-\" (meaning false or imitation) and \"anachronistic\" (meaning belonging to a different time period)."},"example_sentences":[{"sentence":"The play's pseudoanachronistic setting, blending medieval and modern elements, created a surreal atmosphere.","translation":"中世と現代の要素を混ぜ合わせた、その劇の時代錯誤を装った舞台設定は、シュールな雰囲気を作り出した。","type":"general","meaning_category":"general"},{"sentence":"Her pseudoanachronistic use of Victorian slang in a contemporary novel was a stylistic choice that polarized readers.","translation":"彼女の現代小説におけるヴィクトリア朝のスラングを時代錯誤を装って使用したことは、読者を二極化させる文体上の選択だった。","type":"literature","meaning_category":"literature"}]}