{"word":"Masorah","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マソラ：ヘブライ語聖書のテキストの正確な伝承を目的とした、注釈、注記、およびテキスト上の伝統的ルールの一式。","english_definition":"A body of notes, textual variants, and traditional rules compiled by Jewish scholars (the Masoretes) to ensure the accurate preservation of the text of the Hebrew Bible.","examples":[{"sentence":"The Masorah provides detailed guidelines for scribes copying the Torah scrolls.","translation":"マソラは、トーラーの巻物を書き写す書記官のための詳細なガイドラインを提供します。"},{"sentence":"Scholars study the Masorah to understand the nuances of the biblical text.","translation":"学者たちは聖書のテキストのニュアンスを理解するためにマソラを研究します。"}],"collocations":["Masoretic Text","Masoretic notes","study the Masorah"],"synonyms":["textual criticism","biblical commentary"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の מָסוֹרָה (masorah) に由来し、「伝承」または「伝統」を意味する。これは、動詞の מָסַר (masar)、「伝える」または「引き渡す」から派生している。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈsɔːrə/","syllables":"Ma-so-rah"},"inflection":{"noun_plural":"Masorahs (まれに複数形で使われる)","notes":"通常は単数形で集合的に使用される。"},"usage_notes":{"explanation":"「Masorah」は、ヘブライ語聖書のテキストの正確な伝承を保証するために、ユダヤ人学者（マソラ学者）によって編集された注釈、テキストの異形、および伝統的な規則の体系を指します。これには、テキストのスペル、発音、区切り、およびその他の特徴に関する詳細な注記が含まれます。マソラは、聖書テキストの標準化された信頼できるバージョンであるマソラ本文の基礎となります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Masorah are important for understanding the Hebrew Bible.","correct":"✓ The Masorah is important for understanding the Hebrew Bible.","note":"「Masorah」は集合名詞として扱われることが多く、単数形の動詞を使用します。"},{"incorrect":"✗ Masorah refers to the vowel points in the Hebrew Bible.","correct":"✓ Masorah includes but is not limited to the vowel points in the Hebrew Bible.","note":"マソラには母音記号だけでなく、テキストの正確な伝承のための他の多くの注釈や規則も含まれています。"}],"priority":"★★☆"},"related_words":{"derivatives":["Masoretic","Masorete"],"phrases":["Masoretic Text"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 聖書研究や宗教学の文脈で主に使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Masorah」は、ヘブライ語聖書のテキストを正確に伝えるためのユダヤ教の伝統的な注釈と規則の体系を指す専門用語です。聖書のテキストのスペル、発音、区切りなどに関する詳細な注記が含まれており、聖書研究や宗教学の文脈で使用されます。この単語は、聖書テキストの正確な伝承に関心のある学者や研究者にとって重要です。"},"example_sentences":[{"sentence":"The **Masorah** meticulously records the number of times each letter appears in the Torah.","translation":"マソラは、トーラーに各文字が現れる回数を綿密に記録しています。","type":"noun","meaning_category":"伝承の体系"},{"sentence":"The **Masorah** helps scholars determine the correct vocalization of the Hebrew text.","translation":"マソラは、学者がヘブライ語テキストの正しい母音を決定するのに役立ちます。","type":"noun","meaning_category":"注釈と規則"}]}