{"word":"torrefaction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乾留、焙焼、乾式蒸留（特にバイオマスを燃料として利用するために行う熱処理）","english_definition":"A thermochemical treatment process applied to biomass to produce a solid fuel with improved fuel properties.","examples":[{"sentence":"Torrefaction of biomass increases its energy density.","translation":"バイオマスの乾留は、そのエネルギー密度を高める。"},{"sentence":"Torrefaction is a promising technology for upgrading biomass into a coal-like fuel.","translation":"乾留は、バイオマスを石炭のような燃料にアップグレードするための有望な技術である。"}],"collocations":["biomass torrefaction","torrefaction process","torrefied biomass"],"synonyms":["pyrolysis","carbonization","thermal treatment"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'torréfaction', which comes from the Latin 'torrefacere', meaning 'to roast thoroughly'. 'Torrere' means 'to parch, roast, scorch', and 'facere' means 'to make'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒrɪˈfæక్షన్/","syllables":"tor-re-fac-tion"},"inflection":{"noun_plural":"torrefactions"},"usage_notes":{"explanation":"Torrefaction is a mild form of pyrolysis typically conducted at temperatures between 200 and 300 °C. It changes the chemical and physical properties of biomass to make it a better fuel. The process removes moisture and volatile organic compounds, resulting in a product that is more energy-dense, hydrophobic, and easier to grind. Torrefied biomass can be used as a substitute for coal in power plants.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Torrefaction is the same as combustion.","correct":"✓ Torrefaction is a thermal treatment process, but not combustion.","note":"Torrefaction is a thermal treatment in the absence of oxygen, unlike combustion which requires oxygen."},{"incorrect":"✗ Torrefaction increases the moisture content of biomass.","correct":"✓ Torrefaction decreases the moisture content of biomass.","note":"Torrefaction removes moisture from biomass."}],"priority":"★★☆"},"related_words":{"derivatives":["torrefy (verb)","torrefied (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Torrefaction' is a specialized term primarily used in the context of biomass processing and renewable energy. It refers to a specific thermochemical process that alters the properties of biomass to enhance its suitability as a fuel. Understanding this term requires familiarity with energy technologies and chemical processes."},"example_sentences":[{"sentence":"The **torrefaction** plant converts wood waste into a valuable biofuel.","translation":"その乾留プラントは木材廃棄物を価値のあるバイオ燃料に変換する。","type":"noun","meaning_category":"乾留"},{"sentence":"**Torrefaction** improves the grindability of biomass, making it easier to process.","translation":"乾留はバイオマスの粉砕性を向上させ、加工を容易にする。","type":"noun","meaning_category":"乾留"},{"sentence":"The environmental impact of **torrefaction** is generally lower than that of coal combustion.","translation":"乾留の環境への影響は、一般的に石炭燃焼よりも低い。","type":"noun","meaning_category":"乾留"}]}