{"word":"Harderian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)ハーダー腺の、またはハーダー腺に関する","english_definition":"(anatomy) Of or relating to the Harderian gland.","examples":[{"sentence":"The Harderian gland is present in many vertebrates.","translation":"ハーダー腺は多くの脊椎動物に存在する。"}],"collocations":["Harderian gland"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Johann Jacob Harder, a Swiss anatomist who first described the gland in detail in 1694.","priority":"★★★"},"pronunciation":{"ipa":"/hɑːrˈdɪəriən/","syllables":"Har-de-ri-an"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"The term 'Harderian' is almost exclusively used in a scientific or medical context, specifically when discussing the anatomy or physiology of animals that possess this gland. It is not a commonly used word in everyday conversation.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Harder's gland","Harderian gland"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Harderian' is a highly specialized term primarily used in the fields of anatomy, zoology, and veterinary medicine. It refers specifically to the Harderian gland, an organ found in many vertebrate animals. Due to its technical nature and limited application, it is considered an advanced vocabulary word. Understanding this term requires familiarity with biological and anatomical concepts."},"example_sentences":[{"sentence":"The porphyrin secretion of the Harderian gland is thought to play a role in rodent behavior.","translation":"ハーダー腺のポルフィリン分泌は、げっ歯類の行動において役割を果たすと考えられている。","type":"adjective","meaning_category":"Anatomical"},{"sentence":"Histological analysis revealed changes in the Harderian gland of the treated animals.","translation":"組織学的分析により、処置された動物のハーダー腺に変化が見られた。","type":"adjective","meaning_category":"Anatomical"}]}