{"word":"autonavigator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自動ナビゲーションシステム、自動操縦装置","english_definition":"An automatic navigation system, especially for vehicles.","examples":[{"sentence":"The car is equipped with an autonavigator that guides the driver to the destination.","translation":"その車には、運転手を目的地まで案内する自動ナビゲーションシステムが搭載されています。"},{"sentence":"The ship's autonavigator kept it on course through the storm.","translation":"その船の自動操縦装置は、嵐の中、針路を維持しました。"}],"collocations":["car autonavigator","ship autonavigator","airplane autonavigator"],"synonyms":["autopilot","automatic navigation system","GPS navigation"],"antonyms":["manual navigation"]}],"etymology":{"value":"\"auto-\" (automatic) + \"navigator\" (one who navigates).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊˈnævɪɡeɪtər/","syllables":"au-to-nav-i-ga-tor"},"inflection":{"noun_plural":"autonavigators"},"usage_notes":{"explanation":"The term \"autonavigator\" is typically used to describe a system that automatically guides a vehicle, such as a car, ship, or airplane, along a predetermined route. It often incorporates GPS technology and other sensors to determine the vehicle's position and make adjustments to its course.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The autonavigator is navigating manual.","correct":"✓ The autonavigator is navigating automatically.","note":"\"Autonavigator\" implies automatic navigation, so \"navigating manual\" is contradictory. Use \"navigating automatically\" or \"navigating manually\" depending on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["navigate","navigation","navigator","automatic","automation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"autonavigator\" is a compound word combining \"auto\" (meaning automatic) and \"navigator\" (someone or something that guides). It refers to a system that automatically guides a vehicle or other object. Understanding the components of the word makes its meaning clear. It is a relatively technical term, so it is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The new drone uses a sophisticated autonavigator to avoid obstacles.","translation":"その新しいドローンは、障害物を回避するために高度な自動ナビゲーションシステムを使用しています。","type":"noun","meaning_category":"自動ナビゲーションシステム"},{"sentence":"The airplane's autonavigator malfunctioned, forcing the pilot to take manual control.","translation":"その飛行機の自動操縦装置が故障し、パイロットは手動操縦に切り替えざるを得ませんでした。","type":"noun","meaning_category":"自動操縦装置"}]}