{"word":"dyschroia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"皮膚の色素異常","english_definition":"An abnormality or alteration in skin pigmentation or coloration.","examples":[{"sentence":"The patient presented with dyschroia following the inflammatory skin condition.","translation":"その患者は、炎症性皮膚疾患に続いて色素異常を呈した。"},{"sentence":"Various factors can contribute to dyschroia, including sun exposure and hormonal changes.","translation":"日光への曝露やホルモン変化など、さまざまな要因が色素異常を引き起こす可能性があります。"}],"collocations":["skin dyschroia","post-inflammatory dyschroia"],"synonyms":["hyperpigmentation","hypopigmentation","melasma","vitiligo"],"antonyms":[]}],"etymology":{"value":"From Greek 'dys-' meaning bad or abnormal, and 'chroia' meaning color.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈkroʊiə/","syllables":"dys-chroi-a"},"inflection":{"noun_plural":"dyschroias or dyschroiae"},"usage_notes":{"explanation":"Dyschroia is a general term referring to any alteration or abnormality in skin color. It encompasses both hyperpigmentation (darkening of the skin) and hypopigmentation (lightening of the skin).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed the patient with dyschroia, it was melasma.","correct":"✓ The doctor diagnosed the patient with dyschroia; it was melasma. / ✓ The doctor diagnosed the patient with dyschroia, specifically melasma.","note":"Dyschroia is a general term, while melasma is a specific type of dyschroia. Use a semicolon or specify 'specifically' to connect the general term to the specific condition."}],"priority":"★★☆"},"related_words":{"derivatives":["dyschromia (variant spelling)","achromia (lack of color)","chromoderma (skin discoloration)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dyschroia' is a medical term that refers to any abnormality or alteration in skin pigmentation or coloration. It's a relatively uncommon word, primarily used in medical and dermatological contexts. Understanding this term requires a good grasp of medical terminology and a high reading comprehension level.","priority":"★★☆"},"example_sentences":[{"sentence":"Topical treatments can help reduce the appearance of dyschroia.","translation":"局所療法は、色素異常の外観を軽減するのに役立ちます。","type":"general","meaning_category":"General"},{"sentence":"Post-inflammatory dyschroia can occur after acne or eczema.","translation":"炎症後色素異常は、ニキビや湿疹の後に発生する可能性があります。","type":"specific","meaning_category":"Post-inflammatory"}]}