{"word":"self-denying","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自己犠牲的な、禁欲的な、克己的な","english_definition":"characterized by or reflecting self-denial; ascetic; abstemious.","examples":[{"sentence":"She was a self-denying woman, always putting others before herself.","translation":"彼女は自己犠牲的な女性で、いつも自分のことより他人を優先していた。"},{"sentence":"The monk lived a self-denying life, renouncing all worldly possessions.","translation":"その修道士は禁欲的な生活を送り、すべての世俗的な所有物を放棄した。"},{"sentence":"His self-denying efforts helped the team win the championship.","translation":"彼の克己的な努力がチームの優勝に貢献した。"}],"collocations":["self-denying behavior (自己犠牲的な行動)","self-denying lifestyle (禁欲的な生活)","self-denying ordinance (自己否定条例 - 歴史的な文脈で使われる)"],"synonyms":["altruistic","self-sacrificing","ascetic","abstinent","austere","stoic"],"antonyms":["selfish","self-indulgent","hedonistic"]}],"etymology":{"value":"'Self-' + 'denying'.  'Denying' is the present participle of the verb 'deny', meaning to refuse to grant or allow (oneself something). The word reflects the action of refusing oneself pleasures or comforts.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself.dɪˈnaɪ.ɪŋ/","syllables":"self-de-ny-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are 'more self-denying' and 'most self-denying', respectively."},"usage_notes":{"explanation":"'Self-denying' describes someone who voluntarily refrains from satisfying their own desires or needs, often for moral or religious reasons, or to benefit others. It implies a conscious decision to forgo personal gratification. It can also describe actions or behaviors that reflect this characteristic. The term often carries a positive connotation, suggesting virtue and moral strength, but can sometimes imply excessive austerity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very self-denied.","correct":"✓ He is very self-denying.","note":"'Self-denied' is not commonly used. The correct form is 'self-denying' as an adjective."},{"incorrect":"✗ She practices self-deny.","correct":"✓ She practices self-denial.","note":"'Self-deny' is not a noun. The noun form is 'self-denial'."}],"priority":"★★☆"},"related_words":{"derivatives":["self-denial (noun: 自己否定、禁欲、克己)"],"phrases":["practice self-denial (禁欲を実践する)"],"related_concepts":["asceticism (禁欲主義)","altruism (利他主義)","stoicism (禁欲主義)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. The term is not commonly used in everyday conversation, but appears in literature and more formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-denying' is a somewhat advanced term that describes someone who willingly gives up their own desires or comforts, often to help others or for moral reasons. It suggests a strong level of self-control and a focus on values beyond personal pleasure. This word is more likely to be found in books or articles discussing ethics, religion, or personal development, rather than in casual conversation."},"example_sentences":[{"sentence":"Her **self-denying** nature led her to volunteer at the homeless shelter every weekend.","translation":"彼女の自己犠牲的な性格から、週末ごとにホームレスシェルターでボランティアをするようになった。","type":"adjective","meaning_category":"自己犠牲的な"},{"sentence":"The **self-denying** lifestyle of a monk involves simplicity and meditation.","translation":"修道士の禁欲的な生活様式は、質素さと瞑想を伴う。","type":"adjective","meaning_category":"禁欲的な"},{"sentence":"He made a **self-denying** decision to give up his career for his family.","translation":"彼は家族のためにキャリアを諦めるという克己的な決断をした。","type":"adjective","meaning_category":"克己的な"}]}