{"word":"angiomatosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管腫症、血管腫症候群","english_definition":"A condition characterized by the abnormal proliferation of blood vessels, resulting in the formation of multiple angiomas (tumors composed of blood vessels).","examples":[{"sentence":"Angiomatosis can affect various organs and tissues in the body.","translation":"血管腫症は、体内の様々な臓器や組織に影響を与える可能性があります。"},{"sentence":"Treatment for angiomatosis depends on the severity and location of the angiomas.","translation":"血管腫症の治療は、血管腫の重症度と位置によって異なります。"}],"collocations":["cutaneous angiomatosis (皮膚血管腫症)","bacillary angiomatosis (バシラス性血管腫症)","CNS angiomatosis (中枢神経系血管腫症)"],"synonyms":["vascular malformation","hemangiomatosis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'angeion' (vessel), 'oma' (tumor), and '-osis' (condition or process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændʒioʊməˈtoʊsɪs/","syllables":"an-gi-o-ma-to-sis"},"inflection":{"noun_plural":"angiomatoses"},"usage_notes":{"explanation":"Angiomatosis is a relatively rare condition characterized by the widespread formation of angiomas. These angiomas can occur in the skin, internal organs, or other tissues. The condition can be congenital (present at birth) or acquired later in life. The severity of angiomatosis varies depending on the extent and location of the angiomas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Angiomatosis is a type of cancer.","correct":"✓ Angiomatosis is a condition characterized by the abnormal proliferation of blood vessels, which can sometimes be associated with cancer, but is not cancer itself.","note":"Angiomatosis itself is not cancer, but the abnormal growth of blood vessels can sometimes be associated with cancerous conditions."}],"priority":"★☆☆"},"related_words":{"derivatives":["angioma (血管腫)","angiogenic (血管新生の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Angiomatosis' is a complex medical term referring to a condition involving the abnormal proliferation of blood vessels, leading to the formation of multiple angiomas. Understanding this term requires a background in medical terminology and a comprehension of vascular biology. The condition's implications and treatment are highly specialized and typically discussed within medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was diagnosed with angiomatosis after a series of imaging tests.","translation":"一連の画像検査の結果、患者は血管腫症と診断されました。","type":"general","meaning_category":"diagnosis"},{"sentence":"Bacillary angiomatosis is often seen in immunocompromised individuals.","translation":"バシラス性血管腫症は、しばしば免疫不全の個体に見られます。","type":"specific type","meaning_category":"disease"},{"sentence":"Treatment options for angiomatosis may include laser therapy or surgical removal.","translation":"血管腫症の治療選択肢には、レーザー治療や外科的切除が含まれる場合があります。","type":"treatment","meaning_category":"medical intervention"}]}