{"word":"horse-faced","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(軽蔑的に)馬面(うまづら)の、顔が馬に似ている","english_definition":"(derogatory) having a long, narrow face resembling that of a horse.","examples":[{"sentence":"She was described as horse-faced in the article.","translation":"彼女はその記事で馬面だと評された。"},{"sentence":"He made a rude comment about her being horse-faced.","translation":"彼は彼女が馬面であることについて失礼なコメントをした。"}],"collocations":["a horse-faced woman","a horse-faced man","described as horse-faced","called horse-faced"],"synonyms":["long-faced","gaunt","angular","plain","unattractive"],"antonyms":["attractive","beautiful","pretty","handsome"],"notes":"This term is generally considered offensive and should be used with caution."}],"etymology":{"value":"The term is a compound of 'horse' and 'faced,' directly comparing someone's facial features to those of a horse, typically implying a long, narrow face.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrs feɪst/","syllables":"horse-faced"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Horse-faced' is a derogatory term used to describe someone whose face is long and narrow, resembling that of a horse. It is generally considered offensive and should be avoided in polite conversation. The term focuses on physical appearance and is often used to insult or demean someone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has a horse-faced personality.","correct":"✓ She has a horse-like face.","note":"'Horse-faced' specifically refers to physical appearance, not personality. Using it to describe personality is incorrect."},{"incorrect":"✗ He complimented her horse-faced features.","correct":"✓ He complimented her unique features.","note":"Since 'horse-faced' is generally considered an insult, it would not be used as a compliment. It's better to use neutral or positive language."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_terms":["equine","horse-like"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'horse-faced' is a derogatory adjective used to describe someone with a long, narrow face resembling that of a horse. It is not a common term and is generally considered offensive. Its usage implies a negative judgment of someone's physical appearance. It is more likely to be encountered in literature or informal conversation where insults or negative descriptions are used. Due to its offensive nature, it is important to understand its meaning to avoid using it or to recognize it when used by others."},"example_sentences":[{"sentence":"The bully called her horse-faced, which made her cry.","translation":"いじめっ子は彼女を馬面と呼び、彼女を泣かせた。","type":"example","meaning_category":"derogatory description"},{"sentence":"Some people find the term horse-faced to be extremely offensive.","translation":"馬面という言葉は非常に不快に感じる人もいる。","type":"example","meaning_category":"offensive nature"}]}