{"word":"regulators","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"規制当局、規制機関","english_definition":"An authority or agency responsible for supervising a particular activity or industry.","examples":[{"sentence":"Financial regulators are investigating the bank's activities.","translation":"金融規制当局は、その銀行の活動を調査している。"},{"sentence":"The industry is subject to strict regulations imposed by government regulators.","translation":"その業界は、政府の規制当局によって課せられた厳格な規制の対象となっている。"},{"sentence":"Regulators play a crucial role in ensuring fair competition.","translation":"規制当局は、公正な競争を確保する上で重要な役割を果たしている。"}],"collocations":["financial regulators (金融規制当局)","government regulators (政府規制当局)","industry regulators (業界規制当局)","regulatory body (規制機関)","regulatory agency (規制機関)"],"synonyms":["regulatory body","regulatory agency","authority","watchdog"],"antonyms":[]},{"part_of_speech":"noun","definition":"調整器、調整弁、レギュレーター","english_definition":"A device for controlling something, especially a valve that controls the supply of a fluid or gas.","examples":[{"sentence":"The scuba diver checked the air pressure on his regulator.","translation":"スキューバダイバーは、レギュレーターの空気圧を確認した。"},{"sentence":"The gas regulator ensures a constant flow of propane.","translation":"ガス調整器は、プロパンの一定の流れを確保する。"},{"sentence":"A voltage regulator maintains a stable output voltage.","translation":"電圧調整器は、安定した出力電圧を維持する。"}],"collocations":["air regulator (空気調整器)","gas regulator (ガス調整器)","voltage regulator (電圧調整器)","pressure regulator (圧力調整器)"],"synonyms":["valve","controller","adjuster"],"antonyms":[]}],"etymology":{"value":"The word \"regulator\" comes from the verb \"regulate,\" which originates from the Latin word \"regula,\" meaning \"rule\" or \"standard.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈrɛɡjəˌleɪtərz","syllables":"reg-u-la-tors"},"inflection":{"noun_plural":"regulators"},"usage_notes":{"explanation":"The word \"regulators\" has two main meanings. The first refers to authorities or agencies that oversee and control activities within a specific industry or sector. These regulators enforce rules and ensure compliance. The second meaning refers to devices that control or adjust the flow or pressure of a substance, such as air, gas, or voltage. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The regulator of the company is responsible for safety.","correct":"✓ The regulators of the company are responsible for safety.","note":"When referring to an authority, use the plural form \"regulators\" as it usually involves a group of people or a body.  If referring to a single person, use \"the regulator\" but this is less common."},{"incorrect":"✗ The regulator was broken, so the pressure was too high.","correct":"✓ The regulator was broken, so the pressure was too high.","note":"No common mistakes were identified for the device meaning of regulator. The spelling is consistent."}],"priority":"★★☆"},"related_words":{"derivatives":["regulate (verb)","regulation (noun)","regulatory (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"regulators\" is used in two main contexts. In business and government, it refers to the bodies that oversee and control industries. In engineering and mechanics, it refers to devices that control the flow or pressure of something. Understanding the context is key to interpreting the meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The environmental **regulators** fined the company for pollution.","translation":"環境規制当局は、汚染でその会社に罰金を科した。","type":"noun","meaning_category":"規制当局"},{"sentence":"The gas **regulator** ensures a consistent flame on the stove.","translation":"ガス調整器は、コンロの安定した炎を確保する。","type":"noun","meaning_category":"調整器"},{"sentence":"**Regulators** are responsible for enforcing safety standards.","translation":"規制当局は、安全基準の施行を担当している。","type":"noun","meaning_category":"規制当局"},{"sentence":"A faulty **regulator** can cause dangerous pressure buildup.","translation":"故障した調整器は、危険な圧力上昇を引き起こす可能性がある。","type":"noun","meaning_category":"調整器"}]}