{"word":"flatuosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鼓腸、腸内ガス、放屁","english_definition":"the condition of having excessive gas in the stomach or intestines; the act of passing gas from the digestive tract through the anus.","examples":[{"sentence":"He suffered from flatuosity after eating beans.","translation":"彼は豆を食べた後、鼓腸に苦しんだ。"},{"sentence":"The doctor asked about her flatuosity symptoms.","translation":"医者は彼女の鼓腸の症状について尋ねた。"},{"sentence":"Some foods are known to cause flatuosity.","translation":"いくつかの食品は鼓腸を引き起こすことが知られている。"}],"collocations":["excessive flatuosity (過度の鼓腸)","intestinal flatuosity (腸内鼓腸)","relieve flatuosity (鼓腸を和らげる)","cause flatuosity (鼓腸を引き起こす)"],"synonyms":["flatulence","gas","wind","farting","passing gas"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from French flatuosité, from late Latin flatuosus, from Latin flatus ‘a blowing’ (see flatus).","priority":"★★☆"},"pronunciation":{"ipa":"ˌflætjuˈɒsɪti","syllables":"flat-u-os-i-ty"},"inflection":{"noun_plural":"flatuosities"},"usage_notes":{"explanation":"\"Flatuosity\" refers to the condition of having excessive gas in the digestive system, leading to bloating and the need to expel gas. It is a more formal and clinical term than \"flatulence\" or \"gas.\" It can also refer to the act of passing gas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a lot of flatuosity, it's very embarrassing.","correct":"✓ He has a lot of flatulence, it's very embarrassing.","note":"\"Flatulence\" is a more common and less formal term than \"flatuosity\" for describing the condition of having gas. While \"flatuosity\" is correct, it's often perceived as overly technical in everyday conversation."}],"priority":"★★☆"},"related_words":{"derivatives":["flatus (noun: ガス、鼓腸)","flatulent (adjective: 鼓腸の、放屁性の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"flatuosity\" is a formal and technical term that refers to the condition of having excessive gas in the digestive system. It is not commonly used in everyday conversation and is more likely to be found in medical or scientific contexts. The term can also refer to the act of passing gas. Due to its specialized nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The patient complained of abdominal discomfort and flatuosity.","translation":"患者は腹部の不快感と鼓腸を訴えた。","type":"noun","meaning_category":"鼓腸"},{"sentence":"Certain foods are known to increase flatuosity in susceptible individuals.","translation":"特定の食品は、感受性の高い人々の鼓腸を増加させることが知られている。","type":"noun","meaning_category":"鼓腸"},{"sentence":"The herbal remedy is designed to reduce flatuosity and bloating.","translation":"そのハーブ療法は、鼓腸と膨満感を軽減するように設計されている。","type":"noun","meaning_category":"鼓腸"}]}