{"word":"orthodontics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"歯列矯正学","english_definition":"the branch of dentistry dealing with the prevention or correction of irregularities of the teeth, as by the use of braces.","examples":[{"sentence":"She's studying orthodontics at dental school.","translation":"彼女は歯学部で歯列矯正学を学んでいる。"},{"sentence":"Orthodontics can improve both the appearance and function of your teeth.","translation":"歯列矯正学は、歯の見栄えと機能の両方を改善することができる。"}],"collocations":["orthodontic treatment (歯列矯正治療)","orthodontic braces (歯列矯正用ブレース)","orthodontic specialist (歯列矯正専門医)","study orthodontics (歯列矯正学を学ぶ)","practice orthodontics (歯列矯正を実践する)"],"synonyms":["orthodontia"],"antonyms":[]}],"etymology":{"value":"From 'ortho-' (straight, correct) + 'odont' (tooth) + '-ics' (science or study of). Originates from Greek 'orthos' (straight) and 'odous, odontos' (tooth).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːrθəˈdɒntɪks/","syllables":"or-tho-don-tics"},"inflection":{"noun_plural":"(usually uncountable, but can be 'orthodontics' or 'orthodontic treatments' when referring to specific treatments)"},"usage_notes":{"explanation":"'Orthodontics' is a specialized field within dentistry that focuses on correcting the alignment of teeth and jaws. It is often associated with the use of braces, but can also involve other appliances and procedures. The term is generally used as an uncountable noun, referring to the field of study or practice itself. When referring to specific treatments, the plural form or the phrase 'orthodontic treatments' may be used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to orthodontics.","correct":"✓ I am going to the orthodontist. / ✓ I am having orthodontic treatment.","note":"'Orthodontics' is the field of study, not the practitioner. To say you are seeing a specialist, you would say 'orthodontist' or that you are having treatment. "},{"incorrect":"✗ He study orthodontic.","correct":"✓ He studies orthodontics.","note":"'Orthodontics' is a field of study, and in this context, it requires the 's' to indicate the third-person singular present tense."}],"priority":"★★☆"},"related_words":{"derivatives":["orthodontist (歯列矯正医)","orthodontic (歯列矯正の、歯列矯正学の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specific contexts related to dentistry.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Orthodontics' is a specialized term referring to the branch of dentistry focused on correcting teeth and jaw alignment. It involves understanding the principles of tooth movement and facial growth, as well as the application of various appliances and techniques to achieve optimal dental and facial aesthetics and function. The term is typically encountered in contexts related to dental health, medical studies, or cosmetic procedures.","priority":"★★☆"},"example_sentences":[{"sentence":"Advances in orthodontics have made teeth straightening more comfortable and efficient.","translation":"歯列矯正学の進歩により、歯の矯正がより快適かつ効率的になった。","type":"noun","meaning_category":"field of study"},{"sentence":"The dentist recommended orthodontics to correct my overbite.","translation":"歯科医は私の出っ歯を矯正するために歯列矯正を勧めた。","type":"noun","meaning_category":"treatment"},{"sentence":"She's doing a residency in orthodontics after graduating from dental school.","translation":"彼女は歯学部卒業後、歯列矯正学の研修医をしている。","type":"noun","meaning_category":"field of study"},{"sentence":"Proper oral hygiene is essential during orthodontics.","translation":"歯列矯正中は適切な口腔衛生が不可欠である。","type":"noun","meaning_category":"treatment"}]}