{"word":"paparan","meanings":[{"part_of_speech":"noun","definition":"Hal atau peristiwa yang dipaparkan; hasil memaparkan.","english_definition":"Something that is displayed or presented; the result of displaying.","examples":[{"sentence":"Paparan data itu sangat jelas dan mudah dipahami.","translation":"The presentation of the data was very clear and easy to understand."},{"sentence":"Paparan produk baru itu menarik perhatian banyak pengunjung.","translation":"The display of the new product attracted the attention of many visitors."}],"synonyms":["presentasi","pertunjukan","demonstrasi","pameran"],"antonyms":[]},{"part_of_speech":"noun","definition":"Proses atau cara memaparkan sesuatu.","english_definition":"The process or method of displaying something.","examples":[{"sentence":"Paparan materi dilakukan secara sistematis dan terstruktur.","translation":"The presentation of the material was done systematically and in a structured manner."},{"sentence":"Paparan ide-ide kreatif sangat dihargai dalam rapat ini.","translation":"The presentation of creative ideas is highly valued in this meeting."}],"synonyms":["penyampaian","uraian","penjelasan"],"antonyms":[]},{"part_of_speech":"noun","definition":"Pengaruh atau dampak yang ditimbulkan oleh sesuatu.","english_definition":"The influence or impact caused by something.","examples":[{"sentence":"Paparan radiasi yang berlebihan dapat membahayakan kesehatan.","translation":"Excessive exposure to radiation can be harmful to health."},{"sentence":"Paparan informasi yang salah dapat menyesatkan masyarakat.","translation":"Exposure to incorrect information can mislead the public."}],"synonyms":["pengaruh","dampak","efek","akibat"],"antonyms":[]}],"etymology":{"value":"Derived from the Indonesian word 'papar' which means 'to display', 'to present', or 'to expose'. The suffix '-an' is added to form a noun.","priority":"3"},"pronunciation":{"ipa":"/paˈpa.ran/","syllables":"pa-pa-ran"},"inflection":{"notes":"This word is a noun and does not change form based on tense or number."},"usage_notes":{"explanation":"'Paparan' is a versatile word in Indonesian that can refer to the act of displaying or presenting something, the result of that act, or the influence or impact caused by something. The specific meaning depends on the context.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"Saya melihat paparan di televisi.","correct":"Saya melihat tayangan di televisi.","note":"While 'paparan' can refer to a display, 'tayangan' is more appropriate for television programs."}],"priority":"2"},"related_words":{"derivatives":["memaparkan (verb: to display, to present, to expose)","terpapar (verb: to be exposed)"],"phrases":["paparan media (media exposure)","paparan radiasi (radiation exposure)","paparan informasi (information exposure)"],"priority":"3"},"level_frequency":{"frequency_google_ngram":"Moderately frequent","priority":"2"},"readability_explanation":{"level":"B1","text":"'Paparan' is a word used to describe something that is displayed or presented, like a presentation or an exhibit. It can also refer to the process of presenting something. Additionally, it can mean the effect or impact that something has. Pay attention to the context to understand the intended meaning."},"example_sentences":[{"sentence":"Paparan materi itu sangat membosankan sehingga banyak peserta mengantuk.","translation":"The presentation of the material was so boring that many participants were sleepy.","type":"noun","meaning_category":"Presentation"},{"sentence":"Paparan sinar matahari yang berlebihan dapat menyebabkan kanker kulit.","translation":"Excessive exposure to sunlight can cause skin cancer.","type":"noun","meaning_category":"Exposure/Impact"},{"sentence":"Paparan ide-ide baru sangat penting untuk kemajuan perusahaan.","translation":"The presentation of new ideas is very important for the company's progress.","type":"noun","meaning_category":"Presentation"}]}