{"word":"solecized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(文法的に)誤った言い方をする、文法上の誤りを犯す","english_definition":"To commit a solecism; to speak or write ungrammatically.","examples":[{"sentence":"He solecized in his speech, using incorrect verb tenses.","translation":"彼はスピーチで誤った時制を使い、文法上の誤りを犯した。"},{"sentence":"The student solecized when he used 'ain't' in his essay.","translation":"その学生はエッセイで「ain't」を使い、文法上の誤りを犯した。"}],"collocations":["solecize in speech","solecize in writing"],"synonyms":["commit a grammatical error","speak ungrammatically","write ungrammatically"],"antonyms":["speak grammatically","write grammatically"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(文法的に)誤った言い方で表現する、文法上の誤りを含むように表現する","english_definition":"To express (something) in an ungrammatical manner; to commit a solecism in (a sentence, phrase, etc.).","examples":[{"sentence":"He solecized the sentence by using a double negative.","translation":"彼は二重否定を使ってその文を文法的に誤った言い方で表現した。"},{"sentence":"She solecized the phrase by using the wrong pronoun.","translation":"彼女は間違った代名詞を使ってそのフレーズを文法的に誤った言い方で表現した。"}],"collocations":["solecize a sentence","solecize a phrase"],"synonyms":["express ungrammatically","phrase incorrectly"],"antonyms":["express grammatically","phrase correctly"]}],"etymology":{"value":"Derived from 'solecism,' which comes from the Greek word 'soloikos,' referring to someone who speaks incorrectly, especially the inhabitants of Soli, an ancient Greek colony known for speaking a substandard dialect of Greek. The verb 'solecize' is formed by adding the suffix '-ize' to 'solecism.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɒləˌsaɪzd/","syllables":"sol-e-cized"},"inflection":{"verb_forms":{"present_simple":["solecize","solecizes"],"past_simple":"solecized","past_participle":"solecized","present_participle":"solecizing"}},"usage_notes":{"explanation":"'Solecize' is a relatively rare and formal verb that means to commit a solecism, which is a grammatical error or a violation of the rules of syntax. It is often used in academic or linguistic contexts. The verb can be used intransitively (to solecize) or transitively (to solecize a sentence).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He solecized about the weather.","correct":"✓ He solecized in his speech.","note":"'Solecize' refers specifically to grammatical errors, not general topics of conversation. It is often used with 'in speech' or 'in writing' to indicate the context of the error."},{"incorrect":"✗ The word was solecized.","correct":"✓ The sentence was solecized.","note":"'Solecize' is used to describe the act of making a grammatical error, not the state of a word. It is more appropriate to say that a sentence or phrase was solecized."}],"priority":"★★☆"},"related_words":{"derivatives":["solecism (noun: a grammatical mistake or impropriety in speech)","solecistic (adjective: characterized by or containing a solecism)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Solecized' is a highly specialized and uncommon term, primarily found in advanced linguistic or grammatical discussions. It signifies the act of committing a solecism, which is a deviation from standard grammatical rules or conventions. Due to its rarity and technical nature, it is unlikely to be encountered outside of academic or highly specialized contexts. Understanding the term requires a strong grasp of grammatical concepts and terminology."},"example_sentences":[{"sentence":"The politician solecized during his speech, confusing the subject-verb agreement.","translation":"その政治家は演説中に主語と動詞の一致を混同し、文法的な誤りを犯した。","type":"verb (vi)","meaning_category":"文法的な誤りを犯す"},{"sentence":"The poorly written report solecized basic grammatical rules, making it difficult to understand.","translation":"その拙い報告書は基本的な文法規則を誤っており、理解するのが困難だった。","type":"verb (vt)","meaning_category":"文法的な誤りを含むように表現する"}]}