{"word":"entozoarian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 動物体内寄生生物、内生動物","english_definition":"(biology) An animal organism living parasitically within the body of another animal.","examples":[{"sentence":"Entozoarians are often highly specialized to their host.","translation":"内生動物はしばしば宿主に高度に特化している。"},{"sentence":"Some entozoarians can cause serious diseases in their hosts.","translation":"一部の内生動物は、宿主に深刻な病気を引き起こす可能性がある。"}],"collocations":["intestinal entozoarian (腸内寄生生物)","parasitic entozoarian (寄生性の内生動物)"],"synonyms":["endoparasite","internal parasite"],"antonyms":["ectozoan","external parasite"]}],"etymology":{"value":"Derived from the Greek words 'entos' (within) + 'zoon' (animal) + '-arian' (suffix indicating belonging to or relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛntoʊzoʊˈɛəriən/","syllables":"en-to-zo-ar-i-an"},"inflection":{"noun_plural":"entozoarians"},"usage_notes":{"explanation":"The term 'entozoarian' is somewhat archaic and less commonly used in modern biology. The more common term is 'endoparasite'. It specifically refers to animal parasites that live inside the body of their host, distinguishing them from ectoparasites which live on the surface.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Entozoans live on the surface of animals.","correct":"✓ Entozoans live inside the bodies of animals.","note":"Entozoans are internal parasites, not external ones."}],"priority":"★★☆"},"related_words":{"derivatives":["entozoic (adjective: living within an animal)","entozoon (singular form, less common than entozoarian)"],"related_terms":["parasite","endoparasite","ectozoan","zoology"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Entozoarian' is a specialized term in biology, specifically zoology and parasitology. It refers to animal parasites that live inside the body of their host. Due to its specificity and limited use outside of academic contexts, it is considered a high-level vocabulary word. Understanding requires familiarity with biological terminology. The more common and accessible term is 'endoparasite'."},"example_sentences":[{"sentence":"The study focused on the diversity of entozoarian species found in local fish populations.","translation":"その研究は、地元の魚の個体群に見られる内生動物種の多様性に焦点を当てた。","type":"noun","meaning_category":"animal parasite"},{"sentence":"Some entozoarian infections can be difficult to diagnose.","translation":"一部の内生動物感染症は診断が難しい場合がある。","type":"noun","meaning_category":"animal parasite"}]}