{"word":"Muscardinidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤマネ科","english_definition":"A family of rodents in the order Rodentia, characterized by their dormouse-like appearance.","examples":[{"sentence":"The Muscardinidae family includes several species of dormice.","translation":"ヤマネ科には、ヤマネのいくつかの種が含まれています。"}],"collocations":["dormouse","rodent","mammal"],"synonyms":["dormouse family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Muscardinus,' which is of uncertain origin, possibly related to 'muscus' (moss) or 'muscardinus' (a kind of sweetmeat). The suffix '-idae' is a standard taxonomic suffix indicating a family.","priority":"★★☆"},"pronunciation":{"ipa":"/mʌˌskɑːrdɪˈnaɪdiː/","syllables":"Mus-car-di-ni-dae"},"inflection":{"noun_plural":"Muscardinids"},"usage_notes":{"explanation":"'Muscardinidae' is a taxonomic term used in scientific classification. It refers specifically to the family of rodents known as dormice. It is primarily used in biological and zoological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Muscardinidae is a species of dormouse.","correct":"✓ Muscardinidae is a family of dormice.","note":"Muscardinidae refers to the entire family, not a single species."}],"priority":"★★☆"},"related_words":{"derivatives":["Muscardinus (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Muscardinidae' is a scientific term used in zoology and biology to classify a specific family of rodents. Understanding this term requires familiarity with biological taxonomy and scientific nomenclature. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The conservation status of various species within the Muscardinidae family is a concern for ecologists.","translation":"ヤマネ科内の様々な種の保全状況は、生態学者にとって懸念事項です。","type":"noun","meaning_category":"ヤマネ科"},{"sentence":"Research on the Muscardinidae family contributes to our understanding of rodent evolution.","translation":"ヤマネ科に関する研究は、げっ歯類の進化に関する私たちの理解に貢献します。","type":"noun","meaning_category":"ヤマネ科"}]}