{"word":"amatorial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"性的な興味や魅力を引き起こす、またはそれらに関係する","english_definition":"arousing or appealing to sexual interest or desire; erotic.","examples":[{"sentence":"The amatorial nature of the artwork was considered controversial.","translation":"その芸術作品の性的な性質は物議を醸した。"},{"sentence":"The film contained several amatorial scenes.","translation":"その映画にはいくつかの性的なシーンが含まれていた。"}],"collocations":["amatorial art","amatorial photography","amatorial content"],"synonyms":["erotic","sexual","sensual","aphrodisiac","suggestive","risqué","salacious","lascivious"],"antonyms":["platonic","asexual","non-erotic"]}],"etymology":{"value":"Late 19th century: from Latin amatorius (from amator ‘lover’, from amare ‘to love’) + -al.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæməˈtɔːriəl/","syllables":"a-ma-to-ri-al"},"inflection":{"notes":"Adjective, comparative and superlative forms are more amatorial, most amatorial, but use is uncommon. More often expressed with 'more erotic' or 'most erotic'"},"usage_notes":{"explanation":"'Amatorial' is a somewhat formal and less common synonym for 'erotic' or 'sexual'. It specifically refers to something that is intended to arouse sexual desire or interest. It is often used in formal or academic contexts when discussing art, literature, or film. It is not typically used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The amatorial relationship between the two friends was unexpected.","correct":"✓ The romantic relationship between the two friends was unexpected.","note":"'Amatorial' describes the nature of something that arouses sexual interest, not the relationship itself. Use 'romantic' or 'sexual' to describe the relationship."},{"incorrect":"✗ He gave her an amatorial look.","correct":"✓ He gave her a suggestive look.","note":"'Amatorial' is more often used to describe things (art, literature, content) rather than actions or looks. 'Suggestive' or 'erotic' are better choices for describing a look."}],"priority":"★★☆"},"related_words":{"derivatives":["amatory (adjective): relating to or expressing love or sexual desire.","amatorially (adverb): in an amatorial manner (rare)."],"phrases":["amatorial literature","amatorial art","amatorial film"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Amatorial' is a sophisticated and relatively uncommon word used to describe something that is sexually suggestive or erotic. It is more formal than words like 'sexy' or 'erotic' and is often used in academic or critical contexts when discussing art, literature, or film. Because of its relative rarity and formal tone, it is best suited for advanced English speakers and writers."},"example_sentences":[{"sentence":"The museum featured a collection of amatorial sculptures from ancient Greece.","translation":"その美術館では、古代ギリシャの性的な彫刻のコレクションが展示されていました。","type":"adjective","meaning_category":"sexual"},{"sentence":"Critics debated the amatorial undertones of the novel's plot.","translation":"批評家たちは、その小説のプロットの性的な含みを議論しました。","type":"adjective","meaning_category":"sexual"},{"sentence":"The photographer's amatorial style was both praised and criticized.","translation":"その写真家の性的なスタイルは、賞賛も批判もされました。","type":"adjective","meaning_category":"sexual"}]}