{"word":"Christendom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"キリスト教世界、キリスト教国、キリスト教徒全体","english_definition":"(1) The worldwide community of Christians. (2) Those countries in which Christianity prevails.","examples":[{"sentence":"Throughout Christendom, Christmas is celebrated as the birth of Jesus Christ.","translation":"キリスト教世界全体で、クリスマスはイエス・キリストの誕生として祝われます。"},{"sentence":"The influence of Christendom waned in Europe during the Renaissance.","translation":"ルネサンス期に、ヨーロッパにおけるキリスト教世界の勢力は衰退しました。"},{"sentence":"Historically, Christendom has played a significant role in shaping Western civilization.","translation":"歴史的に、キリスト教世界は西洋文明の形成に重要な役割を果たしてきました。"}],"collocations":["the unity of Christendom (キリスト教世界の統一)","the borders of Christendom (キリスト教世界の境界)","the decline of Christendom (キリスト教世界の衰退)","Western Christendom (西洋キリスト教世界)","Eastern Christendom (東方キリスト教世界)"],"synonyms":["Christian world","Christian community","Christian sphere","Christian civilization"],"antonyms":["paganism","heathenism","secularism","atheism"]}],"etymology":{"value":"Middle English: from Old English Cristendōm, denoting the condition of being Christian, from Cristen ‘Christian’ + dōm ‘domain, jurisdiction’. The sense ‘Christian countries’ arose in late Middle English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪsəndəm/","syllables":"Chris-ten-dom"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Christendom\" refers to the collective body of Christians worldwide or to the countries where Christianity is the dominant religion. It often carries historical and cultural connotations, particularly in discussions about the influence of Christianity on Western civilization. The term can also evoke a sense of unity and shared identity among Christians, although this unity has been challenged by various divisions and conflicts throughout history. Usage is less common in contemporary contexts, where \"Christian world\" or \"Christian community\" might be preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He traveled all over the Christendom.","correct":"✓ He traveled all over Christendom.","note":"\"Christendom\" is generally used as an uncountable noun, so it doesn't usually take an article like \"the\" unless referring to a specific historical or geographical entity."},{"incorrect":"✗ Christendom is a person.","correct":"✓ Christendom is a collective term for Christians or Christian countries.","note":"\"Christendom\" refers to a group of people (Christians) or countries with a Christian majority, not an individual person."}],"priority":"★☆☆"},"related_words":{"derivatives":["Christian (adjective, noun)","Christianity (noun)","Christianize (verb)"],"idioms_phrases":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Christendom\" is a more formal and historical term referring to the worldwide community of Christians or the countries where Christianity is the dominant religion. It's often used in discussions about the historical and cultural influence of Christianity, particularly in Western civilization. Because of its historical and somewhat archaic nature, it's less commonly used in everyday conversation. Understanding its meaning requires familiarity with the history of Christianity and its impact on global culture."},"example_sentences":[{"sentence":"The medieval period saw the height of Christendom's power in Europe.","translation":"中世時代は、ヨーロッパにおけるキリスト教世界の権力の絶頂期でした。","type":"noun","meaning_category":"キリスト教世界"},{"sentence":"The concept of a unified Christendom has been challenged by various theological and political divisions.","translation":"統一されたキリスト教世界という概念は、さまざまな神学的および政治的分裂によって挑戦されてきました。","type":"noun","meaning_category":"キリスト教世界"},{"sentence":"The spread of Christianity led to the expansion of Christendom into new territories.","translation":"キリスト教の普及は、キリスト教世界の新たな地域への拡大につながりました。","type":"noun","meaning_category":"キリスト教世界"}]}