{"word":"homoanisic acid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ホモアニス酸：化学式CH3OC6H4CH2COOHで表される有機化合物。アニシンの誘導体であり、カルボキシル基がベンゼン環に直接結合しているアニス酸とは異なり、メチレン基（-CH2-）を介して結合している。","english_definition":"Homoanisic acid is an organic compound with the chemical formula CH3OC6H4CH2COOH. It is a derivative of anisole, differing from anisic acid (where the carboxyl group is directly attached to the benzene ring) by the presence of a methylene group (-CH2-) between the benzene ring and the carboxyl group.","examples":[{"sentence":"Homoanisic acid is used as a building block in organic synthesis.","translation":"ホモアニス酸は有機合成における構成要素として使用される。"},{"sentence":"The synthesis of certain pharmaceuticals involves homoanisic acid as an intermediate.","translation":"特定の医薬品の合成には、中間体としてホモアニス酸が関与する。"}],"collocations":["organic synthesis","pharmaceutical intermediate","chemical building block"],"synonyms":["4-methoxyphenylacetic acid","2-(4-methoxyphenyl)acetic acid"],"antonyms":[]}],"etymology":{"value":"'Homo-' は「同じ」または「類似の」を意味する接頭辞であり、アニス酸に構造的に類似していることを示す。'Anisic' はアニスに由来し、アニスに含まれるアニソールにちなんで名付けられた。'Acid' はカルボキシル基（-COOH）を持つ有機酸であることを示す。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌhoʊmoʊəˈnɪsɪk ˈæsɪd/","syllables":"ho-mo-a-ni-sic a-cid"},"inflection":{"notes":"名詞なので複数形は通常は形成されない。"},"usage_notes":{"explanation":"ホモアニス酸は、より複雑な分子の合成における中間体として、有機化学で主に使用される専門的な化学化合物です。一般的な用途は限られており、主に研究および特殊化学製品の製造に関連しています。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Homoanisic acid is a vitamin.","correct":"✓ Homoanisic acid is an organic acid used in chemical synthesis.","note":"ホモアニス酸はビタミンではありません。有機合成に使用される有機酸です。"},{"incorrect":"✗ Anisic acid and homoanisic acid are the same compound.","correct":"✓ Anisic acid and homoanisic acid are different compounds; homoanisic acid has an extra methylene group.","note":"アニス酸とホモアニス酸は同じ化合物ではありません。ホモアニス酸にはメチレン基が追加されています。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["anisole","anisic acid","methoxybenzene"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な化学用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"ホモアニス酸は、化学構造式CH3OC6H4CH2COOHで表される有機化合物です。アニソール誘導体であり、アニス酸とは異なり、ベンゼン環とカルボキシル基の間にメチレン基が存在します。主に有機合成の中間体として使用され、医薬品などの複雑な分子の構築に役立ちます。専門的な化学の文脈でのみ使用されるため、一般的な読者には馴染みのない用語です。"},"example_sentences":[{"sentence":"The researcher synthesized homoanisic acid to study its properties.","translation":"研究者はその特性を研究するためにホモアニス酸を合成した。","type":"general","meaning_category":"general"},{"sentence":"Homoanisic acid is a key intermediate in the production of this pharmaceutical drug.","translation":"ホモアニス酸はこの医薬品の製造における重要な中間体である。","type":"specific","meaning_category":"pharmaceutical"}]}