{"word":"mutuate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律)消費貸借する","english_definition":"(law, formal) to borrow (something fungible, such as money or grain) with the understanding that it will be replaced with something of the same kind and amount; to engage in a contract of mutuum.","examples":[{"sentence":"The bank mutuated a large sum of money to the company.","translation":"銀行はその会社に多額の金を消費貸借した。"},{"sentence":"The farmer mutuated grain from the local cooperative.","translation":"農家は地元の共同組合から穀物を消費貸借した。"}],"collocations":["mutuate money (金を消費貸借する)","mutuate goods (物を消費貸借する)"],"synonyms":["loan","lend","borrow (from the perspective of the borrower)"],"antonyms":["return","repay"]}],"etymology":{"value":"Derived from the Latin word \"mutuatus\", the past participle of \"mutuare\", meaning \"to borrow\". \"Mutuare\" itself comes from \"mutuus\", meaning \"reciprocal, mutual, borrowed\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmjuːtʃueɪt/","syllables":"mu-tu-ate"},"inflection":{"verb_forms":{"present_simple":["mutuate","mutuates"],"past_simple":"mutuated","past_participle":"mutuated","present_participle":"mutuating"}},"usage_notes":{"explanation":"\"Mutuate\" is a formal and somewhat rare term, primarily used in legal contexts to describe the act of entering into a contract of mutuum, which is a loan of fungible goods (goods that are interchangeable, like money or grain) where the borrower is obligated to return the same quantity and type of goods, rather than the exact same items. It's more common to use simpler terms like \"borrow\" or \"loan\" in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He mutuated his car to his friend.","correct":"✓ He loaned his car to his friend.","note":"\"Mutuate\" applies to fungible goods, not specific items like a car. Use \"loan\" instead."},{"incorrect":"✗ They mutuated the painting to the museum.","correct":"✓ They loaned the painting to the museum.","note":"Paintings are not fungible goods. Use \"loan\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["mutuation (noun: the act of borrowing under a contract of mutuum)","mutuum (noun: a contract in which one party transfers ownership of fungible goods to another, who is obligated to return an equal amount of the same kind)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, legal context only)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Mutuate\" is a specialized legal term referring to the act of borrowing fungible goods (like money or grain) under a specific type of contract called a mutuum. This term is rarely used outside of legal or academic discussions of contract law. It's important to understand that it applies only when the borrower is obligated to return the same quantity and type of goods, not the exact same items that were borrowed."},"example_sentences":[{"sentence":"The contract specified that the borrower would mutuate the funds at a fixed interest rate.","translation":"契約では、借り手は一定の金利で資金を消費貸借することが明記されていた。","type":"verb","meaning_category":"消費貸借する"},{"sentence":"In Roman law, the concept of mutuating grain was well-established for agricultural financing.","translation":"ローマ法では、穀物を消費貸借するという概念は、農業融資のために確立されていた。","type":"verb","meaning_category":"消費貸借する"}]}