{"word":"Dannock","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of unleavened cake or scone, especially associated with Scotland and Northern England.","english_definition":"A small, flat, unleavened cake or scone, typically made from oatmeal or barley flour; especially associated with Scotland and Northern England.","examples":[{"sentence":"She baked a batch of dannocks for the afternoon tea.","translation":"彼女は午後のティーのためにダノックを焼いた。"},{"sentence":"Dannocks were a staple food in rural Scotland.","translation":"ダノックはスコットランドの農村部で主食だった。"}],"collocations":["oatmeal dannock","barley dannock","bake dannocks","traditional dannock"],"synonyms":["scone","bannock","cake","flapjack"],"antonyms":[]}],"etymology":{"value":"The etymology of \"dannock\" is somewhat uncertain, but it is believed to be related to the word \"darn,\" meaning a patch or piece. This could refer to the small, flat shape of the cake. It is also possibly related to the Gaelic word \"bonnach,\" which refers to a similar type of cake.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdænək/","syllables":"Dan-nock"},"inflection":{"noun_plural":"dannocks"},"usage_notes":{"explanation":"Dannocks are a traditional food, particularly in Scotland and Northern England. They are simple to make, using basic ingredients like oatmeal or barley flour, water, and sometimes a little fat. They are typically cooked on a griddle or in a frying pan.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["bannock"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Dannock is a relatively obscure word referring to a specific type of unleavened cake or scone. It is most commonly encountered in the context of Scottish or Northern English cuisine. Understanding of this word requires familiarity with regional food traditions."},"example_sentences":[{"sentence":"For breakfast, we had fresh bannocks and dannocks with butter.","translation":"朝食には、焼きたてのバノックとダノックにバターを添えて食べた。","type":"noun","meaning_category":"food"},{"sentence":"She learned to make dannocks from her grandmother's old recipe.","translation":"彼女は祖母の古いレシピからダノックの作り方を学んだ。","type":"noun","meaning_category":"food"}]}