{"word":"sima","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(geology) The lower layer of the Earth's crust, consisting of rocks rich in silicon and magnesium.","english_definition":"The lower layer of the Earth's crust, consisting of rocks rich in silicon and magnesium.","examples":[{"sentence":"The sima is denser than the sial.","translation":"ジーマはシアルよりも密度が高い。"}],"collocations":[],"synonyms":["basaltic layer"],"antonyms":["sial"]}],"etymology":{"value":"A blend of SIlicon + MAgnesium. The term was coined from the chemical symbols of the two most abundant elements in this layer.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪmə/","syllables":"si-ma"},"inflection":{"noun_plural":"simas"},"usage_notes":{"explanation":"The term 'sima' is primarily used in geology and earth science contexts. It refers to the lower layer of the Earth's crust, which is typically found beneath the continents and oceans. It's characterized by its composition of silicon and magnesium-rich minerals. The term is often contrasted with 'sial', which refers to the upper layer of the Earth's crust, rich in silicon and aluminum.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The sima is on top of the sial.","correct":"The sial is on top of the sima.","note":"The sima is the lower layer, so it's beneath the sial."}],"priority":"★★☆"},"related_words":{"derivatives":["sial"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sima' is a technical term used in geology. It refers to the lower layer of the Earth's crust, composed mainly of silicon and magnesium. It's a relatively uncommon word outside of scientific contexts."},"example_sentences":[{"sentence":"Oceanic crust is primarily composed of sima.","translation":"海洋地殻は主にジーマで構成されている。","type":"noun","meaning_category":"geology"},{"sentence":"The Mohorovičić discontinuity marks the boundary between the crust and the mantle, lying below the sima.","translation":"モホロビチッチ不連続面は、地殻とマントルの境界を示し、ジーマの下に位置する。","type":"noun","meaning_category":"geology"}]}