{"word":"constellations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"星座","english_definition":"A group of stars forming a recognizable pattern that is traditionally named after its apparent form or identified with a mythological figure. Modern astronomers divide the sky into 88 constellations with defined boundaries.","examples":[{"sentence":"The Big Dipper is a well-known constellation.","translation":"北斗七星はよく知られた星座です。"},{"sentence":"Ancient mariners used the constellations to navigate.","translation":"古代の船乗りは航海のために星座を使った。"},{"sentence":"He pointed out several constellations in the night sky.","translation":"彼は夜空にいくつかの星座を指し示した。"}],"collocations":["observe constellations (星座を観察する)","study constellations (星座を研究する)","identify constellations (星座を特定する)","major constellations (主要な星座)","winter constellations (冬の星座)","summer constellations (夏の星座)"],"synonyms":["asterism (星群)","star pattern (星のパターン)"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin constellation-, from Latin constellatus, past participle of constellare ‘to furnish with stars’, from con- ‘with’ + stella ‘star’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒnstəˈleɪʃənz/","syllables":"con-stel-la-tions"},"inflection":{"noun_plural":"constellations"},"usage_notes":{"explanation":"'Constellations' refers to recognized patterns of stars in the night sky. These patterns have been named and often associated with mythological figures or animals. Modern astronomy uses 88 officially recognized constellations to divide the celestial sphere. It's important to note the difference between a constellation and an asterism; an asterism is a prominent pattern of stars within a larger constellation or spanning multiple constellations (e.g., the Big Dipper is an asterism within the constellation Ursa Major).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a constellation yesterday night.","correct":"✓ I saw a constellation last night.","note":"'Yesterday night' is not standard English. Use 'last night' instead."},{"incorrect":"✗ The constellations are very closer to each other.","correct":"✓ The stars in the constellation appear close to each other from our perspective on Earth.","note":"The stars that form a constellation are not necessarily physically close to each other in space. They only appear close from our vantage point on Earth. Use 'appear close to each other' to convey this idea."},{"incorrect":"✗  I believe in constellations and their influence on my life.","correct":"✓ I am interested in astrology and the supposed influence of constellations on my life.","note":"While constellations are astronomical objects, belief in their influence on human affairs is associated with astrology, not astronomy. If you are referring to the belief system, use 'astrology'."}],"priority":"★★☆"},"related_words":{"derivatives":["constellate (verb: to form or gather into a constellation)"],"phrases":["zodiac constellations (黄道十二星座)","circumpolar constellations (周極星)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'constellations' refers to groups of stars that form recognizable patterns in the night sky. These patterns have been given names, often from mythology. Modern astronomy divides the sky into 88 defined constellations. The word is used in discussions about astronomy, navigation, and cultural history related to how humans have observed the stars. While not an everyday word, it is commonly encountered in educational contexts and popular science writing. Understanding the difference between a constellation (a defined area of the sky) and an asterism (a recognizable pattern of stars) is helpful for precise communication.","priority":"★★☆"},"example_sentences":[{"sentence":"Orion is one of the most recognizable constellations in the winter sky.","translation":"オリオン座は冬の空で最も認識しやすい星座の一つです。","type":"general","meaning_category":"星"},{"sentence":"Many cultures have their own stories and interpretations of the constellations.","translation":"多くの文化が星座に関する独自の物語や解釈を持っています。","type":"cultural","meaning_category":"文化"},{"sentence":"Astronomers use constellations as reference points to locate other celestial objects.","translation":"天文学者は星座を、他の天体の位置を特定するための基準点として使用します。","type":"scientific","meaning_category":"科学"}]}