{"word":"Ruana","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ルアナ：南米アンデス地方のポンチョに似た、長方形または正方形の厚手のウール製アウターウェア。中央に頭を通すためのスリットまたは穴が開いている。","english_definition":"A ruana is a poncho-like outer garment, typically made of thick, soft wool, and native to the Andes region of South America, particularly Colombia and Venezuela. It is usually rectangular or square in shape with an opening or slit for the head.","examples":[{"sentence":"She wore a colorful ruana to keep warm in the chilly mountain air.","translation":"彼女は肌寒い山の空気の中で暖かく過ごすために、カラフルなルアナを羽織っていた。"},{"sentence":"The artisan demonstrated the traditional weaving techniques used to create a ruana.","translation":"職人はルアナを作るために使われる伝統的な織りの技術を実演した。"},{"sentence":"A ruana is a practical and stylish garment for cool weather.","translation":"ルアナは涼しい気候に実用的でおしゃれな衣服だ。"}],"collocations":["wear a ruana","wool ruana","traditional ruana","Andean ruana"],"synonyms":["poncho","cloak","shawl","wrap"],"antonyms":[]}],"etymology":{"value":"スペイン語の「ruana」に由来する。その語源は不明だが、アンデス地方の先住民の言語に由来する可能性が高い。","priority":"★★☆"},"pronunciation":{"ipa":"/ruˈɑːnə/","syllables":"ru-a-na"},"inflection":{"noun_plural":"ruanas"},"usage_notes":{"explanation":"「Ruana」は、南米アンデス地方、特にコロンビアとベネズエラで伝統的に使用されている衣服を指す言葉です。ポンチョに似ていますが、通常は長方形または正方形で、前面にスリットまたは穴があり、頭を通して着用します。厚手のウールで作られており、防寒具として使用されます。現代では、ファッションアイテムとしても人気があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a poncho, it's like a ruana.","correct":"✓ I bought a ruana, it's similar to a poncho.","note":"ルアナとポンチョは似ていますが、ルアナは通常、長方形または正方形です。"},{"incorrect":"✗ Ruanas are only for women.","correct":"✓ Ruanas are worn by both men and women.","note":"ルアナは男性も女性も着用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["poncho","aguayo","manta","frazada"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「Ruana」は、南米アンデス地方の伝統的な衣服を指す言葉で、英語圏ではあまり一般的ではありません。そのため、ある程度の英語力（B2レベル）が必要です。この単語は、地理、文化、ファッションに関連する文脈で登場する可能性があります。ポンチョに似た形状で、ウールで作られた防寒具であることを理解しておくと、文脈を把握しやすくなります。"},"example_sentences":[{"sentence":"The traveler purchased a beautiful ruana as a souvenir from Colombia.","translation":"旅行者はコロンビアのお土産として美しいルアナを購入した。","type":"example","meaning_category":"description"},{"sentence":"The model wore a stylish ruana over her dress on the runway.","translation":"モデルはランウェイでドレスの上にスタイリッシュなルアナを羽織っていた。","type":"example","meaning_category":"fashion"},{"sentence":"The shepherd wore a thick ruana to protect himself from the cold mountain winds.","translation":"羊飼いは冷たい山の風から身を守るために厚手のルアナを着ていた。","type":"example","meaning_category":"traditional use"}]}