{"word":"Euglena","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ミドリムシ","english_definition":"A genus of single-celled flagellate protists. They are characterized by their ability to perform photosynthesis when light is available, and to absorb nutrients from their environment when light is not available.","examples":[{"sentence":"Euglena are found in fresh water.","translation":"ミドリムシは淡水で見られる。"},{"sentence":"Euglena use a flagellum for movement.","translation":"ミドリムシは運動のために鞭毛を使う。"},{"sentence":"Euglena are being studied for their potential as a biofuel source.","translation":"ミドリムシはバイオ燃料源としての可能性について研究されている。"}],"collocations":["Euglena gracilis","Euglena culture","Euglena extract","Euglena supplement"],"synonyms":["green algae (大まかな分類)","flagellate"],"antonyms":[]}],"etymology":{"value":"The name \"Euglena\" comes from the Greek words \"eu\" (meaning \"good\" or \"true\") and \"glene\" (meaning \"eyeball\" or \"socket\"), referring to the presence of an eyespot (stigma) in many species.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈɡliːnə/","syllables":"Eu-gle-na"},"inflection":{"noun_plural":"Euglenas or Euglena (both are acceptable)"},"usage_notes":{"explanation":"Euglena is a genus name, so it is capitalized. While 'Euglenas' is a valid plural form, it's also common to use 'Euglena' as both the singular and plural form, especially in scientific contexts. Euglena are interesting because they are both plant-like (photosynthetic) and animal-like (motile and can consume food).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ euglena is a bacteria.","correct":"✓ Euglena is a protist.","note":"Euglena are not bacteria; they are single-celled eukaryotic organisms classified as protists."},{"incorrect":"✗ Euglena are plant.","correct":"✓ Euglena are protists that can perform photosynthesis.","note":"While Euglena perform photosynthesis like plants, they are not classified as plants."}],"priority":"★★☆"},"related_words":{"derivatives":["euglenoid (adjective: relating to or resembling euglenas; noun: a euglena-like organism)","euglenophyte (noun: a member of the phylum Euglenophyta, which includes Euglena)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1 (scientific contexts)","frequency_google_ngram":"Low frequency (専門的な文脈以外ではまれ)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Euglena\" refers to a specific type of single-celled organism that can both create its own food through photosynthesis and consume food from its environment. It's a term primarily used in biology and related scientific fields. Understanding this word requires some background knowledge in biology, particularly regarding the classification of microorganisms. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Some species of **Euglena** are used in nutritional supplements.","translation":"ミドリムシのいくつかの種は栄養補助食品に使用されている。","type":"noun","meaning_category":"生物学"},{"sentence":"**Euglena** have a unique ability to survive in diverse environments.","translation":"ミドリムシは多様な環境で生き残るためのユニークな能力を持っている。","type":"noun","meaning_category":"生物学"},{"sentence":"The movement of **Euglena** is facilitated by its flagellum.","translation":"ミドリムシの運動は鞭毛によって促進される。","type":"noun","meaning_category":"生物学"}]}