{"word":"distractingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"気が散るように、注意をそらすように、邪魔になるほど","english_definition":"in a way that prevents someone from giving their attention to something; in a manner that diverts attention.","examples":[{"sentence":"The music was distractingly loud.","translation":"音楽が気が散るほどうるさかった。"},{"sentence":"She found his constant fidgeting distractingly annoying.","translation":"彼女は彼の絶え間ないそわそわした動きが、気が散るほど不快だと感じた。"},{"sentence":"The bright colors in the room were distractingly vibrant.","translation":"部屋の鮮やかな色彩は、気が散るほど鮮やかだった。"}],"collocations":["distractingly loud (気が散るほどうるさい)","distractingly bright (気が散るほど明るい)","distractingly attractive (気が散るほど魅力的)","distractingly annoying (気が散るほど不快な)","distractingly beautiful (気が散るほど美しい)"],"synonyms":["disruptively","obtrusively","interferingly","troublesomely","annoyingly","irritatingly"],"antonyms":["unobtrusively","inconspicuously","subtly","helpfully","supportively"]}],"etymology":{"value":"The word \"distractingly\" is formed by adding the suffix \"-ly\" to the adjective \"distracting.\" \"Distracting\" comes from the verb \"distract,\" which originates from the Latin word \"distrahere,\" meaning \"to draw in different directions.\" This reflects the idea of pulling someone's attention away from something.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈstræktɪŋli/","syllables":"dis-trac-ting-ly"},"inflection":{"notes":"As an adverb, \"distractingly\" does not have different inflections."},"usage_notes":{"explanation":"\"Distractingly\" is used to describe something that is so attention-grabbing or disruptive that it makes it difficult to focus on what one is supposed to be doing. It often implies a negative impact on concentration or performance. The intensity of the distraction is significant enough to be noteworthy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The noise was distractingly, so I couldn't concentrate.","correct":"✓ The noise was distracting, so I couldn't concentrate.","note":"\"Distracting\" is the adjective form, describing the noise itself as causing distraction. \"Distractingly\" is the adverb, describing how the noise affected the ability to concentrate."},{"incorrect":"✗ She distractingly looked at her phone during the meeting.","correct":"✓ She was distractingly looking at her phone during the meeting. / ✓ She looked distractedly at her phone during the meeting.","note":"The first correction uses the adjective form \"distracting\" to describe her action of looking at the phone. The second uses the adverb \"distractedly\" to describe how she looked at her phone."}],"priority":"★★☆"},"related_words":{"derivatives":["distract (verb)","distraction (noun)","distracting (adjective)","distracted (adjective)","distractedly (adverb)"],"phrasal_verbs":[],"related_concepts":["attention deficit","focus","concentration","interference","noise","stimulus","stimuli"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"distractingly\" is an adverb that describes something that makes it difficult to pay attention. It's used when something is so noticeable or disruptive that it pulls your focus away from what you're trying to do. For example, if a phone is ringing \"distractingly\" loudly, it means the ringing is so loud that it's hard to concentrate on anything else. It's a more advanced word, so you'll typically find it in more complex texts or conversations."},"example_sentences":[{"sentence":"The flashing lights were distractingly bright, making it hard to see the stage.","translation":"点滅するライトが気が散るほど明るく、舞台が見えにくかった。","type":"adverb","meaning_category":"disturbing focus"},{"sentence":"He found the constant chatter in the library distractingly disruptive to his studies.","translation":"彼は図書館での絶え間ないおしゃべりが、勉強の邪魔になるほど気が散ると感じた。","type":"adverb","meaning_category":"disruptive"},{"sentence":"The perfume she was wearing was distractingly strong.","translation":"彼女がつけていた香水は、気が散るほど強かった。","type":"adverb","meaning_category":"overpowering"}]}