{"word":"Stonifiable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)石打ちに処すべき、石打ち刑に値する","english_definition":"Deserving of or liable to be punished by stoning.","examples":[{"sentence":"Adultery was once a stonifiable offense in some societies.","translation":"姦通はかつて、一部の社会において石打ちに処すべき罪であった。"},{"sentence":"The law made certain acts stonifiable.","translation":"その法律は特定の行為を石打ち刑に値するものとした。"}],"collocations":["stonifiable offense","stonifiable act","stonifiable crime"],"synonyms":["capital","punishable by death"],"antonyms":["legal","lawful","permissible"]}],"etymology":{"value":"From 'stone' + '-ify' + '-able'. 'Stone' refers to the act of throwing stones, '-ify' means to make or cause, and '-able' means capable of being.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊnɪfaɪəbəl/","syllables":"sto-ni-fi-a-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are stonifiabler and stonifiablest, but these are rarely used."},"usage_notes":{"explanation":"'Stonifiable' is a relatively rare word that is primarily used in historical or legal contexts to describe actions or offenses that were punishable by stoning. Stoning is a form of capital punishment where a group throws stones at a person until they die.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vase was stonifiable.","correct":"✓ The vase was fragile.","note":"'Stonifiable' refers to a crime or action, not an object. Use 'fragile' to describe something easily broken."},{"incorrect":"✗ He was stonifiable because he was annoying.","correct":"✓ His actions were stonifiable according to the old laws.","note":"'Stonifiable' is a legal term, not a general term for dislike. It should be used in the context of laws or historical practices."}],"priority":"★★☆"},"related_words":{"derivatives":["stone (noun, verb)","stoning (noun)","lapidate (verb - to stone)","lapidation (noun - the act of stoning)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Stonifiable' is a rare and specialized term, primarily used in historical or legal contexts to describe actions that were punishable by stoning. Due to its limited use and specific meaning, it is not commonly encountered in general language. Understanding the word requires knowledge of historical forms of punishment and legal terminology."},"example_sentences":[{"sentence":"In ancient times, certain religious transgressions were considered stonifiable offenses.","translation":"古代において、特定の宗教的違反行為は石打ちに処すべき罪とみなされていた。","type":"general","meaning_category":"legal"},{"sentence":"The historical documents described several stonifiable crimes and their punishments.","translation":"その歴史的文書は、石打ちに処すべきいくつかの犯罪とその刑罰について記述していた。","type":"historical","meaning_category":"legal"}]}