{"word":"Pan-Germanic","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"汎ゲルマン主義の、全ゲルマン民族主義の","english_definition":"relating to the idea or advocacy of a political unification of all Germanic-speaking peoples.","examples":[{"sentence":"Pan-Germanic ideology was influential in the early 20th century.","translation":"汎ゲルマン主義思想は20世紀初頭に影響力を持っていた。"},{"sentence":"The Pan-Germanic League promoted the idea of a unified German nation.","translation":"汎ゲルマン連盟は統一ドイツ国家の思想を推進した。"}],"collocations":["Pan-Germanic ideology","Pan-Germanic movement","Pan-Germanic nationalism","Pan-Germanic League"],"synonyms":["German nationalist","irredentist"],"antonyms":[]}],"etymology":{"value":"'Pan-' (all) + 'Germanic'. Refers to the idea of unifying all Germanic peoples into a single nation or political entity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæn dʒərˈmænɪk/","syllables":"Pan-Ger-man-ic"},"inflection":{},"usage_notes":{"explanation":"'Pan-Germanic' refers specifically to the political and cultural ideology advocating for the unification of all Germanic-speaking peoples. It is often associated with historical movements and ideologies, particularly in the 19th and early 20th centuries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Pan-Germanic movement included only people from Germany.","correct":"✓ The Pan-Germanic movement aimed to include all Germanic-speaking peoples, not just those from Germany.","note":"The Pan-Germanic movement aimed to unite all Germanic-speaking peoples, including those from Austria, Switzerland, the Netherlands, Scandinavia, and other regions."}],"priority":"★★☆"},"related_words":{"derivatives":["Pan-Germanism (noun)"],"phrases":["Germanic","Pan-Slavism","nationalism"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Pan-Germanic' is a specialized term relating to a specific historical and political ideology. It is not commonly used in everyday language but is relevant in discussions of history, political science, and nationalism."},"example_sentences":[{"sentence":"The Pan-Germanic movement sought to unite all Germanic peoples under a single banner.","translation":"汎ゲルマン主義運動は、すべてのゲルマン民族を一つの旗の下に団結させようとした。","type":"general","meaning_category":"relating to the unification of Germanic peoples"}]}