{"word":"disprovability","meanings":[{"part_of_speech":"noun","definition":"反証可能性、反駁可能性","english_definition":"The quality of being capable of being proven false or refuted.","examples":[{"sentence":"The disprovability of a scientific hypothesis is essential for it to be considered valid.","translation":"科学的仮説が有効であると見なされるためには、その反証可能性が不可欠である。"},{"sentence":"Popper argued that disprovability is what distinguishes scientific theories from non-scientific ones.","translation":"ポパーは、反証可能性こそが科学理論を非科学的な理論から区別するものだと主張した。"}],"collocations":["scientific disprovability","test for disprovability","principle of disprovability"],"synonyms":["falsifiability","refutability","testability"],"antonyms":["provability","verifiability","confirmability"]},{"part_of_speech":"noun","definition":"(一般的に)誤りであることを証明できる性質","english_definition":"The state or quality of being able to be shown to be untrue or incorrect.","examples":[{"sentence":"The disprovability of the claim made it difficult to accept.","translation":"その主張の反証可能性が、それを受け入れることを困難にした。"}],"collocations":["inherent disprovability"],"synonyms":["falseness","incorrectness","untruthfulness"],"antonyms":["truth","correctness","accuracy"]}],"etymology":{"value":"Derived from 'disprovable,' which comes from 'disprove' (to prove to be false) + '-able' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪspruːvəˈbɪləti/","syllables":"dis-prov-a-bil-i-ty"},"inflection":{"noun_plural":"disprovabilities (rarely used)"},"usage_notes":{"explanation":"'Disprovability' is a key concept in the philosophy of science, particularly associated with Karl Popper. It refers to the idea that a scientific theory must be formulated in such a way that it is possible to conceive of evidence that would contradict it. If a theory is not disprovable, it is considered unscientific. The term is also used more generally to describe the quality of a statement or claim that can be shown to be false.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The theory has no disprovability, so it must be true.","correct":"The theory has no disprovability, so it is not scientific.","note":"Lack of disprovability does not mean something is true, only that it cannot be tested scientifically."}],"priority":"★★☆"},"related_words":{"derivatives":["disprove","disprovable","disproof"],"related_concepts":["falsification","Popperian philosophy","scientific method","hypothesis testing"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disprovability' is a complex term primarily used in philosophy of science. It means that a statement or theory can be shown to be false through evidence or testing. This concept is important in determining whether something can be considered a valid scientific theory. If a theory cannot be disproven, it's not considered scientific, even if it seems logical or intuitive. It's a term you'll likely encounter in academic discussions about science and knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"The scientist designed an experiment to test the disprovability of his hypothesis.","translation":"科学者は、自身の仮説の反証可能性をテストするための実験を設計した。","type":"scientific","meaning_category":"反証可能性"},{"sentence":"The lack of disprovability in the politician's claims made them suspicious.","translation":"政治家の主張には反証可能性が欠けていたため、疑わしいものとなった。","type":"general","meaning_category":"誤りであることを証明できる性質"}]}