{"word":"unintonable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"発音変化（イントネーション）をつけることができない、または適切でない","english_definition":"Not capable of being intoned or uttered with intonation; not suitable for intonation.","examples":[{"sentence":"The monotone voice made the speech sound unintonable.","translation":"単調な声のせいで、スピーチがイントネーションをつけられないように聞こえた。"},{"sentence":"Certain words, when used in specific contexts, can become practically unintonable.","translation":"特定の単語は、特定の文脈で使用されると、実際にはイントネーションを付けることができなくなることがある。"}],"collocations":["unintonable speech","unintonable phrase","unintonable utterance"],"synonyms":["monotonous","flat","unmodulated","uninflected"],"antonyms":["intonable","modulated","inflected"]},{"part_of_speech":"adjective","definition":"（音楽で）音程をつけることができない、または適切でない","english_definition":"(Music) Not capable of being intoned; not suitable for singing or playing with proper pitch.","examples":[{"sentence":"The melody was so dissonant that it felt unintonable.","translation":"そのメロディーは非常に不協和音だったので、音程をつけることができないように感じられた。"}],"collocations":["unintonable melody","unintonable passage","unintonable note"],"synonyms":["out of tune","dissonant","atonal"],"antonyms":["intonable","tuneful","melodious"]}],"etymology":{"value":"The word 'unintonable' is formed by adding the prefix 'un-' (meaning 'not') to the word 'intonable'. 'Intonable' comes from 'intone,' which means to utter with a particular tone or pitch, especially in a monotone.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnɪnˈtoʊnəbəl/","syllables":"un-in-ton-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are less common for 'unintonable' due to its descriptive nature."},"usage_notes":{"explanation":"'Unintonable' is a relatively rare word, primarily used in contexts related to speech or music where the ability to vary pitch or tone is absent or inappropriate. In speech, it describes utterances that lack normal intonation patterns, often sounding monotone. In music, it refers to passages or melodies that are difficult or impossible to perform with proper pitch.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The singer's voice was un-tunable.","correct":"✓ The singer's voice was unintonable.","note":"'Unintonable' refers to the inability to vary pitch or intonation, while 'un-tunable' (less common) would imply something cannot be brought into tune."},{"incorrect":"✗ The text was unintonable because it was poorly written.","correct":"✓ The text was difficult to read aloud with expression.","note":"Poor writing might make a text difficult to read expressively, but 'unintonable' specifically relates to the lack of pitch variation, not general readability."}],"priority":"★☆☆"},"related_words":{"derivatives":["intonable","intonation","intone","un- (prefix)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unintonable' is a specialized term primarily used in linguistic or musical contexts. It describes something that cannot be uttered with varied pitch or tone (intonation). This word is not commonly encountered in everyday language and requires a good understanding of the related concepts of intonation and musical pitch. Its use is generally limited to academic or technical discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The robotic voice sounded completely unintonable, lacking any human emotion.","translation":"ロボットの声は完全にイントネーションがなく、人間の感情が全く感じられなかった。","type":"adjective","meaning_category":"speech"},{"sentence":"The composer intentionally wrote an unintonable passage to create a sense of unease.","translation":"作曲家は不安感を出すために、意図的に音程をつけることができない部分を書いた。","type":"adjective","meaning_category":"music"}]}