{"word":"trapezium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"台形（イギリス英語）","english_definition":"A quadrilateral with no parallel sides (British English).","examples":[{"sentence":"The shape of the field was a trapezium.","translation":"その畑の形は台形だった。"}],"synonyms":["trapezoid (American English)"],"antonyms":[],"notes":"In British English, 'trapezium' refers to a quadrilateral with no parallel sides. This is different from the American English definition of 'trapezoid'."},{"part_of_speech":"noun","definition":"(解剖学) 大菱形骨","english_definition":"(anatomy) The carpal bone on the thumb side of the hand that articulates with the metacarpal bone of the thumb.","examples":[{"sentence":"The trapezium is one of the bones in the wrist.","translation":"大菱形骨は手首の骨の一つです。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Late Latin trapezium, from Greek trapezion 'irregular quadrilateral,' literally 'a little table,' from trapeza 'table,' from tra- 'four' + peza 'foot, leg.' The geometric sense is attested from 1570s.","priority":"★★☆"},"pronunciation":{"ipa":"/trəˈpiːziəm/","syllables":"tra-pe-zi-um"},"inflection":{"noun_plural":"trapeziums"},"usage_notes":{"explanation":"In British English, a 'trapezium' is a quadrilateral with *no* parallel sides. This contrasts with American English, where the same shape is usually called a 'trapezoid.' Be aware of this difference to avoid confusion. In anatomy, 'trapezium' refers to a specific bone in the wrist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I drew a trapezoid, which is a four-sided shape with no parallel sides.","correct":"✓ I drew a trapezium, which is a four-sided shape with no parallel sides. (British English)","note":"Use 'trapezium' if you are using British English to describe a quadrilateral with no parallel sides. In American English, the correct term would be 'trapezoid'."}],"priority":"★★☆"},"related_words":{"derivatives":["trapezoidal (adjective)"],"related_terms":["trapezoid (American English equivalent for the geometric shape)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'trapezium' has two main meanings. In geometry (particularly in British English), it refers to a four-sided shape with no parallel sides. In anatomy, it refers to a specific bone in the wrist. The geometric meaning is more common, but be aware of the anatomical meaning in relevant contexts. Also, remember the difference in terminology between British and American English for the geometric shape: 'trapezium' (BrE) is often called 'trapezoid' (AmE)."},"example_sentences":[{"sentence":"The architect designed the window in the shape of a trapezium.","translation":"建築家は窓を台形の形に設計した。","type":"noun","meaning_category":"台形 (幾何学)"},{"sentence":"The trapezium bone is located near the base of the thumb.","translation":"大菱形骨は親指の付け根付近に位置している。","type":"noun","meaning_category":"大菱形骨 (解剖学)"}]}