{"word":"nonrepatriation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"本国送還の禁止、非送還","english_definition":"The act or policy of not returning someone to their country of origin, especially due to fears of persecution or other dangers.","examples":[{"sentence":"The policy of nonrepatriation was adopted to protect refugees from political persecution.","translation":"政治的迫害から難民を保護するために、非送還政策が採用された。"},{"sentence":"Nonrepatriation is a key principle in international refugee law.","translation":"非送還は国際難民法の重要な原則である。"},{"sentence":"They were granted nonrepatriation status due to the unstable political situation in their home country.","translation":"彼らは本国が不安定な政治状況にあるため、非送還の地位を与えられた。"}],"collocations":["policy of nonrepatriation","principle of nonrepatriation","grant nonrepatriation status","seek nonrepatriation","ensure nonrepatriation"],"synonyms":["non-refoulement","asylum","refuge"],"antonyms":["repatriation","deportation","extradition"]}],"etymology":{"value":"Derived from \"repatriation\" (the act of returning someone to their country of origin) with the addition of the prefix \"non-\" (meaning not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnriˌpeɪtriˈeɪʃən/","syllables":"non-re-pa-tri-a-tion"},"inflection":{"noun_plural":"nonrepatriations"},"usage_notes":{"explanation":"\"Nonrepatriation\" is primarily used in legal and political contexts, particularly when discussing refugee rights, asylum, and international law. It is often used interchangeably with \"non-refoulement,\" although \"nonrepatriation\" can sometimes have a broader scope. The term emphasizes the protection of individuals from being forced to return to a country where they face serious threats.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonrepatriation of the money was a problem.","correct":"✓ The non-repatriation of funds caused concern.","note":"The term is generally used for people, not money or other assets. Use 'non-repatriation of funds' or similar for assets."},{"incorrect":"✗ He was nonrepatriated to his country.","correct":"✓ He was granted nonrepatriation status.","note":"'Nonrepatriation' is a noun, not a verb. Use it to describe a policy or status, not an action done to someone."}],"priority":"★☆☆"},"related_words":{"derivatives":["repatriation","repatriate","non-refoulement","refugee","asylum"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonrepatriation\" is a formal term primarily used in legal and political discussions, especially concerning refugees and international law. It means not returning someone to their country of origin, usually because they face danger or persecution there. This word is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The organization advocates for the nonrepatriation of individuals facing persecution.","translation":"その組織は、迫害に直面している人々の非送還を提唱している。","type":"noun","meaning_category":"非送還"},{"sentence":"The principle of nonrepatriation is enshrined in international law.","translation":"非送還の原則は国際法に明記されている。","type":"noun","meaning_category":"非送還"},{"sentence":"They sought nonrepatriation due to fears of political violence in their homeland.","translation":"彼らは故郷での政治的暴力への恐れから、非送還を求めた。","type":"noun","meaning_category":"非送還"}]}