{"word":"Jahvistic","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"ヤハウェ資料(J資料)の、ヤハウェ資料に特徴的な","english_definition":"Relating to or characteristic of the Jahwist source (J source) of the Pentateuch.","examples":[{"sentence":"The Jahvistic narrative emphasizes God's direct interaction with humanity.","translation":"ヤハウェ資料の物語は、神と人類の直接的な交流を強調している。"}],"collocations":["Jahvistic source","Jahvistic tradition","Jahvistic narrative"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Jahwist' comes from the German transliteration of the tetragrammaton YHWH (יהוה), the name of God in Hebrew, which is rendered as 'Jahwe' in German. The suffix '-istic' indicates a characteristic or relating to.","priority":"中"},"pronunciation":{"ipa":"/dʒɑːˈvɪstɪk/","syllables":"Jah-vis-tic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Jahvistic' is primarily used in biblical studies and theology to describe aspects related to the Jahwist source, one of the hypothesized sources of the Pentateuch (the first five books of the Hebrew Bible/Old Testament). The Jahwist source is characterized by its use of the name Yahweh (Jahwe in German) for God, its anthropomorphic descriptions of God, and its narrative style.","priority":"高"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":["Jahwist","J source","Pentateuch","Deuteronomistic","Elohistic","Priestly source"],"priority":"中"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"'Jahvistic' is a specialized term used in biblical studies. It refers to characteristics associated with the Jahwist source, a hypothetical author or group of authors believed to have contributed to the Pentateuch. Understanding this term requires familiarity with the documentary hypothesis and the different sources proposed within it."},"example_sentences":[{"sentence":"The use of anthropomorphism is a characteristic feature of the Jahvistic passages.","translation":"擬人観の使用は、ヤハウェ資料の箇所に特徴的な特徴である。","type":"adjective","meaning_category":"特徴的な"},{"sentence":"Scholars debate the extent of Jahvistic influence on the final form of Genesis.","translation":"学者たちは、創世記の最終的な形に対するヤハウェ資料の影響の程度について議論している。","type":"adjective","meaning_category":"関連する"}]}