{"word":"self-outlawed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"自ら無法者となった、自ら社会から追放された","english_definition":"Having put oneself outside the protection of the law or social norms; having become an outlaw by one's own actions or choices.","examples":[{"sentence":"The rebel leader became self-outlawed after defying the king's decree.","translation":"その反乱軍のリーダーは、王の命令に背いた後、自ら無法者となった。"},{"sentence":"He lived a solitary life in the wilderness, a self-outlawed exile from society.","translation":"彼は荒野で孤独な生活を送った。社会から自ら追放された亡命者として。"}],"collocations":["become self-outlawed","a self-outlawed exile","a self-outlawed rebel"],"synonyms":["exiled","ostracized","renegade","fugitive","outcast"],"antonyms":["accepted","integrated","law-abiding"]},{"part_of_speech":"verb","definition":"(過去形/過去分詞) 自ら無法者となる、自ら社会から追放される","english_definition":"(past tense/past participle) To put oneself outside the protection of the law or social norms; to become an outlaw by one's own actions or choices.","examples":[{"sentence":"He self-outlawed himself by refusing to cooperate with the authorities.","translation":"彼は当局への協力を拒否することで、自ら無法者となった。"},{"sentence":"They self-outlawed themselves when they abandoned their community and embraced a life of crime.","translation":"彼らはコミュニティを捨て、犯罪の道を選んだ時、自ら社会から追放された。"}],"collocations":["self-outlaw oneself","self-outlawed from society"],"synonyms":["exile oneself","ostracize oneself","become a renegade","become a fugitive","become an outcast"],"antonyms":["integrate oneself","conform","abide by the law"]}],"etymology":{"value":"The word is formed by combining \"self-\" (referring to oneself) with \"outlawed\" (having been declared an outlaw). It describes the act of making oneself an outlaw through one's own actions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈaʊˌlɔːd/","syllables":"self-out-lawed"},"inflection":{"verb_forms":{"present_simple":["self-outlaws"],"past_simple":"self-outlawed","past_participle":"self-outlawed","present_participle":"self-outlawing"}},"usage_notes":{"explanation":"\"Self-outlawed\" describes a state or action where an individual has, through their own choices and behavior, placed themselves outside the protection and norms of society or the law. It implies a deliberate act of defiance or separation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was self outlawed by the king.","correct":"✓ He was outlawed by the king. / ✓ He self-outlawed himself by defying the king.","note":"\"Self-outlawed\" implies the action was initiated by the person themselves. If someone is declared an outlaw by an external authority, use \"outlawed.\" If they made themselves an outlaw, use \"self-outlawed himself.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["outlaw (noun, verb)","outlawed (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"self-outlawed\" is a relatively uncommon and sophisticated term. It describes someone who has, through their own actions, placed themselves outside the protection of the law or social norms. This often implies a deliberate act of defiance or rebellion. The term is most likely to be encountered in historical or literary contexts. Understanding the term requires a good grasp of the meanings of \"self\" and \"outlawed\" and the ability to combine them to understand the overall meaning."},"example_sentences":[{"sentence":"The pirate captain became self-outlawed after years of raiding coastal towns.","translation":"その海賊の船長は、沿岸の町を長年襲撃した後、自ら無法者となった。","type":"adjective","meaning_category":"自ら無法者となった"},{"sentence":"By refusing to pay taxes and openly criticizing the government, he effectively self-outlawed himself.","translation":"納税を拒否し、公然と政府を批判することで、彼は事実上、自ら無法者となった。","type":"verb","meaning_category":"自ら無法者となる"}]}