{"word":"shipway","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"造船台、船台","english_definition":"A sloping structure on which a ship is built and launched.","examples":[{"sentence":"The new ship was launched from the shipway.","translation":"新しい船は船台から進水した。"},{"sentence":"Workers were busy on the shipway, constructing the hull.","translation":"作業員たちは船台で船体の建造に忙しかった。"}],"collocations":["launch from a shipway","construct on a shipway"],"synonyms":["slipway","building slip"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的な意味合いで)造船所","english_definition":"(Historically) A shipyard.","examples":[{"sentence":"The old shipway was once a bustling center of shipbuilding.","translation":"その古い船台はかつて賑やかな造船の中心地だった。"}],"collocations":[],"synonyms":["shipyard"],"antonyms":[]}],"etymology":{"value":"'Ship' + 'way'. The 'way' refers to the sloping path or structure that allows the ship to slide into the water.","priority":"★★★"},"pronunciation":{"ipa":"ˈʃɪpˌweɪ","syllables":"ship-way"},"inflection":{"noun_plural":"shipways"},"usage_notes":{"explanation":"A 'shipway' is a specific structure used for building and launching ships. It's a sloped surface that allows the vessel to slide into the water. While sometimes used synonymously with 'shipyard', 'shipyard' refers to the entire facility where ships are built and repaired, whereas 'shipway' is the specific structure within the shipyard.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The shipway was floating on the water.","correct":"✓ The ship was floating on the water after being launched from the shipway.","note":"The shipway is a structure on land, not floating. The ship floats after being launched from it."}],"priority":"★★☆"},"related_words":{"derivatives":["shipbuilding","shipyard","shipwright"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Shipway' refers to a specialized structure used in shipbuilding. It's a sloped surface on which ships are constructed and from which they are launched into the water. Understanding this term requires some familiarity with maritime and shipbuilding terminology."},"example_sentences":[{"sentence":"The massive cruise liner was carefully lowered into the sea from the shipway.","translation":"巨大なクルーズ客船は慎重に船台から海に降ろされた。","type":"noun","meaning_category":"造船台"},{"sentence":"The historical documents detailed the construction of the shipway in the 18th century.","translation":"その歴史的な文書は18世紀の船台の建設について詳しく述べていた。","type":"noun","meaning_category":"造船台"},{"sentence":"Engineers inspected the shipway for structural integrity before the launch.","translation":"技術者たちは進水前に船台の構造的完全性を検査した。","type":"noun","meaning_category":"造船台"}]}