{"word":"underlease","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"転貸借、又貸し（契約）","english_definition":"A lease granted by a tenant to another person for a period shorter than that held by the tenant.","examples":[{"sentence":"The company entered into an underlease agreement with a smaller firm.","translation":"その会社は、より小規模な会社と転貸借契約を締結した。"},{"sentence":"The underlease specified the terms and conditions of the subletting arrangement.","translation":"転貸借契約には、又貸し契約の条件が明記されていた。"}],"collocations":["grant an underlease","enter into an underlease","terms of the underlease","underlease agreement"],"synonyms":["sublease","subletting","subtenancy"],"antonyms":["headlease","overlease"]},{"part_of_speech":"verb","definition":"転貸する、又貸しする","english_definition":"To grant a lease to another person for a period shorter than that held by the tenant.","examples":[{"sentence":"The tenant was not allowed to underlease the property without the landlord's consent.","translation":"賃借人は、家主の同意なしに物件を転貸することは許可されていなかった。"},{"sentence":"They decided to underlease a portion of their office space.","translation":"彼らはオフィススペースの一部を転貸することにした。"}],"collocations":["underlease a property","underlease a portion of","be allowed to underlease"],"synonyms":["sublease","sublet"],"antonyms":["overlease"]}],"etymology":{"value":"'Under-' (below, subordinate) + 'lease'. Indicates a lease that is subordinate to an existing lease.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərliːs/","syllables":"un-der-lease"},"inflection":{"noun_plural":"underleases","verb_forms":{"present_simple":["underlease","underleases"],"past_simple":"underleased","past_participle":"underleased","present_participle":"underleasing"}},"usage_notes":{"explanation":"An 'underlease' (or 'sublease') is a lease created by a tenant (lessee) out of their own leasehold interest, where the term of the underlease is shorter than the term of the original lease. The original tenant becomes the 'underlessor', and the new tenant becomes the 'underlessee'. Permission from the original landlord may be required.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He underleased the property for the same term as his lease.","correct":"✓ He subleased the property for a shorter term than his lease.","note":"An underlease must be for a term shorter than the original lease. If it's for the same term, it's technically an assignment, not an underlease."},{"incorrect":"✗ You can underlease without asking the landlord.","correct":"✓ You usually need to ask the landlord for permission to underlease.","note":"Most leases require the tenant to obtain the landlord's consent before underleasing the property."}],"priority":"★★☆"},"related_words":{"derivatives":["underlessor (noun): The tenant who grants an underlease.","underlessee (noun): The person to whom an underlease is granted."],"synonyms":["sublease","subletting"],"antonyms":["headlease","overlease"],"related_legal_terms":["leasehold","landlord","tenant","covenant","assignment"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in legal and real estate contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'underlease' is a legal and real estate term referring to a lease created by a tenant out of their own leasehold interest, for a period shorter than their own lease. It's crucial to understand that the underlease cannot be for the same duration as the original lease. This term is generally used in formal and legal contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The company decided to **underlease** part of its office space to another business.","translation":"その会社はオフィススペースの一部を別の会社に転貸することにした。","type":"verb","meaning_category":"転貸する"},{"sentence":"The terms of the **underlease** were clearly outlined in the agreement.","translation":"転貸借の条件は契約書に明確に記載されていた。","type":"noun","meaning_category":"転貸借契約"},{"sentence":"Before you **underlease** the property, make sure you have the landlord's written consent.","translation":"物件を転貸する前に、家主の書面による同意を得ていることを確認してください。","type":"verb","meaning_category":"転貸する"},{"sentence":"The **underlease** must expire before the original lease.","translation":"転貸借契約は、元の賃貸借契約よりも前に満了しなければならない。","type":"noun","meaning_category":"転貸借契約"}]}