{"word":"apoplectically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"卒中を起こしたように、激怒して","english_definition":"in a manner characteristic of apoplexy; in a state of extreme fury or rage.","examples":[{"sentence":"He turned apoplectically red in the face.","translation":"彼は卒中を起こしたかのように顔を真っ赤にした。"},{"sentence":"She screamed apoplectically at the suggestion.","translation":"彼女はその提案に激怒して叫んだ。"}],"collocations":["apoplectically angry","apoplectically furious","apoplectically red"],"synonyms":["furiously","enragedly","irately","with great anger","with extreme rage"],"antonyms":["calmly","peacefully","placidly","mildly"]}],"etymology":{"value":"Derived from 'apoplectic', which comes from the Greek word 'apoplexia' meaning 'a striking away', referring to a sudden loss of consciousness or control, like in a stroke.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæpəˌplɛktɪkli/","syllables":"a-po-plec-ti-cal-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Apoplectically' describes a state of extreme anger or excitement, often to the point where someone appears to be on the verge of a stroke. It's a vivid and somewhat dramatic way to describe intense emotion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was apoplectically happy.","correct":"✓ He was ecstatically happy.","note":"'Apoplectically' is associated with negative emotions like anger, not positive ones like happiness."}],"priority":"★☆☆"},"related_words":{"derivatives":["apoplectic (adjective): relating to or suffering from apoplexy or stroke; extremely angry or excited.","apoplexy (noun): stroke; sudden loss of consciousness or control resulting from a burst or blockage of blood vessels in the brain."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'apoplectically' is a highly sophisticated term used to describe a state of extreme anger or excitement, often to the point of appearing to be on the verge of a stroke. Due to its complexity and specific connotation, it is rarely used in everyday conversation and is more commonly found in literature or formal writing. Understanding the historical context related to 'apoplexy' (stroke) is helpful in grasping the full meaning of the word."},"example_sentences":[{"sentence":"The manager reacted apoplectically when he discovered the error in the report.","translation":"マネージャーは報告書の間違いを見つけたとき、卒中を起こしたかのように激怒した。","type":"adverb","meaning_category":"激怒して"},{"sentence":"His face flushed apoplectically as he listened to the accusations.","translation":"彼の顔は非難を聞いているうちに卒中を起こしたかのように赤くなった。","type":"adverb","meaning_category":"卒中を起こしたように"}]}