{"word":"revivalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"復興主義、復古主義、リバイバル","english_definition":"A renewed religious fervor within a Christian group, church, or community, but primarily a movement in some Protestant churches to revitalize the members' faith. It is a component of the broader phenomenon of revival cycles conventional to the history of Christianity.","examples":[{"sentence":"The country experienced a wave of religious revivalism in the late 20th century.","translation":"その国は20世紀後半に宗教的復興主義の波を経験した。"},{"sentence":"Architectural revivalism led to the construction of buildings in the style of the past.","translation":"建築における復古主義は、過去の様式での建物の建設につながった。"},{"sentence":"The conference focused on the challenges and opportunities of cultural revivalism.","translation":"会議は、文化的復興主義の課題と機会に焦点を当てた。"}],"collocations":["religious revivalism (宗教的復興主義)","cultural revivalism (文化的復興主義)","architectural revivalism (建築的復古主義)","political revivalism (政治的復興主義)"],"synonyms":["renewal","restoration","renaissance","reawakening","reanimation"],"antonyms":["decline","stagnation","decay","obsolescence"]}],"etymology":{"value":"'Revival' + '-ism'. 'Revival' comes from the Old French 'revivre' meaning 'to live again', from Latin 're-' (again) + 'vivere' (to live). '-ism' is a suffix denoting a doctrine, principle, or practice.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈvaɪvəlɪzəm/","syllables":"ri-vi-val-ism"},"inflection":{"noun_plural":"revivalisms"},"usage_notes":{"explanation":"'Revivalism' typically refers to a renewed interest in something from the past, whether it be religious faith, cultural traditions, or artistic styles. In a religious context, it denotes a movement to reinvigorate religious belief and practice. In other contexts, it can refer to the revival of interest in past styles or traditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The revivalism was only in the church.","correct":"✓ The revivalism was centered in the church.","note":"'Revivalism' is a movement or ideology, not a location. Use 'centered in' or similar phrases to indicate where it's focused."},{"incorrect":"✗ He is a revivalist, he believes in revivalism.","correct":"✓ He is a revivalist; he advocates for revivalism.","note":"The first sentence is grammatically correct but slightly redundant. The second is more concise and emphasizes advocacy."}],"priority":"★★☆"},"related_words":{"derivatives":["revivalist (noun, adjective)","revive (verb)","revival (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Revivalism' is a term used to describe a renewed interest or emphasis on something from the past. It's often used in the context of religion, referring to periods of increased religious fervor and activity. However, it can also apply to other areas, such as art, architecture, or culture, where there's a deliberate attempt to bring back or imitate styles and practices from earlier times. The term implies a conscious effort to revitalize or restore something that was previously in decline or considered outdated."},"example_sentences":[{"sentence":"The Great Awakening was a period of intense religious revivalism in the American colonies.","translation":"大覚醒は、アメリカの植民地における激しい宗教的復興主義の時代だった。","type":"noun","meaning_category":"Religious"},{"sentence":"The Gothic Revival was an architectural revivalism movement popular in the 19th century.","translation":"ゴシック・リバイバルは、19世紀に人気を博した建築的復古主義運動だった。","type":"noun","meaning_category":"Architectural"},{"sentence":"Cultural revivalism seeks to reclaim and celebrate traditional practices and values.","translation":"文化的復興主義は、伝統的な慣習や価値観を取り戻し、称えることを目指す。","type":"noun","meaning_category":"Cultural"}]}