{"word":"trutine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(astrology) pertaining to or derived from the hour of birth, especially used to determine the correct ascendant.","english_definition":"(astrology) pertaining to or derived from the hour of birth, especially used to determine the correct ascendant.","examples":[{"sentence":"The trutine Hermes is used to rectify the birth chart.","translation":"トリュティネ・ヘルメスは、出生図を修正するために使用されます。"}],"collocations":["trutine hermes","trutine point"],"synonyms":["birth hour","natal"],"antonyms":[]}],"etymology":{"value":"From Medieval Latin *trutina*, meaning 'balance' or 'scales', reflecting the astrological practice of weighing different factors to determine the correct birth time.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtruːtaɪn/","syllables":"tru-tine"},"inflection":{"notes":"Since 'trutine' is primarily an adjective, it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Trutine' is a term primarily used within the field of astrology, specifically in techniques aimed at rectifying or correcting a birth chart when the exact time of birth is unknown or uncertain. The 'Trutine of Hermes' is a specific method used for this purpose. It is not a commonly used word outside of this context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a trutine experience.","correct":"✓ He had a profound experience.","note":"'Trutine' is specifically related to astrology; it should not be used to describe a general experience. Use 'profound' or 'deep' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["rectification (astrology)","natal chart","ascendant"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specific to astrology.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Trutine' is a highly specialized term within astrology. It refers to calculations and techniques used to determine the precise time of birth for astrological chart construction, particularly when the recorded time is uncertain. Understanding this term requires familiarity with astrological concepts and terminology. It is not commonly used or understood outside of astrological contexts."},"example_sentences":[{"sentence":"The astrologer used the trutine method to verify the accuracy of the birth time.","translation":"占星術師は、出生時刻の正確性を検証するためにトリュティネ法を使用しました。","type":"adjective","meaning_category":"astrology"},{"sentence":"Calculating the trutine point can help refine the ascendant in the natal chart.","translation":"トリュティネ・ポイントを計算することで、出生図のアセンダントをより正確に決定できます。","type":"adjective","meaning_category":"astrology"}]}