{"word":"protanomal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(色覚異常の一種である)第一色弱の、赤色弱の","english_definition":"Relating to or characterized by protanomaly, a type of red-green color blindness in which the red cones in the eye detect too much green and not enough red.","examples":[{"sentence":"He was diagnosed as protanomal.","translation":"彼は第一色弱と診断された。"},{"sentence":"Protanomal vision can make it difficult to distinguish between certain shades of red and green.","translation":"第一色弱の視覚では、特定の色合いの赤と緑を区別するのが難しいことがある。"}],"collocations":["protanomal vision","protanomal color blindness","mild protanomal","severe protanomal"],"synonyms":["red-weak","red color deficient"],"antonyms":["normal color vision"]},{"part_of_speech":"noun","definition":"第一色弱の人、赤色弱の人","english_definition":"A person who has protanomaly.","examples":[{"sentence":"Protanomals often have difficulty with color-coded tasks.","translation":"第一色弱の人は、色分けされた作業に苦労することがよくある。"}],"collocations":["a protanomal","protanomals"],"synonyms":["red-weak individual"],"antonyms":["normal trichromat"]}],"etymology":{"value":"From 'proto-' (meaning 'first') + 'anomalous' (meaning 'deviating from what is standard, normal, or expected'). Refers to a defect in the 'first' (red) color receptor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtəˈnɒməli/","syllables":"pro-ta-no-ma-ly"},"inflection":{"notes":"The adjective form is 'protanomal'. The noun form, referring to a person, is 'protanomal'. The condition itself is 'protanomaly'."},"usage_notes":{"explanation":"'Protanomal' describes a specific type of color vision deficiency where the red cones are abnormal, causing difficulty in perceiving red colors properly. It's important to distinguish it from protanopia, where the red cones are completely absent. Protanomaly is a type of anomalous trichromacy, meaning all three cone types are present but one is altered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a protanopia.","correct":"✓ He is protanomal. / ✓ He has protanopia.","note":"'Protanopia' is the condition itself (absence of red cones), while 'protanomal' describes a person with protanomaly (abnormal red cones)."},{"incorrect":"✗ Protanomal is a disease.","correct":"✓ Protanomaly is a condition.","note":"Protanomaly is a condition, not a disease."}],"priority":"★★☆"},"related_words":{"derivatives":["protanomaly (noun: the condition of having defective red cones)","protanope (noun: a person with protanopia, complete absence of red cones)","dichromat (noun: a person with only two types of color receptors)","anomalous trichromat (noun: a person with all three types of color receptors, but one is altered)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Protanomal' is a technical term used in the context of color vision deficiency. It refers to a specific type of red-green color blindness where the red cones in the eye are present but function abnormally. Understanding this term requires knowledge of color vision and different types of color blindness. It is primarily used in medical or scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Ishihara test can help identify individuals who are protanomal.","translation":"石原式色覚検査は、第一色弱の人を特定するのに役立ちます。","type":"adjective","meaning_category":"色覚異常"},{"sentence":"As a protanomal, he relies on other cues to distinguish between colors.","translation":"第一色弱である彼は、色を区別するために他の手がかりに頼っています。","type":"noun","meaning_category":"人"}]}