{"word":"phylon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)門 (動物分類学における主要な分類階級の一つ)","english_definition":"(biology) A taxonomic rank at the level below kingdom and above class; also known as a division, especially in botany.","examples":[{"sentence":"The phylum Chordata includes all animals with a spinal cord.","translation":"脊索動物門には、脊髄を持つすべての動物が含まれます。"},{"sentence":"What phylum does the jellyfish belong to?","translation":"クラゲは何門に属しますか？"}],"collocations":["major phyla","animal phyla","plant phyla"],"synonyms":["division (botany)"],"antonyms":[],"notes":["The term 'division' is often used instead of 'phylum' in botany."]}],"etymology":{"value":"From Ancient Greek φῦλον (phûlon, “tribe, race, people”), from φῠ́ω (phúō, “I produce, bring forth”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪlɒn/","syllables":"phy-lon"},"inflection":{"noun_plural":"phyla"},"usage_notes":{"explanation":"'Phylum' is a key term in biological taxonomy, representing a high-level grouping of organisms based on shared characteristics. It's important to note the distinction between 'phylum' (used in zoology) and 'division' (often used in botany) although they represent the same taxonomic rank.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The phylon is a class of animals.","correct":"✓ The phylum is above the class in taxonomic rank.","note":"A phylum is a higher taxonomic rank than a class."},{"incorrect":"✗ Phylums are important for classifying plants.","correct":"✓ Phyla (or divisions) are important for classifying plants.","note":"The plural of phylum is phyla. In botany, 'division' is often used instead of 'phylum'."}],"priority":"★★☆"},"related_words":{"derivatives":["phylogenetic","phylogeny"],"related_terms":["taxonomy","kingdom","class","order","family","genus","species"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phylum' is a technical term used in biology, specifically in the classification of living organisms. It refers to a major grouping of organisms that share a common ancestor and similar characteristics. Understanding this term is essential for studying biology and related fields. It's typically encountered in advanced science texts and discussions."},"example_sentences":[{"sentence":"The study examined the evolutionary relationships within the phylum Mollusca.","translation":"その研究は、軟体動物門内の進化的な関係を調査した。","type":"noun","meaning_category":"biological classification"},{"sentence":"Scientists are working to classify newly discovered species into their appropriate phylum.","translation":"科学者たちは、新しく発見された種を適切な門に分類するために取り組んでいる。","type":"noun","meaning_category":"biological classification"}]}