{"word":"Azalea","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ツツジ（躑躅）","english_definition":"A flowering shrub of the genus Rhododendron, typically with small, brightly colored flowers.","examples":[{"sentence":"The garden was filled with azaleas in full bloom.","translation":"庭は満開のツツジでいっぱいだった。"},{"sentence":"Azaleas are popular ornamental plants.","translation":"ツツジは人気の観賞植物です。"}],"collocations":["azalea bush","azalea garden","azalea festival","pink azalea","white azalea","red azalea"],"synonyms":["rhododendron"],"antonyms":[]}],"etymology":{"value":"The word \"azalea\" comes from the Greek word \"azaleos,\" meaning \"dry.\" This refers to the plant's preference for well-drained soil.","priority":"★★★"},"pronunciation":{"ipa":"/əˈzeɪliə/","syllables":"a-ze-le-a"},"inflection":{"noun_plural":"azaleas"},"usage_notes":{"explanation":"Azaleas are popular flowering shrubs known for their vibrant colors and showy blooms. They are often used in landscaping and gardening. Azaleas belong to the genus Rhododendron, but are distinguished by having only five stamens per flower, while most rhododendrons have ten.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted a azelea in my garden.","correct":"✓ I planted an azalea in my garden.","note":"\"Azalea\" starts with a vowel sound, so the indefinite article \"an\" should be used instead of \"a.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"azalea\" refers to a type of flowering shrub. It's not a commonly used word in everyday conversation, but it's often encountered in gardening or botany contexts. The word itself is not difficult to understand, but familiarity with gardening terms may be helpful.","priority":"★★☆"},"example_sentences":[{"sentence":"The annual azalea festival attracts many visitors.","translation":"毎年恒例のツツジ祭りは多くの観光客を魅了する。","type":"general","meaning_category":"イベント"},{"sentence":"She planted a row of azaleas along the fence.","translation":"彼女はフェンス沿いにツツジを植えた。","type":"general","meaning_category":"ガーデニング"},{"sentence":"The pink azaleas contrasted beautifully with the green foliage.","translation":"ピンクのツツジは緑の葉と美しく対照的だった。","type":"general","meaning_category":"説明"}]}