{"word":"organonomic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"有機体の機能や構造に関する、またはそれらに基づく","english_definition":"relating to or based on the functions and structure of living organisms","examples":[{"sentence":"Organonomic principles guide the design of the system.","translation":"有機体の機能構造の原則が、そのシステムの設計を導く。"},{"sentence":"The organonomic approach emphasizes the interconnectedness of body systems.","translation":"有機体の機能構造的アプローチは、身体システムの相互接続性を強調する。"}],"collocations":["organonomic principles","organonomic approach","organonomic design"],"synonyms":["biological","physiological","anatomical"],"antonyms":["inorganic","artificial"]}],"etymology":{"value":"'Organonomic' derives from 'organonomy,' which combines 'organo-' (referring to organs or organic structures) with '-nomy' (referring to a system of laws or principles).","priority":"★★★"},"pronunciation":{"ipa":"/ɔrˌɡænəˈnɒmɪk/","syllables":"or-ga-no-nom-ic"},"inflection":{},"usage_notes":{"explanation":"'Organonomic' is often used in scientific or technical contexts to describe approaches or designs that consider the natural functions and structures of living organisms.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["organonomy (noun): the study of the functions and structure of living organisms"],"related_terms":["organic","anatomy","physiology"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Organonomic' is a specialized term primarily used in scientific or technical fields. It relates to the study and application of the functional and structural principles of living organisms. Understanding this term requires familiarity with biological concepts."},"example_sentences":[{"sentence":"The building's design incorporates organonomic principles to maximize natural light and ventilation.","translation":"その建物の設計は、自然光と換気を最大化するために、有機体の機能構造の原則を取り入れている。","type":"general","meaning_category":"relating to functions and structure of organisms"},{"sentence":"The organonomic approach to medicine focuses on treating the whole person rather than just individual symptoms.","translation":"医学における有機体の機能構造的アプローチは、個々の症状だけでなく、人全体を治療することに焦点を当てる。","type":"medical","meaning_category":"relating to functions and structure of organisms"}]}