{"word":"Spartanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スパルタ主義、禁欲主義、質素倹約","english_definition":"the characteristics associated with Sparta, especially simplicity, frugality, austerity, and rigorous self-discipline.","examples":[{"sentence":"His Spartanism was evident in his simple lifestyle and lack of material possessions.","translation":"彼のスパルタ主義は、彼の質素な生活様式と物質的な所有物の欠如に明らかだった。"},{"sentence":"The monks embraced Spartanism, living in bare cells and dedicating themselves to prayer.","translation":"修道士たちはスパルタ主義を受け入れ、簡素な部屋に住み、祈りに専念した。"},{"sentence":"The school promoted Spartanism, emphasizing hard work, discipline, and physical fitness.","translation":"その学校はスパルタ主義を推進し、勤勉、規律、体力に重点を置いた。"}],"collocations":["embrace Spartanism (スパルタ主義を受け入れる)","promote Spartanism (スパルタ主義を推進する)","live with Spartanism (スパルタ主義で生活する)","a life of Spartanism (スパルタ主義の生活)"],"synonyms":["asceticism","austerity","frugality","simplicity","self-discipline","rigor","stoicism"],"antonyms":["hedonism","luxury","indulgence","extravagance","sensuality"]}],"etymology":{"value":"Derived from 'Spartan', referring to the ancient Greek city-state of Sparta, known for its military prowess and austere lifestyle. The suffix '-ism' denotes a doctrine, principle, or distinctive practice.","priority":"★★★"},"pronunciation":{"ipa":"/ˈspɑːrtənɪzəm/","syllables":"Spar-tan-ism"},"inflection":{"noun_plural":"Spartanisms (rarely used, usually refers to specific instances or expressions of Spartanism)"},"usage_notes":{"explanation":"'Spartanism' refers to a way of life characterized by simplicity, frugality, and rigorous self-discipline, often associated with the historical practices of Sparta. It can describe personal lifestyles, organizational cultures, or philosophical approaches that emphasize these qualities. The term often carries a connotation of self-denial and a focus on practical or martial virtues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a Spartanism life.","correct":"✓ He lived a Spartan life. / ✓ He practiced Spartanism.","note":"'Spartanism' is a concept or philosophy, not an adjective. Use 'Spartan' as an adjective or 'practice Spartanism' to describe living according to its principles."},{"incorrect":"✗ Spartanism is only about being poor.","correct":"✓ Spartanism is about simplicity, discipline, and frugality, not necessarily poverty.","note":"While Spartanism involves simplicity and frugality, it is not solely about being poor. It also encompasses self-discipline, physical fitness, and a focus on essential values."}],"priority":"★★☆"},"related_words":{"derivatives":["Spartan (adjective, noun)","Spartanly (adverb)"],"related_concepts":["Stoicism","Asceticism","Minimalism"],"historical_context":["Ancient Sparta","Military culture","Lycurgus (legendary lawgiver of Sparta)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spartanism' is a relatively uncommon term that describes a lifestyle or philosophy characterized by simplicity, frugality, and rigorous self-discipline. It is derived from the historical practices of the ancient Greek city-state of Sparta, which was known for its military prowess and austere way of life. Understanding this term requires familiarity with ancient history and philosophical concepts related to self-denial and discipline. It is often used in discussions of lifestyle choices, organizational culture, or philosophical approaches that emphasize these qualities."},"example_sentences":[{"sentence":"The coach instilled a sense of Spartanism in the team, demanding rigorous training and self-sacrifice.","translation":"コーチはチームにスパルタ主義の精神を植え付け、厳しいトレーニングと自己犠牲を要求した。","type":"noun","meaning_category":"simplicity and self-discipline"},{"sentence":"Her apartment reflected her commitment to Spartanism, with minimal furniture and a focus on functionality.","translation":"彼女のアパートは、彼女のスパルタ主義へのコミットメントを反映しており、最小限の家具と機能性に重点が置かれていた。","type":"noun","meaning_category":"frugality and austerity"},{"sentence":"The early settlers adopted a lifestyle of Spartanism out of necessity, facing harsh conditions and limited resources.","translation":"初期の入植者たちは、厳しい状況と限られた資源に直面し、必要に迫られてスパルタ主義の生活様式を採用した。","type":"noun","meaning_category":"simplicity and frugality"},{"sentence":"Some critics argue that Spartanism can lead to a lack of creativity and innovation.","translation":"一部の批評家は、スパルタ主義は創造性と革新の欠如につながる可能性があると主張している。","type":"noun","meaning_category":"self-discipline and rigor"}]}