{"word":"undestitute","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"貧困でない、困窮していない","english_definition":"Not destitute; not lacking the basic necessities of life.","examples":[{"sentence":"The family, though not wealthy, was undestitute and able to provide for their children.","translation":"その家族は、裕福ではなかったものの、貧困ではなく、子供たちを養うことができた。"},{"sentence":"Despite the economic downturn, many remained undestitute thanks to social safety nets.","translation":"景気後退にもかかわらず、多くの人々は社会保障のおかげで貧困に陥らずに済んだ。"}],"collocations":["remain undestitute","become undestitute","relatively undestitute"],"synonyms":["affluent","wealthy","prosperous","comfortable","well-off"],"antonyms":["destitute","impoverished","poor","needy","penniless"]},{"part_of_speech":"adjective","definition":"(比喩的に)欠如していない、不足していない","english_definition":"(Figuratively) Not lacking; not devoid of something.","examples":[{"sentence":"The argument, while flawed, was undestitute of merit.","translation":"その議論は、欠陥はあったものの、全く価値がないわけではなかった。"},{"sentence":"Her performance, though not brilliant, was undestitute of talent.","translation":"彼女の演技は、素晴らしいとは言えなかったが、才能が全くないわけではなかった。"}],"collocations":["undestitute of merit","undestitute of talent","undestitute of value"],"synonyms":["possessing","endowed with","having","rich in","abundant in"],"antonyms":["destitute of","lacking","devoid of","bereft of"]}],"etymology":{"value":"\"Un-\" (否定の接頭辞) + \"destitute\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdɛstɪtjuːt/","syllables":"un-des-ti-tute"},"inflection":{"adjective_forms":{"comparative":"more undestitute","superlative":"most undestitute"}},"usage_notes":{"explanation":"\"Undestitute\" is the opposite of \"destitute,\" meaning not impoverished or lacking basic necessities. It can also be used figuratively to mean not lacking something, such as merit or talent. It is a relatively uncommon word, with \"not destitute\" or \"not lacking\" being more frequently used alternatives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was undestitute of money, so he bought a car.","correct":"✓ He was not destitute of money, so he bought a car. / ✓ He had plenty of money, so he bought a car.","note":"While 'undestitute of' is grammatically correct, it's an uncommon and somewhat awkward phrasing. It's better to use a more direct positive statement like 'He had plenty of money' or 'He was not destitute of money' for clarity."},{"incorrect":"✗ The undestitute people were happy.","correct":"✓ The non-destitute people were happy. / ✓ The wealthy people were happy.","note":"Using 'undestitute' to describe people who are not poor is grammatically correct, but it sounds unusual. It's better to use more common terms like 'non-destitute,' 'wealthy,' or 'well-off' for better clarity and naturalness."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["destitute","destitution"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undestitute\" is a relatively rare and formal term. It is the direct opposite of \"destitute,\" meaning not impoverished or lacking basic necessities. It can also be used in a figurative sense to mean not lacking something, such as talent or merit. Due to its infrequent usage, it's more common to encounter phrases like \"not destitute\" or \"not lacking\" instead. Understanding the meaning of \"destitute\" is essential to comprehending \"undestitute.\" It is more likely to be found in formal writing or academic contexts than in everyday conversation."},"example_sentences":[{"sentence":"Although they faced challenges, they remained undestitute thanks to their resourcefulness.","translation":"彼らは困難に直面したものの、その機転のおかげで貧困に陥らずに済んだ。","type":"adjective","meaning_category":"貧困でない"},{"sentence":"The proposal, while controversial, was undestitute of innovative ideas.","translation":"その提案は、物議を醸したものの、革新的なアイデアが全くないわけではなかった。","type":"adjective","meaning_category":"欠如していない"},{"sentence":"The family was considered undestitute because they owned their own home and had a stable income.","translation":"その家族は、自分の家を所有し、安定した収入があったため、貧困ではないと見なされた。","type":"adjective","meaning_category":"貧困でない"}]}