{"word":"Procathedrals","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) プロカテドラル、仮司教座聖堂","english_definition":"(plural) Churches that serve as temporary cathedrals, or co-cathedrals, in a diocese.","examples":[{"sentence":"Several procathedrals were established while new cathedrals were being built.","translation":"新しい大聖堂が建設されている間、いくつかの仮司教座聖堂が設立されました。"},{"sentence":"The diocese used the procathedrals for important ceremonies.","translation":"教区は重要な儀式のために仮司教座聖堂を使用しました。"}],"collocations":["establish procathedrals","use procathedrals","historic procathedrals"],"synonyms":["temporary cathedral","co-cathedral"],"antonyms":["cathedral"]}],"etymology":{"value":"'Pro-' (in place of) + 'cathedral' (the principal church of a diocese, containing the bishop's official seat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊkəˈθiːdrəlz/","syllables":"pro-ca-the-drals"},"inflection":{"noun_plural":"Procathedrals"},"usage_notes":{"explanation":"'Procathedrals' refers to churches serving as temporary cathedrals or co-cathedrals. This usually happens when the main cathedral is under construction, renovation, or has been destroyed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The procathedral was used as a cathedral.","correct":"✓ The procathedral was used as a temporary cathedral.","note":"A procathedral is not a full cathedral, but a temporary or co-cathedral."}],"priority":"★★☆"},"related_words":{"derivatives":["procathedral"],"related_terms":["cathedral","diocese","bishop"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'procathedrals' is specialized and related to ecclesiastical architecture and governance. It is used in contexts discussing the structure and administration of dioceses within certain Christian denominations. Understanding requires knowledge of church hierarchy and building functions."},"example_sentences":[{"sentence":"The city's procathedrals served as important religious centers during the reconstruction period.","translation":"その都市の仮司教座聖堂は、再建期間中に重要な宗教的中心地として機能しました。","type":"general"},{"sentence":"The bishop often held services at the procathedrals due to their accessibility.","translation":"司教は、そのアクセスの良さから、仮司教座聖堂で礼拝を行うことがよくありました。","type":"general"}]}