{"word":"Negrillos","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ネグリロ","english_definition":"A term used to refer to various pygmy peoples of Southeast Asia, particularly those of the Philippines. It is often considered outdated and potentially offensive.","examples":[{"sentence":"The Negrillos of the Philippines have a rich cultural heritage.","translation":"フィリピンのネグリロは豊かな文化遺産を持っています。"}],"synonyms":["Pygmy peoples","Indigenous peoples of Southeast Asia"],"antonyms":[],"notes":"The term 'Negrillos' is often considered outdated and potentially offensive due to its colonial origins and association with negative stereotypes. It is generally preferred to use the specific names of the groups being referred to, such as the Aeta, Agta, or Batak."}],"etymology":{"value":"Derived from the Spanish word 'negro,' meaning 'black,' referring to the dark skin of these populations.","priority":"N/A"},"pronunciation":{"ipa":"/nəˈɡrɪl.oʊz/","syllables":"Ne-gril-los"},"inflection":{"noun_plural":"Negrillos"},"usage_notes":{"explanation":"The term 'Negrillos' is a general term that has been used historically to refer to various pygmy populations in Southeast Asia. However, it is now often considered outdated and potentially offensive. It is more respectful and accurate to use the specific names of the individual groups, such as the Aeta, Agta, or Batak.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["Negrito (singular form)"],"related_terms":["Aeta","Agta","Batak"]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"The term 'Negrillos' is a historical term for certain pygmy groups in Southeast Asia. It's important to be aware that this term is often considered outdated and potentially offensive, and it's generally better to use the specific names of the groups being referred to."},"example_sentences":[{"sentence":"The term 'Negrillos' is sometimes used to refer to the indigenous populations of the Philippines.","translation":"「ネグリロ」という用語は、フィリピンの先住民族を指すために使用されることがあります。","type":"noun","meaning_category":"Referring to pygmy peoples of Southeast Asia"}]}