{"word":"fretwise","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"Arranged with respect to the frets of a stringed instrument.","english_definition":"In a manner that relates to or is arranged according to the frets on a stringed instrument.","examples":[{"sentence":"The guitar neck was carefully constructed, fretwise, to ensure accurate intonation.","translation":"ギターのネックは、正確なイントネーションを保証するために、フレットに関して注意深く構築されました。"},{"sentence":"The spacing of the markers was aligned fretwise.","translation":"マーカーの間隔は、フレットに合わせて配置されました。"}],"collocations":["fretwise alignment","fretwise spacing","fretwise construction"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed from 'fret' (referring to the frets on a stringed instrument) and '-wise' (indicating manner or direction).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfrɛtwaɪz/","syllables":"fret-wise"},"inflection":{},"usage_notes":{"explanation":"'Fretwise' is a specialized term primarily used in the context of stringed instruments, such as guitars, basses, and mandolins. It describes the arrangement, alignment, or construction of elements in relation to the frets on the instrument's neck.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["fret (noun)","fret (verb)"],"related_terms":["fretboard","fretless"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fretwise' is a technical term primarily used by luthiers, musicians, and instrument technicians. It describes the orientation or arrangement of components relative to the frets on a stringed instrument. Due to its specialized nature, it is not commonly encountered in general English. Understanding requires familiarity with stringed instrument construction."},"example_sentences":[{"sentence":"The nut was adjusted fretwise to ensure proper string height.","translation":"ナットは、適切な弦の高さになるように、フレットに合わせて調整されました。","type":"adverb","meaning_category":"Arrangement related to frets"},{"sentence":"He checked the intonation fretwise along the neck.","translation":"彼はネックに沿って、フレットごとにイントネーションを確認しました。","type":"adverb","meaning_category":"Arrangement related to frets"}]}