{"word":"capitalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"資本主義","english_definition":"an economic and political system in which a country's trade and industry are controlled by private owners for profit, rather than by the state.","examples":[{"sentence":"Capitalism encourages competition and innovation.","translation":"資本主義は競争と革新を促進する。"},{"sentence":"Critics of capitalism argue that it leads to inequality.","translation":"資本主義の批判者たちは、それが不平等につながると主張する。"},{"sentence":"The rise of capitalism transformed the global economy.","translation":"資本主義の台頭は、世界経済を変革した。"}],"collocations":["free-market capitalism (自由市場資本主義)","state capitalism (国家資本主義)","global capitalism (グローバル資本主義)","financial capitalism (金融資本主義)","late-stage capitalism (末期資本主義)"],"synonyms":["free market economy","market economy","laissez-faire economy"],"antonyms":["socialism","communism","planned economy"]}],"etymology":{"value":"'Capitalism' derives from 'capital,' referring to assets used for production. The term gained prominence in the mid-19th century as a way to describe the economic system emerging in Europe. It combines 'capital' with the suffix '-ism,' denoting a system or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæpɪtəlɪzəm/","syllables":"ca-pi-tal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Capitalism' is a system where private individuals or corporations own and control the means of production (capital) and derive profit. Key features include private property, free markets, and competition. It's often contrasted with socialism, where the state controls the means of production.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very capitalism.","correct":"✓ He supports capitalism. / ✓ He is a capitalist.","note":"'Capitalism' is a noun. To describe someone who supports it, use 'capitalist' (noun) or say they 'support capitalism' (verb phrase)."},{"incorrect":"✗ Capitalism is when the government controls everything.","correct":"✓ Capitalism is when private individuals control businesses.","note":"This is the opposite of capitalism. Government control is more characteristic of socialism or communism."}],"priority":"★★☆"},"related_words":{"derivatives":["capitalist (noun, adjective)","capitalistic (adjective)"],"related_concepts":["market economy","supply and demand","profit motive","private property","entrepreneurship"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderately high frequency. Common in economics, politics, and social science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Capitalism' refers to an economic system where private individuals and companies own the means of production and operate them for profit. It emphasizes free markets, competition, and limited government intervention. Understanding capitalism is crucial for discussing economics, politics, and social issues. It's often contrasted with other economic systems like socialism and communism.","priority":"★★☆"},"example_sentences":[{"sentence":"The country's transition to capitalism led to rapid economic growth.","translation":"その国の資本主義への移行は、急速な経済成長をもたらした。","type":"general","meaning_category":"definition"},{"sentence":"Critics argue that unregulated capitalism can exacerbate social inequality.","translation":"批判者たちは、規制のない資本主義が社会的不平等を悪化させる可能性があると主張する。","type":"criticism","meaning_category":"criticism"},{"sentence":"Technological innovation is a driving force within capitalism.","translation":"技術革新は資本主義における推進力である。","type":"aspect","meaning_category":"aspect"},{"sentence":"State capitalism involves government intervention in the economy to promote national interests.","translation":"国家資本主義は、国益を促進するために政府が経済に介入することを含む。","type":"type","meaning_category":"types"},{"sentence":"The principles of capitalism are based on private property and free markets.","translation":"資本主義の原則は、私有財産と自由市場に基づいている。","type":"principles","meaning_category":"principles"}]}