{"word":"Waddington","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス)ウェディントン（イングランドの地名。リンカンシャーにある村、またはチェシャーにある村）","english_definition":"(mainly British) A place name in England, referring to either a village in Lincolnshire or a village in Cheshire.","examples":[{"sentence":"Waddington is a small village in Lincolnshire.","translation":"ウェディントンはリンカンシャーにある小さな村です。"},{"sentence":"The RAF base is located near Waddington.","translation":"空軍基地はウェディントンの近くに位置しています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"ウェディントン（姓）","english_definition":"A surname.","examples":[{"sentence":"Mr. Waddington is the new manager.","translation":"ウェディントンさんが新しいマネージャーです。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"コンラッド・ハル・ワディントン（発生学者、理論生物学者、古生物学者、遺伝学者）","english_definition":"Conrad Hal Waddington (an embryologist, theoretical biologist, palaeontologist, and geneticist).","examples":[{"sentence":"Waddington is known for his work on epigenetics.","translation":"ワディントンはエピジェネティクスの研究で知られています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The place name is likely derived from an Old English personal name combined with 'tun' (settlement). The surname has similar origins.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒdɪŋtən/","syllables":"Wad-ding-ton"},"inflection":{},"usage_notes":{"explanation":"'Waddington' most commonly refers to a place name in England. It can also be a surname. In a scientific context, it might refer to Conrad Hal Waddington.","priority":"★★☆"},"common_mistakes":{},"related_words":[],"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency except in specific contexts (e.g., local history, genealogy, biology).","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Waddington' is primarily a proper noun, referring to specific places or people. Understanding its usage requires knowledge of British geography or figures in the field of biology. It's not a common word in general English conversation."},"example_sentences":[{"sentence":"The village of Waddington in Lincolnshire is known for its aviation history.","translation":"リンカンシャーのウェディントン村は航空の歴史で知られています。","type":"noun","meaning_category":"地名"},{"sentence":"We are researching the Waddington family history.","translation":"私たちはウェディントン家の歴史を研究しています。","type":"proper noun","meaning_category":"姓"},{"sentence":"Waddington's epigenetic landscape is a key concept in developmental biology.","translation":"ワディントンのエピジェネティックランドスケープは、発生生物学における重要な概念です。","type":"proper noun","meaning_category":"人名"}]}