{"word":"ectrodactylism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"外胚葉異形成症","english_definition":"A rare congenital anomaly characterized by the absence of one or more central digits of the hand or foot, resulting in a cleft-like appearance. It is also known as split hand/split foot malformation (SHFM).","examples":[{"sentence":"Ectrodactylism can be inherited or occur spontaneously.","translation":"外胚葉異形成症は遺伝または自然発生する可能性があります。"},{"sentence":"The patient was diagnosed with ectrodactylism after a thorough examination.","translation":"患者は徹底的な検査の後、外胚葉異形成症と診断されました。"}],"collocations":["split hand","split foot","SHFM (split hand/split foot malformation)"],"synonyms":["split hand/split foot malformation","cleft hand/foot"],"antonyms":[]},{"part_of_speech":"noun","definition":"裂手症、裂足症","english_definition":"A condition characterized by the absence or malformation of one or more central digits of the hand or foot, resulting in a split or cleft appearance.","examples":[{"sentence":"Ectrodactylism can affect both the hands and feet.","translation":"外胚葉異形成症は手と足の両方に影響を与える可能性があります。"},{"sentence":"Surgical intervention may be necessary to improve hand function in individuals with ectrodactylism.","translation":"外胚葉異形成症の個人の手の機能を改善するためには、外科的介入が必要となる場合があります。"}],"collocations":["split hand","split foot","lobster claw deformity"],"synonyms":["split hand/foot malformation","cleft hand/foot"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'ektros' (abortive, lacking) + 'daktylos' (finger, toe) + '-ism' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛk.troʊˈdæk.tɪl.ɪ.zəm/","syllables":"ec-tro-dac-tyl-ism"},"inflection":{"noun_plural":"ectrodactylisms"},"usage_notes":{"explanation":"Ectrodactylism is a rare genetic condition that affects the development of the hands and feet. It is characterized by the absence or malformation of one or more central digits, resulting in a cleft-like appearance. The severity of ectrodactylism can vary, with some individuals experiencing only mild symptoms while others have more significant functional limitations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ectrodactyly is a contagious disease.","correct":"✓ Ectrodactyly is a genetic condition.","note":"Ectrodactyly is a genetic condition, not a contagious disease."},{"incorrect":"✗ Ectrodactyly only affects the hands.","correct":"✓ Ectrodactyly can affect both the hands and feet.","note":"Ectrodactyly can affect either the hands or the feet, or both."}],"priority":"★★☆"},"related_words":{"derivatives":["ectrodactylous (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Ectrodactylism is a complex medical term referring to a rare congenital condition. Understanding this term requires a strong background in medical terminology and genetics. The condition involves the absence or malformation of central digits in the hands or feet, leading to a split or cleft appearance. Due to its rarity and specialized nature, this term is typically encountered in medical or scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The child was born with ectrodactylism, affecting both hands and feet.","translation":"その子供は外胚葉異形成症を持って生まれ、手と足の両方に影響が出ていた。","type":"noun","meaning_category":"medical condition"},{"sentence":"Genetic testing confirmed the diagnosis of ectrodactylism.","translation":"遺伝子検査により、外胚葉異形成症の診断が確定した。","type":"noun","meaning_category":"medical condition"}]}