{"word":"evocator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代の)霊魂喚起者、死霊術師","english_definition":"(historical) One who evokes or summons spirits, especially the spirits of the dead; a necromancer.","examples":[{"sentence":"The evocator claimed to be able to communicate with the deceased.","translation":"その霊魂喚起者は死者と交信できると主張した。"},{"sentence":"Ancient texts describe the rituals performed by evocators to summon spirits.","translation":"古代の文献には、霊魂を呼び出すために霊魂喚起者が行った儀式が記述されている。"}],"collocations":["evocator of spirits","skilled evocator","ancient evocator"],"synonyms":["necromancer","conjurer","summoner","spiritist","medium"],"antonyms":[]}],"etymology":{"value":"Late Latin *evocator*, from Latin *evocare* (to call forth, summon).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛvəˌkeɪtər/","syllables":"e-vo-ca-tor"},"inflection":{"noun_plural":"evocators"},"usage_notes":{"explanation":"The term 'evocator' is primarily historical, referring to individuals who practiced necromancy or spirit summoning in ancient times. It is less commonly used in modern contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an evocator of modern technology.","correct":"✓ He is an advocate of modern technology.","note":"'Evocator' refers to spirit summoning, not general advocacy. Use 'advocate' for someone who supports a cause or technology."}],"priority":"★☆☆"},"related_words":{"derivatives":["evocation (noun: the act of summoning or calling forth)","evocative (adjective: tending to evoke or call forth memories, feelings, etc.)","evoke (verb: to call forth, summon)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Evocator' is a rare and specialized term primarily used in historical or fantasy contexts to describe someone who summons spirits. Due to its limited usage, it is not commonly encountered in everyday language. Understanding its meaning requires familiarity with historical practices and terminology related to necromancy and spiritism."},"example_sentences":[{"sentence":"The old grimoire detailed the methods used by the evocator to control the summoned demons.","translation":"その古いグリモワール（魔導書）には、召喚された悪魔を支配するために霊魂喚起者が使用した方法が詳細に記述されていた。","type":"noun","meaning_category":"霊魂喚起者"},{"sentence":"In some cultures, the role of the evocator was both feared and respected.","translation":"一部の文化では、霊魂喚起者の役割は恐れられると同時に尊敬されていた。","type":"noun","meaning_category":"霊魂喚起者"}]}