{"word":"non-sensual","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"官能的でない、肉欲的でない、感覚的でない","english_definition":"Not relating to or stimulating the physical senses, especially those associated with sexual pleasure; not carnal or erotic.","examples":[{"sentence":"The painting depicted a non-sensual scene of a peaceful landscape.","translation":"その絵は、穏やかな風景の官能的でない場面を描いていた。"},{"sentence":"Their relationship was based on intellectual connection rather than sensual attraction.","translation":"彼らの関係は、官能的な魅力よりも知的なつながりに基づいていた。"},{"sentence":"The music had a spiritual, non-sensual quality.","translation":"その音楽は精神的で、感覚的でない性質を持っていた。"}],"collocations":["non-sensual art","non-sensual love","non-sensual experience","non-sensual appreciation"],"synonyms":["platonic","spiritual","intellectual","ascetic","non-erotic","non-carnal"],"antonyms":["sensual","erotic","carnal","sexual","hedonistic"]}],"etymology":{"value":"\"non-\" (否定) + \"sensual\" (感覚的な、官能的な)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈsɛnʃuəl/","syllables":"non-sen-su-al"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Non-sensual\" describes something that is not related to or does not stimulate the physical senses, particularly those associated with sexual pleasure. It often implies a focus on the intellectual, spiritual, or emotional aspects of an experience or relationship, rather than the physical ones. It is the direct opposite of \"sensual.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-sensual person didn't enjoy the massage.","correct":"✓ The apathetic person didn't enjoy the massage. / ✓ The person with sensory processing issues didn't enjoy the massage.","note":"\"Non-sensual\" describes the nature of something, not a person. If a person doesn't enjoy sensory experiences, terms like \"apathetic\" or descriptions of sensory processing issues are more appropriate."},{"incorrect":"✗ The non-sensual movie was boring.","correct":"✓ The unsensual movie was boring. / ✓ The movie without sensual elements was boring.","note":"While 'non-sensual' is technically correct, it is less common than describing the movie as 'unsensual' or stating that it lacked sensual elements. It's more natural to describe what it *doesn't* have."}],"priority":"★★☆"},"related_words":{"derivatives":["sensual (官能的な)","sensuality (官能性)","non-sense (無意味)"],"antonyms":["sensual","erotic","carnal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-sensual\" is a formal word meaning 'not relating to physical senses or sexual pleasure.' It's used to describe things that are intellectual, spiritual, or emotional, rather than physical. You might see it in discussions about art, relationships, or experiences that are not focused on the body. It's not a common word in everyday conversation, but it's useful for precise descriptions in specific contexts."},"example_sentences":[{"sentence":"The philosopher argued for a non-sensual understanding of beauty.","translation":"その哲学者は、美の官能的でない理解を主張した。","type":"adjective","meaning_category":"官能的でない"},{"sentence":"The poem explored themes of spiritual love and non-sensual connection.","translation":"その詩は、精神的な愛と官能的でないつながりのテーマを探求した。","type":"adjective","meaning_category":"官能的でない"},{"sentence":"The architect designed a non-sensual space for meditation and reflection.","translation":"その建築家は、瞑想と内省のための官能的でない空間を設計した。","type":"adjective","meaning_category":"官能的でない"},{"sentence":"She preferred the non-sensual aspects of nature, such as the vastness of the sky.","translation":"彼女は、空の広大さのような、自然の官能的でない側面を好んだ。","type":"adjective","meaning_category":"官能的でない"}]}