{"word":"Pyrogens","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"発熱物質、パイロジェン","english_definition":"Substances that produce fever when introduced or released into the body.","examples":[{"sentence":"Pyrogens can be either exogenous (originating outside the body) or endogenous (produced within the body).","translation":"発熱物質は、外因性（体外に由来）または内因性（体内で産生）のいずれかであり得る。"},{"sentence":"Bacterial endotoxins are a common type of exogenous pyrogen.","translation":"細菌性エンドトキシンは、一般的なタイプの外因性発熱物質である。"},{"sentence":"Endogenous pyrogens, such as cytokines, are released by immune cells during inflammation.","translation":"サイトカインなどの内因性発熱物質は、炎症中に免疫細胞によって放出される。"},{"sentence":"The presence of pyrogens in injectable medications can cause a fever in patients.","translation":"注射用医薬品中の発熱物質の存在は、患者に発熱を引き起こす可能性がある。"}],"collocations":["exogenous pyrogens","endogenous pyrogens","bacterial pyrogens","pyrogen testing","pyrogen-free"],"synonyms":["fever-inducing substances","thermogens"],"antonyms":["antipyretics","cryogens"]}],"etymology":{"value":"From the Greek words 'pyro' (fire, heat) and 'genes' (producing).","priority":"★★☆"},"pronunciation":{"ipa":"ˈpaɪrəˌdʒɛnz","syllables":"Py-ro-gens"},"inflection":{"noun_plural":"Pyrogens"},"usage_notes":{"explanation":"'Pyrogens' are substances that cause fever. They can be external, like bacterial toxins, or internal, like cytokines produced by the body's immune system. The term is commonly used in medical and pharmaceutical contexts to describe contaminants that must be avoided in injectable drugs and medical devices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyrogen caused the infection.","correct":"✓ The pyrogen caused the fever.","note":"Pyrogens cause fever, not infection directly. Infection can lead to the release of pyrogens."}],"priority":"★★☆"},"related_words":{"derivatives":["pyrogenic (adjective: producing fever)","apyrogenic (adjective: not producing fever)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyrogens' are substances that cause fever. This term is mostly used in science and medicine, especially when talking about how drugs and medical tools are made. These substances can be from outside the body, like germs, or made inside the body when there's an infection or inflammation. It's important to keep medical products free from pyrogens to avoid causing fever in patients."},"example_sentences":[{"sentence":"The laboratory conducts regular pyrogen testing to ensure the safety of pharmaceutical products.","translation":"その研究所は、医薬品の安全性を確保するために、定期的な発熱物質試験を実施している。","type":"general","meaning_category":"medical"},{"sentence":"The presence of pyrogens in the intravenous solution led to a febrile reaction in the patient.","translation":"静脈内溶液中の発熱物質の存在は、患者の発熱反応につながった。","type":"medical","meaning_category":"medical"}]}