{"word":"Chough","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ベニバシガラス (カラス科の鳥)","english_definition":"A bird of the crow family, with red legs and beak, found in mountainous regions of Europe, Asia, and Africa.","examples":[{"sentence":"The chough is a rare sight in many parts of Europe.","translation":"ベニバシガラスはヨーロッパの多くの地域では珍しい鳥です。"},{"sentence":"Choughs are known for their acrobatic flight.","translation":"ベニバシガラスはアクロバティックな飛行で知られています。"}],"collocations":["Alpine chough","Red-billed chough","Chough nest","Chough habitat"],"synonyms":["crow","raven","jackdaw","rook"],"antonyms":[]}],"etymology":{"value":"The word \"chough\" is imitative of the bird's call. It is related to the Cornish word for the bird, \"palores\", and the Welsh word \"brân goesgoch\" (red-legged crow).","priority":"★★☆"},"pronunciation":{"ipa":"/tʃʌf/","syllables":"chough"},"inflection":{"noun_plural":"choughs"},"usage_notes":{"explanation":"The chough is a relatively rare bird, and the word is not commonly used outside of ornithological contexts or discussions of specific regions where the bird is found. It's most often encountered in literature about birds or in geographical areas where choughs are native.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a chough yesterday, it was very big.","correct":"✓ I saw a chough yesterday, it was smaller than a raven.","note":"Choughs are often confused with other members of the crow family. They are smaller than ravens. "},{"incorrect":"✗ Choughs are only found in America.","correct":"✓ Choughs are found in Europe, Asia, and Africa.","note":"Choughs are not native to America."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Alpine chough (Pyrrhocorax graculus)","Red-billed chough (Pyrrhocorax pyrrhocorax)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very specialized vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chough' is a specialized term referring to a specific bird species. Understanding and using this word correctly requires advanced knowledge of ornithology or familiarity with regions where these birds are found. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Cornish coast is one of the few places in England where you can still see the chough.","translation":"コーンウォール沿岸は、イギリスで今でもベニバシガラスを見ることができる数少ない場所の一つです。","type":"noun","meaning_category":"bird species"},{"sentence":"Conservation efforts are underway to protect the chough population in the Alps.","translation":"アルプス地方でのベニバシガラスの個体数を保護するための保護活動が進行中です。","type":"noun","meaning_category":"bird species"}]}