{"word":"pre-weighed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"あらかじめ計量された","english_definition":"weighed in advance; having a weight determined before purchase or use.","examples":[{"sentence":"The recipe calls for pre-weighed ingredients to save time.","translation":"そのレシピでは、時間を節約するために、あらかじめ計量された材料を使うように指示されています。"},{"sentence":"These pre-weighed coffee packets are convenient for travel.","translation":"これらのあらかじめ計量されたコーヒーパケットは旅行に便利です。"},{"sentence":"The lab uses pre-weighed samples for accurate experiments.","translation":"その研究所では、正確な実験のために、あらかじめ計量されたサンプルを使用しています。"}],"collocations":["pre-weighed ingredients","pre-weighed samples","pre-weighed packets","pre-weighed portions","pre-weighed amounts"],"synonyms":["premeasured","pre-portioned"],"antonyms":["unweighed"],"notes":"Often used to describe food items, chemicals, or other materials where precise measurement is important."}],"etymology":{"value":"Formed by adding the prefix 'pre-' (meaning 'before') to the past participle 'weighed' of the verb 'weigh'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpriːˈweɪd/","syllables":"pre-weighed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Pre-weighed' describes something that has had its weight determined and often recorded before being sold, used, or processed. It emphasizes convenience and accuracy in situations where precise measurements are needed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preweighed ingredients were all mixed together.","correct":"✓ The pre-weighed ingredients were all mixed together.","note":"Hyphenate 'pre-weighed' when it modifies a noun (i.e., it is an adjective)."},{"incorrect":"✗ He pre-weighed the ingredients before starting cook.","correct":"✓ He pre-weighed the ingredients before starting to cook.","note":"'Pre-weigh' can also be used as a verb (though less common), meaning to weigh something in advance. In this case, it's two words or hyphenated."}],"priority":"★☆☆"},"related_words":{"derivatives":["pre-weigh (verb)","weigh (verb)","weight (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., cooking, chemistry).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pre-weighed' is a compound adjective that means something has been weighed before it is used or sold. It is commonly used in contexts where precise measurements are important, such as cooking, scientific experiments, or selling goods by weight. The 'pre-' prefix indicates that the weighing process happens in advance. Understanding this word helps in comprehending instructions or descriptions related to these contexts."},"example_sentences":[{"sentence":"The lab technician used **pre-weighed** chemicals for the experiment.","translation":"実験のために、実験技師はあらかじめ計量された化学薬品を使用した。","type":"adjective","meaning_category":"measurement"},{"sentence":"These **pre-weighed** flour packets are perfect for single-serving recipes.","translation":"これらのあらかじめ計量された小麦粉パケットは一人分のレシピに最適です。","type":"adjective","meaning_category":"convenience"},{"sentence":"Using **pre-weighed** ingredients ensures consistent results in baking.","translation":"あらかじめ計量された材料を使うことで、ベーキングで安定した結果が得られます。","type":"adjective","meaning_category":"accuracy"}]}