{"word":"perorational","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"結論的な、結語的な","english_definition":"Of or pertaining to a peroration; concluding.","examples":[{"sentence":"The perorational section of the speech summarized the main points.","translation":"演説の結語部分では、主な点がまとめられた。"},{"sentence":"His perorational remarks left a lasting impression on the audience.","translation":"彼の結語的な発言は、聴衆に永続的な印象を与えた。"}],"collocations":["perorational section","perorational remarks","perorational summary"],"synonyms":["concluding","final","terminal","summative","recapitulatory"],"antonyms":["introductory","preliminary","opening"]}],"etymology":{"value":"From peroration + -al. Peroration derives from Latin peroratio, from perorare (to speak at length, to conclude a speech).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrəˈreɪʃənəl/","syllables":"per-o-ra-tion-al"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative constructions with 'more' and 'most'."},"usage_notes":{"explanation":"'Perorational' is a somewhat formal term, primarily used in the context of rhetoric, oratory, and formal writing. It describes something that is characteristic of or related to a peroration, which is the concluding part of a speech or piece of writing, typically intended to inspire or move the audience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perorational speech was very long.","correct":"✓ The speech's peroration was very long.","note":"'Perorational' describes something pertaining to a conclusion. A 'perorational speech' is not correct, but the 'perorational section' or 'perorational summary' would be. To describe the speech itself, use 'long-winded' or 'lengthy' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["peroration (noun: the concluding part of a speech, typically intended to inspire or move the audience.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'perorational' is a formal and uncommon adjective. It describes something related to the conclusion of a speech or piece of writing, especially when that conclusion is designed to be persuasive or inspiring. Because it is rarely used in everyday conversation, it is considered a high-level vocabulary word. Understanding the root word 'peroration' is helpful in grasping its meaning."},"example_sentences":[{"sentence":"The perorational address moved many to tears.","translation":"その結語的な演説は多くの人々を感動させ涙させた。","type":"adjective","meaning_category":"concluding"},{"sentence":"The perorational statement was the most important part of the presentation.","translation":"その結語的な声明はプレゼンテーションの中で最も重要な部分だった。","type":"adjective","meaning_category":"concluding"},{"sentence":"The perorational paragraph summarized the key arguments.","translation":"その結語的な段落は主要な議論を要約した。","type":"adjective","meaning_category":"concluding"}]}