{"word":"Inofficiousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)遺言が、近親者（配偶者、子供など）への当然の相続分を不当に奪っている状態。また、その遺言の無効を主張する訴訟の根拠。","english_definition":"(law) The state of a will that unjustly deprives close relatives (such as a spouse or children) of their rightful inheritance; also, the basis for a lawsuit challenging the validity of such a will.","examples":[{"sentence":"The children challenged the will on the grounds of inofficiousness, arguing that they were unfairly disinherited.","translation":"子供たちは、自分たちが不当に相続権を奪われたとして、遺言の不当性を理由に異議を申し立てた。"},{"sentence":"The concept of inofficiousness is designed to protect the immediate family from being completely excluded from an inheritance.","translation":"遺言の不当性という概念は、近親者が相続から完全に排除されるのを防ぐように設計されている。"}],"collocations":["claim of inofficiousness","grounds for inofficiousness","challenge a will based on inofficiousness"],"synonyms":["unjust disinheritance","unfair will","undue influence (related concept)"],"antonyms":["just inheritance","fair will","equitable distribution"],"notes":"This term is primarily used in legal contexts, especially concerning wills and estates."}],"etymology":{"value":"Derived from the Latin word 'inofficiosus,' meaning 'undutiful' or 'lacking in affection.' It reflects the idea that a will is 'undutiful' if it fails to provide for close family members.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnəˈfɪʃəsnəs/","syllables":"in-of-fi-cious-ness"},"inflection":{"noun_plural":"Inofficiousnesses (rarely used)"},"usage_notes":{"explanation":"'Inofficiousness' is a legal term referring to a will that is considered unfair because it doesn't adequately provide for the testator's immediate family. It's a ground for contesting a will, arguing that the testator acted against their moral duty to their family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inofficiousness of the employee led to his termination.","correct":"✓ The employee's negligence led to his termination.","note":"'Inofficiousness' specifically relates to wills and inheritance, not general work performance."}],"priority":"★☆☆"},"related_words":{"derivatives":["inofficiosus (adjective, Latin)"],"legal_terms":["will contest","inheritance law","disinheritance","testator","beneficiary"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily a legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Inofficiousness' is a specialized legal term. It describes a situation where a will is seen as unfair because it doesn't properly provide for the testator's close family members. This can be used as a reason to challenge the will in court. The term is not commonly used outside of legal discussions."},"example_sentences":[{"sentence":"The lawyer advised the family that there were grounds to challenge the will based on its apparent inofficiousness.","translation":"弁護士は、その遺言には明らかな不当性があるため、異議を申し立てる根拠があると家族に助言した。","type":"noun","meaning_category":"legal"},{"sentence":"The court considered the claim of inofficiousness, weighing the testator's reasons for disinheritance against the needs of the surviving family.","translation":"裁判所は、遺言の不当性に関する主張を検討し、相続人を排除した遺言者の理由と、残された家族のニーズを比較衡量した。","type":"noun","meaning_category":"legal"}]}