{"word":"Lycodes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Eelpouts; a genus of fish in the family Zoarcidae (eelpouts).","english_definition":"A genus of fish in the family Zoarcidae, commonly known as eelpouts.","examples":[{"sentence":"The Lycodes species are found in cold marine waters.","translation":"Lycodes属の種は、冷たい海水域で見られます。"}],"collocations":["Lycodes species","Lycodes fish","Arctic Lycodes"],"synonyms":["eelpout"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'lycos' (wolf) and 'odes' (resembling), possibly referring to the wolf-like appearance or predatory nature of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪkoʊdiːz/","syllables":"Ly-co-des"},"inflection":{"noun_plural":"Lycodes"},"usage_notes":{"explanation":"'Lycodes' is a scientific term used in biology, specifically in zoology and ichthyology. It refers to a specific genus of fish. It is typically used in scientific contexts, such as research papers, species descriptions, and taxonomic classifications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Lycodes in the aquarium, it was very cute.","correct":"✓ I saw a Lycodes in the aquarium. It was interesting.","note":"'Lycodes' are not typically considered 'cute' and are not commonly found in aquariums. This example is unlikely."}],"priority":"★☆☆"},"related_words":{"derivatives":["Zoarcidae (family)","fish","marine biology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Lycodes' is a scientific term used to classify a genus of fish within the family Zoarcidae. Due to its highly specialized nature, it is primarily encountered in scientific literature and is not part of general vocabulary. Understanding requires familiarity with biological nomenclature."},"example_sentences":[{"sentence":"Researchers are studying the adaptations of Lycodes to extreme cold environments.","translation":"研究者たちは、Lycodes属の魚が極寒の環境に適応する仕組みを研究しています。","type":"noun","meaning_category":"scientific"},{"sentence":"The distribution of Lycodes species varies depending on ocean depth and temperature.","translation":"Lycodes属の魚の分布は、水深と水温によって異なります。","type":"noun","meaning_category":"scientific"}]}