{"word":"vehicle-focused","meanings":[{"part_of_speech":"adjective","definition":"車両に焦点を当てた、車両中心の","english_definition":"Centered on or primarily concerned with vehicles.","examples":[{"sentence":"The new transportation plan is very vehicle-focused, with little attention paid to pedestrians or cyclists.","translation":"新しい交通計画は車両に重点を置いており、歩行者や自転車利用者への配慮はほとんどありません。"},{"sentence":"The conference had a vehicle-focused theme, showcasing the latest advancements in automotive technology.","translation":"会議は車両中心のテーマで開催され、自動車技術の最新の進歩が紹介されました。"},{"sentence":"The city's infrastructure is vehicle-focused, making it difficult for people who don't own cars to get around.","translation":"その都市のインフラは車両中心に設計されており、車を所有していない人々が移動するのは困難です。"}],"collocations":["vehicle-focused design (車両中心の設計)","vehicle-focused infrastructure (車両中心のインフラ)","vehicle-focused policy (車両中心の政策)","vehicle-focused approach (車両中心のアプローチ)","vehicle-focused development (車両中心の開発)"],"synonyms":["car-centric","automobile-oriented","motor vehicle-based"],"antonyms":["pedestrian-focused","transit-oriented","people-centered"],"related_words":["vehicle (車両)","focus (焦点)","transportation (輸送)","infrastructure (インフラ)","automotive (自動車の)"],"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"usage_notes":{"explanation":"The term \"vehicle-focused\" is often used in discussions about urban planning, transportation policy, and environmental sustainability. It typically implies a prioritization of motor vehicles over other modes of transportation, such as walking, cycling, or public transit. This prioritization can lead to negative consequences, such as increased traffic congestion, air pollution, and social inequity.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Vehicle-focused' means that something is mainly about vehicles. It's often used when talking about how cities are designed, where cars are given more importance than other ways of getting around, like walking or using public transport. If a plan is 'vehicle-focused,' it might mean there are lots of roads but not many bike paths or good bus routes."}}]}