{"word":"supersocial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"極めて社交的な、非常に社会的な","english_definition":"Extremely sociable; highly social.","examples":[{"sentence":"She's a supersocial person who thrives in large groups.","translation":"彼女は非常に社交的な人で、大勢のグループの中で生き生きとする。"},{"sentence":"The supersocial nature of humans has allowed us to build complex societies.","translation":"人間の極めて社会的な性質が、私たちが複雑な社会を築くことを可能にした。"},{"sentence":"Online platforms cater to the supersocial tendencies of modern individuals.","translation":"オンラインプラットフォームは、現代人の非常に社会的な傾向に応えている。"}],"collocations":["supersocial behavior","supersocial species","supersocial network","supersocial environment"],"synonyms":["highly sociable","extremely outgoing","very gregarious","hyper-social"],"antonyms":["antisocial","unsociable","asocial","introverted"]}],"etymology":{"value":"\"Super-\" (above, beyond) + \"social\" (relating to society or its organization). The term emphasizes a degree of sociability that goes beyond the ordinary.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈsoʊʃəl/","syllables":"su-per-so-cial"},"inflection":{"notes":"Adjective, so it has comparative (more supersocial) and superlative (most supersocial) forms, though they are not commonly used."},"usage_notes":{"explanation":"\"Supersocial\" describes a level of social interaction and behavior that is exceptionally high. It is often used to describe individuals who are extremely outgoing and enjoy being around others, or to characterize species or environments where social interaction is a dominant feature. The term can sometimes imply a level of social engagement that is almost excessive or overwhelming.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is supersocial with his work.","correct":"✓ He is supersocial with his colleagues.","note":"\"Supersocial\" refers to interactions with people, not tasks or objects. Use it to describe relationships and interactions among individuals. "},{"incorrect":"✗ The party was supersocial.","correct":"✓ The party was a supersocial event. / ✓ The atmosphere at the party was supersocial.","note":"The party itself is not supersocial, but the event or atmosphere can be described as such."}],"priority":"★☆☆"},"related_words":{"derivatives":["supersociality (noun): the state of being supersocial"],"related_terms":["social","sociable","socialization","society"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing with the rise of social media and online communities.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Supersocial\" is a relatively advanced term used to describe someone or something that is extremely social. It implies a level of social interaction that goes above and beyond what is typical. This word is often used in discussions about sociology, psychology, and the impact of social media. It's important to understand that it denotes a very high degree of sociability, often to the point of being a defining characteristic."},"example_sentences":[{"sentence":"The city is known for its supersocial atmosphere, with numerous events and gatherings happening every week.","translation":"その都市は非常に社交的な雰囲気で知られており、毎週数多くのイベントや集まりが開催されている。","type":"adjective","meaning_category":"極めて社交的な"},{"sentence":"Bees are a supersocial species, living in highly organized colonies.","translation":"ハチは非常に社会的な種であり、高度に組織化されたコロニーで生活している。","type":"adjective","meaning_category":"非常に社会的な"},{"sentence":"Her supersocial skills made her a natural leader in the community.","translation":"彼女の非常に社交的なスキルは、彼女をコミュニティの自然なリーダーにした。","type":"adjective","meaning_category":"極めて社交的な"}]}