{"word":"steatite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"滑石、蝋石（ろうせき）","english_definition":"A metamorphic rock consisting largely of talc, with varying amounts of other minerals such as chlorite, pyroxene, amphibole, or carbonates.","examples":[{"sentence":"Steatite is often used for carving because it is soft and easily worked.","translation":"滑石は柔らかく加工しやすいので、彫刻によく使われます。"},{"sentence":"Ancient civilizations used steatite to make cooking pots and other utensils.","translation":"古代文明では、滑石を使って調理用の鍋やその他の道具を作っていました。"}],"collocations":["carve steatite","steatite carving","steatite bowl","steatite sculpture"],"synonyms":["soapstone","talc rock"],"antonyms":[]}],"etymology":{"value":"From French stéatite, from Latin steatitis, from Ancient Greek στεᾰτίτης λίθος (steatítēs líthos, “soapstone”), from στεᾰ́τιον (steátion, “a kind of soft stone”), from στέᾰρ (stéar, “tallow, suet, hard fat”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstiːətaɪt/","syllables":"ste-a-tite"},"inflection":{"noun_plural":"steatites"},"usage_notes":{"explanation":"Steatite is a metamorphic rock, meaning it has been changed by heat and pressure. It is known for its softness and soapy feel. It is often used in art and industry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The steatite is a mineral.","correct":"✓ Steatite is a rock.","note":"Steatite is a rock, primarily composed of the mineral talc."}],"priority":"★★★"},"related_words":{"derivatives":["steatitic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Steatite' is a technical term for a type of rock, specifically a metamorphic rock rich in talc. It's not a common word, so understanding it requires some familiarity with geology or materials science. The word is more likely to appear in specialized contexts related to carving, sculpture, or certain industrial applications.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Inuit people traditionally carved lamps and cooking pots from **steatite**.","translation":"イヌイットの人々は伝統的に滑石からランプや調理用の鍋を彫っていました。","type":"noun","meaning_category":"滑石"},{"sentence":"Due to its heat resistance, **steatite** is used in some electrical insulators.","translation":"耐熱性があるため、滑石は一部の電気絶縁体に使用されています。","type":"noun","meaning_category":"滑石"}]}