{"word":"shearer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"羊の毛刈り職人","english_definition":"a person who shears sheep, especially as an occupation.","examples":[{"sentence":"The shearer worked quickly and efficiently to shear the sheep.","translation":"その毛刈り職人は、羊の毛を刈るために素早く効率的に作業した。"},{"sentence":"The shearers travel from farm to farm during shearing season.","translation":"毛刈り職人たちは、毛刈りシーズン中に農場から農場へと移動する。"}],"collocations":["professional shearer","sheep shearer","contract shearer","experienced shearer","qualified shearer"],"synonyms":["wool cutter","sheep shearman"],"antonyms":[]},{"part_of_speech":"noun","definition":"毛刈り機","english_definition":"a tool or machine used for shearing sheep.","examples":[{"sentence":"The shearer used electric shears to quickly remove the wool.","translation":"毛刈り職人は、電気毛刈り機を使って素早く羊毛を取り除いた。"},{"sentence":"The farm had several shearers for the annual shearing.","translation":"その農場には、年次の毛刈りのためにいくつかの毛刈り機があった。"}],"collocations":["electric shearer","hand shearer","mechanical shearer"],"synonyms":["shearing machine","shearing tool"],"antonyms":[]}],"etymology":{"value":"From 'shear' (to cut) + '-er' (agent suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪərə(r)/","syllables":"shear-er"},"inflection":{"noun_plural":"shearers"},"usage_notes":{"explanation":"The term 'shearer' can refer to both the person doing the shearing and the tool they use. Context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The shearer is broken, so we can't shear the sheep.","correct":"✓ The shearing machine is broken, so we can't shear the sheep.","note":"While 'shearer' can refer to the machine, 'shearing machine' is more specific and less ambiguous."}],"priority":"★☆☆"},"related_words":{"derivatives":["shear (verb): to cut the wool off a sheep or other animal.","shearing (noun): the act of cutting the wool off a sheep or other animal.","shears (noun): a tool resembling scissors but typically larger, for cutting things such as hedges or sheep's wool."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'shearer' refers to a person whose job is to cut the wool off sheep. It can also refer to the tool or machine used for this purpose. This word is most commonly used in agricultural contexts, particularly in countries with large sheep farming industries, such as Australia and New Zealand. It is not a very common word in everyday conversation, so it is more likely to be encountered in specialized texts or discussions related to farming and wool production."},"example_sentences":[{"sentence":"The Australian shearer set a new world record for the most sheep shorn in a day.","translation":"そのオーストラリア人毛刈り職人は、1日に最も多くの羊を刈ったという世界記録を樹立した。","type":"noun","meaning_category":"person"},{"sentence":"The shearer needs to be sharpened regularly to maintain its efficiency.","translation":"毛刈り機は、効率を維持するために定期的に研ぐ必要がある。","type":"noun","meaning_category":"tool"}]}