{"word":"perquisite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(本給とは別に与えられる) 特典、手当、チップ、臨時収入","english_definition":"a thing regarded as a special right or privilege enjoyed as a result of one's position. An incidental benefit awarded for certain types of employment (especially if it's regarded as a right).","examples":[{"sentence":"A company car is a perquisite of the job.","translation":"社用車はその仕事の特典の一つだ。"},{"sentence":"One of the perquisites of being a judge is a large office.","translation":"裁判官であることの特典の一つは、広いオフィスだ。"},{"sentence":"The perquisites offered by the company include health insurance and a pension plan.","translation":"会社が提供する特典には、健康保険と年金制度が含まれている。"}],"collocations":["job perquisites","employee perquisites","executive perquisites","perquisites package","company perquisites"],"synonyms":["fringe benefit","perk","privilege","advantage","bonus","entitlement","benefit","amenity"],"antonyms":["disadvantage","liability","obligation"]},{"part_of_speech":"noun","definition":"(古語) (当然の)権利、特権","english_definition":"(archaic) a right or privilege that is exclusive to a particular person or group.","examples":[{"sentence":"In former times, the nobility enjoyed many perquisites.","translation":"昔は、貴族は多くの特権を享受していた。"}],"collocations":[],"synonyms":["right","privilege","entitlement","prerogative"],"antonyms":["duty","responsibility"]}],"etymology":{"value":"Late Middle English: from medieval Latin perquisitum, neuter of perquisitus, past participle of perquirere ‘seek for diligently’, from per- ‘thoroughly’ + quaerere ‘seek’. Originally denoting property acquired other than by inheritance, the term came to be used more generally for incidental advantages.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrkwɪzɪt/","syllables":"per-qui-site"},"inflection":{"noun_plural":"perquisites"},"usage_notes":{"explanation":"'Perquisite' refers to benefits or advantages that come with a job or position, in addition to the regular salary. These are often seen as entitlements or privileges. The term is often used in a business context. While 'perk' is a more common and informal synonym, 'perquisite' often implies a more formal or established benefit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The salary is low, but there are many perquisites, such as free coffee and a relaxed dress code.","correct":"✓ The salary is low, but there are many perks, such as free coffee and a relaxed dress code.","note":"For minor, informal benefits like free coffee, 'perk' is more appropriate. 'Perquisite' suggests more substantial benefits."},{"incorrect":"✗ He demanded a perquisite for his work.","correct":"✓ He demanded payment for his work.","note":"'Perquisite' is a benefit *in addition to* payment, not a replacement for it."}],"priority":"★★☆"},"related_words":{"derivatives":["perk (informal synonym)"],"phrasal_verbs":[],"related_concepts":["compensation","remuneration","employee benefits","executive compensation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in formal or business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perquisite' is a relatively formal word referring to benefits that come with a job or position, beyond the regular salary. Think of it as an extra advantage or privilege. It's not a word you'd use in everyday conversation, but you might encounter it in business or legal contexts. A simpler synonym is 'perk', but 'perquisite' often implies something more official or substantial."},"example_sentences":[{"sentence":"The executive's contract included several valuable perquisites.","translation":"その役員の契約には、いくつかの価値ある特典が含まれていた。","type":"noun","meaning_category":"特典"},{"sentence":"Access to the corporate jet was considered a major perquisite.","translation":"社用ジェット機へのアクセスは、大きな特典とみなされていた。","type":"noun","meaning_category":"特典"},{"sentence":"Health insurance is a common perquisite offered to full-time employees.","translation":"健康保険は、正社員に提供される一般的な特典である。","type":"noun","meaning_category":"特典"}]}