{"word":"unmodeled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"まだモデル化されていない、モデル化されていない","english_definition":"Not yet modeled; not represented by a model.","examples":[{"sentence":"The unmodeled dynamics of the system could lead to unexpected behavior.","translation":"システムのモデル化されていないダイナミクスは、予期しない動作につながる可能性があります。"},{"sentence":"The effects of the unmodeled variables were difficult to assess.","translation":"モデル化されていない変数の影響を評価するのは困難でした。"},{"sentence":"Further research is needed to understand the unmodeled aspects of this phenomenon.","translation":"この現象のモデル化されていない側面を理解するには、さらなる研究が必要です。"}],"collocations":["unmodeled dynamics","unmodeled effects","unmodeled variables","unmodeled aspects","unmodeled behavior"],"synonyms":["unrepresented","unsimulated","unaccounted for"],"antonyms":["modeled","simulated","represented"]}],"etymology":{"value":"'un-' (not) + 'modeled' (past participle of 'model').","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈmɒdəld/","syllables":"un-mod-eled"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Unmodeled' typically refers to aspects of a system, phenomenon, or process that have not been included in a mathematical or computational model. This could be due to a lack of understanding, computational limitations, or a deliberate simplification of the model. It is commonly used in scientific, engineering, and mathematical contexts.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["model","modeling"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'unmodeled' is a technical term often used in scientific and engineering fields. It describes something that has not been represented or simulated using a model, often because it is too complex, poorly understood, or intentionally simplified for the sake of the model's usability. Understanding this word requires familiarity with the concept of modeling in these fields."},"example_sentences":[{"sentence":"The control system failed to compensate for the unmodeled disturbances.","translation":"制御システムは、モデル化されていない外乱を補償できませんでした。","type":"adjective","meaning_category":"Not yet modeled"},{"sentence":"The simulation results deviated significantly from the experimental data due to unmodeled factors.","translation":"シミュレーション結果は、モデル化されていない要因により、実験データから大きく逸脱しました。","type":"adjective","meaning_category":"Not yet modeled"},{"sentence":"The robustness of the algorithm needs to be evaluated against unmodeled uncertainties.","translation":"アルゴリズムのロバスト性は、モデル化されていない不確実性に対して評価する必要があります。","type":"adjective","meaning_category":"Not yet modeled"}]}