{"word":"yasmaks","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤシュマク（イスラム教徒の女性が着用するヴェールの一種）","english_definition":"A type of veil worn by Muslim women, covering the face from below the eyes.","examples":[{"sentence":"In some traditional societies, women wear yasmaks to maintain modesty.","translation":"一部の伝統的な社会では、女性は慎み深さを保つためにヤシュマクを着用します。"},{"sentence":"The yasmaks were often made of fine silk or cotton.","translation":"ヤシュマクはしばしば上質な絹や綿で作られていました。"}],"collocations":["wear a yasmak","traditional yasmak","silk yasmak"],"synonyms":["veil","niqab","burqa","hijab"],"antonyms":[]}],"etymology":{"value":"トルコ語の「yaşmak」から派生。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈjæsmæks/","syllables":"yas-maks"},"inflection":{"noun_plural":"yasmaks"},"usage_notes":{"explanation":"「yasmak」は、特に歴史的な文脈や文化的な議論において使用される単語です。現代では、より一般的な用語である「veil」、「hijab」、「niqab」、「burqa」などが使われることが多いです。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a yasmak on her head.","correct":"✓ She wore a yasmak covering her face.","note":"ヤシュマクは顔の下半分を覆うため、「head（頭）」ではなく「face（顔）」を覆うと表現するのが適切です。"},{"incorrect":"✗ Yasmaks are only worn in Arab countries.","correct":"✓ Yasmaks were historically worn in various Muslim-majority countries, including the Ottoman Empire.","note":"ヤシュマクは、アラブ諸国だけでなく、オスマン帝国など、さまざまなイスラム教徒が多数を占める国で歴史的に着用されていました。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hijab","niqab","burqa","veil","chador"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'yasmaks' refers to a specific type of veil worn by Muslim women, particularly in historical contexts. Due to its specificity and cultural significance, it is not a commonly used word in everyday English. Understanding its meaning requires some knowledge of Islamic cultural practices and historical fashion. It is more likely to be encountered in academic texts, historical novels, or discussions about cultural attire.","priority":"★☆☆"},"example_sentences":[{"sentence":"Historically, yasmaks were common in Ottoman society as a form of modest dress.","translation":"歴史的に、ヤシュマクはオスマン社会において、控えめな服装の一形態として一般的でした。","type":"noun","meaning_category":"veil"},{"sentence":"The traveler described the women in the marketplace wearing colorful yasmaks.","translation":"旅行者は、市場の女性たちが色鮮やかなヤシュマクを身に着けている様子を描写しました。","type":"noun","meaning_category":"veil"}]}