{"word":"oviparous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"卵生の","english_definition":"producing young by means of eggs that are hatched after they have been laid by the parent.","examples":[{"sentence":"Birds are oviparous animals.","translation":"鳥は卵生の動物です。"},{"sentence":"Most fish and reptiles are oviparous.","translation":"ほとんどの魚類と爬虫類は卵生です。"},{"sentence":"Oviparous animals lay eggs that hatch outside the mother's body.","translation":"卵生の動物は、母親の体外で孵化する卵を産みます。"}],"collocations":["oviparous animal","oviparous species","oviparous reproduction"],"synonyms":["egg-laying"],"antonyms":["viviparous","ovoviviparous"]}],"etymology":{"value":"From Latin 'oviparus', from 'ovum' (egg) + '-parus' (bearing, producing), from 'parere' (to produce).","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈvɪpərəs/","syllables":"o-vip-a-rous"},"inflection":{"notes":"Comparative and superlative forms are possible but rare (more oviparous, most oviparous)."},"usage_notes":{"explanation":"'Oviparous' is a scientific term used to describe animals that reproduce by laying eggs. The eggs hatch outside the mother's body. This is in contrast to viviparous animals, which give birth to live young, and ovoviviparous animals, where eggs hatch inside the mother's body but the young are born live.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chicken is a viviparous animal because it lays eggs.","correct":"✓ The chicken is an oviparous animal because it lays eggs.","note":"Viviparous animals give birth to live young, while oviparous animals lay eggs. Chickens lay eggs, so they are oviparous."}],"priority":"★★☆"},"related_words":{"derivatives":["oviparity (noun)"],"phrasal_verbs":[],"related_terms":["viviparous","ovoviviparous","egg","hatch"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'oviparous' is a technical term used in biology to describe animals that reproduce by laying eggs that hatch outside the mother's body. Understanding this word requires familiarity with biological classifications and reproductive strategies. It's often contrasted with 'viviparous' (giving birth to live young) and 'ovoviviparous' (eggs hatch inside the mother, then live birth)."},"example_sentences":[{"sentence":"The platypus is a unique mammal because it is oviparous.","translation":"カモノハシは卵生であるため、珍しい哺乳類です。","type":"general","meaning_category":"general"},{"sentence":"Snakes exhibit both oviparous and viviparous reproductive strategies depending on the species.","translation":"ヘビは種によって卵生と胎生の繁殖戦略の両方を示します。","type":"biology","meaning_category":"biology"},{"sentence":"Many insects are oviparous, laying their eggs on plants or in the soil.","translation":"多くの昆虫は卵生で、植物や土壌に卵を産みます。","type":"zoology","meaning_category":"zoology"}]}