{"word":"reannealing","priority":"Low","meanings":[{"part_of_speech":"verb","definition":"To anneal (a material, especially metal or glass) again.","english_definition":"To anneal (a material, especially metal or glass) again.","examples":[{"sentence":"The metal was reannealed to improve its ductility.","translation":"その金属は延性を向上させるために再度焼きなましされた。"}],"collocations":[],"synonyms":["anneal"],"antonyms":[]}],"etymology":{"value":"The word \"reannealing\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"annealing\".","priority":"Medium"},"pronunciation":{"ipa":"/ˌriːəˈniːlɪŋ/","syllables":"re-an-neal-ing"},"inflection":{"verb_forms":{"present_simple":["reanneal","reanneals"],"past_simple":"reannealed","past_participle":"reannealed","present_participle":"reannealing"}},"usage_notes":{"explanation":"\"Reannealing\" is a technical term primarily used in metallurgy, materials science, and glassmaking. It refers to the process of annealing a material that has already been annealed once. This might be done to further refine the material's properties or to correct issues that arose after the initial annealing process.","priority":"Medium"},"common_mistakes":{},"related_words":{"derivatives":["reanneal (verb)","annealing (noun)"],"priority":"Medium"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'reannealing' is a specialized term used in materials science and engineering. It refers to the process of annealing a material for a second or subsequent time to further improve its properties or correct any issues from the initial annealing process. Understanding this term requires familiarity with materials processing techniques."},"example_sentences":[{"sentence":"The steel component required reannealing after the initial heat treatment resulted in uneven hardness.","translation":"その鋼鉄部品は、最初の熱処理が不均一な硬度をもたらしたため、再焼きなましが必要だった。","type":"verb","meaning_category":"heat treatment"},{"sentence":"Reannealing the glass reduced residual stress and improved its resistance to cracking.","translation":"ガラスを再焼きなましすることで、残留応力が軽減され、亀裂に対する耐性が向上した。","type":"verb","meaning_category":"materials science"}]}