{"word":"scarabaeidoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コガネムシ（スカラベ）に似た、コガネムシ型の","english_definition":"Resembling or pertaining to scarab beetles, especially in shape or form.","examples":[{"sentence":"The ancient Egyptians often crafted scarabaeidoid amulets from various materials.","translation":"古代エジプト人は、さまざまな素材からコガネムシ型の護符をよく作りました。"},{"sentence":"The decorative motif featured a scarabaeidoid design.","translation":"装飾的なモチーフは、コガネムシ型のデザインを特徴としていました。"}],"collocations":["scarabaeidoid amulet (コガネムシ型の護符)","scarabaeidoid design (コガネムシ型のデザイン)"],"synonyms":["scarabaeiform","beetle-shaped"],"antonyms":[]}],"etymology":{"value":"Derived from 'Scarabaeidae' (the scientific family name for scarab beetles) + '-oid' (a suffix meaning 'resembling').","priority":"★★★"},"pronunciation":{"ipa":"/ˌskærəˈbiːdɔɪd/","syllables":"scar-a-bae-i-doid"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"The term 'scarabaeidoid' is primarily used in art, archaeology, and entomology to describe objects or shapes that resemble scarab beetles, particularly the dung beetle (Scarabaeus sacer) which held significant religious and cultural importance in ancient Egypt. It is often used to describe amulets, seals, and decorative motifs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scarabaeidoid was found in the tomb.","correct":"✓ A scarabaeidoid amulet was found in the tomb.","note":"'Scarabaeidoid' is an adjective, so it must modify a noun. The noun it modifies is usually something like 'amulet', 'seal', or 'design'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Scarabaeidae (noun: the family of scarab beetles)","scarab (noun: a type of beetle, especially the dung beetle Scarabaeus sacer, regarded as sacred in ancient Egypt)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scarabaeidoid' is a specialized term primarily used in academic or technical contexts related to ancient Egyptian artifacts, art history, or entomology. It describes something that resembles a scarab beetle. Due to its specific usage and etymology, it is not commonly encountered in general language. Understanding the term requires familiarity with the cultural significance of scarab beetles in ancient Egypt and basic knowledge of scientific classification suffixes like '-oid'."},"example_sentences":[{"sentence":"The museum displayed a collection of scarabaeidoid seals from the Ptolemaic period.","translation":"博物館には、プトレマイオス朝時代のコガネムシ型の印章のコレクションが展示されていました。","type":"adjective","meaning_category":"resembling scarab beetles"},{"sentence":"The artist incorporated a scarabaeidoid motif into the jewelry design.","translation":"アーティストは、コガネムシ型のモチーフをジュエリーのデザインに取り入れました。","type":"adjective","meaning_category":"resembling scarab beetles"}]}