{"word":"alcohol-regulated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"アルコール規制された、アルコールに関する規制がある","english_definition":"Subject to rules or laws concerning the production, sale, or consumption of alcoholic beverages.","examples":[{"sentence":"The alcohol-regulated environment of the stadium ensured responsible consumption.","translation":"スタジアムのアルコール規制された環境は、責任ある消費を保証した。"},{"sentence":"Alcohol-regulated zones are common near schools and parks.","translation":"アルコール規制区域は、学校や公園の近くによく見られる。"}],"collocations":["alcohol-regulated area","alcohol-regulated event","alcohol-regulated industry"],"synonyms":["alcohol-controlled","alcohol-restricted","alcohol-governed"],"antonyms":["alcohol-unregulated","alcohol-free","unrestricted"]}],"etymology":{"value":"The term is formed by combining 'alcohol' with 'regulated,' indicating that the subject is under specific rules or laws related to alcohol.","priority":"N/A"},"pronunciation":{"ipa":"/ˈælkəˌhɔl ˌrɛɡjəˌleɪtɪd/","syllables":"al-co-hol reg-u-la-ted"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Alcohol-regulated' is used to describe environments, industries, or activities where the use, sale, or production of alcohol is controlled by specific rules or laws. This term is often used in discussions about public health, safety, and legal compliance.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["regulate","regulation","alcohol"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'alcohol-regulated' is a compound adjective used to describe something that is subject to rules or laws regarding alcohol. It implies that there are specific controls in place concerning the production, sale, or consumption of alcohol. This term is commonly used in legal, public health, and policy contexts."},"example_sentences":[{"sentence":"The city implemented an alcohol-regulated policy to reduce public intoxication.","translation":"市は、公共の酩酊を減らすために、アルコール規制政策を実施した。","type":"adjective","meaning_category":"アルコール規制された"},{"sentence":"The festival operated under an alcohol-regulated permit, ensuring responsible drinking.","translation":"そのフェスティバルは、責任ある飲酒を保証するアルコール規制許可証の下で運営された。","type":"adjective","meaning_category":"アルコール規制された"}]}