{"word":"grainedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物質の)粒状性、きめ細かさ、木目、(写真の)粒子性、粗さ","english_definition":"The quality or state of being grainy; the degree to which a material has a granular texture or appearance.","examples":[{"sentence":"The grainedness of the wood gave the furniture a rustic look.","translation":"その木材の木目が家具に素朴な外観を与えた。"},{"sentence":"The photograph suffered from excessive grainedness due to the high ISO setting.","translation":"その写真は、高いISO設定のために過度の粒子性があった。"},{"sentence":"The artist appreciated the grainedness of the paper for its textural qualities.","translation":"アーティストは、その紙の質感の品質のために、その粒状性を高く評価した。"}],"collocations":["fine grainedness (きめ細かさ)","coarse grainedness (粗い粒状性)","wood grainedness (木目)","paper grainedness (紙のきめ)","image grainedness (画像の粒子性)"],"synonyms":["granularity","texture","graininess","roughness","particulateness"],"antonyms":["smoothness","uniformity","evenness"]}],"etymology":{"value":"The word 'grainedness' is derived from 'grain' + '-ed' (forming an adjective) + '-ness' (forming a noun). 'Grain' comes from Old English 'corn, seed, kernel' and refers to the texture or pattern of a material.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡreɪnɪdnəs/","syllables":"grained-ness"},"inflection":{"noun_plural":"grainednesses"},"usage_notes":{"explanation":"'Grainedness' refers to the quality of having a grainy texture or appearance. It can describe the texture of wood, paper, or other materials. In photography, it refers to the visible grain or noise in an image, especially when taken with high ISO settings or underexposed. The term is generally used to describe the degree to which these grains are visible or pronounced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The grainedness of the glass was very clear.","correct":"✓ The texture of the glass was very clear.","note":"'Grainedness' is typically used for materials like wood, paper, or photographic images, not usually for glass. 'Texture' is a more general term. "},{"incorrect":"✗ The grainedness of his voice was soothing.","correct":"✓ The roughness of his voice was soothing.","note":"For describing a voice, 'roughness' or 'raspy quality' would be more appropriate than 'grainedness'."}],"priority":"★★☆"},"related_words":{"derivatives":["grain (noun)","grained (adjective)","grainy (adjective)","ungrained (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Grainedness' is a relatively uncommon word used to describe the texture or appearance of a material that has a granular or grainy quality. It is often used in the context of wood, paper, or photography to describe the visibility and characteristics of the grain or particles within the material or image. The word is more technical and less frequently used in everyday conversation."},"example_sentences":[{"sentence":"The artist chose a canvas with a noticeable grainedness to enhance the texture of the painting.","translation":"アーティストは、絵画の質感を高めるために、目立つ粒状性のキャンバスを選んだ。","type":"noun","meaning_category":"物質の質感"},{"sentence":"The grainedness of the old photograph added to its vintage charm.","translation":"古い写真の粒子性が、そのヴィンテージの魅力に拍車をかけた。","type":"noun","meaning_category":"写真の粒子性"},{"sentence":"The furniture maker carefully selected wood for its unique grainedness.","translation":"家具職人は、その独特の木目のために木材を慎重に選んだ。","type":"noun","meaning_category":"木目"}]}