{"word":"super-royal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非常に王室的な、極めて王室の、王室以上の","english_definition":"Exceedingly royal; surpassing ordinary royalty in grandeur, status, or characteristics.","examples":[{"sentence":"The coronation ceremony was a super-royal affair, with dignitaries from around the globe.","translation":"戴冠式は、世界中からの高官が出席する、極めて王室的な行事だった。"},{"sentence":"The palace's super-royal suite boasted amenities beyond imagination.","translation":"宮殿の超王室スイートは、想像を絶するアメニティを誇っていた。"}],"collocations":["super-royal treatment","super-royal suite","super-royal ceremony","super-royal status"],"synonyms":["ultra-royal","hyper-royal","exalted","supreme","magnificent","grand","regal","imperial"],"antonyms":["common","ordinary","plebeian","lowly","humble"]}],"etymology":{"value":"'Super-' (above, beyond) + 'royal' (relating to a king or queen).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈrɔɪəl/","syllables":"su-per-roy-al"},"inflection":{"notes":"Adjective, no inflections beyond comparative/superlative (more super-royal, most super-royal), but these are uncommon."},"usage_notes":{"explanation":"'Super-royal' is a descriptive adjective used to emphasize an extreme degree of royalty, often implying extravagance, exceptional status, or grandeur beyond the typical royal experience. It is not a commonly used word, and its use is often for stylistic effect or hyperbole.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a super-royal person.","correct":"✓ He is of super-royal lineage.","note":"'Super-royal' typically modifies events, objects, or qualities, not people directly. Lineage, status, or treatment are more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["superroyally (adverb, very rare)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Very rare, used for stylistic effect)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Super-royal' is a rare and sophisticated adjective used to describe something that is exceptionally royal, surpassing the ordinary in terms of grandeur or status. It is typically used in formal or literary contexts to create a sense of heightened royalty or extravagance. Because of its rarity, it is more likely to be encountered in written text than in everyday conversation."},"example_sentences":[{"sentence":"The wedding was a super-royal spectacle, broadcast around the world.","translation":"その結婚式は、世界中で放送された、超王室的なスペクタクルだった。","type":"adjective","meaning_category":"Describing an event"},{"sentence":"She received super-royal treatment during her visit to the country.","translation":"彼女は、その国への訪問中、超王室的な待遇を受けた。","type":"adjective","meaning_category":"Describing treatment or status"}]}