{"word":"Biophagy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The consumption and degradation of cellular components by other cellular components, especially in the context of one cell consuming parts of another.","english_definition":"The process by which one cell consumes parts of another cell or its components, often involving the engulfment of cellular material.","examples":[{"sentence":"Biophagy plays a role in interbacterial competition and the evolution of symbiotic relationships.","translation":"バイオファジーは、細菌間の競争や共生関係の進化において役割を果たします。"},{"sentence":"The study of biophagy is important for understanding cellular interactions in microbial communities.","translation":"バイオファジーの研究は、微生物群集における細胞間相互作用を理解するために重要です。"}],"collocations":["intercellular biophagy","bacterial biophagy","biophagy mechanism","biophagy process"],"synonyms":["cellular cannibalism","cell engulfment","cellular predation"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'bios' (life) and 'phagein' (to eat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪˈɒfədʒi/","syllables":"bi-o-pha-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Biophagy is a relatively recently defined term in cellular biology, specifically referring to the consumption of one cell's components by another. It is often studied in the context of microbial interactions, such as bacteria.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["biophagous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Biophagy is a specialized term used in advanced biology, particularly in the study of microbial ecology and cellular interactions. It describes the process where one cell consumes parts of another cell. This term is not commonly encountered outside of scientific literature. Understanding requires knowledge of cell biology and microbial processes."},"example_sentences":[{"sentence":"Biophagy is a key mechanism in the elimination of damaged organelles within a cell.","translation":"バイオファジーは、細胞内の損傷したオルガネラを除去する重要なメカニズムです。","type":"scientific","meaning_category":"cellular process"},{"sentence":"Researchers are investigating the role of biophagy in the development of certain diseases.","translation":"研究者たちは、特定の疾患の発症におけるバイオファジーの役割を調査しています。","type":"scientific","meaning_category":"disease research"}]}