{"word":"beguilers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"人を欺く者たち、誘惑する者たち","english_definition":"plural of beguiler: people who deceive or trick others; those who charm or enchant in a deceptive way.","examples":[{"sentence":"The politician was surrounded by beguilers who whispered false promises in his ear.","translation":"その政治家の周りには、彼の耳に偽りの約束を囁く欺瞞者たちがいた。"},{"sentence":"Beware of the beguilers who offer easy solutions to complex problems.","translation":"複雑な問題に対する安易な解決策を提供する誘惑者たちに注意しなさい。"},{"sentence":"The con artist and his group of beguilers swindled many people out of their savings.","translation":"その詐欺師とその欺瞞者グループは、多くの人々から貯金を騙し取った。"}],"collocations":["group of beguilers","master beguilers","skilled beguilers"],"synonyms":["deceivers","tricksters","cheaters","seducers","enchanters","charmers"],"antonyms":["truthful","honest","sincere"]}],"etymology":{"value":"The word 'beguiler' comes from the verb 'beguile,' which originated in the late 13th century. It comes from the Middle English 'bigilen,' meaning 'to deceive by trickery, lead astray, delude.' This is from 'bi-' (intensive prefix) + 'gile' (guile). The plural form 'beguilers' simply refers to multiple people who perform the act of beguiling.","priority":"★★★"},"pronunciation":{"ipa":"/bɪˈɡaɪlərz/","syllables":"be-guil-ers"},"inflection":{"noun_plural":"beguilers"},"usage_notes":{"explanation":"'Beguilers' refers to a group of people who are actively engaged in deception or trickery. The term often carries a negative connotation, implying that these individuals are manipulative and untrustworthy. It can also refer to people who use charm or enchantment in a deceptive way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The beguilers was at the door.","correct":"✓ The beguilers were at the door.","note":"'Beguilers' is a plural noun, so it requires a plural verb form ('were' instead of 'was')."},{"incorrect":"✗ He is one of the beguilers.","correct":"✓ He is one of the beguilers.","note":"The sentence is grammatically correct. However, it is important to use the term in the correct context, as it implies deception or trickery."}],"priority":"★★☆"},"related_words":{"derivatives":["beguile (verb)","beguiling (adjective)","beguilement (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'beguilers' is a relatively uncommon term, typically used in more formal or literary contexts. It refers to people who deceive or trick others, often through charm or enchantment. Understanding this word requires a good grasp of vocabulary and the ability to infer meaning from context. It's not a word typically encountered in everyday conversation, but rather in literature, historical texts, or discussions about deception and manipulation."},"example_sentences":[{"sentence":"The king's court was filled with beguilers, each vying for his favor through flattery and deceit.","translation":"王の宮廷は欺瞞者たちで溢れ、それぞれがお世辞と欺瞞によって彼の寵愛を得ようと競っていた。","type":"noun","meaning_category":"deceivers"},{"sentence":"History is full of beguilers who have manipulated events for their own gain.","translation":"歴史は、自身の利益のために出来事を操ってきた欺瞞者たちで溢れている。","type":"noun","meaning_category":"tricksters"},{"sentence":"The beguilers used their charm and wit to convince people to invest in their fraudulent scheme.","translation":"その欺瞞者たちは、その魅力と機知を使って、人々を騙して詐欺的な計画に投資させた。","type":"noun","meaning_category":"seducers"}]}