{"word":"Epifaunas","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)底生動物のうち、海底や水中の物体表面に生息する動物群","english_definition":"(plural) Animals living on the surface of a seabed or attached to submerged objects or aquatic plants.","examples":[{"sentence":"The epifaunas of the coral reef are diverse and abundant.","translation":"サンゴ礁の表生動物相は多様で豊富です。"},{"sentence":"Scientists study epifaunas to assess the health of marine ecosystems.","translation":"科学者たちは、海洋生態系の健康状態を評価するために表生動物相を研究します。"},{"sentence":"Changes in water quality can significantly impact the composition of epifaunas.","translation":"水質の変化は、表生動物相の構成に大きな影響を与える可能性があります。"}],"collocations":["coral reef epifaunas (サンゴ礁の表生動物相)","marine epifaunas (海洋表生動物相)","benthic epifaunas (底生表生動物相)","study of epifaunas (表生動物相の研究)","diversity of epifaunas (表生動物相の多様性)","impact on epifaunas (表生動物相への影響)"],"synonyms":["epibenthos","surface fauna","attached fauna"],"antonyms":["infauna (内生動物相)"],"notes":["Epifauna is the plural form; the singular form is epifauna.","Epifaunas are an important part of the marine food web.","Examples of epifaunas include sea stars, barnacles, and sea anemones."]}],"etymology":{"value":"The term 'epifauna' comes from the Greek words 'epi' (meaning 'upon' or 'on') and 'fauna' (meaning 'animal life'). Therefore, 'epifauna' literally means 'animals living on the surface'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈfɔːnəz/","syllables":"ep-i-fau-nas"},"inflection":{"noun_plural":"Epifaunas"},"usage_notes":{"explanation":"'Epifaunas' refers to the community of animals that live on the surface of the seabed, rocks, or other submerged structures. This term is commonly used in marine biology and ecology to describe a specific group of organisms within an ecosystem. It is important to distinguish 'epifaunas' from 'infauna,' which are animals that live within the sediment. The study of epifaunas can provide valuable insights into the health and biodiversity of aquatic environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epifauna are diverse.","correct":"✓ The epifaunas are diverse.","note":"'Epifaunas' is the plural form, so it should be used with a plural verb. The singular form 'epifauna' would be used with a singular verb (e.g., 'The epifauna is diverse')."},{"incorrect":"✗ Epifauna refers to a single animal living on the surface.","correct":"✓ Epifauna refers to a group of animals living on the surface.","note":"'Epifauna' (singular) refers to the entire community or group of animals living on the surface, not a single individual."}],"priority":"★★☆"},"related_words":{"derivatives":["epifaunal (adjective: relating to epifauna)"],"related_terms":["benthos (底生生物)","infauna (内生動物相)","sessile (固着性の)","motile (運動性の)","marine biology (海洋生物学)","ecology (生態学)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Primarily used in scientific and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Epifaunas' is a technical term used in marine biology and ecology to describe the community of animals living on the surface of the seabed or other submerged structures. Understanding this term requires some background knowledge in biology, particularly marine ecosystems. It is typically encountered in scientific literature, research papers, or specialized textbooks related to marine science. The term is important for differentiating between organisms living on the surface (epifaunas) and those living within the sediment (infauna)."},"example_sentences":[{"sentence":"Researchers are studying the impact of pollution on the epifaunas of the bay.","translation":"研究者たちは、湾の表生動物相に対する汚染の影響を研究しています。","type":"general"},{"sentence":"The composition of epifaunas can be used as an indicator of water quality.","translation":"表生動物相の構成は、水質の指標として使用できます。","type":"scientific"},{"sentence":"Different types of substrates support different communities of epifaunas.","translation":"基質のタイプが異なると、異なる表生動物相の群集を支えます。","type":"ecological"}]}