{"word":"concionary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"説教調の、訓戒的な","english_definition":"resembling or characteristic of a sermon; preachy or exhortatory.","examples":[{"sentence":"The novel had a concionary tone, which some readers found off-putting.","translation":"その小説は説教調のトーンで、読者の中にはそれを不快に感じる者もいた。"},{"sentence":"His concionary speeches were aimed at improving the moral character of the community.","translation":"彼の訓戒的な演説は、地域社会の道徳的性格を向上させることを目的としていた。"}],"collocations":["concionary tone","concionary style","concionary speech","concionary writing"],"synonyms":["preachy","moralizing","didactic","exhortatory","homiletic"],"antonyms":["unbiased","impartial","objective"]}],"etymology":{"value":"Derived from 'concio' (Latin for 'assembly, speech, oration'), combined with the suffix '-ary' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnʃənəri/","syllables":"con-cion-a-ry"},"inflection":{"adjective_forms":{"comparative":"more concionary","superlative":"most concionary"}},"usage_notes":{"explanation":"\"Concionary\" is typically used to describe writing or speech that is reminiscent of a sermon, often with a strong moral or didactic purpose. It can sometimes carry a negative connotation, suggesting that the tone is overly preachy or moralizing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The comedian's routine was concionary and hilarious.","correct":"✓ The comedian's routine was hilarious, but not concionary.","note":"Concionary implies a serious, moralizing tone, which is the opposite of humorous or hilarious."}],"priority":"★★☆"},"related_words":{"derivatives":["concionate (verb, to harangue or preach to)","conciation (noun, the act of haranguing)"],"phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Concionary\" is a relatively rare word used to describe something that resembles a sermon or is preachy in nature. It is often used in literary or academic contexts to critique writing or speech that is overly moralizing or didactic. Understanding this word requires a strong vocabulary and an understanding of rhetorical styles."},"example_sentences":[{"sentence":"The author adopted a concionary approach, aiming to instill virtue in his readers.","translation":"著者は訓戒的なアプローチを採用し、読者に徳を植え付けることを目指した。","type":"adjective","meaning_category":"説教調の、訓戒的な"},{"sentence":"While the film had a good message, its concionary delivery felt heavy-handed.","translation":"その映画は良いメッセージを持っていたが、その説教調の伝え方は押しつけがましく感じられた。","type":"adjective","meaning_category":"説教調の、訓戒的な"}]}