{"word":"trackability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"追跡可能性、追跡できること","english_definition":"The ability to be tracked or traced.","examples":[{"sentence":"The trackability of packages has improved significantly with online tracking systems.","translation":"オンライン追跡システムにより、荷物の追跡可能性は大幅に向上しました。"},{"sentence":"Data trackability is crucial for regulatory compliance in the pharmaceutical industry.","translation":"データ追跡可能性は、製薬業界における規制遵守のために非常に重要です。"},{"sentence":"The company is working on improving the trackability of its products throughout the supply chain.","translation":"会社は、サプライチェーン全体における製品の追跡可能性の向上に取り組んでいます。"}],"collocations":["improve trackability (追跡可能性を向上させる)","ensure trackability (追跡可能性を確保する)","data trackability (データ追跡可能性)","product trackability (製品追跡可能性)","supply chain trackability (サプライチェーンの追跡可能性)"],"synonyms":["traceability","monitorability","detectability"],"antonyms":["untraceability","undetectability"]}],"etymology":{"value":"'Track' (追跡する) + '-able' (～できる) + '-ity' (名詞化)","priority":"★★★"},"pronunciation":{"ipa":"/ˌtrækəˈbɪləti/","syllables":"track-a-bil-i-ty"},"inflection":{"noun_plural":"trackabilities (まれに複数形で使用される)"},"usage_notes":{"explanation":"'Trackability' refers to the degree to which something can be followed or monitored. It's often used in contexts where knowing the location or history of an item or piece of data is important. This term is commonly found in discussions about logistics, data management, and regulatory compliance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The trackability is good on this product.","correct":"✓ The trackability of this product is good.","note":"'Trackability' is a noun, so it usually needs a determiner (like 'the') or a possessive pronoun (like 'its') before it when used as a subject or object."},{"incorrect":"✗ We need to trackable the shipment.","correct":"✓ We need to ensure the trackability of the shipment.","note":"'Trackable' is an adjective. To express the need to make something trackable, use a phrase like 'ensure the trackability of' or 'make ... trackable'."}],"priority":"★★☆"},"related_words":{"derivatives":["track (動詞: 追跡する, 名詞: 軌跡)","trackable (形容詞: 追跡可能な)","tracker (名詞: 追跡者, 追跡装置)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trackability' is a relatively advanced term that describes how easily something can be followed or traced. You'll often encounter it in professional settings, particularly when discussing logistics, data management, or compliance. It's about the ability to know where something is or where it has been.","priority":"★★★"},"example_sentences":[{"sentence":"The enhanced trackability of the new system allows for better inventory management.","translation":"強化された追跡可能性により、新しいシステムではより優れた在庫管理が可能になります。","type":"general","meaning_category":"追跡可能性の向上"},{"sentence":"Consumers are increasingly demanding greater trackability of the food they purchase.","translation":"消費者は、購入する食品のより高い追跡可能性をますます要求しています。","type":"general","meaning_category":"消費者の要求"},{"sentence":"Blockchain technology can improve the trackability of goods in international trade.","translation":"ブロックチェーン技術は、国際貿易における商品の追跡可能性を向上させることができます。","type":"technical","meaning_category":"技術的な応用"}]}