{"word":"Flosser","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歯科用)フロス、またはフロスを使う人、またはフロスを使いやすくするための道具","english_definition":"A device or tool designed to aid in flossing teeth, or a person who flosses.","examples":[{"sentence":"She uses a flosser every night to keep her gums healthy.","translation":"彼女は歯茎を健康に保つために毎晩フロッサーを使っています。"},{"sentence":"The dentist recommended an interdental flosser for cleaning between tight teeth.","translation":"歯科医は、歯間が狭い歯の間を掃除するために、歯間フロッサーを勧めました。"},{"sentence":"He is a diligent flosser, which helps prevent cavities.","translation":"彼は熱心なフロッサーであり、それが虫歯予防に役立っています。"}],"collocations":["dental flosser","interdental flosser","electric flosser","water flosser","regular flosser","diligent flosser"],"synonyms":["dental floss","floss stick","interdental brush","water pick"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'to floss,' which comes from the noun 'floss,' referring to the silky thread used for cleaning between teeth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɒsər/","syllables":"Flos-ser"},"inflection":{"noun_plural":"Flossers"},"usage_notes":{"explanation":"The term 'Flosser' can refer to either a person who flosses their teeth regularly or a tool designed to make flossing easier. The context usually makes it clear which meaning is intended. When referring to a tool, it often implies a handle or mechanism to hold the floss, making it easier to reach back teeth or for those with dexterity issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new floss.","correct":"✓ I bought a new flosser. / ✓ I bought new floss.","note":"'Floss' refers to the dental thread itself. 'Flosser' refers to a tool that holds the floss. If you mean the thread, use 'floss'. If you mean the tool, use 'flosser'."},{"incorrect":"✗ He flosses with a flosser.","correct":"✓ He flosses using a flosser.","note":"While technically correct, it's more common to say 'He flosses using a flosser' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["floss (noun, verb)","flossing (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Flosser' is a term related to dental hygiene, referring either to a person who regularly flosses their teeth or to a tool designed to make flossing easier. It is more specific than simply 'floss,' which refers to the thread itself. The term is typically used in contexts related to dental care and hygiene. Understanding the difference between 'floss' and 'flosser' is key to using the term correctly."},"example_sentences":[{"sentence":"Using a water flosser can help remove plaque and food particles from between your teeth.","translation":"ウォーターフロッサーを使うと、歯の間のプラークや食べ物の粒子を取り除くのに役立ちます。","type":"noun","meaning_category":"tool"},{"sentence":"As a dedicated flosser, she rarely has problems with gum disease.","translation":"熱心なフロッサーとして、彼女は歯周病の問題をほとんど抱えていません。","type":"noun","meaning_category":"person"}]}