{"word":"sovralimentazione","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"過給、過給機","english_definition":"Supercharging; forced induction. A system for increasing the power of an internal combustion engine by forcing more air into the cylinders than would normally be drawn in. Also refers to the device used to do this.","examples":[{"sentence":"La sovralimentazione aumenta la potenza del motore.","translation":"Supercharging increases the engine power.","example_context":"General example of the concept."},{"sentence":"Il motore turbo utilizza la sovralimentazione per migliorare le prestazioni.","translation":"The turbo engine uses supercharging to improve performance.","example_context":"Specific example of a turbo engine using supercharging."}],"collocations":["motore sovralimentato (supercharged engine)","sistema di sovralimentazione (supercharging system)","turbocompressore (turbocharger)","compressore volumetrico (supercharger)"],"synonyms":["turbocompressione","alimentazione forzata"],"antonyms":["aspirazione naturale"],"related_words":["turbocompressore","compressore volumetrico","pressione di sovralimentazione"]}],"etymology":{"value":"From 'sovra-' (above, over) + 'alimentazione' (feeding, supply), indicating feeding more air than normal into the engine.","priority":"N/A"},"pronunciation":{"ipa":"/sovralimentaˈtsjone/","syllables":"sov-ra-li-men-ta-zio-ne"},"inflection":{"noun_forms":{"singular":"sovralimentazione","plural":"sovralimentazioni"}},"usage_notes":{"explanation":"'Sovralimentazione' is a technical term primarily used in the context of automotive engineering and mechanics. It refers to the process of increasing the air pressure supplied to an internal combustion engine, allowing for more fuel to be burned and thus increasing power output. It's commonly associated with turbochargers and superchargers.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"La sovralimentazione è un tipo di carburante.","correct":"La sovralimentazione è un sistema per aumentare la potenza del motore.","note":"Sovralimentazione is a system, not a type of fuel."}],"priority":"N/A"},"level_frequency":{"frequency_google_ngram":"Low frequency, technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Sovralimentazione' is a technical term used in automotive engineering. It describes the process of forcing more air into an engine to increase its power. It is usually encountered in discussions about engines, turbochargers, and superchargers. Understanding this term requires some knowledge of mechanics and engine technology."},"example_sentences":[{"sentence":"La sovralimentazione del motore ha migliorato notevolmente l'accelerazione.","translation":"The engine's supercharging significantly improved acceleration.","type":"general","meaning_category":"Engine performance"},{"sentence":"Il meccanico ha controllato il sistema di sovralimentazione per individuare eventuali perdite.","translation":"The mechanic checked the supercharging system for any leaks.","type":"technical","meaning_category":"Maintenance"},{"sentence":"La sovralimentazione è essenziale per le auto da corsa ad alte prestazioni.","translation":"Supercharging is essential for high-performance racing cars.","type":"application","meaning_category":"Automotive engineering"}]}