{"word":"tibiofemoral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脛骨大腿骨の、脛骨と大腿骨に関する","english_definition":"Relating to the tibia and femur, specifically referring to the articulation between these two bones.","examples":[{"sentence":"Tibiofemoral joint kinematics are complex due to the shape of the bones and ligaments.","translation":"脛骨大腿関節の運動学は、骨と靭帯の形状のために複雑である。"},{"sentence":"The tibiofemoral angle is an important measurement in assessing knee alignment.","translation":"脛骨大腿角は、膝のアライメントを評価する上で重要な測定値である。"}],"collocations":["tibiofemoral joint","tibiofemoral angle","tibiofemoral kinematics"],"synonyms":["knee joint","femorotibial"],"antonyms":[]}],"etymology":{"value":"Derived from 'tibia' (shinbone) and 'femur' (thighbone), combining the two terms to describe something relating to both bones.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɪbi.oʊˈfɛmərəl/","syllables":"tib-i-o-fem-or-al"},"inflection":{},"usage_notes":{"explanation":"'Tibiofemoral' is a term used primarily in medical and anatomical contexts to describe structures, conditions, or measurements related to the articulation between the tibia (shinbone) and the femur (thighbone) at the knee joint. It is commonly used in discussions of knee biomechanics, injuries, and surgical procedures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ tibio-femoral","correct":"✓ tibiofemoral","note":"The term is usually written as one word without a hyphen."}],"priority":"★★☆"},"related_words":{"derivatives":["tibia","femur","tibial","femoral"],"related_terms":["knee joint","meniscus","ACL (anterior cruciate ligament)","PCL (posterior cruciate ligament)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized medical and anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tibiofemoral' is a specialized anatomical term used in medical and scientific contexts. It refers to the articulation between the tibia (shinbone) and femur (thighbone) at the knee joint. Understanding this term requires knowledge of basic anatomy and is typically encountered in medical literature or discussions related to knee biomechanics and pathology."},"example_sentences":[{"sentence":"Osteoarthritis can affect the tibiofemoral compartment of the knee.","translation":"変形性関節症は膝の脛骨大腿コンパートメントに影響を与える可能性がある。","type":"general","meaning_category":"anatomy"},{"sentence":"The tibiofemoral joint is stabilized by ligaments and muscles.","translation":"脛骨大腿関節は靭帯と筋肉によって安定化されている。","type":"general","meaning_category":"anatomy"}]}