{"word":"non-scanned","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not scanned; not having been subjected to a scanning process.","english_definition":"Describing something that has not been scanned, typically referring to documents, images, or other media that have not been converted into a digital format using a scanner.","examples":[{"sentence":"The original documents were kept in a filing cabinet, non-scanned and untouched.","translation":"オリジナルの書類は、スキャンされずに、手付かずのままファイリングキャビネットに保管されていました。"},{"sentence":"We need to determine which files are non-scanned and prioritize them for digitization.","translation":"どのファイルがスキャンされていないかを特定し、デジタル化の優先順位を付ける必要があります。"},{"sentence":"The archive contained both scanned and non-scanned photographs.","translation":"アーカイブには、スキャンされた写真とスキャンされていない写真の両方が含まれていました。"}],"collocations":["non-scanned document","non-scanned image","non-scanned file","non-scanned data"],"synonyms":["unscanned","not digitized"],"antonyms":["scanned","digitized"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the past participle 'scanned' of the verb 'scan'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˈskænd/","syllables":"non-scanned"},"inflection":{"notes":"As an adjective, it does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Non-scanned' is a descriptive adjective used to indicate that something has not undergone a scanning process, typically to convert it into a digital format. It is commonly used in contexts involving document management, archiving, and data processing. The term is straightforward and generally understood in technical or administrative settings.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The non scanned document was hard to read.","correct":"✓ The non-scanned document was hard to read.","note":"Hyphenate 'non-scanned' when used as a compound adjective before a noun."},{"incorrect":"✗ We have many non scanned documents.","correct":"✓ We have many non-scanned documents.","note":"The term is already an adjective, so no need to add -ed to the end."}],"priority":"Low"},"related_words":{"derivatives":["scan","scanner","scanning"],"phrasal_verbs":[],"related_terms":["digitization","archiving","document management"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"The term 'non-scanned' is relatively straightforward. It simply means that something has not been scanned. The term is most likely to be encountered in professional contexts dealing with document management or digitization projects. Understanding requires familiarity with the concept of scanning documents or images into digital formats."},"example_sentences":[{"sentence":"All non-scanned paper records must be kept for seven years.","translation":"スキャンされていない紙の記録はすべて7年間保管する必要があります。","type":"general","meaning_category":"not scanned"},{"sentence":"The library is undertaking a project to digitize all of its non-scanned materials.","translation":"図書館は、スキャンされていない資料をすべてデジタル化するプロジェクトに着手しています。","type":"general","meaning_category":"not scanned"},{"sentence":"The auditor requested access to the non-scanned invoices for verification.","translation":"監査人は、検証のためにスキャンされていない請求書へのアクセスを要求しました。","type":"specific","meaning_category":"not scanned"}]}