{"word":"lean-burning","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"希薄燃焼の、リーンバーンの","english_definition":"(of an internal combustion engine) designed to operate with a lean air-fuel mixture (i.e., with a higher proportion of air than is needed for stoichiometric combustion).","examples":[{"sentence":"The new engine is a lean-burning design, which improves fuel efficiency.","translation":"その新しいエンジンは希薄燃焼設計で、燃料効率を向上させる。"},{"sentence":"Lean-burning engines can reduce emissions of certain pollutants.","translation":"希薄燃焼エンジンは特定の汚染物質の排出を削減できる。"}],"collocations":["lean-burning engine","lean-burning technology","lean-burning system"],"synonyms":["fuel-efficient","low-emission"],"antonyms":["rich-burning"],"notes":"Lean-burning engines are designed to use less fuel by burning a mixture with more air than is theoretically required for complete combustion. This can improve fuel economy but may also increase emissions of nitrogen oxides (NOx) under certain conditions.","technical_field":"Automotive engineering, combustion engineering"}],"etymology":{"value":"Combination of \"lean\" (referring to a low fuel-to-air ratio) and \"burning\" (the combustion process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːnˌbɜːrnɪŋ/","syllables":"lean-burn-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"related_words":{"related_terms":["stoichiometric combustion","air-fuel ratio","fuel efficiency","emissions control","internal combustion engine"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lean-burning' is a technical term used in the context of internal combustion engines. It describes engines that operate with a higher air-to-fuel ratio than conventional engines, resulting in more efficient fuel consumption. Understanding this term requires some knowledge of automotive engineering and combustion processes."},"example_sentences":[{"sentence":"The manufacturer claims that the lean-burning engine achieves 50 miles per gallon.","translation":"製造業者は、その希薄燃焼エンジンが1ガロンあたり50マイルを達成すると主張している。","type":"adjective","meaning_category":"希薄燃焼の"},{"sentence":"Regulations are pushing automakers to develop more lean-burning technologies.","translation":"規制により、自動車メーカーはより多くの希薄燃焼技術を開発するようになっている。","type":"adjective","meaning_category":"希薄燃焼の"}]}