{"word":"half-normally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半分正常に、部分的に正常に","english_definition":"In a manner that is partially normal or to a degree that is approximately half of what is considered normal.","examples":[{"sentence":"The machine was running half-normally after the repairs, so we scheduled another service appointment.","translation":"修理後、機械は半分正常にしか動いていなかったので、再度サービスを予約しました。"},{"sentence":"He was behaving half-normally, showing signs of both lucidity and confusion.","translation":"彼は半分正常な行動をしており、明晰さと混乱の両方の兆候を示していました。"}],"collocations":["functioning half-normally","behaving half-normally","operating half-normally"],"synonyms":["partially normally","semi-normally","abnormally","irregularly"],"antonyms":["normally","fully normally","completely normally"]}],"etymology":{"value":"The word is formed by combining 'half' (meaning one of two equal parts) with 'normally' (meaning in a normal manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæfˈnɔːrməli/","syllables":"half-nor-mal-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"'Half-normally' is used to describe situations or behaviors that are only partially or incompletely normal. It suggests a deviation from the standard or expected state, but not a complete departure from it. The term is relatively uncommon and may sound somewhat awkward in certain contexts, but it can be useful for precisely describing a state that is neither fully normal nor entirely abnormal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is half normally working.","correct":"✓ The system is working half-normally.","note":"Adverbs typically modify verbs, adjectives, or other adverbs. In this case, 'half-normally' modifies 'working,' so it should be placed accordingly."},{"incorrect":"✗ He is half-normal.","correct":"✓ He is behaving half-normally.","note":"'Half-normal' as an adjective is less common and might be misunderstood. Using 'behaving half-normally' as an adverbial phrase is clearer."}],"priority":"★☆☆"},"related_words":{"derivatives":["half","normally"],"phrasal_verbs":[],"related_adverbs":["partially","somewhat","moderately","slightly"],"related_adjectives":["normal","abnormal","irregular"]},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR materials)","frequency_google_ngram":"Low frequency (rarely used)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Half-normally' is a relatively uncommon adverb used to describe something that is only partially or incompletely normal. It is formed by combining 'half' and 'normally'. Because it is not a common term, it is best used in contexts where precision is important and the reader is likely to understand the intended meaning. It is more frequently used in technical or descriptive contexts rather than casual conversation."},"example_sentences":[{"sentence":"After the software update, the application was running half-normally, with some features working and others not.","translation":"ソフトウェアのアップデート後、アプリケーションは一部の機能が動作し、他の機能が動作しないため、半分正常にしか実行されていませんでした。","type":"adverb","meaning_category":"partially normal operation"},{"sentence":"The patient was reacting half-normally to the medication, showing some improvement but still experiencing side effects.","translation":"患者は薬に半分正常に反応しており、いくらかの改善が見られるものの、依然として副作用を経験しています。","type":"adverb","meaning_category":"partially normal reaction"}]}