{"word":"domesticability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"飼い慣らしやすさ、家畜化の可能性","english_definition":"The capacity of an animal or plant species to be domesticated; the degree to which a species can be tamed and adapted to living in close association with humans.","examples":[{"sentence":"The high domesticability of dogs has made them invaluable companions to humans.","translation":"犬の高い飼い慣らしやすさは、人間にとってかけがえのない仲間となっています。"},{"sentence":"Scientists study the genetic factors that influence the domesticability of different animal species.","translation":"科学者たちは、さまざまな動物種の飼い慣らしやすさに影響を与える遺伝的要因を研究しています。"},{"sentence":"Selective breeding can enhance the domesticability of certain livestock breeds.","translation":"選択的育種は、特定の家畜品種の飼い慣らしやすさを高めることができます。"},{"sentence":"The domesticability of a plant species is crucial for its cultivation as a crop.","translation":"植物種の飼い慣らしやすさは、作物としての栽培にとって非常に重要です。"}],"collocations":["high domesticability","low domesticability","genetic domesticability","assess domesticability","influence domesticability","enhance domesticability"],"synonyms":["tameability","trainability","adaptability","amenability","manageability"],"antonyms":["wildness","untameability","ferocity","unmanageability"]}],"etymology":{"value":"Formed from 'domesticable' (capable of being domesticated) + '-ity' (a suffix denoting a state or quality). 'Domesticable' comes from 'domesticate' + '-able'. 'Domesticate' is derived from the Latin 'domesticus' (belonging to the house, domestic).","priority":"★★☆"},"pronunciation":{"ipa":"/dəˌmɛstɪkəˈbɪlɪti/","syllables":"do-mes-ti-ca-bi-li-ty"},"inflection":{"noun_plural":"domesticabilities (rarely used)"},"usage_notes":{"explanation":"'Domesticability' refers specifically to the inherent potential of a species to be successfully domesticated, which involves more than just taming individual animals. It encompasses factors like genetics, behavior, and adaptability to human environments and management. It is often used in scientific or agricultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The domesticability of this animal is very high, so it is already a pet.","correct":"✓ The domesticability of this animal is very high, making it a good candidate to become a pet.","note":"High domesticability means that the animal *can* be domesticated, not that it *is* already domesticated. It suggests potential, not a current state."},{"incorrect":"✗ Domesticability is only about how friendly an animal is.","correct":"✓ Domesticability involves many factors, including temperament, breeding habits, and adaptability to human environments.","note":"Domesticability is a complex trait that includes more than just friendliness. It involves various behavioral and genetic factors."}],"priority":"★★☆"},"related_words":{"derivatives":["domesticable","domesticate","domestication","domesticated","domestic"],"related_concepts":["artificial selection","selective breeding","animal husbandry","crop cultivation","evolutionary biology","behavioral ecology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Domesticability' is a relatively uncommon word that describes how easily a species of animal or plant can be domesticated. It's often used in scientific discussions about agriculture, animal behavior, and genetics. Understanding this word requires a good grasp of the concept of domestication itself, which involves adapting a wild species to live closely with humans through selective breeding and management.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers investigated the domesticability of various wild grasses for potential use as new crops.","translation":"研究者たちは、新たな作物としての利用の可能性を求めて、さまざまな野生イネ科植物の飼い慣らしやすさを調査しました。","type":"general","meaning_category":"飼い慣らしやすさ"},{"sentence":"Selective breeding has significantly improved the domesticability of chickens over the centuries.","translation":"選択的育種は、何世紀にもわたってニワトリの飼い慣らしやすさを大幅に向上させてきました。","type":"general","meaning_category":"飼い慣らしやすさ"},{"sentence":"One factor affecting the domesticability of zebras is their highly reactive temperament.","translation":"シマウマの飼い慣らしやすさに影響を与える要因の1つは、その非常に反応的な気質です。","type":"general","meaning_category":"飼い慣らしやすさ"}]}