{"word":"Sharpies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) A brand of permanent marker pens.","english_definition":"(plural only) Permanent marker pens manufactured by Sharpie.","examples":[{"sentence":"I need to buy some Sharpies for my art project.","translation":"美術のプロジェクトのために、シャープペンをいくつか買わなければならない。"},{"sentence":"The artist used Sharpies to create the intricate design.","translation":"そのアーティストは、複雑なデザインを作成するためにシャープペンを使った。"}],"collocations":["Sharpie marker","Sharpie pen","Fine point Sharpie","Ultra fine point Sharpie"],"synonyms":["permanent marker","marker pen"],"antonyms":[]}],"etymology":{"value":"Derived from the brand name 'Sharpie', which was originally a brand of permanent markers introduced in 1964.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃɑːrpiz/","syllables":"Shar-pies"},"inflection":{"noun_plural":"Sharpies"},"usage_notes":{"explanation":"'Sharpies' is primarily used as a plural noun referring to multiple pens of the Sharpie brand. While 'Sharpie' can be used as a singular noun to refer to one pen, 'Sharpies' is more common when discussing or needing more than one. It is often used generically to refer to any permanent marker, similar to how 'Kleenex' is used for tissues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I need a sharpie.","correct":"I need a Sharpie.","note":"When referring to the brand, capitalize the first letter."},{"incorrect":"I need a sharpies.","correct":"I need some Sharpies.","note":"When referring to more than one, use the plural form 'Sharpies'."}],"priority":"★★☆"},"related_words":{"derivatives":["Sharpie (singular noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in contexts related to art, crafts, and office supplies.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Sharpies' refers to a specific brand of permanent marker pens. It's a plural noun, so it's used when talking about more than one pen. People often use the term 'Sharpies' to refer to any permanent marker, even if it's not the Sharpie brand. It's commonly used in art, crafts, and office settings.","priority":"★★☆"},"example_sentences":[{"sentence":"She used different colored Sharpies to decorate the poster.","translation":"彼女はポスターを飾るために、さまざまな色のシャープペンを使った。","type":"noun","meaning_category":"permanent marker pens"},{"sentence":"Do you have any Sharpies I can borrow?","translation":"何か借りられるシャープペンを持っていますか？","type":"noun","meaning_category":"permanent marker pens"},{"sentence":"He always carries a set of Sharpies in his backpack.","translation":"彼はいつもバックパックにシャープペンのセットを持ち歩いている。","type":"noun","meaning_category":"permanent marker pens"}]}