{"word":"assertive-gazed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(人や視線が)自信に満ちた、主張的な視線を送る","english_definition":"Having or characterized by a confident and forceful gaze; expressing a strong and confident personality through one's gaze.","examples":[{"sentence":"The CEO's assertive-gazed demeanor commanded respect in the boardroom.","translation":"CEOの自信に満ちた視線は、役員会議室で尊敬を集めた。"},{"sentence":"With an assertive-gazed expression, she made her point during the debate.","translation":"自信に満ちた視線で、彼女は討論中に自分の意見を述べた。"},{"sentence":"The model's assertive-gazed pose conveyed power and self-assurance.","translation":"モデルの自信に満ちた視線は、力強さと自信を伝えた。"}],"collocations":["assertive-gazed demeanor (自信に満ちた態度)","assertive-gazed expression (自信に満ちた表情)","assertive-gazed look (自信に満ちた視線)","assertive gaze (自信に満ちた視線)"],"synonyms":["confident","self-assured","forceful","determined","bold","direct","unflinching"],"antonyms":["timid","hesitant","submissive","meek","shy","avoidant","passive"],"notes":"This word is a compound adjective, combining 'assertive' (confident and forceful) with 'gazed' (having a specific type of gaze). It describes someone whose gaze reflects their assertive personality."}],"etymology":{"value":"Combination of 'assertive' (from assert, meaning to state a fact or belief confidently and forcefully) and 'gazed' (past participle of gaze, meaning to look steadily and intently).","priority":"Low"},"pronunciation":{"ipa":"/əˈsɜːrtɪv ɡeɪzd/","syllables":"as-ser-tive-gazed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have typical verb conjugations or plural forms."},"usage_notes":{"explanation":"'Assertive-gazed' is used to describe someone whose gaze is confident, direct, and conveys a sense of self-assurance. It's often used in contexts where the person's gaze is a significant part of their communication or presence.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He assertive gazed at her.","correct":"He had an assertive-gazed look.","note":"'Assertive-gazed' is an adjective, so it modifies a noun. It cannot be used as a verb."}],"priority":"Low"},"related_words":{"derivatives":["assertive (adjective)","assertively (adverb)","assertiveness (noun)","gaze (verb/noun)","gazing (adjective)"],"phrases":["assertive communication","confident gaze","direct eye contact"]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Assertive-gazed' is a relatively uncommon and sophisticated adjective. It combines the concept of being 'assertive' (confident and forceful) with the act of 'gazing' (looking steadily). The word suggests that someone's gaze is not just a passive act of looking, but rather an active expression of their assertive personality. Understanding this word requires a good grasp of both 'assertive' and 'gaze' and the ability to combine their meanings. It is more likely to be found in descriptive writing or character analysis."},"example_sentences":[{"sentence":"Her assertive-gazed stare made him uncomfortable.","translation":"彼女の自信に満ちた視線は彼を不快にさせた。","type":"adjective","meaning_category":"自信に満ちた視線"},{"sentence":"The politician's assertive-gazed presence projected an image of strength.","translation":"政治家の自信に満ちた視線は、力強さのイメージを投影した。","type":"adjective","meaning_category":"自信に満ちた態度"},{"sentence":"Even from a distance, one could sense her assertive-gazed determination.","translation":"遠くからでも、彼女の自信に満ちた決意を感じ取ることができた。","type":"adjective","meaning_category":"自信に満ちた決意"}]}