{"word":"Photomorphosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"光形態形成：光の質、量、および方向によって引き起こされる植物の成長および発達の変化","english_definition":"The development of plant form and structure that is affected by light quality, quantity, and direction.","examples":[{"sentence":"Photomorphosis allows plants to optimize their growth in response to available light.","translation":"光形態形成により、植物は利用可能な光に応じて成長を最適化できます。"},{"sentence":"The study of photomorphosis helps us understand how plants adapt to different light environments.","translation":"光形態形成の研究は、植物が異なる光環境にどのように適応するかを理解するのに役立ちます。"}],"collocations":["light-mediated photomorphosis","phytochrome-mediated photomorphosis","photomorphosis in seedlings","etiolated growth vs. photomorphosis"],"synonyms":["light-regulated development","light-dependent morphogenesis"],"antonyms":["etiolation"]}],"etymology":{"value":"Derived from the Greek words 'photo' (light), 'morph' (form), and 'osis' (process or condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfoʊtoʊmɔːrˈfoʊsɪs/","syllables":"pho-to-mor-pho-sis"},"inflection":{"noun_plural":"photomorphoses"},"usage_notes":{"explanation":"Photomorphosis is a biological process crucial for plant adaptation and survival. It involves changes in plant growth patterns, such as stem elongation, leaf expansion, and chlorophyll production, in response to light signals. This process is mediated by photoreceptors like phytochromes, cryptochromes, and phototropins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Photomorphosis is the same as photosynthesis.","correct":"✓ Photomorphosis is different from photosynthesis; it's about plant development in response to light, not energy production.","note":"Photomorphosis is about the developmental effects of light, while photosynthesis is about converting light energy into chemical energy."}],"priority":"★☆☆"},"related_words":{"derivatives":["photomorphogenic (adjective)"],"related_terms":["phytochrome","cryptochrome","phototropin","etiolation","photoperiodism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Photomorphosis is a complex term referring to the light-regulated development of plants. It involves various physiological and morphological changes in response to light signals, mediated by photoreceptors. Understanding this term requires a background in plant biology and photobiology."},"example_sentences":[{"sentence":"The seedling underwent significant photomorphosis upon exposure to red light.","translation":"その苗は、赤色光にさらされると、顕著な光形態形成を起こした。","type":"scientific","meaning_category":"plant development"},{"sentence":"Researchers are studying the genetic basis of photomorphosis in Arabidopsis.","translation":"研究者たちは、シロイヌナズナにおける光形態形成の遺伝的基盤を研究している。","type":"scientific","meaning_category":"plant genetics"}]}