{"word":"non-emulsifying","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"乳化しない、非乳化性の","english_definition":"Not capable of forming an emulsion; not causing emulsification.","examples":[{"sentence":"This is a non-emulsifying oil, so it will separate from water.","translation":"これは非乳化性のオイルなので、水と分離します。"},{"sentence":"Use a non-emulsifying cleaner for this type of surface.","translation":"このタイプの表面には、非乳化性のクリーナーを使用してください。"}],"collocations":["non-emulsifying oil","non-emulsifying cleaner","non-emulsifying wax"],"synonyms":["non-mixing","non-soluble"],"antonyms":["emulsifying"],"related_terms":["emulsion","emulsifier","emulsify"]}],"etymology":{"value":"Prefix 'non-' (not) + 'emulsifying' (causing or forming an emulsion).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnɪˈmʌlsɪfaɪɪŋ/","syllables":"non-e-mul-si-fy-ing"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Non-emulsifying' describes a substance that does not readily form an emulsion when mixed with another substance (typically water). Emulsions are mixtures of two or more liquids that are normally immiscible (unmixable or unblendable).","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The emulsifying oil separated from the water.","correct":"The non-emulsifying oil separated from the water.","note":"Emulsifying oils will form an emulsion, whereas non-emulsifying oils will separate."}],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Non-emulsifying' is a technical term primarily used in chemistry, cosmetics, and food science. It describes something that does not create a stable mixture of two liquids that usually don't mix, like oil and water. Understanding this term requires some familiarity with scientific concepts related to emulsions and mixtures."},"example_sentences":[{"sentence":"The recipe calls for a non-emulsifying shortening to achieve a flaky crust.","translation":"そのレシピでは、サクサクの皮を作るために非乳化性のショートニングが必要です。","type":"adjective","meaning_category":"property"},{"sentence":"This type of paint uses a non-emulsifying agent to prevent streaking.","translation":"このタイプの塗料は、筋を防ぐために非乳化剤を使用しています。","type":"adjective","meaning_category":"composition"}]}