{"word":"theodolite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"セオドライト（測量器械）","english_definition":"A precision instrument for measuring angles in the horizontal and vertical planes, used in surveying and other scientific applications.","examples":[{"sentence":"The surveyor used a theodolite to measure the angles of the land.","translation":"測量技師はセオドライトを使って土地の角度を測量した。"},{"sentence":"The theodolite is an essential tool for accurate surveying.","translation":"セオドライトは正確な測量に不可欠な道具である。"}],"collocations":["use a theodolite","operate a theodolite","digital theodolite","surveying with a theodolite"],"synonyms":["surveying instrument","transit","level"],"antonyms":[]}],"etymology":{"value":"Derived from Neo-Latin 'theodolitus', of obscure origin. Possibly from Greek 'thea' (view) + 'dolichos' (long), or a combination of Arabic and Greek roots.","priority":"★★☆"},"pronunciation":{"ipa":"/θiˈɒdəlaɪt/","syllables":"the-od-o-lite"},"inflection":{"noun_plural":"theodolites"},"usage_notes":{"explanation":"A theodolite is a specialized surveying instrument used to measure angles with high precision. It is primarily used by surveyors, engineers, and scientists for mapping, construction, and other applications requiring accurate angular measurements. Modern theodolites are often digital, providing electronic readouts and data storage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a theodolite to measure the distance.","correct":"✓ I used a theodolite to measure the angles.","note":"Theodolites measure angles, not distances. Distances are measured with other tools like measuring tapes or laser rangefinders."},{"incorrect":"✗ The theodolite is a simple tool.","correct":"✓ The theodolite is a precision instrument.","note":"Theodolites are complex and precise instruments, not simple tools."}],"priority":"★★☆"},"related_words":{"derivatives":["theodolitic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'theodolite' refers to a specialized instrument used in surveying to measure angles. It is a technical term primarily encountered in contexts related to surveying, engineering, and construction. Understanding the term requires familiarity with these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The construction crew relied on the theodolite for precise measurements.","translation":"建設作業員たちは正確な測定のためにセオドライトに頼った。","type":"noun","meaning_category":"測量器械"},{"sentence":"The surveyor set up the theodolite on the tripod.","translation":"測量技師は三脚にセオドライトを設置した。","type":"noun","meaning_category":"測量器械"},{"sentence":"Digital theodolites offer increased accuracy and efficiency.","translation":"デジタルセオドライトは、精度と効率を向上させる。","type":"noun","meaning_category":"測量器械"}]}