{"word":"play-pretty","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"おもちゃ、装飾品、愛玩物","english_definition":"A toy, trinket, or object of amusement; something attractive but of little practical value.","examples":[{"sentence":"The child was fascinated by the play-pretty.","translation":"子供はそのおもちゃに夢中になった。"},{"sentence":"She considered the expensive necklace a mere play-pretty.","translation":"彼女はその高価なネックレスを単なる装飾品だと考えた。"}],"collocations":["mere play-pretty","shiny play-pretty"],"synonyms":["toy","trinket","bauble","gewgaw","knick-knack","toy","ornament","decoration"],"antonyms":["tool","implement","necessity","utility"]},{"part_of_speech":"adjective","definition":"装飾的な、遊び心のある、実用性のない","english_definition":"Decorative or ornamental; intended for amusement rather than practical use.","examples":[{"sentence":"The room was filled with play-pretty decorations.","translation":"部屋は装飾的な飾りでいっぱいだった。"},{"sentence":"He dismissed the idea as a play-pretty scheme.","translation":"彼はそのアイデアを実用性のない計画として却下した。"}],"collocations":["play-pretty decorations","play-pretty scheme"],"synonyms":["decorative","ornamental","frivolous","nonessential","whimsical","fancy"],"antonyms":["functional","practical","essential","utilitarian"]}],"etymology":{"value":"The term combines \"play\" (referring to amusement or recreation) and \"pretty\" (referring to attractiveness or ornamentation). It suggests something that is pleasing to look at or play with, but lacks substantial value or purpose.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpleɪˌprɪti/","syllables":"play-pret-ty"},"inflection":{"noun_plural":"play-pretties","notes":"The word can function as both a noun and an adjective, with the noun form having a plural."},"usage_notes":{"explanation":"\"**Play-pretty**\" is used to describe something that is attractive or amusing, but lacks real substance or utility. As a noun, it refers to a toy, trinket, or decorative item. As an adjective, it describes something that is primarily ornamental or intended for amusement, rather than practical use. The term often carries a slightly negative connotation, suggesting that the object or idea is frivolous or unimportant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The play-pretty was very usefully.","correct":"✓ The play-pretty was very pretty.","note":"The term 'play-pretty' implies lack of utility, so describing it as 'useful' is contradictory. Use 'pretty' or 'attractive' instead."},{"incorrect":"✗ She used the play-pretty for fixing the car.","correct":"✓ She admired the play-pretty on the shelf.","note":"'Play-pretty' is not meant for practical tasks like fixing a car. It's an ornamental item."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["toy","trinket","ornament","decoration","amusement","frivolity"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The term is relatively uncommon in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**play-pretty**\" describes something that is attractive or amusing but lacks real value or practical use. It can be a noun, referring to a toy or trinket, or an adjective, describing something decorative. Because it is not a common word, understanding its meaning requires a good vocabulary and attention to context. It often implies a slightly negative view, suggesting that something is frivolous or unimportant."},"example_sentences":[{"sentence":"The child's room was filled with colorful play-pretties.","translation":"子供部屋はおもちゃでいっぱいだった。","type":"noun","meaning_category":"おもちゃ"},{"sentence":"She dismissed his proposal as a play-pretty idea.","translation":"彼女は彼の提案を実用性のないアイデアとして却下した。","type":"adjective","meaning_category":"装飾的な"},{"sentence":"The antique shop was full of interesting play-pretties.","translation":"その骨董品店は面白い装飾品でいっぱいだった。","type":"noun","meaning_category":"装飾品"},{"sentence":"He bought her a play-pretty necklace for her birthday.","translation":"彼は彼女の誕生日に装飾的なネックレスを買った。","type":"adjective","meaning_category":"装飾的な"}]}