{"word":"karst","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カルスト地形","english_definition":"a landscape underlain by limestone that has been eroded by dissolution, producing ridges, towers, sinkholes, caves, and other characteristic features.","examples":[{"sentence":"The region is known for its dramatic karst topography.","translation":"その地域は劇的なカルスト地形として知られています。"},{"sentence":"Many caves are found in karst landscapes.","translation":"多くの洞窟がカルスト地形に見られます。"},{"sentence":"The water flows through underground channels in the karst.","translation":"水はカルストの地下水路を通って流れます。"}],"collocations":["karst topography","karst landscape","karst region","karst features","karst aquifer"],"synonyms":["limestone landscape"],"antonyms":[]}],"etymology":{"value":"The word 'karst' comes from the German name Karst for the Kras plateau, a limestone region in Slovenia and Italy. The name Kras is believed to be derived from a pre-Indo-European word meaning 'rock'.","priority":"★★★"},"pronunciation":{"ipa":"/kɑːrst/","syllables":"1"},"inflection":{"notes":"The plural form is 'karsts'."},"usage_notes":{"explanation":"'Karst' refers specifically to a type of landscape formed by the dissolution of soluble rocks, especially limestone. It is characterized by underground drainage systems with sinkholes and caves. The term is both a noun (referring to the landscape) and an adjective (describing features related to the landscape, e.g., 'karst features').","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The desert was karst.","correct":"✓ The landscape was karst.","note":"'Karst' specifically refers to limestone landscapes eroded by dissolution, not deserts or other types of landscapes."}],"priority":"★★☆"},"related_words":{"derivatives":["karstic (adjective: relating to or consisting of karst)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Karst' is a specialized term used in geography and geology to describe a specific type of landscape formed by the dissolution of soluble rocks such as limestone. Understanding this term requires familiarity with geological processes and landform terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The **karst** landscape is characterized by sinkholes and underground streams.","translation":"カルスト地形は、陥没穴と地下河川によって特徴づけられます。","type":"noun","meaning_category":"カルスト地形"},{"sentence":"The **karst** region is facing challenges due to water pollution.","translation":"そのカルスト地域は水質汚染による課題に直面しています。","type":"adjective (implied)","meaning_category":"カルスト地形"}]}