{"word":"Pandybat","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Welsh English) A thick, often homemade, bat or stick, used for hitting a ball in informal games or as a weapon.","english_definition":"(Welsh English) A thick, often homemade, bat or stick, used for hitting a ball in informal games or as a weapon.","examples":[{"sentence":"The children were playing cricket with a Pandybat in the park.","translation":"子供たちは公園でパンディバットを使ってクリケットをしていた。"},{"sentence":"He defended himself with a Pandybat when confronted by the intruder.","translation":"彼は侵入者に遭遇した際、パンディバットで身を守った。"}],"collocations":["play with a Pandybat","swing a Pandybat","homemade Pandybat"],"synonyms":["bat","stick","club","cudgel"],"antonyms":[]}],"etymology":{"value":"Likely derived from the village of Pandy in Wales, where such bats were commonly made or used. The 'bat' part is a direct reference to the bat used in sports.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpændiˌbæt/","syllables":"Pan-dy-bat"},"inflection":{"noun_plural":"Pandybats"},"usage_notes":{"explanation":"'Pandybat' is a term primarily used in Wales, particularly in South Wales, to describe a specific type of bat or stick. It's often associated with informal games and can sometimes imply a makeshift or homemade quality. While primarily used for sports, it can also refer to a weapon.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a Pandybat at the sporting goods store.","correct":"✓ I made a Pandybat myself.","note":"Pandybats are often homemade, so buying one in a store might sound unusual."},{"incorrect":"✗ He used the Pandybat to play baseball.","correct":"✓ He used the Pandybat to play cricket.","note":"While it can be used for various games, it's often associated with cricket in Wales."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, regional term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Pandybat' is a regional term specific to Wales. It refers to a thick, often homemade, bat or stick used in informal games, particularly cricket. Understanding this word requires familiarity with Welsh English and its cultural context. It is not a commonly used word outside of Wales. The term can also refer to a weapon, depending on the context.","note":"This word is not commonly known outside of Wales."},"example_sentences":[{"sentence":"The boys fashioned a Pandybat from a piece of driftwood they found on the beach.","translation":"少年たちは海岸で見つけた流木からパンディバットを作った。","type":"noun","meaning_category":"homemade bat"},{"sentence":"He kept a Pandybat behind the door for protection.","translation":"彼は用心のためにドアの後ろにパンディバットを置いていた。","type":"noun","meaning_category":"weapon"},{"sentence":"We used to play cricket in the street with a tennis ball and a Pandybat.","translation":"私たちはよくテニスボールとパンディバットを使って通りでクリケットをしたものだ。","type":"noun","meaning_category":"sports equipment"}]}