{"word":"banquetings","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"banqueting の複数形または動名詞","english_definition":"plural of banqueting or gerund of banquet.","examples":[{"sentence":"The banquetings were elaborate affairs, lasting for several hours.","translation":"宴会は数時間続く手の込んだものでした。"},{"sentence":"The constant banquetings were taking a toll on his health.","translation":"絶え間ない宴会は彼の健康をむしばんでいた。"}],"collocations":null,"synonyms":null,"antonyms":null}],"etymology":{"value":"Derived from 'banquet', with the addition of '-ing' to form a gerund or present participle, and then pluralized.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈbæŋkwɪtɪŋz/","syllables":"ban-quet-ings"},"inflection":{"noun_plural":"banquetings"},"usage_notes":{"explanation":"'Banqueting' itself is more commonly used as a noun referring to the act of holding or attending banquets, or as an adjective describing facilities or services related to banquets. 'Banqueting' can also be a gerund. 'Banqueting' used as a gerund or present participle can be pluralized to 'banquetings', referring to multiple instances or occurrences of banqueting.","priority":"☆☆☆"},"common_mistakes":null,"related_words":{"derivatives":["banquet","banqueting"],"phrasal_verbs":null,"priority":"☆☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Banqueting' is a relatively uncommon word, and its plural form 'banquetings' is even less frequent. It refers to multiple instances of holding or attending banquets, which are formal and elaborate meals for a large number of people. Understanding this word requires a good grasp of vocabulary related to formal events and social gatherings."},"example_sentences":[{"sentence":"The historical records detail the lavish banquetings of the royal court.","translation":"歴史的記録は、王室の豪華な宴会について詳しく述べています。","type":"noun","meaning_category":"plural form of banqueting"},{"sentence":"The endless banquetings and celebrations exhausted the visiting dignitaries.","translation":"終わりのない宴会や祝賀会は、訪問中の高官たちを疲れさせた。","type":"noun","meaning_category":"plural form of banqueting"}]}