{"word":"Pattee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A cross with arms narrow at the centre and expanding outward, each arm having a curved outer edge.","english_definition":"A type of cross with arms that are narrow at the center and widen towards the ends, often with curved or straight edges.","examples":[{"sentence":"The Iron Cross is a well-known example of a cross pattee.","translation":"鉄十字章は、クロス・パティーのよく知られた例です。"}],"collocations":["cross pattee","iron cross"],"synonyms":["cross","Maltese cross"],"antonyms":[]}],"etymology":{"value":"From the French 'patte', meaning 'foot'. The term suggests the flared arms of the cross resemble feet or paws.","priority":"★★☆"},"pronunciation":{"ipa":"/pæˈteɪ/","syllables":"Pat-tee"},"inflection":{"noun_plural":"pattees"},"usage_notes":{"explanation":"The term 'pattee' is primarily used in heraldry and vexillology (the study of flags) to describe a specific type of cross. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a pattee on his shirt as a fashion statement.","correct":"✓ He wore a cross pattee on his shirt as a fashion statement.","note":"It's better to specify 'cross pattee' to avoid confusion, as 'pattee' alone is not widely understood."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["heraldry","vexillology","cross","Maltese cross","Iron Cross"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pattee' is a specialized term primarily used in heraldry and related fields. It refers to a specific type of cross with arms that are narrow in the center and widen towards the ends. Due to its limited usage, it is not part of common vocabulary and would be encountered mainly in specialized contexts. Understanding this term requires familiarity with heraldic terminology."},"example_sentences":[{"sentence":"The knight's shield was emblazoned with a prominent cross pattee.","translation":"騎士の盾には、目立つクロス・パティーが飾られていた。","type":"noun","meaning_category":"heraldry"},{"sentence":"Many military decorations feature a cross pattee design.","translation":"多くの軍事勲章は、クロス・パティーのデザインを特徴としている。","type":"noun","meaning_category":"design"}]}