{"word":"compreg","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"圧縮木材、高圧含浸木材","english_definition":"wood that has been impregnated with synthetic resin and compressed under high pressure to increase its strength and density.","examples":[{"sentence":"Compreg is used in applications where high strength and dimensional stability are required.","translation":"コンプレグは、高い強度と寸法安定性が要求される用途に使用されます。"},{"sentence":"The aircraft parts were made of compreg.","translation":"その航空機の部品はコンプレグで作られていた。"}],"collocations":["manufacture compreg","use compreg in construction","compreg aircraft parts"],"synonyms":["densified wood","resin-impregnated wood","high-density wood"],"antonyms":[]}],"etymology":{"value":"Derived from 'compressed' and 'impregnated'.","priority":"★★★"},"pronunciation":{"ipa":"ˈkɒmprɛɡ","syllables":"com-preg"},"inflection":{"noun_plural":"compregs"},"usage_notes":{"explanation":"Compreg is a type of composite material made by impregnating wood with synthetic resin and then compressing it under high pressure. This process increases the wood's strength, density, and resistance to moisture and decay. It is used in various applications where high strength and dimensional stability are required, such as aircraft parts, tooling, and high-performance sporting equipment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The compreg was make from steel.","correct":"✓ The compreg was made from wood and resin.","note":"Compreg is made from wood and synthetic resin, not steel."}],"priority":"★★☆"},"related_words":{"derivatives":["impregnate","compress"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Compreg is a specialized term referring to a specific type of composite wood material. Understanding it requires familiarity with materials science and manufacturing processes. Its usage is limited to technical contexts."},"example_sentences":[{"sentence":"The table top was made of compreg to ensure durability.","translation":"テーブルの天板は耐久性を確保するためにコンプレグで作られていた。","type":"noun","meaning_category":"material"},{"sentence":"Compreg is often used in the construction of high-performance skis.","translation":"コンプレグは高性能スキーの製造によく使用される。","type":"noun","meaning_category":"application"}]}