{"word":"vegetability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"植物性、植物であること、植物の性質","english_definition":"The state or quality of being vegetable; vegetable nature or properties.","examples":[{"sentence":"The vegetability of the soil is important for growing crops.","translation":"土壌の植物性は作物を育てる上で重要です。"},{"sentence":"We need to consider the vegetability of this area before building anything.","translation":"何かを建設する前に、この地域の植物性を考慮する必要があります。"}],"collocations":["soil vegetability","area vegetability","vegetability index"],"synonyms":["plant nature","vegetal quality","botanical character"],"antonyms":["animality","mineral nature"]}],"etymology":{"value":"From 'vegetable' + '-ability'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛdʒɪtəˈbɪləti/","syllables":"vej-e-ta-bil-i-ty"},"inflection":{"noun_plural":"vegetabilities"},"usage_notes":{"explanation":"'Vegetability' refers to the characteristics, qualities, or state associated with plants or plant life. It is not a commonly used word, and its usage is generally limited to technical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vegetability of the food made me sick.","correct":"✓ The vegetable content of the food made me sick.","note":"'Vegetability' refers to the general properties of plants, not the specific presence of vegetables in food. Use 'vegetable content' instead."},{"incorrect":"✗ The vegetability of the forest was amazing.","correct":"✓ The vegetation of the forest was amazing.","note":"'Vegetability' is about the nature of being a plant. Use 'vegetation' to describe the plant life in an area."}],"priority":"★★☆"},"related_words":{"derivatives":["vegetable","vegetal","vegetate","vegetation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vegetability' is a rare and technical term referring to the qualities or characteristics of plants. It is not commonly used in everyday language. Understanding requires a good grasp of botanical and scientific vocabulary."},"example_sentences":[{"sentence":"The study examined the vegetability of different soil types.","translation":"その研究では、異なる土壌型の植物性が調査されました。","type":"general","meaning_category":"植物性"},{"sentence":"The vegetability index helps assess the health of the ecosystem.","translation":"植物性指数は、生態系の健全性を評価するのに役立ちます。","type":"technical","meaning_category":"植物の性質"}]}