{"word":"Excoriation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(皮膚の)表皮剥離、擦過傷、掻破痕","english_definition":"An injury to the surface of the skin caused by abrasion or scratching.","examples":[{"sentence":"The patient presented with excoriations on their arms and legs due to excessive scratching.","translation":"患者は過度の掻痒により、腕と脚に表皮剥離を呈した。"},{"sentence":"Chronic excoriation can lead to secondary skin infections.","translation":"慢性の表皮剥離は二次的な皮膚感染症を引き起こす可能性がある。"}],"collocations":["skin excoriation","neurotic excoriation","self-excoriation"],"synonyms":["abrasion","scratch","erosion","ulceration"],"antonyms":["intact skin","healed skin"]}],"etymology":{"value":"From Late Latin 'excoriare', meaning 'to flay, skin', from 'ex-' (out) + 'corium' (skin).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌskɔːriˈeɪʃən/","syllables":"ex-cor-i-a-tion"},"inflection":{"noun_plural":"excoriations"},"usage_notes":{"explanation":"'Excoriation' refers specifically to skin damage caused by scratching or rubbing. It is often associated with dermatological conditions, psychiatric disorders (such as excoriation disorder), or intense itching. It is a more formal and medical term than 'scratch'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was just an excoriation, so it didn't need stitches.","correct":"✓ The wound was just a scratch, so it didn't need stitches.","note":"'Excoriation' is a more technical term. In everyday conversation, 'scratch' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["excoriate (verb: to strip off skin, to denounce strongly)","excoriated (adjective: having the skin stripped off)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (technical/medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Excoriation' is a technical term used in medicine to describe damage to the skin caused by scratching or rubbing. It's not a word used in everyday conversation. You're more likely to encounter it in medical contexts or when reading about dermatological conditions."},"example_sentences":[{"sentence":"The dermatologist noted several excoriations on the patient's back.","translation":"皮膚科医は患者の背中にいくつかの表皮剥離を認めた。","type":"noun","meaning_category":"表皮剥離"},{"sentence":"The constant itching led to significant excoriation of the affected area.","translation":"絶え間ない痒みが、患部の著しい表皮剥離につながった。","type":"noun","meaning_category":"表皮剥離"},{"sentence":"Self-excoriation is a symptom of some mental health conditions.","translation":"自傷性皮膚剥離は、一部の精神疾患の症状である。","type":"noun","meaning_category":"表皮剥離"}]}