{"word":"illusionists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イリュージョニスト、手品師、奇術師","english_definition":"Performers who create illusions, making things appear or disappear, often using elaborate props and techniques.","examples":[{"sentence":"The illusionists amazed the audience with their incredible feats of magic.","translation":"イリュージョニストたちは、信じられないような手品で観客を驚かせた。"},{"sentence":"Famous illusionists like Harry Houdini and David Copperfield have captivated audiences for generations.","translation":"ハリー・フーディーニやデビッド・カッパーフィールドのような有名なイリュージョニストは、何世代にもわたって観客を魅了してきた。"},{"sentence":"Modern illusionists often incorporate technology and special effects into their performances.","translation":"現代のイリュージョニストは、テクノロジーや特殊効果をパフォーマンスに取り入れることが多い。"}],"collocations":["stage illusionists (舞台イリュージョニスト)","street illusionists (ストリートイリュージョニスト)","master illusionists (熟練したイリュージョニスト)","famous illusionists (有名なイリュージョニスト)"],"synonyms":["magicians","conjurers","prestidigitators","tricksters","enchanters"],"antonyms":["realists","debunkers","skeptics"]}],"etymology":{"value":"The word 'illusionist' comes from 'illusion,' which is derived from the Latin word 'illusio,' meaning 'mockery, deception, trick.' The suffix '-ist' denotes a person who practices or is skilled in something.","priority":"★★☆"},"pronunciation":{"ipa":"ɪˈluːʒənɪsts","syllables":"il-lu-sion-ists"},"inflection":{"noun_plural":"illusionists"},"usage_notes":{"explanation":"'Illusionists' are distinct from other types of performers in that their primary goal is to create the appearance of something that is not real. They use a variety of techniques, including sleight of hand, misdirection, and elaborate stagecraft, to deceive the audience and create a sense of wonder. The term often implies a higher level of skill and spectacle than simply being a 'magician.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The illusionist did a trick of disappearing.","correct":"✓ The illusionist performed a disappearing trick.","note":"Use 'perform' or 'do' with 'trick,' not 'do a trick of disappearing.'"},{"incorrect":"✗ Illusionists are always real magicians.","correct":"✓ Illusionists create the illusion of magic, but their tricks rely on skill and deception.","note":"Illusionists create the *illusion* of magic, but their tricks are based on skill, deception, and stagecraft rather than actual magic."}],"priority":"★☆☆"},"related_words":{"derivatives":["illusion (noun: a false idea or belief; something that deceives by producing a false impression of reality)","illusionary (adjective: based on or producing illusion)","illusive (adjective: deceptive; causing illusion)"],"related_occupations":["magician","stagehand","special effects artist","escape artist"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'illusionists' refers to performers who specialize in creating illusions, making things appear or disappear through trickery and deception. This term is more specific than 'magician' and implies a focus on large-scale, visually impressive acts. Understanding this word requires a grasp of the concept of illusion and the role of performers who manipulate perception for entertainment."},"example_sentences":[{"sentence":"The troupe of illusionists put on a spectacular show in Las Vegas.","translation":"そのイリュージョニスト劇団はラスベガスで壮大なショーを上演した。","type":"general"},{"sentence":"Many people are fascinated by the skill and artistry of illusionists.","translation":"多くの人々がイリュージョニストの技術と芸術性に魅了されている。","type":"general"},{"sentence":"The illusionists used mirrors and lighting to create the illusion of floating objects.","translation":"イリュージョニストは鏡と照明を使って、物体が浮いているような錯覚を作り出した。","type":"technical"}]}