{"word":"Zosteraceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒルムシロ科 (植物分類)","english_definition":"a family of flowering plants, commonly known as the eelgrass family, that includes seagrasses.","examples":[{"sentence":"Zosteraceae are marine plants found in temperate and subtropical coastal waters.","translation":"ヒルムシロ科は、温帯および亜熱帯の沿岸水域に見られる海産植物です。"}],"collocations":["Zosteraceae family","eelgrass family","marine plants"],"synonyms":["eelgrass family"],"antonyms":[]}],"etymology":{"value":"The name Zosteraceae comes from the genus *Zostera*, which is derived from the Greek word 'zoster' meaning 'belt' or 'ribbon', referring to the long, ribbon-like leaves of these plants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzɒstərəˈeɪsiː/","syllables":"zos-ter-a-ce-ae"},"inflection":{"noun_plural":"Zosteraceaes or Zosteraceae (less common)"},"usage_notes":{"explanation":"Zosteraceae is a botanical term used in the scientific classification of plants. It refers specifically to a family of seagrasses, which are flowering plants that live in marine environments. When discussing these plants in a more general context, the term 'eelgrass family' may be used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Zosteraceae is a type of algae.","correct":"✓ Zosteraceae is a family of flowering plants.","note":"Zosteraceae are flowering plants, not algae."},{"incorrect":"✗ Zosteraceae only grows in freshwater.","correct":"✓ Zosteraceae grows in saltwater (marine) environments.","note":"Zosteraceae are marine plants and do not grow in freshwater."}],"priority":"★★☆"},"related_words":{"derivatives":["Zostera (genus)","seagrass","marine plants","aquatic plants"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な植物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zosteraceae' is a technical term used in botany to refer to a specific family of flowering plants that live in marine environments, commonly known as seagrasses or the eelgrass family. This term is primarily encountered in scientific literature, academic studies, and specialized discussions related to marine biology, plant taxonomy, and coastal ecology. Understanding this term requires a familiarity with botanical classification systems and marine ecosystems."},"example_sentences":[{"sentence":"The biodiversity of coastal ecosystems is often dependent on healthy populations of Zosteraceae.","translation":"沿岸生態系の生物多様性は、しばしば健全なヒルムシロ科の個体群に依存しています。","type":"scientific","meaning_category":"botany"},{"sentence":"Researchers are studying the impact of climate change on the distribution of Zosteraceae species.","translation":"研究者たちは、気候変動がヒルムシロ科の種の分布に与える影響を研究しています。","type":"scientific","meaning_category":"ecology"}]}