{"word":"boria","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of traditional dance and social gathering in parts of Southeast Asia, particularly in Malaysia and Singapore, often involving music, singing, and storytelling.","english_definition":"A traditional form of Malay dance-drama and social gathering, typically involving music, singing, and storytelling, originating from the Malay Peninsula.","examples":[{"sentence":"The village celebrated the harvest with a boria performance.","translation":"その村はボリアの公演で収穫を祝った。"},{"sentence":"Boria is an important part of the cultural heritage of the Malay community.","translation":"ボリアはマレーコミュニティの文化遺産の重要な一部である。"}],"collocations":["boria performance","boria troupe","traditional boria","Malay boria"],"synonyms":["dance-drama","traditional performance","cultural event"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'boria' is uncertain, but it is believed to be derived from a combination of influences from Malay and possibly other regional languages.","priority":"Low"},"pronunciation":{"ipa":"/ˈbɔːriə/","syllables":"bo-ri-a"},"inflection":{"noun_plural":"borias"},"usage_notes":{"explanation":"Boria is more than just a dance; it's a social event that brings communities together. It often involves humorous skits and moral lessons.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"boriya","correct":"boria","note":"The correct spelling is 'boria' without the extra 'y'."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Boria' refers to a specific type of traditional performance art found in certain Southeast Asian cultures. Understanding it requires knowledge of the cultural context of Malaysia and Singapore."},"example_sentences":[{"sentence":"The annual cultural festival featured a vibrant boria show.","translation":"毎年恒例の文化祭では、活気に満ちたボリアのショーが披露された。","type":"noun","meaning_category":"traditional dance-drama"},{"sentence":"Many tourists were fascinated by the unique style of boria.","translation":"多くの観光客がボリアの独特なスタイルに魅了された。","type":"noun","meaning_category":"traditional dance-drama"}]}