{"word":"isodontous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(昆虫の顎などが)同歯型の、同形の歯を持つ","english_definition":"Having teeth of the same form and size. (Especially of insect mandibles).","examples":[{"sentence":"The isodontous mandibles of the ant are well-suited for grasping and cutting.","translation":"その蟻の同歯型の顎は、掴んだり切ったりするのに適している。"}],"collocations":[],"synonyms":["homodont","homodontous"],"antonyms":["anisodontous","heterodontous"]}],"etymology":{"value":"Derived from the Greek words 'iso-' meaning 'equal' and 'odontous' meaning 'having teeth'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪsoʊˈdɒntəs/","syllables":"i-so-don-tous"},"inflection":{"notes":"Comparative and superlative forms are isodontouser and isodontousest, respectively, though rarely used."},"usage_notes":{"explanation":"This term is primarily used in entomology and zoology to describe the morphology of teeth or tooth-like structures that are uniform in shape and size. It's contrasted with anisodontous or heterodontous, where teeth vary.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["isodonty (noun): The condition of having teeth of the same form and size."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Isodontous' is a technical term used in biology, specifically in zoology and entomology. It describes organisms, particularly insects, that have teeth or tooth-like structures (mandibles) that are uniform in shape and size. Understanding this term requires familiarity with biological terminology and morphology. It is not a commonly used word outside of scientific contexts."},"example_sentences":[{"sentence":"The beetle's isodontous mandibles allow it to efficiently chew through plant material.","translation":"その甲虫の同歯型の顎は、植物の素材を効率的に噛み砕くことを可能にする。","type":"general","meaning_category":"同歯型の"}]}