{"word":"acturience","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The supposed ability to experience events before they occur; precognition.","english_definition":"The supposed ability to experience events before they occur; precognition.","examples":[{"sentence":"Some people believe in acturience, claiming to have seen future events in their dreams.","translation":"未来の出来事を夢で見たと主張し、予知能力を信じる人もいます。"}],"collocations":[],"synonyms":["precognition","presentiment","foreknowledge","clairvoyance"],"antonyms":[]}],"etymology":{"value":"A blend of 'actual' and 'experience', coined to describe the purported phenomenon of experiencing events before they happen.","priority":"★★★"},"pronunciation":{"ipa":"/ækˈtjʊəriəns/","syllables":"ac-tu-ri-ence"},"inflection":{"noun_plural":"acturiences"},"usage_notes":{"explanation":"'Acturience' is a relatively rare and somewhat obscure term, primarily used in discussions of parapsychology and the philosophy of time. It refers to the hypothetical ability to experience events before they physically occur, often associated with psychic abilities or precognitive dreams.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["acturient (adj.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a rare term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Acturience' is a niche term related to parapsychology, referring to the hypothetical ability to experience events before they occur. It's not commonly used in everyday language and is more likely to appear in discussions about psychic phenomena or theoretical physics. Understanding this word requires familiarity with abstract concepts and a specialized vocabulary."},"example_sentences":[{"sentence":"The concept of acturience challenges our understanding of causality and the flow of time.","translation":"予知能力の概念は、因果関係と時間の流れに関する私たちの理解に挑戦します。","type":"noun","meaning_category":"precognition"},{"sentence":"While there is no scientific evidence to support acturience, it remains a topic of interest in parapsychological studies.","translation":"予知能力を裏付ける科学的証拠はありませんが、依然として超心理学の研究における関心のトピックです。","type":"noun","meaning_category":"precognition"}]}