{"word":"backscratching","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に) お互いにお世辞を言い合うこと、互いに褒め合うこと、持ちつ持たれつの関係","english_definition":"(derogatory) mutual flattery and favors; reciprocal help or support, often of a self-serving nature.","examples":[{"sentence":"The committee was rife with backscratching, with members praising each other's ideas regardless of merit.","translation":"委員会は互いに褒め合うことが横行しており、メンバーは互いのアイデアを良し悪しに関わらず褒め称えていた。"},{"sentence":"He accused the politicians of backscratching and corruption.","translation":"彼は政治家たちを互いに褒め合い、腐敗していると非難した。"},{"sentence":"There's a lot of backscratching going on in the industry, which makes it hard for newcomers to break in.","translation":"業界では持ちつ持たれつの関係が多く、新参者が参入するのは難しい。"}],"collocations":["mutual backscratching (相互の褒め合い)","political backscratching (政治的な褒め合い)","industry backscratching (業界の褒め合い)","a culture of backscratching (褒め合いの文化)"],"synonyms":["mutual flattery","reciprocal praise","logrolling","you scratch my back, I'll scratch yours"],"antonyms":["criticism","honest evaluation","objective assessment"]},{"part_of_speech":"gerund or present participle","definition":"動詞 backscratch の現在分詞または動名詞","english_definition":"The gerund or present participle of the verb 'backscratch'.","examples":[{"sentence":"Backscratching is not an ethical way to get ahead in business.","translation":"お互いにお世辞を言い合うことは、ビジネスで成功するための倫理的な方法ではない。"},{"sentence":"He was accused of backscratching to gain favor with the boss.","translation":"彼は上司に取り入るためにお世辞を言い合っていると非難された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Back' + 'scratching'. The image is of one person scratching another's back, and then the other person returning the favor. This is extended metaphorically to mean mutual favors or praise, often of a self-serving nature.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbækˌskrætʃɪŋ/","syllables":"back-scratch-ing"},"inflection":{"notes":"Noun (uncountable). Also functions as a gerund or present participle of the verb 'backscratch'."},"usage_notes":{"explanation":"'Backscratching' is almost always used in a negative or critical way. It implies that the praise or favors being exchanged are insincere and motivated by self-interest rather than genuine appreciation or merit. It often suggests a lack of objectivity or fairness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"They were backscratching each other for the award.","correct":"They were backscratching each other to get the award.","note":"'Backscratching' is the activity itself. To describe the purpose, use 'to' + verb."},{"incorrect":"The backscratching was very good.","correct":"The backscratching was excessive/rampant/obvious.","note":"'Backscratching' is generally viewed negatively, so 'good' is not typically used to describe it."}],"priority":"★★☆"},"related_words":{"derivatives":["backscratch (verb)","backscratcher (noun: a tool for scratching one's back, or a person who engages in backscratching)"],"idioms_phrases":["You scratch my back, and I'll scratch yours. (持ちつ持たれつ)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'backscratching' is used to describe a situation where people give each other compliments or favors, often in a way that is not sincere or honest. It suggests that they are doing it to benefit themselves, rather than because they genuinely appreciate each other. The word is usually used in a negative way to criticize this kind of behavior. It's not a very common word, so you might only hear it in more formal or critical discussions."},"example_sentences":[{"sentence":"The company's promotion system seemed to be based more on backscratching than on actual performance.","translation":"その会社の昇進制度は、実際の業績よりもお互いを褒め合うことによって決まっているようだった。","type":"noun","meaning_category":"mutual flattery"},{"sentence":"He got ahead in his career through relentless backscratching and networking.","translation":"彼は絶え間ないお世辞と言い合いと人脈作りによってキャリアを築いた。","type":"noun","meaning_category":"mutual flattery"},{"sentence":"The article criticized the backscratching between journalists and politicians.","translation":"その記事はジャーナリストと政治家との間の褒め合いを批判した。","type":"noun","meaning_category":"mutual flattery"}]}