{"word":"demodulates","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"復調する、検波する","english_definition":"extracts the original information-bearing signal from a modulated carrier wave.","examples":[{"sentence":"The receiver demodulates the incoming radio signal.","translation":"受信機は入ってくる電波信号を復調する。"},{"sentence":"The modem demodulates the signal from the phone line.","translation":"モデムは電話回線からの信号を復調する。"}],"collocations":["demodulate a signal","demodulate data","demodulate a carrier wave"],"synonyms":["decode","extract","recover"],"antonyms":["modulate","encode"]}],"etymology":{"value":"The word 'demodulate' is formed by adding the prefix 'de-' (meaning 'opposite of' or 'undoing') to the word 'modulate'. 'Modulate' itself comes from the Latin word 'modulari', meaning 'to measure rhythmically' or 'to regulate'. Therefore, 'demodulate' literally means to undo the modulation, or to extract the original signal from a modulated wave.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈmɒdjʊleɪts/","syllables":"de-mod-ju-lates"},"inflection":{"verb_forms":{"present_simple":["demodulates"],"past_simple":"demodulated","past_participle":"demodulated","present_participle":"demodulating"}},"usage_notes":{"explanation":"'Demodulates' is the third-person singular present tense form of the verb 'demodulate.' It is used to describe the process of extracting the original information signal from a modulated carrier wave. This process is essential in communication systems, such as radio, television, and data transmission, where information is transmitted by modulating a carrier wave and then demodulating it at the receiving end to recover the original information.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The device demodulate the signal.","correct":"✓ The device demodulates the signal.","note":"In the present simple tense, the third-person singular form requires the '-s' ending."},{"incorrect":"✗ Demodulate is the process of modulating a signal.","correct":"✓ Demodulation is the process of extracting the original signal from a modulated wave.","note":"'Demodulate' is a verb. The noun form for the process is 'demodulation'."}],"priority":"★★☆"},"related_words":{"derivatives":["demodulation (noun): the process of demodulating a signal","demodulator (noun): a device that demodulates a signal"],"related_terms":["modulation","carrier wave","signal processing","frequency","amplitude"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'demodulates' is a technical term primarily used in the context of electronics, telecommunications, and signal processing. It refers to the process by which the original information-bearing signal is extracted from a modulated carrier wave. This term is typically encountered in advanced technical texts or discussions related to communication systems and signal analysis. A solid understanding of signal processing concepts is necessary to fully grasp the meaning and usage of this word."},"example_sentences":[{"sentence":"The radio receiver **demodulates** the incoming radio waves to extract the audio signal.","translation":"ラジオ受信機は、入ってくる電波を復調してオーディオ信号を取り出す。","type":"verb","meaning_category":"復調する"},{"sentence":"The software **demodulates** the digital data stream to recover the original information.","translation":"ソフトウェアはデジタルデータストリームを復調して元の情報を復元する。","type":"verb","meaning_category":"復調する"},{"sentence":"This circuit **demodulates** the amplitude-modulated signal.","translation":"この回路は振幅変調された信号を復調する。","type":"verb","meaning_category":"復調する"}]}