{"word":"Lignin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リグニン（木質素）","english_definition":"A complex polymer that is a major structural component of plant cell walls, providing rigidity and resistance to decay.","examples":[{"sentence":"Lignin is what makes wood rigid.","translation":"リグニンは木材を硬くするものです。"},{"sentence":"The removal of lignin is a key step in paper production.","translation":"リグニンの除去は、製紙工程における重要なステップです。"},{"sentence":"Lignin is a complex polymer found in the cell walls of plants.","translation":"リグニンは植物の細胞壁に見られる複雑なポリマーです。"}],"collocations":["lignin content","lignin degradation","lignin biosynthesis","lignin structure","lignin removal"],"synonyms":["wood fiber","plant polymer"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'lignum', meaning 'wood'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɪɡnɪn/","syllables":"lig-nin"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Lignin is a complex polymer that is a major structural component of plant cell walls. It provides rigidity and resistance to decay. It is particularly abundant in woody tissues, such as tree trunks and branches. Lignin is a byproduct of the paper pulping process, and is also being researched as a potential source of renewable energy and valuable chemicals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lignin is a type of protein.","correct":"✓ Lignin is a type of polymer.","note":"Lignin is a complex polymer, not a protein."},{"incorrect":"✗ Lignin makes plants flexible.","correct":"✓ Lignin makes plants rigid.","note":"Lignin provides rigidity and strength to plant cell walls."}],"priority":"★★☆"},"related_words":{"derivatives":["lignocellulose (noun: リグノセルロース)","lignosulfonate (noun: リグノスルホン酸塩)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lignin' is a technical term primarily encountered in the context of plant biology, chemistry, and materials science. It refers to a complex polymer that provides structural support to plant cell walls, making them rigid and resistant to decay. The word is most likely to appear in scientific articles, textbooks, or discussions related to biomass, biofuels, or paper production. Understanding the term requires some background knowledge in these fields."},"example_sentences":[{"sentence":"The **lignin** content of different types of wood varies significantly.","translation":"木材の種類によってリグニンの含有量は大きく異なります。","type":"noun","meaning_category":"リグニン含有量"},{"sentence":"Research is being conducted to find efficient methods for **lignin** degradation.","translation":"リグニンの効率的な分解方法を見つけるための研究が行われています。","type":"noun","meaning_category":"リグニンの分解"},{"sentence":"**Lignin** gives the plant cell walls their rigidity.","translation":"リグニンは植物細胞壁に剛性を与えます。","type":"noun","meaning_category":"リグニンの機能"}]}