{"word":"incorruptibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不正行為をせずに、買収されずに、清廉潔白に","english_definition":"in a way that shows an unwillingness to use one's position of authority for personal gain; in a manner that cannot be corrupted or bribed.","examples":[{"sentence":"He served the public trust incorruptibly for many years.","translation":"彼は長年にわたり、不正行為をせずに公的信頼に応えてきた。"},{"sentence":"She acted incorruptibly, always putting the interests of the company first.","translation":"彼女は常に会社の利益を第一に考え、不正行為をせずに職務を遂行した。"},{"sentence":"The judge presided over the trial incorruptibly, ensuring a fair outcome.","translation":"裁判官は不正行為をせずに裁判を主宰し、公正な結果を保証した。"}],"collocations":["serve incorruptibly","act incorruptibly","preside incorruptibly"],"synonyms":["honestly","uprightly","virtuously","ethically","scrupulously","with integrity"],"antonyms":["corruptly","dishonestly","unethically"]}],"etymology":{"value":"The word 'incorruptibly' is formed by adding the suffix '-ly' to the adjective 'incorruptible'. 'Incorruptible' comes from the prefix 'in-' (meaning 'not') + 'corruptible' (capable of being corrupted). 'Corruptible' derives from the Latin word 'corrumpere', meaning 'to spoil, destroy, or bribe'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnkəˈrʌptɪbli/","syllables":"in-cor-rupt-i-bly"},"inflection":{"notes":"As an adverb, 'incorruptibly' does not have different inflections."},"usage_notes":{"explanation":"'Incorruptibly' describes the manner in which someone acts, emphasizing their unwavering commitment to honesty and ethical behavior, particularly in positions of power or responsibility. It suggests a steadfast refusal to be swayed by bribes, personal gain, or other forms of corruption. The term is often used in contexts involving politics, law, business, and public service to highlight the integrity of individuals or institutions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an incorruptibly man.","correct":"✓ He is an incorruptible man.","note":"'Incorruptibly' is an adverb and modifies a verb, adjective, or another adverb. 'Incorruptible' is an adjective and modifies a noun. In this case, 'man' is a noun, so it should be modified by the adjective 'incorruptible'."},{"incorrect":"✗ She acted with incorruptible.","correct":"✓ She acted incorruptibly.","note":"'Incorruptible' is an adjective, while 'incorruptibly' is the adverb form. The adverb is needed to modify the verb 'acted'."}],"priority":"★★☆"},"related_words":{"derivatives":["incorruptible (adjective)","incorruptibility (noun)"],"related_terms":["integrity","honesty","ethics","morality","probity","rectitude"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adverb 'incorruptibly' describes acting in a way that is completely honest and cannot be influenced by bribery or corruption. It's a formal word often used in discussions about ethics, politics, or law. It emphasizes a strong moral character and a refusal to compromise one's principles for personal gain. Understanding this word requires a good grasp of abstract concepts like integrity and ethical behavior."},"example_sentences":[{"sentence":"The auditor conducted the investigation incorruptibly, revealing the full extent of the fraud.","translation":"監査人は不正行為をせずに調査を行い、詐欺の全容を明らかにした。","type":"adverb","meaning_category":"清廉潔白に"},{"sentence":"The organization pledged to operate incorruptibly, ensuring transparency in all its dealings.","translation":"その組織は、すべての取引において透明性を確保し、不正行為をせずに運営することを誓約した。","type":"adverb","meaning_category":"不正行為をせずに"},{"sentence":"He judged the competition incorruptibly, awarding prizes based solely on merit.","translation":"彼は不正行為をせずに競争を審査し、完全に実力に基づいて賞を授与した。","type":"adverb","meaning_category":"買収されずに"}]}