{"word":"recognizee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"認識される人、認識される団体","english_definition":"A person or entity that is recognized.","examples":[{"sentence":"The recognizee of the award was deeply moved by the honor.","translation":"受賞者（認識された人）は、その栄誉に深く感動しました。"},{"sentence":"The company was the recognizee of the government's support program.","translation":"その会社は、政府の支援プログラムの対象団体（認識された団体）でした。"}],"collocations":["the recognizee of the award","the recognizee of the support","the recognizee of the honor"],"synonyms":["recipient","awardee","beneficiary"],"antonyms":["recognizer"]}],"etymology":{"value":"Formed by adding the suffix '-ee' to the verb 'recognize'. The '-ee' suffix typically denotes the recipient of an action.","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛkəɡˈnaɪziː/","syllables":"rec-og-nizee"},"inflection":{"noun_plural":"recognizees"},"usage_notes":{"explanation":"'Recognizee' is a relatively uncommon noun that refers to the person or entity that is being recognized by someone or something else. It is most often used in formal contexts, such as legal or official documents. It is the counterpart to 'recognizer', which is the person or entity doing the recognizing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recognizee recognized the recognizer.","correct":"✓ The recognizee was recognized by the recognizer.","note":"'Recognizee' is the recipient of the recognition, so it is usually the subject of a passive verb construction."}],"priority":"★★☆"},"related_words":{"derivatives":["recognize","recognition","recognizer"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recognizee' is a specialized term, primarily used in formal or legal contexts, to refer to the person or entity being recognized. It's not a word commonly encountered in everyday conversation. Understanding its meaning is helpful for interpreting legal or official documents where such terminology might be used."},"example_sentences":[{"sentence":"The recognizee of the patent was granted exclusive rights to the invention.","translation":"特許の被認識者（権利を認められた者）には、その発明に対する独占的な権利が付与されました。","type":"noun","meaning_category":"legal"},{"sentence":"As the recognizee of the grant, the university was responsible for managing the funds.","translation":"助成金の被認識者（助成を認められた者）として、大学はその資金の管理責任を負っていました。","type":"noun","meaning_category":"funding"}]}