{"word":"divorcible","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"離婚可能な、離婚できる","english_definition":"Capable of being divorced; affording sufficient grounds for divorce.","examples":[{"sentence":"Is this marriage really divorcible?","translation":"この結婚は本当に離婚可能なのでしょうか？"},{"sentence":"The relationship had become divorcible due to irreconcilable differences.","translation":"その関係は、埋め合わせのつかない相違のために離婚可能になっていた。"}],"collocations":["divorcible offense","divorcible grounds"],"synonyms":["dissolvable","terminable"],"antonyms":["indissoluble","unbreakable"]},{"part_of_speech":"adjective","definition":"離婚に適した、離婚に値する","english_definition":"Worthy of divorce; justifying divorce.","examples":[{"sentence":"His behavior was divorcible, according to the old laws.","translation":"彼の行動は、古い法律によれば離婚に値した。"},{"sentence":"She considered his actions divorcible, but decided to try to work things out.","translation":"彼女は彼の行動を離婚に値すると考えたが、何とか解決しようと決めた。"}],"collocations":[],"synonyms":["justifiable","warrantable"],"antonyms":["unjustifiable","unwarrantable"]}],"etymology":{"value":"The word \"divorcible\" is derived from \"divorce\" (from Old French divorce, from Latin divortium, from divertere \"to turn aside\") with the addition of the suffix \"-able\" or \"-ible,\" indicating capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvɔːrsɪbəl/","syllables":"di-vor-ci-ble"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"The adjective \"divorcible\" describes a situation, action, or relationship that either allows for divorce to be legally obtained or is so problematic that divorce is a reasonable or justifiable response. Its usage is somewhat formal and less common than phrases like \"grounds for divorce\" or \"reason for divorce.\" It often appears in legal or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The couple was divorcible.","correct":"✓ The couple's marriage was divorcible. / ✓ The couple had divorcible grounds.","note":"\"Divorcible\" typically modifies the marriage or the situation, not the people involved. It's more accurate to say the marriage is divorcible or that there are divorcible grounds, rather than saying the couple is divorcible."}],"priority":"★★☆"},"related_words":{"derivatives":["divorce","divorced","divorceable","divorcibility"],"phrasal_verbs":[],"related_terms":["grounds for divorce","irreconcilable differences"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"divorcible\" is a relatively uncommon adjective that means something is capable of being divorced or provides sufficient reason for divorce. It's often used in legal or formal contexts to describe a situation or action that justifies or allows for a divorce to occur. Because it's not a commonly used word, understanding its meaning requires a strong vocabulary and familiarity with legal terminology related to divorce.","priority":"★★☆"},"example_sentences":[{"sentence":"The judge ruled that the marriage was not divorcible under the current circumstances.","translation":"裁判官は、現在の状況下ではその結婚は離婚可能ではないと判断した。","type":"general","meaning_category":"離婚可能な"},{"sentence":"Adultery is often considered a divorcible offense in many jurisdictions.","translation":"不倫は、多くの管轄区域で離婚に値する犯罪と見なされることが多い。","type":"general","meaning_category":"離婚に値する"}]}