{"word":"trifledom","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"些細なことばかりの世界、取るに足らないことばかりの状態","english_definition":"a world or state characterized by triviality or insignificance.","examples":[{"sentence":"He escaped the stifling atmosphere of corporate meetings and entered the refreshing world of art, a welcome escape from the daily grind of trifledom.","translation":"彼は息苦しい企業会議の雰囲気から逃れ、芸術という爽やかな世界に入り、日々の些細なことばかりの退屈な仕事からの歓迎すべき脱出となった。"},{"sentence":"The novel satirizes the vapid concerns and superficial relationships of high society, exposing the emptiness of their trifledom.","translation":"その小説は、上流社会の空虚な関心事と表面的な人間関係を風刺し、彼らの些細なことばかりの世界の空虚さを暴露している。"}],"collocations":["escape from trifledom","enter trifledom","the emptiness of trifledom"],"synonyms":["triviality","insignificance","pettiness","frivolity","superficiality"],"antonyms":["importance","significance","gravity","seriousness"]}],"etymology":{"value":"「trifle」（些細なこと）+ 「-dom」（状態、領域）からなる造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈtraɪfəldəm/","syllables":"tri-fle-dom"},"inflection":{"noun_plural":"trifledoms"},"usage_notes":{"explanation":"「trifledom」は、軽蔑的な意味合いで、些細なことや取るに足らないことばかりに気を取られている状態や世界を指す言葉です。日常の些末な事柄や、重要性の低い活動に過度に集中している状況を批判的に表現する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She lived in a trifledom of luxury.","correct":"✓ She lived a life of luxury, focused on trivial matters.","note":"「trifledom」は場所や生活様式を直接指すのではなく、状態や世界観を指すため、上記のように言い換える方が自然です。"},{"incorrect":"✗ The trifledom was very happy.","correct":"✓ The people in that world of triviality seemed content.","note":"「trifledom」は人や物を主語にすることはできません。その状態にいる人々について述べる場合は、上記のように表現を修正します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["trifle (名詞: 些細なこと、わずかなもの；動詞: 軽んじる、いい加減に扱う)","trifling (形容詞: 些細な、取るに足らない)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**trifledom**」は、あまり一般的ではない単語で、主に文学的な文脈や、特定の状況を批判的に表現する際に用いられます。この単語は、些細なことや取るに足らないことにばかり気を取られている状態や世界を指します。例えば、重要性の低い活動に過度に集中している状況や、表面的な価値観が支配的な社会を表現する際に使用されます。この単語を理解するには、接尾辞「-dom」が「状態」や「領域」を表すことを知っておくと役立ちます。"},"example_sentences":[{"sentence":"The politician's speech was filled with empty promises and platitudes, a perfect example of political trifledom.","translation":"その政治家の演説は、空虚な約束と決まり文句で満たされており、政治的な些細なことばかりの世界の完璧な例だった。","type":"noun","meaning_category":"些細なことばかりの世界"},{"sentence":"She longed to escape the suffocating trifledom of her small town and experience the wider world.","translation":"彼女は、自分の小さな町の息苦しい些細なことばかりの世界から逃れ、より広い世界を経験したいと切望した。","type":"noun","meaning_category":"些細なことばかりの世界"},{"sentence":"The film critic dismissed the movie as a shallow exploration of celebrity trifledom.","translation":"その映画評論家は、その映画を有名人の些細なことばかりの世界の浅薄な探求として一蹴した。","type":"noun","meaning_category":"些細なことばかりの世界"}]}