{"word":"oculinoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"眼に似た、または眼の形をした","english_definition":"Resembling an eye or eyes in shape or appearance.","examples":[{"sentence":"The oculinoid markings on the butterfly's wings are thought to deter predators.","translation":"蝶の羽にある眼状の模様は、捕食者を威嚇すると考えられています。"},{"sentence":"The pattern on the fabric featured several oculinoid designs.","translation":"その生地の模様には、いくつかの眼に似たデザインが施されていました。"}],"collocations":["oculinoid marking","oculinoid pattern"],"synonyms":["eye-shaped","ophthalmiform","oculate"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'oculus' (eye) + '-oid' (resembling).","priority":"★★☆"},"pronunciation":{"ipa":"/ɒˈkjʊlɪnɔɪd/","syllables":"o-cu-li-noid"},"inflection":{"notes":"Comparative and superlative forms are created using 'more' and 'most' respectively (e.g., 'more oculinoid', 'most oculinoid')."},"usage_notes":{"explanation":"'Oculinoid' is a relatively uncommon term, primarily used in descriptive contexts within biology, art, and design. It is used to describe something that shares a visual similarity to an eye, without necessarily functioning as one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oculinoid was used to see in the dark.","correct":"✓ The oculinoid marking was thought to deter predators.","note":"'Oculinoid' is an adjective, not a noun. It describes something that resembles an eye, but it is not an actual eye or a device. Use it to modify a noun, such as 'marking' or 'pattern'."}],"priority":"★★☆"},"related_words":{"derivatives":["oculus (eye)","oculate (having eyes or eye-like spots)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oculinoid' is a specialized term used to describe something that resembles an eye in shape or appearance. It is not commonly used in everyday language and is more likely to be found in scientific or artistic contexts. Understanding the etymology (from 'oculus' meaning 'eye') helps to grasp its meaning. It's important to remember that it's an adjective, not a noun, and should be used to modify a noun.","priority":"★★☆"},"example_sentences":[{"sentence":"The peacock's feathers display intricate oculinoid patterns.","translation":"クジャクの羽には、複雑な眼状の模様が見られます。","type":"adjective","meaning_category":"resembling an eye"},{"sentence":"The artist incorporated oculinoid shapes into the sculpture.","translation":"そのアーティストは、彫刻に眼に似た形を取り入れました。","type":"adjective","meaning_category":"eye-shaped"}]}