{"word":"subduably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"征服可能に、抑制可能に","english_definition":"In a manner that can be subdued; in a way that is capable of being conquered or controlled.","examples":[{"sentence":"The enemy forces, though numerous, were subduably demoralized after the initial defeat.","translation":"敵軍は多数ではあったが、最初の敗北後、征服可能なほどに士気が低下していた。"},{"sentence":"The child's temper, though fierce, was subduably managed with patience and understanding.","translation":"その子の気性は激しかったが、忍耐と理解をもって抑制可能に管理された。"}],"collocations":["subduably managed","subduably controlled","subduably weakened"],"synonyms":["controllably","manageably","conquerably","overcomably"],"antonyms":["uncontrollably","unmanageably","invincibly"]}],"etymology":{"value":"Derived from the adjective 'subduable' (capable of being subdued) by adding the suffix '-ly' to form an adverb. 'Subduable' comes from the verb 'subdue' (to conquer or control) + '-able' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈdjuːəbli/","syllables":"sub-du-a-bly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"'Subduably' is used to describe the manner in which something can be subdued. It emphasizes the potential for control or conquest. It is not a commonly used word, and its usage is typically found in formal or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was subduably difficult.","correct":"✓ The problem was manageably difficult.","note":"'Subduably' refers to the manner of subduing, not the degree of difficulty. 'Manageably' is more appropriate to describe the level of difficulty."}],"priority":"★☆☆"},"related_words":{"derivatives":["subdue (verb)","subduable (adjective)","subduableness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subduably' is an advanced word that describes how something can be controlled or conquered. It's not commonly used in everyday conversation. You might encounter it in formal writing or when describing a situation where something is capable of being brought under control. For instance, you might say that an enemy's resistance was 'subduably' weakened, meaning it could be overcome."},"example_sentences":[{"sentence":"The rebellion, though initially strong, was subduably quelled by the government's decisive actions.","translation":"その反乱は、当初は強かったものの、政府の断固たる行動によって鎮圧可能に鎮圧された。","type":"adverb","meaning_category":"征服可能に"},{"sentence":"Her anxiety, once overwhelming, became subduably manageable with therapy and medication.","translation":"彼女の不安は、かつては圧倒的だったが、セラピーと薬物療法によって抑制可能に管理できるようになった。","type":"adverb","meaning_category":"抑制可能に"}]}