{"word":"Croton-on-Hudson","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クロトン・オン・ハドソン：アメリカ合衆国ニューヨーク州ウェストチェスター郡にある村。","english_definition":"A village in Westchester County, New York, United States.","examples":[{"sentence":"Croton-on-Hudson is a beautiful village located on the Hudson River.","translation":"クロトン・オン・ハドソンはハドソン川沿いにある美しい村です。"},{"sentence":"The population of Croton-on-Hudson is approximately 8,000 people.","translation":"クロトン・オン・ハドソンの人口は約8,000人です。"}],"collocations":["Croton-Harmon School District","Croton Dam","Hudson River","Westchester County"],"synonyms":["Croton"],"antonyms":[]},{"part_of_speech":"noun","definition":"クロトン・オン・ハドソン：上記村を含む町。","english_definition":"A town in Westchester County, New York, containing the village of the same name.","examples":[{"sentence":"The town of Croton-on-Hudson includes several hamlets and the village.","translation":"クロトン・オン・ハドソンの町には、いくつかの集落と村が含まれています。"}],"collocations":["Town of Croton-on-Hudson","Croton Point Park"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Croton\" comes from the Croton River, which was named after a Native American sachem named Kenoten. \"On Hudson\" was added to distinguish it from other places named Croton.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkroʊtən ɒn ˈhʌdsən/","syllables":"Cro-ton-on-Hud-son"},"inflection":{},"usage_notes":{"explanation":"\"Croton-on-Hudson\" refers to both the village and the larger town that contains it. When referring to the specific incorporated area, \"village of Croton-on-Hudson\" is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Croton on Hudson is a city.","correct":"✓ Croton-on-Hudson is a village and a town.","note":"Croton-on-Hudson is a village within a town of the same name, not a city."}],"priority":"★☆☆"},"related_words":{"derivatives":["Croton (short form)"],"related_places":["Ossining","Cortlandt","Peekskill"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, mainly used in specific contexts related to New York.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Croton-on-Hudson\" is a proper noun referring to a specific location in New York State. Understanding its usage requires knowledge of geography and local context. It is not a commonly used term outside of discussions about the region.","priority":"★☆☆"},"example_sentences":[{"sentence":"We visited Croton-on-Hudson last summer and enjoyed the scenic views.","translation":"私たちは昨年の夏にクロトン・オン・ハドソンを訪れ、美しい景色を楽しみました。","type":"noun","meaning_category":"場所"},{"sentence":"The train from Grand Central Terminal goes directly to Croton-on-Hudson.","translation":"グランドセントラル駅からクロトン・オン・ハドソンまで直通の電車が出ています。","type":"noun","meaning_category":"場所"}]}