{"word":"tiderode","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"潮流によって船が回転する現象、またはその状態。","english_definition":"The state of a vessel at anchor when it is riding with the tide; also, the arc through which a vessel swings when changing with the tide.","examples":[{"sentence":"The ship was in a tiderode, slowly turning with the changing current.","translation":"船は潮流によって回転しており、変化する流れと共にゆっくりと回っていた。"},{"sentence":"Due to the strong tiderode, the anchored boats were dangerously close to each other.","translation":"強い潮流回転のため、停泊中のボート同士が危険なほど接近していた。"}],"collocations":["strong tiderode","affected by tiderode","at tiderode"],"synonyms":["swinging at anchor","tidal swing"],"antonyms":[]}],"etymology":{"value":"Derived from 'tide' (the periodic rise and fall of the sea) and 'rode' (the cable or chain by which a vessel is anchored).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaɪdˌroʊd/","syllables":"ti-de-rode"},"inflection":{"noun_plural":"tiderodes"},"usage_notes":{"explanation":"The term 'tiderode' is primarily used in nautical contexts to describe the behavior of a vessel anchored in tidal waters. Understanding tiderode is important for safe anchoring and navigation, especially in areas with strong tidal currents.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The boat was tiderode.","correct":"✓ The boat was at tiderode.","note":"Use 'at tiderode' to describe the state of the boat."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["anchor","tide","current","mooring","navigation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tiderode' is a specialized nautical term referring to the state of a vessel anchored in tidal waters and the swinging motion it undergoes due to changing tidal currents. Understanding this term is crucial for those involved in maritime activities, particularly in areas with significant tidal variations. The word combines 'tide' and 'rode,' reflecting its connection to tidal forces and the anchor rode (cable or chain)."},"example_sentences":[{"sentence":"The captain warned the crew about the potential dangers of tiderode in the narrow channel.","translation":"船長は、狭い水路での潮流回転の潜在的な危険性について乗組員に警告した。","type":"noun","meaning_category":"phenomenon"},{"sentence":"Careful planning is needed to avoid collisions when multiple vessels are at tiderode in a crowded anchorage.","translation":"混雑した停泊地で複数の船舶が潮流回転している場合、衝突を避けるためには慎重な計画が必要である。","type":"noun","meaning_category":"state"}]}