{"word":"cornily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"古くさいほど感傷的に、大げさに、わざとらしく","english_definition":"in a corny manner; in a way that is trite, sentimental, or overly theatrical.","examples":[{"sentence":"He acted cornily in the play, exaggerating every emotion.","translation":"彼はその劇でわざとらしく演技をし、あらゆる感情を大げさに表現した。"},{"sentence":"The movie ended cornily with a saccharine-sweet reconciliation.","translation":"その映画は、甘ったるい仲直りで、古くさいほど感傷的な結末を迎えた。"},{"sentence":"She delivered her lines cornily, making the scene unintentionally funny.","translation":"彼女はわざとらしくセリフを言い、その場面を意図せずおかしくしてしまった。"}],"collocations":["act cornily","speak cornily","end cornily","smile cornily"],"synonyms":["sentimentally","tritely","banally","cloyingly","maudlinly","theatrically","melodramatically"],"antonyms":["sincerely","genuinely","authentically","naturally","realistically"]}],"etymology":{"value":"\"corny\" (古くさい、感傷的な) + \"-ly\" (副詞を作る接尾辞)。 \"Corny\" は、1930年代頃のアメリカで、田舎っぽさや時代遅れなユーモアを指す言葉として使われ始めた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrnɪli/","syllables":"cor-ni-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"\"**Cornily**\" describes something done in a way that is excessively sentimental, trite, or old-fashioned, often to the point of being embarrassing or unintentionally humorous. It implies a lack of originality and a reliance on clichés. It's often used to describe acting, writing, or other forms of creative expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He behaved cornily because he was happy.","correct":"✓ He behaved sincerely because he was happy.","note":"\"Cornily\" implies insincerity or artificiality. If someone is genuinely happy, \"sincerely\" or \"genuinely\" would be more appropriate. "},{"incorrect":"✗ The movie was cornily good.","correct":"✓ The movie was surprisingly good.","note":"\"Cornily\" generally has a negative connotation. If something is good, but in a predictable or cliché way, you might say it was \"predictably good\" or \"surprisingly good\" if it exceeded expectations."}],"priority":"★★☆"},"related_words":{"derivatives":["corny (adjective: 古くさい、感傷的な、わざとらしい)","corniness (noun: 古くささ、感傷的な性質、わざとらしさ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Cornily**\" means doing something in a way that is very old-fashioned, overly sentimental, or cliché. It's often used to describe performances, writing, or anything that tries too hard to be emotional or funny but ends up seeming insincere or awkward. It's not a common word, so you'll mostly find it in more advanced or descriptive writing."},"example_sentences":[{"sentence":"The actor delivered his lines so cornily that the audience couldn't help but laugh.","translation":"その俳優はわざとらしくセリフを言ったので、観客は笑わずにはいられなかった。","type":"adverb","meaning_category":"わざとらしく"},{"sentence":"She smiled cornily at the camera, trying to look charming.","translation":"彼女は魅力的になろうとして、カメラにわざとらしく微笑んだ。","type":"adverb","meaning_category":"大げさに"},{"sentence":"The song's lyrics were cornily sentimental, full of clichés about love and loss.","translation":"その歌の歌詞は古くさいほど感傷的で、愛と喪失についての決まり文句でいっぱいだった。","type":"adverb","meaning_category":"古くさいほど感傷的に"}]}