{"word":"Ignatias","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A homeopathic medicine prepared from the seeds of the St. Ignatius bean (Strychnos ignatii). It is often used for grief, anxiety, and mood swings.","english_definition":"A homeopathic medicine prepared from the seeds of the St. Ignatius bean (Strychnos ignatii), often used for grief, anxiety, and mood swings.","examples":[{"sentence":"She took Ignatias for her grief after losing her pet.","translation":"彼女はペットを亡くした悲しみのためにイグナチアを服用した。"},{"sentence":"The homeopath prescribed Ignatias to help with her anxiety.","translation":"ホメオパシー医は彼女の不安を和らげるためにイグナチアを処方した。"}],"collocations":["take Ignatias","prescribe Ignatias","use Ignatias for grief","Ignatias for anxiety"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after St. Ignatius of Loyola, the founder of the Jesuit order. The St. Ignatius bean was named in his honor.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈneɪʃiəs/","syllables":"Ig-na-ti-as"},"inflection":{"notes":"This is a proper noun and usually does not have plural forms."},"usage_notes":{"explanation":"'Ignatias' refers specifically to the homeopathic remedy derived from the St. Ignatius bean. It is important to note that homeopathy is a controversial practice, and the efficacy of homeopathic medicines is not scientifically established.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Strychnos ignatii (scientific name of the St. Ignatius bean)","homeopathy","remedy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ignatias' is a specialized term related to homeopathy. Understanding its meaning requires familiarity with homeopathic medicine and its principles. It is not a commonly used word in general English. "},"example_sentences":[{"sentence":"Many people use Ignatias to treat emotional distress.","translation":"多くの人が精神的な苦痛を治療するためにイグナチアを使用しています。","type":"noun","meaning_category":"Homeopathic medicine"},{"sentence":"The label on the bottle indicated it contained Ignatias.","translation":"ボトルのラベルにはイグナチアが含まれていることが示されていました。","type":"noun","meaning_category":"Homeopathic medicine"}]}