{"word":"half-lapped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(木工で)半分重ね継ぎされた","english_definition":"(of a joint) made by overlapping two pieces of wood, each having been cut away to half its thickness.","examples":[{"sentence":"The table was constructed with half-lapped joints for extra strength.","translation":"そのテーブルは強度を高めるために、半分重ね継ぎで組み立てられた。"},{"sentence":"He used a half-lapped joint to connect the two pieces of wood.","translation":"彼は2つの木材を接続するために、半分重ね継ぎを使用した。"}],"collocations":["half-lapped joint","half-lapped dovetail"],"synonyms":["overlapped","halved"],"antonyms":["butt joint","mortise and tenon"],"notes":["Typically used in woodworking."]},{"part_of_speech":"verb","definition":"(過去形・過去分詞)半分重ね継ぎする","english_definition":"(past tense/past participle) to join (two pieces of wood) by overlapping them, each having been cut away to half its thickness.","examples":[{"sentence":"The boards were carefully half-lapped to create a strong, seamless surface.","translation":"板は、丈夫で継ぎ目のない表面を作るために、注意深く半分重ね継ぎされた。"}],"collocations":[],"synonyms":["overlap","halve"],"antonyms":[],"notes":["Less common usage as a verb."]}],"etymology":{"value":"Derived from 'half' and 'lapped', referring to the process of overlapping two pieces of material, each reduced to half its thickness, to create a flush joint.","priority":"N/A"},"pronunciation":{"ipa":"/ˌhæfˈlæpt/","syllables":"half-lapped"},"inflection":{"verb_forms":{},"noun_plural":null},"usage_notes":{"explanation":"'Half-lapped' primarily describes a type of joint in woodworking where two pieces of wood are joined by overlapping, with each piece thinned to half its original thickness at the joint. This creates a strong, flush connection. It can also be used as a verb, although less commonly, to describe the act of creating such a joint.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["half-lap (noun): a half-lapped joint"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'half-lapped' is a technical term primarily used in woodworking. It describes a specific type of joint where two pieces of wood are overlapped, each having been reduced to half its thickness at the joint. Understanding this term requires some familiarity with woodworking techniques."},"example_sentences":[{"sentence":"The drawer was constructed using strong, half-lapped joints.","translation":"その引き出しは、丈夫な半分重ね継ぎで組み立てられた。","type":"adjective","meaning_category":"describing a joint"},{"sentence":"He carefully half-lapped the two pieces of wood together.","translation":"彼は2つの木材を注意深く半分重ね継ぎした。","type":"verb","meaning_category":"joining wood"}]}