{"word":"respirometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"呼吸測定器、呼吸計","english_definition":"An apparatus for measuring the rate of respiration of a living organism by measuring its rate of exchange of oxygen and/or carbon dioxide.","examples":[{"sentence":"The respirometer measured the oxygen consumption of the bacteria.","translation":"呼吸測定器は、バクテリアの酸素消費量を測定した。"},{"sentence":"Scientists use respirometers to study metabolic activity in cells.","translation":"科学者たちは呼吸測定器を使って細胞内の代謝活動を研究する。"}],"collocations":["measure respiration with a respirometer (呼吸測定器で呼吸を測定する)","use a respirometer to study metabolism (呼吸測定器を使って代謝を研究する)","a closed-system respirometer (閉鎖系呼吸測定器)","a differential respirometer (差動呼吸測定器)"],"synonyms":["metabolic apparatus","oxygen consumption meter","carbon dioxide production meter"],"antonyms":[]}],"etymology":{"value":"\"Respiro-\" (from respiration) + \"-meter\" (measuring device).","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈspaɪrɒmɪtər/","syllables":"re-spi-rom-e-ter"},"inflection":{"noun_plural":"respirometers"},"usage_notes":{"explanation":"A respirometer is a device used in biology and biochemistry to measure the rate of respiration of organisms or cells. It typically measures the consumption of oxygen or the production of carbon dioxide. Different types of respirometers exist, including closed-system and differential respirometers, each suited for specific experimental setups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The respirometer measures temperature.","correct":"✓ The respirometer measures respiration rate.","note":"Respirometers measure the rate of respiration, typically by measuring oxygen consumption or carbon dioxide production, not temperature directly."}],"priority":"★★☆"},"related_words":{"derivatives":["respiration","respiratory","metabolism","metabolic"],"related_terms":["Warburg respirometer","Gilson respirometer","oxygen electrode","carbon dioxide sensor"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'respirometer' is specialized and primarily used within scientific and technical contexts, specifically in fields like biology, biochemistry, and environmental science. It refers to a specific piece of equipment used for measuring respiration rates. Therefore, it's unlikely to be encountered in general conversation or non-technical writing. Understanding requires a foundation in scientific terminology and experimental procedures."},"example_sentences":[{"sentence":"The experiment involved using a respirometer to monitor the respiration of yeast cells under different conditions.","translation":"その実験では、さまざまな条件下での酵母細胞の呼吸を監視するために呼吸測定器を使用した。","type":"general","meaning_category":"measurement of respiration"},{"sentence":"A Warburg respirometer was used to determine the metabolic rate of the tissue sample.","translation":"組織サンプルの代謝率を決定するために、ワールブルク呼吸測定器が使用された。","type":"specific","meaning_category":"metabolic rate determination"}]}