{"word":"enumerability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"可算性、枚挙可能性","english_definition":"The property of being enumerable; the ability to be listed or counted.","examples":[{"sentence":"The enumerability of the set was proven by constructing a bijection with the natural numbers.","translation":"その集合の可算性は、自然数との全単射を構成することによって証明された。"},{"sentence":"The question of enumerability is crucial in determining the computability of a problem.","translation":"可算性の問題は、問題の計算可能性を決定する上で重要である。"}],"collocations":["degree of enumerability","proof of enumerability","demonstrate enumerability"],"synonyms":["countability","listability"],"antonyms":["unenumerability","uncountability"]}],"etymology":{"value":"From 'enumerable' + '-ity'. 'Enumerable' is derived from 'enumerate' + '-able'. 'Enumerate' comes from Latin 'enumerare' (to count out, reckon up).","priority":"★★☆"},"pronunciation":{"ipa":"ɪˌnjuːmərəˈbɪləti","syllables":"e-nu-mer-a-bil-i-ty"},"inflection":{"noun_plural":"enumerabilities (rarely used)"},"usage_notes":{"explanation":"'Enumerability' is a technical term primarily used in mathematics, logic, and computer science, particularly in the context of set theory and computability theory. It refers to whether the elements of a set can be listed, usually in a way that corresponds to the natural numbers. It's closely related to the concept of countability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The enumerability of the algorithm was high.","correct":"✓ The efficiency of the algorithm was high.","note":"'Enumerability' applies to sets or problems, not algorithms. Use 'efficiency' or 'performance' for algorithms."},{"incorrect":"✗ Enumerability is the same as computability.","correct":"✓ Enumerability is related to computability, but not the same.","note":"Enumerability refers to whether something can be listed, while computability refers to whether it can be calculated by an algorithm. They are related but distinct concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["enumerable","enumerate","enumeration","unenumerable"],"related_concepts":["countability","uncountability","computability","algorithm","set theory","Turing machine"],"priority":"★★★"},"level_frequency":{"level":"Advanced (Technical)","frequency_google_ngram":"Low frequency - Primarily used in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Enumerability' is a specialized term used in advanced mathematics, logic, and computer science. It describes whether the elements of a set can be listed in a systematic way, often corresponding to the natural numbers (1, 2, 3...). If a set is enumerable, it means you can create a list that includes every element of the set. This concept is crucial for understanding the limits of what can be computed or proven mathematically. It's often contrasted with 'uncountability,' which refers to sets that are too large to be listed in this way, such as the set of all real numbers."},"example_sentences":[{"sentence":"The enumerability of the language allows for systematic parsing and analysis.","translation":"その言語の可算性により、体系的な構文解析と分析が可能になる。","type":"noun","meaning_category":"可算性"},{"sentence":"Establishing the enumerability of a problem is a key step in determining its solvability.","translation":"問題の可算性を確立することは、その解決可能性を判断する上で重要なステップである。","type":"noun","meaning_category":"可算性"},{"sentence":"The concept of enumerability is fundamental to the theory of computation.","translation":"可算性の概念は、計算理論の基礎である。","type":"noun","meaning_category":"可算性"}]}