{"word":"preciousness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"貴重さ、大切さ、高価さ、可愛らしさ","english_definition":"the quality of being valuable, cherished, or expensive; also, the quality of being excessively refined or affected.","examples":[{"sentence":"The preciousness of the antique vase made everyone nervous.","translation":"そのアンティークの花瓶の貴重さが、皆を神経質にさせた。"},{"sentence":"She cherished the preciousness of their friendship.","translation":"彼女は彼らの友情の尊さを大切にした。"},{"sentence":"The preciousness of the moment was not lost on them.","translation":"その瞬間の大切さを、彼らは見逃さなかった。"},{"sentence":"The preciousness of the writing style made it difficult to understand.","translation":"その文章スタイルの気取りが、理解を困難にした。"}],"collocations":["inherent preciousness","relative preciousness","irreplaceable preciousness"],"synonyms":["value","worth","dearness","rarity","costliness","affectation","refinement"],"antonyms":["worthlessness","cheapness","commonness","vulgarity"]}],"etymology":{"value":"From 'precious' + '-ness'. 'Precious' comes from Old French 'precios' (valuable, costly; esteemed, dear) and directly from Latin 'pretiosus' (of great value, costly, precious), from 'pretium' (price, value).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpreʃəsnəs/","syllables":"pre-cious-ness"},"inflection":{"noun_plural":"preciousnesses (rarely used)"},"usage_notes":{"explanation":"'Preciousness' refers to the quality of something being highly valued, either for its material worth or its sentimental significance. It can also describe something excessively refined or affected, implying artificiality or pretentiousness. The context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The preciousness of the water in the desert can't be understated.","correct":"The value of the water in the desert can't be understated.","note":"While 'preciousness' could be used, 'value' is more common and straightforward in this context."},{"incorrect":"Her preciousness annoyed everyone.","correct":"Her pretentiousness annoyed everyone.","note":"When referring to affected behavior, 'pretentiousness' is often a more accurate and commonly used term than 'preciousness'."}],"priority":"★★☆"},"related_words":{"derivatives":["precious (adjective)","preciously (adverb)"],"phrases":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preciousness' is a relatively uncommon noun that describes the state or quality of being precious. It can refer to the high value or importance of something, or, more negatively, to an excessive refinement or affectation. Understanding the context is crucial to interpreting the intended meaning. It's more frequently encountered in formal writing or discussions about art, value, or social commentary."},"example_sentences":[{"sentence":"The museum carefully preserved the preciousness of the ancient artifacts.","translation":"博物館は古代の工芸品の貴重さを注意深く保存した。","type":"noun","meaning_category":"貴重さ・大切さ"},{"sentence":"The preciousness of her manners seemed out of place in the rustic setting.","translation":"彼女の気取った物腰は、田舎の環境には場違いに見えた。","type":"noun","meaning_category":"気取り・可愛らしさ"}]}