{"word":"latreutic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"of or pertaining to worship; specifically, rendering religious service or homage to God.","english_definition":"Of or pertaining to latreia; rendering religious service or homage to God.","examples":[{"sentence":"The latreutic adoration of the Eucharist is a central practice in the Catholic Church.","translation":"聖体の礼拝的崇拝はカトリック教会における中心的な実践です。"},{"sentence":"Latreutic worship is reserved solely for God.","translation":"礼拝的崇拝は神のみに捧げられます。"}],"collocations":["latreutic worship","latreutic adoration","latreutic service"],"synonyms":["adorational","reverential","devotional","worshipful"],"antonyms":["idolatrous","dulic","irreligious"]}],"etymology":{"value":"Derived from the Greek word 'latreia' (λατρεία), meaning worship, service, or adoration, especially that given to a god.","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈtruːtɪk/","syllables":"la-treu-tic"},"inflection":{"notes":"This word does not have common inflections as it is primarily an adjective."},"usage_notes":{"explanation":"'Latreutic' is a specialized theological term, primarily used within Christian theology, particularly in discussions about the types of worship or veneration due to God versus saints or other holy figures. It distinguishes the supreme adoration given to God (latreia) from the honor or reverence given to saints (dulia) or icons (veneration).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The latreutic icon was displayed.","correct":"✓ The icon received dulic veneration.","note":"Latreutic applies to worship of God, not veneration of icons. Icons receive dulic veneration."},{"incorrect":"✗ He offered latreutic prayers to the saint.","correct":"✓ He offered prayers of dulia to the saint.","note":"Latreutic prayer is reserved for God; saints receive dulic prayers."}],"priority":"★★☆"},"related_words":{"derivatives":["latreia (noun: Greek word for worship, service, or adoration given to God)","dulia (noun: veneration or honor given to saints)","hyperdulia (noun: special veneration given to the Virgin Mary)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Specialized theological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Latreutic' is a highly specialized term primarily used in theological contexts to describe the type of worship or adoration that is reserved solely for God. It is derived from the Greek word 'latreia,' which means worship or service given to a deity. The term is used to distinguish the supreme worship of God from the veneration or honor given to saints or other holy figures (dulia). Due to its specific and technical usage, it is not commonly encountered outside of religious or theological discussions."},"example_sentences":[{"sentence":"The distinction between dulia and latreutic adoration is crucial in Catholic theology.","translation":"ドゥーリア（崇敬）とラトリア（礼拝的崇拝）の区別は、カトリック神学において非常に重要です。","type":"adjective","meaning_category":"relating to worship of God"},{"sentence":"Only God is worthy of latreutic praise.","translation":"神のみが礼拝的賛美に値します。","type":"adjective","meaning_category":"relating to worship of God"}]}