{"word":"Arcturia","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(架空の場所)アークトゥリア：主にファンタジーやサイエンスフィクション作品に登場する、架空の惑星、星系、または国。","english_definition":"(fictional place) Arcturia: A fictional planet, star system, or country, primarily appearing in fantasy or science fiction works.","examples":[{"sentence":"The protagonist journeyed to Arcturia in search of a legendary artifact.","translation":"主人公は伝説のアーティファクトを探してアークトゥリアへ旅立った。"},{"sentence":"Arcturia is known for its advanced technology and unique culture.","translation":"アークトゥリアはその高度な技術と独特の文化で知られている。"}],"collocations":["journey to Arcturia (アークトゥリアへの旅)","the people of Arcturia (アークトゥリアの人々)","Arcturian technology (アークトゥリアの技術)","Arcturian civilization (アークトゥリア文明)"],"synonyms":["(related fictional places) Eldoria, Xylos, Zephyrion"],"antonyms":[]}],"etymology":{"value":"「Arcturia」という名前の由来は明確には特定されていませんが、多くの場合、北の空で明るく輝く恒星「アークトゥルス（Arcturus）」にインスパイアされたものと考えられます。アークトゥルスは、うしかい座で最も明るい星であり、全天でも４番目に明るい恒星です。ファンタジーやSF作品において、神秘的で遠い場所の名前として、アークトゥルスの名前を連想させる「アークトゥリア」が用いられることがあります。","priority":"★☆☆"},"pronunciation":{"ipa":"/ɑːrkˈtʊəriə/","syllables":"Arc-tu-ri-a"},"inflection":{"notes":"固有名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**Arcturia**」は、特定の作品に登場する架空の場所の名前として使われることがほとんどです。そのため、一般的な語彙というよりは、作品固有の名称として理解する必要があります。作品によっては、惑星、星系、国、あるいは文化圏などを指す場合があります。アークトゥリアが登場する作品を知らない人には意味が通じない可能性があるため、使用する際には文脈を明確にするか、作品名を明示すると良いでしょう。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to visit Arcturia next year.","correct":"✓ I want to visit Arcturia next year, according to the science fiction novel.","note":"アークトゥリアは実在の場所ではないため、SF小説の設定であることを明示すると、誤解を避けることができます。"},{"incorrect":"✗ Arcturia is a real planet.","correct":"✓ Arcturia is a fictional planet in the story.","note":"アークトゥリアが架空の場所であることを明確にすることが重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Arcturian (形容詞: アークトゥリアの、アークトゥリア人の；名詞: アークトゥリア人)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (架空の地名のため)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特定のフィクション作品内でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"「**Arcturia**」は、特定のファンタジーやSF作品に登場する架空の地名です。一般的な単語ではないため、英語学習者が日常的に使用する機会はほとんどありません。作品の文脈においてのみ意味を持つため、作品を知らない人には理解されにくい可能性があります。使用する際には、それが架空の場所であることを明示するか、作品名を添えることが推奨されます。"},"example_sentences":[{"sentence":"The map showed the location of Arcturia in a distant galaxy.","translation":"その地図は、遠い銀河におけるアークトゥリアの位置を示していた。","type":"proper noun","meaning_category":"架空の場所"},{"sentence":"The Arcturian ambassador arrived to negotiate a trade agreement.","translation":"アークトゥリアの大使が貿易協定の交渉のために到着した。","type":"proper noun","meaning_category":"架空の場所"},{"sentence":"Legends say that Arcturia was once a paradise.","translation":"伝説によれば、アークトゥリアはかつて楽園だったという。","type":"proper noun","meaning_category":"架空の場所"}]}