{"word":"nonreproduction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非繁殖、非生殖、複製不能","english_definition":"The failure or inability to reproduce; the state of not being reproduced.","examples":[{"sentence":"The experiment resulted in nonreproduction of the original data.","translation":"その実験は、元のデータの非複製という結果になった。"},{"sentence":"The species faces extinction due to nonreproduction.","translation":"その種は、非繁殖のために絶滅の危機に瀕している。"},{"sentence":"The contract includes a clause regarding nonreproduction of the copyrighted material.","translation":"その契約には、著作権で保護された素材の複製不能に関する条項が含まれている。"}],"collocations":["data nonreproduction","material nonreproduction","species nonreproduction"],"synonyms":["sterility","infertility","replication failure","failure to reproduce"],"antonyms":["reproduction","replication","propagation"]}],"etymology":{"value":"\"non-\" (否定) + \"reproduction\" (繁殖、複製)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌriːprəˈdʌkʃən/","syllables":"non-re-pro-duc-tion"},"inflection":{"noun_plural":"nonreproductions"},"usage_notes":{"explanation":"\"Nonreproduction\" refers to the lack of reproduction, whether in a biological sense (infertility, sterility) or in a technical sense (failure to replicate data or materials). It is often used in scientific, legal, or technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonreproduction of the animal was a surprise.","correct":"✓ The lack of reproduction of the animal was a surprise.","note":"While 'nonreproduction' is correct, 'lack of reproduction' might sound more natural in some contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["reproduction","reproduce","non-","anti-"],"phrases":["asexual nonreproduction"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"nonreproduction\" is relatively uncommon and is used in specialized contexts, particularly in scientific and legal fields. It refers to the absence or failure of reproduction, whether biological or technical. Understanding the word requires familiarity with the prefix \"non-\" (meaning \"not\") and the word \"reproduction.\""},"example_sentences":[{"sentence":"The study focused on the causes of nonreproduction in the endangered species.","translation":"その研究は、絶滅危惧種における非繁殖の原因に焦点を当てた。","type":"general"},{"sentence":"The software license agreement strictly prohibits nonreproduction of the program.","translation":"そのソフトウェアライセンス契約は、プログラムの複製不能を厳格に禁じている。","type":"technical"},{"sentence":"The low birth rate is a major factor contributing to population decline, leading to nonreproduction on a societal scale.","translation":"出生率の低下は、人口減少の主な要因であり、社会規模での非繁殖につながっている。","type":"societal"}]}