{"word":"illatives","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(文法) 向格 (ある場所への移動や進入を示す格)","english_definition":"(grammar) the illative case (a grammatical case that indicates movement into or onto something).","examples":[{"sentence":"In Finnish, the illative case is used to express entering a place.","translation":"フィンランド語では、向格はある場所に入ることを表すために使われる。"}],"collocations":[],"synonyms":["inessive","elative","allative","ablative"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'illatus', the past participle of 'inferre', meaning 'to bring in, carry in'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪlətɪvz/","syllables":"il-la-tives"},"inflection":{"noun_plural":"illatives"},"usage_notes":{"explanation":"The term 'illative' is primarily used in the context of linguistics, specifically when discussing case systems in languages like Finnish, Estonian, and Lithuanian. It indicates motion into a location.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the illative to describe being inside the house.","correct":"✓ He used the inessive to describe being inside the house.","note":"The illative describes motion *into* a place, while the inessive describes being *inside* a place."}],"priority":"★★☆"},"related_words":{"derivatives":["illative (adjective)"],"phrasal_verbs":[],"related_terms":["case","grammar","linguistics","declension","inflection","inessive","elative","allative","ablative"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'illative' is a technical term used in linguistics to describe a specific grammatical case. Understanding and use of this term is generally limited to those with advanced knowledge of grammar and linguistics, particularly those studying languages with complex case systems. It's unlikely to be encountered in general English usage. The illative case signifies movement into or onto something, contrasting with other cases that indicate location, origin, or direction."},"example_sentences":[{"sentence":"The Finnish illative case is formed by adding '-Vn' to the stem, where V is a vowel that harmonizes with the stem.","translation":"フィンランド語の向格は、語幹に「-Vn」を加えることによって形成され、ここでVは語幹と調和する母音である。","type":"grammatical example","meaning_category":"grammar"},{"sentence":"In Estonian, the illative case often implies a more profound or lasting entry than simply physical movement.","translation":"エストニア語では、向格はしばしば単なる物理的な移動よりも、より深遠または永続的な進入を意味する。","type":"linguistic explanation","meaning_category":"grammar"},{"sentence":"The use of the illative case can sometimes be metaphorical, indicating a transition into a new state or condition.","translation":"向格の使用は、新しい状態または条件への移行を示す比喩的な意味を持つことがある。","type":"linguistic explanation","meaning_category":"grammar"}]}