{"word":"Poonga","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional or invented word.","english_definition":"A made-up word; a word with no established meaning or origin.","examples":[{"sentence":"The child used 'poonga' to describe the imaginary creature.","translation":"その子供は想像上の生き物を説明するために「poonga」という言葉を使った。"},{"sentence":"Is 'poonga' a real word, or did you just invent it?","translation":"「poonga」は実在する言葉ですか、それともあなたが作ったのですか？"}],"collocations":["make up a poonga","invent a poonga"],"synonyms":["nonce word","neologism","made-up word"],"antonyms":["real word","established word"]}],"etymology":{"value":"Likely an invented word, possibly originating from playful speech or children's language.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpuːŋɡə/","syllables":"poon-ga"},"inflection":{"noun_plural":"poongas"},"usage_notes":{"explanation":"'Poonga' is typically used humorously or informally to refer to a word that is obviously not part of standard vocabulary. It can be used to playfully challenge the validity of a word or to describe a word created for a specific, often temporary, purpose.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poonga is defined in the dictionary.","correct":"✓ The word is not defined in the dictionary because it's a poonga.","note":"'Poonga' itself would not be in a dictionary, as it is a made-up word."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely not found in standard corpora.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Poonga' is a hypothetical word used to describe other hypothetical or invented words. Its usage requires an understanding of word formation and vocabulary concepts, making it suitable for advanced learners who are familiar with linguistic terminology. The word itself is not commonly encountered, but the concept it represents is relevant to discussions about language and vocabulary. "},"example_sentences":[{"sentence":"That sounds like a 'poonga' to me; I've never heard of it.","translation":"それは私には「poonga」のように聞こえます。聞いたことがありません。","type":"noun","meaning_category":"invented word"},{"sentence":"He dismissed the complex term as just another 'poonga' made up by academics.","translation":"彼はその複雑な用語を、学者たちが作った別の「poonga」にすぎないと一蹴した。","type":"noun","meaning_category":"invented word"}]}