{"word":"humanitarianist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"人道主義者、博愛主義者","english_definition":"A person actively concerned in promoting human welfare, especially through philanthropic or charitable activity.","examples":[{"sentence":"She is a dedicated humanitarianist, working to alleviate poverty and suffering around the world.","translation":"彼女は献身的な人道主義者で、世界中の貧困と苦しみを軽減するために活動しています。"},{"sentence":"As a humanitarianist, he believes in providing aid to all those in need, regardless of their background.","translation":"人道主義者として、彼は背景に関係なく、困っているすべての人に援助を提供することを信じています。"}],"collocations":["dedicated humanitarianist","leading humanitarianist","international humanitarianist","local humanitarianist"],"synonyms":["philanthropist","altruist","benefactor","do-gooder","charitarian"],"antonyms":["misanthrope","egoist","selfish person"]}],"etymology":{"value":"The word is derived from 'humanitarian,' which itself comes from the Latin word 'humanitas,' meaning 'human nature, kindness.' The suffix '-ist' is added to denote a person who believes in or practices something.","priority":"★★☆"},"pronunciation":{"ipa":"/hjuːˌmænɪˈtɛəriənɪst/","syllables":"hu-man-i-tar-i-an-ist"},"inflection":{"noun_plural":"humanitarianists"},"usage_notes":{"explanation":"The term 'humanitarianist' is used to describe someone who is actively involved in humanitarian work. It emphasizes the practical application of humanitarian principles through actions and initiatives aimed at improving the lives of others. It is often used interchangeably with 'humanitarian,' but 'humanitarianist' can sometimes imply a more active or activist role.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a humanitarianist organization.","correct":"✓ He is a member of a humanitarian organization.","note":"'Humanitarianist' refers to a person, not an organization. Use 'humanitarian' to describe the organization."},{"incorrect":"✗ She practices humanitarianism, so she is a humanitarian.","correct":"✓ She practices humanitarianism, so she is a humanitarianist.","note":"While 'humanitarian' and 'humanitarianist' are often used interchangeably, 'humanitarianist' emphasizes active involvement and practice of humanitarian principles."}],"priority":"★★☆"},"related_words":{"derivatives":["humanitarian (adjective, noun)","humanitarianism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'humanitarianist' describes someone who actively works to improve the lives of others, especially through charity or aid. It's a more specific term than just 'humanitarian,' suggesting someone who is deeply involved in humanitarian efforts. This word is not as common as 'humanitarian' or 'humanitarianism,' so it's more likely to be encountered in formal or academic contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The conference brought together leading humanitarianists from around the globe.","translation":"その会議には、世界中から主要な人道主義者が集まりました。","type":"noun","meaning_category":"人道主義者"},{"sentence":"As a dedicated humanitarianist, she spent years working in refugee camps.","translation":"献身的な人道主義者として、彼女は何年も難民キャンプで働いていました。","type":"noun","meaning_category":"人道主義者"},{"sentence":"His work as a doctor in underserved communities made him a well-respected humanitarianist.","translation":"恵まれない地域での医師としての彼の活動は、彼を尊敬される人道主義者にしました。","type":"noun","meaning_category":"人道主義者"}]}