{"word":"foremartyr","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"最初の殉教者、先駆的な殉教者","english_definition":"The first martyr in a particular cause or belief.","examples":[{"sentence":"Saint Stephen is considered the foremartyr of the Christian faith.","translation":"聖ステパノはキリスト教信仰の最初の殉教者とみなされている。"},{"sentence":"He became a foremartyr for the cause of freedom of speech.","translation":"彼は言論の自由という大義のための先駆的な殉教者となった。"}],"collocations":["be the foremartyr of","considered a foremartyr"],"synonyms":["protomartyr","pioneer martyr"],"antonyms":[]}],"etymology":{"value":"'Fore-' (before) + 'martyr' (one who is killed for their beliefs).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːrˈmɑːrtər/","syllables":"fore-mar-tyr"},"inflection":{"noun_plural":"foremartyrs"},"usage_notes":{"explanation":"'Foremartyr' is a relatively rare word, primarily used in religious or historical contexts to denote the first person to be martyred for a specific belief or cause. It emphasizes the pioneering nature of their sacrifice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a foremartyr of the war.","correct":"✓ He was a casualty of the war.","note":"'Foremartyr' specifically refers to someone who dies for their beliefs, not just any casualty of war."}],"priority":"★★☆"},"related_words":{"derivatives":["martyr","martyrdom"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'foremartyr' is a specialized term primarily encountered in religious or historical texts. Understanding requires knowledge of the concept of martyrdom and the prefix 'fore-' indicating 'before' or 'first'. Its usage is limited to contexts where the pioneering aspect of a martyr's sacrifice is emphasized."},"example_sentences":[{"sentence":"The early Christians revered Saint Lawrence as a foremartyr of their faith.","translation":"初期のキリスト教徒は、聖ラウレンスを彼らの信仰の最初の殉教者として崇拝した。","type":"noun","meaning_category":"First Martyr"},{"sentence":"Many consider Joan of Arc a foremartyr for French nationalism.","translation":"多くの人がジャンヌ・ダルクをフランスのナショナリズムの最初の殉教者とみなしている。","type":"noun","meaning_category":"Pioneer Martyr"}]}