{"word":"anathematical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"破門の、のろいの、忌むべき","english_definition":"relating to or involving a solemn curse; cursed; detestable.","examples":[{"sentence":"The heretic's views were considered anathematical by the church.","translation":"その異端者の見解は教会によって破門に値するとみなされた。"},{"sentence":"Such practices are anathematical to the principles of justice.","translation":"そのような慣習は正義の原則に反し、忌むべきものである。"}],"collocations":["anathematical doctrine","anathematical practices","anathematical views"],"synonyms":["accursed","damned","execrable","abominable","detestable"],"antonyms":["blessed","hallowed","venerable"]}],"etymology":{"value":"Late Latin *anathematicus*, from Greek *anathematikos*, pertaining to anathema.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈθɛmətɪkəl/","syllables":"a-na-them-a-ti-cal"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparative/superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"'Anathematical' is a formal and somewhat archaic term, primarily used in religious or philosophical contexts to describe something that is strongly condemned or considered heretical. It implies a severe and formal denunciation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was anathematical.","correct":"✓ The movie was objectionable.","note":"'Anathematical' is a strong term, usually reserved for serious religious or moral condemnations. 'Objectionable' is more appropriate for general disapproval."}],"priority":"★☆☆"},"related_words":{"derivatives":["anathema (noun: a formal curse by a pope or a council of the Church, excommunicating a person or denouncing a doctrine.)","anathematize (verb: to pronounce an anathema against; to curse or denounce.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'anathematical' is a highly formal and uncommon term. It is typically encountered in theological, philosophical, or historical texts dealing with religious condemnations or strong moral objections. Understanding requires familiarity with the concept of 'anathema' and its historical significance."},"example_sentences":[{"sentence":"The council declared the new teachings anathematical.","translation":"その会議は新しい教えを破門に値すると宣言した。","type":"adjective","meaning_category":"破門の"},{"sentence":"Racism is anathematical to a just society.","translation":"人種差別は公正な社会にとって忌むべきものである。","type":"adjective","meaning_category":"忌むべき"}]}