{"word":"Hypertensives","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"降圧剤（高血圧治療薬）","english_definition":"Drugs used to treat hypertension (high blood pressure).","examples":[{"sentence":"The doctor prescribed hypertensives to lower his blood pressure.","translation":"医師は彼の血圧を下げるために降圧剤を処方した。"},{"sentence":"Regular use of hypertensives can reduce the risk of heart attack and stroke.","translation":"降圧剤の定期的な使用は、心臓発作や脳卒中のリスクを軽減することができる。"}],"collocations":["antihypertensive drugs","blood pressure medication","ACE inhibitors","beta-blockers","calcium channel blockers","diuretics"],"synonyms":["antihypertensive drugs","blood pressure lowering medications"],"antonyms":["pressor agents"],"notes":"'Hypertensives' is the plural form. The singular form is 'hypertensive', which can be used as a noun (referring to a single drug) or an adjective (describing something related to hypertension)."}],"etymology":{"value":"Derived from 'hypertension' (high blood pressure) and the suffix '-ive', indicating an agent or substance that acts against hypertension.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈtɛnsɪvz/","syllables":"hy-per-ten-sives"},"inflection":{"noun_plural":"hypertensives"},"usage_notes":{"explanation":"'Hypertensives' specifically refers to medications designed to lower blood pressure. It's a technical term commonly used in medical contexts. When discussing a specific type of medication, it's more common to use the specific drug class name (e.g., ACE inhibitors, beta-blockers).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is taking hypertensive for his high blood pressure.","correct":"✓ He is taking hypertensives for his high blood pressure.","note":"'Hypertensive' (singular) can be used as an adjective, but when referring to the medication itself, especially multiple drugs, use the plural 'hypertensives'."},{"incorrect":"✗ Hypertensives are a cure for hypertension.","correct":"✓ Hypertensives help manage hypertension.","note":"Hypertensives manage high blood pressure but do not cure hypertension. Hypertension is often a chronic condition requiring ongoing management."}],"priority":"★★☆"},"related_words":{"derivatives":["hypertension (高血圧)","hypotension (低血圧)","antihypertensive (降圧剤の)"],"phrases":["blood pressure","cardiovascular health","stroke prevention","heart attack prevention"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypertensives' is a technical term used in medicine to describe drugs that lower high blood pressure (hypertension). It is primarily encountered in medical literature, discussions with healthcare professionals, or when reading about health-related topics. Understanding this term is essential for individuals managing hypertension or those in the medical field.","priority":"★★★"},"example_sentences":[{"sentence":"The doctor adjusted the dosage of her hypertensives to better control her blood pressure.","translation":"医師は彼女の血圧をより良くコントロールするために、彼女の降圧剤の投与量を調整した。","type":"noun","meaning_category":"高血圧治療薬"},{"sentence":"Lifestyle changes, combined with hypertensives, can significantly improve cardiovascular health.","translation":"生活習慣の改善と降圧剤の組み合わせは、心血管の健康を大幅に改善することができる。","type":"noun","meaning_category":"高血圧治療薬"},{"sentence":"Patients taking hypertensives should monitor their blood pressure regularly.","translation":"降圧剤を服用している患者は、定期的に血圧をモニタリングする必要がある。","type":"noun","meaning_category":"高血圧治療薬"}]}